// Модуль основной формы документа "Акт постановки на баланс"
&НаКлиенте
перем ШтрихКодДляПоиска;

&НаКлиенте
Перем УдаляемыеСтроки; // Для удаления акцизных марок

&НаКлиенте
Перем КоличествоУдаленныхМарок; // Для удаления акцизных марок

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

#Область Статус

&НаСервере
Процедура ОбновитьСтатусОбработки()
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	
	ИмяДокумента    = Объект.Ссылка.Метаданные().Имя;
	СтатусПоУмолчанию = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработкиПоУмолчанию(ИмяДокумента);
	СтатусОбработки    = СтатусПоУмолчанию.СтатусОбработки;
	ДальнейшееДействие = СтатусПоУмолчанию.ДальнейшееДействие;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Статусы.СтатусОбработки КАК СтатусОбработки,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие1 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияЕГАИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие1
		|	КОНЕЦ КАК ДальнейшееДействие1,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие2 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияЕГАИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие2
		|	КОНЕЦ КАК ДальнейшееДействие2,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие3 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияЕГАИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие3
		|	КОНЕЦ КАК ДальнейшееДействие3
		|ИЗ
		|	РегистрСведений.СтатусыДокументовЕГАИС КАК Статусы
		|ГДЕ
		|	Статусы.Документ = &Документ";
		
		Запрос.УстановитьПараметр("Документ",                 Объект.Ссылка);
		Запрос.УстановитьПараметр("МассивДальнейшиеДействия", ИнтеграцияЕГАИС.НеотображаемыеВДокументахДальнейшиеДействия());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СтатусОбработки = Выборка.СтатусОбработки;
			ДальнейшееДействие = Новый Массив;
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие1);
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие2);
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие3);
		КонецЕсли;
		
	КонецЕсли;
	
	ДопустимыеДействия = Новый Массив;
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.СгенерируйтеКодыУпаковок);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗавершитеФормированиеГрупповойТары);
	//ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
	//ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеПередачуДанных);
	СтатусОбработкиПредставление = ИнтеграцияЕГАИС.ПредставлениеСтатусаОбработки(
		СтатусОбработки,
		ДальнейшееДействие,
		ДопустимыеДействия);
	
КонецПроцедуры

//&НаСервере
//Функция ПолучитьНачальныйНомерУпаковки()
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//	|	ТаблицаУпаковки.МаркировкаУпаковки КАК МаркировкаУпаковки
//	|ИЗ
//	|	Документ.ФормированиеГрупповойТарыЕГАИС.Упаковки КАК ТаблицаУпаковки
//	|ГДЕ
//	|	ТаблицаУпаковки.Ссылка.ОрганизацияЕГАИС = &ОрганизацияЕГАИС И 
//	|	НАЧАЛОПЕРИОДА(ТаблицаУпаковки.Ссылка.Дата, ГОД) = &ГодДокумента
//	|УПОРЯДОЧИТЬ ПО
//	|	МаркировкаУпаковки УБЫВ
//	|";
//	
//	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", Объект.ОрганизацияЕГАИС);
//	Запрос.УстановитьПараметр("ГодДокумента",     Год(Объект.Дата));
//	
//	Результат = Запрос.Выполнить();
//	Выборка = Результат.Выбрать();
//	
//	Если Выборка.Следующий() Тогда
//		Если Выборка.МаркировкаУпаковки = Null Тогда
//			ПоследнийНомер = 0;
//		Иначе
//			ПоследнийНомер = Число(Прав(Выборка.МаркировкаУпаковки, 9));
//		КонецЕсли;
//	Иначе
//		ПоследнийНомер = 0;
//	КонецЕсли;
//	
//	НовоеЗначениеСчетчика = ПоследнийНомер + 1;
//	
//	Возврат НовоеЗначениеСчетчика;
//	
//КонецФункции

&НаСервере
Функция ПолучитьНачальныйНомерТары(ТипЛогЕдиницы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаУпаковки.МаркировкаГруппыУпаковок КАК МаркировкаГруппыУпаковок
	|ПОМЕСТИТЬ
	|	ТаблицаУпаковки
	|ИЗ
	|	&Упаковки КАК ТаблицаУпаковки
	|ГДЕ
	|	ТаблицаУпаковки.ТипЛогЕдиницы = &ТипЛогЕдиницы
	|;
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаУпаковки.МаркировкаГруппыУпаковок) КАК МаркировкаГруппыУпаковок
	|ИЗ
	|	Документ.ФормированиеГрупповойТарыЕГАИС.Упаковки КАК ТаблицаУпаковки
	|ГДЕ
	|	ТаблицаУпаковки.Ссылка.ОрганизацияЕГАИС = &ОрганизацияЕГАИС И 
	|	НАЧАЛОПЕРИОДА(ТаблицаУпаковки.Ссылка.Дата, ГОД) = &ГодДокумента И 
	|	ТаблицаУпаковки.ТипЛогЕдиницы = &ТипЛогЕдиницы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаУпаковки.МаркировкаГруппыУпаковок) КАК МаркировкаГруппыУпаковок
	|ИЗ
	|	ТаблицаУпаковки КАК ТаблицаУпаковки
	|";
	
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", Объект.ОрганизацияЕГАИС);
	Запрос.УстановитьПараметр("ГодДокумента",     НачалоГода(Объект.Дата));
	Запрос.УстановитьПараметр("Упаковки",         Объект.Упаковки.Выгрузить());
	Запрос.УстановитьПараметр("ТипЛогЕдиницы",    ТипЛогЕдиницы);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.МаркировкаГруппыУпаковок = Null Тогда
			ПоследнийНомер = 0;
		Иначе
			ПоследнийНомер = Число(Прав(Выборка.МаркировкаГруппыУпаковок, 9));
		КонецЕсли;
	Иначе
		ПоследнийНомер = 0;
	КонецЕсли;
	
	НовоеЗначениеСчетчика = ПоследнийНомер + 1;
	
	Возврат НовоеЗначениеСчетчика;
	
КонецФункции

&НаСервере
Процедура СоздатьНомераУпаковок()
	
	НомерЛинии    = "02";
	ИдОрганизации = Прав("000000000000" + СокрЛП("" + Объект.ОрганизацияЕГАИС.Код), 12);
	ТипЛогЕдиницы = 1;
	ТекущийГод    = Формат(Объект.Дата,"ДФ=yy");
	
	НомерЛинии = Прав("00" + СокрЛП("" + НомерЛинии), 2);
	ТекущийГод = Прав("00" + СокрЛП("" + ТекущийГод), 2);
	
	ПрефиксМаркировки = ИдОрганизации + Строка(ТипЛогЕдиницы) + НомерЛинии + ТекущийГод;
	
	НомерУпаковки = ПолучитьНачальныйНомерТары(ТипЛогЕдиницы);
	
	Объект.Упаковки.Очистить();
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Если ТекущаяСтрока.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(ТекущаяСтрока.ИдентификаторСтроки) Тогда
			Продолжить;
		КонецЕсли;
		
		Счетчик = 0;
		КоличествоСтрок = ТекущаяСтрока.Количество;
		Пока Счетчик < ТекущаяСтрока.Количество Цикл
			МаркировкаУпаковки = ПрефиксМаркировки + Прав("000000000" + Формат(НомерУпаковки, "ЧГ=0"), 9);
			
			НоваяСтрока = Объект.Упаковки.Добавить();
			НоваяСтрока.ИдентификаторСтроки      = ТекущаяСтрока.ИдентификаторСтроки;
			НоваяСтрока.МаркировкаГруппыУпаковок = МаркировкаУпаковки;
			НоваяСтрока.МаркировкаУпаковки       = МаркировкаУпаковки;
			НоваяСтрока.ТипЛогЕдиницы            = ТипЛогЕдиницы;
			НоваяСтрока.УровеньВложенности       = 1;
			
			Счетчик       = Счетчик + 1;
			НомерУпаковки = НомерУпаковки + 1;
		КонецЦикла;
		
	КонецЦикла;
	
	Записать();
	
	ВывестиВеткуУпаковок();
	
	ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(Объект.Ссылка);
	ТекущееСостояние.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияЕГАИС.ЗавершитеФормированиеГрупповойТары;
	ТекущееСостояние.ВидСтатуса          = Перечисления.ВидыСтатусовОбработкиЕГАИС.УпаковкаКоробок;
	ТекущееСостояние.СтатусОбработки     = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработки(Объект.Ссылка.Метаданные(), ТекущееСостояние.ВидСтатуса);
	
	РегистрыСведений.СтатусыДокументовЕГАИС.ВыполнитьЗаписьВРегистр(ТекущееСостояние);
	
	ОбновитьСтатусОбработки();
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьУпаковку()
	
	ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(Объект.Ссылка);
	ТекущееСостояние.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется;
	ТекущееСостояние.ВидСтатуса          = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗавершеноФормированиеГрупповойТары;
	ТекущееСостояние.СтатусОбработки     = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработки(Объект.Ссылка.Метаданные(), ТекущееСостояние.ВидСтатуса);
	
	РегистрыСведений.СтатусыДокументовЕГАИС.ВыполнитьЗаписьВРегистр(ТекущееСостояние);
	
	ОбновитьСтатусОбработки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "СгенерируйтеКодыУпаковок" Тогда
		
		Если Объект.Товары.Количество() = 0 Тогда
			ВывестиСообщение("Не заполнены товарные позиции");
			Возврат;
		КонецЕсли;
		
		Если Объект.Товары.Итог("Количество") = 0 Тогда
			ВывестиСообщение("Не задано количество упаковок");
			Возврат;
		КонецЕсли;
		
		Если Объект.Товары.Итог("КоличествоБазовое") = 0 Тогда
			ВывестиСообщение("Не задано количество марок");
			Возврат;
		КонецЕсли;
		
		СоздатьНомераУпаковок();
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ЗавершитеФормированиеГрупповойТары" Тогда
		
		//ИнтеграцияЕГАИСКлиент.ПодготовитьКПередаче(
		//	Объект.Ссылка,
		//	ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения"),
		//	ЭтотОбъект.УникальныйИдентификатор);
		ЗавершитьУпаковку();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбработкиОбработкаНавигационнойСсылкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверитьЗаполнение() Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
	КонецЕсли;
	
	Если Не Модифицированность И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбработатьНажатиеНавигационнойСсылки(ДополнительныеПараметры.НавигационнаяСсылкаФорматированнойСтроки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	//ВключенЗапретИзмененияПроведённых = НЕ обПраво("РедактированиеПроведенныхДокументов",ДокументОбъект.Права);
	//ЭлементыФормы.ДействияФормы.Кнопки.ПередатьДанныеВЕГАИС.Доступность = (ДокументОбъект.Статус = Справочники.СтатусыОбработкиЕГАИС.ГотовКОтправке) И НЕ (ФормаДокумента.ТолькоПросмотр И НЕ ВключенЗапретИзмененияПроведённых);
	
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

&НаСервере
Процедура ОбновитьПредставленияНаФорме(Прочитать = Ложь)
	
	Если Прочитать Тогда
		Прочитать();
	Иначе
		ОбновитьСтатусОбработки();
	КонецЕсли;
	
	//ОбновитьИнформациюОткрытияФормыСканирования();
	//УправлениеДоступностьюЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформлениеПредставлениеМарок(ЭтотОбъект);
//	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформлениеАлкогольнаяПродукция(ЭтотОбъект);
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
// Параметры:
//  ИмяСобытия - Строка - Имя события, при работе которого необходимо проверить блокировку.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	//Сформирован = НЕ (Документы.ФормированиеГрупповойТарыЕГАИС.ВидыСтатусовДвижений().Найти(СтатусОбработки) = Неопределено);
	//ЭлементыФомы = ";СтраницаДополнительно, Шапка";
	//СписокРеквизитов.Добавить("Марки", "Марки",Сформирован);
	//СписокРеквизитов.Добавить("Товары","Товары",Сформирован);
	//СписокРеквизитов.Добавить(ЭлементыФомы, ЭлементыФомы,Сформирован);
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события нажатия кнопки "Подбор номенклатуры".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомКлиент.ОткрытьПодборНоменклатуры(ЭтотОбъект, Истина);
	
КонецПроцедуры // ПодборНоменклатуры()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыЕГАИС.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	ОбновитьСтатусОбработки();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыЕГАИС.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыЕГАИС.ТоварыНоменклатураПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	// Вызываем общий обработчик изменения реквизитов формы
	УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(ЭтотОбъект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыНоменклатураПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыНоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Характеристика номенклатуры" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыЕГАИС.ТоварыХарактеристикаНоменклатурыПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Характеристика номенклатуры".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЕдиницаИзмеренияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыЕГАИС.ТоварыЕдиницаИзмеренияПриИзменении(Объект, ТекущиеДанные);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Единица измерения".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЕдиницаИзмеренияПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество базовое" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыКоличествоБазовоеПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыЕГАИС.ТоварыКоличествоБазовоеПриИзменении(Объект, ТекущиеДанные);
	
КонецПроцедуры // ТоварыКоличествоБазовоеПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество базовое".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыКоличествоБазовоеПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыКоличествоБазовоеПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыКоличествоБазовоеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыКоличествоПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыЕГАИС.ТоварыКоличествоПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыКоличествоПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыКоличествоПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыКоличествоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Алкогольная продукция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыАлкогольнаяПродукцияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	ПараметрыДействия = Новый Структура;
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыЕГАИС.ТоварыАлкогольнаяПродукцияПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ИзмениласьНоменклатура", Ложь) Тогда
		ТоварыНоменклатураПриИзмененииНаСервере(ПараметрыДействия);
	КонецЕсли;

КонецПроцедуры // ТоварыАлкогольнаяПродукцияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Алкогольная продукция".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыАлкогольнаяПродукцияПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыАлкогольнаяПродукцияПриИзмененииНаСервере();
	
КонецПроцедуры //ТоварыАлкогольнаяПродукцияПриИзменении()

// Обработчик события возникающего на клиенте  в момент нажатия кнопки выбора или клавиши F4 реквизита "Алкогольная продукция".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыАлкогольнаяПродукцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыАлкогольнаяПродукцияНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры //ТоварыАлкогольнаяПродукцияНачалоВыбора()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"


// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры // ТоварыПередНачаломДобавления()

// Обработчик события возникающего на клиенте перед началом интерактивного изменения строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередНачаломИзменения()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	УдаляемыеСтроки = Новый Массив;
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередУдалением(ЭтотОбъект, Элемент, Отказ, УдаляемыеСтроки);
	
КонецПроцедуры // ТоварыПередУдалением()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПриОкончанииРедактирования(ЭтотОбъект, Элемент, НоваяСтрока, ОтменаРедактирования,,, "");
		
КонецПроцедуры // ТоварыПриОкончанииРедактирования()

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
&НаСервере
Процедура ТоварыПослеУдаленияНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ТоварыПослеУдаления(ЭтотОбъект, Элементы.Товары, ПараметрыДействия);
	
КонецПроцедуры // ТоварыПослеУдаленияНаСервере()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("УдаляемыеСтрокиМарки",УдаляемыеСтроки);
	
	// Обработаем событие в контексте сервера
	ТоварыПослеУдаленияНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ТоварыПослеУдаления()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                        - Строка таблицы, над которой находится курсор.
//  Поле                          - Элемент управляемой формы, с которым связана данная колонка таблицы.
//
&НаКлиенте
Процедура ТоварыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // ТоварыПроверкаПеретаскивания()

// Обработчик события возникающего на клиенте при начале редактирования строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока - Булево - Признак редактирования новой строки.
//  Копирование - Булево - Определяет режим копирования.
//
&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элементы.Товары.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры // ТоварыПриНачалеРедактирования()

//&НаСервере
//Процедура ЗаполнитьВеткуУпаковками(СтрокиУпаковок, ТекущиеДанные)
//	
//	МассивУпаковок = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, МаркировкаГруппыУпаковок", ТекущиеДанные.ИдентификаторСтроки, ТекущиеДанные.МаркировкаУпаковки));
//	Для Каждого ТекущаяСтрока Из МассивУпаковок Цикл
//		НоваяУпаковка = СтрокиУпаковок.Добавить();
//		НоваяУпаковка.МаркировкаУпаковки = ТекущаяСтрока.МаркировкаУпаковки;
//		ЗаполнитьВеткуУпаковками(НоваяУпаковка.ПолучитьЭлементы(), ТекущаяСтрока);
//	КонецЦикла;
//	
//КонецПроцедуры

&НаСервере
Процедура ВывестиВеткуУпаковок()
	
	СтрокиУпаковок = МаркировкаУпаковок.ПолучитьЭлементы();
	СтрокиУпаковок.Очистить();
	
	ТекущаяСтрока = Элементы.Товары.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Вместимость = ТекущиеДанные.ЕдиницаИзмерения.Коэффициент;
	
	СоответствиеРодителей = Новый Соответствие;
	
	ПерваяУпаковка = Неопределено;
	МассивУпаковок = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, УровеньВложенности", ТекущиеДанные.ИдентификаторСтроки, 1));
	Для Каждого СтрокаУпаковки Из МассивУпаковок Цикл
		
		СтрокиУпаковок = МаркировкаУпаковок.ПолучитьЭлементы();
		
		ВеткаУпаковок = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, МаркировкаУпаковки", СтрокаУпаковки.ИдентификаторСтроки, СтрокаУпаковки.МаркировкаУпаковки));
		
		ВложенностьУпаковки = ВеткаУпаковок.Количество();
		
		УпаковкаНижнегоУровня = Неопределено;
		Пока ВложенностьУпаковки > 0 Цикл
			Для Каждого СтрокаУпаковки Из ВеткаУпаковок Цикл
				Если СтрокаУпаковки.УровеньВложенности = ВложенностьУпаковки Тогда
					НоваяУпаковка = СоответствиеРодителей.Получить(СтрокаУпаковки.МаркировкаГруппыУпаковок);
					Если НоваяУпаковка = Неопределено Тогда
						НоваяУпаковка = СтрокиУпаковок.Добавить();
						НоваяУпаковка.МаркировкаУпаковки = СтрокаУпаковки.МаркировкаГруппыУпаковок;
						НоваяУпаковка.ТипЛогЕдиницы      = СтрокаУпаковки.ТипЛогЕдиницы;
						
						Если НоваяУпаковка.ТипЛогЕдиницы = 1 Тогда
							НоваяУпаковка.Картинка    = БиблиотекаКартинок.Реквизит;
							НоваяУпаковка.Вместимость = Вместимость;
							НоваяУпаковка.Упаковано   = Объект.Марки.НайтиСтроки(Новый Структура("МаркировкаУпаковки", НоваяУпаковка.МаркировкаУпаковки)).Количество();
						Иначе
							НоваяУпаковка.Картинка    = БиблиотекаКартинок.Подменю;
						КонецЕсли;
						
						СоответствиеРодителей.Вставить(СтрокаУпаковки.МаркировкаГруппыУпаковок, НоваяУпаковка);
					КонецЕсли;
					УпаковкаНижнегоУровня = НоваяУпаковка;
					СтрокиУпаковок = НоваяУпаковка.ПолучитьЭлементы();
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ВложенностьУпаковки = ВложенностьУпаковки - 1;
		КонецЦикла;
		
		Если ПерваяУпаковка = Неопределено Тогда
			ПерваяУпаковка = УпаковкаНижнегоУровня;
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(ТекущиеДанные.МаркировкаУпаковки) Тогда
		//	НоваяУпаковка = СтрокиУпаковок.Добавить();
		//	НоваяУпаковка.МаркировкаУпаковки = ТекущиеДанные.МаркировкаУпаковки;
		//	Элементы.МаркиУпаковок.ТекущаяСтрока = НоваяУпаковка;
		//КонецЕсли;
		
		//НоваяУпаковка = СтрокиУпаковок.Добавить();
		//НоваяУпаковка.МаркировкаУпаковки = ТекущаяСтрока.МаркировкаУпаковки;
		//ЗаполнитьВеткуУпаковками(НоваяУпаковка.ПолучитьЭлементы(), ТекущаяСтрока);
		
	КонецЦикла;
	
	Если НЕ ПерваяУпаковка = Неопределено Тогда
		Элементы.МаркировкаУпаковок.ТекущаяСтрока = ПерваяУпаковка.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияТоварыПриАктивизацииСтроки()
	
	ВывестиВеткуУпаковок();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияТоварыПриАктивизацииСтроки", 0.1, Истина);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле - Булево - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИнтеграцияЕГАИСКлиент.ТоварыВыбор(Объект, ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры //ТоварыВыбор()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "МАРКИ УПАКОВОК"

&НаКлиенте
Процедура МаркировкаУпаковокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанныеТоваров = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанныеТоваров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.МаркировкаУпаковок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.МаркиСтроки.ОтборСтрок = Неопределено;
		Возврат;
	КонецЕсли;
	
	//ЗначениеОтбора = Новый Массив;
	//ЗначениеОтбора = Неопределено;
	//
	//МассивУпаковок = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, МаркировкаГруппыУпаковок", ТекущиеДанныеТоваров.ИдентификаторСтроки, ТекущиеДанные.МаркировкаУпаковки));
	//Для Каждого ЭлементМассива Из МассивУпаковок Цикл
	//	//ЗначениеОтбора.Добавить(ЭлементМассива.МаркировкаУпаковки);
	//	ЗначениеОтбора = ЭлементМассива.МаркировкаУпаковки;
	//КонецЦикла;
	
	Элементы.МаркиСтроки.ОтборСтрок = Новый ФиксированнаяСтруктура("МаркировкаУпаковки", ТекущиеДанные.МаркировкаУпаковки);
	
КонецПроцедуры

&НаКлиенте
Процедура МаркировкаУпаковокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	//УправлениеСпискомСправочникаКлиент.СписокПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры

&НаКлиенте
Процедура МаркировкаУпаковокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	//УправлениеСпискомСправочникаКлиент.СписокПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "МАРКИ"

// Обработчик события возникающего при изменении данных реквизита "КодМарки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура МаркиКодМаркиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Марки.НайтиПоИдентификатору(Элементы.МаркиСтроки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыЕГАИС.МаркиКодМаркиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // МаркиКодМаркиПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура МаркиКодМаркиПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	МаркиКодМаркиПриИзмененииНаСервере();
	
КонецПроцедуры //МаркиКодМаркиПриИзменении()

&НаКлиенте
Процедура МаркиСтрокиКодМаркиПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	МаркиКодМаркиПриИзмененииНаСервере();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "МАРКИ"

&НаКлиенте
Процедура МаркиСтрокиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.МаркиСтроки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока И (НЕ ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторСтроки)) Тогда
		ТекущиеДанные.ИдентификаторСтроки = Элементы.Товары.ТекущиеДанные.ИдентификаторСтроки;
		ТекущиеДанные.МаркировкаУпаковки  = Элементы.МаркировкаУпаковок.ТекущиеДанные.МаркировкаУпаковки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаркиСтрокиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Элементы.МаркировкаУпаковок.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура МаркиПередУдалением(Элемент, Отказ)                                                    
	
	// Определим структуру параметров обработки текущего события
	УдаляемыеСтроки = Новый Массив;
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.МаркиПередУдалением(ЭтотОбъект, Элемент, Отказ, УдаляемыеСтроки);
	
КонецПроцедуры // МаркиПередУдалением()

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура МаркиПослеУдаленияНаСервере(ПараметрыДействия = Неопределено)
	
	УправлениеДиалогомДокументаСервер.МаркиПослеУдаления(ЭтотОбъект, Элементы.Товары, ПараметрыДействия);
	
КонецПроцедуры // МаркиПослеУдаленияНаСервере()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура МаркиПослеУдаления(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("УдаляемыеСтрокиМарки",УдаляемыеСтроки);
	
	// Обработаем событие в контексте сервера
	МаркиПослеУдаленияНаСервере(ПараметрыДействия);
	
КонецПроцедуры // МаркиПослеУдаления()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура МаркиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.МаркиПриОкончанииРедактирования(ЭтотОбъект, Элемент, НоваяСтрока, ОтменаРедактирования);

КонецПроцедуры // МаркиПриОкончанииРедактирования()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСтатусОбработки();
		
	Для Каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ИдентификаторСтроки) Тогда
			СтрокаТабличнойЧасти.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоМарка(ШтрихКод)
	
	Результат = Ложь;
	
	Если СтрДлина(ШтрихКод) = 68 ИЛИ СтрДлина(ШтрихКод) = 150 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоУпаковка(ШтрихКод)
	
	Результат = Ложь;
	
	Если СтрДлина(ШтрихКод) = 26 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПоискМарки(ШтрихКод)
	
	НайденныеСтроки = Объект.Марки.НайтиСтроки(Новый Структура("КодМарки", ШтрихКод));
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТаблицаМарок.Ссылка,
		|	ТаблицаМарок.НомерСтроки
		|ИЗ
		|	Документ.ФормированиеГрупповойТарыЕГАИС.Марки КАК ТаблицаМарок
		|ГДЕ
		|	ТаблицаМарок.КодМарки = &ШтрихКод
		|";
		
		Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ВывестиСообщение(НСтр("ru = 'Марка: %1 не найдена'"), Объект,,,, ШтрихКод);
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ВывестиСообщение(НСтр("ru = 'Марка: %1 используется в документе: %2'"), Объект, "Марки[#].КодМарки", Выборка.НомерСтроки,, ШтрихКод, Выборка.Ссылка);
		КонецЕсли;
		
	Иначе
		Элементы.Марки.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиСтрокуУпаковки(СтрокаВетки, ШтрихКод)
	
	Результат = Ложь;
	
	КоллекцияПоиска = СтрокаВетки.ПолучитьЭлементы();
	
	Для Каждого ТекущаяСтрока Из КоллекцияПоиска Цикл
		
		Если ТекущаяСтрока.МаркировкаУпаковки = ШтрихКод Тогда
			Результат = Истина;
			Элементы.МаркировкаУпаковок.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
		
		Результат = НайтиСтрокуУпаковки(ТекущаяСтрока, ШтрихКод);
		Если Результат Тогда
			СтрокаВетки.Развернуть(ТекущаяСтрока);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПоискУпаковки(ШтрихКод)
	
	Если НайтиСтрокуУпаковки(МаркировкаУпаковок, ШтрихКод) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаУпаковки.Ссылка,
	|	ТаблицаУпаковки.НомерСтроки
	|ИЗ
	|	Документ.ФормированиеГрупповойТарыЕГАИС.Упаковки КАК ТаблицаУпаковки
	|ГДЕ
	|	ТаблицаУпаковки.МаркировкаУпаковки = &ШтрихКод
	|";
	
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ВывестиСообщение(НСтр("ru = 'Упаковка: %1 не найдена'"), Объект,,,, ШтрихКод);
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ВывестиСообщение(НСтр("ru = 'Упаковка: %1 используется в документе: %2'"), Объект, "Упаковки[#].МаркировкаУпаковки", Выборка.НомерСтроки,, ШтрихКод, Выборка.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеМарки(ШтрихКод)
	
	НайденныеСтроки = Объект.Марки.НайтиСтроки(Новый Структура("КодМарки", ШтрихКод));
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		Если Элементы.Товары.ТекущаяСтрока = Неопределено Тогда
			ВывестиСообщение(НСтр("ru = 'Не выбрана товарная строка'"), Объект);
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
		ИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки;
		
		ИтогУпаковано = 0;
		ТаблицаУпаковок = МаркировкаУпаковок.ПолучитьЭлементы();
		Для Каждого СтрокаУпаковки Из ТаблицаУпаковок Цикл
			ИтогУпаковано = ИтогУпаковано + ТаблицаУпаковок.Упаковано;
		КонецЦикла;
		
		Если ТекущиеДанные.КоличествоБазовое <= ИтогУпаковано Тогда
			ВывестиСообщение(НСтр("ru = 'Внимание, текущая товарная позиция уже заполнена. Отсканируйте марку в другую товарную позицию'"), Объект);
			Возврат;
		КонецЕсли;
		
		Если Элементы.МаркировкаУпаковок.ТекущаяСтрока = Неопределено Тогда
			ВывестиСообщение(НСтр("ru = 'Не выбрана строка с упаковкой'"), Объект);
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные = МаркировкаУпаковок.НайтиПоИдентификатору(Элементы.МаркировкаУпаковок.ТекущаяСтрока);
		Если НЕ ТекущиеДанные.ТипЛогЕдиницы = 1 Тогда
			ВывестиСообщение(НСтр("ru = 'Добавление марок возможно только в короба'"), Объект);
			Возврат;
		КонецЕсли;
		
		Если ТекущиеДанные.Упаковано = ТекущиеДанные.Вместимость Тогда
			ВывестиСообщение(НСтр("ru = 'Внимание, текущая упаковка уже заполнена. Отсканируйте марку в другую упаковку'"), Объект);
			Возврат;
		КонецЕсли;
		
		МаркировкаУпаковки = ТекущиеДанные.МаркировкаУпаковки;
		
		НоваяСтрока = Объект.Марки.Добавить();
		НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
		НоваяСтрока.МаркировкаУпаковки  = МаркировкаУпаковки;
		НоваяСтрока.КодМарки            = ШтрихКод;
		
		Модифицированность = Истина;
		
		ТекущиеДанные.Упаковано = ТекущиеДанные.Упаковано + 1;
		
	Иначе
		ДанныеНайденнойМарки = НайденныеСтроки[0];
		Если Элементы.МаркировкаУпаковок.ТекущаяСтрока = Неопределено Тогда
			ВывестиСообщение(НСтр("ru = 'Данная марка уже внесена в упаковку: %1'"), Объект,,,, ДанныеНайденнойМарки.МаркировкаУпаковки);
		Иначе
			ТекущиеДанные = МаркировкаУпаковок.НайтиПоИдентификатору(Элементы.МаркировкаУпаковок.ТекущаяСтрока);
			Если ТекущиеДанные.МаркировкаУпаковки = ДанныеНайденнойМарки.МаркировкаУпаковки Тогда
				ВывестиСообщение(НСтр("ru = 'Данная марка уже внесена в текущую упаковку'"));
			Иначе
				ВывестиСообщение(НСтр("ru = 'Данная марка уже внесена в упаковку: %1'"), Объект,,,, ДанныеНайденнойМарки.МаркировкаУпаковки);
			КонецЕсли;
		КонецЕсли;
		//Элементы.Марки.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	Если ИмяСобытия = "ИзменениеСостоянияЕГАИС"
		И Параметр.Ссылка = Объект.Ссылка Тогда
		
		Если Параметр.Свойство("ОбъектИзменен")
			И Параметр.ОбъектИзменен Тогда
			ОбновитьПредставленияНаФорме(Истина);
		Иначе
			ОбновитьПредставленияНаФорме(Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ВыполненОбменЕГАИС"
		И (Параметр = Неопределено
		Или (ТипЗнч(Параметр) = Тип("Структура") И Параметр.ОбновлятьСтатусЕГАИСВФормахДокументов)) Тогда
		
		ОбновитьПредставленияНаФорме(Истина);
		
	КонецЕсли;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	ШтрихКод = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ШтрихКод", "");
	Если ЭтоУпаковка(ШтрихКод) Тогда
		ПоискУпаковки(ШтрихКод);
		Возврат;
	КонецЕсли;
	
	Если ЭтоМарка(ШтрихКод) Тогда
		
		Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Не выбрана товарная строка'"), 5, НСтр("ru = 'Ошибка сканирования'"));
			Возврат;
		КонецЕсли;
		
		Если Элементы.МаркировкаУпаковок.ТекущиеДанные = Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Не выбрана строка с упаковкой'"), 5, НСтр("ru = 'Ошибка сканирования'"));
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные = Элементы.МаркировкаУпаковок.ТекущиеДанные;
		Если НЕ ТекущиеДанные.ТипЛогЕдиницы = 1 Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Добавление марок возможно только в короба'"), 5, НСтр("ru = 'Ошибка сканирования'"));
			Возврат;
		КонецЕсли;
		
		Если ТекущиеДанные.Упаковано = ТекущиеДанные.Вместимость Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Внимание, текущая упаковка уже заполнена. Отсканируйте марку в другую упаковку'"), 5, НСтр("ru = 'Ошибка сканирования'"));
			Возврат;
		КонецЕсли;
		
		Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары Тогда
			
			ДобавлениеМарки(ШтрихКод);
			
		ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаМарки Тогда
			
			ПоискМарки(ШтрихКод);
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСтатусОбработки();
		
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	ОбновитьСтатусОбработки();
		
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура СтатусОбработкиПредставлениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	Если Модифицированность ИЛИ (Не ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("СтатусОбработкиОбработкаНавигационнойСсылкиЗавершение", ЭтотОбъект, Новый Структура("НавигационнаяСсылкаФорматированнойСтроки", НавигационнаяСсылкаФорматированнойСтроки));
		ТекстВопроса = НСтр("ru = 'Для продолжения документ необходимо записать. Записать?'");
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодбораМарок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = ДополнительныеПараметры.ДанныеСтроки;
	
	ИнтеграцияЕГАИСКлиент.ПослеПодбораМарок(ЭтотОбъект, Объект, ДанныеСтроки, Результат);
	
	ТоварыКоличествоПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура МаркиПриАктивизацииСтроки(Элемент)
	
	СтрокиУпаковок = ДеревоУпаковок.ПолучитьЭлементы();
	СтрокиУпаковок.Очистить();
	ТекущиеДанные = Элементы.Марки.ТекущиеДанные;
	Если Объект.Марки.Количество() = 0 ИЛИ ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивУпаковок = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, МаркировкаУпаковки", ТекущиеДанные.ИдентификаторСтроки, ТекущиеДанные.МаркировкаУпаковки));
	ВложенностьУпаковки = МассивУпаковок.Количество();
	
	Пока ВложенностьУпаковки > 0 Цикл
		
		Для Каждого СтрокаУпаковки Из МассивУпаковок Цикл
			Если СтрокаУпаковки.УровеньВложенности = ВложенностьУпаковки Тогда
				НоваяУпаковка = СтрокиУпаковок.Добавить();
				НоваяУпаковка.МаркировкаУпаковки = СтрокаУпаковки.МаркировкаГруппыУпаковок;
				СтрокиУпаковок = НоваяУпаковка.ПолучитьЭлементы();
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ВложенностьУпаковки = ВложенностьУпаковки - 1;
		
	КонецЦикла;
	
	//Если ЗначениеЗаполнено(ТекущиеДанные.МаркировкаУпаковки) Тогда
	//	НоваяУпаковка = СтрокиУпаковок.Добавить();
	//	НоваяУпаковка.МаркировкаУпаковки = ТекущиеДанные.МаркировкаУпаковки;
	//	Элементы.ДеревоУпаковок.ТекущаяСтрока = НоваяУпаковка;
	//КонецЕсли;
	//
КонецПроцедуры

&НаКлиенте
Процедура МаркиСтрокиПередУдалением(Элемент, Отказ)
	
	КоличествоУдаленныхМарок = Элементы.МаркиСтроки.ВыделенныеСтроки.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура МаркиСтрокиПослеУдаления(Элемент)
	
	ТекущиеДанные = Элементы.МаркировкаУпаковок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Упаковано = Макс(0, ТекущиеДанные.Упаковано-КоличествоУдаленныхМарок);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеРедактированиеПалеты(УпаковкиПаллеты, ДополнительныеПараметры) Экспорт
	
	Если УпаковкиПаллеты = Неопределено ИЛИ УпаковкиПаллеты = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Паллета             = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеПараметры, "Паллета", "");
	ТекущаяСтрокаТовары = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеПараметры, "ТекущаяСтрока", "");
	Если НЕ ЗначениеЗаполнено(Паллета) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Элементы.Товары.ТекущаяСтрока = ТекущаяСтрокаТовары Тогда
		Элементы.Товары.ТекущаяСтрока = ТекущаяСтрокаТовары;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки;
	
	УпаковкиКУдалению = Новый Массив;
	Для Каждого ТекущаяСтрока Из Объект.Упаковки Цикл
		
		Если НЕ ТекущаяСтрока.МаркировкаГруппыУпаковок = Паллета Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяСтрока.МаркировкаУпаковки = "" Тогда
			Продолжить;
		КонецЕсли;
		
		// упаковка убрана с паллеты
		СтрокаУпаковки = УпаковкиПаллеты.Найти(ТекущаяСтрока.МаркировкаУпаковки);
		Если СтрокаУпаковки = Неопределено Тогда
			УпаковкиКУдалению.Добавить(ТекущаяСтрока.МаркировкаУпаковки);
		Иначе
			УпаковкиПаллеты.Удалить(СтрокаУпаковки);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого НоваяУпаковкаПоллеты Из УпаковкиПаллеты Цикл
		
		НоваяСтрока = Объект.Упаковки.Добавить();
		НоваяСтрока.ИдентификаторСтроки      = ИдентификаторСтроки;
		НоваяСтрока.МаркировкаУпаковки       = НоваяУпаковкаПоллеты;
		НоваяСтрока.МаркировкаГруппыУпаковок = Паллета;
		НоваяСтрока.УровеньВложенности       = 2;
		НоваяСтрока.ТипЛогЕдиницы            = Сред(Паллета, 13, 1);
		
		//НайденныеСтроки = Объект.Упаковки.НайтиСтроки(Новый Структура("МаркировкаГруппыУпаковок, МаркировкаУпаковки", НоваяУпаковкаПоллеты, НоваяУпаковкаПоллеты));
		//Если НайденныеСтроки.Количество()>0 Тогда
		//	НайденныеСтроки[0].УровеньВложенности = 2;
		//КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого УбраннаяУпаковкаПоллеты Из УпаковкиКУдалению Цикл
		НайденныеСтроки = Объект.Упаковки.НайтиСтроки(Новый Структура("МаркировкаУпаковки", УбраннаяУпаковкаПоллеты));
		
		Для Каждого СтрокаУпаковки Из НайденныеСтроки Цикл
			Если НЕ СтрокаУпаковки.МаркировкаУпаковки = СтрокаУпаковки.МаркировкаГруппыУпаковок Тогда
			//	СтрокаУпаковки.УровеньВложенности = 1;
			//Иначе
				Объект.Упаковки.Удалить(СтрокаУпаковки);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	ВывестиВеткуУпаковок();
	
КонецПроцедуры

&НаКлиенте
Процедура СодержимоеПаллеты(Команда)
	
	ТекущиеДанные = Элементы.МаркировкаУпаковок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекущиеДанные.ТипЛогЕдиницы = 2 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Редактировать доступно только паллеты'"), 5, НСтр("ru = 'Редактирование паллеты'"));
		Возврат;
	КонецЕсли;
	
	Паллета = ТекущиеДанные.МаркировкаУпаковки;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Паллета",            Паллета);
	ПараметрыОткрытия.Вставить("МаркировкаУпаковок", МаркировкаУпаковок);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Паллета",       Паллета);
	ДопПараметры.Вставить("ТекущаяСтрока", Элементы.Товары.ТекущаяСтрока);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеРедактированиеПалеты", ЭтотОбъект, ДопПараметры);
	
	ОткрытьФорму("Обработка.МодульОбменаЕГАИС.Форма.ФормаРедактированиеПаллеты", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПаллетуНаСервере()
	
	ТекущаяСтрока = Элементы.Товары.ТекущаяСтрока;
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НомерЛинии    = "02";
	ИдОрганизации = Прав("000000000000" + СокрЛП("" + Объект.ОрганизацияЕГАИС.Код), 12);
	ТипЛогЕдиницы = 2;
	ТекущийГод    = Формат(Объект.Дата,"ДФ=yy");
	
	НомерЛинии = Прав("00" + СокрЛП("" + НомерЛинии), 2);
	ТекущийГод = Прав("00" + СокрЛП("" + ТекущийГод), 2);
	
	ПрефиксМаркировки = ИдОрганизации + Строка(ТипЛогЕдиницы) + НомерЛинии + ТекущийГод;
	
	НомерПаллеты = ПолучитьНачальныйНомерТары(ТипЛогЕдиницы);
	
	МаркировкаПаллеты = ПрефиксМаркировки + Прав("000000000" + Формат(НомерПаллеты, "ЧГ=0"), 9);
	
	НоваяСтрока = Объект.Упаковки.Добавить();
	НоваяСтрока.ИдентификаторСтроки      = ТекущиеДанные.ИдентификаторСтроки;
	НоваяСтрока.МаркировкаГруппыУпаковок = МаркировкаПаллеты;
	//НоваяСтрока.МаркировкаУпаковки       = "";
	НоваяСтрока.МаркировкаУпаковки       = МаркировкаПаллеты;
	НоваяСтрока.УровеньВложенности       = 1;
	НоваяСтрока.ТипЛогЕдиницы            = ТипЛогЕдиницы;
	
	СтрокиУпаковок = МаркировкаУпаковок.ПолучитьЭлементы();
	
	НоваяУпаковка = СтрокиУпаковок.Добавить();
	НоваяУпаковка.МаркировкаУпаковки = МаркировкаПаллеты;
	НоваяУпаковка.ТипЛогЕдиницы      = 2;
	НоваяУпаковка.Картинка           = БиблиотекаКартинок.Подменю;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПаллету(Команда)
	
	ДобавитьПаллетуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискВТаблицеТовары(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПоискВТаблицеТоварыРезультатОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ПоискВТаблицеТоварыРезультатОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ШтрихКодДляПоиска = РезультатОповещения;
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ПоискПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКоду(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ДобавлениеНовыхПозицийПоШтрихКодуОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКодуОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ДобавлениеНовыхПозицийПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтборВТаблицеТовары(Команда)
	Элементы.Товары.ОтборСтрок = Неопределено;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ШтрихКодДляПоиска = "";
