
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
// Процедура устанавливает отбор по пользователю
//
// Параметры:
//	Пользователь	- СправочникСсылка	- Пользователь, по которому устанавливается отбор.
//
Процедура УстановитьОтборПоПользователю(Пользователь)
	ЭлементыОтбора = Список.Отбор.Элементы;
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ЭлементОтбора.Представление = "ОтборПоПользователю" Тогда
			Если ЗначениеЗаполнено(Пользователь) Тогда
				ЭлементОтбора.ПравоеЗначение = Пользователь;
				ЭлементОтбора.Использование = Истина;
			Иначе
				ЭлементОтбора.Использование = Ложь;
			КонецЕсли;	
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры // УстановитьОтборПоПользователю()	

&НаСервере
// Процедура устанавливает отбор по контакту
//
// Параметры:
//	Контакт	- СправочникСсылка	- Контакт, по которому устанавливается отбор.
//
Процедура УстановитьОтборПоКонтакту(Контакт)
	ЭлементыОтбора = Список.Отбор.Элементы;
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ЭлементОтбора.Представление = "ОтборПоКонтакту" Тогда
			Если ЗначениеЗаполнено(Контакт) Тогда
				ЭлементОтбора.ПравоеЗначение = Контакт;
				ЭлементОтбора.Использование = Истина;
			Иначе
				ЭлементОтбора.Использование = Ложь;
			КонецЕсли;	
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры // УстановитьОтборПоКонтакту()	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события "ПередНачаломДобавления" таблицы формы "Список"
//
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(ЭтотОбъект.ОтборПоПользователю) ИЛИ ЗначениеЗаполнено(ЭтотОбъект.ОтборПоКонтакту) Тогда
		Если ЗначениеЗаполнено(ЭтотОбъект.ОтборПоПользователю) Тогда
			ПараметрыФормы.Вставить("ОтборПоПользователю", ЭтотОбъект.ОтборПоПользователю);
		КонецЕсли;	
		Если ЗначениеЗаполнено(ЭтотОбъект.ОтборПоКонтакту) Тогда
			ПараметрыФормы.Вставить("ОтборПоКонтакту", ЭтотОбъект.ОтборПоКонтакту);
		КонецЕсли;	
	ИначеЕсли Копирование Тогда
		ТД = Элементы.Список.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТД.Пользователь) Тогда
			ПараметрыФормы.Вставить("Пользователь", ТД.Пользователь);
		КонецЕсли;	
		Если ЗначениеЗаполнено(ТД.Контакт) Тогда
			ПараметрыФормы.Вставить("Контакт", ТД.Контакт);
		КонецЕсли;	
		Если ЗначениеЗаполнено(ТД.НомерВнТелефона) Тогда
			ПараметрыФормы.Вставить("НомерВнТелефона", ТД.НомерВнТелефона);
		КонецЕсли;	
		Если ЗначениеЗаполнено(ТД.НомерТелефона) Тогда
			ПараметрыФормы.Вставить("НомерТелефона", ТД.НомерТелефона);
		КонецЕсли;	
	Иначе		
		Возврат;		
	КонецЕсли;	
	Отказ = Истина;
	ОткрытьФорму("РегистрСведений.сфпПравилаЗаписиТелефонныхПереговоров.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры // СписокПередНачаломДобавления()

// Обработчик события вызывается на сервере после получения данных динамическим списком.
//
// Параметры:
//  ИмяЭлемента - Строка - Содержит имя таблицы формы, из которой вызван обработчик события.
//  Настройки   - НастройкиКомпоновкиДанных - Содержит копию полных настроек динамического списка.
//  Строки      - СтрокиДинамическогоСписка - Данные и оформление всех строк, получаемых в списке.
//
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраСервер.СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры // СписокПриПолученииДанныхНаСервере()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля формы "ОтборПоПользователю"
//
Процедура ОтборПоПользователюПриИзменении(Элемент)
	УстановитьОтборПоПользователю(ЭтотОбъект.ОтборПоПользователю);
КонецПроцедуры // ОтборПоПользователюПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля формы "ОтборПоКонтакту"
//
Процедура ОтборПоКонтактуПриИзменении(Элемент)
	Если (ЭтотОбъект.ОтборПоКонтакту = Неопределено) ИЛИ ЗначениеЗаполнено(ЭтотОбъект.ОтборПоКонтакту) Тогда
		УстановитьОтборПоКонтакту(ЭтотОбъект.ОтборПоКонтакту);
	КонецЕсли;	
КонецПроцедуры // ОтборПоКонтактуПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ сфпСофтФонПроСервер.сфпИспользоватьЗаписьПереговоров() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ЭтотОбъект.ТолькоПросмотр	= НЕ сфпСофтФонПроСервер.сфпРолиДоступны("сфпУправлениеМаршрутизацией, ПолныеПрава");
КонецПроцедуры // ПриСозданииНаСервере()
