
Функция УчитываемыеВидыМаркируемойПродукции() Экспорт
	
	ВидыПродукции = Новый Массив;
	ВидыПродукции.Добавить(Перечисления.ВидыМаркируемойПродукции.Табачная);
	ВидыПродукции.Добавить(Перечисления.ВидыМаркируемойПродукции.Обувная);
	
	Возврат Новый ФиксированныйМассив(ВидыПродукции);
	
КонецФункции

Процедура ПоступлениеТоваровУправлениеДиалогом(Форма, Объект) Экспорт
	
	Элементы = Форма.Элементы;
	
	Если Объект.Товары.Итог("КоличествоДок")>0 Тогда
		Элементы.ТоварыКоличествоДок.Видимость = Истина;
		Элементы.ТоварыЦенаДок.Видимость       = Истина;
		Элементы.ТоварыСуммаДок.Видимость      = Истина;
		Элементы.ТоварыПоказатьРасхождение.Видимость   = Ложь;
		Элементы.ТоварыКоличествоПоНакладной.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.Марки.Количество()>0 Тогда
		Элементы.СтраницаМарки.Видимость        = Истина;
		Элементы.Марки.Видимость                = Истина;
		Элементы.МаркиСтатусПроверки.Видимость = (НЕ Объект.ПолученИзЕГАИС);
	КонецЕсли;
	
КонецПроцедуры

