
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		РежимОтладкиЗащиты=ПараметрыСеанса.РежимОтладкиЗащиты;
	Исключение
		РежимОтладкиЗащиты=Ложь;
	КонецПопытки;
	
КонецПроцедуры //ПриСозданииНаСервере()

&НаСервере
Процедура ПрименитьНаСервере()
	
	ПараметрыСеанса.РежимОтладкиЗащиты=РежимОтладкиЗащиты;
	
КонецПроцедуры //ЗаписатьИЗакрытьНаСервере()

&НаКлиенте
Процедура Применить(Команда)
	
	ПараметрыПриложения.Вставить("РежимОтладкиЗащиты", РежимОтладкиЗащиты);
	ПрименитьНаСервере();
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры //ПрименитьНаСервере()
