
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьСтатусыЗаказовНаСервере();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого СтрокаТЧ Из СтатусыЗаказов Цикл 
		Если СтрокаТЧ.Статус = Перечисления.бит_ЯндексЕдаСтатусы.NEW
			Или СтрокаТЧ.Статус = Перечисления.бит_ЯндексЕдаСтатусы.READY Тогда 
			СтрокаТЧ.Используется = Истина;
		КонецЕсли;
	КонецЦикла;
	
	НабЗап = РегистрыСведений.бит_ЯндексЕдаНастройкиСтатусов.СоздатьНаборЗаписей();
	НабЗап.Загрузить(СтатусыЗаказов.Выгрузить());
	НабЗап.Записать();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьХранилищеТокенов(Команда)
	ОткрытьФорму("РегистрСведений.бит_ХранилищеТокенов.ФормаСписка");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСтатусыЗаказовНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЯндексЕдаСтатусы.Ссылка КАК Статус,
		|	бит_ЯндексЕдаНастройкиСтатусов.Используется КАК Используется,
		|	бит_ЯндексЕдаНастройкиСтатусов.РазрешеноОбновление КАК РазрешеноОбновление,
		|	бит_ЯндексЕдаНастройкиСтатусов.РазрешенаОтмена КАК РазрешенаОтмена
		|ИЗ
		|	Перечисление.бит_ЯндексЕдаСтатусы КАК бит_ЯндексЕдаСтатусы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЯндексЕдаНастройкиСтатусов КАК бит_ЯндексЕдаНастройкиСтатусов
		|		ПО бит_ЯндексЕдаСтатусы.Ссылка = бит_ЯндексЕдаНастройкиСтатусов.Статус
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_ЯндексЕдаНастройкиСтатусов.Статус.Порядок";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	СтатусыЗаказов.Загрузить(Выборка);	
	
КонецПроцедуры

#КонецОбласти
