
Процедура ПриЗаписи(Отказ)
	#Если Клиент Тогда
	Попытка
		ПеременныеМодуляПриложения = Обработки.ПеременныеМодуляПриложения.Создать();
		КэшЛокализованныхНаименований = ПеременныеМодуляПриложения.КэшЛокализованныхНаименований;
		КэшЛокализованныхНаименований.Удалить(ЭтотОбъект.Ссылка);
	Исключение КонецПопытки;
	#КонецЕсли
	Попытка Если ЭтотОбъект.ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;
	Исключение КонецПопытки;
	Попытка Если ПараметрыСеанса.ИдетСеансОбмена Тогда Возврат; КонецЕсли;
	Исключение КонецПопытки;
	
	Если НЕ Отказ Тогда
		//орФиксацияИзмененийОбъектов(ЭтотОбъект,,2);
	КонецЕсли;

КонецПроцедуры
