Перем мВыполнятьУтверждение Экспорт;

Процедура ПередЗаписью(Отказ)
	
	Если РеквизитИзменения.КонтролируетсяДокументом ТОгда
		
		Если ПримененоВТекущейСистеме И Ссылка.ПримененоВТекущейСистеме <> ПримененоВТекущейСистеме Тогда
			ПользовательКонтролер = НСИКлиентСервер.ПолучитьТекущегоПользователя();
		КонецЕсли;
		
		Сообщить("Реквизит контролируется документом. Необходимо ввести документ");
			
	КонецЕсли;
	
	мВыполнятьУтверждение = ПроверитьУтвержден();//->Lexa 141029
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

//->Lexa 141029
Функция ПроверитьУтвержден()
	Если Утверждено И НЕ Ссылка.Утверждено Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Процедура СтартанутьРассылку() Экспорт
	
	Если мВыполнятьУтверждение Тогда 
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.Добавить(Ссылка);

		НСИКлиентСервер.НСИПрименитьИзменения(СписокЗначений);
	КонецЕсли;
	
КонецПроцедуры

мВыполнитьУтверждение = Ложь;
//<-Lexa