
&НаСервере
Функция ПроверитьМарку(Данные)
	
	НайденныеСтроки = Марки.НайтиСтроки(Новый Структура("КодМарки", Данные));
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаМарки = МаркиДокумента.НайтиПоЗначению(Данные);
		Если НЕ СтрокаМарки = Неопределено Тогда
			ТекстСообщения = НСтр("ru = 'Марка: %1 уже внесена в документ!'");
			ВывестиСообщение(ТекстСообщения,,,,,Данные);
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Элементы.Марки.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		ТекстСообщения = НСтр("ru = 'Марка: %1 уже внесена!'");
		ВывестиСообщение(ТекстСообщения,,,,,Данные);
		Возврат Ложь;
	КонецЕсли;
	
	РезультатПоиска = ИнтеграцияЕГАИС.ПолучитьКодПоОстаткамМарок(Данные);
	Если Не ЗначениеЗаполнено(РезультатПоиска.КодАП) Тогда
		РезультатПоиска = ИнтеграцияЕГАИС.ПолучитьКодПоДаннымТТН(Данные);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РезультатПоиска.КодАП) И СтрДлина(Данные) = 68 Тогда
		РезультатПоиска.КодАП                = ИнтеграцияЕГАИСВызовСервера.ПолучитьКодИзPDF(Данные);
		РезультатПоиска.АлкогольнаяПродукция = ИнтеграцияЕГАИС.ПолучитьКлассификаторАлкоголяПоКоду(РезультатПоиска.КодАП);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РезультатПоиска.АлкогольнаяПродукция) Тогда
		Если ЗначениеЗаполнено(РезультатПоиска.КодАП) Тогда
			ВывестиСообщение(НСтр("ru = 'Не удалось найти алкогольную продукции по акцизной марки: %1 в классификаторе алкогольной продукции и коду: %2'"),,,,,Данные, РезультатПоиска.КодАП);
		Иначе
			ВывестиСообщение(НСтр("ru = 'Не удалось найти алкогольную продукции по акцизной марки: %1 в классификаторе алкогольной продукции'"),,,,, Данные);
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АлкогольнаяПродукция) И (НЕ РезультатПоиска.АлкогольнаяПродукция = АлкогольнаяПродукция) Тогда
		ВывестиСообщение(НСтр("ru = 'Найденная по акцизной марке: %1 алкогольная продукция <%2> не соответствует алкогольной продукции указанной в строке <%3>'"),,,,, Данные, СокрЛП(РезультатПоиска.АлкогольнаяПродукция), СокрЛП(АлкогольнаяПродукция));
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Справки2.Количество()>0) И (Справки2.НайтиПоЗначению(РезультатПоиска.Справка2) = Неопределено) Тогда
		ВывестиСообщение(НСтр("ru = 'Найденная по акцизной марке: %1 Справка 2 <%2> не соответствует Справке 2 указанной в строке'"),,,,, Данные, СокрЛП(РезультатПоиска.Справка2));
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьМарки(Команда)
	
	Если Марки.Количество()>0 Тогда
		
		// Формируем описание обработчика перехвата закрытия формы
		ОбработчикВопроса = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияЗаполнение", ЭтотОбъект);
		
		// Формируем текст вопроса
		ТекстВопроса = НСтр("ru = 'Очистить таблицу ""Марки""?'");
		
		// Получаем подтверждение операции от пользователя
		ПоказатьВопрос(ОбработчикВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаОповещенияЗаполнение(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Проверяем статус закрытия окна параметров
	Если РезультатОповещения=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
		
		// Очистим табличную часть "Марки"
		Марки.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияЗаполнение()

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Массив;
	Для Каждого ТекущаяСтрока Из Марки Цикл
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("КодМарки",           ТекущаяСтрока.КодМарки);
		НоваяСтрока.Вставить("МаркировкаУпаковки", ТекущаяСтрока.МаркировкаУпаковки);
		НоваяСтрока.Вставить("НомерСправки1",      ТекущаяСтрока.НомерСправки1);
		НоваяСтрока.Вставить("НомерСправки2",      ТекущаяСтрока.НомерСправки2);
		НоваяСтрока.Вставить("ДатаРозлива",        ТекущаяСтрока.ДатаРозлива);
		
		Результат.Добавить(НоваяСтрока);
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	АлкогольнаяПродукция = ПолучитьЗначениеПараметраСтруктуры(Параметры, "АлкогольнаяПродукция", Неопределено);
	Количество           = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Количество", 0);
	ИдентификаторСтроки  = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ИдентификаторСтроки", "");
	РежимПоискаСправок2  = ПолучитьЗначениеПараметраСтруктуры(Параметры, "РежимПоискаСправок2", Ложь);
	ЕстьСправки2         = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ЕстьСправки2", Ложь);
	Справки2             = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Справки2", Неопределено);
	
	Если Параметры.Свойство("МаркиДокумента") Тогда
		МаркиДокумента.ЗагрузитьЗначения(Параметры.МаркиДокумента);
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Параметры.Марки Цикл
		НоваяСтрока = Марки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		Если ЕстьСправки2 Тогда
			НоваяСтрока.ДатаРозлива = ТекущаяСтрока.СправкаА.ДатаРозлива;
		КонецЕсли;
	КонецЦикла;
	
	//ОписаниеСтроки = СокрЛП(АлкогольнаяПродукция) + ", кол.: " + Строка(Количество);
	Заголовок = "Подбор марок для <" + СокрЛП(АлкогольнаяПродукция) + ">, кол.: " + Строка(Количество);
	Элементы.МаркиНомерСправки2.Видимость = ЕстьСправки2;
	Элементы.МаркиНомерСправки1.Видимость = ЕстьСправки2;
	Элементы.МаркиДатаРозлива.Видимость   = ЕстьСправки2;
	Элементы.МаркиЗаписатьДокумент.Видимость = РежимПоискаСправок2;
	
	Если НЕ РежимПоискаСправок2 Тогда
		Возврат;
	КонецЕсли;
	
	//ЦветВнимания = Новый Цвет(0, 0, 128);
	//Для Каждого ОформлениеСтроки Из ОформленияСтрок Цикл
	//	ДанныеСтроки = ОформлениеСтроки.ДанныеСтроки;
	//	Если НЕ ПустаяСтрока(ДанныеСтроки.НомерСправкиБ) Тогда
	//		ОформлениеСтроки.ЦветТекста = ЦветВнимания;
	//		//ОформлениеСтроки.Шрифт = Новый Шрифт(ОформлениеСтроки.Шрифт, , , Истина);
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	//Оповестить("ПерезаписатьДокументИнвентаризации");
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "МАРКИ"

// Обработчик события возникающего при изменении данных реквизита "КодМарки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура МаркиКодМаркиПриИзмененииНаСервере()
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Марки.НайтиПоИдентификатору(Элементы.Марки.ТекущаяСтрока);
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("ПроверятьАП", Истина);
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.МаркиКодМаркиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	Если ТекущиеДанные.КодМарки = "" тогда
		Возврат;
	КонецЕсли;
	
	КодМарки = ТекущиеДанные.КодМарки;
	ТекущиеДанные.КодМарки = "";
	Если НЕ ПроверитьМарку(КодМарки) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.КодМарки = КодМарки;
	
КонецПроцедуры // МаркиКодМаркиПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура МаркиКодМаркиПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	МаркиКодМаркиПриИзмененииНаСервере();
		
КонецПроцедуры //МаркиКодМаркиПриИзменении()

&НаКлиенте
Процедура МаркиНомерСправки1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//ТекущиеДанные = ЭлементыФормы.Марки.ТекущиеДанные;
	//Если ТекущиеДанные = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если Не ЗначениеЗаполнено(ТекущиеДанные.ДатаРозлива) Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//СтандартнаяОбработка = Ложь;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "
	//|ВЫБРАТЬ
	//|	СправкиА.Ссылка
	//|ИЗ
	//|	Справочник.СправкиА КАК СправкиА
	//|ГДЕ
	//|	СправкиА.ДатаРозлива = &ДатаРозлива" + ?(ЗначениеЗаполнено(АлкогольнаяПродукция), " И 
	//|	СправкиА.АлкогольнаяПродукция = &АлкогольнаяПродукция", "");
	//Запрос.УстановитьПараметр("ДатаРозлива",          ТекущиеДанные.ДатаРозлива);
	//Запрос.УстановитьПараметр("АлкогольнаяПродукция", АлкогольнаяПродукция);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Количество() = 1 Тогда
	//	Выборка.Следующий();
	//	ТекущиеДанные.СправкаА = Выборка.Ссылка;
	//	Возврат;
	//КонецЕсли;
	//
	//ФормаВыбора = Справочники.СправкиА.ПолучитьФорму("ФормаСписка", Элемент);
	//ФормаВыбора.РежимВыбора = Истина;
	//ОтборСправок = ФормаВыбора.Отбор.Найти("ДатаРозлива");
	//Если ОтборСправок = Неопределено Тогда
	//	ОтборСправок = ФормаВыбора.Отбор.Добавить("ДатаРозлива");
	//КонецЕсли;
	//ОтборСправок.Использование = Истина;
	//ОтборСправок.Значение      = ТекущиеДанные.ДатаРозлива;
	//
	//Если ЗначениеЗаполнено(АлкогольнаяПродукция) Тогда
	//	ОтборСправок = ФормаВыбора.Отбор.Найти("АлкогольнаяПродукция");
	//	Если ОтборСправок = Неопределено Тогда
	//		ОтборСправок = ФормаВыбора.Отбор.Добавить("АлкогольнаяПродукция");
	//	КонецЕсли;
	//	ОтборСправок.Использование = Истина;
	//	ОтборСправок.Значение      = АлкогольнаяПродукция;
	//КонецЕсли;
	//
	//Результат = ФормаВыбора.ОткрытьМодально();
	//Если Результат = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ТекущиеДанные.СправкаА    = Результат;
	//ТекущиеДанные.ДатаРозлива = Результат.ДатаРозлива;
	
КонецПроцедуры

&НаКлиенте
Процедура МаркиНомерСправки2ПриИзменении(Элемент)
	
	//ТекущиеДанные = ЭлементыФормы.Марки.ТекущиеДанные;
	//Если ТекущиеДанные = Неопределено ИЛИ ПустаяСтрока(ТекущиеДанные.НомерСправкиБ) Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "
	//|ВЫБРАТЬ
	//|	СправкиА.Ссылка,
	//|	СправкиА.ДатаРозлива
	//|ИЗ
	//|	Справочник.СправкиБ КАК СправкиБ
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	//|	Справочник.СправкиА КАК СправкиА
	//|ПО
	//|	СправкиБ.НомерСправкиА = СправкиА.Номер
	//
	//|ГДЕ
	//|	СправкиБ.Номер = &Номер";
	//
	//Запрос.УстановитьПараметр("Номер", ТекущиеДанные.НомерСправкиБ);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	ТекущиеДанные.СправкаА    = Выборка.Ссылка;
	//	ТекущиеДанные.ДатаРозлива = Выборка.ДатаРозлива;
	//КонецЕсли;
	
КонецПроцедуры


// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия=Неопределено)
	
	// Обработаем в зависимости от 
	Если ПараметрыДействия.Свойство("ШтрихКод") Тогда
		Если ПараметрыДействия.ШтрихКод = "" Тогда
			Возврат;
		КонецЕсли;
		
		Если СтрДлина(ПараметрыДействия.ШтрихКод) = 68 ИЛИ СтрДлина(ПараметрыДействия.ШтрихКод)= 150 Тогда
			// Дубль
			СтрокиМарка = Марки.НайтиСтроки(Новый Структура("КодМарки",ПараметрыДействия.ШтрихКод));
			Если СтрокиМарка.Количество() > 0 Тогда
				ВывестиСообщение(НСтр("ru = 'Данная марка уже внесена в документ'"));
				ИдентификаторСтроки = СтрокиМарка[0].ПолучитьИдентификатор();
				Элементы.Марки.ТекущаяСтрока = ИдентификаторСтроки;
				Возврат;
			КонецЕсли;
			
			Если ПроверитьМарку(ПараметрыДействия.ШтрихКод) Тогда
				СтрокаМарки = Марки.Добавить();
				СтрокаМарки.КодМарки = ПараметрыДействия.ШтрихКод;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

