
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает массив значений допустимых вариантов расположения штампов на странице документа.
//
// Возвращаемое значение:
//  Массив Из Строка
//
Функция ДопустимыеРасширенияФайловШтампов() Экспорт
	
	МассивРасширений = Новый Массив;
	МассивРасширений.Добавить(".PNG");
	МассивРасширений.Добавить(".JPEG");
	МассивРасширений.Добавить(".JPG");
	МассивРасширений.Добавить(".SVG");
	
	Возврат МассивРасширений;
	
КонецФункции

// Возвращает массив значений допустимых вариантов расположения штампов на странице документа.
//
// Возвращаемое значение:
//  Массив Из Строка
//
Функция МассивВариантовРасположенияШтамповНаСтраницеДокумента() Экспорт
	
	ВариантыРасположения = Новый Массив;
	
	ВариантыРасположения.Добавить(СпособРазмещенияВверхуСлева());
	ВариантыРасположения.Добавить(СпособРазмещенияВверхуСправа());
	ВариантыРасположения.Добавить(СпособРазмещенияВверхуПоЦентру());
	ВариантыРасположения.Добавить(СпособРазмещенияВнизуСлева());
	ВариантыРасположения.Добавить(СпособРазмещенияВнизуСправа());
	ВариантыРасположения.Добавить(СпособРазмещенияВнизуПоЦентру());
	ВариантыРасположения.Добавить(СпособРазмещенияПоКоординатам());
	
	Возврат ВариантыРасположения;
	
КонецФункции

// Возвращает массив значений допустимых правил расположения штампов в документе.
//
// Возвращаемое значение:
//  Массив Из Строка
//
Функция МассивПравилРасположенияШтамповВДокументе() Экспорт
	
	ПравилаРасположения = Новый Массив;
	
	ПравилаРасположения.Добавить(СпособРасположенияНаКаждойСтранице());
	ПравилаРасположения.Добавить(СпособРасположенияНаПервойСтранице());
	ПравилаРасположения.Добавить(СпособРасположенияНаПоследнейСтранице());
	ПравилаРасположения.Добавить(СпособРасположенияНаКаждойСтраницеКромеПоследней());
	ПравилаРасположения.Добавить(СпособРасположенияНаКонкретнойСтранице());
	ПравилаРасположения.Добавить(СпособРасположенияНаНовойСтранице());
	
	Возврат ПравилаРасположения;
	
КонецФункции

// Проверяет, может ли сервис 1С:Штамп работать с файлом.
//
// Параметры:
//  Расширение - Строка - Расширение файла для отправки в сервис 1С:Штамп.
//
// Возвращаемое значение:
//  Булево - Признак того, что сервис поддерживает расширение файла.
//
Функция РасширениеОсновногоФайлаПоддерживается(Знач Расширение) Экспорт
	
	Расширения = ПоддерживаемыеРасширенияФайловДляШтампирования();
	
	Возврат Расширения.Найти(НРег(Расширение)) <> Неопределено;
	
КонецФункции

// Проверяет, поддерживает ли расширение документа штампирование по тегам.
//
// Параметры:
//  Расширение - Строка - Расширение файла документа для отправки в сервис 1С:Штамп.
//
// Возвращаемое значение:
//  Булево - Признак того, что расширение файла докуента поддерживает штампирование по тегам.
//
Функция РасширениеОсновногоФайлаПоддерживаетШтампированиеПоТегам(Знач Расширение) Экспорт
	
	Расширения = ПоддерживаемыеРасширенияФайловДляШтампированияПоТегам();
	
	Возврат Расширения.Найти(НРег(Расширение)) <> Неопределено;
	
КонецФункции

// Возвращает признак возможности визуализации файла.
//
// Возвращаемое значение:
//   Булево - признак возможности.
//
Функция ВизуализацияФорматаДокументаСервисаПоддерживаетсяПлатформой(Знач Расширение) Экспорт
	
	ВизуализируемыеФорматы = СписокФорматовДокументовСервисаДляВизуализацииСредствамиПлатформы();
	
	Возврат Не ВизуализируемыеФорматы.Найти(НРег(Расширение)) = Неопределено;
	
КонецФункции

#Область КодыСостояний

// Возвращает код состояния: запрошенный документ доступен по другому URI, указанному в заголовке в поле Location.
//
// Возвращаемое значение:
//  Число - Код состояния http.
//
Функция КодСостоянияРедиректаЗапроса() Экспорт
	
	Возврат 302;
	
КонецФункции

// Возвращает код состояния: успешный запрос.
//
// Возвращаемое значение:
//  Число - Код состояния http.
//
Функция КодСостоянияВыполнено() Экспорт
	
	Возврат 200;
	
КонецФункции

// Возвращает код состояния: был успешно создан новый ресурс доступный по URI, указанному в заголовке в поле Location.
//
// Возвращаемое значение:
//  Число - Код состояния http.
//
Функция КодСостоянияСоздано() Экспорт
	
	Возврат 201;
	
КонецФункции

// Возвращает код состояния: запрос был принят на обработку, но она не завершена.
//
// Возвращаемое значение:
//  Число - Код состояния http.
//
Функция КодСостоянияОжидание() Экспорт
	
	Возврат 202;
	
КонецФункции

// Возвращает код состояния: шлюз не отвечает.
//
// Возвращаемое значение:
//  Число - Код состояния http.
//
Функция КодСостоянияСервисНеОтвечает() Экспорт
	
	Возврат 504;
	
КонецФункции

// Возвращает код состояния: слишком большой размер тела запроса.
//
// Возвращаемое значение:
//  Число - Код состояния http.
//
Функция КодСостоянияСлишкомБольшойРазмерТелаЗапроса() Экспорт
	
	Возврат 413;
	
КонецФункции

#КонецОбласти

#Область ЗначенияКонстантПоУмолчанию

// См. Интеграция1СШтампКлиентСервер.ЗначениеОтступаОтКраевСтраницыПоУмолчанию
Функция ЗначениеОтступаОтКраевСтраницыПоУмолчанию() Экспорт
	
	Возврат 10;
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ЗначениеКоэффициентаПрозрачностиШтампаПоУмолчанию
Функция ЗначениеКоэффициентаПрозрачностиШтампаПоУмолчанию() Экспорт
	
	Возврат 128;
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ЗначениеКоэффициентаПрозрачностиШтампаПоУмолчанию
Функция ЗначениеКоэффициентаПрозрачностиШтампаНепрозрачный() Экспорт
	
	Возврат 255;
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.ЗначениеПрозрачностиПрозрачный
Функция ЗначениеПрозрачностиПрозрачный() Экспорт
	
	Возврат "Прозрачный";
	
КонецФункции

// Возвращает максимальное количество символов в описании пользовательского сценария.
//
// Возвращаемое значение:
//   Число - Количество символов.
//
Функция МаксимальноеКоличествоСимволовВОписанииПользовательскогоСценария() Экспорт
	
	Возврат 250;
	
КонецФункции

// Возвращает максимальный размер тела исходящего запроса.
//
// Возвращаемое значение:
//   Число - допустимый размер исходящего тела запроса (5 Мб).
//
Функция ДопустимыйРазмерИсходящегоТелаЗапроса() Экспорт
	
	Возврат 5242880;
	
КонецФункции

// Возвращает значение интервала повторного обращения к сервису по умолчанию, в секундах.
//
// Возвращаемое значение:
//   Число -Количество секунд. Значение по умолчанию - 1 секунда.
//
Функция ЗначениеИнтервалаПовторногоОбращенияКСервисуПоУмолчанию() Экспорт
	
	Возврат 1;
	
КонецФункции

// Возвращает минимальное количество символов в тексте тега.
//
// Возвращаемое значение:
//  Число - Количество символов.
//
Функция МинимальноеКоличествоСимволовТекстаТега() Экспорт
	
	Возврат 5;
	
КонецФункции

// Возвращает допустимый уровень вложенности параметров размещения штампов при альтернативном способе установки.
//
// Возвращаемое значение:
//   Число - допустимый уровень вложенности (5).
//
Функция ДопустимыйУровеньВложенностиПараметровРазмещенияШтампов() Экспорт
	
	Возврат 5;
	
КонецФункции

#КонецОбласти

#Область ЗначенияРасширенийФайлов

// Возвращает расширение файла PDF.
//
// Возвращаемое значение:
//  Строка - Значение расширения.
//
Функция РасширениеФайлаPDF() Экспорт
	
	Возврат "pdf";
	
КонецФункции

// Возвращает версию формата PDF/A-1.
//
// Возвращаемое значение:
//  Строка - Значение версии формата PDF.
//
Функция ВерсияФайлаPDF_A_1() Экспорт
	
	Возврат "pdf_a_1";
	
КонецФункции

// Возвращает версию формата PDF/A-2.
//
// Возвращаемое значение:
//  Строка - Значение версии формата PDF.
//
Функция ВерсияФайлаPDF_A_2() Экспорт
	
	Возврат "pdf_a_2";
	
КонецФункции

// Возвращает версию формата PDF/A-3.
//
// Возвращаемое значение:
//  Строка - Значение версии формата PDF.
//
Функция ВерсияФайлаPDF_A_3() Экспорт
	
	Возврат "pdf_a_3";
	
КонецФункции

#КонецОбласти

#Область Словарь

// См. Интеграция1СШтампКлиентСервер.СпособРазмещенияВверхуСлева
Функция СпособРазмещенияВверхуСлева() Экспорт
	
	Возврат "ЛевыйВерхнийУгол";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СпособРазмещенияВверхуСправа
Функция СпособРазмещенияВверхуСправа() Экспорт
	
	Возврат "ПравыйВерхнийУгол";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СпособРазмещенияВверхуПоЦентру
Функция СпособРазмещенияВверхуПоЦентру() Экспорт
	
	Возврат "ВверхуПоЦентру";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СпособРазмещенияВнизуСлева
Функция СпособРазмещенияВнизуСлева() Экспорт
	
	Возврат "ЛевыйНижнийУгол";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СпособРазмещенияВнизуСправа
Функция СпособРазмещенияВнизуСправа() Экспорт
	
	Возврат "ПравыйНижнийУгол";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СпособРазмещенияВнизуПоЦентру
Функция СпособРазмещенияВнизуПоЦентру() Экспорт
	
	Возврат "ВнизуПоЦентру";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СпособРазмещенияПоКоординатам
Функция СпособРазмещенияПоКоординатам() Экспорт
	
	Возврат "ПоКоординатам";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СпособРазмещенияПоТегам
Функция СпособРазмещенияПоТегам() Экспорт
	
	Возврат "ПоТегам";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СпособРасположенияНаКаждойСтранице
Функция СпособРасположенияНаКаждойСтранице() Экспорт
	
	Возврат "НаКаждойСтранице";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СпособРасположенияНаПервойСтранице
Функция СпособРасположенияНаПервойСтранице() Экспорт
	
	Возврат "НаПервойСтранице";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СпособРасположенияНаПоследнейСтранице
Функция СпособРасположенияНаПоследнейСтранице() Экспорт
	
	Возврат "НаПоследнейСтранице";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СпособРасположенияНаКаждойСтраницеКромеПоследней
Функция СпособРасположенияНаКаждойСтраницеКромеПоследней() Экспорт
	
	Возврат "НаКаждойСтраницеКромеПоследней";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СпособРасположенияНаКонкретнойСтранице
Функция СпособРасположенияНаКонкретнойСтранице() Экспорт
	
	Возврат "НаКонкретнойСтранице";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СпособРасположенияНаНовойСтранице
Функция СпособРасположенияНаНовойСтранице() Экспорт
	
	Возврат "НаНовойСтранице";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СпособУстановкиШтампаРаздвигаяТекст
Функция СпособУстановкиШтампаРаздвигаяТекст() Экспорт
	
	Возврат "РаздвигаяТекст";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СпособУстановкиШтампаНадТекстом
Функция СпособУстановкиШтампаНадТекстом() Экспорт
	
	Возврат "НадТекстом";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СтратегияРазмещенияГоризонтально
Функция СтратегияРазмещенияГоризонтально() Экспорт
	
	Возврат "Горизонтально";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СтратегияРазмещенияВертикально
Функция СтратегияРазмещенияВертикально() Экспорт
	
	Возврат "Вертикально";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СмещениеПоГоризонталиВправо
Функция СмещениеПоГоризонталиВправо() Экспорт
	
	Возврат "Право";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СмещениеПоГоризонталиВлево
Функция СмещениеПоГоризонталиВлево() Экспорт
	
	Возврат "Лево";
	
КонецФункции

// См. Интеграция1СШтампКлиентСервер.СмещениеПоГоризонталиАвто
Функция СмещениеПоГоризонталиАвто() Экспорт
	
	Возврат "Авто";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает массив допустимых расширений файлов для установки штампов.
//
// Возвращаемое значение:
//  Массив Из Строка - Строка расширения.
//
Функция ПоддерживаемыеРасширенияФайловДляШтампирования()
	
	МассивРасширений = Новый Массив;
	МассивРасширений.Добавить("pdf");
	МассивРасширений.Добавить("doc");
	МассивРасширений.Добавить("docx");
	МассивРасширений.Добавить("rtf");
	МассивРасширений.Добавить("odt");
	МассивРасширений.Добавить("ods");
	МассивРасширений.Добавить("xls");
	МассивРасширений.Добавить("xlsx");
	
	Возврат МассивРасширений;
	
КонецФункции

// Возвращает массив допустимых расширений файлов для установки штампов по тегам.
//
// Возвращаемое значение:
//  Массив Из Строка - Строка расширения.
//
Функция ПоддерживаемыеРасширенияФайловДляШтампированияПоТегам()
	
	МассивРасширений = Новый Массив;
	МассивРасширений.Добавить("doc");
	МассивРасширений.Добавить("docx");
	МассивРасширений.Добавить("odt");
	МассивРасширений.Добавить("rtf");
	
	Возврат МассивРасширений;
	
КонецФункции

// Список форматов документов сервиса, которые может визуализировать платформа 1С.
//
// Возвращаемое значение:
//   Массив из Строка - Массив расширений документов.
//
Функция СписокФорматовДокументовСервисаДляВизуализацииСредствамиПлатформы()
	
	ВизуализируемыеФорматы = Новый Массив;
	ВизуализируемыеФорматы.Добавить("pdf");
	
	Возврат ВизуализируемыеФорматы;
	
КонецФункции

#КонецОбласти