// Модуль менеджера справочника "Настройка печати комплекта"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения предопределенных элементов справочника
//
Процедура ЗаполнитьСпособФормированияДереваДокументов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкаПечатиКомплекта.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.НастройкаПечатиКомплекта КАК НастройкаПечатиКомплекта
	               |ГДЕ
	               |	НастройкаПечатиКомплекта.СпособФормированияДокументов = 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НастройкаПечатиОбъект = Выборка.Ссылка.ПолучитьОбъект();
		НастройкаПечатиОбъект.СпособФормированияДокументов = 2;
		
		НастройкаПечатиОбъект.ОбменДанными.Загрузка = Истина;
		
		Попытка
			НастройкаПечатиОбъект.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Настройки печати комплекта"". Обновлен элемент %1'"),,,,, СокрЛП(НастройкаПечатиОбъект.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Настройки печати комплекта""'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	ОбязательныеРеквизиты.Добавить("ТипДоступа");
	ОбязательныеРеквизиты.Добавить("СписокПечатныхФорм");
	ОбязательныеРеквизиты.Добавить("СпособФормированияДокументов");
	
	Если НЕ Объект.ТипДоступа = Перечисления.ТипыДоступаКВариантуОтчета.БезОграничения Тогда
		ОбязательныеРеквизиты.Добавить("ОбъектДоступа");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОписьКомплектаДокументов") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ОписьКомплектаДокументов",
															НСтр("ru = 'Опись комплекта документов'"),
															ОписьКомплектаДокументов(МассивОбъектов, ОбъектыПечати,ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры // Печать()

Функция ОписьКомплектаДокументов(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;

	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.НастройкаПечатиКомплекта.ОписьКомплектаДокументов");

	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
	ОбластьЗаголовок    = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрока       = Макет.ПолучитьОбласть("Строка");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("Шапка");
	ОбластьИтоги        = Макет.ПолучитьОбласть("Итоги");
	
	// Заголовок
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = НСтр("ru = 'Опись комплекта документов'");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	// Готовим шапку
	НомерСтраницы = 2; НомерСтраницыПредыдущий = 2;
		
	НаборПечатаемыхФорм= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПараметрыПечати.ОписьКомплектов);
	ВсегоЛистов = 0;
	Для Каждого Строка Из НаборПечатаемыхФорм Цикл
		
		ОписаниеМакета = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка,"|");
		
		// Если описание не соответствует переданному комплекту, пропустим
		Если НЕ ОписаниеМакета[0] = МассивОбъектов Тогда
			Продолжить;
		КонецЕсли;
		
		ОбластьСтрока.Параметры.Документ = ОписаниеМакета[1];
		ОбластьСтрока.Параметры.ПФ = ОписаниеМакета[2];
		ОбластьСтрока.Параметры.Количество = ОписаниеМакета[3];
		ВсегоЛистов = ВсегоЛистов + ОписаниеМакета[3];
		
		НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока,,, НомерСтраницы,, ПараметрыПечати.Комплект);
		
	КонецЦикла;
	
	ОбластьИтоги.Параметры.КоличествоЛистов = ВсегоЛистов;
	ТабличныйДокумент.Вывести(ОбластьИтоги);
	
	Возврат ТабличныйДокумент;
	
КонецФункции //ОписьКомплектаДокументов()

#КонецЕсли