
#Область ПрограммныйИнтерфейс

Функция GetData(DataKey, Parameters = Неопределено)
	
	обрIT_CubeExchange = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("erp_prodact_integ_WS_IT_CubeExchange");
	Если НЕ обрIT_CubeExchange.Пустая() Тогда
		//спрВнОбработкиОбъект = обрIT_CubeExchange.ПолучитьОбъект();
		//Адрес=ПоместитьВоВременноеХранилище(обрIT_CubeExchange.ХранилищеОбработки.Получить(),Новый УникальныйИдентификатор());
		Адрес = ПоместитьВоВременноеХранилище(обрIT_CubeExchange.ХранилищеОбработки.Получить(),Новый УникальныйИдентификатор());
		
		ЗащитаотОпасныхДействий = Новый ОписаниеЗащитыОтОпасныхДействий;
		ЗащитаотОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
		//ВнешняяОбработка = ДополнительныеОтчетыИОбработки.ПолучитьОбъектВнешнейОбработки(обрIT_CubeExchange);
		ПутьВнешняяОбработка = ВнешниеОбработки.Подключить(Адрес,, Ложь,ЗащитаотОпасныхДействий);
		ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьВнешняяОбработка, Ложь, ЗащитаотОпасныхДействий);
		Попытка
			Результат = СериализаторXDTO.ЗаписатьXDTO(ВнешняяОбработка.GetData(DataKey, Parameters));
		Исключение
			ТекстОшибки = ОписаниеОшибки();
		КонецПопытки;
		Возврат Результат;
		
		//Возврат СериализаторXDTO.ЗаписатьXDTO(ВнешняяОбработка.GetData(DataKey, Parameters));
	//КонецЕсли;
	//Если НЕ обрIT_CubeExchange.Пустая() Тогда
	//	
	//	ТекОбработкаIT_CubeExchange = ИТ_РегламентныеПроцедуры.ПолучитьВнешнююОбработку(обрIT_CubeExchange.Получитьобъект());
	//	Возврат СериализаторXDTO.ЗаписатьXDTO(ТекОбработкаIT_CubeExchange.GetData(DataKey, Parameters));
	Иначе
		// подготовка параметров
		КлючДанных			= DataKey;
		ВыгружаемыеДанные	= ПолучитьВыгружаемыеДанные_ПоУмолчанию();
		ТипПараметров		= ТипЗнч(Parameters);
		ВыгрузкаЧерезXML	= Истина;
		
		Если ТипПараметров = Тип("ЗначениеXDTO") Тогда 
			ПараметрыФункции = СериализаторXDTO.ПрочитатьXDTO(Parameters);
			//ИначеЕсли ТипПараметров = Тип("Строка")
			//	ИЛИ ТипПараметров = Тип("Число") 
			//	ИЛИ 
		Иначе
			ПараметрыФункции = Неопределено;	
		КонецЕсли;	
		
		// Формирование ответа	
		Если КлючДанных = "StoreLinks" Тогда 
			ПолучитьВыгружаемыеДанные_StoreLinks(ПараметрыФункции, ВыгружаемыеДанные);
		ИначеЕсли КлючДанных = "NomenclatureLinks" Тогда 	
			ПолучитьВыгружаемыеДанные_NomenclatureLinks(ПараметрыФункции, ВыгружаемыеДанные);	
		Иначе 
			ВыгружаемыеДанные.Ошибки.Добавить("Ключ данных не поддерживается.");
		КонецЕсли;
		
		// ВОЗВРАТ
		Если ВыгрузкаЧерезXML Тогда 
			ЗаписьXML = Новый ЗаписьXML();
			ЗаписьXML.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ВыгружаемыеДанные);
			СериализованныйОтвет = СериализаторXDTO.ЗаписатьXDTO(ЗаписьXML.Закрыть());
		Иначе	
			СериализованныйОтвет = СериализаторXDTO.ЗаписатьXDTO(ВыгружаемыеДанные);	
		КонецЕсли;	
		
		Возврат СериализованныйОтвет;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область ПолучениеДанных

Функция ПолучитьВыгружаемыеДанные_ПоУмолчанию()
	
	ВыгружаемыеДанные = Новый Структура();
	ВыгружаемыеДанные.Вставить("Ошибки",			Новый Массив());
	ВыгружаемыеДанные.Вставить("Данные",			Новый Структура());
	ВыгружаемыеДанные.Вставить("ТаблицаЗаписей",	Неопределено);
	
	Возврат ВыгружаемыеДанные;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьВыгружаемыеДанные_StoreLinks(ПараметрыФункции, ВыгружаемыеДанные)
	
	//ПараметрыПостроения	= ИТ_РаботаСМагазинамиСервер.ПолучитьПараметрыПостроения(,,,, Истина, Истина,,,,,,,,, Истина, Истина,,, "ЕРПМастерКлюч,ит_ДатаОткрытия,ит_ДатаЗакрытия");	
	//ДанныеМагазинов		= ИТ_РаботаСМагазинамиСервер.ПолучитьДанныеПоМагазинам(ПараметрыПостроения);
	//
	//	Запрос = Новый Запрос();
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ДанныеМагазинов.ИдентификаторUKM КАК StoreID_Numeric,
	//	|	ДанныеМагазинов.ИдентификаторUKM_Строка КАК StoreID_String,
	//	|	ДанныеМагазинов.Магазин_ЕРПМастерКлюч КАК ERPMasterKey,
	//	|	ДанныеМагазинов.Магазин_ит_ДатаОткрытия КАК OpenDate,
	//	|	ДанныеМагазинов.Магазин_ит_ДатаЗакрытия КАК CloseDate,
	//	|	ДанныеМагазинов.Открыт КАК Opened
	//	|ПОМЕСТИТЬ ДанныеВыгрузки
	//	|ИЗ
	//	|	&ДанныеМагазинов КАК ДанныеМагазинов
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ДанныеВыгрузки.StoreID_Numeric,
	//	|	ДанныеВыгрузки.StoreID_String,
	//	|	ДанныеВыгрузки.ERPMasterKey,
	//	|	ДанныеВыгрузки.OpenDate,
	//	|	ДанныеВыгрузки.CloseDate,
	//	|	ДанныеВыгрузки.Opened
	//	|ИЗ
	//	|	ДанныеВыгрузки КАК ДанныеВыгрузки";
	//
	//Запрос.УстановитьПараметр("ДанныеМагазинов", ДанныеМагазинов); 

	Запрос = Новый Запрос();
	 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	0 КАК Цифра,
		|	""0"" КАК Цифра_Строка
		|ПОМЕСТИТЬ Цифры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1,
		|	""1""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	""2""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3,
		|	""3""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	4,
		|	""4""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	5,
		|	""5""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	6,
		|	""6""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	7,
		|	""7""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	8,
		|	""8""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	9,
		|	""9""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Цифры.Цифра + Десятки.Цифра * 10 + Сотни.Цифра * 100 + Тысячи.Цифра * 1000 КАК ЧИСЛО(4, 0)) КАК Число,
		|	ВЫБОР
		|		КОГДА Цифры.Цифра + Десятки.Цифра * 10 + Сотни.Цифра * 100 + Тысячи.Цифра * 1000 < 1000
		|				И Тысячи.Цифра = 0
		|			ТОГДА """"
		|		ИНАЧЕ Тысячи.Цифра_Строка
		|	КОНЕЦ + ВЫБОР
		|		КОГДА Цифры.Цифра + Десятки.Цифра * 10 + Сотни.Цифра * 100 + Тысячи.Цифра * 1000 < 100
		|				И Сотни.Цифра = 0
		|			ТОГДА """"
		|		ИНАЧЕ Сотни.Цифра_Строка
		|	КОНЕЦ + ВЫБОР
		|		КОГДА Цифры.Цифра + Десятки.Цифра * 10 + Сотни.Цифра * 100 + Тысячи.Цифра * 1000 < 10
		|				И Десятки.Цифра = 0
		|			ТОГДА """"
		|		ИНАЧЕ Десятки.Цифра_Строка
		|	КОНЕЦ + Цифры.Цифра_Строка КАК Число_Строка
		|ПОМЕСТИТЬ ТаблицаЧисел
		|ИЗ
		|	Цифры КАК Цифры,
		|	Цифры КАК Десятки,
		|	Цифры КАК Сотни,
		|	Цифры КАК Тысячи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Цифры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ПодразделенияКомпании.ит_StoreID КАК ЧИСЛО) КАК StoreID_Numeric,
		|	ЕСТЬNULL(ТаблицаЧисел.Число_Строка, """") КАК StoreID_String,
		|	ПодразделенияКомпании.ЕРПМастерКлюч КАК ERPMasterKey,
		|	ПодразделенияКомпании.ит_ДатаОткрытия КАК OpenDate,
		|	ПодразделенияКомпании.ит_ДатаЗакрытия КАК CloseDate,
		|	НЕ ПодразделенияКомпании.ит_Закрыта КАК Opened
		|ПОМЕСТИТЬ ДанныеВыгрузки
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЧисел КАК ТаблицаЧисел
		|		ПО ПодразделенияКомпании.ит_StoreID = ТаблицаЧисел.Число
		|ГДЕ
		|	ПодразделенияКомпании.РольПодразделения = ЗНАЧЕНИЕ(Справочник.РолиПодразделений.Магазин)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеВыгрузки.StoreID_Numeric,
		|	ДанныеВыгрузки.StoreID_String,
		|	ДанныеВыгрузки.ERPMasterKey,
		|	ДанныеВыгрузки.OpenDate,
		|	ДанныеВыгрузки.CloseDate,
		|	ДанныеВыгрузки.Opened
		|ИЗ
		|	ДанныеВыгрузки КАК ДанныеВыгрузки";
	
//	Запрос.УстановитьПараметр("ДанныеМагазинов", ДанныеМагазинов); 
	
	Результат = Запрос.Выполнить();
	ВыгружаемыеДанные.Данные = Результат.Выгрузить(); 
	
КонецПроцедуры	

Процедура ПолучитьВыгружаемыеДанные_NomenclatureLinks(ПараметрыФункции, ВыгружаемыеДанные)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.Артикул КАК NomenclatureArticle,
		|	Номенклатура.АртикулСтарый КАК NomenclatureOldArticle,
		|	Номенклатура.ЕРПМастерКлюч КАК NomenclatureMasterKey
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура";
	
	Результат = Запрос.Выполнить();
	ВыгружаемыеДанные.Данные = Результат.Выгрузить();  
	
КонецПроцедуры	

#КонецОбласти
