
Процедура ЕРПОбработкаПроверкиЗаполненияПередЗаписью(Источник, Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	//ОтказаноВРедактировании = ОпределитьЗапретРедактирования(Источник.Метаданные().Имя) И НЕ РольДоступна("ПолныеПрава") И НЕ Источник.ОбменДанными.Загрузка;
	МетаданныеИсточника = Источник.Метаданные();
	ОтказаноВРедактировании = ОпределитьЗапретРедактирования(МетаданныеИсточника.Имя) И НЕ Источник.ОбменДанными.Загрузка;
	Если Источник.ЭтоНовый() Тогда
		Отказ = ОтказаноВРедактировании;
		
		Если Отказ Тогда
			ТекстСообщения = НСтр("ru = 'ЕРП (подсистема НСИ). Добавление новых позиций в справочник запрещено.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;	
		
		Если Не Отказ И ОпределитьРегистрироватьНовые(МетаданныеИсточника.Имя) Тогда
			Источник.ЕРППризнакНовый = ИСТИНА;
		КонецЕсли;	
	ИначеЕсли ОтказаноВРедактировании Тогда
		СсылкаНаЭлемент = Источник.Ссылка;
		
		ИмяСправочник = МетаданныеИсточника.Имя;
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЕРПМаппингДляЗагрузкиМаппинг.ИмяРеквизита
		               |ИЗ
		               |	Справочник.ЕРПМаппингДляЗагрузки.Маппинг КАК ЕРПМаппингДляЗагрузкиМаппинг
		               |ГДЕ
		               |	ЕРПМаппингДляЗагрузкиМаппинг.Ссылка.ТипМетаданныхСправочника = &ИмяСправочника
		               |	И НЕ ЕРПМаппингДляЗагрузкиМаппинг.Ссылка.ПометкаУдаления
		               |	И ЕРПМаппингДляЗагрузкиМаппинг.Пометка";
		Запрос.УстановитьПараметр("ИмяСправочника", ИмяСправочник);
		ТаблицаСписокРеквизитов = Запрос.Выполнить().Выгрузить();
		
		ТекстЗапроса = "";
		Для Каждого Строка Из ТаблицаСписокРеквизитов Цикл
			РеквизитМетаданных = МетаданныеИсточника.Реквизиты.Найти(Строка.ИмяРеквизита);
			Если РеквизитМетаданных = Неопределено Тогда
				Для Каждого СтандартныйРеквизитМетаданных Из МетаданныеИсточника.СтандартныеРеквизиты Цикл
					Если СтандартныйРеквизитМетаданных.Имя = Строка.ИмяРеквизита Тогда
						РеквизитМетаданных = СтандартныйРеквизитМетаданных;
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;	
			
			Если РеквизитМетаданных <> Неопределено  Тогда
				ТекстЗапроса = ТекстЗапроса + " " + ИмяСправочник + "." + Строка.ИмяРеквизита + ",";
			КонецЕсли;	
		КонецЦикла;	
		
		Если ТекстЗапроса <> "" Тогда
			//+++МР_Галюжин+++ 04.07.2018 проверка для ПВХ			
			//ТекстЗапроса = "ВЫБРАТЬ " + Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса) - 1) + " ИЗ Справочник." + ИмяСправочник + " КАК " + ИмяСправочник + " ГДЕ " + ИмяСправочник + ".Ссылка = &Ссылка";
			ЭтоПВХ = (СтрНайти(МетаданныеИсточника.ПолноеИмя(), "ПланВидовХарактеристик") <> 0);
			ТекстЗапроса = "ВЫБРАТЬ " + Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса) - 1) 
				+ ?(ЭтоПВХ, " ИЗ ПланВидовХарактеристик.", " ИЗ Справочник.") + ИмяСправочник + " КАК " + ИмяСправочник + " ГДЕ " + ИмяСправочник + ".Ссылка = &Ссылка";
			//---МР_Галюжин--- 04.07.2018 проверка для ПВХ			
			Запрос = Новый Запрос();
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Ссылка", СсылкаНаЭлемент);
			ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
			Если ТаблицаРезультат.Количество() <> 0 Тогда
				Для Каждого Строка Из ТаблицаРезультат Цикл
					Для Каждого Колонка Из ТаблицаРезультат.Колонки Цикл
						Если Строка[Колонка.Имя] <> Источник[Колонка.Имя] Тогда
							Отказ = ИСТИНА;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;	
		КонецЕсли;	
		
		Если Отказ Тогда
			ТекстСообщения = НСтр("ru = 'ЕРП (подсистема НСИ). Редактирование реквизитов для обмена справочника запрещено.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Функция ОпределитьЗапретРедактирования(ТипМетаданныхСправочника)
	РезультатДляВозврата = ЛОЖЬ;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕРПМаппингДляЗагрузки.ЗапретРедактированияСправочника
	               |ИЗ
	               |	Справочник.ЕРПМаппингДляЗагрузки КАК ЕРПМаппингДляЗагрузки
	               |ГДЕ
	               |	НЕ ЕРПМаппингДляЗагрузки.ПометкаУдаления
	               |	И ЕРПМаппингДляЗагрузки.ТипМетаданныхСправочника = &ТипМетаданныхСправочника
	               |	И ЕРПМаппингДляЗагрузки.ЗапретРедактированияСправочника";
	Запрос.УстановитьПараметр("ТипМетаданныхСправочника", ТипМетаданныхСправочника);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		РезультатДляВозврата = ИСТИНА;
	КонецЕсли;
	
	Возврат(РезультатДляВозврата);
КонецФункции	

Функция ОпределитьРегистрироватьНовые(ТипМетаданныхСправочника)
	РезультатДляВозврата = ЛОЖЬ;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕРПМаппингДляЗагрузки.РегистрироватьНовые
	               |ИЗ
	               |	Справочник.ЕРПМаппингДляЗагрузки КАК ЕРПМаппингДляЗагрузки
	               |ГДЕ
	               |	НЕ ЕРПМаппингДляЗагрузки.ПометкаУдаления
	               |	И ЕРПМаппингДляЗагрузки.ТипМетаданныхСправочника = &ТипМетаданныхСправочника
	               |	И ЕРПМаппингДляЗагрузки.РегистрироватьНовые";
	Запрос.УстановитьПараметр("ТипМетаданныхСправочника", ТипМетаданныхСправочника);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		РезультатДляВозврата = ИСТИНА;
	КонецЕсли;
	
	Возврат(РезультатДляВозврата);
КонецФункции	

Процедура ЕРПОбработкаПриКопированииПриКопировании(Источник, ОбъектКопирования) Экспорт
	Источник.ЕРПМастерКлюч = "";
	Источник.ЕРПЗначениеСчетчика = 0;
КонецПроцедуры

//++ Попов Л.Г., 2025-12-29, Интеграция с Общепит
Процедура ит_ЗакрытиеСменыКВыгрузке(Источник, Отказ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗакрытиеСмены") 
		И Источник.КассаККМ = Справочники.КассыККМ.НайтиПоКоду("ФР0004720") Тогда
	    РегистрыСведений.ит_ЗакрытиеСменыКВыгрузке.СоздатьЗаписьРС(Источник.Ссылка);
	КонецЕсли;
КонецПроцедуры
//-- Попов Л.Г., 2025-12-29

//++ Попов Л.Г., 2026-06-23, Интеграция с БП
Процедура ит_ПоступлениеТоваровВыгрузкаБПШинаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеТоваров") Тогда
	    РегистрыСведений.ит_ОбъектыКВыгрузкиВБП.СоздатьЗаписьРС(Источник.Ссылка);
	КонецЕсли;
КонецПроцедуры
//-- Попов Л.Г., 2026-06-23


