// Модуль документа "Маркетинговая акция"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА


// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// Произведем заполнение реквизитов документа
	Если НЕ ЗначениеЗаполнено(ДатаНачалаДействия) Тогда
		ДатаНачалаДействия = Дата;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	// Произведем заполнение реквизитов документа
	ДатаНачалаДействия = ТекущаяДатаСеанса();
	
КонецПроцедуры

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ,Проведение=Ложь)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	//Мальцев А.Ю. +++
	ВыполнитьПроверкуМРЦ(Отказ);		
	//Мальцев А.Ю. ---	
	
	МассивПодразделений = Подразделения.ВыгрузитьКолонку("ПодразделениеКомпании");
	Если МассивПодразделений.Количество() = 0 Тогда
		МассивПодразделений.Добавить(ПодразделениеКомпании);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидАкции.Скидка) Тогда
		Для Каждого ТекущееПодразделение Из МассивПодразделений Цикл
			// Делаем движения по регистру "СкидкиСтроки"
			НаборЗаписейСкидки = Движения.СкидкиСтроки;
			НаборЗаписейСкидки.ДокументСсылка            = Ссылка;
			НаборЗаписейСкидки.ПодразделениеКомпании     = ТекущееПодразделение;
			НаборЗаписейСкидки.РезультатЗапросаПоСкидкам = Документы.МаркетинговаяАкция.ПолучитьТаблицуСкидок(ЭтотОбъект,ТекущееПодразделение);
			
			Если ХозОперация = Справочники.ХозОперации.МаркетинговаяАкция Тогда
				// Установка скидки на строку документа
				Отказ = Отказ ИЛИ НаборЗаписейСкидки.УстановитьСкидки();
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения

//Мальцев А.Ю. +++
Процедура ВыполнитьПроверкуМРЦ(Отказ)
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаркетинговаяАкцияТовары.ЗначениеСкидки КАК Цена,
	|	МаркетинговаяАкцияТовары.Номенклатура КАК Номенклатура,
	|	МаркетинговаяАкцияТовары.Номенклатура.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	МаркетинговаяАкцияТовары.НомерСтроки КАК НомерСтроки,
	|	МаркетинговаяАкцияТовары.СпособВычисления КАК СпособВычисления
	|ПОМЕСТИТЬ втДанныеДокумента
	|ИЗ
	|	Документ.МаркетинговаяАкция.Товары КАК МаркетинговаяАкцияТовары
	|ГДЕ
	|	МаркетинговаяАкцияТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	Номенклатура.ВидАлкогольнойПродукции.Родитель КАК ГруппаГАК,
	|	Номенклатура.ВидАлкогольнойПродукции.Родитель.итНомерГруппыГАК КАК НомерГруппыГАК,
	|	Номенклатура.ВидАлкогольнойПродукции.Родитель.итУдельныйОбъем КАК УдельныйОбъем,
	|	Номенклатура.Крепость КАК Крепость,
	|	Номенклатура.Объем КАК Объем,
	|	Номенклатура.ЕРПМастерКлюч КАК ЕРПМастерКлюч
	|ПОМЕСТИТЬ втНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В
	|			(ВЫБРАТЬ
	|				втДанныеДокумента.Номенклатура КАК Номенклатура
	|			ИЗ
	|				втДанныеДокумента КАК втДанныеДокумента
	|			ГДЕ
	|				втДанныеДокумента.СпособВычисления = &ФиксированнаяЦена)
	|	И Номенклатура.ВидАлкогольнойПродукции <> ЗНАЧЕНИЕ(Справочник.ВидыАлкогольнойПродукции.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итУдельныеРозничныеЦеныСрезПоследних.Группа КАК Группа,
	|	итУдельныеРозничныеЦеныСрезПоследних.Крепость КАК Крепость,
	|	итУдельныеРозничныеЦеныСрезПоследних.УдельнаяЦена КАК УдельнаяЦена
	|ПОМЕСТИТЬ втУдельныеЦены
	|ИЗ
	|	РегистрСведений.итУдельныеРозничныеЦены.СрезПоследних(&Период, ) КАК итУдельныеРозничныеЦеныСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф.Ссылка КАК Группа,
	|	ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф.МинимальныйОбъем КАК МинимальныйОбъем,
	|	ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф.МаксимальныйОбъем КАК МаксимальныйОбъем,
	|	ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф.ОбъемИскл КАК ОбъемИскл
	|ПОМЕСТИТЬ втИключенияОбъемныхКоэфф
	|ИЗ
	|	Справочник.ВидыАлкогольнойПродукции.итИсключенияОбъемныхКоэфф КАК ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНоменклатура.Номенклатура КАК Номенклатура,
	|	втНоменклатура.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	втНоменклатура.ГруппаГАК КАК ГруппаГАК,
	|	втНоменклатура.НомерГруппыГАК КАК НомерГруппыГАК,
	|	втНоменклатура.УдельныйОбъем КАК УдельныйОбъем,
	|	втНоменклатура.Крепость КАК Крепость,
	|	втНоменклатура.Объем КАК Объем,
	|	ЕСТЬNULL(втУдельныеЦены.УдельнаяЦена, 0) КАК УдельнаяЦена,
	|	ЕСТЬNULL(втИключенияОбъемныхКоэфф.ОбъемИскл, 0) КАК ОбъемИскл,
	|	втНоменклатура.ЕРПМастерКлюч КАК ЕРПМастерКлюч
	|ПОМЕСТИТЬ втСгруппированнаяТаблица
	|ИЗ
	|	втНоменклатура КАК втНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втУдельныеЦены КАК втУдельныеЦены
	|		ПО втНоменклатура.ГруппаГАК = втУдельныеЦены.Группа
	|			И втНоменклатура.Крепость = втУдельныеЦены.Крепость
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИключенияОбъемныхКоэфф КАК втИключенияОбъемныхКоэфф
	|		ПО втНоменклатура.Объем > втИключенияОбъемныхКоэфф.МинимальныйОбъем
	|			И втНоменклатура.Объем <= втИключенияОбъемныхКоэфф.МаксимальныйОбъем
	|			И втНоменклатура.ГруппаГАК <= втИключенияОбъемныхКоэфф.Группа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСгруппированнаяТаблица.Номенклатура КАК Номенклатура,
	|	втСгруппированнаяТаблица.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	втСгруппированнаяТаблица.ГруппаГАК КАК ГруппаГАК,
	|	втСгруппированнаяТаблица.НомерГруппыГАК КАК НомерГруппыГАК,
	|	втСгруппированнаяТаблица.УдельныйОбъем КАК УдельныйОбъем,
	|	втСгруппированнаяТаблица.Крепость КАК Крепость,
	|	втСгруппированнаяТаблица.Объем КАК Объем,
	|	втСгруппированнаяТаблица.УдельнаяЦена КАК УдельнаяЦена,
	|	втСгруппированнаяТаблица.ОбъемИскл КАК ОбъемИскл,
	|	ВЫБОР
	|		КОГДА втСгруппированнаяТаблица.УдельныйОбъем = 0
	|			ТОГДА 0
	|		КОГДА втСгруппированнаяТаблица.ОбъемИскл > 0
	|			ТОГДА втСгруппированнаяТаблица.УдельнаяЦена * втСгруппированнаяТаблица.ОбъемИскл / втСгруппированнаяТаблица.УдельныйОбъем
	|		ИНАЧЕ втСгруппированнаяТаблица.УдельнаяЦена * втСгруппированнаяТаблица.Объем / втСгруппированнаяТаблица.УдельныйОбъем
	|	КОНЕЦ КАК МРЦ,
	|	втСгруппированнаяТаблица.ЕРПМастерКлюч КАК ЕРПМастерКлюч
	|ПОМЕСТИТЬ втИтоговая
	|ИЗ
	|	втСгруппированнаяТаблица КАК втСгруппированнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтоговая.Номенклатура КАК Номенклатура,
	|	втИтоговая.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	втИтоговая.ГруппаГАК КАК ГруппаГАК,
	|	втИтоговая.НомерГруппыГАК КАК НомерГруппыГАК,
	|	втИтоговая.УдельныйОбъем КАК УдельныйОбъем,
	|	втИтоговая.Крепость КАК Крепость,
	|	втИтоговая.Объем КАК Объем,
	|	втИтоговая.УдельнаяЦена КАК УдельнаяЦена,
	|	втИтоговая.ОбъемИскл КАК ОбъемИскл,
	|	втИтоговая.МРЦ КАК МРЦ,
	|	втИтоговая.ЕРПМастерКлюч КАК ЕРПМастерКлюч,
	|	втДанныеДокумента.Номенклатура КАК НоменклатураДокумента,
	|	втДанныеДокумента.Цена КАК Цена,
	|	втДанныеДокумента.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	втДанныеДокумента КАК втДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИтоговая КАК втИтоговая
	|		ПО втДанныеДокумента.Номенклатура = втИтоговая.Номенклатура
	|			И (втИтоговая.МРЦ > 0)
	|			И втДанныеДокумента.Цена < втИтоговая.МРЦ
	|ГДЕ
	|	НЕ втИтоговая.Номенклатура ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеДокумента.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	втДанныеДокумента.Номенклатура КАК Номенклатура,
	|	втДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	втДанныеДокумента.СпособВычисления КАК СпособВычисления,
	|	втДанныеДокумента.Цена КАК Цена
	|ИЗ
	|	втДанныеДокумента КАК втДанныеДокумента
	|ГДЕ
	|	втДанныеДокумента.СпособВычисления <> &ФиксированнаяЦена
	|	И втДанныеДокумента.ВидАлкогольнойПродукции <> ЗНАЧЕНИЕ(Справочник.ВидыАлкогольнойПродукции.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ФиксированнаяЦена", Перечисления.СкидкиСпособВычисления.ФиксированнаяЦена);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[6].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строка " + Строка(ВыборкаДетальныеЗаписи.НомерСтроки) + ", позиция " + Строка(ВыборкаДетальныеЗаписи.Номенклатура) + 
														  ". Цена меньше минимальной розничной цены " + Строка(ВыборкаДетальныеЗаписи.МРЦ) + ". Проведение не выполнено.");
	КонецЦикла;
	
	ВыборкаДетальныеЗаписиНеФикс = РезультатыЗапроса[7].Выбрать();
	
	Пока ВыборкаДетальныеЗаписиНеФикс.Следующий() Цикл
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строка " + Строка(ВыборкаДетальныеЗаписиНеФикс.НомерСтроки) + ", позиция " + Строка(ВыборкаДетальныеЗаписиНеФикс.Номенклатура) + 
														  ". Для алкогольной продукции возможна скидка устанавливается только по фиксированным ценам.");
	КонецЦикла;

	Если Отказ Тогда	
		ЗаписьЖурналаРегистрации("Проверка МРЦ", УровеньЖурналаРегистрации.Ошибка,,Ссылка,"Ошибка при проверке МРЦ");
	КонецЕсли;
	
КонецПроцедуры
//Мальцев А.Ю. ---	


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли