////////////////////////////////////////////////////////////////////////////////
// Подсистема "Клиент ЭДО".
// ОбщийМодуль.ТорговыйКомплексСопоставлениеНоменклатурыКонтрагентовЭДО.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПереопределяемыеПроцедурыИФункции

#Область РаботаСоСправочникомНоменклатураКонтрагентов

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриИзмененииНоменклатурыСопоставления_НоменклатураКонтрагентов.
//
Процедура ПриИзмененииНоменклатурыСопоставления_НоменклатураКонтрагентов(Форма, ДанныеСопоставления) Экспорт
	
	Если ДанныеСопоставления.Номенклатура.Пустая() Тогда
		ДанныеСопоставления.ИспользоватьХарактеристики  = Ложь;
		ДанныеСопоставления.Характеристика              = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		ДанныеСопоставления.Упаковка                    = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
		ДанныеСопоставления.ЕдиницаИзмеренияПоУмолчанию = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
		Возврат;
	КонецЕсли;
	
	// Читаем данные номенклатуры из ИБ
	РеквизитыНоменклатуры = Новый Структура;
	РеквизитыНоменклатуры.Вставить("ИспользованиеХарактеристик", "ТипНоменклатуры.ИспользованиеХарактеристик");
	РеквизитыНоменклатуры.Вставить("Упаковка"                  , "ОсновнаяЕдиницаИзмерения");
	РеквизитыНоменклатуры.Вставить("ТипНоменклатуры"           , "ТипНоменклатуры");
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеСопоставления.Номенклатура, РеквизитыНоменклатуры);
	УстановитьПривилегированныйРежим(Ложь);
	
	// Очищаем характеристику, если она не используется
	Если ДанныеНоменклатуры.ИспользованиеХарактеристик<3 Тогда
		ДанныеСопоставления.ИспользоватьХарактеристики = Истина;
	Иначе
		ДанныеСопоставления.ИспользоватьХарактеристики = Ложь;
		ДанныеСопоставления.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	// Если характеристика используется, проверяем ее принадлежность к номенклатуре
	Если ЗначениеЗаполнено(ДанныеСопоставления.Характеристика) Тогда
		
		// Определяем фактического владельца характеристики
		УстановитьПривилегированныйРежим(Истина);
		ВладелецХарактеристики = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСопоставления.Характеристика, "Владелец");
		УстановитьПривилегированныйРежим(Ложь);
		
		// Определяем, кто должен быть владельцем характеристики
		КорректныйВладелецХарактеристики = ?(ДанныеНоменклатуры.ИспользованиеХарактеристик=2, 
			ДанныеСопоставления.Номенклатура, ДанныеНоменклатуры.ТипНоменклатуры);
		
		// Если характеристика не принадлежит данной номенклатуре, то очищаем характеристику
		Если Не ВладелецХарактеристики = КорректныйВладелецХарактеристики Тогда
			ДанныеСопоставления.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
	
	// Заполняем сведения об упаковках
	ДанныеСопоставления.Упаковка                    = ДанныеНоменклатуры.Упаковка;
	ДанныеСопоставления.ЕдиницаИзмеренияПоУмолчанию = ДанныеНоменклатуры.Упаковка;
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ОбработкаПолученияДанныхВыбора_НоменклатураКонтрагентов
//
Процедура ОбработкаПолученияДанныхВыбора_НоменклатураКонтрагентов(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт

	Если Параметры.Отбор.Свойство("Номенклатура") Тогда
		Номенклатура = Параметры.Отбор.Номенклатура;
		Параметры.Отбор.Удалить("Номенклатура");
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Характеристика") Тогда
		Характеристика = Параметры.Отбор.Характеристика;
		Параметры.Отбор.Удалить("Характеристика");
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Упаковка") Тогда
		Упаковка = Параметры.Отбор.Упаковка;
		Параметры.Отбор.Удалить("Упаковка");
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ВладелецНоменклатуры") Тогда
		ВладелецНоменклатуры = Параметры.Отбор.ВладелецНоменклатуры;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	СтрокаПоиска = СокрЛП(Параметры.СтрокаПоиска);
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтрокаПоиска", ?(СтрокаПоиска = Неопределено, "", СтрокаПоиска) + "%");
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|ГДЕ
	|	НЕ НоменклатураКонтрагентов.ПометкаУдаления
	|	И (НоменклатураКонтрагентов.Артикул ПОДОБНО &СтрокаПоиска
	|			ИЛИ НоменклатураКонтрагентов.Наименование ПОДОБНО &СтрокаПоиска)
	|	И НЕ НоменклатураКонтрагентов.Недействителен
	|	//%ПрочиеУсловия";
	
	ПрочиеУсловия = "";
	ЧастьУсловия = " И НоменклатураКонтрагентов.%Параметр = &%Параметр";
	Если ЗначениеЗаполнено(ВладелецНоменклатуры) Тогда
		Запрос.УстановитьПараметр("ВладелецНоменклатуры", ВладелецНоменклатуры);
		ПрочиеУсловия = ПрочиеУсловия + СтрЗаменить(ЧастьУсловия, "%Параметр", "ВладелецНоменклатуры");
	КонецЕсли;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		ПрочиеУсловия = ПрочиеУсловия + СтрЗаменить(ЧастьУсловия, "%Параметр", "Номенклатура");
	КонецЕсли;
	Если ЗначениеЗаполнено(Характеристика) Тогда
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
		ПрочиеУсловия = ПрочиеУсловия + СтрЗаменить(ЧастьУсловия, "%Параметр", "Характеристика");
	КонецЕсли;
	Если ЗначениеЗаполнено(Упаковка) Тогда
		Запрос.УстановитьПараметр("Упаковка", Упаковка);
		ПрочиеУсловия = ПрочиеУсловия + СтрЗаменить(ЧастьУсловия, "%Параметр", "Упаковка");
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса,"//%ПрочиеУсловия", ПрочиеУсловия);
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
КонецПроцедуры

Функция ВыполнитьПоискНоменклатурыКонтрагентов(Контрагент, Номенклатура, ХарактеристикаНоменклатуры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НоменклатураКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|ГДЕ
	|	НоменклатураКонтрагентов.Номенклатура = &Номенклатура
	|	И НоменклатураКонтрагентов.ВладелецНоменклатуры = &Владелец
	|	И НоменклатураКонтрагентов.Характеристика = &ХарактеристикаНоменклатуры
	|	И НЕ НоменклатураКонтрагентов.ПометкаУдаления
	|	И НЕ НоменклатураКонтрагентов.Недействителен";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",?(ХарактеристикаНоменклатуры = Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ХарактеристикаНоменклатуры));
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РаботаСЕдиницамиИзмерения

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриОпределенииСвойствУпаковкиЕдиницыИзмеренияНоменклатуры
Процедура ПриОпределенииСвойствУпаковкиЕдиницыИзмеренияНоменклатуры(Знач Упаковка, Знач Номенклатура, СвойстваУпаковки) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Наименование КАК НаименованиеБазовойЕдиницыИзмерения,
	|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код КАК КодОКЕИБазовойЕдиницыИзмерения,
	|	ЕдиницыИзмерения.Наименование КАК НаименованиеУпаковки,
	|	ЕдиницыИзмерения.Коэффициент КАК КоличествоБазовойЕдиницыИзмерения
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.Ссылка = &Упаковка"
	);
	Запрос.УстановитьПараметр("Упаковка", Упаковка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Упаковки = РезультатЗапроса.Выбрать();
	Упаковки.Следующий();
	ЗаполнитьЗначенияСвойств(СвойстваУпаковки, Упаковки);
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.НайтиНаименованиеЕдиницыИзмеренияПоКодуОКЕИ
Процедура НайтиНаименованиеЕдиницыИзмеренияПоКодуОКЕИ(КодОКЕИЕдиницыИзмерения, НаименованиеЕдиницыИзмерения) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КлассификаторЕдиницИзмерения.Наименование КАК Наименование
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|ГДЕ
	|	КлассификаторЕдиницИзмерения.Код = &Код
	|	И НЕ КлассификаторЕдиницИзмерения.ПометкаУдаления"
	);
	Запрос.УстановитьПараметр("Код", КодОКЕИЕдиницыИзмерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		НаименованиеЕдиницыИзмерения = "";
		Возврат;
		
	КонецЕсли;
	
	КлассификаторыЕдиницИзмерения = РезультатЗапроса.Выбрать();
	КлассификаторыЕдиницИзмерения.Следующий();
	НаименованиеЕдиницыИзмерения = КлассификаторыЕдиницИзмерения.Наименование;
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.БазоваяЕдиницаИзмеренияНоменклатуры
Процедура БазоваяЕдиницаИзмеренияНоменклатуры(Знач Номенклатура, ЕдиницаИзмерения) Экспорт

	ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ОсновнаяЕдиницаИзмерения");
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ВладелецУпаковкиЕдиницыИзмеренияНоменклатура
Процедура ВладелецУпаковкиЕдиницыИзмеренияНоменклатура(Знач Упаковка, ВладелецУпаковкиНоменклатура) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕдиницыИзмерения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.Владелец ССЫЛКА Справочник.Номенклатура
	|	И ЕдиницыИзмерения.Ссылка = &Упаковка"
	);
	Запрос.УстановитьПараметр("Упаковка", Упаковка);
	
	ВладелецУпаковкиНоменклатура = Не Запрос.Выполнить().Пустой();
	
КонецПроцедуры

#КонецОбласти

#Область СопоставлениеНоменклатурыВДокументах

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.СформироватьТаблицуСопоставленияНоменклатурыКонтрагентовВДокументах
Процедура СформироватьТаблицуСопоставленияНоменклатурыКонтрагентовВДокументах(
	Знач НаборДокументов, ТаблицаСопоставления, ОткрыватьФормуДляИзмененияСопоставления) Экспорт
	
	ОткрыватьФормуДляИзмененияСопоставления = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборДокументов", НаборДокументов);
	Запрос.УстановитьПараметр("ПредставлениеНоменклатурыКлиента", НСтр("ru = 'Номенклатура клиента'"));
	Запрос.УстановитьПараметр("ПредставлениеНоменклатурыПоставщика", НСтр("ru = 'Номенклатура поставщика'"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка КАК СсылкаНаДокумент,
	|	ЗаказПокупателяТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ЗаказПокупателяТовары.ЕдиницаИзмерения КАК Упаковка,
	|	ЗаказПокупателяТовары.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	|	ЗаказПокупателяТовары.Ссылка.Контрагент КАК Владелец,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	""НоменклатураКонтрагента"" КАК ИмяКолонкиНоменклатурыКонтрагента,
	|	&ПредставлениеНоменклатурыКлиента КАК ПредставлениеНоменклатурыКонтрагента,
	|	ЗаказПокупателяТовары.Номенклатура КАК НоменклатураПоиск,
	|	ЗаказПокупателяТовары.Характеристика КАК ХарактеристикаПоиск,
	|	ЗаказПокупателяТовары.ЕдиницаИзмерения КАК УпаковкаПоиск
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка В (&НаборДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Ссылка,
	|	ЗаказПоставщикуТовары.НомерСтроки,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры,
	|	ЗаказПоставщикуТовары.ЕдиницаИзмерения,
	|	ЗаказПоставщикуТовары.НоменклатураКонтрагента,
	|	ЗаказПоставщикуТовары.Ссылка.Контрагент,
	|	""Товары"",
	|	""НоменклатураКонтрагента"",
	|	&ПредставлениеНоменклатурыКлиента,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Характеристика,
	|	ЗаказПоставщикуТовары.ЕдиницаИзмерения
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка В (&НаборДокументов)";
			
	ТаблицаСопоставления = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ТекстЗапросаПоискаНеСопоставленнойНоменклатурыКонтрагентовПоНоменклатуреИБ
Процедура ТекстЗапросаПоискаНеСопоставленнойНоменклатурыКонтрагентовПоНоменклатуреИБ(ТекстЗапроса, ТаблицаТоваровПоУмолчанию) Экспорт
	
	Если Не ТаблицаТоваровПоУмолчанию Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Товары.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.ХарактеристикаНоменклатуры КАК Характеристика,
		|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	&Товары КАК Товары
		|ГДЕ
		|	Товары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И Товары.НоменклатураКонтрагента <> ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)";
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	Товары.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.ЕдиницаИзмерения КАК Упаковка
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	Товары.НоменклатураКонтрагента.Номенклатура = &ПустаяНоменклатура";
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСЭлектроннымДокументом

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриОтраженииВУчетеЭлектронногоДокументаСНоменклатурой.
Процедура ПриОтраженииВУчетеЭлектронногоДокументаСНоменклатурой(Знач Документ, Настройки) Экспорт
	
	//Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСопоставлениеНоменклатуры") Тогда
	//	Настройки.ОтражатьТолькоСопоставленные = Ложь;
	//	Возврат;
	//КонецЕсли;
	
	Если Документ.СпособОбработки = "НоменклатураКонтрагентов" Тогда
		Настройки.ОтражатьТолькоСопоставленные = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСоСловарем

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ЗначениеНаименованияДанныхСопоставленияНоменклатурыБЭД
Процедура ЗначениеНаименованияДанныхСопоставленияНоменклатурыБЭД(Знач СсылкаНаОбъект, ЗначениеНаименования) Экспорт
	
	НаименованиеРеквизита = НаименованиеРеквизитаСопоставленияНоменклатурыБЭД(ТипЗнч(СсылкаНаОбъект));
	
	Если НаименованиеРеквизита = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ЗначениеНаименования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, НаименованиеРеквизита);
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ЗначенияНаименованийДанныхСопоставленияНоменклатурыБЭД
Процедура ЗначенияНаименованийДанныхСопоставленияНоменклатурыБЭД(Знач НаборСсылокНаОбъекты, СоответствиеЗначенийНаименований) Экспорт
	
	НаименованиеРеквизита = НаименованиеРеквизитаСопоставленияНоменклатурыБЭД(ТипЗнч(НаборСсылокНаОбъекты[0]));
	
	Если НаименованиеРеквизита = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеЗначенийНаименований = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(НаборСсылокНаОбъекты, НаименованиеРеквизита);
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ОпределитьНаименованиеТипаОбъектаСопоставленияНоменклатурыБЭД
Процедура ОпределитьНаименованиеТипаОбъектаСопоставленияНоменклатурыБЭД(Знач СсылкаНаОбъект, НаименованиеТипаОбъекта) Экспорт

	ТипСсылкиНаОбъект = ТипЗнч(СсылкаНаОбъект);
	Если ТипСсылкиНаОбъект = Тип("СправочникСсылка.Номенклатура") Тогда
		НаименованиеТипаОбъекта = "Номенклатура";
	ИначеЕсли ТипСсылкиНаОбъект = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
		НаименованиеТипаОбъекта = "Характеристика";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПоискСопоставленияНоменклатурыСНоменклатуройИБ

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ТекстЗапросаПоискаВариантовСопоставленияПоШтрихкодамКомбинаций
Процедура ТекстЗапросаПоискаВариантовСопоставленияПоШтрихкодамКомбинаций(ТекстЗапроса) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Штрихкоды.Штрихкод КАК ШтрихкодКомбинации,
	|	Штрихкоды.Объект КАК Номенклатура,
	|	Штрихкоды.ХарактеристикаНоменклатуры КАК Характеристика,
	|	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ НайденныеКомбинации
	|ИЗ
	|	ТаблицаШтрихкодовКомбинации КАК ТаблицаШтрихкодовКомбинации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ПО ТаблицаШтрихкодовКомбинации.ШтрихкодКомбинации = Штрихкоды.Штрихкод
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ШтрихкодКомбинации,
	|	Номенклатура,
	|	Характеристика,
	|	ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НайденныеКомбинации.ШтрихкодКомбинации КАК ШтрихкодКомбинации
	|ПОМЕСТИТЬ СписокУникальныхШтрихкодовКомбинаций
	|ИЗ
	|	НайденныеКомбинации КАК НайденныеКомбинации
	|
	|СГРУППИРОВАТЬ ПО
	|	НайденныеКомбинации.ШтрихкодКомбинации
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(НайденныеКомбинации.Номенклатура) = 1
	|	И КОЛИЧЕСТВО(НайденныеКомбинации.Характеристика) = 1
	|	И КОЛИЧЕСТВО(НайденныеКомбинации.ЕдиницаИзмерения) = 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ШтрихкодКомбинации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НайденныеКомбинации.ШтрихкодКомбинации КАК ШтрихкодКомбинации,
	|	НайденныеКомбинации.Номенклатура КАК НоменклатураИБ,
	|	НайденныеКомбинации.Характеристика КАК ХарактеристикаИБ,
	|	НайденныеКомбинации.ЕдиницаИзмерения КАК УпаковкаИБ
	|ИЗ
	|	НайденныеКомбинации КАК НайденныеКомбинации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокУникальныхШтрихкодовКомбинаций КАК СписокУникальныхШтрихкодовКомбинаций
	|		ПО НайденныеКомбинации.ШтрихкодКомбинации = СписокУникальныхШтрихкодовКомбинаций.ШтрихкодКомбинации";

КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ИнициализацияТекстаЗапросаПоискаСопоставленияПоНатуральнымКлючам
Процедура ИнициализацияТекстаЗапросаПоискаСопоставленияПоНатуральнымКлючам(ТекстЗапроса) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаНатуральныхКлючей.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
	|	ТаблицаНатуральныхКлючей.Штрихкод КАК Штрихкод,
	|	ТаблицаНатуральныхКлючей.ЭтоВнутреннийШтрихкод КАК ЭтоВнутреннийШтрихкод,
	|	Штрихкоды.Объект КАК Номенклатура,
	|	ИСТИНА КАК ШтрихкодСопоставлен,
	|	ТаблицаНатуральныхКлючей.ЭтоНашаНоменклатура КАК ЭтоНашаНоменклатура
	|ПОМЕСТИТЬ ТаблицаСопоставленныхПоШтрихкодам
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНатуральныхКлючей КАК ТаблицаНатуральныхКлючей
	|		ПО Штрихкоды.Штрихкод = ТаблицаНатуральныхКлючей.Штрихкод
	|ГДЕ
	|	ТаблицаНатуральныхКлючей.Штрихкод <> """"
	|	И НЕ Штрихкоды.Объект.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдентификаторНоменклатуры,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаНатуральныхКлючей.Артикул КАК Артикул,
	|	ТаблицаНатуральныхКлючей.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
	|	НоменклатураКонтрагента.Ссылка КАК Номенклатура,
	|	ИСТИНА КАК АртикулСопоставлен,
	|	ТаблицаНатуральныхКлючей.ЭтоНашаНоменклатура КАК ЭтоНашаНоменклатура
	|ПОМЕСТИТЬ ТаблицаСопоставленныхПоАртикулам
	|ИЗ
	|	ТаблицаНатуральныхКлючей КАК ТаблицаНатуральныхКлючей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураКонтрагента
	|		ПО ТаблицаНатуральныхКлючей.Артикул = НоменклатураКонтрагента.Артикул
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСопоставленныхПоШтрихкодам КАК ТаблицаСопоставленныхПоШтрихкодам
	|		ПО ТаблицаНатуральныхКлючей.ИдентификаторНоменклатуры = ТаблицаСопоставленныхПоШтрихкодам.ИдентификаторНоменклатуры
	|			И (НЕ ТаблицаСопоставленныхПоШтрихкодам.ЭтоВнутреннийШтрихкод)
	|ГДЕ
	|	ТаблицаНатуральныхКлючей.Артикул <> """"
	|	И ТаблицаСопоставленныхПоШтрихкодам.ИдентификаторНоменклатуры ЕСТЬ NULL
	|	И НЕ НоменклатураКонтрагента.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдентификаторНоменклатуры,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаНатуральныхКлючей.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
	|	СправочникНоменклатура.Ссылка КАК Номенклатура,
	|	ИСТИНА КАК НаименованиеСопоставлено,
	|	ТаблицаНатуральныхКлючей.ЭтоНашаНоменклатура КАК ЭтоНашаНоменклатура
	|ПОМЕСТИТЬ ТаблицаСопоставленныхПоНаименованию
	|ИЗ
	|	ТаблицаНатуральныхКлючей КАК ТаблицаНатуральныхКлючей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТаблицаНатуральныхКлючей.Наименование = СправочникНоменклатура.Наименование
	|ГДЕ
	|	НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					ТаблицаСопоставленныхПоШтрихкодам КАК ТаблицаСопоставленныхПоШтрихкодам
	|				ГДЕ
	|					ТаблицаСопоставленныхПоШтрихкодам.ИдентификаторНоменклатуры = ТаблицаНатуральныхКлючей.ИдентификаторНоменклатуры
	|					И НЕ ТаблицаСопоставленныхПоШтрихкодам.ЭтоВнутреннийШтрихкод)
	|	И ТаблицаНатуральныхКлючей.ЭтоНашаНоменклатура
	|	И НЕ СправочникНоменклатура.ЭтоГруппа
	|	И НЕ СправочникНоменклатура.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаНатуральныхКлючей.ИдентификаторНоменклатуры,
	|	СправочникНоменклатура.Ссылка,
	|	ИСТИНА,
	|	ТаблицаНатуральныхКлючей.ЭтоНашаНоменклатура
	|ИЗ
	|	ТаблицаНатуральныхКлючей КАК ТаблицаНатуральныхКлючей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТаблицаНатуральныхКлючей.Наименование = ПОДСТРОКА(СправочникНоменклатура.НаименованиеПолное,1,250)
	|ГДЕ
	|	НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					ТаблицаСопоставленныхПоШтрихкодам КАК ТаблицаСопоставленныхПоШтрихкодам
	|				ГДЕ
	|					ТаблицаСопоставленныхПоШтрихкодам.ИдентификаторНоменклатуры = ТаблицаНатуральныхКлючей.ИдентификаторНоменклатуры
	|					И НЕ ТаблицаСопоставленныхПоШтрихкодам.ЭтоВнутреннийШтрихкод)
	|	И ТаблицаНатуральныхКлючей.ЭтоНашаНоменклатура
	|	И НЕ СправочникНоменклатура.ЭтоГруппа
	|	И НЕ СправочникНоменклатура.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдентификаторНоменклатуры,
	|	Номенклатура";
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ТекстЗапросаОтбораХарактеристикНоменклатурыБЭДПоВладельцу
Процедура ТекстЗапросаОтбораХарактеристикНоменклатурыБЭДПоВладельцу(ТекстЗапроса) Экспорт

	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВариантыСопоставленияПоСловарю.Идентификатор КАК Идентификатор,
	               |	ВариантыСопоставленияПоСловарю.СсылкаНаОбъект КАК СсылкаНаОбъект,
	               |	ТаблицаНоменклатуры.НоменклатураИБ КАК НоменклатураИБ
	               |ПОМЕСТИТЬ ХарактеристикиПоВладельцу
	               |ИЗ
	               |	ВариантыСопоставленияПоСловарю КАК ВариантыСопоставленияПоСловарю
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	               |		ПО ВариантыСопоставленияПоСловарю.Идентификатор = ТаблицаНоменклатуры.ИдентификаторХарактеристики
	               |			И (ВариантыСопоставленияПоСловарю.СсылкаНаОбъект.Владелец ССЫЛКА Справочник.Номенклатура)
	               |			И ВариантыСопоставленияПоСловарю.СсылкаНаОбъект.Владелец = ТаблицаНоменклатуры.НоменклатураИБ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВариантыСопоставленияПоСловарю.Идентификатор,
	               |	ВариантыСопоставленияПоСловарю.СсылкаНаОбъект,
	               |	ТаблицаНоменклатуры.НоменклатураИБ
	               |ИЗ
	               |	ВариантыСопоставленияПоСловарю КАК ВариантыСопоставленияПоСловарю
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	               |		ПО ВариантыСопоставленияПоСловарю.Идентификатор = ТаблицаНоменклатуры.ИдентификаторХарактеристики
	               |			И (ВариантыСопоставленияПоСловарю.СсылкаНаОбъект.Владелец ССЫЛКА Справочник.ТипыНоменклатуры)
	               |			И ВариантыСопоставленияПоСловарю.СсылкаНаОбъект.Владелец = ТаблицаНоменклатуры.НоменклатураИБ.ТипНоменклатуры
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Идентификатор,
	               |	СсылкаНаОбъект";
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ТекстЗапросаПоискаВариантовСопоставленияХарактеристикиСНашейНоменклатурой
Процедура ТекстЗапросаПоискаВариантовСопоставленияХарактеристикиСНашейНоменклатурой(ТекстЗапроса) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаНоменклатуры.ИдентификаторХарактеристики КАК ИдентификаторХарактеристики,
	|	ТаблицаНоменклатуры.Характеристика КАК Характеристика,
	|	ТаблицаНоменклатуры.НоменклатураИБ КАК НоменклатураИБ,
	|	ХарактеристикиНоменклатуры.Ссылка КАК ХарактеристикаИБ
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ТаблицаНоменклатуры.Характеристика = ХарактеристикиНоменклатуры.Наименование
	|			И ТаблицаНоменклатуры.НоменклатураИБ = ХарактеристикиНоменклатуры.Владелец
	|			И (ХарактеристикиНоменклатуры.Владелец ССЫЛКА Справочник.Номенклатура)
	|ГДЕ
	|	НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.ИдентификаторХарактеристики,
	|	ТаблицаНоменклатуры.Характеристика,
	|	ТаблицаНоменклатуры.НоменклатураИБ,
	|	ХарактеристикиНоменклатуры.Ссылка
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ТаблицаНоменклатуры.Характеристика = ХарактеристикиНоменклатуры.Наименование
	|			И ТаблицаНоменклатуры.НоменклатураИБ.ТипНоменклатуры = ХарактеристикиНоменклатуры.Владелец
	|			И (ХарактеристикиНоменклатуры.Владелец ССЫЛКА Справочник.ТипыНоменклатуры)
	|ГДЕ
	|	НЕ ХарактеристикиНоменклатуры.ПометкаУдаления"
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ТекстЗапросаПоискаВариантовСопоставленияУпаковкиНоменклатурыБЭД
Процедура ТекстЗапросаПоискаВариантовСопоставленияУпаковкиНоменклатурыБЭД(ТекстЗапроса) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ТаблицаНоменклатуры.НоменклатураИБ КАК НоменклатураИБ,
	|	ТаблицаНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаНоменклатуры.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	ТаблицаНоменклатуры.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	|	ТаблицаНоменклатуры.ИспользоватьУпаковки КАК ИспользоватьУпаковки,
	|	ТаблицаНоменклатуры.НаименованиеУпаковки КАК НаименованиеУпаковки,
	|	ТаблицаНоменклатуры.УпаковкаЗадана КАК УпаковкаЗадана,
	|	ТаблицаНоменклатуры.КоличествоБазовойЕдиницыИзмерения КАК КоличествоБазовойЕдиницыИзмерения,
	|	ТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЕдиницыИзмерения.Ссылка КАК УпаковкаИБ
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО (ВЫБОР
	|				КОГДА ТаблицаНоменклатуры.НоменклатураИБ.ТипНоменклатуры.ИспользованиеЕдиницИзмерения = 1
	|					ТОГДА ТаблицаНоменклатуры.НоменклатураИБ.ТипНоменклатуры = ЕдиницыИзмерения.Владелец
	|				ИНАЧЕ ТаблицаНоменклатуры.НоменклатураИБ = ЕдиницыИзмерения.Владелец
	|			КОНЕЦ)";
	
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ТекстЗапросаОтбораСтрокСопоставленияДляЗаполненияХарактеристик
Процедура ТекстЗапросаОтбораСтрокСопоставленияДляЗаполненияХарактеристик(ТекстЗапроса) Экспорт
	
	ТекстЗапроса =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСопоставления.Идентификатор КАК Идентификатор
	|ИЗ
	|	ТаблицаСопоставления КАК ТаблицаСопоставления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО ТаблицаСопоставления.НоменклатураИБ = ХарактеристикиНоменклатуры.Владелец
	|			И (ХарактеристикиНоменклатуры.Владелец ССЫЛКА Справочник.Номенклатура)
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Ссылка = &Характеристика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаСопоставления.Идентификатор
	|ИЗ
	|	ТаблицаСопоставления КАК ТаблицаСопоставления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|			ПО Номенклатура.ТипНоменклатуры = ХарактеристикиНоменклатуры.Владелец
	|				И (ХарактеристикиНоменклатуры.Владелец ССЫЛКА Справочник.ТипыНоменклатуры)
	|		ПО ТаблицаСопоставления.НоменклатураИБ = Номенклатура.Ссылка
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Ссылка = &Характеристика";

КонецПроцедуры

// Заполняет номенклатуру контрагента в строке товара по данным строки
//
// Параметры:
//  Контрагент   - СправочникСсылка.Контрагенты - контрагент документа
//  СтрокаТовара - ДанныеФормыЭлементКоллекции  - строка табличной части Товары
//
Процедура ПодобратьНоменклатуруКонтрагента(Контрагент, СтрокаТовара) Экспорт
	
	НоменклатураИБ = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагентаИнформационнойБазы();
	НоменклатураИБ.Номенклатура            = СтрокаТовара.Номенклатура;
	Если ЕстьРеквизит(СтрокаТовара, "ХарактеристикаНоменклатуры") Тогда
		НоменклатураИБ.Характеристика      = СтрокаТовара.ХарактеристикаНоменклатуры;
	Иначе
		НоменклатураИБ.Характеристика      = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	НоменклатураИБ.Упаковка                = СтрокаТовара.ЕдиницаИзмерения;
	НоменклатураИБ.НоменклатураКонтрагента = СтрокаТовара.НоменклатураКонтрагента;
	
	СтрокаТовара.НоменклатураКонтрагента = 
		ТорговыйКомплексСопоставлениеНоменклатурыКонтрагентовЭДОВызовСервера.НоменклатураКонтрагентаПоНоменклатуреВСтрокеТаблицы(Контрагент, НоменклатураИБ);
	
КонецПроцедуры

// Заполняет номенклатуру контрагента в строке товара по данным строки
//
// Параметры:
//  Контрагент   - СправочникСсылка.Контрагенты - контрагент документа
//  СтрокаТовара - ДанныеФормыЭлементКоллекции  - строка табличной части Товары
//
Процедура ПодобратьНоменклатуруПоставщика(Контрагент, СтрокаТовара) Экспорт
	
	НоменклатураИБ = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагентаИнформационнойБазы();
	НоменклатураИБ.Номенклатура            = СтрокаТовара.Номенклатура;
	Если ЕстьРеквизит(СтрокаТовара, "ХарактеристикаНоменклатуры") Тогда
		НоменклатураИБ.Характеристика      = СтрокаТовара.ХарактеристикаНоменклатуры;
	Иначе
		НоменклатураИБ.Характеристика      = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	НоменклатураИБ.Упаковка                = СтрокаТовара.ЕдиницаИзмерения;
	НоменклатураИБ.НоменклатураКонтрагента = СтрокаТовара.НоменклатураПоставщика;
	
	СтрокаТовара.НоменклатураПоставщика = 
		ТорговыйКомплексСопоставлениеНоменклатурыКонтрагентовЭДОВызовСервера.НоменклатураКонтрагентаПоНоменклатуреВСтрокеТаблицы(Контрагент, НоменклатураИБ);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСДаннымиИБ

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриОпределенииСтруктурыНоменклатурыИнформационнойБазы.
Процедура ПриОпределенииСтруктурыНоменклатурыИнформационнойБазы(СтруктураНоменклатуры) Экспорт
	
	// В качестве объектов упаковки используются элементы справочника ЕдиницыИзмерения,
	// которые не зависят от номенклатуры.
	СтруктураНоменклатуры.ИмяПараметраСвязиУпаковки = "НоменклатураВладелец";
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриОпределенииСвойствНоменклатурыИнформационнойБазы.
Процедура ПриОпределенииСвойствНоменклатурыИнформационнойБазы(Знач НаборНоменклатуры, СвойстваНоменклатурИБ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик < 3 КАК ИспользоватьХарактеристики,
	|	ИСТИНА КАК ИспользоватьУпаковки,
	|	ЛОЖЬ КАК ОбязательноеЗаполнениеХарактеристики,
	|	Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмеренияПоУмолчанию
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&НаборНоменклатуры)";
	
	Запрос.УстановитьПараметр("НаборНоменклатуры", НаборНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СвойстваНоменклатуры = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НовыеСвойстваНоменклатурыИБ();
		ЗаполнитьЗначенияСвойств(СвойстваНоменклатуры, Выборка);
		
		СвойстваНоменклатурИБ.Вставить(Выборка.Номенклатура, СвойстваНоменклатуры);
		
	КонецЦикла;
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриОпределенииПредставленийСопоставленияНоменклатуры.
Процедура ПриОпределенииПредставленийСопоставленияНоменклатуры(Представления) Экспорт
	
	Представления.ХарактеристикаПредставлениеОбъекта = НСтр("ru = 'Характеристика'"); // Вместо "Характеристика номенклатуры".
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриОпределенииШтрихкодовНоменклатурыКонтрагента.
Процедура ПриОпределенииШтрихкодовНоменклатурыКонтрагента(Знач НоменклатураИБ, Штрихкод, ДругиеШтрихкодыНоменклатуры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоискаШтрихкодовПоСтрокеТоваров();
	Запрос.УстановитьПараметр("Номенклатура"   , НоменклатураИБ.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика" , НоменклатураИБ.Характеристика);
	Запрос.УстановитьПараметр("Упаковка"       , НоменклатураИБ.Упаковка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	// Основной штрихкод
	ВыборкаШтрихкодаКомбинации = РезультатыЗапроса[0].Выбрать();
	
	Если ВыборкаШтрихкодаКомбинации.Следующий() Тогда
		Штрихкод = ВыборкаШтрихкодаКомбинации.Штрихкод;
	КонецЕсли;
	
	// Другие штрихкоды номенклатуры
	ВыборкаШтрихкодыНоменклатуры = РезультатыЗапроса[1].Выбрать();
	
	Пока ВыборкаШтрихкодыНоменклатуры.Следующий() Цикл
		ДругиеШтрихкодыНоменклатуры.Добавить(ВыборкаШтрихкодыНоменклатуры.Штрихкод);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеФормНаОснованииНоменклатурыКонтрагентов

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриЗаполненииФормыНоменклатурыПоДаннымКонтрагента.
Процедура ПриЗаполненииФормыНоменклатурыПоДаннымКонтрагента(Знач НоменклатураКонтрагента, Форма) Экспорт
	
	Форма.Объект.Наименование       = НоменклатураКонтрагента.Наименование;
	Форма.Объект.НаименованиеПолное = НоменклатураКонтрагента.Наименование;
	
	//Если ЗначениеЗаполнено(НоменклатураКонтрагента.Характеристика) Тогда
	//	
	//	Форма.Объект.Наименование = Форма.Объект.Наименование 
	//	+ " (" + НоменклатураКонтрагента.Характеристика + ")";
	//	
	//КонецЕсли;
	
	Форма.Объект.Артикул = НоменклатураКонтрагента.Артикул;
	
	Если ЗначениеЗаполнено(НоменклатураКонтрагента.ЕдиницаИзмеренияКод) Тогда
		Форма.Объект.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиСоздатьЭлементКлассификатораПоКоду(НоменклатураКонтрагента.ЕдиницаИзмеренияКод);
	ИначеЕсли ЗначениеЗаполнено(НоменклатураКонтрагента.ЕдиницаИзмерения) Тогда
		Форма.Объект.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиСоздатьЭлементКлассификатора(НоменклатураКонтрагента.ЕдиницаИзмерения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НоменклатураКонтрагента.СтавкаНДС) Тогда
		
		СтавкиНДСПоКлючу = Новый Соответствие;
		ОбменСКонтрагентамиПереопределяемый.ЗаполнитьСоответствиеСтавокНДС(СтавкиНДСПоКлючу);
		Форма.Объект.СтавкаНДС = СтавкиНДСПоКлючу.Получить(НоменклатураКонтрагента.СтавкаНДС);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НоменклатураКонтрагента.СтранаПроисхожденияКод) Тогда
		Форма.Объект.СтранаПроисхождения = Справочники.СтраныМира.ДанныеКлассификатораСтранМираПоКоду(НоменклатураКонтрагента.СтранаПроисхожденияКод);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НоменклатураКонтрагента.КодТНВЭД) Тогда
		Форма.Объект.КодТНВЭД = Справочники.КлассификаторТНВЭД.НайтиСоздатьЭлементКлассификатораПоКоду(НоменклатураКонтрагента.КодТНВЭД);
	КонецЕсли;
	
	Если НоменклатураКонтрагента.ПрослеживаемыйТовар Тогда
		Форма.Объект.Прослеживаемый = Истина;
	ИначеЕсли ЗначениеЗаполнено(Форма.Объект.КодТНВЭД) Тогда
		Форма.Объект.Прослеживаемый = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Объект.КодТНВЭД, "ПрослеживаемыйТовар");
	КонецЕсли;
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриЗаполненииФормыХарактеристикиПоДаннымКонтрагента.
Процедура ПриЗаполненииФормыХарактеристикиПоДаннымКонтрагента(Знач НоменклатураКонтрагента, Форма) Экспорт
	
	Форма.Объект.Наименование = НоменклатураКонтрагента.Характеристика;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ИнтеграцияПодсистемы

// Метод устанавливает сопоставление номенклатуры контрагента номенклатуры организации
//
// Параметры:
//  ДокументОбъект  - ДокументОбъект           - записываемый документ.
//  Отказ           - Булево                   - признак отказа от записи.
//  РежимЗаписи     - РежимЗаписиДокумента     - текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - текущий режим проведения.
//
Процедура ПередЗаписьюУчетногоДокумента(ДокументОбъект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Не РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	СопоставлениеНоменклатурыКонтрагентов.ЗаполнитьПустоеСопоставлениеВНоменклатуреКонтрагентаПоНоменклатуреИБ(ДокументОбъект.Товары, Отказ);
	
КонецПроцедуры

// Заполняет номенклатуру контрагента при изменении контрагента в документе
//
// Параметры:
//  Товары     - ДанныеФормыКоллекция         - таблица, в которой необходимо заполнить номенклатуру контрагента.
//  Контрагент - СправочникСсылка.Контрагенты - контрагент, которому принадлежит номенклатура.
//
Процедура ПриИзмененииВладельцаНоменклатурыКонтрагентов(Контрагент, Товары) Экспорт
	
	НоменклатураПоиска = Новый ТаблицаЗначений;
	НоменклатураПоиска.Колонки.Добавить("НомерСтроки"             , Новый ОписаниеТипов("Число"));
	НоменклатураПоиска.Колонки.Добавить("Номенклатура"            , Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	НоменклатураПоиска.Колонки.Добавить("Характеристика"          , Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	НоменклатураПоиска.Колонки.Добавить("Упаковка"                , Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	НоменклатураПоиска.Колонки.Добавить("НоменклатураКонтрагента" , Новый ОписаниеТипов("СправочникСсылка.НоменклатураКонтрагентов"));
	
	Для каждого СтрокаТовара Из Товары Цикл
		
		НоваяСтрока = НоменклатураПоиска.Добавить();
		
		НоваяСтрока.НомерСтроки    = СтрокаТовара.НомерСтроки;
		НоваяСтрока.Номенклатура   = СтрокаТовара.Номенклатура;
		НоваяСтрока.Характеристика = СтрокаТовара.ХарактеристикаНоменклатуры;
		НоваяСтрока.Упаковка       = СтрокаТовара.ЕдиницаИзмерения;
		
	КонецЦикла;
	
	РезультатЗапроса = СопоставлениеНоменклатурыКонтрагентов.РезультатЗапросаПоискаНоменклатурыКонтрагентаПриИзмененииВладельца(
		Контрагент, НоменклатураПоиска);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Для Каждого ТекСтрока Из Товары Цикл
		
		Если Выборка.НайтиСледующий(ТекСтрока.НомерСтроки, "НомерСтроки") Тогда
			ТекСтрока.НоменклатураКонтрагента = Выборка.НоменклатураКонтрагента;
			Выборка.Сбросить();
		Иначе
			ТекСтрока.НоменклатураКонтрагента = Справочники.НоменклатураКонтрагентов.ПустаяСсылка();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ПоискНоменклатурыКонтрагентовПоИдентификатору

// Добавляет в табличную часть колонки поиска номенклатуры контрагентов
//
// Параметры:
//  Товары - ТаблицаЗначений - таблица в которую требуется добавить колонки
//    для поиска номенклатуры контрагентов.
//
Процедура ДополнитьТаблицуТоваровКолонкамиПоискаПоИдентификатору(Товары) Экспорт
	
	Товары.Колонки.Добавить("ИдентификаторКонтрагента", Новый ОписаниеТипов("Строка", , 
		Новый КвалификаторыСтроки(300, ДопустимаяДлина.Переменная)));
	Товары.Колонки.Добавить("НаименованиеКонтрагента", Новый ОписаниеТипов("Строка", , 
		Новый КвалификаторыСтроки(1000, ДопустимаяДлина.Переменная)));
	
КонецПроцедуры

// Заполняет колонку "НоменклатураКонтрагента" сопоставленными данными номенклатуры
//
// Параметры:
//  Товары               - ТаблицаЗначений - таблица для которой требуется произвести сопоставление.
//                                        Таблица должна содержать колонки:
//   * ИдентификаторКонтрагента - Строка                                        - идентификатор номенклатуры контрагента.
//   * НоменклатураКонтрагента  - СправочникСсылка.НоменклатураКонтрагентов     - ссылка номенклатуры контрагента.
//   * Номенклатура             - ОпределяемыйТип.НоменклатураБЭД               - ссылка номенклатуры.
//   * Характеристика           - ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД - ссылка характеристики.
//   * ЕдиницаИзмерения         - ОпределяемыйТип.УпаковкаНоменклатурыБЭД       - ссылка упаковки.
//  ВладелецНоменклатуры - СправочникСсылка.Контрагенты - ссылка на владельца номенклатуры
//
Процедура СопоставитьНоменклатуруКонтрагентовПоИдентификатору(Товары, ВладелецНоменклатуры) Экспорт
	
	ТаблицаПоиска = Новый ТаблицаЗначений;
	ТаблицаПоиска.Колонки.Добавить("Владелец", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаПоиска.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", 
		Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаПоиска.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка", , 
		Новый КвалификаторыСтроки(300, ДопустимаяДлина.Переменная)));
	ТаблицаПоиска.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаПоиска.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаПоиска.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	
	НомерСтроки = 0;
	
	Для каждого СтрокаТовара Из Товары Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		Если ПустаяСтрока(СтрокаТовара.ИдентификаторКонтрагента) Тогда
			Продолжить; // По пустым идентификаторам поиск не выполняем
		ИначеЕсли ЗначениеЗаполнено(СтрокаТовара.НоменклатураКонтрагента) Тогда
			Продолжить; // Для заполненных значений номенклатуры контрагентов не выполняем поиск
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПоиска.Добавить();
		НоваяСтрока.НомерСтроки    = НомерСтроки;
		НоваяСтрока.Владелец       = ВладелецНоменклатуры;
		НоваяСтрока.Идентификатор  = СтрокаТовара.ИдентификаторКонтрагента;
		НоваяСтрока.Номенклатура   = СтрокаТовара.Номенклатура;
		НоваяСтрока.Характеристика = СтрокаТовара.ХарактеристикаНоменклатуры;
		НоваяСтрока.Упаковка       = СтрокаТовара.ЕдиницаИзмерения;
		
	КонецЦикла;
	
	РезультатЗапроса = СопоставлениеНоменклатурыКонтрагентов.РезультатЗапросаОднозначноСопоставленнойНоменклатурыКонтрагентаПоИдентификатору(ТаблицаПоиска);
	
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		Товары[ВыборкаЗапроса.НомерСтроки - 1].НоменклатураКонтрагента = ВыборкаЗапроса.НоменклатураКонтрагента;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбновлениеДанных

// СтандартныеПодсистемы.ОбновлениеВерсииИБ

// Формирует список ссылок для обработчиков обновления для перехода на новую версию
//
// Параметры:
//  МетаданныеДокумента - ОбъектМетаданных - место хранения обновляемых объектов.
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка - массив обрабатываемых объектов.
//
Функция ДанныеКОбработкеДляПереходаНаНовуюВерсию(МетаданныеДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатураДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	&ТаблицаТовары КАК НоменклатураДокумента
	|ГДЕ
	|	НоменклатураДокумента.НоменклатураКонтрагента = ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)
	|	И (НЕ НоменклатураДокумента.УдалитьИдентификаторПоставщика = """"
	|			ИЛИ НЕ НоменклатураДокумента.УдалитьНаименованиеПоставщика = """")";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТаблицаТовары", МетаданныеДокумента.ПолноеИмя() + ".Товары");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Регистрирует к обновлению объекты по метаданным
//
// Параметры:
//  Параметры           - Структура        - параметры.
//  МетаданныеДокумента - ОбъектМетаданных - место хранения обновляемых объектов.
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры, МетаданныеДокумента) Экспорт
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
	|	НоменклатураДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	&ТаблицаТовары КАК НоменклатураДокумента
	|ГДЕ
	|	НоменклатураДокумента.НоменклатураКонтрагента = ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)
	|	И (НЕ НоменклатураДокумента.УдалитьИдентификаторПоставщика = """"
	|			ИЛИ НЕ НоменклатураДокумента.УдалитьНаименованиеПоставщика = """")
	|	И НоменклатураДокумента.Ссылка > &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	ПолноеИмяМетаданных = МетаданныеДокумента.ПолноеИмя();
	МенеджерОбъекта     = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяМетаданных);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТаблицаТовары", ПолноеИмяМетаданных + ".Товары");
	
	ОтработаныВсеДанные = Ложь;
	Ссылка              = МенеджерОбъекта.ПустаяСсылка();
	
	Пока Не ОтработаныВсеДанные Цикл
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выгрузка = Запрос.Выполнить().Выгрузить();
		
		КоличествоСтрок = Выгрузка.Количество();
		
		Если КоличествоСтрок < 1000 Тогда
			ОтработаныВсеДанные = Истина;
		КонецЕсли;
		
		Если КоличествоСтрок > 0 Тогда
			Ссылка = Выгрузка[КоличествоСтрок - 1].Ссылка;
		КонецЕсли;
		
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Выгрузка.ВыгрузитьКолонку("Ссылка"), ДополнительныеПараметры);
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик обновления данных объекта.
//
// Параметры:
//  Объект   - ДокументСсылка - документ, который требуется обновить.
//  Записать - Булево         - флаг необходимости записи объекта в ИБ.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Объект, Записать) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Возврат; // Нет смысла искать номенклатуру контрагентов по пустому владельцу
	КонецЕсли;
	
	// Подготовка таблица обрабатываемых строк
	ТаблицаПоиска = Новый ТаблицаЗначений;
	ТаблицаПоиска.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", 
		Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаПоиска.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаПоиска.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаПоиска.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	ТаблицаПоиска.Колонки.Добавить("НоменклатураКонтрагента", Новый ОписаниеТипов("СправочникСсылка.НоменклатураКонтрагентов"));
	
	ДополнитьТаблицуТоваровКолонкамиПоискаПоИдентификатору(ТаблицаПоиска);
	
	Для каждого СтрокаДокумента Из Объект.Товары Цикл
		
		Если ЗначениеЗаполнено(СтрокаДокумента.НоменклатураКонтрагента) 
			Или (ПустаяСтрока(СтрокаДокумента.УдалитьИдентификаторПоставщика)
				И ПустаяСтрока(СтрокаДокумента.УдалитьНаименованиеПоставщика)) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПоиска.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
		
		НоваяСтрока.ИдентификаторКонтрагента = СтрокаДокумента.УдалитьИдентификаторПоставщика;
		НоваяСтрока.НаименованиеКонтрагента  = СтрокаДокумента.УдалитьНаименованиеПоставщика;
		
	КонецЦикла;
	
	Если ТаблицаПоиска.Количество() = 0 Тогда
		Возврат; // В документе отсутствуют строки к обработке
	КонецЕсли;
	
	// Поиск номенклатуры контрагентов с указанными идентификаторами
	СопоставитьНоменклатуруКонтрагентовПоИдентификатору(ТаблицаПоиска, Объект.Контрагент);
	
	УдаляемыеСтроки = Новый Массив;
	
	// Заполнение документа найденными данными
	Для каждого СтрокаДокумента Из ТаблицаПоиска Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаДокумента.НоменклатураКонтрагента) Тогда
			Продолжить;
		КонецЕсли;
		
		Объект.Товары[СтрокаДокумента.НомерСтроки - 1].НоменклатураКонтрагента = СтрокаДокумента.НоменклатураКонтрагента;
		
		Записать = Истина;
		
		УдаляемыеСтроки.Добавить(СтрокаДокумента);
		
	КонецЦикла;
	
	// Удаляем подобранные номенклатуры контрагентов, оставляем только строки в 
	// которых требуется создать элементы
	Для каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
		ТаблицаПоиска.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
	Если ТаблицаПоиска.Количество() = 0 Тогда
		Возврат; // Все данные по документу были найдены в справочнике
	КонецЕсли;
	
	// Создание номенклатуры контрагентов из данных табличной части
	Для каждого СтрокаДокумента Из ТаблицаПоиска Цикл
		
		ДанныеНоменклатурыКонтрагента = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента(
			Объект.Контрагент, СтрокаДокумента.ИдентификаторКонтрагента);
		ДанныеНоменклатурыКонтрагента.Наименование = СтрокаДокумента.НаименованиеКонтрагента; 
		
		НоменклатураИБ = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагентаИнформационнойБазы(
			СтрокаДокумента.Номенклатура, СтрокаДокумента.ХарактеристикаНоменклатуры, СтрокаДокумента.ЕдиницаИзмерения);
		
		ДополнительныеПараметры = СопоставлениеНоменклатурыКонтрагентов.НовыеДополнительныеПараметрыПриЗаписиНоменклатурыКонтрагентов();
		ДополнительныеПараметры.ТребуетсяПоискСсылки = Ложь; // Поиск выполнен ранее массово
		
		Отказ = Ложь;
		
		СопоставлениеНоменклатурыКонтрагентов.СоздатьОбновитьНоменклатуруКонтрагента(ДанныеНоменклатурыКонтрагента,
			НоменклатураИБ, Отказ, , ДополнительныеПараметры);
		
		Если Отказ Тогда
			Продолжить; // Не удалось создать номенклатуру контрагента
		КонецЕсли;
		
		// Создана новая номенклатура контрагента, устанавливаем ее в строку документа
		СтрокаТабличнойЧасти = Объект.Товары[СтрокаДокумента.НомерСтроки - 1];
		СтрокаТабличнойЧасти.НоменклатураКонтрагента = ДанныеНоменклатурыКонтрагента.НоменклатураКонтрагента;
		
		Записать = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НаименованиеРеквизитаСопоставленияНоменклатурыБЭД(ТипОбъекта)
	
	Если ТипОбъекта = Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат "НаименованиеПолное";
	ИначеЕсли ТипОбъекта = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
		Возврат "Наименование";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ТекстЗапросаПоискаШтрихкодовПоСтрокеТоваров()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Номенклатура) КАК Номенклатура,
	|	Штрихкоды.ХарактеристикаНоменклатуры КАК Характеристика,
	|	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(Штрихкоды.Штрихкод) КАК Штрихкод
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Номенклатура И 
	|	ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Номенклатура) = &Номенклатура
	|	И Штрихкоды.ХарактеристикаНоменклатуры = &Характеристика
	|	И Штрихкоды.ЕдиницаИзмерения = &Упаковка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Номенклатура),
	|	Штрихкоды.ХарактеристикаНоменклатуры,
	|	Штрихкоды.ЕдиницаИзмерения
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Штрихкоды.Штрихкод) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Штрихкоды.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Номенклатура И 
	|	ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Номенклатура) = &Номенклатура";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти
