// Общий модуль "Обработка табличной части товары"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТКИ ИЗМЕНЕНИЯ РЕКВИЗИТОВ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТКИ ПЕРЕСЧЕТА ТАБЛИЧНОЙ ЧАСТИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ИНИЦИАЛИЗАЦИИ СЛУЖЕБНЫХ РЕКВИЗИТОВ

Функция ПолучитьТаблицыГрупп(Запрос, Уровень = 0)

	Запрос.Текст = "ВЫБРАТЬ
	|	ТабНоменклатура.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТабНоменклатура.Группа КАК Справочник.Номенклатура).Родитель КАК Группа
	|ПОМЕСТИТЬ
	|	Уровень"+Уровень+"
	|ИЗ
	|	Уровень"+Строка(Уровень-1)+" КАК ТабНоменклатура
	|ГДЕ
	|	(НЕ ВЫРАЗИТЬ(ТабНоменклатура.Группа КАК Справочник.Номенклатура).Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))";
	
	Если Запрос.Выполнить().Выгрузить()[0].Количество=0 Тогда
		КоличествоУровней = Уровень-1;
	Иначе
		КоличествоУровней = ПолучитьТаблицыГрупп(Запрос, Уровень+1);
	КонецЕсли;
	
	Возврат КоличествоУровней;
	
КонецФункции

Функция ПолучитьТекстТаблицыНоменклатур(Запрос, ТипЦен, МассивТоваров, КоличествоУровней)
	
	Запрос.УстановитьПараметр("Номенклатура", МассивТоваров);
	Запрос.УстановитьПараметр("ТипЦен",       ТипЦен);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТабНоменклатура.Ссылка КАК Номенклатура,
	|	ТабНоменклатура.Ссылка КАК Группа
	|ПОМЕСТИТЬ
	|	Уровень0
	|ИЗ
	|	Справочник.Номенклатура КАК ТабНоменклатура
	|ГДЕ
	|	ТабНоменклатура.Ссылка В (&Номенклатура)
	|";
	
	Если Запрос.Выполнить().Выгрузить()[0].Количество = 0 Тогда
		КоличествоУровней = 0;
	Иначе
		КоличествоУровней = ПолучитьТаблицыГрупп(Запрос, 1);
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ОбъединенныйЗапрос.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ОбъединенныйЗапрос.Группа КАК Справочник.Номенклатура) КАК Группа,
	|	&ТипЦен КАК ТипЦен,
	|	ОбъединенныйЗапрос.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТабНоменклатура.Номенклатура КАК Номенклатура,
	|		ТабНоменклатура.Группа КАК Группа,
	|		0 КАК Приоритет
	|ИЗ
	|	Уровень0 КАК ТабНоменклатура";
	
	ТекстЗапросаУдаленияТаблиц = "";
	Для Итерация = 1 По КоличествоУровней Цикл
		
		ТекстУровень = Формат(Итерация,"ЧЦ=3; ЧДЦ=0; ЧН=0; ЧГ=0");
		
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТабНоменклатура.Номенклатура КАК Номенклатура,
		|	ТабНоменклатура.Группа КАК Группа,
		|	" + ТекстУровень + " КАК Приоритет
		|ИЗ
		|	Уровень" + ТекстУровень + " КАК ТабНоменклатура";
		
		ТекстЗапросаУдаленияТаблиц = ТекстЗапросаУдаленияТаблиц + "
		|УНИЧТОЖИТЬ
		|	Уровень" + ТекстУровень+"
		|;
		|";
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + ") КАК ОбъединенныйЗапрос
	|ИНДЕКСИРОВАТЬ ПО
	|	Группа
	|;
	|
	|УНИЧТОЖИТЬ
	|	Уровень0
	|;
	|"+ТекстЗапросаУдаленияТаблиц;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Процедура выполняет заполнение реквизита табличной части "Товары" рекомендуемый процентом наценки по типу цен.
//
Процедура ЗаполнитьРеквизитРекомендуемыйПроцентНаценки(Объект, ТипЦен, ТекущаяСтрока, ИмяРеквизита, ИмяТабличнойЧасти, ПараметрыДействия) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТипЦен) Тогда
		Возврат;
	КонецЕсли;
	
	// Получим менеджер объекта.
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = МенеджерОбъекта.ПолучитьПараметрыДействия(Объект,ПараметрыДействия);
	
	Момент = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Момент", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка.МоментВремени(), Неопределено));
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТаблицаТоваров = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТаблицаТоваров", Объект[ИмяТабличнойЧасти]);
	Иначе
		ТаблицаТоваров = Новый Массив;
		ТаблицаТоваров.Добавить(ТекущаяСтрока);
	КонецЕсли;
	
	МассивТоваров = Новый Массив;
	Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		
		СтрокаТоваров[ИмяРеквизита] = 0;
		
		Если МассивТоваров.Найти(СтрокаТоваров.Номенклатура) = Неопределено Тогда
			МассивТоваров.Добавить(СтрокаТоваров.Номенклатура);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МоментВремени", Момент);
	
	КоличествоУровней = 0;
	ТекстЗапроса = ПолучитьТекстТаблицыНоменклатур(Запрос, ТипЦен, МассивТоваров, КоличествоУровней);
	
	Запрос.Текст = ТекстЗапроса + "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Наценки.Номенклатура,
	|	Наценки.ПроцентНаценки,
	|	Наценки.МинимальнаяНаценка,
	|	Наценки.СуммаНаценки
	|ПОМЕСТИТЬ
	|	ТаблицаНаценки
	|ИЗ
	|	РегистрСведений.Наценки.СрезПоследних(&МоментВремени, (ТипЦен, Номенклатура) В (ВЫБРАТЬ ТипЦен, Группа ИЗ ТаблицаНоменклатуры)) КАК Наценки
	|ГДЕ
	|	Наценки.ПроцентНаценки <> 0 ИЛИ Наценки.СуммаНаценки <> 0 ИЛИ Наценки.МинимальнаяНаценка <> 0
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Номенклатура,
	|	ТаблицаНоменклатуры.Приоритет,
	|	Наценки.ПроцентНаценки КАК ПроцентНаценки,
	|	Наценки.СуммаНаценки КАК СуммаНаценки,
	|	Наценки.МинимальнаяНаценка КАК МинимальнаяНаценка
	|ПОМЕСТИТЬ
	|	НаценкиНоменклатуры
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаНаценки КАК Наценки
	|ПО
	|	ТаблицаНоменклатуры.Группа = Наценки.Номенклатура
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаНаценки
	|;
	|УНИЧТОЖИТЬ
	|	ТаблицаНоменклатуры
	|;
	|
	|ВЫБРАТЬ
	|	НаценкиНоменклатуры.Номенклатура,
	|	МИНИМУМ(НаценкиНоменклатуры.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ
	|	НаценкиНоменклатурыСрез
	|ИЗ
	|	НаценкиНоменклатуры КАК НаценкиНоменклатуры
	|СГРУППИРОВАТЬ ПО
	|	НаценкиНоменклатуры.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	НаценкиНоменклатурыСрез.Номенклатура КАК Номенклатура,
	|	НаценкиНоменклатуры.ПроцентНаценки,
	|	НаценкиНоменклатуры.СуммаНаценки,
	|	НаценкиНоменклатуры.МинимальнаяНаценка
	|ИЗ
	|	НаценкиНоменклатурыСрез КАК НаценкиНоменклатурыСрез
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	НаценкиНоменклатуры КАК НаценкиНоменклатуры
	|ПО
	|	НаценкиНоменклатурыСрез.Номенклатура = НаценкиНоменклатуры.Номенклатура И 
	|	НаценкиНоменклатурыСрез.Приоритет = НаценкиНоменклатуры.Приоритет
	|";
	
	ТаблицаНаценки = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура", СтрокаТоваров.Номенклатура);
		
		Наценка = 0;
		СуммаНаценки = 0;
		МинимальнаяНаценка = 0;
		
		НайденныеСтроки = ТаблицаНаценки.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество()>0 Тогда
			Наценка = НайденныеСтроки[0].ПроцентНаценки;
			СуммаНаценки = НайденныеСтроки[0].СуммаНаценки;
			МинимальнаяНаценка = НайденныеСтроки[0].МинимальнаяНаценка;
		КонецЕсли;
		
		СтрокаТоваров[ИмяРеквизита] = Наценка;
		
		Если Объект.ХозОперация = Справочники.ХозОперации.УстановкаРекомендуемыхНаценок Тогда
			тмпИмяРеквизита = СтрЗаменить(ИмяРеквизита,"ТекущийПроцентНаценки","ТекущаяСуммаНаценки");
			СтрокаТоваров[тмпИмяРеквизита] = СуммаНаценки;
		КонецЕсли;
		Если Объект.ХозОперация = Справочники.ХозОперации.УстановкаРекомендуемыхНаценок Тогда
			тмпИмяРеквизита = СтрЗаменить(ИмяРеквизита,"ТекущийПроцентНаценки","МинимальнаяНаценка");
			Если СтрокаТоваров[тмпИмяРеквизита]=0 Тогда
				СтрокаТоваров[тмпИмяРеквизита] = МинимальнаяНаценка;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьРеквизитРекомендуемыйПроцентНаценки()

// Процедура выполняет заполнение реквизита табличной части "товары" ценой по типу цен.
//
Процедура ЗаполнитьРеквизитЦена(Объект, ТипЦен, ТекущаяСтрока, ИмяРеквизита, ИмяТабличнойЧасти, ПараметрыДействия) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТипЦен) Тогда
		Возврат;
	КонецЕсли;
	
	// Получим менеджер объекта.
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = МенеджерОбъекта.ПолучитьПараметрыДействия(Объект,ПараметрыДействия);
	
	Момент = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Момент", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка.МоментВремени(), Неопределено));
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТаблицаТоваров = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТаблицаТоваров", Объект[ИмяТабличнойЧасти]);
	Иначе
		ТаблицаТоваров = Новый Массив;
		ТаблицаТоваров.Добавить(ТекущаяСтрока);
	КонецЕсли;
	
	МассивТоваров = Новый Массив;
	Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		СтрокаТоваров[ИмяРеквизита] = 0;
		
		Если МассивТоваров.Найти(СтрокаТоваров.Номенклатура) = Неопределено Тогда
			МассивТоваров.Добавить(СтрокаТоваров.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МоментВремени",              Момент);
	Запрос.УстановитьПараметр("ТипЦен",                     ТипЦен);
	Запрос.УстановитьПараметр("Номенклатура",               МассивТоваров);
	Запрос.УстановитьПараметр("Контрагент",                 Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДоговорВзаиморасчетов",      Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка());
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",           Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПодразделениеКомпании",      Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Цены.Номенклатура,
	|	Цены.Цена
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(&МоментВремени, 
	|			ТипЦен = &ТипЦен И 
	|			Контрагент = &Контрагент И 
	|			ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов И 
	|			ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры И 
	|			ЕдиницаИзмерения = &ЕдиницаИзмерения И 
	|			ПодразделениеКомпании = &ПодразделениеКомпании И 
	|			Номенклатура В (&Номенклатура)) КАК Цены
	|ГДЕ
	|	Цены.Цена <> 0
	|";
	
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура", СтрокаТоваров.Номенклатура);
		
		Цена = 0;
		
		НайденныеСтроки = ТаблицаЦен.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество()>0 Тогда
			Цена = НайденныеСтроки[0].Цена;
		КонецЕсли;
		
		СтрокаТоваров[ИмяРеквизита] = Цена;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьРеквизитЦена()

// Процедура выполняет заполнение реквизита табличной части "Товары" остаток алкогольной продукции.
//
Процедура ЗаполнитьРеквизитОстатокАлкоПродукции(Объект, ТекущаяСтрока, ИмяТабличнойЧасти = "Товары", ПараметрыДействия = Неопределено) Экспорт
	
	Если НЕ ЕстьРеквизит(Объект, "ОстатокАлкоПродукции", ИмяТабличнойЧасти) Тогда
		Возврат;
	КонецЕсли;
	
	// Получим менеджер объекта.
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = МенеджерОбъекта.ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Момент           = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Момент", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка.МоментВремени(), Неопределено));
	ОрганизацияЕГАИС = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ОрганизацияЕГАИС", Неопределено);
	ТорговыйЗал      = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТорговыйЗал", Ложь);
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТаблицаТоваров = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТаблицаТоваров", Объект[ИмяТабличнойЧасти]);
		ТаблицаТоваров = ТаблицаТоваров.Выгрузить();
	Иначе
		ТаблицаТоваров = Новый ТаблицаЗначений;
		ТаблицаТоваров.Колонки.Добавить("АлкогольнаяПродукция", Новый ОписаниеТипов("СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС"));
		ТаблицаТоваров.Колонки.Добавить("Справка2",             Новый ОписаниеТипов("СправочникСсылка.Справки2ЕГАИС"));
		ТаблицаТоваров.Колонки.Добавить("НомерСтроки",          Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0)));
		
		НоваяСтрока = ТаблицаТоваров.Добавить();
		НоваяСтрока.АлкогольнаяПродукция = ТекущаяСтрока.АлкогольнаяПродукция;
		НоваяСтрока.Справка2             = ТекущаяСтрока.Справка2;
		НоваяСтрока.НомерСтроки          = ТекущаяСтрока.НомерСтроки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МоментВремени",    Момент);
	Запрос.УстановитьПараметр("ТаблицаТоваров",   ТаблицаТоваров);
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	"+?(ТорговыйЗал, "ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка)", "ТаблицаТоваров.Справка2")+" КАК Справка2
	|ПОМЕСТИТЬ
	|	ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.АлкогольнаяПродукция.Упакована ТОГДА
	|			ЕСТЬNULL(ОстаткиАлкогольнойПродукцииЕГАИС.КоличествоОстаток, 0)
	|		ИНАЧЕ
	|			ЕСТЬNULL(ОстаткиАлкогольнойПродукцииЕГАИС.КоличествоОстаток*10, 0)
	|	КОНЕЦ КАК Остаток
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(&МоментВремени, (ОрганизацияЕГАИС, АлкогольнаяПродукция, Справка2) В (ВЫБРАТЬ ОрганизацияЕГАИС, АлкогольнаяПродукция, Справка2 ИЗ ТаблицаТоваров)) КАК ОстаткиАлкогольнойПродукцииЕГАИС
	|ПО
	|	ТаблицаТоваров.АлкогольнаяПродукция = ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция И 
	|	ТаблицаТоваров.Справка2 = ОстаткиАлкогольнойПродукцииЕГАИС.Справка2
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТоваров = Объект[ИмяТабличнойЧасти][Выборка.НомерСтроки-1];
		СтрокаТоваров.ОстатокАлкоПродукции = Выборка.Остаток;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьРеквизитОстатокАлкоПродукции()
