
#Область ОписаниеПеременных

&НаКлиенте
Перем ТекущиеДанныеИсходноеСостояние;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНастройкиОтбораПоУмолчанию();
	
	Объект.НазначениеШаблона = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров;
	Объект.Дата = ТекущаяДатаСеанса();
	Объект.ДатаДополнительно = Объект.Дата;
	
	Если ЭтоАдресВременногоХранилища(Параметры.АдресВХранилище) Тогда
		
		СтруктураДанных = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);
		
		Объект.ИсходныеДанныеТовары.Загрузить(СтруктураДанных.Товары);
		
		Если Объект.ИсходныеДанныеТовары.Количество() = 0 Тогда
			Отказ = Истина;
			ВывестиСообщение(НСтр("ru = 'Нет данных для печати'"));
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураДанных.СтруктураДействий) Тогда
			
			ПараметрДействия = Неопределено;
			
			Если СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьОрганизацию", ПараметрДействия) Тогда
				Объект.Организация = ПараметрДействия;
			КонецЕсли;
			
			Если СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьПодразделениеКомпании", ПараметрДействия) Тогда
				Объект.ПодразделениеКомпании = ПараметрДействия;
			КонецЕсли;
						
			Если СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьСклад", ПараметрДействия) Тогда
				УстановитьЭлементОтбораСКД(КомпоновщикНастроек, "Склад", ПараметрДействия, ЗначениеЗаполнено(ПараметрДействия));
				Объект.Склад = ПараметрДействия;
			КонецЕсли;
			
			Если СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьТипЦены", ПараметрДействия) Тогда
				Объект.ТипЦены = ПараметрДействия;
			КонецЕсли;
						
			Если СтруктураДанных.СтруктураДействий.Свойство("ПоказыватьКолонкуКоличествоВДокументе", ПараметрДействия) Тогда
				Элементы.ТоварыКоличествоВДокументе.Видимость = ПараметрДействия;
			КонецЕсли;
			
			Если СтруктураДанных.СтруктураДействий.Свойство("УстановитьРежимПечатиИзДокумента", ПараметрДействия) Тогда
				ПечатьИзДокумента = Истина;
				Элементы.Настройки.Видимость = Ложь;
			КонецЕсли;
			
			ЗаполнитьКоличествоЭтикетокПоДокументу        = СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьКоличествоЭтикетокПоДокументу", ПараметрДействия);
			ЗаполнитьКоличествоЭтикетокПоОстаткамНаСкладе = СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьКоличествоЭтикетокПоОстаткамНаСкладе", ПараметрДействия);
			ЗаполнитьКоличествоЦенниковПоДокументу        = СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьКоличествоЦенниковПоДокументу", ПараметрДействия);
			ЗаполнитьКоличествоЦенниковПоОстаткамНаСкладе = СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьКоличествоЦенниковПоОстаткамНаСкладе", ПараметрДействия);
			СтрочныеСкидки = ПолучитьЗначениеПараметраСтруктуры(СтруктураДанных.СтруктураДействий, "СтрочныеСкидки", Ложь);
			
			
			Если СтруктураДанных.СтруктураДействий.Свойство("УстановитьРежим", ПараметрДействия) Тогда
				УстановитьРежим(ПараметрДействия);
			Иначе
				ВызватьИсключение НСтр("ru = 'Режим печати не установлен'");;
			КонецЕсли;
			
			Если СтруктураДанных.СтруктураДействий.Свойство("ЗаполнитьТаблицуТоваров", ПараметрДействия) Тогда
				ЗаполнитьТаблицуТоваровНаСервере(Ложь,,,СтрочныеСкидки);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		// Вызов обработки из интерфейса
		ЗаполнитьКоличествоЭтикетокПоДокументу        = Ложь;
		ЗаполнитьКоличествоЭтикетокПоОстаткамНаСкладе = Истина;
		ЗаполнитьКоличествоЦенниковПоДокументу        = Ложь;
		ЗаполнитьКоличествоЦенниковПоОстаткамНаСкладе = Истина;
		УстановитьРежимПечатьЭтикетокИЦенниковНаСервере();
		
	КонецЕсли;
	
	ОбновитьШаблоныВлияющиеНаВидимостьЭлементов();
	
	ОбновитьВидимостьЗависимыхОтШаблонаПолей();
	
	Если ЗначениеЗаполнено(Объект.ТипЦены) Тогда
		ЗаполнитьЗначенияПоУмолчанию(Ложь);
	Иначе
		ЗаполнитьЗначенияПоУмолчанию(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ШаблоныЭтикетокИЦенников" Тогда
		
		ОбновитьШаблоныВлияющиеНаВидимостьЭлементов();
		ОбновитьВидимостьЗависимыхОтШаблонаПолей();
	//Мальцев А.Ю. +++
	
	ИначеЕсли ИмяСобытия = "ПечатьЭтикетокЗагрузка" Тогда
	    итЗаполнитьИзДанныхХранилища(Параметр);
	//Мальцев А.Ю. ---
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда
		
		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.СкладыКомпании.ФормаСписка" Тогда
		
		СкладОбработкаВыбораНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "Товары");
	Если Объект.Товары.Количество() > 0 Тогда
		Если ЕстьРеквизитНаКлиенте(ЭтотОбъект.ВладелецФормы,"ТекущийЭлементСписка") Тогда
			ЗаполнитьТаблицуТоваровНаСервере(Истина, Истина, ЭтотОбъект.ВладелецФормы.ТекущийЭлементСписка);
		ИначеЕсли ЕстьРеквизитНаКлиенте(ЭтотОбъект.ВладелецФормы,"Объект") И ЕстьРеквизитНаКлиенте(ЭтотОбъект.ВладелецФормы.Объект,"Ссылка") Тогда
			ЗаполнитьТаблицуТоваровНаСервере(Истина, Истина, ЭтотОбъект.ВладелецФормы.Объект.Ссылка);
		Иначе
			ЗаполнитьТаблицуТоваровНаСервере(Истина, Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Если ЭтоАдресВременногоХранилища(СохраненныеНастройки) Тогда
		
		ТаблицаСохраненныеНастройки = ПолучитьИзВременногоХранилища(СохраненныеНастройки);
		Для Каждого СтрокаТЧ Из ТаблицаСохраненныеНастройки Цикл
			Настройки.Вставить(СтрокаТЧ.Ключ, СтрокаТЧ.Значение);
		КонецЦикла;
		
	Иначе
		
		// Сохранение отбора выполняется только если это не печать из документа
		Настройки.Вставить("НастройкиОтбора",Новый ХранилищеЗначения(КомпоновщикНастроек.Настройки));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Параметры.Свойство("АдресВХранилище") И ЭтоАдресВременногоХранилища(Параметры.АдресВХранилище) Тогда
		
		ТаблицаСохраненныеНастройки = Новый ТаблицаЗначений;
		ТаблицаСохраненныеНастройки.Колонки.Добавить("Ключ");
		ТаблицаСохраненныеНастройки.Колонки.Добавить("Значение");
		
		Для Каждого КлючИЗначение Из Настройки Цикл
			НоваяСтрока = ТаблицаСохраненныеНастройки.Добавить();
			НоваяСтрока.Ключ = КлючИЗначение.Ключ;
			НоваяСтрока.Значение = КлючИЗначение.Значение;
		КонецЦикла;
		
		СохраненныеНастройки = ПоместитьВоВременноеХранилище(ТаблицаСохраненныеНастройки, УникальныйИдентификатор);
		
		Настройки.Очистить();
		
	Иначе
				
		ВидимостьРежимаЗаполнения = Настройки.Получить("ВидимостьРежимаЗаполнения");
		Элементы.ГруппаРежимЗаполнения.Видимость = ВидимостьРежимаЗаполнения;
		Элементы.РежимЗаполнения.Заголовок = ?(ВидимостьРежимаЗаполнения, НСтр("ru = 'Скрыть режим заполнения'"), НСтр("ru = 'Показать режим заполнения'"));
		
		НастройкиОтбора = Настройки.Получить("НастройкиОтбора");
		Если НастройкиОтбора <> Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтбора.Получить());
		Иначе
			ЗагрузитьНастройкиОтбораПоУмолчанию();
		КонецЕсли;
		
		Режим = Настройки.Получить("Режим");
		Если ЗначениеЗаполнено(Режим)
			И (Режим = "ПечатьЭтикетокИЦенников" ИЛИ Режим = "ПечатьЦенников" ИЛИ Режим = "ПечатьЭтикеток") Тогда
			УстановитьРежим(Режим);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПодразделениеКомпанииПриИзменении(Элемент)
	ПодразделениеКомпанииПриИзмененииНаСервере();
	ЗаполнитьТаблицуТоваровНаСервере(,,,,Истина);
КонецПроцедуры

&НаСервере
Процедура ПодразделениеКомпанииПриИзмененииНаСервере()
	Объект.Организация = Объект.ПодразделениеКомпании.Организация;
	Объект.ТипЦены = Объект.ПодразделениеКомпании.ТипЦенРеализации;
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	УстановитьЭлементОтбораСКД(КомпоновщикНастроек, "Склад", Объект.Склад, ЗначениеЗаполнено(Объект.Склад));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ТоварыШаблонЦенникаПриИзменении(Элемент)
	ОбновитьВидимостьЗависимыхОтШаблонаПолей();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыШаблонЭтикеткиПриИзменении(Элемент)
	ОбновитьВидимостьЗависимыхОтШаблонаПолей();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииЯчейки(Элемент)
	
	Если Не Элемент.ТекущийЭлемент = Элементы.ТоварыШтрихкод Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.ТоварыШтрихкод.СписокВыбора.Очистить();
		Возврат;
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",   ТекущиеДанные.Номенклатура);
	Структура.Вставить("Характеристика", ТекущиеДанные.Характеристика);
	Структура.Вставить("ЕдиницаИзмерения",ТекущиеДанные.ЕдиницаИзмерения);
	
	Элементы.ТоварыШтрихкод.СписокВыбора.ЗагрузитьЗначения(ПолучитьШтрихкодыНоменклатуры(Структура));
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанныеИсходноеСостояние = Новый Структура;
	ТекущиеДанныеИсходноеСостояние.Вставить("ЕдиницаИзмерения",     ТекущиеДанные.ЕдиницаИзмерения);
	ТекущиеДанныеИсходноеСостояние.Вставить("КоличествоВДокументе", ТекущиеДанные.КоличествоВДокументе);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанныеИсходноеСостояние = Новый Структура;
	ТекущиеДанныеИсходноеСостояние.Вставить("ЕдиницаИзмерения",             ПредопределенноеЗначение("Справочник.ЕдиницыИзмерения.ПустаяСсылка"));
	ТекущиеДанныеИсходноеСостояние.Вставить("КоличествоВДокументе", 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Новый Структура("Номенклатура, Характеристика, ЕдиницаИзмерения, ВладелецХарактеристики, ВладелецЕдиницыИзмерения");
	Если НЕ ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.ЕдиницаИзмерения) Тогда
		Элементы.Товары.ТекущиеДанные.ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения(Элементы.Товары.ТекущиеДанные.Номенклатура);
		Элементы.Товары.ТекущиеДанные.Коэффициент = ПолучитьКоэфЕдиницыИзмерения(Элементы.Товары.ТекущиеДанные.ЕдиницаИзмерения);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Элементы.Товары.ТекущиеДанные);
	ЗаполнитьЗначенияСвойств(Элементы.Товары.ТекущиеДанные, ПриИзмененииНоменклатуры(ТекущиеДанные));
	
	Элементы.Товары.ТекущиеДанные.КоличествоЦенников = 1;
	Элементы.Товары.ТекущиеДанные.ШаблонЦенника = Объект.ШаблонЦенника;
	Элементы.Товары.ТекущиеДанные.Выбран = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьЕдиницуИзмерения(Номенклатура)
	Возврат Номенклатура.ОсновнаяЕдиницаИзмерения;
КонецФункции

&НаСервере
Функция ПолучитьКоэфЕдиницыИзмерения(ЕдиницаИзмерения)
	Возврат ЕдиницаИзмерения.Коэффициент;
КонецФункции

&НаКлиенте
Процедура ТоварыХарактеристикаПриИзменении(Элемент)
	
	ТекущиеДанные = Новый Структура("Номенклатура, Характеристика, ЕдиницаИзмерения, ВладелецХарактеристики, ВладелецЕдиницыИзмерения");
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Элементы.Товары.ТекущиеДанные);
	ЗаполнитьЗначенияСвойств(Элементы.Товары.ТекущиеДанные, ПриИзмененииНоменклатуры(ТекущиеДанные));
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУпаковкаПриИзменении(Элемент)
	
	ТекущиеДанные = Новый Структура("Номенклатура, Характеристика, ЕдиницаИзмерения, СтараяЕдиницаИзмерения, СтароеКоличествоВДокументе, ВладелецХарактеристики, ВладелецЕдиницыИзмерения");
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Элементы.Товары.ТекущиеДанные);
	ТекущиеДанные.СтараяЕдиницаИзмерения = ТекущиеДанныеИсходноеСостояние.ЕдиницаИзмерения;
	ТекущиеДанные.СтароеКоличествоВДокументе = ТекущиеДанныеИсходноеСостояние.КоличествоВДокументе;
	
	ЗаполнитьЗначенияСвойств(Элементы.Товары.ТекущиеДанные, ПриИзмененииНоменклатуры(ТекущиеДанные));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьВыделенныеСтроки(Команда)
	
	МассивСтрок = Элементы.Товары.ВыделенныеСтроки;
	
	Если МассивСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'В списке отсутствуют выделенные строки'"));
		Возврат;
	КонецЕсли;
	
	Для Каждого НомерСтроки Из МассивСтрок Цикл
		СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(НомерСтроки);
		СтрокаТЧ.Выбран = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьВыделенныеСтроки(Команда)
	
	МассивСтрок = Элементы.Товары.ВыделенныеСтроки;
	
	Если МассивСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'В списке отсутствуют выделенные строки'"));
		Возврат;
	КонецЕсли;
	
	Для Каждого НомерСтроки Из МассивСтрок Цикл
		СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(НомерСтроки);
		СтрокаТЧ.Выбран = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКоличествоПоУмолчанию(Команда)
	
	УстановитьКоличествоПоУмолчаниюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуТоваров(Команда)
	
	Если Объект.Товары.Количество() = 0 Тогда
		ЗаполнитьТаблицуТоваровНаСервере(Истина, Ложь);
	Иначе
		
		ОчиститьСообщения();
		
		ТекстВопроса = НСтр("ru = 'Сохранить данные о количестве, шаблонах в табличной части при перезаполнении?'");
		ОповещениеЗаписи = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения",ЭтотОбъект,"КомандаВопросЗаполнениеТоваров");
		ПоказатьВопрос(ОповещениеЗаписи,ТекстВопроса,РежимДиалогаВопрос.ДаНетОтмена);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ОчиститьСообщения();
	
	РезультатПроверки = ВыполнитьПроверку();
	Если Не РезультатПроверки.ТоварыВыбраны Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Не выбрано ни одного товара'"));
		Возврат;
	КонецЕсли;
	
	Если РезультатПроверки.ПроверкаВыполнена Тогда
		
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		
		ИменаМакетов = "";
		
		Если Режим = "ПечатьЭтикетокИЦенников" Тогда
			ИменаМакетов = "ЭтикеткаТовары,ЦенникТовары";
		ИначеЕсли Режим = "ПечатьЦенников" Тогда
			ИменаМакетов = "ЦенникТовары";
		ИначеЕсли Режим = "ПечатьЭтикеток" Тогда
			ИменаМакетов = "ЭтикеткаТовары";
		КонецЕсли;
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Обработка.ПечатьЭтикетокИЦенников",
			ИменаМакетов,
			ПараметрКоманды,
			ЭтотОбъект,
			ПолучитьПараметрыПечати());
			
		Если Режим = "ПечатьЭтикетокИЦенников" ИЛИ Режим = "ПечатьЦенников" Тогда
			ВыполнитьЗаполнениеТоваровВОборудовании();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаполнениеТоваровВОборудовании()
	
	ПередачаПослеПечати = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.ПередачаВОборудованиеПослеПечати, Объект.ПодразделениеКомпании);
	Если ПередачаПослеПечати = Неопределено ИЛИ ПередачаПослеПечати = Ложь Тогда
		Возврат;			
	КонецЕсли;
	МассивНоменклатуры = Новый Массив;	
	Для Каждого СтрокаТовар ИЗ Объект.Товары Цикл
		Если СтрокаТовар.Выбран Тогда
			МассивНоменклатуры.Добавить(СтрокаТовар.Номенклатура);				
		КонецЕсли;
	КонецЦикла;
	
	//Если МассивНоменклатуры.Количество() = 0 Тогда
	//	Возврат;			
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВОборудовании.ГруппаТоваров КАК ГруппаТоваров,
	|	ТоварыВОборудовании.Номенклатура КАК Номенклатура,
	|	ТоварыВОборудовании.Штрихкод КАК Штрихкод,
	|	ТоварыВОборудовании.НомерЯчейки КАК НомерЯчейки,
	|	&Момент КАК МоментИзменения
	|ИЗ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ГДЕ
	|	ТоварыВОборудовании.Номенклатура В(&МассивНоменклатуры)
	|	И ТоварыВОборудовании.ВыполненаПечатьЦенников = ЛОЖЬ
	|	И ТоварыВОборудовании.ГруппаТоваров В (ВЫБРАТЬ
	|			ПодключаемоеОборудование.ГруппаТоваровОборудования
	|		ИЗ
	|			Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|		ГДЕ
	|			ПодключаемоеОборудование.ОсновнойОтдел.ПодразделениеКомпании = &ПодразделениеКомпании)";
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Момент", ТекущаяДатаСеанса());
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = РегистрыСведений.ТоварыВОборудовании.СоздатьМенеджерЗаписи(); 
		НоваяЗапись.ГруппаТоваров  			 = Выборка.ГруппаТоваров;
		НоваяЗапись.Номенклатура   			 = Выборка.Номенклатура;
		НоваяЗапись.Штрихкод          		 = Выборка.Штрихкод;
		НоваяЗапись.НомерЯчейки      		 = Выборка.НомерЯчейки;
		НоваяЗапись.МоментИзменения 		 = Выборка.МоментИзменения;
		НоваяЗапись.ВыполненаПечатьЦенников = Истина;
		НоваяЗапись.Записать(Истина);
	КонецЦикла;
	ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьРежимЗаполнения(Команда)
	
	ВидимостьРежимаЗаполнения = НЕ ВидимостьРежимаЗаполнения;
	Элементы.ГруппаРежимЗаполнения.Видимость = ВидимостьРежимаЗаполнения;
	Элементы.РежимЗаполнения.Заголовок = ?(ВидимостьРежимаЗаполнения, НСтр("ru = 'Скрыть режим заполнения'"), НСтр("ru = 'Показать режим заполнения'"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКоличествоЦенников(Команда)
	
	МассивСтрок = Элементы.Товары.ВыделенныеСтроки;
	Если МассивСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'В списке отсутствуют выделенные строки'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("КомандаОповещения","КомандаВводаКоличестваЦенников");
	ПараметрыВызова.Вставить("МассивСтрок",МассивСтрок);
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтотОбъект, ПараметрыВызова);
	ПоказатьВводЧисла(Оповещение,0,НСтр("ru = 'Введите количество ценников'"), 10, 2);
			
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКоличествоЭтикеток(Команда)
	
	МассивСтрок = Элементы.Товары.ВыделенныеСтроки;
	Если МассивСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'В списке отсутствуют выделенные строки'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("КомандаОповещения","КомандаВводаКоличестваЭтикеток");
	ПараметрыВызова.Вставить("МассивСтрок",МассивСтрок);
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтотОбъект, ПараметрыВызова);
	ПоказатьВводЧисла(Оповещение,0,НСтр("ru = 'Введите количество этикеток'"), 10, 2);

	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьШаблонЦенников(Команда)
	
	МассивСтрок = Элементы.Товары.ВыделенныеСтроки;
	Если МассивСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'В списке отсутствуют выделенные строки'"));
		Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение = Неопределено;
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("Отбор", Новый Структура("Назначение", ПредопределенноеЗначение("Перечисление.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров")));
	ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
	
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("КомандаОповещения","КомандаВыбораШаблонаЦенников");
	ПараметрыВызова.Вставить("МассивСтрок",МассивСтрок);
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтотОбъект, ПараметрыВызова);
	ОткрытьФорму("Справочник.ШаблоныЭтикетокИЦенников.ФормаВыбора",ПараметрыФормыВыбора, ЭтотОбъект,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьШаблонЭтикеток(Команда)
	
	МассивСтрок = Элементы.Товары.ВыделенныеСтроки;
	Если МассивСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'В списке отсутствуют выделенные строки'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("Отбор", Новый Структура("Назначение", ПредопределенноеЗначение("Перечисление.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров")));
	ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
	
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("КомандаОповещения","КомандаВыбораШаблонаЭтикеток");
	ПараметрыВызова.Вставить("МассивСтрок",МассивСтрок);
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтотОбъект, ПараметрыВызова);
	ОткрытьФорму("Справочник.ШаблоныЭтикетокИЦенников.ФормаВыбора",ПараметрыФормыВыбора, ЭтотОбъект,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимПечатьЦенников(Команда)
	
	УстановитьРежимПечатьЦенниковНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимПечатьЭтикетокИЦенников(Команда)
	
	УстановитьРежимПечатьЭтикетокИЦенниковНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимПечатьЭтикеток(Команда)
	
	УстановитьРежимПечатьЭтикетокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовыйШтрихкодEAN13(Команда)
	
	МассивСтрок = Элементы.Товары.ВыделенныеСтроки;
	
	Если МассивСтрок.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'В списке отсутствуют выделенные строки'"));
		Возврат;
	КонецЕсли;
		
	ОписаниеОшибки = "";
	Результат = УстановитьНовыеШтрихкодыEAN13НаСервере(ОписаниеОшибки);
	
	Если Результат = 0 И ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ПоказатьПредупреждение(,ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНастройкиОтбораПоУмолчанию(Команда)
	
	ЗагрузитьНастройкиОтбораПоУмолчанию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКоличествоЭтикеток.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ШаблонЭтикетки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.LightGray);

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКоличествоЦенников.Имя);
	// ТК + 
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ШаблонЦенника");
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ШаблонЦенника");
	// ТК - 
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.LightGray);

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКоличествоЦенников.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Выбран");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоЦенников");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыШаблонЦенника.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Выбран");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ШаблонЦенника");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКоличествоЭтикеток.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Выбран");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоЭтикеток");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыШаблонЭтикетки.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Выбран");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ШаблонЭтикетки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	//

	УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеЕдиницИзмерения(Форма,
													  ИмяПоляВводаЕдиницИзмерения = "ТоварыНоменклатураЕдиницаИзмерения",
													  ПутьКПолюОтбора = "Объект.Товары.ЕдиницаИзмерения") Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЕдиницыИзмерения") Тогда
		Возврат;
	КонецЕсли;
	 
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаЕдиницИзмерения].Имя);

	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ФормаОбработки,
	                                                            ИмяПоляВводаХарактеристики = "ТоварыХарактеристика",
																ПутьКПолюОтбора = "Объект.Товары.ВладелецХарактеристики") Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		Возврат;                  
	КонецЕсли;
																
	УсловноеОформлениеФормы = ФормаОбработки.УсловноеОформление;
	ЭлементыФормы = ФормаОбработки.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформлениеФормы.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаХарактеристики].Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<без характеристик>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

#Область ЗаполнениеИИнициализация

&НаСервере
Процедура ЗаполнитьЗначенияПоУмолчанию(ЗаполнитьТипЦен)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПодразделениеКомпании) Тогда 
		Объект.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
	КонецЕсли;
	
	Если ЗаполнитьТипЦен Тогда
		Если Объект.Склад.Розничный Тогда
			Объект.ТипЦены = Объект.Склад.ТипЦенРозничнойТорговли;
		ИначеЕсли ЗначениеЗаполнено(Объект.ПодразделениеКомпании) И ЗначениеЗаполнено(Объект.ПодразделениеКомпании.ТипЦенРеализации) Тогда
			Объект.ТипЦены = Объект.ПодразделениеКомпании.ТипЦенРеализации;
		Иначе
			Объект.ТипЦены = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда 
		Объект.Организация = ?(ЗначениеЗаполнено(ПараметрыСеанса.ПодразделениеКомпании.Организация),ПараметрыСеанса.ПодразделениеКомпании.Организация,ПараметрыСеанса.Организация);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Функция ПолучитьПараметрыПечати()
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Номенклатура",      Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Товары.Колонки.Добавить("Характеристика",    Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Товары.Колонки.Добавить("ЕдиницаИзмерения",  Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	Товары.Колонки.Добавить("Цена",              Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ЦенаДополнительно", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("Штрихкод",          Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("ШаблонЦенника",     Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("КоличествоЦенников",Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ШаблонЭтикетки",    Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("ШаблонЭтикеткиПодготовлено", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("КоличествоЭтикеток",         Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ОстатокНаСкладе",            Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("КоличествоВДокументе",       Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("Весовой",                    Новый ОписаниеТипов("Булево"));
	Товары.Колонки.Добавить("ДатаПоследнегоИзмененияЦены",Новый ОписаниеТипов("Дата"));
	Товары.Колонки.Добавить("ДатаПоследнегоИзмененияЦеныДополнительно", Новый ОписаниеТипов("Дата"));
	
	Товары.Колонки.Добавить("ЦенаДоАкции",                				Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("АкцияНачалоДействия", 						Новый ОписаниеТипов("Дата"));
	Товары.Колонки.Добавить("АкцияКонецДействия", 						Новый ОписаниеТипов("Дата"));
	Товары.Колонки.Добавить("ЦенаКопейки",                				Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ЦенаДоАкцииКопейки",          				Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ЦенаРубли",                				Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ЦенаДоАкцииРубли",          				Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ПЛУ",          							Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("Цена100Копейки",                				Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ЦенаДоАкции100Копейки",          				Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("Цена100Рубли",                				Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ЦенаДоАкции100Рубли",          				Новый ОписаниеТипов("Число"));
	
	//Мальцев А.Ю. +++
	Товары.Колонки.Добавить("ЦенаДоАкции100",          					Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("НаименованиеАкции",          				Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("ОписаниеАкции",          					Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("ПроцентСкидки",          					Новый ОписаниеТипов("Число"));	
	//Мальцев А.Ю. ---                                              	
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если НЕ СтрокаТЧ.Выбран Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ШаблонЭтикетки) Тогда
			НоваяСтрока.КоличествоЭтикеток = 0;
		КонецЕсли;
		// ТК +
		//НоваяСтрока.ШаблонЦенника = Объект.ШаблонЦенника;
		// ТК -
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ШаблонЦенника) Тогда
			НоваяСтрока.КоличествоЦенников = 0;
		КонецЕсли;
		
		
	КонецЦикла;
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Товары",                ПоместитьВоВременноеХранилище(Товары, УникальныйИдентификатор));
	ПараметрыПечати.Вставить("Организация",           Объект.Организация);
	ПараметрыПечати.Вставить("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	ПараметрыПечати.Вставить("ТипЦены",               Объект.ТипЦены);
	ПараметрыПечати.Вставить("Дата",                  Объект.Дата);
	ПараметрыПечати.Вставить("Склад",                 Объект.Склад);
	ПараметрыПечати.Вставить("ТипЦеныДополнительно",  Объект.ТипЦеныДополнительно);
	ПараметрыПечати.Вставить("ГруппыТоваровОборудования",Объект.ГруппыТоваровОборудования);
	ПараметрыПечати.Вставить("ДатаДополнительно",     Объект.ДатаДополнительно);
	ПараметрыПечати.Вставить("СтруктураМакетаШаблона",Неопределено);
	ПараметрыПечати.Вставить("РежимАкции",			  Объект.РежимАкции);
	
	Возврат ПараметрыПечати;
	
КонецФункции // ПолучитьПараметрыПечати()

&НаСервере
Процедура УстановитьРежимПечатьЭтикетокИЦенниковНаСервере()
	
	АвтоЗаголовок = Ложь;
	Режим = "ПечатьЭтикетокИЦенников";
	
	Если ПечатьИзДокумента Тогда
		Заголовок = НСтр("ru = 'Печать этикеток и ценников из документа'");
	Иначе
		Заголовок = НСтр("ru = 'Печать этикеток и ценников'");
	КонецЕсли;
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРежимПечатьЭтикетокНаСервере()
	
	АвтоЗаголовок = Ложь;
	Режим = "ПечатьЭтикеток";
	
	Если ПечатьИзДокумента Тогда
		Заголовок = НСтр("ru = 'Печать этикеток из документа'");
	Иначе
		Заголовок = НСтр("ru = 'Печать этикеток'");
	КонецЕсли;
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьЭлементов()
	
	ВидимостьЭтикетки = Ложь;
	ВидимостьЦенники  = Ложь;
		
	Если Режим = "ПечатьЭтикетокИЦенников" Тогда
		ВидимостьЭтикетки = Истина;
		ВидимостьЦенники  = Истина;
	ИначеЕсли Режим = "ПечатьЦенников" Тогда
		ВидимостьЭтикетки = Ложь;
		ВидимостьЦенники  = Истина;
	ИначеЕсли Режим = "ПечатьЭтикеток" Тогда
		ВидимостьЭтикетки = Истина;
		ВидимостьЦенники  = Ложь;
	КонецЕсли;
	
	Элементы.ТоварыКоличествоЭтикеток.Видимость               = ВидимостьЭтикетки;
	Элементы.ТоварыШаблонЭтикетки.Видимость                   = ВидимостьЭтикетки;
	Элементы.ТоварыУстановитьШаблонЭтикеток.Видимость         = ВидимостьЭтикетки;
	Элементы.ТоварыУстановитьКоличествоЭтикеток.Видимость     = ВидимостьЭтикетки;
	Элементы.РежимЗаполненияЭтикеток.Видимость                = ВидимостьЭтикетки;
	Элементы.ЗаполнитьКоличествоЭтикетокПоДокументу.Видимость = ВидимостьЭтикетки И ПечатьИзДокумента;
	
	Элементы.ТоварыКоличествоЦенников.Видимость               = ВидимостьЦенники;
	// ТК + 
	//Элементы.ТоварыШаблонЦенника.Видимость                    = Ложь;
	Элементы.ТоварыШаблонЦенника.Видимость                    = ВидимостьЦенники;
	// ТК - 
	Элементы.ТоварыУстановитьШаблонЦенников.Видимость         = ВидимостьЦенники;
	Элементы.ТоварыУстановитьКоличествоЦенников.Видимость     = ВидимостьЦенники;
	Элементы.РежимЗаполненияЦенников.Видимость                = ВидимостьЦенники;
	Элементы.ЗаполнитьКоличествоЦенниковПоДокументу.Видимость = ВидимостьЦенники И ПечатьИзДокумента;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРежимПечатьЦенниковНаСервере()
	
	АвтоЗаголовок = Ложь;
	Режим = "ПечатьЦенников";
	
	Если ПечатьИзДокумента Тогда
		Заголовок = НСтр("ru = 'Печать ценников из документа'");
	Иначе
		Заголовок = НСтр("ru = 'Печать ценников'");
	КонецЕсли;
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРежим(ПараметрРежим)
	
	Если ПараметрРежим = "ПечатьЭтикетокИЦенников" Тогда
		УстановитьРежимПечатьЭтикетокИЦенниковНаСервере();
	ИначеЕсли ПараметрРежим = "ПечатьЦенников" Тогда
		УстановитьРежимПечатьЦенниковНаСервере();
	ИначеЕсли ПараметрРежим = "ПечатьЭтикеток" Тогда
		УстановитьРежимПечатьЭтикетокНаСервере();
	Иначе
		ВызватьИсключение НСтр("ru = 'Установленный режим печати не поддерживается'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановитьНовыеШтрихкодыEAN13НаСервере(ОписаниеОшибки = "")
	
	Количество = 0;
	МассивСтрок = Элементы.Товары.ВыделенныеСтроки;
	
	Штрихкоды = Новый Соответствие;
	
	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого НомерСтроки Из МассивСтрок Цикл
			СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(НомерСтроки);
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Штрихкод) Тогда
				Количество = Количество + 1;
			Иначе
				Продолжить;
			КонецЕсли;
			
			НовыйШтрихкод = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
			НовыйШтрихкод.Объект = СтрокаТЧ.Номенклатура; 
			Если СтрокаТЧ.Номенклатура.ТипНоменклатуры.ИспользованиеШтрихКодов = 3 Тогда
				Если ЗначениеЗаполнено(СтрокаТЧ.Характеристика) Тогда
					НовыйШтрихкод.ХарактеристикаНоменклатуры = СтрокаТЧ.Характеристика;
				Иначе
					ВывестиСообщение(НСтр("ru = 'В строке № %1 у номенклатуры %2 не указана характеристика.'"),Объект, "Характеристика", СтрокаТЧ.НомерСтроки,, СтрокаТЧ.НомерСтроки, СтрокаТЧ.Номенклатура);
					Продолжить;
				КонецЕсли;
			ИначеЕсли СтрокаТЧ.Номенклатура.ТипНоменклатуры.ИспользованиеШтрихКодов = 2 Тогда
				Если ЗначениеЗаполнено(СтрокаТЧ.ЕдиницаИзмерения) Тогда
					НовыйШтрихкод.ЕдиницаИзмерения       = СтрокаТЧ.ЕдиницаИзмерения;
				Иначе
					ВывестиСообщение(НСтр("ru = 'В строке № %1 у номенклатуры %2 не указана единица измерения.'"),Объект, "ЕдиницаИзмерения", СтрокаТЧ.НомерСтроки,, СтрокаТЧ.НомерСтроки, СтрокаТЧ.Номенклатура);
					Продолжить;
				КонецЕсли;
			ИначеЕсли СтрокаТЧ.Номенклатура.ТипНоменклатуры.ИспользованиеШтрихКодов = 0 Тогда
					ВывестиСообщение(НСтр("ru = 'В строке № %1 у номенклатуры %2 в настройке типа номенклатуры отключено ведение штрихкодов.'"),Объект, "Номенклатура", СтрокаТЧ.НомерСтроки,, СтрокаТЧ.НомерСтроки, СтрокаТЧ.Номенклатура);
					Продолжить;
			КонецЕсли;
			
			НовыйШтрихкод.Штрихкод = ШтрихкодированиеВызовСервера.СформироватьНовыйШтрихкод(СтрокаТЧ.Номенклатура);
			НовыйШтрихкод.Записать();
			Штрихкоды.Вставить(СтрокаТЧ, НовыйШтрихкод.Штрихкод);		
		КонецЦикла;
	    ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		
		ОписаниеОшибки = НСтр("ru = 'При записи штрихкодов произошла ошибка.
		                      |Запись штрихкодов не выполнена.
		                      |Дополнительное описание:
		                      |%ДополнительноеОписание%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", ИнформацияОбОшибке().Описание);
		
		Возврат 0;
	КонецПопытки;
	
		
	Для Каждого КлючИЗначение Из Штрихкоды Цикл
		КлючИЗначение.Ключ.Штрихкод = КлючИЗначение.Значение;
	КонецЦикла;
	
	Возврат Количество;
	
КонецФункции

&НаСервере
Процедура УстановитьКоличествоПоУмолчаниюВСтрокеТЧНаСервере(СтрокаТЧ)
	
	// Расчет количества Этикеток.
	Если ЗаполнитьКоличествоЭтикетокПоДокументу И НЕ ЗаполнитьКоличествоЭтикетокПоОстаткамНаСкладе Тогда
		СтрокаТЧ.КоличествоЭтикеток = СтрокаТЧ.КоличествоВДокументе;
	ИначеЕсли ЗаполнитьКоличествоЭтикетокПоДокументу И ЗаполнитьКоличествоЭтикетокПоОстаткамНаСкладе Тогда
		СтрокаТЧ.КоличествоЭтикеток = ?(СтрокаТЧ.КоличествоВДокументе > СтрокаТЧ.ОстатокНаСкладе,СтрокаТЧ.ОстатокНаСкладе,СтрокаТЧ.КоличествоВДокументе);
	ИначеЕсли НЕ ЗаполнитьКоличествоЭтикетокПоДокументу И ЗаполнитьКоличествоЭтикетокПоОстаткамНаСкладе Тогда
		СтрокаТЧ.КоличествоЭтикеток = ?(СтрокаТЧ.ОстатокНаСкладе > 0, СтрокаТЧ.ОстатокНаСкладе, 0);
	КонецЕсли;
	
	// Расчет количества Ценников.
	Если ЗаполнитьКоличествоЦенниковПоДокументу И НЕ ЗаполнитьКоличествоЦенниковПоОстаткамНаСкладе Тогда
		СтрокаТЧ.КоличествоЦенников = ?(СтрокаТЧ.КоличествоВДокументе > 0, 1, 0);
	ИначеЕсли ЗаполнитьКоличествоЦенниковПоДокументу И ЗаполнитьКоличествоЦенниковПоОстаткамНаСкладе Тогда
		СтрокаТЧ.КоличествоЦенников = ?(СтрокаТЧ.ОстатокНаСкладе > 0 ИЛИ СтрокаТЧ.КоличествоВДокументе > 0, 1, 0);
	ИначеЕсли НЕ ЗаполнитьКоличествоЦенниковПоДокументу И ЗаполнитьКоличествоЦенниковПоОстаткамНаСкладе Тогда
		СтрокаТЧ.КоличествоЦенников = ?(СтрокаТЧ.ОстатокНаСкладе > 0, 1, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДанных(СтруктураНастроек)
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация",          Объект.Организация);
	СтруктураНастроек.ПараметрыДанных.Вставить("ПодразделениеКомпании",Объект.ПодразделениеКомпании);

	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		СтруктураНастроек.ПараметрыДанных.Вставить("Дата",             Объект.Дата);
	Иначе
		СтруктураНастроек.ПараметрыДанных.Вставить("Дата",             ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаДополнительно) Тогда
		СтруктураНастроек.ПараметрыДанных.Вставить("ДатаДополнительно",    Объект.ДатаДополнительно);
	Иначе
		СтруктураНастроек.ПараметрыДанных.Вставить("ДатаДополнительно",    ТекущаяДатаСеанса());
	КонецЕсли;
	
	СтруктураНастроек.ПараметрыДанных.Вставить("ТипЦены",              Объект.ТипЦены);
	СтруктураНастроек.ПараметрыДанных.Вставить("ТипЦеныДополнительно", Объект.ТипЦеныДополнительно);
	СтруктураНастроек.ПараметрыДанных.Вставить("ГруппыТоваровОборудования", Объект.ГруппыТоваровОборудования);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьОбязательныеПоляДанных(СтруктураНастроек, ДобавитьШаблоны = Ложь)
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("Штрихкод");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Количество");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Номенклатура");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		СтруктураНастроек.ОбязательныеПоля.Добавить("Характеристика");
		СтруктураНастроек.ОбязательныеПоля.Добавить("ХарактеристикиИспользуются");
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЕдиницыИзмерения") Тогда
		СтруктураНастроек.ОбязательныеПоля.Добавить("ЕдиницаИзмерения");
	КонецЕсли;
	СтруктураНастроек.ОбязательныеПоля.Добавить("Весовой");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ОстатокНаСкладе");
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("Цена");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ДатаПоследнегоИзмененияЦены");
	
	Если ИспользоватьТипЦеныДополнительно И ЗначениеЗаполнено(Объект.ТипЦеныДополнительно) Тогда
		СтруктураНастроек.ОбязательныеПоля.Добавить("ЦенаДополнительно");
		СтруктураНастроек.ОбязательныеПоля.Добавить("ДатаПоследнегоИзмененияЦеныДополнительно");
	КонецЕсли;
	
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЦенаДоАкции");
	СтруктураНастроек.ОбязательныеПоля.Добавить("АкцияНачалоДействия");
	СтруктураНастроек.ОбязательныеПоля.Добавить("АкцияКонецДействия");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЦенаКопейки");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЦенаДоАкцииКопейки");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЦенаРубли");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЦенаДоАкцииРубли");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ПЛУ");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Цена100Копейки");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЦенаДоАкции100Копейки");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Цена100Рубли");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЦенаДоАкции100Рубли");
	
	//Мальцев А.Ю. +++
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЦенаДоАкции100");
	СтруктураНастроек.ОбязательныеПоля.Добавить("НаименованиеАкции");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ОписаниеАкции");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ПроцентСкидки");
	
	//Мальцев А.Ю. ---

	// Шаблоны этикеток и ценников.
	Если ДобавитьШаблоны Тогда
		СтруктураНастроек.ОбязательныеПоля.Добавить("Номенклатура.ТипНоменклатуры.ШаблонЭтикетки");
		СтруктураНастроек.ОбязательныеПоля.Добавить("Номенклатура.ТипНоменклатуры.ШаблонЦенника");
		СтруктураНастроек.ОбязательныеПоля.Добавить("Номенклатура.ШаблонЭтикетки");
		СтруктураНастроек.ОбязательныеПоля.Добавить("Номенклатура.ШаблонЦенника");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуАкций(МассивНоменклатуры)
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	СкидкиСтроки.Объект КАК Номенклатура,
	|	МАКСИМУМ(СкидкиСтроки.Период) КАК Период
	|ПОМЕСТИТЬ
	|	ТаблицаСрезПоследних
	|ИЗ
	|	РегистрСведений.СкидкиСтроки КАК СкидкиСтроки
	|ГДЕ
	|	СкидкиСтроки.Период <= &ДатаДанных И 
	|	(СкидкиСтроки.СрокДействия >= &ДатаДанных
	|		ИЛИ СкидкиСтроки.СрокДействия = ДатаВремя(1,1,1))
	|		И СкидкиСтроки.ПодразделениеКомпании = &ПодразделениеКомпании
	|		И СкидкиСтроки.Объект В (&МассивНоменклатуры)
	|		И СкидкиСтроки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СпециальнаяЦена)
	|СГРУППИРОВАТЬ ПО
	|	СкидкиСтроки.Объект
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаСрезПоследних.Номенклатура КАК Номенклатура,
	|	ТаблицаСрезПоследних.Период КАК АкцияНачалоДействия,
	|	СкидкиСтроки.Регистратор.Дата КАК ДатаДокумента,
	|	СкидкиСтроки.Регистратор КАК Регистратор,
	|	СкидкиСтроки.ЗначениеСкидки КАК ЦенаАкции,
	|	СкидкиСтроки.СрокДействия КАК АкцияКонецДействия
	|ПОМЕСТИТЬ
	|	СкидкиСтроки
	|ИЗ
	|	ТаблицаСрезПоследних КАК ТаблицаСрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СкидкиСтроки КАК СкидкиСтроки
	|ПО
	|	ТаблицаСрезПоследних.Период = СкидкиСтроки.Период И 
	|	ТаблицаСрезПоследних.Номенклатура = СкидкиСтроки.Объект И 
	|	(СкидкиСтроки.СрокДействия >= &ДатаДанных
	|		ИЛИ СкидкиСтроки.СрокДействия = ДатаВремя(1,1,1))
	|		И СкидкиСтроки.ПодразделениеКомпании = &ПодразделениеКомпании
	|	И СкидкиСтроки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СпециальнаяЦена)
	|ГДЕ
	|	СкидкиСтроки.Действует = ИСТИНА
	|;
	|
	|ВЫБРАТЬ
	|	СкидкиСтроки.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(СкидкиСтроки.ДатаДокумента) КАК ДатаДокумента
	|ПОМЕСТИТЬ
	|	СрезПоДатеДокумента
	|ИЗ
	|	СкидкиСтроки КАК СкидкиСтроки
	|СГРУППИРОВАТЬ ПО
	|	СкидкиСтроки.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	СрезПоДатеДокумента.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(СкидкиСтроки.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ
	|	СрезПоДокументу
	|ИЗ
	|	СрезПоДатеДокумента КАК СрезПоДатеДокумента
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	СкидкиСтроки КАК СкидкиСтроки
	|ПО
	|	СрезПоДатеДокумента.Номенклатура = СкидкиСтроки.Номенклатура И 
	|	СрезПоДатеДокумента.ДатаДокумента = СкидкиСтроки.ДатаДокумента
	|СГРУППИРОВАТЬ ПО
	|	СрезПоДатеДокумента.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	СрезПоДокументу.Номенклатура КАК Номенклатура,
	|	СрезПоДокументу.Регистратор КАК Регистратор,
	|	СкидкиСтроки.АкцияНачалоДействия КАК АкцияНачалоДействия,
	|	СкидкиСтроки.АкцияКонецДействия КАК АкцияКонецДействия,
	|	СкидкиСтроки.ДатаДокумента КАК ДатаДокумента,
	|	СкидкиСтроки.ЦенаАкции КАК ЦенаАкции
	|ПОМЕСТИТЬ
	|	ТаблицаАкций
	|ИЗ
	|	СрезПоДокументу КАК СрезПоДокументу
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	СкидкиСтроки КАК СкидкиСтроки
	|ПО
	|	СрезПоДокументу.Номенклатура = СкидкиСтроки.Номенклатура И 
	|	СрезПоДокументу.Регистратор = СкидкиСтроки.Регистратор
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаСрезПоследних
	|;
	|
	|УНИЧТОЖИТЬ
	|	СкидкиСтроки
	|;
	|
	|УНИЧТОЖИТЬ
	|	СрезПоДатеДокумента
	|;
	|
	|УНИЧТОЖИТЬ
	|	СрезПоДокументу
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаАкций.Номенклатура,
	|	МАКСИМУМ(ТаблицаЦен.Период) КАК Период
	|ПОМЕСТИТЬ
	|	ТаблицаЦенСрез
	|ИЗ
	|	ТаблицаАкций КАК ТаблицаАкций
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Цены КАК ТаблицаЦен
	|ПО
	|	ТаблицаЦен.ТипЦен = &ТипЦен И 
	|	ТаблицаЦен.ПодразделениеКомпании = &ПодразделениеКомпании И 
	|	ТаблицаЦен.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
	|	ТаблицаЦен.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И 
	|	ТаблицаЦен.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка) И 
	|	ТаблицаАкций.Номенклатура = ТаблицаЦен.Номенклатура И 
	|	ТаблицаАкций.АкцияНачалоДействия>ТаблицаЦен.Период И 
	|	(ТаблицаАкций.Номенклатура.ОсновнаяЕдиницаИзмерения = ТаблицаЦен.ЕдиницаИзмерения
	|	ИЛИ ТаблицаЦен.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаАкций.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЦенСрез.Номенклатура,
	|	МАКСИМУМ(ТаблицаЦен.Цена) КАК Цена
	|ПОМЕСТИТЬ
	|	ТаблицаЦен
	|ИЗ
	|	ТаблицаЦенСрез КАК ТаблицаЦенСрез
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Цены КАК ТаблицаЦен
	|ПО
	|	ТаблицаЦен.ТипЦен = &ТипЦен И 
	|	ТаблицаЦен.ПодразделениеКомпании = &ПодразделениеКомпании И 
	|	ТаблицаЦен.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
	|	ТаблицаЦен.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И 
	|	ТаблицаЦен.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка) И 
	|	ТаблицаЦенСрез.Номенклатура = ТаблицаЦен.Номенклатура И 
	|	ТаблицаЦенСрез.Период=ТаблицаЦен.Период И 
	|	(ТаблицаЦенСрез.Номенклатура.ОсновнаяЕдиницаИзмерения = ТаблицаЦен.ЕдиницаИзмерения
	|	ИЛИ ТаблицаЦен.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦенСрез.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаАкций.Номенклатура КАК Номенклатура,
	|	ТаблицаАкций.Регистратор КАК Регистратор,
	|	ТаблицаАкций.АкцияНачалоДействия КАК АкцияНачалоДействия,
	|	ТаблицаАкций.АкцияКонецДействия КАК АкцияКонецДействия,
	|	ТаблицаАкций.ЦенаАкции КАК ЦенаАкции,
	|	ЕСТЬNULL(ТаблицаЦен.Цена, 0) КАК ЦенаДоАкции
	|ИЗ
	|	ТаблицаАкций КАК ТаблицаАкций
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТаблицаЦен КАК ТаблицаЦен
	|ПО
	|	ТаблицаАкций.Номенклатура = ТаблицаЦен.Номенклатура
	|");
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Запрос.УстановитьПараметр("ДатаДанных",            ОбработкаОбъект.Дата);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ОбработкаОбъект.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ТипЦен",                ОбработкаОбъект.ПодразделениеКомпании.ТипЦенРеализации);
	Запрос.УстановитьПараметр("МассивНоменклатуры",    МассивНоменклатуры);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//&НаСервере
//Функция ПолучитьТаблицуУценок(МассивНоменклатуры)
//	Запрос = Новый Запрос("ВЫБРАТЬ
//	                      |	УценкаТовараСрезПоследних.Номенклатура КАК Номенклатура,
//	                      |	УценкаТовараСрезПоследних.ЗначениеСкидки КАК ЗначениеСкидки,
//	                      |	УценкаТовараСрезПоследних.СпособВычисления КАК СпособВычисления,
//	                      |	УценкаТовараСрезПоследних.ВариантОкругления КАК ВариантОкругления
//	                      |ИЗ
//	                      |	РегистрСведений.УценкаТовара.СрезПоследних(
//	                      |			&Дата,
//	                      |			ЗалОбслуживания = &ЗалОбслуживания
//	                      |				И СрокДействия = &ДатаДанных
//	                      |				И ПодразделениеКомпании = &ПодразделениеКомпании
//	                      |				И Номенклатура В (&МассивНоменклатуры)) КАК УценкаТовараСрезПоследних");
//	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
//	Запрос.УстановитьПараметр("ДатаДанных",ОбработкаОбъект.Дата);
//	Запрос.УстановитьПараметр("ПодразделениеКомпании",ОбработкаОбъект.ПодразделениеКомпании);
//	Запрос.УстановитьПараметр("ЗалОбслуживания",ОбработкаОбъект.Склад);
//	Запрос.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры);
//	
//	Возврат Запрос.Выполнить().Выгрузить();
//КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуТоваровНаСервере(ПроверятьЗаполнение = Истина, Сохранять = Истина, ДокументОснование=Неопределено, СтрочныеСкидки = Ложь, ТолькоОбновитьПараметрыНоменклатуры = Ложь, ОтключитьОтбор = Истина)
	
	Если ПроверятьЗаполнение И НЕ ЭтотОбъект.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
		
	// Сохранение выбранных позиций для их последующего восстановления.
	Если Сохранять Тогда
		ТаблицаВыбранныеПозиции = Объект.Товары.Выгрузить(,"Номенклатура, Характеристика, ЕдиницаИзмерения, ШаблонЦенника, КоличествоЦенников, ШаблонЭтикетки, КоличествоЭтикеток");
		Если ТолькоОбновитьПараметрыНоменклатуры Тогда
			Если ТаблицаВыбранныеПозиции.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;	
			Для каждого стрТаблицаВыбранныеПозиции из ТаблицаВыбранныеПозиции Цикл
				стрИсходныеДанныеТовары = Объект.ИсходныеДанныеТовары.Добавить();
				 ЗаполнитьЗначенияСвойств(стрИсходныеДанныеТовары,стрТаблицаВыбранныеПозиции);
			 КонецЦикла;	
			 
			 Если ОтключитьОтбор Тогда
				 Для каждого стрОтбораКомпановки из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
					 стрОтбораКомпановки.Использование = Ложь; 
				 КонецЦикла;	 
			 КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	// Поля необходимые для вывода в таблицу товаров на форме.
	СтруктураНастроек = Обработки.ПечатьЭтикетокИЦенников.СтруктураНастроек();
	
	УстановитьОбязательныеПоляДанных(СтруктураНастроек, Истина);
	
	УстановитьПараметрыДанных(СтруктураНастроек);
	
	СтруктураНастроек.КомпоновщикНастроек = КомпоновщикНастроек;
	
	Если Объект.ИсходныеДанныеТовары.Количество() > 0 ИЛИ ПечатьИзДокумента Тогда
		СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаТовары";
		СтруктураНастроек.ИсходныеДанные = Объект.ИсходныеДанныеТовары.Выгрузить();
	Иначе
		СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаБДТовары";
	КонецЕсли;
	
	Объект.Товары.Очистить();

	НомерСтроки = 0;
	
	// Загрузка сформированного списка товаров.
	СтруктураРезультата = Обработки.ПечатьЭтикетокИЦенников.ПодготовитьСтруктуруДанных(СтруктураНастроек, "Товары");
	
	
	ПроверятьЕдиничнуюУпаковку = Истина;
	Если СтруктураРезультата.Таблица.Колонки.Найти("ИспользоватьУпаковки") = Неопределено 
		Или СтруктураРезультата.Таблица.Колонки.Найти("НеОднаЕдиничнаяУпаковка") = Неопределено Тогда
		ПроверятьЕдиничнуюУпаковку = Ложь;		
	КонецЕсли;
	
	ИспользоватьХарактеристики = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	ИспользоватьЕдиницыИзмерения = ПолучитьФункциональнуюОпцию("ИспользоватьЕдиницыИзмерения");
	
	ЭтоНеУценка = НЕ ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.УценкаТовара");
	ЭтоДокументСкидки = (ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.НазначениеСкидокСтроки") ИЛИ СтрочныеСкидки);
	
	Если ЭтоДокументСкидки Тогда
		
		//СкидкаТовара = ДокументОснование;
		Объект.Склад = ПравоПользователя("ОсновнойСкладКомпании");
		
		МассивНоменклатуры = СтруктураРезультата.Таблица.ВыгрузитьКолонку("Номенклатура");
		ТаблицаАкций = ПолучитьТаблицуАкций(МассивНоменклатуры);
		
		Для Каждого СтрокаТЧ Из СтруктураРезультата.Таблица Цикл
			
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.Номенклатура         = СтрокаТЧ.Номенклатура;
			
			Если ИспользоватьХарактеристики Тогда
				НоваяСтрока.Характеристика       = СтрокаТЧ.Характеристика;
			КонецЕсли;
			Если ИспользоватьЕдиницыИзмерения Тогда
				НоваяСтрока.ЕдиницаИзмерения        = СтрокаТЧ.ЕдиницаИзмерения;
				Если ТипЗнч(СтрокаТЧ.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
					НоваяСтрока.Коэффициент	= 1;
				Иначе
					НоваяСтрока.Коэффициент	= СтрокаТЧ.ЕдиницаИзмерения.Коэффициент;
				КонецЕсли;
			КонецЕсли;
			
			НоваяСтрока.Штрихкод             = СтрокаТЧ.Штрихкод;
			// если штрихкод получился уценочный, то заменим его
			Если ШтрихкодированиеВызовСервера.ЭтоШтрихкодУценки(НоваяСтрока.Штрихкод,СтрокаТЧ.Номенклатура) Тогда
				НовыйШтрихкод = ШтрихкодированиеВызовСервера.ПолучитьШтрихкодУценки(СтрокаТЧ.Номенклатура,Ложь);
				Если ЗначениеЗаполнено(НовыйШтрихкод) Тогда
					НоваяСтрока.Штрихкод = НовыйШтрихкод;
				КонецЕсли;
			КонецЕсли;
			
			// вычислим параметры акции
			СтрокаАкции = ТаблицаАкций.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");
			Если СтрокаАкции=Неопределено Тогда
				НоваяСтрока.Цена = ЦенообразованиеСервер.ПолучитьЦену(Объект.ТипЦены, СтрокаТЧ.Номенклатура, , , , , , СтрокаТЧ.ЕдиницаИзмерения, Объект.ПодразделениеКомпании);
				НоваяСтрока.ДатаПоследнегоИзмененияЦены = СтрокаТЧ.ДатаПоследнегоИзмененияЦены;
				НоваяСтрока.ЦенаДоАкции			= НоваяСтрока.Цена;
				НоваяСтрока.АкцияНачалоДействия	= '00010101';
				НоваяСтрока.АкцияКонецДействия	= '00010101';
			Иначе
				НоваяСтрока.Цена                = СтрокаАкции.ЦенаАкции;
				НоваяСтрока.ДатаПоследнегоИзмененияЦены = СтрокаАкции.АкцияНачалоДействия;
				НоваяСтрока.ЦенаДоАкции			= СтрокаАкции.ЦенаДоАкции;
				НоваяСтрока.АкцияНачалоДействия	= СтрокаАкции.АкцияНачалоДействия;
				НоваяСтрока.АкцияКонецДействия	= СтрокаАкции.АкцияКонецДействия;
			КонецЕсли;
			
			ШаблонЭтикеткиТипаНоменклатуры    = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ТипНоменклатуры.ШаблонЭтикетки")];
			НоваяСтрока.ШаблонЭтикетки       = ШаблонЭтикеткиТипаНоменклатуры;
			
			НоваяСтрока.ОстатокНаСкладе      = СтрокаТЧ.ОстатокНаСкладе;
			НоваяСтрока.КоличествоВДокументе = СтрокаТЧ.Количество;
			НоваяСтрока.Весовой              = СтрокаТЧ.Весовой;
			
			УстановитьКоличествоПоУмолчаниюВСтрокеТЧНаСервере(НоваяСтрока);
			
			// Восстановление позиций, сохраненных перед заполнением ТЧ.
			Если Сохранять Тогда
				ПараметрыОтбора = Новый Структура();
				ПараметрыОтбора.Вставить("Номенклатура", НоваяСтрока.Номенклатура);
				Если ИспользоватьХарактеристики Тогда
					ПараметрыОтбора.Вставить("Характеристика", НоваяСтрока.Характеристика);
				КонецЕсли;
				Если ИспользоватьЕдиницыИзмерения Тогда
					ПараметрыОтбора.Вставить("ЕдиницаИзмерения", НоваяСтрока.ЕдиницаИзмерения);
				КонецЕсли;
				НайденныеСтроки = ТаблицаВыбранныеПозиции.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденныеСтроки[0]);
				КонецЕсли;
			КонецЕсли;
			
			НоваяСтрока.Выбран = Истина;
			Если НоваяСтрока.КоличествоЦенников=0 Тогда
				НоваяСтрока.КоличествоЦенников=1;
			КонецЕсли;
			НомерСтроки = НомерСтроки + 1;
			
			Если ПроверятьЕдиничнуюУпаковку Тогда
				Если СтрокаТЧ.ИспользоватьУпаковки
					И СтрокаТЧ.НеОднаЕдиничнаяУпаковка Тогда
					
					ТекстСообщения = НСтр("ru = 'У номенклатуры ""%Номенклатура%"" используется несколько упаковок с единицей измерения ""%ЕдиницаИзмерения%"" и коэффициентом 1. Для корректной привязки штрихкодов рекомендуется использовать одну единичную упаковку.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номенклатура%", Строка(СтрокаТЧ.Номенклатура));
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ЕдиницаИзмерения%", Строка(СтрокаТЧ.ЕдиницаИзмерения));
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
						СтрокаТЧ.Номенклатура,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Товары", НомерСтроки, "Номенклатура"),
						"Объект",
						Ложь);
					
				КонецЕсли;	
			КонецЕсли;	
			
		КонецЦикла;
		
		
		//Для Каждого СтрокаТЧ Из СкидкаТовара.Скидки Цикл
		//	
		//	НоваяСтрока = Объект.Товары.Добавить();
		//	НоваяСтрока.Номенклатура     = СтрокаТЧ.Номенклатура;
		//	НоваяСтрока.ЕдиницаИзмерения = СтрокаТЧ.Номенклатура.ОсновнаяЕдиницаИзмерения
		//	НоваяСтрока.Коэффициент	     = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
		//	НоваяСтрока.Цена             = СтрокаТЧ.ЗначениеСкидки;
		//	НоваяСтрока.ШаблонЭтикетки   = НоваяСтрока.Номенклатура.ТипНоменклатуры.ШаблонЭтикетки;
		//	
		//	СтрокаСКД = СтруктураРезультата.Таблица.Найти(НоваяСтрока.Номенклатура,"Номенклатура");
		//	Если СтрокаСКД<>Неопределено Тогда
		//		НоваяСтрока.ОстатокНаСкладе      = СтрокаСКД.ОстатокНаСкладе;
		//		НоваяСтрока.Штрихкод             = СтрокаСКД.Штрихкод;
		//	КонецЕсли;
		//	НоваяСтрока.КоличествоВДокументе = 1;
		//	НоваяСтрока.Весовой              = НоваяСтрока.Номенклатура.ТипНоменклатуры.Весовой;
		//	
		//	УстановитьКоличествоПоУмолчаниюВСтрокеТЧНаСервере(НоваяСтрока);
		//	
		//	// Восстановление позиций, сохраненных перед заполнением ТЧ.
		//	Если Сохранять Тогда
		//		ПараметрыОтбора = Новый Структура();
		//		ПараметрыОтбора.Вставить("Номенклатура", НоваяСтрока.Номенклатура);
		//		Если ИспользоватьХарактеристики Тогда
		//			ПараметрыОтбора.Вставить("Характеристика", НоваяСтрока.Характеристика);
		//		КонецЕсли;
		//		Если ИспользоватьЕдиницыИзмерения Тогда
		//			ПараметрыОтбора.Вставить("ЕдиницаИзмерения", НоваяСтрока.ЕдиницаИзмерения);
		//		КонецЕсли;
		//		НайденныеСтроки = ТаблицаВыбранныеПозиции.НайтиСтроки(ПараметрыОтбора);
		//		Если НайденныеСтроки.Количество() > 0 Тогда
		//			ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденныеСтроки[0]);
		//		КонецЕсли;
		//	КонецЕсли;
		//	
		//	НоваяСтрока.Выбран = Истина;
		//	Если НоваяСтрока.КоличествоЦенников=0 Тогда
		//		НоваяСтрока.КоличествоЦенников=1;
		//	КонецЕсли;
		//	НомерСтроки = НомерСтроки + 1;
		//	
		//КонецЦикла;
		
	ИначеЕсли ЭтоНеУценка Тогда
		// заполняем как раньше
		МассивНоменклатуры = СтруктураРезультата.Таблица.ВыгрузитьКолонку("Номенклатура");
		//ТаблицаАкций = ПолучитьТаблицуАкций(МассивНоменклатуры);
		
		Для Каждого СтрокаТЧ Из СтруктураРезультата.Таблица Цикл
			
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
			НоваяСтрока.Номенклатура         = СтрокаТЧ.Номенклатура;
			
			Если ИспользоватьХарактеристики Тогда
				НоваяСтрока.Характеристика       = СтрокаТЧ.Характеристика;
			КонецЕсли;
			Если ИспользоватьЕдиницыИзмерения Тогда
				НоваяСтрока.ЕдиницаИзмерения        = СтрокаТЧ.ЕдиницаИзмерения;
				Если ТипЗнч(СтрокаТЧ.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
					НоваяСтрока.Коэффициент	= 1;
				Иначе
					НоваяСтрока.Коэффициент	= СтрокаТЧ.ЕдиницаИзмерения.Коэффициент;
				КонецЕсли;
			КонецЕсли;
			
			//НоваяСтрока.Цена = ЦенообразованиеСервер.ПолучитьЦену(Объект.ТипЦены, СтрокаТЧ.Номенклатура, , , , , , СтрокаТЧ.ЕдиницаИзмерения, Объект.ПодразделениеКомпании);
            НоваяСтрока.Цена = СтрокаТЧ.Цена;
			
			НоваяСтрока.ДатаПоследнегоИзмененияЦены = СтрокаТЧ.ДатаПоследнегоИзмененияЦены;
			Если ЗначениеЗаполнено(Объект.ТипЦеныДополнительно) Тогда
				НоваяСтрока.ЦенаДополнительно                        = СтрокаТЧ.ЦенаДополнительно;
				НоваяСтрока.ДатаПоследнегоИзмененияЦеныДополнительно = СтрокаТЧ.ДатаПоследнегоИзмененияЦеныДополнительно;
			КонецЕсли;
			
			НоваяСтрока.Штрихкод             = СтрокаТЧ.Штрихкод;
			// если штрихкод получился уценочный, то заменим его
			Если ШтрихкодированиеВызовСервера.ЭтоШтрихкодУценки(НоваяСтрока.Штрихкод,СтрокаТЧ.Номенклатура) Тогда
				НовыйШтрихкод = ШтрихкодированиеВызовСервера.ПолучитьШтрихкодУценки(СтрокаТЧ.Номенклатура,Ложь);
				Если ЗначениеЗаполнено(НовыйШтрихкод) Тогда
					НоваяСтрока.Штрихкод = НовыйШтрихкод;
				КонецЕсли;
			КонецЕсли;
			
			// вычислим параметры акции
			//СтрокаАкции = ТаблицаАкций.Найти(СтрокаТЧ.Номенклатура,"Номенклатура");
			//Если СтрокаАкции=Неопределено Тогда
			//	НоваяСтрока.ЦенаДоАкции			= НоваяСтрока.Цена;
			//	НоваяСтрока.АкцияНачалоДействия	= '00010101';
			//	НоваяСтрока.АкцияКонецДействия	= '00010101';
			//Иначе
			//	НоваяСтрока.ЦенаДоАкции			= СтрокаАкции.ЦенаДоАкции;
			//	НоваяСтрока.АкцияНачалоДействия	= СтрокаАкции.АкцияНачалоДействия;
			//	НоваяСтрока.АкцияКонецДействия	= СтрокаАкции.АкцияКонецДействия;
			//КонецЕсли;
			
			НоваяСтрока.ЦенаДоАкции			= СтрокаТЧ.ЦенаДоАкции;
			НоваяСтрока.АкцияНачалоДействия	= СтрокаТЧ.АкцияНачалоДействия;
			НоваяСтрока.АкцияКонецДействия	= СтрокаТЧ.АкцияКонецДействия;
			
			
			ШаблонЦенникаТипаНоменклатуры    = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ТипНоменклатуры.ШаблонЦенника")];
			НоваяСтрока.ШаблонЦенника        = ШаблонЦенникаТипаНоменклатуры;
			
			ШаблонЭтикеткиТипаНоменклатуры    = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ТипНоменклатуры.ШаблонЭтикетки")];
			НоваяСтрока.ШаблонЭтикетки       = ШаблонЭтикеткиТипаНоменклатуры;
			
			НоваяСтрока.ОстатокНаСкладе      = СтрокаТЧ.ОстатокНаСкладе;
			НоваяСтрока.КоличествоВДокументе = СтрокаТЧ.Количество;
			НоваяСтрока.Весовой              = СтрокаТЧ.Весовой;
			Если ИспользоватьХарактеристики Тогда
				НоваяСтрока.ХарактеристикиИспользуются = СтрокаТЧ.ХарактеристикиИспользуются;
			КонецЕсли;
			
			УстановитьКоличествоПоУмолчаниюВСтрокеТЧНаСервере(НоваяСтрока);
			
			// Восстановление позиций, сохраненных перед заполнением ТЧ.
			Если Сохранять Тогда
				ПараметрыОтбора = Новый Структура();
				ПараметрыОтбора.Вставить("Номенклатура", НоваяСтрока.Номенклатура);
				Если ИспользоватьХарактеристики Тогда
					ПараметрыОтбора.Вставить("Характеристика", НоваяСтрока.Характеристика);
				КонецЕсли;
				Если ИспользоватьЕдиницыИзмерения Тогда
					ПараметрыОтбора.Вставить("ЕдиницаИзмерения", НоваяСтрока.ЕдиницаИзмерения);
				КонецЕсли;
				НайденныеСтроки = ТаблицаВыбранныеПозиции.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденныеСтроки[0]);
				КонецЕсли;
			КонецЕсли;
			
			НоваяСтрока.Выбран = Истина;
			Если НоваяСтрока.КоличествоЦенников=0 Тогда
				НоваяСтрока.КоличествоЦенников=1;
			КонецЕсли;
			НомерСтроки = НомерСтроки + 1;
			
			Если ПроверятьЕдиничнуюУпаковку Тогда
				Если СтрокаТЧ.ИспользоватьУпаковки
					И СтрокаТЧ.НеОднаЕдиничнаяУпаковка Тогда
					
					ТекстСообщения = НСтр("ru = 'У номенклатуры ""%Номенклатура%"" используется несколько упаковок с единицей измерения ""%ЕдиницаИзмерения%"" и коэффициентом 1. Для корректной привязки штрихкодов рекомендуется использовать одну единичную упаковку.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номенклатура%", Строка(СтрокаТЧ.Номенклатура));
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ЕдиницаИзмерения%", Строка(СтрокаТЧ.ЕдиницаИзмерения));
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
						СтрокаТЧ.Номенклатура,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Товары", НомерСтроки, "Номенклатура"),
						"Объект",
						Ложь);
					
				КонецЕсли;	
			КонецЕсли;	
			
		КонецЦикла;
	Иначе
		УценкаТовара = ДокументОснование;
		Объект.Склад = ПравоПользователя("ОсновнойСкладКомпании");
		Для Каждого СтрокаТЧ Из УценкаТовара.Скидки Цикл
			
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.Номенклатура         = СтрокаТЧ.Номенклатура;
			Если ИспользоватьЕдиницыИзмерения Тогда
				НоваяСтрока.ЕдиницаИзмерения        = СтрокаТЧ.ЕдиницаИзмерения;
				Если ТипЗнч(СтрокаТЧ.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
					НоваяСтрока.Коэффициент	= 1;
				Иначе
					НоваяСтрока.Коэффициент	= СтрокаТЧ.ЕдиницаИзмерения.Коэффициент;
				КонецЕсли;
			КонецЕсли;
			
			НоваяСтрока.ЦенаДоАкции = ЦенообразованиеСервер.ПолучитьЦену(Объект.ТипЦены, СтрокаТЧ.Номенклатура, , , , , , СтрокаТЧ.ЕдиницаИзмерения, Объект.ПодразделениеКомпании);
			Если СтрокаТЧ.СпособВычисления = Перечисления.СкидкиСпособВычисления.ФиксированнаяЦена Тогда
				НоваяСтрока.Цена = СтрокаТЧ.ЗначениеСкидки;
			ИначеЕсли СтрокаТЧ.СпособВычисления = Перечисления.СкидкиСпособВычисления.Относительная Тогда
				НоваяСтрока.Цена = НоваяСтрока.ЦенаДоАкции - НоваяСтрока.ЦенаДоАкции*СтрокаТЧ.ЗначениеСкидки/100;
				НоваяСтрока.Цена = Справочники.ВариантыОкругления.ОкруглитьЦену(СтрокаТЧ.ВариантОкругления,НоваяСтрока.Цена);
			КонецЕсли;

			НоваяСтрока.ДатаПоследнегоИзмененияЦены = УценкаТовара.Дата;
			НоваяСтрока.Штрихкод             = СтрокаТЧ.Штрихкод;
			
			НоваяСтрока.ШаблонЭтикетки       = НоваяСтрока.Номенклатура.ТипНоменклатуры.ШаблонЭтикетки;
			
			СтрокаСКД = СтруктураРезультата.Таблица.Найти(НоваяСтрока.Номенклатура,"Номенклатура");
			Если СтрокаСКД<>Неопределено Тогда
				НоваяСтрока.ОстатокНаСкладе      = СтрокаСКД.ОстатокНаСкладе;
			КонецЕсли;
			НоваяСтрока.КоличествоВДокументе = 1;
			НоваяСтрока.Весовой              = НоваяСтрока.Номенклатура.ТипНоменклатуры.Весовой;
			
			УстановитьКоличествоПоУмолчаниюВСтрокеТЧНаСервере(НоваяСтрока);
			
			// Восстановление позиций, сохраненных перед заполнением ТЧ.
			Если Сохранять Тогда
				ПараметрыОтбора = Новый Структура();
				ПараметрыОтбора.Вставить("Номенклатура", НоваяСтрока.Номенклатура);
				Если ИспользоватьХарактеристики Тогда
					ПараметрыОтбора.Вставить("Характеристика", НоваяСтрока.Характеристика);
				КонецЕсли;
				Если ИспользоватьЕдиницыИзмерения Тогда
					ПараметрыОтбора.Вставить("ЕдиницаИзмерения", НоваяСтрока.ЕдиницаИзмерения);
				КонецЕсли;
				НайденныеСтроки = ТаблицаВыбранныеПозиции.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденныеСтроки[0]);
				КонецЕсли;
			КонецЕсли;
			
			НоваяСтрока.Выбран = Истина;
			Если НоваяСтрока.КоличествоЦенников=0 Тогда
				НоваяСтрока.КоличествоЦенников=1;
			КонецЕсли;
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
	КонецЕсли;
	ЗащищенныеФункцииСервер.ЗаполнитьСлужебныеРеквизитыТабличнойЧасти(ЭтотОбъект.Объект.Товары);
	ОбновитьВидимостьЗависимыхОтШаблонаПолей();
	
	Элементы.Товары.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьПроверку()
	
	ЕстьОшибки = Ложь;
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		
		Если НЕ СтрокаТЧ.Выбран Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтроки = СтрокаТЧ.НомерСтроки - 1;
		
		Если Режим = "ПечатьЭтикетокИЦенников" Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.КоличествоЦенников) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не заполнено количество ценников в строке: %1'"),
					НомерСтроки+1);
				Сообщение.Поле = "Объект.Товары["+НомерСтроки+"].КоличествоЦенников";
				Сообщение.Сообщить();
				
				ЕстьОшибки = Истина;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШаблонЦенника) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не выбран шаблон ценника в строке: %1'"),
					НомерСтроки+1);
				Сообщение.Поле = "Объект.Товары["+НомерСтроки+"].ШаблонЦенника";
				Сообщение.Сообщить();
				
				ЕстьОшибки = Истина;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.КоличествоЭтикеток) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не заполнено количество этикеток в строке: %1'"),
					НомерСтроки+1);
				Сообщение.Поле = "Объект.Товары["+НомерСтроки+"].КоличествоЭтикеток";
				Сообщение.Сообщить();
				
				ЕстьОшибки = Истина;
				
			КонецЕсли;
				
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не выбран шаблон этикетки в строке: %1'"),
					НомерСтроки+1);
				Сообщение.Поле = "Объект.Товары["+НомерСтроки+"].ШаблонЭтикетки";
				Сообщение.Сообщить();
				
				ЕстьОшибки = Истина;
				
			КонецЕсли;
			
		ИначеЕсли Режим = "ПечатьЭтикеток" Тогда
			
			Если СтрокаТЧ.КоличествоЭтикеток = 0 Тогда
			
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не заполнено количество этикеток в строке: %1'"),
					НомерСтроки+1);
				Сообщение.Поле = "Объект.Товары["+НомерСтроки+"].КоличествоЭтикеток";
				Сообщение.Сообщить();
				
				ЕстьОшибки = Истина;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не выбран шаблон этикетки в строке: %1'"),
					НомерСтроки+1);
				Сообщение.Поле = "Объект.Товары["+НомерСтроки+"].ШаблонЭтикетки";
				Сообщение.Сообщить();
				
				ЕстьОшибки = Истина;
				
			КонецЕсли;
			
		ИначеЕсли Режим = "ПечатьЦенников" Тогда
			
			Если СтрокаТЧ.КоличествоЦенников = 0 Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не заполнено количество ценников в строке: %1'"),
					НомерСтроки+1);
				Сообщение.Поле = "Объект.Товары["+НомерСтроки+"].КоличествоЦенников";
				Сообщение.Сообщить();
				
				ЕстьОшибки = Истина;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШаблонЦенника) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не выбран шаблон ценника в строке: %1'"),
					НомерСтроки+1);
				Сообщение.Поле = "Объект.Товары["+НомерСтроки+"].ШаблонЦенника";
				Сообщение.Сообщить();
				
				ЕстьОшибки = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;

	СтруктураПоиска = Новый Структура("Выбран", Истина); 
	Возврат Новый Структура("ТоварыВыбраны, ПроверкаВыполнена", Объект.Товары.НайтиСтроки(СтруктураПоиска).Количество() > 0, Не ЕстьОшибки И ЭтотОбъект.ПроверитьЗаполнение());
	
КонецФункции

&НаСервере
Процедура УстановитьКоличествоПоУмолчаниюНаСервере()
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		
		УстановитьКоличествоПоУмолчаниюВСтрокеТЧНаСервере(СтрокаТЧ);		
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция УстановитьЭлементОтбораСКД(КомпоновщикНастроек, ИмяПараметра, ЗначениеПараметра, Использование = Истина)

	НайденныйЭлемент = Неопределено;
	
	Поле = Новый ПолеКомпоновкиДанных(ИмяПараметра);
	
	Отбор = КомпоновщикНастроек.Настройки.Отбор;
	Для каждого ЭлементОтбора Из Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Поле Тогда
			НайденныйЭлемент = ЭлементОтбора;
		КонецЕсли;
	КонецЦикла;
	
	Если НайденныйЭлемент = Неопределено Тогда
		НайденныйЭлемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("Массив") Тогда
		НайденныйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.ЗагрузитьЗначения(ЗначениеПараметра);
		ПравоеЗначение = СписокЗначений;
	Иначе
		НайденныйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ПравоеЗначение = ЗначениеПараметра;
	КонецЕсли;
	
	НайденныйЭлемент.Использование  = Использование;
	НайденныйЭлемент.ЛевоеЗначение  = Поле;
	НайденныйЭлемент.ПравоеЗначение = ПравоеЗначение;
	
	Возврат НайденныйЭлемент;

КонецФункции

&НаСервере
Процедура ЗагрузитьНастройкиОтбораПоУмолчанию()
	
	СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("ПоляШаблонаТовары");
	КомпоновщикНастроек.Инициализировать(
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтотОбъект.УникальныйИдентификатор)));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
КонецПроцедуры

&НаКлиенте
Функция ПоказатьОповещениеПользователюОВозможнойОшибке(Текст, Количество, КоличествоВсего)
	
	Если Количество < КоличествоВсего Тогда
		
		Текст = Текст
		        + ?(Текст <> "", Символы.ПС, "")
		        + НСтр("ru = 'Отметка выбора установлена для %КоличествоВыбранных% строк из %КоличествоВсего%.'");
	
		Текст = Текст
		        + Символы.ПС
		        + НСтр("ru = 'Проверьте: не заполнены либо количество, либо не задан шаблон ценника (этикетки). В этом случае отметка выбора для строк не может быть установлена.'");
	
		Текст = СтрЗаменить(Текст, "%КоличествоВыбранных%", Количество);
		Текст = СтрЗаменить(Текст, "%КоличествоВсего%", КоличествоВсего);
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Операция выполнена'"), ,Текст);
	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьСтроки()
	
	Количество = 0;
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		
		СтрокаТЧ.Выбран = Истина;
		
		Если СтрокаТЧ.Выбран Тогда
			Количество = Количество + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоВсего = Объект.Товары.Количество();
	
	ПоказатьОповещениеПользователюОВозможнойОшибке("", Количество, КоличествоВсего);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьСтроки()

	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ.Выбран = Ложь
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииНоменклатуры(ТекущиеДанные)
	
	// Поля необходимые для вывода в таблицу товаров на форме.
	СтруктураНастроек = Обработки.ПечатьЭтикетокИЦенников.СтруктураНастроек();
	
	УстановитьОбязательныеПоляДанных(СтруктураНастроек, Истина);
	
	УстановитьПараметрыДанных(СтруктураНастроек);
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Номенклатура",   Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Таблица.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Таблица.Колонки.Добавить("ЕдиницаИзмерения",Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	Таблица.Колонки.Добавить("Количество",     Новый ОписаниеТипов("Число"));
	НоваяСтрока = Таблица.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
	
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаТовары";
	СтруктураНастроек.ИсходныеДанные                 = Таблица;
	
	СтруктураРезультата = Обработки.ПечатьЭтикетокИЦенников.ПодготовитьСтруктуруДанных(СтруктураНастроек, "Товары");
	Данные = СтруктураРезультата.Таблица[0];
	
	//Цена = ЦенообразованиеСервер.ПолучитьЦену(Объект.ТипЦены, ТекущиеДанные.Номенклатура, , , , , , ТекущиеДанные.ЕдиницаИзмерения, Объект.ПодразделениеКомпании);
	Цена = Данные["Цена"];
	Попытка
		ЦенаКопейки = (Цена-Цел(Цена))*100;
	Исключение
		ЦенаКопейки = 0;
	КонецПопытки;
	ЦенаДоАкции			= Данные["ЦенаДоАкции"];
	АкцияНачалоДействия	= Данные["АкцияНачалоДействия"];
	АкцияКонецДействия	= Данные["АкцияКонецДействия"];
	
	// вычислим параметры акции
	МассивНоменклатуры = Новый Массив;
	МассивНоменклатуры.Добавить(ТекущиеДанные.Номенклатура);
	//ТаблицаАкций = ПолучитьТаблицуАкций(МассивНоменклатуры);
	//СтрокаАкции = ТаблицаАкций.Найти(ТекущиеДанные.Номенклатура,"Номенклатура");
	//Если СтрокаАкции=Неопределено Тогда
	//	ЦенаДоАкции			= Цена;
	//	АкцияНачалоДействия	= '00010101';
	//	АкцияКонецДействия	= '00010101';
	//Иначе
	//	ЦенаДоАкции			= СтрокаАкции.ЦенаДоАкции;
	//	АкцияНачалоДействия	= СтрокаАкции.АкцияНачалоДействия;
	//	АкцияКонецДействия	= СтрокаАкции.АкцияКонецДействия;
	//КонецЕсли;
	
	ВозвращаемоеЗначение = Новый Структура("Штрихкод, Весовой, ОстатокНаСкладе, Цена, ШаблонЭтикетки, ШаблонЦенника, ХарактеристикиИспользуются, ЦенаКопейки, ЦенаДоАкции, АкцияНачалоДействия, АкцияКонецДействия,ПроцентСкидки,ОписаниеАкции,НаименованиеАкции");
	ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение,Данные);
	
	// если штрихкод получился уценочный, то заменим его
	Если ШтрихкодированиеВызовСервера.ЭтоШтрихкодУценки(ВозвращаемоеЗначение.Штрихкод,ТекущиеДанные.Номенклатура) Тогда
		НовыйШтрихкод = ШтрихкодированиеВызовСервера.ПолучитьШтрихкодУценки(ТекущиеДанные.Номенклатура,Ложь);
		Если ЗначениеЗаполнено(НовыйШтрихкод) Тогда
			ВозвращаемоеЗначение.Штрихкод = НовыйШтрихкод;
		КонецЕсли;
	КонецЕсли;
	ВозвращаемоеЗначение.Цена            = Цена;
	ВозвращаемоеЗначение.ЦенаКопейки     = ЦенаКопейки;
	ВозвращаемоеЗначение.ЦенаДоАкции     = ЦенаДоАкции;
	ВозвращаемоеЗначение.АкцияНачалоДействия = АкцияНачалоДействия;
	ВозвращаемоеЗначение.АкцияКонецДействия  = АкцияКонецДействия;
	ВозвращаемоеЗначение.Весовой         = Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["Весовой"]];
	ВозвращаемоеЗначение.ОстатокНаСкладе = Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["ОстатокНаСкладе"]];
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		ВозвращаемоеЗначение.ХарактеристикиИспользуются = Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["ХарактеристикиИспользуются"]];
	Иначе
		ВозвращаемоеЗначение.ХарактеристикиИспользуются = Ложь;
	КонецЕсли;
	
	ШаблонЦенникаТипаНоменклатуры      = Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ТипНоменклатуры.ШаблонЦенника")];
	ВозвращаемоеЗначение.ШаблонЦенника = ШаблонЦенникаТипаНоменклатуры;
	
	ШаблонЭтикеткиТипаНоменклатуры       = Данные[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить("Номенклатура.ТипНоменклатуры.ШаблонЭтикетки")];
	ВозвращаемоеЗначение.ШаблонЭтикетки = ШаблонЭтикеткиТипаНоменклатуры;
	
	Если ТекущиеДанные.Свойство("СтараяЕдиницаИзмерения") Тогда
		КоличествоВДокументе = ТекущиеДанные.СтароеКоличествоВДокументе
		/ ?(ЗначениеЗаполнено(ТекущиеДанные.ЕдиницаИзмерения.Коэффициент), ТекущиеДанные.ЕдиницаИзмерения.Коэффициент, 1)
		* ?(ЗначениеЗаполнено(ТекущиеДанные.СтараяЕдиницаИзмерения.Коэффициент), ТекущиеДанные.СтараяЕдиницаИзмерения.Коэффициент, 1);
		ВозвращаемоеЗначение.Вставить("КоличествоВДокументе", КоличествоВДокументе);
		ВозвращаемоеЗначение.Вставить("Коэффициент", ?(ЗначениеЗаполнено(ТекущиеДанные.ЕдиницаИзмерения.Коэффициент), ТекущиеДанные.ЕдиницаИзмерения.Коэффициент, 1));
	КонецЕсли;
	
	ИспользованиеХарактеристик   = ТекущиеДанные.Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик;
	ИспользованиеЕдиницИзмерения = ТекущиеДанные.Номенклатура.ТипНоменклатуры.ИспользованиеЕдиницИзмерения;
	
	Если ТекущиеДанные.Свойство("ВладелецХарактеристики") Тогда
		Если ИспользованиеХарактеристик = 1 Тогда
			ВозвращаемоеЗначение.Вставить("ВладелецХарактеристики",ТекущиеДанные.Номенклатура.ТипНоменклатуры); 
		ИначеЕсли ИспользованиеХарактеристик = 2 Тогда
			ВозвращаемоеЗначение.Вставить("ВладелецХарактеристики",ТекущиеДанные.Номенклатура);
		Иначе
			ВозвращаемоеЗначение.Вставить("ВладелецХарактеристики",Неопределено);
		КонецЕсли;
	КонецЕсли;
		
	Если ТекущиеДанные.Свойство("ВладелецЕдиницыИзмерения") Тогда
		Если ИспользованиеЕдиницИзмерения = 1 Тогда
			ВозвращаемоеЗначение.Вставить("ВладелецЕдиницыИзмерения",ТекущиеДанные.Номенклатура.ТипНоменклатуры);
		ИначеЕсли ИспользованиеЕдиницИзмерения = 2 Тогда
			ВозвращаемоеЗначение.Вставить("ВладелецЕдиницыИзмерения",ТекущиеДанные.Номенклатура);
		Иначе
			ВозвращаемоеЗначение.Вставить("ВладелецЕдиницыИзмерения",Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьШтрихкодыНоменклатуры(Структура)
	
	МассивШтрихкодов = Новый Массив();
	ТабШтрихкодов = ШтрихкодированиеВызовСервера.ПолучитьШтрихКодОбъекта(Структура.Номенклатура, Структура.Характеристика,Структура.ЕдиницаИзмерения,Истина);
	МассивШтрихкодов = ТабШтрихкодов.ВыгрузитьКолонку("Штрихкод");	
	Возврат МассивШтрихкодов;
	
КонецФункции

&НаСервере
Процедура ДобавитьТовары(Таблица)
	
	// Поля необходимые для вывода в таблицу товаров на форме.
	СтруктураНастроек = Обработки.ПечатьЭтикетокИЦенников.СтруктураНастроек();
	
	УстановитьОбязательныеПоляДанных(СтруктураНастроек);
	
	УстановитьПараметрыДанных(СтруктураНастроек);
	
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаТовары";
	СтруктураНастроек.ИсходныеДанные = Таблица;
	
	СтруктураРезультата = Обработки.ПечатьЭтикетокИЦенников.ПодготовитьСтруктуруДанных(СтруктураНастроек, "Товары");
	Для Каждого СтрокаТЧ Из СтруктураРезультата.Таблица Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Штрихкод        = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["Штрихкод"]];
		НоваяСтрока.Цена            = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["Цена"]];
		НоваяСтрока.Весовой         = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["Весовой"]];
		НоваяСтрока.ОстатокНаСкладе = СтрокаТЧ[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы["ОстатокНаСкладе"]];
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	Таблица = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	ДобавитьТовары(Таблица);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьЗависимыхОтШаблонаПолей()
	
	Если ШаблоныВлияющиеНаВидимостьЭлементов = Неопределено Тогда
		ОбновитьШаблоныВлияющиеНаВидимостьЭлементов();
	КонецЕсли;
	
	Если Режим = "ПечатьЭтикеток" Или Режим = "ПечатьЭтикетокИЦенников" Тогда
		Шаблоны = Объект.Товары.Выгрузить(, "ШаблонЭтикетки").ВыгрузитьКолонку("ШаблонЭтикетки");
	Иначе
		Шаблоны = Новый Массив;
	КонецЕсли;
	Если Режим = "ПечатьЦенников" Или Режим = "ПечатьЭтикетокИЦенников" Тогда
		Ценники = Объект.Товары.Выгрузить(, "ШаблонЦенника").ВыгрузитьКолонку("ШаблонЦенника");
		Для Каждого Шаблон Из Ценники Цикл
			Если Шаблоны.Найти(Шаблон) = Неопределено Тогда
				Шаблоны.Добавить(Шаблон);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ИспользоватьТипЦеныДополнительно = Ложь;
	Для Каждого Шаблон Из Шаблоны Цикл
		Если ШаблоныВлияющиеНаВидимостьЭлементов.ТипЦеныДополнительно.Найти(Шаблон) <> Неопределено Тогда
			ИспользоватьТипЦеныДополнительно = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ТипЦеныДополнительно.Видимость     = ИспользоватьТипЦеныДополнительно;
	Элементы.ДатаТипЦеныДополнительно.Видимость = ИспользоватьТипЦеныДополнительно;
	Элементы.ТоварыЦенаДополнительно.Видимость  = ИспользоватьТипЦеныДополнительно;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьШаблоныВлияющиеНаВидимостьЭлементов()
	
	ШаблоныВлияющиеНаВидимостьЭлементов = Новый Структура;
	ШаблоныВлияющиеНаВидимостьЭлементов.Вставить("ТипЦеныДополнительно", Новый Массив);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШаблоныЭтикетокИЦенников.Ссылка,
	|	ШаблоныЭтикетокИЦенников.Шаблон
	|ИЗ
	|	Справочник.ШаблоныЭтикетокИЦенников КАК ШаблоныЭтикетокИЦенников
	|ГДЕ
	|	ШаблоныЭтикетокИЦенников.Назначение В(&Назначение)";
	Назначения = Новый Массив;
	Назначения.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров);
	Назначения.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров);
	Запрос.УстановитьПараметр("Назначение", Назначения);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Шаблон = Выборка.Шаблон;
		
		ПараметрыМакета = Шаблон.Получить();
		Для Каждого Параметр Из ПараметрыМакета.ПараметрыШаблона Цикл
			Если СтрНайти(Параметр.Ключ ,"ЦенаДополнительно") > 0 Тогда
				Если ШаблоныВлияющиеНаВидимостьЭлементов.ТипЦеныДополнительно.Найти(Выборка.Ссылка) = Неопределено Тогда
					ШаблоныВлияющиеНаВидимостьЭлементов.ТипЦеныДополнительно.Добавить(Выборка.Ссылка);
				КонецЕсли;
			КонецЕсли;
			Если СтрНайти(Параметр.Ключ, "ТипЦеныДополнительно") > 0 Тогда
				Если ШаблоныВлияющиеНаВидимостьЭлементов.ТипЦеныДополнительно.Найти(Выборка.Ссылка) = Неопределено Тогда
					ШаблоныВлияющиеНаВидимостьЭлементов.ТипЦеныДополнительно.Добавить(Выборка.Ссылка);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
			
	Если ДополнительныеПараметры = "КомандаВопросЗаполнениеТоваров" Тогда
		Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
			ЗаполнитьТаблицуТоваровНаСервере(Истина, Истина);
		ИначеЕсли РезультатОповещения = КодВозвратаДиалога.Нет Тогда
			ЗаполнитьТаблицуТоваровНаСервере(Истина, Ложь);
		КонецЕсли;
		Возврат;
		
	ИначеЕсли ДополнительныеПараметры = "КомандаВыбораСклада" Тогда
		Если ЗначениеЗаполнено(РезультатОповещения) Тогда
			Объект.Склад = РезультатОповещения;	
		КонецЕсли;
		УстановитьЭлементОтбораСКД(КомпоновщикНастроек, "Склад", Объект.Склад, ЗначениеЗаполнено(Объект.Склад));
		Возврат;
	
	ИначеЕсли ДополнительныеПараметры.Свойство("КомандаОповещения") И ДополнительныеПараметры.КомандаОповещения = "КомандаВыбораШаблонаЭтикеток" Тогда
		Если ЗначениеЗаполнено(РезультатОповещения) Тогда
			Для Каждого НомерСтроки Из ДополнительныеПараметры.МассивСтрок Цикл
				СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(НомерСтроки);
				СтрокаТЧ.ШаблонЭтикетки = РезультатОповещения;  
			КонецЦикла;
		КонецЕсли;
		Возврат;	
	
	ИначеЕсли ДополнительныеПараметры.Свойство("КомандаОповещения") И ДополнительныеПараметры.КомандаОповещения = "КомандаВыбораШаблонаЦенников" Тогда
		Если ЗначениеЗаполнено(РезультатОповещения) Тогда
			Для Каждого НомерСтроки Из ДополнительныеПараметры.МассивСтрок Цикл
				СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(НомерСтроки);
				СтрокаТЧ.ШаблонЦенника = РезультатОповещения;  
			КонецЦикла;
		КонецЕсли;
		Возврат;
		
	ИначеЕсли ДополнительныеПараметры.Свойство("КомандаОповещения") И ДополнительныеПараметры.КомандаОповещения = "КомандаВводаКоличестваЦенников" Тогда
		Если ЗначениеЗаполнено(РезультатОповещения) Тогда
			Для Каждого НомерСтроки Из ДополнительныеПараметры.МассивСтрок Цикл
				СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(НомерСтроки);
				СтрокаТЧ.КоличествоЦенников  = РезультатОповещения;
			КонецЦикла;
		КонецЕсли;
		Возврат;	
		
	ИначеЕсли ДополнительныеПараметры.Свойство("КомандаОповещения") И ДополнительныеПараметры.КомандаОповещения = "КомандаВводаКоличестваЭтикеток" Тогда
		Если ЗначениеЗаполнено(РезультатОповещения) Тогда
			Для Каждого НомерСтроки Из ДополнительныеПараметры.МассивСтрок Цикл
				СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(НомерСтроки);
				СтрокаТЧ.КоличествоЭтикеток  = РезультатОповещения;
			КонецЦикла;
		КонецЕсли;
		Возврат;	
		
	КонецЕсли;
		
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
		
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

&НаКлиенте
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Розничный", 		Истина);
	ПараметрыОтбора.Вставить("ПодразделениеКомпании",  Объект.ПодразделениеКомпании);

	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("РежимВыбора", 	Истина);
	ПараметрыПодбора.Вставить("Отбор", 	ПараметрыОтбора);
	ОповещениеЗаписи = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения",ЭтотОбъект,"КомандаВыбораСклада");
	ОткрытьФорму("Справочник.СкладыКомпании.ФормаВыбора",ПараметрыПодбора,ЭтотОбъект,,,,ОповещениеЗаписи);
КонецПроцедуры

&НаСервере
Процедура СкладОбработкаВыбораНаСервере()
	Объект.ТипЦены = ?(Объект.Склад.Розничный, Объект.Склад.ТипЦенРозничнойТорговли, Объект.ТипЦены);
КонецПроцедуры

&НаКлиенте
Процедура СкладОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СкладОбработкаВыбораНаСервере();
КонецПроцедуры

// тк + 
&НаСервере
Процедура ШаблонЦенникаПриИзмененииНаСервере()
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		ТекущаяСтрока.ШаблонЦенника = Объект.ШаблонЦенника;
	КонецЦикла;
	ОбновитьВидимостьЗависимыхОтШаблонаПолей();
	
КонецПроцедуры // ШаблонЦенникаПриИзмененииНаСервере()

&НаКлиенте
Процедура ШаблонЦенникаПриИзменении(Элемент)
	
	ШаблонЦенникаПриИзмененииНаСервере();
	
КонецПроцедуры // ШаблонЦенникаПриИзменении()

&НаСервере
Процедура ТипЦеныПриИзмененииНаСервере()
	ЗаполнитьТаблицуТоваровНаСервере(,,,,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТипЦеныПриИзменении(Элемент)
	ТипЦеныПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоИзмененнымЦенамНаСервере()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПодразделенияКомпании.Ссылка КАК ПодразделениеКомпании,
	                      |	ПодразделенияКомпании.ТипЦенРеализации КАК ТипЦен
	                      |ПОМЕСТИТЬ ПодразделенияКомпании
	                      |ИЗ
	                      |	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	                      |ГДЕ
	                      |	ПодразделенияКомпании.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ОсновноеПодразделение))
	                      |	И ПодразделенияКомпании.Ссылка = &ПодразделениеКомпании
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПодразделенияКомпании.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	ЕСТЬNULL(СкладыКомпании.Ссылка, ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)) КАК Магазин,
	                      |	ЕСТЬNULL(СкладыКомпании.ТипЦенРозничнойТорговли, ПодразделенияКомпании.ТипЦен) КАК ТипЦен
	                      |ПОМЕСТИТЬ ТаблицаМагазинов
	                      |ИЗ
	                      |	ПодразделенияКомпании КАК ПодразделенияКомпании
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СкладыКомпании КАК СкладыКомпании
	                      |		ПО ПодразделенияКомпании.ПодразделениеКомпании = СкладыКомпании.ПодразделениеКомпании
	                      |			И (СкладыКомпании.Розничный)
	                      |			И (СкладыКомпании.ПометкаУдаления = ЛОЖЬ)
	                      |			И (НЕ СкладыКомпании.ТипЦенРозничнойТорговли = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка))
	                      |ГДЕ
	                      |	НЕ ЕСТЬNULL(СкладыКомпании.ТипЦенРозничнойТорговли, ПодразделенияКомпании.ТипЦен) = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СкидкиСтроки.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	ВЫРАЗИТЬ(СкидкиСтроки.Объект КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	СкидкиСтроки.Период КАК НачалоДействия,
	                      |	СкидкиСтроки.СрокДействия КАК КонецДействия,
	                      |	СкидкиСтроки.ЗначениеСкидки КАК ЗначениеСкидки
	                      |ПОМЕСТИТЬ СкидкиСтроки
	                      |ИЗ
	                      |	РегистрСведений.СкидкиСтроки КАК СкидкиСтроки
	                      |ГДЕ
	                      |	СкидкиСтроки.ПодразделениеКомпании В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ОсновноеПодразделение))
	                      |	И СкидкиСтроки.СпособВычисления = ЗНАЧЕНИЕ(Перечисление.СкидкиСпособВычисления.ФиксированнаяЦена)
	                      |	И СкидкиСтроки.Действует
	                      |	И (СкидкиСтроки.Период <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
	                      |			ИЛИ СкидкиСтроки.Период = ДАТАВРЕМЯ(1, 1, 1))
	                      |	И (СкидкиСтроки.СрокДействия >= НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
	                      |			ИЛИ СкидкиСтроки.СрокДействия = ДАТАВРЕМЯ(1, 1, 1))
	                      |	И НЕ СкидкиСтроки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаШтрихкодТовара)
	                      |	И СкидкиСтроки.Объект ССЫЛКА Справочник.Номенклатура
	                      |	И СкидкиСтроки.ПодразделениеКомпании = &ПодразделениеКомпании
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СкидкиСтроки.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	ВЫРАЗИТЬ(СкидкиСтроки.Объект КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	СкидкиСтроки.Период КАК НачалоДействия,
	                      |	СкидкиСтроки.СрокДействия КАК КонецДействия,
	                      |	СкидкиСтроки.ЗначениеСкидки КАК ЗначениеСкидки
	                      |ПОМЕСТИТЬ СкидкиСтрокиДо
	                      |ИЗ
	                      |	РегистрСведений.СкидкиСтроки КАК СкидкиСтроки
	                      |ГДЕ
	                      |	СкидкиСтроки.ПодразделениеКомпании В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ОсновноеПодразделение))
	                      |	И СкидкиСтроки.СпособВычисления = ЗНАЧЕНИЕ(Перечисление.СкидкиСпособВычисления.ФиксированнаяЦена)
	                      |	И СкидкиСтроки.Действует
	                      |	И (СкидкиСтроки.Период <= КОНЕЦПЕРИОДА(&ПериодДо, ДЕНЬ)
	                      |			ИЛИ СкидкиСтроки.Период = ДАТАВРЕМЯ(1, 1, 1))
	                      |	И (СкидкиСтроки.СрокДействия >= НАЧАЛОПЕРИОДА(&ПериодДо, ДЕНЬ)
	                      |			ИЛИ СкидкиСтроки.СрокДействия = ДАТАВРЕМЯ(1, 1, 1))
	                      |	И НЕ СкидкиСтроки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаШтрихкодТовара)
	                      |	И СкидкиСтроки.Объект ССЫЛКА Справочник.Номенклатура
	                      |	И СкидкиСтроки.ПодразделениеКомпании = &ПодразделениеКомпании
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаСкидок.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	ТаблицаСкидок.Номенклатура КАК Номенклатура,
	                      |	МАКСИМУМ(ТаблицаСкидок.НачалоДействия) КАК НачалоДействия
	                      |ПОМЕСТИТЬ ТаблицаСкидокСрез
	                      |ИЗ
	                      |	СкидкиСтроки КАК ТаблицаСкидок
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТаблицаСкидок.ПодразделениеКомпании,
	                      |	ТаблицаСкидок.Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СкидкиСтрокиДо.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	СкидкиСтрокиДо.Номенклатура КАК Номенклатура,
	                      |	МАКСИМУМ(СкидкиСтрокиДо.НачалоДействия) КАК НачалоДействия
	                      |ПОМЕСТИТЬ ТаблицаСкидокСрезДо
	                      |ИЗ
	                      |	СкидкиСтрокиДо КАК СкидкиСтрокиДо
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	СкидкиСтрокиДо.ПодразделениеКомпании,
	                      |	СкидкиСтрокиДо.Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СтруктураИерархииПодразделений.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	СтруктураИерархииПодразделений.Группа КАК Группа,
	                      |	СтруктураИерархииПодразделений.Порядок КАК Приоритет
	                      |ПОМЕСТИТЬ ТаблицаИерархииПодразделений
	                      |ИЗ
	                      |	ПодразделенияКомпании КАК ПодразделенияКомпании
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураИерархииПодразделений КАК СтруктураИерархииПодразделений
	                      |		ПО ПодразделенияКомпании.ПодразделениеКомпании = СтруктураИерархииПодразделений.ПодразделениеКомпании
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ТаблицаМагазинов.ТипЦен КАК ТипЦен
	                      |ПОМЕСТИТЬ ТипыЦен
	                      |ИЗ
	                      |	ТаблицаМагазинов КАК ТаблицаМагазинов
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(ЦеныСрезПоследних.Период) КАК Период,
	                      |	ЦеныСрезПоследних.ТипЦен КАК ТипЦен,
	                      |	ЦеныСрезПоследних.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	                      |	ЦеныСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	                      |ПОМЕСТИТЬ ЦеныСрезПоследних
	                      |ИЗ
	                      |	РегистрСведений.Цены КАК ЦеныСрезПоследних
	                      |ГДЕ
	                      |	ЦеныСрезПоследних.Период <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
	                      |	И ЦеныСрезПоследних.ТипЦен В
	                      |			(ВЫБРАТЬ
	                      |				ТипыЦен.ТипЦен
	                      |			ИЗ
	                      |				ТипыЦен)
	                      |	И ЦеныСрезПоследних.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	                      |	И ЦеныСрезПоследних.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                      |	И ЦеныСрезПоследних.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	                      |	И ЦеныСрезПоследних.ПодразделениеКомпании = &ПодразделениеКомпании
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЦеныСрезПоследних.ТипЦен,
	                      |	ЦеныСрезПоследних.ПодразделениеКомпании,
	                      |	ЦеныСрезПоследних.Номенклатура,
	                      |	ЦеныСрезПоследних.ЕдиницаИзмерения
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(ЦеныСрезПоследних.Период) КАК Период,
	                      |	ЦеныСрезПоследних.ТипЦен КАК ТипЦен,
	                      |	ЦеныСрезПоследних.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	                      |	ЦеныСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	                      |ПОМЕСТИТЬ ЦеныСрезПоследнихДо
	                      |ИЗ
	                      |	РегистрСведений.Цены КАК ЦеныСрезПоследних
	                      |ГДЕ
	                      |	ЦеныСрезПоследних.Период <= КОНЕЦПЕРИОДА(&ПериодДо, ДЕНЬ)
	                      |	И ЦеныСрезПоследних.ТипЦен В
	                      |			(ВЫБРАТЬ
	                      |				ТипыЦен.ТипЦен
	                      |			ИЗ
	                      |				ТипыЦен)
	                      |	И ЦеныСрезПоследних.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	                      |	И ЦеныСрезПоследних.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                      |	И ЦеныСрезПоследних.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	                      |	И ЦеныСрезПоследних.ПодразделениеКомпании = &ПодразделениеКомпании
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЦеныСрезПоследних.ТипЦен,
	                      |	ЦеныСрезПоследних.ПодразделениеКомпании,
	                      |	ЦеныСрезПоследних.Номенклатура,
	                      |	ЦеныСрезПоследних.ЕдиницаИзмерения
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЦеныСрезПоследних.ТипЦен КАК ТипЦен,
	                      |	ЦеныСрезПоследних.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	                      |	ЦеныСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                      |	ТаблицаЦен.Цена КАК Цена
	                      |ПОМЕСТИТЬ БазоваяТаблицаЦен
	                      |ИЗ
	                      |	ЦеныСрезПоследних КАК ЦеныСрезПоследних
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Цены КАК ТаблицаЦен
	                      |		ПО (ТаблицаЦен.Период = ЦеныСрезПоследних.Период)
	                      |			И (ТаблицаЦен.ТипЦен = ЦеныСрезПоследних.ТипЦен)
	                      |			И (ТаблицаЦен.ПодразделениеКомпании = ЦеныСрезПоследних.ПодразделениеКомпании)
	                      |			И (ТаблицаЦен.Номенклатура = ЦеныСрезПоследних.Номенклатура)
	                      |			И (ТаблицаЦен.ЕдиницаИзмерения = ЦеныСрезПоследних.ЕдиницаИзмерения)
	                      |			И (ТаблицаЦен.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	                      |			И (ТаблицаЦен.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	                      |			И (ТаблицаЦен.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка))
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЦеныСрезПоследнихДо.ТипЦен КАК ТипЦен,
	                      |	ЦеныСрезПоследнихДо.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	ЦеныСрезПоследнихДо.Номенклатура КАК Номенклатура,
	                      |	ЦеныСрезПоследнихДо.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                      |	ТаблицаЦен.Цена КАК Цена
	                      |ПОМЕСТИТЬ БазоваяТаблицаЦенДо
	                      |ИЗ
	                      |	ЦеныСрезПоследнихДо КАК ЦеныСрезПоследнихДо
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Цены КАК ТаблицаЦен
	                      |		ПО (ТаблицаЦен.Период = ЦеныСрезПоследнихДо.Период)
	                      |			И (ТаблицаЦен.ТипЦен = ЦеныСрезПоследнихДо.ТипЦен)
	                      |			И (ТаблицаЦен.ПодразделениеКомпании = ЦеныСрезПоследнихДо.ПодразделениеКомпании)
	                      |			И (ТаблицаЦен.Номенклатура = ЦеныСрезПоследнихДо.Номенклатура)
	                      |			И (ТаблицаЦен.ЕдиницаИзмерения = ЦеныСрезПоследнихДо.ЕдиницаИзмерения)
	                      |			И (ТаблицаЦен.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	                      |			И (ТаблицаЦен.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	                      |			И (ТаблицаЦен.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка))
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаИерархииПодразделений.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	БазоваяТаблицаЦен.ТипЦен КАК ТипЦен,
	                      |	ТаблицаИерархииПодразделений.Приоритет КАК Приоритет,
	                      |	БазоваяТаблицаЦен.Номенклатура КАК Номенклатура,
	                      |	БазоваяТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                      |	БазоваяТаблицаЦен.Цена КАК Цена
	                      |ПОМЕСТИТЬ БазоваяТаблицаЦенПодразделений
	                      |ИЗ
	                      |	ТаблицаИерархииПодразделений КАК ТаблицаИерархииПодразделений
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазоваяТаблицаЦен КАК БазоваяТаблицаЦен
	                      |		ПО ТаблицаИерархииПодразделений.Группа = БазоваяТаблицаЦен.ПодразделениеКомпании
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаИерархииПодразделений.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	БазоваяТаблицаЦенДо.ТипЦен КАК ТипЦен,
	                      |	ТаблицаИерархииПодразделений.Приоритет КАК Приоритет,
	                      |	БазоваяТаблицаЦенДо.Номенклатура КАК Номенклатура,
	                      |	БазоваяТаблицаЦенДо.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                      |	БазоваяТаблицаЦенДо.Цена КАК Цена
	                      |ПОМЕСТИТЬ БазоваяТаблицаЦенПодразделенийДо
	                      |ИЗ
	                      |	ТаблицаИерархииПодразделений КАК ТаблицаИерархииПодразделений
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазоваяТаблицаЦенДо КАК БазоваяТаблицаЦенДо
	                      |		ПО ТаблицаИерархииПодразделений.Группа = БазоваяТаблицаЦенДо.ПодразделениеКомпании
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	БазоваяТаблицаЦенПодразделений.ТипЦен КАК ТипЦен,
	                      |	БазоваяТаблицаЦенПодразделений.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	БазоваяТаблицаЦенПодразделений.Номенклатура КАК Номенклатура,
	                      |	БазоваяТаблицаЦенПодразделений.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                      |	МИНИМУМ(БазоваяТаблицаЦенПодразделений.Приоритет) КАК Приоритет
	                      |ПОМЕСТИТЬ ТаблицаЦенПодразделенийСрез
	                      |ИЗ
	                      |	БазоваяТаблицаЦенПодразделений КАК БазоваяТаблицаЦенПодразделений
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	БазоваяТаблицаЦенПодразделений.ТипЦен,
	                      |	БазоваяТаблицаЦенПодразделений.ПодразделениеКомпании,
	                      |	БазоваяТаблицаЦенПодразделений.Номенклатура,
	                      |	БазоваяТаблицаЦенПодразделений.ЕдиницаИзмерения
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	БазоваяТаблицаЦенПодразделенийДо.ТипЦен КАК ТипЦен,
	                      |	БазоваяТаблицаЦенПодразделенийДо.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	БазоваяТаблицаЦенПодразделенийДо.Номенклатура КАК Номенклатура,
	                      |	БазоваяТаблицаЦенПодразделенийДо.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                      |	МИНИМУМ(БазоваяТаблицаЦенПодразделенийДо.Приоритет) КАК Приоритет
	                      |ПОМЕСТИТЬ ТаблицаЦенПодразделенийСрезДо
	                      |ИЗ
	                      |	БазоваяТаблицаЦенПодразделенийДо КАК БазоваяТаблицаЦенПодразделенийДо
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	БазоваяТаблицаЦенПодразделенийДо.ТипЦен,
	                      |	БазоваяТаблицаЦенПодразделенийДо.ПодразделениеКомпании,
	                      |	БазоваяТаблицаЦенПодразделенийДо.Номенклатура,
	                      |	БазоваяТаблицаЦенПодразделенийДо.ЕдиницаИзмерения
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВложенныйЗапрос.Магазин КАК Магазин,
	                      |	ВложенныйЗапрос.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	                      |	МАКСИМУМ(ВложенныйЗапрос.НачалоДействия) КАК НачалоДействия,
	                      |	МАКСИМУМ(ВложенныйЗапрос.КонецДействия) КАК КонецДействия,
	                      |	МАКСИМУМ(ВложенныйЗапрос.ЦенаРегулярная) КАК ЦенаРегулярная,
	                      |	МАКСИМУМ(ВложенныйЗапрос.ЦенаАкционная) КАК ЦенаАкционная,
	                      |	ВЫБОР
	                      |		КОГДА МАКСИМУМ(ВложенныйЗапрос.ЦенаАкционная) > 0
	                      |			ТОГДА МАКСИМУМ(ВложенныйЗапрос.ЦенаАкционная)
	                      |		ИНАЧЕ МАКСИМУМ(ВложенныйЗапрос.ЦенаРегулярная)
	                      |	КОНЕЦ КАК ЦенаТекущая
	                      |ПОМЕСТИТЬ втРезультат
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ТаблицаМагазинов.Магазин КАК Магазин,
	                      |		ТаблицаМагазинов.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |		ТаблицаЦенПодразделенийСрез.Номенклатура КАК Номенклатура,
	                      |		ДАТАВРЕМЯ(1, 1, 1) КАК НачалоДействия,
	                      |		ДАТАВРЕМЯ(1, 1, 1) КАК КонецДействия,
	                      |		МИНИМУМ(БазоваяТаблицаЦенПодразделений.Цена) КАК ЦенаРегулярная,
	                      |		0 КАК ЦенаАкционная
	                      |	ИЗ
	                      |		ТаблицаМагазинов КАК ТаблицаМагазинов
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаЦенПодразделенийСрез КАК ТаблицаЦенПодразделенийСрез
	                      |			ПО ТаблицаМагазинов.ПодразделениеКомпании = ТаблицаЦенПодразделенийСрез.ПодразделениеКомпании
	                      |				И ТаблицаМагазинов.ТипЦен = ТаблицаЦенПодразделенийСрез.ТипЦен
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазоваяТаблицаЦенПодразделений КАК БазоваяТаблицаЦенПодразделений
	                      |			ПО (ТаблицаЦенПодразделенийСрез.ТипЦен = БазоваяТаблицаЦенПодразделений.ТипЦен)
	                      |				И (ТаблицаЦенПодразделенийСрез.ПодразделениеКомпании = БазоваяТаблицаЦенПодразделений.ПодразделениеКомпании)
	                      |				И (ТаблицаЦенПодразделенийСрез.Номенклатура = БазоваяТаблицаЦенПодразделений.Номенклатура)
	                      |				И (ТаблицаЦенПодразделенийСрез.ЕдиницаИзмерения = БазоваяТаблицаЦенПодразделений.ЕдиницаИзмерения)
	                      |				И (ТаблицаЦенПодразделенийСрез.Приоритет = БазоваяТаблицаЦенПодразделений.Приоритет)
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ТаблицаМагазинов.Магазин,
	                      |		ТаблицаМагазинов.ПодразделениеКомпании,
	                      |		ТаблицаЦенПодразделенийСрез.Номенклатура
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		ТаблицаМагазинов.Магазин,
	                      |		ТаблицаМагазинов.ПодразделениеКомпании,
	                      |		ТаблицаСкидокСрез.Номенклатура,
	                      |		ТаблицаСкидокСрез.НачалоДействия,
	                      |		ТаблицаСкидок.КонецДействия,
	                      |		0,
	                      |		ТаблицаСкидок.ЗначениеСкидки
	                      |	ИЗ
	                      |		ТаблицаМагазинов КАК ТаблицаМагазинов
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСкидокСрез КАК ТаблицаСкидокСрез
	                      |			ПО ТаблицаМагазинов.ПодразделениеКомпании = ТаблицаСкидокСрез.ПодразделениеКомпании
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СкидкиСтроки КАК ТаблицаСкидок
	                      |			ПО (ТаблицаСкидок.ПодразделениеКомпании = ТаблицаСкидокСрез.ПодразделениеКомпании)
	                      |				И (ТаблицаСкидок.Номенклатура = ТаблицаСкидокСрез.Номенклатура)
	                      |				И (ТаблицаСкидок.НачалоДействия = ТаблицаСкидокСрез.НачалоДействия)) КАК ВложенныйЗапрос
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВложенныйЗапрос.Магазин,
	                      |	ВложенныйЗапрос.ПодразделениеКомпании,
	                      |	ВложенныйЗапрос.Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВложенныйЗапрос.Магазин КАК Магазин,
	                      |	ВложенныйЗапрос.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	                      |	МАКСИМУМ(ВложенныйЗапрос.НачалоДействия) КАК НачалоДействия,
	                      |	МАКСИМУМ(ВложенныйЗапрос.ЦенаАкционная) КАК КонецДействия,
	                      |	МАКСИМУМ(ВложенныйЗапрос.ЦенаРегулярная) КАК ЦенаРегулярная,
	                      |	ВЫБОР
	                      |		КОГДА МАКСИМУМ(ВложенныйЗапрос.ЦенаАкционная) > 0
	                      |			ТОГДА МАКСИМУМ(ВложенныйЗапрос.ЦенаАкционная)
	                      |		ИНАЧЕ МАКСИМУМ(ВложенныйЗапрос.ЦенаРегулярная)
	                      |	КОНЕЦ КАК ЦенаТекущая,
	                      |	СУММА(ВложенныйЗапрос.ЦенаАкционная) КАК ЦенаАкционная
	                      |ПОМЕСТИТЬ втРезультатДо
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ТаблицаМагазинов.Магазин КАК Магазин,
	                      |		ТаблицаМагазинов.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |		ТаблицаЦенПодразделенийСрезДо.Номенклатура КАК Номенклатура,
	                      |		ДАТАВРЕМЯ(1, 1, 1) КАК НачалоДействия,
	                      |		ДАТАВРЕМЯ(1, 1, 1) КАК КонецДействия,
	                      |		МИНИМУМ(БазоваяТаблицаЦенПодразделенийДо.Цена) КАК ЦенаРегулярная,
	                      |		0 КАК ЦенаАкционная
	                      |	ИЗ
	                      |		ТаблицаМагазинов КАК ТаблицаМагазинов
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаЦенПодразделенийСрезДо КАК ТаблицаЦенПодразделенийСрезДо
	                      |			ПО ТаблицаМагазинов.ПодразделениеКомпании = ТаблицаЦенПодразделенийСрезДо.ПодразделениеКомпании
	                      |				И ТаблицаМагазинов.ТипЦен = ТаблицаЦенПодразделенийСрезДо.ТипЦен
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ БазоваяТаблицаЦенПодразделенийДо КАК БазоваяТаблицаЦенПодразделенийДо
	                      |			ПО (ТаблицаЦенПодразделенийСрезДо.ТипЦен = БазоваяТаблицаЦенПодразделенийДо.ТипЦен)
	                      |				И (ТаблицаЦенПодразделенийСрезДо.ПодразделениеКомпании = БазоваяТаблицаЦенПодразделенийДо.ПодразделениеКомпании)
	                      |				И (ТаблицаЦенПодразделенийСрезДо.Номенклатура = БазоваяТаблицаЦенПодразделенийДо.Номенклатура)
	                      |				И (ТаблицаЦенПодразделенийСрезДо.ЕдиницаИзмерения = БазоваяТаблицаЦенПодразделенийДо.ЕдиницаИзмерения)
	                      |				И (ТаблицаЦенПодразделенийСрезДо.Приоритет = БазоваяТаблицаЦенПодразделенийДо.Приоритет)
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ТаблицаМагазинов.Магазин,
	                      |		ТаблицаМагазинов.ПодразделениеКомпании,
	                      |		ТаблицаЦенПодразделенийСрезДо.Номенклатура
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		ТаблицаМагазинов.Магазин,
	                      |		ТаблицаМагазинов.ПодразделениеКомпании,
	                      |		ТаблицаСкидокСрезДо.Номенклатура,
	                      |		ТаблицаСкидокСрезДо.НачалоДействия,
	                      |		СкидкиСтрокиДо.КонецДействия,
	                      |		0,
	                      |		СкидкиСтрокиДо.ЗначениеСкидки
	                      |	ИЗ
	                      |		ТаблицаМагазинов КАК ТаблицаМагазинов
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСкидокСрезДо КАК ТаблицаСкидокСрезДо
	                      |			ПО ТаблицаМагазинов.ПодразделениеКомпании = ТаблицаСкидокСрезДо.ПодразделениеКомпании
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СкидкиСтрокиДо КАК СкидкиСтрокиДо
	                      |			ПО (СкидкиСтрокиДо.ПодразделениеКомпании = ТаблицаСкидокСрезДо.ПодразделениеКомпании)
	                      |				И (СкидкиСтрокиДо.Номенклатура = ТаблицаСкидокСрезДо.Номенклатура)
	                      |				И (СкидкиСтрокиДо.НачалоДействия = ТаблицаСкидокСрезДо.НачалоДействия)) КАК ВложенныйЗапрос
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВложенныйЗапрос.Магазин,
	                      |	ВложенныйЗапрос.ПодразделениеКомпании,
	                      |	ВложенныйЗапрос.Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	втРезультат.Магазин КАК Магазин,
	                      |	втРезультат.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                      |	втРезультат.Номенклатура КАК Номенклатура,
	                      |	втРезультат.НачалоДействия КАК НачалоДействия,
	                      |	втРезультат.КонецДействия КАК КонецДействия,
	                      |	втРезультат.ЦенаАкционная КАК ЦенаАкционная,
	                      |	втРезультат.ЦенаРегулярная КАК ЦенаРегулярная,
	                      |	втРезультат.ЦенаТекущая КАК ЦенаТекущая,
	                      |	втРезультатДо.ЦенаТекущая КАК ЦенаТекущаяДо,
	                      |	втРезультат.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения
	                      |ИЗ
	                      |	втРезультат КАК втРезультат
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ втРезультатДо КАК втРезультатДо
	                      |		ПО втРезультат.ПодразделениеКомпании = втРезультатДо.ПодразделениеКомпании
	                      |			И втРезультат.Номенклатура = втРезультатДо.Номенклатура
	                      |ГДЕ
	                      |	НЕ втРезультат.ЦенаТекущая = ЕСТЬNULL(втРезультатДо.ЦенаТекущая, 0)");
	
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("ПериодДо", НачалоДня(НачалоДня(Объект.Дата) - 1));
	тбрезультат = Запрос.Выполнить().Выгрузить();
		
	Объект.Товары.Очистить();
	
	Для каждого стрРезульта из тбрезультат Цикл
		стрТовары = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(стрТовары,стрРезульта);
	КонецЦикла;	
	
	ЗаполнитьТаблицуТоваровНаСервере(,,,,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоИзмененнымЦенам(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ПодразделениеКомпании) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не выбрано подразделение: %1'");
		Сообщение.Поле = "Объект.ПодразделениеКомпании";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;	
	ЗаполнитьПоИзмененнымЦенамНаСервере();
	ЗаполнитьТаблицуТоваровНаСервере(,,,,Истина);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАктуальнымАссортиментомНаСервере()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура КАК Номенклатура,
	                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние КАК Состояние
	                      |ПОМЕСТИТЬ втАссортиментМаксимальныйПериод
	                      |ИЗ
	                      |	РегистрСведений.ОграничениеАссортиментаПодразделения.СрезПоследних(&Период, ) КАК ОграничениеАссортиментаПодразделенияСрезПоследних
	                      |ГДЕ
	                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании = &ПодразделениеКомпании
	                      |	И ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура,
	                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	втАссортиментМаксимальныйПериод.Состояние КАК Состояние,
	                      |	втАссортиментМаксимальныйПериод.Номенклатура КАК Номенклатура,
	                      |	втАссортиментМаксимальныйПериод.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения
	                      |ИЗ
	                      |	втАссортиментМаксимальныйПериод КАК втАссортиментМаксимальныйПериод
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	втАссортиментМаксимальныйПериод.Состояние,
	                      |	втАссортиментМаксимальныйПериод.Номенклатура");
	
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	тбрезультат = Запрос.Выполнить().Выгрузить();
		
	Объект.Товары.Очистить();
	
	Для каждого стрРезульта из тбрезультат Цикл
		стрТовары = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(стрТовары,стрРезульта);
	КонецЦикла;	
	
	ЗаполнитьТаблицуТоваровНаСервере(,,,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАктуальнымАссортиментом(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ПодразделениеКомпании) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не выбрано подразделение: %1'");
		Сообщение.Поле = "Объект.ПодразделениеКомпании";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;	
	
	ЗаполнитьАктуальнымАссортиментомНаСервере();
	
	ЗаполнитьТаблицуТоваровНаСервере(,,,,Истина);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАктуальнымАссортиментомСУчетомОтбораНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура КАК Номенклатура,
	                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние КАК Состояние
	                      |ПОМЕСТИТЬ втАссортиментМаксимальныйПериод
	                      |ИЗ
	                      |	РегистрСведений.ОграничениеАссортиментаПодразделения.СрезПоследних(&Период, ) КАК ОграничениеАссортиментаПодразделенияСрезПоследних
	                      |ГДЕ
	                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании = &ПодразделениеКомпании
	                      |	И ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура,
	                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	втАссортиментМаксимальныйПериод.Состояние КАК Состояние,
	                      |	втАссортиментМаксимальныйПериод.Номенклатура КАК Номенклатура,
	                      |	втАссортиментМаксимальныйПериод.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения
	                      |ИЗ
	                      |	втАссортиментМаксимальныйПериод КАК втАссортиментМаксимальныйПериод
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	втАссортиментМаксимальныйПериод.Состояние,
	                      |	втАссортиментМаксимальныйПериод.Номенклатура");
	
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	тбрезультат = Запрос.Выполнить().Выгрузить();
		
	Объект.Товары.Очистить();
	
	Для каждого стрРезульта из тбрезультат Цикл
		стрТовары = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(стрТовары,стрРезульта);
	КонецЦикла;	
	
	ЗаполнитьТаблицуТоваровНаСервере(,,,,Истина,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАктуальнымАссортиментомСУчетомОтбора(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ПодразделениеКомпании) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не выбрано подразделение: %1'");
		Сообщение.Поле = "Объект.ПодразделениеКомпании";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;		
	ЗаполнитьАктуальнымАссортиментомСУчетомОтбораНаСервере();
	
	ЗаполнитьТаблицуТоваровНаСервере(,,,,Ложь);
КонецПроцедуры

//Мальцев А.Ю.+++
&НаСервере
Процедура итЗаполнитьИзДанныхХранилища(АдресХранения) Экспорт
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.Товары.Очистить();
	
	тзЗагрузки = ПолучитьИзВременногоХранилища(АдресХранения);
	
	Для Каждого стрЗагр Из тзЗагрузки Цикл
		
		Товар =стрЗагр.Номенклатура;
				
		//ВывестиСообщение("" + Товар + " " + Цена);
		Стр = Об.Товары.Добавить();
		Стр.Номенклатура=Товар;
		
		ТекущиеДанные = Новый Структура("Номенклатура, Характеристика, ЕдиницаИзмерения, ВладелецХарактеристики, ВладелецЕдиницыИзмерения");
		Если НЕ ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
			Стр.ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения(Стр.Номенклатура);
			Стр.Коэффициент = ПолучитьКоэфЕдиницыИзмерения(Стр.ЕдиницаИзмерения);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, Стр);
		ЗаполнитьЗначенияСвойств(Стр, ПриИзмененииНоменклатуры(ТекущиеДанные));
		
		Стр.КоличествоЦенников = 1;
		Стр.ШаблонЦенника = Объект.ШаблонЦенника;
		//Стр.Выбран = Истина;

		Если ЗначениеЗаполнено(стрЗагр.Цена) Тогда
			Стр.Цена=стрЗагр.Цена;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Об, "Объект");
	
КонецПроцедуры


&НаСервере
Процедура итЗаполнитьИзБуфераНаСервере(Буфер,МассивСообщений) Экспорт
	
	Об = РеквизитФормыВЗначение("Объект");
		
	Разд = ":";
	           
	//ВывестиСообщение(Буфер);
	Буфер = СтрЗаменить(Буфер,Символы.Таб,Разд);
	Буфер = СтрЗаменить(Буфер,Символы.ВТаб,Разд);
	Буфер = СтрЗаменить(Буфер,"¶",Разд);
	//Буфер = СтрЗаменить(Буфер,",",Разд);
	Буфер = СтрЗаменить(Буфер,";",Разд);
	Буфер = СтрЗаменить(Буфер,"	",Разд);
	Буфер = СтрЗаменить(Буфер,"",Разд);
	Буфер = СтрЗаменить(Буфер,Разд+Разд,Разд);
	Буфер = СтрЗаменить(Буфер,Разд+Разд,Разд);
	
	//ВывестиСообщение(Буфер);
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(Буфер);
	
	Для ч = 1 по Текст.КоличествоСтрок() Цикл
		Значение = СокрЛП(Текст.ПолучитьСтроку(ч));
		//ВывестиСообщение(Значение);
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Арт = Лев(Значение,СтрНайти(Значение,Разд)-1);
		Цена = Сред(Значение,СтрНайти(Значение,Разд)+1);
		
		
		Если СтрДлина(Значение)>23 ИЛИ НЕ ЗначениеЗаполнено(Арт) ИЛИ НЕ ЗначениеЗаполнено(Цена) Тогда 
			МассивСообщений.Добавить("Пропущено значение ["+Значение+"]");
			Продолжить;
		КонецЕсли;	
		
		Значение = Арт;
		Товар = Справочники.Номенклатура.НайтиПоКоду(Значение);
		Если НЕ ЗначениеЗаполнено(Товар) Тогда
			Товар = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Значение);
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(Товар) Тогда
			Товар = Справочники.Номенклатура.НайтиПоРеквизиту("ЕРПМастерКлюч",Значение);
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(Товар) Тогда
			Если СтрДлина(Значение) = 8 ИЛИ СтрДлина(Значение) = 13 Тогда
				Запрос = Новый Запрос("ВЫБРАТЬ Штрихкоды.Объект КАК Объект ИЗ РегистрСведений.Штрихкоды КАК Штрихкоды ГДЕ	Штрихкоды.Штрихкод = &Штрихкод");
				Запрос.УстановитьПараметр("ШтрихКод",Значение);
				Рез = Запрос.Выполнить().Выбрать();
				Если Рез.Следующий() Тогда
					Если Рез.Количество()>1 Тогда
						МассивСообщений.Добавить("Найдено несколько товаров при поиске по штрихкоду по значению ["+Значение+"]");
					Иначе
						Товар = Рез.Объект;		
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
		
		Если НЕ ЗначениеЗаполнено(Товар) Тогда
			МассивСообщений.Добавить("Не удалось определить товар по значению ["+Значение+"]");
			Продолжить;
		КонецЕсли;
		Если Товар.ЭтоГруппа Тогда 
			Продолжить;
		КонецЕсли;
		
		Стр = Об.Товары.НайтиСтроки(Новый Структура("Номенклатура",Товар));
		Если НЕ Стр.Количество()=0 Тогда
			МассивСообщений.Добавить("Товар уже присутствует в таблице: ["+Значение+"] " + Товар.Наименование);
			Продолжить;
		КонецЕсли;
		//ВывестиСообщение("" + Товар + " " + Цена);
		Стр = Об.Товары.Добавить();
		Стр.Номенклатура=Товар;
		
		ТекущиеДанные = Новый Структура("Номенклатура, Характеристика, ЕдиницаИзмерения, ВладелецХарактеристики, ВладелецЕдиницыИзмерения");
		Если НЕ ЗначениеЗаполнено(Стр.ЕдиницаИзмерения) Тогда
			Стр.ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения(Стр.Номенклатура);
			Стр.Коэффициент = ПолучитьКоэфЕдиницыИзмерения(Стр.ЕдиницаИзмерения);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, Стр);
		ЗаполнитьЗначенияСвойств(Стр, ПриИзмененииНоменклатуры(ТекущиеДанные));
		
		Стр.КоличествоЦенников = 1;
		Стр.ШаблонЦенника = Объект.ШаблонЦенника;
		Стр.Выбран = Истина;

		
		//Стр.Цена=Цена;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Об, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура итЗаполнитьИзБуфера(Команда)
	
	Буфер = ПолучитьТекстИзБуфераОбмена();
	Если Буфер=Неопределено Тогда
		ВывестиСообщение("Не удалось получить буфер обмена");
		Закрыть();
		Возврат;
	КонецЕсли;
	
	Буфер=СокрЛП(Буфер);
	Если Буфер="" Тогда
		ВывестиСообщение("Буфер пуст");
		//Закрыть();
		Возврат;
	КонецЕсли;	
		
	МассивСообщений = Новый Массив;
	итЗаполнитьИзБуфераНаСервере(Буфер, МассивСообщений);
	
	Для каждого Сообщение1 из МассивСообщений Цикл
		ВывестиСообщение(""+ТекущаяДата()+" "+Сообщение1,ВладелецФормы.УникальныйИдентификатор);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекстИзБуфераОбмена() Экспорт
	#Если Клиент Тогда
     	ОбъектШ = Новый COMОбъект("htmlfile");
	 	Возврат ОбъектШ.ParentWindow.ClipboardData.Getdata("Text");
	#Иначе
		Возврат Неопределено;
	#КонецЕсли
КонецФункции

&НаКлиенте
Процедура изЗагрузитьИзФайла(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РучнаяНумерацияКолонокТабличногоДокумента", Ложь);
	ПараметрыФормы.Вставить("РежимЗагрузки",                             3);
	ПараметрыФормы.Вставить("ТабличнаяЧастьИсточника",                   "Товары");
	ПараметрыФормы.Вставить("СсылкаИсточника",                           ПредопределенноеЗначение("Документ.СогласованиеЗакупочныхЦен.ПустаяСсылка"));
	ПараметрыФормы.Вставить("Контрагент",                                Неопределено);
		
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТабличногоДокумента.Форма.ФормаПомощник", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
КонецПроцедуры

//Мальцев А.Ю.---

// тк - 
