
#Область ПрограммныйИнтерфейс

// Функция возвращает возможность работы модуля в асинхронном режиме.
// Стандартные команды модуля:
// - ПодключитьУстройство
// - ОтключитьУстройство
// - ВыполнитьКоманду
// Команды модуля для работы асинхронном режиме (должны быть определены):
// - НачатьПодключениеУстройства
// - НачатьОтключениеУстройства
// - НачатьВыполнениеКоманды.
//
Функция ПоддержкаАсинхронногоРежима() Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Функция осуществляет подключение устройства.
//
Функция ПодключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	НовыйСтандарт = Ложь;
	
	ВыходныеПараметры = Новый Массив();
	ПараметрыПодключения.Вставить("ИДУстройства", "");
	
	СтрокаПодключения = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СтрокаПодключения", "");
	
	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить(СтрокаПодключения);
	
	Попытка
		Ответ = ОбъектДрайвера.Подключить(МассивЗначений, ПараметрыПодключения.ИДУстройства);
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.Подключить>.'") + Символы.ПС + ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
	
	Если НЕ Ответ Тогда
		Результат = Ложь;
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет отключение устройства.
//
// Параметры:
//  ОбъектДрайвера - <*>
//         - ОбъектДрайвера драйвера торгового оборудования.
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Функция ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	
	ВыходныеПараметры = Новый Массив();
	
	ОбъектДрайвера.Отключить(ПараметрыПодключения.ИДУстройства);
	
	Возврат Результат;
	
КонецФункции

// Функция получает, обрабатывает и перенаправляет на исполнение команду к драйверу.
//
Функция ВыполнитьКоманду(Команда, ВходныеПараметры = Неопределено, ВыходныеПараметры = Неопределено,
                         ОбъектДрайвера, Параметры, ПараметрыПодключения) Экспорт
	
	Результат = Истина;
	
	ВыходныеПараметры = Новый Массив();
	
	// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩИЕ ДЛЯ ВСЕХ ТИПОВ ДРАЙВЕРОВ
	
	// Тестирование устройства
	Если Команда = "ТестУстройства" ИЛИ Команда = "CheckHealth" Тогда
		Результат = ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "ВыполнитьДополнительноеДействие" ИЛИ Команда = "DoAdditionalAction" Тогда
		ИмяДействия = ВходныеПараметры[0];
		Результат = ВыполнитьДополнительноеДействие(ОбъектДрайвера, Параметры, ПараметрыПодключения, ИмяДействия, ВыходныеПараметры);
		
	// Получение версии драйвера
	ИначеЕсли Команда = "ПолучитьВерсиюДрайвера" ИЛИ Команда = "GetVersion" Тогда
		Результат = ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	// Получение описание драйвера.
	ИначеЕсли Команда = "ПолучитьОписаниеДрайвера" ИЛИ Команда = "GetDescription" Тогда
		Результат = ПолучитьОписаниеДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩИЕ ДЛЯ РАБОТЫ С ТЕРМИНАЛАМИ СБОРА ДАННЫМИ
	
	ИначеЕсли Команда = "ВыгрузитьДанные" Тогда
		
		Если ПолучитьЗначениеПараметраСтруктуры(ВходныеПараметры, "ВыгружатьЗаказы", Ложь) Тогда
			
			Результат = ВыгрузитьЗаказы(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры, ВходныеПараметры);
			
		ИначеЕсли ПолучитьЗначениеПараметраСтруктуры(ВходныеПараметры, "ВыгружатьТовары", Ложь) Тогда
			ГруппаТоваров  = Параметры.ГруппаТоваровОборудования;
			ОсновнойОтдел  = Параметры.ОсновнойОтдел;
			ТаблицаТоваров = ПодключаемоеОборудованиеКлеверенсМагазин15ВызовСервера.ПолучитьТаблицуТовары(Параметры.Идентификатор, ГруппаТоваров, ОсновнойОтдел, ВходныеПараметры.ПолнаяВыгрузка);
			ВыгрузитьТовары(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаТоваров, ВходныеПараметры.ПолнаяВыгрузка, ВыходныеПараметры);
		КонецЕсли;
		
	// Выгрузка таблицы в терминал сбора данных.
	ИначеЕсли Команда =  "UploadDirectory" ИЛИ Команда = "ВыгрузитьТаблицу" Тогда
		ТаблицаВыгрузки = ВходныеПараметры[1];
		ПолнаяВыгрузка = ?(ВходныеПараметры.Количество() > 2, ВходныеПараметры[2], Истина);
		ТаблицаТоваров = ПодключаемоеОборудованиеКлеверенсМагазин15ВызовСервера.ПолучитьТаблицуВыгрузки(ТаблицаВыгрузки);
		ВыгрузитьТовары(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаТоваров, ПолнаяВыгрузка, ВыходныеПараметры);
		//#Если ВебКлиент Тогда
		//	Результат = ВыгрузитьТаблицуПакетно(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаВыгрузки, ПолнаяВыгрузка, ВыходныеПараметры);
		//#Иначе
		//	Результат = ВыгрузитьТаблицу(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаВыгрузки, ПолнаяВыгрузка, ВыходныеПараметры);
		//#КонецЕсли
	// Загрузка таблицы из терминала сбора данных.
	ИначеЕсли Команда = "DownloadDocument" ИЛИ Команда = "ЗагрузитьТаблицу" Тогда
		Результат = ЗагрузитьТаблицу(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	// Очищает загруженную ранее таблицу в терминале сбора данных.
	ИначеЕсли Команда = "ClearTable" ИЛИ Команда = "ОчиститьТаблицу" Тогда
		Результат = ОчиститьТаблицу(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Размер пакета в элементах передаваемой информации в драйвер.
//
Функция РазмерПакетаПоУмолчанию() Экспорт
	
	РазмерПакета = 200;
	Возврат РазмерПакета;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииОбщиеДляТерминаловСбораДанных

Функция ВыгрузитьТовары(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаВыгрузки, ПолнаяВыгрузка, ВыходныеПараметры)
	
	Результат = Истина;

	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Нет данных для выгрузки.'"));
		Возврат Ложь;
	КонецЕсли;
	
	РазмерПакета   = РазмерПакетаПоУмолчанию();
	ЗаписейВсего   = ТаблицаВыгрузки.Количество();
	ТекущийПроцент = 0;
	МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Инициализация выгрузки...'"), Окр(ТекущийПроцент));
	ПроцентИнкремент = 100 / (ЗаписейВсего / РазмерПакета);
	
	МассивТоваров = Новый Массив;
	
	мДанные = Новый Массив(27);
	//Основные поля товара и упаковки
	мДанные.Установить(0, "Product.Id");
	мДанные.Установить(1, "Product.Marking");
	мДанные.Установить(2, "Product.Barcode");
	мДанные.Установить(3, "Packing.Barcode");
	мДанные.Установить(4, "Product.Name");
	мДанные.Установить(5, "Product.BasePackingId");
	мДанные.Установить(6, "Packing.Id");
	мДанные.Установить(7, "Packing.Name");
	мДанные.Установить(8, "Packing.UnitsQuantity");
	//Дополнительные поля 
	мДанные.Установить(9, "Packing.descr");
	мДанные.Установить(10, "Packing.serial");
	мДанные.Установить(11, "Packing.price");
	мДанные.Установить(12, "Packing.qty");
	мДанные.Установить(13, "Product.withserial");
	мДанные.Установить(14, "Product.withsn");
	мДанные.Установить(15, "Product.КлючСерий");
	//Дополнительные поля для работы с алкоголем 
	мДанные.Установить(16, "Product.Алко");
	мДанные.Установить(17, "Packing.АлкоОбъем");
	мДанные.Установить(18, "Packing.АлкоКодВ");
	мДанные.Установить(19, "Packing.АлкоНаимВ");
	мДанные.Установить(20, "Product.АлкоКрепость");
	мДанные.Установить(21, "Product.Производитель");
	мДанные.Установить(22, "Product.ПроизвИНН");
	мДанные.Установить(23, "Product.ПроизвКПП");
	мДанные.Установить(24, "Packing.АлкоКод");
	мДанные.Установить(25, "Packing.АлкоМарк");
	мДанные.Установить(26, "Product.Весовой");
	
	ОбъектДрайвера.УстановитьПоискПоНаименованиюИАртикулу(Истина);
	Если (НЕ ОбъектДрайвера.НачатьВыгрузкуТоваров(мДанные)) Тогда
		ТекстОшики = "";
		ОбъектДрайвера.ПолучитьОшибку(ТекстОшики);
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ТекстОшики);
		ОбъектДрайвера.ОсвободитьРесурсы();
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТаблицаВыгрузки Цикл
		
		мДанные.Установить(0,  СтрокаТаблицы.ИдНоменклатуры);
		мДанные.Установить(1,  СтрокаТаблицы.Артикул);
		мДанные.Установить(2,  СтрокаТаблицы.Код);
		мДанные.Установить(3,  СтрокаТаблицы.Штрихкод);
		мДанные.Установить(4,  СтрокаТаблицы.Наименование);
		Если СтрокаТаблицы.Коэффициент = 1 Тогда
			мДанные.Установить(5, СтрокаТаблицы.ЕдиницаИзмерения);
		Иначе
			мДанные.Установить(5, "");
		КонецЕсли;
		мДанные.Установить(6,  СтрокаТаблицы.ЕдиницаИзмерения);
		мДанные.Установить(7,  СтрокаТаблицы.ЕдиницаИзмерения);
		мДанные.Установить(8,  СтрокаТаблицы.Коэффициент);
		мДанные.Установить(9,  СтрокаТаблицы.ХарактеристикаНоменклатуры);
		мДанные.Установить(10, СтрокаТаблицы.СерияНоменклатуры);
		мДанные.Установить(11, СтрокаТаблицы.Цена);
		мДанные.Установить(12, СтрокаТаблицы.Количество);
		мДанные.Установить(13, Ложь);
		мДанные.Установить(14, "");
		мДанные.Установить(15, "");
		
		//Алко поля 
		мДанные.Установить(16, СтрокаТаблицы.Алкоголь); 
		мДанные.Установить(17, СтрокаТаблицы.ЕмкостьТары);
		мДанные.Установить(18, СтрокаТаблицы.КодВидаАлкогольнойПродукции); 
		мДанные.Установить(19, СтрокаТаблицы.НаименованиеАлкогольнойПродукции); 
		мДанные.Установить(20, СтрокаТаблицы.Крепость);
		мДанные.Установить(21, СтрокаТаблицы.Производитель);
		мДанные.Установить(22, СтрокаТаблицы.ИННПроизводителя);
		мДанные.Установить(23, СтрокаТаблицы.КПППроизводителя);
		мДанные.Установить(24, СтрокаТаблицы.КодАлкогольнойПродукции);
		мДанные.Установить(25, СтрокаТаблицы.Маркируемый);
		мДанные.Установить(26, СтрокаТаблицы.ВидТовара);
		
		Если (НЕ ОбъектДрайвера.ДобавитьВВыгрузкуТоваров(мДанные)) Тогда
			ТекстОшики = "";
			ОбъектДрайвера.ПолучитьОшибку(ТекстОшики);
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(ТекстОшики);
			ОбъектДрайвера.СброситьВыгрузкуТоваров();
			ОбъектДрайвера.ОсвободитьРесурсы();
			Возврат Ложь;
		КонецЕсли;
		
		ТекущийПроцент = ТекущийПроцент + ПроцентИнкремент;
		МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Выгрузка данных...'"), Окр(ТекущийПроцент));
		
	КонецЦикла;
	
	Если (НЕ ОбъектДрайвера.ЗавершитьВыгрузкуТоваров()) Тогда
		ТекстОшики = "";
		ОбъектДрайвера.ПолучитьОшибку(ТекстОшики);
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ТекстОшики);
		ОбъектДрайвера.ОсвободитьРесурсы();
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектДрайвера.ОсвободитьРесурсы();
	
	//ОбъектДрайвера.BeginUploadProducts(Истина);
	//[ДобавитьВВыгрузкуТоваров].
	//КоллекцияКЗагрузки = Новый COMОбъект("Cleverence.Warehouse.ProductCollection");
	//Для Каждого СтрокаТаблицы Из ТаблицаВыгрузки  Цикл
	//	
	//	ИдНоменклатуры   = СтрокаТаблицы.ИдНоменклатуры;
	//	Наименование     = СтрокаТаблицы.Наименование;
	//	Артикул          = СтрокаТаблицы.Артикул;
	//	ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
	//	Коэффициент      = СтрокаТаблицы.Коэффициент;
	//	Штрихкод         = СтрокаТаблицы.Штрихкод;
	//	Характеристика   = СтрокаТаблицы.ХарактеристикаНоменклатуры;
	//	Остаток          = СтрокаТаблицы.Количество;
	//	Цена             = СтрокаТаблицы.Цена;
	//	
	//	Если ПустаяСтрока(ЕдиницаИзмерения) Тогда
	//		ЕдиницаИзмерения = "шт";
	//		Коэффициент      = 1;
	//	КонецЕсли;
	//	
	//	uploadProduct  = КоллекцияКЗагрузки.НайтиПоИд(ИдНоменклатуры);
	//	
	//	Если uploadProduct = Неопределено Тогда
	//		Если (КоллекцияКЗагрузки.Количество = РазмерПакета) Тогда
	//			ОбъектДрайвера.StorageConnector.ВыгрузитьПорциюНоменклатуры(КоллекцияКЗагрузки);
	//			КоллекцияКЗагрузки = Новый COMОбъект("Cleverence.Warehouse.ProductCollection");
	//		КонецЕсли;
	//		
	//		uploadProduct  = новый COMОбъект("Cleverence.Warehouse.Product");
	//		uploadProduct.Ид      = ИдНоменклатуры;
	//		uploadProduct.Имя     = Наименование;
	//		uploadProduct.Артикул = Артикул;
	//		uploadProduct.УстановитьПоле("Алко", СтрокаТаблицы.Алкоголь);
	//		uploadProduct.УстановитьПоле("АлкоОбъем", СтрокаТаблицы.ЕмкостьТары);
	//		uploadProduct.УстановитьПоле("АлкоКодВ", СтрокаТаблицы.КодВидаАлкогольнойПродукции);
	//		uploadProduct.УстановитьПоле("АлкоНаимВ", СтрокаТаблицы.НаименованиеАлкогольнойПродукции);
	//		uploadProduct.УстановитьПоле("АлкоКрепость", СтрокаТаблицы.Крепость);
	//		uploadProduct.УстановитьПоле("Производитель", СтрокаТаблицы.Производитель);
	//		uploadProduct.УстановитьПоле("ПроизвИНН", СтрокаТаблицы.ИННПроизводителя);
	//		uploadProduct.УстановитьПоле("ПроизвКПП", СтрокаТаблицы.КПППроизводителя);
	//		uploadProduct.УстановитьПоле("АлкоКод", СтрокаТаблицы.КодАлкогольнойПродукции);
	//		//Маркируемый
	//		//мДанные.Установить( 25, СтрокаТовара["АлкоМарк"]);
	//		
	//		КоллекцияКЗагрузки.Добавить(uploadProduct);
	//	КонецЕсли;
	//	
	//	uploadPacking = Неопределено;
	//	Для Инд=0 По uploadProduct.Упаковки.Количество-1 Цикл
	//		pack = uploadProduct.Упаковки.Элемент(Инд);
	//		Если pack.Name = ЕдиницаИзмерения И pack.ПолучитьПоле("Характеристика") = Характеристика И pack.ПолучитьПоле("Цена") = Цена Тогда
	//			uploadPacking = pack;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Если uploadPacking  = Неопределено  Тогда 
	//		//Такой упаковки нет, создаем  новую 
	//		uploadPacking  = новый COMОбъект("Cleverence.Warehouse.Packing");
	//		
	//		//Для упаковки  нужно использовать  уникальный идентификатор в пределах упаковок данного товара
	//		packId = ЕдиницаИзмерения; 
	//		Если uploadProduct.Упаковки.НайтиПоИд(ЕдиницаИзмерения) <> Неопределено Тогда
	//			//Генерируем  новый  Ид.  вида  [ЕдиницаИзмерения]_[номер]  (например,  "шт_1",  "шт_2"  и  т.д.) Сч = 0; 
	//			Сч = 0;
	//			Для Инд=0 По uploadProduct.Упаковки.Количество-1 Цикл
	//				pack = uploadProduct.Упаковки.Элемент(Инд); 
	//				Если СтрНачинаетсяС(pack.Ид, ЕдиницаИзмерения + "_") Тогда
	//					Сч = Сч + 1;
	//				КонецЕсли;
	//			КонецЦикла;
	//			
	//			packId = ЕдиницаИзмерения + "_" + (Сч  + 1);
	//		КонецЕсли;
	//		
	//		uploadPacking.Ид  = packId; 
	//		uploadPacking.Имя = ЕдиницаИзмерения; //Имя равно единице  измерения
	//		uploadPacking.КоличествоБазовыхЕдиниц = Коэффициент; //Коэффициент  пересчета в  базовые  единицы uploadPacking.Штрихкод = Штрихкод; 
	//		uploadPacking.Штрихкод                = Штрихкод;
	//		uploadPacking.УстановитьПоле("Характеристика",  Характеристика); //Устанавливаем доп. поля
	//		uploadPacking.УстановитьПоле("КоличествоНаСкладе", Остаток);
	//		uploadPacking.УстановитьПоле("Цена", Цена);
	//		
	//		Если Коэффициент = 1 И uploadProduct.ИдБазовойУпаковки = Неопределено Тогда 
	//			uploadProduct.ИдБазовойУпаковки = packId;
	//		КонецЕсли;
	//		
	//		uploadProduct.Упаковки.Добавить(uploadPacking); //Добавляем  упаковку  в коллекцию  упаковок //товара
	//	ИначеЕсли ЗначениеЗаполнено(Штрихкод) Тогда 
	//		uploadPacking.Штрихкод  = uploadPacking.Штрихкод + "|" +  Штрихкод;
	//	КонецЕсли;
	//	
	//	ТекущийПроцент = ТекущийПроцент + ПроцентИнкремент;
	//	МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Выгрузка данных...'"), Окр(ТекущийПроцент));
	//	
	//КонецЦикла;
	//
	//Если КоллекцияКЗагрузки.Количество > 0 Тогда 
	//	ОбъектДрайвера.StorageConnector.ВыгрузитьПорциюНоменклатуры(КоллекцияКЗагрузки);
	//КонецЕсли;
	//
	//ОбъектДрайвера.EndUploadProducts(); //Завершаем выгрузку товаров. 
	//ОбъектДрайвера.ОсвободитьРесурсы();
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет выгрузку данных в терминал сбора данных.
//
Функция ВыгрузитьЗаказы(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры, ВходныеПараметры)
	
	ТаблицаВыгрузки = ВходныеПараметры.Заказы;
	ПолнаяВыгрузка  = ВходныеПараметры.ПолнаяВыгрузка;
	ГруппаТоваров   = Параметры.ГруппаТоваровОборудования;
	
	Результат = Истина;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Нет данных для выгрузки.'"));
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаТоваров = ПодключаемоеОборудованиеКлеверенсМагазин15ВызовСервера.ПолучитьТаблицуТоварыЗаказов(ГруппаТоваров, ТаблицаВыгрузки);
	Если НЕ ВыгрузитьТовары(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаТоваров, ПолнаяВыгрузка, ВыходныеПараметры) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Выгрузка склада
	СкладМС = Новый COMОбъект("Cleverence.Warehouse.Warehouse");
	СкладМС.Id   = "1";
	СкладМС.Name = "Общий"; 
	ОбъектДрайвера.ВыгрузитьСклад(СкладМС);
	
	//Если НЕ ОбъектДрайвера.StorageConnector.ВыгрузитьСклад(СкладМС) Тогда
	//	ОбъектДрайвера.ПолучитьОшибку(мДрайверТСДОписаниеОшибки); 
	//	Сообщить("Ошибка при выгрузке документов: " + мДрайверТСДОписаниеОшибки, СтатусСообщения.Важное);
	//КонецЕсли;
	
	ЗаписейВсего   = 0;
	ТекущийПроцент = 0;
	
	ТаблицаЗаказов = ПодключаемоеОборудованиеКлеверенсМагазин15ВызовСервера.ПолучитьТаблицуЗаказов(ТаблицаВыгрузки, ЗаписейВсего);
	
	МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Инициализация выгрузки заказов...'"), Окр(ТекущийПроцент));
	ПроцентИнкремент = 100 / ЗаписейВсего;
	Для Каждого ТекущийДокумент Из ТаблицаЗаказов Цикл
		
		НовыйЗаказ = Новый COMОбъект("Cleverence.Warehouse.Document");
		НовыйЗаказ.Ид                    = ТекущийДокумент.Ид;
		НовыйЗаказ.Имя                   = ТекущийДокумент.Имя;
		НовыйЗаказ.ИмяТипаДокумента      = "Поступление";
		НовыйЗаказ.ИдСклада              = 1;
		НовыйЗаказ.Назначение            = ТекущийДокумент.Назначение;
		НовыйЗаказ.ВыдаватьАвтоматически = ТекущийДокумент.ВыдаватьАвтоматически;
		НовыйЗаказ.Штрихкод              = ТекущийДокумент.Штрихкод;
		НовыйЗаказ.ДатаСоздания          = ТекущийДокумент.ДатаСоздания;
		НовыйЗаказ.Описание              = ТекущийДокумент.Описание;
		
		Для Каждого ТекущаяСтрока Из ТекущийДокумент.Товары Цикл
			СтрокаДокументаТСД = Новый COMОбъект("Cleverence.Warehouse.DocumentItem");
			// Заполняем строку документа
			СтрокаДокументаТСД.ИдТовара       = ТекущаяСтрока.ИдТовара;
			СтрокаДокументаТСД.ИдУпаковки     = ТекущаяСтрока.ИдУпаковки;
			СтрокаДокументаТСД.КоличествоПлан = ТекущаяСтрока.Количество;
			// Дополнительные поля товара
			СтрокаДокументаТСД.УстановитьПоле("ШК",   ТекущаяСтрока.ШтрихКод);
			СтрокаДокументаТСД.УстановитьПоле("Цена", ТекущаяСтрока.Цена);
			//СтрокаДокументаТСД.УстановитьПоле(“Характеристика”,  Строка(строкаДок1C.Характеристика)); 
			НовыйЗаказ.СтрокиПлан.Добавить(СтрокаДокументаТСД);
			
			ТекущийПроцент = ТекущийПроцент + ПроцентИнкремент;
		
		КонецЦикла;
		
		МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Выгрузка заказов...'"), Окр(ТекущийПроцент));
		
		ОбъектДрайвера.ВыгрузитьДокумент(НовыйЗаказ);
		
	КонецЦикла;
	
	ОбъектДрайвера.ОсвободитьРесурсы();
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет выгрузку данных в терминал сбора данных.
//
Функция ВыгрузитьТаблицу(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаВыгрузки, ПолнаяВыгрузка, ВыходныеПараметры)

	Результат = Истина;

	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Нет данных для выгрузки.'"));
		Возврат Ложь;
	КонецЕсли;
	
	РазмерПакета     = РазмерПакетаПоУмолчанию();
	ТекущийПакет     = 1;
	ЗаписьВПакете    = 0;
	ЗаписейВыгружено = 0;
	ЗаписейВсего     = ТаблицаВыгрузки.Количество();
	СтатусПакета     = "first";
	
	ТекущийПроцент = 0;
	МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Инициализация выгрузки...'"), Окр(ТекущийПроцент));
	ПроцентИнкремент = 100 / (ЗаписейВсего / РазмерПакета);
	
	МассивТоваров = Новый Массив;
	
	Для Каждого Позиция Из ТаблицаВыгрузки  Цикл
		
		Если ЗаписьВПакете = 0 Тогда
			МассивТоваров.Очистить();
		КонецЕсли;
		
		МассивТоваров.Добавить(Позиция);
		
		ЗаписейВыгружено  = ЗаписейВыгружено + 1;
		ЗаписьВПакете = ЗаписьВПакете + 1;
		
		Если (ЗаписьВПакете = РазмерПакета) ИЛИ (ЗаписейВыгружено = ЗаписейВсего) Тогда  
			
			ДанныеДляВыгрузки = МенеджерОборудованияВызовСервера.СформироватьТаблицуТоваровТСД(МассивТоваров, ПолнаяВыгрузка);
			
			Если (ЗаписейВыгружено = ЗаписейВсего) Тогда
				СтатусПакета = "last";
			ИначеЕсли (ТекущийПакет > 1) Тогда
				СтатусПакета = "regular";
			КонецЕсли;
			
			Ответ = ОбъектДрайвера.ВыгрузитьТаблицу(ПараметрыПодключения.ИДУстройства, ДанныеДляВыгрузки, СтатусПакета);
			Если НЕ Ответ Тогда
				Результат = Ложь;
				ВыходныеПараметры.Очистить();
				ВыходныеПараметры.Добавить(999);
				ВыходныеПараметры.Добавить("");
				ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
				Возврат Результат;
			КонецЕсли;
			
			ЗаписьВПакете = 0;
			ТекущийПакет = ТекущийПакет + 1;
			
			ТекущийПроцент = ТекущийПроцент + ПроцентИнкремент;
			МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Выгрузка данных...'"), Окр(ТекущийПроцент));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// Функция осуществляет выгрузку данных в терминал сбора данных.
//
Функция ВыгрузитьТаблицуПакетно(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаВыгрузки, ПолнаяВыгрузка, ВыходныеПараметры)
	
	Результат = Истина;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Нет данных для выгрузки.'"));
		Возврат Ложь;
	КонецЕсли;
	
	МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Подготовка данных...'"));
	
	РазмерПакета     = РазмерПакетаПоУмолчанию();
	ПакетыДляВыгрузки = МенеджерОборудованияВызовСервера.ПодготовитьПакетыДляЗагрузкиТСД(ТаблицаВыгрузки, РазмерПакета, ПолнаяВыгрузка);
	
	СтатусПакета     = "first";
	
	КоличествоПакетов = ПакетыДляВыгрузки.Количество();
	ПроцентИнкремент = 100 / КоличествоПакетов;
	ТекущийПроцент  = 0;
	ТекущийПакет = 0;
	
	СтатусПакета = ?(КоличествоПакетов > 1 , "first", "last");
	
	Для Каждого ДанныеДляВыгрузки Из ПакетыДляВыгрузки  Цикл
		ДанныеДляВыгрузки = ПакетыДляВыгрузки[ТекущийПакет];
		
		Ответ = ОбъектДрайвера.ВыгрузитьТаблицу(ПараметрыПодключения.ИДУстройства, ДанныеДляВыгрузки, СтатусПакета);
		Если НЕ Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
			Возврат Результат;
		КонецЕсли;
		
		ТекущийПакет = ТекущийПакет + 1;
		СтатусПакета = ?(ТекущийПакет < КоличествоПакетов - 1 , "regular", "last");
		ТекущийПроцент = ТекущийПроцент + ПроцентИнкремент;
		МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Выгрузка данных...'"), Окр(ТекущийПроцент));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет загрузку таблицы из терминала сбора данных.
//
Функция ЗагрузитьТаблицу(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;
	АлкогольнаяПродукция = Ложь;
	
	ДанныеЗагрузки = "";
	МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Загрузка данных...'"));
	
	Попытка
		
		Ответ = ОбъектДрайвера.ЗагрузитьТаблицу(ПараметрыПодключения.ИДУстройства, ДанныеЗагрузки);
		Если НЕ Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
			Возврат Результат;
		КонецЕсли;      
		
		Если НЕ ПустаяСтрока(ДанныеЗагрузки) Тогда
			МассивДанных = МенеджерОборудованияВызовСервера.ТоварыТСД(ДанныеЗагрузки, АлкогольнаяПродукция);
		КонецЕсли;
	
		Если ПустаяСтрока(ДанныеЗагрузки) Или (МассивДанных.Количество() = 0) Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(НСтр("ru='Нет данных для загрузки.'"));
		Иначе
			ВыходныеПараметры.Добавить(МассивДанных);
			ВыходныеПараметры.Добавить(АлкогольнаяПродукция);
		КонецЕсли;   
		
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ЗагрузитьТаблицу>.'") + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Очищает загруженную ранее таблицу товаров в ТСД.
//
Функция ОчиститьТаблицу(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	
	МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Выполнение операции...'"));	
	
	Попытка
		Ответ = ОбъектДрайвера.ОчиститьТаблицу(ПараметрыПодключения.ИДУстройства);
		Если НЕ Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1])
		КонецЕсли;
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ОчиститьТаблицу>.'") + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииОбщиеДляВсехТиповДрайверов

// Функция осуществляет тестирование устройства.
//
Функция ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат            = Истина;
	РезультатТеста       = "";
	АктивированДемоРежим = "";
	
	СтрокаПодключения = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СтрокаПодключения", "");
	
	Попытка
		
		МассивЗначений  =  Новый  Массив; 
		МассивЗначений.Добавить(СтрокаПодключения);
		
		ТекстОписания = "";
		
		Ответ = ОбъектДрайвера.ТестУстройства(МассивЗначений, ТекстОписания);
	
		Если Ответ Тогда
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(0);
			ВыходныеПараметры.Добавить(ТекстОписания);
			ВыходныеПараметры.Добавить(АктивированДемоРежим);
		Иначе
			Результат = Ложь;
			ТекстОшибки = "";
			ОбъектДрайвера.ПолучитьОшибку(ТекстОшибки);
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(ТекстОшибки);
			ВыходныеПараметры.Добавить(АктивированДемоРежим);
		КонецЕсли;
		
	Исключение
		Результат = Ложь;
		ТекстОшибки = "";
		ОбъектДрайвера.ПолучитьОшибку(ТекстОшибки);
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ТестУстройства>.'") + Символы.ПС + ТекстОшибки);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет выполнение дополнительного действия для устройства.
//
Функция ВыполнитьДополнительноеДействие(ОбъектДрайвера, Параметры, ПараметрыПодключения, ИмяДействия, ВыходныеПараметры)
	
	Результат  = Истина;
	
	Для Каждого Параметр Из Параметры Цикл
		Если Лев(Параметр.Ключ, 2) = "P_" Тогда
			ЗначениеПараметра = Параметр.Значение;
			ИмяПараметра = Сред(Параметр.Ключ, 3);
			Ответ = ОбъектДрайвера.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра) 
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		Ответ = ОбъектДрайвера.ВыполнитьДополнительноеДействие(ИмяДействия);
		Если НЕ Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1])
		Иначе
			ВыходныеПараметры.Очистить();  
		КонецЕсли;
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ВыполнитьДополнительноеДействие>.'") + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает версию установленного драйвера.
//
Функция ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	
	ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
	ВыходныеПараметры.Добавить(НСтр("ru='Не определена'"));
	
	Попытка
		ВерсияДрайвера = ОбъектДрайвера.ПолучитьНомерВерсии();
	Исключение
		
		Попытка
			// Получаем описание драйвера.
			ОписаниеДрайвера = "";
			ОбъектДрайвера.ПолучитьОписание(ОписаниеДрайвера);
			ОписаниеДрайвераПараметры = МенеджерОборудованияВызовСервера.ПолучитьОписаниеДрайвера(ОписаниеДрайвера);
			ВерсияДрайвера = ОписаниеДрайвераПараметры.ВерсияДрайвера;
		Исключение
			Результат = Истина;
		КонецПопытки;
	КонецПопытки;
	
	ВыходныеПараметры[1] = ВерсияДрайвера;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает описание установленного драйвера.
//
Функция ПолучитьОписаниеДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	
	ВыходныеПараметры.Очистить();
	ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
	ВыходныеПараметры.Добавить(НСтр("ru='Не определена'"));
	
	ВыходныеПараметры.Добавить(НСтр("ru='Не определено'"));
	ВыходныеПараметры.Добавить(НСтр("ru='Не определено'"));
	ВыходныеПараметры.Добавить(НСтр("ru='Не определено'"));
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	
	ВерсияДрайвера            = "";
	НаименованиеДрайвера      = "Клеверенс: Терминалы сбора данных";
	ОписаниеДрайвера          = "Драйвер для подключения ТСД к системе «1С:Предприятие»";
	ТипОборудования           = "";
	ИнтеграционныйКомпонент   = Ложь;
	ОсновнойДрайверУстановлен = Ложь;
	РевизияИнтерфейса         = МенеджерОборудованияКлиентПовтИсп.РевизияИнтерфейсаДрайверов();
	URLЗагрузкиДрайвера       = "";
	ПараметрыДрайвера         = Новый Структура;
	ДополнительныеДействия    = "";
	
	СтруктураБаз = Новый СписокЗначений;
	Попытка
		// Получаем версию драйвера
		ВерсияДрайвера = ОбъектДрайвера.ПолучитьНомерВерсии();
		
		СписокБаз  = ОбъектДрайвера.StorageConnector.ПолучитьСписокБаз(""); 
		Для Инд=0 По СписокБаз.Количество - 1  Цикл //  Обходим  в цикле  полученный список 
			БазаСмартса  = СписокБаз.Item(Инд); //Получаем  элемент списка -  объект  AppInstance Ид  = БазаСмартса.Ид; //Идентификатор базы 
			СтруктураБаз.Добавить(БазаСмартса.СтрокаПодключения, БазаСмартса.Имя);
		КонецЦикла; 
		
	Исключение
		Результат = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка получения описания драйвера'") + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	ПараметрыДрайвера.Вставить("СписокБаз", СтруктураБаз);
	
	Если Результат Тогда
		ВыходныеПараметры[1] = ВерсияДрайвера;
		ВыходныеПараметры[2] = НаименованиеДрайвера;
		ВыходныеПараметры[3] = ОписаниеДрайвера;
		ВыходныеПараметры[4] = ТипОборудования;
		ВыходныеПараметры[5] = РевизияИнтерфейса;
		ВыходныеПараметры[6] = ИнтеграционныйКомпонент;
		ВыходныеПараметры[7] = ОсновнойДрайверУстановлен;
		ВыходныеПараметры[8] = URLЗагрузкиДрайвера;
		
		// Получаем описание драйвера
		//ОбъектДрайвера.ПолучитьПараметры(ПараметрыДрайвера);
		ВыходныеПараметры[9] = ПараметрыДрайвера;
		// Получаем дополнительные действия.
		//ОбъектДрайвера.ПолучитьДополнительныеДействия(ДополнительныеДействия);
		ВыходныеПараметры[10] = ДополнительныеДействия;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти
