
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыЗаполнения = Новый Структура("Основание, ХозОперация", ПараметрКоманды,ПредопределенноеЗначение("Справочник.ХозОперации.АктОтвязкиМарокЕГАИС"));
	ПараметрыФормы = Новый Структура("Основание", ПараметрыЗаполнения);
	ОткрытьФорму("Документ.АктПривязкиМарокЕГАИС.Форма.ФормаДокумента", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
