
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды)=Тип("СправочникСсылка.Контрагенты") Тогда
		ПараметрыОтбора = Новый Структура("Контрагент", ПараметрКоманды);
	Иначе
		ПараметрыОтбора = Новый Структура("Регистратор", ПараметрКоманды);
	КонецЕсли;
	ОткрытьФорму("РегистрНакопления.НакопленияПоКарточкамКонтрагентов.ФормаСписка", Новый Структура("Отбор", ПараметрыОтбора), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,, ПараметрыВыполненияКоманды.НавигационнаяСсылка,, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры
