
////////////////////////////////////////////////////////////////////////////////
// Подсистема "ЕГАИС".
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыОбменов() Экспорт
	
	МакетПараметров = Обработки.МодульОбменаВЕТИС.ПолучитьМакет("ПараметрыОбъектов");
	
	#Область ФабрикаXDTO
	
	МассивМакетов = Новый Массив;
	МассивМакетов.Добавить("Applications");
	МассивМакетов.Добавить("Argus_common");
	МассивМакетов.Добавить("Argus_shipment");
	МассивМакетов.Добавить("Enterprise");
	МассивМакетов.Добавить("Ikar");
	МассивМакетов.Добавить("Production");
	МассивМакетов.Добавить("Veterinary_document");
	МассивМакетов.Добавить("Envelope");
	МассивМакетов.Добавить("BaseDefinitions");
	МассивМакетов.Добавить("ApplicationDefinitions");
	// API 2
	МассивМакетов.Добавить("Application_v2");
	МассивМакетов.Добавить("Mercury_Application_g2b_v2");
	МассивМакетов.Добавить("Mercury_Application_vu_v2");
	МассивМакетов.Добавить("Base_v2");
	МассивМакетов.Добавить("Registry_ws_definitions_v2");
	МассивМакетов.Добавить("Dictionary_v2");
	МассивМакетов.Добавить("Document_v2");
	МассивМакетов.Добавить("Дополнение");
	
	МассивСхем = Новый НаборСхемXML;
	Для Каждого ТекущийМакет Из МассивМакетов Цикл
		
		МакетСхемы = Обработки.МодульОбменаВЕТИС.ПолучитьМакет(ТекущийМакет);
		ТекстСхемы = МакетСхемы.ПолучитьТекст();
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ТекстСхемы);
		
		ПостроительDOM = Новый ПостроительDOM;
		ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
		
		ПостроительСхемыXML = Новый ПостроительСхемXML;
		СхемаXML = ПостроительСхемыXML.СоздатьСхемуXML(ДокументDOM);
		МассивСхем.Добавить(СхемаXML);
		
		ЧтениеXML.Закрыть();
		
	КонецЦикла;
	
	ВнутренняяФабрикаXDTO = Новый ФабрикаXDTO(МассивСхем);
	
	#КонецОбласти
	
	#Область ПараметрыОбъектов
	ПараметрыОбъектов = Новый Соответствие;
	
	ВидыОбъектов = МакетПараметров.ПолучитьОбласть("ВидыОпераций");
	Для НомерСтроки=1 По ВидыОбъектов.ВысотаТаблицы Цикл
		
		ИмяПеречисления         = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 1).Текст);
		//ИмяОтвета               = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 2).Текст);
		ИмяОбъекта              = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 2).Текст);
		ИмяТипа                 = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 3).Текст);
		ИмяОтвета               = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 4).Текст);
		//ПространствоИмен        = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 5).Текст);
		//ПрефиксПространстваИмен = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 6).Текст);
		//ПутьНаСервере           = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 7).Текст);
		Описание                = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 5).Текст);
		ПространствоИмен        = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 6).Текст);
		
		Элемент       = Перечисления.ВидыОперацийВЕТИС[ИмяПеречисления];
		Если ПустаяСтрока(ИмяОтвета) Тогда
			ЭлементОтвета = Перечисления.ВидыОперацийВЕТИС.ПустаяСсылка();
		Иначе
			ЭлементОтвета = Перечисления.ВидыОперацийВЕТИС[ИмяОтвета];
		КонецЕсли;
		
		СтруктураОбъекта = Новый Структура;
		СтруктураОбъекта.Вставить("ВидОперации",   Элемент);
		СтруктураОбъекта.Вставить("ОтветНаЗапрос", ЭлементОтвета);
		СтруктураОбъекта.Вставить("ИмяОбъекта",    ИмяОбъекта);
		СтруктураОбъекта.Вставить("ИмяТипа",       ИмяТипа);
		СтруктураОбъекта.Вставить("Описание",      Описание);
		СтруктураОбъекта.Вставить("ПространствоИмен", ПространствоИмен);
		
		ПараметрыОбъектов.Вставить(Элемент, СтруктураОбъекта);
		
	КонецЦикла;
	#КонецОбласти
	
	#Область ПространстваИмен
	
	СоответствиеПространстваИмен = Новый Соответствие;
	СоответствиеПространстваИмен.Вставить("http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2",  "ws");
	СоответствиеПространстваИмен.Вставить("http://api.vetrf.ru/schema/cdm/base",         "bs");
	СоответствиеПространстваИмен.Вставить("http://api.vetrf.ru/schema/cdm/dictionary/v2",   "dt");
	СоответствиеПространстваИмен.Вставить("http://api.vetrf.ru/schema/cdm/application/ws-definitions",       "apldef");
	СоответствиеПространстваИмен.Вставить("http://api.vetrf.ru/schema/cdm/application",  "apl");
	СоответствиеПространстваИмен.Вставить("http://api.vetrf.ru/schema/cdm/mercury/g2b/applications/v2", "merc");
	СоответствиеПространстваИмен.Вставить("http://api.vetrf.ru/schema/cdm/mercury/vet-document/v2",  "vd");
	
	//ВидыОбъектов = МакетПараметров.ПолучитьОбласть("ПространстваИмен");
	//Объект = Неопределено;
	//Для НомерСтроки=1 По ВидыОбъектов.ВысотаТаблицы Цикл
	//	
	//	ПространствоИмен = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 1).Текст);
	//	Префикс          = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 2).Текст);
	//	
	//	СоответствиеПространстваИмен.Вставить(ПространствоИмен, Префикс);
	//	
	//КонецЦикла;
	
	#КонецОбласти
	
	#Область ПараметрыВходящихОбъектов
	
	ПараметрыВходящихОбъектов = Новый Соответствие;
	
	//ВидыОбъектов = МакетПараметров.ПолучитьОбласть("ПараметрыВходящихОбъектов");
	//Для НомерСтроки=1 По ВидыОбъектов.ВысотаТаблицы Цикл
	//	
	//	ИмяОбъекта       = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 1).Текст);
	//	ИмяЗапроса       = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 2).Текст);
	//	ФорматОбмена     = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 3).Текст);
	//	ПространствоИмен = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 4).Текст);
	//	Описание         = СокрЛП(ВидыОбъектов.Область(НомерСтроки, 5).Текст);
	//	
	//	ВидСообщения     = Перечисления.ВидыОперацийВЕТИС[ИмяЗапроса];
	//	
	//	СтруктураОбъекта = Новый Структура;
	//	СтруктураОбъекта.Вставить("ИмяОбъекта",       ИмяОбъекта);
	//	СтруктураОбъекта.Вставить("ВидСообщения",     ВидСообщения);
	//	Если ПустаяСтрока(ФорматОбмена) Тогда
	//		СтруктураОбъекта.Вставить("ФорматОбмена", 3);
	//	Иначе
	//		СтруктураОбъекта.Вставить("ФорматОбмена", Число(ФорматОбмена));
	//	КонецЕсли;
	//	СтруктураОбъекта.Вставить("ПространствоИмен", ПространствоИмен);
	//	СтруктураОбъекта.Вставить("Описание",         Описание);
	//	
	//	ПараметрыВходящихОбъектов.Вставить(ИмяОбъекта, СтруктураОбъекта);
	//	
	//КонецЦикла;
	#КонецОбласти
	
	ПараметрыОбменов = Новый Структура();
	ПараметрыОбменов.Вставить("ФабрикаXDTO",               ВнутренняяФабрикаXDTO);
	ПараметрыОбменов.Вставить("ПараметрыОбъектов",         Новый ФиксированноеСоответствие(ПараметрыОбъектов));
	ПараметрыОбменов.Вставить("ПространстваИмен",          Новый ФиксированноеСоответствие(СоответствиеПространстваИмен));
	ПараметрыОбменов.Вставить("ПараметрыВходящихОбъектов", Новый ФиксированноеСоответствие(ПараметрыВходящихОбъектов));
	
	Возврат Новый ФиксированнаяСтруктура(ПараметрыОбменов);
	
КонецФункции

#КонецОбласти

// Сервис получения сведений из реестра правил регионализации
Функция WSПолучитьRegionalizationService(ХозяйствующийСубъект) Экспорт
	
	Если ИнтеграцияВЕТИСВызовСервера.РежимТестовогоКонтура() Тогда
		URIПространстваИмен = "http://api.vetrf.ru/schema/cdm/registry/r13n/service/v2";
		WSОпределение = Новый WSОпределения("http://api.vetrf.ru/schema/platform/services/2.1-RC-last/RegionalizationService_v2.1_pilot.wsdl");
	Иначе
		URIПространстваИмен = "http://api.vetrf.ru/schema/cdm/registry/r13n/service/v2";
		WSОпределение = Новый WSОпределения("http://api.vetrf.ru/schema/platform/services/2.1-RC-last/RegionalizationService_v2.1_production.wsdl");
	КонецЕсли;
	
	НастройкаПодключения = ИнтеграцияВЕТИС.ПолучитьНастройкуПодключения(ХозяйствующийСубъект);
	
	Прокси = Новый WSПрокси(WSОпределение, URIПространстваИмен, "RegionalizationServiceBindingQSService", "RegionalizationServiceBindingQSPort");
	Прокси.Пользователь = НастройкаПодключения.Логин;
	Прокси.Пароль       = НастройкаПодключения.Пароль;
	
	Возврат Прокси;
	
КонецФункции

// Сервис получения адресно-справочной информации
Функция WSПолучитьIkarService(ХозяйствующийСубъект) Экспорт
	
	Если ИнтеграцияВЕТИСВызовСервера.РежимТестовогоКонтура() Тогда
		URIПространстваИмен = "http://api.vetrf.ru/schema/cdm/registry/ikar/service/v2";
		WSОпределение = Новый WSОпределения("http://api.vetrf.ru/schema/platform/services/2.1-RC-last/IkarService_v2.1_pilot.wsdl");
	Иначе
		URIПространстваИмен = "http://api.vetrf.ru/schema/cdm/registry/ikar/service/v2";
		WSОпределение = Новый WSОпределения("http://api.vetrf.ru/schema/platform/services/2.1-RC-last/IkarService_v2.1_production.wsdl");
	КонецЕсли;
	
	НастройкаПодключения = ИнтеграцияВЕТИС.ПолучитьНастройкуПодключения(ХозяйствующийСубъект);
	
	Прокси = Новый WSПрокси(WSОпределение, URIПространстваИмен, "IkarServiceBindingQSService", "IkarServiceBindingQSPort");
	Прокси.Пользователь = НастройкаПодключения.Логин;
	Прокси.Пароль       = НастройкаПодключения.Пароль;
	
	Возврат Прокси;
	
КонецФункции

// Сервис получения сведений из базовых справочников
Функция WSПолучитьDictionaryService(ХозяйствующийСубъект) Экспорт
	
	Если ИнтеграцияВЕТИСВызовСервера.РежимТестовогоКонтура() Тогда
		URIПространстваИмен = "http://api.vetrf.ru/schema/cdm/registry/dictionary/service/v2";
		WSОпределение = Новый WSОпределения("http://api.vetrf.ru/schema/platform/services/2.1-RC-last/DictionaryService_v2.1_pilot.wsdl");
	Иначе
		URIПространстваИмен = "http://api.vetrf.ru/schema/cdm/registry/dictionary/service/v2";
		WSОпределение = Новый WSОпределения("http://api.vetrf.ru/schema/platform/services/2.1-RC-last/DictionaryService_v2.1_production.wsdl");
	КонецЕсли;
	
	НастройкаПодключения = ИнтеграцияВЕТИС.ПолучитьНастройкуПодключения(ХозяйствующийСубъект);
	
	Прокси = Новый WSПрокси(WSОпределение, URIПространстваИмен, "DictionaryServiceBindingQSService", "DictionaryServiceBindingQSPort");
	Прокси.Пользователь = НастройкаПодключения.Логин;
	Прокси.Пароль       = НастройкаПодключения.Пароль;
	
	Возврат Прокси;
	
КонецФункции

Функция WSПолучитьProductService(ХозяйствующийСубъект) Экспорт
	
	Если ИнтеграцияВЕТИСВызовСервера.РежимТестовогоКонтура() Тогда
		URIПространстваИмен = "http://api.vetrf.ru/schema/cdm/registry/product/service/v2";
		WSОпределение = Новый WSОпределения("http://api.vetrf.ru/schema/platform/services/2.1-RC-last/ProductService_v2.1_pilot.wsdl");
	Иначе
		URIПространстваИмен = "http://api.vetrf.ru/schema/cdm/registry/product/service/v2";
		WSОпределение = Новый WSОпределения("http://api.vetrf.ru/schema/platform/services/2.1-RC-last/ProductService_v2.1_production.wsdl");
	КонецЕсли;
	
	НастройкаПодключения = ИнтеграцияВЕТИС.ПолучитьНастройкуПодключения(ХозяйствующийСубъект);
	
	Прокси = Новый WSПрокси(WSОпределение, URIПространстваИмен, "ProductServiceBindingQSService", "ProductServiceBindingQSPort");
	Прокси.Пользователь = НастройкаПодключения.Логин;
	Прокси.Пароль       = НастройкаПодключения.Пароль;
	
	Возврат Прокси;
	
КонецФункции

// Сервис получения сведений из реестра хоз.субъектов и предприятий
Функция WSПолучитьEnterpriseService(ХозяйствующийСубъект) Экспорт
	
	Если ИнтеграцияВЕТИСВызовСервера.РежимТестовогоКонтура() Тогда
		URIПространстваИмен = "http://api.vetrf.ru/schema/cdm/registry/enterprise/service/v2";
		WSОпределение = Новый WSОпределения("http://api.vetrf.ru/schema/platform/services/2.1-RC-last/EnterpriseService_v2.1_pilot.wsdl");
	Иначе
		URIПространстваИмен = "http://api.vetrf.ru/schema/cdm/registry/enterprise/service/v2";
		WSОпределение = Новый WSОпределения("http://api.vetrf.ru/schema/platform/services/2.1-RC-last/EnterpriseService_v2.1_production.wsdl");
	КонецЕсли;
	
	НастройкаПодключения = ИнтеграцияВЕТИС.ПолучитьНастройкуПодключения(ХозяйствующийСубъект);
	
	Прокси = Новый WSПрокси(WSОпределение, URIПространстваИмен, "EnterpriseServiceBindingQSService", "EnterpriseServiceBindingQSPort");
	Прокси.Пользователь = НастройкаПодключения.Логин;
	Прокси.Пароль       = НастройкаПодключения.Пароль;
	
	Возврат Прокси;
	
КонецФункции

// Сервис обработки заявок
Функция WSПолучитьApplicationManagementService(ХозяйствующийСубъект) Экспорт
	
	Если ИнтеграцияВЕТИСВызовСервера.РежимТестовогоКонтура() Тогда
		URIПространстваИмен = "http://api.vetrf.ru/schema/cdm/registry/ams-mercury-g2b/service/v2";
		WSОпределение = Новый WSОпределения("http://api.vetrf.ru/schema/platform/services/2.1-RC-last/ams-mercury-g2b.service_v2.1_pilot.wsdl");
	Иначе
		URIПространстваИмен = "http://api.vetrf.ru/schema/cdm/registry/ams-mercury-g2b/service/v2";
		WSОпределение = Новый WSОпределения("http://api.vetrf.ru/schema/platform/services/2.1-RC-last/ams-mercury-g2b.service_v2.1_production.wsdl");
	КонецЕсли;
	
	НастройкаПодключения = ИнтеграцияВЕТИС.ПолучитьНастройкуПодключения(ХозяйствующийСубъект);
	
	Прокси = Новый WSПрокси(WSОпределение, URIПространстваИмен, "EnterpriseServiceBindingQSService", "EnterpriseServiceBindingQSPort");
	Прокси.Пользователь = НастройкаПодключения.Логин;
	Прокси.Пароль       = НастройкаПодключения.Пароль;
	
	Возврат Прокси;
	
КонецФункции

//Функция WSПолучитьСервис(ХозяйствующийСубъект, ВидСервиса) Экспорт
//	
//	Если ВидСервиса = Перечисления.ВидыСервисовВЕТИС.ApplicationManagementService Тогда
//		WSПолучитьApplicationManagementService(ТранспортныйМодуль);
//	ИначеЕсли ВидСервиса = Перечисления.ВидыСервисовВЕТИС.EnterpriseService Тогда
//		WSПолучитьEnterpriseService(ТранспортныйМодуль);
//	ИначеЕсли ВидСервиса = Перечисления.ВидыСервисовВЕТИС.ProductService Тогда
//		WSПолучитьProductService(ТранспортныйМодуль);
//	ИначеЕсли ВидСервиса = Перечисления.ВидыСервисовВЕТИС.IkarService Тогда
//		WSПолучитьIkarService(ТранспортныйМодуль);
//	ИначеЕсли ВидСервиса = Перечисления.ВидыСервисовВЕТИС.DictionaryService Тогда
//		WSПолучитьDictionaryService(ТранспортныйМодуль);
//	ИначеЕсли ВидСервиса = Перечисления.ВидыСервисовВЕТИС.RegionalizationService Тогда
//		WSПолучитьRegionalizationService(ТранспортныйМодуль);
//	КонецЕсли;
//	
//КонецФункции
