// Модуль основной формы документа "Производственные операции ВетИС"

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ПослеПодбораУпаковок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = ДополнительныеПараметры.ДанныеСтроки;
	
	Если ДанныеСтроки.Свойство("ИдентификаторСтрокиПартий") Тогда
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ИдентификаторСтрокиПартий) Тогда
			ДанныеСтроки.ИдентификаторСтрокиПартий = Новый УникальныйИдентификатор;
		КонецЕсли; 
		ИдентификаторСтроки = ДанныеСтроки.ИдентификаторСтрокиПартий;	
	Иначе
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ИдентификаторСтроки) Тогда
			ДанныеСтроки.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
		ИдентификаторСтроки = ДанныеСтроки.ИдентификаторСтроки;
	КонецЕсли;
	
	Упаковки    = Объект[ДополнительныеПараметры.ИмяТч].НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	Для Каждого ТекущаяСтрока Из Упаковки Цикл
		Объект[ДополнительныеПараметры.ИмяТч].Удалить(ТекущаяСтрока);
	КонецЦикла;
	
	УпаковкиПредставление = "";
	Для Каждого ТекущаяСтрока Из Результат Цикл
		НоваяСтрока = Объект[ДополнительныеПараметры.ИмяТч].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
		УпаковкиПредставление = УпаковкиПредставление + ?(ЗначениеЗаполнено(УпаковкиПредставление),", ", "") + Строка(НоваяСтрока.Упаковка);
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		УпаковкиПредставление = "Упаковки не указаны";
	КонецЕсли;
	
	ДанныеСтроки.Упаковки = УпаковкиПредставление;
	ЭтотОбъект.Модифицированность = Истина;

КонецПроцедуры  // ПослеПодбораУпаковок()

// Формирует параметры для открытия формы упаковок
&НаКлиенте
Процедура ВыборУпаковок(ВыбраннаяСтрока,СтандартнаяОбработка,ИмяТч,ИмТчПодчиненная)	
	
	ДанныеСтроки = Объект[ИмяТч].НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если ДанныеСтроки.Свойство("ИдентификаторСтрокиПартий") Тогда
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ИдентификаторСтрокиПартий) Тогда
			ДанныеСтроки.ИдентификаторСтрокиПартий = Новый УникальныйИдентификатор;
		КонецЕсли;
		ИдентификаторСтроки = ДанныеСтроки.ИдентификаторСтрокиПартий;
	ИначеЕсли ДанныеСтроки.Свойство("ИдентификаторСтроки") Тогда 
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ИдентификаторСтроки) Тогда
			ДанныеСтроки.ИдентификаторСтроки = Новый УникальныйИдентификатор; 
		КонецЕсли;
		ИдентификаторСтроки = ДанныеСтроки.ИдентификаторСтроки;
	КонецЕсли;

	УпаковкиСтроки = Новый Массив;
	
	НайденныеУпаковки = Объект[ИмТчПодчиненная].НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	Для Каждого ТекущаяСтрока Из НайденныеУпаковки Цикл
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("Упаковка",           ТекущаяСтрока.Упаковка);
		НоваяСтрока.Вставить("УровеньУпаковки", ТекущаяСтрока.УровеньУпаковки);
		НоваяСтрока.Вставить("Маркировка",      ТекущаяСтрока.Маркировка);
		НоваяСтрока.Вставить("ТипМаркировки",      ТекущаяСтрока.ТипМаркировки);
		НоваяСтрока.Вставить("КоличествоУпаковок",      ТекущаяСтрока.КоличествоУпаковок);
		
		УпаковкиСтроки.Добавить(НоваяСтрока);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Упаковки", УпаковкиСтроки);
	ПараметрыФормы.Вставить("ИдентификаторСтроки",  ИдентификаторСтроки);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДанныеСтроки", ДанныеСтроки);
	ДополнительныеПараметры.Вставить("ИмяТЧ", ИмТчПодчиненная);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПослеПодбораУпаковок",
			ЭтотОбъект,
			ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ПодборУпаковок", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры // ВыборУпаковок()

// Заполняет служебный реквизит "Упаковка"
&НаСервере
Процедура СформироватьПредставлениеУпаковок()
	
	ТекстПредставления = "";
	Для Каждого Строка Из Объект.Партии Цикл
		МассивУпаковок = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", Строка.ИдентификаторСтрокиПартий));
		Для Каждого ТекущаяУпаковка Из МассивУпаковок Цикл
			ТекстПредставления = ТекстПредставления + ?(ТекстПредставления = "", "", ", ") + СокрЛП(ТекущаяУпаковка.Упаковка);
		КонецЦикла;
		Строка.Упаковки = ТекстПредставления;
	КонецЦикла;
	
	ТекстПредставления = "";
	Для Каждого Строка Из Объект.Продукция Цикл
		МассивУпаковок = Объект.УпаковкиПродукции.НайтиСтроки(Новый Структура("ИдентификаторСтроки", Строка.ИдентификаторСтроки));
		Для Каждого ТекущаяУпаковка Из МассивУпаковок Цикл
			ТекстПредставления = ТекстПредставления + ?(ТекстПредставления = "", "", ", ") + СокрЛП(ТекущаяУпаковка.Упаковка);
		КонецЦикла;
		Строка.Упаковки = ТекстПредставления;
	КонецЦикла;
	
КонецПроцедуры // СформироватьПредставлениеУпаковок()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ПослеПодбора(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Объект.Ингредиенты.НайтиПоИдентификатору(Элементы.Ингредиенты.ТекущаяСтрока);
	НайденныеСтроки = Объект.Партии.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
		
		НайденныеСтрокиУпаковок = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтрокиПартий));
		Для Каждого СтрокаУпаковки Из НайденныеСтрокиУпаковок Цикл
			Объект.Упаковки.Удалить(СтрокаУпаковки);
		КонецЦикла;
		
		Объект.Партии.Удалить(ТекущаяСтрока);
		
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из Результат.ПодобранныеПартии Цикл
		НоваяСтрока = Объект.Партии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.ИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки;
		НоваяСтрока.ИдентификаторСтрокиПартий = ТекущаяСтрока.ИдентификаторСтрокиПартий;
		НоваяСтрока.ЭкспертизаРезультат = ТекущаяСтрока.ЭкспертизаРезультат;
		
		УпаковкиПредставление = "";
		НайденныеСтрокиУпаковок = Результат.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтрокиПартий));
		Для Каждого СтрокаУпаковки Из НайденныеСтрокиУпаковок Цикл
			НоваяУпаковка = Объект.Упаковки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяУпаковка, СтрокаУпаковки);
			УпаковкиПредставление = УпаковкиПредставление + ?(ЗначениеЗаполнено(УпаковкиПредставление),", ", "") + Строка(НоваяУпаковка.Упаковка);
		КонецЦикла;
		
		Если УпаковкиПредставление = "" Тогда
			УпаковкиПредставление = "Упаковки не указаны";
		КонецЕсли;
		
		НоваяСтрока.Упаковки = УпаковкиПредставление;
		
	КонецЦикла;
	
	ЭтотОбъект.Модифицированность = Истина;
	
КонецПроцедуры  // ПослеПодбора()

#Область ВыполнениеЗаявокВЕТИС_API

&НаСервере
Функция ЗапроситьНаСервере(ВидОперации)
	
	Если ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросНаОформлениеПроизводственнойПартии Тогда
		
		Если ЗначениеЗаполнено(Объект.ИдентификаторПроизводственнойТранзакции) Тогда
			
			МассивДанныхДляВыгрузки = Новый Массив;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	МеркурийЗаявкаВСД.ИдентификаторСтроки
			|ИЗ
			|	Документ.ПроизводственныеОперацииВетИС.Партии КАК МеркурийЗаявкаВСД
			|ГДЕ
			|	МеркурийЗаявкаВСД.Ссылка = &Ссылка И 
			|	МеркурийЗаявкаВСД.Израсходована = ЛОЖЬ
			|";
			
			Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
			
			МассивДанных = Новый Массив;
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Новый Структура;
				НоваяСтрока.Вставить("Объект",              Объект.Ссылка);
				НоваяСтрока.Вставить("ИдентификаторСтроки", Выборка.ИдентификаторСтроки);
				НоваяСтрока.Вставить("ТипОперациии",        "СписаниеСырья");
				МассивДанных.Добавить(НоваяСтрока);
			КонецЦикла;
			
			ДанныеДляВыгрузки = ИнтеграцияВЕТИСКлиентСервер.СтруктураДанныхДляВыгрузки();
			ДанныеДляВыгрузки.ХозяйствующийСубъект = Объект.ХозяйствующийСубъект;
			ДанныеДляВыгрузки.Предприятие          = Объект.Предприятие;
			ДанныеДляВыгрузки.ВидОперации          = ВидОперации;
			
			ДанныеДляВыгрузки.Вставить("Объект",       Объект.Ссылка);
			ДанныеДляВыгрузки.Вставить("МассивДанных", МассивДанных);
			
			МассивДанныхДляВыгрузки.Добавить(ДанныеДляВыгрузки);
			
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	МеркурийЗаявкаВСД.ИдентификаторСтроки
			|ИЗ
			|	Документ.ПроизводственныеОперацииВетИС.Продукция КАК МеркурийЗаявкаВСД
			|ГДЕ
			|	МеркурийЗаявкаВСД.Ссылка = &Ссылка И 
			|	МеркурийЗаявкаВСД.ВСД = ЗНАЧЕНИЕ(Документ.ВСДВетИС.ПустаяСсылка)
			|";
			
			Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
			
			МассивДанных = Новый Массив;
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Новый Структура;
				НоваяСтрока.Вставить("Объект", Объект.Ссылка);
				НоваяСтрока.Вставить("ИдентификаторСтроки", Выборка.ИдентификаторСтроки);
				НоваяСтрока.Вставить("ТипОперациии", "ВыпускПродукции");
				МассивДанных.Добавить(НоваяСтрока);
			КонецЦикла;
			
			ДанныеДляВыгрузки = ИнтеграцияВЕТИСКлиентСервер.СтруктураДанныхДляВыгрузки();
			ДанныеДляВыгрузки.ХозяйствующийСубъект = Объект.ХозяйствующийСубъект;
			ДанныеДляВыгрузки.Предприятие          = Объект.Предприятие;
			ДанныеДляВыгрузки.ВидОперации          = ВидОперации;
			
			ДанныеДляВыгрузки.Вставить("Объект",       Объект.Ссылка);
			ДанныеДляВыгрузки.Вставить("МассивДанных", МассивДанных);
			
			МассивДанныхДляВыгрузки.Добавить(ДанныеДляВыгрузки);
			
			РезультатОбмена = ИнтеграцияВЕТИСВызовСервера.ПодготовитьЗапрос(Объект.ХозяйствующийСубъект, Объект.Предприятие, ВидОперации, МассивДанныхДляВыгрузки, УникальныйИдентификатор);
			
		Иначе
			
			ДанныеДляВыгрузки = ИнтеграцияВЕТИСКлиентСервер.СтруктураДанныхДляВыгрузки();
			ДанныеДляВыгрузки.ХозяйствующийСубъект = Объект.ХозяйствующийСубъект;
			ДанныеДляВыгрузки.Предприятие          = Объект.Предприятие;
			ДанныеДляВыгрузки.ВидОперации          = ВидОперации;
			
			ДанныеДляВыгрузки.Вставить("Объект",                  Объект.Ссылка);
			ДанныеДляВыгрузки.Вставить("ТипОперациии",            "Производство");
			
			РезультатОбмена = ИнтеграцияВЕТИСВызовСервера.ПодготовитьЗапрос(Объект.ХозяйствующийСубъект, Объект.Предприятие, ВидОперации, ДанныеДляВыгрузки, УникальныйИдентификатор);
			
		КонецЕсли;
	Иначе
		
		ДанныеДляВыгрузки = ИнтеграцияВЕТИСКлиентСервер.СтруктураДанныхДляВыгрузки();
		ДанныеДляВыгрузки.ХозяйствующийСубъект = Объект.ХозяйствующийСубъект;
		ДанныеДляВыгрузки.Предприятие          = Объект.Предприятие;
		ДанныеДляВыгрузки.ВидОперации          = ВидОперации;
		
		ДанныеДляВыгрузки.Вставить("Объект", Объект.Ссылка);
		
		РезультатОбмена = ИнтеграцияВЕТИСВызовСервера.ПодготовитьЗапрос(Объект.ХозяйствующийСубъект, Объект.Предприятие, ВидОперации, ДанныеДляВыгрузки, УникальныйИдентификатор);
		
	КонецЕсли;
	
	ОбновитьСтатусОбработки();
	
	Возврат РезультатОбмена;
	
КонецФункции

&НаКлиенте
Процедура НачатьВыполнениеЗапроса(ВидОперации)
	
	Если Объект.Партии.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Не указаны складские записи!'"), 5);
		Возврат;
	КонецЕсли;
	
	РезультатОбмена = ЗапроситьНаСервере(ВидОперации);
	ОбработатьРезультатОбмена(РезультатОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатОбмена(РезультатОбмена)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияРезультатОбработкиЗаявки", ЭтотОбъект);
	
	ИнтеграцияВЕТИСКлиент.ОбработатьРезультатОбмена(РезультатОбмена, ЭтотОбъект,, ОписаниеОповещения, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьОбменОбработкаОжидания()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияРезультатОбработкиЗаявки", ЭтотОбъект);
	ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ПрогрессВыполненияЗаявки", ЭтотОбъект);
	
	ИнтеграцияВЕТИСКлиент.ПродолжитьВыполнениеОбмена(ЭтотОбъект,, ОписаниеОповещения, Ложь, ОповещениеОПрогрессеВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияРезультатОбработкиЗаявки(Изменения, ДополнительныеПараметры) Экспорт
	
	БезОшибок = Истина;
	Для Каждого ЭлементДанных Из Изменения Цикл
		Если ЭлементДанных.Принято Тогда
			Если ЗначениеЗаполнено(ЭлементДанных.ТекстОшибки) Тогда
				БезОшибок = Ложь;
				ВывестиСообщение(НСтр("ru = 'Операция %1 выполнена с ошибкой: %2'"),,,,, ЭлементДанных.ВидОперации, ЭлементДанных.ТекстОшибки);
			Иначе
				ВывестиСообщение(НСтр("ru = 'Операция %1 выполнена со статусом: %2'"),,,,, ЭлементДанных.ВидОперации, Строка(ЭлементДанных.НовыйСтатус));
			КонецЕсли;
			Прочитать();
			ОбновитьСтатусОбработки();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрогрессВыполненияЗаявки(Изменения, ДополнительныеПараметры) Экспорт
	
	БезОшибок = Истина;
	Для Каждого ЭлементДанных Из Изменения.Сообщения Цикл
		ВывестиСообщение(Изменения.Сообщения[0].Текст);
		//Если ЭлементДанных.Принято Тогда
		//	Если ЗначениеЗаполнено(ЭлементДанных.ТекстОшибки) Тогда
		//		БезОшибок = Ложь;
		//		ВывестиСообщение(НСтр("ru = 'Сообщение %1 выполнено с ошибкой: %2'"),,,,, ЭлементДанных.ИсходящееСообщение, ЭлементДанных.ТекстОшибки);
		//	Иначе
		//		ВывестиСообщение(НСтр("ru = 'Сообщение %1 выполнено со статусом: %2'"),ВладелецФормы.УникальныйИдентификатор,,,, ЭлементДанных.ВидОперации, Строка(ЭлементДанных.НовыйСтатус));
		//	КонецЕсли;
		//КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

#Область Статус

&НаСервере
Процедура ОбновитьСтатусОбработки()
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	
	ИмяДокумента    = Объект.Ссылка.Метаданные().Имя;
	СтатусПоУмолчанию = Справочники.СтатусыОбработкиВЕТИС.ПолучитьСтатусОбработкиПоУмолчанию(ИмяДокумента);
	СтатусОбработки    = СтатусПоУмолчанию.СтатусОбработки;
	ДальнейшееДействие = СтатусПоУмолчанию.ДальнейшееДействие;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Статусы.СтатусОбработки КАК СтатусОбработки,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие1 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияВЕТИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие1
		|	КОНЕЦ КАК ДальнейшееДействие1,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие2 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияВЕТИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие2
		|	КОНЕЦ КАК ДальнейшееДействие2,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие3 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияВЕТИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие3
		|	КОНЕЦ КАК ДальнейшееДействие3
		|ИЗ
		|	РегистрСведений.СтатусыДокументовВЕТИС КАК Статусы
		|ГДЕ
		|	Статусы.Документ = &Документ";
		
		Запрос.УстановитьПараметр("Документ",                 Объект.Ссылка);
		Запрос.УстановитьПараметр("МассивДальнейшиеДействия", ИнтеграцияВЕТИС.НеотображаемыеВДокументахДальнейшиеДействия());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СтатусОбработки = Выборка.СтатусОбработки;
			ДальнейшееДействие = Новый Массив;
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие1);
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие2);
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие3);
		КонецЕсли;
		
	КонецЕсли;
	
	ДопустимыеДействия = Новый Массив;
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияВЕТИС.ПередайтеДанные);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияВЕТИС.ОтменитеОперацию);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияВЕТИС.ОтменитеПередачуДанных);
	
	СтатусОбработкиПредставление = ИнтеграцияВЕТИС.ПредставлениеСтатусаОбработки(
		СтатусОбработки,
		ДальнейшееДействие,
		ДопустимыеДействия);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при нажатии на гиперссылку форматированной строки "Статус обработки представление".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НавигационнаяСсылкаФорматированнойСтроки - Строка - Значение гиперссылки форматированной строки.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура СтатусОбработкиПредставлениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	Если Модифицированность ИЛИ (Не ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("СтатусОбработкиОбработкаНавигационнойСсылкиЗавершение", ЭтотОбъект, Новый Структура("НавигационнаяСсылкаФорматированнойСтроки", НавигационнаяСсылкаФорматированнойСтроки));
		ТекстВопроса = НСтр("ru = 'Для продолжения документ необходимо записать. Записать?'");
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки);
	КонецЕсли;
	
КонецПроцедуры // СтатусОбработкиПредставлениеОбработкаНавигационнойСсылки()

&НаКлиенте
Процедура ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПередатьДанные" Тогда
		
		НачатьВыполнениеЗапроса(ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ЗапросНаОформлениеПроизводственнойПартии"));
		//
		//Если ДанныеДляВыгрузки.ТипОперациии = "Производство" Тогда
		//	ЗаполнитьОбъектПроизводственныйВСД(ОбъектЗаявки, ДанныеДляВыгрузки);
		//ИначеЕсли ДанныеДляВыгрузки.ТипОперациии = "СписаниеСырья" Тогда
		//	ЗаполнитьОбъектСписанияСырья(ОбъектЗаявки, ДанныеДляВыгрузки);
		//ИначеЕсли ДанныеДляВыгрузки.ТипОперациии = "ВыпускПродукции" Тогда
		//	ЗаполнитьОбъектВыпускПродукцииВСД(ОбъектЗаявки, ДанныеДляВыгрузки);
		//ИначеЕсли ДанныеДляВыгрузки.ТипОперациии = "СписаниеПолуфабрикатов" Тогда
		//	ЗаполнитьОбъектСписанияПолуфабрикатов(ОбъектЗаявки, ДанныеДляВыгрузки);
		//КонецЕсли;
		
		
	//ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтменитьОперацию" Тогда
	//	
	//	ИнтеграцияЕГАИСКлиент.ОтменитьПоследнююОперацию(Объект.Ссылка);
	//	
	//ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтменитьПередачу" Тогда
	//	
	//	ИнтеграцияЕГАИСКлиент.ОтменитьПередачу(Объект.Ссылка);
	//	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбработкиОбработкаНавигационнойСсылкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда
		 Возврат;
	КонецЕсли;
	
	Если ПроверитьЗаполнение() Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		РазблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	Если Не Модифицированность Тогда
		ОбработатьНажатиеНавигационнойСсылки(ДополнительныеПараметры.НавигационнаяСсылкаФорматированнойСтроки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
	ИнтеграцияВЕТИС.УстановитьПараметрыВыбораПредприятий(Элементы.Предприятие, Объект.ХозяйствующийСубъект);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект); 
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
// Параметры:
//  ИмяСобытия - Строка - Имя события, при работе которого необходимо проверить блокировку.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события возникающего на клиенте при выполнении команды "Подбор".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура Подбор(Команда)
	
	Если Элементы.Ингредиенты.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Объект.Ингредиенты.НайтиПоИдентификатору(Элементы.Ингредиенты.ТекущаяСтрока);
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = Объект.Партии.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ХозяйствующийСубъект", Объект.ХозяйствующийСубъект);
	ПараметрыЗаполнения.Вставить("Предприятие",          Объект.Предприятие);
	ПараметрыЗаполнения.Вставить("Номенклатура",         ТекущиеДанные.Номенклатура);
	ПараметрыЗаполнения.Вставить("Количество",           ТекущиеДанные.Вес);
	
	Партии = Новый Массив;
	Упаковки = Новый Массив;
	Для Каждого СтрокаПартии Из НайденныеСтроки Цикл
		СтруктураПартии = ИнтеграцияВЕТИСКлиент.ПолучитьСторокуПодбораПартии();
		ЗаполнитьЗначенияСвойств(СтруктураПартии, СтрокаПартии);
		Партии.Добавить(СтруктураПартии);
		НайденныеСтрокиУпаковок = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаПартии.ИдентификаторСтрокиПартий));
		Для Каждого СтрокаУпаковки Из НайденныеСтрокиУпаковок Цикл
			СтруктураУпаковки = ИнтеграцияВЕТИСКлиент.ПолучитьСторокуПодбораУпаковки();
			ЗаполнитьЗначенияСвойств(СтруктураУпаковки, СтрокаУпаковки);
			Упаковки.Добавить(СтруктураУпаковки);
		КонецЦикла;
	КонецЦикла;
	ПараметрыЗаполнения.Вставить("Партии",Партии);
	ПараметрыЗаполнения.Вставить("Упаковки",Упаковки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПослеПодбора",
			ЭтотОбъект);
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ПодборПартий", ПараметрыЗаполнения, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // Подбор()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ПАРТИИ"

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле - Булево - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ПартииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	
	Если НЕ Поле.Имя = "ПартииУпаковки" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ВыборУпаковок(ВыбраннаяСтрока,СтандартнаяОбработка,"Партии","Упаковки");
	
КонецПроцедуры //ПартииВыбор()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПартииПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Объект.Партии.НайтиПоИдентификатору(Элементы.Партии.ТекущаяСтрока);
	
	Если НЕ Отказ И (НЕ ТекущиеДанные = Неопределено) Тогда
		МассивУпаковок = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтрокиПартий));
		Для Каждого ТекущаяУпаковка Из МассивУпаковок Цикл
			Объект.Упаковки.Удалить(ТекущаяУпаковка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ПартииПередУдалением()

// Обработчик события возникающего на клиенте при начале редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  Копирование			 - Булево       - Истина, если добавлено копированием.
//
&НаКлиенте
Процедура ПартииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НЕ НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные      = Элементы.Ингредиенты.ТекущиеДанные;
	ТекущиеДанныеПартии = Объект.Партии.НайтиПоИдентификатору(Элементы.Партии.ТекущаяСтрока);
	Если (НЕ ТекущиеДанные = Неопределено) И (НЕ ТекущиеДанныеПартии = Неопределено) И НЕ ЗначениеЗаполнено(ТекущиеДанныеПартии.ИдентификаторСтроки) Тогда
		ТекущиеДанныеПартии.ИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанныеПартии.ИдентификаторСтрокиПартий) Тогда
		ТекущиеДанныеПартии.ИдентификаторСтрокиПартий = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры // ПартииПриНачалеРедактирования()

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "Продукция"

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле - Булево - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ПродукцияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если НЕ Поле.Имя = "ПродукцияУпаковки" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ВыборУпаковок(ВыбраннаяСтрока,СтандартнаяОбработка,"Продукция","УпаковкиПродукции");
	
КонецПроцедуры // ПродукцияВыбор()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПродукцияПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Объект.Продукция.НайтиПоИдентификатору(Элементы.Продукция.ТекущаяСтрока);
	
	Если НЕ Отказ И (НЕ ТекущиеДанные = Неопределено) Тогда
		МассивУпаковок = Объект.УпаковкиПродукции.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
		Для Каждого ТекущаяУпаковка Из МассивУпаковок Цикл
			Объект.Упаковки.Удалить(ТекущаяУпаковка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры  // ПродукцияПередУдалением()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура ПродукцияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НоваяСтрока И НЕ ОтменаРедактирования Тогда
		
		// Для новой позиции установим ее уникальный идентификатор
		СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ИдентификаторСтроки) Тогда
			СтрокаТабличнойЧасти.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПродукцияПередОкончаниемРедактирования()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ПРОДУКЦИЯ"

// Обработчик события возникающего при изменении данных реквизита "Продукция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ПродукцияПродукцияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Продукция.НайтиПоИдентификатору(Элементы.Продукция.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПроизводственныеОперацииВЕТИС.ПродукцияПродукцияПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ПродукцияПродукцияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Продукция"
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПродукцияПродукцияПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ПродукцияПродукцияПриИзмененииНаСервере();
	
КонецПроцедуры // ПродукцияПродукцияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество"
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПродукцияКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.Вес = ТекущиеДанные.КоэффициентВеса*ТекущиеДанные.Количество;
	КонецЕсли;
	
КонецПроцедуры // ПродукцияКоличествоПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Коэффициент"
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПродукцияКоэффициентВесаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.Вес = ТекущиеДанные.КоэффициентВеса*ТекущиеДанные.Количество;
	КонецЕсли;
	
КонецПроцедуры // ПродукцияКоэффициентВесаПриИзменении()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ВСД"

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле - Булево - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ВСДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВСД.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные.ВСД);

КонецПроцедуры // ВСДВыбор()

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "Ингредиенты"

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество"
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ИнгредиентыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Ингредиенты.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.Вес = ТекущиеДанные.КоэффициентВеса*ТекущиеДанные.Количество;
	КонецЕсли;
	
КонецПроцедуры // ИнгредиентыКоличествоПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Коэффициент"
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ИнгредиентыКоэффициентВесаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Ингредиенты.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.Вес = ТекущиеДанные.КоэффициентВеса*ТекущиеДанные.Количество;
	КонецЕсли;
	
КонецПроцедуры // ИнгредиентыКоэффициентВесаПриИзменении()

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "Ингредиенты"

// Обработчик события возникающего на клиенте при при активизации ячейки таблицы.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ИнгредиентыПриАктивизацииСтроки(Элемент)
	
	Если Объект.Ингредиенты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Объект.Ингредиенты.НайтиПоИдентификатору(Элементы.Ингредиенты.ТекущаяСтрока);
	Элементы.Партии.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
	Элементы.Партии.Обновить();
	
КонецПроцедуры // ИнгредиентыПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при начале редактирования строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ИнгредиентыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		// Для новой позиции установим ее уникальный идентификатор
		СтрокаТабличнойЧасти = Элементы.Ингредиенты.ТекущиеДанные;
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ИдентификаторСтроки) Тогда
			СтрокаТабличнойЧасти.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЕсли;
	ИнгредиентыПриАктивизацииСтроки(Неопределено);
	
КонецПроцедуры // ИнгредиентыПриНачалеРедактирования()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ИнгредиентыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Объект.Ингредиенты.НайтиПоИдентификатору(Элементы.Ингредиенты.ТекущаяСтрока);
	
	Если НЕ Отказ И (НЕ ТекущиеДанные = Неопределено) Тогда
		МассивПартий = Объект.Партии.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
		Для Каждого ТекущаяПартия Из МассивПартий Цикл
			
			МассивУпаковок = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяПартия.ИдентификаторСтрокиПартий));
			Для Каждого ТекущаяУпаковка Из МассивУпаковок Цикл
				Объект.Упаковки.Удалить(ТекущаяУпаковка);
			КонецЦикла;
			Объект.Партии.Удалить(ТекущаяПартия);
				
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры // ИнгредиентыПередУдалением()

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ТаблицаРезультат"

// Обработчик события возникающего при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы в контекстат сервера.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле - Булево - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаСервере
Процедура ТаблицаРезультатВыборНаСервере(ВыбраннаяСтрока)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СкладскойЖурналВЕТИС.ХозяйствующийСубъект,
	|	СкладскойЖурналВЕТИС.Предприятие,
	|	СкладскойЖурналВЕТИС.ВидПродукции,
	|	СкладскойЖурналВЕТИС.Продукция,
	|	СкладскойЖурналВЕТИС.Идентификатор
	|ИЗ
	|	РегистрСведений.СкладскойЖурналВЕТИС КАК СкладскойЖурналВЕТИС
	|ГДЕ
	|	СкладскойЖурналВЕТИС.НомерЗаписи = &НомерЗаписи
	|";
	
	Запрос.УстановитьПараметр("НомерЗаписи", ВыбраннаяСтрока.НомерЗаписи);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Запись = РегистрыСведений.СкладскойЖурналВЕТИС.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, Выборка);
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		ФормаЗаписи = Запись.ПолучитьФорму(, ЭтотОбъект);
		ФормаЗаписи.Открыть();
	КонецЕсли;
	
КонецПроцедуры // ТаблицаРезультатВыборНаСервере()

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле - Булево - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ТаблицаРезультатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	
	Если НЕ Поле.Имя = "НомерЗаписи" ИЛИ ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ВыбраннаяСтрока.НомерЗаписи) Тогда
		Возврат;
	КонецЕсли;
	ТаблицаРезультатВыборНаСервере(ВыбраннаяСтрока);
	
КонецПроцедуры // ТаблицаРезультатВыбор()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьПредставлениеУпаковок();
	
	ОбновитьСтатусОбработки();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Настройка кнопок командной панели табличной части
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "Продукция");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "Ингредиенты");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "Партии");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "ТаблицаРезультат");
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	ОбновитьСтатусОбработки();
	
	СформироватьПредставлениеУпаковок();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьПредставлениеУпаковок();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТранспортныйВСДПартии.Продукция КАК Продукция,
	               |	МАКСИМУМ(ТранспортныйВСДПартии.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	               |	ТранспортныйВСДИнгредиенты.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	Документ.ПроизводственныеОперацииВЕТИС.Ингредиенты КАК ТранспортныйВСДИнгредиенты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводственныеОперацииВЕТИС.Партии КАК ТранспортныйВСДПартии
	               |		ПО ТранспортныйВСДИнгредиенты.ИдентификаторСтроки = ТранспортныйВСДПартии.ИдентификаторСтроки
	               |			И ТранспортныйВСДИнгредиенты.Ссылка = ТранспортныйВСДПартии.Ссылка
	               |ГДЕ
	               |	ТранспортныйВСДИнгредиенты.Ссылка = &Ссылка
	               |	И НЕ ТранспортныйВСДИнгредиенты.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТранспортныйВСДПартии.Продукция,
	               |	ТранспортныйВСДИнгредиенты.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписиСоответствиеНоменклатурыМеркурий = РегистрыСведений.СоответствиеНоменклатурыВЕТИС.СоздатьМенеджерЗаписи();
		МенеджерЗаписиСоответствиеНоменклатурыМеркурий.Номенклатура = Выборка.Номенклатура;
		//МенеджерЗаписиСоответствиеНоменклатурыМеркурий.ВидПродукции  = Выборка.ВидПродукции;
		МенеджерЗаписиСоответствиеНоменклатурыМеркурий.Продукция      = Выборка.Продукция;
		//МенеджерЗаписиСоответствиеНоменклатурыМеркурий.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
		МенеджерЗаписиСоответствиеНоменклатурыМеркурий.Записать();
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТранспортныйВСДПродукция.Продукция КАК Продукция,
	               |	ТранспортныйВСДПродукция.Номенклатура КАК Номенклатура,
	               |	МАКСИМУМ(ТранспортныйВСДПродукция.ЕдиницаИзмерения) КАК ЕдиницаИзмерения
	               |ИЗ
	               |	Документ.ПроизводственныеОперацииВЕТИС.Продукция КАК ТранспортныйВСДПродукция
	               |ГДЕ
	               |	ТранспортныйВСДПродукция.Ссылка = &Ссылка
	               |	И НЕ ТранспортныйВСДПродукция.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТранспортныйВСДПродукция.Продукция,
	               |	ТранспортныйВСДПродукция.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка",ТекущийОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписиСоответствиеНоменклатурыМеркурий = РегистрыСведений.СоответствиеНоменклатурыВЕТИС.СоздатьМенеджерЗаписи();
		МенеджерЗаписиСоответствиеНоменклатурыМеркурий.Номенклатура = Выборка.Номенклатура;
		//МенеджерЗаписиСоответствиеНоменклатурыМеркурий.ВидПродукции  = Выборка.ВидПродукции;
		МенеджерЗаписиСоответствиеНоменклатурыМеркурий.Продукция      = Выборка.Продукция;
		//МенеджерЗаписиСоответствиеНоменклатурыМеркурий.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
		МенеджерЗаписиСоответствиеНоменклатурыМеркурий.Записать();
	КонецЦикла;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	ОбновитьСтатусОбработки();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
	РазблокироватьДанныеФормыДляРедактирования();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаСервере
Процедура ХозСубъектПриИзмененииНаСервере()
	
	ИнтеграцияВЕТИС.УстановитьПараметрыВыбораПредприятий(Элементы.Предприятие, Объект.ХозяйствующийСубъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ХозСубъектПриИзменении(Элемент)
	
	ХозСубъектПриИзмененииНаСервере();
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

