///////////////////////////////////////////////////////////////////////////////
// Модуль формы списка регистра "Клиентские токены СУЗ"
//
///////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ УправлениеСпискомРегистраСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ УправлениеСпискомРегистраКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ПродолжитьВыполнение = УправлениеСпискомРегистраКлиент.ПередЗакрытием(
		ЭтотОбъект,
		Отказ,
		ЗавершениеРаботы,
		ТекстПредупреждения,
		СтандартнаяОбработка
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ УправлениеСпискомРегистраКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия)
	
	Если НЕ УправлениеСпискомРегистраСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ПараметрыДействия = Новый Структура;
	
	ПродолжитьВыполнение = УправлениеСпискомРегистраКлиент.ОбработкаОповещения(
		ЭтотОбъект,
		ИмяСобытия,
		Параметр,
		Источник,
		ПараметрыДействия
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	Если НЕ УправлениеСпискомРегистраКлиент.ОбработкаАктивизации(ЭтотОбъект, АктивныйОбъект, Источник) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ПродолжитьВыполнение = УправлениеСпискомРегистраКлиент.ОбработкаЗаписиНового(
		ЭтотОбъект,
		НовыйОбъект,
		Источник,
		СтандартнаяОбработка
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	УправлениеСпискомРегистраСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УправлениеСпискомРегистраСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	УправлениеСпискомРегистраКлиент.СписокВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	УправлениеСпискомРегистраКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СписокПриАктивизацииСтроки()
	
	УправлениеСпискомРегистраКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элементы.Список, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)
	
	УправлениеСпискомРегистраКлиент.СписокПриАктивизацииЯчейки(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	УправлениеСпискомРегистраКлиент.СписокПередНачаломДобавления(
		ЭтотОбъект,
		Элемент,
		Отказ,
		Копирование,
		Родитель,
		Группа,
		Параметр
	);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	УправлениеСпискомРегистраКлиент.СписокПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	УправлениеСпискомРегистраКлиент.СписокПослеУдаления(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура СписокПриСохраненииПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	УправлениеСпискомРегистраСервер.СписокПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура СписокПриЗагрузкеПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	УправлениеСпискомРегистраСервер.СписокПриЗагрузкеПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	УправлениеСпискомРегистраСервер.СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСлужебногоПрограммногоИнтерфейса

&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	Если НЕ УправлениеСпискомРегистраСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	ПараметрыДействия = Новый Структура;
	
	ПродолжитьВыполнение = УправлениеСпискомРегистраКлиент.ОбработкаКомандыФормы(
		ЭтотОбъект,
		Команда,
		Элементы.Список.ТекущиеДанные,
		ЭтотОбъект.Окно,
		ПараметрыДействия
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры = Неопределено)
	
	ПродолжитьВыполнение = УправлениеСпискомРегистраСервер.ОбработкаРезультатаОповещения(
		ЭтотОбъект,
		РезультатОповещения,
		ДополнительныеПараметры
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения,
		ДополнительныеПараметры = Неопределено) Экспорт
	
	ПродолжитьВыполнение = УправлениеСпискомРегистраКлиент.ОбработкаРезультатаОповещения(
		ЭтотОбъект,
		РезультатОповещения,
		ДополнительныеПараметры
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	УправлениеСпискомРегистраКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПросроченныеТокеныНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ответственный", Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("ДатаПроверки", ТекущаяУниверсальнаяДата());
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НастройкаОбменаМаркировкиТоваров.Организация КАК Организация,
	|	НастройкаОбменаМаркировкиТоваров.ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	Справочник.НастройкаОбменаМаркировкиТоваров КАК НастройкаОбменаМаркировкиТоваров
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ТокеныМаркировки КАК РегистрСведенийТокеныМаркировки
	|ПО
	|	РегистрСведенийТокеныМаркировки.Организация = НастройкаОбменаМаркировкиТоваров.Организация И 
	|	РегистрСведенийТокеныМаркировки.ПодразделениеКомпании = НастройкаОбменаМаркировкиТоваров.ПодразделениеКомпании И 
	|	РегистрСведенийТокеныМаркировки.ТипТокена = ЗНАЧЕНИЕ(Перечисление.ТипыТокеновАвторизации.Маркировка)
	|ГДЕ
	|	НастройкаОбменаМаркировкиТоваров.ПометкаУдаления = ЛОЖЬ И 
	|	ВЫБОР
	|		КОГДА РегистрСведенийТокеныМаркировки.СрокДействия ЕСТЬ NULL ТОГДА
	|			ИСТИНА
	|		КОГДА РегистрСведенийТокеныМаркировки.СрокДействия < &ДатаПроверки ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ И 
	|	ВЫБОР
	|		КОГДА НастройкаОбменаМаркировкиТоваров.Ответственный = &Ответственный ТОГДА
	|			ИСТИНА
	|		КОГДА НастройкаОбменаМаркировкиТоваров.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ
	|";
	
	Результат = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПараметрыЗапроса = ОбменССистемойМаркировкиПовтИсп.ПараметрыЗапроса(Выборка.Организация, Выборка.ПодразделениеКомпании);
		ПараметрыЗапроса.Удалить("СписокУстройств");
		
		ПараметрыАвторизации = ОбменССистемойМаркировкиСервер.ПараметрыАвторизации(ПараметрыЗапроса);
		Если ЗначениеЗаполнено(ПараметрыАвторизации.Данные) Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			ПарольСертификата = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ПараметрыЗапроса.Сертификат, "ПарольСертификата");
			Если ПарольСертификата = Неопределено И ЗначениеЗаполнено(ПараметрыЗапроса.Сертификат) Тогда
				ПарольСертификата = ОбменССистемойМаркировкиСервер.ПолучитьПарольСертификата(ПараметрыЗапроса.Сертификат);
			КонецЕсли;
			УстановитьПривилегированныйРежим(Ложь);
			
			ДвоичныеДанныеСтроки = ПолучитьДвоичныеДанныеИзСтроки(ПараметрыАвторизации.Данные);
			ДанныеВBase64 = Base64Строка(ДвоичныеДанныеСтроки);
			
			Если НЕ ПарольСертификата = Неопределено Тогда
				
				// Подпишем полученные данные
				Попытка
					Подпись = ОбменССистемойМаркировкиКлиентСервер.ПодписатьДанные(
							ДанныеВBase64,
							ПараметрыЗапроса.ОтпечатокСертификата,
							ПарольСертификата,
							Ложь);
				Исключение
					НоваяСтрока = Новый Структура;
					НоваяСтрока.Вставить("Организация",             Выборка.Организация);
					НоваяСтрока.Вставить("ПодразделениеКомпании",   Выборка.ПодразделениеКомпании);
					//НоваяСтрока.Вставить("ТипТокена",               Выборка.ТипТокена);
					//НоваяСтрока.Вставить("ИдентификаторСоединения", Выборка.ИдентификаторСоединения);
					НоваяСтрока.Вставить("ПарольСертификата",       ПарольСертификата);
					НоваяСтрока.Вставить("ПараметрыАвторизации",    ПараметрыАвторизации);
					НоваяСтрока.Вставить("ПараметрыЗапроса",        ПараметрыЗапроса);
					НоваяСтрока.Вставить("БылаПопыткаПодписиНаСервере", Истина);
					Результат.Добавить(НоваяСтрока);
					Продолжить;
				КонецПопытки;
				
				ПолучениеКлюча = Новый Структура("КлючСессииПолучен,ТекстОшибки", Ложь, "");
				
				ОбменССистемойМаркировкиСервер.УстановитьПолученныйКлючСессии(
						Выборка.Организация,
						Выборка.ПодразделениеКомпании,
						ПолучениеКлюча,
						ПараметрыЗапроса,
						ПараметрыАвторизации,
						Подпись);
					
				Если ПолучениеКлюча.КлючСессииПолучен Тогда
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru='Для организации %1 получен токен'"), Строка(Выборка.Организация)));
				Иначе
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru='Ошибка получения токена. Организация %1. Ошибка %2'"), Строка(Выборка.Организация), ПолучениеКлюча.ТекстОшибки));
				КонецЕсли;
					
				Продолжить;
				
			КонецЕсли;
			
			НоваяСтрока = Новый Структура;
			НоваяСтрока.Вставить("Организация",             Выборка.Организация);
			НоваяСтрока.Вставить("ПодразделениеКомпании",   Выборка.ПодразделениеКомпании);
			//НоваяСтрока.Вставить("ТипТокена",               Выборка.ТипТокена);
			//НоваяСтрока.Вставить("ИдентификаторСоединения", Выборка.ИдентификаторСоединения);
			НоваяСтрока.Вставить("ПарольСертификата",       ПарольСертификата);
			НоваяСтрока.Вставить("ПараметрыАвторизации",    ПараметрыАвторизации);
			НоваяСтрока.Вставить("ПараметрыЗапроса",        ПараметрыЗапроса);
			НоваяСтрока.Вставить("БылаПопыткаПодписиНаСервере", Ложь);
			
			Результат.Добавить(НоваяСтрока);
			
		Иначе
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru='Ошибка авторизации в сервисе честного знака. Организация %1. Текст ошибки %2'"), Строка(Выборка.Организация), ПараметрыАвторизации.ТекстОшибки));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьПолученныйКлючСессии(Организация, ПодразделениеКомпании, Результат, ПараметрыЗапроса, ПараметрыАвторизации, Подпись)
	
	ОбменССистемойМаркировкиВызовСервера.УстановитьПолученныйКлючСессии(Организация,
		ПодразделениеКомпании,
		Результат,
		ПараметрыЗапроса,
		ПараметрыАвторизации,
		Подпись);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьНовыеТокены(Команда)
	
	ПросроченныеТокены = ПолучитьПросроченныеТокеныНаСервере();
	
	КоличествоЗапросов = ПросроченныеТокены.Количество()-1;
	Пока КоличествоЗапросов>=0 Цикл
		
		ПараметрыЗапросаТокена = ПросроченныеТокены[КоличествоЗапросов];
		Если НЕ ПараметрыЗапросаТокена.БылаПопыткаПодписиНаСервере Тогда
			КоличествоЗапросов = КоличествоЗапросов - 1;
			Продолжить;
		КонецЕсли;
		
		ДвоичныеДанныеСтроки = ПолучитьДвоичныеДанныеИзСтроки(ПараметрыЗапросаТокена.ПараметрыАвторизации.Данные);
		ДанныеВBase64 = Base64Строка(ДвоичныеДанныеСтроки);
			
			// Подпишем полученные данные
		Попытка
			Подпись = ОбменССистемойМаркировкиКлиентСервер.ПодписатьДанные(
				ДанныеВBase64,
				ПараметрыЗапросаТокена.ПараметрыЗапроса.ОтпечатокСертификата,
				ПараметрыЗапросаТокена.ПарольСертификата,
				Ложь);
		Исключение
			ВывестиСообщение(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КоличествоЗапросов = КоличествоЗапросов - 1;
			Продолжить;
		КонецПопытки;
		
		ПолучениеКлюча = Новый Структура("КлючСессииПолучен,ТекстОшибки", Ложь, "");
		
		УстановитьПолученныйКлючСессии(
			ПараметрыЗапросаТокена.Организация,
			ПараметрыЗапросаТокена.ПодразделениеКомпании,
			ПолучениеКлюча,
			ПараметрыЗапросаТокена.ПараметрыЗапроса,
			ПараметрыЗапросаТокена.ПараметрыАвторизации,
			Подпись);
		
		Если ПолучениеКлюча.КлючСессииПолучен Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru='Для организации %1 получен токен'"), Строка(ПараметрыЗапросаТокена.Организация)));
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru='Ошибка получения токена. Организация %1. Ошибка %2'"), Строка(ПараметрыЗапросаТокена.Организация), ПолучениеКлюча.ТекстОшибки));
		КонецЕсли;
		
		ПросроченныеТокены.Удалить(ПараметрыЗапросаТокена);
		
		КоличествоЗапросов = КоличествоЗапросов - 1;
		
	КонецЦикла;
	
	ОбновитьОтображениеДанных(Элементы.Список);
	
	Для Каждого ПараметрыЗапросаТокена Из ПросроченныеТокены Цикл
		
		ПараметрыПодписи = ЭлектроннаяПодписьКлиент.ПараметрыCMS();
		ПараметрыПодписи.Открепленная = Ложь; // Для авторизации она должна быть прикрепленной
		
		РезультатПодписания = Новый Структура;
		РезультатПодписания.Вставить("ДанныеАвторизации", ПараметрыЗапросаТокена.ПараметрыАвторизации);
		РезультатПодписания.Вставить("СвойстваПодписи",   Неопределено);
		
		ДанныеАвторизации = Новый Структура();
		ДанныеАвторизации.Вставить("Данные",       ПараметрыЗапросаТокена.ПараметрыАвторизации.Данные);
		ДанныеАвторизации.Вставить("ПараметрыCMS", ПараметрыПодписи);
		ДанныеАвторизации.Вставить("Сообщение",    РезультатПодписания);
		
		ОтборСертификатов = Новый Массив;
		ОтборСертификатов.Добавить(ПараметрыЗапросаТокена.ПараметрыЗапроса.Сертификат);
		
		ОписаниеДанных = Новый Структура();
		ОписаниеДанных.Вставить("Операция", НСтр("ru = 'Подписание данных аутентификации'"));
		ОписаниеДанных.Вставить("ОтборСертификатов", ОтборСертификатов);
		ОписаниеДанных.Вставить("НаборДанных", Новый Массив);
		ОписаниеДанных.НаборДанных.Добавить(Новый Структура("Данные", ДанныеАвторизации));
		ОписаниеДанных.Вставить("ПоказатьКомментарий", Ложь);
		ОписаниеДанных.Вставить("ЗаголовокДанных",     "");
		ОписаниеДанных.Вставить("ПредставлениеНабора",
			НСтр("ru = 'Данные аутентификации для обмена с системой маркировки'")
		);
		
		ПараметрыЗапросаТокена.Вставить("ПодписатьДанныеЗапроса");
		ПараметрыЗапросаТокена.Вставить("УИД", ПараметрыЗапросаТокена.ПараметрыАвторизации.УИД);
		ПараметрыЗапросаТокена.Вставить("Форма", УникальныйИдентификатор);
		//ПараметрыЗапросаТокена.Вставить("ТочкаВхода", ТочкаВхода);
		ОбработчикОповещения = Новый ОписаниеОповещения(
			"ПодписаниеДанныхАвторизацииЗавершение", ЭтотОбъект, ПараметрыЗапросаТокена);
		
		ЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных, УникальныйИдентификатор, ОбработчикОповещения);
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура подписания данных аутетификации
//
// Параметры:
//  РезультатПодписания		 - Структура - Данные, полученные после подписания сертификатом
//  ДополнительныеПараметры	 - Структура - Данные, по которым формируется подписание.
//
&НаКлиенте
Процедура ПодписаниеДанныхАвторизацииЗавершение(РезультатПодписания, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатПодписания.Успех Тогда
		ВывестиСообщение(
			НСтр("ru = 'Данные для аутентификации в системе маркировки не подписаны. Операция отменена.'"),
			ДополнительныеПараметры.Форма);
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(РезультатПодписания.ТекущийЭлементНабораДанных.СвойстваПодписи) = Тип("Строка")
		И ЭтоАдресВременногоХранилища(РезультатПодписания.ТекущийЭлементНабораДанных.СвойстваПодписи) Тогда
		СвойстваПодписи = ПолучитьИзВременногоХранилища(РезультатПодписания.ТекущийЭлементНабораДанных.СвойстваПодписи);
		ПодписьДанныхАутентификации = Base64Строка(СвойстваПодписи.Подпись);
	Иначе
		ПодписьДанныхАутентификации = Base64Строка(РезультатПодписания.ТекущийЭлементНабораДанных.СвойстваПодписи.Подпись);
	КонецЕсли;
	
	ПолучениеКлюча = Новый Структура("КлючСессииПолучен,ТекстОшибки", Ложь, "");
	
	УстановитьПолученныйКлючСессии(
			ДополнительныеПараметры.Организация,
			ДополнительныеПараметры.ПодразделениеКомпании,
			ПолучениеКлюча,
			ДополнительныеПараметры.ПараметрыЗапроса,
			ДополнительныеПараметры.ПараметрыАвторизации,
			ПодписьДанныхАутентификации);
		
	Если ПолучениеКлюча.КлючСессииПолучен Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru='Для организации %1 получен токен'"), Строка(ДополнительныеПараметры.Организация)));
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru='Ошибка получения токена. Организация %1. Ошибка %2'"), Строка(ДополнительныеПараметры.Организация), ПолучениеКлюча.ТекстОшибки));
	КонецЕсли;
	
	ОбновитьОтображениеДанных(Элементы.Список);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

