
// Общий модуль "Ценообразование сервер"

// Функция возвращает цену товара.
//
// Параметры:
//	ТипЦен       - СправочникСсылка - Тип цены
//	Номенклатура - СправочникСсылка  - Товар
//	НаМомент     - Дата				 - Момент времени
//	Контрагент   - СправочникСсылка	 - Контрагент
//	Валюта       - СправочникСсылка  - Валюта
//	Курс         - Число			 - Курс валюты
//	ХарактеристикаНоменклатуры	- СправочникСсылка  - Характеристика номенклатуры
//	ЕдиницаИзмерения			- СправочникСсылка  - Единица измерения номенклатуры
//	ПодразделениеКомпании		- СправочникСсылка  - Подразделение компании.
//
// Возвращаемое значение:
//	Число - Цена товара
//
Функция ПолучитьЦену(ТипЦен,Номенклатура,Знач НаМомент=Неопределено, Знач Контрагент=Неопределено,Валюта=Неопределено,Курс=0, Знач ХарактеристикаНоменклатуры=Неопределено, Знач ЕдиницаИзмерения=Неопределено, Знач ПодразделениеКомпании=Неопределено, ПолучитьЦенуБазовойЕдиницы=Истина, ДоговорВзаиморасчетов=Неопределено) Экспорт
	
	Цена=0;
	
	Если НЕ ЗначениеЗаполнено(ТипЦен) ИЛИ НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат 0;
	КонецЕсли;
	
	// определим на какой момент получаем цену
	Если НаМомент=Неопределено Тогда
		НаМомент=КонецДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	// проверим, а не на документ ли получаем цену
	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(НаМомент)) Тогда
		
		// Если документ еще не записан, то получим цену на дату документа, иначе на момент времени.
		Если НЕ ЗначениеЗаполнено(НаМомент) Тогда
			НаМомент = КонецДня(ТекущаяДатаСеанса());
		Иначе
			НаМомент = НаМомент.МоментВремени();
		КонецЕсли;
	КонецЕсли;
	
	// если тип цен - расчетный, то рассчитаем цену
	Если ТипЦен.Рассчитывается Тогда
		
		// Проверим, указан ли процент наценки для данного типа номенклатуры.
		Запрос=Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ТипыЦенПроцентыСкидкиНаценки.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
		|	1 КАК ПолеСортировки,
		|	ТипыЦенПроцентыСкидкиНаценки.БазовыйТипЦен КАК БазовыйТипЦен
		|ИЗ
		|	Справочник.ТипыЦен.ПроцентыСкидкиНаценки КАК ТипыЦенПроцентыСкидкиНаценки
		|ГДЕ
		|	ТипыЦенПроцентыСкидкиНаценки.Ссылка = &ТипЦен
		|	И ТипыЦенПроцентыСкидкиНаценки.ЦеноваяГруппа = &ЦеноваяГруппа
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТипыЦенПроцентыСкидкиНаценки.ПроцентСкидкиНаценки,
		|	2,
		|	ТипыЦенПроцентыСкидкиНаценки.БазовыйТипЦен
		|ИЗ
		|	Справочник.ТипыЦен.ПроцентыСкидкиНаценки КАК ТипыЦенПроцентыСкидкиНаценки
		|ГДЕ
		|	ТипыЦенПроцентыСкидкиНаценки.Ссылка = &ТипЦен
		|	И ТипыЦенПроцентыСкидкиНаценки.ЦеноваяГруппа = ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка)
		|	И ТипыЦенПроцентыСкидкиНаценки.БазовыйТипЦен <> ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТипыЦен.ПроцентСкидкиНаценки,
		|	3,
		|	ТипыЦен.БазовыйТипЦен
		|ИЗ
		|	Справочник.ТипыЦен КАК ТипыЦен
		|ГДЕ
		|	ТипыЦен.Ссылка = &ТипЦен
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПолеСортировки";
		
		Запрос.УстановитьПараметр("ТипЦен",ТипЦен);
		Запрос.УстановитьПараметр("ЦеноваяГруппа",Номенклатура.ЦеноваяГруппа);
		
		Если НЕ ЗначениеЗаполнено(Валюта) Тогда
			Валюта = РаботаСКурсамиВалютПлатформа.ВалютаТипаЦены(ТипЦен, Номенклатура, Истина);
			
			СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, НаМомент);
			Курс           = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		КонецЕсли;
		
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПроцентСкидкиНаценки = Выборка.ПроцентСкидкиНаценки;
			БазоваяЦена=ПолучитьЦену(Выборка.БазовыйТипЦен,Номенклатура,НаМомент,Контрагент,Валюта,Курс,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,ПодразделениеКомпании,ПолучитьЦенуБазовойЕдиницы);
		Иначе
			ПроцентСкидкиНаценки = ТипЦен.ПроцентСкидкиНаценки;
			БазоваяЦена=ПолучитьЦену(ТипЦен.БазовыйТипЦен,Номенклатура,НаМомент,Контрагент,Валюта,Курс,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,ПодразделениеКомпании,ПолучитьЦенуБазовойЕдиницы);
		КонецЕсли;
		
		// получим цену базового типа
		Если БазоваяЦена=0 Тогда
			Возврат 0;
		КонецЕсли;
		
		// рассчитаем цену
		Цена = БазоваяЦена+(БазоваяЦена*ПроцентСкидкиНаценки/100);
		
	Иначе
		
		АлгоритмРасчетаЦены = ?(ТипЦен.АлгоритмПолученияЦены.Пустая(), Перечисления.АлгоритмПолученияЦены.ПоНоменклатуре, ТипЦен.АлгоритмПолученияЦены);
		УчетЦенТолькоВРазрезеДопПараметров = Номенклатура.ТипНоменклатуры.УчетЦенТолькоВРазрезеДопПараметров;
		
		Контрагент                 = ?(Контрагент=Неопределено, Справочники.Контрагенты.ПустаяСсылка(), Контрагент);
		ДоговорВзаиморасчетов      = ?(ДоговорВзаиморасчетов=Неопределено, Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка(), ДоговорВзаиморасчетов);
		ХарактеристикаНоменклатуры = ?(ХарактеристикаНоменклатуры=Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ХарактеристикаНоменклатуры);
		ЕдиницаИзмерения           = ?(ЕдиницаИзмерения=Неопределено, Справочники.ЕдиницыИзмерения.ПустаяСсылка(), ЕдиницаИзмерения);
		
		// Работа с подразделениями отличается. Т.к. в документах назначающих цену (Установка цен, Поступление ТМЦ и проч.)
		// подразделение берется из шапки, то фактически в регистре сведений "Цены", для типа цен, поддерживающего учет
		// в разрезе подразделений, не может быть записей в пустыми подразделениями. Чтобы назначить цену для всех
		// подразделений, необходимо в шапке документа выбрать корневое подразделение. Записи с пустыми подразделениями
		// могут быть только в одном случае - если после внедрения нового ценообразования не выполнялось перепроведение
		// документов (что, конечно, будет у всех клиентов). Но в этом случае, мы считаем, что пустое значение подразделения
		// соответствует корневому подразделению.
		Если ПодразделениеКомпании=Неопределено Или ПодразделениеКомпании.Пустая() Тогда
			ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		ДопУсловия = "";
		МассивПодразделений = Новый Массив;
		
		ТекстЗапросаНачало = "";
		
		// Необходимо добавить дополнительное поле, для выполнения сортировки.
		// Предполагаем, что большим приоритетом пользуются записи, дополнительные характеристики которых совпадают с 
		// доп. характеристиками переданными в функцию. Затем идут записи, у которых доп. характеристики - пустые значения.
		Если АлгоритмРасчетаЦены=Перечисления.АлгоритмПолученияЦены.ПоХарактеристике Тогда
			ТекстЗапросаНачало = ТекстЗапросаНачало + " 
			|ВЫБОР
			|	КОГДА ХарактеристикаНоменклатуры=&ХарактеристикаНоменклатуры ТОГДА 0
			|	ИНАЧЕ 1 КОНЕЦ";
		ИначеЕсли АлгоритмРасчетаЦены=Перечисления.АлгоритмПолученияЦены.ПоЕдиницеИзмерения Тогда
			ТекстЗапросаНачало = ТекстЗапросаНачало + " 
			|ВЫБОР
			|	КОГДА ЕдиницаИзмерения=&ЕдиницаИзмерения ТОГДА 0
			|	ИНАЧЕ 1 КОНЕЦ";
		Иначе
			ТекстЗапросаНачало = ТекстЗапросаНачало + "
			|	0";
		КонецЕсли;
		
		ТекстЗапросаНачало = ТекстЗапросаНачало + " + ВЫБОР";
		
		// Сформируем отбор и сортировку по подразделению
		ТекущееПодразделение = ПодразделениеКомпании;
		ПеременнаяЦикла = 0;
		Пока Истина Цикл
			
			// Отбор подразделений
			МассивПодразделений.Добавить(ТекущееПодразделение);
			
			// Сортировка подразделений
			ТекстЗапросаНачало = ТекстЗапросаНачало + "
			|	КОГДА ЦеныСрезПоследних.ПодразделениеКомпании = &Подразделение"+ПеременнаяЦикла+"
			|		ТОГДА "+ПеременнаяЦикла;
			
			Запрос.УстановитьПараметр("Подразделение"+ПеременнаяЦикла,ТекущееПодразделение);
			
			// Получаем родителя подразделения
			ТекущееПодразделение = ТекущееПодразделение.Родитель;
			Если НЕ ЗначениеЗаполнено(ТекущееПодразделение) Тогда
				
				// Добавим пустое подразделение
				ПеременнаяЦикла = ПеременнаяЦикла + 1;
				ТекущееПодразделение = Справочники.ПодразделенияКомпании.ПустаяСсылка();
				МассивПодразделений.Добавить(ТекущееПодразделение);
				
				ТекстЗапросаНачало = ТекстЗапросаНачало + "
				|	КОГДА ЦеныСрезПоследних.ПодразделениеКомпании = &Подразделение"+ПеременнаяЦикла+"
				|		ТОГДА "+ПеременнаяЦикла;
				
				Запрос.УстановитьПараметр("Подразделение"+ПеременнаяЦикла,ТекущееПодразделение);
				
				Прервать;
			КонецЕсли;
			
			ПеременнаяЦикла = ПеременнаяЦикла + 1;
		КонецЦикла;
			
		ТекстЗапросаНачало = ТекстЗапросаНачало + "
		|	ИНАЧЕ 999
		|КОНЕЦ";
		
		Запрос.УстановитьПараметр("МассивПодразделений",МассивПодразделений);
		
		// Сформируем текст с дополнительными условиями для виртуальной таблицы "СрезПоследних".
		Если АлгоритмРасчетаЦены=Перечисления.АлгоритмПолученияЦены.ПоХарактеристике Тогда
			Если УчетЦенТолькоВРазрезеДопПараметров Тогда
				Если ХарактеристикаНоменклатуры.Пустая() Тогда
					Возврат 0;
				Иначе
					ДопУсловия = "
					|	И (ХарактеристикаНоменклатуры=&ХарактеристикаНоменклатуры)";
				КонецЕсли;
			Иначе
				Если ХарактеристикаНоменклатуры.Пустая() Тогда
					ДопУсловия = "
					|	И (ХарактеристикаНоменклатуры=ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))";
				Иначе
					ДопУсловия = "
					|	И (ХарактеристикаНоменклатуры=&ХарактеристикаНоменклатуры ИЛИ ХарактеристикаНоменклатуры=ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли АлгоритмРасчетаЦены=Перечисления.АлгоритмПолученияЦены.ПоЕдиницеИзмерения Тогда
			Если УчетЦенТолькоВРазрезеДопПараметров Тогда
				Если ЕдиницаИзмерения.Пустая() Тогда
					Возврат 0;
				Иначе
					ДопУсловия = "
					|	И (ЕдиницаИзмерения=&ЕдиницаИзмерения)";
				КонецЕсли;
			Иначе
				Если ЕдиницаИзмерения.Пустая() Тогда
					ДопУсловия = "
					|	И (ЕдиницаИзмерения=ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))";
				Иначе
					ДопУсловия = "
					|	И (ЕдиницаИзмерения=&ЕдиницаИзмерения ИЛИ ЕдиницаИзмерения=ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Сформируем условие отбора 
		ТекстЗапросаДоговораВзаиморасчетов = "";
		ПолеСортировкиПоДоговоруВзаиморасчетов = "";
		Если НЕ ДоговорВзаиморасчетов.Пустая() Тогда
			ТекстЗапросаДоговораВзаиморасчетов = "ВЫБОР КОГДА ЦеныСрезПоследних.ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов
												|	ТОГДА 1
												|ИНАЧЕ 2 КОНЕЦ КАК ПорядокДоговорВзаиморасчетов,";
			МассивДоговоров = Новый Массив;
			МассивДоговоров.Добавить(ДоговорВзаиморасчетов);
			МассивДоговоров.Добавить(Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка());
			ДопУсловия = ДопУсловия + "
					|	И ДоговорВзаиморасчетов В (&МассивДоговоров)";
			ПолеСортировкиПоДоговоруВзаиморасчетов = "ПорядокДоговорВзаиморасчетов, ";
			Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", ДоговорВзаиморасчетов);
			Запрос.УстановитьПараметр("МассивДоговоров",       МассивДоговоров);
		Иначе
			ДопУсловия = ДопУсловия + "
					|	И ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)";
		КонецЕсли;
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЦеныСрезПоследних.Цена КАК Цена,
		|	ВЫБОР
		|		КОГДА ЦеныСрезПоследних.ЕдиницаИзмерения=ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) ТОГДА 1
		|		ИНАЧЕ ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент
		|	КОНЕЦ КАК Коэффициент,
		|	"+ТекстЗапросаДоговораВзаиморасчетов+"
		|" + ТекстЗапросаНачало + " КАК ПолеДляСортировки
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(&Момент,
		|	ТипЦен=&ТипЦен
		|	И Номенклатура=&Номенклатура " + ДопУсловия + "
		|	И Контрагент=&Контрагент
		|	И ПодразделениеКомпании В (&МассивПодразделений)) КАК ЦеныСрезПоследних
		|ГДЕ"+ТекстЗапросаНачало+" < 999
		|	И ЦеныСрезПоследних.Цена <> 0
		|
		|УПОРЯДОЧИТЬ ПО "+ПолеСортировкиПоДоговоруВзаиморасчетов+"ПолеДляСортировки";
		
		Запрос.УстановитьПараметр("ТипЦен",                     ТипЦен);
		Запрос.УстановитьПараметр("Номенклатура",               Номенклатура);
		Запрос.УстановитьПараметр("Момент",                     НаМомент);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
		Запрос.УстановитьПараметр("ЕдиницаИзмерения",           ЕдиницаИзмерения);
		Запрос.УстановитьПараметр("ПодразделениеКомпании",      ПодразделениеКомпании);
		Запрос.УстановитьПараметр("Контрагент",                 Контрагент);
		
		Коэффициент = 1;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Цена = Выборка.Цена;
			Коэффициент = Выборка.Коэффициент;
			
		ИначеЕсли Контрагент.Пустая() Тогда
			
			// Значим ищем наиболее свежую цену произвольного поставщика.
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ЦеныСрезПоследних.Цена КАК Цена,
			|	ВЫБОР
			|		КОГДА ЦеныСрезПоследних.ЕдиницаИзмерения=ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) ТОГДА 1
			|		ИНАЧЕ ЦеныСрезПоследних.ЕдиницаИзмерения.Коэффициент
			|	КОНЕЦ КАК Коэффициент,
			|	"+ТекстЗапросаНачало+" КАК ПолеДляСортировки
			|ИЗ
			|	РегистрСведений.Цены.СрезПоследних(&Момент,ТипЦен=&ТипЦен И Номенклатура=&Номенклатура " + ДопУсловия + " И ПодразделениеКомпании В (&МассивПодразделений)) КАК ЦеныСрезПоследних
			|ГДЕ" + ТекстЗапросаНачало + " < 999
			|	И ЦеныСрезПоследних.Цена <> 0
			|
			|УПОРЯДОЧИТЬ ПО ЦеныСрезПоследних.Период УБЫВ, ПолеДляСортировки";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Цена = Выборка.Цена;
				Коэффициент = Выборка.Коэффициент;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПолучитьЦенуБазовойЕдиницы И АлгоритмРасчетаЦены=Перечисления.АлгоритмПолученияЦены.ПоЕдиницеИзмерения Тогда
			Цена = ?(Коэффициент=0,Цена,Цена/Коэффициент);
		КонецЕсли; 
		
		// Если указана валюта, то пересчитаем цену в нее
		ВалютаТипаЦены = РаботаСКурсамиВалютПлатформа.ВалютаТипаЦены(ТипЦен, Номенклатура, Истина);
		Если ЗначениеЗаполнено(Валюта) И Валюта <> ВалютаТипаЦены Тогда
			Цена = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(Цена,ВалютаТипаЦены,НаМомент,Валюта,?(Курс=0,НаМомент,Курс));
		КонецЕсли;
	КонецЕсли;
	
	// Округлим цену.
	Если ТипЦен.ОкруглятьВБольшуюСторону Тогда
		Цена = Окр(Цена,ТипЦен.Точность,1);
	Иначе
		Цена = Окр(Цена,ТипЦен.Точность,0);
	КонецЕсли;
	
	Возврат Цена;
	
КонецФункции // ПолучитьЦену()

Процедура ОтразитьНаценки(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНаценки;
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДвиженияНаценки            = Движения.Наценки;
	ДвиженияНаценки.Записывать = Истина;
	
	ДвиженияНаценки.Загрузить(Таблица);
	
КонецПроцедуры

//Функция ПолучитьТекстИерархииНоменклатуры(Номенклатура) Экспорт
//	
//	Если ТипЗнч(Номенклатура) = Тип("Массив") Тогда
//		ОтборНоменклатуры = Номенклатура;
//	Иначе
//		ОтборНоменклатуры = Новый Массив;
//		ОтборНоменклатуры.Добавить(Номенклатура);
//	КонецЕсли;
//	
//	ТекстЗапроса = "
//	
//	|ВЫБРАТЬ
//	|	ТаблицаНоменклатуры.Ссылка КАК Номенклатура,
//	|	ТаблицаНоменклатуры.Родитель КАК Группа
//	|ПОМЕСТИТЬ
//	|	ТаблицаНоменклатуры
//	|ИЗ
//	|	Справочник.Номенкалатура КАК ТаблицаНоменклатуры
//	|ГДЕ
//	|	ТаблицаНоменклатуры.Ссылка В (&ОтборНоменклатуры)
//	|;
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаНоменклатуры.Номенклатура,
//	|	ТаблицаНоменклатуры.Группа
//	|ПОМЕСТИТЬ
//	|	ТаблицаРодителей
//	|ИЗ
//	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
//	|ГДЕ
//	|	(НЕ ТаблицаНоменклатуры.Группа = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
//	|;
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаНоменклатуры.Номенклатура,
//	|	ТаблицаНоменклатуры.Номенклатура,
//	|	0
//	|ИЗ
//	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ТаблицаРодителей.Номенклатура,
//	|	ТаблицаРодителей.Группа,
//	|	1
//	|ИЗ
//	|	ТаблицаРодителей КАК ТаблицаРодителей
//	|ГДЕ
//	|	(НЕ ТаблицаНоменклатуры.Группа = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	СтруктураИерархииНоменклатуры.Номенклатура,
//	|	СтруктураИерархииНоменклатуры.Группа,
//	|	СтруктураИерархииНоменклатуры.Порядок
//	|ИЗ
//	|	РегистрСведений.СтруктураИерархииНоменклатуры КАК СтруктураИерархииНоменклатуры
//	|
//		
//	
//КонецФункции

// Получает и загружает рекомендуемые наценки.
//
// Параметры:
//	Номенклатура  - СправочникСсылка - Товар
//	Момент        - Дата			 - Дата, на которую нужно получить наценки 
//	ТипЦен        - СправочникСсылка - Тип цены
//	Объект        - 
//
// Возвращаемое значение:
//	Таблица значений - Таблица рекомендуемых наценок
Функция ЗаполнитьТаблицуНаценок(Номенклатура, Момент = Неопределено, ТипЦен = Неопределено, Объект = Неопределено) Экспорт
	
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	ТаблицаНоменклатуры.Колонки.Добавить("Родитель", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатуры.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	
	ТекРодитель  = Номенклатура;
	Уровень      = 1;
	Пока ЗначениеЗаполнено(ТекРодитель) Цикл
		
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		НоваяСтрока.Родитель = ТекРодитель;
		НоваяСтрока.Уровень  = Уровень;
		
		ТекРодитель = ТекРодитель.Родитель;
		Уровень     = Уровень+1;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Таблица", ТаблицаНоменклатуры);
	
	Если ТипЦен <> Неопределено Тогда
		ТекстОтборПоТипуЦен = " И 
		|	Наценки.ТипЦен = &ТипЦен";
		Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект) Тогда
		ТекстОтборПоРегистратору = " И 
		|	(НЕ Наценки.Регистратор = &Регистратор)";
		Запрос.УстановитьПараметр("Регистратор", Объект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Момент) Тогда
		Запрос.УстановитьПараметр("Момент", Момент);
	Иначе
		Запрос.УстановитьПараметр("Момент", ТекущаяДата());
	КонецЕсли;
	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Таблица.Родитель КАК Родитель,
	|	Таблица.Уровень КАК Уровень
	|ПОМЕСТИТЬ ТаблицаРодителей
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Наценки.Период КАК Период,
	|	Наценки.ТипЦен КАК ТипЦен,
	|	Наценки.Номенклатура КАК Номенклатура,
	|	Наценки.ПроцентНаценки КАК ПроцентНаценки,
	|	ТаблицаРодителей.Уровень КАК Уровень
	|ПОМЕСТИТЬ ТаблицаНаценки
	|ИЗ
	|	ТаблицаРодителей КАК ТаблицаРодителей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Наценки КАК Наценки
	|		ПО ТаблицаРодителей.Родитель = Наценки.Номенклатура" + ТекстОтборПоТипуЦен + "
	|ГДЕ
	|	Наценки.Период <= &Момент" + ТекстОтборПоРегистратору + ТекстОтборПоТипуЦен+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаНаценки.Период) КАК Период,
	|	ТаблицаНаценки.ТипЦен КАК ТипЦен,
	|	ТаблицаНаценки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаНаценкиСрез
	|ИЗ
	|	ТаблицаНаценки КАК ТаблицаНаценки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНаценки.ТипЦен,
	|	ТаблицаНаценки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНаценкиСрез.Период КАК Период,
	|	ТаблицаНаценкиСрез.ТипЦен КАК ТипЦен,
	|	ТаблицаНаценкиСрез.Номенклатура КАК Номенклатура,
	|	ТаблицаНаценки.ПроцентНаценки КАК ПроцентНаценки,
	|	ТаблицаНаценки.Уровень КАК Уровень
	|ПОМЕСТИТЬ ТаблицаТекущиеНаценки
	|ИЗ
	|	ТаблицаНаценкиСрез КАК ТаблицаНаценкиСрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНаценки КАК ТаблицаНаценки
	|		ПО ТаблицаНаценкиСрез.Период = ТаблицаНаценки.Период
	|			И ТаблицаНаценкиСрез.ТипЦен = ТаблицаНаценки.ТипЦен
	|			И ТаблицаНаценкиСрез.Номенклатура = ТаблицаНаценки.Номенклатура
	|ГДЕ
	|	НЕ ТаблицаНаценки.ПроцентНаценки = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТекущиеНаценки.ТипЦен КАК ТипЦен,
	|	МИНИМУМ(ТаблицаТекущиеНаценки.Уровень) КАК Уровень
	|ПОМЕСТИТЬ ТаблицаТекущиеНаценкиСрез
	|ИЗ
	|	ТаблицаТекущиеНаценки КАК ТаблицаТекущиеНаценки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТекущиеНаценки.ТипЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТекущиеНаценки.Период КАК МоментУстановки,
	|	ТаблицаТекущиеНаценкиСрез.ТипЦен КАК ТипЦен,
	|	ТаблицаТекущиеНаценки.Номенклатура КАК ОбъектНаценки,
	|	ТаблицаТекущиеНаценки.ПроцентНаценки КАК ПроцентНаценки
	|ИЗ
	|	ТаблицаТекущиеНаценкиСрез КАК ТаблицаТекущиеНаценкиСрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТекущиеНаценки КАК ТаблицаТекущиеНаценки
	|		ПО ТаблицаТекущиеНаценкиСрез.Уровень = ТаблицаТекущиеНаценки.Уровень
	|			И ТаблицаТекущиеНаценкиСрез.ТипЦен = ТаблицаТекущиеНаценки.ТипЦен";
	
	ТаблицаНаценок = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаНаценок;
	
КонецФункции

// Получает и загружает минимальные наценки.
//
// Параметры:
//	Номенклатура  - СправочникСсылка - Товар
//	Момент        - Дата			 - Дата, на которую нужно получить наценки 
//	ТипЦен        - СправочникСсылка - Тип цены
//	Объект        - 
//
// Возвращаемое значение:
//	Таблица значений - Таблица рекомендуемых наценок
Функция ЗаполнитьТаблицуМинимальныхНаценок(Номенклатура, Момент = Неопределено, ТипЦен = Неопределено, Объект = Неопределено) Экспорт
	
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	ТаблицаНоменклатуры.Колонки.Добавить("Родитель", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатуры.Колонки.Добавить("Уровень", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	
	ТекРодитель  = Номенклатура;
	Уровень      = 1;
	Пока ЗначениеЗаполнено(ТекРодитель) Цикл
		
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		НоваяСтрока.Родитель = ТекРодитель;
		НоваяСтрока.Уровень  = Уровень;
		
		ТекРодитель = ТекРодитель.Родитель;
		Уровень     = Уровень+1;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Таблица", ТаблицаНоменклатуры);
	
	Если ТипЦен <> Неопределено Тогда
		ТекстОтборПоТипуЦен = " И 
		|	Наценки.ТипЦен = &ТипЦен";
		Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект) Тогда
		ТекстОтборПоРегистратору = " И 
		|	(НЕ Наценки.Регистратор = &Регистратор)";
		Запрос.УстановитьПараметр("Регистратор", Объект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Момент) Тогда
		Запрос.УстановитьПараметр("Момент", Момент);
	Иначе
		Запрос.УстановитьПараметр("Момент", ТекущаяДата());
	КонецЕсли;
	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Таблица.Родитель КАК Родитель,
	|	Таблица.Уровень КАК Уровень
	|ПОМЕСТИТЬ ТаблицаРодителей
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Наценки.Период КАК Период,
	|	Наценки.ТипЦен КАК ТипЦен,
	|	Наценки.Номенклатура КАК Номенклатура,
	|	Наценки.МинимальнаяНаценка КАК МинимальнаяНаценка,
	|	ТаблицаРодителей.Уровень КАК Уровень
	|ПОМЕСТИТЬ ТаблицаНаценки
	|ИЗ
	|	ТаблицаРодителей КАК ТаблицаРодителей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Наценки КАК Наценки
	|		ПО ТаблицаРодителей.Родитель = Наценки.Номенклатура" + ТекстОтборПоТипуЦен + "
	|ГДЕ
	|	Наценки.Период <= &Момент" + ТекстОтборПоРегистратору + ТекстОтборПоТипуЦен+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаНаценки.Период) КАК Период,
	|	ТаблицаНаценки.ТипЦен КАК ТипЦен,
	|	ТаблицаНаценки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаНаценкиСрез
	|ИЗ
	|	ТаблицаНаценки КАК ТаблицаНаценки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНаценки.ТипЦен,
	|	ТаблицаНаценки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНаценкиСрез.Период КАК Период,
	|	ТаблицаНаценкиСрез.ТипЦен КАК ТипЦен,
	|	ТаблицаНаценкиСрез.Номенклатура КАК Номенклатура,
	|	ТаблицаНаценки.МинимальнаяНаценка КАК МинимальнаяНаценка,
	|	ТаблицаНаценки.Уровень КАК Уровень
	|ПОМЕСТИТЬ ТаблицаТекущиеНаценки
	|ИЗ
	|	ТаблицаНаценкиСрез КАК ТаблицаНаценкиСрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНаценки КАК ТаблицаНаценки
	|		ПО ТаблицаНаценкиСрез.Период = ТаблицаНаценки.Период
	|			И ТаблицаНаценкиСрез.ТипЦен = ТаблицаНаценки.ТипЦен
	|			И ТаблицаНаценкиСрез.Номенклатура = ТаблицаНаценки.Номенклатура
	|ГДЕ
	|	НЕ ТаблицаНаценки.МинимальнаяНаценка = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТекущиеНаценки.ТипЦен КАК ТипЦен,
	|	МИНИМУМ(ТаблицаТекущиеНаценки.Уровень) КАК Уровень
	|ПОМЕСТИТЬ ТаблицаТекущиеНаценкиСрез
	|ИЗ
	|	ТаблицаТекущиеНаценки КАК ТаблицаТекущиеНаценки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТекущиеНаценки.ТипЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТекущиеНаценки.Период КАК МоментУстановки,
	|	ТаблицаТекущиеНаценкиСрез.ТипЦен КАК ТипЦен,
	|	ТаблицаТекущиеНаценки.Номенклатура КАК ОбъектНаценки,
	|	ТаблицаТекущиеНаценки.МинимальнаяНаценка КАК МинимальнаяНаценка
	|ИЗ
	|	ТаблицаТекущиеНаценкиСрез КАК ТаблицаТекущиеНаценкиСрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТекущиеНаценки КАК ТаблицаТекущиеНаценки
	|		ПО ТаблицаТекущиеНаценкиСрез.Уровень = ТаблицаТекущиеНаценки.Уровень
	|			И ТаблицаТекущиеНаценкиСрез.ТипЦен = ТаблицаТекущиеНаценки.ТипЦен";
	
	ТаблицаНаценок = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаНаценок;
	
КонецФункции

// Функция возвращает процент наценки на товар из справочника "Номенклатура".
//
// Параметры:
//	Номенклатура - СправочникСсылка  - Товар
//
// Возвращаемое значение:
//	Число - Процент наценки
Функция ПолучитьНаценкуНоменклатуры(Номенклатура) Экспорт
	
	Результат = 0;
	
	ТекРодитель = Номенклатура;
	Пока ЗначениеЗаполнено(ТекРодитель) Цикл
		
		Результат = ТекРодитель.ПроцентНаценки;
		
		Если ЗначениеЗаполнено(Результат) Тогда
			Прервать;
		КонецЕсли;
		
		ТекРодитель = ТекРодитель.Родитель;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#Область ТорговыйКомплекс

// Функция возвращает рекомендуемую наценку товара.
//
// Параметры:
//	ТипЦен       - СправочникСсылка - Тип цены
//	Номенклатура - СправочникСсылка  - Товар
//	НаМомент     - Дата				 - Дата начала действия 
//
// Возвращаемое значение:
//	Число - Наценка товара
//
Функция ПолучитьРекомендуемуюНаценку(Номенклатура,НаМомент = Неопределено, ТипЦен = Неопределено, Объект = Неопределено) Экспорт
	
	Наценка = 0;
	
	ТаблицаНаценок = ЗаполнитьТаблицуНаценок(Номенклатура, НаМомент, ТипЦен, Объект);
	
	Если ТаблицаНаценок.Количество() > 0 Тогда
		Наценка = ТаблицаНаценок[0].ПроцентНаценки;
	КонецЕсли;
	
	Возврат Наценка;
	
КонецФункции

// Функция возвращает рекомендуемую наценку товара.
//
// Параметры:
//	ТипЦен       - СправочникСсылка - Тип цены
//	Номенклатура - СправочникСсылка  - Товар
//	НаМомент     - Дата				 - Дата начала действия 
//
// Возвращаемое значение:
//	Число - Наценка товара
//
Функция ПолучитьМинимальнуюНаценку(Номенклатура,НаМомент = Неопределено, ТипЦен = Неопределено, Объект = Неопределено) Экспорт
	
	Наценка = 0;
	
	ТаблицаНаценок = ЗаполнитьТаблицуМинимальныхНаценок(Номенклатура, НаМомент, ТипЦен, Объект);
	
	Если ТаблицаНаценок.Количество() > 0 Тогда
		Наценка = ТаблицаНаценок[0].МинимальнаяНаценка;
	КонецЕсли;
	
	Возврат Наценка;
	
КонецФункции

Функция ПолучитьСогласованныеЦены(ДатаЦен, Контрагент, ПодразделениеКомпании, СписокНоменклатуры, ТаблицаЗаказов=Неопределено) Экспорт
	Если ТаблицаЗаказов<>Неопределено Тогда
		Возврат ТаблицаЗаказов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СпрНоменклатура.Ссылка КАК Номенклатура,
	               |	СтруктураИерархииПодразделений.Группа КАК ПодразделениеКомпании,
	               |	СтруктураИерархииПодразделений.Порядок КАК Порядок
	               |ПОМЕСТИТЬ ТаблицаНоменклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК СпрНоменклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураИерархииПодразделений КАК СтруктураИерархииПодразделений
	               |		ПО (СтруктураИерархииПодразделений.ПодразделениеКомпании = &ПодразделениеКомпании)
	               |ГДЕ
	               |	СпрНоменклатура.Ссылка В(&СписокНоменклатуры)
	               |	И СтруктураИерархииПодразделений.ПодразделениеКомпании = &ПодразделениеКомпании
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаНоменклатура.Номенклатура КАК Номенклатура,
	               |	ТаблицаНоменклатура.Порядок КАК ПорядокПодразделения,
	               |	СогласованныеЦены.Приоритет КАК Приоритет,
	               |	СогласованныеЦены.Период КАК ДатаНачалаДействия,
	               |	СогласованныеЦены.СрокДействия КАК СрокДействия,
	               |	СогласованныеЦены.Регистратор КАК Регистратор,
	               |	СогласованныеЦены.Цена КАК СогласованнаяЦена,
	               |	СогласованныеЦены.ЦенаБезНДС КАК СогласованнаяЦенаБезНДС,
	               |	СогласованныеЦены.ПроцентОтклонения КАК ПроцентОтклонения,
	               |	ВЫБОР
	               |		КОГДА СогласованныеЦены.ПодразделениеКомпании = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ПорядокРегистра
	               |ПОМЕСТИТЬ ТаблицаСогласованныеЦены
	               |ИЗ
	               |	ТаблицаНоменклатура КАК ТаблицаНоменклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
	               |		ПО (ТаблицаНоменклатура.ПодразделениеКомпании = СогласованныеЦены.ПодразделениеКомпании
	               |				ИЛИ ТаблицаНоменклатура.ПодразделениеКомпании.ГруппаПоставки = СогласованныеЦены.ГруппаПоставки)
	               |			И ТаблицаНоменклатура.Номенклатура = СогласованныеЦены.Номенклатура
	               |ГДЕ
	               |	СогласованныеЦены.Контрагент = &Контрагент
	               |	И СогласованныеЦены.СрокДействия >= &Дата
	               |	И СогласованныеЦены.Период <= &Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СогласованныеЦены.Номенклатура КАК Номенклатура,
	               |	СогласованныеЦены.СогласованнаяЦена КАК Цена,
	               |	СогласованныеЦены.СогласованнаяЦенаБезНДС КАК ЦенаБезНДС,
	               |	СогласованныеЦены.ПроцентОтклонения КАК ПроцентОтклонения
	               |ИЗ
	               |	ТаблицаСогласованныеЦены КАК СогласованныеЦены
	               |ГДЕ
	               |	СогласованныеЦены.Регистратор В
	               |			(ВЫБРАТЬ ПЕРВЫЕ 1
	               |				ТаблицаСогласованныеЦены.Регистратор КАК Регистратор
	               |			ИЗ
	               |				ТаблицаСогласованныеЦены КАК ТаблицаСогласованныеЦены
	               |			ГДЕ
	               |				ТаблицаСогласованныеЦены.Номенклатура = СогласованныеЦены.Номенклатура
	               |			УПОРЯДОЧИТЬ ПО
	               |				ТаблицаСогласованныеЦены.ПорядокРегистра,
	               |				ТаблицаСогласованныеЦены.ПорядокПодразделения,
	               |				ТаблицаСогласованныеЦены.Приоритет УБЫВ,
	               |				ТаблицаСогласованныеЦены.ДатаНачалаДействия УБЫВ,
	               |				ТаблицаСогласованныеЦены.СрокДействия)";
	
	Запрос.УстановитьПараметр("Контрагент",            Контрагент);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("СписокНоменклатуры",    СписокНоменклатуры);
	Запрос.УстановитьПараметр("Дата", ДатаЦен);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Индексы.Добавить("Номенклатура");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСогласованнуюЦену(ДатаЦен, Контрагент=Неопределено, ПодразделениеКомпании, Номенклатура) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Цена", 0);
	Результат.Вставить("ЦенаБезНДС", 0);
	Результат.Вставить("ПроцентОтклонения", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктураИерархииПодразделений.Группа КАК ПодразделениеКомпании,
	|	СтруктураИерархииПодразделений.Группа.ГруппаПоставки КАК ГруппаПоставки,
	|	СтруктураИерархииПодразделений.Порядок КАК Порядок
	|ПОМЕСТИТЬ
	|	ТаблицаПодразделений
	|ИЗ
	|	РегистрСведений.СтруктураИерархииПодразделений КАК СтруктураИерархииПодразделений
	|ГДЕ
	|	СтруктураИерархииПодразделений.ПодразделениеКомпании = &ПодразделениеКомпании
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаПодразделений.ГруппаПоставки КАК ГруппаПоставки,
	|	МИНИМУМ(ТаблицаПодразделений.Порядок) КАК Порядок
	|ПОМЕСТИТЬ
	|	ТаблицаГруппПоставки
	|ИЗ
	|	ТаблицаПодразделений КАК ТаблицаПодразделений
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПодразделений.ГруппаПоставки
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	ВложенныйЗапрос.ЦенаБезНДС КАК ЦенаБезНДС,
	|	ВложенныйЗапрос.ПроцентОтклонения КАК ПроцентОтклонения,
	|	ВложенныйЗапрос.ПорядокРегистра КАК ПорядокРегистра
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		СогласованныеЦены.Цена КАК Цена,
	|		СогласованныеЦены.ЦенаБезНДС КАК ЦенаБезНДС,
	|		СогласованныеЦены.ПроцентОтклонения КАК ПроцентОтклонения,
	|		ВЫБОР
	|			КОГДА СогласованныеЦены.ПодразделениеКомпании = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка)
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК ПорядокРегистра
	|	ИЗ
	|		ТаблицаГруппПоставки КАК ТаблицаГруппПоставки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
	|	ПО
	|		ТаблицаГруппПоставки.ГруппаПоставки = СогласованныеЦены.ГруппаПоставки
	|	ГДЕ
	|		"+?(Контрагент = Неопределено, "", "СогласованныеЦены.Контрагент = &Контрагент
	|		И ") + "СогласованныеЦены.Номенклатура = &Номенклатура
	|		И СогласованныеЦены.СрокДействия >= &Дата
	|		И СогласованныеЦены.Период <= &Дата
	|	УПОРЯДОЧИТЬ ПО
	|		ПорядокРегистра,
	|		ТаблицаГруппПоставки.Порядок,
	|		СогласованныеЦены.Приоритет УБЫВ,
	|		СогласованныеЦены.Период УБЫВ,
	|		СогласованныеЦены.СрокДействия) КАК ВложенныйЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	ВложенныйЗапрос.ЦенаБезНДС КАК ЦенаБезНДС,
	|	ВложенныйЗапрос.ПроцентОтклонения КАК ПроцентОтклонения,
	|	ВложенныйЗапрос.ПорядокРегистра КАК ПорядокРегистра
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		СогласованныеЦены.Цена КАК Цена,
	|		СогласованныеЦены.ЦенаБезНДС КАК ЦенаБезНДС,
	|		СогласованныеЦены.ПроцентОтклонения КАК ПроцентОтклонения,
	|		ВЫБОР
	|			КОГДА СогласованныеЦены.ПодразделениеКомпании = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка)
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК ПорядокРегистра
	|	ИЗ
	|		РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаПодразделений КАК ТаблицаПодразделений
	|	ПО
	|		ТаблицаПодразделений.ПодразделениеКомпании = СогласованныеЦены.ПодразделениеКомпании
	|	ГДЕ
	|		"+?(Контрагент = Неопределено, "", "СогласованныеЦены.Контрагент = &Контрагент
	|		И ") + "СогласованныеЦены.Номенклатура = &Номенклатура
	|		И СогласованныеЦены.СрокДействия >= &Дата
	|		И СогласованныеЦены.Период <= &Дата
	|	УПОРЯДОЧИТЬ ПО
	|		ПорядокРегистра,
	|		ТаблицаПодразделений.Порядок,
	|		СогласованныеЦены.Приоритет УБЫВ,
	|		СогласованныеЦены.Период УБЫВ,
	|		СогласованныеЦены.СрокДействия) КАК ВложенныйЗапрос
	|";
	
	//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//               |	СтруктураИерархииПодразделений.Группа КАК ПодразделениеКомпании,
	//               |	СтруктураИерархииПодразделений.Порядок КАК Порядок
	//               |ПОМЕСТИТЬ ТаблицаНоменклатура
	//               |ИЗ
	//               |	РегистрСведений.СтруктураИерархииПодразделений КАК СтруктураИерархииПодразделений
	//               |ГДЕ
	//               |	СтруктураИерархииПодразделений.ПодразделениеКомпании = &ПодразделениеКомпании
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ РАЗРЕШЕННЫЕ //ПЕРВЫЕ 1
	//               |	СогласованныеЦены.Цена КАК Цена,
	//               |	СогласованныеЦены.ЦенаБезНДС КАК ЦенаБезНДС,
	//               |	СогласованныеЦены.ПроцентОтклонения КАК ПроцентОтклонения,
	//               |	ВЫБОР
	//               |		КОГДА СогласованныеЦены.ПодразделениеКомпании = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка)
	//               |			ТОГДА 0
	//               |		ИНАЧЕ 1
	//               |	КОНЕЦ КАК ПорядокРегистра
	//               |ИЗ
	//               |	РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНоменклатура КАК ТаблицаНоменклатура
	//               |		ПО (ТаблицаНоменклатура.ПодразделениеКомпании = СогласованныеЦены.ПодразделениеКомпании
	//               |				ИЛИ ТаблицаНоменклатура.ПодразделениеКомпании.ГруппаПоставки = СогласованныеЦены.ГруппаПоставки)
	//               |ГДЕ
	//               |	"+?(Контрагент = Неопределено, "", "СогласованныеЦены.Контрагент = &Контрагент
	//               |	И ") + "СогласованныеЦены.Номенклатура = &Номенклатура
	//               |	И СогласованныеЦены.СрокДействия >= &Дата
	//               |	И СогласованныеЦены.Период <= &Дата
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	ПорядокРегистра,
	//               |	ТаблицаНоменклатура.Порядок,
	//               |	СогласованныеЦены.Приоритет УБЫВ,
	//               |	СогласованныеЦены.Период УБЫВ,
	//               |	СогласованныеЦены.СрокДействия";
	
	
	
	Запрос.УстановитьПараметр("Контрагент",            Контрагент);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Номенклатура",          Номенклатура);
	Запрос.УстановитьПараметр("Дата",                  ДатаЦен);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТипЦенПодразделения(Объект, ПодразделениеКомпании, ТипЦен = Неопределено) Экспорт
	
	ТипЦенРеализации = ПодразделениеКомпании.ТипЦенРеализации;
	
	Если НЕ ЗначениеЗаполнено(ТипЦенРеализации) И ЗначениеЗаполнено(ТипЦен) Тогда
		ТипЦенРеализации = ТипЦен;
	Иначе
		ТипЦенРеализации = Объект.ТипЦен;
	КонецЕсли;
	
	Возврат ТипЦенРеализации;
	
КонецФункции

Функция ПересчитатьВВалютуРозничнойЦены(Объект, ТипЦенРеализации, Номенклатура, СуммаПересчета) Экспорт
	
	Если СуммаПересчета = 0 Тогда
		Возврат СуммаПересчета;
	КонецЕсли;
	
	ВалютаРозницы  = РаботаСКурсамиВалютПлатформа.ВалютаТипаЦены(ТипЦенРеализации, Номенклатура, Истина);
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРозницы, Объект.Дата);
	КурсРозницы    = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	
	Результат = ?(КурсРозницы = Объект.КурсДокумента, СуммаПересчета, РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаПересчета, Объект.ВалютаДокумента, Объект.КурсДокумента, ВалютаРозницы, КурсРозницы));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
