
#Область ПрограммныйИнтерфейс


#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// См. ГрупповоеИзменениеОбъектовПереопределяемый.ПриОпределенииОбъектовСРедактируемымиРеквизитами.
Процедура ПриОпределенииОбъектовСРедактируемымиРеквизитами(Объекты) Экспорт
	
	Объекты.Вставить(Метаданные.Документы.СчетФактураПолученный.ПолноеИмя(), "РеквизитыНеРедактируемыеВГрупповойОбработке");
	Объекты.Вставить(Метаданные.Документы.СчетФактураВыданный.ПолноеИмя(), "РеквизитыНеРедактируемыеВГрупповойОбработке");
	Объекты.Вставить(Метаданные.Документы.СчетОтПоставщика.ПолноеИмя(), "РеквизитыНеРедактируемыеВГрупповойОбработке");
	Объекты.Вставить(Метаданные.Документы.СчетНаОплату.ПолноеИмя(), "РеквизитыНеРедактируемыеВГрупповойОбработке");
	Объекты.Вставить(Метаданные.Документы.РеализацияТоваров.ПолноеИмя(), "РеквизитыНеРедактируемыеВГрупповойОбработке");
	Объекты.Вставить(Метаданные.Документы.ПоступлениеТоваров.ПолноеИмя(), "РеквизитыНеРедактируемыеВГрупповойОбработке");
	Объекты.Вставить(Метаданные.Документы.ЗаказПоставщику.ПолноеИмя(), "РеквизитыНеРедактируемыеВГрупповойОбработке");
	Объекты.Вставить(Метаданные.Документы.ЗаказПокупателя.ПолноеИмя(), "РеквизитыНеРедактируемыеВГрупповойОбработке");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// См. ПользователиПереопределяемый.ПриУстановкеНачальныхНастроек.
Процедура ПриУстановкеНачальныхНастроек(НачальныеНастройки) Экспорт
	
	Если НачальныеНастройки.Свойство("НастройкиТакси") Тогда
		НачальныеНастройки.НастройкиТакси = НастройкиИнтерфейсаПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

// См. ПользователиПереопределяемый.ПриУстановкеНачальныхНастроек.
Процедура ПослеЗагрузкиДанных(Контейнер) Экспорт
	
	Настройки = НастройкиИнтерфейсаПоУмолчанию();
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", Настройки);
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыПереопределяемый.ПриОпределенииНастроек
Процедура ПриОпределенииНастроекОбновленияИнформационнойБазы(Параметры) Экспорт
КонецПроцедуры

// Используется при добавлении отложенных обработчиков обновления,
// когда не требуется регистрировать данные к обработке. Не заполнять.
// 
// Параметры:
//  Параметры - Структура - параметры.
//
Процедура ЗаполнениеДанныхОбновления(Параметры) Экспорт
КонецПроцедуры

#КонецОбласти


// См. РаботаСКонтрагентамиПереопределяемый.ЗаполнитьИдентификаторКонфигурации.
Процедура ЗаполнитьИдентификаторКонфигурации(ИдентификаторКонфигурации) Экспорт
	
	ИдентификаторКонфигурации = "ClientEDOBase";
	
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиентаПриЗапуске.
Процедура ПараметрыРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	//// _Демо начало примера
	//Параметры.Вставить("ПоказатьНачалоРаботы", Ложь);
	//Возврат;
	//// _Демо конец примера
	//
	//ПоказыватьСтартовыйПомощникКЭДО = Ложь;
	//Если НЕ ОбщегоНазначения.ЭтоМобильныйКлиент()
	//	И ПравоДоступа("Изменение", Метаданные.Справочники.Организации)
	//	И ОбменСКонтрагентами.ЕстьПравоНастройкиОбмена()
	//	И БизнесСеть.ПравоНастройкиОбменаДокументами()
	//	И НЕ СинхронизацияЭДО.ЕстьУчетныеЗаписи() Тогда
	//	
	//	ИспользоватьСервисЭДО = Константы.ИспользоватьОбменЭД.Получить();
	//	НастройкиСтартовогоПомощникаКЭДО = ПолучитьНастройкиСтартовогоПомощникаКЭДО();
	//	
	//	БольшеНеПоказывать = Ложь;
	//	УслугаOnboarding   = Ложь;
	//	Если ЗначениеЗаполнено(НастройкиСтартовогоПомощникаКЭДО) Тогда
	//		Если НастройкиСтартовогоПомощникаКЭДО.Свойство("БольшеНеПоказывать") Тогда
	//			БольшеНеПоказывать = НастройкиСтартовогоПомощникаКЭДО.БольшеНеПоказывать;
	//		КонецЕсли;
	//		Если НастройкиСтартовогоПомощникаКЭДО.Свойство("УслугаOnboarding") Тогда
	//			УслугаOnboarding = НастройкиСтартовогоПомощникаКЭДО.УслугаOnboarding;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	ЕстьОрганизации = ЕстьОрганизацииВБазе();
	//	
	//	Если НЕ БольшеНеПоказывать И ((ЕстьОрганизации И УслугаOnboarding
	//		ИЛИ ИспользоватьСервисЭДО) ИЛИ НЕ ЕстьОрганизации) Тогда
	//		ПоказыватьСтартовыйПомощникКЭДО = Истина;
	//	КонецЕсли;
	//	
	//	Параметры.Вставить("ПоказыватьСтартовыйПомощникКЭДО", ПоказыватьСтартовыйПомощникКЭДО);
	//	
	//КонецЕсли;
	//	
	//Если НЕ ПоказыватьСтартовыйПомощникКЭДО Тогда
	//	ПоказатьНачалоРаботы = Не ОбщегоНазначения.РазделениеВключено()
	//		И НЕ Константы.ЛицензионноеСоглашениеПринято.Получить();
	//	Параметры.Вставить("ПоказатьНачалоРаботы", ПоказатьНачалоРаботы);
	//КонецЕсли;
	
КонецПроцедуры

// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Процедура ПриОпределенииОбъектовСЗаблокированнымиРеквизитами(Объекты) Экспорт
	
	Объекты.Вставить(Метаданные.Справочники.Номенклатура.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.ТипыНоменклатуры.ПолноеИмя(), "");
	
КонецПроцедуры

// См. ЭлектроннаяПодписьПереопределяемый.ПриЗаполненииРеквизитовОрганизацииВЗаявленииНаСертификат.
Процедура ПриЗаполненииРеквизитовОрганизацииВЗаявленииНаСертификат(Параметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Параметры.Организация) Тогда
		Параметры.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		Если НЕ ЗначениеЗаполнено(Параметры.Организация) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Сведения = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	СведенияОбОрганизации = ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Параметры.Организация, Сведения);
	
	
	Параметры.ЭтоИндивидуальныйПредприниматель = Сведения.ЮрФизЛицо = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель
		ИЛИ Сведения.ЮрФизЛицо = Перечисления.ФормыСобственности.ЧастноеЛицо;
	
	Параметры.НаименованиеСокращенное = Сведения.СокращенноеНаименование;
	Параметры.НаименованиеПолное      = Сведения.ОфициальноеНаименование;
	Параметры.ИНН                     = Сведения.ИНН;
	Параметры.КПП                     = Сведения.КПП;
	Параметры.ОГРН                    = Сведения.ОГРН;
	Параметры.РасчетныйСчет           = Сведения.НомерСчета;
	Параметры.БИК                     = Сведения.БИК;
	Параметры.КорреспондентскийСчет   = Сведения.КоррСчет;
	Параметры.ЮридическийАдрес        = Сведения.ЮридическийАдресXML;
	Параметры.ФактическийАдрес        = ?(ЗначениеЗаполнено(Сведения.ФактическийАдресXML),
		Сведения.ФактическийАдресXML, Сведения.ЮридическийАдресXML);
	Параметры.Телефон                 = Сведения.ТелефоныXML;
	
КонецПроцедуры

// См. ЭлектроннаяПодписьПереопределяемый.ПередНачаломРедактированияСертификатаКлюча.
Процедура ПередНачаломРедактированияСертификатаКлюча(Ссылка, Сертификат, ПараметрыРеквизитов) Экспорт
	
	Свойства = ЭлектроннаяПодпись.СвойстваСубъектаСертификата(Сертификат);
	
	ИНН = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Свойства, "ИННЮЛ", "");
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		ИНН = Свойства.ИНН;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Свойства.Организация)
		Или Не ЗначениеЗаполнено(ИНН) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитОрганизация = ПараметрыРеквизитов.Добавить();
	РеквизитОрганизация.ИмяРеквизита = "Организация";
	РеквизитОрганизация.Видимость = Истина;
	РеквизитОрганизация.ПроверкаЗаполнения = Истина;
	
	Если СтрНачинаетсяС(ИНН, "00") Тогда
		ИНН = Сред(ИНН, 3);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ИНН = &ИНН";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		РеквизитОрганизация.ЗначениеЗаполнения = Выборка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

// См. УправлениеСвойствамиПереопределяемый.ЗаполнитьНаборыСвойствОбъекта.
Процедура ЗаполнитьНаборыСвойствОбъекта(Объект, ТипСсылки, НаборыСвойств, СтандартнаяОбработка, КлючНазначения) Экспорт
	
	Если ТипСсылки=Тип("СправочникСсылка.Номенклатура") И НЕ Объект.ЭтоГруппа Тогда
		УправлениеСвойствамиПлатформа.ПолучитьНаборыСвойствДляНоменклатуры(Объект, ТипСсылки, НаборыСвойств);
	ИначеЕсли ТипСсылки=Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
		УправлениеСвойствамиПлатформа.ПолучитьНаборыСвойствДляХарактеристикНоменклатуры(Объект, ТипСсылки, НаборыСвойств);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает индекс текущего статуса документа.
//
// Параметры:
//  Объект	 - ДокументОбъект.* - Документ, для которого вычисляется статус.
// 
// Возвращаемое значение:
//  Число - индекс статуса документа.
//
Функция СтатусДокумента(Объект) Экспорт
	
	Если Объект.ПометкаУдаления Тогда
		СтатусДокумента = 3;
	ИначеЕсли Объект.Проведен Тогда
		СтатусДокумента = 1;
	Иначе
		СтатусДокумента = 0;
	КонецЕсли;
	
	Возврат СтатусДокумента;
	
КонецФункции

// Находит ссылку на справочник по переданному реквизиту.
//
// Параметры:
//  ИмяСправочника - Строка - Имя справочника, объект которого надо найти.
//  ИмяРеквизита - Строка - Имя реквизита, по которому будет проведен поиск.
//  ЗначРеквизита - Произвольный - значение реквизита, по которому будет проведен поиск.
//  Результат - СправочникСсылка - Ссылка на найденный объект.
//  Владелец - СправочникСсылка - Ссылка на владельца для поиска в иерархическом справочнике.
//  ТолькоНеПомеченные - Булево - Исключить из поиска помеченные на удаление.
//
Процедура НайтиСсылкуНаОбъектПоРеквизиту(ИмяСправочника, ИмяРеквизита, ЗначРеквизита, Результат, 
	Владелец = Неопределено,
	ТолькоНеПомеченные = Ложь) Экспорт
	
	Результат = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(ЗначРеквизита) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.Справочники[ИмяСправочника];
	Если НЕ ОбщегоНазначения.ЭтоСтандартныйРеквизит(ОбъектМетаданных.СтандартныеРеквизиты, ИмяРеквизита)
		И НЕ ОбъектМетаданных.Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
		
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИскСправочник.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник." + ИмяСправочника + " КАК ИскСправочник
	|ГДЕ
	|	ИскСправочник." + ИмяРеквизита + " = &ЗначРеквизита";
	
	Если ЗначениеЗаполнено(Владелец) Тогда
		Запрос.Текст = Запрос.Текст + " И ИскСправочник.Владелец = &Владелец";
		Запрос.УстановитьПараметр("Владелец", Владелец);
	КонецЕсли;
	
	Если ТолькоНеПомеченные Тогда
		Запрос.Текст = Запрос.Текст + " И ИскСправочник.ПометкаУдаления = Ложь";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЗначРеквизита", ЗначРеквизита);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

// Представление организации в печатных формах.
//
// Параметры:
//  СписокСведений	 - Структура - Данные по организации.
//  Список			 - Строка - Список полей представления.
//  СПрефиксом		 - Булево - Признак наличия префикса.
// 
// Возвращаемое значение:
//  Строка - представление организации.
//
Функция ОписаниеОрганизации(СписокСведений, Список = "", СПрефиксом = Истина) Экспорт

	Если ПустаяСтрока(Список) Тогда
		Список = "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет";
	КонецЕсли;

	Результат = "";

	СоответствиеПараметров = Новый Соответствие();
	СоответствиеПараметров.Вставить("ПолноеНаименование", "");
	СоответствиеПараметров.Вставить("ИНН",                НСтр("ru = 'ИНН'"));
	СоответствиеПараметров.Вставить("КПП",                НСтр("ru = 'КПП'"));
	СоответствиеПараметров.Вставить("ЮридическийАдрес",   "");
	СоответствиеПараметров.Вставить("ФактическийАдрес",   "");
	СоответствиеПараметров.Вставить("Телефоны",           НСтр("ru = 'тел.:'"));
	СоответствиеПараметров.Вставить("НомерСчета",         НСтр("ru = 'р/с'"));
	СоответствиеПараметров.Вставить("Банк",               НСтр("ru = 'в банке'"));
	СоответствиеПараметров.Вставить("БИК",                НСтр("ru = 'БИК'"));
	СоответствиеПараметров.Вставить("КоррСчет",           НСтр("ru = 'к/с'"));
	СоответствиеПараметров.Вставить("КодПоОКПО",          НСтр("ru = 'Код по ОКПО'"));

	Список          = Список + ?(Прав(Список, 1) = ",", "", ",");
	ЧислоПараметров = СтрЧислоВхождений(Список, ",");

	Для Счетчик = 1 По ЧислоПараметров Цикл

		ПозЗапятой = СтрНайти(Список, ",");

		Если ПозЗапятой > 0  Тогда
			
			ИмяПараметра = Лев(Список, ПозЗапятой - 1);
			Список       = Сред(Список, ПозЗапятой + 1, СтрДлина(Список));

			Попытка
				СтрокаДополнения = "";
				СписокСведений.Свойство(ИмяПараметра, СтрокаДополнения);

				Если ПустаяСтрока(СтрокаДополнения) Тогда
					Продолжить;
				КонецЕсли;

				Префикс = СоответствиеПараметров[ИмяПараметра];
				Если Не ПустаяСтрока(Результат)  Тогда
					Результат = Результат + ",";
				КонецЕсли; 

				Результат = Результат + ?(СПрефиксом = Истина, " " + Префикс + " ", "") + СтрокаДополнения;
			Исключение
				
				ТекстСообщения  = НСтр("ru='Не удалось определить значение параметра организации: %ИмяПараметра%'");
				ТекстСообщения  = СтрЗаменить(ТекстСообщения,"%ИмяПараметра%",ИмяПараметра);
				Сообщение       = Новый СообщениеПользователю();
				Сообщение.Текст = ТекстСообщения;
				Сообщение.Сообщить();
				
			КонецПопытки;

		КонецЕсли;

	КонецЦикла;

	Возврат СокрЛП(Результат);

КонецФункции // ОписаниеОрганизации()

// Возвращает документы-основания по счету-фактуре для создания корректировки.
//
// Параметры:
//  СчетФактура - ДокументСсылка.СчетФактураВыданный - исправляемый документ счет-фактура.
//  ХозОперация - СправочникСсылка.ХозОперации - операция корректировки счета-фактуры.
// 
// Возвращаемое значение:
//  Массив - параметры открытия формы объекта счета-фактуры.
//     * - ДокументСсылка.РеализацияТоваров - основание счета-фактуры.
//
Функция ОснованияСчетаФактурыВыданногоДляКорректировки(СчетФактура, ХозОперация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	РеализацияТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.СчетФактураВыданный КАК СчетФактураОснование
	|ПО
	|	РеализацияТоваров.ДокументОснование = СчетФактураОснование.ДокументОснование
	|	И (СчетФактураОснование.Ссылка = &СчетФактура)
	|	И (НЕ РеализацияТоваров.ПометкаУдаления)
	|	И (РеализацияТоваров.ХозОперация = &ХозОперация)
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ПО
	|	РеализацияТоваров.Ссылка = СчетФактураВыданный.ДокументОснование
	|ГДЕ
	|	СчетФактураВыданный.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданный.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &СчетФактура
	|	И НЕ СчетФактураВыданный.ДокументОснование.ПометкаУдаления
	|";
	
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	Запрос.УстановитьПараметр("ХозОперация", ХозОперация);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	МассивДокументов = Новый Массив;
	
	Если (Не РезультатыЗапроса[0].Пустой())
		ИЛИ РезультатыЗапроса[1].Пустой() Тогда
		Возврат МассивДокументов;
	КонецЕсли;
	
	Выборка = РезультатыЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивДокументов.Добавить(Выборка.ДокументОснование);
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

// Получает реквизиты организации для регистрации у оператора ЭДО.
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, по которой необходимо получить данные для регистрации ЭДО.
//
// Возвращаемое значение:
//  Структура - содержит реквизиты организации:
//   * ЮрАдрес             - Строка - юридический адрес организации,
//   * ЗначениеПолейАдреса - Строка - содержит полные данные адреса в формате json.
//   * КодНалоговогоОргана - Строка - код ФНС, в котором зарегистрирована организация.
//
Функция ПолучитьРеквизитыОрганизацииДляРегистрационногоПакета(Знач Организация) Экспорт
	
	КодНалоговогоОргана = "";
	ЮрАдрес             = "";
	ЗначениеПолейАдреса = "";

	ДанныеОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "КПП, ОГРН");
	
	Если ДанныеОрганизации.Свойство("КПП") И ЗначениеЗаполнено(ДанныеОрганизации.КПП) Тогда
		КодНалоговогоОргана = Лев(ДанныеОрганизации.КПП, 4);
	КонецЕсли;
	
	КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Организация,
		Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, ТекущаяДатаСеанса(), Ложь);
		
	НайденныеСтроки      = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		ЮрАдрес             = НайденныеСтроки[0].Представление;
		ЗначениеПолейАдреса = НайденныеСтроки[0].Значение;
	КонецЕсли;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ЮрАдрес"             , ЮрАдрес);
	СтруктураДанных.Вставить("ЗначениеПолейАдреса" , ЗначениеПолейАдреса);
	СтруктураДанных.Вставить("КодНалоговогоОргана" , КодНалоговогоОргана);
	СтруктураДанных.Вставить("ОГРН"                , ДанныеОрганизации.ОГРН);
	
	Возврат СтруктураДанных;
	
КонецФункции

// См. ПоставляемыеДанныеАбонентовПереопределяемый.ОбработатьПолученныеДанныеОбласти.
//
Процедура ОбработатьПолученныеДанныеОбласти(ПотокДанных, Обработчик, ДанныеОбработаны, КодВозврата, ОписаниеОшибки) Экспорт
	
	ОбработатьПолученныеДанныеОбластиИзСервиса1СЭДО(ПотокДанных, Обработчик, ДанныеОбработаны, КодВозврата, ОписаниеОшибки);
	
КонецПроцедуры

// Получает содержимое константы НастройкиСтартовогоПомощникаКЭДО.
//
// Возвращаемое значение:
//  Структура    - возвращает значение, если константа заполнена, иначе Неопределено.
//  См. КлиентЭДОКлиентСервер.НоваяСтруктураНастроекПомощникаЭДО.
//
Функция ПолучитьНастройкиСтартовогоПомощникаКЭДО() Экспорт
	
	ХранилищеНастроекПомощника = Константы.НастройкиСтартовогоПомощникаКЭДО.Получить();
	
	Возврат ХранилищеНастроекПомощника.Получить();
	
КонецФункции

// Восстанавливает интерфейс начальной страницы, если был установлен стартовый помощник ЭДО.
// 
// Параметры:
//  ИспользоватьСервисЭДО - Булево - признак включенной константы ИспользоватьОбменЭД.
//
// Возвращаемое значение:
//  Булево - признак восстановления системных настроек. Истина - настройки восстановлены.
//
Функция ВосстановитьСистемныеНастройки(ИспользоватьСервисЭДО = Ложь) Экспорт
	
	Форма = ФормаСтартовыйПомощникКЭДО();
	
	НачальнаяСтраницаНастройки = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиНачальнойСтраницы", "");
	Если ФормаУстановленаНаНачальнойСтранице(НачальнаяСтраницаНастройки, Форма) Тогда

		НастройкиХранилища = ХранилищеСистемныхНастроек.Загрузить("НастройкиИнтерфейсаКлиентскогоПриложенияКЭДО", "");
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", НастройкиХранилища);
		
		НастройкиХранилища = ХранилищеСистемныхНастроек.Загрузить("НастройкиНачальнойСтраницыКЭДО", "");
		
		Если ИспользоватьСервисЭДО
			И НЕ ФормаУстановленаНаНачальнойСтранице(НастройкиХранилища, ФормаОбменСКонтрагентамиТекущиеДелаПоЭДО()) Тогда
			НастройкиХранилища = Новый НастройкиНачальнойСтраницы;
			СоставФорм = Новый СоставФормНачальнойСтраницы;
			СоставФорм.ЛеваяКолонка.Добавить(ФормаОбменСКонтрагентамиТекущиеДелаПоЭДО());
			НастройкиХранилища.УстановитьСоставФорм(СоставФорм);
		КонецЕсли;
		
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "", НастройкиХранилища);
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// См. ЭлектроннаяПодписьПереопределяемый.ПриЗаполненииРеквизитовВладельцаВЗаявленииНаСертификат.
Процедура ПриЗаполненииРеквизитовВладельцаВЗаявленииНаСертификат(Параметры) Экспорт
	
	Параметры.ТипВладельца = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	
	ФормаСобственности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Организация, "ФормаСобственности");
	
	// Чтение значения для руководителя
	СтруктураОтбора = Новый Структура("Организация,Объект", Параметры.Организация, Перечисления.ВидыОбъектовСведений.Руководитель);
	СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(НачалоДня(ТекущаяДатаСеанса()),СтруктураОтбора);
	Руководитель = СтруктураСведений.Значение;
	
	// Чтение значения для главного бухгалтера
	СтруктураОтбора = Новый Структура("Организация,Объект", Параметры.Организация, Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
	СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(НачалоДня(ТекущаяДатаСеанса()),СтруктураОтбора);
	ГлавныйБухгалтер = СтруктураСведений.Значение;
	
	Если ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		Если Не ЗначениеЗаполнено(Параметры.Сотрудник) Тогда
			Параметры.Сотрудник = Руководитель;
		КонецЕсли;
	Иначе
		Параметры.Директор = Руководитель;
		Параметры.ГлавныйБухгалтер = ГлавныйБухгалтер;
	КонецЕсли;
	
	ТекущийВладелец = Неопределено;
	
	Если ЗначениеЗаполнено(Параметры.Сотрудник) Тогда
		ТекущийВладелец = Параметры.Сотрудник;
		ОснованиеПолномочийФизлица = ОснованияПолномочийФизическихЛиц(Параметры.Организация, Параметры.Сотрудник).Получить(Параметры.Сотрудник);
		Параметры.Должность = ОснованиеПолномочийФизлица.Должность;
	ИначеЕсли ЗначениеЗаполнено(Параметры.Директор) Тогда
		ТекущийВладелец = Параметры.Директор;
		Параметры.Сотрудник = Параметры.Директор;
		ОснованиеПолномочийФизлица = ОснованияПолномочийФизическихЛиц(Параметры.Организация, Параметры.Директор).Получить(Параметры.Директор);
		Параметры.Должность = ОснованиеПолномочийФизлица.Должность;
	ИначеЕсли ЗначениеЗаполнено(Параметры.ГлавныйБухгалтер) Тогда
		ТекущийВладелец = Параметры.ГлавныйБухгалтер;
		Параметры.Сотрудник = Параметры.ГлавныйБухгалтер;
		ОснованиеПолномочийФизлица = ОснованияПолномочийФизическихЛиц(Параметры.Организация, Параметры.ГлавныйБухгалтер).Получить(Параметры.ГлавныйБухгалтер);
		Параметры.Должность = ОснованиеПолномочийФизлица.Должность;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийВладелец) Тогда
		Возврат; // Поля можно заполнить только, если сотрудник указан.
	КонецЕсли;
	
	ДанныеФизическогоЛица = ДанныеФизическогоЛица(ТекущийВладелец);
	
	Параметры.Фамилия = ДанныеФизическогоЛица.Фамилия;
	Параметры.Имя = ДанныеФизическогоЛица.Имя;
	Параметры.Отчество = ДанныеФизическогоЛица.Отчество;
	
	Параметры.ДатаРождения  = ДанныеФизическогоЛица.ДатаРождения;
	Параметры.Пол = ?(ДанныеФизическогоЛица.Пол = Перечисления.ПолФизическихЛиц.Женский, "Женский", "Мужской");
	Параметры.МестоРождения = ДанныеФизическогоЛица.МестоРождения;
	Параметры.Гражданство = ДанныеФизическогоЛица.Гражданство;
	
	Параметры.СтраховойНомерПФР = ДанныеФизическогоЛица.СтраховойНомерПФР;
	Если ЗначениеЗаполнено(ДанныеФизическогоЛица.ВидДокумента) Тогда
		Параметры.ДокументВид = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеФизическогоЛица.ВидДокумента, "КодМВД");
	КонецЕсли;
	Параметры.ДокументНомер = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 %2'"), ДанныеФизическогоЛица.Серия, ДанныеФизическогоЛица.Номер);
		
	Параметры.ДокументКемВыдан = ДанныеФизическогоЛица.КемВыдан;
	Параметры.ДокументДатаВыдачи = ДанныеФизическогоЛица.ДатаВыдачи;
	Параметры.ДокументКодПодразделения = ДанныеФизическогоЛица.КодПодразделения;
	
	АдресаЭлектроннойПочты = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		ТекущийВладелец, Справочники.ВидыКонтактнойИнформации.EmailСотрудника, , Ложь);
	
	Если ЗначениеЗаполнено(АдресаЭлектроннойПочты) Тогда
		АдресЭлектроннойПочты = АдресаЭлектроннойПочты[0];
		Параметры.ЭлектроннаяПочта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(
			АдресЭлектроннойПочты.Значение, АдресЭлектроннойПочты.Представление);
	КонецЕсли;
	
	Параметры.ИНН = ДанныеФизическогоЛица.ИНН;
	
	Если Не Параметры.ЭтоФизическоеЛицо Тогда
		Возврат;
	КонецЕсли;
	
	ВидАдреса = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("ЮрАдресСотрудника");
	ВидТелефона = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("ТелефонСотрудника");
	
	ВидыКонтактнойИнформации = Новый Массив;
	ВидыКонтактнойИнформации.Добавить(ВидАдреса);
	ВидыКонтактнойИнформации.Добавить(ВидТелефона);
	
	Объекты = Новый Массив;
	Объекты.Добавить(Параметры.Сотрудник);
	
	КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
		Объекты, , ВидыКонтактнойИнформации);
	
	НайденнаяИнформация = КонтактнаяИнформация.Найти(ВидАдреса, "Вид");
	Если НайденнаяИнформация <> Неопределено Тогда
		Параметры.АдресРегистрации = НайденнаяИнформация.Значение;
	КонецЕсли;
	
	НайденнаяИнформация = КонтактнаяИнформация.Найти(ВидТелефона, "Вид");
	Если НайденнаяИнформация <> Неопределено Тогда
		Параметры.Телефон = НайденнаяИнформация.Значение;
	КонецЕсли;
	
КонецПроцедуры

// См. ЭлектроннаяПодписьПереопределяемый.ПриЗаполненииРеквизитовРуководителяВЗаявленииНаСертификат.
Процедура ПриЗаполненииРеквизитовРуководителяВЗаявленииНаСертификат(Параметры) Экспорт
	
	Параметры.ТипРуководителя = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	
	// Чтение значения для руководителя
	СтруктураОтбора = Новый Структура("Организация, Объект", Параметры.Организация, Перечисления.ВидыОбъектовСведений.Руководитель);
	СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(НачалоДня(ТекущаяДатаСеанса()),СтруктураОтбора);
	Руководитель = СтруктураСведений.Значение;
	
	Если Не ЗначениеЗаполнено(Параметры.Руководитель) Тогда
		Параметры.Руководитель = Руководитель;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.Руководитель) Тогда
		Возврат; // Поля можно заполнить только, если руководитель указан.
	КонецЕсли;
	
	ОснованиеПолномочийФизлица = ОснованияПолномочийФизическихЛиц(Параметры.Организация, Параметры.Руководитель).Получить(Параметры.Руководитель);
	Параметры.Должность = СокрЛП(ОснованиеПолномочийФизлица.Должность);
	//Параметры.Основание = ОснованиеПолномочийФизлица.ОснованиеПолномочий;
	
КонецПроцедуры

// См. ЭлектроннаяПодписьПереопределяемый.ПриЗаполненииРеквизитовПартнераВЗаявленииНаСертификат.
Процедура ПриЗаполненииРеквизитовПартнераВЗаявленииНаСертификат(Параметры) Экспорт
	
	Параметры.ТипПартнера = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	
	Если Не ЗначениеЗаполнено(Параметры.Партнер) Тогда
		Возврат; // Поля можно заполнить только, если партнер указан.
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Партнер, "ИНН, КПП, ЮрФизЛицо");
	
	Параметры.ЭтоИндивидуальныйПредприниматель =
		(Реквизиты.ЮрФизЛицо = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель);
		
	Параметры.ИНН = Реквизиты.ИНН;
	Параметры.КПП = Реквизиты.КПП;
	
КонецПроцедуры

// См. СервисЭДОСобытия.ПриФормированииРегистрационнойИнформации
Процедура ПриФормированииРегистрационнойИнформации(РеквизитыПакета) Экспорт
	
	Если БазаСозданаЧерезOnboarding() Тогда
		РеквизитыПакета.Вставить("ПодключенПоOnboarding", Истина);
	КонецЕсли;
	
КонецПроцедуры

#Область ЭтапыГрафикаОплат

Процедура ПередЗаписьюНаСервереГрафикаОплат(Форма, Объект, ПланируемаяДатаПоставки) Экспорт
	
	Если Не Форма.ИспользуетсяМногоэтапныйГрафикОплаты Тогда
		ТорговыйКомплексЭДОКлиентСервер.ПеренестиГрафикОплатИзРеквизитовФормыВТаблицу(
			Форма, Объект, ПланируемаяДатаПоставки);
			
		Объект.ДополнительныеСвойства.Вставить("ТребуетсяПеречитатьГрафикОплат", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЧтенииНаСервереГрафикаОплат(Форма, ПланируемаяДатаПоставки) Экспорт
	
	ОпределитьВариантУказанияГрафикаОплат(Форма);
	УстановитьОформлениеЭтаповГрафикаОплат(Форма);
		
	Если Не Форма.ИспользуетсяМногоэтапныйГрафикОплаты Тогда
		ТорговыйКомплексЭДОКлиентСервер.ПрочитатьГрафикОплатИзТаблицыВРеквизитыФорма(Форма, ПланируемаяДатаПоставки);
	КонецЕсли;
	
	ТорговыйКомплексЭДОКлиентСервер.РассчитатьИтогиГрафикаОплат(Форма);
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеГрафикаОплат(Форма) Экспорт
	
	//УсловноеОформление = Форма.УсловноеОформление;
	//Элементы = Форма.Элементы;
	//
	//Элемент = УсловноеОформление.Элементы.Добавить();

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЭтапыГрафикаОплатыСдвиг.Имя);

	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЭтапыГрафикаОплаты.ВариантОплаты");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	//ОтборЭлемента.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВариантыОплатыПоГрафику.ОтсрочкаПлатежа");

	//Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	//
	////
	//Элемент = УсловноеОформление.Элементы.Добавить();

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПредоплатаСуммаПлатежа.Имя);
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОтсрочкаСуммаПлатежа.Имя);

	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПроцентПлатежейОбщий");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	//ОтборЭлемента.ПравоеЗначение = 100;

	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.FireBrick);


КонецПроцедуры

Процедура ПослеЗаписиНаСервереГрафикаОплат(Форма, Объект, ПланируемаяДатаПоставки) Экспорт

	Если Объект.ДополнительныеСвойства.Свойство("ТребуетсяПеречитатьГрафикОплат") Тогда
		ПриЧтенииНаСервереГрафикаОплат(Форма, ПланируемаяДатаПоставки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьГрафикОплатПередЗаписью(Объект, Знач ПланируемаяДатаПоставки, Знач СуммаДокумента) Экспорт
	
	Если Объект.ЭтапыГрафикаОплаты.Количество() = 0 Тогда
		ДобавитьЭтапОплатыПоУмолчанию(
			Объект, ПланируемаяДатаПоставки, СуммаДокумента);
	Иначе
		РаспределитьСуммуПоЭтапамГрафикаОплаты(
			Объект.ЭтапыГрафикаОплаты,
			СуммаДокумента);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Запускает фоновое задание, см. КлиентЭДО.СозданиеЭлектронныхДокументовФоновоеЗадание
//
Процедура СозданиеЭлектронныхДокументов() Экспорт
	
	ФоновыеЗадания.Выполнить("ТорговыйКомплексЭДО.СозданиеЭлектронныхДокументовФоновоеЗадание",,,
		НСтр("ru = 'Создание электронных документов'"));
	
КонецПроцедуры

// Возвращает информацию о работе ИБ в режиме Легкого Клиента ЭДО.
//
// Возвращаемое значение:
//  Булево
Функция ИспользуетсяЛегкийКлиентЭДО() Экспорт
	
	Возврат ТорговыйКомплексЭДОПовтИсп.ИспользуетсяЛегкийКлиентЭДО();
	
КонецФункции

// Процедура запуска регламентного задания АвтоматическаяОбработкаДокументовЭДО.
//
Процедура АвтоматическаяОбработкаДокументовЭДО(Знач ПараметрыЗадания) Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	РегламентноеЗадание = Метаданные.РегламентныеЗадания.АвтоматическаяОбработкаДокументовЭДО;
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(РегламентноеЗадание);
	
	//УстановитьПривилегированныйРежим(Истина);
	//ТребуетсяПолучение = АвтоматическоеПолучениеЭДО.ТребуетсяПолучениеЧерезИнтервал(Истина);
	//Если Не ТребуетсяПолучение Тогда
	//	Возврат;
	//КонецЕсли;
	
	//Если Не ЕстьУчетныеЗаписиДляПолучения() Тогда
	//	ОбщегоНазначенияБЭД.УстановитьАктивностьРегламентногоЗадания("АвтоматическаяОбработкаДокументовЭДО", Ложь);
	//	Возврат;
	//КонецЕсли;
	
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяМетода", РегламентноеЗадание.ИмяМетода);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	
	ФоновыеЗаданияОбновлениеВыгрузки = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если ФоновыеЗаданияОбновлениеВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОбработки = ПараметрыАвтоматическойОбработкиДокументовЭДО();
	ЗаполнитьЗначенияСвойств(ПараметрыОбработки, ПараметрыЗадания);
	
	МногопоточныйРежим = Не ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	МногопоточныйРежим = Мин(ПараметрыОбработки.МногопоточныйРежим, МногопоточныйРежим);
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.ДатаАвтоматическогоПолученияЭДО.Установить(ТекущаяДатаСеанса());
	
	Если МногопоточныйРежим Тогда
		АвтоматическаяОбработкаДокументовЭДОМногопоточныйРежим(ПараметрыОбработки);
	Иначе
		АвтоматическаяОбработкаДокументовЭДООднопоточныйРежим(ПараметрыОбработки);
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыАвтоматическойОбработкиДокументовЭДО() Экспорт
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("МногопоточныйРежим",     Ложь);
	ПараметрыЗадания.Вставить("ПолучатьИРаспаковывать", Истина);
	ПараметрыЗадания.Вставить("Утверждать",             Ложь);
	ПараметрыЗадания.Вставить("ПодписатьИОтправить",    Ложь);
	ПараметрыЗадания.Вставить("ДопустимоеОтклонениеСуммыДокумента",    0);
	ПараметрыЗадания.Вставить("ДопустимоеОтклонениеСуммыНДСДокумента", 0);
	
	Возврат ПараметрыЗадания;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область АвтоматическаяОбработкаДокументовЭДО

Функция ПолучитьСвободныеИдентификаторыУчетныхЗаписей()
	
	ИдентификаторыУчетныхЗаписей = УчетныеЗаписиЭДО.ИдентификаторыУчетныхЗаписейСпособаОбмена(Перечисления.СпособыОбменаЭД.ЧерезСервис1СЭДО, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПакетыМногопоточныхЗаданий.Объект КАК ИдентификаторЭДО
	|ИЗ
	|	РегистрСведений.ПакетыМногопоточныхЗаданий КАК ПакетыМногопоточныхЗаданий
	|ГДЕ
	|	ПакетыМногопоточныхЗаданий.ВидЗадания = ЗНАЧЕНИЕ(Справочник.МногопоточныеЗадания.АвтоматическаяОбработкаДокументовЭДО) И 
	|	ПакетыМногопоточныхЗаданий.ЕстьОшибка = ЛОЖЬ
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Позиция = ИдентификаторыУчетныхЗаписей.Найти(Выборка.ИдентификаторЭДО);
		Если Позиция = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ИдентификаторыУчетныхЗаписей.Удалить(Позиция);
	КонецЦикла;
	
	Возврат ИдентификаторыУчетныхЗаписей;
	
КонецФункции

Функция НайтиВходящийУчетныйДокумент(ВхДокНомер, ВхДокДата, Организация, Контрагент)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ПоступлениеТоваров.Ссылка КАК Ссылка,
	|		ПоступлениеТоваров.Дата КАК Дата
	|	ИЗ
	|		Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|	ГДЕ
	|		ПоступлениеТоваров.ВхДокНомер = &ВхДокНомер
	|		И ПоступлениеТоваров.ВхДокДата = &ВхДокДата
	|		И ПоступлениеТоваров.Организация = &Организация
	|		И ПоступлениеТоваров.Контрагент = &Контрагент
	|		И НЕ ПоступлениеТоваров.ПометкаУдаления
	|	УПОРЯДОЧИТЬ ПО 
	|		Дата УБЫВ) КАК ВложенныйЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ПоступлениеТоваров.Ссылка КАК Ссылка,
	|		ПоступлениеТоваров.Дата КАК Дата
	|	ИЗ
	|		Документ.ВозвратОтПокупателя КАК ПоступлениеТоваров
	|	ГДЕ
	|		ПоступлениеТоваров.ВхДокНомер = &ВхДокНомер
	|		И ПоступлениеТоваров.ВхДокДата = &ВхДокДата
	|		И ПоступлениеТоваров.Организация = &Организация
	|		И ПоступлениеТоваров.Контрагент = &Контрагент
	|		И НЕ ПоступлениеТоваров.ПометкаУдаления
	|	УПОРЯДОЧИТЬ ПО 
	|		Дата УБЫВ) КАК ВложенныйЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ПоступлениеТоваров.Ссылка КАК Ссылка,
	|		ПоступлениеТоваров.Дата КАК Дата
	|	ИЗ
	|		Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|	ГДЕ
	|		ПоступлениеТоваров.ВхДокНомер = &ВхДокНомер
	|		И ПоступлениеТоваров.ВхДокДата = &ВхДокДата
	|		И ПоступлениеТоваров.Организация = &Организация
	|		И ПоступлениеТоваров.Контрагент.ГоловнойКонтрагент = &Контрагент
	|		И НЕ ПоступлениеТоваров.ПометкаУдаления
	|	УПОРЯДОЧИТЬ ПО 
	|		Дата УБЫВ) КАК ВложенныйЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ПоступлениеТоваров.Ссылка КАК Ссылка,
	|		ПоступлениеТоваров.Дата КАК Дата
	|	ИЗ
	|		Документ.ВозвратОтПокупателя КАК ПоступлениеТоваров
	|	ГДЕ
	|		ПоступлениеТоваров.ВхДокНомер = &ВхДокНомер
	|		И ПоступлениеТоваров.ВхДокДата = &ВхДокДата
	|		И ПоступлениеТоваров.Организация = &Организация
	|		И ПоступлениеТоваров.Контрагент.ГоловнойКонтрагент = &Контрагент
	|		И НЕ ПоступлениеТоваров.ПометкаУдаления
	|	УПОРЯДОЧИТЬ ПО 
	|		Дата УБЫВ) КАК ВложенныйЗапрос
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВхДокНомер",  ВхДокНомер);
	Запрос.УстановитьПараметр("ВхДокДата",   ВхДокДата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент",  Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция ЗаполнитьВходящийУчетныйДокумент(УчетныйДокумент, ДанныеЗаполнения, СпособОбработки)
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("Отказ", Ложь);
	РезультатВыполнения.Вставить("ТекстОшибки", "");
	
	Если НЕ ЗначениеЗаполнено(УчетныйДокумент) Тогда
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	Товары = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "Товары", Неопределено);
	
	Если Не ЗначениеЗаполнено(Товары) Тогда
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(УчетныйДокумент);
	
	ДокументОбъект = УчетныйДокумент.ПолучитьОбъект();
	
	ПредставлениеКонтрагента = СокрЛП(ДанныеЗаполнения.Контрагент);
	
	СписокОшибок = Новый Массив;
	
	ПараметрыДействия = МенеджерОбъекта.ПолучитьПараметрыДействия(ДокументОбъект);
	
	ДокументЧастичноЗаполнен = Ложь;
	Для Каждого СтрокаТоваров Из Товары Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Тогда
			ДокументЧастичноЗаполнен = Истина;
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Для контрагента <%1> не найдена номенклатура<%2>'"), 
				ПредставлениеКонтрагента,
				СокрЛП(СтрокаТоваров.НоменклатураПоставщика));
				
			РезультатВыполнения.Отказ = Истина;
			СписокОшибок.Добавить(ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура", СтрокаТоваров.Номенклатура);
		Если ЗначениеЗаполнено(СтрокаТоваров.ЕдиницаИзмерения) Тогда
			СтруктураПоиска.Вставить("ЕдиницаИзмерения", СтрокаТоваров.ЕдиницаИзмерения);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТоваров.ГТД) Тогда
			СтруктураПоиска.Вставить("ГТД", СтрокаТоваров.ГТД);
		КонецЕсли;
		
		СтрокаТЧ = ДокументОбъект.Товары.НайтиСтроки(СтруктураПоиска);
		Если СтрокаТЧ.Количество()=0 Тогда
			СтрокаТЧ = ДокументОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТоваров);
			МенеджерОбъекта.ТоварыСуммаВсегоПриИзменении(ДокументОбъект, СтрокаТЧ, ПараметрыДействия);
			
			СтрокаТЧ.НоменклатураПоставщика = СтрокаТоваров.НоменклатураПоставщика;
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдентификаторСтроки) Тогда
				СтрокаТЧ.ИдентификаторСтроки = Новый УникальныйИдентификатор;
			КонецЕсли;
			
		Иначе
			СтрокаТЧ = СтрокаТЧ[0];
		КонецЕсли;
		
		СтрокаТЧ.КоличествоПоНакладной = СтрокаТоваров.Количество;
		СтрокаТЧ.КоличествоМестДок     = СтрокаТоваров.КоличествоМестДок;
		СтрокаТЧ.КоличествоДок         = СтрокаТоваров.Количество;
		СтрокаТЧ.ЦенаДок               = СтрокаТоваров.Цена;
		СтрокаТЧ.СуммаДок              = СтрокаТоваров.СуммаВсего;
		
	КонецЦикла;
	
	Для Каждого СтрокаМаркировки Из ДанныеЗаполнения.КодыМаркировки Цикл
		НайденнаяСтрока = ДокументОбъект.Марки.Найти(СтрокаМаркировки.КодМарки, "КодМарки");
		Если НайденнаяСтрока = Неопределено Тогда
			НоваяСтрока = ДокументОбъект.Марки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМаркировки);
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		РезультатВыполнения.Отказ = Истина;
		СписокОшибок.Добавить(ТекстОшибки);
	КонецПопытки;
	
	РезультатВыполнения.Вставить("ТекстОшибки", СтрСоединить(СписокОшибок, Символы.ПС));
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция СпособОбработкиВходящегоДокумента(УчетныйДокумент)
	
	Если ТипЗнч(УчетныйДокумент) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		СпособОбработки = "ПоступлениеТоваров";
	ИначеЕсли ТипЗнч(УчетныйДокумент) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		СпособОбработки = "ВозвратТоваровОтПокупателя";
	ИначеЕсли ТипЗнч(УчетныйДокумент) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		СпособОбработки = "КорректировкаПоступления";
	КонецЕсли;
	
	Возврат СпособОбработки;
	
КонецФункции

Процедура ПолучитьВходящиеДокументыЭДОПоИдентификатору(ИдентификаторУчетнойЗаписи, СертификатыУчетнойЗаписи, ОтпечаткиСертификатов, ПараметрыОбработки, КонтекстДиагностики)
	
	ПараметрыВыполнения = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполнения.ОбъектыДействий.ИдентификаторыОрганизаций.Добавить(ИдентификаторУчетнойЗаписи);
	ПараметрыВыполнения.ОтпечаткиСертификатов = ОтпечаткиСертификатов;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрыВыполнения.ВыбранныеСертификаты, СертификатыУчетнойЗаписи);
	
	НаборДействий = ПараметрыВыполнения.НаборДействий;
	
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, Перечисления.ДействияПоЭДО.ЗагрузитьПриглашения);
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, Перечисления.ДействияПоЭДО.Загрузить);
	
	Если НастройкиЭДО.ПриниматьПриглашенияЭДОАвтоматически() Тогда
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, Перечисления.ДействияПоЭДО.ПринятьПриглашения);
	КонецЕсли;
	
	РезультатЗагрузкиВходящихКонтейнеров = ЭлектронныеДокументыЭДОСлужебный.ВыполнитьДействияЭДО(ПараметрыВыполнения, КонтекстДиагностики);
	
	Если ПараметрыВыполнения.РасшифрованныеМаркеры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаборДействий.Очистить();
	
	Если ЗначениеЗаполнено(РезультатЗагрузкиВходящихКонтейнеров.ДокументыДляОбработкиИзвещений) Тогда
		
		ПараметрыВыполнения.ОбъектыДействий.ЭлектронныеДокументы = ОбщегоНазначения.ВыгрузитьКолонку(
			РезультатЗагрузкиВходящихКонтейнеров.ДокументыДляОбработкиИзвещений, "Ключ");
		ПараметрыВыполнения.ОбработатьТолькоИзвещения = Истина;
		
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, Перечисления.ДействияПоЭДО.Подписать);
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, Перечисления.ДействияПоЭДО.ПодготовитьКОтправке);
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, Перечисления.ДействияПоЭДО.Отправить);
		
		РезультатОтправкиИзвещений = ЭлектронныеДокументыЭДОСлужебный.ВыполнитьДействияЭДО(ПараметрыВыполнения, КонтекстДиагностики);
		
	КонецЕсли;
	
	Возврат;
	
КонецПроцедуры

Процедура ОбработатьВходящиеДокументыЭДО(ИдентификаторУчетнойЗаписи, ПараметрыОбработки)
	
	ДопустимоеОтклонениеСуммыДокумента    = ПолучитьЗначениеПараметраСтруктуры(ПараметрыОбработки, "ДопустимоеОтклонениеСуммыДокумента", 0);
	ДопустимоеОтклонениеСуммыНДСДокумента = ПолучитьЗначениеПараметраСтруктуры(ПараметрыОбработки, "ДопустимоеОтклонениеСуммыНДСДокумента", 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторУчетнойЗаписи", ИдентификаторУчетнойЗаписи);
	Запрос.УстановитьПараметр("ПорогДатыПолучения", ТекущаяДата()+86400*10);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЭлектронныйДокументВходящийЭДО.Ссылка КАК Ссылка,
	|	ЭлектронныйДокументВходящийЭДО.ДатаДокумента КАК ДатаДокумента,
	|	ЭлектронныйДокументВходящийЭДО.НомерДокумента КАК НомерДокумента,
	|	ЭлектронныйДокументВходящийЭДО.ВидДокумента КАК ВидДокумента,
	|	ЭлектронныйДокументВходящийЭДО.ВидДокумента.ТипДокумента КАК ТипДокумента,
	|	ЭлектронныйДокументВходящийЭДО.Контрагент КАК Контрагент,
	|	ЭлектронныйДокументВходящийЭДО.Организация КАК Организация,
	|	ЭлектронныйДокументВходящийЭДО.СуммаДокумента КАК СуммаДокумента,
	|	ЭлектронныйДокументВходящийЭДО.СодержитМаркируемыеТовары КАК СодержитМаркируемыеТовары,
	|	ОбъектыУчетаДокументовЭДО.ОбъектУчета КАК УчетныйДокумент,
	|	ВЫБОР
	|		КОГДА ОбъектыУчетаДокументовЭДО.ОбъектУчета ЕСТЬ NULL ТОГДА
	|			ЛОЖЬ
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ КАК УчетныйДокументСоздан,
	|	ВЫБОР
	|		КОГДА КонтрольСопоставления.ЭлектронныйДокумент ЕСТЬ NULL ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК НоменклатураСопоставлена,
	|	ВЫБОР
	|		КОГДА КонтрольПроведенияУчетныхДокументовЭДО.УчетныйДокумент ЕСТЬ NULL ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			 ЛОЖЬ
	|	КОНЕЦ КАК УчетныйДокументПроведен
	|ИЗ
	|	РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
	|ПО
	|	СостоянияДокументовЭДО.ЭлектронныйДокумент = ЭлектронныйДокументВходящийЭДО.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.КонтрольСопоставленияНоменклатурыЭДО КАК КонтрольСопоставления
	|ПО
	|	СостоянияДокументовЭДО.ЭлектронныйДокумент = КонтрольСопоставления.ЭлектронныйДокумент
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО
	|ПО
	|	СостоянияДокументовЭДО.ЭлектронныйДокумент = ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент
	|	И ОбъектыУчетаДокументовЭДО.Актуальный = ИСТИНА
	|	И ОбъектыУчетаДокументовЭДО.ТребуетсяПересчетАктуальности = ЛОЖЬ
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.КонтрольПроведенияУчетныхДокументовЭДО КАК КонтрольПроведенияУчетныхДокументовЭДО
	|ПО
	|	ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент = КонтрольПроведенияУчетныхДокументовЭДО.ЭлектронныйДокумент
	|	И ОбъектыУчетаДокументовЭДО.ОбъектУчета = КонтрольПроведенияУчетныхДокументовЭДО.УчетныйДокумент
	|ГДЕ
	|	СостоянияДокументовЭДО.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписание)
	|	И ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации = &ИдентификаторУчетнойЗаписи
	|	И ЭлектронныйДокументВходящийЭДО.ТребуетсяПодтверждение = ИСТИНА
	|	И ОбъектыУчетаДокументовЭДО.ОбъектУчета ССЫЛКА Документ.ПоступлениеТоваров
	//|	И ЭлектронныйДокументВходящийЭДО.ДатаПолучения >= &ПорогДатыПолучения
	|	И ЭлектронныйДокументВходящийЭДО.ТипРегламента = ЗНАЧЕНИЕ(Перечисление.ТипыРегламентовЭДО.УПД)
	|	И (ЭлектронныйДокументВходящийЭДО.ВидДокумента.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыДокументовЭДО.ТоварнаяНакладная)
	|	ИЛИ ЭлектронныйДокументВходящийЭДО.ВидДокумента.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыДокументовЭДО.УПД))
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	ТипТоварнаяНакладная = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		РезультатПроверки = РегистрыСведений.СостоянияАвтоматическойОбработкиДокументовЭДО.РезультатПроверкиОбработкиДокументовЭДО();
		СписокОшибок      = Новый Массив;
		
		ЭлектронныеДокументы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Выборка.Ссылка);
		ДанныеЭлектронногоДокумента = ЭлектронныеДокументыЭДО.ДанныеДокументовДляОтраженияВУчете(ЭлектронныеДокументы)[0];
		
		ПараметрыПолучения = ЭлектронныеДокументыЭДО.НовыеПараметрыПолученияДанныхДокумента();
		ПараметрыПолучения.ОсновнойФайл = ДанныеЭлектронногоДокумента.ДанныеОсновногоФайла;
		ПараметрыПолучения.ДополнительныйФайл = ДанныеЭлектронногоДокумента.ДанныеДополнительногоФайла;
		ДанныеРазбора = ЭлектронныеДокументыЭДО.ДанныеДокументаДляЗагрузкиПросмотра(ПараметрыПолучения);
		
		ДеревоДанных = ДанныеРазбора.НовыйЭД.ЗначениеРеквизита;
		
		ФункцияУПД = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, "Функция");
		
		ДанныеЗаполнения = Новый Структура;
		
		ТорговыйКомплексОбменСКонтрагентамиЭДО.ДополнитьДанныеЗаполненияВалютой(ДеревоДанных, ДанныеЗаполнения, "СведенияОСчетеФактуре.Валюта.Код");
		ТорговыйКомплексОбменСКонтрагентамиЭДО.ДополнитьДанныеЗаполненияВходящимДокументом("Документа", ДеревоДанных, ДанныеЗаполнения, "СведенияОСчетеФактуре.");
		ТорговыйКомплексОбменСКонтрагентамиЭДО.ДополнитьДанныеЗаполненияИсправлением(ДеревоДанных, ДанныеЗаполнения, "СведенияОСчетеФактуре.Исправление.");
		ТорговыйКомплексОбменСКонтрагентамиЭДО.ДополнитьДанныеЗаполненияКонтрагентомИсточникТаблица(ДеревоДанных, ДанныеЗаполнения, 
			"СведенияОСчетеФактуре.СведенияОПродавцах", "СведенияОСчетеФактуре.СведенияОПродавцах.НомерСтроки.Продавец", Истина);
		ТорговыйКомплексОбменСКонтрагентамиЭДО.ДополнитьДанныеЗаполненияОрганизациейИсточникТаблица(ДеревоДанных, ДанныеЗаполнения, 
			"СведенияОСчетеФактуре.СведенияОПокупателях", "СведенияОСчетеФактуре.СведенияОПокупателях.НомерСтроки.Покупатель", Истина);
		ТорговыйКомплексОбменСКонтрагентамиЭДО.ДополнитьДанныеЗаполненияГрузотправителемИсточникТаблица(ДеревоДанных, ДанныеЗаполнения,
			"СведенияОСчетеФактуре.СведенияОГрузоотправителях", Истина);
		ТорговыйКомплексОбменСКонтрагентамиЭДО.ДополнитьДанныеЗаполненияГрузополучателемИсточникТаблица(ДеревоДанных, ДанныеЗаполнения,
			"СведенияОСчетеФактуре.СведенияОГрузополучателях", "СведенияОСчетеФактуре.СведенияОГрузополучателях.НомерСтроки.Грузополучатель", Истина);
		ТорговыйКомплексОбменСКонтрагентамиЭДО.ДополнитьДанныеЗаполненияПодразделениемКомпании(ДеревоДанных, ДанныеЗаполнения,
			"СведенияОСчетеФактуре.СведенияОПокупателях", "СведенияОСчетеФактуре.СведенияОПокупателях.НомерСтроки.Покупатель", Истина);
		
		ВсегоКОплате = ДеревоДанных.Строки.Найти("ТаблицаСчетаФактуры.ВсегоКОплате", "ПолныйПуть", Истина);
		
		СтоимостьБезНалога = 0;
		СтоимостьСНалогом  = 0;
		Количество         = 0;
		СуммаНалога        = 0;
		БезНДС             = Истина;
		
		Если (Не ВсегоКОплате = Неопределено) Тогда
			
			СтоимостьБезНалога = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
				ВсегоКОплате,
				"ТаблицаСчетаФактуры.ВсегоКОплате.СтоимостьБезНалога"
			);
			
			СтоимостьСНалогом = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
				ВсегоКОплате,
				"ТаблицаСчетаФактуры.ВсегоКОплате.СтоимостьСНалогом"
			);
			
			Количество = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
				ВсегоКОплате,
				"ТаблицаСчетаФактуры.ВсегоКОплате.Количество"
			);
			
			СуммаНалога = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
				ВсегоКОплате,
				"ТаблицаСчетаФактуры.ВсегоКОплате.СуммаНалога.Сумма"
			);
			
			БезНДС = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
				ВсегоКОплате,
				"ТаблицаСчетаФактуры.ВсегоКОплате.СуммаНалога.БезНДС"
			);
			
		КонецЕсли;
		
		ДанныеЗаполнения.Вставить("СуммаВсего",  СтоимостьСНалогом);
		ДанныеЗаполнения.Вставить("Количество",  Количество);
		ДанныеЗаполнения.Вставить("СуммаНДС",    СуммаНалога);
		ДанныеЗаполнения.Вставить("БезНДС",      БезНДС);
		
		РезультатПроверки.НеЗаполненаСуммаДокументаЭД = (Не ЗначениеЗаполнено(СтоимостьСНалогом));
		
		Если РезультатПроверки.НеЗаполненаСуммаДокументаЭД Тогда
			ТекстОшибки = НСтр("ru = 'В электронном документе не заполнена сумма'");
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОшибкаОформленияЭлектронногоДокумента = Истина;
		КонецЕсли;
		
		Если Выборка.ТипДокумента = ТипТоварнаяНакладная И ДанныеЗаполнения.СуммаНДС>0 Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'У УПД со статусом 2 указана сумма НДС'"));
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОшибкаОформленияЭлектронногоДокумента = Истина;
		КонецЕсли;
		
		Грузоотправитель_ИНН_Док = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "Грузоотправитель_ИНН", ДанныеЗаполнения.Контрагент_ИНН);
		Грузоотправитель_КПП_Док = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "Грузоотправитель_КПП", ДанныеЗаполнения.Контрагент_КПП);
		Грузополучатель_ИНН_Док  = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "Грузополучатель_ИНН", ДанныеЗаполнения.Организация_ИНН);
		Грузополучатель_КПП_Док  = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "Грузополучатель_КПП", ДанныеЗаполнения.Организация_КПП);
		
		Если Не Грузополучатель_ИНН_Док = ДанныеЗаполнения.Организация_ИНН Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'В электронном документе ИНН покупателя %1 отличается от ИНН грузополучателя %2'"), ДанныеЗаполнения.Организация_ИНН, Грузополучатель_ИНН_Док);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОшибкаОформленияЭлектронногоДокумента = Истина;
		КонецЕсли;
		
		Если Не Грузоотправитель_ИНН_Док = ДанныеЗаполнения.Контрагент_ИНН Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'В электронном документе ИНН отправителя %1 отличается от ИНН грузоотправителя %2'"), ДанныеЗаполнения.Контрагент_ИНН, Грузоотправитель_ИНН_Док);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОшибкаОформленияЭлектронногоДокумента = Истина;
		КонецЕсли;
		
		Если Выборка.УчетныйДокументСоздан Тогда
			УчетныйДокумент = Выборка.УчетныйДокумент;
			Если ТипЗнч(УчетныйДокумент) = Тип("ДокументСсылка.СчетФактураПолученный") 
				И ЗначениеЗаполнено(УчетныйДокумент) Тогда
				УчетныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетныйДокумент, "ДокументОснование");
			КонецЕсли;
			СпособОбработки = СпособОбработкиВходящегоДокумента(УчетныйДокумент);
			ТорговыйКомплексОбменСКонтрагентамиЭДО.ДополнитьДанныеЗаполненияТоварами_5_02(ДеревоДанных, ДанныеЗаполнения, СпособОбработки);
		Иначе
			УчетныйДокумент = НайтиВходящийУчетныйДокумент(ДанныеЗаполнения.ВхДокНомер, ДанныеЗаполнения.ВхДокДата, ДанныеЗаполнения.Организация, ДанныеЗаполнения.Контрагент);
			Если ЗначениеЗаполнено(УчетныйДокумент) Тогда
				
				СпособОбработки = СпособОбработкиВходящегоДокумента(УчетныйДокумент);
				
				ИнтеграцияЭДО.УстановитьСвязьЭлектронногоДокументаСОбъектомУчета(Выборка.Ссылка, УчетныйДокумент, СпособОбработки);
				
				ТорговыйКомплексОбменСКонтрагентамиЭДО.ДополнитьДанныеЗаполненияТоварами_5_02(ДеревоДанных, ДанныеЗаполнения, СпособОбработки);
				
				РезультатЗаполнения = ЗаполнитьВходящийУчетныйДокумент(УчетныйДокумент, ДанныеЗаполнения, СпособОбработки);
				Если РезультатЗаполнения.Отказ Тогда
					ТекстОшибки = СтрШаблон(НСтр("ru = 'Заполнение найденного учетного документа выполнено с ошибками:
					|	%1'"), РезультатЗаполнения.ТекстОшибки);
					СписокОшибок.Добавить(ТекстОшибки);
					РезультатПроверки.ЕстьОшибкаОбработкиДокумента = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		РезультатПроверки.ТребуетсяСопоставитьНоменклатуру = (Не Выборка.НоменклатураСопоставлена);
		РезультатПроверки.ТребуетсяНайтиУчетныйДокумент = (НЕ ЗначениеЗаполнено(УчетныйДокумент));
		
		Если РезультатПроверки.ТребуетсяНайтиУчетныйДокумент Тогда
			ТекстОшибки = СтрСоединить(СписокОшибок, Символы.ПС);
			РезультатПроверки.Вставить("ТекстОшибки", ТекстОшибки);
			РегистрыСведений.СостоянияАвтоматическойОбработкиДокументовЭДО.ДобавитьЗапись(Выборка.Ссылка, РезультатПроверки);
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("УчетныйДокумент", УчетныйДокумент);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ТабПоступлениеТоваров.Проведен КАК Проведен,
		|	ТабПоступлениеТоваров.Организация КАК Организация,
		|	ЕСТЬNULL(ТабПоступлениеТоваров.Организация.ИНН, """") КАК Организация_ИНН,
		|	ЕСТЬNULL(ТабПоступлениеТоваров.Организация.КПП, """") КАК Организация_КПП,
		|	ТабПоступлениеТоваров.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	ЕСТЬNULL(ТабПоступлениеТоваров.ПодразделениеКомпании.КПП, """") КАК ПодразделениеКомпании_КПП,
		|	ВЫБОР
		|		КОГДА ТабПоступлениеТоваров.Контрагент.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			ТабПоступлениеТоваров.Контрагент
		|		ИНАЧЕ
		|			ТабПоступлениеТоваров.Контрагент.ГоловнойКонтрагент
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА ТабПоступлениеТоваров.Контрагент.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			ТабПоступлениеТоваров.Контрагент.ИНН
		|		ИНАЧЕ
		|			ТабПоступлениеТоваров.Контрагент.ГоловнойКонтрагент.ИНН
		|	КОНЕЦ КАК Контрагент_ИНН,
		|	ВЫБОР
		|		КОГДА ТабПоступлениеТоваров.Контрагент.ГоловнойКонтрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			ТабПоступлениеТоваров.Контрагент.КПП
		|		ИНАЧЕ
		|			ТабПоступлениеТоваров.Контрагент.ГоловнойКонтрагент.КПП
		|	КОНЕЦ КАК Контрагент_КПП,
		|	ВЫБОР
		|		КОГДА ТабПоступлениеТоваров.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			ТабПоступлениеТоваров.Грузополучатель
		|		КОГДА (НЕ ВЫРАЗИТЬ(ТабПоступлениеТоваров.ПодразделениеКомпании.КПП КАК Строка(2)) = """") И 
		|			(НЕ ТабПоступлениеТоваров.ПодразделениеКомпании.КПП = ТабПоступлениеТоваров.Организация.КПП) ТОГДА
		|			ТабПоступлениеТоваров.ПодразделениеКомпании
		|		ИНАЧЕ
		|			ТабПоступлениеТоваров.Организация
		|	КОНЕЦ КАК Грузополучатель,
		|	ВЫБОР
		|		КОГДА ТабПоступлениеТоваров.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			ТабПоступлениеТоваров.Грузоотправитель
		|		ИНАЧЕ
		|			ТабПоступлениеТоваров.Контрагент
		|	КОНЕЦ КАК Грузоотправитель,
		|	ВЫБОР
		|		КОГДА ТабПоступлениеТоваров.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			ТабПоступлениеТоваров.Грузополучатель.ИНН
		|		ИНАЧЕ
		|			ТабПоступлениеТоваров.Организация.ИНН
		|	КОНЕЦ КАК Грузополучатель_ИНН,
		|	ВЫБОР
		|		КОГДА ТабПоступлениеТоваров.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			ТабПоступлениеТоваров.Грузоотправитель.ИНН
		|		ИНАЧЕ
		|			ТабПоступлениеТоваров.Контрагент.ИНН
		|	КОНЕЦ КАК Грузоотправитель_ИНН,
		|	ВЫБОР
		|		КОГДА ТабПоступлениеТоваров.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			ТабПоступлениеТоваров.Грузополучатель.КПП
		|		КОГДА (НЕ ВЫРАЗИТЬ(ТабПоступлениеТоваров.ПодразделениеКомпании.КПП КАК Строка(2)) = """") И 
		|			(НЕ ТабПоступлениеТоваров.ПодразделениеКомпании.КПП = ТабПоступлениеТоваров.Организация.КПП) ТОГДА
		|			ТабПоступлениеТоваров.ПодразделениеКомпании.КПП
		|		ИНАЧЕ
		|			ТабПоступлениеТоваров.Организация.КПП
		|	КОНЕЦ КАК Грузополучатель_КПП,
		|	ВЫБОР
		|		КОГДА ТабПоступлениеТоваров.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			ТабПоступлениеТоваров.Грузоотправитель.КПП
		|		ИНАЧЕ
		|			ТабПоступлениеТоваров.Контрагент.КПП
		|	КОНЕЦ КАК Грузоотправитель_КПП,
		|	ТабПоступлениеТоваров.ВалютаДокумента КАК ВалютаДокумента,
		|	ЕСТЬNULL(ТабПоступлениеТоваров.ВалютаДокумента.Код, """") КАК КодВалюты,
		|	ТабПоступлениеТоваров.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.ПоступлениеТоваров КАК ТабПоступлениеТоваров
		|ГДЕ
		|	ТабПоступлениеТоваров.Ссылка = &УчетныйДокумент
		|;
		|
		|ВЫБРАТЬ
		|	ТабПоступлениеТоваровТовары.НомерСтроки КАК НомерСтроки,
		|	ТабПоступлениеТоваровТовары.Номенклатура КАК Номенклатура,
		|	ТабПоступлениеТоваровТовары.НоменклатураПоставщика КАК НоменклатураКонтрагента,
		|	ТабПоступлениеТоваровТовары.Количество КАК Количество,
		|	ТабПоступлениеТоваровТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТабПоступлениеТоваровТовары.Коэффициент КАК Коэффициент,
		|	ТабПоступлениеТоваровТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТабПоступлениеТоваровТовары.КоличествоБазовое КАК КоличествоБазовое,
		|	ТабПоступлениеТоваровТовары.Цена КАК Цена,
		|	ТабПоступлениеТоваровТовары.ЦенаДок КАК ЦенаДок,
		|	ТабПоступлениеТоваровТовары.СуммаДок КАК СуммаДок,
		|	ТабПоступлениеТоваровТовары.КоличествоДок КАК КоличествоДок,
		|	ТабПоступлениеТоваровТовары.Сумма КАК Сумма,
		|	ТабПоступлениеТоваровТовары.СуммаВсего КАК СуммаВсего,
		|	ТабПоступлениеТоваровТовары.СтавкаНДС КАК СтавкаНДС,
		|	ТабПоступлениеТоваровТовары.СуммаНДС КАК СуммаНДС,
		|	ТабПоступлениеТоваровТовары.ГТД КАК ГТД
		|ИЗ
		|	Документ.ПоступлениеТоваров.Товары КАК ТабПоступлениеТоваровТовары
		|ГДЕ
		|	ТабПоступлениеТоваровТовары.Ссылка = &УчетныйДокумент
		|;
		|
		|ВЫБРАТЬ
		|	ТабПоступлениеТоваровМарки.КодМарки КАК КодМарки,
		|	ТабПоступлениеТоваровМарки.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТабПоступлениеТоваровМарки.СтатусПроверки КАК СтатусПроверки
		|ИЗ
		|	Документ.ПоступлениеТоваров.Марки КАК ТабПоступлениеТоваровМарки
		|ГДЕ
		|	ТабПоступлениеТоваровМарки.Ссылка = &УчетныйДокумент
		|";
		
		ПакетыЗапросов = Запрос.ВыполнитьПакет();
		ШапкаУчетногоДокумента  = ПакетыЗапросов[ПакетыЗапросов.Количество()-3].Выбрать();
		ТоварыУчетногоДокумента = ПакетыЗапросов[ПакетыЗапросов.Количество()-2].Выгрузить();
		МаркиУчетногоДокумента  = ПакетыЗапросов[ПакетыЗапросов.Количество()-1].Выгрузить();
		
		ШапкаУчетногоДокумента.Следующий();
		
		РезультатПроверки.ТребуетсяПровестиУчетныйДокумент = (Не ШапкаУчетногоДокумента.Проведен);
		
		Если Не ШапкаУчетногоДокумента.ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Валюта %1 в учетном документе отличается от валюты %2 в электронном документе'"), ШапкаУчетногоДокумента.ВалютаДокумента, ДанныеЗаполнения.ВалютаДокумента);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОтличияВСведенияхДокумента = Истина;
		КонецЕсли;
		
		Если Не ШапкаУчетногоДокумента.Организация_ИНН = ДанныеЗаполнения.Организация_ИНН Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'ИНН организации %1 в учетном документе отличается от ИНН покупателя %2 в электронном документе'"), ШапкаУчетногоДокумента.Организация_ИНН, ДанныеЗаполнения.Организация_ИНН);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОтличияВСведенияхДокумента = Истина;
		КонецЕсли;
		
		Если Не ШапкаУчетногоДокумента.Организация_КПП = ДанныеЗаполнения.Организация_КПП
			И (Не ШапкаУчетногоДокумента.ПодразделениеКомпании_КПП = ДанныеЗаполнения.Организация_КПП) Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'КПП организации %1 в учетном документе отличается от КПП покупателя %2 в электронном документе'"), ШапкаУчетногоДокумента.Организация_КПП, ДанныеЗаполнения.Организация_КПП);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОтличияВСведенияхДокумента = Истина;
		КонецЕсли;
		
		Если Не ШапкаУчетногоДокумента.Контрагент_ИНН = ДанныеЗаполнения.Контрагент_ИНН Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'ИНН продавца %1 в учетном документе отличается от ИНН продавца %2 в электронном документе'"), ШапкаУчетногоДокумента.Контрагент_ИНН, ДанныеЗаполнения.Контрагент_ИНН);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОтличияВСведенияхДокумента = Истина;
		КонецЕсли;
		
		Если Не ШапкаУчетногоДокумента.Контрагент_КПП = ДанныеЗаполнения.Контрагент_КПП Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'КПП организации %1 в учетном документе отличается от КПП покупателя %2 в электронном документе'"), ШапкаУчетногоДокумента.Контрагент_КПП, ДанныеЗаполнения.Контрагент_КПП);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОтличияВСведенияхДокумента = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ШапкаУчетногоДокумента.Грузополучатель_ИНН) Тогда
			Грузополучатель_ИНН = ШапкаУчетногоДокумента.Грузополучатель_ИНН;
		Иначе
			Грузополучатель_ИНН = ШапкаУчетногоДокумента.Организация_ИНН;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ШапкаУчетногоДокумента.Грузополучатель_КПП) Тогда
			Грузополучатель_КПП = ШапкаУчетногоДокумента.Грузополучатель_КПП;
		Иначе
			Грузополучатель_КПП = ШапкаУчетногоДокумента.Организация_КПП;
		КонецЕсли;
		
		Если Не Грузополучатель_ИНН = Грузополучатель_ИНН_Док Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'ИНН грузополучателя %1 в учетном документе отличается от ИНН грузополучателя %2 в электронном документе'"), Грузополучатель_ИНН, Грузополучатель_ИНН_Док);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОтличияВСведенияхДокумента = Истина;
		КонецЕсли;
		
		Если Не Грузополучатель_КПП = Грузополучатель_КПП_Док Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'КПП грузополучателя %1 в учетном документе отличается от КПП грузополучателя %2 в электронном документе'"), Грузополучатель_КПП, Грузополучатель_КПП_Док);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОтличияВСведенияхДокумента = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ШапкаУчетногоДокумента.Грузоотправитель_ИНН) Тогда
			Грузоотправитель_ИНН = ШапкаУчетногоДокумента.Грузоотправитель_ИНН;
		Иначе
			Грузоотправитель_ИНН = ШапкаУчетногоДокумента.Контрагент_ИНН;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ШапкаУчетногоДокумента.Грузоотправитель_КПП) Тогда
			Грузоотправитель_КПП = ШапкаУчетногоДокумента.Грузоотправитель_КПП;
		Иначе
			Грузоотправитель_КПП = ШапкаУчетногоДокумента.Контрагент_КПП;
		КонецЕсли;
		
		Если Не Грузоотправитель_ИНН = Грузоотправитель_ИНН_Док Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'ИНН грузоотправителя %1 в учетном документе отличается от ИНН грузоотправителя %2 в электронном документе'"), Грузоотправитель_ИНН, Грузоотправитель_ИНН_Док);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОтличияВСведенияхДокумента = Истина;
		КонецЕсли;
		
		Если Не Грузоотправитель_КПП = Грузоотправитель_КПП_Док Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'КПП грузоотправителя %1 в учетном документе отличается от КПП грузоотправителя %2 в электронном документе'"), Грузоотправитель_КПП, Грузоотправитель_КПП_Док);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОтличияВСведенияхДокумента = Истина;
		КонецЕсли;
		
		СуммаВсего = ТоварыУчетногоДокумента.Итог("СуммаВсего");
		СуммаНДС   = ТоварыУчетногоДокумента.Итог("СуммаНДС");
		
		ОтклонениеСуммыДокумента = ТорговыйКомплексКлиентСервер.МодульЧисла(СуммаВсего - ДанныеЗаполнения.СуммаВсего);
		ОтклонениеСуммыНДС       = ТорговыйКомплексКлиентСервер.МодульЧисла(СуммаНДС - ДанныеЗаполнения.СуммаНДС);
		
		Если ОтклонениеСуммыДокумента > ДопустимоеОтклонениеСуммыДокумента Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Сумма с НДС %1 в учетном документе отличается от суммы с НДС %2 в электронном документе'"), СуммаВсего, ДанныеЗаполнения.СуммаВсего);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОтличияВСведенияхТоваров = Истина;
		КонецЕсли;
		
		Если ОтклонениеСуммыНДС > ДопустимоеОтклонениеСуммыНДСДокумента Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Сумма НДС %1 в учетном документе отличается от суммы НДС %2 в электронном документе'"), СуммаНДС, ДанныеЗаполнения.СуммаНДС);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОтличияВСведенияхТоваров = Истина;
		КонецЕсли;
		
		Для Каждого ТекущаяСтрока Из ТоварыУчетногоДокумента Цикл
			
			Если Не ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Сумма НДС %1 в учетном документе отличается от суммы НДС %2 в электронном документе'"), СуммаНДС, ДанныеЗаполнения.СуммаНДС);
				СписокОшибок.Добавить(ТекстОшибки);
				РезультатПроверки.ЕстьОтличияВСведенияхТоваров = Истина;
			КонецЕсли;
			
			Если Не ТекущаяСтрока.Количество = ТекущаяСтрока.КоличествоДок Тогда
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Сумма НДС %1 в учетном документе отличается от суммы НДС %2 в электронном документе'"), СуммаНДС, ДанныеЗаполнения.СуммаНДС);
				СписокОшибок.Добавить(ТекстОшибки);
				РезультатПроверки.ЕстьОтличияВСведенияхТоваров = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		КодыМаркировкиДок = ДанныеЗаполнения.КодыМаркировки.Скопировать();
		
		ТоварныеСтрокиУКоторыхМаркиНеНайденыВУПД = Новый Массив;
		Для Каждого СтрокаМаркировки Из МаркиУчетногоДокумента Цикл
			НайденнаяСтрока = КодыМаркировкиДок.Найти(СтрокаМаркировки.КодМарки, "КодМарки");
			Если НайденнаяСтрока = Неопределено Тогда
				Если ТоварныеСтрокиУКоторыхМаркиНеНайденыВУПД.Найти(СтрокаМаркировки.ИдентификаторСтроки) = Неопределено Тогда
					ТоварныеСтрокиУКоторыхМаркиНеНайденыВУПД.Добавить(СтрокаМаркировки.ИдентификаторСтроки);
				КонецЕсли;
			Иначе
				КодыМаркировкиДок.Удалить(НайденнаяСтрока);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекущаяСтрока Из ТоварныеСтрокиУКоторыхМаркиНеНайденыВУПД Цикл
			ТоварнаяСтрока = ТоварыУчетногоДокумента.Найти(ТекущаяСтрока.ИдентификаторСтроки, "ИдентификаторСтроки");
			Если ТоварнаяСтрока = Неопределено Тогда
				Номенклатура = "";
				НомерСтроки  = "99999";
			Иначе
				Номенклатура = ТоварнаяСтрока.Номенклатура;
				НомерСтроки  = ТоварнаяСтрока.НомерСтроки;
			КонецЕсли;
			ТекстОшибки = СтрШаблон(НСтр("ru = 'В товарной строке %1 для номенклатуры %2 найдены коды маркировки, которых нет в электронном документе'"), НомерСтроки, Номенклатура);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОтличияВСведенияхТоваров = Истина;
		КонецЦикла;
		
		ПерезаписатьДокумент = Ложь;
		
		ТоварныеСтрокиУКоторыхМаркиНеНайденыВУчетномДокументе = Новый Соответствие;
		Если КодыМаркировкиДок.Количество()> 0 Тогда
			
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(УчетныйДокумент);
			
			ДокументОбъект = УчетныйДокумент.ПолучитьОбъект();
			
			ПараметрыДействия = МенеджерОбъекта.ПолучитьПараметрыДействия(ДокументОбъект);
			
			Для Каждого СтрокаМаркировки Из КодыМаркировкиДок Цикл
				ТоварнаяСтрока = ТоварныеСтрокиУКоторыхМаркиНеНайденыВУчетномДокументе.Получить(СтрокаМаркировки.ИдентификаторСтроки);
				Если ТоварнаяСтрока = Неопределено Тогда
					
					СтрокаТЧ = ДокументОбъект.Товары.Найти(СтрокаМаркировки.ИдентификаторСтроки, "ИдентификаторСтроки");
					
					Если Не СтрокаТЧ = Неопределено Тогда
						НоваяСтрока = ДокументОбъект.Марки.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМаркировки);
						ТоварныеСтрокиУКоторыхМаркиНеНайденыВУчетномДокументе.Вставить(СтрокаМаркировки.ИдентификаторСтроки, СтрокаТЧ);
						ПерезаписатьДокумент = Истина;
						Продолжить;
					КонецЕсли;
					
					//Результат = ШтрихкодированиеМПСервер.Функция ОбработкаМаркиПоступления(Неопределено, ДокументОбъект, СтрокаМаркировки.КодМарки, ПараметрыДействия);
					СтрокаТоваров = ДанныеЗаполнения.Товары.Найти(СтрокаМаркировки.ИдентификаторСтроки, "ИдентификаторСтроки");
					
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("Номенклатура", СтрокаТоваров.Номенклатура);
					Если ЗначениеЗаполнено(СтрокаТоваров.ЕдиницаИзмерения) Тогда
						СтруктураПоиска.Вставить("ЕдиницаИзмерения", СтрокаТоваров.ЕдиницаИзмерения);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаТоваров.ГТД) Тогда
						СтруктураПоиска.Вставить("ГТД", СтрокаТоваров.ГТД);
					КонецЕсли;
					
					СтрокаТЧ = ДокументОбъект.Товары.НайтиСтроки(СтруктураПоиска);
					Если СтрокаТЧ = Неопределено Тогда
						СтрокаТЧ = ДокументОбъект.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТоваров);
						МенеджерОбъекта.ТоварыСуммаВсегоПриИзменении(ДокументОбъект, СтрокаТЧ, ПараметрыДействия);
						СтрокаТЧ.НоменклатураПоставщика = СтрокаТоваров.НоменклатураПоставщика;
						ПерезаписатьДокумент = Истина;
					КонецЕсли;
					НоваяСтрока = ДокументОбъект.Марки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМаркировки);
					НоваяСтрока.ИдентификаторСтроки = СтрокаТЧ.ИдентификаторСтроки;
					ТоварныеСтрокиУКоторыхМаркиНеНайденыВУчетномДокументе.Вставить(СтрокаМаркировки.ИдентификаторСтроки, СтрокаТЧ);
					ПерезаписатьДокумент = Истина;
				Иначе
					НоваяСтрока = ДокументОбъект.Марки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМаркировки);
					НоваяСтрока.ИдентификаторСтроки = СтрокаТЧ.ИдентификаторСтроки;
					ПерезаписатьДокумент = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ТаблицаМарок = МаркиУчетногоДокумента;
		Если ПерезаписатьДокумент Тогда
			Попытка
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
				ТаблицаМарок = ДокументОбъект.Марки;
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
				СписокОшибок.Добавить(ТекстОшибки);
				РезультатПроверки.ЕстьОшибкаОбработкиДокумента = Истина;
			КонецПопытки;
		КонецЕсли;
		
		КоличествоКодовМаркировкиВУчетномДокументе = ТаблицаМарок.Количество();
		КоличествоКодовМаркировки = ДанныеЗаполнения.КодыМаркировки.Количество();
		
		ЕстьРасхождениеПоКоличествуКодовМаркировки = (Не КоличествоКодовМаркировки = КоличествоКодовМаркировкиВУчетномДокументе);
		Если ЕстьРасхождениеПоКоличествуКодовМаркировки Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Количество кодов маркировки %1 в учетном документе отличается от количества кодов маркировки %2 в электронном документе'"), КоличествоКодовМаркировкиВУчетномДокументе, КоличествоКодовМаркировки);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОтличияВСведенияхКодовМаркировки = Истина;
		КонецЕсли;
		
		КодыМаркировкиИзлишки   = Новый Массив;
		КодыМаркировкиНедостача = Новый Массив;
		КодыМаркировкиОшибки    = Новый Массив;
		
		НеПроверялась = Перечисления.СтатусыПроверкиМаркированнойПродукции.НеПроверялась;
		НеЧислилась   = Перечисления.СтатусыПроверкиМаркированнойПродукции.НеЧислилась;
		ПустойСтатус  = Перечисления.СтатусыПроверкиМаркированнойПродукции.ПустаяСсылка();
		Отсутствует   = Перечисления.СтатусыПроверкиМаркированнойПродукции.Отсутствует;
		Для Каждого СтрокаМаркировки Из ТаблицаМарок Цикл
			Если СтрокаМаркировки.СтатусПроверки = НеПроверялась Тогда
				КодыМаркировкиНедостача.Добавить(СтрокаМаркировки.КодМарки);
			ИначеЕсли СтрокаМаркировки.СтатусПроверки = НеЧислилась Тогда
				КодыМаркировкиИзлишки.Добавить(СтрокаМаркировки.КодМарки);
			ИначеЕсли СтрокаМаркировки.СтатусПроверки = ПустойСтатус Тогда
				КодыМаркировкиОшибки.Добавить(СтрокаМаркировки.КодМарки);
			ИначеЕсли СтрокаМаркировки.СтатусПроверки = Отсутствует Тогда
				КодыМаркировкиОшибки.Добавить(СтрокаМаркировки.КодМарки);
			КонецЕсли;
		КонецЦикла;
		
		Если КодыМаркировкиНедостача.Количество()>0 Тогда
			ТекстКодовМаркировки = СтрСоединить(КодыМаркировкиНедостача, Символы.ПС);
			ТекстОшибки = СтрШаблон(НСтр("ru = 'У документа %1 найдены не отсканированные коды маркировки:
			|	%2'"), УчетныйДокумент, ТекстКодовМаркировки);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОтличияВСведенияхКодовМаркировки = Истина;
		КонецЕсли;
		
		Если КодыМаркировкиИзлишки.Количество()>0 Тогда
			ТекстКодовМаркировки = СтрСоединить(КодыМаркировкиИзлишки, Символы.ПС);
			ТекстОшибки = СтрШаблон(НСтр("ru = 'У документа %1 найдены отсканированные коды маркировки, которых нет в электронном документе:
			|	%2'"), УчетныйДокумент, ТекстКодовМаркировки);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОтличияВСведенияхКодовМаркировки = Истина;
		КонецЕсли;
		
		Если КодыМаркировкиОшибки.Количество()>0 Тогда
			ТекстКодовМаркировки = СтрСоединить(КодыМаркировкиОшибки, Символы.ПС);
			ТекстОшибки = СтрШаблон(НСтр("ru = 'У документа %1 найдены коды маркировки с некорректными статусами:
			|	%2'"), УчетныйДокумент, ТекстКодовМаркировки);
			СписокОшибок.Добавить(ТекстОшибки);
			РезультатПроверки.ЕстьОтличияВСведенияхКодовМаркировки = Истина;
		КонецЕсли;
		
		Если ДанныеЗаполнения.СуммаНДС>0 Тогда
			СчетФактура = Документы.СчетФактураПолученный.СчетФактураДокумента(УчетныйДокумент);
			Если ЗначениеЗаполнено(СчетФактура) Тогда
				СчетФактураНеПроведена = (Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетФактура, "Проведен"));
				Если СчетФактураНеПроведена Тогда
					ТекстОшибки = СтрШаблон(НСтр("ru = 'У документа %1 счет-фактура не проведена'"), УчетныйДокумент);
					СписокОшибок.Добавить(ТекстОшибки);
					РезультатПроверки.ЕстьОшибкаОформленияУчетногоДокумента = Истина;
				КонецЕсли;
			Иначе
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Для документа %1 не найдена счет-фактура'"), УчетныйДокумент);
				СписокОшибок.Добавить(ТекстОшибки);
				РезультатПроверки.ЕстьОшибкаОформленияУчетногоДокумента = Истина;
			КонецЕсли;
		КонецЕсли;
		
		ЕстьОшибки = Ложь;
		Для Каждого СтрокаПроверки Из РезультатПроверки Цикл
			
			Если СтрокаПроверки.Значение Тогда
				ЕстьОшибки = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		РезультатПроверки.Вставить("Подписать", Не ЕстьОшибки);
		РезультатПроверки.Вставить("Утвердить", Не ЕстьОшибки);
		
		ТекстОшибки = СтрСоединить(СписокОшибок, Символы.ПС);
		РезультатПроверки.Вставить("ТекстОшибки", ТекстОшибки);
		
		РегистрыСведений.СостоянияАвтоматическойОбработкиДокументовЭДО.ДобавитьЗапись(Выборка.Ссылка, РезультатПроверки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодписатьВходящиеДокументыЭДО(ИдентификаторУчетнойЗаписи, СертификатыУчетнойЗаписи, ОтпечаткиСертификатов, ПараметрыОбработки, КонтекстДиагностики)
	
	ПодписатьИОтправить = ПолучитьЗначениеПараметраСтруктуры(ПараметрыОбработки, "ПодписатьИОтправить", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторОрганизации", ИдентификаторУчетнойЗаписи);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СостоянияАвтоматическойОбработкиДокументовЭДО.ЭлектронныйДокумент КАК ЭлектронныйДокумент
	|ИЗ
	|	РегистрСведений.СостоянияАвтоматическойОбработкиДокументовЭДО КАК СостоянияАвтоматическойОбработкиДокументовЭДО
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
	|ПО
	|	СостоянияАвтоматическойОбработкиДокументовЭДО.ЭлектронныйДокумент = СостоянияДокументовЭДО.ЭлектронныйДокумент
	|ГДЕ
	|	СостоянияАвтоматическойОбработкиДокументовЭДО.Подписать = ИСТИНА
	|	И СостоянияАвтоматическойОбработкиДокументовЭДО.ЭлектронныйДокумент.ИдентификаторОрганизации = &ИдентификаторОрганизации
	|	И (СостоянияДокументовЭДО.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.ТребуетсяПодписание))
	|";
	
	ЭлектронныеДокументы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЭлектронныйДокумент");
	
	Если ЭлектронныеДокументы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполнения = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполнения.ОбъектыДействий.ИдентификаторыОрганизаций.Добавить(ИдентификаторУчетнойЗаписи);
	ПараметрыВыполнения.ОтпечаткиСертификатов = ОтпечаткиСертификатов;
	ПараметрыВыполнения.ОбъектыДействий.ЭлектронныеДокументы = ЭлектронныеДокументы;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрыВыполнения.ВыбранныеСертификаты, СертификатыУчетнойЗаписи);
	
	НаборДействий = ПараметрыВыполнения.НаборДействий;
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, Перечисления.ДействияПоЭДО.Утвердить);
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, Перечисления.ДействияПоЭДО.СформироватьОтвет);
	Если ПодписатьИОтправить Тогда
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, Перечисления.ДействияПоЭДО.Подписать);
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, Перечисления.ДействияПоЭДО.ПодготовитьКОтправке);
		ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(НаборДействий, Перечисления.ДействияПоЭДО.Отправить);
	КонецЕсли;
	
	РезультатОтправкиИзвещений = ЭлектронныеДокументыЭДОСлужебный.ВыполнитьДействияЭДО(ПараметрыВыполнения, КонтекстДиагностики);

	ДиагностикаЭДО.ОбработатьОшибки(КонтекстДиагностики);
	
КонецПроцедуры

Процедура АвтоматическаяОбработкаДокументовЭДОПоИдентификатору(ИдентификаторУчетнойЗаписи, ПараметрыОбработки, СертификатыПоУчетнымЗаписямЭДО, ОтпечаткиСертификатов, КонтекстДиагностики)
	
	ПолучатьИРаспаковывать = ПолучитьЗначениеПараметраСтруктуры(ПараметрыОбработки, "ПолучатьИРаспаковывать", Ложь);
	Утверждать             = ПолучитьЗначениеПараметраСтруктуры(ПараметрыОбработки, "Утверждать", Ложь);
	ПодписатьИОтправить    = ПолучитьЗначениеПараметраСтруктуры(ПараметрыОбработки, "ПодписатьИОтправить", Ложь);
	
	ВидОперации = НСтр("ru = 'Автоматическая обработка документов ЭДО'");
	
	СертификатыУчетнойЗаписи = СертификатыПоУчетнымЗаписямЭДО[ИдентификаторУчетнойЗаписи];
	Если Не ЗначениеЗаполнено(СертификатыУчетнойЗаписи) Тогда
		ШаблонСообщения = НСтр("ru = 'В процессе автоматического подписания документов ЭДО произошла ошибка: Для учетной записи <%1> нет доступных сертификатов'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ИдентификаторУчетнойЗаписи);
			
			Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
				ВидОшибкиСертификатыНаСервереНедоступны(), ТекстСообщения, ТекстСообщения);
			ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, "ТорговыйКомплексЭДО");
		Возврат;
	КонецЕсли;
	
	Если ПолучатьИРаспаковывать Тогда
		
		Попытка
			ПолучитьВходящиеДокументыЭДОПоИдентификатору(ИдентификаторУчетнойЗаписи, СертификатыУчетнойЗаписи, ОтпечаткиСертификатов, ПараметрыОбработки, КонтекстДиагностики);
		Исключение
			ШаблонСообщения = НСтр("ru = 'В процессе автоматической обработки документов ЭДО произошла ошибка: %1'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, 
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
				ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(), ТекстСообщения, ТекстСообщения);
			ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, "ТорговыйКомплексЭДО");
		КонецПопытки;
		
	КонецЕсли;
	
	Если Утверждать ИЛИ ПодписатьИОтправить Тогда
		
		ОбработатьВходящиеДокументыЭДО(ИдентификаторУчетнойЗаписи, ПараметрыОбработки);
		
		Попытка
			ПодписатьВходящиеДокументыЭДО(ИдентификаторУчетнойЗаписи, СертификатыУчетнойЗаписи, ОтпечаткиСертификатов, ПараметрыОбработки, КонтекстДиагностики);
		Исключение
			ШаблонСообщения = НСтр("ru = 'В процессе автоматического подписания документов ЭДО произошла ошибка: %1'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
				ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(), ТекстСообщения, ТекстСообщения);
			ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, "ТорговыйКомплексЭДО");
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура АвтоматическаяОбработкаДокументовЭДОМногопоточныйРежим(ПараметрыОбработки)
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		ВызватьИсключение НСтр("ru = 'Многопоточное задание работает только в клиент-серверном режиме!'");
	КонецЕсли;
	
	ИнФТекущегоСеанса = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ИнФТекущегоСеанса.ПолучитьФоновоеЗадание();
	Если ФоновоеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидЗадания = Справочники.МногопоточныеЗадания.АвтоматическаяОбработкаДокументовЭДО;
	УникальныйИдентификатор = ФоновоеЗадание.УникальныйИдентификатор;
	МенеджерПотоков = Строка(УникальныйИдентификатор);
	ВремяЖизниПотока = 300;
	Пакеты = Новый Массив;
	
	ТаблицаПотоков = РаботаСМногопоточнымиЗаданиями.ПолучитьТекущуюТаблицуПотоков(Пакеты, ВидЗадания, МенеджерПотоков, ВремяЖизниПотока);
	
	ИдентификаторыУчетныхЗаписей = ПолучитьСвободныеИдентификаторыУчетныхЗаписей();
	
	ИмяМетода = "ТорговыйКомплексЭДО.ЗапуститьПотокОбработкиДокументовЭДО";
	
	Для Каждого ИдентификаторУчетнойЗаписи Из ИдентификаторыУчетныхЗаписей Цикл
		
		НомерПакета = Строка(Новый УникальныйИдентификатор);
		Пакеты.Добавить(НомерПакета);
		
		МенеджерЗаписи = РегистрыСведений.ПакетыМногопоточныхЗаданий.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ВидЗадания      = ВидЗадания;
		МенеджерЗаписи.НомерПакета     = НомерПакета;
		МенеджерЗаписи.МенеджерПотоков = МенеджерПотоков;
		МенеджерЗаписи.КОбработке      = Истина;
		МенеджерЗаписи.Объект          = ИдентификаторУчетнойЗаписи;
		МенеджерЗаписи.ДатаСоздания    = ТекущаяДатаСеанса();
		МенеджерЗаписи.ПараметрыПакета = Новый ХранилищеЗначения(ПараметрыОбработки);
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	ПараметрыФонового = Новый Структура;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяМетода",      ИмяМетода);
	//ДопПараметры.Вставить("ПакетовВПотоке", 1);
	//ДопПараметры.Вставить("ПределПотоков",  ПределПотоков);
	
	РаботаСМногопоточнымиЗаданиями.ВыполнитьПакетыЗаданий(Пакеты, ВидЗадания, УникальныйИдентификатор, ДопПараметры, ПараметрыФонового, ТаблицаПотоков);
	
КонецПроцедуры

Процедура АвтоматическаяОбработкаДокументовЭДООднопоточныйРежим(ПараметрыОбработки)
	
	ПолучатьИРаспаковывать = ПолучитьЗначениеПараметраСтруктуры(ПараметрыОбработки, "ПолучатьИРаспаковывать", Ложь);
	Утверждать             = ПолучитьЗначениеПараметраСтруктуры(ПараметрыОбработки, "Утверждать", Ложь);
	ПодписатьИОтправить    = ПолучитьЗначениеПараметраСтруктуры(ПараметрыОбработки, "ПодписатьИОтправить", Ложь);
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	Если Не (ПолучатьИРаспаковывать ИЛИ Утверждать ИЛИ ПодписатьИОтправить) Тогда
		
		ВидОшибки = ВидОшибкиНеНастроеныОперацииЭДО();
		
		ВидОперации = НСтр("ru = 'Проверка доступных операций автоматической обработки ЭДО'");
		ТекстОшибки = НСтр("ru = 'В параметрах регламентного задания <Автоматическая обработка документов ЭДО> отключены все доступные операции'", ОбщегоНазначения.КодОсновногоЯзыка());
		Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации, ВидОшибки, ТекстОшибки, ТекстОшибки);
		ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, "ТорговыйКомплексЭДО", Истина);
		
		ДиагностикаЭДО.ОбработатьОшибки(КонтекстДиагностики);
		Возврат;
	КонецЕсли;
	
	Если Не КриптографияБЭД.КриптооперацииДоступныНаСервере() Тогда
		ВидОшибки = ВидОшибкиКриптопровайдерНаСервереНедоступен();
		
		ВидОперации = НСтр("ru = 'Проверка доступности автоматического получения ЭДО'");
		ТекстОшибки = НСтр("ru = 'Криптопровайдер на сервере недоступен'");
		Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации, ВидОшибки, ТекстОшибки, ТекстОшибки);
		ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, "ТорговыйКомплексЭДО", Истина);
		
		ДиагностикаЭДО.ОбработатьОшибки(КонтекстДиагностики);
		Возврат;
	КонецЕсли;
	
	Если Не КриптографияБЭД.ДоступнаПроверкаПодписиНаСервере() Тогда
		ВидОшибки = ВидОшибкиПроверкаПодписейНедоступна();
		
		ВидОперации = НСтр("ru = 'Проверка доступности автоматического получения ЭДО'");
		ТекстОшибки = НСтр("ru = 'Проверка электронных подписей на сервере недоступна'");
		Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации, ВидОшибки, ТекстОшибки, ТекстОшибки);
		ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, "ТорговыйКомплексЭДО", Истина);
		
		ДиагностикаЭДО.ОбработатьОшибки(КонтекстДиагностики);
		Возврат;
	КонецЕсли;
	
	ИдентификаторыУчетныхЗаписей = УчетныеЗаписиЭДО.ИдентификаторыУчетныхЗаписейСпособаОбмена(Перечисления.СпособыОбменаЭД.ЧерезСервис1СЭДО, Ложь);
	
	УстановитьПривилегированныйРежим(Истина);
	СертификатыПоУчетнымЗаписямЭДО = УчетныеЗаписиЭДО.ДействующиеСертификатыПоУчетнымЗаписям(ИдентификаторыУчетныхЗаписей);
	УстановитьПривилегированныйРежим(Ложь);
	
	ВидОперации = НСтр("ru = 'Автоматическая обработка документов ЭДО'");
	
	ОтпечаткиСертификатов = КриптографияБЭД.ПолучитьОтпечаткиСертификатов(ВидОперации, КонтекстДиагностики);
	
	Если Не ЗначениеЗаполнено(ОтпечаткиСертификатов.Сервер) Тогда
		ТекстОшибки = НСтр("ru = 'На сервере нет доступных сертификатов'", ОбщегоНазначения.КодОсновногоЯзыка());
		ДиагностикаЭДО.ОбработатьОшибки(КонтекстДиагностики);
		Возврат;
	КонецЕсли;
	
	Для Каждого ИдентификаторУчетнойЗаписи Из ИдентификаторыУчетныхЗаписей Цикл
		
		АвтоматическаяОбработкаДокументовЭДОПоИдентификатору(ИдентификаторУчетнойЗаписи, ПараметрыОбработки, СертификатыПоУчетнымЗаписямЭДО, ОтпечаткиСертификатов, КонтекстДиагностики);
		
	КонецЦикла;
	
	ДиагностикаЭДО.ОбработатьОшибки(КонтекстДиагностики);
	
КонецПроцедуры

Процедура ЗапуститьПотокОбработкиДокументовЭДО(Знач ПараметрыЗадания) Экспорт
	
	ИнФТекущегоСеанса = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ИнФТекущегоСеанса.ПолучитьФоновоеЗадание();
	Если ФоновоеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторФоновогоЗадания = ФоновоеЗадание.УникальныйИдентификатор;
	
	Если ТипЗнч(ПараметрыЗадания) <> Тип("Структура") Тогда
		ПараметрыЗадания = Новый Структура;
	КонецЕсли;
	
	ПараметрыЗаданияПоУмолчанию = ТорговыйКомплексЭДО.ПараметрыАвтоматическойОбработкиДокументовЭДО();
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыЗадания, ПараметрыЗаданияПоУмолчанию, Ложь);
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.АвтоматическаяОбработкаДокументовЭДО);
	Если РегламентноеЗадание.Параметры.Количество()>0 Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗадания, РегламентноеЗадание.Параметры[0]);
	КонецЕсли;
	
	ИдентификаторМенеджераПотоков = ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗадания, "ИдентификаторМенеджераПотоков");
	ИдентификаторПотока           = ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗадания, "ИдентификаторПотока");
	
	ВидЗадания = Справочники.МногопоточныеЗадания.АвтоматическаяОбработкаДокументовЭДО;
	
	НастройкиЗадания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидЗадания, "ВремяБездействияПотока, КоличествоОшибокВПотоке");
	ВремяБездействияПотока  = НастройкиЗадания.ВремяБездействияПотока;
	КоличествоОшибокВПотоке = НастройкиЗадания.КоличествоОшибокВПотоке;
	
	ВремяБездействияПотока  = ?(ВремяБездействияПотока = 0, 300, ВремяБездействияПотока);
	КоличествоОшибокВПотоке = ?(КоличествоОшибокВПотоке = 0, 1, КоличествоОшибокВПотоке);
	
	ПолучатьИРаспаковывать = ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗадания, "ПолучатьИРаспаковывать", Ложь);
	Утверждать             = ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗадания, "Утверждать", Ложь);
	ПодписатьИОтправить    = ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗадания, "ПодписатьИОтправить", Ложь);
	
	КриптопровайдерНастроен = Истина;
	Если Не КриптографияБЭД.КриптооперацииДоступныНаСервере() Тогда
		ВидОшибки = ВидОшибкиКриптопровайдерНаСервереНедоступен();
		КриптопровайдерНастроен = Истина;
	КонецЕсли;
	
	ДоступнаПроверкаПодписи = Истина;
	Если Не КриптографияБЭД.ДоступнаПроверкаПодписиНаСервере() Тогда
		ВидОшибки = ВидОшибкиПроверкаПодписейНедоступна();
		ДоступнаПроверкаПодписи = Ложь;
	КонецЕсли;
	
	ОперацииВключены = Истина;
	Если Не (ПолучатьИРаспаковывать ИЛИ Утверждать ИЛИ ПодписатьИОтправить) Тогда
		ОперацииВключены = Ложь;
	КонецЕсли;
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	ИдентификаторыУчетныхЗаписей = УчетныеЗаписиЭДО.ИдентификаторыУчетныхЗаписейСпособаОбмена(Перечисления.СпособыОбменаЭД.ЧерезСервис1СЭДО, Ложь);
	
	УстановитьПривилегированныйРежим(Истина);
	СертификатыПоУчетнымЗаписямЭДО = УчетныеЗаписиЭДО.ДействующиеСертификатыПоУчетнымЗаписям(ИдентификаторыУчетныхЗаписей);
	УстановитьПривилегированныйРежим(Ложь);
	
	ВидОперации = НСтр("ru = 'Автоматическая обработка документов ЭДО'");
	
	ОтпечаткиСертификатов = КриптографияБЭД.ПолучитьОтпечаткиСертификатов(ВидОперации, КонтекстДиагностики);
	
	ЕстьСертификаты = Истина;
	Если Не ЗначениеЗаполнено(ОтпечаткиСертификатов.Сервер) Тогда
		ЕстьСертификаты = Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторПотока", ИдентификаторПотока);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Пакеты.Объект КАК ИдентификаторУчетнойЗаписи,
	|	Пакеты.НомерПакета КАК НомерПакета
	|ИЗ
	|	РегистрСведений.ПакетыМногопоточныхЗаданий КАК Пакеты
	|ГДЕ
	|	Пакеты.ИдентификаторПотока = &ИдентификаторПотока И 
	|	Пакеты.ВидЗадания = ЗНАЧЕНИЕ(Справочник.МногопоточныеЗадания.АвтоматическаяОбработкаДокументовЭДО) И 
	|	Пакеты.ЕстьОшибка = ЛОЖЬ
	|УПОРЯДОЧИТЬ ПО
	|	Пакеты.СчетчикОшибок
	|";
	
	ВремяПоследнегоДействия = ТекущаяДата();
	Пока ИСТИНА Цикл
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.ПакетыМногопоточныхЗаданий.СоздатьМенеджерЗаписи();
			
			Если Не ОперацииВключены Тогда
				ТекстОшибки = НСтр("ru = 'В параметрах регламентного задания <Автоматическая обработка документов ЭДО> не включены операции'", ОбщегоНазначения.КодОсновногоЯзыка());
				РаботаСМногопоточнымиЗаданиями.ЗаписатьОшибкуПотока(МенеджерЗаписи, ВидЗадания, Выборка.НомерПакета, КоличествоОшибокВПотоке, ТекстОшибки);
				Продолжить;
			КонецЕсли;
			
			Если Не КриптопровайдерНастроен Тогда
				ТекстОшибки = НСтр("ru = 'Криптопровайдер на сервере недоступен'", ОбщегоНазначения.КодОсновногоЯзыка());
				РаботаСМногопоточнымиЗаданиями.ЗаписатьОшибкуПотока(МенеджерЗаписи, ВидЗадания, Выборка.НомерПакета, КоличествоОшибокВПотоке, ТекстОшибки);
				Продолжить;
			КонецЕсли;
			
			Если Не ДоступнаПроверкаПодписи Тогда
				ТекстОшибки = НСтр("ru = 'Проверка электронных подписей на сервере недоступна'", ОбщегоНазначения.КодОсновногоЯзыка());
				РаботаСМногопоточнымиЗаданиями.ЗаписатьОшибкуПотока(МенеджерЗаписи, ВидЗадания, Выборка.НомерПакета, КоличествоОшибокВПотоке, ТекстОшибки);
				Продолжить;
			КонецЕсли;
			
			Если Не ЕстьСертификаты Тогда
				ТекстОшибки = НСтр("ru = 'На сервере нет доступных сертификатов'", ОбщегоНазначения.КодОсновногоЯзыка());
				РаботаСМногопоточнымиЗаданиями.ЗаписатьОшибкуПотока(МенеджерЗаписи, ВидЗадания, Выборка.НомерПакета, КоличествоОшибокВПотоке, ТекстОшибки);
				Продолжить;
			КонецЕсли;
			
			КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
			
			Попытка
				АвтоматическаяОбработкаДокументовЭДОПоИдентификатору(Выборка.ИдентификаторУчетнойЗаписи, ПараметрыЗадания, СертификатыПоУчетнымЗаписямЭДО, ОтпечаткиСертификатов, КонтекстДиагностики);
				
				Ошибки = ОбработкаНеисправностейБЭДКлиентСервер.ПолучитьОшибки(КонтекстДиагностики);
				Если Ошибки.Количество()>0 Тогда
					ТекстОшибки = ТекстОшибокИзДиагностики(КонтекстДиагностики);
					РаботаСМногопоточнымиЗаданиями.ЗаписатьОшибкуПотока(МенеджерЗаписи, ВидЗадания, Выборка.НомерПакета, КоличествоОшибокВПотоке, ТекстОшибки);
					Продолжить;
				КонецЕсли;
				
				ВремяПоследнегоДействия = ТекущаяДата();
			Исключение
				ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				РаботаСМногопоточнымиЗаданиями.ЗаписатьОшибкуПотока(МенеджерЗаписи, ВидЗадания, Выборка.НомерПакета, КоличествоОшибокВПотоке, ТекстОшибки);
				Продолжить;
			КонецПопытки;
			
			МенеджерЗаписи.ВидЗадания  = ВидЗадания;
			МенеджерЗаписи.НомерПакета = Выборка.НомерПакета;
			МенеджерЗаписи.Удалить();
			
		КонецЦикла;
		
		РегламентноеЗадание = Метаданные.РегламентныеЗадания.АвтоматическаяОбработкаДокументовЭДО;
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИмяМетода", РегламентноеЗадание.ИмяМетода);
		Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
		
		ФоновыеЗаданияОбновлениеВыгрузки = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
		Если ФоновыеЗаданияОбновлениеВыгрузки.Количество() = 0 ИЛИ (ТекущаяДата()-ВремяПоследнегоДействия)>ВремяБездействияПотока Тогда
			РаботаСМногопоточнымиЗаданиями.УбратьЗависшиеПакеты(ВидЗадания, ИдентификаторПотока);
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстОшибокИзДиагностики(КонтекстДиагностики)
	
	ТекстОшибки = "";
	
	Ошибки = ОбработкаНеисправностейБЭДКлиентСервер.ПолучитьОшибки(КонтекстДиагностики);
	ВидыДиагностики = Новый Массив;
	Если ДиагностикаЭДОКлиентСервер.ОшибкиДиагностируются(Ошибки, ВидыДиагностики) Тогда
		ПараметрыВыполненияДиагностики = ДиагностикаЭДОКлиентСервер.НовыеПараметрыВыполненияДиагностики();
		
		ПараметрыВыполненияДиагностики.ВидыДиагностики = ВидыДиагностики;
		РезультатДиагностики = ДиагностикаЭДОСлужебный.ВыполнитьДиагностику(ПараметрыВыполненияДиагностики);
		
		ТекстыОшибок = Новый Массив;
		Для каждого КлючИЗначение Из РезультатДиагностики.Результаты Цикл
			Отчет = КлючИЗначение.Значение.ОтчетДляАдминистратора;
			ТекстыОшибок.Добавить(Отчет.Текст);
		КонецЦикла;
		
		ТекстОшибки = СтрСоединить(ТекстыОшибок, Символы.ПС);
		
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция ВидОшибкиПроверкаПодписейНедоступна()
	
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.НовоеОписаниеВидаОшибки();
	ВидОшибки.Идентификатор = "ПроверкаПодписейНедоступна";
	ВидОшибки.ЗаголовокПроблемы = НСтр("ru = 'Автоматическая обработка ЭДО недоступна'");
	ВидОшибки.ОписаниеПроблемы =
		НСтр("ru = 'Для корректной работы автоматической обработки ЭДО
			|требуется проверка электронных подписей на сервере'");
	ВидОшибки.ОписаниеРешения = НСтр("ru = 'Включите проверку электронных подписей на сервере
		|и повторите операцию'");
	ВидОшибки.ОбработчикиНажатия.Вставить("Включить",
		"АвтоматическоеПолучениеЭДОКлиент.ОбработчикОшибкиПроверкаПодписейНедоступна");
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторВидаОшибки", ВидОшибки.Идентификатор);
	ВидОшибки.ПараметрыОбработчиков.Вставить("Включить", ДополнительныеПараметры);
	
	Возврат ВидОшибки;
	
КонецФункции

Функция ВидОшибкиКриптопровайдерНаСервереНедоступен()
	
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.НовоеОписаниеВидаОшибки();
	ВидОшибки.Идентификатор = "КриптопровайдерНаСервереНедоступен";
	ВидОшибки.ЗаголовокПроблемы = НСтр("ru = 'Автоматическая обработка ЭДО недоступна'");
	ВидОшибки.ОписаниеПроблемы =
		НСтр("ru = 'Для корректной работы автоматической обработки ЭДО
			|требуется наличие криптопровайдера на сервере'");
	ВидОшибки.ОписаниеРешения = НСтр("ru = 'Установите криптопровайдер на сервер и повторите операцию'");
	Возврат ВидОшибки
	
КонецФункции

Функция ВидОшибкиНеНастроеныОперацииЭДО()
	
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.НовоеОписаниеВидаОшибки();
	ВидОшибки.Идентификатор = "ПроверкаДоступныхОперацийАвтоматическойОбработкиЭДО";
	ВидОшибки.ЗаголовокПроблемы = НСтр("ru = 'Автоматическая обработка ЭДО не настроена'");
	ВидОшибки.ОписаниеПроблемы =
		НСтр("ru = 'Для корректной работы автоматической обработки ЭДО
			|требуется включить доступные операции'");
	ВидОшибки.ОписаниеРешения = НСтр("ru = 'Включите операции автоматической обработки ЭДО и повторите операцию'");
	Возврат ВидОшибки
	
КонецФункции

Функция ВидОшибкиСертификатыНаСервереНедоступны()
	
	ВидОшибки = ОбработкаНеисправностейБЭДКлиентСервер.НовоеОписаниеВидаОшибки();
	ВидОшибки.Идентификатор = "НаСервереНетДоступныхСертификатов";
	ВидОшибки.ЗаголовокПроблемы = НСтр("ru = 'Автоматическая обработка ЭДО недоступна'");
	ВидОшибки.ОписаниеПроблемы =
		НСтр("ru = 'Для корректной работы автоматической обработки ЭДО
			|требуется наличие сертификатов на сервере'");
	ВидОшибки.ОписаниеРешения = НСтр("ru = 'Установите сертификаты на сервере и повторите операцию'");
	
	Возврат ВидОшибки
	
КонецФункции

#КонецОбласти

Функция ЭтоКорректировка(ХозОперация, Исправление = Ложь) Экспорт
	
	Результат = Ложь;
	Если ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон
			ИЛИ ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияКорректировкаПоСогласованиюСторон Тогда
		Результат = Истина;
	ИначеЕсли Исправление = Ложь
			И (ХозОперация = Справочники.ХозОперации.СчетФактураВыданныйКорректировка
			ИЛИ ХозОперация = Справочники.ХозОперации.СчетФактураПолученныйКорректировка) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоИсправление(ХозОперация, Исправление = Ложь) Экспорт
	
	Результат = Ложь;
	Если ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах
			ИЛИ ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияИсправлениеВПервичныхДокументах Тогда
		Результат = Истина;
	ИначеЕсли Исправление
			И (ХозОперация = Справочники.ХозОперации.СчетФактураВыданныйКорректировка
			ИЛИ ХозОперация = Справочники.ХозОперации.СчетФактураПолученныйКорректировка) Тогда
			Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоПодмножество(Знач Множество, Знач Подмножество)
	
	Если Множество.Количество() < Подмножество.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Индекс = 0 По Подмножество.Количество() - 1 Цикл
		Если Множество[Индекс] <> Подмножество[Индекс] Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ФормаСтартовыйПомощникКЭДО() Экспорт
	
	Возврат "Обработка.СтартовыйПомощникКЭДО.Форма.БыстрыйСтарт";
	
КонецФункции

Функция ФормаОбменСКонтрагентамиТекущиеДелаПоЭДО() Экспорт
	
	Возврат "Обработка.ОбменСКонтрагентами.Форма.ТекущиеДелаПоЭДО";
	
КонецФункции

Функция ФормаУстановленаНаНачальнойСтранице(НачальнаяСтраницаНастройки, Форма) Экспорт
	
	Если НачальнаяСтраницаНастройки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(НачальнаяСтраницаНастройки) = Тип("ХранилищеЗначения") Тогда
		НачальнаяСтраницаНастройки = НачальнаяСтраницаНастройки.Получить();
	КонецЕсли;
	
	Возврат НЕ (НачальнаяСтраницаНастройки = Неопределено
		ИЛИ НачальнаяСтраницаНастройки.ПолучитьСоставФорм().ЛеваяКолонка.Количество() = 0
		ИЛИ НачальнаяСтраницаНастройки.ПолучитьСоставФорм().ЛеваяКолонка[0] <> Форма);

КонецФункции

// Обрабатывает полученные данные из сервиса 1С:ЭДО по услуге Onboarding.
//
Процедура ОбработатьПолученныеДанныеОбластиИзСервиса1СЭДО(ПотокДанных, Обработчик, ДанныеОбработаны, КодВозврата, ОписаниеОшибки)
	
	Если НРег(Обработчик) = "onboarding" И НЕ ДанныеОбработаны Тогда
		
		ДанныеОтАбонента = Неопределено;
		
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.ОткрытьПоток(ПотокДанных);
			ДанныеОтАбонента = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
		Исключение
			ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ВыполнитьЗаписьСобытияПоКЭДОВЖурналРегистрации(ОписаниеОшибки);
			Возврат;
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ДанныеОтАбонента) Тогда
			
			Если ПолучитьНастройкиСтартовогоПомощникаКЭДО() <> Неопределено Тогда
				ДанныеОбработаны = Истина;
				Возврат;
			КонецЕсли;
			
			// Необходимо, чтобы все данные записались сразу.
			НачатьТранзакцию();
			
			Попытка
				
				Если ДанныеОтАбонента.Свойство("OrganizationInitiator") Тогда
					
					ДанныеКонтрагента = ДанныеОтАбонента.OrganizationInitiator;
					
					ИННКонтрагента = СокрЛП(ДанныеКонтрагента.inn);
					КППКонтрагента = СокрЛП(ДанныеКонтрагента.kpp);
					
					СсылкаКонтрагента = ПроверитьСуществованиеЭлементаВСправочнике("Контрагенты", ИННКонтрагента, КППКонтрагента);
					
					Если СсылкаКонтрагента = Неопределено Тогда
						
						ОбъектКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
						
						ОбъектКонтрагент.Наименование       = СокрЛП(ДанныеКонтрагента.name);
						ОбъектКонтрагент.НаименованиеПолное = СокрЛП(ДанныеКонтрагента.name);
						ОбъектКонтрагент.ИНН                = ИННКонтрагента;
						ОбъектКонтрагент.КПП                = КППКонтрагента;
						
						ОбъектКонтрагент.ФормаСобственности = ?(СтрДлина(ОбъектКонтрагент.ИНН) = 12, Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель,
															Перечисления.ФормыСобственности.ЮридическоеЛицо);
						
						УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектКонтрагент, СокрЛП(ДанныеКонтрагента.legalAddress),
							ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента"), ТекущаяДатаСеанса(), Истина);
						
						УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектКонтрагент, СокрЛП(ДанныеКонтрагента.actualAddress),
							ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента"), ТекущаяДатаСеанса(), Истина);
						
						ОбъектКонтрагент.Записать();
						
						СсылкаКонтрагента = ОбъектКонтрагент.Ссылка;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если ДанныеОтАбонента.Свойство("ConnectedOrganization") Тогда
					
					ДанныеОрганизации = ДанныеОтАбонента.ConnectedOrganization;
					
					ИННОрганизации = СокрЛП(ДанныеОрганизации.inn);
					КППОрганизации = СокрЛП(ДанныеОрганизации.kpp);
					
					СсылкаОрганизации = ПроверитьСуществованиеЭлементаВСправочнике("Организации", ИННОрганизации, КППОрганизации, Истина);
					
					Если СсылкаОрганизации = Неопределено Тогда
						
						ОбъектОрганизация = Справочники.Организации.СоздатьЭлемент();
						
						ОбъектОрганизация.НаименованиеДляЦенника = СокрЛП(ДанныеОрганизации.name);
						ОбъектОрганизация.ИНН                     = СокрЛП(ДанныеОрганизации.inn);
						ОбъектОрганизация.КПП                     = СокрЛП(ДанныеОрганизации.kpp);
						ОбъектОрганизация.ФормаСобственности      = ?(СтрДлина(ОбъектОрганизация.ИНН) = 12, Перечисления.ФормыСобственности.ЧастноеЛицо, Перечисления.ФормыСобственности.ЮридическоеЛицо);
						
						СтруктураНаименования = ТорговыйКомплексЭДОКлиентСервер.РазложитьСтрокуНаименованияОрганизации(
							ОбъектОрганизация.НаименованиеДляЦенника, ОбъектОрганизация.ФормаСобственности);
						
						ОбъектОрганизация.НаименованиеПолное      = ТорговыйКомплексЭДОКлиентСервер.СформироватьНаименованиеПолное(ОбъектОрганизация.ФормаСобственности, СтруктураНаименования);
						ОбъектОрганизация.Наименование            = ТорговыйКомплексЭДОКлиентСервер.СформироватьНаименование(СтруктураНаименования);
						
						УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектОрганизация, СокрЛП(ДанныеОрганизации.email),
							ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailОрганизации"), ТекущаяДатаСеанса(), Истина);
						
						ОбъектОрганизация.Записать();
						
						СсылкаОрганизации = ОбъектОрганизация.Ссылка;
						
					КонецЕсли;
					
				КонецЕсли;
				
				НастройкиПомощникаКЭДО = ТорговыйКомплексЭДОКлиентСервер.НоваяСтруктураНастроекПомощникаЭДО();
				НастройкиПомощникаКЭДО.Организация                    = СсылкаОрганизации;
				НастройкиПомощникаКЭДО.ПригласившийКонтрагент         = СсылкаКонтрагента;
				НастройкиПомощникаКЭДО.УслугаOnboarding               = Истина;
				НастройкиПомощникаКЭДО.ОбменДокументамиСКонтрагентами = Истина;
				НастройкиПомощникаКЭДО.ОбменЭДО                       = Истина;
				
				ТорговыйКомплексЭДОВызовСервера.СохранитьНастройкиСтартовогоПомощникаКЭДО(НастройкиПомощникаКЭДО);
				
				ДанныеОбработаны = Истина;
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				ОтменитьТранзакцию();
				ДанныеОбработаны = Ложь;
				КодВозврата      = "";
				ОписаниеОшибки   = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ВыполнитьЗаписьСобытияПоКЭДОВЖурналРегистрации(ОписаниеОшибки);
				Возврат;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Данная процедура используется для стандартизации всех записей событий подсистемы КлиентЭДО
// в журнал регистрации.
//
// Параметры:
//   ОписаниеСобытия         - Строка    - описание содержания события, которое требуется записать в журнал регистрации.
//   ДополнительныеПараметры - Структура - содержит дополнительные параметры для записи в журнал регистрации:
//    *УровеньВажности  - УровеньЖурналаРегистрации               - уровень журнала регистрации (Ошибка, Информация, и т.д.).
//    *ОбъектМетаданных - ОбъектМетаданных                        - объект метаданных, к которому относится событие.
//    *ДанныеСсылка     - Произвольный                            - данные, с которыми связано событие. Рекомендуется указывать ссылки
//                                                                на объекты данных (элементы справочников, документы, к которым относится событие).
//    *РежимТранзакции  - РежимТранзакцииЗаписиЖурналаРегистрации - указывает отношение записи к текущей транзакции.
//
Процедура ВыполнитьЗаписьСобытияПоКЭДОВЖурналРегистрации(ОписаниеСобытия, ДополнительныеПараметры = Неопределено)
	
	УровеньВажности  = Неопределено;
	ОбъектМетаданных = Неопределено;
	ДанныеСсылка     = Неопределено;
	РежимТранзакции  = Неопределено;
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		ДополнительныеПараметры.Свойство("УровеньВажности",  УровеньВажности);
		ДополнительныеПараметры.Свойство("ОбъектМетаданных", ОбъектМетаданных);
		ДополнительныеПараметры.Свойство("ДанныеСсылка",     ДанныеСсылка);
		ДополнительныеПараметры.Свойство("РежимТранзакции",  РежимТранзакции);
	КонецЕсли;
	
	Подсистема = НСтр("ru = 'Общая подсистема'", ОбщегоНазначения.КодОсновногоЯзыка());

	УровеньВажностиСобытия = ?(ТипЗнч(УровеньВажности) = Тип("УровеньЖурналаРегистрации"),
		УровеньВажности, УровеньЖурналаРегистрации.Ошибка);
		
	ИмяСобытия = СтрЗаменить(НСтр("ru = 'Клиент ЭДО.%1'", ОбщегоНазначения.КодОсновногоЯзыка()),
		"%1", Подсистема);
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньВажностиСобытия, ОбъектМетаданных, ДанныеСсылка, ОписаниеСобытия,
		РежимТранзакции);
	
КонецПроцедуры

Функция ПроверитьСуществованиеЭлементаВСправочнике(ИмяСправочника, ИНН, КПП, УчитыватьПометкуУдаления = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);

	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПроверяемыйСправочник.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник."+ИмяСправочника+" КАК ПроверяемыйСправочник
		|ГДЕ
		|	ПроверяемыйСправочник.КПП = &КПП
		|	И ПроверяемыйСправочник.ИНН = &ИНН
		|	И &УсловиеНаПометкуУдаления";
	
	Если НЕ УчитыватьПометкуУдаления Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеНаПометкуУдаления", "НЕ ПроверяемыйСправочник.ПометкаУдаления");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеНаПометкуУдаления", "Истина");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ЕстьОрганизацииВБазе()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Организации.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция НастройкиИнтерфейсаПоУмолчанию()
	
	Настройки = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	
	НастройкиСостава.Верх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
	Лево = Новый ГруппаНастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияРежимаСовместимости(), "8.3.15.0") < 0 Тогда 
		Лево.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИнструментов"));
	КонецЕсли;
	Лево.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельРазделов"));
	Лево.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельФункцийТекущегоРаздела"));
	
	НастройкиСостава.Лево.Добавить(Лево);
	
	Настройки.УстановитьСостав(НастройкиСостава);
	
	Возврат Настройки;
	
КонецФункции

// Возврашает основания полномочий физических лиц организации.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации
//  ФизическиеЛица - Массив из СправочникСсылка.ФизическиеЛица
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - СправочникСсылка.ФизическиеЛица
//   * Значение - Структура:
//    ** ОснованиеПолномочий - Строка
//    ** Должность - СправочникСсылка.Должности
//   
Функция ОснованияПолномочийФизическихЛиц(Организация, ФизическиеЛица) Экспорт 
	
	ВозвращаемоеСоответствие = Новый Соответствие;
	
	Если ТипЗнч(ФизическиеЛица) <> Тип("Массив") Тогда
		Если ЗначениеЗаполнено(ФизическиеЛица) Тогда
			ФизическиеЛицаМассив = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическиеЛица);
		Иначе
			ФизическиеЛицаМассив = Новый Массив;
		КонецЕсли;
	Иначе
		ФизическиеЛицаМассив = ФизическиеЛица;
	КонецЕсли;
	
	Если ФизическиеЛицаМассив.Количество() = 0 Тогда
		Возврат ВозвращаемоеСоответствие;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабСотрудники.Ссылка КАК ФизическоеЛицо,
		|	ТабСотрудники.Должность КАК Должность
		|ИЗ
		|	Справочник.Сотрудники КАК ТабСотрудники
		|ГДЕ
		|	ТабСотрудники.Ссылка В(&ТабСотрудники)";
	
	//Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТабСотрудники", ФизическиеЛицаМассив);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураРеквизитов = Новый Структура("Должность, ОснованиеПолномочий");
		СтруктураРеквизитов.Должность = Выборка.Должность;
		СтруктураРеквизитов.ОснованиеПолномочий = "";
		
		ВозвращаемоеСоответствие.Вставить(Выборка.ФизическоеЛицо, СтруктураРеквизитов);
	КонецЦикла;
	
	Возврат ВозвращаемоеСоответствие;
	
КонецФункции

Функция ДанныеФизическогоЛица(Физлицо) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Фамилия КАК Фамилия,
	|	Сотрудники.Имя КАК Имя,
	|	Сотрудники.Отчество КАК Отчество,
	|	Сотрудники.ДатаРождения КАК ДатаРождения,
	|	Сотрудники.Пол КАК Пол,
	//|	Сотрудники.МестоРождения КАК МестоРождения,
	//|	Сотрудники.Гражданство КАК Гражданство,
	|	Сотрудники.СтраховойНомерПФР КАК СтраховойНомерПФР,
	|	Сотрудники.ИНН КАК ИНН,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.ВидПодтверждающегоДокумента, ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.ПустаяСсылка)) КАК ВидДокумента,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.Серия, """") КАК Серия,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.Номер, """") КАК Номер,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.КемВыдан, """") КАК КемВыдан,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.ДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаВыдачи,
	|	ЕСТЬNULL(ПодтверждающиеДокументы.КодПодразделения, """") КАК КодПодразделения
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ПО
	|	(ПодтверждающиеДокументы.Владелец = Сотрудники.Ссылка)
	|	И (ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ПаспортРФ)
	|ГДЕ
	|	Сотрудники.Ссылка = &Физлицо";
	
	Запрос.УстановитьПараметр("ПаспортРФ", Перечисления.ВидыДокументов.Паспорт);
	Запрос.УстановитьПараметр("Физлицо",   Физлицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Результат = Новый Структура;
		Результат.Вставить("Фамилия", ВыборкаДетальныеЗаписи.Фамилия);
		Результат.Вставить("Имя", ВыборкаДетальныеЗаписи.Имя);
		Результат.Вставить("Отчество", ВыборкаДетальныеЗаписи.Отчество);
		Результат.Вставить("ДатаРождения", ВыборкаДетальныеЗаписи.ДатаРождения);
		Результат.Вставить("Пол", ВыборкаДетальныеЗаписи.Пол);
		Результат.Вставить("МестоРождения", "");
		Результат.Вставить("Гражданство", Справочники.СтраныМира.Россия);
		Результат.Вставить("СтраховойНомерПФР", ВыборкаДетальныеЗаписи.СтраховойНомерПФР);
		Результат.Вставить("ИНН", ВыборкаДетальныеЗаписи.ИНН);
		Результат.Вставить("ВидДокумента", ВыборкаДетальныеЗаписи.ВидДокумента);
		Результат.Вставить("Серия", ВыборкаДетальныеЗаписи.Серия);
		Результат.Вставить("Номер", ВыборкаДетальныеЗаписи.Номер);
		Результат.Вставить("КемВыдан", ВыборкаДетальныеЗаписи.КемВыдан);
		Результат.Вставить("ДатаВыдачи", ВыборкаДетальныеЗаписи.ДатаВыдачи);
		Результат.Вставить("КодПодразделения", ВыборкаДетальныеЗаписи.КодПодразделения);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает версию режима совместимости в формате нумерации редакций и версий, например, 8.3.15.0.
//
// Возвращаемое значение:
//   Строка - версия режима совместимости в формате нумерации редакций и версий.
//
Функция ВерсияРежимаСовместимости() Экспорт
	
	Если Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать Тогда 
		
		Информация = Новый СистемнаяИнформация;
		Возврат Информация.ВерсияПриложения;
		
	КонецЕсли;
	
	ОписаниеРежимаСовместимости = СтрРазделить(Метаданные.РежимСовместимости, "_");
	Символов = СтрДлина(ОписаниеРежимаСовместимости[0]);
	
	НомерРедакции = "";
	
	Для НомерСимвола = 1 По Символов Цикл 
		
		ТекущийСимвол = Сред(ОписаниеРежимаСовместимости[0], НомерСимвола, 1);
		
		Если СтрНайти("0123456789", ТекущийСимвол) > 0 Тогда 
			НомерРедакции = НомерРедакции + ТекущийСимвол;
		КонецЕсли;
		
	КонецЦикла;
	
	ОписаниеРежимаСовместимости.Установить(0, НомерРедакции);
	
	Для Индекс = ОписаниеРежимаСовместимости.Количество() По 3 Цикл 
		ОписаниеРежимаСовместимости.Добавить("0");
	КонецЦикла;
	
	Возврат СтрСоединить(ОписаниеРежимаСовместимости, ".");
	
КонецФункции

// Выполняет попытку создания электронного документа исходящего, на основании учетного документа. В случае ошибки,
//  оповещает о ней ответственного.
Процедура СозданиеЭлектронныхДокументовФоновоеЗадание() Экспорт
	
	Попытка
		Менеджер = Обработки.МенеджерАвтоматическогоСозданияЭлектронныхДокументов.Создать();
		Менеджер.СоздатьЭлектронныеДокументы();
	Исключение
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВыполнитьЗаписьСобытияПоКЭДОВЖурналРегистрации(ОписаниеОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Возвращает признак создания базы через механизм Onboarding`а
// 
// Возвращаемое значение:
// 	Булево - Истина, если информационная база была создана через механизм Onboarding`а. 
Функция БазаСозданаЧерезOnboarding()
	
	ПодключенПоOnboarding = Ложь;
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		НастройкиСтартовогоПомощникаКЭДО = ПолучитьНастройкиСтартовогоПомощникаКЭДО();
		Если НастройкиСтартовогоПомощникаКЭДО <> Неопределено
			И НастройкиСтартовогоПомощникаКЭДО.Свойство("УслугаOnboarding") Тогда
			ПодключенПоOnboarding = НастройкиСтартовогоПомощникаКЭДО.УслугаOnboarding;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПодключенПоOnboarding;
	
КонецФункции

#Область ЭтапыГрафикаОплат

Процедура ОпределитьВариантУказанияГрафикаОплат(Форма)
	
	ЭтапыГрафикаОплаты = Форма.Объект.ЭтапыГрафикаОплаты.Выгрузить(,"ВариантОплаты").ВыгрузитьКолонку(0);

	ЭтапыУпрощенногоВвода = Новый Массив;
	ЭтапыУпрощенногоВвода.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОплатыПоГрафику.Предоплата"));
	ЭтапыУпрощенногоВвода.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОплатыПоГрафику.ОтсрочкаПлатежа"));
	
	Форма.ИспользуетсяМногоэтапныйГрафикОплаты = Не ЭтоПодмножество(ЭтапыУпрощенногоВвода, ЭтапыГрафикаОплаты);

КонецПроцедуры

Процедура УстановитьОформлениеЭтаповГрафикаОплат(Форма)
	
	ИспользуетсяМногоэтапныйГрафикОплаты = Форма.ИспользуетсяМногоэтапныйГрафикОплаты;
	Элементы = Форма.Элементы;
	
	ТипГрафикаОплаты = ?(ИспользуетсяМногоэтапныйГрафикОплаты, НСтр("ru = 'списком'"), НСтр("ru = 'простой'"));
	ТекстHTML = СтрШаблон(
			НСтр("ru = 'График оплаты, <a href = ""ИзменитьРежимРедактированияГрафикаОплаты"">%1</a>'"), ТипГрафикаОплаты);
	ТекстЗаголовкаГрафикаОплат = СтроковыеФункции.ФорматированнаяСтрока(ТекстHTML);
	
	// Пометка кнопки "Список" графика оплат
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ДекорацияЗаголовокГрафикОплаты", "Заголовок", ТекстЗаголовкаГрафикаОплат);
	
	ТорговыйКомплексЭДОКлиентСервер.УстановитьОформлениеЭтаповГрафикаОплат(Форма);
	
КонецПроцедуры

// Распределяет сумму по этапам оплаты
//
// Параметры:
// ЭтапыГрафика
//   ЭтапыГрафикаОплаты -ТаблицаЗначений - таблица этапов оплаты, в которой необходимо распределить сумму
//   СуммаКРаспределениюОплаты - Число - сумма платежей, которую необходимо распределить по этапам
//
Процедура РаспределитьСуммуПоЭтапамГрафикаОплаты(ЭтапыГрафикаОплаты, Знач СуммаДокумента)
	
	КоличествоЭтапов = ЭтапыГрафикаОплаты.Количество();
	ИтоговыйПроцент = ЭтапыГрафикаОплаты.Итог("ПроцентПлатежа");
	
	Если КоличествоЭтапов = 1 И ИтоговыйПроцент = 100 Тогда
		ЭтапыГрафикаОплаты[0].СуммаПлатежа = СуммаДокумента;
		
		Возврат;
	КонецЕсли;
	
	КРаспределениюСумма = СуммаДокумента;
	КРаспределениюПроцент = 100;
	ТекущийЭтап = 1;
	ЭтапыКУдалению = Новый Массив;
	Для Каждого Этап Из ЭтапыГрафикаОплаты Цикл
		Если ТекущийЭтап = КоличествоЭтапов Тогда
			Этап.ПроцентПлатежа = КРаспределениюПроцент;
			Этап.СуммаПлатежа = КРаспределениюСумма;
		Иначе
			ТорговыйКомплексЭДОКлиентСервер.ЭтапыГрафикаОплатПриИзмененииПроцентаПлатежа(
				Этап.СуммаПлатежа, Этап.ПроцентПлатежа, СуммаДокумента);
			
			Если Этап.ПроцентПлатежа = 0 Тогда
				ЭтапыКУдалению.Добавить(Этап);
			КонецЕсли;
		КонецЕсли;
		
		КРаспределениюПроцент = КРаспределениюПроцент - Этап.ПроцентПлатежа;
		КРаспределениюСумма = КРаспределениюСумма - Этап.СуммаПлатежа;
		ТекущийЭтап = ТекущийЭтап + 1;
	КонецЦикла;
	
	Для Каждого Этап Из ЭтапыКУдалению Цикл
		ЭтапыГрафикаОплаты.Удалить(Этап);
	КонецЦикла;
	
КонецПроцедуры

// Добавляет один этап оплаты по умолчанию
//
// Параметры:
//   ЭтапыГрафикаОплаты -ТаблицаЗначений - таблица этапов оплаты, в которой необходимо распределить сумму
//   ПлановаяДатаПоставки - Дата - Дата поставки по документу.
//
Процедура ДобавитьЭтапОплатыПоУмолчанию(Объект, Знач ПлановаяДатаПоставки, Знач СуммаДокумента)
	
	Объект.ЭтапыГрафикаОплаты.Очистить();
	
	Если ЗначениеЗаполнено(ПлановаяДатаПоставки) Тогда
		ДатаПлатежа = ПлановаяДатаПоставки;
	ИначеЕсли ЗначениеЗаполнено(Объект.Дата) Тогда
		ДатаПлатежа = Объект.Дата;
	Иначе
	#Если Клиент Тогда
		ДатаПлатежа = ОбщегоНазначенияКлиент.ДатаСеанса();
	#Иначе
		ДатаПлатежа = ТекущаяДатаСеанса();
	#КонецЕсли
	КонецЕсли;
	
	ДанныеЭтапа = Новый Структура;
	ДанныеЭтапа.Вставить("ДатаПлатежа", ДатаПлатежа);
	ДанныеЭтапа.Вставить("ВариантОплаты", ПредопределенноеЗначение("Перечисление.ВариантыОплатыПоГрафику.Предоплата"));
	ДанныеЭтапа.Вставить("ПроцентПлатежа", ?(СуммаДокумента = 0, 0, 100));
	ДанныеЭтапа.Вставить("СуммаПлатежа", СуммаДокумента);
	
	ЗаполнитьЗначенияСвойств(Объект.ЭтапыГрафикаОплаты.Добавить(), ДанныеЭтапа);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
