#Область ОбработкаЗапроса

Функция НачатьОбработкуЗапроса(ЗапросСервиса, ИмяКоманды) Экспорт
	
	// Обработка входных параметров.
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("КодРезультата", 200);
	ПараметрыОбработки.Вставить("МассивОшибок", Новый Массив);
	ПараметрыОбработки.Вставить("МетодЗапроса", ЗапросСервиса.HTTPМетод);
	ПараметрыОбработки.Вставить("ОтносительныйURL", ЗапросСервиса.ОтносительныйURL);
	ПараметрыОбработки.Вставить("ВыходныеПараметры", Новый Структура);
	ПараметрыОбработки.Вставить("ИмяКоманды", ИмяКоманды);
	
	ПолучитьПараметрыИзЗаголовка(ЗапросСервиса.Заголовки, ПараметрыОбработки, "Заголовок");
	ПолучитьПараметрыИзЗаголовка(ЗапросСервиса.ПараметрыURL, ПараметрыОбработки, "ПараметрАдреса");
	ПолучитьПараметрыИзЗаголовка(ЗапросСервиса.ПараметрыЗапроса, ПараметрыОбработки, "ПараметрЗапроса");
	
	
	Если ПараметрыОбработки.МетодЗапроса = "GET" Тогда
		
		// В соответствии с параметрами получим запрашиваемые данные.
		ОбработатьДанныеЗапроса(Неопределено, ПараметрыОбработки);
		
	ИначеЕсли ПараметрыОбработки.МетодЗапроса = "PUT" 
		ИЛИ ПараметрыОбработки.МетодЗапроса = "POST"
		ИЛИ ПараметрыОбработки.МетодЗапроса = "DELETE" Тогда
		
		// Обработаем входные данные.
		
		// Преобразуем ответ json в структуры данных 1с.
		СтруктураСообщения = ОбработатьТелоЗапроса(ЗапросСервиса, ПараметрыОбработки);
		
		// Преобразуем в рабочую структуру данных.
		ОбработатьДанныеЗапроса(СтруктураСообщения, ПараметрыОбработки);
		
	Иначе
		ЗафиксироватьОшибку(ПараметрыОбработки, 2);
	КонецЕсли;
	
	 
	ТекстОтветаJSON = СформироватьТекстОтвета(ПараметрыОбработки);
	
	Ответ = ?(ПараметрыОбработки.КодРезультата = 422, Новый HTTPСервисОтвет(ПараметрыОбработки.КодРезультата, "The order cannot be updated"), Новый HTTPСервисОтвет(ПараметрыОбработки.КодРезультата));
		
	Если ИмяКоманды = "ПолучитьЗаказ" Тогда
		Ответ.Заголовки.Вставить("Content-Type", "application/vnd.eats.order.v2+json");
	Иначе
		Ответ.Заголовки.Вставить("Content-Type", "application/json");
	КонецЕсли;

	
	Если ЗначениеЗаполнено(ТекстОтветаJSON) Тогда
		Ответ.УстановитьТелоИзСтроки(ТекстОтветаJSON, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ОбработатьТелоЗапроса(ЗапросСервиса, ПараметрыОбработки) Экспорт
	ВходныеПараметры = Неопределено;
	
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ТекстJSON = ЗапросСервиса.ПолучитьТелоКакСтроку("UTF-8");
		
		Если ЗначениеЗаполнено(ТекстJSON) Тогда
			ЧтениеJSON.УстановитьСтроку(ТекстJSON);
			// В результате некоторых команд возможно получение не только команд.
			Если ЭтоJSON(ТекстJSON) Тогда
				ВходныеПараметры = ПрочитатьJSON(ЧтениеJSON,, ПолучитьМассивПолейДат(), ФорматДатыJSON.ISO);
			Иначе
				ВходныеПараметры = Новый Структура;
				ВходныеПараметры.Вставить("Текст", ТекстJSON);
			КонецЕсли;
		Иначе
			ТекстJSON = "";
			ВходныеПараметры = Новый Структура;
		КонецЕсли;
		
		ЧтениеJSON.Закрыть();
		
	Исключение
		
		ЗафиксироватьОшибку(ПараметрыОбработки, 1);
		
		ИнфОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ИнфОбОшибке.Описание;
		Пока ИнфОбОшибке.Причина <> Неопределено Цикл
			ИнфОбОшибке = ИнфОбОшибке.Причина;
			ТекстОшибки = ТекстОшибки + "
			|" + ИнфОбОшибке.Описание;
		КонецЦикла;
		ТекстОшибки = "Ошибка выполнения процедуры ""ОбработатьТелоЗапроса"": " + ТекстОшибки;
		Событие = "ЯндексЕда.ЧтениеСообщения";
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		
	КонецПопытки;
	
	ЗафиксироватьВСлужебномЛоге(ТекстJSON, ПараметрыОбработки, Ложь);
	
	Возврат ВходныеПараметры;
	
КонецФункции

Процедура ОбработатьДанныеЗапроса(СтруктураСообщения, ПараметрыОбработки)
	
	Если СтруктураСообщения = Неопределено Тогда
		СтруктураСообщения = Неопределено;
	КонецЕсли;
	
	Попытка
		Выполнить(СтрШаблон("Подключаемый_%1(СтруктураСообщения, ПараметрыОбработки)", ПараметрыОбработки.ИмяКоманды));
	Исключение
		
		ИнфОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ИнфОбОшибке.Описание;
		Пока ИнфОбОшибке.Причина <> Неопределено Цикл
			ИнфОбОшибке = ИнфОбОшибке.Причина;
			ТекстОшибки = ТекстОшибки + "
			|" + ИнфОбОшибке.Описание;
		КонецЦикла;
		ТекстОшибки = "Ошибка выполнения процедуры ""ОбработатьДанныеЗапроса"": " + ТекстОшибки;
		Событие = "ЯндексЕда.ЧтениеСообщенияЗаказа";
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		
		ЗафиксироватьОшибку(ПараметрыОбработки, 3);
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Функция СформироватьТекстОтвета(ПараметрыОбработки)
	
	Результат = "";
	
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON( , Символы.Таб);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
		ЗаписатьJSON(ЗаписьJSON, ?(ПараметрыОбработки.КодРезультата = 200, ПараметрыОбработки.ВыходныеПараметры, ПараметрыОбработки.МассивОшибок),,"ПреобразоватьВJSON",СистемыИнтеграции);
		Результат = ЗаписьJSON.Закрыть();
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ИнфОбОшибке.Описание;
		Пока ИнфОбОшибке.Причина <> Неопределено Цикл
			ИнфОбОшибке = ИнфОбОшибке.Причина;
			ТекстОшибки = ТекстОшибки + "
			|" + ИнфОбОшибке.Описание;
		КонецЦикла;
		ТекстОшибки = "Ошибка выполнения процедуры ""СформироватьТекстОтвета"": " + ТекстОшибки;
		Событие = "ЯндексЕда.ОбщийМодуль";
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;
	
	//ЗафиксироватьВСлужебномЛоге(Результат, ПараметрыОбработки, Истина);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область ОбработчикиЗапросов

Процедура Подключаемый_Авторизация(СтруктураСообщения, ПараметрыОбработки)
	
	Если СтруктураСообщения.Свойство("Текст") Тогда
		ПолучитьПараметрыИзСтроки(ПараметрыОбработки, СтруктураСообщения.Текст);
	КонецЕсли;
	
	КодКлиента = "";
	Если ПараметрыОбработки.Свойство("client_id") Тогда
		КодКлиента = ПараметрыОбработки.client_id;
	КонецЕсли;
	
	СекретКлиента = "";
	Если ПараметрыОбработки.Свойство("client_secret") Тогда
		СекретКлиента = ПараметрыОбработки.client_secret;
	КонецЕсли;
	
	Если ПустаяСтрока(КодКлиента) Или ПустаяСтрока(КодКлиента)  
		Или КодКлиента <> Константы.бит_ЯндексЕдаПользователь.Получить() 
		Или СекретКлиента <> Константы.бит_ЯндексЕдаПароль.Получить() Тогда 
		
		ЗафиксироватьОшибку(ПараметрыОбработки, 7, 400);
		Возврат;
	КонецЕсли;
	
	ДанныеТокена = ПолучитьИнформациюОТокене(КодКлиента, СекретКлиента);
	
	// Если токена нет или он не актуальный, то запросим новый.
	Если ДанныеТокена = Неопределено 
		ИЛИ ДанныеТокена.ДатаЗавершения <= (ТекущаяДата()) 
		ИЛИ НЕ ЗначениеЗаполнено(ДанныеТокена.Токен) Тогда
		
		ТокенПриложения = Новый УникальныйИдентификатор;
		
		ПериодАктуальностиТокенаВЧасах = Константы.бит_ПериодАктуальностиТокена.Получить();
		Если ЗначениеЗаполнено(ПериодАктуальностиТокенаВЧасах) Тогда
			ПериодАктуальностиТокена = ПериодАктуальностиТокенаВЧасах * 60;
		Иначе
			// Считаем что значение по умолчанию будет 1 ч.
			ПериодАктуальностиТокена = 3600;
		КонецЕсли;
		
		Запись = РегистрыСведений.бит_ХранилищеТокенов.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторПриложения = КодКлиента;
		Запись.СекретПриложения = СекретКлиента;
		Запись.ДатаВыдачи = ТекущаяДата();
		Запись.ДатаЗавершения = Запись.ДатаВыдачи + ПериодАктуальностиТокена;
		Запись.Токен = ТокенПриложения;
		Запись.Записать(Истина);
		
	Иначе
		
		ТокенПриложения = ДанныеТокена.Токен;
		ПериодАктуальностиТокена = ДанныеТокена.ДатаЗавершения - ТекущаяДата();
		
	КонецЕсли;
	
	// Сформируем ответ.
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "access_token",  XMLСтрока(ТокенПриложения));
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "expires",  Формат(ПериодАктуальностиТокена, "ЧДЦ=0; ЧН=0; ЧГ="));
	
КонецПроцедуры

Процедура Подключаемый_ПолучитьСписокНоменклатуры(СтруктураСообщения, ПараметрыОбработки)
	
	Если Не АвторизацияПройдена(ПараметрыОбработки) Тогда 
		Возврат;
	КонецЕсли;
	
	ТекДата = ТекущаяДата();
	
	//Получим данные магазина.
	Магазин = Справочники.СкладыКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч", ПараметрыОбработки.placeId);
	Если Не Магазин.бит_РаботаСЯндексЕда Тогда 
		ЗафиксироватьОшибку(ПараметрыОбработки, 4, 404);
		Возврат;	
	КонецЕсли;
	
	ОбщийКвант = Константы.бит_ЯндексЕдаКвантОтгрузки.Получить();
	Если Не ЗначениеЗаполнено(ОбщийКвант) Тогда
		ОбщийКвант = 1;	
	КонецЕсли;
		
	// Получим данные по номенклатуре.
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаСписокНоменклатуры();
	
	ГруппаСбермаркет = Справочники.ПодразделенияКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч", "Сбермаркет");	
	
	//Запрос.УстановитьПараметр("Момент", ТекущаяДата());
	Запрос.УстановитьПараметр("ТипЦенПрайс1", ГруппаСбермаркет.ТипЦенРеализации);
	Запрос.УстановитьПараметр("ТипЦенПрайс2", ГруппаСбермаркет.ТипЦенРекомендованнойНаценки);			
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Магазин.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ГруппаСбермаркет", ГруппаСбермаркет);			
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекДата);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Магазин.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ПодразделениеКомпанииРодитель", Магазин.ПодразделениеКомпании.Родитель);
	Запрос.УстановитьПараметр("ПустаяГруппа", Справочники.ит_ГруппыТоваровМаркетплейс.ПустаяСсылка());
	
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// Заполним данные по Категориям.
	#Область Категории
	МассивКатегорий = Новый Массив;
	
	Если Не РезультатЗапроса[РезультатЗапроса.Количество()-3].Пустой() Тогда
		Выборка = РезультатЗапроса[РезультатЗапроса.Количество()-3].Выбрать();
		ПорядокСортировки = 0;
		Пока Выборка.Следующий() Цикл
			ПорядокСортировки = ПорядокСортировки + 1;
			ТекОбъект = СтруктураКатегория();
			ЗаполнитьЗначенияСвойств(ТекОбъект, Выборка); 
			ТекОбъект.sortOrder = ПорядокСортировки;
			МассивКатегорий.Добавить(ТекОбъект);
		КонецЦикла;
	КонецЕсли;
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "categories", МассивКатегорий);
	#КонецОбласти
	
	// Заполним данные по Номенклатуре.
	#Область Номенклатура
	МассивНоменклатуры = Новый Массив;
	ТаблицаШтрихкодов = Неопределено;
	Если Не РезультатЗапроса[РезультатЗапроса.Количество()-1].Пустой() Тогда 
		ТаблицаШтрихкодов = РезультатЗапроса[РезультатЗапроса.Количество()-1].Выгрузить();
	КонецЕсли;
	
	Если Не РезультатЗапроса[РезультатЗапроса.Количество()-2].Пустой() Тогда
		Выборка = РезультатЗапроса[РезультатЗапроса.Количество()-2].Выбрать();
		ПорядокСортировки = 0;
		Пока Выборка.Следующий() Цикл
			ПорядокСортировки = ПорядокСортировки + 1;
			ТекОбъект = СтруктураНоменклатура();
			ЗаполнитьЗначенияСвойств(ТекОбъект, Выборка);
			ЗаполнитьЗначенияСвойств(ТекОбъект.description, Выборка);
			ТекОбъект.sortOrder = ПорядокСортировки;
			
			Квант = Неопределено;
			Если Выборка.КвантОтгрузки <> Неопределено Тогда
				Квант = ?(Выборка.КвантОтгрузки = 0, ОбщийКвант, Выборка.КвантОтгрузки);
			КонецЕсли;
			ТекОбъект.measure = СтруктураМера(Выборка.ВесНетто, Квант);
			
			Если Не ТаблицаШтрихкодов = Неопределено Тогда 
				НайденныеШтрихкоды = ТаблицаШтрихкодов.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Номенклатура));
				Если НайденныеШтрихкоды.Количество() > 0 Тогда
					СтрокаШтрихкоды = НайденныеШтрихкоды[0];
					Если Выборка.isCatchWeight Тогда 
						ВесовойШтрихкод = ШтрихкодированиеВызовСервера.EAN13(Лев(СтрокаШтрихкоды.Штрихкод + "000000000000", 12));
						ТекОбъект.barcode = СтруктураШтрихкод(ВесовойШтрихкод, "ean13", "ean13-tail-gram-5");
					Иначе
						ТекОбъект.barcode = СтруктураШтрихкод(СтрокаШтрихкоды.Штрихкод, ТипШтрихкодаПоДлине(СтрокаШтрихкоды.Штрихкод));
					КонецЕсли;
				КонецЕсли;;
			КонецЕсли;
			
			ЕстьИзображения = Ложь;
			Для Каждого СтрокаТЧ Из Выборка.Номенклатура.бит_ИзображенияURL Цикл 
				ЕстьИзображения = Истина;
				Если ЗначениеЗаполнено(СтрокаТЧ.Hash) Тогда
					ТекОбъект.images.Добавить(СтруктураИзображение(СтрокаТЧ.Hash, СтрокаТЧ.URL));		
				КонецЕсли;		
			КонецЦикла;
			
			Если ЕстьИзображения Тогда //Без изображений не выгружаем, изображения обязательны. 
				МассивНоменклатуры.Добавить(ТекОбъект);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "items", МассивНоменклатуры);
	#КонецОбласти
	
КонецПроцедуры

Процедура Подключаемый_ПолучитьОстаткиНоменклатуры(СтруктураСообщения, ПараметрыОбработки)
	
	Если Не АвторизацияПройдена(ПараметрыОбработки) Тогда 
		Возврат;
	КонецЕсли;
	
	ТекДата = ТекущаяДата();
	
	//Получим данные магазина.
	Магазин = Справочники.СкладыКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч", ПараметрыОбработки.placeId);
	Если Не Магазин.бит_РаботаСЯндексЕда Тогда 
		ЗафиксироватьОшибку(ПараметрыОбработки, 4, 404);
		Возврат;	
	КонецЕсли;
	
	// Получим данные по остаткам.
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаОстаткиНоменклатуры();
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекДата);
	Запрос.УстановитьПараметр("СкладКомпании", Магазин);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// Заполним данные по Остаткам.
	#Область Остатки
	МассивОстатков = Новый Массив;
	Если Не РезультатЗапроса[0].Пустой() Тогда
		Выборка = РезультатЗапроса[0].Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекОбъект = СтруктураОстаток();
			ЗаполнитьЗначенияСвойств(ТекОбъект, Выборка); 
			//Без изображений не выгружаем, изображения обязательны. Если нет карточек, то нет смысла и остатки выгружать.
			Если Выборка.Номенклатура.бит_ИзображенияURL.Количество() > 0 Тогда 
				МассивОстатков.Добавить(ТекОбъект);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "items", МассивОстатков);
	#КонецОбласти
	
КонецПроцедуры

Процедура Подключаемый_ДобавитьЗаказ(СтруктураСообщения, ПараметрыОбработки)
	
	Если Не АвторизацияПройдена(ПараметрыОбработки) Тогда 
		Возврат;
	КонецЕсли;
	
	ЗаказПокупателя = ОбработатьЗаказПокупателя(СтруктураСообщения, ПараметрыОбработки);
	
	Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "orderId", ЗаказПокупателя.Ссылка);
		ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "result", "OK");
	КонецЕсли;
	
КонецПроцедуры

Процедура Подключаемый_ОбновитьЗаказ(СтруктураСообщения, ПараметрыОбработки)
	
	Если Не АвторизацияПройдена(ПараметрыОбработки) Тогда 
		Возврат;
	КонецЕсли;
	
	ЗаказПокупателя = ОбработатьЗаказПокупателя(СтруктураСообщения, ПараметрыОбработки);
	
	Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "result", "OK");
	КонецЕсли;
	
КонецПроцедуры

Процедура Подключаемый_УдалитьЗаказ(СтруктураСообщения, ПараметрыОбработки)
	
	Если Не АвторизацияПройдена(ПараметрыОбработки) Тогда 
		Возврат;
	КонецЕсли;
	
	ТекДата = ТекущаяДата();
	
	УИД = Новый УникальныйИдентификатор(ПараметрыОбработки.orderId);
	ЗаказСсылка = Документы.ЗаказПокупателя.ПолучитьСсылку(УИД);
	ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();		
	
	Если ЗаказОбъект = Неопределено Тогда 
		ЗафиксироватьОшибку(ПараметрыОбработки, 6, 404);
		Возврат;	
	КонецЕсли;
	
	Если Не ДоступноОтменаЗаказа(ЗаказСсылка) Тогда 
		ЗафиксироватьОшибку(ПараметрыОбработки, 10, 500);
		Возврат;
	КонецЕсли;
	
	ДанныеОтменыЗаказа = СтруктураОтменаЗаказа();
	ЗаполнитьЗначенияСвойств(ДанныеОтменыЗаказа, СтруктураСообщения);
	
	ЗаказОбъект.ПометкаУдаления = Истина;
	
	//Заполняем Статусы
	МенЗапСтатусы = РегистрыСведений.бит_ЯндексЕдаСтатусыЗаказов.СоздатьМенеджерЗаписи();
	МенЗапСтатусы.ЗаказПокупателя = ЗаказСсылка;
	МенЗапСтатусы.Статус = Перечисления.бит_ЯндексЕдаСтатусы.CANCELLED;
	МенЗапСтатусы.Комментарий = СтруктураСообщения.comment;
	МенЗапСтатусы.Период = ТекДата;		
	
	//Сохраняем всё
	Попытка
		НачатьТранзакцию();
		ЗаказОбъект.Записать(?(ЗаказСсылка.Проведен, РежимЗаписиДокумента.ОтменаПроведения, РежимЗаписиДокумента.Запись));
		МенЗапСтатусы.Записать();
		ЗафиксироватьТранзакцию();
		Результат = ЗаказОбъект.Ссылка;		
	Исключение
		
		Если ТранзакцияАктивна() Тогда 
			ОтменитьТранзакцию();
		КонецЕсли;
		
		ИнфОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ИнфОбОшибке.Описание;
		Пока ИнфОбОшибке.Причина <> Неопределено Цикл
			ИнфОбОшибке = ИнфОбОшибке.Причина;
			ТекстОшибки = ТекстОшибки + "
			|" + ИнфОбОшибке.Описание;
		КонецЦикла;
		СообщенияПользователю = ПолучитьСообщенияПользователю();
		Для Каждого Сообщение Из СообщенияПользователю Цикл 
			ТекстОшибки = ТекстОшибки +  Символы.ПС + Сообщение.Текст;
		КонецЦикла;
		
		ТекстОшибки = "Ошибка выполнения процедуры ""Подключаемый_УдалитьЗаказ"": " + ТекстОшибки;
		Событие = "ЯндексЕда";
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ЗафиксироватьОшибку(ПараметрыОбработки, 5);
	КонецПопытки;
	
КонецПроцедуры

Процедура Подключаемый_ПолучитьЗаказ(СтруктураСообщения, ПараметрыОбработки)
	
	Если Не АвторизацияПройдена(ПараметрыОбработки) Тогда 
		Возврат;
	КонецЕсли;
	
	УИД = Новый УникальныйИдентификатор(ПараметрыОбработки.orderId);
	ЗаказСсылка = Документы.ЗаказПокупателя.ПолучитьСсылку(УИД);
	
	Если ЗаказСсылка.ПолучитьОбъект() = Неопределено Тогда 
		ЗафиксироватьОшибку(ПараметрыОбработки, 6, 404);
		Возврат;	
	КонецЕсли;
	
	//Получим данные по заказу.
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаЗаказИнформация();
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказСсылка);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[0].Пустой() Тогда
		ЗафиксироватьОшибку(ПараметрыОбработки, 6, 404);
		Возврат;	
	КонецЕсли;	
	
	// Заполним данные по заказу.
	Выборка = РезультатЗапроса[0].Выбрать();
	Выборка.Следующий();
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "discriminator", Выборка.discriminator);
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "eatsId", Выборка.eatsId);
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "restaurantId", Выборка.restaurantId);
	
	ДанныеДоставки = СтруктураДанныеДоставки(НРег(Выборка.discriminator));
	ЗаполнитьЗначенияСвойств(ДанныеДоставки, Выборка);
	Если ДанныеДоставки.Свойство("deliveryAddress") Тогда
		ДанныеАдреса = СтруктураАдресДоставки();
		ЗаполнитьЗначенияСвойств(ДанныеАдреса, Выборка);
		ДанныеДоставки.deliveryAddress = ДанныеАдреса;
	КонецЕсли;
	Если ДанныеДоставки.Свойство("deliveryDate") Тогда 
		//ДанныеДоставки.deliveryDate = ЗаписатьДатуJSON(Выборка.deliveryDate, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
		ДанныеДоставки.deliveryDate = Формат(Выборка.deliveryDate, "ДФ=yyyy-MM-ddTHH:mm:ss.000000+03:00");
	КонецЕсли;
	
	Если ДанныеДоставки.Свойство("courierArrivementDate") Тогда
		//ДанныеДоставки.courierArrivementDate = ЗаписатьДатуJSON(Выборка.courierArrivementDate, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
		ДанныеДоставки.courierArrivementDate = Формат(Выборка.courierArrivementDate, "ДФ=yyyy-MM-ddTHH:mm:ss.000000+03:00");
	КонецЕсли;
	
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "deliveryInfo", ДанныеДоставки);
	
	ДанныеОплаты = СтруктураДанныеОплаты(ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.ТипОплаты), Выборка.itemsCost);
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "paymentInfo", ДанныеОплаты);
	
	МассивТовары = Новый Массив;	
	Если Не РезультатЗапроса[1].Пустой() Тогда
		ВыборкаТовары = ?(РезультатЗапроса[2].Пустой(), РезультатЗапроса[1].Выбрать(), РезультатЗапроса[2].Выбрать());
		Пока ВыборкаТовары.Следующий() Цикл
			СтрокаТовары = СтруктураСтрокаТовары();
			ЗаполнитьЗначенияСвойств(СтрокаТовары, ВыборкаТовары);
			МассивТовары.Добавить(СтрокаТовары);			
		КонецЦикла;
	КонецЕсли;
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "items", МассивТовары);		
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "persons", Выборка.persons);
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "comment", Выборка.comment);
	СписокАкций = Новый Массив;
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "promos", СписокАкций);
	
КонецПроцедуры

Процедура Подключаемый_ПолучитьСтатусЗаказа(СтруктураСообщения, ПараметрыОбработки)
	
	Если Не АвторизацияПройдена(ПараметрыОбработки) Тогда 
		Возврат;
	КонецЕсли;
	
	УИД = Новый УникальныйИдентификатор(ПараметрыОбработки.orderId);
	ЗаказСсылка = Документы.ЗаказПокупателя.ПолучитьСсылку(УИД);
	
	Если ЗаказСсылка.ПолучитьОбъект() = Неопределено Тогда 
		ЗафиксироватьОшибку(ПараметрыОбработки, 6, 404);
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЯндексЕдаСтатусыЗаказовСрезПоследних.Период КАК ДатаИзменения,
	|	бит_ЯндексЕдаСтатусыЗаказовСрезПоследних.Статус КАК Статус,
	|	бит_ЯндексЕдаСтатусыЗаказовСрезПоследних.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.бит_ЯндексЕдаСтатусыЗаказов.СрезПоследних(, ЗаказПокупателя = &ЗаказПокупателя) КАК бит_ЯндексЕдаСтатусыЗаказовСрезПоследних";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ДанныеСтатуса = СтруктураСтатусЗаказа();
		ДанныеСтатуса.status = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.Статус);
		ДанныеСтатуса.comment = Выборка.Комментарий;
		//ДанныеСтатуса.updatedAt = ЗаписатьДатуJSON(Выборка.ДатаИзменения, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
		ДанныеСтатуса.updatedAt = Формат(Выборка.ДатаИзменения, "ДФ=yyyy-MM-ddTHH:mm:ss.000000+03:00");
	Иначе
		ЗафиксироватьОшибку(ПараметрыОбработки, 6, 404);
		Возврат;	
	КонецЕсли;
	
	Для Каждого ТекСвойство Из ДанныеСтатуса Цикл
		ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, ТекСвойство.Ключ, ТекСвойство.Значение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СтруктуруДанных

Функция СтруктураКатегория()
	
	Результат = Новый Структура;
	Результат.Вставить("id", ""); //Уникальный идентификатор категории
	//Результат.Вставить("parentId", ""); // Уникальный идентификатор родительской категории
	Результат.Вставить("name", ""); // Наименование категории
	Результат.Вставить("sortOrder", 0); //Порядок сортировки от меньшего к большему
	Результат.Вставить("images", Новый Массив); //Изображение категории
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураНоменклатура()
	
	Результат = Новый Структура;
	Результат.Вставить("id"); //Уникальный идентификатор продукта
	Результат.Вставить("vendorCode", ""); //Артикул продукта	
	Результат.Вставить("categoryId", ""); //Уникальный идентификатор категории
	Результат.Вставить("name", ""); //Наименование продукта
	Результат.Вставить("description", СтруктураОписание()); //Описание продукта
	Результат.Вставить("price", 0); //Цена продукта. Продукты с нулевой ценой отбрасываются
	Результат.Вставить("oldPrice", 0); //Цена продукта до акции. Продукты с нулевой ценой отбрасываются
	Результат.Вставить("vat", 0) ; //НДС, включенный в стоимость, в процентах.
	Результат.Вставить("barcode", СтруктураШтрихкод()); //Штрихкоды продукта (Обязательны, но можно ставить заглушку со ШК 0)
	Результат.Вставить("measure", СтруктураМера()); //Измерительная характеристика продукта, например, вес или объем
	//Результат.Вставить("volume", СтруктураОбъема()); //Объем занимаемый продуктом. Полезен для расчета доставки.
	Результат.Вставить("isCatchWeight", Ложь); //Флаг указывающий весовой продукт, или нет
	Результат.Вставить("sortOrder", 0); //Порядок сортировки от меньшего к большему. 
	Результат.Вставить("images", Новый Массив); //Изображение продукта (Обязательны)
	
	Возврат Результат;
КонецФункции

Функция СтруктураОписание()
	
	Результат = Новый Структура;
	Результат.Вставить("general", ""); //Общее описание продукта
	Результат.Вставить("composition", ""); //Сведения о составе	
	Результат.Вставить("nutritionalValue", ""); //Пищевая ценность
	Результат.Вставить("purpose", ""); //Назначение
	Результат.Вставить("storageRequirements", ""); //Условия хранения
	Результат.Вставить("expiresIn", ""); //Срок годности в днях
	Результат.Вставить("vendorCountry", "") ; //Страна изготовления
	Результат.Вставить("packageInfo", ""); //Сведения об упаковке
	
	Возврат Результат;
КонецФункции

Функция СтруктураМера(Value = 0, Quantum = Неопределено, Unit = "GRM")
	
	Результат = Новый Структура;
	Результат.Вставить("value", Value); //Значение измерения
	Если Не Quantum = Неопределено Тогда 
		Результат.Вставить("quantum", Quantum); //Наименьшее количество продукта (квант) доступное для заказа. Значение от value
	КонецЕсли;
	Результат.Вставить("unit", Unit); //Единица измерения
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураОбъем()
	
	Результат = Новый Структура;
	Результат.Вставить("value", 0); //Значение измерения
	Результат.Вставить("unit", ""); //Единица измерения
	
	Возврат Результат;
КонецФункции

Функция СтруктураИзображение(Hash = "", Url = "")
	
	Результат = Новый Структура;	
	Результат.Вставить("hash", Hash); // SHA1-хэш от содержимого файла изображения. Служит признаком уникальности. В случае если он меняется, Яндекс.Еда перезагружает картинку.	
	Результат.Вставить("url", Url); // Ссылка на изображение для скачивания.
	
	Возврат Результат;
КонецФункции

Функция СтруктураШтрихкод(Value = "0", Type = "code128", WeightEncoding = "none")
	//Штрихкоды обязательны, но можно поставить заглушку с 0;
	
	Результат = Новый Структура;	
	Результат.Вставить("value", Value); //Штрихкод продукта
	Результат.Вставить("type", Type); //Тип штрихкода
	Результат.Вставить("weightEncoding", WeightEncoding); //Алгоритм кодирования веса в штрихкоде                       
	
	Возврат Результат;
КонецФункции

Функция СтруктураОстаток()
	Результат = Новый Структура;
	Результат.Вставить("id"); //Уникальный идентификатор продукта
	Результат.Вставить("stock", 0); //Остаток продукта. При 0 продукт пропадает из выдачи
	
	Возврат Результат;
КонецФункции

Функция СтруктураЗаказПокупателя()
	
	Результат = Новый Структура;
	Результат.Вставить("discriminator", ""); //Дискриминатор схемы обьекта. Для MarketplaceOrder равен \"marketplace\". Для YandexOrder равен \"yandex\".
	Результат.Вставить("eatsId", ""); //Сквозной идентификатор заказа на стороне Яндекс.Еды в формате DDDDDD-DDDDDD. 
	Результат.Вставить("restaurantId", ""); //Внутренний идентификатор заведения в системе партнера, в которое передаётся заказ.
	Результат.Вставить("deliveryInfo", СтруктураДанныеДоставки()); //Данные доставки.
	Результат.Вставить("paymentInfo", СтруктураДанныеОплаты()); //Предварительная оплата.
	Результат.Вставить("items", Новый Массив); //Товары.
	Результат.Вставить("persons", 0); //Количество персон, на которых делается заказ.
	Результат.Вставить("comment", ""); // Дополнительная информация о заказе.
	Результат.Вставить("promos", Новый Массив); // Список акций, действующих на весь заказ.
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураДанныеДоставки(Дискриминатор = Неопределено)
	
	// При схеме YandexOrderV2 и MarketplaceOrderV2.
	Результат = Новый Структура;
	Результат.Вставить("clientName"); // Имя клиента в сервисе Яндекс.Еда.
	Результат.Вставить("phoneNumber"); //Номер телефона для связи с клиентом в международном формате. Пример +79031111111 доб. 4432
	
	// При схеме YandexOrderV2
	Если Дискриминатор = Неопределено Или Дискриминатор = "yandex" Тогда 
		Результат.Вставить("courierArrivementDate"); //Дата, когда придет курьер в ресторан, в формате RFC3339 с дробной частью секунд (Y-m-d\\TH:i:s.uP).
	КонецЕсли;
		
	// При схеме MarketplaceOrderV2.
	Если Дискриминатор = Неопределено Или Дискриминатор = "marketplace" Тогда 
		Результат.Вставить("deliveryAddress", СтруктураАдресДоставки()); // Адрес доставки.
		Результат.Вставить("deliveryDate", ""); //Дата доставки (к которой клиент ожидает доставку заказа) в формате RFC3339 с дробной частью секунд (Y-m-d\\TH:i:s.uP). Пример 1937-01-01T12:00:27.870000+00:20
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция СтруктураАдресДоставки()
	
	Результат = Новый Структура;
	Результат.Вставить("full"); // Полный адрес "Москва, улица Тверская, дом 1, строение 4, подъезд 2. 4-й этаж, код домофона: 123 К 4567.
	Результат.Вставить("latitude"); // Широта точки доставки.
	Результат.Вставить("longitude"); // Долгота точки доставки.	
	Возврат Результат;
	
КонецФункции

Функция СтруктураДанныеОплаты(paymentType = "", itemsCost = 0)
	
	Результат = Новый Структура;
	// При схеме YandexOrderV2 и MarketplaceOrderV2.
	// Информация о типе оплаты CARD,CASH.
	Результат.Вставить("paymentType", paymentType); // Информация о типе оплаты CARD,CASH.
	Результат.Вставить("itemsCost", itemsCost); // Полная сумма стоимости блюд в заказе.
	//// Только при схеме MarketplaceOrderV2.
	//Результат.Вставить("deliveryFee", 0); //Стоимость доставки.
	//Результат.Вставить("total", 0); //Общая стоимость заказа.
	//Результат.Вставить("change",0); //Требуемая сдача с суммы.	
	Возврат Результат;
КонецФункции

Функция СтруктураСтрокаТовары()
	
	Результат = Новый Структура;
	
	Результат.Вставить("id", ""); //ID позиции меню в системе партнера.
	Результат.Вставить("name", 0); //Наименование позиции меню.
	Результат.Вставить("quantity", 0); //Количество позиции в заказе.
	Результат.Вставить("price", 0); //Цена пункта меню.
	Результат.Вставить("modifications", Новый Массив); //Список выбранных модификаций. Может быть пустым, передаётся явно, для каждой отдельной позиции в заказе..
	Результат.Вставить("promos", Новый Массив); // Список акций, действующих на текущее блюдо.
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураСтатусЗаказа()
	
	Результат = Новый Структура;
	Результат.Вставить("status", ""); // Статус заказа.
	Результат.Вставить("comment", ""); // Комментарий к смене статуса.
	Результат.Вставить("updatedAt"); // Дата, когда сменился статус заказа, в формате RFC3339 с дробной частью секунд (Y-m-d\\TH:i:s.uP).
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураОтменаЗаказа()
	
	Результат = Новый Структура;
	Результат.Вставить("eatsId",""); // Сквозной идентификатор заказа на стороне Яндекс.Еды в формате DDDDDD-DDDDDD.	
	Результат.Вставить("comment",""); // Описание причин отмены (может быть пустым).
	
	Возврат Результат;
КонецФункции

#КонецОбласти


#Область ПроверкиВозможностиРаботы

Функция ПолучитьИнформациюОТокене(КодКлиента, СекретКлиента)
	
	Результат = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(КодКлиента) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХранилищеТокенов.ДатаЗавершения КАК ДатаЗавершения,
	|	ХранилищеТокенов.Токен КАК Токен
	|ИЗ
	|	РегистрСведений.бит_ХранилищеТокенов КАК ХранилищеТокенов
	|ГДЕ
	|	ХранилищеТокенов.ИдентификаторПриложения = &КодКлиента
	|	И ХранилищеТокенов.СекретПриложения = &СекретКлиента";
	Запрос.УстановитьПараметр("КодКлиента", КодКлиента);
	Запрос.УстановитьПараметр("СекретКлиента", СекретКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = Новый Структура("ДатаЗавершения, Токен");
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьАктуальностьТокена(Токен)
	
	Результат = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Токен) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХранилищеТокенов.ДатаЗавершения КАК ДатаЗавершения,
	|	ХранилищеТокенов.Токен КАК Токен
	|ИЗ
	|	РегистрСведений.бит_ХранилищеТокенов КАК ХранилищеТокенов
	|ГДЕ
	|	ХранилищеТокенов.Токен = &Токен";
	Запрос.УстановитьПараметр("Токен", Токен);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ДатаЗавершения > ТекущаяДата() Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция АвторизацияПройдена(ПараметрыОбработки)
	
	Результат = Ложь;
	СтрокаТокен = "";

	Если ПараметрыОбработки.Свойство("Authorization") Тогда
		СтрокаТокен = ПараметрыОбработки.Authorization;
	КонецЕсли;
	
	Если СтрНачинаетсяС(СтрокаТокен, "Bearer ") Тогда 
		СтрокаТокен = СтрЗаменить(СтрокаТокен, "Bearer ", "");
	КонецЕсли;
	Попытка
		Токен = Новый УникальныйИдентификатор(СтрокаТокен);	
		Результат = ПроверитьАктуальностьТокена(Токен);
	Исключение
	КонецПопытки;
	
	Если Не Результат Тогда
		ЗафиксироватьОшибку(ПараметрыОбработки, 7, 401);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область ТекстыЗапросов

Функция ТекстЗапросаСписокНоменклатуры()
	
	Результат = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СкидкиСтрокиСрезПоследних.Объект КАК Номенклатура,
	|	МАКСИМУМ(СкидкиСтрокиСрезПоследних.СрокДействия) КАК СрокДействия,
	|	МИНИМУМ(СкидкиСтрокиСрезПоследних.ЗначениеСкидки) КАК ЗначениеСкидки,
	|	МАКСИМУМ(СкидкиСтрокиСрезПоследних.Период) КАК ДатаНачала
	|ПОМЕСТИТЬ втСкидки
	|ИЗ
	|	РегистрСведений.СкидкиСтроки.СрезПоследних(
	|			&ТекущаяДата,
	|			ПодразделениеКомпании = &ПодразделениеКомпании
	|				И СрокДействия >= &ТекущаяДата
	|				И НЕ Объект.ГруппаТоваровМаркетПлейс = &ПустаяГруппа
	|				И Объект.ит_ВыгружатьВEcommerce
	|				И НЕ Объект.ЭтоГруппа) КАК СкидкиСтрокиСрезПоследних
	|ГДЕ
	|	СкидкиСтрокиСрезПоследних.Действует
	|
	|СГРУППИРОВАТЬ ПО
	|	СкидкиСтрокиСрезПоследних.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СкидкиСтрокиСрезПоследних.Объект КАК Номенклатура,
	|	МАКСИМУМ(СкидкиСтрокиСрезПоследних.СрокДействия) КАК СрокДействия,
	|	МИНИМУМ(СкидкиСтрокиСрезПоследних.ЗначениеСкидки) КАК ЗначениеСкидки,
	|	МАКСИМУМ(СкидкиСтрокиСрезПоследних.Период) КАК ДатаНачала
	|ПОМЕСТИТЬ втСкидкиГруппы
	|ИЗ
	|	РегистрСведений.СкидкиСтроки.СрезПоследних(
	|			&ТекущаяДата,
	|			ПодразделениеКомпании = &ГруппаСбермаркет
	|				И СрокДействия >= &ТекущаяДата
	|				И НЕ Объект.ГруппаТоваровМаркетПлейс = &ПустаяГруппа
	|				И Объект.ит_ВыгружатьВEcommerce
	|				И НЕ Объект.ЭтоГруппа) КАК СкидкиСтрокиСрезПоследних
	|ГДЕ
	|	СкидкиСтрокиСрезПоследних.Действует
	|
	|СГРУППИРОВАТЬ ПО
	|	СкидкиСтрокиСрезПоследних.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныСрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ втЦеныПодразделения
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&ТекущаяДата,
	|			ТипЦен = &ТипЦенПрайс1
	|				И ПодразделениеКомпании = &ПодразделениеКомпании
	|				И Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	|				И НЕ Номенклатура.ГруппаТоваровМаркетПлейс = &ПустаяГруппа
	|				И Номенклатура.ит_ВыгружатьВEcommerce
	|				И НЕ Номенклатура.ЭтоГруппа) КАК ЦеныСрезПоследних
	|ГДЕ
	|	ЦеныСрезПоследних.Цена > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныСрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ втЦеныГруппыПодразделений
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&ТекущаяДата,
	|			ТипЦен = &ТипЦенПрайс1
	|				И ПодразделениеКомпании = &ГруппаСбермаркет
	|				И Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	|				И НЕ Номенклатура.ГруппаТоваровМаркетПлейс = &ПустаяГруппа
	|				И Номенклатура.ит_ВыгружатьВEcommerce
	|				И НЕ Номенклатура.ЭтоГруппа) КАК ЦеныСрезПоследних
	|ГДЕ
	|	ЦеныСрезПоследних.Цена > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныСрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ втЦеныПодразделения2
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&ТекущаяДата,
	|			ТипЦен = &ТипЦенПрайс2
	|				И ПодразделениеКомпании = &ПодразделениеКомпании
	|				И Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	|				И НЕ Номенклатура.ГруппаТоваровМаркетПлейс = &ПустаяГруппа
	|				И Номенклатура.ит_ВыгружатьВEcommerce
	|				И НЕ Номенклатура.ЭтоГруппа) КАК ЦеныСрезПоследних
	|ГДЕ
	|	ЦеныСрезПоследних.Цена > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныСрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ втЦеныГруппыПодразделений2
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&ТекущаяДата,
	|			ТипЦен = &ТипЦенПрайс2
	|				И ПодразделениеКомпании = &ГруппаСбермаркет
	|				И Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	|				И НЕ Номенклатура.ГруппаТоваровМаркетПлейс = &ПустаяГруппа
	|				И Номенклатура.ит_ВыгружатьВEcommerce
	|				И НЕ Номенклатура.ЭтоГруппа) КАК ЦеныСрезПоследних
	|ГДЕ
	|	ЦеныСрезПоследних.Цена > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	спНоменклатура.Ссылка КАК Товар,
	|	ЕСТЬNULL(тбСкидки.ДатаНачала, ЕСТЬNULL(тбСкидкиГруппы.ДатаНачала, 0)) КАК ДатаНачала,
	|	ЕСТЬNULL(тбСкидки.СрокДействия, ЕСТЬNULL(тбСкидкиГруппы.СрокДействия, 0)) КАК СрокДействия,
	|	ЕСТЬNULL(ЦеныПодразделения.Цена, ЕСТЬNULL(втЦеныГруппыПодразделений.Цена, 0)) КАК ЦенаПрайс1,
	|	ЕСТЬNULL(ЦеныПодразделения2.Цена, ЕСТЬNULL(втЦеныГруппыПодразделений2.Цена, 0)) КАК ЦенаПрайс2,
	|	ЕСТЬNULL(тбСкидки.ЗначениеСкидки, ЕСТЬNULL(тбСкидкиГруппы.ЗначениеСкидки, 0)) КАК Акция
	|ПОМЕСТИТЬ втЦеныИАкции
	|ИЗ
	|	Справочник.Номенклатура КАК спНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеныГруппыПодразделений КАК втЦеныГруппыПодразделений
	|		ПО спНоменклатура.Ссылка = втЦеныГруппыПодразделений.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеныПодразделения КАК ЦеныПодразделения
	|		ПО (ЦеныПодразделения.Номенклатура = спНоменклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеныГруппыПодразделений2 КАК втЦеныГруппыПодразделений2
	|		ПО спНоменклатура.Ссылка = втЦеныГруппыПодразделений2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеныПодразделения2 КАК ЦеныПодразделения2
	|		ПО (ЦеныПодразделения2.Номенклатура = спНоменклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСкидки КАК тбСкидки
	|		ПО (тбСкидки.Номенклатура = спНоменклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСкидкиГруппы КАК тбСкидкиГруппы
	|		ПО (тбСкидкиГруппы.Номенклатура = спНоменклатура.Ссылка)
	|ГДЕ
	|	ЕСТЬNULL(ЦеныПодразделения.Цена, втЦеныГруппыПодразделений.Цена) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА тбЦеныИАкции.Акция = 0
	|			ТОГДА ВЫБОР
	|					КОГДА тбЦеныИАкции.ЦенаПрайс1 > 0
	|							И тбЦеныИАкции.ЦенаПрайс2 > 0
	|						ТОГДА тбЦеныИАкции.ЦенаПрайс1
	|					КОГДА тбЦеныИАкции.ЦенаПрайс2 > 0
	|						ТОГДА тбЦеныИАкции.ЦенаПрайс2
	|					ИНАЧЕ тбЦеныИАкции.ЦенаПрайс1
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА тбЦеныИАкции.ЦенаПрайс2 > 0
	|					ТОГДА тбЦеныИАкции.ЦенаПрайс2
	|				ИНАЧЕ тбЦеныИАкции.ЦенаПрайс1
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА тбЦеныИАкции.Акция = 0
	|			ТОГДА ВЫБОР
	|					КОГДА тбЦеныИАкции.ЦенаПрайс1 > 0
	|							И тбЦеныИАкции.ЦенаПрайс2 > 0
	|						ТОГДА тбЦеныИАкции.ЦенаПрайс2
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ тбЦеныИАкции.Акция
	|	КОНЕЦ КАК Акция,
	|	тбЦеныИАкции.Товар КАК Товар
	|ПОМЕСТИТЬ втЦеныИАкцииИтог
	|ИЗ
	|	втЦеныИАкции КАК тбЦеныИАкции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПОДСТРОКА(ВЫБОР
	|			КОГДА ПОДСТРОКА(Номенклатура.ГруппаТоваровМаркетПлейс.Описание, 1, 1) = """"
	|				ТОГДА Номенклатура.ГруппаТоваровМаркетПлейс.Наименование
	|			ИНАЧЕ Номенклатура.ГруппаТоваровМаркетПлейс.Описание
	|		КОНЕЦ, 0, 150) КАК НаименованиеГруппы,
	|	Номенклатура.ГруппаТоваровМаркетПлейс.Код КАК КодГруппы,
	//|	Номенклатура.ГруппаТоваровМаркетПлейс.Родитель.Код КАК КодГруппыРодитель
	|	""0"" КАК КодГруппыРодитель
	|ПОМЕСТИТЬ ВтКаталог
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ГруппаТоваровМаркетПлейс = &ПустаяГруппа
	|	И Номенклатура.ит_ВыгружатьВEcommerce
	|	И НЕ Номенклатура.ЭтоГруппа
	|
	
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ПОДСТРОКА(ВЫБОР
	//|			КОГДА ПОДСТРОКА(Номенклатура.ГруппаТоваровМаркетПлейс.Родитель.Описание, 1, 1) = """"
	//|				ТОГДА Номенклатура.ГруппаТоваровМаркетПлейс.Родитель.Наименование
	//|			ИНАЧЕ Номенклатура.ГруппаТоваровМаркетПлейс.Родитель.Описание
	//|		КОНЕЦ, 0, 150),
	//|	Номенклатура.ГруппаТоваровМаркетПлейс.Родитель.Код,
	//|	0
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|ГДЕ
	//|	НЕ Номенклатура.ГруппаТоваровМаркетПлейс = &ПустаяГруппа
	//|	И НЕ Номенклатура.ГруппаТоваровМаркетПлейс.Родитель ЕСТЬ NULL
	//|	И Номенклатура.ит_ВыгружатьВEcommerce
	//|	И НЕ Номенклатура.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтКаталог.НаименованиеГруппы КАК name,
	|	ВтКаталог.КодГруппы КАК id,
	|	ВтКаталог.КодГруппыРодитель КАК parentId
	|ИЗ
	|	ВтКаталог КАК ВтКаталог
	|ГДЕ
	|	НЕ ПОДСТРОКА(ВтКаталог.КодГруппы, 0, 3) = """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтКаталог.КодГруппы,
	|	ВтКаталог.КодГруппыРодитель,
	|	ВтКаталог.НаименованиеГруппы
	|
	|УПОРЯДОЧИТЬ ПО
	|	parentId,
	|	id,
	|	name
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.ЕРПМастерКлюч КАК id,
	|	Номенклатура.Артикул КАК vendorCode,
	|	Номенклатура.ГруппаТоваровМаркетПлейс.ЕРПМастерКлюч КАК categoryId,
	|	Номенклатура.Наименование КАК name,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА тбЦеныИАкцииИтог.Акция > 0
	|				ТОГДА тбЦеныИАкцииИтог.Акция
	|			ИНАЧЕ тбЦеныИАкцииИтог.Цена
	|		КОНЕЦ, 0) КАК price,
	|	ЕСТЬNULL(тбЦеныИАкцииИтог.Цена, 0) КАК oldPrice,
	|	Номенклатура.СтавкаНДС.Ставка КАК vat,
	|	Номенклатура.ТипНоменклатуры.Весовой КАК isCatchWeight,
	|	Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто * 1000 КАК ВесНетто,
	|	Номенклатура.ДополнительноеОписание КАК general,
	|	Номенклатура.ит_СрокГодностиСрок КАК expiresIn,
	|	Номенклатура.СтранаПроисхождения.Наименование КАК vendorCountry,
	|	Номенклатура.ит_Состав КАК composition,
	|	Номенклатура.УсловияХранения КАК storageRequirements,
	|	Номенклатура.ЭнергетическаяПищеваяЦенность КАК nutritionalValue,
	|	ВЫБОР
	|		КОГДА Номенклатура.ТипНоменклатуры.Весовой
	|			ТОГДА Номенклатура.бит_ЯндексЕдаКвантОтгрузки
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КвантОтгрузки
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЦеныИАкцииИтог КАК тбЦеныИАкцииИтог
	|		ПО Номенклатура.Ссылка = тбЦеныИАкцииИтог.Товар
	|ГДЕ
	|	Номенклатура.ит_ВыгружатьВEcommerce
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ГруппаТоваровМаркетПлейс = &ПустаяГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	name
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	Штрихкоды.Объект КАК Номенклатура
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект.ит_ВыгружатьВEcommerce = ИСТИНА
	|	И Штрихкоды.Объект ССЫЛКА Справочник.Номенклатура
	|	И Штрихкоды.Объект.ит_ВыгружатьВEcommerce
	|	И НЕ Штрихкоды.Объект.ГруппаТоваровМаркетПлейс = &ПустаяГруппа";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаОстаткиНоменклатуры()
	
	Результат = 	
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.ЕРПМастерКлюч КАК id,
	|	ЕСТЬNULL(АктуальныеОстатки.КоличествоОстаток, 0) КАК stock
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Ссылка,
	|			ОстаткиТоваровКомпанииОстатки.Номенклатура.ЕРПМастерКлюч КАК ЕРПМастерКлюч,
	|			ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток
	|		ИЗ
	|			РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|					&ТекущаяДата,
	|					СкладКомпании = &СкладКомпании
	|						И Номенклатура.ит_ВыгружатьВEcommerce = ИСТИНА) КАК ОстаткиТоваровКомпанииОстатки
	|		ГДЕ
	|			ОстаткиТоваровКомпанииОстатки.КоличествоОстаток > 0) КАК АктуальныеОстатки
	|		ПО Номенклатура.Ссылка = АктуальныеОстатки.Ссылка
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.ит_ВыгружатьВEcommerce";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаЗаказИнформация()
	
	Результат = 	
	"ВЫБРАТЬ
	|	ЯндексЕдаСвойстваЗаказов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЯндексЕдаСвойстваЗаказов.Дискриминатор КАК discriminator,
	|	ЯндексЕдаСвойстваЗаказов.ИдентификаторЯндекс КАК eatsId,
	|	ЯндексЕдаСвойстваЗаказов.ЗаказПокупателя.СкладКомпании.ЕРПМастерКлюч КАК restaurantId,
	|	ЯндексЕдаСвойстваЗаказов.ФИО КАК clientName,
	|	ЯндексЕдаСвойстваЗаказов.Телефон КАК phoneNumber,
	|	ЯндексЕдаСвойстваЗаказов.ДатаДоставки КАК deliveryDate,
	|	ЯндексЕдаСвойстваЗаказов.ДатаПрибытия КАК courierArrivementDate,
	|	ЯндексЕдаСвойстваЗаказов.АдресДоставки КАК full,
	|	ЯндексЕдаСвойстваЗаказов.КоординатыШирота КАК latitude,
	|	ЯндексЕдаСвойстваЗаказов.КоординатыДолгота КАК longitude,
	|	ЯндексЕдаСвойстваЗаказов.КоличествоПерсон КАК persons,
	|	ЯндексЕдаСвойстваЗаказов.ТипОплаты КАК ТипОплаты,
	|	ЕСТЬNULL(РеализацияТоваров.СуммаРеализации, ЯндексЕдаСвойстваЗаказов.ЗаказПокупателя.СуммаДокумента) КАК itemsCost,
	|	ЯндексЕдаСвойстваЗаказов.Комментарий КАК comment
	|ИЗ
	|	РегистрСведений.бит_ЯндексЕдаСвойстваЗаказов КАК ЯндексЕдаСвойстваЗаказов
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РеализацияТоваров.ДокументОснование КАК ЗаказПокупателя,
	|			РеализацияТоваров.СуммаДокумента КАК СуммаРеализации
	|		ИЗ
	|			Документ.РеализацияТоваров КАК РеализацияТоваров
	|		ГДЕ
	|			РеализацияТоваров.ДокументОснование = &ЗаказПокупателя
	|			И РеализацияТоваров.Проведен) КАК РеализацияТоваров
	|		ПО ЯндексЕдаСвойстваЗаказов.ЗаказПокупателя = РеализацияТоваров.ЗаказПокупателя
	|ГДЕ
	|	ЯндексЕдаСвойстваЗаказов.ЗаказПокупателя = &ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Номенклатура.ЕРПМастерКлюч КАК id,
	|	ЗаказПокупателяТовары.Номенклатура.Наименование КАК name,
	|	ЗаказПокупателяТовары.Количество КАК quantity,
	|	ЗаказПокупателяТовары.Цена КАК price
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка = &ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровТовары.Номенклатура.ЕРПМастерКлюч КАК id,
	|	РеализацияТоваровТовары.Номенклатура.Наименование КАК name,
	|	РеализацияТоваровТовары.Количество КАК quantity,
	|	РеализацияТоваровТовары.Цена КАК price
	|ИЗ
	|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	|ГДЕ
	|	РеализацияТоваровТовары.Ссылка.ДокументОснование = &ЗаказПокупателя
	|	И РеализацияТоваровТовары.Ссылка.Проведен";
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ФоновыеЗадания

Процедура ВыполнитьОчисткуСтарыхТокенов(ВходныеПараметры = Неопределено) Экспорт
	
	ИмяСобытия = НСтр("ru='Яндекс.Еда. Очистка старых записей хранилища токенов'", "ru");	 	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, ,, НСтр("ru='Начало выполнение фонового задания <Очистка старых токенов. Яндекс.Еда>'", "ru"));
	
	ПериодАктуальностиЗаписей = Константы.бит_ПериодХраненияТокенов.Получить();	
	Если НЕ ЗначениеЗаполнено(ПериодАктуальностиЗаписей) Тогда
		ПериодАктуальностиЗаписей = 30;
	КонецЕсли;
	НоваяДатаАктуальныхЗаписей = НачалоДня(ТекущаяДата()) - ПериодАктуальностиЗаписей*86400;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИдентификаторПриложения КАК ИдентификаторПриложения,
	|	СекретПриложения КАК СекретПриложения
	|ИЗ
	|	РегистрСведений.бит_ХранилищеТокенов
	|ГДЕ
	|	ДатаЗавершения < &НоваяДатаАктуальныхЗаписей";
	
	Запрос.УстановитьПараметр("НоваяДатаАктуальныхЗаписей", НоваяДатаАктуальныхЗаписей);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		НачатьТранзакцию();
		Пока Выборка.Следующий() Цикл			
			Попытка				
				Запись = РегистрыСведений.бит_ХранилищеТокенов.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				Запись.Удалить();				
			Исключение				
				ОтменитьТранзакцию();				
				ИнфОбОшибке = ИнформацияОбОшибке();
				ТекстОшибки = ИнфОбОшибке.Описание;
				Пока ИнфОбОшибке.Причина <> Неопределено Цикл
					ИнфОбОшибке = ИнфОбОшибке.Причина;
					ТекстОшибки = ТекстОшибки + "
					|" + ИнфОбОшибке.Описание;
				КонецЦикла;
				ТекстОшибки = "Ошибка выполнения процедуры ""ВыполнитьОчисткуСтарыхЗаписейХранилищаЗаданий"": " + ТекстОшибки;
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);				
				Прервать;
			КонецПопытки;			
		КонецЦикла;
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, ,, НСтр("ru='Завершение выполнения фонового задания <Очистка старых токенов. Яндекс.Еда>'", "ru"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьЗаказПокупателя(СтруктураСообщения, ПараметрыОбработки)
	
	ЭтоНовый = Ложь;
	ТекДата = ТекущаяДата();
	Результат = Неопределено;
	
	ДанныеЗаказа = СтруктураЗаказПокупателя();
	ЗаполнитьЗначенияСвойств(ДанныеЗаказа, СтруктураСообщения);
	
	Если ПараметрыОбработки.Свойство("orderId") Тогда
		УИД = Новый УникальныйИдентификатор(ПараметрыОбработки.orderId);
		ЗаказСсылка = Документы.ЗаказПокупателя.ПолучитьСсылку(УИД);
		ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();		
		Если ЗаказОбъект = Неопределено Тогда 
			ЗафиксироватьОшибку(ПараметрыОбработки, 6, 404);
			Возврат Результат;	
		КонецЕсли;
		
		Если Не ДоступноОбновлениеЗаказа(ЗаказСсылка) Тогда 
			ЗафиксироватьОшибку(ПараметрыОбработки, 9, 422); //ответ 422 генерит ошибку
			Возврат Результат;
		КонецЕсли;	
	Иначе
		//Если заказ существует, выдаем ошибку. У Яндекса проскакивает иногда.
		Если Не ПроверитьУникальностьЗаказа(ДанныеЗаказа.eatsId) Тогда 
			ЗафиксироватьОшибку(ПараметрыОбработки, 8, 400);
			Возврат Результат;
		КонецЕсли;
				
		ЭтоНовый = Истина;
		ЗаказОбъект = Документы.ЗаказПокупателя.СоздатьДокумент();
		СсылкаНового = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор);
		ЗаказОбъект.УстановитьСсылкуНового(СсылкаНового);
		
		//Заполняем шапку нового документа
		ЗаказОбъект.ХозОперация = Справочники.ХозОперации.ЗаказРезервированиеПокупателя;
		ЗаказОбъект.Дата = ТекДата;
		ЗаказОбъект.СкладКомпании = Справочники.СкладыКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч", ДанныеЗаказа.restaurantId);
		ЗаказОбъект.ПодразделениеКомпании = ЗаказОбъект.СкладКомпании.ПодразделениеКомпании;
		ЗаказОбъект.ТипЦен = ЗаказОбъект.СкладКомпании.ТипЦенРозничнойТорговли;
		ЗаказОбъект.ДоговорВзаиморасчетов = Константы.бит_ЯндексЕдаДоговор.Получить();
		ЗаказОбъект.Организация = ЗаказОбъект.ДоговорВзаиморасчетов.Организация;
		ЗаказОбъект.Контрагент = ЗаказОбъект.ДоговорВзаиморасчетов.Владелец;
		ЗаказОбъект.ВалютаДокумента = ЗаказОбъект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
		ЗаказОбъект.КурсВалютыВзаиморасчетов = 1;
		ЗаказОбъект.КурсВалютыУпр = 1;
		ЗаказОбъект.КурсДокумента = 1;
		ЗаказОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
		ЗаказОбъект.СрокПоставки = ДанныеЗаказа.deliveryInfo.courierArrivementDate;
	КонецЕсли;
	
	//Заполняем ТЧ Товары
	ЗаказОбъект.Товары.Очистить();
	Для Каждого ТекСтрока Из ДанныеЗаказа.items Цикл
		НоваяСтрока = ЗаказОбъект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("ЕРПМастерКлюч", ТекСтрока.id);
		НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
		НоваяСтрока.Количество = ТекСтрока.quantity;
		НоваяСтрока.Резерв = НоваяСтрока.Количество;
		НоваяСтрока.Цена = ТекСтрока.price;
		НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
		НоваяСтрока.СтавкаНДС = НоваяСтрока.Номенклатура.СтавкаНДС;
		НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
		НоваяСтрока.СуммаВсего = НоваяСтрока.Сумма;
		НоваяСтрока.СуммаНДС = НоваяСтрока.Сумма * НоваяСтрока.СтавкаНДС.Ставка / 100;
	КонецЦикла;
	
	ЗаказОбъект.СуммаДокумента = ЗаказОбъект.Товары.Итог("СуммаВсего");
	
	//Заполняем Статусы
	Если ЭтоНовый Тогда 
		МенЗапСтатусы = РегистрыСведений.бит_ЯндексЕдаСтатусыЗаказов.СоздатьМенеджерЗаписи();
		МенЗапСтатусы.ЗаказПокупателя = СсылкаНового;
		МенЗапСтатусы.Статус = Перечисления.бит_ЯндексЕдаСтатусы.NEW;
		МенЗапСтатусы.Период = ТекДата;	
	КонецЕсли;	
	
	//Заполняем Свойства
	МенЗапСвойства = РегистрыСведений.бит_ЯндексЕдаСвойстваЗаказов.СоздатьМенеджерЗаписи();
	МенЗапСвойства.ЗаказПокупателя = ?(ЭтоНовый, СсылкаНового, ЗаказОбъект.Ссылка);
	МенЗапСвойства.Дискриминатор = ДанныеЗаказа.discriminator;
	ЭтоЯндекс = НРег(МенЗапСвойства.Дискриминатор) = "yandex";
	ЭтоМаркетплейс = НРег(МенЗапСвойства.Дискриминатор) = "marketplace";
	МенЗапСвойства.ИдентификаторЯндекс = ДанныеЗаказа.eatsId;
	
	МенЗапСвойства.ФИО = ДанныеЗаказа.deliveryInfo.clientName;
	МенЗапСвойства.Телефон = ДанныеЗаказа.deliveryInfo.phoneNumber;
	МенЗапСвойства.ДатаПрибытия = ?(ЭтоЯндекс, ДанныеЗаказа.deliveryInfo.courierArrivementDate, Неопределено);
	МенЗапСвойства.ДатаДоставки = ?(ЭтоМаркетплейс, ДанныеЗаказа.deliveryInfo.deliveryDate, Неопределено);
	МенЗапСвойства.АдресДоставки = ?(ЭтоМаркетплейс, ДанныеЗаказа.deliveryInfo.deliveryAddress.full, Неопределено);
	МенЗапСвойства.КоординатыШирота = ?(ЭтоМаркетплейс, ДанныеЗаказа.deliveryInfo.latitude, Неопределено);
	МенЗапСвойства.КоординатыДолгота = ?(ЭтоМаркетплейс, ДанныеЗаказа.deliveryInfo.longitude, Неопределено);
	
	МенЗапСвойства.КоличествоПерсон = ДанныеЗаказа.persons;	
	МенЗапСвойства.ТипОплаты = ?(Не ПустаяСтрока(ДанныеЗаказа.paymentInfo.paymentType), Перечисления.бит_ЯндексЕдаТипыОплаты[ДанныеЗаказа.paymentInfo.paymentType], Неопределено);
	МенЗапСвойства.СуммаОплаты = Число(ДанныеЗаказа.paymentInfo.itemsCost);
	
	МенЗапСвойства.Комментарий = ДанныеЗаказа.comment;
	
	//Сохраняем всё
	Попытка
		НачатьТранзакцию();
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Если ЭтоНовый Тогда 
			МенЗапСтатусы.Записать();
		КонецЕсли;
		МенЗапСвойства.Записать();
		ЗафиксироватьТранзакцию();
		Результат = ЗаказОбъект.Ссылка;		
	Исключение
		
		Если ТранзакцияАктивна() Тогда 
			ОтменитьТранзакцию();
		КонецЕсли;
		
		ИнфОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ИнфОбОшибке.Описание;
		Пока ИнфОбОшибке.Причина <> Неопределено Цикл
			ИнфОбОшибке = ИнфОбОшибке.Причина;
			ТекстОшибки = ТекстОшибки + "
			|" + ИнфОбОшибке.Описание;
		КонецЦикла;
		СообщенияПользователю = ПолучитьСообщенияПользователю();
		Для Каждого Сообщение Из СообщенияПользователю Цикл 
			ТекстОшибки = ТекстОшибки +  Символы.ПС + Сообщение.Текст;
		КонецЦикла;
		
		ТекстОшибки = "Ошибка выполнения процедуры ""ОбработатьЗаказПокупателя"": " + ТекстОшибки;
		Событие = "ЯндексЕда";
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ЗафиксироватьОшибку(ПараметрыОбработки, 5);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьУникальностьЗаказа(ИдентификаторЯндекс)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЯндексЕдаСвойстваЗаказов.ЗаказПокупателя КАК ЗаказПокупателя
		|ИЗ
		|	РегистрСведений.бит_ЯндексЕдаСвойстваЗаказов КАК бит_ЯндексЕдаСвойстваЗаказов
		|ГДЕ
		|	бит_ЯндексЕдаСвойстваЗаказов.ИдентификаторЯндекс = &ИдентификаторЯндекс";
	
	Запрос.УстановитьПараметр("ИдентификаторЯндекс", ИдентификаторЯндекс);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Не Выборка.Следующий();
	
КонецФункции

Функция ДоступноОбновлениеЗаказа(ЗаказПокупателя)
	
	Статус = РегистрыСведений.бит_ЯндексЕдаСтатусыЗаказов.ПолучитьПоследнее(, Новый Структура("ЗаказПокупателя", ЗаказПокупателя)).Статус;
	НастройкиСтатуса = РегистрыСведений.бит_ЯндексЕдаНастройкиСтатусов.СоздатьМенеджерЗаписи();
	НастройкиСтатуса.Статус = Статус;
	НастройкиСтатуса.Прочитать();
	Возврат ?(НастройкиСтатуса.Выбран(), НастройкиСтатуса.РазрешеноОбновление, Ложь);
	
КонецФункции

Функция ДоступноОтменаЗаказа(ЗаказПокупателя)
	
	Статус = РегистрыСведений.бит_ЯндексЕдаСтатусыЗаказов.ПолучитьПоследнее(, Новый Структура("ЗаказПокупателя", ЗаказПокупателя)).Статус;
	НастройкиСтатуса = РегистрыСведений.бит_ЯндексЕдаНастройкиСтатусов.СоздатьМенеджерЗаписи();
	НастройкиСтатуса.Статус = Статус;
	НастройкиСтатуса.Прочитать();
	Возврат ?(НастройкиСтатуса.Выбран(), НастройкиСтатуса.РазрешенаОтмена, Ложь);
	
КонецФункции

Функция ПолучитьПараметрыИзЗаголовка(Заголовки, ВходныеПараметры, ИмяПоУмолчанию = "")
	
	СчетчикПустыхЭлементов = 1;
	Для Каждого ТекЗаголовок Из Заголовки Цикл
		
		ИмяЗаголовка = ТекЗаголовок.Ключ;
		
		Если ВРег(ИмяЗаголовка) = ВРег("token") Тогда
			
			ИмяЗаголовка = "Токен";
			
		КонецЕсли;
		
		ИмяЗаголовка = СтрЗаменить(ИмяЗаголовка, "-","_");
		ИмяЗаголовка = СтрЗаменить(ИмяЗаголовка, "*","");
		
		Если НЕ ЗначениеЗаполнено(ИмяЗаголовка) И ЗначениеЗаполнено(ИмяПоУмолчанию) Тогда
			ВходныеПараметры.Вставить(ИмяПоУмолчанию + Формат(СчетчикПустыхЭлементов, "ЧГ="), ТекЗаголовок.Значение);
			СчетчикПустыхЭлементов = СчетчикПустыхЭлементов + 1;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяЗаголовка) Тогда
			ВходныеПараметры.Вставить(ИмяЗаголовка, ТекЗаголовок.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВходныеПараметры;
	
КонецФункции

Процедура ЗафиксироватьОшибку(ПараметрыОбработки, КодОшибки = 0, КодРезультата = 500)
	
	ПараметрыОбработки.КодРезультата = КодРезультата;
	
	Если ЗначениеЗаполнено(КодОшибки) Тогда
		ТекстОшибки = "";
		Если КодОшибки = 1 Тогда
			ТекстОшибки = НСтр("ru = 'Не удалось прочитать сообщение'");
		ИначеЕсли КодОшибки = 2 Тогда
			ТекстОшибки = НСтр("ru='Обработка сообщения завершилась с ошибкой. Неизвестный тип запроса'", "ru");
		ИначеЕсли КодОшибки = 3 Тогда
			ТекстОшибки = НСтр("ru='Ошибка обработки запроса'", "ru");
		ИначеЕсли КодОшибки = 4 Тогда
			ТекстОшибки = НСтр("ru='Магазин не найден'", "ru");
		ИначеЕсли КодОшибки = 5 Тогда
			ТекстОшибки = НСтр("ru='Ошибка сохранения заказа'", "ru");
		ИначеЕсли КодОшибки = 6 Тогда
			ТекстОшибки = НСтр("ru='Заказ не найден'", "ru");
		ИначеЕсли КодОшибки = 7 Тогда
			ТекстОшибки = НСтр("ru='Ошибка аутентификации'", "ru");
		ИначеЕсли КодОшибки = 8 Тогда
			ТекстОшибки = НСтр("ru='Заказ был загружен ранее'", "ru");
		ИначеЕсли КодОшибки = 9 Тогда
			ТекстОшибки = НСтр("ru='Редактирование заказа недоступно'", "ru");
		ИначеЕсли КодОшибки = 10 Тогда
			ТекстОшибки = НСтр("ru='Отмена заказа недоступна'", "ru");
		КонецЕсли;
		
		СтруктураОшибки = Новый Структура;
		СтруктураОшибки.Вставить("code" , КодОшибки);
		СтруктураОшибки.Вставить("description", ТекстОшибки);
		
		ПараметрыОбработки.МассивОшибок.Добавить(СтруктураОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, ИмяПеременной, ЗначениеПременной)
	
	ПараметрыОбработки.ВыходныеПараметры.Вставить(ИмяПеременной, ЗначениеПременной);
	
КонецПроцедуры

Процедура ЗафиксироватьВСлужебномЛоге(Знач СтрокаСообщения, ПараметрыОбработки, ЭтоОтвет)
	
	Если ПараметрыОбработки.Свойство("РежимОтладки") Тогда
		
		Префикс = ?(ЭтоОтвет, "<--","-->");
		ТекстШапки = СтрШаблон("%1 %2 %3 %4", ТекущаяДата(), Префикс, ПараметрыОбработки.МетодЗапроса, ПараметрыОбработки.ОтносительныйURL);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения,Символы.ПС, "/n");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения,Символы.ВК, "");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения,Символы.Таб, "");
		
		Попытка
			Файл = Новый ЗаписьТекста();
			Файл.Открыть("C:\ЯндексЕда.txt",КодировкаТекста.UTF8," ",Истина);
			Файл.ЗаписатьСтроку("=============================================================================");
			Файл.ЗаписатьСтроку(Символы.ПС);
			Файл.ЗаписатьСтроку(ТекстШапки);
			Файл.ЗаписатьСтроку(Символы.ПС);
			Файл.ЗаписатьСтроку(СтрокаСообщения);
			Файл.ЗаписатьСтроку(Символы.ПС);
			Файл.Закрыть();
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			ТекстОшибки = ИнфОбОшибке.Описание;
			Пока ИнфОбОшибке.Причина <> Неопределено Цикл
				ИнфОбОшибке = ИнфОбОшибке.Причина;
				ТекстОшибки = ТекстОшибки + "
				|" + ИнфОбОшибке.Описание;
			КонецЦикла;
			ТекстОшибки = "Ошибка выполнения процедуры: " + ТекстОшибки;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьПараметрыИзСтроки(ПараметрыОбработки, ТекстЗапроса)
	
	Если ПараметрыОбработки.Свойство("Content_Type")
		И ПараметрыОбработки.Content_Type = "application/x-www-form-urlencoded" Тогда
		ТекстЗапроса = РаскодироватьСтроку(ТекстЗапроса, СпособКодированияСтроки.URLВКодировкеURL)
	КонецЕсли;
	
	СписокПараметров = СтрРазделить(ТекстЗапроса, "&");
	Для Каждого ТекПараметр Из СписокПараметров Цикл
		ТекСвойство = СтрРазделить(ТекПараметр,"=", Истина);
		Если ТекСвойство.Количество() > 1 Тогда
			КлючСвойства = СокрЛП(ТекСвойство[0]);
			ЗначениеСвойства = СокрЛП(ТекСвойство[1]);
			ПараметрыОбработки.Вставить(КлючСвойства, ЗначениеСвойства);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ЭтоJSON(Текст)
	Результат = ТипЗнч(Текст) = Тип("Строка") 
	И (СтрНачинаетсяС(СокрЛ(Текст), "{")
	ИЛИ СтрНачинаетсяС(СокрЛ(Текст), "["));
	Возврат Результат;
КонецФункции

Функция ПолучитьМассивПолейДат()
	Результат = Новый Массив;
	Результат.Добавить("deliveryDate");
	Результат.Добавить("courierArrivementDate");
	Возврат Результат;
КонецФункции

Функция ТипШтрихкодаПоДлине(Штрихкод)
	
	Если СтрДлина(Штрихкод) = 13 Тогда Возврат "ean13";
	ИначеЕсли СтрДлина(Штрихкод) = 14 Тогда Возврат "ean14";
	Иначе Возврат "code128"; КонецЕсли;
	
КонецФункции

#КонецОбласти
