#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура формирует строки списка участников.
//
// Параметры:
//  Контакты  - Массив - массив, содержащий участников взаимодействия.
//
Процедура ЗаполнитьКонтакты(Контакты) Экспорт
	
	Если Не Взаимодействия.КонтактыЗаполнены(Контакты) Тогда
		Возврат;
	КонецЕсли;
	
	// В телефонный звонок переносим первого контакта.
	Параметр = Контакты[0];
	Если ТипЗнч(Параметр) = Тип("Структура") Тогда
		АбонентКонтакт       = Параметр.Контакт;
		АбонентКакСвязаться  = Параметр.Адрес;
		АбонентПредставление = Параметр.Представление;
	Иначе
		АбонентКонтакт = Параметр;
	КонецЕсли;
	
	Взаимодействия.ДозаполнитьПоляКонтактов(АбонентКонтакт, АбонентПредставление, 
		АбонентКакСвязаться, Перечисления.ТипыКонтактнойИнформации.Телефон);
	
КонецПроцедуры

// +РАРУС См. описание в комментарии к одноименной процедуре в модуле УправлениеДоступом.
// Параметры:
//  Таблица - ТаблицаЗначений, Ссылка - таблица.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Ограничение по "Автор".
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.НомерНабора     = Таблица.Количество()+1;
	СтрокаТаб.ЗначениеДоступа = Автор;
	
	// Ограничение по "Ответственный".
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.НомерНабора     = Таблица.Количество()+1;
	СтрокаТаб.ЗначениеДоступа = Ответственный;
	
	Если ТипЗнч(АбонентКонтакт) = Тип("СправочникСсылка.Контрагенты")
		ИЛИ ТипЗнч(АбонентКонтакт) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		СтрокаТаб = Таблица.Добавить();
		СтрокаТаб.НомерНабора     = Таблица.Количество()+1;
		СтрокаТаб.ЗначениеДоступа = АбонентКонтакт;
		
	КонецЕсли;
	
КонецПроцедуры // -РАРУС

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Взаимодействия.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// +РАРУС
	Ответственный    = Пользователи.ТекущийПользователь().Сотрудник;
	// -РАРУС
	Автор            = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

// +Рарус
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// +Рарус Добавлены реквизиты
	ПроверяемыеРеквизиты.Добавить("Организация");
	ПроверяемыеРеквизиты.Добавить("ПодразделениеКомпании"); 
	ПроверяемыеРеквизиты.Добавить("Автор");

КонецПроцедуры // -РАРУС

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Взаимодействия.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли