// Модуль произвольной формы документа "Изменение цен"


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	Если Не Элементы.Найти("ПрайсЛистКонтрагента")=Неопределено Тогда
		Если РасчетЦенОт=4 И ХозОперация=Справочники.ХозОперации.УстановкаЦенКонтрагента И ЗначениеЗаполнено(Контрагент) Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(ЭтотОбъект.Элементы.ПрайсЛистКонтрагента.ПараметрыВыбора, "Отбор.Владелец", Контрагент);
		Иначе
			УправлениеДиалогомСервер.УдалитьПараметрВыбора(ЭтотОбъект.Элементы.ПрайсЛистКонтрагента.ПараметрыВыбора, "Отбор.Владелец");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	Элементы.ПроцентНаценки.Доступность = НЕ (ПроцентНаценкиИзНоменклатуры ИЛИ ПроцентНаценкиИзРекомендуемых);
	Элементы.ОкруглятьДо.Доступность    = НЕ (ОкруглениеИзТипаЦены);
	
	НайденныйЭлемент=Элементы.РасчетЦенОт.СписокВыбора.НайтиПоЗначению(7);
	Если ТипЦен.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоЕдиницеИзмерения Тогда
		Если НайденныйЭлемент=Неопределено Тогда
			Элементы.РасчетЦенОт.СписокВыбора.Добавить(7, НСтр("ru = 'От базовой единицы измерения'"));
		КонецЕсли;
	Иначе
		Если НайденныйЭлемент<>Неопределено Тогда
			Если РасчетЦенОт = 7 Тогда
				РасчетЦенОт = 0;
			КонецЕсли;
			Элементы.РасчетЦенОт.СписокВыбора.Удалить(НайденныйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
	// Расчет от базового типа цен
	Элементы.БазовыйТипЦен.Видимость 		= РасчетЦенОт = 0;
	Элементы.ДокументОснование.Видимость 	= РасчетЦенОт = 1;
	Элементы.Поставщик.Видимость 			= (РасчетЦенОт = 2) ИЛИ (РасчетЦенОт = 8);
	Элементы.СкладКомпании.Видимость 		= (РасчетЦенОт = 3) ИЛИ (РасчетЦенОт = 5);
	Элементы.ПрайсЛистКонтрагента.Видимость = РасчетЦенОт = 4;
	Элементы.БазовоеПодразделение.Видимость = РасчетЦенОт = 6;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события нажатия кнопки "Применить".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Применить(Команда)
	
	Результат = Новый Структура();
	Результат.Вставить("ТипЦен",                       ТипЦен);
	Результат.Вставить("РасчетЦенОт",                  РасчетЦенОт);
	Результат.Вставить("БазовыйТипЦен",                БазовыйТипЦен);
	Результат.Вставить("ДокументОснование",            ДокументОснование);
	Результат.Вставить("Поставщик",                    Поставщик);
	Результат.Вставить("СкладКомпании",                СкладКомпании);
	Результат.Вставить("ПроцентНаценки",               ПроцентНаценки);
	Результат.Вставить("ОкруглятьДо",                  ОкруглятьДо);
	Результат.Вставить("ПроцентНаценкиИзНоменклатуры", ПроцентНаценкиИзНоменклатуры);
	Результат.Вставить("ПрайсЛистКонтрагента",         ПрайсЛистКонтрагента);
	Результат.Вставить("БазовоеПодразделение",         БазовоеПодразделение);
	// тк+
	Результат.Вставить("ПроцентНаценкиИзРекомендуемых", ПроцентНаценкиИзРекомендуемых);
	Результат.Вставить("ОкруглениеИзТипаЦены",          ОкруглениеИзТипаЦены);
	// тк-
	
	Закрыть(Результат);
	
КонецПроцедуры // Применить()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Расчет цен от" в контексте сервера.
//
&НаСервере
Процедура БазовыйТипЦенПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	Если НЕ ПроцентНаценкиИзНоменклатуры Тогда
		ПроцентНаценки = БазовыйТипЦен.ПроцентСкидкиНаценки;
	КонецЕсли;
	
КонецПроцедуры // БазовыйТипЦенПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Расчет цен от".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура БазовыйТипЦенПриИзменении(Элемент)

	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	БазовыйТипЦенПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // БазовыйТипЦенПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Расчет цен от" в контексте сервера.
//
&НаСервере
Процедура РасчетЦенОтПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // РасчетЦенОтПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Расчет цен от".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура РасчетЦенОтПриИзменении(Элемент)

	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	РасчетЦенОтПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // РасчетЦенОтПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Процент наценки из номенклатуры" в
// контексте сервера.
//
&НаСервере
Процедура ПроцентНаценкиИзНоменклатурыПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПроцентНаценкиИзНоменклатурыПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Процент наценки из номенклатуры".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПроцентНаценкиИзНоменклатурыПриИзменении(Элемент)
	
	Если ПроцентНаценкиИзНоменклатуры Тогда
		ПроцентНаценкиИзРекомендуемых = Ложь;
	КонецЕсли;

	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ПроцентНаценкиИзНоменклатурыПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ПроцентНаценкиИзНоменклатурыПриИзменении()

// тк+
// Обработчик события возникающего на клиенте при изменении данных реквизита "Процент наценки из рекомендуемых" в
// контексте сервера.
//
&НаСервере
Процедура ПроцентНаценкиИзРекомендуемыхПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПроцентНаценкиИзНоменклатурыПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Процент наценки из рекомендуемых".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПроцентНаценкиИзРекомендуемыхПриИзменении(Элемент)
	
	Если ПроцентНаценкиИзРекомендуемых Тогда
		ПроцентНаценкиИзНоменклатуры = Ложь;
	КонецЕсли;
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ПроцентНаценкиИзРекомендуемыхПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры //ПроцентНаценкиИзРекомендуемыхПриИзменении()

&НаСервере
Процедура ОкруглениеИзТипаЦеныПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОкруглениеИзТипаЦеныПриИзмененииНаСервере()

&НаКлиенте
Процедура ОкруглениеИзТипаЦеныПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ОкруглениеИзТипаЦеныПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры

// тк-


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ТипЦен                       = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ТипЦен");
	ХозОперация                  = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ХозОперация");
	Контрагент                   = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Контрагент");
	РасчетЦенОт                  = ПолучитьЗначениеПараметраСтруктуры(Параметры, "РасчетЦенОт");
	БазовыйТипЦен                = ПолучитьЗначениеПараметраСтруктуры(Параметры, "БазовыйТипЦен");
	ДокументОснование            = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДокументОснование");
	Поставщик                    = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Поставщик");
	СкладКомпании                = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СкладКомпании");
	ПроцентНаценки               = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ПроцентНаценки");
	ОкруглятьДо                  = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ОкруглятьДо");
	ПроцентНаценкиИзНоменклатуры = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ПроцентНаценкиИзНоменклатуры");
	ПроцентНаценкиИзРекомендуемых = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ПроцентНаценкиИзРекомендуемых");
	ПрайсЛистКонтрагента         = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ПрайсЛистКонтрагента");
	БазовоеПодразделение         = ПолучитьЗначениеПараметраСтруктуры(Параметры, "БазовоеПодразделение");
	
	// тк+
	ОкруглениеИзТипаЦены         = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ОкруглениеИзТипаЦены");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУпрощенныйСпособУстановкиНаценки") Тогда
		Элементы.ПроцентНаценкиИзНоменклатуры.Видимость  = Истина;
		Элементы.ПроцентНаценкиИзРекомендуемых.Видимость = Ложь;
	Иначе
		Элементы.ПроцентНаценкиИзНоменклатуры.Видимость  = Ложь;
		Элементы.ПроцентНаценкиИзРекомендуемых.Видимость = Истина;
	КонецЕсли;
	// тк-
	
	ЭтотОбъект.Заголовок = НСтр("ru = 'Параметры расчета типа цены ""'") + Параметры.ТипЦен +"""";
	
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

