
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаполнитьСводныйДокумент(ДокументОбъект, ИмяДокумента, СписокДокументов, ПоХарактеристикам = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СписокДокументов);
	
	МетаданныеДокумента = ДокументОбъект.Ссылка.Метаданные();
	
	Если СписокДокументов.Количество()>0 Тогда
		ИменаИсключаемыхРеквизитов = ОбработкаСобытийДокументаСервер.ПолучитьИменаИсключаемыхРеквизитов();
		//ЗаполнитьЗначенияСвойств(ДокументОбъект, СписокДокументов[0],,ИменаИсключаемыхРеквизитов);
		ДокИсточник = СписокДокументов[0];
		Для Каждого ТекРеквизит Из МетаданныеДокумента.Реквизиты Цикл
			Если СтрНайти(ИменаИсключаемыхРеквизитов, ТекРеквизит.Имя) >0 Тогда
				Продолжить;
			КонецЕсли;
			ДокументОбъект[ТекРеквизит.Имя] = ДокИсточник[ТекРеквизит.Имя];
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ТабличнаяЧасть Из МетаданныеДокумента.ТабличныеЧасти Цикл
		
		// Пропустим служебные табличные части.
		Если ТабличнаяЧасть.Имя="ДополнительныеРеквизиты" 
			ИЛИ ТабличнаяЧасть.Имя="КонтактнаяИнформация" 
			ИЛИ ТабличнаяЧасть.Имя="НаборыЗначенийДоступа" Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстРеквизитовТабличнойЧасти = "";
		Для Каждого ТекущийРеквизит Из ТабличнаяЧасть.Реквизиты Цикл
			ТекстРеквизитовТабличнойЧасти = ТекстРеквизитовТабличнойЧасти + ?(ТекстРеквизитовТабличнойЧасти = "", "", ", ") + "
			|	ТаблицаДокумента." + ТекущийРеквизит.Имя+" КАК " + ТекущийРеквизит.Имя;
		КонецЦикла;
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	" + ТекстРеквизитовТабличнойЧасти + "
		|ИЗ
		|	Документ."+МетаданныеДокумента.Имя+"."+ТабличнаяЧасть.Имя+" КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В (&Ссылка)
		|";
		
		ТаблицаОбъекта = ДокументОбъект[ТабличнаяЧасть.Имя];
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаОбъекта.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
	КонецЦикла;
	
	Если ИмяДокумента = "Инвентаризация" Тогда
		
		//ПоляПоиска = "Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Коэффициент,Цена,ДокументПередачи,Партия,ГТД,ГТДИзлишков,НомерЛиста,ЦенаРозничная,Ячейка,АлкогольнаяПродукция";
		ПоляПоиска = "Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Коэффициент,ДокументПередачи,Партия,ГТД,ГТДИзлишков,НомерЛиста,Ячейка";
		Товары = ДокументОбъект.Товары.Выгрузить();
		
		Товары.Свернуть(ПоляПоиска, "КоличествоФакт,СуммаФакт,СуммаРозничнаяФакт");
		ДокументОбъект.Товары.Загрузить(Товары);
		
		ПараметрыДействия = Новый Структура;
		ПараметрыДействия.Вставить("НеЗаполнятьКоличествоФакт", Истина);
		
		Для Каждого СтрокаТовара из ДокументОбъект.Товары Цикл
			Документы.Инвентаризация.ТоварыНоменклатураПриИзменении(ДокументОбъект, СтрокаТовара, ПараметрыДействия);
			Документы.Инвентаризация.ТоварыКоличествоФактПриИзменении(ДокументОбъект, СтрокаТовара, ПараметрыДействия);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
