
//////////////////////////////////////////////////////////////////////////////////////////
// <Управление списком справочника переопределяемый:
//  Предназначен для переопределения функциональностей работы со списками справочников.
//
//////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Позволяет переопределить состав полей отборов заблокированных для изменения пользователем.
//
// Параметры:
//  ЗаблокированныеПоля - Массив - Список полей, заполненный по умолчанию.
//                 Не изменяемый для переопределения полей необходимо вернуть массив с полями.
//  Форма - УправляемаяФорма - форма переданного справочника.
//
// Возвращаемое значение:
//   Массив, Неопределено - Перечень полей которые должны быть заблокированы.
//                          Если возвращено Неопределено список по умолчанию не изменяется.
//
Функция ЗаблокированныеОтборыПоУмолчанию(Знач ЗаблокированныеПоля, Форма) Экспорт
	
	// Чтоб не было ошибки "пустой обработчик".
	Возврат Неопределено;
	
КонецФункции // ЗаблокированныеОтборыПоУмолчанию()

#КонецОбласти
