#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// +РАРУС

#Область Обновление

Процедура ЗаполнитьПодразделениеДокументов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КассовыйЧекКоррекции.Ссылка КАК Ссылка,
	               |	КассовыйЧекКоррекции.Ответственный.ПодразделениеКомпании КАК ПодразделениеКомпании
	               |ИЗ
	               |	Документ.КассовыйЧекКоррекции КАК КассовыйЧекКоррекции
	               |ГДЕ
	               |	КассовыйЧекКоррекции.ПодразделениеКомпании = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка)";
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ПодразделениеКомпании) Тогда
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокументОбъект.ПодразделениеКомпании = Выборка.ПодразделениеКомпании;
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			Попытка
				ДокументОбъект.Записать();
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи документа ""Кассовый чек коррекции""'", 
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПодразделениеДокументов()

#КонецОбласти

// -РАРУС

#КонецЕсли
