
// Модуль объекта документа "Отчёт об импорте продукции ЕГАИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Поступление товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПоступлениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ХозОперация       = Справочники.ХозОперации.ОтчетОбИмпортеПродукцииЕГАИС;
	ДокументОснование = ДанныеЗаполнения;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоступлениеТоваров.Контрагент,
	|	ПоступлениеТоваров.Контрагент.ИНН КАК КонтрагентИНН,
	|	ПоступлениеТоваров.Контрагент.КПП КАК КонтрагентКПП,
	|	ПоступлениеТоваров.СкладКомпании.ПодразделениеКомпании.Организация.ИНН КАК ПодразделениеИНН,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваров.СкладКомпании.ПодразделениеКомпании.КПП = """"
	|			ТОГДА ПоступлениеТоваров.СкладКомпании.ПодразделениеКомпании.Организация.КПП
	|		ИНАЧЕ ПоступлениеТоваров.СкладКомпании.ПодразделениеКомпании.КПП
	|	КОНЕЦ КАК ПодразделениеКПП,
	|	ПоступлениеТоваров.Организация КАК Организация,
	|	ПоступлениеТоваров.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ПоступлениеТоваров.Организация.ИНН КАК ОрганизацияИНН,
	|	ПоступлениеТоваров.Организация.КПП КАК ОрганизацияКПП,
	|	ПоступлениеТоваров.Комментарий КАК Комментарий,
	|	ПоступлениеТоваров.ДоговорВзаиморасчетов.НомерДоговора КАК НомерКонтракта,
	|	ПоступлениеТоваров.ДоговорВзаиморасчетов.ДатаНачала КАК ДатаКонтракта
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать();
	Если НЕ ВыборкаШапка.Следующий() Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Комментарий    = ВыборкаШапка.Комментарий;
	НомерКонтракта = ВыборкаШапка.НомерКонтракта;
	ДатаКонтракта  = ВыборкаШапка.ДатаКонтракта;
	Импортер       = Справочники.КлассификаторОрганизацийЕГАИС.НайтиКлассификаторОрганизации(ВыборкаШапка.Организация, ВыборкаШапка.ПодразделениеКомпании, ВыборкаШапка.ОрганизацияИНН, ВыборкаШапка.ОрганизацияКПП);
	Поставщик      = Справочники.КлассификаторОрганизацийЕГАИС.НайтиКлассификаторКонтрагента(ВыборкаШапка.Контрагент, ВыборкаШапка.КонтрагентИНН, ВыборкаШапка.КонтрагентКПП);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровТовары.Номенклатура
	|ПОМЕСТИТЬ
	|	ТаблицаТоваров
	|ИЗ
	|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	|ГДЕ
	|	ПоступлениеТоваровТовары.Ссылка = &Поступление
	|;
	|
	|ВЫБРАТЬ
	|	СоответствиеНоменклатурыЕГАИС.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.Код) КАК АлкогольнаяПродукцияКод
	|ПОМЕСТИТЬ
	|	ТаблицаМаксимальныхКодов
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|ГДЕ
	|	СоответствиеНоменклатурыЕГАИС.Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ТаблицаТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	СоответствиеНоменклатурыЕГАИС.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаМаксимальныхКодов.Номенклатура КАК Номенклатура,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Ссылка КАК АлкогольнаяПродукция
	|ПОМЕСТИТЬ
	|	ТаблицаАктуальныхСоответствий
	|ИЗ
	|	ТаблицаМаксимальныхКодов КАК ТаблицаМаксимальныхКодов
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.КлассификаторАлкогольнойПродукцииЕГАИС КАК КлассификаторАлкогольнойПродукцииЕГАИС
	|ПО
	|	ТаблицаМаксимальныхКодов.АлкогольнаяПродукцияКод = КлассификаторАлкогольнойПродукцииЕГАИС.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровТовары.Номенклатура,
	//|	ПоступлениеТоваровТовары.ЕдиницаИзмерения,
	//|	ПоступлениеТоваровТовары.Коэффициент КАК Коэффициент,
	|	СУММА(ВЫБОР
	|		КОГДА ПоступлениеТоваровТовары.Номенклатура.КоличествоВМультипаке = 0 ИЛИ ПоступлениеТоваровТовары.Номенклатура.КоличествоВМультипаке ЕСТЬ NULL ТОГДА
	|			ПоступлениеТоваровТовары.Количество
	|		ИНАЧЕ
	|			ПоступлениеТоваровТовары.Количество*ПоступлениеТоваровТовары.Номенклатура.КоличествоВМультипаке
	|	КОНЕЦ*ПоступлениеТоваровТовары.Коэффициент) КАК Количество,
	|	ТаблицаАктуальныхСоответствий.АлкогольнаяПродукция,
	|	ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры,
	|	ПоступлениеТоваровТовары.ГТД.Наименование КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры.СерийныйНомер ЕСТЬ NULL 
	|			ТОГДА ПоступлениеТоваровТовары.НомерСтроки
	|		ИНАЧЕ ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры.СерийныйНомер
	|	КОНЕЦ КАК НомерПартии,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровТовары.ГТД = ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка) ТОГДА
	|			ПоступлениеТоваровТовары.Номенклатура.СтранаПроисхождения
	|		ИНАЧЕ
	|			ПоступлениеТоваровТовары.ГТД.Страна
	|	КОНЕЦ КАК СтранаПроисхождения
	|ИЗ
	|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТаблицаАктуальныхСоответствий КАК ТаблицаАктуальныхСоответствий
	|ПО
	|	ПоступлениеТоваровТовары.Номенклатура = ТаблицаАктуальныхСоответствий.Номенклатура
	|ГДЕ
	|	ПоступлениеТоваровТовары.Ссылка = &Поступление
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровТовары.Номенклатура,
	|	ТаблицаАктуальныхСоответствий.АлкогольнаяПродукция,
	|	ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры,
	|	ПоступлениеТоваровТовары.ГТД.Наименование,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры.СерийныйНомер ЕСТЬ NULL 
	|			ТОГДА ПоступлениеТоваровТовары.НомерСтроки
	|		ИНАЧЕ ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры.СерийныйНомер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровТовары.ГТД = ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка) ТОГДА
	|			ПоступлениеТоваровТовары.Номенклатура.СтранаПроисхождения
	|		ИНАЧЕ
	|			ПоступлениеТоваровТовары.ГТД.Страна
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Поступление", ДанныеЗаполнения);
	
	Товары.Очистить();
	ДатаГТД  = Дата(1,1,1);
	Выборка = Запрос.Выполнить().Выбрать();
	СтранаПроисхождения = Неопределено;
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		
		Если СтранаПроисхождения = Неопределено И ЗначениеЗаполнено(Выборка.СтранаПроисхождения) Тогда
			СтранаПроисхождения = Выборка.СтранаПроисхождения;
		КонецЕсли;
		
		МассивЧастейГТД = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Выборка.НомерГТД, "/");
		
		Если МассивЧастейГТД.Количество() < 3 Тогда
			//Предупреждение("Неверный формат номера ГТД!");
			Продолжить;
		КонецЕсли;
		
		Если НомерГТД = "" Тогда 
			НомерГТД      = МассивЧастейГТД[0] + "/" + МассивЧастейГТД[1] + "/" + МассивЧастейГТД[2];
			ДатаГТДСтрока = МассивЧастейГТД[1];
			ДатаГТД       = Дата("20" + Прав(ДатаГТДСтрока,2) + Сред(ДатаГТДСтрока,3,2) + Лев(ДатаГТДСтрока,2));
		Иначе
			ДатаГТДСтрока = МассивЧастейГТД[1];
			Если ДатаГТД  <> Дата("20" + Прав(ДатаГТДСтрока,2) + Сред(ДатаГТДСтрока,3,2) + Лев(ДатаГТДСтрока,2)) Тогда
				//Предупреждение("ГТД имеют разные даты!");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ДатаИмпорта = ДатаГТД;
	Страна      = СтранаПроисхождения;
	
	//Если СпецификаКонфигурации = "DPTRADE" Тогда
	//	
	//	// диапазоны марок
	//	
	//	ДиапазоныВсехПартий = ТаблицаСвойств.НайтиСтроки(Новый Структура("Свойство", "Диапазон акцизных марок"));
	//	Если ДиапазоныВсехПартий.Количество() = 0 Тогда 
	//		Предупреждение("Не найдены диапазоны акцизных марок!");
	//	Иначе  
	//		ИдМарок =  0;
	//		Для Каждого СтрокаДиапазонов Из ДиапазоныВсехПартий Цикл
	//			ИдМарок = ИдМарок + 1;
	//			ДиапазоныМарок = СтрЗаменить(СтрокаДиапазонов.Значение, ",", Символы.ПС);
	//			Партия = СтрокаДиапазонов.Объект.СерийныйНомер;
	//			Если СтрЧислоСтрок(ДиапазоныМарок) = 0 Тогда 
	//				Сообщить("Не найдены диапазоны марок для партии """ + Партия + """!");
	//				Продолжить;
	//			КонецЕсли;
	//			
	//			СтрокиТовары = ДокументОбъект.Товары.НайтиСтроки(Новый Структура("Партия", Партия));
	//			Если СтрокиТовары.Количество() <> 1 Тогда 
	//				Сообщить("Не удалось привязать марки к партии """ + Партия + """!");
	//				Продолжить;
	//			КонецЕсли;	
	//			СтрокаТовары = СтрокиТовары[0];
	//			СтрокаТовары.ИдентификаторМарок = ИдМарок;
	//			Для Сч = 1 По СтрЧислоСтрок(ДиапазоныМарок) Цикл
	//				ДиапазонМарок = СокрЛП(СтрПолучитьСтроку(ДиапазоныМарок, Сч));
	//				ПозицияПробела = Найти(ДиапазонМарок, " ");
	//				Если ПозицияПробела = 0 Тогда
	//					Сообщить("Не удалось найти серию диапазона марок №" + Сч + " партии """ + Партия + """!");
	//					Продолжить;
	//				КонецЕсли;	
	//				Серия    =  СокрЛП(Лев(ДиапазонМарок,ПозицияПробела - 1));
	//				Диапазон = СокрЛП(Сред(ДиапазонМарок,ПозицияПробела +1));
	//				ПозицияДефиса = Найти(Диапазон, "-");
	//				Если ПозицияДефиса = 0 Тогда
	//					Сообщить("Не удалось разобрать диапазон марок №" + Сч + " партии """ + Партия + """!");
	//					Продолжить;
	//				КонецЕсли;	
	//				НачальныйНомер =  СокрЛП(Лев(Диапазон,ПозицияДефиса - 1));
	//				КонечныйНомер  =  СокрЛП(Сред(Диапазон,ПозицияДефиса + 1));
	//				СтрокаМарок = ДокументОбъект.Марки.Добавить();
	//				СтрокаМарок.ИдентификаторМарок = ИдМарок;
	//				СтрокаМарок. Серия =  Серия;
	//				СтрокаМарок. НачальныйНомер = НачальныйНомер;
	//				СтрокаМарок.КонечныйНомер = КонечныйНомер;
	//			КонецЦикла;
	//			
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПоступлениеТоваров()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ОбработкаЗаполненияПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ОбработкаЗаполненияПоУмолчанию(ЭтотОбъект);
	Марки.Очистить();
	Для Каждого ТекущаяСтрока Из Товары Цикл
		ТекущаяСтрока.Справка2 = Справочники.Справки2ЕГАИС.ПустаяСсылка();
		ТекущаяСтрока.Справка1 = Справочники.Справки1ЕГАИС.ПустаяСсылка();
	КонецЦикла;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ЗаписатьСоответствиеНоменклатуры(Товары,,Ложь);
	
	Если ПустаяСтрока(Идентификатор) Тогда
		Идентификатор = СокрЛП(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаВвоза) Тогда
		ДатаВвоза = ДатаГТД;
	КонецЕсли;
	
	Если НЕ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.АлкогольнаяПродукция.ВидПродукции) И (НЕ ТекущаяСтрока.АлкогольнаяПродукция.ВидПродукции.Маркируемый) Тогда
			Продолжить;
		КонецЕсли;
		
		МаркиСтроки = Марки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтроки));
		КоличествоМарок = МаркиСтроки.Количество();
		//КоличествоТовара = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
		КоличествоТовара = ТекущаяСтрока.Количество;
		
		Если КоличествоТовара = КоличествоМарок Тогда
			Продолжить;
		КонецЕсли;
		
		Если КоличествоТовара > КоличествоМарок Тогда
			ТекстСравнения = НСтр("ru = 'меньше'");
		Иначе
			ТекстСравнения = НСтр("ru = 'больше'");
		КонецЕсли;
		
		ВывестиСообщение(НСтр("ru = 'Товар'") + Символы.НПП + "["+СокрЛП(ТекущаяСтрока.Номенклатура.Код)+"] "+СокрЛП(ТекущаяСтрока.Номенклатура) 
								+ НСтр("ru = ': Отсканированных марок %1 чем по накладной: Количество товара %2 количество марок %3'"),
								ЭтотОбъект,,,Отказ, ТекстСравнения, КоличествоТовара, КоличествоМарок);
		
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ЗаписатьСтатусДокументаЕГАИСПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.ОтчетОбИмпортеПродукцииЕГАИС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РегистрыНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.ЗаписатьТаблицуДвижений(ДополнительныеСвойства.ТаблицыДляДвижений.ОстаткиАлкогольнойПродукцииЕГАИС, Движения, Отказ);
	//РегистрыНакопления.ОстаткиВТорговомЗалеЕГАИС.ЗаписатьТаблицуДвижений(ДополнительныеСвойства.ТаблицыДляДвижений.ОстаткиАлкогольнойПродукцииЕГАИС, Движения, Отказ);
	РегистрыНакопления.ОстаткиМарокЕГАИС.ЗаписатьТаблицуДвижений(ДополнительныеСвойства.ТаблицыДляДвижений.ОстаткиМарокЕГАИС, Движения, Отказ);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры // ОбработкаПроведения()


#Область Инициализация

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецОбласти

#КонецЕсли
