
#Область ОбработкаСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Настройка табличного документа
	ДанныеИмпорта.Область(1, 1).Текст = "Мастер ключ торговой точки";
	ДанныеИмпорта.Область(1, 1).ШиринаКолонки = 60;
	ДанныеИмпорта.Область(1, 1).Шрифт = Новый Шрифт(,, Истина);
	
	ДанныеИмпорта.Область(1, 2).Текст = "Количество";
	ДанныеИмпорта.Область(1, 2).ШиринаКолонки = 15;
	ДанныеИмпорта.Область(1, 2).Шрифт = Новый Шрифт(,, Истина);
	
	ДанныеИмпорта.Область(1, 3).Текст = "Цена";
	ДанныеИмпорта.Область(1, 3).ШиринаКолонки = 15;
	ДанныеИмпорта.Область(1, 3).Шрифт = Новый Шрифт(,, Истина);
	
	ДанныеИмпорта.Область(1, 4).Текст = "Сумма";
	ДанныеИмпорта.Область(1, 4).ШиринаКолонки = 15;
	ДанныеИмпорта.Область(1, 4).Шрифт = Новый Шрифт(,, Истина);
	
	ДанныеИмпорта.Область(1, 5).Текст = "Статус";
	ДанныеИмпорта.Область(1, 5).ШиринаКолонки = 60;
	ДанныеИмпорта.Область(1, 5).Шрифт = Новый Шрифт(,, Истина);
	
	// Заполнение данных документа
	ПериодПлана = Параметры.ПериодПлана;
	
	Для Каждого СтрокаПланаПродаж Из Параметры.ПланПродаж Цикл 
		СтрокаДанныхДокумента = ДанныеДокумента.Добавить();
		СтрокаДанныхДокумента.ТорговаяТочка = СтрокаПланаПродаж.ТорговаяТочка; 
		СтрокаДанныхДокумента.Количество = СтрокаПланаПродаж.Количество;
		СтрокаДанныхДокумента.Цена = СтрокаПланаПродаж.ЦенаКон;
		СтрокаДанныхДокумента.Сумма = СтрокаПланаПродаж.Сумма;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура ОбработатьДанные(Команда)
	
	ОбработатьДанныеСервер();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИмпорт(Команда)
	
	Если ДанныеКорректны() Тогда 
		Закрыть(ДанныеДокумента);
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьДанныеСервер()
	
	Для НомерСтроки = 2 По ДанныеИмпорта.ВысотаТаблицы Цикл 
		МастерКлючТорговойТочки = СокрЛП(ДанныеИмпорта.Область(НомерСтроки, 1).Текст);
		ТорговаяТочка = НайтиТорговуюТочку("ЕРПМастерКлюч", МастерКлючТорговойТочки, НомерСтроки);
		
		Если ТорговаяТочка = Неопределено Тогда 
			Продолжить;
		КонецЕсли;	
		
		Количество = ПолчитьЧисло("Количество", НомерСтроки, 2);
		Цена = ПолчитьЧисло("Цена", НомерСтроки, 3);
		Сумма = ПолчитьЧисло("Сумма", НомерСтроки, 4);
		
		СтрокиДанныхДокумента = ДанныеДокумента.НайтиСтроки(Новый Структура("ТорговаяТочка", ТорговаяТочка)); 
		
		Если СтрокиДанныхДокумента.Количество() = 0 Тогда 
			СтрокаДанныхДокумента = ДанныеДокумента.Добавить();
			СтрокаДанныхДокумента.ТорговаяТочка = ТорговаяТочка;
			//ДополнитьСтатус(НомерСтроки, "Торговая точка отсутствует в данных документа");
			//Продолжить;
		Иначе
			СтрокаДанныхДокумента = СтрокиДанныхДокумента.Получить(0);	
		КонецЕсли;
		
		// Определение цены
		Если Цена = 0 Тогда 
			Если СтрокаДанныхДокумента.Цена = 0 Тогда 
				Цена = ОбщаяЦена;
			Иначе
				Цена = СтрокаДанныхДокумента.Цена;	
			КонецЕсли;	
		КонецЕсли;	
		
		// Количество
		Если Количество = 0
			И Сумма <> 0 Тогда 
			
			Количество = Сумма / Цена;
		КонецЕсли;	
		
		// Сумма
		Если Сумма = 0 
			И Количество <> 0 Тогда 
			Сумма = Количество * Цена;
		КонецЕсли;	
		
		СтрокаДанныхДокумента.Количество = Количество;
		СтрокаДанныхДокумента.Цена = Цена;
		СтрокаДанныхДокумента.Сумма = Сумма;
		
		ДополнитьСтатус(НомерСтроки, "Успешно", Ложь); 
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Функция НайтиТорговуюТочку(РеквизитПоиска, ЗначениеПоиска, НомерСтроки)

	СхемаЗапроса = SSL_IT_СхемыЗапросов.ПолучитьСхемуЗапроса(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИТ_ТорговыеТочки.Ссылка КАК ТорговаяТочка,
		|	ИТ_ТорговыеТочки.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ИТ_ТорговыеТочки");
	
	SSL_IT_СхемыЗапросов.ДобавитьУсловие(СтрШаблон("ИТ_ТорговыеТочки.%1 = &ЗначениеПоиска", РеквизитПоиска),,, СхемаЗапроса);
	Запрос = Новый Запрос(СхемаЗапроса.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("ЗначениеПоиска", ЗначениеПоиска);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаТорговойТочки = РезультатЗапроса.Выбрать();
	
	Если ВыборкаТорговойТочки.Следующий() Тогда 
		Если ВыборкаТорговойТочки.ПометкаУдаления Тогда 
			ДополнитьСтатус(НомерСтроки, "Торговая точка помечена на удаление");
		КонецЕсли;	
		
		ТорговаяТочка = ВыборкаТорговойТочки.ТорговаяТочка;
	Иначе
		ДополнитьСтатус(НомерСтроки, "Торговая точка не найдена");
		ТорговаяТочка = Неопределено;	
	КонецЕсли;	
	
	// Возврат
	Возврат ТорговаяТочка;
	
КонецФункции	

&НаСервере
Функция ПолчитьЧисло(ИмяПоля, НомерСтроки, НомерСтолбца)
	
	СтрокаЧисла = СокрЛП(ДанныеИмпорта.Область(НомерСтроки, НомерСтолбца).Текст);
	СтрокаЧисла = СтрЗаменить(СтрокаЧисла, " ", "");
	СтрокаЧисла = СтрЗаменить(СтрокаЧисла, Символы.НПП, "");
	
	Если ПустаяСтрока(СтрокаЧисла) Тогда 
		СтрокаЧисла = "0";
	КонецЕсли;	
	
	Попытка 
		Возврат Число(СтрокаЧисла);
	Исключение
		ДополнитьСтатус(НомерСтроки, СтрШаблон("Не удалось определить число поля %1", ИмяПоля));		
		Возврат 0;	
	КонецПопытки;
	
КонецФункции	

&НаСервере
Процедура ДополнитьСтатус(НомерСтроки, Текст, ЭтоОшибка = Истина)
	
	КрайнийСтолбец = 5;
	ОбластьСтатуса = ДанныеИмпорта.Область(НомерСтроки, КрайнийСтолбец);
	ТекстСтатуса = СокрЛП(ОбластьСтатуса.Текст); 
	
	Если ПустаяСтрока(ТекстСтатуса) Тогда 
		ОбластьСтатуса.Текст = Текст;
	Иначе
		ОбластьСтатуса.Текст = ОбластьСтатуса.Текст + "; " + Текст;
		ЭтоОшибка = Истина;	
	КонецЕсли;	
	
	Если ЭтоОшибка Тогда 
		ДанныеИмпорта.Область(НомерСтроки, 1, НомерСтроки, КрайнийСтолбец).ЦветФона = Новый Цвет(255, 0, 0);
	Иначе
		ДанныеИмпорта.Область(НомерСтроки, 1, НомерСтроки, КрайнийСтолбец).ЦветФона = Новый Цвет(0, 255, 0);			
	КонецЕсли;	
		
КонецПроцедуры	

&НаСервере
Функция ДанныеКорректны()
	
	ДанныеКорректны = Истина;
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТаблицаТорговыхТочек.ТорговаяТочка КАК Справочник.ПодразделенияКомпании) КАК ТорговаяТочка,
		|	1 КАК Количество
		|ПОМЕСТИТЬ ТаблицаТорговыхТочек
		|ИЗ
		|	&ТаблицаТорговыхТочек КАК ТаблицаТорговыхТочек
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТорговыхТочек.ТорговаяТочка.Наименование КАК НаименованиеТорговойТочки
		|ИЗ
		|	ТаблицаТорговыхТочек КАК ТаблицаТорговыхТочек
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаТорговыхТочек.ТорговаяТочка.Наименование
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТаблицаТорговыхТочек.Количество) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТорговыхТочек.ТорговаяТочка.Наименование КАК НаименованиеТорговойТочки
		|ИЗ
		|	ТаблицаТорговыхТочек КАК ТаблицаТорговыхТочек
		|ГДЕ
		|	(ТаблицаТорговыхТочек.ТорговаяТочка.ит_ДатаОткрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ТаблицаТорговыхТочек.ТорговаяТочка.ит_ДатаОткрытия > &ПериодПлана_КонецМесяца
		|			ИЛИ ТаблицаТорговыхТочек.ТорговаяТочка.ит_ДатаЗакрытия <> ДАТАВРЕМЯ(1, 1, 1)
		|				И ТаблицаТорговыхТочек.ТорговаяТочка.ит_ДатаЗакрытия < &ПериодПлана_НачалоМесяца)");
	
	Запрос.УстановитьПараметр("ТаблицаТорговыхТочек", ДанныеДокумента.Выгрузить(, "ТорговаяТочка"));
	Запрос.УстановитьПараметр("ПериодПлана_НачалоМесяца", НачалоМесяца(ПериодПлана));
	Запрос.УстановитьПараметр("ПериодПлана_КонецМесяца", КонецМесяца(ПериодПлана));	
			
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ДублиТорговыхТочек = РезультатЗапроса.Получить(1).Выбрать();
	ЗакрытыеТорговыеТочки = РезультатЗапроса.Получить(2).Выбрать();
	МассивСообщений = Новый Массив();
	
	// Дубли
	МассивСообщений.Добавить("Удалите дубли по торговым точкам:");
	Пока ДублиТорговыхТочек.Следующий() Цикл 
		МассивСообщений.Добавить(СтрШаблон("	%1", ДублиТорговыхТочек.НаименованиеТорговойТочки));
	КонецЦикла;
	ВывестиМассивСообщений(МассивСообщений, ДанныеКорректны);
	
	// Закрытые
	МассивСообщений.Добавить(СтрШаблон("Удалите закрытые или не открытые точки на период %1:", Формат(ПериодПлана, "ДФ='ММММ гггг'")));
	Пока ЗакрытыеТорговыеТочки.Следующий() Цикл
		МассивСообщений.Добавить(СтрШаблон("	%1", ЗакрытыеТорговыеТочки.НаименованиеТорговойТочки));	
	КонецЦикла;	
	ВывестиМассивСообщений(МассивСообщений, ДанныеКорректны);
	
	// Возврат 
	Возврат ДанныеКорректны;
	
КонецФункции	

&НаСервере
Процедура ВывестиМассивСообщений(МассивСообщений, ДанныеКорректны)
	
	Если МассивСообщений.Количество() > 1 Тогда 
		ДанныеКорректны = Ложь;	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСоединить(МассивСообщений, Символы.ПС));
	КонецЕсли;	
	
	МассивСообщений.Очистить();
	
КонецПроцедуры	

#КонецОбласти