// Модуль менеджера регистра сведений "Клиентские токены СУЗ"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьПараметрыТокенов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	РегистрСведенийТокеныМаркировки.Организация,
	|	РегистрСведенийТокеныМаркировки.ПодразделениеКомпании,
	|	РегистрСведенийТокеныМаркировки.ТипТокена,
	|	РегистрСведенийТокеныМаркировки.ИдентификаторСоединения,
	|	ВЫБОР
	|		КОГДА РегистрСведенийТокеныМаркировкиДубль.ТипТокена ЕСТЬ NULL ТОГДА
	|			ЛОЖЬ
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ КАК ЕстьДубль
	|ИЗ
	|	РегистрСведений.ТокеныМаркировки КАК РегистрСведенийТокеныМаркировки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ТокеныМаркировки КАК РегистрСведенийТокеныМаркировкиДубль
	|ПО
	|	РегистрСведенийТокеныМаркировки.Организация = РегистрСведенийТокеныМаркировкиДубль.Организация И 
	|	РегистрСведенийТокеныМаркировки.ИдентификаторСоединения = РегистрСведенийТокеныМаркировкиДубль.ИдентификаторСоединения И 
	|	(НЕ РегистрСведенийТокеныМаркировки.ТипТокена = РегистрСведенийТокеныМаркировкиДубль.ТипТокена)
	|ГДЕ
	|	РегистрСведенийТокеныМаркировки.ТипТокена = ЗНАЧЕНИЕ(Перечисление.ТипыТокеновАвторизации.ПустаяСсылка)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ТокеныМаркировки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Организация = Выборка.Организация;
		МенеджерЗаписи.ПодразделениеКомпании = Выборка.ПодразделениеКомпании;
		МенеджерЗаписи.ТипТокена = Выборка.ТипТокена;
		МенеджерЗаписи.ИдентификаторСоединения = Выборка.ИдентификаторСоединения;
		
		Если Выборка.ЕстьДубль Тогда
			МенеджерЗаписи.Удалить();
		Иначе
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.Организация = Выборка.Организация;
			МенеджерЗаписи.ПодразделениеКомпании = Выборка.ПодразделениеКомпании;
			МенеджерЗаписи.ИдентификаторСоединения = Выборка.ИдентификаторСоединения;
			Если ПустаяСтрока(Выборка.ИдентификаторСоединения) Тогда
				МенеджерЗаписи.ТипТокена = Перечисления.ТипыТокеновАвторизации.Маркировка;
			Иначе
				МенеджерЗаписи.ТипТокена = Перечисления.ТипыТокеновАвторизации.СУЗ;
			КонецЕсли;
			МенеджерЗаписи.СрокДействия = ТекущаяУниверсальнаяДата()-86400;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ПараметрыОбработкиРеквизитовОбъекта

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты регистра
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов.
//  Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

#КонецОбласти

#Область Печать

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Стандартные команды печати
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Обработчик печати документа
//
// Параметры:
//  МассивОбъектов         - Массив           - массив объектов для формирования печатных форм
//  ПараметрыПечати        - Структура        - дополнительные параметры печати
//  КоллекцияПечатныхФорм  - Таблица значений - таблица с идентификаторами печатных форм и макетами печати
//  ОбъектыПечати          - Структура        - список областей печатной формы в разрезе документов
//  ПараметрыВывода        - Структура        - дополнительные параметры вывода формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Обработчики печати
	
КонецПроцедуры // Печать()

#КонецОбласти

#КонецОбласти

#КонецЕсли