
#Область ПрограммныйИнтерфейс

// Процедура формирует отчет-расшифровку, по описанию, подготовленному соответствующей функцией клиентского модуля.
//
// Параметры:
//		Форма - Форма - форма, в которой расположен отчет
//		ИмяРеквизитаФормы - Строка - имя реквизита формы типа ОтчетОбъект
//		ОписаниеОбработкиРасшифровки - ОписаниеОбработкиРасшифровкиКомпоновкиДанных - значение,
//										сформированное соответствующей клиентской функцией.
//
Процедура ОбработатьРасшифровку(Форма, ИмяРеквизитаФормы, ОписаниеОбработкиРасшифровки) Экспорт
	ОтчетОбъект = Форма.РеквизитФормыВЗначение(ИмяРеквизитаФормы);
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(Форма["АдресДанныхРасшифровки" + ИмяРеквизитаФормы]);
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Форма["АдресСхемы" + ИмяРеквизитаФормы]);
	
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, ИсточникДоступныхНастроек);
	
	РезультирующиеНастройки = ОбработкаРасшифровки.ПрименитьНастройки(ОписаниеОбработкиРасшифровки.Идентификатор, 
																	ОписаниеОбработкиРасшифровки.ПрименяемыеНастройки);
	
	ОтчетОбъект.КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);
	ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(РезультирующиеНастройки);
	
	// Получить таблицу для вывода отчета.
	ТаблицаРезультатаОтчета = Форма["Таблица" + ИмяРеквизитаФормы];
	ТаблицаРезультатаОтчета.Очистить();
	
	// Вывести отчет.
	ОтчетОбъект.СкомпоноватьРезультат(ТаблицаРезультатаОтчета, ДанныеРасшифровки);
	
	Форма["АдресДанныхРасшифровки" + ИмяРеквизитаФормы] = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, Новый УникальныйИдентификатор());
КонецПроцедуры

// Процедура формирует отчет, расположенный в форме настройками, которые сделал пользователь.
//
// Параметры:
//		Форма - Форма - форма, в которой расположен отчет
//		ИмяРеквизитаФормы - Строка - имя реквизита формы типа ОтчетОбъект
//		ИмяОтчета - Строка - имя формируемого отчета в метаданных
//		ИмяВариантаНастроек - Строка - имя варианта отчета в настройках отчета.
//
Процедура СформироватьОтчет(Форма, ИмяРеквизитаФормы, ИмяОтчета, ИмяВариантаНастроек) Экспорт
	Перем ДанныеРасшифровки;
	
	Если Не ПравоДоступа("Использование", Метаданные.Отчеты[ИмяОтчета]) Тогда
		Возврат;
	КонецЕсли;
	
	// При обновлении отчета применяются пользовательские настройки.
	
	ОтчетОбъект = Форма.РеквизитФормыВЗначение(ИмяРеквизитаФормы);		
	
	Форма["АдресСхемы" + ИмяРеквизитаФормы] = ПоместитьВоВременноеХранилище(ОтчетОбъект.СхемаКомпоновкиДанных, Форма.УникальныйИдентификатор);
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Форма["АдресСхемы" + ИмяРеквизитаФормы]);
	
	ОтчетОбъект.КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);
	ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки);
	
	// Вывести отчет.
	ТаблицаРезультатаОтчета = Форма["Таблица" + ИмяРеквизитаФормы];
	ТаблицаРезультатаОтчета.Очистить();
	
	ОтчетОбъект.СкомпоноватьРезультат(ТаблицаРезультатаОтчета, ДанныеРасшифровки);

	Форма["АдресДанныхРасшифровки" + ИмяРеквизитаФормы] = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, Новый УникальныйИдентификатор());
КонецПроцедуры

// Процедура инициализирует отчет, расположенный в форме настройками по умолчанию и устанавливает контекстные отборы.
//
// Параметры:
//		Форма - Форма - форма, в которой расположен отчет
//		ИмяРеквизитаФормы - Строка - имя реквизита формы типа ОтчетОбъект
//		ИмяОтчета - Строка - имя формируемого отчета в метаданных
//		ИмяВариантаНастроек - Строка - имя варианта отчета в настройках отчета
//		Отбор - Структура - структура отбора:
//				** ключ - имя отбора,
//				* значение - значение отбора.
//
Процедура УстановитьСтандартныеНастройки(Форма, ИмяРеквизитаФормы, ИмяОтчета, ИмяВариантаНастроек, Отбор) Экспорт
	Если Не ПравоДоступа("Использование", Метаданные.Отчеты[ИмяОтчета]) Тогда
		Возврат;
	КонецЕсли;
	
	ОтчетОбъект = Форма.РеквизитФормыВЗначение(ИмяРеквизитаФормы);		
	
	Форма["АдресСхемы" + ИмяРеквизитаФормы] = ПоместитьВоВременноеХранилище(ОтчетОбъект.СхемаКомпоновкиДанных, Форма.УникальныйИдентификатор);
	
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Форма["АдресСхемы" + ИмяРеквизитаФормы]);
	
	ОтчетОбъект.КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);
	
	НастройкиКомпоновкиДанных = ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек[ИмяВариантаНастроек].Настройки;
	ОтчетОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
	
	Для Каждого Элемент Из Отбор Цикл
		ЭлементОтбора = ОтчетОбъект.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элемент.Ключ);
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Элемент.Значение;
		ЭлементОтбора.Использование = Истина;
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Постобработка отчетов

// Процедура изменяет настройки диаграмм и их элементов в части оформления 
// Параметры оформления (поддерживаемые) могут использовать независимо.
//
// Параметры:
//		КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - настройки отчета
//		ТабличныйДокумент - ТабличныйДокумент - результат вывода отчета
//		ПараметрыДиаграмм - Структура - Структура изменяемых параметров диаграмм
//			Поддерживаемые параметры:
//				МаксимумСерийКоличество - Число - больше 0, определяет количество выводимых серий диаграммы,
//												  "лишние" серии объединяются в сводную серию.
//					Значение 999 используется для снятия ограничения и вывода всех серий.
//				МаксимумСерийПроцент - Число - 0 - 100%, , определяет количество выводимых серий диаграммы,
//												  "лишние" серии объединяются в сводную серию.
//					Значение 999 используется для снятия ограничения и вывода всех серий.
//				ТипДиаграммы - Строка - название типа диаграммы, как оно задано в конфигураторе
//				ВыделениеСерийДиаграмм - Число - "0" - не выделять,
//												 "1" - выделять первую серию,
//												 "2" - Выделять отслеживаемые аналитики.
//				ГрадиентСерийДиаграмм - Булево - включает/отключает режима градиента цветом серий данных.
//
Процедура ОформитьДиаграммыОтчета(КомпоновщикНастроек, ТабличныйДокумент, ПараметрыДиаграмм = Неопределено) Экспорт
	Для Каждого Рисунок Из ТабличныйДокумент.Рисунки Цикл
		ОбъектРисунка = Рисунок.Объект;
		Если ТипЗнч(ОбъектРисунка) = Тип("Диаграмма") Тогда
			Рисунок.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная);
			Рисунок.ЦветЛинии = ЦветаСтиля.ЦветРамки;
			
			УстановитьОформлениеПоУмолчаниюДиаграммы(ОбъектРисунка, ПараметрыДиаграмм);
		КонецЕсли;
	КонецЦикла;
	
	УдалитьПараметрыОформленияДиаграмм(КомпоновщикНастроек, ТабличныйДокумент, ПараметрыДиаграмм);
КонецПроцедуры

// Процедура удаляет строки с неиспользуемыми параметрами из секции параметров отчета.
//
// Параметры:
//		ТабличныйДокумент - ТабличныйДокумент - результат вывода отчета
//		НеиспользуемыеПараметрыОтчета - Массив - представления неиспользуемых параметров отчета.
//
Процедура СкрытьНеиспользуемыеПараметрыОтчета(ТабличныйДокумент, НеиспользуемыеПараметрыОтчета) Экспорт
	Для Каждого НеиспользуемыйПараметрОтчета Из НеиспользуемыеПараметрыОтчета Цикл 
		НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(НеиспользуемыйПараметрОтчета);
		Если НайденнаяОбласть <> Неопределено Тогда
			УдаляемаяОбласть = ТабличныйДокумент.Область(НайденнаяОбласть.Верх,, НайденнаяОбласть.Низ);
			ТабличныйДокумент.УдалитьОбласть(УдаляемаяОбласть, ТипСмещенияТабличногоДокумента.ПоВертикали);
			
			Если ТабличныйДокумент.ФиксацияСверху <> 0 Тогда
				ТабличныйДокумент.ФиксацияСверху = ТабличныйДокумент.ФиксацияСверху - 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Настройки отчетов

// Процедура устанавливает все связанные параметры валюты отчета
//
// Параметры:
//		КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - настройки отчета
//		ПользовательскиеНастройкиМодифицированы - Булево - обязательный к установке признак
//															модификации пользовательских настроек отчета.
//
Процедура УстановитьПараметрыВалютыОтчета(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы) Экспорт
	ПараметрДанныеОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ДанныеОтчета");
	Если ПараметрДанныеОтчета <> Неопределено Тогда
		ВалютаУправленческогоУчета = "Руб.";
		ВалютаРегламентированногоУчета = "Руб.";
	
		Если Не ЗначениеЗаполнено(ПараметрДанныеОтчета.Значение) Тогда
			КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ДанныеОтчета", 1);
			
			ПользовательскиеНастройкиМодифицированы = Истина;
		КонецЕсли;
		
		ПараметрВалюта = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Валюта");
		Если ПараметрВалюта <> Неопределено Тогда
			Если ПараметрДанныеОтчета.Значение = 1
				ИЛИ ПараметрДанныеОтчета.Значение = 2 Тогда
				КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Валюта", ВалютаУправленческогоУчета);
			ИначеЕсли ПараметрДанныеОтчета.Значение = 3 Тогда
				КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Валюта", ВалютаРегламентированногоУчета);
			КонецЕсли;
				
			ПользовательскиеНастройкиМодифицированы = Истина;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

// Процедура устанавливает формулу расчета и формат динамического периода
//
// Параметры:
//		СхемаКомпоновкиДанных - СхемаКомпоновкиДанных - СКД отчета
//		КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - настройки отчета
//		ДополнятьПериод - Булево - признак использования дополнения периода.
//
Процедура НастроитьДинамическийПериод(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДополнятьПериод = Ложь) Экспорт 
	ПараметрПериодичность = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Периодичность");
	Если ПараметрПериодичность <> Неопределено 
		И КомпоновкаДанныхКлиентСервер.ПолеИспользуется(КомпоновщикНастроек, Новый ПолеКомпоновкиДанных("ДинамическийПериод")) Тогда
		ИскомоеПоле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ДинамическийПериод");
		Если ИскомоеПоле <> Неопределено Тогда
			СтрокаДлительностьПериода = ОбщегоНазначения.ИмяЗначенияПеречисления(ПараметрПериодичность.Значение);
			ИскомоеПоле.Выражение = "Период" + СтрокаДлительностьПериода;
			
			ПараметрОформленияФормат = ИскомоеПоле.Оформление.Элементы.Найти("Формат");
			ПараметрОформленияФормат.Значение = ФорматнаяСтрокаПериодовКомпоновкиДанных(ПараметрПериодичность.Значение);
			ПараметрОформленияФормат.Использование = Истина;
			
			Если ДополнятьПериод Тогда				
				ДополнениеПериода = ТипДополненияПериодаКомпоновкиДанных[СтрокаДлительностьПериода];
				ПараметрПериод = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период");
				Если ПараметрПериод <> Неопределено Тогда
					ПолеДинамическийПериод = Новый ПолеКомпоновкиДанных("ДинамическийПериод");
					Группировки = КомпоновкаДанныхКлиентСервер.ПолучитьГруппировки(КомпоновщикНастроек);
					Для Каждого Группировка Из Группировки Цикл
						Если Группировка.Значение.ПоляГруппировки.Элементы.Количество() = 1
							И Группировка.Значение.ПоляГруппировки.Элементы[0].Поле = ПолеДинамическийПериод Тогда
							ГруппировкаДинамическийПериод = Группировка.Значение.ПоляГруппировки.Элементы[0];
							ГруппировкаДинамическийПериод.ТипДополнения = ДополнениеПериода;
							ГруппировкаДинамическийПериод.НачалоПериода = ПараметрПериод.Значение.ДатаНачала;
							ГруппировкаДинамическийПериод.КонецПериода = ПараметрПериод.Значение.ДатаОкончания;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Методы и выражения системы компоновки данных

// Функция - Место в порядке
//
// Параметры:
//  ДанныеГрупповойОбработкиКомпоновкиДанных - ДанныеГрупповойОбработкиКомпоновкиДанных - Содержит результат
//     																						выполнения функции языка выражений системы компоновки данных ГрупповаяОбработка.
//  ПорядокСортировки - Строка - направление сортировки.
Функция МестоВПорядке(ДанныеГрупповойОбработкиКомпоновкиДанных, ПорядокСортировки) Экспорт
	МестоВПорядке = 0;
	
	Данные			= ДанныеГрупповойОбработкиКомпоновкиДанных.Данные;
	ИмяПоля			= ДанныеГрупповойОбработкиКомпоновкиДанных.Данные.Колонки[0].Имя;
	
	Если ДанныеГрупповойОбработкиКомпоновкиДанных.ТекущийЭлемент <> Неопределено Тогда
		ЗначениеПоля	= ДанныеГрупповойОбработкиКомпоновкиДанных.ТекущийЭлемент[0];
		
		Если ЗначениеПоля = 0 Тогда
			Возврат	"<>";
		КонецЕсли;
		
		КопияДанных = Данные.Скопировать();
		КопияДанных.Сортировать(ИмяПоля + " " + ПорядокСортировки);
		
		ИскомаяСтрока = КопияДанных.Найти(ЗначениеПоля, ИмяПоля);
		
		Если ИскомаяСтрока <> Неопределено Тогда
			МестоВПорядке = КопияДанных.Индекс(ИскомаяСтрока) + 1;
		КонецЕсли;
	КонецЕсли;
	
	Возврат МестоВПорядке;
КонецФункции

// Находит среди элементов полей СКД поле по полному имени
//
// Параметры:
//	Элементы - ДоступныеПоляКомпоновкиДанных - поля СКД
//	ПолноеИмя - Строка, ПолеКомпоновкиДанных - полное имя поля СКД.
//
// Возвращаемое значение:
//	Поле - ПолеКомпоновкиДанных - поле СКД
//
Функция НайтиПолеСКДПоПолномуИмени(Элементы, ПолноеИмя, Кэш = Неопределено) Экспорт
	
	Если Кэш <> Неопределено Тогда
		Поле = Кэш.Получить(ПолноеИмя);
		Если Поле <> Неопределено Тогда
			Возврат Поле;
		КонецЕсли;
	КонецЕсли;
	
	МассивЧастейИмен = ИзПолногоИмениПоляПолучитьЧасти(ПолноеИмя);
	КоличествоЧастей = МассивЧастейИмен.Количество();
	
	ТекущееИмя = МассивЧастейИмен[0];
	Поле = НайтиПолеСКДПоИмени(Элементы, ТекущееИмя, Кэш);
	Если Поле = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Сч = 2 По КоличествоЧастей Цикл
		ТекущееИмя = ТекущееИмя +"." + МассивЧастейИмен[Сч-1];
		Поле = НайтиПолеСКДПоИмени(Поле.Элементы, ТекущееИмя, Кэш);
		Если Поле = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Если Кэш <> Неопределено Тогда
		Кэш.Вставить(ПолноеИмя, Поле);
	КонецЕсли;
	
	Возврат Поле;
	
КонецФункции

// Получает и возвращает запрос из переданного макета компоновки данных
//
// Параметры:
//  Макет - МакетКомпоновкиДанных -  макет компоновки данных, из которого требуется получить запрос.
//  ИмяНабораДанных - Строка - имя набора данных из макета, для которого получается запрос.
//
// Возвращаемое значение:
//  Запрос - запрос, сформированный на основании макета компоновки.
//
Функция ПолучитьЗапросИзМакетаКомпоновки(Макет, ИмяНабораДанных) Экспорт

	Запрос = Новый Запрос(Макет.НаборыДанных[ИмяНабораДанных].Запрос);

	Для Каждого Параметр Из Макет.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(Параметр.Имя, Параметр.Значение);
	КонецЦикла;

	Возврат Запрос;

КонецФункции

// Получает и возвращает макет компоновки данных для схемы компоновки
//
// Параметры:
//  СхемаКомпоновки - СхемаКомпоновкиДанных - схема компоновки данных, для которой получается макет компоновки
//  Настройки - НастройкиКомпоновкиДанных - настройки компоновки, применяемые к схеме.
//
// Возвращаемое значение:
//  МакетКомпоновкиДанных - созданный макет компоновки.
//
Функция ПолучитьМакетКомпоновки(СхемаКомпоновки, Настройки) Экспорт

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	Возврат КомпоновщикМакета.Выполнить(СхемаКомпоновки, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

КонецФункции

// Удаляет отбор из настроек и пользовательских настроек отчета
//
// Параметры:
//  КомпоновщикНастроек - КомпоновщикНастроек - настройки компоновщика.
//  ИмяЭлемента  - Строка - имя элемента, который будет удален.
//
Процедура УдалитьЭлементОтбораИзВсехНастроекОтчета(КомпоновщикНастроек, ИмяЭлемента) Экспорт
	
	Если ТипЗнч(КомпоновщикНастроек) <> Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Возврат
	КонецЕсли;
	
	ЭлементыОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(КомпоновщикНастроек.Настройки.Отбор, ИмяЭлемента);
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки;
		КомпоновщикНастроек.Настройки.Отбор.Элементы.Удалить(ЭлементОтбора);
		
		ЭлементПользовательскихНастроек = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
		Если ЭлементПользовательскихНастроек <> Неопределено Тогда
			КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Удалить(ИдентификаторПользовательскойНастройки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Удаляет параметр из пользовательских настроек отчета
//
// Параметры:
//  КомпоновщикНастроек - КомпоновщикНастроек -  настройки
//  ИмяПараметра  - Строка - имя параметра, который будет удален.
//
Процедура УдалитьПараметрИзПользовательскихНастроекОтчета(КомпоновщикНастроек, ИмяПараметра) Экспорт
	
	Если ТипЗнч(КомпоновщикНастроек) <> Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Возврат
	КонецЕсли;

	ЗначениеПоиска = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
	ЭлементыПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	ЭлементПараметрыДанных = ЭлементыПараметрыДанных.НайтиЗначениеПараметра(ЗначениеПоиска);
	Если ЭлементПараметрыДанных <> Неопределено Тогда
		ЭлементПараметрыДанных.ИдентификаторПользовательскойНастройки = "";
	КонецЕсли;
	
КонецПроцедуры

// Получает строковое описание выбранных параметров СКД
//
// Параметры: 
//  СхемаКомпоновкиДанных - СхемаКомпоновкиДанных -  схема компоновки данных
//  НастройкиКомпоновкиДанных - НастройкиКомпоновкиДанных - настройки компоновки данных.
//
// Возвращаемое значение:
//  Строка - описание параметров.
//
Функция ОписаниеПараметровНастройки(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных) Экспорт
	
	ОписаниеПараметров = "";
	Для Каждого ЗначениеПараметраНастроекКомпоновкиДанных Из НастройкиКомпоновкиДанных.ПараметрыДанных.Элементы Цикл
		
		ПараметрСКД = СхемаКомпоновкиДанных.Параметры.Найти(ЗначениеПараметраНастроекКомпоновкиДанных.Параметр);
		Если ПараметрСКД = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПараметрСКД.ОграничениеИспользования Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеПараметра = ЗначениеПараметраНастроекКомпоновкиДанных.Значение;
		ИмяПараметра = Строка(ПараметрСКД.Заголовок);
		
		
		ОписаниеПараметров = ?(ЗначениеЗаполнено(ОписаниеПараметров), ОписаниеПараметров, НСтр("ru = 'Параметры:'") + " ")
						   + ?(НЕ ЗначениеЗаполнено(ОписаниеПараметров), "", ", ")
						   + ИмяПараметра + " = " 
						   + ?(ЗначениеЗаполнено(ЗначениеПараметра), Строка(ЗначениеПараметра), НСтр("ru = '<не заполнен>'"));
	КонецЦикла;
	
	ОписаниеПараметров = ОписаниеПараметров + ?(ЗначениеЗаполнено(Строка(НастройкиКомпоновкиДанных.Отбор)),
												" " + НСтр("ru = 'Отбор:'") + " " + Строка(НастройкиКомпоновкиДанных.Отбор),
												"");
	
	Возврат ОписаниеПараметров;
	
КонецФункции

// Находит среди элементов полей СКД поле по имени.
//
// Параметры:
//	Элементы - НастройкиКомпоновкиДанных - поля СКД
//	Имя - Строка, ПолеКомпоновкиДанных - имя поля СКД
//	Кэш - Структура - Необязательный.
//
// Возвращаемое значение:
//	Поле - поле СКД
//
Функция НайтиПолеСКДПоИмени(Элементы, Имя, Кэш = Неопределено) Экспорт
	
	Если Кэш <> Неопределено Тогда
		Элемент = Кэш.Получить(Имя);
		Если Элемент <> Неопределено Тогда
			Возврат Элемент;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Элемент Из Элементы Цикл
		Если ВРЕГ(Строка(Элемент.Поле)) = ВРЕГ(Имя) Тогда
			
			Если Кэш <> Неопределено Тогда
				Кэш.Вставить(Имя, Элемент);
			КонецЕсли;
			
			Возврат Элемент;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает полное имя поля по частям
//
// Параметры:
//	ПолноеИмя - полное имя поля СКД.
//
// Возвращаемое значение:
//	МассивЧастей - массив, содержащий части полного имени.
//
Функция ИзПолногоИмениПоляПолучитьЧасти(ПолноеИмя)

	МассивЧастей = Новый Массив;
	ИмяДляОбработки = ПолноеИмя;
	
	Пока НЕ ПустаяСтрока(ИмяДляОбработки) Цикл
		Если Лев(ИмяДляОбработки, 1) = "[" Тогда
			
			Позиция = СтрНайти(ИмяДляОбработки, "]");
			Если Позиция = 0 Тогда
				МассивЧастей.Добавить(Сред(ИмяДляОбработки, 2));
				ИмяДляОбработки = "";
			Иначе
				МассивЧастей.Добавить(Сред(ИмяДляОбработки, 1, Позиция));
				ИмяДляОбработки = Сред(ИмяДляОбработки, Позиция + 2);
			КонецЕсли;
			
		Иначе
			
			Позиция = СтрНайти(ИмяДляОбработки, ".");
			Если Позиция = 0 Тогда
				МассивЧастей.Добавить(ИмяДляОбработки);
				ИмяДляОбработки = "";
			Иначе
				МассивЧастей.Добавить(Лев(ИмяДляОбработки, Позиция - 1));
				ИмяДляОбработки = Сред(ИмяДляОбработки, Позиция + 1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЧастей;

КонецФункции

Функция СтруктураСерийЦветов(СерииДиаграммы)
	СтруктураСерийЦветов = Новый Структура;
	СтруктураЦвета = Новый Структура("Красный, Зеленый, Синий", 0, 0, 0);

	Для Каждого СерияДиаграммы Из СерииДиаграммы Цикл
		СтруктураЦветаСерии = Новый Структура; 
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураЦветаСерии, СтруктураЦвета, Истина);
		
		ВидЦветаСерии = СерияДиаграммы.Цвет.Вид;
		Если ВидЦветаСерии = ВидЦвета.WebЦвет Тогда
			ПолучитьДанныеЦвета(СерияДиаграммы.Цвет,
								СтруктураЦветаСерии.Красный,
								СтруктураЦветаСерии.Зеленый,
								СтруктураЦветаСерии.Синий);
		ИначеЕсли ВидЦветаСерии = ВидЦвета.Абсолютный Тогда 
			СтруктураЦветаСерии.Красный = СерияДиаграммы.Цвет.Красный;
			СтруктураЦветаСерии.Зеленый = СерияДиаграммы.Цвет.Зеленый;
			СтруктураЦветаСерии.Синий = СерияДиаграммы.Цвет.Синий;
		КонецЕсли;
		
		ОписаниеЦвета = "Цвет_"
						+ Строка(СтруктураЦветаСерии.Красный)
						+ "_"
						+ Строка(СтруктураЦветаСерии.Зеленый)
						+ "_"
						+ Строка(СтруктураЦветаСерии.Синий);
		Если Не СтруктураСерийЦветов.Свойство(ОписаниеЦвета) Тогда
			СтруктураСерийЦветов.Вставить(ОписаниеЦвета, Новый Структура);
			
			СтруктураСерийЦветов[ОписаниеЦвета].Вставить("Серии", Новый Массив);
			СтруктураСерийЦветов[ОписаниеЦвета].Серии.Добавить(СерияДиаграммы);
			
			СтруктураСерийЦветов[ОписаниеЦвета].Вставить("Цвет", СтруктураЦветаСерии);
		Иначе
			СтруктураСерийЦветов[ОписаниеЦвета].Серии.Добавить(СерияДиаграммы);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураСерийЦветов;
КонецФункции

Процедура СформироватьГрадиентПоСериямЦветов(СтруктураСерийЦветов)
	Для Каждого СерияРазныхЦветов Из СтруктураСерийЦветов Цикл
		ОбрабатываемыеСерии = СерияРазныхЦветов.Значение.Серии;
		КоличествоСерий = ОбрабатываемыеСерии.Количество();
		
		Если КоличествоСерий = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		ЦветСерии = СерияРазныхЦветов.Значение.Цвет;
		
		Тон = 0; 
		Насыщенность = 0; 
		Светлота = 0;
		
		НомерСерии = 0;
		Для Каждого ОбрабатываемаяСерия Из ОбрабатываемыеСерии Цикл
			Если Тон + Насыщенность + Светлота = 0 Тогда
				RGBToHSV(ЦветСерии.Красный, 
					ЦветСерии.Зеленый, 
					ЦветСерии.Синий, 
					Тон, Насыщенность, Светлота);
			КонецЕсли;
			
			// Установим коэффициент 0.8, чтобы градиент не уходил в белый цвет
			ШагГрадиентаСветлоты = 0.8 * (100 - Светлота) / (КоличествоСерий - 1);
			
			// Насыщенность ограничивать не требуется
			ШагГрадиентаНасыщенности = (100 - ?(Насыщенность = 0, 100, Насыщенность)) / (КоличествоСерий - 1);
			
			НовыйКрасный = 0; 
			НовыйЗеленый = 0;
			НовыйСиний = 0;
			
			HSVToRGB(Тон, 
				Насыщенность + ШагГрадиентаНасыщенности * НомерСерии, 
				Светлота + ШагГрадиентаСветлоты * НомерСерии, 
				НовыйКрасный, НовыйЗеленый, НовыйСиний);
			
			НовыйЦветСерии = Новый Цвет(НовыйКрасный, НовыйЗеленый, НовыйСиний);
			
			ОбрабатываемаяСерия.Цвет = НовыйЦветСерии;
			
			НомерСерии = НомерСерии + 1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

// Устанавливает для переданной диаграммы стандартное оформление
// 
// Параметры:
//	Диаграмма - Диаграмма - изменяемая диаграмма
//	ПараметрыДиаграммы - Структура - структура параметров, соответствующих свойствам диаграммы.
//
Процедура УстановитьОформлениеПоУмолчаниюДиаграммы(Диаграмма, ПараметрыДиаграммы = Неопределено)
	// Оформление диаграммы
	ПараметрыДиаграммыПереданы = (ПараметрыДиаграммы <> Неопределено);
	
	Если ПараметрыДиаграммыПереданы Тогда
		ПараметрОтчет = Неопределено;
		ОтчетОбъектПередан = ПараметрыДиаграммы.Свойство("Отчет", ПараметрОтчет) 
			И ПараметрОтчет <> Неопределено;
		
		ПараметрРасширенноеОформлениеСерий = Ложь;
		ПараметрРасширенноеОформлениеСерий = ПараметрыДиаграммы.Свойство("РасширенноеОформлениеСерий", ПараметрРасширенноеОформлениеСерий)
			И ПараметрРасширенноеОформлениеСерий;
		
		ПараметрМаксимумСерий = 0;
		Если ПараметрыДиаграммы.Свойство("МаксимумСерийКоличество", ПараметрМаксимумСерий)
			И ПараметрМаксимумСерий > 0 И ПараметрМаксимумСерий <> 999 Тогда
			Диаграмма.МаксимумСерий = МаксимумСерий.Ограничено;
			Диаграмма.МаксимумСерийКоличество = ПараметрМаксимумСерий;
		ИначеЕсли ПараметрыДиаграммы.Свойство("МаксимумСерийПроцент", ПараметрМаксимумСерий)
			И ПараметрМаксимумСерий > 0 Тогда
			Диаграмма.МаксимумСерий = МаксимумСерий.Процент;
			Диаграмма.МаксимумСерийПроцент = ПараметрМаксимумСерий;
		ИначеЕсли ПараметрМаксимумСерий = 999 И ПараметрМаксимумСерий <> 999 Тогда
			Диаграмма.МаксимумСерий = МаксимумСерий.НеЗадано;
		КонецЕсли;
		
		ПараметрТипДиаграммы = Неопределено;
		Если ПараметрыДиаграммы.Свойство("ТипДиаграммы", ПараметрТипДиаграммы) Тогда
			Диаграмма.ТипДиаграммы = ТипДиаграммы[ПараметрТипДиаграммы];
		КонецЕсли;
	КонецЕсли;
	
	// Оформление области построения
	ОбластьПостроения = Диаграмма.ОбластьПостроения;
	ОбластьПостроения.ФорматШкалыЗначений = "ЧГ=3,0";
	
	// Оформление области легенды
	ОбластьЛегенды = Диаграмма.ОбластьЛегенды;
	ОбластьЛегенды.Прокрутка = Истина;
	
	// Оформление серий и точек
	СерииДиаграммы = Диаграмма.Серии;
	Для Каждого СерияДиаграммы Из СерииДиаграммы Цикл
		УстановитьОформлениеПоУмолчаниюСерии(СерияДиаграммы);
		
		// Оформим серии диаграммы по расширенному алгоритму отчета
		Если ПараметрыДиаграммыПереданы И ОтчетОбъектПередан И ПараметрРасширенноеОформлениеСерий Тогда
			ПараметрОтчет.УстановитьРасширенноеОформлениеСерии(СерияДиаграммы);
		КонецЕсли;
	КонецЦикла;
	
	Если ПараметрыДиаграммы <> Неопределено Тогда
		ПараметрВыделениеСерийДиаграмм = Неопределено;
		ПараметрГрадиентСерийДиаграмм = Ложь;
		Если ПараметрыДиаграммы.Свойство("ВыделениеСерийДиаграмм", ПараметрВыделениеСерийДиаграмм)
			И ПараметрВыделениеСерийДиаграмм <> 0 
			И ПараметрыДиаграммы.Свойство("ГрадиентСерийДиаграмм", ПараметрГрадиентСерийДиаграмм) 
			И ПараметрГрадиентСерийДиаграмм Тогда
			СтруктураСерийЦветов = СтруктураСерийЦветов(СерииДиаграммы);
			СформироватьГрадиентПоСериямЦветов(СтруктураСерийЦветов);
		КонецЕсли;
	КонецЕсли;	

	УстановитьОформлениеПоУмолчаниюСводнойСерии(Диаграмма.СводнаяСерия);
КонецПроцедуры

Процедура УстановитьОформлениеПоУмолчаниюСерии(Серия)
	// Устанавливаемые свойства серии
	Серия.Маркер = ТипМаркераДиаграммы.Нет;
КонецПроцедуры
 
Процедура УстановитьОформлениеПоУмолчаниюСводнойСерии(Серия)
	// Устанавливаемые свойства серии
	Серия.Маркер = ТипМаркераДиаграммы.Нет;
	Серия.Линия = Новый Линия(ТипЛинииДиаграммы.Сплошная, 3);
КонецПроцедуры

Процедура УдалитьПараметрыОформленияДиаграмм(КомпоновщикНастроек, ТабличныйДокумент, ПараметрыДиаграмм)
	
	// Параметры, обрабатываемые в коде
	Если ПараметрыДиаграмм <> Неопределено Тогда
		ДоступныеПараметры = КомпоновщикНастроек.Настройки.ПараметрыДанных.ДоступныеПараметры;
		
		Для Каждого ПараметрДиаграмм Из ПараметрыДиаграмм Цикл
			ПараметрДиаграмм = ОтчетыПлатформаКлиентСервер.ПолучитьДоступныйПараметр(ДоступныеПараметры, ПараметрДиаграмм.Ключ);
			
			Если ПараметрДиаграмм <> Неопределено Тогда
				НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПараметрДиаграмм.Заголовок);
				
				Если НайденнаяОбласть <> Неопределено Тогда
					УдаляемаяОбласть = ТабличныйДокумент.Область(НайденнаяОбласть.Верх,, НайденнаяОбласть.Низ);
					ТабличныйДокумент.УдалитьОбласть(УдаляемаяОбласть, ТипСмещенияТабличногоДокумента.ПоВертикали);
					
					Если ТабличныйДокумент.ФиксацияСверху <> 0 Тогда
						ТабличныйДокумент.ФиксацияСверху = ТабличныйДокумент.ФиксацияСверху - 1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

Функция ФорматнаяСтрокаПериодовКомпоновкиДанных(Периодичность)
	ФорматнаяСтрока = "";
	
	Если Периодичность = Перечисления.Периодичность.Неделя Тогда
		ФорматнаяСтрока = "Л=ru; ДФ='dd.MM.yyyy ""г.""'";
	ИначеЕсли Периодичность = Перечисления.Периодичность.Декада Тогда
		ФорматнаяСтрока = "Л=ru; ДФ='dd.MM.yyyy ""г.""'";
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		ФорматнаяСтрока = "Л=ru; ДФ='MMMM гггг ""г.""'";
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		ФорматнаяСтрока = "Л=ru; ДФ='к ""квартал"" гггг ""г.""'";
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		ФорматнаяСтрока = "Л=ru; ДФ='yyyy ""г.""'";
	КонецЕсли;
	
	Возврат ФорматнаяСтрока;
КонецФункции

// Возвращает компоненты цвета по модели RGB, по переданным Web-цвету
//
// Параметры:
//	Цвет - WebЦвет - системное перечисление
//	Красный - Число - возвращается значение от 0 до 255
//	Зеленый - Число - возвращается значение от 0 до 255
//	Синий - Число - возвращается значение от 0 до 255.
//
Процедура ПолучитьДанныеЦвета(Цвет, Красный, Зеленый, Синий)
	
	Красный = 0;
	Зеленый = 0;
	Синий = 0;
	
КонецПроцедуры

// Возвращает компоненты цвета по модели HSV, по переданным компонентам RGB
//
// Параметры:
//	Красный - Число - от 0 до 255
//	Зеленый - Число - от 0 до 255
//	Синий - Число - от 0 до 255
//	Тон - Число - возвращается значение от 0 до 360 (градусов)
//	Насыщенность - Число - возвращается значение от 0 до 100 (%)
//	Светлота - Число - возвращается значение от 0 до 100 (%).
//
Процедура RGBToHSV(Красный, Зеленый, Синий, Тон, Насыщенность, Светлота)
	
	ПриведенныйКрасный = Красный/255;
	ПриведенныйЗеленый = Зеленый/255;
	ПриведенныйСиний = Синий/255;
	
	// Определим светлоту
	МаксЦветов = Макс(ПриведенныйКрасный, ПриведенныйЗеленый, ПриведенныйСиний);	
	МинЦветов = Мин(ПриведенныйКрасный, ПриведенныйЗеленый, ПриведенныйСиний);
	
	Светлота = Окр(100 * МаксЦветов);
	
	// Определим насыщенность
	Если МаксЦветов = 0 Тогда 
		Насыщенность = 0;
		
	Иначе 
		Насыщенность = Окр(100 * (1 - МинЦветов/МаксЦветов));
		
	КонецЕсли;
	
	// Определим цветовой тон
	Если МаксЦветов = МинЦветов Тогда
		Тон = 0;
		
	ИначеЕсли МаксЦветов = ПриведенныйКрасный И ПриведенныйЗеленый >= ПриведенныйСиний Тогда
		Тон = 60*(ПриведенныйЗеленый - ПриведенныйСиний)/(МаксЦветов - МинЦветов);
		
	ИначеЕсли МаксЦветов = ПриведенныйКрасный И ПриведенныйЗеленый < ПриведенныйСиний Тогда
		Тон = 60*(ПриведенныйЗеленый - ПриведенныйСиний)/(МаксЦветов - МинЦветов) + 360;
		
	ИначеЕсли МаксЦветов = ПриведенныйЗеленый Тогда
		Тон = 60*(ПриведенныйСиний - ПриведенныйКрасный)/(МаксЦветов - МинЦветов) + 120;
		
	ИначеЕсли МаксЦветов = ПриведенныйСиний Тогда
		Тон = 60*(ПриведенныйКрасный - ПриведенныйЗеленый)/(МаксЦветов - МинЦветов) + 240;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает компоненты цвета по модели RGB, по переданным компонентам HSV
//
// Параметры:
//	Тон - Число - от 0 до 360 (градусов)
//	Насыщенность - Число - от 0 до 100 (%)
//	Светлота - Число - от 0 до 100 (%)
//	Красный - Число - возвращается значение от 0 до 255
//	Зеленый - Число - возвращается значение от 0 до 255
//	Синий - Число - возвращается значение от 0 до 255.
//
Процедура HSVToRGB(Тон, Насыщенность, Светлота, Красный, Зеленый, Синий)
	
	ПриведеннаяНасыщенность = Насыщенность/100;
	ПриведеннаяСветлота = Светлота/100;
	
	Целые60 = Цел(Тон/60);
	Остаток60 = Тон/60 - Целые60;
	
	ЦветПервый = ПриведеннаяСветлота * (1 - ПриведеннаяНасыщенность);
	ЦветВторой = ПриведеннаяСветлота * (1 - Остаток60 * ПриведеннаяНасыщенность);
	ЦветТретий = ПриведеннаяСветлота * (1 - (1 - Остаток60) * ПриведеннаяНасыщенность);
	
	Если Целые60 = 0 Тогда
		ПриведенныйКрасный = ПриведеннаяСветлота;
		ПриведенныйЗеленый = ЦветТретий;
		ПриведенныйСиний= ЦветПервый;
		
	ИначеЕсли Целые60 = 1 Тогда
		ПриведенныйКрасный = ЦветВторой;
		ПриведенныйЗеленый = ПриведеннаяСветлота;
		ПриведенныйСиний= ЦветПервый;
		
	ИначеЕсли Целые60 = 2 Тогда
		ПриведенныйКрасный = ЦветПервый;
		ПриведенныйЗеленый = ПриведеннаяСветлота;
		ПриведенныйСиний= ЦветТретий;
		
	ИначеЕсли Целые60 = 3 Тогда
		ПриведенныйКрасный = ЦветПервый;
		ПриведенныйЗеленый = ЦветВторой;
		ПриведенныйСиний= ПриведеннаяСветлота;
		
	ИначеЕсли Целые60 = 4 Тогда
		ПриведенныйКрасный = ЦветТретий;
		ПриведенныйЗеленый =ЦветПервый ;
		ПриведенныйСиний= ПриведеннаяСветлота;
		
	ИначеЕсли Целые60 = 5 Тогда
		ПриведенныйКрасный = ПриведеннаяСветлота;
		ПриведенныйЗеленый = ЦветПервый;
		ПриведенныйСиний= ЦветВторой;
		
	КонецЕсли;
	
	Красный = 255 * ПриведенныйКрасный;
	Зеленый = 255 * ПриведенныйЗеленый;
	Синий = 255 * ПриведенныйСиний;
	
КонецПроцедуры

#КонецОбласти

