#Область ПрограммныйИнтерфейс

#Область МодульОбъекта

// Переопределяемая процедура обработки заполнения.
// Вызывается из модуля объекта "КассовыйЧекКоррекции"
// 
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//  ДанныеЗаполнения - Данные заполнения, переданные при программном и интерфейсном вызоде процедуры
//  СтандартнаяОбработка - Булево, см. описание процедуры ОбработкаЗаполнения модуля документа
//
Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Объект, ДанныеЗаполнения);
	КонецЕсли;
	
	// +Рарус
	// Произведем инициализацию реквизитов, которые устанавливаются один раз при создании объекта.
	Если Объект.ЭтоНовый() Тогда
	Если (НЕ ЗначениеЗаполнено(Объект.Ответственный)) Тогда
			Объект.Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ПараметрыСеанса.Организация;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ПодразделениеКомпании) Тогда
		Объект.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		Объект.КассаККМ = Справочники.КассыККМ.ПолучитьОсновнуюКассуККМ();
	КонецЕсли;
	// -Рарус
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая перед записью.
// Вызывается из модуля объекта "КассовыйЧекКоррекции"
// 
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//  Отказ, РежимЗаписи, РежимПроведения - см. описание процедуры "ПередЗаписью" модуля документа
//
Процедура ПередЗаписью(Объект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	// +Рарус
	Если НЕ ЗначениеЗаполнено(Объект.ПодразделениеКомпании) Тогда
		ВывестиСообщение(Нстр("ru = 'Поле ""Подразделение"" не заполнено'"), Объект,,, Отказ);
	КонецЕсли;
	// -Рарус
	
КонецПроцедуры

// Переопределяемая процедура обработки проведения.
// Вызывается из модуля объекта "КассовыйЧекКоррекции"
// 
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//  Отказ, РежимПроведения - см. описание процедуры "ОбработкаПроведения" модуля документа
//
Процедура ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая при копировании.
// Вызывается из модуля объекта "КассовыйЧекКоррекции"
// 
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//  ОбъектКопирования - ДокументОбъект.КассовыйЧекКоррекции, копируемый документ
//
Процедура ПриКопировании(Объект, ОбъектКопирования) Экспорт
	
	Объект.НомерЧекаККМ   = 0;
	Объект.ПробитЧек      = Ложь;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ФормаДокумента

#Область ФормаДокументаОбработчикиСобытийФормы

// Переопределяемая процедура, вызываемая при создании.
// Вызывается из модуля формы документа "КассовыйЧекКоррекции"
// 
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//  Форма  - Форма документа КассовыйЧекКоррекции
//  Отказ, СтандартнаяОбработка - см. описание процедуры "ПриСозданииНаСервере" модуля формы документа
//
Процедура ПриСозданииНаСервере(Объект, Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	// +Рарус
	// Стандартные подсистемы - Версионирование объектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(Форма);
	ПодключаемыеКоманды.ПриСозданииНаСервере(Форма,Неопределено);
	
	Форма.ИспользоватьПодключаемоеОборудование = МенеджерОборудованияВызовСервераПереопределяемый.ИспользоватьПодключаемоеОборудование();
	// -Рарус
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая при чтении.
// Вызывается из модуля формы документа "КассовыйЧекКоррекции"
// 
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//  Форма  - Форма документа КассовыйЧекКоррекции
//  ТекущийОбъект - см. описание процедуры "ПриЧтенииНаСервере" модуля формы документа
//
Процедура ПриЧтенииНаСервере(Объект, Форма, ТекущийОбъект) Экспорт
	
	// +Рарус
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(Форма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(Форма, ТекущийОбъект);
	// -Рарус
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая перед записью на сервере.
// Вызывается из модуля формы документа "КассовыйЧекКоррекции"
// 
// Параметры:
//  Форма  - Форма документа КассовыйЧекКоррекции
//  Отказ, ТекущийОбъект, ПараметрыЗаписи - см. описание процедуры "ПередЗаписьюНаСервере" модуля формы документа
//
Процедура ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ФормаДокументаОбработчикиСобытийЭлементовШапки

// Переопределяемая процедура, вызываемая при изменении кассы ККМ.
// Вызывается из модуля формы документа "КассовыйЧекКоррекции"
// 
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//
Процедура КассаККМПриИзменении(Объект) Экспорт
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая при изменении основания для коррекции.
// Вызывается из модуля формы документа "КассовыйЧекКоррекции"
// 
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//
Процедура ОснованиеДляКоррекцииПриИзменении(Объект) Экспорт
	
	// +Рарус
	Если ТипЗнч(Объект.ОснованиеДляКоррекции) = Тип("ДокументСсылка.ЧекНаОплату") Тогда
		Объект.НомерДокументаОснования = Формат(Объект.ОснованиеДляКоррекции.НомерЧека, "ЧГ=0");
	Иначе
		Объект.НомерДокументаОснования = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ОснованиеДляКоррекции) 
		И НЕ ТипЗнч(Объект.ОснованиеДляКоррекции) = Тип("Строка") Тогда
		
		Объект.ДатаДокументаОснования = Объект.ОснованиеДляКоррекции.Дата;
		Объект.Организация = Объект.ОснованиеДляКоррекции.Организация;
		Объект.ПодразделениеКомпании = Объект.ОснованиеДляКоррекции.ПодразделениеКомпании;
		Объект.КассаККМ    = Объект.ОснованиеДляКоррекции.КассаККМ;
		Если НЕ ЗначениеЗаполнено(Объект.НомерДокументаОснования) Тогда
			Объект.НомерДокументаОснования = Объект.ОснованиеДляКоррекции.Номер;
		КонецЕсли;
	КонецЕсли;
	// -Рарус
	
КонецПроцедуры

#КонецОбласти

#Область ФормаДокументаСлужебныеПроцедурыИФункции

//Переопределяемая процедура устанавливает правила работы формы документа. 
//
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//  Форма  - Форма документа КассовыйЧекКоррекции
//
Процедура УстановитьДоступностьЭлементовИФормы(Объект, Форма) Экспорт
	
КонецПроцедуры

//Переопределяемая процедура проверяет возможность печати чека, при этом подготавливает информацию для печтати. 
//
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//  Отказ - Булево.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудовае, устройство фискализирующее чек
//  ИспользоватьКассуБезПодключенияОборудования - Булево.
//
Процедура ПодготовитьИПроверитьПечатьЧека(Объект,
										  Отказ, 
										  ИдентификаторУстройства, 
										  ИспользоватьКассуБезПодключенияОборудования)	Экспорт
	
	// +Рарус
	Если НЕ ЗначениеЗаполнено(Объект.ПодключаемоеОборудование) Тогда
		ВывестиСообщение(НСтр("ru = 'Не указано подключаемое оборудование.'"), Объект, "ПодключаемоеОборудование",, Отказ);
	КонецЕсли;
	
	// Выполним предварительные проверки перед печатью
	Если НЕ Объект.СуммаДокумента > 0 Тогда
		ВывестиСообщение(НСтр("ru = 'Не указана сумма к оплате'"), Объект, "СуммаДокумента",,Отказ);
	КонецЕсли;

	// Определим структуру параметров обработки текущего события	
	ИдентификаторУстройства = Объект.ПодключаемоеОборудование;
	ИспользоватьКассуБезПодключенияОборудования = НЕ ИдентификаторУстройства.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	// -Рарус	
	
КонецПроцедуры

// Переопределяемая процедура получает данные для отправки по кассиру (ответственному)
//
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//
Функция ПолучитьРеквизитыКассира(Объект) Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Наименование", "Кассир");
	СтруктураРеквизитов.Вставить("ИНН", Неопределено);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

// Переопределяемая процедура получает доступные системы налогообложения для организации.
//
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияБПО, Организация по которой получаеются системы налогообложения.
//  МассивСистемНалогообложения - Масссив элементов Перечисление.ТипыСистемНалогообложенияККТ.
//
Процедура ПолучитьДоступныеСистемыНалогообложения(Организация, МассивСистемНалогообложения, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
