
#Область ПрограммынйИнтерфейс

// Возвращает Истина, если в документе идет учет прослеживаемых товаров.
//
// Параметры:
//  Объект - ДокументСсылка - проверяемый объект.
//
// Возвращаемое значение:
//  Булево - Истина, если в документе идет учет прослеживаемых товаров.
//
Функция ЭтоДокументСПрослеживаемымиТоварами(Объект) Экспорт
	
	СписокДокументов = ДокументыСПрослеживаемымиТоварами();
	Возврат СписокДокументов.Найти(Объект.Метаданные()) <> Неопределено;
	
КонецФункции

// Заполняет служебные реквизиты для отображения прослеживаемых товаров
//
// Параметры:
//  Объект - ДанныеФормыСтруктура, ФормаКлиентскогоПриложения - Объект, в котором произошло событие.
//  ТекущаяСтрока - ДанныеФормыЭлементКоллекции - (необязательный). Обрабатываемая строка ТЧ.
//  ИмяТаблицы - Строка - (необязательный). Имя таблицы, содержащей заполняемые реквизиты.
//  ИмяРеквизита - Строка - (необязательный). Имя реквизита, содержащего признак,
//                           по которому заполняются служебные реквизиты.
//
Процедура ЗаполнитьСлужебныйРеквизитПрослеживаемогоТовара(
		Объект,
		ТекущаяСтрока = Неопределено,
		ИмяТаблицы = "Товары",
		ИмяРеквизита = "Номенклатура") Экспорт
	
	Если ТипЗнч(Объект) <> Тип("ФормаКлиентскогоПриложения") Тогда
		Если НЕ ЭтоДокументСПрослеживаемымиТоварами(Объект.Ссылка) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТаблицаТоваров = Объект[ИмяТаблицы];
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТабличнаяЧасть", ТаблицаТоваров.Выгрузить());
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ТабличнаяЧасть.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
		|	ВЫРАЗИТЬ(ТабличнаяЧасть."+ИмяРеквизита+" КАК Справочник.Номенклатура) КАК Номенклатура
		|ПОМЕСТИТЬ
		|	ТабличнаяЧасть
		|ИЗ
		|	&ТабличнаяЧасть КАК ТабличнаяЧасть
		|;
		|
		|ВЫБРАТЬ
		|	ТабличнаяЧасть.НомерСтроки-1 КАК ИндексСтроки,
		|	ТабНоменклатура.Прослеживаемый КАК Прослеживаемый
		|ИЗ
		|	ТабличнаяЧасть КАК ТабличнаяЧасть
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.Номенклатура КАК ТабНоменклатура
		|ПО
		|	ТабличнаяЧасть.Номенклатура = ТабНоменклатура.Ссылка
		|ГДЕ
		|	ТабНоменклатура.ЭтоГруппа = ЛОЖЬ
		|";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТаблицы = ТаблицаТоваров[Выборка.ИндексСтроки];
			СтрокаТаблицы.ПрослеживаемыйТовар = Выборка.Прослеживаемый;
		КонецЦикла;
		
	Иначе
		Если ЕстьРеквизит(ТекущаяСтрока[ИмяРеквизита], "Прослеживаемый") Тогда
			ТекущаяСтрока.ПрослеживаемыйТовар = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока[ИмяРеквизита], "Прослеживаемый");
		Иначе
			ТекущаяСтрока.ПрослеживаемыйТовар = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру имен реквизитов для вызова ЗаполнитьСлужебныйРеквизитПрослеживаемогоТовара()
//
// Возвращаемое значение:
//  Структура - Структура имен реквизитов:
//   * ИмяТаблицы - Строка - Имя таблицы, содержащей заполняемые реквизиты.
//   * ИмяРеквизита - Строка - Имя реквизита, содержащего признак, по которому заполняются служебные реквизиты.
//   * ИмяПризнака - Строка - Имя реквизита признак прослеживаемого товара.
//   * ИмяКартинки - Строка - Имя реквизита картинки прослеживаемого товара.
//
Функция ИменаРеквизитовДляЗаполнитьСлужебныйРеквизитПрослеживаемогоТовара() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяТаблицы", "Товары");
	Результат.Вставить("ИмяРеквизита", "Номенклатура");
	Результат.Вставить("ИмяПризнака", "ПрослеживаемыйТовар");
	Результат.Вставить("ИмяКартинки", "КартинкаПрослеживаемогоТовара");
	
	Возврат Результат;
	
КонецФункции

// Выполняет проверку заполнения реквизита ГТД / РНПТ для документов.
// Проверка выполняется с 1.07.2021. Для прослеживаемых товаров должно быть указано РНПТ.
// Выводит информационное сообщение, если для прослеживаемого товара указан ГТД, или
// для не прослеживаемого товара указан РНПТ.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура, ФормаКлиентскогоПриложения - Объект, в котором произошло событие.
//  ИмяТаблицыТоваров - Строка - (необязательный). Имя таблицы, содержащей проверяемые реквизиты.
//  ИмяРеквизита - Строка - (необязательный). Имя проверяемого реквизита.
//
Процедура ПроверитьЗаполнениеРНПТПрослеживаемогоТовара(
		Объект,
		ИмяТаблицыТоваров = "Товары",
		ИмяРеквизита = "Номенклатура") Экспорт
	
	Если НЕ ЕстьРеквизит(Объект, "ГТД", ИмяТаблицыТоваров) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Дата < Дата("20210701000000") Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка права для дальнейшего выполнения
	Если НЕ ПравоПользователя("ПроверкаЗаполненияСправочниковИДокументов") Тогда
		Возврат;
	КонецЕсли;

	// Проверим, что нет признака восстановления последовательностей.
	ЭтоВосстановлениеПоследовательностей = ПолучитьЗначениеПараметраСтруктуры(
		Объект.ДополнительныеСвойства,
		"ЭтоВосстановлениеПоследовательностей",
		Ложь);
	Если ЭтоВосстановлениеПоследовательностей Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Объект[ИмяТаблицыТоваров] Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ГТД) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЕстьРеквизит(ТекущаяСтрока[ИмяРеквизита], "Прослеживаемый") Тогда
			Продолжить;
		КонецЕсли;
		
		ПрослеживаемыйТовар = ТекущаяСтрока[ИмяРеквизита].Прослеживаемый;
		ЭтоРНПТ = ТекущаяСтрока.ГТД.РНПТ;
		ТекстСообщения = "";
		
		Если ПрослеживаемыйТовар И НЕ ЭтоРНПТ Тогда
			
			ТекстСообщения = НСтр("ru = 'В строке %1 табличной части ""%2"" у прослеживаемого товара указан номер ГТД вместо РНПТ'");
		
		ИначеЕсли НЕ ПрослеживаемыйТовар И ЭтоРНПТ Тогда
			ТекстСообщения = НСтр("ru = 'В строке %1 табличной части ""%2"" у товара указан номер РНПТ вместо номера ГТД'");
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
			ВывестиСообщение(
				ТекстСообщения,
				Объект,
				ИмяТаблицыТоваров + "[#].ГТД",
				ТекущаяСтрока.НомерСтроки,
				,
				ТекущаяСтрока.НомерСтроки,
				ИмяТаблицыТоваров
			);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Получение таблицы для заполнения данными об операции
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Структура таблицы для заполнения
//
Функция ИнициализацияТаблицыОпераций() Экспорт
	
	ТаблицаОперации = Новый ТаблицаЗначений;
	ТаблицаОперации.Колонки.Добавить("Организация");
	ТаблицаОперации.Колонки.Добавить("ПериодОтчета");
	ТаблицаОперации.Колонки.Добавить("ОтчетностьОперации");
	ТаблицаОперации.Колонки.Добавить("КодОперации");
	ТаблицаОперации.Колонки.Добавить("Документ");
	ТаблицаОперации.Колонки.Добавить("Номенклатура");
	ТаблицаОперации.Колонки.Добавить("РНПТ");
	ТаблицаОперации.Колонки.Добавить("КоличествоПрослеживаемости");
	ТаблицаОперации.Колонки.Добавить("СуммаБезНДС");
	ТаблицаОперации.Колонки.Добавить("ВидДокумента");
	ТаблицаОперации.Колонки.Добавить("НомерДокумента");
	ТаблицаОперации.Колонки.Добавить("ДатаДокумента");
	ТаблицаОперации.Колонки.Добавить("Контрагент");
	
	Возврат ТаблицаОперации;
	
КонецФункции

// Возвращает Истина, если хозоперация комиссионная.
//
// Параметры:
//  ХозОперация - СправочникСсылка.ХозОперации - проверяемый объект.
//
// Возвращаемое значение:
//  Булево - Истина, если в хозоперация комиссионная.
//
Функция ЭтоХозОперацияКомиссии(ХозОперация) Экспорт
	
	ХозОперации = ХозОперацииКомиссии();
	Возврат НЕ ХозОперации.Найти(ХозОперация) = Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДокументыСПрослеживаемымиТоварами()
	
	СписокДокументов = Новый Массив;
	СписокДокументов.Добавить(Метаданные.Документы.ПоступлениеТоваров);
	СписокДокументов.Добавить(Метаданные.Документы.РеализацияТоваров);
	СписокДокументов.Добавить(Метаданные.Документы.СчетФактураВыданный);
	СписокДокументов.Добавить(Метаданные.Документы.СчетФактураПолученный);
	
	Возврат СписокДокументов;
	
КонецФункции

Функция ХозОперацииКомиссии()
	
	ХозОперации = Новый Массив;
	
	ХозОперации.Добавить(Справочники.ХозОперации.ВводОстатковТоваровПереданныхНаКомиссию);
	ХозОперации.Добавить(Справочники.ХозОперации.ВводОстатковТоваровПринятыхНаКомиссию);
	ХозОперации.Добавить(Справочники.ХозОперации.ВводОстатковТоваровПринятыхИПроданных);
	ХозОперации.Добавить(Справочники.ХозОперации.ВозвратТоваровОтПокупателяКомиссия);
	ХозОперации.Добавить(Справочники.ХозОперации.ВозвратТоваровПоставщикуКомиссия);
	ХозОперации.Добавить(Справочники.ХозОперации.ИнвентаризацияТоваровОтданныхНаКомиссию);
	ХозОперации.Добавить(Справочники.ХозОперации.ОтчетАгента);
	ХозОперации.Добавить(Справочники.ХозОперации.ОтчетКомиссионера);
	ХозОперации.Добавить(Справочники.ХозОперации.ОтчетКомитенту);
	ХозОперации.Добавить(Справочники.ХозОперации.ПереоценкаТоваровОтданныхНаКомиссию);
	ХозОперации.Добавить(Справочники.ХозОперации.ПереоценкаТоваровПринятыхНаКомиссию);
	ХозОперации.Добавить(Справочники.ХозОперации.ПоступлениеТоваровКомиссия);
	ХозОперации.Добавить(Справочники.ХозОперации.РеализацияТоваровКомиссия);
	ХозОперации.Добавить(Справочники.ХозОперации.СписаниеТоваровОтданныхНаКомиссию);
	
	Возврат ХозОперации;
	
КонецФункции
#КонецОбласти