//&НаКлиенте
//Перем ОбъектВл;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КопироватьДанныеФормы(Параметры.ОбъектВл, ЭтаФорма.Объект);
	
	СтрокаXML = Параметры.СтрокаXML;
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ОбъектОбработка.ЗаполнитьТаблицуОбъектов(Параметры.Текст, СтрокаXML);	
	ЗначениеВРеквизитФормы(ОбъектОбработка, "Объект");
	
	Заголовок = Заголовок + " для" + Объект.СписокФайлов[Параметры.ИндексФайла].Представление;
КонецПроцедуры //ПриСозданииНаСервере()

&НаКлиентеНаСервереБезКонтекста
Функция обЗначениеНеЗаполнено(Значение)

	Результат = Ложь;
	ТипЗначения = ТипЗнч(Значение);

	// Сначала примитивные типы
	Если Значение=Неопределено Тогда
		Результат = Истина;
	ИначеЕсли Значение=NULL Тогда
		Результат = Истина;
	ИначеЕсли ТипЗначения=Тип("Строка") Тогда
		Если СокрЛП(Значение)="" Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения=Тип("Число") Тогда
		Если Значение=0 Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения=Тип("Дата") Тогда
		Если Значение=Дата('00010101') Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения=Тип("Булево") Тогда
		Результат = Ложь; // Булево будем считать не пустым
	ИначеЕсли ТипЗначения=Тип("МоментВремени") Тогда
		Если Значение.Дата=Дата('00010101') Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения=Тип("COMОбъект") Тогда
		Результат = Ложь; // Если уж он объект, значит не пустой
	ИначеЕсли ТипЗначения=Тип("СписокЗначений") Тогда
		Если Значение.Количество() < 1 Тогда
			Результат = Истина;
		КонецЕсли;
	ИначеЕсли ТипЗначения=Тип("ХранилищеЗначения") Тогда
		Если Значение.Получить()=Неопределено Тогда
			Результат = Истина;
		КонецЕсли; 
		
	// Для остальных будем считать значение пустым, если оно равно
	// дефолтному значению своего типа
	Иначе
		Если Значение=Новый(ТипЗначения) Тогда
			Результат = Истина;
		КонецЕсли; 
	КонецЕсли; 

	Возврат Результат;
КонецФункции //обЗначениеНеЗаполнено()

&НаСервере
Процедура НайтиСтрокиВДереве(КоллекцияСтрокДерева, ИскомыйОбъект, МассивНайденных)
    Для Каждого СтрокаКоллекции Из КоллекцияСтрокДерева Цикл
        Если СтрокаКоллекции.IdОбъектаТК=ИскомыйОбъект Тогда
			МассивНайденных.Добавить(СтрокаКоллекции);
			Прервать;
        Иначе
            НайтиСтрокиВДереве(СтрокаКоллекции.ПолучитьЭлементы(), ИскомыйОбъект, МассивНайденных);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры //НайтиСтрокиВДереве()

&НаСервере
Процедура АвтоУстановкаСоответствий()
	ДеревоОб = РеквизитФормыВЗначение("Объект.ДеревоОбъектов");
	МассивСтрок = ДеревоОб.Строки.НайтиСтроки(Новый Структура("Картинка", 3), Истина);
	Для Каждого СтрокаОбъекта Из МассивСтрок Цикл
		Если НЕ обЗначениеНеЗаполнено(СтрокаОбъекта.ОбъектБух) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ обЗначениеНеЗаполнено(СтрокаОбъекта.ИНН) Тогда
			Если обЗначениеНеЗаполнено(СтрокаОбъекта.КПП) Тогда
				СтрокаОбъекта.ОбъектБух = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", СтрокаОбъекта.ИНН);
			Иначе
				Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.Контрагенты ГДЕ ИНН=&инн И КПП=&кпп");
				Запрос.УстановитьПараметр("инн", СтрокаОбъекта.ИНН);
				Запрос.УстановитьПараметр("кпп", СтрокаОбъекта.КПП);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					СтрокаОбъекта.ОбъектБух = Выборка.Ссылка;
				Иначе
					Запрос.УстановитьПараметр("кпп", "");
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						СтрокаОбъекта.ОбъектБух = Выборка.Ссылка;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли НЕ обЗначениеНеЗаполнено(СтрокаОбъекта.Счет) Тогда
			СтрокаОбъекта.ОбъектБух = Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета", СтрокаОбъекта.Счет);
			//РасчСчет = Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета",СтрокаОбъекта.Счет);
			//Если НЕ обЗначениеНеЗаполнено(РасчСчет) И (НайтиПоИдентТК(СтрокаОбъекта.IDвладельца)=РасчСчет.Владелец) Тогда
			//	СтрокаОбъекта.ОбъектБух = РасчСчет;
			//КонецЕсли;
			
		ИначеЕсли НЕ обЗначениеНеЗаполнено(СтрокаОбъекта.Бик) Тогда
			СтрокаОбъекта.ОбъектБух = Справочники.Банки.НайтиПоКоду(СтрокаОбъекта.Бик);
			
		ИначеЕсли НЕ обЗначениеНеЗаполнено(СтрокаОбъекта.КодТК) Тогда
			Если Найти(СтрокаОбъекта.ТипОбъектаТК,"КлассификаторСтранМира")>0 Тогда
				текОбъект = Справочники.СтраныМира.НайтиПоКоду(СтрокаОбъекта.КодТК);
			ИначеЕсли Найти(СтрокаОбъекта.ТипОбъектаТК,"КлассификаторЕдиницИзмерения")>0 Тогда
				текОбъект = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(СтрокаОбъекта.КодТК);
			ИначеЕсли Найти(СтрокаОбъекта.ТипОбъектаТК,"Валюты")>0 Тогда
				текОбъект = Справочники.Валюты.НайтиПоКоду(СтрокаОбъекта.КодТК);
			Иначе
				текОбъект = Неопределено;
			КонецЕсли;
			
			Если НЕ обЗначениеНеЗаполнено(текОбъект) Тогда
				СтрокаОбъекта.ОбъектБух = текОбъект;
			КонецЕсли;
			
		//ИначеЕсли НЕ обЗначениеНеЗаполнено(СтрокаОбъекта.ИНН) И НЕ обЗначениеНеЗаполнено(СтрокаОбъекта.КПП) Тогда
		//	Запрос=Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.Организации ГДЕ ИНН=&инн И КПП=&кпп");
		//	Запрос.УстановитьПараметр("инн",СтрокаОбъекта.ИНН);
		//	Запрос.УстановитьПараметр("кпп",СтрокаОбъекта.КПП);
		//	ВыборкаОрг=Запрос.Выполнить().Выбрать();
		//	Если ВыборкаОрг.Следующий() Тогда
		//		СтрокаОбъекта.ОбъектБух = ВыборкаОрг.Ссылка;
		//	КонецЕсли;
			
		//ИначеЕсли Найти(ТипОбъектаТК,"ДоговорыВзаиморасчетов") И НЕ обЗначениеНеЗаполнено(СтрокаОбъекта.ВладелецОбъекта) Тогда
			//Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.ДоговорыКонтрагентов ГДЕ Владелец=&Владелец И Наименование=&Наименование");
			//Запрос.УстановитьПараметр("Владелец",);
			//Запрос.УстановитьПараметр("Наименование",);
			//Выборка = Запрос.Выполнить().Выбрать();
			//Если Выборка.Количество()=1 И Выборка.Следующий() Тогда
			//	СтрокаОбъекта.ОбъектБух = Выборка.Ссылка;
			//КонецЕсли;
		КонецЕсли;
		
		Если НЕ обЗначениеНеЗаполнено(СтрокаОбъекта.ОбъектБух) Тогда
			СтрокаОбъекта.ТипОбъектаБух		 = "Справочник." + СтрокаОбъекта.ОбъектБух.Метаданные().Имя;
			СтрокаОбъекта.Модифицированность = Истина;
			//СтрокаОбъекта.Заполнено			 = Истина;
		КонецЕсли;
	КонецЦикла;
	ЗначениеВРеквизитФормы(ДеревоОб, "Объект.ДеревоОбъектов");	
КонецПроцедуры //АвтоУстановкаСоответствий()

&НаСервере
Функция ОбработатьНачалоВыбора()
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	
	ТекСтрока = Объект.ДеревоОбъектов.НайтиПоИдентификатору(Элементы.ДеревоОбъектов.ТекущаяСтрока);
	//определим тип объекта
	//Если ТекСтрока.ОбъектБух=Неопределено Тогда
	//	Попытка
	//		ИдентификаторСправочникаБух = ОбъектОбработка.НайтиСоответствиеСправочника(ТекСтрока.ТипОбъектаТК);
	//		ТекСтрока.ОбъектБух = Справочники[СокрЛП(ИдентификаторСправочникаБух)].ПустаяСсылка();
	//	Исключение КонецПопытки;
	//КонецЕсли;

	// попробуем найти владельца
	Владелец	= Неопределено;
	IDВладельца = СокрЛП(ТекСтрока.IDвладельца);
	Если ЗначениеЗаполнено(IDВладельца) Тогда
		СтрокаТО = ОбъектОбработка.ДеревоОбъектов.Строки.НайтиСтроки(Новый Структура("IDобъектаТК", IDВладельца), Истина);
		Если СтрокаТО.Количество()>0 Тогда
			Владелец = СтрокаТО[0].ОбъектБух;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Владелец;
КонецФункции //ОбработатьНачалоВыбора

&НаСервере
Процедура ОбработатьИзменениеОбъектаБух()
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");

	ТекСтрока = Объект.ДеревоОбъектов.НайтиПоИдентификатору(Элементы.ДеревоОбъектов.ТекущаяСтрока);
	
	ТекСтрока.Модифицированность = Истина;
	Если обЗначениеНеЗаполнено(ТекСтрока.ОбъектБух) Тогда
		Попытка
			Если Найти(ТекСтрока.ТипОбъектаТК, "СтатьиДоходовИРасходов")=0 Тогда
				ТекСтрока.ОбъектБух	= Справочники[СокрЛП(ОбъектОбработка.НайтиСоответствиеСправочника(ТекСтрока.ТипОбъектаТК))].ПустаяСсылка();	
			КонецЕсли;
		Исключение КонецПопытки;
		ТекСтрока.ТипОбъектаБух = "";
	Иначе
		ТекСтрока.ТипОбъектаБух = "Справочник." + ТекСтрока.ОбъектБух.Метаданные().Имя;
	КонецЕсли;
	
	//проверим подчиненные объекты
	ДеревоОб = РеквизитФормыВЗначение("Объект.ДеревоОбъектов");	
	ПодчиненныеОбъекты = ДеревоОб.Строки.НайтиСтроки(Новый Структура("IDвладельца", ТекСтрока.IDобъектаТК), Истина);
	
	МассивНайденных = Новый Массив();
	Для Каждого СтрокаОб Из ПодчиненныеОбъекты Цикл
		НайтиСтрокиВДереве(Объект.ДеревоОбъектов.ПолучитьЭлементы(), СтрокаОб.IdОбъектаТК, МассивНайденных);		
	КонецЦикла;
	
	Для Каждого СтрокаДерева Из МассивНайденных Цикл
		Если НЕ обЗначениеНеЗаполнено(СтрокаДерева.ОбъектБух) И (СтрокаДерева.ОбъектБух.Владелец<>ТекСтрока.ОбъектБух) Тогда
			СтрокаДерева.Модифицированность = Истина;
			Попытка
				СтрокаДерева.ОбъектБух		 = Справочники[СокрЛП(ОбъектОбработка.НайтиСоответствиеСправочника(СтрокаДерева.ТипОбъектаТК))].ПустаяСсылка();
			Исключение
				СтрокаДерева.ОбъектБух		 = Неопределено;
			КонецПопытки;
			СтрокаДерева.ТипОбъектаБух		 = "";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры //ОбработатьИзменениеОбъектаБух()

&НаСервере
Функция ЗаписатьТО()
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	Рез = ОбъектОбработка.ЗаписатьТаблицуОбъектов(СтрокаXML);
	
	Возврат Рез;
КонецФункции //ЗаписатьТО()

&НаСервере
Функция ПолучитьКоличествоПустыхОбъектов()
	ДеревоОб = РеквизитФормыВЗначение("Объект.ДеревоОбъектов");	
	КолПустых = ДеревоОб.Строки.НайтиСтроки(Новый Структура("ТипОбъектаБух, ЭтоГруппа", "", Ложь), Истина);
	 
	Возврат КолПустых.Количество();
КонецФункции //ПолучитьКоличествоПустыхОбъектов()

//&НаСервере
//Функция НайтиПоИдентТК(Знач Идент)
//	Значение = Неопределено;
//	Если ЗначениеЗаполнено(Идент) Тогда
//		ДеревоОб = РеквизитФормыВЗначение("Объект.ДеревоОбъектов");
//		СтрокаТО = ДеревоОб.Строки.НайтиСтроки(Новый Структура("IDобъектаТК",Идент),Истина);
//		Если СтрокаТО.Количество()>0 И НЕ обЗначениеНеЗаполнено(СтрокаТО[0].ОбъектБух) Тогда
//			Значение = СтрокаТО[0].ОбъектБух;
//		КонецЕсли;
//	КонецЕсли;
//	Возврат Значение;
//КонецФункции //НайтиПоИдентТК()

&НаКлиенте
Процедура ОтобразитьКоличествоНеЗаполненныхОбъектов();
	КолПустых = ПолучитьКоличествоПустыхОбъектов();
	Если КолПустых=0 Тогда
		Элементы.КоличествоОбъектов.Заголовок = "Все соответсвия объектов определены.";
		Элементы.КоличествоОбъектов.ЦветТекста = Новый Цвет(0, 0, 0);
	Иначе
		Элементы.КоличествоОбъектов.Заголовок = "Не определены соответствия для " + КолПустых + ?(КолПустых>1, " объектов.", " объекта.");
		Элементы.КоличествоОбъектов.ЦветТекста = Новый Цвет(255, 0, 0);
	КонецЕсли;
КонецПроцедуры //ОтобразитьКоличествоНеЗаполненныхОбъектов()

&НаКлиенте
Процедура ОсновныеДействияФормыЗаписать(Команда)
	Если ЗаписатьТО() Тогда
		ЭтаФорма.Закрыть(СтрокаXML);//Истина);
	КонецЕсли;
КонецПроцедуры //ОсновныеДействияФормыЗаписать()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.КнопкаОбновитьУстановкуСоответствий.Доступность = Объект.АвтоУстСоотв;
	
	Если Объект.АвтоУстСоотв Тогда
		АвтоУстановкаСоответствий();
	КонецЕсли;
	
	ОтобразитьКоличествоНеЗаполненныхОбъектов();	
КонецПроцедуры //ПриОткрытии()

&НаКлиенте
Процедура ДеревоОбъектовОбъектБухНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекДанные = Элементы.ДеревоОбъектов.ТекущиеДанные;
	
	Элемент.ОграничениеТипа = Новый ОписаниеТипов;
	Элемент.ВыбиратьТип = Ложь;
	Если ТекДанные.ОбъектБух=Неопределено И Найти(ТекДанные.ТипОбъектаТК, "СтатьиДоходовИРасходов")>0 Тогда
		МассивТиповДокументов = Новый Массив;
		МассивТиповДокументов.Добавить(Тип("СправочникСсылка.ПрочиеДоходыИРасходы"));
		МассивТиповДокументов.Добавить(Тип("СправочникСсылка.СтатьиЗатрат"));
		Элемент.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповДокументов);
		Элемент.ВыбиратьТип = Истина;
	КонецЕсли;
	
	Владелец = ОбработатьНачалоВыбора();
	
	Если НЕ обЗначениеНеЗаполнено(Владелец) Тогда
		// обработаем выбор сами
		Если Найти(ТекДанные.ТипОбъектаТК,"Договор")>0 Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", Владелец));
			ПараметрыФормы.Вставить("ТекущаяСтрока", ТекДанные.ОбъектБух);
		   	ФормаВыбора = ПолучитьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, Элемент);
		    ФормаВыбора.Открыть();
		ИначеЕсли Найти(ТекДанные.ТипОбъектаТК,"Счет")>0 Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", Владелец));
			ПараметрыФормы.Вставить("ТекущаяСтрока", ТекДанные.ОбъектБух);
		   	ФормаВыбора = ПолучитьФорму("Справочник.БанковскиеСчета.ФормаВыбора", ПараметрыФормы, Элемент);
			ФормаВыбора.Открыть();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры //ТаблицаОбъектовОбъектБухНачалоВыбора()

&НаКлиенте
Процедура ДеревоОбъектовОбъектБухПриИзменении(Элемент)
	ОбработатьИзменениеОбъектаБух();
	ОтобразитьКоличествоНеЗаполненныхОбъектов();
	
	Элемент.ОграничениеТипа = Новый ОписаниеТипов;
	Элемент.ВыбиратьТип = Ложь;
КонецПроцедуры //ТаблицаОбъектовОбъектБухПриИзменении()

&НаКлиенте
Процедура ДеревоОбъектовОбъектБухОчистка(Элемент, СтандартнаяОбработка)
	ТекДанные = Элементы.ДеревоОбъектов.ТекущиеДанные;
	ТекДанные.ОбъектБух		= Неопределено;
	ТекДанные.ТипОбъектаБух = "";
КонецПроцедуры //ДеревоОбъектовОбъектБухОчистка()

&НаКлиенте
Процедура ДействияФормыОбновить(Команда)
	АвтоУстановкаСоответствий();
	
	Для Каждого Строка Из Объект.ДеревоОбъектов.ПолучитьЭлементы() Цикл
		Элементы.ДеревоОбъектов.Развернуть(Строка.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
КонецПроцедуры //ДействияФормыОбновить()
