// Модуль менеджера справочника "Контрагенты"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


/////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	// Заполним основного поставщика
	КонтрагентыОсновнойПоставщик = Справочники.Контрагенты.ОсновнойПоставщик.ПолучитьОбъект();
	
	// перезаполняем реквизиты
	Если НЕ ЗначениеЗаполнено(КонтрагентыОсновнойПоставщик.НаименованиеПолное) Тогда
		КонтрагентыОсновнойПоставщик.НаименованиеПолное = КонтрагентыОсновнойПоставщик.Наименование;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(КонтрагентыОсновнойПоставщик.ВидКонтрагента) Тогда
		КонтрагентыОсновнойПоставщик.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Поставщик;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(КонтрагентыОсновнойПоставщик.ФормаСобственности) Тогда
		КонтрагентыОсновнойПоставщик.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КонтрагентыОсновнойПоставщик.Автор) Тогда
		
		КонтрагентыОсновнойПоставщик.Автор = Пользователи.НайтиПоИмени("Администратор");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КонтрагентыОсновнойПоставщик.ДатаСоздания) Тогда
		
		КонтрагентыОсновнойПоставщик.ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
	// Сохранение справочника
	НовыйЭлемент = КонтрагентыОсновнойПоставщик.ЭтоНовый();
	Если КонтрагентыОсновнойПоставщик.Модифицированность() Тогда
		Попытка
			КонтрагентыОсновнойПоставщик.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Контрагенты"". %1 элемент ""%2""'"),,,,,?(НовыйЭлемент,"Добавлен","Обновлен"),СокрЛП(КонтрагентыОсновнойПоставщик.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Контрагенты""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	// Заполним основного покупателя
	КонтрагентыОсновнойПокупатель = Справочники.Контрагенты.ОсновнойПокупатель.ПолучитьОбъект();
	
	// перезаполняем реквизиты
	Если НЕ ЗначениеЗаполнено(КонтрагентыОсновнойПокупатель.НаименованиеПолное) Тогда
		КонтрагентыОсновнойПокупатель.НаименованиеПолное = КонтрагентыОсновнойПокупатель.Наименование;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(КонтрагентыОсновнойПокупатель.ВидКонтрагента) Тогда
		КонтрагентыОсновнойПокупатель.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(КонтрагентыОсновнойПокупатель.ФормаСобственности) Тогда
		КонтрагентыОсновнойПокупатель.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КонтрагентыОсновнойПокупатель.Автор) Тогда
		
		КонтрагентыОсновнойПокупатель.Автор = Пользователи.НайтиПоИмени("Администратор");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КонтрагентыОсновнойПокупатель.ДатаСоздания) Тогда
		
		КонтрагентыОсновнойПокупатель.ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
	// Сохранение справочника
	НовыйЭлемент = КонтрагентыОсновнойПокупатель.ЭтоНовый();
	Если КонтрагентыОсновнойПокупатель.Модифицированность() Тогда
		Попытка
			КонтрагентыОсновнойПокупатель.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Контрагенты"". %1 элемент ""%2""'"),,,,,?(НовыйЭлемент,"Добавлен","Обновлен"),СокрЛП(КонтрагентыОсновнойПокупатель.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Контрагенты""'", 
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

// Процедура исправляет значения ИНН (убирает незначащие символы)
Процедура ВыполнитьОбновлениеИНН() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ФормаСобственности В(&СписокВидов)
	|	И Контрагенты.ИНН <> """"";
	
	СписокВидов = Новый Массив;
	СписокВидов.Добавить(Перечисления.ФормыСобственности.ЮридическоеЛицо);
	СписокВидов.Добавить(Перечисления.ФормыСобственности.ПрочаяФормаСобственности);
	Запрос.УстановитьПараметр("СписокВидов", СписокВидов);
	
	Выборка =Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.ИНН = СокрП(СправочникОбъект.ИНН);
		Попытка
			СправочникОбъект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Контрагенты""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Функция создает основной договор контрагента, если он отсутствует
// Тип договора подставляется в зависимости от типа контрагента.
Функция СоздатьОсновнойДоговор(Объект) Экспорт
	
	Выборка = Справочники.ДоговорыВзаиморасчетов.Выбрать(,Объект);
	
	Если НЕ Выборка.Следующий() Тогда
		
		Если Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель Тогда
			ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
			ТипЦен      = ПравоПользователя("ОсновнойТипЦенПродажи");
		ИначеЕсли Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Поставщик Тогда
			ВидДоговора = Перечисления.ВидыДоговоров.Покупка;
			ТипЦен      = ПравоПользователя("ОсновнойТипЦенЗакупки");
		Иначе
			ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
			ТипЦен      = ПравоПользователя("ОсновнойТипЦенПродажи");
		КонецЕсли;
		ОсновнойДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
		ОсновнойДоговор.УстановитьНовыйКод();
		ОсновнойДоговор.Владелец    = Объект.Ссылка;
		ОсновнойДоговор.ВидДоговора = ВидДоговора;
		ОсновнойДоговор.ТипЦен      = ТипЦен;
		ОсновнойДоговор.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
		ОсновнойДоговор.Основной    = Истина;
		ОсновнойДоговор.АвтоЗакрытиеСделок = ОсновнойДоговор.Организация.АвтоЗакрытиеСделок;
		ОсновнойДоговор.ПроцентПредоплаты  = -1;

		ОсновнойДоговор.Заполнить(Неопределено);
		ОсновнойДоговор.Записать();
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // СоздатьОсновнойДоговор()

// Формирует Список видов контрагентов
Функция ПолучитьВидыКонтрагентов() Экспорт
	
	ВидыКонтрагентов = Новый Массив;
	
	Для каждого ВидКонтрагента Из Перечисления.ВидыКонтрагентов Цикл
		Если НЕ ВидКонтрагента=Перечисления.ВидыКонтрагентов.КонтактноеЛицо Тогда
			ВидыКонтрагентов.Добавить(ВидКонтрагента);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВидыКонтрагентов;
	
КонецФункции // ПолучитьВидыКонтрагентов()

// Функция извлекающая Фамилию Имя Отчество из строки
// 
// Входной Параметр 
//    Текст  - текст с пробелом в качестве разделителя.
//
// Возвращает структуру со следующими ключами: 
//	"Фамилия"				-	Фамилия
//	"Имя"					-	Имя	
//	"Отчество"				-	Отчество	
//	"НаименованиеПолное"	- 	Полное ФИО с удаленными лишними пробелами 
//							-		и установленным верхним регистром 
//									для имен собственных, 
//									Заноситься в реквизит "НаименованиеПолное".
Функция ПолучитьФИО(Текст)
	
	Текст = СокрЛП(Текст);
	Пока СтрЧислоВхождений(Текст, "  ")>0 Цикл
		Текст = СтрЗаменить(Текст, "  ", " ");
	КонецЦикла;
	
	ФИО = Новый Структура;
	
	ЧислоСимволов      = СтрДлина(Текст);
	КоличествоПробелов = СтрЧислоВхождений(Текст, " "); 
	
	Если КоличествоПробелов=0 Тогда
		ПервыйПробел    = ЧислоСимволов;
		ПоследнийПробел = ЧислоСимволов;
	ИначеЕсли	 КоличествоПробелов=1 Тогда
		ПервыйПробел = СтрНайти(Текст," ",НаправлениеПоиска.СНачала);
		ПоследнийПробел = ЧислоСимволов;
	Иначе
		ПервыйПробел = СтрНайти(Текст," ",НаправлениеПоиска.СНачала);
		ПоследнийПробел = СтрНайти(Текст," ",НаправлениеПоиска.СКонца);
	КонецЕсли;
	
	Фамилия  = ТРег(СокрЛП(Сред(Текст, 0, ПервыйПробел)));
	Имя      = ТРег(СокрЛП(Сред(Текст, ПервыйПробел   +1, ПоследнийПробел  - ПервыйПробел    ))); 
	Отчество = ТРег(СокрЛП(Сред(Текст, ПоследнийПробел+1, ЧислоСимволов    - ПоследнийПробел )));
	НаименованиеПолное = СокрЛП(Фамилия + " " + Имя + " " + Отчество); 
	
	ФИО.Вставить("Фамилия",Фамилия);	
	ФИО.Вставить("Имя",Имя);	
	ФИО.Вставить("Отчество",Отчество);	
	ФИО.Вставить("НаименованиеПолное",НаименованиеПолное);	
	
	Возврат ФИО;
	
КонецФункции  //ПолучитьФИО()

// функция устанавливает актуальное значение КПП
Процедура УстановитьАктуальноеЗначениеИсторииКПП(КПП, ИсторияКПП) Экспорт
	
	КоличествоЗаписей = ИсторияКПП.Количество();
	
	Если КоличествоЗаписей > 0 Тогда
		
		ИсторияКПП.Сортировать("Период");
		АктуальнаяЗаписьИстории = ИсторияКПП[КоличествоЗаписей - 1];
		АктуальнаяЗаписьИстории.КПП = КПП;
		
	КонецЕсли;
	
КонецПроцедуры

// функция устанавливает актуальное значение наименования
Процедура УстановитьАктуальноеЗначениеИсторииНаименований(НаименованиеПолное, ИсторияНаименований) Экспорт
	
	КоличествоЗаписей = ИсторияНаименований.Количество();
	
	Если КоличествоЗаписей > 0 Тогда
		
		ИсторияНаименований.Сортировать("Период");
		АктуальнаяЗаписьИстории = ИсторияНаименований[КоличествоЗаписей - 1];
		АктуальнаяЗаписьИстории.НаименованиеПолное = НаименованиеПолное;
		
	КонецЕсли;
	
КонецПроцедуры

// функция получает актуальный КПП на дату
Функция КППНаДату(Контрагент, ДатаСведений) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент)
		ИЛИ ТипЗнч(Контрагент) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаСведений) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "КПП");
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Контрагент", Контрагент);
	Запрос.Параметры.Вставить("ДатаСведений", ДатаСведений);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ИсторияКППКонтрагентов.Период) КАК Период,
	|	ИсторияКППКонтрагентов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ЗначенияКПП
	|ИЗ
	|	Справочник.Контрагенты.ИсторияКПП КАК ИсторияКППКонтрагентов
	|ГДЕ
	|	ИсторияКППКонтрагентов.Ссылка = &Контрагент
	|	И ИсторияКППКонтрагентов.Период <= &ДатаСведений
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияКППКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсторияКППКонтрагентов.КПП КАК КПП
	|ИЗ
	|	ЗначенияКПП КАК ЗначенияКПП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияКПП КАК ИсторияКППКонтрагентов
	|		ПО ЗначенияКПП.Ссылка = ИсторияКППКонтрагентов.Ссылка
	|			И ЗначенияКПП.Период = ИсторияКППКонтрагентов.Период";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КПП;
	Иначе
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "КПП");
	КонецЕсли;
КонецФункции

// функция получает актуальное наименование на дату
Функция НаименованияНаДату(Контрагент, ДатаСведений) Экспорт
	
	НаименованияКонтрагента = Новый Структура("СокращенноеНаименование, НаименованиеПолное, НаименованиеДляПечатныхФорм", "", "", "");
	
	Если НЕ ЗначениеЗаполнено(Контрагент)
		ИЛИ ТипЗнч(Контрагент) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат НаименованияКонтрагента;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаСведений) Тогда
		Запрос = Новый Запрос();
		Запрос.Параметры.Вставить("Контрагент", Контрагент);
		Запрос.Параметры.Вставить("ДатаСведений", ДатаСведений);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ИсторияНаименованийКонтрагентов.Период) КАК Период,
		|	ИсторияНаименованийКонтрагентов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ЗначенияНаименований
		|ИЗ
		|	Справочник.Контрагенты.ИсторияНаименований КАК ИсторияНаименованийКонтрагентов
		|ГДЕ
		|	ИсторияНаименованийКонтрагентов.Ссылка = &Контрагент
		|	И ИсторияНаименованийКонтрагентов.Период <= &ДатаСведений
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияНаименованийКонтрагентов.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсторияНаименованийКонтрагентов.Ссылка.Наименование КАК Наименование,
		|	ИсторияНаименованийКонтрагентов.НаименованиеПолное КАК НаименованиеПолное
		|ИЗ
		|	ЗначенияНаименований КАК ЗначенияНаименований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияНаименований КАК ИсторияНаименованийКонтрагентов
		|		ПО ЗначенияНаименований.Ссылка = ИсторияНаименованийКонтрагентов.Ссылка
		|			И ЗначенияНаименований.Период = ИсторияНаименованийКонтрагентов.Период";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НаименованияКонтрагента.СокращенноеНаименование     = Выборка.Наименование;
			НаименованияКонтрагента.НаименованиеПолное          = Выборка.НаименованиеПолное;
			НаименованияКонтрагента.НаименованиеДляПечатныхФорм = Выборка.НаименованиеПолное;
			Возврат НаименованияКонтрагента;
		КонецЕсли;
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "Наименование, НаименованиеПолное");
	НаименованияКонтрагента.СокращенноеНаименование     = ЗначенияРеквизитов.Наименование;
	НаименованияКонтрагента.НаименованиеПолное          = ЗначенияРеквизитов.НаименованиеПолное;
	НаименованияКонтрагента.НаименованиеДляПечатныхФорм = ЗначенияРеквизитов.НаименованиеПолное;
	Возврат НаименованияКонтрагента;
	
КонецФункции

// Производит поиск контрагентов с дублирующимися полями из структуры поиска.
// 
// Параметры:
//   СтруктураПоиска        - СправочникСсылка.Контрагент - Добавляемый контакт
//   СписокКонтактов - СправочникСсылка.Контрагент - Контрагент для которого проверяется контакт.
//
// Возвращаемое значение:
//   Булево - Истина - Есть дубли.
//            Ложь   - Нет дублей.
//
Функция НайтиДубли(СтруктураПоиска,СписокКонтактов, Знач Объект) Экспорт
	
	СтруктураНайденныхДублей = Новый СписокЗначений;
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Сч = 0;

	ПервоеЗначение = Истина;
	Для каждого КлючИЗначение Из СтруктураПоиска Цикл
		ИмяРеквизита      = КлючИЗначение.Ключ;
		ПервоеУсловие = Истина;
		СтепеньСхожести   = КлючИЗначение.Значение;
		ЗначениеРеквизита = Неопределено;
		Реквизиты = "";
		Сч = Сч + 1;
		
		Если СтрНайти(ИмяРеквизита,"Контакт")=0  Тогда
			
			Если ТипЗнч(КлючИЗначение.Значение) = Тип("Структура") Тогда
				Если НЕ ПервоеЗначение Тогда
					Реквизиты = "
					| ОБЪЕДИНИТЬ ВСЕ
					|";
				КонецЕсли;
				СтрокаРеквизит = "";
				СтрокаИмяРеквизита = "";
				СтрокаУсловия = "";
				Реквизиты =  Реквизиты + "
				|ВЫБРАТЬ  
				|Данные.Ссылка" +  ?(ПервоеЗначение," КАК Ссылка","");
				
				Для каждого Условие Из КлючИЗначение.Значение Цикл
					ИмяРеквизита = Условие.Ключ;
					СтепеньСхожести   = Условие.Значение;
					ЗначениеРеквизита = Неопределено;
					
					Если ТипЗнч(Объект) = Тип("Структура") Тогда
						Объект.Свойство(ИмяРеквизита,ЗначениеРеквизита);
					Иначе
						ЗначениеРеквизита = Объект[ИмяРеквизита];
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
						Продолжить;
					КонецЕсли;
					
					Если ТипЗнч(ЗначениеРеквизита) = Тип("Строка") Тогда
						СтрокаРеквизит = СтрокаРеквизит + ?(ПервоеУсловие, Символы.ПС + ", " , " + "" и "" + ") + "ВЫРАЗИТЬ(Данные."+ИмяРеквизита + " КАК СТРОКА (1000))" ;
					Иначе
						СтрокаРеквизит = СтрокаРеквизит + ?(НЕ ПервоеУсловие, "", "|,  Данные."+ИмяРеквизита); 
					КонецЕсли;
					
					СтрокаИмяРеквизита = СтрокаИмяРеквизита + ?(ПервоеУсловие,Символы.ПС + ","""," и ") +ИмяРеквизита; 
					
					СтрокаУсловия  = СтрокаУсловия + ?(ПервоеУсловие, Символы.ПС," И ")+ "Данные."+ИмяРеквизита + " " + СтепеньСхожести + " &" + ИмяРеквизита; 
					Запрос.УстановитьПараметр(ИмяРеквизита,?(СтепеньСхожести = "ПОДОБНО","%"+ЗначениеРеквизита+"%",ЗначениеРеквизита));
					
					ПервоеУсловие = Ложь;					
					ПервоеЗначение = Ложь;
				КонецЦикла; 
				
				Реквизиты = Реквизиты + СтрокаРеквизит + " КАК Реквизит" + СтрокаИмяРеквизита + """ КАК ИмяРеквизита";
				Если СтрокаРеквизит = "" ИЛИ СтрокаИмяРеквизита = "" ИЛИ СтрокаУсловия = "" Тогда
					Запрос.Текст = "";
				Иначе
					Запрос.Текст = Запрос.Текст + Реквизиты + "
					|ИЗ Справочник.Контрагенты КАК Данные
					|ГДЕ " + СтрокаУсловия + "
						|И Данные.Ссылка <> &Ссылка";
				КонецЕсли;
				
			Иначе  
				
				Если ТипЗнч(Объект) = Тип("Структура") Тогда
					Объект.Свойство(ИмяРеквизита,ЗначениеРеквизита);
				Иначе
					ЗначениеРеквизита = Объект[ИмяРеквизита];
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
					Продолжить;
				КонецЕсли;
				
				Если НЕ ПервоеЗначение Тогда
					Реквизиты = "
					| ОБЪЕДИНИТЬ ВСЕ
					|";
				КонецЕсли;
				
				Реквизиты =  Реквизиты + "
				|ВЫБРАТЬ   
				|Данные.Ссылка" +  ?(ПервоеЗначение," КАК Ссылка","");
				
				Если ТипЗнч(ЗначениеРеквизита) = Тип("Строка") Тогда
					Реквизиты = Реквизиты + "
					|,ВЫРАЗИТЬ(Данные."+ИмяРеквизита + " КАК СТРОКА (1000))" + ?(ПервоеЗначение," КАК Реквизит","");
				Иначе
					Реквизиты = Реквизиты + "
					|,Данные."+ИмяРеквизита + ?(ПервоеЗначение," КАК Реквизит","");
				КонецЕсли;
				
				Реквизиты = Реквизиты + "
				|,"""+ИмяРеквизита + """" + ?(ПервоеЗначение," КАК ИмяРеквизита","");
				
				Условия  = "
				|Данные."+ИмяРеквизита + " " + СтепеньСхожести + " &" + ИмяРеквизита + Строка(Сч);
				
				Запрос.УстановитьПараметр(ИмяРеквизита+ Строка(Сч),?(СтепеньСхожести = "ПОДОБНО","%"+ЗначениеРеквизита+"%",ЗначениеРеквизита));
				
				Запрос.Текст = Запрос.Текст + Реквизиты + "
				|ИЗ Справочник.Контрагенты КАК Данные
				|ГДЕ " + Сред(Условия,2) + "
						|И Данные.Ссылка <> &Ссылка";
				
				ПервоеЗначение = Ложь;
			КонецЕсли;
		Иначе
			
			Массив = Новый Массив;
			Для Каждого Стр Из СписокКонтактов Цикл
				ИмяРеквизита = СтрЗаменить(ИмяРеквизита,"Контакт_","");
				Если Стр.Значение = ИмяРеквизита И ЗначениеЗаполнено(Стр.Представление) Тогда
					Массив.Добавить(Стр.Представление);
				КонецЕсли;
			КонецЦикла;
			
			Если Массив.Количество() > 0 Тогда
				Для Каждого Стр Из Массив Цикл
					Если НЕ ПервоеЗначение Тогда
						Реквизиты = "
						| ОБЪЕДИНИТЬ ВСЕ
						|";
					КонецЕсли;
		
					Реквизиты =  Реквизиты + "
					|ВЫБРАТЬ  
					|Данные.Ссылка" +  ?(ПервоеЗначение," КАК Ссылка","");
		
					Реквизиты = Реквизиты + "
					|,Данные.Представление" + ?(ПервоеЗначение," КАК Реквизит","");
					
					Реквизиты = Реквизиты + "
					|,"""+ИмяРеквизита + """" + ?(ПервоеЗначение," КАК ИмяРеквизита","");
					
					Условия  = "
					|Данные.Представление "+ СтепеньСхожести + " &" + ИмяРеквизита + Строка(Сч) + "
					|И Данные.Тип = &Тип"+ Строка(Сч);
					
					Запрос.УстановитьПараметр(ИмяРеквизита + Строка(Сч),?(СтепеньСхожести = "ПОДОБНО","%"+Стр+"%",Стр));
					Если ИмяРеквизита = "Адрес" Тогда
						Запрос.УстановитьПараметр("Тип" + Строка(Сч),Перечисления.ТипыКонтактнойИнформации.Адрес);
					ИначеЕсли ИмяРеквизита = "Телефон" Тогда 
						Запрос.УстановитьПараметр("Тип" + Строка(Сч),Перечисления.ТипыКонтактнойИнформации.Телефон);
					ИначеЕсли ИмяРеквизита = "АдресЭлектроннойПочты" Тогда 
						Запрос.УстановитьПараметр("Тип" + Строка(Сч),Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
					КонецЕсли;
					
					Запрос.Текст = Запрос.Текст + Реквизиты + "
						|ИЗ Справочник.Контрагенты.КонтактнаяИнформация КАК Данные
						|ГДЕ " + Сред(Условия,2) + "
						|И Данные.Ссылка <> &Ссылка";
					
					Сч = Сч + 1;
					ПервоеЗначение = Ложь;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Запрос.Текст) Тогда
		Возврат СтруктураНайденныхДублей;
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		СтруктураРеквизита = Новый Структура;
		СтруктураРеквизита.Вставить("Ссылка",РезультатЗапроса.Ссылка);
		СтруктураРеквизита.Вставить("ИмяРеквизита",РезультатЗапроса.ИмяРеквизита);
		Если СтрНайти(РезультатЗапроса.ИмяРеквизита, "ДатаРождения") > 0 Тогда
			СтруктураРеквизита.Вставить("ЗначениеРеквизита",РезультатЗапроса.Реквизит+" и "+Строка(РезультатЗапроса.Ссылка.ДатаРождения));
		Иначе
			СтруктураРеквизита.Вставить("ЗначениеРеквизита",РезультатЗапроса.Реквизит);
		КонецЕсли;
		
		СтруктураНайденныхДублей.Добавить(СтруктураРеквизита);

	КонецЦикла;
	
	Возврат СтруктураНайденныхДублей;
	
КонецФункции //НайтиДубли()

// Функция формирует КПП по умолчанию.
//
// Параметры:
//  Объект   - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
Функция СформироватьКПППоУмолчанию(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	НовыйКПП = ?(СтрДлина(Объект.ИНН) < 4, "", Лев(Объект.ИНН, 4) + "01001");
	Возврат НовыйКПП;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	Если Объект.ЭтоГруппа ИЛИ НЕ Объект.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		ОбязательныеРеквизиты.Добавить("Наименование");
	КонецЕсли;
	Если НЕ Объект.ЭтоГруппа Тогда
		ОбязательныеРеквизиты.Добавить("ВидКонтрагента");
		ОбязательныеРеквизиты.Добавить("ФормаСобственности");
		ОбязательныеРеквизиты.Добавить("НаименованиеПолное");
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И ПравоПользователя("РазрешитьВводКонтрагентаБезРекламы") = Перечисления.ВариантыОтветов.Нет Тогда
			ОбязательныеРеквизиты.Добавить("РекламныйИсточник");
		КонецЕсли;
		Если Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ПодотчетноеЛицо Тогда
			ОбязательныеРеквизиты.Добавить("Сотрудник");
		КонецЕсли;
		Если Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Филиал Тогда
			ОбязательныеРеквизиты.Добавить("Филиал");
		КонецЕсли;
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Наименование");
	Результат.Добавить("НаименованиеПолное");
	Результат.Добавить("ИНН");
	Возврат Результат;

КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ

// Обработчик события возникающего при изменении данных реквизита "Наименование".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура НаименованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры // НаименованиеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Форма собственности".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура ФормаСобственностиПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если НЕ (Объект.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо) 
		И Объект.Наименование = НСтр("ru = 'Не заполнено'") Тогда
		
		Объект.Наименование = "";
	ИначеЕсли (Объект.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо) И ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = НСтр("ru = 'Не заполнено'");
	КонецЕсли;
	
КонецПроцедуры // ФормаСобственностиПриИзменении()

// Обработчик события возникающего при изменении данных реквизитов "Фамилия, Имя, Отчество".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура ФИОПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект.Фамилия) И НЕ ЗначениеЗаполнено(Объект.Имя) И НЕ ЗначениеЗаполнено(Объект.Отчество) Тогда
		Объект.Наименование = НСтр("ru = 'Не заполнено'");
		Объект.НаименованиеПолное = "";
	Иначе
		Объект.Наименование = СокрЛП(Объект.Фамилия + ?(НЕ ЗначениеЗаполнено(Объект.Фамилия),""," ") + Объект.Имя + ?(НЕ ЗначениеЗаполнено(Объект.Имя),""," ") + Объект.Отчество);
		Объект.НаименованиеПолное = СокрЛП(Объект.Фамилия + ?(НЕ ЗначениеЗаполнено(Объект.Фамилия),""," ") + Объект.Имя + ?(НЕ ЗначениеЗаполнено(Объект.Имя),""," ") + Объект.Отчество);
	КонецЕсли;
	
КонецПроцедуры // ФИОПриИзменении()

// Обработчик события при окончании изменения данных реквизита "НаименованиеПолное"
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура НаименованиеПолноеПриИзменении(Объект, ПараметрыДействия) Экспорт
	
	Если объект.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда 
		ФИО = ПолучитьФИО(Объект.НаименованиеПолное);
		Объект.Фамилия 				= ФИО.Фамилия;
		Объект.Имя 					= ФИО.Имя;
		Объект.Отчество				= ФИО.Отчество;
		Объект.НаименованиеПолное 	= ФИО.НаименованиеПолное;
	Иначе
		Объект.Фамилия 				= "";
		Объект.Имя 					= "";
		Объект.Отчество				= "";
	КонецЕсли;
	
	// смотрим заполнено ли наименование
	Если ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
		// получаем структура наименований
		СтруктураНаименований = ОбщегоНазначения.ПолучитьНаименованияНаДату(Объект.Ссылка, ТекущаяДатаСеанса());
		
		// получаем наименование
		НаименованиеНаСегодня = СтруктураНаименований.НаименованиеПолное;
		
		// смотрим заполнено ли значение
		Если Объект.ИсторияНаименований.Количество() > 0 И ЗначениеЗаполнено(НаименованиеНаСегодня) Тогда
			// проверяем изменилось ли наименование
			Если НаименованиеНаСегодня <> Объект.НаименованиеПолное Тогда
				// формируем структуру отбора
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Период", НачалоДня(ТекущаяДатаСеанса()));
				
				// ищем значение на сегодня в ТЧ
				НайденныеСтроки = Объект.ИсторияНаименований.НайтиСтроки(СтруктураОтбора);
				
				// проверяем
				Если НайденныеСтроки.Количество() > 0 Тогда
					// получаем строку
					ТекСтрока = НайденныеСтроки[0];
					ТекСтрока.НаименованиеПолное = Объект.НаименованиеПолное;
				Иначе
					// добавляем строку
					НоваяСтрока = Объект.ИсторияНаименований.Добавить();
					НоваяСтрока.Период = ТекущаяДатаСеанса();
					НоваяСтрока.НаименованиеПолное = Объект.НаименованиеПолное;
				КонецЕсли;
			КонецЕсли;
		Иначе
			// ищем строку с пустым периодом
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Период", Дата("00010101"));
			
			// ищем значение на сегодня в ТЧ
			НайденныеСтроки = Объект.ИсторияНаименований.НайтиСтроки(СтруктураОтбора);
			
			// смотрим нашли или нет
			Если НайденныеСтроки.Количество() > 0 Тогда
				// получаем строку
				ТекСтрока = НайденныеСтроки[0];
				ТекСтрока.НаименованиеПолное = Объект.НаименованиеПолное;
			Иначе
				// добавляем строку
				НоваяСтрока = Объект.ИсторияНаименований.Добавить();
				НоваяСтрока.Период = Дата("00010101");
				НоваяСтрока.НаименованиеПолное = Объект.НаименованиеПолное;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры  //НаименованиеПолноеПриИзменении()

// Обработчик события при окончании изменения данных реквизита "КПП"
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура КПППриИзменении(Объект, ПараметрыДействия) Экспорт
	// смотрим заполнено ли КПП
	Если ЗначениеЗаполнено(Объект.КПП) Тогда
		// получаем последний КПП               
		КППНаСегодня = ОбщегоНазначения.ПолучитьКППНаДату(Объект.Ссылка, ТекущаяДатаСеанса());
		
		// смотрим заполнено ли значение
		Если Объект.ИсторияКПП.Количество() > 0 И ЗначениеЗаполнено(КППНаСегодня) Тогда 
			// проверяем изменился ли КПП
			Если КППНаСегодня <> Объект.КПП Тогда
				// формируем структуру отбора
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Период", НачалоДня(ТекущаяДатаСеанса()));
				
				// ищем значение на сегодня в ТЧ
				НайденныеСтроки = Объект.ИсторияКПП.НайтиСтроки(СтруктураОтбора);
				
				// проверяем
				Если НайденныеСтроки.Количество() > 0 Тогда
					// получаем строку
					ТекСтрока = НайденныеСтроки[0];
					ТекСтрока.КПП = Объект.КПП;
				Иначе
					// добавляем строку
					НоваяСтрока = Объект.ИсторияКПП.Добавить();
					НоваяСтрока.Период = ТекущаяДатаСеанса();
					НоваяСтрока.КПП = Объект.КПП;
				КонецЕсли;
			КонецЕсли;
		Иначе
			// ищем строку с пустым периодом
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Период", Дата("00010101"));
			
			// ищем значение на сегодня в ТЧ
			НайденныеСтроки = Объект.ИсторияКПП.НайтиСтроки(СтруктураОтбора);
			
			// смотрим нашли или нет
			Если НайденныеСтроки.Количество() > 0 Тогда
				// получаем строку
				ТекСтрока = НайденныеСтроки[0];
				ТекСтрока.КПП = Объект.КПП;
			Иначе
				// добавляем строку
				НоваяСтрока = Объект.ИсторияКПП.Добавить();
				НоваяСтрока.Период = Дата("00010101");
				НоваяСтрока.КПП = Объект.КПП;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	ЗащитаПерсональныхДанных.ДобавитьКомандуПечатиСогласияНаОбработкуПерсональныхДанных(КомандыПечати);
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		Неопределено,
		"ПФ_MXL_КарточкаКлиента",
		НСтр("ru = 'Карточка клиента'"),
		СсылкаНаДокумент,
		"УправлениеПечатиЭтикетокИЦенниковКлиент.ПодготовкаПечатиКарточкиКлиента",
		,,,,,,,,,,,
		99);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	ПараметрыКоманд.Вставить("СогласиеНаОбработкуПерсональныхДанных.Доступность", (НЕ Объект.ЭтоГруппа И (Объект.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо ИЛИ Объект.ФормаСобственности = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель)));
	ПараметрыКоманд.Вставить("ПФ_MXL_КарточкаКлиента.Доступность", НЕ Объект.ЭтоГруппа);
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#Область Обновление

Процедура НачальноеЗаполнениеДокументовСогласиеНаОбработкуПерсональныхДанных () Экспорт;
	
	Ответственный     = Пользователи.ТекущийПользователь();
	Организация       = Справочники.Организации.ОсновнаяОрганизация;
	ДанныеОрганизации = ЗащитаПерсональныхДанных.ОписаниеДанныхОрганизации();
	ЗащитаПерсональныхДанныхПереопределяемый.ДополнитьДанныеОрганизацииОператораПерсональныхДанных(Организация, ДанныеОрганизации, ТекущаяДатаСеанса());
	ЮридическийАдресОрганизации                = ДанныеОрганизации.АдресОрганизации;
	ОтветственныйЗаОбработкуПерсональныхДанных = ДанныеОрганизации.ОтветственныйЗаОбработкуПерсональныхДанных;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Организация КАК Организация,
	|	&ЮридическийАдресОрганизации КАК ЮридическийАдресОрганизации,
	|	&ОтветственныйЗаОбработкуПерсональныхДанных КАК ОтветственныйЗаОбработкуПерсональныхДанных,
	|	Контрагенты.Ссылка КАК Субъект,
	|	Контрагенты.Наименование КАК ФИОСубъекта,
	|	Адреса.Представление КАК АдресСубъекта,
	|	ПодтверждающиеДокументы.Наименование КАК ПаспортныеДанные,
	|	Контрагенты.УдалитьСогласиеНаОбработкуПерсональныхДанныхДата КАК ДатаПолучения,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК СрокДействия,
	|	&Ответственный КАК Ответственный
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СогласияНаОбработкуПерсональныхДанных КАК СогласияНаОбработкуПерсональныхДанных
	|		ПО Контрагенты.Ссылка = СогласияНаОбработкуПерсональныхДанных.Субъект
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|		ПО (ПодтверждающиеДокументы.Владелец = Контрагенты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК Адреса
	|		ПО Контрагенты.Ссылка = Адреса.Ссылка
	|ГДЕ
	|	Контрагенты.ПометкаУдаления = ЛОЖЬ
	|	И Контрагенты.УдалитьСогласиеНаОбработкуПерсональныхДанных = ЗНАЧЕНИЕ(Перечисление.ВариантыОтветов.Да)
	|	И (Контрагенты.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ИндивидуальныйПредприниматель)
	|			ИЛИ Контрагенты.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо))
	|	И СогласияНаОбработкуПерсональныхДанных.Субъект ЕСТЬ NULL
	|	И НЕ ПодтверждающиеДокументы.Устаревший
	|	И (ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт)
	|			ИЛИ ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Удостоверение)
	|			ИЛИ ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.ВоенныйБилет)
	|			ИЛИ ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.ВидНаЖительствоИностранногоГражданина))
	|	И Адреса.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И ВЫБОР
	|			КОГДА Адреса.Ссылка.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ИндивидуальныйПредприниматель)
	|					ИЛИ Адреса.Ссылка.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)
	|				ТОГДА Адреса.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента)
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	Запрос.УстановитьПараметр("ОтветственныйЗаОбработкуПерсональныхДанных", ОтветственныйЗаОбработкуПерсональныхДанных);
	Запрос.УстановитьПараметр("ЮридическийАдресОрганизации", ЮридическийАдресОрганизации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НовыйДокумент = Документы.СогласиеНаОбработкуПерсональныхДанных.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(НовыйДокумент,Выборка);
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Обработчик события возникающего при изменении данных реквизита "ПодразделениеКомпании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Вызываем общий обработчик события
	ОбработкаСобытийСправочникаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.СтрокаПоиска) И НЕ УправлениеДиалогомКлиентСервер.ПравоПользователяКлиент("ВводДокументовДляВсехКонтрагентов") Тогда
		
		Запрос = Новый ПостроительЗапроса(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Пользователи.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ СотрудникиПользователя
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Кураторы.Контрагент КАК Контрагент
		|ПОМЕСТИТЬ ОтобранныеКонтрагенты
		|ИЗ
		|	РегистрСведений.Кураторы КАК Кураторы
		|ГДЕ
		|	Кураторы.Куратор В
		|			(ВЫБРАТЬ
		|				СотрудникиПользователя.Сотрудник КАК Сотрудник
		|			ИЗ
		|				СотрудникиПользователя КАК СотрудникиПользователя)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СотрудникиПользователя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
		|	ОтобранныеКонтрагенты.Контрагент.Наименование КАК Представление,
		|	ОтобранныеКонтрагенты.Контрагент КАК Значение
		|ИЗ
		|	ОтобранныеКонтрагенты КАК ОтобранныеКонтрагенты
		|ГДЕ
		|	ОтобранныеКонтрагенты.Контрагент.Наименование ПОДОБНО &СтрокаПоиска
		|{
		|ГДЕ
		|	ОтобранныеКонтрагенты.Контрагент.ВидКонтрагента КАК ВидКонтрагента,
		|	ОтобранныеКонтрагенты.Контрагент.ФормаСобственности КАК ФормаСобственности
		|}");
		
		Запрос.ЗаполнитьНастройки();
		Запрос.Параметры.Вставить("Пользователь", ПараметрыСеанса.ТекущийПользователь);
		Запрос.Параметры.Вставить("СтрокаПоиска", Параметры.СтрокаПоиска + "%");
		ОбластьПоискаПолей = Запрос.ДоступныеПоля;
		
		Для Каждого КлючЗначение Из Параметры.Отбор Цикл
			
			Если ОбластьПоискаПолей.Найти(КлючЗначение.Ключ) <> Неопределено Тогда
				
				НовыйОтбор = Запрос.Отбор.Добавить(КлючЗначение.Ключ, КлючЗначение.Ключ);
				НовыйОтбор.Использование = Истина;
				
				Если ТипЗнч(КлючЗначение.Значение) = Тип("ФиксированныйМассив") Тогда
					
					НовыйОтбор.ВидСравнения = ВидСравнения.ВСписке;
					ЗначениеСписок = Новый СписокЗначений;
					ЗначениеСписок.ЗагрузитьЗначения(Новый Массив(КлючЗначение.Значение));
					НовыйОтбор.Значение = ЗначениеСписок;
					
				Иначе
					
					НовыйОтбор.ВидСравнения = ВидСравнения.Равно;
					НовыйОтбор.Значение = КлючЗначение.Значение;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Запрос.Выполнить();
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		
		Если НЕ Запрос.Результат.Пустой() Тогда
			
			Выборка = Запрос.Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Представление = Новый ФорматированнаяСтрока(
					Новый ФорматированнаяСтрока(
						Лев(Выборка.Представление, СтрДлина(Параметры.СтрокаПоиска)),
						Новый Шрифт(,, Истина),
						ЦветаСтиля.РезультатУспехЦвет),
					Сред(Выборка.Представление, СтрДлина(Параметры.СтрокаПоиска) + 1));
					
				ДанныеВыбора.Добавить(Выборка.Значение, Представление);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПолучитьЗначениеПараметраСтруктуры(Параметры, "РежимВыбораКонтактов", Ложь) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактныеЛица.КонтактноеЛицо
		|ИЗ
		|	РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.Владелец = &Владелец
		|	И (КонтактныеЛица.КонтактноеЛицо.Наименование ПОДОБНО &Наименование
		|	ИЛИ КонтактныеЛица.КонтактноеЛицо.НаименованиеПолное ПОДОБНО &Наименование)";
		
		Запрос.УстановитьПараметр("Наименование", Параметры.СтрокаПоиска + "%");
		
		КонтрагентВладелец = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Контрагент", Неопределено);
		Запрос.УстановитьПараметр("Владелец", КонтрагентВладелец);
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КонтактноеЛицо"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
