// Модуль объекта справочника "Контрагенты"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Сотрудники"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Сотрудники(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийСправочникаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Заполняем специфические для данного объекта реквизиты
	Наименование       = ДанныеЗаполнения.Наименование;
	НаименованиеПолное = ДанныеЗаполнения.Наименование;
	ВидКонтрагента     = Перечисления.ВидыКонтрагентов.ПодотчетноеЛицо;
	ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
	Родитель           = Справочники.Контрагенты.НайтиПоНаименованию("Сотрудники", ИСТИНА);
	Сотрудник          = ДанныеЗаполнения;
	
	// Заполнение реквизитов "Фамилия", "Имя", "Отчество"
	Справочники.Контрагенты.НаименованиеПолноеПриИзменении(ЭтотОбъект, Неопределено);

	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Сотрудники()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для формирования наименования/кода нового элемента.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполняем специфические для данного объекта реквизиты
	Если НЕ ЭтоГруппа Тогда
		
		Если НЕ ЗначениеЗаполнено(ВидКонтрагента) Тогда
			
			ВидКонтрагента = Родитель.ВидКонтрагента;
			
			Если НЕ ЗначениеЗаполнено(ВидКонтрагента) Тогда
				
				ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ФормаСобственности) Тогда
			
			ФормаСобственности = Родитель.ФормаСобственности;
			
			Если НЕ ЗначениеЗаполнено(ФормаСобственности) Тогда
				
				ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ФормаСобственности) Тогда
			
			Пол = Перечисления.ПолФизическихЛиц.НеУказан;
		КонецЕсли;
		
		ОбъектКодПоОКПО = "";
		КодИМНС = "";
		ИНН = "";
		КПП = "";
		ОсновнойБанковскийСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
		РекламныйИсточник = Справочники.ИсточникиИнформации.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Фамилия) И НЕ ЗначениеЗаполнено(Имя) И НЕ ЗначениеЗаполнено(Отчество) И НЕ ЭтотОбъект.ЭтоГруппа Тогда
		Справочники.Контрагенты.НаименованиеПолноеПриИзменении(ЭтотОбъект, Неопределено);
	КонецЕсли;
	
	// +Софтфон
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Звонок") Тогда
		Наименование = ДанныеЗаполнения.Наименование;
		НоваяКИ = КонтактнаяИнформация.Добавить();
		НоваяКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		НоваяКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(ДанныеЗаполнения.Телефон);
		НоваяКИ.НомерТелефона = ДанныеЗаполнения.Телефон;
		НоваяКИ.НомерТелефонаБезКодов = СтруктураНомера.НомерТелефона;
		Если ЗначениеЗаполнено(СтруктураНомера.КодГорода) Тогда
			НоваяКИ.Представление	= СтруктураНомера.КодСтраны + " (" + СтруктураНомера.КодГорода + ") " + СтруктураНомера.НомерТелефона;
		Иначе	
			НоваяКИ.Представление	= ДанныеЗаполнения.Телефон;
		КонецЕсли;	
		ЗначенияПолей	= Новый СписокЗначений;
		ЗначенияПолей.Добавить(СтруктураНомера.КодСтраны,		"КодСтраны");
		ЗначенияПолей.Добавить(СтруктураНомера.КодГорода,		"КодГорода");
		ЗначенияПолей.Добавить(СтруктураНомера.НомерТелефона,	"НомерТелефона");
		НоваяКИ.ЗначенияПолей	= ЗначенияПолей;
	КонецЕсли;
	// -Софтфон
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - СправочникОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		КодПоОКПО                     = "";
		КодИМНС                       = "";
		ИНН                           = "";
		КПП                           = "";
		ОсновнойБанковскийСчет        = Справочники.БанковскиеСчета.ПустаяСсылка();
		ОсвобожденОтНДС               = ЛОЖЬ;
		РекламныйИсточник             = Справочники.ИсточникиИнформации.ПустаяСсылка();
		// тк+
		ИдентификаторНачальнойЗагрузки="";
		// тк-
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи объекта.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		Если ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
			Если НЕ ЗначениеЗаполнено(Фамилия) И НЕ ЗначениеЗаполнено(Имя) И НЕ ЗначениеЗаполнено(Отчество) Тогда
				ВывестиСообщение(НСтр("ru='Одно из полей ФИО должно быть заполнено.'"),,,,Отказ);
			КонецЕсли;
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередЗаписью(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПередЗаписью(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Ссылка.Пустая() Тогда
		итРассылкаПФ_ЗаказПоставщику = Истина;	
	КонецЕсли;
	
	ЗаписьИзФормы = ДополнительныеСвойства.Свойство("ЗаписьИзФормы") И ДополнительныеСвойства.ЗаписьИзФормы;
	Если НЕ ЭтоГруппа И НЕ Отказ И НЕ ЗаписьИзФормы И НЕ ПометкаУдаления Тогда
		ВыполнятьПоиск = ПравоПользователя("ВыполнятьПоискДублейПередЗаписьюНовогоКонтрагента",ЭтотОбъект);
		Если НЕ (ВыполнятьПоиск = Перечисления.ВидыКонтроля.НеКонтролировать) Тогда
			СтруктураПоиска = Новый Структура;
			Если НЕ ПустаяСтрока(ДатаРождения) Тогда
				СтруктураПоиска.Вставить("УсловиеДляФизЛица", Новый Структура("Наименование,НаименованиеПолное,ДатаРождения", "Подобно", "Подобно", "="));
			КонецЕсли;
			Если НЕ ПустаяСтрока(ИНН) Тогда
				СтруктураПоиска.Вставить("УсловиеПоКПП",Новый Структура("ИНН,КПП", "=", "="));
				Если НЕ ПустаяСтрока(КПП) Тогда
					СтруктураПоиска.Вставить("ИНН", "=");
				КонецЕсли;
			КонецЕсли;
			СписокКонтактов = Новый СписокЗначений;
			СписокДублей = Справочники.Контрагенты.НайтиДубли(СтруктураПоиска,СписокКонтактов, ЭтотОбъект);
			Если ЗначениеЗаполнено(СписокДублей) Тогда
				
				Если ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
					 ВывестиСообщение(НСтр("ru = 'В информационной базе уже зарегистрирован контрагент с указанными Наименованием, Полным наименованием и Датой рождения'"),
						ЭтотОбъект,"Наименование");
				Иначе
					ВывестиСообщение(НСтр("ru = 'В информационной базе уже зарегистрирован контрагент с указанными ИНН и КПП'"),
						ЭтотОбъект,"ИНН");
				КонецЕсли;
					
				Если ПравоПользователя("ЗапретитьСохранениеДублейКонтрагентов", ЭтотОбъект) Тогда
						Отказ = Истина;
				КонецЕсли;
	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Для формы собственности "частное лицо" всегда устанавливаем "ОсвобожденОтНДС" в Истина.
	Если (НЕ ЭтоГруппа) И ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо  Тогда
		ОсвобожденОтНДС = ИСТИНА;
	КонецЕсли;
	
	РедактированиеИстории.ПередЗаписью(ЭтотОбъект);
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;	

КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Почистим регистры сведений от удаляемого объекта
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	сфпИсторияЗвонков.ДатаНачала КАК ДатаНачала,
	               |	сфпИсторияЗвонков.НомерТелефона КАК НомерТелефона,
	               |	сфпИсторияЗвонков.Звонок КАК Звонок,
	               |	""сфпИсторияЗвонков"" КАК ИмяРегистра
	               |ИЗ
	               |	РегистрСведений.сфпИсторияЗвонков КАК сфпИсторияЗвонков
	               |ГДЕ
	               |	сфпИсторияЗвонков.АбонентКонтакт = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	сфпЗаписиТелефонныхПереговоров.ИдентификаторЗвонка КАК ИдентификаторЗвонка,
	               |	сфпЗаписиТелефонныхПереговоров.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
	               |	""сфпЗаписиТелефонныхПереговоров"" КАК ИмяРегистра
	               |ИЗ
	               |	РегистрСведений.сфпЗаписиТелефонныхПереговоров КАК сфпЗаписиТелефонныхПереговоров
	               |ГДЕ
	               |	сфпЗаписиТелефонныхПереговоров.Контакт = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	Для каждого РезультатЗапроса Из РезультатыЗапросов Цикл
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений[Выборка.ИмяРегистра].СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			МенеджерЗаписи.Удалить();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ПередУдалением()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ


#КонецЕсли