// Модуль менеджера документа "Закрытие смены"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	ИтогиОперации.Вставить("СуммаДокумента", Объект.Товары.Итог("СуммаВсего")+Объект.Оплаты.Итог("СуммаОплата")-Объект.Оплаты.Итог("СуммаВозвратОплата")-Объект.Возвраты.Итог("СуммаВсего")-Объект.ВозвратОплаты.Итог("СуммаОплата"));
	
	// Производим установку полученных значений в итоговые показатели объекта
	Если НЕ Расширенные Тогда
		Возврат ИтогиОперации;
	КонецЕсли;
	
	// Формируем перечень расширенной информации об итогах операции
	ИтогиОперации.Вставить("СуммаНДС",    Объект.Товары.Итог("СуммаНДС") - Объект.Возвраты.Итог("СуммаНДС"));
	ИтогиОперации.Вставить("СуммаБезНДС", ИтогиОперации.СуммаДокумента-ИтогиОперации.СуммаНДС);
		
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

Функция ПолучитьТекстЗапросаДляСверткиЧеков()
	
	Возврат 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекиККМ.КассаККМ КАК КассаККМ,
	|	ЧекиККМ.Документ КАК Документ,
	|	ЧекиККМ.ЭтоВозврат КАК ЭтоВозврат,
	|	ЧекиККМ.Контрагент КАК Контрагент,
	|	ЧекиККМ.Карточка КАК Карточка,
	|	ЧекиККМ.СкидкаНаценка КАК СкидкаНаценка,
	|	ЧекТовары.Номенклатура КАК Номенклатура,
	|	ЧекТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЧекТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЧекТовары.Коэффициент КАК Коэффициент,
	|	ЧекТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЧекТовары.СкидкаНаТовар КАК СкидкаНаТовар,
	|	ЧекТовары.МестоРазмещения КАК МестоРазмещения,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА 0
	|		ИНАЧЕ ЧекТовары.Количество
	|	КОНЕЦ КАК КоличествоПродано,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА ЧекТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоВозврат,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА 0
	|		ИНАЧЕ ЧекТовары.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА 0
	|		ИНАЧЕ ЧекТовары.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА 0
	|		ИНАЧЕ ЧекТовары.СуммаСкидки
	|	КОНЕЦ КАК СуммаСкидки,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА 0
	|		ИНАЧЕ ЧекТовары.СуммаСкидкиСтроки
	|	КОНЕЦ КАК СуммаСкидкиСтроки,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА 0
	|		ИНАЧЕ ЧекТовары.СуммаВсего
	|	КОНЕЦ КАК СуммаВсего,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА 0
	|		ИНАЧЕ ЧекТовары.Количество
	|	КОНЕЦ * ЧекТовары.Коэффициент КАК КоличествоНоменклатуры,
	|	ЧекиККМ.КоличествоЧеков КАК КоличествоЧеков,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА ЧекТовары.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВозврата,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА ЧекТовары.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДСВозврата,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА ЧекТовары.СуммаСкидки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаСкидкиВозврата,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА ЧекТовары.СуммаСкидкиСтроки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаСкидкиСтрокиВозврата,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА ЧекТовары.СуммаВсего
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВсегоВозврата,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА ЧекТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ * ЧекТовары.Коэффициент КАК КоличествоНоменклатрыВозврата,
	|	ЧекиККМ.НомерФискальногоЧека КАК НомерФискальногоЧека,
	|	ЧекиККМ.ДатаРеализации КАК ДатаРеализации
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	(ВЫБРАТЬ
	|		Документы.КассаККМ КАК КассаККМ,
	|		Документы.ФР КАК ФР,
	|		Документы.Документ КАК Документ,
	|		Документы.Дата КАК Дата,
	|		Документы.Проведен КАК Проведен,
	|		Документы.ЭтоВозврат КАК ЭтоВозврат,
	|		Документы.ЭтоПродажа КАК ЭтоПродажа,
	|		Документы.Пробит КАК Пробит,
	|		Документы.КоличествоЧеков КАК КоличествоЧеков,
	|		Документы.СуммаПродаж КАК СуммаПродаж,
	|		Документы.СуммаДокумента КАК СуммаДокумента,
	|		Документы.Контрагент КАК Контрагент,
	|		Документы.Карточка КАК Карточка,
	|		Документы.СкидкаНаценка КАК СкидкаНаценка,
	|		Документы.НомерФискальногоЧека КАК НомерФискальногоЧека,
	|		Документы.ДатаРеализации КАК ДатаРеализации
	|	ИЗ
	|		Документы КАК Документы
	|	ГДЕ
	|		Документы.Проведен
	|		И Документы.ЭтоПродажа) КАК ЧекиККМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Чек.Товары КАК ЧекТовары
	|		ПО ЧекиККМ.Документ = ЧекТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документы.КассаККМ КАК КассаККМ,
	|	ВЫБОР
	|		КОГДА НЕ ЧекОплаты.ТипОплаты ЕСТЬ NULL
	|			ТОГДА ЧекОплаты.ТипОплаты
	|		КОГДА НЕ ЧекНаОплатуОплаты.ТипОплаты ЕСТЬ NULL
	|			ТОГДА ЧекНаОплатуОплаты.ТипОплаты
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТипыОплат.Наличные)
	|	КОНЕЦ КАК ТипОплаты,
	|	ВЫБОР
	|		КОГДА НЕ ЧекОплаты.ТипПлатежнойКарты ЕСТЬ NULL
	|			ТОГДА ЧекОплаты.ТипПлатежнойКарты
	|		КОГДА НЕ ЧекНаОплатуОплаты.ТипПлатежнойКарты ЕСТЬ NULL
	|			ТОГДА ЧекНаОплатуОплаты.ТипПлатежнойКарты
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТипыПлатежныхКарт.ПустаяСсылка)
	|	КОНЕЦ КАК ТипПлатежнойКарты,
	|	ВЫБОР
	|		КОГДА НЕ ЧекОплаты.Карточка ЕСТЬ NULL
	|			ТОГДА ЧекОплаты.Карточка
	|		КОГДА НЕ ЧекНаОплатуОплаты.Карточка ЕСТЬ NULL
	|			ТОГДА ЧекНаОплатуОплаты.Карточка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Карточки.ПустаяСсылка)
	|	КОНЕЦ КАК Карточка,
	|	ВЫБОР
	|		КОГДА НЕ ЧекОплаты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЧекОплаты.Контрагент
	|		КОГДА НЕ ЧекНаОплатуОплаты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЧекНаОплатуОплаты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА НЕ ЧекОплаты.ДоговорВзаиморасчетов ЕСТЬ NULL
	|			ТОГДА ЧекОплаты.ДоговорВзаиморасчетов
	|		КОГДА НЕ ЧекНаОплатуОплаты.ДоговорВзаиморасчетов ЕСТЬ NULL
	|			ТОГДА ЧекНаОплатуОплаты.ДоговорВзаиморасчетов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА Документы.ЭтоПродажа
	|			ТОГДА Документы.КоличествоЧеков
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЧеков,
	|	ВЫБОР
	|		КОГДА Документы.ЭтоВозврат
	|				ИЛИ НЕ Документы.ЭтоПродажа
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ЧекОплаты.Сумма, 0) - ЕСТЬNULL(ЧекОплаты.Сдача, 0)
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА НЕ Документы.ЭтоВозврат
	|				ИЛИ НЕ Документы.ЭтоПродажа
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ЧекОплаты.Сумма, 0) - ЕСТЬNULL(ЧекОплаты.Сдача, 0)
	|	КОНЕЦ КАК СуммаВозврат,
	|	ВЫБОР
	|		КОГДА НЕ Документы.ЭтоПродажа
	|			ТОГДА Документы.КоличествоЧеков
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЧековОплата,
	|	ВЫБОР
	|		КОГДА Документы.ЭтоВозврат
	|				ИЛИ Документы.ЭтоПродажа
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ЧекНаОплатуОплаты.Сумма, Документы.СуммаДокумента) - ЕСТЬNULL(ЧекНаОплатуОплаты.Сдача, 0)
	|	КОНЕЦ КАК СуммаОплата,
	|	ВЫБОР
	|		КОГДА НЕ Документы.ЭтоВозврат
	|				ИЛИ Документы.ЭтоПродажа
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ЧекНаОплатуОплаты.Сумма, Документы.СуммаДокумента) - ЕСТЬNULL(ЧекНаОплатуОплаты.Сдача, 0)
	|	КОНЕЦ КАК СуммаВозвратОплата,
	|	ВЫБОР
	|		КОГДА Документы.ЭтоВозврат
	|			ТОГДА Документы.КоличествоЧеков
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоВозврат
	|ПОМЕСТИТЬ Оплаты
	|ИЗ
	|	Документы КАК Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Чек.Оплаты КАК ЧекОплаты
	|		ПО Документы.Документ = ЧекОплаты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекНаОплату.Оплаты КАК ЧекНаОплатуОплаты
	|		ПО Документы.Документ = ЧекНаОплатуОплаты.Ссылка
	|ГДЕ
	|	Документы.Проведен
	|	И Документы.НеУчтен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Документы.Дата КАК Дата
	|ИЗ
	|	Документы КАК Документы
	|ГДЕ
	|	Документы.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.Коэффициент КАК Коэффициент,
	|	Товары.МестоРазмещения КАК МестоРазмещения,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(Товары.КоличествоПродано) КАК Количество,
	|	СУММА(Товары.Сумма) КАК Сумма,
	|	СУММА(Товары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(Товары.СуммаСкидки + Товары.СуммаСкидкиСтроки) КАК СуммаСкидки,
	|	СУММА(Товары.СуммаВсего) КАК СуммаВсего,
	|	СУММА(Товары.КоличествоЧеков) КАК КоличествоЧеков
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	Товары.КоличествоПродано <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.Коэффициент,
	|	Товары.МестоРазмещения,
	|	Товары.ХарактеристикаНоменклатуры,
	|	Товары.СтавкаНДС
	|
	|УПОРЯДОЧИТЬ ПО
	|	МестоРазмещения,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	Коэффициент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Оплаты.КассаККМ КАК Касса,
	|	Оплаты.ТипОплаты КАК ТипОплаты,
	|	Оплаты.ТипПлатежнойКарты КАК ТипПлатежнойКарты,
	|	Оплаты.Карточка КАК Карточка,
	|	Оплаты.Контрагент КАК Контрагент,
	|	Оплаты.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	СУММА(Оплаты.КоличествоЧеков) КАК КоличествоЧеков,
	|	СУММА(Оплаты.Сумма) КАК Сумма,
	|	СУММА(0) КАК СуммаВозврат,
	|	СУММА(Оплаты.КоличествоЧековОплата) КАК КоличествоЧековОплата,
	|	СУММА(Оплаты.СуммаОплата) КАК СуммаОплата,
	|	СУММА(0) КАК СуммаВозвратОплата
	|ИЗ
	|	Оплаты КАК Оплаты
	|ГДЕ
	|	НЕ(Оплаты.Сумма = 0
	|				И Оплаты.СуммаОплата = 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	Оплаты.КассаККМ,
	|	Оплаты.ТипОплаты,
	|	Оплаты.ТипПлатежнойКарты,
	|	Оплаты.Карточка,
	|	Оплаты.Контрагент,
	|	Оплаты.ДоговорВзаиморасчетов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Оплаты.КассаККМ,
	|	ТипОплаты,
	|	ТипПлатежнойКарты,
	|	Карточка,
	|	Контрагент,
	|	ДоговорВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Скидки.СкидкаНаценка КАК СкидкаНаценка,
	|	СУММА(Скидки.Сумма) КАК Сумма,
	|	СУММА(Скидки.СуммаСкидки) КАК СуммаСкидки,
	|	СУММА(Скидки.СуммаВсего) КАК СуммаВсего,
	|	Скидки.Карточка КАК Карточка,
	|	СУММА(Скидки.КоличествоЧеков) КАК КоличествоЧеков
	|ИЗ
	|	(ВЫБРАТЬ
	|		Товары.СкидкаНаценка КАК СкидкаНаценка,
	|		Товары.Сумма - Товары.СуммаВозврата КАК Сумма,
	|		Товары.СуммаСкидки - Товары.СуммаСкидкиВозврата КАК СуммаСкидки,
	|		Товары.СуммаВсего - Товары.СуммаВсегоВозврата КАК СуммаВсего,
	|		Товары.Карточка КАК Карточка,
	|		Товары.КоличествоЧеков КАК КоличествоЧеков
	|	ИЗ
	|		Товары КАК Товары
	|	ГДЕ
	|		НЕ Товары.СкидкаНаценка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.ПустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Товары.СкидкаНаТовар,
	|		Товары.Сумма - Товары.СуммаВозврата,
	|		Товары.СуммаСкидкиСтроки - Товары.СуммаСкидкиСтрокиВозврата,
	|		Товары.СуммаВсего - Товары.СуммаВсегоВозврата,
	|		Товары.Карточка,
	|		Товары.КоличествоЧеков
	|	ИЗ
	|		Товары КАК Товары
	|	ГДЕ
	|		НЕ Товары.СкидкаНаТовар = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.ПустаяСсылка)) КАК Скидки
	|
	|СГРУППИРОВАТЬ ПО
	|	Скидки.СкидкаНаценка,
	|	Скидки.Карточка
	|
	|УПОРЯДОЧИТЬ ПО
	|	СкидкаНаценка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Товары.Контрагент КАК Контрагент,
	|	Товары.Карточка КАК Карточка,
	|	СУММА(Товары.Сумма - Товары.СуммаВозврата) КАК Сумма,
	|	СУММА(Товары.СуммаСкидки + Товары.СуммаСкидкиСтроки - Товары.СуммаСкидкиВозврата - Товары.СуммаСкидкиСтрокиВозврата) КАК СуммаСкидки,
	|	СУММА(Товары.СуммаВсего - Товары.СуммаВсегоВозврата) КАК СуммаВсего,
	|	СУММА(ВЫБОР
	|			КОГДА Товары.ЭтоВозврат
	|				ТОГДА -Товары.КоличествоЧеков
	|			ИНАЧЕ Товары.КоличествоЧеков
	|		КОНЕЦ) КАК КоличествоЧеков,
	|	СУММА(Товары.КоличествоНоменклатуры - Товары.КоличествоНоменклатрыВозврата) КАК КоличествоНоменклатуры
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	НЕ Товары.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Контрагент,
	|	Товары.Карточка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Карточка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Товары.КассаККМ КАК КассаККМ,
	|	ЧекДополнительныеРеквизиты.Значение КАК Свойство,
	|	СУММА(Товары.Сумма) КАК Сумма,
	|	СУММА(Товары.СуммаСкидки + Товары.СуммаСкидкиСтроки) КАК СуммаСкидки,
	|	СУММА(Товары.СуммаВсего) КАК СуммаВсего,
	|	СУММА(Товары.КоличествоЧеков) КАК КоличествоЧеков
	|ИЗ
	|	Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Чек.ДополнительныеРеквизиты КАК ЧекДополнительныеРеквизиты
	|		ПО Товары.Документ = ЧекДополнительныеРеквизиты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.КассаККМ,
	|	ЧекДополнительныеРеквизиты.Значение
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассаККМ,
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документы.Документ КАК Документ
	|ИЗ
	|	Документы КАК Документы
	|ГДЕ
	|	Документы.ЭтоПродажа
	|	И Документы.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.Коэффициент КАК Коэффициент,
	|	Товары.МестоРазмещения КАК МестоРазмещения,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(Товары.КоличествоВозврат) КАК Количество,
	|	СУММА(Товары.СуммаВозврата) КАК Сумма,
	|	СУММА(Товары.СуммаНДСВозврата) КАК СуммаНДС,
	|	СУММА(Товары.СуммаСкидкиВозврата + Товары.СуммаСкидкиСтрокиВозврата) КАК СуммаСкидки,
	|	СУММА(Товары.СуммаВсегоВозврата) КАК СуммаВсего,
	|	СУММА(Товары.КоличествоЧеков) КАК КоличествоЧеков,
	|	Товары.НомерФискальногоЧека КАК НомерФискальногоЧека,
	|	Товары.ДатаРеализации КАК ДатаРеализации
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	НЕ Товары.КоличествоВозврат = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.Коэффициент,
	|	Товары.МестоРазмещения,
	|	Товары.ХарактеристикаНоменклатуры,
	|	Товары.СтавкаНДС,
	|	Товары.НомерФискальногоЧека,
	|	Товары.ДатаРеализации
	|
	|УПОРЯДОЧИТЬ ПО
	|	МестоРазмещения,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	Коэффициент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Оплаты.КассаККМ КАК Касса,
	|	Оплаты.ТипОплаты КАК ТипОплаты,
	|	Оплаты.ТипПлатежнойКарты КАК ТипПлатежнойКарты,
	|	Оплаты.Карточка КАК Карточка,
	|	Оплаты.Контрагент КАК Контрагент,
	|	Оплаты.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	СУММА(Оплаты.КоличествоВозврат) КАК КоличествоЧеков,
	|	СУММА(Оплаты.СуммаВозврат) КАК Сумма,
	|	СУММА(Оплаты.КоличествоЧековОплата) КАК КоличествоЧековОплата,
	|	СУММА(Оплаты.СуммаВозвратОплата) КАК СуммаОплата
	|ИЗ
	|	Оплаты КАК Оплаты
	|ГДЕ
	|	НЕ(Оплаты.СуммаВозврат = 0
	|				И Оплаты.СуммаВозвратОплата = 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	Оплаты.КассаККМ,
	|	Оплаты.ТипОплаты,
	|	Оплаты.ТипПлатежнойКарты,
	|	Оплаты.Карточка,
	|	Оплаты.Контрагент,
	|	Оплаты.ДоговорВзаиморасчетов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Оплаты.КассаККМ,
	|	ТипОплаты,
	|	ТипПлатежнойКарты,
	|	Карточка,
	|	Контрагент,
	|	ДоговорВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Оплаты";
	
КонецФункции // ПолучитьТекстЗапросаДляСверткиЧеков()

Функция ПолучитьЗапросПоИтогамСмены(Объект, ТекстЗапросаВыборки, КассаККМ=Неопределено) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ЗакрытиеСмены.ДатаПоследнегоДокумента) КАК ДатаПоследнегоДокумента,
	|	ЗакрытиеСмены.КассаККМ КАК КассаККМ
	|ПОМЕСТИТЬ КассыККМ
	|ИЗ
	|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	|ГДЕ
	|	ЗакрытиеСмены.Проведен
	|	И ЗакрытиеСмены.ДатаПоследнегоДокумента < &Дата
	|	И ЗакрытиеСмены.КассаККМ В(&КассыККМ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗакрытиеСмены.КассаККМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Чек.КассаККМ КАК КассаККМ,
	|	Чек.ФР КАК ФР,
	|	Чек.Ссылка КАК Документ,
	|	Чек.Дата КАК Дата,
	|	Чек.Проведен КАК Проведен,
	|	Чек.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекНаВозврат) КАК ЭтоВозврат,
	|	ИСТИНА КАК ЭтоПродажа,
	|	ИСТИНА КАК ЕстьОплаты,
	|	НЕ Чек.ДатаФР = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК Пробит,
	|	1 КАК КоличествоЧеков,
	|	Чек.СуммаДокумента КАК СуммаДокумента,
	|	Чек.Контрагент КАК Контрагент,
	|	Чек.Карточка КАК Карточка,
	|	Чек.СкидкаНаценка КАК СкидкаНаценка,
	|	ВЫБОР
	|		КОГДА Чек.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекНаВозврат)
	|			ТОГДА 0
	|		ИНАЧЕ Чек.СуммаДокумента
	|	КОНЕЦ КАК СуммаПродаж,
	|	ВЫБОР
	|		КОГДА Чек.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекНаВозврат)
	|			ТОГДА Чек.СуммаДокумента
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВозвратов,
	|	ВЫБОР
	|		КОГДА КассыККМ.КассаККМ ЕСТЬ NULL
	|				ИЛИ Чек.Дата > КассыККМ.ДатаПоследнегоДокумента
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеУчтен,
	|	Чек.НомерЧека КАК НомерФискальногоЧека,
	|	ВЫБОР
	|		КОГДА Чек.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекНаВозврат)
	|				И Чек.ДокументОснование ССЫЛКА Документ.Чек
	|			ТОГДА Чек.ДокументОснование.Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаРеализации
	|ПОМЕСТИТЬ Документы
	|ИЗ
	|	Документ.Чек КАК Чек
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассыККМ КАК КассыККМ
	|		ПО Чек.КассаККМ = КассыККМ.КассаККМ
	|ГДЕ
	|	НЕ Чек.ПометкаУдаления
	|	И Чек.Дата < &Дата
	|	И Чек.КассаККМ В(&КассыККМ)
	|	И НЕ Чек.Архивный
	|	И НЕ Чек.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекОтложенный)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекНаОплату.КассаККМ,
	|	ЧекНаОплату.ФР,
	|	ЧекНаОплату.Ссылка,
	|	ЧекНаОплату.Дата,
	|	ЧекНаОплату.Проведен,
	|	ЧекНаОплату.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекНаОплатуВозврат)
	|		ИЛИ ЧекНаОплату.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекНаОплатуПокупки),
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	НЕ ЧекНаОплату.ДатаФР = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
	|	1,
	|	ЧекНаОплату.СуммаДокумента,
	|	ЧекНаОплату.Контрагент,
	|	ЧекНаОплату.Карточка,
	|	ЧекНаОплату.СкидкаНаценка,
	|	ВЫБОР
	|		КОГДА ЧекНаОплату.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекНаОплатуВозврат)
	|			ТОГДА 0
	|		ИНАЧЕ ЧекНаОплату.СуммаДокумента
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЧекНаОплату.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекНаОплатуВозврат)
	|			ТОГДА ЧекНаОплату.СуммаДокумента
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КассыККМ.КассаККМ ЕСТЬ NULL
	|				ИЛИ ЧекНаОплату.Дата > КассыККМ.ДатаПоследнегоДокумента
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЧекНаОплату.НомерЧека,
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	Документ.ЧекНаОплату КАК ЧекНаОплату
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассыККМ КАК КассыККМ
	|		ПО ЧекНаОплату.КассаККМ = КассыККМ.КассаККМ
	|ГДЕ
	|	НЕ ЧекНаОплату.ПометкаУдаления
	|	И ЧекНаОплату.Дата < &Дата
	|	И ЧекНаОплату.КассаККМ В(&КассыККМ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.КассаККМ,
	|	ПриходныйКассовыйОрдер.ФР,
	|	ПриходныйКассовыйОрдер.Ссылка,
	|	ПриходныйКассовыйОрдер.Дата,
	|	ПриходныйКассовыйОрдер.Проведен,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	НЕ ПриходныйКассовыйОрдер.ДатаФР = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
	|	1,
	|	ПриходныйКассовыйОрдер.СуммаДокумента,
	|	ПриходныйКассовыйОрдер.Контрагент,
	|	NULL,
	|	NULL,
	|	ПриходныйКассовыйОрдер.СуммаДокумента,
	|	0,
	|	ВЫБОР
	|		КОГДА КассыККМ.КассаККМ ЕСТЬ NULL
	|				ИЛИ ПриходныйКассовыйОрдер.Дата > КассыККМ.ДатаПоследнегоДокумента
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ПриходныйКассовыйОрдер.НомерЧека,
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассыККМ КАК КассыККМ
	|		ПО ПриходныйКассовыйОрдер.КассаККМ = КассыККМ.КассаККМ
	|ГДЕ
	|	НЕ ПриходныйКассовыйОрдер.ПометкаУдаления
	|	И ПриходныйКассовыйОрдер.Дата < &Дата
	|	И ПриходныйКассовыйОрдер.КассаККМ В(&КассыККМ)
	|	И ПриходныйКассовыйОрдер.ДляПробитияНаФР
	|	И НЕ ПриходныйКассовыйОрдер.ДатаФР = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.КассаККМ,
	|	РасходныйКассовыйОрдер.ФР,
	|	РасходныйКассовыйОрдер.Ссылка,
	|	РасходныйКассовыйОрдер.Дата,
	|	РасходныйКассовыйОрдер.Проведен,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	НЕ РасходныйКассовыйОрдер.ДатаФР = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
	|	1,
	|	РасходныйКассовыйОрдер.СуммаДокумента,
	|	РасходныйКассовыйОрдер.Контрагент,
	|	NULL,
	|	NULL,
	|	0,
	|	РасходныйКассовыйОрдер.СуммаДокумента,
	|	ВЫБОР
	|		КОГДА КассыККМ.КассаККМ ЕСТЬ NULL
	|				ИЛИ РасходныйКассовыйОрдер.Дата > КассыККМ.ДатаПоследнегоДокумента
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	РасходныйКассовыйОрдер.НомерЧека,
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|		ЛЕВОЕ СОЕДИНЕНИЕ КассыККМ КАК КассыККМ
	|		ПО (КассыККМ.КассаККМ = КассыККМ.КассаККМ)
	|ГДЕ
	|	НЕ РасходныйКассовыйОрдер.ПометкаУдаления
	|	И РасходныйКассовыйОрдер.Дата < &Дата
	|	И РасходныйКассовыйОрдер.КассаККМ В(&КассыККМ)
	|	И РасходныйКассовыйОрдер.ДляПробитияНаФР
	|	И НЕ РасходныйКассовыйОрдер.ДатаФР = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)"
	
	+ Символы.ПС + "; "+ Символы.ПС + ТекстЗапросаВыборки + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ КассыККМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Документы";
	
	
	// Получим перечень касс по которым производится закрытие смены
	Если ЗначениеЗаполнено(КассаККМ) Тогда
		КассыККМ = КассаККМ;
	ИначеЕсли ЕстьРеквизит(Объект, , "КассыККМ") Тогда
		КассыККМ = Объект.КассыККМ.Выгрузить(Новый Структура("Использовать", 1), "КассаККМ").ВыгрузитьКолонку("КассаККМ");
	Иначе
		КассыККМ = Справочники.КассыККМ.ПустаяСсылка();
	КонецЕсли;
	
	// Производим корректировку даты закрытия смены
	Если НачалоДня(Объект.Дата)=НачалоДня(ТекущаяДатаСеанса()) Тогда
		Объект.Дата = ПолучитьОперативнуюОтметкуВремени();
	Иначе
		Объект.Дата = КонецДня(Объект.Дата);
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Дата",     Объект.Дата);
	Запрос.УстановитьПараметр("КассыККМ", КассыККМ);
	
	Возврат Запрос;
	
КонецФункции // ПолучитьЗапросПоИтогамСмены()

// Заполнение сведений о товарах и об оплатах
//
Процедура ЗаполнитьТабличныеЧастиДокумента(Объект, ПакетЗапросов) Экспорт
	
	// Заполним сведения о товарах
	Объект.Товары.Загрузить(ПакетЗапросов[5].Выгрузить());
	
	// Производим корректировку таблицы товаров
	Для каждого СтрокаТаблицыТоваров Из Объект.Товары Цикл
		СтрокаТаблицыТоваров.Цена          = ?(СтрокаТаблицыТоваров.Количество=0, 0, СтрокаТаблицыТоваров.Сумма/СтрокаТаблицыТоваров.Количество);
		СтрокаТаблицыТоваров.ПроцентСкидки = ?(СтрокаТаблицыТоваров.Сумма=0, 0, СтрокаТаблицыТоваров.СуммаСкидки*100/СтрокаТаблицыТоваров.Сумма);
	КонецЦикла;
	
	// Заполним сведения об оплатах
	Объект.Оплаты.Загрузить(ПакетЗапросов[6].Выгрузить());
	
	// Заполним сведения об оплатах
	Объект.Скидки.Загрузить(ПакетЗапросов[7].Выгрузить());
	
	// Заполним сведения об оплатах
	Объект.Контрагенты.Загрузить(ПакетЗапросов[8].Выгрузить());
	
	// Заполним сведения об оплатах
	Объект.Свойства.Загрузить(ПакетЗапросов[9].Выгрузить());
	
	// Заполним сведения о возвратах
	Объект.Возвраты.Загрузить(ПакетЗапросов[11].Выгрузить());
	
	// Производим корректировку таблицы возвратов
	Для каждого СтрокаТаблицыТоваров Из Объект.Возвраты Цикл
		СтрокаТаблицыТоваров.Цена          = ?(СтрокаТаблицыТоваров.Количество=0, 0, СтрокаТаблицыТоваров.Сумма/СтрокаТаблицыТоваров.Количество);
		СтрокаТаблицыТоваров.ПроцентСкидки = ?(СтрокаТаблицыТоваров.Сумма=0, 0, СтрокаТаблицыТоваров.СуммаСкидки*100/СтрокаТаблицыТоваров.Сумма);
	КонецЦикла;
	
	// Заполним сведения о возвратах оплаты
	Объект.ВозвратОплаты.Загрузить(ПакетЗапросов[12].Выгрузить());
	
КонецПроцедуры // ЗаполнитьТабличныеЧастиДокумента()

// Загрузка данными табличные части документа
//
Процедура ЗагрузитьЧекиПоКассеККМ(Объект) Экспорт
	
	Объект.Товары.Очистить();
	Объект.Возвраты.Очистить();
	Объект.Скидки.Очистить();
	Объект.Контрагенты.Очистить();
	Объект.Оплаты.Очистить();
	Объект.ВозвратОплаты.Очистить();
	Объект.Свойства.Очистить();
	
	// Выполним запрос и получим пакет результатов
	Запрос = ПолучитьЗапросПоИтогамСмены(Объект, ПолучитьТекстЗапросаДляСверткиЧеков(), Объект.КассаККМ);
	РезультатыПакета = Запрос.ВыполнитьПакет();
	
	ЗаполнитьТабличныеЧастиДокумента(Объект, РезультатыПакета);
	
КонецПроцедуры // ЗагрузитьЧекиПоКассеККМ()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("ВалютаДокумента");
	ОбязательныеРеквизиты.Добавить("КурсДокумента");
	ОбязательныеРеквизиты.Добавить("КассаККМ");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	
	Если Объект.ХозОперация = Справочники.ХозОперации.АктОРеализации Тогда
		ОбязательныеРеквизиты.Добавить("СкладКомпании");
	КонецЕсли;
	
	Если НЕ ПравоПользователя("ПроведениеНезаполненныхДокументов", Объект) Тогда
		ОбязательныеРеквизиты.Добавить("Товары");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов табличных частей
	УникальныеТабличныеЧасти=Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеТабличныеЧасти;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();
	КонтролируемыеРеквизиты.Вставить("КассаККМ", ЛОЖЬ);
	
	Если Объект.ХозОперация = Справочники.ХозОперации.АктОРеализации Тогда
		КонтролируемыеРеквизиты.Вставить("СкладКомпании", Ложь);
	Иначе
		КонтролируемыеРеквизитыТЧ = Новый Структура();
		КонтролируемыеРеквизитыТЧ.Вставить("МестоРазмещения", Ложь);
		КонтролируемыеРеквизиты.Вставить("Товары", КонтролируемыеРеквизитыТЧ);
		КонтролируемыеРеквизиты.Вставить("Возвраты", КонтролируемыеРеквизитыТЧ);
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", Объект.Товары.Количество() > 0);
	
	Возврат ПараметрыДействия;
	
КонецФункции

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Проект".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПроектПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПроектПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПроектПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Тип цен".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТипЦенПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ТипЦенПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ТипЦенПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Валюта".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВалютаДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ВалютаДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ВалютаДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Курс документа".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КурсДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.КурсДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // КурсДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Склад компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СкладКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.СкладКомпанииПриИзменении(Объект, ПараметрыДействия);
	
	// проверим склад
	Если ЗначениеЗаполнено(Объект.СкладКомпании) И Объект.ХозОперация = Справочники.ХозОперации.АктОРеализации И НЕ Объект.СкладКомпании.Розничный Тогда
		ТекстСообщения = НСтр("ru = 'Выбранный склад: <%1> не соответствует хоз. операции. Выберите розничный склад.'");
		ВывестиСообщение(ТекстСообщения, Объект, ,,,Объект.СкладКомпании);
		
		Объект.СкладКомпании = Неопределено;
		СкладКомпанииПриИзменении(Объект, ПараметрыДействия);
	КонецЕсли;
	
КонецПроцедуры // СкладКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Касса ККМ".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КассаККМПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.КассаККМПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // КассаККМПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыНоменклатураПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.НоменклатураПриИзменении(Объект, Строка, ПараметрыДействия);
	
	// Проверим, имеют ли смысл дальнейшие действия
	Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Отказ", ЛОЖЬ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Характеристика номенклатуры" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ХарактеристикаНоменклатурыПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыКоличествоПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.КоличествоПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыКоличествоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыЦенаПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ЦенаПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЦенаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСуммаПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.СуммаПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСтавкаНДСПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.СтавкаНДСПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСтавкаНДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма НДС" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСуммаНДСПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.СуммаНДСПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаНДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма всего" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСуммаВсегоПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.СуммаВсегоПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаВсегоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма скидки" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСуммаСкидкиПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ТоварыСтавкаНДСПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаСкидкиПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ВОЗВРАТЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в таблице "Возвраты".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВозвратыНоменклатураПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.НоменклатураПриИзменении(Объект, Строка, ПараметрыДействия, "Возвраты");
	
	// Проверим, имеют ли смысл дальнейшие действия
	Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Отказ", ЛОЖЬ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ВозвратыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Характеристика номенклатуры" в таблице "Возвраты".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВозвратыХарактеристикаНоменклатурыПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ХарактеристикаНоменклатурыПриИзменении(Объект, Строка, ПараметрыДействия, "Возвраты");
	
КонецПроцедуры // ВозвратыХарактеристикаНоменклатурыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в таблице "Возвраты".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВозвратыЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия, "Возвраты");
	
КонецПроцедуры // ВозвратыЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в таблице "Возвраты".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВозвратыКоличествоПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.КоличествоПриИзменении(Объект, Строка, ПараметрыДействия, "Возвраты");
	
КонецПроцедуры // ВозвратыКоличествоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена" в таблице "Возвраты".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВозвратыЦенаПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ЦенаПриИзменении(Объект, Строка, ПараметрыДействия, "Возвраты");
	
КонецПроцедуры // ВозвратыЦенаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма" в таблице "Возвраты".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВозвратыСуммаПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.СуммаПриИзменении(Объект, Строка, ПараметрыДействия, "Возвраты");
	
КонецПроцедуры // ВозвратыСуммаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в таблице "Возвраты".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВозвратыСтавкаНДСПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.СтавкаНДСПриИзменении(Объект, Строка, ПараметрыДействия, "Возвраты");
	
КонецПроцедуры // ВозвратыСтавкаНДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма НДС" в таблице "Возвраты".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВозвратыСуммаНДСПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.СуммаНДСПриИзменении(Объект, Строка, ПараметрыДействия, "Возвраты");
	
КонецПроцедуры // ВозвратыСуммаНДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма всего" в таблице "Возвраты".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВозвратыСуммаВсегоПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.СуммаВсегоПриИзменении(Объект, Строка, ПараметрыДействия, "Возвраты");
	
КонецПроцедуры // ВозвратыСуммаВсегоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма скидки" в таблице "Возвраты".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВозвратыСуммаСкидкиПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ВозвратыСтавкаНДСПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ВозвратыСуммаСкидкиПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.ЗакрытиеСмены",
		"ПФ_MXL_ЗакрытиеСмены",
		НСтр("ru = 'Закрытие смены'"),
		СсылкаНаДокумент);
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		Неопределено,
		"Ценники",
		НСтр("ru = 'Печать ценников'"),
		СсылкаНаДокумент,
		"УправлениеПечатиЭтикетокИЦенниковКлиент.ПодготовкаПечати",
		,,,,
		Ложь);
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		Неопределено,
		"Этикетки",
		НСтр("ru = 'Печать этикеток'"),
		СсылкаНаДокумент,
		"УправлениеПечатиЭтикетокИЦенниковКлиент.ПодготовкаПечати",
		,,,,
		Ложь);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ЗакрытиеСмены") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_ЗакрытиеСмены",
															НСтр("ru = 'Закрытие смены'"),
															ПечатьЗакрытиеСмены(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;	
КонецПроцедуры // Печать()

// функция печати макета "ЗакрытиеСмены" 
//
Функция ПечатьЗакрытиеСмены(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗакрытиеСмены_ЗакрытиеСмены";
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;

	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ФорматВыводаСуммы = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		
		// получим макет печатной формы
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗакрытиеСмены.ПФ_MXL_ЗакрытиеСмены");
		
		// Зададим параметры макета
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		// получение необходимых областей
		ОбластьШапкаТаблицы    = УправлениеПечатьюПлатформа.ПривестиМакетПечатнойФормы(Макет,Документ);
		ОбластьЗаголовок       = Макет.ПолучитьОбласть("Заголовок");
		ОбластьПодзаголовок     = Макет.ПолучитьОбласть("Подзаголовок");
		ОбластьСтрока          = Макет.ПолучитьОбласть("Строка");
		ОбластьИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("Подвал");
		ОбластьПодвал		   = Макет.ПолучитьОбласть("ПодвалПодписи");
		
		// область заголовок
		ОбластьЗаголовок.Параметры.Заполнить(Документ);
		ТекстЗаголовка = УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(Документ);
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		
		// дата документа
		ДатаДокумента = Документ.Дата;
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		Если ЗначениеЗаполнено(Документ.ПодразделениеКомпании) И ЗначениеЗаполнено(Документ.ПодразделениеКомпании.КПП) Тогда
		СтрокаПредставления = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
		ОбластьЗаголовок.Параметры.ПредставлениеОрганизации = СтрЗаменить(СтрокаПредставления, ОбщегоНазначения.ПолучитьКППНаДату(Документ.Организация, ДатаДокумента), ОбщегоНазначения.ПолучитьКППНаДату(Документ.ПодразделениеКомпании, ДатаДокумента));
		Иначе	
			ОбластьЗаголовок.Параметры.ПредставлениеОрганизации = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
		КонецЕсли;
		ОбластьЗаголовок.Параметры.ПредставлениеСклада			= УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Документ.СкладКомпании);
		
		// выводим свойства
		УправлениеПечатьюПлатформа.ЗаполнитьСвойствамиОбъекта(ОбластьЗаголовок, Документ);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ОбластьПодзаголовок.Параметры.ИмяТабличнойЧасти = НСтр("ru = 'Товары, реализованные розничному покупателю'");
		ТабличныйДокумент.Вывести(ОбластьПодзаголовок);
		
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		// готовим шапку
		НомерСтраницы = 2; НомерСтраницыПредыдущий = 2;
		СтруктураИтоговПоСтранице = Новый Структура();
		СтруктураИтоговПоСтранице.Вставить("ВалютаДокумента", Документ.ВалютаДокумента);
		СтруктураИтоговПоСтранице.Вставить("СуммаСкидки",     0);
		СтруктураИтоговПоСтранице.Вставить("СуммаНДС",        0);
		СтруктураИтоговПоСтранице.Вставить("СуммаВсего",      0);
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы;
		
		// заполняем ТЧ
		ВыборкаТабличнойЧасти = Документ.Товары;
		Для Каждого СтрокаТЧ Из ВыборкаТабличнойЧасти Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры,УправлениеПечатьюПлатформа.ЗаполнитьПредставлениеДанныхТоварнойСтроки(СтрокаТЧ,Документ));
			
			// доп. области
			мсвДопОбластиПодвала = Неопределено;
			Если Документ.Товары.Индекс(СтрокаТЧ) = Документ.Товары.Количество()-1 Тогда
				мсвДопОбластиПодвала = Новый Массив;
				мсвДопОбластиПодвала.Добавить(ОбластьПодвалТаблицы);
			КонецЕсли;
			
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьШапкаТаблицы, ОбластьИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице, Документ, мсвДопОбластиПодвала);
			
			// инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПредыдущий Тогда
				СтруктураИтоговПоСтранице = Новый Структура();
				СтруктураИтоговПоСтранице.Вставить("ВалютаДокумента", Документ.ВалютаДокумента);
				СтруктураИтоговПоСтранице.Вставить("СуммаСкидки",     0);
				СтруктураИтоговПоСтранице.Вставить("СуммаНДС",        0);
				СтруктураИтоговПоСтранице.Вставить("СуммаВсего",      0);
				НомерСтраницыПредыдущий   = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
			КонецЕсли;
			
			// добавляем итоги
			УправлениеПечатьюПлатформа.ДобавитьИтогиПоСтранице(СтрокаТЧ,СтруктураИтоговПоСтранице);
		КонецЦикла;
				
		// выводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			УправлениеПечатьюПлатформа.ВывестиИтогиПоСтранице(ТабличныйДокумент,ОбластьИтогоПоСтранице,СтруктураИтоговПоСтранице,Документ);
		КонецЕсли;
		
		ОбластьПодвалТаблицы.Параметры.ВалютаДокумента = Документ.ВалютаДокумента;
		СуммаВсего = ВыборкаТабличнойЧасти.Итог("СуммаВсего");
		ОбластьПодвалТаблицы.Параметры.СуммаВсего = Формат(СуммаВсего, ФорматВыводаСуммы);
		НДСВсего = ВыборкаТабличнойЧасти.Итог("СуммаНДС");
		ОбластьПодвалТаблицы.Параметры.НДСВсего = Формат(НДСВсего,ФорматВыводаСуммы);
		Если ВыборкаТабличнойЧасти.Итог("СуммаСкидки")>0 Тогда
			СкидкаВсего = ВыборкаТабличнойЧасти.Итог("СуммаСкидки");
			ОбластьПодвалТаблицы.Параметры.СкидкаВсего = Формат(СкидкаВсего,ФорматВыводаСуммы);
		КонецЕсли;
		ОбластьПодвалТаблицы.Параметры.СуммаПрописью = НСтр("ru = 'Всего наименований'") + Символы.НПП+ВыборкаТабличнойЧасти.Количество() + Символы.НПП + НСтр("ru = 'на сумму'") + Символы.НПП + РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаВсего,Документ.ВалютаДокумента);
		
		ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
		
		ОбластьПодзаголовок.Параметры.ИмяТабличнойЧасти = НСтр("ru = 'Товары, возвращенные розничными покупателями'");
		ТабличныйДокумент.Вывести(ОбластьПодзаголовок);
		
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = "";
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы  = "";
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		// готовим шапку
		СтруктураИтоговПоСтранице = Новый Структура();
		СтруктураИтоговПоСтранице.Вставить("ВалютаДокумента", Документ.ВалютаДокумента);
		СтруктураИтоговПоСтранице.Вставить("СуммаСкидки",     0);
		СтруктураИтоговПоСтранице.Вставить("СуммаНДС",        0);
		СтруктураИтоговПоСтранице.Вставить("СуммаВсего",      0);
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы;
		
		// заполняем ТЧ
		ВыборкаТабличнойЧасти = Документ.Возвраты;
		Для Каждого СтрокаТЧ Из ВыборкаТабличнойЧасти Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры,УправлениеПечатьюПлатформа.ЗаполнитьПредставлениеДанныхТоварнойСтроки(СтрокаТЧ,Документ));
			
			// доп. области
			мсвДопОбластиПодвала = Неопределено;
			Если Документ.Возвраты.Индекс(СтрокаТЧ) = Документ.Возвраты.Количество()-1 Тогда
				мсвДопОбластиПодвала = Новый Массив;
				мсвДопОбластиПодвала.Добавить(ОбластьПодвалТаблицы);
			КонецЕсли;
			
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьШапкаТаблицы, ОбластьИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице, Документ, мсвДопОбластиПодвала);
			
			// инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПредыдущий Тогда
				СтруктураИтоговПоСтранице = Новый Структура();
				СтруктураИтоговПоСтранице.Вставить("ВалютаДокумента", Документ.ВалютаДокумента);
				СтруктураИтоговПоСтранице.Вставить("СуммаСкидки",     0);
				СтруктураИтоговПоСтранице.Вставить("СуммаНДС",        0);
				СтруктураИтоговПоСтранице.Вставить("СуммаВсего",      0);
				НомерСтраницыПредыдущий   = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
			КонецЕсли;
			
			// добавляем итоги
			УправлениеПечатьюПлатформа.ДобавитьИтогиПоСтранице(СтрокаТЧ,СтруктураИтоговПоСтранице);
		КонецЦикла;
				
		// выводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			УправлениеПечатьюПлатформа.ВывестиИтогиПоСтранице(ТабличныйДокумент,ОбластьИтогоПоСтранице,СтруктураИтоговПоСтранице,Документ);
		КонецЕсли;
		
		ОбластьПодвалТаблицы.Параметры.ВалютаДокумента = Документ.ВалютаДокумента;
		СуммаВсего = ВыборкаТабличнойЧасти.Итог("СуммаВсего");
		ОбластьПодвалТаблицы.Параметры.СуммаВсего = Формат(СуммаВсего, ФорматВыводаСуммы);
		НДСВсего = ВыборкаТабличнойЧасти.Итог("СуммаНДС");
		ОбластьПодвалТаблицы.Параметры.НДСВсего = Формат(НДСВсего,ФорматВыводаСуммы);
		Если ВыборкаТабличнойЧасти.Итог("СуммаСкидки")>0 Тогда
			СкидкаВсего = ВыборкаТабличнойЧасти.Итог("СуммаСкидки");
			ОбластьПодвалТаблицы.Параметры.СкидкаВсего = Формат(СкидкаВсего,ФорматВыводаСуммы);
		КонецЕсли;
		ОбластьПодвалТаблицы.Параметры.СуммаПрописью = НСтр("ru = 'Всего наименований'") + Символы.НПП+ВыборкаТабличнойЧасти.Количество() + Символы.НПП + НСтр("ru = 'на сумму'") + Символы.НПП + РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаВсего,Документ.ВалютаДокумента);
		
		ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
		
		ОбластьПодвал.Параметры.Заполнить(УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"Отпустил"));
		ОбластьПодвал.Параметры.Заполнить(УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"Получил"));
		
		УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент,ОбластьПодвал,,,НомерСтраницы,,Документ);
		
		// блок области
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции //ПечатьЗакрытиеСмены

// Функция помещает необходимые данные в структуру. Структура помещается во временное хранилище.
//
// Возвращаемое значение:
//	Адрес   - адрес структуры данных во временном хранилище.
//
Функция ПолучитьДанныеДляПечатиЭтикеток(МассивДокументов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗакрытиеСменыТовары.Номенклатура   КАК Номенклатура,
	|	ЗакрытиеСменыТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	| 	ЗакрытиеСменыТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|
	|	МИНИМУМ(ЗакрытиеСменыТовары.НомерСтроки) КАК Порядок,
	|	СУММА(
	|		ВЫБОР КОГДА ЗакрытиеСменыТовары.Ссылка.СкладКомпании.Розничный = ИСТИНА ТОГДА
	|			ЗакрытиеСменыТовары.Количество * (ЕСТЬNULL(ЗакрытиеСменыТовары.ЕдиницаИзмерения.Коэффициент, 1) / ЕСТЬNULL(Цены.ЕдиницаИзмерения.Коэффициент, 1))
	|		ИНАЧЕ
	|			ЗакрытиеСменыТовары.Количество
	|		КОНЕЦ) КАК Количество
	|ИЗ
	|	Документ.ЗакрытиеСмены.Товары КАК ЗакрытиеСменыТовары
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних КАК Цены
	|		ПО Цены.Номенклатура   = ЗакрытиеСменыТовары.Номенклатура
	|		 И Цены.ХарактеристикаНоменклатуры = ЗакрытиеСменыТовары.ХарактеристикаНоменклатуры
	|		 И Цены.ТипЦен        = ЗакрытиеСменыТовары.Ссылка.СкладКомпании.ТипЦенРозничнойТорговли
	|	
	|ГДЕ
	|	ЗакрытиеСменыТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗакрытиеСменыТовары.Номенклатура,
	|	ЗакрытиеСменыТовары.ХарактеристикаНоменклатуры,
	|	ЗакрытиеСменыТовары.ЕдиницаИзмерения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗакрытиеСмены.Организация            КАК Организация,
	|	ЗакрытиеСмены.ПодразделениеКомпании  КАК ПодразделениеКомпании,
	|	ЗакрытиеСмены.СкладКомпании          КАК СкладКомпании,
	|	ЗакрытиеСмены.СкладКомпании.ТипЦенРозничнойТорговли КАК ТипЦены
	|ИЗ
	|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	|ГДЕ
	|	ЗакрытиеСмены.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаРеквизитыДокументов = МассивРезультатов[1].Выгрузить();
	МассивОрганизаций 			= УправлениеДиалогомСервер.СвернутьТаблицуЗначенийПоРеквизиту(ТаблицаРеквизитыДокументов, "Организация").ВыгрузитьКолонку(0);
	МассивПодразделенийКомпании = УправлениеДиалогомСервер.СвернутьТаблицуЗначенийПоРеквизиту(ТаблицаРеквизитыДокументов, "ПодразделениеКомпании").ВыгрузитьКолонку(0);
	МассивСкладов    			= УправлениеДиалогомСервер.СвернутьТаблицуЗначенийПоРеквизиту(ТаблицаРеквизитыДокументов, "СкладКомпании").ВыгрузитьКолонку(0);
	МассивТиповЦен    			= УправлениеДиалогомСервер.СвернутьТаблицуЗначенийПоРеквизиту(ТаблицаРеквизитыДокументов, "ТипЦены").ВыгрузитьКолонку(0);
	
	// Подготовка структуры действий для обработки печати ценников и этикеток
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьОрганизацию", ?(МассивОрганизаций.Количество() = 1, МассивОрганизаций[0], Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьПодразделениеКомпании", ?(МассивПодразделенийКомпании.Количество() = 1, МассивПодразделенийКомпании[0], Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьСклад",       ?(МассивСкладов.Количество() = 1,     МассивСкладов[0],     МассивСкладов));
	СтруктураДействий.Вставить("ЗаполнитьТипЦены",     ?(МассивТиповЦен.Количество() = 1,    МассивТиповЦен[0],    Неопределено));
	СтруктураДействий.Вставить("ПоказыватьКолонкуКоличествоВДокументе", Истина);
	СтруктураДействий.Вставить("УстановитьРежимПечатиИзДокумента");
	СтруктураДействий.Вставить("УстановитьРежим", "ПечатьЭтикеток");
	СтруктураДействий.Вставить("ЗаполнитьКоличествоЭтикетокПоДокументу");
	СтруктураДействий.Вставить("ЗаполнитьТаблицуТоваров");
	
	// Подготовка данных для заполнения табличной части обработки печати ценников и этикеток.
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Товары", МассивРезультатов[0].Выгрузить());
	СтруктураРезультат.Вставить("СтруктураДействий", СтруктураДействий);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураРезультат);
	
КонецФункции

// Функция помещает необходимые данные в структуру. Структура помещается во временное хранилище.
//
// Возвращаемое значение:
//	Адрес - адрес структуры данных во временном хранилище.
//
Функция ПолучитьДанныеДляПечатиЦенников(МассивДокументов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗакрытиеСменыТовары.Номенклатура КАК Номенклатура,
	|	ЗакрытиеСменыТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ЗакрытиеСменыТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МИНИМУМ(ЗакрытиеСменыТовары.НомерСтроки) КАК Порядок,
	|	СУММА(ВЫБОР
	|			КОГДА ЗакрытиеСменыТовары.Ссылка.СкладКомпании.Розничный = ИСТИНА
	|				ТОГДА ЗакрытиеСменыТовары.Количество * (ЕСТЬNULL(ЗакрытиеСменыТовары.ЕдиницаИзмерения.Коэффициент, 1) / ЕСТЬNULL(Цены.ЕдиницаИзмерения.Коэффициент, 1))
	|			ИНАЧЕ ЗакрытиеСменыТовары.Количество
	|		КОНЕЦ) КАК Количество
	|ИЗ
	|	Документ.ЗакрытиеСмены.Товары КАК ЗакрытиеСменыТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних КАК Цены
	|		ПО (Цены.Номенклатура = ЗакрытиеСменыТовары.Номенклатура)
	|			И (Цены.ХарактеристикаНоменклатуры = ЗакрытиеСменыТовары.ХарактеристикаНоменклатуры)
	|			И (Цены.ТипЦен = ЗакрытиеСменыТовары.Ссылка.СкладКомпании.ТипЦенРозничнойТорговли)
	|ГДЕ
	|	ЗакрытиеСменыТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗакрытиеСменыТовары.Номенклатура,
	|	ЗакрытиеСменыТовары.ХарактеристикаНоменклатуры,
	|	ЗакрытиеСменыТовары.ЕдиницаИзмерения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗакрытиеСмены.Организация КАК Организация,
	|	ЗакрытиеСмены.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ЗакрытиеСмены.СкладКомпании КАК СкладКомпании,
	|	ЗакрытиеСмены.СкладКомпании.ТипЦенРозничнойТорговли КАК ТипЦены
	|ИЗ
	|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	|ГДЕ
	|	ЗакрытиеСмены.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаРеквизитыДокументов = МассивРезультатов[1].Выгрузить();
	МассивОрганизаций 			= УправлениеДиалогомСервер.СвернутьТаблицуЗначенийПоРеквизиту(ТаблицаРеквизитыДокументов, "Организация").ВыгрузитьКолонку(0);
	МассивПодразделенийКомпании = УправлениеДиалогомСервер.СвернутьТаблицуЗначенийПоРеквизиту(ТаблицаРеквизитыДокументов, "ПодразделениеКомпании").ВыгрузитьКолонку(0);
	МассивСкладов    			= УправлениеДиалогомСервер.СвернутьТаблицуЗначенийПоРеквизиту(ТаблицаРеквизитыДокументов, "СкладКомпании").ВыгрузитьКолонку(0);
	МассивТиповЦен    			= УправлениеДиалогомСервер.СвернутьТаблицуЗначенийПоРеквизиту(ТаблицаРеквизитыДокументов, "ТипЦены").ВыгрузитьКолонку(0);

	
	// Подготовка структуры действий для обработки печати ценников и этикеток
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьОрганизацию", ?(МассивОрганизаций.Количество() = 1, МассивОрганизаций[0], Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьПодразделениеКомпании", ?(МассивПодразделенийКомпании.Количество() = 1, МассивПодразделенийКомпании[0], Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьСклад",       ?(МассивСкладов.Количество() = 1,     МассивСкладов[0],     МассивСкладов));
	СтруктураДействий.Вставить("ЗаполнитьВидЦены",     ?(МассивТиповЦен.Количество() = 1,    МассивТиповЦен[0],    Неопределено));
	СтруктураДействий.Вставить("ПоказыватьКолонкуКоличествоВДокументе", Истина);
	СтруктураДействий.Вставить("УстановитьРежимПечатиИзДокумента");
	СтруктураДействий.Вставить("УстановитьРежим", "ПечатьЦенников");
	СтруктураДействий.Вставить("ЗаполнитьКоличествоЦенниковПоДокументу");
	СтруктураДействий.Вставить("ЗаполнитьТаблицуТоваров");
	
	// Подготовка данных для заполнения табличной части обработки печати ценников и этикеток.
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Товары", МассивРезультатов[0].Выгрузить());
	СтруктураРезультат.Вставить("СтруктураДействий", СтруктураДействий);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураРезультат);
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	// выполнение стандартных действий
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()

#КонецЕсли