// Модуль документа "Закрытие смены"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьДвиженияПоМаркамСмены(ДатаРегистрации, ОрганизацияЕГАИС, ДокументСсылка, МоментВремени) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗакрытиеСменыМарки.Ссылка,
	|	ЗакрытиеСменыМарки.КодМарки КАК КодМарки,
	|	МИНИМУМ(ЗакрытиеСменыМарки.НомерСтроки) КАК НомерСтроки,
	|	СУММА(ВЫБОР
	|		КОГДА ЗакрытиеСменыМарки.ЭтоВозврат ТОГДА
	|			-1
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ) КАК Количество
	|ПОМЕСТИТЬ
	|	ЗакрытиеСменыМарки
	|ИЗ
	|	Документ.ЗакрытиеСмены.Марки КАК ЗакрытиеСменыМарки
	|ГДЕ
	|	ЗакрытиеСменыМарки.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ЗакрытиеСменыМарки.Ссылка,
	|	ЗакрытиеСменыМарки.КодМарки
	|ИМЕЮЩИЕ
	|	НЕ СУММА(ВЫБОР
	|		КОГДА ЗакрытиеСменыМарки.ЭтоВозврат ТОГДА
	|			-1
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ) = 0
	|;
	|
	|ВЫБРАТЬ
	|	ОстаткиМарокЕГАИС.КодМарки КАК КодМарки,
	|	МАКСИМУМ(ОстаткиМарокЕГАИС.Период) КАК Период
	|ПОМЕСТИТЬ
	|	ПоследняяПродажа
	|ИЗ
	|	РегистрНакопления.ОстаткиМарокЕГАИС КАК ОстаткиМарокЕГАИС
	|ГДЕ
	|	ОстаткиМарокЕГАИС.Период<&ДатаРегистрации И 
	|	ОстаткиМарокЕГАИС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И 
	|	ОстаткиМарокЕГАИС.Регистратор ССЫЛКА Документ.ЗакрытиеСмены И 
	|	ОстаткиМарокЕГАИС.КодМарки В (ВЫБРАТЬ ЗакрытиеСменыМарки.КодМарки ИЗ ЗакрытиеСменыМарки ГДЕ ЗакрытиеСменыМарки.Количество<0)
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиМарокЕГАИС.КодМарки
	|;
	|
	|ВЫБРАТЬ
	|	ПоследняяПродажа.КодМарки КАК КодМарки,
	|	МАКСИМУМ(ОстаткиМарокЕГАИС.Справка2) КАК Справка2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	|ПОМЕСТИТЬ
	|	ТаблицаМарок
	|ИЗ
	|	ПоследняяПродажа КАК ПоследняяПродажа
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ОстаткиМарокЕГАИС КАК ОстаткиМарокЕГАИС
	|ПО
	|	ОстаткиМарокЕГАИС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И 
	|	ПоследняяПродажа.Период = ОстаткиМарокЕГАИС.Период И 
	|	ПоследняяПродажа.КодМарки = ОстаткиМарокЕГАИС.КодМарки
	|СГРУППИРОВАТЬ ПО
	|	ПоследняяПродажа.КодМарки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗакрытиеСменыМарки.КодМарки,
	|	ЕСТЬNULL(ОстаткиМарокЕГАИС.Справка2, ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка)),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|ИЗ
	|	ЗакрытиеСменыМарки КАК ЗакрытиеСменыМарки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ОстаткиМарокЕГАИС.Остатки(&МоментВремени, КодМарки В (ВЫБРАТЬ КодМарки ИЗ ЗакрытиеСменыМарки)) КАК ОстаткиМарокЕГАИС
	|ПО
	|	ЗакрытиеСменыМарки.КодМарки = ОстаткиМарокЕГАИС.КодМарки
	|ГДЕ
	|	ЗакрытиеСменыМарки.Количество>0
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаМарок.ВидДвижения КАК ВидДвижения,
	|	&ДатаРегистрации КАК Период,
	|	ЗакрытиеСменыМарки.Ссылка КАК Регистратор,
	|	ЗакрытиеСменыМарки.Ссылка.ХозОперация КАК ХозОперация,
	|	ЗакрытиеСменыМарки.НомерСтроки КАК НомерСтроки,
	|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	ТаблицаМарок.КодМарки КАК КодМарки,
	|	ТаблицаМарок.Справка2 КАК Справка2,
	|	1 КАК Количество
	|ИЗ
	|	ЗакрытиеСменыМарки КАК ЗакрытиеСменыМарки
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаМарок КАК ТаблицаМарок
	|ПО
	|	ЗакрытиеСменыМарки.КодМарки = ТаблицаМарок.КодМарки
	|";
	
	Запрос.УстановитьПараметр("ДатаРегистрации",  ДатаРегистрации);
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	Запрос.УстановитьПараметр("Ссылка",           ДокументСсылка);
	Запрос.УстановитьПараметр("МоментВремени",    МоментВремени);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДвижений;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

Процедура ОбработкаПроведенияНакопленияПоКарточкамКонтрагентов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗакрытиеСменыКонтрагенты.Контрагент,
	|	ЗакрытиеСменыКонтрагенты.Карточка,
	|	ЗакрытиеСменыКонтрагенты.Ссылка.Дата КАК ПериодНакопления,
	|	СУММА(ЗакрытиеСменыКонтрагенты.СуммаВсего) КАК Сумма,
	|	СУММА(ЗакрытиеСменыКонтрагенты.КоличествоЧеков) КАК КоличествоЧеков,
	|	СУММА(ЗакрытиеСменыКонтрагенты.КоличествоНоменклатуры) КАК КоличествоНоменклатуры
	|ИЗ
	|	Документ.ЗакрытиеСмены.Контрагенты КАК ЗакрытиеСменыКонтрагенты
	|ГДЕ
	|	ЗакрытиеСменыКонтрагенты.Ссылка = &Ссылка
	|	И ЗакрытиеСменыКонтрагенты.Карточка <> ЗНАЧЕНИЕ(Справочник.Карточки.ПустаяСсылка)
	|	И ЗакрытиеСменыКонтрагенты.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗакрытиеСменыКонтрагенты.Ссылка.Дата,
	|	ЗакрытиеСменыКонтрагенты.Контрагент,
	|	ЗакрытиеСменыКонтрагенты.Карточка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	НаборНакоплениеСумм = Движения.НакопленияПоКарточкамКонтрагентов;
	НаборНакоплениеСумм.ДокументСсылка   = Ссылка;
	НаборНакоплениеСумм.РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	НаборНакоплениеСумм.ВыполнитьДвижения();
	
КонецПроцедуры

// возвращает выборку по шапке
//
// Параметры:
//  ДокументСсылка - Ссылка на документ для которого получаем шапку.
//
// Возвращаемое значение:
//  Выборка - выборка по шапке
//
Функция ПолучитьШапкуДокумента(ДокументСсылка) Экспорт
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	СУММА(ЗакрытиеСменыТовары.СуммаВсего) КАК СуммаВсего
	                    |ПОМЕСТИТЬ ДокТовары
	                    |ИЗ
	                    |	Документ.ЗакрытиеСмены.Товары КАК ЗакрытиеСменыТовары
	                    |ГДЕ
	                    |	ЗакрытиеСменыТовары.Ссылка = &Ссылка
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	Док.Ссылка КАК Ссылка,
	                    |	Док.Дата КАК Дата,
	                    |	Док.ВалютаДокумента КАК ВалютаДокумента,
	                    |	Док.КурсДокумента КАК КурсДокумента,
	                    |	Док.ТипЦен КАК ТипЦен,
	                    |	ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗакрытиеСменыВозврат) КАК ХозОперацияВозврат,
	                    |	Док.ХозОперация КАК ХозОперация,
	                    |	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	                    |	Док.МоментВремени КАК МоментВремени,
	                    |	Док.Организация КАК Организация,
	                    |	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                    |	Док.Проект КАК Проект,
	                    |	Док.СкладКомпании КАК СкладКомпании,
	                    |	Док.Ссылка КАК ДокументПродажи,
	                    |	Док.КассаККМ КАК КассаККМ,
	                    |	ЕСТЬNULL(ДокТовары.СуммаВсего, 0) КАК СуммаВсего
	                    |ИЗ
	                    |	Документ.ЗакрытиеСмены КАК Док
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ ДокТовары КАК ДокТовары
	                    |		ПО (ИСТИНА)
	                    |ГДЕ
	                    |	Док.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции // ПолучитьШапкуДокумента()

// формирует движения документа по партионным регистрам
//
// Параметры:
//  Режим           - режим проведения (оперативный/неоперативный)
//  ДокументСсылка  - ссылка на документ который надо допровести по партиям.
//
// Возвращаемое значение:
//  Возвращает Истина - все ОК, ложь - чего-то не так.
//
Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	Отказ=Ложь;
	
	// получим шапку документа
	ШапкаДокумента = ПолучитьШапкуДокумента(ДокументСсылка);
	
	// Получим способ ведения баланса.
	БалансВедетсяПоПодразделениям = БалансВедетсяПоПодразделениям(ШапкаДокумента.Дата);
	
	// Проверим, если подразделение проводится по партиям "отложенно", то дальше не идем.
	НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте=Ложь;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
		НаборЗаписейДоходыИРасходы.Доход = Оплаты.Итог("Сумма") - Оплаты.Итог("СуммаВозврат") - ВозвратОплаты.Итог("Сумма");
		НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		Возврат НЕ Отказ;
	КонецЕсли;
	
	// Сформируем структуру ТЗ для записи товаров по складам
	ТоварыПоСкладу=Новый ТаблицаЗначений;
	ТоварыПоСкладу.Колонки.Добавить("Номенклатура");
	ТоварыПоСкладу.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТоварыПоСкладу.Колонки.Добавить("Количество");
	ТоварыПоСкладам=Новый Соответствие;
	
	ВозвратыПоСкладу=Новый ТаблицаЗначений;
	ВозвратыПоСкладу.Колонки.Добавить("Номенклатура");
	ВозвратыПоСкладу.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ВозвратыПоСкладу.Колонки.Добавить("Количество");
	ВозвратыПоСкладу.Колонки.Добавить("ДокументПродажи");
	ВозвратыПоСкладу.Колонки.Добавить("СтавкаНДС");
	ВозвратыПоСкладу.Колонки.Добавить("Партия");
	ВозвратыПоСкладу.Колонки.Добавить("Сумма");
	ВозвратыПоСкладу.Колонки.Добавить("СуммаУпр");
	ВозвратыПоСкладу.Колонки.Добавить("СуммаНДС");
	ВозвратыПоСкладу.Колонки.Добавить("Себестоимость");
	ВозвратыПоСкладам=Новый Соответствие;
	
	ЗапросТовары=Новый Запрос("ВЫБРАТЬ
	                          |	ВЫБОР
	                          |		КОГДА &АктОРеализации
	                          |			ТОГДА &СкладКомпании
	                          |		ИНАЧЕ ЗакрытиеСменыТовары.МестоРазмещения
	                          |	КОНЕЦ КАК СкладКомпании,
	                          |	ЗакрытиеСменыТовары.Номенклатура КАК Номенклатура,
	                          |	ЗакрытиеСменыТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                          |	СУММА(ЗакрытиеСменыТовары.Количество * ЗакрытиеСменыТовары.Коэффициент) КАК Количество
	                          |ИЗ
	                          |	Документ.ЗакрытиеСмены.Товары КАК ЗакрытиеСменыТовары
	                          |ГДЕ
	                          |	ЗакрытиеСменыТовары.Ссылка = &Ссылка
	                          |	И ЗакрытиеСменыТовары.Номенклатура.ВидНоменклатуры <> &ВидНоменклатурыУслуга
	                          |
	                          |СГРУППИРОВАТЬ ПО
	                          |	ВЫБОР
	                          |		КОГДА &АктОРеализации
	                          |			ТОГДА &СкладКомпании
	                          |		ИНАЧЕ ЗакрытиеСменыТовары.МестоРазмещения
	                          |	КОНЕЦ,
	                          |	ЗакрытиеСменыТовары.Номенклатура,
	                          |	ЗакрытиеСменыТовары.ХарактеристикаНоменклатуры
	                          |ИТОГИ ПО
	                          |	СкладКомпании
	                          |;
	                          |
	                          |////////////////////////////////////////////////////////////////////////////////
	                          |ВЫБРАТЬ
	                          |	ВЫБОР
	                          |		КОГДА &АктОРеализации
	                          |			ТОГДА &СкладКомпании
	                          |		ИНАЧЕ ЗакрытиеСменыВозвраты.МестоРазмещения
	                          |	КОНЕЦ КАК СкладКомпании,
	                          |	ЗакрытиеСменыВозвраты.Номенклатура КАК Номенклатура,
	                          |	ЗакрытиеСменыВозвраты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                          |	СУММА(ЗакрытиеСменыВозвраты.Количество * ЗакрытиеСменыВозвраты.Коэффициент) КАК Количество,
	                          |	ЗакрытиеСменыВозвраты.СтавкаНДС,
	                          |	ЗакрытиеСменыВозвраты.СуммаВсего КАК Себестоимость
	                          |ИЗ
	                          |	Документ.ЗакрытиеСмены.Возвраты КАК ЗакрытиеСменыВозвраты
	                          |ГДЕ
	                          |	ЗакрытиеСменыВозвраты.Ссылка = &Ссылка
	                          |	И ЗакрытиеСменыВозвраты.Номенклатура.ВидНоменклатуры <> &ВидНоменклатурыУслуга
	                          |
	                          |СГРУППИРОВАТЬ ПО
	                          |	ВЫБОР
	                          |		КОГДА &АктОРеализации
	                          |			ТОГДА &СкладКомпании
	                          |		ИНАЧЕ ЗакрытиеСменыВозвраты.МестоРазмещения
	                          |	КОНЕЦ,
	                          |	ЗакрытиеСменыВозвраты.Номенклатура,
	                          |	ЗакрытиеСменыВозвраты.ХарактеристикаНоменклатуры,
	                          |	ЗакрытиеСменыВозвраты.СтавкаНДС,
	                          |	ЗакрытиеСменыВозвраты.СуммаВсего
	                          |ИТОГИ ПО
	                          |	СкладКомпании");
	ЗапросТовары.УстановитьПараметр("АктОРеализации",(ШапкаДокумента.ХозОперация=Справочники.ХозОперации.АктОРеализации));
	ЗапросТовары.УстановитьПараметр("СкладКомпании",ШапкаДокумента.СкладКомпании);
	ЗапросТовары.УстановитьПараметр("Ссылка",ШапкаДокумента.Ссылка);
	ЗапросТовары.УстановитьПараметр("ВидНоменклатурыУслуга",Перечисления.ВидыНоменклатуры.Услуга);
	ПакетЗапроса = ЗапросТовары.ВыполнитьПакет();
	ВыборкаСклады=ПакетЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"СкладКомпании");
	Пока ВыборкаСклады.Следующий() Цикл
		ТоварыПоТекущемуСкладу=ТоварыПоСкладу.Скопировать();
		ВыборкаТовары=ВыборкаСклады.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			СтрокаТоваровПоСкладу=ТоварыПоТекущемуСкладу.Добавить();
			СтрокаТоваровПоСкладу.Номенклатура=ВыборкаТовары.Номенклатура;
			СтрокаТоваровПоСкладу.ХарактеристикаНоменклатуры=ВыборкаТовары.ХарактеристикаНоменклатуры;
			СтрокаТоваровПоСкладу.Количество=ВыборкаТовары.Количество;
		КонецЦикла;
		ТоварыПоСкладам.Вставить(ВыборкаСклады.СкладКомпании,ТоварыПоТекущемуСкладу);
	КонецЦикла;
		
	// проведем по партиям товаров
	НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
	
	// Возвращенная номенклатура
	ВыборкаСклады=ПакетЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"СкладКомпании");
	ПартияОтрицательныхОстатков = Константы.ПартияТоваровОтрицательныхОстатков.Получить();
	
	МассивПартий = Новый Массив;
	МассивПартий.Добавить(ПартияОтрицательныхОстатков);
	
	СписаниеПартий = НаборЗаписейПартии.Выгрузить();
	ВалютаУпр      = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	Пока ВыборкаСклады.Следующий() Цикл
		
		ТоварыПоТекущемуСкладу=ВозвратыПоСкладу.Скопировать();
		ВыборкаТовары=ВыборкаСклады.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			СтрокаТоваровПоСкладу=ТоварыПоТекущемуСкладу.Добавить();
			СтрокаТоваровПоСкладу.Номенклатура=ВыборкаТовары.Номенклатура;
			СтрокаТоваровПоСкладу.ХарактеристикаНоменклатуры=ВыборкаТовары.ХарактеристикаНоменклатуры;
			СтрокаТоваровПоСкладу.Количество=ВыборкаТовары.Количество;
			СтрокаТоваровПоСкладу.СтавкаНДС=ВыборкаТовары.СтавкаНДС;
			СтрокаТоваровПоСкладу.Партия=ПартияОтрицательныхОстатков;
			СтрокаТоваровПоСкладу.Себестоимость = Окр(ВыборкаТовары.Себестоимость / ВыборкаТовары.Количество, 2);
		КонецЦикла;
		ВозвратыПоСкладам.Вставить(ВыборкаСклады.СкладКомпании,ТоварыПоТекущемуСкладу);
	КонецЦикла;
	
	// проведем по партиям товаров возврата
	Для каждого Склад Из ВозвратыПоСкладам Цикл
		НаборЗаписейПартии.ДокументОбъект            = ЭтотОбъект;
		НаборЗаписейПартии.ПоБазовомуКоличеству      = Ложь; //По фактическому количеству
		НаборЗаписейПартии.СтатусПартии              = Неопределено; //Продаем все товары
		НаборЗаписейПартии.Сторно                    = Истина;
		НаборЗаписейПартии.ХозОперация               = ШапкаДокумента.ХозОперацияВозврат;
		НаборЗаписейПартии.СкладКомпании             = Склад.Ключ;
		НаборЗаписейПартии.ШапкаДокумента            = ШапкаДокумента;
		НаборЗаписейПартии.РезультатЗапросаПоТоварам = Склад.Значение;
		НаборЗаписейПартии.ИмяРеквизитаДокумент      = "Ссылка";
		НаборЗаписейПартии.ЗаписыватьДвижения        = Истина;
		ПустыеСтрокиТабличнойЧасти=НаборЗаписейПартии.РезультатЗапросаПоТоварам.НайтиСтроки(Новый Структура("Количество",0));
		Для Каждого ПустаяСтрока Из ПустыеСтрокиТабличнойЧасти Цикл
			НаборЗаписейПартии.РезультатЗапросаПоТоварам.Удалить(ПустаяСтрока);
		КонецЦикла;
		Отказ = НЕ НаборЗаписейПартии.Расход() ИЛИ Отказ;
	КонецЦикла; 
	
	// проверить
	Для каждого Склад Из ТоварыПоСкладам Цикл
		
		ВозвращенныйТовар = ВозвратыПоСкладам.Получить(Склад.Ключ);
		Если НЕ ВозвращенныйТовар = Неопределено Тогда
			
			РеализацияТовараВозврата = Склад.Значение.СкопироватьКолонки();
			СписаниеТовараВозврата = РеализацияТовараВозврата.Скопировать();
			
			ВозвращенныйТовар.Свернуть("Номенклатура,ХарактеристикаНоменклатуры", "Количество");
			
			СтруктураПоиска = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры");
			Для Каждого ТекущаяСтрока Из Склад.Значение Цикл
				
				Если ТекущаяСтрока.Количество = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
				НайденныеСтроки = ВозвращенныйТовар.НайтиСтроки(СтруктураПоиска);
				КоличествоРеализовано = ТекущаяСтрока.Количество;
				Для Каждого ТекущаяСтрокаВозврата Из НайденныеСтроки Цикл
					Если КоличествоРеализовано = 0 Тогда
						Прервать;
					КонецЕсли;
					НоваяСтрока = РеализацияТовараВозврата.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
					НоваяСтрока.Количество = ?(ТекущаяСтрокаВозврата.Количество >= КоличествоРеализовано, КоличествоРеализовано, ТекущаяСтрокаВозврата.Количество);
					КоличествоРеализовано = КоличествоРеализовано - НоваяСтрока.Количество;
				КонецЦикла;
				
				Если КоличествоРеализовано > 0 Тогда
					НоваяСтрока = СписаниеТовараВозврата.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
					НоваяСтрока.Количество = КоличествоРеализовано;
				КонецЕсли;
				
			КонецЦикла;
			
			Если РеализацияТовараВозврата.Количество() > 0 Тогда
				НаборЗаписейПартии.ДокументОбъект            = ЭтотОбъект;
				НаборЗаписейПартии.ПоБазовомуКоличеству      = Ложь; //По фактическому количеству
				НаборЗаписейПартии.СтатусПартии              = Неопределено; //Продаем все товары
				НаборЗаписейПартии.Сторно                    = Ложь;
				НаборЗаписейПартии.ИмяРеквизитаДокумент      = "";
				НаборЗаписейПартии.СкладКомпании             = Склад.Ключ;
				НаборЗаписейПартии.МассивПартий              = МассивПартий;
				НаборЗаписейПартии.ГраницаРасчетаОстатков    = Новый Граница(МоментВремени(), ВидГраницы.Включая);
				НаборЗаписейПартии.ШапкаДокумента            = ШапкаДокумента;
				НаборЗаписейПартии.РезультатЗапросаПоТоварам = РеализацияТовараВозврата;
				Отказ = НЕ НаборЗаписейПартии.Расход() ИЛИ Отказ;
			КонецЕсли;
			
		Иначе
			
			СписаниеТовараВозврата = Склад.Значение;
			ПустыеСтрокиТабличнойЧасти=СписаниеТовараВозврата.НайтиСтроки(Новый Структура("Количество",0));
			Для Каждого ПустаяСтрока Из ПустыеСтрокиТабличнойЧасти Цикл
				СписаниеТовараВозврата.Удалить(ПустаяСтрока);
			КонецЦикла;
			
		КонецЕсли;
		
		НаборЗаписейПартии.ДокументОбъект            = ЭтотОбъект;
		НаборЗаписейПартии.ПоБазовомуКоличеству      = Ложь; //По фактическому количеству
		НаборЗаписейПартии.СтатусПартии              = Неопределено; //Продаем все товары
		НаборЗаписейПартии.Сторно                    = Ложь;
		НаборЗаписейПартии.ИмяРеквизитаДокумент      = "";
		НаборЗаписейПартии.ГраницаРасчетаОстатков    = Неопределено;
		НаборЗаписейПартии.СкладКомпании             = Склад.Ключ;
		НаборЗаписейПартии.ШапкаДокумента            = ШапкаДокумента;
		НаборЗаписейПартии.РезультатЗапросаПоТоварам = СписаниеТовараВозврата;
		Отказ = НЕ НаборЗаписейПартии.Расход() ИЛИ Отказ;
	КонецЦикла;
	
	// двигаем границу последовательности партий
	Если Ссылка <> ДокументСсылка Тогда
		
		РаботаСГраницами.МоментВремениПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		РаботаСГраницами.ДвиженияПоПартиямПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		
	КонецЕсли;
	
	РаботаСГраницами.СдвинутьГраницуПартий(ДокументСсылка, ДополнительныеСвойства, Движения);

	// спишем реализованные комиссионные товары
	НаборЗаписейРеализованныеТовары = Движения.РеализованныеТовары;
	НаборЗаписейРеализованныеТовары.ДокументОбъект       = ЭтотОбъект;
	НаборЗаписейРеализованныеТовары.ШапкаДокумента       = ШапкаДокумента;
	НаборЗаписейРеализованныеТовары.ПоБазовомуКоличеству = Ложь;
	Отказ = НЕ НаборЗаписейРеализованныеТовары.Приход() ИЛИ Отказ;
	
	// продажи
	Если НЕ Отказ Тогда
		НаборЗаписейПродажи=Движения.Продажи;
		НаборЗаписейПродажи.РежимПроведения = Режим;
		НаборЗаписейПродажи.ДокументОбъект            = ЭтотОбъект;
		НаборЗаписейПродажи.СкладКомпании             = ?(ХозОперация=Справочники.ХозОперации.АктОРеализации,СкладКомпании,Неопределено);
		НаборЗаписейПродажи.ДокументПродажи			  = ШапкаДокумента.ДокументПродажи;
		НаборЗаписейПродажи.Сторно                    = Ложь;
		НаборЗаписейПродажи.РезультатЗапросаПоТоварам = Неопределено;
		НаборЗаписейПродажи.Покупатель                = Неопределено;
		НаборЗаписейПродажи.ДоговорВзаиморасчетов     = Неопределено;
		НаборЗаписейПродажи.ПодразделениеКомпании     = ШапкаДокумента.ПодразделениеКомпании;
		НаборЗаписейПродажи.ШапкаДокумента            = ШапкаДокумента;
		НаборЗаписейПродажи.Комиссия                  = Ложь;
		НаборЗаписейПродажи.ПоБазовомуКоличеству      = Ложь;
		Отказ = НЕ НаборЗаписейПродажи.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	// возврат продажи
	Если НЕ Отказ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗакрытиеСменыВозвраты.Номенклатура КАК Номенклатура,
		               |	ЗакрытиеСменыВозвраты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |	ЗакрытиеСменыВозвраты.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		               |	ЗакрытиеСменыВозвраты.Номенклатура.СтавкаНДС КАК СтавкаНДС,
		               |	ЗакрытиеСменыВозвраты.МестоРазмещения КАК СкладКомпании,
		               |	СУММА(ЗакрытиеСменыВозвраты.Количество * ЗакрытиеСменыВозвраты.Коэффициент) КАК Количество,
		               |	СУММА(ЗакрытиеСменыВозвраты.СуммаНДС) КАК СуммаНДС,
		               |	СУММА(ЗакрытиеСменыВозвраты.СуммаСкидки) КАК СуммаСкидки,
		               |	СУММА(ЗакрытиеСменыВозвраты.СуммаВсего) КАК Сумма,
		               |	ЗакрытиеСменыВозвраты.СтавкаНДС КАК СтавкаНДС1
		               |ИЗ
		               |	Документ.ЗакрытиеСмены.Возвраты КАК ЗакрытиеСменыВозвраты
		               |ГДЕ
		               |	ЗакрытиеСменыВозвраты.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗакрытиеСменыВозвраты.МестоРазмещения,
		               |	ЗакрытиеСменыВозвраты.Номенклатура,
		               |	ЗакрытиеСменыВозвраты.ХарактеристикаНоменклатуры,
		               |	ЗакрытиеСменыВозвраты.Номенклатура.ВидНоменклатуры,
		               |	ЗакрытиеСменыВозвраты.СтавкаНДС,
		               |	ЗакрытиеСменыВозвраты.Номенклатура.СтавкаНДС";
		Запрос.УстановитьПараметр("Ссылка",     ШапкаДокумента.Ссылка);
		
		ТаблицаПартий = НаборЗаписейПартии.Выгрузить();
		СтрокиУдалить = Новый Массив;
		
		Для Каждого ТекущаяСтрока Из ТаблицаПартий Цикл
			Если ТекущаяСтрока.Количество > 0 Тогда
				СтрокиУдалить.Добавить(ТекущаяСтрока);
			КонецЕсли;
			ТекущаяСтрока.ДокументПродажи = ШапкаДокумента.Ссылка;
		КонецЦикла;
		
		Для Каждого СтрокаУдалить Из СтрокиУдалить Цикл
			ТаблицаПартий.Удалить(СтрокаУдалить);
		КонецЦикла;
	
		НаборЗаписейПродажи=Движения.Продажи;
		НаборЗаписейПродажи.ДокументОбъект            = ЭтотОбъект;
		НаборЗаписейПродажи.СкладКомпании             = ?(ХозОперация=Справочники.ХозОперации.АктОРеализации,СкладКомпании,Неопределено);
		НаборЗаписейПродажи.ДокументПродажи			  = ШапкаДокумента.Ссылка;
		НаборЗаписейПродажи.Сторно                    = Истина;
		НаборЗаписейПродажи.ХозОперация               = ШапкаДокумента.ХозОперацияВозврат;
		НаборЗаписейПродажи.РезультатЗапросаПоПартиям = ТаблицаПартий;
		НаборЗаписейПродажи.Покупатель                = Неопределено;
		НаборЗаписейПродажи.ДоговорВзаиморасчетов     = Неопределено;
		НаборЗаписейПродажи.ПодразделениеКомпании     = ШапкаДокумента.ПодразделениеКомпании;
		НаборЗаписейПродажи.ШапкаДокумента            = ШапкаДокумента;
		НаборЗаписейПродажи.Комиссия                  = Ложь;
		НаборЗаписейПродажи.ПоБазовомуКоличеству      = Ложь;
		НаборЗаписейПродажи.РезультатЗапросаПоТоварам = Запрос.Выполнить().Выгрузить();

		ПустыеСтрокиТабличнойЧасти=НаборЗаписейПродажи.РезультатЗапросаПоТоварам.НайтиСтроки(Новый Структура("Количество",0));
		Для Каждого ПустаяСтрока Из ПустыеСтрокиТабличнойЧасти Цикл
			НаборЗаписейПродажи.РезультатЗапросаПоТоварам.Удалить(ПустаяСтрока);
		КонецЦикла;
		Отказ = НЕ НаборЗаписейПродажи.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	// Доходы и расходы.
	
	// Подготовим таблицу движений в разрезе подразделений только собственных списанных партий.
	ТаблицаСписанийПартий = Движения.ПартииТоваровКомпании.Выгрузить();
	ТаблицаСписанийПартий.Свернуть("СкладКомпании, СтатусПартии","СуммаУпр");
	
	СтруктураОтбора      = Новый Структура("СтатусПартии",Перечисления.СтатусыПартий.ТоварПринятыйКомиссия);
	МассивНайденныхСтрок = ТаблицаСписанийПартий.НайтиСтроки(СтруктураОтбора);
	Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
		ТаблицаСписанийПартий.Удалить(МассивНайденныхСтрок[Сч]);
	КонецЦикла;
	
	ТаблицаСписанийПартий.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));	
	Для Каждого СтрокаСписания Из ТаблицаСписанийПартий Цикл
		Если БалансВедетсяПоПодразделениям Тогда
			СтрокаСписания.Подразделение = СтрокаСписания.СкладКомпании.ПодразделениеКомпании;
		Иначе
			СтрокаСписания.Подразделение = ШапкаДокумента.ПодразделениеКомпании;
		КонецЕсли;
	КонецЦикла;	
	ТаблицаСписанийПартий.Свернуть("Подразделение", "СуммаУпр");
	
	Для Каждого СтрокаСписания Из ТаблицаСписанийПартий Цикл
		НаборЗаписейДоходыИРасходы = Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
		НаборЗаписейДоходыИРасходы.Подразделение          = СтрокаСписания.Подразделение;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Себестоимость;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Истина;
		НаборЗаписейДоходыИРасходы.Расход                 = СтрокаСписания.СуммаУпр;	
		НаборЗаписейДоходыИРасходы.ШапкаДокумента         = ШапкаДокумента;
		Отказ = НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	КонецЦикла;
	
	// Подготовим таблицу движений в разрезе подразделений комиссионных товаров.
	ТаблицаСписанийПартийРеализованных = Движения.РеализованныеТовары.Выгрузить();
	ТаблицаСписанийПартийРеализованных.Свернуть("ДоговорВзаиморасчетов","СуммаУпр");
	
	ТаблицаСписанийПартийРеализованных.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
	Для Каждого СтрокаСписания Из ТаблицаСписанийПартийРеализованных Цикл
		Если БалансВедетсяПоПодразделениям Тогда
			СтрокаСписания.Подразделение = СтрокаСписания.ДоговорВзаиморасчетов.ПодразделениеКомпании;
		Иначе
			СтрокаСписания.Подразделение = ШапкаДокумента.ПодразделениеКомпании;
		КонецЕсли;
	КонецЦикла;	
	ТаблицаСписанийПартийРеализованных.Свернуть("Подразделение", "СуммаУпр");
	
	Для Каждого СтрокаСписания Из ТаблицаСписанийПартийРеализованных Цикл
		НаборЗаписейДоходыИРасходы = Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
		НаборЗаписейДоходыИРасходы.Подразделение          = СтрокаСписания.Подразделение;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Себестоимость;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Истина;
		НаборЗаписейДоходыИРасходы.Доход                  = СтрокаСписания.СуммаУпр;	
		НаборЗаписейДоходыИРасходы.ШапкаДокумента         = ШапкаДокумента;
		Отказ = НЕ НаборЗаписейДоходыИРасходы.Расход() ИЛИ Отказ;
	КонецЦикла;
	
	Если Марки.Количество()>0 Тогда
		ОрганизацияЕГАИС = Справочники.КлассификаторОрганизацийЕГАИС.НайтиКлассификаторОрганизации(ШапкаДокумента.Организация, ШапкаДокумента.ПодразделениеКомпании, ШапкаДокумента.Организация.ИНН, ШапкаДокумента.ПодразделениеКомпании.КПП);
		Если ЗначениеЗаполнено(ОрганизацияЕГАИС) Тогда
			ТаблицаДвижений = ПолучитьДвиженияПоМаркамСмены(ШапкаДокумента.Дата, ОрганизацияЕГАИС, ДокументСсылка, МоментВремени());
			Движения.ОстаткиМарокЕГАИС.Загрузить(ТаблицаДвижений);
			Движения.ОстаткиМарокЕГАИС.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Возврат НЕ Отказ;
КонецФункции // ПровестиПоПартиям()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения = "", СтандартнаяОбработка=Истина)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ХозОперация) Тогда
		ХозОперация = Справочники.ХозОперации.АктОРеализации;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КассаККМ) Тогда
		
		Организация           = КассаККМ.Организация;
		ПодразделениеКомпании = КассаККМ.ПодразделениеКомпании;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		
		Если ТекущаяСтрока.Коэффициент = 0 Тогда
			ТекущаяСтрока.Коэффициент = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из Возвраты Цикл
		
		Если ТекущаяСтрока.Коэффициент = 0 Тогда
			ТекущаяСтрока.Коэффициент = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда 
		Возврат; 
	КонецЕсли; 
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		Если НЕ ЗначениеЗаполнено(ДатаПоследнегоДокумента) Тогда
			ДатаПоследнегоДокумента = Дата;
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ХозОперация = Справочники.ХозОперации.АктОРеализации Тогда
		Для Каждого ТекСтрока Из Товары Цикл
			ТекСтрока.МестоРазмещения = СкладКомпании;
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из Возвраты Цикл
			ТекущаяСтрока.МестоРазмещения = СкладКомпании;
		КонецЦикла;
	КонецЕсли;
	
	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоВзаиморасчетамПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоПартиямПередПроведением(Ссылка, ДополнительныеСвойства);

КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Получим способ ведения баланса.
	БалансВедетсяПоПодразделениям = БалансВедетсяПоПодразделениям(Дата);
	
	Если Возвраты.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗакрытиеСменыВозвраты.Номенклатура,
		|	ЗакрытиеСменыВозвраты.ХарактеристикаНоменклатуры,
		|	ВЫБОР
		|		КОГДА ЗакрытиеСменыВозвраты.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктОРеализации)
		|			ТОГДА &СкладКомпании
		|		ИНАЧЕ ЗакрытиеСменыВозвраты.МестоРазмещения
		|	КОНЕЦ КАК СкладКомпании,
		|	МАКСИМУМ(ЗакрытиеСменыВозвраты.Цена) КАК ЦенаРозничная,
		|	МАКСИМУМ(ЗакрытиеСменыВозвраты.СуммаВсего) КАК СуммаРозничная,
		|	МАКСИМУМ(ЗакрытиеСменыВозвраты.СуммаСкидки) КАК СуммаСкидки,
		|	СУММА(ЗакрытиеСменыВозвраты.Количество * ЗакрытиеСменыВозвраты.Коэффициент) КАК Количество
		|ИЗ
		|	Документ.ЗакрытиеСмены.Возвраты КАК ЗакрытиеСменыВозвраты
		|ГДЕ
		|	ЗакрытиеСменыВозвраты.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗакрытиеСменыВозвраты.Номенклатура,
		|	ЗакрытиеСменыВозвраты.ХарактеристикаНоменклатуры,
		|	ВЫБОР
		|		КОГДА ЗакрытиеСменыВозвраты.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктОРеализации)
		|			ТОГДА &СкладКомпании
		|		ИНАЧЕ ЗакрытиеСменыВозвраты.МестоРазмещения
		|	КОНЕЦ";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
		
		НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
		НаборЗаписейОстатки.РежимПроведения=РежимПроведения;
		НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейОстатки.РезультатЗапросаПоТоварам=Запрос.Выполнить().Выгрузить();
		//если АктОРеализации тогда склад берем из шапки документа
		НаборЗаписейОстатки.СкладКомпании = ?(ХозОперация = Справочники.ХозОперации.АктОРеализации,СкладКомпании,Неопределено);
		НаборЗаписейОстатки.Приходовать=Истина;
		НаборЗаписейОстатки.ПоБазовомуКоличеству=Ложь;
		НаборЗаписейОстатки.Резервировать=Ложь;
		НаборЗаписейОстатки.ДвиженияПоРознице=Истина;
		НаборЗаписейОстатки.РазрешитьПереоценку = Ложь;
		НаборЗаписейОстатки.ЕстьРозничнаяСумма = Истина;
		НаборЗаписейОстатки.ИмяРеквизитаЦенаРозничная="Цена";
		НаборЗаписейОстатки.ИмяРеквизитаСуммаРозничная="СуммаВсего";
		Отказ=НЕ НаборЗаписейОстатки.Приход() ИЛИ Отказ;
		Если НЕ Отказ Тогда
			НаборЗаписейОстатки.ДополнительныеСвойства.Вставить("РассчитатьОстаток", Ложь);
			НаборЗаписейОстатки.Записать();
		КонецЕсли;
	КонецЕсли;
	
	// проведем остатки товаров
	НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	НаборЗаписейОстатки.РежимПроведения=РежимПроведения;
	НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=Неопределено;
	//если АктОРеализации тогда склад берем из шапки документа
	НаборЗаписейОстатки.СкладКомпании = ?(ХозОперация = Справочники.ХозОперации.АктОРеализации,СкладКомпании,Неопределено);
	НаборЗаписейОстатки.Приходовать=Истина;
	НаборЗаписейОстатки.ПоБазовомуКоличеству=Ложь;
	НаборЗаписейОстатки.Резервировать=Ложь;
	НаборЗаписейОстатки.ДвиженияПоРознице=Истина;
	НаборЗаписейОстатки.ЕстьСуммаСкидки=Истина;
	НаборЗаписейОстатки.ИмяРеквизитаЦенаРозничная="Цена";
	НаборЗаписейОстатки.ИмяРеквизитаСуммаРозничная="СуммаВсего";
	НаборЗаписейОстатки.ГраницаРасчетаОстатков = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	Отказ=НЕ НаборЗаписейОстатки.Расход() ИЛИ Отказ;
	
	// проведем партии товаров
	Отказ=НЕ ПровестиПоПартиям(РежимПроведения,Ссылка) ИЛИ Отказ;
	
	// ANDV Проведем деньги по кассе ККМ
	НаборЗаписейКассыККМ=Движения.КассыККМ;
	СуммаОплатыПоКассе =0;
	Для каждого СтрокаОплаты Из Оплаты Цикл
		
		Если СтрокаОплаты.ТипОплаты.ВидОплаты = Перечисления.ВидыОплат.Наличные Тогда
			
			Если (СтрокаОплаты.Сумма-СтрокаОплаты.СуммаВозврат)<>0 Тогда
				НаборЗаписейКассыККМ.ДокументОбъект 	= ЭтотОбъект;
				НаборЗаписейКассыККМ.РежимПроведения 	= РежимПроведения;
				НаборЗаписейКассыККМ.КассаККМ 			= СтрокаОплаты.Касса;
				НаборЗаписейКассыККМ.СпособОплаты 		= СтрокаОплаты.ТипОплаты;
				НаборЗаписейКассыККМ.Сумма 				= (СтрокаОплаты.Сумма-СтрокаОплаты.СуммаВозврат);
				Отказ = НЕ НаборЗаписейКассыККМ.Приход() ИЛИ Отказ;
			КонецЕсли;
		Иначе
			Если СтрокаОплаты.Сумма<>0 Тогда
				НаборЗаписейКассыККМ.ДокументОбъект 	= ЭтотОбъект;
				НаборЗаписейКассыККМ.РежимПроведения 	= РежимПроведения;
				НаборЗаписейКассыККМ.КассаККМ 			= СтрокаОплаты.Касса;
				НаборЗаписейКассыККМ.СпособОплаты 		= СтрокаОплаты.ТипОплаты;
				НаборЗаписейКассыККМ.Сумма 				= СтрокаОплаты.Сумма;
				Отказ = НЕ НаборЗаписейКассыККМ.Приход() ИЛИ Отказ;
			КонецЕсли;
			Если СтрокаОплаты.СуммаВозврат <> 0 Тогда
				НаборЗаписейКассыККМ.ДокументОбъект = ЭтотОбъект;
				НаборЗаписейКассыККМ.РежимПроведения= РежимПроведения;
				НаборЗаписейКассыККМ.КассаККМ 		= СтрокаОплаты.Касса;
				НаборЗаписейКассыККМ.СпособОплаты 	= СтрокаОплаты.ТипОплаты;
				НаборЗаписейКассыККМ.Сумма			= -СтрокаОплаты.СуммаВозврат;
				Отказ = НЕ НаборЗаписейКассыККМ.Приход() ИЛИ Отказ;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаОплаты.ТипОплаты.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Наличные ИЛИ СтрокаОплаты.ТипОплаты.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Электронно Тогда
			СуммаОплатыПоКассе = СуммаОплатыПоКассе+СтрокаОплаты.Сумма-СтрокаОплаты.СуммаВозврат;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаОплаты из ВозвратОплаты Цикл
		
		Если СтрокаОплаты.ТипОплаты.ВидОплаты = Перечисления.ВидыОплат.Наличные Тогда
			
			Если СтрокаОплаты.Сумма<>0 Тогда
				НаборЗаписейКассыККМ.ДокументОбъект 	= ЭтотОбъект;
				НаборЗаписейКассыККМ.РежимПроведения 	= РежимПроведения;
				НаборЗаписейКассыККМ.КассаККМ 			= СтрокаОплаты.Касса;
				НаборЗаписейКассыККМ.СпособОплаты 		= СтрокаОплаты.ТипОплаты;
				НаборЗаписейКассыККМ.Сумма 				= -СтрокаОплаты.Сумма;
				Отказ = НЕ НаборЗаписейКассыККМ.Приход() ИЛИ Отказ;
			КонецЕсли;
		Иначе
			Если СтрокаОплаты.Сумма <> 0 Тогда
				НаборЗаписейКассыККМ.ДокументОбъект = ЭтотОбъект;
				НаборЗаписейКассыККМ.РежимПроведения= РежимПроведения;
				НаборЗаписейКассыККМ.КассаККМ 		= СтрокаОплаты.Касса;
				НаборЗаписейКассыККМ.СпособОплаты 	= СтрокаОплаты.ТипОплаты;
				НаборЗаписейКассыККМ.Сумма			= -СтрокаОплаты.Сумма;
				Отказ = НЕ НаборЗаписейКассыККМ.Приход() ИЛИ Отказ;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаОплаты.ТипОплаты.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Наличные ИЛИ
			СтрокаОплаты.ТипОплаты.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Электронно Тогда
			 СуммаОплатыПоКассе = СуммаОплатыПоКассе-СтрокаОплаты.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	// подготовим таблицу движений в разрезе подразделений по взаиморасчетам
	ТаблицаВзаиморасчетов = Новый ТаблицаЗначений();
	ТаблицаВзаиморасчетов.Колонки.Добавить("Сумма");
	ОписаниеТипов=Новый ОписаниеТипов;
	ОписаниеТипов.Типы().Добавить(Тип("СправочникСсылка.ПодразделенияКомпании"));
	ТаблицаВзаиморасчетов.Колонки.Добавить("Подразделение",ОписаниеТипов);
	
	// проведем взаиморасчеты
	Для каждого СтрокаОплаты Из Оплаты Цикл
		Если (СтрокаОплаты.ТипОплаты.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Предоплата
			ИЛИ СтрокаОплаты.ТипОплаты.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Постоплата)
			И НЕ СтрокаОплаты.ТипОплаты.ВидОплаты = Перечисления.ВидыОплат.ЗаСчетЗаведения Тогда
			
			Если (СтрокаОплаты.Сумма > 0) Тогда
				НаборЗаписейВзаиморасчеты=Движения.ВзаиморасчетыКомпании;
				НаборЗаписейВзаиморасчеты.ДокументОбъект		= ЭтотОбъект;
				НаборЗаписейВзаиморасчеты.РежимПроведения		= РежимПроведения;
				НаборЗаписейВзаиморасчеты.Контрагент			= СтрокаОплаты.Контрагент;
				НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов = СтрокаОплаты.ДоговорВзаиморасчетов;
				НаборЗаписейВзаиморасчеты.Сделка = Неопределено;
				НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем = Истина;
				НаборЗаписейВзаиморасчеты.Сумма = СтрокаОплаты.Сумма;
				НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц = 0;
				Отказ = НЕ НаборЗаписейВзаиморасчеты.Приход() ИЛИ Отказ;
				
				// доходы и расходы по суммовым разницам
				СуммаДоходаРасходаСуммовыхРазниц=НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
				Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
					НаборЗаписейДиР = Движения.ДоходыИРасходы;
					НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
					Если БалансВедетсяПоПодразделениям Тогда
						НаборЗаписейДиР.Подразделение  = СтрокаОплаты.ДоговорВзаиморасчетов.ПодразделениеКомпании;
					КонецЕсли;
					НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
					НаборЗаписейДиР.ВУпрВалюте = Истина;
					Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
						НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
					Иначе
						НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
					КонецЕсли;
					Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
				КонецЕсли;
			КонецЕсли;
			Если (СтрокаОплаты.СуммаВозврат > 0) Тогда
				НаборЗаписейВзаиморасчеты=Движения.ВзаиморасчетыКомпании;
				НаборЗаписейВзаиморасчеты.ДокументОбъект		= ЭтотОбъект;
				НаборЗаписейВзаиморасчеты.РежимПроведения		= РежимПроведения;
				НаборЗаписейВзаиморасчеты.Контрагент			= СтрокаОплаты.Контрагент;
				НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов = СтрокаОплаты.ДоговорВзаиморасчетов;
				НаборЗаписейВзаиморасчеты.Сделка = Неопределено;
				НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем = Истина;
				НаборЗаписейВзаиморасчеты.Сумма = -СтрокаОплаты.СуммаВозврат;
				НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц = 0;
				Отказ = НЕ НаборЗаписейВзаиморасчеты.Приход() ИЛИ Отказ;
				
				// доходы и расходы по суммовым разницам
				СуммаДоходаРасходаСуммовыхРазниц=НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
				Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
					НаборЗаписейДиР = Движения.ДоходыИРасходы;
					НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
					Если БалансВедетсяПоПодразделениям Тогда
						НаборЗаписейДиР.Подразделение = СтрокаОплаты.ДоговорВзаиморасчетов.ПодразделениеКомпании;
					КонецЕсли;
					НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
					НаборЗаписейДиР.ВУпрВалюте = Истина;
					Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
						НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
					Иначе
						НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
					КонецЕсли;
					Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаВзаиморасчетов = ТаблицаВзаиморасчетов.Добавить();
			СтрокаВзаиморасчетов.Подразделение = СтрокаОплаты.ДоговорВзаиморасчетов.ПодразделениеКомпании;
			СтрокаВзаиморасчетов.Сумма = СтрокаОплаты.Сумма-СтрокаОплаты.СуммаВозврат;
			
			Если Отказ Тогда Прервать; КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаОплаты из ВозвратОплаты Цикл
		Если (СтрокаОплаты.ТипОплаты.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Предоплата ИЛИ
			 СтрокаОплаты.ТипОплаты.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Постоплата) И
			 НЕ СтрокаОплаты.ТипОплаты.ВидОплаты = Перечисления.ТипыОплатыВРознице.ЗаСчетЗаведения Тогда
			
			Если (СтрокаОплаты.Сумма > 0) Тогда
				НаборЗаписейВзаиморасчеты=Движения.ВзаиморасчетыКомпании;
				НаборЗаписейВзаиморасчеты.ДокументОбъект		= ЭтотОбъект;
				НаборЗаписейВзаиморасчеты.РежимПроведения		= РежимПроведения;
				НаборЗаписейВзаиморасчеты.Контрагент			= СтрокаОплаты.Контрагент;
				НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов = СтрокаОплаты.ДоговорВзаиморасчетов;
				НаборЗаписейВзаиморасчеты.Сделка = Неопределено;
				НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем = Истина;
				НаборЗаписейВзаиморасчеты.Сумма = -СтрокаОплаты.Сумма;
				НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц = 0;
				Отказ = НЕ НаборЗаписейВзаиморасчеты.Приход() ИЛИ Отказ;
				
				// доходы и расходы по суммовым разницам
				СуммаДоходаРасходаСуммовыхРазниц=НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
				Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
					НаборЗаписейДиР = Движения.ДоходыИРасходы;
					НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
					Если БалансВедетсяПоПодразделениям Тогда
						НаборЗаписейДиР.Подразделение = СтрокаОплаты.ДоговорВзаиморасчетов.Подразделение;
					КонецЕсли;
					НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
					НаборЗаписейДиР.ВУпрВалюте = Истина;
					Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
						НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
					Иначе
						НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
					КонецЕсли;
					Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаВзаиморасчетов = ТаблицаВзаиморасчетов.Добавить();
			СтрокаВзаиморасчетов.Подразделение = СтрокаОплаты.ДоговорВзаиморасчетов.Подразделение;
			СтрокаВзаиморасчетов.Сумма = -СтрокаОплаты.Сумма;
			
			Если Отказ Тогда Прервать; КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Проведем сумму выручки по доходам и расходам
	
	ТаблицаВзаиморасчетов.Свернуть("Подразделение","Сумма");
	Для Каждого СтрокаСписания Из ТаблицаВзаиморасчетов Цикл
		НаборЗаписейДоходыИРасходы = Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект = ЭтотОбъект;
		Если БалансВедетсяПоПодразделениям Тогда
			НаборЗаписейДоходыИРасходы.Подразделение = СтрокаСписания.Подразделение;
		КонецЕсли;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.НачислениеДебиторскойЗадолженностиПоТовару;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Ложь;
		НаборЗаписейДоходыИРасходы.Доход                  = СтрокаСписания.Сумма;	
		Отказ = НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	КонецЦикла;
	
	Если СуммаОплатыПоКассе<>0 Тогда
		НаборЗаписейДоходыИРасходы = Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект = ЭтотОбъект;
		Если БалансВедетсяПоПодразделениям Тогда
			НаборЗаписейДоходыИРасходы.Подразделение = КассаККМ.ПодразделениеКомпании;
		КонецЕсли;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте             = (ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Выручка;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Ложь;
		НаборЗаписейДоходыИРасходы.Доход                  = СуммаОплатыПоКассе;
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ОбработкаПроведенияНакопленияПоКарточкамКонтрагентов();
	КонецЕсли;
	
	// Оптимизируем чеки, если таковые имеются
	Если НЕ Отказ Тогда
		ОфлайнОборудованиеPOSСуперМАГВызовСервера.ВыполнитьСверткуЧеков(Ссылка);
	КонецЕсли;	
	
	// Возможно расхождение баланса на "копейки" из-за округления. Возникшую разницу
	// необходимо списать на доходы и расходы.
	Отказ = НЕ ОбработкаСобытийДокументаСервер.СписаниеКопейкиПриОкругленииВалютныхСчетов(ЭтотОбъект) ИЛИ Отказ;
	
	// двигаем границу последовательности взаиморасчетов
	РаботаСГраницами.СдвинутьГраницуВзаиморасчетов(Ссылка, ДополнительныеСвойства, Движения);
	
КонецПроцедуры // ОбработкаПроведения()


#Область Инициализация

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ДополнительныеСвойства.Вставить("ЧекиВыборка", Неопределено);

#КонецОбласти

#КонецЕсли