// Общий модуль "Управление диалогом документа (сервер)"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедуры производит инициализацию служебных реквизитов формы списка.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которую производиться добавление реквизитов.
//
Процедура ИнициализироватьСлужебныеРеквизиты(Форма, Объект)
	
	// Составим перечень добавляемых в форму реквизитов
	СлужебныеРеквизиты = Новый Структура();
	СлужебныеРеквизиты.Вставить("ПолноеИмяОбъекта", Объект.Ссылка.Метаданные().ПолноеИмя());
	СлужебныеРеквизиты.Вставить("ИзменениеЗапрещено", Ложь);
	СлужебныеРеквизиты.Вставить("ИмяДополнительнойФормы", УправлениеДиалогомВызовСервера.ПолучитьИмяДополнительнойФормыОбъекта(Объект.Ссылка));
		
	Если НЕ Форма.Элементы.Найти("НадписьНалоговыйДокумент") = Неопределено Тогда
		СлужебныеРеквизиты.Вставить("НалоговыйДокумент",ЗащищенныеФункцииСервер.УстановитьЗаголовокНадписиНалоговыйДокумент(Форма, Объект));
	КонецЕсли;
	
	// Список Анкет для опроса контрагента
	Анкеты = Новый СписокЗначений;
	СлужебныеРеквизиты.Вставить("Анкеты",Анкеты);
	СлужебныеРеквизиты.Вставить("РеспондентОпроса",Неопределено);
	
	// Проверим возможность штрихкодирования документа
	Если ШтрихкодированиеВызовСервера.ИспользоватьШтрихкодирование(Объект.Ссылка) Тогда
		СлужебныеРеквизиты.Вставить("Штрихкод", ШтрихкодированиеВызовСервера.ПолучитьШтрихКодОбъекта(Объект.Ссылка));
	КонецЕсли;
	
	// Добавлено получение параметров для подключаемого оборудования 
	СлужебныеРеквизиты.Вставить("ИспользоватьПодключаемоеОборудование", МенеджерОборудованияВызовСервераПереопределяемый.ИспользоватьПодключаемоеОборудование());
	СлужебныеРеквизиты.Вставить("ПоддерживаемыеТипыПодключаемогоОборудования",Неопределено);
	
	РазрешитьРедактироватьЗакупочныеЦены = Ложь;
	Если ЕстьРеквизит(Объект, "ДоговорВзаиморасчетов") Тогда
		РазрешитьРедактироватьЗакупочныеЦены = Объект.ДоговорВзаиморасчетов.РазрешитьРедактироватьЗакупочныеЦены;
	КонецЕсли;
	
	// Признак разрешения пользователю редактировать реквизиты объекта
	СлужебныеРеквизиты.Вставить("РазрешитьРедактированиеЦенИСумм", РазрешитьРедактироватьЗакупочныеЦены ИЛИ ПравоПользователя("РедактированиеЦенИСуммВНоменклатурныхТаблицах", Объект));
	
	// Закэшируем значения прав пользователя и параметры сеанса.
	СлужебныеРеквизиты.Вставить("ПравоПерезаписьПодразделения", ПравоПользователя("ПерезаписьПодразделения", Объект));
	СлужебныеРеквизиты.Вставить("ПодразделениеКомпании",        ПараметрыСеанса.ПодразделениеКомпании);
	СлужебныеРеквизиты.Вставить("ПравоПерезаписьАвтора",        ПравоПользователя("ПерезаписьАвтора", Объект));
	СлужебныеРеквизиты.Вставить("Автор",                        ПараметрыСеанса.ТекущийПользователь);
	
	// Производим создание дополнительных реквизитов формы
	УправлениеДиалогомСервер.ДобавитьРеквизитыФормы(Форма, СлужебныеРеквизиты);
	
КонецПроцедуры // ИнициализироватьСлужебныеРеквизиты()

Процедура ПереустановитьДоступРедактированияЦенИСумм(Форма, Объект) Экспорт
	
	Если НЕ ЕстьРеквизит(Форма, "РазрешитьРедактированиеЦенИСумм") Тогда
		Возврат;
	КонецЕсли;
	
	РазрешитьРедактироватьЗакупочныеЦены = Ложь;
	Если ЕстьРеквизит(Объект, "ДоговорВзаиморасчетов") Тогда
		РазрешитьРедактироватьЗакупочныеЦены = Объект.ДоговорВзаиморасчетов.РазрешитьРедактироватьЗакупочныеЦены;
	КонецЕсли;
	
	// Признак разрешения пользователю редактировать реквизиты объекта
	Форма.РазрешитьРедактированиеЦенИСумм = (РазрешитьРедактироватьЗакупочныеЦены ИЛИ ПравоПользователя("РедактированиеЦенИСуммВНоменклатурныхТаблицах", Объект));
	
	// Установим вариант отображения цен и сумм
	Обработка = Обработки.ЗащитаТОР.Создать();
	Обработка.УстановитьДоступностьКолонокЦенИСумм(Форма, "Товары",,Объект);
	//ЗащищенныеФункцииСервер.УстановитьДоступностьКолонокЦенИСумм(Форма, "Товары",,Объект);
	
КонецПроцедуры

// Процедуры производит инициализацию команд в форме объекта.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура ИнициализироватьКомандыПанелиДействий(Форма, Объект)
	
	// Определим в какую панель формы необходимо помещать новые кнопки
	ИмяКоманднойПанелиФормы = ?(Форма.Элементы.Найти("ОсновныеДействия")=Неопределено, "ФормаКоманднаяПанель", "ОсновныеДействия");
	
	// Произведем добавление панели для размещения дополнительных операций с формой
	НазначитьДополнительныеДействия = (НЕ Форма.Элементы.Найти("ДополнительныеДействия")=Неопределено);
	
	// Получим описание метаданных текущего объекта
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Форма.ПолноеИмяОбъекта);
	
	// Команда настройки дополнительных параметров объекта
	ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "НастроитьПараметрыДокумента", ИмяКоманднойПанелиФормы, БиблиотекаКартинок.ПараметрыДокумента, НСтр("ru = 'Параметры'"), НСтр("ru = 'Расширенное редактирование параметров документа'"), ЛОЖЬ,,, ОтображениеКнопки.КартинкаИТекст);
	
	// Инициализируем элементы формы связанные с Дополнительными отчетами и обработками.
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(Форма, "ФормаОбъекта");
	
	// Создаем подменю печати
	ПодменюПечати = ЗащищенныеФункцииСервер.ДобавитьГруппуКоманд(Форма, "ПодменюПечать", ИмяКоманднойПанелиФормы,, НСтр("ru = 'Печать'"), БиблиотекаКартинок.ПодменюПечать,НСтр("ru = 'Подменю печати'"),, ОтображениеКнопки.Картинка);
	
	// Добавим команды печати
	УправлениеПечатью.ПриСозданииНаСервере(Форма, ПодменюПечати);
	
	// Добавим команды печати комплектов
	УправлениеПечатьюПлатформа.ДобавитьКомандыПечатиКомплекта(Форма,ПодменюПечати);
	
	// Для уже записанных объектов обновление свойств команд печати
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗащищенныеФункцииСервер.УстановитьПараметрыКомандПечати(Форма, Объект);
	КонецЕсли;
	
	// Подсистема "ОбменСКонтрагентами".
	Если НЕ Форма.Элементы.Найти("ДекорацияСостояниеЭДО") = Неопределено Тогда
		ПараметрыЭДОПриСоздании= ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
		ПараметрыЭДОПриСоздании.Форма = Форма;
		ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
		ПараметрыЭДОПриСоздании.ДекорацияСостояниеЭДО = Форма.Элементы.ДекорацияСостояниеЭДО;
		ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Форма.Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(Ложь, Истина, ПараметрыЭДОПриСоздании);
	КонецЕсли;
	// Конец подсистема "ОбменСКонтрагентами".
	
	// Добавим команды утверждения документов.
	УтверждениеДокументовСервер.ПриСозданииНаСервере(Форма, Объект);
	
	// Написать письмо в тех поддержку
	ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ПисьмоВТехПоддержку", "ФормаМенюДополнительныхФункций", , НСтр("ru = 'Написать письмо в поддержку'"), НСтр("ru = 'Написать письмо в поддержку'"), ЛОЖЬ);

	// Просмотр структуры подчиненности объекта
	ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ПодчиненныеДокументы", ИмяКоманднойПанелиФормы, БиблиотекаКартинок.ПодчиненныеДокументы, НСтр("ru = 'Подчиненные документы'"), НСтр("ru = 'Просмотр структуры подчиненности документов'"), ЛОЖЬ);
	
	// Производим инициализацию дополнительных команд формы списка
	Если НазначитьДополнительныеДействия Тогда
		
		// Если объект не содержит фискальные реквизиты и его основании можно ввести Чек на оплату,
		// то добавим команду оплаты.
		Если (НЕ ЕстьРеквизит(ОбъектМетаданных, "НомерЧека")) И Метаданные.Документы.ЧекНаОплату.ВводитсяНаОсновании.Содержит(ОбъектМетаданных) И ПравоДоступа("Добавление", Метаданные.Документы.ЧекНаОплату) И (ПолучитьФункциональнуюОпцию("ИспользоватьРозничнаяТорговля") ИЛИ ПолучитьФункциональнуюОпцию("ИспользованиеПодключаемогоОборудования")) Тогда
			ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ОплатитьЧерезКассу", "ДополнительныеДействия", БиблиотекаКартинок.ОплатитьЧерезКассу, НСтр("ru = 'Оплатить'"), НСтр("ru = 'Оплатить через кассу'"), ЛОЖЬ,,, ОтображениеКнопки.КартинкаИТекст);
		КонецЕсли;
		
		// Добавим анкеты для опроса контрагентов
		Если ЕстьРеквизит(Объект,"Контрагент") Тогда 
			АнкетированиеПлатформаСервер.СформироватьМенюАнкетирование(Форма, "ДополнительныеДействия",Объект.Контрагент);
		КонецЕсли;
		
		// Пункт меню для открытия дополнительной формы редактирования объекта
		Если ЗначениеЗаполнено(Форма.ИмяДополнительнойФормы) ИЛИ ЕстьРеквизит(ОбъектМетаданных, "Комментарий") Тогда
			ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ДополнительнаяФорма", "ДополнительныеДействия", БиблиотекаКартинок.РедактироватьВДиалоге, НСтр("ru = 'Дополнительная форма'"), НСтр("ru = 'Открыть дополнительную форму редактирования'"),,,,,, Новый СочетаниеКлавиш(Клавиша.L, Истина));
		КонецЕсли;
		
		// Формируем секцию дополнительных действий формы
		ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ПросмотрДвижений",  "ДополнительныеДействия", БиблиотекаКартинок.ПросмотрДвижений,       НСтр("ru = 'Просмотр движений'"),       НСтр("ru = 'Просмотр движений текущего документа'"),,,,,, Новый СочетаниеКлавиш(Клавиша.F2, ИСТИНА));
		ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ЖурналРегистрации", "ДополнительныеДействия", БиблиотекаКартинок.ЖурналРегистрации,      НСтр("ru = 'Журнал регистрации'"),      НСтр("ru = 'Журнал регистрации'"));
		
		// Проверим использование дополнительных сведений для данного документа
		Если УправлениеСвойствами.ИспользоватьДопСведения(Объект.Ссылка) Тогда
			ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ДополнительныеСведения", "ДополнительныеДействия", БиблиотекаКартинок.ДополнительныеСведения, НСтр("ru = 'Дополнительные сведения'"), НСтр("ru = 'Дополнительные сведения'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ИнициализироватьКомандыПанелиДействий()

// Процедура производит настройку параметров выбора номенклатуры.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется формирование представления итогов.
//
Процедура НастроитьПараметрыВыбораНоменклатуры(Форма, Объект)
	
	// Получим параметры выбора для текущего объекта
	НастройкиВыбораНоменклатуры = ПроверитьВозможныеОперацийСНоменклатурой(Объект);
	
	Если НастройкиВыбораНоменклатуры.ЗапретЗакупки Тогда
		УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Форма.Элементы.ТоварыНоменклатура.ПараметрыВыбора, "Отбор.ЗапретЗакупки", ЛОЖЬ);
	КонецЕсли;
	
	Если НастройкиВыбораНоменклатуры.ЗапретПродажи Тогда
		УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Форма.Элементы.ТоварыНоменклатура.ПараметрыВыбора, "Отбор.ЗапретПродажи", ЛОЖЬ);
	КонецЕсли;
	
КонецПроцедуры // НастроитьПараметрыВыбораНоменклатуры()

// Процедура производит возможность редактирования документа при наличии подчиненных документов.
//
// Параметры:
//  Форма  - УправляемаяФорма - Форма, в которой возникло событие.
//  Объект - ДокументСсылка   - Объект, для которого выполняется формирование представления итогов.
//
Процедура ПроверитьНаличиеПодчиненныхДокументов(Форма, Объект) Экспорт
	
	Если НЕ ОбщегоНазначения.ЭтоДокумент(Объект.Метаданные())
		ИЛИ Форма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	ТолькоПросмотр = Ложь;
	
	ОбработкаСобытийДокументаСервер.ПроверитьРедактированиеДокументаПриНаличииПодчиненных(Объект, ТолькоПросмотр);
	
	Форма.ТолькоПросмотр = ТолькоПросмотр;
	
КонецПроцедуры // ПроверитьНаличиеПодчиненныхДокументов()

// Процедура производит проверку возможности неоперативного проведения будущей датой
Процедура ПроверитьПроведениеБудущейДатой(Форма, Объект)
	Форма.ИспользоватьРежимПроведения = ИспользованиеРежимаПроведения.Авто;
	Если НачалоДня(Объект.Дата)>НачалоДня(ТекущаяДата()) Тогда
		Если ПравоПользователя("ПроведениеДатойБольшеТекущей",Объект)=Истина Тогда
			Форма.ИспользоватьРежимПроведения = ИспользованиеРежимаПроведения.Неоперативный;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Общий обработчик события настройки параметров выбора элементов управления диалога в зависимости от значений
// реквизитов объекта.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура НастроитьПараметрыВыбораЭлементовФормы(Форма, Объект = Неопределено) Экспорт
	
	// Настроим параметры выбора реквизитов зависящих от ХозОперации
	ЗащищенныеФункцииСервер.НастроитьПараметрыВыбораЭлементовФормыДокументы(Форма, Объект);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Общий обработчик события настройки параметров отображения элементов формы в зависимости от значений реквизитов
// объекта.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура УправлениеДиалогомНаСервере(Форма, Объект = Неопределено) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Обновляем заголовок формы документа
	ОбработкаПолученияПредставления(Неопределено, Объект, Форма.Заголовок);
	
	// Обновляем заголовок надписи итоговой суммы по документу
	ЗащищенныеФункцииСервер.УстановитьЗаголовокНадписиСуммаДокумента(Форма, Объект);
	
	// Обновляем заголовок индикатора состояния договора с контрагентом
	ЗащищенныеФункцииСервер.УстановитьЗаголовокНадписиВзаиморасчеты(Форма,, Объект);
	
	// Обновляем заголовок индикатора состояния кассы
	ЗащищенныеФункцииСервер.УстановитьЗаголовокНадписиДенежныеСредства(Форма,, Объект);
	
	// Установим видимость колонки "Сумма списания"
	УстановитьВидимостьКолонкиСуммаСписания(Форма, Объект);
	
	// Установим видимость колонки "Ячейка"
	УстановитьВидимостьКолонкиЯчейка(Форма,, Объект);
	
	// Обновляем текст подвала в колонке Номенклатура
	Если ЕстьРеквизит(Форма, "ТоварыНоменклатурыТекстПодвала") Тогда
		УстановитьНадписьПодвалаКолонкиНоменклатура(Форма.ТоварыНоменклатурыТекстПодвала, Объект);
	КонецЕсли;
	
	// Установим заголовки колонок цены и суммы в ТЧ "Товары"
	Если ЕстьРеквизит(Объект, "ТипЦен") Тогда
		УстановитьЗаголовокКолонок(Форма, Объект);
	КонецЕсли;
	
	// Дальнейшие операции имеют смысл только когда формы не находится в режиме просмотра.
	Если Форма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	// Установить доступность колонки суммы всего
	УстановитьДоступностьКолонкиСуммаВсего(Форма, Объект);
	
	// Установить доступность колонки суммы всего
	УстановитьДоступностьФлагаАвтоЗакрытиеСделок(Форма, Объект);
	
	// Расставим признаки обязательности заполнения реквизитов формы
	УправлениеДиалогомСервер.РасставитьАвтоотметкиНезаполненного(Форма,,, Объект);
	
	// Установим доступность и видимость команд заполнения
	ЗащищенныеФункцииСервер.УстановитьПараметрыКомандЗаполнения(Форма, Объект);
	
	// Установим доступность и видимость команд печати
	ЗащищенныеФункцииСервер.УстановитьПараметрыКомандПечати(Форма, Объект);
	
	// Установим доступность и видимость дополнительных реквизитов формы
	УправлениеСвойствамиПлатформа.ОбновитьЗависимостиДополнительныхРеквизитов(Форма, Объект);
	
	// Семья. Установить доступность флага "Документ центрального офиса".
	Если ЕстьРеквизит(Объект, "ДокументЦентральногоОфиса") Тогда
		// Определим, имеет ли смысл давать возможность пользователю редактировать колонку сумма всего.
		Если НЕ Форма.Элементы.Найти("ДокументЦентральногоОфиса") = Неопределено Тогда
			Форма.Элементы.ДокументЦентральногоОфиса.ТолькоПросмотр = НЕ ПравоПользователя("ПравоВводаДокументовЦО", Объект);
		КонецЕсли;		
	КонецЕсли;

	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Общий обработчик события настройки установленного условного оформления формы.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
// 	ИмяПоляВводаХарактеристики - Строка - Наименование элемента формы, содержащего характеристики номенклатуры,
//											   если оно отличается от "ТоварыХарактеристикаНоменклатуры".
//
Процедура УстановитьУсловноеОформление(Форма) Экспорт 
 
	Форма.УсловноеОформление.Элементы.Очистить();

	Если НЕ Форма.Элементы.Найти("ТоварыХарактеристикаНоменклатуры")=Неопределено Тогда
		УстановитьУсловноеОформлениеХарактеристикНоменклатуры(Форма);
	КонецЕсли;
	
КонецПроцедуры // УстановитьУсловноеОформлениеДокументов()

// Общий обработчик события выбора одного из пунктов меню доступных хоз. операций
// 
// Параметры:
//  Форма             - УправляемаяФорма          - Форма, в которой возникло событие.
//  КомандаИмя        - Строка                    - Имя команды, в которой возникло данное событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
Функция ОбработкаКомандыФормы(Форма, КомандаИмя, ПараметрыДействия = Неопределено, Объект = Неопределено) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	Если ЛЕВ(КомандаИмя, 40)="КомандаДополнительнойОбработкиЗаполнения" Тогда
		
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(Форма, КомандаИмя, РезультатВыполнения);
		Если НЕ РезультатВыполнения = Неопределено Тогда
			
			Для каждого Элемент Из РезультатВыполнения Цикл
				ПараметрыДействия.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли Лев(КомандаИмя, 21)="УтверждениеДокументов" Тогда
		
		// Изменение статуса утверждения документа.
		УтверждениеДокументовСервер.ОбработкаКомандыФормы(Форма, КомандаИмя, Объект.Ссылка, ПараметрыДействия);
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаКомандыФормы()

// Общий обработчик события возникающего при оповещении формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  Форма                   - УправляемаяФорма - Форма, в которой возникло событие.
//  РезультатОповещения     - Произвольный     - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный     - Значение, которое было указано при создании описания оповещения.
//
Функция ОбработкаРезультатаОповещения(Форма, РезультатОповещения, ДополнительныеПараметры=Неопределено, Объект = Неопределено) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Обработаем в зависимости от переданного параметра события
	Если ДополнительныеПараметры="ПараметрыДокумента" Тогда
		
		// Вызываем общий обработчик изменения данных объекта
		ОбработкаРеквизитовДокументаСервер.ПараметрыДокументаПриИзменении(Объект, РезультатОповещения);
		
		// Вызываем обработчик изменения параметров элементов управления формы
		ПараметрыДокументаПриИзменении(Форма, РезультатОповещения, Объект);
		
		// Проверим возможность проведения документа будущей датой
		ИзмененныеРеквизиты = РезультатОповещения.ИзмененныеРеквизиты;
		Если ИзмененныеРеквизиты.Свойство("Дата") Тогда 
			ПроверитьПроведениеБудущейДатой(Форма, Объект);
		КонецЕсли;
		
	ИначеЕсли ДополнительныеПараметры="РазрешенияДляПересчета" Тогда
		
		// Производим вызов соответствующего обработчика из модуля менеджера объекта
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
		МенеджерОбъекта.ОбработкаПересчетаПоказателейОбъекта(Объект, РезультатОповещения);
		
		// Установим видимость характеристики номенклатуры в табличной части и значение остатка номенклатуры.
		Если ЕстьРеквизит(Объект,,"Товары") Тогда
			
			Если ЕстьРеквизит(Объект, "Номенклатура", "Товары") Тогда
				ЗащищенныеФункцииСервер.ЗаполнитьСлужебныеРеквизитыТабличнойЧасти(Объект.Товары);
			КонецЕсли;
			
			// Обновим служебные реквизиты Алкогольной продукции
			Если ЕстьРеквизит(Объект, "АлкогольнаяПродукция", "Товары") И ЕстьРеквизит(Объект,, "Марки")Тогда
				ЗащищенныеФункцииСервер.ЗаполнитьРеквизитАлкогольнойПродукции(Объект, Объект.Товары, Объект.Марки);
			КонецЕсли;
			
			Если НЕ Форма.Элементы.Найти("ТоварыХарактеристикаНоменклатуры")=Неопределено Тогда
				ЗащищенныеФункцииСервер.УстановитьВидимостьКолонкиХарактеристикаНоменклатуры(Форма,,,Объект);
			КонецЕсли;
			
			ЗащищенныеФункцииСервер.ЗаполнитьРеквизитЦенаБезНДС(Объект);
			
			// Произведем заполнение служебного реквизита "Остаток"
			ОтображатьОстаток = (ПолучитьФункциональнуюОпцию("ИспользоватьИндикациюОстатковТовара") И (ЕстьРеквизит(Объект, "ОстатокНаСкладе", "Товары") ИЛИ ЕстьРеквизит(Объект, "ОстатокНаОрдерномСкладе", "Товары")));
			
			// Установим видимость колонки служебного реквизита "Остаток"
			Если НЕ Форма.Элементы.Найти("ТоварыОстатокНаСкладе")=Неопределено Тогда
				Форма.Элементы.ТоварыОстатокНаСкладе.Видимость = ОтображатьОстаток;
			КонецЕсли;
			
			// Проверим наличие "Остатка на складе" в табличной части
			Если ОтображатьОстаток Тогда
				ОбработкаТабличнойЧастиТовары.ЗаполнитьСлужебныйРеквизитОстатокНаСкладе(Объект);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ДополнительныеПараметры="ПоискПоШтрихКоду" Тогда
		
		Форма.НавигационнаяСсылка = ПоместитьВоВременноеХранилище(РезультатОповещения, Форма.УникальныйИдентификатор);
		ТаблицаТовары = Объект.Товары;
		
		Номенклатура = Неопределено;
		
		ТекстСтарый = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Штрихкоды.Объект КАК Ссылка
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Штрихкод = &Штрихкод
		|	И ТИПЗНАЧЕНИЯ(Штрихкоды.Объект) = ТИП(Справочник.Номенклатура)
		|	И Штрихкоды.Запрет = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул = &Штрихкод
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Код = &Штрихкод
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование = &Штрихкод
		|";
		
		Запрос = Новый Запрос(ТекстСтарый);
		Запрос.УстановитьПараметр("Штрихкод", РезультатОповещения);
		
		Номенклатура = Неопределено;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Номенклатура = Выборка.Ссылка;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			Возврат Истина;
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Номенклатура);
		НайденныеСтроки = ТаблицаТовары.НайтиСтроки(Отбор);
		
		ИдентификаторыСтрок = Новый Массив;
		Для Каждого ТекСтрока Из НайденныеСтроки Цикл
			ИдентификаторыСтрок.Добавить(ТекСтрока.ПолучитьИдентификатор());
		КонецЦикла;
		
		Если ИдентификаторыСтрок = Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
		
		Если ИдентификаторыСтрок.Количество() = 0 Тогда
			//Если ЗначениеЗаполнено(Номенклатура) Тогда
			//	НоваяСтрока = ТаблицаТовары.Добавить();
			//	НоваяСтрока.Номенклатура = Номенклатура;
			//	МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
			//	МенеджерДокумента.ТоварыНоменклатураПриИзменении(Объект, НоваяСтрока);
			//	Форма.Элементы.Товары.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
			//КонецЕсли;
			Возврат ИСТИНА;
		КонецЕсли;
		
		Если ИдентификаторыСтрок.Количество() = 1 Тогда
			Форма.Элементы.Товары.ТекущаяСтрока = ИдентификаторыСтрок[0];
			Возврат ИСТИНА;
		КонецЕсли;
		
		ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", Номенклатура);
		Форма.Элементы.Товары.ОтборСтрок = ОтборСтрок;
		ГраницаСтрок = ИдентификаторыСтрок.ВГраница();
		ИндексСтроки = Форма.Элементы.Товары.ТекущаяСтрока;
		//Для Каждого НайденныйИндекс Из ИдентификаторыСтрок Цикл
		//	Если ИндексСтроки<НайденныйИндекс Тогда
		//		Форма.Элементы.Товары.ТекущаяСтрока = НайденныйИндекс;
		//		Возврат Истина;
		//	КонецЕсли;
		//КонецЦикла;
		
		//Форма.Элементы.Товары.ТекущаяСтрока = ИдентификаторыСтрок[0];
		
		Возврат Истина;
		
	ИначеЕсли ДополнительныеПараметры="ДобавлениеНовыхПозицийПоШтрихКоду" Тогда
		
		Если НЕ ЗначениеЗаполнено(РезультатОповещения) Тогда
			Возврат ИСТИНА;
		КонецЕсли;
		РезультатОповещения = СтрЗаменить(РезультатОповещения, Символы.Таб, ",");
		РезультатОповещения = СтрЗаменить(РезультатОповещения, Символы.ПС, ",");
		РезультатОповещения = СтрЗаменить(РезультатОповещения, Символ(182), ",");
		//РезультатОповещения = СтрЗаменить(РезультатОповещения, Символы.Таб, ",");
		
		МассивШтрихкодов = СтрРазделить(РезультатОповещения, ",", Ложь);
		МассивШтрихКодовБезПробелов = Новый Массив;
		Для Каждого СтрокаМассива Из МассивШтрихкодов Цикл
			Если СокрЛП(СтрокаМассива) = "" Тогда
				Продолжить;
			КонецЕсли;
			МассивШтрихКодовБезПробелов.Добавить(СокрЛП(СтрокаМассива));
		КонецЦикла;
		
		Форма.НавигационнаяСсылка = ПоместитьВоВременноеХранилище(РезультатОповещения, Форма.УникальныйИдентификатор);
		Если Метаданные.Документы.ИзменениеРекомендуемыхНаценок = Метаданные.НайтиПоТипу(ТипЗнч(Объект.Ссылка)) Тогда
			ТаблицаТовары = Форма.ТаблицаНоменклатуры;
		Иначе
			ТаблицаТовары = Объект.Товары;
		КонецЕсли; 
		
		Номенклатура = Неопределено;
		
		ТекстСтарый = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		              |	Штрихкоды.Объект КАК Ссылка
		              |ИЗ
		              |	РегистрСведений.Штрихкоды КАК Штрихкоды
		              |ГДЕ
		              |	Штрихкоды.Штрихкод В (&Штрихкод)
		              |	И ТИПЗНАЧЕНИЯ(Штрихкоды.Объект) = ТИП(Справочник.Номенклатура)
		              |	И Штрихкоды.Запрет = ЛОЖЬ
		              |
		              |ОБЪЕДИНИТЬ
		              |
		              |ВЫБРАТЬ РАЗЛИЧНЫЕ
		              |	Номенклатура.Ссылка
		              |ИЗ
		              |	Справочник.Номенклатура КАК Номенклатура
		              |ГДЕ
		              |	Номенклатура.Артикул В(&Штрихкод)
		              |
		              |ОБЪЕДИНИТЬ
		              |
		              |ВЫБРАТЬ РАЗЛИЧНЫЕ
		              |	Номенклатура.Ссылка
		              |ИЗ
		              |	Справочник.Номенклатура КАК Номенклатура
		              |ГДЕ
		              |	Номенклатура.Код В(&Штрихкод)
		              |
		              |ОБЪЕДИНИТЬ
		              |
		              |ВЫБРАТЬ РАЗЛИЧНЫЕ
		              |	Номенклатура.Ссылка
		              |ИЗ
		              |	Справочник.Номенклатура КАК Номенклатура
		              |ГДЕ
		              |	Номенклатура.Наименование В(&Штрихкод)";
		
		Запрос = Новый Запрос(ТекстСтарый);
		Запрос.УстановитьПараметр("Штрихкод", МассивШтрихКодовБезПробелов);
		
		//Номенклатура = Неопределено;
		Выборка = Запрос.Выполнить();
		Если Выборка.Пустой() Тогда
			Возврат Истина;	
		КонецЕсли;
		// Формируем параметры поиска строки
		ПараметрыОтбора = Новый Структура("Номенклатура");
		ВыборкаНоменклатуры = Выборка.Выбрать();
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
		ТипЗначения = ТипЗнч(Объект.Ссылка);
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
		Пока ВыборкаНоменклатуры.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаНоменклатуры.Ссылка) Тогда
				ПараметрыОтбора.Номенклатура = ВыборкаНоменклатуры.Ссылка;
				НайденныеСтроки = ТаблицаТовары.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество()=0 Тогда
					НоваяСтрока = ТаблицаТовары.Добавить();
					НоваяСтрока.Номенклатура = ВыборкаНоменклатуры.Ссылка;
					МенеджерДокумента.ТоварыНоменклатураПриИзменении(Объект, НоваяСтрока);
				Иначе
					// Получим строку и увеличим в ней количество
					//Если НЕ ЕстьРеквизит(ОбъектМетаданных, "Количество", "Товары") Тогда
					//	Продолжить;
					//КонецЕсли;
					//СтрокаТабличнойЧасти = НайденныеСтроки[0];
					//СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество + 1;
					//МенеджерДокумента.ТоварыКоличествоПриИзменении(Объект, СтрокаТабличнойЧасти);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Возврат ИСТИНА;
	Иначе
		УправлениеДиалогомСервер.ОбработкаРезультатаОповещения(Форма, РезультатОповещения, ДополнительныеПараметры, Объект);
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаРезультатаОповещения()



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура производит адаптацию видимости колонок Количество и Количество (базовое).
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура УстановитьВидимостьКолонкиКоличествоБазовое(Форма, ИмяТабличнойЧасти = "Товары", Объект = Неопределено) Экспорт
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьБазовоеКоличество") И ЕстьРеквизит(Объект, "КоличествоБазовое", ИмяТабличнойЧасти) Тогда
		Форма.Элементы[ИмяТабличнойЧасти+"Количество"].Заголовок = НСтр("ru = 'Мест'");
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьКолонкиКоличествоБазовое()

// Процедура производит установку вариант отображения дополнительных полей "Код" и "Артикул".
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура УстановитьВидимостьКолонокКодАртикул(Форма, ИмяТабличнойЧасти) Экспорт
	
	// Определим вариант отображения дополнительных полей "Код" и "Артикул"
	ОтображатьАртикул = ПолучитьФункциональнуюОпцию("ИспользоватьАртикул");
	
	// Установим видимость служебных колонок в зависимости от значения функциональной опции.
	Если НЕ Форма.Элементы.Найти(ИмяТабличнойЧасти+"Артикул")=Неопределено Тогда
		Форма.Элементы[ИмяТабличнойЧасти+"Артикул"].Видимость = (ОтображатьАртикул=Перечисления.РежимыВыводаКодаВДокументах.Артикул ИЛИ ОтображатьАртикул=Перечисления.РежимыВыводаКодаВДокументах.КодИАртикул);
	КонецЕсли;
	
	Если НЕ Форма.Элементы.Найти(ИмяТабличнойЧасти+"Код")=Неопределено Тогда
		Форма.Элементы[ИмяТабличнойЧасти+"Код"]    .Видимость = (ОтображатьАртикул=Перечисления.РежимыВыводаКодаВДокументах.Код     ИЛИ ОтображатьАртикул=Перечисления.РежимыВыводаКодаВДокументах.КодИАртикул);
	КонецЕсли;
	
	Если НЕ Форма.Элементы.Найти(ИмяТабличнойЧасти+"НоменклатураПоставщикаАртикул")=Неопределено Тогда
		Форма.Элементы[ИмяТабличнойЧасти+"НоменклатураПоставщикаАртикул"].Видимость = (ОтображатьАртикул=Перечисления.РежимыВыводаКодаВДокументах.Артикул ИЛИ ОтображатьАртикул=Перечисления.РежимыВыводаКодаВДокументах.КодИАртикул);
	КонецЕсли;
	
	Если НЕ Форма.Элементы.Найти(ИмяТабличнойЧасти+"НоменклатураПоставщикаКод")=Неопределено Тогда
		Форма.Элементы[ИмяТабличнойЧасти+"НоменклатураПоставщикаКод"]    .Видимость = (ОтображатьАртикул=Перечисления.РежимыВыводаКодаВДокументах.Код     ИЛИ ОтображатьАртикул=Перечисления.РежимыВыводаКодаВДокументах.КодИАртикул);
	КонецЕсли;

КонецПроцедуры // УстановитьВидимостьКолонокКодАртикул()

// Процедура производит установку видимости колонки Ячейка.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура УстановитьВидимостьКолонкиЯчейка(Форма, ИмяТабличнойЧасти = "Товары", Объект = Неопределено) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	 
	// Определим вариант отображения дополнительных полей "Код" и "Артикул"
	ОтображатьЯчейки = ПолучитьФункциональнуюОпцию("ИспользоватьЯчейкиХранения");
	
	// Установим видимость служебных колонок в зависимости от значения функциональной опции.
	Если НЕ Форма.Элементы.Найти(ИмяТабличнойЧасти+"Ячейка")=Неопределено И ЕстьРеквизит(Объект, "СкладКомпании") Тогда
		Форма.Элементы[ИмяТабличнойЧасти+"Ячейка"].Видимость = ОтображатьЯчейки И ЗначениеЗаполнено(Объект.СкладКомпании) И (Объект.СкладКомпании.ВидСклада = Перечисления.ВидыСкладов.ОрдерныйЯчеистый ИЛИ Объект.СкладКомпании.ВидСклада = Перечисления.ВидыСкладов.Ячеистый);
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьКолонкиЯчейка()

// Процедура производит установку видимости колонок сумма списания в зависимости от прав пользователя,
// функциональной опции и состояния документа.
//
// Параметры:
//  Форма         - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура УстановитьВидимостьКолонкиСуммаСписания(Форма, Объект = Неопределено) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Установим видимость для табличной части "Товары" и "Активы"
	Если НЕ Форма.Элементы.Найти("ТоварыСуммаСписания")=Неопределено Тогда
		
		ЕстьСуммаСписания = Объект.Проведен И ПолучитьФункциональнуюОпцию("ИспользоватьИндикациюСуммыСписания") И ПравоПользователя("ПоказыватьСебестоимостьПроведения",Объект);
		Форма.Элементы["ТоварыСуммаСписания"].Видимость = ЕстьСуммаСписания;
		
		// Установим надпись подвала - общая сумма списания
		Если Форма.Элементы["ТоварыСуммаСписания"].Видимость Тогда
			Форма.Элементы["ТоварыСуммаСписания"].ТекстПодвала = Формат(Объект.Товары.Итог("СуммаСписания"), "ЧДЦ=2");
		КонецЕсли;
		
	ИначеЕсли НЕ Форма.Элементы.Найти("АктивыСуммаСписания")=Неопределено Тогда
		
		ЕстьСуммаСписания = Объект.Проведен И ПолучитьФункциональнуюОпцию("ИспользоватьИндикациюСуммыСписания") И ПравоПользователя("ПоказыватьСебестоимостьПроведения",Объект);
		Форма.Элементы["АктивыСуммаСписания"].Видимость = ЕстьСуммаСписания;
		
		// Установим надпись подвала - общая сумма списания
		Если Форма.Элементы["АктивыСуммаСписания"].Видимость Тогда
			Форма.Элементы["АктивыСуммаСписания"].ТекстПодвала = Формат(Объект.Активы.Итог("СуммаСписания"), "ЧДЦ=2");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьКолонкиСуммаСписания()

// Устанавливаем условное оформление для характеристик номенклатуры.
//
// Параметры:
// 		Форма - Форма - Содержит данную форму. 
// 		ИмяПоляВводаХарактеристики - Строка - Наименование элемента формы, содержащего характеристики номенклатуры,
//											   если оно отличается от "ТоварыХарактеристикаНоменклатуры".
// 
Процедура УстановитьУсловноеОформлениеХарактеристикНоменклатуры(Форма,
	                                                            ИмяПоляВводаХарактеристики = "ТоварыХарактеристикаНоменклатуры",ПутьКПолюОтбора = "Объект.Товары.ВладелецХарактеристики") Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		Возврат;
	КонецЕсли;
																
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаХарактеристики].Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<без характеристик>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры // УстановитьУсловноеОформлениеХарактеристикНоменклатуры()

// Устанавливаем условное оформление для характеристик номенклатуры с учетом ручного списания.
//
// Параметры:
// 		Форма - Форма - Содержит данную форму. 
// 		ИмяПоляВводаХарактеристики - Строка - Наименование элемента формы, содержащего характеристики номенклатуры,
//											   если оно отличается от "ТоварыХарактеристикаНоменклатуры".
// 
Процедура УстановитьУсловноеОформлениеРучногоСписанияХарактеристик(Форма,
			ИмяПоля = "ТоварыХарактеристикаНоменклатуры",ИмяТч = "Товары") Экспорт	
													
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	// Ручное списание характеристик
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоля].Имя);
	        
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект."+ИмяТч+".Номенклатура");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект."+ИмяТч+".ХарактеристикаНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект."+ИмяТч+".РучноеСписаниеХарактеристик");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;	
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<автосписание>'"));
	
КонецПроцедуры // УстановитьУсловноеОформлениеХарактеристикНоменклатуры()

// Устанавливаем условное оформление для характеристик номенклатуры с учетом ручного списания.
//
// Параметры:
// 		Форма - Форма - Содержит данную форму. 
// 		ИмяПоляВводаХарактеристики - Строка - Наименование элемента формы, содержащего характеристики номенклатуры,
//											   если оно отличается от "ТоварыХарактеристикаНоменклатуры".
// 
Процедура УстановитьУсловноеОформлениеПредставлениеМарок(Форма,
			ИмяПоля = "ТоварыПредставлениеМарок",ИмяТч = "Товары") Экспорт	
													
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;

	// Представление марок Марки не указаны
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТоварыПредставлениеМарок");
	        
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ПредставлениеМарок");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Маркируемая");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Марки не указаны>'"));

	// Представление марок Продукция не маркируется
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТоварыПредставлениеМарок");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Маркируемая");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Продукция не маркируется>'"));
	
	Если Форма.Объект.Свойство("ПредставлениеУпаковок") Тогда
		// Представление марок Упаковки не указаны
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТоварыПредставлениеУпаковок");
		
		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ПредставлениеУпаковок");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Маркируемая");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Упаковки не указаны>'"));
		
		// Представление марок Продукция не маркируется
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТоварыПредставлениеУпаковок");
		
		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Маркируемая");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Ложь;
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Продукция не маркируется>'"));
	КонецЕсли;
	
КонецПроцедуры // УстановитьУсловноеОформлениеХарактеристикНоменклатуры()

// Устанавливаем условное оформление для характеристик номенклатуры с учетом ручного списания.
//
// Параметры:
// 		Форма - Форма - Содержит данную форму. 
// 		ИмяПоляВводаХарактеристики - Строка - Наименование элемента формы, содержащего характеристики номенклатуры,
//											   если оно отличается от "ТоварыХарактеристикаНоменклатуры".
// 
Процедура УстановитьУсловноеОформлениеАлкогольнаяПродукция(Форма,
			ИмяПоля = "ТоварыПАлкогольнаяПродукция",ИмяТч = "Товары") Экспорт	
													
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;

	// Алкогольная продукция
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы.ТоварыАлкогольнаяПродукция.Имя);
	        
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.АлкогольнаяПродукция");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ПредставлениеСопоставления");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветГрадацияСПАРКВысокийРиск);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст",  Новый ПолеКомпоновкиДанных("Объект.Товары.ПредставлениеСопоставления"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
		
КонецПроцедуры // УстановитьУсловноеОформлениеХарактеристикНоменклатуры()

// Устанавливаем условное оформление поля сумма всего.
//
// Параметры:
// 		Форма - Форма - Содержит данную форму. 
// 		ИмяПоляВводаХарактеристики - Строка - Наименование элемента формы, содержащего характеристики номенклатуры,
//											   если оно отличается от "ТоварыХарактеристикаНоменклатуры".
// 
Процедура УстановитьУсловноеОформлениеСуммыВсего(Форма, ИмяТч = "Товары") Экспорт	
													
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы["" + ИмяТч + "СуммаВсего"].Имя);
	
	ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(""+ ИмяТч + "СуммаВсегоТолькоПросмотр");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТч + ".Количество");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры // УстановитьУсловноеОформлениеСуммыВсего()

// Производит формирование и установку дополнительной информации в поле колонки номенклатуры.
//
// Параметры
//  ТекстПодвала - ФорматированнаяСтрока - Представление поля подвала колонки "Номенклатура".
//  Объект       - ДанныеФормыСтруктура  - Объект, для которого выполняется формирование текста подвала.
//
Процедура УстановитьНадписьПодвалаКолонкиНоменклатура(ТекстПодвала, Объект) Экспорт
	
	ЭлементыСтроки = Новый Массив;
	
	Если Объект.Свойство("Карточка") Тогда
		Карта = ?(ЗначениеЗаполнено(Объект.Карточка), СокрЛП(Объект.Карточка), "< нет >");
		ЭлементыСтроки.Добавить(СтрШаблон(НСтр("ru = 'Карта: %1'"), Карта));
		Если Объект.Свойство("СкидкаНаценка") Тогда
			Если ЗначениеЗаполнено(Объект.СкидкаНаценка) Тогда
				СкидкаНаценка    = СокрЛП(Объект.СкидкаНаценка);
				ЗначениеСкидки   = Объект.ЗначениеСкидкиНаценки;
				СпособВычисления = ?(Объект.СкидкаНаценка.СпособВычисления=Перечисления.СкидкиСпособВычисления.Относительная, "%", Строка(Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить()));
				ЭлементыСтроки.Добавить(СтрШаблон(НСтр("ru = 'Скидка: %1 (%2 %3)'"), СкидкаНаценка, ЗначениеСкидки, СпособВычисления));
			Иначе
				ЭлементыСтроки.Добавить(НСтр("ru = 'Скидка: <нет>'"));
			КонецЕсли;
		КонецЕсли;
	Иначе
		ЭлементыСтроки.Добавить(НСтр("ru = 'ИТОГО:'"));
	КонецЕсли;
	
	ТекстПодвала = Новый ФорматированнаяСтрока(СтрСоединить(ЭлементыСтроки, "; "));
	
КонецПроцедуры // УстановитьНадписьПодвалаКолонкиНоменклатура()

// Процедура производит установку заголовков колонок.
//
// Параметры:
//  Форма			 - УправляемаяФорма		 - Форма, в которой возникло событие.
//  Объект			 - ДанныеФормыСтруктура	 - Объект, для которого выполняется установка заголовков колонок цены и суммы.
//  РеквизитТипЦен	 - Строка				 - Имя реквизита типа цен.
//  ТабличнаяЧасть	 - Строка				 - Имя табличной части с колонками цены и суммы.
//
Процедура УстановитьЗаголовокКолонок(Форма, Объект = Неопределено, РеквизитТипЦен = "ТипЦен", ТабличнаяЧасть = "Товары") Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	СНДС = Объект[РеквизитТипЦен].ЦенаВключаетНДС;
	
	Если НЕ Форма.Элементы.Найти(ТабличнаяЧасть+"Цена")=Неопределено Тогда
		Форма.Элементы[ТабличнаяЧасть+"Цена"].Заголовок = ?(СНДС, НСтр("ru = 'Цена с НДС'"), НСтр("ru = 'Цена без НДС'"));
	КонецЕсли;
	
	Если НЕ Форма.Элементы.Найти(ТабличнаяЧасть+"Сумма")=Неопределено Тогда
		Форма.Элементы[ТабличнаяЧасть+"Сумма"].Заголовок = ?(СНДС, НСтр("ru = 'Сумма с НДС'"), НСтр("ru = 'Сумма без НДС'"));
	КонецЕсли;
	
КонецПроцедуры // УстановитьЗаголовокКолонок()

// Обработчик события возникающего при изменении данных поля "Номенклатура" в строке табличной части.
//
// Параметры:
//  Форма   - УправляемаяФорма - Форма, в которой возникло событие.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
// Обработчик события возникающего при изменении данных реквизита "Партия" в таблице "Товары".
//
// Параметры:
//
Процедура НоменклатураПриИзменении(Форма, Строка, ПараметрыДействия=Неопределено, ИмяТабличнойЧасти="Товары", СуффиксКолонок="") Экспорт
	
	Объект = Неопределено;
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Определим имена поле объекта
	ИмяРеквизита      = "ХарактеристикаНоменклатуры" + СуффиксКолонок;
	ИмяКолонки        = ИмяТабличнойЧасти + ИмяРеквизита;
	ИмяСлужебногоПоля = "ВладелецХарактеристики" + СуффиксКолонок;
	
	// Обработаем в зависимости от наличия реквизита в табличной части в объекте
	Если ЕстьРеквизит(Объект, ИмяРеквизита, ИмяТабличнойЧасти) Тогда
		
		ВидимостьХарактеристики = ЛОЖЬ;
		
		// Если при обработке текущей строки не был дан отказ, то установим видимость поля Характеристика.
		Если НЕ ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Отказ", ЛОЖЬ) Тогда
			ВидимостьХарактеристики = ВидимостьХарактеристики ИЛИ (НЕ Строка[ИмяСлужебногоПоля]=Неопределено);
		КонецЕсли;
		
		// Если имеется список строк, добавленных при выборе Набора, произведем установку видимости поля Характеристика.
		НовыеСтроки = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "НовыеСтроки");
		Если ТипЗнч(НовыеСтроки)=Тип("Массив") Тогда
			Для каждого СтрокаТаблицыТоваров Из НовыеСтроки Цикл
				ВидимостьХарактеристики = ВидимостьХарактеристики ИЛИ (НЕ Объект[ИмяТабличнойЧасти][СтрокаТаблицыТоваров][ИмяСлужебногоПоля]=Неопределено);
			КонецЦикла;
		КонецЕсли;
		
		// Видимость поля Характеристика можно изменять только в сторону ИСТИНА
		Если ВидимостьХарактеристики Тогда
			Форма.Элементы[ИмяКолонки].Видимость = ИСТИНА;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // НоменклатураПриИзменении()

// Общий обработчик события возникающего при изменении данных объекта из формы "Параметры документа".
//
// Параметры:
//  Форма     - УправляемаяФорма - Форма, в которой возникло событие.
//  Параметры - Структура        - Содержит значения измененных реквизитов.
//
Процедура ПараметрыДокументаПриИзменении(Форма, Параметры, Объект = Неопределено) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Получим новое состояние отображения панели параметров документа
	ПоказыватьПараметрыДокумента = (Параметры.Свойство("ПоказыватьПараметрыДокумента") И Параметры.ПоказыватьПараметрыДокумента);
	
	// Если новое состояние отображения не соответствует текущему, то перерисуем форму
	Если НЕ Форма.Элементы.Найти("ПараметрыДокумента") = Неопределено И НЕ Форма.Элементы.ПараметрыДокумента.Видимость=ПоказыватьПараметрыДокумента И НЕ Форма.Элементы.НомерДата.Видимость=ПоказыватьПараметрыДокумента Тогда
		
		// Изменяем видимость элементов управления
		Форма.Элементы.ПараметрыДокумента.Видимость = ПоказыватьПараметрыДокумента;
		Форма.Элементы.НомерДата         .Видимость = ПоказыватьПараметрыДокумента;
		
		// Взведем признак необходимости выполнить сохранение настроек формы при закрытии
		Форма.СохраняемыеВНастройкахДанныеМодифицированы = ИСТИНА;
		
	КонецЕсли;
	
	// Произведем настройку параметров отбора для полей зависящих от организации и подразделения контекста.
	Если Параметры.ИзмененныеРеквизиты.Свойство("ПодразделениеКомпании") Тогда
		
		ЗащищенныеФункцииСервер.РасставитьСвязиПараметровВыбораПоОрганизации(Форма, Объект);
		
	КонецЕсли;
	
	Если Параметры.Свойство("Штрихкод") И ЕстьРеквизит(Форма,"Штрихкод") Тогда
		Если ЕстьРеквизит(Форма,"Штрихкод") Тогда
			Форма.Штрихкод = Параметры.Штрихкод;
		Иначе
			СлужебныеРеквизиты = Новый Структура();
			СлужебныеРеквизиты.Вставить("Штрихкод",Параметры.Штрихкод);
			УправлениеДиалогомСервер.ДобавитьРеквизитыФормы(Форма, СлужебныеРеквизиты);
		КонецЕсли;
	КонецЕсли;
	
	// Формируем новый текст для поля представления расширенных параметров документа
	Если НЕ Форма.Элементы.Найти("ПараметрыДокумента") = Неопределено Тогда
		Форма.ПараметрыДокумента = ""+?(ЗначениеЗаполнено(Объект.Организация), Строка(Объект.Организация)+"; ", "") + ?(ЗначениеЗаполнено(Объект.ПодразделениеКомпании), Строка(Объект.ПодразделениеКомпании)+"; ", "") + Строка(Объект.Автор);
	КонецЕсли;
	
	// Установим модифицированность формы
	Форма.Модифицированность = Форма.Модифицированность ИЛИ (НЕ Параметры.ИзмененныеРеквизиты.Количество()=0);
	
КонецПроцедуры // ПараметрыДокументаПриИзменении()

// Процедура производит получение представления расширенных итогов  видимости колонки Характеристика
// в зависимости от значения служебных реквизитов.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется формирование представления итогов.
//
Функция ПроверитьВозможныеОперацийСНоменклатурой(Знач Объект) Экспорт
	
	НастройкиВыбораНоменклатуры = Новый Структура;
	НастройкиВыбораНоменклатуры.Вставить("ЗапретЗакупки",Ложь);
	НастройкиВыбораНоменклатуры.Вставить("ЗапретПродажи",Ложь);
	НастройкиВыбораНоменклатуры.Вставить("СнятаСПроизводства",Ложь);
	НастройкиВыбораНоменклатуры.Вставить("Предупреждать",Ложь);
	
	// Составим список документов в которых нельзя выбирать номенклатуру с запретом продажи.
	СписокДокументСЗапретомПродажи = Новый Массив;
	СписокДокументСЗапретомПродажи.Добавить(Тип("ДокументСсылка.РеализацияТоваров"));
	СписокДокументСЗапретомПродажи.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	СписокДокументСЗапретомПродажи.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	СписокДокументСЗапретомПродажи.Добавить(Тип("ДокументСсылка.ЗаменаВЗаказеПокупателя"));
	СписокДокументСЗапретомПродажи.Добавить(Тип("ДокументСсылка.КорректировкаЗаказаПокупателя"));
	
	// Составим список документов в которых нельзя выбирать номенклатуру с запретом закупки.
	СписокДокументСЗапретомЗакупки = Новый Массив;
	СписокДокументСЗапретомЗакупки.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
	СписокДокументСЗапретомЗакупки.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	СписокДокументСЗапретомЗакупки.Добавить(Тип("ДокументСсылка.СогласованиеЗакупочныхЦен"));
	СписокДокументСЗапретомЗакупки.Добавить(Тип("ДокументСсылка.ЗаменаВЗаказеПокупателя"));
	СписокДокументСЗапретомЗакупки.Добавить(Тип("ДокументСсылка.КорректировкаЗаказаПокупателя"));
	СписокДокументСЗапретомЗакупки.Добавить(Тип("ДокументСсылка.КорректировкаЗаказаПоставщику"));
	
	// Составим список документов в которых можно выбирать номенклатуру снятую с производства,
	// но при этом предупреждать пользователя.
	СписокДокументСнятаСПроизводства = Новый Массив;
	СписокДокументСнятаСПроизводства.Добавить(Тип("ДокументСсылка.ПоступлениеТоваров"));
	СписокДокументСнятаСПроизводства.Добавить(Тип("ДокументСсылка.РеализацияТоваров"));
	СписокДокументСнятаСПроизводства.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	СписокДокументСнятаСПроизводства.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
	СписокДокументСнятаСПроизводства.Добавить(Тип("ДокументСсылка.ЗаказВнутренний"));
	
	// Составим список документов в которых Можно выбирать номенклатуру с запретом закупки или продажи,
	// но при этом предупреждать пользователя.
	СписокДокументСПредупреждениемПриЗапрете = Новый Массив;
	СписокДокументСПредупреждениемПриЗапрете.Добавить(Тип("ДокументСсылка.ВводОстатковТоваров"));
	СписокДокументСПредупреждениемПриЗапрете.Добавить(Тип("ДокументСсылка.ПоступлениеТоваров"));
	СписокДокументСПредупреждениемПриЗапрете.Добавить(Тип("ДокументСсылка.ПеремещениеТоваров"));
	СписокДокументСПредупреждениемПриЗапрете.Добавить(Тип("ДокументСсылка.СогласованиеЗакупочныхЦен"));
	
	Если НЕ СписокДокументСЗапретомПродажи.Найти(ТипЗнч(Объект.Ссылка)) = Неопределено Тогда
		НастройкиВыбораНоменклатуры.ЗапретПродажи = ИСТИНА;
	КонецЕсли;
	Если НЕ СписокДокументСЗапретомЗакупки.Найти(ТипЗнч(Объект.Ссылка)) = Неопределено Тогда
		НастройкиВыбораНоменклатуры.ЗапретЗакупки = ИСТИНА;
	КонецЕсли;
	Если НЕ СписокДокументСнятаСПроизводства.Найти(ТипЗнч(Объект.Ссылка)) = Неопределено Тогда
		НастройкиВыбораНоменклатуры.СнятаСПроизводства = ИСТИНА;
		НастройкиВыбораНоменклатуры.Предупреждать = ИСТИНА;
	КонецЕсли;
	Если НЕ СписокДокументСПредупреждениемПриЗапрете.Найти(ТипЗнч(Объект.Ссылка)) = Неопределено Тогда
		НастройкиВыбораНоменклатуры.Предупреждать = ИСТИНА;
	КонецЕсли;
	
	Возврат НастройкиВыбораНоменклатуры;
	
КонецФункции // ПроверитьВозможныеОперацийСНоменклатурой()

// Заполним доступность колонки "Сумма Всего"
Процедура УстановитьДоступностьКолонкиСуммаВсего(Форма, Объект, ИмяТабличнойЧасти = "Товары", ИмяКолонки = "СуммаВсего", СуффиксКолонок="") Экспорт
	
	// Определим, имеет ли смысл давать возможность пользователю редактировать колонку сумма всего.
	Если ЕстьРеквизит(Форма, "РазрешитьРедактированиеЦенИСумм") Тогда
		РазрешитьРедактированиеЦенИСумм = Форма.РазрешитьРедактированиеЦенИСумм;
	Иначе
		РазрешитьРедактироватьЗакупочныеЦены = Ложь;
		Если ЕстьРеквизит(Объект, "ДоговорВзаиморасчетов") Тогда
			РазрешитьРедактироватьЗакупочныеЦены = Объект.ДоговорВзаиморасчетов.РазрешитьРедактироватьЗакупочныеЦены;
		КонецЕсли;
		РазрешитьРедактированиеЦенИСумм = РазрешитьРедактироватьЗакупочныеЦены ИЛИ ПравоПользователя("РедактированиеЦенИСуммВНоменклатурныхТаблицах", Объект);
	КонецЕсли;
	
	Если Объект.Свойство("СкидкаНаценка")
		 И НЕ Форма.Элементы.Найти(ИмяТабличнойЧасти + ИмяКолонки + СуффиксКолонок) = Неопределено
		 И РазрешитьРедактированиеЦенИСумм И НЕ Форма.Элементы[ИмяТабличнойЧасти + ИмяКолонки + СуффиксКолонок].ТолькоПросмотр Тогда
		Форма.Элементы[ИмяТабличнойЧасти + ИмяКолонки + СуффиксКолонок].ТолькоПросмотр = (НЕ Объект.СкидкаНаценка.Пустая()) И (Объект.СкидкаНаценка.СпособВычисления = Перечисления.СкидкиСпособВычисления.Абсолютная);
	КонецЕсли;
	
КонецПроцедуры // УстановитьДоступностьКолонкиСуммаВсего()

// Заполним доступность флага "Авто закрытие сделок"
Процедура УстановитьДоступностьФлагаАвтоЗакрытиеСделок(Форма, Объект, ИмяТабличнойЧасти = "Товары") Экспорт
	
	// Определим, имеет ли смысл давать возможность пользователю редактировать колонку сумма всего.
	Если НЕ Форма.Элементы.Найти("АвтоЗакрытиеСделок") = Неопределено Тогда
		Форма.Элементы.АвтоЗакрытиеСделок.ТолькоПросмотр = НЕ ПравоПользователя("РедактированиеФлагаАвтоматическоеЗакрытиеСделок", Объект);
	КонецЕсли;
	
	Если НЕ Форма.Элементы.Найти(ИмяТабличнойЧасти + "АвтоЗакрытиеСделок") = Неопределено Тогда
		Форма.Элементы[ИмяТабличнойЧасти + "АвтоЗакрытиеСделок"].ТолькоПросмотр = НЕ ПравоПользователя("РедактированиеФлагаАвтоматическоеЗакрытиеСделок", Объект);
	КонецЕсли;
	
КонецПроцедуры // УстановитьДоступностьФлагаАвтоЗакрытиеСделок()

// Функция доступности суммы всего.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется формирование представления итогов.
//
Функция УстановитьДоступностьСуммыВсего(Объект, ИмяТабличнойЧасти = "Товары", ИмяКолонки = "СуммаВсего", СуффиксКолонок="")
	
	РазрешитьРедактироватьЗакупочныеЦены = Ложь;
	Если ЕстьРеквизит(Объект, "ДоговорВзаиморасчетов") Тогда
		РазрешитьРедактироватьЗакупочныеЦены = Объект.ДоговорВзаиморасчетов.РазрешитьРедактироватьЗакупочныеЦены;
	КонецЕсли;
	
	Если Объект.Свойство("СкидкаНаценка")
		 И (РазрешитьРедактироватьЗакупочныеЦены ИЛИ ПравоПользователя("РедактированиеЦенИСуммВНоменклатурныхТаблицах", Объект)) Тогда
		Возврат (НЕ Объект.СкидкаНаценка.Пустая()) И (Объект.СкидкаНаценка.СпособВычисления = Перечисления.СкидкиСпособВычисления.Абсолютная);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // УстановитьДоступностьСуммыВсего()

// Функция получения реквизитов объекта по умолчанию для события "При окончании редактирования".
//
// Параметры:
//
// Возвращаемое значение:
//  Строка - имена реквизитов, перечисленные через запятую.
//
Функция ПолучитьРеквизитыПоУмолчаниюСобытияПриОкончанииРедактирования(СоставРеквизитов) Экспорт
	
	Если СоставРеквизитов = Неопределено Тогда
		
		Возврат "_ИтогиОперации,СуммаДокумента,ВалютаДокумента,КурсДокумента,Карточка,СкидкаНаценка,СкидкаНаценка.СпособВычисления,ЗначениеСкидкиНаценки";
		
	КонецЕсли;
	
	Возврат СоставРеквизитов;
	
КонецФункции // ПолучитьРеквизитыПоУмолчаниюСобытияПриОкончанииРедактирования()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ ДОКУМЕНТА

// Общий обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма, в которой возникло событие.
//  Параметры			 - Структура		 - Содержит коллекцию параметров формы.
//  Отказ				 - Булево			 - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево			 - В данный параметр передается признак выполнения системной обработки события.
//  ПараметрыДействия	 - Структура		 - Параметры действий.
//  Объект				 - Объект			 - Альтернативный объект.
// 
// Возвращаемое значение:
//  Булево - Признак успешного завершения.
//
Функция ПриСозданииНаСервере(Форма, Параметры, Отказ, СтандартнаяОбработка, ПараметрыДействия=Неопределено, Объект=Неопределено) Экспорт
	
	// Заполнение объекта могло завершиться отказом, проверим установленный признак
	Если НЕ УправлениеДиалогомСервер.ПроверитьВозможностьОткрытияФормыОбъекта(Форма, Отказ) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// Проверим тек объект
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Если были при открытии в форму были переданные данные основного объекта, произведем их установку.
	Если Параметры.ЗначенияЗаполнения.Свойство("КопироватьДанныеФормы") Тогда
		КопироватьДанныеФормы(Параметры.ЗначенияЗаполнения.КопироватьДанныеФормы, Объект);
	КонецЕсли;
	
	// Произведем инициализацию служебных реквизитов формы
	ИнициализироватьСлужебныеРеквизиты(Форма, Объект);
	
	// Проверим возможность проведения документа будущей датой
	ПроверитьПроведениеБудущейДатой(Форма, Объект);
	
	// Произведем инициализацию пунктов меню выбора хозяйственной операции
	ЗащищенныеФункцииСервер.ИнициализироватьМенюВыбораХозОперации(Форма, Объект);
	
	// Настроим состав и параметры отображения командной панели формы
	ИнициализироватьКомандыПанелиДействий(Форма, Объект);
	
	// Произведем настройку параметров отбора для полей зависящих от организации и подразделения контекста.
	ЗащищенныеФункцииСервер.РасставитьСвязиПараметровВыбораПоОрганизации(Форма, Объект);
	
	// По умолчанию панель параметров документа должна быть скрыта
	Форма.Элементы.ПараметрыДокумента.Видимость = ЛОЖЬ;
	Форма.Элементы.НомерДата         .Видимость = ЛОЖЬ;
	
	// Установка предопределенных параметров выбора для реквизита "Контрагент"
	Если ЕстьРеквизит(Объект, "Контрагент") И (НЕ Форма.Элементы.Найти("Контрагент")=Неопределено) Тогда
		ВидыКонтрагентов = Справочники.Контрагенты.ПолучитьВидыКонтрагентов();
		УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Форма.Элементы.Контрагент.ПараметрыВыбора, "Отбор.ВидКонтрагента", ВидыКонтрагентов);
	КонецЕсли;
	
	// Инициализируем элементы формы связанные с дополнительными реквизитами
	УправлениеСвойствами.ПриСозданииНаСервере(Форма, Новый Структура("Объект,ИмяЭлементаДляРазмещения,ИмяЭлементаКоманднойПанели", Объект, "ГруппаДополнительныеРеквизиты", "ДополнительныеДействия"));
	
	// Инициализируем элементы формы связанные с контактной информацией
	Если ЕстьРеквизит(Объект,, "КонтактнаяИнформация") Тогда
		УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(Форма, Объект, "ГруппаКонтактнаяИнформация", ПоложениеЗаголовкаЭлементаФормы.Лево);
	КонецЕсли;
	
	// Проверим возможность штрихкодирования и получим штрихкод
	ШтрихкодированиеВызовСервера.ПрочитатьШтрихкодДокумента(Форма, Объект);
	
	// Добавим команды заполнения объекта
	ЗащищенныеФункцииСервер.ИнициализироватьКомандыЗаполнения(Форма, Объект);
	
	// Установим вариант отображения дополнительных полей "Код" и "Артикул"
	УстановитьВидимостьКолонокКодАртикул(Форма, "Товары");
	
	// Установим вариант отображения цен и сумм
	ЗащищенныеФункцииСервер.УстановитьДоступностьКолонокЦенИСумм(Форма, "Товары",,Объект);
	
	// Произведем адаптацию видимости колонок Количество и Количество (базовое)
	УстановитьВидимостьКолонкиКоличествоБазовое(Форма,, Объект);
	
	// Обновим параметры выбора номенклатуры
	Если ЕстьРеквизит(Объект,, "Товары") И (НЕ Форма.Элементы.Найти("ТоварыНоменклатура")=Неопределено) Тогда
		НастроитьПараметрыВыбораНоменклатуры(Форма, Объект);
	КонецЕсли;
	
	// Стандартные подсистемы - Версионирование объектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(Форма);
	
	// Обновим колонку Цена Базовая
	Если ПолучитьФункциональнуюОпцию("ИспользоватьБазовоеКоличество") И ЕстьРеквизит(Объект,"ЦенаБазовая","Товары") Тогда
		ОбработкаТабличнойЧастиТовары.ЗаполнитьРеквизитЦенаБазовая(Объект);
	КонецЕсли;
	
	// Дальнейшие операции выполняются только для новых документов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Обновим колонку владельцев характеристик и единиц измерения
	Если ЕстьРеквизит(Объект,, "Товары") И (НЕ Форма.Элементы.Найти("ТоварыНоменклатура")=Неопределено) Тогда  //kurtov+ 17.07.19 : И (НЕ Форма.Элементы.Найти("ТоварыНоменклатура")=Неопределено)
		ЗащищенныеФункцииСервер.ЗаполнитьСлужебныеРеквизитыТабличнойЧасти(Объект.Товары);
	КонецЕсли;
	
	// Обновим служебные реквизиты Алкогольной продукции
	Если ЕстьРеквизит(Объект, "АлкогольнаяПродукция", "Товары") И ЕстьРеквизит(Объект,, "Марки") Тогда
		ЗащищенныеФункцииСервер.ЗаполнитьРеквизитАлкогольнойПродукции(Объект, Объект.Товары, Объект.Марки);
	КонецЕсли;
	
	ЗащищенныеФункцииСервер.ЗаполнитьРеквизитЦенаБезНДС(Объект);
		
	// Произведем заполнение служебного реквизита "Остаток"
	ОтображатьОстаток = (ПолучитьФункциональнуюОпцию("ИспользоватьИндикациюОстатковТовара") И (ЕстьРеквизит(Объект, "ОстатокНаСкладе", "Товары") ИЛИ ЕстьРеквизит(Объект, "ОстатокНаОрдерномСкладе", "Товары")));
	
	// Установим видимость колонки служебного реквизита "Остаток"
	Если НЕ Форма.Элементы.Найти("ТоварыОстатокНаСкладе")=Неопределено Тогда
		Форма.Элементы.ТоварыОстатокНаСкладе.Видимость = ОтображатьОстаток;
	КонецЕсли;
	
	// Проверим наличие "Остатка на складе" в табличной части
	Если ОтображатьОстаток Тогда
		ОбработкаТабличнойЧастиТовары.ЗаполнитьСлужебныйРеквизитОстатокНаСкладе(Объект,, ПараметрыДействия);
	КонецЕсли;
	
	// Покажем колонку "Характеристика", если имеются товары с ведением учета по характеристикам.
	Если ЕстьРеквизит(Объект,, "Товары") И (НЕ Форма.Элементы.Найти("ТоварыХарактеристикаНоменклатуры") = Неопределено) Тогда
		ЗащищенныеФункцииСервер.УстановитьВидимостьКолонкиХарактеристикаНоменклатуры(Форма,,, Объект);
	КонецЕсли;
	
	// подключаемые команды
	ПодключаемыеКоманды.ПриСозданииНаСервере(Форма, Неопределено, Истина);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат (НЕ Отказ);
	
КонецФункции // ПриСозданииНаСервере()

// Общий обработчик события возникающего на клиенте при выборе объекта без привязки к элементу в контексте сервера.
//
// Параметры:
//  Форма             - УправляемаяФорма - Форма, в которой возникло событие.
//  ВыбранноеЗначение - Произвольный     - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный     - Форма, в которой осуществлен выбор.
//
Функция ОбработкаВыбора(Форма, ВыбранноеЗначение, ПараметрыДействия=Неопределено, Объект=Неопределено) Экспорт
	
	// Проверим тек объект
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	ИмяТаблицы = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ИмяТаблицы", "Товары");
	
	Если ТипЗнч(ВыбранноеЗначение)=Тип("Структура") И ВыбранноеЗначение.Свойство("Объект") Тогда
		
		Если ТипЗнч(ВыбранноеЗначение.Объект)=Тип("СправочникСсылка.Карточки") Тогда
			
			Если Форма.ТолькоПросмотр ИЛИ (НЕ Форма.Элементы.Найти("Карточка")=Неопределено И ТипЗнч(Объект.Ссылка)= Тип("ДокументСсылка.ЧекНаОплату")) Тогда
				Возврат ЛОЖЬ;
			КонецЕсли;
			
			Объект.Карточка = ВыбранноеЗначение.Объект;
			
			// Вызываем обработчик изменения данных объекта
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
			МенеджерОбъекта.КарточкаПриИзменении(Объект, ПараметрыДействия);
		ИначеЕсли ИмяТаблицы = "Скидки" И ТипЗнч(ВыбранноеЗначение.Объект)=Тип("СправочникСсылка.Номенклатура") Тогда
			
			Если Форма.ТолькоПросмотр ИЛИ Форма.Элементы.Скидки.ТолькоПросмотр Тогда
				Возврат ЛОЖЬ;
			КонецЕсли;
			
			УсловиеПоиска = Новый Структура("Номенклатура, ЕдиницаИзмерения");
			УсловиеПоиска.Номенклатура = ВыбранноеЗначение.Объект;
			ЗаполнитьЗначенияСвойств(УсловиеПоиска, ВыбранноеЗначение);
			
			ПараметрыДействия = Новый Структура;
			
			ПолноеИмя = Объект.Ссылка.Метаданные().ПолноеИмя();
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
			
			ПодходящиеСтроки = Объект.Скидки.НайтиСтроки(УсловиеПоиска);
			Если ПодходящиеСтроки.Количество() = 0 Тогда
				СтрокаТабличнойЧасти = Объект.Скидки.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ВыбранноеЗначение.Объект;
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыбранноеЗначение);
				
				МенеджерОбъекта.СкидкиНоменклатураПриИзменении(Объект, СтрокаТабличнойЧасти, ПараметрыДействия);
				
				// Вызываем общий обработчик изменения реквизитов формы
				УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(Объект, СтрокаТабличнойЧасти, ПараметрыДействия);
			Иначе
				СтрокаТабличнойЧасти = ПодходящиеСтроки[0];
				СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество + 1;
				
				МенеджерОбъекта.СкидкиКоличествоПриИзменении(Объект, СтрокаТабличнойЧасти, ПараметрыДействия);
			КонецЕсли;
			
		ИначеЕсли ИмяТаблицы = "Продукция" И (ТипЗнч(ВыбранноеЗначение.Объект)=Тип("СправочникСсылка.Номенклатура")) Тогда
			
			Если (НЕ Форма = Неопределено) Тогда
				Если Форма.ТолькоПросмотр ИЛИ Форма.Элементы.Продукция.ТолькоПросмотр Тогда
					Возврат ЛОЖЬ;
				КонецЕсли;
			КонецЕсли;
			
			ПоОсновнойЕдинице = ПолучитьЗначениеПараметраСтруктуры(ВыбранноеЗначение, "ПоОсновнойЕдинице", Ложь);
			
			УсловиеПоиска = Новый Структура;
			УсловиеПоиска.Вставить("Номенклатура", ВыбранноеЗначение.Объект);
			
			КоэффициентПересчета = 1;
			Если ПоОсновнойЕдинице Тогда
				ОсновнаяЕдиницаИзмерения = ВыбранноеЗначение.Объект.ОсновнаяЕдиницаИзмерения;
				УсловиеПоиска.Вставить("ЕдиницаИзмерения", ОсновнаяЕдиницаИзмерения);
				
				Если ВыбранноеЗначение.Свойство("ЕдиницаИзмерения") И ЗначениеЗаполнено(ВыбранноеЗначение.ЕдиницаИзмерения) Тогда
					КоэффициентЕдиницы = ВыбранноеЗначение.ЕдиницаИзмерения.Коэффициент;
				КонецЕсли;
				
				Если НЕ ОсновнаяЕдиницаИзмерения.Коэффициент = 0 Тогда
					КоэффициентПересчета = КоэффициентЕдиницы/ОсновнаяЕдиницаИзмерения.Коэффициент;
					Если КоэффициентПересчета = 0 Тогда
						КоэффициентПересчета = 1;
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли ВыбранноеЗначение.Свойство("ЕдиницаИзмерения") И ЗначениеЗаполнено(ВыбранноеЗначение.ЕдиницаИзмерения) Тогда
				УсловиеПоиска.Вставить("ЕдиницаИзмерения", ВыбранноеЗначение.ЕдиницаИзмерения);
			КонецЕсли;
			Если ВыбранноеЗначение.Свойство("ХарактеристикаНоменклатуры") И ЗначениеЗаполнено(ВыбранноеЗначение.ХарактеристикаНоменклатуры) Тогда
				УсловиеПоиска.Вставить("ХарактеристикаНоменклатуры", ВыбранноеЗначение.ХарактеристикаНоменклатуры);
			КонецЕсли;
			
			ПараметрыДействия = Новый Структура;
			
			ПолноеИмя = Объект.Ссылка.Метаданные().ПолноеИмя();
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
			
			Вес = 0;
			Если ВыбранноеЗначение.Свойство("Вес") И ЗначениеЗаполнено(ВыбранноеЗначение.Вес) Тогда
				Вес = ВыбранноеЗначение.Вес;
			КонецЕсли;
			
			ПодходящиеСтроки = Объект.Продукция.НайтиСтроки(УсловиеПоиска);
			Если ПодходящиеСтроки.Количество() = 0 Тогда
				СтрокаТабличнойЧасти = Объект.Продукция.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ВыбранноеЗначение.Объект;
				
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыбранноеЗначение);
				
				Если ЗначениеЗаполнено(Вес) Тогда
					СтрокаТабличнойЧасти.Количество = Вес;
				КонецЕсли;
				
				Если ПоОсновнойЕдинице Тогда
					СтрокаТабличнойЧасти.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;
					Если СтрокаТабличнойЧасти.Количество = 0 Тогда
						СтрокаТабличнойЧасти.Количество = КоэффициентПересчета;
					Иначе
						СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество*КоэффициентПересчета;
					КонецЕсли;
				КонецЕсли;
				
				МенеджерОбъекта.ПродукцияНоменклатураПриИзменении(Объект, СтрокаТабличнойЧасти, ПараметрыДействия);
				
				// Вызываем общий обработчик изменения реквизитов формы
				УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(Объект, СтрокаТабличнойЧасти, ПараметрыДействия);
			Иначе
				СтрокаТабличнойЧасти = ПодходящиеСтроки[0];
				
				Если ЗначениеЗаполнено(Вес) Тогда
					СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество + Вес*КоэффициентПересчета;
				Иначе
					СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество + КоэффициентПересчета;
				КонецЕсли;
				
				МенеджерОбъекта.ПродукцияКоличествоПриИзменении(Объект, СтрокаТабличнойЧасти, ПараметрыДействия);
			КонецЕсли;
			
		ИначеЕсли (ТипЗнч(ВыбранноеЗначение.Объект)=Тип("СправочникСсылка.Номенклатура")) Тогда
			
			Если (НЕ Форма = Неопределено) Тогда
				Если Форма.ТолькоПросмотр ИЛИ Форма.Элементы.Товары.ТолькоПросмотр Тогда
					Возврат ЛОЖЬ;
				КонецЕсли;
			КонецЕсли;
			
			ПоОсновнойЕдинице = ПолучитьЗначениеПараметраСтруктуры(ВыбранноеЗначение, "ПоОсновнойЕдинице", Ложь);
			
			УсловиеПоиска = Новый Структура;
			УсловиеПоиска.Вставить("Номенклатура", ВыбранноеЗначение.Объект);
			
			КоэффициентПересчета = 1;
			Если ПоОсновнойЕдинице Тогда
				ОсновнаяЕдиницаИзмерения = ВыбранноеЗначение.Объект.ОсновнаяЕдиницаИзмерения;
				УсловиеПоиска.Вставить("ЕдиницаИзмерения", ОсновнаяЕдиницаИзмерения);
				
				Если ВыбранноеЗначение.Свойство("ЕдиницаИзмерения") И ЗначениеЗаполнено(ВыбранноеЗначение.ЕдиницаИзмерения) Тогда
					КоэффициентЕдиницы = ВыбранноеЗначение.ЕдиницаИзмерения.Коэффициент;
				КонецЕсли;
				
				Если НЕ ОсновнаяЕдиницаИзмерения.Коэффициент = 0 Тогда
					КоэффициентПересчета = КоэффициентЕдиницы/ОсновнаяЕдиницаИзмерения.Коэффициент;
					Если КоэффициентПересчета = 0 Тогда
						КоэффициентПересчета = 1;
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли ВыбранноеЗначение.Свойство("ЕдиницаИзмерения") И ЗначениеЗаполнено(ВыбранноеЗначение.ЕдиницаИзмерения) Тогда
				УсловиеПоиска.Вставить("ЕдиницаИзмерения", ВыбранноеЗначение.ЕдиницаИзмерения);
			КонецЕсли;
			Если ВыбранноеЗначение.Свойство("ХарактеристикаНоменклатуры") И ЗначениеЗаполнено(ВыбранноеЗначение.ХарактеристикаНоменклатуры) Тогда
				УсловиеПоиска.Вставить("ХарактеристикаНоменклатуры", ВыбранноеЗначение.ХарактеристикаНоменклатуры);
			КонецЕсли;
			
			ПараметрыДействия = Новый Структура;
			
			ПолноеИмя = Объект.Ссылка.Метаданные().ПолноеИмя();
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
			
			Вес = 0;
			Если ВыбранноеЗначение.Свойство("Вес") И ЗначениеЗаполнено(ВыбранноеЗначение.Вес) Тогда
				Вес = ВыбранноеЗначение.Вес;
			КонецЕсли;
			
			ПодходящиеСтроки = Объект.Товары.НайтиСтроки(УсловиеПоиска);
			Если ПодходящиеСтроки.Количество() = 0 Тогда
				СтрокаТабличнойЧасти = Объект.Товары.Добавить();
				СтрокаТабличнойЧасти.Номенклатура = ВыбранноеЗначение.Объект;
				
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыбранноеЗначение);
				
				МенеджерОбъекта.ТоварыНоменклатураПриИзменении(Объект, СтрокаТабличнойЧасти, ПараметрыДействия);
				
				Если ЗначениеЗаполнено(Вес) Тогда
					СтрокаТабличнойЧасти.Количество = Вес;
				Иначе
					СтрокаТабличнойЧасти.Количество = ПолучитьЗначениеПараметраСтруктуры(ВыбранноеЗначение, "Количество", 1);
				КонецЕсли;
				
				Если ПоОсновнойЕдинице Тогда
					СтрокаТабличнойЧасти.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;
					Если СтрокаТабличнойЧасти.Количество = 0 Тогда
						СтрокаТабличнойЧасти.Количество = КоэффициентПересчета;
					Иначе
						СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество*КоэффициентПересчета;
					КонецЕсли;
				КонецЕсли;
				
				МенеджерОбъекта.ТоварыКоличествоПриИзменении(Объект, СтрокаТабличнойЧасти, ПараметрыДействия);
				
				// Вызываем общий обработчик изменения реквизитов формы
				УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(Объект, СтрокаТабличнойЧасти, ПараметрыДействия);
			Иначе
				СтрокаТабличнойЧасти = ПодходящиеСтроки[0];
				
				Если ЗначениеЗаполнено(Вес) Тогда
					СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество + Вес*КоэффициентПересчета;
				Иначе
					СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Количество + КоэффициентПересчета;
				КонецЕсли;
				
				МенеджерОбъекта.ТоварыКоличествоПриИзменении(Объект, СтрокаТабличнойЧасти, ПараметрыДействия);
			КонецЕсли;
			
			КодМарки = ПолучитьЗначениеПараметраСтруктуры(ВыбранноеЗначение, "КодМарки", "");
			Если ЗначениеЗаполнено(КодМарки) И ЕстьРеквизит(Объект, , "Марки") Тогда
				Если ПустаяСтрока(СтрокаТабличнойЧасти.ИдентификаторСтроки) Тогда
					СтрокаТабличнойЧасти.ИдентификаторСтроки = Новый УникальныйИдентификатор;
				КонецЕсли;
				
				СтрокаМарки = Объект.Марки.Добавить();
				СтрокаМарки.КодМарки            = КодМарки;
				СтрокаМарки.ИдентификаторСтроки = СтрокаТабличнойЧасти.ИдентификаторСтроки;
				
				Если ВыбранноеЗначение.Свойство("GTIN") Тогда
					СтрокаМарки.GTIN = ПолучитьЗначениеПараметраСтруктуры(ВыбранноеЗначение, "GTIN", "");
					СтрокаМарки.СерийныйНомер = ПолучитьЗначениеПараметраСтруктуры(ВыбранноеЗначение, "СерийныйНомер", "");
					СтрокаМарки.НормализованныйКодМарки = ПолучитьЗначениеПараметраСтруктуры(ВыбранноеЗначение, "НормализованныйКодМарки", "");
				КонецЕсли;
				
				СтатусПроверки = ПолучитьЗначениеПараметраСтруктуры(ВыбранноеЗначение, "СтатусПроверки", Неопределено);
				Если ЗначениеЗаполнено(СтатусПроверки) Тогда
					СтрокаМарки.СтатусПроверки = СтатусПроверки;
				КонецЕсли;
			КонецЕсли;
			
			//СтрокаТабличнойЧасти = Объект.Товары.Добавить();
			//СтрокаТабличнойЧасти.Номенклатура = ВыбранноеЗначение.Объект;
			//ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыбранноеЗначение);
			//
			//// Вызываем обработчик изменения данных объекта
			//МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
			//// !!!_Выполнить
			//МенеджерОбъекта.ТоварыНоменклатураПриИзменении(Объект, СтрокаТабличнойЧасти);
			
			// Необходимо показать колонку Характеристик, если выбран товар с характеристиками.
			//НоменклатураПриИзменении(Форма,СтрокаТабличнойЧасти);
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыДействия.Свойство("НовыйШтрихкод") Тогда
		
		Если Форма.ТолькоПросмотр Тогда
			Возврат ЛОЖЬ;
		КонецЕсли;
		
		Форма.Штрихкод = ПараметрыДействия.НовыйШтрихкод;
		ВывестиСообщение(ШтрихкодированиеВызовСервера.СформироватьСообщениеШтрихкодУстановлен(Форма.Штрихкод,Объект.Ссылка));
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаВыбора()

// Общий обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  Форма             - УправляемаяФорма - Форма, в которой возникло событие.
//  ИмяСобытия        - Строка           - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура        - Набор параметров, использующихся при выполнения операции.
//
Функция ОбработкаОповещения(Форма, ИмяСобытия, ПараметрыДействия=Неопределено, Объект=Неопределено) Экспорт
	
	// Проверим тек объект
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Обработаем в зависимости от 
	Если ПараметрыДействия.Свойство("ШтрихКод") Тогда
		
		Если ПараметрыДействия.ШтрихКод = "" Тогда
			Возврат Истина;
		КонецЕсли;
		
		Если СтрДлина(ПараметрыДействия.ШтрихКод)= 68 ИЛИ СтрДлина(ПараметрыДействия.ШтрихКод)= 150 И ЕстьРеквизит(Объект,,"Марки") Тогда
						
			// Дубль
			СтрокиМарка = Объект.Марки.НайтиСтроки(Новый Структура("КодМарки",ПараметрыДействия.ШтрихКод));
			Если СтрокиМарка.Количество() > 0 Тогда
				ВывестиСообщение(НСтр("ru = 'Данная марка уже внесена в документ'"));						
				ИдентификаторСтроки = СтрокиМарка[0].ПолучитьИдентификатор();
				Форма.Элементы.Марки.ТекущаяСтрока = ИдентификаторСтроки;
				Возврат Ложь;
			КонецЕсли;
			
			// Код АП
			КодАП = ИнтеграцияЕГАИСВызовСервера.ПолучитьКодАПИзАкцизнойМарки(ПараметрыДействия.ШтрихКод);
			Если КодАП = Неопределено Тогда
				ВывестиСообщение(НСтр("ru = 'Не удалось вычислить код алкогольной продукции для акцизной марки: %1'"),,,,, ПараметрыДействия.ШтрихКод);						
				Возврат Ложь;
			КонецЕсли;
			
			// Шк акцизной марки 
			Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ИнвентаризацияАлкогольнойПродукцииЕГАИС") Тогда
				ИнтеграцияЕГАИС.ДобавитьМаркуИнвентаризация(Форма, Объект, ПараметрыДействия.ШтрихКод, КодАП);
			ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваров") ИЛИ (ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") И Объект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровИзФилиала) Тогда 
				ИнтеграцияЕГАИС.ДобавитьМаркуПриход(Форма, Объект, ПараметрыДействия.ШтрихКод, КодАП);
			Иначе
				ИнтеграцияЕГАИС.ДобавитьМаркуРасход(Форма, Объект, ПараметрыДействия.ШтрихКод, КодАП);
			КонецЕсли;
			
		ИначеЕсли ЕстьРеквизит(Объект,,"Марки") И ШтрихкодированиеМПСервер.ОбработкаМарки(Форма, Объект, ПараметрыДействия) Тогда
			
			Возврат Истина;
			
		Иначе
			
			ШтрихкодированиеВызовСервера.ВыполнитьПоискОбъектовПоШтрихкодуУДокумента(Форма, Объект, ПараметрыДействия);
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыДействия.Свойство("КодКарты") Тогда
		
		РезультатПоиска = ШтрихкодированиеВызовСервера.ПолучитьКарточкуПоКоду(ПараметрыДействия.КодКарты);
		
		Если РезультатПоиска=Неопределено Тогда
			ВывестиСообщение(НСтр("ru = 'Не найдена карточка по считанному коду: %1'"), Объект,,,, ПараметрыДействия.КодКарты);
			Возврат ЛОЖЬ;
		КонецЕсли;
		
		ВыборКарты = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ВыборКарты",  ЕстьРеквизит(Объект,  "Карточка"));
		
		Если ТипЗнч(РезультатПоиска)=Тип("СправочникСсылка.Карточки") И ВыборКарты Тогда
			ПараметрыДействия.Вставить("ВыбранноеЗначение", РезультатПоиска);
		Иначе
			ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(РезультатПоиска.Объект));
			ПараметрыДействия.Вставить("ИмяФормыСписка", ОбъектМетаданных.ПолноеИмя()+".ФормаСписка");
			ПараметрыДействия.Вставить("НайтиОбъект",    РезультатПоиска.Объект)
		КонецЕсли;
		
	Иначе
		
		// Вызываем соответствующий обработчик подсистемы управления свойствами.
		УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(Форма, Объект);
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаОповещения()

// Общий обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  Форма         - УправляемаяФорма - Форма, в которой возникло событие.
//  ТекущийОбъект - ДокументОбъект   - Объект, который будет прочитан.
//
Функция ПриЧтенииНаСервере(Форма, ТекущийОбъект, ПараметрыДействия=Неопределено, Объект=Неопределено) Экспорт
	
	// Проверим тек объект
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Произведем восстановление версии объекта, если это требуется
	ВерсионированиеОбъектовПлатформа.ПриЧтенииНаСервере(Форма, Объект, ПараметрыДействия);
	
	// Вызываем соответствующий обработчик подсистемы управления свойствами.
	УправлениеСвойствами.ПриЧтенииНаСервере(Форма, ТекущийОбъект);
	
	// Произведем заполнение служебного реквизита "Остаток"
	ОтображатьОстаток       = (ПолучитьФункциональнуюОпцию("ИспользоватьИндикациюОстатковТовара") И (ЕстьРеквизит(Объект, "ОстатокНаСкладе", "Товары") ИЛИ ЕстьРеквизит(Объект, "ОстатокНаОрдерномСкладе", "Товары")));
	
	// Произведем заполнение служебного реквизита "СуммаСписания"
	ОтображатьСуммуСписания = ЕстьРеквизит(Объект, "СуммаСписания", "Товары");
	
	// Заполнение суммы списания
	Если ОтображатьСуммуСписания Тогда
		ИмяРегистра = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ИмяРегистра", "");
		ЗащищенныеФункцииСервер.ЗаполнитьСлужебныйРеквизитСуммаСписания(Объект, ИмяРегистра);
	КонецЕсли;
	
	// Обновим колонку владельцев характеристик и единиц измерения
	Если ЕстьРеквизит(Объект, "Номенклатура", "Товары") Тогда
		ЗащищенныеФункцииСервер.ЗаполнитьСлужебныеРеквизитыТабличнойЧасти(Объект.Товары);
	КонецЕсли;
	
	// Обновим служебные реквизиты Алкогольной продукции
	Если ЕстьРеквизит(Объект, "АлкогольнаяПродукция", "Товары") И ЕстьРеквизит(Объект,, "Марки")Тогда
		ЗащищенныеФункцииСервер.ЗаполнитьРеквизитАлкогольнойПродукции(Объект, Объект.Товары, Объект.Марки);
	КонецЕсли;
	
	ЗащищенныеФункцииСервер.ЗаполнитьРеквизитЦенаБезНДС(Объект);
	
	// Установим видимость колонки служебного реквизита "Остаток"
	Если НЕ Форма.Элементы.Найти("ТоварыОстатокНаСкладе")=Неопределено Тогда
		Форма.Элементы.ТоварыОстатокНаСкладе.Видимость = ОтображатьОстаток;
	КонецЕсли;
	
	// Произведем заполнение служебного реквизита "Остаток"
	Если ОтображатьОстаток Тогда
		ОбработкаТабличнойЧастиТовары.ЗаполнитьСлужебныйРеквизитОстатокНаСкладе(Объект,, ПараметрыДействия);
	КонецЕсли;
	
	// Покажем колонку "Характеристика", если имеются товары с ведением учета по характеристикам.
	Если ЕстьРеквизит(Объект,, "Товары") И (НЕ Форма.Элементы.Найти("ТоварыХарактеристикаНоменклатуры")=Неопределено) Тогда
		ЗащищенныеФункцииСервер.УстановитьВидимостьКолонкиХарактеристикаНоменклатуры(Форма,,,Объект);
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ПриЧтенииНаСервере()

// Общий обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Форма           - УправляемаяФорма - Форма, в которой возникло событие.
//  Отказ           - Булево           - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект   - Записываемый объект.
//  ПараметрыЗаписи - Структура        - Структура, содержащая параметры записи.
//
Функция ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи,  Объект=Неопределено) Экспорт
	
	// Вызываем соответствующий обработчик подсистемы управления свойствами
	УправлениеСвойствами.ПередЗаписьюНаСервере(Форма, ТекущийОбъект);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат (НЕ Отказ);
	
КонецФункции // ПередЗаписьюНаСервере()

// Общий обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  Форма           - УправляемаяФорма - Форма, в которой возникло событие.
//  ТекущийОбъект   - ДокументОбъект   - Записываемый объект.
//  ПараметрыЗаписи - Структура        - Структура, содержащая параметры записи.
//
Функция ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи,  Объект=Неопределено) Экспорт
	
	// Проверим тек объект
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Произведем заполнение служебного реквизита "Остаток"
	ОтображатьОстаток       = (ПолучитьФункциональнуюОпцию("ИспользоватьИндикациюОстатковТовара") И (ЕстьРеквизит(Объект, "ОстатокНаСкладе", "Товары") ИЛИ ЕстьРеквизит(Объект, "ОстатокНаОрдерномСкладе", "Товары")));
	
	// Произведем заполнение служебного реквизита "СуммаСписания"
	ОтображатьСуммуСписания = ЕстьРеквизит(Объект, "СуммаСписания", "Товары");
	
	// Заполнение суммы списания
	Если ОтображатьСуммуСписания Тогда
		ИмяРегистра = ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗаписи, "ИмяРегистра", "");
		ЗащищенныеФункцииСервер.ЗаполнитьСлужебныйРеквизитСуммаСписания(Объект, ИмяРегистра);
	КонецЕсли;
	
	// Обновим колонку владельцев характеристик и единиц измерения
	Если ЕстьРеквизит(Объект, "Номенклатура", "Товары") Тогда
		ЗащищенныеФункцииСервер.ЗаполнитьСлужебныеРеквизитыТабличнойЧасти(Объект.Товары);
	КонецЕсли;
	
	// Обновим служебные реквизиты Алкогольной продукции
	Если ЕстьРеквизит(Объект, "АлкогольнаяПродукция", "Товары") И ЕстьРеквизит(Объект,, "Марки")Тогда
		ЗащищенныеФункцииСервер.ЗаполнитьРеквизитАлкогольнойПродукции(Объект, Объект.Товары, Объект.Марки);
	КонецЕсли;
	
	ЗащищенныеФункцииСервер.ЗаполнитьРеквизитЦенаБезНДС(Объект);
	
	// Проверим наличие "ОстатокНаСкладе" в табличной части
	Если ОтображатьОстаток Тогда
		ОбработкаТабличнойЧастиТовары.ЗаполнитьСлужебныйРеквизитОстатокНаСкладе(Объект, , ПараметрыЗаписи);
	КонецЕсли;
	
	// Покажем колонку "Характеристика", если имеются товары с ведением учета по характеристикам.
	Если ЕстьРеквизит(Объект,, "Товары") И (НЕ Форма.Элементы.Найти("ТоварыХарактеристикаНоменклатуры")=Неопределено) Тогда
		ЗащищенныеФункцииСервер.УстановитьВидимостьКолонкиХарактеристикаНоменклатуры(Форма,,,Объект);
	КонецЕсли;
	
	// Обновим колонку Цена Базовая
	Если ПолучитьФункциональнуюОпцию("ИспользоватьБазовоеКоличество") И ЕстьРеквизит(Объект,"ЦенаБазовая","Товары") Тогда
		ОбработкаТабличнойЧастиТовары.ЗаполнитьРеквизитЦенаБазовая(Объект);
	КонецЕсли;
	
	// Выполним автоматическое штрихкодирование документов
	ШтрихкодированиеВызовСервера.ЗаписатьШтрихкодДокумента(Форма, Объект);
	
	УтверждениеДокументовСервер.УстановитьКартинкуТекущегоСтатусаДокумента(Форма, ТекущийОбъект);
	
	// Подсистема "ОбменСКонтрагентами".
	Если НЕ Форма.Элементы.Найти("ДекорацияСостояниеЭДО") = Неопределено Тогда
		ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
		ПараметрыПослеЗаписи.Форма = Форма;
		ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
		ПараметрыПослеЗаписи.ДекорацияСостояниеЭДО = Форма.Элементы.ДекорацияСостояниеЭДО;
		ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Форма.Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	КонецЕсли;
	// Конец подсистема "ОбменСКонтрагентами".
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ПослеЗаписиНаСервере()

// Общий обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Форма                - УправляемаяФорма - Форма, в которой возникло событие.
//  Отказ                - Булево           - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив           - Массив путей к реквизитам, для которых будет выполнена проверка.
//
Функция ОбработкаПроверкиЗаполнения(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	// Вызываем соответствующий обработчик подсистемы управления свойствами
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(Форма, Отказ, ПроверяемыеРеквизиты);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат (НЕ Отказ);
	
КонецФункции // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Форма     - УправляемаяФорма - Форма, в которой возникло событие.
//  Настройки - Соответствие     - Значения сохраняемых реквизитов и настроек формы.
//
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Форма, Настройки, Объект=Неопределено) Экспорт
	
	// Производим сохранение параметров отображения панели параметров документа
	Настройки.Вставить("ПоказыватьПараметрыДокумента", Форма.Элементы.ПараметрыДокумента.Видимость);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Общий обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек.
//
// Параметры:
//  Форма     - УправляемаяФорма - Форма, в которой возникло событие.
//  Настройки - Соответствие     - Значения сохраненных реквизитов и настроек формы.
//
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Форма, Настройки, Объект=Неопределено) Экспорт
	
	// Проверим тек объект
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Покажем панель параметров документа если ранее была сохранена ее настройка отображения.
	Если Настройки.Получить("ПоказыватьПараметрыДокумента")=ИСТИНА Тогда
		Форма.Элементы.ПараметрыДокумента.Видимость = ИСТИНА;
		Форма.Элементы.НомерДата         .Видимость = ИСТИНА;
		Форма.ПараметрыДокумента = ""+?(ЗначениеЗаполнено(Объект.Организация), Строка(Объект.Организация)+"; ", "") + ?(ЗначениеЗаполнено(Объект.ПодразделениеКомпании), Строка(Объект.ПодразделениеКомпании)+"; ", "") + Строка(Объект.Автор);
	КонецЕсли;
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Общий обработчик события возникающего при выходе из режима редактирования строки.
//
// Параметры:
//  Объект               - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  НоваяСтрока          - Булево               - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево               - Истина, если произошла отмена редактирования.
//  ИмяТабличнойЧасти    - Строка               - Имя таблицы, при редактировании которой возникло данное событие.
//  СписокРеквизитов     - Строка               - Имена реквизитов, перечисленные через запятую, в формате
//                                                требований к свойствам структуры.
//                                                Например, "Код, Наименование, Родитель".
//                       - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//                                                псевдоним поля для возвращаемой структуры с результатом, а в качестве
//                                                значения (опционально) фактическое имя поля в таблице.
//                                                Если значение не определено, то имя поля берется из ключа.
//                       - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//                                                к свойствам структуры.
//                                                Служебные поля для получения данных:
//                                                _ИтогиОпераций, _Константа, _Право.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов с префиксом "Представление".
//
Функция ПриОкончанииРедактирования(Знач Объект, НоваяСтрока, ОтменаРедактирования, ИмяТабличнойЧасти="Товары", СписокРеквизитов=Неопределено) Экспорт
	
	// Уточним перечень получаемых реквизитов объекта
	СписокРеквизитов = ПолучитьРеквизитыПоУмолчаниюСобытияПриОкончанииРедактирования(СписокРеквизитов);
	
	// Не всегда объект Признак будет использоваться для определения необходимости 
	ВернутьИзмененныйОбъект = ЛОЖЬ;
	
	// Пересчет скидок требуется выполнить только в случае когда происходит событие отмены редактирования новой строки.
	Если НоваяСтрока И ОтменаРедактирования Тогда
		СкидкиНаценкиСервер.ПересчитатьСкидкиНаценки(Объект, ИмяТабличнойЧасти);
		ВернутьИзмененныйОбъект = ИСТИНА;
	КонецЕсли;
	
	// Получаем данные текущего объекта необходимые для дополнительной обработки события на клиенте/сервере.
	ВозвращаемыеДанные = УправлениеДиалогомСервер.ПолучитьДанныеОбъекта(Объект, СписокРеквизитов);
	
	// Получим текст надписи итогов операции по документу.
	Если ВозвращаемыеДанные.Свойство("_ИтогиОперации") Тогда
		
		ЭлементыСтроки = Новый Массив;
		ЭлементыСтроки.Добавить(НСтр("ru = 'Итого:'"));
		ЭлементыСтроки.Добавить(Формат(ВозвращаемыеДанные._ИтогиОперации.СуммаДокумента, "ЧДЦ=2; ЧН=0,00"));
		ЭлементыСтроки.Добавить(ВозвращаемыеДанные.ВалютаДокументаПредставление);
		ЭлементыСтроки.Добавить(СтрШаблон(НСтр("ru = '(%1)'"), Формат(ВозвращаемыеДанные.КурсДокумента, "ЧДЦ=4; ЧН=0,0000")));
		
		ВозвращаемыеДанные.Вставить("НадписьСуммаДокумента", Новый ФорматированнаяСтрока(СтрСоединить(ЭлементыСтроки, " ")));
		ВозвращаемыеДанные.Вставить("СуммаДокумента", ВозвращаемыеДанные._ИтогиОперации.СуммаДокумента);
		
	КонецЕсли;
	
	// Получим текст подвала колонки "Номенклатура".
	ВозвращаемыеДанные.Вставить("ТоварыНоменклатурыТекстПодвала", "");
	УстановитьНадписьПодвалаКолонкиНоменклатура(ВозвращаемыеДанные.ТоварыНоменклатурыТекстПодвала, Объект);
	
	// Установим доступность колонки "Сумма всего"
	ВозвращаемыеДанные.Вставить("ТоварыСуммаВсегоТолькоПросмотр", УстановитьДоступностьСуммыВсего(Объект));
	
	Если ВернутьИзмененныйОбъект Тогда
		ВозвращаемыеДанные.Вставить("_Объект", Объект);
	КонецЕсли;
	
	Возврат ВозвращаемыеДанные;
	
КонецФункции // ПолучитьДанныеПриОкончанииРедактирования()

// Общий обработчик события возникающего после удаления строки.
//
// Параметры:
//  Форма   - УправляемаяФорма - Форма, в которой возникло событие.
//  Элемент - ТаблицаФормы     - Элемент управления, в котором возникло данное событие.
//
Процедура ТоварыПослеУдаления(Форма, Элемент, ПараметрыДействия=Неопределено, Объект = Неопределено) Экспорт
	
	// Проверим тек объект
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Перезаполним скидки/наценки
	СкидкиНаценкиСервер.ПересчитатьСкидкиНаценки(Объект, Элемент.ПутьКДанным, ПараметрыДействия);
	
	// Обновляем заголовок надписи итоговой суммы по документу
	ЗащищенныеФункцииСервер.УстановитьЗаголовокНадписиСуммаДокумента(Форма, Объект);
	
	// Обновляем текст подвала в колонке Номенклатура
	Если ЕстьРеквизит(Форма, "ТоварыНоменклатурыТекстПодвала") Тогда
		УстановитьНадписьПодвалаКолонкиНоменклатура(Форма.ТоварыНоменклатурыТекстПодвала, Объект);
	КонецЕсли;
	
	// Установим доступность колонок
	УстановитьДоступностьКолонкиСуммаВсего(Форма, Форма.Объект);
	
	// Удалим марки
	Если ПараметрыДействия.Свойство("УдаляемыеСтрокиМарки") И ТипЗнч(ПараметрыДействия.УдаляемыеСтрокиМарки) = Тип("Массив") Тогда
		Для Каждого ИдентификаторСтроки Из ПараметрыДействия.УдаляемыеСтрокиМарки Цикл
			НайденныеМарки = Объект.Марки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
			Для Каждого ТекущаяМарка Из НайденныеМарки Цикл
				Объект.Марки.Удалить(ТекущаяМарка);
			КонецЦикла;
		КонецЦикла;
		
		Если ЕстьРеквизит(Объект, "Упаковки") Тогда
			Для Каждого ИдентификаторСтроки Из ПараметрыДействия.УдаляемыеСтрокиМарки Цикл
				НайденныеМарки = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
				Для Каждого ТекущаяМарка Из НайденныеМарки Цикл
					Объект.Упаковки.Удалить(ТекущаяМарка);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ТоварыПослеУдаления()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "Марки"

// Общий обработчик события возникающего после удаления строки.
//
// Параметры:
//  Форма   - УправляемаяФорма - Форма, в которой возникло событие.
//  Элемент - ТаблицаФормы     - Элемент управления, в котором возникло данное событие.
//
Процедура МаркиПослеУдаления(Форма, Элемент, ПараметрыДействия=Неопределено, Объект = Неопределено, ИмяКоличества = "Количество") Экспорт
	
	// Проверим тек объект
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	Если ПараметрыДействия.Свойство("УдаляемыеСтрокиМарки") И ТипЗнч(ПараметрыДействия.УдаляемыеСтрокиМарки) = Тип("Массив") Тогда
		Для Каждого ИдентификаторСтроки Из ПараметрыДействия.УдаляемыеСтрокиМарки Цикл
			
			НайденныеТовары = Объект.Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
			Если НайденныеТовары.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НайденныеМарки = Объект.Марки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
			Если НайденныеМарки.Количество() > 0 Тогда
				ПредставлениеМарок = "Введено марок: " + Строка(НайденныеМарки.Количество());
			Иначе
				ПредставлениеМарок = "";
			КонецЕсли;
			
			СтрокаТоваров = НайденныеТовары[0];
			СтрокаТоваров.ПредставлениеМарок = ПредставлениеМарок;
			
			Если НЕ ПустаяСтрока(ИмяКоличества) Тогда
				СтрокаТоваров[ИмяКоличества] = НайденныеМарки.Количество();
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ТоварыПослеУдаления()

// Общий обработчик события возникающего при выходе из режима редактирования строки.
//
// Параметры:
//  Объект               - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  НоваяСтрока          - Булево               - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево               - Истина, если произошла отмена редактирования.
//  ИмяТабличнойЧасти    - Строка               - Имя таблицы, при редактировании которой возникло данное событие.
//  СписокРеквизитов     - Строка               - Имена реквизитов, перечисленные через запятую, в формате
//                                                требований к свойствам структуры.
//                                                Например, "Код, Наименование, Родитель".
//                       - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//                                                псевдоним поля для возвращаемой структуры с результатом, а в качестве
//                                                значения (опционально) фактическое имя поля в таблице.
//                                                Если значение не определено, то имя поля берется из ключа.
//                       - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//                                                к свойствам структуры.
//                                                Служебные поля для получения данных:
//                                                _ИтогиОпераций, _Константа, _Право.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов с префиксом "Представление".
//
Функция МаркиПриОкончанииРедактирования(Знач Объект, НоваяСтрока, ОтменаРедактирования, ИмяТабличнойЧасти="Марки", СписокРеквизитов=Неопределено) Экспорт
	
	// Уточним перечень получаемых реквизитов объекта
	СписокРеквизитов = "Марки,Товары";
	
	// Получаем данные текущего объекта необходимые для дополнительной обработки события на клиенте/сервере.
	ВозвращаемыеДанные = УправлениеДиалогомСервер.ПолучитьДанныеОбъекта(Объект, СписокРеквизитов);
	
	// Обновим служебные реквизиты Алкогольной продукции
	ЗащищенныеФункцииСервер.ЗаполнитьРеквизитАлкогольнойПродукции(Объект,ВозвращаемыеДанные.Товары, ВозвращаемыеДанные.Марки);
	
	ЗащищенныеФункцииСервер.ЗаполнитьРеквизитЦенаБезНДС(Объект);
	
	ВозвращаемыеДанные.Вставить("_Объект", Объект);
	
	Возврат ВозвращаемыеДанные;
	
КонецФункции // ПолучитьДанныеПриОкончанииРедактирования()

// Обработчик события возникающего при изменении данных реквизита "КодМарки" в таблице "Марки".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура МаркиКодМаркиПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено, ИмяТаблицы = "Марки") Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	ПроверятьАП = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ПроверятьАП", Истина);
	
	//Если ПроверятьАП = Ложь И (СтрДлина(Строка.КодМарки) = 150 ИЛИ СтрДлина(Строка.КодМарки) = 68) Тогда
	//	ПараметрыДействия.Вставить("КодАП",Строка.КодМарки);
	//	Возврат;
	//ИначеЕсли ПроверятьАП = Ложь И (СтрДлина(Строка.КодМарки) <> 150 И СтрДлина(Строка.КодМарки) <> 68) Тогда
	//	ВывестиСообщение(СтрШаблон(НСтр("ru = 'Некорректный код акцизной марки: %1'"), Строка.КодМарки));
	//	Строка.КодМарки = "";
	//	Возврат;
	//КонецЕсли;
	
	ТекстОбшибки = "";
	КодАП = ИнтеграцияЕГАИСВызовСервера.ПолучитьКодАПИзАкцизнойМарки(Строка.КодМарки, ТекстОбшибки);
	Если ПроверятьАП И КодАП = Неопределено Тогда
		ВывестиСообщение(ТекстОбшибки);
		Строка.КодМарки = "";
		Возврат;
	ИначеЕсли КодАП = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыДействия.Вставить("КодАП",КодАП);
	
КонецПроцедуры // МаркиКодМаркиПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ПОЛУЧЕНИЯ ПРЕДСТАВЛЕНИЯ ДОКУМЕНТА

// Общий обработчик события возникающего при получении представления объекта или ссылки.
//
// Параметры:
//  Источник             - ДокументМенеджер - Документ менеджер, для которого происходит формирование представления.
//  Данные               - Структура - Содержит значения полей, из которых формируется представление.
//  Представление        - Строка - Строка, в которую нужно поместить представление объекта или ссылки.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаПолученияПредставления(Источник, Данные, Представление, СтандартнаяОбработка=ИСТИНА) Экспорт
	
	УправлениеДиалогомКлиентСервер.ОбработкаПолученияПредставления(Источник,Данные,Представление, СтандартнаяОбработка);
	
КонецПроцедуры // ОбработкаПолученияПредставления()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ПОДГОТОВКИ ДАННЫХ ДЛЯ ПРОБИТИЯ ДОКУМЕНТА

Процедура ПолучитьШаблонЧека(ОбщиеПараметры, ОписаниеОшибки, ПараметрыПробития) Экспорт
	
	// Определим вид выписки (расход/приход) и если указаны возвраты, то возврат
	Объект = ПараметрыПробития.Объект;
	
	// Определим телефон и/или емаил
	Свойства = УправлениеСвойствами.ПолучитьЗначенияСвойств(Объект.Ссылка);
	КИПокупателя = Свойства.Найти(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ТелефонИЛИЭлектронныйАдресПокупателя, "Свойство");
	Если НЕ КИПокупателя = Неопределено И ЗначениеЗаполнено(КИПокупателя.Значение) Тогда
		Телефон = СтрЗаменить(КИПокупателя.Значение, " " ,"");
		Телефон = СтрЗаменить(Телефон, "(" ,"");
		Телефон = СтрЗаменить(Телефон, ")" ,"");
		Телефон = СтрЗаменить(Телефон, "-" ,"");

		Если ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(КИПокупателя.Значение) Тогда
			ОбщиеПараметры.ПокупательEmail = КИПокупателя.Значение;
		ИначеЕсли ОбщегоНазначенияКлиентСервер.СтрокаСодержитТолькоДопустимыеСимволы(Телефон,"+0123456789") И СтрНайти(Телефон,"+") = 1 Тогда
			ОбщиеПараметры.ПокупательНомер = КИПокупателя.Значение;
		Иначе
			ОписаниеОшибки = ?(ЗначениеЗаполнено(ОписаниеОшибки),ОписаниеОшибки+Символы.ПС, НСтр("ru = 'В поле ""Телефон или электронный адрес покупателя"" введены не корректные данные'"));
			Возврат;	
		КонецЕсли;
	КонецЕсли;

	// Настройка отправки электронного чека
	ОбщиеПараметры.Электронно = Константы.НеПечататьФискальныйЧекПриОтправкеЭлектронногоЧекаПокупателю.Получить();
	ОбщиеПараметры.Отправляет1СSMS = Константы.ЭлектронныйЧекSMSПередаютсяПрограммой1С.Получить() И ЗначениеЗаполнено(ОбщиеПараметры.ПокупательНомер);
	ОбщиеПараметры.Отправляет1СEmail = Константы.ЭлектронныйЧекEmailПередаютсяПрограммой1С.Получить() И ЗначениеЗаполнено(ОбщиеПараметры.ПокупательEmail);
	
	// Дополнительный реквизит чека
	Свойства = УправлениеСвойствами.ПолучитьЗначенияСвойств(Объект.Ссылка);
	ДополнительныйРеквизитЧека = Свойства.Найти(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДополнительныйРеквизитЧека, "Свойство");
	Если НЕ ДополнительныйРеквизитЧека = Неопределено И ЗначениеЗаполнено(ДополнительныйРеквизитЧека.Значение) Тогда
		ОбщиеПараметры.ДополнительныйРеквизит = ДополнительныйРеквизитЧека.Значение;
	КонецЕсли;
	
	// Определеним СНО 
	СтруктураОрганизация = Новый Структура;
	ОрганизацияОбъекта = Неопределено;
	ПодразделениеКомпанииОбъекта = Неопределено;
	СкладКомпанииОбъекта = Неопределено;
	
	Если ЕстьРеквизитНаКлиенте(ПараметрыПробития.Объект, "Организация") Тогда
		ОрганизацияОбъекта = ПараметрыПробития.Объект.Организация;
	КонецЕсли;
	
	Если ЕстьРеквизитНаКлиенте(ПараметрыПробития.Объект, "ПодразделениеКомпании") Тогда
		ПодразделениеКомпанииОбъекта = ПараметрыПробития.Объект.ПодразделениеКомпании;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыПробития.Объект.Ссылка) = Тип("ДокументСсылка.Чек") Тогда
		СкладКомпанииОбъекта = ПараметрыПробития.Объект.СкладКомпании;
	КонецЕсли;
	
	Дата = ?(ЕстьРеквизит(ПараметрыПробития.Объект, "Дата"), ПараметрыПробития.Объект.Дата, Неопределено);
	
	СтруктураОрганизация = ПолучитьПараметрыОрганизации(
		ОрганизацияОбъекта,
		ПодразделениеКомпанииОбъекта,
		СкладКомпанииОбъекта,
		Дата);
		
	// Параметры необходимые для чека ЕНВД на принтере чеков
	Если СтруктураОрганизация.Свойство("НаименованиеПолное") Тогда
		ОбщиеПараметры.ОрганизацияНазвание = СтруктураОрганизация.НаименованиеПолное;
	КонецЕсли;
	Если СтруктураОрганизация.Свойство("ИНН") Тогда
		ОбщиеПараметры.ОрганизацияИНН = СтруктураОрганизация.ИНН;
	КонецЕсли;
	Если СтруктураОрганизация.Свойство("КПП") Тогда
		ОбщиеПараметры.ОрганизацияКПП = СтруктураОрганизация.КПП;
	КонецЕсли;
	
	ДокументыОплаты = Новый Массив;
	ДокументыОплаты.Добавить(Тип("ДокументСсылка.ЧекНаОплату"));
	ДокументыОплаты.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
	ДокументыОплаты.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
	ДокументыОплаты.Добавить(Тип("ДокументСсылка.Чек"));
	ДокументыОплаты.Добавить(Тип("ДокументСсылка.Выписка"));
	
	Если СтруктураОрганизация.Свойство("СистемаНалогообложения") И НЕ ДокументыОплаты.Найти(ТипЗнч(Объект.Ссылка)) = Неопределено Тогда
		ОбщиеПараметры.СистемаНалогообложения = СтруктураОрганизация.СистемаНалогообложения;
	Иначе
		ОбщиеПараметры.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ОСН"); // Системы налогообложения - "Перечисление.ТипыСистемНалогообложенияККТ" 
	КонецЕсли;

	// Формирование табличной части
	ТекстОшибки = "";
	ЗаполнитьТовары(ТекстОшибки, Объект, ОбщиеПараметры);
	
	ОписаниеОшибки = ?(ЗначениеЗаполнено(ОписаниеОшибки),ОписаниеОшибки+Символы.ПС,ТекстОшибки);
		
	ФорматноЛогическийКонтрольКлиентСервер.ПровестиФорматноЛогическийКонтроль(ОбщиеПараметры, ПараметрыПробития.ФР);
	
	// Формирование таблицы оплат
	ТекстОшибки = "";
	ЗаполнитьОплаты(ТекстОшибки, ПараметрыПробития.Объект, ОбщиеПараметры.ТаблицаОплат, ЕстьРеквизитНаКлиенте(ПараметрыПробития.Объект, "Оплаты"));
	
	ОписаниеОшибки = ?(ЗначениеЗаполнено(ОписаниеОшибки),ОписаниеОшибки+Символы.ПС,ТекстОшибки);

КонецПроцедуры

Процедура ЗаполнитьОплаты(ТекстОшибки, Объект, ТаблицаОплат, ЕстьТаблицаОплат = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивСделок = Новый Массив;
	МассивСделок.Добавить(Тип("ДокументСсылка.ПоступлениеТоваров"));
	МассивСделок.Добавить(Тип("ДокументСсылка.РеализацияТоваров"));
	
	Если ЕстьТаблицаОплат Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Оплаты.ТипОплаты КАК Справочник.ТипыОплат) КАК ТипыОплат,
		|	Оплаты.Сумма
		|ПОМЕСТИТЬ втОплаты
		|ИЗ
		|	&Оплаты КАК Оплаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОплаты.ТипыОплат.Представление КАК Представление,
		|	втОплаты.ТипыОплат.ТипОплатыККТ КАК ТипОплатыККТ,
		|	втОплаты.Сумма
		|ИЗ
		|	втОплаты КАК втОплаты";
		Запрос.УстановитьПараметр("Оплаты", Объект.Оплаты.Выгрузить());
		
		Результат = Запрос.Выполнить();
		
		СуммаНаличные = 0;
		СуммаЭлектронно = 0;
		СуммаПредоплата = 0;
		СуммаПостоплата = 0;
		СуммаПредоставление = 0;
		
		Если НЕ Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл 
				Если Выборка.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Наличные Тогда
					СуммаНаличные = СуммаНаличные + Выборка.Сумма;
				ИначеЕсли Выборка.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Электронно Тогда
					СуммаЭлектронно = СуммаЭлектронно + Выборка.Сумма;
				ИначеЕсли Выборка.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Предоплата Тогда
					СуммаПредоплата = СуммаПредоплата + Выборка.Сумма;
				ИначеЕсли Выборка.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Постоплата Тогда
					СуммаПостоплата = СуммаПостоплата + Выборка.Сумма;
				ИначеЕсли Выборка.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.ВстречноеПредоставление Тогда
					СуммаПредоставление = СуммаПредоставление + Выборка.Сумма;
				ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.ТипОплатыККТ) Тогда
					Если ПустаяСтрока(ТекстОшибки) Тогда
						ТекстОшибки = НСтр("ru = 'Для типа оплаты'") + " """ + Выборка.Представление + """ " 
							+ НСтр("ru = 'не указан ""Тип оплаты ККТ'") + """";
					Иначе
						ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = 'Для типа оплаты'") + " """+ Выборка.Представление 
							+ """ " + НСтр("ru = 'не указан ""Тип оплаты ККТ'") + """";
					КонецЕсли;
					Преобразована = Ложь;
					Продолжить;
				КонецЕсли;
			КонецЦикла;
			
			// Наличные
			Если СуммаНаличные > 0 Тогда
				СтрокаОплаты = Новый Структура();
				СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Наличные);
				СтрокаОплаты.Вставить("Сумма", СуммаНаличные);
				ТаблицаОплат.Добавить(СтрокаОплаты);
			КонецЕсли;
			
			// Электронно
			Если СуммаЭлектронно > 0 Тогда
				СтрокаОплаты = Новый Структура();
				СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Электронно);
				СтрокаОплаты.Вставить("Сумма", СуммаЭлектронно);
				ТаблицаОплат.Добавить(СтрокаОплаты);
			КонецЕсли;
			
			// Предоплата
			Если СуммаПредоплата > 0 Тогда
				СтрокаОплаты = Новый Структура();
				СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Предоплата);
				СтрокаОплаты.Вставить("Сумма", СуммаПредоплата);
				ТаблицаОплат.Добавить(СтрокаОплаты);
			КонецЕсли;
			
			// Постоплата
			Если СуммаПостоплата > 0 Тогда
				СтрокаОплаты = Новый Структура();
				СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Постоплата);
				СтрокаОплаты.Вставить("Сумма", СуммаПостоплата);
				ТаблицаОплат.Добавить(СтрокаОплаты);
			КонецЕсли;
			
			// Встречное предоставление
			Если СуммаПредоставление > 0 Тогда
				СтрокаОплаты = Новый Структура();
				СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.ВстречноеПредоставление);
				СтрокаОплаты.Вставить("Сумма", СуммаПредоставление);
				ТаблицаОплат.Добавить(СтрокаОплаты);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.СтрокаБанковскойВыписки Тогда
		СуммаВсехОплат = ?(Объект.СуммаДокумента>0,Объект.СуммаДокумента,-Объект.СуммаДокумента);
		
		СтрокаОплаты = Новый Структура();
		СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Электронно);
		СтрокаОплаты.Вставить("Сумма", СуммаВсехОплат);
		ТаблицаОплат.Добавить(СтрокаОплаты);
		
		Если Объект.ТипСпособаРасчетаККТ = Перечисления.ТипыСпособаРасчетаККТ.Передача Тогда
			
			СуммаАванса = 0;
			
			Для Каждого ТекущаяСтрока Из Объект.Состав Цикл
				Если НЕ МассивСделок.Найти(ТипЗнч(ТекущаяСтрока.Сделка)) = Неопределено Тогда
					
					ДанныеСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяСтрока.Сделка, "СуммаДокумента,ВалютаДокумента,КурсДокумента");
					
					СуммаСделки = 0;
					Если НЕ Объект.ВалютаДокумента = ДанныеСделки.ВалютаДокумента Тогда
						СуммаСделки = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(
						ДанныеСделки.СуммаДокумента,
						ДанныеСделки.ВалютаДокумента,
						ДанныеСделки.КурсДокумента,
						Объект.ВалютаДокумента,
						Объект.КурсДокумента,
						РежимОкругления.Окр15как20);
					Иначе
						СуммаСделки = ДанныеСделки.СуммаДокумента;
					КонецЕсли;
					
					СуммаОплатыСтроки = ТекущаяСтрока.СуммаПриход + ТекущаяСтрока.СуммаРасход;
					Если СуммаСделки > СуммаОплатыСтроки Тогда
						СуммаАванса = СуммаАванса + СуммаСделки - СуммаОплатыСтроки;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если СуммаАванса > 0 Тогда
				СтрокаОплаты = Новый Структура();
				СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Предоплата);
				СтрокаОплаты.Вставить("Сумма", СуммаАванса);
				ТаблицаОплат.Добавить(СтрокаОплаты);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		СуммаВсехОплат = Объект.СуммаДокумента;
		
		Если ЕстьРеквизит(Объект, "СуммаСкидкиНаценки") И (Объект.СуммаСкидкиНаценки > 0) Тогда
			СуммаВсехОплат = СуммаВсехОплат - Объект.СуммаСкидкиНаценки;
		КонецЕсли;
		
		СтрокаОплаты = Новый Структура();
		СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Наличные);
		СтрокаОплаты.Вставить("Сумма", СуммаВсехОплат);
		ТаблицаОплат.Добавить(СтрокаОплаты);
		
		// Дозаполним оплаты зачетом аванса
		Если ЕстьРеквизит(Объект, "ТипСпособаРасчетаККТ")
			 И Объект.ТипСпособаРасчетаККТ = Перечисления.ТипыСпособаРасчетаККТ.Передача
			 И НЕ МассивСделок.Найти(ТипЗнч(Объект.ДокументОснование)) = Неопределено Тогда
			
			ДанныеСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДокументОснование, "СуммаДокумента,ВалютаДокумента,КурсДокумента");
			
			СуммаСделки = 0;
			Если НЕ Объект.ВалютаДокумента = ДанныеСделки.ВалютаДокумента Тогда
				СуммаСделки = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(
					ДанныеСделки.СуммаДокумента,
					ДанныеСделки.ВалютаДокумента,
					ДанныеСделки.КурсДокумента,
					Объект.ВалютаДокумента,
					Объект.КурсДокумента,
					РежимОкругления.Окр15как20);
			Иначе
				СуммаСделки = ДанныеСделки.СуммаДокумента;
			КонецЕсли;
			
			Если СуммаВсехОплат < СуммаСделки Тогда
				СуммаАванса = СуммаСделки - СуммаВсехОплат;
				СтрокаОплаты = Новый Структура();
				СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Предоплата);
				СтрокаОплаты.Вставить("Сумма", СуммаАванса);
				ТаблицаОплат.Добавить(СтрокаОплаты);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТовары(ТекстОшибки, Объект, ОбщиеПараметры)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Ссылка = Объект.Ссылка;
	ПозицииЧека = ОбщиеПараметры.ПозицииЧека;
	СистемаНалогообложения = ОбщиеПараметры.СистемаНалогообложения;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Чек") Тогда
		ТипСпособаРасчетаККТ = Перечисления.ТипыСпособаРасчетаККТ.Передача;
	Иначе
		ТипСпособаРасчетаККТ = Ссылка.ТипСпособаРасчетаККТ;
	КонецЕсли;
	
	ПризнакСпособаРасчета = Перечисления.ТипыСпособаРасчетаККТ.ПолучитьПризнакСпособаРасчета(ТипСпособаРасчетаККТ, Ссылка);
	
	Если ТипСпособаРасчетаККТ = Перечисления.ТипыСпособаРасчетаККТ.Предоплата Тогда 
		Аванс = Истина;
	Иначе
		Аванс = Ложь;
	КонецЕсли;
	
	Если ЕстьРеквизит(Ссылка, "ТипЦен") Тогда
		ЦенаВключаетНДС = Ссылка.ТипЦен.ЦенаВключаетНДС;
	Иначе
		ЦенаВключаетНДС = Истина;
	КонецЕсли;
		
	ТаблицаТоваров = ПодготовитьТаблицуТоваров(Объект);
	
	Если ТаблицаТоваров.Количество() = 0 Тогда
		
		СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
		
		СуммаДокумента = ?(Ссылка.СуммаДокумента>0,Ссылка.СуммаДокумента,-Ссылка.СуммаДокумента);
		
		Наименование = ?(Ссылка.ХозОперация = Справочники.ХозОперации.РасходныйКассовыйОрдер, НСтр("ru = 'Возврат по документу:'"), НСтр("ru = 'Оплата по документу:'"));
		
		СтрокаПозицииЧека.Наименование = Наименование + " " + Ссылка.ХозОперация;
		СтрокаПозицииЧека.Количество     = 1;
		СтрокаПозицииЧека.Цена           = СуммаДокумента;
		СтрокаПозицииЧека.ЦенаСоСкидками = СуммаДокумента;
		СтрокаПозицииЧека.Сумма          = СуммаДокумента;
		СтрокаПозицииЧека.НомерСекции    = 2;
		
		СтрокаПозицииЧека.СтавкаНДС      = СтавкаНДСВФорматеБПО(Ссылка.СтавкаНДС, Аванс, Ссылка.Дата);
		
		СтрокаПозицииЧека.ПризнакСпособаРасчета = ПризнакСпособаРасчета;
		СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
		
		ПозицииЧека.Добавить(СтрокаПозицииЧека);
		
		
	Иначе
		
		Для Каждого СтрокаТЧ Из ТаблицаТоваров Цикл
			
			НаименованиеТовара = Строка(СтрокаТЧ.Номенклатура) + ?(ЗначениеЗаполнено(СтрокаТЧ.ХарактеристикаНоменклатуры), " (" + Строка(СтрокаТЧ.ХарактеристикаНоменклатуры) + ")", "");
			
			Если ТипСпособаРасчетаККТ <> Перечисления.ТипыСпособаРасчетаККТ.Передача И СтрокаТЧ.СуммаОплаты = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипСпособаРасчетаККТ = Перечисления.ТипыСпособаРасчетаККТ.Передача Тогда
				Цена = СтрокаТЧ.Цена;
				КоличествоСУчетомКоэффициента = Окр(СтрокаТЧ.Количество*СтрокаТЧ.Коэффициент, 3);
				Сумма = СтрокаТЧ.СуммаВсего;
				Если НЕ ЦенаВключаетНДС Тогда
					Цена = Окр(Цена * (1 + СтрокаТЧ.СтавкаНДС.Ставка / 100), 2);
				КонецЕсли;
				СуммаНДС = СтрокаТЧ.СуммаНДС;
				СтавкаНДС = СтавкаНДСВФорматеБПО(СтрокаТЧ.СтавкаНДС, Аванс, Ссылка.Дата);
				СуммаСкидкиСтроки = Число(СтрокаТЧ.СуммаСкидкиСтроки);
				СуммаСкидки = Число(СтрокаТЧ.СуммаСкидки);
				ЦенаСоСкидками = Окр(Сумма/КоличествоСУчетомКоэффициента, 2, 1);
			Иначе
				НаименованиеТовара = Строка(НаименованиеТовара) + " " + НСтр("ru = 'платеж за'") + " " 
				+ Окр(СтрокаТЧ.Количество, 3)+ Символы.НПП + Строка(СтрокаТЧ.ЕдиницаИзмерения.Наименование) + "";
				Цена = СтрокаТЧ.СуммаОплаты;
				КоличествоСУчетомКоэффициента = 1;
				СтавкаНДС = СтавкаНДСВФорматеБПО(СтрокаТЧ.СтавкаНДС, Аванс, Ссылка.Дата);
				Сумма = СтрокаТЧ.СуммаОплаты;
				ЦенаСоСкидками = Цена;
				СуммаСкидкиСтроки = 0;
				СуммаСкидки = 0;
				
				// Если постоплата, то налог уже заплатили при отгрузке
				Если ТаблицаТоваров.Итог("СуммаВсего") <> ТаблицаТоваров.Итог("СуммаОплаты") Тогда
					СуммаНДС = Окр(СтрокаТЧ.СуммаОплаты - СтрокаТЧ.СуммаОплаты / (1 + СтрокаТЧ.СтавкаНДС.Ставка / 100), 2);
				ИначеЕсли ТипСпособаРасчетаККТ = Перечисления.ТипыСпособаРасчетаККТ.Постоплата Тогда
					СуммаНДС = 0;
					СтавкаНДС = Неопределено;
				Иначе
					СуммаНДС = СтрокаТЧ.СуммаНДС;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека();
			
			СтрокаПозицииЧека.Наименование = НаименованиеТовара;
			СтрокаПозицииЧека.Количество = КоличествоСУчетомКоэффициента;
			СтрокаПозицииЧека.Цена= Цена;
			СтрокаПозицииЧека.Сумма = Сумма;
			СтрокаПозицииЧека.ЦенаСоСкидками = ЦенаСоСкидками;
			СтрокаПозицииЧека.СуммаСкидок = СуммаСкидки + СуммаСкидкиСтроки;
			СтрокаПозицииЧека.НомерСекции = 0;
			
			СтрокаПозицииЧека.СуммаНДС = СуммаНДС;
			
			Если ТипСпособаРасчетаККТ <> Перечисления.ТипыСпособаРасчетаККТ.Передача Тогда
				СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
			Иначе
				СтрокаПозицииЧека.ПризнакПредметаРасчета = СтрокаТЧ.ПризнакПредметаРасчета;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ПризнакАгента) Тогда
				СтрокаПозицииЧека.ПризнакАгентаПоПредметуРасчета = СтрокаТЧ.ПризнакАгента;
				ЗаполнитьЗначенияСвойств(СтрокаПозицииЧека.ДанныеПоставщика,СтрокаТЧ);
			КонецЕсли;	
				
			СтрокаПозицииЧека.ПризнакСпособаРасчета = ПризнакСпособаРасчета;
			СтрокаПозицииЧека.СтавкаНДС = СтавкаНДС;
			
			СтрокаПозицииЧека.ЕдиницаИзмерения = СтрокаТЧ.ЕдиницаИзмерения;
			СтрокаПозицииЧека.НомерСтрокиТовара = СтрокаТЧ.НомерСтроки;
			ПозицииЧека.Добавить(СтрокаПозицииЧека);
		КонецЦикла;
		
		// Заполним тег агента 1057 и данные поставщика в шапке
		ТаблицаТоваров.Свернуть("ПризнакАгента,Телефон,Наименование,ИНН");
		Если ТаблицаТоваров.Количество() = 1 И ЗначениеЗаполнено(ТаблицаТоваров[0].ПризнакАгента) И ОбщиеПараметры.ПозицииЧека.Количество() >0 Тогда
			ОбщиеПараметры.ПризнакАгента = ОбщиеПараметры.ПозицииЧека[0].ПризнакАгентаПоПредметуРасчета;
			ЗаполнитьЗначенияСвойств(ОбщиеПараметры.ДанныеПоставщика,ОбщиеПараметры.ПозицииЧека[0].ДанныеПоставщика);	
		КонецЕсли;
		
	КонецЕсли;				
	
КонецПроцедуры

Функция ПодготовитьТаблицуТоваров(Объект) Экспорт 

	ТаблицаТоваров = Новый ТаблицаЗначений;
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ТаблицаТоваров.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов(Массив,,, Новый КвалификаторыЧисла(10,0,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаТоваров.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоваров.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаТоваров.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмерения",Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	ТаблицаТоваров.Колонки.Добавить("Коэффициент",  Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));
	ТаблицаТоваров.Колонки.Добавить("КоличествоБазовое",  Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	ТаблицаТоваров.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("СуммаВсего",  Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС",Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
	ТаблицаТоваров.Колонки.Добавить("ПризнакПредметаРасчета",Новый ОписаниеТипов("ПеречислениеСсылка.ПризнакиПредметаРасчета"));
	ТаблицаТоваров.Колонки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("СуммаОплаты", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("СуммаСкидкиСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("СуммаСкидки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаТоваров.Колонки.Добавить("ДоговорВзаиморасчетов",Новый ОписаниеТипов("СправочникСсылка.ДоговорыВзаиморасчетов"));
	ТаблицаТоваров.Колонки.Добавить("ПризнакАгента",Новый ОписаниеТипов("ПеречислениеСсылка.ПризнакиАгента"));
	ТаблицаТоваров.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(0,ДопустимаяДлина.Переменная)));
	ТаблицаТоваров.Колонки.Добавить("Телефон",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(20,ДопустимаяДлина.Переменная)));
	ТаблицаТоваров.Колонки.Добавить("ИНН",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(12,ДопустимаяДлина.Переменная)));

	МассивСделок = Новый Массив;
	МассивСделок.Добавить(Тип("ДокументСсылка.ПоступлениеТоваров"));
	МассивСделок.Добавить(Тип("ДокументСсылка.РеализацияТоваров"));
	
	Если ТипЗнч(Объект.Ссылка)=Тип("ДокументСсылка.Выписка") И Объект.Товары.Количество()=0 Тогда
		
		// Получим сумму оплаты и сделки
		ТаблицаСделок = Объект.Состав.Выгрузить(, "Сделка,СуммаПриход,СуммаРасход");
		ТаблицаСделок.Свернуть("Сделка", "СуммаПриход,СуммаРасход");
		ТаблицаСделок.Сортировать("Сделка");
		
		// Подготовим данные для получение номенклатуры по сделке
		СтрукутраСделки = Новый Структура("ДокументОснование,ВалютаДокумента,КурсДокумента");
		ЗаполнитьЗначенияСвойств(СтрукутраСделки, Объект,, "ДокументОснование");
		
		ТаблицаТоваровКопия =  ТаблицаТоваров.Скопировать();                                  
		
		// Добавим строку для формирование без сделки
		НоваяСтрока = ТаблицаТоваров.Добавить();
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.Предоплата;
		НоваяСтрока.ПризнакПредметаРасчета = НоваяСтрока.Номенклатура.ТипНоменклатуры.ПризнакПредметаРасчета; 
		НоваяСтрока.Цена = 0;
		ОбработкаТабличнойЧастиТовары.НоменклатураПриИзменении(Объект,НоваяСтрока);
		НоваяСтрока.СтавкаНДС = Объект.СтавкаНДС;
		КурсДокументаОплаты = Объект.КурсДокумента;
		ОбщаяСуммаДокументов = 0;
		
		ЕстьПередачаТовара = Истина;
		
		// Распределим сумму оплатц/возрата по товарам сделки
		Для Каждого ТекущаяСтрока Из ТаблицаСделок Цикл
			СтрукутраСделки.ДокументОснование = ТекущаяСтрока.Сделка;
			ТабличнаяЧастьДокументаОснования=ПолучитьТабличнуюЧастьДокументаОснования(СтрукутраСделки);
			
			ЕстьПередачаТовара = ЕстьПередачаТовара И (ЗначениеЗаполнено(ТекущаяСтрока.Сделка) И НЕ МассивСделок.Найти(ТипЗнч(ТекущаяСтрока.Сделка)) = Неопределено);
			
			// Укажем сумму сделки как предоплата
			Если ТабличнаяЧастьДокументаОснования=Неопределено ИЛИ ТабличнаяЧастьДокументаОснования.Количество()=0 Тогда
				ТаблицаТоваров[0].Цена = ТаблицаТоваров[0].Цена + (ТекущаяСтрока.СуммаПриход + ТекущаяСтрока.СуммаРасход) * Объект.КурсДокумента;
				ОбщаяСуммаДокументов = ОбщаяСуммаДокументов + (ТекущаяСтрока.СуммаПриход + ТекущаяСтрока.СуммаРасход) * Объект.КурсДокумента;  
			Иначе
				
				ОбщаяСуммаДокументов = ОбщаяСуммаДокументов + ТабличнаяЧастьДокументаОснования.Итог("СуммаВсего") * КурсДокументаОплаты;  
				
				Для Каждого ТекущаяСтрокаТоваров Из ТабличнаяЧастьДокументаОснования Цикл
					НоваяСтрока = ТаблицаТоваровКопия.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрокаТоваров);
					НоваяСтрока.Цена = ТекущаяСтрокаТоваров.Цена * КурсДокументаОплаты;
					НоваяСтрока.Сумма = ТекущаяСтрокаТоваров.Сумма * КурсДокументаОплаты;
					НоваяСтрока.СуммаНДС = ТекущаяСтрокаТоваров.СуммаНДС * КурсДокументаОплаты;
					НоваяСтрока.СуммаСкидки = ТекущаяСтрокаТоваров.СуммаСкидки * КурсДокументаОплаты;
					НоваяСтрока.СуммаВсего = ТекущаяСтрокаТоваров.СуммаВсего * КурсДокументаОплаты;
					НоваяСтрока.СуммаСкидкиСтроки = ТекущаяСтрокаТоваров.СуммаСкидкиСтроки * КурсДокументаОплаты;
				КонецЦикла;
				
				// Распределим текущую сумму оплат на сделку
				Документы.ЧекНаОплату.ПроизвестиРаспределениеСуммыОплаты((ТекущаяСтрока.СуммаПриход + ТекущаяСтрока.СуммаРасход) * КурсДокументаОплаты, ТаблицаТоваровКопия);
				
				// Перенесем в Товары
				Для Каждого ТекущаяСтрокаНоменклатуры Из ТаблицаТоваровКопия Цикл
					ЗаполнитьЗначенияСвойств(ТаблицаТоваров.Добавить(), ТекущаяСтрокаНоменклатуры,, "НомерСтроки");
				КонецЦикла;
				
				ТаблицаТоваровКопия.Очистить();
				
			КонецЕсли;
			
		КонецЦикла;	
		
		// Избавимся от дублей
		ТаблицаТоваров.Свернуть("НомерСтроки, Номенклатура,ЕдиницаИзмерения,Коэффициент,СтавкаНДС,ХарактеристикаНоменклатуры,ДоговорВзаиморасчетов,ПризнакАгента,Наименование,Телефон,ИНН,ПризнакПредметаРасчета","Количество,Цена,Сумма,СуммаСкидкиСтроки,СуммаНДС,СуммаВсего,СуммаОплаты,СуммаСкидки,КоличествоБазовое");
		
		СуммаДокумента = ?(Объект.СуммаДокумента<0,-Объект.СуммаДокумента, Объект.СуммаДокумента) * Объект.КурсДокумента;
		Если Объект.ТипСпособаРасчетаККТ = Перечисления.ТипыСпособаРасчетаККТ.Передача И 
			СуммаДокумента <> ОбщаяСуммаДокументов И НЕ ЕстьПередачаТовара Тогда
			ТаблицаТоваров.Очистить();
			Возврат ТаблицаТоваров;
		КонецЕсли;
		
		// Проверим наличие предоплат
		Если ТаблицаТоваров[0].Цена = 0 ИЛИ ТаблицаТоваров.Количество() = 1 Тогда
			ТаблицаТоваров.Удалить(0);
		Иначе
			ОбработкаТабличнойЧастиТовары.ЦенаПриИзменении(Объект,ТаблицаТоваров[0]);
			ТаблицаТоваров[0].СуммаОплаты = ТаблицаТоваров[0].Цена;
		КонецЕсли;
			
	ИначеЕсли (ТипЗнч(Объект.Ссылка)=Тип("ДокументСсылка.РасходныйКассовыйОрдер") ИЛИ ТипЗнч(Объект.Ссылка)=Тип("ДокументСсылка.ПриходныйКассовыйОрдер")) И Объект.Товары.Количество()=0 Тогда
		
		ТабличнаяЧастьДокументаОснования=ПолучитьТабличнуюЧастьДокументаОснования(Объект);
		Если НЕ ТабличнаяЧастьДокументаОснования=Неопределено И ТабличнаяЧастьДокументаОснования.Количество()>0 Тогда
			КурсДокументаОплаты = Объект.КурсДокумента;
			Если Объект.ТипСпособаРасчетаККТ = Перечисления.ТипыСпособаРасчетаККТ.Передача 
				И (Объект.СуммаДокумента * Объект.КурсДокумента) <> ТабличнаяЧастьДокументаОснования.Итог("СуммаВсего") * КурсДокументаОплаты
				И (НЕ ЗначениеЗаполнено(Объект.ДокументОснование) ИЛИ МассивСделок.Найти(ТипЗнч(Объект.ДокументОснование)) = Неопределено) Тогда
				Возврат ТаблицаТоваров;
			КонецЕсли;
			
			// Перенесем в Товары
			Для Каждого ТекущаяСтрокаНоменклатуры Из ТабличнаяЧастьДокументаОснования Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаТоваров.Добавить(), ТекущаяСтрокаНоменклатуры,, "НомерСтроки");
			КонецЦикла;
			
			Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
				ТекущаяСтрока.Цена = ТекущаяСтрока.Цена * КурсДокументаОплаты;
				ТекущаяСтрока.Сумма = ТекущаяСтрока.Сумма * КурсДокументаОплаты;
				ТекущаяСтрока.СуммаНДС = ТекущаяСтрока.СуммаНДС * КурсДокументаОплаты;
				ТекущаяСтрока.СуммаСкидки = ТекущаяСтрока.СуммаСкидки * КурсДокументаОплаты;
				ТекущаяСтрока.СуммаВсего = ТекущаяСтрока.СуммаВсего * КурсДокументаОплаты;
				ТекущаяСтрока.СуммаСкидкиСтроки = ТекущаяСтрока.СуммаСкидкиСтроки * КурсДокументаОплаты;
			КонецЦикла;
			Документы.ЧекНаОплату.ПроизвестиРаспределениеСуммыОплаты(Объект.СуммаДокумента * Объект.КурсДокумента, ТаблицаТоваров);
		КонецЕсли;
	
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.НомерСтроки КАК НомерСтроки,
		|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	Товары.Количество КАК Количество,
		|	Товары.Коэффициент КАК Коэффициент,
		|	ВЫРАЗИТЬ(Товары.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения) КАК ЕдиницаИзмерения,
		|	Товары.Цена КАК Цена,
		|	Товары.Сумма КАК Сумма,
		|	Товары.СтавкаНДС КАК СтавкаНДС,
		|	Товары.СуммаНДС КАК СуммаНДС,
		|	Товары.СуммаВсего КАК СуммаВсего,
		|	0 КАК СуммаОплаты,
		|	Товары.ПроцентСкидки КАК ПроцентСкидки,
		|	Товары.ПроцентСкидкиСтроки КАК ПроцентСкидкиСтроки,
		|	Товары.СуммаСкидки КАК СуммаСкидки,
		|	Товары.СуммаСкидкиСтроки КАК СуммаСкидкиСтроки,
		|	ВЫРАЗИТЬ(Товары.ДоговорВзаиморасчетов КАК Справочник.ДоговорыВзаиморасчетов) КАК ДоговорВзаиморасчетов
		|ПОМЕСТИТЬ ТаблицаТоваров
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТаблицаТоваров.Количество КАК Количество,
		|	ТаблицаТоваров.Коэффициент КАК Коэффициент,
		|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаТоваров.Цена КАК Цена,
		|	ТаблицаТоваров.Сумма КАК Сумма,
		|	ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаТоваров.СуммаНДС КАК СуммаНДС,
		|	ТаблицаТоваров.СуммаВсего КАК СуммаВсего,
		|	ТаблицаТоваров.СуммаОплаты КАК СуммаОплаты,
		|	ТаблицаТоваров.ПроцентСкидки КАК ПроцентСкидки,
		|	ТаблицаТоваров.ПроцентСкидкиСтроки КАК ПроцентСкидкиСтроки,
		|	ТаблицаТоваров.СуммаСкидки КАК СуммаСкидки,
		|	ТаблицаТоваров.СуммаСкидкиСтроки КАК СуммаСкидкиСтроки,
		|	ТаблицаТоваров.Номенклатура.ТипНоменклатуры.ПризнакПредметаРасчета КАК ПризнакПредметаРасчета,
		|	ТаблицаТоваров.ДоговорВзаиморасчетов.ТелефонПоставщика КАК Телефон,
		|	ТаблицаТоваров.ДоговорВзаиморасчетов.ИННПоставщика КАК ИНН,
		|	ТаблицаТоваров.ДоговорВзаиморасчетов.НаименованиеПоставщика КАК Наименование,
		|	ТаблицаТоваров.ДоговорВзаиморасчетов.ПризнакАгента КАК ПризнакАгента
		|ИЗ
		|	ТаблицаТоваров КАК ТаблицаТоваров";
		
		Если НЕ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.Чек") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК СуммаОплаты", "Товары.СуммаОплаты КАК СуммаОплаты");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
		          
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			ТаблицаТоваров = Результат.Выгрузить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаТоваров;
	
КонецФункции

// Возвращает табличную часть документа основания
//
// Параметры:
//  СсылкаПКО - ДокументСсылка.ПриходныйКассовыйОрдер - Ссылка на документ, для Основания которого получается табличная часть.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица номенклатуры документа Основания.
//
Функция ПолучитьТабличнуюЧастьДокументаОснования(Ссылка) Экспорт
	
	ДокументОснование = Ссылка.ДокументОснование;
	МетаданныеДокументаОснования = Метаданные.НайтиПоТипу(ТипЗнч(ДокументОснование));
	
	Если МетаданныеДокументаОснования = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если МетаданныеДокументаОснования = Метаданные.Документы.АвансовыйОтчет
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.АктПриемаПередачиЦенныхБумаг
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ВводОстатковВзаиморасчетов
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.Взаимозачет
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.Выписка
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ВыплатаЗарплаты
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ЗаявкаНаРасходДС
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.Инкассация
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.КорректировкаДолга
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.НачислениеЗарплаты
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ОбслуживаниеАктива
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ПереоценкаВалютныхСредств
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ПланПоступленияДС
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.РасходныйКассовыйОрдер
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ПриходныйКассовыйОрдер Тогда
			Возврат Неопределено;
	КонецЕсли;
	
	// создадим таблицу значений как во фронте кассира
	Результат = Новый ТаблицаЗначений;
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов(Массив,,, Новый КвалификаторыЧисла(10,0,ДопустимыйЗнак.Неотрицательный)));
	Результат.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Результат.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	Результат.Колонки.Добавить("ЕдиницаИзмерения",Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	Результат.Колонки.Добавить("Коэффициент",  Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)));
	Результат.Колонки.Добавить("КоличествоБазовое",  Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	Результат.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Результат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Результат.Колонки.Добавить("ПризнакПредметаРасчета",Новый ОписаниеТипов("ПеречислениеСсылка.ПризнакиПредметаРасчета"));
	Результат.Колонки.Добавить("СуммаВсего",  Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Результат.Колонки.Добавить("СтавкаНДС",Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
	Результат.Колонки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Результат.Колонки.Добавить("СуммаСкидкиСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Результат.Колонки.Добавить("СуммаСкидки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Результат.Колонки.Добавить("СуммаОплаты", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	
	ВалютаДокумента = Ссылка.ВалютаДокумента;
	КурсДокумента   = Ссылка.КурсДокумента;
	
	ЕстьВалютаДокументаОснования = ЕстьРеквизит(ДокументОснование,"ВалютаДокумента"); 
	Если ЕстьВалютаДокументаОснования Тогда
		ВалютаДокументаОснования = ДокументОснование.ВалютаДокумента;
		КурсДокументаОснования   = ДокументОснование.КурсДокумента;
		ТребуетсяПересчет = (КурсДокументаОснования <> КурсДокумента);
	Иначе
		ТребуетсяПересчет = Ложь;
	КонецЕсли;
	
	Если МетаданныеДокументаОснования = Метаданные.Документы.СчетНаОплату Тогда
		
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СчетНаОплатуТовары.Номенклатура КАК Номенклатура,
		|	СчетНаОплатуТовары.Количество КАК Количество,
		|	СчетНаОплатуТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СчетНаОплатуТовары.Коэффициент КАК Коэффициент,
		|	СчетНаОплатуТовары.Цена КАК Цена,
		|	СчетНаОплатуТовары.Сумма КАК Сумма,
		|	СчетНаОплатуТовары.СтавкаНДС КАК СтавкаНДС,
		|	СчетНаОплатуТовары.СтавкаНДС.Ставка КАК СтавкаНДССтавка,
		|	СчетНаОплатуТовары.СуммаНДС КАК СуммаНДС,
		|	СчетНаОплатуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СчетНаОплатуТовары.СуммаВсего КАК СуммаВсего,
		|	СчетНаОплатуТовары.СуммаСкидки КАК СуммаСкидки,
		|	СчетНаОплатуТовары.ПроцентСкидки КАК ПроцентСкидки,
		|	СчетНаОплатуТовары.СкидкаНаТовар КАК СкидкаНаТовар,
		|	СчетНаОплатуТовары.ПроцентСкидкиСтроки КАК ПроцентСкидкиСтроки,
		|	СчетНаОплатуТовары.СуммаСкидкиСтроки КАК СуммаСкидкиСтроки,
		|	СчетНаОплатуТовары.Номенклатура.ТипНоменклатуры.ПризнакПредметаРасчета КАК ПризнакПредметаРасчета
		|ИЗ
		|	Документ.СчетНаОплату.Товары КАК СчетНаОплатуТовары
		|ГДЕ
		|	СчетНаОплатуТовары.Ссылка = &Ссылка";
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.РеализацияАктивов Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	РеализацияАктивовАктивы.НомерСтроки,
		|	РеализацияАктивовАктивы.ПрочийАктив.Номенклатура КАК Номенклатура,
		|	РеализацияАктивовАктивы.Сумма,
		|	РеализацияАктивовАктивы.СтавкаНДС,
		|	РеализацияАктивовАктивы.СтавкаНДС.Ставка КАК СтавкаНДССтавка,
		|	РеализацияАктивовАктивы.СуммаНДС,
		|	РеализацияАктивовАктивы.Количество,
		|	РеализацияАктивовАктивы.ПрочийАктив.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	РеализацияАктивовАктивы.ПрочийАктив.Наименование КАК ХарактеристикаНоменклатуры,
		|	РеализацияАктивовАктивы.Сумма КАК СуммаВсего,
		|	РеализацияАктивовАктивы.ПрочийАктив.Номенклатура.ТипНоменклатуры.ПризнакПредметаРасчета КАК ПризнакПредметаРасчета
		|ИЗ
		|	Документ.РеализацияАктивов.Активы КАК РеализацияАктивовАктивы
		|ГДЕ
		|	РеализацияАктивовАктивы.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияАктивовАктивы.НомерСтроки";
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.Инвентаризация Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ИнвентаризацияТовары.НомерСтроки КАК НомерСтроки,
		|	ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
		|	-ИнвентаризацияТовары.Количество КАК Количество,
		|	ИнвентаризацияТовары.ЕдиницаИзмерения,
		|	ИнвентаризацияТовары.Коэффициент,
		|	ИнвентаризацияТовары.Цена КАК Цена,
		|	-ИнвентаризацияТовары.Сумма КАК Сумма,
		|	ИнвентаризацияТовары.ХарактеристикаНоменклатуры,
		|	ИнвентаризацияТовары.Номенклатура.ТипНоменклатуры.ПризнакПредметаРасчета КАК ПризнакПредметаРасчета
		|ИЗ
		|	Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
		|ГДЕ
		|	ИнвентаризацияТовары.Ссылка = &Ссылка
		|	И ИнвентаризацияТовары.Количество < 0";
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ТаможеннаяДекларацияИмпорт Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ТаможеннаяДекларацияИмпортТовары.НомерСтроки,
		               |	ТаможеннаяДекларацияИмпортТовары.Номенклатура,
		               |	ТаможеннаяДекларацияИмпортТовары.ХарактеристикаНоменклатуры,
		               |	ТаможеннаяДекларацияИмпортТовары.ЕдиницаИзмерения,
					   |	ТаможеннаяДекларацияИмпортТовары.Коэффициент,
					   |	ТаможеннаяДекларацияИмпортТовары.Количество,
					   |	ТаможеннаяДекларацияИмпортТовары.СуммаПошлины,
					   |	ТаможеннаяДекларацияИмпортТовары.СуммаНДС,
					   |	ТаможеннаяДекларацияИмпортТовары.СуммаПошлины + ТаможеннаяДекларацияИмпортТовары.СуммаНДС КАК СуммаВсего,
					   |	ТаможеннаяДекларацияИмпортРазделы.СтавкаНДС,
					   |	ТаможеннаяДекларацияИмпортРазделы.СтавкаНДС.Ставка КАК СтавкаНДССтавка,
					   |    ТаможеннаяДекларацияИмпортТовары.Номенклатура.ТипНоменклатуры.ПризнакПредметаРасчета КАК ПризнакПредметаРасчета
					   |ИЗ
					   |	Документ.ТаможеннаяДекларацияИмпорт.Товары КАК ТаможеннаяДекларацияИмпортТовары
					   |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТаможеннаяДекларацияИмпорт.Разделы КАК ТаможеннаяДекларацияИмпортРазделы
					   |		ПО ТаможеннаяДекларацияИмпортТовары.Ссылка = ТаможеннаяДекларацияИмпортРазделы.Ссылка
					   |			И ТаможеннаяДекларацияИмпортТовары.НомерРаздела = ТаможеннаяДекларацияИмпортРазделы.НомерРаздела
		               |ГДЕ
		               |	ТаможеннаяДекларацияИмпортТовары.Ссылка = &Ссылка";
		
	Иначе
		
		РеквизитыТабличнойЧастиДокументаОснования = МетаданныеДокументаОснования.ТабличныеЧасти.Товары.Реквизиты;
		ИмяДокументаОснования = МетаданныеДокументаОснования.Имя;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	"+ИмяДокументаОснования+"Товары.НомерСтроки,
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("Номенклатура")               = Неопределено, "", ИмяДокументаОснования+"Товары.Номенклатура,")+"
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("Количество")                 = Неопределено, "", ИмяДокументаОснования+"Товары.Количество,")+"
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("ЕдиницаИзмерения")           = Неопределено, "", ИмяДокументаОснования+"Товары.ЕдиницаИзмерения,")+"
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("Коэффициент")                = Неопределено, "", ИмяДокументаОснования+"Товары.Коэффициент,")+"
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("Цена")                       = Неопределено, "", ИмяДокументаОснования+"Товары.Цена,")+"
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("Сумма")                      = Неопределено, "", ИмяДокументаОснования+"Товары.Сумма,")+"
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("ПроцентСкидки")              = Неопределено, "", ИмяДокументаОснования+"Товары.ПроцентСкидки,")+"
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("СуммаСкидки")                = Неопределено, "", ИмяДокументаОснования+"Товары.СуммаСкидки,")+"
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("СкидкаНаТовар")              = Неопределено, "", ИмяДокументаОснования+"Товары.СкидкаНаТовар,")+"
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("ПроцентСкидкиСтроки")        = Неопределено, "", ИмяДокументаОснования+"Товары.ПроцентСкидкиСтроки,")+"
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("СуммаСкидкиСтроки")          = Неопределено, "", ИмяДокументаОснования+"Товары.СуммаСкидкиСтроки,")+"
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("СтавкаНДС")                  = Неопределено, "", ИмяДокументаОснования+"Товары.СтавкаНДС,")+"
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("СтавкаНДС")                  = Неопределено, "", ИмяДокументаОснования+"Товары.СтавкаНДС.Ставка КАК СтавкаНДССтавка,")+"
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("СуммаНДС")                   = Неопределено, "", ИмяДокументаОснования+"Товары.СуммаНДС,")+"
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("ХарактеристикаНоменклатуры") = Неопределено, "", ИмяДокументаОснования+"Товары.ХарактеристикаНоменклатуры,")+"
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("МестоРазмещения")            = Неопределено, "", ИмяДокументаОснования+"Товары.МестоРазмещения,")+"	
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("Номенклатура")               = Неопределено, "", ИмяДокументаОснования+"Товары.Номенклатура.ТипНоменклатуры.ПризнакПредметаРасчета КАК ПризнакПредметаРасчета,")+"
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("СуммаВсего")                 = Неопределено, "", ИмяДокументаОснования+"Товары.СуммаВсего")+"
		|ИЗ
		|	Документ."+ИмяДокументаОснования+".Товары КАК "+ИмяДокументаОснования+"Товары
		|ГДЕ
		|	"+ИмяДокументаОснования+"Товары.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	"+ИмяДокументаОснования+"Товары.НомерСтроки";
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	ВыполнениеЗапроса = Запрос.Выполнить();
	
	Выборка = ВыполнениеЗапроса.Выбрать();
	
	ЕстьСтавкаНДС = (ВыполнениеЗапроса.Колонки.Найти("СтавкаНДССтавка") <> Неопределено);
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.Коэффициент) Тогда
			НоваяСтрока.Коэффициент = 1;
		КонецЕсли;
		
		Если ЕстьВалютаДокументаОснования Тогда
			НоваяСтрока.Цена                = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(НоваяСтрока.Цена, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.Сумма               = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(НоваяСтрока.Сумма, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.СуммаСкидки         = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(НоваяСтрока.СуммаСкидки, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.СуммаВсего          = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(НоваяСтрока.СуммаВсего, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.СуммаСкидкиСтроки   = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(НоваяСтрока.СуммаСкидкиСтроки, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			
			Если ТребуетсяПересчет Тогда
				
				Если ЕстьСтавкаНДС Тогда
					НоваяСтрока.СуммаНДС = Окр(НоваяСтрока.СуммаВсего * Выборка.СтавкаНДССтавка / (100 + Выборка.СтавкаНДССтавка), 2);
				Иначе
					НоваяСтрока.СуммаНДС = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(НоваяСтрока.СуммаНДС, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ?(Результат.Количество()=0, Неопределено, Результат);
	
КонецФункции

// Возвращает ставку НДС в формате БПО
//  Параметры:
//   СтавкаНДС - Перечисление.СтавкиНДС
//   ЭтоАванс - Булево.
//  
//  ВозвращаемоеЗначение:
//   Значения: Неопределено-БезНДС, 0, 10, 18, 110, 118.
Функция СтавкаНДСВФорматеБПО(СтавкаНДС, Аванс = Ложь, ДатаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтавкиНДС.Ставка КАК ЗначениеСтавки
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	НЕ СтавкиНДС.ПометкаУдаления
	|	И СтавкиНДС.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СтавкаНДС);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Если СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда
			Возврат Неопределено;
		ИначеЕсли СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС И Аванс Тогда
			Возврат ?(Выборка.ЗначениеСтавки = 20, 120, 118);
		ИначеЕсли Выборка.ЗначениеСтавки = 0 Тогда
			Возврат 0;
		ИначеЕсли Выборка.ЗначениеСтавки = 10 И Аванс Тогда
			Возврат 110;
		ИначеЕсли Выборка.ЗначениеСтавки = 10 Тогда
			Возврат 10;
		ИначеЕсли Выборка.ЗначениеСтавки = 18 И Аванс Тогда
			Возврат 118;
		ИначеЕсли Выборка.ЗначениеСтавки = 18 Тогда
			Возврат 18;
		ИначеЕсли Выборка.ЗначениеСтавки = 20 И Аванс Тогда
			Возврат 120;
		ИначеЕсли Выборка.ЗначениеСтавки = 20 Тогда
			Возврат 20;
		Иначе
			// !!!_Переход на ставку НДС 20%
			Возврат ?(ДатаДокумента < Дата("20190101"), 18, 20);
		КонецЕсли;
	Иначе
		// !!!_Переход на ставку НДС 20%
		// Оставить только 20% после перехода
		Возврат ?(ДатаДокумента < Дата("20190101"), 18, 20);
	КонецЕсли;
	
КонецФункции // СтавкаНДСВФорматеБПО()

Функция ПолучитьПараметрыОрганизации(Организация, ПодразделениеКомпании, СкладКомпании, Дата) Экспорт
	Структура = Новый Структура;
	
	Если НЕ Организация = Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Организации.НаименованиеПолное КАК НаименованиеПолное,
		|	Организации.ИНН КАК ИНН,
		|	Организации.КПП КАК КПП
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Организация);
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Структура.Вставить("НаименованиеПолное", Выборка.НаименованиеПолное);
			Структура.Вставить("ИНН", Выборка.ИНН);
			Структура.Вставить("КПП", Выборка.КПП);
		КонецЕсли;
	КонецЕсли;
	
	// Получим систему налогообложения
	Структура.Вставить("СистемаНалогообложения", ПолучитьСистемуНалогообложенияККТ(Организация, ПодразделениеКомпании, СкладКомпании, Дата));
	
	Возврат Структура;
КонецФункции

Функция ПолучитьСистемуНалогообложенияККТ(Организация, ПодразделениеКомпании, СкладКомпании, НаДату)
	
	ОрганизацияСклада = Неопределено;
	ПодразделениеСклада = Неопределено;
	
	Если ЗначениеЗаполнено(СкладКомпании) Тогда
		ДанныеСкладаКомпании = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СкладКомпании, "Организация,ПодразделениеКомпании");
		ОрганизацияСклада = ДанныеСкладаКомпании.Организация;
		ПодразделениеСклада = ДанныеСкладаКомпании.ПодразделениеКомпании;
	КонецЕсли;
	
	СистемаНалогообложенияККТ = ПолучитьСистемуНалогообложенияККТПоПодразделению(
		?(НЕ ПодразделениеСклада = Неопределено, ПодразделениеСклада, ПодразделениеКомпании),
		НаДату);
		
	Если ЗначениеЗаполнено(СистемаНалогообложенияККТ) Тогда
		Возврат СистемаНалогообложенияККТ;
	КонецЕсли;
	
	СистемаНалогообложенияККТ = ПолучитьСистемуНалогообложенияККТПоОрганизации(
		?(НЕ ОрганизацияСклада = Неопределено, ОрганизацияСклада, Организация),
		НаДату);
		
	Возврат ?(ЗначениеЗаполнено(СистемаНалогообложенияККТ), СистемаНалогообложенияККТ, Перечисления.СистемыНалогообложения.Общая);
	
КонецФункции // ПолучитьСистемуНалогообложенияККТ()

Функция ПолучитьСистемуНалогообложенияККТПоПодразделению(ПодразделениеКомпании, НаДату)
	
	ВидНалога = ПолучитьЗначениеУчетнойПолитики("ВидНалога", ПодразделениеКомпании, НаДату);
	Если НЕ ЗначениеЗаполнено(ВидНалога) Тогда
		ПодразделениеКомпанииРодитель = ПодразделениеКомпании.Родитель;
		Пока НЕ ЗначениеЗаполнено(ВидНалога) И ЗначениеЗаполнено(ПодразделениеКомпанииРодитель) Цикл
			ВидНалога = ПолучитьЗначениеУчетнойПолитики("ВидНалога", ПодразделениеКомпанииРодитель, НаДату);
			ПодразделениеКомпанииРодитель = ПодразделениеКомпанииРодитель.Родитель;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ?(НЕ ЗначениеЗаполнено(ВидНалога), Неопределено, ПолучитьСистемуНалогообложенияККТПоВидуНалога(ВидНалога));
	
КонецФункции // ПолучитьСистемуНалогообложенияККТПоПодразделению()

Функция ПолучитьСистемуНалогообложенияККТПоОрганизации(Организация, НаДату)
	
	ВидНалога = ПолучитьЗначениеУчетнойПолитики("ВидНалога", Организация, НаДату);
	
	Если ЗначениеЗаполнено(ВидНалога) Тогда
		Результат = ПолучитьСистемуНалогообложенияККТПоВидуНалога(ВидНалога);
		Если ЗначениеЗаполнено(Результат) Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	СистемаНалогообложения = ПолучитьЗначениеУчетнойПолитики("СистемаНалогообложения", Организация, НаДату);
	
	Если СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
		
		ОбъектНалогообложения = ПолучитьЗначениеУчетнойПолитики("ОбъектНалогообложения", Организация, НаДату);
		
		Если ОбъектНалогообложения = Перечисления.ВидыОбъектовНалогообложения.ДоходыМинусРасходы Тогда
			Возврат Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход;
		Иначе
			Возврат Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
	
	
КонецФункции // ПолучитьСистемуНалогообложенияККТПоПодразделению()

Функция ПолучитьСистемуНалогообложенияККТПоВидуНалога(ВидНалога)
	
	Если ВидНалога = Перечисления.ВидыНалогов.ЕНВД Тогда
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД;
	ИначеЕсли ВидНалога = Перечисления.ВидыНалогов.ЕСХН Тогда
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.ЕСН;
	ИначеЕсли ВидНалога = Перечисления.ВидыНалогов.ПСН Тогда
		Возврат Перечисления.ТипыСистемНалогообложенияККТ.Патент;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьСистемуНалогообложенияККТПоВидуНалога()


