&НаКлиенте
Перем COMОбъектSQL;

&НаСервереБезКонтекста
Функция ПолучитьНастройкуПодключенияНаСервереБезКонтекста(НастройкаПодключенияTPI)
                СтруктураДляВозврата = Новый Структура();
                СтруктураДляВозврата.Вставить("Сервер", НастройкаПодключенияTPI.Сервер);
                СтруктураДляВозврата.Вставить("БазаДанных", НастройкаПодключенияTPI.БазаДанных);
                СтруктураДляВозврата.Вставить("Пользователь", НастройкаПодключенияTPI.Пользователь);
                СтруктураДляВозврата.Вставить("Пароль", НастройкаПодключенияTPI.Пароль);
                
                Возврат(СтруктураДляВозврата);
КонецФункции               

&НаКлиенте
Функция ПодключитьсяКTPI()
                Если НЕ Подключено Тогда
                               Подключено = ИСТИНА;
                               
                               СтруктураПодключения = ПолучитьНастройкуПодключенияНаСервереБезКонтекста(Объект.НастройкаПодключенияTPI);
                               
                               COMОбъектSQL = Неопределено;
                               Попытка
                                               COMОбъектSQL = Новый COMОбъект("ADODB.Connection");
                                               
                                               COMОбъектSQL.ConnectionTimeOut = 20; // по умолчанию
                                               COMОбъектSQL.CommandTimeOut = 0; 
                                               COMОбъектSQL.ConnectionString = "Provider=SQLOLEDB; SERVER=" +СтруктураПодключения.Сервер
                                                               + "; Database="+ СтруктураПодключения.БазаДанных
                                                               + "; UID=" + СокрЛП(СтруктураПодключения.Пользователь) 
                                                               + "; PWD=" + СокрЛП(СтруктураПодключения.Пароль) + ";";  
                                               COMОбъектSQL.Open();   
                                               Если COMОбъектSQL.State() = 0 Тогда 
                                                               ТекстСообщения = НСтр("ru = 'Не удалось подключиться к SQL.'");
                                                               ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
                                                               Подключено = ЛОЖЬ;
                                               КонецЕсли;
                               Исключение
                                               COMОбъектSQL = Неопределено;
                                               ТекстСообщения = НСтр("ru = 'Не удалось подключиться к SQL.'");
                                               ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
                                               Подключено = ЛОЖЬ;
                               КонецПопытки;
                КонецЕсли;
                
                Возврат(Подключено);
КонецФункции

&НаКлиенте
Процедура ПроверитьПодключениеКТаблице(Команда)
                Если НЕ ЗначениеЗаполнено(Объект.НастройкаПодключенияTPI) Тогда
                               ТекстСообщения = НСтр("ru = 'Не указана настрока подключения TPI.'");
                               ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
                ИначеЕсли НЕ ЗначениеЗаполнено(Объект.НаименованиеТаблицыTPI) Тогда
                               ТекстСообщения = НСтр("ru = 'Не указано наименование таблицы TPI.'");
                               ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
                Иначе
                               СтруктураПодключения = ПолучитьНастройкуПодключенияНаСервереБезКонтекста(Объект.НастройкаПодключенияTPI);
                               
                               ПодключитьсяКTPI();
                               
                               Если Подключено Тогда
                                               Попытка
                                                               ТекстЗапроса = "SELECT 1 FROM " + Объект.НаименованиеТаблицыTPI + " WHERE 1 = 0";
                                                               COMЗапросSQL = Новый COMОбъект("ADODB.RecordSet"); 
                                                               COMЗапросSQL.Open(ТекстЗапроса, COMОбъектSQL); 
                                                               
                                                               ТекстСообщения = НСтр("ru = 'Таблица " + Объект.НаименованиеТаблицыTPI + " найдена!'");
                                                               ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
                                                               
                                               Исключение
                                                               ТекстСообщения = НСтр("ru = 'Таблица " + Объект.НаименованиеТаблицыTPI + "не найдена!'");
                                                               ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
                                               КонецПопытки;
                               КонецЕсли;
                КонецЕсли;       
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименованияПолейTPI(Команда)
                Если НЕ ЗначениеЗаполнено(Объект.НастройкаПодключенияTPI) Тогда
                               ТекстСообщения = НСтр("ru = 'Не указана настрока подключения TPI.'");
                               ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
                ИначеЕсли НЕ ЗначениеЗаполнено(Объект.НаименованиеТаблицыTPI) Тогда
                               ТекстСообщения = НСтр("ru = 'Не указано наименование таблицы TPI.'");
                               ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
                Иначе
                               СтруктураПодключения = ПолучитьНастройкуПодключенияНаСервереБезКонтекста(Объект.НастройкаПодключенияTPI);
                               
                               ПодключитьсяКTPI();
                               
                               Если Подключено Тогда
                                               Попытка
                                                               ТекстЗапроса = "SELECT * FROM " + Объект.НаименованиеТаблицыTPI + " WHERE 1 = 0";
                                                               COMЗапросSQL = Новый COMОбъект("ADODB.RecordSet"); 
                                                               COMЗапросSQL.Open(ТекстЗапроса, COMОбъектSQL); 
                                                               
                                                   сч = 0;
                                                               Пока сч <> COMЗапросSQL.Fields.Count Цикл
                                                                              ТекущееНаименованиеПоля = COMЗапросSQL.Fields(сч).Name;
                                                                              
                                                                              ПараметрыОтбора = Новый Структура();
                                                                              ПараметрыОтбора.Вставить("НаименованиеПоляTPI", ТекущееНаименованиеПоля);
                                                                              НайденныеСтроки = Объект.Маппинг.НайтиСтроки(ПараметрыОтбора);
                                                                              Если НайденныеСтроки.Количество() = 0 Тогда
                                                                                              НоваяСтрока = Объект.Маппинг.Добавить();
                                                                                              НоваяСтрока.НаименованиеПоляTPI = ТекущееНаименованиеПоля;
                                                                                              НоваяСтрока.ПорядокЗагрузки = 1;
                                                                                              НоваяСтрока.Пометка = ИСТИНА;
                                                                              КонецЕсли;       
                                                                              
                                                                              сч = сч + 1;
                                                               КонецЦикла;
                                                                                                     
                                               Исключение
                                                               ТекстСообщения = НСтр("ru = 'Таблица " + Объект.НаименованиеТаблицыTPI + "не найдена!'");
                                                               ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
                                               КонецПопытки;
                               КонецЕсли;
                КонецЕсли;       
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьСписокВыбораРеквизитовСправочникаНаСервере(ТипМетаданныхСправочника, ЭтоПВХ = Ложь)
	
	//Галюжин_2018-06-06_10-08 НАЧАЛО, добавлен параметр функции ЭтоПВХ 
	
	Если ЭтоПВХ Тогда
		МетаданныеОбъекта = Метаданные.ПланыВидовХарактеристик[ТипМетаданныхСправочника];
	Иначе
		МетаданныеОбъекта = Метаданные.Справочники[ТипМетаданныхСправочника];
	КонецЕсли;
	
	//Галюжин_2018-06-06_10-08 КОНЕЦ Ниже  Метаданные.Справочники заменено на МатаданныеОбъекта
	
	СписокВыбораЭлемента = Новый СписокЗначений();	                
	СписокВыбораЭлемента.Очистить();
	
	Для Каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		СписокВыбораЭлемента.Добавить(Реквизит.Имя);    
	КонецЦикла; 
	
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		СписокВыбораЭлемента.Добавить(Реквизит.Имя);    
	КонецЦикла; 
                
	Возврат(СписокВыбораЭлемента);
	
КонецФункции

&НаКлиенте
Процедура МаппингИмяРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
                
	Если ПроверитьСуществованиеСправочника(Объект.ТипМетаданныхСправочника, Объект.mr_ЭтоПВХ) Тогда
		
		СписокВыбораЭлемента = СформироватьСписокВыбораРеквизитовСправочникаНаСервере(Объект.ТипМетаданныхСправочника, Объект.mr_ЭтоПВХ);
                               
		Элемент.СписокВыбора.Очистить();
		Для Каждого Знч Из СписокВыбораЭлемента Цикл
			Элемент.СписокВыбора.Добавить(Знч.Значение);
		КонецЦикла;   

		СтандартнаяОбработка = Ложь;

		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("Элемент", Элемент);
		
		//Галюжин_2018-06-06_11-42 НАЧАЛО Вместо немодального вызова "ВыбратьИзСписка"
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораИзСписка", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВыборИзСписка(ОписаниеОповещения, Элемент.СписокВыбора, Элемент);
		//Галюжин_2018-06-06_11-45 КОНЕЦ
	Иначе
		ТекстСообщения = НСтр("ru = 'Не удалось идентифицировать справочник """ + Объект.ТипМетаданныхСправочника + """!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);

		Элемент.СписокВыбора.Очистить();
	КонецЕсли;
	
КонецПроцедуры

//Галюжин_2018-06-06_11-42 НАЧАЛО Добавлено для немодального вызоват вместо "ВыбратьИзСписка" в МаппингИмяРеквизитаНачалоВыбора 
&НаКлиенте
Процедура ОбработкаВыбораИзСписка(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	ВыбранноеЗначение = Строка(ВыбранноеЗначение.Значение);
	Если ВыбранноеЗначение <> "" Тогда
		Элементы.Маппинг.ТекущиеДанные.ИмяРеквизита = ВыбранноеЗначение;
	КонецЕсли;       
	
КонецПроцедуры
//Галюжин_2018-06-06_11-42 КОНЕЦ

&НаСервереБезКонтекста
Функция ПроверитьСуществованиеСправочника(ТипМетаданныхСправочника, ЭтоПВХ = Ложь)

	Возврат(Метаданные.НайтиПоПолномуИмени(?(ЭтоПВХ, "ПланВидовХарактеристик.", "Справочник.") + ТипМетаданныхСправочника) <> Неопределено);

КонецФункции               

&НаКлиенте
Процедура МаппингИмяРеквизитаПриИзменении(Элемент)
	Элемент.СписокВыбора.Очистить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);

КонецПроцедуры
