// @strict-types

#Область СлужебныеПроцедурыИФункции

#Область АсинхроннаяОперация

// Проверяет выполнение асинхронных операций в фоне.
// 
// Параметры:
//  АдресаРесурсовПоУчетнымЗаписям - Соответствие из КлючИЗначение:
//  * Ключ - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  * Значение - Строка
//  
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
//
Функция ПроверитьВыполнениеАсинхронныхОперацииВФоне(Знач АдресаРесурсовПоУчетнымЗаписям) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	
	ПараметрыПроверокОпераций = Новый Массив; // Массив из см. ИнтеграцияЦентраЭДО.НовыеПараметрыПроверкиВыполненияАсинхроннойОперации
	
	Для Каждого АдресРесурсаПоУчетнойЗаписи Из АдресаРесурсовПоУчетнымЗаписям Цикл
		ПараметрыПроверки = ИнтеграцияЦентраЭДО.НовыеПараметрыПроверкиВыполненияАсинхроннойОперации();
		ПараметрыПроверки.УчетнаяЗаписьЦентраЭДО = АдресРесурсаПоУчетнойЗаписи.Ключ;
		ПараметрыПроверки.АдресРесурса = АдресРесурсаПоУчетнойЗаписи.Значение;
		ПараметрыПроверки.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
		ПараметрыПроверокОпераций.Добавить(ПараметрыПроверки);
	КонецЦикла;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"ИнтеграцияЦентраЭДО.ПроверитьВыполнениеАсинхронныхОпераций", ПараметрыПроверокОпераций);
	
КонецФункции

#КонецОбласти

#Область УчетныеЗаписиЦентраЭДО

// Параметры:
//  ПараметрыПользователя - См. ИнтеграцияЦентраЭДО.ПодключитьЦентрЭДО.ПараметрыПользователя
//  НовоеПодключение - Булево
// 
// Возвращаемое значение:
//  См. ИнтеграцияЦентраЭДО.ПодключитьЦентрЭДО
Функция ПодключитьЦентрЭДО(Знач ПараметрыПользователя, Знач НовоеПодключение) Экспорт
	
	Возврат ИнтеграцияЦентраЭДО.ПодключитьЦентрЭДО(ПараметрыПользователя, НовоеПодключение);
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  ПараметрыПользователя - См. ИнтеграцияЦентраЭДО.ПодключитьЦентрЭДО.ПараметрыПользователя
// 
// Возвращаемое значение:
//  См. ИнтеграцияЦентраЭДО.ПодключитьПользователяЦентраЭДО
Функция ПодключитьПользователяЦентраЭДО(Знач УчетнаяЗапись, Знач ПараметрыПользователя) Экспорт
	
	Возврат ИнтеграцияЦентраЭДО.ПодключитьПользователяЦентраЭДО(УчетнаяЗапись, ПараметрыПользователя);
	
КонецФункции

#КонецОбласти

#КонецОбласти
