// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПолучитьТранспортныеКонтейнерыВРежимеПерехода() Экспорт
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	ИдентификаторыЭДОВРежимеПерехода = УчетныеЗаписиЭДО.УчетныеЗаписиВРежимеПереходаВЦентрЭДО();
	
	ИдентификаторыЭДОПоУчетнымЗаписямЦентровЭДО =
		РегистрыСведений.НастройкиИнтеграцииЦентраЭДО.СгруппироватьПоУчетнымЗаписям(ИдентификаторыЭДОВРежимеПерехода);
	
	Для Каждого ИдентификаторыЭДОПоУчетнойЗаписиЦентраЭДО Из ИдентификаторыЭДОПоУчетнымЗаписямЦентровЭДО Цикл
		
		УчетнаяЗаписьЦентраЭДО = ИдентификаторыЭДОПоУчетнойЗаписиЦентраЭДО.Ключ;
		ИдентификаторыЭДО = ИдентификаторыЭДОПоУчетнойЗаписиЦентраЭДО.Значение;
		
		ПолучитьТранспортныеКонтейнерыПоУчетнойЗаписиЦентраЭДО(УчетнаяЗаписьЦентраЭДО, ИдентификаторыЭДО,
			КонтекстДиагностики);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  ИдентификаторыЭДО - Массив из Строка
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
Процедура ПолучитьТранспортныеКонтейнерыПоУчетнойЗаписиЦентраЭДО(УчетнаяЗаписьЦентраЭДО, ИдентификаторыЭДО,
	КонтекстДиагностики)
	
	Пока Истина Цикл
		
		ПорцияДанных = ПорцияМетокВремениТранспортныхКонтейнеровВРежимеПерехода(
			УчетнаяЗаписьЦентраЭДО, ИдентификаторыЭДО, КонтекстДиагностики);
		
		Если Не ЗначениеЗаполнено(ПорцияДанных) Тогда
			Прервать;
		КонецЕсли;
		
		РезультатПолучения = ПолучитьТранспортныеКонтейнерыПоМеткамВремени(
			УчетнаяЗаписьЦентраЭДО, ПорцияДанных.НаборДанных, КонтекстДиагностики);
		
		РегистрыСведений.СостоянияСинхронизацииСЦентромЭДО.ЗаписатьКоллекцию(
			Перечисления.ТипыСинхронизацииСЦентромЭДО.ТранспортныеКонтейнерыЭДО,
			РезультатПолучения.МеткиВремениПоИдентификаторамЭДО, КонтекстДиагностики);
		
		РаспаковатьТранспортныеКонтейнеры(РезультатПолучения.ТранспортныеКонтейнеры,
			РезультатПолучения.СвойстваПодписейКонтейнеров);
		
		Если ПорцияДанных.ЭтоПоследний
			Или ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(КонтекстДиагностики) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  ИдентификаторыЭДО - Массив из Строка
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// 
// Возвращаемое значение:
//  Структура:
//  * ЭтоПоследний - Булево
//  * НаборДанных - Массив из Структура:
//    ** МеткаВремени - Число
//    ** ИдентификаторЭДО - Строка
//    ** ИдентификаторОбъекта - Строка
//    ** ВнешнийИдентификатор - Строка
Функция ПорцияМетокВремениТранспортныхКонтейнеровВРежимеПерехода(УчетнаяЗаписьЦентраЭДО, ИдентификаторыЭДО,
	КонтекстДиагностики)
	
	ТипСинхронизации = Перечисления.ТипыСинхронизацииСЦентромЭДО.ТранспортныеКонтейнерыЭДО;
	СостоянияСинхронизации = РегистрыСведений.СостоянияСинхронизацииСЦентромЭДО.Выгрузить(
		ИдентификаторыЭДО, ТипСинхронизации);
	МеткиВремениИдентификаторовЭДО =
		РегистрыСведений.СостоянияСинхронизацииСЦентромЭДО.МеткиВремениИдентификаторовЭДО(
			СостоянияСинхронизации, ТипСинхронизации, ИдентификаторыЭДО);
	
	ПараметрыВыполнения = ИнтеграцияЦентраЭДОПовтИсп.ПараметрыВыполненияМетодаСервиса(УчетнаяЗаписьЦентраЭДО,
		Пользователи.ТекущийПользователь());
	
	ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса(
		"ПорцияМетокВремениТранспортныхКонтейнеровВРежимеПерехода", МеткиВремениИдентификаторовЭДО);
	
	ПорцияДанных = ИнтеграцияЦентраЭДО.ВыполнитьМетодСервиса(ПараметрыВыполнения, ОписаниеМетода,
		КонтекстДиагностики);
	
	Возврат ПорцияДанных;
	
КонецФункции

// Параметры:
//  УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  МеткиВремениКонтейнеров - Массив из Структура:
//  * МеткаВремени - Число
//  * ИдентификаторЭДО - Строка
//  * ИдентификаторОбъекта - Строка
//  * ВнешнийИдентификатор - Строка
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// 
// Возвращаемое значение:
//  Структура:
//  * ТранспортныеКонтейнеры - Массив из ДокументСсылка.ТранспортныйКонтейнерЭДО
//  * СвойстваПодписейКонтейнеров - Соответствие из КлючИЗначение:
//    ** Ключ - см. КриптографияБЭД.ХешПодписи
//    ** Значение - Массив из см. НовыеСвойстваПодписиКонтейнера
//  * МеткиВремениПоИдентификаторамЭДО - Соответствие из КлючИЗначение:
//    ** Ключ - Строка - идентификатор ЭДО.
//    ** Значение - Число - метка времени.
Функция ПолучитьТранспортныеКонтейнерыПоМеткамВремени(УчетнаяЗаписьЦентраЭДО,
	МеткиВремениКонтейнеров, КонтекстДиагностики)
	
	ТранспортныеКонтейнеры = Новый Массив; // Массив из ДокументСсылка.ТранспортныйКонтейнерЭДО
	СвойстваПодписейКонтейнеров = Новый Соответствие;
	МеткиВремениПоИдентификаторамЭДО = Новый Соответствие;
	
	Результат = Новый Структура;
	Результат.Вставить("ТранспортныеКонтейнеры", ТранспортныеКонтейнеры);
	Результат.Вставить("СвойстваПодписейКонтейнеров", СвойстваПодписейКонтейнеров);
	Результат.Вставить("МеткиВремениПоИдентификаторамЭДО", МеткиВремениПоИдентификаторамЭДО);
	
	//@skip-check invocation-parameter-type-intersect
	ВнешниеИдентификаторы = ОбщегоНазначения.ВыгрузитьКолонку(МеткиВремениКонтейнеров, "ВнешнийИдентификатор"); // Массив из Строка
	ЗагруженныеКонтейнеры = ВходящиеТранспортныеКонтейнерыПоИдентификаторам(ВнешниеИдентификаторы);
	
	Для Каждого МеткаВремениКонтейнера Из МеткиВремениКонтейнеров Цикл
		
		Если ЗагруженныеКонтейнеры[МеткаВремениКонтейнера.ВнешнийИдентификатор] = Неопределено Тогда
			
			РезультатПолучения = ПолучитьТранспортныйКонтейнер(УчетнаяЗаписьЦентраЭДО,
				МеткаВремениКонтейнера.ИдентификаторОбъекта, КонтекстДиагностики);
			
			Если Не ЗначениеЗаполнено(РезультатПолучения.ТранспортныйКонтейнер) Тогда
				Прервать;
			КонецЕсли;
			
			ТранспортныеКонтейнеры.Добавить(РезультатПолучения.ТранспортныйКонтейнер);
			
			Для Каждого СвойстваПодписи Из РезультатПолучения.СвойстваПодписей Цикл
				СвойстваПодписейКонтейнеров.Вставить(СвойстваПодписи.ХешПодписи, СвойстваПодписи);
			КонецЦикла;
			
		КонецЕсли;
		
		МеткаВремени = МеткиВремениПоИдентификаторамЭДО[МеткаВремениКонтейнера.ИдентификаторЭДО];
		Если МеткаВремени = Неопределено
			Или МеткаВремени < МеткаВремениКонтейнера.МеткаВремени Тогда
			МеткиВремениПоИдентификаторамЭДО.Вставить(МеткаВремениКонтейнера.ИдентификаторЭДО,
				МеткаВремениКонтейнера.МеткаВремени);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ВнешниеИдентификаторы - Массив из Строка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка
//  * Значение - ДокументСсылка.ТранспортныйКонтейнерЭДО
Функция ВходящиеТранспортныеКонтейнерыПоИдентификаторам(ВнешниеИдентификаторы) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТранспортныйКонтейнерЭДО.Ссылка КАК Ссылка,
		|	ТранспортныйКонтейнерЭДО.ВнешнийУИД КАК ВнешнийУИД
		|ИЗ
		|	Документ.ТранспортныйКонтейнерЭДО КАК ТранспортныйКонтейнерЭДО
		|ГДЕ
		|	ТранспортныйКонтейнерЭДО.Направление = ЗНАЧЕНИЕ(Перечисление.НаправленияЭДО.Входящий)
		|	И ТранспортныйКонтейнерЭДО.ВнешнийУИД В (&ВнешниеИдентификаторы)";
	
	Запрос.УстановитьПараметр("ВнешниеИдентификаторы", ВнешниеИдентификаторы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ВнешнийУИД, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  ИдентификаторОбъекта - Строка
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// 
// Возвращаемое значение:
//  Структура:
//  * ТранспортныйКонтейнер - ДокументСсылка.ТранспортныйКонтейнерЭДО
//  * СвойстваПодписей - Массив из см. НовыеСвойстваПодписиКонтейнера
Функция ПолучитьТранспортныйКонтейнер(УчетнаяЗаписьЦентраЭДО, ИдентификаторОбъекта, КонтекстДиагностики)
	
	Результат = Новый Структура;
	Результат.Вставить("ТранспортныйКонтейнер", Документы.ТранспортныйКонтейнерЭДО.ПустаяСсылка());
	Результат.Вставить("СвойстваПодписей", Новый Массив);
	
	ПараметрыВыполнения = ИнтеграцияЦентраЭДОПовтИсп.ПараметрыВыполненияМетодаСервиса(
		УчетнаяЗаписьЦентраЭДО, Пользователи.ТекущийПользователь());
	
	ОписаниеМетода = ИнтеграцияЦентраЭДО.ОписаниеМетодаСервиса(
		"ДанныеТранспортногоКонтейнераВРежимеПерехода", ИдентификаторОбъекта);
		
	ДанныеКонтейнераВФорматеСервиса = ИнтеграцияЦентраЭДО.ВыполнитьМетодСервиса(
		ПараметрыВыполнения, ОписаниеМетода, КонтекстДиагностики); // См. ДанныеТранспортногоКонтейнераИзФорматаСервиса.ДанныеКонтейнераВФорматеСервиса
	Если Не ЗначениеЗаполнено(ДанныеКонтейнераВФорматеСервиса) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДанныеКонтейнера = ДанныеТранспортногоКонтейнераИзФорматаСервиса(ДанныеКонтейнераВФорматеСервиса);
	
	ПараметрыКонтейнера = ТранспортныеКонтейнерыЭДО.ПараметрыКонтейнера(
		ДанныеКонтейнера.ИдентификаторДокументооборота,
		ДанныеКонтейнера.ВнешнийИдентификатор,
		ДанныеКонтейнера.ИдентификаторПакета,
		ДанныеКонтейнера.СпособОбмена,
		ДанныеКонтейнера.ИдентификаторУчетнойЗаписи,
		ДанныеКонтейнера.ВидСервисаЭДО);
	
	Результат.ТранспортныйКонтейнер = ТранспортныеКонтейнерыЭДО.СохранитьКонтейнерПоПараметрам(
		ПараметрыКонтейнера, ДанныеКонтейнера.Контейнер, КонтекстДиагностики);
	
	Результат.СвойстваПодписей = ДанныеКонтейнера.СвойстваПодписей;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ДанныеКонтейнераВФорматеСервиса - См. ПрограммныйИнтерфейсЦентраЭДОВерсия2.ДанныеТранспортногоКонтейнераВРежимеПерехода
// 
// Возвращаемое значение:
//  См. НовыеДанныеТранспортногоКонтейнера
Функция ДанныеТранспортногоКонтейнераИзФорматаСервиса(ДанныеКонтейнераВФорматеСервиса)
	
	ДанныеКонтейнера = НовыеДанныеТранспортногоКонтейнера();
	ДанныеКонтейнера.ВнешнийИдентификатор = ДанныеКонтейнераВФорматеСервиса.ВнешнийИдентификатор;
	ДанныеКонтейнера.ИдентификаторПакета = ДанныеКонтейнераВФорматеСервиса.ИдентификаторПакета;
	ДанныеКонтейнера.ИдентификаторДокументооборота = ДанныеКонтейнераВФорматеСервиса.ИдентификаторДокументооборота;
	ДанныеКонтейнера.ИдентификаторУчетнойЗаписи = ДанныеКонтейнераВФорматеСервиса.ИдентификаторУчетнойЗаписи;
	ДанныеКонтейнера.СпособОбмена = УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.СпособОбменаИзФорматаСервиса(
		ДанныеКонтейнераВФорматеСервиса.СпособОбмена);
	ДанныеКонтейнера.ВидСервисаЭДО = ВидСервисаЭДОИзФорматаСервиса(ДанныеКонтейнераВФорматеСервиса.ВидСервисаЭДО);
	ДанныеКонтейнера.Контейнер = Base64Значение(ДанныеКонтейнераВФорматеСервиса.Контейнер);
	
	Если Не ЗначениеЗаполнено(ДанныеКонтейнераВФорматеСервиса.СвойстваПодписей) Тогда
		Возврат ДанныеКонтейнера;
	КонецЕсли;
	
	СвойстваПодписей = ДанныеКонтейнера.СвойстваПодписей;
	Для Каждого СвойстваПодписиВФорматеСервиса Из ДанныеКонтейнераВФорматеСервиса.СвойстваПодписей Цикл
		СвойстваПодписи = НовыеСвойстваПодписиКонтейнера();
		СвойстваПодписи.ХешПодписи = СвойстваПодписиВФорматеСервиса.ХешПодписи;
		СвойстваПодписи.ПодписьВерна = СвойстваПодписиВФорматеСервиса.ПодписьВерна;
		Если ЗначениеЗаполнено(СвойстваПодписиВФорматеСервиса.Сертификат) Тогда
			СвойстваПодписи.Сертификат = Base64Значение(СвойстваПодписиВФорматеСервиса.Сертификат);
		КонецЕсли;
		Если ЗначениеЗаполнено(СвойстваПодписиВФорматеСервиса.ДатаПодписи) Тогда
			СвойстваПодписи.ДатаПодписи = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(
				СвойстваПодписиВФорматеСервиса.ДатаПодписи);
		КонецЕсли;
		Если ЗначениеЗаполнено(СвойстваПодписиВФорматеСервиса.ДатаПроверкиПодписи) Тогда
			СвойстваПодписи.ДатаПроверкиПодписи = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(
				СвойстваПодписиВФорматеСервиса.ДатаПроверкиПодписи);
		КонецЕсли;
		Если ЗначениеЗаполнено(СвойстваПодписиВФорматеСервиса.ТипПодписи) Тогда
			СвойстваПодписи.ТипПодписи = ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ТипПодписиИзФорматаСервиса(
				СвойстваПодписиВФорматеСервиса.ТипПодписи);
		КонецЕсли;
		Если ЗначениеЗаполнено(СвойстваПодписиВФорматеСервиса.СрокДействияПоследнейМеткиВремени) Тогда
			СвойстваПодписи.СрокДействияПоследнейМеткиВремени = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(
				СвойстваПодписиВФорматеСервиса.СрокДействияПоследнейМеткиВремени);
		КонецЕсли;
		Если ЗначениеЗаполнено(СвойстваПодписиВФорматеСервиса.ДатаПодписиИзМетки) Тогда
			СвойстваПодписи.ДатаПодписиИзМетки = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(
				СвойстваПодписиВФорматеСервиса.ДатаПодписиИзМетки);
		КонецЕсли;
		СвойстваПодписей.Добавить(СвойстваПодписи);
	КонецЦикла;
	
	Возврат ДанныеКонтейнера;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ВнешнийИдентификатор - Строка
//  * ИдентификаторПакета - Строка
//  * ИдентификаторДокументооборота - Строка
//  * ИдентификаторУчетнойЗаписи - Строка
//  * СпособОбмена - ПеречислениеСсылка.СпособыОбменаЭД
//  * ВидСервисаЭДО - ПеречислениеСсылка.ВидыСервисовЭДО
//  * Контейнер - Неопределено,ДвоичныеДанные
//  * СвойстваПодписей - Массив из см. НовыеСвойстваПодписиКонтейнера
Функция НовыеДанныеТранспортногоКонтейнера()
	
	ДанныеКонтейнера = Новый Структура;
	ДанныеКонтейнера.Вставить("ВнешнийИдентификатор", "");
	ДанныеКонтейнера.Вставить("ИдентификаторПакета", "");
	ДанныеКонтейнера.Вставить("ИдентификаторДокументооборота", "");
	ДанныеКонтейнера.Вставить("ИдентификаторУчетнойЗаписи", "");
	ДанныеКонтейнера.Вставить("СпособОбмена", Перечисления.СпособыОбменаЭД.ПустаяСсылка());
	ДанныеКонтейнера.Вставить("ВидСервисаЭДО", Перечисления.ВидыСервисовЭДО.ПустаяСсылка());
	ДанныеКонтейнера.Вставить("Контейнер", Неопределено);
	ДанныеКонтейнера.Вставить("СвойстваПодписей", Новый Массив);
	Возврат ДанныеКонтейнера;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ХешПодписи - Строка
//  * Сертификат - Неопределено,ДвоичныеДанные
//  * ДатаПодписи - Дата
//  * ПодписьВерна - Булево
//  * ДатаПроверкиПодписи - Дата
//  * ТипПодписи - ПеречислениеСсылка.ТипыПодписиКриптографии
//  * СрокДействияПоследнейМеткиВремени - Дата
//  * ДатаПодписиИзМетки - Дата
Функция НовыеСвойстваПодписиКонтейнера()
	
	Свойства = Новый Структура;
	Свойства.Вставить("ХешПодписи", "");
	Свойства.Вставить("Сертификат", Неопределено);
	Свойства.Вставить("ДатаПодписи", '00010101');
	Свойства.Вставить("ПодписьВерна", Ложь);
	Свойства.Вставить("ДатаПроверкиПодписи", '00010101');
	Свойства.Вставить("ТипПодписи", Перечисления.ТипыПодписиКриптографии.ПустаяСсылка());
	Свойства.Вставить("СрокДействияПоследнейМеткиВремени", '00010101');
	Свойства.Вставить("ДатаПодписиИзМетки", '00010101');
	Возврат Свойства;
	
КонецФункции

// Параметры:
//  ВидСервисаЭДОВФорматаСервиса - Строка
//  МетаданныеПеречисления - ОбъектМетаданныхПеречисление
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыСервисовЭДО
Функция ВидСервисаЭДОИзФорматаСервиса(ВидСервисаЭДОВФорматаСервиса, МетаданныеПеречисления = Неопределено)
	
	Если Не ЗначениеЗаполнено(ВидСервисаЭДОВФорматаСервиса) Тогда
		Возврат Перечисления.ВидыСервисовЭДО.ПустаяСсылка();
	КонецЕсли;
	Если МетаданныеПеречисления = Неопределено Тогда
		МетаданныеПеречисления = Метаданные.Перечисления.ВидыСервисовЭДО;
	КонецЕсли;
	Возврат ОбщегоНазначенияБЭД.ЗначениеПеречисленияПоИмени(ВидСервисаЭДОВФорматаСервиса, МетаданныеПеречисления);
	
КонецФункции

// Параметры:
//  ТранспортныеКонтейнеры - Массив из ДокументСсылка.ТранспортныйКонтейнерЭДО
//  СвойстваПодписейКонтейнеров - Соответствие из КлючИЗначение:
//  * Ключ - Строка
//  * Значение - см. НовыеСвойстваПодписиКонтейнера
Процедура РаспаковатьТранспортныеКонтейнеры(ТранспортныеКонтейнеры, СвойстваПодписейКонтейнеров)
	
	ПараметрыВыполнения = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполнения.ОбъектыДействий.ТранспортныеКонтейнеры = ТранспортныеКонтейнеры;
	ЭлектронныеДокументыЭДОКлиентСервер.ДобавитьДействие(ПараметрыВыполнения.НаборДействий,
		Перечисления.ДействияПоЭДО.Загрузить);
	
	РезультатДействий = ЭлектронныеДокументыЭДОСлужебный.ВыполнитьДействияЭДО(ПараметрыВыполнения);
	Если Не ЗначениеЗаполнено(РезультатДействий.ПараметрыПроверкиПодписей) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатОбработкиПроверкиПодписей = РезультатОбработкиПроверкиПодписей(
		РезультатДействий.ПараметрыПроверкиПодписей, СвойстваПодписейКонтейнеров);
	
	ПараметрыПродолжения = Новый Структура;
	ПараметрыПродолжения.Вставить("НаборДействий", ЭлектронныеДокументыЭДОКлиентСервер.НовыйНаборДействийПоЭДО());
	ПараметрыПродолжения.Вставить("РасшифрованныеМаркеры", Неопределено);
	ПараметрыПродолжения.Вставить("РезультатОбработкиПодписания", Неопределено);
	ПараметрыПродолжения.Вставить("РезультатОбработкиПроверкиПодписей", РезультатОбработкиПроверкиПодписей);
	
	ЭлектронныеДокументыЭДОСлужебный.ПродолжитьВыполнениеДействийЭДОПослеОбработкиРезультатов(
		ПараметрыПродолжения, ПараметрыВыполнения);
	
КонецПроцедуры

// Параметры:
//  ПараметрыПроверкиПодписей - см. ЭлектронныеДокументыЭДОСлужебный.ПараметрыПроверкиПодписейНаКлиенте
//  СвойстваПодписейКонтейнеров - см. РаспаковатьТранспортныеКонтейнеры.СвойстваПодписейКонтейнеров
// 
// Возвращаемое значение:
//  См. НовыйРезультатОбработкиПроверкиПодписей
Функция РезультатОбработкиПроверкиПодписей(ПараметрыПроверкиПодписей, СвойстваПодписейКонтейнеров)
	
	Результат = НовыйРезультатОбработкиПроверкиПодписей();
	Результат.КонтекстПроверкиПодписей = ПараметрыПроверкиПодписей.КонтекстНаСервере;
	
	ПроверенныеПодписиКонтейнеров = Результат.ПроверенныеПодписи;
	Для Каждого ПодписьДляПроверки Из ПараметрыПроверкиПодписей.ПодписиДляПроверки Цикл
		
		ХешПодписи = КриптографияБЭД.ХешПодписи(ПодписьДляПроверки.ДвоичныеДанныеПодписи);
		СвойстваПодписи = СвойстваПодписейКонтейнеров[ХешПодписи];
		Если СвойстваПодписи = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПроверенныеПодписиКонтейнера = ПроверенныеПодписиКонтейнеров[ПодписьДляПроверки.ИдентификаторДанныхДокумента];
		Если ПроверенныеПодписиКонтейнера = Неопределено Тогда
			ПроверенныеПодписиКонтейнера = Новый Структура;
			ПроверенныеПодписиКонтейнера.Вставить("ПодписиОсновныхДанных", Новый Массив);
			ПроверенныеПодписиКонтейнера.Вставить("ПодписиДополнительныхДанных", Новый Массив);
			ПроверенныеПодписиКонтейнеров.Вставить(ПодписьДляПроверки.ИдентификаторДанныхДокумента,
				ПроверенныеПодписиКонтейнера);
		КонецЕсли;
		
		ПровереннаяПодпись = КриптографияБЭДКлиентСервер.НовыеСвойстваПодписи();
		ПровереннаяПодпись.Подпись = ПодписьДляПроверки.ДвоичныеДанныеПодписи;
		ПровереннаяПодпись.ПодписьВерна = СвойстваПодписи.ПодписьВерна;
		ПровереннаяПодпись.ТипПодписи = СвойстваПодписи.ТипПодписи;
		ПровереннаяПодпись.Сертификат = СвойстваПодписи.Сертификат;
		ПровереннаяПодпись.ДатаПодписи = СвойстваПодписи.ДатаПодписи;
		ПровереннаяПодпись.ДатаПодписиИзМетки = СвойстваПодписи.ДатаПодписиИзМетки;
		ПровереннаяПодпись.ДатаПроверкиПодписи = СвойстваПодписи.ДатаПроверкиПодписи;
		ПровереннаяПодпись.СрокДействияПоследнейМеткиВремени = СвойстваПодписи.СрокДействияПоследнейМеткиВремени;
		Если СвойстваПодписи.Сертификат <> Неопределено Тогда
			СвойстваСертификата = ЭлектроннаяПодпись.СвойстваСертификата(СвойстваПодписи.Сертификат);
			ПровереннаяПодпись.КомуВыданСертификат = СвойстваСертификата.КомуВыдан;
		КонецЕсли;
		
		Если ПодписьДляПроверки.ЭтоОсновныеДанные Тогда
			ПроверенныеПодписиКонтейнера.ПодписиОсновныхДанных.Добавить(ПровереннаяПодпись);
		Иначе
			ПроверенныеПодписиКонтейнера.ПодписиДополнительныхДанных.Добавить(ПровереннаяПодпись);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ПроверенныеПодписи - Соответствие из КлючИЗначение:
//    ** Ключ - Число - идентификатор данных документа
//    ** Значение - Структура:
//       *** ПодписиДополнительныхДанных - Массив из См. КриптографияБЭДКлиентСервер.НовыеСвойстваПодписи
//       *** ПодписиОсновныхДанных - Массив из См. КриптографияБЭДКлиентСервер.НовыеСвойстваПодписи
//  * КонтекстПроверкиПодписей - см. НовыйКонтекстПроверкиПодписей
Функция НовыйРезультатОбработкиПроверкиПодписей()
	Результат = Новый Структура;
	Результат.Вставить("ПроверенныеПодписи", Новый Соответствие);
	Результат.Вставить("КонтекстПроверкиПодписей", Новый Структура);
	Возврат Результат;
КонецФункции

#КонецОбласти
