
#Область СлужебныеПроцедурыИФункции


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НачатьВыполнениеЗапроса()
	
	РезультатОбмена = ЗапроситьНаСервере();
	
	ОбработатьРезультатОбмена(РезультатОбмена);
	
КонецПроцедуры

#КонецОбласти

#Область ВыполнениеЗаявокВЕТИС_API

&НаСервере
Функция ЗапроситьНаСервере()
	
	РезультатОбмена = ИнтеграцияВЕТИСВызовСервера.ПодготовитьЗапрос(ХозяйствующийСубъект, Предприятие, ВидОперации, ДанныеДляВыгрузки, УникальныйИдентификатор);
	
	Возврат РезультатОбмена;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатОбмена(РезультатОбмена)
	
	//Если РезультатОбмена.Ожидать <> Неопределено Тогда
	////	
	////	Для Каждого СтрокаТЧ Из РезультатОбмена.Изменения Цикл
	////		
	////		ИсходящееСообщение = СтрокаТЧ.ИсходящееСообщение;
	////		
	////		//НоваяСтрока = ИсходящиеСообщения.Добавить();
	////		//НоваяСтрока.ИсходящееСообщение = СтрокаТЧ.ИсходящееСообщение;
	////		
	////	КонецЦикла;
	////	
	////	//СформироватьТекстОжидание();
	////	
	//КонецЕсли;

	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияРезультатОбработкиЗаявки", ЭтотОбъект);
	
	
	//ИнтеграцияВЕТИСКлиент.ПродолжитьВыполнениеОбмена(ЭтотОбъект, , ОписаниеОповещения, Ложь, ОповещениеОПрогрессеВыполнения);
	//Задание = ЗаданиеПередатьЗаписиВФайлНаСервере();
	//
	//РезультатОбмена.ДлительнаяОперация = Задание;
	//
	ИнтеграцияВЕТИСКлиент.ОбработатьРезультатОбмена(РезультатОбмена, ЭтотОбъект,, ОписаниеОповещения, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьОбменОбработкаОжидания()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияРезультатОбработкиЗаявки", ЭтотОбъект);
	ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ПрогрессВыполненияЗаявки", ЭтотОбъект);
	
	ИнтеграцияВЕТИСКлиент.ПродолжитьВыполнениеОбмена(ЭтотОбъект,, ОписаниеОповещения, Ложь, ОповещениеОПрогрессеВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияРезультатОбработкиЗаявки(Изменения, ДополнительныеПараметры) Экспорт
	
	БезОшибок = Истина;
	Для Каждого ЭлементДанных Из Изменения Цикл
		Если ЭлементДанных.Принято Тогда
			Если ЗначениеЗаполнено(ЭлементДанных.ТекстОшибки) Тогда
				БезОшибок = Ложь;
				ВывестиСообщение(НСтр("ru = 'Сообщение %1 выполнено с ошибкой: %2'"),,,,, ЭлементДанных.ИсходящееСообщение, ЭлементДанных.ТекстОшибки);
			Иначе
				ВывестиСообщение(НСтр("ru = 'Сообщение %1 выполнено со статусом: %2'"),ВладелецФормы.УникальныйИдентификатор,,,, ЭлементДанных.ВидОперации, Строка(ЭлементДанных.НовыйСтатус));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ Открыта() Тогда
		Возврат;
	КонецЕсли;
	
	Если БезОшибок Тогда
		Закрыть();
	Иначе
		Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеЗавершеноСОшибкой;
		Элементы.ФормаЗапросить.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрогрессВыполненияЗаявки(Изменения, ДополнительныеПараметры) Экспорт
	
	БезОшибок = Истина;
	Для Каждого ЭлементДанных Из Изменения.Сообщения Цикл
		ВывестиСообщение(ЭлементДанных.Текст);
		//Если ЭлементДанных.Принято Тогда
		//	Если ЗначениеЗаполнено(ЭлементДанных.ТекстОшибки) Тогда
		//		БезОшибок = Ложь;
		//		ВывестиСообщение(НСтр("ru = 'Сообщение %1 выполнено с ошибкой: %2'"),,,,, ЭлементДанных.ИсходящееСообщение, ЭлементДанных.ТекстОшибки);
		//	Иначе
		//		ВывестиСообщение(НСтр("ru = 'Сообщение %1 выполнено со статусом: %2'"),ВладелецФормы.УникальныйИдентификатор,,,, ЭлементДанных.ВидОперации, Строка(ЭлементДанных.НовыйСтатус));
		//	КонецЕсли;
		//КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(Изменения.Прогресс) = Тип("Структура") Тогда
		ТекущаяИтерация    = Изменения.Прогресс.ДополнительныеПараметры.ТекущаяИтерация;
		КоличествоИтераций = Изменения.Прогресс.ДополнительныеПараметры.КоличествоИтераций;
		ТекстИтераций = Формат(ТекущаяИтерация, "ЧН=0") + " из " + Формат(КоличествоИтераций, "ЧН=0");
		ТекущийПрогресс = Изменения.Прогресс.Процент;
	КонецЕсли;
		
	//
	//Если НЕ Открыта() Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если БезОшибок Тогда
	//	Закрыть();
	//Иначе
	//	Элементы.ФормаЗапросить.Доступность = Истина;
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеВыполняется;
	
	ДанныеДляВыгрузки    = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДанныеДляВыгрузки", Неопределено);
	ВидОперации          = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ВидОперации", Неопределено);
	ХозяйствующийСубъект = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ХозяйствующийСубъект", Неопределено);
	Предприятие          = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Предприятие", Неопределено);
	
	Если ТипЗнч(ДанныеДляВыгрузки) = Тип("Структура") Тогда
		//Элементы.ПараметрыЗапроса.Видимость = Истина;
		Для Каждого ТекущаяСтрока Из ДанныеДляВыгрузки Цикл
			НоваяСтрока = ПараметрыЗапроса.Добавить();
			НоваяСтрока.Имя      = ТекущаяСтрока.Ключ;
			НоваяСтрока.Значение = ТекущаяСтрока.Значение;
		КонецЦикла;
	Иначе
		//Элементы.ПараметрыЗапроса.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Если ГотовКОтправке() Тогда
	//Элементы.ФормаЗапросить.Доступность = Ложь;
	НачатьВыполнениеЗапроса();
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

