
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УИД = Новый УникальныйИдентификатор;
		Объект.GUID = Строка(УИД);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокВызываемыйМетод = Элементы.ВызываемыйМетод.СписокВыбора;
	СписокВызываемыйМетод.Добавить("NSIRecordEdit");
	СписокВызываемыйМетод.Добавить("NSIRecordEditXML");
КонецПроцедуры

&НаКлиенте
Процедура АдресОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Элемент.ТекстРедактирования);
КонецПроцедуры

&НаКлиенте
Процедура ФорматОбменаПриИзменении(Элемент)
	Если Объект.ФорматОбмена = ПредопределенноеЗначение("Перечисление.НСИФорматыОбмена.XDTO") Тогда 
		Объект.ВызываемыйМетод = "NSIRecordEdit";
	ИначеЕсли Объект.ФорматОбмена = ПредопределенноеЗначение("Перечисление.НСИФорматыОбмена.XML") Тогда 
		Объект.ВызываемыйМетод = "NSIRecordEditXML";
	КонецЕсли;	
КонецПроцедуры
