
&НаКлиенте
Процедура КомандаУстановитьЛимит(Команда)
	ПередаваемыеПараметры = Новый Структура;
	Магазин = ПолучитьОтборКомпоновкиДанных("Магазин");
	Если Магазин <> Неопределено Тогда 
		ПередаваемыеПараметры.Вставить("Магазин",Магазин);	
	КонецЕсли;
	ОткрытьФорму("Документ.ит_УстановкаЛимитаНаличныхДенегВМагазине.ФормаОбъекта",ПередаваемыеПараметры);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОтборКомпоновкиДанных(ЛевоеЗначение)
	Рез = Неопределено;
	ОтборКомпановки = ЭтаФорма.Список.Отбор;
	Для каждого ТЭлемент  Из ОтборКомпановки.Элементы Цикл
		Если ТЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ЛевоеЗначение) Тогда 
			Рез = ТЭлемент.ПравоеЗначение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Рез;
КонецФункции
