
Функция ОпределитьСпособОплатыПоИмени(ИмяСпособаОплаты) Экспорт 
	
	КлючСпособаОплаты = СокрЛП(ИмяСпособаОплаты);
	КлючСпособаОплаты = СтрЗаменить(КлючСпособаОплаты, " ", "");
	КлючСпособаОплаты = ВРег(КлючСпособаОплаты);
	
	// Возврат
	Возврат ОпределитьСпособОплатыПоКлючу(КлючСпособаОплаты, ИмяСпособаОплаты);
	
КонецФункции 

Функция ОпределитьСпособОплатыПоКлючу(КлючСпособаОплаты, ИмяСпособаОплаты = "") Экспорт 
	
	Если ПустаяСтрока(КлючСпособаОплаты) Тогда 
		Возврат Справочники.ИТ_СпособыОплатыИнтернетЗаказов.ПустаяСсылка();
	КонецЕсли;	
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_СпособыОплатыИнтернетЗаказов.Ссылка КАК СпособОплаты
		|ИЗ
		|	Справочник.ИТ_СпособыОплатыИнтернетЗаказов КАК ИТ_СпособыОплатыИнтернетЗаказов
		|ГДЕ
		|	ИТ_СпособыОплатыИнтернетЗаказов.Ключ = &Ключ";
	
	Запрос.УстановитьПараметр("Ключ", СокрЛП(КлючСпособаОплаты));
	
	РезультатЗапроса	= Запрос.Выполнить();
	ВыборкаДанных		= РезультатЗапроса.Выбрать();
	
	Если ВыборкаДанных.Следующий() Тогда 
		Возврат ВыборкаДанных.СпособОплаты;	
	Иначе
		НовыйСпособОплаты = Справочники.ИТ_СпособыОплатыИнтернетЗаказов.СоздатьЭлемент();
		НовыйСпособОплаты.Наименование	= ?(ПустаяСтрока(ИмяСпособаОплаты), КлючСпособаОплаты, ИмяСпособаОплаты);
		НовыйСпособОплаты.Ключ			= КлючСпособаОплаты;
		НовыйСпособОплаты.Записать();
		
		Возврат НовыйСпособОплаты.Ссылка;
	КонецЕсли;	
	
КонецФункции	