// Общий модуль "Управление диалогом документа (клиент)"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Общий обработчик события выбора одного из пунктов меню доступных хоз. операций
// 
// Параметры:
//  Форма             - УправляемаяФорма          - Форма, в которой возникло событие.
//  Команда           - КомандаФормы              - Команда, в которой возникло данное событие.
//  Объект            - ДанныеФормыСтруктура      - Объект, для которого выполняется обработка события.
//  Окно              - ОкноКлиентскогоПриложения - Содержит окно, в котором требуется открыть форму.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
Функция ОбработкаКомандыФормы(Форма, Команда, Объект, Окно=Неопределено, ПараметрыДействия=Неопределено) Экспорт
	
	ПараметрыЗаписиНового = ЗащищенныеФункцииКлиент.СоздатьПараметрыЗаписиНовогоОбъектаНаКлиенте();
	ПараметрыЗаписиНового.ОбновитьИзмененный = Истина;
	ПараметрыЗаписиНового.ПровестиДокумент   = Истина;
	ПараметрыЗаписиНового.РезультатСобытия   = Команда;

	// Обработаем в зависимости от выбранной команды
	Если Команда.Имя="НастроитьПараметрыДокумента" Тогда
		УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(Форма,Объект,ПараметрыДействия);
		
	ИначеЕсли Команда.Имя="ПисьмоВТехПоддержку" Тогда
		
		ПараметрыФормы = Новый Структура("ТекущийОбъект", Объект.Ссылка);
		ОткрытьФорму("Обработка.Поддержка.Форма.ПолучениеИнформацииОСистеме", ПараметрыФормы,Форма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли Команда.Имя="РедактироватьСоставДополнительныхРеквизитов" Тогда
		УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(Форма, Объект.Ссылка);
		
	ИначеЕсли Команда.Имя="РазрешитьРедактированиеРеквизитовОбъекта" Тогда
		ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(Форма,Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", Форма, "РазрешитьРедактированиеРеквизитовОбъекта"));
		
	ИначеЕсли Команда.Имя="ПараметрыПечати" Тогда
		
		МассивДополнительныхРеквизитов = Новый Массив();
		Для каждого СтрокаСвойств Из Форма.Свойства_ОписаниеДополнительныхРеквизитов Цикл
			ДополнительныйРеквизит = Новый Структура("Свойство,Значение",СтрокаСвойств.Свойство,Форма[СтрокаСвойств.ИмяРеквизитаЗначение]);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныйРеквизит);
		КонецЦикла;
		
		ОткрытьФорму("ОбщаяФорма.ПараметрыПечати", Новый Структура("Объект,ОписаниеДополнительныхРеквизитов,ТолькоПросмотр", Объект, МассивДополнительныхРеквизитов, Форма.ТолькоПросмотр), Форма,,,, Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", Форма, "ПараметрыПечатиОбъект"));
		
	ИначеЕсли СтрНайти(Команда.Имя,"КомандаПечати") > 0 Тогда
		УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, Форма, Объект);
		
	ИначеЕсли СтрНайти(Команда.Имя,"НастройкаКомплекта") > 0 Тогда
		ОткрытьФорму("Справочник.НастройкаПечатиКомплекта.ФормаСписка", Новый Структура("Документ", Объект.Ссылка), Форма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ЛЕВ(Команда.Имя, 17)="КомандаЗаполнения" Тогда
		ЗаполнениеДокументовКлиент.ВыполнитьПодключаемуюКомандуЗаполнения(Форма, Команда.Имя, Объект, ПараметрыДействия);
		
	ИначеЕсли ЛЕВ(Команда.Имя, 40)="КомандаДополнительнойОбработкиЗаполнения" Тогда
		Возврат НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(Форма, Команда.Имя);
		
	ИначеЕсли ЛЕВ(Команда.Имя,20) = "КомандаАнкетирования" Тогда
		АнкетированиеПлатформаКлиент.ОткрытьАнкетуДляЗаполненияПоКонтрагенту(Форма,Команда.Имя);
		
	ИначеЕсли Команда.Имя="ОплатитьЧерезКассу" И ЗащищенныеФункцииКлиент.ЗаписатьНовыйОбъектНаКлиенте(Форма, ПараметрыЗаписиНового) Тогда
		
		// Для выполнения команды требуется провести документ
		Возврат ЛОЖЬ;
		
	ИначеЕсли СтрНачинаетсяС(Команда.Имя, "ДополнительнаяФорма") Тогда
		
		УправлениеДиалогомКлиент.ОткрытьДополнительнуюФормуОбъекта(Форма, Объект.Ссылка, Форма.ИмяДополнительнойФормы);
		
	Иначе
		
		ПараметрыЗаписиНового = ЗащищенныеФункцииКлиент.СоздатьПараметрыЗаписиНовогоОбъектаНаКлиенте();
		ПараметрыЗаписиНового.ОбновитьИзмененный = Истина;
		ПараметрыЗаписиНового.РезультатСобытия   = Команда;
		
		// Общие команды списка и объекта могут быть обработаны только в случае существования ссылки в базе на объект.
		Если ЗащищенныеФункцииКлиент.ЗаписатьНовыйОбъектНаКлиенте(Форма, ПараметрыЗаписиНового) Тогда
			Возврат ЛОЖЬ;
		КонецЕсли;
		
		// Обработаем текущую команду как команду списка
		Возврат УправлениеСпискомДокументаКлиент.ОбработкаКомандыФормы(Форма, Команда, Объект, Окно, ПараметрыДействия);
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ЛОЖЬ;
	
КонецФункции // ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Форма   - УправляемаяФорма - Форма, в которой возникло событие.
//  Элемент - ПолеФормы        - Элемент управления, в котором возникло данное событие.
//
Функция ПриИзмененииДополнительногоРеквизита(Форма, Элемент) Экспорт
	
	// Обработаем в зависимости от имени реквизита
	Если СтрНачинаетсяС(Элемент.Имя, "ДополнительныйРеквизитЗначение_") Тогда
		УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(Форма);
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ЛОЖЬ;
	
КонецФункции // ПриИзмененииДополнительногоРеквизита()

// Общий обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
Функция ОбработкаРезультатаОповещения(Форма, РезультатОповещения, ДополнительныеПараметры=Неопределено, Объект = Неопределено) Экспорт
	
	// Получим основной объект данных формы
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Проверяем статус закрытия окна параметров
	Если РезультатОповещения=Неопределено Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// Обработаем в зависимости от переданного параметра события.
	Если ДополнительныеПараметры="ВыборЭлементаРасширенныхИтоговОперации" Тогда
		
		Попытка
			
			// Создаем объект HTML документа и производим копирование значения в буфер обмена.
			ДокументHTML = Новый COMОбъект("HTMLFile");
			ДокументHTML.ParentWindow.ClipboardData.Setdata("Text", РезультатОповещения.Значение);
			
			// Информируем пользователя о произошедшем.
			ПоказатьОповещениеПользователя(НСтр("ru = 'Буфер обмена'"),, "Значение" + " " + РезультатОповещения.Значение + " " 
				+ НСтр("ru = 'скопировано в буфер обмена.'"), БиблиотекаКартинок.Информация32);
			
		Исключение
			ТехнологическаяПлатформаВызовСервера.СделатьЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при работе с COM-объектом'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		// Дальнейшая обработка события не нужна.
		Возврат ЛОЖЬ;
		
	ИначеЕсли ДополнительныеПараметры="РазрешенияДляПересчета" Тогда
		Возврат ОбработкаРеквизитовДокументаКлиент.ОбработкаПолученияРазрешенийДляПересчета(ЭтотОбъект, РезультатОповещения);
		
	ИначеЕсли ПолучитьЗначениеПараметраСтруктуры(ДополнительныеПараметры, "ИзменениеПодразделения", Ложь) Тогда
		
		НастроитьПараметрыДокумента(Форма);
		Возврат Ложь;
		
	Иначе
		
		// Вызываем общий обработчик действия.
		Возврат УправлениеДиалогомКлиент.ОбработкаРезультатаОповещения(Форма, РезультатОповещения, ДополнительныеПараметры, Объект);
		
	КонецЕсли;
	
КонецФункции // ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  Форма             - УправляемаяФорма - Форма, в которой возникло событие.
//  ПараметрыДействия - Структура        - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаРезультатаВыполненияДействия(Форма, ПараметрыДействия) Экспорт
	
	// Проверяем целесообразность выполнения дальнейших операций
	Если НЕ(ТипЗнч(ПараметрыДействия)=Тип("Структура") ИЛИ ТипЗнч(ПараметрыДействия)=Тип("ФиксированнаяСтруктура") ИЛИ ТипЗнч(ПараметрыДействия)=Тип("ДанныеФормыСтруктура")) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем в зависимости от параметров действия
	Если ПараметрыДействия.Свойство("ОбъектыПоШтрихкодуОбработатьВСписке") Тогда
		ШтрихкодированиеКлиент.ПоказатьОбъектВСписке(Форма, ПараметрыДействия);
		Возврат;
		
	ИначеЕсли ПараметрыДействия.Свойство("ОбъектыПоШтрихкодуОбработатьВФорме") Тогда
		ОткрытьФорму("РегистрСведений.Штрихкоды.Форма.ФормаВыбораОбъектаИзТаблицы", ПараметрыДействия, Форма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
		
	ИначеЕсли ПараметрыДействия.Свойство("ОбновитьНастройкиКоманднойПанели") Тогда
		ЗащищенныеФункцииКлиент.НастроитьКоманднуюПанельФормы(Форма)
		
	КонецЕсли;
	
	УправлениеДиалогомКлиент.ПоказатьРезультатВыполнения(Форма, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ФОРМЫ ДОКУМЕНТА

// Общий обработчик события выбора одного из пунктов меню доступных хоз. операций
// 
// Параметры:
//  Объект     - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Элемент    - ПолеФормы            - Элемент управления, в котором возникло данное событие.
//  ИмяКоманды - Строка               - Имя команды, в которой возникло данное событие.
//
Процедура ОбработатьВыборХозОперации(Объект, Элементы, ИмяКоманды) Экспорт
	
	Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации."+СтрЗаменить(ИмяКоманды, "ХозОперация", ""));
	
	Для каждого КнопкаОперации Из Элементы.ВыборХозОперации.ПодчиненныеЭлементы Цикл
		КнопкаОперации.Пометка = (КнопкаОперации.Имя=ИмяКоманды);
	КонецЦикла;
	
КонецПроцедуры // ОбработатьВыборХозОперации()

// Общий обработчик события возникающего при открытии настройки параметров документа.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
Процедура НастроитьПараметрыДокумента(Форма, Объект = Неопределено,ПараметрыДействия=Неопределено) Экспорт
	
	// Получим основной объект данных формы
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Формируем структуру параметров открытия вспомогательной формы
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Объект", Объект);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Форма.ТолькоПросмотр);
	ПараметрыФормы.Вставить("ИдентификаторФормы", Форма.УникальныйИдентификатор);
	
	// Проверим на клиенте, есть ли реквизит формы
	Если ЕстьРеквизитНаКлиенте(Объект, "ХозОперация") Тогда
		ПараметрыФормы.Вставить("Операция", Объект.ХозОперация);
	КонецЕсли;
	
	// Проверим на клиенте, есть ли реквизит формы
	Если ЕстьРеквизитНаКлиенте(Форма, "ПараметрыДокумента") Тогда
		ПараметрыФормы.Вставить("ПоказыватьПараметрыДокумента",Форма.Элементы.ПараметрыДокумента.Видимость);
	КонецЕсли;
	
	// Проверим на клиенте, есть ли реквизит формы
	Если ЕстьРеквизитНаКлиенте(Форма, "Штрихкод") Тогда
		ПараметрыФормы.Вставить("Штрихкод",Форма.Штрихкод);
	КонецЕсли;
	
	// параметры выбора документа основание на форме
	Если Форма.Элементы.Найти("ДокументОснование") <> Неопределено
		И Форма.Элементы.ДокументОснование.Вид = ВидПоляФормы.ПолеВвода Тогда
		
		ПараметрыФормы.Вставить("ПараметрыВыбораДокументаОснование",Форма.Элементы.ДокументОснование.ПараметрыВыбора);
		ПараметрыФормы.Вставить("ОграничениеТипаДокументаОснование",Форма.Элементы.ДокументОснование.ОграничениеТипа);
		
	КонецЕсли;
	
	// Переопределим параметры открытия при необходимости
	Если НЕ ПараметрыДействия = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормы,ПараметрыДействия);
	КонецЕсли;
	
	// Перенесем возможные дополнительные параметры
	ПараметрыФормы.Вставить("ДопПараметры",ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ДопПараметры", Неопределено));
	
	// Производим открытие формы параметров
	ОткрытьФорму("ОбщаяФорма.ПараметрыДокумента", ПараметрыФормы, Форма,,,, Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", Форма, "ПараметрыДокумента"));
	
КонецПроцедуры // НастроитьПараметрыДокумента()

// Общий обработчик события возникающего при нажатии на надпись "Налоговый документ".
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура НадписьНалоговыйДокументНажатие(Форма, Объект = Неопределено) Экспорт
	
	// Получим основной объект данных формы
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Получим вид счет фактуры
	Если Тип("ДокументСсылка.СчетФактураПолученный") = ТипЗнч(Форма.НалоговыйДокумент) Тогда
		ВидСФ = "СчетФактураПолученный";
	Иначе
		ВидСФ = "СчетФактураВыданный";
	КонецЕсли;
	
	// Определим параметры открытия формы
	ПараметрыОткрытия = Новый Структура;
	
	// счет-фактура найден, откроем его
	Если ЗначениеЗаполнено(Форма.НалоговыйДокумент)  Тогда
		
		ПараметрыОткрытия.Вставить("Ключ",Форма.НалоговыйДокумент);
		
	Иначе
		
		//Мальцев А.Ю. +++
		РазрешитьРучноеСозданиеДляДокЭДО   = ИТ_СпециальныйМодульСервер.ПроверитьПравоНаСервере("итРазрешитьСозданиеСФдляЭДО");
		//Мальцев А.Ю. ---

		// счет-фактура НЕ найден, введем новый
		//Конов +
		Если НЕ рздОбменЕРП.СостояниеДокументаЭДО(Объект.Ссылка) = Неопределено И РазрешитьРучноеСозданиеДляДокЭДО = Ложь Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для документа - " + Объект.Ссылка + " Счет-Фактура загружается по данным поставщика автоматически!";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;	
		//Конов - 
		ПараметрыОткрытия.Вставить("Основание",Объект.Ссылка);
		
	КонецЕсли;
		
	// откроем форму
	ОткрытьФорму("Документ."+ВидСФ+".ФормаОбъекта",ПараметрыОткрытия,Форма);
	
КонецПроцедуры // НадписьНалоговыйДокументНажатие()

// Общий обработчик события возникающего при нажатии на надпись "Взаиморасчеты".
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//  ИмяРеквизитаКонтрагента  - Строка, наименование реквизита "Контрагент" на форме, по умолчанию "Контрагент"
//  ИмяРеквизитаДоговора     - Строка, наименование реквизита "ДоговорВзаиморасчетов" на форме,
//                                     по умолчанию "ДоговорВзаиморасчетов".
//
Процедура НадписьВзаиморасчетыНажатие(Форма, ИмяРеквизитаКонтрагента="Контрагент", ИмяРеквизитаДоговора="ДоговорВзаиморасчетов", Объект = Неопределено) Экспорт
	
	// Получим основной объект данных формы
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Тогда
		Контрагент = Объект.Владелец;
		ДоговорВзаиморасчетов = Объект.Ссылка;
	Иначе
		Контрагент = Объект[ИмяРеквизитаКонтрагента];
		ДоговорВзаиморасчетов = Объект[ИмяРеквизитаДоговора];
	КонецЕсли;
	
	Если (Не ЗначениеЗаполнено(Контрагент)) Или (Не ЗначениеЗаполнено(ДоговорВзаиморасчетов)) Тогда
		Возврат;
	КонецЕсли;
	
	// фильтры
	Отбор = Новый Структура;
	Отбор.Вставить("Контрагент",            Контрагент);
	Отбор.Вставить("ДоговорВзаиморасчетов", ДоговорВзаиморасчетов);
	
	ОтчетыПлатформаКлиент.ОткрытьОтчет("Отчет.ВзаиморасчетыСКонтрагентом", "ВзаиморасчетыКомпании",,,, Отбор, , ОбщегоНазначенияКлиент.ДатаСеанса());
	
КонецПроцедуры // НадписьВзаиморасчетыНажатие()

// Общий обработчик события возникающего при нажатии на надпись "Денежные средства".
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура НадписьДенежныеСредстваНажатие(Форма, ИмяРеквизита="", Объект = Неопределено) Экспорт
	
	// Получим основной объект данных формы
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	КассаКомпании = Объект[ИмяРеквизита];
	
	Если НЕ ЗначениеЗаполнено(КассаКомпании) Тогда
		Возврат;
	КонецЕсли;
	
	// фильтры
	Отбор = Новый Структура;
	Отбор.Вставить("СтруктурнаяЕдиница", КассаКомпании);
	
	Если ОтчетыПлатформаВызовСервера.ЗначениеФункциональнойОпции("ИспользоватьМногоВалютныйУчет") Тогда
		ОтчетыПлатформаКлиент.ОткрытьОтчет("Отчет.ОстаткиИОборотыДенежныхСредствКомпании", "ОстаткиПоВалюте",,,, Отбор, , ОбщегоНазначенияКлиент.ДатаСеанса());
	Иначе
		ОтчетыПлатформаКлиент.ОткрытьОтчет("Отчет.ОстаткиИОборотыДенежныхСредствКомпании", "Остатки",,,, Отбор, , ОбщегоНазначенияКлиент.ДатаСеанса());
	КонецЕсли;
	
КонецПроцедуры // НадписьДенежныеСредстваНажатие()

// Общий обработчик события возникающего при расширенном редактировании поля "Комментарий".
//
// Параметры:
//  Форма                - УправляемаяФорма - Форма, в которой возникло событие.
//  Элемент              - ПолеФормы        - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево        - В данный параметр передается признак выполнения системной обработки события.
//
Процедура РасширенноеРедактированиеПоляКомментарий(Форма, Элемент, СтандартнаяОбработка, Объект = Неопределено) Экспорт
	
	// Получим основной объект данных формы
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Проверим блокировку объекта другим пользователем.
	Если УправлениеДиалогомВызовСервера.ПроверитьЗапретРедактированияДанных(Объект.Ссылка, Форма.УникальныйИдентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	// Отказываемся от стандартной обработки события.
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Формируем описание обработчика перехвата закрытия формы.
	ОбработкаРезультатаЗакрытия = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", Форма, "РасширенноеРедактированиеПоляКомментарий");
	
	// Открываем диалог многострочного редактирования текста комментария.
	ПоказатьВводСтроки(ОбработкаРезультатаЗакрытия, СокрЛП(Объект.Комментарий), НСтр("ru = 'Введите комментарий'") + " ...",, ИСТИНА);
	
КонецПроцедуры // РасширенноеРедактированиеПоляКомментарий()

// Общий обработчик события возникающего на клиенте при нажатии на надпись "Сумма документа".
//
// Параметры:
//  Форма   - УправляемаяФорма - Форма, в которой возникло событие.
//  Элемент - ПолеФормы        - Элемент управления, в котором возникло данное событие.
//
Процедура ПоказатьРасширенныеИтогиОперации(Форма, Элемент, Объект = Неопределено) Экспорт
	
	// Получим основной объект данных формы
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Получим представление расширенных итогов операции
	ПредставлениеИтогов = ЗащищенныеФункцииВызовСервера.ПолучитьПредставленияИтоговОперации(Объект);
	
	// Формируем описание обработчика перехвата закрытия формы
	ОбработкаРезультатаЗакрытия = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", Форма, "ВыборЭлементаРасширенныхИтоговОперации");
	
	// Производим визуализацию переданного списка
	Форма.ПоказатьВыборИзМеню(ОбработкаРезультатаЗакрытия, ПредставлениеИтогов, Элемент);
	
КонецПроцедуры // ПоказатьРасширенныеИтогиОперации()

// Общий обработчик события возникающего при выборе "Партии" в товарах.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура ОткрытьПодборПартий(Форма, Элемент, ПараметрыДействия=Неопределено, Объект = Неопределено) Экспорт
	
	// Инициализируем структуру параметров действия
	Если НЕ ТипЗнч(ПараметрыДействия)=Тип("Структура") Тогда
		ПараметрыДействия = Новый Структура();
	КонецЕсли;
	
	// Получим основной объект данных формы
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	ТекущиеДанные = Форма.Элементы.Товары.ТекущиеДанные;
	
	// Проверим заполнение объекта
	Если НЕ ЗначениеЗаполнено(Объект.СкладКомпании) Тогда
		ВывестиСообщение(НСтр("ru='Не заполнен склад компании'"));
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ВывестиСообщение(НСтр("ru='Не выбрана номенклатура'"));
		Возврат;
	КонецЕсли;
	Если Объект.ХозОперация=ПредопределенноеЗначение("Справочник.ХозОперации.ВозвратТоваровПоставщикуКомиссия") И НЕ ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) Тогда
		ВывестиСообщение(НСтр("ru='Не указан договор комиссии.'"));
		Возврат;
	КонецЕсли;
	
	// Инициализируем структуру основных параметры подбора товаров в документ
	ПараметрыПодбора = Новый Структура();
	ПараметрыПодбора.Вставить("ДокументОснование");
	ПараметрыПодбора.Вставить("ВозвратНам",Ложь);
	ПараметрыПодбора.Вставить("РежимВыбора",Истина);
	ПараметрыПодбора.Вставить("СкладКомпании",Объект.СкладКомпании);
	ПараметрыПодбора.Вставить("Номенклатура",ТекущиеДанные.Номенклатура);
	Если ЗначениеЗаполнено(ТекущиеДанные.ХарактеристикаНоменклатуры) Тогда
		ПараметрыПодбора.Вставить("ХарактеристикаНоменклатуры",ТекущиеДанные.ХарактеристикаНоменклатуры);
	КонецЕсли;
	Если Объект.ХозОперация=ПредопределенноеЗначение("Справочник.ХозОперации.ВозвратТоваровПоставщикуКомиссия") Тогда
		ПараметрыПодбора.Вставить("СтатусПартии",ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварПринятыйКомиссия"));
	ИначеЕсли Объект.ХозОперация=ПредопределенноеЗначение("Справочник.ХозОперации.ВозвратТоваровПоставщику") Тогда
		ПараметрыПодбора.Вставить("СтатусПартии",ПредопределенноеЗначение("Перечисление.СтатусыПартий.ТоварКупленный"));
	КонецЕсли;
	Если Объект.ХозОперация=ПредопределенноеЗначение("Справочник.ХозОперации.ВозвратТоваровПоставщикуКомиссия") Тогда
		ПараметрыПодбора.Вставить("ДоговорВзаиморасчетов",Объект.ДоговорВзаиморасчетов);
	КонецЕсли;
	
	// параметры объекта
	ПараметрыПодбора.Вставить("ДатаКонца",Объект.Дата);
	ПараметрыПодбора.Вставить("ВалютаДокумента",Объект.ВалютаДокумента);
	ПараметрыПодбора.Вставить("КурсДокумента",Объект.КурсДокумента);
	ПараметрыПодбора.Вставить("Контрагент",ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
	ПараметрыПодбора.Вставить("ХозОперация",Объект.ХозОперация);
	ПараметрыПодбора.Вставить("ПроведениеПоПроизвольнымПартиям", Ложь);
	
	// Перезаполним по переданным параметрам
	ЗаполнитьЗначенияСвойств(ПараметрыПодбора, ПараметрыДействия);
	ПараметрыПодбора.Вставить("Документ",ПараметрыПодбора.ДокументОснование);
	
	// Производим открытие формы подбора номенклатуры
	ОткрытьФорму("ПланВидовХарактеристик.ТипыПартий.Форма.ФормаВыбораПартий", ПараметрыПодбора, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ОткрытьПодборПартий()

// Общий обработчик события возникающего при нажатии кнопки "Печать чека"
// 
// Параметры:
//  Форма             - УправляемаяФорма          - Форма, в которой возникло событие.
//
Процедура ПробитьЧек(Форма,ПараметрыДействия, Объект = Неопределено) Экспорт
	
	// Получим основной объект данных формы
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	ПараметрыДействия.Вставить("Форма",Форма);
	ПараметрыДействия.Вставить("Объект",Объект);
	Наличные = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Наличные", ЛОЖЬ);
	НеНуженЭТ = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "НеНуженЭТ", ЛОЖЬ);
	
	// Выполним предварительные проверки перед печатью
	Если Объект.СуммаДокумента = 0 Тогда
		ВывестиСообщение(НСтр("ru = 'Не указана сумма к оплате'"), Объект, "СуммаДокумента");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ФР) Тогда
		ВывестиСообщение(НСтр("ru = 'Не указан ФР.'"), Объект, "ФР");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		ВывестиСообщение(НСтр("ru = 'Не указана касса ККМ.'"), Объект, "КассаККМ");
		Возврат;
	КонецЕсли;
	
	Если ЕстьРеквизитНаКлиенте(Объект,"ТипСпособаРасчетаККТ") И  НЕ ЗначениеЗаполнено(Объект.ТипСпособаРасчетаККТ) Тогда
		ВывестиСообщение(НСтр("ru = 'Не указана способ расчета.'"), Объект, "ТипСпособаРасчетаККТ");
		Возврат;
	КонецЕсли;
	
	Если Объект.НомерЧека <> 0 Тогда
		ВывестиСообщение(НСтр("ru = 'Чек уже пробит на фискальном регистраторе.'"), Объект);
		Возврат;
	КонецЕсли;
	
	// Проверим надо ли взаимодействовать с ЭТ
	СуммаПоЭТ = 0;
	Если НЕ Наличные И ЕстьРеквизитНаКлиенте(Объект,"Оплаты") Тогда
		Для Каждого СтрОплаты Из Объект.Оплаты Цикл
			Если СтрОплаты.ТипОплаты = ПредопределенноеЗначение("Справочник.ТипыОплат.Безналичные") Тогда
				СуммаПоЭТ = СуммаПоЭТ + СтрОплаты.Сумма - СтрОплаты.Сдача;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ПараметрыДействия.Вставить("СуммаПоЭТ",СуммаПоЭТ);
	
	// Пробить можно только проведенный документ
	// Создадим обработчик оповещения.
	Если НЕ ЗначениеЗаполнено(Объект.ДатаФР) И (СуммаПоЭТ > 0) И НЕ НеНуженЭТ Тогда
		ОбработчикСобытия = Новый ОписаниеОповещения("ПродолжитьПробитьЧекЭТ", УправлениеДиалогомДокументаКлиент, ПараметрыДействия);
	Иначе
		ОбработчикСобытия = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ОповещениеПробитьЧекЗавершениеФР", Новый ОписаниеОповещения("ПробитьЧекЗавершениеФР", УправлениеДиалогомДокументаКлиент, ПараметрыДействия));
	КонецЕсли;
	
	ПараметрыЗаписиНового = ЗащищенныеФункцииКлиент.СоздатьПараметрыЗаписиНовогоОбъектаНаКлиенте();
	ПараметрыЗаписиНового.ПровестиДокумент  = Истина;
	ПараметрыЗаписиНового.ОбработчикСобытия = ОбработчикСобытия;

	Если ЗащищенныеФункцииКлиент.ЗаписатьНовыйОбъектНаКлиенте(Форма, ПараметрыЗаписиНового) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаФР) И (СуммаПоЭТ > 0) И НЕ НеНуженЭТ Тогда
		ПродолжитьПробитьЧекЭТ(Неопределено,ПараметрыДействия);
	Иначе
		ВыполнитьОбработкуОповещения(ОбработчикСобытия, Неопределено);
	КонецЕсли;
	
КонецПроцедуры // ПробитьЧек()

// Общий обработчик события возникающего при нажатии кнопки "Печать чека"
// 
// Параметры:
//  Форма             - УправляемаяФорма          - Форма, в которой возникло событие.
//
Процедура ПродолжитьПробитьЧекЭТ(РезультатОповещения,ПараметрыДействия) Экспорт
	
	// Нужно чтобы не оформить ЭТ при закрытой смене
	СтатусПоследнейСмены = МенеджерОборудованияВызовСервера.ПолучитьСтатусПоследнейСмены(ПараметрыДействия.Объект.ФР);
	Если Не СтатусПоследнейСмены.Активна Тогда
		ВывестиСообщение(НСтр("ru='Кассовая смена не открыта или истекла.'"));
		Возврат;
	КонецЕсли;	
	
	Если ПараметрыДействия.Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ЧекНаОплатуВозврат")
		ИЛИ ПараметрыДействия.Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ЧекНаОплатуПокупкиВозврат") 
		ИЛИ ПараметрыДействия.Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ЧекНаВозврат") Тогда
		ТипТранзакции = "AuthorizeRefund";
	Иначе
		ТипТранзакции = "AuthorizeSales";
	КонецЕсли;
		
	ПараметрыОперации = МенеджерОборудованияКлиент.ПараметрыВыполненияЭквайринговойОперации();
	ПараметрыОперации.ТипТранзакции  = ТипТранзакции;
	ПараметрыОперации.СуммаОперации  = ПараметрыДействия.СуммаПоЭТ;
	ПараметрыОперации.НомерЧека      = "";
	ПараметрыОперации.НомерЧекаЭТ    = "";
	ПараметрыОперации.СсылочныйНомер = "";

	ОписаниеОповещения = Новый ОписаниеОповещения("ОперацияПоПлатежнойКартеЗавершение", ЭтотОбъект, ПараметрыДействия);
	МенеджерОборудованияКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(ОписаниеОповещения, ПараметрыДействия.Форма.УникальныйИдентификатор, Неопределено, ПараметрыДействия.Объект.Фр, ПараметрыОперации); 
	
КонецПроцедуры // ПродолжитьПробитьЧек()

Процедура ОперацияПоПлатежнойКартеЗавершение(РезультатВыполнения, Параметры) Экспорт
 
   Если РезультатВыполнения.Результат Тогда
      ТекстСообщения = НСтр("ru = 'Операция завершена.'");
	  ПробитьЧекЗавершениеФР(Неопределено, Параметры);
  Иначе 
      ТекстСообщения = НСтр("ru = 'При выполнении операции произошла ошибка:""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
      Сообщить(ТекстСообщения);
   КонецЕсли;

КонецПроцедуры // ОперацияПоПлатежнойКартеЗавершение()

// Общий обработчик события возникающего при нажатии кнопки "Печать чека"
// 
// Параметры:
//  Форма             - УправляемаяФорма          - Форма, в которой возникло событие.
//
Процедура ПробитьЧекЗавершениеФР(ПараметрыВыбранногоЭТ, ПараметрыДействия) Экспорт
	
	Форма = ПараметрыДействия.Форма;
	Объект = ПараметрыДействия.Объект;
		
	// Получим основной объект данных формы
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Заполняем параметры операции пробития чека
	ПараметрыПробития = Новый Структура("");
		
	// Определяем переменные для возвратных параметров
	ОписаниеОшибки = "";
	ДопПараметры = Новый Структура("Объект, Форма");
	ДопПараметры.Объект = Объект;
	ДопПараметры.Форма = Форма;
	
	ОповещениеПриЗавершении = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ОповещениеПриЗавершении", Новый ОписаниеОповещения("ПечатьЧекаЗавершение", УправлениеДиалогомДокументаКлиент, ДопПараметры));
	
	ПараметрыПробития.Вставить("Объект",         Объект);
	ПараметрыПробития.Вставить("ДокументСсылка",	Объект.Ссылка);
	ПараметрыПробития.Вставить("ФР",				Объект.ФР);
	
	ОбщиеПараметры = ПолучитьШаблонЧека(ОписаниеОшибки, ПараметрыПробития);
	
	Если НЕ ПустаяСтрока(ОписаниеОшибки) Тогда
		ВывестиСообщение(ОписаниеОшибки, Объект);
	Иначе
		МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(ОповещениеПриЗавершении, Форма.УникальныйИдентификатор,ОбщиеПараметры,Объект.ФР);
	КонецЕсли;
	
КонецПроцедуры // ПробитьЧекЗавершениеФР()

Функция ПолучитьШаблонЧека(ОписаниеОшибки, ПараметрыПробития)
	
	// Общие параметры чека
	ОбщиеПараметры = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
	
	// Определим вид выписки (расход/приход) и если указаны возвраты, то возврат
	Объект = ПараметрыПробития.Объект;
	ХозОперация = Объект.ХозОперация;
	Сделка = ?(ЕстьРеквизитНаКлиенте(Объект,"Сделка"),Объект.Сделка,Неопределено);
	
	// Параметры типа расчета.
	ДокументыВозвратаПрихода = Новый Массив;
	ДокументыВозвратаПрихода.Добавить(Тип("ДокументСсылка.ВозвратПоставщику"));
	
	ДокументыВозвратаРасхода = Новый Массив;
	ДокументыВозвратаРасхода.Добавить(Тип("ДокументСсылка.ВозвратОтПокупателя"));
		
	ЭтоРасходВыписки = Ложь;
	ВозвратПоВыписке = Истина;
	Если ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.СтрокаБанковскойВыписки") Тогда
		ЭтоРасходВыписки = (Объект.СуммаДокументаРасход <> 0);
		Для Каждого ТекущаяСтрока Из Объект.Состав Цикл
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Сделка) ИЛИ
				ЭтоРасходВыписки И ДокументыВозвратаРасхода.Найти(ТипЗнч(ТекущаяСтрока.Сделка)) = Неопределено ИЛИ
				НЕ ЭтоРасходВыписки И ДокументыВозвратаПрихода.Найти(ТипЗнч(ТекущаяСтрока.Сделка)) = Неопределено Тогда
				ВозвратПоВыписке = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	Если ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ЧекНаОплатуПокупкиВозврат") ИЛИ
		(ХозОперация=ПредопределенноеЗначение("Справочник.ХозОперации.ПриходныйКассовыйОрдер") И
		ЗначениеЗаполнено(Сделка) И
		ДокументыВозвратаПрихода.Найти(ТипЗнч(Сделка)) <> Неопределено) ИЛИ
		(ХозОперация=ПредопределенноеЗначение("Справочник.ХозОперации.СтрокаБанковскойВыписки") И НЕ ЭтоРасходВыписки И ВозвратПоВыписке) Тогда
		ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств");
	ИначеЕсли ХозОперация=ПредопределенноеЗначение("Справочник.ХозОперации.ЧекНаОплатуВозврат") ИЛИ
		ХозОперация=ПредопределенноеЗначение("Справочник.ХозОперации.ЧекНаВозврат") ИЛИ
		(ХозОперация=ПредопределенноеЗначение("Справочник.ХозОперации.РасходныйКассовыйОрдер") И
		ЗначениеЗаполнено(Сделка) И
		ДокументыВозвратаРасхода.Найти(ТипЗнч(Сделка)) <> Неопределено) ИЛИ 
		ХозОперация=ПредопределенноеЗначение("Справочник.ХозОперации.ВозвратТоваровОтПокупателя") ИЛИ
		(ХозОперация=ПредопределенноеЗначение("Справочник.ХозОперации.СтрокаБанковскойВыписки") И ЭтоРасходВыписки И ВозвратПоВыписке) Тогда
		ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств");
	ИначеЕсли ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ЧекНаОплатуПокупки") ИЛИ
		ХозОперация=ПредопределенноеЗначение("Справочник.ХозОперации.РасходныйКассовыйОрдер") ИЛИ
		(ХозОперация=ПредопределенноеЗначение("Справочник.ХозОперации.СтрокаБанковскойВыписки") И ЭтоРасходВыписки) Тогда
		ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств");
	Иначе
		ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств");
	КонецЕсли;
	
	ОбщиеПараметры.ДокументОснование = Объект.Ссылка;
	ОбщиеПараметры.ТипРасчета = ТипРасчета;
	ОбщиеПараметры.НомерКассы = "00001";
	ОбщиеПараметры.НомерСмены = 0;
	ОбщиеПараметры.НомерЧека = 0;
		
	УправлениеДиалогомВызовСервера.ПолучитьШаблонЧека(ОбщиеПараметры,ОписаниеОшибки,ПараметрыПробития);
	
	Возврат ОбщиеПараметры;

КонецФункции

Процедура ПечатьЧекаЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ ТипЗнч(РезультатВыполнения) = Тип("Булево") Тогда
		Если НЕ РезультатВыполнения.Результат Тогда
			ТекстСообщения = НСтр("ru = 'При выполнении операции произошла ошибка:""%ОписаниеОшибки%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
			ВывестиСообщение(ТекстСообщения);
		Иначе
			// Получить номер чека и номер смены.
			ВыходныеПараметры = РезультатВыполнения.ВыходныеПараметры;
			ФискальныеРеквизиты = Новый Структура;
			ФискальныеРеквизиты.Вставить("НомерСмены",         ВыходныеПараметры[0]);
			ФискальныеРеквизиты.Вставить("НомерЧека",          ВыходныеПараметры[1]);
			Если ВыходныеПараметры.Количество() > 2 Тогда
				ФискальныеРеквизиты.Вставить("НомерДокумента", ВыходныеПараметры[2]);
			КонецЕсли;
			
			Если (ВыходныеПараметры.Количество() > 3) И (ТипЗнч(ВыходныеПараметры[3]) = Тип("Дата")) Тогда
				ФискальныеРеквизиты.Вставить("ДатаФР",         ВыходныеПараметры[3]);
			Иначе
				ФискальныеРеквизиты.Вставить("ДатаФР",         МенеджерОборудованияКлиентПереопределяемый.ДатаСеанса());
			КонецЕсли;
			
			Объект = Параметры.Объект;
			Форма = Параметры.Форма;
			
			Если НЕ ЗначениеЗаполнено(Объект.ДатаФР) Тогда
				Если НЕ УправлениеДиалогомВызовСервера.ЗаписатьОбъект(Объект, ИСТИНА, ФискальныеРеквизиты) Тогда
					ВывестиСообщение(НСтр("ru='Не удалось записать сведения о фискальных реквизитах в документ %1. Необходимо вручную внести данные в документ: номер чека - %2, дата чека - %3, номер смены - %4, номер документа - %5'"), Объект, "НомерЧека",,, Объект.Ссылка, ФискальныеРеквизиты.НомерЧека, ФискальныеРеквизиты.ДатаФР, ФискальныеРеквизиты.НомерСмены, ФискальныеРеквизиты.НомерДокумента);
				КонецЕсли;
			КонецЕсли;
			ОповеститьОбИзменении(Объект.Ссылка);
			Форма.Закрыть();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Операция выполнена успешно.'");
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ ДОКУМЕНТА

// Общий обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//  Отказ - Булево           - Признак отказа от создания формы.
//
Функция ПриОткрытии(Форма, Отказ) Экспорт
	
	ЗащищенныеФункцииКлиент.НастроитьКоманднуюПанельФормы(Форма);
	
	// ПодключаемоеОборудование
	Если ЕстьРеквизитНаКлиенте(Форма,"ПоддерживаемыеТипыПодключаемогоОборудования") Тогда
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, Форма, "СканерШтрихкода, СчитывательМагнитныхКарт");
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// Настройка кнопок командной панели табличной части
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "Активы");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "ВыданныеАвансы");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "ГрафикРаспределенияДС");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "ДвиженияКорректировки");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "Накопления");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "Оплаты");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "ОприходованныеЦенности");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "ПараметрыПлана");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "Платежи");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "ПоДаннымОрганизации");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "ПоДаннымКонтрагента");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "Показатели");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "РаспределениеЗаказа");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "Расходы");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "Замены");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "РасходыИДоходы");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "Скидки");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "СтатьиДДС");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "Состав");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "Товары");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "ТоварыЗаменители");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "Услуги");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "ЦенныеБумаги");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "Работы");
	// тк+
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "Подразделения");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "ГруппыАссортимента");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "Продукция");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "ПродукцияКонсолидированная");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(Форма, "Марки");
	// тк-
	
	// Подсистема "ОбменСКонтрагентами"
	Если НЕ Форма.Элементы.Найти("КомандыЭДО") = Неопределено Тогда
		ОбменСКонтрагентамиКлиент.ПриОткрытии(Форма);
	КонецЕсли;
	// Конец Подсистема "ОбменСКонтрагентами"
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат (НЕ Отказ);
	
КонецФункции // ПриОткрытии()

// Общий обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Форма                - УправляемаяФорма - Форма, в которой возникло событие.
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
Функция ПередЗакрытием(Форма, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Экспорт
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат (НЕ Отказ);
	
КонецФункции // ПередЗакрытием()

// Общий обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  Форма            - УправляемаяФорма - Форма, в которой возникло событие.
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
Функция ПриЗакрытии(Форма, ЗавершениеРаботы) Экспорт
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, Форма);
	// Конец ПодключаемоеОборудование
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  Форма             - УправляемаяФорма          - Форма, в которой возникло событие.
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  Объект            - ДанныеФормыСтруктура      - Объект, для которого выполняется обработка события.
//  Окно              - ОкноКлиентскогоПриложения - Содержит окно, в котором требуется открыть форму.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
Функция ОбработкаВыбора(Форма, ВыбранноеЗначение, Объект, Окно, ПараметрыДействия) Экспорт
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаВыбора()

// Общий обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  Форма               - УправляемаяФорма - Форма, в которой возникло событие.
//  ИмяСобытия          - Строка           - Имя, идентифицирующее событие.
//  Параметр            - Произвольный     - Параметр сообщения.
//  Источник            - Произвольный     - Источник события.
//  ПараметрыДействия   - Структура        - Набор параметров, использующихся при выполнения операции.
//
Функция ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ПараметрыДействия=Неопределено) Экспорт
	
	// Обработаем в зависимости от вида события
	Если Источник="ПодключаемоеОборудование" Тогда
		
		Если НЕ Форма.ВводДоступен() Тогда
			Возврат ЛОЖЬ;
			
		ИначеЕсли ИмяСобытия = "TracksData" Тогда
			ПараметрыДействия.Вставить("КодКарты", Параметр[0]);
			Возврат ИСТИНА;
			
		ИначеЕсли ИмяСобытия = "ScanData" Тогда
			ПараметрыДействия.Вставить("ШтрихКод", ?((Параметр.Количество() > 1) И (Параметр[1] <> Неопределено), Параметр[1][1], Параметр[0]));
			Возврат ИСТИНА;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ЗаписьСчетФактуры" И НЕ Форма.Элементы.Найти("НадписьНалоговыйДокумент")= Неопределено Тогда
		
		Форма.НалоговыйДокумент = Параметр.Ссылка;
		Форма.Элементы.НадписьНалоговыйДокумент.Заголовок = Параметр.Ссылка;
		
	ИначеЕсли ИмяСобытия = "Записан_Документ" И Параметр <> Форма.Объект.Ссылка Тогда
		
		Форма.Прочитать();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	// Подсистема "ОбменСКонтрагентами".
	Если НЕ Форма.Элементы.Найти("ДекорацияСостояниеЭДО") = Неопределено Тогда
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = Форма;
		ПараметрыОповещения.ДокументСсылка = Форма.Объект.Ссылка;
		ПараметрыОповещения.ДекорацияСостояниеЭДО = Форма.Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Форма.Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьДокументИБПослеЗаполнения"  И Параметр.Найти(Форма.Объект.Ссылка) <> Неопределено Тогда
		Форма.Прочитать();
	КонецЕсли;
	// Конец подсистема "ОбменСКонтрагентами".
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(Форма, ИмяСобытия, Параметр);
			
КонецФункции // ОбработкаОповещения()

// Общий обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Форма           - УправляемаяФорма - Форма, в которой возникло событие.
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
Функция ПередЗаписью(Форма, Отказ, ПараметрыЗаписи) Экспорт
	
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		
		// Проверим тек объект
		Объект = Неопределено;
		ПолучитьОсновнойОбъектФормы(Форма,Объект);
		
		МногоСтрокВТч = (ЕстьРеквизитНаКлиенте(Объект,"Товары") И Объект.Товары.Количество()>500);
			
		КлючеваяОперация = "ПроведениеДокумента" + СтрЗаменить(Форма.ПолноеИмяОбъекта,"Документ.","") + ?(МногоСтрокВТч,"СБольшимКоличествомСтрок","");
		ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(КлючеваяОперация);
		
	ИначеЕсли ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Запись") Тогда
		КлючеваяОперация = "ЗаписьДокумента" + СтрЗаменить(Форма.ПолноеИмяОбъекта,"Документ.","");
		ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
	Если Форма.ПравоПерезаписьАвтора И Форма.Автор <> Форма.Объект.Автор Тогда
		Форма.Объект.Автор = Форма.Автор;
	КонецЕсли;
	
	Если ЕстьРеквизитНаКлиенте(Форма.Объект, "ПодразделениеКомпании")
		И Форма.ПравоПерезаписьПодразделения
		И Форма.ПодразделениеКомпании <> Форма.Объект.ПодразделениеКомпании Тогда
		
		ТекстВопроса = НСтр("ru = 'Подразделение компании документа не соответствуют текущему пользователю:'")
			+ Символы.ПС
			+ НСтр("ru = 'Подразделение компании документа:'")
			+ Символы.НПП
			+ Форма.Объект.ПодразделениеКомпании
			+ Символы.ПС
			+ НСтр("ru = 'Подразделение компании пользователя:'")
			+ Символы.НПП
			+ Форма.ПодразделениеКомпании;
		
		СписокОтветов = Новый СписокЗначений;
		СписокОтветов.Добавить("ОК");
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИзменениеПодразделения", Истина);
		ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
		
		ОО = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", Форма, ДополнительныеПараметры);
		ПоказатьВопрос(ОО, ТекстВопроса, СписокОтветов,,"ОК","Документ не может быть сохранен");
		
		Отказ = Истина;
		Возврат Ложь;
	КонецЕсли;

	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ПередЗаписью()

// Общий обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  Форма           - УправляемаяФорма - Форма, в которой возникло событие.
//  ПараметрыЗаписи - Структура        - Структура, содержащая параметры записи.
//
Функция ПослеЗаписи(Форма, ПараметрыЗаписи) Экспорт
	
	// Проведем оповещение записи документа
	Если НЕ УправлениеДиалогомКлиентСервер.ПравоПользователяКлиент("РедактированиеДокументовПриНаличииПодчиненных") Тогда
		Оповестить("Записан_Документ", Форма.Объект.Ссылка);
	КонецЕсли;
	
	// Перезаполним введенные на основании СчетФактура и СчетНаОплату.
	ПерезаполнитьСчетФактуру(Форма, ?(ПараметрыЗаписи.Свойство("МассивВидов"), ПараметрыЗаписи.МассивВидов, Неопределено));
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ПослеЗаписи()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Общий обработчик события возникающего перед началом интерактивного добавления строки.
//
// Параметры:
//  Форма       - УправляемаяФорма - Форма, в которой возникло событие.
//  Элемент     - ТаблицаФормы     - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево           - Признак отказа от создания формы.
//  Копирование - Булево           - Определяет режим копирования.
//  Родитель    - Ссылка           - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево           - Признак добавления группы.
//  Параметр    - Произвольный     - Параметр команды, выполняемой при добавлении строки в таблицу.
//
Процедура ТоварыПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр) Экспорт
	
	Зарезервировано = ИСТИНА;
	
КонецПроцедуры // ТоварыПередНачаломДобавления()

// Общий обработчик события возникающего перед началом интерактивного изменения строки.
//
// Параметры:
//  Форма   - УправляемаяФорма - Форма, в которой возникло событие.
//  Элемент - ТаблицаФормы     - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево           - Признак отказа от создания формы.
//
Процедура ТоварыПередНачаломИзменения(Форма, Элемент, Отказ) Экспорт
	
	Зарезервировано = ИСТИНА;
	
КонецПроцедуры // ТоварыПередНачаломИзменения()

// Общий обработчик события возникающего перед удалением строки или группы строк.
//
// Параметры:
//  Форма   - УправляемаяФорма - Форма, в которой возникло событие.
//  Элемент - ТаблицаФормы     - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево           - Признак отказа от создания формы.
//
Процедура ТоварыПередУдалением(Форма, Элемент, Отказ, УдаляемыеСтроки=Неопределено) Экспорт
	
	Если УдаляемыеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Форма.Объект.Свойство("Товары") Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.Элементы.Товары.ТекущиеДанные = Неопределено ИЛИ (НЕ Форма.Элементы.Товары.ТекущиеДанные.Свойство("ИдентификаторСтроки")) Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Форма.Элементы.Товары.ВыделенныеСтроки;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		СтрокаТЧ = Форма.Объект.Товары.НайтиПоИдентификатору(ВыделеннаяСтрока);
		УдаляемыеСтроки.Добавить(СтрокаТЧ.ИдентификаторСтроки);
	КонецЦикла;
	
КонецПроцедуры // ТоварыПередУдалением()

// Общий обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Форма                - УправляемаяФорма - Форма, в которой возникло событие.
//  Элемент              - ТаблицаФормы         - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево               - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево               - Истина, если произошла отмена редактирования.
//  ИмяТабличнойЧасти    - Строка               - Имя таблицы, при редактировании которой возникло данное событие.
//  Объект               - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  СписокРеквизитов     - Строка               - Имена реквизитов, перечисленные через запятую, в формате
//                                                требований к свойствам структуры.
//                                                Например, "Код, Наименование, Родитель".
//                       - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//                                                псевдоним поля для возвращаемой структуры с результатом, а в качестве
//                                                значения (опционально) фактическое имя поля в таблице.
//                                                Если значение не определено, то имя поля берется из ключа.
//                       - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//                                                к свойствам структуры.
//                                                Служебные поля для получения данных:
//                                                _ИтогиОпераций, _Константа, _Право.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов с префиксом "Представление".
//
Функция ТоварыПриОкончанииРедактирования(Форма, Элемент, НоваяСтрока, ОтменаРедактирования, ИмяТабличнойЧасти="Товары", Объект=Неопределено, СписокРеквизитов=Неопределено) Экспорт
	
	// Получим основной объект данных формы
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// После удаления строки набора, параметр отмены редактирования может не верно передаваться.
	Если НЕ ОтменаРедактирования И (Элемент.ТекущаяСтрока = Неопределено ИЛИ Объект[ИмяТабличнойЧасти].НайтиПоИдентификатору(Элемент.ТекущаяСтрока) = Неопределено) Тогда
		
		ОтменаРедактирования = Истина;
		
	КонецЕсли;
	
	// Обработаем событие в бесконтекстном серверном вызове.
	СтруктураДанных = УправлениеДиалогомВызовСервера.ПриОкончанииРедактирования(Объект, НоваяСтрока, ОтменаРедактирования, ИмяТабличнойЧасти, СписокРеквизитов);
	
	// Заполним реквизиты объекта измененными данными.
	Если СтруктураДанных.Свойство("_Объект") И СтруктураДанных._Объект<>Объект Тогда
		КопироватьДанныеФормы(СтруктураДанных._Объект, Объект);
	КонецЕсли;
	
	// Заполним реквизиты формы полученными данными.
	ЗаполнитьЗначенияСвойств(Форма, СтруктураДанных);
	
	// Возвращаем структуру данных для дальнейшей обработки.
	Возврат СтруктураДанных;
	
КонецФункции // ТоварыПриОкончанииРедактирования()

// Общий обработчик события возникающего при движении курсора в поле приемнике данных.
//
// Параметры:
//  Форма                   - УправляемаяФорма        - Форма, в которой возникло событие.
//  Элемент                 - ТаблицаФормы            - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка    - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                           - Строка таблицы, над которой находится курсор.
//  Поле                             - Элемент управляемой формы, с которым связана данная колонка таблицы.
//
Процедура ТоварыПроверкаПеретаскивания(Форма, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле) Экспорт
	
	Зарезервировано = ИСТИНА;
	
КонецПроцедуры // ТоварыПроверкаПеретаскивания()

// Обработчик события возникающего на клиенте при при активизации ячейки таблицы.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПриАктивизацииЯчейки(Форма, Элемент) Экспорт
	
	ТекущиеДанные = Форма.Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если (НЕ Форма.Элементы.Найти("ТоварыАлкогольнаяПродукция") = Неопределено) И Элемент.ТекущийЭлемент = Форма.Элементы.ТоварыАлкогольнаяПродукция Тогда
		
		СписокВыбораНоменклатура = Форма.Элементы.ТоварыАлкогольнаяПродукция.СписокВыбора;
		СписокВыбораНоменклатура.Очистить();
		
		СписокВыбораНоменклатура.ЗагрузитьЗначения(ТекущиеДанные.СопоставленнаяАлкогольнаяПродукция.ВыгрузитьЗначения());
		
	КонецЕсли;
	
КонецПроцедуры //ТоварыПриАктивизацииЯчейки()

// Обработчик события возникающего на клиенте  в момент нажатия кнопки выбора или клавиши F4 реквизита "Алкогольная продукция".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыАлкогольнаяПродукцияНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = ЭтотОбъект.Объект.Товары.НайтиПоИдентификатору(ЭтотОбъект.Элементы.Товары.ТекущаяСтрока);
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СопоставленнаяАлкогольнаяПродукция) Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("СопоставленнаяАлкогольнаяПродукция", ТекущиеДанные.СопоставленнаяАлкогольнаяПродукция);
		ОткрытьФорму("Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ФормаВыбора",ПараметрыФормы,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры //ТоварыАлкогольнаяПродукцияНачалоВыбора()

Процедура ПерезаполнитьСчетФактуру(Форма, МассивВидов = Неопределено)
	
	// ищем счета
	Если МассивВидов = Неопределено Тогда
		
		МассивВидов = Новый Массив;
		МассивВидов.Добавить("СчетФактураПолученный");
		МассивВидов.Добавить("СчетФактураВыданный");
		МассивВидов.Добавить("СчетНаОплату");
	КонецЕсли;
	
	СписокПодчиненных = УправлениеДиалогомВызовСервера.ПолучитьСписокПодчиненных(Форма.Объект.Ссылка, МассивВидов);
	
	Если СписокПодчиненных = Неопределено ИЛИ СписокПодчиненных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ УправлениеДиалогомКлиентСервер.ПравоПользователяКлиент("ПерезаполнятьСчетаПриРедактированииДокументов") Тогда
		ТекстСообщения = НСтр("ru = 'Нет прав на перезаполнение счетов-фактур, счет-фактура не перезаполнена'");
		Сообщить(ТекстСообщения, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	// если нашли
	Параметры = Новый Структура;
	Параметры.Вставить("Документ", Форма.Объект.Ссылка);
	
	Для Каждого ЭлементСписка Из СписокПодчиненных Цикл
		
		Если НЕ ЭлементСписка.Пометка Тогда
			
			Если ТипЗнч(ЭлементСписка.Значение) = Тип("ДокументСсылка.СчетНаОплату") 
				И НЕ Параметры.Свойство("СчетНаОплату") Тогда
				
				Параметры.Вставить("СчетНаОплату", ЭлементСписка.Значение);
			ИначеЕсли (ТипЗнч(ЭлементСписка.Значение) = Тип("ДокументСсылка.СчетФактураПолученный")
				ИЛИ ТипЗнч(ЭлементСписка.Значение) = Тип("ДокументСсылка.СчетФактураВыданный"))
				И НЕ Параметры.Свойство("СчетФактура") Тогда
				
				Параметры.Вставить("СчетФактура", ЭлементСписка.Значение);
			ИначеЕсли ТипЗнч(ЭлементСписка.Значение) = Тип("ДокументСсылка.СчетОтПоставщика")
				И НЕ Параметры.Свойство("СчетОтПоставщика") Тогда
				
				Параметры.Вставить("СчетОтПоставщика", ЭлементСписка.Значение);
			ИначеЕсли (Параметры.Свойство("СчетФактура") ИЛИ Параметры.Свойство("СчетОтПоставщика")) 
				И Параметры.Свойство("СчетНаОплату") Тогда
				
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ Параметры.Свойство("СчетФактура") 
		И НЕ Параметры.Свойство("СчетНаОплату")
		И НЕ Параметры.Свойство("СчетОтПоставщика") Тогда
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Найденные документы оплаты помечены на удаление. Редактирование документов оплаты отменено.'"),,,,СтатусОповещенияПользователя.Важное);
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ОбновлениеДокументовОплаты", Параметры);
	
КонецПроцедуры // ПерезаполнитьСчетФактуру()

//&НаКлиенте
Процедура ПоискПоШтрихкоду(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыВыполненияКоманды.Источник.ЭтаФорма.НавигационнаяСсылка) Тогда
		тПоиск= ПолучитьИзВременногоХранилища(ПараметрыВыполненияКоманды.Источник.ЭтаФорма.НавигационнаяСсылка);
	Иначе
		тПоиск="";	
	КонецЕсли;
	
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ПараметрыВыполненияКоманды.Источник, "ПоискПоШтрихКоду"),тПоиск,"Введите штрихкод для поиска"); 
	
КонецПроцедуры	
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "Марки"

// Общий обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Форма                - УправляемаяФорма - Форма, в которой возникло событие.
//  Элемент              - ТаблицаФормы         - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево               - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево               - Истина, если произошла отмена редактирования.
//  ИмяТабличнойЧасти    - Строка               - Имя таблицы, при редактировании которой возникло данное событие.
//  Объект               - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  СписокРеквизитов     - Строка               - Имена реквизитов, перечисленные через запятую, в формате
//                                                требований к свойствам структуры.
//                                                Например, "Код, Наименование, Родитель".
//                       - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//                                                псевдоним поля для возвращаемой структуры с результатом, а в качестве
//                                                значения (опционально) фактическое имя поля в таблице.
//                                                Если значение не определено, то имя поля берется из ключа.
//                       - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//                                                к свойствам структуры.
//                                                Служебные поля для получения данных:
//                                                _ИтогиОпераций, _Константа, _Право.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов с префиксом "Представление".
//
Функция МаркиПриОкончанииРедактирования(Форма, Элемент, НоваяСтрока, ОтменаРедактирования, ИмяТабличнойЧасти="Марки", Объект=Неопределено, СписокРеквизитов=Неопределено) Экспорт
	
	// Получим основной объект данных формы
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// После удаления строки набора, параметр отмены редактирования может не верно передаваться.
	Если НЕ ОтменаРедактирования И (Элемент.ТекущаяСтрока = Неопределено ИЛИ Объект[ИмяТабличнойЧасти].НайтиПоИдентификатору(Элемент.ТекущаяСтрока) = Неопределено) Тогда
		
		ОтменаРедактирования = Истина;
		
	КонецЕсли;
		
	// Обработаем событие в бесконтекстном серверном вызове.
	СтруктураДанных = УправлениеДиалогомВызовСервера.МаркиПриОкончанииРедактирования(Объект, НоваяСтрока, ОтменаРедактирования, ИмяТабличнойЧасти, СписокРеквизитов);
	
	// Заполним реквизиты объекта измененными данными.
	Если СтруктураДанных.Свойство("_Объект") И СтруктураДанных._Объект<>Объект Тогда
		КопироватьДанныеФормы(СтруктураДанных._Объект, Объект);
	КонецЕсли;
	
	// Заполним реквизиты формы полученными данными.
	ЗаполнитьЗначенияСвойств(Форма, СтруктураДанных);
	
	Если НЕ НоваяСтрока Тогда
		ТекущиеДанные      = Форма.Элементы.Товары.ТекущиеДанные;
		ТекущиеДанныеМарки = Объект.Марки.НайтиПоИдентификатору(Форма.Элементы.Марки.ТекущаяСтрока);
		Если (НЕ ТекущиеДанные = Неопределено) И (НЕ ТекущиеДанныеМарки = Неопределено) И НЕ ЗначениеЗаполнено(ТекущиеДанныеМарки.ИдентификаторСтроки) Тогда
			ТекущиеДанныеМарки.ИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки;
		КонецЕсли;
	КонецЕсли;	

	// Возвращаем структуру данных для дальнейшей обработки.
	Возврат СтруктураДанных;
		
КонецФункции // ТоварыПриОкончанииРедактирования()

// Общий обработчик события возникающего перед удалением строки или группы строк.
//
// Параметры:
//  Форма   - УправляемаяФорма - Форма, в которой возникло событие.
//  Элемент - ТаблицаФормы     - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево           - Признак отказа от создания формы.
//
Процедура МаркиПередУдалением(Форма, Элемент, Отказ, УдаляемыеСтроки=Неопределено) Экспорт
	
	Если НЕ УдаляемыеСтроки = Неопределено Тогда
		ВыделенныеСтроки = Форма.Элементы.Марки.ВыделенныеСтроки;
		Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
			СтрокаТЧ = Форма.Объект.Марки.НайтиПоИдентификатору(ВыделеннаяСтрока);
			Если УдаляемыеСтроки.Найти(СтрокаТЧ.ИдентификаторСтроки) = Неопределено Тогда
				УдаляемыеСтроки.Добавить(СтрокаТЧ.ИдентификаторСтроки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ТоварыПередУдалением()
