// Модуль менеджера регистра "Структура иерархии номенклатуры"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ИНИЦИАЛИЗАЦИИ СЛУЖЕБНЫХ РЕКВИЗИТОВ

Функция ПолучитьТаблицыИерархии(Запрос, Уровень = 0)

	Запрос.Текст = "ВЫБРАТЬ
	|	ТабНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТабНоменклатуры.Группа КАК Справочник.Номенклатура).Родитель КАК Группа
	|ПОМЕСТИТЬ
	|	Уровень"+Формат(Уровень, "ЧГ=0")+"
	|ИЗ
	|	Уровень"+Формат(Уровень-1, "ЧН=0; ЧГ=0")+" КАК ТабНоменклатуры
	|ГДЕ
	|	(НЕ ВЫРАЗИТЬ(ТабНоменклатуры.Группа КАК Справочник.Номенклатура).Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))";
	
	Если Запрос.Выполнить().Выгрузить()[0].Количество=0 Тогда
		КоличествоУровней = Уровень-1;
	Иначе
		КоличествоУровней = ПолучитьТаблицыИерархии(Запрос, Уровень+1);
	КонецЕсли;
	
	Возврат КоличествоУровней;
	
КонецФункции

Функция ПолучитьТекстТаблицыИерархии(Номенклатура, Запрос)
	
	Если Номенклатура = Неопределено Тогда
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.Родитель КАК Группа
		|ПОМЕСТИТЬ
		|	Уровень1
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	(НЕ Номенклатура.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) И 
		|	Номенклатура.ЭтоГруппа
		|";
	Иначе
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.Родитель КАК Группа
		|ПОМЕСТИТЬ
		|	Уровень1
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа И 
		|	Номенклатура.Ссылка В ИЕРАРХИИ (&Номенклатура) И 
		|	(НЕ Номенклатура.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
		|";
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	КонецЕсли;
	
	Если Запрос.Выполнить().Выгрузить()[0].Количество = 0 Тогда
		КоличествоУровней = 0;
	Иначе
		КоличествоУровней = ПолучитьТаблицыИерархии(Запрос, 2);
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТабНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТабНоменклатуры.Группа КАК Группа,
	|	1 КАК Уровень
	|ПОМЕСТИТЬ
	|	ТабСправочника
	|ИЗ
	|	Уровень1 КАК ТабНоменклатуры";
	
	ТекстЗапросаУдаленияТаблиц = "";
	Для Итерация = 1 По КоличествоУровней Цикл
		
		ТекстУровень = Формат(Итерация+1,"ЧЦ=3; ЧДЦ=0; ЧН=0; ЧГ=0");
		
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТабНоменклатуры.Номенклатура КАК Номенклатура,
		|	ТабНоменклатуры.Группа КАК Группа,
		|	" + ТекстУровень + " КАК Уровень
		|ИЗ
		|	Уровень" + ТекстУровень + " КАК ТабНоменклатуры";
		
		ТекстЗапросаУдаленияТаблиц = ТекстЗапросаУдаленияТаблиц + "
		|УНИЧТОЖИТЬ
		|	Уровень" + ТекстУровень+"
		|;
		|";
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + ";
	|
	|УНИЧТОЖИТЬ
	|	Уровень1
	|;
	|" + ТекстЗапросаУдаленияТаблиц + "
	|ВЫБРАТЬ
	|	ТабСправочника.Номенклатура,
	|	МАКСИМУМ(ТабСправочника.Уровень) КАК Уровень
	|ПОМЕСТИТЬ
	|	ТабУровенейЭлементов
	|ИЗ
	|	ТабСправочника КАК ТабСправочника
	|СГРУППИРОВАТЬ ПО
	|	ТабСправочника.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ТабСправочника.Номенклатура КАК Номенклатура,
	|	ТабСправочника.Группа КАК Группа,
	|	ТабСправочника.Уровень КАК Порядок,
	|	ТабУровенейЭлементов.Уровень-ТабСправочника.Уровень КАК Уровень
	|ИЗ	
	|	ТабСправочника КАК ТабСправочника
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТабУровенейЭлементов КАК ТабУровенейЭлементов
	|ПО
	|	ТабСправочника.Номенклатура = ТабУровенейЭлементов.Номенклатура
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ОбновитьСтруктуруИерархииНоменклатуры(Номенклатура = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если Номенклатура = Неопределено Тогда
		НаборЗаписей = РегистрыСведений.СтруктураИерархииНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Записать(Истина);
	Иначе
		
		// Удалить все записи для текущего элемента
		НаборЗаписей = РегистрыСведений.СтруктураИерархииНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
		НаборЗаписей.Записать(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтруктураИерархииНоменклатуры.Номенклатура
		|ИЗ
		|	РегистрСведений.СтруктураИерархииНоменклатуры КАК СтруктураИерархииНоменклатуры
		|ГДЕ
		|	СтруктураИерархииНоменклатуры.Группа = &Номенклатура
		|";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			// Удалить все записи для вложенного элемента
			НаборЗаписей = РегистрыСведений.СтруктураИерархииНоменклатуры.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
			НаборЗаписей.Записать(Истина);
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТекстЗапроса = ПолучитьТекстТаблицыИерархии(Номенклатура, Запрос);
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись = РегистрыСведений.СтруктураИерархииНоменклатуры.СоздатьМенеджерЗаписи();
		НоваяЗапись.Номенклатура = Выборка.Номенклатура;
		НоваяЗапись.Группа       = Выборка.Группа;
		НоваяЗапись.Порядок      = Выборка.Порядок;
		НоваяЗапись.Уровень      = Выборка.Уровень;
		НоваяЗапись.Записать(Истина);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ОбновитьСтруктуруИерархииНоменклатуры()

// Обновляет вспомогательные данные, которые зависят от конфигурации частично.
//
// Обновляется при наличии изменений конфигурации, записанных в параметры
// ограничения доступа при обновлении базы данных на текущую версию конфигурации.
//
Процедура ОбновитьСтруктуруИерархии() Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СтруктураИерархииНоменклатуры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		ОбновитьСтруктуруИерархииНоменклатуры();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаписатьВложеннуюУпаковку(НаборИерархииУпаковок, КодМаркировкиУпаковки, КодМаркировки, УровеньРодителя, ПорядокРодителя) Экспорт
	
	НаборИерархииУпаковок.Отбор.КодМаркировки.Установить(КодМаркировки);
	НаборИерархииУпаковок.Отбор.КодМаркировкиУпаковки.Установить(КодМаркировкиУпаковки);
	НаборИерархииУпаковок.Прочитать();
	Если НаборИерархииУпаковок.Количество() = 0 Тогда
		НоваяСтрока = НаборИерархииУпаковок.Добавить();
	Иначе
		НоваяСтрока = НаборИерархииУпаковок[0];
	КонецЕсли;
	НоваяСтрока.КодМаркировки         = КодМаркировки;
	НоваяСтрока.КодМаркировкиУпаковки = КодМаркировкиУпаковки;
	НоваяСтрока.Уровень               = УровеньРодителя;
	НоваяСтрока.Порядок               = ПорядокРодителя;
	НаборИерархииУпаковок.Записать();
	
	НаборИерархииУпаковок.Отбор.КодМаркировки.Установить(КодМаркировки);
	НаборИерархииУпаковок.Отбор.КодМаркировкиУпаковки.Установить(КодМаркировки);
	НаборИерархииУпаковок.Прочитать();
	Если НаборИерархииУпаковок.Количество() = 0 Тогда
		НоваяСтрока = НаборИерархииУпаковок.Добавить();
		НоваяСтрока.КодМаркировки         = КодМаркировки;
		НоваяСтрока.КодМаркировкиУпаковки = КодМаркировки;
		НоваяСтрока.Уровень               = УровеньРодителя+1;
		НоваяСтрока.Порядок               = ПорядокРодителя-1;
		НаборИерархииУпаковок.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты регистра
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли