////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
// Функция преобразовывает номер телефона
//
// Параметры:
//	НомерТелефона	- Строка	- Номер телефона
//
// Возвращаемое значение:
//	Строка	- Преобразованный номер
//
Функция ПреобразоватьНомерТелефона(НомерТелефона) 
	Результат = Прав(сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона), Константы.сфпПоследниеЦифрыТелефонногоНомера.Получить());
	Возврат Результат;
КонецФункции // ПреобразоватьНомерТелефона()	

&НаСервереБезКонтекста
// Функция преобразовывает номер телефона
//
// Параметры:
//	НомерТелефона	- Строка	- Номер телефона
//
// Возвращаемое значение:
//	Строка	- Преобразованный номер
//
Функция ПреобразоватьНомерВнТелефона(НомерТелефона) 
	Результат = Прав(сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(НомерТелефона), Константы.сфпМаксимальнаяДлинаВнутреннихНомеров.Получить());
	Возврат Результат;
КонецФункции // ПреобразоватьНомерВнТелефона()	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Пользователь") Тогда
		Запись.Пользователь = Параметры.Пользователь;
	КонецЕсли;	
	Если Параметры.Свойство("НомерВнТелефона") Тогда
		Запись.НомерВнТелефона = Параметры.НомерВнТелефона;
	КонецЕсли;	
	Если Параметры.Свойство("Контакт") Тогда
		Запись.Контакт = Параметры.Контакт;
	КонецЕсли;	
	Если Параметры.Свойство("НомерТелефона") Тогда
		Запись.НомерТелефона = Параметры.НомерТелефона;
	КонецЕсли;	
	Если Параметры.Свойство("ОтборПоПользователю") Тогда
		Запись.Пользователь = Параметры.ОтборПоПользователю;
		ЭтотОбъект.Элементы.Пользователь.ТолькоПросмотр = Истина;
	КонецЕсли;	
	Если Параметры.Свойство("ОтборПоКонтакту") Тогда
		Запись.Контакт = Параметры.ОтборПоКонтакту;
		ЭтотОбъект.Элементы.Контакт.ТолькоПросмотр = Истина;
	КонецЕсли;	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Процедура - обработчик события формы "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если (НЕ ЗначениеЗаполнено(Запись.Пользователь) И НЕ ЗначениеЗаполнено(Запись.НомерВнТелефона) 
		И НЕ ЗначениеЗаполнено(Запись.Контакт) И НЕ ЗначениеЗаполнено(Запись.НомерТелефона)) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо заполнить хотя бы одно значение.'"));
		Отказ = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(Запись.НомерВнТелефона) Тогда
		Запись.НомерВнТелефона = ПреобразоватьНомерВнТелефона(Запись.НомерВнТелефона);
	КонецЕсли;	
	Если ЗначениеЗаполнено(Запись.НомерТелефона) Тогда
		Запись.НомерТелефона = ПреобразоватьНомерТелефона(Запись.НомерТелефона);
	КонецЕсли;	
КонецПроцедуры // ПередЗаписью()
