// Модуль менеджера справочника "Типы цен"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	МенеджерВалюты = Справочники.Валюты;
	ОснВалютаРуб = МенеджерВалюты.НайтиПоКоду("643");
	
	Если НЕ ЗначениеЗаполнено(ОснВалютаРуб) Тогда
		
		Объект = Справочники.Валюты.СоздатьЭлемент();
		Объект.НаименованиеПолное        = НСтр("ru = 'Российский рубль'");
		Объект.Код                       = "643";
		Объект.Наименование              = "RUB";
		Объект.ЗагружаетсяИзИнтернета    = ЛОЖЬ;
		Объект.СпособУстановкиКурса      = Перечисления.СпособыУстановкиКурсаВалюты.РучнойВвод;
		Объект.ПараметрыПрописиНаРусском = НСтр("ru = 'рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2 знака'");
		Объект.Записать();
		
		ОснВалютаРуб = Объект.Ссылка;
		
		Запись = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
		Запись.Валюта    = ОснВалютаРуб;
		Запись.Период    = '19800101';
		Запись.Курс      = 1;
		Запись.Кратность = 1;
		Запись.Записать();
		
	КонецЕсли;
	
	// Заполнение основного типа цен закупки
	ТипыЦенОсновнойТипЦенЗакупки = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки.ПолучитьОбъект();
	
	// Перезаполняем реквизиты
	ТипыЦенОсновнойТипЦенЗакупки.ВалютаЦены = ОснВалютаРуб;
	ТипыЦенОсновнойТипЦенЗакупки.Закупка = Истина;
	ТипыЦенОсновнойТипЦенЗакупки.Точность = 2;
	ТипыЦенОсновнойТипЦенЗакупки.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоНоменклатуре;
	
	НовыйЭлемент = ТипыЦенОсновнойТипЦенЗакупки.ЭтоНовый();
	Если ТипыЦенОсновнойТипЦенЗакупки.Модифицированность() Тогда
		Попытка
			ТипыЦенОсновнойТипЦенЗакупки.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Типы цен"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Создан","Обновлен"), СокрЛП(ТипыЦенОсновнойТипЦенЗакупки.Наименование));
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// Заполнение основного типа цен продажи
	ТипыЦенОсновнойТипЦенПродажи = Справочники.ТипыЦен.ОсновнойТипЦенПродажи.ПолучитьОбъект();
	
	// перезаполняем реквизиты
	ТипыЦенОсновнойТипЦенПродажи.ВалютаЦены = ОснВалютаРуб;
	ТипыЦенОсновнойТипЦенПродажи.Продажа = Истина;
	ТипыЦенОсновнойТипЦенПродажи.Точность = 2;
	ТипыЦенОсновнойТипЦенПродажи.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоНоменклатуре;
	
	// Сохранение справочника
	НовыйЭлемент = ТипыЦенОсновнойТипЦенПродажи.ЭтоНовый();
	Если ТипыЦенОсновнойТипЦенПродажи.Модифицированность() Тогда
		Попытка
			ТипыЦенОсновнойТипЦенПродажи.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Типы цен"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Создан","Обновлен"), СокрЛП(ТипыЦенОсновнойТипЦенПродажи.Наименование));
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// Заполнение нормативного типа цен
	ТипыЦенНормативнаяЦена = Справочники.ТипыЦен.НормативнаяЦена.ПолучитьОбъект();
	
	// перезаполняем реквизиты
	ТипыЦенНормативнаяЦена.ВалютаЦены = ОснВалютаРуб;
	ТипыЦенНормативнаяЦена.Закупка = Истина;
	ТипыЦенНормативнаяЦена.Точность = 2;
	ТипыЦенНормативнаяЦена.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоНоменклатуре;
	
	НовыйЭлемент = ТипыЦенНормативнаяЦена.ЭтоНовый();
	Если ТипыЦенНормативнаяЦена.Модифицированность() Тогда
		Попытка
			ТипыЦенНормативнаяЦена.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Типы цен"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Создан","Обновлен"), СокрЛП(ТипыЦенНормативнаяЦена.Наименование));
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	
	Если НЕ Объект.ЭтоГруппа Тогда //siniko
		ОбязательныеРеквизиты.Добавить("АлгоритмПолученияЦены");
		Если ПолучитьФункциональнуюОпцию("ИспользоватьМноговалютныйУчет") И НЕ Объект.ВВалютеУчета Тогда
			ОбязательныеРеквизиты.Добавить("ВалютаЦены");
		КонецЕсли;
		Если Объект.Рассчитывается Тогда
			ОбязательныеРеквизиты.Добавить("БазовыйТипЦен");
		КонецЕсли;
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	УникальныеПроцентыСкидкиНаценки=Новый Массив();
	УникальныеПроцентыСкидкиНаценки.Добавить("ЦеноваяГруппа"); //siniko
	Если НЕ Объект.ЭтоГруппа И ПолучитьФункциональнуюОпцию("ИспользоватьЦеновыеГруппы") Тогда
		УникальныеРеквизиты.Вставить("ПроцентыСкидкиНаценки",УникальныеПроцентыСкидкиНаценки);
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Рассчитывается");
	Результат.Добавить("БазовыйТипЦен");
	Результат.Добавить("ВалютаЦены");
	Результат.Добавить("ВВалютеУчета");
	Результат.Добавить("ЦенаВключаетНДС");
	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ


// Обработчик события возникающего при изменении данных реквизита "Расчет цен".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура РасчетЦенПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.Рассчитывается И  Объект.РегистрироватьЦеныПоПриходу Тогда
		 Объект.РегистрироватьЦеныПоПриходу = Ложь;
	КонецЕсли;
	
КонецПроцедуры // РасчетЦенПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Базовый тип цен".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура БазовыйТипЦенПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	ТекБазовыйТипЦен = Объект.БазовыйТипЦен;
	Пока ЗначениеЗаполнено(ТекБазовыйТипЦен) Цикл
		Если Объект.Ссылка = ТекБазовыйТипЦен Тогда
			ВывестиСообщение(НСтр("ru = 'Текущий тип цен не может быть базовым самому себе.'"),Объект.Ссылка,"БазовыйТипЦен");
		КонецЕсли; 
		ТекБазовыйТипЦен = ТекБазовыйТипЦен.БазовыйТипЦен;
	КонецЦикла; 
	
КонецПроцедуры // БазовыйТипЦенПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "В валюте учета".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВВалютеУчетаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.ВВалютеУчета Тогда
		Если ЗначениеЗаполнено(Объект.ВалютаЦены) Тогда
			Объект.ВалютаЦены = Справочники.Валюты.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ВВалютеУчетаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Закупка".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ЗакупкаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.Закупка Тогда
		Если Объект.ВключатьВПрайсЛист Тогда
			Объект.ВключатьВПрайсЛист = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ЗакупкаПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли