////////////////////////////////////////////////////////////////////////////////////////
// СопоставлениеНоменклатурыКонтрагентовСлужебныйКлиент:
// механизм сопоставления номенклатуры контрагентов с номенклатурой информационной базы.
//
///////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

//++ Локализация

Процедура ВывестиСообщениеОбОшибкиСПозиционированиемНаСтрокеДокумента(НаборСопоставлений, УникальныйИдентификатор = Неопределено) Экспорт
	
	Для Каждого Сопоставление Из НаборСопоставлений Цикл
		
		Если Сопоставление.Сопоставлено Тогда
			Продолжить;
		ИначеЕсли ЗначениеЗаполнено(Сопоставление.НоменклатураКонтрагента)
			И Сопоставление.КоличествоНоменклатурыКонтрагентов = 0 Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не совпадает сопоставление с данными документа в колонке ""%1"" в строке %2.'"),
				Сопоставление.ПредставлениеНоменклатурыКонтрагента, Сопоставление.НомерСтроки);
		Иначе
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не заполнена колонка ""%1"" в строке %2.'"),
				Сопоставление.ПредставлениеНоменклатурыКонтрагента, Сопоставление.НомерСтроки);
		КонецЕсли;
		
		ПутьКТабличнойЧасти = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
			Сопоставление.ИмяТабличнойЧасти, Сопоставление.НомерСтроки, Сопоставление.ИмяКолонкиНоменклатурыКонтрагента);
		
		СообщитьПользователюВФорму(ТекстСообщения, УникальныйИдентификатор, Сопоставление.СсылкаНаДокумент, ПутьКТабличнойЧасти, "Объект");

	КонецЦикла;
	
КонецПроцедуры

// Начинает создание номенклатуры информационной базы по данным контрагента.
//
// Параметры:
//  НаборНоменклатурыКонтрагентов - Массив             - номенклатура контрагентов, по которой нужно создать номенклатуру информационной базы.
//                                                       См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента.
//  ОповещениеОЗавершении         - ОписаниеОповещения - оповещение, которое нужно выполнить после создания номенклатуры с результатом,
//                                                       представляющим массив структур со свойствами;
//   * НоменклатураКонтрагента - Структура - элемент из параметра НаборНоменклатурыКонтрагентов, для которого создана номенклатура.
//   * НоменклатураИБ          - Структура - описание созданной номенклатуры.
//                                           См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураИнформационнойБазы.
//  Контекст - см. НовыйКонтекстСозданияНоменклатурыПоДаннымКонтрагента
//
Процедура НачатьСозданиеНоменклатурыПоДаннымКонтрагента(Знач НаборНоменклатурыКонтрагентов, Знач ОповещениеОЗавершении,
	Знач Контекст) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	СопоставлениеНоменклатурыКонтрагентовКлиентПереопределяемый.ПриСозданииНоменклатурыПоДаннымКонтрагента(
		НаборНоменклатурыКонтрагентов, ОповещениеОЗавершении, Контекст, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Новый Массив);
	КонецЕсли;
	
КонецПроцедуры

// Метод-конструктор контекста создания номенклатуры по данным контрагента
// 
// Возвращаемое значение:
//  Структура:
//   * ОграничениеТипаНоменклатуры - Неопределено,ОписаниеТипов
//   * ДополнительныеПараметрыПоиска - Произвольный - контекст, полученный из переопределяемого кода при вызове 
//     см. СопоставлениеНоменклатурыКонтрагентовКлиент.ОткрытьСопоставлениеНоменклатуры
//
Функция НовыйКонтекстСозданияНоменклатурыПоДаннымКонтрагента() Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("ОграничениеТипаНоменклатуры", Неопределено);
	Контекст.Вставить("ДополнительныеПараметрыПоиска", Неопределено);
	
	Возврат Контекст;
	
КонецФункции

Процедура ИзменитьНаФормеДокументаПометкуКомандыУчитыватьНоменклатуруВладельца(ФормаДокумента) Экспорт
	
	СвойстваEDI = ФормаДокумента.СвойстваEDI;
	ПоследняяНастройкаВСервисе             = СвойстваEDI.ДанныеДокумента.ПоследняяНастройкаВариантаУказанияНоменклатуры;
	ПараметрыНоменклатурыКонтрагентаБЭД    = ФормаДокумента.ПараметрыНоменклатурыКонтрагентаБЭД;
	КомандаУчитыватьНоменклатуруВладельца  = ФормаДокумента.Элементы[ПараметрыНоменклатурыКонтрагентаБЭД.ИмяКомандыУчитыватьВладельцаНоменклатуры];
	ПоследняяНастройка                     = ПараметрыНоменклатурыКонтрагентаБЭД.ПоследняяНастройкаВариантаУказанияНоменклатуры;
	ВариантУказанияНоменклатурыВДокументе  = ПараметрыНоменклатурыКонтрагентаБЭД.ВариантУказанияНоменклатурыВДокументе;
	ДокументИспользуетсяВОбменеEDI         = ПараметрыНоменклатурыКонтрагентаБЭД.ДокументИспользуетсяВОбменеEDI;
	ВариантУказанияНоменклатурыВОбменеEDI  = ПараметрыНоменклатурыКонтрагентаБЭД.ВариантУказанияНоменклатурыВОбменеEDI;
	ЗначениеНастройкиКонтрагентаEDI        = ПараметрыНоменклатурыКонтрагентаБЭД.ЗначениеНастройкиКонтрагентаEDI;

	РазрешеноПриниматьВТерминахПоставщика            = Неопределено;
	РазрешеноПриниматьВТерминахПоставщикаИПокупателя = Неопределено;
	
	ВариантУказанияНоменклатураКонтрагента = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.ВариантУказанияНоменклатураКонтрагента();
	ВариантУказанияНоменклатураОрганизации = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.ВариантУказанияНоменклатураОрганизации();
	
	Если ДокументИспользуетсяВОбменеEDI Тогда
		ФормаДокумента.ВариантУказанияНоменклатурыБЭД = ВариантУказанияНоменклатурыВОбменеEDI;
	ИначеЕсли ЗначениеЗаполнено(ВариантУказанияНоменклатурыВДокументе) Тогда
		ФормаДокумента.ВариантУказанияНоменклатурыБЭД = ВариантУказанияНоменклатурыВДокументе;
	Иначе
		Если ЗначениеНастройкиКонтрагентаEDI = РазрешеноПриниматьВТерминахПоставщикаИПокупателя Тогда
			Если ЗначениеЗаполнено(ПоследняяНастройкаВСервисе) Тогда
				ФормаДокумента.ВариантУказанияНоменклатурыБЭД = ПоследняяНастройка;
			Иначе
				ФормаДокумента.ВариантУказанияНоменклатурыБЭД = ВариантУказанияНоменклатураОрганизации;
			КонецЕсли;
		ИначеЕсли ЗначениеНастройкиКонтрагентаEDI = РазрешеноПриниматьВТерминахПоставщика Тогда
			ФормаДокумента.ВариантУказанияНоменклатурыБЭД = ВариантУказанияНоменклатураКонтрагента;
		ИначеЕсли ЗначениеЗаполнено(ПоследняяНастройка) Тогда
			ФормаДокумента.ВариантУказанияНоменклатурыБЭД = ПоследняяНастройка;
		Иначе
			ФормаДокумента.ВариантУказанияНоменклатурыБЭД = 
				ПараметрыНоменклатурыКонтрагентаБЭД.ВариантУказанияНоменклатурыПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	
	Если ФормаДокумента.ВариантУказанияНоменклатурыБЭД = ВариантУказанияНоменклатураОрганизации Тогда
		КомандаУчитыватьНоменклатуруВладельца.Пометка = Ложь;
	ИначеЕсли ФормаДокумента.ВариантУказанияНоменклатурыБЭД = ВариантУказанияНоменклатураКонтрагента Тогда
		КомандаУчитыватьНоменклатуруВладельца.Пометка = Истина;
	Иначе
		КомандаУчитыватьНоменклатуруВладельца.Пометка = Истина;
	КонецЕсли;
	
КонецПроцедуры

#Область ПравилаПоискаПоЧастиНаименования

// Метод-конструктор параметров формы ПравилоПоискаПоЧастиНаименования регистра сведений 
//  ПравилаПоискаПоЧастиНаименованияБЭД.
// 
// Возвращаемое значение:
//  Структура:
//   * Владелец - Неопределено,ОпределяемыйТип.ВладелецНоменклатурыБЭД
//   * ХешПоисковойСтроки - Строка
//   * Номенклатура - Неопределено,ОпределяемыйТип.НоменклатураБЭД
//   * Характеристика - Неопределено,ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД
//   * Упаковка - Неопределено,ОпределяемыйТип.УпаковкаНоменклатурыБЭД
//   * ПоисковаяСтрока - Строка
//   * ОбязательноеЗаполнениеХарактеристики - Неопределено,Булево
//   * Ключ - РегистрСведенийКлючЗаписи.ПравилаПоискаПоЧастиНаименованияБЭД
//   * ОграничениеТипаНоменклатуры - ОписаниеТипов
//
Функция ПараметрыОткрытияФормыПравилоПоискаПоЧастиНаименования() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Владелец", Неопределено);
	Результат.Вставить("ХешПоисковойСтроки", "");
	Результат.Вставить("Номенклатура", Неопределено);
	Результат.Вставить("Характеристика", Неопределено);
	Результат.Вставить("Упаковка", Неопределено);
	Результат.Вставить("ПоисковаяСтрока", "");
	Результат.Вставить("ОбязательноеЗаполнениеХарактеристики", Неопределено);
	Результат.Вставить("Ключ", Новый("РегистрСведенийКлючЗаписи.ПравилаПоискаПоЧастиНаименованияБЭД"));
	Результат.Вставить("ОграничениеТипаНоменклатуры", Новый ОписаниеТипов());
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

//-- Локализация

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Локализация

// Формирует и выводит сообщение, которое может быть связано с элементом 
// управления формы.
//
// Параметры:
//  ИдентификаторНазначения    - УникальныйИдентификатор, Неопределено - уникальный идентификатор формы для показа сообщения.
//  ТекстСообщенияПользователю - Строка - текст сообщения.
//  КлючДанных                 - ЛюбаяСсылка - объект или ключ записи информационной базы, к которому это сообщение относится.
//  Поле                       - Строка - наименование реквизита формы.
//  ПутьКДанным                - Строка - путь к данным (путь к реквизиту формы).
//  Отказ                      - Булево - выходной параметр, всегда устанавливается в значение Истина.
//
// Примеры : см ОбщегоНазначенияКлиентСервер.СообщитьПользователю.
//
Процедура СообщитьПользователюВФорму(
		Знач ТекстСообщенияПользователю,
		Знач ИдентификаторНазначения,
		Знач КлючДанных,
		Знач Поле = "",
		Знач ПутьКДанным = "",
		Отказ = Ложь)
	
	Сообщение = Новый СообщениеПользователю;
	Если ИдентификаторНазначения <> Неопределено Тогда
		Сообщение.ИдентификаторНазначения = ИдентификаторНазначения;
	КонецЕсли;
	
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	Сообщение.КлючДанных = КлючДанных;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
		
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры

//-- Локализация

#КонецОбласти

