#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область КлиентЭДО

#Область ОбменСКонтрагентами

#Область ОбработкаСобытий

// Обработка события "После загрузки подтверждения по счету фактуре".
// 
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//  ДокументыПодтверждения - См. ЭлектронныеДокументыЭДОСобытия.ПослеЗагрузкиПодтвержденияПоСчетуФактуре.ДокументыПодтверждения
Процедура ПослеЗагрузкиПодтвержденияПоСчетуФактуре(ЭлектронныйДокумент, ДокументыПодтверждения) Экспорт
	
	ТекущееПодтверждение = ДокументыПодтверждения.Найти(Истина, "Текущий");
	Если ТекущееПодтверждение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипЭлементаРегламента = ТекущееПодтверждение.ТипЭлементаРегламента;
	Если ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДП Тогда
		ТипСобытия = Перечисления.ТипыСобытийДокументаЦентраЭДО.ПослеПолученияПоСчетуФактуреПДП;
	ИначеЕсли ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ПДО Тогда
		ТипСобытия = Перечисления.ТипыСобытийДокументаЦентраЭДО.ПослеПолученияПоСчетуФактуреПДО;
	ИначеЕсли ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИОП Тогда
		ТипСобытия = Перечисления.ТипыСобытийДокументаЦентраЭДО.ПослеПолученияПоСчетуФактуреИОП;
	ИначеЕсли ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИОП_ПДП Тогда
		ТипСобытия = Перечисления.ТипыСобытийДокументаЦентраЭДО.ПослеПолученияПоСчетуФактуреИОП_ПДО;
	Иначе
		Возврат;
	КонецЕсли;
	
	МеткиВремениДанныхЭДО.ЗафиксироватьСобытиеДокументаЭДО(ЭлектронныйДокумент, ТипСобытия);
	
КонецПроцедуры

// Обработка события "После формирования электронного документа".
// 
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Процедура ПослеФормированияЭлектронногоДокумента(ЭлектронныйДокумент) Экспорт
	
	МеткиВремениДанныхЭДО.ЗафиксироватьСобытиеДокументаЭДО(ЭлектронныйДокумент,
		Перечисления.ТипыСобытийДокументаЦентраЭДО.ПослеФормирования);
	
КонецПроцедуры

// Обработка события "После загрузки нового электронного документа".
// 
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Процедура ПослеЗагрузкиНовогоЭлектронногоДокумента(ЭлектронныйДокумент) Экспорт
	
	МеткиВремениДанныхЭДО.ЗафиксироватьСобытиеДокументаЭДО(ЭлектронныйДокумент,
		Перечисления.ТипыСобытийДокументаЦентраЭДО.ПослеЗагрузки);
	
КонецПроцедуры

// Обработка события "После утверждения электронного документа".
// 
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Процедура ПослеУтвержденияЭлектронногоДокумента(ЭлектронныйДокумент) Экспорт
	
	МеткиВремениДанныхЭДО.ЗафиксироватьСобытиеДокументаЭДО(ЭлектронныйДокумент,
		Перечисления.ТипыСобытийДокументаЦентраЭДО.ПослеУтверждения);
	
КонецПроцедуры

// Обработка события "После подписания электронного документа".
// 
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Процедура ПослеПодписанияЭлектронногоДокумента(ЭлектронныйДокумент) Экспорт
	
	МеткиВремениДанныхЭДО.ЗафиксироватьСобытиеДокументаЭДО(ЭлектронныйДокумент,
		Перечисления.ТипыСобытийДокументаЦентраЭДО.ПослеПодписания);
	
КонецПроцедуры

// Обработка события "После завершения обмена электронным документом".
// 
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Процедура ПослеЗавершенияОбменаЭлектроннымДокументом(ЭлектронныйДокумент) Экспорт
	
	МеткиВремениДанныхЭДО.ЗафиксироватьСобытиеДокументаЭДО(ЭлектронныйДокумент,
		Перечисления.ТипыСобытийДокументаЦентраЭДО.ПослеЗавершенияОбмена);
	
КонецПроцедуры

// Обработка события "После аннулирования электронного документа".
// 
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Процедура ПослеАннулированияЭлектронногоДокумента(ЭлектронныйДокумент) Экспорт
	
	МеткиВремениДанныхЭДО.ЗафиксироватьСобытиеДокументаЭДО(ЭлектронныйДокумент,
		Перечисления.ТипыСобытийДокументаЦентраЭДО.ПослеАннулирования);
	
КонецПроцедуры

// Обработка события "После загрузки информации получателя по акту сверки взаиморасчетов".
// 
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Процедура ПослеЗагрузкиИнформацииПолучателяПоАктуСверкиВзаиморасчетов(ЭлектронныйДокумент) Экспорт
	
	МеткиВремениДанныхЭДО.ЗафиксироватьСобытиеДокументаЭДО(ЭлектронныйДокумент,
		Перечисления.ТипыСобытийДокументаЦентраЭДО.ПослеЗагрузкиИнформацииПолучателяПоАктуСверкиВзаиморасчетов);
	
КонецПроцедуры

// Обработка события "После загрузки дополнительных сведений по акту о расхождениях".
// 
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Процедура ПослеЗагрузкиДополнительныхСведенийПоАктуОРасхождениях(ЭлектронныйДокумент) Экспорт
	
	МеткиВремениДанныхЭДО.ЗафиксироватьСобытиеДокументаЭДО(ЭлектронныйДокумент,
		Перечисления.ТипыСобытийДокументаЦентраЭДО.ПослеЗагрузкиДополнительныхСведенийПоАктуОРасхождениях);
	
КонецПроцедуры

#КонецОбласти // ОбработкаСобытий

#КонецОбласти // ОбменСКонтрагентами

#Область УправлениеДоступом

// Устанавливает служебному пользователю центра ЭДО права доступа к API области данных.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь, которому нужно установить права.
//
Процедура УстановитьДоступКAPIДляСлужебногоПользователяЦентраЭДО(Пользователь) Экспорт

	РольУдаленныйДоступПередачаДанных = Метаданные.Роли.Найти("УдаленныйДоступПередачаДанных");
	
	Если РольУдаленныйДоступПередачаДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ"));
	
	Если ПользовательИБ.Роли.Содержит(РольУдаленныйДоступПередачаДанных) Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательИБ.Роли.Добавить(РольУдаленныйДоступПередачаДанных);
	
	Если ОбщегоНазначенияБЭД.ЭтоРежимЦентрЭДО() Тогда
		НаборРолейСлужебногоПользования = РолиСлужебногоПользователя();
		Для Каждого НаименованиеРоли Из НаборРолейСлужебногоПользования Цикл
			Роль = Метаданные.Роли.Найти(НаименованиеРоли);
			Если Роль = Неопределено Или ПользовательИБ.Роли.Содержит(Роль) Тогда
				Продолжить;
			КонецЕсли;
			
			ПользовательИБ.Роли.Добавить(Роль);
		КонецЦикла;
	КонецЕсли;

	ПользовательИБ.Записать();
	
КонецПроцедуры

// Снимает у служебного пользователя центра ЭДО права доступа к API области данных.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь, у которого нужно снять права.
//
Процедура СнятьДоступКAPIДляСлужебногоПользователяЦентраЭДО(Пользователь) Экспорт
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ"));
	ПользовательИБ.Роли.Очистить();
	ПользовательИБ.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаЗагрузкаДанных

// См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки
// 
// Параметры:
//  Типы - См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки.Типы
Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы) Экспорт
	
	Типы.Добавить(Метаданные.РегистрыСведений.ЗаявкиНаРегистрациюВЭДО);
	Типы.Добавить(Метаданные.РегистрыСведений.СертификатыЗаявокНаРегистрациюВЭДО);
	
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииОбработчиковУстановкиПараметровСеанса
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	
	Обработчики.Вставить("РежимЗагрузкиДанныхВЦентрЭДО", "ЦентрЭДО.УстановитьПараметрыСеанса");
	
КонецПроцедуры

// Процедура устанавливает значения параметров сеанса.
//
// Параметры:
//  ИмяПараметра  - Строка
//  УстановленныеПараметры - Массив из Строка
//
Процедура УстановитьПараметрыСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
	
	Если ИмяПараметра = "РежимЗагрузкиДанныхВЦентрЭДО" Тогда
		ПараметрыСеанса.РежимЗагрузкиДанныхВЦентрЭДО = Ложь;
		УстановленныеПараметры.Добавить("РежимЗагрузкиДанныхВЦентрЭДО");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти // КлиентЭДО

#КонецОбласти

// Использовать.
// 
// Возвращаемое значение:
//  Булево - Использовать
Функция Использовать() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьРежимЦентрЭДО");
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Подсистема

#Область ОбщегоНазначения

// Возвращаемое значение:
//  Строка
Функция ИмяПодсистемы() Экспорт
	Возврат "ЦентрЭДО";
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ПредставлениеПодсистемы() Экспорт
	Возврат НСтр("ru = 'Центр ЭДО'");
КонецФункции

#КонецОбласти

// Возвращаемое значение:
//  Булево
Функция ИспользоватьРежимЦентрЭДО() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьРежимЦентрЭДО");
КонецФункции

#КонецОбласти

#Область СлужебныйПользователь

// Возвращаемое значение:
//  См. НовыйРезультатСозданияСлужебногоПользователя
Функция СоздатьСлужебногоПользователя() Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		РезультатСоздания = СоздатьСлужебногоПользователяЧерезМенеджерСервиса();
	Иначе
		РезультатСоздания = СоздатьСлужебногоПользователяЛокально();
	КонецЕсли;
	
	Возврат РезультатСоздания;
	
КонецФункции

// Возвращаемое значение:
//  Неопределено,Произвольный,Структура:
//  * Логин - Строка
//  * Пароль - Строка
Функция ДанныеАутентификацииСлужебногоПользователя() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ДанныеАутентификации = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ИдентификаторДанныхАутентификацииСлужебногоПользователя(), "Логин, Пароль"); // См. НовыеДанныеАутентификацииСлужебногоПользователя
	Возврат ДанныеАутентификации;
КонецФункции

// Возвращаемое значение:
//  Булево
Функция АвторизованСлужебныйПользователь() Экспорт
	
	ДанныеАутентификации = ДанныеАутентификацииСлужебногоПользователя();
	Если Не ЗначениеЗаполнено(ДанныеАутентификации) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ДанныеАутентификации.Логин = ИмяПользователя();
	
КонецФункции

#КонецОбласти

#Область СопоставлениеОбъектов

// Параметры:
//  Ссылка - ЛюбаяСсылка
// 
// Возвращаемое значение:
//  Строка
Функция ИдентификаторОбъекта(Ссылка) Экспорт
	
	Возврат Строка(Ссылка.УникальныйИдентификатор());
	
КонецФункции

#КонецОбласти

#Область ОбработкаОшибок

// Возвращаемое значение:
//  Структура:
//  * Тип - Строка
//  * Кратко - Строка
//  * Подробно - Строка
Функция НоваяОшибкаВФорматеСервиса() Экспорт
	
	Ошибка = Новый Структура;
	Ошибка.Вставить("Тип", "");
	Ошибка.Вставить("Кратко", "");
	Ошибка.Вставить("Подробно", "");
	Возврат Ошибка;
	
КонецФункции

// Параметры:
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Тип - Строка
//  * Кратко - Строка
//  * Подробно - Строка
Функция ВыгрузитьОшибкиВФорматеСервиса(КонтекстДиагностики) Экспорт
	
	ОшибкиВФорматеСервиса = Новый Массив; // См. ВыгрузитьОшибкиВФорматеСервиса
	
	Ошибки = ОбработкаНеисправностейБЭДКлиентСервер.ПолучитьОшибки(КонтекстДиагностики);
	Для Каждого Ошибка Из Ошибки Цикл
		
		ОшибкаВФорматеСервиса = НоваяОшибкаВФорматеСервиса();
		ОшибкаВФорматеСервиса.Тип = Ошибка.ВидОшибки.Идентификатор;
		ОшибкаВФорматеСервиса.Кратко = Ошибка.КраткоеПредставлениеОшибки;
		ОшибкаВФорматеСервиса.Подробно = Ошибка.ПодробноеПредставлениеОшибки;
		ОшибкиВФорматеСервиса.Добавить(ОшибкаВФорматеСервиса);
		
	КонецЦикла;
	
	Возврат ОшибкиВФорматеСервиса;
	
КонецФункции

// Параметры:
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//  ВидОперации - Строка
//  КраткоеПредставление - Строка
//  ПодробноеПредставление - Строка
Процедура ДобавитьНеизвестнуюОшибку(КонтекстДиагностики, ВидОперации, КраткоеПредставление,
	ПодробноеПредставление = "") Экспорт
	
	Если ПустаяСтрока(ПодробноеПредставление) Тогда
		ПодробноеПредставление = КраткоеПредставление;
	КонецЕсли;
	
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
		ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
		КраткоеПредставление, ПодробноеПредставление);
	
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ИмяПодсистемы());
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Если Не ВнешнееСоединение Тогда

#Область УдаленныйВызовМетода

// Удаленный вызов метода.
// 
// Параметры:
//  Запрос - HTTPСервисЗапрос
// 
// Возвращаемое значение:
//  HTTPСервисОтвет
Функция УдаленныйВызовМетода(Запрос) Экспорт
	
	Попытка
		
		ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
		
		ЗаписатьВызовСервисаВЖурналРегистрации(Запрос, ИдентификаторЗапроса);
		
		ОтветHTTP = ВыполнитьЗапрос(Запрос, ИдентификаторЗапроса);
		
	Исключение
		Ошибка = ОшибкаЗапроса(ТипОшибкиЗапросаВнутренняяОшибкаСервера(),
			НСтр("ru = 'Внутренняя ошибка сервера'"), ИнформацияОбОшибке());
		ОтветHTTP = ОтветПоОшибкеЗапроса(Ошибка, ИдентификаторЗапроса);
	КонецПопытки;
	
	ЗаписатьОтветСервисаВЖурналРегистрации(ОтветHTTP, ИдентификаторЗапроса, ВремяНачала);
	
	Возврат ОтветHTTP;
	
КонецФункции

// Параметры:
//  Запрос - HTTPСервисЗапрос
//  ИдентификаторЗапроса - Строка
// 
// Возвращаемое значение:
//  HTTPСервисОтвет
Функция ВыполнитьЗапрос(Запрос, ИдентификаторЗапроса)
	
	ТипКонтентаЗапроса = ТипКонтентаЗапроса(Запрос);
	Ошибка = ПроверитьТипКонтентаЗапроса(ТипКонтентаЗапроса);
	Если ЗначениеЗаполнено(Ошибка) Тогда
		Возврат ОтветПоОшибкеЗапроса(Ошибка, ИдентификаторЗапроса);
	КонецЕсли;
	
	Если Запрос.HTTPМетод = "POST" Тогда
		РезультатЧтенияЗапроса = ПрочитатьОписанияМетодовИзТелаЗапроса(Запрос);
	ИначеЕсли Запрос.HTTPМетод = "GET" Тогда 
		РезультатЧтенияЗапроса = ПрочитатьОписанияМетодовИзПараметровЗапроса(Запрос);
	Иначе
		РезультатЧтенияЗапроса = НовыйРезультатЧтенияОписанияМетодовИзЗапроса();
		РезультатЧтенияЗапроса.Ошибка = ОшибкаЗапроса(ТипОшибкиЗапросаНеНайдено(),
			НСтр("ru = 'Переданный http метод не поддерживается'"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатЧтенияЗапроса.ОписанияМетодов) Тогда
		ИнициализироватьПараметрыСеанса();
		Версия = ТипКонтентаЗапроса.Версия;
		РезультатыМетодов = ВыполнитьМетодыЗапроса(РезультатЧтенияЗапроса.ОписанияМетодов, Версия,
			ИдентификаторЗапроса);
		ОтветHTTP = ОтветПоРезультатамМетодов(РезультатыМетодов, РезультатЧтенияЗапроса.ЭтоПакетМетодов, Версия);
	ИначеЕсли ЗначениеЗаполнено(РезультатЧтенияЗапроса.Ошибка) Тогда
		ОтветHTTP = ОтветПоОшибкеЗапроса(РезультатЧтенияЗапроса.Ошибка, ИдентификаторЗапроса);
	Иначе
		Ошибка = ОшибкаЗапроса(ТипОшибкиЗапросаОшибкаДанных(), НСтр("ru='Некорректный запрос'"));
		ОтветHTTP = ОтветПоОшибкеЗапроса(Ошибка, ИдентификаторЗапроса);
	КонецЕсли;
	
	Возврат ОтветHTTP;
	
КонецФункции

// Параметры:
//  Запрос - HTTPСервисЗапрос
// 
// Возвращаемое значение:
//  Неопределено,Структура:
//  * Тип - Строка
//  * Версия - Строка
Функция ТипКонтентаЗапроса(Запрос)
	
	ЗначениеЗаголовкаТипКонтента = Запрос.Заголовки[ИмяЗаголовкаТипПередаваемогоКонтента()];
	Если Не ЗначениеЗаполнено(ЗначениеЗаголовкаТипКонтента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СекцииОписанияТипа = СтрРазделить(ЗначениеЗаголовкаТипКонтента, ";", Ложь);
	
	Результат = Новый Структура("Тип, Версия", СекцииОписанияТипа[0], "");
	
	Если СекцииОписанияТипа.Количество() = 1 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Позиция = СтрНайти(СекцииОписанияТипа[1], "version=");
	Если Позиция = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДлинаИмениПараметраВерсия = 8;
	
	Результат.Версия = СокрП(Сред(СекцииОписанияТипа[1], Позиция + ДлинаИмениПараметраВерсия));
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ИмяЗаголовкаТипПередаваемогоКонтента()
	Возврат "Content-Type";
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ПоддерживаемыйТипКонтентаЗапроса()
	Возврат "vnd.1cedo.rpc+json";
КонецФункции

// Параметры:
//  ТипКонтента - см. ТипКонтентаЗапроса
// 
// Возвращаемое значение:
//  - Неопределено
//  - См. ОшибкаЗапроса
Функция ПроверитьТипКонтентаЗапроса(ТипКонтента)
		
	Если Не ЗначениеЗаполнено(ТипКонтента) Тогда
		Ошибка = ОшибкаЗапроса(ТипОшибкиЗапросаКонтентНеПоддерживается(),
			НСтр("ru = 'Заголовок Content-Type не указан'"));
		Возврат Ошибка;
	КонецЕсли;
	
	Если ТипКонтента.Тип <> ПоддерживаемыйТипКонтентаЗапроса() Тогда
		Ошибка = ОшибкаЗапроса(ТипОшибкиЗапросаКонтентНеПоддерживается(),
			НСтр("ru = 'Переданный Content-Type не поддерживается'"));
		Возврат Ошибка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипКонтента.Версия) Тогда
		Ошибка = ОшибкаЗапроса(ТипОшибкиЗапросаКонтентНеПоддерживается(),
			НСтр("ru = 'Не указана версия переданного Content-Type'"));
		Возврат Ошибка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * Ошибка - Неопределено
//           - см. НоваяОшибкаЗапроса
//  * ОписанияМетодов - Массив из см. НовоеОписаниеМетодаСервиса
//  * ЭтоПакетМетодов - Булево
Функция НовыйРезультатЧтенияОписанияМетодовИзЗапроса()
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", Неопределено);
	Результат.Вставить("ОписанияМетодов", Новый Массив);
	Результат.Вставить("ЭтоПакетМетодов", Ложь);
	Возврат Результат;
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * method - Строка - имя метода.
//  * params - Массив из Структура - параметры метода.
//  * id - Число - идентификатор метода.
Функция НовоеОписаниеМетодаСервиса()
	ОписаниеМетода = Новый Структура;
	ОписаниеМетода.Вставить("method", "");
	ОписаниеМетода.Вставить("params", Новый Массив);
	ОписаниеМетода.Вставить("id", 0);
	Возврат ОписаниеМетода;
КонецФункции

// Параметры:
//  Запрос - HTTPСервисЗапрос
// 
// Возвращаемое значение:
//  См. НовыйРезультатЧтенияОписанияМетодовИзЗапроса
Функция ПрочитатьОписанияМетодовИзТелаЗапроса(Запрос)
	
	Результат = НовыйРезультатЧтенияОписанияМетодовИзЗапроса();
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	Если Не ЗначениеЗаполнено(ТелоЗапроса) Тогда
		Результат.Ошибка = ОшибкаЗапроса(ТипОшибкиЗапросаОшибкаДанных(), НСтр("ru='Пустое тело запроса'"));
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		Результат.ОписанияМетодов = ОбщегоНазначения.JSONВЗначение(ТелоЗапроса,,Ложь);
	Исключение
		Результат.Ошибка = ОшибкаЗапроса(ТипОшибкиЗапросаОшибкаДанных(),
			НСтр("ru='Не удалость прочитать переданное тело запроса.'"), ИнформацияОбОшибке());
		Возврат Результат;
	КонецПопытки;
	
	Если ТипЗнч(Результат.ОписанияМетодов) = Тип("Массив") Тогда
		Результат.ЭтоПакетМетодов = Истина;
	Иначе
		Результат.ОписанияМетодов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Результат.ОписанияМетодов);
	КонецЕсли;
	
	Для Каждого ОписаниеМетода Из Результат.ОписанияМетодов Цикл
		ЗначениеСвойства = Неопределено;
		Если Не (ОписаниеМетода.Свойство("method", ЗначениеСвойства) И ЗначениеЗаполнено(ЗначениеСвойства)
			И ОписаниеМетода.Свойство("params")
			И ОписаниеМетода.Свойство("id", ЗначениеСвойства) И ЗначениеСвойства <> Неопределено) Тогда
			Результат.Ошибка = ОшибкаЗапроса(ТипОшибкиЗапросаОшибкаДанных(),
				НСтр("ru='Запрос не соответствует спецификации json-rpc 1.0.'"));
			Результат.ОписанияМетодов = Неопределено;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ПараметрыЗапроса - Соответствие из КлючИЗначение - Параметры запроса
// 
// Возвращаемое значение:
//  См. НовыйРезультатЧтенияОписанияМетодовИзЗапроса
Функция ПрочитатьОписанияМетодовИзПараметровЗапроса(ПараметрыЗапроса)
	
	Результат = НовыйРезультатЧтенияОписанияМетодовИзЗапроса();
	
	ОписаниеМетода = НовоеОписаниеМетодаСервиса();
	
	ЗначениеПараметра = ПараметрыЗапроса.Получить("method");
	Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
		ОписаниеМетода.method = РаскодироватьСтроку(ЗначениеПараметра, СпособКодированияСтроки.URLВКодировкеURL);
	Иначе
		Возврат Результат;
	КонецЕсли;
	
	ЗначениеПараметра = ПараметрыЗапроса.Получить("params");
	Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
		ПараметрыМетодаСтрокойJSON = РаскодироватьСтроку(ЗначениеПараметра, СпособКодированияСтроки.URLВКодировкеURL);
		ОписаниеМетода.params = ОбщегоНазначения.JSONВЗначение(ПараметрыМетодаСтрокойJSON,,Ложь);
	Иначе
		Возврат Результат;
	КонецЕсли;
	
	ЗначениеПараметра = ПараметрыЗапроса.Получить("id");
	Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
		ОписаниеМетода.id = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ЗначениеПараметра);
	Иначе
		Возврат Результат;
	КонецЕсли;
	
	Результат.ОписанияМетодов.Добавить(ОписаниеМетода);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ОписанияМетодов - Массив из См. НовоеОписаниеМетодаСервиса
//  Версия - Строка
//  ИдентификаторЗапроса - Строка
// 
// Возвращаемое значение:
//  Массив из см. ВыполнитьМетод
Функция ВыполнитьМетодыЗапроса(ОписанияМетодов, Версия, ИдентификаторЗапроса)
	
	РезультатыМетодов = Новый Массив;
	Для Каждого ОписаниеМетода Из ОписанияМетодов Цикл
		РезультатМетода = ВыполнитьМетод(ОписаниеМетода, Версия, ИдентификаторЗапроса);
		РезультатыМетодов.Добавить(РезультатМетода);
	КонецЦикла;
	
	Возврат РезультатыМетодов;
	
КонецФункции

// Параметры:
//  ОписаниеМетода - См. НовоеОписаниеМетодаСервиса
//  Версия - Строка
//  ИдентификаторЗапроса - Строка
// 
// Возвращаемое значение:
//  См. НовыйРезультатМетода
Функция ВыполнитьМетод(ОписаниеМетода, Версия, ИдентификаторЗапроса)
	
	ИмяМетода = ОписаниеМетода.method;
	Параметры = ОписаниеМетода.params;
	
	ИмяМодуля = "";
	Если Версия = "3" Тогда
		ИмяМодуля = "ПрограммныйИнтерфейсЦентраЭДОВерсия3";
	ИначеЕсли Версия = "2" Тогда
		ИмяМодуля = "ПрограммныйИнтерфейсЦентраЭДОВерсия2";
	ИначеЕсли Версия = "1" Тогда
		ИмяМодуля = "ПрограммныйИнтерфейсЦентраЭДОВерсия1";
	Иначе
		Возврат РезультатМетодаОшибка(НСтр("ru='Указанная версия метода не поддерживается'"),
			КодОшибкиRPCМетодНеНайден());
	КонецЕсли;
	
	РезультатМетода = НовыйРезультатМетода();
	Попытка
		РезультатМетода.result = ОбщегоНазначения.ВызватьФункциюКонфигурации(
			ИмяМодуля + "." + ИмяМетода, Параметры);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		РезультатМетода.error = НоваяОшибкаМетода(ТекстОшибки);
		
		ИмяСобытия = ИмяСобытияЖурналаРегистрацииВыполнениеМетода();
		Уровень = УровеньЖурналаРегистрации.Ошибка;
		ОбъектМетаданных = Метаданные.HTTPСервисы.edo;
		Комментарий = СтрШаблон(НСтр("ru='Ошибка при выполнении метода: %1'"), ИмяМетода)
			+ Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных, ИдентификаторЗапроса, Комментарий);
	КонецПопытки;
	
	РезультатМетода.id = ОписаниеМетода.id;
	
	Возврат РезультатМетода;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * result - Неопределено
//           - Структура
//           - Массив из Структура
//  * error - Неопределено
//          - См. НоваяОшибкаМетода
//  * id - Число
Функция НовыйРезультатМетода()
	Результат = Новый Структура;
	Результат.Вставить("result", Неопределено);
	Результат.Вставить("error", Неопределено);
	Результат.Вставить("id", 0);
	Возврат Результат;
КонецФункции

// Параметры:
//  ТекстОшибки - Строка
//  Код - Число
// 
// Возвращаемое значение:
//  Структура:
//  * code - Число
//  * message - Строка
//  * id - Число
Функция НоваяОшибкаМетода(ТекстОшибки = "", Код = 0)
	Ошибка = Новый Структура;
	Ошибка.Вставить("code", Код);
	Ошибка.Вставить("message", ТекстОшибки);
	Ошибка.Вставить("id", 0);
	Возврат Ошибка;
КонецФункции

// Параметры:
//  ТекстОшибки - Строка
//  Код - Число
// 
// Возвращаемое значение:
//  См. НовыйРезультатМетода
Функция РезультатМетодаОшибка(ТекстОшибки, Код = 0)
	РезультатМетода = НовыйРезультатМетода();
	РезультатМетода.error = НоваяОшибкаМетода(ТекстОшибки, Код);
	Возврат РезультатМетода;
КонецФункции

// Параметры:
//  РезультатыМетодов - Массив из см. ВыполнитьМетод
//  ЭтоПакетМетодов - Булево
//  Версия - Строка
// 
// Возвращаемое значение:
//  HTTPСервисОтвет
Функция ОтветПоРезультатамМетодов(РезультатыМетодов, ЭтоПакетМетодов, Версия)
	
	Если ЭтоПакетМетодов Тогда
		Тело = ОбщегоНазначения.ЗначениеВJSON(РезультатыМетодов);
	Иначе
		Тело = ОбщегоНазначения.ЗначениеВJSON(РезультатыМетодов[0]);
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(КодСостоянияВыполнено());
	Ответ.Заголовки.Вставить(ИмяЗаголовкаТипПередаваемогоКонтента(), ПоддерживаемыйТипКонтентаОтвета(Версия));
	Ответ.УстановитьТелоИзСтроки(Тело);
	
	Возврат Ответ;
	
КонецФункции

// Параметры:
//  Версия - Строка
//
// Возвращаемое значение:
//  Строка
Функция ПоддерживаемыйТипКонтентаОтвета(Версия)
	Возврат "vnd.1cedo.rpc+json;version=" + Версия;
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ИмяСобытияЖурналаРегистрацииВыполнениеМетода()
	Возврат ПредставлениеПодсистемы() + "." + НСтр("ru = 'Выполнение метода'");
КонецФункции

#КонецОбласти

#Область ОбработкаОшибок

// Возвращаемое значение:
//  Структура:
//  * Тип - Строка
//  * Текст - Строка
//  * Информация - Неопределено,ИнформацияОбОшибке
Функция НоваяОшибкаЗапроса()
	Ошибка = Новый Структура;
	Ошибка.Вставить("Тип", "");
	Ошибка.Вставить("Текст", "");
	Ошибка.Вставить("Информация", Неопределено);
	Возврат Ошибка;
КонецФункции

// Возвращаемое значение:
//  См. НоваяОшибкаЗапроса
Функция ОшибкаЗапроса(Тип, Текст, Информация = Неопределено)
	Ошибка = НоваяОшибкаЗапроса();
	Ошибка.Тип = Тип;
	Ошибка.Текст = Текст;
	Ошибка.Информация = Информация;
	Возврат Ошибка;
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ТипОшибкиЗапросаНеНайдено()
	Возврат "NotFound";
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ТипОшибкиЗапросаКонтентНеПоддерживается()
	Возврат "UnsupportedMediaType";
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ТипОшибкиЗапросаОшибкаДанных()
	Возврат "BadRequest";
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ТипОшибкиЗапросаВнутренняяОшибкаСервера()
	Возврат "InternalServerError";
КонецФункции

// Параметры:
//  Ошибка - см. НоваяОшибкаЗапроса
//  ИдентификаторЗапроса - Строка
// 
// Возвращаемое значение:
//  HTTPСервисОтвет
Функция ОтветПоОшибкеЗапроса(Ошибка, ИдентификаторЗапроса)
	
	КодСостояния = КодСостоянияОтветаПоТипуОшибки(Ошибка.Тип);
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния, Ошибка.Текст);
	Тело = ТелоОтветаПоОшибкеЗапроса(Ответ.Причина, Ошибка.Текст, ИдентификаторЗапроса);
	Ответ.УстановитьТелоИзСтроки(Тело);
	
	Возврат Ответ;
	
КонецФункции

// Параметры:
//  Заголовок - Строка
//  Текст - Строка
//  ИдентификаторЗапроса - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ТелоОтветаПоОшибкеЗапроса(Заголовок, Текст, ИдентификаторЗапроса)
	Возврат СтрШаблон(
		"{
		|  ""type"": ""https://1cfresh.com/a/cedo"",
		|  ""title"": ""%1"",
		|  ""detail"": ""%2"",
		|  ""traceId"": ""%3""
		|}",
		Заголовок, Текст, ИдентификаторЗапроса);
КонецФункции

#КонецОбласти

#Область КодыСостоянияОтветаHTTP

// Параметры:
//  ТипОшибки - Строка:
// 
// Возвращаемое значение:
//  Число
Функция КодСостоянияОтветаПоТипуОшибки(ТипОшибки)
	
	Если ТипОшибки = ТипОшибкиЗапросаНеНайдено() Тогда
		Возврат КодСостоянияНеНайдено();
	ИначеЕсли ТипОшибки = ТипОшибкиЗапросаКонтентНеПоддерживается() Тогда
		Возврат КодСостоянияКонтентНеПоддерживается();
	ИначеЕсли ТипОшибки = ТипОшибкиЗапросаОшибкаДанных() Тогда
		Возврат КодСостоянияОшибкаДанных();
	ИначеЕсли ТипОшибки = ТипОшибкиЗапросаВнутренняяОшибкаСервера() Тогда
		Возврат КодСостоянияВнутренняяОшибка();
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru='Не найден код состояния ответа по типу ошибки ""%1"".'"), ТипОшибки);
	КонецЕсли;
	
КонецФункции

// Возвращаемое значение:
//  Число
Функция КодСостоянияВыполнено()
	Возврат 200;
КонецФункции

// Возвращаемое значение:
//  Число
Функция КодСостоянияНеНайдено()
	Возврат 404;
КонецФункции

// Возвращаемое значение:
//  Число
Функция КодСостоянияКонтентНеПоддерживается()
	Возврат 415;
КонецФункции

// Возвращаемое значение:
//  Число
Функция КодСостоянияОшибкаДанных()
	Возврат 400;
КонецФункции

// Возвращаемое значение:
//  Число
Функция КодСостоянияВнутренняяОшибка()
	Возврат 500;
КонецФункции

#КонецОбласти

#Область КодыОшибокRPC

// Возвращаемое значение:
//  Число
Функция КодОшибкиRPCМетодНеНайден()
	Возврат -32601;
КонецФункции

#КонецОбласти

#Область ЛогированиеHTTP

// Возвращаемое значение:
//  Строка
Функция ИмяСобытияЖурналаРегистрацииВызовСервиса()
	Возврат ПредставлениеПодсистемы() + "." + НСтр("ru = 'Вызов сервиса'");
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ИмяСобытияЖурналаРегистрацииОтветСервиса()
	Возврат ПредставлениеПодсистемы() + "." + НСтр("ru = 'Ответ сервиса'");
КонецФункции

// Параметры:
//  Запрос - HTTPСервисЗапрос
//  ИдентификаторЗапроса - Строка
Процедура ЗаписатьВызовСервисаВЖурналРегистрации(Запрос, ИдентификаторЗапроса)
	ИмяСобытия = ИмяСобытияЖурналаРегистрацииВызовСервиса();
	Уровень = УровеньЖурналаРегистрации.Информация;
	ОбъектМетаданных = Метаданные.HTTPСервисы.edo;
	Комментарий = ПредставлениеHTTPСервисЗапроса(Запрос);
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных, ИдентификаторЗапроса, Комментарий);
КонецПроцедуры

// Параметры:
//  Ответ - HTTPСервисОтвет
//  ИдентификаторЗапроса - Строка
//  ВремяНачала - Число - Длительность
Процедура ЗаписатьОтветСервисаВЖурналРегистрации(Ответ, ИдентификаторЗапроса, ВремяНачала)
	ИмяСобытия = ИмяСобытияЖурналаРегистрацииОтветСервиса();
	Уровень = ?(Ответ = Неопределено Или Ответ.КодСостояния >= КодСостоянияВнутренняяОшибка(),
		УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация);
	ОбъектМетаданных = Метаданные.HTTPСервисы.edo;
	Комментарий = ПредставлениеHTTPСервисОтвета(Ответ, ВремяНачала);
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных, ИдентификаторЗапроса, Комментарий);
КонецПроцедуры

// Параметры:
//  Запрос - HTTPСервисЗапрос
// 
// Возвращаемое значение:
//  Строка
Функция ПредставлениеHTTPСервисЗапроса(Запрос)
	
	Заголовки = Запрос.Заголовки;
	БазовыйURLБезПрокси = Заголовки.Получить("X-Root-URL");
	Если БазовыйURLБезПрокси <> Неопределено Тогда
		СтруктураЗапроса = ОбщегоНазначенияКлиентСервер.СтруктураURI(БазовыйURLБезПрокси);
		АдресБезПараметров = СтруктураЗапроса.ПутьНаСервере;
	Иначе
		СтруктураЗапроса = ОбщегоНазначенияКлиентСервер.СтруктураURI(Запрос.БазовыйURL);
		АдресБезПараметров = СтруктураЗапроса.ПутьНаСервере + Запрос.ОтносительныйURL;
	КонецЕсли;
	
	ПараметрыЗапроса = "";
	Для каждого ЭлементКоллекции Из Запрос.ПараметрыЗапроса Цикл
		ПараметрыЗапроса = ПараметрыЗапроса + ?(ПустаяСтрока(ПараметрыЗапроса), "?", "&")
			+ ЭлементКоллекции.Ключ + "=" + ЭлементКоллекции.Значение;
	КонецЦикла;
	
	ПредставлениеЗаголовков = ИнтернетСоединениеБЭД.ПредставлениеЗаголовковHTTPСписком(Заголовки);
	
	Представление = СтрШаблон(
		"%1 /%2%3
		|%4", Запрос.HTTPМетод, АдресБезПараметров, ПараметрыЗапроса, ПредставлениеЗаголовков);
	
	ТипКонтентаЗапроса = ТипКонтентаЗапроса(Запрос);
	Если ТипКонтентаЗапроса.Тип = ПоддерживаемыйТипКонтентаЗапроса() Тогда
		Тело = Запрос.ПолучитьТелоКакСтроку();
		Если ЗначениеЗаполнено(Тело) Тогда
			Представление = СтрШаблон(
				"%1
				|
				|%2", Представление, Тело);
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Представление;
	
КонецФункции

// Параметры:
//  Ответ - Неопределено,HTTPСервисОтвет
//  ВремяНачала - Число
// 
// Возвращаемое значение:
//  Строка
Функция ПредставлениеHTTPСервисОтвета(Ответ, ВремяНачала)
	
	Длительность = (ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала)/1000;
	
	Если Ответ = Неопределено Тогда
		ПредставлениеСостояния = "error";
	Иначе
		ПредставлениеСостояния = ИнтернетСоединениеБЭД.РасшифровкаКодаСостоянияHTTP(Ответ.КодСостояния);
	КонецЕсли;
	
	ОсновныеСвойства = СтрШаблон("%1 - %2.%3 (%4 sec)",
		ПредставлениеСостояния,
		Формат(ТекущаяДатаСеанса(), "ДФ='dd.MM.yyyy HH:mm:ss'"),
		Формат(ВремяНачала % 1000, "ЧЦ=3; ЧВН="),
		Формат(Длительность, "ЧДЦ=3; ЧН=0"));
	
	Если Ответ = Неопределено Тогда
		Возврат ОсновныеСвойства;
	КонецЕсли;
	
	ЧастиПредставления = Новый Массив; // Массив из Строка
	ЧастиПредставления.Добавить(ОсновныеСвойства);
	
	ПредставлениеЗаголовков = ИнтернетСоединениеБЭД.ПредставлениеЗаголовковHTTPСписком(Ответ.Заголовки);
	ЧастиПредставления.Добавить(ПредставлениеЗаголовков);
	
	Тело = Ответ.ПолучитьТелоКакСтроку();
	Если ЗначениеЗаполнено(Тело) Тогда
		ЧастиПредставления.Добавить("");
		ЧастиПредставления.Добавить(Тело);
	КонецЕсли;
	
	Возврат СтрСоединить(ЧастиПредставления, Символы.ПС);
	
КонецФункции

#КонецОбласти

#Область ПараметрыСеанса

Процедура ИнициализироватьПараметрыСеанса()
	
	УстановитьПривилегированныйРежим(Истина);
	УстановитьПараметрыСеансаРежимЗагрузки(Ложь);
	
КонецПроцедуры

// Параметры:
//  Значение - Булево
Процедура УстановитьПараметрыСеансаРежимЗагрузки(Значение) Экспорт
	
	ПараметрыСеанса.РежимЗагрузкиДанныхВЦентрЭДО = Значение
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли // ВнешнееСоединение

#Область СлужебныйПользователь

// Возвращаемое значение:
//  Строка
Функция ИмяСлужебногоПользователяЛокально()
	Возврат "edo_integration";
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ПолноеИмяСлужебногоПользователя()
	Возврат НСтр("ru='Служебный пользователь центра ЭДО'");
КонецФункции

// Параметры:
//  Логин - Строка
//  Пароль - Строка
// 
// Возвращаемое значение:
//  Структура:
// * Логин - Строка
// * Пароль - Строка
Функция НовыеДанныеАутентификацииСлужебногоПользователя(Логин, Пароль)
	ДанныеАутентификации = Новый Структура;
	ДанныеАутентификации.Вставить("Логин", Логин);
	ДанныеАутентификации.Вставить("Пароль", Пароль);
	Возврат ДанныеАутентификации;
КонецФункции

// Параметры:
//  ДанныеАутентификации - См. НовыеДанныеАутентификацииСлужебногоПользователя
Процедура ЗаписатьДанныеАутентификацииСлужебногоПользователя(ДанныеАутентификации)
	
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
		ИдентификаторДанныхАутентификацииСлужебногоПользователя(), ДанныеАутентификации, Неопределено);
	
КонецПроцедуры

// Возвращаемое значение:
//  Строка
Функция ИдентификаторДанныхАутентификацииСлужебногоПользователя()
	Возврат ИмяПодсистемы() + ".ДанныеАутентификацииСлужебногоПользователяОбластиДанных";
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * Пользователь - Неопределено,СправочникСсылка.Пользователи
//  * ДанныеАутентификации - Неопределено
//                         - см. НовыеДанныеАутентификацииСлужебногоПользователя
//  * ТекстОшибки - Строка
Функция НовыйРезультатСозданияСлужебногоПользователя()
	Результат = Новый Структура;
	Результат.Вставить("Пользователь", Неопределено);
	Результат.Вставить("ДанныеАутентификации", Неопределено);
	Результат.Вставить("ТекстОшибки", "");
	Возврат Результат;
КонецФункции

// Возвращаемое значение:
//  См. НовыйРезультатСозданияСлужебногоПользователя
Функция СоздатьСлужебногоПользователяЧерезМенеджерСервиса() 
	
	Результат = НовыйРезультатСозданияСлужебногоПользователя();
	
	МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
	НомерОбластиДанных = МодульРаботаВМоделиСервиса.ЗначениеРазделителяСеанса();
	Если Не ЗначениеЗаполнено(НомерОбластиДанных) Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Не удалось получить номер области данных.'");
		Возврат Результат;
	КонецЕсли;
	
	ОсновныеСвойстваОтвета = ПрограммныйИнтерфейсСервиса.НовыйОсновныеСвойстваОтвета();
	
	СвойстваПриложения = ПрограммныйИнтерфейсСервиса.СвойстваПриложения(НомерОбластиДанных, Ложь,
		ОсновныеСвойстваОтвета);
	Если ОсновныеСвойстваОтвета.КодСостояния <> 200
		Или ОсновныеСвойстваОтвета.КодОтвета <> 10200 Тогда
		Результат.ТекстОшибки = ОсновныеСвойстваОтвета.Сообщение;
		Возврат Результат;
	КонецЕсли;
	
	Если СвойстваПриложения.СостояниеПриложения <> Перечисления.СостоянияПриложений.Готово
		И СвойстваПриложения.СостояниеПриложения <> Перечисления.СостоянияПриложений.Используется Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Приложение не готово к использованию.'");
		Возврат Результат;
	КонецЕсли;
	
	Логин = ИмяСлужебногоПользователяЛокально() + "_" + Формат(НомерОбластиДанных, "ЧГ=;");
	Пароль = СгенерироватьСлучайныйПароль();
	
	ПрограммныйИнтерфейсСервиса.СвойстваПользователяАбонента(Логин, Ложь, ОсновныеСвойстваОтвета);
	Если ОсновныеСвойстваОтвета.КодСостояния <> 200 Тогда
		Результат.ТекстОшибки = ОсновныеСвойстваОтвета.Сообщение;
		Возврат Результат;
	КонецЕсли;
	
	Если ОсновныеСвойстваОтвета.КодОтвета = 10404 Тогда
		
		ПараметрыСоздания = ПрограммныйИнтерфейсСервиса.НовыйПараметрыСозданияПользователя();
		ПараметрыСоздания.Логин = Логин;
		ПараметрыСоздания.Пароль = Пароль;
		ПараметрыСоздания.ПолноеИмя = ПолноеИмяСлужебногоПользователя() + " (" + НомерОбластиДанных + ")";
		ПараметрыСоздания.ПочтаОбязательна = Ложь;
		
		ПрограммныйИнтерфейсСервиса.СоздатьПользователяАбонента(ПараметрыСоздания, Ложь, ОсновныеСвойстваОтвета);
		
		Если ОсновныеСвойстваОтвета.КодСостояния <> 200
			Или ОсновныеСвойстваОтвета.КодОтвета <> 10200 Тогда
			Результат.ТекстОшибки = ОсновныеСвойстваОтвета.Сообщение;
			Возврат Результат;
		КонецЕсли;
		
	ИначеЕсли ОсновныеСвойстваОтвета.КодОтвета <> 10200 Тогда
		Результат.ТекстОшибки = ОсновныеСвойстваОтвета.Сообщение;
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыДобавления = ПрограммныйИнтерфейсСервиса.НовыйПараметрыДобавленияПользователяВПриложение();
	ПараметрыДобавления.КодПриложения = РаботаВМоделиСервиса.ЗначениеРазделителяСеанса();
	ПараметрыДобавления.Логин = Логин;
	ПараметрыДобавления.Право = Перечисления.ПраваПользователяПриложения.ДоступКAPI;
	
	ПрограммныйИнтерфейсСервиса.ДобавитьПользователяВПриложение(ПараметрыДобавления, Ложь, ОсновныеСвойстваОтвета);
	
	Если ОсновныеСвойстваОтвета.КодСостояния <> 200
		Или ОсновныеСвойстваОтвета.КодОтвета <> 10200 Тогда
		Результат.ТекстОшибки = ОсновныеСвойстваОтвета.Сообщение;
		Возврат Результат;
	КонецЕсли;
	
	Результат.Пользователь = Пользователи.НайтиПоИмени(Логин);
	Если Не ЗначениеЗаполнено(Результат.Пользователь) Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Неизвестная ошибка'");
	КонецЕсли;
	
	ДанныеАутентификации = НовыеДанныеАутентификацииСлужебногоПользователя(Логин, Пароль);
	ЗаписатьДанныеАутентификацииСлужебногоПользователя(ДанныеАутентификации);
	Результат.ДанныеАутентификации = ДанныеАутентификации;
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  См. НовыйРезультатСозданияСлужебногоПользователя
Функция СоздатьСлужебногоПользователяЛокально()
	
	Результат = НовыйРезультатСозданияСлужебногоПользователя();
	
	Логин = ИмяСлужебногоПользователяЛокально();
	
	СвойстваПользователяИБ = Пользователи.СвойстваПользователяИБ(Логин);
	ТребуетсяОбновитьДанныеПользователяИБ = ЗначениеЗаполнено(СвойстваПользователяИБ)
		И СвойстваПользователяИБ.ПолноеИмя <> ПолноеИмяСлужебногоПользователя();
	
	Результат.Пользователь = Пользователи.НайтиПоИмени(Логин);
	
	Если ЗначениеЗаполнено(Результат.Пользователь)
		И Не ТребуетсяОбновитьДанныеПользователяИБ Тогда
		Результат.ДанныеАутентификации = ДанныеАутентификацииСлужебногоПользователя();
		Возврат Результат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначения.РазделениеВключено()
		И НЕ ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Пароль = СгенерироватьСлучайныйПароль();
	ЭтоСозданиеПользователя = Ложь;
	
	Попытка
		
		Если ТребуетсяОбновитьДанныеПользователяИБ
			И ЗначениеЗаполнено(Результат.Пользователь) Тогда
			СвойстваПользователяИБ.ПолноеИмя = ПолноеИмяСлужебногоПользователя();
			СвойстваПользователяИБ.Пароль = Пароль;
			СвойстваПользователяИБ.СохраняемоеЗначениеПароля = Неопределено;
			СвойстваПользователяИБ.Вставить("Действие", "Записать");
			СвойстваПользователяИБ.Вставить("ВходВПрограммуРазрешен", Истина);

			ПользовательОбъект = Результат.Пользователь.ПолучитьОбъект();
			ПользовательОбъект.Наименование = СвойстваПользователяИБ.ПолноеИмя;
			ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", СвойстваПользователяИБ);
			ПользовательОбъект.Записать();
			
			ПользовательСсылка = ПользовательОбъект.Ссылка;
		Иначе
			ЭтоСозданиеПользователя = Истина;
			
			ОписаниеПользователяИБ = Пользователи.НовоеОписаниеПользователяИБ();
			ОписаниеПользователяИБ.Имя = Логин;
			ОписаниеПользователяИБ.ПолноеИмя = ПолноеИмяСлужебногоПользователя();
			ОписаниеПользователяИБ.АутентификацияСтандартная = Истина;
			ОписаниеПользователяИБ.АутентификацияOpenIDConnect = Ложь;
			ОписаниеПользователяИБ.АутентификацияТокеномДоступа = Ложь;
			ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора = Ложь;
			ОписаниеПользователяИБ.Вставить("Действие", "Записать");
			ОписаниеПользователяИБ.Вставить("ВходВПрограммуРазрешен", Истина);
			ОписаниеПользователяИБ.ЗапрещеноИзменятьПароль = Истина;
			ОписаниеПользователяИБ.Пароль = Пароль;
			ОписаниеПользователяИБ.Роли = РолиСлужебногоПользователя();
			
			НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
			НовыйПользователь.Наименование = ОписаниеПользователяИБ.ПолноеИмя;
			НовыйПользователь.Служебный = Истина;
			НовыйПользователь.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
			НовыйПользователь.Записать();
			
			ПользовательСсылка = НовыйПользователь.Ссылка;
		КонецЕсли;
		
		Результат.Пользователь = ПользовательСсылка;
		Результат.ДанныеАутентификации = НовыеДанныеАутентификацииСлужебногоПользователя(Логин, Пароль);
		ЗаписатьДанныеАутентификацииСлужебногоПользователя(Результат.ДанныеАутентификации);
	Исключение
		
		МетаданныеОбъекта = Метаданные.Справочники.Пользователи;
		ТекстОшибки = ?(ЭтоСозданиеПользователя,
			НСтр("ru = 'Не удалось создать служебного пользователя центра ЭДО по причине:'"),
			НСтр("ru = 'Не удалось обновить служебного пользователя центра ЭДО по причине:'"))
			+ Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ПредставлениеПодсистемы(),
			УровеньЖурналаРегистрации.Ошибка, МетаданныеОбъекта, , ТекстОшибки);
		Результат.ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Массив Из Строка
Функция РолиСлужебногоПользователя() Экспорт
	
	НаборРолей = Новый Массив;
	НаборРолей.Добавить(Метаданные.Роли.ИспользованиеЦентраЭДО.Имя);
	НаборРолей.Добавить(Метаданные.Роли.БазовыеПраваЭД.Имя);
	НаборРолей.Добавить(Метаданные.Роли.БазовыеПраваБСП.Имя);
	НаборРолей.Добавить(Метаданные.Роли.ЧтениеНастроекОбменаСКонтрагентами.Имя);
	НаборРолей.Добавить(Метаданные.Роли.ЧтениеМаршрутовПодписания.Имя);
	НаборРолей.Добавить(Метаданные.Роли.ЧтениеЭлектронныхДокументов.Имя);
	НаборРолей.Добавить(Метаданные.Роли.ВыполнениеОбменаСКонтрагентами.Имя);
	НаборРолей.Добавить(Метаданные.Роли.ИспользованиеУведомленийЭДО.Имя);
	НаборРолей.Добавить(Метаданные.Роли.ЧтениеМЧДЭДО.Имя);
	НаборРолей.Добавить(Метаданные.Роли.ВыводНаПринтерФайлБуферОбмена.Имя);

	Возврат НаборРолей;
	
КонецФункции

// Возвращаемое значение:
//  Строка
Функция СгенерироватьСлучайныйПароль()
	
	ВерсияРежимаСовместимости = СтандартныеПодсистемыСервер.ВерсияРежимаСовместимости();
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияРежимаСовместимости, "8.3.22.0") >= 0 Тогда
		ГенераторСлучайныхПаролей = ОбщегоНазначения.ВычислитьВБезопасномРежиме("Новый ГенераторСлучайныхПаролей");
		ДлинаПароля = 15;
		Возврат ГенераторСлучайныхПаролей.СлучайныйПароль(ДлинаПароля, Ложь);
	КонецЕсли;
	
	Идентификатор = СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
	
	ЕстьСпецсимволы = Ложь;
	ЕстьЗаглавныеБуквы = Ложь;
	
	Пароль = "";
	
	Для Индекс = 1 По СтрДлина(Идентификатор) Цикл
		
		Если ЕстьСпецсимволы И ЕстьЗаглавныеБуквы Тогда
			Пароль = Пароль + Сред(Идентификатор, Индекс);
			Прервать;
		КонецЕсли;
		
		Символ = Сред(Идентификатор, Индекс, 1);
		
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Символ) Тогда
			Если ЕстьСпецсимволы Тогда
				НовыйСимвол = Символ;
			Иначе
				Число = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Символ);
				НовыйСимвол = Сред("_~!?@#$%&^", Число + 1, 1);
				ЕстьСпецсимволы = Истина;
			КонецЕсли;
		Иначе
			Если ЕстьЗаглавныеБуквы Тогда
				НовыйСимвол = Символ;
			Иначе
				НовыйСимвол = ВРег(Символ);
				ЕстьЗаглавныеБуквы = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Пароль = Пароль + НовыйСимвол;
		
	КонецЦикла;
	
	Возврат Пароль;
	
КонецФункции

#КонецОбласти

#КонецОбласти
