
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("ХозОперация",        ПредопределенноеЗначение("Справочник.ХозОперации.АктСписанияСТорговогоЗалаЕГАИС"));
	СтруктураЗаполнения.Вставить("ДокументЗаполнения", ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура("Основание",СтруктураЗаполнения);
	ОткрытьФорму("Документ.АктСписанияЕГАИС.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
