// Модуль объекта документа "Корректировка"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция создает сторнирующие движения.
//
Функция ЗаполнитьНаборЗаписей(ЗаполняемыйНаборЗаписей, МетаданныеРегистр)
	
	ВидРегистра = -1;
	
	Если Метаданные.РегистрыРасчета.Найти(МетаданныеРегистр.Имя)<>Неопределено Тогда
		ВидРегистра = 0;
		НаборЗаписей = РегистрыРасчета[МетаданныеРегистр.Имя].СоздатьНаборЗаписей();
	ИначеЕсли Метаданные.РегистрыБухгалтерии.Найти(МетаданныеРегистр.Имя)<>Неопределено Тогда
		ВидРегистра = 1;
		НаборЗаписей = РегистрыБухгалтерии[МетаданныеРегистр.Имя].СоздатьНаборЗаписей();
	ИначеЕсли Метаданные.РегистрыНакопления.Найти(МетаданныеРегистр.Имя)<>Неопределено Тогда
		ВидРегистра = 2;
		НаборЗаписей = РегистрыНакопления[МетаданныеРегистр.Имя].СоздатьНаборЗаписей();
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	// Считывает записи из базы данных по установленному отбору(Регистратор-ДокументОснование).
	НаборЗаписей.Отбор.Регистратор.Значение = ДокументОснование;
	НаборЗаписей.Прочитать();
	
	Для Каждого ДвижениеКорректируемое Из НаборЗаписей Цикл
		// ЗаполняемыйНаборЗаписей - это табличное поле для отображения записей регистра
		ДвижениеКорректировки = ЗаполняемыйНаборЗаписей.Добавить();
		
		// копирует движение по регистру: измерения, ресурсы, реквизиты
		Если ХозОперация = Справочники.ХозОперации.Сторно Тогда
			ЗаполнитьЗначенияСвойств(ДвижениеКорректировки, ДвижениеКорректируемое, , "НомерСтроки, Регистратор, ВидДвижения");
		ИначеЕсли ВидРегистра=0 Тогда
			ЗаполнитьЗначенияСвойств(ДвижениеКорректировки, ДвижениеКорректируемое, , "НомерСтроки, Регистратор, ВидДвижения, ПериодРегистрации");
		Иначе
			ЗаполнитьЗначенияСвойств(ДвижениеКорректировки, ДвижениеКорректируемое, , "НомерСтроки, Регистратор, ВидДвижения, Период");
		КонецЕсли;
		
		// ресурсы
		Если ХозОперация = Справочники.ХозОперации.Сторно Тогда
			Для Каждого МДОбъект Из МетаданныеРегистр.Ресурсы Цикл
				ДвижениеКорректировки[МДОбъект.Имя] = - ДвижениеКорректировки[МДОбъект.Имя];
			КонецЦикла;
		КонецЕсли;
		
		ДвижениеКорректировки.Регистратор = Ссылка;
	
		// реквизиты
		Если ВидРегистра=0 Тогда
			Если ХозОперация = Справочники.ХозОперации.Сторно Тогда
				ДвижениеКорректировки.ПериодРегистрации = Дата;
			КонецЕсли;
			ДвижениеКорректировки.ВидРасчета = ДвижениеКорректируемое.ВидРасчета;
			Если ХозОперация = Справочники.ХозОперации.Сторно Тогда
				ДвижениеКорректировки.Сторно = Истина;
			КонецЕсли;
			
			Если МетаданныеРегистр.ПериодДействия Тогда
				ДвижениеКорректировки.ПериодДействияНачало = ДвижениеКорректируемое.ПериодДействияНачало;
				ДвижениеКорректировки.ПериодДействияКонец = ДвижениеКорректируемое.ПериодДействияКонец;
			КонецЕсли;
			Если МетаданныеРегистр.БазовыйПериод Тогда
				ДвижениеКорректировки.БазовыйПериодНачало = ДвижениеКорректируемое.БазовыйПериодНачало;
				ДвижениеКорректировки.БазовыйПериодКонец  = ДвижениеКорректируемое.БазовыйПериодКонец;
			КонецЕсли;
		ИначеЕсли ВидРегистра=1 Тогда 
			Если ХозОперация = Справочники.ХозОперации.Сторно Тогда
				ДвижениеКорректировки.Период = Дата;
			КонецЕсли;
		ИначеЕсли ВидРегистра=2 Тогда  
			Если МетаданныеРегистр.ВидРегистра=Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
				ДвижениеКорректировки.ВидДвижения = ДвижениеКорректируемое.ВидДвижения;
			КонецЕсли;
			Если ХозОперация = Справочники.ХозОперации.Сторно Тогда
				ДвижениеКорректировки.Период = Дата;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ЗаполнитьНаборЗаписей()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

// Функция создает страницу со сторнирующими движениями
//
// Параметры:
// Модифицированность - Булево - Изменены ли поля объекта
// 
// Результат:
// ДоступныеДвижения - Массив - движения документа основания с не пустым набором записей
Функция ЗаполнитьДвиженияПоДокументуОснованию(Модифицированность = Ложь) Экспорт
	
	ДоступныеДвижения = Новый Массив;
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат ДоступныеДвижения;
	КонецЕсли;
	ДвиженияДокументаОснования = ДокументОснование.ПолучитьОбъект().Движения;
	
	Для Каждого Движение Из Метаданные.Документы.КорректировкаДвижений.Движения Цикл
		
		// Поищем это движение в документе основании
		ДвижениеДокументаОснования = ДвиженияДокументаОснования.Найти(Движение.Имя);
		Если ДвижениеДокументаОснования = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДвижениеДокументаОснования.Прочитать();
		Если ДвижениеДокументаОснования.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписейДокумента = Движения.Найти(Движение.Имя);
		Если ЗначениеЗаполнено(Ссылка) И (НЕ Модифицированность) Тогда
			НаборЗаписейДокумента.Прочитать();
		Иначе
			Если НЕ ЗаполнитьНаборЗаписей(НаборЗаписейДокумента, Движение) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если НаборЗаписейДокумента.Количество()>0 Тогда
			ДоступныеДвижения.Добавить(Движение);
			Если ХозОперация = Справочники.ХозОперации.КорректировкаДвижений Тогда
				СтрокаДвижения = ДвиженияКорректировки.НайтиСтроки(Новый Структура("ИмяРегистра",Движение.Имя));
				СтрокаДвижения[0].Использование = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДоступныеДвижения;
КонецФункции // ЗаполнитьДвиженияПоДокументуОснованию()

// Процедура устанавливает признак активности для записей регистров.
//
Процедура УстановитьАктивностьДвижений(ФлагАктивности)
	
	Для Каждого Движение Из Движения Цикл
		
		Движение.Прочитать();
		Движение.УстановитьАктивность(ФлагАктивности);
		
	КонецЦикла;
	
КонецПроцедуры // УстановитьАктивностьДвижений()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним тч по умолчанию
	Если ДвиженияКорректировки.Количество()=0 Тогда
		Для Каждого Движение Из Метаданные().Движения Цикл
			НоваяСтрока = ДвиженияКорректировки.Добавить();
			НоваяСтрока.ИмяРегистра = "" + Движение.Имя;
			НоваяСтрока.Представление = "" + Движение.Представление();
			НоваяСтрока.Использование = Ложь;
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьДвиженияПоДокументуОснованию(Истина);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ХозОперация=Справочники.ХозОперации.КорректировкаДвижений И ЗначениеЗаполнено(ДокументОснование) Тогда
		ДатаДвижения = ДокументОснование.Дата;
		ПерезаписыватьДату = Ложь;
	Иначе
		ДатаДвижения = Дата;
		ПерезаписыватьДату = Истина;
	КонецЕсли;
	
	// Заполним период
	Если ХозОперация=Справочники.ХозОперации.КорректировкаДвижений Тогда
		
		Для Каждого ТекСтрокаТЧ Из ДвиженияКорректировки Цикл
			
			НаборЗаписей = Движения[ТекСтрокаТЧ.ИмяРегистра];
			Если ТекСтрокаТЧ.Использование Тогда
				ИмяПериода = "Период";
				Если Метаданные.РегистрыРасчета.Найти(ТекСтрокаТЧ.ИмяРегистра)<>Неопределено Тогда
					ИмяПериода = "ПериодРегистрации";
				КонецЕсли;
				
				Для Каждого ТекДвижение Из НаборЗаписей Цикл
					Если ПерезаписыватьДату Тогда
						ТекДвижение[ИмяПериода] = ДатаДвижения;
					ИначеЕсли НЕ ЗначениеЗаполнено(ТекДвижение[ИмяПериода]) Тогда
						ТекДвижение[ИмяПериода] = ДатаДвижения;
					КонецЕсли;
				КонецЦикла;
			Иначе
				Если НЕ Ссылка.Пустая() Тогда
					НаборЗаписей.Очистить();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого ТекНаборЗаписей Из Движения Цикл
			ИмяПериода = "Период";
			Если Метаданные.РегистрыРасчета.Содержит(ТекНаборЗаписей.Метаданные()) Тогда
				ИмяПериода = "ПериодРегистрации";
			КонецЕсли;
			Для Каждого ТекЗапись Из ТекНаборЗаписей Цикл
				Если ПерезаписыватьДату Тогда
					ТекЗапись[ИмяПериода] = ДатаДвижения;
				ИначеЕсли НЕ ЗначениеЗаполнено(ТекЗапись[ИмяПериода]) Тогда
					ТекЗапись[ИмяПериода] = ДатаДвижения;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ ЭтоНовый() И Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда
		УстановитьАктивностьДвижений(НЕ ПометкаУдаления);
	ИначеЕсли ПометкаУдаления Тогда
		УстановитьАктивностьДвижений(Ложь);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

#КонецЕсли