////////////////////////////////////////////////////////////////////////////////
// Работа с объектами механизма "Платежно расчетные документы"
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует таблицу платежно расчетных документов для указанного документа.
//
// Параметры:
//  Документ  - ДокументСсылка - Документ для которого необходимо получить платежно расчетные документы.
//  Договор  - СправочникСсылка.ДоговорыВзаиморасчетов - Договор используется для поиска платежей
//                  в документе "Выписка".
//
// Возвращаемое значение:
//   ТаблицаЗначений   - Таблица с документами вида "Номер" от "Дата".
//                       Одна строка соответствует одному документу.
//
Функция ПолучитьПлатежноРасчетныеДокументы(Документ, Договор=Неопределено) Экспорт
	
	// Подготовим таблицу
	Результат = ПустаяТаблица();
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПостроительЗапроса = Новый ПостроительЗапроса(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыКомпании.Сделка КАК Сделка
	|ПОМЕСТИТЬ ЗакрытыеСделки
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыКомпании КАК ВзаиморасчетыКомпании
	|ГДЕ
	|	ВзаиморасчетыКомпании.Регистратор = &Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВзаиморасчетыКомпании.Регистратор КАК Платеж,
	|	ВзаиморасчетыКомпании.Сделка КАК Сделка,
	|	ВзаиморасчетыКомпании.Период КАК Период
	|ПОМЕСТИТЬ Платежи
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыКомпании КАК ВзаиморасчетыКомпании
	|ГДЕ
	|	ВзаиморасчетыКомпании.Сделка В
	|			(ВЫБРАТЬ
	|				ЗакрытыеСделки.Сделка
	|			ИЗ
	|				ЗакрытыеСделки КАК ЗакрытыеСделки)
	|	И (ВзаиморасчетыКомпании.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ИЛИ ВзаиморасчетыКомпании.Регистратор ССЫЛКА Документ.Выписка
	|			ИЛИ ВзаиморасчетыКомпании.Регистратор ССЫЛКА Документ.ЧекНаОплату)
	|{ГДЕ
	|	ВзаиморасчетыКомпании.Период КАК ПериодОтбор}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыпискаСостав.Ссылка КАК Выписка,
	|	ВыпискаСостав.Сделка КАК Сделка,
	|	ВыпискаСостав.НомерВходящегоДокумента КАК Номер,
	|	ВыпискаСостав.ДатаВходящегоДокумента КАК Дата
	|ПОМЕСТИТЬ Выписки
	|ИЗ
	|	Документ.Выписка.Состав КАК ВыпискаСостав
	|ГДЕ
	|	ВыпискаСостав.ДоговорВзаиморасчетов = &Договор
	|	И ВыпискаСостав.Ссылка В
	|			(ВЫБРАТЬ
	|				Платежи.Платеж
	|			ИЗ
	|				Платежи КАК Платежи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Платежи.Платеж КАК Платеж,
	|	ВЫБОР
	|		КОГДА Платежи.Платеж ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ""ПКО""
	|		КОГДА Платежи.Платеж ССЫЛКА Документ.ЧекНаОплату
	|			ТОГДА ""Чек""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Префикс,
	|	ВЫБОР
	|		КОГДА Платежи.Платеж ССЫЛКА Документ.Выписка
	|		ТОГДА ЕстьNull(Выписки.Номер, Платежи.Платеж.НомерВходящегоДокумента)
	|		ИНАЧЕ Платежи.Платеж.Номер
	|	КОНЕЦ КАК Номер,
	|	ВЫБОР
	|		КОГДА Платежи.Платеж ССЫЛКА Документ.Выписка
	|		ТОГДА ЕстьNull(Выписки.Дата, Платежи.Платеж.ДатаВходящегоДокумента)
	|		ИНАЧЕ Платежи.Платеж.Дата
	|	КОНЕЦ КАК Дата,
	|	Платежи.Платеж.ХозОперация КАК ХозОперация,
	|	Платежи.Платеж.Номер КАК НомерДополнительный,
	|	Платежи.Платеж.Дата КАК ДатаДополнительная,
	|	Платежи.Период КАК Период
	|ИЗ
	|	Платежи КАК Платежи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Выписки КАК Выписки
	|		ПО Платежи.Платеж = Выписки.Выписка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Платежи.Период");
	
	ПостроительЗапроса.ЗаполнитьНастройки();
	ПостроительЗапроса.Параметры.Вставить("Основание", Документ);
	ПостроительЗапроса.Параметры.Вставить("Договор", Договор);
	ТипДокумента = ТипЗнч(Документ);
	
	ДатаРеализации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Дата");
	
	Если ЗначениеЗаполнено(ДатаРеализации) Тогда
		
		Отбор = ПостроительЗапроса.Отбор.Добавить("ПериодОтбор");
		Отбор.ВидСравнения = ВидСравнения.Меньше;
		Отбор.Значение = ДатаРеализации;
		Отбор.Использование = Истина;
		
	КонецЕсли;
	
	ПостроительЗапроса.Выполнить();
	
	Если ПостроительЗапроса.Результат.Пустой() Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Выборка = ПостроительЗапроса.Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Результат.Добавить();
		
		Если ЗначениеЗаполнено(Выборка.Номер) Тогда
			
			НомерБезНулей = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(Выборка.Номер, "0");
			НоваяСтрока.Номер = СокрЛП(Выборка.Префикс + " " + НомерБезНулей);
			НоваяСтрока.Дата = Выборка.Дата;
			
		ИначеЕсли ТипЗнч(Выборка.Платеж) = Тип("ДокументСсылка.Выписка") Тогда
			
			Если Выборка.ХозОперация <> Справочники.ХозОперации.БанковскаяВыписка Тогда
				
				НомерБезНулей = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(Выборка.НомерДополнительный, "0");
				НоваяСтрока.Номер = СокрЛП(Выборка.Префикс + " " + НомерБезНулей);
				НоваяСтрока.Дата = Выборка.ДатаДополнительная;
				
			Иначе
				
				НоваяСтрока.Номер = НСтр("ru = 'в выписке не указан'");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ПолучитьПлатежноРасчетныеДокументы()

// Выполняет переход на новую структуру метаданных
//
Процедура ВыполнитьОбновлениеВыписок() Экспорт
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Платежно расчетные документы.Начало обновления'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Информация);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВыпискаСостав.Ссылка КАК Документ,
	|	ВыпискаСостав.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СтрокаБанковскойВыписки) КАК ЭтоСтрока
	|ИЗ
	|	Документ.Выписка.Состав КАК ВыпискаСостав
	|ГДЕ
	|	НЕ ВыпискаСостав.ПлатежноеПоручениеОснование ССЫЛКА Документ.ПлатежноеПоручение
	|	И ВыпискаСостав.ПлатежноеПоручениеОснование <> """"");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ЭтоСтрока Тогда
				
				ОбновитьСтрокуВыписки(Выборка.Документ);
				
			Иначе
				
				ОбновитьВыписку(Выборка.Документ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Платежно расчетные документы.Окончание обновления'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Информация);
	
КонецПроцедуры

// Выполняет переход на новую структуру метаданных.
//
Процедура ВыполнитьОбновлениеСчетовФактур() Экспорт
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Платежно расчетные документы.Начало обновления'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), 
		УровеньЖурналаРегистрации.Информация);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК Документ,
	|	СчетФактураВыданный.УдалитьПлатежноРасчетныеДокументы КАК ПлатежноРасчетныеДокументы
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	(ВЫРАЗИТЬ(СчетФактураВыданный.УдалитьПлатежноРасчетныеДокументы КАК СТРОКА(10))) <> """"");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбновитьСчетФактуру(Выборка.Документ, Выборка.ПлатежноРасчетныеДокументы);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Платежно расчетные документы.Окончание обновления'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), 
		УровеньЖурналаРегистрации.Информация);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует пустую таблицу "Платежно расчетных документов".
//
// Возвращаемое значение:
//   ТаблицаЗначений   - Пустая таблица с колонками "Номер" и "Дата".
//
Функция ПустаяТаблица()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Номер", ОбщегоНазначения.ОписаниеТипаСтрока(30));
	Таблица.Колонки.Добавить("Дата", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Возврат Таблица;
	
КонецФункции // ПустаяТаблица()

// Выполняет перенос ПРД из строки в табличную часть для конкретного документа
//
Процедура ОбновитьСчетФактуру(Документ, ПлатежноРасчетныеДокументы)
	
	Если Документ.Пустая() ИЛИ ПустаяСтрока(ПлатежноРасчетныеДокументы) Тогда
		Возврат;
	КонецЕсли;
	
	ПРД = ПолучитьПлатежноРасчетныеДокументы(Документ.ДокументОснование, Документ.ДоговорВзаиморасчетов);
	
	Если ПРД.Количество() > 0 Тогда
		
		Объект = Документ.ПолучитьОбъект();
		Объект.УдалитьПлатежноРасчетныеДокументы = "";
		Объект.ПлатежноРасчетныеДокументы.Загрузить(ПРД);
		Объект.ОбменДанными.Загрузка = Истина;
		
		Попытка
			Объект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Платежно расчетные документы.Не удалось обновить документ'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				,
				Документ);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет разбивку строки платежного поручения на номер и дату в документе выписки.
//
Процедура ОбновитьВыписку(Документ)
	
	Объект = Документ.ПолучитьОбъект();
	ОбъектМодифицировался = Ложь;
	
	Для Каждого Строка Из Объект.Состав Цикл
		
		Если ЗначениеЗаполнено(Строка.ПлатежноеПоручениеОснование)
			И ТипЗнч(Строка.ПлатежноеПоручениеОснование) = Тип("Строка") Тогда
			
			ЗначенияРеквизитов = ПлатежноРасчетныеДокументыКлиентСервер
				.РазбитьПредставление(СтрРазделить(Строка.ПлатежноеПоручениеОснование, ";", Ложь)[0]);
			Строка.НомерВходящегоДокумента = ЗначенияРеквизитов.Номер;
			Строка.ДатаВходящегоДокумента = ЗначенияРеквизитов.Дата;
			Строка.ПлатежноеПоручениеОснование = Неопределено;
			ОбъектМодифицировался = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ОбъектМодифицировался Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Платежно расчетные документы.Не удалось обновить документ'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			Документ);
	КонецПопытки;
	
КонецПроцедуры

// Выполняет разбивку строки платежного поручения на номер и дату в документе выписки.
//
Процедура ОбновитьСтрокуВыписки(Документ)
	
	Объект = Документ.ПолучитьОбъект();
	
	Если НЕ ЗначениеЗаполнено(Объект.ПлатежноеПоручениеОснование)
		ИЛИ ТипЗнч(Объект.ПлатежноеПоручениеОснование) <> Тип("Строка") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ЗначениеРеквизитов = ПлатежноРасчетныеДокументыКлиентСервер.РазбитьПредставление(СтрРазделить(Объект.ПлатежноеПоручениеОснование, ";", Ложь)[0]);
	Объект.НомерВходящегоДокумента = ЗначениеРеквизитов.Номер;
	Объект.ДатаВходящегоДокумента = ЗначениеРеквизитов.Дата;
	Объект.ПлатежноеПоручениеОснование = Неопределено;
	
	Для Каждого Строка Из Объект.Состав Цикл
		
		ЗаполнитьЗначенияСвойств(Строка, Объект, "НомерВходящегоДокумента,ДатаВходящегоДокумента");
		Строка.ПлатежноеПоручениеОснование = Неопределено;
		
	КонецЦикла;
	
	Попытка
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Платежно расчетные документы.Не удалось обновить документ'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			Документ);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти