
//возвращает структуру в виде СМ ЛМ для ТТ
Функция ПолучитьОтветственныхДляОбъекта(Ссылка,ТекДата) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ит_ТорговыеТочки_ОтветственныеСрезПоследних.СтМенеджер КАК СтаршийМенеджер,
	               |	ит_ТорговыеТочки_ОтветственныеСрезПоследних.Менеджер КАК ЛинейныйМенеджер,
	               |	МАКСИМУМ(ит_ТорговыеТочки_Ответственные.Период) КАК ДатаИстории
	               |ИЗ
	               |	РегистрСведений.ит_ТорговыеТочки_Ответственные.СрезПоследних(&ТекДата, ТорговаяТочка = &Ссылка) КАК ит_ТорговыеТочки_ОтветственныеСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ит_ТорговыеТочки_Ответственные КАК ит_ТорговыеТочки_Ответственные
	               |		ПО ит_ТорговыеТочки_ОтветственныеСрезПоследних.ТорговаяТочка = ит_ТорговыеТочки_Ответственные.ТорговаяТочка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ит_ТорговыеТочки_ОтветственныеСрезПоследних.СтМенеджер,
	               |	ит_ТорговыеТочки_ОтветственныеСрезПоследних.Менеджер";
				   
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("ТекДата",ТекДата);
	Рез = Запрос.Выполнить().Выбрать();
	СтруктураСЛМ = Новый Структура("СтаршийМенеджер,ЛинейныйМенеджер,ДатаИстории");
	Если Рез.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураСЛМ,Рез);
	КонецЕсли;
	
	Возврат СтруктураСЛМ;
	
КонецФункции
