
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО ЗНАЧЕНИЯ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Подготовка компоновщика макета компоновки данных.
	Обработка = РеквизитФормыВЗначение("Объект");
	СхемаКД = Обработка.ПолучитьМакет("СхемаКомпановкиДанных");
	
	Обработка.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКД, ЭтаФорма.УникальныйИдентификатор)));
	Обработка.КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКД.НастройкиПоУмолчанию);
	Обработка.КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
КонецПроцедуры //ПриСозданииНаСервере()

&НаСервере
Процедура ОбновитьСписокДокументов(Очистить=Ложь)
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	Если Очистить Тогда
		ОбъектОбработка.ДокументыДляВыгрузки.Очистить();
	Иначе
		ОбъектОбработка.ЗаполнитьДокументыДляВыгрузки();
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ОбъектОбработка, "Объект");
	
	Для Каждого СтрокаДокумента Из Объект.ДокументыДляВыгрузки Цикл
		СтрокаДокумента.Сумма		= СтрокаДокумента.Документ.СуммаДокумента;
		СтрокаДокумента.ВидОперации	= СтрокаДокумента.Документ.ВидОперации;
		СтрокаДокумента.Контрагент	= СтрокаДокумента.Документ.Контрагент;
	КонецЦикла;
	
КонецПроцедуры //ОбновитьСписокДокументов()

&НаСервере
Функция ПолучитьВерсиюБД()
	Возврат Метаданные.Версия;
КонецФункции //ПолучитьВерсиюБД()

&НаСервере
Процедура ПроверкаПервогоЗапуска(Отказ)
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ОбъектОбработка.ПроверкаПервогоЗапускаИНаличияПредопределенныхЭлементов(Отказ);
КонецПроцедуры //ПроверкаПервогоЗапуска()

&НаСервере
Процедура Загрузить(Текст, СтрокаXML, ТекстПодтверждения, Лог, РезСравнения)
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ОбъектОбработка.Загрузить(Текст, СтрокаXML, ТекстПодтверждения, Лог, РезСравнения);	
КонецПроцедуры //ЗагрузитьСвязанныеДанные()

&НаСервере
Процедура Выгрузить(Текст)
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ОбъектОбработка.Выгрузить(Текст);	
КонецПроцедуры //ЗагрузитьСвязанныеДанные()

&НаСервере
Процедура СохранитьНастройки()
	//Попытка
	//	ХранилищеОбщихНастроек.Сохранить("ОбменТКБП_КаталогОбмена",, Объект.КаталогОбмена);
	//	ХранилищеОбщихНастроек.Сохранить("ОбменТКБП_СтрокаПодключения",, Объект.СтрокаПодключения);
	//Исключение КонецПопытки;
КонецПроцедуры //СохранитьНастройки()

&НаСервере
Процедура ВосстановитьНастройки()
	//Объект.КаталогОбмена	 = ХранилищеОбщихНастроек.Загрузить("ОбменТКБП_КаталогОбмена");
	//Объект.СтрокаПодключения = ХранилищеОбщихНастроек.Загрузить("ОбменТКБП_СтрокаПодключения");
КонецПроцедуры //ВосстановитьНастройки()

&НаСервере
Процедура СозданиеБазыСоответствийНаСервере(ОчисткаБазы=Ложь, СтрокаXML="")
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	
	ПараметрыБазы = Новый Структура();
	ПараметрыБазы.Вставить("ТипБазы",	ТипБазыСоответствий);
	ПараметрыБазы.Вставить("ИмяБазы",	СокрЛП(ИмяБазы));
	ПараметрыБазы.Вставить("ИмяСервера",СокрЛП(ИмяСервера));
	ПараметрыБазы.Вставить("Логин",		СокрЛП(Login));
	ПараметрыБазы.Вставить("Пароль",	СокрЛП(Password));
	ПараметрыБазы.Вставить("Очистка",	ОчисткаБазы);
	ПараметрыБазы.Вставить("СтрокаXML", СтрокаXML);
	
	ОбъектОбработка.СозданиеБазыСоответствий(ПараметрыБазы);
	
	СтрокаXML = ПараметрыБазы.СтрокаXML;
КонецПроцедуры //СоздатьОчиститьБазуНажатие()

&НаКлиенте
Функция УбратьСимволы(СтрВозв, СтрСимв) 
	Если НЕ ЗначениеЗаполнено(СтрСимв) Тогда Возврат СтрВозв; КонецЕсли;
	Для к=1 по СтрДлина(СтрСимв) Цикл
		ТекСимв = Сред(СтрСимв, к, 1);
		СтрВозв = СтрЗаменить(СтрВозв, ТекСимв, "");
	КонецЦикла;
	
	Возврат СтрВозв;
КонецФункции  // УбратьСимволы()

&НаКлиенте
Процедура ЗаполнитьСписокДоступныхДляЗагрузкиФайлов()
	Если НЕ ЗначениеЗаполнено(Объект.КаталогОбмена) Тогда
		Сообщить("Не определен каталог обмена.");
		Возврат;
	КонецЕсли;
	
    КаталогНаДиске = Новый Файл(Объект.КаталогОбмена);
    Если НЕ КаталогНаДиске.Существует() Тогда
        Сообщить("Нет доступа к каталогу " + Объект.КаталогОбмена);
    КонецЕсли;
	
	НайденныеФайлы = НайтиФайлы(Объект.КаталогОбмена, "*.txt");
	Объект.СписокФайлов.Очистить();
	
	Для Индекс=0 По НайденныеФайлы.ВГраница() Цикл
		ИмяФайла = НайденныеФайлы[Индекс].ПолноеИмя;
		Если СтрЧислоВхождений(ИмяФайла, "unload_TK_")=0 Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Текст1 = Новый ТекстовыйДокумент();
			Текст1.Прочитать(ИмяФайла);
		Исключение
			Продолжить;
		КонецПопытки;
		
		ТекущаяСтрока		= Текст1.ПолучитьСтроку(1);
		ТекущаяСтрока		= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
		ИдентификаторБазы	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		НомерРелиза			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		ДляРелизаБух		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		ВерсияОбменаТК		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		ДатаВыгрузки		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		ВыгрузкаС			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		ВыгрузкаПо			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		ЕстьНоменклатура	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		ВыгрузкаЗаПериод	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		ВерсияПлатформы		= СокрЛП(ТекущаяСтрока);
		
		Если ВерсияОбменаТК=Объект.ВерсияОбмена Тогда
			Объект.СписокФайлов.Добавить(ИмяФайла, " Выгрузка данных от " + ДатаВыгрузки + ", за период (" + ВыгрузкаС + " - " + ВыгрузкаПо + ")", Ложь);
		Иначе
			Объект.СписокФайлов.Добавить(ИмяФайла, " Выгрузка данных от " + ДатаВыгрузки + ", за период (" + ВыгрузкаС + " - " + ВыгрузкаПо + ") ФАЙЛ УСТАРЕЛ!", Ложь);
			//Попытка
			//	УдалитьФайлы(ИмяФайла);
			//	Сообщить("Удален устаревший файл: " + ИмяФайла);
			//Исключение КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Объект.СписокФайлов.СортироватьПоЗначению(НаправлениеСортировки.Возр);
КонецПроцедуры //ЗаполнитьСписокДоступныхДляЗагрузкиФайлов()

&НаКлиенте
Функция ЗагрузитьНачальныеДанные(ФайлЗагрузки) Экспорт 
	Текст = Новый ТекстовыйДокумент();
	Текст.Прочитать(ФайлЗагрузки);	
	ТекущаяСтрока		= Текст.ПолучитьСтроку(1);
	ТекущаяСтрока		= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
	ИдентификаторБазы	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерРелиза			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДляРелизаБух		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВерсияОбменаТК		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаВыгрузки		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВыгрузкаС			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВыгрузкаПо			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЕстьНоменклатура	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВыгрузкаЗаПериод	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВерсияПлатформы		= СокрЛП(ТекущаяСтрока);
	
	Объект.ЗагрузкаНоменклатуры = (ЕстьНоменклатура="Истина");
	Объект.ЗагрузкаИзменений = (ВыгрузкаЗаПериод="Ложь");
	
	Сообщить("Загрузка данных из "+ИдентификаторБазы+" (выгрузка от "+СокрЛП(ДатаВыгрузки)+") за период с "+СокрЛП(ВыгрузкаС)+" по "+СокрЛП(ВыгрузкаПо));
	
	Возврат Текст;
КонецФункции // ЗагрузитьНачальныеДанные()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ ДОКУМЕНТА

&НаКлиенте
Процедура ЗагрузитьФайл(ИндексФайла=0)
	Если ИндексФайла>(Объект.СписокФайлов.Количество()-1) Тогда //защита от превышение индекса файла
		Сообщить("*************************************************************************");
		Сообщить(?(Объект.СравнениеДанных,"Сверка", "Загрузка") + " завершена!", СтатусСообщения.Информация);
		Сообщить("*************************************************************************");
		
		ЗаполнитьСписокДоступныхДляЗагрузкиФайлов();
		Возврат;
	КонецЕсли;
	
	Если Объект.СписокФайлов[ИндексФайла].Пометка Тогда
		ФайлЗагрузки = Объект.СписокФайлов[ИндексФайла].Значение;
		
		Если Найти(Объект.СписокФайлов[ИндексФайла].Представление, "УСТАРЕЛ")>0 Тогда
			Сообщить("Попытка загрузки файла не соответствующей версии(устаревший) """ + ФайлЗагрузки + """! " + Символы.ПС + "Загрузка устаревших файлов может приводить к ошибкам при загрузке данных.", СтатусСообщения.Внимание);
			//Если Вопрос("Продолжить загрузку устаревшего файла ?", РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Нет)=КодВозвратаДиалога.Нет Тогда
			//	Продолжить;
			//КонецЕсли;
		КонецЕсли;
		
		Текст = ЗагрузитьНачальныеДанные(ФайлЗагрузки);
		
		СтрокаXML = "";
		Если Объект.ТекстоваяТС Тогда
			ТекстСоотв = Новый ЧтениеТекста(СокрЛП(Объект.СтрокаПодключения));
			СтрокаXML = ТекстСоотв.Прочитать();
			ТекстСоотв.Закрыть();
		КонецЕсли;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ИндексФайла", ИндексФайла);
		ДопПараметры.Вставить("Текст", Текст);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаФайлаЗавершение", ЭтаФорма, ДопПараметры);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОбъектВл", Объект);
		ПараметрыФормы.Вставить("Текст", Текст);
		ПараметрыФормы.Вставить("ИндексФайла", ИндексФайла);
		ПараметрыФормы.Вставить("СтрокаXML", СтрокаXML);
		
		ОткрытьФорму("ВнешняяОбработка.ЗагрузкаБухгалтерия83.Форма.ФормаОбъектов", ПараметрыФормы, , , , , ОписаниеОповещения);
	Иначе
		ИндексФайла = ИндексФайла + 1;
		ЗагрузитьФайл(ИндексФайла);
	КонецЕсли;		
КонецПроцедуры //ЗагрузитьФайл()

&НаКлиенте
Процедура ЗагрузкаФайлаЗавершение(Результат, Параметры) Экспорт
	ИндексФайла = Параметры.ИндексФайла;
	
	Если Результат=Неопределено Тогда
		Сообщить("*************************************************************************");
		Сообщить("Загрузка файла отменена.", СтатусСообщения.Информация);
	Иначе
		СтрокаXML = Результат;
		ТекстПодтверждения = ""; Лог = Новый ТекстовыйДокумент; РезСравнения = "";
		Загрузить(Параметры.Текст, СтрокаXML, ТекстПодтверждения, Лог, РезСравнения);
		
		Если Объект.ТекстоваяТС Тогда
			ТекстСоотв = Новый ЗаписьТекста(СокрЛП(Объект.СтрокаПодключения));
			ТекстСоотв.Записать(СтрокаXML);
			ТекстСоотв.Закрыть();
		КонецЕсли;
		
		Если Объект.ЗагрузкаИзменений И ЗначениеЗаполнено(ТекстПодтверждения) Тогда
			ТекстПодтв = Новый ЗаписьТекста(Объект.КаталогОбмена + "\" + "tk_rcpt_" + Формат(ТекущаяДата(), "ДФ=yyyyMMdd_HHmmss") + ".xml");
			ТекстПодтв.Записать(ТекстПодтверждения);
			ТекстПодтв.Закрыть();
		КонецЕсли;
		
		Если Объект.ЗаписьЛогФайла Тогда
			Лог.Записать(Объект.КаталогОбмена + "\" + "bp_log_" + Формат(ТекущаяДата(), "ДФ=yyyyMMdd_HHmmss") + ".txt");
		КонецЕсли;
		
		Если Объект.СравнениеДанных Тогда
			Если ТипЗнч(РезСравнения)=Тип("ТабличныйДокумент") Тогда
				РезСравнения.Показать("Результат сравнения с ранее загруженными документами");
			КонецЕсли;
		КонецЕсли;
		
		Если Объект.УдалятьФайлыПослеЗагрузки Тогда
			ФайлУдаления = Объект.СписокФайлов[ИндексФайла].Значение;
			УдалитьФайлы(ФайлУдаления);
			Сообщить("*************************************************************************");
			Сообщить("Удален файл " + ФайлУдаления, СтатусСообщения.Информация);
		КонецЕсли;
	КонецЕсли;	
	
	ИндексФайла = ИндексФайла + 1;
	ЗагрузитьФайл(ИндексФайла);
КонецПроцедуры //ЗагрузкаФайлаЗавершение()

&НаКлиенте
Процедура ВыгрузитьВФайл()
	// проверим куда выгружать
	Если НЕ ЗначениеЗаполнено(Объект.КаталогОбмена) Тогда
		Сообщить("Не выбран каталог выгрузки !");
		Возврат;
	КонецЕсли;
	
    КаталогНаДиске = Новый Файл(Объект.КаталогОбмена);
    Если НЕ КаталогНаДиске.Существует() Тогда
        Сообщить("Нет доступа к каталогу " + Объект.КаталогОбмена);
    КонецЕсли;
	
	Текст = Новый ТекстовыйДокумент();
	
	Выгрузить(Текст);
	
	Если Текст.КоличествоСтрок()>0 Тогда
		ИмяФайла = "unload_Buh_" + Формат(ТекущаяДата(), "ДФ=yyyyMMdd_HHmmss") + ".txt";
		Текст.Записать(Объект.КаталогОбмена + "\" + ИмяФайла, КодировкаТекста.ANSI);
	
		Сообщить("" + ТекущаяДата() + " Обработка завершена! Данные находятся в файле: " + Объект.КаталогОбмена + "\" + ИмяФайла);
	КонецЕсли;
КонецПроцедуры //ВыгрузитьВФайл()

&НаКлиенте
Процедура КнопкаВыполнитьНажатие(Команда)
	ОчиститьСообщения();
	
	Если Элементы.СтраницыОсновные.ТекущаяСтраница=Элементы.СтраницыОсновные.ПодчиненныеЭлементы.ИмпортДанных Тогда
		Если НЕ ЗначениеЗаполнено(Объект.СтрокаПодключения) Тогда
			Сообщить("Отсутствует настройка подключения к базе соответствий объектов", СтатусСообщения.Информация);
			Возврат;
		Иначе
			Попытка
				Если Объект.ТекстоваяТС Тогда
					//тзСоответствий = ЗначениеИзФайла(СокрЛП(Объект.СтрокаПодключения));
					//Если ТипЗнч(тзСоответствий)<>Тип("ТаблицаЗначений") Тогда
					//	Сообщить("Некорректный файл БД соответствий или он поврежден!", СтатусСообщения.ОченьВажное);
					//	Возврат;
					//КонецЕсли;
				Иначе
					Connection = Новый COMОбъект("ADODB.Connection");
					Connection.Open(СокрЛП(Объект.СтрокаПодключения));
					Command = Новый COMОбъект("ADODB.Command");
					Command.ActiveConnection = Connection;
					RecordSet = Новый COMОбъект("ADODB.Recordset");
				КонецЕсли;
			Исключение
				Сообщить("Ошибка подключения: " + ОписаниеОшибки());
				Сообщить("Ошибка подключения к БД соответствий объектов", СтатусСообщения.ОченьВажное);
				Возврат;
			КонецПопытки;
		КонецЕсли;
		
		ЕстьФайлыДляЗагрузки = Ложь;
		Для Индекс=0 По Объект.СписокФайлов.Количество()-1 Цикл
			Если Объект.СписокФайлов[Индекс].Пометка Тогда
				ЕстьФайлыДляЗагрузки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ЕстьФайлыДляЗагрузки Тогда	
			ЗагрузитьФайл();
		Иначе
			Сообщить("Нет отмеченных файлов для загрузки.", СтатусСообщения.Информация);
		КонецЕсли;
		
	ИначеЕсли Элементы.СтраницыОсновные.ТекущаяСтраница=Элементы.СтраницыОсновные.ПодчиненныеЭлементы.ЭкспортВыписок Тогда
		ВыгрузитьВФайл();
	КонецЕсли;
КонецПроцедуры //КнопкаВыполнитьНажатие()

&НаКлиенте
Процедура ПанельПараметрыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя="ЭкспортВыписок" Тогда
		Элементы.КнопкаВыполнить.Заголовок = "Выгрузить";
		Элементы.КнопкаВыполнить.Доступность = Истина;
	ИначеЕсли ТекущаяСтраница.Имя="ИмпортДанных" Тогда
		Элементы.КнопкаВыполнить.Заголовок = "Загрузить";
		Элементы.КнопкаВыполнить.Доступность = Истина;
	Иначе
		Элементы.КнопкаВыполнить.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры //ПанельПараметрыПриСменеСтраницы()

&НаКлиенте
Процедура УстановкаСнятиеФлажков(Команда)
	Для Каждого Строка Из Объект.ДокументыДляВыгрузки Цикл
		Строка.Пометка = ?(Команда.Имя="ДокументыПометитьВсе", Истина, Ложь);
	КонецЦикла;
КонецПроцедуры //УстановкаСнятиеФлажков()

&НаКлиенте
Процедура УстановкаСнятиеФлажковСпискаФайлов(Команда)
	Для Каждого Строка Из Объект.СписокФайлов Цикл
		Строка.Пометка = ?(Команда.Имя="ФайлыПометитьВсе", Истина, Ложь);
	КонецЦикла;
КонецПроцедуры //УстановкаСнятиеФлажковСпискаФайлов()

&НаКлиенте
Процедура КоманднаяПанельВидыДокументовПометитьВсе(Команда)
	Для Каждого ТекВидДокумента Из Объект.ВидыДокументов Цикл
		ТекВидДокумента.Пометка = (Команда.Имя = "ВидыПометитьВсе");
	КонецЦикла;
КонецПроцедуры //КоманднаяПанельВидыДокументовПометитьВсе()

&НаКлиенте
Процедура КоманднаяПанельСпискаФайловОбновить(Команда)
	ЗаполнитьСписокДоступныхДляЗагрузкиФайлов();
КонецПроцедуры //КоманднаяПанельСпискаФайловОбновить()

&НаКлиенте
Процедура КоманднаяПанельСпискаФайловУдалитьФайлы(Команда)
	Для Каждого Строка Из Объект.СписокФайлов Цикл
		Если Строка.Пометка Тогда
			УдалитьФайлы(Строка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьСписокДоступныхДляЗагрузкиФайлов();
КонецПроцедуры //КоманднаяПанельСпискаФайловУдалитьФайлы()

&НаКлиенте
Процедура СтрокаПодключенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ТекстоваяТС Тогда
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок					= "Выберите файл БД соответствий...";
		Диалог.ПолноеИмяФайла				= Объект.СтрокаПодключения;
		Диалог.Фильтр						= "Текстовая база данных (*.bds)|*.bds|";
		Диалог.Расширение					= "bds";
		Диалог.ПроверятьСуществованиеФайла	= Истина;
		Если Диалог.Выбрать() Тогда
			Объект.СтрокаПодключения = Диалог.ПолноеИмяФайла;
		КонецЕсли;
	Иначе
		Connection = Новый COMОбъект("ADODB.Connection");
		Connection.ConnectionString = Объект.СтрокаПодключения;
		DataLinks = Новый COMОбъект("DataLinks");
		DataLinks.PromptEdit(Connection);
		Объект.СтрокаПодключения = Connection.ConnectionString;
		Если ЗначениеЗаполнено(Объект.СтрокаПодключения) Тогда
			Попытка
				Connection = Новый COMОбъект("ADODB.Connection");
				Connection.Open(СокрЛП(Объект.СтрокаПодключения));
				Command = Новый COMОбъект("ADODB.Command");
				Command.ActiveConnection = Connection;
				RecordSet = Новый COMОбъект("ADODB.Recordset");
			Исключение
				Сообщить("Ошибка подключения к БД соответствий объектов" + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
				Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры //СтрокаПодключенияНачалоВыбора()

&НаКлиенте
Процедура КаталогОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог для обмена ...";
	Диалог.Каталог = Объект.КаталогОбмена;
	Если Диалог.Выбрать() Тогда
		Объект.КаталогОбмена = Диалог.Каталог;
	КонецЕсли;
	
	ЗаполнитьСписокДоступныхДляЗагрузкиФайлов();
КонецПроцедуры //КаталогОбменаНачалоВыбора()

&НаКлиенте
Процедура НеМенятьНомерИсхСчФПриИзменении(Команда)
	Если Объект.НеМенятьНомерИсхСчФ Тогда
		ПоказатьПредупреждение(, "Запрет изменения номера Счет-Фактуры может привести
						|к невозможности создания документа, поскольку
						|такой номер может уже присутствовать в ИБ!", , "Предупреждение !");
	КонецЕсли;
КонецПроцедуры //НеМенятьНомерИсхСчФПриИзменении()

&НаКлиенте
Процедура ПанельВыписокПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОбновитьСписокДокументов(ТекущаяСтраница.Имя<>"Документы");
КонецПроцедуры //ПанельВыписокПриСменеСтраницы()

&НаКлиенте
Процедура КоманднаяПанельДокументыВыгрузкиПерезаполнить(Команда)
	ОбновитьСписокДокументов();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// проверка соответствия релиза
	ТекРелизБП	= ПолучитьВерсиюБД();
	РелизыБП	= "3.0.67.38";
	
	//Если Найти(РелизыБП,ТекРелизБП)=0 Тогда
	//	ПоказатьПредупреждение(, "Этот модуль обмена предназначен для работы только с 1С:Бухгалтерия " + РелизыБП + Символы.ПС + "Необходимо обязательно обновить модули обмена !!!" + Символы.ПС + "Продолжение использования устаревших модулей обмена, может приводить к ошибкам в работе !", , "Предупреждение !");
	//	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " Этот модуль УСТАРЕЛ, обновите модули обмена !!!";
	//	//Отказ = Истина;
	//КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СтрокаПодключения) Тогда
		Объект.СтрокаПодключения = "Provider=SQLOLEDB.1;Password=123321123;Persist Security Info=True;User ID=Obmen;Initial Catalog=ObmenESUR_BUH;Data Source=10.0.4.8";
	КонецЕсли;
	
		Объект.КаталогОбмена = "\\serv2012\esur_buh\2026-06-21";
	
	ПроверкаПервогоЗапуска(Отказ);
	
	Если ЗначениеЗаполнено(Объект.КаталогОбмена) Тогда
		ЗаполнитьСписокДоступныхДляЗагрузкиФайлов();
	Иначе
		Сообщить("Определите каталог обмена.", СтатусСообщения.Информация);
	КонецЕсли;
	
	Объект.ТекстоваяТС = ЗначениеЗаполнено(Объект.СтрокаПодключения) И Найти(Объект.СтрокаПодключения, "Provider=")=0;
КонецПроцедуры //ПриОткрытии()

&НаКлиенте
Процедура ДокументыДляВыгрузкиДокументПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТекстоваяТСПриИзменении(Элемент)
	Если Объект.ТекстоваяТС И Найти(Объект.СтрокаПодключения, "Provider=")>0 Тогда
		Объект.СтрокаПодключения = "";
	ИначеЕсли НЕ Объект.ТекстоваяТС И Найти(Объект.СтрокаПодключения, "Provider=")=0 Тогда
		Объект.СтрокаПодключения = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОчиститьБазуНажатие(Команда)
	Если ЗначениеЗаполнено(ИмяБазы) Тогда
		Если Команда.Имя="ОчиститьБазу" Тогда
			ВопросОчистки();
		Иначе
			СтрокаXML = "";
			СозданиеБазыСоответствийНаСервере(Ложь, СтрокаXML);
			
			Если ТипБазыСоответствий=2 Тогда
				ТекстСоотв = Новый ЗаписьТекста(ИмяБазы);
				ТекстСоотв.Записать(СтрокаXML);
				ТекстСоотв.Закрыть();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры //СоздатьОчиститьБазуНажатие()

&НаКлиенте
Процедура ТипБазыСоответствийПриИзменении(Элемент)
	SQL = (ТипБазыСоответствий=0);
	Если ТипБазыСоответствий=0 Тогда
		Элементы.ИмяБазы.Заголовок					= "Имя базы:";
		Элементы.ИмяБазы.КнопкаВыбора				= Ложь;
		Элементы.ИмяСервера.ОтметкаНезаполненного	= Истина;
		Элементы.Login.ОтметкаНезаполненного		= Истина;
		ИмяБазы										= "";
	ИначеЕсли ТипБазыСоответствий=1 Тогда
		Элементы.ИмяБазы.Заголовок					= "Имя файла:";
		Элементы.ИмяБазы.КнопкаВыбора				= Истина;
		Элементы.ИмяСервера.ОтметкаНезаполненного	= Ложь;
		Элементы.Login.ОтметкаНезаполненного		= Ложь;
		ИмяБазы										= "";
		ИмяСервера									= "";
		Login										= "";
		Password									= "";
	ИначеЕсли ТипБазыСоответствий=2 Тогда
		Элементы.ИмяБазы.Заголовок					= "Имя файла:";
		Элементы.ИмяБазы.КнопкаВыбора				= Истина;
		Элементы.ИмяСервера.ОтметкаНезаполненного	= Ложь;
		Элементы.Login.ОтметкаНезаполненного		= Ложь;
		ИмяБазы										= "";
		ИмяСервера									= "";
		Login										= "";
		Password									= "";
	КонецЕсли;
	
	Элементы.ИмяСервера.Доступность			= SQL;
	Элементы.Login.Доступность				= SQL;
	Элементы.Password.Доступность			= SQL;
	Элементы.КнопкаОчистить.Доступность		= SQL;
КонецПроцедуры //ТипБазыСоответствийПриИзменении()

&НаКлиенте
Процедура ИмяБазыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок					= "Сохранить файл как ...";
	Диалог.ПолноеИмяФайла				= ИмяБазы;
	Диалог.Фильтр						= ?(ТипБазыСоответствий=1, "Формат MS Access (*.mdb)|*.mdb|", "Текстовая база данных (*.bds)|*.bds|");
	Диалог.Расширение					= ?(ТипБазыСоответствий=1, "mdb", "bds");
	Диалог.ПроверятьСуществованиеФайла	= Истина;
	Если Диалог.Выбрать() Тогда
		ИмяБазы = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры //ИмяБазыНачалоВыбора()

&НаКлиенте
Процедура ВопросОчистки()
	Оповещение = Новый ОписаниеОповещения("ОтветНаВопросОчистки", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "База соответствий объектов будет безвозвратно очищена !
		|После очистки, соответствия объектов придется устанавливать заново.
		|Очистить базу соответствий ?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, ""); 
КонецПроцедуры //ВопросОчистки()

&НаКлиенте
Процедура ОтветНаВопросОчистки(Результат, Параметры) Экспорт
	Если Результат=КодВозвратаДиалога.Да Тогда
		СозданиеБазыСоответствийНаСервере(Истина);
	КонецЕсли;
КонецПроцедуры //ОбработкаОтчетаНаВопросОчистки()

