// Модуль менеджера регистра сведений "Сведения компании"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ЗаписьЗначенияРегистраСведенияКомпании(Организация, ВидОбъекта, Значение) Экспорт
	
	Отказ = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Чтение старого значения регистра
	СтруктураОтбора=Новый Структура("Организация,Объект",Организация,ВидОбъекта);
	СтруктураСведений=РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(НачалоДня(ТекущаяДатаСеанса()),СтруктураОтбора);
	ЗначениеСтарое=СтруктураСведений.Значение;
	//Проверим, а есть что записывать
	Если (ЗначениеЗаполнено(Значение)) ИЛИ (СтруктураСведений.Количество()>0) Тогда
		//Значение параметра изменилось
		Если Значение<>ЗначениеСтарое Тогда
			ЗаписьРегСведений=РегистрыСведений.СведенияКомпании.СоздатьМенеджерЗаписи();
			ЗаписьРегСведений.Организация=Организация;
			ЗаписьРегСведений.Объект=ВидОбъекта;
			ЗаписьРегСведений.Значение=Значение;
			Если СтруктураСведений.Количество()>0 Тогда
				//Если запись уже существовала, установим рабочую дату
				ЗаписьРегСведений.Период=НачалоДня(ТекущаяДатаСеанса());
			Иначе
				//Если записи еще не было, установим дату начала ...
				ЗаписьРегСведений.Период=Дата("198001010000");
			КонецЕсли; 
			Попытка
				ЗаписьРегСведений.Записать();
			Исключение
				ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),,,, Отказ);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты регистра
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли