
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
// Функция по полю "Представление" заполняет структуры полей для номера телефона
//
// Параметры:
//	Представление	- Строка	- Представление номера телефона
//
// Возвращаемое значение:
//	Структура	- Структура телефонного номера
//
Функция сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Представление) Экспорт
	КодСтраны		= "";
	КодГорода		= "";
	НомерТелефона	= "";
	Добавочный		= "";
	Комментарий		= "";
	ТекСтр = СокрЛП(Представление);
	// Вырежем добавочный номер с комментарием
	ПозДоб = СтрНайти(ВРЕГ(ТекСтр), "ДОБ.");
	Если ПозДоб > 0 Тогда
		ДобавочныйСКомментарием = СокрЛП(Сред(ТекСтр, ПозДоб + 4));
		ТекСтр = СокрЛП(Лев(ТекСтр, ПозДоб - 1));
		Если Прав(ТекСтр, 1) = "," Тогда
			ТекСтр = Лев(ТекСтр, СтрДлина(ТекСтр) - 1);
		КонецЕсли;
		ПозДоб = СтрНайти(ВРЕГ(ДобавочныйСКомментарием), ", ");
		Если ПозДоб > 0 Тогда
			Добавочный	= СокрЛП(Лев(ДобавочныйСКомментарием, ПозДоб - 1));
			Комментарий	= СокрЛП(Сред(ДобавочныйСКомментарием, ПозДоб + 2));
		Иначе
			Добавочный = ДобавочныйСКомментарием;
		КонецЕсли;
	КонецЕсли;
	// Вырежем код города
	Поз = СтрНайти(ТекСтр, "(");
	Если Поз > 0 Тогда
		КодСтраны = СокрЛП(Лев(ТекСтр, Поз - 1));
		ТекСтр = СокрЛП(Сред(ТекСтр, Поз + 1));
		Поз = СтрНайти(ТекСтр, ")");
		Если Поз > 0 Тогда
			КодГорода = СокрЛП(Лев(ТекСтр, Поз - 1));
			ТекСтр = СокрЛП(Сред(ТекСтр, Поз + 1));
		КонецЕсли;
	КонецЕсли;
	Поз = СтрНайти(текСтр, ", ");
	// Если Добавочного номера нет - ориентируемся по номеру телефона и комментарию
	Если (ПозДоб = 0) И (Поз > 0) Тогда
		// Вырежем комментарий
		НомерТелефона = СокрЛП(Лев(ТекСтр, Поз - 1));
		Комментарий = СокрЛП(Сред(ТекСтр, Поз + 2));
	Иначе
		// Все оставшееся это номер
		НомерТелефона = ТекСтр;
	КонецЕсли;
	// Удаляем лишние символы из номера телефона
	НомерТелефона = смсОтправкаSMSЧерезSMS4B.смсОчиститьНомераТелефона(НомерТелефона);
	// Если номер телефона не разобран, то заново разбираем его
	ДлинаНомера = СтрДлина(НомерТелефона);
	Если ПустаяСтрока(КодГорода) И (ДлинаНомера > 4) Тогда
		// Выделяем код страны
		Если ДлинаНомера > 10 Тогда
			КодСтраны = Лев(НомерТелефона, ДлинаНомера - 10);
			НомерТелефона = Сред(НомерТелефона, ДлинаНомера - 9);
			Если КодСтраны = "8" Тогда
				КодСтраны = "+7";
			ИначеЕсли НЕ СтрНайти(КодСтраны, "+") = 1 Тогда
				КодСтраны = "+" + КодСтраны;
			КонецЕсли;	
			ДлинаНомера = СтрДлина(НомерТелефона);
		КонецЕсли;	
		// Выделяем код города
		Если ДлинаНомера = 10 Тогда
			КодГорода		= Лев(НомерТелефона, 3);
			НомерТелефона	= Сред(НомерТелефона, 4);
		КонецЕсли;	
	КонецЕсли;	
	Если ПустаяСтрока(КодСтраны) Тогда
		КодСтраны = "+7";
	КонецЕсли;	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("КодСтраны",		КодСтраны);
	СтруктураПолей.Вставить("КодГорода",		КодГорода);
	СтруктураПолей.Вставить("НомерТелефона",	НомерТелефона);
	СтруктураПолей.Вставить("Добавочный",		Добавочный);
	СтруктураПолей.Вставить("Комментарий",		Комментарий);
	Возврат СтруктураПолей;
КонецФункции // сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон()

&НаСервереБезКонтекста
// Функция возвращает массив структур имен и синонимов справочников, имеющих табличную часть "КонтактнаяИнформация"
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Массив	- Массив имен справочников
//
Функция ПолучитьМассивСтруктурСправочников()
	МассивСтруктурСправочников = Новый Массив;
	УстановитьПривилегированныйРежим(Истина); 	
	// +Рарус Заменен на аналогичный определяемый тип
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.КонтактВзаимодействия.Тип.Типы() Цикл
	// -Рарус
	ТекущийСправочник = Новый(Тип);
		Если ТекущийСправочник.Метаданные().ТабличныеЧасти.Найти("КонтактнаяИнформация") = Неопределено Тогда Продолжить; КонецЕсли;
		СтруктураСправочника = Новый Структура;
		СтруктураСправочника.Вставить("Имя",		ТекущийСправочник.Метаданные().Имя);
		СтруктураСправочника.Вставить("Синоним",	ТекущийСправочник.Метаданные().Синоним);
		МассивСтруктурСправочников.Добавить(СтруктураСправочника);	
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь); 	
	Возврат МассивСтруктурСправочников;
КонецФункции // SMS4B_ПолучитьМассивСтруктурСправочников()

&НаСервереБезКонтекста
// Функция возвращает массив элементов переданного справочника
//
// Параметры:
//	Справочник	- Строка	- Имя справочника в конфигурации
//
// Возвращаемое значение:
//	Массив	- Массив элементов справочника
//
Функция ПолучитьМассивКонтактов(Справочник, ТекущийВладелец = Неопределено)
	МассивКонтактов = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", ТекущийВладелец);
	Запрос.Текст = "";
 	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	Получатели.Ссылка
	               |ИЗ
	               |	Справочник." + Справочник + " КАК Получатели
	               |ГДЕ
	               |	НЕ Получатели.ПометкаУдаления";
	УстановитьПривилегированныйРежим(Истина); 	
	Если ЗначениеЗаполнено(ТекущийВладелец) И (Метаданные.Справочники[Справочник].Владельцы.Количество() > 0) Тогда
		Запрос.Текст = Запрос.Текст + "
				   |	И Получатели.Владелец = &Владелец";
	КонецЕсли;	
	УстановитьПривилегированныйРежим(Ложь); 	
	Запрос.Текст = Запрос.Текст + "
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Получатели.Наименование";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.Ссылка.ЭтоГруппа Тогда
			МассивКонтактов.Добавить(Выборка.Ссылка);
		КонецЕсли;	
	КонецЦикла;	
	Возврат МассивКонтактов;
КонецФункции // ПолучитьМассивКонтактов()

&НаСервереБезКонтекста
// Функция возвращает владельца переданного справочника
//
// Параметры:
//	Справочник	- Строка	- Имя справочника в конфигурации
//
// Возвращаемое значение:
//	Строка	- Имя справочника-владельца в конфигурации
//
Функция ПолучитьВладельца(Справочник)
	ИмяВладельцаСправочника = "";
	УстановитьПривилегированныйРежим(Истина); 	
	Для Каждого ВладелецСправочника Из Метаданные.Справочники[Справочник].Владельцы Цикл
		ИмяВладельцаСправочника = ВладелецСправочника.Имя;
		Прервать;
	КонецЦикла;	
	УстановитьПривилегированныйРежим(Ложь); 	
	Возврат ИмяВладельцаСправочника;
КонецФункции // ПолучитьВладельца()	

&НаСервере
Функция ПолучитьМассивТелефоновИФаксов(Ссылка)
	МассивТелефоновИФаксов = Новый Массив;
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Попытка
			ТаблицКИ = Ссылка.КонтактнаяИнформация;
		Исключение
			ТаблицКИ = Новый ТаблицаЗначений;
		КонецПопытки;	
		Для Каждого СтрокаКИ Из ТаблицКИ Цикл
			Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
				Если НЕ ПустаяСтрока(СтрокаКИ.Представление) Тогда
					СтруктураКИ = Новый Структура;
					СтруктураКИ.Вставить("Вид", 			СтрокаКИ.Вид);
					СтруктураКИ.Вставить("Представление",	СтрокаКИ.Представление);
					МассивТелефоновИФаксов.Добавить(СтруктураКИ);
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	Возврат МассивТелефоновИФаксов;
КонецФункции // ПолучитьМассивТелефоновИФаксов()	

&НаСервере
// Процедура заполняет таблицу телефонов для объекта
//
// Параметры:
//	Ссылка	- Произвольный	- ссылка на владельца телефонов
//
Процедура ЗаполнитьТаблицуТелефонов(Ссылка)
	СписокТелефонов.Очистить();
	МассивТелефонов = ПолучитьМассивТелефоновИФаксов(Ссылка);
	Для Каждого ЭлементМассива Из МассивТелефонов Цикл
		НоваяСтрока					= СписокТелефонов.Добавить();
		НоваяСтрока.Вид 			= ЭлементМассива.Вид;
		НоваяСтрока.Представление	= ЭлементМассива.Представление;
		НоваяСтрока.Ссылка 			= Ссылка;
	КонецЦикла;
КонецПроцедуры // ЗаполнитьТаблицуТелефонов()

&НаКлиенте
// Процедура - обработчик события "ПриАктивизацииСтроки" табличной части "Контакты"
//
// Параметры:
//	Нет.
//
Процедура ОбработчикКонтактыПриАктивизацииСтроки()
	ТД = Элементы.Контакты.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	ИначеЕсли ТекущийКонтакт = ТД.Ссылка Тогда
		Возврат;
	КонецЕсли;
	ТекущийКонтакт = ТД.Ссылка;
	ЗаполнитьТаблицуТелефонов(ТД.Ссылка);
КонецПроцедуры // ОбработчикКонтактыПриАктивизацииСтроки()

&НаКлиенте
// Процедура выполняет действия после выбора номера телефона
//
// Параметры:
//	ВыбраннаяСтрока	- СтрокаТабличнойЧасти	- Выбранная строка
//
Процедура ВыбратьКонтакт(ВыбраннаяСтрока)
	Если ВыбраннаяСтрока = Неопределено Тогда Возврат; КонецЕсли;
	ТаблицаАдресатов = ЭтаФорма.ВладелецФормы.Объект.Адресаты;
	НоваяСтрока = ТаблицаАдресатов.Добавить();
	НоваяСтрока.Контакт					= ВыбраннаяСтрока.Ссылка;
 	// +Рарус
	НоваяСтрока.ПредставлениеКонтакта	= ВыбраннаяСтрока.Ссылка;
	// -Рарус
	СтруктураПолей 	= сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(ВыбраннаяСтрока.Представление);
	ПредставлениеНомера = "";
	Если НЕ ПустаяСтрока(СтруктураПолей.КодСтраны) Тогда
		Если ЛЕВ(СтруктураПолей.КодСтраны, 1) = "+" Тогда 	
			ПредставлениеНомера	= ПредставлениеНомера + СтруктураПолей.КодСтраны;
		Иначе
			ПредставлениеНомера	= ПредставлениеНомера + "+" + СтруктураПолей.КодСтраны;
		КонецЕсли;	
	КонецЕсли;	
	НоваяСтрока.НомерДляОтправки	= ПредставлениеНомера + СтруктураПолей.КодГорода + СтруктураПолей.НомерТелефона;
	Если НЕ ПустаяСтрока(СтруктураПолей.КодГорода) Тогда
		ПредставлениеНомера	= ПредставлениеНомера + "(" + СтруктураПолей.КодГорода + ")";
	КонецЕсли;
	Если НЕ ПустаяСтрока(СтруктураПолей.НомерТелефона) Тогда
		ПредставлениеНомера	= ПредставлениеНомера + СтруктураПолей.НомерТелефона;
	КонецЕсли;
	НоваяСтрока.КакСвязаться		= ПредставлениеНомера;
	НоваяСтрока.СостояниеСообщения	= ПредопределенноеЗначение("Перечисление.СостоянияСообщенияSMS.Черновик");
	ЭтаФорма.ВладелецФормы.КоличествоАдресатов	= ТаблицаАдресатов.Количество();
	ЭтаФорма.ВладелецФормы.ИзменилисьКонтакты	= Истина;
КонецПроцедуры // ВыбратьКонтакт()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ДЕЙСТВИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события "ОбработкаВыбора" элемента формы "ТекущийСправочник"
//
Процедура ТекущийСправочникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущийВладелец = Неопределено;
	ИмяВладельца = ПолучитьВладельца(ВыбранноеЗначение);
	Если ЗначениеЗаполнено(ИмяВладельца) Тогда
		Элементы.ТекущийВладелец.Видимость = Истина;
		Элементы.ТекущийВладелец.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка." + ИмяВладельца);
	Иначе
		Элементы.ТекущийВладелец.Видимость = Ложь;
	КонецЕсли;
	ТекущийСправочник = ВыбранноеЗначение;
	ТекущийВладелецПриИзменении(Элемент);	
КонецПроцедуры // ТекущийСправочникОбработкаВыбора()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" элемента формы "ТекущийВладелец"
//
Процедура ТекущийВладелецПриИзменении(Элемент)
	Контакты.Очистить();
	СписокТелефонов.Очистить();
	МассивКонтактов = ПолучитьМассивКонтактов(ТекущийСправочник, ТекущийВладелец);
	Для Каждого ЭлементМассива Из МассивКонтактов Цикл
		НоваяСтрока			= Контакты.Добавить();
		НоваяСтрока.Ссылка	= ЭлементМассива;
	КонецЦикла;	
	ТекущийКонтакт = Неопределено;
КонецПроцедуры // ТекущийВладелецПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ОбработкаВыбора" элемента формы "ТекущийВладелец"
//
Процедура ТекущийВладелецНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",			Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",	Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",	Ложь);
	Если ЗначениеЗаполнено(ТекущийВладелец) Тогда
		ПараметрыФормы.Вставить("ТекущаяСтрока",	ТекущийВладелец);
	КонецЕсли;	
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);	
	ОткрытьФорму("Справочник." + ИмяВладельца + ".ФормаВыбора", ПараметрыФормы, Элемент, , ВариантОткрытияОкна.ОтдельноеОкно);
КонецПроцедуры // ТекущийВладелецНачалоВыбора()

&НаКлиенте
// Процедура - обработчик события "Очистка" элемента формы "ТекущийВладелец"
//
Процедура ТекущийВладелецОчистка(Элемент, СтандартнаяОбработка)
	Владелец = Неопределено;
	ТекущийВладелецПриИзменении(Элемент);
КонецПроцедуры // ТекущийВладелецОчистка()

&НаКлиенте
// Процедура - обработчик события "Выбор" таблицы формы "Контакты"
//
Процедура КонтактыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТД = Элементы.СписокТелефонов.ТекущиеДанные;
	Если (ТД = Неопределено) И (СписокТелефонов.Количество() > 0) Тогда
		ТД = СписокТелефонов[0];
	КонецЕсли;	
	ВыбратьКонтакт(ТД);
КонецПроцедуры // КонтактыВыбор()

&НаКлиенте
// Процедура - обработчик события "ПриАктивизацииСтроки" таблицы формы "Контакты"
//
Процедура КонтактыПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ОбработчикКонтактыПриАктивизацииСтроки", 0.1, Истина);
КонецПроцедуры // КонтактыПриАктивизацииСтроки()

&НаКлиенте
// Процедура - обработчик события "ПередНачаломДобавления" таблицы формы "Контакты"
//
Процедура КонтактыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры // КонтактыПередНачаломДобавления()

&НаКлиенте
// Процедура - обработчик события "ПередУдалением" таблицы формы "Контакты"
//
Процедура КонтактыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры // КонтактыПередУдалением()

&НаКлиенте
// Процедура - обработчики события "Выбор" элемента формы "СписокТелефонов"
//
Процедура СписокТелефоновВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТД = Элементы.СписокТелефонов.ТекущиеДанные;
	ВыбратьКонтакт(ТД);
КонецПроцедуры // СписокТелефоновВыбор()

&НаКлиенте
// Процедура - обработчики события "ПередНачаломДобавления" элемента формы "СписокТелефонов"
//
Процедура СписокТелефоновПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры // СписокТелефоновПередНачаломДобавления()

&НаКлиенте
// Процедура - обработчики события "ПередУдалением" элемента формы "СписокТелефонов"
//
Процедура СписокТелефоновПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры // СписокТелефоновПередУдалением()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТекущийСправочник") Тогда
		ЭтаФорма.ТекущийСправочник = Параметры.ТекущийСправочник;
	КонецЕсли;	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Процедура - обработчик события формы "ПриОткрытии"
//
Процедура ПриОткрытии(Отказ)
	МассивСтруктурСправочников = ПолучитьМассивСтруктурСправочников();
	Если МассивСтруктурСправочников.Количество() = 0 Тогда
		Отказ = Истина;
	Иначе
		Элементы.ТекущийСправочник.СписокВыбора.Очистить();
		Для Каждого ЭлементМассива Из МассивСтруктурСправочников Цикл
			Элементы.ТекущийСправочник.СписокВыбора.Добавить(ЭлементМассива.Имя, ЭлементМассива.Синоним);
		КонецЦикла;	
		Элементы.ТекущийСправочник.СписокВыбора.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
		Если ПустаяСтрока(ТекущийСправочник) Тогда
			ТекущийСправочник = Элементы.ТекущийСправочник.СписокВыбора[0].Значение;
		ИначеЕсли Элементы.ТекущийСправочник.СписокВыбора.НайтиПоЗначению(ТекущийСправочник) = Неопределено Тогда			
			ТекущийСправочник = Элементы.ТекущийСправочник.СписокВыбора[0].Значение;
		КонецЕсли;	
		ТекущийСправочникОбработкаВыбора(Неопределено, ТекущийСправочник, Истина);
	КонецЕсли;
КонецПроцедуры // ПриОткрытии()
