
#Область Общие_Процедуры_И_Функции

&НаСервере
Процедура сфпСформироватьДеревоАбонентов()
	ДеревоАбонентов.ПолучитьЭлементы().Очистить();
	Если СписокОбъектов.Количество() = 0 Тогда Возврат; КонецЕсли;
	КореньДерева = ДеревоАбонентов.ПолучитьЭлементы();
	КоличествоНедоступных = 0;
	Для Каждого ЭлементСписка Из СписокОбъектов Цикл
		СсылкаНаЭлемент = ЭлементСписка.Значение;
		Если Найти(СсылкаНаЭлемент, "Объект не найден") > 0 Тогда
			УстановитьПривилегированныйРежим(Истина);
			Недоступен = Истина;
			КоличествоНедоступных = КоличествоНедоступных + 1;
		Иначе
			Недоступен = Ложь;
		КонецЕсли;
		Если ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.Контрагенты") Тогда 
			ВладелецКонтакта = сфпСофтФонПроСервер.сфпПолучитьВладельца(СсылкаНаЭлемент);
			Если Не ЗначениеЗаполнено(ВладелецКонтакта) Тогда
				ВеткаДерева = КореньДерева.Добавить();
				ВеткаДерева.Ссылка = СсылкаНаЭлемент;
				Если СсылкаНаЭлемент.ФормаСобственности = ПредопределенноеЗначение("Перечисление.ФормыСобственности.ЧастноеЛицо") 
				ИЛИ СсылкаНаЭлемент.ФормаСобственности = ПредопределенноеЗначение("Перечисление.ФормыСобственности.ИндивидуальныйПредприниматель") Тогда
					ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + НСтр("ru = ' (контрагент, физ. лицо)'");
				Иначе
					ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + НСтр("ru = ' (контрагент, юр. лицо)'");
				КонецЕсли;
				ВеткаДерева.Недоступен 	= Недоступен;
			Иначе
				ВеткаДерева 			= КореньДерева.Добавить();
				ВеткаДерева.Ссылка 		= СсылкаНаЭлемент;
				ВеткаДерева.Объект 		= Строка(СсылкаНаЭлемент) + " <" + Строка(ВладелецКонтакта) + ">" + НСтр("ru = ' (контактное лицо контрагента)'");
				ВеткаДерева.Недоступен 	= Недоступен;
			КонецЕсли;
		ИначеЕсли ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.Пользователи") И НЕ ТолькоКлиентыИКЛ Тогда
			ВеткаДерева = КореньДерева.Добавить();
			ВеткаДерева.Ссылка = СсылкаНаЭлемент;				
			ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + НСтр("ru = ' (пользователь)'");
		ИначеЕсли ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.Сотрудники") И НЕ ТолькоКлиентыИКЛ Тогда
			ВеткаДерева = КореньДерева.Добавить();
			ВеткаДерева.Ссылка = СсылкаНаЭлемент;				
			ВеткаДерева.Объект = Строка(СсылкаНаЭлемент) + НСтр("ru = ' (сотрудник)'");
		КонецЕсли;
		Если ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЦикла;
	Если КоличествоНедоступных > 0 Тогда
		Элементы.ДекорацияНедоступен.Видимость = Истина;
	КонецЕсли;
	Если ДеревоАбонентов.ПолучитьЭлементы().Количество() = КоличествоНедоступных Тогда
		Элементы.ДекорацияНетКлиентов.Видимость = Истина;
		Элементы.ФормаОткрытьОбъект.Видимость	= Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура сфпСформироватьЗаголовокФормы(ПодборНомера)
	Если ПодборНомера Тогда
		Заголовок = НСтр(" ru = 'Выберите контакт для номера '") + НомерТелефона;
	Иначе
		Заголовок = НСтр("ru = 'Выберите связанный объект '");
	КонецЕсли;		
КонецПроцедуры	

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Цвет текста
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоАбонентов");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоАбонентов.Недоступен");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_Событий_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();
	Если НЕ Параметры.Свойство("СписокОбъектов") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	СписокОбъектов = Параметры.СписокОбъектов;
	Если Параметры.Свойство("НомерТелефона") Тогда
		НомерТелефона = Параметры.НомерТелефона;
	КонецЕсли;	
	Если Параметры.Свойство("ТолькоКлиентыИКЛ") Тогда
		ТолькоКлиентыИКЛ = Параметры.ТолькоКлиентыИКЛ;
	КонецЕсли;		
	сфпСформироватьЗаголовокФормы(НЕ Параметры.Свойство("ПодборВСобытие"));
	сфпСформироватьДеревоАбонентов();
КонецПроцедуры

#КонецОбласти

#Область Обработчики_Событий_Элементов_Формы

&НаКлиенте
Процедура ДеревоАбонентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ДеревоАбонентов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда Возврат КонецЕсли;
	Если ТекДанные.Недоступен Тогда
		ТекстСообщения = НСтр("ru = 'Данный контакт недоступен текущему пользователю.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	Закрыть(ТекДанные.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область Обработчики_Команд_Формы

&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	ТекДанные = Элементы.ДеревоАбонентов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Не выбран контакт.'"),5);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекДанные.Ссылка) Тогда
		ПоказатьЗначение(,ТекДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
