#Область СлужебныеПроцедурыИФункции

Функция СформироватьОтвет(Запрос, ИмяМетода)
	
	Если ТипЗнч(Запрос) = Тип("HTTPСервисЗапрос") Тогда
		Ответ = бит_ЯндексЕда.НачатьОбработкуЗапроса(Запрос, ИмяМетода);
	Иначе
		Ответ = Новый HTTPСервисОтвет(403);
	КонецЕсли;
	ЗаполнитьОбязательныеЗаголовкиОтвета(Ответ);
	Возврат Ответ;
	
КонецФункции

Процедура ЗаполнитьОбязательныеЗаголовкиОтвета(Ответ)
	Заголовки = Ответ.Заголовки;
	Заголовки["Cache-Control"] = "private, max-age=0, no-cache, no-store";
	Заголовки["Expires"] = Формат(ТекущаяДатаСеанса(), "ДФ='дд ММ гггг ЧЧ:мм:сс'");
	Заголовки["ETag"] = "";
	Заголовки["Vary"] = "User-Agent";
	Заголовки["Pragma"] = "no-cache";
КонецПроцедуры

Функция ПроверкаСоединения(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("Myasnitsky Ryad, Integration with Yandex.Eda", "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	ЗаполнитьОбязательныеЗаголовкиОтвета(Ответ);
	Возврат Ответ;
КонецФункции

#КонецОбласти


#Область ОбработчикиЗапросов

Функция Авторизация(Запрос)
	
	ИмяМетода = "Авторизация";
	Возврат СформироватьОтвет(Запрос, ИмяМетода);

КонецФункции

Функция ПолучитьСписокНоменклатуры(Запрос)
	
	ИмяМетода = "ПолучитьСписокНоменклатуры";
	Возврат СформироватьОтвет(Запрос, ИмяМетода);

КонецФункции

Функция ПолучитьОстаткиНоменклатуры(Запрос)
	
	ИмяМетода = "ПолучитьОстаткиНоменклатуры";
	Возврат СформироватьОтвет(Запрос, ИмяМетода);

КонецФункции

Функция ДобавитьЗаказ(Запрос)
	
	ИмяМетода = "ДобавитьЗаказ";
	Возврат СформироватьОтвет(Запрос, ИмяМетода);
	
КонецФункции

Функция ПолучитьЗаказ(Запрос)

	ИмяМетода = "ПолучитьЗаказ";
	Возврат СформироватьОтвет(Запрос, ИмяМетода);
		
КонецФункции

Функция ОбновитьЗаказ(Запрос)
	
	ИмяМетода = "ОбновитьЗаказ";
	Возврат СформироватьОтвет(Запрос, ИмяМетода);	
	
КонецФункции

Функция УдалитьЗаказ(Запрос)
	
	ИмяМетода = "УдалитьЗаказ";
	Возврат СформироватьОтвет(Запрос, ИмяМетода);
	
КонецФункции

Функция ПолучитьСтатусЗаказа(Запрос)
	
	ИмяМетода = "ПолучитьСтатусЗаказа";
	Возврат СформироватьОтвет(Запрос, ИмяМетода);

КонецФункции

#КонецОбласти
