// Модуль объекта документа "Таможенная декларация импорт"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Поступление товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПоступлениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения,
			СтандартнаяОбработка, "ТипЦен,ВалютаДокумента") Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Товары.Очистить();
	
	// получим данные документа основания
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииТоваровКомпании.СкладКомпании КАК Склад,
	|	ПартииТоваровКомпании.Номенклатура КАК Номенклатура,
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ПартииТоваровКомпании.Количество) КАК Количество,
	|	СУММА(ПартииТоваровКомпании.Сумма) КАК Сумма,
	|	СУММА(ПартииТоваровКомпании.СуммаУпр) КАК СуммаУпр,
	|	ПартииТоваровКомпании.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	ПартииТоваровКомпании.Номенклатура.КодТНВЭД КАК КодТНВЭД,
	|	ПартииТоваровКомпании.Номенклатура.ИмпортнаяПошлинаСтавка КАК ИмпортнаяПошлинаСтавка,
	|	ПартииТоваровКомпании.Номенклатура.ИмпортнаяПошлинаСпособРаспределения КАК ИмпортнаяПошлинаСпособРаспределения,
	|	ПартииТоваровКомпании.Номенклатура.АнтидемпинговаяПошлинаСтавка КАК АнтидемпинговаяПошлинаСтавка,
	|	ПартииТоваровКомпании.Номенклатура.АнтидемпинговаяПошлинаСпособРаспределения КАК АнтидемпинговаяПошлинаСпособРаспределения,
	|	ПартииТоваровКомпании.Номенклатура.СтавкаАкциза КАК СтавкаАкциза
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.Партия = &Партия
	|	И ТИПЗНАЧЕНИЯ(ПартииТоваровКомпании.Регистратор) В (ТИП(Документ.ПоступлениеТоваров), ТИП(Документ.КорректировкаПоступления), ТИП(Документ.ПоступлениеДопРасходов))
	|	И ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.СкладКомпании,
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.Номенклатура.СтавкаНДС,
	|	ПартииТоваровКомпании.Номенклатура.КодТНВЭД,
	|	ПартииТоваровКомпании.Номенклатура.ИмпортнаяПошлинаСтавка,
	|	ПартииТоваровКомпании.Номенклатура.ИмпортнаяПошлинаСпособРаспределения,
	|	ПартииТоваровКомпании.Номенклатура.АнтидемпинговаяПошлинаСтавка,
	|	ПартииТоваровКомпании.Номенклатура.АнтидемпинговаяПошлинаСпособРаспределения,
	|	ПартииТоваровКомпании.Номенклатура.СтавкаАкциза
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаУпр)
	|ПО
	|	СтавкаНДС,
	|	КодТНВЭД,
	|	ИмпортнаяПошлинаСпособРаспределения,
	|	ИмпортнаяПошлинаСтавка,
	|	АнтидемпинговаяПошлинаСпособРаспределения,
	|	АнтидемпинговаяПошлинаСтавка,
	|	СтавкаАкциза,
	|	Склад";	
	
	Запрос.УстановитьПараметр("Партия", ДанныеЗаполнения);
	
	ВыборкаНДС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// валюты и коэффициенты
	ВалютаРегл     = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	ВалютаУпр      = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУпр,Дата);
	КурсУпр        =  СтруктураКурса.Курс/?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	
	Сч = 0;
	Пока ВыборкаНДС.Следующий() Цикл
		ВыборкаКодТНВЭД = ВыборкаНДС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКодТНВЭД.Следующий() Цикл
			ВыборкаИмпортнаяПошлинаСпособРаспределения = ВыборкаКодТНВЭД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаИмпортнаяПошлинаСпособРаспределения.Следующий() Цикл
				ВыборкаИмпортнаяПошлинаСтавка = ВыборкаИмпортнаяПошлинаСпособРаспределения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаИмпортнаяПошлинаСтавка.Следующий() Цикл
					ВыборкаАнтидемпинговаяПошлинаСпособРаспределения = ВыборкаИмпортнаяПошлинаСтавка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаАнтидемпинговаяПошлинаСпособРаспределения.Следующий() Цикл
						ВыборкаАнтидемпинговаяПошлинаСтавка = ВыборкаАнтидемпинговаяПошлинаСпособРаспределения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаАнтидемпинговаяПошлинаСтавка.Следующий() Цикл
							ВыборкаСтавкаАкциза = ВыборкаАнтидемпинговаяПошлинаСтавка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ВыборкаСтавкаАкциза.Следующий() Цикл
								ВыборкаСклад = ВыборкаСтавкаАкциза.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Пока ВыборкаСклад.Следующий() Цикл
									
									// добавляем разделы
									Сч = Сч + 1;
									НовыйРаздел = Разделы.Добавить();
									НовыйРаздел.НомерРаздела = Сч;
									НовыйРаздел.СтавкаНДС							= ВыборкаСклад.СтавкаНДС;
									НовыйРаздел.ИмпортнаяПошлинаСпособРаспределения	= ВыборкаСклад.ИмпортнаяПошлинаСпособРаспределения;
									НовыйРаздел.ИмпортнаяПошлинаСтавка				= ВыборкаСклад.ИмпортнаяПошлинаСтавка;
									НовыйРаздел.АнтидемпинговаяПошлинаСпособРаспределения= ВыборкаСклад.АнтидемпинговаяПошлинаСпособРаспределения;
									НовыйРаздел.АнтидемпинговаяПошлинаСтавка		= ВыборкаСклад.АнтидемпинговаяПошлинаСтавка;
									НовыйРаздел.СтавкаАкциза						= ВыборкаСклад.СтавкаАкциза;
									
									Масса = 0;
									Объем = 0;
									ОбъемСпирта = 0;
									ВыборкаНоменклатура = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									Пока ВыборкаНоменклатура.Следующий() Цикл
										НовыйТовар = Товары.Добавить();
										ЗаполнитьЗначенияСвойств(НовыйТовар, ВыборкаНоменклатура);
										Документы.ТаможеннаяДекларацияИмпорт.ТоварыНоменклатураПриИзменении(ЭтотОбъект,НовыйТовар);
										
										НовыйТовар.НомерРаздела = Сч;
										НовыйТовар.Партия = ДанныеЗаполнения;
										НовыйТовар.ТаможеннаяСтоимость = ?(ВалютаДокумента = ВалютаРегл, ВыборкаНоменклатура.Сумма, РаботаСКурсамиВалют.ПересчитатьВВалюту(ВыборкаНоменклатура.СуммаУпр, ВалютаУпр, ВалютаДокумента,Дата));
										//Документы.ТаможеннаяДекларацияИмпорт.ТоварыТаможеннаяСтоимостьПриИзменении(ЭтотОбъект,НовыйТовар,НовыйРаздел);
										
										Масса = Масса + Документы.ТаможеннаяДекларацияИмпорт.ПолучитьЕдиницуИзмеренияПоБазовой(ВыборкаНоменклатура.Номенклатура).Вес * ВыборкаНоменклатура.Количество;
										Объем = Объем + ВыборкаНоменклатура.Номенклатура.Объем * ВыборкаНоменклатура.Количество;
										ОбъемСпирта = ОбъемСпирта + ВыборкаНоменклатура.Номенклатура.Объем * ВыборкаНоменклатура.Номенклатура.Крепость / 100 * ВыборкаНоменклатура.Количество;
									КонецЦикла;
									
									НовыйРаздел.Масса = Масса;
									НовыйРаздел.Объем = Объем;
									НовыйРаздел.ОбъемСпирта = ОбъемСпирта;
									НовыйРаздел.ТаможеннаяСтоимость = ?(ВалютаДокумента = ВалютаРегл, ВыборкаСклад.Сумма, РаботаСКурсамиВалют.ПересчитатьВВалюту(ВыборкаСклад.СуммаУпр, ВалютаУпр, ВалютаДокумента,Дата));
									Документы.ТаможеннаяДекларацияИмпорт.РазделыПосчитатьВсеНачисления(ЭтотОбъект, НовыйРаздел);
									Документы.ТаможеннаяДекларацияИмпорт.РаспределитьНаТовары(ЭтотОбъект, НовыйРаздел)
								КонецЦикла;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПоступлениеТоваров()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

// возвращает выборку по шапке
//
// Параметры:
//  ДокументСсылка - Ссылка на документ для которого получаем шапку.
//
// Возвращаемое значение:
//  Выборка - выборка по шапке
//
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	Док.Проект КАК Проект,
	/////////// ПРИВАТ ////////////
	|	Док.СкладКомпании КАК СкладКомпании,
	|	Док.СуммаДокумента КАК СуммаДокумента,
	|	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	Док.ДокументОснование КАК ДокументОснование
	|
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции // ПолучитьШапкуДокумента()

// формирует движения документа по партионным регистрам
//
// Параметры:
//  Режим           - режим проведения (оперативный/неоперативный)
//  ДокументСсылка  - ссылка на документ который надо допровести по партиям.
//
// Возвращаемое значение:
//  Возвращает Истина - все ОК, ложь - чего-то не так.
//
Функция ПровестиПоПартиям(Режим, ДокументСсылка)
	
	Отказ=Ложь;
	
	// получим шапку документа
	ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	
	// Проверим, если подразделение проводится по партиям "отложенно", то дальше не идем.
	НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	
	Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		Возврат НЕ Отказ;
	КонецЕсли;
	
	// получим данные по товарам и ГТД
	РезультатЗапросаПоТоварам = ПолучитьТаблицуТоваров(ШапкаДокумента);
	
	Если РезультатЗапросаПоТоварам.Пустой() Тогда
		Возврат НЕ Отказ;
	КонецЕсли;
	
	НаборПартии = Движения.ПартииТоваровКомпании;
	НаборГТД = Движения.ГТДПартийТоваровКомпании;
	НаборГТД.Загрузить(ПолучитьТаблицуСписываемыхГТДТоваров(ШапкаДокумента));

	// подготовим валюты и курсы
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРегл, ШапкаДокумента.Дата);
	КурсРегл = СтруктураКурса.Курс/?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	
	ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	Если ЗначениеЗаполнено(ШапкаДокумента.КурсВалютыУпр) Тогда
		КурсУпр = ШапкаДокумента.КурсВалютыУпр;
	Иначе
		СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУпр, ШапкаДокумента.Дата);
		КурсУпр = СтруктураКурса.Курс/?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	КонецЕсли;
	
	ВыборкаСуммы = РезультатЗапросаПоТоварам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаСуммы.Следующий();
	ОбщаяТаможеннаяСтоимость = ВыборкаСуммы.ТаможеннаяСтоимость;
	СуммаЗаЕд = ?(ОбщаяТаможеннаяСтоимость = 0, 0, СуммаТаможенногоСбора/ОбщаяТаможеннаяСтоимость);
	
	ВыборкаТоваров = ВыборкаСуммы.Выбрать();
	
	СписанныеПартии = "";
	ОшибочныеПартии = "";
	
	РаспределяемаяСумма = СуммаТаможенногоСбора;
	
	Пока ВыборкаТоваров.Следующий() Цикл
		Если ВыборкаТоваров.ПартияСписана Тогда
			СписанныеПартии = СписанныеПартии + ?(СписанныеПартии = "",ВыборкаТоваров.Партия, "" + Символы.ПС + ВыборкаТоваров.Партия);
			Продолжить;
		ИначеЕсли ВыборкаТоваров.ПоПартииБылиДвижения Тогда
			ОшибочныеПартии = ОшибочныеПартии + ?(ОшибочныеПартии = "",ВыборкаТоваров.Партия, "" + Символы.ПС + ВыборкаТоваров.Партия);
			Продолжить;
		КонецЕсли;
		
		НоваяЗаписьПартии = НаборПартии.Добавить();
		НоваяЗаписьПартии.Регистратор                = ШапкаДокумента.Ссылка;
		НоваяЗаписьПартии.Период                     = ШапкаДокумента.Дата;
		НоваяЗаписьПартии.ВидДвижения                = ВидДвиженияНакопления.Приход;
		НоваяЗаписьПартии.Номенклатура               = ВыборкаТоваров.Номенклатура;
		НоваяЗаписьПартии.ХарактеристикаНоменклатуры = ВыборкаТоваров.ХарактеристикаНоменклатуры;
		НоваяЗаписьПартии.СкладКомпании              = ВыборкаТоваров.Склад;
		НоваяЗаписьПартии.Партия                     = ВыборкаТоваров.Партия;
		НоваяЗаписьПартии.СтатусПартии               = ВыборкаТоваров.СтатусПартии;
		НоваяЗаписьПартии.ХозОперация                = ШапкаДокумента.ХозОперация;
		
		// посчитаем суммы
		РасчетнаяСумма      = Окр(ВыборкаТоваров.ТаможеннаяСтоимость*СуммаЗаЕд, 2);
		РаспределяемаяСумма = РаспределяемаяСумма - РасчетнаяСумма;
		
		НоваяЗаписьПартии.Сумма          = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ВыборкаТоваров.СуммаВсего+РасчетнаяСумма, ШапкаДокумента.ВалютаДокумента, ШапкаДокумента.КурсДокумента, ВалютаРегл, КурсРегл);
		НоваяЗаписьПартии.СуммаУпр       = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ВыборкаТоваров.СуммаВсего+РасчетнаяСумма, ШапкаДокумента.ВалютаДокумента, ШапкаДокумента.КурсДокумента, ВалютаУпр, КурсУпр);
		НоваяЗаписьПартии.СуммаНДС       = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ВыборкаТоваров.СуммаНДС, ШапкаДокумента.ВалютаДокумента, ШапкаДокумента.КурсДокумента, ВалютаРегл, КурсРегл);
		НоваяЗаписьПартии.СуммаНДСУпр    = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ВыборкаТоваров.СуммаНДС, ШапкаДокумента.ВалютаДокумента, ШапкаДокумента.КурсДокумента, ВалютаУпр, КурсУпр);
		НоваяЗаписьПартии.СуммаБезНДС    = НоваяЗаписьПартии.Сумма - НоваяЗаписьПартии.СуммаНДС;
		НоваяЗаписьПартии.СуммаБезНДСУпр = НоваяЗаписьПартии.СуммаУпр - НоваяЗаписьПартии.СуммаНДСУпр;
		
		// установим ГТД по товару
		НоваяЗаписьГТД = НаборГТД.Добавить();
		НоваяЗаписьГТД.Регистратор                = ШапкаДокумента.Ссылка;
		НоваяЗаписьГТД.Период                     = ШапкаДокумента.Дата;
		НоваяЗаписьГТД.ВидДвижения                = ВидДвиженияНакопления.Приход;
		НоваяЗаписьГТД.ХозОперация                = ШапкаДокумента.ХозОперация;
		НоваяЗаписьГТД.Номенклатура               = ВыборкаТоваров.Номенклатура;
		НоваяЗаписьГТД.ХарактеристикаНоменклатуры = ВыборкаТоваров.ХарактеристикаНоменклатуры;
		НоваяЗаписьГТД.СкладКомпании              = ВыборкаТоваров.Склад;
		НоваяЗаписьГТД.Партия                     = ВыборкаТоваров.Партия;
		НоваяЗаписьГТД.ГТД                        = ВыборкаТоваров.ГТД;
		НоваяЗаписьГТД.Количество                 = ВыборкаТоваров.Количество;
		
	КонецЦикла;
	
	// Если не распределилась сумма в 0 тогда, закинем корректировку на последнюю строку.
	Если РаспределяемаяСумма <> 0 И ПустаяСтрока(СписанныеПартии) И ПустаяСтрока(ОшибочныеПартии) Тогда
		НоваяЗаписьПартии.Сумма    = НоваяЗаписьПартии.Сумма + РаботаСКурсамиВалют.ПересчитатьВВалюту(РаспределяемаяСумма, ШапкаДокумента.ВалютаДокумента, ВалютаРегл, ШапкаДокумента.Дата);
		НоваяЗаписьПартии.СуммаУпр = НоваяЗаписьПартии.СуммаУпр + РаботаСКурсамиВалют.ПересчитатьВВалюту(РаспределяемаяСумма, ШапкаДокумента.ВалютаДокумента, ВалютаУпр, ШапкаДокумента.Дата);
		НоваяЗаписьПартии.СуммаБезНДС = НоваяЗаписьПартии.Сумма - НоваяЗаписьПартии.СуммаНДС;
		НоваяЗаписьПартии.СуммаБезНДСУпр = НоваяЗаписьПартии.СуммаУпр - НоваяЗаписьПартии.СуммаНДСУпр;
	КонецЕсли;
	
	КУдалению = Новый Массив();
	
	Для Каждого Запись Из НаборПартии Цикл
		
		Если Запись.Сумма = 0
			И Запись.СуммаУпр = 0
			И Запись.СуммаНДС = 0
			И Запись.СуммаНДСУпр = 0
			И Запись.СуммаБезНДС = 0
			И Запись.СуммаБезНДСУпр = 0 Тогда
			
			КУдалению.Добавить(Запись);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Запись Из КУдалению Цикл
		
		НаборПартии.Удалить(Запись);
		
	КонецЦикла;
	
	НаборЗаписейДиР = Движения.ДоходыИРасходы;
	
	// определим необходимость формирования корректирующих проводок
	ВедетсяБалансПоПодразделению = БалансВедетсяПоПодразделениям(ШапкаДокумента.Дата);
	БалансовоеПодразделениеДоговора = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ШапкаДокумента.ДоговорВзаиморасчетов.ПодразделениеКомпании, ШапкаДокумента.Дата);
	
	// БАЛАНС: определим необходимость формирования корректирующих проводок по партиям.
	Если ВедетсяБалансПоПодразделению И Движения.ПартииТоваровКомпании.Количество()> 0 Тогда
		
		ДвиженияПартииТоваровКомпании = Движения.ПартииТоваровКомпании.Выгрузить(,"СкладКомпании, СуммаУпр");
		ДвиженияПартииТоваровКомпании.Свернуть("СкладКомпании", "СуммаУпр");
		ДвиженияПартииТоваровКомпании.Колонки.Добавить("Подразделение");
		
		Для Каждого ТекущаяСтрока Из ДвиженияПартииТоваровКомпании Цикл
			ТекущаяСтрока.Подразделение = ТекущаяСтрока.СкладКомпании.ПодразделениеКомпании; 
		КонецЦикла;
		
		ДвиженияПартииТоваровКомпании.Свернуть("Подразделение", "СуммаУпр");
		
		СуммаКорректировки = 0;
		Для Каждого ТекущаяСтрока Из ДвиженияПартииТоваровКомпании Цикл
			Если ТекущаяСтрока.СуммаУпр = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ПодразделениеСклада = ТекущаяСтрока.Подразделение;
			БалансовоеПодразделениеСклада = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ШапкаДокумента.СкладКомпании.ПодразделениеКомпании, ШапкаДокумента.Дата);
			
			Если БалансовоеПодразделениеДоговора = БалансовоеПодразделениеСклада Тогда
				Продолжить;
			КонецЕсли;
			
			НаборЗаписейДиР.ДокументОбъект         = ЭтотОбъект;
			НаборЗаписейДиР.ШапкаДокумента         = ШапкаДокумента;
			НаборЗаписейДиР.Подразделение          = ПодразделениеСклада;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДиР.ВУпрВалюте             = Истина;
			НаборЗаписейДиР.Доход                  = ТекущаяСтрока.СуммаУпр;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
			
			СуммаКорректировки = СуммаКорректировки + ТекущаяСтрока.СуммаУпр;
		КонецЦикла;
		
		// БАЛАНС: определим необходимость формирования корректирующих проводок по взаиморасчетам.
		Если (НЕ СуммаКорректировки = 0) Тогда
			
			НаборЗаписейДиР.ДокументОбъект         = ЭтотОбъект;
			НаборЗаписейДиР.ШапкаДокумента         = ШапкаДокумента;
			НаборЗаписейДиР.Подразделение          = ШапкаДокумента.ДоговорВзаиморасчетов.ПодразделениеКомпании;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДиР.ВУпрВалюте             = Истина;
			НаборЗаписейДиР.Расход                 = СуммаКорректировки;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
			
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СписанныеПартии) Тогда
		ВывестиСообщениеПоКоду("4",,,,Отказ,СписанныеПартии);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ОшибочныеПартии) Тогда
		ВывестиСообщениеПоКоду("5",,,,Отказ,ОшибочныеПартии);
	КонецЕсли;
	
	// двигаем границу последовательности партий
	Если Ссылка <> ДокументСсылка Тогда
		
		РаботаСГраницами.МоментВремениПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		РаботаСГраницами.ДвиженияПоПартиямПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		
	КонецЕсли;
	
	РаботаСГраницами.СдвинутьГраницуПартий(ДокументСсылка, ДополнительныеСвойства, Движения);
	
	Возврат НЕ Отказ;
	
КонецФункции // ПровестиПоПартиям()

// возвращает таблицу товаров
//
// Параметры:
//  ШапкаДокумента - Выборка по шапке.
//
// Возвращаемое значение:
//  Выборка - выборка по товарам
//
Функция ПолучитьТаблицуТоваров(ШапкаДокумента)
	
	Менеджер = Новый МенеджерВременныхТаблиц;
	
	// корректирование себестоимости товара на остатках
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Менеджер;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаможеннаяДекларацияИмпортТовары.Номенклатура КАК Номенклатура,
	|	ТаможеннаяДекларацияИмпортТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ТаможеннаяДекларацияИмпортТовары.КоличествоБазовое) КАК Количество,
	|	СУММА(ТаможеннаяДекларацияИмпортТовары.СуммаПошлины) КАК СуммаПошлины,
	|	СУММА(ТаможеннаяДекларацияИмпортТовары.СуммаНДС) КАК СуммаНДС,
	|	ТаможеннаяДекларацияИмпортТовары.Партия КАК Партия,
	|	ТаможеннаяДекларацияИмпортТовары.Склад КАК Склад,
	|	ТаможеннаяДекларацияИмпортТовары.ГТД КАК ГТД,
	|	ТаможеннаяДекларацияИмпортТовары.СуммаПошлины + ТаможеннаяДекларацияИмпортТовары.СуммаНДС КАК СуммаВсего,
	|	ТаможеннаяДекларацияИмпортТовары.ТаможеннаяСтоимость КАК ТаможеннаяСтоимость
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт.Товары КАК ТаможеннаяДекларацияИмпортТовары
	|ГДЕ
	|	ТаможеннаяДекларацияИмпортТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаможеннаяДекларацияИмпортТовары.Номенклатура,
	|	ТаможеннаяДекларацияИмпортТовары.Склад,
	|	ТаможеннаяДекларацияИмпортТовары.ХарактеристикаНоменклатуры,
	|	ТаможеннаяДекларацияИмпортТовары.Партия,
	|	ТаможеннаяДекларацияИмпортТовары.ГТД,
	|	ТаможеннаяДекларацияИмпортТовары.СуммаПошлины + ТаможеннаяДекларацияИмпортТовары.СуммаНДС,
	|	ТаможеннаяДекларацияИмпортТовары.ТаможеннаяСтоимость
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииТоваровКомпании.Номенклатура КАК Номенклатура,
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.СкладКомпании КАК СкладКомпании,
	|	ПартииТоваровКомпании.Партия КАК Партия,
	|	СУММА(ПартииТоваровКомпании.Количество) КАК КоличествоНачОстаток
	|ПОМЕСТИТЬ НачальныеОстатки
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	(ПартииТоваровКомпании.Номенклатура, ПартииТоваровКомпании.ХарактеристикаНоменклатуры, ПартииТоваровКомпании.СкладКомпании, ПартииТоваровКомпании.Партия) В
	|			(ВЫБРАТЬ
	|				ТаблицаДокумента.Номенклатура,
	|				ТаблицаДокумента.ХарактеристикаНоменклатуры,
	|				ТаблицаДокумента.Склад,
	|				ТаблицаДокумента.Партия
	|			ИЗ
	|				ТаблицаДокумента КАК ТаблицаДокумента)
	|	И (ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.КорректировкаПоступления
	|			ИЛИ ПартииТоваровКомпании.Регистратор ССЫЛКА Документ.ПоступлениеТоваров)
	|	И ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.СкладКомпании,
	|	ПартииТоваровКомпании.Партия,
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаДокумента.Склад КАК Склад,
	|	ТаблицаДокумента.Партия КАК Партия,
	|	ТаблицаДокумента.ГТД КАК ГТД,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ТаблицаДокумента.СуммаПошлины КАК СуммаПошлины,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ТаблицаДокумента.СуммаВсего КАК СуммаВсего,
	|	ЕСТЬNULL(НачальныеОстатки.КоличествоНачОстаток, 0) КАК КоличествоНачОстаток,
	|	ЕСТЬNULL(ПартииТоваровКомпанииОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ПартииТоваровКомпанииОстатки.СтатусПартии КАК СтатусПартии,
	|	ТаблицаДокумента.ТаможеннаяСтоимость КАК ТаможеннаяСтоимость
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачальныеОстатки КАК НачальныеОстатки
	|		ПО ТаблицаДокумента.Номенклатура = НачальныеОстатки.Номенклатура
	|			И ТаблицаДокумента.ХарактеристикаНоменклатуры = НачальныеОстатки.ХарактеристикаНоменклатуры
	|			И ТаблицаДокумента.Склад = НачальныеОстатки.СкладКомпании
	|			И ТаблицаДокумента.Партия = НачальныеОстатки.Партия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровКомпании.Остатки(
	|				&Момент,
	|				(Номенклатура, ХарактеристикаНоменклатуры, СкладКомпании, Партия) В
	|					(ВЫБРАТЬ
	|						ТаблицаДокумента.Номенклатура,
	|						ТаблицаДокумента.ХарактеристикаНоменклатуры,
	|						ТаблицаДокумента.Склад,
	|						ТаблицаДокумента.Партия
	|					ИЗ
	|						ТаблицаДокумента КАК ТаблицаДокумента)) КАК ПартииТоваровКомпанииОстатки
	|		ПО ТаблицаДокумента.Номенклатура = ПартииТоваровКомпанииОстатки.Номенклатура
	|			И ТаблицаДокумента.ХарактеристикаНоменклатуры = ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры
	|			И ТаблицаДокумента.Склад = ПартииТоваровКомпанииОстатки.СкладКомпании
	|			И ТаблицаДокумента.Партия = ПартииТоваровКомпанииОстатки.Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НачальныеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИтоговаяТаблица.Номенклатура КАК Номенклатура,
	|	ИтоговаяТаблица.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ИтоговаяТаблица.Склад КАК Склад,
	|	ИтоговаяТаблица.Партия КАК Партия,
	|	ИтоговаяТаблица.ГТД КАК ГТД,
	|	ИтоговаяТаблица.Количество КАК Количество,
	|	ИтоговаяТаблица.СуммаПошлины КАК СуммаПошлины,
	|	ИтоговаяТаблица.СуммаНДС КАК СуммаНДС,
	|	ИтоговаяТаблица.СуммаВсего КАК СуммаВсего,
	|	ВЫБОР
	|		КОГДА ИтоговаяТаблица.КоличествоНачОстаток = ИтоговаяТаблица.КоличествоОстаток
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПоПартииБылиДвижения,
	|	ВЫБОР
	|		КОГДА ИтоговаяТаблица.КоличествоОстаток = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПартияСписана,
	|	ИтоговаяТаблица.СтатусПартии КАК СтатусПартии,
	|	ИтоговаяТаблица.ТаможеннаяСтоимость КАК ТаможеннаяСтоимость
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица
	|ИТОГИ
	|	СУММА(ТаможеннаяСтоимость)
	|ПО
	|	ОБЩИЕ";
	Запрос.УстановитьПараметр("Ссылка", ШапкаДокумента.Ссылка);
	Запрос.УстановитьПараметр("Момент", ШапкаДокумента.МоментВремени);
		
	Возврат Запрос.Выполнить();
	
КонецФункции //ПолучитьТаблицуТоваров()

// возвращает выборку по шапке
//
// Параметры:
//  ШапкаДокумента - Выборка по шапке.
//
// Возвращаемое значение:
//  Выборка - списываемые ГТД товаров.
//
Функция ПолучитьТаблицуСписываемыхГТДТоваров(ШапкаДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГТДПартийТоваровКомпанииОстатки.СкладКомпании,
	|	ГТДПартийТоваровКомпанииОстатки.Номенклатура,
	|	ГТДПартийТоваровКомпанииОстатки.Партия,
	|	ГТДПартийТоваровКомпанииОстатки.ГТД,
	|	-ГТДПартийТоваровКомпанииОстатки.КоличествоОстаток КАК Количество,
	|	&ХозОперация,
	|	&Период,
	|	&Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ИСТИНА КАК Активность,
	|	ГТДПартийТоваровКомпанииОстатки.ХарактеристикаНоменклатуры
	|ИЗ
	|	РегистрНакопления.ГТДПартийТоваровКомпании.Остатки(
	|			&Момент,
	|			(Номенклатура, ХарактеристикаНоменклатуры, Партия) В
	|				(ВЫБРАТЬ
	|					ТаможеннаяДекларацияИмпортТовары.Номенклатура,
	|					ТаможеннаяДекларацияИмпортТовары.ХарактеристикаНоменклатуры,
	|					ТаможеннаяДекларацияИмпортТовары.Партия
	|				ИЗ
	|					Документ.ТаможеннаяДекларацияИмпорт.Товары КАК ТаможеннаяДекларацияИмпортТовары
	|				ГДЕ
	|					ТаможеннаяДекларацияИмпортТовары.Ссылка = &Ссылка)) КАК ГТДПартийТоваровКомпанииОстатки";
	Запрос.УстановитьПараметр("Ссылка", ШапкаДокумента.Ссылка);
	Запрос.УстановитьПараметр("Момент", ШапкаДокумента.МоментВремени);
	Запрос.УстановитьПараметр("ХозОперация", ШапкаДокумента.ХозОперация);
	Запрос.УстановитьПараметр("Период", ШапкаДокумента.Дата);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //ПолучитьТаблицуСписываемыхГТДТоваров()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	ХозОперация = Справочники.ХозОперации.ТаможеннаяДекларацияИмпорт;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ИскомыеСвойства = Новый Массив();
		ИскомыеСвойства.Добавить(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.КодТаможни);
		ЗначенияСвойствОбъекта = УправлениеСвойствами.ПолучитьЗначенияСвойств(Контрагент, Истина, Истина, ИскомыеСвойства);
		КодТаможни = УправлениеСвойствамиПлатформа.ПолучитьЗначениеСвойства("КодТаможни", ЗначенияСвойствОбъекта);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	СписокРазделов = "";
	Для Каждого СтрокаРаздела Из Разделы Цикл
		НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("НомерРаздела", СтрокаРаздела.НомерРаздела));
		СтруктураСумм = Новый Структура("ИмпортнаяПошлинаСумма,АнтидемпинговаяПошлинаСумма,СуммаАкциза,СуммаНДС", СтрокаРаздела.ИмпортнаяПошлинаСумма, СтрокаРаздела.АнтидемпинговаяПошлинаСумма, СтрокаРаздела.СуммаАкциза, СтрокаРаздела.СуммаНДС);
		Для Каждого Строка Из НайденныеСтроки Цикл
			СтруктураСумм.ИмпортнаяПошлинаСумма = СтруктураСумм.ИмпортнаяПошлинаСумма - Строка.ИмпортнаяПошлинаСумма; 
			СтруктураСумм.АнтидемпинговаяПошлинаСумма = СтруктураСумм.АнтидемпинговаяПошлинаСумма - Строка.АнтидемпинговаяПошлинаСумма; 
			СтруктураСумм.СуммаАкциза = СтруктураСумм.СуммаАкциза - Строка.СуммаАкциза; 
			СтруктураСумм.СуммаНДС     = СтруктураСумм.СуммаНДС - Строка.СуммаНДС;
		КонецЦикла;
		
		Если СтруктураСумм.ИмпортнаяПошлинаСумма <> 0 ИЛИ СтруктураСумм.АнтидемпинговаяПошлинаСумма <> 0 ИЛИ СтруктураСумм.СуммаАкциза <> 0 ИЛИ СтруктураСумм.СуммаНДС <> 0 Тогда
			СписокРазделов = СписокРазделов +?(ПустаяСтрока(СписокРазделов), "",", ") + СтрокаРаздела.НомерРаздела;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(СписокРазделов) Тогда
		ВывестиСообщениеПоКоду("2", ,,,Отказ,СписокРазделов);  //ВывестиСообщение(НСтр("ru = 'Для раздела(-ов) -%1- суммы не совпадают с итоговой суммой состава.'"),,,,Отказ, СписокРазделов);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// корректируем количество базовое 
	Для Каждого Строка Из Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.КоличествоБазовое) Тогда
			Строка.КоличествоБазовое = Строка.Количество * Строка.Коэффициент;
		КонецЕсли;
	КонецЦикла;
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Отказ ИЛИ Документы.ТаможеннаяДекларацияИмпорт.ЗаполнитьГТДПоНомерам(ЭтотОбъект);
	
	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоВзаиморасчетамПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоПартиямПередПроведением(Ссылка, ДополнительныеСвойства);
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// определим необходимость формирования корректирующих проводок
	ВедетсяБалансПоПодразделению = БалансВедетсяПоПодразделениям(Дата);
	
	// выполним движения по взаиморасчетам с контрагентом
	НаборЗаписейВзаиморасчеты = Движения.ВзаиморасчетыКомпании;
	НаборЗаписейВзаиморасчеты.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейВзаиморасчеты.РежимПроведения=РежимПроведения;
	НаборЗаписейВзаиморасчеты.Контрагент=Контрагент;
	НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
	НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Ложь;
	НаборЗаписейВзаиморасчеты.АвтоЗакрытиеСделок=АвтоЗакрытиеСделок;
	НаборЗаписейВзаиморасчеты.Сумма=СуммаДокумента;
	НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц=0;
	
	Отказ = НЕ НаборЗаписейВзаиморасчеты.Расход() ИЛИ Отказ;
	
	// доходы и расходы по суммовым разницам
	СуммаДоходаРасходаСуммовыхРазниц = НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
	Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
		НаборЗаписейДиР = Движения.ДоходыИРасходы;
		НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
		
		// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
		Если ВедетсяБалансПоПодразделению Тогда
			НаборЗаписейДиР.Подразделение  = ДоговорВзаиморасчетов.ПодразделениеКомпании;
		КонецЕсли;
		
		НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
		НаборЗаписейДиР.ВУпрВалюте = Истина;
		
		Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
			НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
		Иначе
			НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
		КонецЕсли;
		
		Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	// проведем партии товаров и ГТД
	Отказ = НЕ ПровестиПоПартиям(РежимПроведения, Ссылка) ИЛИ Отказ;
	
	ПодразделениеПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ПодразделениеКомпании, Дата);
	ПодразделениеДоговорВзаиморасчетов = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ДоговорВзаиморасчетов.ПодразделениеКомпании, Дата);
	
	НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
	НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДоходыИРасходы.ВУпрВалюте=(ВалютаДокумента = Константы.ВалютаУправленческогоУчетаКомпании.Получить());
	НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=СтатьяДоходовИРасходов;
	НаборЗаписейДоходыИРасходы.Расход = СуммаТаможенногоШтрафа;
	СуммаУслугТаможни = СуммаТаможенногоШтрафа; 
	Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	
	// Если балансовые подразделение договора и подразделения склад не равны, то сформируем корректирующие проводки.
	Если ВедетсяБалансПоПодразделению И (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеКомпании) Тогда
		НаборЗаписейДоходыИРасходы = Движения.ДоходыИРасходы;
		
		НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
		НаборЗаписейДоходыИРасходы.Подразделение          = ДоговорВзаиморасчетов.ПодразделениеКомпании;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Ложь;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
		НаборЗаписейДоходыИРасходы.Расход                 = СуммаУслугТаможни;
		
		Отказ = НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		
		НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
		НаборЗаписейДоходыИРасходы.Подразделение          = ПодразделениеКомпании;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте             =(ВалютаДокумента = Константы.ВалютаУправленческогоУчетаКомпании.Получить());
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
		НаборЗаписейДоходыИРасходы.Доход                  = СуммаУслугТаможни;
		
		Отказ = НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	// Возможно расхождение баланса на "копейки" из-за округления. Возникшую разницу
	// необходимо списать на доходы и расходы.
	Отказ = НЕ ОбработкаСобытийДокументаСервер.СписаниеКопейкиПриОкругленииВалютныхСчетов(ЭтотОбъект) ИЛИ Отказ;
	
	// двигаем границу последовательности взаиморасчетов
	РаботаСГраницами.СдвинутьГраницуВзаиморасчетов(Ссылка, ДополнительныеСвойства, Движения);

КонецПроцедуры // ОбработкаПроведения()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли