// Модуль основной формы документа "Согласование закупочных цен"
&НаКлиенте
перем ШтрихКодДляПоиска;

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьДеревоПодразделений()
	
	УправлениеДиалогомСервер.ЗаполнитьДеревоПодразделений(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоГруппПоставок()
	Форма = ЭтотОбъект;
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ГруппыПоставок.ГруппаПоставки КАК ГруппаПоставки
	|ПОМЕСТИТЬ ГруппыПоставокДок
	|ИЗ
	|	&ГруппыПоставок КАК ГруппыПоставок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГруппыПоставок.Ссылка КАК ГруппаПоставки,
	|	ГруппыПоставок.НеУчаствуетВДвижениях КАК НеУчаствуетВДвижениях,
	|	ВЫБОР
	|		КОГДА ГруппыПоставокДок.ГруппаПоставки ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Пометка
	|ИЗ
	|	Справочник.ГруппыПоставки КАК ГруппыПоставок
	|	ЛЕВОЕ СОЕДИНЕНИЕ ГруппыПоставокДок КАК ГруппыПоставокДок
	|	ПО ГруппыПоставок.Ссылка = ГруппыПоставокДок.ГруппаПоставки
	|УПОРЯДОЧИТЬ ПО
	|	ГруппыПоставок.Ссылка ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ");
	
	Запрос.УстановитьПараметр("Ссылка",        Объект.Ссылка);
	Запрос.УстановитьПараметр("ГруппыПоставок", Объект.ГруппыПоставки.Выгрузить());
	
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(Дерево, "ДеревоГруппПоставки");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДоступныеГруппыЗаказа()
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.ГруппыЗаказов ГДЕ Владелец=&Владелец И НЕ ПометкаУдаления");
	Запрос.УстановитьПараметр("Владелец", Объект.Контрагент);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //ПолучитьДоступныеГруппыЗаказа()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
	//Если Элементы.Найти("ГруппаЗаказа")<>Неопределено Тогда
	//	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
	//		//УправлениеДиалогомСервер.УдалитьПараметрВыбора(Элементы.ГруппаЗаказа.ПараметрыВыбора, "Отбор.Владелец");
	//		УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.ГруппаЗаказа.ПараметрыВыбора,	"Отбор.Владелец", Объект.Контрагент);
	//	Иначе
	//		УправлениеДиалогомСервер.УдалитьПараметрВыбора(Элементы.КассаКомпанииПолучатель.ПараметрыВыбора, "Отбор.Владелец");
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	СогласованиеПоГрПоставки = (Объект.ХозОперация=Справочники.ХозОперации.СогласованиеЗакупочныхЦенПоГруппамПоставки ИЛИ Объект.ХозОперация=Справочники.ХозОперации.СогласованиеЗакупочныхЦенПоГпПолное);
	
	Элементы.СтраницаГруппыПоставок.Видимость = СогласованиеПоГрПоставки;
	Элементы.СтраницаПодразделения.Видимость = НЕ СогласованиеПоГрПоставки;
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
	//----------
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента      = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.Имя);
		
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Товары.ФлагОтклонено");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
		
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(250, 0, 0));
	
	//отдельная раскраска флажка
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента      = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ФлагОтклонено");
		
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Товары.ФлагОтклонено");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
		
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(250, 0, 0));
	//----------
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
// Параметры:
//  ИмяСобытия - Строка - Имя события, при работе которого необходимо проверить блокировку.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОбработчикаКоманды = ПолучитьЗначениеПараметраСтруктуры(РезультатОповещения, "ИмяОбработчикаКоманды", "");
	Если ИмяОбработчикаКоманды = "ПодразделенияОчиститьТабличнуюЧасть" Тогда
		УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивно(ДеревоПодразделений.ПолучитьЭлементы(), Ложь, Объект.Подразделения);
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	Если ДополнительныеПараметры="ПараметрыДокумента" Тогда
		
		Если ЗначениеЗаполнено(Объект.ДатаНачалаДействия) И Объект.ДатаНачалаДействия<НачалоДня(Объект.Дата) Тогда
			Объект.ДатаНачалаДействия = Объект.Дата;
			ДатаНачалаДействияПриИзменении(Неопределено);
		КонецЕсли;
		
	КонецЕсли;
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события нажатия кнопки "Подбор номенклатуры".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомКлиент.ОткрытьПодборНоменклатуры(ЭтотОбъект, Истина);
	
КонецПроцедуры // ПодборНоменклатуры()

// Заполнить табличную часть "Товары" ценами контрагента
&НаСервере
Процедура ЗаполнитьЦенамиКонтрагентаНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Дата = Объект.Дата;
	Иначе
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	Момент = Новый МоментВремени(Дата);

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныСрезПоследних.Цена КАК Цена,
	|	ЦеныСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&Момент,
	|			ТипЦен = &ТипЦен
	|				И Контрагент = &Контрагент
	|				И ЕдиницаИзмерения = &ЕдиницаИзмерения
	|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|				И Номенклатура В (&Номенклатура)
	|				И ПодразделениеКомпании = &ПодразделениеКомпании)
	|				КАК ЦеныСрезПоследних");
	Запрос.УстановитьПараметр("ТипЦен", Объект.ТипЦен);
	Запрос.УстановитьПараметр("Момент", Момент);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("Номенклатура", Объект.Товары.Выгрузить(,"Номенклатура"));
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
	
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТоваров Из Объект.Товары Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Номенклатура", СтрокаТоваров.Номенклатура);
		//Если ЗначениеЗаполнено(СтрокаТоваров.ЕдиницаИзмерения) Тогда
		//	СтруктураОтбора.Вставить("ЕдиницаИзмерения", СтрокаТоваров.ЕдиницаИзмерения);
		//КонецЕсли;
		Цена = 0;
		
		НайденныеСтроки = Результат.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество()>0 Тогда
			Цена = НайденныеСтроки[0].Цена;
		КонецЕсли;
		
		СтрокаТоваров.Цена = Цена;
		Документы.СогласованиеЗакупочныхЦен.ТоварыЦенаПриИзменении(Объект, СтрокаТоваров);
	КонецЦикла;
	
	КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнитьЦенамиКонтрагентаЗавершение(РезультатВопроса, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЦенамиКонтрагентаНаСервере();
	
КонецПроцедуры

// Обработчик события нажатия кнопки "Заполнить ценами контрагента"
&НаКлиенте
Процедура ЗаполнитьЦенамиКонтрагента(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указан контрагент!'"));
		Возврат;
	КонецЕсли;
	Если Объект.Товары.Количество()<>0 Тогда
		ОповещениеПодтверждениеОперации = Новый ОписаниеОповещения("ЗаполнитьЦенамиКонтрагентаЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеПодтверждениеОперации, НСтр("ru= 'Заполнить ценами контрагента """+ СокрЛП(Объект.Контрагент) + """?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьЦенамиКонтрагента()

// Изменить цены табличной части "Товары" на процент
&НаСервере
Процедура ИзменитьЦеныПоПроцентуНаСервере(ПроцентИзменения)
	
	Если ПроцентИзменения = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		СтрокаТовары.Цена = СтрокаТовары.Цена * (100 + ПроцентИзменения) / 100;
		// Вызываем обработчик изменения данных объекта
		Документы.СогласованиеЗакупочныхЦен.ТоварыЦенаПриИзменении(Объект, СтрокаТовары);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЦеныПоПроцентуЗавершение(ПроцентИзменения, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если НЕ ТипЗнч(ПроцентИзменения) = Тип("Число") Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьЦеныПоПроцентуНаСервере(ПроцентИзменения);
	
КонецПроцедуры

// Обработчик события нажатия кнопки "Изменить цены по проценту"
&НаКлиенте
Процедура ИзменитьЦеныПоПроценту(Команда)
	
	Если Объект.Товары.Количество()<>0 Тогда
		ОповещениеИзменениеЦены = Новый ОписаниеОповещения("ИзменитьЦеныПоПроцентуЗавершение", ЭтотОбъект);
		ПоказатьВводЧисла(ОповещениеИзменениеЦены, 0, НСтр("ru = 'Введите процент изменения цены'"), 4, 1);
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.СогласованиеЗакупочныхЦен.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.СогласованиеЗакупочныхЦен.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.ДатаНачалаДействия) И Объект.ДатаНачалаДействия<НачалоДня(Объект.Дата) Тогда
		Объект.ДатаНачалаДействия = Объект.Дата;
		ДатаНачалаДействияПриИзменении(Неопределено);
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Контрагент" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура КонтрагентПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.СогласованиеЗакупочныхЦен.КонтрагентПриИзменении(Объект, ПараметрыДействия);
	
	Элементы.ГруппаЗаказа.СписокВыбора.Очистить();
	
	тзГруппЗаказа = ПолучитьДоступныеГруппыЗаказа();
	//Если тзГруппЗаказа.Количество()=1 Тогда
	//	Объект.ГруппаЗаказа = тзГруппЗаказа[0].Ссылка;
	//КонецЕсли;
	Элементы.ГруппаЗаказа.СписокВыбора.ЗагрузитьЗначения(тзГруппЗаказа.ВыгрузитьКолонку("Ссылка"));
		
	//Выборка = Справочники.ГруппыЗаказов.Выбрать(, Объект.Контрагент);
	//Пока Выборка.Следующий() Цикл
	//	Элементы.ГруппаЗаказа.СписокВыбора.Добавить(Выборка.Ссылка);
	//КонецЦикла;
	
	// Проверим наличие заметок по выбранному объекту.
	ЗаметкиПользователяПлатформа.ПроверитьЗаметкиПоПредмету(Объект.Контрагент, ПараметрыДействия);
	
	// настроим параметры выбора
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // КонтрагентПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Контрагент".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	КонтрагентПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // КонтрагентПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата начала действия" в контексте сервера.
//
&НаСервере
Процедура ДатаНачалаДействияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	Документы.СогласованиеЗакупочныхЦен.РассчитатьПредыдущиеЦены(Объект);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаНачалаДействияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата начала действия".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаНачалаДействияПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.ДатаНачалаДействия) Тогда
		Если Объект.ДатаНачалаДействия<НачалоДня(Объект.Дата) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Дата начала действия, не может быть меньше даты документа.'"));
			Объект.ДатаНачалаДействия = Объект.Дата;
		КонецЕсли;
	Иначе
		Объект.ДатаНачалаДействия = ТекущаяДата();
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ДатаНачалаДействияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры //ДатаНачалаДействияПриИзменении()

&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.СрокДействия) Тогда
		Объект.СрокДействия = Дата(2050,12,31);
	КонецЕсли;
	
КонецПроцедуры //СрокДействияПриИзменении()

&НаСервере
Процедура ГруппаЗаказаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.СогласованиеЗакупочныхЦен.ГруппаЗаказаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры //ГруппаЗаказаПриИзмененииНаСервере()

&НаКлиенте
Процедура ГруппаЗаказаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ПараметрыДействия = Новый Структура;
	ГруппаЗаказаПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры //ГруппаЗаказаПриИзменении(Элемент)

&НаСервере
Процедура ПортфельКатегорийПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
		
КонецПроцедуры //ПортфельКатегорийПриИзмененииНаСервере()

&НаКлиенте
Процедура ПортфельКатегорийПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	ПортфельКатегорийПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры //ПортфельКатегорийПриИзменении()

&НаСервере
Процедура АвтовыборПортфеляНаСервере()
	
	тзГруппПоставки = Объект.ГруппыПоставки.Выгрузить();
	тзТоваров = Объект.Товары.Выгрузить();
	
	Объект.ПортфельКатегорий = Неопределено;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.ПортфелиКатегорий
	|ГДЕ
	|	НЕ ПометкаУдаления
	|	И НЕ ЭтоГруппа");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		текПортфель = Выборка.Ссылка;
		
		Если текПортфель.ГруппыПоставки.Количество()=0 И текПортфель.КатегорииНоменклатуры.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если текПортфель.ГруппыПоставки.Количество()>0 Тогда
			
			ЗапросГП = Новый Запрос("
			|ВЫБРАТЬ
			|	тчГруппыПоставки.ГруппаПоставки
			|ПОМЕСТИТЬ СписокГруппПоставки
			|ИЗ
			|	&тчГруппыПоставки КАК тчГруппыПоставки
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ГруппаПоставки
			|ИЗ
			|	СписокГруппПоставки КАК СписокГруппПоставки
			|ГДЕ
			|	НЕ ГруппаПоставки В (&МассивИзПортфеля)");
			ЗапросГП.УстановитьПараметр("тчГруппыПоставки", тзГруппПоставки);
			ЗапросГП.УстановитьПараметр("МассивИзПортфеля", текПортфель.ГруппыПоставки.ВыгрузитьКолонку("ГруппаПоставки"));
			
			Рез = ЗапросГП.Выполнить();
			Если НЕ Рез.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		Если текПортфель.КатегорииНоменклатуры.Количество()>0 Тогда
			
			ЗапросТоваров = Новый Запрос("
			|ВЫБРАТЬ
			|	тчТовары.Номенклатура
			|ПОМЕСТИТЬ СписокНоменклатуры
			|ИЗ
			|	&тчТовары КАК тчТовары
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Номенклатура
			|ИЗ
			|	СписокНоменклатуры КАК СписокНоменклатуры
			|ГДЕ
			|	НЕ Номенклатура В ИЕРАРХИИ(&МассивИзПортфеля)");
			ЗапросТоваров.УстановитьПараметр("тчТовары", тзТоваров);
			ЗапросТоваров.УстановитьПараметр("МассивИзПортфеля", текПортфель.КатегорииНоменклатуры.ВыгрузитьКолонку("КатегорияНоменклатуры"));
			
			Рез = ЗапросТоваров.Выполнить();
			Если НЕ Рез.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		Объект.ПортфельКатегорий = текПортфель;
		ПортфельКатегорийПриИзмененииНаСервере();
		
	КонецЦикла;
	
КонецПроцедуры //АвтовыборПортфеляНаСервере()

&НаКлиенте
Процедура АвтовыборПортфеля(Команда)
	
	Если Объект.ГруппыПоставки.Количество()=0 ИЛИ Объект.Товары.Количество()=0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для автоподбора портфеля, в документе должны быть указаны группы поставки и номенклатура !'"));
	Иначе
		АвтовыборПортфеляНаСервере();
		
		Если НЕ ЗначениеЗаполнено(Объект.ПортфельКатегорий) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось найти портфель, соответствующий указанным в документе группам поставки и номенклатуре.'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //АвтовыборПортфеля()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.СогласованиеЗакупочныхЦен.ТоварыНоменклатураПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	// Вызываем общий обработчик изменения реквизитов формы
	УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(ЭтотОбъект, ТекущиеДанные, ПараметрыДействия);
	
	КоличествоДней = 0; КоличествоИзменений = 0;
	ТекущиеДанные.ПредыдущаяЦена		= Документы.СогласованиеЗакупочныхЦен.ПолучитьПредыдущуюЦену(Объект, ТекущиеДанные.Номенклатура,,КоличествоДней);
	ТекущиеДанные.КоличествоДней		= КоличествоДней;
	ТекущиеДанные.ПрошлогодняяЦена		= Документы.СогласованиеЗакупочныхЦен.ПолучитьПрошлогоднююЦену(Объект, ТекущиеДанные.Номенклатура,,КоличествоИзменений);
	ТекущиеДанные.КоличествоИзменений	= КоличествоИзменений;
	
КонецПроцедуры // ТоварыНоменклатураПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыНоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЕдиницаИзмеренияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.СогласованиеЗакупочныхЦен.ТоварыЕдиницаИзмеренияПриИзменении(Объект, ТекущиеДанные);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Единица измерения".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЕдиницаИзмеренияПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЦенаПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.СогласованиеЗакупочныхЦен.ТоварыЦенаПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	ТекущиеДанные.Отклонение = ?(ТекущиеДанные.ПредыдущаяЦена=0, 0, (ТекущиеДанные.Цена - ТекущиеДанные.ПредыдущаяЦена) / ТекущиеДанные.ПредыдущаяЦена * 100);
	
	//ТоварыСтавкаНДСПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ТоварыЦенаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Цена".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЦенаПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЦенаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена без НДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЦенаБезНДСПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.СогласованиеЗакупочныхЦен.ТоварыЦенаБезНДСПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЦенаБезНДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Цена без НДС".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЦенаБезНДСПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЦенаБезНДСПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЦенаБезНДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСтавкаНДСПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.СогласованиеЗакупочныхЦен.ТоварыСтавкаНДСПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСтавкаНДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Ставка НДС".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСтавкаНДСПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСтавкаНДСПриИзменении()

// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры // ТоварыПередНачаломДобавления()

// Обработчик события возникающего на клиенте перед началом интерактивного изменения строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередНачаломИзменения()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередУдалением(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередУдалением()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПриОкончанииРедактирования(ЭтотОбъект, Элемент, НоваяСтрока, ОтменаРедактирования);
	
КонецПроцедуры // ТоварыПриОкончанииРедактирования()

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
&НаСервере
Процедура ТоварыПослеУдаленияНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ТоварыПослеУдаления(ЭтотОбъект, Элементы.Товары, ПараметрыДействия);
	
КонецПроцедуры // ТоварыПослеУдаленияНаСервере()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыПослеУдаленияНаСервере();
	
КонецПроцедуры // ТоварыПослеУдаления()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                        - Строка таблицы, над которой находится курсор.
//  Поле                          - Элемент управляемой формы, с которым связана данная колонка таблицы.
//
&НаКлиенте
Процедура ТоварыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // ТоварыПроверкаПеретаскивания()

&НаСервереБезКонтекста
Функция ПолучитьПоследниеКомментарииНаСервере()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 20
	|	Комментарий
	|ПОМЕСТИТЬ Комментарии
	|ИЗ
	|	Документ.СогласованиеЗакупочныхЦен.Товары
	|ГДЕ
	|	Комментарий<>""""
	|	И Ссылка.Проведен
	|СГРУППИРОВАТЬ ПО
	|	ФлагОтклонено,
	|	Комментарий
	|УПОРЯДОЧИТЬ ПО
	|	ФлагОтклонено УБЫВ,
	|	КОЛИЧЕСТВО(Комментарий) УБЫВ
	|;
	|ВЫБРАТЬ ПЕРВЫЕ 10 РАЗЛИЧНЫЕ Комментарий ИЗ	Комментарии");
	тзКомментарии = Запрос.Выполнить().Выгрузить();
	
	Возврат тзКомментарии.ВыгрузитьКолонку("Комментарий");
	
КонецФункции //ПолучитьПоследниеКомментарииНаСервере()

// Обработчик события возникающего на клиенте при при активизации ячейки таблицы.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПриАктивизацииЯчейки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПриАктивизацииЯчейки(ЭтотОбъект, Элемент);
	
	//сформируем список быстрого выбора комментария
	Если Элемент.ТекущийЭлемент.Имя="ТоварыКомментарий" Тогда
		МассивЗначений = ПолучитьПоследниеКомментарииНаСервере();
		
		Элементы.ТоварыКомментарий.СписокВыбора.Очистить();
		Для Каждого Комментарий Из МассивЗначений Цикл
			Элементы.ТоварыКомментарий.СписокВыбора.Добавить(Комментарий);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //ТоварыПриАктивизацииЯчейки()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()

&НаСервере
Процедура СтраницыПриСменеСтраницыНаСервере(ИмяСтраницы)
	
	Если ИмяСтраницы="СтраницаТовары" Тогда
		Документы.СогласованиеЗакупочныхЦен.РассчитатьПредыдущиеЦены(Объект);
	КонецЕсли;
	
КонецПроцедуры //СтраницыПриСменеСтраницыНаСервере()
	
&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	СтраницыПриСменеСтраницыНаСервере(ТекущаяСтраница.Имя);
	
КонецПроцедуры //СтраницыПриСменеСтраницы()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	//только для новых, определим хоз операцию, при наличии элементов в справочнике
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.ГруппыПоставки ГДЕ НЕ ПометкаУдаления");
		Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			Объект.ХозОперация = Справочники.ХозОперации.СогласованиеЗакупочныхЦенПоГруппамПоставки;
		КонецЕсли;
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	тзГруппЗаказа = ПолучитьДоступныеГруппыЗаказа();
	Элементы.ГруппаЗаказа.СписокВыбора.ЗагрузитьЗначения(тзГруппЗаказа.ВыгрузитьКолонку("Ссылка"));
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДеревоПодразделений();
	ЗаполнитьДеревоГруппПоставок();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
	//Мальцев А.Ю. +++ для новых документов приоритет по умолчанию обычный, поэтому выставляем максимальную дату	
	МаксимальнаяДата    = Дата("20990101");
	Объект.СрокДействия = МаксимальнаяДата;	
	//Мальцев А.Ю. ---
	
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	УправлениеДиалогомКлиент.ДеревоПодразделенийРазвернутьТолькоПомеченныеУровни(Элементы.ДеревоПодразделений, ДеревоПодразделений.ПолучитьЭлементы());
	//УправлениеДиалогомКлиент.ДеревоПодразделенийРазвернутьВсеУровни(Элементы.ДеревоГруппПоставки, ДеревоГруппПоставки.ПолучитьЭлементы());
	ДеревоГруппПоставокРазвернутьПомеченныеРекурсивно(Элементы.ДеревоГруппПоставки, ДеревоГруппПоставки.ПолучитьЭлементы());
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДеревоПодразделений();
	ЗаполнитьДеревоГруппПоставок();
	
	Документы.СогласованиеЗакупочныхЦен.РассчитатьПредыдущиеЦены(Объект);
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	Документы.СогласованиеЗакупочныхЦен.РассчитатьПредыдущиеЦены(Объект);
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ПОДРАЗДЕЛЕНИЯ"

&НаКлиенте
Процедура ДеревоПодразделенийУстановитьФлажки(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивно(ДеревоПодразделений.ПолучитьЭлементы(), Истина, Объект.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийСнятьФлажки(Команда)
	
	Объект.Подразделения.Очистить();
	УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивно(ДеревоПодразделений.ПолучитьЭлементы(), Ложь, Объект.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияПодразделениеКомпанииПриИзменении(Элемент)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийОбновитьФлажкиПодразделений(ДеревоПодразделений.ПолучитьЭлементы(), Объект.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоПодразделений.ТекущиеДанные;
	УправлениеДиалогомКлиент.ДеревоПодразделенийПометкаПриИзменении(ТекущиеДанные, Объект.Подразделения);
	
	//Мальцев А.Ю. +++
	массивВышестоящие = Новый Массив;
	массивПодчиненные = Новый Массив;
	ИТ_СпециальныйМодульСервер.ПолучитьВышестоящиеПодчиненныеПодразделения(ТекущиеДанные.ПодразделениеКомпании, массивВышестоящие, массивПодчиненные);
	
	Если ТекущиеДанные.Пометка Тогда
		УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивноСОтбором(ДеревоПодразделений.ПолучитьЭлементы(), Истина, Объект.Подразделения, массивПодчиненные);	
	Иначе
		УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивноСОтбором(ДеревоПодразделений.ПолучитьЭлементы(), Ложь, Объект.Подразделения, массивВышестоящие);	
		УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивноСОтбором(ДеревоПодразделений.ПолучитьЭлементы(), Ложь, Объект.Подразделения, массивПодчиненные);				
	КонецЕсли;
	//Мальцев А.Ю. ---
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияПослеУдаления(Элемент)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийОбновитьФлажкиПодразделений(ДеревоПодразделений.ПолучитьЭлементы(), Объект.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийРазвернуть(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийРазвернутьВсеУровни(Элементы.ДеревоПодразделений, ДеревоПодразделений.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийСвернуть(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийСвернутьВсеУровни(Элементы.ДеревоПодразделений, ДеревоПодразделений.ПолучитьЭлементы());
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ГРУППЫ ПОСТАВОК"

&НаКлиенте
Процедура ДеревоГруппПоставокУстановитьФлажкиРекурсивно(ВеткаДерева, Пометка) Экспорт//, ГруппыПоставок) Экспорт
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		ТекущаяСтрока.Пометка = Пометка;
		//ДеревоГруппПоставокПометкаПриИзмененииОб(ТекущаяСтрока, ГруппыПоставок);
		ДеревоГруппПоставокИзменениеПометки(ТекущаяСтрока);
		ДеревоГруппПоставокУстановитьФлажкиРекурсивно(ТекущаяСтрока.ПолучитьЭлементы(), Пометка);//, ГруппыПоставок);
	КонецЦикла;
	
КонецПроцедуры //ДеревоГруппПоставокУстановитьФлажкиРекурсивно()

&НаКлиенте
Процедура ДеревоГруппПоставокУстановитьФлажки(Команда)
	
	ДеревоГруппПоставокУстановитьФлажкиРекурсивно(ДеревоГруппПоставки.ПолучитьЭлементы(), Истина);//, Объект.ГруппыПоставки);
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийРазвернутьВсеУровни(Элементы.ДеревоГруппПоставки, ДеревоГруппПоставки.ПолучитьЭлементы());
	
КонецПроцедуры //ДеревоГруппПоставокУстановитьФлажки()

&НаКлиенте
Процедура ДеревоГруппПоставокСнятьФлажки(Команда)
	
	Объект.ГруппыПоставки.Очистить();
	//УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивно(ДеревоГруппПоставки.ПолучитьЭлементы(), Ложь, Объект.ГруппыПоставки);
	ДеревоГруппПоставокУстановитьФлажкиРекурсивно(ДеревоГруппПоставки.ПолучитьЭлементы(), Ложь);//, Объект.ГруппыПоставки);
	
КонецПроцедуры //ДеревоГруппПоставокСнятьФлажки()

&НаКлиенте
Процедура ДеревоГруппПоставокОбновитьФлажкиРекурсивно(ВеткаДерева, МассивГруппПоставок)
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		Позиция = МассивГруппПоставок.Найти(ТекущаяСтрока.ГруппаПоставки);
		Если Позиция = Неопределено Тогда
			ТекущаяСтрока.Пометка = Ложь;
		Иначе
			ТекущаяСтрока.Пометка = Истина;
			МассивГруппПоставок.Удалить(Позиция);
		КонецЕсли;
		
		Если ТекущаяСтрока.Пометка Тогда
			ДеревоГруппПоставокРазвернутьРодителя(Элементы.ДеревоГруппПоставки, ТекущаяСтрока.ПолучитьРодителя());
		КонецЕсли;
		
		ДеревоГруппПоставокОбновитьФлажкиРекурсивно(ТекущаяСтрока.ПолучитьЭлементы(), МассивГруппПоставок);
	КонецЦикла;
	
КонецПроцедуры //ДеревоГруппПоставокОбновитьФлажкиРекурсивно()

&НаКлиенте
Процедура ДеревоГруппПоставокРазвернутьРодителя(ЭлементФормыДерево, Родитель)
	
	Если Родитель=Неопределено Тогда
		Возврат;
	Иначе
		ЭлементФормыДерево.Развернуть(Родитель.ПолучитьИдентификатор());
		ДеревоГруппПоставокРазвернутьРодителя(ЭлементФормыДерево, Родитель.ПолучитьРодителя());
	КонецЕсли;
	
КонецПроцедуры //ДеревоГруппПоставокРазвернутьРодителя()

&НаКлиенте
Процедура ДеревоГруппПоставокРазвернутьПомеченныеРекурсивно(ЭлементФормыДерево, ВеткаДерева)
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		Если ТекущаяСтрока.Пометка Тогда
			ДеревоГруппПоставокРазвернутьРодителя(ЭлементФормыДерево, ТекущаяСтрока.ПолучитьРодителя());
		КонецЕсли;
		
		ДеревоГруппПоставокРазвернутьПомеченныеРекурсивно(ЭлементФормыДерево, ТекущаяСтрока.ПолучитьЭлементы());
	КонецЦикла;
	
КонецПроцедуры //ДеревоГруппПоставокРазвернутьПомеченныеРекурсивно()

&НаКлиенте
Процедура ГруппыПоставокГруппаПоставокПриИзменении(Элемент)
	
	//УправлениеДиалогомКлиент.ДеревоПодразделенийОбновитьФлажкиПодразделений(ДеревоГруппПоставки.ПолучитьЭлементы(), Объект.ГруппыПоставки);
	ВеткаДерева = ДеревоГруппПоставки.ПолучитьЭлементы();
	ГруппыПоставки=Объект.ГруппыПоставки;
	
	МассивПодразделений = Новый Массив;
	Для Каждого ТекущаяСтрока Из ГруппыПоставки Цикл
		МассивПодразделений.Добавить(ТекущаяСтрока.ПодразделениеКомпании);
	КонецЦикла;
	
	ДеревоГруппПоставокОбновитьФлажкиРекурсивно(ВеткаДерева, МассивПодразделений);

	
КонецПроцедуры

//&НаКлиенте
//Процедура ДеревоГруппПоставокПометкаПриИзмененииОб(ТекущиеДанные,ГруппыПоставки)
//	Если ТекущиеДанные = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если ТекущиеДанные.Пометка = Истина Тогда
//		Если ГруппыПоставки.НайтиСтроки(Новый Структура("ГруппаПоставки", ТекущиеДанные.ГруппаПоставки)).Количество()=0 Тогда
//			НоваяСтрока = ГруппыПоставки.Добавить();
//			НоваяСтрока.ГруппаПоставки = ТекущиеДанные.ГруппаПоставки;
//		КонецЕсли;
//	Иначе
//		НайденныеСтроки = ГруппыПоставки.НайтиСтроки(Новый Структура("ГруппаПоставки", ТекущиеДанные.ГруппаПоставки));
//		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
//			ГруппыПоставки.Удалить(НайденнаяСтрока);
//		КонецЦикла;
//	КонецЕсли;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ДеревоГруппПоставокИзменениеПометки(ТекущиеДанные)
	
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.НеУчаствуетВДвижениях Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Пометка Тогда
		Если Объект.ГруппыПоставки.НайтиСтроки(Новый Структура("ГруппаПоставки", ТекущиеДанные.ГруппаПоставки)).Количество()=0 Тогда
			НоваяСтрока = Объект.ГруппыПоставки.Добавить();
			НоваяСтрока.ГруппаПоставки = ТекущиеДанные.ГруппаПоставки;
		КонецЕсли;
	Иначе
		НайденныеСтроки = Объект.ГруппыПоставки.НайтиСтроки(Новый Структура("ГруппаПоставки", ТекущиеДанные.ГруппаПоставки));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Объект.ГруппыПоставки.Удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //ДеревоГруппПоставокИзменениеПометки()

&НаКлиенте
Процедура ДеревоГруппПоставокПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоГруппПоставки.ТекущиеДанные;
	
	//ДеревоГруппПоставокПометкаПриИзмененииОб(ТекущиеДанные, Объект.ГруппыПоставки);
	//Если ТекущиеДанные.Пометка Тогда
	//	ДеревоГруппПоставокУстановитьФлажкиРекурсивно(ТекущиеДанные.ПолучитьЭлементы(), ТекущиеДанные.Пометка, Объект.ГруппыПоставки);
	//КонецЕсли;
	
	ВеткаДерева = ТекущиеДанные.ПолучитьЭлементы();
	Если ВеткаДерева.Количество()=0 Тогда
		ДеревоГруппПоставокИзменениеПометки(ТекущиеДанные);
	Иначе
		Пометка = ТекущиеДанные.Пометка;
		Если Пометка Тогда
			Элементы.ДеревоГруппПоставки.Развернуть(ТекущиеДанные.ПолучитьИдентификатор());
		КонецЕсли;
		ДеревоГруппПоставокУстановитьФлажкиРекурсивно(ТекущиеДанные.ПолучитьЭлементы(), Пометка);
	КонецЕсли;
	
КонецПроцедуры //ДеревоГруппПоставокПометкаПриИзменении()

&НаКлиенте
Процедура ГруппыПоставокПослеУдаления(Элемент)
	
	МассивГруппПоставок = Новый Массив;
	Для Каждого ТекущаяСтрока Из Объект.ГруппыПоставки Цикл
		МассивГруппПоставок.Добавить(ТекущаяСтрока.ГруппаПоставки);
	КонецЦикла;
	
	ДеревоГруппПоставокОбновитьФлажкиРекурсивно(ДеревоГруппПоставки.ПолучитьЭлементы(), МассивГруппПоставок);
	
КонецПроцедуры //ГруппыПоставокПослеУдаления()

&НаКлиенте
Процедура ДеревоГруппПоставокРазвернуть(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийРазвернутьВсеУровни(Элементы.ДеревоГруппПоставки, ДеревоГруппПоставки.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоГруппПоставокСвернуть(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийСвернутьВсеУровни(Элементы.ДеревоГруппПоставки, ДеревоГруппПоставки.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПоставкиГруппаПоставкиПриИзменении(Элемент)
	
	МассивГруппПоставок = Новый Массив;
	Для Каждого ТекущаяСтрока Из Объект.ГруппыПоставки Цикл
		МассивГруппПоставок.Добавить(ТекущаяСтрока.ГруппаПоставки);
	КонецЦикла;
	
	ДеревоГруппПоставокОбновитьФлажкиРекурсивно(ДеревоГруппПоставки.ПолучитьЭлементы(), МассивГруппПоставок);
	
КонецПроцедуры //ГруппыПоставкиГруппаПоставкиПриИзменении()

&НаСервере
Процедура ГруппыПоставкиГруппаПоставкиОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение)=Тип("СправочникСсылка.ГруппыПоставки") И ВыбранноеЗначение.НеУчаствуетВДвижениях Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
		
КонецПроцедуры //ГруппыПоставкиГруппаПоставкиОбработкаВыбораНаСервере()

&НаКлиенте
Процедура ГруппыПоставкиГруппаПоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ГруппыПоставкиГруппаПоставкиОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры //ГруппыПоставкиГруппаПоставкиОбработкаВыбора()

&НаКлиенте
Процедура ПоискВТаблицеТовары(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПоискВТаблицеТоварыРезультатОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ПоискВТаблицеТоварыРезультатОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ШтрихКодДляПоиска = РезультатОповещения;
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ПоискПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКоду(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ДобавлениеНовыхПозицийПоШтрихКодуОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКодуОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ДобавлениеНовыхПозицийПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтборВТаблицеТовары(Команда)
	Элементы.Товары.ОтборСтрок = Неопределено;
КонецПроцедуры

//Мальцев А.Ю. +++
&НаКлиенте
Процедура ПриоритетПриИзменении(Элемент)
	
	Если Объект.Приоритет = 0 И Не ЗначениеЗаполнено(Объект.СрокДействия) Тогда		
		МаксимальнаяДата    = Дата("20990101");
		Объект.СрокДействия = МаксимальнаяДата;	
	КонецЕсли;
		
КонецПроцедуры
//Мальцев А.Ю. ---


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ШтрихКодДляПоиска = "";
