// Модуль служебной формы "Оплата через кассу"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОткрытьФормуЧека(Команда)
	
	Если Объект.СуммаДокумента = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Сумма для пробития на фискальном регистраторе не может быть нулевой.'"));
		
	Иначе
		
		Если ОстатокПоСделкеВВалютеОплаты < Объект.СуммаДокумента И Объект.ТипСпособаРасчетаККТ = ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Передача") Тогда
			СуммаАванса = Объект.СуммаДокумента - ОстатокПоСделкеВВалютеОплаты;
			СтрокаОплат = Объект.Оплаты.НайтиСтроки(Новый Структура("ТипОплаты", ПредопределенноеЗначение("Справочник.ТипыОплат.ЗачетАванса")));
			Если СтрокаОплат.Количество()=0 Тогда
				СтрокаОплат = Объект.Оплаты.Добавить();
				СтрокаОплат.ТипОплаты = ПредопределенноеЗначение("Справочник.ТипыОплат.ЗачетАванса"); 
				СтрокаОплат.Сумма = СуммаАванса;
			ИначеЕсли СтрокаОплат[0].Сумма <> СуммаАванса Тогда
				СтрокаОплат[0].Сумма = СтрокаОплат[0].Сумма + СуммаАванса;
			КонецЕсли;
		ИначеЕсли НЕ Объект.ТипСпособаРасчетаККТ = ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Передача") Тогда
			СтрокаОплат = Объект.Оплаты.НайтиСтроки(Новый Структура("ТипОплаты", ПредопределенноеЗначение("Справочник.ТипыОплат.ЗачетАванса")));
			Для Каждого Строка Из Объект.Оплаты Цикл
				Объект.Оплаты.Удалить(Строка);	
			КонецЦикла;
		КонецЕсли;
		
		// Создаем параметры открытия формы документа
		ЗначенияЗаполнения = Новый Структура("КопироватьДанныеФормы", ЭтотОбъект.Объект);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		// Производим открытие формы Чека на оплату
		ОткрытьФорму("Документ.ЧекНаОплату.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект.ВладелецФормы);
		
		// Завершаем работу с текущей формой
		ЭтотОбъект.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры // ОткрытьФормуЧека()

&НаКлиенте
Процедура ОткрытьОтчетВзаиморасчеты(Команда)
	
	// фильтры
	Отбор = Новый Структура;
	Отбор.Вставить("Сделка", Основание);
	
	ОтчетыПлатформаКлиент.ОткрытьОтчет("Отчет.Взаиморасчеты", "Движения",,,, Отбор,, ОбщегоНазначенияКлиент.ДатаСеанса());
	
КонецПроцедуры // ОткрытьОтчетВзаиморасчеты()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Касса ККМ" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура КассаККМПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЧекНаОплату.КассаККМПриИзменении(Объект, ПараметрыДействия);
	
	// Вызываем обработчик пересчета табличных частей объекта
	Документы.ЧекНаОплату.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
	Если НЕ ВалютаПоСделке = Объект.ВалютаДокумента Тогда
		СуммаПоСделкеВВалютеОплаты = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаПоСделке, ВалютаПоСделке, ЭтотОбъект.Основание.Дата, Объект.ВалютаДокумента, Объект.Дата, РежимОкругления.Окр15как20);
		ОстатокПоСделкеВВалютеОплаты = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ОстатокПоСделке, ВалютаПоСделке, ЭтотОбъект.Основание.Дата, Объект.ВалютаДокумента, Объект.Дата, РежимОкругления.Окр15как20);
	Иначе
		ОстатокПоСделкеВВалютеОплаты = ОстатокПоСделке;
		СуммаПоСделкеВВалютеОплаты = СуммаПоСделке;
	КонецЕсли;
	
КонецПроцедуры // КассаККМПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Касса ККМ".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура КассаККМПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	КассаККМПриИзмененииНаСервере();
	
КонецПроцедуры //КассаККМПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СуммаДокументаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЧекНаОплату.СуммаДокументаПриИзменении(Объект, ПараметрыДействия);
		
КонецПроцедуры // СуммаДокументаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Ставка НДС".
//
// Параметры:
//  Элемент - ПолеФормы - элемент формы, в котором возникло данное событие.
//
&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СуммаДокументаПриИзмененииНаСервере();
	
КонецПроцедуры // СуммаДокументаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Способа расчета".
//
// Параметры:
//  Элемент - ПолеФормы - элемент формы, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТипСпособаРасчетаККТПриИзменении(Элемент)
	
	Если Объект.ТипСпособаРасчетаККТ = ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Передача") Тогда
		Элементы.СуммаДокумента.ТолькоПросмотр = Истина;
		Объект.СуммаДокумента = СуммаПоСделкеВВалютеОплаты;	
	Иначе 
		Элементы.СуммаДокумента.ТолькоПросмотр = Ложь;
		Объект.СуммаДокумента = ОстатокПоСделкеВВалютеОплаты;		
	КонецЕсли;  
	
	СуммаДокументаПриИзменении(Неопределено);;
			
КонецПроцедуры //ТипСпособаРасчетаККТПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение объекта могло завершиться отказом, проверим установленный признак
	Если НЕ УправлениеДиалогомСервер.ПроверитьВозможностьОткрытияФормыОбъекта(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.Основание      = Параметры.Основание;
	ЭтотОбъект.СуммаПоСделке  = Параметры.Основание.СуммаДокумента;
	ЭтотОбъект.ВалютаПоСделке = Параметры.Основание.ВалютаДокумента;
 	
	СуммаПоСделкеВВалютеОплаты = СуммаПоСделке;
	Если НЕ ВалютаПоСделке = Объект.ВалютаДокумента Тогда
		СуммаПоСделкеВВалютеОплаты = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаПоСделке, ВалютаПоСделке, ЭтотОбъект.Основание.Дата, Объект.ВалютаДокумента, Объект.Дата, РежимОкругления.Окр15как20);
	КонецЕсли;	
	
	// Получаем долг 
	Аванс = 0;
	СтрокаОплат = Объект.Оплаты.НайтиСтроки(Новый Структура("ТипОплаты", ПредопределенноеЗначение("Справочник.ТипыОплат.ЗачетАванса")));
	Если СтрокаОплат.Количество()=1 Тогда
		Аванс = СтрокаОплат[0].Сумма;
	КонецЕсли;
	
	ОстатокПоСделке = Мин(СуммаПоСделкеВВалютеОплаты,Объект.СуммаДокумента) - Аванс;
	ОстатокПоСделкеВВалютеОплаты = ОстатокПоСделке;
		
	Элементы.СуммаДокумента.ТолькоПросмотр = (Объект.ТипСпособаРасчетаККТ = ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Передача"));
		
	// Произведем настройку параметров отбора для полей зависящих от организации и подразделения контекста.
	ЗащищенныеФункцииСервер.РасставитьСвязиПараметровВыбораПоОрганизации(ЭтотОбъект, Объект);
	
КонецПроцедуры // ПриСозданииНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
