
&НаКлиенте
Процедура Загрузить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Выйти(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура плвВведенноеЗначениеПриИзменении(Элемент)
	
	Если Элементы.Товары.Доступность Тогда
		Элементы.Товары.Доступность = Ложь;
		Элементы.РежимУдаленияСтроки.Заголовок = "Режим удаления";
	КонецЕсли;
	
	ВведенноеЗначение = СокрЛП(ВведенноеЗначение);
	
	Если ПустаяСтрока(ВведенноеЗначение) Тогда
		ЭтотОбъект.ТекущийЭлемент = Элементы.ВведенноеЗначение;
		Возврат;
	КонецЕсли;
	
	ОбработатьШтрих();
	
	//Элементы.Товары.ТекущийЭлемент = Элементы.Товары[0].ПолучитьИдентификатор();
	
	ПодключитьОбработчикОжидания("УстановитьПозициюНаШтрихкод", 0.01, Истина);
	
	ВведенноеЗначение = "";
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПозициюНаШтрихкод()
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.ВведенноеЗначение;
	Если НЕ Объект.Товары.Количество() = 0 Тогда
		Элементы.Товары.ТекущаяСтрока = Объект.Товары.Получить(Объект.Товары.Количество()-1).ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрих()
	Если НЕ ЗначениеЗаполнено(ВведенноеЗначение) тогда
		Возврат;
	КонецЕсли;
	
	Префикс = Лев(ВведенноеЗначение, 1);
	Если (СтрДлина(ВведенноеЗначение) = 13) и (Префикс = "2") Тогда
		шк = Лев(ВведенноеЗначение, 7);
		кол = Число(Лев(Прав(ВведенноеЗначение, 6), 5))/1000;
	иначеЕсли ((СтрДлина(ВведенноеЗначение) = 7) и (Префикс = "2")) или (СтрДлина(ВведенноеЗначение) >= 10 или СтрДлина(ВведенноеЗначение) = 8) тогда
		шк = ВведенноеЗначение;
		кол = 1;
	иначеЕсли НЕ Объект.Режим = "Инвентаризация" Тогда
		Если Объект.Товары.Количество() > 0 тогда
			НомДляПроверки = Объект.Товары[Объект.Товары.Количество()-1].Номенклатура;
			Если ПроверитьВЗаказе(НомДляПроверки,ВведенноеЗначение,Истина) тогда
				//Товары[Товары.Количество()-1].Количество = ВведенноеЗначение;
				//добавим в выбранную строку
				ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
				Если ТекущиеДанные <> Неопределено Тогда
					ТекущиеДанные.Количество = ВведенноеЗначение;
				КонецЕсли;
			КонецЕсли; 			
		КонецЕсли;
		Возврат;
	КонецЕсли;
   	 	
	Тов = вернутьтовар(шк);
	
	Если НЕ ЗначениеЗаполнено(Тов) тогда
		Тов = вернутьтоварПоАртикулу(ВведенноеЗначение);
		Если ЗначениеЗаполнено(Тов) Тогда
			ШК = ВведенноеЗначение;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Тов) и Объект.Режим = "Инвентаризация" тогда
		
		Если Объект.Товары.Количество() > 0 и НЕ Элементы.Товары.ТекущаяСтрока = Неопределено тогда
			ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
			Если ТекущиеДанные <> Неопределено Тогда
				Если СтрДлина(ВведенноеЗначение) > 3 Тогда 
					ВывестиСообщение("Не найден ШК: "+ ВведенноеЗначение);
					Возврат; КонецЕсли;
				ТекущиеДанные.Количество = ВведенноеЗначение;
				УстановитьКоличествоВСтрокиИнвентаризации(ТекущиеДанные.Количество,ТекущиеДанные.КлючСтроки);
			КонецЕсли;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Тов) тогда
		Если Объект.Режим = "ПоступлениеТоваров" и НЕ ПроверитьВЗаказе(Тов,кол) тогда
			Возврат;
		КонецЕсли;
		ДобСтроку = Истина;
		Если НЕ Объект.Режим = "Инвентаризация" Тогда
			//найдем строку с таким товаром и добавим количество
			МассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура",Тов));
			Если МассивСтрок.Количество()>0 Тогда
				нс = МассивСтрок[0];
				Если Объект.ЗапрашиватьКоличество Тогда
					//ВведенноеКоличество = кол;
					ТекущаяСтрока = нс.ПолучитьИдентификатор();
					
					Элементы.Товары.ТекущаяСтрока = ТекущаяСтрока;
					ДополнительныеПараметры = Новый Структура;
					ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
					ДополнительныеПараметры.Вставить("шк", шк);
					ДополнительныеПараметры.Вставить("Тов", Тов);
					
					ВведенноеКоличество = нс.Количество;
					ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВводаКоличества", ЭтотОбъект, ДополнительныеПараметры);
					ПоказатьВводЧисла(ОписаниеОповещения, ВведенноеКоличество, "Введите количество", 12, 3);
					Возврат;
				Иначе
					ТекущаяСтрока = нс.ПолучитьИдентификатор();
					
					Элементы.Товары.ТекущаяСтрока = ТекущаяСтрока;
					нс.Количество = нс.Количество + кол;
				КонецЕсли;
				ДобСтроку = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если ДобСтроку Тогда
			Если Объект.ЗапрашиватьКоличество Тогда
				ВведенноеКоличество = кол;
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("шк", шк);
				ДополнительныеПараметры.Вставить("Тов", Тов);
				
				ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВводаКоличества", ЭтотОбъект, ДополнительныеПараметры);
				ПоказатьВводЧисла(ОписаниеОповещения, ВведенноеКоличество, "Введите количество", 12, 3);
				//Если ВвестиЗначение(ВведенноеКоличество,"Введите количество",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(12,3,ДопустимыйЗнак.Неотрицательный))) Тогда 
				//	кол = ВведенноеКоличество;
				//КонецЕсли;
				Возврат;
			КонецЕсли;
		КонецЕсли;

		ОбработатьШтрихНаСервере(Тов,кол,шк,ДобСтроку);
		
	иначе
		ВывестиСообщение("Не найден ШК: "+ шк);
	КонецЕсли;
	
	ОбновитьСумму();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКоличествоВСтрокиИнвентаризации(Количество,КлючСтроки)
	
	мзСтрокиИнвентаризации = Регистрысведений.итСтрокиИнвентаризации.СоздатьНаборЗаписей();
	мзСтрокиИнвентаризации.Отбор.ИнвентаризацияТоваров.Установить(Объект.Документ);
	мзСтрокиИнвентаризации.Отбор.КлючСтроки.Установить(КлючСтроки);
	мзСтрокиИнвентаризации.Прочитать();
	Для каждого стрмзСтрокиИнвентаризации из мзСтрокиИнвентаризации Цикл
		стрмзСтрокиИнвентаризации.Количество = Количество;
	КонецЦикла;				
	мзСтрокиИнвентаризации.Записать();
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаВводаКоличества(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) тогда
		Возврат;
	КонецЕсли;
	
	шк = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеПараметры, "шк", "");
	Тов = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеПараметры, "Тов", "");
	
	ТекущаяСтрока = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеПараметры, "ТекущаяСтрока", Неопределено);
	Если ТекущаяСтрока = Неопределено Тогда
		ОбработатьШтрихНаСервере(Тов,Результат,шк, Истина);
	Иначе
		ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
		ТекущиеДанные.Количество = Результат;
		ОбработатьШтрихНаСервере(Тов,Результат,шк, Ложь);
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("УстановитьПозициюНаШтрихкод", 0.01, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШтрихНаСервере(Тов,кол,шк,ДобСтроку)
	Если ДобСтроку Тогда
		//Если Объект.ЗапрашиватьКоличество Тогда
		//	ВведенноеКоличество = кол;
		//	Если ВвестиЗначение(ВведенноеКоличество,"Введите количество",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(12,3,ДопустимыйЗнак.Неотрицательный))) Тогда 
		//		кол = ВведенноеКоличество;
		//	КонецЕсли;
		//КонецЕсли;
		
		нс                  = Объект.Товары.Добавить();					
		нс.ШтрихКод         = шк;	
		нс.Номенклатура     = Тов;
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	Номенклатура.ОсновнаяЕдиницаИзмерения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Номенклатура");
		Запрос.УстановитьПараметр("Номенклатура",нс.Номенклатура);
		Результат = Запрос.Выполнить().Выбрать();
		Результат.Следующий();
		нс.ЕдиницаИзмерения = Результат.ОсновнаяЕдиницаИзмерения;
		нс.Количество = кол;
		//Если НЕ Объект.Режим = "Инвентаризация" Тогда
			нс.Цена = ЦенообразованиеСервер.ПолучитьЦену(ПравоПользователя("ОсновнойСкладКомпании").ТипЦенСебестоимости,Тов,ТекущаяДата());
			
			Если типзнч(Объект.Документ) = тип("ДокументСсылка.Инвентаризация") тогда
				
				мзСтрокиИнвентаризации = Регистрысведений.итСтрокиИнвентаризации.СоздатьМенеджерЗаписи();
				мзСтрокиИнвентаризации.ИнвентаризацияТоваров = Объект.Документ;
				мзСтрокиИнвентаризации.КлючСтроки = Новый УникальныйИдентификатор();
				мзСтрокиИнвентаризации.ДатаВремяОперации = ТекущаяДата();
				мзСтрокиИнвентаризации.Номенклатура = нс.Номенклатура;
				мзСтрокиИнвентаризации.ЕдиницаИзмерения = нс.ЕдиницаИзмерения;
				мзСтрокиИнвентаризации.Количество = нс.Количество;
				мзСтрокиИнвентаризации.ШК = нс.ШтрихКод;
				мзСтрокиИнвентаризации.Оператор = Объект.Оператор;
				мзСтрокиИнвентаризации.ТСД = ПараметрыСеанса.ТекущийПользователь;
				мзСтрокиИнвентаризации.Записать();
				
				нс.КлючСтроки = мзСтрокиИнвентаризации.КлючСтроки;
			КонецЕсли;
			
		//КонецЕсли;
		//Элементы.Товары.ТекущаяСтрока
	КонецЕсли;
	Если типзнч(Объект.Документ) = тип("ДокументСсылка.ЗаказПоставщику") тогда
		Запрос = новый Запрос("ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Цена
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
		|	И ЗаказПоставщикуТовары.Номенклатура = &Номенклатура ");
		Запрос.УстановитьПараметр("Ссылка",Объект.Документ);
		Запрос.УстановитьПараметр("Номенклатура",нс.Номенклатура);  
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() тогда
			нс.Цена = Результат.Цена;  
		КонецЕсли;
	КонецЕсли;	
	
	//Элементы.Товары.ТекущаяСтрока = нс.НомерСтроки - 1;
	//Элементы.Товары.Обновить();
	//Элементы.Товары.Колонки.Количество.ТекстПодвала=Формат(Сумма,...);
	//Товары.
КонецПроцедуры

&НаСервере
Функция ПроверитьВЗаказе(Тов,кол,ПоследняяСтрока = неопределено)
	
	Если НЕ ЗначениеЗаполнено(Объект.Документ) или Объект.Режим = "Инвентаризация" тогда
		Возврат Истина;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура", Тов);	
	НайденныеСтроки = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
	ОбщееКолво = 0;
	
	Для каждого ТекСтрока из НайденныеСтроки Цикл
		ОбщееКолво = ОбщееКолво+ТекСтрока.Количество;
		Последнее = ТекСтрока.Количество;
	КонецЦикла;
	Если НЕ Последняястрока = Неопределено тогда
		ОбщееКолво = ОбщееКолво - Последнее;
	Конецесли;     	
	
	СтрокиВЗаказе = Объект.Документ.Товары.НайтиСтроки(ПараметрыОтбора);
	КолвоВЗаказе = 0;
	
	Если СтрокиВЗаказе.Количество() = 0 тогда
		
		//РежимВопроса = РежимДиалогаВопрос.ДаНет;
		//Текст = "НЕТ В ЗАКАЗЕ! ПРОДОЛЖИТЬ?";
		ВывестиСообщение("НЕТ В ЗАКАЗЕ!");
		//Ответ = Вопрос(Текст, РежимВопроса, 0);
		//Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат ложь;
		//КонецЕсли; 
	иначе
		Для каждого ТекСтрока из СтрокиВЗаказе Цикл
			КолвоВЗаказе = КолвоВЗаказе+ТекСтрока.Количество;
		КонецЦикла;
		Если КолвоВЗаказе < ОбщееКолво+кол тогда
			Перебор = ОбщееКолво+кол-КолвоВЗаказе; 		
			//РежимВопроса = РежимДиалогаВопрос.ДаНет;
			//Текст = "ЗАКАЗАНО: "+Строка(КолвоВЗаказе)+",ТРЕБУЕТ: "+Строка(ОбщееКолво+кол)+"! ПРОДОЛЖИТЬ?";
			ВывестиСообщение("ЗАКАЗАНО: "+Строка(КолвоВЗаказе)+",ТРЕБУЕТ: "+Строка(ОбщееКолво+кол)+"!");
			//Ответ = Вопрос(Текст, РежимВопроса, 0);
			//Если Ответ = КодВозвратаДиалога.Нет Тогда
				Возврат ложь;
			//КонецЕсли; 
		КонецЕсли;	
	КонецЕсли;	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция вернутьтовар(ОбщепитШтрихКод)
	
	Если Лев(ОбщепитШтрихКод,1) = "0" тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ШтрихКоды.Объект КАК Объект
		                      |ИЗ
		                      |	РегистрСведений.Штрихкоды КАК ШтрихКоды
		                      |ГДЕ
		                      |	ШтрихКоды.Штрихкод В(&ШтрихКод)
		                      |	И ШтрихКоды.Объект.ЕРПМастерКлюч <> """"
		                      |	И ШтрихКоды.Объект ССЫЛКА Справочник.Номенклатура");
		
		Масс = Новый Массив;
		Масс.Добавить(ОбщепитШтрихКод);
		Масс.Добавить(Прав(ОбщепитШтрихКод,Стрдлина(ОбщепитШтрихКод)-1));
		Запрос.УстановитьПараметр("ШтрихКод",Масс);					  
		Результат = Запрос.Выполнить().Выбрать();					  
		Если Результат.Следующий() тогда
			Тов = Результат.Объект;        	
		Иначе
			Тов = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;     
	Иначе	
		// Вставить содержимое обработчика.
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ШтрихКоды.Объект КАК Объект
		                      |ИЗ
		                      |	РегистрСведений.Штрихкоды КАК ШтрихКоды
		                      |ГДЕ
		                      |	ШтрихКоды.Штрихкод = &ШтрихКод
		                      |	И ШтрихКоды.Объект.ЕРПМастерКлюч <> """"
		                      |	И ШтрихКоды.Объект ССЫЛКА Справочник.Номенклатура");
		Запрос.УстановитьПараметр("ШтрихКод",ОбщепитШтрихКод);					  
		Результат = Запрос.Выполнить().Выбрать();					  
		Если Результат.Следующий() тогда
			Тов = Результат.Объект;        	
		Иначе
			Тов = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	Возврат тов;
КонецФункции // ()

&НаСервере
Функция ВернутьтоварПоАртикулу(ОбщепитШтрихКод) 
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Артикул = &ОбщепитШтрихКод
	|   И Номенклатура.ЕРПМастерКлюч <> """"
	|	И НЕ Номенклатура.ЭтоГруппа");
	
	Запрос.УстановитьПараметр("ОбщепитШтрихКод", ОбщепитШтрихКод);
	ВыборкаТоваров = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаТоваров.Следующий() Тогда
		Возврат ВыборкаТоваров.Ссылка;
	Иначе 
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗагрузитьНажатие(Элемент)
	ДобавитьДанныеВДокумент();
	
	//Если НЕ Объект.Режим = "Инвентаризация" тогда
		//ОткрытьФорму("ВнешняяОбработка.устПриемкаТСДНовая.Форма.Начало1");
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Оператор", Объект.Оператор);
		
		ОткрытьФорму("Обработка.устПриемкаТСДНовая.Форма.Начало1",ПараметрыОткрытияФормы);
		//Обрик.Открыть();
		ЗакрытьФорму = Истина;
		Закрыть("ОК");
	//КонецЕсли;
	
КонецПроцедуры
&НаКлиенте       
Процедура ВыйтиНажатие(Элемент)
	//СохранитьЗначение("СохраняемыеНастройкиНашегоТовары",Товары.Выгрузить());
	//СохранитьЗначение("СохраняемыеНастройкиНашегоИнвентаризация",Документ);
	//
	//Попытка
	//	ВнешняяОбработка = ВнешниеОбработки.Создать("\\10.0.4.29\Supermag1C\1C77Sklad\TSDOb.epf",ложь);
	//	Обрик = ВнешняяОбработка.Получитьформу();
	//	Обрик.Открыть();
	//Исключение КонецПопытки;
	//Закрыть("ОК");
	
	//Обрик = ОткрытьФорму("ВнешняяОбработка.устПриемкаТСДНовая.Форма.Документ1");
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", Объект.Режим);
	Обрик = ОткрытьФорму("Обработка.устПриемкаТСДНовая.Форма.Документ1", ПараметрыОткрытияФормы);
	//Обрик.Открыть();
	ЗакрытьФорму = Истина;
	Закрыть("ОК");


КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");

	Элементы.Загрузить.Заголовок = Объект.Режим;
	Если Объект.Режим = "Инвентаризация" тогда
		Элементы.ТоварыЦена.Видимость = ложь;
		Если ЗначениеЗаполнено(Объект.Документ) Тогда 
			ЗаполнитьДанныеИнвентаризации();
			ПодключитьОбработчикОжидания("УстановитьПозициюНаШтрихкод", 0.01, Истина);
		Иначе
			СоздатьИнвентаризацию();
		КонецЕсли;
	КонецЕсли;
	Если Объект.Режим = "ПеремещениеТоваров" тогда
		Элементы.ТоварыЦена.Видимость = ложь;
	КонецЕсли;   
	Если Объект.КомпонентаKeyBoardHook=Неопределено тогда
		ПодключитьВнешнююКомпоненту("\\10.0.4.29\Supermag1C\KHook1C.dll", "Hook",ТипВнешнейКомпоненты.Native);
		Попытка
			Объект.КомпонентаKeyBoardHook = Новый("AddIn.Hook.KeyboardHook");
			Объект.КомпонентаKeyBoardHook.ЗахватПервым = ЛОЖЬ;
			Объект.КомпонентаKeyBoardHook.ЗахватРазрешен = ИСТИНА;
			Объект.КомпонентаKeyBoardHook.СобытиеПриНажатии = ИСТИНА;
		Исключение	
		КонецПопытки;
	КонецЕсли;

	//ОбновитьСумму();
КонецПроцедуры
&НаСервере
Процедура ДокументОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ИнвентаризацияТоваровНаСкладе.Ссылка
	                      |ИЗ
	                      |	Документ.ИнвентаризацияТоваровНаСкладе КАК ИнвентаризацияТоваровНаСкладе
	                      |ГДЕ
	                      |	ИнвентаризацияТоваровНаСкладе.Номер ПОДОБНО ""%"+Текст+"%""
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ИнвентаризацияТоваровНаСкладе.Дата УБЫВ");
	Результат = Запрос.Выполнить().Выбрать();					  
	Если Результат.Следующий() тогда
		Значение = Результат.Ссылка;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры
&НаСервере
Процедура ДобавитьДанныеВДокумент()
	Если Объект.Товары.Количество() = 0 тогда
		Возврат;
	КонецЕсли;
	ЭтоЗаказПоставщику = ТипЗнч(Объект.Документ) = тип("ДокументСсылка.ЗаказПоставщику");
	
	Если Объект.Режим = "ПоступлениеТоваров" тогда
		Если ЗначениеЗаполнено(Объект.Документ) тогда  			
			Если ЭтоЗаказПоставщику тогда
				получ = документы.ПоступлениеТоваров.СоздатьДокумент();
				получ.Заполнить(Объект.Документ);
				//ЗаполнитьЗначенияСвойств(получ,Объект.Документ,,"ХозОперация,Автор,Номер,СуммаДокумента,Проведен");
				//Получ.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров; 
				Если Не ЗначениеЗаполнено(Получ.СкладКомпании) Тогда
					Получ.СкладКомпании = ПравоПользователя("ОсновнойСкладКомпании"); 
				КонецЕсли;
				//Получ.УстановитьНовыйНомер();
				Получ.Дата = ТекущаяДатаСеанса();
				Получ.Товары.Очистить();
				//Получ.ДокументОснование = Объект.Документ;
				//Получ.Автор = ПараметрыСеанса.ТекущийПользователь;
			иначе
				Получ = Объект.Документ.получитьОбъект();
			КонецЕсли;
		иначе
			Получ = документы.ПоступлениеТоваров.СоздатьДокумент();
			Получ.Заполнить(Неопределено);
			//Получ.УстановитьНовыйНомер();
			//Получ.Автор = ПараметрыСеанса.ТекущийПользователь;
			Получ.Дата = ТекущаяДатаСеанса();
			//Получ.Организация = Получ.Автор.Организация;
			Получ.СкладКомпании = ПравоПользователя("ОсновнойСкладКомпании"); 
			Получ.Контрагент = Справочники.Контрагенты.ОсновнойПоставщик; 
			Документы.ПоступлениеТоваров.КонтрагентПриИзменении(Получ);
			//Получ.ДоговорВзаиморасчетов = ОбработкаРеквизитовДокументаСервер.ПолучитьДоговорВзаиморасчетов(Справочники.Контрагенты.ОсновнойПоставщик,Перечисления.ВидыДоговоров.Покупка); 
			Получ.ТипЦен = Получ.СкладКомпании.ТипЦенСебестоимости; 
			Документы.ПоступлениеТоваров.ТипЦенПриИзменении(Получ);
			//Получ.ПодразделениеКомпании = Получ.Автор.ПодразделениеКомпании;
			Получ.РегламентированныйУчет = Истина;    	
			//Получ.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			//Получ.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров;
			//Получ.КурсДокумента = 1;
			//Получ.ТипЦен = Получ.СкладКомпании.ТипЦенСебестоимости;
			
		КонецЕсли;
		
		Получ.Товары.Очистить();
		Для каждого Текстрока из Объект.Товары Цикл
			Если Текстрока.Количество = 0 тогда
				Продолжить;
			КонецЕсли;	
			
			Новстр = Получ.Товары.добавить();
			Новстр.Номенклатура = Текстрока.Номенклатура;
			Документы.ПоступлениеТоваров.ТоварыНоменклатураПриИзменении(Получ,Новстр,);
			//Новстр.КоличествоМест
			Новстр.ЕдиницаИзмерения = Текстрока.ЕдиницаИзмерения;
			Документы.ПоступлениеТоваров.ТоварыЕдиницаИзмеренияПриИзменении(Получ,Новстр,);
			Новстр.Коэффициент = Текстрока.ЕдиницаИзмерения.Коэффициент ;
			Новстр.Количество = Число(ТекСтрока.Количество);  
			Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(Получ,Новстр,);
			Новстр.КоличествоБазовое = Новстр.Количество;
			Если ЭтоЗаказПоставщику тогда
				Новстр.Цена = Текстрока.Цена; 
				//Если Новстр.Цена = 0 тогда
				//	Новстр.Цена = ЦенообразованиеСервер.ПолучитьЦену(Получ.ТипЦен,Новстр.Номенклатура,Получ.Дата);  
				//КонецЕсли;
			иначе
				Новстр.Цена = ЦенообразованиеСервер.ПолучитьЦену(Получ.ТипЦен,Новстр.Номенклатура,Получ.Дата);  
			КонецЕсли;
			Документы.ПоступлениеТоваров.ТоварыЦенаПриИзменении(Получ,Новстр,);
			
			Новстр.Сумма = Новстр.Количество*Новстр.Цена;  		
			Новстр.СуммаВсего = Новстр.Сумма;
			Документы.ПоступлениеТоваров.ТоварыСуммаВсегоПриИзменении(Получ,Новстр,);
			Новстр.СтавкаНДС = Новстр.Номенклатура.СтавкаНДС;
			Документы.ПоступлениеТоваров.ТоварыСтавкаНДСПриИзменении(Получ,Новстр,);
			Новстр.СуммаНДС = Новстр.Сумма*Новстр.СтавкаНДС.Ставка/(100+Новстр.СтавкаНДС.Ставка);
			//Новстр.СуммаБезНалогов = Новстр.Сумма-Новстр.СуммаНДС;
			//Новстр.ЦенаБезНалогов = Новстр.СуммаБезНалогов/Новстр.Количество;
			//Трофимова 21.12.2018 +++
			//Если ЭтоЗаказПоставщику Тогда
			//	СтрокиСЦеной = Объект.Документ.Товары.НайтиСтроки(Новый Структура("Номенклатура,Цена",Текстрока.Номенклатура,Текстрока.Цена));
			//	Если СтрокиСЦеной.Количество()>0 Тогда 
			//		СтрокаСценой = СтрокиСЦеной[0];
			//		ЗаполнитьЗначенияСвойств(Новстр,СтрокаСценой,"ЦенаРозничная,СуммаРозничная,ПроцентНаценки");
			//	КонецЕсли;
			//КонецЕсли;
			//Трофимова 21.12.2018 --- 
		КонецЦикла;
		Получ.Записать(РежимЗаписиДокумента.Запись);
		Объект.Товары.Очистить();
	ИначеЕсли Объект.Режим = "Инвентаризация" тогда
		Если ЗначениеЗаполнено(Объект.Документ) тогда
			Получ =Объект.Документ.получитьОбъект();				
		иначе			
			Получ = документы.Инвентаризация.СоздатьДокумент();
			Получ.Заполнить(Неопределено);
			//Получ.УстановитьНовыйНомер();
			//Получ.Автор = ПараметрыСеанса.ТекущийПользователь;
			Получ.Дата = ТекущаяДатаСеанса();
			Получ.Организация = Получ.Автор.Организация;
			Получ.СкладКомпании = ПравоПользователя("ОсновнойСкладКомпании"); 
			//Получ.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
			//Получ.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			Получ.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваровПредварительная;
			Документы.Инвентаризация.ХозОперацияПриИзменении(Получ);
			Получ.СкладКомпании = ПравоПользователя("ОсновнойСкладКомпании"); 			
			//Получ.КурсДокумента = 1;
			Получ.СтатьяСписанияОбнаруженнойНедостачиТМЦ = Справочники.СтатьиДоходовИРасходов.СписаниеОбнаруженнойНедостачиТМЦ;
			Получ.СтатьяОприходованияОбнаруженныхИзлишковТМЦ = Справочники.СтатьиДоходовИРасходов.ОприходованиеОбнаруженныхИзлишковТМЦ;
			Получ.РежимКорректировкиКоличества = ПравоПользователя("КорректировкаКоличестваВИнвентаризации");
			Получ.ТипЦен = ПравоПользователя("ОсновнойСкладКомпании").ТипЦенСебестоимости;
			Документы.Инвентаризация.ТоварыПересчитатьПоказателиПоДаннымУчета(Получ, , );
		КонецЕсли;
		
				
		тбТовары = Объект.Товары.Выгрузить();
		тбТовары.Свернуть("Номенклатура","Количество");
		
		Объект.Товары.Очистить();
		Объект.Товары.Загрузить(тбТовары);
		
		Получ.Товары.Очистить();
		Для каждого Текстрока из Объект.Товары Цикл  			
			Новстр = Получ.Товары.добавить();
			Новстр.Номенклатура = Текстрока.Номенклатура;
			Новстр.ИдентификаторСтроки = Текстрока.ШтрихКод;				
			Новстр.ЕдиницаИзмерения = Новстр.Номенклатура.ОсновнаяЕдиницаИзмерения;
			Новстр.Коэффициент = Новстр.ЕдиницаИзмерения.Коэффициент ;
			Новстр.КоличествоФакт = Число(ТекСтрока.Количество); 
			Новстр.Цена = ЦенообразованиеСервер.ПолучитьЦену(Получ.ТипЦен,Новстр.Номенклатура,Получ.Дата);  
			СуммаФакт = Новстр.КоличествоФакт*Новстр.Цена;  		
			Новстр.Сумма = Новстр.СуммаФакт; 
			Если Объект.Режим = "Инвентаризация"  Тогда
				Новстр.ХарактеристикаНоменклатуры = Текстрока.ХарактеристикаНоменклатуры; 									
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			Получ.ДатаЗаписиНаТСД = ТекущаяДата();
			Получ.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			Получ.ОбменДанными.Загрузка = Истина;
			Получ.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		Документ = Получ.Ссылка;  
		Объект.Товары.Очистить();
		
	ИначеЕсли Объект.Режим = "СписаниеТоваров" тогда
		Если ЗначениеЗаполнено(Объект.Документ) тогда
			Получ =Объект.Документ.получитьОбъект();	
			
		иначе			
			Получ = документы.СписаниеТоваров.СоздатьДокумент();
			Получ.Заполнить(Неопределено);
			//Получ.УстановитьНовыйНомер();
			//Получ.Автор = ПараметрыСеанса.ТекущийПользователь;
			Получ.Дата = ТекущаяДатаСеанса();
			//Получ.Организация = Получ.Автор.Организация;
			Получ.СкладКомпании = ПравоПользователя("ОсновнойСкладКомпании"); 
			//Получ.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
			Получ.РегламентированныйУчет = Истина;    	
			//Получ.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			//Получ.ХозОперация = Справочники.ХозОперации.СписаниеТоваров;
			//Получ.КурсДокумента = 1;
			Получ.СтатьяСписанияТМЦ = Справочники.СтатьиДоходовИРасходов.СписаниеОбнаруженнойНедостачиТМЦ;
			Получ.ТипЦен = Получ.СкладКомпании.ТипЦенСебестоимости;
			Документы.СписаниеТоваров.ТипЦенПриИзменении(Получ);
			
		КонецЕсли;
		Получ.Товары.Очистить();
		Для каждого Текстрока из Объект.Товары Цикл
			
			Новстр = Получ.Товары.добавить();
			
			Новстр.Номенклатура = Текстрока.Номенклатура;
			Новстр.ЕдиницаИзмерения = Текстрока.ЕдиницаИзмерения;
			Новстр.Коэффициент = Текстрока.ЕдиницаИзмерения.Коэффициент ;
			Новстр.Количество = Число(ТекСтрока.Количество);   		 		
			Новстр.ЦенаРозничная = ЦенообразованиеСервер.ПолучитьЦену(Получ.ТипЦен,Новстр.Номенклатура,Получ.Дата);  
			Новстр.СуммаРозничная = Новстр.Количество*Новстр.ЦенаРозничная;  		
						
		КонецЦикла;
		Получ.Записать(РежимЗаписиДокумента.Запись);
		Объект.Товары.Очистить();

	ИначеЕсли Объект.Режим = "ВозвратПоставщику" тогда
		Если ЗначениеЗаполнено(Объект.Документ) тогда
			Получ =Объект.Документ.получитьОбъект();	
		иначе			
			Получ = документы.ВозвратПоставщику.СоздатьДокумент();
			//Получ.УстановитьНовыйНомер();
			Получ.Автор = ПараметрыСеанса.ТекущийПользователь;
			Получ.Заполнить(Неопределено);
			Получ.Дата = ТекущаяДатаСеанса();
			//Получ.Организация = ПараметрыСеанса.Организация;
			Получ.СкладКомпании = ПравоПользователя("ОсновнойСкладКомпании"); 
			//Получ.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
			Получ.РегламентированныйУчет = Истина;    	
			//Получ.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			//Получ.ХозОперация = Справочники.ХозОперации.ВозвратТоваровПоставщику;
			//Получ.КурсДокумента = 1;
			Получ.ТипЦен = Получ.СкладКомпании.ТипЦенСебестоимости;
			Документы.ВозвратПоставщику.ТипЦенПриИзменении(Получ);
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПоступлениеТоваровТовары.Ссылка.Контрагент,
			|	ПоступлениеТоваровТовары.Ссылка.ДоговорВзаиморасчетов КАК Договор,
			|	ПоступлениеТоваровТовары.Ссылка.СкладКомпании
			|ИЗ
			|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
			|ГДЕ
			|	ПоступлениеТоваровТовары.Номенклатура = &Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПоступлениеТоваровТовары.Ссылка.Дата УБЫВ");
			Запрос.УстановитьПараметр("Номенклатура",Объект.Товары[0].Номенклатура);
			Результат = Запрос.Выполнить().Выбрать();
			Если Результат.Следующий() тогда
				Получ.Контрагент = Результат.Контрагент;
				Получ.ДоговорВзаиморасчетов = Результат.Договор;
				Если НЕ ЗначениеЗаполнено(Получ.СкладКомпании) тогда
				Получ.СкладКомпании = Результат.СкладКомпании;
				КонецЕсли;
			Конецесли;      			
		КонецЕсли;
		//Табл = Объект.Товары.Свернуть("Номенклатура,ЕдиницаИзмерения","Количество");
		Получ.Товары.Очистить();
		Для каждого Текстрока из Объект.Товары Цикл
			Новстр = Получ.Товары.добавить();
			Новстр.Номенклатура = Текстрока.Номенклатура;
			Документы.ВозвратПоставщику.ТоварыНоменклатураПриИзменении(Получ,Новстр);
			Новстр.ЕдиницаИзмерения = Текстрока.ЕдиницаИзмерения;
			Документы.ВозвратПоставщику.ТоварыЕдиницаИзмеренияПриИзменении(Получ,Новстр);
			Новстр.Коэффициент = Текстрока.ЕдиницаИзмерения.Коэффициент ;
			Новстр.Количество = Число(ТекСтрока.Количество);  
			Документы.ВозвратПоставщику.ТоварыКоличествоПриИзменении(Получ,Новстр);
			Новстр.Партия = ПолучитьПартиюТовара(Текстрока.Номенклатура);
			Если Новстр.Партия = Неопределено Тогда
				ВывестиСообщение("Не найдена партия для номенклатуры " + Новстр.Номенклатура);
				Возврат;
			КонецЕсли;
			Документы.ВозвратПоставщику.ТоварыПартияПриИзменении(Получ,Новстр);
			//Новстр.КоличествоБазовое = Новстр.Количество;
			//Новстр.Цена = ЦенообразованиеСервер.ПолучитьЦену(Получ.ТипЦен,Новстр.Номенклатура,Получ.Дата);  
			//Новстр.Сумма = Новстр.Количество*Новстр.Цена; 
			//Новстр.СуммаВсего = Новстр.Сумма;
			//Новстр.СтавкаНДС = Новстр.Номенклатура.СтавкаНДС;
			//Новстр.СуммаНДС = Новстр.Сумма*Новстр.СтавкаНДС.Ставка/(100+Новстр.СтавкаНДС.Ставка);
			
			//Получ.ОбработкаРеквизита("Товары.Номенклатура",Новстр,Получ)
		КонецЦикла;
		Получ.Записать(РежимЗаписиДокумента.Запись);
		Объект.Товары.Очистить();
		
	ИначеЕсли Объект.Режим = "ПеремещениеТоваров" тогда
		Получ = документы.ПеремещениеТоваров.СоздатьДокумент();
		Получ.Заполнить(Неопределено);
		//Получ.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
		Получ.УстановитьНовыйНомер();
		//Получ.Автор = ПараметрыСеанса.ТекущийПользователь;
		Получ.Дата = ТекущаяДатаСеанса();
		//Получ.Организация = ПараметрыСеанса.Организация;
		Получ.СкладКомпании = ПравоПользователя("ОсновнойСкладКомпании");
		Получ.СкладПолучатель = Справочники.СкладыКомпании.ПустаяСсылка();
		Получ.РегламентированныйУчет = Истина;    	
		Получ.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		Получ.ТипЦен = Получ.СкладКомпании.ТипЦенСебестоимости;
		//Получ.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров;
		//Получ.КурсДокумента = 1;
		//Получ.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваров; 			
		
		Получ.Товары.Очистить();
		Для каждого Текстрока из Объект.Товары Цикл
			Если Текстрока.Количество = 0 тогда
				Текстрока.Количество = 1;
				//Продолжить;
			КонецЕсли;	
			
			Новстр = Получ.Товары.добавить();
			Новстр.Номенклатура = Текстрока.Номенклатура;
			
			//Новстр.КоличествоМест
			Новстр.ЕдиницаИзмерения = Текстрока.ЕдиницаИзмерения;
			Новстр.Коэффициент = Текстрока.ЕдиницаИзмерения.Коэффициент ;
			Новстр.Количество = Число(ТекСтрока.Количество);  
			Новстр.КоличествоБазовое = Новстр.Количество;
			Новстр.Цена = ЦенообразованиеСервер.ПолучитьЦену(Получ.ТипЦен,Новстр.Номенклатура,Получ.Дата);  
			
			Новстр.Сумма = Новстр.Количество*Новстр.Цена;  		
			Новстр.СуммаВсего = Новстр.Сумма;
			Новстр.СтавкаНДС = Новстр.Номенклатура.СтавкаНДС;
			Новстр.СуммаНДС = Новстр.Сумма*Новстр.СтавкаНДС.Ставка/(100+Новстр.СтавкаНДС.Ставка);
			//Если ЗначениеЗаполнено(Документ) тогда
			//	Найден =Объект.Документ.Товары.Найти(Новстр.Номенклатура,"Номенклатура");
			//	Если НЕ Найден = Неопределено тогда
			//		Новстр.ИТ_КоличествоКороба = Окр(?(Найден.Количество=0,0,Новстр.Количество*Найден.ИТ_КоличествоШтук/Найден.Количество));
			//	КонецЕсли;
			//КонецЕсли;
			//Новстр.ИТ_КоличествоКороба = 1;
			Документы.ПеремещениеТоваров.ТоварыНоменклатураПриИзменении(Получ,Новстр);

			//Получ.ОбработкаРеквизита("Товары.Номенклатура",Новстр,Получ);
		КонецЦикла;
		//Получ.Товары.Свернуть("Номенклатура,ЕдиницаИзмерения,Коэффициент,ХарактеристикаНоменклатуры,Цена,СтавкаНДС,Партия,ПроцентНаценки,ЦенаРозничная,ИТ_ВесКороба,ИТ_Упаковка","Количество,КоличествоБазовое,Сумма,СуммаВсего,СуммаНДС,СуммаРозничная,ИТ_КоличествоКороба");
		//Получ.ОбменДанными = Истина;
		Получ.ОбменДанными.Загрузка = Истина;
		Получ.Записать(РежимЗаписиДокумента.Запись);
		Объект.Товары.Очистить();

	КонецЕсли;
	
Конецпроцедуры

&НаСервере
Функция ПолучитьПартиюТовара(Ном)
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ПартииТоваровКомпании.Партия КАК Документ
			|ИЗ
			|	РегистрНакопления.ПартииТоваровКомпании.Обороты(, , , ) КАК ПартииТоваровКомпании
			|ГДЕ
			|	ПартииТоваровКомпании.Номенклатура = &Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	Документ УБЫВ";
	Запрос = Новый Запрос;
	Запрос.Текст= ТекстЗапроса;
	Запрос.УстановитьПараметр("Номенклатура",Ном);
	Выборка =Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий()Тогда
		Возврат Выборка.Документ;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции
&НаКлиенте
Процедура ОбновитьСумму()
	ИтогСумма = 0;
	Для каждого ТекСтрока из Объект.Товары Цикл
		ИтогСумма = ТекСтрока.Количество * ТекСтрока.Цена + ИтогСумма;
	КонецЦикла; 	
	Элементы.ТоварыНоменклатура.Заголовок = "Ном-ра/Сум:"+Формат(ИтогСумма,"ЧДЦ=2");
Конецпроцедуры
&НаКлиенте
Процедура ДобавитьДанныеВДокументЦенаПриИзменении(Элемент)
	//ОбновитьСумму();	
КонецПроцедуры
&НаКлиенте
Процедура ДобавитьДанныеВДокументКоличествоПриИзменении(Элемент)
	//ОбновитьСумму();	
КонецПроцедуры
&НаКлиенте
Процедура ОбновлениеОтображения()
	ОбновитьСумму();
КонецПроцедуры
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если ((Источник="KeyboardHook") И (Событие="KeyboardHook")) Тогда
		ЭтотОбъект.ТекущийЭлемент = Элементы.ВведенноеЗначение;
		ЭтотОбъект.НачатьРедактированиеЭлемента();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНажатие(Элемент)
	Если Объект.Товары.Количество()>0 тогда
		УдСтр = Элементы.Товары.ТекущаяСтрока; 		
		Объект.Товары.Удалить(УдСтр);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыИнвентарицации(ДокИнвентаризация)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	итСтрокиИнвентаризации.ИнвентаризацияТоваров КАК ИнвентаризацияТоваров,
	                      |	итСтрокиИнвентаризации.КлючСтроки КАК КлючСтроки,
	                      |	итСтрокиИнвентаризации.Номенклатура КАК Номенклатура,
	                      |	итСтрокиИнвентаризации.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                      |	итСтрокиИнвентаризации.Количество КАК Количество,
	                      |	итСтрокиИнвентаризации.Оператор КАК Оператор,
	                      |	итСтрокиИнвентаризации.ДатаВремяОперации КАК ДатаВремяОперации,
	                      |	итСтрокиИнвентаризации.ДатаВремяОтменыОперации КАК ДатаВремяОтменыОперации,
	                      |	итСтрокиИнвентаризации.ШК КАК ШтрихКод
	                      |ИЗ
	                      |	РегистрСведений.итСтрокиИнвентаризации КАК итСтрокиИнвентаризации
	                      |ГДЕ
	                      |	итСтрокиИнвентаризации.ИнвентаризацияТоваров = &ИнвентаризацияТоваров
	                      |	И итСтрокиИнвентаризации.ДатаВремяОтменыОперации = ДАТАВРЕМЯ(1, 1, 1)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаВремяОперации");
	Запрос.УстановитьПараметр("ИнвентаризацияТоваров" ,ДокИнвентаризация);
	
Возврат	Запрос.Выполнить().Выгрузить();	
КонецФункции


&НаСервере
Процедура ЗаполнитьДанныеИнвентаризации()
	тбСтрокиИнвентаризации = ПолучитьТоварыИнвентарицации(Объект.Документ);
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Если тбСтрокиИнвентаризации.Количество() = 0 Тогда
		Если Объект.Документ.Товары.Количество()>0 Тогда
			Если ТекОбъект.Товары.Количество()>0 Тогда ТекОбъект.Товары.Очистить(); КонецЕсли;
			Для каждого ТСтрока Из Объект.Документ.Товары Цикл
				НСтрока = ТекОбъект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НСтрока,ТСтрока);
				НСтрока.Количество = ТСтрока.КоличествоФакт;
			КонецЦикла; 
		КонецЕсли;
	Иначе
		Если ТекОбъект.Товары.Количество()>0 Тогда ТекОбъект.Товары.Очистить(); КонецЕсли;
		Для каждого ТСтрока Из тбСтрокиИнвентаризации Цикл
			НСтрока = ТекОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НСтрока,ТСтрока);
			НСтрока.Количество = ТСтрока.Количество;
		КонецЦикла; 
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	

КонецПроцедуры

&НаСервере
Процедура СоздатьИнвентаризацию()
	
	ДокИнвентаризация = документы.Инвентаризация.СоздатьДокумент();
	ДокИнвентаризация.Заполнить(Неопределено);
	ДокИнвентаризация.Автор = ПараметрыСеанса.ТекущийПользователь;
	ДокИнвентаризация.Дата = ТекущаяДатаСеанса();
	ДокИнвентаризация.Организация = ДокИнвентаризация.Автор.Организация;
	ДокИнвентаризация.СкладКомпании = ПравоПользователя("ОсновнойСкладКомпании"); 
	ДокИнвентаризация.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваровПредварительная;
	Документы.Инвентаризация.ХозОперацияПриИзменении(ДокИнвентаризация);
	ДокИнвентаризация.СкладКомпании = ПравоПользователя("ОсновнойСкладКомпании"); 			
	ДокИнвентаризация.СтатьяСписанияОбнаруженнойНедостачиТМЦ = Справочники.СтатьиДоходовИРасходов.СписаниеОбнаруженнойНедостачиТМЦ;
	ДокИнвентаризация.СтатьяОприходованияОбнаруженныхИзлишковТМЦ = Справочники.СтатьиДоходовИРасходов.ОприходованиеОбнаруженныхИзлишковТМЦ;
	ДокИнвентаризация.РежимКорректировкиКоличества = ПравоПользователя("КорректировкаКоличестваВИнвентаризации");
	ДокИнвентаризация.ТипЦен = ПравоПользователя("ОсновнойСкладКомпании").ТипЦенСебестоимости;
	Документы.Инвентаризация.ТоварыПересчитатьПоказателиПоДаннымУчета(ДокИнвентаризация, , );
	ДокИнвентаризация.Записать(РежимЗаписиДокумента.Запись);
	Объект.Документ = ДокИнвентаризация.Ссылка;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспользоватьПодключаемоеОборудование = Истина;	
	ДокументТовары = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Документ", Документы.ПоступлениеТоваров.ПустаяСсылка());
	Объект.Режим = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Режим", "ПоступлениеТоваров");
	Объект.Оператор = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Оператор", "ПоступлениеТоваров");	
	Объект.Документ = ДокументТовары;
	Для Каждого ТекСтрока ИЗ ДокументТовары.Товары Цикл
		НовыйСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйСтрока, ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы = Ложь И (НЕ ЗакрытьФорму) Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапрашиватьКоличествоПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьПозициюНаШтрихкод", 0.01, Истина);
	
КонецПроцедуры

&НаСервере
Процедура РежимУдаленияСтрокиНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура РежимУдаленияСтроки(Команда)
	Если Элементы.Товары.Доступность Тогда
		УдалитьТекущуюСтрокуСписка();
		Элементы.Товары.Доступность = Ложь;
		Элементы.РежимУдаленияСтроки.Заголовок = "Режим удаления";
		Элементы.ВведенноеЗначение.Доступность = Истина;		
		Элементы.ОтменитьУдаление.Видимость = Ложь;
	Иначе
		Элементы.Товары.Доступность = Истина;
		Элементы.РежимУдаленияСтроки.Заголовок = "Удалить";
		Элементы.ВведенноеЗначение.Доступность = Ложь;
		Элементы.ОтменитьУдаление.Видимость = Истина;
	КонецЕсли;	 
	
		ПодключитьОбработчикОжидания("УстановитьПозициюНаШтрихкод", 0.01, Истина);

	РежимУдаленияСтрокиНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьТекущуюСтрокуСписка()
	
	ТекСтрока = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	КлючСтроки = ТекСтрока.КлючСтроки;
	регСтрокиИнвентаризации = РегистрыСведений.итСтрокиИнвентаризации.СоздатьНаборЗаписей();
	регСтрокиИнвентаризации.отбор.ИнвентаризацияТоваров.Установить(Объект.Документ);
	регСтрокиИнвентаризации.отбор.КлючСтроки.Установить(КлючСтроки);
	регСтрокиИнвентаризации.Прочитать();
	
	Для каждого стррегСтрокиИнвентаризации из регСтрокиИнвентаризации Цикл
		стррегСтрокиИнвентаризации.ДатаВремяОтменыОперации = ТекущаяДата();
	КонецЦикла;	
	регСтрокиИнвентаризации.Записать();
	
	Объект.Товары.Удалить(ТекСтрока.НомерСтроки-1);	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОтменитьУдаление(Команда)
	Элементы.Товары.Доступность = Ложь;
	Элементы.РежимУдаленияСтроки.Заголовок = "Режим удаления";
	Элементы.ВведенноеЗначение.Доступность = Истина;		
	Элементы.ОтменитьУдаление.Видимость = Ложь;
	
	ПодключитьОбработчикОжидания("УстановитьПозициюНаШтрихкод", 0.01, Истина);
КонецПроцедуры
