// Модуль объекта документа "Акт постановки на баланс ЕГАИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗаполнитьАктНаПостановиНаБалансПоИнвентаризации(ДанныеЗаполнения)
	
	Товары.Очистить();
	Марки.Очистить();
	
	ХозОперация = Справочники.ХозОперации.АктПостановкиНаБалансВТорговыйЗалЕГАИС;
	ПричинаПостановкиНаБаланс = Перечисления.ПричиныПостановкиНаБалансЕГАИС.Излишки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МИНИМУМ(ВложенныйЗапрос.НомерСтроки) КАК НомерСтроки,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.АлкогольнаяПродукция КАК АлкогольнаяПродукция
	|ИЗ
	|	(ВЫБРАТЬ
	|		МИНИМУМ(ИнвентаризацияТовары.НомерСтроки) КАК НомерСтроки,
	//|	СУММА(ВЫБОР
	//|			КОГДА ИнвентаризацияТовары.АлкогольнаяПродукция.Упакована
	//|				ТОГДА ИнвентаризацияТовары.КоличествоФакт - ИнвентаризацияТовары.КоличествоКнижн
	//|			ИНАЧЕ (ИнвентаризацияТовары.КоличествоФакт - ИнвентаризацияТовары.КоличествоКнижн) * 10
	//|	КОНЕЦ) КАК Количество,
	|		СУММА(ИнвентаризацияТовары.КоличествоФакт - ИнвентаризацияТовары.КоличествоКнижн) КАК Количество,
	|		ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
	|		ИнвентаризацияТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ИнвентаризацияТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция
	|	ИЗ
	|		Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Товары КАК ИнвентаризацияТовары
	|	ГДЕ
	|		ИнвентаризацияТовары.Ссылка = &Ссылка
	|		И (НЕ ИнвентаризацияТовары.АлкогольнаяПродукция = ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка))
	|		И ИнвентаризацияТовары.Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка)
	|	СГРУППИРОВАТЬ ПО
	|		ИнвентаризацияТовары.Номенклатура,
	|		ИнвентаризацияТовары.ХарактеристикаНоменклатуры,
	|		ИнвентаризацияТовары.АлкогольнаяПродукция
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		МИНИМУМ(ИнвентаризацияТовары.НомерСтроки) КАК НомерСтроки,
	|		-КОЛИЧЕСТВО(ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.КодМарки) КАК Количество,
	|		ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
	|		ИнвентаризацияТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ИнвентаризацияТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция
	|	ИЗ
	|		Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Товары КАК ИнвентаризацияТовары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Марки КАК ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки
	|	ПО
	|		ИнвентаризацияТовары.Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка) И 
	|		ИнвентаризацияТовары.Ссылка = &Ссылка И 
	|		ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.Ссылка = &Ссылка И 
	|		ИнвентаризацияТовары.ИдентификаторСтроки = ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.ИдентификаторСтроки И 
	|		(НЕ ВЫРАЗИТЬ(ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.КодМарки КАК Строка(68)) = ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.КодМарки)
	|	ГДЕ
	|		ИнвентаризацияТовары.Ссылка = &Ссылка И 
	|		ИнвентаризацияТовары.Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка) И 
	|		ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.Ссылка = &Ссылка И 
	|		(НЕ ИнвентаризацияТовары.АлкогольнаяПродукция = ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка))
	|	СГРУППИРОВАТЬ ПО
	|		ИнвентаризацияТовары.Номенклатура,
	|		ИнвентаризацияТовары.ХарактеристикаНоменклатуры,
	|		ИнвентаризацияТовары.АлкогольнаяПродукция
	|	ИМЕЮЩИЕ
	|		КОЛИЧЕСТВО(ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.КодМарки)>0) КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.АлкогольнаяПродукция
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.Количество) > 0
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Акт списания ЕГАИС"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_АктСписанияЕГАИС(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.ПричинаСписания = Перечисления.ПричиныСписанияЕГАИС.Пересортица ИЛИ НЕ ЗначениеЗаполнено(ДанныеЗаполнения.РегистрационныйНомер) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
		
	ПричинаПостановкиНаБаланс = Перечисления.ПричиныПостановкиНаБалансЕГАИС.Пересортица;
	НомерАктаСписания         = ДанныеЗаполнения.РегистрационныйНомер;
	АктСписания               = ДанныеЗаполнения;
	ДокументОснование         = ДанныеЗаполнения;
	
	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.АктСписанияСТорговогоЗалаЕГАИС Тогда
		ХозОперация = Справочники.ХозОперации.АктПостановкиНаБалансВТорговыйЗалЕГАИС;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               //|	СписаниеТоваровТовары.Коэффициент КАК Коэффициент,
	               |	СписаниеТоваровТовары.Количество КАК Количество,
	               |	СписаниеТоваровТовары.ИдентификаторСтроки КАК ИдентификаторСтроки1,
	               |	СписаниеТоваровТовары.Справка2 КАК Справка2,
	               |	СписаниеТоваровТовары.Номенклатура КАК Номенклатура,
	               |	СписаниеТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               //|	СписаниеТоваровТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	СписаниеТоваровТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ЕСТЬNULL(Справки2.АлкогольнаяПродукция, СписаниеТоваровТовары.АлкогольнаяПродукция) КАК АлкогольнаяПродукция,
	               |	ЕСТЬNULL(Справки2.НомерСправки1, """") КАК НомерСправки1,
	               |	ЕСТЬNULL(Справки2.НомерФиксацииТТН, """") КАК НомерФиксации,
	               |	ЕСТЬNULL(Справки2.ДатаФиксацииТТН, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаФиксации,
	               |	ЕСТЬNULL(Справки1.ДатаРозлива, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРозлива,
	               |	ЕСТЬNULL(Справки1.Ссылка, ЗНАЧЕНИЕ(Справочник.Справки1ЕГАИС.ПустаяСсылка)) КАК Справка1,
	               |	ЕСТЬNULL(Справки1.Количество, 0) КАК КоличествоПродукции
	               |ПОМЕСТИТЬ ВремТаб
	               |ИЗ
	               |	Документ.АктСписанияЕГАИС.Товары КАК СписаниеТоваровТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Справки2ЕГАИС КАК Справки2
	               |		ПО СписаниеТоваровТовары.Справка2 = Справки2.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Справки1ЕГАИС КАК Справки1
	               |		ПО (Справки2.НомерСправки1 = Справки1.Номер)
	               |ГДЕ
	               |	СписаниеТоваровТовары.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               //|	ВремТаб.Коэффициент КАК Коэффициент,
	               |	ВремТаб.Количество КАК Количество,
	               |	ВремТаб.ИдентификаторСтроки1 КАК ИдентификаторСтроки1,
	               |	ВремТаб.Справка2 КАК Справка2,
	               |	ВремТаб.Номенклатура КАК Номенклатура,
	               |	ВремТаб.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               //|	ВремТаб.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ВремТаб.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ВремТаб.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	               |	ВремТаб.НомерСправки1 КАК НомерСправки1,
	               |	ВремТаб.НомерФиксации КАК НомерФиксации,
	               |	ВремТаб.ДатаФиксации КАК ДатаФиксации,
	               |	ВремТаб.ДатаРозлива КАК ДатаРозлива,
	               |	ВремТаб.Справка1 КАК Справка1,
	               |	ВремТаб.КоличествоПродукции КАК КоличествоПродукции,
	               |	ВремТаб.АлкогольнаяПродукция.ВидПродукции.ВидЛицензии КАК ВидЛицензии,
	               |	ВремТаб.АлкогольнаяПродукция.ВидПродукции КАК ВидПродукции
	               |ИЗ
	               |	ВремТаб КАК ВремТаб";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Товары.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если ХозОперация = Справочники.ХозОперации.АктПостановкиНаБалансВТорговыйЗалЕГАИС Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ВидПродукции) И (НЕ Выборка.ВидЛицензии = Перечисления.ВидыЛицензийАлкогольнойПродукции.АлкогольнаяПродукция) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Счетчик = 1 По Выборка.Количество Цикл
			НоваяМарка = Марки.Добавить();
			НоваяМарка.ИдентификаторСтроки  = Выборка.ИдентификаторСтроки;
			НоваяМарка.Справка2       = Выборка.Справка2;
		КонецЦикла;
		
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_АктСписанияЕГАИС()

// Производит заполнение объекта на основании документа "Инвентаризация алкогольной продукции ЕГАИС"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ИнвентаризацияАлкогольнойПродукцииЕГАИС(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Товары.Очистить();
	Марки.Очистить();
	
	Если ХозОперация = Справочники.ХозОперации.АктПостановкиНаБалансВТорговыйЗалЕГАИС Тогда
		
		ЗаполнитьАктНаПостановиНаБалансПоИнвентаризации(ДанныеЗаполнения);
		
	Иначе
		
		ХозОперация = Справочники.ХозОперации.АктПостановкиНаБалансЕГАИС;
		
		ПричинаПостановкиНаБаланс = Перечисления.ПричиныПостановкиНаБалансЕГАИС.Излишки;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
		Запрос.УстановитьПараметр("Ссылка",           ДанныеЗаполнения);
		Запрос.УстановитьПараметр("Момент",           ТекущаяДата());
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
		|	ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
		//|	ИнвентаризацияТовары.ЕдиницаИзмерения,
		//|	ИнвентаризацияТовары.Коэффициент,
		|	ИнвентаризацияТовары.ХарактеристикаНоменклатуры,
		|	ИнвентаризацияМарки.КодМарки,
		|	ИнвентаризацияТовары.Справка1,
		|	ИнвентаризацияТовары.Справка2,
		|	ВЫБОР
		|		КОГДА ИнвентаризацияТовары.АлкогольнаяПродукция = ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка) ТОГДА
		|			ИнвентаризацияТовары.Справка1.АлкогольнаяПродукция
		|		ИНАЧЕ
		|			ИнвентаризацияТовары.АлкогольнаяПродукция
		|	КОНЕЦ КАК АлкогольнаяПродукция
		|ПОМЕСТИТЬ
		|	ТаблицаМарок
		|ИЗ
		|	Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Марки КАК ИнвентаризацияМарки
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Товары КАК ИнвентаризацияТовары
		|ПО
		|	ИнвентаризацияТовары.Ссылка = &Ссылка И 
		|	ИнвентаризацияТовары.ИдентификаторСтроки = ИнвентаризацияМарки.ИдентификаторСтроки
		|ГДЕ
		|	ИнвентаризацияМарки.Ссылка = &Ссылка И 
		|	(НЕ ИнвентаризацияМарки.КодМарки = """") И 
		|	(НЕ ИнвентаризацияТовары.Справка2 = Значение(Справочник.Справки2ЕГАИС.ПустаяСсылка))
		//|	ИнвентаризацияТовары.Справка2.ПоштучныйУчет = ИСТИНА     		
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаМарок.Номенклатура КАК Номенклатура,
		|	ТаблицаМарок.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		//|	ТаблицаМарок.ЕдиницаИзмерения,
		//|	ТаблицаМарок.Коэффициент,
		|	ТаблицаМарок.ХарактеристикаНоменклатуры,
		|	ТаблицаМарок.Справка1 КАК Справка1,
		|	ТаблицаМарок.Справка2 КАК Справка2,
		|	ТаблицаМарок.АлкогольнаяПродукция,
		|	ТаблицаМарок.КодМарки
		|ИЗ
		|	ТаблицаМарок КАК ТаблицаМарок
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ОстаткиМарокЕГАИС.Остатки(&Момент, (КодМарки, ОрганизацияЕГАИС) В (ВЫБРАТЬ КодМарки, ОрганизацияЕГАИС ИЗ ТаблицаМарок)) КАК ОстаткиМарокЕГАИС
		|ПО
		|	ТаблицаМарок.КодМарки = ОстаткиМарокЕГАИС.КодМарки
		|ГДЕ
		|	ОстаткиМарокЕГАИС.КодМарки ЕСТЬ NULL
		|ИТОГИ
		|	МАКСИМУМ(Номенклатура),
		//|	МАКСИМУМ(ЕдиницаИзмерения),
		//|	МАКСИМУМ(Коэффициент),
		|	МАКСИМУМ(ХарактеристикаНоменклатуры),
		|	МАКСИМУМ(Справка1),
		|	МАКСИМУМ(АлкогольнаяПродукция),
		|	МАКСИМУМ(Справка2)
		|ПО
		|	ТаблицаМарок.АлкогольнаяПродукция
		|";
		
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		СчетчикСтрок = 1;
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрокаТоваров = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТоваров, Выборка);
			НоваяСтрокаТоваров.ИдентификаторСтроки  = СчетчикСтрок;
			
			ВыборкаМарки = Выборка.Выбрать();
			Пока ВыборкаМарки.Следующий() Цикл
				
				НоваяСтрокаМарок = Марки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаМарок, ВыборкаМарки);
				НоваяСтрокаМарок.ИдентификаторСтроки  = СчетчикСтрок;
				
			КонецЦикла;
			
			НоваяСтрокаТоваров.Количество = ВыборкаМарки.Количество();
			
			СчетчикСтрок = СчетчикСтрок + 1;
		КонецЦикла;
	
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПоступлениеТоваров()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ДокументЗаполнения") Тогда
		// Вызываем общий обработчик события
		Если ДанныеЗаполнения.Свойство("ХозОперация") Тогда
			ХозОперация = ДанныеЗаполнения.ХозОперация;
		КонецЕсли;
		Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения.ДокументЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
			Возврат;
		КонецЕсли;
		//КонецЕсли;
	Иначе
		// Вызываем общий обработчик события
		Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ОбработкаЗаполненияПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ОбработкаЗаполненияПоУмолчанию(ЭтотОбъект);
	Марки.Очистить();
	Для Каждого ТекущаяСтрока Из Товары Цикл
		ТекущаяСтрока.Справка2 = Справочники.Справки2ЕГАИС.ПустаяСсылка();
	КонецЦикла;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПричинаПостановкиНаБаланс = Перечисления.ПричиныПостановкиНаБалансЕГАИС.Пересортица Тогда
		Если ПроверяемыеРеквизиты.Найти("АктСписания")= Неопределено Тогда
			ПроверяемыеРеквизиты.Добавить("АктСписания");
		КонецЕсли;
	Иначе
		НайденныйРеквизит = ПроверяемыеРеквизиты.Найти("АктСписания");
		Если НЕ НайденныйРеквизит=Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(НайденныйРеквизит);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ЗаписатьСоответствиеНоменклатуры(Товары,,Ложь);
	
	Если ПустаяСтрока(Идентификатор) Тогда
		Идентификатор = СокрЛП(Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ЗаписатьСтатусДокументаЕГАИСПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.АктПостановкиНаБалансЕГАИС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РегистрыНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.ЗаписатьТаблицуДвижений(ДополнительныеСвойства.ТаблицыДляДвижений.ОстаткиАлкогольнойПродукцииЕГАИС, Движения, Отказ);
	РегистрыНакопления.ОстаткиМарокЕГАИС.ЗаписатьТаблицуДвижений(ДополнительныеСвойства.ТаблицыДляДвижений.ОстаткиМарокЕГАИС, Движения, Отказ);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры // ОбработкаПроведения()

#Область Инициализация

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецОбласти

#КонецЕсли
