
#Область Служебный

// Заполняет структуру выполнения операции на Оборудовании.
// 
Функция ПараметрыВыполненияОперацииНаОборудовании(Результат = Ложь, ОписаниеОшибки = Неопределено, ИдентификаторУстройства = Неопределено) Экспорт; 
	
	РезультатВыполнения = Новый Структура();
	РезультатВыполнения.Вставить("Результат"              , Результат);
	РезультатВыполнения.Вставить("ОписаниеОшибки"         , ОписаниеОшибки);
	РезультатВыполнения.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	РезультатВыполнения.Вставить("ВыходныеПараметры"      , Неопределено);
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейсСлужебный

Процедура ВыполнитьОбмен(ВходныеПараметры, АдресХранилища) Экспорт
	
	//ВходныеПараметры.ИдентификаторУстройства
	//Если СтрокаТЧ.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток") Тогда
	//		ПодключаемоеОборудованиеOfflineКлиент.АсинхронныйВыгрузитьТоварыВОборудованиеOffline(СтрокаТЧ.ТипОборудования, МассивУстройств, ТекстСообщения, Ложь, ОповещениеОВыполнении, Истина);
	//	Иначе
	//		МенеджерОфлайнОборудованияКлиент.НачатьВыгрузкуДанныхНаККМ(СтрокаТЧ.Устройство, УникальныйИдентификатор, ОповещениеОВыполнении);
	//	КонецЕсли;
	
	ВыполнитьКомандуОборудования(ВходныеПараметры, АдресХранилища)
	
КонецПроцедуры

Процедура ВыполнитьКомандуОборудования(ВходныеПараметры, АдресХранилища) Экспорт
	
	Если ВходныеПараметры.ИмяКоманды = "ПолнаяВыгрузкаПрайсЛистаВККМ" Тогда
		НачатьПолнуюВыгрузкуПрайсЛистаНаККМ(ВходныеПараметры.ИдентификаторУстройства);
	ИначеЕсли ВходныеПараметры.ИмяКоманды = "ЗагрузкаДанныхИзККМ" Тогда
		НачатьЗагрузкуДанныхИзККМ(ВходныеПараметры.ИдентификаторУстройства);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыгрузкуДанныхНаККМ(ИдентификаторУстройства,
	ОтображатьСообщения = Истина) Экспорт
	
	НаборВыгружаемыхДанных = Новый Структура;
	НаборВыгружаемыхДанных.Вставить("Настройки", Истина);
	НаборВыгружаемыхДанных.Вставить("ПрайсЛист", Истина);
	НаборВыгружаемыхДанных.Вставить("Заказы",	 Истина);
	НаборВыгружаемыхДанных.Вставить("ПолныйПрайсЛист", Ложь);
	
	Контекст = Новый Структура;
	//Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ОтображатьСообщения"     , ОтображатьСообщения);
	Контекст.Вставить("НаборВыгружаемыхДанных"  , НаборВыгружаемыхДанных);
	Контекст.Вставить("Команда", "ВыгрузитьДанные");
	
	Если ИдентификаторУстройства = Неопределено Тогда
		//RadV добавить сообщение об ошибке
		//ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыгрузкуДанныхНаККМПослеВыбораУстройства", ЭтотОбъект, Контекст);
		//МенеджерОборудованияКлиент.ПредложитьВыбратьУстройство(ОписаниеОповещения, "ККМОфлайн",
		//	НСтр("ru='Выберите ККМ Офлайн'"), НСтр("ru='ККМ Офлайн не подключены'"));
	Иначе
		НачатьВыгрузкуДанныхНаККМПослеВыбораУстройства(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьПолнуюВыгрузкуПрайсЛистаНаККМ(ИдентификаторУстройства,
	ОтображатьСообщения = Истина) Экспорт
	
	НаборВыгружаемыхДанных = Новый Структура;
	НаборВыгружаемыхДанных.Вставить("Настройки", Ложь);
	НаборВыгружаемыхДанных.Вставить("ПрайсЛист", Ложь);
	НаборВыгружаемыхДанных.Вставить("Заказы",	 Ложь);
	НаборВыгружаемыхДанных.Вставить("ПолныйПрайсЛист", Истина);
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОтображатьСообщения"     , ОтображатьСообщения);
	Контекст.Вставить("НаборВыгружаемыхДанных"  , НаборВыгружаемыхДанных);
	Контекст.Вставить("Команда", "ВыгрузитьДанные");
	
	Если ИдентификаторУстройства = Неопределено Тогда
		//RadV добавить сообщение об ошибке
		//ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыгрузкуДанныхНаККМПослеВыбораУстройства", ЭтотОбъект, Контекст);
		//МенеджерОборудованияКлиент.ПредложитьВыбратьУстройство(ОписаниеОповещения, "ККМОфлайн",
		//	НСтр("ru='Выберите ККМ Офлайн'"), НСтр("ru='ККМ Офлайн не подключены'"));
	Иначе
		НачатьВыгрузкуДанныхНаККМПослеВыбораУстройства(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыгрузкуНастроекНаККМ(ИдентификаторУстройства,
	ОтображатьСообщения = Истина) Экспорт
	
	НаборВыгружаемыхДанных = Новый Структура;
	НаборВыгружаемыхДанных.Вставить("Настройки", Истина);
	НаборВыгружаемыхДанных.Вставить("ПрайсЛист", Ложь);
	НаборВыгружаемыхДанных.Вставить("Заказы",	 Ложь);
	НаборВыгружаемыхДанных.Вставить("ПолныйПрайсЛист", Ложь);
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОтображатьСообщения"     , ОтображатьСообщения);
	Контекст.Вставить("НаборВыгружаемыхДанных"  , НаборВыгружаемыхДанных);
	Контекст.Вставить("Команда", "ВыгрузитьНастройки");
	
	Если ИдентификаторУстройства = Неопределено Тогда
		//RadV добавить сообщение об ошибке
		//ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыгрузкуДанныхНаККМПослеВыбораУстройства", ЭтотОбъект, Контекст);
		//МенеджерОборудованияКлиент.ПредложитьВыбратьУстройство(ОписаниеОповещения, "ККМОфлайн",
		//	НСтр("ru='Выберите ККМ Офлайн'"), НСтр("ru='ККМ Офлайн не подключены'"));
	Иначе
		НачатьВыгрузкуДанныхНаККМПослеВыбораУстройства(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьОчисткуПрайсЛистаНаККМ(ИдентификаторУстройства,
	ОтображатьСообщения = Истина) Экспорт
	
	НачатьОчисткуТоваровВККМOffline(ИдентификаторУстройства, ОтображатьСообщения);
	
КонецПроцедуры

Процедура НачатьЗагрузкуДанныхИзККМ(ИдентификаторУстройства,
	ОтображатьСообщения = Истина) Экспорт
	
	Контекст = Новый Структура;
	//Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ОтображатьСообщения"     , ОтображатьСообщения);
	
	Если ИдентификаторУстройства = Неопределено Тогда
		//RadV добавить сообщение об ошибке
		//ОписаниеОповещения = Новый ОписаниеОповещения("НачатьЗагрузкуДанныхИзККМПослеВыбораУстройства", ЭтотОбъект, Контекст);
		//МенеджерОборудованияКлиент.ПредложитьВыбратьУстройство(ОписаниеОповещения, "ККМОфлайн",
		//	НСтр("ru='Выберите ККМ Offline'"), 
		//	НСтр("ru='ККМ Offline не подключены.'"),
		//	НСтр("ru='ККМ Offline не не выбрано.'"), 
		//	НЕ ОтображатьСообщения);
	Иначе
		НачатьЗагрузкуДанныхИзККМПослеВыбораУстройства(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСОборудованиемККМOffline

// Начать выполнение команды ответственному обработчику драйвера
//
Функция НачатьВыполнениеКоманды(Идентификатор, Команда, ВходныеПараметры, СписокОборудования = Неопределено) Экспорт
	
	// Поиск подключенного устройства.
	//ПодключенноеУстройство = ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО, Идентификатор);
	Если СписокОборудования = Неопределено Тогда
		СписокОборудования = ПодключитьОборудованиеПоИдентификатору(Идентификатор);
		
		Если СписокОборудования.Количество()=0 Тогда
			ТекстОшибки = НСтр("ru='Не удалось подключить обработчик драйвера или загрузить драйвер.'");
			РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании();
			РезультатВыполнения.Результат = Ложь;
			РезультатВыполнения.ОписаниеОшибки = ТекстОшибки; 
			Возврат РезультатВыполнения;
		КонецЕсли;
		
	КонецЕсли;
	
	ПодключенноеУстройство = СписокОборудования[Идентификатор];
	
	//Если ПодключенноеУстройство <> Неопределено Тогда
	
	//ОбработчикДрайвераМодуль = МенеджерОфлайнОборудованияСерверПовтИсп.ПолучитьОбработчикДрайвера(ПодключенноеУстройство.ОбработчикДрайвера, Не ПодключенноеУстройство.ВСоставеКонфигурации, ПодключенноеУстройство.ТипОборудованияИмя);
	//ОбъектДрайвера           = МенеджерОфлайнОборудованияСерверПовтИсп.ПолучитьОбъектДрайвера(ПодключенноеУстройство);
	ОбработчикДрайвераМодуль = ПодключенноеУстройство.ОбработчикДрайвераМодуль;
	ОбъектДрайвера           = ПодключенноеУстройство.ОбъектДрайвера;
	
	Если ОбработчикДрайвераМодуль = Неопределено Или ОбъектДрайвера = Неопределено Тогда
		// Сообщить об ошибке, что не удалось загрузить драйвер.
		ТекстОшибки = НСтр("ru='Не удалось подключить обработчик драйвера или загрузить драйвер.'");
		РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании();
		РезультатВыполнения.Результат = Ложь;
		РезультатВыполнения.ОписаниеОшибки = ТекстОшибки; 
		//ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
	Иначе
		Если ОбработчикДрайвераМодуль.ПоддержкаАсинхронногоРежима() Тогда
			РезультатВыполнения = ОбработчикДрайвераМодуль.НачатьВыполнениеКоманды(Команда, ВходныеПараметры,
			ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
		Иначе
			ТекстОшибки = "";
			ВыходныеПараметры = Неопределено;
			Результат = ОбработчикДрайвераМодуль.ВыполнитьКоманду(Команда, ВходныеПараметры,
			ВыходныеПараметры,  ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
			Если Не Результат Тогда
				Если ВыходныеПараметры.Количество() >= 2 Тогда
					ТекстОшибки = ВыходныеПараметры[1];
				КонецЕсли;
				ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
			КонецЕсли;
			РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Результат, ТекстОшибки, Идентификатор);
			РезультатВыполнения.ВыходныеПараметры = ВыходныеПараметры;
			РезультатВыполнения.Вставить("ОбработчикДрайвераМодуль", ОбработчикДрайвераМодуль);
			РезультатВыполнения.Вставить("ОбъектДрайвера"          , ОбъектДрайвера);
			РезультатВыполнения.Вставить("ПодключенноеУстройство"  , ПодключенноеУстройство);
			//ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
		КонецЕсли;
	КонецЕсли;
	//Иначе
	//	// Сообщить об ошибке, что устройство не подключено.
	//	ТекстОшибки = НСтр("ru='Устройство не подключено. Перед выполнением операции устройство должно быть подключено.'");
	//	РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании();
	//	РезультатВыполнения.Результат = Ложь;
	//	РезультатВыполнения.ОписаниеОшибки = ТекстОшибки; 
	//	ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
	//КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

// Выполняет команду обработчика драйвера, не требующую предварительного подключения устройства в системе.
//
Функция ВыполнитьКомандуОбработчикаДрайвера(Команда, ВходныеПараметры, ВыходныеПараметры, Идентификатор, Параметры, ПоддержкаАсинхронногоРежима) Экспорт
	
	Результат = Ложь;
	
	Если Идентификатор <> Неопределено Тогда
		ДанныеОборудования = МенеджерОборудованияВызовСервера.ПолучитьДанныеУстройства(Идентификатор);
		ОбработчикДрайвераМодуль = МенеджерОфлайнОборудованияСерверПовтИсп.ПолучитьОбработчикДрайвера(ДанныеОборудования.ОбработчикДрайвера, Не ДанныеОборудования.ВСоставеКонфигурации, ДанныеОборудования.ТипОборудованияИмя);
		Если ОбработчикДрайвераМодуль <> Неопределено Тогда
			Результат = ОбработчикДрайвераМодуль.ВыполнитьКоманду(Команда, ВходныеПараметры, ВыходныеПараметры, Неопределено, Параметры, Неопределено);
			ПоддержкаАсинхронногоРежима = ОбработчикДрайвераМодуль.ПоддержкаАсинхронногоРежима();
		КонецЕсли;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

#Область КомандаВыгрузкаДанных

Процедура НачатьВыгрузкуДанныхНаККМПослеВыбораУстройства(ИдентификаторУстройства, Параметры) Экспорт // оповещение
	
	Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	//
	//#Если ВебКлиент Тогда
	//	ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыгрузкуДанныхНаККМПродолжение", ЭтотОбъект, Параметры);
	//	ПроверитьДоступностьРасширенияРаботыСФайлами(ОписаниеОповещения, Ложь);
	//#Иначе
	//	// В тонком и толстом клиентах расширение подключено всегда.
	РезультатВыполнения = НачатьВыгрузкуДанныхНаККМПродолжение(Истина, Параметры);
	//#КонецЕсли
	
КонецПроцедуры

Функция НачатьВыгрузкуДанныхНаККМПродолжение(Подключено, Контекст) Экспорт // оповещение
	
	Если Не Подключено Тогда
		ТекстСообщения = НСтр("ru='Данная операция не доступна без установленного расширения для веб-клиента ""1С:Предприятие"".'");
		Если Контекст.ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		//Если Контекст.СледующееОповещение <> Неопределено Тогда
		//	
			РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства",
													Ложь, ТекстСообщения, Контекст.ИдентификаторУстройства
			);
		//	
		//	ВыполнитьОбработкуОповещения(Контекст.СледующееОповещение, РезультатВыполнения);
		//КонецЕсли;
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ОписаниеОшибки = "";
	
	СписокОборудования = ПодключитьОборудованиеПоИдентификатору(Контекст.ИдентификаторУстройства,
		ОписаниеОшибки
	);
	
	Если СписокОборудования.Количество()>0 Тогда
		
		//Состояние(НСтр("ru='Выполняется выгрузка данных в ККМ Офлайн...'")); 
		
		Параметры = Новый Структура;
		Параметры.Вставить("ИдентификаторУстройства", Контекст.ИдентификаторУстройства);
		Параметры.Вставить("НаборВыгружаемыхДанных",  Контекст.НаборВыгружаемыхДанных);
		
		ДанныеДляВыгрузки = МенеджерОфлайнОборудованияВызовСервера.ПолучитьДанныеДляВыгрузки(Параметры);
		
		ВходныеПараметры  = Новый Структура("ДанныеДляВыгрузки", ДанныеДляВыгрузки);
		ВыходныеПараметры = Неопределено;
		
		ИмяКоманды = Контекст.Команда;
		
		//ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыгрузкуДанныхНаККМЗавершение", ЭтотОбъект, Контекст);
		РезультатВыполнения = НачатьВыполнениеКоманды(Контекст.ИдентификаторУстройства, ИмяКоманды, ВходныеПараметры, СписокОборудования);
		НачатьВыгрузкуДанныхНаККМЗавершение(РезультатВыполнения, Контекст);
		
	Иначе
		
		ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка.
									|%ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
		
		Если Контекст.ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		//Если Контекст.СледующееОповещение <> Неопределено Тогда
			
			РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства",
													Ложь, ТекстСообщения, Контекст.ИдентификаторУстройства
			);
			
		//	ВыполнитьОбработкуОповещения(Контекст.СледующееОповещение, РезультатВыполнения);
		//КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

Процедура НачатьВыгрузкуДанныхНаККМЗавершение(РезультатКоманды, Параметры) Экспорт // оповещение
	
	//Если НЕ РезультатКоманды.Результат Тогда
	//	ТекстСообщения = НСтр("ru='При выгрузке данных в оборудование произошла ошибка.
	//							|%ОписаниеОшибки%'");
	//	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатКоманды.ВыходныеПараметры[1]);
	//Иначе
	//	
	//	МенеджерОфлайнОборудованияВызовСервера.ОповеститьОбУдачнойВыгрузке(Параметры.ИдентификаторУстройства, Параметры.НаборВыгружаемыхДанных);
	//	
	//	ТекстСообщения = НСтр("ru='Данные успешно выгружены'");
	//КонецЕсли;
	
	//Если Параметры.СледующееОповещение <> Неопределено Тогда
	//	РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства", РезультатКоманды.Результат, ТекстСообщения, Параметры.ИдентификаторУстройства);
	//	ВыполнитьОбработкуОповещения(Парамёетры.СледующееОповещение, РезультатВыполнения);
	//Иначе
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//КонецЕсли;
	
	//МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройства);
	
КонецПроцедуры

#КонецОбласти

#Область КомандаЗагрузкаДанных

Функция НачатьЗагрузкуДанныхИзККМПослеВыбораУстройства(ИдентификаторУстройства, Параметры) Экспорт
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		//Если Параметры.СледующееОповещение <> Неопределено Тогда
			РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства", Ложь, ТекстСообщения, Неопределено);
		//	ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатВыполнения);
		//КонецЕсли;
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
//#Если ВебКлиент Тогда
//	ОписаниеОповещения = Новый ОписаниеОповещения("НачатьЗагрузкуДанныхИзККМПродолжение", ЭтотОбъект, Параметры);
//	ПроверитьДоступностьРасширенияРаботыСФайлами(ОписаниеОповещения, Ложь);
//#Иначе
	// В тонком и толстом клиентах расширение подключено всегда.
	НачатьЗагрузкуДанныхИзККМПродолжение(Истина, Параметры);
//#КонецЕсли
	
КонецФункции

Функция НачатьЗагрузкуДанныхИзККМПродолжение(Подключено, Параметры) Экспорт
	
	Если Не Подключено Тогда
		ТекстСообщения = НСтр("ru='Данная операция не доступна без установленного расширения для веб-клиента ""1С:Предприятие"".'");
		Если Параметры.ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		//Если Параметры.СледующееОповещение <> Неопределено Тогда
			РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства",
													Ложь, ТекстСообщения, Параметры.ИдентификаторУстройства
			);
			//ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатВыполнения);
		//КонецЕсли;
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ОписаниеОшибки = "";
	
	СписокОборудования = ПодключитьОборудованиеПоИдентификатору(Параметры.ИдентификаторУстройства,
		ОписаниеОшибки
	);
	
	Если СписокОборудования.Количество()>0 Тогда
		//Состояние(НСтр("ru='Выполняется загрузка данных из ККМ Офлайн'"));
		
		ВходныеПараметры  = Новый Массив;
		ВыходныеПараметры = Неопределено;
		
		ИмяКоманды = "ЗагрузитьДанные";
		
		РезультатВыполнения = НачатьВыполнениеКоманды(Параметры.ИдентификаторУстройства, ИмяКоманды, ВходныеПараметры);
		РезультатВыполнения = НачатьЗагрузкуДанныхИзККМЗавершение(РезультатВыполнения, Параметры);
		
	Иначе
		ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка.
									|%ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
		
		Если Параметры.ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		//Если Параметры.СледующееОповещение <> Неопределено Тогда
			РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства", Ложь, ТекстСообщения, Параметры.ИдентификаторУстройства);
			//ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатВыполнения);
		//КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция НачатьЗагрузкуДанныхИзККМЗавершение(РезультатКоманды, Параметры) Экспорт
	
	ЕстьОшибки = Ложь;
	
	ВыходныеПараметры = РезультатКоманды.ВыходныеПараметры;
	
	Если РезультатКоманды.Результат Тогда
		
		Контекст = Новый Структура;
		Контекст.Вставить("ИдентификаторУстройства", Параметры.ИдентификаторУстройства);
		Контекст.Вставить("ДанныеИзККМ", РезультатКоманды.ВыходныеПараметры[0]);
		
		РезультатПередачиДанных = МенеджерОфлайнОборудованияВызовСервера.ПередатьДанныеЗагрузки(Контекст);
		
		Если РезультатПередачиДанных.Успешно Тогда
			
			ВходныеПараметры = Неопределено;
			
			//ОписаниеОповещения = Новый ОписаниеОповещения("НачатьЗагрузкуДанныхИзККМПослеУстановкиФлагаОбработанности", ЭтотОбъект, Параметры);
			РезультатВыполнения = НачатьВыполнениеКоманды(Параметры.ИдентификаторУстройства, "УстановитьФлагДанныеЗагружены", ВходныеПараметры);
			НачатьЗагрузкуДанныхИзККМПослеУстановкиФлагаОбработанности(РезультатВыполнения, Параметры);
			
		Иначе
			
			ВыходныеПараметры = Новый Массив;
			ЕстьОшибки = Истина;
			СоздатьСообщениеОбОшибке(ВыходныеПараметры, РезультатПередачиДанных.СообщениеОбОшибке);
		КонецЕсли;
		
	Иначе
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		
		РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Ложь, ВыходныеПараметры);
		
		//ОписаниеОповещения = Новый ОписаниеОповещения("НачатьЗагрузкуДанныхИзККМПослеУстановкиФлагаОбработанности", ЭтотОбъект, Параметры);
		//ВыполнитьОбработкуОповещения(ОписаниеОповещения, РезультатВыполнения);
		НачатьЗагрузкуДанныхИзККМПослеУстановкиФлагаОбработанности(РезультатВыполнения, Параметры);
		
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

Процедура НачатьЗагрузкуДанныхИзККМПослеУстановкиФлагаОбработанности(РезультатКоманды, Параметры) Экспорт
	
	Если РезультатКоманды.Результат Тогда
		ТекстСообщения = НСтр("ru='Данные загружены успешно'");
	Иначе
		ТекстСообщения = РезультатКоманды.ВыходныеПараметры[1];
	КонецЕсли;
	
	//Если Параметры.СледующееОповещение <> Неопределено Тогда
	//	
	//	РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(
	//		РезультатКоманды.Результат,
	//		ТекстСообщения,
	//		Параметры.ИдентификаторУстройства
	//	);
	//	
	//	//ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатВыполнения);
	//Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//КонецЕсли;
	
	ОтключитьОборудованиеПоИдентификатору(Параметры.ИдентификаторУстройства);
	
КонецПроцедуры

#КонецОбласти

// Процедура добавляет в массив выходных параметров сообщение об ошибке.
//		Параметры:
//			- ВыходныеПараметры - массив, в который будет помещено сообщение об ошибке.
//			- ТекстСообщения - текст сообщения, содержащий информация об ошибке.
Процедура СоздатьСообщениеОбОшибке(ВыходныеПараметры, ТекстСообщения)
	
	ВыходныеПараметры.Добавить(999);
	ВыходныеПараметры.Добавить(ТекстСообщения);
	
КонецПроцедуры

// Очищает товары в ККМ Offline.
//
Процедура НачатьОчисткуТоваровВККМOffline(ИдентификаторУстройства = Неопределено, ОтображатьСообщения = Истина)
	
	Контекст = Новый Структура;
	//Контекст.Вставить("СледующееОповещение"     , ОповещениеПриОчисткеДанные);
	//Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ОтображатьСообщения"     , ОтображатьСообщения);
	
	Если ИдентификаторУстройства = Неопределено Тогда
		//RadV добавить сообщение об ошибке
		//ОписаниеОповещения = Новый ОписаниеОповещения("НачатьОчисткуТоваровВККМOfflineЗавершение", ЭтотОбъект, Контекст);
		//МенеджерОборудованияКлиент.ПредложитьВыбратьУстройство(ОписаниеОповещения, "ККМОфлайн",
			//НСтр("ru='Выберите ККМ Offline'"), 
			//НСтр("ru='ККМ Offline не подключены.'"),
			//НСтр("ru='ККМ Offline не не выбрано.'"), 
			//НЕ ОтображатьСообщения);
	Иначе
		НачатьОчисткуТоваровВККМOfflineЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

Функция НачатьОчисткуТоваровВККМOfflineЗавершение(ИдентификаторУстройства, Параметры) Экспорт
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Оборудование не выбрано.'");
		//Если Параметры.СледующееОповещение <> Неопределено Тогда
			РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства", Ложь, ТекстСообщения, Неопределено);
			//ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатВыполнения);
		//КонецЕсли;
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
//#Если ВебКлиент Тогда
	//ОписаниеОповещения = Новый ОписаниеОповещения("НачатьОчисткуТоваровВККМOfflineФайловоеРасширениеЗавершение", ЭтотОбъект, Параметры);
	//ПроверитьДоступностьРасширенияРаботыСФайлами(ОписаниеОповещения, Ложь);
//#Иначе
	// В тонком и толстом клиентах расширение подключено всегда.
	НачатьОчисткуТоваровВККМOfflineФайловоеРасширениеЗавершение(Истина, Параметры);
//#КонецЕсли
	
КонецФункции

Функция НачатьОчисткуТоваровВККМOfflineФайловоеРасширениеЗавершение(Подключено, Параметры) Экспорт
	
	Если Не Подключено Тогда
		ТекстСообщения = НСтр("ru='Данная операция не доступна без установленного расширения для веб-клиента ""1С:Предприятие"".'");
		Если Параметры.ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		//Если Параметры.СледующееОповещение <> Неопределено Тогда
			РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства", Ложь, ТекстСообщения, Параметры.ИдентификаторУстройства);
			//ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатВыполнения);
		//КонецЕсли;
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ОписаниеОшибки = "";
	ВремРасширеннаяВыгрузка = Ложь;
	ПоддержкаАсинхронногоРежима = Ложь;
	
	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;
	ВремРасширеннаяВыгрузка = ВыполнитьКомандуОбработчикаДрайвера("РасширеннаяВыгрузка", ВходныеПараметры, ВыходныеПараметры, Параметры.ИдентификаторУстройства, Неопределено, ПоддержкаАсинхронногоРежима);
	
	Результат = ПодключитьОборудованиеПоИдентификатору(Параметры.ИдентификаторУстройства, ОписаниеОшибки);
	
	Если Результат Тогда
		
		//Состояние(НСтр("ru='Выполняется очистка товаров в ККМ Offline...'"));
		
		ВходныеПараметры  = Неопределено;
		ВыходныеПараметры = Неопределено;
		
		Если ПоддержкаАсинхронногоРежима Тогда
			//ОписаниеОповещения = Новый ОписаниеОповещения("НачатьОчисткуТоваровВККМOfflineВыполнитьКомандуЗавершение", ЭтотОбъект, Параметры);
			РезультатВыполнения = НачатьВыполнениеКоманды(Параметры.ИдентификаторУстройства, "ОчиститьБазу", ВходныеПараметры);
			НачатьОчисткуТоваровВККМOfflineВыполнитьКомандуЗавершение(РезультатВыполнения, Параметры);
		Иначе
			РезультатКоманды = НачатьВыполнениеКоманды(Параметры.ИдентификаторУстройства, "ОчиститьБазу", ВходныеПараметры);
			Если НЕ РезультатКоманды.Результат Тогда
				ТекстСообщения = НСтр("ru='При очистке данных в оборудование произошла ошибка.
										  |%ОписаниеОшибки%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатКоманды.ВыходныеПараметры[1]);
			Иначе
				ТекстСообщения = НСтр("ru='Очистка данных успешно завершена.'");
			КонецЕсли;
			
			//Если Параметры.СледующееОповещение <> Неопределено Тогда
				РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства", Результат, ТекстСообщения, Параметры.ИдентификаторУстройства);
				//ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатВыполнения);
			//Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			//КонецЕсли;
			
			ОтключитьОборудованиеПоИдентификатору(Параметры.ИдентификаторУстройства);
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка.
									|%ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
		
		Если Параметры.ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		//Если Параметры.СледующееОповещение <> Неопределено Тогда
			РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства", Ложь, ТекстСообщения, Параметры.ИдентификаторУстройства);
			//ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатВыполнения);
		//КонецЕсли;
	КонецЕсли;
	
КонецФункции

Процедура НачатьОчисткуТоваровВККМOfflineВыполнитьКомандуЗавершение(РезультатКоманды, Параметры) Экспорт
	
	//Если НЕ РезультатКоманды.Результат Тогда
	//	ТекстСообщения = НСтр("ru='При очистке данных в оборудование произошла ошибка.
	//							|%ОписаниеОшибки%'");
	//	ОписаниеОшибки = ?(РезультатКоманды.ВыходныеПараметры.Количество() > 1, РезультатКоманды.ВыходныеПараметры[1], "");
	//	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
	//Иначе
	//	ТекстСообщения = НСтр("ru='Очистка данных успешно завершена.'");
	//КонецЕсли;
	//
	//Если Параметры.СледующееОповещение <> Неопределено Тогда
	//	РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства", РезультатКоманды.Результат, ТекстСообщения, Параметры.ИдентификаторУстройства);
	//	ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатВыполнения);
	//Иначе
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//КонецЕсли;
	//
	//ОтключитьОборудованиеПоИдентификатору(Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройства);

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыРаботыСФайлами

// Процедура получения содержания текстовых файлов.
// Параметры:
//  ИменаФайлов  - Строка или Массив - имя файла или массив с именами файлов.
//  ОписаниеОповещенияПриЗавершении  - ОписаниеОповещения - вызывается после завершения чтения файлов.
//  Кодировка - КодировкаТекста - кодировка при чтении текстового файла, по умолчанию КодировкаТекста.UTF8.
//
Процедура ПолучитьСодержаниеТекстовыхФайлов(ИменаФайлов, РезультатЧтенияФайлов, Кодировка = Неопределено) Экспорт
	
	ПомещаемыеФайлы = Новый Массив;
	
	Если Кодировка = Неопределено Тогда
		Кодировка = КодировкаТекста.UTF8;
	КонецЕсли;
	
	Если ТипЗнч(ИменаФайлов) = Тип("Строка") Тогда
		ОписаниеФайла = Новый ОписаниеПередаваемогоФайла(ИменаФайлов);
		ПомещаемыеФайлы.Добавить(ОписаниеФайла);
	ИначеЕсли ТипЗнч(ИменаФайлов) = Тип("Массив") Тогда
		Если ИменаФайлов.Количество() = 0 Тогда
			РезультатЧтенияФайлов = Новый Структура;
			РезультатЧтенияФайлов.Вставить("СодержаниеФайлов", Новый Массив);
			РезультатЧтенияФайлов.Вставить("Успешно", Истина);
			РезультатЧтенияФайлов.Вставить("ТекстОшибки","");
			//ВыполнитьОбработкуОповещения(ОписаниеОповещенияПриЗавершении, РезультатЧтенияФайлов);
			Возврат;
		Иначе
			Для Каждого ИмяФайла Из ИменаФайлов Цикл
				ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ИмяФайла));
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Содержание = Новый Массив;
	РезультатЧтенияФайлов = Новый Структура;
	РезультатЧтенияФайлов.Вставить("СодержаниеФайлов", Неопределено);
	РезультатЧтенияФайлов.Вставить("Успешно", Ложь);
	РезультатЧтенияФайлов.Вставить("ТекстОшибки", "");
	
	Для Каждого Файл Из ПомещаемыеФайлы Цикл
		
		СтруктураСодержанияФайла = Новый Структура;
		
		Попытка
			ЧтениеТекста = Новый ЧтениеТекста(Файл.Имя, Кодировка);
			ТекстСодержания = ЧтениеТекста.Прочитать();
		Исключение
			
			ТекстСообщения =  НСтр("ru = 'При чтении файла %ИмяФайла% произошла ошибка'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяФайла%", ИмяФайла);
			
			РезультатЧтенияФайлов.ТекстОшибки = ТекстСообщения + Символы.ПС + ОписаниеОшибки();
			//ВыполнитьОбработкуОповещения(ОписаниеОповещенияПриЗавершении, РезультатЧтенияФайлов);
			Возврат;
			
		КонецПопытки;
		
		СтруктураСодержанияФайла.Вставить("ОписаниеПереданногоФайла", Файл);
		СтруктураСодержанияФайла.Вставить("ТекстСодержания",          ТекстСодержания);
		
		Содержание.Добавить(СтруктураСодержанияФайла);
		ЧтениеТекста.Закрыть();
		
	КонецЦикла;
	
	РезультатЧтенияФайлов.Успешно = Истина;
	РезультатЧтенияФайлов.СодержаниеФайлов = Содержание;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПодключениеОборудованияСинхронноУстарели

// Подключает одиночный экземпляр устройства определяемый идентификатором.
//
Функция ПодключитьОборудованиеПоИдентификатору(ИдентификаторУстройства, ОписаниеОшибки = "") Экспорт
	
	Возврат ПодключитьОборудование(, ИдентификаторУстройства, ОписаниеОшибки);
	
КонецФункции

// Функция подключает устройства по типу оборудования.
// Возвращает результат выполнения функции.
//
Функция ПодключитьОборудование(ТипыПО = Неопределено, ИдентификаторУстройства = Неопределено, ОписаниеОшибки = "") Экспорт
	
	Возврат МенеджерОфлайнОборудованияСерверПовтИсп.ПодключитьОборудование(ТипыПО, ИдентификаторУстройства, ОписаниеОшибки);
	
КонецФункции

// Отключает устройство, определенное идентификатором.
//
Функция ОтключитьОборудованиеПоИдентификатору(ИдентификаторУстройства, ОписаниеОшибки = "") Экспорт
	
	Возврат ОтключитьОборудование(, ИдентификаторУстройства, ОписаниеОшибки);
	
КонецФункции

// Функция подключает устройства по типу оборудования.
// 
Функция ОтключитьОборудование(ТипыПО = Неопределено, ИдентификаторУстройства = Неопределено, ОписаниеОшибки = "") Экспорт
	
	КонечныйРезультат = Истина;
	//Результат         = Истина;
	//
	//ВыходноеОписаниеОшибки = "";
	//
	////Если глПодключаемоеОборудование.ПараметрыПодключенияПО <> Неопределено Тогда
	//	//КоличествоУстройств = глПодключаемоеОборудование.ПараметрыПодключенияПО.Количество();
	//	//Для Индекс = 1 По КоличествоУстройств Цикл
	//	//	
	//	//	ПодключенноеУстройство = глПодключаемоеОборудование.ПараметрыПодключенияПО[КоличествоУстройств - Индекс];
	//	//	КлиентПодключения = ПодключенноеУстройство.Клиенты.Найти(ИдентификаторКлиента);
	//	//	
	//	//	Если КлиентПодключения <> Неопределено  И (ТипыПО = Неопределено Или ТипыПО.Найти(ПодключенноеУстройство.ТипОборудованияИмя) <> Неопределено)
	//	//	   И (ИдентификаторУстройства = Неопределено  Или ПодключенноеУстройство.Ссылка = ИдентификаторУстройства)Тогда
	//	//		 
	//	//		 Если ПодключенноеУстройство.КоличествоПодключенных = 1 Тогда
	//				 
	//				//Если ПодключенноеУстройство.ОбъектДрайвера = Неопределено Тогда
	//				//	// Сообщить об ошибке, что не удалось загрузить драйвер.
	//				//	ОписаниеОшибки = НСтр("ru='""%Наименование%"": Не удалось загрузить драйвер устройства.
	//				//								|Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
	//				//	ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", ПодключенноеУстройство.Наименование);
	//				//	КонечныйРезультат = Ложь;
	//				//	Продолжить;
	//				//КонецЕсли;
	//				
	//				ОбработчикДрайвераМодуль = ПодключенноеУстройство.ОбработчикДрайвераМодуль;
	//				#Если ВебКлиент Тогда
	//				// Принудительно заменяем асинхронный обработчик на синхронный, так как работам в синхронном режиме.
	//				Если ОбработчикДрайвераМодуль = ПодключаемоеОборудованиеУниверсальныйДрайверАсинхронноКлиент Тогда
	//					ОбработчикДрайвераМодуль = ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
	//				КонецЕсли;
	//				#КонецЕсли
	//				
	//				ВыходныеПараметры = Неопределено;
	//				Результат = ОбработчикДрайвераМодуль.ОтключитьУстройство(ПодключенноеУстройство.ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения, ВыходныеПараметры);
	//				Если НЕ Результат Тогда
	//					ОписаниеОшибки = ОписаниеОшибки + ?(ПустаяСтрока(ОписаниеОшибки), "", Символы.ПС)
	//								   + НСтр("ru='При отключении устройства ""%Наименование%"" произошла ошибка: %ОписаниеОшибки% (%КодОшибки%)'");
	//					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", ПодключенноеУстройство.Наименование);
	//					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
	//					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%КодОшибки%", ВыходныеПараметры[0]);
	//				//Иначе
	//				//	ПодключенноеУстройство.КоличествоПодключенных = 0;
	//				КонецЕсли;
	//				
	//				//НомерСтрокиМассива = глПодключаемоеОборудование.ПараметрыПодключенияПО.Найти(ПодключенноеУстройство);
	//				//Если НомерСтрокиМассива <> Неопределено Тогда
	//				//	глПодключаемоеОборудование.ПараметрыПодключенияПО.Удалить(НомерСтрокиМассива);
	//				//КонецЕсли;
	//			//Иначе
	//			//	ПодключенноеУстройство.КоличествоПодключенных = ПодключенноеУстройство.КоличествоПодключенных - 1;
	//			//	ПодключенноеУстройство.Клиенты.Удалить(КлиентПодключения);
	//			//КонецЕсли;
	//		//КонецЕсли;
	//		
	//		КонечныйРезультат = КонечныйРезультат И Результат;
	//	//КонецЦикла;
	////КонецЕсли;
	
	Возврат КонечныйРезультат;
	
КонецФункции  

#КонецОбласти