// Модуль менеджера документа "Транспортные операции ВетИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Обмены

Функция ОбработатьОтветНаЗапросВозможностиПеревозкиПартииВРамкахРегионализации(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, ПараметрыОбмена, ДополнительныеПараметры) Экспорт
	
	НовыйСтатус   = Неопределено;
	ОбъектИзменен = Ложь;
	НастройкаПодключения = ПараметрыОбмена.НастройкиПодключения.Получить(ХозяйствующийСубъект);
	
	Если ДанныеДокумента.Объект = Неопределено Тогда
		Списокr13nRouteSection = Неопределено;
	Иначе
		Списокr13nRouteSection = ДанныеДокумента.Объект.r13nRouteSection;
	КонецЕсли;
	
	Если (НЕ Списокr13nRouteSection = Неопределено) И Списокr13nRouteSection.Количество()>0 Тогда
		
		ПерезаписатьДокумент = Ложь;
		
		СсылкаНаОбъект = ДанныеДокумента.Документ;
		ДокументОбъект = СсылкаНаОбъект.ПолучитьОбъект();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ТранспортныеОперацииВЕТИС.ИдентификаторСтроки,
		|	СкладскойЖурналВЕТИС.ВидПродукции КАК ВидПродукции,
		|	СкладскойЖурналВЕТИС.ВидПродукции.Код КАК КодВидаПродукции
		|ИЗ
		|	Документ.ТранспортныеОперацииВЕТИС.Партии КАК ТранспортныеОперацииВЕТИС
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.СкладскойЖурналВЕТИС КАК СкладскойЖурналВЕТИС
		|ПО
		|	ТранспортныеОперацииВЕТИС.Идентификатор = СкладскойЖурналВЕТИС.Идентификатор
		|ГДЕ
		|	ТранспортныеОперацииВЕТИС.Ссылка = &Ссылка
		|";
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		ТаблицаВидовПродукции = Запрос.Выполнить().Выгрузить();
		
		ДокументОбъект.УсловияПеремещенияПродукции.Очистить();
		УсловияПеремещенияПродукции = ДокументОбъект.УсловияПеремещенияПродукции.Выгрузить();
		
		СтатусРазрешения = "0";
		Для Каждого УсловиеПеремещения Из Списокr13nRouteSection Цикл
			
			СписокappliedR13nRule = УсловиеПеремещения.appliedR13nRule;
			
			Для Каждого ТекущееПраво Из СписокappliedR13nRule Цикл
				
				СтатусРазрешения = Макс(СтатусРазрешения, ТекущееПраво.decision);
				
				Если НЕ ТекущееПраво.decision = "2" Тогда
					Продолжить;
				КонецЕсли;
				
				Списокrequirement = ТекущееПраво.requirement;
				Для Каждого Строкаrequirement ИЗ Списокrequirement Цикл
					
					Заболевание = ИнтеграцияВЕТИС.ЗагрузитьЗаболевание(НастройкаПодключения,, Строкаrequirement.relatedDisease);
					
					ТекНомерБлока = 1;
					СписокconditionGroup = Строкаrequirement.conditionGroup;
					Для Каждого СтрокаconditionGroup Из СписокconditionGroup Цикл
						Списокcondition = СтрокаconditionGroup.condition;
						Для Каждого Строкаcondition Из Списокcondition Цикл
							СтрокаУсловия = УсловияПеремещенияПродукции.Добавить();
							СтрокаУсловия.Заболевание        = Заболевание;
							СтрокаУсловия.НомерБлока         = ТекНомерБлока;
							СтрокаУсловия.УсловиеПеремещения = ИнтеграцияВЕТИС.ЗагрузитьУсловиеРегионализации(НастройкаПодключения,, Строкаcondition);
							ТекНомерБлока = ТекНомерБлока + 1;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
				
				СписокВидовПродукции = ТекущееПраво.cargoType;
				Для Каждого ТекущийВидПродукции Из СписокВидовПродукции Цикл
					КодВидаПродукции = ТекущийВидПродукции.guid;
					СтруктураПоискаИдентификаторов = Новый Структура("КодВидаПродукции", КодВидаПродукции);
					НайденныеСтроки = ТаблицаВидовПродукции.НайтиСтроки(СтруктураПоискаИдентификаторов);
					Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
						
						Для Каждого СтрокаУсловия ИЗ УсловияПеремещенияПродукции Цикл
							НоваяСтрокаУсловия = ДокументОбъект.УсловияПеремещенияПродукции.Добавить();
							НоваяСтрокаУсловия.ВидПродукции        = ТекущаяСтрока.ВидПродукции;
							НоваяСтрокаУсловия.ВыполняетсяУсловие  = Истина;
							НоваяСтрокаУсловия.Заболевание         = СтрокаУсловия.Заболевание;
							НоваяСтрокаУсловия.НомерБлока          = СтрокаУсловия.НомерБлока;
							НоваяСтрокаУсловия.УсловиеПеремещения  = СтрокаУсловия.УсловиеПеремещения;
							//НоваяСтрокаУсловия.ИдентификаторСтроки = ТекущаяСтрока.ИдентификаторСтроки;
							ПерезаписатьДокумент = Истина;
						КонецЦикла;
						
					КонецЦикла;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если ПерезаписатьДокумент Тогда
			ОбъектИзменен = Истина;
			//ДокументОбъект.УсловияПеремещенияЗагружены = Истина;
			//ДокументОбъект.Статус = Перечисления.СтатусыВСДВЕТИС.Подготавливается;
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать();
			//#Если Клиент Тогда
			//	Оповестить("ОбновитьДанныеФормы");
			//#КонецЕсли
			//Сообщить("В документе <"+Строка(ДокументОбъект)+"> оформлены условия перемещения");
		КонецЕсли;
		
	КонецЕсли;
	
	НовыйСтатус = ОбновитьСтатусПослеПолученияДанных(ДанныеДокумента.Документ, ДанныеДокумента.ВходящаяОперация, ДанныеДокумента.СтатусОбработки);
	
	ТекстОшибки = ИнтеграцияВЕТИС.ТекстОшибкиОбработкиРезультата(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, Истина);
	
	Если ДополнительныеПараметры.ЕстьОшибкиСервиса Тогда
		
		ВозвращаемоеЗначение = Неопределено;
		ДополнительныеПараметры.ЭлементОчереди.ТекстОшибки = ТекстОшибки;
		
	Иначе
		
		ВозвращаемоеЗначение = ИнтеграцияВЕТИСКлиентСервер.СтруктураИзменения();
		ВозвращаемоеЗначение.ХозяйствующийСубъект = ХозяйствующийСубъект;
		ВозвращаемоеЗначение.Предприятие          = Предприятие;
		ВозвращаемоеЗначение.ВидОперации          = ДанныеДокумента.ВходящаяОперация;
		
		ВозвращаемоеЗначение.ТекстОшибки = ИнтеграцияВЕТИС.ТекстОшибкиОбработкиРезультата(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, Истина);
		ВозвращаемоеЗначение.ПодготовленоКПередаче = Ложь;
		ВозвращаемоеЗначение.Передано              = Ложь;
		ВозвращаемоеЗначение.Принято               = Истина;
		ВозвращаемоеЗначение.ЕстьОшибкиСервиса     = ДополнительныеПараметры.ЕстьОшибкиСервиса;
		
		ВозвращаемоеЗначение.ИсходящееСообщение = ДанныеДокумента.ИсходящееСообщение;
		ВозвращаемоеЗначение.ВходящееСообщение  = ДанныеДокумента.ИдентификаторЗаявки;
		
		//ВозвращаемоеЗначение.Объект            = ДанныеДокумента.Документ;
		ВозвращаемоеЗначение.НовыйСтатус       = НовыйСтатус;
		ВозвращаемоеЗначение.ОбъектИзменен     = ОбъектИзменен;
		ВозвращаемоеЗначение.Объект            = ДанныеДокумента.Документ;
		
	КонецЕсли;
	
	//Изменения.Добавить(ВозвращаемоеЗначение);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ОбработатьРезультатЗапросаНаОформлениеТранспортнойПартии(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, ПараметрыОбмена, ДополнительныеПараметры) Экспорт
	
	НовыйСтатус   = Неопределено;
	ОбъектИзменен = Ложь;
	НастройкаПодключения = ПараметрыОбмена.НастройкиПодключения.Получить(ХозяйствующийСубъект);
	
	Если НЕ ДанныеДокумента.Объект = Неопределено Тогда
		
		ПерезаписатьДокумент = Ложь;
		
		СсылкаНаОбъект = ДанныеДокумента.Документ;
		ДокументОбъект = СсылкаНаОбъект.ПолучитьОбъект();
		
		СписокЗаписейЖурнала = ДанныеДокумента.Объект.stockEntry;
		СписокВСД            = ДанныеДокумента.Объект.vetDocument;
		
		НаборЗаписи = РегистрыСведений.СкладскойЖурналВЕТИС.СоздатьНаборЗаписей();
		
		ДатаСинхронизации = ДополнительныеПараметры.ДанныеВыполненияЗаявки.rcvDate;
		
		СписокКЗагрузке = ИнтеграцияВЕТИС.ПолучитьСписокКЗагрузкеСинхронизация(НаборЗаписи, СписокЗаписейЖурнала, ХозяйствующийСубъект, Предприятие, Истина, ДатаСинхронизации);
		
		Для Каждого ТекущаяСтрока Из СписокЗаписейЖурнала Цикл
			НайденнаяЗапись = СписокКЗагрузке.Найти(ТекущаяСтрока.guid, "guid");
			Если НайденнаяЗапись = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ВРег(ТекущаяСтрока.last) = ВРег("false") Тогда
				Продолжить;
			КонецЕсли;
			
			ИнтеграцияВЕТИС.СформироватьЗаписьСкладскогоЖурнала(ПараметрыОбмена, НаборЗаписи, ХозяйствующийСубъект, Предприятие, ТекущаяСтрока,,НайденнаяЗапись.ЕстьЗапись, ДатаСинхронизации);
			
			НайденноеСырье = ДокументОбъект.Партии.НайтиСтроки(Новый Структура("НомерЗаписи", ТекущаяСтрока.entryNumber));
			Для Каждого СтрокаСырья Из НайденноеСырье Цикл
				СтрокаСырья.Списана  = Истина;
				ПерезаписатьДокумент = Истина;
			КонецЦикла;
			
		КонецЦикла;
		
		Для Каждого ТекущаяСтрока Из СписокВСД Цикл
			ВСД = ИнтеграцияВЕТИС.ЗагрузитьВСД(НастройкаПодключения, ХозяйствующийСубъект, Предприятие, ТекущаяСтрока);
			НоваяСтрока = ДокументОбъект.ВСД.Добавить();
			НоваяСтрока.ВСД      = ВСД;
			ПерезаписатьДокумент = Истина;
		КонецЦикла;
		
		Если ПерезаписатьДокумент Тогда
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
	НовыйСтатус = ОбновитьСтатусПослеПолученияДанных(
			ДанныеДокумента.Документ,
			ДанныеДокумента.ВходящаяОперация,
			ДанныеДокумента.СтатусОбработки);
	
	ТекстОшибки = ИнтеграцияВЕТИС.ТекстОшибкиОбработкиРезультата(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, Истина);
	
	Если ДополнительныеПараметры.ЕстьОшибкиСервиса Тогда
		
		ВозвращаемоеЗначение = Неопределено;
		ДополнительныеПараметры.ЭлементОчереди.ТекстОшибки = ТекстОшибки;
		
	Иначе
		
		ВозвращаемоеЗначение = ИнтеграцияВЕТИСКлиентСервер.СтруктураИзменения();
		ВозвращаемоеЗначение.ХозяйствующийСубъект = ХозяйствующийСубъект;
		ВозвращаемоеЗначение.Предприятие          = Предприятие;
		ВозвращаемоеЗначение.ВидОперации          = ДанныеДокумента.ВходящаяОперация;
		
		ВозвращаемоеЗначение.ТекстОшибки = ИнтеграцияВЕТИС.ТекстОшибкиОбработкиРезультата(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, Истина);
		ВозвращаемоеЗначение.ПодготовленоКПередаче = Ложь;
		ВозвращаемоеЗначение.Передано              = Ложь;
		ВозвращаемоеЗначение.Принято               = Истина;
		ВозвращаемоеЗначение.ЕстьОшибкиСервиса     = ДополнительныеПараметры.ЕстьОшибкиСервиса;
		
		ВозвращаемоеЗначение.ИсходящееСообщение = ДанныеДокумента.ИсходящееСообщение;
		ВозвращаемоеЗначение.ВходящееСообщение  = ДанныеДокумента.ИдентификаторЗаявки;
		
		//ВозвращаемоеЗначение.Объект            = ДанныеДокумента.Документ;
		ВозвращаемоеЗначение.НовыйСтатус       = НовыйСтатус;
		ВозвращаемоеЗначение.ОбъектИзменен     = ОбъектИзменен;
		ВозвращаемоеЗначение.Объект            = ДанныеДокумента.Документ;
		
	КонецЕсли;
	
	//Изменения.Добавить(ВозвращаемоеЗначение);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Статус после подготовки к передаче данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ВходящаяТранспортнаяОперацияВЕТИС - Ссылка на документ.
//  Операция - ПеречислениеСсылка.ВидыОперацийВЕТИС - Операция обмена с ВЕТИС.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиВЕТИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 3.
//
Функция СтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидОперации) Экспорт
	
	ПараметрыОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ПараметрыОбновления();
	
	Если ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросНаОформлениеТранспортнойПартии Тогда
		
		ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.КОформлению;
		ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.ОжидайтеЗавершенияОбработки;
		ПараметрыОбновления.ДальнейшееДействие2 = Перечисления.ДальнейшиеДействияВЕТИС.ОтменитеПередачуДанных;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросВозможностиПеревозки Тогда
		
		ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.ЗапросВозможностиПеремещенияКПередаче;
		ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.ОжидайтеЗавершенияОбработки;
		ПараметрыОбновления.ДальнейшееДействие2 = Перечисления.ДальнейшиеДействияВЕТИС.ОтменитеПередачуДанных;
		
	Иначе
		ВызватьИсключение ИнтеграцияВЕТИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидОперации);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Статус после передачи данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ВходящаяТранспортнаяОперацияВЕТИС - Ссылка на документ.
//  Операция - ПеречислениеСсылка.ВидыОперацийВЕТИС - Операция обмена с ВЕТИС.
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийВЕТИС - Статус обработки сообщения.
//  ДополнительныеПараметры - Структура, Неопределено - Дополнительные параметры.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиВЕТИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 3.
//
Функция СтатусПослеПередачиДанных(ДокументСсылка, ВидОперации, СтатусОбработки, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ПараметрыОбновления();
	
	Если СтатусОбработки = Неопределено Тогда
		СтатусОбработки = Перечисления.ВидыСтатусовОбработкиВЕТИС.ЗаявкаПринята;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросНаОформлениеТранспортнойПартии Тогда
		
		ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.Обрабатывается;
		ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.ОжидайтеЗавершенияОбработки;
		
		//СтатусыБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиВЕТИС.ОшибкаПередачи;
		//
		////Если ДополнительныеПараметры <> Неопределено
		////	И ДополнительныеПараметры.ЕстьОшибкиСервиса Тогда
		////	СтатусыБазовыйПроцесс.ОшибкаДействия.Добавить(
		////		Перечисления.ДальнейшиеДействияВЕТИС.ПроверьтеКорректностьДанных);
		////Иначе
		//	СтатусыБазовыйПроцесс.ОшибкаДействия.Добавить(
		//		Перечисления.ДальнейшиеДействияВЕТИС.ПередайтеДанные);
		////КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросВозможностиПеревозки Тогда
		
		ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.ЗапросВозможностиПеремещенияОбрабатывается;
		ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.ОжидайтеЗавершенияОбработки;
		
		//СтатусыБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиВЕТИС.ЗапросВозможностиПеремещенияОшибка;
		//СтатусыБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияВЕТИС.ПроверьтеВозможностьПеремещения);
		
	Иначе
		ВызватьИсключение ИнтеграцияВЕТИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидОперации);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Статус после получения данных из ВЕТИС.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ВходящаяТранспортнаяОперацияВЕТИС - Документ, для которого требуется обновить статус.
//  Операция - ПеречислениеСсылка.ВидыОперацийВЕТИС - Операция обмена с ВЕТИС
//  ДополнительныеПараметры - Структура - см. функцию ИнтеграцияВЕТИС.ПараметрыОбновленияСтатуса().
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиВЕТИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 3.
//
Функция СтатусПослеПолученияДанных(ДокументСсылка, ВидОперации, СтатусОбработки) Экспорт
	
	ПараметрыОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ПараметрыОбновления();
	
	Если ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросВозможностиПеревозкиПартииВРамкахРегионализации Тогда
		
		Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОтклонена 
			Или СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.Ошибка Тогда
			
			ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.ОтклоненВЕТИС;
			ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.ЗапроситеУсловияПеремещения;
			
		ИначеЕсли ДокументСсылка.УсловияПеремещенияПродукции.Количество()>0 Тогда
			
			ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.ЗапросВозможностиПеремещенияПеремещениеРазрешеноСУсловиями;
			ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.ПередайтеДанные;
			
		Иначе
			
			ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.ЗапросВозможностиПеремещенияПеремещениеРазрешено;
			ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.ПередайтеДанные;
			
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросОформленияТранспортнойПартии Тогда
		
		Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОтклонена
			Или СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.Ошибка Тогда
			ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.ОтклоненВЕТИС;
			ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.ПередайтеДанные;
		ИначеЕсли СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаВыполнена ИЛИ 
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаПринята Тогда
			ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.ВСДОформлены;
			ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.НеТребуется;
		КонецЕсли;
	Иначе
		ВызватьИсключение ИнтеграцияВЕТИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидОперации);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Обновить статус после подготовки к передаче данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ВходящаяТранспортнаяОперацияВЕТИС - Ссылка на документ.
//  Операция - ПеречислениеСсылка.ВидыОперацийВЕТИС - Операция обмена с ВЕТИС.
//  ДополнительныеПараметры - Структура - см. функцию ИнтеграцияВЕТИС.ПараметрыОбновленияСтатуса().
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыСтатусовОбработкиВЕТИС - Новый статус.
//
Функция ОбновитьСтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, Операция, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, Операция);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обновить статус после передачи данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ВходящаяТранспортнаяОперацияВЕТИС - Ссылка на документ.
//  Операция - ПеречислениеСсылка.ВидыОперацийВЕТИС - Операция обмена с ВЕТИС.
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения.
//  ДополнительныеПараметры - Структура - см. функцию ИнтеграцияВЕТИС.ПараметрыОбновленияСтатуса().
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыСтатусовОбработкиВЕТИС - Новый статус.
//
Функция ОбновитьСтатусПослеПередачиДанных(ДокументСсылка, Операция, СтатусОбработки, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПередачиДанных(ДокументСсылка, Операция, СтатусОбработки, ДополнительныеПараметры);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обновить статус после получения данных из ВЕТИС.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ВходящаяТранспортнаяОперацияВЕТИС - Документ, для которого требуется обновить статус.
//  Операция - ПеречислениеСсылка.ВидыОперацийВЕТИС - Операция обмена с ВЕТИС.
//  ДополнительныеПараметры - Структура - см. функцию ИнтеграцияВЕТИС.ПараметрыОбновленияСтатуса().
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыСтатусовОбработкиВЕТИС - Новый статус.
//
Функция ОбновитьСтатусПослеПолученияДанных(ДокументСсылка, Операция, СтатусОбработки) Экспорт
	
	ПараметрыОбновления = СтатусПослеПолученияДанных(ДокументСсылка, Операция, СтатусОбработки);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обработчик изменения статуса документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ИсходящаяТранспортнаяОперацияВЕТИС - Документ.
//  ПредыдущийСтатус - ПеречислениеСсылка.СтатусыОбработкиИсходящихТранспортныхОперацийВЕТИС - Предыдущий статус.
//  НовыйСтатус - ПеречислениеСсылка.СтатусыОбработкиИсходящихТранспортныхОперацийВЕТИС - Предыдущий статус.
//  ПараметрыОбновленияСтатуса - Структура - см. функцию ИнтеграцияВЕТИС.ПараметрыОбновленияСтатуса().
//
Процедура ПриИзмененииСтатусаДокумента(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус, ПараметрыОбновленияСтатуса) Экспорт
	
	//ОбновитьДвижения = ИнтеграцияВЕТИС.СтатусТребуетОбновленияДвижений(СтатусыДвиженийРезерв(), ПредыдущийСтатус, НовыйСтатус);
	
	Если ПараметрыОбновленияСтатуса.ОбновлятьДвижения Тогда
		//И ОбновитьДвижения Тогда
		
		//ОбновитьДвиженияЗаписиСкладскогоЖурналаВРезервеВЕТИС(ДокументСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	
	// Производим установку полученных значений в итоговые показатели объекта
	Если НЕ Расширенные Тогда
		Возврат ИтогиОперации;
	КонецЕсли;
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Отправитель");
	ОбязательныеРеквизиты.Добавить("ПредприятиеОтправитель");
	ОбязательныеРеквизиты.Добавить("Получатель");
	ОбязательныеРеквизиты.Добавить("ПредприятиеПолучатель");
	//ОбязательныеРеквизиты.Добавить("НомерТТН");
	//ОбязательныеРеквизиты.Добавить("ДатаТТН");
	//ОбязательныеРеквизиты.Добавить("ТипТТН");
	//ОбязательныеРеквизиты.Добавить("ТранспортноеСредство");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	
	ОбязательныеРеквизиты.Добавить("Товары.БлагополучиеМестности");
	ОбязательныеРеквизиты.Добавить("Товары.НазначениеГруза");
	ОбязательныеРеквизиты.Добавить("Товары.Количество");
	
	ОбязательныеРеквизиты.Добавить("Партии.СпособХранения");
	
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Уникальные поля таблицы
	УникальныеТабличныеЧасти=Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеТабличныеЧасти;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Параметры проверки полей таблицы товаров
	КонтролируемыеРеквизитыТовары = Новый Структура();
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПараметрыДействия=Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	ПараметрыДействия.Вставить("ХозяйствующийСубъект", Объект.Отправитель);
	ПараметрыДействия.Вставить("Предприятие",          Объект.ПредприятиеОтправитель);
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Контрагент".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КонтрагентПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
КонецПроцедуры // КонтрагентПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "Продукция"


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
	"Документ.ТранспортныеОперацииВЕТИС",
	"ПФ_MXL_ВСД",
	НСтр("ru = 'Печать ВСД'"),
	СсылкаНаДокумент);

КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ВСД") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"ПФ_MXL_ВСД",
		НСтр("ru = 'Печать ВСД'"),
		ПечатьВСД(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры // Печать()

Функция ПечатьВСД(МассивОбъектов, ОбъектыПечати)
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТранспортныеОперацииВЕТИС.ПФ_MXL_ВСД");

	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТранспортныеОперацииВЕТИС_Печать_ВСД";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	
	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Для начала настроим макет
		
		//ОбластьШапкаТаблицы = УправлениеПечатьюПлатформа.ПривестиМакетПечатнойФормы(Макет, Документ);
		
		// Вывод заголовка документа
		//ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЕТИСТранспортныеОперацииВСД.ВСД КАК ВСД,
		|	ВЕТИСВСД.Отправитель КАК Грузоотправитель,
		|	ВЕТИСВСД.Получатель КАК ГрузоПолучатель,
		|	ВЕТИСВСД.ПредприятиеПолучатель КАК Предприятиеполучатель,
		|	ВЕТИСВСД.НомерВСД КАК НомерВСД,
		|	ВЕТИСВСД.ДатаВСД КАК ДатаВСД,
		|	ВЕТИСВСД.Статус КАК СтатусВСД,
		|	ВЕТИСВСД.НомерТТН КАК НомерТТН,
		|	ВЕТИСВСД.ДатаТТН КАК ДатаТТН,
		|	ВЕТИСВСД.Количество КАК Количествопродукции,
		|	ВЕТИСВСД.ЕдиницаИзмерения КАК Единицаизмерения,
		|	ВЕТИСВСД.ДатаВыработки КАК Датавыработки,
		|	ВЕТИСВСД.Ссылка.Отправитель.ИНН КАК ГрузоотправительИНН,
		|	ВЕТИСВСД.Ссылка.Получатель.ИНН КАК ГрузополучательИНН,
		|	ВЕТИСВСД.Ссылка.ПредприятиеПолучатель.Адрес КАК Адреспредприятия,
		|	ВЕТИСВСД.Идентификатор КАК Идентификатор
		|ИЗ
		|	Документ.ТранспортныеОперацииВЕТИС.ВСД КАК ВЕТИСТранспортныеОперацииВСД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВСДВЕТИС КАК ВЕТИСВСД
		|		ПО ВЕТИСТранспортныеОперацииВСД.ВСД = ВЕТИСВСД.Ссылка
		|ГДЕ
		|	ВЕТИСТранспортныеОперацииВСД.Ссылка = &Ссылка
		|	И ВЕТИСТранспортныеОперацииВСД.ДатаАннулирования = ДАТАВРЕМЯ(1, 1, 1)";
	
		Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("Этикетка");

		НомерВСтроке = 1;
		Пока Выборка.Следующий() Цикл
			
			//ПутьКСтраницеВСД = ПутьКСерверу + Выборка.Идентификатор;
			
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ОбластьМакета.Параметры.ДатаПечати          = ТекущаяДата();
			ОбластьМакета.Параметры.ТекущийПользователь = ПараметрыСеанса.Пользователь;
			
			ТекстОшибки = "";
			ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(Выборка.Идентификатор, 0, 190, ТекстОшибки);
			Если Не ПустаяСтрока(ТекстОшибки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
			
			КартинкаQRКода = Новый Картинка(ДанныеQRКода);
			//ОбластьМакета.Рисунки.QRКод.Картинка = КартинкаQRКода
			
			ОбластьМакета.Рисунки.Штрихкод.Картинка = КартинкаQRКода;
			
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьМакета, , , НомерСтраницы, , Документ, );
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции // ПечатьВСД()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВопросДаНет(ПараметрыКоманды,"Вопрос",НСтр("ru = 'Несопоставленные строки из таблицы будут удалены. Продолжить?'"),Истина);
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ОчиститьНеСопоставленныеТовары", "ОчиститьНеСопоставленные", "Товары", НСтр("ru = 'Очистить не сопоставленные'"), ПараметрыКоманды,,,,Ложь);
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ЗаполнитьСкладскимиЗапасами", "ЗаполнитьСкладскимиЗапасами", "Партии", НСтр("ru = 'Заполнить складскими запасами'"),,,,,ЛОЖЬ,ИСТИНА);
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()

// Обработчик заполнения документа 
//
Функция ОчиститьНеСопоставленные(Объект, ПараметрыЗаполнения, ПараметрыДействия=Неопределено) Экспорт
	
	МассивДляУдаления = Новый Массив;
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		ПартииСтроки = Объект.Партии.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтроки));
		Если ПартииСтроки.Количество() = 0 Тогда
		//Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ВидПродукции) Тогда
			МассивДляУдаления.Добавить(ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из МассивДляУдаления Цикл
		Объект.Товары.Удалить(ТекущаяСтрока);
	КонецЦикла;
	
КонецФункции // ОчиститьНеСопоставленные()

// Обработчик заполнения документа по складским запасам
Функция ЗаполнитьСкладскимиЗапасами(Объект, ПараметрыЗаполнения, ПараметрыДействия=Неопределено) Экспорт
	
	Если ТипЗнч(Объект.Товары) = Тип("ДанныеФормыКоллекция") Тогда
		ТаблицаПродукции = Объект.Товары.Выгрузить();
	Иначе
		ТаблицаПродукции = Объект.Товары;
	КонецЕсли;
	
	ИнтеграцияВЕТИС.ЗаполнитьСкладскимиЗапасамиИзЖурнала(Объект, Объект.Отправитель, Объект.ПредприятиеОтправитель, ТаблицаПродукции);
	
	Если ЕстьРеквизит(Объект, "Упаковки", "Партии") Тогда
		ТекстПредставления = "";
		Для Каждого Строка Из Объект.Партии Цикл
			МассивУпаковок = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", Строка.ИдентификаторСтрокиПартий));
			Для Каждого ТекущаяУпаковка Из МассивУпаковок Цикл
				ТекстПредставления = ТекстПредставления + ?(ТекстПредставления = "", "", ", ") + СокрЛП(ТекущаяУпаковка.Упаковка);
			КонецЦикла;
			Строка.Упаковки = ТекстПредставления;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции // ЗаполнитьСкладскимиЗапасами()

#КонецЕсли