
#Область ОбработкаСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	ПериодПлана = КонецМесяца(ТекущаяДата());
	ПериодПлана = ПериодПлана + 15 * 86400; 
	ПериодПлана = НачалоМесяца(ПериодПлана);
	
	ОбновитьПланПродажНаСервере();	
	ОбновитьПраваДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеПолейФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПланПродаж_ОбновитьПраваДоступа" Тогда 
		ОбновитьПраваДоступа();
		ОбновитьОтображениеПолейФормы();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура ОбновитьПланПродаж(Команда)
	
	ОбновитьПланПродажНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	ОткрываемыйДокумент = ОпределитьРеквизитВыделеннойСтроки("Документ");
	
	Если ЗначениеЗаполнено(ОткрываемыйДокумент) Тогда 
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Ключ", ОткрываемыйДокумент);
		ОткрытьФорму("Документ.ИТ_УстановкаПланаПродаж_СтаршийМенеджер.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Согласовать(Команда)
	
	СогласуемыйДокумент = ОпределитьРеквизитВыделеннойСтроки("Документ");
	
	Если ЗначениеЗаполнено(СогласуемыйДокумент) Тогда 
		СогласоватьНаСервере(СогласуемыйДокумент);
		Оповестить("ПланПродаж_ОбновитьПраваДоступа");	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НаПодготовку(Команда)
	
	ПодготавливаемыйДокумент = ОпределитьРеквизитВыделеннойСтроки("Документ");
	
	Если ЗначениеЗаполнено(ПодготавливаемыйДокумент) Тогда 
		НаПодготовкуНаСервере(ПодготавливаемыйДокумент);
		Оповестить("ПланПродаж_ОбновитьПраваДоступа");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПланПродаж(Команда)
	
	Если ЗначениеЗаполнено(ПериодПлана) Тогда 
		Статус = ПредопределенноеЗначение("Перечисление.ИТ_СтатусыПлановПродаж.НаПодготовке");
		СформироватьПланПродажНаСервере(Статус);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран период планирования.",, "ПериодПлана");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаСогласование(Команда)
	
	Если ЗначениеЗаполнено(ПериодПлана) Тогда 
		НаСогласованиеНаСервере();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран период планирования.",, "ПериодПлана");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПраваДоступа()
	
	ПраваДоступа				= ИТ_ПланыПродаж.ПолучитьПраваДоступа("Контролер", ДокументОкончательныйПланПродаж.Статус);
	РедактированиеДоступно		= ПраваДоступа.Редактирование;	
	СлужебныеРеквизитыДоступны	= ПраваДоступа.СлужебныеРеквизиты;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеПолейФормы()
	
	Элементы.ДокументОкончательныйПланПродаж.КнопкаВыбора	= СлужебныеРеквизитыДоступны;	
	Элементы.ДокументОкончательныйПланПродаж.ТолькоПросмотр	= Не(СлужебныеРеквизитыДоступны);
	
	Элементы.ФормаНаСогласование.Доступность	= РедактированиеДоступно;
	Элементы.ПланПродажСогласовать.Доступность	= РедактированиеДоступно;
	Элементы.ПланПродажНаПодготовку.Доступность	= РедактированиеДоступно;
	
КонецПроцедуры	

&НаКлиенте
Функция ОпределитьРеквизитВыделеннойСтроки(ИмяРеквизита)
	
	ТекущиеДанные = Элементы.ПланПродаж.ТекущиеДанные;
	ЗначениеРеквизита = Неопределено;
	
	Если ТекущиеДанные = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выделена строка.",, "Объект.ПланПродаж");
	Иначе
		ЗначениеРеквизита = ТекущиеДанные[ИмяРеквизита];
		
		Если Не(ЗначениеЗаполнено(ЗначениеРеквизита)) Тогда 
			ТекстСообщения = СтрШаблон("Не заполнен реквизит %1.", ИмяРеквизита);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.ПланПродаж");
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ЗначениеРеквизита;
	
КонецФункции

&НаСервере
Процедура ОбновитьПланПродажНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ит_ТорговыеТочки_ОтветственныеСрезПоследних.СтМенеджер КАК СтаршийМенеджер,
		|	СУММА(ИТ_ПланПродаж_Месяц.Сумма) КАК ПредварительнаяСумма
		|ПОМЕСТИТЬ ПредварительныеСуммы
		|ИЗ
		|	РегистрСведений.ИТ_ПланПродаж_Месяц КАК ИТ_ПланПродаж_Месяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ит_ТорговыеТочки_Ответственные.СрезПоследних(&ПериодПлана, ) КАК ит_ТорговыеТочки_ОтветственныеСрезПоследних
		|		ПО ИТ_ПланПродаж_Месяц.ТорговаяТочка = ит_ТорговыеТочки_ОтветственныеСрезПоследних.ТорговаяТочка
		|ГДЕ
		|	ИТ_ПланПродаж_Месяц.Период >= НАЧАЛОПЕРИОДА(&ПериодПлана, МЕСЯЦ)
		|	И ИТ_ПланПродаж_Месяц.Период <= КОНЕЦПЕРИОДА(&ПериодПлана, МЕСЯЦ)
		|	И ИТ_ПланПродаж_Месяц.ВидПлана = &ВидПлана
		|
		|СГРУППИРОВАТЬ ПО
		|	ит_ТорговыеТочки_ОтветственныеСрезПоследних.СтМенеджер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.СтаршийМенеджер КАК СтаршийМенеджер,
		|	СУММА(ВЫБОР
		|			КОГДА ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Статус = ЗНАЧЕНИЕ(Перечисление.ИТ_статусыПлановПродаж.Согласован)
		|				ТОГДА ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_1 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_2 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_3 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_4 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_5 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_6 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_7 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_8 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_9 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_10 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_11 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_12 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_13 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_14 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_15 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_16 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_17 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_18 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_19 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_20 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_21 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_22 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_23 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_24 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_25 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_26 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_27 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_28 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_29 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_30 + ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.СуммаДень_31
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОкончательнаяСумма,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.Статус КАК Статус,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка КАК Документ
		|ПОМЕСТИТЬ ОкончательныеСуммы
		|ИЗ
		|	Документ.ИТ_УстановкаПланаПродаж_СтаршийМенеджер.ПланПродаж КАК ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж
		|ГДЕ
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.Проведен
		|	И (ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.ИТ_СтатусыПлановПродаж.НаСогласовании)
		|			ИЛИ ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.ИТ_СтатусыПлановПродаж.Согласован))
		|	И ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.ПериодПлана >= НАЧАЛОПЕРИОДА(&ПериодПлана, МЕСЯЦ)
		|	И ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.ПериодПлана <= КОНЕЦПЕРИОДА(&ПериодПлана, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.СтаршийМенеджер,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка.Статус,
		|	ИТ_УстановкаПланаПродаж_СтаршийМенеджерПланПродаж.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ПредварительныеСуммы.СтаршийМенеджер, ЕСТЬNULL(ОкончательныеСуммы.СтаршийМенеджер, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))) КАК СтаршийМенеджер,
		|	ЕСТЬNULL(ПредварительныеСуммы.ПредварительнаяСумма, 0) КАК ПредварительнаяСумма,
		|	ЕСТЬNULL(ОкончательныеСуммы.ОкончательнаяСумма, 0) КАК ОкончательнаяСумма,
		|	ЕСТЬNULL(ОкончательныеСуммы.Статус, НЕОПРЕДЕЛЕНО) КАК Статус,
		|	ОкончательныеСуммы.Документ КАК Документ
		|ПОМЕСТИТЬ СводнаяТаблица
		|ИЗ
		|	ПредварительныеСуммы КАК ПредварительныеСуммы
		|		ПОЛНОЕ СОЕДИНЕНИЕ ОкончательныеСуммы КАК ОкончательныеСуммы
		|		ПО ПредварительныеСуммы.СтаршийМенеджер = ОкончательныеСуммы.СтаршийМенеджер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СводнаяТаблица.СтаршийМенеджер КАК СтаршийМенеджер,
		|	СводнаяТаблица.ПредварительнаяСумма КАК ПредварительнаяСумма,
		|	СводнаяТаблица.ОкончательнаяСумма КАК ОкончательнаяСумма,
		|	СводнаяТаблица.ОкончательнаяСумма - СводнаяТаблица.ПредварительнаяСумма КАК Отклонение,
		|	СводнаяТаблица.Статус КАК Статус,
		|	СводнаяТаблица.Документ КАК Документ
		|ИЗ
		|	СводнаяТаблица КАК СводнаяТаблица";
	
	Запрос.УстановитьПараметр("ПериодПлана",	ПериодПлана);
	Запрос.УстановитьПараметр("ВидПлана",		Перечисления.ИТ_ВидыПлановПродаж.Предварительный);
	
	РезультатЗапроса	= Запрос.Выполнить();
	ТаблицаДанных		= РезультатЗапроса.Выгрузить();
	
	ПланПродаж.Загрузить(ТаблицаДанных);
	
	ИтогоПредварительнаяСумма	= ПланПродаж.Итог("ПредварительнаяСумма");
	ИтогоОкончательнаяСумма		= ПланПродаж.Итог("ОкончательнаяСумма");
	ИтогоОтклонение				= ПланПродаж.Итог("Отклонение");
	
	ДокументОкончательныйПланПродаж = ПолучитьОкончательныйПланПродаж();
	
КонецПроцедуры

&НаСервере
Процедура СогласоватьНаСервере(ДокументСсылка)
	
	ИТ_ПланыПродаж.УстановитьСтатусДокумента(ДокументСсылка, Перечисления.ИТ_СтатусыПлановПродаж.Согласован);
	ОбновитьПланПродажНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НаПодготовкуНаСервере(ДокументСсылка)
	
	ИТ_ПланыПродаж.УстановитьСтатусДокумента(ДокументСсылка, Перечисления.ИТ_СтатусыПлановПродаж.НаПодготовке);
	ОбновитьПланПродажНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПланПродажНаСервере(Статус)
	
	// Предварительное обновление данных
	Если Не(ЗначениеЗаполнено(ДокументОкончательныйПланПродаж)) Тогда 
		ДокументОкончательныйПланПродаж = ПолучитьОкончательныйПланПродаж();
	КонецЕсли;
		
	Если Не(ЗначениеЗаполнено(ДокументОкончательныйПланПродаж)) Тогда 
		ДокументОбъект		= Документы.ИТ_УстановкаПланаПродаж_Месяц.СоздатьДокумент();
		ДокументПроведен	= Ложь;

		ДокументОбъект.Дата			= ТекущаяДата();
		ДокументОбъект.ПериодПлана	= НачалоМесяца(ПериодПлана);
		ДокументОбъект.ВидПлана		= Перечисления.ИТ_ВидыПлановПродаж.Окончательный;
		ДокументОбъект.Статус		= Статус;
		
		ДокументОбъект.ЗаполнитьПланПродаж();
		ИТ_ЛогированиеСервер.ЗаписатьПровестиДокумент(ДокументОбъект,,,,,,, РежимЗаписиДокумента.Проведение, ДокументПроведен);
		
		Если ДокументПроведен Тогда 
			ДокументОкончательныйПланПродаж = ДокументОбъект.Ссылка;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать документ плана продаж.",, "ДокументОкончательныйПланПродаж");
		КонецЕсли;	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ уже сформирован.",, "ДокументОкончательныйПланПродаж");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура НаСогласованиеНаСервере()
	
	Если ЗначениеЗаполнено(ДокументОкончательныйПланПродаж) Тогда 
		ИТ_ПланыПродаж.УстановитьСтатусДокумента(ДокументОкончательныйПланПродаж, Перечисления.ИТ_СтатусыПлановПродаж.НаСогласовании);
	Иначе
		СформироватьПланПродажНаСервере(Перечисления.ИТ_СтатусыПлановПродаж.НаСогласовании);	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОкончательныйПланПродаж()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИТ_УстановкаПланаПродаж_Месяц.Ссылка КАК Документ
		|ИЗ
		|	Документ.ИТ_УстановкаПланаПродаж_Месяц КАК ИТ_УстановкаПланаПродаж_Месяц
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ИТ_УстановкаПланаПродаж_Месяц.ПериодПлана, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ПериодПлана, МЕСЯЦ)
		|	И ИТ_УстановкаПланаПродаж_Месяц.ВидПлана = &ВидПлана
		|	И НЕ ИТ_УстановкаПланаПродаж_Месяц.ПометкаУдаления
		|	И ИТ_УстановкаПланаПродаж_Месяц.Проведен";
	
	Запрос.УстановитьПараметр("ПериодПлана",	ПериодПлана);
	Запрос.УстановитьПараметр("ВидПлана",		Перечисления.ИТ_ВидыПлановПродаж.Окончательный);
	
	Результат	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Документ;
	Иначе
		Возврат Документы.ИТ_УстановкаПланаПродаж_Месяц.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции

#КонецОбласти




