
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресЗапроса = "http://localhost";
	ИдентификаторРесторана = "";//рестОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.рестСистемыИнтеграции.ЯндексЕда(), "ИдентификаторСистемы");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьШаблонКоманды();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ТипКомандыПриИзменении(Элемент)
	
	ЗаполнитьШаблонКоманды();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	ВызовМетода();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьШаблонКоманды()
	
	МетодЗапроса = "";
	ТелоЗапроса = "";
	HTTPМетод = "";
	Если ТипКоманды = 0 Тогда
		
		МетодЗапроса = "/ping";
		HTTPМетод = "GET";
		
	ИначеЕсли ТипКоманды = 1 Тогда
		МетодЗапроса = "/security/oauth/token";
		ТелоЗапроса = СтрШаблон("client_id=%1&client_secret=%2", Новый УникальныйИдентификатор, Новый УникальныйИдентификатор);
		HTTPМетод = "POST";
	ИначеЕсли ТипКоманды = 2 Тогда
		МетодЗапроса = СтрШаблон("/menu/%1/composition", ИдентификаторРесторана);
		HTTPМетод = "GET";
	ИначеЕсли ТипКоманды = 3 Тогда
		МетодЗапроса = СтрШаблон("/menu/%1/availability", ИдентификаторРесторана);
		HTTPМетод = "GET";
	ИначеЕсли ТипКоманды = 4 Тогда
		МетодЗапроса = СтрШаблон("/menu/%1/promos", ИдентификаторРесторана);
		HTTPМетод = "GET";
	ИначеЕсли ТипКоманды = 5 Тогда
		МетодЗапроса = "/order";
		HTTPМетод = "POST";
		ТелоЗапроса = СтрШаблон(ТекстЗапросаДобавленияИзмененияЗаказа(), ИдентификаторРесторана);
	ИначеЕсли ТипКоманды = 6 Тогда
		МетодЗапроса = "/order/{orderId}";
		HTTPМетод = "PUT";
		ТелоЗапроса = СтрШаблон(ТекстЗапросаДобавленияИзмененияЗаказа(), ИдентификаторРесторана);
	ИначеЕсли ТипКоманды = 7 Тогда
		МетодЗапроса = "/order/{orderId}";
		ТелоЗапроса = ТекстЗапросаОтменитьЗаказ();
		HTTPМетод = "DELETE";
	ИначеЕсли ТипКоманды = 8 Тогда
		МетодЗапроса = "/order/{orderId}/status";
		HTTPМетод = "GET";
	ИначеЕсли ТипКоманды = 9 Тогда
		МетодЗапроса = "/images/{typeId}/{elemId}/{prodimageId}";
		HTTPМетод = "GET";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВызовМетода(ДополнительныеЗаголовки = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(АдресЗапроса) ИЛИ НЕ ЗначениеЗаполнено(МетодЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	АдресAPI = ОбщегоНазначенияКлиентСервер.СтруктураURI(СтрШаблон("%1/hs/eda.yandex%2", АдресЗапроса, МетодЗапроса));
	
	ИнтернетПрокси = ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси(АдресAPI.Схема);
	
	HTTPСоединение = Новый HTTPСоединение(
		АдресAPI.Хост,
		АдресAPI.Порт,АдресAPI.Логин,АдресAPI.Пароль,
		ИнтернетПрокси,
		2000,
		);
	
	ЗапросHTTP = Новый HTTPЗапрос;
	ЗапросHTTP.АдресРесурса = АдресAPI.ПутьНаСервере;
	ЗапросHTTP.Заголовки["Content-Type"] = "application/x-www-form-urlencoded";
	
	Если ТипЗнч(ДополнительныеЗаголовки) = Тип("Соответствие") Тогда
		Для Каждого ДопЗаголовок Из ДополнительныеЗаголовки Цикл
			ЗапросHTTP.Заголовки[ДопЗаголовок.Ключ] = ДопЗаголовок.Значение;
		КонецЦикла;
	КонецЕсли;
	
	Если ТелоЗапроса <> Неопределено Тогда
		ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса,, ИспользованиеByteOrderMark.НеИспользовать);
	КонецЕсли;
	
	Если HTTPМетод = Неопределено Тогда
		ОтветHTTP = HTTPСоединение.Получить(ЗапросHTTP);
	Иначе
		ОтветHTTP = HTTPСоединение.ВызватьHTTPМетод(HTTPМетод, ЗапросHTTP);
	КонецЕсли;
	
	КодРезультата = ОтветHTTP.КодСостояния;
	РезультатЗапроса = ОтветHTTP.ПолучитьТелоКакСтроку();
	
КонецПроцедуры

&НаКлиенте
Функция ТекстЗапросаДобавленияИзмененияЗаказа()
	Результат = "
	|{
	|  ""discriminator"": ""marketplace""
	|  ""eatsId"": ""190330-123456"",
	|  ""restaurantId"": ""%1"",
	|  ""updateDate"": ""1937-01-01T12:00:27.87+00:20"",
	|  ""creationDate"": ""1937-01-01T12:00:27.87+00:20"",
	|  ""deliveryInfo"": {
	|    ""clientName"": ""Иванов Иван Иванович"",
	|    ""phoneNumber"": ""+79031111111 добавочный 4432"",
	|    ""deliveryDate"": ""1937-01-01T12:00:27.87+00:20"",
	|    ""deliveryAddress"": {
	|      ""full"": ""Москва, улица Тверская, дом 1 строение 4, подъезд 2. 4-й этаж, код домофона: 123 К 4567"",
	|      ""latitude"": ""55.756994"",
	|      ""longitude"": ""37.614006""
	|    }
	|  },
	|  ""paymentInfo"": {
	|    ""paymentType"": ""CARD"",
	|    ""itemsCost"": 100,
	|    ""deliveryFee"": 100,
	|    ""total"": 200,
	|    ""change"": 100
	|  },
	|  ""items"": [
	|    {
	|      ""id"": ""937c57f6-4508-4858-be7f-20691a16fbb0"",
	|      ""name"": ""Пицца Пепперони"",
	|      ""quantity"": 3,
	|      ""price"": 100,
	|      ""modifications"": [
	|        {
	|          ""id"": ""937c57f6-4508-4858-be7f-20691a16fbb0"",
	|          ""name"": ""Европейские приборы"",
	|          ""quantity"": 3,
	|          ""price"": 100
	|        }
	|      ]
	|    }
	|  ],
	|  ""promos"": [
	|  ],
	|  ""persons"": 2,
	|  ""comment"": ""Дополнительная информация о заказе: ..."",
	|  ""status"": {
	|    ""status"": ""NEW"",
	|    ""comment"": null,
	|    ""updatedAt"": ""1937-01-01T12:00:27.87+00:20""
	|  }
	|}";
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ТекстЗапросаОтменитьЗаказ()
	Результат = "
	|{
	|  ""eatsId"": ""190330-123456"",
	|  ""comment"": ""Отказ клиента""
	|}";
	Возврат Результат;
КонецФункции

#КонецОбласти
