
Процедура ВыполнитьПриход(ТаблицаДвижений, Движения) Экспорт
	
	Движения.бит_ЯндексЕдаВзаиморасчеты.Записывать = Истина;
	Для Каждого ТекСтрока Из ТаблицаДвижений Цикл
		Движение = Движения.бит_ЯндексЕдаВзаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрока);		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьРасход(ТаблицаДвижений, Движения) Экспорт
	
	Движения.бит_ЯндексЕдаВзаиморасчеты.Записывать = Истина;
	Для Каждого ТекСтрока Из ТаблицаДвижений Цикл
		Движение = Движения.бит_ЯндексЕдаВзаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрока);		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьПриходИлиРасход(ТаблицаДвижений, Движения) Экспорт
	
	Движения.бит_ЯндексЕдаВзаиморасчеты.Записывать = Истина;
	Для Каждого ТекСтрока Из ТаблицаДвижений Цикл
		Движение = Движения.бит_ЯндексЕдаВзаиморасчеты.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрока);
		Если Движение.Сумма < 0 Тогда 
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Сумма = - Движение.Сумма;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодготовитьТаблицуДвижений(ТаблицаДвижений, Регистратор) Экспорт
	
	ТаблицаДвижений = Новый ТаблицаЗначений;
	ТаблицаДвижений.Колонки.Добавить("Регистратор");
	ТаблицаДвижений.Колонки.Добавить("Период");
	ТаблицаДвижений.Колонки.Добавить("ЗаказПокупателя");
	ТаблицаДвижений.Колонки.Добавить("Сумма");
	
	Если ТипЗнч(Регистратор) = Тип("ДокументОбъект.РеализацияТоваров") Тогда
		
		СтрТД = ТаблицаДвижений.Добавить();
		СтрТД.Регистратор = Регистратор.Ссылка;
		СтрТД.Период = Регистратор.Дата;
		СтрТД.ЗаказПокупателя = Регистратор.ДокументОснование;
		СтрТД.Сумма = Регистратор.СуммаДокумента;
		
	ИначеЕсли ТипЗнч(Регистратор) = Тип("ДокументОбъект.бит_ЯндексЕдаОтчетОПродажах")
		ИЛИ ТипЗнч(Регистратор) = Тип("ДокументОбъект.бит_ЯндексЕдаКорректировкаОтчетаОПродажах") Тогда
		
		Для Каждого СтрокаЗаказа Из Регистратор.Заказы Цикл
			СтрТД = ТаблицаДвижений.Добавить();
			СтрТД.Регистратор = Регистратор.Ссылка;
			СтрТД.Период = Регистратор.Дата;
			СтрТД.ЗаказПокупателя = СтрокаЗаказа.ЗаказПокупателя;
			СтрТД.Сумма = СтрокаЗаказа.Сумма;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры