////////////////////////////////////////////////////////////////////////////////
// Подсистема "Печать".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция КомандыПечатиФормы(ИмяФормы, СписокОбъектов = Неопределено) Экспорт
	Возврат УправлениеПечатью.КомандыПечатиФормы(ИмяФормы, СписокОбъектов);
КонецФункции

// +РАРУС Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Функция ОбъектыСКомандамиПечати() Экспорт
	
	СписокОбъектов = Новый Массив;
	
	КомандыПечати = УправлениеПечатью.СоздатьКоллекциюКомандПечати();
	
	КлассыОбъектов = Новый Структура;
	КлассыОбъектов.Вставить("Справочники",             Справочники);
	КлассыОбъектов.Вставить("Документы",               Документы);
	КлассыОбъектов.Вставить("ПланыВидовХарактеристик", ПланыВидовХарактеристик);
	КлассыОбъектов.Вставить("ПланыСчетов",             ПланыСчетов);
	КлассыОбъектов.Вставить("ПланыВидовРасчета",       ПланыВидовРасчета);
	
	Для каждого КлассОбъекта Из КлассыОбъектов Цикл
		Для каждого ОбъектМетаданных Из Метаданные[КлассОбъекта.Ключ] Цикл
			Попытка
				КомандыПечати.Очистить();
				МенеджерПечати = КлассОбъекта.Значение[ОбъектМетаданных.Имя];
				МенеджерПечати.ДобавитьКомандыПечати(КомандыПечати);
			Исключение
				ПричинаОшибки();
				Продолжить;
			КонецПопытки;
			СписокОбъектов.Добавить(МенеджерПечати);
		КонецЦикла;
	КонецЦикла;
	
	Возврат СписокОбъектов;
	
КонецФункции // ОбъектыСКомандамиПечати() // -РАРУС

#КонецОбласти


