// Модуль документа "Чек"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Чек"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Чек(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Определяем хоз.операцию нового документа
	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.Чек Тогда
		ХозОперация	= Справочники.ХозОперации.ЧекНаВозврат;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Для каждого СтрокаТабличнойЧасти Из Оплаты Цикл
			СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Сумма - СтрокаТабличнойЧасти.Сдача;
			СтрокаТабличнойЧасти.Сдача = 0;
		КонецЦикла;
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Чек()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

Процедура ОбработкаПроведенияНакопленияПоКарточкамКонтрагентов()
	
	Если НЕ ЗначениеЗаполнено(Карточка) ИЛИ НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧекТовары.Ссылка.Контрагент,
	|	ЧекТовары.Ссылка.Карточка,
	|	ЧекТовары.Ссылка.Дата       КАК ПериодНакопления,
	|	СУММА(ЧекТовары.Количество) КАК КоличествоНоменклатуры,
	|	СУММА(ЧекТовары.СуммаВсего) КАК Сумма,
	|	СУММА(0) КАК КоличествоЧеков
	|ИЗ
	|	Документ.Чек.Товары КАК ЧекТовары
	|ГДЕ
	|	ЧекТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧекТовары.Ссылка.Дата,
	|	ЧекТовары.Ссылка.Карточка,
	|	ЧекТовары.Ссылка.Контрагент";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	НаборНакоплениеСумм = Движения.НакопленияПоКарточкамКонтрагентов;
	НаборНакоплениеСумм.ДокументСсылка   = Ссылка;
	НаборНакоплениеСумм.РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	НаборНакоплениеСумм.ВыполнитьДвижения();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Процедура - обработчик ввода на основании
// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения = Неопределено, ТекстЗаполнения = "", СтандартнаяОбработка = Истина)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если (НЕ СкладКомпании.Пустая()) И (НЕ СкладКомпании.Розничный) Тогда
		СкладКомпании = Неопределено;
	КонецЕсли;
	
	Архивный = ЛОЖЬ;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	Архивный = ЛОЖЬ;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	// Чеки, попавшие в архив повторно проверять не следует
	Если Архивный Тогда
		Возврат;
	КонецЕсли;
	
	Если СуммаДокумента<0 Тогда
		ВывестиСообщение(НСтр("ru = 'Сумма к оплате не должна быть отрицательной'"),, "СуммаДокумента",,Отказ);
	КонецЕсли;
	
	// Проводим инициализацию основных 
	СуммаДокумента = Товары.Итог("СуммаВсего");
	ОплатыВсего = Оплаты.Итог("Сумма");
	ОплатыСдача = Оплаты.Итог("Сдача");
	ОплатыНалом = 0;
	ОплатыТалон = 0;
	ОплатыБезнал= 0;
	СтрокаТалон = Неопределено;
	
	// Выполним проверку корректности заполнения реквизит таблицы оплат
	Для Каждого ТекОплата Из Оплаты Цикл
		Если ТекОплата.ТипОплаты.ВидОплаты = Перечисления.ВидыОплат.Наличные Тогда
			ОплатыНалом = ОплатыНалом + ТекОплата.Сумма - ТекОплата.Сдача;
		Иначе
			ОплатыБезнал = ОплатыБезнал + ТекОплата.Сумма - ТекОплата.Сдача;// в данном случае не сдача, а "сгоревший" остаток талон
		КонецЕсли;
		
		Если ТекОплата.ТипОплаты.ВидОплаты = Перечисления.ВидыОплат.Безналичные Тогда
			//Если НЕ ЗначениеЗаполнено(ТекОплата.ТипПлатежнойКарты) Тогда
			//	ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Таблица <Оплаты> значение колонки <Тип платежной карты> не заполнено. Строка номер <%1>'"),СокрЛП(ТекОплата.НомерСтроки));
			//	ВывестиСообщение(ТекстОшибки, ЭтотОбъект,,ТекОплата.НомерСтроки, Отказ);
			//КонецЕсли;
			
		ИначеЕсли ТекОплата.ТипОплаты.ВидОплаты=Перечисления.ВидыОплат.Кредит Тогда
			Если НЕ ЗначениеЗаполнено(ТекОплата.Контрагент) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Таблица <Оплаты> значение колонки <Контрагент> не заполнено. Строка номер <%1>'"),СокрЛП(ТекОплата.НомерСтроки));
				ВывестиСообщение(ТекстОшибки, ЭтотОбъект,,ТекОплата.НомерСтроки, Отказ);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ТекОплата.ДоговорВзаиморасчетов) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Таблица <Оплаты> значение колонки <Договор> не заполнено. Строка номер <%1>'"),СокрЛП(ТекОплата.НомерСтроки));
				ВывестиСообщение(ТекстОшибки, ЭтотОбъект,,ТекОплата.НомерСтроки, Отказ);
			КонецЕсли;
			Если НЕ ТекОплата.ДоговорВзаиморасчетов.ВидДоговора=Перечисления.ВидыДоговоров.Кредит Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Таблица <Оплаты> вид договора оплаты не соответствует типу оплаты. Строка номер <%1>'"),СокрЛП(ТекОплата.НомерСтроки));
				ВывестиСообщение(ТекстОшибки, ЭтотОбъект,,ТекОплата.НомерСтроки, Отказ);
			КонецЕсли;
			
		ИначеЕсли ТекОплата.ТипОплаты.ВидОплаты = Перечисления.ВидыОплат.Талон Тогда
			Если НЕ ЗначениеЗаполнено(ТекОплата.Контрагент) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Таблица <Оплаты> значение колонки <Контрагент> не заполнено. Строка номер <%1>'"),СокрЛП(ТекОплата.НомерСтроки));
				ВывестиСообщение(ТекстОшибки, ЭтотОбъект,,ТекОплата.НомерСтроки, Отказ);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ТекОплата.ДоговорВзаиморасчетов) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Таблица <Оплаты> значение колонки <Договор> не заполнено. Строка номер <%1>'"),СокрЛП(ТекОплата.НомерСтроки));
				ВывестиСообщение(ТекстОшибки, ЭтотОбъект,,ТекОплата.НомерСтроки, Отказ);
			КонецЕсли;
			Если НЕ ТекОплата.Карточка.ВидКарточки=Перечисления.ВидыКарточек.Талон Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Таблица <Оплаты> вид карточки не соответствует типу оплаты. Строка номер <%1>'"),СокрЛП(ТекОплата.НомерСтроки));
				ВывестиСообщение(ТекстОшибки, ЭтотОбъект,,ТекОплата.НомерСтроки, Отказ);
			КонецЕсли;
			ОплатыТалон = ОплатыТалон + ТекОплата.Сумма;
			СтрокаТалон = ТекОплата;
			
		ИначеЕсли ТекОплата.ТипОплаты.ВидОплаты=Перечисления.ВидыОплат.КлубнаяКарта Тогда
			Если НЕ ТекОплата.Карточка.ВидКарточки=Перечисления.ВидыКарточек.КлубнаяКарта Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Таблица <Оплаты> вид карточки не соответствует типу оплаты. Строка номер <%1>'"),СокрЛП(ТекОплата.НомерСтроки));
				ВывестиСообщение(ТекстОшибки, ЭтотОбъект,,ТекОплата.НомерСтроки, Отказ);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ТекОплата.Контрагент) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Таблица <Оплаты> значение колонки <Контрагент> не заполнено. Строка номер <%1>'"),СокрЛП(ТекОплата.НомерСтроки));
				ВывестиСообщение(ТекстОшибки, ЭтотОбъект,,ТекОплата.НомерСтроки, Отказ);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ТекОплата.ДоговорВзаиморасчетов) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Таблица <Оплаты> значение колонки <Договор> не заполнено. Строка номер <%1>'"),СокрЛП(ТекОплата.НомерСтроки));
				ВывестиСообщение(ТекстОшибки, ЭтотОбъект,,ТекОплата.НомерСтроки, Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Проводим контроль сумм оплат
	КонтролироватьЗаполнениеОплат = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеСвойства, "КонтролироватьЗаполнениеОплат", ИСТИНА);
	
	Если (ХозОперация = Справочники.ХозОперации.ЧекОтложенный) ИЛИ (НЕ КонтролироватьЗаполнениеОплат) Тогда
		// Проверку корректности сумм оплат производить сейчас не нужно
		
	ИначеЕсли СуммаДокумента > ОплатыВсего И НЕ ПравоПользователя("ПогашатьЧекЦеликом") Тогда
		ВывестиСообщение(НСтр("ru='Общая сумма оплат не может быть менее суммы документа.'"), ЭтотОбъект,,, Отказ);
		
	ИначеЕсли СуммаДокумента < ОплатыВсего Тогда
		// Определим причину превышения оплаты
		Если ОплатыВсего = ОплатыТалон Тогда
			Если (ОплатыВсего-СуммаДокумента) >= СтрокаТалон.Карточка.Номинал Тогда
				ВывестиСообщение(НСтр("ru='Сумма оплаты талонами, превышает необходимую.'"), ЭтотОбъект,,, Отказ);
			КонецЕсли;
			
		ИначеЕсли (ОплатыВсего = ОплатыБезнал) Тогда
			ВывестиСообщение(НСтр("ru='Сумма безналичной оплаты не может превышать сумму документа.'"), ЭтотОбъект,,, Отказ);
			
		ИначеЕсли (ОплатыБезнал >= СуммаДокумента) И (ОплатыНалом > 0) Тогда
			ВывестиСообщение(НСтр("ru='Сумма безналичной оплаты полностью закрывает сумму чека. Оплата наличными не допустима.'"), ЭтотОбъект,, Отказ);
			
		ИначеЕсли (ОплатыВсего - СуммаДокумента) > ОплатыСдача Тогда
			ВывестиСообщение(НСтр("ru='Общая сумма оплат не может быть больше суммы к оплате.'"), ЭтотОбъект,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	// !!!_view Проверку остатков вынести из данного события!??!
	
	ПроверитьОстатки = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеСвойства, "ПроверитьОстатки", ИСТИНА);
	Если ПроверитьОстатки И ХозОперация = Справочники.ХозОперации.Чек И ПравоПользователя("РазрешитьОтрицательныеСкладскиеОстатки", ЭтотОбъект) = Перечисления.ВидыРазрешенныхОтрицательныхОстатков.Запрещены Тогда
		
		ТаблицаБезХарактеристик 	= Товары.ВыгрузитьКолонки("МестоРазмещения, Номенклатура");
		ПустаяХарактеристика 		= Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		МассивРежимовСписания 		= Новый Массив;
		МассивРежимовСписания.Добавить(Перечисления.РежимыАвтоСписанияХарактеристик.РучноеСписание);
		МассивРежимовСписания.Добавить(Перечисления.РежимыАвтоСписанияХарактеристик.ПустаяСсылка());
		
		МассивСкладов       		= Новый Массив;
		МассивТоваров       		= Новый Массив;
		МассивХарактеристик 		= Новый Массив;
		МассивСкладовАвтоСписание 	= Новый Массив;
		МассивТоваровАвтоСписание	= Новый Массив;
		
		Для Каждого ТекЭлемент Из Товары Цикл
			Если ТекЭлемент.ХарактеристикаНоменклатуры = ПустаяХарактеристика
				И МассивРежимовСписания.Найти(ТекЭлемент.Номенклатура.ТипНоменклатуры.АвтоСписаниеХарактеристик) = Неопределено Тогда
				Если МассивТоваровАвтоСписание.Найти(ТекЭлемент.Номенклатура) = Неопределено Тогда
					МассивТоваровАвтоСписание.Добавить(ТекЭлемент.Номенклатура);
				КонецЕсли;
				Если МассивСкладовАвтоСписание.Найти(ТекЭлемент.МестоРазмещения) = Неопределено Тогда
					МассивСкладовАвтоСписание.Добавить(ТекЭлемент.МестоРазмещения);
				КонецЕсли;
			Иначе
				Если МассивТоваров.Найти(ТекЭлемент.Номенклатура) = Неопределено Тогда
					МассивТоваров.Добавить(ТекЭлемент.Номенклатура);
				КонецЕсли;
				Если МассивСкладов.Найти(ТекЭлемент.МестоРазмещения) = Неопределено Тогда
					МассивСкладов.Добавить(ТекЭлемент.МестоРазмещения);
				КонецЕсли;
				Если МассивХарактеристик.Найти(ТекЭлемент.ХарактеристикаНоменклатуры) = Неопределено Тогда
					МассивХарактеристик.Добавить(ТекЭлемент.ХарактеристикаНоменклатуры);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ЕстьАвтоСписаниеХарактеристик = МассивТоваровАвтоСписание.Количество()>0;
		
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВЫБОР
		|		КОГДА ОстаткиТоваровКомпанииОстатки.КоличествоОстаток ЕСТЬ NULL ТОГДА
		|			0
		|		ИНАЧЕ
		|			ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток
		|	КОНЕЦ КАК Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&Момент, СкладКомпании В (&СкладКомпании) И Номенклатура В (&Номенклатура) И ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры)) КАК ОстаткиТоваровКомпанииОстатки" + ?(ЕстьАвтоСписаниеХарактеристик, "
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура,
		|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	ВЫБОР
		|		КОГДА ОстаткиТоваровКомпанииОстатки.КоличествоОстаток ЕСТЬ NULL ТОГДА
		|			0
		|		ИНАЧЕ
		|			ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&Момент, СкладКомпании В (&СкладКомпанииАвтоСписание) И Номенклатура В (&НоменклатураАвтоСписание)) КАК ОстаткиТоваровКомпанииОстатки", "");
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Момент", 					МоментВремени());
		Запрос.УстановитьПараметр("ТаблицаТовары", 				Товары);
		Запрос.УстановитьПараметр("СкладКомпании",              МассивСкладов);
		Запрос.УстановитьПараметр("Номенклатура",               МассивТоваров);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", МассивХарактеристик);
		Запрос.УстановитьПараметр("СкладКомпанииАвтоСписание",  МассивСкладовАвтоСписание);
		Запрос.УстановитьПараметр("НоменклатураАвтоСписание",   МассивТоваровАвтоСписание);
		
		Выборка = Запрос.Выполнить().Выбрать();
		СтруктураОтбора = Новый Структура;
		
		ВидНоменклатурыУслуги = Перечисления.ВидыНоменклатуры.Услуга;
		Для Каждого СтрокаТоваров Из Товары Цикл
			Если СтрокаТоваров.Номенклатура.ВидНоменклатуры = ВидНоменклатурыУслуги Тогда
				Продолжить;
			КонецЕсли;
			Выборка.Сбросить();
			СтруктураОтбора.Вставить("Номенклатура",               СтрокаТоваров.Номенклатура);
			СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры", СтрокаТоваров.ХарактеристикаНоменклатуры);
			СтруктураОтбора.Вставить("СкладКомпании",              СтрокаТоваров.МестоРазмещения);
			Если Выборка.НайтиСледующий(СтруктураОтбора) Тогда
				Остаток = Окр(Выборка.Остаток/СтрокаТоваров.Коэффициент, 3);
			Иначе
				Остаток = 0;
			КонецЕсли;
			Количество = СтрокаТоваров.Количество;
			Если Количество > Остаток Тогда
				// Расход по складу превышает остаток
				Если НЕ ЗначениеЗаполнено(СтрокаТоваров.ХарактеристикаНоменклатуры) Тогда
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='[<%1>] Товар <%2>. Остаток <%3> <%4>.Списывается <%5> <%6>. Превышение <%7> <%8>.'"),
																						СокрЛП(СтрокаТоваров.Номенклатура.Код),
																						СокрЛП(СтрокаТоваров.Номенклатура),
																						СокрЛП(Остаток),
																						СокрЛП(СтрокаТоваров.ЕдиницаИзмерения),
																						СокрЛП(Количество),
																						СокрЛП(СтрокаТоваров.ЕдиницаИзмерения),
																						СокрЛП(Количество-Остаток),
																						СокрЛП(СтрокаТоваров.ЕдиницаИзмерения));
				Иначе
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='[<%1>] Товар <%2> с характеристикой <%3>. Остаток <%4> <%5>.Списывается <%6> <%7>. Превышение <%8> <%9>.'"),
																						СокрЛП(СтрокаТоваров.Номенклатура.Код),
																						СокрЛП(СтрокаТоваров.Номенклатура),
																						СокрЛП(СтрокаТоваров.ХарактеристикаНоменклатуры),
																						СокрЛП(Остаток),
																						СокрЛП(СтрокаТоваров.ЕдиницаИзмерения),
																						СокрЛП(Количество),
																						СокрЛП(СтрокаТоваров.ЕдиницаИзмерения),
																						СокрЛП(Количество-Остаток),
																						СокрЛП(СтрокаТоваров.ЕдиницаИзмерения));
				КонецЕсли;
				ВывестиСообщение(ТекстОшибки, ЭтотОбъект,,, Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Заблокируем проведение чека, если ХО = отложенный чек
	Если ХозОперация=Справочники.ХозОперации.ЧекОтложенный И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Чеки, попавшие в архив движения не выполняют
	Если Архивный Тогда
		ОбработкаУдаленияПроведения(Отказ);
		Возврат;
	КонецЕсли;
	
	// определим способ ведения баланса
	ВедетсяБалансПоПодразделению = БалансВедетсяПоПодразделениям(Дата);
	
	// проведем остатки товаров
	НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	НаборЗаписейОстатки.РежимПроведения=РежимПроведения;
	НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=Неопределено;
	НаборЗаписейОстатки.СкладКомпании=Неопределено;
	НаборЗаписейОстатки.Приходовать=Истина;
	НаборЗаписейОстатки.ПоБазовомуКоличеству=Ложь;
	НаборЗаписейОстатки.Резервировать=Ложь;
	НаборЗаписейОстатки.ИмяРеквизитаЦенаРозничная  = "Цена";
	НаборЗаписейОстатки.ИмяРеквизитаСуммаРозничная = "СуммаВсего";
	НаборЗаписейОстатки.ДвиженияПоРознице=Истина;
	НаборЗаписейОстатки.РазрешитьПереоценку = НЕ (ХозОперация = Справочники.ХозОперации.ЧекНаВозврат);
	НаборЗаписейОстатки.СписыватьРозницуПоОстаткам=Истина;
	Если (ХозОперация=Справочники.ХозОперации.Чек) Тогда
		Отказ=НЕ НаборЗаписейОстатки.Расход() ИЛИ Отказ;
	Иначе
		Отказ=НЕ НаборЗаписейОстатки.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	СуммаОплатыПоКассе =0;
	
	Для Каждого СтрокаОплаты Из Оплаты Цикл
		
		Если СтрокаОплаты.ТипОплаты.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Наличные ИЛИ	СтрокаОплаты.ТипОплаты.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Электронно Тогда
			
			Если (ХозОперация=Справочники.ХозОперации.Чек) Тогда
				СуммаОплатыПоКассе = СуммаОплатыПоКассе+СтрокаОплаты.Сумма-СтрокаОплаты.Сдача;
			Иначе
				СуммаОплатыПоКассе = СуммаОплатыПоКассе-(СтрокаОплаты.Сумма-СтрокаОплаты.Сдача);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Если используем подключаемой оборудование проведем деньги по кассе ККМ
	Если Константы.ИспользоватьПодключаемоеОборудование.Получить() Тогда
		
		НаборЗаписейКассыККМ=Движения.КассыККМ;
		
		Для Каждого СтрокаОплаты Из Оплаты Цикл
			
			НаборЗаписейКассыККМ.ДокументОбъект 	= ЭтотОбъект;
			НаборЗаписейКассыККМ.РежимПроведения 	= РежимПроведения;
			НаборЗаписейКассыККМ.КассаККМ 			= КассаККМ;
			НаборЗаписейКассыККМ.СпособОплаты 		= СтрокаОплаты.ТипОплаты;
			Если (ХозОперация=Справочники.ХозОперации.Чек) Тогда
				НаборЗаписейКассыККМ.Сумма 			= СтрокаОплаты.Сумма-СтрокаОплаты.Сдача;
			Иначе
				НаборЗаписейКассыККМ.Сумма			= -(СтрокаОплаты.Сумма-СтрокаОплаты.Сдача);
			КонецЕсли;
			Отказ=НЕ НаборЗаписейКассыККМ.Приход() ИЛИ Отказ;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// подготовим таблицу движений в разрезе подразделений по взаиморасчетам
	ТаблицаВзаиморасчетов = Новый ТаблицаЗначений();
	ТаблицаВзаиморасчетов.Колонки.Добавить("Сумма");
	ОписаниеТипов=Новый ОписаниеТипов;
	ОписаниеТипов.Типы().Добавить(Тип("СправочникСсылка.ПодразделенияКомпании"));
	ТаблицаВзаиморасчетов.Колонки.Добавить("Подразделение",ОписаниеТипов);
	
	// проведем взаиморасчеты
	Для Каждого СтрокаОплаты Из Оплаты Цикл
		Если (СтрокаОплаты.ТипОплаты.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Предоплата
			ИЛИ СтрокаОплаты.ТипОплаты.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Постоплата)
			И НЕ СтрокаОплаты.ТипОплаты.ВидОплаты = Перечисления.ВидыОплат.ЗаСчетЗаведения Тогда
			
			НаборЗаписейВзаиморасчеты=Движения.ВзаиморасчетыКомпании;
			НаборЗаписейВзаиморасчеты.ДокументОбъект		= ЭтотОбъект;
			НаборЗаписейВзаиморасчеты.РежимПроведения		= РежимПроведения;
			НаборЗаписейВзаиморасчеты.Контрагент			= СтрокаОплаты.Контрагент;
			НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов = СтрокаОплаты.ДоговорВзаиморасчетов;
			Если ЗначениеЗаполнено(ДокументОснование) Тогда
				НаборЗаписейВзаиморасчеты.Сделка=ДокументОснование;
			Иначе
				НаборЗаписейВзаиморасчеты.Сделка = Неопределено;
			КонецЕсли; 
			НаборЗаписейВзаиморасчеты.АвтоЗакрытиеСделок = СтрокаОплаты.АвтоЗакрытиеСделок;
			НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем = Истина;
			Если (ХозОперация=Справочники.ХозОперации.Чек) Тогда
				НаборЗаписейВзаиморасчеты.Сумма = СтрокаОплаты.Сумма-СтрокаОплаты.Сдача;
			Иначе
				НаборЗаписейВзаиморасчеты.Сумма = -(СтрокаОплаты.Сумма-СтрокаОплаты.Сдача);
				НаборЗаписейВзаиморасчеты.ПриходРасход=Ложь;
			КонецЕсли;
			НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц = 0;
			Отказ = НЕ НаборЗаписейВзаиморасчеты.Приход() ИЛИ Отказ;
			
			// доходы и расходы по суммовым разницам
			СуммаДоходаРасходаСуммовыхРазниц=НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
			Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
				НаборЗаписейДиР = Движения.ДоходыИРасходы;
				НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
				// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
				Если ВедетсяБалансПоПодразделению Тогда
					НаборЗаписейДиР.Подразделение = СтрокаОплаты.ДоговорВзаиморасчетов.ПодразделениеКомпании;
				КонецЕсли;
				НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
				НаборЗаписейДиР.ВУпрВалюте = Истина;
				Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
					НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
				Иначе
					НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
				КонецЕсли;
				Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
			КонецЕсли;
			
			СтрокаВзаиморасчетов = ТаблицаВзаиморасчетов.Добавить();
			СтрокаВзаиморасчетов.Подразделение = СтрокаОплаты.ДоговорВзаиморасчетов.ПодразделениеКомпании;
			Если (ХозОперация=Справочники.ХозОперации.Чек) Тогда
				СтрокаВзаиморасчетов.Сумма = СтрокаОплаты.Сумма-СтрокаОплаты.Сдача;
			Иначе
				СтрокаВзаиморасчетов.Сумма = -(СтрокаОплаты.Сумма-СтрокаОплаты.Сдача);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Проведем сумму выручки по доходам и расходам
	
	ТаблицаВзаиморасчетов.Свернуть("Подразделение","Сумма");
	// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
	Если ВедетсяБалансПоПодразделению Тогда
		Для Каждого СтрокаСписания Из ТаблицаВзаиморасчетов Цикл
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.Подразделение=СтрокаСписания.Подразделение;
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.НачислениеДебиторскойЗадолженностиПоТовару;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте=Ложь;
			НаборЗаписейДоходыИРасходы.Доход=СтрокаСписания.Сумма;	
			Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		КонецЦикла;
	Иначе
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.НачислениеДебиторскойЗадолженностиПоТовару;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте=Ложь;
		НаборЗаписейДоходыИРасходы.Доход=ТаблицаВзаиморасчетов.Итог("Сумма");
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	Если СуммаОплатыПоКассе<>0 Тогда
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
		// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
		Если ВедетсяБалансПоПодразделению Тогда
			НаборЗаписейДоходыИРасходы.Подразделение=КассаККМ.ПодразделениеКомпании;
		КонецЕсли;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте=(ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.Выручка;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте=Ложь;
		НаборЗаписейДоходыИРасходы.Доход=СуммаОплатыПоКассе;
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ОбработкаПроведенияНакопленияПоКарточкамКонтрагентов();
	КонецЕсли;
		
	// Зафиксируем наличную оплату
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЧекОплаты.Сумма - ЧекОплаты.Сдача КАК СуммаНаличными,
	               |	ЧекОплаты.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	               |	ЧекОплаты.Контрагент КАК Контрагент
	               |ИЗ
	               |	Документ.Чек.Оплаты КАК ЧекОплаты
	               |ГДЕ
	               |	ЧекОплаты.Ссылка = &Ссылка
	               |	И НЕ ЧекОплаты.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	               |	И ЧекОплаты.ТипОплаты.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплат.Наличные)";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);		
	РезультатЗапроса =  Запрос.Выполнить().Выбрать();	
	Пока РезультатЗапроса.Следующий() Цикл	
		НаборЗаписейНаличныеРасчеты=Движения.НаличныеРасчеты;
		НаборЗаписейНаличныеРасчеты.ДокументОбъект 	= ЭтотОбъект;
		НаборЗаписейНаличныеРасчеты.РежимПроведения = РежимПроведения;
		НаборЗаписейНаличныеРасчеты.РежимРасходаСредств = (ХозОперация = Справочники.ХозОперации.ЧекНаВозврат);
		НаборЗаписейНаличныеРасчеты.Контрагент 		= РезультатЗапроса.Контрагент;
		НаборЗаписейНаличныеРасчеты.СуммаНаличными  = РезультатЗапроса.СуммаНаличными;
		НаборЗаписейНаличныеРасчеты.ДоговорВзаиморасчетов = РезультатЗапроса.ДоговорВзаиморасчетов;
		Отказ = НЕ НаборЗаписейНаличныеРасчеты.Приход() ИЛИ Отказ;
	КонецЦикла;
	
	// Возможно расхождение баланса на "копейки" из-за округления. Возникшую разницу
	// необходимо списать на доходы и расходы.
	Отказ = НЕ ОбработкаСобытийДокументаСервер.СписаниеКопейкиПриОкругленииВалютныхСчетов(ЭтотОбъект) ИЛИ Отказ;
	
КонецПроцедуры // ОбработкаПроведения()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли