////////////////////////////////////////////////////////////////////////////////
// Подсистема "Дополнительные отчеты и обработки".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет разделы, в которых доступна команда вызова дополнительных обработок.
//  В Разделы необходимо добавить метаданные тех разделов,
//   в которых размещены команды вызова.
//   Для рабочего стола вместо Метаданных необходимо добавлять.
//   ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола().
//
// Параметры:
//   Разделы - Массив - Разделы, в которых размещены команды вызова дополнительных обработок.
//       * ОбъектМетаданных: Подсистема - Метаданные раздела (подсистемы).
//       * Строка - Для рабочего стола.
//
Процедура ОпределитьРазделыСДополнительнымиОбработками(Разделы) Экспорт
	
	// +РАРУС
	Разделы.Добавить(Метаданные.Подсистемы.Снабжение);
	Разделы.Добавить(Метаданные.Подсистемы.Склад);
	Разделы.Добавить(Метаданные.Подсистемы.Продажи);
	Разделы.Добавить(Метаданные.Подсистемы.Розница);
	Разделы.Добавить(Метаданные.Подсистемы.Маркетинг);
	Разделы.Добавить(Метаданные.Подсистемы.Финансы);
	Разделы.Добавить(Метаданные.Подсистемы.Предприятие);
	Разделы.Добавить(Метаданные.Подсистемы.Администрирование);
	Разделы.Добавить(Метаданные.Подсистемы.УправлениеАссортиментом);
	// -РАРУС
	// ++ ПервыйБит ШиряеваВ
	Разделы.Добавить(Метаданные.Подсистемы.бит_ЯндексЕда);
	// -- ПервыйБит ШиряеваВ
	
КонецПроцедуры

// Определяет разделы, в которых доступна команда вызова дополнительных отчетов.
//
//   В Разделы необходимо добавить метаданные тех разделов, 
//   в которых размещены команды вызова.
//
//   Для рабочего стола вместо Метаданных необходимо добавлять.
//   ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола().
//
// Параметры:
//   Разделы - Массив - Разделы, в которых размещены команды вызова дополнительных отчетов.
//       * ОбъектМетаданных: Подсистема - Метаданные раздела (подсистемы).
//       * Строка - Для рабочего стола.
//
Процедура ОпределитьРазделыСДополнительнымиОтчетами(Разделы) Экспорт
	
	// +РАРУС Совпадают с разделами дополнительных обработок
	ОпределитьРазделыСДополнительнымиОбработками(Разделы);
	// -РАРУС
	
КонецПроцедуры

#КонецОбласти
