// Модуль документа "Назначение скидок строки"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Процедура выполняет общие действия при заполнении на основании всех документов
//
// Параметры: 
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//
Процедура ВыполнитьОбщиеДействияПриЗаполнении(ДанныеЗаполнения, ИмяДокументаОснования = "", ТипЦенЗаполнения = Неопределено)
	
	Если ЗначениеЗаполнено(ПодразделениеКомпании.ТипЦенРеализации) Тогда
		ТипЦен = ПодразделениеКомпании.ТипЦенРеализации;
	Иначе
		ТипЦен = ПравоПользователя("ОсновнойТипЦенПродажи", ЭтотОбъект);
	КонецЕсли;
	
	Скидка           = Справочники.ТипыСкидок.СкидкаНаШтрихкодТовара;
	СпособВычисления = Перечисления.СкидкиСпособВычисления.ФиксированнаяЦена;
	
	ИмяДокумента = ДанныеЗаполнения.Метаданные().Имя;
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДокументаТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ." + ИмяДокумента + ".Товары КАК ТаблицаДокументаТовары
	|ГДЕ
	|	ТаблицаДокументаТовары.Ссылка = &Ссылка
	|";
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Скидки.Добавить();
		НоваяСтрока.Скидка           = Скидка;
		Документы.НазначениеСкидокСтроки.СкидкиСкидкаПриИзменении(ЭтотОбъект, НоваяСтрока);
		НоваяСтрока.Номенклатура     = Выборка.Номенклатура;
		Документы.НазначениеСкидокСтроки.СкидкиНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока);
		НоваяСтрока.Свойство         = ШтрихкодированиеВызовСервера.СформироватьНовыйШтрихкод(Выборка.Номенклатура);
		//НоваяСтрока.ЗначениеСкидки   = ТекущаяСтрока.Цена;
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьОбщиеДействияПриЗаполнени()

// Производит заполнение объекта на основании документа "Поступление товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПоступлениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ДатаНачалаДействия     = ТекущаяДата();
	ДатаОконачанияДействия = КонецДня(ТекущаяДата()+7*(60*60*24));
	
	Скидки.Очистить();
	
	ВыполнитьОбщиеДействияПриЗаполнении(ДанныеЗаполнения);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПоступлениеТоваров()

// Производит заполнение объекта на основании документа "Согласование закупочных цен"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_СогласованиеЗакупочныхЦен(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ДатаНачалаДействия     = ДанныеЗаполнения.ДатаНачалаДействия;
	ДатаОконачанияДействия = КонецДня(ДанныеЗаполнения.СрокДействия);
	
	Скидки.Очистить();
	
	ВыполнитьОбщиеДействияПриЗаполнении(ДанныеЗаполнения);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_СогласованиеЗакупочныхЦен()

// Производит заполнение объекта на основании документа "Изменение цен"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ИзменениеЦен(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ДатаНачалаДействия     = ДанныеЗаполнения.ДатаНачалаДействия;
	ДатаОконачанияДействия = КонецДня(ДанныеЗаполнения.ДатаНачалаДействия+7*(60*60*24));
	
	Скидки.Очистить();
	
	ВыполнитьОбщиеДействияПриЗаполнении(ДанныеЗаполнения);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ИзменениеЦен()

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// Произведем заполнение реквизитов документа
	Если НЕ ЗначениеЗаполнено(ДатаНачалаДействия) Тогда
		ДатаНачалаДействия = Дата;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	// Произведем заполнение реквизитов документа
	ДатаНачалаДействия = ТекущаяДатаСеанса();
	
КонецПроцедуры

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки.
	Для Каждого ТекСтрока Из Скидки Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура)
			И НЕ ЗначениеЗаполнено(ТекСтрока.ТипНоменклатуры)
			И НЕ ЗначениеЗаполнено(ТекСтрока.ЦеноваяГруппа) Тогда
			
			ТекстСообщения = НСтр("ru = 'Таблица <Скидки> значение одной из колонок <Номенклатура>, <Тип номенклатуры> или <Ценовая группа> не заполнено. Строка номер %1.'");
			ВывестиСообщение(ТекстСообщения, Ссылка,,,Отказ,ТекСтрока.НомерСтроки);
			
		ИначеЕсли (НЕ ТекСтрока.Скидка.ЭтоПодарок) И ТекСтрока.ЗначениеСкидки = 0 Тогда
			
			ТекстСообщения = НСтр("ru = 'Таблица <Скидки> значение колонки <Значение скидки> не заполнено. Строка номер %1'");
			ВывестиСообщение(ТекстСообщения, Ссылка,,,Отказ,ТекСтрока.НомерСтроки);
			
		ИначеЕсли ТекСтрока.Скидка.ЭтоПодарок И ТекСтрока.ЗначениеСкидки <>0 Тогда
			
			ТекстСообщения = НСтр("ru = 'Таблица <Скидки> значение колонки <Значение скидки> для подарка должно быть не заполнено. Строка номер %1'");
			ВывестиСообщение(ТекстСообщения, Ссылка,,,Отказ,ТекСтрока.НомерСтроки);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ, РежимЗаписи, РежимПроведения);
	
	// установим идентификатор скидки для каждой строки
	Для Каждого Строка Из Скидки Цикл
		
		Параметры								= Новый Структура();
		Параметры.Вставить("ПодразделениеКомпании", ПодразделениеКомпании);
		Параметры.Вставить("РучнаяСкидка",		Строка.Скидка.РучнаяСкидка);
		Параметры.Вставить("НачВремя",			Строка.НачВремя);
		Параметры.Вставить("КонВремя",			Строка.КонВремя);
		Параметры.Вставить("ДниНедели",			Строка.ДниНедели);
		Параметры.Вставить("ЭтоПодарок",		Строка.Скидка.ЭтоПодарок);
		Параметры.Вставить("ДисконтнаяКарта",	Строка.ДисконтнаяКарта);
		Параметры.Вставить("ОтСуммыНакопленияНаКарте",Строка.СуммаНакопления);
		Параметры.Вставить("ЗалОбслуживания",	Строка.СкладКомпании);
		Параметры.Вставить("Свойство",			Строка.Свойство);
		Параметры.Вставить("ОтСуммыСтроки",		Строка.СуммаСтроки);
		Параметры.Вставить("ОтКоличества",		Строка.Количество);
		Параметры.Вставить("Правило",			Строка.Правило);
		Параметры.Вставить("Скидка",			Строка.Скидка);
		
		Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			
			Параметры.Вставить("Объект", Строка.Номенклатура);
			
		ИначеЕсли ЗначениеЗаполнено(Строка.ТипНоменклатуры) Тогда
			
			Параметры.Вставить("Объект", Строка.ТипНоменклатуры);
			
		Иначе
			
			Параметры.Вставить("Объект", Строка.ЦеноваяГруппа);
			
		КонецЕсли;
		
		Строка.ИдентификаторСкидки = СкидкиНаценкиСервер.ПолучитьИдентификаторСкидкиШапки(Параметры, Строка.ИдентификаторСкидки)
			+ ?(ЗначениеЗаполнено(Строка.ИдентификаторСкидки), 0, Строка.НомерСтроки);
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ,Проведение=Ложь)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	//Мальцев А.Ю. +++
	ВыполнитьПроверкуМРЦ(Отказ);		
	//Мальцев А.Ю. ---		
	
	МассивПодразделений = Подразделения.ВыгрузитьКолонку("ПодразделениеКомпании");
	Если МассивПодразделений.Количество() = 0 Тогда
		МассивПодразделений.Добавить(ПодразделениеКомпании);
	КонецЕсли;
	
	Для Каждого ТекущееПодразделение Из МассивПодразделений Цикл
		// Делаем движения по регистру "СкидкиСтроки"
		НаборЗаписейСкидки = Движения.СкидкиСтроки;
		НаборЗаписейСкидки.ДокументСсылка            = Ссылка;
		НаборЗаписейСкидки.ПодразделениеКомпании     = ТекущееПодразделение;
		НаборЗаписейСкидки.РезультатЗапросаПоСкидкам = Документы.НазначениеСкидокСтроки.ПолучитьТаблицуСкидок(ЭтотОбъект,ТекущееПодразделение);
		
		Если ХозОперация = Справочники.ХозОперации.ОтменаСтрочныхСкидок Тогда
			// Отмена скидки на строку документа
			Отказ = Отказ ИЛИ НаборЗаписейСкидки.ОтменитьСкидки();
		Иначе
			// Установка скидки на строку документа
			Отказ = Отказ ИЛИ НаборЗаписейСкидки.УстановитьСкидки();
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ Отказ Тогда
		НаборЗаписейСкидки.ОбновитьСкидкиВОбборудовании();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения

//Мальцев А.Ю. +++
Процедура ВыполнитьПроверкуМРЦ(Отказ)
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НазначениеСкидокСтроки.ЗначениеСкидки КАК Цена,
	|	НазначениеСкидокСтроки.Номенклатура КАК Номенклатура,
	|	НазначениеСкидокСтроки.Номенклатура.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	НазначениеСкидокСтроки.НомерСтроки КАК НомерСтроки,
	|	НазначениеСкидокСтроки.Скидка.СпособВычисления КАК СпособВычисления
	|ПОМЕСТИТЬ втДанныеДокумента
	|ИЗ
	|	Документ.НазначениеСкидокСтроки.Скидки КАК НазначениеСкидокСтроки
	|ГДЕ
	|	НазначениеСкидокСтроки.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	Номенклатура.ВидАлкогольнойПродукции.Родитель КАК ГруппаГАК,
	|	Номенклатура.ВидАлкогольнойПродукции.Родитель.итНомерГруппыГАК КАК НомерГруппыГАК,
	|	Номенклатура.ВидАлкогольнойПродукции.Родитель.итУдельныйОбъем КАК УдельныйОбъем,
	|	Номенклатура.Крепость КАК Крепость,
	|	Номенклатура.Объем КАК Объем,
	|	Номенклатура.ЕРПМастерКлюч КАК ЕРПМастерКлюч
	|ПОМЕСТИТЬ втНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В
	|			(ВЫБРАТЬ
	|				втДанныеДокумента.Номенклатура КАК Номенклатура
	|			ИЗ
	|				втДанныеДокумента КАК втДанныеДокумента
	|			ГДЕ
	|				втДанныеДокумента.СпособВычисления = &ФиксированнаяЦена)
	|	И Номенклатура.ВидАлкогольнойПродукции <> ЗНАЧЕНИЕ(Справочник.ВидыАлкогольнойПродукции.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итУдельныеРозничныеЦеныСрезПоследних.Группа КАК Группа,
	|	итУдельныеРозничныеЦеныСрезПоследних.Крепость КАК Крепость,
	|	итУдельныеРозничныеЦеныСрезПоследних.УдельнаяЦена КАК УдельнаяЦена
	|ПОМЕСТИТЬ втУдельныеЦены
	|ИЗ
	|	РегистрСведений.итУдельныеРозничныеЦены.СрезПоследних(&Период, ) КАК итУдельныеРозничныеЦеныСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф.Ссылка КАК Группа,
	|	ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф.МинимальныйОбъем КАК МинимальныйОбъем,
	|	ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф.МаксимальныйОбъем КАК МаксимальныйОбъем,
	|	ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф.ОбъемИскл КАК ОбъемИскл
	|ПОМЕСТИТЬ втИключенияОбъемныхКоэфф
	|ИЗ
	|	Справочник.ВидыАлкогольнойПродукции.итИсключенияОбъемныхКоэфф КАК ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНоменклатура.Номенклатура КАК Номенклатура,
	|	втНоменклатура.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	втНоменклатура.ГруппаГАК КАК ГруппаГАК,
	|	втНоменклатура.НомерГруппыГАК КАК НомерГруппыГАК,
	|	втНоменклатура.УдельныйОбъем КАК УдельныйОбъем,
	|	втНоменклатура.Крепость КАК Крепость,
	|	втНоменклатура.Объем КАК Объем,
	|	ЕСТЬNULL(втУдельныеЦены.УдельнаяЦена, 0) КАК УдельнаяЦена,
	|	ЕСТЬNULL(втИключенияОбъемныхКоэфф.ОбъемИскл, 0) КАК ОбъемИскл,
	|	втНоменклатура.ЕРПМастерКлюч КАК ЕРПМастерКлюч
	|ПОМЕСТИТЬ втСгруппированнаяТаблица
	|ИЗ
	|	втНоменклатура КАК втНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втУдельныеЦены КАК втУдельныеЦены
	|		ПО втНоменклатура.ГруппаГАК = втУдельныеЦены.Группа
	|			И втНоменклатура.Крепость = втУдельныеЦены.Крепость
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИключенияОбъемныхКоэфф КАК втИключенияОбъемныхКоэфф
	|		ПО втНоменклатура.Объем > втИключенияОбъемныхКоэфф.МинимальныйОбъем
	|			И втНоменклатура.Объем <= втИключенияОбъемныхКоэфф.МаксимальныйОбъем
	|			И втНоменклатура.ГруппаГАК <= втИключенияОбъемныхКоэфф.Группа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСгруппированнаяТаблица.Номенклатура КАК Номенклатура,
	|	втСгруппированнаяТаблица.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	втСгруппированнаяТаблица.ГруппаГАК КАК ГруппаГАК,
	|	втСгруппированнаяТаблица.НомерГруппыГАК КАК НомерГруппыГАК,
	|	втСгруппированнаяТаблица.УдельныйОбъем КАК УдельныйОбъем,
	|	втСгруппированнаяТаблица.Крепость КАК Крепость,
	|	втСгруппированнаяТаблица.Объем КАК Объем,
	|	втСгруппированнаяТаблица.УдельнаяЦена КАК УдельнаяЦена,
	|	втСгруппированнаяТаблица.ОбъемИскл КАК ОбъемИскл,
	|	ВЫБОР
	|		КОГДА втСгруппированнаяТаблица.УдельныйОбъем = 0
	|			ТОГДА 0
	|		КОГДА втСгруппированнаяТаблица.ОбъемИскл > 0
	|			ТОГДА втСгруппированнаяТаблица.УдельнаяЦена * втСгруппированнаяТаблица.ОбъемИскл / втСгруппированнаяТаблица.УдельныйОбъем
	|		ИНАЧЕ втСгруппированнаяТаблица.УдельнаяЦена * втСгруппированнаяТаблица.Объем / втСгруппированнаяТаблица.УдельныйОбъем
	|	КОНЕЦ КАК МРЦ,
	|	втСгруппированнаяТаблица.ЕРПМастерКлюч КАК ЕРПМастерКлюч
	|ПОМЕСТИТЬ втИтоговая
	|ИЗ
	|	втСгруппированнаяТаблица КАК втСгруппированнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтоговая.Номенклатура КАК Номенклатура,
	|	втИтоговая.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	втИтоговая.ГруппаГАК КАК ГруппаГАК,
	|	втИтоговая.НомерГруппыГАК КАК НомерГруппыГАК,
	|	втИтоговая.УдельныйОбъем КАК УдельныйОбъем,
	|	втИтоговая.Крепость КАК Крепость,
	|	втИтоговая.Объем КАК Объем,
	|	втИтоговая.УдельнаяЦена КАК УдельнаяЦена,
	|	втИтоговая.ОбъемИскл КАК ОбъемИскл,
	|	втИтоговая.МРЦ КАК МРЦ,
	|	втИтоговая.ЕРПМастерКлюч КАК ЕРПМастерКлюч,
	|	втДанныеДокумента.Номенклатура КАК НоменклатураДокумента,
	|	втДанныеДокумента.Цена КАК Цена,
	|	втДанныеДокумента.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	втДанныеДокумента КАК втДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИтоговая КАК втИтоговая
	|		ПО втДанныеДокумента.Номенклатура = втИтоговая.Номенклатура
	|			И (втИтоговая.МРЦ > 0)
	|			И втДанныеДокумента.Цена < втИтоговая.МРЦ
	|ГДЕ
	|	НЕ втИтоговая.Номенклатура ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеДокумента.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	втДанныеДокумента.Номенклатура КАК Номенклатура,
	|	втДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	втДанныеДокумента.СпособВычисления КАК СпособВычисления,
	|	втДанныеДокумента.Цена КАК Цена
	|ИЗ
	|	втДанныеДокумента КАК втДанныеДокумента
	|ГДЕ
	|	втДанныеДокумента.СпособВычисления <> &ФиксированнаяЦена
	|	И втДанныеДокумента.ВидАлкогольнойПродукции <> ЗНАЧЕНИЕ(Справочник.ВидыАлкогольнойПродукции.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ФиксированнаяЦена", Перечисления.СкидкиСпособВычисления.ФиксированнаяЦена);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[6].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строка " + Строка(ВыборкаДетальныеЗаписи.НомерСтроки) + ", позиция " + Строка(ВыборкаДетальныеЗаписи.Номенклатура) + 
														  ". Цена меньше минимальной розничной цены " + Строка(ВыборкаДетальныеЗаписи.МРЦ) + ". Проведение не выполнено.");
	КонецЦикла;
	
	ВыборкаДетальныеЗаписиНеФикс = РезультатыЗапроса[7].Выбрать();
	
	Пока ВыборкаДетальныеЗаписиНеФикс.Следующий() Цикл
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строка " + Строка(ВыборкаДетальныеЗаписиНеФикс.НомерСтроки) + ", позиция " + Строка(ВыборкаДетальныеЗаписиНеФикс.Номенклатура) + 
														  ". Для алкогольной продукции возможна скидка устанавливается только по фиксированным ценам.");
	КонецЦикла;

	Если Отказ Тогда	
		ЗаписьЖурналаРегистрации("Проверка МРЦ", УровеньЖурналаРегистрации.Ошибка,,Ссылка,"Ошибка при проверке МРЦ");
	КонецЕсли;
	
КонецПроцедуры
//Мальцев А.Ю. ---	

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли