
#Область РасчетСумм

&НаСервере
Процедура ЗаполнитьСуммуПоУчетуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ДенежныеСредстваКомпанииОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКомпании.Остатки(&ДатаИнвентаризации, СтруктурнаяЕдиница.ПодразделениеКомпании = &Магазин) КАК ДенежныеСредстваКомпанииОстатки";	
	
	Запрос.УстановитьПараметр("ДатаИнвентаризации", Объект.Дата);
	Запрос.УстановитьПараметр("Магазин", Объект.Магазин);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.СуммаПоУчету = Выборка.СуммаОстаток;
	КонецЦикла;
	
	ВычислитьРезультатИнвентаризации();
КонецПроцедуры

&НаСервере
Процедура ВычислитьРезультатИнвентаризации()
	Объект.РезультатИнвентаризации = Объект.СуммаПоФакту - Объект.СуммаПоУчету;
	
	УправлениеВидимостьюДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуПоУчету(Команда)
	ЗаполнитьСуммуПоУчетуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ДанныеМагазина

Процедура ЗаполнитьДанныеМагазина()
	
	Магазин = Объект.Магазин;
	
	Объект.Магазин_Адрес = ПолучитьАдресМагазина(Магазин);
	Объект.Организация		 = Магазин.Организация;
	ОбновитьМенеджеров(Магазин);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресМагазина(Магазин)
	
	Адрес = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МагазиныКонтактнаяИнформация.Представление
		|ИЗ
		|	Справочник.ПодразделенияКомпании.КонтактнаяИнформация КАК МагазиныКонтактнаяИнформация
		|ГДЕ
		|	МагазиныКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И МагазиныКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресПодразделенияКомпании)
		|	И МагазиныКонтактнаяИнформация.Ссылка = &Магазин";
	
	Запрос.УстановитьПараметр("Магазин", Магазин);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Адрес = СокрЛП(ВыборкаДетальныеЗаписи.Представление);
	КонецЦикла;
	
	Возврат Адрес;

КонецФункции

&НаСервере
Процедура ОбновитьМенеджеров(Магазин = Неопределено)
	
	Если Магазин = Неопределено Тогда 
		ЛинейныйМенеджер = Справочники.Сотрудники.ПустаяСсылка();
		РуководительНаправления = Справочники.Сотрудники.ПустаяСсылка();
	Иначе
		МассивМагазинов = Новый Массив();
		МассивМагазинов.Добавить(Магазин);
	КонецЕсли;	
	
	ПараметрыПостроения	= ИТ_СпециальныйМодульСервер.ПолучитьПараметрыПостроения(,,
		Объект.Дата,,,,
		Истина,
		МассивМагазинов,,,,,,,,,
		Истина);
		
	ДанныеМагазинов = ИТ_СпециальныйМодульСервер.ПолучитьДанныеПоМагазинам(ПараметрыПостроения);	
	
	Для Каждого ДанныеМагазина Из ДанныеМагазинов Цикл 
		ЛинейныйМенеджер = ДанныеМагазина.ЛинейныйМенеджер;
		РуководительНаправления	= ДанныеМагазина.СтаршийМенеджер;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.КоманднаяПанельПодменюПечать);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Объект.Статус = Перечисления.ИТ_СтатусыАкцептования.НеАкцептован;
	КонецЕсли;
	
	ЗаполнитьДанныеМагазина();
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	
	Если Объект.РезультатИнвентаризации < 0 Тогда
		Элементы.ВариантПогашенияНедостачи.Видимость = Истина;
	Иначе
		Элементы.ВариантПогашенияНедостачи.Видимость = Ложь;
		Объект.ВариантПогашенияНедостачи = Перечисления.ИТ_ВариантыПогашенияНедостачи.ПустаяСсылка();
	КонецЕсли;
	
	Если Объект.Статус = Перечисления.ИТ_СтатусыАкцептования.Акцептован Тогда
		Элементы.СуммаПоФакту.ТолькоПросмотр		= Не АкцептированиеРазрешено();
		Элементы.СуммаПоУчету.ТолькоПросмотр		= Не АкцептированиеРазрешено();
		Элементы.Магазин.ТолькоПросмотр				= Не АкцептированиеРазрешено();
		Элементы.Статус.ТолькоПросмотр				= Не АкцептированиеРазрешено();
		Элементы.ЗаполнитьСуммуПоУчету.Доступность	= АкцептированиеРазрешено();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура МагазинПриИзмененииНаСервере()
	
	ЗаполнитьДанныеМагазина();
	
	Если ЗначениеЗаполнено(Объект.Магазин) Тогда
		//АдресМагазина = ПолучитьАдресМагазина(Объект.Магазин);
		ЗаполнитьСуммуПоУчетуНаСервере();
	Иначе
		//АдресМагазина = "";
		
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МагазинПриИзменении(Элемент)
	
	Если Объект.СуммаПоФакту <> 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("При изменении магазина сумма (факт) будет очищена! Продолжить?", Режим);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	МагазинПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПоФактуПриИзменении(Элемент)
	ВычислитьРезультатИнвентаризации();
КонецПроцедуры

&НаКлиенте
Процедура СуммаПоУчетуПриИзменении(Элемент)
	ВычислитьРезультатИнвентаризации();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		ЗаполнитьСуммуПоУчетуНаСервере();
	Иначе
		Объект.СуммаПоУчету = 0;
		Объект.СуммаПоФакту = 0;
		ВычислитьРезультатИнвентаризации();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	Если Не АкцептированиеРазрешено() Тогда
		Если Объект.Статус = ПредопределенноеЗначение("Перечисление.ИТ_СтатусыАкцептования.Акцептован") Тогда
			Объект.Статус = ПредопределенноеЗначение("Перечисление.ИТ_СтатусыАкцептования.НеАкцептован");
			Сообщить("Статус акцептован могут устанавливать только сотрудники КРО!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиВиновные

&НаСервере
Функция ОпределитьДолжностьПродавца(ФизическоеЛицо)
	
	Должность = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ит_Продавцы.Должность
		|ИЗ
		|	Справочник.ит_Продавцы КАК ит_Продавцы
		|ГДЕ
		|	ит_Продавцы.ФизическоеЛицо = &ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Должность = ВыборкаДетальныеЗаписи.Должность;
	КонецЦикла;

	Возврат Должность;
	
КонецФункции

&НаКлиенте
Процедура ВиновныеЛицаПродавецПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВиновныеЛица.ТекущиеДанные;
	
	ТекущаяСтрока.Должность = ОпределитьДолжностьПродавца(ТекущаяСтрока.Продавец);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Печать
&НаКлиенте
//Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
Процедура Подключаемый_ОбработкаКомандыФормы(Команда)
	 
	ОбновитьПовторноИспользуемыеЗначения();
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры


&НаСервере
Функция АкцептированиеРазрешено()
	Возврат РольДоступна("ПолныеПрава") Или РольДоступна("ИТ_УправлениеРезультамиИнвентаризаций");
КонецФункции

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	//ДополнениеКомандПечатиНаСервере(); 
	//ОбновитьПовторноИспользуемыеЗначения();
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

#КонецОбласти

