
#Область СлужебныеПроцедурыИФункции

Функция ВыполнитьСверткуЧеков(КассоваяСмена) Экспорт
	
	НомерСмены = КассоваяСмена.НомерСмены;
	КассаККМ   = КассоваяСмена.КассаККМ;
	
	НачатьТранзакцию();
	
	// Заблокируем сворачиваемые документы по текущей кассе ККМ
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.Чек");
	ЭлементБлокировки.УстановитьЗначение("КассаККМ",   КассаККМ);
	ЭлементБлокировки.УстановитьЗначение("НомерСмены", НомерСмены);
	ЭлементБлокировки.УстановитьЗначение("Архивный",   ЛОЖЬ);
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Чек.Ссылка КАК Чек
	|ИЗ
	|	Документ.Чек КАК Чек
	|ГДЕ
	|	Чек.Архивный = ЛОЖЬ И 
	|	Чек.НомерСмены = &НомерСмены И 
	|	Чек.КассаККМ = &КассаККМ И 
	|	Чек.ДатаФР МЕЖДУ &ДатаОткрытияСмены И &ДатаЗакрытияСмены
	|";
	
	Запрос.УстановитьПараметр("НомерСмены",        НомерСмены);
	Запрос.УстановитьПараметр("КассаККМ",          КассаККМ);
	Запрос.УстановитьПараметр("ДатаОткрытияСмены", КассоваяСмена.ДатаОткрытияСмены);
	Запрос.УстановитьПараметр("ДатаЗакрытияСмены", КассоваяСмена.ДатаПоследнегоДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Чек.ПолучитьОбъект();
		Попытка
			ДокументОбъект.Архивный        = ИСТИНА;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			//ДокументОбъект.ПометкаУдаления = ИСТИНА;
			//ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Исключение
			ОтменитьТранзакцию();
			//ВывестиСообщение(НСтр("ru = 'При установки пометки удаления %1 возникла ошибка. Операция отменена.'"), Объект,,,, ВыборкаПоЧекам.Документ);
			//ПричинаОшибки(ДокументОбъект);
			ВывестиСообщение(НСтр("ru = 'При архивации %1 возникла ошибка. Операция отменена.'"), ДокументОбъект,,,, Выборка.Чек);
			Возврат ЛОЖЬ;
		КонецПопытки;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	// Возвращаем признак успешного завершения операции
	Возврат ИСТИНА;
	
КонецФункции // ВыполнитьСверткуЧеков()

Функция СоздатьЗакрытиеСмены(КассаККМ, Автор, Оборудование, ПараметрыСмены)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗакрытиеСмены.Ссылка
	|ИЗ
	|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	|ГДЕ
	|	ЗакрытиеСмены.НомерСмены     = &НомерСмены И 
	|	ЗакрытиеСмены.КассаККМ       = &КассаККМ И 
	|	ЗакрытиеСмены.Дата           = &ДатаДокумента И 
	|	ЗакрытиеСмены.НомерДокумента = &НомерДокумента
	|";
	
	Запрос.УстановитьПараметр("НомерСмены",     ПараметрыСмены.НомерСмены);
	Запрос.УстановитьПараметр("НомерДокумента", ПараметрыСмены.ИдСмены);
	Запрос.УстановитьПараметр("ДатаДокумента",  ПараметрыСмены.ДатаЗакрытияСмены);
	Запрос.УстановитьПараметр("КассаККМ",       КассаККМ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда		
		КассоваяСмена = Выборка.Ссылка.ПолучитьОбъект();
		КассоваяСмена.Товары.Очистить();
		КассоваяСмена.Оплаты.Очистить();
		КассоваяСмена.Скидки.Очистить();
		КассоваяСмена.Контрагенты.Очистить();
		КассоваяСмена.Возвраты.Очистить();
		КассоваяСмена.ВозвратОплаты.Очистить();
		Возврат КассоваяСмена;
	КонецЕсли;
	
	КассоваяСмена = Документы.ЗакрытиеСмены.СоздатьДокумент();
	КассоваяСмена.НомерСмены     = ПараметрыСмены.НомерСмены;
	КассоваяСмена.НомерДокумента = ПараметрыСмены.ИдСмены;
	КассоваяСмена.КассаККМ       = КассаККМ;
	КассоваяСмена.Дата           = ПараметрыСмены.ДатаЗакрытияСмены;
	КассоваяСмена.ДатаПоследнегоДокумента = ПараметрыСмены.ДатаЗакрытияСмены;
	КассоваяСмена.ДатаОткрытияСмены       = ПараметрыСмены.ДатаОткрытияСмены;
	КассоваяСмена.Автор          = Автор;
	КассоваяСмена.ХозОперация    = Справочники.ХозОперации.ЗакрытиеСмены;
	КассоваяСмена.БлокироватьПерерасчетСкидок = Истина;
	
	КассоваяСмена.Заполнить(Неопределено);
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = Документы.ЗакрытиеСмены.ПолучитьПараметрыДействия(КассоваяСмена);
	ПараметрыДействия.Вставить("ЗапретИзмененияЦен", Истина);
	
	ОсновнойОтдел = Оборудование.ОсновнойОтдел;
	Если ЗначениеЗаполнено(Оборудование.Организация) Тогда
		КассоваяСмена.Организация = Оборудование.Организация;
	Иначе
		КассоваяСмена.Организация = ОсновнойОтдел.Организация;
	КонецЕсли;
	
	Документы.ЗакрытиеСмены.ОрганизацияПриИзменении(КассоваяСмена, ПараметрыДействия);
	
	Если НЕ КассоваяСмена.ПодразделениеКомпании = ОсновнойОтдел.ПодразделениеКомпании Тогда
		КассоваяСмена.ПодразделениеКомпании = ОсновнойОтдел.ПодразделениеКомпании;
		Документы.ЗакрытиеСмены.ПодразделениеКомпанииПриИзменении(КассоваяСмена, ПараметрыДействия);
	КонецЕсли;
	
	КассоваяСмена.СкладКомпании = ОсновнойОтдел;
	Документы.ЗакрытиеСмены.СкладКомпанииПриИзменении(КассоваяСмена, ПараметрыДействия);
	
	КассоваяСмена.ТипЦен = ОсновнойОтдел.ТипЦенРозничнойТорговли;
	Документы.ЗакрытиеСмены.ТипЦенПриИзменении(КассоваяСмена, ПараметрыДействия);
	
	Если ЗначениеЗаполнено(КассоваяСмена.ТипЦен.ВалютаЦены) И (КассоваяСмена.ТипЦен.ВалютаЦены <> КассоваяСмена.ВалютаДокумента) Тогда
		КассоваяСмена.ВалютаДокумента = КассоваяСмена.ТипЦен.ВалютаЦены;
		Документы.ЗакрытиеСмены.ВалютаДокументаПриИзменении(КассоваяСмена, ПараметрыДействия);
	КонецЕсли;
	
	КассоваяСмена.Товары.Очистить();
	КассоваяСмена.Оплаты.Очистить();
	КассоваяСмена.Скидки.Очистить();
	КассоваяСмена.Контрагенты.Очистить();
	КассоваяСмена.Возвраты.Очистить();
	КассоваяСмена.ВозвратОплаты.Очистить();
	
	Возврат КассоваяСмена;
	
КонецФункции

Функция СоздатьЗакрытиеСменыДляИнкассации(КассаККМ, Автор, Оборудование, ПараметрыСмены, Организация, ПодразделениеКомпании, ОсновнойОтдел, ТипЦенРозничнойТорговли, ВалютаДокумента);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗакрытиеСмены.Ссылка
	|ИЗ
	|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	|ГДЕ
	|	ЗакрытиеСмены.НомерСмены     = &НомерСмены И 
	|	ЗакрытиеСмены.КассаККМ       = &КассаККМ И 
	|	ЗакрытиеСмены.Дата           = &ДатаДокумента И 
	|	ЗакрытиеСмены.НомерДокумента = &НомерДокумента
	|";
	
	Запрос.УстановитьПараметр("НомерСмены",     ПараметрыСмены.НомерСмены);
	Запрос.УстановитьПараметр("НомерДокумента", ПараметрыСмены.ИдСмены);
	Запрос.УстановитьПараметр("ДатаДокумента",  ПараметрыСмены.ДатаЗакрытияСмены);
	Запрос.УстановитьПараметр("КассаККМ",       КассаККМ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КассоваяСмена = Выборка.Ссылка;
		Возврат КассоваяСмена;
	КонецЕсли;
	
	КассоваяСмена = Документы.ЗакрытиеСмены.СоздатьДокумент();
	КассоваяСмена.НомерСмены     = ПараметрыСмены.НомерСмены;
	КассоваяСмена.НомерДокумента = ПараметрыСмены.ИдСмены;
	КассоваяСмена.КассаККМ       = КассаККМ;
	КассоваяСмена.Дата           = ПараметрыСмены.ДатаЗакрытияСмены;
	КассоваяСмена.ДатаПоследнегоДокумента = ПараметрыСмены.ДатаЗакрытияСмены;
	КассоваяСмена.ДатаОткрытияСмены       = ПараметрыСмены.ДатаОткрытияСмены;
	КассоваяСмена.Автор          = Автор;
	КассоваяСмена.ХозОперация    = Справочники.ХозОперации.ЗакрытиеСмены;
	КассоваяСмена.БлокироватьПерерасчетСкидок = Истина;
	
	КассоваяСмена.Заполнить(Неопределено);
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = Документы.ЗакрытиеСмены.ПолучитьПараметрыДействия(КассоваяСмена);
	ПараметрыДействия.Вставить("ЗапретИзмененияЦен", Истина);
	
	КассоваяСмена.Организация = Организация;
	
	Документы.ЗакрытиеСмены.ОрганизацияПриИзменении(КассоваяСмена, ПараметрыДействия);
	
	Если НЕ КассоваяСмена.ПодразделениеКомпании = ПодразделениеКомпании Тогда
		КассоваяСмена.ПодразделениеКомпании = ПодразделениеКомпании;
		Документы.ЗакрытиеСмены.ПодразделениеКомпанииПриИзменении(КассоваяСмена, ПараметрыДействия);
	КонецЕсли;
	
	КассоваяСмена.СкладКомпании = ОсновнойОтдел;
	Документы.ЗакрытиеСмены.СкладКомпанииПриИзменении(КассоваяСмена, ПараметрыДействия);
	
	КассоваяСмена.ТипЦен = ТипЦенРозничнойТорговли;
	Документы.ЗакрытиеСмены.ТипЦенПриИзменении(КассоваяСмена, ПараметрыДействия);
	
	Если ЗначениеЗаполнено(ВалютаДокумента) И (ВалютаДокумента <> КассоваяСмена.ВалютаДокумента) Тогда
		КассоваяСмена.ВалютаДокумента = ВалютаДокумента;
		Документы.ЗакрытиеСмены.ВалютаДокументаПриИзменении(КассоваяСмена, ПараметрыДействия);
	КонецЕсли;
	
	КассоваяСмена.Товары.Очистить();
	КассоваяСмена.Оплаты.Очистить();
	КассоваяСмена.Скидки.Очистить();
	КассоваяСмена.Контрагенты.Очистить();
	КассоваяСмена.Возвраты.Очистить();
	КассоваяСмена.ВозвратОплаты.Очистить();
	Попытка
		КассоваяСмена.УстановитьНовыйНомер();
		КассоваяСмена.ОбменДанными.Загрузка = Истина;
		КассоваяСмена.Записать(РежимЗаписиДокумента.Запись);
		КассоваяСмена.ОбменДанными.Загрузка = Ложь;
		Результат = КассоваяСмена.Ссылка;
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1'"), ТекстОшибки);
		Результат = Неопределено;
	КонецПопытки;
	
	Возврат КассоваяСмена;
	
КонецФункции

Функция СоздатьЧек(КассаККМ, Кассир, Оборудование, ПараметрыЧека)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Чек.Ссылка
	|ИЗ
	|	Документ.Чек КАК Чек
	|ГДЕ
	|	Чек.НомерСмены = &НомерСмены И 
	|	Чек.НомерЧека = &НомерЧека И 
	|	Чек.НомерДокумента = &НомерДокумента И 
	|	Чек.ДатаФР = &ДатаФР И 
	|	Чек.КассаККМ = &КассаККМ
	|";
	Запрос.УстановитьПараметр("НомерСмены",     ПараметрыЧека.НомерСмены);
	Запрос.УстановитьПараметр("НомерЧека",      ПараметрыЧека.НомерЧека);
	Запрос.УстановитьПараметр("НомерДокумента", ПараметрыЧека.НомерДокумента);
	Запрос.УстановитьПараметр("ДатаФР",         ПараметрыЧека.ДатаЧека);
	Запрос.УстановитьПараметр("КассаККМ",       КассаККМ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЧекОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЧекОбъект.Товары.Очистить();
		ЧекОбъект.Оплаты.Очистить();
		ЧекОбъект.Скидки.Очистить();
		Возврат ЧекОбъект;
	КонецЕсли;
	
	ЧекОбъект = Документы.Чек.СоздатьДокумент();
	ЧекОбъект.НомерСмены     = ПараметрыЧека.НомерСмены;
	ЧекОбъект.НомерЧека      = ПараметрыЧека.НомерЧека;
	ЧекОбъект.ДатаФР         = ПараметрыЧека.ДатаЧека;
	ЧекОбъект.Дата           = ПараметрыЧека.ДатаЧека;
	ЧекОбъект.НомерДокумента = ПараметрыЧека.НомерДокумента;
	ЧекОбъект.Автор          = Кассир;
	ЧекОбъект.БлокироватьПерерасчетСкидок = Истина;
	
	Если ПараметрыЧека.ТипЧека = 1 ИЛИ ПараметрыЧека.ТипЧека = 4 ИЛИ ПараметрыЧека.ТипЧека = 9 ИЛИ ПараметрыЧека.ТипЧека = 10 Тогда
		ЧекОбъект.ХозОперация = Справочники.ХозОперации.ЧекНаВозврат;
	Иначе
		ЧекОбъект.ХозОперация = Справочники.ХозОперации.Чек;
	КонецЕсли;
	
	ЧекОбъект.Заполнить(Неопределено);
	ЧекОбъект.Товары.Очистить();
	ЧекОбъект.Оплаты.Очистить();
	ЧекОбъект.Скидки.Очистить();
	
	ОсновнойОтдел = Оборудование.ОсновнойОтдел;
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = Документы.Чек.ПолучитьПараметрыДействия(ЧекОбъект);
	ПараметрыДействия.Вставить("ЗапретИзмененияЦен", Истина);
	
	Если ЗначениеЗаполнено(Оборудование.Организация) Тогда
		ЧекОбъект.Организация = Оборудование.Организация;
	Иначе
		ЧекОбъект.Организация = ОсновнойОтдел.Организация;
	КонецЕсли;
	Документы.Чек.ОрганизацияПриИзменении(ЧекОбъект, ПараметрыДействия);
	
	Если НЕ ЧекОбъект.ПодразделениеКомпании = ОсновнойОтдел.ПодразделениеКомпании Тогда
		ЧекОбъект.ПодразделениеКомпании = ОсновнойОтдел.ПодразделениеКомпании;
		Документы.Чек.ПодразделениеКомпанииПриИзменении(ЧекОбъект, ПараметрыДействия);
	КонецЕсли;
	
	ЧекОбъект.СкладКомпании = ОсновнойОтдел;
	Документы.Чек.СкладКомпанииПриИзменении(ЧекОбъект, ПараметрыДействия);
	
	ЧекОбъект.ТипЦен = ОсновнойОтдел.ТипЦенРозничнойТорговли;
	Документы.Чек.ТипЦенПриИзменении(ЧекОбъект, ПараметрыДействия);
	
	Если ЗначениеЗаполнено(ЧекОбъект.ТипЦен.ВалютаЦены) И (ЧекОбъект.ТипЦен.ВалютаЦены <> ЧекОбъект.ВалютаДокумента) Тогда
		ЧекОбъект.ВалютаДокумента = ЧекОбъект.ТипЦен.ВалютаЦены;
		Документы.Чек.ВалютаДокументаПриИзменении(ЧекОбъект, ПараметрыДействия);
	КонецЕсли;
	
	Карточка = ПолучитьКарточку(ПараметрыЧека.НомерКартыКлиента);
	Если ЗначениеЗаполнено(Карточка) Тогда
		ЧекОбъект.Карточка = Карточка;
		Документы.Чек.КарточкаПриИзменении(ЧекОбъект, ПараметрыДействия);
	КонецЕсли;
	
	ЧекОбъект.КассаККМ = КассаККМ;
	//Документы.Чек.КассаККМПриИзменении(Объект, ПараметрыДействия);
	//ЧекОбъект.ФР = Оборудование;
	
	Возврат ЧекОбъект;
	
КонецФункции

Функция ПолучитьКассыККМ(Оборудование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КассыККМ.Ссылка КАК Ссылка,
	               |	КассыККМ.НомерPOS КАК НомерКассы
				   |ИЗ
	               |	Справочник.КассыККМ КАК КассыККМ
	               |ГДЕ
	               |	КассыККМ.ПометкаУдаления = ЛОЖЬ
	               |	И КассыККМ.Оборудование = &Оборудование";
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	
	Возврат  Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьСтавкиНДС() Экспорт
	
	ТаблицаСтавокНДС = Новый ТаблицаЗначений;
	ТаблицаСтавокНДС.Колонки.Добавить("Ставка");
	ТаблицаСтавокНДС.Колонки.Добавить("СтавкаНДС");
	
	НоваяСтрока = ТаблицаСтавокНДС.Добавить();
	НоваяСтрока.Ставка    = Неопределено;
	НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
	
	НоваяСтрока = ТаблицаСтавокНДС.Добавить();
	НоваяСтрока.Ставка    = 0;
	НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
	
	НоваяСтрока = ТаблицаСтавокНДС.Добавить();
	НоваяСтрока.Ставка    = 10;
	НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС10;
	
	НоваяСтрока = ТаблицаСтавокНДС.Добавить();
	НоваяСтрока.Ставка    = 18;
	НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	
	НоваяСтрока = ТаблицаСтавокНДС.Добавить();
	НоваяСтрока.Ставка    = 20;
	НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	
	НоваяСтрока = ТаблицаСтавокНДС.Добавить();
	НоваяСтрока.Ставка    = 22;
	НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС22;
	
	Возврат ТаблицаСтавокНДС;
	
КонецФункции

Функция ПолучитьСтавкиНДСУКП5() Экспорт
	
	//ТаблицаСтавокНДС = Новый ТаблицаЗначений;
	//ТаблицаСтавокНДС.Колонки.Добавить("Ставка");
	//ТаблицаСтавокНДС.Колонки.Добавить("СтавкаНДС");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	 |	СтавкиНДС.Ссылка КАК СтавкаНДС,
	 |	СтавкиНДС.idУКМ5 КАК Ставка
	 |ИЗ
	 |	Справочник.СтавкиНДС КАК СтавкиНДС");
	
	ТаблицаСтавокНДС = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаСтавокНДС;
	
КонецФункции

Функция ПолучитьСтавкуНДС(ТаблицаСтавокНДС, ТекущаяСтавка)
	
	Если ТекущаяСтавка = Null Тогда
		СтрокаСтавкиНДС = ТаблицаСтавокНДС.Найти(Неопределено, "Ставка");
	Иначе
		СтрокаСтавкиНДС = ТаблицаСтавокНДС.Найти(ТекущаяСтавка, "Ставка");
	КонецЕсли;
	
	Если СтрокаСтавкиНДС = Неопределено Тогда
		СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
	Иначе
		СтавкаНДС = СтрокаСтавкиНДС.СтавкаНДС;
	КонецЕсли;
	
	Возврат СтавкаНДС;
	
КонецФункции

Функция ПолучитьСтавкуНДСПОНаименованию(НаименованиеСтавки) Экспорт
	НайденнаяСсылка = Справочники.СтавкиНДС.НайтиПоНаименованию(НаименованиеСтавки);
	Если НайденнаяСсылка = Справочники.СтавкиНДС.ПустаяСсылка() Тогда
		НайденнаяСсылка = Справочники.СтавкиНДС.БезНДС;
	КонецЕсли;
	Возврат НайденнаяСсылка;
КонецФункции

Функция ПолучитьКассираЧека(КодКассира)
	
	Результат = Справочники.Пользователи.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Пользователи.Ссылка КАК Кассир
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.КодКассираPOS = &КодКассира
	|";
	Запрос.УстановитьПараметр("КодКассира", КодКассира);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Кассир;
	Иначе
		Результат = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСкидку(Знач ИдентификаторСкидки)
	
	Если ТипЗнч(ИдентификаторСкидки) = Тип("Число") Тогда
		ИдентификаторСкидки = Формат(ИдентификаторСкидки, "ЧН=0; ЧГ=0");
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ДисконтнаяКарта",  Справочники.Карточки.ПустаяСсылка());
	Результат.Вставить("Скидка",           Справочники.ТипыСкидок.ПустаяСсылка());
	Результат.Вставить("ЗначениеСкидки",   0);
	Результат.Вставить("СпособВычисления", Перечисления.СкидкиСпособВычисления.ПустаяСсылка());
	Результат.Вставить("НаДокумент",       Ложь);
	Результат.Вставить("Абсолютная",       Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СкидкиВОборудовании.ДисконтнаяКарта,
	|	СкидкиВОборудовании.Скидка,
	|	СкидкиВОборудовании.ЗначениеСкидки,
	|	СкидкиВОборудовании.СпособВычисления,
	|	ВЫБОР
	|		КОГДА СкидкиВОборудовании.СпособВычисления = ЗНАЧЕНИЕ(Перечисление.СкидкиСпособВычисления.Абсолютная) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК Абсолютная,
	|	ВЫБОР
	|		КОГДА СкидкиВОборудовании.Скидка.ВидСкидки = ЗНАЧЕНИЕ(Перечисление.ВидыСкидок.НаДокумент) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК НаДокумент
	|ИЗ
	|	РегистрСведений.СкидкиВОборудовании КАК СкидкиВОборудовании
	|ГДЕ
	|	СкидкиВОборудовании.ИдентификаторСкидкиВОборудовании = &Идентификатор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗНАЧЕНИЕ(Справочник.Карточки.ПустаяСсылка),
	|	СкидкиВОборудовании.Скидка,
	|	0,
	|	ТипыСкидок.СпособВычисления,
	|	ВЫБОР
	|		КОГДА ТипыСкидок.СпособВычисления = ЗНАЧЕНИЕ(Перечисление.СкидкиСпособВычисления.Абсолютная) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТипыСкидок.ВидСкидки = ЗНАЧЕНИЕ(Перечисление.ВидыСкидок.НаДокумент) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	РегистрСведений.СоответствиеСкидокВОборудовании КАК СкидкиВОборудовании
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ТипыСкидок КАК ТипыСкидок
	|ПО
	|	СкидкиВОборудовании.Скидка = ТипыСкидок.Ссылка
	|ГДЕ
	|	СкидкиВОборудовании.Идентификатор = &Идентификатор
	|";
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторСкидки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКарточку(НомерКартыКлиента)
	
	Результат = Справочники.Карточки.ПустаяСсылка();
	
	Если ПустаяСтрока(НомерКартыКлиента) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Карточки.Ссылка КАК Карточка
	|ИЗ
	|	Справочник.Карточки КАК Карточки
	|ГДЕ
	|	Карточки.Код = &НомерКартыКлиента И 
	|	Карточки.ВидКарточки = ЗНАЧЕНИЕ(Перечисление.ВидыКарточек.ДисконтнаяКарта)
	|";
	Запрос.УстановитьПараметр("НомерКартыКлиента", НомерКартыКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Карточка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЕдиницу(НаименованиеЕдиницы)
	
	Результат = Справочники.Карточки.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КлассификаторЕдиницИзмерения.Ссылка КАК Классификатор
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|ГДЕ
	|	КлассификаторЕдиницИзмерения.Наименование = &НаименованиеЕдиницы
	|";
	Запрос.УстановитьПараметр("НаименованиеЕдиницы", НаименованиеЕдиницы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Классификатор;
	Иначе
		КлассификаторЕдиницИзмерения = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
		КлассификаторЕдиницИзмерения.УстановитьНовыйКод();
		КлассификаторЕдиницИзмерения.НаименованиеПолное = НаименованиеЕдиницы;
		КлассификаторЕдиницИзмерения.Наименование       = НаименованиеЕдиницы;
		Попытка
			КлассификаторЕдиницИзмерения.Записать();
			Результат = КлассификаторЕдиницИзмерения.Ссылка;
		Исключение
			ЗаписьЖурналаРегистрации("POS супер маг", УровеньЖурналаРегистрации.Ошибка,,НаименованиеЕдиницы, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПоследнийЧек(Идентификатор, НомерКассы) Экспорт
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("НомерЧека",0);
	РезультатВыполнения.Вставить("ДатаЧека",'00010101');
	РезультатВыполнения.Вставить("НомерСмены",0);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПодключаемоеОборудование.Ссылка КАК Ссылка,
	                      |	ИТ_МоментыПоследнейЗагрузкиИзКасс.НомерЧека КАК НомерЧека,
	                      |	ИТ_МоментыПоследнейЗагрузкиИзКасс.ДатаЧека КАК ДатаЧека,
	                      |	ИТ_МоментыПоследнейЗагрузкиИзКасс.НомерСмены КАК НомерСмены
	                      |ИЗ
	                      |	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИТ_МоментыПоследнейЗагрузкиИзКасс КАК ИТ_МоментыПоследнейЗагрузкиИзКасс
	                      |		ПО ПодключаемоеОборудование.Ссылка = ИТ_МоментыПоследнейЗагрузкиИзКасс.Оборудование
	                      |			И (ИТ_МоментыПоследнейЗагрузкиИзКасс.НомерPOS = &НомерКассы)
	                      |ГДЕ
	                      |	(ПодключаемоеОборудование.Ссылка = &Идентификатор
	                      |			ИЛИ ПодключаемоеОборудование.ИдентификаторУстройства = &Идентификатор)");
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("НомерКассы", НомерКассы);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		РезультатВыполнения.Вставить("НомерЧека",Выборка.НомерЧека);
		РезультатВыполнения.Вставить("ДатаЧека",Выборка.ДатаЧека);
		РезультатВыполнения.Вставить("НомерСмены",Выборка.НомерСмены);
	КонецЕсли;
	
	Возврат РезультатВыполнения;
КонецФункции

Функция УстановитьПоследнийЧек(Идентификатор, НомерКассы, НомерЧека, ДатаЧека, НомерСмены, ОбновленияТолькоМомента = Ложь) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПодключаемоеОборудование.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	                      |ГДЕ
	                      |	(ПодключаемоеОборудование.Ссылка = &Идентификатор
	                      |			ИЛИ ПодключаемоеОборудование.ИдентификаторУстройства = &Идентификатор)");
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаписьМомента = РегистрыСведений.ИТ_МоментыПоследнейЗагрузкиИзКасс.СоздатьМенеджерЗаписи();
		ЗаписьМомента.Оборудование = Выборка.Ссылка;
		ЗаписьМомента.НомерPOS = НомерКассы;
		Если ОбновленияТолькоМомента Тогда
			ЗаписьМомента.Прочитать();
			Если Не ЗаписьМомента.Выбран() Тогда
				ЗаписьМомента.Оборудование = Выборка.Ссылка;
				ЗаписьМомента.НомерPOS = НомерКассы;	
			КонецЕсли;
			ЗаписьМомента.МоментПоследнейЗагрузки = ТекущаяДата();
		Иначе
			ЗаписьМомента.МоментПоследнейЗагрузки = ТекущаяДата();
			ЗаписьМомента.НомерЧека = НомерЧека;
			ЗаписьМомента.ДатаЧека = ДатаЧека;
			ЗаписьМомента.НомерСмены = НомерСмены;
		КонецЕсли;
		Попытка
			ЗаписьМомента.Записать();
			Возврат Истина;
		Исключение
			Ош = ОписаниеОшибки();
			Возврат Ложь;
		КонецПопытки;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// dmboro ++
Функция ПолучитьПризнакМаркировки(СтрокаДанных) Экспорт
	
	КодУКМ = 0;
	структураКодов = ПолучитьСтруктуруСоответствия("УКМ");
	
	Попытка
		КодУКМ = структураКодов["Парам" + Строка(СтрокаДанных.ОсобенностьУчета.ТипМаркировки)];
	Исключение
	КонецПопытки;
	
	
	Возврат КодУКМ;
	
	//Если СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.АлкогольМаркированный Тогда Возврат 1        // 1 – маркированный товар
	//ИначеЕсли СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.АлкогольНеМаркированный Тогда Возврат 2 // 2 – немаркированный
	//ИначеЕсли СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.ТабакМаркированный Тогда Возврат 3      // 3 – специальный маркированный товар
	////ИначеЕсли СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.ТабакНеМаркированный Тогда Возврат 4  // 4 – частично маркированный товар
	//
	////Мальцев А.Ю. +++
	////ИначеЕсли СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.МолочнаяПродукция Тогда Возврат 1 	
	////ИначеЕсли СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияБезВетИС Тогда Возврат 1 	
	//ИначеЕсли СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияВГотовомВидеМаркированная Тогда Возврат 3 // 3 – специальный маркированный товар	
	//ИначеЕсли СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияВГотовомВидеЧастичноМаркированная Тогда Возврат 4 // 4 – частично маркированный товар	
	////ИначеЕсли СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияДляПродажиВНарезкуМаркированная Тогда Возврат 3 	
	////Мальцев А.Ю. ---
	//
	//Иначе Возврат 0 КонецЕсли;                                                                                                 // 0 – неакцизный товар
КонецФункции

Процедура ЗафиксироватьДатуПоследнейВыгрузкиПродавцов(ДатаВыгрузкиПродаыцов) Экспорт
	Получ = Справочники.ИТ_НастройкиДописанногоФункционала.ПоследняяДатаЗагрузкиПродавцов.ПолучитьОбъект();
	Получ.Значение = ДатаВыгрузкиПродаыцов;
	Получ.ОбменДанными.Загрузка = Истина;
	Попытка
		Получ.Записать();
	Исключение КонецПопытки;
КонецПроцедуры
// dmboro --

//Мальцев А.Ю. +++
Функция ПолучитьПризнакФСРЛдляПозиции(СтрокаДанных) Экспорт
	
	Признак = 1;
	структураКодов = ПолучитьСтруктуруСоответствия("КСО");
	
	Попытка
		Признак = структураКодов["Парам" + Строка(СтрокаДанных.ОсобенностьУчета.ТипМаркировки)];
	Исключение
	КонецПопытки;
	
	
	Возврат Признак;
	
	//Если СтрокаДанных.ОсобенностьУчета.ТипМаркировки = 1 Тогда
	//	Признак = 257;
	//ИначеЕсли СтрокаДанных.ОсобенностьУчета.ТипМаркировки = 2 Тогда
	//	Признак = 32769;
	//ИначеЕсли СтрокаДанных.ОсобенностьУчета.ТипМаркировки = 3 Тогда
	//	Признак = 1539;
	//ИначеЕсли СтрокаДанных.ОсобенностьУчета.ТипМаркировки = 4 Тогда
	//	Признак = 515;
	//КонецЕсли;
	
	//Если СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.АлкогольМаркированный Тогда  	
	//	Признак = 257;

	//ИначеЕсли СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.АлкогольНеМаркированный Тогда
	//	Признак = 32769;
	//	
	//ИначеЕсли СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.ТабакМаркированный Тогда 		
	//	Признак = 1539;
	//	
	//ИначеЕсли СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияВГотовомВидеМаркированная Тогда 
	//	Признак = 515;
	//	
	//ИначеЕсли СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияВГотовомВидеЧастичноМаркированная Тогда 
	//	Признак = 515;
	//	
	//ИначеЕсли СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.ВодаУпакованнаяМаркированная Тогда 
	//	Признак = 515;
	//	
	//ИначеЕсли СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.ВодаУпакованнаяЧастичноМаркированная Тогда 
	//	Признак = 515;
	//	
	//ИначеЕсли СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.Энергетик Тогда 
	//	Признак = 32769;
	//	
	//КонецЕсли;  	
	
	
	//Возврат Признак;
	
	
КонецФункции

Функция ПолучитьСтруктуруСоответствия(ТипОборудования) Экспорт
	
	структураКодов = Новый Структура;
	
	Если ТипОборудования = "УКМ" Тогда
		
		структураКодов.Вставить("Парам0",0);
		структураКодов.Вставить("Парам1",1);
		структураКодов.Вставить("Парам2",2);
		структураКодов.Вставить("Парам3",3);
		структураКодов.Вставить("Парам4",4);
		структураКодов.Вставить("Парам5",3);
		структураКодов.Вставить("Парам6",4);
		
	ИначеЕсли ТипОборудования = "КСО" Тогда
		
		структураКодов.Вставить("Парам0",1);
		структураКодов.Вставить("Парам1",257);
		структураКодов.Вставить("Парам2",32769);
		структураКодов.Вставить("Парам3",1539);
		структураКодов.Вставить("Парам4",515);
		структураКодов.Вставить("Парам5",515);
		структураКодов.Вставить("Парам6",515);
		
	КонецЕсли;

	Возврат структураКодов;
	
КонецФункции

Функция ПолучитьПризнакАкцизности(СтрокаДанных) Экспорт
	Если СтрокаДанных.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.АлкогольМаркированный или 
		СтрокаДанных.ОсобенностьУчета.Акцизный Тогда  Возврат 1        // 1 – акцизный товар
	Иначе Возврат 0 КонецЕсли;                                                                                                 // 0 – неакцизный товар
КонецФункции

Функция ПолучитьКассу(Организация, ПодразделениеКомпании)
	
	Если ЗначениеЗаполнено(ПодразделениеКомпании.ит_ОсновнаяКасса) Тогда
		Возврат ПодразделениеКомпании.ит_ОсновнаяКасса;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КассыКомпании.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КассыКомпании КАК КассыКомпании
	|ГДЕ
	|	КассыКомпании.ПометкаУдаления = ЛОЖЬ
	|	И КассыКомпании.ПодразделениеКомпании = &ПодразделениеКомпании
	|	И КассыКомпании.Организация = &Организация
	|";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиРКО(Основание)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходныйКассовыйОрдер.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	               |ГДЕ
	               |	РасходныйКассовыйОрдер.ДокументОснование = &Основание
	               |	И НЕ РасходныйКассовыйОрдер.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Основание",             Основание);
	
	Результат = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиПКО(Основание)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходныйКассовыйОрдер.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	               |ГДЕ
	               |	ПриходныйКассовыйОрдер.ДокументОснование = &Основание
	               |	И НЕ ПриходныйКассовыйОрдер.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Основание",             Основание);
	
	Результат = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиВнесение(КассаККМ, ФР, НомерСмены, ДатаИнкассации, НомерДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Инкассация.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Инкассация КАК Инкассация
	               |ГДЕ
	               |	Инкассация.НомерСмены = &НомерСмены
	               |	И Инкассация.КассаККМ = &КассаККМ
	               |	И Инкассация.ДатаФР = &ДатаФР
	               |	И Инкассация.ФР = &ФР
	               |	И Инкассация.НомерДокумента = &НомерДокумента
	               |	И Инкассация.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ВнесениеВКассуККМ)
	               |	И НЕ Инкассация.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ФР",             ФР);
	Запрос.УстановитьПараметр("НомерСмены",    НомерСмены);
	Запрос.УстановитьПараметр("ДатаФР",        ДатаИнкассации);
	//Запрос.УстановитьПараметр("НачалоДня",    НачалоДня(ДатаИнкассации));
	//Запрос.УстановитьПараметр("КонецДня",    КонецДня(ДатаИнкассации));
	Запрос.УстановитьПараметр("КассаККМ",       КассаККМ);
	Запрос.УстановитьПараметр("НомерДокумента", НомерДокумента);
	
	Результат = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиИзъятие(КассаККМ, ФР, НомерСмены, ДатаИнкассации, НомерДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Инкассация.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Инкассация КАК Инкассация
	               |ГДЕ
	               |	Инкассация.НомерСмены = &НомерСмены
	               |	И Инкассация.КассаККМ = &КассаККМ
	               |	И Инкассация.ДатаФР = &ДатаФР
	               |	И Инкассация.ФР = &ФР
	               |	И Инкассация.НомерДокумента = &НомерДокумента
	               |	И Инкассация.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ИзъятиеИзКассыККМ)
	               |	И НЕ Инкассация.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ФР",             ФР);
	Запрос.УстановитьПараметр("НомерСмены",    НомерСмены);
	Запрос.УстановитьПараметр("ДатаФР",        ДатаИнкассации);
	//Запрос.УстановитьПараметр("НачалоДня",    НачалоДня(ДатаИнкассации));
	//Запрос.УстановитьПараметр("КонецДня",    КонецДня(ДатаИнкассации));
	Запрос.УстановитьПараметр("КассаККМ",       КассаККМ);
	Запрос.УстановитьПараметр("НомерДокумента", НомерДокумента);
	
	Результат = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает единицу измерения в зависимости от базовой.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура  - Ссылка на номенклатуру, которую надо исключить из выборки.
//
// Возвращаемое значение:
//  СправочникСсылка.ЕдиницыИзмерения - Ссылка на найденную единицу измерения.
//
Функция ПолучитьОсновнуюЕдиницуПоБазовой(Номенклатура)
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;
	
	ЕдиницаПоКлассификатору = Номенклатура.БазоваяЕдиницаИзмерения;
	
	Если Номенклатура.ТипНоменклатуры.ИспользованиеЕдиницИзмерения=1 Тогда
		Владелец =  Номенклатура.ТипНоменклатуры;
	Иначе
		Владелец =  Номенклатура.Ссылка;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ЕдиницыИзмерения.Ссылка КАК Ссылка,
	                      |	ЕдиницыИзмерения.Коэффициент КАК Коэффициент,
	                      |	ВЫБОР
	                      |		КОГДА ЕдиницыИзмерения.ПометкаУдаления
	                      |			ТОГДА 0
	                      |		ИНАЧЕ 1
	                      |	КОНЕЦ КАК ПолеСортировкиПоПометкеУдаления,
	                      |	ВЫБОР
	                      |		КОГДА ЕдиницыИзмерения.Коэффициент = 1
	                      |			ТОГДА 0
	                      |		ИНАЧЕ 1
	                      |	КОНЕЦ КАК ПолеСортировкиПоКоэффициенту,
	                      |	ВЫБОР
	                      |		КОГДА ЕдиницыИзмерения.ЕдиницаПоКлассификатору = &ЕдиницаПоКлассификатору
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ КАК ПолеСортировки
	                      |ИЗ
	                      |	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	                      |ГДЕ
	                      |	ЕдиницыИзмерения.Владелец = &Владелец
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПолеСортировкиПоПометкеУдаления,
	                      |	ПолеСортировкиПоКоэффициенту,
	                      |	Коэффициент,
	                      |	ПолеСортировки");
	Запрос.УстановитьПараметр("Владелец",                   Владелец);
	Запрос.УстановитьПараметр("ЕдиницаПоКлассификатору",    ЕдиницаПоКлассификатору);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЕдиницаИзмерения = Выборка.Ссылка;
	Иначе
		ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ЕдиницаИзмерения;
	
КонецФункции // ПолучитьОсновнуюЕдиницуПоБазовой()

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьДиапазонЧеков() Экспорт
	
	ПолучитьДиапазонЧеков = Новый Структура;
	ПолучитьДиапазонЧеков.Вставить("НомерКассы");
	ПолучитьДиапазонЧеков.Вставить("НомерСмены");
	ПолучитьДиапазонЧеков.Вставить("ИдСмены");
	ПолучитьДиапазонЧеков.Вставить("МинНомерЧека");
	ПолучитьДиапазонЧеков.Вставить("МаксНомерЧека");
	ПолучитьДиапазонЧеков.Вставить("МаксДатаЧека");
	
	Возврат ПолучитьДиапазонЧеков;
	
КонецФункции

Процедура ПриЗагрузкеЧеков(ТаблицыПродаж, ОфлайнОборудование, ДиапазоныЧеков, Отказ, ТекстОшибки, ВыводитьПрогресс = Ложь) Экспорт
	
	ЗаписатьТекстВЛог(Формат(ОфлайнОборудование.ИндексМагазина,"ЧГ=0"),"Загрузка чеков. Начало.");
	
	ДиапазоныЧеков = Новый Массив;
	
	ТаблицаСмен          = ТаблицыПродаж.ТаблицаСмен;
	ТаблицаЧеков         = ТаблицыПродаж.ТаблицаЧеков;
	ТаблицаПродаж        = ТаблицыПродаж.ТаблицаПродаж;
	ТаблицаОплат         = ТаблицыПродаж.ТаблицаОплат;
	ТаблицаСкидокПоКарте = ТаблицыПродаж.ТаблицаСкидокПоКарте;
	
	ТаблицаКассККМ   = ПолучитьКассыККМ(ОфлайнОборудование);
	ТаблицаСтавокНДС = ПолучитьСтавкиНДС();
	
	ТаблицаКассиров = Новый ТаблицаЗначений;
	ТаблицаКассиров.Колонки.Добавить("Код");
	ТаблицаКассиров.Колонки.Добавить("Кассир");
	
	ТаблицаСкидок = Новый ТаблицаЗначений;
	ТаблицаСкидок.Колонки.Добавить("Код");
	ТаблицаСкидок.Колонки.Добавить("Скидка");
	ТаблицаСкидок.Колонки.Добавить("ДисконтнаяКарта");
	ТаблицаСкидок.Колонки.Добавить("ЗначениеСкидки");
	ТаблицаСкидок.Колонки.Добавить("СпособВычисления");
	ТаблицаСкидок.Колонки.Добавить("НаДокумент");
	ТаблицаСкидок.Колонки.Добавить("Абсолютная");
	
	ТаблицаЕдиниц = Новый ТаблицаЗначений;
	ТаблицаЕдиниц.Колонки.Добавить("Наименование");
	ТаблицаЕдиниц.Колонки.Добавить("Единица");
	
	ПараметрыДействия = Новый Структура;
	
	Для Каждого ТекущаяСмена Из ТаблицаСмен Цикл
		           
		СтрокаКассыККМ = ТаблицаКассККМ.Найти(ТекущаяСмена.НомерКассы, "НомерКассы");
		Если СтрокаКассыККМ = Неопределено Тогда
			КассаККМ = Справочники.КассыККМ.ПолучитьКассуККМОборудования(ОфлайнОборудование, ТекущаяСмена.НомерКассы);
		Иначе
			КассаККМ = СтрокаКассыККМ.Ссылка;
		КонецЕсли;

		ОписаниеПрогрессаСмены = "Формирование чеков кассы <" + СокрЛП(КассаККМ) + ">; смены № " + СокрЛП(ТекущаяСмена.НомерСмены);
		
		ДиапазонЧеков = ПолучитьДиапазонЧеков();
		ДиапазонЧеков.НомерКассы   = ТекущаяСмена.НомерКассы;
		ДиапазонЧеков.НомерСмены   = ТекущаяСмена.НомерСмены;
		ДиапазонЧеков.ИдСмены      = ТекущаяСмена.ИдСмены;
		ДиапазонЧеков.МинНомерЧека = 0;
		ДиапазонЧеков.МаксНомерЧека  = 0;
		ДиапазонЧеков.МаксДатаЧека  = '00010101';
		
		//НачатьТранзакцию();
		
		КоличествоЧеков          = ТаблицаЧеков.Количество();
		НачальноеКоличествоЧеков = КоличествоЧеков;
		Прогресс = 1;
		Пока КоличествоЧеков>0 Цикл
			ТекущийЧек = ТаблицаЧеков[0];
			// Стабилизируем таблицу продаж
			// Уберем строки для которых не нашли шапку чека
			Пока ТекущаяСмена.НомерКассы > ТекущийЧек.НомерКассы Цикл
				ТаблицаЧеков.Удалить(0);
				КоличествоЧеков = КоличествоЧеков - 1;
				Если КоличествоЧеков = 0 Тогда
					Прервать;
				КонецЕсли;
				ТекущийЧек = ТаблицаЧеков[0];
			КонецЦикла;
			
			Если НЕ ТекущаяСмена.НомерКассы = ТекущийЧек.НомерКассы Тогда
				Прервать;
			КонецЕсли;
			
			Пока ТекущаяСмена.ИдСмены > ТекущийЧек.ИдСмены Цикл
				ТаблицаЧеков.Удалить(0);
				КоличествоЧеков = КоличествоЧеков - 1;
				Если КоличествоЧеков = 0 Тогда
					Прервать;
				КонецЕсли;
				ТекущийЧек = ТаблицаЧеков[0];
			КонецЦикла;
			
			Если НЕ ТекущаяСмена.ИдСмены = ТекущийЧек.ИдСмены Тогда
				Прервать;
			КонецЕсли;
			
			СтрокаКассира = ТаблицаКассиров.Найти(ТекущийЧек.Кассир, "Код");
			Если СтрокаКассира = Неопределено Тогда
				Кассир = ПолучитьКассираЧека(ТекущийЧек.Кассир);
				СтрокаКассира = ТаблицаКассиров.Добавить();
				СтрокаКассира.Код    = ТекущийЧек.Кассир;
				СтрокаКассира.Кассир = Кассир;
			КонецЕсли;
			
			ЧекОбъект = СоздатьЧек(КассаККМ, СтрокаКассира.Кассир, ОфлайнОборудование, ТекущийЧек);
			
			КоличествоПродаж = ТаблицаПродаж.Количество();
			Пока КоличествоПродаж>0 Цикл
				СтрокаЧека = ТаблицаПродаж[0];
				// Стабилизируем таблицу продаж
				// Уберем строки для которых не нашли шапку чека
				Пока ТекущийЧек.НомерКассы > СтрокаЧека.НомерКассы Цикл
					ТаблицаПродаж.Удалить(0);
					КоличествоПродаж = КоличествоПродаж - 1;
					Если КоличествоПродаж = 0 Тогда
						Прервать;
					КонецЕсли;
					СтрокаЧека = ТаблицаПродаж[0];
				КонецЦикла;
				
				Если НЕ ТекущийЧек.НомерКассы = СтрокаЧека.НомерКассы Тогда
					Прервать;
				КонецЕсли;
				
				Пока ТекущийЧек.ИдСмены > СтрокаЧека.ИдСмены Цикл
					ТаблицаПродаж.Удалить(0);
					КоличествоПродаж = КоличествоПродаж - 1;
					Если КоличествоПродаж = 0 Тогда
						Прервать;
					КонецЕсли;
					СтрокаЧека = ТаблицаПродаж[0];
				КонецЦикла;
				
				Если НЕ ТекущийЧек.ИдСмены = СтрокаЧека.ИдСмены Тогда
					Прервать;
				КонецЕсли;
				
				Пока ТекущийЧек.НомерЧека > СтрокаЧека.НомерЧека Цикл
					ТаблицаПродаж.Удалить(0);
					КоличествоПродаж = КоличествоПродаж - 1;
					Если КоличествоПродаж = 0 Тогда
						Прервать;
					КонецЕсли;
					СтрокаЧека = ТаблицаПродаж[0];
				КонецЦикла;
				
				Если НЕ ТекущийЧек.НомерЧека = СтрокаЧека.НомерЧека Тогда
					Прервать;
				КонецЕсли;
				
				Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаЧека.Артикул);
				
				//Мальцев А.Ю. +++ VRM        				
				Если Не ЗначениеЗаполнено(Номенклатура) Тогда
					
					// Поиск объектов по штрихкоду.
					ОбъектыПоШтрихкоду = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(СтрокаЧека.Артикул,,Истина);
					Если ОбъектыПоШтрихкоду.Количество() > 0 Тогда
						Номенклатура = ОбъектыПоШтрихкоду[0].Объект;	
					Конецесли;
					
				КонецЕсли;
				//Мальцев А.Ю. --- VRM        

				//Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
				//	КоличествоПродаж = КоличествоПродаж - 1;
				//	ТаблицаПродаж.Удалить(0);
				//	Продолжить;
				//КонецЕсли;
				
				Если СтрокаЧека.ПорядокСкидки = 0 ИЛИ ЧекОбъект.Товары.Количество()=0 Тогда
					НоваяСтрока = ЧекОбъект.Товары.Добавить();
					НоваяСтрока.МестоРазмещения     = ЧекОбъект.СкладКомпании;
					НоваяСтрока.Номенклатура        = Номенклатура;
					НоваяСтрока.ИдентификаторСтроки = СтрокаЧека.ИДСтроки;
					// Производим корректировку и заполнение связанных аналитик в строке
					ОбработкаТабличнойЧастиТовары.ОбработатьИзменениеНоменклатура(ЧекОбъект, НоваяСтрока, ПараметрыДействия);
					
					//НоваяСтрока.ЕдиницаИзмерения = Номенклатура.ОсновнаяЕдиницаИзмерения;
					НоваяСтрока.ЕдиницаИзмерения = ПолучитьОсновнуюЕдиницуПоБазовой(Номенклатура);
					//Если СтрокаЧека.Единица = "" Тогда
					//	Если ЗначениеЗаполнено(Номенклатура.ОсновнаяЕдиницаИзмерения) Тогда
					//		НоваяСтрока.ЕдиницаИзмерения = Номенклатура.ОсновнаяЕдиницаИзмерения;
					//	Иначе
					//		НоваяСтрока.ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(Номенклатура);
					//	КонецЕсли;
					//Иначе
					//	СтрокаЕдиницы = ТаблицаЕдиниц.Найти(СтрокаЧека.Единица, "Наименование");
					//	Если СтрокаЕдиницы = Неопределено Тогда
					//		Единица = ПолучитьЕдиницу(СтрокаЧека.Единица);
					//		СтрокаЕдиницы = ТаблицаЕдиниц.Добавить();
					//		СтрокаЕдиницы.Наименование = СтрокаЧека.Единица;
					//		СтрокаЕдиницы.Единица      = Единица;
					//	КонецЕсли;
					//	
					//	НоваяСтрока.ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(Номенклатура, СтрокаЕдиницы.Единица, СтрокаЕдиницы.Наименование);
					//КонецЕсли;
					НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
					НоваяСтрока.Количество  = СтрокаЧека.Количество;
					Документы.Чек.ТоварыКоличествоПриИзменении(ЧекОбъект, НоваяСтрока);
					НоваяСтрока.Цена       = СтрокаЧека.Цена;
					Документы.Чек.ТоварыЦенаПриИзменении(ЧекОбъект, НоваяСтрока);
					НоваяСтрока.СтавкаНДС = ПолучитьСтавкуНДС(ТаблицаСтавокНДС, СтрокаЧека.СтавкаНДС);
					Документы.Чек.ТоварыСтавкаНДСПриИзменении(ЧекОбъект, НоваяСтрока);
				Иначе
					НоваяСтрока = ЧекОбъект.Товары[ЧекОбъект.Товары.Количество()-1];
				КонецЕсли;
				
				СтрокаСкидки = ТаблицаСкидок.Найти(СтрокаЧека.Скидка, "Код");
				Если СтрокаСкидки = Неопределено Тогда
					ПараметрыСкидки = ПолучитьСкидку(СтрокаЧека.Скидка);
					СтрокаСкидки = ТаблицаСкидок.Добавить();
					СтрокаСкидки.Код              = СтрокаЧека.Скидка;
					СтрокаСкидки.Скидка           = ПараметрыСкидки.Скидка;
					СтрокаСкидки.ДисконтнаяКарта  = ПараметрыСкидки.ДисконтнаяКарта;
					СтрокаСкидки.ЗначениеСкидки   = ПараметрыСкидки.ЗначениеСкидки;
					СтрокаСкидки.СпособВычисления = ПараметрыСкидки.СпособВычисления;
					СтрокаСкидки.НаДокумент       = ПараметрыСкидки.НаДокумент;
					СтрокаСкидки.Абсолютная       = ПараметрыСкидки.Абсолютная;
				КонецЕсли;
				
				Если СтрокаЧека.СуммаСкидки > 0 Тогда
					СуммаБезСкидки = СкидкиНаценкиСервер.ПолучитьСуммуСтрокиБезСкидок(ЧекОбъект, НоваяСтрока, "Товары");
					Если СтрокаСкидки.НаДокумент Тогда
						Если НЕ ЗначениеЗаполнено(ЧекОбъект.СкидкаНаценка) Тогда
							ЧекОбъект.СкидкаНаценка = СтрокаСкидки.Скидка;
							//ПорядокСкидки
						КонецЕсли;
						//НоваяСтрока.СкидкаНаценка = СтрокаСкидки.Скидка;
						НоваяСтрока.СкидкаНаТовар = СтрокаСкидки.Скидка;
						НоваяСтрока.СуммаСкидки   = НоваяСтрока.СуммаСкидки + СтрокаЧека.СуммаСкидки;
						НоваяСтрока.ПроцентСкидки = ?(СуммаБезСкидки = 0, 0, НоваяСтрока.СуммаСкидки*100/СуммаБезСкидки);
					Иначе
						НоваяСтрока.СкидкаНаТовар       = СтрокаСкидки.Скидка;
						НоваяСтрока.СуммаСкидкиСтроки   = НоваяСтрока.СуммаСкидкиСтроки + СтрокаЧека.СуммаСкидки;
						НоваяСтрока.ПроцентСкидкиСтроки = ?(СуммаБезСкидки = 0, 0, НоваяСтрока.СуммаСкидкиСтроки*100/СуммаБезСкидки);
					КонецЕсли;
					
					НоваяСтрокаСкидки = ЧекОбъект.Скидки.Добавить();
					НоваяСтрокаСкидки.ИдентификаторСтроки = НоваяСтрока.ИдентификаторСтроки;
					НоваяСтрокаСкидки.СкидкаНаценка       = СтрокаСкидки.Скидка;
					НоваяСтрокаСкидки.ИдентификаторСкидки = СтрокаСкидки.Код;
					НоваяСтрокаСкидки.СуммаСкидки         = СтрокаЧека.СуммаСкидки;
					НоваяСтрокаСкидки.Карточка            = ПараметрыСкидки.ДисконтнаяКарта;
					
				КонецЕсли;
				
				НоваяСтрока.СуммаВсего = СтрокаЧека.СуммаВсего;
				Документы.Чек.ТоварыСуммаВсегоПриИзменении(ЧекОбъект, НоваяСтрока);
				
				ТаблицаПродаж.Удалить(0);
				
				КоличествоПродаж = КоличествоПродаж - 1;
			КонецЦикла;
			
			ИтогиОперации = Документы.Чек.РассчитатьИтогиОперации(ЧекОбъект);
			ЗаполнитьЗначенияСвойств(ЧекОбъект, ИтогиОперации);
			
			КоличествоОплат = ТаблицаОплат.Количество();
			Пока КоличествоОплат>0 Цикл
				СтрокаОплаты = ТаблицаОплат[0];
				
				Пока ТекущийЧек.НомерКассы > СтрокаОплаты.НомерКассы Цикл
					ТаблицаОплат.Удалить(0);
					КоличествоОплат = КоличествоОплат - 1;
					Если КоличествоОплат = 0 Тогда
						Прервать;
					КонецЕсли;
					СтрокаОплаты = ТаблицаОплат[0];
				КонецЦикла;
				
				Если НЕ ТекущийЧек.НомерКассы = СтрокаОплаты.НомерКассы Тогда
					Прервать;
				КонецЕсли;
				
				Пока ТекущийЧек.ИдСмены > СтрокаОплаты.ИдСмены Цикл
					ТаблицаОплат.Удалить(0);
					КоличествоОплат = КоличествоОплат - 1;
					Если КоличествоОплат = 0 Тогда
						Прервать;
					КонецЕсли;
					СтрокаОплаты = ТаблицаОплат[0];
				КонецЦикла;
				
				Если НЕ ТекущийЧек.ИдСмены = СтрокаОплаты.ИдСмены Тогда
					Прервать;
				КонецЕсли;
				
				Пока ТекущийЧек.НомерДокумента > СтрокаОплаты.НомерЧека Цикл
					ТаблицаОплат.Удалить(0);
					КоличествоОплат = КоличествоОплат - 1;
					Если КоличествоОплат = 0 Тогда
						Прервать;
					КонецЕсли;
					СтрокаОплаты = ТаблицаОплат[0];
				КонецЦикла;
				
				Если НЕ ТекущийЧек.НомерДокумента = СтрокаОплаты.НомерЧека Тогда
					Прервать;
				КонецЕсли;
				
				НоваяСтрока = ЧекОбъект.Оплаты.Добавить();
				Если СтрокаОплаты.ИДУстройства = 0 Тогда
					НоваяСтрока.ТипОплаты = Справочники.ТипыОплат.Наличные;
				Иначе
					НоваяСтрока.ТипОплаты = Справочники.ТипыОплат.Безналичные;
					Карточка = ПолучитьКарточку(СтрокаОплаты.НомерКарты);
					Если ЗначениеЗаполнено(Карточка) Тогда
						НоваяСтрока.Карточка   = Карточка;
						Если ТипЗнч(Карточка.Объект) = Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Тогда
							НоваяСтрока.ДоговорВзаиморасчетов = Карточка.Объект;
							НоваяСтрока.Контрагент            = Карточка.Объект.Владелец;
						ИначеЕсли ТипЗнч(Карточка.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
							НоваяСтрока.Контрагент = Карточка.Объект;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				НоваяСтрока.Сумма = СтрокаОплаты.СуммаПлатежа;
				Документы.Чек.ОплатыСуммаПриИзменении(ЧекОбъект, НоваяСтрока);
				
				ТаблицаОплат.Удалить(0);
				
				КоличествоОплат = КоличествоОплат - 1;
			КонецЦикла;
			
			//КоличествоСкидок = ТаблицаСкидокПоКарте.Количество();
			//Пока КоличествоСкидок>0 Цикл
			//	СтрокаСкидки = ТаблицаСкидокПоКарте[0];
			//	Если НЕ ТекущийЧек.НомерКассы = СтрокаСкидки.НомерКассы Тогда
			//		Прервать;
			//	КонецЕсли;
			//	
			//	Если НЕ ТекущийЧек.НомерЧека = СтрокаСкидки.НомерЧека Тогда
			//		Прервать;
			//	КонецЕсли;
			//	
			//	НоваяСтрока = ЧекОбъект.Скидки.Добавить();
			//	//Если ЗначениеЗаполнено(СтрокаСкидки.НомерКарты) Тогда
			//	//	НоваяСтрока.ТипПлатежнойКарты = Справочники.ТипыОплат.Безналичные;
			//	//	Карточка = ПолучитьКарточку(СтрокаСкидки.НомерКарты);
			//	//	Если ЗначениеЗаполнено(Карточка) Тогда
			//	//		НоваяСтрока.Карточка   = Карточка;
			//	//		НоваяСтрока.Контрагент = Карточка.Объект;
			//	//	КонецЕсли;
			//	//Иначе
			//	//	НоваяСтрока.ТипОплаты = Справочники.ТипыОплат.Наличные;
			//	//КонецЕсли;
			//	//НоваяСтрока.Сумма = СтрокаСкидки.СуммаПлатежа;
			//	//Документы.Чек.ОплатыСуммаПриИзменении(ЧекОбъект, НоваяСтрока);
			//	
			//	ТаблицаСкидокПоКарте.Удалить(0);
			//	
			//	КоличествоСкидок = КоличествоСкидок - 1;
			//КонецЦикла;
			
			//СтрокаСкидки.НомерКарты = Запрос.Fields("CARDNUMBER").Value;
			//СтрокаСкидки.ТипКарты   = Запрос.Fields("CARDTYPE").Value;
			Попытка
				ЧекОбъект.СуммаСкидкиНаценки = ЧекОбъект.Скидки.Итог("СуммаСкидки");
				ЧекОбъект.ДополнительныеСвойства.Вставить("ПроверитьОстатки", Ложь);
				Если ЧекОбъект.Проведен Тогда
					ЧекОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Иначе
					ЧекОбъект.УстановитьНовыйНомер();
					ЧекОбъект.ОбменДанными.Загрузка = Истина;
					ЧекОбъект.Записать(РежимЗаписиДокумента.Запись);
					ЧекОбъект.ОбменДанными.Загрузка = Ложь;
				КонецЕсли;
				ВывестиСообщение(НСтр("ru='Создан чек ""%1""'"), ,,,, СокрЛП(ЧекОбъект));
			Исключение
				ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1'"), ТекстОшибки);
				
				ТаблицаЧеков.Удалить(0);
				КоличествоЧеков = КоличествоЧеков - 1;
				Продолжить;
			КонецПопытки;
			
			Попытка
				Если НЕ ЧекОбъект.ПометкаУдаления Тогда
					ЧекОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
					ВывестиСообщение(НСтр("ru='Проведен чек ""%1""'"), ,,,, СокрЛП(ЧекОбъект));
				КонецЕсли;
			Исключение
				//Отказ       = Истина;
				ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1'"), ТекстОшибки);
				
				ТаблицаЧеков.Удалить(0);
				КоличествоЧеков = КоличествоЧеков - 1;
				Продолжить;
			КонецПопытки;
			
			//ОтчетОПродажахККМ.Чеки.Добавить(ЧекОбъект.Ссылка);
			Если ДиапазонЧеков.МинНомерЧека = 0 Тогда
				ДиапазонЧеков.МинНомерЧека = ТекущийЧек.НомерЧека;
				ДиапазонЧеков.МаксНомерЧека  = ТекущийЧек.НомерЧека;
				ДиапазонЧеков.МаксДатаЧека  = ТекущийЧек.ДатаЧека;
			ИначеЕсли ТекущийЧек.НомерЧека - ДиапазонЧеков.МаксНомерЧека = 1 Тогда
				ДиапазонЧеков.МаксНомерЧека  = ТекущийЧек.НомерЧека;
				ДиапазонЧеков.МаксДатаЧека  = ТекущийЧек.ДатаЧека;
			Иначе
				
				ДиапазоныЧеков.Добавить(ДиапазонЧеков);
				
				ДиапазонЧеков = ПолучитьДиапазонЧеков();
				ДиапазонЧеков.НомерКассы   = ТекущаяСмена.НомерКассы;
				ДиапазонЧеков.ИдСмены      = ТекущаяСмена.ИдСмены;
				ДиапазонЧеков.НомерСмены   = ТекущаяСмена.НомерСмены;
				ДиапазонЧеков.МинНомерЧека = ТекущийЧек.НомерЧека;
				ДиапазонЧеков.МаксНомерЧека  = ТекущийЧек.НомерЧека;
				ДиапазонЧеков.МаксДатаЧека  = ТекущийЧек.ДатаЧека;
			КонецЕсли;
			
			ТаблицаЧеков.Удалить(0);
			КоличествоЧеков = КоличествоЧеков - 1;
			
			Если ВыводитьПрогресс Тогда
				Если КоличествоЧеков = 0 Тогда
					Процент = 100;
				Иначе
					Процент = (Прогресс/КоличествоЧеков)*100;
				КонецЕсли;
				ТекстПрогресса = ОписаниеПрогрессаСмены + ". Загружено " + СокрЛП(Прогресс) + " из " + СокрЛП(НачальноеКоличествоЧеков)+" чеков";
				РезультатОбработкиСтроки = Новый Структура;
				РезультатОбработкиСтроки.Вставить("ТекстПрогресса", ТекстПрогресса);
				ДлительныеОперации.СообщитьПрогресс(Процент, , РезультатОбработкиСтроки);
				//ВывестиСообщение(НСтр("ru='Создание номенклатуры ""%1""'"), ,,,, ЗаписьПрайсЛиста.Наименование);
			КонецЕсли;
			
			Прогресс = Прогресс + 1;
			
		КонецЦикла;
		
		Если ДиапазонЧеков.МаксНомерЧека > 0 Тогда
			ДиапазоныЧеков.Добавить(ДиапазонЧеков);
		КонецЕсли;
		//ЗафиксироватьТранзакцию();
		
	КонецЦикла;
	
	Попытка
		//Мальцев А.Ю. +++ 
		ТаблицаМарок        = ТаблицыПродаж.ТаблицаМарок;
		Для Каждого стр Из ТаблицаМарок Цикл
			МЗ = РегистрыСведений.МаркиВОборудовании.СоздатьМенеджерЗаписи();
			МЗ.GTIN 			= стр.GTIN;
			МЗ.КодМарки 		= стр.Марка;
			МЗ.МоментИзменения 	= ТекущаяДата();
			МЗ.Удален 			= Истина;
			МЗ.Записать();
		КонецЦикла;
		//Мальцев А.Ю. --- 
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Марки УКМ", УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
		
	КонецПопытки;
	
	
	ЗаписатьТекстВЛог(Формат(ОфлайнОборудование.ИндексМагазина,"ЧГ=0"),"Загрузка чеков. Конец.");
КонецПроцедуры

Процедура ПриЗагрузкеОтчетовОПродаже(ТаблицыПродаж, ОфлайнОборудование, ЗакрытыеСмены, Отказ, ТекстОшибки, ВыводитьПрогресс = Ложь) Экспорт
	ЗаписатьТекстВЛог(Формат(ОфлайнОборудование.ИндексМагазина,"ЧГ=0"),"Загрузка смен. Начало.");
	
	ТаблицаСмен           = ТаблицыПродаж.ТаблицаСмен;
	ТаблицаПродаж         = ТаблицыПродаж.ТаблицаСводныхПродаж;
	ТаблицаОплат          = ТаблицыПродаж.ТаблицаСводныхОплат;
	ТаблицаСводныхСкидок  = ТаблицыПродаж.ТаблицаСводныхСкидок;
	ТаблицаВозвратов      = ТаблицыПродаж.ТаблицаСводныхВозвратов;
	ТаблицаВозвратовОплат = ТаблицыПродаж.ТаблицаСводныхВозвратовОплат;
	
	ТаблицаКассККМ   = ПолучитьКассыККМ(ОфлайнОборудование);
	
	
	Если ОфлайнОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.УКМ5 Тогда
		ТаблицаСтавокНДС = ПолучитьСтавкиНДСУКП5();
	Иначе	
		ТаблицаСтавокНДС = ПолучитьСтавкиНДС();
	КонецЕсли;
	
	ТаблицаКассиров = Новый ТаблицаЗначений;
	ТаблицаКассиров.Колонки.Добавить("Код");
	ТаблицаКассиров.Колонки.Добавить("Кассир");
	
	ТаблицаСкидок = Новый ТаблицаЗначений;
	ТаблицаСкидок.Колонки.Добавить("Код");
	ТаблицаСкидок.Колонки.Добавить("Скидка");
	ТаблицаСкидок.Колонки.Добавить("ДисконтнаяКарта");
	ТаблицаСкидок.Колонки.Добавить("ЗначениеСкидки");
	ТаблицаСкидок.Колонки.Добавить("СпособВычисления");
	ТаблицаСкидок.Колонки.Добавить("НаДокумент");
	ТаблицаСкидок.Колонки.Добавить("Абсолютная");
	
	ТаблицаЕдиниц = Новый ТаблицаЗначений;
	ТаблицаЕдиниц.Колонки.Добавить("Наименование");
	ТаблицаЕдиниц.Колонки.Добавить("Единица");
	
	ПараметрыДействия = Новый Структура;
	
	Для Каждого ТекущаяСмена Из ТаблицаСмен Цикл
		
		СтрокаКассыККМ = ТаблицаКассККМ.Найти(ТекущаяСмена.НомерКассы, "НомерКассы");
		Если СтрокаКассыККМ = Неопределено Тогда
			КассаККМ = Справочники.КассыККМ.ПолучитьКассуККМОборудования(ОфлайнОборудование, ТекущаяСмена.НомерКассы);
		Иначе
			КассаККМ = СтрокаКассыККМ.Ссылка;
		КонецЕсли;
		
		СтрокаКассира = ТаблицаКассиров.Найти(ТекущаяСмена.КассирЗакрыл, "Код");
		Если СтрокаКассира = Неопределено Тогда
			Кассир = ПолучитьКассираЧека(ТекущаяСмена.КассирЗакрыл);
			СтрокаКассира = ТаблицаКассиров.Добавить();
			СтрокаКассира.Код    = ТекущаяСмена.КассирЗакрыл;
			СтрокаКассира.Кассир = Кассир;
		КонецЕсли;
		
		КассоваяСмена = СоздатьЗакрытиеСмены(КассаККМ, СтрокаКассира.Кассир, ОфлайнОборудование, ТекущаяСмена);
		//ДиапазонЧеков = ПолучитьДиапазонЧеков();
		//ДиапазонЧеков.НомерКассы   = ТекущаяСмена.НомерКассы;
		//ДиапазонЧеков.НомерСмены   = ТекущаяСмена.НомерСмены;
		//ДиапазонЧеков.МинНомерЧека = 0;
		//ДиапазонЧеков.МаксНомерЧека  = 0;
		
		КоличествоСтрок = ТаблицаПродаж.Количество();
		Пока КоличествоСтрок>0 Цикл
			ТекущаяСтрока = ТаблицаПродаж[0];
			// Стабилизируем таблицу продаж
			// Уберем строки для которых не нашли шапку чека
			Пока ТекущаяСмена.НомерКассы > ТекущаяСтрока.НомерКассы Цикл
				ТаблицаПродаж.Удалить(0);
				КоличествоСтрок = КоличествоСтрок - 1;
				Если КоличествоСтрок = 0 Тогда
					Прервать;
				КонецЕсли;
				ТекущаяСтрока = ТаблицаПродаж[0];
			КонецЦикла;
			
			Если КоличествоСтрок = 0 ИЛИ НЕ ТекущаяСмена.НомерКассы = ТекущаяСтрока.НомерКассы Тогда
				Прервать;
			КонецЕсли;
			
			Пока ТекущаяСмена.ИдСмены > ТекущаяСтрока.ИдСмены Цикл
				ТаблицаПродаж.Удалить(0);
				КоличествоСтрок = КоличествоСтрок - 1;
				Если КоличествоСтрок = 0 Тогда
					Прервать;
				КонецЕсли;
				ТекущаяСтрока = ТаблицаПродаж[0];
			КонецЦикла;
			
			Если НЕ ТекущаяСмена.ИдСмены = ТекущаяСтрока.ИдСмены Тогда
				Прервать;
			КонецЕсли;
			
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", ТекущаяСтрока.Артикул);
			
			//Мальцев А.Ю. +++ VRM        				
			Если Не ЗначениеЗаполнено(Номенклатура) Тогда
				
				// Поиск объектов по штрихкоду.
				ОбъектыПоШтрихкоду = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(ТекущаяСтрока.Артикул,,Истина);
				Если ОбъектыПоШтрихкоду.Количество() > 0 Тогда
					Номенклатура = ОбъектыПоШтрихкоду[0].Объект;	
				Конецесли;
				
			КонецЕсли;
			//Мальцев А.Ю. --- VRM     			
			
			//Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			//	КоличествоПродаж = КоличествоПродаж - 1;
			//	ТаблицаПродаж.Удалить(0);
			//	Продолжить;
			//КонецЕсли;
			
			НоваяСтрока = КассоваяСмена.Товары.Добавить();
			
			НоваяСтрока.МестоРазмещения     = КассоваяСмена.СкладКомпании;
			НоваяСтрока.Номенклатура        = Номенклатура;
			//НоваяСтрока.ИдентификаторСтроки = ТекущаяСтрока.ИДСтроки;
			// Производим корректировку и заполнение связанных аналитик в строке
			ОбработкаТабличнойЧастиТовары.ОбработатьИзменениеНоменклатура(КассоваяСмена, НоваяСтрока, ПараметрыДействия);
			
			//НоваяСтрока.ЕдиницаИзмерения = Номенклатура.ОсновнаяЕдиницаИзмерения;
			НоваяСтрока.ЕдиницаИзмерения = ПолучитьОсновнуюЕдиницуПоБазовой(Номенклатура);
			//Если ТекущаяСтрока.Единица = "" Тогда
			//	Если ЗначениеЗаполнено(Номенклатура.ОсновнаяЕдиницаИзмерения) Тогда
			//		НоваяСтрока.ЕдиницаИзмерения = Номенклатура.ОсновнаяЕдиницаИзмерения;
			//	Иначе
			//		НоваяСтрока.ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(Номенклатура);
			//	КонецЕсли;
			//Иначе
			//	СтрокаЕдиницы = ТаблицаЕдиниц.Найти(ТекущаяСтрока.Единица, "Наименование");
			//	Если СтрокаЕдиницы = Неопределено Тогда
			//		Единица = ПолучитьЕдиницу(ТекущаяСтрока.Единица);
			//		СтрокаЕдиницы = ТаблицаЕдиниц.Добавить();
			//		СтрокаЕдиницы.Наименование = ТекущаяСтрока.Единица;
			//		СтрокаЕдиницы.Единица      = Единица;
			//	КонецЕсли;
			//	
			//	НоваяСтрока.ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(Номенклатура, СтрокаЕдиницы.Единица, СтрокаЕдиницы.Наименование);
			//КонецЕсли;
			НоваяСтрока.Коэффициент       = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
			НоваяСтрока.КоличествоВозврат = ТекущаяСтрока.КоличествоВозврат;
			НоваяСтрока.КоличествоПродано = ТекущаяСтрока.Количество;
			НоваяСтрока.Количество        = ТекущаяСтрока.Количество;
			
			Документы.ЗакрытиеСмены.ТоварыКоличествоПриИзменении(КассоваяСмена, НоваяСтрока);
			НоваяСтрока.Цена       = ТекущаяСтрока.Цена;
			Документы.ЗакрытиеСмены.ТоварыЦенаПриИзменении(КассоваяСмена, НоваяСтрока);
			НоваяСтрока.СтавкаНДС = ПолучитьСтавкуНДС(ТаблицаСтавокНДС, ТекущаяСтрока.СтавкаНДС);
			Документы.ЗакрытиеСмены.ТоварыСтавкаНДСПриИзменении(КассоваяСмена, НоваяСтрока);
			НоваяСтрока.Сумма       = ТекущаяСтрока.Сумма;
			НоваяСтрока.СуммаСкидки = ТекущаяСтрока.СуммаСкидки;
			НоваяСтрока.СуммаВсего  = ТекущаяСтрока.СуммаВсего;
			Ставка = НоваяСтрока.СтавкаНДС.Ставка;
			НоваяСтрока.СуммаНДС    = Окр((НоваяСтрока.СуммаВсего * Ставка)/(100 + Ставка), 2);
			
			Если НоваяСтрока.СуммаСкидки>0 Тогда
				СуммаБезСкидки = СкидкиНаценкиСервер.ПолучитьСуммуСтрокиБезСкидок(КассоваяСмена, НоваяСтрока, "Товары");
				НоваяСтрока.ПроцентСкидки = ?(СуммаБезСкидки = 0, 0, НоваяСтрока.СуммаСкидки*100/СуммаБезСкидки);
			КонецЕсли;
			
			НоваяСтрока.КоличествоЧеков = ТекущаяСтрока.КоличествоЧеков;
			
			ТаблицаПродаж.Удалить(0);
			
			КоличествоСтрок = КоличествоСтрок - 1;
		КонецЦикла;
		
		ИтогиОперации = Документы.ЗакрытиеСмены.РассчитатьИтогиОперации(КассоваяСмена);
		ЗаполнитьЗначенияСвойств(КассоваяСмена, ИтогиОперации);
		
		КоличествоОплат = ТаблицаОплат.Количество();
		Пока КоличествоОплат>0 Цикл
			СтрокаОплаты = ТаблицаОплат[0];
			
			Пока ТекущаяСмена.НомерКассы > СтрокаОплаты.НомерКассы Цикл
				ТаблицаОплат.Удалить(0);
				КоличествоОплат = КоличествоОплат - 1;
				Если КоличествоОплат = 0 Тогда
					Прервать;
				КонецЕсли;
				СтрокаОплаты = ТаблицаОплат[0];
			КонецЦикла;
			
			Если КоличествоОплат = 0 ИЛИ НЕ ТекущаяСмена.НомерКассы = СтрокаОплаты.НомерКассы Тогда
				Прервать;
			КонецЕсли;
			
			Пока ТекущаяСмена.ИдСмены > СтрокаОплаты.ИдСмены Цикл
				ТаблицаОплат.Удалить(0);
				КоличествоОплат = КоличествоОплат - 1;
				Если КоличествоОплат = 0 Тогда
					Прервать;
				КонецЕсли;
				СтрокаОплаты = ТаблицаОплат[0];
			КонецЦикла;
			
			Если НЕ ТекущаяСмена.ИдСмены = СтрокаОплаты.ИдСмены Тогда
				Прервать;
			КонецЕсли;
			
			НоваяСтрока = КассоваяСмена.Оплаты.Добавить();
			
			Если СтрокаОплаты.ИДУстройства = 0 Тогда
				НоваяСтрока.ТипОплаты = Справочники.ТипыОплат.Наличные;
			Иначе
				НоваяСтрока.ТипОплаты = Справочники.ТипыОплат.Безналичные;
				Карточка = ПолучитьКарточку(СтрокаОплаты.НомерКарты);
				Если ЗначениеЗаполнено(Карточка) Тогда
					НоваяСтрока.Карточка   = Карточка;
					Если ТипЗнч(Карточка.Объект) = Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Тогда
						НоваяСтрока.ДоговорВзаиморасчетов = Карточка.Объект;
						НоваяСтрока.Контрагент            = Карточка.Объект.Владелец;
					ИначеЕсли ТипЗнч(Карточка.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
						НоваяСтрока.Контрагент = Карточка.Объект;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			НоваяСтрока.Сумма           = СтрокаОплаты.СуммаПлатежа;
			НоваяСтрока.СуммаВозврат    = СтрокаОплаты.СуммаПлатежаВозврат;
			НоваяСтрока.Касса           = КассоваяСмена.КассаККМ;
			НоваяСтрока.КоличествоЧеков = СтрокаОплаты.КоличествоЧеков;
			
			ТаблицаОплат.Удалить(0);
			
			КоличествоОплат = КоличествоОплат - 1;
		КонецЦикла;
		
		КоличествоСтрок = ТаблицаСводныхСкидок.Количество();
		Пока КоличествоСтрок>0 Цикл
			ТекущаяСтрока = ТаблицаСводныхСкидок[0];
			
			Пока ТекущаяСмена.НомерКассы > ТекущаяСтрока.НомерКассы Цикл
				ТаблицаСводныхСкидок.Удалить(0);
				КоличествоСтрок = КоличествоСтрок - 1;
				Если КоличествоСтрок = 0 Тогда
					Прервать;
				КонецЕсли;
				ТекущаяСтрока = ТаблицаСводныхСкидок[0];
			КонецЦикла;
			
			Если НЕ ТекущаяСмена.НомерКассы = ТекущаяСтрока.НомерКассы Тогда
				Прервать;
			КонецЕсли;
			
			Пока ТекущаяСмена.ИдСмены > ТекущаяСтрока.ИдСмены Цикл
				ТаблицаСводныхСкидок.Удалить(0);
				КоличествоСтрок = КоличествоСтрок - 1;
				Если КоличествоСтрок = 0 Тогда
					Прервать;
				КонецЕсли;
				ТекущаяСтрока = ТаблицаСводныхСкидок[0];
			КонецЦикла;
			
			Если НЕ ТекущаяСмена.ИдСмены = ТекущаяСтрока.ИдСмены Тогда
				Прервать;
			КонецЕсли;
			
			СтрокаСкидки = ТаблицаСкидок.Найти(ТекущаяСтрока.Скидка, "Код");
			Если СтрокаСкидки = Неопределено Тогда
				ПараметрыСкидки = ПолучитьСкидку(ТекущаяСтрока.Скидка);
				СтрокаСкидки = ТаблицаСкидок.Добавить();
				СтрокаСкидки.Код              = ТекущаяСтрока.Скидка;
				СтрокаСкидки.Скидка           = ПараметрыСкидки.Скидка;
				СтрокаСкидки.ДисконтнаяКарта  = ПараметрыСкидки.ДисконтнаяКарта;
				СтрокаСкидки.ЗначениеСкидки   = ПараметрыСкидки.ЗначениеСкидки;
				СтрокаСкидки.СпособВычисления = ПараметрыСкидки.СпособВычисления;
				СтрокаСкидки.НаДокумент       = ПараметрыСкидки.НаДокумент;
				СтрокаСкидки.Абсолютная       = ПараметрыСкидки.Абсолютная;
			КонецЕсли;
			
			НоваяСтрока = КассоваяСмена.Скидки.Добавить();
			НоваяСтрока.СкидкаНаценка   = СтрокаСкидки.Скидка;
			НоваяСтрока.Сумма           = ТекущаяСтрока.СуммаВсего-ТекущаяСтрока.СуммаСкидки;
			НоваяСтрока.СуммаСкидки     = ТекущаяСтрока.СуммаСкидки;
			НоваяСтрока.СуммаВсего      = ТекущаяСтрока.СуммаВсего;
			НоваяСтрока.КоличествоЧеков = ТекущаяСтрока.КоличествоЧеков;
			НоваяСтрока.Карточка        = ПараметрыСкидки.ДисконтнаяКарта;
			
			ТаблицаСводныхСкидок.Удалить(0);
			
			КоличествоСтрок = КоличествоСтрок - 1;
		КонецЦикла;
		
		КоличествоСтрок = ТаблицаВозвратов.Количество();
		Пока КоличествоСтрок>0 Цикл
			ТекущаяСтрока = ТаблицаВозвратов[0];
			
			Пока ТекущаяСмена.НомерКассы > ТекущаяСтрока.НомерКассы Цикл
				ТаблицаВозвратов.Удалить(0);
				КоличествоСтрок = КоличествоСтрок - 1;
				Если КоличествоСтрок = 0 Тогда
					Прервать;
				КонецЕсли;
				ТекущаяСтрока = ТаблицаВозвратов[0];
			КонецЦикла;
			
			Если КоличествоСтрок = 0 ИЛИ НЕ ТекущаяСмена.НомерКассы = ТекущаяСтрока.НомерКассы Тогда
				Прервать;
			КонецЕсли;
			
			Пока ТекущаяСмена.ИдСмены > ТекущаяСтрока.ИдСмены Цикл
				ТаблицаВозвратов.Удалить(0);
				КоличествоСтрок = КоличествоСтрок - 1;
				Если КоличествоСтрок = 0 Тогда
					Прервать;
				КонецЕсли;
				ТекущаяСтрока = ТаблицаВозвратов[0];
			КонецЦикла;
			
			Если НЕ ТекущаяСмена.ИдСмены = ТекущаяСтрока.ИдСмены Тогда
				Прервать;
			КонецЕсли;
			
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", ТекущаяСтрока.Артикул);
			//Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			//	КоличествоПродаж = КоличествоПродаж - 1;
			//	ТаблицаПродаж.Удалить(0);
			//	Продолжить;
			//КонецЕсли;
			
			НоваяСтрока = КассоваяСмена.Возвраты.Добавить();
			НоваяСтрока.МестоРазмещения     = КассоваяСмена.СкладКомпании;
			НоваяСтрока.Номенклатура        = Номенклатура;
			// Производим корректировку и заполнение связанных аналитик в строке
			ОбработкаТабличнойЧастиТовары.ОбработатьИзменениеНоменклатура(КассоваяСмена, НоваяСтрока, ПараметрыДействия);
			НоваяСтрока.ЕдиницаИзмерения = Номенклатура.ОсновнаяЕдиницаИзмерения;
			//Если ТекущаяСтрока.Единица = "" Тогда
			//	Если ЗначениеЗаполнено(Номенклатура.ОсновнаяЕдиницаИзмерения) Тогда
			//		НоваяСтрока.ЕдиницаИзмерения = Номенклатура.ОсновнаяЕдиницаИзмерения;
			//	Иначе
			//		НоваяСтрока.ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(Номенклатура);
			//	КонецЕсли;
			//Иначе
			//	СтрокаЕдиницы = ТаблицаЕдиниц.Найти(ТекущаяСтрока.Единица, "Наименование");
			//	Если СтрокаЕдиницы = Неопределено Тогда
			//		Единица = ПолучитьЕдиницу(ТекущаяСтрока.Единица);
			//		СтрокаЕдиницы = ТаблицаЕдиниц.Добавить();
			//		СтрокаЕдиницы.Наименование = ТекущаяСтрока.Единица;
			//		СтрокаЕдиницы.Единица      = Единица;
			//	КонецЕсли;
			//	
			//	НоваяСтрока.ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(Номенклатура, СтрокаЕдиницы.Единица, СтрокаЕдиницы.Наименование);
			//КонецЕсли;
			НоваяСтрока.Коэффициент       = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
			НоваяСтрока.Количество        = ТекущаяСтрока.Количество;
			Документы.ЗакрытиеСмены.ВозвратыКоличествоПриИзменении(КассоваяСмена, НоваяСтрока);
			НоваяСтрока.Цена              = ТекущаяСтрока.Цена;
			Документы.ЗакрытиеСмены.ВозвратыЦенаПриИзменении(КассоваяСмена, НоваяСтрока);
			НоваяСтрока.СтавкаНДС   = ПолучитьСтавкуНДС(ТаблицаСтавокНДС, ТекущаяСтрока.СтавкаНДС);
			Документы.ЗакрытиеСмены.ВозвратыСтавкаНДСПриИзменении(КассоваяСмена, НоваяСтрока);
			НоваяСтрока.Сумма       = ТекущаяСтрока.Сумма;
			НоваяСтрока.СуммаСкидки = ТекущаяСтрока.СуммаСкидки;
			НоваяСтрока.СуммаВсего  = ТекущаяСтрока.СуммаВсего;
			
			Если НоваяСтрока.СуммаСкидки>0 Тогда
				СуммаБезСкидки = СкидкиНаценкиСервер.ПолучитьСуммуСтрокиБезСкидок(КассоваяСмена, НоваяСтрока, "Товары");
				НоваяСтрока.ПроцентСкидки = ?(СуммаБезСкидки = 0, 0, НоваяСтрока.СуммаСкидки*100/СуммаБезСкидки);
			КонецЕсли;
			
			НоваяСтрока.КоличествоЧеков = ТекущаяСтрока.КоличествоЧеков;
			
			ТаблицаВозвратов.Удалить(0);
			
			КоличествоСтрок = КоличествоСтрок - 1;
		КонецЦикла;
		
		КоличествоОплат = ТаблицаВозвратовОплат.Количество();
		Пока КоличествоОплат>0 Цикл
			СтрокаОплаты = ТаблицаВозвратовОплат[0];
			
			Пока ТекущаяСмена.НомерКассы > СтрокаОплаты.НомерКассы Цикл
				ТаблицаВозвратовОплат.Удалить(0);
				КоличествоОплат = КоличествоОплат - 1;
				Если КоличествоОплат = 0 Тогда
					Прервать;
				КонецЕсли;
				СтрокаОплаты = ТаблицаВозвратовОплат[0];
			КонецЦикла;
			
			Если КоличествоОплат = 0 ИЛИ НЕ ТекущаяСмена.НомерКассы = СтрокаОплаты.НомерКассы Тогда
				Прервать;
			КонецЕсли;
			
			Пока ТекущаяСмена.ИдСмены > СтрокаОплаты.ИдСмены Цикл
				ТаблицаВозвратовОплат.Удалить(0);
				КоличествоОплат = КоличествоОплат - 1;
				Если КоличествоОплат = 0 Тогда
					Прервать;
				КонецЕсли;
				СтрокаОплаты = ТаблицаВозвратовОплат[0];
			КонецЦикла;
			
			Если НЕ ТекущаяСмена.ИдСмены = СтрокаОплаты.ИдСмены Тогда
				Прервать;
			КонецЕсли;
			
			НоваяСтрока = КассоваяСмена.ВозвратОплаты.Добавить();
			Если СтрокаОплаты.ИДУстройства = 0 Тогда
				НоваяСтрока.ТипОплаты = Справочники.ТипыОплат.Наличные;
			Иначе
				НоваяСтрока.ТипОплаты = Справочники.ТипыОплат.Безналичные;
				Карточка = ПолучитьКарточку(СтрокаОплаты.НомерКарты);
				Если ЗначениеЗаполнено(Карточка) Тогда
					НоваяСтрока.Карточка   = Карточка;
					Если ТипЗнч(Карточка.Объект) = Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Тогда
						НоваяСтрока.ДоговорВзаиморасчетов = Карточка.Объект;
						НоваяСтрока.Контрагент            = Карточка.Объект.Владелец;
					ИначеЕсли ТипЗнч(Карточка.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
						НоваяСтрока.Контрагент = Карточка.Объект;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			НоваяСтрока.Сумма           = СтрокаОплаты.СуммаПлатежа;
			НоваяСтрока.Касса           = КассоваяСмена.КассаККМ;
			НоваяСтрока.КоличествоЧеков = СтрокаОплаты.КоличествоЧеков;
			
			ТаблицаВозвратовОплат.Удалить(0);
			
			КоличествоОплат = КоличествоОплат - 1;
		КонецЦикла;
		
		Если Не КассоваяСмена.Ссылка.Пустая() И КассоваяСмена.Ссылка.Проведен Тогда
			
			Если КассоваяСмена.Ссылка.Товары.Итог("Сумма") 			= КассоваяСмена.Товары.Итог("Сумма") И
			     КассоваяСмена.Ссылка.Оплаты.Итог("Сумма") 			= КассоваяСмена.Оплаты.Итог("Сумма") И
				 КассоваяСмена.Ссылка.Скидки.Итог("Сумма") 			= КассоваяСмена.Скидки.Итог("Сумма") И
				 КассоваяСмена.Ссылка.Контрагенты.Итог("Сумма") 	= КассоваяСмена.Контрагенты.Итог("Сумма") И
				 КассоваяСмена.Ссылка.Возвраты.Итог("Сумма") 		= КассоваяСмена.Возвраты.Итог("Сумма") И
				 КассоваяСмена.Ссылка.ВозвратОплаты.Итог("Сумма") 	= КассоваяСмена.ВозвратОплаты.Итог("Сумма") Тогда
				 
				 СтруктураСмены = Новый Структура;
				 СтруктураСмены.Вставить("НомерКассы", ТекущаяСмена.НомерКассы);
				 СтруктураСмены.Вставить("ИдСмены",    ТекущаяСмена.ИдСмены);
				 СтруктураСмены.Вставить("НомерСмены", ТекущаяСмена.НомерСмены);
				
				 ЗакрытыеСмены.Добавить(СтруктураСмены);
				
				Продолжить;
				 
			КонецЕсли;
			
		КонецЕсли;
		
		//Если СуммаКонтроль > 0 И СуммаКонтроль = КассоваяСмена.СуммаДокумента И КассоваяСмена.Проведен Тогда
		//	
		//	СтруктураСмены = Новый Структура;
		//	СтруктураСмены.Вставить("НомерКассы", ТекущаяСмена.НомерКассы);
		//	СтруктураСмены.Вставить("ИдСмены",    ТекущаяСмена.ИдСмены);
		//	СтруктураСмены.Вставить("НомерСмены", ТекущаяСмена.НомерСмены);
		//	
		//	ЗакрытыеСмены.Добавить(СтруктураСмены);
		//	
		//	Продолжить;
		//	
		//КонецЕсли;
		
		Попытка
			Если КассоваяСмена.Проведен Тогда
				КассоваяСмена.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Иначе
				КассоваяСмена.УстановитьНовыйНомер();
				КассоваяСмена.ОбменДанными.Загрузка = Истина;
				КассоваяСмена.Записать(РежимЗаписиДокумента.Запись);
				КассоваяСмена.ОбменДанными.Загрузка = Ложь;
			КонецЕсли;
		Исключение
			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1'"), ТекстОшибки);
			Продолжить;
		КонецПопытки;
		
		Попытка
			Если НЕ ВыполнитьСверткуЧеков(КассоваяСмена) Тогда
				Продолжить;
			КонецЕсли;
			
			КассоваяСмена.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			
			СтруктураСмены = Новый Структура;
			СтруктураСмены.Вставить("НомерКассы", ТекущаяСмена.НомерКассы);
			СтруктураСмены.Вставить("ИдСмены",    ТекущаяСмена.ИдСмены);
			СтруктураСмены.Вставить("НомерСмены", ТекущаяСмена.НомерСмены);
			
			ЗакрытыеСмены.Добавить(СтруктураСмены);
			
			ТекУзел = ПланыОбмена.итЗакрытиеКассовыхСмен.НайтиПоКоду("ЗКС");
			Если ЗначениеЗаполнено(ТекУзел) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(ТекУзел, КассоваяСмена.Ссылка); 
			КонецЕсли;	
		
		Исключение
			////Отказ       = Истина;
			//ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			//ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1'"), ТекстОшибки);
			Отказ 	= Истина;
			Ошибка  = ОписаниеОшибки();
			ТекстОшибки = "Не удалось провести документ: " + СокрЛП(КассоваяСмена) + ", по причине: " + Ошибка;
			ЗаписьЖурналаРегистрации("Загрузка данных касс УКМ", УровеньЖурналаРегистрации.Ошибка,,КассоваяСмена.Ссылка,ТекстОшибки);				
			Продолжить;
		КонецПопытки;
		
		ЗначениеУчетнойПолитики = ПолучитьЗначениеУчетнойПолитики("МагазинИспользуетОтдельнуюКассуПодразделения", КассоваяСмена.ПодразделениеКомпании, КассоваяСмена.Дата, Ложь);
		Если ЗначениеУчетнойПолитики = Истина Тогда
			СоздатьПКОПоЗакрытиюСмены(КассоваяСмена, Отказ, ТекстОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписатьТекстВЛог(Формат(ОфлайнОборудование.ИндексМагазина,"ЧГ=0"),"Загрузка смен. Конец.");
КонецПроцедуры

Процедура СоздатьПКОПоЗакрытиюСмены(КассоваяСмена, Отказ, ТекстОшибки) Экспорт
	
	Если НЕ КассоваяСмена.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", КассоваяСмена.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПриходныйКассовыйОрдер.Ссылка КАК ПКО
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	               |ГДЕ
	               |	ПриходныйКассовыйОрдер.ДокументОснование = &ДокументОснование
	               |	И НЕ ПриходныйКассовыйОрдер.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ПКО) Тогда
		обПКО = Выборка.ПКО.ПолучитьОбъект();
	Иначе
		обПКО = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
		обПКО.ДокументОснование = КассоваяСмена.Ссылка;
	КонецЕсли;
	
	Если НЕ обПКО.Дата = КонецДня(КассоваяСмена.Дата) Тогда
		обПКО.Дата = КассоваяСмена.Дата+1;
	Иначе
		обПКО.Дата = КассоваяСмена.Дата;
	КонецЕсли;
	обПКО.Заполнить(КассоваяСмена.Ссылка);
	Если ЗначениеЗаполнено(обПКО.Номер) = Ложь Тогда
		обПКО.УстановитьНовыйНомер();
	КонецЕсли;
	обПКО.Контрагент = Справочники.Контрагенты.НайтиПоКоду("ЦБ0001418"); // Розничный покупатель
	Документы.ПриходныйКассовыйОрдер.КонтрагентПриИзменении(обПКО);
	
	обПКО.КассаККМ      = КассоваяСмена.КассаККМ;
	обПКО.КассаКомпании = ПолучитьКассу(КассоваяСмена.Организация, КассоваяСмена.ПодразделениеКомпании);
	обПКО.СтатьяДДС = Справочники.СтатьиДДС.РозничнаяВыручка;
	обПКО.Автор = КассоваяСмена.Автор;
	
	обПКО.ОбменДанными.Загрузка = Истина;
	Попытка
		обПКО.Записать(РежимЗаписиДокумента.Запись);
	Исключение
	КонецПопытки;
	
	обПКО.ОбменДанными.Загрузка = Ложь;
	Попытка
		обПКО.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		//Отказ 	= Истина;
		Ошибка  = ОписаниеОшибки();
		ТекстОшибки = "Не удалось провести документ: " + СокрЛП(обПКО) + ", по причине: " + Ошибка;
		ЗаписьЖурналаРегистрации("Загрузка данных касс УКМ", УровеньЖурналаРегистрации.Ошибка,,обПКО.Ссылка,ТекстОшибки);	
	КонецПопытки;
	
КонецПроцедуры

Процедура СоздатьРКОПоИнкассации(Инкассация, ПараметрыЗаполнения = Неопределено, Отказ, ТекстОшибки) Экспорт
	
	Если НЕ Инкассация.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	//Мальцев А.Ю.+++
	РКО   = НайтиРКО(Инкассация.Ссылка);	
	Если РКО = НЕОПРЕДЕЛЕНО Тогда	
		обРКО = Документы.РасходныйКассовыйОрдер.СоздатьДокумент();		
	ИначеЕсли РКО.Проведен Тогда
		Возврат;
	Иначе
		обРКО = РКО.ПолучитьОбъект();
	КонецЕсли;
	
	//обРКО = Документы.РасходныйКассовыйОрдер.СоздатьДокумент();		
	
	//Мальцев А.Ю.---
	
	обРКО.ДокументОснование = Инкассация.Ссылка;
	обРКО.Дата              = Инкассация.Дата;
	обРКО.Заполнить(Инкассация.Ссылка);
	Если ЗначениеЗаполнено(обРКО.Номер) = Ложь Тогда
		обРКО.УстановитьНовыйНомер();
	КонецЕсли;
	обРКО.Контрагент = Инкассация.Инкассатор;
	Документы.РасходныйКассовыйОрдер.КонтрагентПриИзменении(обРКО);
	
	обРКО.КассаККМ      = Инкассация.КассаККМ;
	обРКО.КассаКомпании = ПолучитьКассу(Инкассация.Организация, Инкассация.ПодразделениеКомпании);
	обРКО.СтатьяДДС     = Справочники.СтатьиДДС.Инкассация;
	обРКО.Автор         = Инкассация.Автор;
	Если ЗначениеЗаполнено(обРКО.ПодразделениеКомпании.ит_ДополнительнаяКасса) Тогда
		обРКО.Основание		= "Перемещение ДС между кассами";
	Иначе
		обРКО.Основание		= "Изъятие из кассы ККТ";
	КонецЕсли;
	обРКО.Комментарий	= СокрЛП(Инкассация.Ссылка);
	Если ЗначениеЗаполнено(ПараметрыЗаполнения) Тогда
		Для каждого Параметр из ПараметрыЗаполнения Цикл
			обРКО[Параметр.Ключ] = Параметр.Значение;
			// Вызываем обработчик изменения данных объекта
			ПараметрыВыполнения = Новый Массив;
			ПараметрыВыполнения.Добавить(обРКО);
			Попытка
				РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации("Документы.РасходныйКассовыйОрдер."+Параметр.Ключ+"ПриИзменении", ПараметрыВыполнения);
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	обРКО.ОбменДанными.Загрузка = Истина;
	Попытка
		обРКО.Записать(РежимЗаписиДокумента.Запись);
	Исключение
	КонецПопытки;
	
	обРКО.ОбменДанными.Загрузка = Ложь;
	Попытка
		обРКО.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		//Отказ 	= Истина;
		Ошибка  = ОписаниеОшибки();
		ТекстОшибки = "Не удалось провести документ: " + СокрЛП(обРКО) + ", по причине: " + Ошибка;
		ЗаписьЖурналаРегистрации("Загрузка данных касс УКМ", УровеньЖурналаРегистрации.Ошибка,,обРКО.Ссылка,ТекстОшибки);			
	КонецПопытки;
	
КонецПроцедуры

Процедура СоздатьПКОПоИнкассации(Инкассация, ПараметрыЗаполнения = Неопределено, Отказ, ТекстОшибки) Экспорт
	
	Если НЕ Инкассация.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	//Мальцев А.Ю.+++
	ПКО   = НайтиПКО(Инкассация.Ссылка);	
	Если ПКО = НЕОПРЕДЕЛЕНО Тогда	
		обПКО = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();	
	ИначеЕсли ПКО.Проведен Тогда
		Возврат;
	Иначе
		обПКО = ПКО.ПолучитьОбъект();
	КонецЕсли;
	//Мальцев А.Ю.---
	обПКО = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();		

	обПКО.ДокументОснование = Инкассация.Ссылка;
	обПКО.Дата              = Инкассация.Дата;
	обПКО.Заполнить(Инкассация.Ссылка);
	Если ЗначениеЗаполнено(обПКО.Номер) = Ложь Тогда
		обПКО.УстановитьНовыйНомер();
	КонецЕсли;
	обПКО.Контрагент = Инкассация.Инкассатор;
	Документы.ПриходныйКассовыйОрдер.КонтрагентПриИзменении(обПКО);
	
	обПКО.КассаККМ      = Инкассация.КассаККМ;
	обПКО.КассаКомпании = ПолучитьКассу(Инкассация.Организация, Инкассация.ПодразделениеКомпании);
	обПКО.СтатьяДДС     = Справочники.СтатьиДДС.Инкассация;
	обПКО.Автор         = Инкассация.Автор;
	Если ЗначениеЗаполнено(обПКО.ПодразделениеКомпании.ит_ДополнительнаяКасса) Тогда
		обПКО.Основание		= "Перемещение ДС между кассами";
	Иначе
		обПКО.Основание		= "Внесение в кассу ККТ";
	КонецЕсли;
	обПКО.Комментарий	= СокрЛП(Инкассация.Ссылка);
	Если ЗначениеЗаполнено(ПараметрыЗаполнения) Тогда
		Для каждого Параметр из ПараметрыЗаполнения Цикл
			обПКО[Параметр.Ключ] = Параметр.Значение;
			// Вызываем обработчик изменения данных объекта
			ПараметрыВыполнения = Новый Массив;
			ПараметрыВыполнения.Добавить(обПКО);
			Попытка
				РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации("Документы.ПриходныйКассовыйОрдер."+Параметр.Ключ+"ПриИзменении", ПараметрыВыполнения);
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	обПКО.ОбменДанными.Загрузка = Истина;
	Попытка
		обПКО.Записать(РежимЗаписиДокумента.Запись);
	Исключение
	КонецПопытки;
	
	обПКО.ОбменДанными.Загрузка = Ложь;
	Попытка
		обПКО.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		//Отказ 	= Истина;
		Ошибка  = ОписаниеОшибки();
		ТекстОшибки = "Не удалось провести документ: " + СокрЛП(обПКО) + ", по причине: " + Ошибка;
		ЗаписьЖурналаРегистрации("Загрузка данных касс УКМ", УровеньЖурналаРегистрации.Ошибка,,обПКО.Ссылка,ТекстОшибки);						
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьОсновнойДоговор(Контрагент)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	                      |ГДЕ
	                      |	ДоговорыВзаиморасчетов.Владелец = &Владелец
	                      |	И ДоговорыВзаиморасчетов.Основной");
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Процедура ПриЗагрузкеИнкассаций(ДанныеПоИнкассациям, ОфлайнОборудование, Отказ, ТекстОшибки, ВыводитьПрогресс = Ложь) Экспорт
	ЗаписатьТекстВЛог(Формат(ОфлайнОборудование.ИндексМагазина,"ЧГ=0"),"Загрузка инкассаций. Начало.");
	
	ТаблицаСмен       = ДанныеПоИнкассациям.ТаблицаСмен;
	ТаблицаИнкассаций = ДанныеПоИнкассациям.ТаблицаИнкассаций;
	
	ТаблицаКассККМ    = ПолучитьКассыККМ(ОфлайнОборудование);
	
	Контрагент = Справочники.Контрагенты.НайтиПоКоду("ЦБ0001418"); // Розничный покупатель
	
	ТаблицаКассиров = Новый ТаблицаЗначений;
	ТаблицаКассиров.Колонки.Добавить("Код");
	ТаблицаКассиров.Колонки.Добавить("Кассир");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОфлайнОборудование", ОфлайнОборудование);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПодключаемоеОборудование.ОсновнойОтдел КАК ОсновнойОтдел,
	|	ПодключаемоеОборудование.ОсновнойОтдел.ПодразделениеКомпании КАК Подразделение,
	|	ПодключаемоеОборудование.Организация КАК ОрганизацияОборудования,
	|	ПодключаемоеОборудование.ОсновнойОтдел.ПодразделениеКомпании.Организация КАК Организация,
	|	ПодключаемоеОборудование.ОсновнойОтдел.ТипЦенРозничнойТорговли КАК ТипЦенРозничнойТорговли,
	|	ПодключаемоеОборудование.ОсновнойОтдел.ТипЦенРозничнойТорговли.ВалютаЦены КАК ВалютаДокумента
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.Ссылка = &ОфлайнОборудование
	|СГРУППИРОВАТЬ ПО
	|	ПодключаемоеОборудование.Ссылка
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Подразделение           = Выборка.Подразделение;
	Если ЗначениеЗаполнено(Подразделение) И НЕ Подразделение.ПринадлежитЭлементу(Справочники.ПодразделенияКомпании.ОсновноеПодразделение) Тогда
		Возврат;
	КонецЕсли;
	
	ОсновнойОтдел           = Выборка.ОсновнойОтдел;
	ТипЦенРозничнойТорговли = Выборка.ТипЦенРозничнойТорговли;
	ВалютаДокумента         = Выборка.ВалютаДокумента;
	Если ЗначениеЗаполнено(Выборка.ОрганизацияОборудования) Тогда
		Организация = Выборка.ОрганизацияОборудования;
	Иначе
		Организация = Выборка.Организация;
	КонецЕсли;
	
	КассаКомпании = ПолучитьКассу(Организация, Подразделение);
	
	ПараметрыДействия = Новый Структура;
	
	Для Каждого ТекущаяСмена Из ТаблицаИнкассаций Цикл
		
		//СтрокаИнкасация.Вставить("НомерКассы",    Запрос.Fields("CASHNUMBER").Value);
		//СтрокаИнкасация.Вставить("НомерСмены",    Запрос.Fields("ZNUMBER").Value);
		//СтрокаИнкасация.Вставить("НомерДокумента", Запрос.Fields("local_number").Value);
		//СтрокаИнкасация.Вставить("НомерДокументаГлоб", Запрос.Fields("global_number").Value);
		//СтрокаИнкасация.Вставить("Дата",          Запрос.Fields("date").Value);
		//СтрокаИнкасация.Вставить("СуммаВнесения", Запрос.Fields("amount").Value);
		//СтрокаИнкасация.Вставить("СуммаИзъятия",  Запрос.Fields("amount_return").Value);
		//СтрокаИнкасация.Вставить("Кассир",        Запрос.Fields("login").Value);
		
		
		СтрокаКассыККМ = ТаблицаКассККМ.Найти(ТекущаяСмена.НомерКассы, "НомерКассы");
		Если СтрокаКассыККМ = Неопределено Тогда
			КассаККМ = Справочники.КассыККМ.ПолучитьКассуККМОборудования(ОфлайнОборудование, ТекущаяСмена.НомерКассы);
		Иначе
			КассаККМ = СтрокаКассыККМ.Ссылка;
		КонецЕсли;
		
		СтрокаКассира = ТаблицаКассиров.Найти(ТекущаяСмена.Кассир, "Код");
		Если СтрокаКассира = Неопределено Тогда
			Кассир = ПолучитьКассираЧека(ТекущаяСмена.Кассир);
			СтрокаКассира = ТаблицаКассиров.Добавить();
			СтрокаКассира.Код    = ТекущаяСмена.Кассир;
			СтрокаКассира.Кассир = Кассир;
		КонецЕсли;
		
		Автор = СтрокаКассира.Кассир;
		
		//Мальцев А.Ю. +++
		Если ТекущаяСмена.СуммаИзъятия>0 Тогда
			
			Изъятие = НайтиИзъятие(КассаККМ, ОфлайнОборудование, ТекущаяСмена.НомерСмены, ТекущаяСмена.Дата, ТекущаяСмена.НомерДокументаГлоб);
			
		//Мальцев А.Ю. ---
			
			ЗначениеУчетнойПолитики = ПолучитьЗначениеУчетнойПолитики("МагазинИспользуетОтдельнуюКассуПодразделения", Подразделение, ТекущаяСмена.Дата, Истина);
			обИнкассация = НЕОПРЕДЕЛЕНО;
			Если Изъятие = НЕОПРЕДЕЛЕНО Тогда
				обИнкассация = Документы.Инкассация.СоздатьДокумент();
			ИначеЕсли Изъятие.Проведен Тогда
				
				Если ЗначениеУчетнойПолитики = Истина Тогда
					ПараметрыЗаполнения = Новый Структура;
					ПараметрыЗаполнения.Вставить("СтавкаНДС",Справочники.СтавкиНДС.БезНДС);
					ПараметрыЗаполнения.Вставить("Контрагент",Подразделение.ит_КонтрагентКассы);
					ПараметрыЗаполнения.Вставить("ДоговорВзаиморасчетов",ПолучитьОсновнойДоговор(Подразделение.ит_КонтрагентКассы));
					ПараметрыЗаполнения.Вставить("СтатьяДДС",Справочники.СтатьиДДС.ПрочийРасход);
					Если ЗначениеЗаполнено(Подразделение.ит_ДополнительнаяКасса) Тогда
						ПараметрыЗаполнения.Вставить("Выдать",СокрЛП(Подразделение.ит_ДополнительнаяКасса)+", "+СокрЛП(Подразделение.ит_КонтрагентКассы));
					Иначе
						ПараметрыЗаполнения.Вставить("Выдать","Центральная касса, "+СокрЛП(Подразделение.ит_КонтрагентКассы));
					КонецЕсли;
					СоздатьРКОПоИнкассации(Изъятие,ПараметрыЗаполнения, Отказ, ТекстОшибки);
					Если ЗначениеЗаполнено(Подразделение.ит_ДополнительнаяКасса) Тогда
						ПараметрыЗаполнения = Новый Структура;
						ПараметрыЗаполнения.Вставить("КассаКомпании",Подразделение.ит_ДополнительнаяКасса);
						ПараметрыЗаполнения.Вставить("СтавкаНДС",Справочники.СтавкиНДС.БезНДС);
						ПараметрыЗаполнения.Вставить("Контрагент",Подразделение.ит_КонтрагентКассы);
						ПараметрыЗаполнения.Вставить("ДоговорВзаиморасчетов",ПолучитьОсновнойДоговор(Подразделение.ит_КонтрагентКассы));
						ПараметрыЗаполнения.Вставить("СтатьяДДС",Справочники.СтатьиДДС.ПрочийПриход);
						ПараметрыЗаполнения.Вставить("ПринятоОТ",СокрЛП(ПолучитьКассу(Изъятие.Организация, Изъятие.ПодразделениеКомпании))+", "+СокрЛП(Подразделение.ит_КонтрагентКассы));
						СоздатьПКОПоИнкассации(Изъятие, ПараметрыЗаполнения, Отказ, ТекстОшибки);
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				обИнкассация = Изъятие.ПолучитьОбъект();
			КонецЕсли;
			
			//обИнкассация = Документы.Инкассация.СоздатьДокумент();
			Если обИнкассация <> НЕОПРЕДЕЛЕНО Тогда
				обИнкассация.Заполнить(Неопределено);
				обИнкассация.Дата        = ТекущаяСмена.Дата;
				обИнкассация.ХозОперация = Справочники.ХозОперации.ИзъятиеИзКассыККМ;
				Документы.Инкассация.ХозОперацияПриИзменении(обИнкассация, ПараметрыДействия);
				
				обИнкассация.Организация           = Организация;
				обИнкассация.ПодразделениеКомпании = Подразделение;
				Документы.Инкассация.ПодразделениеКомпанииПриИзменении(обИнкассация);
				Если ЗначениеЗаполнено(обИнкассация.Номер) = Ложь Тогда
					обИнкассация.УстановитьНовыйНомер();
				КонецЕсли;
				обИнкассация.Инкассатор = Контрагент;
				Документы.Инкассация.ИнкассаторПриИзменении(обИнкассация);
				обИнкассация.ФР             = ОфлайнОборудование;
				//обИнкассация.КассаКомпании = КассаКомпании;
				//Документы.Инкассация.КассаКомпанииПриИзменении(обИнкассация);
				обИнкассация.СуммаДокумента = ТекущаяСмена.СуммаИзъятия;
				//Документы.Инкассация.СуммаДокументаПриИзменении(обИнкассация);
				обИнкассация.ДатаФР         = ТекущаяСмена.Дата;
				обИнкассация.НомерСмены     = ТекущаяСмена.НомерСмены;
				обИнкассация.НомерДокумента = ТекущаяСмена.НомерДокументаГлоб;
				обИнкассация.КассаККМ       = КассаККМ;
				Документы.Инкассация.КассаККМПриИзменении(обИнкассация);
				обИнкассация.Автор = Автор;
				
				обИнкассация.Оплаты.Очистить();
				НоваяСтрока = обИнкассация.Оплаты.Добавить();
				НоваяСтрока.ТипОплаты = Справочники.ТипыОплат.Наличные;
				НоваяСтрока.Сумма     = ТекущаяСмена.СуммаИзъятия;
				
				обИнкассация.ОбменДанными.Загрузка = Истина;
				Попытка
					обИнкассация.Записать(РежимЗаписиДокумента.Запись);
					ВывестиСообщение("Создан документ: " + СокрЛП(обИнкассация));
				Исключение
				КонецПопытки;
				обИнкассация.ОбменДанными.Загрузка = Ложь;
				Попытка
					обИнкассация.Записать(РежимЗаписиДокумента.Проведение);
					ВывестиСообщение("Проведен документ: " + СокрЛП(обИнкассация));
				Исключение
					//Отказ 	= Истина;
					Ошибка  = ОписаниеОшибки();
					ТекстОшибки = "Не удалось провести документ: " + СокрЛП(обИнкассация) + ", по причине: " + Ошибка;
					ЗаписьЖурналаРегистрации("Загрузка данных касс УКМ", УровеньЖурналаРегистрации.Ошибка,,обИнкассация.Ссылка,ТекстОшибки);					
				КонецПопытки;
				
				Если ЗначениеУчетнойПолитики = Истина Тогда
					ПараметрыЗаполнения = Новый Структура;
					ПараметрыЗаполнения.Вставить("СтавкаНДС",Справочники.СтавкиНДС.БезНДС);
					ПараметрыЗаполнения.Вставить("Контрагент",Подразделение.ит_КонтрагентКассы);
					ПараметрыЗаполнения.Вставить("ДоговорВзаиморасчетов",ПолучитьОсновнойДоговор(Подразделение.ит_КонтрагентКассы));
					ПараметрыЗаполнения.Вставить("СтатьяДДС",Справочники.СтатьиДДС.ПрочийРасход);
					Если ЗначениеЗаполнено(Подразделение.ит_ДополнительнаяКасса) Тогда
						ПараметрыЗаполнения.Вставить("Выдать",СокрЛП(Подразделение.ит_ДополнительнаяКасса)+", "+СокрЛП(Подразделение.ит_КонтрагентКассы));
					Иначе
						ПараметрыЗаполнения.Вставить("Выдать","Центральная касса, "+СокрЛП(Подразделение.ит_КонтрагентКассы));
					КонецЕсли;
					СоздатьРКОПоИнкассации(обИнкассация,ПараметрыЗаполнения, Отказ, ТекстОшибки);
					Если ЗначениеЗаполнено(Подразделение.ит_ДополнительнаяКасса) Тогда
						ПараметрыЗаполнения = Новый Структура;
						ПараметрыЗаполнения.Вставить("КассаКомпании",Подразделение.ит_ДополнительнаяКасса);
						ПараметрыЗаполнения.Вставить("СтавкаНДС",Справочники.СтавкиНДС.БезНДС);
						ПараметрыЗаполнения.Вставить("Контрагент",Подразделение.ит_КонтрагентКассы);
						ПараметрыЗаполнения.Вставить("ДоговорВзаиморасчетов",ПолучитьОсновнойДоговор(Подразделение.ит_КонтрагентКассы));
						ПараметрыЗаполнения.Вставить("СтатьяДДС",Справочники.СтатьиДДС.ПрочийПриход);
						ПараметрыЗаполнения.Вставить("ПринятоОТ",СокрЛП(ПолучитьКассу(обИнкассация.Организация, обИнкассация.ПодразделениеКомпании))+", "+СокрЛП(Подразделение.ит_КонтрагентКассы));
						СоздатьПКОПоИнкассации(обИнкассация, ПараметрыЗаполнения, Отказ, ТекстОшибки);
					КонецЕсли;
				КонецЕсли;
			 КонецЕсли;
		КонецЕсли;
		
		//Мальцев А.Ю. +++
		Если ТекущаяСмена.СуммаВнесения>0  Тогда
			
			Внесение = НайтиВнесение(КассаККМ, ОфлайнОборудование, ТекущаяСмена.НомерСмены, ТекущаяСмена.Дата, ТекущаяСмена.НомерДокументаГлоб);

		//Мальцев А.Ю. ---
	
			ЗначениеУчетнойПолитики = ПолучитьЗначениеУчетнойПолитики("МагазинИспользуетОтдельнуюКассуПодразделения", Подразделение, ТекущаяСмена.Дата, Истина);
			обИнкассация = НЕОПРЕДЕЛЕНО;

			Если Внесение = НЕОПРЕДЕЛЕНО Тогда
				обИнкассация = Документы.Инкассация.СоздатьДокумент();
				
			ИначеЕсли Внесение.Проведен Тогда 
				
				Если ЗначениеУчетнойПолитики = Истина Тогда
					ПараметрыЗаполнения = Новый Структура;
					ПараметрыЗаполнения.Вставить("СтатьяДДС",Справочники.СтатьиДДС.ПрочийПриход);
					ПараметрыЗаполнения.Вставить("СтавкаНДС",Справочники.СтавкиНДС.БезНДС);
					ПараметрыЗаполнения.Вставить("Контрагент",Подразделение.ит_КонтрагентКассы);
					ПараметрыЗаполнения.Вставить("ДоговорВзаиморасчетов",ПолучитьОсновнойДоговор(Подразделение.ит_КонтрагентКассы));
					Если ЗначениеЗаполнено(Подразделение.ит_ДополнительнаяКасса) Тогда
						ПараметрыЗаполнения.Вставить("ПринятоОТ",СокрЛП(Подразделение.ит_ДополнительнаяКасса)+", "+СокрЛП(Подразделение.ит_КонтрагентКассы));
					Иначе
						ПараметрыЗаполнения.Вставить("ПринятоОТ","Центральная касса, "+СокрЛП(Подразделение.ит_КонтрагентКассы));
					КонецЕсли;
					СоздатьПКОПоИнкассации(Внесение, ПараметрыЗаполнения, Отказ, ТекстОшибки);
					Если ЗначениеЗаполнено(Подразделение.ит_ДополнительнаяКасса) Тогда
						ПараметрыЗаполнения = Новый Структура;
						ПараметрыЗаполнения.Вставить("КассаКомпании",Подразделение.ит_ДополнительнаяКасса);
						ПараметрыЗаполнения.Вставить("СтавкаНДС",Справочники.СтавкиНДС.БезНДС);
						ПараметрыЗаполнения.Вставить("Контрагент",Подразделение.ит_КонтрагентКассы);
						ПараметрыЗаполнения.Вставить("ДоговорВзаиморасчетов",ПолучитьОсновнойДоговор(Подразделение.ит_КонтрагентКассы));
						ПараметрыЗаполнения.Вставить("СтатьяДДС",Справочники.СтатьиДДС.ПрочийРасход);
						ПараметрыЗаполнения.Вставить("Выдать",СокрЛП(ПолучитьКассу(Внесение.Организация, Внесение.ПодразделениеКомпании))+", "+СокрЛП(Подразделение.ит_КонтрагентКассы));
						СоздатьРКОПоИнкассации(Внесение, ПараметрыЗаполнения, Отказ, ТекстОшибки);
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				обИнкассация = Внесение.ПолучитьОбъект();
			КонецЕсли;
			
			Если обИнкассация <> НЕОПРЕДЕЛЕНО Тогда
				//обИнкассация = Документы.Инкассация.СоздатьДокумент();
				
				обИнкассация.Заполнить(Неопределено);
				обИнкассация.Дата        = ТекущаяСмена.Дата;
				обИнкассация.ХозОперация = Справочники.ХозОперации.ВнесениеВКассуККМ;
				Документы.Инкассация.ХозОперацияПриИзменении(обИнкассация, ПараметрыДействия);
				
				обИнкассация.Организация           = Организация;
				обИнкассация.ПодразделениеКомпании = Подразделение;
				Документы.Инкассация.ПодразделениеКомпанииПриИзменении(обИнкассация);
				Если ЗначениеЗаполнено(обИнкассация.Номер) = Ложь Тогда
					обИнкассация.УстановитьНовыйНомер();
				КонецЕсли;
				обИнкассация.Инкассатор = Контрагент;
				Документы.Инкассация.ИнкассаторПриИзменении(обИнкассация);
				обИнкассация.ФР             = ОфлайнОборудование;
				//обИнкассация.КассаКомпании = КассаКомпании;
				//Документы.Инкассация.КассаКомпанииПриИзменении(обИнкассация);
				обИнкассация.СуммаДокумента = ТекущаяСмена.СуммаВнесения;
				//Документы.Инкассация.СуммаДокументаПриИзменении(обИнкассация);
				обИнкассация.ДатаФР         = ТекущаяСмена.Дата;
				обИнкассация.НомерСмены     = ТекущаяСмена.НомерСмены;
				обИнкассация.НомерДокумента = ТекущаяСмена.НомерДокументаГлоб;
				обИнкассация.КассаККМ       = КассаККМ;
				Документы.Инкассация.КассаККМПриИзменении(обИнкассация);
				обИнкассация.Автор = Автор;
				
				обИнкассация.Оплаты.Очистить();
				НоваяСтрока = обИнкассация.Оплаты.Добавить();
				НоваяСтрока.ТипОплаты = Справочники.ТипыОплат.Наличные;
				НоваяСтрока.Сумма     = ТекущаяСмена.СуммаВнесения;
				
				обИнкассация.ОбменДанными.Загрузка = Истина;
				Попытка
					обИнкассация.Записать(РежимЗаписиДокумента.Запись);
					ВывестиСообщение("Создан документ: " + СокрЛП(обИнкассация));
				Исключение
				КонецПопытки;
				обИнкассация.ОбменДанными.Загрузка = Ложь;
				Попытка
					обИнкассация.Записать(РежимЗаписиДокумента.Проведение);
					ВывестиСообщение("Проведен документ: " + СокрЛП(обИнкассация));
				Исключение
					//Отказ 	= Истина;
					Ошибка  = ОписаниеОшибки();
					ТекстОшибки = "Не удалось провести документ: " + СокрЛП(обИнкассация) + ", по причине: " + Ошибка;
					ЗаписьЖурналаРегистрации("Загрузка данных касс УКМ", УровеньЖурналаРегистрации.Ошибка,,обИнкассация.Ссылка,ТекстОшибки);
				КонецПопытки;
				
				Если ЗначениеУчетнойПолитики = Истина Тогда
					ПараметрыЗаполнения = Новый Структура;
					ПараметрыЗаполнения.Вставить("СтатьяДДС",Справочники.СтатьиДДС.ПрочийПриход);
					ПараметрыЗаполнения.Вставить("СтавкаНДС",Справочники.СтавкиНДС.БезНДС);
					ПараметрыЗаполнения.Вставить("Контрагент",Подразделение.ит_КонтрагентКассы);
					ПараметрыЗаполнения.Вставить("ДоговорВзаиморасчетов",ПолучитьОсновнойДоговор(Подразделение.ит_КонтрагентКассы));
					Если ЗначениеЗаполнено(Подразделение.ит_ДополнительнаяКасса) Тогда
						ПараметрыЗаполнения.Вставить("ПринятоОТ",СокрЛП(Подразделение.ит_ДополнительнаяКасса)+", "+СокрЛП(Подразделение.ит_КонтрагентКассы));
					Иначе
						ПараметрыЗаполнения.Вставить("ПринятоОТ","Центральная касса, "+СокрЛП(Подразделение.ит_КонтрагентКассы));
					КонецЕсли;
					СоздатьПКОПоИнкассации(обИнкассация, ПараметрыЗаполнения, Отказ, ТекстОшибки);
					Если ЗначениеЗаполнено(Подразделение.ит_ДополнительнаяКасса) Тогда
						ПараметрыЗаполнения = Новый Структура;
						ПараметрыЗаполнения.Вставить("КассаКомпании",Подразделение.ит_ДополнительнаяКасса);
						ПараметрыЗаполнения.Вставить("СтавкаНДС",Справочники.СтавкиНДС.БезНДС);
						ПараметрыЗаполнения.Вставить("Контрагент",Подразделение.ит_КонтрагентКассы);
						ПараметрыЗаполнения.Вставить("ДоговорВзаиморасчетов",ПолучитьОсновнойДоговор(Подразделение.ит_КонтрагентКассы));
						ПараметрыЗаполнения.Вставить("СтатьяДДС",Справочники.СтатьиДДС.ПрочийРасход);
						ПараметрыЗаполнения.Вставить("Выдать",СокрЛП(ПолучитьКассу(обИнкассация.Организация, обИнкассация.ПодразделениеКомпании))+", "+СокрЛП(Подразделение.ит_КонтрагентКассы));
						СоздатьРКОПоИнкассации(обИнкассация, ПараметрыЗаполнения, Отказ, ТекстОшибки);
					КонецЕсли;
				КонецЕсли;
			 КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписатьТекстВЛог(Формат(ОфлайнОборудование.ИндексМагазина,"ЧГ=0"),"Загрузка инкассаций. Конец.");
КонецПроцедуры

Функция СоздатьЗаданиеОбработкиПродаж(УникальныйИдентификатор, РезультатПродаж, ОфлайнОборудование) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	ПараметрыДанных = Новый Структура;
	
	ВходныеПараметры = Новый Структура;
	ВходныеПараметры.Вставить("РезультатПродаж",    РезультатПродаж);
	ВходныеПараметры.Вставить("ОфлайнОборудование", ОфлайнОборудование);
	ВходныеПараметры.Вставить("ПараметрыДанных",    ПараметрыДанных);
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(
	"ОфлайнОборудованиеPOSСуперМАГВызовСервера.ОбработатьЗагружаемыеДанныеПродажВФоне",
	ВходныеПараметры,
	ПараметрыВыполнения);
	
	Возврат Результат;
	
КонецФункции

//Процедура ОбработатьЗагружаемыеДанныеПродаж(РезультатПродаж, ОфлайнОборудование, ДиапазоныЧеков, ЗакрытыеСмены, Отказ, ТекстОшибки, ВыполнятьВФоне = Ложь, ПараметрыОжидания = Неопределено) Экспорт
Процедура ОбработатьЗагружаемыеДанныеПродаж(РезультатПродаж, ОфлайнОборудование, ДиапазоныЧеков, ЗакрытыеСмены, Отказ, ТекстОшибки) Экспорт
	
	ПриЗагрузкеЧеков(РезультатПродаж.ДанныеПоЧекам, ОфлайнОборудование, ДиапазоныЧеков, Отказ, ТекстОшибки);
	
	ПриЗагрузкеИнкассаций(РезультатПродаж.ДанныеПоИнкассациям, ОфлайнОборудование, Отказ, ТекстОшибки);
	
	Если НЕ Отказ И НЕ ОфлайнОборудование.ОсновнойОтдел.мр_ЗапросОстатковИЦенИзРозницы Тогда
		ПриЗагрузкеОтчетовОПродаже(РезультатПродаж.ДанныеПоЗакрытымСменам, ОфлайнОборудование, ЗакрытыеСмены, Отказ, ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьЗагружаемыеДанныеПродажВФоне(ВходныеПараметры, АдресРезультата = Неопределено) Экспорт
	
	//ВходныеПараметры.Отказ;
	ОфлайнОборудование = ВходныеПараметры.ОфлайнОборудование;
	ПараметрыДанных = ВходныеПараметры.ПараметрыДанных;
	РезультатПродаж = ВходныеПараметры.РезультатПродаж;
	//ВходныеПараметры.ТекстОшибки;
	Отказ          = Ложь;
	ТекстОшибки    = "";
	ДиапазоныЧеков = Новый Массив;
	ЗакрытыеСмены  = Новый Массив;
	
	ПриЗагрузкеЧеков(РезультатПродаж.ДанныеПоЧекам, ОфлайнОборудование, ДиапазоныЧеков, Отказ, ТекстОшибки, Истина);
	
	ПриЗагрузкеИнкассаций(РезультатПродаж.ДанныеПоИнкассациям, ОфлайнОборудование, Отказ, ТекстОшибки);
		
	Если НЕ Отказ И НЕ ОфлайнОборудование.ОсновнойОтдел.мр_ЗапросОстатковИЦенИзРозницы Тогда
		ПриЗагрузкеОтчетовОПродаже(РезультатПродаж.ДанныеПоЗакрытымСменам, ОфлайнОборудование, ЗакрытыеСмены, Отказ, ТекстОшибки, Истина);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Отказ",          Отказ);
	Результат.Вставить("ТекстОшибки",    ТекстОшибки);
	Результат.Вставить("ДиапазоныЧеков", ДиапазоныЧеков);
	Результат.Вставить("ЗакрытыеСмены",  ЗакрытыеСмены);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	//Результат.АдресРезультата
	
КонецПроцедуры

Функция ПолучитьПоследнийМоментЗагрузки(Оборудование) Экспорт
	
	Момент = НЕОПРЕДЕЛЕНО;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(ИТ_МоментыПоследнейЗагрузкиИзКасс.МоментПоследнейЗагрузки) КАК МоментПоследнейЗагрузки
		|ИЗ
		|	РегистрСведений.ИТ_МоментыПоследнейЗагрузкиИзКасс КАК ИТ_МоментыПоследнейЗагрузкиИзКасс
		|ГДЕ
		|	ИТ_МоментыПоследнейЗагрузкиИзКасс.Оборудование = &Оборудование";
	
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда                       
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.МоментПоследнейЗагрузки) Тогда
			Момент = НачалоДня(ВыборкаДетальныеЗаписи.МоментПоследнейЗагрузки);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Момент;
	
КонецФункции


Функция ПолучитьПоследнийМоментЗагрузкиНомерPOS(Оборудование, НомерPOS) Экспорт
	
	Момент = НЕОПРЕДЕЛЕНО;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(ИТ_МоментыПоследнейЗагрузкиИзКасс.МоментПоследнейЗагрузки) КАК МоментПоследнейЗагрузки
		|ИЗ
		|	РегистрСведений.ИТ_МоментыПоследнейЗагрузкиИзКасс КАК ИТ_МоментыПоследнейЗагрузкиИзКасс
		|ГДЕ
		|	ИТ_МоментыПоследнейЗагрузкиИзКасс.Оборудование = &Оборудование
		|	И ИТ_МоментыПоследнейЗагрузкиИзКасс.НомерPOS = &НомерPOS";
	
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	Запрос.УстановитьПараметр("НомерPOS", НомерPOS);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда                       
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.МоментПоследнейЗагрузки) Тогда
			Момент = НачалоДня(ВыборкаДетальныеЗаписи.МоментПоследнейЗагрузки);
			//Момент = ВыборкаДетальныеЗаписи.МоментПоследнейЗагрузки;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Момент;
	
КонецФункции

#КонецОбласти

Функция ПроверитьФлагТестирования() Экспорт	
	Возврат ПравоПользователя("итТестированиеНовогоФункционала");
КонецФункции

Процедура ЗаписатьТекстВЛог(ТипФайла, ТекстСообщения) Экспорт
	Путь = "\\srv-03.holod.local\ESUR_Mobile_1C\Log\";
	ИмяФайла = СокрЛП(ТипФайла)+Формат(ТекущаяДата(),"ДФ=_yyyy_MM_dd");
	
	Попытка
		ЗТ = Новый ЗаписьТекста(Путь+ИмяФайла,,,Истина);
		ЗТ.ЗаписатьСтроку(""+ТекущаяДата()+" "+НомерСеансаИнформационнойБазы()+" "+ТекстСообщения);
		ЗТ.Закрыть();
	Исключение
	КонецПопытки;
КонецПроцедуры