#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Если сфпСофтФонПроСервер.сфпИспользоватьОграничениеПоказаТелефонныхЗвонков() Тогда
		МассивПользователей 			= сфпСофтФонПроСервер.сфпПолучитьМассивПрослушиваемыхПользователей(сфпСофтФонПроСервер.сфпТекущийПользователь());
		СписокПользователей				= сфпСофтФонПроСервер.сфпПреобразоватьМассивЗвонящихВСписокЗначений(МассивПользователей);
		Для Каждого Настройка Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(Настройка) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
				Если Настройка.Параметр = Новый ПараметрКомпоновкиДанных("Сотрудники") Тогда
					Настройка.Значение 		= СписокПользователей;
					Настройка.Использование = Истина;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли