// Этот модуль должен обязательно иметь Повторное использование возвращаемых
// значений в положении "На время сеанса". За счет этого осуществляется кэширование
// значения защищенных обработок и загруженных экземпляров компоненты защиты 
// для каждого сеанса работы.

// Возвращает экземпляр компоненты лицензирования,
// который используется в защите.
Функция АктивнаяКомпонента(КлючПродукта, ОписаниеОшибки) Экспорт
	УстановитьПривилегированныйРежим(ИСТИНА);
	Возврат ЛицензированиеСервер.ПодключитьКомпоненту(ОписаниеОшибки);
КонецФункции

Функция ПодключитьВнешнююОбработку(ИмяФайла, ОписаниеОшибки = "", КодОшибки = 0) Экспорт
	
	УстановитьПривилегированныйРежим(ИСТИНА);
	
	// Обнуляем переменные описания ошибки
	ОписаниеОшибки  = "";
	КодОшибки       = 0;
	ШаблонСообщения = НСтр("ru = 'Работа системы лицензирования в режиме Обычного приложения с файловой базой возможна только после отключения функции ""Защита от опасных действий"" в параметрах пользователя 1С (Конфигуратор --> Администрирование --> Пользователи). Подробнее, см. на сайте 1С описание ошибки платформы #10170221.'; en = 'The work of the licensing system in the mode of a Ordinary application with a file database is possible only after disabling the function ""Unsafe action protection"" in the user settings 1C (Configurator -> Administration -> Users). For more details, see the 1C website for a description of the platform error #10170221.'");
	
	// Попытаемся подключить обработку в режиме отключения защиты от опасных действий
	Если ПараметрыСеанса.ВключенаЗащитаОтОпасныхДействий=1 Тогда
		
		Попытка
			
			ПараметрыЗащиты = Новый("ОписаниеЗащитыОтОпасныхДействий"+"");
			ПараметрыЗащиты.ПредупреждатьОбОпасныхДействиях = ЛОЖЬ;                                            
			
			Данные = Новый ДвоичныеДанные(ИмяФайла);
			АдресХранилища = ПоместитьВоВременноеХранилище(Данные, Новый УникальныйИдентификатор());
			
			Обработка = ВнешниеОбработки.Создать(ВнешниеОбработки.Подключить(АдресХранилища,,Ложь, ПараметрыЗащиты), Ложь);
			
		Исключение
			
			ПричинаОшибки  = ИнформацияОбОшибке();
			Обработка      = Неопределено;
			
			Если ТекущийРежимЗапуска()=РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение И Найти(ВРег(СтрокаСоединенияИнформационнойБазы()), "FILE=")>0 Тогда
				
				ОписаниеОшибки = ШаблонСообщения;
				КодОшибки      = 10170221;
				
				// Получим параметры работы текущего пользователя
				ПараметрыПользователя = Новый Структура("UnsafeOperationProtection", Неопределено);
				ЗаполнитьЗначенияСвойств(ПараметрыПользователя, ПользователиИнформационнойБазы.ТекущийПользователь());
				
				// В версии платформы 8.3.10 исправлена ошибка Создания внешней обработки
				ПараметрыСеанса.ВключенаЗащитаОтОпасныхДействий = ?(ПараметрыПользователя.UnsafeOperationProtection=Неопределено, 2, 0);
				
			КонецЕсли;
			
		КонецПопытки;
		
	ИначеЕсли ПараметрыСеанса.ВключенаЗащитаОтОпасныхДействий=2 Тогда
		ОписаниеОшибки = ШаблонСообщения;
		КодОшибки      = 10170221;
		Обработка      = Неопределено;
		
		// Нет возможности определить, что защита отключена при помощи параметра DisableUnsafeActionProtection в файле conf.cfg.
		
	Иначе
		
		// Производим подключение обработки по старинке
		Обработка = ВнешниеОбработки.Создать(ИмяФайла, Ложь);
		
	КонецЕсли;
	
	// Возвращаем полученную обработку
	Возврат Обработка;
	
КонецФункции // ПодключитьВнешнююОбработку()

// Функция создает и инициализирует обработку менеджера
// управления лицензированием. В течении сеанса обработка будет 
// закэширована.
// ОписаниеОшибки - возвращаемый параметр, содержит описание результата операции.
Функция КонтрольЛицензирования(КлючПродукта, ОписаниеОшибки = "", КодОшибки = 0) Экспорт;
	
	// Обнуляем переменные описания ошибки
	УстановитьПривилегированныйРежим(ИСТИНА);
	ОписаниеОшибки  = "";
	КодОшибки       = 0;
	
	Попытка
		Компонента = ЛицензированиеСервер.АктивнаяКомпонента(КлючПродукта, ОписаниеОшибки);
		Если Компонента = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		Контроль = ПодключитьВнешнююОбработку(Компонента.КонтрольЛицензирования(), ОписаниеОшибки, КодОшибки);
		Если КодОшибки=0 Тогда
			Контроль.ПодключитьКомпоненту(Компонента);
		КонецЕсли;
	Исключение
		Контроль = Неопределено;
		Ошибка = ОписаниеОшибки();
		Если (Компонента<>Неопределено) И (Ошибка="") Тогда
			Ошибка = Компонента.ОписаниеПоследнейОшибки;
		КонецЕсли;	
		ОписаниеОшибки = НСтр("ru = 'Ошибка при инициализации компоненты лицензирования '; en = 'Error initializing licensing component'") + Ошибка;

	КонецПопытки;
	Возврат Контроль;
КонецФункции	

// Функция получает ключ клиентской ссылки
//
Функция ПолучитьКлючКлиентскойСсылки(КлючПродукта, ОписаниеОшибки = "") Экспорт;
	УстановитьПривилегированныйРежим(ИСТИНА);
	Контроль = ЛицензированиеСервер.КонтрольЛицензирования(КлючПродукта, ОписаниеОшибки);
	Если Контроль = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Контроль.ПолучитьКлиентскуюСсылку(ОписаниеОшибки);
КонецФункции	

// Функция устанавливает клиентскую ссылку
//
Функция УстановитьКлиентскуюСсылку(КлючПродукта, Ссылка, ОписаниеОшибки) Экспорт;
	УстановитьПривилегированныйРежим(ИСТИНА);
	ОписаниеОшибки = "";
	Контроль = ЛицензированиеСервер.КонтрольЛицензирования(КлючПродукта, ОписаниеОшибки);
	Если Контроль = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Контроль.Ссылка = Ссылка;
	Возврат Истина;
КонецФункции

// Функция создает и инициализирует защищенную обработку. В дальнейшем, в течении 
// сеанса, значение будет закэшировано, и вызов будет возвращать тот же
// экземпляр обработки
// ИмяОбработки - строка с именем защищенной обработки
// параметра лицензирования будет совпадать или превышать переданную в этом параметре
// ОписаниеОшибки - возвращаемый параметр, содержит описание результата операции.
Функция ПолучитьЗащищеннуюОбработку(ИмяОбработки, ОписаниеОшибки = "", КодОшибки = 0)  Экспорт
	Перем УстанавливатьПараметрыСеанса, АдресСервераЛицензирования, Сертификат;
	
	// Проверка и разбор длинного имени
	ИмяМакетаХранилища = "";
	ИмяМакетаПараметровЛицензирования = "";
	КороткоеИмяОбработки = "";
	Если НЕ ЛицензированиеСервер.РазделитьИмяОбработки(ИмяОбработки, ИмяМакетаХранилища, ИмяМакетаПараметровЛицензирования, КороткоеИмяОбработки) Тогда
		ОписаниеОшибки = НСтр("ru = 'Неверный формат имени обработки:'; en = 'Invalid name format of data processor:'") + Символы.ПС + ИмяОбработки;
		КодОшибки = 1;
		Возврат Неопределено;
	КонецЕсли;	
	КлючПродукта = ИмяМакетаХранилища+"."+ИмяМакетаПараметровЛицензирования;
	
	УстанавливатьПараметрыСеанса = Ложь;
	Контроль = ЛицензированиеСервер.КонтрольЛицензирования(КлючПродукта, ОписаниеОшибки);
	Если Контроль = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Контроль.ПодключитьКомпоненту(ЛицензированиеСервер.АктивнаяКомпонента(КлючПродукта, ОписаниеОшибки));
	
	МакетПараметров = ПолучитьОбщийМакет(ИмяМакетаПараметровЛицензирования);
	
	ВидЛицензии = Число(МакетПараметров.ПолучитьОбласть("ВидЛицензии|Значение").ТекущаяОбласть.Текст);

	УстановитьПривилегированныйРежим(ИСТИНА);
	
	Результат = Контроль.ПолучитьЗащищеннуюОбработку(КороткоеИмяОбработки, ОписаниеОшибки, КодОшибки, ВидЛицензии, ЛицензированиеСервер.КодДоступаКлючаЗащиты()
	, ЛицензированиеСервер.ИдентификаторыКлючей(ИмяМакетаПараметровЛицензирования), ИмяМакетаХранилища, ЛицензированиеСервер.ПолучитьСертификатПоИмениОбработки(ИмяОбработки)
	, ПараметрыСеанса.АдресСервераЛицензирования, ЛицензированиеСервер.АдресСервераЛицензирования()
	, УстанавливатьПараметрыСеанса, АдресСервераЛицензирования, Сертификат);
	
	Если УстанавливатьПараметрыСеанса Тогда
		ПараметрыСеанса.АдресСервераЛицензирования = АдресСервераЛицензирования;
		ЛицензированиеСервер.ДобавитьСертификат(ИмяОбработки, Сертификат);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Процедура выполняет проверку заполненности параметров лицензирования
Процедура ПроверитьПараметрыЛицензирования(ИмяМакетаПараметровЛицензирования) Экспорт
	
	Возврат;
	
	УстановитьПривилегированныйРежим(ИСТИНА);
	МакетПараметров = ПолучитьОбщийМакет(ИмяМакетаПараметровЛицензирования);
	Проверка = "";
	АктивацияЗадана = Ложь;
	
	// проверка адреса сервера активации
	Значение = СокрЛП(МакетПараметров.ПолучитьОбласть("URLСервисаАктивации|Значение").ТекущаяОбласть.Текст);
	Если Значение="" Тогда
		Проверка = Проверка +Символы.ВК + Символы.ПС + СокрЛП(МакетПараметров.ПолучитьОбласть("URLСервисаАктивации|Комментарий").ТекущаяОбласть.Текст);
	Иначе
		АктивацияЗадана = АктивацияЗадана ИЛИ (Значение<>НСтр("ru = 'не используется.'"));
	КонецЕсли;
	
	// проверка кода вендора
	Значение = СокрЛП(МакетПараметров.ПолучитьОбласть("КодВендора|Значение").ТекущаяОбласть.Текст);
	Если Значение="" Тогда
		Проверка = Проверка +Символы.ВК + Символы.ПС + СокрЛП(МакетПараметров.ПолучитьОбласть("КодВендора|Комментарий").ТекущаяОбласть.Текст);
	КонецЕсли;	
	
	// проверка серии аппаратных ключей
	Значение = СокрЛП(МакетПараметров.ПолучитьОбласть("СерияАппаратногоКлюча|Значение").ТекущаяОбласть.Текст);
	Если Значение="" Тогда
		Проверка = Проверка +Символы.ВК + Символы.ПС + СокрЛП(МакетПараметров.ПолучитьОбласть("СерияАппаратногоКлюча|Комментарий").ТекущаяОбласть.Текст);
	КонецЕсли;	
	
	// проверка идентификатора продукта
	Значение = СокрЛП(МакетПараметров.ПолучитьОбласть("ИдентификаторПродукта|Значение").ТекущаяОбласть.Текст);
	Если Значение="" Тогда
		Проверка = Проверка +Символы.ВК + Символы.ПС + СокрЛП(МакетПараметров.ПолучитьОбласть("ИдентификаторПродукта|Комментарий").ТекущаяОбласть.Текст);
	КонецЕсли;	
	
	// проверка требуемого вида лицензирования
	Значение = СокрЛП(МакетПараметров.ПолучитьОбласть("ВидЛицензии|Значение").ТекущаяОбласть.Текст);
	Если Значение="" Тогда
		Проверка = Проверка +Символы.ВК + Символы.ПС + СокрЛП(МакетПараметров.ПолучитьОбласть("ВидЛицензии|Комментарий").ТекущаяОбласть.Текст);
	КонецЕсли;	
	
	// проверка адреса электронной почты центра лицензирования
	Значение = СокрЛП(МакетПараметров.ПолучитьОбласть("АдресЭлектроннойПочты|Значение").ТекущаяОбласть.Текст);
	Если Значение="" Тогда
		Проверка = Проверка +Символы.ВК + Символы.ПС + СокрЛП(МакетПараметров.ПолучитьОбласть("АдресЭлектроннойПочты|Комментарий").ТекущаяОбласть.Текст);
	Иначе
		АктивацияЗадана = АктивацияЗадана ИЛИ (Значение<>НСтр("ru = 'не используется.'"));
	КонецЕсли;
	
	// проверка телефона центра лицензирования
	Значение = СокрЛП(МакетПараметров.ПолучитьОбласть("ТелефонЦентраЛицензирования|Значение").ТекущаяОбласть.Текст);
	Если Значение="" Тогда
		Проверка = Проверка +Символы.ВК + Символы.ПС + СокрЛП(МакетПараметров.ПолучитьОбласть("ТелефонЦентраЛицензирования|Комментарий").ТекущаяОбласть.Текст);
	Иначе
		АктивацияЗадана = АктивацияЗадана ИЛИ (Значение<>НСтр("ru = 'не используется.'"));
	КонецЕсли;
	
	// проверка режима активации
	Значение = СокрЛП(МакетПараметров.ПолучитьОбласть("РежимАктивации|Значение").ТекущаяОбласть.Текст);
	Если Значение="" Тогда
		Проверка = Проверка +Символы.ВК + Символы.ПС + СокрЛП(МакетПараметров.ПолучитьОбласть("РежимАктивации|Комментарий").ТекущаяОбласть.Текст);
	ИначеЕсли НЕ (Значение="0" ИЛИ Значение="1") Тогда
		Проверка = Проверка + Символы.ВК + Символы.ПС + НСтр("ru = 'Некорректно заполнен реквизит:'") + Символы.НПП + СокрЛП(МакетПараметров.ПолучитьОбласть("РежимАктивации|Комментарий").ТекущаяОбласть.Текст);
	КонецЕсли;
	
	Если Проверка<>"" Тогда
		Проверка = НСтр("ru = 'Не заполнены обязательные параметры лицензирования:'") + Символы.ВК + Символы.ПС + Проверка;
		ВызватьИсключение Проверка;
	КонецЕсли;
	
	Если НЕ АктивацияЗадана Тогда
		ВызватьИсключение НСтр("ru = 'Не указано ни одного способа активации ключей и лицензий.'");
	КонецЕсли;	
КонецПроцедуры