// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  ИдентификаторыДокументов - Массив Из Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * Ошибки - Массив Из Строка
//  * ИдентификаторПакета - Строка
Функция СоздатьПакетДокументовЭДО(ИдентификаторыДокументов) Экспорт
	
	Ошибки = Новый Массив; // Массив Из Строка
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("Ошибки", Ошибки);
	Результат.Вставить("ИдентификаторПакета", "");
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	ЭлектронныеДокументы = ЭлектронныеДокументыЭДОЦентрЭДО.ДокументыЭДО(ИдентификаторыДокументов);
	
	Если Не ЗначениеЗаполнено(ЭлектронныеДокументы) Тогда
		ТекстОшибки = ТекстОшибкиНеУдалосьНайтиЭлектронныеДокументыПоИдентификаторам();
		Результат.Ошибки.Добавить(ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	РезультатСозданияПакета = ПакетыДокументовЭДО.СоздатьПакетДокументовЛокально(ЭлектронныеДокументы,
		КонтекстДиагностики);
	
	Если Не РезультатСозданияПакета.Успех Тогда
		Результат.Ошибки = ОбщегоНазначения.ВыгрузитьКолонку(
			РезультатСозданияПакета.КонтекстДиагностики.Диагностика.Ошибки,
			"ПодробноеПредставлениеОшибки");
		Возврат Результат;
	КонецЕсли;
	
	Результат.Успех = Истина;
	Результат.ИдентификаторПакета = Строка(РезультатСозданияПакета.ИдентификаторПакета);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторПакета - Строка
//  ИдентификаторыДокументов - Массив Из Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * Ошибки - Массив Из Строка
Функция ДобавитьДокументыЭДОВПакет(ИдентификаторПакета, ИдентификаторыДокументов) Экспорт
	
	Ошибки = Новый Массив; // Массив Из Строка
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("Ошибки", Ошибки);
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	ЭлектронныеДокументы = ЭлектронныеДокументыЭДОЦентрЭДО.ДокументыЭДО(ИдентификаторыДокументов);
	
	Если Не ЗначениеЗаполнено(ЭлектронныеДокументы) Тогда
		ТекстОшибки = ТекстОшибкиНеУдалосьНайтиЭлектронныеДокументыПоИдентификаторам();
		Результат.Ошибки.Добавить(ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	РезультатДобавленияВПакет = ПакетыДокументовЭДО.ДобавитьДокументыВПакетЛокально(
		Новый УникальныйИдентификатор(ИдентификаторПакета), ЭлектронныеДокументы, КонтекстДиагностики);
	
	Если Не РезультатДобавленияВПакет.Успех Тогда
		Результат.Ошибки = ОбщегоНазначения.ВыгрузитьКолонку(
			РезультатДобавленияВПакет.КонтекстДиагностики.Диагностика.Ошибки, 
			"ПодробноеПредставлениеОшибки");
		Возврат Результат;
	КонецЕсли;
	
	Результат.Успех = Истина;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторПакета - Строка
//  ИдентификаторДокумента - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * Ошибки - Массив Из Строка
Функция УдалитьДокументЭДОИзПакета(ИдентификаторПакета, ИдентификаторДокумента) Экспорт
	
	Ошибки = Новый Массив; // Массив Из Строка
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("Ошибки", Ошибки);
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	ЭлектронныйДокумент = ЭлектронныеДокументыЭДОЦентрЭДО.ДокументПоИдентификатору(ИдентификаторДокумента);
	
	Если Не ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
		ТекстОшибки = ТекстОшибкиНеУдалосьНайтиЭлектронныеДокументыПоИдентификаторам();
		Результат.Ошибки.Добавить(ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	РезультатУдаленияИзПакета = ПакетыДокументовЭДО.УдалитьДокументИзПакетаЛокально(
		Новый УникальныйИдентификатор(ИдентификаторПакета), ЭлектронныйДокумент, КонтекстДиагностики);
	
	Если Не РезультатУдаленияИзПакета.Успех Тогда
		Результат.Ошибки = ОбщегоНазначения.ВыгрузитьКолонку(
			РезультатУдаленияИзПакета.КонтекстДиагностики.Диагностика.Ошибки, 
			"ПодробноеПредставлениеОшибки");
		Возврат Результат;
	КонецЕсли;
	
	Результат.Успех = Истина;
	
	Возврат Результат;
	
КонецФункции

// Возвращает идентификаторы документов ЭДО, входящие в состав пакета.
// 
// Параметры:
//  ИдентификаторПакетаСтрокой - Строка
// 
// Возвращаемое значение:
//  Массив из Строка
Функция СоставПакетаДокументовЭДО(ИдентификаторПакетаСтрокой) Экспорт
	
	Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторПакетаСтрокой) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ИдентификаторПакета = Новый УникальныйИдентификатор(ИдентификаторПакетаСтрокой);
	
	ДокументыПакета = ПакетыДокументовЭДО.ДокументыПакета(ИдентификаторПакета);
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ИдентификаторыДокументовЭДО(ДокументыПакета);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращаемое значение:
//  Строка
Функция ТекстОшибкиНеУдалосьНайтиЭлектронныеДокументыПоИдентификаторам()
	Возврат НСтр("ru = 'Не удалось найти электронные документы по идентификаторам'");
КонецФункции

#КонецОбласти
