// @strict-types

#Область СлужебныеПроцедурыИФункции

#Область АвторизацияВСервисеЭДО

// Параметры:
//  РезультатыПолученияОтпечатков - см. КриптографияБЭДКлиентСервер.НовыеРезультатыПолученияОтпечатков
//  ИдентификаторыЭДО - Массив из Строка
//  ВыбранныеСертификаты - Неопределено,Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  УчетнаяЗаписьЦентраЭДО - Неопределено,СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  ИдентификаторФормы - Неопределено,УникальныйИдентификатор
//  
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция АвторизоватьсяВСервисеЭДОВФоне(Знач РезультатыПолученияОтпечатков, Знач ИдентификаторыЭДО,
	Знач ВыбранныеСертификаты = Неопределено, Знач УчетнаяЗаписьЦентраЭДО = Неопределено,
	Знач ИдентификаторФормы = Неопределено) Экспорт
	
	Если ИдентификаторФормы = Неопределено Тогда
		ИдентификаторФормы = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	
	// См. УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.АвторизоватьсяВСервисеЭДО
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.АвторизоватьсяВСервисеЭДО",
		ИдентификаторыЭДО, РезультатыПолученияОтпечатков, ВыбранныеСертификаты, УчетнаяЗаписьЦентраЭДО);
	
КонецФункции

#КонецОбласти // АвторизацияВСервисеЭДО

// Параметры:
//  ПараметрыРегистрации - см. УчетныеЗаписиЭДОИнтеграцияЦентраЭДОКлиент.НовыеПараметрыРегистрацииСертификатовВЭДО
//  ИдентификаторФормы - Неопределено,УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ПодготовитьДанныеДляПодписанияНаРегистрациюВЭДОВФоне(Знач ПараметрыРегистрации, Знач ИдентификаторФормы) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	
	// См. УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ПодготовитьДанныеДляПодписанияНаРегистрациюВЭДО
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ПодготовитьДанныеДляПодписанияНаРегистрациюВЭДО", ПараметрыРегистрации);
	
КонецФункции

// Параметры:
//  УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  ИдентификаторЗаявки - Строка
//  Сертификат - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
// 
// Возвращаемое значение:
//  См. УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ЗаполнитьДанныеДляПодписанияНаРегистрациюВЭДОПоСертификату
Функция ЗаполнитьДанныеДляПодписанияНаРегистрациюВЭДОПоСертификату(Знач УчетнаяЗаписьЦентраЭДО, Знач ИдентификаторЗаявки, Знач Сертификат) Экспорт
	Возврат УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ЗаполнитьДанныеДляПодписанияНаРегистрациюВЭДОПоСертификату(
		УчетнаяЗаписьЦентраЭДО, ИдентификаторЗаявки, Сертификат);
КонецФункции

// Параметры:
//  УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  ИдентификаторЗаявки - Строка
//  Подписи - Структура:
//  * ПодписьСоглашения - ДвоичныеДанные
//  * ПодписьДанныхДляРегистрации - ДвоичныеДанные
//  * Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  ИдентификаторФормы - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ОтправитьРегистрационныйПакетЭДОВФоне(Знач УчетнаяЗаписьЦентраЭДО, Знач ИдентификаторЗаявки, Знач Подписи, Знач ИдентификаторФормы) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ОтправитьРегистрационныйПакетЭДО", // См. УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ОтправитьРегистрационныйПакетЭДО
		УчетнаяЗаписьЦентраЭДО, ИдентификаторЗаявки, Подписи);
	
КонецФункции

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения
//  ИдентификаторыЗаявокПоУчетнымЗаписямЦентраЭДО - Соответствие из КлючИЗначение:
//  * Ключ - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  * Значение - Массив из Строка
//  ИдентификаторФормы - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ПроверитьОбработкуРегистрационныхПакетовЭДОВФоне(Знач ИдентификаторыЗаявокПоУчетнымЗаписямЦентраЭДО, Знач ИдентификаторФормы) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ПроверитьОбработкуРегистрационныхПакетовЭДО", // См. УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ПроверитьОбработкуРегистрационныхПакетовЭДО
		ИдентификаторыЗаявокПоУчетнымЗаписямЦентраЭДО);
	
КонецФункции

// Параметры:
//  ИнформацияОбУчетнойЗаписи - см. УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ИнформацияОбУчетнойЗаписи
//  ИдентификаторФормы - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ОбновитьИнформациюОбУчетнойЗаписиЭДОВФоне(Знач ИнформацияОбУчетнойЗаписи, Знач ИдентификаторФормы) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ОбновитьИнформациюОбУчетнойЗаписиЭДО", // См. УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ОбновитьИнформациюОбУчетнойЗаписиЭДО
		ИнформацияОбУчетнойЗаписи);
	
КонецФункции

// Параметры:
//  ИдентификаторУчетнойЗаписиЭДО - см. УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ОбновитьНастройкиУведомленийУчетнойЗаписиЭДО.ИдентификаторУчетнойЗаписиЭДО
//  ПараметрыУведомлений - см. УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ОбновитьНастройкиУведомленийУчетнойЗаписиЭДО.ПараметрыУведомлений
//  РасшифрованныеМаркеры - см. УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ОбновитьНастройкиУведомленийУчетнойЗаписиЭДО.РасшифрованныеМаркеры
//  ИдентификаторФормы - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ОбновитьНастройкиУведомленийУчетнойЗаписиЭДОВФоне(Знач ИдентификаторУчетнойЗаписиЭДО, Знач ПараметрыУведомлений, Знач РасшифрованныеМаркеры, Знач ИдентификаторФормы) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ОбновитьНастройкиУведомленийУчетнойЗаписиЭДО", // См. УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.ОбновитьНастройкиУведомленийУчетнойЗаписиЭДО
		ИдентификаторУчетнойЗаписиЭДО, ПараметрыУведомлений, РасшифрованныеМаркеры);
	
КонецФункции

// Параметры:
//  ИдентификаторУчетнойЗаписиЭДО - см. УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.НастройкиУведомленийУчетнойЗаписиЭДО.ИдентификаторУчетнойЗаписиЭДО
//  РасшифрованныеМаркеры - см. КриптографияБЭДКлиентСервер.НовыйНаборРасшифрованныхДанных
//  УчетнаяЗаписьЦентраЭДО - Неопределено,СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  ИдентификаторФормы - Неопределено,УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция НастройкиУведомленийУчетнойЗаписиЭДОВФоне(Знач ИдентификаторУчетнойЗаписиЭДО, Знач РасшифрованныеМаркеры,
	Знач УчетнаяЗаписьЦентраЭДО = Неопределено, Знач ИдентификаторФормы = Неопределено) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	
	// См. УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.НастройкиУведомленийУчетнойЗаписиЭДО
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"УчетныеЗаписиЭДОИнтеграцияЦентраЭДО.НастройкиУведомленийУчетнойЗаписиЭДО",
		ИдентификаторУчетнойЗаписиЭДО, РасшифрованныеМаркеры, УчетнаяЗаписьЦентраЭДО);
	
КонецФункции

#КонецОбласти
