
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Взаимодействия"
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает текст запроса, отбирающего контакты (участников) предмета взаимодействия.
// Используется, если в конфигурации определен хотя бы один предмет взаимодействий.
//
// Параметры:
//  ПомещатьВоВременнуюТаблицу - Булево - признак того, что результат выполнения запроса 
//                                        необходимо поместить во временную таблицу.
//  ИмяТаблицы                 - Строка - имя таблицы предмета взаимодействий, в котором будет выполнен поиск.
//  Объединить                 - Булево - Признак который указывает на режим формирования запроса. В случае,
//                                        если данный параметр имеет значение Истина, то формируемый в функции запрос
//                                        являются частью другого запроса и должен начинаться с конструкции ОБЪЕДИНИТЬ.
//
Функция ТекстЗапросаПоискКонтактовПоПредмету(
	ПомещатьВоВременнуюТаблицу,
	ИмяТаблицы,
	Объединить = Ложь) Экспорт
	
	// +РАРУС Сформируем запрос по контактам предмета взаимодействия
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяТаблицы);
	ПустаяСсылка    = МенеджерОбъекта.ПустаяСсылка();
	
	Попытка
		Возврат МенеджерОбъекта.ПолучитьТекстЗапросаПоКонтактам(ПустаяСсылка, ?(НЕ ПомещатьВоВременнуюТаблицу, "", Символы.ПС + "ПОМЕСТИТЬ табКонтакты"), Объединить, ЛОЖЬ);
	Исключение
		// Вызываем общий обработчик действия
		Параметры = Новый Структура;
			Параметры.Вставить("ТекстВременнаяТаблица", ?(НЕ ПомещатьВоВременнуюТаблицу, "", Символы.ПС + "ПОМЕСТИТЬ табКонтакты"));
			Параметры.Вставить("Объединить", Объединить);
			Параметры.Вставить("ТолькоОсновныеКонтакты", ЛОЖЬ);
		Возврат УправлениеДиалогомСервер.ПолучитьТекстЗапросаПоКонтактам(ПустаяСсылка, Параметры);
	КонецПопытки;
	// -РАРУС
	
КонецФункции

// Возможность переопределить владельца присоединенных файлов для письма.
// Такая необходимость может возникнуть например при массовых рассылках. В этом случае имеет смысл 
// хранить одни и те же присоединенные файлы в одном месте, а не тиражировать их на все письма рассылки.
//
// Параметры:
//  Письмо  - ДокументСсылка, ДокументОбъект - документ электронное письмо для которого необходимо получить вложения.
//
// Возвращаемое значение:
//  Структура,Неопределено  - Неопределено, если присоединенные файлы хранятся при письме.
//                            Структура, если присоединенные файлы хранятся в другом объекте. Формат структуры:
//                              - Владелец - владелец присоединенных файлов,
//                              - ИмяСправочникаПрисоединенныеФайлы - имя объекта метаданных присоединенных файлов.
//
Функция ДанныеОбъектаМетаданныхПрисоединенныхФайловПисьма(Письмо) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

// +Рарус
Процедура ЗаполнитьОрганизациюИПодразделения()   Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Встреча.Ссылка КАК Ссылка,
	               |	Встреча.Автор.Организация КАК АвторОрганизация,
	               |	Встреча.Автор.ПодразделениеКомпании КАК АвторПодразделениеКомпании,
	               |	Встреча.Ответственный.ПодразделениеКомпании КАК ОтветственныйПодразделениеКомпании
	               |ИЗ
	               |	Документ.Встреча КАК Встреча
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗапланированноеВзаимодействие.Ссылка,
	               |	ЗапланированноеВзаимодействие.Автор.Организация,
	               |	ЗапланированноеВзаимодействие.Автор.ПодразделениеКомпании,
	               |	ЗапланированноеВзаимодействие.Ответственный.ПодразделениеКомпании
	               |ИЗ
	               |	Документ.ЗапланированноеВзаимодействие КАК ЗапланированноеВзаимодействие
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СообщениеSMS.Ссылка,
	               |	СообщениеSMS.Автор.Организация,
	               |	СообщениеSMS.Автор.ПодразделениеКомпании,
	               |	СообщениеSMS.Ответственный.ПодразделениеКомпании
	               |ИЗ
	               |	Документ.СообщениеSMS КАК СообщениеSMS
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТелефонныйЗвонок.Ссылка,
	               |	ТелефонныйЗвонок.Автор.Организация,
	               |	ТелефонныйЗвонок.Автор.ПодразделениеКомпании,
	               |	ТелефонныйЗвонок.Ответственный.ПодразделениеКомпании
	               |ИЗ
	               |	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЭлектронноеПисьмоВходящее.Ссылка,
	               |	ЭлектронноеПисьмоВходящее.Автор.Организация,
	               |	ЭлектронноеПисьмоВходящее.Автор.ПодразделениеКомпании,
	               |	ЭлектронноеПисьмоВходящее.Ответственный.ПодразделениеКомпании
	               |ИЗ
	               |	Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЭлектронноеПисьмоИсходящее.Ссылка,
	               |	ЭлектронноеПисьмоИсходящее.Автор.Организация,
	               |	ЭлектронноеПисьмоИсходящее.Автор.ПодразделениеКомпании,
	               |	ЭлектронноеПисьмоИсходящее.Ответственный.ПодразделениеКомпании
	               |ИЗ
	               |	Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокументВзаимодействия = Выборка.Ссылка.ПолучитьОбъект();
		
		Если НЕ ЗначениеЗаполнено(ДокументВзаимодействия.ПодразделениеКомпании) Тогда
			Если ЗначениеЗаполнено(Выборка.АвторПодразделениеКомпании) Тогда 
				ДокументВзаимодействия.ПодразделениеКомпании = Выборка.АвторПодразделениеКомпании;
			Иначе
				ДокументВзаимодействия.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДокументВзаимодействия.Организация) Тогда
			Если ЗначениеЗаполнено(Выборка.АвторОрганизация) Тогда 
				ДокументВзаимодействия.Организация = Выборка.АвторОрганизация;
			Иначе
				ДокументВзаимодействия.Организация = ПараметрыСеанса.Организация;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДокументВзаимодействия.ПодразделениеОтветственного) Тогда
			Если ЗначениеЗаполнено(Выборка.ОтветственныйПодразделениеКомпании) Тогда 
				ДокументВзаимодействия.ПодразделениеОтветственного = Выборка.ОтветственныйПодразделениеКомпании;
			Иначе
				ДокументВзаимодействия.ПодразделениеОтветственного = ПараметрыСеанса.ПодразделениеКомпании;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДокументВзаимодействия.Автор) Тогда 
			ДокументВзаимодействия.Автор = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДокументВзаимодействия.Ответственный) Тогда 
			ДокументВзаимодействия.Ответственный = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
		КонецЕсли;
		
		ДокументВзаимодействия.ОбменДанными.Загрузка = Истина;
		Попытка
			ДокументВзаимодействия.Записать();
			ВывестиСообщение(НСтр("ru='Обновлен документ ""%1"".'"),,,,, СокрЛП(ДокументВзаимодействия.Ссылка));
		Исключение
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Взаимодействия. Не удалось обновить документ'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	


КонецПроцедуры
// -Рарус

// +Рарус
Процедура ОчиститьДанныеРегистраСведенияКомпании() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Организация КАК Контрагент, Объект, Период ИЗ РегистрСведений.СведенияКомпании
	|ГДЕ ТИПЗНАЧЕНИЯ(Организация) = ТИП(Справочник.Контрагенты)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МенеджерУдаляемойЗаписи = РегистрыСведений.СведенияКомпании.СоздатьМенеджерЗаписи();
			
			МенеджерУдаляемойЗаписи.Организация = Выборка.Контрагент;
			МенеджерУдаляемойЗаписи.Объект = Выборка.Объект;
			МенеджерУдаляемойЗаписи.Период = Выборка.Период;
			
			МенеджерУдаляемойЗаписи.Прочитать();
			
			Если МенеджерУдаляемойЗаписи.Выбран() Тогда
				МенеджерУдаляемойЗаписи.Удалить();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
// -Рарус

#КонецОбласти
