/////////////////////////////////////////////////////////////////////////////////////////////////////
// ЗАЩИЩЕННЫЕ ФУНКЦИИ КЛИЕНТСКОГО КОНТЕКСТА
/////////////////////////////////////////////////////////////////////////////////////////////////////


/////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ФУНКЦИИ ЗАЩИТЫ

Функция ПолучитьЗащищенныйМодуль(Имя = "ЗащитаТОР") Экспорт
	
	ИмяМенеджера = ?(ПараметрыПриложения.Получить("РежимОтладкиЗащиты")=ИСТИНА, "Обработка", "ВнешняяОбработка");
	Возврат ПолучитьФорму(ИмяМенеджера + "." + Имя + ".Форма");
	
КонецФункции // ПолучитьЗащищенныйМодуль()

Функция ПолучитьОтладочныйЗащищенныйМодуль(Имя = "ЗащитаТОР") Экспорт
	
	Возврат ПолучитьФорму("Обработка." + Имя + ".Форма");
	
КонецФункции // ПолучитьОтладочныйЗащищенныйМодуль()
