// Модуль менеджера справочника "Договоры взаиморасчетов"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Заполнение реквизита "Контроль максимальной суммы кредита" для уже введенных договоров с нулевой суммой кредита.
//
Процедура УстановкаКонтроляМаксимальнойСуммыКредита() Экспорт
	
	// Выполним проверку повторной установки данного релиза
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДоговорыВзаиморасчетов.Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	               |ГДЕ
	               |	ДоговорыВзаиморасчетов.ОтменаКонтроляСуммыКредита = ИСТИНА";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		// Установка реквизита "Отмена контроля суммы кредита" у договора ранее уже производилась,
		// повторное заполнение не требуется.
		Возврат;
	КонецЕсли;
	
	// У всех договоров с суммой кредита 0.00 взводим флаг не контролировать кредит
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДоговорыВзаиморасчетов.Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	               |ГДЕ
	               |	ДоговорыВзаиморасчетов.МаксимальныйКредит = 0";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДоговорСсылка = Выборка.Ссылка;
		ДоговорОбъект = ДоговорСсылка.ПолучитьОбъект();
		ДоговорОбъект.ОтменаКонтроляСуммыКредита = Истина;
		Если ДоговорОбъект.Модифицированность() Тогда
			ДоговорОбъект.ОбменДанными.Загрузка=Истина;
			ДоговорОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // УстановкаКонтроляМаксимальнойСуммыКредита()

// Заполнение реквизита "ЗаполнитьФлагАвтоЗакрытиеСделок" для уже введенных документов.
//
Процедура ЗаполнитьФлагАвтоЗакрытиеСделок() Экспорт
	
	СписокДокументов = Новый СписокЗначений;   
	СписокДокументов.Добавить("АвансовыйОтчет","АвансовыйОтчет");
	СписокДокументов.Добавить("ВводОстатковВзаиморасчетовСостав","ВводОстатковВзаиморасчетов.Состав");
	СписокДокументов.Добавить("ВозвратОтПокупателя","ВозвратОтПокупателя");
	СписокДокументов.Добавить("ВозвратПоставщику","ВозвратПоставщику");
	СписокДокументов.Добавить("Инвентаризация","Инвентаризация");
	СписокДокументов.Добавить("НачислениеЗарплатыСотрудники","НачислениеЗарплаты.Сотрудники");
	СписокДокументов.Добавить("ОбслуживаниеАктива","ОбслуживаниеАктива");
	СписокДокументов.Добавить("ОтчетКомиссионераТовары","ОтчетКомиссионера.Товары");
	СписокДокументов.Добавить("ОтчетКомитентуТовары","ОтчетКомитенту.Товары");
	СписокДокументов.Добавить("ПоступлениеТоваров","ПоступлениеТоваров");
	СписокДокументов.Добавить("ПоступлениеДопРасходов","ПоступлениеДопРасходов");
	СписокДокументов.Добавить("РеализацияАктивов","РеализацияАктивов");
	СписокДокументов.Добавить("РеализацияТоваров","РеализацияТоваров");
	СписокДокументов.Добавить("ТаможеннаяДекларацияИмпорт","ТаможеннаяДекларацияИмпорт");
	СписокДокументов.Добавить("ЧекОплаты","Чек.Оплаты");
	СписокДокументов.Добавить("ЧекНаОплатуОплаты","ЧекНаОплату.Оплаты");

	Запрос = Новый Запрос;
	ТекстЗапроса = "";
	
	ШаблонЗапроса = "ВЫБРАТЬ
	|	$НомерСтроки$ КАК НомерСтроки,
	|	$СтрокаЗначение$.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.$СтрокаПредставление$ КАК $СтрокаЗначение$
	|ГДЕ
	|	$СтрокаЗначение$.$ПутьКДоговору$ДоговорВзаиморасчетов.АвтоЗакрытиеСделок = ИСТИНА";
	
	ТекстИтоги = "
	|ИТОГИ ПО
	|	Ссылка";
		
	УсловиеСтроки = "
	|	$СтрокаЗначение$.НомерСтроки";
	
	Для Каждого Строка Из СписокДокументов Цикл
		
		Если НЕ ТекстЗапроса = "" Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + ШаблонЗапроса;
		
		Если Строка.Значение = "ОтчетКомиссионераТовары" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$ПутьКДоговору$", "ДокументПередачи.");
		ИначеЕсли Строка.Значение = "ОтчетКомитентуТовары" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$СтрокаЗначение$.$ПутьКДоговору$ДоговорВзаиморасчетов.АвтоЗакрытиеСделок", " 
			|	ВЫБОР
	        |		КОГДА ОтчетКомитентуТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетАгента)
	        |			ТОГДА ОтчетКомитентуТовары.ДокументРеализации.ДоговорВзаиморасчетов.АвтоЗакрытиеСделок
	        |		ИНАЧЕ ОтчетКомитентуТовары.ДокументПоступления.ДоговорВзаиморасчетов.АвтоЗакрытиеСделок
	        |	КОНЕЦ");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$ПутьКДоговору$", "");
		КонецЕсли;
		
		Если СтрНайти(Строка.Представление,".") = 0 Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$НомерСтроки$", 0);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$НомерСтроки$", УсловиеСтроки);
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$СтрокаПредставление$", Строка.Представление);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$СтрокаЗначение$", Строка.Значение);
		
	КонецЦикла;	
	
	Запрос.Текст = ТекстЗапроса + ТекстИтоги;
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		ДокументСсылка = Выборка.Ссылка;
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		Представление = СтрЗаменить(ОбщегоНазначения.ИмяТаблицыПоСсылке(ДокументСсылка),"Документ.","");
		Если НЕ СписокДокументов.НайтиПоЗначению(Представление) = Неопределено Тогда
			ДокументОбъект.АвтоЗакрытиеСделок = Истина;
		Иначе
			Для Каждого Строка Из СписокДокументов Цикл
				Если СтрНайти(Строка.Представление,Представление) = 0 Тогда
					Продолжить;
				Иначе
					ДетальнаяВыборка = Выборка.Выбрать();
					Пока ДетальнаяВыборка.Следующий() Цикл
						ТабличнаяЧасть = СтрЗаменить(Строка.Представление,Представление + ".","");
						ДокументОбъект[ТабличнаяЧасть][ДетальнаяВыборка.НомерСтроки-1].АвтоЗакрытиеСделок = Истина;
					КонецЦикла;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		ДокументОбъект.ОбменДанными.Загрузка=Истина;
		ДокументОбъект.Записать();
	КонецЦикла;
	
	// Приватно обработаем выплату. Так как тут в проведении раньше всегда была Истина.
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	ВыплатаЗарплатыСотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВыплатаЗарплаты.Сотрудники КАК ВыплатаЗарплатыСотрудники";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументСсылка = Выборка.Ссылка;
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		Для Каждого Строка Из ДокументОбъект.Сотрудники Цикл
			Строка.АвтоЗакрытиеСделок = Истина;
		КонецЦикла;
		ДокументОбъект.ОбменДанными.Загрузка=Истина;
		ДокументОбъект.Записать();
	КонецЦикла;	
	
КонецПроцедуры // ЗаполнитьФлагАвтоЗакрытиеСделок()

// Заполнение тип договора у введенных договоров
//
Процедура УстановитьТипДоговора() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	               |ГДЕ
	               |	ДоговорыВзаиморасчетов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДоговорВзаиморасчетов = Выборка.Ссылка.ПолучитьОбъект();
		ДоговорВзаиморасчетов.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
		
		ДоговорВзаиморасчетов.ОбменДанными.Загрузка = Истина;
		Попытка
			ДоговорВзаиморасчетов.Записать();
			ВывестиСообщение(НСтр("ru='Обновлен справочник ""%1"".'"),,,,, СокрЛП(ДоговорВзаиморасчетов.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Договоры взаиморасчетов""'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры // УстановитьВидДеятельностиДоговора()

// Производит получение вида операции
Функция ПолучитьВидОперации(ВидДоговора) Экспорт
	
	Результат = Неопределено;
	Если ВидДоговора = Перечисления.ВидыДоговоров.Покупка ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.СКомитентом Тогда
		Результат = Перечисления.ВидыОперацийДоговора.Покупка;
	ИначеЕсли ВидДоговора = Перечисления.ВидыДоговоров.Продажа ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.СКомиссионером Тогда
		Результат = Перечисления.ВидыОперацийДоговора.Продажа;
	Иначе
		Результат = Перечисления.ВидыОперацийДоговора.Внутренняя;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьВидОперации()

// Производит получение вида операции
Функция ПроверитьОсновнойДоговор(Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДоговорыВзаиморасчетов.Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	               |ГДЕ
	               |	ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора
	               |	И ДоговорыВзаиморасчетов.Основной = ИСТИНА
	               |	И ДоговорыВзаиморасчетов.Организация = &Организация
	               |	И ДоговорыВзаиморасчетов.ПодразделениеКомпании = &ПодразделениеКомпании
	               |	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ
	               |	И ДоговорыВзаиморасчетов.Ссылка <> &Ссылка
	               |	И ДоговорыВзаиморасчетов.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Организация",Договор.Организация);
	Запрос.УстановитьПараметр("ПодразделениеКомпании",Договор.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ВидДоговора",Договор.ВидДоговора);
	Запрос.УстановитьПараметр("Владелец",Договор.Владелец);
	Запрос.УстановитьПараметр("Ссылка",Договор.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	КонецЕсли;
	
	
КонецФункции //ПроверитьОсновнойДоговор()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	ОбязательныеРеквизиты.Добавить("ВидДоговора");
	ОбязательныеРеквизиты.Добавить("ВалютаВзаиморасчетов");
	ОбязательныеРеквизиты.Добавить("ТипДоговора");
	
	Если НЕ Объект.ТипДоговора = Перечисления.ТипыДоговоров.ВиртуальныйДоговор Тогда
		ОбязательныеРеквизиты.Добавить("ДатаНачала");
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ПризнакАгента) Тогда
		ОбязательныеРеквизиты.Добавить("ИННПоставщика");	
	КонецЕсли;	
	
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ВидДоговора");
	Результат.Добавить("Организация");
	Результат.Добавить("ПодразделениеКомпании");
	Результат.Добавить("ВалютаВзаиморасчетов");
	Возврат Результат;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Подразделение".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Вызываем общий обработчик события
	ОбработкаСобытийСправочникаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаВзаиморасчетов) Тогда
		Объект.ВалютаВзаиморасчетов = Объект.ПодразделениеКомпании.ОсновнаяВалютаВзаиморасчетов;
	КонецЕсли;
	
	Объект.АвтоЗакрытиеСделок = Объект.Организация.АвтоЗакрытиеСделок;
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Вызываем общий обработчик события
	ОбработкаСобытийСправочникаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
	Объект.АвтоЗакрытиеСделок = Объект.Организация.АвтоЗакрытиеСделок;
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Формирует стандартное наименование договора
// вида Договор поставки №ХХХХХ а Валюте от ДД.ММ.ГГГГ
// Используется как при интерактивном, так и при программном создании.
//
// Параметры:
//  Объект   - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
Функция СформироватьНаименованиеПоУмолчанию(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Наименование = "";
	
	Если ЗначениеЗаполнено(Объект.ТипДоговора)
			И ЗначениеЗаполнено(Объект.ВидДоговора)
			И ЗначениеЗаполнено(Объект.ВалютаВзаиморасчетов) Тогда
		
		Если (Объект.ТипДоговора = Перечисления.ТипыДоговоров.ВиртуальныйДоговор) Тогда
			
			Наименование = СокрЛП(Строка(Объект.ВидДоговора)) + " в " + Объект.ВалютаВзаиморасчетов.Наименование;
			
		Иначе
			
			Наименование = СокрЛП(Строка(Объект.ВидДоговора))
								+ ?(ПустаяСтрока(Объект.НомерДоговора),""," № " + СокрЛП(Объект.НомерДоговора))
								+ " в " + Объект.ВалютаВзаиморасчетов.Наименование
								+ " от "+Формат(Объект.ДатаНачала,"ДФ=дд.ММ.гг");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции // СформироватьНаименованиеПоУмолчанию()

// Обработчик события возникающего при изменении данных реквизита "Тип суммы комиссии".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура ТипСуммыКомиссииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.ТипСуммыКомиссии = 0 Тогда
		Объект.ПроцентКомиссионногоВознаграждения = ?(Объект.СуммаКомиссионногоВознаграждения > 0,Объект.СуммаКомиссионногоВознаграждения ,0 );
		Объект.СуммаКомиссионногоВознаграждения = 0;
	ИначеЕсли Объект.ТипСуммыКомиссии = 1 Тогда
		Объект.СуммаКомиссионногоВознаграждения = ?(Объект.ПроцентКомиссионногоВознаграждения > 0,Объект.ПроцентКомиссионногоВознаграждения ,0 );
		Объект.ПроцентКомиссионногоВознаграждения = 0;
	КонецЕсли
	
КонецПроцедуры // ТипСуммыКомиссииПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли