// @strict-types

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  Приглашения - Массив из см. ПриглашенияЭДОКлиентСервер.НовоеИсходящееПриглашение
//  РасшифрованныеМаркеры - см. КриптографияБЭДКлиентСервер.НовыйНаборРасшифрованныхДанных
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ОтправитьПриглашенияВФоне(Знач Приглашения, Знач РасшифрованныеМаркеры) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	
	// см. ПриглашенияЭДОИнтеграцияЦентраЭДО.ОтправитьПриглашения
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"ПриглашенияЭДОИнтеграцияЦентраЭДО.ОтправитьПриглашения", Приглашения, РасшифрованныеМаркеры);
	
КонецФункции

// Параметры:
//  Приглашения - Массив из см. ПриглашенияЭДОКлиент.НовоеВходящееПриглашение
//  РасшифрованныеМаркеры - см. КриптографияБЭДКлиентСервер.НовыйНаборРасшифрованныхДанных
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ПринятьПриглашенияВФоне(Знач Приглашения, Знач РасшифрованныеМаркеры) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"ПриглашенияЭДОИнтеграцияЦентраЭДО.ПринятьПриглашения", Приглашения, РасшифрованныеМаркеры);
	
КонецФункции

// Параметры:
//  Приглашения - Массив из см. ПриглашенияЭДОКлиент.НовоеВходящееПриглашение
//  РасшифрованныеМаркеры - см. КриптографияБЭДКлиентСервер.НовыйНаборРасшифрованныхДанных
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ОтклонитьПриглашенияВФоне(Знач Приглашения, Знач РасшифрованныеМаркеры) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"ПриглашенияЭДОИнтеграцияЦентраЭДО.ОтклонитьПриглашения", Приглашения, РасшифрованныеМаркеры);
	
КонецФункции

// Параметры:
//  ДлительнаяОперация - Неопределено
//                     - См. ДлительныеОперации.ВыполнитьФункцию
// 
// Возвращаемое значение:
//  См. ПриглашенияЭДОИнтеграцияЦентраЭДО.НовыйРезультатДействияСПриглашениями
Функция РезультатДействияСПриглашениямиВФоне(Знач ДлительнаяОперация) Экспорт
	
	Результат = ПриглашенияЭДОИнтеграцияЦентраЭДО.НовыйРезультатДействияСПриглашениями();
	
	Если ДлительнаяОперация <> Неопределено
		И ДлительнаяОперация.Статус = "Выполнено" Тогда
		РезультатОперации = ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата); // См. ИнтеграцияЦентраЭДО.НовыйРезультатДействияСПриглашениями
		УдалитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата);
		Если ТипЗнч(РезультатОперации) = Тип("Структура") Тогда
			Результат = РезультатОперации;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
