#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыПлатформаСервер.ВывестиОтчет(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
	ДокументРезультат.ФиксацияСверху = 8;
	
	Если ПравоПользователя("ВыводитьКодВОтчетах") Тогда
		ДокументРезультат.ФиксацияСлева = 2;
	Иначе
		ДокументРезультат.ФиксацияСлева = 1;
	КонецЕсли;
	
КонецПроцедуры //ПриКомпоновкеРезультата()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// проверка заполнения контрагента
	КонтрагентЗаполнен = Ложь;
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Контрагент") И ЭлементОтбора.Использование	И ЗначениеЗаполнено(ЭлементОтбора.ПравоеЗначение) Тогда
			КонтрагентЗаполнен = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ КонтрагентЗаполнен Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указан отбор по контрагенту ! Отбор по контргаенту, является обязательным для данного отчета.'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры //ОбработкаПроверкиЗаполнения()

#КонецЕсли