
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОповещениеВопросПроведениеПередПечатьюЧека(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
			НапечататьЧекКоррекцииКлиент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;  
		
	КвалификаторСтроки = Новый КвалификаторыСтроки(50);
	ОснованиеДляКоррекцииЗаданоТолькоСтрокой = Метаданные.ОпределяемыеТипы.ОснованиеКассовогоЧекаКоррекцииБПО.Тип = Новый ОписаниеТипов("Строка",, КвалификаторСтроки);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УстановитьРеквизитыФормы()
	КонецЕсли;
		
	КассовыйЧекКоррекцииПереопределяемый.ПриСозданииНаСервере(Объект, ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	УстановитьДоступностьЭлементовИФормы();
	
	Если Не ПустаяСтрока(Объект.Организация) Тогда
		ОбновитьСистемыНалогообложения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Дата<Дата(2019,01,01) Тогда
		Элементы.СуммаНДС18.Заголовок = "Сумма НДС 18%";
		Элементы.СуммаНДС118.Заголовок = "Сумма НДС 18/118%";
	Иначе
		Элементы.СуммаНДС18.Заголовок = "Сумма НДС 20%";
		Элементы.СуммаНДС118.Заголовок = "Сумма НДС 20/120%";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьРеквизитыФормы();
	
	КассовыйЧекКоррекцииПереопределяемый.ПриЧтенииНаСервере(Объект, ЭтотОбъект, ТекущийОбъект);
	
	УстановитьДоступностьЭлементовИФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьДоступностьЭлементовИФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	КассовыйЧекКоррекцииПереопределяемый.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапки

&НаСервере
Процедура ОбновитьСистемыНалогообложения();
	
	СтандартнаяОбработка = Истина;
	МассивСистемНалогообложения = Новый Массив();
	
	КассовыйЧекКоррекцииПереопределяемый.ПолучитьДоступныеСистемыНалогообложения(Объект.Организация, МассивСистемНалогообложения, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		Для Каждого СистемаНалогообложенияККТ Из Перечисления.ТипыСистемНалогообложенияККТ Цикл
			МассивСистемНалогообложения.Добавить(СистемаНалогообложенияККТ);
		КонецЦикла;
	КонецЕсли;
	
	СписокВыбора = Элементы.СистемаНалогообложения.СписокВыбора;
	СписокВыбора.Очистить();
	
	Для Каждого СистемаНалогообложения Из МассивСистемНалогообложения Цикл
		СписокВыбора.Добавить(СистемаНалогообложения);
	КонецЦикла;
	
	Если МассивСистемНалогообложения.Количество() = 1 Тогда
		Объект.СистемаНалогообложения = МассивСистемНалогообложения[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.КассаККМ = "";
	
	ОбновитьСистемыНалогообложения();
	
КонецПроцедуры

// +РАРУС

&НаКлиенте
Процедура ПодразделениеКомпанииПриИзменении(Элемент)
	
	ПодразделениеКомпанииПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПодразделениеКомпанииПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ПодразделениеКомпании) Тогда
		ОрганизацияПодразделения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПодразделениеКомпании, "Организация");
		Если Объект.Организация <> ОрганизацияПодразделения Тогда
			Объект.Организация = Объект.ПодразделениеКомпании.Организация;
			Объект.КассаККМ = "";
			ОбновитьСистемыНалогообложения();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// -РАРУС


&НаКлиенте
Процедура КассаККМПриИзменении(Элемент)
	
	КассаККМПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеДляКоррекцииПриИзменении(Элемент)
	
	Если НЕ ОснованиеДляКоррекцииЗаданоТолькоСтрокой И ЗначениеЗаполнено(Объект.ОснованиеДляКоррекции) Тогда
		ОснованиеДляКоррекцииПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПриИзменении(Элемент)
	
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если Объект.Дата<Дата(2019,01,01) Тогда
		Элементы.СуммаНДС18.Заголовок = "Сумма НДС 18%";
		Элементы.СуммаНДС118.Заголовок = "Сумма НДС 18/118%";
	Иначе
		Элементы.СуммаНДС18.Заголовок = "Сумма НДС 20%";
		Элементы.СуммаНДС118.Заголовок = "Сумма НДС 20/120%";
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СуммаБезНДСПриИзменении(Элемент)
	
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаНДС0ПриИзменении(Элемент)
	
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаНДС10ПриИзменении(Элемент)
	
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаНДС18ПриИзменении(Элемент)
	
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаНДС110ПриИзменении(Элемент)
	
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаНДС118ПриИзменении(Элемент)
	
	ПересчитатьДокументНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура выполняет печать чека на фискальном регистраторе.
//
&НаКлиенте
Процедура НапечататьЧекКоррекции(Команда)
	
	ОчиститьСообщения();
	
	Если Объект.ПробитЧек Тогда
		ТекстСообщения = НСтр("ru = 'Чек уже пробит на фискальном устройстве.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВопросПроведениеПередПечатьюЧека", ЭтотОбъект);
	
	Если КассовыйЧекКоррекцииКлиентПереопределяемый.ПроверитьВозможностьПечатиЧека(ОбработчикОповещения, ЭтотОбъект) Тогда
		НапечататьЧекКоррекцииКлиент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

#Область СлужебныеПроцедурыКлеинт

&НаСервере
Функция ВернутьИтогиОплатыПоВиду(ТипОплаты) Экспорт
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипОплаты", ТипОплаты);
	НайденныеСтроки = Объект.Оплата.Выгрузить(ПараметрыОтбора,"Сумма");
	Возврат НайденныеСтроки.Итог("Сумма");
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыЧека();
	
	РеквизитыКассир = ПолучитьРеквизитыКассира();
	
	ПараметрыЧека = МенеджерОборудованияКлиентСервер.ПараметрыОперацииЧекаКоррекции();
		
	ПараметрыЧека.ТипРасчета   = Объект.ТипРасчета;
	ПараметрыЧека.ДанныеКоррекции.ТипКоррекции = Объект.ТипКоррекции;
	
	ПараметрыЧека.Кассир     = РеквизитыКассир.Наименование; // ФИО лица, осуществившего расчет с покупателем (клиентом), оформившего кассовый чек.
	ПараметрыЧека.КассирИНН  = РеквизитыКассир.ИНН; // Идентификационный номер налогоплательщика кассира, при наличии.
		
	ПараметрыЧека.СистемаНалогообложения  = Объект.СистемаНалогообложения;  // Системы налогообложения
	
	Если ОснованиеДляКоррекцииЗаданоТолькоСтрокой Тогда
		ПараметрыЧека.ДанныеКоррекции.ОписаниеКоррекции = Объект.ОснованиеДляКоррекции;   // Наименование документа основания для коррекции
		Если ЗначениеЗаполнено(Объект.ДатаДокументаОснования) Тогда
			ПараметрыЧека.ДанныеКоррекции.ДатаКоррекции  = Объект.ДатаДокументаОснования;  // Дата документа основания для коррекции
		КонецЕсли;
		ПараметрыЧека.НомерДокументаОснования = Объект.НомерДокументаОснования; // Номер документа основания для коррекции
	ИначеЕсли ЗначениеЗаполнено(Объект.ОснованиеДляКоррекции) И Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Объект.ОснованиеДляКоррекции)) Тогда
		ПараметрыЧека.ДанныеКоррекции.ОписаниеКоррекции   = Строка(ТипЗнч(Объект.ОснованиеДляКоррекции)); 
		ПараметрыЧека.ДанныеКоррекции.ДатаКоррекции  = Объект.ОснованиеДляКоррекции.Дата;
		ПараметрыЧека.ДанныеКоррекции.НомерПредписания = Объект.ОснованиеДляКоррекции.Номер;
	КонецЕсли;
	
	ПараметрыЧека.НеприменениеККТ = Истина;
	
	// Проведем суммы ндс
 	Ставка1820 = ?(Объект.Дата<Дата(2019,01,01), 18,20);	
	
	СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	СтрокаПозицииЧека.Наименование = "Корректировка данных";
	СтрокаПозицииЧека.Количество     = 1;
	СтрокаПозицииЧека.Цена           = Объект.СуммаБезНДС;
	СтрокаПозицииЧека.ЦенаСоСкидками = Объект.СуммаБезНДС;
	СтрокаПозицииЧека.Сумма          = Объект.СуммаБезНДС;
	СтрокаПозицииЧека.СтавкаНДС      = Неопределено;
	СтрокаПозицииЧека.СуммаНДС       = Объект.СуммаБезНДС;
	СтрокаПозицииЧека.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
	ПараметрыЧека.ПозицииЧека.Добавить(СтрокаПозицииЧека);
	
	СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	СтрокаПозицииЧека.Наименование = "Корректировка данных";
	СтрокаПозицииЧека.Количество     = 1;
	СтрокаПозицииЧека.Цена           = Объект.СуммаНДС0;
	СтрокаПозицииЧека.ЦенаСоСкидками = Объект.СуммаНДС0;
	СтрокаПозицииЧека.Сумма          = Объект.СуммаНДС0;
	СтрокаПозицииЧека.СтавкаНДС      = 0;
	СтрокаПозицииЧека.СуммаНДС       = Объект.СуммаНДС0;
	СтрокаПозицииЧека.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
	ПараметрыЧека.ПозицииЧека.Добавить(СтрокаПозицииЧека);

	СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	СтрокаПозицииЧека.Наименование = "Корректировка данных";
	СтрокаПозицииЧека.Количество     = 1;
	СтрокаПозицииЧека.Цена           = Объект.СуммаНДС10 * 10;
	СтрокаПозицииЧека.ЦенаСоСкидками = Объект.СуммаНДС10 * 10;
	СтрокаПозицииЧека.Сумма          = Объект.СуммаНДС10 * 10;
	СтрокаПозицииЧека.СтавкаНДС      = 10;
	СтрокаПозицииЧека.СуммаНДС       = Объект.СуммаНДС10;
	СтрокаПозицииЧека.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
	ПараметрыЧека.ПозицииЧека.Добавить(СтрокаПозицииЧека);

	СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	СтрокаПозицииЧека.Наименование = "Корректировка данных";
	СтрокаПозицииЧека.Количество     = 1;
	СтрокаПозицииЧека.Цена           = Окр(Объект.СуммаНДС18 * 100/Ставка1820,2,1);
	СтрокаПозицииЧека.ЦенаСоСкидками = Окр(Объект.СуммаНДС18 * 100/Ставка1820,2,1);
	СтрокаПозицииЧека.Сумма          = Окр(Объект.СуммаНДС18 * 100/Ставка1820,2,1);
	СтрокаПозицииЧека.СтавкаНДС      = 20;
	СтрокаПозицииЧека.СуммаНДС       = Объект.СуммаНДС18;
	СтрокаПозицииЧека.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
	ПараметрыЧека.ПозицииЧека.Добавить(СтрокаПозицииЧека);

	СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	СтрокаПозицииЧека.Наименование = "Корректировка данных";
	СтрокаПозицииЧека.Количество     = 1;
	СтрокаПозицииЧека.Цена           = Объект.СуммаНДС110 * 10;
	СтрокаПозицииЧека.ЦенаСоСкидками = Объект.СуммаНДС110 * 10;
	СтрокаПозицииЧека.Сумма          = Объект.СуммаНДС110 * 10;
	СтрокаПозицииЧека.СтавкаНДС      = 110;
	СтрокаПозицииЧека.СуммаНДС       = Объект.СуммаНДС110;
	СтрокаПозицииЧека.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
	ПараметрыЧека.ПозицииЧека.Добавить(СтрокаПозицииЧека);

	СтрокаПозицииЧека = МенеджерОборудованияКлиентСервер.ПараметрыФискальнойСтрокиЧека(); 
	СтрокаПозицииЧека.Наименование = "Корректировка данных";
	СтрокаПозицииЧека.Количество     = 1 ;
	СтрокаПозицииЧека.Цена           = Окр(Объект.СуммаНДС118 * 100/Ставка1820,2,1);
	СтрокаПозицииЧека.ЦенаСоСкидками = Окр(Объект.СуммаНДС118 * 100/Ставка1820,2,1);
	СтрокаПозицииЧека.Сумма          = Окр(Объект.СуммаНДС118 * 100/Ставка1820,2,1);
	СтрокаПозицииЧека.СтавкаНДС      = 120;
	СтрокаПозицииЧека.СуммаНДС       = Объект.СуммаНДС118;
	СтрокаПозицииЧека.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;
	ПараметрыЧека.ПозицииЧека.Добавить(СтрокаПозицииЧека);

	// Оплаты
	ТекстОшибки = "";
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КассовыйЧекКоррекцииОплата.ТипОплаты КАК ТипОплатыККТ,
	|	КассовыйЧекКоррекцииОплата.Сумма КАК Сумма
	|ИЗ
	|	Документ.КассовыйЧекКоррекции.Оплата КАК КассовыйЧекКоррекцииОплата
	|ГДЕ
	|	КассовыйЧекКоррекцииОплата.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	СуммаНаличные = 0;
	СуммаЭлектронно = 0;
	СуммаПредоплата = 0;
	СуммаПостоплата = 0;
	СуммаПредоставление = 0;
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл 
			Если Выборка.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Наличные Тогда
				СуммаНаличные = СуммаНаличные + Выборка.Сумма;
			ИначеЕсли Выборка.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Электронно Тогда
				СуммаЭлектронно = СуммаЭлектронно + Выборка.Сумма;
			ИначеЕсли Выборка.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Предоплата Тогда
				СуммаПредоплата = СуммаПредоплата + Выборка.Сумма;
			ИначеЕсли Выборка.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Постоплата Тогда
				СуммаПостоплата = СуммаПостоплата + Выборка.Сумма;
			ИначеЕсли Выборка.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.ВстречноеПредоставление Тогда
				СуммаПредоставление = СуммаПредоставление + Выборка.Сумма;
			ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.ТипОплатыККТ) Тогда
				Если ПустаяСтрока(ТекстОшибки) Тогда
					ТекстОшибки = НСтр("ru = 'Для типа оплаты'") + " """ + Выборка.Представление + """ " 
					+ НСтр("ru = 'не указан ""Тип оплаты ККТ'") + """";
				Иначе
					ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = 'Для типа оплаты'") + " """+ Выборка.Представление 
					+ """ " + НСтр("ru = 'не указан ""Тип оплаты ККТ'") + """";
				КонецЕсли;
				Преобразована = Ложь;
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		
		// Наличные
		Если СуммаНаличные > 0 Тогда
			СтрокаОплаты = Новый Структура();
			СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Наличные);
			СтрокаОплаты.Вставить("Сумма", СуммаНаличные);
			ПараметрыЧека.ТаблицаОплат.Добавить(СтрокаОплаты);
		КонецЕсли;
		
		// Электронно
		Если СуммаЭлектронно > 0 Тогда
			СтрокаОплаты = Новый Структура();
			СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Электронно);
			СтрокаОплаты.Вставить("Сумма", СуммаЭлектронно);
			ПараметрыЧека.ТаблицаОплат.Добавить(СтрокаОплаты);
		КонецЕсли;
		
		// Предоплата
		Если СуммаПредоплата > 0 Тогда
			СтрокаОплаты = Новый Структура();
			СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Предоплата);
			СтрокаОплаты.Вставить("Сумма", СуммаПредоплата);
			ПараметрыЧека.ТаблицаОплат.Добавить(СтрокаОплаты);
		КонецЕсли;
		
		// Постоплата
		Если СуммаПостоплата > 0 Тогда
			СтрокаОплаты = Новый Структура();
			СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Постоплата);
			СтрокаОплаты.Вставить("Сумма", СуммаПостоплата);
			ПараметрыЧека.ТаблицаОплат.Добавить(СтрокаОплаты);
		КонецЕсли;
		
		// Встречное предоставление
		Если СуммаПредоставление > 0 Тогда
			СтрокаОплаты = Новый Структура();
			СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.ВстречноеПредоставление);
			СтрокаОплаты.Вставить("Сумма", СуммаПредоставление);
			ПараметрыЧека.ТаблицаОплат.Добавить(СтрокаОплаты);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПараметрыЧека;
	
КонецФункции

&НаКлиенте
Процедура НапечататьЧекКоррекцииКлиент()
	
	Перем Отказ, ИдентификаторУстройства, ИспользоватьКассуБезПодключенияОборудования;
	
	Если ПустаяСтрока(Объект.ПодключаемоеОборудование) И ПустаяСтрока(Объект.КассаККМ) Тогда
		ТекстСообщения = НСтр("ru = 'Фискальное устройство не выбрано.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ПодготовитьИПроверитьПечатьЧека(Отказ, ИдентификаторУстройства, ИспользоватьКассуБезПодключенияОборудования);
	
	Если Отказ Тогда
		Возврат
	КонецЕсли;
	
	Если НЕ ИспользоватьПодключаемоеОборудование ИЛИ ИспользоватьКассуБезПодключенияОборудования Тогда
		
		Объект.НомерЧекаККМ  = КассовыйЧекКоррекцииКлиентПереопределяемый.ПорядковыйНомерПродажи();
		Объект.ПробитЧек     = Истина;
		
		Модифицированность = Истина;
		
		РезультатЗаписи = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		
		Если РезультатЗаписи = Истина Тогда
			КассовыйЧекКоррекцииКлиентПереопределяемый.УвеличитьПорядковыйНомерПродажи();
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Если ИдентификаторУстройства <> Неопределено Тогда
		
		Доступность = Ложь;
		
		Контекст = Новый Структура("ИдентификаторУстройства", ИдентификаторУстройства);
		
		ПараметрыЧека = ПолучитьПараметрыЧека();
	
		Оповещение = Новый ОписаниеОповещения("НапечататьЧекКоррекцииЗавершение", ЭтотОбъект, Контекст);
		МенеджерОборудованияКлиент.НачатьФормированиеЧекаКоррекцииНаФискальномУстройстве(Оповещение, УникальныйИдентификатор, ПараметрыЧека, ИдентификаторУстройства); 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НапечататьЧекКоррекцииЗавершение(РезультатВыполнения, ПараметрыОперации) Экспорт
	
	Доступность = Истина;
	
	Если РезультатВыполнения.Результат Тогда
		
		// Установить полученное значение номера чека реквизиту документа.
		Объект.НомерЧекаККМ = РезультатВыполнения.ВыходныеПараметры[1];
		Объект.ПробитЧек    = Истина;
		Модифицированность  = Истина;
		РезультатЗаписи = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		
		Если РезультатЗаписи = Истина Тогда
			КассовыйЧекКоррекцииКлиентПереопределяемый.УвеличитьПорядковыйНомерПродажи();
		КонецЕсли;
		
	Иначе
		ТекстСообщения = НСтр("ru = 'При печати чека коррекции произошла ошибка.
									|Чек коррекции не напечатан на фискальном устройстве.
									|Дополнительное описание: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыСервер

&НаСервере
Процедура УстановитьРеквизитыФормы()
	
	КвалификаторСтроки = Новый КвалификаторыСтроки(10);
	КассаККМОтсутствуетВКонфигурации = Метаданные.ОпределяемыеТипы.КассаБПО.Тип = Новый ОписаниеТипов("Строка",,КвалификаторСтроки);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовИФормы()
	
	ТолькоПросмотр = ТолькоПросмотр ИЛИ Объект.ПробитЧек;
	ТолькоПросмотр = ТолькоПросмотр ИЛИ ЗначениеЗаполнено(Объект.НомерЧекаККМ);
	
	Элементы.НапечататьЧек.Доступность = НЕ ТолькоПросмотр;
	
	Элементы.ГруппаНомерДатаОснования.Видимость = ОснованиеДляКоррекцииЗаданоТолькоСтрокой;
	КассовыйЧекКоррекцииПереопределяемый.УстановитьДоступностьЭлементовИФормы(Объект, ЭтотОбъект);
	
	Элементы.КассаККМ.Видимость = НЕ КассаККМОтсутствуетВКонфигурации;
	// +Рарус Элементы.ПодключаемоеОборудование.Видимость = КассаККМОтсутствуетВКонфигурации; // -Рарус.
	
КонецПроцедуры

&НаСервере
Процедура КассаККМПриИзмененииНаСервере()
	
	КассовыйЧекКоррекцииПереопределяемый.КассаККМПриИзменении(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОснованиеДляКоррекцииПриИзмененииНаСервере()
	
	КассовыйЧекКоррекцииПереопределяемый.ОснованиеДляКоррекцииПриИзменении(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьИПроверитьПечатьЧека(Отказ, 
										  ИдентификаторУстройства, 
										  ИспользоватьКассуБезПодключенияОборудования)
	
	КассовыйЧекКоррекцииПереопределяемый.ПодготовитьИПроверитьПечатьЧека(Объект,
											Отказ, 
											ИдентификаторУстройства, 
											ИспользоватьКассуБезПодключенияОборудования);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитыКассира()
	
	РеквизитыКассир = КассовыйЧекКоррекцииПереопределяемый.ПолучитьРеквизитыКассира(Объект);
	
	Возврат РеквизитыКассир;
	
КонецФункции

&НаКлиенте
Процедура КассаККМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	КассовыйЧекКоррекцииКлиентПереопределяемый.КассаККМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект);
	
КонецПроцедуры

// Процедура обновляет информацию о текущем состоянии документа.
//
&НаКлиенте
Процедура ПересчитатьДокументНаКлиенте()
	
	Ставка1820 = ?(Объект.Дата<Дата(2019,01,01), 18,20);	
	Объект.СуммаДокумента = Объект.СуммаБезНДС + Объект.СуммаНДС0 + (Объект.СуммаНДС10 * 10)
	+ Окр(Объект.СуммаНДС18 * 100/Ставка1820,2,1) + Объект.СуммаНДС110 * 10 + Окр(Объект.СуммаНДС118 * 100/Ставка1820,2,1);

КонецПроцедуры

#КонецОбласти

#КонецОбласти