
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		Если ПараметрКоманды.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		СсылкаНаОбъект = ПараметрКоманды[0];
	Иначе
		СсылкаНаОбъект = ПараметрКоманды;
	КонецЕсли;
	
	// +РАРУС
	ОткрытьФорму("Обработка.ЖурналВерсийОбъектов.Форма.ФормаОсновная",
								Новый Структура("Ссылка", СсылкаНаОбъект),
								ПараметрыВыполненияКоманды.Источник,
								СсылкаНаОбъект);
	// -РАРУС
	
КонецПроцедуры

#КонецОбласти
