
#Область ПрограммныйИнтерфейс

// Формирует текст наименования банковского счета по умолчанию.
//
// Параметры:
//  НомерСчета - Строка - номер банковского счета;
//  ПредставлениеБанка - Строка - наименование банка;
//  ПредставлениеВалюты - Строка - наименование валюты;
//  Валютный - Булево - признак валютного счета.
//  Вариант - Число - Вариант формирования наименования;
// 
// Возвращаемое значение:
//  Строка - наименование по умолчанию.
//
Функция НаименованиеБанковскогоСчетаПоУмолчанию(Знач НомерСчета, ПредставлениеБанка, Знач ПредставлениеВалюты, Валютный, Вариант = 0) Экспорт
	
	ЭлементыНаименования = Новый Массив;
	
	НомерСчета = СокрЛП(НомерСчета);
	Если Не Валютный Тогда
		ПредставлениеВалюты = "";
	КонецЕсли;
	
	Если Вариант = 1 Тогда
		
		Если Не ПустаяСтрока(НомерСчета) Тогда
			ЭлементыНаименования.Добавить(Прав(НомерСчета, 4));
		КонецЕсли;
		
		Если Не ПустаяСтрока(ПредставлениеВалюты) Тогда
			ЭлементыНаименования.Добавить(СтрШаблон(НСтр("ru = '(%1)'"), ПредставлениеВалюты));
		КонецЕсли;
		
		Если Не ПустаяСтрока(ПредставлениеБанка) Тогда
			ЭлементыНаименования.Добавить(СтрШаблон(НСтр("ru = 'в %1'"), ПредставлениеБанка));
		КонецЕсли;
		
		Наименование = СтрСоединить(ЭлементыНаименования, " ");
		
	ИначеЕсли Вариант = 2 Тогда
		
		Если Не ПустаяСтрока(ПредставлениеБанка) Тогда
			ЭлементыНаименования.Добавить(ПредставлениеБанка);
		КонецЕсли;
		
		ЭлементыВСкобках = Новый Массив;
		
		Если Не ПустаяСтрока(НомерСчета) Тогда
			ЭлементыВСкобках.Добавить(Прав(НомерСчета, 4));
		КонецЕсли;
		
		Если Не ПустаяСтрока(ПредставлениеВалюты) Тогда
			ЭлементыВСкобках.Добавить(ПредставлениеВалюты);
		КонецЕсли;
		
		СтрокаЭлементыВСкобках = СтрСоединить(ЭлементыВСкобках, ", ");
		Если Не ПустаяСтрока(СтрокаЭлементыВСкобках) Тогда
			ЭлементыНаименования.Добавить(СтрШаблон(НСтр("ru = '(%1)'"), СтрокаЭлементыВСкобках));
		КонецЕсли;
		
		Наименование = СтрСоединить(ЭлементыНаименования, " ");
		
	Иначе
		
		Если Не ПустаяСтрока(НомерСчета) Тогда
			ЭлементыНаименования.Добавить(Прав(НомерСчета, 4));
		КонецЕсли;
		
		Если Не ПустаяСтрока(ПредставлениеВалюты) Тогда
			ЭлементыНаименования.Добавить(ПредставлениеВалюты);
		КонецЕсли;
		
		Если Не ПустаяСтрока(ПредставлениеБанка) Тогда
			ЭлементыНаименования.Добавить(ПредставлениеБанка);
		КонецЕсли;
		
		Наименование = СтрСоединить(ЭлементыНаименования, ", ");
		
	КонецЕсли;
	
	Возврат Лев(Наименование, 100);
	
КонецФункции

// Формирует представление исходящего документа.
//
// Параметры:
//  Данные - Структура - Данные для формирования представления документа:
//     * ВидДокумента - ПеречислениеСсылка.ВидыДокументов - Вид документа.
//     * НомерЭД      - Строка - номер электронного документа.
//     * Дата         - Дата - Дата документа.
//  ЭтоНовый - Булево - Признак нового документа.
// 
// Возвращаемое значение:
//  Строка - представление документа.
//
Функция ПредставлениеИсходящегоДокументаПоВиду(Данные, ЭтоНовый = Ложь) Экспорт
	
	Направление = НСтр("ru = 'Исходящий'");
	Возврат ПредставлениеДокументаПоВиду(Данные, Направление, ЭтоНовый);
	
КонецФункции

// Формирует представление номенклатуры для ЭД.
//
// Параметры:
//  СвойстваНоменклатуры - Структура - Данные для формирования представления номенклатуры:
//     * Наименование - Строка - Наименование номенклатуры.
//     * ХарактеристикаНаименование - Строка - Наименование характеристики.
// 
// Возвращаемое значение:
//  Строка - представление номенклатуры.
//
Функция ПредставлениеНоменклатурыДляЭД(СвойстваНоменклатуры) Экспорт
	
	Если ЗначениеЗаполнено(СвойстваНоменклатуры.ХарактеристикаНаименование) Тогда
		ПредставлениеНоменклатуры = СтрШаблон(НСтр("ru = '%1 (%2)'"),
			СвойстваНоменклатуры.НаименованиеПолное, СвойстваНоменклатуры.ХарактеристикаНаименование);
	Иначе
		ПредставлениеНоменклатуры = СвойстваНоменклатуры.НаименованиеПолное;
	КонецЕсли;
	
	Возврат ПредставлениеНоменклатуры;
	
КонецФункции

// Формирует представление содержания товара/услуги.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура.
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - Характеристика.
// 
// Возвращаемое значение:
//  Строка - представление содержания товара/услуги.
//
Функция ПолучитьПредставлениеСодержания(Номенклатура, Характеристика) Экспорт

	Если ЗначениеЗаполнено(Номенклатура) Тогда
		НаименованиеНоменклатуры = ТорговыйКомплексЭДОВызовСервера.ЗначениеРеквизитаОбъекта(Номенклатура, "НаименованиеПолное");
		Если ЗначениеЗаполнено(Характеристика) Тогда
			НаименованиеХарактеристики = ТорговыйКомплексЭДОВызовСервера.ЗначениеРеквизитаОбъекта(Характеристика, "Наименование");
		КонецЕсли;
	КонецЕсли;
	
	СвойстваНоменклатуры = Новый Структура;
	СвойстваНоменклатуры.Вставить("НаименованиеПолное", НаименованиеНоменклатуры);
	СвойстваНоменклатуры.Вставить("ХарактеристикаНаименование", НаименованиеХарактеристики);
	
	ПредставлениеНоменклатуры = ПредставлениеНоменклатурыДляЭД(СвойстваНоменклатуры);
	
	Возврат ПредставлениеНоменклатуры;

КонецФункции

#Область КомпоновкаДанных

// Добавляет в коллекцию оформляемых полей компоновки данных новое поле
//
// Параметры:
//  КоллекцияОформляемыхПолей 	- КоллекцияОформляемыхПолейКомпоновкиДанных - Коллекция оформляемых полей.
//  ИмяПоля						- Строка - Имя поля.
//
// Возвращаемое значение:
//  ОформляемоеПолеКомпоновкиДанных - Созданное поле.
//
// Пример:
//  Форма.УсловноеОформление.Элементы[0].Поля;
//
Процедура ДобавитьОформляемоеПоле(КоллекцияОформляемыхПолей, ИмяПоля) Экспорт
	
	ОформляемоеПоле = КоллекцияОформляемыхПолей.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	
КонецПроцедуры

// Добавляет в коллекцию отбора новую группу указанного типа.
//
// Параметры:
//  КоллекцияЭлементовОтбора - КоллекцияЭлементовОтбораКомпоновкиДанных - Коллекция элементов отбора.
//  ТипГруппы - ГруппаЭлементовОтбораКомпоновкиДанных - ГруппаИ или ГруппаИли.
//
// Возвращаемое значение:
//  ГруппаЭлементовОтбораКомпоновкиДанных - Добавленная группа.
//
Функция ДобавитьГруппуОтбора(КоллекцияЭлементовОтбора, ТипГруппы) Экспорт
	
	ГруппаЭлементовОтбора            = КоллекцияЭлементовОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы  = ТипГруппы;
	
	Возврат ГруппаЭлементовОтбора;
	
КонецФункции

#КонецОбласти

// Формирует представление списков кодов маркировки.
//
// Параметры:
//  КодыУпаковок - Массив - содержит коды упаковок, для которых необходимо сформировать представление.
// 
// Возвращаемое значение:
//  Строка - представление переданных кодов маркировки в виде строки.
//
Функция ПредставлениеКодовМаркировки(Знач КодыУпаковок) Экспорт

	Возврат СтрСоединить(КодыУпаковок, "; ");

КонецФункции

// Получает наименование организации без организационно-правовой Формы.
//
// Параметры:
//  Наименование - Строка - полное или сокращенное наименование организации.
//  ЮрФизЛицо - ПеречислениеСсылка.ЮрФизЛицо - вид лица.
//
// Возвращаемое значение:
//  Структура - части наименования организации.
//     * Наименование - Строка - наименование организации без организационно-правовой Формы.
//     * ОрганизационноПравоваяФорма - Строка - организационно-правовая форма предприятия.
//     * ОрганизационноПравоваяФормаСокращенно - Строка - организационно-правовая форма предприятия сокращенно.
//
Функция РазложитьСтрокуНаименованияОрганизации(Знач Наименование, ЮрФизЛицо) Экспорт
	
	Результат = Новый Структура("Наименование,ОрганизационноПравоваяФорма,ОрганизационноПравоваяФормаСокращенно");
	
	Наименование = СокрЛП(Наименование);
	
	Если УбратьИзНаименованияОрганизационнуюФорму(Наименование, НСтр("ru='ООО'")) Тогда
		ОрганизационноПравоваяФорма           = НСтр("ru='Общество с ограниченной ответственностью'");
		ОрганизационноПравоваяФормаСокращенно = НСтр("ru='ООО'");
	ИначеЕсли УбратьИзНаименованияОрганизационнуюФорму(Наименование, НСтр("ru='ОАО'")) Тогда
		ОрганизационноПравоваяФорма           = НСтр("ru='Открытое акционерное общество'");
		ОрганизационноПравоваяФормаСокращенно = НСтр("ru='ОАО'");
	ИначеЕсли УбратьИзНаименованияОрганизационнуюФорму(Наименование, НСтр("ru='ЗАО'")) Тогда
		ОрганизационноПравоваяФорма           = НСтр("ru='Закрытое акционерное общество'");
		ОрганизационноПравоваяФормаСокращенно = НСтр("ru='ЗАО'");
	ИначеЕсли УбратьИзНаименованияОрганизационнуюФорму(Наименование, НСтр("ru='ИП'")) Тогда
		ОрганизационноПравоваяФорма           = НСтр("ru='Индивидуальный предприниматель'");
		ОрганизационноПравоваяФормаСокращенно = НСтр("ru='ИП'");
	ИначеЕсли УбратьИзНаименованияОрганизационнуюФорму(Наименование, НСтр("ru='Общество с ограниченной ответственностью'")) Тогда
		ОрганизационноПравоваяФорма           = НСтр("ru='Общество с ограниченной ответственностью'");
		ОрганизационноПравоваяФормаСокращенно = НСтр("ru='ООО'");
	ИначеЕсли УбратьИзНаименованияОрганизационнуюФорму(Наименование, НСтр("ru='Открытое акционерное общество'")) Тогда
		ОрганизационноПравоваяФорма           = НСтр("ru='Открытое акционерное общество'");
		ОрганизационноПравоваяФормаСокращенно = НСтр("ru='ОАО'");
	ИначеЕсли УбратьИзНаименованияОрганизационнуюФорму(Наименование, НСтр("ru='Закрытое акционерное общество'")) Тогда
		ОрганизационноПравоваяФорма           = НСтр("ru='Закрытое акционерное общество'");
		ОрганизационноПравоваяФормаСокращенно = НСтр("ru='ЗАО'");
	ИначеЕсли УбратьИзНаименованияОрганизационнуюФорму(Наименование, НСтр("ru='Индивидуальный предприниматель'")) Тогда
		ОрганизационноПравоваяФорма           = НСтр("ru='Индивидуальный предприниматель'");
		ОрганизационноПравоваяФормаСокращенно = НСтр("ru='ИП'");
	Иначе
		ОрганизационноПравоваяФорма           = "";
		ОрганизационноПравоваяФормаСокращенно = "";
	КонецЕсли;
	
	Если ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ФормыСобственности.ЮридическоеЛицо")
		И ЗначениеЗаполнено(ОрганизационноПравоваяФорма) Тогда
		КоличествоКавычек = СтрЧислоВхождений(Наименование, """");
		Если КоличествоКавычек > 1 Тогда
			// Наименование организации внутри внешних кавычек
			ПозицияПервойКавычки = Найти(Наименование, """");
			ПозицияПоследнейКавычки = 0;
			
			ВремНаименование = Наименование;
			
			ПозицияКавычки = ПозицияПервойКавычки;
			Пока ПозицияКавычки > 0 Цикл
				ПозицияПоследнейКавычки = ПозицияПоследнейКавычки + ПозицияКавычки;
				ВремНаименование = Сред(ВремНаименование, ПозицияКавычки + 1);
				ПозицияКавычки = Найти(ВремНаименование, """");
			КонецЦикла;
			
			Наименование = Сред(Наименование, ПозицияПервойКавычки + 1, ПозицияПоследнейКавычки - ПозицияПервойКавычки - 1);
			Если НЕ КоличествоКавычек % 2 = 0 Тогда
				Наименование = Наименование + """";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат.Наименование = СокрЛП(Наименование);
	Результат.ОрганизационноПравоваяФорма = ОрганизационноПравоваяФорма;
	Результат.ОрганизационноПравоваяФормаСокращенно = ОрганизационноПравоваяФормаСокращенно;
	
	Возврат Результат;
	
КонецФункции

// Формирует полное наименование организации.
//
// Параметры:
//  ЮрФизЛицо             - ПеречислениеСсылка.ЮрФизЛицо - содержит значение юр/физ лица.
//  СтруктураНаименования - Структура - см. РазложитьСтрокуНаименованияОрганизации.
//
// Возвращаемое значение:
//  Строка - полное наименование организации.
//
Функция СформироватьНаименованиеПолное(Знач ЮрФизЛицо, СтруктураНаименования) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураНаименования.ОрганизационноПравоваяФорма) Тогда
		НаименованиеПолное = СтруктураНаименования.Наименование;
	ИначеЕсли ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ФормыСобственности.ЮридическоеЛицо") Тогда
		НаименованиеПолное = СтрШаблон(НСтр("ru = '%1 ""%2""'"), СтруктураНаименования.ОрганизационноПравоваяФорма,
			СтруктураНаименования.Наименование);
	Иначе
		НаименованиеПолное = СтрШаблон(НСтр("ru = '%1 %2'"), СтруктураНаименования.ОрганизационноПравоваяФорма,
			СтруктураНаименования.Наименование);
	КонецЕсли;
	
	Возврат НаименованиеПолное;
	
КонецФункции

// Формирует наименование организации.
//
// Параметры:
//  СтруктураНаименования - Структура - см. РазложитьСтрокуНаименованияОрганизации.
// Возвращаемое значение:
//  Строка - наименование организации.
//
Функция СформироватьНаименование(СтруктураНаименования) Экспорт
	
	Возврат СтруктураНаименования.Наименование
		+ ?(ПустаяСтрока(СтруктураНаименования.ОрганизационноПравоваяФормаСокращенно), "", " ")
		+ СтруктураНаименования.ОрганизационноПравоваяФормаСокращенно;
	
КонецФункции

#Область ДатаПоступленияОтгрузки

Процедура ЗаполнитьРеквизитВКоллекции(Коллекция, ИмяПоля, ЗначениеЗаполнения,
	ВыделенныеСтроки = Неопределено) Экспорт

	Если ВыделенныеСтроки = Неопределено Тогда
		Для Каждого СтрокаТаблицы Из Коллекция Цикл
			СтрокаТаблицы[ИмяПоля] = ЗначениеЗаполнения;
		КонецЦикла;
	Иначе
		Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
			СтрокаТаблицы = Коллекция.НайтиПоИдентификатору(ИдентификаторСтроки);
			СтрокаТаблицы[ИмяПоля] = ЗначениеЗаполнения;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Функция МаксимальноеЗначениеВКоллекции(Коллекция, ИмяПоля, НачальноеЗначение) Экспорт

	МаксимальноеЗначение = НачальноеЗначение;
	Для Каждого СтрокаТаблицы Из Коллекция Цикл
		Если СтрокаТаблицы[ИмяПоля] > МаксимальноеЗначение Тогда
			МаксимальноеЗначение = СтрокаТаблицы[ИмяПоля];
		КонецЕсли;
	КонецЦикла;

	Возврат МаксимальноеЗначение;

КонецФункции

Процедура ПриИзмененииДатыПоступленияОтгрузки(Форма, ИмяРеквизита,
	ДатаЗаполняетсяВШапке, СтрокиКОбработке = Неопределено) Экспорт
	
	Объект = Форма.Объект;
	
	Если СтрокиКОбработке <> Неопределено Тогда
		ЗаполнитьРеквизитВКоллекции(Объект.Товары, ИмяРеквизита, Объект[ИмяРеквизита],
			СтрокиКОбработке);
	КонецЕсли;
	
	Если ДатаЗаполняетсяВШапке Тогда
		ЗаполнитьРеквизитВКоллекции(Объект.Товары, ИмяРеквизита, Объект[ИмяРеквизита]);
	Иначе
		Объект[ИмяРеквизита] = МаксимальноеЗначениеВКоллекции(Объект.Товары, ИмяРеквизита, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриИзмененииРежимаУказанияДатыПоступленияОтгрузки(Форма, ИмяРеквизита, ДатаЗаполняетсяВШапке) Экспорт
	
	Объект = Форма.Объект;
	
	Если ДатаЗаполняетсяВШапке Тогда
		Объект[ИмяРеквизита] = МаксимальноеЗначениеВКоллекции(
			Объект.Товары, ИмяРеквизита, Объект.Дата);
		
		ЗаполнитьРеквизитВКоллекции(Объект.Товары, ИмяРеквизита, Объект[ИмяРеквизита]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЭтапыГрафикаОплат

Процедура УстановитьОформлениеЭтаповГрафикаОплат(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	ИспользуетсяМногоэтапныйГрафикОплаты = Форма.ИспользуетсяМногоэтапныйГрафикОплаты;
	
	// Установка страницы графика оплат
	Если ИспользуетсяМногоэтапныйГрафикОплаты Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "ГруппаГрафикОплатыСтраницы", "ТекущаяСтраница", Элементы.ГруппаМногоэтапныйГрафикОплаты);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "ГруппаГрафикОплатыСтраницы", "ТекущаяСтраница", Элементы.ГруппаПростойГрафикОплаты);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьРеквизитыФормыГрафикаОплат(Форма) Экспорт
	
	Форма.ПредоплатаСуммаПлатежа = 0;
	Форма.ПредоплатаПроцентПлатежа = 0;
	Форма.ПредоплатаСдвиг = 0;

	Форма.ОтсрочкаСуммаПлатежа = 0;
	Форма.ОтсрочкаПроцентПлатежа = 0;
	Форма.ОтсрочкаСдвиг = 0;

КонецПроцедуры

Процедура ПрочитатьГрафикОплатИзТаблицыВРеквизитыФорма(Форма, ПлановаяДатаПоставки = Неопределено) Экспорт
	
	ОчиститьРеквизитыФормыГрафикаОплат(Форма);
	
	ОписаниеОбъекта = Форма.Объект;
	
	Если ПлановаяДатаПоставки = Неопределено Тогда
		ПлановаяДатаПоставки = ОписаниеОбъекта.Дата;
	КонецЕсли;
	
	ПлановаяДатаПоставки = НачалоДня(ПлановаяДатаПоставки);

	НайденныеСтроки = ОписаниеОбъекта.ЭтапыГрафикаОплаты.НайтиСтроки(
		Новый Структура("ВариантОплаты", ПредопределенноеЗначение("Перечисление.ВариантыОплатыПоГрафику.Предоплата")));
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		СтрокаТаблицы = НайденныеСтроки[0];
		
		Форма.ПредоплатаПроцентПлатежа = СтрокаТаблицы.ПроцентПлатежа;
		Форма.ПредоплатаСдвиг = Макс((ПлановаяДатаПоставки - СтрокаТаблицы.ДатаПлатежа) / 86400, 0);
		Форма.ПредоплатаСуммаПлатежа = СтрокаТаблицы.СуммаПлатежа;
	КонецЕсли;
	
	НайденныеСтроки = ОписаниеОбъекта.ЭтапыГрафикаОплаты.НайтиСтроки(
		Новый Структура("ВариантОплаты", ПредопределенноеЗначение("Перечисление.ВариантыОплатыПоГрафику.ОтсрочкаПлатежа")));
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		СтрокаТаблицы = НайденныеСтроки[0];
		
		Форма.ОтсрочкаПроцентПлатежа = СтрокаТаблицы.ПроцентПлатежа;
		Форма.ОтсрочкаСдвиг = СтрокаТаблицы.Сдвиг;
		Форма.ОтсрочкаСуммаПлатежа = СтрокаТаблицы.СуммаПлатежа;
	КонецЕсли;

	РассчитатьИтогиГрафикаОплат(Форма);
	
КонецПроцедуры

Процедура ПеренестиГрафикОплатИзРеквизитовФормыВТаблицу(Форма, Объект = Неопределено, ПлановаяДатаПоставки = Неопределено) Экспорт
	
	Если Объект = Неопределено Тогда
		ОписаниеОбъекта = Форма.Объект;
	Иначе
		ОписаниеОбъекта = Объект;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОписаниеОбъекта.ФормаОплаты) Тогда
		ОписаниеОбъекта.ФормаОплаты = ПредопределенноеЗначение("Перечисление.ФормыОплаты.Безналичная");
	КонецЕсли;
	
	Если ПлановаяДатаПоставки = Неопределено Тогда
		ПлановаяДатаПоставки = ОписаниеОбъекта.Дата;
	КонецЕсли;
	
	ПлановаяДатаПоставки = НачалоДня(ПлановаяДатаПоставки);
	
	ЭтапыГрафикаОплаты = ОписаниеОбъекта.ЭтапыГрафикаОплаты;
	ЭтапыГрафикаОплаты.Очистить();
	
	Если Форма.ПредоплатаСуммаПлатежа Тогда
		НоваяСтрока = ЭтапыГрафикаОплаты.Добавить();
		НоваяСтрока.ВариантОплаты = ПредопределенноеЗначение("Перечисление.ВариантыОплатыПоГрафику.Предоплата");
		НоваяСтрока.ПроцентПлатежа = Форма.ПредоплатаПроцентПлатежа;
		НоваяСтрока.СуммаПлатежа = Форма.ПредоплатаСуммаПлатежа;
		НоваяСтрока.ДатаПлатежа = ПлановаяДатаПоставки - Форма.ПредоплатаСдвиг * 86400;
		НоваяСтрока.Сдвиг = 0;
	КонецЕсли;
	
	Если Форма.ОтсрочкаСуммаПлатежа > 0 Тогда
		НоваяСтрока = ЭтапыГрафикаОплаты.Добавить();
		НоваяСтрока.ВариантОплаты = ПредопределенноеЗначение("Перечисление.ВариантыОплатыПоГрафику.ОтсрочкаПлатежа");
		НоваяСтрока.ПроцентПлатежа = Форма.ОтсрочкаПроцентПлатежа;
		НоваяСтрока.СуммаПлатежа = Форма.ОтсрочкаСуммаПлатежа;
		НоваяСтрока.Сдвиг = Форма.ОтсрочкаСдвиг;
		НоваяСтрока.ДатаПлатежа = ПлановаяДатаПоставки + Форма.ОтсрочкаСдвиг * 86400;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЭтапыГрафикаОплатПриИзмененииСуммыПлатежа(Сумма, Процент, База,
	ЗависимаяСумма = 0, ЗависимыйПроцент = 0) Экспорт
	Если База <> 0 Тогда
		Процент = Мин(Сумма * 100 / База, 100);
		ЗависимаяСумма = Макс(База - Сумма, 0);
		ЗависимыйПроцент = 100 - Процент;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЭтапыГрафикаОплатПриИзмененииПроцентаПлатежа(Сумма, Процент, База,
	ЗависимаяСумма = 0, ЗависимыйПроцент = 0) Экспорт
	
	Сумма = Окр(База * Процент / 100, 2, РежимОкругления.Окр15как20);
	ЗависимаяСумма = Макс(База - Сумма, 0);
	ЗависимыйПроцент = Макс(100 - Процент, 0);
	
КонецПроцедуры

Процедура ЭтапыГрафикаОплатПриИзмененииДнейОтсрочки(ДатаПлатежа, Знач ДатаОтгрузки, Знач ОтсрочкаВДнях) Экспорт
	
	ДатаПлатежа = ДатаОтгрузки + 86400 * ОтсрочкаВДнях;
	
КонецПроцедуры

Процедура ЭтапыГрафикаОплатПриИзмененииВариантаОплаты(Знач ВариантОплаты, Знач ДатаОтгрузки, ДатаПлатежа, ОтсрочкаВДнях) Экспорт
	
	Если ВариантОплаты <> ПредопределенноеЗначение("Перечисление.ВариантыОплатыПоГрафику.ОтсрочкаПлатежа") Тогда
		ОтсрочкаВДнях = 0;
	Иначе
		ЭтапыГрафикаОплатПриИзмененииДнейОтсрочки(ДатаПлатежа, ДатаОтгрузки, ОтсрочкаВДнях);
	КонецЕсли;

КонецПроцедуры

Процедура РассчитатьИтогиГрафикаОплат(Форма) Экспорт
	
	Форма.ПроцентПлатежейОбщий = 0;
	
	Если Форма.ИспользуетсяМногоэтапныйГрафикОплаты Тогда
		Для Каждого Этап Из Форма.Объект.ЭтапыГрафикаОплаты Цикл
			Форма.ПроцентПлатежейОбщий = Форма.ПроцентПлатежейОбщий + Этап.ПроцентПлатежа;
		КонецЦикла;
	Иначе
		Форма.ПроцентПлатежейОбщий = Форма.ПредоплатаПроцентПлатежа + Форма.ОтсрочкаПроцентПлатежа;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПредставлениеСчетаФактуры

// Возвращает представление счета-фактуры для гиперссылки.
// 
// Параметры:
//  СчетФактура - ДокументСсылка.СчетФактураВыданный,ДокументСсылка.СчетФактураПолученный
//
// Возвращаемое значение:
//  ФорматированнаяСтрока
//
Функция ПредставлениеСчетаФактуры(СчетФактура) Экспорт
	
	Если ЗначениеЗаполнено(СчетФактура) Тогда
		Возврат Новый ФорматированнаяСтрока(Строка(СчетФактура),,,,ПолучитьНавигационнуюСсылку(СчетФактура));
	Иначе
		Возврат Новый ФорматированнаяСтрока(НСтр("ru='Оформить счет-фактуру'"),,,,"ВвестиСчетФактуру");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СведенияПрослеживаемости

// Возвращает пустые сведения прослеживаемости партии товара.
// 
// Возвращаемое значение:
//  Структура - Новые сведения прослеживаемости товара:
//  * РНПТ - Строка
//  * Количество - Число
//  * КоличествоПрослеживаемости - Число
//  * ЕдиницаИзмеренияПрослеживаемости - СправочникСсылка.ЕдиницыИзмерения
//
Функция НовыеСведенияПрослеживаемостиПартииТовара() Экспорт
	Сведения = Новый Структура;
	Сведения.Вставить("РНПТ", "");
	Сведения.Вставить("КоличествоУпаковок", 0);
	Сведения.Вставить("КоличествоПрослеживаемости", 0);
	Сведения.Вставить("ЕдиницаИзмеренияПрослеживаемости",
		ПредопределенноеЗначение("Справочник.ЕдиницыИзмерения.ПустаяСсылка"));
	Сведения.Вставить("КоличествоУпаковокДоКорректировки", 0);
	Сведения.Вставить("КоличествоПрослеживаемостиДоКорректировки", 0);
	Возврат Сведения;
КонецФункции

Функция ПредставлениеРНПТ(СведенияПрослеживаемостиТовара) Экспорт
	
	КоличествоСведений = СведенияПрослеживаемостиТовара.Количество();
	
	Если КоличествоСведений = 0 Тогда
		Представление = "";
	ИначеЕсли КоличествоСведений = 1 Тогда
		Представление = СокрЛП(Строка(СведенияПрослеживаемостиТовара[0].РНПТ));
	Иначе
		Представление = СтрШаблон(НСтр("ru = '%1 и еще %2'"),
			СокрЛП(Строка(СведенияПрослеживаемостиТовара[0].РНПТ)), КоличествоСведений - 1);
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует структуру настроек помощника ЭДО.
//
// Возвращаемое значение:
//   Структура - настройки стартового помощника ЭДО:
//     * Организация                    - СправочникСсылка.Организации - организация, для которой настраивается система.
//     * Покупатель                     - Булево - признак выбора рода деятельности в базе как покупателя(закупщика).
//     * Поставщик                      - Булево - признак выбора рода деятельности в базе как продавец(поставщик).
//     * ПропуститьРегистрациюБС        - Булево - признак пройденного этапа заполнения организации без регистрации в 1С:Бизнес-сеть.
//     * ОбменБезЭЦП                    - Булево - признак выбора опции настройки ЭДО без подписи.
//     * ОбменЭДО                       - Булево - признак выбора опции настройки ЭДО с подписью.
//     * ОбменДокументамиСКонтрагентами - Булево - признак выбора опции настройки обмена документами с контрагентами.
//     * БольшеНеПоказывать             - Булево - признак отображения стартового помощника при открытии базы.
//     * ИдентификаторОрганизацииЭДО    - Строка - идентификатор подключенной организации ЭДО.
//     * СертификатЭЦП                  - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - сертификат криптографии,
//                                        который используется для настройки регистрации у оператора ЭДО.
//     * Пользователь                   - СправочникСсылка.Пользователи - пользователь, который начал настройку системы.
//     * УслугаOnboarding               - Булево - признак подключения организации по услуге Onboarding, приглашенного контрагентом для обмена электронного документооборота.
//     * НачатаНастройкаСистемы         - Булево - признак начала настройки системы через стартовый помощник ЭДО.
//     * ПригласившийКонтрагент         - СправочникСсылка.Контрагенты - контрагент, который пригласил организацию в клиент ЭДО для электронного документооборота.
//     * ЗаказанНовыйСертификатЭЦП      - Булево - признак оформления заявления на выпуск нового сертификата криптографии.
//     * ПрограммаКриптографии          - Строка - содержит наименование выбранной программы криптографии.
//
Функция НоваяСтруктураНастроекПомощникаЭДО() Экспорт
	
	НоваяСтруктура = Новый Структура;
	НоваяСтруктура.Вставить("Организация"                    , Неопределено);
	НоваяСтруктура.Вставить("Покупатель"                     , Ложь);
	НоваяСтруктура.Вставить("Поставщик"                      , Ложь);
	НоваяСтруктура.Вставить("ОбменБезЭЦП"                    , Ложь);
	НоваяСтруктура.Вставить("ОбменЭДО"                       , Ложь);
	НоваяСтруктура.Вставить("ОбменДокументамиСКонтрагентами" , Ложь);
	НоваяСтруктура.Вставить("БольшеНеПоказывать"             , Ложь);
	НоваяСтруктура.Вставить("ИдентификаторОрганизацииЭДО"    , "");
	НоваяСтруктура.Вставить("ПропуститьРегистрациюБС"        , Ложь);
	НоваяСтруктура.Вставить("СертификатЭЦП"                  , Неопределено);
	НоваяСтруктура.Вставить("Пользователь"                   , Неопределено);
	НоваяСтруктура.Вставить("УслугаOnboarding"               , Ложь);
	НоваяСтруктура.Вставить("НачатаНастройкаСистемы"         , Ложь);
	НоваяСтруктура.Вставить("ПригласившийКонтрагент"         , Неопределено);
	НоваяСтруктура.Вставить("ЗаказанНовыйСертификатЭЦП"      , Ложь);
	НоваяСтруктура.Вставить("ПрограммаКриптографии"          , "");
	НоваяСтруктура.Вставить("ИдентификаторЗаявки"            , "");
	НоваяСтруктура.Вставить("СписокЗаявокИОператоровЭДО"     , Новый СписокЗначений);
	
	Возврат НоваяСтруктура;
	
КонецФункции

// Возвращает представление документа.
// 
// Параметры:
//  Данные - Структура:
//  * ВидДокумента - ПеречислениеСсылка.ВидыДокументов
//  * ВидОперации - ПеречислениеСсылка.ВидыОпераций
//  * ПредставлениеНомера - Строка
//  * Дата - Дата
//  Направление - Строка
//  ЭтоНовый - Булево
//
// Возвращаемое значение:
//  Строка
//
Функция ПредставлениеДокумента(Данные, Направление, ЭтоНовый)
	
	Представление = "";
	
	Если ЭтоНовый Тогда
		
		Если Данные.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.Реализация") Тогда
			Представление = СтрШаблон(НСтр("ru = '%1 (%2) (создание)'"),
				Данные.ВидДокумента,
				Направление);
		Иначе
			Представление = СтрШаблон(НСтр("ru = '%1, %2 (%3) (создание)'"),
				Данные.ВидДокумента,
				Данные.ВидОперации,
				Направление);
		КонецЕсли;
		
	Иначе
		
		Если Данные.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.Реализация") Тогда
			Представление = СтрШаблон(НСтр("ru = '%1 (%2) %3 от %4'"),
				Данные.ВидДокумента,
				Направление,
				Данные.ПредставлениеНомера,
				Формат(Данные.Дата, "ДЛФ=D"));
		Иначе
			Представление = СтрШаблон(НСтр("ru = '%1, %2 (%3) %4 от %5'"),
				Данные.ВидДокумента, 
				Данные.ВидОперации,
				Направление,
				Данные.ПредставлениеНомера,
				Формат(Данные.Дата, "ДЛФ=D"));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

// Возвращает представление документа.
// 
// Параметры:
//  Данные - Структура:
//  * ВидДокумента - ПеречислениеСсылка.ВидыДокументов
//  * НомерЭД - Строка
//  * Дата - Дата
//  Направление - Строка
//  ЭтоНовый - Булево
//
// Возвращаемое значение:
//  Строка
//
Функция ПредставлениеДокументаПоВиду(Данные, Направление, ЭтоНовый)
	
	Представление = "";
	
	Если ЭтоНовый Тогда
		Представление = СтрШаблон(НСтр("ru = '%1 (%2) (создание)'"), Данные.ВидДокумента, Направление);
	Иначе
		Представление = СтрШаблон(НСтр("ru = '%1 (%2) %3 от %4'"), Данные.ВидДокумента, Направление,
			Данные.НомерЭД, Формат(Данные.Дата, "ДЛФ=D"));
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Процедура ЗаполнитьИдентификаторСтроки(Строка) Экспорт

	Строка.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);

КонецПроцедуры

Функция УбратьИзНаименованияОрганизационнуюФорму(Наименование, ИмяОрганизационнойФормы)

	Результат = Ложь;
	
	Наименование = СокрЛП(Наименование);
	
	ДлинаНаименования         = СтрДлина(Наименование);
	ДлинаОрганизационнойФормы = СтрДлина(ИмяОрганизационнойФормы);
	
	Если Лев(Наименование, ДлинаОрганизационнойФормы) = ИмяОрганизационнойФормы Тогда
		Наименование = СокрЛ(Сред(Наименование, ДлинаОрганизационнойФормы + 1));
		Результат = Истина;
	КонецЕсли;
	
	Если Прав(Наименование, ДлинаОрганизационнойФормы) = ИмяОрганизационнойФормы Тогда
		Наименование = СокрП(Лев(Наименование, ДлинаНаименования - ДлинаОрганизационнойФормы - 1));
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает имена полей дерева данных и соответствующие им имена таблиц содержащих
//  коды маркировки для документов Акт о расхождении.
//
// Возвращаемое значение:
//  Массив - структура, где Ключ - имя поля дерева данных, Значение - имя таблицы маркировки.
//
Функция ИменаПолейДереваДанныхИТаблицМаркировкиАктаОРасхождениях() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПоДокументу", "КодыМаркировкиПоДокументу");
	Результат.Вставить("ПоФакту", "КодыМаркировкиПоФакту");
	Результат.Вставить("Недостача", "КодыМаркировкиНедостачи");
	Результат.Вставить("Излишки", "КодыМаркировкиИзлишки");
	Результат.Вставить("Брак", "КодыМаркировкиБрак");
	Результат.Вставить("Бой", "КодыМаркировкиБой");
	
	Возврат Результат;
	
КонецФункции

// Возвращает имена таблиц содержащих коды маркировки для документов Акт о расхождении.
//
// Возвращаемое значение:
//  Массив - имена таблиц.
//
Функция ИменаТаблицМаркировкиАктаОРасхождениях() Экспорт
	
	Результат = Новый Массив;
	
	ИменаПолейИТаблиц = ИменаПолейДереваДанныхИТаблицМаркировкиАктаОРасхождениях();
	Для Каждого ПараИмен Из ИменаПолейИТаблиц Цикл
		Результат.Добавить(ПараИмен.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти