// Модуль объекта документа "Разделка"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет контроль противоречий.
//
Процедура ВыполнитьПредварительныйКонтроль(Отказ)
	
	Если ХозОперация = Справочники.ХозОперации.НормыРазделки Тогда
		// проверим корректность распределения себестоимости
		Если Товары.Итог("КоэффициентСебестоимости") <> 1 Тогда
			Сообщение = "Себестоимость продукции распределена некорректно! Сумма коэффициентов отлична от 1!"+Символы.ПС;
			ТекстСообщения = НСтр("ru = 'Себестоимость продукции распределена некорректно! Сумма коэффициентов отлична от 1!'");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаТЧ = Товары.Найти(Номенклатура);
	Если НЕ СтрокаТЧ = Неопределено Тогда
		Шаблон = НСтр("ru = 'Номенклатура присутствует в таблице товаров, в строке №%1 табл. части ""Товары""!'");
		ТекстСообщения = СтрШаблон(Шаблон, СокрЛП(СтрокаТЧ.НомерСтроки));
		ВывестиСообщение(ТекстСообщения, ЭтотОбъект, "Товары", СтрокаТЧ.НомерСтроки, Отказ);
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

// вовзращает выборку по шапке
// ДокументСсылка - Ссылка на документ для которого получаем шапку
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	Док.Организация КАК Организация,
	|	Док.СкладКомпании КАК СкладКомпании
	|
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции

// у нас не стандартная таблица, поэтому сформирует свой результат запроса по товарам
Функция ПолучитьРезультатЗапросаПоШапке(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Разделка.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
	|	Разделка.Количество КАК Количество,
	|	Разделка.ЦенаРозничная КАК ЦенаРозничная,
	|	Разделка.СуммаРозничная КАК СуммаРозничная
	|ИЗ
	|	Документ.Разделка КАК Разделка
	|ГДЕ
	|	Разделка.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Возврат Запрос.Выполнить();
КонецФункции

Функция ПолучитьРезультатЗапросаПоТоварам(ДокументСсылка)
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	РазделкаТовары.Номенклатура КАК номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
	|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДС,
	|	РазделкаТовары.КоэффициентСебестоимости КАК КоэффициентСебестоимости,
	|	РазделкаТовары.Количество * РазделкаТовары.Коэффициент КАК Количество,
	|	РазделкаТовары.СуммаРозничная КАК СуммаРозничная,
	|	РазделкаТовары.ЦенаРозничная КАК ЦенаРозничная,
	|	0 КАК Резерв,
	|	0 КАК СуммаВсего,
	|	0 КАК СуммаНДС,
	|	0 КАК СуммаБезНДС,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаНДСУпр,
	|	0 КАК СуммаБезНДСУпр
	|ИЗ
	|	Документ.Разделка.Товары КАК РазделкаТовары
	|ГДЕ
	|	РазделкаТовары.Ссылка = &Ссылка
	|";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

//Процедура переоценки при обработке проведения
//Функция Переоценка(ТаблицаТоваров) Экспорт
//	ТаблицаОстатковТоваров = Товары.Выгрузить();
//	
//	// валюты
//	ВалютаРегл=лкПолучитьВалютуРегламентированногоУчета(Организация);
//	СтруктураКурсаРегл = обКурсДляВалюты(ВалютаРегл,Дата); КурсРегл = 1;
//	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
//	СтруктураКурса = обКурсДляВалюты(ВалютаУпр,Дата);
//	КурсУпр = (СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность))/(СтруктураКурсаРегл.Курс / ?(СтруктураКурсаРегл.Кратность = 0, 1, СтруктураКурсаРегл.Кратность));
//	
//	// упорядочим по нормальному
//	ТаблицаТоваров.Сортировать("Номенклатура Возр,ХарактеристикаНоменклатуры Убыв");
//	
//	// получим таблицу номенклатуры с ручным списанием характеристик
//	ТаблицаРучныхХарактеристик=дкПолучитьНоменклатуруСРучнымСписаниемХарактеристик(Ссылка);
//			
//	// переоцениваем
//	Для Каждого СтрокаТовар Из ТаблицаТоваров Цикл
//		
//		Если СтрокаТовар.Количество = 0 Тогда Продолжить; КонецЕсли;	
//		
//		Переоценка = СтрокаТовар.СуммаВсего - СтрокаТовар.СуммаРозничная;
//		
//		СуммаПереоценки=ОКР(обПересчет(Переоценка,ВалютаДокумента,КурсДокумента,ВалютаРегл,КурсРегл),2);
//		СуммаПереоценкиУпр=ОКР(обПересчет(Переоценка,ВалютаДокумента,КурсВалютыУпр,ВалютаУпр,КурсУпр),2);
//			
//		Если Окр(СуммаПереоценки,2)=0 И Окр(СуммаПереоценкиУпр,2)=0 Тогда Продолжить; Конецесли;
//			
//		НоваяЗапись=Движения.ОстаткиТоваровКомпании.Добавить();
//		НоваяЗапись.ВидДвижения=?(СуммаПереоценки>0,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
//		НоваяЗапись.Период=Дата;
//		НоваяЗапись.Регистратор=Ссылка;
//		НоваяЗапись.СкладКомпании=СкладКомпании;
//		НоваяЗапись.Номенклатура=СтрокаТовар.Номенклатура;
//		НоваяЗапись.ХарактеристикаНоменклатуры=СтрокаТовар.ХарактеристикаНоменклатуры; 
//		// ресурсы
//		НоваяЗапись.Резерв=0;
//		НоваяЗапись.Количество=0;
//		НоваяЗапись.СуммаРозн=?(СуммаПереоценки>0,СуммаПереоценки,-СуммаПереоценки);
//		НоваяЗапись.СуммаРознУпр=?(СуммаПереоценкиУпр>0 И НоваяЗапись.ВидДвижения=
//		ВидДвиженияНакопления.Приход,СуммаПереоценкиУпр,-СуммаПереоценкиУпр);
//		// реквизиты
//		НоваяЗапись.ХозОперация=Справочники.ХозОперации.ПереоценкаРозницаПоПриходу;
//		НоваяЗапись.Цена=СтрокаТовар.ЦенаРозничная;
//		НоваяЗапись.КоличествоПереоценки=СтрокаТовар.Количество;
//		
//	КонецЦикла;
//	
//	Возврат Истина;
//КонецФункции

// формирует движения документа по партионным регистрам
// Возвращает Истина - все хокей, ложь - чего-то не так
Функция ПровестиПоПартиям(Режим, ДокументСсылка) Экспорт
	
	Отказ = Ложь;
	ШапкаДокумента = ПолучитьШапкуДокумента(ДокументСсылка);
	
	// проверим, если подразделение проводиться по партиям "отложенно", то дальше не идем
	НаборЗаписейДопроведениеПоПартиям = Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект = ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента = ШапкаДокумента;
	Отказ = НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		Возврат НЕ Отказ;
	КонецЕсли;
	
	// получим результаты запроса
	РезультатЗапросаПоШапке          = ПолучитьРезультатЗапросаПоШапке(ШапкаДокумента.Ссылка);
	РезультатЗапросаПоТоварамСостав  = ПолучитьРезультатЗапросаПоТоварам(ШапкаДокумента.Ссылка);
	// Списываем продукт
	НаборЗаписейПартии = Движения.ПартииТоваровКомпании;
	НаборЗаписейПартии.ШапкаДокумента            = ШапкаДокумента;
	НаборЗаписейПартии.ДокументОбъект            = ЭтотОбъект;
	НаборЗаписейПартии.СкладКомпании             = ШапкаДокумента.СкладКомпании;
	НаборЗаписейПартии.РезультатЗапросаПоТоварам = Неопределено;
	Отказ = НЕ НаборЗаписейПартии.Расход() ИЛИ Отказ;
	
	ТаблицаТоваров       = РезультатЗапросаПоТоварамСостав.Выгрузить();
	ТаблицаСебестоимости = Движения.ПартииТоваровКомпании.Выгрузить();
	МассивУдаляемыхС=Новый Массив;
	Для Каждого СтрокаС Из ТаблицаСебестоимости Цикл
		Если СтрокаС.ХозОперация<>ШапкаДокумента.ХозОперация Тогда
			МассивУдаляемыхС.Добавить(СтрокаС);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаЭлем ИЗ МассивУдаляемыхС Цикл
		ТаблицаСебестоимости.Удалить(СтрокаЭлем);
	КонецЦикла;
	
	мКоличество     = 0;
	мСумма          = 0;
	мСуммаНДС       = 0;
	мСуммаБезНДС    = 0;
	мСуммаУпр       = 0;
	мСуммаНДСУпр    = 0;
	мСуммаБезНДСУпр = 0;
	мСтавкаНДС      = Справочники.СтавкиНДС.ПустаяСсылка();
	мПроект         = Неопределено;
	
	Для Каждого СтрокаСебестоимости Из ТаблицаСебестоимости Цикл
		мКоличество     = мКоличество + СтрокаСебестоимости.Количество;
		мСумма          = мСумма + СтрокаСебестоимости.Сумма;
		мСуммаНДС       = мСуммаНДС + СтрокаСебестоимости.СуммаНДС;
		мСуммаБезНДС    = мСуммаБезНДС + СтрокаСебестоимости.СуммаБезНДС;
		мСуммаУпр       = мСуммаУпр + СтрокаСебестоимости.СуммаУпр;
		мСуммаНДСУпр    = мСуммаНДСУпр + СтрокаСебестоимости.СуммаНДСУпр;
		мСуммаБезНДСУпр = мСуммаБезНДСУпр + СтрокаСебестоимости.СуммаБезНДСУпр;
		
		Если ЗначениеЗаполнено(СтрокаСебестоимости.СтавкаНДС) Тогда
			мСтавкаНДС = СтрокаСебестоимости.СтавкаНДС;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаСебестоимости.Проект) Тогда
			мПроект = СтрокаСебестоимости.Проект;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеСтавкиНДС = мСтавкаНДС.Ставка/100;
	
	СтрокаСМаксимальнойСуммой = Неопределено;
	Для Каждого ТекСтрокаТоваров Из ТаблицаТоваров Цикл
		ТекСтрокаТоваров.СуммаВсего = Окр(мСумма * ТекСтрокаТоваров.КоэффициентСебестоимости, 2);
		ТекСтрокаТоваров.СуммаУпр   = Окр(мСуммаУпр * ТекСтрокаТоваров.КоэффициентСебестоимости, 2);
		
		Если ЗначениеСтавкиНДС = 0 И мСуммаНДС>0 Тогда
			ТекСтрокаТоваров.СуммаНДС = Окр(ТекСтрокаТоваров.СуммаВсего / мСумма * мСуммаНДС, 2);
		Иначе
			ТекСтрокаТоваров.СуммаНДС = Окр(ТекСтрокаТоваров.СуммаВсего * ЗначениеСтавкиНДС, 2);
		КонецЕсли;
		
		Если ЗначениеСтавкиНДС = 0 И мСуммаНДСУпр>0 Тогда
			ТекСтрокаТоваров.СуммаНДСУпр = Окр(ТекСтрокаТоваров.СуммаУпр / мСуммаУпр * мСуммаНДСУпр, 2);
		Иначе
			ТекСтрокаТоваров.СуммаНДСУпр = Окр(ТекСтрокаТоваров.СуммаУпр * ЗначениеСтавкиНДС, 2);
		КонецЕсли;
		
		ТекСтрокаТоваров.СуммаБезНДС    = Окр(ТекСтрокаТоваров.СуммаВсего - ТекСтрокаТоваров.СуммаНДС, 2);
		ТекСтрокаТоваров.СуммаБезНДСУпр = Окр(ТекСтрокаТоваров.СуммаУпр - ТекСтрокаТоваров.СуммаНДСУпр, 2);
		ТекСтрокаТоваров.СтавкаНДС      = мСтавкаНДС;
		
		Если СтрокаСМаксимальнойСуммой = Неопределено ИЛИ ТекСтрокаТоваров.СуммаВсего>СтрокаСМаксимальнойСуммой.СуммаВсего Тогда
			СтрокаСМаксимальнойСуммой = ТекСтрокаТоваров;
		КонецЕсли;
	КонецЦикла;
	
	НеРаспределеннаяСумма = мСумма-ТаблицаТоваров.Итог("СуммаВсего");
	Если НЕ НеРаспределеннаяСумма = 0 Тогда
		СтрокаСМаксимальнойСуммой.СуммаВсего = СтрокаСМаксимальнойСуммой.СуммаВсего + НеРаспределеннаяСумма;
	КонецЕсли;
	
	НеРаспределеннаяСумма = мСуммаНДС-ТаблицаТоваров.Итог("СуммаНДС");
	Если НЕ НеРаспределеннаяСумма = 0 Тогда
		СтрокаСМаксимальнойСуммой.СуммаНДС = СтрокаСМаксимальнойСуммой.СуммаНДС + НеРаспределеннаяСумма;
	КонецЕсли;
	
	НеРаспределеннаяСумма = мСуммаБезНДС-ТаблицаТоваров.Итог("СуммаБезНДС");
	Если НЕ НеРаспределеннаяСумма = 0 Тогда
		СтрокаСМаксимальнойСуммой.СуммаБезНДС = СтрокаСМаксимальнойСуммой.СуммаБезНДС + НеРаспределеннаяСумма;
	КонецЕсли;
	
	НеРаспределеннаяСумма = мСуммаУпр-ТаблицаТоваров.Итог("СуммаУпр");
	Если НЕ НеРаспределеннаяСумма = 0 Тогда
		СтрокаСМаксимальнойСуммой.СуммаУпр = СтрокаСМаксимальнойСуммой.СуммаУпр + НеРаспределеннаяСумма;
	КонецЕсли;
	
	НеРаспределеннаяСумма = мСуммаНДСУпр-ТаблицаТоваров.Итог("СуммаНДСУпр");
	Если НЕ НеРаспределеннаяСумма = 0 Тогда
		СтрокаСМаксимальнойСуммой.СуммаНДСУпр = СтрокаСМаксимальнойСуммой.СуммаНДСУпр + НеРаспределеннаяСумма;
	КонецЕсли;
	
	НеРаспределеннаяСумма = мСуммаБезНДСУпр-ТаблицаТоваров.Итог("СуммаБезНДСУпр");
	Если НЕ НеРаспределеннаяСумма = 0 Тогда
		СтрокаСМаксимальнойСуммой.СуммаБезНДСУпр = СтрокаСМаксимальнойСуммой.СуммаБезНДСУпр + НеРаспределеннаяСумма;
	КонецЕсли;
	
	СтратегияСписанияПартийТоваровПоДатам = ПолучитьСтратегиюСписанияПоДатам(ШапкаДокумента.СкладКомпании, ШапкаДокумента.Организация, ШапкаДокумента.Дата);
	Если СтратегияСписанияПартийТоваровПоДатам = Перечисления.СтратегияСписанияПартийТоваровПоДатам.Средняя Тогда
		ПартияЗаписей = Константы.ПартияТоваровОтрицательныхОстатков.Получить();
	Иначе
		ПартияЗаписей = ШапкаДокумента.Ссылка;
	КонецЕсли;
	
	СтатусПартии = Перечисления.СтатусыПартий.ТоварКупленный;
	
	Для Каждого ТекСтрокаТоваров Из ТаблицаТоваров Цикл
		НоваяЗаписьПартии = Движения.ПартииТоваровКомпании.Добавить();
		НоваяЗаписьПартии.ВидДвижения    = ВидДвиженияНакопления.Приход;
		НоваяЗаписьПартии.Период         = ШапкаДокумента.Дата;
		НоваяЗаписьПартии.Регистратор    = ШапкаДокумента.Ссылка;
		НоваяЗаписьПартии.Партия         = ПартияЗаписей;
		НоваяЗаписьПартии.СтатусПартии   = СтатусПартии;
		НоваяЗаписьПартии.СкладКомпании  = ШапкаДокумента.СкладКомпании;
		НоваяЗаписьПартии.Номенклатура   = ТекСтрокаТоваров.Номенклатура;
		НоваяЗаписьПартии.ХарактеристикаНоменклатуры = ТекСтрокаТоваров.ХарактеристикаНоменклатуры;
		НоваяЗаписьПартии.ХозОперация    = ШапкаДокумента.ХозОперация;
		НоваяЗаписьПартии.Проект         = мПроект;
		НоваяЗаписьПартии.СтавкаНДС      = ТекСтрокаТоваров.СтавкаНДС;
		НоваяЗаписьПартии.Количество     = ТекСтрокаТоваров.Количество;
		НоваяЗаписьПартии.Сумма          = ТекСтрокаТоваров.СуммаВсего;
		НоваяЗаписьПартии.СуммаНДС       = ТекСтрокаТоваров.СуммаНДС;
		НоваяЗаписьПартии.СуммаБезНДС    = ТекСтрокаТоваров.СуммаБезНДС;
		НоваяЗаписьПартии.СуммаУпр       = ТекСтрокаТоваров.СуммаУпр;
		НоваяЗаписьПартии.СуммаНДСУпр    = ТекСтрокаТоваров.СуммаНДСУпр;
		НоваяЗаписьПартии.СуммаБезНДСУпр = ТекСтрокаТоваров.СуммаБезНДСУпр;
	КонецЦикла;
	
	Если Ссылка <> ДокументСсылка Тогда
		
		РаботаСГраницами.МоментВремениПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		РаботаСГраницами.ДвиженияПоПартиямПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		
	КонецЕсли;
	
	РаботаСГраницами.СдвинутьГраницуПартий(ДокументСсылка, ДополнительныеСвойства, Движения);
	
	Возврат НЕ Отказ;
	
КонецФункции // ПровестиПоПартиям()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьПредварительныйКонтроль(Отказ);
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ СкладКомпании.Розничный Тогда
		СуммаРозничная = 0;
		ЦенаРозничная  = 0;
		
		Для Каждого ТекущаяСтрока Из Товары Цикл
			ТекущаяСтрока.СуммаРозничная = 0;
			ТекущаяСтрока.ЦенаРозничная  = 0;
		КонецЦикла;
	КонецЕсли;
	
	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоПартиямПередПроведением(Ссылка, ДополнительныеСвойства);
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Спишем тушу со склада
	РезультатЗапросаПоТоварам = ПолучитьРезультатЗапросаПоШапке(Ссылка);
	НаборЗаписейОстатки = Движения.ОстаткиТоваровКомпании;
	НаборЗаписейОстатки.ДокументОбъект            = ЭтотОбъект;
	НаборЗаписейОстатки.СкладКомпании             = СкладКомпании;
	НаборЗаписейОстатки.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
	НаборЗаписейОстатки.ЕстьРозничнаяСумма        = СкладКомпании.Розничный;
	НаборЗаписейОстатки.ДвиженияПоРознице         = СкладКомпании.Розничный;
	
	Если СкладКомпании.Розничный Тогда
		Отказ = НЕ НаборЗаписейОстатки.Переоценка(Справочники.ХозОперации.ПереоценкаРозницаПоРасходу, Ложь, Ложь) ИЛИ Отказ;
	КонецЕсли;
	
	Отказ = НЕ НаборЗаписейОстатки.Расход() ИЛИ Отказ;
	
	// Оприходуем ингердиенты
	НаборЗаписейОстатки = Движения.ОстаткиТоваровКомпании;
	НаборЗаписейОстатки.РежимПроведения = РежимПроведения;
	НаборЗаписейОстатки.ДокументОбъект  = ЭтотОбъект;
	
	РезультатЗапросаПоТоварам = ПолучитьРезультатЗапросаПоТоварам(Ссылка).Выгрузить();
	Если СкладКомпании.Розничный Тогда
		Для Каждого ТекСтрока Из РезультатЗапросаПоТоварам Цикл
			ТекСтрока.СуммаРозничная = СуммаРозничная * ТекСтрока.КоэффициентСебестоимости;
		КонецЦикла;
	КонецЕсли;
	
	НаборЗаписейОстатки.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
	НаборЗаписейОстатки.СкладКомпании             = СкладКомпании;
	НаборЗаписейОстатки.РазрешитьПереоценку       = Истина;
	
	//Если СкладКомпании.Розничный Тогда
	//	Отказ = НЕ Переоценка(РезультатЗапросаПоТоварам) ИЛИ Отказ;
	//КонецЕсли;
	
	Отказ = НЕ НаборЗаписейОстатки.Приход() ИЛИ Отказ;
	
	Отказ = НЕ ПровестиПоПартиям(РежимПроведения, Ссылка) ИЛИ Отказ;
	
КонецПроцедуры // ОбработкаПроведения()

#КонецЕсли

