// Модуль документа "Приходный складской ордер"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Перемещение товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПеремещениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Проверим склад в документе основании
	Если (ДанныеЗаполнения.СкладПолучатель.ВидСклада <> Перечисления.ВидыСкладов.Ордерный)
		И (ДанныеЗаполнения.СкладПолучатель.ВидСклада <> Перечисления.ВидыСкладов.ОрдерныйЯчеистый) Тогда
			
		ТекстСообщения = НСтр("ru = 'Склад, указанный в документе основании не ордерный. Ввод складского ордера невозможен.'");
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, ТекстСообщения);
		Возврат ЛОЖЬ;
		
	Иначе
	
		ЭтотОбъект.СкладКомпании = ДанныеЗаполнения.СкладПолучатель;
		
	КонецЕсли;
	
	// заполнение ячеек
	Для Каждого СтрТовары Из ДанныеЗаполнения.Товары Цикл
		ЭтотОбъект.Товары[СтрТовары.НомерСтроки-1].Ячейка = СтрТовары.ЯчейкаПолучатель;
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПеремещениеТоваров()

// Производит заполнение объекта на основании документа "Комплектация"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Комплектация(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ЭтотОбъект.Товары.Очистить();
	НоваяСтрока 						   = ЭтотОбъект.Товары.Добавить();
	НоваяСтрока.Номенклатура               = ДанныеЗаполнения.Комплект;
	НоваяСтрока.ХарактеристикаНоменклатуры = ДанныеЗаполнения.ХарактеристикаКомплекта;
	НоваяСтрока.ЕдиницаИзмерения           = ДанныеЗаполнения.Комплект.ОсновнаяЕдиницаИзмерения;
	НоваяСтрока.Коэффициент                = ДанныеЗаполнения.Комплект.ОсновнаяЕдиницаИзмерения.Коэффициент;
	НоваяСтрока.Количество                 = ДанныеЗаполнения.КоличествоКомплектов;
	НоваяСтрока.КоличествоБазовое          = ДанныеЗаполнения.КоличествоКомплектов;
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения.Ячейка) Тогда
		Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
			НоваяСтрока.Ячейка = Справочники.Номенклатура.ПолучитьЯчейкуХранения(НоваяСтрока.Номенклатура, ЭтотОбъект.СкладКомпании);
		КонецЕсли;
	Иначе
		НоваяСтрока.Ячейка = ДанныеЗаполнения.Ячейка;
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Комплектация()

// Производит заполнение объекта на основании документа "Разукомплектация"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Разукомплектация(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РазукомплектацияТовары.НомерСтроки КАК НомерСтроки,
	|	РазукомплектацияТовары.Номенклатура,
	|	РазукомплектацияТовары.ХарактеристикаНоменклатуры,
	|	РазукомплектацияТовары.ЕдиницаИзмерения,
	|	РазукомплектацияТовары.Коэффициент,
	|	РазукомплектацияТовары.Количество * РазукомплектацияТовары.Ссылка.КоличествоКомплектов КАК Количество,
	|	РазукомплектацияТовары.Количество * РазукомплектацияТовары.Ссылка.КоличествоКомплектов КАК КоличествоБазовое,
	|	РазукомплектацияТовары.Ячейка
	|ИЗ
	|	Документ.Разукомплектация.Товары КАК РазукомплектацияТовары
	|ГДЕ
	|	РазукомплектацияТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка",ДанныеЗаполнения);
	Выборка = Запрос.Выполнить().Выбрать();
	ЭтотОбъект.Товары.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ЭтотОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка, ,"НомерСтроки");
		
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Разукомплектация()

// Производит заполнение объекта на основании документа "Пересортица товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПересортицаТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ЭтотОбъект.Товары.Очистить();
	Для Каждого СтрТовар Из ДанныеЗаполнения.Товары Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура = СтрТовар.НоменклатураПриход;
		НоваяСтрока.ХарактеристикаНоменклатуры = СтрТовар.ХарактеристикаНоменклатурыПриход;
		НоваяСтрока.ЕдиницаИзмерения = СтрТовар.ЕдиницаИзмеренияПриход;
		НоваяСтрока.Коэффициент = СтрТовар.КоэффициентПриход;
		НоваяСтрока.Количество = СтрТовар.КоличествоПриход;
		НоваяСтрока.КоличествоБазовое = СтрТовар.КоличествоПриход;
		НоваяСтрока.Ячейка = СтрТовар.ЯчейкаПриход;
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПересортицаТоваров()

// Производит заполнение объекта на основании документа "Корректировка реализации"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_КорректировкаРеализации(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
	|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	КорректировкаРеализацииТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КорректировкаРеализацииТовары.Коэффициент КАК Коэффициент,
	|	-КорректировкаРеализацииТовары.КоличествоРазница КАК Количество,
	|	-КорректировкаРеализацииТовары.КоличествоРазница * КорректировкаРеализацииТовары.Коэффициент КАК КоличествоБазовое
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка = &Основание
	|	И КорректировкаРеализацииТовары.КоличествоРазница < 0");
	Запрос.УстановитьПараметр("Основание", ДанныеЗаполнения);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Товары.Очистить();
		Возврат Истина;
	КонецЕсли;
	
	Товары.Загрузить(РезультатЗапроса.Выгрузить());
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПересортицаТоваров()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения = "", СтандартнаяОбработка=Истина)
	
	// выполним проверки
	Если ЭтоНовый() И ЕстьРеквизит(ДанныеЗаполнения,"СкладКомпании") Тогда
		// проверка на склад
		Если ТипЗнч(ДанныеЗаполнения.СкладКомпании) <> Тип("СправочникСсылка.ПодразделенияКомпании")
			И (ДанныеЗаполнения.СкладКомпании.ВидСклада <> Перечисления.ВидыСкладов.Ордерный)
			И (ДанныеЗаполнения.СкладКомпании.ВидСклада  <> Перечисления.ВидыСкладов.ОрдерныйЯчеистый) Тогда
			
			Если НЕ (ЕстьРеквизит(ДанныеЗаполнения,"СкладПолучатель")
				И ((ДанныеЗаполнения.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.Ордерный)
				ИЛИ (ДанныеЗаполнения.СкладПолучатель.ВидСклада = Перечисления.ВидыСкладов.ОрдерныйЯчеистый))) Тогда
				
					ТекстСообщения = НСтр("ru = 'Склад, указанный в документе основании, обычный. Ввод складского ордера невозможен.'");
					УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, ТекстСообщения);
				    Возврат;
					
			КонецЕсли;
			
		Иначе
			Если ЕстьРеквизит(ДанныеЗаполнения,"СкладПолучатель") И ТипЗнч(ДанныеЗаполнения.СкладПолучатель) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
				
				ТекстСообщения = НСтр("ru = 'В поле ""Получатель"" указано Подразделение компании. Ввод складского ордера невозможен.'");
				УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, ТекстСообщения);
				Возврат;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьРеквизит(ДанныеЗаполнения, "Контрагент") И ЗначениеЗаполнено(ДанныеЗаполнения.Контрагент) Тогда
		ЭтотОбъект.ВладелецТовара = ДанныеЗаполнения.Контрагент;
	КонецЕсли;
	
	// заполним количество базовое и коэффициент
	Для Каждого Строка Из ЭтотОбъект.Товары Цикл
		Если Строка.Коэффициент = 0 Тогда
			Строка.Коэффициент = ?(ЗначениеЗаполнено(Строка.ЕдиницаИзмерения), Строка.ЕдиницаИзмерения.Коэффициент, 1);
		КонецЕсли;	
		Строка.КоличествоБазовое = Строка.Количество * Строка.Коэффициент;
	КонецЦикла;
	
	// произведем свертку
	ТоварыВременная = ЭтотОбъект.Товары.Выгрузить();
	Товары.Очистить();
	
	Для Каждого ТекСтрока Из ТоварыВременная Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Или ТекСтрока.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура"               , ТекСтрока.Номенклатура);
		ПараметрыОтбора.Вставить("ХарактеристикаНоменклатуры" , ТекСтрока.ХарактеристикаНоменклатуры);
		ПараметрыОтбора.Вставить("Коэффициент"                , ТекСтрока.Коэффициент);
		ПараметрыОтбора.Вставить("ЕдиницаИзмерения"           , ТекСтрока.ЕдиницаИзмерения);
		ПараметрыОтбора.Вставить("Ячейка"                     , ТекСтрока.Ячейка);
		
		НайденныеСтроки = ЭтотОбъект.Товары.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			// еще нет такой строки
			НоваяСтрока = ЭтотОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
		Иначе
			// уже есть такая строка, посмотрим можно ли свернуть
			УчетПоХарактеристикам 	= Ложь;
			ТипНоменклатуры 		= ТекСтрока.Номенклатура.ТипНоменклатуры;
			
			Если ЗначениеЗаполнено(ТипНоменклатуры) Тогда
				УчетПоХарактеристикам = (ТипНоменклатуры.ИспользованиеХарактеристик = 1 ИЛИ ТипНоменклатуры.ИспользованиеХарактеристик = 2);
			КонецЕсли;	
			
			Если УчетПоХарактеристикам И НЕ ЗначениеЗаполнено(ТекСтрока.ХарактеристикаНоменклатуры) Тогда
				// ведется учет по характеристикам - свернуть нельзя
				НоваяСтрока = ЭтотОбъект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
			Иначе
				НайденнаяСтрока = НайденныеСтроки[0];
				НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + ТекСтрока.Количество;
				НайденнаяСтрока.КоличествоБазовое = НайденнаяСтрока.КоличествоБазовое + ТекСтрока.КоличествоБазовое;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// корректируем количество базовое 
	Для Каждого Строка Из ЭтотОбъект.Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.КоличествоБазовое) Тогда
			Строка.КоличествоБазовое = Строка.Количество * Строка.Коэффициент;
		КонецЕсли;
	КонецЦикла;
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоОрдерномуУчетуПередПроведением(Ссылка, ДополнительныеСвойства);
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// на всякий случай проверим тип склада, его могли поменять в самом справочнике
	Если СкладКомпании.ВидСклада = Перечисления.ВидыСкладов.Обычный ИЛИ  СкладКомпании.ВидСклада = Перечисления.ВидыСкладов.Ячеистый Тогда
		ТекстСообщения = НСтр("ru = 'Склад должен быть ордерным.'");
		ВывестиСообщение(ТекстСообщения,ЭтотОбъект,,,Отказ);
		Возврат;
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// проведем остатки товаров по регистру ОстаткиТоваровОрдерныйСклад
	НаборЗаписейОстатки = Движения.ОстаткиТоваровОрдерныйСклад;
	НаборЗаписейОстатки.РежимПроведения = РежимПроведения;
	НаборЗаписейОстатки.ДокументОбъект  = ЭтотОбъект;
	НаборЗаписейОстатки.СкладКомпании   = СкладКомпании;
	НаборЗаписейОстатки.РезультатЗапросаПоТоварам = Неопределено;
	НаборЗаписейОстатки.Приходовать               = Истина;
	НаборЗаписейОстатки.ПоБазовомуКоличеству      = Истина;
	Отказ = НЕ НаборЗаписейОстатки.Приход() ИЛИ Отказ;
	
	// двигаем границу последовательности ордерного склада
	РаботаСГраницами.СдвинутьГраницуОрдерногоУчета(Ссылка, ДополнительныеСвойства, Движения);
	
КонецПроцедуры // ОбработкаПроведения()


#Область Инициализация

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// Установим параметры проверки документа
ЭтотОбъект.ДополнительныеСвойства.Вставить("ТоварыЗапретАвтоСписанияХарактеристик", ИСТИНА);

#КонецОбласти

#КонецЕсли