// Модуль основной формы документа "Заказ покупателя"
&НаКлиенте
перем ШтрихКодДляПоиска;

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Формирует информация о сроке поставки
//
&НаСервере
Процедура ОтображениеСрокаПоставки()
	
	Если ЗначениеЗаполнено(Объект.СрокПоставки) Тогда
		Если Объект.Ссылка.Пустая() ИЛИ НЕ Объект.Ссылка.Проведен Тогда
			ПросроченоДней = Цел((ТекущаяДатаСеанса()-Объект.СрокПоставки)/86400);
		Иначе
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МАКСИМУМ(ЗаказыПокупателей.Период) КАК Период,
			|	СУММА(ВЫБОР
			|		КОГДА ЗаказыПокупателей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
			|			ЗаказыПокупателей.Заказано
			|		ИНАЧЕ
			|			-ЗаказыПокупателей.Заказано
			|	КОНЕЦ) КАК Заказано
			|ИЗ
			|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
			|ГДЕ
			|	ЗаказыПокупателей.Заказ = &Заказ");
			Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.Период = NULL Тогда
					ПросроченоДней = 0;
				ИначеЕсли Выборка.Заказано > 0 Тогда
					ПросроченоДней = Цел((ТекущаяДатаСеанса()-Объект.СрокПоставки)/86400);
				Иначе
					ПросроченоДней = 0;
				КонецЕсли;
			Иначе
				ПросроченоДней = 0;
			КонецЕсли;
		КонецЕсли;
		
		Если ПросроченоДней>0 Тогда
			ЭтотОбъект.Элементы.СрокПоставки.РасширеннаяПодсказка.Заголовок= НСтр("ru = 'срок поставки истек'") + Символы.НПП + СокрЛП(ПросроченоДней)+ " " + УправлениеПечатьюПлатформа.ПолучитьПредставлениеДня(ПросроченоДней) + " назад";
			ЭтотОбъект.Элементы.СрокПоставки.РасширеннаяПодсказка.ЦветТекста=Новый Цвет(128,0,0);
		Иначе
			ЭтотОбъект.Элементы.СрокПоставки.РасширеннаяПодсказка.Заголовок="";
			ЭтотОбъект.Элементы.СрокПоставки.РасширеннаяПодсказка.ЦветТекста=Новый Цвет(0,128,0);
		КонецЕсли; 
	Иначе
		ЭтотОбъект.Элементы.СрокПоставки.РасширеннаяПодсказка.Заголовок  = НСтр("ru = 'срок не определен'");
		ЭтотОбъект.Элементы.СрокПоставки.РасширеннаяПодсказка.ЦветТекста = Новый Цвет(0, 0, 128);
	КонецЕсли;
	
КонецПроцедуры // ОтображениеСрокаПоставки()

// Формирует информация о сроке резервирования
//
&НаСервере
Процедура ОтображениеСрокаСнятияРезерва()
	
	Если ЗначениеЗаполнено(Объект.СрокСнятияРезерва) Тогда
		
		Если Объект.Ссылка.Пустая() ИЛИ НЕ Объект.Ссылка.Проведен Тогда
			ПросроченоДней = Цел((ТекущаяДатаСеанса()-Объект.СрокСнятияРезерва)/86400);
		Иначе
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МАКСИМУМ(ЗаказыПокупателей.Период) КАК Период,
			|	СУММА(ВЫБОР
			|		КОГДА ЗаказыПокупателей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
			|			ЗаказыПокупателей.Заказано
			|		ИНАЧЕ
			|			-ЗаказыПокупателей.Заказано
			|	КОНЕЦ) КАК Заказано
			|ИЗ
			|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
			|ГДЕ
			|	ЗаказыПокупателей.Заказ = &Заказ");
			Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.Период = NULL Тогда
					ПросроченоДней = 0;
				ИначеЕсли Выборка.Заказано > 0 Тогда
					ПросроченоДней = Цел((ТекущаяДатаСеанса()-Объект.СрокСнятияРезерва)/86400);
				Иначе
					ПросроченоДней = 0;
				КонецЕсли;
			Иначе
				ПросроченоДней = 0;
			КонецЕсли;
		КонецЕсли;
		
		Если ПросроченоДней>0 Тогда
			ЭтотОбъект.Элементы.СрокСнятияРезерва.РасширеннаяПодсказка.Заголовок  = НСтр("ru = 'срок снятия резерва истек'") + Символы.НПП + СокрЛП(ПросроченоДней)+ " " + УправлениеПечатьюПлатформа.ПолучитьПредставлениеДня(ПросроченоДней) + " назад";
			ЭтотОбъект.Элементы.СрокСнятияРезерва.РасширеннаяПодсказка.ЦветТекста = Новый Цвет(128,0,0);
		Иначе
			ЭтотОбъект.Элементы.СрокСнятияРезерва.РасширеннаяПодсказка.Заголовок  = "";
			ЭтотОбъект.Элементы.СрокСнятияРезерва.РасширеннаяПодсказка.ЦветТекста = Новый Цвет(0,128,0);
		КонецЕсли;
		
	Иначе
		
		ЭтотОбъект.Элементы.СрокСнятияРезерва.РасширеннаяПодсказка.Заголовок  = НСтр("ru = 'срок не определен'");
		ЭтотОбъект.Элементы.СрокСнятияРезерва.РасширеннаяПодсказка.ЦветТекста = Новый Цвет(0,0,128);
		
	КонецЕсли;
	
КонецПроцедуры // ОтображениеСрокаСнятияРезерва()

// Формирует информация о графике поставок
//
&НаСервере
Процедура ОтображениеГрафикаПоставок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикПоставок.ИдентификаторСтроки,
	|	ГрафикПоставок.Количество,
	|	ГрафикПоставок.ДатаПоставки
	|ИЗ
	|	РегистрСведений.ГрафикПоставок КАК ГрафикПоставок
	|ГДЕ
	|	ГрафикПоставок.ЗаказПокупателя = &Ссылка
	|ИТОГИ
	|ПО
	|	ИдентификаторСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	ВыборкаСтроки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСтроки.Следующий() Цикл
		ПредставлениеПоставки = "";
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаСтроки.ИдентификаторСтроки));
		Если НайденныеСтроки .Количество()>0 Тогда
			ТоварнаяСтрока = НайденныеСтроки[0];
			Выборка = ВыборкаСтроки.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока Выборка.Следующий() Цикл
				ПредставлениеПоставки = ПредставлениеПоставки + ?(ПредставлениеПоставки = "", "", "; ") + Строка(Выборка.Количество/ТоварнаяСтрока.Коэффициент) + " " + ТоварнаяСтрока.ЕдиницаИзмерения + "," + Символы.НПП + НСтр("ru = 'дата поставки:'") + Символы.НПП + Формат(Выборка.ДатаПоставки, "ДФ=dd.MM.yy");
			КонецЦикла;
			ТоварнаяСтрока.ГрафикПоставки = ПредставлениеПоставки;
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры // ОтображениеГрафикаПоставок()

// Заполняет реквизит "Масса" у строки табличной части "Товары"
//
&НаСервере
Процедура РассчитатьМассуСтрокиТовары(ТекущиеДанные)
	
	ТекущиеДанные.Масса = ТекущиеДанные.ЕдиницаИзмерения.Вес*ТекущиеДанные.Количество;
	
КонецПроцедуры //РассчитатьМассуСтрокиТовары()

// Заполняет реквизит "Масса" у табличной части "Товары"
//
&НаСервере
Процедура РассчитатьМассуНоменклатуры()
	
	Для Каждого СтрокаТаблицы Из Объект.Товары Цикл
		РассчитатьМассуСтрокиТовары(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры // РассчитатьМассуНоменклатуры()

// Процедура настраивает параметры открытия формы для формирования графика закупок.
&НаКлиенте
Процедура СформироватьГрафикПоставок()
	
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторСтроки) Тогда
		ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
	ПараметрыОткрытия.Вставить("ЗаказПокупателя", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("Номенклатура", ТекущиеДанные.Номенклатура);
	ПараметрыОткрытия.Вставить("ХарактеристикаНоменклатуры", ТекущиеДанные.ХарактеристикаНоменклатуры);
	ПараметрыОткрытия.Вставить("Количество", ТекущиеДанные.Количество);
	ПараметрыОткрытия.Вставить("ЕдиницаИзмерения", ТекущиеДанные.ЕдиницаИзмерения);
	ОткрытьФорму("Документ.ЗаказПокупателя.Форма.ФормаГрафикПоставок",ПараметрыОткрытия,Элементы.ТоварыГрафикПоставки, ,ВариантОткрытияОкна.ОтдельноеОкно,,Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияСформироватьГрафикПоставок", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //СформироватьГрафикПоставок()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаОповещенияГрафикПоставки(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
		Записать();
		СформироватьГрафикПоставок();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияГрафикПоставки()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаОповещенияСформироватьГрафикПоставок(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Проверяем статус закрытия окна параметров
	Если РезультатОповещения=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.ГрафикПоставки = РезультатОповещения;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияСформироватьГрафикПоставок()

// Процедура выполняет чтение/запись регистра сведений "Дополнительные сведения" для реквизита "Уведомление о резервировании".
//
// Параметры:
//  Записать - Булево - Выполнить запись или чтение регистра.
//
&НаСервере
Процедура УведомлениеОРезервировании(Записать = Ложь)
	
	Если Записать Тогда
		
		Набор = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
		Набор.Отбор.Объект.Установить(Объект.Ссылка);
		
		Запись = Набор.Добавить();
		Запись.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.УведомлениеОРезервировании;
		Запись.Значение = УведомлениеОРезервировании;
		Запись.Объект   = Объект.Ссылка;
		
		Набор.Записать();
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеСведения.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект = &Объект
		|	И ДополнительныеСведения.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.УведомлениеОРезервировании)";
		Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезультатЗапроса.Следующий() Тогда
			УведомлениеОРезервировании = РезультатЗапроса.Значение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//++ Первый Бит 2021-03-18 ШиряеваВ
&НаСервере
Процедура бит_ЯндексЕдаОтображениеСтатусаЗаказа()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЯндексЕдаСтатусыЗаказовСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.бит_ЯндексЕдаСтатусыЗаказов.СрезПоследних КАК бит_ЯндексЕдаСтатусыЗаказовСрезПоследних
	|ГДЕ
	|	бит_ЯндексЕдаСтатусыЗаказовСрезПоследних.ЗаказПокупателя = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Элементы.бит_ГруппаСтатусЗаказа.Видимость = Истина;
		ЭтаФорма.бит_ЯндексЕдаСтатусЗаказа = Выборка.Статус;
		СледующийСтатус = бит_ЯндексЕдаПолучитьСледующийСтатусЗаказа(Выборка.Статус);
		ЭтаФорма.Элементы.бит_ЯндексЕдаСледующийСтатусЗаказа.Видимость = Не СледующийСтатус = Неопределено;
		ЭтаФорма.Элементы.бит_ЯндексЕдаСледующийСтатусЗаказа.Заголовок = ?(СледующийСтатус = Неопределено, "", бит_ЯндексЕдаПолучитьСледующийСтатусЗаказа(Выборка.Статус));
		Если Выборка.Статус = Перечисления.бит_ЯндексЕдаСтатусы.CANCELLED ИЛИ 
			Выборка.Статус = Перечисления.бит_ЯндексЕдаСтатусы.DELIVERED Тогда
			ЭтаФорма.Элементы.бит_ЯндексЕдаСледующийСтатусЗаказа.Доступность = Ложь;
			ЭтаФорма.Элементы.бит_ЯндексЕдаОтменитьЗаказ.Доступность = Ложь;
			ЭтаФорма.Элементы.бит_ЯндексЕдаОтложитьВзобновитьЗаказ.Доступность = Ложь;	
		ИначеЕсли Выборка.Статус = Перечисления.бит_ЯндексЕдаСтатусы.POSTPONED Тогда
			ЭтаФорма.Элементы.бит_ЯндексЕдаСледующийСтатусЗаказа.Доступность = Ложь;
			ЭтаФорма.Элементы.бит_ЯндексЕдаОтменитьЗаказ.Доступность = Истина;
			ЭтаФорма.Элементы.бит_ЯндексЕдаОтложитьВзобновитьЗаказ.Доступность = Истина;
		Иначе
			ЭтаФорма.Элементы.бит_ЯндексЕдаСледующийСтатусЗаказа.Доступность = Истина;
			ЭтаФорма.Элементы.бит_ЯндексЕдаОтменитьЗаказ.Доступность = Истина;
			ЭтаФорма.Элементы.бит_ЯндексЕдаОтложитьВзобновитьЗаказ.Доступность = Истина;
		КонецЕсли;
	Иначе
		Элементы.бит_ГруппаСтатусЗаказа.Видимость = Ложь;
	КонецЕсли;
	
	//++ Первый Бит, Туренко Н. 2021-04-05		
	ЭтаФорма.Элементы.бит_ЯндексЕдаОтложитьВзобновитьЗаказ.Видимость = Не бит_ЯндексЕдаСтатусы.НайтиПоЗначению(Перечисления.бит_ЯндексЕдаСтатусы.POSTPONED) = Неопределено;
	ЭтаФорма.Элементы.бит_ЯндексЕдаОтменитьЗаказ.Видимость = Не бит_ЯндексЕдаСтатусы.НайтиПоЗначению(Перечисления.бит_ЯндексЕдаСтатусы.CANCELLED) = Неопределено;
	
КонецПроцедуры

&НаСервере
Функция бит_ЯндексЕдаПолучитьСледующийСтатусЗаказа(Статус)
	
	Если Статус = Перечисления.бит_ЯндексЕдаСтатусы.DELIVERED ИЛИ
			Статус = Перечисления.бит_ЯндексЕдаСтатусы.CANCELLED ИЛИ 
			Статус = Перечисления.бит_ЯндексЕдаСтатусы.POSTPONED Тогда
		Возврат Статус;
	Иначе
		СтатусЗначение = Неопределено;
		Если бит_ЯндексЕдаСтатусы.Количество() > 0 Тогда  
			СтатусЗначение = бит_ЯндексЕдаСтатусы.Получить(бит_ЯндексЕдаСтатусы.Индекс(бит_ЯндексЕдаСтатусы.НайтиПоЗначению(Статус)) + 1).Значение;
		КонецЕсли;
		Возврат СтатусЗначение
	КонецЕсли;
	
КонецФункции
//-- 2021-03-18 ШиряеваВ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
	ПолучитьСписокАдресовДоставкиНаСервере();
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	Если Объект.ХозОперация = Справочники.ХозОперации.ЗаказРезервированиеПокупателя ИЛИ Объект.ХозОперация=Справочники.ХозОперации.РезервированиеПокупателя Тогда
		Элементы.ТоварыРезерв.Видимость          = Истина;
		Элементы.ТоварыОстатокНаСкладе.Видимость = Истина;
		Если Объект.ХозОперация = Справочники.ХозОперации.РезервированиеПокупателя Тогда
			Элементы.СкладКомпании.Заголовок = НСтр("ru = 'Резервировать на'");
		Иначе
			Элементы.СкладКомпании.Заголовок = НСтр("ru = 'Резерв/отгрузка с'");
		КонецЕсли;
	Иначе
		Элементы.ТоварыРезерв.Видимость          = Ложь;
		Элементы.ТоварыОстатокНаСкладе.Видимость = Ложь;
		Элементы.СкладКомпании.Заголовок = НСтр("ru = 'Склад отгрузки'");
	КонецЕсли;
	
	Если Объект.ХозОперация = Справочники.ХозОперации.РезервированиеПокупателя Тогда
		Элементы.ТоварыКоличество.Видимость = Ложь;
	Иначе
		Элементы.ТоварыКоличество.Видимость = Истина;
	КонецЕсли;
	
	Если Объект.ХозОперация = Справочники.ХозОперации.ЗаказПокупателя Тогда
		Элементы.ТоварыЗарезервировано.Видимость = Ложь;
	Иначе
		Элементы.ТоварыЗарезервировано.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ТоварыУпущенныйСпрос.Видимость = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УпущенныйСпрос);
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформлениеРучногоСписанияХарактеристик(ЭтотОбъект);
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформлениеСуммыВсего(ЭтотОбъект);
	
	Раскраска = Новый Соответствие;
	Раскраска.Вставить(1,Новый Цвет(128, 128, 128));
	Раскраска.Вставить(2,Новый Цвет(0, 0, 128));
	Раскраска.Вставить(3,Новый Цвет(0, 128, 0));
	Раскраска.Вставить(4,Новый Цвет(128, 128, 0));
	Раскраска.Вставить(5,Новый Цвет(128, 0, 0));
	Раскраска.Вставить(6,Новый Цвет(204, 153, 255));
	
	Для Каждого Строка Из Раскраска Цикл
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.Имя);
		
		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.НомерЦвета");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Строка.Ключ;
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Строка.Значение);
	КонецЦикла;
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	СписокРеквизитов.Добавить("ЭтотОбъект","ЭтотОбъект",Ложь);
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

&НаСервере
Функция ПолучитьАдресаНаСервере()
	МассивАдресов = Новый Массив;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Представление ИЗ Справочник.Контрагенты.КонтактнаяИнформация
	|ГДЕ Ссылка=&Ссылка	И Тип=ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)");
	
	текГрузополучатель = Неопределено;
	Для Каждого текЭлемент Из Элементы Цикл
		Если Найти(текЭлемент.Имя,"ДополнительныйРеквизитЗначение_")>0 Тогда
			идГрузополучателя = Сред(текЭлемент.Имя,1,68) + СтрЗаменить(ВРег(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Грузополучатель.УникальныйИдентификатор()),"-","x");
			Попытка
				текГрузополучатель = ЭтотОбъект[ИдГрузополучателя];
			Исключение КонецПопытки;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Ссылка", ?(ЗначениеЗаполнено(текГрузополучатель), текГрузополучатель, Объект.Контрагент));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивАдресов.Добавить(Выборка.Представление);
	КонецЦикла;
	
	Возврат МассивАдресов;
КонецФункции //ПолучитьАдресаНаСервере()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элемент.Заголовок="Грузополучатель" Тогда
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("Отбор", Новый Структура("ГоловнойКонтрагент", Объект.Контрагент));

		ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",ПараметрыФормы,Элемент,ЭтотОбъект,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли Элемент.Заголовок="Адрес доставки" Тогда
		Элемент.СписокВыбора.Очистить();
		
		Элемент.СписокВыбора.ЗагрузитьЗначения(ПолучитьАдресаНаСервере());
		
		Элемент.РежимВыбораИзСписка = Истина;
		Элемент.КнопкаВыбора = Ложь;
	КонецЕсли;
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры = "ТоварыГрафикПоставкиНачалоВыбора" Тогда
		
		Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
			Записать();
			СформироватьГрафикПоставок();
		КонецЕсли;
		Возврат
		
	ИначеЕсли ДополнительныеПараметры = "СформироватьГрафикПоставок" Тогда
		
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		ТекущиеДанные.ГрафикПоставки = РезультатОповещения;
		Возврат
		
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()

// Начало Подсистема «Обмен с контрагентами»
// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеСлужебныйКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры //Подключаемый_ВыполнитьКомандуЭДО()

// Обработчик ожидания событий ЭДО.
&НаКлиенте
Процедура Подключаемый_ОбработчикОжиданияЭДО()
	
	ОбменСКонтрагентамиКлиент.ОбработчикОжиданияЭДО(ЭтотОбъект);
	
КонецПроцедуры //Подключаемый_ОбработчикОжиданияЭДО()
// Конец Подсистема «Обмен с контрагентами»


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события нажатия кнопки "Подсветка" на сервере.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаСервере
Процедура ПодсветкаНаСервере()
	
	ИспользоватьПодсветку = Элементы.ТоварыПодсветка.Пометка;
	
	Для Каждого ЭлементОформления Из ЭтотОбъект.УсловноеОформление.Элементы Цикл
		
		Если НЕ СтрНайти(ЭлементОформления.Представление, "Состояние") = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементОформления.Использование = ИспользоватьПодсветку;
		
	КонецЦикла;
	
	Если (НЕ ИспользоватьПодсветку) ИЛИ (НЕ Объект.Проведен) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Сначала получим список номенклатуры по документу
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ
	|	ТаблицаЗаказа
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка = &Заказ
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ЗаказыПокупателейОстатки.ЗаказаноОстаток, 0) КАК Заказано,
	|	ЕСТЬNULL(ЗаказыПокупателейОстатки.РезервОстаток, 0) КАК Зарезервировано,
	|	ЕСТЬNULL(ЗаказыРаспределениеОстатки.КоличествоОстаток, 0)КАК Распределено,
	|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток, 0) КАК ОстатокНаСкладе
	|ИЗ
	|	ТаблицаЗаказа КАК ДокументТовары
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(, Заказ=&Заказ) КАК ЗаказыПокупателейОстатки
	|ПО
	|	ДокументТовары.Номенклатура               = ЗаказыПокупателейОстатки.Номенклатура
	|	И ДокументТовары.ХарактеристикаНоменклатуры = ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ЗаказыРаспределение.Остатки(,ЗаказПокупателя=&Заказ) КАК ЗаказыРаспределениеОстатки
	|ПО
	|	ДокументТовары.Номенклатура               = ЗаказыРаспределениеОстатки.Номенклатура
	|	И ДокументТовары.ХарактеристикаНоменклатуры = ЗаказыРаспределениеОстатки.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(,
	|				(Номенклатура, ХарактеристикаНоменклатуры) В 
	|					(ВЫБРАТЬ
	|						ТаблицаЗаказа.Номенклатура КАК Номенклатура,
	|						ТаблицаЗаказа.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|					ИЗ
	|						ТаблицаЗаказа КАК ТаблицаЗаказа)) КАК ОстаткиТоваровКомпанииОстатки
	|ПО
	|	ДокументТовары.Номенклатура               = ОстаткиТоваровКомпанииОстатки.Номенклатура
	|	И ДокументТовары.ХарактеристикаНоменклатуры = ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры
	|");
	
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		
		ОтборПоНоменклатуре = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", СтрокаТЧ.Номенклатура, СтрокаТЧ.ХарактеристикаНоменклатуры);
		НоменклатураОбороты = Выгрузка.НайтиСтроки(ОтборПоНоменклатуре);
		
		Если НоменклатураОбороты.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// В списке оборотов номенклатура найдена
		ДвиженияНоменклатуры = НоменклатураОбороты[0];
		// Раскрасим в зависимости от состояния заказа
		Если ДвиженияНоменклатуры.Заказано = 0 Тогда
			// Номенклатура не отпущена
			СтрокаТЧ.НомерЦвета = 1;
		ИначеЕсли ДвиженияНоменклатуры.Зарезервировано>0 Тогда
			// Номенклатура зарезервирована на складе
			СтрокаТЧ.НомерЦвета = 3;
		ИначеЕсли ДвиженияНоменклатуры.ОстатокНаСкладе>0 Тогда
			// Номенклатура есть на складе
			СтрокаТЧ.НомерЦвета = 2;
		ИначеЕсли ДвиженияНоменклатуры.Распределено>0 Тогда
			// Номенклатура распределена по заказам поставщиков
			СтрокаТЧ.НомерЦвета = 4;
		ИначеЕсли ДвиженияНоменклатуры.Заказано>0 Тогда
			// Номенклатура не отпущена
			СтрокаТЧ.НомерЦвета = 5;
		Иначе
			// Прочие ситуации
			СтрокаТЧ.НомерЦвета = 6;
		КонецЕсли;
		
		СтрокаТЧ.Зарезервировано = ДвиженияНоменклатуры.Зарезервировано;
		
	КонецЦикла;
	
КонецПроцедуры //ПодсветкаНаСервере()

// Обработчик события нажатия кнопки "Подсветка".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подсветка(Команда)
	
	Элементы.ТоварыПодсветка.Пометка = (НЕ Элементы.ТоварыПодсветка.Пометка);
	
	// Обработаем в контексте сервера
	ПодсветкаНаСервере();
	
	// Взведем признак необходимости выполнить сохранение настроек формы при закрытии
	СохраняемыеВНастройкахДанныеМодифицированы = ИСТИНА;
	
КонецПроцедуры //Подсветка()

&НаКлиенте
// Открывает форму обработки "Упущенный спрос".
Процедура УпущенныйСпрос(Команда)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ПараметрыНоменклатуры = Новый Структура;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ПараметрыНоменклатуры.Вставить("Количество",   ТекущиеДанные.Количество);
		ПараметрыНоменклатуры.Вставить("Номенклатура", ТекущиеДанные.Номенклатура);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ПараметрыНоменклатуры", ПараметрыНоменклатуры);
	ОткрытьФорму("Обработка.УпущенныйСпрос.Форма", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Обработчик события нажатия кнопки "Подбор номенклатуры".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	Если Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.РезервированиеПокупателя") Тогда
		 ИмяРеквизитаКоличества = "Резерв";
	Иначе
		 ИмяРеквизитаКоличества = "Количество";
	КонецЕсли; 
	
	// Вызываем общий обработчик события
	УправлениеДиалогомКлиент.ОткрытьПодборНоменклатуры(ЭтотОбъект,,,ИмяРеквизитаКоличества);
	
КонецПроцедуры // ПодборНоменклатуры()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Контрагент" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура КонтрагентПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.КонтрагентПриИзменении(Объект, ПараметрыДействия);
	
	// Информация о сроке поставки
	ОтображениеСрокаПоставки();
	
	// Информация о сроке резервирования
	ОтображениеСрокаСнятияРезерва();
	
	// Проверим наличие заметок по выбранному объекту.
	ЗаметкиПользователяПлатформа.ПроверитьЗаметкиПоПредмету(Объект.Контрагент, ПараметрыДействия);
	
	// Пересоздадим подменю "Анкеты"
	АнкетированиеПлатформаСервер.СформироватьМенюАнкетирование(ЭтотОбъект);
	
	// настроим параметры выбора
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
	// Обнавляем Список адресов для грузополучателя
	Если НЕ ЗначениеЗаполнено(Объект.Грузополучатель) Тогда
		ПолучитьСписокАдресовДоставкиНаСервере();
	КонецЕсли;
	
КонецПроцедуры // КонтрагентПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Контрагент".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	КонтрагентПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // КонтрагентПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Договор" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДоговорВзаиморасчетовПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ДоговорВзаиморасчетовПриИзменении(Объект, ПараметрыДействия);
	
	// Проверим наличие заметок по выбранному объекту.
	ЗаметкиПользователяПлатформа.ПроверитьЗаметкиПоПредмету(Объект.ДоговорВзаиморасчетов, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДоговорВзаиморасчетовПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Договор".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДоговорВзаиморасчетовПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДоговорВзаиморасчетовПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
КонецПроцедуры // ДоговорВзаиморасчетовПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Основание" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДокументОснованиеПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Основание".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДокументОснованиеПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДокументОснованиеПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Резервировать на" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкладКомпанииПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.СкладКомпанииПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // СкладКомпанииПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Резервировать на".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкладКомпанииПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	СкладКомпанииПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
КонецПроцедуры // СкладКомпанииПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Уведомление о резервировании".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура УведомлениеОРезервированииПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении данных реквизита "Предоплата %" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ПроцентПредоплатыПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.РасчетПредоплаты(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПроцентПредоплатыПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Предоплата %".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПроцентПредоплатыПриИзменении(Элемент)
	
	Объект.ПерерасчетОтПредоплаты = Ложь;
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ПроцентПредоплатыПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
КонецПроцедуры // ПроцентПредоплатыПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма предоплаты" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СуммаПредоплатыПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.СуммаПредоплатыПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // СуммаПредоплатыПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма предоплаты".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СуммаПредоплатыПриИзменении(Элемент)
	
	Объект.ПерерасчетОтПредоплаты = Истина;
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	СуммаПредоплатыПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
КонецПроцедуры // СуммаПредоплатыПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Макс. срок поставки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СрокПоставкиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Информация о сроке поставки
	ОтображениеСрокаПоставки();
	
КонецПроцедуры // СрокПоставкиПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Макс. срок поставки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СрокПоставкиПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	СрокПоставкиПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
КонецПроцедуры // СрокПоставкиПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Срок снятия резерва" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СрокСнятияРезерваПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Информация о сроке резервирования
	ОтображениеСрокаСнятияРезерва();
	
КонецПроцедуры // СрокСнятияРезерваПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Срок снятия резерва".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СрокСнятияРезерваПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	СрокСнятияРезерваПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
КонецПроцедуры // СрокСнятияРезерваПриИзменении()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ТоварыНоменклатураПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	// Вызываем общий обработчик изменения реквизитов формы
	УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(ЭтотОбъект, ТекущиеДанные, ПараметрыДействия);
	
	РассчитатьМассуНоменклатуры();
	
КонецПроцедуры // ТоварыНоменклатураПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыНоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Характеристика номенклатуры" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ТоварыХарактеристикаНоменклатурыПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	РассчитатьМассуСтрокиТовары(ТекущиеДанные);
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Характеристика номенклатуры".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЕдиницаИзмеренияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ТоварыЕдиницаИзмеренияПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	РассчитатьМассуСтрокиТовары(ТекущиеДанные);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Единица измерения".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЕдиницаИзмеренияПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыКоличествоПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ТоварыКоличествоПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	РассчитатьМассуСтрокиТовары(ТекущиеДанные);
	
КонецПроцедуры // ТоварыКоличествоПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыКоличествоПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыКоличествоПриИзменении()

// Обработчик события возникающего на клиенте при начале выбора данных реквизита "График поставки" в списке "Товары".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора - СписокЗначений - В обработчике можно сформировать и передать в этом параметре данные для выбора.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ТоварыГрафикПоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда// Формируем описание обработчика перехвата закрытия формы
		ОбработчикВопроса = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияГрафикПоставки", ЭтотОбъект);
		
		// Формируем текст вопроса
		ТекстВопроса = НСтр("ru = 'Для формирования графика поставок заказ должен быть записан.
			|Записать объект?'");
		
		// Получаем подтверждение операции от пользователя
		ПоказатьВопрос(ОбработчикВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		СформироватьГрафикПоставок();
	КонецЕсли;
	
КонецПроцедуры //ТоварыГрафикПоставкиНачалоВыбора ()

// Обработчик события возникающего при изменении данных реквизита "Резерв" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыРезервПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ТоварыРезервПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыРезервПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Резерв".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыРезервПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыРезервПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыРезервПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЦенаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ТоварыЦенаПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЦенаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Цена".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЦенаПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЦенаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ТоварыСуммаПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСуммаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма всего" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаВсегоПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ТоварыСуммаВсегоПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаВсегоПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма всего".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаВсегоПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаВсегоПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСуммаВсегоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСтавкаНДСПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ТоварыСтавкаНДСПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСтавкаНДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Ставка НДС".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСтавкаНДСПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСтавкаНДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма НДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаНДСПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ТоварыСуммаНДСПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаНДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма НДС".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаНДСПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаНДСПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСуммаНДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма скидки строки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаСкидкиСтрокиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ТоварыСуммаСкидкиСтрокиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма скидки строки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаСкидкиСтрокиПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаСкидкиСтрокиПриИзмененииНаСервере();
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Сумма скидки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаСкидкиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ТоварыСуммаСкидкиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма скидки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаСкидкиПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаСкидкиПриИзмененииНаСервере();
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Скидка на товар" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСкидкаНаТоварПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ТоварыСкидкаНаТоварПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении данных реквизита "Скидка на товар".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСкидкаНаТоварПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСкидкаНаТоварПриИзмененииНаСервере();
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Процент скидки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыПроцентСкидкиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ТоварыПроцентСкидкиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении данных реквизита "Процент скидки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПроцентСкидкиПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыПроцентСкидкиПриИзмененииНаСервере();
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Процент скидки строки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыПроцентСкидкиСтрокиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ЗаказПокупателя.ТоварыПроцентСкидкиСтрокиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении данных реквизита "Процент скидки строки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПроцентСкидкиСтрокиПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыПроцентСкидкиСтрокиПриИзмененииНаСервере();

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры // ТоварыПередНачаломДобавления()

// Обработчик события возникающего на клиенте перед началом интерактивного изменения строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередНачаломИзменения()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередУдалением(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередУдалением()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПриОкончанииРедактирования(ЭтотОбъект, Элемент, НоваяСтрока, ОтменаРедактирования);
	
	// Так как функция "Итог()" по ТЧ вызывает сервер, то сделаем перебор строк на клиенте.
	СуммаСоСкидкой = 0;
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		СуммаСоСкидкой = СуммаСоСкидкой + СтрокаТЧ.СуммаВсего;
	КонецЦикла;
	
	Если НЕ Объект.ПерерасчетОтПредоплаты Тогда
		Объект.СуммаПредоплаты = (СуммаСоСкидкой*Объект.ПроцентПредоплаты)/100;
	КонецЕсли;
	
КонецПроцедуры // ТоварыПриОкончанииРедактирования()

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
&НаСервере
Процедура ТоварыПослеУдаленияНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ТоварыПослеУдаления(ЭтотОбъект, Элементы.Товары, ПараметрыДействия);
	
	// корректировка суммы предоплаты
	Документы.ЗаказПокупателя.РасчетПредоплаты(Объект, ПараметрыДействия);
	
КонецПроцедуры // ТоварыПослеУдаленияНаСервере()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыПослеУдаленияНаСервере();
	
КонецПроцедуры // ТоварыПослеУдаления()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                        - Строка таблицы, над которой находится курсор.
//  Поле                          - Элемент управляемой формы, с которым связана данная колонка таблицы.
//
&НаКлиенте
Процедура ТоварыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // ТоварыПроверкаПеретаскивания()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()

// Обработчик события возникающего на клиенте при нажатии на надпись "Сумма документа".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьСуммаДокументаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.ПоказатьРасширенныеИтогиОперации(ЭтотОбъект, Элемент);
	
КонецПроцедуры // НадписьСуммаДокументаНажатие()

// Обработчик события возникающего на клиенте при нажатии на надпись "Взаиморасчеты".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьВзаиморасчетыНажатие(Элемент)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.НадписьВзаиморасчетыНажатие(ЭтотОбъект);
	
КонецПроцедуры // НадписьВзаиморасчетыНажатие()

// Начало Подсистема «Обмен с контрагентами»
// Обработчик события возникающего на клиенте при нажатии на надпись "Состояние ЭДО".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСКонтрагентамиКлиент.ОткрытьДеревоЭД(Объект.Ссылка);
	
КонецПроцедуры //ДекорацияЭДОНажатие()
// Конец Подсистема «Обмен с контрагентами»

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ СТРАНИЦЫ ФОРМЫ "ДОПОЛНИТЕЛЬНО"

&НаСервере
Процедура ПолучитьСписокАдресовДоставкиНаСервере()
	
	Объект.АдресДоставки = "";
	Элементы.АдресДоставки.СписокВыбора.Очистить();
	Запрос = Новый Запрос("ВЫБРАТЬ Представление ИЗ Справочник.Контрагенты.КонтактнаяИнформация
	|ГДЕ Ссылка=&Ссылка	И Тип=ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)");
	
	Запрос.УстановитьПараметр("Ссылка", ?(ЗначениеЗаполнено(Объект.Грузополучатель), Объект.Грузополучатель, Объект.Контрагент));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элементы.АдресДоставки.СписокВыбора.Добавить(Выборка.Представление, Выборка.Представление);
	КонецЦикла;
	
	Если Элементы.АдресДоставки.СписокВыбора.Количество() > 0 Тогда
		Объект.АдресДоставки = Элементы.АдресДоставки.СписокВыбора[0];
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ГрузополучательПриИзменении(Элемент)
	
	// Вызываем серверный обработчик события
	ПолучитьСписокАдресовДоставкиНаСервере();
		
КонецПроцедуры //ГрузополучательПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	//// нельзя выбирать розничный склад
	//Если ЗначениеЗаполнено(Объект.СкладКомпании) И Объект.СкладКомпании.Розничный Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//		НСтр("ru = 'На розничном складе товар не резервируется.'"),,
	//		"СкладКомпании",
	//		"Объект");
	//	Объект.СкладКомпании = Справочники.СкладыКомпании.ПустаяСсылка();
	//КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Информация о сроке поставки
	ОтображениеСрокаПоставки();
	
	// Информация о сроке резервирования
	ОтображениеСрокаСнятияРезерва();
	
	// Информация о графике поставок
	ОтображениеГрафикаПоставок();
	
	// заполним массу номенклатуры
	РассчитатьМассуНоменклатуры();
	
	// Формирование флажка резервирования
	ХозОперацияПриИзмененииНаСервере();
	
	// Дальнейшие операции выполняются только для новых документов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
	ПодсветкаНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним "Как уведомлять о резервировании"
	УведомлениеОРезервировании();
	
	// Информация о сроке поставки
	ОтображениеСрокаПоставки();
	
	// Информация о сроке резервирования
	ОтображениеСрокаСнятияРезерва();
	
	// Информация о графике поставок
	ОтображениеГрафикаПоставок();
	
	// заполним массу номенклатуры
	РассчитатьМассуНоменклатуры();
	ПодсветкаНаСервере();
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
	//++ Первый Бит, Туренко Н. 2021-03-20 
	бит_ПриЧтенииНаСервере(ТекущийОбъект);
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Строка Из ТекущийОбъект.Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.ИдентификаторСтроки) Тогда
			Строка.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	ПодсветкаНаСервере();
	
	// Заполним "Как уведомлять о резервировании"
	УведомлениеОРезервировании(Истина);
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
	// Производим сохранение параметров отображения панели параметров документа
	Настройки.Вставить("ПоказыватьПодсветку", Элементы.ТоварыПодсветка.Пометка);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	Если Настройки.Получить("ПоказыватьПодсветку")=ИСТИНА Тогда
		Элементы.ТоварыПодсветка.Пометка = Истина;
		ПодсветкаНаСервере();
	КонецЕсли;
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура ПоискВТаблицеТовары(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПоискВТаблицеТоварыРезультатОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ПоискВТаблицеТоварыРезультатОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ШтрихКодДляПоиска = РезультатОповещения;
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ПоискПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКоду(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ДобавлениеНовыхПозицийПоШтрихКодуОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКодуОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ДобавлениеНовыхПозицийПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтборВТаблицеТовары(Команда)
	Элементы.Товары.ОтборСтрок = Неопределено;
КонецПроцедуры

//++ Первый Бит 2021-03-18 ШиряеваВ
&НаСервере
Процедура бит_ЯндексЕдаОтменитьЗаказНаСервере(Комментарий)
	
	НовыйСтатусЗаказа = РегистрыСведений.бит_ЯндексЕдаСтатусыЗаказов.СоздатьМенеджерЗаписи();
	НовыйСтатусЗаказа.ЗаказПокупателя = Объект.Ссылка;
	НовыйСтатусЗаказа.Статус = Перечисления.бит_ЯндексЕдаСтатусы.CANCELLED;
	НовыйСтатусЗаказа.Комментарий = Комментарий;
	НовыйСтатусЗаказа.Период = ТекущаяДата();
	НовыйСтатусЗаказа.Записать();
	
	бит_ЯндексЕдаОтображениеСтатусаЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ЯндексЕдаОтменитьЗаказ(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("бит_ЯндексЕдаОтменитьЗаказПодтверждение", ЭтотОбъект), НСтр("ru = 'Отменить заказ?'"), РежимДиалогаВопрос.ДаНет, 0);
		
КонецПроцедуры

&НаКлиенте
Процедура бит_ЯндексЕдаОтменитьЗаказПодтверждение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		Комментарий = "";
		Подсказка = "Комментарий к отмене заказа";
		ПоказатьВводСтроки(Новый ОписаниеОповещения("бит_ЯндексЕдаОтменитьЗаказКомментарий", ЭтотОбъект), Комментарий, Подсказка, 0, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура бит_ЯндексЕдаОтменитьЗаказКомментарий(Строка, ДополнительныеПараметры) Экспорт
	
	Если Строка <> Неопределено Тогда 
		бит_ЯндексЕдаОтменитьЗаказНаСервере(Строка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура бит_ЯндексЕдаСледующийСтатусЗаказаНаСервере(Комментарий)
	
	НовыйСтатусЗаказа = РегистрыСведений.бит_ЯндексЕдаСтатусыЗаказов.СоздатьМенеджерЗаписи();
	НовыйСтатусЗаказа.ЗаказПокупателя = Объект.Ссылка;
	НовыйСтатусЗаказа.Статус = бит_ЯндексЕдаПолучитьСледующийСтатусЗаказа(бит_ЯндексЕдаСтатусЗаказа);
	НовыйСтатусЗаказа.Комментарий = Комментарий;
	НовыйСтатусЗаказа.Период = ТекущаяДата();
	НовыйСтатусЗаказа.Записать();
	
	бит_ЯндексЕдаОтображениеСтатусаЗаказа();

КонецПроцедуры

&НаКлиенте
Процедура бит_ЯндексЕдаСледующийСтатусЗаказа(Команда)
	
	Комментарий = "";
	Подсказка = "Комментарий к смене статуса";
	ПоказатьВводСтроки(Новый ОписаниеОповещения("бит_ЯндексЕдаСледующийСтатусЗаказаКомментарий", ЭтотОбъект), Комментарий, Подсказка, 0, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ЯндексЕдаСледующийСтатусЗаказаКомментарий(Строка, ДополнительныеПараметры) Экспорт
	
	Если Строка <> Неопределено Тогда 
		бит_ЯндексЕдаСледующийСтатусЗаказаНаСервере(Строка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура бит_ЯндексЕдаОтложитьЗаказНаСервере()
	
	НовыйСтатусЗаказа = РегистрыСведений.бит_ЯндексЕдаСтатусыЗаказов.СоздатьМенеджерЗаписи();
	НовыйСтатусЗаказа.ЗаказПокупателя = Объект.Ссылка;
	НовыйСтатусЗаказа.Статус = Перечисления.бит_ЯндексЕдаСтатусы.POSTPONED;
	НовыйСтатусЗаказа.Период = ТекущаяДата();
	НовыйСтатусЗаказа.Записать();		
	бит_ЯндексЕдаОтображениеСтатусаЗаказа();
	
КонецПроцедуры

&НаСервере
Процедура бит_ЯндексЕдаВозобновитьЗаказНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	бит_ЯндексЕдаСтатусыЗаказов.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.бит_ЯндексЕдаСтатусыЗаказов КАК бит_ЯндексЕдаСтатусыЗаказов
	|ГДЕ
	|	бит_ЯндексЕдаСтатусыЗаказов.ЗаказПокупателя = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	бит_ЯндексЕдаСтатусыЗаказов.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл	
		НовыйСтатусЗаказа = РегистрыСведений.бит_ЯндексЕдаСтатусыЗаказов.СоздатьМенеджерЗаписи();
		НовыйСтатусЗаказа.ЗаказПокупателя = Объект.Ссылка;
		НовыйСтатусЗаказа.Статус = Выборка.Статус;
		НовыйСтатусЗаказа.Период = ТекущаяДата();
		НовыйСтатусЗаказа.Записать();
	КонецЦикла;
	
	бит_ЯндексЕдаОтображениеСтатусаЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ЯндексЕдаОтложитьВозобновитьЗаказ(Команда)
	
	Если ЭтаФорма.бит_ЯндексЕдаСтатусЗаказа <> ПредопределенноеЗначение("Перечисление.бит_ЯндексЕдаСтатусы.POSTPONED") Тогда
		 бит_ЯндексЕдаОтложитьЗаказНаСервере();
		 ЭтаФорма.Элементы.бит_ЯндексЕдаОтложитьВзобновитьЗаказ.Заголовок = ВРег("Возобновить");
		 ЭтаФорма.Элементы.бит_ЯндексЕдаОтложитьВзобновитьЗаказРасширеннаяПодсказка.Заголовок = "Возобновить заказ";
	 Иначе
		 бит_ЯндексЕдаВозобновитьЗаказНаСервере();
		 ЭтаФорма.Элементы.бит_ЯндексЕдаОтложитьВзобновитьЗаказ.Заголовок = ВРег("Отложить");
		 ЭтаФорма.Элементы.бит_ЯндексЕдаОтложитьВзобновитьЗаказРасширеннаяПодсказка.Заголовок = "Отложить заказ";
	 КонецЕсли;
	
КонецПроцедуры
//-- 2021-03-18 ШиряеваВ


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

//++ Первый Бит, Туренко Н. 2021-03-20 
&НаСервере
Процедура бит_ПриЧтенииНаСервере(ТекущийОбъект)

	//++ Первый Бит, Туренко Н. 2021-04-05
	бит_ЯндексЕдаПолучитьДоступныеСтатусы(ТекущийОбъект);
	
	//++ Первый Бит 2021-03-18 ШиряеваВ
	//Информация о статусе заказа Яндекс.Еда
	бит_ЯндексЕдаОтображениеСтатусаЗаказа();
	//-- 2021-03-18 ШиряеваВ
	
	бит_ЯндексЕдаЗаполнитьИнформациюОЗаказе(ТекущийОбъект);
	
КонецПроцедуры

//++ Первый Бит, Туренко Н. 2021-03-20
&НаСервере
Процедура бит_ЯндексЕдаЗаполнитьИнформациюОЗаказе(ТекущийОбъект)
	бит_ЯндексЕдаИнформация.Очистить();
	НовСтр = бит_ЯндексЕдаИнформация.Добавить();
	НовСтр.Имя = "УИД";
	НовСтр.Синоним = "Идентификатор";
	НовСтр.Значение = ТекущийОбъект.Ссылка.УникальныйИдентификатор();
	
	МенЗап = РегистрыСведений.бит_ЯндексЕдаСвойстваЗаказов.СоздатьМенеджерЗаписи();
	МенЗап.ЗаказПокупателя = Объект.Ссылка;
	МенЗап.Прочитать();
	Если МенЗап.Выбран() Тогда
		Элементы.бит_ЯндексЕдаИнформация.Видимость = Истина;
		Для Каждого Ресурс Из Метаданные.РегистрыСведений.бит_ЯндексЕдаСвойстваЗаказов.Ресурсы Цикл 
			НовСтр = бит_ЯндексЕдаИнформация.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Ресурс, "Имя, Синоним");
			НовСтр.Значение = МенЗап[Ресурс.Имя];
		КонецЦикла;
	Иначе
		Элементы.бит_ЯндексЕдаИнформация.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

//++ Первый Бит, Туренко Н. 2021-04-05
&НаСервере
Процедура бит_ЯндексЕдаПолучитьДоступныеСтатусы(ТекущийОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЯндексЕдаНастройкиСтатусов.Статус КАК Статус
		|ИЗ
		|	Перечисление.бит_ЯндексЕдаСтатусы КАК бит_ЯндексЕдаСтатусы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЯндексЕдаНастройкиСтатусов КАК бит_ЯндексЕдаНастройкиСтатусов
		|		ПО бит_ЯндексЕдаСтатусы.Ссылка = бит_ЯндексЕдаНастройкиСтатусов.Статус
		|ГДЕ
		|	бит_ЯндексЕдаНастройкиСтатусов.Используется
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_ЯндексЕдаНастройкиСтатусов.Статус.Порядок";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	бит_ЯндексЕдаСтатусы.ЗагрузитьЗначения(Выборка.ВыгрузитьКолонку("Статус"));	
	
КонецПроцедуры


ШтрихКодДляПоиска = "";
