// Модуль менеджера документа "Задание на мониторинг"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

// Используется в механизме взаимодействий. Формирует текст запроса по контактам предмета взаимодействия.
//
// Параметры:
//  Ссылка - Ссылка - Содержит ссылку на передаваемый объект метаданных.
//  ИмяТаблицы             - Строка    - Полное имя объекта метаданных.
//  ТекстВременнаяТаблица  - Строка    - Строка в которой может находиться часть текста запроса, которая отвечает за
//                                       помещение результата запроса во временную таблицу.
//  Объединить             - Булево    - Признак который указывает на режим формирования запроса. В случае, если данный
//                                       параметр имеет значение Истина, то формируемый в функции запрос являются частью
//                                       другого запроса и должен начинаться с конструкции ОБЪЕДИНИТЬ.
//  ТолькоОсновныеКонтакты - Булево    - Признак который указывает на необходимость вывода только основных контактов.
//
// Возвращаемое значение:
//  Строка - Возвращаемая строка, содержащая в себе текст запроса по контактам предмета взаимодействий.
//
Функция ПолучитьТекстЗапросаПоКонтактам(Ссылка, ТекстВременнаяТаблица = "", Объединить = ЛОЖЬ, ТолькоОсновныеКонтакты = ИСТИНА) Экспорт
	
	// Вызываем общий обработчик действия
	Параметры = Новый Структура;
	Параметры.Вставить("ТекстВременнаяТаблица", ТекстВременнаяТаблица);
	Параметры.Вставить("Объединить", Объединить);
	Параметры.Вставить("ТолькоОсновныеКонтакты", ТолькоОсновныеКонтакты);
	
	Возврат УправлениеДиалогомСервер.ПолучитьТекстЗапросаПоКонтактам(Ссылка, Параметры);
	
КонецФункции //ПолучитьТекстЗапросаПоКонтактам()

Функция ПолучитьДокументМониторинга(Объект, Строка) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Документ.МониторингЦенКонкурентов ГДЕ Конкурент=&Конкурент И ДокументОснование=&Основание И Дата>=&Дата УПОРЯДОЧИТЬ ПО Дата УБЫВ");
	Запрос.УстановитьПараметр("Конкурент", Строка.Конкурент);
	Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.МониторингЦенКонкурентов.ПустаяСсылка();
	КонецЕсли;
КонецФункции //ПолучитьДокументМониторинга()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	
	Если НЕ ПравоПользователя("ПроведениеНезаполненныхДокументов", Объект) Тогда
		ОбязательныеРеквизиты.Добавить("Товары");
	КонецЕсли;
	
	//ОбязательныеРеквизиты.Добавить("Товары.Номенклатура");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Уникальные поля таблицы товаров
	УникальныеТовары = Новый Массив();
	УникальныеТовары.Добавить("Номенклатура");
	// Структура уникальных реквизитов табличных частей
	УникальныеТабличныеЧасти = Новый Структура();
	УникальныеТабличныеЧасти.Вставить("Товары", УникальныеТовары);
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеТабличныеЧасти;
	
КонецФункции // ПолучитьУникальныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПараметрыДействия=Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", Объект.Товары.Количество() > 0);
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Вид мониторинга".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВидМониторингаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	
	
КонецПроцедуры // ВидМониторингаПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыНоменклатураПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если Строка.Номенклатура=Неопределено Тогда
		Строка.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли; 
		
	Строка.Признак = Справочники.ПризнакиНоменклатуры.ПустаяСсылка();
	Строка.КодНоменклатуры = "";
	Строка.АртикулНоменклатуры = "";
	
	Если ТипЗнч(Строка.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
		Строка.Признак = Строка.Номенклатура.Признак;
		Строка.КодНоменклатуры = Строка.Номенклатура.Код;
		Строка.АртикулНоменклатуры = Строка.Номенклатура.Артикул;
		
	ИначеЕсли ТипЗнч(Строка.Номенклатура)=Тип("СправочникСсылка.ОбъектыСравнения") Тогда
		Строка.КодНоменклатуры = Строка.Номенклатура.Код;
	КонецЕсли;
	
	// Проверим, имеют ли смысл дальнейшие действия
	Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Отказ", ЛОЖЬ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

Процедура ТоварыНоменклатураНачалоВыбора(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	Если Строка.Номенклатура=Неопределено Тогда
		Строка.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры //ТоварыНоменклатураНачалоВыбора()

Процедура ТоварыНоменклатураОчистка(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	//изменим тип при очистке
	Если ТипЗнч(Строка.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
		Строка.Номенклатура = Справочники.ОбъектыСравнения.ПустаяСсылка();
		
	ИначеЕсли ТипЗнч(Строка.Номенклатура)=Тип("СправочникСсылка.ОбъектыСравнения") Тогда
		Строка.Номенклатура = "";
		
	Иначе
		Строка.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры //ТоварыНоменклатураОчистка()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ОбъектыМониторинга"

// Обработчик события возникающего при изменении данных реквизита "Конкурент" в таблице "ОбъектыМониторинга".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбъектыМониторингаКонкурентПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	Строка.ДокументМониторинга = ПолучитьДокументМониторинга(Объект, Строка);
	
КонецПроцедуры // ОбъектыМониторингаКонкурентПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.ЗаданиеНаМониторинг",
		"ПФ_MXL_ЗаданиеНаМониторинг",
		НСтр("ru = 'Задание на мониторинг'"),
		СсылкаНаДокумент);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ЗаданиеНаМониторинг") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_ЗаданиеНаМониторинг",
															НСтр("ru = 'Задание на мониторинг'"),
															ПечатьЗаданиеНаМониторинг(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Формирует печатную форму "ЗаданиеНаМониторинг".
//
Функция ПечатьЗаданиеНаМониторинг(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаданиеНаМониторинг_ЗаданиеНаМониторинг";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;

	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ФорматВыводаСуммы = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаданиеНаМониторинг.ПФ_MXL_ЗаданиеНаМониторинг");
		
		ОбластьШапкаТаблицы    = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьЗаголовок       = Макет.ПолучитьОбласть("Заголовок");
		ОбластьСтрока          = Макет.ПолучитьОбласть("Строка");
		ОбластьПодвал          = Макет.ПолучитьОбласть("Подвал");
		
		// Дата документа
		ДатаДокумента = Документ.Дата;
		
		// Вывод заголовка документа.
		ОбластьЗаголовок.Параметры.Заполнить(Документ);
		ТекстЗаголовка = УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(Документ, НСтр("ru = 'Задание на мониторинг'"));
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;

		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);

		// Готовим шапку
		НомерСтраницы = 2; НомерСтраницыПред = 2;
		//ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		//ОбластьШапкаТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы;
		
		// Готовим области строки.
		Для Каждого СтрокаТЧ Из Документ.Товары Цикл
		
			// Заполняем данные строки
			Если ТипЗнч(СтрокаТЧ.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
				ОбластьСтрока.Параметры.Артикул = СтрокаТЧ.Номенклатура.Артикул;
				ОбластьСтрока.Параметры.Номенклатура = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(СтрокаТЧ.Номенклатура);
				
			ИначеЕсли ТипЗнч(СтрокаТЧ.Номенклатура)=Тип("СправочникСсылка.ОбъектыСравнения") Тогда
				ОбластьСтрока.Параметры.Номенклатура = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(СтрокаТЧ.Номенклатура);
				
			Иначе
				ОбластьСтрока.Параметры.Номенклатура = СокрЛП(СтрокаТЧ.Номенклатура);
			КонецЕсли;
			
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьШапкаТаблицы, , НомерСтраницы, , Документ);
			
		КонецЦикла;
		
		УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент,ОбластьПодвал,,,НомерСтраницы,,Документ);
		
		// Отметим конец области документа.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции //ПечатьЗаданиеНаМониторинг()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоДокументуОснование",, "Товары", НСтр("ru = 'Заполнить по документу-основанию'"),,,,, Ложь);
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ГруппаНоменклатуры","Справочник.Номенклатура.Форма.ФормаВыбораГруппы",,, Истина, НСтр("ru = 'Необходимо выбрать группу номенклатуры.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоГруппеНоменклатуры","ТоварыЗаполнитьНоменклатурой", "Товары", НСтр("ru = 'Заполнить по группе номенклатуры'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ПризнакНоменклатуры","Справочник.ПризнакиНоменклатуры.Форма.ФормаСписка",,, Истина, НСтр("ru = 'Необходимо выбрать признак номенклатуры.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоПризнакуНоменклатуры","ТоварыЗаполнитьНоменклатурой", "Товары", НСтр("ru = 'Заполнить по признаку номенклатуры'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "Производитель","Справочник.Производители.Форма.ФормаСписка",,, Истина, НСтр("ru = 'Необходимо выбрать производителя номенклатуры.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоПроизводителю","ТоварыЗаполнитьНоменклатурой", "Товары", НСтр("ru = 'Заполнить по производителю'"), ПараметрыКоманды);

	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ТоварнаяМарка","Справочник.ТоварныеМарки.Форма.ФормаСписка",,, Истина, НСтр("ru = 'Необходимо выбрать товарную марку номенклатуры.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоТоварнойМарке","ТоварыЗаполнитьНоменклатурой", "Товары", НСтр("ru = 'Заполнить по товарной марке'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "РегионКонкурента","Справочник.ГруппыПоставки.Форма.ФормаСписка",,, Истина, НСтр("ru = 'Необходимо выбрать регион конкурента.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ОбъектыМониторингаЗаполнитьПоРегиону","ОбъектыМониторингаЗаполнитьКонкурентами", "ОбъектыМониторинга", НСтр("ru = 'Заполнить по региону'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "Подразделение","Справочник.ПодразделенияКомпании.Форма.ФормаСписка",,, Истина, НСтр("ru = 'Необходимо выбрать подразделение.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ОбъектыМониторингаЗаполнитьПоПодразделению","ОбъектыМониторингаЗаполнитьКонкурентами", "ОбъектыМониторинга", НСтр("ru = 'Заполнить по подразделению'"), ПараметрыКоманды);
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоДокументуОснование.Видимость",   Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоДокументуОснование.Доступность", Истина);
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()

// Обработчик заполнения документа на основании документа
//
Функция ТоварыЗаполнитьПоДокументуОснование(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ВывестиСообщение(НСтр("ru='Не заполнен документ основание.'"), Объект);
	Иначе
		// перезаполняем
		ПараметрыДействия.Вставить("ТребуетсяЗаполнитьНаОсновании", Истина);
		ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	КонецЕсли;
	
КонецФункции // ТоварыЗаполнитьПоДокументуОснование()

// Обработчик заполнения документа номенклатурой
//
Функция ТоварыЗаполнитьНоменклатурой(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ГруппаНоменклатуры	= ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗаполнения, "ГруппаНоменклатуры", Неопределено);
	ПризнакНоменклатуры	= ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗаполнения, "ПризнакНоменклатуры", Неопределено);
	Производитель		= ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗаполнения, "Производитель", Неопределено);
	ТоварнаяМарка		= ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗаполнения, "ТоварнаяМарка", Неопределено);
	
	ТекстЗапроса = "ВЫБРАТЬ Ссылка ИЗ Справочник.Номенклатура ГДЕ НЕ ЭтоГруппа И ВидНоменклатуры<>ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга) И ВидНоменклатуры<>ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Набор)";
	Если Производитель<>Неопределено Тогда
		Запрос = Новый Запрос(ТекстЗапроса + " И Производитель=&Производитель");
		Запрос.УстановитьПараметр("Производитель", Производитель);
		
	ИначеЕсли ПризнакНоменклатуры<>Неопределено Тогда
		Запрос = Новый Запрос(ТекстЗапроса + " И Признак=&Признак");
		Запрос.УстановитьПараметр("Признак", ПризнакНоменклатуры);
	
	ИначеЕсли ТоварнаяМарка<>Неопределено Тогда
		Запрос = Новый Запрос(ТекстЗапроса + " И ТоварнаяМарка=&ТМ");
		Запрос.УстановитьПараметр("ТМ", ТоварнаяМарка);
		
	Иначе
		Запрос = Новый Запрос(ТекстЗапроса + " И Ссылка В ИЕРАРХИИ(&Группа)");
		Запрос.УстановитьПараметр("Группа", ГруппаНоменклатуры);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Формируем параметры поиска товара
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("Номенклатура", Выборка.Ссылка);
		
		// проверим, имеется ли текущая номенклатура в документе
		Если Объект.Товары.НайтиСтроки(ПараметрыОтбора).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// добавляем строку
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Ссылка;
		
		// отработаем изменение номенклатуры
		ТоварыНоменклатураПриИзменении(Объект, НоваяСтрока, ПараметрыДействия);
	КонецЦикла;
КонецФункции // ТоварыЗаполнитьНоменклатурой()

// Обработчик заполнения документа конкурентами
//
Функция ОбъектыМониторингаЗаполнитьКонкурентами(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	РегионКонкурента	= ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗаполнения, "РегионКонкурента", Неопределено);
	Подразделение		= ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗаполнения, "Подразделение", Неопределено);
	Если Подразделение<>Неопределено Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Конкурент КАК Ссылка ИЗ Справочник.ПодразделенияКомпании.Конкуренты ГДЕ Ссылка=&Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Подразделение);
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.Конкуренты ГДЕ ГруппаПоставки=&Регион");
		Запрос.УстановитьПараметр("Регион", РегионКонкурента);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// проверим, имеется ли текущий конкурент в документе
		Если Объект.ОбъектыМониторинга.НайтиСтроки(Новый Структура("Конкурент",Выборка.Ссылка)).Количество()>0 Тогда
			Продолжить;
		КонецЕсли;
		
		// добавляем строку
		НоваяСтрока = Объект.ОбъектыМониторинга.Добавить();
		НоваяСтрока.Конкурент     = Выборка.Ссылка;
		
		// отработаем изменение номенклатуры
		ОбъектыМониторингаКонкурентПриИзменении(Объект, НоваяСтрока, ПараметрыДействия);
	КонецЦикла;
КонецФункции // ОбъектыМониторингаЗаполнитьКонкурентами()

#КонецЕсли