#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьЗначениеВЕТИС(СтатусВСД) Экспорт
	
	ИндексЗначения = Перечисления.СтатусыВСДВЕТИС.Индекс(СтатусВСД);
	
	Результат = Метаданные.Перечисления.СтатусыВСДВЕТИС.ЗначенияПеречисления[ИндексЗначения].Имя;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначение(СтатусВСД) Экспорт
	
	Результат = Неопределено;
	
	ЗначениеПеречисления = Метаданные.Перечисления.СтатусыВСДВЕТИС.ЗначенияПеречисления.Найти(СтатусВСД);
	Если Не ЗначениеПеречисления = Неопределено Тогда
		ИндексЗначения = Метаданные.Перечисления.СтатусыВСДВЕТИС.ЗначенияПеречисления.Индекс(ЗначениеПеречисления);
		Результат = Перечисления.СтатусыВСДВЕТИС[ИндексЗначения];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли