// Модуль общей формы "Форма найденных дублей"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Отображает список дублей.
//
// Параметры
//  СписокДублей - СписокЗначений - Список, содержащий дубли.
//
&НаСервере 
Процедура ОтобразитьДубли(СписокДублей)
	
	ФормаСобственности = Параметры.Объект.ФормаСобственности;
	ЗапретЗаписи = Ложь;
	Для Каждого Дубль Из СписокДублей Цикл
		
		Отбор = Новый Структура();
		Отбор.Вставить("Объект", Дубль.Значение.Ссылка);
		
		НайденнаяСтрока = ТаблицаНайдено.НайтиСтроки(Отбор);
		Если НайденнаяСтрока.Количество() = 0 Тогда
			ТекСтрока = ТаблицаНайдено.Добавить();
			ТекСтрока.Объект = Дубль.Значение.Ссылка;
			ОбъектТаблицыНайдено = Дубль.Значение.Ссылка;
		КонецЕсли;
		Строка = ТаблицаРасшифровкаНайдено.Добавить();
		Строка.Объект = Дубль.Значение.Ссылка;
		Строка.ПредставлениеНайденоПо = Строка(Дубль.Значение.ИмяРеквизита) + " - " + Строка(Дубль.Значение.ЗначениеРеквизита);
		
		Если ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
			 Если Дубль.Значение.ИмяРеквизита = НСтр("ru = 'Наименование и НаименованиеПолное и ДатаРождения'") Тогда
				СтрокаТаблицыНайдено = ТаблицаНайдено.НайтиСтроки(Новый Структура("Объект",Дубль.Значение.Ссылка))[0];
				СтрокаТаблицыНайдено.ДубльПоИННИКПП = Истина;
				Элементы.ТаблицаНайденоДубльПоИННИКПП.Видимость = Истина;
				ЗапретЗаписи = Истина;
			КонецЕсли;

		ИначеЕсли НЕ ФормаСобственности = Перечисления.ФормыСобственности.ПрочаяФормаСобственности Тогда
			Если Дубль.Значение.ИмяРеквизита = НСтр("ru = 'ИНН и КПП'") Тогда
				СтрокаТаблицыНайдено = ТаблицаНайдено.НайтиСтроки(Новый Структура("Объект",Дубль.Значение.Ссылка))[0];
				СтрокаТаблицыНайдено.ДубльПоИННИКПП = Истина;
				Элементы.ТаблицаНайденоДубльПоИННИКПП.Видимость = Истина;
				ЗапретЗаписи = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПравоПользователя("ЗапретитьСохранениеДублейКонтрагентов",Строка.Объект) И ЗапретЗаписи Тогда
			Элементы.Записать.Доступность = Ложь;
			Элементы.ЗаписатьИЗакрыть.Доступность = Ложь;
			Элементы.ПерейтиКНайденному.КнопкаПоУмолчанию = Истина;
		КонецЕсли;
 
		
	КонецЦикла;
	
КонецПроцедуры // ОтобразитьДубли()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события возникающего на клиенте при выполнении команды "Записать и закрыть".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Закрыть(Новый Структура("Результат","Продолжить"));
	
КонецПроцедуры // ЗаписатьИЗакрыть()

// Обработчик события возникающего на клиенте при выполнении команды "Перейти к найденному".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПерейтиКНайденному(Команда)
	
	Закрыть(Новый Структура("Результат,Объект","Перейти",Элементы.ТаблицаНайдено.ТекущиеДанные.Объект));
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при выполнении команды "Записать".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Записать(Команда)
	
	Закрыть(Новый Структура("Результат","ПродолжитьНеЗакрывая"));
	
КонецПроцедуры // Записать()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Обработчик события возникающего на клиенте при активизации строки таблицы "ТАБЛИЦАНАЙДЕНО".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТаблицаНайденоПриАктивизацииСтроки(Элемент)
	
	Элементы.ТаблицаРасшифровкаНайдено.ОтборСтрок = Новый ФиксированнаяСтруктура("Объект", Элементы.ТаблицаНайдено.ТекущиеДанные.Объект); 
	
КонецПроцедуры // ТаблицаНайденоПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при двойном щелчке мыши или нажатии Enter на элемент таблицы "ТАБЛИЦАНАЙДЕНО".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Произвольный - Значение выбранной строки.
//  Поле - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ТаблицаНайденоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(,Элемент.ТекущиеДанные.Объект);
	
КонецПроцедуры // ТаблицаНайденоВыбор()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СписокДублей") Тогда
		ОтобразитьДубли(Параметры.СписокДублей);
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
