// Модуль менеджера документа "Гашение входящих ВСД ВетИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Обмены

Функция ОбработатьРезультатГашенияВСД(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, ПараметрыОбмена, ДополнительныеПараметры = Неопределено) Экспорт
	
	НовыйСтатус     = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОбрабатывается;
	ОбъектИзменен   = Ложь;
	НастройкаПодключения = ПараметрыОбмена.НастройкиПодключения.Получить(ХозяйствующийСубъект);
	
	ПараметрыЗапроса = Неопределено;
	Если ДанныеДокумента.ПараметрыЗапроса <> Неопределено Тогда
		Значение = ДанныеДокумента.ПараметрыЗапроса.Получить();
		Если ТипЗнч(Значение) = Тип("Структура") Тогда
			ПараметрыЗапроса = Значение;
		КонецЕсли;
	КонецЕсли;
	
	СсылкаНаОбъект = ДанныеДокумента.Документ;
	ИдентификаторСтроки = ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗапроса, "ИдентификаторСтроки", "");
	//ДанныеДокумента.ПараметрыЗапроса.Получить().ИдентификаторСтроки
	ДокументОбъект       = Неопределено;
	ПерезаписатьДокумент = Ложь;
	//Если РезультатДобавленияЗаписей.ВходящееСообщение.НовоеСообщение Тогда
	Если ДанныеДокумента.Объект <> Неопределено Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ЗаписиЖурнала = ПолучитьЗначениеПараметраСтруктуры(ДанныеДокумента.Объект, "stockEntry", Новый Массив);
		
		НаборЗаписи = РегистрыСведений.СкладскойЖурналВЕТИС.СоздатьНаборЗаписей();
		
		СписокКЗагрузке = ИнтеграцияВЕТИС.ПолучитьСписокКЗагрузке(НаборЗаписи, ЗаписиЖурнала, ХозяйствующийСубъект, Предприятие);
		Для Каждого ТекущаяСтрока Из ЗаписиЖурнала Цикл
			НайденнаяЗапись = СписокКЗагрузке.Найти(ТекущаяСтрока.guid, "guid");
			Если НайденнаяЗапись = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ТекущаяСтрока.last = Ложь Тогда
				Продолжить;
			КонецЕсли;
			ИнтеграцияВЕТИС.СформироватьЗаписьСкладскогоЖурнала(ПараметрыОбмена, НаборЗаписи, ХозяйствующийСубъект, Предприятие, ТекущаяСтрока,,НайденнаяЗапись.ЕстьЗапись, ДополнительныеПараметры.ДанныеВыполненияЗаявки.prdcRsltDate);
		КонецЦикла;
		
		ДокументОбъект = СсылкаНаОбъект.ПолучитьОбъект();
		//ДокументОбъект.Заблокировать();
		
		ТоварнаяСтрока = ДокументОбъект.Товары.Найти(ИдентификаторСтроки, "ИдентификаторСтроки");
		
		ПерезаписатьДокумент = Ложь;
		Если НЕ ТоварнаяСтрока = Неопределено Тогда
			
			СписокВСД = ПолучитьЗначениеПараметраСтруктуры(ДанныеДокумента.Объект, "vetDocument", Новый Массив);
			
			Для Каждого ТекущаяСтрока Из СписокВСД Цикл
				Если ТекущаяСтрока.vetDType = "RETURNABLE" Тогда
					Если ЗначениеЗаполнено(ТоварнаяСтрока.ВСДВозврат) Тогда
						ИнтеграцияВЕТИС.ЗагрузитьВСД(НастройкаПодключения, ХозяйствующийСубъект, Предприятие, ТекущаяСтрока, ТоварнаяСтрока.ВСДВозврат,, Ложь);
					Иначе
						ВСДВозврат = ИнтеграцияВЕТИС.ЗагрузитьВСД(НастройкаПодключения, ХозяйствующийСубъект, Предприятие, ТекущаяСтрока,,, Ложь);
						
						СтрокиДляЗаполнения = ДокументОбъект.Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
						Для Каждого СтрокаДляЗаполнения Из СтрокиДляЗаполнения Цикл
							СтрокаДляЗаполнения.ВСДВозврат = ВСДВозврат;
						КонецЦикла;
						
						ПерезаписатьДокумент = Истина;
					КонецЕсли;
				ИначеЕсли ТекущаяСтрока.vetDType = "TRANSPORT" Тогда
					Если ЗначениеЗаполнено(ТоварнаяСтрока.ВСД) Тогда
						ИнтеграцияВЕТИС.ЗагрузитьВСД(НастройкаПодключения, ХозяйствующийСубъект, Предприятие, ТекущаяСтрока, ТоварнаяСтрока.ВСД,, Ложь);
					Иначе
						ВСД = ИнтеграцияВЕТИС.ЗагрузитьВСД(НастройкаПодключения, ХозяйствующийСубъект, Предприятие, ТекущаяСтрока,,, Ложь);
						
						СтрокиДляЗаполнения = ДокументОбъект.Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
						Для Каждого СтрокаДляЗаполнения Из СтрокиДляЗаполнения Цикл
							СтрокаДляЗаполнения.ВСД = ВСД;
						КонецЦикла;
						
						ПерезаписатьДокумент = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		НовыйСтатус = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаВыполнена;
		
	КонецЕсли;
	
	НовыйСтатус = ОбновитьСтатусПослеПолученияДанных(
			ДанныеДокумента.Документ,
			ДанныеДокумента.ВходящаяОперация,
			ДанныеДокумента.СтатусОбработки);
	
	ТекстОшибки = ИнтеграцияВЕТИС.ТекстОшибкиОбработкиРезультата(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, Истина);
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		
		Если ДокументОбъект = Неопределено Тогда
			ДокументОбъект = СсылкаНаОбъект.ПолучитьОбъект();
			//ДокументОбъект.Заблокировать();
		КонецЕсли;
		
		ТоварнаяСтрока = ДокументОбъект.Товары.Найти(ИдентификаторСтроки, "ИдентификаторСтроки");
		
		Если НЕ ТоварнаяСтрока = Неопределено Тогда
			ТоварнаяСтрока.ТекстОшибки = ТекстОшибки;
			ПерезаписатьДокумент = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ПерезаписатьДокумент Тогда
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать();
		ОбъектИзменен = Истина;
	КонецЕсли;
	
	//Если НЕ ДокументОбъект = Неопределено Тогда
	//	ДокументОбъект.Разблокировать();
	//КонецЕсли;
	
	Если ДополнительныеПараметры.ЕстьОшибкиСервиса Тогда
		
		ВозвращаемоеЗначение = Неопределено;
		ДополнительныеПараметры.ЭлементОчереди.ТекстОшибки = ТекстОшибки;
		
	Иначе
		
		ВозвращаемоеЗначение = ИнтеграцияВЕТИСКлиентСервер.СтруктураИзменения();
		ВозвращаемоеЗначение.ХозяйствующийСубъект = ХозяйствующийСубъект;
		ВозвращаемоеЗначение.Предприятие          = Предприятие;
		ВозвращаемоеЗначение.ВидОперации          = ДанныеДокумента.ВходящаяОперация;
		
		ВозвращаемоеЗначение.ТекстОшибки = ИнтеграцияВЕТИС.ТекстОшибкиОбработкиРезультата(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, Истина);
		ВозвращаемоеЗначение.ПодготовленоКПередаче = Ложь;
		ВозвращаемоеЗначение.Передано              = Ложь;
		ВозвращаемоеЗначение.Принято               = Истина;
		ВозвращаемоеЗначение.ЕстьОшибкиСервиса     = ДополнительныеПараметры.ЕстьОшибкиСервиса;
		
		ВозвращаемоеЗначение.ИсходящееСообщение = ДанныеДокумента.ИсходящееСообщение;
		ВозвращаемоеЗначение.ВходящееСообщение  = ДанныеДокумента.ИдентификаторЗаявки;
		
		ВозвращаемоеЗначение.НовыйСтатус       = НовыйСтатус;
		ВозвращаемоеЗначение.ОбъектИзменен     = ОбъектИзменен;
		ВозвращаемоеЗначение.Объект            = ДанныеДокумента.Документ;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Статус после подготовки к передаче данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ВходящаяТранспортнаяОперацияВЕТИС - Ссылка на документ.
//  Операция - ПеречислениеСсылка.ВидыОперацийВЕТИС - Операция обмена с ВЕТИС.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиВЕТИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 3.
//
Функция СтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидОперации) Экспорт
	
	ПараметрыОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ПараметрыОбновления();
	
	Если ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросНаОформлениеВходящейПартии Тогда
		
		ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.КГашению;
		ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.ОжидайтеЗавершенияОбработки;
		ПараметрыОбновления.ДальнейшееДействие2 = Перечисления.ДальнейшиеДействияВЕТИС.ОтменитеПередачуДанных;
		
	//ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросВозможностиПеревозки Тогда
	//	
	//	ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.ЗапросВозможностиПеремещенияКПередаче;
	//	ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.ОжидайтеЗавершенияОбработки;
	//	ПараметрыОбновления.ДальнейшееДействие2 = Перечисления.ДальнейшиеДействияВЕТИС.ОтменитеПередачуДанных;
	//	
	Иначе
		ВызватьИсключение ИнтеграцияВЕТИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидОперации);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Статус после передачи данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ВходящаяТранспортнаяОперацияВЕТИС - Ссылка на документ.
//  Операция - ПеречислениеСсылка.ВидыОперацийВЕТИС - Операция обмена с ВЕТИС.
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийВЕТИС - Статус обработки сообщения.
//  ДополнительныеПараметры - Структура, Неопределено - Дополнительные параметры.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиВЕТИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 3.
//
Функция СтатусПослеПередачиДанных(ДокументСсылка, ВидОперации, СтатусОбработки, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ПараметрыОбновления();
	
	Если СтатусОбработки = Неопределено Тогда
		СтатусОбработки = Перечисления.ВидыСтатусовОбработкиВЕТИС.ЗаявкаПринята;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросНаОформлениеВходящейПартии Тогда
		
		ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.Обрабатывается;
		ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.ОжидайтеЗавершенияОбработки;
		
		//СтатусыБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиВЕТИС.ОшибкаПередачи;
		//
		////Если ДополнительныеПараметры <> Неопределено
		////	И ДополнительныеПараметры.ЕстьОшибкиСервиса Тогда
		////	СтатусыБазовыйПроцесс.ОшибкаДействия.Добавить(
		////		Перечисления.ДальнейшиеДействияВЕТИС.ПроверьтеКорректностьДанных);
		////Иначе
		//	СтатусыБазовыйПроцесс.ОшибкаДействия.Добавить(
		//		Перечисления.ДальнейшиеДействияВЕТИС.ПередайтеДанные);
		////КонецЕсли;
		
	//ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросВозможностиПеревозки Тогда
	//	
	//	ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.ЗапросВозможностиПеремещенияОбрабатывается;
	//	ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.ОжидайтеЗавершенияОбработки;
	//	
	//	//СтатусыБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиВЕТИС.ЗапросВозможностиПеремещенияОшибка;
	//	//СтатусыБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияВЕТИС.ПроверьтеВозможностьПеремещения);
	//	
	Иначе
		ВызватьИсключение ИнтеграцияВЕТИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидОперации);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Статус после получения данных из ВЕТИС.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ВходящаяТранспортнаяОперацияВЕТИС - Документ, для которого требуется обновить статус.
//  Операция - ПеречислениеСсылка.ВидыОперацийВЕТИС - Операция обмена с ВЕТИС
//  ДополнительныеПараметры - Структура - см. функцию ИнтеграцияВЕТИС.ПараметрыОбновленияСтатуса().
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиВЕТИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияВЕТИС - Дальнейшее действие 3.
//
Функция СтатусПослеПолученияДанных(ДокументСсылка, ВидОперации, СтатусОбработки) Экспорт
	
	ПараметрыОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ПараметрыОбновления();
	
	Если ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросОформленияВходящейПартии Тогда
		
		Если СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОтклонена
			Или СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.Ошибка Тогда
			ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.ОтклоненВЕТИС;
			ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.ПередайтеДанные;
		ИначеЕсли СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаВыполнена ИЛИ 
			СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаПринята Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
			Запрос.Текст = "
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА КАК ЕстьНеПогашенные
			|ИЗ
			|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК ГашениеВходящихВСДВЕТИС
			|ГДЕ
			|	ГашениеВходящихВСДВЕТИС.Ссылка = &Ссылка И 
			|	(НЕ ГашениеВходящихВСДВЕТИС.ВСД = ЗНАЧЕНИЕ(Документ.ВСДВЕТИС.ПустаяСсылка)) И 
			|	(НЕ ГашениеВходящихВСДВЕТИС.ВСД.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВСДВЕТИС.UTILIZED))
			|";
			
			ЕстьНеПогашенные = Ложь;
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ЕстьНеПогашенные = Выборка.ЕстьНеПогашенные;
			КонецЕсли;
			
			Если ЕстьНеПогашенные = Истина Тогда
				ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.Обрабатывается;
				ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.ОжидайтеЗавершенияОбработки;
			Иначе
				ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.ВСДПогашены;
				ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.НеТребуется;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		ВызватьИсключение ИнтеграцияВЕТИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидОперации);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Обновить статус после подготовки к передаче данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ВходящаяТранспортнаяОперацияВЕТИС - Ссылка на документ.
//  Операция - ПеречислениеСсылка.ВидыОперацийВЕТИС - Операция обмена с ВЕТИС.
//  ДополнительныеПараметры - Структура - см. функцию ИнтеграцияВЕТИС.ПараметрыОбновленияСтатуса().
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыСтатусовОбработкиВЕТИС - Новый статус.
//
Функция ОбновитьСтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, Операция, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, Операция);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обновить статус после передачи данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ВходящаяТранспортнаяОперацияВЕТИС - Ссылка на документ.
//  Операция - ПеречислениеСсылка.ВидыОперацийВЕТИС - Операция обмена с ВЕТИС.
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения.
//  ДополнительныеПараметры - Структура - см. функцию ИнтеграцияВЕТИС.ПараметрыОбновленияСтатуса().
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыСтатусовОбработкиВЕТИС - Новый статус.
//
Функция ОбновитьСтатусПослеПередачиДанных(ДокументСсылка, Операция, СтатусОбработки, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПередачиДанных(ДокументСсылка, Операция, СтатусОбработки, ДополнительныеПараметры);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обновить статус после получения данных из ВЕТИС.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ВходящаяТранспортнаяОперацияВЕТИС - Документ, для которого требуется обновить статус.
//  Операция - ПеречислениеСсылка.ВидыОперацийВЕТИС - Операция обмена с ВЕТИС.
//  ДополнительныеПараметры - Структура - см. функцию ИнтеграцияВЕТИС.ПараметрыОбновленияСтатуса().
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыСтатусовОбработкиВЕТИС - Новый статус.
//
Функция ОбновитьСтатусПослеПолученияДанных(ДокументСсылка, Операция, СтатусОбработки) Экспорт
	
	ПараметрыОбновления = СтатусПослеПолученияДанных(ДокументСсылка, Операция, СтатусОбработки);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обработчик изменения статуса документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ИсходящаяТранспортнаяОперацияВЕТИС - Документ.
//  ПредыдущийСтатус - ПеречислениеСсылка.СтатусыОбработкиИсходящихТранспортныхОперацийВЕТИС - Предыдущий статус.
//  НовыйСтатус - ПеречислениеСсылка.СтатусыОбработкиИсходящихТранспортныхОперацийВЕТИС - Предыдущий статус.
//  ПараметрыОбновленияСтатуса - Структура - см. функцию ИнтеграцияВЕТИС.ПараметрыОбновленияСтатуса().
//
Процедура ПриИзмененииСтатусаДокумента(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус, ПараметрыОбновленияСтатуса) Экспорт
	
	//ОбновитьДвижения = ИнтеграцияВЕТИС.СтатусТребуетОбновленияДвижений(СтатусыДвиженийРезерв(), ПредыдущийСтатус, НовыйСтатус);
	
	Если ПараметрыОбновленияСтатуса.ОбновлятьДвижения Тогда
		//И ОбновитьДвижения Тогда
		
		//ОбновитьДвиженияЗаписиСкладскогоЖурналаВРезервеВЕТИС(ДокументСсылка);
		
	КонецЕсли;
	
	// статусы поступлений товаров
	// пока делаю в попытке т.к. нет возможности отладить
	Попытка
		Если (НовыйСтатус = Перечисления.ВидыСтатусовОбработкиВЕТИС.ОшибкаПередачи ИЛИ 
				НовыйСтатус = Перечисления.ВидыСтатусовОбработкиВЕТИС.ОтклоненВЕТИС) Тогда
				
			РегистрыСведений.СтатусыПоступленийТоваров.ОбновитьСтатус(ДокументСсылка,4);
			
		ИначеЕсли (НовыйСтатус = Перечисления.ВидыСтатусовОбработкиВЕТИС.ЧастичноПогашен ИЛИ 
				НовыйСтатус = Перечисления.ВидыСтатусовОбработкиВЕТИС.ПогашенСРасхождениями ИЛИ
				НовыйСтатус = Перечисления.ВидыСтатусовОбработкиВЕТИС.Погашен ИЛИ
				НовыйСтатус = Перечисления.ВидыСтатусовОбработкиВЕТИС.ВСДПогашены) Тогда
				
			РегистрыСведений.СтатусыПоступленийТоваров.ОбновитьСтатус(ДокументСсылка,3);
			
		Иначе
			
			РегистрыСведений.СтатусыПоступленийТоваров.ОбновитьСтатус(ДокументСсылка,2);
			
		КонецЕсли;
	Исключение
		Ош = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("СтатусПоступления", УровеньЖурналаРегистрации.Ошибка, , , СокрЛП(ДокументСсылка)+"/"+Ош);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

Процедура ЗаполнитьВСД(ДокументОбъект, НомерТТН, ДатаТТН) Экспорт
	
	ИдентификаторСтроки = 0;
	Для Каждого ТекущаяСтрока Из ДокументОбъект.Товары Цикл
		ИдентификаторСтроки = Макс(ИдентификаторСтроки, ТекущаяСтрока.ИдентификаторСтроки);
	КонецЦикла;
	ИдентификаторСтроки = ИдентификаторСтроки + 1;
	
	Для Каждого ТекущаяСтрока Из ДокументОбъект.Товары Цикл
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторСтроки) Тогда
			ТекущаяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
			ИдентификаторСтроки = ИдентификаторСтроки + 1;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерТТН", НомерТТН);
	Запрос.УстановитьПараметр("ДатаТТН",  ДатаТТН);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТаблицаТовары.Вес КАК Вес,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.ИдентификаторСтроки
	|ПОМЕСТИТЬ
	|	ТоварыОбъекта
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СоответствиеНоменклатурыВЕТИС.Продукция, ЗНАЧЕНИЕ(Справочник.ПродукцияВЕТИС.ПустаяСсылка)) КАК Продукция,
	|	ВЫРАЗИТЬ(ТаблицаТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТаблицаТовары.Вес КАК Вес,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ТаблицаТовары.ИдентификаторСтроки
	|ПОМЕСТИТЬ
	|	ВремТаблицаТовары
	|ИЗ
	|	ТоварыОбъекта КАК ТаблицаТовары
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СоответствиеНоменклатурыВЕТИС КАК СоответствиеНоменклатурыВЕТИС
	|ПО
	|	ТаблицаТовары.Номенклатура = СоответствиеНоменклатурыВЕТИС.Номенклатура
	|;
	|
	//|ВЫБРАТЬ
	//|	ВСДВЕТИС.Ссылка КАК ВСД
	//|ПОМЕСТИТЬ
	//|	ТаблицаВСДпоТТН
	//|ИЗ
	//|	Документ.ВСДВЕТИС КАК ВСДВЕТИС
	//|ГДЕ
	//|	ВСДВЕТИС.НомерТТН = &НомерТТН И 
	//|	ВСДВЕТИС.ДатаТТН = &ДатаТТН
	//|
	//|ОБЪЕДИНИТЬ
	//|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВСДВЕТИС.Ссылка КАК ВСД
	|ПОМЕСТИТЬ
	|	ТаблицаВСДпоТТН
	|ИЗ
	|	Документ.ВСДВЕТИС.СвязанныеДокументы КАК ВСДВЕТИС
	|ГДЕ
	|	ВСДВЕТИС.Номер = &НомерТТН И 
	|	ВСДВЕТИС.Дата = &ДатаТТН
	|;
	|
	|ВЫБРАТЬ
	|	ВСДВЕТИС.ВСД КАК ВСД,
	//|	ТаблицаТовары.ВидПродукции,
	|	ТаблицаТовары.Продукция,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.Вес = 0 ТОГДА
	|			ТаблицаТовары.Количество
	|		ИНАЧЕ
	|			ТаблицаТовары.Вес
	|	КОНЕЦ КАК Количество,
	|	ТаблицаТовары.ИдентификаторСтроки
	|ПОМЕСТИТЬ
	|	ТаблицаТовары
	|ИЗ
	|	ВремТаблицаТовары КАК ТаблицаТовары
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаВСДпоТТН КАК ВСДВЕТИС
	|ПО
	|	ИСТИНА
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.ВСД КАК ВСД,
	|	МАКСИМУМ(ТаблицаТовары.ИдентификаторСтроки) КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ
	|	ТаблицаТоварыОднаСтрока
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.ВСД
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ТаблицаТовары.ИдентификаторСтроки) = 1
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВСДВЕТИС.Ссылка КАК ВСД,
	|	1 КАК Приоритет,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ВСДВЕТИС.Количество КАК КоличествоПоВСД
	|ПОМЕСТИТЬ
	|	ТаблицаВСД
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ВСДВЕТИС КАК ВСДВЕТИС
	|ПО
	|	ВСДВЕТИС.Ссылка = ТаблицаТовары.ВСД И 
	|	ВСДВЕТИС.Продукция = ТаблицаТовары.Продукция И 
	|	ВСДВЕТИС.Количество = ТаблицаТовары.Количество
	|ГДЕ
	|	ВСДВЕТИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВСДВЕТИС.CONFIRMED) И 
	|	ВСДВЕТИС.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВСДВЕТИС.Ссылка КАК ВСД,
	|	2 КАК Приоритет,
	|	ТаблицаТовары.Количество КАК Количество,
	|	ВСДВЕТИС.Количество КАК КоличествоПоВСД
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ВСДВЕТИС КАК ВСДВЕТИС
	|ПО
	|	ВСДВЕТИС.Ссылка = ТаблицаТовары.ВСД И 
	|	ВСДВЕТИС.Продукция = ТаблицаТовары.Продукция И 
	|	(НЕ ВСДВЕТИС.Количество = ТаблицаТовары.Количество)
	|ГДЕ
	|	ВСДВЕТИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВСДВЕТИС.CONFIRMED) И 
	|	ВСДВЕТИС.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.ИдентификаторСтроки,
	|	ВСДВЕТИС.Ссылка,
	|	4,
	|	0 КАК Количество,
	|	0 КАК КоличествоПоВСД
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ВСДВЕТИС КАК ВСДВЕТИС
	|ПО
	|	ВСДВЕТИС.Ссылка = ТаблицаТовары.ВСД И 
	|	ВСДВЕТИС.ПродукцияСтрокой ПОДОБНО ""%"" + ТаблицаТовары.Номенклатура.Наименование + ""%""
	|ГДЕ
	|	ВСДВЕТИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВСДВЕТИС.CONFIRMED) И 
	|	ВСДВЕТИС.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.ИдентификаторСтроки,
	|	ВСДВЕТИС.Ссылка,
	|	5,
	|	0 КАК Количество,
	|	0 КАК КоличествоПоВСД
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ВСДВЕТИС КАК ВСДВЕТИС
	|ПО
	|	ВСДВЕТИС.Ссылка = ТаблицаТовары.ВСД И 
	|	ВСДВЕТИС.Продукция.Наименование ПОДОБНО ""%"" + ТаблицаТовары.Номенклатура.Наименование + ""%""
	|ГДЕ
	|	ВСДВЕТИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВСДВЕТИС.CONFIRMED) И 
	|	ВСДВЕТИС.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.ИдентификаторСтроки,
	|	МАКСИМУМ(ВСДВЕТИС.Ссылка),
	|	7,
	|	0 КАК Количество,
	|	0 КАК КоличествоПоВСД
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ВСДВЕТИС КАК ВСДВЕТИС
	|ПО
	|	ВСДВЕТИС.Ссылка = ТаблицаТовары.ВСД И 
	|	ТаблицаТовары.Количество = ВСДВЕТИС.Количество
	|ГДЕ
	|	ВСДВЕТИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВСДВЕТИС.CONFIRMED) И 
	|	ВСДВЕТИС.ПометкаУдаления = ЛОЖЬ
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.ИдентификаторСтроки
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ВСДВЕТИС.Ссылка) = 1
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаВСД.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаВСД.ВСД КАК ВСД,
	|	ТаблицаВСД.ВСД КАК КоличествоВСД,
	|	ТаблицаВСД.Приоритет КАК Приоритет,
	|	ТаблицаВСД.Количество,
	|	ТаблицаВСД.КоличествоПоВСД
	|ИЗ
	|	ТаблицаВСД КАК ТаблицаВСД
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	ИдентификаторСтроки
	|ИТОГИ
	|	МИНИМУМ(Приоритет),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КоличествоВСД),
	|	МАКСИМУМ(Количество),
	|	СУММА(КоличествоПоВСД)
	|ПО
	|	ИдентификаторСтроки,
	|	Приоритет
	|";
	
	Запрос.УстановитьПараметр("ТаблицаТовары", ДокументОбъект.Товары.Выгрузить());
	ВыборкаПоНомеруСтроки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоНомеруСтроки.Следующий() Цикл
		ВыборкаПоПриоритету = ВыборкаПоНомеруСтроки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаПоПриоритету.Следующий() Тогда
			Если ВыборкаПоПриоритету.КоличествоВСД > 1 Тогда
				//Если ВыборкаПоПриоритету.Приоритет = 2 И ВыборкаПоПриоритету.Количество = ВыборкаПоПриоритету.КоличествоПоВСД Тогда
				Если ВыборкаПоПриоритету.Приоритет = 2 Тогда
					Выборка = ВыборкаПоПриоритету.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					КоличествоРаспределить = ВыборкаПоПриоритету.Количество;
					Пока Выборка.Следующий() Цикл
						
						Если КоличествоРаспределить=0 Тогда
							Прервать;
						КонецЕсли;
						
						КоличествоПоВСД = Мин(КоличествоРаспределить, Выборка.КоличествоПоВСД);
						
						Если КоличествоПоВСД = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						//ТоварнаяСтрока = ДокументОбъект.Товары.Найти(Выборка.ВСД, "ВСД");
						ТоварныеСтроки = ДокументОбъект.Товары.НайтиСтроки(Новый Структура("ВСД", Выборка.ВСД));
						//Если ТоварныеСтроки.Количество()>0 И (НЕ ТоварныеСтроки[0].ИдентификаторСтроки = ВыборкаПоНомеруСтроки.ИдентификаторСтроки) Тогда
						Если ТоварныеСтроки.Количество()>0 Тогда
							//ВСД уже есть
							КоличествоРаспределить = КоличествоРаспределить - КоличествоПоВСД;
							Продолжить;
						КонецЕсли;
						
						ТоварныеСтроки = ДокументОбъект.Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаПоНомеруСтроки.ИдентификаторСтроки));
						Если ТоварныеСтроки.Количество()=0 Тогда
							КоличествоРаспределить = КоличествоРаспределить - КоличествоПоВСД;
							Продолжить;
						КонецЕсли;
						
						ТоварнаяСтрока = ТоварныеСтроки[0];
						
						Если ЗначениеЗаполнено(ТоварнаяСтрока.ВСД) ИЛИ ТоварнаяСтрока.Вес>КоличествоПоВСД Тогда
							НоваяСтрока = ДокументОбъект.Товары.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, ТоварнаяСтрока);
							НоваяСтрока.ВСД = Выборка.ВСД;
							Если НоваяСтрока.КоэффициентВеса = 0 Тогда
								НоваяСтрока.Количество = КоличествоПоВСД;
							Иначе
								НоваяСтрока.Вес        = КоличествоПоВСД;
								НоваяСтрока.Количество = КоличествоПоВСД/ТоварнаяСтрока.КоэффициентВеса;
							КонецЕсли;
							
							НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
							ИдентификаторСтроки = ИдентификаторСтроки + 1;
							
							ТоварыВСДПриИзменении(ДокументОбъект, НоваяСтрока);
							
							ТоварнаяСтрока.Вес        = Макс(ТоварнаяСтрока.Вес-НоваяСтрока.Вес, 0);
							ТоварнаяСтрока.Количество = Макс(ТоварнаяСтрока.Количество-НоваяСтрока.Количество, 0);
							
						Иначе
							ТоварнаяСтрока.ВСД = Выборка.ВСД;
							Если ТоварнаяСтрока.КоэффициентВеса = 0 Тогда
								ТоварнаяСтрока.Количество = КоличествоПоВСД;
							Иначе
								ТоварнаяСтрока.Вес        = КоличествоПоВСД;
								ТоварнаяСтрока.Количество = КоличествоПоВСД/ТоварнаяСтрока.КоэффициентВеса;
							КонецЕсли;
							ТоварыВСДПриИзменении(ДокументОбъект, ТоварнаяСтрока);
						КонецЕсли;
						
						КоличествоРаспределить = КоличествоРаспределить - КоличествоПоВСД;
						
					КонецЦикла;
				Иначе
					ВывестиСообщение(НСтр("ru='Для строки: <%1>  подобрано более одного варианта ВСД. Автоматическая подстановка ВСД не выполнена.'"),,,,,Строка(ВыборкаПоНомеруСтроки.ИдентификаторСтроки));
				КонецЕсли;
			Иначе
				Выборка = ВыборкаПоПриоритету.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Если Выборка.Следующий() Тогда
					
					ТоварныеСтроки = ДокументОбъект.Товары.НайтиСтроки(Новый Структура("ВСД", Выборка.ВСД));
					Если ТоварныеСтроки.Количество()>0 И (НЕ ТоварныеСтроки[0].ИдентификаторСтроки = ВыборкаПоНомеруСтроки.ИдентификаторСтроки) Тогда
					Иначе
						ТоварныеСтроки = ДокументОбъект.Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаПоНомеруСтроки.ИдентификаторСтроки));
						Если ТоварныеСтроки.Количество()>0 Тогда
							ТоварнаяСтрока = ТоварныеСтроки[0];
							ТоварнаяСтрока.ВСД = Выборка.ВСД;
							ТоварыВСДПриИзменении(ДокументОбъект, ТоварнаяСтрока);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	
	// Производим установку полученных значений в итоговые показатели объекта
	Если НЕ Расширенные Тогда
		Возврат ИтогиОперации;
	КонецЕсли;
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

// Зполняет данные возврата ТТН
Процедура ОбновитьВозвратНажатие(Объект, УсловияПеремещенияПродукции = Неопределено, СвязанныеДокументы = Неопределено) Экспорт
	
	Объект.ТипТТНВозврат    = Объект.ТипТТН;
	Объект.СерияТТНВозврат  = Объект.СерияТТН;
	Объект.НомерТТНВозврат  = Объект.НомерТТН;
	Объект.ДатаТТНВозврат   = Объект.ДатаТТН;
	Объект.ПосредникВозврат = Объект.Посредник;
	Объект.ТранспортноеСредствоВозврат = Объект.ТранспортноеСредство;
	Объект.ПрицепВозврат          = Объект.Прицеп;
	Объект.НомерКонтейнераВозврат = Объект.НомерКонтейнера;
	Объект.СпособХраненияВозврат  = Объект.СпособХранения;
	
	ПунктыПерегрузкиВозврат = Объект.ПунктыПерегрузкиВозврат;
	ПунктыПерегрузкиВозврат.Очистить();
	Для Каждого ТекущаяСтрока Из Объект.ПунктыПерегрузки Цикл
		НоваяСтрока = Объект.ПунктыПерегрузкиВозврат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	КонецЦикла;
	
	Если УсловияПеремещенияПродукции = Неопределено Тогда
		ВСД = Неопределено;
		Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
			Если ЗначениеЗаполнено(ТекущаяСтрока.ВСД) Тогда
				ВСД = ТекущаяСтрока.ВСД;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ВСД = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ВСДВЕТИС.СвязанныеДокументы.(
		|		ТипДокумента,
		|		Серия,
		|		Номер,
		|		Дата,
		|		ТипСвязи
		|	),
		|	ВСДВЕТИС.УсловияПеремещенияПродукции.(
		|		УсловиеПеремещения
		|	)
		|ИЗ
		|	Документ.ВСДВЕТИС КАК ВСДВЕТИС
		|ГДЕ
		|	ВСДВЕТИС.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ВСД);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если НЕ Выборка.Следующий() Тогда
			Возврат;
		КонецЕсли;
		
		СвязанныеДокументыВСД          = Выборка.СвязанныеДокументы.Выгрузить();
		УсловияПеремещенияПродукцииВСД = Выборка.УсловияПеремещенияПродукции.Выгрузить();
		
		Объект.СвязанныеДокументыВозврат.Очистить();
		Для Каждого ТекущаяСтрока Из СвязанныеДокументыВСД Цикл
			НоваяСтрока = Объект.СвязанныеДокументыВозврат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		
		Объект.УсловияПеремещенияПродукцииВозврат.Очистить();
		Для Каждого ТекущаяСтрока Из УсловияПеремещенияПродукцииВСД Цикл
			НоваяСтрока = Объект.УсловияПеремещенияПродукцииВозврат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		
	Иначе
		
		Объект.СвязанныеДокументыВозврат.Очистить();
		Для Каждого ТекущаяСтрока Из СвязанныеДокументы Цикл
			НоваяСтрока = Объект.СвязанныеДокументыВозврат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		
		Объект.УсловияПеремещенияПродукцииВозврат.Очистить();
		Для Каждого ТекущаяСтрока Из УсловияПеремещенияПродукции Цикл
			НоваяСтрока = Объект.УсловияПеремещенияПродукцииВозврат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ОбновитьВозвратНажатие()

Процедура ТоварыВСДПриИзменении(Объект, ТекущиеДанные) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВСДВЕТИС.Идентификатор КАК ИдентификаторВСД,
	|	ВСДВЕТИС.СтранаПроисхождения,
	|	ВСДВЕТИС.ДатаВыработки,
	|	ВСДВЕТИС.ДатаВыработкиПо,
	|	ВСДВЕТИС.СрокГодности,
	|	ВСДВЕТИС.СрокГодностиПо,
	|	ВСДВЕТИС.Скоропортящаяся,
	|	ВСДВЕТИС.Некачественный,
	|	ВСДВЕТИС.ВидПродукции,
	|	ВСДВЕТИС.Продукция,
	|	ВСДВЕТИС.ЕдиницаИзмерения,
	|	ВСДВЕТИС.КоличествоУпаковок,
	|	ВСДВЕТИС.Маркировка.(
	|		Маркировка,
	|		ТипМаркировки,
	|		ИдентификаторСтроки
	|	),
	|	ВСДВЕТИС.Упаковки.(
	|		Упаковка,
	|		УровеньУпаковки,
	|		КоличествоУпаковок,
	|		ИдентификаторСтроки
	|	)
	|ИЗ
	|	Документ.ВСДВЕТИС КАК ВСДВЕТИС
	|ГДЕ
	|	ВСДВЕТИС.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущиеДанные.ВСД);
	
	ВыборкаСтроки = Запрос.Выполнить().Выбрать();
	Если ВыборкаСтроки.Следующий() Тогда
		
		НайденныеСтроки = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтрокиТовары", ТекущиеДанные.ИдентификаторСтроки));
		Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			НайденнаяМаркировка = Объект.Маркировка.НайтиСтроки(Новый Структура("ИдентификаторСтрокиТовары, ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки, ТекущаяСтрока.ИдентификаторСтроки));
			Для Каждого ТекущаяСтрокаМаркировки Из НайденнаяМаркировка Цикл
				Объект.Маркировка.Удалить(ТекущаяСтрокаМаркировки);
			КонецЦикла;
			Объект.Упаковки.Удалить(ТекущаяСтрока);
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ВыборкаСтроки);
		
		Если ТекущиеДанные.КоэффициентВеса = 0 Тогда
			ТекущиеДанные.КоэффициентВеса = ВыборкаСтроки.Продукция.ФасовкаКоличествоЕдиницВУпаковке;
		КонецЕсли;
		
		ВыборкаУпаковки = ВыборкаСтроки.Упаковки.Выбрать();
		Пока ВыборкаУпаковки.Следующий() Цикл
			НоваяСтрока = Объект.Упаковки.Добавить();
			НоваяСтрока.ИдентификаторСтрокиТовары = ТекущиеДанные.ИдентификаторСтроки;
			НоваяСтрока.ИдентификаторСтроки       = ВыборкаУпаковки.ИдентификаторСтроки;
			НоваяСтрока.Упаковка                  = ВыборкаУпаковки.Упаковка;
			НоваяСтрока.КоличествоУпаковок        = ВыборкаУпаковки.КоличествоУпаковок;
			НоваяСтрока.УровеньУпаковки           = ВыборкаУпаковки.УровеньУпаковки;
		КонецЦикла;
		
		ВыборкаМаркировка = ВыборкаСтроки.Маркировка.Выбрать();
		Пока ВыборкаМаркировка.Следующий() Цикл
			НоваяСтрока = Объект.Маркировка.Добавить();
			НоваяСтрока.ИдентификаторСтрокиТовары = ТекущиеДанные.ИдентификаторСтроки;
			НоваяСтрока.ИдентификаторСтроки = ВыборкаМаркировка.ИдентификаторСтроки;
			НоваяСтрока.Маркировка          = ВыборкаМаркировка.Маркировка;
			НоваяСтрока.ТипМаркировки       = ВыборкаМаркировка.ТипМаркировки;
			НоваяСтрока.ИдентификаторСтроки = ВыборкаМаркировка.ИдентификаторСтроки;
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВСДВЕТИС.ДатаТТН КАК ДатаТТН,
	|	ВСДВЕТИС.НомерТТН,
	|	ВСДВЕТИС.СерияТТН,
	|	ВСДВЕТИС.НомерКонтейнера,
	|	ВСДВЕТИС.Отправитель,
	|	ВСДВЕТИС.Получатель,
	|	ВСДВЕТИС.Посредник,
	|	ВСДВЕТИС.ПредприятиеОтправитель,
	|	ВСДВЕТИС.ПредприятиеПолучатель,
	|	ВСДВЕТИС.Прицеп,
	|	ВСДВЕТИС.СерияТТН,
	|	ВСДВЕТИС.СпособХранения,
	|	ВСДВЕТИС.ТипТТН,
	|	ВСДВЕТИС.ТранспортноеСредство,
	|	ВСДВЕТИС.ПунктыПерегрузки.(
	|		НазваниеПункта,
	|		ТранспортноеСредство,
	|		Прицеп,
	|		НомерКонтейнера,
	|		Страна,
	|		Регион,
	|		СПерегрузкой,
	|		Предприятие
	|	),
	|	ВСДВЕТИС.СвязанныеДокументы.(
	|		ТипДокумента,
	|		Серия,
	|		Номер,
	|		Дата,
	|		ТипСвязи
	|	),
	|	ВСДВЕТИС.УсловияПеремещенияПродукции.(
	|		УсловиеПеремещения
	|	)
	|ИЗ
	|	Документ.ВСДВЕТИС КАК ВСДВЕТИС
	|ГДЕ
	|	ВСДВЕТИС.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущиеДанные.ВСД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	// если пустые данные по ТТН, то заполним 
	Если НЕ ЗначениеЗаполнено(Объект.ДатаТТН) И НЕ ЗначениеЗаполнено(Объект.НомерТТН) Тогда
		ЗаполнитьЗначенияСвойств(Объект, Выборка, , "ПунктыПерегрузки");
		Объект.ПунктыПерегрузки.Очистить();
		ВыборкаПунктыПерегрузки = Выборка.ПунктыПерегрузки.Выбрать();
		Пока ВыборкаПунктыПерегрузки.Следующий() Цикл
			НоваяСтрока = Объект.ПунктыПерегрузки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПунктыПерегрузки);
		КонецЦикла;
		
		СвязанныеДокументы          = Выборка.СвязанныеДокументы.Выгрузить();
		УсловияПеремещенияПродукции = Выборка.УсловияПеремещенияПродукции.Выгрузить();
		
		Документы.ГашениеВходящихВСДВЕТИС.ОбновитьВозвратНажатие(Объект, УсловияПеремещенияПродукции, СвязанныеДокументы);
		
	Иначе
		
		Если (НЕ Объект.ДатаТТН = Выборка.ДатаТТН) ИЛИ 
		(НЕ Объект.НомерТТН = Выборка.НомерТТН) ИЛИ 
		(НЕ Объект.СерияТТН = Выборка.СерияТТН) ИЛИ 
		(НЕ Объект.НомерКонтейнера = Выборка.НомерКонтейнера) ИЛИ 
		(НЕ Объект.Отправитель = Выборка.Отправитель) ИЛИ 
		(НЕ Объект.Получатель = Выборка.Получатель) ИЛИ 
		(НЕ Объект.Посредник = Выборка.Посредник) ИЛИ 
		(НЕ Объект.ПредприятиеОтправитель = Выборка.ПредприятиеОтправитель) ИЛИ 
		(НЕ Объект.ПредприятиеПолучатель = Выборка.ПредприятиеПолучатель) ИЛИ 
		(НЕ Объект.Прицеп = Выборка.Прицеп) ИЛИ 
		(НЕ Объект.СерияТТН = Выборка.СерияТТН) ИЛИ 
		(НЕ Объект.СпособХранения = Выборка.СпособХранения) ИЛИ 
		(НЕ Объект.ТипТТН = Выборка.ТипТТН) ИЛИ 
		(НЕ Объект.ТранспортноеСредство = Выборка.ТранспортноеСредство) Тогда
		//Если ФормаДокумента = Неопределено ИЛИ Вопрос("Транспортные данные выбранного ВСД отличаются от данных документа.
		//	|Заменить транспортные данные в документе?", РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
				ЗаполнитьЗначенияСвойств(Объект, Выборка, , "ПунктыПерегрузки");
				Объект.ПунктыПерегрузки.Очистить();
				ВыборкаПунктыПерегрузки = Выборка.ПунктыПерегрузки.Выбрать();
				Пока ВыборкаПунктыПерегрузки.Следующий() Цикл
					НоваяСтрока = Объект.ПунктыПерегрузки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПунктыПерегрузки);
				КонецЦикла;
				
				СвязанныеДокументы          = Выборка.СвязанныеДокументы.Выгрузить();
				УсловияПеремещенияПродукции = Выборка.УсловияПеремещенияПродукции.Выгрузить();
				
				Документы.ГашениеВходящихВСДВЕТИС.ОбновитьВозвратНажатие(Объект, УсловияПеремещенияПродукции, СвязанныеДокументы);
				
			КонецЕсли;
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Отправитель");
	ОбязательныеРеквизиты.Добавить("ПредприятиеОтправитель");
	ОбязательныеРеквизиты.Добавить("ХозяйствующийСубъект");
	ОбязательныеРеквизиты.Добавить("Получатель");
	ОбязательныеРеквизиты.Добавить("ПредприятиеПолучатель");
	ОбязательныеРеквизиты.Добавить("ТипТТН");
	ОбязательныеРеквизиты.Добавить("ТранспортноеСредство");
	ОбязательныеРеквизиты.Добавить("СпособХранения");
	//ОбязательныеРеквизиты.Добавить("Товары.Количество");
	ОбязательныеРеквизиты.Добавить("Товары.ВСД");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Уникальные поля таблицы
	УникальныеТабличныеЧасти=Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеТабличныеЧасти;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Параметры проверки полей таблицы товаров
	КонтролируемыеРеквизитыТовары = Новый Структура();
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПараметрыДействия=Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Контрагент".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КонтрагентПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
КонецПроцедуры // КонтрагентПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "Товары"


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВопросДаНет(ПараметрыКоманды,"Вопрос",НСтр("ru = 'Несопоставленные строки из таблицы будут удалены. Продолжить?'"),Истина);
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ОчиститьНеСопоставленныеТовары", "ОчиститьНеСопоставленные", "Товары", НСтр("ru = 'Очистить не сопоставленные'"), ПараметрыКоманды,,,,Ложь);
		
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()

// Обработчик заполнения документа по заказам контрагенту
//
Функция ОчиститьНеСопоставленные(Объект, ПараметрыЗаполнения, ПараметрыДействия=Неопределено) Экспорт
	
	МассивДляУдаления = Новый Массив;
	Для Каждого ТекущаяСтрока Из Объект[ПараметрыЗаполнения.ИмяТабличнойЧасти] Цикл
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ВСД) Тогда
			МассивДляУдаления.Добавить(ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из МассивДляУдаления Цикл
		Объект[ПараметрыЗаполнения.ИмяТабличнойЧасти].Удалить(ТекущаяСтрока);
	КонецЦикла;
	
КонецФункции // ОчиститьНеСопоставленные()


#КонецЕсли