// Модуль документа "Гашение входящих ВСД ВетИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит заполнение объекта на основании документа "Поступление Товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Общая(Запрос)
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПоступлениеТоваровТовары.Номенклатура.ТипНоменклатуры.ОсобенностьУчета КАК ОсобенностьУчетаПоТипу,
	|	ПоступлениеТоваровТовары.Номенклатура.ОсобенностьУчета КАК ОсобенностьУчета,
	|	ПоступлениеТоваровТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ПоступлениеТоваровТовары.Номенклатура.Родитель КАК Родитель,
	|	ПоступлениеТоваровТовары.Номенклатура,
	|	СУММА(ВЫБОР
	|		КОГДА ПоступлениеТоваровТовары.КоличествоБазовое = 0 ТОГДА
	|			ПоступлениеТоваровТовары.Количество*ПоступлениеТоваровТовары.Коэффициент
	|		ИНАЧЕ
	|			ПоступлениеТоваровТовары.КоличествоБазовое
	|	КОНЕЦ) КАК Количество,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто ЕСТЬ NULL ТОГДА
	|			1
	|		КОГДА НЕ ПоступлениеТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто = 0 ТОГДА
	|			ПоступлениеТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто
	|		КОГДА НЕ ПоступлениеТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес = 0 ТОГДА
	|			ПоступлениеТоваровТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ КАК КоэффициентВеса
	|ПОМЕСТИТЬ
	|	ТабНоменклатура
	|ИЗ
	|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	|ГДЕ
	|	ПоступлениеТоваровТовары.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровТовары.Номенклатура
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабНоменклатура.Родитель КАК Номенклатура
	|ПОМЕСТИТЬ
	|	ГруппыТоваров
	|ИЗ
	|	ТабНоменклатура КАК ТабНоменклатура
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГруппыТоваров.Номенклатура.ОсобенностьУчета КАК ОсобенностьУчета,
	|	ГруппыТоваров.Номенклатура КАК Номенклатура,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ
	|	ТаблицаИерархии
	|ИЗ
	|	ГруппыТоваров КАК ГруппыТоваров
	|ГДЕ
	|	ГруппыТоваров.Номенклатура.ПометкаУдаления = Ложь И 
	|	(НЕ ГруппыТоваров.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Справочник.ОсобенностиУчетаНоменклатуры.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктураИерархииНоменклатуры.Группа.ОсобенностьУчета КАК ОсобенностьУчета,
	|	ГруппыТоваров.Номенклатура КАК Номенклатура,
	|	СтруктураИерархииНоменклатуры.Порядок КАК Приоритет
	|ИЗ
	|	ГруппыТоваров КАК ГруппыТоваров
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтруктураИерархииНоменклатуры КАК СтруктураИерархииНоменклатуры
	|ПО
	|	ГруппыТоваров.Номенклатура = СтруктураИерархииНоменклатуры.Номенклатура
	|ГДЕ
	|	(НЕ СтруктураИерархииНоменклатуры.Группа.ОсобенностьУчета = ЗНАЧЕНИЕ(Справочник.ОсобенностиУчетаНоменклатуры.ПустаяСсылка))
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаИерархии.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(ТаблицаИерархии.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ
	|	ТаблицаИерархииСрез
	|ИЗ
	|	ТаблицаИерархии КАК ТаблицаИерархии
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИерархии.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаИерархииСрез.Номенклатура КАК Номенклатура,
	|	ТаблицаИерархии.ОсобенностьУчета КАК ОсобенностьУчета
	|ПОМЕСТИТЬ
	|	ОсобенностиУчетаПоГруппам
	|ИЗ
	|	ТаблицаИерархииСрез КАК ТаблицаИерархииСрез
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаИерархии КАК ТаблицаИерархии
	|ПО
	|	ТаблицаИерархии.Номенклатура = ТаблицаИерархииСрез.Номенклатура И 
	|	ТаблицаИерархии.Приоритет = ТаблицаИерархииСрез.Приоритет
	|;
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровТовары.Количество КАК Количество,
	|	ПоступлениеТоваровТовары.Вес КАК Вес,
	|	ПоступлениеТоваровТовары.КоэффициентВеса КАК КоэффициентВеса
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТабНоменклатура.Номенклатура КАК Номенклатура,
	|		ТабНоменклатура.Количество КАК Количество,
	|		ТабНоменклатура.Количество*ТабНоменклатура.КоэффициентВеса КАК Вес,
	|		ТабНоменклатура.КоэффициентВеса КАК КоэффициентВеса,
	|		ВЫБОР
	|			КОГДА НЕ ТабНоменклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Справочник.ОсобенностиУчетаНоменклатуры.ПустаяСсылка) ТОГДА
	|				ТабНоменклатура.ОсобенностьУчета
	|			КОГДА (НЕ ОсобенностиУчетаПоГруппам.ОсобенностьУчета ЕСТЬ NULL) ТОГДА
	|				ОсобенностиУчетаПоГруппам.ОсобенностьУчета
	|			ИНАЧЕ
	|				ТабНоменклатура.ОсобенностьУчетаПоТипу
	|		КОНЕЦ КАК ОсобенностьУчета
	|	ИЗ
	|		ТабНоменклатура КАК ТабНоменклатура
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ОсобенностиУчетаПоГруппам КАК ОсобенностиУчетаПоГруппам
	|	ПО
	|		ТабНоменклатура.Родитель = ОсобенностиУчетаПоГруппам.Номенклатура) КАК ПоступлениеТоваровТовары
	|ГДЕ
	|	ПоступлениеТоваровТовары.ОсобенностьУчета В (ЗНАЧЕНИЕ(Справочник.ОсобенностиУчетаНоменклатуры.ВетИС), ЗНАЧЕНИЕ(Справочник.ОсобенностиУчетаНоменклатуры.МолочнаяПродукция))
	|";
	
	Товары.Очистить();
	Если ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровИзФилиалаВЕТИС Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПоступлениеТоваров","ПеремещениеТоваров"); 
	ИначеЕсли ХозОперация = Справочники.ХозОперации.ВозвратТоваровОтПокупателяВЕТИС Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПоступлениеТоваров","ВозвратОтПокупателя"); 
	КонецЕсли;
	
	РешенияПринятияПартии = Перечисления.РешенияПринятияПартииВЕТИС.ACCEPT_ALL;
	РезультатСоответствия = Перечисления.РезультатыСоответствияВЕТИС.CORRESPONDS;
	ЗаключениеВетеринара  = Перечисления.РезультатыСоответствияВЕТИС.UNSUPERVISED;
	
	Выборка = Запрос.Выполнить().Выбрать();
	НомерСтроки = 1;
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ИдентификаторСтроки = НомерСтроки;
		НоваяСтрока.РешениеПринятияПартии = РешенияПринятияПартии;
		НоваяСтрока.РезультатСоответствия = РезультатСоответствия;
		НоваяСтрока.ЗаключениеВетеринара  = ЗаключениеВетеринара;
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Документы.ГашениеВходящихВСДВЕТИС.ЗаполнитьВСД(ЭтотОбъект, НомерТТН, ДатаТТН);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПоступлениеТоваров()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Поступление Товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПоступлениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ХозОперация = Справочники.ХозОперации.ПоступлениеТоваровВЕТИС;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ПоступлениеТоваров.ВхТТННомер КАК ВхТТННомер,
	//|	ПоступлениеТоваров.ВхТТНДата КАК ВхТТНДата,
	|	ПоступлениеТоваров.ВхДокНомер КАК ВхДокНомер,
	|	ПоступлениеТоваров.ВхДокДата КАК ВхДокДата,
	|	ПоступлениеТоваров.Контрагент,
	|	ПоступлениеТоваров.Контрагент.ИНН КАК КонтрагентИНН,
	|	ПоступлениеТоваров.Контрагент.КПП КАК КонтрагентКПП,
	|	ПоступлениеТоваров.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ПоступлениеТоваров.Контрагент.ГоловнойКонтрагент.ИНН КАК ГоловнойКонтрагентИНН,
	|	ПоступлениеТоваров.Контрагент.ГоловнойКонтрагент.КПП КАК ГоловнойКонтрагентКПП,
	|	ПоступлениеТоваров.Грузоотправитель,
	|	ПоступлениеТоваров.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ПоступлениеТоваров.Организация,
	|	ПоступлениеТоваров.Организация.ИНН КАК ОрганизацияИНН,
	|	ПоступлениеТоваров.Организация.КПП КАК ОрганизацияКПП,
	|	ПоступлениеТоваров.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.Ссылка = &Ссылка";
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать();
	Если НЕ ВыборкаШапка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Контрагент  = ВыборкаШапка.Контрагент;
	ТипТТН      = Перечисления.ТипыДокументовВЕТИС.ТоварноТранспортнаяНакладная;
	
	//Если ЗначениеЗаполнено(ВыборкаШапка.ВхТТННомер) Тогда
	//	НомерТТН = ВыборкаШапка.ВхТТННомер;
	//	ДатаТТН  = ВыборкаШапка.ВхТТНДата;
	//Иначе
		НомерТТН = ВыборкаШапка.ВхДокНомер;
		ДатаТТН  = ВыборкаШапка.ВхДокДата;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыборкаШапка.ГоловнойКонтрагент) Тогда
		Отправитель = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьХозСубъектПоКонтрагенту(ВыборкаШапка.ГоловнойКонтрагент, ВыборкаШапка.ГоловнойКонтрагентИНН, ВыборкаШапка.ГоловнойКонтрагентКПП);
		Если ЗначениеЗаполнено(Отправитель) Тогда
			СтрокаПредприятие = Отправитель.Предприятия.Найти(ВыборкаШапка.Контрагент, "ТорговыйОбъект");
			Если НЕ СтрокаПредприятие = Неопределено И ЗначениеЗаполнено(СтрокаПредприятие.Предприятие) Тогда
				ПредприятиеОтправитель = СтрокаПредприятие.Предприятие;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отправитель) Тогда
		Отправитель = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьХозСубъектПоКонтрагенту(ВыборкаШапка.Контрагент, ВыборкаШапка.КонтрагентИНН, ВыборкаШапка.КонтрагентКПП);
		Если ЗначениеЗаполнено(Отправитель) И ЗначениеЗаполнено(ВыборкаШапка.Грузоотправитель) Тогда
			СтрокаПредприятие = Отправитель.Предприятия.Найти(ДанныеЗаполнения.Грузоотправитель, "ТорговыйОбъект");
			Если НЕ СтрокаПредприятие = Неопределено И ЗначениеЗаполнено(СтрокаПредприятие.Предприятие) Тогда
				ПредприятиеОтправитель = СтрокаПредприятие.Предприятие;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Получатель  = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьХозСубъектПоКонтрагенту(ВыборкаШапка.Организация, ВыборкаШапка.ОрганизацияИНН, ВыборкаШапка.ОрганизацияКПП);
	Если ЗначениеЗаполнено(Получатель) Тогда
		СтрокаПредприятие = Получатель.Предприятия.Найти(ВыборкаШапка.ПодразделениеКомпании, "ОсновнойОтдел");
		Если НЕ СтрокаПредприятие = Неопределено И ЗначениеЗаполнено(СтрокаПредприятие.Предприятие) Тогда
			ПредприятиеПолучатель = СтрокаПредприятие.Предприятие;
		КонецЕсли;
	КонецЕсли;
	
	ОбработкаЗаполнения_Общая(Запрос);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПоступлениеТоваров()

// Производит заполнение объекта на основании документа "ВозвратОтПокупателя"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ВозвратОтПокупателя(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ХозОперация = Справочники.ХозОперации.ВозвратТоваровОтПокупателяВЕТИС;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВозвратОтПокупателя.Контрагент,
	|	ВозвратОтПокупателя.Контрагент.ИНН КАК КонтрагентИНН,
	|	ВозвратОтПокупателя.Контрагент.КПП КАК КонтрагентКПП,
	|	ВозвратОтПокупателя.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ВозвратОтПокупателя.Контрагент.ГоловнойКонтрагент.ИНН КАК ГоловнойКонтрагентИНН,
	|	ВозвратОтПокупателя.Контрагент.ГоловнойКонтрагент.КПП КАК ГоловнойКонтрагентКПП,
	|	ВозвратОтПокупателя.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ВозвратОтПокупателя.Организация,
	|	ВозвратОтПокупателя.Организация.ИНН КАК ОрганизацияИНН,
	|	ВозвратОтПокупателя.Организация.КПП КАК ОрганизацияКПП,
	|	ВозвратОтПокупателя.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.ВозвратОтПокупателя КАК ВозвратОтПокупателя
	|ГДЕ
	|	ВозвратОтПокупателя.Ссылка = &Ссылка";
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать();
	Если НЕ ВыборкаШапка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Контрагент  = ВыборкаШапка.Контрагент;
	ТипТТН      = Перечисления.ТипыДокументовВЕТИС.ТоварноТранспортнаяНакладная;
	//НомерТТН    = ВыборкаШапка.НомерТТН;
	//ДатаТТН     = ВыборкаШапка.ДатаТТН;
	
	Если ЗначениеЗаполнено(ВыборкаШапка.ГоловнойКонтрагент) Тогда
		Отправитель = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьХозСубъектПоКонтрагенту(ВыборкаШапка.ГоловнойКонтрагент, ВыборкаШапка.ГоловнойКонтрагентИНН, ВыборкаШапка.ГоловнойКонтрагентКПП);
		Если ЗначениеЗаполнено(Отправитель) Тогда
			СтрокаПредприятие = Отправитель.Предприятия.Найти(ВыборкаШапка.Контрагент, "ТорговыйОбъект");
			Если НЕ СтрокаПредприятие = Неопределено И ЗначениеЗаполнено(СтрокаПредприятие.Предприятие) Тогда
				ПредприятиеОтправитель = СтрокаПредприятие.Предприятие;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отправитель) Тогда
		Отправитель = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьХозСубъектПоКонтрагенту(ВыборкаШапка.Контрагент, ВыборкаШапка.КонтрагентИНН, ВыборкаШапка.КонтрагентКПП);
	КонецЕсли;
	
	Получатель  = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьХозСубъектПоКонтрагенту(ВыборкаШапка.Организация, ВыборкаШапка.ОрганизацияИНН, ВыборкаШапка.ОрганизацияКПП);
	Если ЗначениеЗаполнено(Получатель) Тогда
		СтрокаПредприятие = Получатель.Предприятия.Найти(ВыборкаШапка.ПодразделениеКомпании, "ОсновнойОтдел");
		Если НЕ СтрокаПредприятие = Неопределено И ЗначениеЗаполнено(СтрокаПредприятие.Предприятие) Тогда
			ПредприятиеПолучатель = СтрокаПредприятие.Предприятие;
		КонецЕсли;
	КонецЕсли;
	
	ОбработкаЗаполнения_Общая(Запрос);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ВозвратОтПокупателя()

// Производит заполнение объекта на основании документа "ПеремещениеТоваров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПеремещениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровИзФилиалаВЕТИС;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПеремещениеТоваров.СкладКомпании.Организация КАК ОрганизацияОтправитель,
	|	ПеремещениеТоваров.СкладКомпании.Организация.ИНН КАК ОрганизацияОтправительИНН,
	|	ПеремещениеТоваров.СкладКомпании.Организация.КПП КАК ОрганизацияОтправительКПП,
	|	ПеремещениеТоваров.СкладКомпании КАК ПодразделениеОтправитель,
	|	ПеремещениеТоваров.Организация,
	|	ПеремещениеТоваров.Организация.ИНН КАК ОрганизацияИНН,
	|	ПеремещениеТоваров.Организация.КПП КАК ОрганизацияКПП,
	|	ПеремещениеТоваров.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ПеремещениеТоваров.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка = &Ссылка";
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать();
	Если НЕ ВыборкаШапка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипТТН = Перечисления.ТипыДокументовВЕТИС.ТоварноТранспортнаяНакладная;
	
	Отправитель = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьХозСубъектПоКонтрагенту(ВыборкаШапка.ОрганизацияОтправитель, ВыборкаШапка.ОрганизацияОтправительИНН, ВыборкаШапка.ОрганизацияОтправительКПП);
	Если ЗначениеЗаполнено(Отправитель) Тогда
		СтрокаПредприятие = Отправитель.Предприятия.Найти(ВыборкаШапка.ПодразделениеОтправитель, "ОсновнойОтдел");
		Если НЕ СтрокаПредприятие = Неопределено И ЗначениеЗаполнено(СтрокаПредприятие.Предприятие) Тогда
			ПредприятиеОтправитель = СтрокаПредприятие.Предприятие;
		КонецЕсли;
	КонецЕсли;
	
	Получатель = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьХозСубъектПоКонтрагенту(ВыборкаШапка.Организация, ВыборкаШапка.ОрганизацияИНН, ВыборкаШапка.ОрганизацияКПП);
	Если ЗначениеЗаполнено(Получатель) Тогда
		СтрокаПредприятие = Получатель.Предприятия.Найти(ВыборкаШапка.ПодразделениеКомпании, "ОсновнойОтдел");
		Если НЕ СтрокаПредприятие = Неопределено И ЗначениеЗаполнено(СтрокаПредприятие.Предприятие) Тогда
			ПредприятиеПолучатель = СтрокаПредприятие.Предприятие;
		КонецЕсли;
	КонецЕсли;
	
	ОбработкаЗаполнения_Общая(Запрос);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПеремещениеТоваров()



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА)

	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "ВхДокНомер,ВхДокДатаВрем") Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГашениеВходящихВСДВЕТИС", Товары.Выгрузить(,"НомерСтроки, СрокГодности, ЕдиницаИзмерения, ВСД"));
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ГашениеВходящихВСДВЕТИС.НомерСтроки КАК НомерСтроки,
	|	ГашениеВходящихВСДВЕТИС.СрокГодности КАК СрокГодности,
	|	ГашениеВходящихВСДВЕТИС.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫРАЗИТЬ(ГашениеВходящихВСДВЕТИС.ВСД КАК Документ.ВСДВЕТИС) КАК ВСД
	|ПОМЕСТИТЬ
	|	ГашениеВходящихВСДВЕТИС
	|ИЗ
	|	&ГашениеВходящихВСДВЕТИС КАК ГашениеВходящихВСДВЕТИС
	|ГДЕ
	|	ГашениеВходящихВСДВЕТИС.СрокГодности = ДатаВремя(1,1,1) ИЛИ
	|	ГашениеВходящихВСДВЕТИС.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмеренияВЕТИС.ПустаяСсылка)
	|;
	|
	|ВЫБРАТЬ
	|	ГашениеВходящихВСДВЕТИС.НомерСтроки КАК НомерСтроки,
	|	ГашениеВходящихВСДВЕТИС.ВСД.СрокГодности КАК СрокГодности
	|ИЗ
	|	ГашениеВходящихВСДВЕТИС КАК ГашениеВходящихВСДВЕТИС
	|ГДЕ
	|	ГашениеВходящихВСДВЕТИС.СрокГодности = ДатаВремя(1,1,1)
	|;
	|
	|ВЫБРАТЬ
	|	ГашениеВходящихВСДВЕТИС.НомерСтроки КАК НомерСтроки,
	|	ГашениеВходящихВСДВЕТИС.ВСД.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	ГашениеВходящихВСДВЕТИС КАК ГашениеВходящихВСДВЕТИС
	|ГДЕ
	|	ГашениеВходящихВСДВЕТИС.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмеренияВЕТИС.ПустаяСсылка)
	|";
	
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаСрокГодности     = ПакетыЗапросов[ПакетыЗапросов.Количество()-2].Выбрать();
	ВыборкаЕдиницаИзмерения = ПакетыЗапросов[ПакетыЗапросов.Количество()-1].Выбрать();
	
	Пока ВыборкаСрокГодности.Следующий() Цикл
		Товары[ВыборкаСрокГодности.НомерСтроки-1].СрокГодности = ВыборкаСрокГодности.СрокГодности;
	КонецЦикла;
	
	Пока ВыборкаЕдиницаИзмерения.Следующий() Цикл
		Товары[ВыборкаЕдиницаИзмерения.НомерСтроки-1].ЕдиницаИзмерения = ВыборкаЕдиницаИзмерения.ЕдиницаИзмерения;
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли
