// Модуль формы списка справочника "Номенклатура"

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура отображения выбранной страницы дерева
//
&НаСервере
Процедура ИзменитьРежимЛевойПанелиНаСервере(РежимОтображения)
	
	Если РежимОтображения = "РежимЛевойПанелиДерево" Тогда
		Элементы.Дерево.   Видимость = ИСТИНА;
		Элементы.Параметры.Видимость = ЛОЖЬ;
	ИначеЕсли РежимОтображения = "РежимЛевойПанелиПараметры" Тогда
		Элементы.Дерево.   Видимость = ЛОЖЬ;
		Элементы.Параметры.Видимость = ИСТИНА;
	Иначе
		Элементы.Дерево.   Видимость = ЛОЖЬ;
		Элементы.Параметры.Видимость = ЛОЖЬ;
	КонецЕсли;
	
	Элементы.РежимЛевойПанелиДерево.   Пометка = (Элементы.Дерево.   Видимость);
	Элементы.РежимЛевойПанелиПараметры.Пометка = (Элементы.Параметры.Видимость);
	Элементы.РежимЛевойПанелиОтключить.Пометка = НЕ(Элементы.Дерево.Видимость ИЛИ Элементы.Параметры.Видимость);
	
	// Взведем признак необходимости выполнить сохранение настроек формы при закрытии
	ЭтотОбъект.СохраняемыеВНастройкахДанныеМодифицированы = ИСТИНА;
	
КонецПроцедуры // ИзменитьРежимЛевойПанелиНаСервере()

&НаСервере
Процедура УстановитьВидимостьКорзины(ПоказатьКорзину)
		
	// Произведем настройку параметров отображения полей корзины и расширенной информации.
	Элементы.СтраницаКорзина.Видимость = ПоказатьКорзину;
	Элементы.ПодменюКорзина. Видимость = ПоказатьКорзину;
	Элементы.КорзинаВключить.Видимость = НЕ ПоказатьКорзину;
	Элементы.ПоказатьРасширеннуюИнформацию.Доступность = НЕ ПоказатьКорзину;
	
	Если ПоказатьКорзину Тогда
		
		// Произведем настройку параметров отображения полей расширенной информации
		Если НЕ Элементы.СтраницыРасширеннаяИнформация.Видимость Тогда
			Элементы.СтраницыРасширеннаяИнформация.Видимость = Истина;
			Элементы.ПоказатьРасширеннуюИнформацию.Пометка   = Истина;
		КонецЕсли;
		
		// При включении, произведем обнуление корзины
		Корзина.Очистить();
		РассчитатьПодвалКорзины();
		
		// Сделаем страницу корзины текущей
		Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница = Элементы.СтраницаКорзина;
		
	Иначе
		Если Элементы.СтраницыСписки.ТекущаяСтраница = Элементы.СтраницаХарактеристики Тогда
			Элементы.СтраницыСписки.ТекущаяСтраница = Элементы.СтраницаСписок;
		КонецЕсли;
	КонецЕсли;
	
	// Произведем перезаливку возможных вариантов отображения колонки остатков
	РежимыВыводаОстатков = Элементы.ПараметрыРежимВыводаОстатков.СписокВыбора;
	РежимыВыводаОстатков.Очистить();
	
	Если ПоказатьКорзину Тогда
		РежимыВыводаОстатков.Добавить(0, НСтр("ru = 'Не отображать'"));
		РежимыВыводаОстатков.Добавить(1, НСтр("ru = 'В списке'"));
		РежимыВыводаОстатков.Добавить(2, НСтр("ru = 'В корзине'"));
		РежимыВыводаОстатков.Добавить(3, НСтр("ru = 'В корзине и списке'"));
	Иначе
		
		Если ПараметрыРежимВыводаОстатков = 2 Тогда
			ПараметрыРежимВыводаОстатков = 0;
			УстановитьПараметрыВыводаКолонкиОстатокНаСкладе();
			
		ИначеЕсли ПараметрыРежимВыводаОстатков = 3 Тогда
			ПараметрыРежимВыводаОстатков = 1;
			УстановитьПараметрыВыводаКолонкиОстатокНаСкладе();
		КонецЕсли;
		
		РежимыВыводаОстатков.Добавить(0, НСтр("ru = 'Не отображать'"));
		РежимыВыводаОстатков.Добавить(1, НСтр("ru = 'В списке'"));
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьКорзины()

&НаСервере
Функция ПодготовитьСписокПодобранныхТоваров()
	
	ПараметрыПодбора = ПолучитьИзВременногоХранилища(ЭтотОбъект.АдресПараметрыПодбора);
	
	Если НЕ ТипЗнч(ПараметрыПодбора)=Тип("Структура") Тогда
		ПараметрыПодбора = Новый Структура();
	КонецЕсли;
	
	//ТекстКолонок = "Номенклатура,ХарактеристикаНоменклатуры,Количество,ЕдиницаИзмерения,Коэффициент";
	ТекстКолонок = "Номенклатура,ХарактеристикаНоменклатуры,Количество,ЕдиницаИзмерения,Коэффициент, Цена";
	Если Элементы.КорзинаСкладКомпании.Видимость Тогда
		ТекстКолонок = ТекстКолонок + ", СкладКомпании";
	КонецЕсли;
	
	Если Элементы.КорзинаЯчейка.Видимость Тогда
		ТекстКолонок = ТекстКолонок + ", Ячейка";
	КонецЕсли;
	
	Если Элементы.КорзинаПримечаниеНоменклатураПечать.Видимость Тогда
		ТекстКолонок = ТекстКолонок + ", ПримечаниеНоменклатураПечать";
	КонецЕсли;
	
	Если Элементы.КорзинаПримечаниеНоменклатура.Видимость Тогда
		ТекстКолонок = ТекстКолонок + ", ПримечаниеНоменклатура";
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("Корзина", ПоместитьВоВременноеХранилище(Корзина.Выгрузить(,ТекстКолонок), ЭтотОбъект.УникальныйИдентификатор));
	
	Возврат ПараметрыПодбора;
	
КонецФункции // ПодготовитьСписокПодобранныхТоваров()

// Процедура расчета подвала корзины
//
&НаСервере
Процедура РассчитатьПодвалКорзины()
	
	КорзинаКоличествоСтрок = Корзина.Количество();
	КорзинаИтогКоличество  = Корзина.Итог("Количество");
	КорзинаИтогСумма       = Корзина.Итог("Сумма");
	
КонецПроцедуры

// Начинает добавление в корзину выбранной номенклатуры
//
// Параметры:
//  Номенклатура - СправочникСсылка - Ссылка на выбранную номенклатуру.
//
&НаКлиенте
Процедура ОбработкаПодбораТовараВКорзину(Номенклатура, Характеристика=Неопределено, ТекущаяСтрока=Неопределено) 
	ЗапрашиватьКоличествоВПодборе = ПараметрыЗапрашиватьКоличество;
	ЗапрашиватьЦенуВПодборе = ПараметрыЗапрашиватьЦену;
	ЦенаПользователя = 0;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Номенклатура", Номенклатура);
	ДополнительныеПараметры.Вставить("Характеристика", Характеристика);
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
	
	Если ЗапрашиватьКоличествоВПодборе Тогда 
		ОповещениеВводаКоличества = Новый ОписаниеОповещения("ОбработкаПодбораТовараВКорзинуЗапросКоличестваПродолжение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВводЧисла(ОповещениеВводаКоличества, 1, НСтр("ru = 'Введите количество'"), 12, 3);
	Иначе
		Если ЗапрашиватьЦенуВПодборе Тогда
			 ЗапроситьЦену(ЭтотОбъект, ДополнительныеПараметры);
		Иначе	
			ОбработкаПодбораТовараВКорзинуЗавершение(Номенклатура, Характеристика, ТекущаяСтрока, ДополнительныеПараметры); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  // ОбработкаПодбораТовараВКорзину

&НаКлиенте
Процедура ЗапроситьЦену(Объект, ДополнительныеПараметры)
	
	ЦенаРасчетная = ПолучитьРасчетнуюЦенуНасервере(ДополнительныеПараметры);
	
	ОповещениеВводаЦены = Новый ОписаниеОповещения("ОбработкаПодбораТовараВКорзинуЗапросЦеныПродолжение", Объект, ДополнительныеПараметры);
	ПоказатьВводЧисла(ОповещениеВводаЦены, ЦенаРасчетная, НСтр("ru = 'Введите цену'"), 12, 2);
	
КонецПроцедуры	// ЗапроситьЦену		

&НаСервере
Функция ПолучитьРасчетнуюЦенуНасервере(ДополнительныеПараметры)
	
	Возврат ЦенообразованиеСервер.ПолучитьЦену(ПараметрыТипЦен, ДополнительныеПараметры.Номенклатура, ТекущаяДатаСеанса(), ПараметрыКонтрагент, ПараметрыВалюта, ПараметрыКурсВалюты, ДополнительныеПараметры.Характеристика, ДополнительныеПараметры.Номенклатура.ОсновнаяЕдиницаИзмерения, ПараметрыПодразделениеКомпании);
	
КонецФункции  // ПолучитьРасчетнуюЦенуНасервере

// Разбирает результат ввода количества
//
//
&НаКлиенте
Процедура ОбработкаПодбораТовараВКорзинуЗапросКоличестваПродолжение(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	Номенклатура   = ДополнительныеПараметры.Номенклатура;
	Характеристика = ДополнительныеПараметры.Характеристика;
	ТекущаяСтрока  = ДополнительныеПараметры.ТекущаяСтрока;
	
	Если РезультатОповещения = Неопределено Тогда // нажата Отмена
		Возврат;
	ИначеЕсли РезультатОповещения <= 0 Тогда 	// попросим ввести ещё раз
		ОбработкаПодбораТовараВКорзину(Номенклатура, Характеристика, ТекущаяСтрока);
	Иначе	// обработаем ввод количества
		Если ПараметрыЗапрашиватьЦену Тогда
			ДополнительныеПараметры.Вставить("КоличествоПользователя", РезультатОповещения);
			ЗапроситьЦену(ЭтотОбъект, ДополнительныеПараметры);
		Иначе
			ОбработкаПодбораТовараВКорзинуЗавершение(Номенклатура, Характеристика, ТекущаяСтрока, ДополнительныеПараметры); 
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры  // ОбработкаПодбораТовараВКорзинуЗапросКоличестваПродолжение

// Разбирает результат ввода цены
//
//
&НаКлиенте
Процедура ОбработкаПодбораТовараВКорзинуЗапросЦеныПродолжение(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	Номенклатура   = ДополнительныеПараметры.Номенклатура;
	Характеристика = ДополнительныеПараметры.Характеристика;
	ТекущаяСтрока  = ДополнительныеПараметры.ТекущаяСтрока;
	
	Если РезультатОповещения = Неопределено Тогда // нажата Отмена
		Возврат;
	ИначеЕсли РезультатОповещения <= 0 Тогда 	// попросим ввести ещё раз
		ЗапроситьЦену(ЭтотОбъект, ДополнительныеПараметры);
	Иначе	// обработаем ввод Цены
		ЦенаПользователя = РезультатОповещения;
		ОбработкаПодбораТовараВКорзинуЗавершение(Номенклатура, Характеристика, ТекущаяСтрока, ДополнительныеПараметры); 
	КонецЕсли;	
	
КонецПроцедуры  // ОбработкаПодбораТовараВКорзинуЗапросЦеныПродолжение


// Добавляет в корзину выбранную номенклатуру, и заполняет в соответствии с выбранной номенклатурой оставшиеся колонки.
//
//
&НаСервере
Процедура ОбработкаПодбораТовараВКорзинуЗавершение(Номенклатура, Характеристика=Неопределено, ТекущаяСтрока=Неопределено, ДополнительныеПараметры) 
	
	КоличествоПользователя = Неопределено;
	НовоеКоличество = 1;
	Если ДополнительныеПараметры.Свойство("КоличествоПользователя", КоличествоПользователя) Тогда
		 НовоеКоличество = КоличествоПользователя;
	КонецЕсли;	 
	
	// поищем в корзине уже имеющийся такой товар
	МассивСтрок = Корзина.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения", Номенклатура, ?(Характеристика = Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), Характеристика), Номенклатура.ОсновнаяЕдиницаИзмерения));
	
	Если МассивСтрок.Количество() = 0 Тогда
		
		НоваяСтрока = Корзина.Добавить();
		НоваяСтрока.Номенклатура               = Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = Характеристика;
		//laza НоваяСтрока.Количество                 = 1;
		НоваяСтрока.Количество                 = НовоеКоличество; //laza 
		НоваяСтрока.ЕдиницаИзмерения           = Номенклатура.ОсновнаяЕдиницаИзмерения;
		НоваяСтрока.Коэффициент                = Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент;
		
		КорзинаНоменклатураПриИзмененииНаСервере(НоваяСтрока);
		
	Иначе
		
		НоваяСтрока = МассивСтрок[0];
		//laza НоваяСтрока.Количество = НоваяСтрока.Количество + 1;
		НоваяСтрока.Количество = НоваяСтрока.Количество + НовоеКоличество;//laza
		КорзинаКоличествоПриИзмененииНаСервере(НоваяСтрока);
		КорзинаНоменклатураПриИзмененииНаСервере(НоваяСтрока);
		
	КонецЕсли;
	
	РассчитатьПодвалКорзины();
	
	ТекущаяСтрока = Корзина.Индекс(НоваяСтрока);
	
	ЦенаПользователя = 0;
	
КонецПроцедуры // ОбработкаПодбораТовараВКорзинуЗавершение()

&НаСервере
Процедура УстановитьРежимВыбораХарактеристик(ВыборХарактеристик, ТекущаяСтрока, ТекущийРодитель=Неопределено)
	
	Элементы.СтраницыСписки.ТекущаяСтраница = ?(ВыборХарактеристик, Элементы.СтраницаХарактеристики, Элементы.СтраницаСписок);
	
	Если ВыборХарактеристик Тогда
		
		ЭтотОбъект.ВыбраннаяНоменклатура = ТекущаяСтрока;
		
		Элементы.ХарактеристикиНаименование.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Характеристики номенклатуры (%1)'"), ЭтотОбъект.ВыбраннаяНоменклатура);
		
		ОбновитьСписокХарактеристик();
		
		ЭтотОбъект.ТекущийЭлемент = Элементы.Характеристики;
		
	Иначе
		
		ТекущаяСтрока   = ЭтотОбъект.ВыбраннаяНоменклатура;
		ТекущийРодитель = ЭтотОбъект.ВыбраннаяНоменклатура.Родитель;
		
		ЭтотОбъект.ВыбраннаяНоменклатура = Неопределено;
		
		ЭтотОбъект.ТекущийЭлемент = Элементы.Список;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьРежимВыбораХарактеристик()

&НаСервере
Процедура ОбновитьСписокХарактеристик()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Номенклатура,
	|	&Владелец КАК ВладелецХарактеристики,
	|	ВложенныйЗапрос.Наименование,
	|	ВложенныйЗапрос.Остаток,
	|	ВложенныйЗапрос.ИндексКартинки,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	(ВЫБРАТЬ
	|		&Номенклатура КАК Номенклатура,
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
	|		&ВернутьсяКСпискуНоменклатуры КАК Наименование,
	|		0 КАК Остаток,
	|		3 КАК ИндексКартинки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ 
	|		&Номенклатура,
	|		ХарактеристикиНоменклатуры.Ссылка,
	|		ХарактеристикиНоменклатуры.Наименование,
	|		ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.РезервОстаток, 0),
	|		ВЫБОР
	|			КОГДА ХарактеристикиНоменклатуры.ПометкаУдаления
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|					,
	|					Номенклатура = &Номенклатура
	|						И СкладКомпании В (&СписокСкладов)) КАК ОстаткиТоваровКомпанииОстатки
	|			ПО ХарактеристикиНоменклатуры.Ссылка = ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры
	|	ГДЕ
	|		ХарактеристикиНоменклатуры.Владелец = &Владелец
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&Номенклатура,
	|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|		&ПропуститьВыборХарактеристики,
	|		0,
	|		3) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ХарактеристикаНоменклатуры";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Номенклатура",  ЭтотОбъект.ВыбраннаяНоменклатура);
	Запрос.УстановитьПараметр("СписокСкладов", ПараметрыСписокСкладов);
	Запрос.УстановитьПараметр("ВернутьсяКСпискуНоменклатуры", НСтр("ru = '<Вернуться к списку номенклатуры>'"));
	Запрос.УстановитьПараметр("ПропуститьВыборХарактеристики", НСтр("ru = '<Пропустить ВЫБОР характеристики>'"));
	
	Если ЭтотОбъект.ВыбраннаяНоменклатура.ТипНоменклатуры.ИспользованиеХарактеристик = 1 Тогда
		ВладелецХарактеристики = ЭтотОбъект.ВыбраннаяНоменклатура.ТипНоменклатуры;
	Иначе
		ВладелецХарактеристики = ЭтотОбъект.ВыбраннаяНоменклатура;
	КонецЕсли;
	Запрос.УстановитьПараметр("Владелец", ВладелецХарактеристики);
	
	Характеристики.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ОбновитьСписокХарактеристик()

&НаСервере
Процедура УстановитьПараметрыВыводаКолонкиОстатокНаСкладе()
	
	Элементы.Остаток.              Видимость = (ПараметрыРежимВыводаОстатков = 1 ИЛИ ПараметрыРежимВыводаОстатков = 3);
	Элементы.ХарактеристикиОстаток.Видимость = (ПараметрыРежимВыводаОстатков = 1 ИЛИ ПараметрыРежимВыводаОстатков = 3);
	Элементы.КорзинаОстаток.       Видимость = (ПараметрыРежимВыводаОстатков = 2 ИЛИ ПараметрыРежимВыводаОстатков = 3);
	
	// Обновим перечень складов по которым необходимо получить остаток
	Если ЗначениеЗаполнено(ПараметрыСкладКомпании) Тогда
		
		ПараметрыСписокСкладов.Очистить();
		ПараметрыСписокСкладов.Добавить(ПараметрыСкладКомпании);
		
	Иначе
		
		// если склад не заполнен - то выбираем все склады по выбранному подразделению
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СкладыКомпании.Ссылка
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	СкладыКомпании.ПодразделениеКомпании = &ПодразделениеКомпании";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ПодразделениеКомпании", ПараметрыПодразделениеКомпании);
		ПараметрыСписокСкладов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СкладыКомпании", ПараметрыСписокСкладов);
	
	Если Элементы.СтраницыСписки.ТекущаяСтраница = Элементы.СтраницаХарактеристики
		 И Элементы.ХарактеристикиОстаток.Видимость Тогда
		ОбновитьСписокХарактеристик();
	КонецЕсли;
	
	Если Элементы.СтраницаКорзина.Видимость И Корзина.Количество() > 0 И Элементы.КорзинаОстаток.Видимость Тогда
		
		// Необходим пересчет всей корзины
		СписокНоменклатур   = Новый СписокЗначений;
		СписокНоменклатур.ЗагрузитьЗначения(Корзина.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
		
		СписокХарактеристик = Новый СписокЗначений;
		СписокХарактеристик.ЗагрузитьЗначения(Корзина.Выгрузить().ВыгрузитьКолонку("ХарактеристикаНоменклатуры"));
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("СкладыКомпании",             ПараметрыСписокСкладов);
		Запрос.УстановитьПараметр("Номенклатура",               СписокНоменклатур);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", СписокХарактеристик);
		
		Если ОстаткиПоОрдерномуСкладу Тогда
			
			СписокЯчеек = Новый СписокЗначений;
			СписокЯчеек.ЗагрузитьЗначения(Корзина.Выгрузить().ВыгрузитьКолонку("Ячейка"));
			
			Запрос.УстановитьПараметр("Ячейки", СписокЯчеек);
			
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток, 0) КАК Остаток,
			|	ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура,
			|	ОстаткиТоваровОрдерныйСкладОстатки.ХарактеристикаНоменклатуры
			|ИЗ
			|	РегистрНакопления.ОстаткиТоваровОрдерныйСклад.Остатки(
			|			,
			|			СкладКомпании В (&СкладыКомпании)
			|				И Номенклатура В (&Номенклатура)
			|				И ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры)
			|				И Ячейка В (&Ячейки)) КАК ОстаткиТоваровОрдерныйСкладОстатки";
			
		Иначе
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.РезервОстаток, 0) КАК Остаток,
			|	ОстаткиТоваровКомпанииОстатки.Номенклатура,
			|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры
			|ИЗ
			|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
			|			,
			|			СкладКомпании В (&СкладыКомпании)
			|				И Номенклатура В (&Номенклатура)
			|				И ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры)) КАК ОстаткиТоваровКомпанииОстатки";
		КонецЕсли;
		
		ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
		
		СтруктураОтбора = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры");
		
		Для Каждого СтрокаКорзины Из Корзина Цикл
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаКорзины);
			МассивСтрок = ТаблицаОстатков.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество()=0 Тогда
				СтрокаКорзины.Остаток = 0;
			Иначе
				СтрокаКорзины.Остаток = МассивСтрок[0].Остаток/?(СтрокаКорзины.Коэффициент = 0, 1, СтрокаКорзины.Коэффициент);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьПараметрыВыводаКолонкиОстатокНаСкладе()

// Производит настройку динамических списков в зависимости от текущей строки.
//
&НаСервере
Процедура ОбработатьАктивизациюСтрокиСпискаНаСервере()
	
	Если ЕстьРеквизитНаКлиенте(Элементы.Список.ТекущаяСтрока,"ЭтоГруппа")
		ИЛИ ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
		ИЛИ Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		
		Артикул = "";
	Иначе
		Артикул = Элементы.Список.ТекущаяСтрока.Артикул;
	КонецЕсли;
	
	// Устанавливаем отбор по владельцу на динамический список
	Если Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя = "СтраницаЦены" Тогда
		ПрайсЛистыКонтрагентов.Отбор.Элементы.Очистить();
		ЭлементОтбора = ПрайсЛистыКонтрагентов.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Артикул");
		ЭлементОтбора.Использование  = ИСТИНА;
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Содержит;
		ЭлементОтбора.ПравоеЗначение = Артикул;
		
		ЭлементОтбора = ПрайсЛистыКонтрагентов.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПрайсЛист.Подразделения.ПодразделениеКомпании");
		ЭлементОтбора.Использование  = ИСТИНА;
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВИерархии;
		ЭлементОтбора.ПравоеЗначение = ПодразделениеКомпанииПользователя;
		ЭлементОтбора.Использование  = НЕ ВсеПодразделения;
		
		//ОтборСтрок 						= Новый ФиксированнаяСтруктура("Подразделение", 		ПодразделениеКомпанииПользователя);
		//ОтборСтрокСогласованныеЦены 	= Новый ФиксированнаяСтруктура("ПодразделениеКомпании", ПодразделениеКомпанииПользователя);

		//Если ВсеПодразделения Тогда
		//	Элементы.Цены.ОтборСтрок 					= Неопределено;
		//	Элементы.ЦеныКонтрагентов.ОтборСтрок 		= Неопределено;
		//	Элементы.ЦеныСогласованные.ОтборСтрок 		= Неопределено;
		//	Элементы.ЦеныПоГруппамПоставки.ОтборСтрок 	= Неопределено;
		//	Элементы.ЦеныУценкаТовара.ОтборСтрок 		= Неопределено;
		//Иначе
		//	Элементы.Цены.ОтборСтрок 					= ОтборСтрок;
		//	Элементы.ЦеныКонтрагентов.ОтборСтрок 		= ОтборСтрок;
		//	Элементы.ЦеныСогласованные.ОтборСтрок 		= ОтборСтрокСогласованныеЦены;
		//	Элементы.ЦеныПоГруппамПоставки.ОтборСтрок 	= ОтборСтрокСогласованныеЦены;
		//	Элементы.ЦеныУценкаТовара.ОтборСтрок 	= ОтборСтрокСогласованныеЦены;
		//КонецЕсли;
		
	ИначеЕсли Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя = "СтраницаАналоги" Тогда
		ИдентификаторГруппыАналогов = ИдентификаторГруппыАналогов();
		Аналоги.Отбор.Элементы.Очистить();
		ЭлементОтбора = Аналоги.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИдентификаторГруппы");
		ЭлементОтбора.Использование  = ИСТИНА;
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Содержит;
		ЭлементОтбора.ПравоеЗначение = ИдентификаторГруппыАналогов;
	ИначеЕсли Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя = "СтраницаСкидки" Тогда
		
		СписокСкидки.Отбор.Элементы.Очистить();
		ПоляОтбора = СписокСкидки.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
		//ПоляОтбора = СписокСкидки.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;

		ЛевоеЗначениеОстаткиПоСкидкам = Новый ПолеКомпоновкиДанных("Подразделение");
		ОтборПоСкидкам = ПоляОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоСкидкам.ЛевоеЗначение  = ЛевоеЗначениеОстаткиПоСкидкам;
		ОтборПоСкидкам.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВИерархии;
		ОтборПоСкидкам.ПравоеЗначение = ПодразделениеКомпанииПользователя;
		ОтборПоСкидкам.Использование  = НЕ ВсеПодразделения;
		
	КонецЕсли;

	
КонецПроцедуры // ОбработатьАктивизациюСтрокиСпискаНаСервере()

// Функция возвращает идентификатор группы аналогов
&НаСервере
Функция ИдентификаторГруппыАналогов() Экспорт
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат (" ");
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ГруппыАналогов.ИдентификаторГруппы КАК ИдентификаторГруппы
	|ИЗ
	|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	|ГДЕ
	|	ГруппыАналогов.Номенклатура=&Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура",?(ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")," ", Элементы.Список.ТекущаяСтрока));
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИдентификаторГруппы;
	КонецЕсли;
	Возврат (" ");
	
КонецФункции // ИдентификаторГруппыАналогов()

// Получает и загружает цены номенклатуры.
//
&НаСервере
Процедура ЗагрузитьЦены()
	
	Если ЭтотОбъект.ТекущийЭлементСписка = Неопределено
		ИЛИ ТипЗнч(ЭтотОбъект.ТекущийЭлементСписка) = Тип("СтрокаГруппировкиДинамическогоСписка") 
		ИЛИ (ТипЗнч(ЭтотОбъект.ТекущийЭлементСписка) = Тип("СправочникСсылка.Номенклатура") И ЭтотОбъект.ТекущийЭлементСписка.ЭтоГруппа) Тогда
		
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	
	Если Элементы.СтраницыСписки.ТекущаяСтраница = Элементы.СтраницаХарактеристики И ЗначениеЗаполнено(ЭтотОбъект.ВыбраннаяНоменклатура) И (НЕ Элементы.Характеристики.ТекущаяСтрока = Неопределено) Тогда
		ДополнительныеПараметры.Вставить("ТекущаяНоменклатура",   ЭтотОбъект.ВыбраннаяНоменклатура);
		ДополнительныеПараметры.Вставить("ТекущаяХарактеристика", Характеристики.НайтиПоИдентификатору(Элементы.Характеристики.ТекущаяСтрока).ХарактеристикаНоменклатуры);
		ДополнительныеПараметры.Вставить("ЗапросТекст",           "ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры");
	ИначеЕсли (НЕ ТипЗнч(ЭтотОбъект.ТекущийЭлементСписка) = Тип("СправочникСсылка.Номенклатура")) Тогда
		Возврат;
	Иначе
		ДополнительныеПараметры.Вставить("ТекущаяНоменклатура",   ЭтотОбъект.ТекущийЭлементСписка);
		ДополнительныеПараметры.Вставить("ТекущаяХарактеристика", Неопределено);
		ДополнительныеПараметры.Вставить("ЗапросТекст",           "ИСТИНА");
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТекущаяНоменклатура = Неопределено
		ИЛИ ДополнительныеПараметры.ТекущаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ВсеПодразделения Тогда
		ДополнительныеПараметры.Вставить("ПодразделениеКомпании", ПодразделениеКомпанииПользователя);
	КонецЕсли;
	Справочники.Номенклатура.ЗагрузитьЦены(ЭтотОбъект, ДополнительныеПараметры);
	
КонецПроцедуры // ЗагрузитьЦены()

// Получает и загружает цены номенклатуры контрагентов.
//
&НаСервере
Процедура ЗагрузитьЦеныКонтрагентов()
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено
		ИЛИ ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
		ИЛИ Элементы.Список.ТекущаяСтрока.ЭтоГруппа Тогда
		
		Возврат;
	КонецЕсли;
	
	// Загрузка цен контрагентов
	ТекстЗапроса =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЦеныСрезПоследних.ТипЦен КАК ТипЦен,
	|	ЦеныСрезПоследних.Контрагент КАК Контрагент,
	|	ЦеныСрезПоследних.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА ЦеныСрезПоследних.ТипЦен.ВВалютеУчета = ИСТИНА
	|			ТОГДА ЦеныСрезПоследних.Номенклатура.ВалютаУчета
	|		ИНАЧЕ ЦеныСрезПоследних.ТипЦен.ВалютаЦены
	|	КОНЕЦ КАК ВалютаЦены,
	|	ЦеныСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЦеныСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЦеныСрезПоследних.ПодразделениеКомпании КАК Подразделение,
	|	ЦеныСрезПоследних.Цена КАК Цена,
	|	0 КАК ЦенаРегл
	|ПОМЕСТИТЬ ТаблицаЦен
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			&НаДату,
	|			Номенклатура = &Номенклатура
	|				И Контрагент <> &Контрагент
	|				И ВЫБОР
	|					КОГДА ТипЦен.АлгоритмПолученияЦены = &ПоХарактеристике
	|						ТОГДА %УсловиеПоХарактеристике%
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ"+? (НЕ ВсеПодразделения, "
	|				И ПодразделениеКомпании В ИЕРАРХИИ(&ПодразделениеКомпании)", "") +") КАК ЦеныСрезПоследних
	|ГДЕ
	|	ЦеныСрезПоследних.Цена > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТипыЦенПроцентыСкидкиНаценки.БазовыйТипЦен ЕСТЬ NULL
	|			ТОГДА ТипыЦен.БазовыйТипЦен
	|		ИНАЧЕ ТипыЦенПроцентыСкидкиНаценки.БазовыйТипЦен
	|	КОНЕЦ КАК БазовыйТипЦен,
	|	ВЫБОР
	|		КОГДА ТипыЦенПроцентыСкидкиНаценки.БазовыйТипЦен ЕСТЬ NULL
	|			ТОГДА ТипыЦен.БазовыйТипЦен.ВалютаЦены
	|		ИНАЧЕ ТипыЦенПроцентыСкидкиНаценки.БазовыйТипЦен.ВалютаЦены
	|	КОНЕЦ КАК БазоваяВалюта,
	|	ТипыЦен.ВалютаЦены КАК ВалютаЦены,
	|	ТипыЦен.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону,
	|	ТипыЦен.Точность КАК Точность,
	|	ВЫБОР
	|		КОГДА ТипыЦенПроцентыСкидкиНаценки.ПроцентСкидкиНаценки ЕСТЬ NULL
	|			ТОГДА ТипыЦен.ПроцентСкидкиНаценки
	|		ИНАЧЕ ТипыЦенПроцентыСкидкиНаценки.ПроцентСкидкиНаценки
	|	КОНЕЦ КАК ПроцентСкидкиНаценкиТаблица,
	|	ТипыЦен.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТипыЦенПоВидамНоменклатуры
	|ИЗ
	|	Справочник.ТипыЦен КАК ТипыЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыЦен.ПроцентыСкидкиНаценки КАК ТипыЦенПроцентыСкидкиНаценки
	|		ПО (ТипыЦенПроцентыСкидкиНаценки.Ссылка = ТипыЦен.Ссылка)
	|			И (ТипыЦенПроцентыСкидкиНаценки.ЦеноваяГруппа = &ЦеноваяГруппа)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЦен.Контрагент КАК Контрагент,
	|	ТаблицаЦен.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	ТаблицаЦен.ТипЦен.Наименование КАК ТипЦенНаименование,
	|	ТаблицаЦен.ВалютаЦены КАК ВалютаЦены,
	|	ТаблицаЦен.ВалютаЦены КАК БазоваяВалюта,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаЦен.Подразделение КАК Подразделение,
	|	ТаблицаЦен.Цена КАК Цена,
	|	ТаблицаЦен.ЦенаРегл КАК ЦенаРегл,
	|	NULL КАК ОкруглятьВБольшуюСторону,
	|	NULL КАК Точность,
	|	0 КАК ПолеСортировки,
	|	ТаблицаЦен.ТипЦен.Рассчитывается КАК Рассчитывается
	|ИЗ
	|	ТаблицаЦен КАК ТаблицаЦен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаЦен.Контрагент,
	|	ТаблицаЦен.ДоговорВзаиморасчетов,
	|	ТипыЦенПоВидамНоменклатуры.Ссылка,
	|	ТипыЦенПоВидамНоменклатуры.Ссылка.Наименование,
	|	ТипыЦенПоВидамНоменклатуры.ВалютаЦены,
	|	ТипыЦенПоВидамНоменклатуры.БазоваяВалюта,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры,
	|	ТаблицаЦен.ЕдиницаИзмерения,
	|	ТаблицаЦен.Подразделение,
	|	ТаблицаЦен.Цена + ТаблицаЦен.Цена * (ЕСТЬNULL(ТипыЦенПоВидамНоменклатуры.ПроцентСкидкиНаценкиТаблица, 0) / 100),
	|	ТаблицаЦен.ЦенаРегл,
	|	ТипыЦенПоВидамНоменклатуры.ОкруглятьВБольшуюСторону,
	|	ТипыЦенПоВидамНоменклатуры.Точность,
	|	1,
	|	ТаблицаЦен.ТипЦен.Рассчитывается
	|ИЗ
	|	ТаблицаЦен КАК ТаблицаЦен
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыЦенПоВидамНоменклатуры КАК ТипыЦенПоВидамНоменклатуры
	|		ПО ТаблицаЦен.ТипЦен = ТипыЦенПоВидамНоменклатуры.БазовыйТипЦен
	|ГДЕ
	|	ТаблицаЦен.Цена > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПолеСортировки,
	|	ТипЦенНаименование";
	Запрос=Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НаДату",           ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ПоХарактеристике", Перечисления.АлгоритмПолученияЦены.ПоХарактеристике);
	Запрос.УстановитьПараметр("Контрагент",       Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпанииПользователя);

	Если Элементы.СтраницыСписки.ТекущаяСтраница = Элементы.СтраницаХарактеристики Тогда
		ТекущаяНоменклатура   = ЭтотОбъект.ВыбраннаяНоменклатура;
		ТекущаяХарактеристика = Характеристики.НайтиПоИдентификатору(Элементы.Характеристики.ТекущаяСтрока).ХарактеристикаНоменклатуры;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеПоХарактеристике%", "ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры");
	Иначе
		ТекущаяНоменклатура   = Элементы.Список.ТекущаяСтрока;
		ТекущаяХарактеристика = Неопределено;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеПоХарактеристике%", "ИСТИНА");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Номенклатура",               ТекущаяНоменклатура);
	Запрос.УстановитьПараметр("ЦеноваяГруппа",            ТекущаяНоменклатура.ЦеноваяГруппа);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ТекущаяХарактеристика);
	
	ТаблицаЦеныКонтрагентов=Запрос.Выполнить().Выгрузить();
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	Ставка = ТекущаяНоменклатура.СтавкаНДС.Ставка;
	
	Для Каждого ТекСтрока Из ТаблицаЦеныКонтрагентов Цикл
		
		// для расчетных типов цен перерасчет из валюты базового типа цен
		ТекСтрока.Цена = ?(ТекСтрока.ВалютаЦены <> ТекСтрока.БазоваяВалюта, РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ТекСтрока.Цена, ТекСтрока.БазоваяВалюта, ТекущаяДатаСеанса(), ТекСтрока.ВалютаЦены, ТекущаяДатаСеанса()), ТекСтрока.Цена);
		
		Если ТекСтрока.ТипЦен.ОкруглятьВБольшуюСторону Тогда
			ТекСтрока.Цена = Окр(ТекСтрока.Цена,ТекСтрока.ТипЦен.Точность,1);
		Иначе
			ТекСтрока.Цена = Окр(ТекСтрока.Цена,ТекСтрока.ТипЦен.Точность,0);
		КонецЕсли;
		
		Если ВалютаРегламентированногоУчета <> Справочники.Валюты.ПустаяСсылка() Тогда
			ТекСтрока.ЦенаРегл = ?(ТекСтрока.ВалютаЦены = ВалютаРегламентированногоУчета, ТекСтрока.Цена,
			РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ТекСтрока.Цена, ТекСтрока.ВалютаЦены, ТекущаяДатаСеанса(), ВалютаРегламентированногоУчета, ТекущаяДатаСеанса()));
		КонецЕсли;
		
		НоваяСтрока = ЦеныКонтрагентов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
		
		Если ТекСтрока.ТипЦен.ЦенаВключаетНДС Тогда
			НоваяСтрока.ЦенаБезНДС     = ТекСтрока.Цена - Окр((ТекСтрока.Цена * Ставка)/(100 + Ставка), 2);
			НоваяСтрока.ЦенаБезНДСРегл = ТекСтрока.ЦенаРегл - Окр((ТекСтрока.ЦенаРегл * Ставка)/(100 + Ставка), 2);
		Иначе
			НоваяСтрока.ЦенаБезНДС     = ТекСтрока.Цена;
			НоваяСтрока.ЦенаБезНДСРегл = ТекСтрока.ЦенаРегл;
			НоваяСтрока.Цена           = ТекСтрока.Цена + Окр((ТекСтрока.Цена * Ставка)/100, 2);
			НоваяСтрока.ЦенаРегл       = ТекСтрока.ЦенаРегл + Окр((ТекСтрока.ЦенаРегл * Ставка)/100, 2);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьЦеныКонтрагентов()

// Получает и загружает цены номенклатуры согласованные.
//
&НаСервере
Процедура ЗагрузитьЦеныСогласованные()
	
	Если ЭтотОбъект.ТекущийЭлементСписка = Неопределено
		ИЛИ ТипЗнч(ЭтотОбъект.ТекущийЭлементСписка) = Тип("СтрокаГруппировкиДинамическогоСписка") 
		ИЛИ (НЕ ТипЗнч(ЭтотОбъект.ТекущийЭлементСписка) = Тип("СправочникСсылка.Номенклатура")) ИЛИ ЭтотОбъект.ТекущийЭлементСписка.ЭтоГруппа Тогда
		
		Возврат;
	КонецЕсли;
	// Загрузка согласованных цен
	Запрос=Новый Запрос(
	"ВЫБРАТЬ
	|	СогласованныеЦены.Приоритет КАК Приоритет,
	|	СогласованныеЦены.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	СогласованныеЦены.Контрагент КАК Контрагент,
	|	СогласованныеЦены.Период КАК ДатаНачалаДействия,
	|	СогласованныеЦены.СрокДействия КАК СрокДействия,
	|	СогласованныеЦены.Регистратор КАК Регистратор,
	|	СогласованныеЦены.Цена КАК СогласованнаяЦена,
	|	СогласованныеЦены.ЦенаБезНДС КАК СогласованнаяЦенаБезНДС,
	|	СогласованныеЦены.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаСогласованныеЦены
	|ИЗ
	|	РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
	|ГДЕ
	|	СогласованныеЦены.СрокДействия >= &Дата
	|	И СогласованныеЦены.Период <= &Дата
	|	И СогласованныеЦены.Номенклатура = &Номенклатура"+? (НЕ ВсеПодразделения, "
	|	И СогласованныеЦены.ПодразделениеКомпании В ИЕРАРХИИ(&ПодразделениеКомпании)", "") +"
	|
	|СГРУППИРОВАТЬ ПО
	|	СогласованныеЦены.Приоритет,
	|	СогласованныеЦены.ПодразделениеКомпании,
	|	СогласованныеЦены.Контрагент,
	|	СогласованныеЦены.Период,
	|	СогласованныеЦены.СрокДействия,
	|	СогласованныеЦены.Регистратор,
	|	СогласованныеЦены.Цена,
	|	СогласованныеЦены.ЦенаБезНДС,
	|	СогласованныеЦены.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СогласованныеЦены.СрокДействия КАК СрокДействия,
	|	СогласованныеЦены.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	СогласованныеЦены.Контрагент КАК Контрагент,
	|	СогласованныеЦены.Номенклатура КАК Номенклатура,
	|	СогласованныеЦены.СогласованнаяЦена КАК Цена,
	|	СогласованныеЦены.СогласованнаяЦенаБезНДС КАК ЦенаБезНДС
	|ИЗ
	|	ТаблицаСогласованныеЦены КАК СогласованныеЦены
	|ГДЕ
	|	СогласованныеЦены.Регистратор В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ТаблицаСогласованныеЦены.Регистратор КАК Регистратор
	|			ИЗ
	|				ТаблицаСогласованныеЦены КАК ТаблицаСогласованныеЦены
	|			ГДЕ
	|				ТаблицаСогласованныеЦены.Номенклатура = СогласованныеЦены.Номенклатура
	|				И ТаблицаСогласованныеЦены.Контрагент = СогласованныеЦены.Контрагент
	|				И ТаблицаСогласованныеЦены.ПодразделениеКомпании = СогласованныеЦены.ПодразделениеКомпании
	|			УПОРЯДОЧИТЬ ПО
	|				ТаблицаСогласованныеЦены.Приоритет УБЫВ,
	|				ТаблицаСогласованныеЦены.ДатаНачалаДействия УБЫВ,
	|				ТаблицаСогласованныеЦены.СрокДействия)");
	
	Запрос.УстановитьПараметр("Дата",					ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Номенклатура",			ЭтотОбъект.ТекущийЭлементСписка);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпанииПользователя);
	ТаблицаЦеныСогласованные =Запрос.Выполнить().Выгрузить();
//	Ставка = Объект.СтавкаНДС.Ставка;
	
	Для Каждого ТекСтрока Из ТаблицаЦеныСогласованные Цикл
		НоваяСтрока = ЦеныСогласованные.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
//		НоваяСтрока.Цена = ТекСтрока.Цена + Окр((ТекСтрока.Цена * Ставка)/100, 2);
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьЦеныСогласованные()

// Получает и загружает цены согласованные по группам поставки.
//
&НаСервере
Процедура ЗагрузитьЦеныПоГруппамПоставки()
	
	Если ЭтотОбъект.ТекущийЭлементСписка = Неопределено
		ИЛИ ТипЗнч(ЭтотОбъект.ТекущийЭлементСписка) = Тип("СтрокаГруппировкиДинамическогоСписка") 
		ИЛИ (НЕ ТипЗнч(ЭтотОбъект.ТекущийЭлементСписка) = Тип("СправочникСсылка.Номенклатура")) ИЛИ ЭтотОбъект.ТекущийЭлементСписка.ЭтоГруппа Тогда
		
		Возврат;
	КонецЕсли;
	// Загрузка цен по группам поставки
	Запрос=Новый Запрос(
	"ВЫБРАТЬ
	|	СогласованныеЦены.Приоритет КАК Приоритет,
	|	СогласованныеЦены.ГруппаПоставки КАК ГруппаПоставки,
	|	СогласованныеЦены.Контрагент КАК Контрагент,
	|	СогласованныеЦены.Период КАК ДатаНачалаДействия,
	|	СогласованныеЦены.СрокДействия КАК СрокДействия,
	|	СогласованныеЦены.Регистратор КАК Регистратор,
	|	СогласованныеЦены.Цена КАК СогласованнаяЦена,
	|	СогласованныеЦены.ЦенаБезНДС КАК СогласованнаяЦенаБезНДС,
	|	СогласованныеЦены.Номенклатура КАК Номенклатура,
	|	СогласованныеЦены.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	СогласованныеЦены.ГруппаЗаказа КАК ГруппаЗаказа
	|ПОМЕСТИТЬ ТаблицаСогласованныеЦены
	|ИЗ
	|	РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
	|ГДЕ
	|	СогласованныеЦены.СрокДействия >= &Дата
	|	И СогласованныеЦены.Период <= &Дата
	|	И СогласованныеЦены.Номенклатура = &Номенклатура"+? (НЕ ВсеПодразделения, "
	|	И СогласованныеЦены.ПодразделениеКомпании В ИЕРАРХИИ(&ПодразделениеКомпании)", "") +"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СогласованныеЦены.ДатаНачалаДействия КАК НачалоДействия,
	|	СогласованныеЦены.СрокДействия КАК СрокДействия,
	|	СогласованныеЦены.ГруппаПоставки КАК ГруппаПоставки,
	|	СогласованныеЦены.ГруппаПоставки.Наименование КАК ГруппаПоставкиНаименование,
	|	СогласованныеЦены.ГруппаЗаказа КАК ГруппаЗаказа,
	|	СогласованныеЦены.Контрагент КАК Контрагент,
	|	СогласованныеЦены.Номенклатура КАК Номенклатура,
	|	СогласованныеЦены.Приоритет КАК Приоритет,
	|	СогласованныеЦены.СогласованнаяЦена КАК Цена,
	|	СогласованныеЦены.СогласованнаяЦенаБезНДС КАК ЦенаБезНДС,
	|	СогласованныеЦены.ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	ТаблицаСогласованныеЦены КАК СогласованныеЦены
	|ГДЕ
	|	СогласованныеЦены.Регистратор В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ТаблицаСогласованныеЦены.Регистратор КАК Регистратор
	|			ИЗ
	|				ТаблицаСогласованныеЦены КАК ТаблицаСогласованныеЦены
	|			ГДЕ
	|				ТаблицаСогласованныеЦены.Номенклатура = СогласованныеЦены.Номенклатура
	|				И ТаблицаСогласованныеЦены.Контрагент = СогласованныеЦены.Контрагент
	|				И ТаблицаСогласованныеЦены.ГруппаПоставки = СогласованныеЦены.ГруппаПоставки
	|			УПОРЯДОЧИТЬ ПО
	|				ТаблицаСогласованныеЦены.Приоритет УБЫВ,
	|				ТаблицаСогласованныеЦены.ДатаНачалаДействия УБЫВ,
	|				ТаблицаСогласованныеЦены.Регистратор.Дата УБЫВ,
	|				ТаблицаСогласованныеЦены.СрокДействия)
	|УПОРЯДОЧИТЬ ПО
	|	ГруппаПоставкиНаименование");
	
	Запрос.УстановитьПараметр("Дата",					ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Номенклатура",			ЭтотОбъект.ТекущийЭлементСписка);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпанииПользователя);

	ТаблицаЦеныПоГруппамПоставки = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из ТаблицаЦеныПоГруппамПоставки Цикл
		НоваяСтрока = ЦеныПоГруппамПоставки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьЦеныПоГруппамПоставки()

&НаСервере
Процедура ЗагрузитьЦеныУценки()
	
	Если ЭтотОбъект.ТекущийЭлементСписка = Неопределено
		ИЛИ ТипЗнч(ЭтотОбъект.ТекущийЭлементСписка) = Тип("СтрокаГруппировкиДинамическогоСписка") 
		ИЛИ (НЕ ТипЗнч(ЭтотОбъект.ТекущийЭлементСписка) = Тип("СправочникСсылка.Номенклатура")) ИЛИ ЭтотОбъект.ТекущийЭлементСписка.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УценкаТовара.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	УценкаТовара.ЗалОбслуживания КАК ЗалОбслуживания,
	|	УценкаТовара.СрокДействия КАК СрокДействия,
	|	УценкаТовара.ЗначениеСкидки КАК ЗначениеСкидки,
	|	УценкаТовара.Период КАК Период,
	|	УценкаТовара.Регистратор КАК Регистратор,
	|	УценкаТовара.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаУценкиЦены
	|ИЗ
	|	РегистрСведений.УценкаТовара КАК УценкаТовара
	|ГДЕ
	|	УценкаТовара.Номенклатура = &Номенклатура
	|	И УценкаТовара.Действует
	|	И УценкаТовара.Период <= &Дата
	|	И УценкаТовара.СрокДействия >= &Дата"+? (НЕ ВсеПодразделения, "
	|	И УценкаТовара.ПодразделениеКомпании В ИЕРАРХИИ(&ПодразделениеКомпании)", "") +"
	|
	|СГРУППИРОВАТЬ ПО
	|	УценкаТовара.Номенклатура,
	|	УценкаТовара.ПодразделениеКомпании,
	|	УценкаТовара.ЗалОбслуживания,
	|	УценкаТовара.СрокДействия,
	|	УценкаТовара.ЗначениеСкидки,
	|	УценкаТовара.Период,
	|	УценкаТовара.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныУценки.СрокДействия КАК СрокДействия,
	|	ЦеныУценки.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ЦеныУценки.ЗначениеСкидки КАК ЗначениеСкидки,
	|	ЦеныУценки.Номенклатура КАК Номенклатура,
	|	ЦеныУценки.Период КАК Период,
	|	ЦеныУценки.ЗалОбслуживания КАК ЗалОбслуживания,
	|	ЦеныУценки.Регистратор КАК Регистратор
	|ИЗ
	|	ТаблицаУценкиЦены КАК ЦеныУценки
	|ГДЕ
	|	ЦеныУценки.Регистратор В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ТаблицаУценкиЦены.Регистратор КАК Регистратор
	|			ИЗ
	|				ТаблицаУценкиЦены КАК ТаблицаУценкиЦены
	|			ГДЕ
	|				ТаблицаУценкиЦены.Номенклатура = ЦеныУценки.Номенклатура
	|				И ТаблицаУценкиЦены.ПодразделениеКомпании = ЦеныУценки.ПодразделениеКомпании
	|			УПОРЯДОЧИТЬ ПО
	|				ТаблицаУценкиЦены.СрокДействия)";
	
	Запрос.УстановитьПараметр("Номенклатура", ЭтотОбъект.ТекущийЭлементСписка);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпанииПользователя);
	Запрос.УстановитьПараметр("Дата",					ТекущаяДатаСеанса());
	ТаблицаУценок = Запрос.Выполнить().Выгрузить();

	Для Каждого ТекСтрока Из ТаблицаУценок Цикл
		НоваяСтрока = ЦеныУценкаТовара.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

// Получает и загружает замены номенклатуры.
//
&НаСервере
Процедура ЗагрузитьЗамены()
	
	ЗаменыСтарые.Очистить();
	ЗаменыНовые.Очистить();
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено ИЛИ ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаЗамен = Справочники.Номенклатура.ПолучитьТаблицуЗамен(Элементы.Список.ТекущаяСтрока, Элементы.Список.ТекущаяСтрока.Артикул, Элементы.Список.ТекущаяСтрока.Производитель);
	ЗаменыСтарые.Загрузить(Справочники.Номенклатура.ПолучитьЗаменыНоменклатуры(Ложь, ТаблицаЗамен));
	ЗаменыНовые.Загрузить(Справочники.Номенклатура.ПолучитьЗаменыНоменклатуры(Истина, ТаблицаЗамен));
	
	// Заполним номера строк в ТЧ
	НомерСтроки = 1;
	Для Каждого ТекущаяСтрока Из ЗаменыСтарые Цикл
		ТекущаяСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	НомерСтроки = 1;
	Для Каждого ТекущаяСтрока Из ЗаменыНовые Цикл
		ТекущаяСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьЗамены()



// Формирование настроек вариантов отчетов
//
&НаСервере
Функция ПолучитьНастройкуОтчета(КлючОтчета)
	
	ВариантОтчета = Неопределено;
	
	Если КлючОтчета = "ОстаткиИОборотыТоваровОрдерногоСклада" Тогда
		
		Отчет = Отчеты.ОстаткиИОборотыТоваровОрдерногоСклада.Создать();
		ВариантОтчета = Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.Остатки.Настройки;
		
		Показатели      = ВариантОтчета.Выбор;
		СтруктураОтчета = ВариантОтчета.Структура;
		СтруктураОтчета.Очистить();
		
		Для Каждого ТекПоказатель Из Показатели.Элементы Цикл
			Если ТипЗнч(ТекПоказатель) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
				ТекПоказатель.Использование = Истина;
				Для Каждого ТекВложенныйПоказатель Из ТекПоказатель.Элементы Цикл
					ТекВложенныйПоказатель.Использование = Истина;
				КонецЦикла;
			ИначеЕсли НЕ ТипЗнч(ТекПоказатель) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
				ТекПоказатель.Использование = Истина;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаОтчета = СтруктураОтчета.Добавить(Тип("ТаблицаКомпоновкиДанных"));
		
		// добавляем измерения строки
		ГруппировкаСкладКомпании = ОтчетыПлатформаСервер.СКД_ДобавитьГруппировку(ТаблицаОтчета.Строки, "СкладКомпании");
		ГруппировкаЯчейка        = ОтчетыПлатформаСервер.СКД_ДобавитьГруппировку(ГруппировкаСкладКомпании.Структура, "Ячейка");
		
	ИначеЕсли КлючОтчета = "ОстаткиИОборотыТоваров" Тогда
		
		Отчет = Отчеты.ОстаткиИОборотыТоваров.Создать();
		ВариантОтчета = Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.Остатки.Настройки;
		
		Показатели      = ВариантОтчета.Выбор;
		СтруктураОтчета = ВариантОтчета.Структура;
		СтруктураОтчета.Очистить();
		
		Для Каждого ТекПоказатель Из Показатели.Элементы Цикл
			Если ТипЗнч(ТекПоказатель) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
				ТекПоказатель.Использование = Истина;
				Для Каждого ТекВложенныйПоказатель Из ТекПоказатель.Элементы Цикл
					ТекВложенныйПоказатель.Использование = Истина;
				КонецЦикла;
			ИначеЕсли НЕ ТипЗнч(ТекПоказатель) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
				ТекПоказатель.Использование = Истина;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаОтчета = СтруктураОтчета.Добавить(Тип("ТаблицаКомпоновкиДанных"));
		
		// добавляем измерения строки
		ГруппировкаНоменклатуры = ОтчетыПлатформаСервер.СКД_ДобавитьГруппировку(ТаблицаОтчета.Строки, "Номенклатура");
		ГруппировкаНоменклатуры.ПоляГруппировки.Элементы[0].ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
		
	КонецЕсли;
	
	Возврат ВариантОтчета;
	
КонецФункции // ПолучитьНастройкуОтчета()

&НаСервере
// Процедура получает данные из хранилища по указанному адресу 
// и загружает их в корзину.
//
// Параметры:
// Адрес - адрес хранилища, переданный форме подбора.
//
Процедура ЗагрузитьКорзинуИзХранилища(Адрес)
	
	ТаблицаКорзины = ПолучитьИзВременногоХранилища(Адрес);
	Корзина.Загрузить(ТаблицаКорзины);
	
КонецПроцедуры //ЗагрузитьКорзинуИзХранилища()

// Обработчик ответа на вопрос создания новой номенклатуры на основании выбранной строки в таблицы замен.
//
&НаКлиенте
Процедура ДобавлениеЗамены(РезультатОтвета, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатОтвета = КодВозвратаДиалога.Да Тогда
		ПараметрыФормы = Новый Структура;
		Основание = Новый Структура();
		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
			ДобавлениеНоменклатуры = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеПараметры, "ДобавлениеНоменклатуры", Неопределено);
			Если НЕ ДобавлениеНоменклатуры = Неопределено Тогда
				Основание.Вставить("Артикул",       ДобавлениеНоменклатуры.Артикул);
				Основание.Вставить("Производитель", ДобавлениеНоменклатуры.Производитель);
			КонецЕсли;
		КонецЕсли;
		ПараметрыФормы.Вставить("Основание", Основание);
		ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры // ДобавлениеЗамены()

// Обработчик для изменения таблиц замен при вводе новой номенклатуры
//
&НаСервере
Процедура ОбновитьТаблицуЗамен(НоваяНоменклатура)
	
	СтрокаПоискаЗамены = Новый Структура("Артикул, Производитель", НоваяНоменклатура.Артикул, НоваяНоменклатура.Производитель);
	ТаблицаЗаменыСтарые = ЗаменыСтарые.НайтиСтроки(СтрокаПоискаЗамены);
	ТаблицаЗаменыНовые  = ЗаменыНовые.НайтиСтроки(СтрокаПоискаЗамены);
	
	Для Каждого Замена Из ТаблицаЗаменыСтарые Цикл
		Замена.Номенклатура = НоваяНоменклатура;
	КонецЦикла;
	
	Для Каждого Замена Из ТаблицаЗаменыНовые Цикл
		Замена.Номенклатура = НоваяНоменклатура;
	КонецЦикла;
	
КонецПроцедуры // ОбновитьТаблицуЗамен()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Структура - Содержит процедуру в которую будет передан ответ на вопрос и формы из которой
//                                        вызвано оповещение.
//
&НаКлиенте
Процедура Подключаемый_ПередЗакрытием(Результат, ДополнительныеПараметры) Экспорт
	
	Если РежимПодбора Тогда
		СписокВыборЗначения(Неопределено,Неопределено,Неопределено);
	ИначеЕсли Элементы.СтраницаКорзина.Видимость Тогда
		КорзинаСохранить(Неопределено);
	КонецЕсли;
	
КонецПроцедуры //Подключаемый_ПередЗакрытием()

// Процедура для вывода последующих изображений
//
&НаСервере
Процедура ПолучитьСледующееИзображение(ТекущаяСтрока,ДвижениеПросмотра)
	
	// Сформируем список форматов изображения
	СписокИзображений = ПолучитьМассивИзображений(ТекущаяСтрока);
	
	// Выведем очередную картинку
	НомерКартинки = 0;
	Если СписокИзображений.Количество() > 1 Тогда
		КоличествоИзображений = СписокИзображений.Количество();
		Для Индекс = 0 По КоличествоИзображений - 1 Цикл
			Если ТекущаяКартинка = СписокИзображений[Индекс].Ссылка Тогда
				Если ДвижениеПросмотра = "Вперед" Тогда
					Если Индекс = КоличествоИзображений - 1 Тогда
						НомерКартинки = 0;
					Иначе
						НомерКартинки = Индекс + 1;
					КонецЕсли;
				ИначеЕсли ДвижениеПросмотра = "Назад" Тогда
					Если Индекс = 0 Тогда
						НомерКартинки = КоличествоИзображений - 1;
					Иначе
						НомерКартинки = Индекс - 1;
					КонецЕсли;
				КонецЕсли;
				ТекущаяКартинка = СписокИзображений[НомерКартинки];
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Проверим тип выбранного файла картинки
	Если (ТекущаяКартинка.ИндексКартинки < 42 ИЛИ ТекущаяКартинка.ИндексКартинки > 52) И СписокИзображений.Количество() > 0 Тогда
		ТекущаяКартинка = СписокИзображений[0];
		НомерКартинки = 0;
	КонецЕсли;
	
	Если НЕ ТекущаяКартинка.Пустая() Тогда
		ИндикаторКоличестваКартинок = "" + (НомерКартинки + 1) + " из " + СписокИзображений.Количество();
		АдресКартинки = НавигационнаяСсылкаКартинки(ТекущаяКартинка, УникальныйИдентификатор)
	Иначе
		ИндикаторКоличестваКартинок = "";
		АдресКартинки = "";
	КонецЕсли;
	
КонецПроцедуры // ПолучитьСледующееИзображение()

// Процедура для вывода последующих изображений
//
&НаСервере
Функция ПолучитьМассивИзображений(ТекущийОбъект)
	
	СписокФайлов = ПрисоединенныеФайлыСлужебный.ПолучитьВсеПодчиненныеФайлы(ТекущийОбъект);
	
	// Сформируем список форматов изображения
	СписокИзображений = Новый Массив;
	Для Каждого Файл Из СписокФайлов Цикл
		Если ТекущийОбъект.ФайлКартинки = Файл  ИЛИ (НЕ Файл.ПометкаУдаления И Файл.ИндексКартинки > 41 И Файл.ИндексКартинки < 51) Тогда
			СписокИзображений.Добавить(Файл);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокИзображений;
	
КонецФункции// ПолучитьМассивИзображений()

// Функция для получения ссылки на картинку для ее отображения
//
&НаСервереБезКонтекста
Функция НавигационнаяСсылкаКартинки(ФайлКартинки, ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		АдресКартинки = ПрисоединенныеФайлы.ПолучитьДанныеФайла(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		АдресКартинки = "";
	КонецПопытки;
	
	Возврат АдресКартинки;
	
КонецФункции //НавигационнаяСсылкаКартинки()

// Процедура для вывода последующих изображений
//
&НаСервере
Процедура ПолучитьКартинкуПоУмолчанию()
	
	ТекущаяКартинка = ПредопределенноеЗначение("Справочник.НоменклатураПрисоединенныеФайлы.ПустаяСсылка");
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	АдресКартинки = "";
	Если ТекущаяСтрока = Неопределено ИЛИ Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница = Неопределено ИЛИ ТипЗнч(ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") ИЛИ ТекущаяСтрока.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТекущаяСтрока.ФайлКартинки.Пустая() Тогда
		АдресКартинки = НавигационнаяСсылкаКартинки(ТекущаяСтрока.ФайлКартинки, УникальныйИдентификатор);
		МассивКартинок = ПолучитьМассивИзображений(ТекущаяСтрока);
		Если МассивКартинок.Количество()>0 Тогда
			ИндикаторКоличестваКартинок = "" + (МассивКартинок.Найти(ТекущаяСтрока.ФайлКартинки) + 1) + " из " + МассивКартинок.Количество() +"";
		КонецЕсли;
	Иначе
		ПолучитьСледующееИзображение(ТекущаяСтрока,"Вперед");
	КонецЕсли;
	
КонецПроцедуры// ПолучитьКартинкуПоУмолчанию()

&НаСервере
Функция АссортиментПоФорматам()
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.ФорматыКатегорий ГДЕ НЕ ПометкаУдаления");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();
	
КонецФункции //АссортиментПоФорматам()

// Дополняет таблицу значений-приемник данными из таблицы значений-источник 
// 
// Параметры: 
// ТаблицаИсточник - Таблица значений - таблица из которой будут браться строки для заполнения 
// ТаблицаПриемник - Таблица значений - таблица в которую будут добавлены строки из таблицы-источника 
//
&НаСервере
Процедура ДополнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник) 

Для Каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл 

ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник); 

КонецЦикла; 

КонецПроцедуры

//// Обработка загружает настроки последнего открытия формы для пользователя
//&НаСервере
//Процедура ЗагрузитьНастройки()
//	
//	ИмяСтраницы = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Справочники_Номенклатура_ФормаСписка", "ИмяСтраницы");
//	Если ЗначениеЗаполнено(ИмяСтраницы) Тогда
//		СохраненнаяСтраница = Элементы.СтраницыРасширеннаяИнформация.ПодчиненныеЭлементы.Найти(ИмяСтраницы);
//		Если НЕ СохраненнаяСтраница = Неопределено Тогда
//			Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница = СохраненнаяСтраница;
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры //ЗагрузитьНастройки()

//// Обработка сохраняет настроки последнего открытия формы для пользователя
//&НаСервере
//Процедура СохранитьНастройки()
//	
//	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Справочники_Номенклатура_ФормаСписка", "ИмяСтраницы", Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя);
//	
//КонецПроцедуры //СохранитьНастройки()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Элементы.Список.ТекущиеДанные, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеСпискомСправочникаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()

&НаКлиенте
Процедура ОбработкаОтветаНаВопрос(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
		ОтборПоПодразделениюПользователя(Неопределено);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()

&НаКлиенте
Процедура ВопросОтключенияОтбораПодразделения() Экспорт
	ТекстВопроса = "Установлен отбор по подразделению, отключить?";
	ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаОтветаНаВопрос", ЭтотОбъект, Новый Структура("КонтрольПодразделения",Истина)),ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,,); 
КонецПроцедуры

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Вызываем общий обработчик действия.
	УправлениеДиалогомСправочникаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
	// Цвет текста
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Цены.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Цены.Рассчитывается");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СкрытыйВариантОтчетаЦвет);
	
	// Цвет текста
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЦеныКонтрагентов.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЦеныКонтрагентов.Рассчитывается");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СкрытыйВариантОтчетаЦвет);
	
	// Цвет текста
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КорзинаХарактеристикаНоменклатуры.Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Корзина.ХарактеристикаНоменклатуры");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Корзина.ВладелецХарактеристики");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<без характеристик>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Не заполненность характеристики
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.КорзинаХарактеристикаНоменклатуры.Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Корзина.Номенклатура.ТипНоменклатуры.АвтоСписаниеХарактеристик");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.РежимыАвтоСписанияХарактеристик.РучноеСписание;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Корзина.ХарактеристикаНоменклатуры");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

	// Цвет текста
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаменыСтарые.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗаменыСтарые.Номенклатура");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.Номенклатура.ПустаяСсылка();
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(128,128,128));
	
	// Цвет текста
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаменыНовые.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗаменыНовые.Номенклатура");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.Номенклатура.ПустаяСсылка();
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(128,128,128));
	
	// Цвет текста
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаменыСтарые.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗаменыСтарые.Количество");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0,128,0));
	
	// Цвет текста
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаменыНовые.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗаменыНовые.Количество");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0,128,0));
	
	// Цвет текста
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Выделение текущей номенклатуры'");
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Аналоги.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Аналоги.Номенклатура");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Список.Ссылка");
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаКонтрагентаДействующего);
	
	// Шрифт
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Выделение главных аналогов'");
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Аналоги.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Аналоги.Приоритет");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,, Истина));
	
	ЛевоеЗначениеОстаткиПоСкладам = Новый ПолеКомпоновкиДанных("СкладКомпании.ПодразделениеКомпании");
	ОтборПоСкладам = Неопределено;
	Для Каждого ТекущийОтбор Из ОстаткиПоСкладам.Отбор.Элементы Цикл
		Если ТекущийОтбор.ЛевоеЗначение = ЛевоеЗначениеОстаткиПоСкладам Тогда
			ОтборПоСкладам = ТекущийОтбор;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ОтборПоСкладам = Неопределено Тогда
		ОтборПоСкладам = ОстаткиПоСкладам.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоСкладам.ЛевоеЗначение = ЛевоеЗначениеОстаткиПоСкладам;
	КонецЕсли;
	
	ОтборПоСкладам.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборПоСкладам.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь.ПодразделениеКомпании;
	ОтборПоСкладам.Использование  = Истина;
	
	//приоритет согласованных цен
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента      = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЦеныПоГруппамПоставки.ПодчиненныеЭлементы.ЦеныПоГруппамПоставкиПриоритет.Имя); //ЦеныПоГруппамПоставкиПриоритет
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЦеныПоГруппамПоставки.Приоритет");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Обычный");
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента      = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЦеныПоГруппамПоставки.ПодчиненныеЭлементы.ЦеныПоГруппамПоставкиПриоритет.Имя); //ЦеныПоГруппамПоставкиПриоритет
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЦеныПоГруппамПоставки.Приоритет");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Высокий");
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента      = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЦеныПоГруппамПоставки.ПодчиненныеЭлементы.ЦеныПоГруппамПоставкиПриоритет.Имя); //ЦеныПоГруппамПоставкиПриоритет
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЦеныПоГруппамПоставки.Приоритет");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Очень высокий");
		
КонецПроцедуры // УстановитьУсловноеОформление()

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Открывает форму обработки "Упущенный спрос".
&НаКлиенте
Процедура УпущенныйСпрос(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ПараметрыНоменклатуры = Новый Структура;
	ПараметрыНоменклатуры.Вставить("Количество", 1);
	
	Если ТекущиеДанные <> Неопределено И НЕ (ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") ИЛИ ТекущиеДанные.ЭтоГруппа) Тогда
		ПараметрыНоменклатуры.Вставить("Номенклатура", ТекущиеДанные.Ссылка);
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.ЭтоГруппа Тогда
		ВывестиСообщение(НСтр("ru='Использование для групп запрещено.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ПараметрыНоменклатуры", ПараметрыНоменклатуры);
	ОткрытьФорму("Обработка.УпущенныйСпрос.Форма", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Обработчик команды Дерево
//
&НаКлиенте
Процедура РежимЛевойПанели(Команда)
	
	ИзменитьРежимЛевойПанелиНаСервере(Команда.Имя);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при выполнении команды "Корзины".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура КорзинаВключить(Команда)
	
	// Произведем настройку параметров отображения полей расширенной информации
	УстановитьВидимостьКорзины(ИСТИНА);
	
КонецПроцедуры // КорзинаВключить()

// Обработчик события возникающего на клиенте при выполнении команды "Отключить корзину".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура КорзинаОтключить(Команда)
	
	// Произведем настройку параметров отображения полей расширенной информации
	УстановитьВидимостьКорзины(ЛОЖЬ);
	
	// Обновим отображение информации по текущей строке
	СтраницыПриСменеСтраницы(Элементы.СтраницыРасширеннаяИнформация, Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница);
	
КонецПроцедуры // КорзинаОтключить()

// Обработчик события возникающего на клиенте при выполнении команды "Загрузить корзину".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура КорзинаЗагрузить(Команда)
	
	ОткрытьФорму("РегистрСведений.Корзина.ФормаСписка", Новый Структура("РежимВыбора", Истина), ЭтотОбъект,,,, Новый ОписаниеОповещения("КорзинаЗагрузитьЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // КорзинаЗагрузить()

// Обработка выбора корзины
//
&НаКлиенте
Процедура КорзинаЗагрузитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КорзинаЗагрузитьЗавершениеНаСервере(Результат);
	
	ЭтотОбъект.Элементы.КорзинаСохранитьКак.Доступность = Истина;
	
КонецПроцедуры // КорзинаЗагрузитьЗавершение()

// Загрузка выбранной корзины
//
&НаСервере
Процедура КорзинаЗагрузитьЗавершениеНаСервере(КлючЗаписи)
	
	МенеджерЗаписи = РегистрыСведений.Корзина.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Дата         = КлючЗаписи.Дата;
	МенеджерЗаписи.Наименование = КлючЗаписи.Наименование;
	МенеджерЗаписи.Прочитать();
	ЦенаПользователя = 0;
	
	Если МенеджерЗаписи.Выбран() Тогда
		Корзина.Загрузить(ПолучитьЗначениеПараметраСтруктуры(МенеджерЗаписи.Значение.Получить(), "Товары", Новый ТаблицаЗначений));
		Для Каждого СтрокаКорзины Из Корзина Цикл
			КорзинаНоменклатураПриИзмененииНаСервере(СтрокаКорзины);
		КонецЦикла;
	Иначе
		Корзина.Очистить();
	КонецЕсли;
	
	РассчитатьПодвалКорзины();
	
	КорзинаКлючЗаписи = КлючЗаписи;
	
	
КонецПроцедуры // КорзинаЗагрузитьЗавершениеНаСервере()

// Обработчик события возникающего на клиенте при выполнении команды "Сохранить корзину".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура КорзинаСохранить(Команда)

	Если КорзинаКлючЗаписи = Неопределено Тогда
		ОткрытьФорму("РегистрСведений.Корзина.ФормаЗаписи", ПодготовитьСписокПодобранныхТоваров(),ЭтотОбъект,,,,);
	Иначе
		КорзинаСохранитьНаСервере(КорзинаКлючЗаписи);
		ЭтотОбъект.Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры // КорзинаСохранить()

&НаСервере
Процедура КорзинаСохранитьНаСервере(КлючЗаписи)
	
	МенеджерЗаписи = РегистрыСведений.Корзина.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Дата         = КлючЗаписи.Дата;
	МенеджерЗаписи.Наименование = КлючЗаписи.Наименование;
	МенеджерЗаписи.Прочитать();
		
	Структура = Новый Структура;
	Структура.Вставить("Товары", Корзина.Выгрузить());
	МенеджерЗаписи.Значение = Новый ХранилищеЗначения(Структура);
	
	МенеджерЗаписи.Записать(Истина);
		
КонецПроцедуры // КорзинаСохранитьЗавершение()

&НаКлиенте
Процедура КорзинаСохранитьКак(Команда)
	ОткрытьФорму("РегистрСведений.Корзина.ФормаЗаписи", ПодготовитьСписокПодобранныхТоваров(),ЭтотОбъект,,,,);
КонецПроцедуры

// Обработчик команды очистки корзины
//
&НаКлиенте
Процедура КорзинаОчистить(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("КорзинаОчиститьЗавершение", ЭтотОбъект), НСтр("ru = 'Очистить корзину?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры // КорзинаОчистить()

&НаКлиенте
Процедура КорзинаОчиститьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		Корзина.Очистить();
		ЭтотОбъект.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры // КорзинаОчиститьЗавершение()

// Обработчик события возникающего на клиенте при выполнении команд просмотра изображений "Вперед" и "Назад".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура ПросмотретьИзображения(Команда)
	
	ДвижениеПросмотра = ?(СтрНайти(Команда.Имя, "Вперед"), "Вперед", "Назад");
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТипЗнч(ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	ПолучитьСледующееИзображение(ТекущаяСтрока,ДвижениеПросмотра);
	
КонецПроцедуры // ПросмотретьИзображения()

// Обработчик события возникающего на клиенте при выполнении команд просмотра изображений "Вперед" и "Назад".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура ДобавитьВКорзину(Команда)
	
	Если Элементы.СтраницыСписки.ТекущаяСтраница = Элементы.СтраницаХарактеристики Тогда
		ХарактеристикиВыбор(Элементы.Характеристики,Элементы.Характеристики.ТекущаяСтрока,Элементы.Наименование,Истина);
	Иначе
		СписокВыбор(Элементы.Список,Элементы.Список.ТекущаяСтрока,Элементы.Наименование,Истина);
	КонецЕсли;
	
КонецПроцедуры //ДобавитьВКорзину()

// Обработчик события возникающего на клиенте на клиенте при выполнении команды "Завершить подбор".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура ЗавершитьПодбор(Команда)
	
	Модифицированность = Ложь;
	Закрыть(ПодготовитьСписокПодобранныхТоваров());
	
КонецПроцедуры // ЗавершитьПодбор()

//тк+
// Обработчик оповещения, возникающего при вводе строки быстрого поиска
//
&НаКлиенте
Процедура БыстрыйПоискИОтборЗавершение(тПоиск, ДопПараметры)  Экспорт
	
	Если ЗначениеЗаполнено(тПоиск) Тогда 
		НаименованиеНесколькоВхождений = тПоиск;
		Элементы.ПоискПоУсловию.Доступность = Ложь;
		Элементы.ФормаКнопкаОтборF7.Пометка = Истина;
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		//ОтключитьОтборНаСервере();
		БыстрыйПоискИОтборНаСервере();
	КонецЕсли;
	
КонецПроцедуры   // БыстрыйПоискИОтборЗавершение()

&НаСервереБезКонтекста
Процедура ВыгрузитьТоварВОборудованиеНаСервере(СписокТоваров, ТекстОшибки)
	
	ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПодключаемоеОборудование.ГруппаТоваровОборудования КАК ГруппаТоваров
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.ПометкаУдаления = ЛОЖЬ И 
	|	ПодключаемоеОборудование.ОсновнойОтдел.ПодразделениеКомпании = &ПодразделениеКомпании И 
	|	(НЕ ПодключаемоеОборудование.ГруппаТоваровОборудования = ЗНАЧЕНИЕ(Справочник.ГруппыТоваровОборудования.ПустаяСсылка))
	|";
	
	ГруппыТоваров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГруппаТоваров");
	
	Если ГруппыТоваров.Количество() = 0 Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru='Для подразделения пользователя %1 не найдено торговое оборудование!'"), СокрЛП(ПодразделениеКомпании));
		Возврат;
	КонецЕсли;
	РегистрыСведений.ТоварыВОборудовании.ДобавитьТоварыВОборудование(ГруппыТоваров, СписокТоваров);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТоварВОборудование(Команда)
	
	ВыгружаемыеТовары = Новый Массив;
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		ВывестиСообщение(НСтр("ru='Товар для выгрузки не выделен.'"));
		Возврат;
	КонецЕсли;
	
	СписокТоваров = Новый Массив;
	Для Каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		СписокТоваров.Добавить(ТекущаяСтрока);
	КонецЦикла;
	
	ТекстОшибки = "";
	ВыгрузитьТоварВОборудованиеНаСервере(СписокТоваров, ТекстОшибки);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ВывестиСообщение(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьМоментИзмененияНаСервере()
	
	СписокТоваров = Новый Массив;
	Для Каждого Строка Из Элементы.Список.ВыделенныеСтроки Цикл
		СписокТоваров.Добавить(Строка);
	КонецЦикла;
	
	Если СписокТоваров.Количество()>0 Тогда	
		ОбменДаннымиСобытия.ЗарегистрироватьИзмененияРегистраТоварыВОборудовании(СписокТоваров);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМоментИзменения(Команда)
	УстановитьМоментИзмененияНаСервере();
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЯ "РАСШИРЕННАЯ ИНФОРМАЦИЯ"

// Обработчик события возникающего при переключении с одной страницы на другую.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ТекущаяСтраница - ГруппаФормы - Новая активная страница.
//
&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница = Неопределено ИЛИ ЕстьРеквизитНаКлиенте(ТекущаяСтрока,"ГруппировкаСтроки") И ЗначениеЗаполнено(ТекущаяСтрока.ГруппировкаСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПутьНоменклатуры(ТекущаяСтрока);
	
	Если Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя = "СтраницаОстатки" Тогда
		
		ПереключательОстаткиПриИзменении(Элементы.ПереключательОстатки);
		
	ИначеЕсли Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя = "СтраницаЦены" Тогда
		
		ПереключательЦеныПриИзменении(Элементы.ПереключательЦены);
		
	ИначеЕсли Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя = "СтраницаАналоги" Тогда
		
		ПереключательАналогиПриИзменении(Элементы.ПереключательАналоги);
		
	ИначеЕсли Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя = "СтраницаЗаказы" Тогда
		
		ПереключательЗаказыПриИзменении(Элементы.ПереключательЗаказы);
		
	ИначеЕсли Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя = "СтраницаАссортимент" И ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаАссортимент").Пометка = Ложь Тогда
		
		Если АссортиментПоФорматам() Тогда
			
			ЭтоГруппа = ?(Элементы.Список.ТекущиеДанные=Неопределено, Ложь, Элементы.Список.ТекущиеДанные.ЭтоГруппа);
			
			Элементы.Ассортимент.Видимость = Ложь;
			Элементы.АссортиментФорматов.Видимость = НЕ ЭтоГруппа;
			Элементы.Форматы.Видимость = ЭтоГруппа;
			
			Если ЭтоГруппа Тогда
				Форматы.Отбор.Элементы.Очистить();
				Форматы.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("текДата", ТекущаяДата());
				Форматы.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Номенклатура", ТекущаяСтрока);
			Иначе
				АссортиментФорматов.Отбор.Элементы.Очистить();
				АссортиментФорматов.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("текДата", ТекущаяДата());
				АссортиментФорматов.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Номенклатура", ТекущаяСтрока);
			КонецЕсли;
			
		Иначе
			
			Элементы.Ассортимент.Видимость = Истина;
			Элементы.АссортиментФорматов.Видимость = Ложь;
			Элементы.Форматы.Видимость = Ложь;
			
			Ассортимент.Отбор.Элементы.Очистить();
			//Ассортимент.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("текДата", ТекущаяДата());
			Ассортимент.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Номенклатура", ТекущаяСтрока);
			
		КонецЕсли;
		
		ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаАссортимент").Пометка = Истина;
		
	//тк+
	ИначеЕсли Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя = "СтраницаСкидкиСписок" Тогда
		
		ЗаполнитьСкидки();
		
	ИначеЕсли Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя = "СтраницаНаценки" Тогда
		
		ЗаполнитьНаценки();
		
	ИначеЕсли Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя = "СтраницаШтрихкоды" Тогда
		
		ЗаполнитьШтрихкоды();
	//тк-
		
	ИначеЕсли Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя = "СтраницаОписание" Тогда
		
		ПолучитьКартинкуПоУмолчанию();
		
	КонецЕсли;
	
КонецПроцедуры // СтраницыПриСменеСтраницы

&НаСервере
Процедура ЗаполнитьПутьНоменклатуры(Ссылка)
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Попытка
			ПутьНоменклатуры = Ссылка.ПолноеНаименование();
			ПутьНоменклатуры = СтрЗаменить(ПутьНоменклатуры,Ссылка.Наименование,"");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры //ЗаполнитьПутьНоменклатуры()

// Обработчик события возникающего на клиенте при изменении переключателя "Остатки".
//
// Параметры:
//  Элемент - Переключатель - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПереключательОстаткиПриИзменении(Элемент)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		ТекущаяСтрока = Неопределено;
		ТекущаяХарактеристика = Неопределено;
	ИначеЕсли Элементы.СтраницыСписки.ТекущаяСтраница = Элементы.СтраницаХарактеристики Тогда
		ТекущаяСтрока = ЭтотОбъект.ВыбраннаяНоменклатура;
		ТекущаяХарактеристика = Элементы.Характеристики.ТекущиеДанные.ХарактеристикаНоменклатуры;
	Иначе
		ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
		ТекущаяХарактеристика = Неопределено;
	КонецЕсли;
	
	Если ПереключательОстатки = 0 Тогда
		Если ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаОстаткиСклады").Пометка = Ложь Тогда
			ОстаткиПоСкладам.Отбор.Элементы.Очистить();
			ЭлементОтбора = ОстаткиПоСкладам.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Номенклатура");
			ЭлементОтбора.Использование  = ИСТИНА;
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = ТекущаяСтрока;
			// Профильтруем еще по характеристике, если мы находимся на странице ее выбора.
			Если ЗначениеЗаполнено(ТекущаяХарактеристика) Тогда
				ЭлементОтбора = ОстаткиПоСкладам.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ХарактеристикаНоменклатуры");
				ЭлементОтбора.Использование  = ИСТИНА;
				ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение = ТекущаяХарактеристика;
			КонецЕсли;
			
			ЛевоеЗначениеОстаткиПоПартиям = Новый ПолеКомпоновкиДанных("СкладКомпании.ПодразделениеКомпании");
			ОтборПоПартиям = ОстаткиПоСкладам.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборПоПартиям.ЛевоеЗначение = ЛевоеЗначениеОстаткиПоПартиям;
			ОтборПоПартиям.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВИерархии;
			ОтборПоПартиям.ПравоеЗначение = ПодразделениеКомпанииПользователя;
			ОтборПоПартиям.Использование  = НЕ ВсеПодразделения;
			
			ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаОстаткиСклады").Пометка = Истина;
		КонецЕсли;
		Элементы.СтраницыОстатки.ТекущаяСтраница = Элементы.СтраницаОстаткиСклады;
		
	ИначеЕсли ПереключательОстатки = 1 Тогда
		Если ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаПартии").Пометка = Ложь Тогда
			Партии.Отбор.Элементы.Очистить();
			ЭлементОтбора = Партии.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Номенклатура");
			ЭлементОтбора.Использование  = ИСТИНА;
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = ТекущаяСтрока;
			// Профильтруем еще по характеристике, если мы находимся на странице ее выбора.
			Если ЗначениеЗаполнено(ТекущаяХарактеристика) Тогда
				ЭлементОтбора = Партии.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ХарактеристикаНоменклатуры");
				ЭлементОтбора.Использование  = ИСТИНА;
				ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение = ТекущаяХарактеристика;
			КонецЕсли;
			ЛевоеЗначениеОстаткиПоПартиям = Новый ПолеКомпоновкиДанных("Партия.ПодразделениеКомпании");
			ОтборПоПартиям = Партии.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборПоПартиям.ЛевоеЗначение = ЛевоеЗначениеОстаткиПоПартиям;
			ОтборПоПартиям.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВИерархии;
			ОтборПоПартиям.ПравоеЗначение = ПодразделениеКомпанииПользователя;
			ОтборПоПартиям.Использование  =НЕ ВсеПодразделения;

			ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаПартии").Пометка = Истина;
		КонецЕсли;
		Элементы.СтраницыОстатки.ТекущаяСтраница = Элементы.СтраницаПартии;
		
	ИначеЕсли ПереключательОстатки = 2 Тогда
		Если ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаОстаткиПоЯчейкам").Пометка = Ложь Тогда
			ОстаткиПоЯчейкам.Отбор.Элементы.Очистить();
			ЭлементОтбора = ОстаткиПоЯчейкам.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Номенклатура");
			ЭлементОтбора.Использование  = ИСТИНА;
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = ТекущаяСтрока;
			// Профильтруем еще по характеристике, если мы находимся на странице ее выбора.
			Если ЗначениеЗаполнено(ТекущаяХарактеристика) Тогда
				ЭлементОтбора = ОстаткиПоЯчейкам.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ХарактеристикаНоменклатуры");
				ЭлементОтбора.Использование  = ИСТИНА;
				ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение = ТекущаяХарактеристика;
			КонецЕсли;
			ЛевоеЗначениеОстаткиПоПартиям = Новый ПолеКомпоновкиДанных("СкладКомпании.ПодразделениеКомпании");
			ОтборПоПартиям = ОстаткиПоЯчейкам.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборПоПартиям.ЛевоеЗначение = ЛевоеЗначениеОстаткиПоПартиям;
			ОтборПоПартиям.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВИерархии;
			ОтборПоПартиям.ПравоеЗначение = ПодразделениеКомпанииПользователя;
			ОтборПоПартиям.Использование  =НЕ ВсеПодразделения;

			ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаОстаткиПоЯчейкам").Пометка = Истина;
		КонецЕсли;
		Элементы.СтраницыОстатки.ТекущаяСтраница = Элементы.СтраницаОстаткиПоЯчейкам;
		
	ИначеЕсли ПереключательОстатки = 3 Тогда
		Если ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаМинимальныеОстатки").Пометка = Ложь Тогда
			МинимальныеОстатки.Отбор.Элементы.Очистить();
			ЭлементОтбора = МинимальныеОстатки.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Номенклатура");
			ЭлементОтбора.Использование  = ИСТИНА;
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = ТекущаяСтрока;
			
			ЭлементОтбора = МинимальныеОстатки.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПодразделениеКомпании");
			ЭлементОтбора.Использование  = ИСТИНА;
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВИерархии;
			ЭлементОтбора.ПравоеЗначение = ПодразделениеКомпанииПользователя;
			ЭлементОтбора.Использование  =НЕ ВсеПодразделения;
			
			ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаМинимальныеОстатки").Пометка = Истина;
		КонецЕсли;
		Элементы.СтраницыОстатки.ТекущаяСтраница = Элементы.СтраницаМинимальныеОстатки;
	КонецЕсли;
	
КонецПроцедуры // ПереключательОстаткиПриИзменении()

// Обработчик события возникающего на клиенте при изменении переключателя "Аналоги".
//
// Параметры:
//  Элемент - Переключатель - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПереключательАналогиПриИзменении(Элемент)
	
	Если ПереключательАналоги = 0 Тогда
		Если ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницыАналогиНоменклатуры").Пометка = Ложь Тогда
			ОбработатьАктивизациюСтрокиСпискаНаСервере();
			ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницыАналогиНоменклатуры").Пометка = Истина;
		КонецЕсли;
		Элементы.СтраницыАналоги.ТекущаяСтраница = Элементы.СтраницаАналогиНоменклатуры;
	ИначеЕсли ПереключательАналоги = 1 Тогда
		Если ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЗамены").Пометка = Ложь Тогда
			ЗагрузитьЗамены();
			ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЗамены").Пометка = Истина;
		КонецЕсли;
		Элементы.СтраницыАналоги.ТекущаяСтраница = Элементы.СтраницаЗамены;
	КонецЕсли;
	
КонецПроцедуры // ПереключательАналогиПриИзменении()

// Обработчик события возникающего на клиенте при изменении переключателя "Цены".
//
// Параметры:
//  Элемент - Переключатель - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПереключательЦеныПриИзменении(Элемент)
	
	Если ПереключательЦены = 0 Тогда
		Если ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныКомпании").Пометка = Ложь Тогда
			Цены.Очистить();
			ЗагрузитьЦены();
			ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныКомпании").Пометка = Истина;
		КонецЕсли;
		Элементы.СтраницыЦены.ТекущаяСтраница = Элементы.СтраницаЦеныКомпании;
		
	ИначеЕсли ПереключательЦены = 1 Тогда
		Если ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныКонтрагентов").Пометка = Ложь Тогда
			ЦеныКонтрагентов.Очистить();
			ЗагрузитьЦеныКонтрагентов();
			ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныКонтрагентов").Пометка = Истина;
		КонецЕсли;
		Элементы.СтраницыЦены.ТекущаяСтраница = Элементы.СтраницаЦеныКонтрагентов;
		
	ИначеЕсли ПереключательЦены = 2 Тогда
		Если ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаПрайсЛистыКонтрагентов").Пометка = Ложь Тогда
			//ОбработатьАктивизациюСтрокиСпискаНаСервере();
			ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаПрайсЛистыКонтрагентов").Пометка = Истина;
		КонецЕсли;
		Элементы.СтраницыЦены.ТекущаяСтраница = Элементы.СтраницаПрайсЛистыКонтрагентов;
		
	ИначеЕсли ПереключательЦены = 3 Тогда
		Если ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныСогласованные").Пометка = Ложь Тогда
			ЦеныСогласованные.Очистить();
			ЗагрузитьЦеныСогласованные();
			ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныСогласованные").Пометка = Истина;
		КонецЕсли;
		Элементы.СтраницыЦены.ТекущаяСтраница = Элементы.СтраницаЦеныСогласованные;
		
	ИначеЕсли ПереключательЦены = 4 Тогда
		Если ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныПоГруппамПоставки").Пометка = Ложь Тогда
			ЦеныПоГруппамПоставки.Очистить();
			ЗагрузитьЦеныПоГруппамПоставки();
			ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныПоГруппамПоставки").Пометка = Истина;
		КонецЕсли;
		Элементы.СтраницыЦены.ТекущаяСтраница = Элементы.СтраницаЦеныПоГруппамПоставки;
		
	ИначеЕсли ПереключательЦены = 5 Тогда
		Если ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныУценки").Пометка = Ложь Тогда
			ЦеныУценкаТовара.Очистить();
			ЗагрузитьЦеныУценки();
			ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныУценки").Пометка = Истина;
		КонецЕсли;
		Элементы.СтраницыЦены.ТекущаяСтраница = Элементы.СтраницаЦеныУценки;
		
	КонецЕсли;
	//ВсеПодразделенияЦеныПриИзменении();
	//ОбработатьАктивизациюСтрокиСпискаНаСервере();
	
КонецПроцедуры // ПереключательЦеныПриИзменении()

// Обработчик события возникающего на клиенте при изменении переключателя "Заказы".
//
// Параметры:
//  Элемент - Переключатель - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПереключательЗаказыПриИзменении(Элемент)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		ТекущаяНоменклатура = Неопределено;
		ТекущаяХарактеристика = Неопределено;
	ИначеЕсли Элементы.СтраницыСписки.ТекущаяСтраница = Элементы.СтраницаХарактеристики Тогда
		ТекущаяНоменклатура = ЭтотОбъект.ВыбраннаяНоменклатура;
		ТекущаяХарактеристика = Элементы.Характеристики.ТекущиеДанные.ХарактеристикаНоменклатуры;
	Иначе
		ТекущаяНоменклатура = Элементы.Список.ТекущаяСтрока;
		ТекущаяХарактеристика = Неопределено;
	КонецЕсли;
	
	Если ПереключательЗаказы = 1 Тогда
		Если ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЗаказыПоставщикам").Пометка = Ложь Тогда
			ЗаказыПоставщикам.Отбор.Элементы.Очистить();
			ЭлементОтбора = ЗаказыПоставщикам.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Номенклатура");
			ЭлементОтбора.Использование  = ИСТИНА;
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = ТекущаяНоменклатура;
			// Профильтруем еще по характеристике, если мы находимся на странице ее выбора.
			Если ЗначениеЗаполнено(ТекущаяХарактеристика) Тогда
				ЭлементОтбора = ЗаказыПоставщикам.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ХарактеристикаНоменклатуры");
				ЭлементОтбора.Использование  = ИСТИНА;
				ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение = ТекущаяХарактеристика;
			КонецЕсли;
			ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЗаказыПоставщикам").Пометка = Истина;
		КонецЕсли;
		Элементы.СтраницыЗаказы.ТекущаяСтраница = Элементы.СтраницаЗаказыПоставщикам;
		
	ИначеЕсли ПереключательЗаказы = 0 Тогда
		Если ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЗаказыПокупателей").Пометка = Ложь Тогда
			ЗаказыПокупателей.Отбор.Элементы.Очистить();
			ЭлементОтбора = ЗаказыПокупателей.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Номенклатура");
			ЭлементОтбора.Использование  = ИСТИНА;
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = ТекущаяНоменклатура;
			// Профильтруем еще по характеристике, если мы находимся на странице ее выбора.
			Если ЗначениеЗаполнено(ТекущаяХарактеристика) Тогда
				ЭлементОтбора = ЗаказыПокупателей.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ХарактеристикаНоменклатуры");
				ЭлементОтбора.Использование  = ИСТИНА;
				ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение = ТекущаяХарактеристика;
			КонецЕсли;
			ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЗаказыПокупателей").Пометка = Истина;
		КонецЕсли;
		Элементы.СтраницыЗаказы.ТекущаяСтраница = Элементы.СтраницаЗаказыПокупателей;
		
	КонецЕсли;
	
КонецПроцедуры // ПереключательЗаказыПриИзменении()


//тк+
// Процедура для вывода скидок по текущей позиции списка номенклатуры
&НаКлиенте
Процедура ЗаполнитьСкидки()
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		ТекущаяНоменклатура = Неопределено;
	ИначеЕсли Элементы.СтраницыСписки.ТекущаяСтраница = Элементы.СтраницаХарактеристики Тогда
		ТекущаяНоменклатура = ЭтотОбъект.ВыбраннаяНоменклатура;
	Иначе
		ТекущаяНоменклатура = Элементы.Список.ТекущаяСтрока;
	КонецЕсли;
	
	
	СписокСкидки.Отбор.Элементы.Очистить();
	ПоляОтбора = СписокСкидки.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
	
	// Добавим в отбор номенклатуру
	ЭлементОтбора = ПоляОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Номенклатура");
	ЭлементОтбора.Использование  = ИСТИНА;
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ТекущаяНоменклатура;
	
	ПоляОтбора = СписокСкидки.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
	//ПоляОтбора = СписокСкидки.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;

	ЛевоеЗначениеОстаткиПоСкидкам = Новый ПолеКомпоновкиДанных("Подразделение");
	ОтборПоСкидкам = ПоляОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоСкидкам.ЛевоеЗначение  = ЛевоеЗначениеОстаткиПоСкидкам;
	ОтборПоСкидкам.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВИерархии;
	ОтборПоСкидкам.ПравоеЗначение = ПодразделениеКомпанииПользователя;
	ОтборПоСкидкам.Использование  = НЕ ВсеПодразделения;

		
КонецПроцедуры // ЗаполнитьСкидки()

&НаСервере
Процедура ЗаполнитьНаценкиНаСервере(ТекущаяНоменклатура)
	
	РекомендуемыеНаценки = ЦенообразованиеСервер.ЗаполнитьТаблицуНаценок(ТекущаяНоменклатура);
	
	Для Каждого СтрокаНаценки Из РекомендуемыеНаценки Цикл
		НоваяСтрока = Наценки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНаценки);
	КонецЦикла;
	
КонецПроцедуры

//тк+
// Процедура для вывода рекомендуемых наценок по текущей позиции списка номенклатуры
&НаКлиенте
Процедура ЗаполнитьНаценки()
	
	Наценки.Очистить();
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	ИначеЕсли Элементы.СтраницыСписки.ТекущаяСтраница = Элементы.СтраницаХарактеристики Тогда
		ТекущаяНоменклатура = ЭтотОбъект.ВыбраннаяНоменклатура;
	Иначе
		ТекущаяНоменклатура = Элементы.Список.ТекущаяСтрока;
	КонецЕсли;
	
	ЗаполнитьНаценкиНаСервере(ТекущаяНоменклатура);
	
КонецПроцедуры // ЗаполнитьСкидки()

// Процедура для вывода штрихкода по текущей позиции списка номенклатуры
&НаКлиенте	
Процедура ЗаполнитьШтрихкоды()
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	ИначеЕсли Элементы.СтраницыСписки.ТекущаяСтраница = Элементы.СтраницаХарактеристики Тогда
		ТекущаяНоменклатура = ЭтотОбъект.ВыбраннаяНоменклатура;
	Иначе
		ТекущаяНоменклатура = Элементы.Список.ТекущаяСтрока;
	КонецЕсли;
	
	Штрихкоды.Отбор.Элементы.Очистить();
	ПоляОтбора = Штрихкоды.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
	
	// Добавим в отбор номенклатуру
	ЭлементОтбора = ПоляОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Номенклатура");
	ЭлементОтбора.Использование  = ИСТИНА;
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ТекущаяНоменклатура;
	
КонецПроцедуры //ЗаполнитьШтрихкоды()
//тк-

// Обработчик события возникающего на клиенте  при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Партии".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ПартииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Партии.ТекущиеДанные;
	ТипДокумента = СтрЗаменить(ТипЗнч(ТекущиеДанные.Партия), " ", "");
	ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Партия);
	
	// Необходимо для корректного сообщения в режиме ограниченного доступа.
	Попытка
		ОткрытьФорму("Документ."+ТипДокумента+".ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Исключение
		ТекстОшибки=ИнформацияОбОшибке();
		Если ТекстОшибки.Причина.Описание= НСтр("ru = 'Недостаточно прав для просмотра'") 
			ИЛИ ТекстОшибки.Причина.Описание = 
					НСтр("ru = 'У пользователя недостаточно прав на исполнение операции над базой данных.'") Тогда
			
			ВывестиСообщение(ТекстОшибки.Причина.Описание);
		Иначе
			ВызватьИсключение;
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры // ПартииВыбор()

// Обработчик события возникающего на клиенте  при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Остатки".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ОстаткиПоСкладамВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка=Ложь;
	
	// фильтры
	ОтчетОтбор = Новый Структура;
	ОтчетОтбор.Вставить("СкладКомпании", Элементы.ОстаткиПоСкладам.ТекущиеДанные.СкладКомпании);
	ОтчетОтбор.Вставить("Номенклатура",  Элементы.Список.ТекущиеДанные.Ссылка);
	
	НастройкиВарианта = ПолучитьНастройкуОтчета("ОстаткиИОборотыТоваров");
	
	ОтчетыПлатформаКлиент.ОткрытьОтчет("Отчет.ОстаткиИОборотыТоваров", "Остатки", НастройкиВарианта,,, ОтчетОтбор, , ОбщегоНазначенияКлиент.ДатаСеанса());
	
КонецПроцедуры // ОстаткиПоСкладамВыбор()

// Обработчик события возникающего на клиенте  при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Остатки
// по ячейкам".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ОстаткиПоЯчейкамВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	// фильтры
	ОтчетОтбор = Новый Структура;
	ОтчетОтбор.Вставить("СкладКомпании", Элементы.ОстаткиПоЯчейкам.ТекущиеДанные.СкладКомпании);
	ОтчетОтбор.Вставить("Номенклатура",  Элементы.Список.ТекущиеДанные.Ссылка);
	
	НастройкиВарианта = ПолучитьНастройкуОтчета("ОстаткиИОборотыТоваровОрдерногоСклада");
	
	ОтчетыПлатформаКлиент.ОткрытьОтчет("Отчет.ОстаткиИОборотыТоваровОрдерногоСклада", "Остатки", НастройкиВарианта,,, ОтчетОтбор, , ОбщегоНазначенияКлиент.ДатаСеанса());
	
КонецПроцедуры // ОстаткиПоЯчейкамВыбор()

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Заказы покупателей".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ЗаказыПокупателейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ЗаказыПокупателей.ТекущиеДанные;
	ТипДокумента = СтрЗаменить(ТипЗнч(ТекущиеДанные.Заказ), " ", "");
	ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Заказ);
	
	// необходимо для корректного сообщения в режиме ограниченного доступа
	Попытка
		ОткрытьФорму("Документ."+ТипДокумента+".ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Исключение
		ТекстОшибки=ИнформацияОбОшибке();
		Если ТекстОшибки.Причина.Описание= НСтр("ru = 'Недостаточно прав для просмотра'")
			ИЛИ ТекстОшибки.Причина.Описание = 
					НСтр("ru = 'У пользователя недостаточно прав на исполнение операции над базой данных.'") Тогда
					
			ВывестиСообщение(ТекстОшибки.Причина.Описание);
		Иначе
			ВызватьИсключение;
		КонецЕсли;
	КонецПопытки;

КонецПроцедуры // ЗаказыПокупателейВыбор()

// Обработчик события возникающего на клиенте  при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Заказы поставщикам".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ЗаказыПоставщикамВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ЗаказыПоставщикам.ТекущиеДанные;
	ТипДокумента = СтрЗаменить(ТипЗнч(ТекущиеДанные.Заказ), " ", "");
	ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Заказ);
	
	// необходимо для корректного сообщения в режиме ограниченного доступа
	Попытка
		ОткрытьФорму("Документ."+ТипДокумента+".ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Исключение
		ТекстОшибки=ИнформацияОбОшибке();
		Если ТекстОшибки.Причина.Описание= НСтр("ru = 'Недостаточно прав для просмотра'")
			ИЛИ ТекстОшибки.Причина.Описание = 
				НСтр("ru = 'У пользователя недостаточно прав на исполнение операции над базой данных.'") Тогда
			
			ВывестиСообщение(ТекстОшибки.Причина.Описание);
		Иначе
			ВызватьИсключение;
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры // ЗаказыПоставщикамВыбор()

// Обработчик события возникающего на клиенте  при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Цены компании".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ТабличноеПолеЦеныВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Цены.ТекущиеДанные;
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("ТипЦен",                     ТекущиеДанные.ТипЦен);
	ПараметрыОтбора.Вставить("ХарактеристикаНоменклатуры", ТекущиеДанные.Характеристика);
	ПараметрыОтбора.Вставить("ПодразделениеКомпании",      ТекущиеДанные.Подразделение);
	ПараметрыОтбора.Вставить("ЕдиницаИзмерения",           ТекущиеДанные.ЕдиницаИзмерения);
	ПараметрыОтбора.Вставить("Номенклатура",               Элементы.Список.ТекущиеДанные.Ссылка);
	ОткрытьФорму("РегистрСведений.Цены.ФормаСписка", Новый Структура("Отбор", ПараметрыОтбора), ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ТабличноеПолеЦеныВыбор()

// Обработчик события возникающего на клиенте  при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Цены контрагентов".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ТабличноеПолеЦеныКонтрагентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ЦеныКонтрагентов.ТекущиеДанные;
	ПараметрыОтбора = Новый Структура("ТипЦен,Контрагент,ДоговорВзаиморасчетов", ТекущиеДанные.ТипЦен, ТекущиеДанные.Контрагент, ТекущиеДанные.ДоговорВзаиморасчетов);
	ОткрытьФорму("РегистрСведений.Цены.ФормаСписка", Новый Структура("Отбор", ПараметрыОтбора), ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ТабличноеПолеЦеныКонтрагентовВыбор()

// Обработчик события возникающего на клиенте  при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Цены Согласованные".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ТабличноеПолеЦеныСогласованныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ЦеныСогласованные.ТекущиеДанные;
	ПараметрыОтбора = Новый Структура("Контрагент,ПодразделениеКомпании, СрокДействия", ТекущиеДанные.Контрагент, ТекущиеДанные.ПодразделениеКомпании, ТекущиеДанные.СрокДействия);
	ОткрытьФорму("РегистрСведений.СогласованныеЦены.ФормаСписка", Новый Структура("Отбор", ПараметрыОтбора), ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //ТабличноеПолеЦеныСогласованныеВыбор()

// Обработчик события возникающего на клиенте  при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Цены по Группам поставки".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ТабличноеПолеЦеныПоГруппамПоставкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ЦеныПоГруппамПоставки.ТекущиеДанные;
	ПараметрыОтбора = Новый Структура("Номенклатура,Контрагент,ГруппаПоставки,СрокДействия", Элементы.Список.ТекущиеДанные.Ссылка, ТекущиеДанные.Контрагент, ТекущиеДанные.ГруппаПоставки, ТекущиеДанные.СрокДействия);
	ОткрытьФорму("РегистрСведений.СогласованныеЦены.ФормаСписка", Новый Структура("Отбор", ПараметрыОтбора), ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //ТабличноеПолеЦеныСогласованныеВыбор()

// Обработчик события возникающего на клиенте  при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы
// "Аналоги" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервереБезКонтекста
Функция ПолучитьНоменклатуруИзКлючаЗаписи(ВыбраннаяСтрока)
	
	//НайденныйАналог = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", ВыбраннаяСтрока.Артикул);
	
	Возврат ВыбраннаяСтрока.Номенклатура;
	
КонецФункции // АналогиВыборНаСервере()

// Обработчик события возникающего на клиенте  при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Аналоги".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура АналогиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка=Ложь;
	
	Номенклатура = ПолучитьНоменклатуруИзКлючаЗаписи(ВыбраннаяСтрока);
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Список.ТекущаяСтрока = Номенклатура;
	
КонецПроцедуры // АналогиВыбор()

// Обработчик события возникающего на клиенте  при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы
// "Замены" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Функция ЗаменыВыборНаСервере(ВыбраннаяСтрока, ПараметрыДействия = Неопределено)
	
	НайденныйАналог = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", ВыбраннаяСтрока.Артикул);
	
	Возврат НайденныйАналог;
	
КонецФункции // ЗаменыВыборНаСервере()

// Обработчик события возникающего на клиенте  при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Замены
// новые" или "Замены старые".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ЗаменыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	// Обработаем событие в контексте сервера
	НайденнаяЗамена = ЗаменыВыборНаСервере(Элемент.ТекущиеДанные.Номенклатура);
	
	// При выборе строки нет соответствующей номенклатуры в справочнике
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Номенклатура) Тогда
		ОбработкаОповещения = Новый ОписаниеОповещения("ДобавлениеЗамены", ЭтотОбъект, Новый Структура("ДобавлениеНоменклатуры", Элемент.ТекущиеДанные));
		ПоказатьВопрос(ОбработкаОповещения, НСтр("ru = 'Замены с данным номером по каталогу нет в справочнике номенклатуры.
		|
		|Добавить новый элемент справочника номенклатуры?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, НСтр("ru = 'Добавление номенклатуры'"));
		Возврат;
	КонецЕсли;
	
	Элементы.Список.ТекущаяСтрока = НайденнаяЗамена;
	
КонецПроцедуры // ЗаменыВыбор()

&НаКлиенте
Процедура ВсеПодразделенияОстаткиПриИзменении()
	
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СкладКомпании.ПодразделениеКомпании");
	Для Каждого ТекущийОтбор Из ОстаткиПоСкладам.Отбор.Элементы Цикл
		Если ТекущийОтбор.ЛевоеЗначение = ЛевоеЗначение Тогда
			ТекущийОтбор.Использование = НЕ (ВсеПодразделения);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партия.ПодразделениеКомпании");
	Для Каждого ТекущийОтбор Из Партии.Отбор.Элементы Цикл
		Если ТекущийОтбор.ЛевоеЗначение = ЛевоеЗначение Тогда
			ТекущийОтбор.Использование = НЕ (ВсеПодразделения);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СкладКомпании.ПодразделениеКомпании");
	Для Каждого ТекущийОтбор Из ОстаткиПоЯчейкам.Отбор.Элементы Цикл
		Если ТекущийОтбор.ЛевоеЗначение = ЛевоеЗначение Тогда
			ТекущийОтбор.Использование = НЕ (ВсеПодразделения);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПодразделениеКомпании");
	Для Каждого ТекущийОтбор Из МинимальныеОстатки.Отбор.Элементы Цикл
		Если ТекущийОтбор.ЛевоеЗначение = ЛевоеЗначение Тогда
			ТекущийОтбор.Использование = НЕ (ВсеПодразделения);
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВсеПодразделенияЦеныПриИзменении()
	
	Цены.Очистить();
	ЦеныУценкаТовара.Очистить();
	ЦеныПоГруппамПоставки.Очистить();
	ЦеныСогласованные.Очистить();
	ЦеныКонтрагентов.Очистить();
	
	ЗагрузитьЦены();
	ЗагрузитьЦеныУценки();
	ЗагрузитьЦеныКонтрагентов();
	ЗагрузитьЦеныСогласованные();
	ЗагрузитьЦеныПоГруппамПоставки();
	
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПрайсЛист.Подразделения.ПодразделениеКомпании");
	Для Каждого ТекущийОтбор Из ПрайсЛистыКонтрагентов.Отбор.Элементы Цикл
		Если ТекущийОтбор.ЛевоеЗначение = ЛевоеЗначение Тогда
			ТекущийОтбор.Использование = НЕ (ВсеПодразделения);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеПодразделенияСкидки()
	
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение");
	
	Для Каждого ТекущийОтбор Из СписокСкидки.Отбор.Элементы Цикл
		Если ТекущийОтбор.ЛевоеЗначение = ЛевоеЗначение Тогда
			ТекущийОтбор.Использование = НЕ ВсеПодразделения;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПодставитьЗначениеПодразделенияВФильтр()
	Если ЗначениеЗаполнено(ПодразделениеКомпанииПользователя) Тогда
		
		Элементы.ОтборПоПодразделениюПользователя.Заголовок = СтрЗаменить(Элементы.ОтборПоПодразделениюПользователя.Заголовок, "%1", ПодразделениеКомпанииПользователя.Наименование); 
		//НаименованиеПодразделения = ПодразделениеКомпанииПользователя.Наименование;
		//НаименованиеПодразделения = ?(СтрНайти(НаименованиеПодразделения," ")>0, "'"+НаименованиеПодразделения+"'",НаименованиеПодразделения);
		//ФорматРедактирования = Элементы.ВсеПодразделенияОстатки.ФорматРедактирования;
		//ФорматРедактирования = СтрЗаменить(ФорматРедактирования, "Подразделение", НаименованиеПодразделения);
		//Элементы.ВсеПодразделенияОстатки.ФорматРедактирования = ФорматРедактирования;
		//Элементы.ВсеПодразделенияЦены.ФорматРедактирования = ФорматРедактирования;
		//Элементы.ВсеПодразделенияСкидки.ФорматРедактирования = ФорматРедактирования;
	Иначе
		//Элементы.ВсеПодразделенияОстатки.Видимость = Ложь;
		//Элементы.ВсеПодразделенияЦены.Видимость = Ложь;
		//Элементы.ВсеПодразделенияСкидки.Видимость = Ложь;
		ВсеПодразделения = Истина;
		Элементы.ОтборПоПодразделениюПользователя.Видимость = Ложь; 
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПАНЕЛИ ПАРАМЕТРОВ

// перерасчет цен на сервере
//
&НаСервере
Процедура ПересчитатьЦеныКорзины()
	
	Если Этаформа.ПараметрыЗапрашиватьЦену = Истина Тогда 
		Возврат;
	КонецЕсли;	
	
	Для Каждого Строка Из Корзина Цикл
		Если ЗначениеЗаполнено(ПараметрыТипЦен) Тогда
			Строка.Цена  = ЦенообразованиеСервер.ПолучитьЦену(ПараметрыТипЦен, Строка.Номенклатура, ТекущаяДатаСеанса(), ПараметрыКонтрагент, ПараметрыВалюта, ПараметрыКурсВалюты, Строка.ХарактеристикаНоменклатуры, Строка.ЕдиницаИзмерения, ПараметрыПодразделениеКомпании);
			Строка.Сумма = Строка.Цена * Строка.Количество * Строка.Коэффициент;
		Иначе
			Строка.Цена  = 0;
			Строка.Сумма = 0;
		КонецЕсли;
	КонецЦикла;
	
	РассчитатьПодвалКорзины();
	
КонецПроцедуры // ПересчитатьЦеныКорзины()

// Обработчик изменения подразделения компании на сервере
//
&НаСервере
Процедура ПараметрыПодразделениеКомпанииПриИзмененииНаСервере()
	
	УстановитьПараметрыВыводаКолонкиОстатокНаСкладе();
	
	Если Элементы.СтраницаКорзина.Видимость Тогда
		ПересчитатьЦеныКорзины();
	КонецЕсли;
	
КонецПроцедуры

// Обработчик изменения подразделения компании
//
&НаКлиенте
Процедура ПараметрыПодразделениеКомпанииПриИзменении(Элемент)
	
	ПараметрыПодразделениеКомпанииПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКонтрагентПриИзменении(Элемент)
	
	Если Элементы.СтраницаКорзина.Видимость Тогда
		ПересчитатьЦеныКорзины();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыВалютаПриИзменении(Элемент)
	
	Если Элементы.СтраницаКорзина.Видимость Тогда
		ПересчитатьЦеныКорзины();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыТипЦенПриИзменении(Элемент)
	
	Если Элементы.СтраницаКорзина.Видимость Тогда
		ПересчитатьЦеныКорзины();
	КонецЕсли;
	
КонецПроцедуры

// Обработчик изменения склада компании
//
&НаКлиенте
Процедура ПараметрыСкладКомпанииПриИзменении(Элемент)
	
	УстановитьПараметрыВыводаКолонкиОстатокНаСкладе();
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении переключателя "Режим отображения остатков".
//
// Параметры:
//  Элемент - Переключатель - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПараметрыРежимВыводаОстатковПриИзменении(Элемент)
	
	УстановитьПараметрыВыводаКолонкиОстатокНаСкладе();
	
КонецПроцедуры // ПараметрыРежимВыводаОстатковПриИзменении()

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии Enter) в ячейке таблицы "Список".
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока      - Ссылка       - Значение выбранной строки.
//  Поле                 - ПолеФормы    - Активное поле.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.СтраницаКорзина.Видимость И НЕ (ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") ИЛИ Элементы.Список.ТекущиеДанные.ЭтоГруппа) Тогда
		
		СтандартнаяОбработка = Ложь;
		Модифицированность = Истина;
		Если Элементы.Список.ТекущиеДанные.ВладелецХарактеристики=Неопределено Тогда
			ОбработкаПодбораТовараВКорзину(Элементы.Список.ТекущиеДанные.Ссылка,, Элементы.Корзина.ТекущаяСтрока);
		Иначе
			Если ВидДоговораПродажа Тогда
				Если ПоверкаАвтомотическоеСписаниеХарактеристик(Элементы.Список.ТекущаяСтрока) Тогда
					УстановитьРежимВыбораХарактеристик(ИСТИНА, Элементы.Список.ТекущаяСтрока);
				Иначе
					ОбработкаПодбораТовараВКорзину(Элементы.Список.ТекущиеДанные.Ссылка,, Элементы.Корзина.ТекущаяСтрока);
				КонецЕсли;
			Иначе
				УстановитьРежимВыбораХарактеристик(ИСТИНА, Элементы.Список.ТекущаяСтрока);
			КонецЕсли;
		КонецЕсли;
	Иначе
		// Вызываем общий обработчик события
		УправлениеСпискомСправочникаКлиент.СписокВыбор(ЭтотОбъект, Элемент, Элементы.Список.ТекущиеДанные.Ссылка, Поле, СтандартнаяОбработка);
		
	КонецЕсли;
КонецПроцедуры // СписокВыбор()

&НаСервере
Функция ПоверкаАвтомотическоеСписаниеХарактеристик(Элемент)
	
	Если Элемент.ТипНоменклатуры.АвтоСписаниеХарактеристик = Перечисления.РежимыАвтоСписанияХарактеристик.РучноеСписание Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если РежимПодбора Тогда
		СтандартнаяОбработка = Ложь;
		Модифицированность = Ложь;
		Закрыть(ПодготовитьСписокПодобранныхТоваров());
	КонецЕсли;
	
КонецПроцедуры // СписокВыборЗначения()

// Обработчик события возникающего на клиенте при активизации строки списка с задержкой в контексте сервера.
//
&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере()
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриАктивизацииСтроки(ЭтотОбъект, Элементы.Список);
	
	// + Конов
	СравнитьСтрокиПоИерархии();
	// - Конов
КонецПроцедуры // СписокПриАктивизацииСтрокиНаСервере()

// Обработчик события возникающего на клиенте при активизации строки списка выполняемый с задержкой.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_СписокПриАктивизацииСтроки()
	
	ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаОстаткиСклады")         .Пометка = Ложь;
	ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаПартии")                .Пометка = Ложь;
	ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЗаказыПокупателей")     .Пометка = Ложь;
	ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЗаказыПоставщикам")     .Пометка = Ложь;
	ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаОстаткиПоЯчейкам")      .Пометка = Ложь;
	ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаМинимальныеОстатки")    .Пометка = Ложь;
	ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницыАналогиНоменклатуры")   .Пометка = Ложь;
	ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныКомпании")          .Пометка = Ложь;
	ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныКонтрагентов")      .Пометка = Ложь;
	ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныСогласованные")     .Пометка = Ложь;
	ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныПоГруппамПоставки") .Пометка = Ложь;
	ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаПрайсЛистыКонтрагентов").Пометка = Ложь;
	ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаАссортимент")           .Пометка = Ложь;
	ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныУценки")            .Пометка = Ложь;
	
	Если ЭтотОбъект.ОбновлениеЗамен И (НЕ ЭтотОбъект.ТекущийЭлемент = Неопределено) И ЕстьРеквизитНаКлиенте(ЭтотОбъект.ТекущийЭлемент, "Имя") И СтрНайти(ЭтотОбъект.ТекущийЭлемент.Имя, "Замены") = 0 Тогда
		ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЗамены")            .Пометка = Ложь;
	КонецЕсли;
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено И Элементы.Список.ТекущиеДанные.Свойство("Ссылка") Тогда
		Оповестить("АктивизацияСтрокиНоменклатуры", Элементы.Список.ТекущиеДанные.Ссылка, ЭтотОбъект);
	Иначе
		Оповестить("АктивизацияСтрокиНоменклатуры", Элементы.Список.ТекущиеДанные, ЭтотОбъект);
	КонецЕсли;
	
	СтраницыПриСменеСтраницы(Элементы.СтраницыРасширеннаяИнформация, Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница);
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элементы.Список, ИСТИНА) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	СписокПриАктивизацииСтрокиНаСервере();
	
КонецПроцедуры // Подключаемый_СписокПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
	//тк+
	//СписокСкидки.Параметры.УстановитьЗначениеПараметра("НаДату",ТекущаяДата());
	//СписокСкидки.Параметры.УстановитьЗначениеПараметра("Номенклатура",Элементы.Список.ТекущаяСтрока);
	//тк-
КонецПроцедуры // СписокПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПриАктивизацииЯчейки(ЭтотОбъект, Элемент);
	Элементы.СписокПоискПоТекущемуЗначению1.Доступность = НЕ (Элемент.ТекущиеДанные=Неопределено ИЛИ Элемент.ТекущийЭлемент=Неопределено ИЛИ Элемент.ТекущиеДанные.Свойство("ГруппировкаСтроки") И Элемент.ТекущиеДанные.ГруппировкаСтроки <> Неопределено);
	
КонецПроцедуры // СписокПриАктивизацииЯчейки()

// Обработчик события возникающего на клиенте перед добавления строки в таблицу "Список".
//
// Параметры:
//  Элемент     - ПолеФормы    - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от добавления объекта.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Неопределено; СправочникСсылка.<Имя справочника>; ПланСчетовСсылка.<Имя плана счетов>
//                             - Ссылка на элемент, который будет использован при добавлении в качестве родителя. 
//  ЭтоГруппа   - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	УправлениеСпискомСправочникаКлиент.СписокПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры // СписокПередНачаломДобавления

// Обработчик события возникающего на клиенте перед началом изменения списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от действия.
//
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	УправлениеСпискомСправочникаКлиент.СписокПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // СписокПередНачаломИзменения()

// Обработчик события возникающего на клиенте после удаления строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПослеУдаления(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПослеУдаления()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	
	//// Сменим родителя в основном списке
	//Если Элементы.СтраницыСписки.ТекущаяСтраница = Элементы.СтраницаСписок Тогда
	//	Если Элементы.Дерево.ТекущаяСтрока=Элементы.Список.ТекущийРодитель Тогда
	//		// Пропустим если равны
	//	ИначеЕсли НЕ ЗначениеЗаполнено(Элементы.Список.ТекущийРодитель) И НЕ ЗначениеЗаполнено(Элементы.Дерево.ТекущаяСтрока) Тогда
	//		// Пропустим если оба пустые (могут быть Неопределено)
	//	Иначе
	Если итИспользоватьАльтернативнуюИерархию Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ДопИерархия", Элементы.ДеревоДопИерархия.ТекущаяСтрока);
	КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры // ДеревоПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при изменении текущего родителя в режиме иерархического списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриСменеТекущегоРодителя(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПриСменеТекущегоРодителя(ЭтотОбъект, Элемент);
	
	// Если произвели переход в группу, то необходимо поменять текущий элемент в дереве.
	Если НЕ Элементы.Список.ТекущийРодитель=Элементы.Дерево.ТекущаяСтрока Тогда
		Элементы.Дерево.ТекущаяСтрока = Элементы.Список.ТекущийРодитель;
	КонецЕсли;
	
КонецПроцедуры // СписокПриСменеТекущегоРодителя()

// Обработчик события возникающего при сохранении пользовательских настроек в контексте сервера.
// 
// Параметры:
//  Элемент   - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Сохраняемые настройки. 
//
&НаСервере
Процедура СписокПриСохраненииПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // СписокПриСохраненииПользовательскихНастроекНаСервере()

// Обработчик события возникающего при восстановлении пользовательских настроек в контексте сервера.
// 
// Параметры:
//  Элемент   - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Восстанавливаемые настройки. 
//
&НаСервере
Процедура СписокПриЗагрузкеПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриЗагрузкеПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // СписокПриЗагрузкеПользовательскихНастроекНаСервере()

// Обработчик события возникающего на сервере при обновлении пользовательских настроек списка.
//
// Параметры:
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры // СписокПриОбновленииСоставаПользовательскихНастроекНаСервере()

// Обработчик события вызывается на сервере после получения данных динамическим списком.
//
// Параметры:
//  ИмяЭлемента - Строка - Содержит имя таблицы формы, из которой вызван обработчик события.
//  Настройки   - НастройкиКомпоновкиДанных - Содержит копию полных настроек динамического списка.
//  Строки      - СтрокиДинамическогоСписка - Данные и оформление всех строк, получаемых в списке.
//
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры // СписокПриПолученииДанныхНаСервере()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент                 - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - Содержит перетаскиваемое значение, тип действия и возможные действия при перетаскивании.
//  СтандартнаяОбработка    - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                  - Содержит порядковый номер строки или ссылку на текущий объект.
//  Поле                    - Поле, с которым связана данная колонка таблицы, над которой находится объект.
//
&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // СписокПроверкаПеретаскивания()

// Обработчик события возникающего на клиенте при окончании перетаскивания в поле-приемнике данных.
//
// Параметры:
//  Элемент                 - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - Содержит перетаскиваемое значение, тип действия и возможные действия при перетаскивании.
//  СтандартнаяОбработка    - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                  - Содержит порядковый номер строки или ссылку на текущий объект.
//  Поле                    - Поле, с которым связана данная колонка таблицы, над которой находится объект.
//
&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // СписокПеретаскивание()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДИНАМИЧЕСКОГО СПИСКА "ХАРАКТЕРИСТИКИ"

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии Enter) в ячейке таблицы "Характеристики".
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока      - Ссылка       - Значение выбранной строки.
//  Поле                 - ПолеФормы    - Активное поле.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ХарактеристикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ХарактеристикаНоменклатуры) Тогда
		
		ОбработкаПодбораТовараВКорзину(ЭтотОбъект.ВыбраннаяНоменклатура, Элемент.ТекущиеДанные.ХарактеристикаНоменклатуры, Элементы.Корзина.ТекущаяСтрока);
		
	ИначеЕсли  ВРег(Элемент.ТекущиеДанные.Наименование) = ВРег("<Пропустить выбор характеристики>") Тогда
		
		ОбработкаПодбораТовараВКорзину(ЭтотОбъект.ВыбраннаяНоменклатура, Элемент.ТекущиеДанные.ХарактеристикаНоменклатуры, Элементы.Корзина.ТекущаяСтрока);
		УстановитьРежимВыбораХарактеристик(ЛОЖЬ, Элементы.Список.ТекущаяСтрока, Элементы.Дерево.ТекущаяСтрока);
		
	Иначе
		
		УстановитьРежимВыбораХарактеристик(ЛОЖЬ, Элементы.Список.ТекущаяСтрока, Элементы.Дерево.ТекущаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры // ХарактеристикиВыбор()

&НаКлиенте
Процедура ХарактеристикиВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка);
	
КонецПроцедуры // ХарактеристикиВыборЗначения()

// Обработчик события возникающего на клиенте при активизации строки списка выполняемый с задержкой.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ХарактеристикиПриАктивизацииСтроки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "КОРЗИНА"

&НаСервере
Процедура КорзинаНоменклатураПриИзмененииНаСервере(Строка)
	
	ИспользованиеХарактеристик   = Строка.Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик;
	ИспользованиеЕдиницИзмерения = Строка.Номенклатура.ТипНоменклатуры.ИспользованиеЕдиницИзмерения;
	
	Если ИспользованиеХарактеристик = 1 Тогда
		Строка.ВладелецХарактеристики = Строка.Номенклатура.ТипНоменклатуры;
	ИначеЕсли ИспользованиеХарактеристик = 2 Тогда
		Строка.ВладелецХарактеристики = Строка.Номенклатура;
	Иначе
		Строка.ВладелецХарактеристики = Неопределено;
	КонецЕсли;
	
	Если ИспользованиеЕдиницИзмерения = 1 Тогда
		Строка.ВладелецЕдиницыИзмерения = Строка.Номенклатура.ТипНоменклатуры;
	ИначеЕсли ИспользованиеЕдиницИзмерения = 2 Тогда
		Строка.ВладелецЕдиницыИзмерения = Строка.Номенклатура;
	Иначе
		Строка.ВладелецЕдиницыИзмерения = Неопределено;
	КонецЕсли;
	
	// Получим количество товара в базовых единицах
	КоличествоБазовое = Строка.Количество*Строка.Коэффициент;
	
	// Проверим и сообщим пользователю, если что-то не так
	Если КоличествоБазовое > 1 И Строка.Номенклатура.ТипНоменклатуры.УникальностьСерийногоНомера Тогда
		Строка.Количество       = 1;
		Строка.ЕдиницаИзмерения = Строка.Номенклатура.ОсновнаяЕдиницаИзмерения;
		Строка.Коэффициент      = Строка.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент;
		ВывестиСообщение(НСтр("ru = 'Номенклатура ""%1"" учитывается по уникальным серийным номерам. Количество не может превышать 1 базовую единицу.'"), ЭтотОбъект, "Корзина[#].Номенклатура", Корзина.Индекс(Строка)+1,, Строка.Номенклатура);
	КонецЕсли;
	
	// Заполним ячейку по умолчанию
	Если Элементы.КорзинаЯчейка.Видимость Тогда
		Строка.Ячейка = Справочники.Номенклатура.ПолучитьЯчейкуХранения(Строка.Номенклатура, ПараметрыСкладКомпании);
	КонецЕсли;
	
	Если ОстаткиПоОрдерномуСкладу Тогда
		КорзинаЯчейкаПриИзмененииНаСервере(Строка);
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.РезервОстаток, 0) КАК Остаток,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура,
		|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
		|			,
		|			СкладКомпании В (&СкладыКомпании)
		|				И Номенклатура В (&Номенклатура)
		|				И ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры)) КАК ОстаткиТоваровКомпанииОстатки";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("СкладыКомпании",             ПараметрыСписокСкладов);
		Запрос.УстановитьПараметр("Номенклатура",               Строка.Номенклатура);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Строка.ХарактеристикаНоменклатуры);
		Строка.Остаток = Запрос.Выполнить().Выгрузить().Итог("Остаток")/?(Строка.Коэффициент = 0, 1, Строка.Коэффициент);
	КонецЕсли;
	
	Элементы.КорзинаХарактеристикаНоменклатуры.Видимость = Элементы.КорзинаХарактеристикаНоменклатуры.Видимость ИЛИ ЗначениеЗаполнено(Строка.ВладелецХарактеристики);
	
	// Установим цену
	Если Этаформа.ПараметрыЗапрашиватьЦену = Истина
		И ЦенаПользователя > 0 Тогда 
		Строка.Цена  = ЦенаПользователя;
		Строка.Сумма = Строка.Цена * Строка.Количество * Строка.Коэффициент;
	Иначе
		Если ЗначениеЗаполнено(ПараметрыТипЦен) Тогда
			Строка.Цена  = ЦенообразованиеСервер.ПолучитьЦену(ПараметрыТипЦен, Строка.Номенклатура, ТекущаяДатаСеанса(), ПараметрыКонтрагент, ПараметрыВалюта, ПараметрыКурсВалюты, Строка.ХарактеристикаНоменклатуры, Строка.ЕдиницаИзмерения, ПараметрыПодразделениеКомпании);
			Строка.Сумма = Строка.Цена * Строка.Количество * Строка.Коэффициент;
		Иначе
			Строка.Цена  = 0;
			Строка.Сумма = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // КорзинаНоменклатураПриИзмененииНаСервере()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в контексте сервера.
//
&НаСервере
Процедура КорзинаКоличествоПриИзмененииНаСервере(ТекущиеДанные=Неопределено)
	
	Если ТекущиеДанные=Неопределено Тогда
		Строка = Корзина.НайтиПоИдентификатору(Элементы.Корзина.ТекущаяСтрока);
	Иначе
		Строка = ТекущиеДанные;
	КонецЕсли;
	
	// Получим количество товара в базовых единицах
	КоличествоБазовое = Строка.Количество*Строка.Коэффициент;
	
	// Проверим и сообщим пользователю, если что-то не так
	Если КоличествоБазовое > 1 И Строка.Номенклатура.ТипНоменклатуры.УникальностьСерийногоНомера Тогда
		Строка.Количество       = 1;
		Строка.ЕдиницаИзмерения = Строка.Номенклатура.ОсновнаяЕдиницаИзмерения;
		Строка.Коэффициент      = Строка.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент;
		ВывестиСообщение(НСтр("ru = 'Номенклатура ""%1"" учитывается по уникальным серийным номерам. Количество не может превышать 1 базовую единицу.'"), ЭтотОбъект, "Корзина[#].Номенклатура", Корзина.Индекс(Строка)+1,, Строка.Номенклатура);
	КонецЕсли;
	
	// Пересчитываем сумму строки
	Строка.Сумма = Строка.Цена * Строка.Количество * Строка.Коэффициент;
	
КонецПроцедуры // КорзинаКоличествоПриИзмененииНаСервере()

&НаКлиенте
Процедура КорзинаКоличествоПриИзменении(Элемент, Строка=Неопределено)
	
	КорзинаКоличествоПриИзмененииНаСервере();
	
КонецПроцедуры // КорзинаКоличествоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Ячейка" в контексте сервера.
//
&НаСервере
Процедура КорзинаЯчейкаПриИзмененииНаСервере(ТекущиеДанные=Неопределено)
	
	Если ТекущиеДанные=Неопределено Тогда
		Строка = Корзина.НайтиПоИдентификатору(Элементы.Корзина.ТекущаяСтрока);
	Иначе
		Строка = ТекущиеДанные;
	КонецЕсли;
	
	// Сформируем запрос для получения остатка по ордерному складу
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ОстаткиТоваровОрдерныйСкладОстатки.КоличествоОстаток, 0) КАК Остаток,
	|	ОстаткиТоваровОрдерныйСкладОстатки.Номенклатура,
	|	ОстаткиТоваровОрдерныйСкладОстатки.ХарактеристикаНоменклатуры
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровОрдерныйСклад.Остатки(
	|			,
	|			СкладКомпании В (&СкладыКомпании)
	|				И Номенклатура В (&Номенклатура)
	|				И ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры)
	|				И Ячейка В (&Ячейки)) КАК ОстаткиТоваровОрдерныйСкладОстатки";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СкладыКомпании",             ПараметрыСписокСкладов);
	Запрос.УстановитьПараметр("Номенклатура",               Строка.Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Строка.ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Ячейки",                     Строка.Ячейка);
	Строка.Остаток = Запрос.Выполнить().Выгрузить().Итог("Остаток")/?(Строка.Коэффициент = 0, 1, Строка.Коэффициент);
	
КонецПроцедуры // КорзинаЯчейкаПриИзмененииНаСервере()

// Обработчик события возникающего при изменении данных реквизита "Ячейка" в контексте клиента.
//
&НаКлиенте
Процедура КорзинаЯчейкаПриИзменении(Элемент)
	
	КорзинаЯчейкаПриИзмененииНаСервере();
	
КонецПроцедуры // КорзинаЯчейкаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в контексте сервера.
//
&НаСервере
Процедура КорзинаЕдиницаИзмеренияПриИзмененииНаСервере()
	
	// Получим данные текущей строки табличной части
	Строка = Корзина.НайтиПоИдентификатору(Элементы.Корзина.ТекущаяСтрока);
	ЦенаПользователя = 0;
	
	Если НЕ(Строка.ЕдиницаИзмерения.Пустая() ИЛИ Строка.Коэффициент=Строка.ЕдиницаИзмерения.Коэффициент) Тогда
		Строка.Коэффициент = Строка.ЕдиницаИзмерения.Коэффициент;
		КорзинаНоменклатураПриИзмененииНаСервере(Строка);
	КонецЕсли;
	
КонецПроцедуры // КорзинаЕдиницаИзмеренияПриИзмененииНаСервере()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в контексте клиента.
//
&НаКлиенте
Процедура КорзинаЕдиницаИзмеренияПриИзменении(Элемент)
	
	КорзинаЕдиницаИзмеренияПриИзмененииНаСервере();
	
КонецПроцедуры // КорзинаЕдиницаИзмеренияПриИзменении()

&НаКлиенте
Процедура КорзинаПриИзменении(Элемент)
	РассчитатьПодвалКорзины();
	ЭтотОбъект.Модифицированность = Истина;
КонецПроцедуры

// Обработчик события возникающего на клиенте после удаления строки Корзины.
//
// Параметры:
//  Элемент     		 - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура КорзинаПослеУдаления(Элемент)
	
	РассчитатьПодвалКорзины();
	
КонецПроцедуры // КорзинаПослеУдаления()

// Обработчик события возникающего на клиенте перед началом добавления в таблицу Корзина.
// Параметры:
//  Элемент     - ПолеФормы    - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от добавления объекта.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Неопределено; СправочникСсылка.<Имя справочника>; ПланСчетовСсылка.<Имя плана счетов>
//                             - Ссылка на элемент, который будет использован при добавлении в качестве родителя. 
//  ЭтоГруппа   - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура КорзинаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Удалять строки корзины можно, а вот добавление происходит только из списков
	Отказ = ИСТИНА;
	
КонецПроцедуры // КорзинаПередНачаломДобавления()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент                 - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - Содержит перетаскиваемое значение, тип действия и возможные действия при перетаскивании.
//  СтандартнаяОбработка    - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                  - Содержит порядковый номер строки или ссылку на текущий объект.
//  Поле                    - Поле, с которым связана данная колонка таблицы, над которой находится объект.
//
&НаКлиенте
Процедура КорзинаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при окончании перетаскивания в поле-приемнике данных.
//
// Параметры:
//  Элемент                 - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - Содержит перетаскиваемое значение, тип действия и возможные действия при перетаскивании.
//  СтандартнаяОбработка    - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                  - Содержит порядковый номер строки или ссылку на текущий объект.
//  Поле                    - Поле, с которым связана данная колонка таблицы, над которой находится объект.
//
&НаКлиенте
Процедура КорзинаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Если Элементы.СтраницаКорзина.Видимость И НЕ (ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") ИЛИ Элементы.Список.ТекущиеДанные.ЭтоГруппа) Тогда
		Модифицированность = Истина;
		Если Элементы.МножественныйВыбор.Пометка И ПараметрыПеретаскивания.Значение.Количество()>1 Тогда
			Для Каждого ЭлементаПодбора Из ПараметрыПеретаскивания.Значение Цикл
					ОбработкаПодбораТовараВКорзину(ЭлементаПодбора,, Элементы.Корзина.ТекущаяСтрока);
			КонецЦикла
		Иначе
			Если Элементы.Список.ТекущиеДанные.ВладелецХарактеристики=Неопределено Тогда
				ОбработкаПодбораТовараВКорзину(Элементы.Список.ТекущаяСтрока,, Элементы.Корзина.ТекущаяСтрока);
			Иначе
				УстановитьРежимВыбораХарактеристик(ИСТИНА, Элементы.Список.ТекущаяСтрока);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МножественныйВыбор(Команда)
	Элементы.МножественныйВыбор.Пометка = НЕ Элементы.МножественныйВыбор.Пометка;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЯ РАСШИРЕННОЙ ИНФОРМАЦИИ

// Обработчик события возникающего на клиенте при нажатии на поле "Расширенная информация".
//
// Параметры:
//  Элемент              - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ДанныеСобытия        - ФиксированнаяСтруктура - Параметр заполняется фиксированной структурой со свойствами:
//                         Anchor, Element, Button, Event, Document, Href.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура РасширеннаяИнформацияПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	// Вызываем специальный обработчик события
	РасширеннаяИнформацияКлиент.ПриНажатии(ЭтотОбъект, Элемент, ДанныеСобытия, СтандартнаяОбработка);
	
КонецПроцедуры // РасширеннаяИнформацияПриНажатии()


//тк+
////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ОТБОРОМ

&НаСервере
Процедура НастроитьПолеОтбора()
	
	//получим ограницения по номенклатуре из документа, если они переданы
	ПараметрыВыбораФормы    = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ПараметрыВыбораФормы", Новый Массив);
	ОтборПоВидуНоменклатуры = Неопределено;
	ОтборПоЗапретуПродажи 	= Неопределено;
	ОтборПоЗапретуЗакупки 	= Неопределено;
	
	Для Каждого ПараметрВыбораФормы Из ПараметрыВыбораФормы Цикл
		
		ИмяПараметраВыбора = СтрЗаменить(ПараметрВыбораФормы.Имя, "Отбор.", "");
		
		Если ИмяПараметраВыбора = "ВидНоменклатуры" Тогда
			
			Попытка
				ОтборПоВидуНоменклатуры = Новый СписокЗначений;
				ФиксМассив = ПараметрВыбораФормы.Значение;
				Для Сч = 0 По ФиксМассив.Количество()-1 Цикл
					ОтборПоВидуНоменклатуры.Добавить(ФиксМассив[Сч]);
				КонецЦикла;
			Исключение
			КонецПопытки;
			
		ИначеЕсли ИмяПараметраВыбора = "ЗапретЗакупки" Тогда
			
			ОтборПоЗапретуЗакупки = ПараметрВыбораФормы.Значение;
			
		ИначеЕсли ИмяПараметраВыбора = "ЗапретПродажи" Тогда
			
			ОтборПоЗапретуПродажи = ПараметрВыбораФормы.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПолеКомпоновкиПоВидуНоменклатуры 	= Новый ПолеКомпоновкиДанных("ВидНоменклатуры");
	ПолеКомпоновкиПоЗапретуЗакупки 		= Новый ПолеКомпоновкиДанных("ЗапретЗакупки");
	ПолеКомпоновкиПоЗапретуПродажи 		= Новый ПолеКомпоновкиДанных("ЗапретПродажи");
	
	// заполним быстрые отборы
	ДеревоОтбор = ЭтотОбъект.Отбор.ПолучитьЭлементы();   
	
	ОбъектНастройки 	= Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	ДоступныеНастройки	= Список.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора;
	
	Для Каждого ЭлементОтбора Из ОбъектНастройки Цикл
		
		Если ОтборПоВидуНоменклатуры <> Неопределено И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиПоВидуНоменклатуры Тогда
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = ОтборПоВидуНоменклатуры;
		ИначеЕсли ОтборПоЗапретуЗакупки <> Неопределено И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиПоЗапретуЗакупки Тогда
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = ОтборПоЗапретуЗакупки;
		ИначеЕсли ОтборПоЗапретуПродажи <> Неопределено И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиПоЗапретуПродажи Тогда
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = ОтборПоЗапретуПродажи;
		КонецЕсли;
		
		ДоступноеПоле = ДоступныеНастройки.НайтиПоле(ЭлементОтбора.ЛевоеЗначение);
		// Имя поля изменилось или поле было удалено.
		Если ДоступноеПоле = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаголовокПоля = ПолучитьЗаголовокПоля(ДоступноеПоле);
		
		НовыйОтбор = ДеревоОтбор.Добавить();
		НовыйОтбор.Использование  = ЭлементОтбора.Использование;
		НовыйОтбор.ЛевоеЗначение  = ЭлементОтбора.ЛевоеЗначение;
		НовыйОтбор.ВидСравнения   = ЭлементОтбора.ВидСравнения;
		НовыйОтбор.ПравоеЗначение = ?(ЗначениеЗаполнено(ЭлементОтбора.ПравоеЗначение), ЭлементОтбора.ПравоеЗначение, ДоступноеПоле.ТипЗначения.ПривестиЗначение(ЭлементОтбора.ПравоеЗначение));
		НовыйОтбор.Заголовок      = ПолучитьПредставлениеЭлементаОтбора(ЗаголовокПоля, ЭлементОтбора.ВидСравнения);
		
	КонецЦикла;
	
	//добавим поставщика
	НовыйОтбор = ДеревоОтбор.Добавить();
	НовыйОтбор.Использование  = Ложь;
	НовыйОтбор.ЛевоеЗначение  = "Поставщик";
	НовыйОтбор.ВидСравнения   = ВидСравнения.Равно;
	НовыйОтбор.ПравоеЗначение = Справочники.Контрагенты.ПустаяСсылка();
	НовыйОтбор.Заголовок      = "Поставщик";
	
	//добавим штрихкод
	НовыйОтбор = ДеревоОтбор.Добавить();
	НовыйОтбор.Использование  = Ложь;
	НовыйОтбор.ЛевоеЗначение  = "Штрихкод";
	НовыйОтбор.ВидСравнения   = ВидСравнения.Содержит;
	НовыйОтбор.ПравоеЗначение = "";
	НовыйОтбор.Заголовок      = "Штрихкод";

	//пробежимся по метаданным справочника Номенклатура, чтобы отделить доп. реквизиты и сведения от обычных реквизитов
	ЭлементОтбораСсылка = ДоступныеНастройки.НайтиПоле(Новый ПолеКомпоновкиДанных("Ссылка"));
	Если ЭлементОтбораСсылка<>Неопределено Тогда
		
		//ссылка есть, смотрим, какие у нее есть доступные поля
		РеквизитыСправочника 			= Метаданные.Справочники.Номенклатура.Реквизиты;
		ТЧСправочника 					= Метаданные.Справочники.Номенклатура.ТабличныеЧасти;
		СтандартныеРеквизиты 			= Метаданные.Справочники.Номенклатура.СтандартныеРеквизиты;
		МассивСтандартныхРеквизитов 	= Новый Массив;
		
		Для Каждого СтандартныйРеквизит Из СтандартныеРеквизиты Цикл
			МассивСтандартныхРеквизитов.Добавить(СтандартныйРеквизит.Имя);
		КонецЦикла;
		
		Для Каждого ДоступноеПолеОтбораКомпоновкиДанныхСсылки Из ЭлементОтбораСсылка.Элементы Цикл
			
			ПолеКомпоновкиСсылки 		= ДоступноеПолеОтбораКомпоновкиДанныхСсылки.Поле;
			СтроковоеПредставлениеПоля 	= СтрЗаменить(Строка(ПолеКомпоновкиСсылки), "Ссылка.", "");
			
			Если СтроковоеПредставлениеПоля = "Наименование" 
				ИЛИ СтроковоеПредставлениеПоля = "Код" 
				ИЛИ СтроковоеПредставлениеПоля = "ВерсияДанных"
				ИЛИ РеквизитыСправочника.Найти(СтроковоеПредставлениеПоля)<>Неопределено 
				ИЛИ ТЧСправочника.Найти(СтроковоеПредставлениеПоля)<>Неопределено
				ИЛИ МассивСтандартныхРеквизитов.Найти(СтроковоеПредставлениеПоля)<>Неопределено
				ИЛИ Метаданные.ОбщиеРеквизиты.Найти(СтроковоеПредставлениеПоля)<>Неопределено Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ЗаголовокПоля = ПолучитьЗаголовокПоля(ДоступноеПолеОтбораКомпоновкиДанныхСсылки);
			
			НовыйОтбор = ДеревоОтбор.Добавить();
			НовыйОтбор.Использование  = Ложь;
			НовыйОтбор.ЛевоеЗначение  = ПолеКомпоновкиСсылки;
			НовыйОтбор.ВидСравнения   = ДоступноеПолеОтбораКомпоновкиДанныхСсылки.ДоступныеВидыСравнения[0];
			НовыйОтбор.ПравоеЗначение = ДоступноеПолеОтбораКомпоновкиДанныхСсылки.ТипЗначения.ПривестиЗначение();
			НовыйОтбор.Заголовок      = ПолучитьПредставлениеЭлементаОтбора(ЗаголовокПоля, НовыйОтбор.ВидСравнения);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // НастроитьПолеОтбора()

// Получает заголовок для поля отбора
//
&НаСервере
Функция ПолучитьЗаголовокПоля(ДоступноеПоле) Экспорт
	
	ЗаголовокПоля = "";
	Если ДоступноеПоле.Родитель = Неопределено Тогда
		ЗаголовокПоля     = ДоступноеПоле.Заголовок;
	Иначе
		ЗаголовокРодителя = ДоступноеПоле.Родитель.Заголовок;
		ЗаголовокПоля     = СтрЗаменить(ДоступноеПоле.Заголовок, ЗаголовокРодителя+".", "")+ " (" + (ЗаголовокРодителя)+ ")";
	КонецЕсли;
	
	Возврат ЗаголовокПоля;
	
КонецФункции

// Получает представление элемента отбора
//
&НаСервере
Функция ПолучитьПредставлениеЭлементаОтбора(ПредставлениеПоля, ВидСравнения)
	
	ПредставлениеСравнения = "";
	// Производим формирование секции выдов сравнения
	Если ВидСравнения=Неопределено ИЛИ ВидСравнения=ВидСравненияКомпоновкиДанных.Равно ИЛИ ВидСравнения=ВидСравненияКомпоновкиДанных.Содержит ИЛИ ВидСравнения=ВидСравненияКомпоновкиДанных.ВИерархии ИЛИ ВидСравнения=ВидСравненияКомпоновкиДанных.ВСписке ИЛИ ВидСравнения=ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
		// Формирование представлений для прямых видов условий производить не будем
		
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.Больше Тогда
		ПредставлениеСравнения = "(>)";
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
		ПредставлениеСравнения = "(>=)";
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.Меньше Тогда
		ПредставлениеСравнения = "(<)";
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
		ПредставлениеСравнения = "(<=)";
	ИначеЕсли ВидСравнения=ВидСравненияКомпоновкиДанных.НеРавно ИЛИ ВидСравнения=ВидСравненияКомпоновкиДанных.НеВИерархии ИЛИ ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСписке ИЛИ ВидСравнения=ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
		ПредставлениеСравнения = "(НЕ)";
	Иначе
		ПредставлениеСравнения = "("+Строка(ВидСравнения)+")";
	КонецЕсли;
	
	ПредставлениеСравнения = ПредставлениеПоля + ПредставлениеСравнения;
	
	// Возвращаем сформированное представление текущего элемента отбора
	Возврат ПредставлениеСравнения;
	
КонецФункции // ПолучитьПредставлениеЭлементаОтбора()

// Функция определения того, что отбор выполняетсяпо списку значений
//
&НаКлиенте
Функция ОтборПоСписку(ВидСравненияОтбора)
	
	Результат = Ложь;
	Если ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке ИЛИ 
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии ИЛИ
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеВСписке ИЛИ 
		ВидСравненияОтбора= ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Установка для поля формы выбора
//
&НаСервере
Процедура УстановитьФормуВыбора(Элемент, ФормаВыбора)
	
	Элемент.ФормаВыбора = ФормаВыбора;
	
КонецПроцедуры

// Устанавливает дополнительный отбор товаров по ссылке
//
&НаСервере
Процедура УстановитьОтборТоваровПоСсылке(ОбъектНастройки, ОтборПоПоставщикуИспользуется, ОтборПоШтрихкодуИспользуется, 
	СтрокаОтбораПоПоставщику, СтрокаОтбораПоШтрихкоду)
	
	// Создадим промежуточные коллекции объектов
	СписокНоменклатур 	 = Новый СписокЗначений;
	ТаблицаНоменклатур   = Новый ТаблицаЗначений;
	ТаблицаНоменклатур.Колонки.Добавить("Номенклатура");
	ТаблицаНоменклатур.Колонки.Добавить("КоличествоИсточников");
	ТаблицаНоменклатурШК =  ТаблицаНоменклатур.Скопировать();
	МассивНоменклатур = Новый Массив;
	
	КоличествоИсточников = 0;
	
	Если ОтборПоПоставщикуИспользуется Тогда
		КоличествоИсточников = КоличествоИсточников + 1;
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПартииТоваровКомпании.Номенклатура,
		|   1 КАК КоличествоИсточников
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
		|ГДЕ
		|	%УсловиеОтбораПоПоставщику%";
		
		Если СтрокаОтбораПоПоставщику.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеОтбораПоПоставщику%", "ПартииТоваровКомпании.Партия.Контрагент = &Контрагент");
		ИначеЕсли СтрокаОтбораПоПоставщику.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеОтбораПоПоставщику%", "ПартииТоваровКомпании.Партия.Контрагент <> &Контрагент");
		ИначеЕсли СтрокаОтбораПоПоставщику.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеОтбораПоПоставщику%", "ПартииТоваровКомпании.Партия.Контрагент В (&Контрагент)");
		ИначеЕсли СтрокаОтбораПоПоставщику.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеОтбораПоПоставщику%", " НЕ (ПартииТоваровКомпании.Партия.Контрагент В (&Контрагент))");
		КонецЕсли;
		
		Запрос 			= Новый Запрос;
		Запрос.Текст 	= ТекстЗапроса;
		Запрос.УстановитьПараметр("Контрагент", СтрокаОтбораПоПоставщику.ПравоеЗначение);
		ТаблицаНоменклатур = Запрос.Выполнить().Выгрузить();
	КонецЕсли; // ОтборПоПоставщикуИспользуется
	
	Если ОтборПоШтрихкодуИспользуется Тогда
		КоличествоИсточников = КоличествоИсточников + 1;		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Штрихкоды.Объект КАК Номенклатура,
		|   1 КАК КоличествоИсточников
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Объект ССЫЛКА Справочник.Номенклатура
		|	%УсловиеОтбораПоШтрихкоду%";
		
		Штрихкод = СтрокаОтбораПоШтрихкоду.ПравоеЗначение;						
		Если СтрокаОтбораПоШтрихкоду.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеОтбораПоШтрихкоду%", "И Штрихкоды.Штрихкод = &Штрихкод");
		ИначеЕсли СтрокаОтбораПоШтрихкоду.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеОтбораПоШтрихкоду%", "И Штрихкоды.Штрихкод <> &Штрихкод");
		ИначеЕсли СтрокаОтбораПоШтрихкоду.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеОтбораПоШтрихкоду%", "И Штрихкоды.Штрихкод Подобно ""%" + Штрихкод + "%""");
		ИначеЕсли СтрокаОтбораПоШтрихкоду.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеОтбораПоШтрихкоду%", "И НЕ Штрихкоды.Штрихкод Подобно ""%" + Штрихкод + "%""");
		ИначеЕсли СтрокаОтбораПоШтрихкоду.ВидСравнения = ВидСравненияКомпоновкиДанных.НачинаетсяС Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеОтбораПоШтрихкоду%", "И Штрихкоды.Штрихкод Подобно """ + Штрихкод + "%""");
		ИначеЕсли СтрокаОтбораПоШтрихкоду.ВидСравнения = ВидСравненияКомпоновкиДанных.НеНачинаетсяС Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%УсловиеОтбораПоШтрихкоду%", "И НЕ Штрихкоды.Штрихкод Подобно """ + Штрихкод + "%""");
		КонецЕсли;
		
		Запрос 			= Новый Запрос;
		Запрос.Текст 	= ТекстЗапроса;
		Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
		ТаблицаНоменклатурШК = Запрос.Выполнить().Выгрузить();
	КонецЕсли; // ОтборПоШтрихкодуИспользуется
	
	// объединяем таблицы значений
	ДополнитьТаблицу(ТаблицаНоменклатурШК, ТаблицаНоменклатур);
	
	// сворачиваем таблицу значений по Номенклатуре, суммируем КоличествоИсточников
	ТаблицаНоменклатур.Свернуть("Номенклатура", "КоличествоИсточников");
	
	// находим строки, удовлетворяющие всем заданным условиям отбора по ссылке
	ТаблицаНоменклатурПересечение = ТаблицаНоменклатур.НайтиСтроки(Новый Структура("КоличествоИсточников", КоличествоИсточников));
	
	// и формируем массив элементов справочника Номенклатура
	Для Каждого СтрокаТаблицы Из ТаблицаНоменклатурПересечение Цикл
		МассивНоменклатур.Добавить(СтрокаТаблицы.Номенклатура);
	КонецЦикла;
	
	// получаем список номенклатур для правого значения отбора
	СписокНоменклатур.ЗагрузитьЗначения(МассивНоменклатур);
	
	//Если СписокНоменклатур.Количество() > 0 Тогда 
		//заполним отборы компоновщика
		СписокЭлементовОтбора = Новый СписокЗначений;
		ПолеКомпоновкиСсылка = Новый ПолеКомпоновкиДанных("Ссылка");
		Для Каждого ЭлементОбъекта Из ОбъектНастройки Цикл
			Если ЭлементОбъекта.ЛевоеЗначение = ПолеКомпоновкиСсылка Тогда
				СписокЭлементовОтбора.Добавить(ЭлементОбъекта);
			КонецЕсли;
		КонецЦикла;
		
		Если СписокЭлементовОтбора.Количество() = 0 Тогда
			СписокЭлементовОтбора.Добавить(ОбъектНастройки.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")));
		КонецЕсли;
		
		Для Каждого ЭлементСписка Из СписокЭлементовОтбора Цикл
			ЭлементОтбора = ЭлементСписка.Значение;
			ЭлементОтбора.Использование  = Истина;
			ЭлементОтбора.ЛевоеЗначение  = ПолеКомпоновкиСсылка;
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = СписокНоменклатур;
		КонецЦикла;
	//КонецЕсли; // СписокНоменклатур.Количество() > 0 
	
КонецПроцедуры

// Обновление отбора списка
//
&НаСервере
Процедура ОбновитьНастройкиОтбора()
	
	ДеревоОтбор = Отбор.ПолучитьЭлементы();
	ОтборСКД    = Неопределено;
	Для Каждого ЭлементКомпоновщика Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементКомпоновщика) = Тип("ОтборКомпоновкиДанных") Тогда
			ОтборСКД = ЭлементКомпоновщика;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	
	Если ОтборСКД<>Неопределено Тогда
		
		СтрокаОтбораПоПоставщику 				= Неопределено;
		ОтборПоПоставщикуИспользуется 			= Ложь;
		
		СтрокаОтбораПоШтрихкоду 				= Неопределено;
		ОтборПоШтрихкодуИспользуется 			= Ложь;

		ОбъектНастройки = ОтборСКД.Элементы;
		
		Элементы.ОтключитьОтбор.Доступность = Ложь;
		
		Для Каждого СтрокаОтбора Из ДеревоОтбор Цикл
			
			Если СтрокаОтбора.Использование Тогда 
				Элементы.ОтключитьОтбор.Доступность = Истина;
			КонецЕсли;	
			
			//пока пропустим поставщика, с ним разберёмся позже
			Если СтрокаОтбора.ЛевоеЗначение = "Поставщик" Тогда
				СтрокаОтбораПоПоставщику = СтрокаОтбора;
				ОтборПоПоставщикуИспользуется = ?(Элементы.ПоискПоУсловию.Пометка, СтрокаОтбора.Использование, Элементы.ПоискПоУсловию.Пометка); 
				Продолжить;
			КонецЕсли;
			//штрихкод тоже пропустим, тоже разберёмся позже
			Если СтрокаОтбора.ЛевоеЗначение = "Штрихкод" Тогда
				СтрокаОтбораПоШтрихкоду = СтрокаОтбора;
				ОтборПоШтрихкодуИспользуется = ?(Элементы.ПоискПоУсловию.Пометка, СтрокаОтбора.Использование , Элементы.ПоискПоУсловию.Пометка); 
				Продолжить;
			КонецЕсли;
			
			//заполним отборы компоновщика
			СписокЭлементовОтбора = Новый СписокЗначений;
			Для Каждого ЭлементОбъекта Из ОбъектНастройки Цикл
				Если ЭлементОбъекта.ЛевоеЗначение = СтрокаОтбора.ЛевоеЗначение Тогда
					СписокЭлементовОтбора.Добавить(ЭлементОбъекта);
				КонецЕсли;
			КонецЦикла;
			
			Если СписокЭлементовОтбора.Количество() = 0 Тогда
				СписокЭлементовОтбора.Добавить(ОбъектНастройки.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")));
			КонецЕсли;
			
			Для Каждого ЭлементСписка Из СписокЭлементовОтбора Цикл
				ЭлементОтбора 				 = ЭлементСписка.Значение;
				ЭлементОтбора.Использование  = ?(Элементы.ПоискПоУсловию.Пометка, СтрокаОтбора.Использование , Элементы.ПоискПоУсловию.Пометка);
				ЭлементОтбора.ЛевоеЗначение  = СтрокаОтбора.ЛевоеЗначение;
				ЭлементОтбора.ВидСравнения   = СтрокаОтбора.ВидСравнения;
				ЭлементОтбора.ПравоеЗначение = СтрокаОтбора.ПравоеЗначение;
			КонецЦикла;
			
		КонецЦикла;
		
		//Теперь посмотрим, что у нас с отбором по поставщику и/или штрихкоду
		Если ОтборПоПоставщикуИспользуется ИЛИ ОтборПоШтрихкодуИспользуется Тогда
			УстановитьОтборТоваровПоСсылке(ОбъектНастройки, ОтборПоПоставщикуИспользуется, ОтборПоШтрихкодуИспользуется, 
											СтрокаОтбораПоПоставщику, СтрокаОтбораПоШтрихкоду);
		Иначе
			//сбросим отбор по ссылке
			ПолеКомпоновкиСсылка = Новый ПолеКомпоновкиДанных("Ссылка");
			Для Каждого ЭлементОбъекта Из ОбъектНастройки Цикл
				Если ЭлементОбъекта.ЛевоеЗначение = ПолеКомпоновкиСсылка Тогда
					ЭлементОбъекта.Использование = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик окончания выбора значения отбора
//
&НаКлиенте
Процедура ОповещениеВыбораЗначенияОтбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("СписокЗначений") Тогда
		
		ТекущиеДанные = Элементы.Отбор.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные.ПравоеЗначение = РезультатЗакрытия;
		
	КонецЕсли;
	Элементы.Отбор.ЗакончитьРедактированиеСтроки(Ложь);
	
КонецПроцедуры

//Обработчик команды отображения вида сравнения
//
&НаКлиенте
Процедура ОтображатьВидСравнения(Команда)
	
	Элементы.ОтборВидСравнения.Видимость                        = НЕ Элементы.ОтборВидСравнения.Видимость;
	Элементы.ОтборКонтекстноеМенюОтображатьВидСравнения.Пометка = Элементы.ОтборВидСравнения.Видимость;
	
КонецПроцедуры

// Обработчик изменения поля "Вид сравнения" таблицы "Отбор"
//
&НаКлиенте
Процедура ОтборВидСравненияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Отбор.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("ВидСравненияКомпоновкиДанных.Заполнено") ИЛИ 
		ТекущиеДанные.ВидСравнения = ПредопределенноеЗначение("ВидСравненияКомпоновкиДанных.НеЗаполнено") Тогда
		ТекущиеДанные.ВыводитьТолькоЗаголовок = Истина;
	Иначе
		ТекущиеДанные.ВыводитьТолькоЗаголовок = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик изменения поля "Правое значение" таблицы "Отбор"
//
&НаКлиенте
Процедура ОтборПравоеЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Отбор.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ТекущиеДанные.Использование = ЗначениеЗаполнено(ТекущиеДанные.ПравоеЗначение);
	
КонецПроцедуры

// Обработчик начала выбора поля "Правое значение" таблицы "Отбор"
//
&НаКлиенте
Процедура ОтборПравоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Отбор.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено ИЛИ 
		ТекущиеДанные.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
		
		СтандартнаяОбработка = Истина;
		
	КонецЕсли;
	
	Если ОтборПоСписку(ТекущиеДанные.ВидСравнения) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ТекущиеДанные.ЛевоеЗначение = "Поставщик" Тогда
			СтруктураПараметров = Новый Структура("СписокВыбора, ТипЗначения, ДоступныеЗначения, ТолькоГруппы", ТекущиеДанные.ПравоеЗначение, Новый ОписаниеТипов("СправочникСсылка.Контрагенты"), Неопределено, Ложь);
		ИначеЕсли ТекущиеДанные.ЛевоеЗначение = "Штрихкод" Тогда
			СтруктураПараметров = Новый Структура("СписокВыбора, ТипЗначения, ДоступныеЗначения, ТолькоГруппы", ТекущиеДанные.ПравоеЗначение, Новый ОписаниеТипов("Строка"), Неопределено, Ложь);
	
		Иначе
			
			ДоступноеПоле = Список.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(ТекущиеДанные.ЛевоеЗначение);
			
			Если ТекущиеДанные.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии ИЛИ
				ТекущиеДанные.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				ТолькоГруппы = Истина;
			Иначе
				ТолькоГруппы = Ложь;
			КонецЕсли;
			
			СтруктураПараметров = Новый Структура("СписокВыбора, ТипЗначения, ДоступныеЗначения, ТолькоГруппы", ТекущиеДанные.ПравоеЗначение, ДоступноеПоле.ТипЗначения, ДоступноеПоле.ДоступныеЗначения, ТолькоГруппы);
		КонецЕсли;
		ОписаниеОповещенияВыбораЗначения = Новый ОписаниеОповещения("ОповещениеВыбораЗначенияОтбора", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.ОтчетВыборЗначенияОтбораИзСписка", СтруктураПараметров, Элемент,,,, ОписаниеОповещенияВыбораЗначения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии Enter) в ячейке таблицы "Отбор".
//
&НаКлиенте
Процедура ОтборВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Отбор.ТекущиеДанные;
	
	Если Поле.Имя = "ОтборВидСравнения" Тогда
		
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СписокВыбора = Элементы.ОтборВидСравнения.СписокВыбора;
		СписокВыбора.Очистить();
		
		Если ТекущиеДанные.ЛевоеЗначение = "Поставщик" Тогда
			СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.Равно, 		Строка(ВидСравненияКомпоновкиДанных.Равно));
			СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеРавно, 	Строка(ВидСравненияКомпоновкиДанных.НеРавно));
			СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.ВСписке, 	Строка(ВидСравненияКомпоновкиДанных.ВСписке));
			СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке, 	Строка(ВидСравненияКомпоновкиДанных.НеВСписке));
		ИначеЕсли ТекущиеДанные.ЛевоеЗначение = "Штрихкод" Тогда
			СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.Равно, 		  Строка(ВидСравненияКомпоновкиДанных.Равно));
			СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеРавно, 	  Строка(ВидСравненияКомпоновкиДанных.НеРавно));
			СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.Содержит, 	  Строка(ВидСравненияКомпоновкиДанных.Содержит));
			СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеСодержит, 	  Строка(ВидСравненияКомпоновкиДанных.НеСодержит));
			СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НачинаетсяС,   Строка(ВидСравненияКомпоновкиДанных.НачинаетсяС));
			СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.НеНачинаетсяС, Строка(ВидСравненияКомпоновкиДанных.НеНачинаетсяС));
		Иначе
			ДоступноеПолеОтбора = Список.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(ТекущиеДанные.ЛевоеЗначение);
			Если НЕ ДоступноеПолеОтбора = Неопределено Тогда
				Для Каждого ДоступноеСравнения Из ДоступноеПолеОтбора.ДоступныеВидыСравнения Цикл
					СписокВыбора.Добавить(ДоступноеСравнения.Значение, Строка(ДоступноеСравнения.Значение));
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "ОтборПравоеЗначение" Тогда
		
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ТекущиеДанные.ЛевоеЗначение = "Поставщик" Тогда
			Элементы.ОтборПравоеЗначение.БыстрыйВыбор         = Ложь;
			Элементы.ОтборПравоеЗначение.ОграничениеТипа      = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
			Элементы.ОтборПравоеЗначение.КнопкаВыбора = Истина;
			Элементы.ОтборПравоеЗначение.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
		ИначеЕсли ТекущиеДанные.ЛевоеЗначение = "Штрихкод" Тогда
			Элементы.ОтборПравоеЗначение.БыстрыйВыбор         = Ложь;
			Элементы.ОтборПравоеЗначение.ОграничениеТипа      = Новый ОписаниеТипов("Строка");
			Элементы.ОтборПравоеЗначение.КнопкаВыбора = Ложь;
		Иначе
			
			ДоступноеПоле = Список.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(ТекущиеДанные.ЛевоеЗначение);
			
			Если ДоступноеПоле = Неопределено Тогда
				Элементы.ОтборПравоеЗначение.ОграничениеТипа = Новый ОписаниеТипов("Неопределено");
			Иначе
				
				Если ТекущиеДанные.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии ИЛИ 
					ТекущиеДанные.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
					Элементы.ОтборПравоеЗначение.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
				ИначеЕсли ДоступноеПоле.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.ГруппыИЭлементы Тогда
					Элементы.ОтборПравоеЗначение.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
				ИначеЕсли ДоступноеПоле.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы Тогда
					Элементы.ОтборПравоеЗначение.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
				Иначе
					Элементы.ОтборПравоеЗначение.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
				КонецЕсли;
				
				
				Элементы.ОтборПравоеЗначение.БыстрыйВыбор         = ДоступноеПоле.БыстрыйВыбор;
				Элементы.ОтборПравоеЗначение.Маска                = ДоступноеПоле.Маска;
				Элементы.ОтборПравоеЗначение.ФорматРедактирования = ДоступноеПоле.ФорматРедактирования;
				
				Если НЕ ДоступноеПоле.ФормаВыбора = "" Тогда
					УстановитьФормуВыбора(Элементы.ОтборПравоеЗначение, ДоступноеПоле.ФормаВыбора);
				КонецЕсли;
				
				
				Элементы.ОтборПравоеЗначение.ОграничениеТипа      = ДоступноеПоле.ТипЗначения;
				
				Элементы.ОтборПравоеЗначение.КнопкаВыбора = Истина;
				МассивТипов = ДоступноеПоле.ТипЗначения.Типы();
				Если МассивТипов.Количество()> 0 Тогда
					Если МассивТипов[0] = Тип("Строка") Тогда
						Элементы.ОтборПравоеЗначение.КнопкаВыбора = Ложь;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте перед началом изменения таблицы "Отбор".
//
&НаКлиенте
Процедура ОтборПередНачаломИзменения(Элемент, Отказ)
	Поле = Элементы.Отбор.ТекущийЭлемент;
	Если Поле.Имя = "ОтборПравоеЗначение" ИЛИ Поле.Имя = "ОтборВидСравнения" Тогда
		
		СтандартнаяОбработка = Истина;
		ВыбраннаяСтрока      = Неопределено;
		ОтборВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПодразделениюПользователя(Команда)
	
	Элементы.ОтборПоПодразделениюПользователя.Пометка = НЕ Элементы.ОтборПоПодразделениюПользователя.Пометка;
	ВсеПодразделения = НЕ Элементы.ОтборПоПодразделениюПользователя.Пометка; 
	ВсеПодразделенияОстаткиПриИзменении();
	ВсеПодразделенияЦеныПриИзменении();
	ВсеПодразделенияСкидки();

КонецПроцедуры

//тк-


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	//Установим ПодразделениеКомпании пользователя для отбора
	ПодразделениеКомпанииПользователя  = ПараметрыСеанса.ТекущийПользователь.ПодразделениеКомпании;
	ПодставитьЗначениеПодразделенияВФильтр();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	////Загружаем настройки по последней открытой страницы
	//ЗагрузитьНастройки();
	
	// Определим в каком режиме открыта форма
	ЭтотОбъект.РежимПодбора = (Элементы.Список.РежимВыбора И ТипЗнч(Параметры.ПараметрыПодбора)=Тип("Структура"));
	
	// Получение параметров для подключаемого оборудования 
	ИспользоватьПодключаемоеОборудование = МенеджерОборудованияВызовСервераПереопределяемый.ИспользоватьПодключаемоеОборудование();
	
	// Подменим запрос для остатков, если есть право доступа на чтение к документу поступление.
	Если ПравоДоступа("Просмотр",Метаданные.Документы.ПоступлениеТоваров) Тогда
		ЭтотОбъект.ОстаткиПоСкладам.ТекстЗапроса = "ВЫБРАТЬ
		                                           |	ПоступлениеТоваров.СкладКомпании КАК СкладКомпании,
		                                           |	ПоступлениеТоваровТовары.Номенклатура КАК Номенклатура,
		                                           |	СУММА(ПоступлениеТоваровТовары.КоличествоБазовое) КАК КоличествоОжидается
		                                           |ПОМЕСТИТЬ ТаблицаОжидаетсяКПоступлению
		                                           |ИЗ
		                                           |	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
		                                           |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
		                                           |		ПО ПоступлениеТоваровТовары.Ссылка = ПоступлениеТоваров.Ссылка
		                                           |ГДЕ
		                                           |	ПоступлениеТоваров.Проведен = ЛОЖЬ
		                                           |
		                                           |СГРУППИРОВАТЬ ПО
		                                           |	ПоступлениеТоваровТовары.Номенклатура,
		                                           |	ПоступлениеТоваров.СкладКомпании
		                                           |;
		                                           |
		                                           |////////////////////////////////////////////////////////////////////////////////
		                                           |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                                           |	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.СкладКомпании, ТаблицаОжидаетсяКПоступлению.СкладКомпании) КАК СкладКомпании,
		                                           |	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК Количество,
		                                           |	ОстаткиТоваровКомпанииОстатки.РезервОстаток КАК Резерв,
		                                           |	ВЫРАЗИТЬ(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток КАК ЧИСЛО(15, 3)) КАК Остаток,
		                                           |	ВЫБОР
		                                           |		КОГДА ОстаткиТоваровКомпанииОстатки.СкладКомпании.Розничный
		                                           |			ТОГДА ОстаткиТоваровКомпанииОстатки.СуммаРознОстаток
		                                           |		ИНАЧЕ 0
		                                           |	КОНЕЦ КАК СуммаРозничная,
		                                           |	ВЫБОР
		                                           |		КОГДА ОстаткиТоваровКомпанииОстатки.СкладКомпании.Розничный
		                                           |				И НЕ ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) = 0
		                                           |			ТОГДА ОстаткиТоваровКомпанииОстатки.СуммаРознОстаток / ОстаткиТоваровКомпанииОстатки.КоличествоОстаток
		                                           |		ИНАЧЕ 0
		                                           |	КОНЕЦ КАК ЦенаРозничная,
		                                           |	ТаблицаОжидаетсяКПоступлению.КоличествоОжидается КАК Ожидается,
		                                           |	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.Номенклатура, ТаблицаОжидаетсяКПоступлению.Номенклатура) КАК Номенклатура
		                                           |ИЗ
		                                           |	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, ) КАК ОстаткиТоваровКомпанииОстатки
		                                           |		{ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаОжидаетсяКПоступлению КАК ТаблицаОжидаетсяКПоступлению
		                                           |		ПО ОстаткиТоваровКомпанииОстатки.СкладКомпании = ТаблицаОжидаетсяКПоступлению.СкладКомпании
		                                           |			И ОстаткиТоваровКомпанииОстатки.Номенклатура = ТаблицаОжидаетсяКПоступлению.Номенклатура}";
	КонецЕсли;
		
	
	//laza { Получим объект, из формы которого открыт подбор. Это необходимо для получения значений прав в разрезе расширений
	ПараметрыДействия = ПолучитьЗначениеПараметраСтруктуры(Параметры.ПараметрыПодбора, "ПараметрыДействия", Неопределено);
	Если НЕ ПараметрыДействия = Неопределено Тогда
		ПараметрыОбъект = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "СсылкаОбъекта", Неопределено);
		Если НЕ ПараметрыОбъект = Неопределено Тогда
			ПараметрыЗапрашиватьКоличество = ПравоПользователя("ЗапросКоличестваВПодборе", ПараметрыОбъект);
			ПараметрыЗапрашиватьЦену	   = ПравоПользователя("ЗапросЦеныВПодборе", ПараметрыОбъект);
		КонецЕсли;
	КонецЕсли;
	//laza }
	// Установим параметры получения цены и остатка
	ЭтотОбъект.ПараметрыПодразделениеКомпании = Параметры.ПодразделениеКомпании;
	ЭтотОбъект.ПараметрыКонтрагент            = Параметры.Контрагент;
	ЭтотОбъект.ПараметрыВалюта                = Параметры.Валюта;
	ЭтотОбъект.ПараметрыКурсВалюты            = Параметры.КурсВалюты;
	ЭтотОбъект.ПараметрыТипЦен                = Параметры.ТипЦен;
	ЭтотОбъект.ПараметрыСкладКомпании         = Параметры.СкладКомпании;
	ЭтотОбъект.АдресПараметрыПодбора          = ПоместитьВоВременноеХранилище(Параметры.ПараметрыПодбора, ЭтотОбъект.УникальныйИдентификатор);
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПараметрыПодразделениеКомпании) Тогда
		ЭтотОбъект.ПараметрыПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПараметрыВалюта) Тогда
		ЭтотОбъект.ПараметрыВалюта = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПараметрыКурсВалюты) Тогда
		ЭтотОбъект.ПараметрыКурсВалюты = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалюты(ЭтотОбъект.ПараметрыВалюта, ТекущаяДатаСеанса());
	КонецЕсли;
	ЭтотОбъект.ОбновлениеЗамен = Истина;
	
	// Настроим параметры отображения в зависимости от режима открытия
	Если ЭтотОбъект.РежимПодбора Тогда
		
		// Каждый режим открытия должен сохранять свои настройки
		ЭтотОбъект.КлючОбъекта                 = "Справочник.Номенклатура.РежимПодбора";
		ЭтотОбъект.КлючСохраненияПоложенияОкна = ЭтотОбъект.КлючОбъекта;
		ЭтотОбъект.КлючНазначенияИспользования = ЭтотОбъект.КлючОбъекта;
		
		// Установим признак, что необходимо получать остатки по ордерному складу
		ЭтотОбъект.ОстаткиПоОрдерномуСкладу    = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ЭтоОрдерныйДокумент", Ложь);
		
		// Установим режим вывода колонки Остаток в корзине
		ЭтотОбъект.ПараметрыРежимВыводаОстатков = ?(ПолучитьФункциональнуюОпцию("ИспользоватьИндикациюОстатковТовара"), 2, 0);
		
		Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.ГруппыИЭлементы;
		ЭтотОбъект.Заголовок = НСтр("ru = 'Подбор номенклатуры'");
		
		Элементы.Характеристики.РежимВыбора = ИСТИНА;
		
		// Произведем настройку параметров отображения полей корзины и расширенной информации.
		УстановитьВидимостьКорзины(ИСТИНА);
		
		Элементы.ПоказатьРасширеннуюИнформацию.Видимость = ЛОЖЬ;
		Элементы.КорзинаОтключить.Видимость              = ЛОЖЬ;
		
		// RADV
		Элементы.КорзинаСкладКомпании.Видимость                = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ЕстьСклад", Ложь);
		Элементы.КорзинаЦена.Видимость                         = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ЕстьЦена", Истина);
		Элементы.КорзинаСумма.Видимость                        = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ЕстьСумма", Истина);
		Элементы.КорзинаЯчейка.Видимость                       = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ЕстьЯчейка", Ложь) И ПолучитьФункциональнуюОпцию("ИспользоватьЯчейкиХранения");
		Элементы.КорзинаПримечаниеНоменклатура.Видимость       = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ЕстьПримечание", Ложь);
		Элементы.КорзинаПримечаниеНоменклатураПечать.Видимость = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ЕстьПримечание", Ложь);
		
		Если Элементы.КорзинаЯчейка.Видимость И ЗначениеЗаполнено(ПараметрыСкладКомпании) Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.КорзинаЯчейка.ПараметрыВыбора, "Отбор.Владелец", ПараметрыСкладКомпании);
		КонецЕсли;
		
		АдресКорзины = ПолучитьЗначениеПараметраСтруктуры(Параметры, "АдресКорзины", Неопределено);
		Если Не АдресКорзины = Неопределено Тогда
			
			ЗагрузитьКорзинуИзХранилища(АдресКорзины);
			
		КонецЕсли;
		// RADV
		
		Элементы.ФормаВыбрать.ИмяКоманды = "ЗавершитьПодбор";
		
		// МР + 
		ВидЗаказа = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ит_ВидЗаявки", Перечисления.рздВидыЗаказовЕРП.ПустаяСсылка());
		ит_ВидЗаявки = Перечисления.ит_ВидыЗаявокНоменклатура.ПустаяСсылка();
		Если ЗначениеЗаполнено(ВидЗаказа) Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ВидЗаказа", ВидЗаказа);
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказаНоменклатура КАК ит_ВидЗаявки
			|ИЗ
			|	РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры КАК ит_СоответствиеВидаЗаявкиВидуНоменклатуры
			|ГДЕ
			|	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа = &ВидЗаказа
			|";
			Выборка = Запрос.Выполнить().Выбрать();
			ВидыЗаявок = Новый СписокЗначений;
			Пока Выборка.Следующий() Цикл
				ВидыЗаявок.Добавить(Выборка.ит_ВидЗаявки);
			КонецЦикла;
			Если ВидыЗаявок.Количество() = 0 Тогда
				ОбщегоНаЗначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ит_ВидЗаявки", ит_ВидЗаявки, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ит_ВидЗаявки),РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
			Иначе
				ОбщегоНаЗначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ит_ВидЗаявки", ВидыЗаявок, ВидСравненияКомпоновкиДанных.ВСписке,, ЗначениеЗаполнено(ВидыЗаявок),РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
			КонецЕсли;
		Иначе
			ОбщегоНаЗначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ит_ВидЗаявки", ит_ВидЗаявки, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ит_ВидЗаявки),РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		КонецЕсли;
		// МР - 
		
	Иначе
		
		//Если Элементы.Список.РежимВыбора И ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
		//	ЭтотОбъект.ОбновлениеЗамен = Ложь;
		//	Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница = Элементы.СтраницаАналоги;
		//КонецЕсли;
		
		ЭтотОбъект.ОстаткиПоОрдерномуСкладу = Ложь;
		
		// Произведем настройку параметров отображения полей корзины и расширенной информации.
		УстановитьВидимостьКорзины(ЛОЖЬ);
		
		// Спрячем кнопку перехода в режим корзины
		Если Элементы.Список.РежимВыбора Тогда
			Элементы.КорзинаВключить.Видимость = ЛОЖЬ;
		КонецЕсли;
		
	КонецЕсли;
	
	// Отключим лишние элементы формы
	Элементы.ПоказатьДерево.Видимость = ЛОЖЬ;
	
	// Установим вариант отображения дополнительных полей "Код" и "Артикул"
	УправлениеДиалогомДокументаСервер.УстановитьВидимостьКолонокКодАртикул(ЭтотОбъект, "Корзина");
	
	// Установим видимость и заполним параметры вывода Остатка в списках формы
	УстановитьПараметрыВыводаКолонкиОстатокНаСкладе();
	
	// Произведем настройку списка необходимых для проверки вкладок
	СписокНазванийВкладок = Новый Структура("СтраницаОстаткиСклады,СтраницаПартии,СтраницаОстаткиПоЯчейкам,СтраницаМинимальныеОстатки,СтраницыАналогиНоменклатуры,СтраницаЗамены,СтраницаЗаказыПоставщикам,СтраницаЗаказыПокупателей,СтраницаЦеныКомпании,СтраницаЦеныКонтрагентов,СтраницаПрайсЛистыКонтрагентов,СтраницаЦеныСогласованные,СтраницаЦеныПоГруппамПоставки,СтраницаАссортимент,СтраницаЦеныУценки");
	Для Каждого Вкладка Из СписокНазванийВкладок Цикл
		ТаблицаПризнаковОткрытияВкладок.Добавить(Вкладка.Ключ);
	КонецЦикла;
	
	Элементы.ФормаУпущенныйСпрос.Видимость = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УпущенныйСпрос);
	
	// В режиме веб-клиента произведем показ кнопки изменения текущего объекта
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		Элементы.ФормаДобавитьВКорзину.Видимость = Истина;
		Элементы.СписокКонтекстноеМенюДобавитьВКорзину.Видимость = Истина;
		Элементы.ХарактеристикиДобавитьВКорзину.Видимость = Истина;
	КонецЕсли;
	
	//тк+
	// Настроим поиск и отбор
	НастроитьПолеОтбора();
	//тк-
	//Проверяем право доступа к командам заполнения товаров в оборудовании 
	Элементы.ФормаВыгрузитьТоварВОборудование.Доступность = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ТоварыВОборудовании);
	
	Элементы.ФормаВыгрузитьТоварВОборудование.Доступность = ПравоПользователя("итРазрешитьРедактированиеТоваровВОборудованииИзНоменклатуры");
	Элементы.ФормаУстановитьМоментИзменения.Доступность = ПравоПользователя("итРазрешитьРедактированиеТоваровВОборудованииИзНоменклатуры");
	
	ХозОперацияВладелец = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ХозОперация", Справочники.ХозОперации.ПустаяСсылка());
	Если НЕ ХозОперацияВладелец = Справочники.ХозОперации.ПустаяСсылка() Тогда
		ВидДоговораПродажа = (ХозОперацияВладелец.ВидОперации = Перечисления.ВидыОперацийДоговора.Продажа);
	Иначе 
		ВидДоговораПродажа = Ложь;
	КонецЕсли;
	
	//Проверка права на множественный выбор
	Элементы.МножественныйВыбор.Пометка = Ложь;
	Если ПравоПользователя(ПланыВидовХарактеристик.ПраваИНастройки.МножественныйВыборВПодборе) Тогда
		Элементы.МножественныйВыбор.Доступность = Истина;
	Иначе
		Элементы.МножественныйВыбор.Доступность = Ложь;
	КонецЕсли;
	
	//Проверка использования фильтра по подразделениям
	Если ПравоПользователя(ПланыВидовХарактеристик.ПраваИНастройки.КонтролироватьПодразделение) = Перечисления.ВидыКонтроля.Запрещать 
		ИЛИ ПравоПользователя(ПланыВидовХарактеристик.ПраваИНастройки.КонтролироватьПодразделение) = Перечисления.ВидыКонтроля.Предупреждать Тогда
		Элементы.ОтборПоПодразделениюПользователя.Доступность = Ложь;
		ВсеПодразделения = Ложь;
	Иначе
		Элементы.ОтборПоПодразделениюПользователя.Доступность = Истина;
		ВсеПодразделения = Истина;	
	КонецЕсли;
	Элементы.ОтборПоПодразделениюПользователя.Пометка = НЕ ВсеПодразделения;
	ВидКонтроля = ПравоПользователя(ПланыВидовХарактеристик.ПраваИНастройки.КонтролироватьПодразделение);
	
	// + Конов
	итИспользоватьАльтернативнуюИерархию = Истина;
	РежимИспользоватьАльтернативнуюИерархиюПриИзменении();
	Список.Параметры.УстановитьЗначениеПараметра("ИспользоватьДопИерархию",итИспользоватьАльтернативнуюИерархию);
	Список.Параметры.УстановитьЗначениеПараметра("ДопИерархия",Справочники.ИерархияАльтернативная.ВсяИерархия);
	// - Конов
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода, СчитывательМагнитныхКарт");
	// Конец ПодключаемоеОборудование
	
	Если ЭтотОбъект.РежимПодбора Тогда
		Элементы.ФормаВыбрать.Заголовок = НСтр("ru = 'Завершить подбор'");
	КонецЕсли;
	СтраницыПриСменеСтраницы(Элементы, Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница);
	Если ВидКонтроля = ПредопределенноеЗначение("Перечисление.ВидыКонтроля.Предупреждать") И НЕ ВсеПодразделения Тогда
		ПодключитьОбработчикОжидания("ВопросОтключенияОтбораПодразделения",1,Истина);
	КонецЕсли;
	
	// + Конов
	РежимИспользоватьАльтернативнуюИерархию("");	
	// - Конов
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимПодбора ИЛИ Элементы.СтраницаКорзина.Видимость Тогда
		УправлениеДиалогомКлиент.ПроверитьМодифицированностьДанныхПриЗакрытии(ЭтотОбъект,Отказ,Новый ОписаниеОповещения("Подключаемый_ПередЗакрытием", ЭтотОбъект));
	КонецЕсли;
	
	ПоследняОткрытаяСтраница = Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя;

	//// Сохраням настроки открытия формы для пользователя
	//СохранитьНастройки();
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	Если ИмяСобытия = "КорзинаЗаписана" Тогда
		ЭтотОбъект.Модифицированность = Ложь
	КонецЕсли; 
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на клиенте при вызове метода ОповеститьОбАктивизации из формы-владельца.
//
// Параметры:
//  АктивныйОбъект - Произвольный     - Активный объект.
//  Источник       - УправляемаяФорма - Форма, источник сообщения.
//
&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаАктивизации(ЭтотОбъект, АктивныйОбъект, Источник) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаАктивизации()

// Обработчик события возникающего на клиенте при записи объекта в одной из подчиненных форм.
//
// Параметры:
//  НовыйОбъект          - Произвольный     - Добавленный в подчиненной форме объект.
//  Источник             - УправляемаяФорма - Форма, источник сообщения.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(НовыйОбъект)=Тип("СправочникСсылка.ХарактеристикиНоменклатуры") И Элементы.СтраницыСписки.ТекущаяСтраница = Элементы.СтраницаХарактеристики Тогда
		
		ОбновитьСписокХарактеристик();
		Элементы.Список.Обновить();
		Элементы.Список.ТекущаяСтрока = ЭтотОбъект.ВыбраннаяНоменклатура;
		
		МассивСтрок = Характеристики.НайтиСтроки(Новый Структура("ХарактеристикаНоменклатуры", НовыйОбъект));
		Если МассивСтрок.Количество() > 0 Тогда
			НужнаяСтрока = МассивСтрок[0];
			Элементы.Характеристики.ТекущаяСтрока = НужнаяСтрока.ПолучитьИдентификатор();
			ХарактеристикиПриАктивизацииСтроки(Элементы.Характеристики);
		КонецЕсли;
		
	Иначе
		
		// Вызываем общий обработчик события
		Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаЗаписиНового(ЭтотОбъект, НовыйОбъект, Источник, СтандартнаяОбработка) Тогда
			Возврат;
		КонецЕсли;
		
		// обновим строки в таблицах замен с учетом нового объекта
		Если НЕ ТипЗнч(НовыйОбъект)=Тип("РегистрСведенийКлючЗаписи.Корзина") Тогда
			ОбновитьТаблицуЗамен(НовыйОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаписиНового()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
	// Производим сохранение параметра отображения дерева элементов
	Настройки.Вставить("ДеревоВидимость", Элементы.Дерево.Видимость ИЛИ Элементы.Параметры.Видимость);
	
	// Производим сохранение параметров отображения страниц расширенной информации
	Настройки.Вставить("СтраницаКорзинаВидимость", Элементы.СтраницаКорзина.Видимость);
	
	// Сохраням настроки открытия формы для пользователя
	Настройки.Вставить("ИмяСтраницы", ПоследняОткрытаяСтраница);
	
	// Сохраням настроки фильтра по подразделениям
	//Настройки.Вставить("ФильтрПоПодразделениям", ВсеПодразделения);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из
// сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Восстанавливаем параметры отображения дерева элементов
	Если Настройки.Получить("ДеревоВидимость")=ЛОЖЬ Тогда
		ИзменитьРежимЛевойПанелиНаСервере("РежимЛевойПанелиОтключить");
	Иначе
		ИзменитьРежимЛевойПанелиНаСервере("РежимЛевойПанелиДерево");
	КонецЕсли;
	//Загружаем настройки по последней открытой страницы
	ИмяСтраницы = Настройки.Получить("ИмяСтраницы");
	Если ЗначениеЗаполнено(ИмяСтраницы) Тогда
		СохраненнаяСтраница = Элементы.СтраницыРасширеннаяИнформация.ПодчиненныеЭлементы.Найти(ИмяСтраницы);
		Если НЕ СохраненнаяСтраница = Неопределено Тогда
			Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница = СохраненнаяСтраница;
		КонецЕсли;
	КонецЕсли;
	
	//Если НЕ ВидКонтроля = Перечисления.ВидыКонтроля.НеКонтролировать Тогда
	//	ВсеПодразделения = Истина;
	//	Элементы.ОтборПоПодразделениюПользователя.Пометка = НЕ ВсеПодразделения;
	//	Возврат;
	//КонецЕсли;
	//
	//Загружаем настройки фильтра по подразделениям
	//ФильтрПоПодразделениям = Настройки.Получить("ФильтрПоПодразделениям");
	//Если ЗначениеЗаполнено(ФильтрПоПодразделениям) Тогда
	//	ВсеПодразделения = ФильтрПоПодразделениям;
	//Иначе 
	//	ВсеПодразделения = Истина;
	//КонецЕсли;
	Элементы.ОтборПоПодразделениюПользователя.Пометка = НЕ ВсеПодразделения;

КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

// Обработчик события, возникающего при нажатии кнопки "Отключить отбор"  на сервере
//
&НаСервере
Процедура ОтключитьОтборНаСервере()
	
	ДеревоОтбор = Отбор.ПолучитьЭлементы();
	Для Каждого СтрокаОтбора Из ДеревоОтбор Цикл
		СтрокаОтбора.Использование = Ложь;
	КонецЦикла;

КонецПроцедуры

// Обработчик события, возникающего на клиенте при нажатии кнопки "Отключить отбор"
//
&НаКлиенте
Процедура ОтключитьОтбор(Команда = Неопределено)
	
	Элементы.ПоискПоУсловию.Пометка = Ложь;
	//ОтключитьОтборНаСервере();
	ОбновитьНастройкиОтбора();

КонецПроцедуры

&НаСервере
Процедура БыстрыйПоискИОтборНаСервере()
	
	ТекстСтарый = 
	"ВЫБРАТЬ ПЕРВЫЕ 500
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВтТабл
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа %УсловиеНоменклатура%
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 500
	|	Штрихкоды.Объект
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Штрихкоды.Объект) = ТИП(Справочник.Номенклатура) %УсловиеШтрихКод%
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 500
	|	ВтТабл.Ссылка КАК Ссылка
	|ИЗ
	|	ВтТабл КАК ВтТабл";
	
	ШаблонПоиска = НаименованиеНесколькоВхождений;
	
	ШаблонПоиска = СтрЗаменить(ШаблонПоиска, "~", "~~");
	ШаблонПоиска = СтрЗаменить(ШаблонПоиска, "%", "~%");
	ШаблонПоиска = СтрЗаменить(ШаблонПоиска, "_", "~_");
	ШаблонПоиска = СтрЗаменить(ШаблонПоиска, "[", "~[");
	ШаблонПоиска = СтрЗаменить(ШаблонПоиска, "-", "~-");
	ШаблонПоиска = СтрЗаменить(ШаблонПоиска, "-", "~-");
	ШаблонПоиска = СтрЗаменить(ШаблонПоиска, """", " ");
	ШаблонПоиска = СтрЗаменить(ШаблонПоиска, "  ", " ");
		
	Если НЕ ПустаяСтрока(ШаблонПоиска) Тогда
		ТекстУсловияНесколькихВхожденийНоменклатура=" И (";
		ТекстУсловияНесколькихВхожденийШтрихКод=" И (";
		Сч=0;
		Стр1=СокрЛП(ШаблонПоиска);
		Если Найти(Стр1,"=")=0 Тогда
			Стр1 = СтрЗаменить(Стр1," ","=");
		КонецЕсли;
		Пока Найти(Стр1,"==")>0 Цикл
			Стр1 = СтрЗаменить(Стр1,"==","=");
		КонецЦикла;
		
		ПозицияСимвола=Найти(Стр1,"=");
		Пока ПозицияСимвола>0 Цикл
			Стр2=Лев(Стр1,ПозицияСимвола-1);
			ТекстУсловияНесколькихВхожденийНоменклатура=ТекстУсловияНесколькихВхожденийНоменклатура+?(Сч=0,""," И ")+"Номенклатура.Код + ""|"" + Номенклатура.Артикул + ""|"" + Номенклатура.Наименование ПОДОБНО ""%"+Стр2+"%""";
			ТекстУсловияНесколькихВхожденийШтрихКод=ТекстУсловияНесколькихВхожденийШтрихКод+?(Сч=0,""," И ")+"ШтрихКоды.ШтрихКод ПОДОБНО ""%"+Стр2+"%""";
			ПозицияСимвола2=СтрДлина(Стр1)-ПозицияСимвола;
			Стр1=Прав(Стр1,ПозицияСимвола2);
			ПозицияСимвола=Найти(Стр1,"=");
			Сч=Сч+1;
		КонецЦикла;
		Если Не ПустаяСтрока(Стр1) Тогда
			ТекстУсловияНесколькихВхожденийНоменклатура=ТекстУсловияНесколькихВхожденийНоменклатура+?(Сч=0,""," И ")+"Номенклатура.Код + ""|"" + Номенклатура.Артикул + ""|"" + Номенклатура.Наименование ПОДОБНО ""%"+Стр1+"%""";
			ТекстУсловияНесколькихВхожденийШтрихКод=ТекстУсловияНесколькихВхожденийШтрихКод+?(Сч=0,""," И ")+"ШтрихКоды.ШтрихКод ПОДОБНО ""%"+Стр1+"%""";
			Сч=Сч+1;
		КонецЕсли;
		Если Сч=0 Тогда
			ТекстУсловияНесколькихВхожденийНоменклатура="";
			ТекстУсловияНесколькихВхожденийШтрихКод="";
		Иначе
			ТекстУсловияНесколькихВхожденийНоменклатура=ТекстУсловияНесколькихВхожденийНоменклатура+")";
			ТекстУсловияНесколькихВхожденийШтрихКод=ТекстУсловияНесколькихВхожденийШтрихКод+")";
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстУсловияНесколькихВхожденийНоменклатура) Тогда
		ТекстСтарый = СтрЗаменить(ТекстСтарый, "%УсловиеНоменклатура%", ТекстУсловияНесколькихВхожденийНоменклатура);
		ТекстСтарый = СтрЗаменить(ТекстСтарый, "%УсловиеШтрихКод%", 	ТекстУсловияНесколькихВхожденийШтрихКод);
		ТекстНовый = ТекстСтарый;
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстНовый);
	Выборка = Запрос.Выполнить().Выбрать();
	СписокНоменклатур = Новый Массив;
	Пока Выборка.Следующий() Цикл
		СписокНоменклатур.Добавить(Выборка.Ссылка);
	КонецЦикла;
		
	Если СписокНоменклатур.Количество() = 500 Тогда
		СообщениеПользователю = НСтр("ru = 'Найдено позиций более 500, выводятся первые 500'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПользователю,,,,);
	КонецЕсли;
	
	ДеревоОтбор = Отбор.ПолучитьЭлементы();
	ОтборСКД    = Неопределено;
	Для Каждого ЭлементКомпоновщика Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементКомпоновщика) = Тип("ОтборКомпоновкиДанных") Тогда
			ОтборСКД = ЭлементКомпоновщика;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ОтборСКД<>Неопределено Тогда
		
		ОбъектНастройки = ОтборСКД.Элементы;
		
		СписокЭлементовОтбора = Новый СписокЗначений;
		ПолеКомпоновкиСсылка = Новый ПолеКомпоновкиДанных("Ссылка");
		Для Каждого ЭлементОбъекта Из ОбъектНастройки Цикл
			Если ЭлементОбъекта.ЛевоеЗначение = ПолеКомпоновкиСсылка Тогда
				СписокЭлементовОтбора.Добавить(ЭлементОбъекта);
			КонецЕсли;
		КонецЦикла;
		
		Если СписокЭлементовОтбора.Количество() = 0 Тогда
			СписокЭлементовОтбора.Добавить(ОбъектНастройки.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")));
		КонецЕсли;
		
		Для Каждого ЭлементСписка Из СписокЭлементовОтбора Цикл
			ЭлементОтбора = ЭлементСписка.Значение;
			ЭлементОтбора.Использование  = Истина;
			ЭлементОтбора.ЛевоеЗначение  = ПолеКомпоновкиСсылка;
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение = СписокНоменклатур;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры  // БыстрыйПоискИОтборНаСервере()


// Обработчик события, возникающего на клиенте при нажатии кнопки "Быстрый поиск и отбор"
//
&НаКлиенте
Процедура БыстрыйПоискИОтбор(Команда)
	
	Если НЕ Элементы.ПоискПоУсловию.Доступность Тогда
		Элементы.ПоискПоУсловию.Доступность = Истина;
		Элементы.ФормаКнопкаОтборF7.Пометка = Ложь;
		//ОтключитьОтборНаСервере();
		ОбновитьНастройкиОтбора();
	Иначе
		тПоиск = ?(НаименованиеНесколькоВхождений=Неопределено,"",НаименованиеНесколькоВхождений);
		ПоказатьВводСтроки(Новый ОписаниеОповещения("БыстрыйПоискИОтборЗавершение", ЭтаФорма),тПоиск,"Введите строку поиска...(вводите условия через пробел или знак '=')"); 
	КонецЕсли;
	
КонецПроцедуры  //  БыстрыйПоискИОтбор()

// Обработчик события, возникающего на клиенте при нажатии кнопки "Поиск по условию"
//
&НаКлиенте
Процедура ВключитьОтбор(Команда)
	
	Элементы.ПоискПоУсловию.Пометка = НЕ Элементы.ПоискПоУсловию.Пометка;
	
	Если НЕ Элементы.ПоискПоУсловию.Пометка Тогда
		//ОтключитьОтборНаСервере();
		Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
	Иначе
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
	
	ОбновитьНастройкиОтбора();
	
КонецПроцедуры // ВключитьОтбор()

&НаКлиенте
Процедура НаценкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВыбраннаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Наценки.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура("Номенклатура, ТипЦен", ТекущиеДанные.ОбъектНаценки, ТекущиеДанные.ТипЦен);
	ОткрытьФорму("РегистрСведений.Наценки.Форма.ФормаИстории", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "АссортиментФорматов".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура АссортиментФорматовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.АссортиментФорматов.ТекущиеДанные;
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Формат", ТекущиеДанные.Формат);
	ПараметрыОтбора.Вставить("Номенклатура", Элементы.Список.ТекущиеДанные.Ссылка);
	ОткрытьФорму("РегистрСведений.АссортиментФорматов.ФормаСписка", Новый Структура("Отбор", ПараметрыОтбора), ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //АссортиментФорматовВыбор()

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Форматы".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ФорматыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Форматы.ТекущиеДанные;
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Формат", ТекущиеДанные.Формат);
	ПараметрыОтбора.Вставить("ПодразделениеКомпании", ТекущиеДанные.ПодразделениеКомпании);
	ПараметрыОтбора.Вставить("Номенклатура", Элементы.Список.ТекущиеДанные.Ссылка);
	ОткрытьФорму("РегистрСведений.ФорматыАссортиментаПодразделений.ФормаСписка", Новый Структура("Отбор", ПараметрыОтбора), ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //ФорматыВыбор()

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Ассортимент".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура АссортиментВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Ассортимент.ТекущиеДанные;
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("ПодразделениеКомпании", ТекущиеДанные.ПодразделениеКомпании);
	ПараметрыОтбора.Вставить("Номенклатура", Элементы.Список.ТекущиеДанные.Ссылка);
	ОткрытьФорму("РегистрСведений.ОграничениеАссортиментаПодразделения.ФормаСписка", Новый Структура("Отбор", ПараметрыОтбора), ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //АссортиментВыбор()

&НаКлиенте
Процедура ЦеныУценкаТовараВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВыбраннаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийЭлементТаблицыИмя = Элементы.ЦеныУценкаТовара.ТекущийЭлемент.Имя;
	ТекущийЭлементТаблицыИмя = СтрЗаменить(ТекущийЭлементТаблицыИмя, Элементы.ЦеныУценкаТовара.Имя, "");
	ТекущийЭлементТаблицы = Элементы.ЦеныУценкаТовара.ТекущиеДанные[ТекущийЭлементТаблицыИмя]; 

	ПараметрыДляФормы = ПолучитьПараметрыОткрытияФормы(ТекущийЭлементТаблицы);
	ПараметрыОтбора = Новый Структура();
	Если ПараметрыДляФормы = Неопределено Тогда
		ПараметрыОтбораРегистра = Новый Структура("Номенклатура", Элементы.Список.ТекущиеДанные.Ссылка);
		ПараметрыОтбора.Вставить("Отбор", ПараметрыОтбораРегистра);
		ПараметрыДляФормы = Новый Структура("Форма", "РегистрСведений.УценкаТовара.ФормаСписка");
	Иначе            								 
		ПараметрыОтбора.Вставить("Ключ", ТекущийЭлементТаблицы);
	КонецЕсли;
	
	// необходимо для корректного сообщения в режиме ограниченного доступа
	Попытка
		ОткрытьФорму(ПараметрыДляФормы.Форма, ПараметрыОтбора, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Исключение
		ТекстОшибки=ИнформацияОбОшибке();
		Если ТекстОшибки.Причина.Описание= НСтр("ru = 'Недостаточно прав для просмотра'")
			ИЛИ ТекстОшибки.Причина.Описание = 
			НСтр("ru = 'У пользователя недостаточно прав на исполнение операции над базой данных.'") Тогда
			ВывестиСообщение(ТекстОшибки.Причина.Описание);
		Иначе
			ВызватьИсключение;
		КонецЕсли;
	КонецПопытки;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПараметрыОткрытияФормы(ТекущийЭлементТаблицы = Неопределено)
	
	Результат = Неопределено;
	Если ТекущийЭлементТаблицы = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущийЭлементТаблицы) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(ТекущийЭлементТаблицы);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
	Если НЕ ОбъектМетаданных = Неопределено И Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Результат = Новый Структура;
		Результат.Вставить("Форма", "Справочник."+ОбъектМетаданных.Имя+".ФормаОбъекта");
	ИначеЕсли НЕ ОбъектМетаданных = Неопределено И Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Результат = Новый Структура;
		Результат.Вставить("Форма", "Документ."+ОбъектМетаданных.Имя+".ФормаОбъекта");
	КонецЕсли;
	Возврат Результат;
	
КонецФункции // ПолучитьПараметрыОткрытияФормы()

// + Конов

Процедура РежимИспользоватьАльтернативнуюИерархиюНаСервере(Переключить = Истина)
	Если Переключить Тогда
		итИспользоватьАльтернативнуюИерархию = НЕ итИспользоватьАльтернативнуюИерархию;
	КонецЕсли;

	РежимИспользоватьАльтернативнуюИерархиюПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура РежимИспользоватьАльтернативнуюИерархию(Команда)
	РежимИспользоватьАльтернативнуюИерархиюНаСервере(?(Команда="",Ложь,Истина));
	Если итИспользоватьАльтернативнуюИерархию  и НЕ Элементы.Список.Отображение = ОтображениеТаблицы.Список Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	ИначеЕсли НЕ Команда="" и не Элементы.Список.Отображение = ОтображениеТаблицы.Дерево Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Дерево;
	КонецЕсли;
	
	Элементы.РежимИспользоватьАльтернативнуюИерархию.Пометка = итИспользоватьАльтернативнуюИерархию;
КонецПроцедуры

&НаСервере
Процедура РежимИспользоватьАльтернативнуюИерархиюПриИзменении()
	Элементы.Дерево.Видимость = НЕ итИспользоватьАльтернативнуюИерархию;
	Элементы.ДеревоДопИерархия.Видимость = итИспользоватьАльтернативнуюИерархию;
	Список.Параметры.УстановитьЗначениеПараметра("ИспользоватьДопИерархию",итИспользоватьАльтернативнуюИерархию);
КонецПроцедуры	


&НаСервере
Процедура СравнитьСтрокиПоИерархии()
	Если НЕ Элементы.ДеревоДопИерархия.ТекущаяСтрока = Неопределено и 
		(НЕ Элементы.Список.ТекущаяСтрока = Неопределено) и 
		(не ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")) Тогда
		Если НЕ Элементы.Список.ТекущаяСтрока.ИерархияАльтернативная = Элементы.ДеревоДопИерархия.ТекущаяСтрока и НЕ Элементы.ДеревоДопИерархия.ТекущаяСтрока.Родитель.Пустая() Тогда
			Элементы.ДеревоДопИерархия.ТекущаяСтрока = Элементы.Список.ТекущаяСтрока.ИерархияАльтернативная;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
// - Конов

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
