
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Полный комлект
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПолныйКомплект";
	КомандаПечати.Представление = НСтр("ru = 'Полный комплект'");
	КомандаПечати.Порядок		= 10; 
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Приказ об инвентаризации
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПриказОбИнвентаризации";
	КомандаПечати.Представление = НСтр("ru = 'Приказ об инвентаризации'");
	КомандаПечати.Порядок		= 20;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// ИНВ-19 (Сличительная ведомость)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СличительнаяВедомостьИНВ19";
	КомандаПечати.Представление = НСтр("ru = 'Сличительная ведомость (ИНВ-19)'");
	КомандаПечати.Порядок		= 30;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// ИНВ-3 (Инвентаризационная опись товаров пустая)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИнвентаризационнаяОписьИНВ3";
	КомандаПечати.Представление = НСтр("ru = 'Инвентаризационная опись товаров (ИНВ-3)'");
	КомандаПечати.Порядок		= 40;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Объяснительная по недостаче
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ОбъяснительнаяПоНедостаче";
	КомандаПечати.Представление = НСтр("ru = 'Объяснительная по недостаче'");
	КомандаПечати.Порядок		= 50;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Заявление на удержание
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗаявлениеНаУдержание";
	КомандаПечати.Представление = НСтр("ru = 'Заявление на удержание'");
	КомандаПечати.Порядок		= 60;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Приказ на удержание
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПриказОбУдержании";
	КомандаПечати.Представление = НСтр("ru = 'Приказ об удержании'");
	КомандаПечати.Порядок		= 70;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Заявка на погашение недостачи
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗаявкаНаПогашениеНедостачи";
	КомандаПечати.Представление = НСтр("ru = 'Заявка на погашение недостачи'");
	КомандаПечати.Порядок		= 80;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрДокументов";
	КомандаПечати.Представление = НСтр("ru = 'Реестр документов'");
	КомандаПечати.Порядок		= 90;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если ПараметрыПечати.Свойство("МассивИнвентаризаций") Тогда
		МассивИнвентаризаций = ПараметрыПечати.МассивИнвентаризаций;
	Иначе
		МассивИнвентаризаций = Новый Массив();
	КонецЕсли;
	
	ДанныеПечати = ПодготовитьДанныеПечати(МассивОбъектов, МассивИнвентаризаций);
	
	// ПОЛНЫЙ КОМПЛЕКТ
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПолныйКомплект") Тогда
		КоллекцияПечатныхФорм.Очистить();
		
		// Приказ об инвентаризации
		НовыйМакет = КоллекцияПечатныхФорм.Добавить();
		НовыйМакет.ИмяМакета	= "ПриказОбИнвентаризации";
		НовыйМакет.ИмяВРЕГ		= ВРег(НовыйМакет.ИмяМакета);
		НовыйМакет.Экземпляров	= 1;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ПриказОбИнвентаризации", 
			"Приказ об инвентаризации", 
			Печать_ПриказОбИнвентаризации(ДанныеПечати, ОбъектыПечати, ПараметрыПечати));
			
		// ИНВ-19 (Сличительная ведомость)	
		НовыйМакет = КоллекцияПечатныхФорм.Добавить();
		НовыйМакет.ИмяМакета	= "СличительнаяВедомостьИНВ19";
		НовыйМакет.ИмяВРЕГ		= ВРег(НовыйМакет.ИмяМакета);
		НовыйМакет.Экземпляров	= 1;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"СличительнаяВедомостьИНВ19", 
			"Сличительная ведомость (ИНВ-19)", 
			Печать_СличительнаяВедомостьИНВ19(ДанныеПечати, ОбъектыПечати, ПараметрыПечати));
		
		// ИНВ-3 (Инвентаризационная опись товаров пустая)		
		НовыйМакет = КоллекцияПечатныхФорм.Добавить();
		НовыйМакет.ИмяМакета	= "ИнвентаризационнаяОписьИНВ3";
		НовыйМакет.ИмяВРЕГ		= ВРег(НовыйМакет.ИмяМакета);
		НовыйМакет.Экземпляров	= 1;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ИнвентаризационнаяОписьИНВ3", 
			"Инвентаризационная опись (ИНВ-3)", 
			Печать_ИнвентаризационнаяОписьИНВ3(ДанныеПечати, ОбъектыПечати, ПараметрыПечати));
		
		// Объяснительная по недостаче	
		НовыйМакет = КоллекцияПечатныхФорм.Добавить();
		НовыйМакет.ИмяМакета	= "ОбъяснительнаяПоНедостаче";
		НовыйМакет.ИмяВРЕГ		= ВРег(НовыйМакет.ИмяМакета);
		НовыйМакет.Экземпляров	= 1;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ОбъяснительнаяПоНедостаче", 
			"Объяснительная по недостаче", 
			Печать_ОбъяснительнаяПоНедостаче(ДанныеПечати, ОбъектыПечати, ПараметрыПечати));
		
		// Заявление на удержание
		НовыйМакет = КоллекцияПечатныхФорм.Добавить();
		НовыйМакет.ИмяМакета	= "ЗаявлениеНаУдержание";
		НовыйМакет.ИмяВРЕГ		= ВРег(НовыйМакет.ИмяМакета);
		НовыйМакет.Экземпляров	= 1;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ЗаявлениеНаУдержание", 
			"Заявление на удержание", 
			Печать_ЗаявлениеНаУдержание(ДанныеПечати, ОбъектыПечати, ПараметрыПечати));
			
		// Приказ об удержании
		НовыйМакет = КоллекцияПечатныхФорм.Добавить();
		НовыйМакет.ИмяМакета	= "ПриказОбУдержании";
		НовыйМакет.ИмяВРЕГ		= ВРег(НовыйМакет.ИмяМакета);
		НовыйМакет.Экземпляров	= 1;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриказОбУдержании") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм, 
				"ПриказОбУдержании", 
				"Приказ об удержании", 
				Печать_ПриказОбУдержании(ДанныеПечати, ОбъектыПечати, ПараметрыПечати));
		КонецЕсли;
		
		// Заявка на погашение недостачи
		НовыйМакет = КоллекцияПечатныхФорм.Добавить();
		НовыйМакет.ИмяМакета	= "ЗаявкаНаПогашениеНедостачи";
		НовыйМакет.ИмяВРЕГ		= ВРег(НовыйМакет.ИмяМакета);
		НовыйМакет.Экземпляров	= 1;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявкаНаПогашениеНедостачи") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ЗаявкаНаПогашениеНедостачи", 
			"Заявка на погашение недостачи", 
			Печать_ЗаявкаНаПогашениеНедостачи(ДанныеПечати, ОбъектыПечати, ПараметрыПечати));
		КонецЕсли;
		
		// Реестр документов
		НовыйМакет = КоллекцияПечатныхФорм.Добавить();
		НовыйМакет.ИмяМакета	= "РеестрДокументов";
		НовыйМакет.ИмяВРЕГ		= ВРег(НовыйМакет.ИмяМакета);
		НовыйМакет.Экземпляров	= 1;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрДокументов") Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм, 
				"РеестрДокументов", 
				"Реестр документов", 
				Печать_РеестрДокументов(ДанныеПечати, ОбъектыПечати, ПараметрыПечати));
		КонецЕсли;	
	КонецЕсли;//Печать полного комплекта
	
	// ПРИКАЗ ОБ ИНВЕНТАРИЗАЦИИ
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриказОбИнвентаризации") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ПриказОбИнвентаризации", 
			"Приказ об инвентаризации", 
			Печать_ПриказОбИнвентаризации(ДанныеПечати, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
	// СЛИЧИТЕЛЬНАЯ ВЕДОМОСТЬ ИНВ 19
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СличительнаяВедомостьИНВ19") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"СличительнаяВедомостьИНВ19", 
			"Сличительная ведомость (ИНВ-19)", 
			Печать_СличительнаяВедомостьИНВ19(ДанныеПечати, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
	// ИНВЕНТАРИЗАЦОННАЯ ОПИСЬ ИНВ 3
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИнвентаризационнаяОписьИНВ3") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ИнвентаризационнаяОписьИНВ3", 
			"Инвентаризационная опись (ИНВ-3)", 
			Печать_ИнвентаризационнаяОписьИНВ3(ДанныеПечати, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
	// ОБЪЯСНИТЕЛЬНАЯ ПО НЕДОСТАЧЕ
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОбъяснительнаяПоНедостаче") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ОбъяснительнаяПоНедостаче", 
			"Объяснительная по недостаче", 
			Печать_ОбъяснительнаяПоНедостаче(ДанныеПечати, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
	// ЗАЯВЛЕНИЕ НА УДЕРЖАНИЕ
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявлениеНаУдержание") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ЗаявлениеНаУдержание", 
			"Заявление на удержание", 
			Печать_ЗаявлениеНаУдержание(ДанныеПечати, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
	// ПРИКАЗ ОБ УДЕРЖАНИИ
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриказОбУдержании") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ПриказОбУдержании", 
			"Приказ об удержании", 
			Печать_ПриказОбУдержании(ДанныеПечати, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
		
	// ЗАЯВКА НА ПОГАШЕНИЕ НЕДОСТАЧИ
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявкаНаПогашениеНедостачи") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ЗаявкаНаПогашениеНедостачи", 
			"Заявка на погашение недостачи", 
			Печать_ЗаявкаНаПогашениеНедостачи(ДанныеПечати, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;	
	
	// РЕЕСТР ДОКУМЕНТОВ
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрДокументов") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"РеестрДокументов", 
			"Реестр документов", 
			Печать_РеестрДокументов(ДанныеПечати, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьИнвентаризацииВПакете(Объект) Экспорт
	
	ПараметрыПостроения	= ИТ_СпециальныйМодульСервер.ПолучитьПараметрыПостроения(,
		НачалоДня(Объект.НачалоПериода), 
		КонецДня(Объект.КонецПериода),,,,,,,,
		Истина, 
		Объект.ЛинейныйМенеджер,,,,, 
		Истина,, "ЕРПМастерКлюч");
		
	ДанныеМагазинов			= ИТ_СпециальныйМодульСервер.ПолучитьДанныеПоМагазинам(ПараметрыПостроения);
	МассивКлючейМагазинов	= ДанныеМагазинов.ВыгрузитьКолонку("Магазин_ЕРПМастерКлюч");
	
	//Заполнение инвентаризаций и продавцов
	Запрос			= Новый Запрос();
	СхемаЗапроса	= Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ит_Продавцы.ФизическоеЛицо.ЕРПМастерКлюч КАК ЕРПМастерКлюч
		|ИЗ
		|	Справочник.ит_Продавцы КАК ит_Продавцы
		|ГДЕ
		|	ит_Продавцы.ЕРПМастерКлюч <> """"");

	Запрос.Текст			= СхемаЗапроса.ПолучитьТекстЗапроса();
	РезультатЗапроса		= Запрос.Выполнить();
	ТаблицаМастерКлючей		= РезультатЗапроса.Выгрузить();
	ХранилищеМастерКлючей	= Новый ХранилищеЗначения(ТаблицаМастерКлючей);
	WSПрокси				= ИТ_СпециальныйМодульСервер.СоздатьWSПроксиПоКлючу("mysteryshopper_ocenkaprodavcov");
	Сутки = 86400;
	НачалоПериода = Объект.НачалоПериода - 60*Сутки;
	СериализованныеДанные	= WSПрокси.dannietabelya(НачалоПериода, Объект.КонецПериода, ХранилищеМастерКлючей).Получить();
	ТаблицаПродавцов		= ИТ_СпециальныйМодульСервер.Десериализовать(СериализованныеДанные);
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ТаблицаПродавцов.Дата, ДЕНЬ) КАК Период_День,
	               |	ТаблицаПродавцов.ПродавецЕРПМастерКлюч КАК ФизЛицо_ЕРПМастерКлюч,
	               |	ТаблицаПродавцов.ТорговаяТочкаЕРПМастерКлюч КАК Магазин_ЕРПМастерКлюч,
	               |	ТаблицаПродавцов.Часов КАК Часов
	               |ПОМЕСТИТЬ ТаблицаПродавцов
	               |ИЗ
	               |	&ТаблицаПродавцов КАК ТаблицаПродавцов
	               |ГДЕ
	               |	ТаблицаПродавцов.ПродавецЕРПМастерКлюч <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПродавцов.ФизЛицо_ЕРПМастерКлюч КАК ФизЛицо_ЕРПМастерКлюч,
	               |	ТаблицаПродавцов.Магазин_ЕРПМастерКлюч КАК Магазин_ЕРПМастерКлюч,
	               |	СУММА(ТаблицаПродавцов.Часов) КАК Часов
	               |ПОМЕСТИТЬ ТаблицаПродавцовСОтработаннымиЧасами
	               |ИЗ
	               |	ТаблицаПродавцов КАК ТаблицаПродавцов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаПродавцов.ФизЛицо_ЕРПМастерКлюч,
	               |	ТаблицаПродавцов.Магазин_ЕРПМастерКлюч
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПродавцов.Период_День КАК Период_День,
	               |	ТаблицаПродавцов.Магазин_ЕРПМастерКлюч КАК Магазин_ЕРПМастерКлюч,
	               |	ФизическиеЛица.Ссылка КАК Продавец,
	               |	ЕСТЬNULL(ит_Продавцы.Должность, """") КАК Должность
	               |ПОМЕСТИТЬ ДанныеПродавцовИМагазинов
	               |ИЗ
	               |	ТаблицаПродавцов КАК ТаблицаПродавцов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК ФизическиеЛица
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ит_Продавцы КАК ит_Продавцы
	               |			ПО ФизическиеЛица.Ссылка = ит_Продавцы.ФизическоеЛицо
	               |		ПО ТаблицаПродавцов.ФизЛицо_ЕРПМастерКлюч = ФизическиеЛица.ЕРПМастерКлюч
	               |ГДЕ
	               |	ФизическиеЛица.ЕРПМастерКлюч <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПересчетТоваров.Ссылка КАК ДокументИнвентаризация,
	               |	ПересчетТоваров.ПодразделениеКомпании КАК Магазин,
	               |	ПересчетТоваров.Дата КАК Дата,
	               |	МАКСИМУМ(ЕСТЬNULL(ПредыдущийПересчетТоваров.Дата, ДОБАВИТЬКДАТЕ(&НачалоПериода, НЕДЕЛЯ, -4))) КАК ДатаПредыдущейИнвентаризации,
	               |	ВложенныйЗапрос.Сумма КАК РезультатИнвентаризации,
	               |	ПересчетТоваров.СкладКомпании.Наименование КАК СкладКомпанииНаименование,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.Сумма < &Порог
	               |			ТОГДА ВложенныйЗапрос.Сумма + ВложенныйЗапрос.СписаниеЕстественнаяУбыль + ВложенныйЗапрос.СписаниеПредпродажнаяПодготовка
	               |		ИНАЧЕ ВложенныйЗапрос.Сумма
	               |	КОНЕЦ КАК РезультатИнвентаризацииКВозмещению
	               |ПОМЕСТИТЬ ТаблицаИнвентаризаций
	               |ИЗ
	               |	Документ.Инвентаризация КАК ПересчетТоваров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Инвентаризация КАК ПредыдущийПересчетТоваров
	               |		ПО ПересчетТоваров.ПодразделениеКомпании = ПредыдущийПересчетТоваров.ПодразделениеКомпании
	               |			И (ПредыдущийПересчетТоваров.Проведен)
	               |			И (ПредыдущийПересчетТоваров.Дата < ПересчетТоваров.Дата)
	               |			И (ПредыдущийПересчетТоваров.Дата >= ДОБАВИТЬКДАТЕ(&НачалоПериода, НЕДЕЛЯ, -4))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СУММА(ПересчетТоваровТовары.СуммаРозничная) КАК Сумма,
	               |			ПересчетТоваровТовары.Ссылка КАК Ссылка,
	               |			СУММА(ПересчетТоваровТовары.итСписаниеЕстественнаяУбыль) КАК СписаниеЕстественнаяУбыль,
	               |			СУММА(ПересчетТоваровТовары.итСписаниеПредпродажнаяПодготовка) КАК СписаниеПредпродажнаяПодготовка,
	               |			СУММА(ПересчетТоваровТовары.итСписаниеПоСрокуГодности) КАК СписаниеПоСрокуГодности
	               |		ИЗ
	               |			Документ.Инвентаризация.Товары КАК ПересчетТоваровТовары
	               |		ГДЕ
	               |			ПересчетТоваровТовары.Ссылка.Проведен
	               |			И ПересчетТоваровТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |			И ПересчетТоваровТовары.Ссылка.ПодразделениеКомпании.ЕРПМастерКлюч В(&МассивКлючейМагазинов)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ПересчетТоваровТовары.Ссылка) КАК ВложенныйЗапрос
	               |		ПО ПересчетТоваров.Ссылка = ВложенныйЗапрос.Ссылка
	               |ГДЕ
	               |	ПересчетТоваров.Проведен
	               |	И ПересчетТоваров.ПодразделениеКомпании.ЕРПМастерКлюч В(&МассивКлючейМагазинов)
	               |	И ПересчетТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПересчетТоваров.Ссылка,
	               |	ПересчетТоваров.ПодразделениеКомпании,
	               |	ПересчетТоваров.Дата,
	               |	ВложенныйЗапрос.Сумма,
	               |	ПересчетТоваров.СкладКомпании.Наименование,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.Сумма < &Порог
	               |			ТОГДА ВложенныйЗапрос.Сумма + ВложенныйЗапрос.СписаниеЕстественнаяУбыль + ВложенныйЗапрос.СписаниеПредпродажнаяПодготовка
	               |		ИНАЧЕ ВложенныйЗапрос.Сумма
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТаблицаИнвентаризаций.Магазин КАК Магазин,
	               |	ДанныеПродавцовИМагазинов.Продавец КАК Продавец,
	               |	ДанныеПродавцовИМагазинов.Должность КАК Должность,
	               |	ТаблицаИнвентаризаций.Магазин.Организация КАК ЮрЛицо,
	               |	ТаблицаИнвентаризаций.ДокументИнвентаризация КАК ДокументИнвентаризация,
	               |	ТаблицаИнвентаризаций.РезультатИнвентаризации КАК СуммаИнвентаризации,
	               |	МАКСИМУМ(ЕСТЬNULL(МагазиныКонтактнаяИнформация.Представление, """")) КАК Магазин_АдресВариантРозницы,
	               |	ЕСТЬNULL(ТаблицаПродавцовСОтработаннымиЧасами.Часов, 0) КАК ОтработаноЧасов,
	               |	ЗНАЧЕНИЕ(Перечисление.ИТ_ТипыУдержанийПоРезультатамИнвентаризаций.ИзЗарплаты) КАК ТипУдержания,
	               |	ЗНАЧЕНИЕ(Перечисление.ИТ_ВидыОперацийПакетаДокументовРезультатовИнвентаризации.ФормированиеПакетаДокументов) КАК ВидОперации,
	               |	ТаблицаИнвентаризаций.СкладКомпанииНаименование КАК Магазин_Адрес,
	               |	ТаблицаИнвентаризаций.РезультатИнвентаризацииКВозмещению КАК РезультатИнвентаризацииКВозмещению
	               |ИЗ
	               |	ТаблицаИнвентаризаций КАК ТаблицаИнвентаризаций
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПродавцовИМагазинов КАК ДанныеПродавцовИМагазинов
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПродавцовСОтработаннымиЧасами КАК ТаблицаПродавцовСОтработаннымиЧасами
	               |			ПО ДанныеПродавцовИМагазинов.Магазин_ЕРПМастерКлюч = ТаблицаПродавцовСОтработаннымиЧасами.Магазин_ЕРПМастерКлюч
	               |				И ДанныеПродавцовИМагазинов.Продавец.ЕРПМастерКлюч = ТаблицаПродавцовСОтработаннымиЧасами.ФизЛицо_ЕРПМастерКлюч
	               |		ПО (ДанныеПродавцовИМагазинов.Период_День > ТаблицаИнвентаризаций.ДатаПредыдущейИнвентаризации)
	               |			И (ДанныеПродавцовИМагазинов.Период_День <= ТаблицаИнвентаризаций.Дата)
	               |			И ТаблицаИнвентаризаций.Магазин.ЕРПМастерКлюч = ДанныеПродавцовИМагазинов.Магазин_ЕРПМастерКлюч
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании.КонтактнаяИнформация КАК МагазиныКонтактнаяИнформация
	               |		ПО ТаблицаИнвентаризаций.Магазин = МагазиныКонтактнаяИнформация.Ссылка
	               |			И (МагазиныКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	               |			И (МагазиныКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресПодразделенияКомпании))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеПродавцовИМагазинов.Должность,
	               |	ТаблицаИнвентаризаций.Магазин,
	               |	ДанныеПродавцовИМагазинов.Продавец,
	               |	ТаблицаИнвентаризаций.ДокументИнвентаризация,
	               |	ТаблицаИнвентаризаций.Магазин.Организация,
	               |	ТаблицаИнвентаризаций.РезультатИнвентаризации,
	               |	ЕСТЬNULL(ТаблицаПродавцовСОтработаннымиЧасами.Часов, 0),
	               |	ТаблицаИнвентаризаций.СкладКомпанииНаименование,
	               |	ТаблицаИнвентаризаций.РезультатИнвентаризацииКВозмещению
	               |ИТОГИ
	               |	МАКСИМУМ(Магазин),
	               |	МАКСИМУМ(ЮрЛицо),
	               |	МАКСИМУМ(СуммаИнвентаризации),
	               |	СУММА(ОтработаноЧасов),
	               |	МАКСИМУМ(ТипУдержания),
	               |	МАКСИМУМ(ВидОперации),
	               |	МАКСИМУМ(РезультатИнвентаризацииКВозмещению)
	               |ПО
	               |	ДокументИнвентаризация";

		
	Запрос.УстановитьПараметр("МассивКлючейМагазинов",	МассивКлючейМагазинов);
	Запрос.УстановитьПараметр("ТаблицаПродавцов",		ТаблицаПродавцов);
	Запрос.УстановитьПараметр("НачалоПериода",			Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",			КонецДня(Объект.КонецПериода));
	Запрос.УстановитьПараметр("Порог",					Константы.ИТ_ИгнорируемаяНедостача.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Подготовка таблицы значений для распределения сумм к удержанию и определения числится ли сотрудник в организации.
	ОписаниеТипаСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(15);
	
	ДанныеПродавцов	= Объект.Инвентаризации.Выгрузить();
	ДанныеПродавцов.Колонки.Добавить("Организация_ЕРПМастерКлюч",	ОписаниеТипаСтрока);
	ДанныеПродавцов.Колонки.Добавить("Продавец_ЕРПМастерКлюч",		ОписаниеТипаСтрока);
	
	ДанныеПродавцов.Очистить();
	
	//Нужно рассчитать сумму к удержанию с продавца пропорционально отработанному времени.
	ВыборкаДокументИнвентаризации = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументИнвентаризации.Следующий() Цикл
		
		СуммаЗадолженностиВсего	= ВыборкаДокументИнвентаризации.РезультатИнвентаризацииКВозмещению;
		ОтработаноЧасовВсего	= ВыборкаДокументИнвентаризации.ОтработаноЧасов;
		
		ДатаПредИнвентаризации  = Документы.Инвентаризация.ПолучитьДатуПредыдущейИнвентаризации(ВыборкаДокументИнвентаризации.ДокументИнвентаризация);
		Если ДатаПредИнвентаризации = НЕОПРЕДЕЛЕНО Тогда
			Сообщить("Для инвентаризации " + Строка(ВыборкаДокументИнвентаризации.ДокументИнвентаризация) + " не обнаружено предыдущей инвентаризации");
			Продолжить;
		КонецЕсли;
		
		ПродавцыТочки 		  = ТаблицаПродавцов.НайтиСтроки(Новый Структура("ТорговаяТочкаЕРПМастерКлюч",ВыборкаДокументИнвентаризации.Магазин.ЕРПМастерКлюч));
		ТаблицаПродавцовТочки = Новый ТаблицаЗначений;
		ТаблицаПродавцовТочки.Колонки.Добавить("ЕРПМастерКлюч", ОбщегоНазначения.ОписаниеТипаСтрока(15));
		Для Каждого стр Из ПродавцыТочки Цикл
			НовСтр = ТаблицаПродавцовТочки.Добавить();
			НовСтр.ЕРПМастерКлюч = стр.ПродавецЕРПМастерКлюч;
		КонецЦикла;
		ТаблицаПродавцовТочки.Свернуть("ЕРПМастерКлюч");
		
		ХранилищеМастерКлючей		= Новый ХранилищеЗначения(ТаблицаПродавцовТочки);
		WSПрокси					= ИТ_СпециальныйМодульСервер.СоздатьWSПроксиПоКлючу("mysteryshopper_ocenkaprodavcov");
		СериализованныеДанные		= WSПрокси.dannietabelya(ДатаПредИнвентаризации, ВыборкаДокументИнвентаризации.ДокументИнвентаризация.Дата, ХранилищеМастерКлючей).Получить();
		ТаблицаПродавцовОтработано	= ИТ_СпециальныйМодульСервер.Десериализовать(СериализованныеДанные);
		//ОтработаноЧасовВсего        = ТаблицаПродавцовОтработано.Итог("Часов");
		ОтработаноЧасовВсего = 0;
		Для Каждого стр Из ТаблицаПродавцовОтработано Цикл
			Если стр.ТорговаяТочкаЕРПМастерКлюч = ВыборкаДокументИнвентаризации.Магазин.ЕРПМастерКлюч Тогда
				ОтработаноЧасовВсего = ОтработаноЧасовВсего + стр.Часов;
			КонецЕсли;
		КонецЦикла;
		
		Если ОтработаноЧасовВсего = 0 Тогда
			Сообщить("В данных табеля по ТТ " + Строка(ВыборкаДокументИнвентаризации.Магазин) + " обнаружено нулевое кол-во часов работы продавцов! Сумма инвентаризации не распределена!");
			Продолжить;
		КонецЕсли;
		
		Выборка = ВыборкаДокументИнвентаризации.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ЧасыТекущегоПродавца = Выборка.ОтработаноЧасов;
			ЧасыТекущегоПродавца = 0;
			
			Если Не ЗначениеЗаполнено(Выборка.Продавец) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокиПродавца       = ТаблицаПродавцовОтработано.НайтиСтроки(Новый Структура("ПродавецЕРПМастерКлюч",Выборка.Продавец.ЕРПМастерКлюч));
			Если СтрокиПродавца.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого стрОтр Из СтрокиПродавца Цикл
				ЧасыТекущегоПродавца = ЧасыТекущегоПродавца + стрОтр.Часов;		
			КонецЦикла;
			
			НоваяСтрокаИнвентаризаций = ДанныеПродавцов.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрокаИнвентаризаций, ВыборкаДокументИнвентаризации);
					
			Если ОтработаноЧасовВсего = 0 Тогда
				СуммаЗадолженностиПродавца = 0;
			Иначе	
				СуммаЗадолженностиПродавца = Окр((СуммаЗадолженностиВсего * ЧасыТекущегоПродавца) / ОтработаноЧасовВсего, 2);
			КонецЕсли;
			
			НоваяСтрокаИнвентаризаций.СуммаКУдержанию	= СуммаЗадолженностиПродавца;
			НоваяСтрокаИнвентаризаций.Продавец 			= Выборка.Продавец;
			НоваяСтрокаИнвентаризаций.Должность			= Выборка.Должность;
			НоваяСтрокаИнвентаризаций.Магазин_Адрес		= Выборка.Магазин_Адрес;
			НоваяСтрокаИнвентаризаций.ОтработаноЧасов   = ЧасыТекущегоПродавца;
			
			НоваяСтрокаИнвентаризаций.Организация_ЕРПМастерКлюч = НоваяСтрокаИнвентаризаций.ЮрЛицо.ЕРПМастерКлюч;
			НоваяСтрокаИнвентаризаций.Продавец_ЕРПМастерКлюч	= НоваяСтрокаИнвентаризаций.Продавец.ЕРПМастерКлюч;
			
			//Надо уменьшить базы распределения, чтобы полностью вся сумма распределилась на продавцов без потерь.
			СуммаЗадолженностиВсего = СуммаЗадолженностиВсего - СуммаЗадолженностиПродавца;
			ОтработаноЧасовВсего	= ОтработаноЧасовВсего - ЧасыТекущегоПродавца;
			
		КонецЦикла;
	КонецЦикла;
	
	//Вызов универсального НТТР-сервиса в РМТО для определения числится ли сотрудник в данной организации.
	ДанныеПродавцов = ИТ_СпециальныйМодульСервер.ОпределениеЧислитсяЛиСотрудникВОрганизации(ДанныеПродавцов);
	
	Объект.Инвентаризации.Загрузить(ДанныеПродавцов);
	
	Для Каждого СтрокаДокумента Из Объект.Инвентаризации Цикл
		Если Не ЗначениеЗаполнено(СтрокаДокумента.ИдентификаторСтроки) Тогда
			СтрокаДокумента.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИнвентаризацииВПакетеПредварительныйИтог(Объект) Экспорт
	
	ПараметрыПостроения	= ИТ_СпециальныйМодульСервер.ПолучитьПараметрыПостроения(,
		НачалоДня(Объект.НачалоПериода), 
		КонецДня(Объект.КонецПериода),,,,,,,,
		Истина, 
		Объект.ЛинейныйМенеджер,,,,, 
		Истина,, "ЕРПМастерКлюч");
		
	ДанныеМагазинов			= ИТ_СпециальныйМодульСервер.ПолучитьДанныеПоМагазинам(ПараметрыПостроения);
	МассивКлючейМагазинов	= ДанныеМагазинов.ВыгрузитьКолонку("Магазин_ЕРПМастерКлюч");
	
	//Заполнение инвентаризаций и продавцов
	Запрос			= Новый Запрос();
	СхемаЗапроса	= Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ит_Продавцы.ФизическоеЛицо.ЕРПМастерКлюч КАК ЕРПМастерКлюч
		|ИЗ
		|	Справочник.ит_Продавцы КАК ит_Продавцы
		|ГДЕ
		|	ит_Продавцы.ЕРПМастерКлюч <> """"");

	Запрос.Текст			= СхемаЗапроса.ПолучитьТекстЗапроса();
	РезультатЗапроса		= Запрос.Выполнить();
	ТаблицаМастерКлючей		= РезультатЗапроса.Выгрузить();
	ХранилищеМастерКлючей	= Новый ХранилищеЗначения(ТаблицаМастерКлючей);
	WSПрокси				= ИТ_СпециальныйМодульСервер.СоздатьWSПроксиПоКлючу("mysteryshopper_ocenkaprodavcov");
	Сутки = 86400;
	НачалоПериода = Объект.НачалоПериода - 60*Сутки;
	СериализованныеДанные	= WSПрокси.dannietabelya(НачалоПериода, Объект.КонецПериода, ХранилищеМастерКлючей).Получить();
	ТаблицаПродавцов		= ИТ_СпециальныйМодульСервер.Десериализовать(СериализованныеДанные);
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ТаблицаПродавцов.Дата, ДЕНЬ) КАК Период_День,
	               |	ТаблицаПродавцов.ПродавецЕРПМастерКлюч КАК ФизЛицо_ЕРПМастерКлюч,
	               |	ТаблицаПродавцов.ТорговаяТочкаЕРПМастерКлюч КАК Магазин_ЕРПМастерКлюч,
	               |	ТаблицаПродавцов.Часов КАК Часов
	               |ПОМЕСТИТЬ ТаблицаПродавцов
	               |ИЗ
	               |	&ТаблицаПродавцов КАК ТаблицаПродавцов
	               |ГДЕ
	               |	ТаблицаПродавцов.ПродавецЕРПМастерКлюч <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПродавцов.ФизЛицо_ЕРПМастерКлюч КАК ФизЛицо_ЕРПМастерКлюч,
	               |	ТаблицаПродавцов.Магазин_ЕРПМастерКлюч КАК Магазин_ЕРПМастерКлюч,
	               |	СУММА(ТаблицаПродавцов.Часов) КАК Часов
	               |ПОМЕСТИТЬ ТаблицаПродавцовСОтработаннымиЧасами
	               |ИЗ
	               |	ТаблицаПродавцов КАК ТаблицаПродавцов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаПродавцов.ФизЛицо_ЕРПМастерКлюч,
	               |	ТаблицаПродавцов.Магазин_ЕРПМастерКлюч
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПродавцов.Период_День КАК Период_День,
	               |	ТаблицаПродавцов.Магазин_ЕРПМастерКлюч КАК Магазин_ЕРПМастерКлюч,
	               |	ФизическиеЛица.Ссылка КАК Продавец,
	               |	ЕСТЬNULL(ит_Продавцы.Должность, """") КАК Должность
	               |ПОМЕСТИТЬ ДанныеПродавцовИМагазинов
	               |ИЗ
	               |	ТаблицаПродавцов КАК ТаблицаПродавцов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК ФизическиеЛица
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ит_Продавцы КАК ит_Продавцы
	               |			ПО ФизическиеЛица.Ссылка = ит_Продавцы.ФизическоеЛицо
	               |		ПО ТаблицаПродавцов.ФизЛицо_ЕРПМастерКлюч = ФизическиеЛица.ЕРПМастерКлюч
	               |ГДЕ
	               |	ФизическиеЛица.ЕРПМастерКлюч <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПересчетТоваров.Ссылка КАК ДокументИнвентаризация,
	               |	ПересчетТоваров.ПодразделениеКомпании КАК Магазин,
	               |	ПересчетТоваров.Дата КАК Дата,
	               |	МАКСИМУМ(ЕСТЬNULL(ПредыдущийПересчетТоваров.Дата, ДОБАВИТЬКДАТЕ(&НачалоПериода, НЕДЕЛЯ, -4))) КАК ДатаПредыдущейИнвентаризации,
	               |	ВложенныйЗапрос.Сумма КАК РезультатИнвентаризации,
	               |	ПересчетТоваров.СкладКомпании.Наименование КАК СкладКомпанииНаименование,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.Сумма < &Порог
	               |			ТОГДА ВложенныйЗапрос.Сумма + ВложенныйЗапрос.СписаниеЕстественнаяУбыль + ВложенныйЗапрос.СписаниеПредпродажнаяПодготовка
	               |		ИНАЧЕ ВложенныйЗапрос.Сумма
	               |	КОНЕЦ КАК РезультатИнвентаризацииКВозмещению
	               |ПОМЕСТИТЬ ТаблицаИнвентаризаций
	               |ИЗ
	               |	Документ.Инвентаризация КАК ПересчетТоваров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Инвентаризация КАК ПредыдущийПересчетТоваров
	               |		ПО ПересчетТоваров.ПодразделениеКомпании = ПредыдущийПересчетТоваров.ПодразделениеКомпании
	               |			И (ПредыдущийПересчетТоваров.ХозОперация = &ХозОперация)
	               |			И (ПредыдущийПересчетТоваров.Дата < ПересчетТоваров.Дата)
	               |			И (ПредыдущийПересчетТоваров.Дата >= ДОБАВИТЬКДАТЕ(&НачалоПериода, НЕДЕЛЯ, -4))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СУММА(ПересчетТоваровТовары.СуммаРозничная) КАК Сумма,
	               |			ПересчетТоваровТовары.Ссылка КАК Ссылка,
	               |			СУММА(ПересчетТоваровТовары.итСписаниеЕстественнаяУбыль) КАК СписаниеЕстественнаяУбыль,
	               |			СУММА(ПересчетТоваровТовары.итСписаниеПредпродажнаяПодготовка) КАК СписаниеПредпродажнаяПодготовка,
	               |			СУММА(ПересчетТоваровТовары.итСписаниеПоСрокуГодности) КАК СписаниеПоСрокуГодности
	               |		ИЗ
	               |			Документ.Инвентаризация.Товары КАК ПересчетТоваровТовары
	               |		ГДЕ
	               |			ПересчетТоваровТовары.Ссылка.ХозОперация = &ХозОперация
	               |			И ПересчетТоваровТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |			И ПересчетТоваровТовары.Ссылка.ПодразделениеКомпании.ЕРПМастерКлюч В(&МассивКлючейМагазинов)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ПересчетТоваровТовары.Ссылка) КАК ВложенныйЗапрос
	               |		ПО ПересчетТоваров.Ссылка = ВложенныйЗапрос.Ссылка
	               |ГДЕ
	               |	ПересчетТоваров.ХозОперация = &ХозОперация
				   |	И ПересчетТоваров.ПометкаУдаления = Ложь
	               |	И ПересчетТоваров.ПодразделениеКомпании.ЕРПМастерКлюч В(&МассивКлючейМагазинов)
	               |	И ПересчетТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПересчетТоваров.Ссылка,
	               |	ПересчетТоваров.ПодразделениеКомпании,
	               |	ПересчетТоваров.Дата,
	               |	ВложенныйЗапрос.Сумма,
	               |	ПересчетТоваров.СкладКомпании.Наименование,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.Сумма < &Порог
	               |			ТОГДА ВложенныйЗапрос.Сумма + ВложенныйЗапрос.СписаниеЕстественнаяУбыль + ВложенныйЗапрос.СписаниеПредпродажнаяПодготовка
	               |		ИНАЧЕ ВложенныйЗапрос.Сумма
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТаблицаИнвентаризаций.Магазин КАК Магазин,
	               |	ДанныеПродавцовИМагазинов.Продавец КАК Продавец,
	               |	ДанныеПродавцовИМагазинов.Должность КАК Должность,
	               |	ТаблицаИнвентаризаций.Магазин.Организация КАК ЮрЛицо,
	               |	ТаблицаИнвентаризаций.ДокументИнвентаризация КАК ДокументИнвентаризация,
	               |	ТаблицаИнвентаризаций.РезультатИнвентаризации КАК СуммаИнвентаризации,
	               |	МАКСИМУМ(ЕСТЬNULL(МагазиныКонтактнаяИнформация.Представление, """")) КАК Магазин_АдресВариантРозницы,
	               |	ЕСТЬNULL(ТаблицаПродавцовСОтработаннымиЧасами.Часов, 0) КАК ОтработаноЧасов,
	               |	ЗНАЧЕНИЕ(Перечисление.ИТ_ТипыУдержанийПоРезультатамИнвентаризаций.ИзЗарплаты) КАК ТипУдержания,
	               |	ЗНАЧЕНИЕ(Перечисление.ИТ_ВидыОперацийПакетаДокументовРезультатовИнвентаризации.ФормированиеПакетаДокументов) КАК ВидОперации,
	               |	ТаблицаИнвентаризаций.СкладКомпанииНаименование КАК Магазин_Адрес,
	               |	ЕСТЬNULL(ТаблицаИнвентаризаций.РезультатИнвентаризацииКВозмещению,0) КАК РезультатИнвентаризацииКВозмещению
	               |ИЗ
	               |	ТаблицаИнвентаризаций КАК ТаблицаИнвентаризаций
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПродавцовИМагазинов КАК ДанныеПродавцовИМагазинов
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПродавцовСОтработаннымиЧасами КАК ТаблицаПродавцовСОтработаннымиЧасами
	               |			ПО ДанныеПродавцовИМагазинов.Магазин_ЕРПМастерКлюч = ТаблицаПродавцовСОтработаннымиЧасами.Магазин_ЕРПМастерКлюч
	               |				И ДанныеПродавцовИМагазинов.Продавец.ЕРПМастерКлюч = ТаблицаПродавцовСОтработаннымиЧасами.ФизЛицо_ЕРПМастерКлюч
	               |		ПО (ДанныеПродавцовИМагазинов.Период_День > ТаблицаИнвентаризаций.ДатаПредыдущейИнвентаризации)
	               |			И (ДанныеПродавцовИМагазинов.Период_День <= ТаблицаИнвентаризаций.Дата)
	               |			И ТаблицаИнвентаризаций.Магазин.ЕРПМастерКлюч = ДанныеПродавцовИМагазинов.Магазин_ЕРПМастерКлюч
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании.КонтактнаяИнформация КАК МагазиныКонтактнаяИнформация
	               |		ПО ТаблицаИнвентаризаций.Магазин = МагазиныКонтактнаяИнформация.Ссылка
	               |			И (МагазиныКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	               |			И (МагазиныКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресПодразделенияКомпании))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеПродавцовИМагазинов.Должность,
	               |	ТаблицаИнвентаризаций.Магазин,
	               |	ДанныеПродавцовИМагазинов.Продавец,
	               |	ТаблицаИнвентаризаций.ДокументИнвентаризация,
	               |	ТаблицаИнвентаризаций.Магазин.Организация,
	               |	ТаблицаИнвентаризаций.РезультатИнвентаризации,
	               |	ЕСТЬNULL(ТаблицаПродавцовСОтработаннымиЧасами.Часов, 0),
	               |	ТаблицаИнвентаризаций.СкладКомпанииНаименование,
	               |	ТаблицаИнвентаризаций.РезультатИнвентаризацииКВозмещению
	               |ИТОГИ
	               |	МАКСИМУМ(Магазин),
	               |	МАКСИМУМ(ЮрЛицо),
	               |	МАКСИМУМ(СуммаИнвентаризации),
	               |	СУММА(ОтработаноЧасов),
	               |	МАКСИМУМ(ТипУдержания),
	               |	МАКСИМУМ(ВидОперации),
	               |	МАКСИМУМ(РезультатИнвентаризацииКВозмещению)
	               |ПО
	               |	ДокументИнвентаризация";

		
	Запрос.УстановитьПараметр("МассивКлючейМагазинов",	МассивКлючейМагазинов);
	Запрос.УстановитьПараметр("ТаблицаПродавцов",		ТаблицаПродавцов);
	Запрос.УстановитьПараметр("ХозОперация",			Справочники.ХозОперации.ИнвентаризацияТоваровПредварительныйИтог);
	
	Запрос.УстановитьПараметр("НачалоПериода",			Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",			КонецДня(Объект.КонецПериода));
	Запрос.УстановитьПараметр("Порог",					Константы.ИТ_ИгнорируемаяНедостача.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Подготовка таблицы значений для распределения сумм к удержанию и определения числится ли сотрудник в организации.
	ОписаниеТипаСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(15);
	
	ДанныеПродавцов	= Объект.Инвентаризации.Выгрузить();
	ДанныеПродавцов.Колонки.Добавить("Организация_ЕРПМастерКлюч",	ОписаниеТипаСтрока);
	ДанныеПродавцов.Колонки.Добавить("Продавец_ЕРПМастерКлюч",		ОписаниеТипаСтрока);
	
	ДанныеПродавцов.Очистить();
	
	//Нужно рассчитать сумму к удержанию с продавца пропорционально отработанному времени.
	ВыборкаДокументИнвентаризации = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументИнвентаризации.Следующий() Цикл
		
		СуммаЗадолженностиВсего	= ВыборкаДокументИнвентаризации.РезультатИнвентаризацииКВозмещению;
		ОтработаноЧасовВсего	= ВыборкаДокументИнвентаризации.ОтработаноЧасов;
		
		ДатаПредИнвентаризации  = Документы.Инвентаризация.ПолучитьДатуПредыдущейИнвентаризацииПредварительныйИтог(ВыборкаДокументИнвентаризации.ДокументИнвентаризация);
		Если ДатаПредИнвентаризации = НЕОПРЕДЕЛЕНО Тогда
			Сообщить("Для инвентаризации " + Строка(ВыборкаДокументИнвентаризации.ДокументИнвентаризация) + " не обнаружено предыдущей инвентаризации");
			Продолжить;
		КонецЕсли;
		
		ПродавцыТочки 		  = ТаблицаПродавцов.НайтиСтроки(Новый Структура("ТорговаяТочкаЕРПМастерКлюч",ВыборкаДокументИнвентаризации.Магазин.ЕРПМастерКлюч));
		ТаблицаПродавцовТочки = Новый ТаблицаЗначений;
		ТаблицаПродавцовТочки.Колонки.Добавить("ЕРПМастерКлюч", ОбщегоНазначения.ОписаниеТипаСтрока(15));
		Для Каждого стр Из ПродавцыТочки Цикл
			НовСтр = ТаблицаПродавцовТочки.Добавить();
			НовСтр.ЕРПМастерКлюч = стр.ПродавецЕРПМастерКлюч;
		КонецЦикла;
		ТаблицаПродавцовТочки.Свернуть("ЕРПМастерКлюч");
		
		ХранилищеМастерКлючей		= Новый ХранилищеЗначения(ТаблицаПродавцовТочки);
		WSПрокси					= ИТ_СпециальныйМодульСервер.СоздатьWSПроксиПоКлючу("mysteryshopper_ocenkaprodavcov");
		СериализованныеДанные		= WSПрокси.dannietabelya(ДатаПредИнвентаризации, ВыборкаДокументИнвентаризации.ДокументИнвентаризация.Дата, ХранилищеМастерКлючей).Получить();
		ТаблицаПродавцовОтработано	= ИТ_СпециальныйМодульСервер.Десериализовать(СериализованныеДанные);
		//ОтработаноЧасовВсего        = ТаблицаПродавцовОтработано.Итог("Часов");
		ОтработаноЧасовВсего = 0;
		Для Каждого стр Из ТаблицаПродавцовОтработано Цикл
			Если стр.ТорговаяТочкаЕРПМастерКлюч = ВыборкаДокументИнвентаризации.Магазин.ЕРПМастерКлюч Тогда
				ОтработаноЧасовВсего = ОтработаноЧасовВсего + стр.Часов;
			КонецЕсли;
		КонецЦикла;
		
		Если ОтработаноЧасовВсего = 0 Тогда
			Сообщить("В данных табеля по ТТ " + Строка(ВыборкаДокументИнвентаризации.Магазин) + " обнаружено нулевое кол-во часов работы продавцов! Сумма инвентаризации не распределена!");
			Продолжить;
		КонецЕсли;
		
		Выборка = ВыборкаДокументИнвентаризации.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ЧасыТекущегоПродавца = Выборка.ОтработаноЧасов;
			ЧасыТекущегоПродавца = 0;
			СтрокиПродавца       = ТаблицаПродавцовОтработано.НайтиСтроки(Новый Структура("ПродавецЕРПМастерКлюч",Выборка.Продавец.ЕРПМастерКлюч));
			Если СтрокиПродавца.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого стрОтр Из СтрокиПродавца Цикл
				ЧасыТекущегоПродавца = ЧасыТекущегоПродавца + стрОтр.Часов;		
			КонецЦикла;
			
			НоваяСтрокаИнвентаризаций = ДанныеПродавцов.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрокаИнвентаризаций, ВыборкаДокументИнвентаризации);
					
			Если ОтработаноЧасовВсего = 0 Тогда
				СуммаЗадолженностиПродавца = 0;
			Иначе	
				СуммаЗадолженностиПродавца = Окр((СуммаЗадолженностиВсего * ЧасыТекущегоПродавца) / ОтработаноЧасовВсего, 2);
			КонецЕсли;
			
			НоваяСтрокаИнвентаризаций.СуммаКУдержанию	= СуммаЗадолженностиПродавца;
			НоваяСтрокаИнвентаризаций.Продавец 			= Выборка.Продавец;
			НоваяСтрокаИнвентаризаций.Должность			= Выборка.Должность;
			НоваяСтрокаИнвентаризаций.Магазин_Адрес		= Выборка.Магазин_Адрес;
			НоваяСтрокаИнвентаризаций.ОтработаноЧасов   = ЧасыТекущегоПродавца;
			
			НоваяСтрокаИнвентаризаций.Организация_ЕРПМастерКлюч = НоваяСтрокаИнвентаризаций.ЮрЛицо.ЕРПМастерКлюч;
			НоваяСтрокаИнвентаризаций.Продавец_ЕРПМастерКлюч	= НоваяСтрокаИнвентаризаций.Продавец.ЕРПМастерКлюч;
			
			//Надо уменьшить базы распределения, чтобы полностью вся сумма распределилась на продавцов без потерь.
			СуммаЗадолженностиВсего = СуммаЗадолженностиВсего - СуммаЗадолженностиПродавца;
			ОтработаноЧасовВсего	= ОтработаноЧасовВсего - ЧасыТекущегоПродавца;
			
		КонецЦикла;
	КонецЦикла;
	
	//Вызов универсального НТТР-сервиса в РМТО для определения числится ли сотрудник в данной организации.
	ДанныеПродавцов = ИТ_СпециальныйМодульСервер.ОпределениеЧислитсяЛиСотрудникВОрганизации(ДанныеПродавцов);
	
	Объект.Инвентаризации.Загрузить(ДанныеПродавцов);
	
	Для Каждого СтрокаДокумента Из Объект.Инвентаризации Цикл
		Если Не ЗначениеЗаполнено(СтрокаДокумента.ИдентификаторСтроки) Тогда
			СтрокаДокумента.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПерераспределениеСуммКУдержанию(Объект) Экспорт
	
	Если Объект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Объект) <> Тип("ДанныеФормыСтруктура")
		И ТипЗнч(Объект) <> Тип("ДокументОбъект.ИТ_ПакетДокументовРезультатовИнвентаризации") Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеТипаСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(15);
	
	ТекущаяТабличнаяЧасть = Объект.Инвентаризации.Выгрузить();
	ТекущаяТабличнаяЧасть.Колонки.Добавить("Магазин_ЕРПМастерключ",		ОписаниеТипаСтрока);
	ТекущаяТабличнаяЧасть.Колонки.Добавить("Продавец_ЕРПМастерКлюч",	ОписаниеТипаСтрока);
	
	МассивМагазинов = Новый Массив();
	
	Для Каждого СтрокаТабЧасти Из ТекущаяТабличнаяЧасть Цикл
		ИТ_СпециальныйМодульСервер.ДобавитьУникальноеЗначениеВМассив(МассивМагазинов, СтрокаТабЧасти.Магазин);		
		
		СтрокаТабЧасти.Магазин_ЕРПМастерКлюч		= СокрЛП(СтрокаТабЧасти.Магазин.ЕРПМастерКлюч);
		СтрокаТабЧасти.Продавец_ЕРПМастерКлюч   	= СокрЛП(СтрокаТабЧасти.Продавец.ЕРПМастерКлюч);
		
		Если СтрокаТабЧасти.СуммаИнвентаризации = 0 Тогда
			СтрокаТабЧасти.СуммаИнвентаризации = ИТ_СпециальныйМодульСервер.ПолучитьРезультатИнвентаризации(СтрокаТабЧасти.ДокументИнвентаризация);	
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыПостроения	= ИТ_СпециальныйМодульСервер.ПолучитьПараметрыПостроения(,
		НачалоДня(Объект.НачалоПериода), 
		КонецДня(Объект.КонецПериода),,,,,
		МассивМагазинов,,, 
		Истина, 
		Объект.ЛинейныйМенеджер,,,,, 
		Истина,, "ЕРПМастерКлюч");
		
	ДанныеМагазинов			= ИТ_СпециальныйМодульСервер.ПолучитьДанныеПоМагазинам(ПараметрыПостроения);
	МассивКлючейМагазинов	= ДанныеМагазинов.ВыгрузитьКолонку("Магазин_ЕРПМастерКлюч");
	
	Запрос			= Новый Запрос();
	СхемаЗапроса	= Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ит_Продавцы.ФизическоеЛицо.ЕРПМастерКлюч КАК ЕРПМастерКлюч
		|ИЗ
		|	Справочник.ит_Продавцы КАК ит_Продавцы
		|ГДЕ
		|	ит_Продавцы.ЕРПМастерКлюч <> """"");

	Запрос.Текст			= СхемаЗапроса.ПолучитьТекстЗапроса();
	РезультатЗапроса		= Запрос.Выполнить();
	ТаблицаМастерКлючей		= РезультатЗапроса.Выгрузить();
	ХранилищеМастерКлючей	= Новый ХранилищеЗначения(ТаблицаМастерКлючей);
	WSПрокси				= ИТ_СпециальныйМодульСервер.СоздатьWSПроксиПоКлючу("mysteryshopper_ocenkaprodavcov");
	СериализованныеДанные	= WSПрокси.dannietabelya(Объект.НачалоПериода, Объект.КонецПериода, ХранилищеМастерКлючей).Получить();
	ТаблицаПродавцов		= ИТ_СпециальныйМодульСервер.Десериализовать(СериализованныеДанные);

	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТекущаяТабличнаяЧасть.Магазин КАК Магазин,
	               |	ТекущаяТабличнаяЧасть.Магазин_ЕРПМастерКлюч КАК Магазин_ЕРПМастерключ,
	               |	ТекущаяТабличнаяЧасть.ЮрЛицо КАК ЮрЛицо,
	               |	ТекущаяТабличнаяЧасть.ДокументИнвентаризация КАК ДокументИнвентаризация,
	               |	ТекущаяТабличнаяЧасть.Продавец КАК Продавец,
	               |	ТекущаяТабличнаяЧасть.Продавец_ЕРПМастерКлюч КАК Продавец_ЕРПМастерКлюч,
	               |	ТекущаяТабличнаяЧасть.Должность КАК Должность,
	               |	ТекущаяТабличнаяЧасть.Магазин_Адрес КАК Магазин_Адрес,
	               |	ТекущаяТабличнаяЧасть.ТипУдержания КАК ТипУдержания,
	               |	ТекущаяТабличнаяЧасть.СуммаКУдержанию КАК СуммаКУдержанию,
	               |	ТекущаяТабличнаяЧасть.СуммаИнвентаризации КАК СуммаИнвентаризации,
	               |	ТекущаяТабличнаяЧасть.ВидОперации КАК ВидОперации,
	               |	ТекущаяТабличнаяЧасть.СуммаКорректировки КАК СуммаКорректировки,
	               |	ТекущаяТабличнаяЧасть.РезультатИнвентаризацииКВозмещению КАК РезультатИнвентаризацииКВозмещению,
	               |	ТекущаяТабличнаяЧасть.СуммаКУдержаниюДоКорректировки КАК СуммаКУдержаниюДоКорректировки
	               |ПОМЕСТИТЬ ТекущиеДанныеТабличнойЧасти
	               |ИЗ
	               |	&ТекущаяТабличнаяЧасть КАК ТекущаяТабличнаяЧасть
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НАЧАЛОПЕРИОДА(ТаблицаПродавцов.Дата, ДЕНЬ) КАК Период_День,
	               |	ТаблицаПродавцов.ПродавецЕРПМастерКлюч КАК ФизЛицо_ЕРПМастерКлюч,
	               |	ТаблицаПродавцов.ТорговаяТочкаЕРПМастерКлюч КАК Магазин_ЕРПМастерКлюч,
	               |	ТаблицаПродавцов.Часов КАК Часов
	               |ПОМЕСТИТЬ ТаблицаПродавцов
	               |ИЗ
	               |	&ТаблицаПродавцов КАК ТаблицаПродавцов
	               |ГДЕ
	               |	ТаблицаПродавцов.ПродавецЕРПМастерКлюч <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПродавцов.ФизЛицо_ЕРПМастерКлюч КАК ФизЛицо_ЕРПМастерКлюч,
	               |	ТаблицаПродавцов.Магазин_ЕРПМастерКлюч КАК Магазин_ЕРПМастерКлюч,
	               |	СУММА(ТаблицаПродавцов.Часов) КАК Часов
	               |ПОМЕСТИТЬ ТаблицаПродавцовСОтработаннымиЧасами
	               |ИЗ
	               |	ТаблицаПродавцов КАК ТаблицаПродавцов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаПродавцов.ФизЛицо_ЕРПМастерКлюч,
	               |	ТаблицаПродавцов.Магазин_ЕРПМастерКлюч
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТекущиеДанныеТабличнойЧасти.Магазин КАК Магазин,
	               |	ТекущиеДанныеТабличнойЧасти.ЮрЛицо КАК ЮрЛицо,
	               |	ТекущиеДанныеТабличнойЧасти.ДокументИнвентаризация КАК ДокументИнвентаризация,
	               |	ТекущиеДанныеТабличнойЧасти.Продавец КАК Продавец,
	               |	ТекущиеДанныеТабличнойЧасти.Должность КАК Должность,
	               |	ТекущиеДанныеТабличнойЧасти.Магазин_Адрес КАК Магазин_Адрес,
	               |	ТекущиеДанныеТабличнойЧасти.ТипУдержания КАК ТипУдержания,
	               |	ТекущиеДанныеТабличнойЧасти.СуммаКУдержанию КАК СуммаКУдержанию,
	               |	ТекущиеДанныеТабличнойЧасти.СуммаИнвентаризации КАК СуммаИнвентаризации,
	               |	ТекущиеДанныеТабличнойЧасти.ВидОперации КАК ВидОперации,
	               |	ТекущиеДанныеТабличнойЧасти.СуммаКорректировки КАК СуммаКорректировки,
	               |	ТекущиеДанныеТабличнойЧасти.СуммаКУдержаниюДоКорректировки КАК СуммаКУдержаниюДоКорректировки,
	               |	ЕСТЬNULL(ТаблицаПродавцовСОтработаннымиЧасами.Часов, 0) КАК ОтработаноЧасов,
	               |	ТекущиеДанныеТабличнойЧасти.РезультатИнвентаризацииКВозмещению КАК РезультатИнвентаризацииКВозмещению
	               |ИЗ
	               |	ТекущиеДанныеТабличнойЧасти КАК ТекущиеДанныеТабличнойЧасти
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПродавцовСОтработаннымиЧасами КАК ТаблицаПродавцовСОтработаннымиЧасами
	               |		ПО ТекущиеДанныеТабличнойЧасти.Магазин_ЕРПМастерключ = ТаблицаПродавцовСОтработаннымиЧасами.Магазин_ЕРПМастерКлюч
	               |			И ТекущиеДанныеТабличнойЧасти.Продавец_ЕРПМастерКлюч = ТаблицаПродавцовСОтработаннымиЧасами.ФизЛицо_ЕРПМастерКлюч
	               |ИТОГИ
	               |	МАКСИМУМ(Магазин),
	               |	МАКСИМУМ(ЮрЛицо),
	               |	МАКСИМУМ(ТипУдержания),
	               |	МАКСИМУМ(СуммаИнвентаризации),
	               |	МАКСИМУМ(ВидОперации),
	               |	СУММА(ОтработаноЧасов),
				   |	МАКСИМУМ(РезультатИнвентаризацииКВозмещению)
	               |ПО
	               |	ДокументИнвентаризация";

		
	Запрос.УстановитьПараметр("ТекущаяТабличнаяЧасть",	ТекущаяТабличнаяЧасть);
	Запрос.УстановитьПараметр("ТаблицаПродавцов",		ТаблицаПродавцов);
	РезультатЗапроса = Запрос.Выполнить();

	//Нужно рассчитать сумму к удержанию с продавца пропорционально отработанному времени.
	ДанныеПродавцов	= Объект.Инвентаризации.Выгрузить();
	ДанныеПродавцов.Очистить();
	
	ДанныеПродавцов.Колонки.Добавить("Продавец_ЕРПМастерКлюч",		ОписаниеТипаСтрока);
	ДанныеПродавцов.Колонки.Добавить("Организация_ЕРПМастерКлюч",	ОписаниеТипаСтрока);
	
	ВыборкаДокументИнвентаризации = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументИнвентаризации.Следующий() Цикл
		
		СуммаЗадолженностиВсего	= ВыборкаДокументИнвентаризации.РезультатИнвентаризацииКВозмещению;
		ОтработаноЧасовВсего	= ВыборкаДокументИнвентаризации.ОтработаноЧасов;
		
		ДатаПредИнвентаризации  = Документы.Инвентаризация.ПолучитьДатуПредыдущейИнвентаризации(ВыборкаДокументИнвентаризации.ДокументИнвентаризация);
		Если ДатаПредИнвентаризации = НЕОПРЕДЕЛЕНО Тогда
			Сообщить("Для инвентаризации " + Строка(ВыборкаДокументИнвентаризации.ДокументИнвентаризация) + " не обнаружено предыдущей инвентаризации");
			Продолжить;
		КонецЕсли;
		
		ПродавцыТочки 		  = ТаблицаПродавцов.НайтиСтроки(Новый Структура("ТорговаяТочкаЕРПМастерКлюч",ВыборкаДокументИнвентаризации.Магазин.ЕРПМастерКлюч));
		ТаблицаПродавцовТочки = Новый ТаблицаЗначений;
		ТаблицаПродавцовТочки.Колонки.Добавить("ЕРПМастерКлюч", ОбщегоНазначения.ОписаниеТипаСтрока(15));
		Для Каждого стр Из ПродавцыТочки Цикл
			НовСтр = ТаблицаПродавцовТочки.Добавить();
			НовСтр.ЕРПМастерКлюч = стр.ПродавецЕРПМастерКлюч;
		КонецЦикла;
		ТаблицаПродавцовТочки.Свернуть("ЕРПМастерКлюч");
		
		ХранилищеМастерКлючей		= Новый ХранилищеЗначения(ТаблицаПродавцовТочки);
		WSПрокси					= ИТ_СпециальныйМодульСервер.СоздатьWSПроксиПоКлючу("mysteryshopper_ocenkaprodavcov");
		СериализованныеДанные		= WSПрокси.dannietabelya(ДатаПредИнвентаризации, ВыборкаДокументИнвентаризации.ДокументИнвентаризация.Дата, ХранилищеМастерКлючей).Получить();
		ТаблицаПродавцовОтработано	= ИТ_СпециальныйМодульСервер.Десериализовать(СериализованныеДанные);
		//ОтработаноЧасовВсего        = ТаблицаПродавцовОтработано.Итог("Часов");
		ОтработаноЧасовВсего = 0;
		Для Каждого стр Из ТаблицаПродавцовОтработано Цикл
			Если стр.ТорговаяТочкаЕРПМастерКлюч = ВыборкаДокументИнвентаризации.Магазин.ЕРПМастерКлюч Тогда
				ОтработаноЧасовВсего = ОтработаноЧасовВсего + стр.Часов;
			КонецЕсли;
		КонецЦикла;
				
		Если ОтработаноЧасовВсего = 0 Тогда
			Сообщить("В данных табеля по ТТ " + Строка(ВыборкаДокументИнвентаризации.Магазин) + " обнаружено нулевое кол-во часов работы продавцов! Сумма инвентаризации не распределена!");
			Продолжить;
		КонецЕсли;
		
		Выборка = ВыборкаДокументИнвентаризации.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ЧасыТекущегоПродавца = Выборка.ОтработаноЧасов;
			ЧасыТекущегоПродавца = 0;
			СтрокиПродавца       = ТаблицаПродавцовОтработано.НайтиСтроки(Новый Структура("ПродавецЕРПМастерКлюч",Выборка.Продавец.ЕРПМастерКлюч));
			Если СтрокиПродавца.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого стрОтр Из СтрокиПродавца Цикл
				ЧасыТекущегоПродавца = ЧасыТекущегоПродавца + стрОтр.Часов;		
			КонецЦикла;
			
			НоваяСтрокаИнвентаризаций = ДанныеПродавцов.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрокаИнвентаризаций, Выборка);
					
			Если ОтработаноЧасовВсего = 0 Тогда
				СуммаЗадолженностиПродавца = 0;
			Иначе	
				СуммаЗадолженностиПродавца = Окр((СуммаЗадолженностиВсего * ЧасыТекущегоПродавца) / ОтработаноЧасовВсего, 2);
			КонецЕсли;
			
			НоваяСтрокаИнвентаризаций.СуммаКУдержанию	= СуммаЗадолженностиПродавца;
			НоваяСтрокаИнвентаризаций.Продавец 			= Выборка.Продавец;
			НоваяСтрокаИнвентаризаций.Должность			= Выборка.Должность;
			НоваяСтрокаИнвентаризаций.Магазин_Адрес		= Выборка.Магазин_Адрес;
			НоваяСтрокаИнвентаризаций.ОтработаноЧасов   = ЧасыТекущегоПродавца;
			
			//Надо уменьшить базы распределения, чтобы полностью вся сумма распределилась на продавцов без потерь.
			СуммаЗадолженностиВсего = СуммаЗадолженностиВсего - СуммаЗадолженностиПродавца;
			ОтработаноЧасовВсего	= ОтработаноЧасовВсего - ЧасыТекущегоПродавца;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрокаДокумента Из ДанныеПродавцов Цикл
		Если Не ЗначениеЗаполнено(СтрокаДокумента.ИдентификаторСтроки) Тогда
			СтрокаДокумента.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		КонецЕсли;
		
		СтрокаДокумента.Продавец_ЕРПМастерКлюч  	= СокрЛП(СтрокаДокумента.Продавец.ЕРПМастерКлюч);
		СтрокаДокумента.Организация_ЕРПМастерКлюч	= СокрЛП(СтрокаДокумента.ЮрЛицо.ЕРПМастерКлюч);
		
		Если ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") Тогда
			СтрокаДокумента.РезультатИнвентаризации = СтрокаДокумента.СуммаИнвентаризации;
		КонецЕсли;
		
		//Если сумма корректировки уже заполнена ранее, то не рассчитываем её ещё раз.
		Если СтрокаДокумента.СуммаКорректировки <> 0 Тогда
			Продолжить;	
		КонецЕсли;

		Если СтрокаДокумента.ВидОперации = Перечисления.ИТ_ВидыОперацийПакетаДокументовРезультатовИнвентаризации.Корректировка Тогда
			
			СуммаБыло 	= СтрокаДокумента.СуммаКУдержаниюДоКорректировки;
			СуммаСтало  = СтрокаДокумента.СуммаКУдержанию;
			
			Если СуммаБыло < 0 И СуммаСтало < 0 Тогда
				Если СуммаБыло < СуммаСтало Тогда
					СтрокаДокумента.СуммаКорректировки = СуммаБыло - СуммаСтало;
				Иначе
				    СтрокаДокумента.СуммаКорректировки = СуммаСтало - СуммаБыло;
				КонецЕсли;
			ИначеЕсли СуммаБыло > 0 И СуммаСтало < 0 Тогда
				СтрокаДокумента.СуммаКорректировки = СуммаСтало;	
			ИначеЕсли СуммаБыло < 0 И СуммаСтало > 0 Тогда
				СтрокаДокумента.СуммаКорректировки = -СуммаБыло;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеПродавцов = ИТ_СпециальныйМодульСервер.ОпределениеЧислитсяЛиСотрудникВОрганизации(ДанныеПродавцов);
	
	Если ДанныеПродавцов.Количество() > 0 Тогда
		Объект.Инвентаризации.Загрузить(ДанныеПродавцов);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФункцииПечати

Функция Печать_ПриказОбИнвентаризации(ДанныеПечати, ОбъектыПечати, ПараметрыПечати, ТабличныйДокумент = Неопределено)
	
	МассивОбъектов = Новый Массив;

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ПриказОбИнвентаризации";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;	
	
	Для Каждого ДанныеДокумента Из ДанныеПечати.Документы Цикл
		ВыборкаДокументы = ДанныеПечати.Данные;
		ВыборкаДокументы.Сбросить();
		МассивОбъектов.Очистить();
		Пока ВыборкаДокументы.Следующий() Цикл
			
			МассивОбъектов = Новый Массив;

			НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
			
			МассивОбъектов.Добавить(ВыборкаДокументы.ДокументИнвентаризация);			
			Обработки.ПечатьИНВ.итПечатьПриказОбИнвентаризацииВТабличныйДокумент(ТабличныйДокумент, МассивОбъектов, ОбъектыПечати, ДанныеПечати.Пакет);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДокумента.Документ);
		КонецЦикла;	
	КонецЦикла;
		
	Возврат ТабличныйДокумент;
	
КонецФункции	

Функция Печать_ПриказОбИнвентаризацииСтарый(ДанныеПечати, ОбъектыПечати, ПараметрыПечати, ТабличныйДокумент = Неопределено)
	
	// Подготовка документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ПриказОбИнвентаризации";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	
	// Подготовка областей
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИТ_ПакетДокументовРезультатовИнвентаризации.ПриказОбИнвентаризации");
	Область_ПустаяСтрока		= Макет.ПолучитьОбласть("ПустаяСтрока");
	Область_Шапка_ФММР			= Макет.ПолучитьОбласть("Шапка_ФММР");
	Область_Шапка_ИП			= Макет.ПолучитьОбласть("Шапка_ИП");
	Область_Тело_1_ИП			= Макет.ПолучитьОбласть("Тело_1_ИП");
	Область_Тело_1_ФММР			= Макет.ПолучитьОбласть("Тело_1_ФММР");
	Область_Тело_2				= Макет.ПолучитьОбласть("Тело_2");
	Область_Подвал_ИП			= Макет.ПолучитьОбласть("Подвал_ИП");
	Область_Подвал_ФММР			= Макет.ПолучитьОбласть("Подвал_ФММР");
	Область_СтрокаПродавец		= Макет.ПолучитьОбласть("СтрокаПродавец");
	
	// Вывод данных в табличный документ
	Для Каждого ДанныеДокумента Из ДанныеПечати.Документы Цикл
		ВыборкаДокументы = ДанныеПечати.Данные;
		ВыборкаДокументы.Сбросить();
		
		Пока ВыборкаДокументы.Следующий() Цикл
			НомерСтрокиНачало	= ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Если ВыборкаДокументы.ЭтоФММР Тогда  
				Область_Шапка	= Область_Шапка_ФММР;
				Область_Тело_1	= Область_Тело_1_ФММР;
				Область_Подвал	= Область_Подвал_ФММР;
			Иначе
				Область_Шапка	= Область_Шапка_ИП;
				Область_Тело_1	= Область_Тело_1_ИП;
				Область_Подвал	= Область_Подвал_ИП;
			КонецЕсли;
			
			Область_Тело_2.Параметры.Заполнить(ДанныеДокумента);
			
			// Вывод данных
			ТабличныйДокумент.Вывести(Область_ПустаяСтрока);
			ТабличныйДокумент.Вывести(Область_Шапка);
			ТабличныйДокумент.Вывести(Область_Тело_1);
			ТабличныйДокумент.Вывести(Область_Тело_2);
			ТабличныйДокумент.Вывести(Область_ПустаяСтрока);
			ТабличныйДокумент.Вывести(Область_Подвал);
			
			ВыборкаПродавцы = ВыборкаДокументы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПродавцы.Следующий() Цикл
				
				Область_СтрокаПродавец.Параметры.Заполнить(ВыборкаПродавцы);
				
				ТабличныйДокумент.Вывести(Область_СтрокаПродавец);
			КонецЦикла;
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДокумента.Документ);
		КонецЦикла;	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции	

Функция Печать_ОбъяснительнаяПоНедостаче(ДанныеПечати, ОбъектыПечати, ПараметрыПечати)
	
	// Подготовка документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ОбъяснительнаяПоНедостаче";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	
	// Подготовка областей
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИТ_ПакетДокументовРезультатовИнвентаризации.ОбъяснительнаяПоНедостаче");
	Область_ПустаяСтрока		= Макет.ПолучитьОбласть("ПустаяСтрока");
	Область_Шапка_ФММР			= Макет.ПолучитьОбласть("Шапка_ФММР");
	Область_Шапка_ИП			= Макет.ПолучитьОбласть("Шапка_ИП");
	Область_Тело_1				= Макет.ПолучитьОбласть("Тело_1"); 
	Область_Тело_2				= Макет.ПолучитьОбласть("Тело_2");
	Область_ПустаяСтрокаВвода	= Макет.ПолучитьОбласть("ПустаяСтрокаВвода");
	Область_Подвал				= Макет.ПолучитьОбласть("Подвал");
	КомплекснаяОбласть			= Новый Массив();
	КомплекснаяОбласть.Добавить(Область_ПустаяСтрока);
	КомплекснаяОбласть.Добавить(Область_ПустаяСтрокаВвода);
	
	ИгнорируемаяНедостача = Константы.ИТ_ИгнорируемаяНедостача.Получить();
	
	// Вывод данных в табличный документ
	Для Каждого ДанныеДокумента Из ДанныеПечати.Документы Цикл
		
		ВыборкаДокументы = ДанныеПечати.Данные;
		ВыборкаДокументы.Сбросить();
		Пока ВыборкаДокументы.Следующий() Цикл
			
			ДокументИнвентаризация = ВыборкаДокументы.ДокументИнвентаризация;
			
			//Определим итоговое отклонение инвентаризации
			//СуммаОтклонения = ДокументИнвентаризация.Товары.Итог("СуммаФакт") - ДокументИнвентаризация.Товары.Итог("Сумма");
			СуммаОтклонения = ДокументИнвентаризация.Товары.Итог("СуммаРозничная");
			Если СуммаОтклонения <  ИгнорируемаяНедостача Тогда
				
				итСписаниеЕстественнаяУбыль 			   = ДокументИнвентаризация.Товары.Итог("итСписаниеЕстественнаяУбыль");
				итСписаниеПредпродажнаяПодготовка 		   = ДокументИнвентаризация.Товары.Итог("итСписаниеПредпродажнаяПодготовка");
				итСписаниеПоСрокуГодности 				   = ДокументИнвентаризация.Товары.Итог("итСписаниеПоСрокуГодности");
				
				СуммаОтклонения = СуммаОтклонения + итСписаниеЕстественнаяУбыль + итСписаниеПредпродажнаяПодготовка;
				
			КонецЕсли;
			
			//Если СуммаОтклонения > ИгнорируемаяНедостача Тогда
			//	Продолжить;
			//КонецЕсли;
			
			ВыборкаПродавцы		= ВыборкаДокументы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПродавцы.Следующий() Цикл
				НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
				
				// Заполнение данных
				Если ВыборкаДокументы.ЭтоФММР Тогда  
					Область_Шапка_ФММР.Параметры.Заполнить(ВыборкаПродавцы);
					Область_Шапка = Область_Шапка_ФММР;
				Иначе
					Область_Шапка_ИП.Параметры.ЮрЛицо_Представление_1 = СокрЛП(ВыборкаДокументы.ЮрЛицо.Наименование);
					
					Область_Шапка_ИП.Параметры.Заполнить(ВыборкаПродавцы);
					Область_Шапка = Область_Шапка_ИП;
				КонецЕсли;	
				
				ДолжностьСтрокой	= ВыборкаПродавцы.ДолжностьПродавца;
				ДолжностьСклонение	= ИТ_СпециальныйМодульСервер.ПолучитьСклонениеФИО(ДолжностьСтрокой, 2, 1);
				
				Область_Тело_1.Параметры.Заполнить(ВыборкаДокументы);
				
				Область_Тело_1.Параметры.ДатаИнвентаризации				= Формат(ДокументИнвентаризация.Дата, "ДЛФ=DD");
				Область_Тело_1.Параметры.СуммаИнвентаризации			= Формат(?(СуммаОтклонения < 0, -СуммаОтклонения, СуммаОтклонения), "ЧГ=0");
				Область_Тело_1.Параметры.СуммаИнвентаризацииПрописью	= ИТ_СпециальныйМодульСервер.СформироватьСуммуПрописью(СуммаОтклонения);
				
				// Вывод данных
				МногократноВывестиОбласть(ТабличныйДокумент, Область_ПустаяСтрока, 3);
				ТабличныйДокумент.Вывести(Область_Шапка);
				МногократноВывестиОбласть(ТабличныйДокумент, Область_ПустаяСтрока, 3);
				ТабличныйДокумент.Вывести(Область_Тело_1);
				ТабличныйДокумент.Вывести(Область_Тело_2);
				МногократноВывестиОбласть(ТабличныйДокумент, КомплекснаяОбласть, 3);
				МногократноВывестиОбласть(ТабличныйДокумент, Область_ПустаяСтрока, 2);
				ТабличныйДокумент.Вывести(Область_Подвал);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЦикла;	
		КонецЦикла;	
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДокумента.Документ);	
	КонецЦикла;	
	
	// Возврат
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция Печать_ЗаявлениеНаУдержание(ДанныеПечати, ОбъектыПечати, ПараметрыПечати)
	
	// Подготовка документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявлениеНаУдержание";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	
	// Подготовка областей
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИТ_ПакетДокументовРезультатовИнвентаризации.ЗаявлениеНаУдержание");
	Область_ПустаяСтрока		= Макет.ПолучитьОбласть("ПустаяСтрока");
	Область_Шапка_ФММР			= Макет.ПолучитьОбласть("Шапка_ФММР");
	Область_Шапка_ИП			= Макет.ПолучитьОбласть("Шапка_ИП");
	Область_Тело				= Макет.ПолучитьОбласть("Тело"); 
	Область_Подвал				= Макет.ПолучитьОбласть("Подвал");
	
	ИгнорируемаяНедостача = Константы.ИТ_ИгнорируемаяНедостача.Получить();
	
	// Вывод данных в табличный документ
	Для Каждого ДанныеДокумента Из ДанныеПечати.Документы Цикл
		
		ДокументПакет			= ДанныеДокумента.Документ;
		ТабличнаяЧастьПакета	= ДокументПакет.Инвентаризации;
		
		ВыборкаДокументы = ДанныеПечати.Данные;
		ВыборкаДокументы.Сбросить();
		Пока ВыборкаДокументы.Следующий() Цикл
			
			ДокументИнвентаризация	= ВыборкаДокументы.ДокументИнвентаризация;
			ДатаИнвентаризации		= ДокументИнвентаризация.Дата;
			
			//Определим итоговое отклонение инвентаризации
			//СуммаОтклонения = ДокументИнвентаризация.Товары.Итог("СуммаФакт") - ДокументИнвентаризация.Товары.Итог("Сумма");
			СуммаОтклонения = ДокументИнвентаризация.Товары.Итог("СуммаРозничная");
			Если СуммаОтклонения <  ИгнорируемаяНедостача Тогда
				
				итСписаниеЕстественнаяУбыль 			   = ДокументИнвентаризация.Товары.Итог("итСписаниеЕстественнаяУбыль");
				итСписаниеПредпродажнаяПодготовка 		   = ДокументИнвентаризация.Товары.Итог("итСписаниеПредпродажнаяПодготовка");
				итСписаниеПоСрокуГодности 				   = ДокументИнвентаризация.Товары.Итог("итСписаниеПоСрокуГодности");
				
				СуммаОтклонения = СуммаОтклонения + итСписаниеЕстественнаяУбыль + итСписаниеПредпродажнаяПодготовка;
				
			КонецЕсли;
			
			Если СуммаОтклонения > ИгнорируемаяНедостача Тогда
				Продолжить;
			КонецЕсли;
			
			ВыборкаПродавцы = ВыборкаДокументы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПродавцы.Следующий() Цикл
				
				Если ВыборкаПродавцы.ТипУдержания = Перечисления.ИТ_ТипыУдержанийПоРезультатамИнвентаризаций.ПоПКО Тогда
					Продолжить;	
				КонецЕсли;
				
				НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
				
				// Заполнение данных
				Если ВыборкаДокументы.ЭтоФММР Тогда  
					Область_Шапка_ФММР.Параметры.Заполнить(ВыборкаПродавцы);
					Область_Шапка = Область_Шапка_ФММР;
				Иначе
					Область_Шапка_ИП.Параметры.ЮрЛицо_Представление_1 = СокрЛП(ВыборкаДокументы.ЮрЛицо.Наименование);
					
					Область_Шапка_ИП.Параметры.Заполнить(ВыборкаПродавцы);
					Область_Шапка = Область_Шапка_ИП;
				КонецЕсли;	
				
				Область_Тело.Параметры.ДатаИнвентаризации	= Формат(ДатаИнвентаризации, "ДЛФ=DD");
				Область_Тело.Параметры.МесяцУдержания		= ПолучитьМесяцУдержанияСтрокой(ДокументПакет.Дата);
				
				СуммаКУдержанию = ВыборкаПродавцы.СуммаКУдержанию;
				СуммаКУдержанию = ?(СуммаКУдержанию < 0, -СуммаКУдержанию, СуммаКУдержанию);
				
				Область_Тело.Параметры.СуммаИнвентаризации			= Формат(СуммаКУдержанию, "ЧГ=0");
				Область_Тело.Параметры.СуммаИнвентаризацииПрописью	= ИТ_СпециальныйМодульСервер.СформироватьСуммуПрописью(СуммаКУдержанию);
				
				Область_Подвал.Параметры.ДатаЗаявления = Формат(ДатаИнвентаризации, "ДЛФ=DD");
				// Вывод данных
				ТабличныйДокумент.Вывести(Область_Шапка);
				МногократноВывестиОбласть(ТабличныйДокумент, Область_ПустаяСтрока, 3);
				ТабличныйДокумент.Вывести(Область_Тело);
				МногократноВывестиОбласть(ТабличныйДокумент, Область_ПустаяСтрока, 3);
				ТабличныйДокумент.Вывести(Область_Подвал);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЦикла;	
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДокументПакет);
	КонецЦикла;	
	
	// Возврат
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция Печать_ПриказОбУдержании(ДанныеПечати, ОбъектыПечати, ПараметрыПечати)
	
	// Подготовка документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ПриказОбУдержании";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	
	// Подготовка областей
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИТ_ПакетДокументовРезультатовИнвентаризации.ПриказОбУдержании");
	Область_ПустаяСтрока	= Макет.ПолучитьОбласть("ПустаяСтрока");
	Область_Шапка			= Макет.ПолучитьОбласть("Шапка");
	Область_Тело_1			= Макет.ПолучитьОбласть("Тело_1"); 
	Область_Тело_2_ИП		= Макет.ПолучитьОбласть("Тело_2_ИП");
	Область_Тело_2_ФММР		= Макет.ПолучитьОбласть("Тело_2_ФММР");
	Область_Подвал_1_ФММР	= Макет.ПолучитьОбласть("Подвал_1_ФММР");
	Область_Подвал_1_ИП		= Макет.ПолучитьОбласть("Подвал_1_ИП");
	Область_Подвал_2		= Макет.ПолучитьОбласть("Подвал_2");
	
	ИгнорируемаяНедостача = Константы.ИТ_ИгнорируемаяНедостача.Получить();
	
	// Вывод данных в табличный документ
	Для Каждого ДанныеДокумента Из ДанныеПечати.Документы Цикл
		
		ДокументПакет			= ДанныеДокумента.Документ;
		ТабличнаяЧастьПакета	= ДокументПакет.Инвентаризации;
		
		ВыборкаДокументы = ДанныеПечати.Данные;
		ВыборкаДокументы.Сбросить();
		Пока ВыборкаДокументы.Следующий() Цикл
			
			ДокументИнвентаризация = ВыборкаДокументы.ДокументИнвентаризация;
			
			//Определим итоговое отклонение инвентаризации
			//СуммаОтклонения = ДокументИнвентаризация.Товары.Итог("СуммаФакт") - ДокументИнвентаризация.Товары.Итог("Сумма");
			СуммаОтклонения = ДокументИнвентаризация.Товары.Итог("СуммаРозничная");
			Если СуммаОтклонения <  ИгнорируемаяНедостача Тогда
				
				итСписаниеЕстественнаяУбыль 			   = ДокументИнвентаризация.Товары.Итог("итСписаниеЕстественнаяУбыль");
				итСписаниеПредпродажнаяПодготовка 		   = ДокументИнвентаризация.Товары.Итог("итСписаниеПредпродажнаяПодготовка");
				итСписаниеПоСрокуГодности 				   = ДокументИнвентаризация.Товары.Итог("итСписаниеПоСрокуГодности");
				
				СуммаОтклонения = СуммаОтклонения + итСписаниеЕстественнаяУбыль + итСписаниеПредпродажнаяПодготовка;
				
			КонецЕсли;
			
			Если СуммаОтклонения > ИгнорируемаяНедостача Тогда
				Продолжить;
			КонецЕсли;
			
			ВыборкаПродавцы = ВыборкаДокументы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПродавцы.Следующий() Цикл
				
				Если ВыборкаПродавцы.ТипУдержания = Перечисления.ИТ_ТипыУдержанийПоРезультатамИнвентаризаций.ПоПКО Тогда
					Продолжить;	
				КонецЕсли;
				
				НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
				
				// Заполнение данных
				Область_Шапка.Параметры.ГодИнвентаризации = Формат(Год(ДокументИнвентаризация.Дата), "ЧГ=0");
				
				Область_Тело_1.Параметры.Заполнить(ВыборкаДокументы);
				
				Область_Тело_1.Параметры.Магазин_Представление	= Строка(ВыборкаДокументы.Магазин);
				Область_Тело_1.Параметры.МесяцУдержания			= ПолучитьМесяцУдержанияСтрокой(ДокументПакет.Дата);
				
				Если ВыборкаДокументы.ЭтоФММР Тогда  
					Область_Тело_2		= Область_Тело_2_ФММР;
					Область_Подвал_1	= Область_Подвал_1_ФММР;
				Иначе
					Область_Тело_2		= Область_Тело_2_ИП;
					Область_Подвал_1	= Область_Подвал_1_ИП;
					Область_Подвал_1.Параметры.Заполнить(ВыборкаДокументы);
				КонецЕсли;	
				
				Область_Тело_2.Параметры.НомерДокумента	= ПрефиксацияОбъектовПлатформа.ПолучитьНомерНаПечать(ДокументИнвентаризация.Номер);
				Область_Тело_2.Параметры.ДатаДокумента	= Формат(ДокументИнвентаризация.Дата, "ДФ=dd.MM.yyyy");
				
				Область_Тело_1.Параметры.ДатаИнвентаризации			= Формат(ДокументИнвентаризация.Дата, "ДЛФ=DD");
				Область_Тело_1.Параметры.Продавец_Представление_1	= ВыборкаПродавцы.Продавец_Представление_1;
				
				СуммаКУдержанию = ВыборкаПродавцы.СуммаКУдержанию;
				СуммаКУдержанию = ?(СуммаКУдержанию < 0, -СуммаКУдержанию, СуммаКУдержанию);
				
				Область_Тело_1.Параметры.СуммаИнвентаризации			= Формат(СуммаКУдержанию, "ЧГ=0");
				Область_Тело_1.Параметры.СуммаИнвентаризацииПрописью	= ИТ_СпециальныйМодульСервер.СформироватьСуммуПрописью(СуммаКУдержанию);
				
				Область_Подвал_2.Параметры.Продавец_Представление_1 = "/" + ВыборкаПродавцы.Продавец_Представление_1 + "/";
				Область_Подвал_2.Параметры.ПродавецДолжность        = ВыборкаПродавцы.ДолжностьПродавца;
				// Вывод данных
				МногократноВывестиОбласть(ТабличныйДокумент, Область_ПустаяСтрока, 2);
				ТабличныйДокумент.Вывести(Область_Шапка);
				ТабличныйДокумент.Вывести(Область_ПустаяСтрока);
				ТабличныйДокумент.Вывести(Область_Тело_1);
				ТабличныйДокумент.Вывести(Область_Тело_2);
				МногократноВывестиОбласть(ТабличныйДокумент, Область_ПустаяСтрока, 3);
				ТабличныйДокумент.Вывести(Область_Подвал_1);
				ТабличныйДокумент.Вывести(Область_Подвал_2);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЦикла;	
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДокументПакет);
	КонецЦикла;	
	
	// Возврат
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция Печать_СличительнаяВедомостьИНВ19(ДанныеПечати, ОбъектыПечати, ПараметрыПечати)
	
	// Подготовка документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СличительнаяВедомостьИНВ19";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	
	// Подготовка областей
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИТ_ПакетДокументовРезультатовИнвентаризации.СличительнаяВедомостьИНВ19");
	Область_Шапка					= Макет.ПолучитьОбласть("Шапка");
	Область_ОкончаниеШапки			= Макет.ПолучитьОбласть("ОкончаниеШапки");
	Область_СтрокаПродавец			= Макет.ПолучитьОбласть("СтрокаПродавец");
	Область_Тело					= Макет.ПолучитьОбласть("Тело"); 
	Область_Подвал					= Макет.ПолучитьОбласть("Подвал");
	Область_СтрокаПродавецПодвал	= Макет.ПолучитьОбласть("СтрокаПродавецПодвал");
	
	// Вывод данных в табличный документ
	Для Каждого ДанныеДокумента Из ДанныеПечати.Документы Цикл
		
		ВыборкаДокументы = ДанныеПечати.Данные;
		ВыборкаДокументы.Сбросить();
		Пока ВыборкаДокументы.Следующий() Цикл
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			ДокументИнвентаризация	= ВыборкаДокументы.ДокументИнвентаризация;
			ДатаИнвентаризации		= ДокументИнвентаризация.Дата;
			// Заполнение данных
			Если ВыборкаДокументы.ЭтоФММР Тогда  
				Область_Шапка.Параметры.Заполнить(ВыборкаДокументы);
				Область_Шапка.Параметры.ЮрЛицо_Представление_1 = "Общество с Ограниченной Ответственностью «Франчайзинговые Магазины «Мясницкий ряд»";					
			Иначе
				Область_Шапка.Параметры.Заполнить(ВыборкаДокументы);
				Область_Шапка.Параметры.ЮрЛицо_Представление_1 = СокрЛП(ВыборкаДокументы.ЮрЛицо.Наименование);
			КонецЕсли;	
			
			Область_Шапка.Параметры.НомерДокумента			= ПрефиксацияОбъектовПлатформа.ПолучитьНомерНаПечать(ДокументИнвентаризация.Номер);
			Область_Шапка.Параметры.ДатаДокумента			= Формат(ДатаИнвентаризации, "ДФ=dd.MM.yyyy");
			Область_Шапка.Параметры.Магазин_Представление	= Строка(ВыборкаДокументы.Магазин);
			
			ТабличныйДокумент.Вывести(Область_Шапка);
			
			// Заполнение продавцов
			СчетчикПродавца	= 1;
			ВыборкаПродавцы = ВыборкаДокументы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПродавцы.Следующий() Цикл
				
				Если СчетчикПродавца > 4 Тогда 
					Продолжить;
				КонецЕсли;	
				
				Область_СтрокаПродавец.Параметры.Заполнить(ВыборкаПродавцы);
				
				ТабличныйДокумент.Вывести(Область_СтрокаПродавец);
				
				Если СчетчикПродавца = 1 Тогда
					Область_Подвал.Параметры.ДолжностьПродавца_1		= ВыборкаПродавцы.ДолжностьПродавца; 
					Область_Подвал.Параметры.Продавец_1_Представление_1	= ВыборкаПродавцы.Продавец_Представление_1;	
				КонецЕсли;
				
				СчетчикПродавца = СчетчикПродавца + 1;
			КонецЦикла;	
			
			Область_ОкончаниеШапки.Параметры.ДатаВедомости = Формат(ДатаИнвентаризации+86400, "ДЛФ=DD");
			// Вывод данных
			ТабличныйДокумент.Вывести(Область_ОкончаниеШапки);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокумент.Вывести(Область_Тело);
			ТабличныйДокумент.Вывести(Область_Подвал);
			
			//Вывод продавцов в подвале
			ВыборкаПродавцы.Сбросить();
			СчетчикПродавца	= 1;
			Пока ВыборкаПродавцы.Следующий() Цикл
				Если СчетчикПродавца = 1 Тогда
					СчетчикПродавца = СчетчикПродавца + 1;
					Продолжить;
				КонецЕсли;
				
				Область_СтрокаПродавецПодвал.Параметры.Заполнить(ВыборкаПродавцы);
				ТабличныйДокумент.Вывести(Область_СтрокаПродавецПодвал);
				
				СчетчикПродавца = СчетчикПродавца + 1;
			КонецЦикла;
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДокумента.Документ);	
	КонецЦикла;	
	
	// Возврат
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция Печать_ИнвентаризационнаяОписьИНВ3(ДанныеПечати, ОбъектыПечати, ПараметрыПечати)
	
	// Подготовка документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризационнаяОписьИНВ3";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	
	// Подготовка областей
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИТ_ПакетДокументовРезультатовИнвентаризации.ИнвентаризационнаяОписьИНВ3");
	Область_Шапка					= Макет.ПолучитьОбласть("Шапка");
	Область_СтрокаПродавецШапки		= Макет.ПолучитьОбласть("СтрокаПродавецШапка");
	Область_ОкончаниеШапки			= Макет.ПолучитьОбласть("ОкончаниеШапки");
	Область_Подвал					= Макет.ПолучитьОбласть("Подвал");
	Область_СтрокаПродавецПодвала	= Макет.ПолучитьОбласть("СтрокаПродавецПодвал"); 
	Область_ОкончаниеПодвала		= Макет.ПолучитьОбласть("ОкончаниеПодвала");
	
	// Вывод данных в табличный документ
	Для Каждого ДанныеДокумента Из ДанныеПечати.Документы Цикл
		
		ВыборкаДокументы = ДанныеПечати.Данные;
		ВыборкаДокументы.Сбросить();
		Пока ВыборкаДокументы.Следующий() Цикл
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			ДокументИнвентаризация	= ВыборкаДокументы.ДокументИнвентаризация;
			ДатаИнвентаризации		= ДокументИнвентаризация.Дата;
			// Заполнение данных
			Если ВыборкаДокументы.ЭтоФММР Тогда  
				Область_Шапка.Параметры.Заполнить(ВыборкаДокументы);
				Область_Шапка.Параметры.ЮрЛицо_Представление_1 = "Общество с Ограниченной Ответственностью «Франчайзинговые Магазины «Мясницкий ряд»";					
				
				//Область_Подвал.Параметры.Заполнить(ДанныеДокумента);
				Если ЗначениеЗаполнено(ДанныеПечати.Пакет) Тогда
					Пакет = ДанныеПечати.Пакет;
					Если ЗначениеЗаполнено(Пакет.ПредседательКомиссии) Тогда
						Область_Подвал.Параметры.ДолжностьПредседательКомиссии      = Пакет.ПредседательКомиссии.Должность;
						Область_Подвал.Параметры.Представление_ПредседательКомиссии  = Пакет.ПредседательКомиссии;
					КонецЕсли;	
					Если ЗначениеЗаполнено(Пакет.ЧленКомиссии_ЛинейныйМенеджер) Тогда
						Область_Подвал.Параметры.ДолжностьЧленаКомиссии_1      = Пакет.ЧленКомиссии_ЛинейныйМенеджер.Должность;
						Область_Подвал.Параметры.Представление_ЧленКомиссии_СтаршийМенеджер  = Пакет.ЧленКомиссии_ЛинейныйМенеджер;
					КонецЕсли;	
					Если ЗначениеЗаполнено(Пакет.ЧленКомиссии_СтаршийМенеджер) Тогда
						Область_Подвал.Параметры.ДолжностьЧленаКомиссии_2      = Пакет.ЧленКомиссии_СтаршийМенеджер.Должность;
						Область_Подвал.Параметры.Представление_ЧленКомиссии_ЛинейныйМенеджер  = Пакет.ЧленКомиссии_СтаршийМенеджер;
					КонецЕсли;
					Если ЗначениеЗаполнено(Пакет.ЧленКомиссии_СотрудникСлужбыБезопасности) Тогда
						Область_Подвал.Параметры.ДолжностьЧленаКомиссии_3      = Пакет.ЧленКомиссии_СотрудникСлужбыБезопасности.Должность;
						Область_Подвал.Параметры.Представление_ЧленКомиссии_СотрудникСлужбыБезопасности  = Пакет.ЧленКомиссии_СотрудникСлужбыБезопасности;
					КонецЕсли;
							
					
				Иначе
				    Область_Подвал.Параметры.Заполнить(ДанныеДокумента);
					Область_Подвал.Параметры.ДолжностьПредседательКомиссии	= "Руководитель КРО";
					Область_Подвал.Параметры.ДолжностьЧленаКомиссии_1		= "Руководитель направления";
					Область_Подвал.Параметры.ДолжностьЧленаКомиссии_2		= "Линейный менеджер";
					//Область_Подвал.Параметры.ДолжностьЧленаКомиссии_3		= "Председатель комиссии";
					
				КонецЕсли;
				
			Иначе
				Область_Шапка.Параметры.Заполнить(ВыборкаДокументы);
				Область_Шапка.Параметры.ЮрЛицо_Представление_1 = СокрЛП(ВыборкаДокументы.ЮрЛицо.Наименование);
			КонецЕсли;
			
			Область_Шапка.Параметры.НомерДокумента			= ПрефиксацияОбъектовПлатформа.ПолучитьНомерНаПечать(ДокументИнвентаризация.Номер);
			Область_Шапка.Параметры.ДатаДокумента			= Формат(ДатаИнвентаризации, "ДФ=dd.MM.yyyy");
			Область_Шапка.Параметры.Магазин_Представление	= Строка(ВыборкаДокументы.Магазин);

			// Вывод данных
			ТабличныйДокумент.Вывести(Область_Шапка);
			
			// Заполнение продавцов
			СчетчикПродавца	= 1;
			ВыборкаПродавцы = ВыборкаДокументы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПродавцы.Следующий() Цикл
				
				Если СчетчикПродавца > 4 Тогда 
					Продолжить;
				КонецЕсли;	
				
				Область_СтрокаПродавецШапки.Параметры.Заполнить(ВыборкаПродавцы);
				
				ТабличныйДокумент.Вывести(Область_СтрокаПродавецШапки);
				
				СчетчикПродавца = СчетчикПродавца + 1;
			КонецЦикла;	
			
			Область_ОкончаниеШапки.Параметры.ДатаОписи = Формат(ДатаИнвентаризации+86400, "ДЛФ=DD");
			
			ТабличныйДокумент.Вывести(Область_ОкончаниеШапки);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокумент.Вывести(Область_Подвал);
			
			//Вывод продавцов в подвале
			ВыборкаПродавцы.Сбросить();
			Пока ВыборкаПродавцы.Следующий() Цикл
				
				Область_СтрокаПродавецПодвала.Параметры.Заполнить(ВыборкаПродавцы);
				ТабличныйДокумент.Вывести(Область_СтрокаПродавецПодвала);
				
			КонецЦикла;
			
			ТабличныйДокумент.Вывести(Область_ОкончаниеПодвала);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;	
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДокумента.Документ);
	КонецЦикла;	
	
	// Возврат
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция Печать_ЗаявкаНаПогашениеНедостачи(ДанныеПечати, ОбъектыПечати, ПараметрыПечати)
	
	// Подготовка документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаПогашениеНедостачи";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ПолеСлева				= 1;
	ТабличныйДокумент.ПолеСправа			= 1;
	
	// Подготовка областей
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИТ_ПакетДокументовРезультатовИнвентаризации.ЗаявкаНаПогашениеНедостачи");
	
	Область_Шапка = Макет.ПолучитьОбласть("Шапка");
	
	ИгнорируемаяНедостача = Константы.ИТ_ИгнорируемаяНедостача.Получить();
	
	// Вывод данных в табличный документ
	Для Каждого ДанныеДокумента Из ДанныеПечати.Документы Цикл
		
		ТекущийДокументПакет = ДанныеДокумента.Документ;
		
		ВыборкаДокументы = ДанныеПечати.Данные;
		ВыборкаДокументы.Сбросить();
		Пока ВыборкаДокументы.Следующий() Цикл
			
			ДокументИнвентаризация = ВыборкаДокументы.ДокументИнвентаризация;
			
			//Определим итоговое отклонение инвентаризации
			//сСуммаОтклонения = ДокументИнвентаризация.Товары.Итог("СуммаФакт") - ДокументИнвентаризация.Товары.Итог("Сумма");
			СуммаОтклонения = ДокументИнвентаризация.Товары.Итог("СуммаРозничная");
			Если СуммаОтклонения <  ИгнорируемаяНедостача Тогда
				
				итСписаниеЕстественнаяУбыль 			   = ДокументИнвентаризация.Товары.Итог("итСписаниеЕстественнаяУбыль");
				итСписаниеПредпродажнаяПодготовка 		   = ДокументИнвентаризация.Товары.Итог("итСписаниеПредпродажнаяПодготовка");
				итСписаниеПоСрокуГодности 				   = ДокументИнвентаризация.Товары.Итог("итСписаниеПоСрокуГодности");
				
				СуммаОтклонения = СуммаОтклонения + итСписаниеЕстественнаяУбыль + итСписаниеПредпродажнаяПодготовка;
				
			КонецЕсли;

			Если СуммаОтклонения > ИгнорируемаяНедостача Тогда
				Продолжить;
			КонецЕсли;
			
			СуммаИнвентаризации = ?(СуммаОтклонения<0, -СуммаОтклонения, СуммаОтклонения);
			СуммаИнвентаризацииПрописью = ИТ_СпециальныйМодульСервер.СформироватьСуммуПрописью(СуммаИнвентаризации);
			
			ВыборкаПродавцы = ВыборкаДокументы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПродавцы.Следующий() Цикл
				
				Если ВыборкаПродавцы.ТипУдержания = Перечисления.ИТ_ТипыУдержанийПоРезультатамИнвентаризаций.ИзЗарплаты Тогда
					Продолжить;	
				КонецЕсли;
				
				НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

				//Заполнение данных
				Область_Шапка.Параметры.Заполнить(ВыборкаДокументы);
				
				Область_Шапка.Параметры.ЮрЛицо				= СокрЛП(ВыборкаДокументы.ЮрЛицо.Наименование);
				Область_Шапка.Параметры.НомерИнвентаризации = ПрефиксацияОбъектовПлатформа.ПолучитьНомерНаПечать(ДокументИнвентаризация.Номер);
				Область_Шапка.Параметры.ДатаИнвентаризации	= Формат(ДокументИнвентаризация.Дата, "ДФ=dd.MM.yyyy");
				Область_Шапка.Параметры.ПринятоОт			= ВыборкаПродавцы.Продавец_Представление_1;
				Область_Шапка.Параметры.СуммаИнвентаризации	= Строка(СуммаИнвентаризации) + " (" + СуммаИнвентаризацииПрописью + " )";
				Область_Шапка.Параметры.ЛинейныйМенеджер	= Строка(ТекущийДокументПакет.ЛинейныйМенеджер);
				
				ТабличныйДокумент.Вывести(Область_Шапка);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЦикла;
		КонецЦикла;
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокументПакет);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;	
	
КонецФункции

Функция Печать_РеестрДокументов(ДанныеПечати, ОбъектыПечати, ПараметрыПечати)
	
	// Подготовка документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_РеестрДокументов";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ПолеСлева				= 1;
	ТабличныйДокумент.ПолеСправа			= 1;
	
	// Подготовка областей
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИТ_ПакетДокументовРезультатовИнвентаризации.РеестрДокументов");
	Область_Шапка	= Макет.ПолучитьОбласть("Шапка");
	Область_Строка	= Макет.ПолучитьОбласть("Строка");
	
	ИгнорируемаяНедостача = Константы.ИТ_ИгнорируемаяНедостача.Получить();
	
	// Вывод данных в табличный документ
	Для Каждого ДанныеДокумента Из ДанныеПечати.Документы Цикл
		
		ТекущийДокументПакет				= ДанныеДокумента.Документ;
		Область_Шапка.Параметры.Документ	= ТекущийДокументПакет;
		
		ТекущийЛинейныйМенеджер = ДанныеДокумента.ЛинейныйМенеджер;
		
		МассивТорговыхТочек = Новый Массив();
		Для Каждого СтрокаДокумента Из ТекущийДокументПакет.Инвентаризации Цикл
			ИТ_СпециальныйМодульСервер.ДобавитьУникальноеЗначениеВМассив(МассивТорговыхТочек, СтрокаДокумента.Магазин);
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДанныеДокумента.Статус) Тогда
			Область_Шапка.Параметры.Статус = "Статус """ + ДанныеДокумента.Статус + """";
			
			Если ЗначениеЗаполнено(ДанныеДокумента.ДатаСтатуса) Тогда
				Область_Шапка.Параметры.ДатаСтатуса = " установлен " + Формат(ДанныеДокумента.ДатаСтатуса, "ДФ=dd.MM.yyyy");
			КонецЕсли;
			Область_Шапка.Параметры.Ответственный = ДанныеДокумента.Ответственный;
		КонецЕсли;
		
		Если Не ПустаяСтрока(ДанныеДокумента.Представление_ЧленКомиссии_СтаршийМенеджер) Тогда
			Область_Шапка.Параметры.РуководительНаправления = ДанныеДокумента.Представление_ЧленКомиссии_СтаршийМенеджер;
		Иначе
			Если ЗначениеЗаполнено(ТекущийЛинейныйМенеджер) Тогда
				//Попробуем найти старшего менеджера по линейному
				ТекущийСтаршийМенеджер = ОпределитьСтаршегоМенеджераПоЛинейному(ТекущийЛинейныйМенеджер, ДанныеДокумента.Дата, МассивТорговыхТочек);
				
				Если ЗначениеЗаполнено(ТекущийСтаршийМенеджер) Тогда
					Область_Шапка.Параметры.РуководительНаправления = Строка(ТекущийСтаршийМенеджер);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущийЛинейныйМенеджер) Тогда
			Область_Шапка.Параметры.ЛинейныйМенеджер = ТекущийЛинейныйМенеджер;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Область_Шапка);
		
		СерыйЦвет = Новый Цвет(192, 192, 192);
		БелыйЦвет = Новый Цвет(255, 255, 255);
		
		Для Каждого СтрокаТабличнойЧасти Из ТекущийДокументПакет.Инвентаризации Цикл
			Область_Строка.Параметры.Заполнить(СтрокаТабличнойЧасти);
			
			//РезультатИнвентаризации = СтрокаТабличнойЧасти.ДокументИнвентаризация.Товары.Итог("СуммаФакт") - СтрокаТабличнойЧасти.ДокументИнвентаризация.Товары.Итог("Сумма");	
			РезультатИнвентаризации = СтрокаТабличнойЧасти.ДокументИнвентаризация.Товары.Итог("СуммаРозничная");
			Если РезультатИнвентаризации > ИгнорируемаяНедостача Тогда
				Область_Строка.Область(1, 12, 3, 14).ЦветФона = СерыйЦвет;
			Иначе
				Область_Строка.Область(1, 12, 3, 14).ЦветФона = БелыйЦвет;
			КонецЕсли;
			
			Область_Строка.Параметры.РезультатИнвентаризации = РезультатИнвентаризации;
			ТабличныйДокумент.Вывести(Область_Строка);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодготовитьДанныеПечати(МассивДокументов, МассивИнвентаризаций)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИТ_ПакетДокументовРезультатовИнвентаризации.Ссылка КАК Документ,
		|	ИТ_ПакетДокументовРезультатовИнвентаризации.Номер КАК Номер,
		|	ИТ_ПакетДокументовРезультатовИнвентаризации.Дата КАК Дата,
		|	ИТ_ПакетДокументовРезультатовИнвентаризации.ЛинейныйМенеджер КАК ЛинейныйМенеджер,
		|	ИТ_ПакетДокументовРезультатовИнвентаризации.ПредседательКомиссии КАК ПредседательКомиссии,
		|	ИТ_ПакетДокументовРезультатовИнвентаризации.ЧленКомиссии_СтаршийМенеджер КАК ЧленКомиссии_СтаршийМенеджер,
		|	ИТ_ПакетДокументовРезультатовИнвентаризации.ЧленКомиссии_ЛинейныйМенеджер КАК ЧленКомиссии_ЛинейныйМенеджер,
		|	ИТ_ПакетДокументовРезультатовИнвентаризации.ЧленКомиссии_СотрудникСлужбыБезопасности КАК ЧленКомиссии_СотрудникСлужбыБезопасности,
		|	ПРЕДСТАВЛЕНИЕ(ИТ_ПакетДокументовРезультатовИнвентаризации.ЛинейныйМенеджер) КАК Представление_ЛинейныйМенеджер,
		|	ПРЕДСТАВЛЕНИЕ(ИТ_ПакетДокументовРезультатовИнвентаризации.ПредседательКомиссии) КАК Представление_ПредседательКомиссии,
		|	ПРЕДСТАВЛЕНИЕ(ИТ_ПакетДокументовРезультатовИнвентаризации.ЧленКомиссии_СтаршийМенеджер) КАК Представление_ЧленКомиссии_СтаршийМенеджер,
		|	ПРЕДСТАВЛЕНИЕ(ИТ_ПакетДокументовРезультатовИнвентаризации.ЧленКомиссии_ЛинейныйМенеджер) КАК Представление_ЧленКомиссии_ЛинейныйМенеджер,
		|	ПРЕДСТАВЛЕНИЕ(ИТ_ПакетДокументовРезультатовИнвентаризации.ЧленКомиссии_СотрудникСлужбыБезопасности) КАК Представление_ЧленКомиссии_СотрудникСлужбыБезопасности,
		|	ИТ_ПакетДокументовРезультатовИнвентаризации.Статус,
		|	ИТ_ПакетДокументовРезультатовИнвентаризации.ДатаСтатуса,
		|	ИТ_ПакетДокументовРезультатовИнвентаризации.Ответственный
		|ИЗ
		|	Документ.ИТ_ПакетДокументовРезультатовИнвентаризации КАК ИТ_ПакетДокументовРезультатовИнвентаризации
		|ГДЕ
		|	ИТ_ПакетДокументовРезультатовИнвентаризации.Ссылка В(&МассивДокументов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Магазин) КАК Магазин,
		|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ДокументИнвентаризация КАК ДокументИнвентаризация,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ЮрЛицо = &ЮрЛицоФММР
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК ЭтоФММР,
		|	МАКСИМУМ(ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ЮрЛицо) КАК ЮрЛицо,
		|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Должность КАК ДолжностьПродавца,
		|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Продавец КАК Продавец_Представление_1,
		|	МАКСИМУМ(ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Магазин_Адрес) КАК Магазин_Адрес,
		|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.СуммаКУдержанию,
		|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ТипУдержания
		|ИЗ
		|	Документ.ИТ_ПакетДокументовРезультатовИнвентаризации.Инвентаризации КАК ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации
		|ГДЕ
		|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Ссылка В(&МассивДокументов)
		|	И (ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ИдентификаторСтроки В (&МассивИнвентаризаций)
		|			ИЛИ &МассивИнвентаризацийПустой)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ДокументИнвентаризация,
		|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Должность,
		|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Продавец,
		|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.СуммаКУдержанию,
		|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ТипУдержания
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументИнвентаризация
		|ИТОГИ ПО
		|	ДокументИнвентаризация
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("МассивДокументов",			МассивДокументов);
	Запрос.УстановитьПараметр("ЮрЛицоФММР",					Справочники.Организации.НайтиПоРеквизиту("ЕРПМастерКлюч","00000000150"));	
//	Запрос.УстановитьПараметр("ЮрЛицоФММР",					Справочники.ИТ_Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("c399a75a-e536-4773-9316-6e3366e5b32a")));// ООО ФММР
	Запрос.УстановитьПараметр("МассивИнвентаризаций",		МассивИнвентаризаций);
	Запрос.УстановитьПараметр("МассивИнвентаризацийПустой",	МассивИнвентаризаций.Количество() = 0);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДанных = Новый Структура();
	
	СтруктураДанных.Вставить("Документы",	РезультатЗапроса.Получить(0).Выгрузить());
	СтруктураДанных.Вставить("Данные",		РезультатЗапроса.Получить(1).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	СтруктураДанных.Вставить("Пакет", 		?(МассивДокументов.Количество()>0,МассивДокументов[0],Документы.ИТ_ПакетДокументовРезультатовИнвентаризации.ПустаяСсылка())); 
	
	//Возврат
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПолучитьМесяцУдержанияСтрокой(Дата)
	
	ДатаСтрокой		= Формат(Дата, "ДФ='dd MMMM yyyy ""г.""'");
	МесяцУдержания	= Сред(ДатаСтрокой, 4);
	
	Возврат МесяцУдержания;
	
КонецФункции

Функция ОпределитьСтаршегоМенеджераПоЛинейному(ЛинейныйМенеджер, НаДату, МассивТорговыхТочек = Неопределено)
	
	Если МассивТорговыхТочек = Неопределено Тогда
		МассивТорговыхТочек = Новый Массив();	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ит_ТорговыеТочки_ОтветственныеСрезПоследних.СтМенеджер
		|ИЗ
		|	РегистрСведений.ит_ТорговыеТочки_Ответственные.СрезПоследних(
		|			&НаДату,
		|			Менеджер = &ЛинейныйМенеджер
		|				И ТорговаяТочка В (&МассивТорговыхТочек)) КАК ит_ТорговыеТочки_ОтветственныеСрезПоследних";
	
	Запрос.УстановитьПараметр("ЛинейныйМенеджер", ЛинейныйМенеджер);
	Запрос.УстановитьПараметр("МассивТорговыхТочек", МассивТорговыхТочек);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтаршийМенеджер = Справочники.Сотрудники.ПустаяСсылка();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтаршийМенеджер = ВыборкаДетальныеЗаписи.СтМенеджер;
		Прервать;
	КонецЦикла;
	
	Возврат СтаршийМенеджер;
	
КонецФункции

Функция МногократноВывестиОбласть(ТабличныйДокумент, ОбластьМакета, КоличествоВыводов)
	
	Для НомерВывода = 1 По КоличествоВыводов Цикл 
		Если ТипЗнч(ОбластьМакета) = Тип("Массив") Тогда 
			Для Каждого ОбластьМассива Из ОбластьМакета Цикл 
				ТабличныйДокумент.Вывести(ОбластьМассива);	
			КонецЦикла;	
		Иначе	
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;	
	КонецЦикла;	
	
КонецФункции	

#КонецОбласти	

#КонецЕсли