
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ДополнительныеСвойства.Свойство("ЖурналПередачиДокументов") Тогда
		
		Журнал = ДополнительныеСвойства.ЖурналПередачиДокументов;
		
		Движения.ИТ_ДвиженияПакетаДокументовРезультатовИнвентаризации.Записывать = Истина;
		
		Для Каждого СтрокаРеестра Из Инвентаризации Цикл
			НоваяЗапись = Движения.ИТ_ДвиженияПакетаДокументовРезультатовИнвентаризации.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаРеестра);
			
			НоваяЗапись.Журнал = Журнал;
			НоваяЗапись.ДокументРегистратор = Ссылка;
		КонецЦикла;
	КонецЕсли;
	
	ТабПроверкиСозданныхДокументов = Инвентаризации.ВыгрузитьКолонки();
	
	Если Не ЗначениеЗаполнено(КорректируемыйПакетДокументов) Тогда
		//Создание документа фиксации результатов инв. по продавцам.
		//Создаём только для тех строк, по которым приняли весь пакет документов
		
		Для Каждого СтрокаДокумента Из Инвентаризации Цикл
			Если СтрокаДокумента.СуммаКУдержанию = 0
				И ВсеДокументыПриняты(СтрокаДокумента) Тогда
				Сообщить("В строке " + СтрокаДокумента.НомерСтроки + " не указана сумма к удержанию! Фиксация сформирована не будет!");	
			КонецЕсли;
			
			Если ВсеДокументыПриняты(СтрокаДокумента)
				И СтрокаДокумента.СуммаКУдержанию <> 0
				И СтрокаДокумента.ВидОперации <> Перечисления.ИТ_ВидыОперацийПакетаДокументовРезультатовИнвентаризации.Корректировка
				Тогда
				НоваяСтрокаТабПроверки = ТабПроверкиСозданныхДокументов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТабПроверки, СтрокаДокумента);
			КонецЕсли;
		КонецЦикла;
		
		ИдентификаторыДляФиксации = ИТ_СпециальныйМодульСервер.ПолучитьДанныеДляФиксацииРезультатовИнвентаризацииПоПродавцам(ТабПроверкиСозданныхДокументов, Ссылка);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИдентификаторыСтрок", ИдентификаторыДляФиксации);
		Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Магазин,
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ДокументИнвентаризация КАК ДокументИнвентаризации,
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Продавец,
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ПриказОбИнвентаризации,
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ТипУдержания,
				|	-ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.СуммаКУдержанию КАК СуммаКУдержанию,
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.СуммаИнвентаризации,
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ВидОперации
				|ИЗ
				|	Документ.ИТ_ПакетДокументовРезультатовИнвентаризации.Инвентаризации КАК ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации
				|ГДЕ
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ИдентификаторСтроки В(&ИдентификаторыСтрок)";
		
		РезультатЗапроса = Запрос.Выполнить();                               
		
		ТаблицаДанныхДляФиксации = РезультатЗапроса.Выгрузить();
		
		Если ТаблицаДанныхДляФиксации.Количество() > 0 Тогда
			ДокументФиксации = Документы.ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцам.СоздатьДокумент();
			
			СтруктураЗаполнения = Новый Структура("ДокументОснование, ТаблицаДанныхДляФиксации");
			СтруктураЗаполнения.ДокументОснование = Ссылка;
			СтруктураЗаполнения.ТаблицаДанныхДляФиксации = ТаблицаДанныхДляФиксации;
			
			ДокументФиксации.Заполнить(СтруктураЗаполнения);
			
			Попытка
				ДокументФиксации.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить("Не удалось провести документ " + Строка(ДокументФиксации));
			КонецПопытки;
		КонецЕсли;
	Иначе//Создание корректировки результатов
		
		Для Каждого СтрокаДокумента Из Инвентаризации Цикл
			Если ВсеДокументыПриняты(СтрокаДокумента) Тогда
				//И СтрокаДокумента.СуммаКУдержанию <> 0
				//И СтрокаДокумента.ВидОперации = Перечисления.ИТ_ВидыОперацийПакетаДокументовРезультатовИнвентаризации.Корректировка
				НоваяСтрокаТабПроверки = ТабПроверкиСозданныхДокументов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТабПроверки, СтрокаДокумента);
			КонецЕсли;
		КонецЦикла;

		ИдентификаторыДляКорректировки = ИТ_СпециальныйМодульСервер.ПолучитьДанныеДляКорректировкиРезультатовИнвентаризации(ТабПроверкиСозданныхДокументов, Ссылка);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИдентификаторыСтрок", ИдентификаторыДляКорректировки);
		Запрос.Текст = 
				"ВЫБРАТЬ
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Магазин,
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ДокументИнвентаризация КАК ДокументИнвентаризации,
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Продавец,
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ПриказОбИнвентаризации,
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ТипУдержания,
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.СуммаКУдержанию КАК СуммаКУдержанию,
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.СуммаИнвентаризации,
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ВидОперации,
				|	-ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.СуммаКорректировки КАК Сумма,
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.СуммаКУдержаниюДоКорректировки
				|ИЗ
				|	Документ.ИТ_ПакетДокументовРезультатовИнвентаризации.Инвентаризации КАК ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации
				|ГДЕ
				|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ИдентификаторСтроки В(&ИдентификаторыСтрок)";
		
		РезультатЗапроса = Запрос.Выполнить();                               
		
		ТаблицаДанныхДляКорректировки = РезультатЗапроса.Выгрузить();
		
		Если ТаблицаДанныхДляКорректировки.Количество() > 0 Тогда
			
			ДокументКорректировки = Документы.ИТ_КорректировкаВзаиморасчетовПоИнвентаризациям.СоздатьДокумент();
			
			СтруктураЗаполнения = Новый Структура("ДокументОснование, ТаблицаДанныхДляКорректировки");
			СтруктураЗаполнения.ДокументОснование = Ссылка;
			СтруктураЗаполнения.ТаблицаДанныхДляКорректировки = ТаблицаДанныхДляКорректировки;
			
			ДокументКорректировки.Заполнить(СтруктураЗаполнения);
			
			Попытка
				ДокументКорректировки.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить("Не удалось провести документ " + Строка(ДокументКорректировки));
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция ВсеДокументыПриняты(СтрокаДокумента)
	
	ДатаНачалаФиксацийПоПродавцам = Константы.ИТ_ДатаНачалаСозданияФиксацийПоПродавцам.Получить();
	
	Если Не ЗначениеЗаполнено(ДатаНачалаФиксацийПоПродавцам) Тогда
		ДатаНачалаФиксацийПоПродавцам = '20201202';
	КонецЕсли;
	
	ДатаПринятияДокументов = Макс(
	СтрокаДокумента.ПриказОбИнвентаризации_ДатаПриема,
	СтрокаДокумента.СличительнаяВедомостьИНВ19_ДатаПриема,
	СтрокаДокумента.ИнвентаризационнаяОписьИНВ3_ДатаПриема,
	СтрокаДокумента.ОбъяснительнаяПоНедостаче_ДатаПриема,
	СтрокаДокумента.ЗаявлениеНаУдержание_ДатаПриема,
	СтрокаДокумента.ПриказОбУдержании_ДатаПриема);
	
	Если Не ЗначениеЗаполнено(ДатаПринятияДокументов) Тогда
		ДатаПринятияДокументов = ТекущаяДата();
	КонецЕсли;
	
	Если СтрокаДокумента.ПриказОбИнвентаризации
		И СтрокаДокумента.СличительнаяВедомостьИНВ19
		И СтрокаДокумента.ИнвентаризационнаяОписьИНВ3
		И СтрокаДокумента.ОбъяснительнаяПоНедостаче
		И СтрокаДокумента.ЗаявлениеНаУдержание
		И СтрокаДокумента.ПриказОбУдержании	
		И ДатаПринятияДокументов >= ДатаНачалаФиксацийПоПродавцам Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИТ_ПакетДокументовРезультатовИнвентаризации") Тогда
		//Заполнение корректировочного пакета документов результатов инвентаризации
		
		Если Не ДанныеЗаполнения.Проведен Тогда
			ВызватьИсключение "Нельзя создать корректировочный пакет документов на основании НЕ проведенного пакета документов!";	
		КонецЕсли;
		
		// Заполнение шапки
		НачалоПериода	= ДанныеЗаполнения.НачалоПериода;
		КонецПериода	= ДанныеЗаполнения.КонецПериода;
		Дата			= ТекущаяДата();
		
		КорректируемыйПакетДокументов = ДанныеЗаполнения.Ссылка;
		
		ЛинейныйМенеджер							= ДанныеЗаполнения.ЛинейныйМенеджер;
		Ответственный								= ДанныеЗаполнения.Ответственный;
		ПредседательКомиссии 						= ДанныеЗаполнения.ПредседательКомиссии;
		ЧленКомиссии_ЛинейныйМенеджер				= ДанныеЗаполнения.ЧленКомиссии_ЛинейныйМенеджер;
		ЧленКомиссии_СотрудникСлужбыБезопасности	= ДанныеЗаполнения.ЧленКомиссии_СотрудникСлужбыБезопасности;
		ЧленКомиссии_СтаршийМенеджер				= ДанныеЗаполнения.ЧленКомиссии_СтаршийМенеджер;
		
		Для Каждого ТекСтрокаИнвентаризации Из ДанныеЗаполнения.Инвентаризации Цикл
			
			ТекИнвентаризация = ТекСтрокаИнвентаризации.ДокументИнвентаризация;
			ТекущийРезультатИнвентаризации = ИТ_СпециальныйМодульСервер.ПолучитьРезультатИнвентаризации(ТекИнвентаризация);
			
			//Корректировочный пакет документов оформляем только для тех документов, где расходятся результаты инвентаризаций
			Если ТекущийРезультатИнвентаризации <> ТекСтрокаИнвентаризации.СуммаИнвентаризации
				И ТекСтрокаИнвентаризации.СуммаИнвентаризации <> 0 Тогда
				
				НоваяСтрока = Инвентаризации.Добавить();
				
				Если ЗначениеЗаполнено(КорректируемыйПакетДокументов) Тогда
					НоваяСтрока.ВидОперации = Перечисления.ИТ_ВидыОперацийПакетаДокументовРезультатовИнвентаризации.Корректировка;
				Иначе
					НоваяСтрока.ВидОперации = Перечисления.ИТ_ВидыОперацийПакетаДокументовРезультатовИнвентаризации.ФормированиеПакетаДокументов;
				КонецЕсли;
				
				НоваяСтрока.ДокументИнвентаризация	= ТекИнвентаризация;
				НоваяСтрока.Должность				= ТекСтрокаИнвентаризации.Должность;
				НоваяСтрока.Магазин					= ТекСтрокаИнвентаризации.Магазин;
				НоваяСтрока.Магазин_Адрес			= ТекСтрокаИнвентаризации.Магазин_Адрес;
				НоваяСтрока.Продавец				= ТекСтрокаИнвентаризации.Продавец;
				НоваяСтрока.СуммаИнвентаризации		= ТекущийРезультатИнвентаризации;
				НоваяСтрока.ТипУдержания			= ТекСтрокаИнвентаризации.ТипУдержания;
				НоваяСтрока.ЮрЛицо					= ТекСтрокаИнвентаризации.ЮрЛицо;
				
				НоваяСтрока.СуммаКУдержаниюДоКорректировки = ТекСтрокаИнвентаризации.СуммаКУдержанию;
				
				Если Не ТекСтрокаИнвентаризации.ПринятыВсеДокументы Тогда
					НоваяСтрока.СуммаКорректировки = ТекущийРезультатИнвентаризации;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		Если Инвентаризации.Количество() = 0 Тогда
			ТекстОшибки = "В документе " + Строка(ДанныеЗаполнения) + " не выявлено расхождений результатов инвентаризаций!";
			ВызватьИсключение ТекстОшибки;		
		КонецЕсли;
		
		Документы.ИТ_ПакетДокументовРезультатовИнвентаризации.ПерераспределениеСуммКУдержанию(ЭтотОбъект);
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		СозданныеФиксации = ИТ_СпециальныйМодульСервер.ПолучитьДокументыФиксацииПоПакетуДокументов(Ссылка);
		Если СозданныеФиксации.Количество() > 0 Тогда
			Сообщить("Нельзя отменить проведение пакета документов. На основании него уже созданы фиксации рез-тов по продавцам!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

