// Модуль общей формы "Параметры документа"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ОбновитьДанныеФормы(ПараметрыДействия)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЭтотОбъект.ДокументОбъект,,"Ссылка");
	
	Если ПараметрыДействия.Свойство("ТребуетсяПересчетЦен") Тогда
		ТребуетсяПересчетЦен  = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТребуетсяПересчетЦен", ЛОЖЬ);
	КонецЕсли;
	
	Если ПараметрыДействия.Свойство("ТребуетсяУстановкаЦен") Тогда
		ТребуетсяУстановкаЦен = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТребуетсяУстановкаЦен", ЛОЖЬ);
	КонецЕсли;
	
	Если ПараметрыДействия.Свойство("ТребуетсяУстановкаДатыНачала") Тогда
		ТребуетсяУстановкаДатыНачала = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТребуетсяУстановкаДатыНачала", ЛОЖЬ);
	КонецЕсли;
	
	Если ПараметрыДействия.Свойство("ТребуетсяЗаполнитьНаОсновании") Тогда
		ТребуетсяЗаполнитьНаОсновании = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТребуетсяЗаполнитьНаОсновании", ЛОЖЬ);
	КонецЕсли;
	
КонецПроцедуры // ОбновитьДанныеФормы()

// Обработчик события возникающего при выполнении оповещения.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаОповещенияПриСменеШтрихкода(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
		ШтрихКодНачалоВыбораНаСервере();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияПриСменеШтрихкода()

// Обработчик события возникающего при выполнении оповещения.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаОповещенияПриИзмененииШтрихкода(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
		ШтрихКод = ДополнительныеПараметры.Штрихкод;
		Элементы.ШтрихКод.ОбновитьТекстРедактирования();
	Иначе
		ШтрихКод = "";
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияПриСменеШтрихкода()

// Обработчик события возникающего при выполнении оповещения.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаОповещенияПодразделениеКомпанииПриИзменении(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
		ВалютаДокумента = ДополнительныеПараметры.НоваяВалюта;
		ВалютаДокументаПриИзменении(Элементы.ПодразделениеКомпании);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияПодразделениеКомпанииПриИзменении()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Для Документов заблокируем редактирование Номера
	ЭлементСуществует = НЕ (ЭтотОбъект.Элементы.Найти("Номер") = Неопределено);
	Если ЭлементСуществует И Ссылка <> Неопределено И Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Ссылка.Ссылка)) Тогда
		ЭтотОбъект.Элементы.Номер.Доступность = ПравоПользователя("РазрешитьРедактированиеНомеровДокументов", ЭтотОбъект) = Перечисления.ВариантыОтветов.Да
											ИЛИ ПравоПользователя("РазрешитьРедактированиеНомеровДокументов", ЭтотОбъект) = Перечисления.ВариантыОтветов.Спрашивать;
		Если ПравоПользователя("РазрешитьРедактированиеНомеровДокументов", ЭтотОбъект) = Перечисления.ВариантыОтветов.Да Тогда
			Элементы.Номер.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
		КонецЕсли;
	КонецЕсли;
	
	// Проверим блокировку объекта для редактирования другим пользователем.
	ОбъектЗаблокированДляРедактирования = УправлениеДиалогомСервер.ПроверитьЗапретРедактированияДанных(Параметры.Объект.Ссылка, Параметры.ИдентификаторФормы);
	
	// получаем право на открытие
	РедактированиеФормыРазрешено = ПравоПользователя("ОткрытиеФормыПараметрыДокументаВРежимеРедактирование", Параметры.Объект);
	ТолькоПросмотр = НЕ РедактированиеФормыРазрешено ИЛИ НЕ ПравоДоступа("Изменение",Параметры.Объект.Ссылка.Метаданные()) ИЛИ ОбъектЗаблокированДляРедактирования;
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Определяет, является ли переданная в функцию ссылка документом БСП.
//
// Параметры:
//  ОбъектСсылка  - Ссылка - для которой необходимо выполняется проверка.
//
// Возвращаемое значение:
//   Булево   - истина, если переданная ссылка является взаимодействием.
//
&НаСервере
Функция ЯвляетсяБСПДокументом(ОбъектСсылка) Экспорт
	
	Если ТипЗнч(ОбъектСсылка) = Тип("Тип") Тогда
		ТипОбъекта = ОбъектСсылка;
	Иначе
		ТипОбъекта = ТипЗнч(ОбъектСсылка);
	КонецЕсли;
	
	Возврат ТипОбъекта = Тип("ДокументСсылка.Встреча")
		ИЛИ ТипОбъекта = Тип("ДокументСсылка.ЗапланированноеВзаимодействие")
		ИЛИ ТипОбъекта = Тип("ДокументСсылка.ТелефонныйЗвонок")
		ИЛИ ТипОбъекта = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее")
		ИЛИ ТипОбъекта = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее")
		ИЛИ ТипОбъекта = Тип("ДокументСсылка.СообщениеSMS")
		ИЛИ ТипОбъекта = Тип("ДокументСсылка.Анкета")
		ИЛИ ТипОбъекта = Тип("ДокументСсылка.НазначениеОпросов");
	
КонецФункции //ЯвляетсяБСПДокументом()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события возникающего на клиенте при нажатии кнопки "Применить".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Применить(Команда)
	
	// Производим формирование полной даты документа
	ЭтотОбъект.Дата = НачалоДня(ЭтотОбъект.Дата) + (ЭтотОбъект.Время - НачалоДня(ЭтотОбъект.Время));
	
	// Инициализируем переменные нужные для анализа изменений в форме
	ИзмененныеРеквизиты = Новый Структура;
	
	// Производим анализа изменений внесенных пользователем в форму
	Для Каждого Реквизит Из Элементы Цикл
		Если ТипЗнч(Реквизит)=Тип("ПолеФормы") И Реквизит.Видимость И ЭтотОбъект.КопияОбъекта.Свойство(Реквизит.Имя) И (НЕ ЭтотОбъект[Реквизит.Имя]=ЭтотОбъект.КопияОбъекта[Реквизит.Имя]) Тогда
			ИзмененныеРеквизиты.Вставить(Реквизит.Имя, ЭтотОбъект[Реквизит.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	// Проверим корректность заполнения формы
	Если (НЕ ПроверитьЗаполнение()) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим значение измененных реквизитов документа
	ПараметрыЗакрытия = Новый Структура();
	ПараметрыЗакрытия.Вставить("ИзмененныеРеквизиты",          ИзмененныеРеквизиты);
	ПараметрыЗакрытия.Вставить("ПоказыватьПараметрыДокумента", ЭтотОбъект.ПоказыватьПараметрыДокумента);
	
	Если ТребуетсяУстановкаЦен Тогда
		ПараметрыЗакрытия.Вставить("ТребуетсяУстановкаЦен", ТребуетсяУстановкаЦен);
	КонецЕсли;
	
	Если ТребуетсяПересчетЦен Тогда
		ПараметрыЗакрытия.Вставить("ТребуетсяПересчетЦен", ТребуетсяПересчетЦен);
		ПараметрыЗакрытия.Вставить("СтарыйКурс",           ЭтотОбъект.КопияОбъекта.КурсДокумента);
	КонецЕсли;
	
	Если ТребуетсяУстановкаДатыНачала Тогда
		ПараметрыЗакрытия.Вставить("ТребуетсяУстановкаДатыНачала", ТребуетсяУстановкаДатыНачала);
	КонецЕсли;
	
	// Вернем в форму владельца информацию о новом штрихкоде
	Если ИспользованиеШтрихКодов Тогда
		ПараметрыЗакрытия.Вставить("ШтрихКод", ШтрихКод);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СкидкаНаценка) Тогда
		ПараметрыЗакрытия.Вставить("ТребуетсяУстановкаПустойСкидкиНаценки", Истина);
	КонецЕсли;
	
	// Закрываем форму параметров
	ЭтотОбъект.Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры // Применить()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия)
	
	// Вызываем обработчик изменения данных объекта
	ЭтотОбъект.ДокументОбъект.Дата = Дата;
	Документы[ИмяОбъекта].ДатаПриИзменении(ЭтотОбъект.ДокументОбъект, ПараметрыДействия);
	ОбновитьДанныеФормы(ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ПараметрыДействия = Новый Структура;
	
	Если ИмяОбъекта = "ИзменениеЦен" Тогда
		ДатаПриИзмененииНаСервере(ПараметрыДействия);
	КонецЕсли;
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ПодразделениеКомпании" в контексте сервера.
//
&НаСервере
Процедура ПодразделениеКомпанииПриИзмененииНаСервере(ПараметрыДействия)
	
	// Вызываем обработчик изменения данных объекта
	ЭтотОбъект.ДокументОбъект.ПодразделениеКомпании = ПодразделениеКомпании;
	Документы[ИмяОбъекта].ПодразделениеКомпанииПриИзменении(ЭтотОбъект.ДокументОбъект, ПараметрыДействия);
	ИТ_СпециальныйМодульСервер.ДокументыПриизмененииПодразделения(ЭтотОбъект.ДокументОбъект);
	ОбновитьДанныеФормы(ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ПодразделениеКомпании".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПодразделениеКомпанииПриИзменении(Элемент)
	
	ПараметрыДействия = Новый Структура;
	ПодразделениеКомпанииПриИзмененииНаСервере(ПараметрыДействия);
	Если ПараметрыДействия.Свойство("НоваяВалюта") Тогда
		
		// Формируем описание обработчика перехвата закрытия формы
		ОбработчикВопроса = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияПодразделениеКомпанииПриИзменении", ЭтотОбъект, Новый Структура("НоваяВалюта",ПараметрыДействия.НоваяВалюта));
		
		// Формируем текст вопроса
		ТекстВопроса = НСтр("ru = 'Установить валюту документа равной валюте выбранного подразделения?'");
		
		// Получаем подтверждение операции от пользователя
		ПоказатьВопрос(ОбработчикВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Организация" в контексте сервера.
//
&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере(ПараметрыДействия)
	
	ЭтотОбъект.ДокументОбъект.Организация = Организация;
	Документы[ИмяОбъекта].ОрганизацияПриИзменении(ЭтотОбъект.ДокументОбъект, ПараметрыДействия);
	ОбновитьДанныеФормы(ПараметрыДействия);
	
	Если ПравоПользователя("КонтролироватьСоответствиеОрганизацииПодразделения", ЭтотОбъект.ДокументОбъект) И (НЕ ПодразделениеКомпании.Пустая()) И (ПодразделениеКомпании.Организация <> Организация) Тогда
		// Если при выборе организации подразделение не принадлежит ей сообщение об ошибке
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='"+ПодразделениеКомпании.Наименование 
			+ " " +НСтр("ru = 'не принадлежит'") + " "+Организация.Наименование+"'"),,"ПодразделениеКомпании");
		Элементы.Организация.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	ИначеЕсли (ПодразделениеКомпании.Организация = Организация) Тогда
		Элементы.Организация.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
	КонецЕсли;
	
КонецПроцедуры // ОрганизацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Организация".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПараметрыДействия = Новый Структура;
	ОрганизацияПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Автор" в контексте сервера.
//
&НаСервере
Процедура АвторПриИзмененииНаСервере(ПараметрыДействия)
	
	ЭтотОбъект.ДокументОбъект.Автор = Автор;
	Документы[ИмяОбъекта].АвторПриИзменении(ЭтотОбъект.ДокументОбъект, ПараметрыДействия);
	ОбновитьДанныеФормы(ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Автор".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура АвторПриИзменении(Элемент)
	
	ПараметрыДействия = Новый Структура;
	АвторПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Штрихкод".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ШтрихКодПриИзменении(Элемент)
	
	Отказ = Ложь;
	ШтрихкодированиеКлиент.ПроверкаШтрихкодовПередЗаписью(ЭтотОбъект, Штрихкод, Ссылка, Отказ);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при начале выбора данных реквизита "Штрихкод" в контексте сервера.
//
&НаСервере
Процедура ШтрихКодНачалоВыбораНаСервере()
	
	// Создание нового штрих-кода
	ШтрихКод = ШтрихкодированиеВызовСервера.СформироватьНовыйШтрихкод(ЭтотОбъект.ДокументОбъект);
	
КонецПроцедуры // ШтрихКодНачалоВыбораНаСервере()

// Обработчик события возникающего на клиенте при начале выбора данных реквизита "Штрихкод".
//
&НаКлиенте
Процедура ШтрихКодНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ШтрихКод) Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияПриСменеШтрихкода", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Создать новый штрихкод документа?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ШтрихКодНачалоВыбораНаСервере();
	КонецЕсли;
	
КонецПроцедуры // ШтрихКодНачалоВыбора()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Проект" в контексте сервера.
//
&НаСервере
Процедура ПроектПриИзмененииНаСервере(ПараметрыДействия)
	
	ЭтотОбъект.ДокументОбъект.Проект = Проект;
	Документы[ИмяОбъекта].ПроектПриИзменении(ЭтотОбъект.ДокументОбъект, ПараметрыДействия);
	ОбновитьДанныеФормы(ПараметрыДействия);
	
	ОсновнойПроектДоговора = ?(ЕстьРеквизит(ЭтотОбъект.ДокументОбъект, "ДоговорВзаиморасчетов"), ЭтотОбъект.ДокументОбъект.ДоговорВзаиморасчетов.ОсновнойПроект, Справочники.Проекты.ПустаяСсылка());
	Если ЗначениеЗаполнено(ОсновнойПроектДоговора) И ЗначениеЗаполнено(Проект) И (ОсновнойПроектДоговора <> Проект)
		И ПравоПользователя("КонтролироватьСоответствиеПроектов", ЭтотОбъект.ДокументОбъект) = Перечисления.ВидыКонтроля.Предупреждать Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(" " + НСтр("ru='Проект'") + " """+Проект.Наименование + """ " 
			+ НСтр("ru = 'не принадлежит договору'") + " """+ЭтотОбъект.ДокументОбъект.ДоговорВзаиморасчетов.Наименование+"""",,"Проект");
		
	КонецЕсли;
	
КонецПроцедуры // ПроектПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Проект".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	ПараметрыДействия = Новый Структура;
	
	ПроектПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ПроектПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ТипЦен" в контексте сервера.
//
&НаСервере
Процедура ТипЦенПриИзмененииНаСервере(ПараметрыДействия)
	
	ЭтотОбъект.ДокументОбъект.ТипЦен = ТипЦен;
	Документы[ИмяОбъекта].ТипЦенПриИзменении(ЭтотОбъект.ДокументОбъект, ПараметрыДействия);
	ОбновитьДанныеФормы(ПараметрыДействия);
	
КонецПроцедуры // ТипЦенПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ТипЦен".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	
	ПараметрыДействия = Новый Структура;
	ТипЦенПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ТипЦенПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ВалютаДокумента" в контексте сервера.
//
&НаСервере
Процедура ВалютаДокументаПриИзмененииНаСервере(ПараметрыДействия)
	
	ЭтотОбъект.ДокументОбъект.ВалютаДокумента = ВалютаДокумента;
	Документы[ИмяОбъекта].ВалютаДокументаПриИзменении(ЭтотОбъект.ДокументОбъект, ПараметрыДействия);
	ОбновитьДанныеФормы(ПараметрыДействия);
	
КонецПроцедуры // ВалютаДокументаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ВалютаДокумента".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	ПараметрыДействия = Новый Структура;
	ВалютаДокументаПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ВалютаДокументаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "КурсДокумента" в контексте сервера.
//
&НаСервере
Процедура КурсДокументаПриИзмененииНаСервере(ПараметрыДействия)
	
	ЭтотОбъект.ДокументОбъект.КурсДокумента = КурсДокумента;
	Документы[ИмяОбъекта].КурсДокументаПриИзменении(ЭтотОбъект.ДокументОбъект, ПараметрыДействия);
	ОбновитьДанныеФормы(ПараметрыДействия);
	
КонецПроцедуры // КурсДокументаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "КурсДокумента".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура КурсДокументаПриИзменении(Элемент)
	
	ПараметрыДействия = Новый Структура;
	КурсДокументаПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // КурсДокументаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Документ основание" в контексте сервера.
//
&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере(ПараметрыДействия)
	
	ЭтотОбъект.ДокументОбъект.ДокументОснование = ДокументОснование;
	Документы[ИмяОбъекта].ДокументОснованиеПриИзменении(ЭтотОбъект.ДокументОбъект, ПараметрыДействия);
	ОбновитьДанныеФормы(ПараметрыДействия);
	
КонецПроцедуры // ДокументОснованиеПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ПараметрыДействия = Новый Структура;
	ДокументОснованиеПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ДокументОснованиеПриИзменении()

// Обработчик события возникающего на клиенте при начале выбора данных реквизита "Время".
//
&НаСервере
Процедура ВремяОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	// Получим возможный варианты изменения времени
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	Документ.Дата
				   |ИЗ
				   |	Документ."+ИмяОбъекта+" КАК Документ
				   |ГДЕ
				   |	НЕ Документ.Ссылка = &Ссылка
				   |	И Документ.Дата МЕЖДУ &НаДатуНачалоДня И &НаДатуКонецДня";
	Запрос.УстановитьПараметр("НаДатуНачалоДня",НачалоДня(?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДатаСеанса())));
	Запрос.УстановитьПараметр("НаДатуКонецДня",КонецДня(?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДатаСеанса())));
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ТаблицаВремени = Запрос.Выполнить().Выгрузить();
	
	Если ВыбранноеЗначение = "НачалоДня" И ТаблицаВремени.Количество()>0 Тогда
		
		ВыбранноеЗначение = ТаблицаВремени[0].Дата-1;
		
	ИначеЕсли ВыбранноеЗначение = "КонецДня" И ТаблицаВремени.Количество()>0 Тогда
		
		ВыбранноеЗначение = ТаблицаВремени[ТаблицаВремени.Количество()-1].Дата+1;
		
	Иначе
		
		// Определим время следующего и предыдущего документов
		ВремяСледующего = Дата;
		ВремяПрошлого = Дата;
		Для Каждого СтрокаВремени Из ТаблицаВремени Цикл
			Если СтрокаВремени.Дата > ВремяСледующего Тогда
				ВремяСледующего = СтрокаВремени.Дата;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаВремени Из ТаблицаВремени Цикл
			Если СтрокаВремени.Дата < Дата Тогда
				ВремяПрошлого = СтрокаВремени.Дата;
			КонецЕсли;
		КонецЦикла;
		
		Если ВыбранноеЗначение = "ПередПредыдущим" И ВремяПрошлого <> Дата Тогда
			ВыбранноеЗначение = ВремяПрошлого-1;
		ИначеЕсли ВыбранноеЗначение = "ЗаСледующим" И ВремяСледующего <> Дата Тогда
			ВыбранноеЗначение = ВремяСледующего+1;
		Иначе
			ВыбранноеЗначение = Время;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //ВремяОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при начале выбора данных реквизита "Время".
//
&НаКлиенте
Процедура ВремяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// Установим дату в зависимости от выбранного значения
	Если ВыбранноеЗначение = "ТекущееВремя" Тогда
		
		ВыбранноеЗначение = ОбщегоНазначенияКлиент.ДатаСеанса();
		
	ИначеЕсли ВыбранноеЗначение = "ДатаСоздания" Тогда
		
		ВыбранноеЗначение = ДатаСоздания;
		
	ИначеЕсли ВыбранноеЗначение = "ДатаОперации" Тогда
		
		ВыбранноеЗначение = ДатаОперации;
		
	Иначе
		
		// Обработаем в контексте сервера
		ВремяОбработкаВыбораНаСервере(ВыбранноеЗначение);
		
	КонецЕсли;
	
	ПолученноеВремя = ВыбранноеЗначение - НачалоДня(ВыбранноеЗначение);
	Дата = НачалоДня(Дата)+ПолученноеВремя;
	
КонецПроцедуры //ВремяОбработкаВыбора()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Производим чтение основных входных параметров
	ВладелецОбъект               = Параметры.Объект;
	МетаданныеОбъекта            = Параметры.Объект.Ссылка.Метаданные();
	ИмяОбъекта                   = МетаданныеОбъекта.Имя;
	Операция                     = Параметры.Операция;
	ПоказыватьПараметрыДокумента = Параметры.ПоказыватьПараметрыДокумента;
	
	// Восстановим параметры отображения диалога для текущей операции
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Операция;
	
	// Произведем добавление реквизита формы описывающего объект подобный владельцу
	ДобавляемыеРеквизиты = Новый Массив();
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДокументОбъект", Новый ОписаниеТипов("ДокументОбъект."+ИмяОбъекта)));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("КопияОбъекта",   Новый ОписаниеТипов("ДокументОбъект."+ИмяОбъекта)));
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ИсходныйОбъект = ДанныеФормыВЗначение(ВладелецОбъект, Тип("ДокументОбъект."+ИмяОбъекта));
	ЗначениеВРеквизитФормы(ИсходныйОбъект, "ДокументОбъект");
	ЗначениеВРеквизитФормы(ИсходныйОбъект, "КопияОбъекта");
	
	// Получим обязательные реквизиты
	Если НЕ ЯвляетсяБСПДокументом(Параметры.Объект.Ссылка) Тогда
		ОбязательныеРеквизиты = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Параметры.Объект.Ссылка).ПолучитьОбязательныеРеквизиты(Параметры.Объект);
		Для каждого ЭлементФормы Из Элементы Цикл
			Если ТипЗнч(ЭлементФормы)=Тип("ПолеФормы") И (ЭлементФормы.Вид=ВидПоляФормы.ПолеВвода) Тогда
				
				// Автоотметка незаполненного возможна только для полей ввода
				Если ОбязательныеРеквизиты.Найти(ЭлементФормы.Имя)<>Неопределено Тогда
					РеквизитОбязательный=Истина;
				Иначе
					РеквизитОбязательный=Ложь;
				КонецЕсли;
				
				ЭлементФормы.ОтметкаНезаполненного=РеквизитОбязательный;
				ЭлементФормы.АвтоОтметкаНезаполненного=РеквизитОбязательный;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Заполним владельца карточки
	Если ЕстьРеквизит(ВладелецОбъект, "Контрагент") Тогда
		ВладелецКарты = ВладелецОбъект.Контрагент;
	КонецЕсли;
	
	// Производим заполнение данных формы на основании переданного объекта
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВладелецОбъект);
	
	// Устанавливаем видимость элементов управления формы в зависимости от наличия аналогичных в исходном объекте.
	Элементы.ДокументОснование       .Видимость = ЕстьРеквизит(ВладелецОбъект, "ДокументОснование");
	Элементы.Проект                  .Видимость = ЕстьРеквизит(ВладелецОбъект, "Проект");
	Элементы.Менеджер                .Видимость = ЕстьРеквизит(ВладелецОбъект, "Менеджер");
	Элементы.ТипЦен                  .Видимость = ЕстьРеквизит(ВладелецОбъект, "ТипЦен");
	Элементы.ВалютаУпрУчета          .Видимость = ЕстьРеквизит(ВладелецОбъект, "КурсВалютыУпр");
	Элементы.КурсВалютыУпр           .Видимость = ЕстьРеквизит(ВладелецОбъект, "КурсВалютыУпр");
	Элементы.ВалютаВзаиморасчетов    .Видимость = ЕстьРеквизит(ВладелецОбъект, "КурсВалютыВзаиморасчетов");
	Элементы.КурсВалютыВзаиморасчетов.Видимость = ЕстьРеквизит(ВладелецОбъект, "КурсВалютыВзаиморасчетов");
	Элементы.Карточка                .Видимость = ЕстьРеквизит(ВладелецОбъект, "Карточка");
	Элементы.РегламентированныйУчет  .Видимость = ЕстьРеквизит(ВладелецОбъект, "РегламентированныйУчет");
	Элементы.НадписьРегламентированныйУчет.Видимость = ЕстьРеквизит(ВладелецОбъект, "РегламентированныйУчет");
	Элементы.СкидкаНаценка           .Видимость = ЕстьРеквизит(ВладелецОбъект, "СкидкаНаценка");
	Элементы.ВалютаДокумента         .Видимость = ЕстьРеквизит(ВладелецОбъект, "ВалютаДокумента");
	Элементы.КурсДокумента           .Видимость = ЕстьРеквизит(ВладелецОбъект, "КурсДокумента");
	Элементы.БлокироватьПерерасчетСкидок    .Видимость = ЕстьРеквизит(ВладелецОбъект, "БлокироватьПерерасчетСкидок");
	Элементы.ДатаСоздания            .Видимость = ЕстьРеквизит(ВладелецОбъект, "ДатаСоздания");
	Элементы.ДатаОперации            .Видимость = ЕстьРеквизит(ВладелецОбъект, "ДатаОперации");
	Элементы.Автор                   .Видимость = ЕстьРеквизит(ВладелецОбъект, "Автор");
	
	Элементы.ПодписантОтОрганизации  .Видимость = ЕстьРеквизит(ВладелецОбъект, "ПодписантОтОрганизации");
	Элементы.ПодписантОтКонтрагента  .Видимость = ЕстьРеквизит(ВладелецОбъект, "ПодписантОтКонтрагента");
	
	Элементы.ПоказыватьПараметрыДокумента.Видимость = НЕ ЯвляетсяБСПДокументом(Параметры.Объект.Ссылка);
	
	// Для ряда документов (План поступления ДС, Обслуживание актива,Ввод остатков товаров) реквизит Договор не обязателен
	// для заполнения. Как следствие, в таких случаях ненужный и не заполненный реквизит КурсВалютыВзаиморасчетов вызывает ошибку.
	// Уберем для заполнения эти реквизиты в случаях не заполненности Договора.
	Элементы.ВалютаВзаиморасчетов    .Видимость = Элементы.ВалютаВзаиморасчетов.Видимость И ЗначениеЗаполнено(ВладелецОбъект.ДоговорВзаиморасчетов);
	Элементы.КурсВалютыВзаиморасчетов.Видимость = Элементы.ВалютаВзаиморасчетов.Видимость;
	
	// Рассчитаем отдельно некоторые параметры операции
	ЭтотОбъект.Заголовок = "Параметры: " + Операция;
	Время = '00010101'+(ВладелецОбъект.Дата - НачалоДня(ВладелецОбъект.Дата));
	
	Если Элементы.ДокументОснование.Видимость Тогда
		Элементы.ДокументОснование.ОграничениеТипа = МетаданныеОбъекта.Реквизиты.ДокументОснование.Тип;
	КонецЕсли;
	Если НЕ Элементы.ТипЦен.Видимость Тогда
		Элементы.Переместить(Элементы.ВалютаКурсВзаиморасчетов, Элементы.ЦеныВалютаЛево);
		Элементы.ЦеныВалюта.Заголовок = НСтр("ru = 'Валюта и курс'");
	КонецЕсли;
	Если Элементы.ВалютаУпрУчета.Видимость Тогда
		ВалютаУпрУчета = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	КонецЕсли;
	Если Элементы.ВалютаВзаиморасчетов.Видимость И ЕстьРеквизит(ВладелецОбъект, "ДоговорВзаиморасчетов") Тогда
		ВалютаВзаиморасчетов = ВладелецОбъект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
	КонецЕсли;
	
	// Установим свойство "ТолькоПросмотр" для реквизитов в зависимости от установленных прав.
	ЗапретитьРедактированиеВалютыДокумента = ПолучитьЗначениеПараметраСтруктуры(Параметры.ДопПараметры, "ЗапретитьРедактированиеВалютыДокумента", Ложь);
	Элементы.Карточка       .ТолькоПросмотр = НЕ(ПравоПользователя("РазрешитьРучнойВыборКарточки",      ЭтотОбъект.ДокументОбъект));
	Элементы.ВалютаДокумента.ТолькоПросмотр = НЕ(ПравоПользователя("РазрешитьИзменениеВалютыДокумента", ЭтотОбъект.ДокументОбъект)) ИЛИ ЗапретитьРедактированиеВалютыДокумента;
	Элементы.КурсДокумента  .ТолькоПросмотр = НЕ(ПравоПользователя("РазрешитьИзменениеКурсаДокумента",  ЭтотОбъект.ДокументОбъект)) ИЛИ ЗапретитьРедактированиеВалютыДокумента;
	Элементы.ВалютаУпрУчета .ТолькоПросмотр = НЕ(Элементы.ВалютаУпрУчета.Видимость И ПравоПользователя("РедактированиеКурсаУправленческойВалютыВДокументах", ЭтотОбъект.ДокументОбъект)) ИЛИ ЗапретитьРедактированиеВалютыДокумента;
	Элементы.КурсВалютыУпр  .ТолькоПросмотр = Элементы.ВалютаУпрУчета.ТолькоПросмотр;
	
	// Установим доступность поля Скидки в зависимости от того, разрешены ли пользователю ручные скидки.
	Если Элементы.СкидкаНаценка.Видимость Тогда
		СпособВыбораСкидки = ПравоПользователя("СпособВыбораСкидки", ЭтотОбъект.ДокументОбъект);
		Элементы.СкидкаНаценка.ТолькоПросмотр = НЕ(СпособВыбораСкидки=Перечисления.СкидкиСпособыВыбора.РучныеСкидки ИЛИ СпособВыбораСкидки=Перечисления.СкидкиСпособыВыбора.АвтоматическиеИРучныеСкидки ИЛИ СпособВыбораСкидки=Перечисления.СкидкиСпособыВыбора.РучныеСкидкиИРедактированиеПроцентов);
	КонецЕсли;
	
	// Инициализируем меню управления временем текущего документа
	СписокВыбораВремени = Элементы.Время.СписокВыбора;
	СписокВыбораВремени.Добавить("ПередПредыдущим", НСтр("ru = 'Перед предыдущим документом'"));
	СписокВыбораВремени.Добавить("ЗаСледующим",     НСтр("ru = 'За следующим документом'"));
	СписокВыбораВремени.Добавить("НачалоДня",       НСтр("ru = 'Перед первым документом'"));
	СписокВыбораВремени.Добавить("КонецДня",        НСтр("ru = 'За последним документом'"));
	СписокВыбораВремени.Добавить("ТекущееВремя",    НСтр("ru = 'Текущее время'"));
	СписокВыбораВремени.Добавить("ДатаСоздания",    НСтр("ru = 'Дата создания:'") + " " + ДатаСоздания);
	СписокВыбораВремени.Добавить("ДатаОперации",    НСтр("ru = 'Дата операции:'") + " " + ДатаОперации);
	
	// Проверим возможность штрихкодирования документа
	ИспользованиеШтрихКодов = ШтрихкодированиеВызовСервера.ИспользоватьШтрихкодирование(Ссылка);
	Если ИспользованиеШтрихКодов И Параметры.Свойство("Штрихкод") Тогда
		ШтрихКод = Параметры.Штрихкод;
	КонецЕсли;
	Элементы.ШтрихКод.ТолькоПросмотр = (НЕ ИспользованиеШтрихКодов);
	
	// Отбор для документа основание
	Если ЕстьРеквизит(ВладелецОбъект, "ДокументОснование") И Не ЭтотОбъект.Элементы.Найти("ДокументОснование")=Неопределено Тогда
		
		// параметры выбора по объекту
		Для Каждого ТекПараметрВыбора Из МетаданныеОбъекта.Реквизиты.ДокументОснование.ПараметрыВыбора Цикл
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(ЭтотОбъект.Элементы.ДокументОснование.ПараметрыВыбора, ТекПараметрВыбора.Имя, ТекПараметрВыбора.Значение);
		КонецЦикла;
		
		// параметры выбора по форме
		ПараметрыВыбора = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ПараметрыВыбораДокументаОснование", Неопределено);
		Если ПараметрыВыбора <> Неопределено Тогда
			Для Каждого ПараметрВыбора Из ПараметрыВыбора Цикл
				УправлениеДиалогомСервер.ОбновитьПараметрВыбора(ЭтотОбъект.Элементы.ДокументОснование.ПараметрыВыбора, ПараметрВыбора.Имя, ПараметрВыбора.Значение);
			КонецЦикла;
		КонецЕсли;
		
		// ограничение типа на форме
		ОграничениеТипа = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ОграничениеТипаДокументаОснование", Неопределено);
		Если ЗначениеЗаполнено(ОграничениеТипа) Тогда
			Элементы.ДокументОснование.ОграничениеТипа = ОграничениеТипа;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЭтотОбъект.Элементы.Найти("ТипЦен")=Неопределено Тогда
		
		// Отбор для типа цен
		Если Справочники.ХозОперации.СоответствуетВидуОперации(ХозОперация, Перечисления.ВидыОперацийДоговора.Покупка) Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(ЭтотОбъект.Элементы.ТипЦен.ПараметрыВыбора, "Отбор.Закупка", Истина);
		ИначеЕсли Справочники.ХозОперации.СоответствуетВидуОперации(ХозОперация, Перечисления.ВидыОперацийДоговора.Продажа) Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(ЭтотОбъект.Элементы.ТипЦен.ПараметрыВыбора, "Отбор.Продажа", Истина);
		КонецЕсли;
		
		// Отбор для выбора типа цен по применению
		Если ЕстьРеквизит(ВладелецОбъект, "ТипЦен") Тогда
			
			Для Каждого ТекОтбор Из МетаданныеОбъекта.Реквизиты.ТипЦен.ПараметрыВыбора Цикл
				Если ТекОтбор.Имя = "Отбор.Рассчитывается" Тогда
					УправлениеДиалогомСервер.ОбновитьПараметрВыбора(ЭтотОбъект.Элементы.ТипЦен.ПараметрыВыбора, "Отбор.Рассчитывается", ТекОтбор.Значение);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

	// устанавливаем отбор по организации или подразделению
	Если ЕстьРеквизит(ВладелецОбъект, "ПодписантОтОрганизации") И Не ЭтотОбъект.Элементы.Найти("ПодписантОтОрганизации")=Неопределено Тогда
		Если ЗначениеЗаполнено(Организация) Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.ПодписантОтОрганизации.ПараметрыВыбора, "Отбор.Организация", Организация);
		ИначеЕсли ЗначениеЗаполнено(ПодразделениеКомпании) Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.ПодписантОтОрганизации.ПараметрыВыбора, "Отбор.ПодразделениеКомпании", ПодразделениеКомпании);
		КонецЕсли;
	КонецЕсли;
	
	// устанавливаем отбор по контрагенту
	Если ЕстьРеквизит(ВладелецОбъект, "ПодписантОтКонтрагента") И Не ЭтотОбъект.Элементы.Найти("ПодписантОтКонтрагента")=Неопределено Тогда
		Если ЗначениеЗаполнено(Контрагент) Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.ПодписантОтКонтрагента.ПараметрыВыбора, "Отбор.Контрагент", Контрагент);
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.Проект.Видимость Тогда
		Элементы.Проект.Доступность = (НЕ ПравоПользователя("КонтролироватьСоответствиеПроектов", ЭтотОбъект.ДокументОбъект)=Перечисления.ВидыКонтроля.Запрещать);
	КонецЕсли;
	
	//Мальцев А.Ю. +++
	Если ИмяОбъекта = "ЗаказПоставщику" Тогда
		ПравоИзмененияДаты = ПравоПользователя("итРазрешитьИзменениеДатыЗаказаПоставщика");
		Если ПравоИзмененияДаты = Ложь Тогда
			Элементы.Дата.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	//Мальцев А.Ю. ---
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// установим видимость реквизитов по владельцу формы
	Если Элементы.КурсВалютыВзаиморасчетов.Видимость И Элементы.ВалютаВзаиморасчетов.Видимость Тогда
		Элементы.КурсВалютыВзаиморасчетов.Видимость = ((НЕ ВладелецФормы.Элементы.Найти("ДоговорВзаиморасчетов")=Неопределено) И ВладелецФормы.Элементы.ДоговорВзаиморасчетов.Видимость);
		Элементы.ВалютаВзаиморасчетов.Видимость     = Элементы.КурсВалютыВзаиморасчетов.Видимость;
	КонецЕсли;
	
	Если (НЕ ЭтотОбъект.ТолькоПросмотр) И (НЕ ВладелецФормы.Элементы.Найти("ПараметрыДокумента")=Неопределено) Тогда
		ЭтотОбъект.ТолькоПросмотр = ВладелецФормы.Элементы.ПараметрыДокумента.ТолькоПросмотр;
	КонецЕсли;	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия)
	
	// обработка события считывания штрихкода
	Если ПараметрыДействия.Свойство("ШтрихКод")	Тогда
		
		// проверка использования штрихкодирования
		ИспользованиеШтрихкодирования = НЕ Элементы.ШтрихКод.ТолькоПросмотр;
		
		Если ИспользованиеШтрихкодирования Тогда
			
			// Подставим считанный штрихкод
			Штрихкод = ПараметрыДействия.ШтрихКод;
			ВывестиСообщение(ШтрихкодированиеВызовСервера.СформироватьСообщениеШтрихкодУстановлен(Штрихкод,Ссылка));
			
		КонецЕсли;
		
		// удаление параметра для отмены общего обработчика события
		ПараметрыДействия.Удалить("ШтрихКод");
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера, проверяем есть ли доп. реквизиты в форме.
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Получим и установим перечень обязательный к заполнению реквизитов
	Если НЕ ЯвляетсяБСПДокументом(Ссылка) Тогда
		ОбязательныеРеквизиты = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка).
		ПолучитьОбязательныеРеквизиты(ЭтотОбъект["ДокументОбъект"]);
		Для каждого ОбязательныйРеквизит Из ОбязательныеРеквизиты Цикл
			Если ПроверяемыеРеквизиты.Найти(ОбязательныйРеквизит)= Неопределено Тогда
				ПроверяемыеРеквизиты.Добавить(ОбязательныйРеквизит);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Удалим невидимые реквизиты из массива проверяемых реквизитов
	Если НЕ Элементы.Автор.Видимость Тогда
		
		ИндексЭлемента = ПроверяемыеРеквизиты.Найти("Автор");
		
		Если НЕ  ИндексЭлемента=Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);
		КонецЕсли;
		
	КонецЕсли;

	Если НЕ Элементы.ВалютаДокумента.Видимость Тогда
		
		ИндексЭлемента = ПроверяемыеРеквизиты.Найти("ВалютаДокумента");
		
		Если НЕ ИндексЭлемента=Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Элементы.Дата.Видимость Тогда
		
		ИндексЭлемента = ПроверяемыеРеквизиты.Найти("Дата");
		
		Если НЕ ИндексЭлемента=Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Элементы.КурсВалютыВзаиморасчетов.Видимость Тогда
		
		ИндексЭлемента = ПроверяемыеРеквизиты.Найти("КурсВалютыВзаиморасчетов");
		
		Если НЕ ИндексЭлемента=Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);
		КонецЕсли;
		
	КонецЕсли;

	Если НЕ Элементы.КурсВалютыУпр.Видимость Тогда
		
		ИндексЭлемента = ПроверяемыеРеквизиты.Найти("КурсВалютыУпр");
		
		Если НЕ ИндексЭлемента=Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);
		КонецЕсли;
		
	КонецЕсли;

	Если НЕ Элементы.КурсДокумента.Видимость Тогда
		
		ИндексЭлемента = ПроверяемыеРеквизиты.Найти("КурсДокумента");
		
		Если НЕ ИндексЭлемента=Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);
		КонецЕсли;
		
	КонецЕсли;

	Если НЕ Элементы.Организация.Видимость Тогда
		
		ИндексЭлемента = ПроверяемыеРеквизиты.Найти("Организация");
		
		Если НЕ ИндексЭлемента=Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);
		КонецЕсли;
		
	КонецЕсли;

	Если НЕ Элементы.ПодразделениеКомпании.Видимость Тогда
		
		ИндексЭлемента = ПроверяемыеРеквизиты.Найти("ПодразделениеКомпании");
		
		Если НЕ ИндексЭлемента=Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);
		КонецЕсли;
		
	КонецЕсли;

	Если НЕ Элементы.ТипЦен.Видимость Тогда
		
		ИндексЭлемента = ПроверяемыеРеквизиты.Найти("ТипЦен");
		
		Если НЕ ИндексЭлемента=Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()


///////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

