
&НаКлиенте
// Функция проверяет отправлено ли сообщение по его состоянию
//
// Параметры:
//	Состояние	- ПеречислениеСсылка	- Состояние сообщения
//
// Возвращаемое значение:
//	Булево	- Признак отправки сообщения
//
Функция смсСообщениеОтправлено(Состояние)
	Если Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументаСообщениеSMS.Черновик") Тогда
		Возврат Ложь;
	ИначеЕсли Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументаСообщениеSMS.Исходящее") Тогда
		Возврат Ложь;
	ИначеЕсли Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументаСообщениеSMS.ПустаяСсылка") Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
КонецФункции // смсСообщениеОтправлено()	

&НаКлиенте
// Процедура - обработчик команды
//
// Параметры:
//	ПараметрКоманды				- ДокументСсылка	- Сообщение СМС
//	ПараметрыВыполненияКоманды	- Структура			- Структура параметров команды
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если смсСообщениеОтправлено(ПараметрыВыполненияКоманды.Источник.Объект.Состояние) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Команда недоступна (сообщение уже отправлено)'"));
		Возврат;
	КонецЕсли;
	Адресаты	= ПараметрыВыполненияКоманды.Источник.Объект.Адресаты;
	ЕстьОшибки	= Ложь;
	Для Каждого СтрокаТЧ Из Адресаты Цикл
		ПроверяемыйНомер	= СтрокаТЧ.КакСвязаться;
		ДлинаНомера			= СтрДлина(ПроверяемыйНомер);
		Если ДлинаНомера = 0 Тогда
			ЕстьОшибки	= Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Отсутствует номер телефона в строке: '") 
				+ Формат(СтрокаТЧ.НомерСтроки, "ЧН=0; ЧГ=0"), , "Объект.Адресаты["
				+ Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].КакСвязаться");
		ИначеЕсли СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПроверяемыйНомер, ";", Истина).Количество() > 1 Тогда
			ЕстьОшибки	= Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Указан более чем один номер телефона в строке: '")
				+ Формат(СтрокаТЧ.НомерСтроки, "ЧН=0; ЧГ=0"), , "Объект.Адресаты["
				+ Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].КакСвязаться");
		Иначе		
			СтруктураПолей = ВзаимодействияКлиентСервер.СтруктураПолейПоПредставлениюТелефона(ПроверяемыйНомер);
			Если НЕ ВзаимодействияКлиентСервер.КорректноВведенНомерТелефона(СтруктураПолей) Тогда
				ЕстьОшибки	= Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Некорректный номер телефона в строке: '") 
					+ Формат(СтрокаТЧ.НомерСтроки, "ЧН=0; ЧГ=0"), , "Объект.Адресаты["
					+ Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].КакСвязаться");
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	Если НЕ ЕстьОшибки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Проверка выполнена успешно'")); 
	КонецЕсли;	
КонецПроцедуры // ОбработкаКоманды()
