// Модуль менеджера документа "Выписка"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура УстановитьСтавкуНДС(Объект)
	
	Если ОсвобожденОтУплатыНДС(Объект.Организация, Объект.ПодразделениеКомпании, Объект.Дата) Тогда
		НоваяСтавкаНДС = Справочники.СтавкиНДС.БезНДС;
	Иначе
		НоваяСтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Объект.Состав Цикл
		Если СтрокаТЧ.СуммаРасход<>0 И СтрокаТЧ.СтавкаНДС<>НоваяСтавкаНДС Тогда
			СтрокаТЧ.СтавкаНДС = НоваяСтавкаНДС;
			СоставСтавкаНДСПриИзменении(Объект, СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	ИтогиОперации.Вставить("СуммаДокумента", Объект.Состав.Итог("СуммаПриход")-Объект.Состав.Итог("СуммаРасход"));
	
	// Производим установку полученных значений в итоговые показатели объекта
	Если НЕ Расширенные Тогда
		Возврат ИтогиОперации;
	КонецЕсли;
	
	// Формируем перечень расширенной информации об итогах операции
	ИтогиОперации.Вставить("СуммаПриход",    Объект.Состав.Итог("СуммаПриход"));
	ИтогиОперации.Вставить("СуммаРасход",    Объект.Состав.Итог("СуммаРасход"));
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

// Установка банковского счета в соответствии с организацией
//
Процедура УстановитьБанковскийСчет(Объект, ПараметрыДействия)
	
	Если Объект.БанковскийСчет.Пустая() Тогда
		Объект.БанковскийСчет = Объект.Организация.ОсновнойБанковскийСчет;
	Иначе
		Результат = ОбработкаСобытийДокументаСервер.ПроверитьКорректностьБанковскогоСчета(Объект.БанковскийСчет,
													Объект.Организация, Объект.ПодразделениеКомпании);
		Если НЕ Результат Тогда
			Объект.БанковскийСчет = Объект.Организация.ОсновнойБанковскийСчет;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // УстановитьБанковскийСчет()

Процедура ЗаполнитьПлатежноеПоручениеОснование(Объект) Экспорт
	
	Если Объект.ХозОперация = Справочники.ХозОперации.СтрокаБанковскойВыписки Тогда
		Для Каждого Строка Из Объект.Состав Цикл
			Строка.ПлатежноеПоручениеОснование = Объект.ПлатежноеПоручениеОснование;
		КонецЦикла;
	Иначе
		Объект.ПлатежноеПоручениеОснование = Неопределено;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("БанковскийСчет");
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	ОбязательныеРеквизиты.Добавить("ВалютаДокумента");
	ОбязательныеРеквизиты.Добавить("КурсДокумента");
	
	Если Объект.ХозОперация=Справочники.ХозОперации.СтрокаБанковскойВыписки
		ИЛИ Объект.ХозОперация = Справочники.ХозОперации.ПоступлениеВОперационнуюКассу
		ИЛИ Объект.ХозОперация = Справочники.ХозОперации.РасходИзОперационнойКассы Тогда
		
		ОбязательныеРеквизиты.Добавить("СтавкаНДС");
		ОбязательныеРеквизиты.Добавить("СтатьяДДС");
		ОбязательныеРеквизиты.Добавить("Контрагент");
		ОбязательныеРеквизиты.Добавить("ДоговорВзаиморасчетов");
		
	Иначе
		
		ОбязательныеРеквизиты.Добавить("Состав.СтатьяДДС");
		ОбязательныеРеквизиты.Добавить("Состав.Контрагент");
		ОбязательныеРеквизиты.Добавить("Состав.ДоговорВзаиморасчетов");
		
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Уникальные поля таблицы товаров
	УникальныеСостав = Новый Структура();
	
	// Обязательные реквизиты документа
	УникальныеТабличныеЧасти = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеТабличныеЧасти;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();
	КонтролируемыеРеквизиты.Вставить("БанковскийСчет");
	КонтролируемыеРеквизиты.Вставить("ДоговорВзаиморасчетов",КонтрольПоПодразделению);
	
	КонтролируемыеРеквизитыТЧ = Новый Структура();
	КонтролируемыеРеквизитыТЧ.Вставить("ДоговорВзаиморасчетов", КонтрольПоПодразделению);
	КонтролируемыеРеквизитыТЧ.Вставить("Сделка", КонтрольПоПодразделению);
	
	КонтролируемыеРеквизиты.Вставить("Состав", КонтролируемыеРеквизитыТЧ);
	
	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", Объект.Состав.Количество() > 0);
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
	// проверим ставку для организации и подразделения
	УстановитьСтавкуНДС(Объект);
	
	// Установим банковский счет
	УстановитьБанковскийСчет(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
	// проверим ставку для организации и подразделения
	УстановитьСтавкуНДС(Объект);
	
	// Установим банковский счет
	УстановитьБанковскийСчет(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Проект".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПроектПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПроектПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПроектПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ЗаполнитьПлатежноеПоручениеОснование(Объект);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Валюта".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВалютаДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ВалютаДокументаПриИзменении(Объект, ПараметрыДействия);
	
	// пересчитаем курс взаиморасчетов в ТЧ Состав
	Для Каждого Строка Из Объект.Состав Цикл
		Если ЗначениеЗаполнено(Строка.ДоговорВзаиморасчетов) Тогда
			Если Строка.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов = Объект.ВалютаДокумента Тогда
				Строка.КурсВалютыВзаиморасчетов = Объект.КурсДокумента;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ВалютаДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Курс документа".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КурсДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.КурсДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // КурсДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Статья ДДС".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СтатьяДДСПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если Объект.СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Приход Тогда
		Если Объект.СуммаДокументаРасход <> 0 Тогда
			Объект.СуммаДокументаРасход = 0;
			ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
			ПараметрыДействия.Вставить("ИзменениеНаправленияПлатежа",Истина);
			СуммаДокументаРасходПриИзменении(Объект, ПараметрыДействия);
		КонецЕсли;
	ИначеЕсли Объект.СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Расход Тогда
		Если Объект.СуммаДокументаПриход <> 0 Тогда
			Объект.СуммаДокументаПриход = 0;
			ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
			ПараметрыДействия.Вставить("ИзменениеНаправленияПлатежа",Истина);
			СуммаДокументаПриходПриИзменении(Объект, ПараметрыДействия);
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.СтатьяДДС = Справочники.СтатьиДДС.ОплатаБанковскихУслуг Тогда
		Объект.СуммаУслуг = 0;
	КонецЕсли;
	
	// Пройдемся по документу и сменим строку
	Для Каждого Строка Из Объект.Состав Цикл
		Если Строка.СтатьяДДС <> Объект.СтатьяДДС Тогда
			Строка.СтатьяДДС = Объект.СтатьяДДС;
			СоставСтатьяДДСПриИзменении(Объект, Строка, ПараметрыДействия);
			СуммаДокументаПриходПриИзменении(Объект, ПараметрыДействия);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Статья ДДС".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СуммаДокументаРасходПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	СтавкаНДСПриИзменении(Объект, ПараметрыДействия);
	
	// Заполним итоговую сумму
	ИтогиОперации = РассчитатьИтогиОперации(Объект);
	ЗаполнитьЗначенияСвойств(Объект, ИтогиОперации);

КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Статья ДДС".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СуммаДокументаПриходПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	СтавкаНДСПриИзменении(Объект, ПараметрыДействия);
	
	// Заполним итоговую сумму
	ИтогиОперации = РассчитатьИтогиОперации(Объект);
	ЗаполнитьЗначенияСвойств(Объект, ИтогиОперации);

КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Сумма услуг".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СуммаУслугПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	СуммаПлатежа = Объект.СуммаДокументаПриход + Объект.СуммаДокументаРасход;
	Если СуммаПлатежа < Объект.СуммаУслуг Тогда
		Объект.СуммаУслуг = СуммаПлатежа;
		ВывестиСообщение(НСтр("ru = 'Сумма прихода/расхода не может быть меньше суммы комиссии банка.'"));
	КонецЕсли;
	
КонецПроцедуры // СуммаУслугПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Статья ДДС".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КонтрагентПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// установим параметр вид договора
	Если Объект.СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Приход Тогда
		ПараметрыДействия.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Продажа);
	ИначеЕсли Объект.СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Расход Тогда
		ПараметрыДействия.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Покупка);
	Иначе
		ПараметрыДействия.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Продажа);
	КонецЕсли;
	
	ОбработкаРеквизитовДокументаСервер.КонтрагентПриИзменении(Объект, ПараметрыДействия);
	
	Для Каждого Строка Из Объект.Состав Цикл
		Если Строка.Контрагент = Объект.Контрагент Тогда
			Продолжить;
		КонецЕсли;
		
		Строка.Контрагент = Объект.Контрагент;
		СоставКонтрагентПриИзменении(Объект, Строка);
	КонецЦикла;
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Статья ДДС".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДоговорВзаиморасчетовПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ЭтоЗП = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДоговорВзаиморасчетов, "ВидДоговора") = Перечисления.ВидыДоговоров.Зарплата);
	Если ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов.СтатьяДДС) Тогда
		Объект.СтатьяДДС = Объект.ДоговорВзаиморасчетов.СтатьяДДС;
		СтатьяДДСПриИзменении(Объект, ПараметрыДействия);
	ИначеЕсли ЭтоЗП Тогда
		Объект.СтатьяДДС = Справочники.СтатьиДДС.ВыдачаЗП;
		СтатьяДДСПриИзменении(Объект, ПараметрыДействия);
	КонецЕсли;
	
	Для Каждого Строка Из Объект.Состав Цикл
		Если Строка.ДоговорВзаиморасчетов = Объект.ДоговорВзаиморасчетов Тогда
			Продолжить;
		КонецЕсли;
		
		Строка.ДоговорВзаиморасчетов = Объект.ДоговорВзаиморасчетов;
		СоставДоговорВзаиморасчетовПриИзменении(Объект, Строка);
	КонецЦикла;
	
	ОбработкаРеквизитовДокументаСервер.ДоговорВзаиморасчетовПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Статья ДДС".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СтавкаНДСПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Объект.СуммаНДС = Окр((Объект.СуммаДокументаПриход + Объект.СуммаДокументаРасход)*Объект.СтавкаНДС.Ставка/(100+Объект.СтавкаНДС.Ставка),2);
	
	Для Каждого Строка Из Объект.Состав Цикл
		Если Строка.СтавкаНДС = Объект.СтавкаНДС Тогда
			Продолжить;
		КонецЕсли;
		
		Строка.СтавкаНДС = Объект.СтавкаНДС;
		СоставСтавкаНДСПриИзменении(Объект, Строка);
	КонецЦикла;
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Статья ДДС".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура БанковскийСчетПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ВалютаДенежныхСредств = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.БанковскийСчет, "ВалютаДенежныхСредств");
	
	Если НЕ Объект.БанковскийСчет.Пустая() И Объект.ВалютаДокумента <> ВалютаДенежныхСредств Тогда
		Объект.ВалютаДокумента = ВалютаДенежныхСредств;
		Документы.Выписка.ВалютаДокументаПриИзменении(Объект, ПараметрыДействия);
	КонецЕсли;
	
КонецПроцедуры //БанковскийСчетПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПлатежноеПоручениеОснованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	ЗаполнитьПлатежноеПоручениеОснование(Объект);
	
КонецПроцедуры // ПлатежноеПоручениеОснованиеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Касса ККМ".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КассаККМПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Производим приведение параметров кассового ордера в соответствии с выбранной кассой ККМ.
	ОбработкаРеквизитовДокументаСервер.КассаККМПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // КассаККМПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "СОСТАВ"

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в таблице "Состав".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура СоставСтавкаНДСПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Строка.СуммаНДС = Окр((Строка.СуммаПриход + Строка.СуммаРасход) * Строка.СтавкаНДС.Ставка / (100 + Строка.СтавкаНДС.Ставка), 2);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в таблице "Состав".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура СоставКонтрагентПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если ЗначениеЗаполнено(Строка.Контрагент) Тогда
		ВидДоговора = Неопределено;
		Если ЗначениеЗаполнено(Объект.СтатьяДДС) И Объект.СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Приход Тогда
			ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
		ИначеЕсли ЗначениеЗаполнено(Объект.СтатьяДДС) И Объект.СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Расход Тогда
			ВидДоговора = Перечисления.ВидыДоговоров.Покупка;
		КонецЕсли;
		Строка.ДоговорВзаиморасчетов = ОбработкаРеквизитовДокументаСервер.ПолучитьДоговорВзаиморасчетов(Строка.Контрагент, ВидДоговора, Объект,ПараметрыДействия);
		СоставДоговорВзаиморасчетовПриИзменении(Объект, Строка, ПараметрыДействия);
		
		Если ЗначениеЗаполнено(Строка.ПлатежноеПоручениеОснование) И ТипЗнч(Строка.ПлатежноеПоручениеОснование) = Тип("ДокументСсылка.ПлатежноеПоручение") Тогда
			КонтрагентПлатежногоПоручения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.ПлатежноеПоручениеОснование, "Контрагент");
			
			Если Строка.Контрагент <> КонтрагентПлатежногоПоручения Тогда
				Строка.ПлатежноеПоручениеОснование = Неопределено;
				Строка.НазначениеПлатежа = "";
			КонецЕсли;
		КонецЕсли;
	Иначе
		Строка.ДоговорВзаиморасчетов       = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
		Строка.ПлатежноеПоручениеОснование = Неопределено;
	КонецЕсли;
	
	// Проставим ставки НДС для входящих платежей
	Если Строка.Контрагент.ОсвобожденОтНДС Тогда
		НоваяСтавкаНДС = Справочники.СтавкиНДС.БезНДС;
	Иначе
		НоваяСтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	КонецЕсли;
	
	Если Строка.СуммаПриход <> 0 И Строка.СтавкаНДС <> НоваяСтавкаНДС Тогда
		Строка.СтавкаНДС = НоваяСтавкаНДС;
		СоставСтавкаНДСПриИзменении(Объект, Строка, ПараметрыДействия);
	Иначе
		Если ОсвобожденОтУплатыНДС(Объект.Организация, Объект.ПодразделениеКомпании, Объект.Дата) Тогда
			НоваяСтавкаНДС = Справочники.СтавкиНДС.БезНДС;
		Иначе
			НоваяСтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		КонецЕсли;
		
		Если Строка.СуммаРасход <> 0 И Строка.СтавкаНДС <> НоваяСтавкаНДС Тогда
			Строка.СтавкаНДС = НоваяСтавкаНДС;
			СоставСтавкаНДСПриИзменении(Объект, Строка, ПараметрыДействия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в таблице "Состав".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура СоставДоговорВзаиморасчетовПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ЭтоЗП = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.ДоговорВзаиморасчетов, "ВидДоговора") = Перечисления.ВидыДоговоров.Зарплата);
	Если ЗначениеЗаполнено(Строка.ДоговорВзаиморасчетов) Тогда
		Строка.АвтоЗакрытиеСделок       = Строка.ДоговорВзаиморасчетов.АвтоЗакрытиеСделок ИЛИ ЭтоЗП;
		Строка.КурсВалютыВзаиморасчетов = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалютыВзаиморасчетов(Объект, Строка.ДоговорВзаиморасчетов);
	КонецЕсли;
	
	//Если Строка.СуммаПриход = 0 И Строка.СуммаРасход = 0 Тогда
		СоставРассчитатьСумму(Объект, Строка);
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Строка.ДоговорВзаиморасчетов.СтатьяДДС) Тогда
		Строка.СтатьяДДС = Строка.ДоговорВзаиморасчетов.СтатьяДДС;
		СоставСтатьяДДСПриИзменении(Объект, Строка, ПараметрыДействия);
	ИначеЕсли ЭтоЗП Тогда
		Строка.СтатьяДДС = Справочники.СтатьиДДС.ВыдачаЗП;
		СоставСтатьяДДСПриИзменении(Объект, Строка, ПараметрыДействия);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в таблице "Состав".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура СоставСтатьяДДСПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	//Если НЕ ЗначениеЗаполнено(Строка.КурсВалютыУпр) Тогда
	//	Строка.КурсВалютыУпр = Объект.КурсВалютыУпр;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Строка.СтатьяДДС) Тогда
		Если Строка.СтатьяДДС.ВидДвижения = Перечисления.ВидыДвижений.Приход Тогда
			Если Строка.СуммаРасход <> 0 Тогда
				Строка.СуммаРасход = 0;
				СоставСуммаРасходПриИзменении(Объект, Строка, Истина, ПараметрыДействия);
			КонецЕсли;
		ИначеЕсли Строка.СтатьяДДС.ВидДвижения = Перечисления.ВидыДвижений.Расход Тогда
			Если Строка.СуммаПриход <> 0 Тогда
				Строка.СуммаПриход = 0;
				СоставСуммаПриходПриИзменении(Объект, Строка, Истина, ПараметрыДействия);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьРеквизит(Объект, "ВидДвижения", "Состав") Тогда
		Строка.ВидДвижения = Строка.СтатьяДДС.ВидДвижения;
	КонецЕсли;
	
	Если Строка.СтатьяДДС = Справочники.СтатьиДДС.ОплатаБанковскихУслуг Тогда
		Если Строка.СуммаУслуг <> 0 Тогда
			Строка.СуммаУслуг = 0;
			СоставСуммаУслугПриИзменении(Объект, Строка, ПараметрыДействия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в таблице "Состав".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура СоставСделкаПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если ЗначениеЗаполнено(Строка.Сделка) Тогда
		Если Объект.ХозОперация = Справочники.ХозОперации.БанковскаяВыписка Тогда
			Если ЕстьРеквизит(Строка.Сделка,"Контрагент") Тогда
				Строка.Контрагент = Строка.Сделка.Контрагент;
				СоставКонтрагентПриИзменении(Объект, Строка, ПараметрыДействия);
				Если ЕстьРеквизит(Строка.Сделка, "ДоговорВзаиморасчетов") Тогда
					Строка.ДоговорВзаиморасчетов = Строка.Сделка.ДоговорВзаиморасчетов;
					СоставДоговорВзаиморасчетовПриИзменении(Объект, Строка, ПараметрыДействия);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ЕстьРеквизит(Строка.Сделка,"Контрагент") Тогда
				Объект.Контрагент = Строка.Сделка.Контрагент;
				КонтрагентПриИзменении(Объект);
				Если ЕстьРеквизит(Строка.Сделка, "ДоговорВзаиморасчетов") Тогда
					Объект.ДоговорВзаиморасчетов = Строка.Сделка.ДоговорВзаиморасчетов;
					ДоговорВзаиморасчетовПриИзменении(Объект, ПараметрыДействия);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Строка.ДоговорВзаиморасчетов.СохранятьКурсСделки Тогда
		Если ЗначениеЗаполнено(Строка.Сделка) Тогда
			Если ЕстьРеквизит(Строка.Сделка,"КурсВалютыВзаиморасчетов") И ЗначениеЗаполнено(Строка.Сделка.КурсВалютыВзаиморасчетов)
				И ЕстьРеквизит(Строка.Сделка,"ДоговорВзаиморасчетов") И Строка.Сделка.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов=Строка.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов Тогда
				Строка.КурсВалютыВзаиморасчетов = Строка.Сделка.КурсВалютыВзаиморасчетов;
			Иначе //если не удалось найти курс у сделки, то получим курс на дату сделки
				Строка.КурсВалютыВзаиморасчетов = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалюты(Строка.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов, Строка.Сделка.Дата);
			КонецЕсли;
		Иначе
			Строка.КурсВалютыВзаиморасчетов = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалютыВзаиморасчетов(Объект, Строка.ДоговорВзаиморасчетов);
		КонецЕсли;
	КонецЕсли;
	
	СоставРассчитатьСумму(Объект,Строка);
	
	Если ЗначениеЗаполнено(Строка.Сделка)
		И (Строка.СуммаПриход > 0 ИЛИ Строка.СуммаРасход > 0)
		И ЗначениеЗаполнено(Строка.СтавкаНДС) Тогда
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("СуммаНДС",        Строка.СуммаНДС);
		СтруктураСтроки.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
		СтруктураСтроки.Вставить("КурсДокумента",   Объект.КурсДокумента);
		СуммаОплаты = ?(Строка.СуммаПриход = 0, Строка.СуммаРасход, Строка.СуммаПриход);
		ОбработкаСобытийДокументаСервер.УстановитьСтавкуНДС(Строка.Сделка, СтруктураСтроки, СуммаОплаты);
		
		Строка.СуммаНДС = СтруктураСтроки.СуммаНДС;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в таблице "Состав".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура СоставСуммаПриходПриИзменении(Объект, Строка, ИзменениеНаправленияПлатежа = Ложь, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ИзменениеНаправленияПлатежа = Строка.СуммаРасход <> 0;
	
	Если Строка.СуммаПриход <> 0 Тогда
		Строка.СуммаРасход = 0;
	КонецЕсли;
	
	СоставСуммаПриИзменении(Объект, Строка, ИзменениеНаправленияПлатежа, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в таблице "Состав".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура СоставСуммаРасходПриИзменении(Объект, Строка, ИзменениеНаправленияПлатежа = Ложь, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ИзменениеНаправленияПлатежа = Строка.СуммаПриход <> 0;
	
	Если Строка.СуммаРасход <> 0 Тогда
		Строка.СуммаПриход = 0;
	КонецЕсли;
	
	СоставСуммаПриИзменении(Объект, Строка, ИзменениеНаправленияПлатежа, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в таблице "Состав".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура СоставСуммаПриИзменении(Объект, Строка, ИзменениеНаправленияПлатежа, ПараметрыДействия = Неопределено)
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если ИзменениеНаправленияПлатежа Тогда
		Если Строка.СуммаПриход <> 0 Тогда
			// Проставим ставку НДС для входящего платежа
			НоваяСтавкаНДС = ?(Строка.Контрагент.ОсвобожденОтНДС, Справочники.СтавкиНДС.БезНДС, Справочники.СтавкиНДС.ОсновнаяСтавкаНДС);
			Если Строка.СтавкаНДС <> НоваяСтавкаНДС Тогда
				Строка.СтавкаНДС = НоваяСтавкаНДС;
			КонецЕсли;
		Иначе
			// Проставим ставку НДС для входящего исходящего платежа
			НоваяСтавкаНДС = ?(ОсвобожденОтУплатыНДС(Объект.Организация, Объект.ПодразделениеКомпании, Объект.Дата), Справочники.СтавкиНДС.БезНДС, Справочники.СтавкиНДС.ОсновнаяСтавкаНДС);
			Если Строка.СтавкаНДС <> НоваяСтавкаНДС Тогда
				Строка.СтавкаНДС = НоваяСтавкаНДС;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	СоставСтавкаНДСПриИзменении(Объект, Строка, ПараметрыДействия);
	
	СуммаПлатежа = Строка.СуммаРасход + Строка.СуммаПриход;
	Если Строка.СтатьяДДС <> Справочники.СтатьиДДС.ОплатаБанковскихУслуг Тогда
		Если СуммаПлатежа < Строка.СуммаУслуг Тогда
			Строка.СуммаУслуг = СуммаПлатежа;
			ВывестиСообщение(НСтр("ru = 'Сумма прихода/расхода не может быть меньше суммы комиссии банка.'"));
		КонецЕсли;
		Строка.ПроцентКомиссии = ?(Строка.СуммаУслуг = 0 ИЛИ СуммаПлатежа = 0, 0, Строка.СуммаУслуг / СуммаПлатежа * 100);
	КонецЕсли;
	Строка.СуммаРазница = СуммаПлатежа - Строка.СуммаУслуг;
	
КонецПроцедуры // СоставСуммаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Процент комиссии" в таблице "Состав".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура СоставПроцентКомиссииПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Сумма               = Строка.СуммаПриход + Строка.СуммаРасход;
	Строка.СуммаУслуг   = Окр(Сумма * Строка.ПроцентКомиссии / 100, 2);
	Строка.СуммаРазница = Сумма - Строка.СуммаУслуг;
	
КонецПроцедуры // СоставПроцентКомиссииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма услуг" в таблице "Состав".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура СоставСуммаУслугПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	СуммаПлатежа = Строка.СуммаПриход + Строка.СуммаРасход;
	Если СуммаПлатежа < Строка.СуммаУслуг Тогда
		Строка.СуммаУслуг = СуммаПлатежа;
		ВывестиСообщение(НСтр("ru = 'Сумма прихода/расхода не может быть меньше суммы комиссии банка.'"));
	КонецЕсли;
	Строка.СуммаРазница = СуммаПлатежа - Строка.СуммаУслуг;
	Строка.ПроцентКомиссии = ?(Строка.СуммаУслуг = 0 ИЛИ СуммаПлатежа = 0, 0, Строка.СуммаУслуг / СуммаПлатежа * 100);
	
КонецПроцедуры // СоставСуммаУслугПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма разница" в таблице "Состав".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура СоставСуммаРазницаПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если Строка.СтатьяДДС.ВидДвижения = Перечисления.ВидыДвижений.Расход Тогда
		Строка.СуммаРасход = Строка.СуммаРазница + Строка.СуммаУслуг;
		СоставСуммаРасходПриИзменении(Объект, Строка, ПараметрыДействия);
	ИначеЕсли Строка.СтатьяДДС.ВидДвижения = Перечисления.ВидыДвижений.Приход Тогда
		Строка.СуммаПриход = Строка.СуммаРазница + Строка.СуммаУслуг;
		СоставСуммаПриходПриИзменении(Объект, Строка, ПараметрыДействия);
	Иначе
		Если Строка.СуммаРасход <> 0 Тогда
			Строка.СуммаРасход = Строка.СуммаРазница + Строка.СуммаУслуг;
			СоставСуммаРасходПриИзменении(Объект, Строка, ПараметрыДействия);
		Иначе
			Строка.СуммаПриход = Строка.СуммаРазница + Строка.СуммаУслуг;
			СоставСуммаПриходПриИзменении(Объект, Строка, ПараметрыДействия);
		КонецЕсли;
	КонецЕсли;
	
	Если Строка.СтатьяДДС <> Справочники.СтатьиДДС.ОплатаБанковскихУслуг Тогда
		СуммаПлатежа = Строка.СуммаПриход + Строка.СуммаРасход;
		Строка.ПроцентКомиссии = ?(Строка.СуммаУслуг = 0 ИЛИ СуммаПлатежа = 0, 0, Строка.СуммаУслуг / СуммаПлатежа * 100);
	КонецЕсли;
	
КонецПроцедуры // СоставСуммаРазницаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в таблице "Состав".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура СоставПлатежноеПоручениеОснованиеПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если (НЕ ЗначениеЗаполнено(Строка.ПлатежноеПоручениеОснование)) ИЛИ (ТипЗнч(Строка.ПлатежноеПоручениеОснование) <> Тип("ДокументСсылка.ПлатежноеПоручение")) Тогда
		
		Строка.НазначениеПлатежа = "";
		Строка.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
		Строка.СуммаНДС  = 0;
		Строка.СтатьяДДС = Справочники.СтатьиДДС.ПустаяСсылка();
		Возврат;
		
	КонецЕсли;
	
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Строка.ПлатежноеПоручениеОснование,
		"Контрагент,ДоговорВзаиморасчетов,НазначениеПлатежа,СтавкаНДС,СуммаНДС");
		
	ИзмененКонтрагент = (Строка.Контрагент <> ЗначенияРеквизитов.Контрагент);
	ИзмененДоговорВзаиморасчетов = (Строка.ДоговорВзаиморасчетов <> ЗначенияРеквизитов.ДоговорВзаиморасчетов);
	
	ЗаполнитьЗначенияСвойств(Строка, ЗначенияРеквизитов);
	
	Если ИзмененКонтрагент Тогда
		СоставКонтрагентПриИзменении(Объект, Строка, ПараметрыДействия);
	ИначеЕсли ИзмененДоговорВзаиморасчетов Тогда
		СоставДоговорВзаиморасчетовПриИзменении(объект, Строка, ПараметрыДействия);
	Иначе
		СоставРассчитатьСумму(Объект, Строка);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в таблице "Состав".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура СоставРассчитатьСумму(Объект, Строка)
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// получаем остаток по сделке
	Если ЗначениеЗаполнено(Строка.ПлатежноеПоручениеОснование) И ТипЗнч(Строка.ПлатежноеПоручениеОснование) = Тип("ДокументСсылка.ПлатежноеПоручение") Тогда
		РеквизитыПлатежногоПоручения = ОбщегоНазначения
			.ЗначенияРеквизитовОбъекта(Строка.ПлатежноеПоручениеОснование, "СуммаДокумента,ВалютаДокумента");
		
		ОстатокПоСделке = РеквизитыПлатежногоПоручения.СуммаДокумента;
		ОстатокПоСделке = -РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(
			ОстатокПоСделке,
			РеквизитыПлатежногоПоручения.ВалютаДокумента,
			?(ЗначениеЗаполнено(Строка.КурсВалютыВзаиморасчетов), Строка.КурсВалютыВзаиморасчетов, Объект.Дата),
			Объект.ВалютаДокумента,
			Объект.КурсДокумента);
	Иначе
		Отбор = Новый Структура();
		Отбор.Вставить("Контрагент"            , Строка.Контрагент);
		Отбор.Вставить("ДоговорВзаиморасчетов" , Строка.ДоговорВзаиморасчетов);
		Если ЗначениеЗаполнено(Строка.Сделка) Тогда
			Отбор.Вставить("Сделка" , Строка.Сделка);
		КонецЕсли;
		МоментВремени = Новый МоментВремени(Объект.Дата, Объект.Ссылка);
		Долги = РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(МоментВремени,Отбор,,"Сумма");
		ОстатокПоСделке = Долги.Итог("Сумма");
		ОстатокПоСделке = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(
			ОстатокПоСделке,
			Строка.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов,
			?(ЗначениеЗаполнено(Строка.КурсВалютыВзаиморасчетов), Строка.КурсВалютыВзаиморасчетов, Объект.Дата),
			Объект.ВалютаДокумента,
			Объект.КурсДокумента);
	КонецЕсли;
	
	Строка.СуммаПриход = 0; Строка.СуммаРасход = 0;
	
	Если ОстатокПоСделке > 0 Тогда
		Если Строка.СтатьяДДС.ВидДвижения <> Перечисления.ВидыДвижений.Расход Тогда
			ИзменениеНаправленияПлатежа = Ложь;
			ИзменитьСумму = Истина;
			Если Строка.СуммаРасход <> 0 Тогда
				Строка.СуммаРасход = 0;
				ИзменениеНаправленияПлатежа = Истина;
				ИзменитьСумму = (Строка.СтатьяДДС.ВидДвижения<>Перечисления.ВидыДвижений.Приход);
			КонецЕсли;
			Если ИзменитьСумму Тогда
				Строка.СуммаПриход = ОстатокПоСделке;
			КонецЕсли;
			СоставСуммаПриходПриИзменении(Объект, Строка, ИзменениеНаправленияПлатежа);
		КонецЕсли;
	ИначеЕсли ОстатокПоСделке < 0 Тогда
		Если Строка.СтатьяДДС.ВидДвижения <> Перечисления.ВидыДвижений.Приход Тогда
			ИзменениеНаправленияПлатежа = Ложь;
			ИзменитьСумму = Истина;
			Если Строка.СуммаПриход <> 0 Тогда
				Строка.СуммаПриход = 0;
				ИзменениеНаправленияПлатежа = Истина;
				ИзменитьСумму = (Строка.СтатьяДДС.ВидДвижения<>Перечисления.ВидыДвижений.Расход);
			КонецЕсли;
			Если ИзменитьСумму Тогда
				Строка.СуммаРасход = -ОстатокПоСделке;
			КонецЕсли;
			СоставСуммаРасходПриИзменении(Объект, Строка, ИзменениеНаправленияПлатежа);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыНоменклатураПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события.
	ОбработкаТабличнойЧастиТовары.НоменклатураПриИзменении(Объект, Строка, ПараметрыДействия);
	
	// Проверим, имеют ли смысл дальнейшие действия.
	Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Отказ", ЛОЖЬ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Характеристика номенклатуры" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события.
	ОбработкаТабличнойЧастиТовары.ХарактеристикаНоменклатурыПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события.
	ОбработкаТабличнойЧастиТовары.ЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыКоличествоПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события.
	ОбработкаТабличнойЧастиТовары.КоличествоПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыКоличествоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыЦенаПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ЦенаПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЦенаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСуммаПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события.
	ОбработкаТабличнойЧастиТовары.СуммаПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСтавкаНДСПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события.
	ОбработкаТабличнойЧастиТовары.СтавкаНДСПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСтавкаНДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма НДС" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСуммаНДСПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события.
	ОбработкаТабличнойЧастиТовары.СуммаНДСПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаНДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма всего" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСуммаВсегоПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события.
	ОбработкаТабличнойЧастиТовары.СуммаВсегоПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаВсегоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Процент скидки" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыПроцентСкидкиПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ОбработкаТабличнойЧастиТовары.ТоварыПроцентСкидкиПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыПроцентСкидкиПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Процент скидки строки" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыПроцентСкидкиСтрокиПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ОбработкаТабличнойЧастиТовары.ПроцентСкидкиСтрокиПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыПроцентСкидкиСтрокиПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма скидки строки" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСуммаСкидкиСтрокиПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ОбработкаТабличнойЧастиТовары.СуммаСкидкиСтрокиПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаСкидкиСтрокиПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма скидки на товар" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСкидкаНаТоварПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ОбработкаТабличнойЧастиТовары.СкидкаНаТоварПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСкидкаНаТоварПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма скидки" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСуммаСкидкиПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события.
	ОбработкаТабличнойЧастиТовары.СуммаСкидкиПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаСкидкиПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.Выписка",
		"ПФ_MXL_БанковскаяВыписка",
		НСтр("ru = 'Банковская выписка'"),
		СсылкаНаДокумент);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик печати документа
//
// Параметры:
//  МассивОбъектов         - Массив           - массив объектов для формирования печатных форм
//  ПараметрыПечати        - Структура        - дополнительные параметры печати
//  КоллекцияПечатныхФорм  - Таблица значений - таблица с идентификаторами печатных форм и макетами печати
//  ОбъектыПечати          - Структура        - список областей печатной формы в разрезе документов
//  ПараметрыВывода        - Структура        - дополнительные параметры вывода формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_БанковскаяВыписка") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_БанковскаяВыписка",
															НСтр("ru = 'Банковская выписка'"),
															ПечатьБанковскаяВыписка(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;	
КонецПроцедуры // Печать()

// Формирует печатную форму "БанковскаяВыписка"
//
Функция ПечатьБанковскаяВыписка(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Выписка_БанковскаяВыписка";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	
	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ФорматВыводаСуммы = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// зададим параметры макета
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Выписка.ПФ_MXL_БанковскаяВыписка");
		
		ОбластьЗаголовок       = Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапкаТаблицы    = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьСтрока          = Макет.ПолучитьОбласть("Строка");
		ОбластьИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьПодвал          = Макет.ПолучитьОбласть("Подвал");
		
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		// вывод заголовка документа
		ОбластьЗаголовок.Параметры.Заполнить(Документ);
		ТекстЗаголовка = УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(Документ);
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьЗаголовок.Параметры.ПредставлениеОрганизация	= УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,Документ.Дата,ДополнительныеПараметры);
		ОбластьЗаголовок.Параметры.Счет = Документ.БанковскийСчет;
		ОбластьЗаголовок.Параметры.БанковскийСчет = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Документ.БанковскийСчет);
		ОбластьЗаголовок.Параметры.Валюта = Документ.ВалютаДокумента;
		
		// выводим свойства
		УправлениеПечатьюПлатформа.ЗаполнитьСвойствамиОбъекта(ОбластьЗаголовок, Документ);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);

		СтруктураОтбора	= Новый Структура("СтруктурнаяЕдиница", Документ.БанковскийСчет);
		МоментВремени	= ?(ТипЗнч(Документ) <> Тип("ДокументСсылка.Выписка") , Новый МоментВремени(КонецДня(Документ.Дата)), Документ.Ссылка.МоментВремени());
		тзОстатки	= РегистрыНакопления.ДенежныеСредстваКомпании.Остатки(МоментВремени,СтруктураОтбора,,"Сумма");
		Остаток		= тзОстатки.Итог("Сумма");
		СуммаНачОстаток = Остаток;
		
		// готовим шапку
		НомерСтраницы = 2; НомерСтраницыПред = 2;
		СтруктураИтоговПоСтранице = Новый Структура;
		СтруктураИтоговПоСтранице.Вставить("СуммаНачальныйОстаток", СуммаНачОстаток);
		СтруктураИтоговПоСтранице.Вставить("СуммаПриход",           0);
		СтруктураИтоговПоСтранице.Вставить("СуммаРасход",           0);
		СтруктураИтоговПоСтранице.Вставить("СуммаКонечныйОстаток",  СуммаНачОстаток);
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы;
		
		ОбластьПодвал.Параметры.СуммаНачальныйОстаток = Формат(Остаток,ФорматВыводаСуммы);
		ВыборкаТабличнойЧасти = Документ.Состав;
		ПлатежныеПолучения = Новый Массив;
		Для Каждого Строка Из ВыборкаТабличнойЧасти Цикл
			Если ЗначениеЗаполнено(Строка.ПлатежноеПоручениеОснование)
				И ТипЗнч(Строка.ПлатежноеПоручениеОснование) = Тип("ДокументСсылка.ПлатежноеПоручение") Тогда
				
				ПлатежныеПолучения.Добавить(Строка.ПлатежноеПоручениеОснование);
				
			КонецЕсли;
		КонецЦикла;
		
		Если ПлатежныеПолучения.Количество() > 0 Тогда
			РеквизитыПлатежныхПоручений = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ПлатежныеПолучения, "Номер,Дата");
		Иначе
			РеквизитыПлатежныхПоручений = Новый Соответствие;
		КонецЕсли;
		
		// готовим области строки
		Для каждого СтрокаТЧ Из ВыборкаТабличнойЧасти Цикл
			ОбластьСтрока.Параметры.Заполнить(СтрокаТЧ);
			ОбластьСтрока.Параметры.СуммаПриход = Формат(СтрокаТЧ.СуммаПриход,ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.СуммаРасход = Формат(СтрокаТЧ.СуммаРасход,ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.СуммаОстаток = Формат(Остаток,ФорматВыводаСуммы);
			СуммаКонОстаток = Остаток+СтрокаТЧ.СуммаПриход-СтрокаТЧ.СуммаРасход;
			ОбластьСтрока.Параметры.СуммаКонОстаток = Формат(СуммаКонОстаток,ФорматВыводаСуммы);
			
			РеквизитыПлатежногоПоручения = РеквизитыПлатежныхПоручений.Получить(СтрокаТЧ.ПлатежноеПоручениеОснование);
			Если ЗначениеЗаполнено(СтрокаТЧ.НомерВходящегоДокумента) И ЗначениеЗаполнено(СтрокаТЧ.ДатаВходящегоДокумента) Тогда
				РеквизитыПлатежногоПоручения = Новый Структура(
					"Номер,Дата", СтрокаТЧ.НомерВходящегоДокумента, СтрокаТЧ.ДатаВходящегоДокумента);
			КонецЕсли;
			
			Если РеквизитыПлатежногоПоручения <> Неопределено Тогда
				ОбластьСтрока.Параметры.ПлатежноеПоручениеОснование = СтрШаблон(
					НСтр("ru = '№ %1 от %2'"),
					СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(СокрЛП(РеквизитыПлатежногоПоручения.Номер), "0"),
					Формат(РеквизитыПлатежногоПоручения.Дата, "ДЛФ=D"));
			КонецЕсли;
			
			ОбластьСтрока.Параметры.НазначениеПлатежа = СтрЗаменить(СтрокаТЧ.НазначениеПлатежа, Символы.ПС, " "); 

			// доп. области
			мсвДопОбластиПодвала = Неопределено;
			Если ВыборкаТабличнойЧасти.Индекс(СтрокаТЧ) = ВыборкаТабличнойЧасти.Количество()-1 Тогда
				мсвДопОбластиПодвала = Новый Массив;
				мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
			КонецЕсли;
			
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьШапкаТаблицы, ОбластьИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице, Документ, мсвДопОбластиПодвала);
			Остаток = Остаток+СтрокаТЧ.СуммаПриход-СтрокаТЧ.СуммаРасход;

			// инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				КонечныйОстаток = СтруктураИтоговПоСтранице.СуммаКонечныйОстаток;
				СтруктураИтоговПоСтранице = Новый Структура;
				СтруктураИтоговПоСтранице.Вставить("СуммаНачальныйОстаток", КонечныйОстаток);
				СтруктураИтоговПоСтранице.Вставить("СуммаПриход",           0);
				СтруктураИтоговПоСтранице.Вставить("СуммаРасход",           0);
				СтруктураИтоговПоСтранице.Вставить("СуммаКонечныйОстаток",  КонечныйОстаток);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			// добавляем итоги
			ИтогиПоСтранице = Новый Структура;
			ИтогиПоСтранице.Вставить("СуммаНачальныйОстаток", 0);
			ИтогиПоСтранице.Вставить("СуммаПриход",           СтрокаТЧ.СуммаПриход);
			ИтогиПоСтранице.Вставить("СуммаРасход",           СтрокаТЧ.СуммаРасход);
			ИтогиПоСтранице.Вставить("СуммаКонечныйОстаток",  СтрокаТЧ.СуммаПриход-СтрокаТЧ.СуммаРасход);
			
			// добавляем итоги
			УправлениеПечатьюПлатформа.ДобавитьИтогиПоСтранице(ИтогиПоСтранице,СтруктураИтоговПоСтранице);
		КонецЦикла;
		
		// выводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			УправлениеПечатьюПлатформа.ВывестиИтогиПоСтранице(ТабличныйДокумент,ОбластьИтогоПоСтранице,СтруктураИтоговПоСтранице,Документ);
		КонецЕсли;
		
		// итоги
		СуммаПриход = Документ.Состав.Итог("СуммаПриход");
		ОбластьПодвал.Параметры.ИтогоСуммаПриход = Формат(СуммаПриход,ФорматВыводаСуммы);
		СуммаРасход = Документ.Состав.Итог("СуммаРасход");
		ОбластьПодвал.Параметры.ИтогоСуммаРасход = Формат(СуммаРасход,ФорматВыводаСуммы);
		СуммаКонечныйОстаток = СуммаНачОстаток+СуммаПриход-СуммаРасход;
		ОбластьПодвал.Параметры.СуммаКонечныйОстаток = Формат(СуммаКонечныйОстаток,ФорматВыводаСуммы);
		
		// сумма прописью
		ОбластьПодвал.Параметры.СуммаПрописьюНачОстаток=РаботаСКурсамиВалют.СформироватьСуммуПрописью(тзОстатки.Итог("Сумма"),Документ.ВалютаДокумента);
		ОбластьПодвал.Параметры.СуммаПрописьюПриход = РаботаСКурсамиВалют.СформироватьСуммуПрописью(Документ.Состав.Итог("СуммаПриход"),Документ.ВалютаДокумента);
		ОбластьПодвал.Параметры.СуммаПрописьюРасход = РаботаСКурсамиВалют.СформироватьСуммуПрописью(Документ.Состав.Итог("СуммаРасход"),Документ.ВалютаДокумента);
		ОбластьПодвал.Параметры.СуммаПрописьюКонОстаток=РаботаСКурсамиВалют.СформироватьСуммуПрописью(Остаток,Документ.ВалютаДокумента);
		
		// Выводим представления и расшифровки подписей
		ОбластьПодвал.Параметры.Заполнить(УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"ГлавныйБухгалтер","ГлавныйБухгалтер"));	
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		
		УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент,ОбластьПодвал,,,НомерСтраницы,,Документ);
		
		// отметим конец области документа
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции //ПечатьБанковскаяВыписка()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	ПараметрыКоманды = Новый Структура();
	Отбор = Новый Структура("СчетОрганизации", "БанковскийСчет");
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ПлатежноеПоручение", "Документ.ПлатежноеПоручение.ФормаСписка",Новый Структура("Отбор,РежимВыбора,ДатаДокумента", Отбор,ИСТИНА,"Дата"),, ИСТИНА);
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "СоставПлатежнымиПоручениями", , "Состав", НСтр("ru = 'По платежным поручениям'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	Отбор = Новый Структура("ХозОперация, СтруктурнаяЕдиница", Справочники.ХозОперации.ПланПоступленияНаРС, "БанковскийСчет");
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ПланПоступленияДС", "Документ.ПланПоступленияДС.ФормаСписка",Новый Структура("Отбор,РежимВыбора", Отбор,ИСТИНА),, ИСТИНА, НСтр("ru = 'Необходимо выбрать план поступления денежных средств.'"));
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "СоставПланПоступленияДС",, "Состав", НСтр("ru = 'По планам поступления ДС'"),ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	Отбор = Новый Структура("ХозОперация, СтруктурнаяЕдиница", Справочники.ХозОперации.ЗаявкаНаРасходСРС, "БанковскийСчет");
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ЗаявкаНаРасходДС", "Документ.ЗаявкаНаРасходДС.ФормаСписка",Новый Структура("Отбор,РежимВыбора", Отбор,ИСТИНА),, ИСТИНА, НСтр("ru = 'Необходимо выбрать заявку на расход денежных средств.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "СоставЗаявкаНаРасходДС",, "Состав", НСтр("ru = 'По заявкам на расход ДС'"), ПараметрыКоманды);
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ПодразделениеКомпании", "Справочник.ПодразделенияКомпании.ФормаСписка",,, Истина, НСтр("ru = 'Необходимо выбрать подразделение компании.'"));
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "СоставЗаполнитьПоТекущейЗадолженности",, "Состав", НСтр("ru = 'Заполнить по текущей задолженности сотрудникам'"), ПараметрыКоманды);
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	ПараметрыКоманд.Вставить("СоставПлатежнымиПоручениями.Видимость",   Истина);
	ПараметрыКоманд.Вставить("СоставПлатежнымиПоручениями.Доступность", Истина);
	ПараметрыКоманд.Вставить("СоставПланПоступленияДС.Видимость",       Истина);
	ПараметрыКоманд.Вставить("СоставПланПоступленияДС.Доступность",     Истина);
	ПараметрыКоманд.Вставить("СоставЗаявкаНаРасходДС.Видимость",        Истина);
	ПараметрыКоманд.Вставить("СоставЗаявкаНаРасходДС.Доступность",      Истина);
	ПараметрыКоманд.Вставить("СоставЗаполнитьПоТекущейЗадолженности.Видимость",   Истина);
	ПараметрыКоманд.Вставить("СоставЗаполнитьПоТекущейЗадолженности.Доступность", Истина);
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()

// Обработчик заполнения документа по платежным поручениям
//
Функция СоставПлатежнымиПоручениями(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);

	НоваяСтрока                             = Объект.Состав.Добавить();
	НоваяСтрока.Контрагент                  = ПараметрыЗаполнения.ПлатежноеПоручение.Контрагент;
	НоваяСтрока.ДоговорВзаиморасчетов       = ПараметрыЗаполнения.ПлатежноеПоручение.ДоговорВзаиморасчетов;
	НоваяСтрока.АвтоЗакрытиеСделок          = ПараметрыЗаполнения.ПлатежноеПоручение.ДоговорВзаиморасчетов.АвтоЗакрытиеСделок;
	НоваяСтрока.СуммаРасход                 = ПараметрыЗаполнения.ПлатежноеПоручение.СуммаДокумента;
	НоваяСтрока.ПлатежноеПоручениеОснование = ПараметрыЗаполнения.ПлатежноеПоручение;
	НоваяСтрока.НазначениеПлатежа           = СокрЛП(ПараметрыЗаполнения.ПлатежноеПоручение.НазначениеПлатежа);
	НоваяСтрока.СтавкаНДС                   = ПараметрыЗаполнения.ПлатежноеПоручение.СтавкаНДС;
	НоваяСтрока.СуммаНДС                    = ПараметрыЗаполнения.ПлатежноеПоручение.СуммаНДС;
	НоваяСтрока.СтатьяДДС                   = ПараметрыЗаполнения.ПлатежноеПоручение.СтатьяДДС;
	
КонецФункции // СоставПлатежнымиПоручениями()

// Обработчик заполнения документа по планам поступления ДС
//
Функция СоставПланПоступленияДС(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
		СтруктураОтбор = Новый Структура;
		СтруктураОтбор.Вставить("Контрагент",            ПараметрыЗаполнения.ПланПоступленияДС.Контрагент);
		СтруктураОтбор.Вставить("ДоговорВзаиморасчетов", ПараметрыЗаполнения.ПланПоступленияДС.ДоговорВзаиморасчетов);
		СтруктураОтбор.Вставить("СтатьяДДС",             ПараметрыЗаполнения.ПланПоступленияДС.СтатьяДДС);
		СтруктураОтбор.Вставить("СуммаПриход",           ПараметрыЗаполнения.ПланПоступленияДС.СуммаДокумента);
		
		НайденныеСтроки = Объект.Состав.НайтиСтроки(СтруктураОтбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаСостава                       = Объект.Состав.Добавить();
			СтрокаСостава.СтатьяДДС             = ПараметрыЗаполнения.ПланПоступленияДС.СтатьяДДС;
			СтрокаСостава.Контрагент            = ПараметрыЗаполнения.ПланПоступленияДС.Контрагент;
			СтрокаСостава.ДоговорВзаиморасчетов = ПараметрыЗаполнения.ПланПоступленияДС.ДоговорВзаиморасчетов;
			СтрокаСостава.СуммаПриход           = ПараметрыЗаполнения.ПланПоступленияДС.СуммаДокумента;
			
			Если НЕ ЗначениеЗаполнено(СтрокаСостава.ДоговорВзаиморасчетов) Тогда
				СтрокаСостава.АвтоЗакрытиеСделок = Истина;
			Иначе
				СтрокаСостава.АвтоЗакрытиеСделок       = СтрокаСостава.ДоговорВзаиморасчетов.АвтоЗакрытиеСделок;
				СтрокаСостава.КурсВалютыВзаиморасчетов = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалютыВзаиморасчетов(Объект, СтрокаСостава.ДоговорВзаиморасчетов);
			КонецЕсли; 
			СтрокаСостава.ПлатежноеПоручениеОснование = ПараметрыЗаполнения.ПланПоступленияДС;
			СтрокаСостава.НазначениеПлатежа           = СокрЛП(ПараметрыЗаполнения.ПланПоступленияДС.Назначение);
		КонецЕсли;
		
КонецФункции // СоставПланПоступленияДС()

// Обработчик заполнения документа по заявкам на расход ДС
//
Функция СоставЗаявкаНаРасходДС(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	СтруктураОтбор = Новый Структура;
	СтруктураОтбор.Вставить("Контрагент",            ПараметрыЗаполнения.ЗаявкаНаРасходДС.Контрагент);
	СтруктураОтбор.Вставить("ДоговорВзаиморасчетов", ПараметрыЗаполнения.ЗаявкаНаРасходДС.ДоговорВзаиморасчетов);
	СтруктураОтбор.Вставить("СтатьяДДС",             ПараметрыЗаполнения.ЗаявкаНаРасходДС.СтатьяДДС);
	СтруктураОтбор.Вставить("СуммаРасход",           ПараметрыЗаполнения.ЗаявкаНаРасходДС.СуммаДокумента);
	
	НайденныеСтроки = Объект.Состав.НайтиСтроки(СтруктураОтбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаСостава                       = Объект.Состав.Добавить();
		СтрокаСостава.СтатьяДДС             = ПараметрыЗаполнения.ЗаявкаНаРасходДС.СтатьяДДС;
		СтрокаСостава.Контрагент            = ПараметрыЗаполнения.ЗаявкаНаРасходДС.Контрагент;
		СтрокаСостава.ДоговорВзаиморасчетов = ПараметрыЗаполнения.ЗаявкаНаРасходДС.ДоговорВзаиморасчетов;
		СтрокаСостава.СуммаРасход           = ПараметрыЗаполнения.ЗаявкаНаРасходДС.СуммаДокумента;
		
		Если Не ЗначениеЗаполнено(СтрокаСостава.ДоговорВзаиморасчетов) Тогда
			СтрокаСостава.АвтоЗакрытиеСделок = Истина;
		Иначе
			СтрокаСостава.АвтоЗакрытиеСделок       = СтрокаСостава.ДоговорВзаиморасчетов.АвтоЗакрытиеСделок;
			СтрокаСостава.КурсВалютыВзаиморасчетов = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалютыВзаиморасчетов(Объект, СтрокаСостава.ДоговорВзаиморасчетов);
		КонецЕсли; 
		СтрокаСостава.ПлатежноеПоручениеОснование = ПараметрыЗаполнения.ЗаявкаНаРасходДС;
		СтрокаСостава.НазначениеПлатежа           = СокрЛП(ПараметрыЗаполнения.ЗаявкаНаРасходДС.Назначение);
	КонецЕсли;
	
КонецФункции // СоставЗаявкаНаРасходДС()

// Обработчик заполнения документа по  текущей задолженности
//
Функция СоставЗаполнитьПоТекущейЗадолженности(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Произведем корректировку значений реквизитов объекта в соответствии с параметрами заполнения.
	Если НЕ Объект.ПодразделениеКомпании = ПараметрыЗаполнения.ПодразделениеКомпании Тогда
		Объект.ПодразделениеКомпании = ПараметрыЗаполнения.ПодразделениеКомпании;
		ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	КонецЕсли;
	
	// Заполним
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыКомпанииОстатки.Контрагент КАК Контрагент,
	|	ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	ВзаиморасчетыКомпанииОстатки.СуммаОстаток,
	|	ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток,
	|	ВзаиморасчетыКомпанииОстатки.СуммаБазОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыКомпании.Остатки(
	|		&МоментВремени,
	|		Контрагент В
	|		        (ВЫБРАТЬ
	|		            Контрагенты.Ссылка КАК Контрагент
	|		        ИЗ
	|		            Справочник.Контрагенты КАК Контрагенты
	|		        ГДЕ
	|		            Контрагенты.Сотрудник.ПодразделениеКомпании = &Подразделение)
	|		    И ДоговорВзаиморасчетов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.Зарплата)
	|	) КАК ВзаиморасчетыКомпанииОстатки
	|ГДЕ
	|	ВзаиморасчетыКомпанииОстатки.СуммаОстаток < 0";
	Запрос = Новый Запрос(ТекстЗапроса);
	
	МоментВремени = ?(НЕ ЗначениеЗаполнено(Объект.Ссылка),Новый МоментВремени(КонецДня(Объект.Дата)), Новый МоментВремени(Объект.Дата, Объект.Ссылка));
	МоментВремени = ?(Объект.Проведен, Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая), МоментВремени);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени);	
	Запрос.УстановитьПараметр("Подразделение", Объект.ПодразделениеКомпании);
	РезультатЗапросаПоСотрудникам = Запрос.Выполнить();
	
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	ВалютаБаз=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	Выборка = РезультатЗапросаПоСотрудникам.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Состав.Добавить();
		НоваяСтрока.Контрагент				= Выборка.Контрагент;
		НоваяСтрока.ДоговорВзаиморасчетов	= Выборка.ДоговорВзаиморасчетов;
		Если Объект.ВалютаДокумента=НоваяСтрока.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов Тогда
			НоваяСтрока.СуммаРасход = -Выборка.СуммаОстаток;
		ИначеЕсли Объект.ВалютаДокумента=ВалютаБаз Тогда
			НоваяСтрока.СуммаРасход = -Выборка.СуммаБазОстаток;
		ИначеЕсли Объект.ВалютаДокумента=ВалютаУпр Тогда
			НоваяСтрока.СуммаРасход = -Выборка.СуммаУпрОстаток;
		Иначе
			НоваяСтрока.СуммаРасход = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(-Выборка.СуммаОстаток, НоваяСтрока.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов, Объект.Дата, Объект.ВалютаДокумента, Объект.КурсДокумента);
		КонецЕсли; 
		СоставДоговорВзаиморасчетовПриИзменении(Объект, НоваяСтрока, ПараметрыДействия);
		НоваяСтрока.АвтозакрытиеСделок		= Истина;
	КонецЦикла;
	
КонецФункции // СотрудникиЗаполнитьПоТекущейЗадолженности()

#КонецЕсли