#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьЗначениеВЕТИС(РольПроизводителя) Экспорт
	
	ИндексЗначения = Перечисления.РолиПроизводителяВЕТИС.Индекс(РольПроизводителя);
	
	Результат = Метаданные.Перечисления.РолиПроизводителяВЕТИС.ЗначенияПеречисления[ИндексЗначения].Имя;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначение(РольПроизводителя) Экспорт
	
	Результат = Неопределено;
	
	ЗначениеПеречисления = Метаданные.Перечисления.РолиПроизводителяВЕТИС.ЗначенияПеречисления.Найти(РольПроизводителя);
	Если Не ЗначениеПеречисления = Неопределено Тогда
		ИндексЗначения = Метаданные.Перечисления.РолиПроизводителяВЕТИС.ЗначенияПеречисления.Индекс(ЗначениеПеречисления);
		Результат = Перечисления.РолиПроизводителяВЕТИС[ИндексЗначения];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли