/////////////////////////////////////////////////////////////////////////////////////////////////////
// ЗАЩИЩЕННЫЕ ФУНКЦИИ СЕРВЕРНОГО КОНТЕКСТА
/////////////////////////////////////////////////////////////////////////////////////////////////////


/////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ФУНКЦИИ ЗАЩИТЫ

// Получение имени защищенной обработки по умолчанию
//
Функция ПолучитьИмяЗащищеннойОбработкиПоУмолчанию() Экспорт

	ИмяОбработки="ХранилищеЗащищеннойОбработки.ПараметрыЛицензирования.ЗащитаТОР";
	Возврат ИмяОбработки;

КонецФункции // ПолучитьИмяЗащищеннойОбработкиПоУмолчанию()

// Процедура проверки системы защиты
Процедура ПроверитьЗащиту(Знач ИмяЗащищеннойОбработки=Неопределено) Экспорт
	
	Если ИмяЗащищеннойОбработки=Неопределено Тогда
		ИмяЗащищеннойОбработки=ПолучитьИмяЗащищеннойОбработкиПоУмолчанию();
	КонецЕсли; 
	
	// Проверим лицензию на сервере лицензирования
	Обработка=ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку(ИмяЗащищеннойОбработки);
	Обработка.ПроверитьЗащиту();
	
КонецПроцедуры //ПроверитьЗащиту()

// Проверка бита лицензирования
Функция ПроверитьБитМаски(Бит,Знач ИмяЗащищеннойОбработки=Неопределено) Экспорт 
	
	Если ИмяЗащищеннойОбработки=Неопределено Тогда
		ИмяЗащищеннойОбработки=ПолучитьИмяЗащищеннойОбработкиПоУмолчанию();
	КонецЕсли; 
	
	Обработка=ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку(ИмяЗащищеннойОбработки);
	Возврат Обработка.ПроверитьБитМаски(Бит);
	
КонецФункции //ПроверитьБитМаски()

// Проверка бита лицензирования
Функция ПолучитьЗащищеннуюОбработку(Знач ИмяЗащищеннойОбработки=Неопределено) Экспорт 
	
	Если БезопасныйРежим() Тогда
		УстановитьОтключениеБезопасногоРежима(Истина);
	КонецЕсли;
	
	Если ИмяЗащищеннойОбработки=Неопределено Тогда
		ИмяЗащищеннойОбработки=ПолучитьИмяЗащищеннойОбработкиПоУмолчанию();
	КонецЕсли;
	
	Попытка
		РежимОтладкиЗащиты=ПараметрыСеанса.РежимОтладкиЗащиты;
	Исключение
		РежимОтладкиЗащиты=Ложь;
	КонецПопытки;
	
	Если РежимОтладкиЗащиты Тогда
		ИмяОбработки=ИмяЗащищеннойОбработки;
		ПозицияРазделителя=СтрНайти(ИмяОбработки,".");
		Пока ПозицияРазделителя<>0 Цикл
			ИмяОбработки=Сред(ИмяОбработки,ПозицияРазделителя+1);
			ПозицияРазделителя=СтрНайти(ИмяОбработки,".");
		КонецЦикла;  
		Если Метаданные.Обработки.Найти(ИмяОбработки)<>Неопределено Тогда
			Обработка=Обработки[ИмяОбработки].Создать();
		Иначе
			Обработка=ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку(ИмяЗащищеннойОбработки);
		КонецЕсли; 
	Иначе
		Обработка=ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку(ИмяЗащищеннойОбработки);
	КонецЕсли; 
	
	Возврат Обработка;
	
КонецФункции //ПолучитьЗащищеннуюОбработку()


////////////////////////////////////////////////////////////////////////////////
// ЗАЩИЩЕННЫЕ СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Позволяет определить есть ли среди реквизитов шапки документа
// реквизит с переданным именем.
//
// Параметры: 
//  Ссылка            - Ссылка на объект, среди реквизитов которого производится поиск.
//  ИмяРеквизита      - строковое имя искомого реквизита.
//  ИмяТабличнойЧасти - строковое имя табличной части документа, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьРеквизитВСтруктуреДанных(Объект, ИмяРеквизита=Неопределено, ИмяТабличнойЧасти=Неопределено)
	
	// Получим признак необходимости произвести дополнительную проверку
	ИерархическийОбъект = Объект.Свойство("Ссылка") И Объект.Свойство("ЭтоГруппа");
	
	// Если не указана табличная часть, то ищем реквизит шапки
	Если ИмяТабличнойЧасти=Неопределено Тогда
		
		// Проверяем, имеется ли указанный реквизит
		Если НЕ Объект.Свойство(ИмяРеквизита) Тогда
			Возврат ЛОЖЬ;
		КонецЕсли;
		
		Если НЕ ИерархическийОбъект ИЛИ СтрНайти(",Владелец,Родитель,ЭтоГруппа,", ","+ИмяРеквизита+",") Тогда
			Возврат ИСТИНА;
		КонецЕсли;
		
		// Получим описание метаданных переданного объекта и его реквизита
		ОбъектМетаданных          = Метаданные.НайтиПоТипу(ТипЗнч(Объект.Ссылка));
		ОбъектМетаданныхРеквизита = ОбъектМетаданных.Реквизиты.Найти(ИмяРеквизита);
		
		// Обработаем в зависимости от результата поиска
		Если ОбъектМетаданныхРеквизита=Неопределено Тогда
			
			// Проверим стандартные реквизиты
			Если ОбщегоНазначения.ЭтоСтандартныйРеквизит(ОбъектМетаданных.СтандартныеРеквизиты, ИмяРеквизита) Тогда
				Возврат ИСТИНА;
			КонецЕсли;
			
			// Производим поиск проверяемого реквизита среди общих реквизит
			ОбъектМетаданныхРеквизита = Метаданные.ОбщиеРеквизиты.Найти(ИмяРеквизита);
			
			Если ОбъектМетаданныхРеквизита=Неопределено Тогда
				Возврат ЛОЖЬ;
			Иначе
				// !!!_view Особенность платформы. Нельзя общий реквизит назначить только группе или элементу.
				// Исправить после изменения поведения платформы.
				ЗначениеСостава = ОбъектМетаданныхРеквизита.Состав.Найти(ОбъектМетаданных);
				Возврат ((НЕ ЗначениеСостава=Неопределено) И ЗначениеСостава.Использование=Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать);
			КонецЕсли;
			
		Иначе
			// Выполняем проверку с учетом имеющегося признака типа элемента
			Возврат ПроверитьИспользованиеРеквизитаДляОбъекта(ОбъектМетаданных, ОбъектМетаданныхРеквизита, Объект);
		КонецЕсли;
		
	Иначе
		
		// Проверяем, имеется ли указанная табличная часть
		Если НЕ Объект.Свойство(ИмяТабличнойЧасти) Тогда
			Возврат ЛОЖЬ;
		КонецЕсли;
		Если ТипЗнч(Объект[ИмяТабличнойЧасти])<>Тип("ДанныеФормыКоллекция") Тогда
			Возврат ЛОЖЬ;
		КонецЕсли;
		
		Если ИерархическийОбъект Тогда
			
			// Получим описание метаданных переданного объекта и его табличной части
			ОбъектМетаданных        = Метаданные.НайтиПоТипу(ТипЗнч(Объект.Ссылка));
			ОбъектМетаданныхТаблицы = ОбъектМетаданных.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
			
			// Выполняем проверку с учетом имеющегося признака типа элемента
			Если НЕ ПроверитьИспользованиеРеквизитаДляОбъекта(ОбъектМетаданных, ОбъектМетаданныхТаблицы, Объект) Тогда
				Возврат ЛОЖЬ;
			КонецЕсли;
			
		КонецЕсли;
		
		// При проверке только на наличие т/ч можно не продолжать
		Если ИмяРеквизита=Неопределено Тогда
			Возврат ИСТИНА;
		КонецЕсли;
		
		// Получим перечень колонок т/ч и найдем среди них искомую
		СтруктураТаблицы = Объект[ИмяТабличнойЧасти].Выгрузить(Новый Массив);
		Возврат (НЕ СтруктураТаблицы.Колонки.Найти(ИмяРеквизита)=Неопределено);
		
	КонецЕсли;
	
КонецФункции // ЕстьРеквизитВСтруктуреДанных()

// Позволяет определить есть ли среди реквизитов шапки документа
// реквизит с переданным именем.
//
// Параметры: 
//  Ссылка            - Ссылка на объект, среди реквизитов которого производится поиск.
//  ИмяРеквизита      - строковое имя искомого реквизита.
//  ИмяТабличнойЧасти - строковое имя табличной части документа, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьРеквизитФормы(Объект, ИмяРеквизита=Неопределено, ИмяТабличнойЧасти=Неопределено)
	
	РеквизитыФормы   = Объект.ПолучитьРеквизиты();
	МассивРеквизитов = Новый Массив;
	Для Каждого ТекРеквизит Из РеквизитыФормы Цикл
		МассивРеквизитов.Добавить(ТекРеквизит.Имя);
	КонецЦикла;
	
	// Если не указана табличная часть, то ищем общий реквизит
	Если ИмяТабличнойЧасти = Неопределено Тогда
		Возврат (НЕ МассивРеквизитов.Найти(ИмяРеквизита) = Неопределено);
	КонецЕсли;
	
	ТабличнаяЧасть = МассивРеквизитов.Найти(ИмяТабличнойЧасти);
	Если ТабличнаяЧасть = Неопределено Тогда // Нет такой таб. части в документе
		Результат = Ложь;
	ИначеЕсли ИмяРеквизита = Неопределено Тогда
		Результат = Истина;
	Иначе
		РеквизитыФормы   = Объект.ПолучитьРеквизиты(ТабличнаяЧасть);
		МассивРеквизитов = Новый Массив;
		Для Каждого ТекРеквизит Из РеквизитыФормы Цикл
			МассивРеквизитов.Добавить(ТекРеквизит.Имя);
		КонецЦикла;
		Результат = (НЕ МассивРеквизитов.Найти(ИмяРеквизита) = Неопределено);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ЕстьРеквизитФормы()

// Функция производит проверку установленного варианта использования реквизита для переданного объекта.
//
Функция ПроверитьИспользованиеРеквизитаДляОбъекта(ОбъектМетаданных, ОбъектМетаданныхРеквизита, Объект)
	
	// Проверка имеет смысл только для объектов которые могут содержать иерархию
	Если (Метаданные.Справочники.Содержит(ОбъектМетаданных) И ОбъектМетаданных.Иерархический) ИЛИ Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) Тогда
		
		// Для иерархических объектов определим в зависимости от вида переданного объекта
		Если ОбъектМетаданныхРеквизита.Использование=Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппыИЭлемента Тогда
			Возврат ИСТИНА;
			
		ИначеЕсли ОбъектМетаданныхРеквизита.Использование=Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента Тогда
			Возврат НЕ Объект.ЭтоГруппа;
			
		ИначеЕсли ОбъектМетаданныхРеквизита.Использование=Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы Тогда
			Возврат Объект.ЭтоГруппа;
		КонецЕсли;
		
	Иначе
		Возврат ИСТИНА;
	КонецЕсли;
	
КонецФункции // ПроверитьИспользованиеРеквизитаДляОбъекта()

// Позволяет определить есть ли среди реквизитов объекта реквизит с переданным именем.
//
// Параметры:
//  Объект            - Объект, среди реквизитов которого производится поиск.
//  ИмяРеквизита      - Строковое имя искомого реквизита.
//  ИмяТабличнойЧасти - Строковое имя табличной части документа, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Истина - Нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьРеквизитЗащита(Объект, ИмяРеквизита, ИмяТабличнойЧасти) Экспорт
	
	Если Объект = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Объект)=Тип("Структура") Тогда
		Если ИмяТабличнойЧасти=Неопределено Тогда
			Возврат Объект.Свойство(ИмяРеквизита);
		ИначеЕсли Объект.Свойство(ИмяТабличнойЧасти) Тогда
			Возврат ЕстьРеквизит(Объект[ИмяТабличнойЧасти], ИмяРеквизита);
		Иначе
			Возврат ЛОЖЬ;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Объект)=Тип("ТаблицаЗначений") ИЛИ ТипЗнч(Объект)=Тип("ДеревоЗначений") Тогда
		Возврат (Объект.Колонки.Найти(ИмяРеквизита) <> Неопределено);
	КонецЕсли;
	
	Если ТипЗнч(Объект)=Тип("СтрокаТаблицыЗначений") ИЛИ ТипЗнч(Объект)=Тип("СтрокаДереваЗначений") Тогда
		Возврат (Объект.Владелец().Колонки.Найти(ИмяРеквизита) <> Неопределено);
	КонецЕсли;
	
	Если ТипЗнч(Объект)=Тип("ДанныеФормыСтруктура") Тогда
		Возврат ЕстьРеквизитВСтруктуреДанных(Объект, ИмяРеквизита, ИмяТабличнойЧасти);
	КонецЕсли;
	
	Если ТипЗнч(Объект)=Тип("ДанныеФормыЭлементКоллекции") Тогда
		Возврат Объект.Свойство(ИмяРеквизита);
	КонецЕсли;
	
	Если ТипЗнч(Объект)=Тип("УправляемаяФорма") Тогда
		Возврат ЕстьРеквизитФормы(Объект, ИмяРеквизита, ИмяТабличнойЧасти);
	КонецЕсли;
	
	// Получим описание объекта метаданных
	Если ТипЗнч(Объект)=Тип("ОбъектМетаданных") Тогда
		ОбъектМетаданных = Объект;
	Иначе
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Объект));
	КонецЕсли;
	
	// Если не указана табличная часть, то ищем как реквизит
	Если ИмяТабличнойЧасти=Неопределено Тогда
		
		// Получим описание объекта метаданных проверяемого реквизита
		Если Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
			ОбъектМетаданныхРеквизита = ОбъектМетаданных.СтандартныеРеквизиты[ИмяРеквизита];
		Иначе
			ОбъектМетаданныхРеквизита = ОбъектМетаданных.Реквизиты.Найти(ИмяРеквизита);
		КонецЕсли;
		
		// Обработаем в зависимости от результата поиска
		Если ОбъектМетаданныхРеквизита=Неопределено Тогда
			
			// Производим поиск проверяемого реквизита среди общих реквизит
			ОбъектМетаданныхРеквизита = Метаданные.ОбщиеРеквизиты.Найти(ИмяРеквизита);
			
			Если ОбъектМетаданныхРеквизита=Неопределено Тогда
				Возврат ЛОЖЬ;
			Иначе
				// !!!_view Особенность платформы. Нельзя общий реквизит назначить только группе или элементу.
				// Исправить после изменения поведения платформы.
				ЗначениеСостава = ОбъектМетаданныхРеквизита.Состав.Найти(ОбъектМетаданных);
				Возврат ((НЕ ЗначениеСостава=Неопределено) И ЗначениеСостава.Использование=Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать);
			КонецЕсли;
		ИначеЕсли ТипЗнч(Объект) = Тип("ОбъектМетаданных") Тогда
			Возврат Истина;
		Иначе
			Возврат ПроверитьИспользованиеРеквизитаДляОбъекта(ОбъектМетаданных, ОбъектМетаданныхРеквизита, Объект);
		КонецЕсли;
		
	Иначе
		
		// Получим описание объекта метаданных указанной табличной части
		ОбъектМетаданныхТаблицы = ОбъектМетаданных.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
		
		// Обработаем в зависимости от параметров проверки
		Если ОбъектМетаданныхТаблицы=Неопределено Тогда
			Возврат ЛОЖЬ;
			
		ИначеЕсли ТипЗнч(Объект)<>Тип("ОбъектМетаданных") И НЕ ПроверитьИспользованиеРеквизитаДляОбъекта(ОбъектМетаданных, ОбъектМетаданныхТаблицы, Объект) Тогда
			Возврат ЛОЖЬ;
			
		ИначеЕсли ИмяРеквизита=Неопределено Тогда
			Возврат ИСТИНА;
			
		Иначе
			Возврат (НЕ ОбъектМетаданныхТаблицы.Реквизиты.Найти(ИмяРеквизита)=Неопределено);
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции // ЕстьРеквизит()

// Производит добавление группы кнопок с указанными параметрами в форму.
//
// Параметры:
//  Форма                 - УправляемаяФорма - Форма, в которую производиться добавление команды.
//  ИмяГруппы             - Строка           - Имя добавляемой группы.
//  ИмяГруппыРодителя     - Строка           - Имя группы в которую следует поместить новый элемент.
//  ВидГруппыПодменю      - Булево           - Определяет вид группы: подменю или группа кнопок.
//  Заголовок             - Строка           - Содержит отображаемый текст группы.
//  Картинка              - Картинка         - Содержит картинку группы (используется только для "Подменю").
//  Подсказка             - Строка           - Содержит подсказку группы.
//  МестоРасположения     - Строка           - Имя элемента, перед которым нужно разместить группу.
//
Функция ДобавитьГруппуКоманд(Форма, ИмяГруппы, ИмяГруппыРодителя, ВидГруппыПодменю=ИСТИНА, Заголовок=Неопределено, Картинка=Неопределено, Подсказка=Неопределено, МестоРасположения=Неопределено, Отображение=Неопределено) Экспорт
	
	Возврат ПолучитьЗащищеннуюОбработку().ДобавитьГруппуКоманд(Форма, ИмяГруппы, ИмяГруппыРодителя, ВидГруппыПодменю, Заголовок, Картинка, Подсказка, МестоРасположения, Отображение);
	
КонецФункции // ДобавитьГруппуКоманд()

// Производит добавление команды с указанными параметрами в форму.
//
// Параметры:
//  Форма                 - УправляемаяФорма  - Форма, в которую производиться добавление команды.
//  ИмяКоманды            - Строка            - Имя добавляемой команды.
//  ИмяГруппы             - Строка            - Имя группы в которую следует поместить команду.
//  Картинка              - Картинка          - Содержит картинку команды.
//  Заголовок             - Строка            - Содержит отображаемый текст команды.
//  Подсказка             - Строка            - Содержит подсказку команды.
//  ТолькоВоВсехДействиях - Булево            - Указывает, следует ли скрывать кнопку в подменю "Все действия".
//  МестоРасположения     - Строка            - Имя элемента, перед которым нужно разместить команду.
//  Действие              - Строка            - Содержит имя процедуры обработчика команды.
//  Отображение           - ОтображениеКнопки - Указывает вид отображения связанной кнопки по умолчанию.
//  Суффикс               - Строка            - Суффикс будет добавлен к имени создаваемой кнопки.
//  ИзменяетСохраняемыеДанные - Булево        - Признак того, что выполнение команды может привести к изменению данных.
//
Функция ДобавитьКоманду(Форма, ИмяКоманды, ИмяГруппы, Картинка=Неопределено, Заголовок=Неопределено, Подсказка=Неопределено, ТолькоВоВсехДействиях=ИСТИНА, МестоРасположения=Неопределено, Действие="Подключаемый_ОбработкаКомандыФормы", Отображение=Неопределено, Суффикс="", СочетаниеКлавиш = Неопределено, ИзменяетСохраняемыеДанные=ЛОЖЬ, Доступность=ИСТИНА) Экспорт
	
	Возврат ПолучитьЗащищеннуюОбработку().ДобавитьКоманду(Форма, ИмяКоманды, ИмяГруппы, Картинка, Заголовок, Подсказка, ТолькоВоВсехДействиях, МестоРасположения, Действие, Отображение, Суффикс, СочетаниеКлавиш, ИзменяетСохраняемыеДанные, Доступность);
	
КонецФункции // ДобавитьКоманду()

// Размещает команды заполнения на форме.
//
Процедура ИнициализироватьКомандыЗаполнения(Форма, Объект = Неопределено) Экспорт
	
	ПолучитьЗащищеннуюОбработку().ИнициализироватьКомандыЗаполнения(Форма, Объект);
	
КонецПроцедуры // ДобавитьКомандыЗаполненияТабличнойЧасти()

// Процедура производит инициализацию пунктов меню выбора хозяйственной операции в форме объекта.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура ИнициализироватьМенюВыбораХозОперации(Форма, Объект = Неопределено) Экспорт
	
	ПолучитьЗащищеннуюОбработку().ИнициализироватьМенюВыбораХозОперации(Форма, Объект);
	
КонецПроцедуры // ИнициализироватьМенюВыбораХозОперации()

// Установка/снятие пометок незаполненных реквизитов на формах документа.
//
// Параметры
//  Форма - УправляемаяФорма - Форма, на которой надо расставить пометки незаполненного
//  СписокОбязательныхРеквизитов  - СписокЗначений - Структура обязательных реквизитов
//                                     Если параметр не задан, то обязательные реквизиты будут получены 
//                                     из менеджера объекта
//  СнятиеСтарыхАвтоотметокНезаполненного  - Булево - Признак необходимости снятия пометок у всех элементов формы.
//
Процедура РасставитьАвтоотметкиНезаполненного(Форма, СписокОбязательныхРеквизитов, СнятиеСтарыхАвтоотметокНезаполненного, Объект = Неопределено) Экспорт
	
	ПолучитьЗащищеннуюОбработку().РасставитьАвтоотметкиНезаполненного(Форма,СписокОбязательныхРеквизитов, СнятиеСтарыхАвтоотметокНезаполненного, Объект);
	
КонецПроцедуры // РасставитьАвтоотметкиНезаполненного()

// Процедура производит получение представления расширенных итогов видимости колонки Характеристика
// в зависимости от значения служебных реквизитов.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется формирование представления итогов.
//
Функция ПолучитьПредставленияИтоговОперации(Знач Объект) Экспорт
	
	Возврат ПолучитьЗащищеннуюОбработку().ПолучитьПредставленияИтоговОперации(Объект);
	
КонецФункции // ПолучитьПредставленияИтоговОперации()


////////////////////////////////////////////////////////////////////////////////
// ЗАЩИЩЕННЫЕ ОБРАБОТЧИКИ ЗАПОЛНЕНИЯ

// Общий обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  Объект               - ДокументОбъект- Объект, для которого выполняется обработка события.
//  ДанныеЗаполнения     - Произвольный  - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка        - Текст, используемый для формирования наименования/кода нового элемента.
//  СтандартнаяОбработка - Булево        - В данный параметр передается признак выполнения системной обработки события.
//  ИмяМодуля            - Строка        - Имя модуля в котором описаны процедуры заполнения.
//
Функция ОбработкаЗаполнения(Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, ИменаИсключаемыхРеквизитов,ИмяМодуля) Экспорт
	
	// При открытии формы могут быть переданы готовые данные объекта. Обработка заполнения не имеет смысла.
	Если ТипЗнч(ДанныеЗаполнения)=Тип("Структура") И ДанныеЗаполнения.Свойство("КопироватьДанныеФормы") Тогда
		СтандартнаяОбработка = ЛОЖЬ;
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// Инициализируем параметры действия
	Объект.ДополнительныеСвойства.Вставить("ПараметрыДействия", Новый Структура);
	
	// Составим перечень реквизитов, значения которых не должны копироваться из переданных данных заполнения.
	ИменаИсключаемыхРеквизитов = ИменаИсключаемыхРеквизитов + РаботаВБезопасномРежиме.ВычислитьВБезопасномРежиме(ИмяМодуля + ".ПолучитьИменаИсключаемыхРеквизитов()");
	
	// Произведем кэширование имен исключаемых реквизитов
	Объект.ДополнительныеСвойства.Вставить("ИменаИсключаемыхРеквизитов", ИменаИсключаемыхРеквизитов);
	
	// Произведем заполнение объекта на основании переданных данных
	Если ОбработкаСобытийОбъектаСервер.ВозможенВводНаОсновании(Объект, ДанныеЗаполнения) ИЛИ ТипЗнч(ДанныеЗаполнения)=Тип("СправочникСсылка.Контрагенты") Тогда
		
		// Получим имя объекта на основании которого осуществляется ввод нового
		ИмяОбъектаОснования = ДанныеЗаполнения.Метаданные().Имя;
		
		// Проверим, имеется ли у объекта приватный обработчик заполнения
		Попытка
			ПараметрыВыполненияАлгоритма = Новый Массив;
			ПараметрыВыполненияАлгоритма.Добавить(Неопределено);
			ПараметрыВыполненияАлгоритма.Добавить(ТекстЗаполнения);
			ПараметрыВыполненияАлгоритма.Добавить(ЛОЖЬ);
			
			Результат = РаботаВБезопасномРежиме.ВычислитьВБезопасномРежиме("ОбработкаЗаполнения_"+ИмяОбъектаОснования,ПараметрыВыполненияАлгоритма, Объект);
			ЕстьОбработчикЗаполнения = ИСТИНА;
		Исключение
			ПричинаОшибки = ИнформацияОбОшибке();
			ЕстьОбработчикЗаполнения = ЛОЖЬ;
		КонецПопытки;
		
		// Обработаем в зависимости от наличия у объекта приватного обработчика события
		Если ЕстьОбработчикЗаполнения Тогда
			
			// Установим признак того, что объект заполняется с применением приватного обработчика заполнения.
			Объект.ДополнительныеСвойства.Вставить("ВыполненоЗаполнениеНаОсновании", ИмяОбъектаОснования);
			
			// Вызываем приватный обработчик заполнения
			ПараметрыВыполненияАлгоритма = Новый Массив;
			ПараметрыВыполненияАлгоритма.Добавить(ДанныеЗаполнения);
			ПараметрыВыполненияАлгоритма.Добавить(ТекстЗаполнения);
			ПараметрыВыполненияАлгоритма.Добавить(СтандартнаяОбработка);
			
			Возврат РаботаВБезопасномРежиме.ВычислитьВБезопасномРежиме("ОбработкаЗаполнения_"+ИмяОбъектаОснования,ПараметрыВыполненияАлгоритма, Объект);
	
		Иначе
			
			// Установим признак того, что объект заполняется по общим правилам
			Объект.ДополнительныеСвойства.Вставить("ВыполненоЗаполнениеНаОсновании", Неопределено);
			
			// Вызываем общий обработчик заполнения
			Возврат ОбработкаЗаполненияНаОсновании(Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка,ИменаИсключаемыхРеквизитов,ИмяМодуля);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения)=Тип("Структура") И ПравоПользователя("ЗаполнятьНовыеЭлементыДаннымиИзОтборов") Тогда
		
		// Исключим ситуацию копирования ссылки из отбора в новый объект
		ИменаИсключаемыхРеквизитов = ИменаИсключаемыхРеквизитов + ",Ссылка";
		
		// Установим значения полей на которые был наложен отбор в списке
		ЗаполнитьОбъектНаОснованииОтбора(Объект, ДанныеЗаполнения, ИменаИсключаемыхРеквизитов);

	КонецЕсли;
	
	ПараметрыВыполненияАлгоритма = Новый Массив;
	ПараметрыВыполненияАлгоритма.Добавить(Объект);
	ПараметрыВыполненияАлгоритма.Добавить(ТекстЗаполнения);
	ПараметрыВыполненияАлгоритма.Добавить(Объект.ДополнительныеСвойства.ПараметрыДействия);
	ПараметрыВыполненияАлгоритма.Добавить(ИменаИсключаемыхРеквизитов);
	
	// Производим заполнение реквизитов объекта значениями по умолчанию
	РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(ИмяМодуля + ".ЗаполнитьОбъектПоУмолчанию",ПараметрыВыполненияАлгоритма);
	
	ПараметрыВыполненияАлгоритма = Новый Массив;
	ПараметрыВыполненияАлгоритма.Добавить(Объект);
	ПараметрыВыполненияАлгоритма.Добавить(ДанныеЗаполнения);
	ПараметрыВыполненияАлгоритма.Добавить(ТекстЗаполнения);
	ПараметрыВыполненияАлгоритма.Добавить(СтандартнаяОбработка);
	
	// Производим финальный расчет зависимых показателей объекта
	РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(ИмяМодуля + ".ПослеЗаполнения", ПараметрыВыполненияАлгоритма);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения()

// Общий обработчик события заполнения объекта при вводе на основании существующего.
//
// Параметры:
//  Объект               - ДокументОбъект- Объект, для которого выполняется обработка события.
//  ДанныеЗаполнения     - Произвольный  - Значение, которое используется как основание для заполнения.
//  СтандартнаяОбработка - Булево        - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполненияНаОсновании(Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, ИменаИсключаемыхРеквизитов,ИмяМодуля) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) ИЛИ НЕ СтандартнаяОбработка Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// Проверим возможность производить заполнение на основании переданного объекта
	Если ДанныеЗаполнения.ПометкаУдаления Тогда
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(Объект, НСтр("ru='Запрещено вводить документы на основании помеченных на удаление объектов. Процедура заполнения прервана.'"));
		СтандартнаяОбработка = ЛОЖЬ;
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверим возможность ввода нового документа на основании непроведенного
	МетаданныеДанныеЗаполнения = ДанныеЗаполнения.Метаданные();
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И ОбщегоНазначения.ЭтоДокумент(МетаданныеДанныеЗаполнения) И МетаданныеДанныеЗаполнения.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить
		 И ПравоПользователя("ВводНаОснованииПроведенныхДокументов", Объект) И НЕ ДанныеЗаполнения.Проведен Тогда
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(Объект, НСтр("ru='Ввод на основании непроведенного документа запрещен. Процедура заполнения прервана.'"));
		СтандартнаяОбработка = ЛОЖЬ;
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// Взведем флаг блокировки перерасчета скидок
	Если ЕстьРеквизит(ДанныеЗаполнения, "СкидкаНаценка") И ЕстьРеквизит(Объект, "БлокироватьПерерасчетСкидок") Тогда
		Объект.БлокироватьПерерасчетСкидок = ИСТИНА;
	КонецЕсли;
	
	// Произведем перенос значений дополнительных реквизитов объекта
	Если ЕстьРеквизит(ДанныеЗаполнения,, "ДополнительныеРеквизиты") И ЕстьРеквизит(Объект,, "ДополнительныеРеквизиты") Тогда
		
		РеквизитыЭтогоОбъекта = УправлениеСвойствами.ПолучитьСписокСвойств(Объект, ИСТИНА, ЛОЖЬ);
		Объект.ДополнительныеРеквизиты.Очистить();
		
		Для Каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.ДополнительныеРеквизиты Цикл
			Если НЕ РеквизитыЭтогоОбъекта.Найти(СтрокаТабличнойЧасти.Свойство)=Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Объект.ДополнительныеРеквизиты.Добавить(), СтрокаТабличнойЧасти);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Попробуем заполнить объект на основании данных заполнения в автоматическом режиме.
	Если ИмяМодуля = "ОбработкаСобытийДокументаСервер" Тогда
		
		Если ТипЗнч(ДанныеЗаполнения)=Тип("СправочникСсылка.Контрагенты") Тогда
			
			// Проверим можно производить заполнение на основании переданного объекта
			Если ДанныеЗаполнения.ЭтоГруппа Тогда
				УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(Объект, НСтр("ru='Ввод на основании группы контрагентов невозможен.'"));
				СтандартнаяОбработка = ЛОЖЬ;
				Возврат ЛОЖЬ;
			КонецЕсли;
			
			// Заполним контрагента в новом объекте
			Если ЕстьРеквизит(Объект, "Контрагент") Тогда
				Объект.Контрагент = ДанныеЗаполнения;
			КонецЕсли;
			
		ИначеЕсли ОбработкаСобытийОбъектаСервер.ВозможенВводНаОсновании(Объект, ДанныеЗаполнения) И НЕ ТипЗнч(ДанныеЗаполнения)=Тип("СправочникСсылка.Контрагенты") Тогда
			
			// Получим и расширим перечень реквизитов, значения которых не должны копироваться из переданных данных заполнения.
			ИменаИсключаемыхРеквизитов = ИменаИсключаемыхРеквизитов + ",ХозОперация," + ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "ИменаИсключаемыхРеквизитов", "");
			
			// Заполним документ-основание
			Если ЕстьРеквизит(Объект, "ДокументОснование") Тогда
				Объект.ДокументОснование = ДанныеЗаполнения;
			КонецЕсли;
			
			Если НЕ ЗаполнитьОбъектНаОснованииОбъекта(Объект, ДанныеЗаполнения, ИменаИсключаемыхРеквизитов) Тогда
				Возврат ЛОЖЬ;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяМодуля = "ОбработкаСобытийСправочникаСервер" Тогда
		
		// Получим и расширим перечень реквизитов, значения которых не должны копироваться из переданных данных заполнения.
		ИменаИсключаемыхРеквизитов = ИменаИсключаемыхРеквизитов + "," + ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "ИменаИсключаемыхРеквизитов", "");
		
		// Попробуем заполнить объект на основании данных заполнения в автоматическом режиме.
		Если НЕ ЗаполнитьОбъектНаОснованииОбъекта(Объект, ДанныеЗаполнения, ИменаИсключаемыхРеквизитов) Тогда
			Возврат ЛОЖЬ;
		КонецЕсли
		
	КонецЕсли;
	
	// +sitnid
	
	// определимся с автоматическим закрытием сделок
	Если ЕстьРеквизит(Объект, "АвтоЗакрытиеСделок") И ЕстьРеквизит(Объект, "ДоговорВзаиморасчетов") И ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) Тогда
		
		ЕстьДокументОснование = ЕстьРеквизит(Объект, "ДокументОснование");
		Если (ЕстьДокументОснование И НЕ ЕстьРеквизит(Объект.ДокументОснование, "АвтоЗакрытиеСделок"))
			ИЛИ (ЕстьДокументОснование И ЕстьРеквизит(Объект.ДокументОснование, "ДоговорВзаиморасчетов") И НЕ ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов))
			ИЛИ НЕ ЕстьДокументОснование Тогда
			
			Объект.АвтоЗакрытиеСделок = Объект.ДоговорВзаиморасчетов.АвтоЗакрытиеСделок;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// -sitnid
	
	// Производим дозаполнение объекта значениями по умолчанию
	ПараметрыВыполненияАлгоритма = Новый Массив;
	ПараметрыВыполненияАлгоритма.Добавить(Объект);
	ПараметрыВыполненияАлгоритма.Добавить(ТекстЗаполнения);
	ПараметрыВыполненияАлгоритма.Добавить(Объект.ДополнительныеСвойства.ПараметрыДействия);
	ПараметрыВыполненияАлгоритма.Добавить(ИменаИсключаемыхРеквизитов);
	
	РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(ИмяМодуля + ".ЗаполнитьОбъектПоУмолчанию", ПараметрыВыполненияАлгоритма);
	
	// Производим финальный расчет зависимых показателей объекта
	ПараметрыВыполненияАлгоритма = Новый Массив;
	ПараметрыВыполненияАлгоритма.Добавить(Объект);
	ПараметрыВыполненияАлгоритма.Добавить(ДанныеЗаполнения);
	ПараметрыВыполненияАлгоритма.Добавить(ТекстЗаполнения);
	ПараметрыВыполненияАлгоритма.Добавить(СтандартнаяОбработка);

	РаботаВБезопасномРежиме.ВыполнитьМетодКонфигурации(ИмяМодуля + ".ПослеЗаполнения", ПараметрыВыполненияАлгоритма);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполненияНаОсновании()

// Заполняет реквизиты объекта значениями, полученными в структуре ДанныхЗаполнения.
//	Заполнение возможно только в случае, когда в качестве ДанныхЗаполнения получена структура.
//	Заполнены будут только те реквизиты, для которых в метаданных установлен флаг "ЗаполнятьИзДанныхЗаполнения".
//
//
// Параметры
//  <Объект>  - <СправочникОбъект>, <ДокументОбъект> и т.д. - Заполняемый объект
//  <ДанныеЗаполнения>  - <произвольный тип> - параметр, полученный в ОбработкеЗаполнения объекта.
//
Функция ЗаполнитьОбъектНаОснованииОтбора(Объект, ДанныеЗаполнения, ИменаИсключаемыхРеквизитов, ЗаполнятьВсеРеквизиты=ИСТИНА) Экспорт
	
	Если ДанныеЗаполнения.Количество()=0 Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ОбъектМетаданных = Объект.Метаданные();
	
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) ИЛИ Метаданные.ПланыВидовХарактеристик.Содержит(ОбъектМетаданных) Тогда
		РазличатьГруппыИЭлементы = ОбъектМетаданных.Иерархический;
	Иначе
		РазличатьГруппыИЭлементы = ЛОЖЬ;
	КонецЕсли;
	
	ПоляЗаполнения = Новый Структура;
	
	// Копируем общие реквизиты объекта
	Для Каждого Реквизит Из Метаданные.ОбщиеРеквизиты Цикл
		Если СтрНайти(ВРег(ИменаИсключаемыхРеквизитов), ВРег(Реквизит.Имя))=0 И ЕстьРеквизит(Объект, Реквизит.Имя) И (ЗаполнятьВсеРеквизиты ИЛИ Реквизит.ЗаполнятьИзДанныхЗаполнения) И ЕстьРеквизит(ДанныеЗаполнения, Реквизит.Имя) Тогда
			ПоляЗаполнения.Вставить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	// Копируем стандартные реквизит объекта
	Для Каждого Реквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
		Если СтрНайти(ВРег(ИменаИсключаемыхРеквизитов), ВРег(Реквизит.Имя))=0 И (ЗаполнятьВсеРеквизиты ИЛИ Реквизит.ЗаполнятьИзДанныхЗаполнения) И ЕстьРеквизит(ДанныеЗаполнения, Реквизит.Имя) Тогда
			ПоляЗаполнения.Вставить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	// Копируем реквизиты шапки объекта
	Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
		Если СтрНайти(ВРег(ИменаИсключаемыхРеквизитов), ВРег(Реквизит.Имя))=0 И (ЗаполнятьВсеРеквизиты ИЛИ Реквизит.ЗаполнятьИзДанныхЗаполнения) И ЕстьРеквизит(ДанныеЗаполнения, Реквизит.Имя) Тогда
			Если РазличатьГруппыИЭлементы Тогда
				Если (Объект.ЭтоГруппа И Реквизит.Использование <> Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента)
					ИЛИ (НЕ Объект.ЭтоГруппа И Реквизит.Использование <> Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы) Тогда
					ПоляЗаполнения.Вставить(Реквизит.Имя);
				КонецЕсли;
			Иначе
				ПоляЗаполнения.Вставить(Реквизит.Имя);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Реквизит Из ПоляЗаполнения Цикл
		
		ЗначениеЗаполнения = ДанныеЗаполнения[Реквизит.Ключ];
		
		Если ТипЗнч(ЗначениеЗаполнения)=Тип("Массив") ИЛИ ТипЗнч(ЗначениеЗаполнения)=Тип("ФиксированныйМассив") Тогда
			Объект[Реквизит.Ключ] = ЗначениеЗаполнения[0];
		Иначе
			Объект[Реквизит.Ключ] = ЗначениеЗаполнения;
		КонецЕсли;
		
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ЗаполнитьОбъектНаОснованииОтбора()

// Заполняет реквизиты объекта значениями другого объекта из ДанныхЗаполнения.
//
// Параметры
//  <Объект>  - <СправочникОбъект>, <ДокументОбъект> и т.д. - Заполняемый объект
//  <ДанныеЗаполнения>  - <СправочникОбъект>, <ДокументОбъект> и т.д. - 
//																		Объект, полученный в ОбработкеЗаполнения объекта.
//
Функция ЗаполнитьОбъектНаОснованииОбъекта(Объект, ДанныеЗаполнения, ИменаИсключаемыхРеквизитов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектМетаданных = ДанныеЗаполнения.Метаданные();
	
	// Копируем общие реквизиты объекта
	Для Каждого Реквизит Из Метаданные.ОбщиеРеквизиты Цикл
		Если СтрНайти(ВРег(ИменаИсключаемыхРеквизитов), ВРег(Реквизит.Имя))=0 И ЕстьРеквизит(Объект, Реквизит.Имя) И ЕстьРеквизит(ДанныеЗаполнения, Реквизит.Имя) Тогда
			Объект[Реквизит.Имя] = ДанныеЗаполнения[Реквизит.Имя];
		КонецЕсли;
	КонецЦикла;
	
	// Копируем реквизиты шапки объекта
	Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
		Если СтрНайти(ВРег(ИменаИсключаемыхРеквизитов), ВРег(Реквизит.Имя))=0 И ЕстьРеквизит(Объект, Реквизит.Имя) Тогда
			Объект[Реквизит.Имя] = ДанныеЗаполнения[Реквизит.Имя];
		КонецЕсли;
	КонецЦикла;
	
	// Пройдемся по табличным частям текущего документа и произведем их очистку
	Для Каждого ТабличнаяЧасть Из Объект.Метаданные().ТабличныеЧасти Цикл
		Если СтрНайти(ВРег(ИменаИсключаемыхРеквизитов), ВРег(ТабличнаяЧасть.Имя))=0 Тогда
			Объект[ТабличнаяЧасть.Имя].Очистить();
		КонецЕсли;
	КонецЦикла;
	
	// Копируем содержимое табличных частей
	Для Каждого ТабличнаяЧасть Из ОбъектМетаданных.ТабличныеЧасти Цикл
		
		Если НЕ ЕстьРеквизит(Объект,, ТабличнаяЧасть.Имя) ИЛИ СтрНайти(ВРег(ИменаИсключаемыхРеквизитов), ВРег(ТабличнаяЧасть.Имя)) > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Идем по строкам и реквизитам табличной части и заполняем соответствующие
		Для Каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения[ТабличнаяЧасть.Имя] Цикл
			
			НоваяСтрока = Объект[ТабличнаяЧасть.Имя].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти,, "НомерСтроки");
			
			Если ЕстьРеквизит(Объект, "КоличествоБазовое", ТабличнаяЧасть.Имя) И НЕ ЗначениеЗаполнено(НоваяСтрока.КоличествоБазовое) И ЕстьРеквизит(Объект, "Количество", ТабличнаяЧасть.Имя) И ЕстьРеквизит(Объект, "Коэффициент", ТабличнаяЧасть.Имя) Тогда
				НоваяСтрока.КоличествоБазовое = НоваяСтрока.Количество * НоваяСтрока.Коэффициент;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ЗаполнитьОбъектНаОснованииОбъекта()

// Процедура выполняет заполнение дополнительных реквизитов номенклатуры для указанной табличной части.
//
Процедура ЗаполнитьСлужебныеРеквизитыТабличнойЧасти(ТабличнаяЧасть, СуффиксКолонок = "") Экспорт
	
	ПолучитьЗащищеннуюОбработку().ЗаполнитьСлужебныеРеквизитыТабличнойЧасти(ТабличнаяЧасть, СуффиксКолонок);
	
КонецПроцедуры // ЗаполнитьСлужебныеРеквизитыТабличнойЧасти()

// Процедура выполняет заполнение дополнительных реквизитов алкогольной продукции для указанной табличной части.
//
Процедура ЗаполнитьРеквизитАлкогольнойПродукции(Объект, ТабличнаяЧасть, ТабличнаяЧастьМарки) Экспорт
	
	Запрос = Новый Запрос;
	
	//ЕстьКоэффициентАлкогольнойПродукции = Ложь;
	// Проверим нужно ли делать сопоставление
	ЕстьУпаковки = Ложь;
	Если ЕстьРеквизит(Объект,"Номенклатура", "Товары") Тогда
		Если ЕстьРеквизит(Объект, "ПредставлениеУпаковок", "Товары") Тогда
			ЕстьУпаковки = Истина;
			ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ВЫРАЗИТЬ(ТабличнаяЧасть.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
			|	ВЫРАЗИТЬ(ТабличнаяЧасть.АлкогольнаяПродукция КАК Справочник.КлассификаторАлкогольнойПродукцииЕГАИС) КАК АлкогольнаяПродукция,
			|	ВЫРАЗИТЬ(ТабличнаяЧасть.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
			|	ТабличнаяЧасть.ИдентификаторСтроки КАК ИдентификаторСтроки
			|ПОМЕСТИТЬ ТЧАлкогольнаяПродукция
			|ИЗ
			|	&ТабличнаяЧасть КАК ТабличнаяЧасть
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабличнаяЧастьМарки.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	1 КАК Количество
			|ПОМЕСТИТЬ ВремТЧМарки
			|ИЗ
			|	&ТабличнаяЧастьМарки КАК ТабличнаяЧастьМарки
			|ГДЕ
			|	ТабличнаяЧастьМарки.ИдентификаторСтроки <> """"
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабличнаяЧастьМарки.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	СУММА(ТабличнаяЧастьМарки.Количество) КАК Количество
			|ПОМЕСТИТЬ ТЧМарки
			|ИЗ
			|	ВремТЧМарки КАК ТабличнаяЧастьМарки
			|СГРУППИРОВАТЬ ПО
			|	ТабличнаяЧастьМарки.ИдентификаторСтроки
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабличнаяЧастьУпаковки.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	ТабличнаяЧастьУпаковки.МаркировкаГруппыУпаковок КАК МаркировкаГруппыУпаковок
			|ПОМЕСТИТЬ ВремТЧУпаковки
			|ИЗ
			|	&ТабличнаяЧастьУпаковки КАК ТабличнаяЧастьУпаковки
			|ГДЕ
			|	ТабличнаяЧастьУпаковки.ИдентификаторСтроки <> """" И 
			|	ТабличнаяЧастьУпаковки.УровеньВложенности = 1
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабличнаяЧастьУпаковки.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТабличнаяЧастьУпаковки.МаркировкаГруппыУпаковок) КАК Количество
			|ПОМЕСТИТЬ
			|	ТЧУпаковки
			|ИЗ
			|	ВремТЧУпаковки КАК ТабличнаяЧастьУпаковки
			|СГРУППИРОВАТЬ ПО
			|	ТабличнаяЧастьУпаковки.ИдентификаторСтроки
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТЧАлкогольнаяПродукция.НомерСтроки - 1 КАК ИндексСтроки,
			|	ЕСТЬNULL(ТЧАлкогольнаяПродукция.АлкогольнаяПродукция.ВидПродукции.Маркируемый, ЛОЖЬ) КАК Маркируемая,
			|	ЕСТЬNULL(ТЧМарки.Количество, 0) КАК КоличествоМарок,
			|	ЕСТЬNULL(ТЧУпаковки.Количество, 0) КАК КоличествоУпаковок,
			|	ТЧАлкогольнаяПродукция.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ТчТовары
			|ИЗ
			|	ТЧАлкогольнаяПродукция КАК ТЧАлкогольнаяПродукция
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	ТЧМарки КАК ТЧМарки
			|ПО
			|	ТЧАлкогольнаяПродукция.ИдентификаторСтроки = ТЧМарки.ИдентификаторСтроки
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	ТЧУпаковки КАК ТЧУпаковки
			|ПО
			|	ТЧАлкогольнаяПродукция.ИдентификаторСтроки = ТЧУпаковки.ИдентификаторСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция, ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)) КАК АлкогольнаяПродукция,
			//|	ВЫБОР
			//|		КОГДА СоответствиеНоменклатурыЕГАИС.КоэффициентАлкогольнойПродукции ЕСТЬ NULL ИЛИ 
			//|			СоответствиеНоменклатурыЕГАИС.КоэффициентАлкогольнойПродукции = 0 ТОГДА
			//|			1
			//|		ИНАЧЕ
			//|			СоответствиеНоменклатурыЕГАИС.КоэффициентАлкогольнойПродукции
			//|	КОНЕЦ КАК КоэффициентАлкогольнойПродукции,
			|	ТчТовары.ИндексСтроки КАК ИндексСтроки,
			|	ТчТовары.Маркируемая КАК Маркируемая,
			|	ТчТовары.КоличествоМарок КАК КоличествоМарок,
			|	ТчТовары.КоличествоУпаковок КАК КоличествоУпаковок
			|ИЗ
			|	ТчТовары КАК ТчТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
			|		ПО ТчТовары.Номенклатура = СоответствиеНоменклатурыЕГАИС.Номенклатура
			|ИТОГИ
			|	МАКСИМУМ(Маркируемая),
			|	МАКСИМУМ(КоличествоМарок),
			|	МАКСИМУМ(КоличествоУпаковок)
			|ПО
			|	ИндексСтроки";
			Запрос.УстановитьПараметр("ТабличнаяЧасть", ТабличнаяЧасть.Выгрузить( ,"НомерСтроки, Номенклатура, АлкогольнаяПродукция, ИдентификаторСтроки"));
			Запрос.УстановитьПараметр("ТабличнаяЧастьУпаковки", Объект.Упаковки.Выгрузить( ,",ИдентификаторСтроки, МаркировкаГруппыУпаковок, УровеньВложенности"));
		Иначе
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ВЫРАЗИТЬ(ТабличнаяЧасть.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
			|	ВЫРАЗИТЬ(ТабличнаяЧасть.АлкогольнаяПродукция КАК Справочник.КлассификаторАлкогольнойПродукцииЕГАИС) КАК АлкогольнаяПродукция,
			|	ВЫРАЗИТЬ(ТабличнаяЧасть.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
			|	ТабличнаяЧасть.ИдентификаторСтроки КАК ИдентификаторСтроки
			|ПОМЕСТИТЬ ТЧАлкогольнаяПродукция
			|ИЗ
			|	&ТабличнаяЧасть КАК ТабличнаяЧасть
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабличнаяЧастьМарки.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	1 КАК Количество
			|ПОМЕСТИТЬ ВремТЧМарки
			|ИЗ
			|	&ТабличнаяЧастьМарки КАК ТабличнаяЧастьМарки
			|ГДЕ
			|	ТабличнаяЧастьМарки.ИдентификаторСтроки <> """"
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабличнаяЧастьМарки.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	СУММА(ТабличнаяЧастьМарки.Количество) КАК Количество
			|ПОМЕСТИТЬ ТЧМарки
			|ИЗ
			|	ВремТЧМарки КАК ТабличнаяЧастьМарки
			|СГРУППИРОВАТЬ ПО
			|	ТабличнаяЧастьМарки.ИдентификаторСтроки
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТЧАлкогольнаяПродукция.НомерСтроки - 1 КАК ИндексСтроки,
			|	ЕСТЬNULL(ТЧАлкогольнаяПродукция.АлкогольнаяПродукция.ВидПродукции.Маркируемый, ЛОЖЬ) КАК Маркируемая,
			|	ЕСТЬNULL(ТЧМарки.Количество, 0) КАК КоличествоМарок,
			|	ТЧАлкогольнаяПродукция.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ
			|	ТчТовары
			|ИЗ
			|	ТЧАлкогольнаяПродукция КАК ТЧАлкогольнаяПродукция
			|ЛЕВОЕ СОЕДИНЕНИЕ ТЧМарки КАК ТЧМарки
			|ПО
			|	ТЧАлкогольнаяПродукция.ИдентификаторСтроки = ТЧМарки.ИдентификаторСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция, ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)) КАК АлкогольнаяПродукция,
			//|	ВЫБОР
			//|		КОГДА СоответствиеНоменклатурыЕГАИС.КоэффициентАлкогольнойПродукции ЕСТЬ NULL ИЛИ 
			//|			СоответствиеНоменклатурыЕГАИС.КоэффициентАлкогольнойПродукции = 0 ТОГДА
			//|			1
			//|		ИНАЧЕ
			//|			СоответствиеНоменклатурыЕГАИС.КоэффициентАлкогольнойПродукции
			//|	КОНЕЦ КАК КоэффициентАлкогольнойПродукции,
			|	ТчТовары.ИндексСтроки КАК ИндексСтроки,
			|	ТчТовары.Маркируемая КАК Маркируемая,
			|	ТчТовары.КоличествоМарок КАК КоличествоМарок
			|ИЗ
			|	ТчТовары КАК ТчТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
			|		ПО ТчТовары.Номенклатура = СоответствиеНоменклатурыЕГАИС.Номенклатура
			|ИТОГИ
			|	МАКСИМУМ(Маркируемая),
			|	МАКСИМУМ(КоличествоМарок)
			|ПО
			|	ИндексСтроки";
			Запрос.УстановитьПараметр("ТабличнаяЧасть", ТабличнаяЧасть.Выгрузить( ,"НомерСтроки, Номенклатура, АлкогольнаяПродукция,ИдентификаторСтроки"));
			//ЕстьКоэффициентАлкогольнойПродукции = ЕстьРеквизит(Объект,"КоэффициентАлкогольнойПродукции","Товары");
		КонецЕсли;
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТабличнаяЧасть.НомерСтроки КАК ЧИСЛО) КАК НомерСтроки,
		|	ВЫРАЗИТЬ(ТабличнаяЧасть.АлкогольнаяПродукция КАК Справочник.КлассификаторАлкогольнойПродукцииЕГАИС) КАК АлкогольнаяПродукция,
		|	ТабличнаяЧасть.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ПОМЕСТИТЬ ТЧАлкогольнаяПродукция
		|ИЗ
		|	&ТабличнаяЧасть КАК ТабличнаяЧасть
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабличнаяЧастьМарки.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	1 КАК Количество
		|ПОМЕСТИТЬ ВремТЧМарки
		|ИЗ
		|	&ТабличнаяЧастьМарки КАК ТабличнаяЧастьМарки
		|ГДЕ
		|	ТабличнаяЧастьМарки.ИдентификаторСтроки <> """"
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабличнаяЧастьМарки.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СУММА(ТабличнаяЧастьМарки.Количество) КАК Количество
		|ПОМЕСТИТЬ ТЧМарки
		|ИЗ
		|	ВремТЧМарки КАК ТабличнаяЧастьМарки
		|СГРУППИРОВАТЬ ПО
		|	ТабличнаяЧастьМарки.ИдентификаторСтроки
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧАлкогольнаяПродукция.НомерСтроки - 1 КАК ИндексСтроки,
		|	ЕСТЬNULL(ТЧАлкогольнаяПродукция.АлкогольнаяПродукция.ВидПродукции.Маркируемый, ЛОЖЬ) КАК Маркируемая,
		|	ЕСТЬNULL(ТЧМарки.Количество, 0) КАК КоличествоМарок
		|ИЗ
		|	ТЧАлкогольнаяПродукция КАК ТЧАлкогольнаяПродукция
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ТЧМарки КАК ТЧМарки
		|ПО
		|	ТЧАлкогольнаяПродукция.ИдентификаторСтроки = ТЧМарки.ИдентификаторСтроки
		|";
		
		Запрос.УстановитьПараметр("ТабличнаяЧасть", ТабличнаяЧасть.Выгрузить( ,"НомерСтроки, АлкогольнаяПродукция,ИдентификаторСтроки"));
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТабличнаяЧастьМарки", ТабличнаяЧастьМарки.Выгрузить( ,"КодМарки,ИдентификаторСтроки"));
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		ТекущаяСтрока = ТабличнаяЧасть[Выборка.ИндексСтроки];
		ТекущаяСтрока.Маркируемая = Выборка.Маркируемая;
		
		Если Выборка.КоличествоМарок>0 Тогда
			ТекущаяСтрока.ПредставлениеМарок = "Введено марок: " + Строка(Выборка.КоличествоМарок);
		КонецЕсли;
		
		Если ЕстьУпаковки И Выборка.КоличествоУпаковок>0 Тогда
			ТекущаяСтрока.ПредставлениеУпаковок = "Введено упаковок: " + Строка(Выборка.КоличествоУпаковок);
		КонецЕсли;
		
		Если ТекущаяСтрока.Свойство("ПредставлениеСопоставления") Тогда
			ТекущаяСтрока.СопоставленнаяАлкогольнаяПродукция.Очистить();
			//КоэффициентАлкогольнойПродукции = 0;
			ВыборкаАП = Выборка.Выбрать();
			Пока ВыборкаАП.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаАП.АлкогольнаяПродукция) Тогда
					ТекущаяСтрока.СопоставленнаяАлкогольнаяПродукция.Добавить(ВыборкаАП.АлкогольнаяПродукция);
					//Если ЕстьКоэффициентАлкогольнойПродукции Тогда
					//	КоэффициентАлкогольнойПродукции = ВыборкаАП.КоэффициентАлкогольнойПродукции;
					//КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			КоличествоАП = ТекущаяСтрока.СопоставленнаяАлкогольнаяПродукция.Количество();
			Если КоличествоАП = 0 И ЗначениеЗаполнено(ТекущаяСтрока.АлкогольнаяПродукция) Тогда
				ТекущаяСтрока.ПредставлениеСопоставления = "";
			ИначеЕсли КоличествоАП = 0 Тогда
				ТекущаяСтрока.ПредставлениеСопоставления = "Не сопоставлена";
			ИначеЕсли ТекущаяСтрока.СопоставленнаяАлкогольнаяПродукция.Количество() = 1 Тогда
				ТекущаяСтрока.АлкогольнаяПродукция = ТекущаяСтрока.СопоставленнаяАлкогольнаяПродукция[0].Значение;
				//Если ЕстьКоэффициентАлкогольнойПродукции Тогда
				//	ТекущаяСтрока.КоэффициентАлкогольнойПродукции = КоэффициентАлкогольнойПродукции;
				//КонецЕсли;
				ТекущаяСтрока.ПредставлениеСопоставления = "";
			Иначе
				ТекущаяСтрока.ПредставлениеСопоставления = СтрШаблон(НСтр("ru = '%1 позиций'"), КоличествоАП);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьРеквизитАлкогольнойПродукции()

// Процедура выполняет заполнение реквизита табличной части "товары" свободным остатком по складу.
//
Процедура ЗаполнитьРеквизитЦенаБезНДС(Объект, ТекущаяСтрока = Неопределено, ИмяТабличнойЧасти = "Товары", ПараметрыДействия = Неопределено) Экспорт
	
	Если НЕ ЕстьРеквизит(Объект, "ЦенаБезНДС", ИмяТабличнойЧасти) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЕстьРеквизит(Объект, "СтавкаНДС", ИмяТабличнойЧасти) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЕстьРеквизит(Объект, "Цена", ИмяТабличнойЧасти) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЕстьРеквизит(Объект, "ТипЦен") Тогда
		Возврат;
	КонецЕсли;
	
	ЦенаВключаетНДС = Объект.ТипЦен.ЦенаВключаетНДС;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		Если ЦенаВключаетНДС Тогда
			ТекущаяСтрока.ЦенаБезНДС = ТекущаяСтрока.Цена*(1 - (ТекущаяСтрока.СтавкаНДС.Ставка/100));
		Иначе
			ТекущаяСтрока.ЦенаБезНДС = ТекущаяСтрока.Цена;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ТабличнаяЧасть = Объект[ИмяТабличнойЧасти];
	Для Каждого ТекущаяСтрока Из ТабличнаяЧасть Цикл
		Если ЦенаВключаетНДС Тогда
			ТекущаяСтрока.ЦенаБезНДС = ТекущаяСтрока.Цена*(1 - (ТекущаяСтрока.СтавкаНДС.Ставка/100));
		Иначе
			ТекущаяСтрока.ЦенаБезНДС = ТекущаяСтрока.Цена;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьРеквизитОстаткомПоСкладу()

// Процедура выполняет заполнение реквизита табличной части "товары" свободным остатком по складу.
//
Процедура ЗаполнитьРеквизитОстаткомПоСкладу(Объект, ИмяРеквизита, ТекущаяСтрока = Неопределено, ИмяТабличнойЧасти = "Товары", ПараметрыДействия = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПолучитьЗащищеннуюОбработку().ЗаполнитьРеквизитОстаткомПоСкладу(Объект,ИмяРеквизита, ТекущаяСтрока, ИмяТабличнойЧасти, ПараметрыДействия);
	
КонецПроцедуры // ЗаполнитьРеквизитОстаткомПоСкладу()

// Процедура выполняет заполнение реквизита табличной части "товары" свободным остатком по ордерному складу.
//
Процедура ЗаполнитьРеквизитОстаткомПоОрдерномуСкладу(Объект, ИмяРеквизита, ТекущаяСтрока = Неопределено, ИмяТабличнойЧасти = "Товары", ПараметрыДействия = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПолучитьЗащищеннуюОбработку().ЗаполнитьРеквизитОстаткомПоОрдерномуСкладу(Объект, ИмяРеквизита, ТекущаяСтрока, ИмяТабличнойЧасти, ПараметрыДействия);
	
КонецПроцедуры // ЗаполнитьРеквизитОстаткомПоОрдерномуСкладу()

// Процедура выполняет заполнение реквизита "СуммаСписания" табличной части "товары".
//
Процедура ЗаполнитьСлужебныйРеквизитСуммаСписания(Объект, ИмяРегистра = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПолучитьЗащищеннуюОбработку().ЗаполнитьСлужебныйРеквизитСуммаСписания(Объект, ИмяРегистра);
	
КонецПроцедуры // ЗаполнитьСлужебныйРеквизитСуммаСписания()

// Процедура заполнения документа в соответствии с переданными параметрами
//
// Параметры:
//   Форма - Управляемая форма - Форма объекта, из которой было вызвано заполнение
//   ПараметрыЗаполнения  - Структура - Структура параметров для заполнения объекта.
//                                      В обязательном порядке должна содержать следующие значения:
//                                      ИмяМенеджераОбъекта  - Имя менеджера заполняемого документа
//                                                             (например, "Документы.СписаниеТоваров")
//                                      ИмяТЧ - Имя заполняемой табличной части (Например, "Товары")
//   ИмяКомандыЗаполнения - Строка    - Полное имя выбранной команды заполнения.
//
Процедура ВыполнитьЗаполнениеОбъекта(Форма, РезультатОповещения, ИмяКоманды, Объект = Неопределено) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	ИмяТабличнойЧасти = РезультатОповещения.ПараметрыЗаполнения.ИмяТабличнойЧасти;
	
	Если ИмяТабличнойЧасти = "Товары" И ПолучитьЗначениеПараметраСтруктуры(РезультатОповещения.ПараметрыЗаполнения, "ОчиститьТабличнуюЧасть", ЛОЖЬ) Тогда
		МетаданныеОбъекта = Объект.Ссылка.Метаданные();
		Если (НЕ МетаданныеОбъекта.ТабличныеЧасти.Найти("Марки") = Неопределено) Тогда
			Объект.Марки.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяТабличнойЧасти = "Марки" И ПолучитьЗначениеПараметраСтруктуры(РезультатОповещения.ПараметрыЗаполнения, "ОчиститьТабличнуюЧасть", ЛОЖЬ) Тогда
		МетаданныеОбъекта = Объект.Ссылка.Метаданные();
		Если (НЕ МетаданныеОбъекта.ТабличныеЧасти.Найти("Товары") = Неопределено) И ЕстьРеквизит(Объект, "ПредставлениеМарок", "Товары") Тогда
			Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
				Если ТекущаяСтрока.Маркируемая Тогда
					ТекущаяСтрока.ПредставлениеМарок = "";
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ПолучитьЗащищеннуюОбработку().ВыполнитьЗаполнениеОбъекта(Форма, РезультатОповещения, ИмяКоманды, Объект);
	
КонецПроцедуры // ВыполнитьЗаполнениеОбъекта()

// Возвращает параметры получения таблицы списания по умолчанию
//
// Возвращаемое значение:
//  Структура - структура параметров:
//  	 * ИмяРегистра - Текст - Имя регистра движений.
//  	 * ИспользуемыеРесурсы - Структура - Список ресурсов регистра, которые необходимо рассчитать.
//  	 * ВидДвиженияПриход - ВидДвиженияНакопления - Вид движения регистра(Приход/Расход).
//  	 * ТекстЗапроса - Текст - Если требуется нестандартный текст запроса для получения данных из документа.
//  	 * ТекстОтбора - Текст - Текст отбора для регистра.
//  	 * ПараметрыОтбора - Структура - Описание дополнительных отборов для регистра.
//  	 * ДобавлятьНомерСтроки - Булево - флаг добавления номера строки в итоговую таблицу.
//
Функция СоздатьПараметрыПолученияТаблицыСписания() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИмяРегистра", "ПартииТоваровКомпании");
	Параметры.Вставить("ИспользуемыеРесурсы", Неопределено);
	Параметры.Вставить("ВидДвиженияПриход", ВидДвиженияНакопления.Расход);
	Параметры.Вставить("ТекстЗапроса", "");
	Параметры.Вставить("ТекстОтбора", "");
	Параметры.Вставить("ПараметрыОтбора", Новый Структура);
	Параметры.Вставить("ДобавлятьНомерСтроки", Ложь);
	
	Возврат Параметры;
	
КонецФункции

// Функция для получения сумм списания, по регистрам в разрезе уникальных реквизитов табличной части документа.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Параметры - Структура - структура параметров, полученная при помощи функции
// 							СоздатьПараметрыПолученияТаблицыСписания().
//
//  Возвращаемое значение - ТаблицаЗначений - таблица сумм списания.
//
Функция ПолучитьТаблицуСуммСписания(Объект, Параметры) Экспорт
	
	Если Объект.Ссылка.Пустая() Тогда
		// Если документ еще не записан - никаких сумм списания еще нет,
		// в документах дальше выполняется свертка - поэтому нужны соответствующие колонки.
		// Возвращаем в документы пустую таблицу, создав нужные колонки.
		ПустаяТЗ = Новый ТаблицаЗначений;
		ПустаяТЗ.Колонки.Добавить("Номенклатура");
		ПустаяТЗ.Колонки.Добавить("ЕдиницаИзмерения");
		ПустаяТЗ.Колонки.Добавить("ХарактеристикаНоменклатуры");
		ПустаяТЗ.Колонки.Добавить("СтавкаНДС");
		ПустаяТЗ.Колонки.Добавить("Количество");
		ПустаяТЗ.Колонки.Добавить("КоличествоБазовое");
		ПустаяТЗ.Колонки.Добавить("Сумма");
		ПустаяТЗ.Колонки.Добавить("СуммаНДС");
		ПустаяТЗ.Колонки.Добавить("СуммаУпр");
		ПустаяТЗ.Колонки.Добавить("СуммаРозн");
		
		Возврат ПустаяТЗ;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	Если Параметры.ИспользуемыеРесурсы = Неопределено Тогда
		Параметры.ИспользуемыеРесурсы = Новый Структура("Сумма" + ?(Параметры.ИмяРегистра = "ОстаткиТоваровКомпании","Розн",""));
	КонецЕсли;
	
	// Определим менеджер текущего объекта
	МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	СтруктураТаблиц   = МенеджерДокумента.ПолучитьУникальныеРеквизиты(Объект);
	
	СтрокаВыборкиКолонок     = "";
	СтрокаГруппировокКолонок = "";
	СтрокаПорядкаКолонок     = "";
	УчитыватьПартии          = Ложь;
	УчитыватьГТД             = Ложь;
	
	МетаданныеРегистра = Метаданные.РегистрыНакопления[Параметры.ИмяРегистра];
	ЕстьГТД    = (НЕ МетаданныеРегистра.Реквизиты.Найти("ГТД")    = Неопределено);
	ЕстьПартия = (НЕ МетаданныеРегистра.Реквизиты.Найти("Партия") = Неопределено);
	
	Если СтруктураТаблиц.Свойство("Товары") Тогда
		
		Для Каждого ИмяКолонки Из СтруктураТаблиц.Товары Цикл
			
			СтрокаВыборкиКолонок     = СтрокаВыборкиКолонок     + Символы.ПС + "ДокТовары." + ИмяКолонки + " КАК " + ИмяКолонки + ",";
			СтрокаГруппировокКолонок = СтрокаГруппировокКолонок + ?(СтрокаГруппировокКолонок = "", "", ",") + Символы.ПС + "ДокТовары." + ИмяКолонки;
			
			Если ЕстьПартия И ИмяКолонки = "Партия" Тогда
				УчитыватьПартии = Истина;
			КонецЕсли;
			
			Если ЕстьГТД И ИмяКолонки = "ГТД" Тогда
				УчитыватьГТД = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтрокаГруппировокКолонок = СтрокаГруппировокКолонок;
	
	Если Параметры.ДобавлятьНомерСтроки Тогда
		СтрокаВыборкиКолонок     = СтрокаВыборкиКолонок     + Символы.ПС  + "ДокТовары.НомерСтроки КАК НомерСтроки,";
		СтрокаГруппировокКолонок = СтрокаГруппировокКолонок + ?(СтрокаГруппировокКолонок = "", "", ",") + Символы.ПС  + "ДокТовары.НомерСтроки";
	КонецЕсли;
	
	СтрокаСуммСписанияРегистра = "";
	Для Каждого ТекРесурс Из Параметры.ИспользуемыеРесурсы Цикл
		СтрокаСуммСписанияРегистра = СтрокаСуммСписанияРегистра + "," + Символы.ПС + "	РегистрОстатков." + ТекРесурс.Ключ + " КАК " + ТекРесурс.Ключ;
		СтрокаВыборкиКолонок = СтрокаВыборкиКолонок + Символы.ПС + "	ВЫРАЗИТЬ(0 КАК Число(15,2)) КАК " + ТекРесурс.Ключ + ",";
		Параметры.ИспользуемыеРесурсы.Вставить(ТекРесурс.Ключ, 0);
	КонецЦикла;
	
	Если ПустаяСтрока(Параметры.ТекстЗапроса) Тогда
		
		МетаДанныеДокумента  = Объект.Ссылка.Метаданные();
		ПоБазовомуКоличеству = ЕстьРеквизит(Объект, "КоличествоБазовое", "Товары");
		
		// Получим таблицу товаров Документа
		Параметры.ТекстЗапроса = "ВЫБРАТЬ " + СтрокаВыборкиКолонок + "
		|	СУММА(ДокТовары.Количество) КАК Количество,
		|	СУММА(ДокТовары.Количество" + ?(ПоБазовомуКоличеству, "Базовое","*ДокТовары.Коэффициент") + ") КАК КоличествоБазовое 
		|ИЗ
		|	Документ." + МетаДанныеДокумента.Имя + ".Товары КАК ДокТовары
		|ГДЕ
		|	ДокТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО " + СтрокаГруппировокКолонок;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(Параметры.ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ТаблицаТоваровДокумента = Запрос.Выполнить().Выгрузить();
	ТаблицаТоваровДокумента.Сортировать("Номенклатура Возр, ХарактеристикаНоменклатуры Убыв" + ?(УчитыватьГТД,", ГТД Убыв","") + ?(УчитыватьПартии,", Партия Убыв",""));
	
	Для Каждого ТекОтбор Из Параметры.ПараметрыОтбора Цикл
		Запрос.УстановитьПараметр("Выб"+ТекОтбор.Ключ, ТекОтбор.Значение);
	КонецЦикла;
	
	// Получим таблицу движений списания по документу
	ТекстЗапроса = "ВЫБРАТЬ
	| РегистрОстатков.Номенклатура КАК Номенклатура,
	| РегистрОстатков.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	| " + ?(УчитыватьПартии, "РегистрОстатков.Партия КАК Партия,","") + "
	| " + ?(УчитыватьГТД,    "РегистрОстатков.ГТД КАК ГТД,","") + "
	| РегистрОстатков.Количество КАК Количество " + СтрокаСуммСписанияРегистра + "
	|
	|ИЗ
	| РегистрНакопления." + Параметры.ИмяРегистра + " КАК РегистрОстатков
	|ГДЕ РегистрОстатков.Регистратор = &ВыбРегистратор
	| И РегистрОстатков.ВидДвижения = &ВидДвиженияПриход 
	| "+?(Параметры.ТекстОтбора="","","И ")+Параметры.ТекстОтбора+"
	|УПОРЯДОЧИТЬ ПО
	|	РегистрОстатков.НомерСтроки";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВыбРегистратор",    Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", Параметры.ВидДвиженияПриход);
	ТаблицаДвиженийПоПартиям = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТабличнойЧасти Из ТаблицаТоваровДокумента Цикл
		
		СтруктураПоиска = Новый Структура();
		
		СтруктураПоиска.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
		
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) Тогда
			СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
		КонецЕсли;
		
		Если УчитыватьПартии И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Партия) Тогда
			СтруктураПоиска.Вставить("Партия", СтрокаТабличнойЧасти.Партия);
		КонецЕсли;
		
		Если УчитыватьГТД И ЗначениеЗаполнено(СтрокаТабличнойЧасти.ГТД) Тогда
			СтруктураПоиска.Вставить("ГТД", СтрокаТабличнойЧасти.ГТД);
		КонецЕсли;
		
		СтрокиДвижений   = ТаблицаДвиженийПоПартиям.НайтиСтроки(СтруктураПоиска);
		НужноеКоличество = СтрокаТабличнойЧасти.КоличествоБазовое;
		
		Если НужноеКоличество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ТекСтрока Из СтрокиДвижений Цикл
			Если ТекСтрока.Количество > НужноеКоличество Тогда
				
				Для Каждого ТекРесурс Из Параметры.ИспользуемыеРесурсы Цикл
					// получим сумму списания
					СуммаСписания = Окр(ТекСтрока[ТекРесурс.Ключ] / ТекСтрока.Количество, 2, 1) * НужноеКоличество;
					СтрокаТабличнойЧасти[ТекРесурс.Ключ] = СтрокаТабличнойЧасти[ТекРесурс.Ключ] + СуммаСписания;
					ТекСтрока[ТекРесурс.Ключ] = ТекСтрока[ТекРесурс.Ключ] - СуммаСписания;
				КонецЦикла;
				
				ТекСтрока.Количество = ТекСтрока.Количество - НужноеКоличество;
				Прервать;
				
			Иначе
				
				Для Каждого ТекРесурс Из Параметры.ИспользуемыеРесурсы Цикл
					СтрокаТабличнойЧасти[ТекРесурс.Ключ] = СтрокаТабличнойЧасти[ТекРесурс.Ключ] + ТекСтрока[ТекРесурс.Ключ];
				КонецЦикла;
				
				НужноеКоличество = НужноеКоличество - ТекСтрока.Количество;
				ТаблицаДвиженийПоПартиям.Удалить(ТекСтрока);
				
				Если НужноеКоличество = 0 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаТоваровДокумента;
	
КонецФункции //ПолучитьТаблицуСуммСписания()

// Функция возвращает структуру параметров для процедуры ПолучитьСуммуСписания().
// 
// Возвращаемое значение:
//  Структура - Структура параметров по умолчанию:
// 	 * ИмяРегистра					 - Строка										 - имя регистра накопления, по которому получается сумма,
// 	 * КэшТаблица					 - ТаблицаЗначений								 - таблица движений документа,
// 	 * Номенклатура					 - СправочникСсылка.Номенклатура				 - номенклатура,
// 	 * ХарактеристикаНоменклатуры	 - СправочникСсылка.ХарактеристикаНоменклатуры	 - характеристика номенклатуры,
// 	 * НомерСтроки					 - Число										 - номер строки документа.
//
Функция СоздатьПараметрыПолученияСуммыСписания() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИмяРегистра",                "ПартииТоваровКомпании");
	Параметры.Вставить("КэшТаблица",                 Неопределено);
	Параметры.Вставить("Номенклатура",               Неопределено);
	Параметры.Вставить("ХарактеристикаНоменклатуры", Неопределено);
	Параметры.Вставить("НомерСтроки",                Неопределено);
	
	Возврат Параметры;
	
КонецФункции // СоздатьПараметрыПолученияСуммыСписания

// Функция получения суммы списания документа.
//
// Параметры:
//  Объект 		 - ДокументОбъект 	 - текущий документ,
//  Параметры 	 - Структура 		 - структура параметров, полученная при помощи функции
// 							СоздатьПараметрыПолученияСуммыСписания()
//
// Возвращаемое значение:
//  -Число - Рассчитанная сумма списания.
//
Функция ПолучитьСуммуСписания(Объект, Параметры) Экспорт
	
	Если НЕ Объект.Проведен Тогда
		Возврат 0;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ИспользоватьРегистрПрочиеАктивыВЭксплуатации = Неопределено;
	
	ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	Если Метаданные.РегистрыНакопления[Параметры.ИмяРегистра].Ресурсы.Найти("БалансоваяСтоимость") <> Неопределено Тогда
		ИспользоватьРегистрПрочиеАктивыВЭксплуатации = Истина;
		ИменаРесурсовСумм = "БалансоваяСтоимость,БалансоваяСтоимостьУпр";
		Если Объект.ВалютаДокумента = ВалютаРегл Тогда
			ИмяРесурса = "БалансоваяСтоимость";
			ТребуетсяПересчет = Ложь;
		ИначеЕсли Объект.ВалютаДокумента = ВалютаУпр Тогда
			ИмяРесурса = "БалансоваяСтоимостьУпр"; 
			ТребуетсяПересчет = Ложь;
		Иначе
			ИмяРесурса = "БалансоваяСтоимостьУпр";
			ТребуетсяПересчет = Истина;
		КонецЕсли;
	Иначе
		ИспользоватьРегистрПрочиеАктивыВЭксплуатации = Ложь;
		ИменаРесурсовСумм = "Сумма,СуммаУпр";
		Если Объект.ВалютаДокумента = ВалютаРегл Тогда
			ИмяРесурса = "Сумма"; ТребуетсяПересчет = Ложь;
		ИначеЕсли Объект.ВалютаДокумента = ВалютаУпр Тогда
			ИмяРесурса = "СуммаУпр"; ТребуетсяПересчет = Ложь;
		Иначе
			ИмяРесурса = "СуммаУпр"; ТребуетсяПересчет = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	Если ТребуетсяПересчет Тогда
		
		Если ЕстьРеквизит(Объект, "КурсВалютыУпр") И ЗначениеЗаполнено(Объект.КурсВалютыУпр) Тогда
			КурсВалютыУпр = Объект.КурсВалютыУпр;
		Иначе
			СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУпр, Объект.Дата);
			КурсВалютыУпр = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		КонецЕсли;
		
		КоэффициентПересчета = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(
			1,
			ВалютаУпр,
			КурсВалютыУпр,
			Объект.ВалютаДокумента,
			Объект.КурсДокумента);
	КонецЕсли; 
	
	СуммаРезультат = 0;
	Отбор = Новый Структура;
	Если ИспользоватьРегистрПрочиеАктивыВЭксплуатации Тогда
		
		// Регистры "ПрочиеАктивыВЭксплуатации"
		Если Параметры.КэшТаблица = Неопределено Тогда
			СтрокаСгруппировать = "ВидДвижения";
			Если Метаданные.РегистрыНакопления[Параметры.ИмяРегистра].Измерения.Найти("Номенклатура") <> Неопределено Тогда
				СтрокаСгруппировать = СтрокаСгруппировать + ",Номенклатура";
				Если Метаданные.РегистрыНакопления[Параметры.ИмяРегистра].Измерения.Найти("ХарактеристикаНоменклатуры") <> Неопределено Тогда
					СтрокаСгруппировать = СтрокаСгруппировать + ",ХарактеристикаНоменклатуры";
				КонецЕсли;
			ИначеЕсли Метаданные.РегистрыНакопления[Параметры.ИмяРегистра].Измерения.Найти("ПрочийАктив") <> Неопределено Тогда
				СтрокаСгруппировать = СтрокаСгруппировать + ",ПрочийАктив";
			КонецЕсли;
			
			Если Объект.Движения[Параметры.ИмяРегистра].Количество() = 0 Тогда
				НаборЗаписей = РегистрыНакопления[Параметры.ИмяРегистра].СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Значение = Объект.Ссылка; НаборЗаписей.Отбор.Регистратор.Использование = Истина;
				НаборЗаписей.Прочитать();
			Иначе
				НаборЗаписей = Объект.Движения[Параметры.ИмяРегистра];
			КонецЕсли;
			
			Параметры.КэшТаблица = НаборЗаписей.Выгрузить();
			Параметры.КэшТаблица.Свернуть(СтрокаСгруппировать,ИменаРесурсовСумм);
			СтруктураОтбора = Новый Структура("ВидДвижения",ВидДвиженияНакопления.Приход);
			МассивНайденныхСтрок = Параметры.КэшТаблица.НайтиСтроки(СтруктураОтбора);
			Для Сч = 0 По МассивНайденныхСтрок.ВГраница() Цикл
				Параметры.КэшТаблица.Удалить(МассивНайденныхСтрок[Сч]);
			КонецЦикла;
			СтрокаСгруппировать = СтрЗаменить(СтрокаСгруппировать,"ВидДвижения,","");
			СтрокаСгруппировать = СтрЗаменить(СтрокаСгруппировать,"ВидДвижения","");
			Параметры.КэшТаблица.Свернуть(СтрокаСгруппировать,ИменаРесурсовСумм);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.Номенклатура) Тогда
			Если Параметры.КэшТаблица.Колонки.Найти("Номенклатура") <> Неопределено Тогда
				Отбор.Вставить("Номенклатура", Параметры.Номенклатура);
			ИначеЕсли Параметры.КэшТаблица.Колонки.Найти("ПрочийАктив") <> Неопределено Тогда
				Отбор.Вставить("ПрочийАктив", Параметры.Номенклатура);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Параметры.ХарактеристикаНоменклатуры) Тогда
			Отбор.Вставить("ХарактеристикаНоменклатуры", Параметры.ХарактеристикаНоменклатуры);
		КонецЕсли;
		
		Если Отбор.Количество() > 0 Тогда
			МассивСумм = Параметры.КэшТаблица.НайтиСтроки(Отбор);
			Если МассивСумм.Количество() > 0 Тогда
				СуммаРезультат = 0;
				Для Каждого СтрМассивСумм Из МассивСумм Цикл
					СуммаРезультат = СуммаРезультат + СтрМассивСумм[ИмяРесурса];
				КонецЦикла;
			КонецЕсли;
		Иначе
			СуммаРезультат = Параметры.КэшТаблица.Итог(ИмяРесурса);
		КонецЕсли;
		
	Иначе
		
		// Регистры "ПартииТоваровОтданные", "ПартииТоваровКомпании"
		Если Параметры.КэшТаблица = Неопределено Тогда
			ПараметрыПолучения = СоздатьПараметрыПолученияТаблицыСписания();
			ПараметрыПолучения.ИмяРегистра          = Параметры.ИмяРегистра;
			ПараметрыПолучения.ИспользуемыеРесурсы  = Новый Структура(ИмяРесурса);
			ПараметрыПолучения.ВидДвиженияПриход    = ВидДвиженияНакопления.Расход;
			ПараметрыПолучения.ДобавлятьНомерСтроки = Истина;
			Параметры.КэшТаблица = ПолучитьТаблицуСуммСписания(Объект, ПараметрыПолучения);
		КонецЕсли;
		
		Если Параметры.НомерСтроки <> Неопределено Тогда
			Отбор.Вставить("НомерСтроки", Параметры.НомерСтроки);
		КонецЕсли;

		Если Отбор.Количество() > 0 Тогда
			МассивСумм = Параметры.КэшТаблица.НайтиСтроки(Отбор);
			Если МассивСумм.Количество() > 0 Тогда
				СуммаРезультат = 0;
				Для Каждого СтрМассивСумм Из МассивСумм Цикл
					СуммаРезультат = СуммаРезультат + СтрМассивСумм[ИмяРесурса];
				КонецЦикла;
			КонецЕсли;
		Иначе
			СуммаРезультат = Параметры.КэшТаблица.Итог(ИмяРесурса);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТребуетсяПересчет Тогда
		СуммаРезультат = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(
			СуммаРезультат,
			ВалютаУпр,
			КурсВалютыУпр,
			Объект.ВалютаДокумента,
			Объект.КурсДокумента);
	КонецЕсли;
	
	Возврат СуммаРезультат;
	
КонецФункции // ПолучитьСуммуСписания()

// Поиск номенклатуры по артикулу с учетом или без учета незначащих символов
// СтрокаПоиска - Строка для поиска артикула
// ОбъектПоиска - Строка - Объект поиска "Номенклатура"
// Возвращаемое значение СписокЗначений - список найденных в справочнике элементов.
Функция ПоискСПреобразованиемАртикула(СтрокаПоиска,ОбъектПоиска) Экспорт
	
	Возврат ПолучитьЗащищеннуюОбработку().ПоискСПреобразованиемАртикула(СтрокаПоиска,ОбъектПоиска);
	
КонецФункции // ПоискСПреобразованиемАртикула()

// Функция возвращает таблицу долгов по предоплате для заказов покупателя
//
// Параметры:
//	ДокументОбъект            - ДокументСсылка - Документ, который вызвал функцию.
//	Заказ                     - ДокументСсылка или массив  - Заказ или заказы, 
//                                                           для которых нужно получить долги по предоплатам.
//	ДополнительнаяСуммаЗаказа - Число - Дополнительная сумма заказа, например при корректировке.
//
// Возвращаемое значение:
//	Таблица значений - Таблица долгов в разрезе заказов.
//
Функция ДолгиПоПредоплате(ДокументОбъектСтруктура, Заказ, ДополнительнаяСуммаЗаказа = 0) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаДолгов = Новый ТаблицаЗначений;
	ТаблицаДолгов.Колонки.Добавить("Валюта",            Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаДолгов.Колонки.Добавить("СуммаЗаказа",       Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаДолгов.Колонки.Добавить("ПроцентПредоплаты", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаДолгов.Колонки.Добавить("Предоплата",        Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаДолгов.Колонки.Добавить("Долг",              Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	
	МассивЗаказов = Новый Массив;
	ТипДокумента = Неопределено;
	Если ТипЗнч(Заказ) = Тип("Массив") Тогда
		Для Каждого ТекЗаказ Из Заказ Цикл
			ВременныйТипДокумента = ТипЗнч(ТекЗаказ);
			Если ВременныйТипДокумента = Тип("ДокументСсылка.ЗаказВнутренний") Тогда
				Продолжить;
			КонецЕсли;
			ТипДокумента = ВременныйТипДокумента;
			МассивЗаказов.Добавить(ТекЗаказ);
		КонецЦикла;
	Иначе
		ВременныйТипДокумента = ТипЗнч(Заказ);
		Если НЕ ВременныйТипДокумента = Тип("ДокументСсылка.ЗаказВнутренний") Тогда
			ТипДокумента = ВременныйТипДокумента;
			МассивЗаказов.Добавить(Заказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипДокумента = Неопределено Тогда
		ТаблицаДолгов.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
		Возврат ТаблицаДолгов;
	КонецЕсли;
	
	ТекМетаданные = Метаданные.НайтиПоТипу(ТипДокумента);
	ИмяДокумента = ТекМетаданные.Имя;
	
	ТаблицаДолгов.Колонки.Добавить("Заказ",             Новый ОписаниеТипов("ДокументСсылка."+ИмяДокумента));
	
	ИмяРегистра = "ЗаказыПокупателей";
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЗаказов.Ссылка КАК Заказ,
	|	ТаблицаЗаказов.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов КАК Валюта,
	|	ТаблицаЗаказов.ПроцентПредоплаты КАК ПроцентПредоплаты
	|ПОМЕСТИТЬ
	|	ТаблицаЗаказов
	|ИЗ
	|	Документ."+ИмяДокумента+" КАК ТаблицаЗаказов
	|ГДЕ
	|	ТаблицаЗаказов.Проведен
	|	И ТаблицаЗаказов.Ссылка В (&ЗаказПокупателя)
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЗаказов.Заказ КАК Заказ,
	|	ТаблицаЗаказов.Валюта КАК Валюта,
	|	ТаблицаЗаказов.ПроцентПредоплаты КАК ПроцентПредоплаты,
	|	ЕСТЬNULL(ЗаказыПокупателейОстатки.СуммаОстаток,     0) КАК СуммаЗаказа,
	|	ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаОстаток, 0) КАК СуммаДолга
	|ИЗ
	|	ТаблицаЗаказов КАК ТаблицаЗаказов
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления."+ИмяРегистра+".Остатки(&МоментВремени, Заказ ССЫЛКА Документ."+ИмяДокумента+" И Заказ В (ВЫБРАТЬ Заказ ИЗ ТаблицаЗаказов)) КАК ЗаказыПокупателейОстатки
	|ПО
	|	ТаблицаЗаказов.Заказ = ЗаказыПокупателейОстатки.Заказ
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&МоментВремени, Сделка ССЫЛКА Документ."+ИмяДокумента+" И Сделка В (ВЫБРАТЬ Заказ ИЗ ТаблицаЗаказов)) КАК ВзаиморасчетыКомпанииОстатки
	|ПО
	|	ТаблицаЗаказов.Заказ = ВзаиморасчетыКомпанииОстатки.Сделка
	|ГДЕ
	|	(НЕ ЕСТЬNULL(ЗаказыПокупателейОстатки.СуммаОстаток, 0) = 0) ИЛИ (НЕ ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаОстаток, 0) = 0)
	|	");
	Запрос.УстановитьПараметр("МоментВремени",   ?(ДокументОбъектСтруктура.Проведен, Новый Граница(ДокументОбъектСтруктура.МоментВремени, ВидГраницы.Исключая), ДокументОбъектСтруктура.Дата));
	Запрос.УстановитьПараметр("ЗаказПокупателя", Заказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Долг   = 0;
		Оплата = 0;
		Если Выборка.СуммаДолга > 0 Тогда
			Долг   = Выборка.СуммаДолга;
		Иначе
			Оплата = -Выборка.СуммаДолга;
		КонецЕсли;
		СуммаЗаказа = Выборка.СуммаЗаказа + Долг + ДополнительнаяСуммаЗаказа;
		// если есть дебиторская задолженность, то включим ее в состав суммы заказа
		Долг = (СуммаЗаказа*Выборка.ПроцентПредоплаты/100)-Оплата;
		
		Погрешность = СуммаЗаказа * 0.0009999;
		Если Долг > Погрешность Тогда
			НоваяСтрока = ТаблицаДолгов.Добавить();
			НоваяСтрока.Заказ             = Выборка.Заказ;
			НоваяСтрока.Валюта            = Выборка.Валюта;
			НоваяСтрока.СуммаЗаказа       = СуммаЗаказа;
			НоваяСтрока.ПроцентПредоплаты = Выборка.ПроцентПредоплаты;
			НоваяСтрока.Предоплата        = Оплата;
			НоваяСтрока.Долг              = Долг;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДолгов;
	
КонецФункции // ДолгиПоПредоплате()

// Заполнение таблицы замен номенклатуры
Процедура ЗаполнитьЗамены(Артикул,Производитель,ТаблицаЗамен) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПолучитьЗащищеннуюОбработку().ЗаполнитьЗамены(Артикул,Производитель,ТаблицаЗамен);
	
КонецПроцедуры // ЗаполнитьЗамены()

// Получение таблиц замен номенклатуры
Процедура ПолучитьЗаменыНоменклатуры(ЗаменыНовые,ТаблицаЗамен,ТаблицаЗаменНовыеСтарые,НаличиеВСправочнике,ВНаличииНаСкладе,НаДату,СкладКомпании) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПолучитьЗащищеннуюОбработку().ПолучитьЗаменыНоменклатуры(ЗаменыНовые,ТаблицаЗамен,ТаблицаЗаменНовыеСтарые,НаличиеВСправочнике,ВНаличииНаСкладе,НаДату,СкладКомпании);
	
КонецПроцедуры // ПолучитьЗаменыНоменклатуры()


////////////////////////////////////////////////////////////////////////////////
// ЗАЩИЩЕННЫЕ ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Общий обработчик события настройки параметров выбора элементов управления диалога
// в зависимости от значений реквизитов.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура НастроитьПараметрыВыбораЭлементовФормыДокументы(Форма, Объект = Неопределено) Экспорт
	
	ПолучитьЗащищеннуюОбработку().НастроитьПараметрыВыбораЭлементовФормыДокументы(Форма, Объект);

КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормыДокументы()

// Общий обработчик события настройки параметров выбора элементов управления диалога
// в зависимости от значений реквизитов.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура НастроитьПараметрыВыбораЭлементовФормыСправочники(Форма, Объект = Неопределено) Экспорт
	
	ПолучитьЗащищеннуюОбработку().НастроитьПараметрыВыбораЭлементовФормыСправочники(Форма, Объект);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормыСправочники()

// Производит установку параметров отбора по организации и по подразделению для тех реквизитов,
// которые указаны Функция.
//
Процедура РасставитьСвязиПараметровВыбораПоОрганизации(Форма, Объект = Неопределено) Экспорт
	
	ПолучитьЗащищеннуюОбработку().РасставитьСвязиПараметровВыбораПоОрганизации(Форма, Объект);
	
КонецПроцедуры // РасставитьСвязиПараметровВыбораПоОрганизации()

// Процедура установки видимости и доступности команд заполнения формы
//
Процедура УстановитьПараметрыКомандЗаполнения(Форма, Объект = Неопределено) Экспорт
	
	ПолучитьЗащищеннуюОбработку().УстановитьПараметрыКомандЗаполнения(Форма, Объект);

КонецПроцедуры // УстановитьПараметрыКомандЗаполнения()

// Процедура установки видимости и доступности команд печати документа
//
// Параметры:
//  Форма          - Управляемая форма - Форма, в которой устанавливается доступность и видимость команд печати
//  ТекущийЭлемент - Произвольный      - Прикладной объект, для которого настраиваются параметры команд печати.
//
Процедура УстановитьПараметрыКомандПечати(Форма, ТекущийЭлемент, ЭтоЖурналДокументов=ЛОЖЬ) Экспорт
	
	ПолучитьЗащищеннуюОбработку().УстановитьПараметрыКомандПечати(Форма, ТекущийЭлемент, ЭтоЖурналДокументов);
	
КонецПроцедуры // УстановитьПараметрыКомандПечати()

// Производит настройку основного динамического списка формы выбора.
//
Процедура НастроитьОсновнойДинамическийСписокФормы(Форма) Экспорт
	
	Перем ВидСравнения;
	
	// Проверим, а есть ли переданный отбор
	Если НЕ Форма.Параметры.Свойство("Отбор") Тогда
		Возврат;
	КонецЕсли;
	
	// Получим перечень отборов, которые не должны быть доступны пользователю.
	ЗаблокированныеПоля = УправлениеСпискомСправочникаСервер.ЗаблокированныеПоля(Форма);
	//ДоступныеПоляОтбора = Форма.Список.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора;
	ДоступныеПоляОтбора = Форма.Список.Отбор.ДоступныеПоляОтбора;
	
	РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	
	// Производим перенос будущих фиксированных отборов в доступные пользователю.
	Для Каждого КлючЗначение Из Форма.Параметры.Отбор Цикл
		
		Если ДоступныеПоляОтбора.НайтиПоле(Новый ПолеКомпоновкиДанных(КлючЗначение.Ключ)) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		//РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
		//Если ЗаблокированныеПоля.Найти(КлючЗначение.Ключ) <> Неопределено Тогда
		//	РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		//КонецЕсли;
		
		Значение = КлючЗначение.Значение;
		
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		ТипЗначения = ТипЗнч(КлючЗначение.Значение);
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Если ТипЗначения = Тип("ФиксированныйМассив") Тогда
			
			Значение = Новый СписокЗначений;
			Значение.ЗагрузитьЗначения(Новый Массив(КлючЗначение.Значение));
			ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			
		ИначеЕсли ТипЗначения = Тип("Массив") Тогда
			
			Значение = Новый СписокЗначений;
			Значение.ЗагрузитьЗначения(КлючЗначение.Значение);
			ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			
		ИначеЕсли ТипЗначения = Тип("СписокЗначений") Тогда
			
			ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Форма.Список,
			КлючЗначение.Ключ,
			Значение,
			ВидСравнения,
			,
			Истина,
			РежимОтображения);
		
	КонецЦикла;
	
	// Все будущие фиксированные отборы перенесены в настройки списка
	Форма.Параметры.Отбор.Очистить();
	
КонецПроцедуры // НастроитьОсновнойДинамическийСписокФормы()

// Процедура производит установку видимости колонки Характеристика в зависимости от значения служебных реквизитов.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура УстановитьВидимостьКолонкиХарактеристикаНоменклатуры(Форма, ИмяТабличнойЧасти = "Товары", СуффиксКолонок = "", Объект = Неопределено) Экспорт
	
	ПолучитьЗащищеннуюОбработку().УстановитьВидимостьКолонкиХарактеристикаНоменклатуры(Форма, ИмяТабличнойЧасти, СуффиксКолонок, Объект );
	
КонецПроцедуры // УстановитьВидимостьКолонкиХарактеристикаНоменклатуры()

// Возвращает параметры вызова функции УстановитьВидимостьКолонкиЦенаРозничная() по умолчанию
//
// Возвращаемое значение:
//  Структура - структура параметров по умолчанию:
//  	* ИмяТабличнойЧасти 	 - Строка 	 - имя табличной части документа,
//  	* СуффиксКолонок 		 - Строка 	 - суффикс колонок табличной части,
//  	* ОбязательноеУсловие 	 - Булево 	 - обязательное условие видимости,
//  	* ДостаточноеУсловие 	 - Булево 	 - достаточное условие видимости.
//
Функция СоздатьПараметрыУстановкиВидимостиКолонкиЦенаРозничная() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ИмяТабличнойЧасти",   "Товары");
	Параметры.Вставить("СуффиксКолонок",      "");
	Параметры.Вставить("ОбязательноеУсловие", Истина);
	Параметры.Вставить("ДостаточноеУсловие",  Ложь);
	
	Возврат Параметры;
	
КонецФункции

// Процедура производит установку видимости колонок розничной цены в зависимости от вида склада документа.
//
// Параметры:
//  Форма         - УправляемаяФорма - Форма, в которой возникло событие.
//  СкладКомпании - СправочникСсылка - Склад, на который поступают товары.
//  Параметры     - Структура        - структура параметров для вызова, возвращаемая функцией 
//                                     СоздатьПараметрыУстановкиВидимостиКолонкиЦенаРозничная().
//
Процедура УстановитьВидимостьКолонкиЦенаРозничная(Форма, СкладКомпании, Параметры=Неопределено, Объект = Неопределено) Экспорт
	
	Если Параметры=Неопределено Тогда
		Параметры = СоздатьПараметрыУстановкиВидимостиКолонкиЦенаРозничная();
	КонецЕсли;
	
	ПолучитьЗащищеннуюОбработку().УстановитьВидимостьКолонкиЦенаРозничная(Форма, СкладКомпании, Параметры.ИмяТабличнойЧасти, Параметры.СуффиксКолонок, Параметры.ОбязательноеУсловие, Параметры.ДостаточноеУсловие, Объект);
	
КонецПроцедуры // УстановитьВидимостьКолонкиЦенаРозничная()

// Процедура производит установку доступности колонок цен и сумм в зависимости от прав пользователя.
//
// Параметры:
//  Форма         - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура УстановитьДоступностьКолонокЦенИСумм(Форма, ИмяТабличнойЧасти = "Товары", СуффиксКолонок = "", Объект = Неопределено) Экспорт
	
	ПолучитьЗащищеннуюОбработку().УстановитьДоступностьКолонокЦенИСумм(Форма,ИмяТабличнойЧасти, СуффиксКолонок, Объект);
	
КонецПроцедуры // УстановитьДоступностьКолонокЦенИСумм()

// Производит формирование и установку форматированной строки представления итоговой суммы по операции.
//
// Параметры
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура УстановитьЗаголовокНадписиСуммаДокумента(Форма, Объект = Неопределено) Экспорт
	
	ПолучитьЗащищеннуюОбработку().УстановитьЗаголовокНадписиСуммаДокумента(Форма, Объект);
	
КонецПроцедуры // УстановитьЗаголовокНадписиСуммаДокумента()

// Производит формирование и установку представления надписи длина маршрута.
//
// Параметры
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура УстановитьЗаголовокНадписиДлиныМаршрута(Форма, Объект = Неопределено) Экспорт
	
	ПолучитьЗащищеннуюОбработку().УстановитьЗаголовокНадписиДлиныМаршрута(Форма, Объект);
	
КонецПроцедуры // УстановитьЗаголовокНадписиДлиныМаршрута()

// Производит формирование и установку представления индикатора состояния ввода налогового документа.
//
// Параметры
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
// Возвращаемое значение:
//  ДокументСсылка,Неопределено - Ссылка на документ счет фактуры.
//
Функция УстановитьЗаголовокНадписиНалоговыйДокумент(Форма, Объект = Неопределено) Экспорт
	
	Возврат ПолучитьЗащищеннуюОбработку().УстановитьЗаголовокНадписиНалоговыйДокумент(Форма, Объект);

КонецФункции// УстановитьЗаголовокНадписиНалоговыйДокумент()

// Производит формирование и установку представления надписи взаиморасчетов.
//
// Параметры
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура УстановитьЗаголовокНадписиВзаиморасчеты(Форма, ДополнительныеПараметры = Неопределено, Объект = Неопределено) Экспорт
	
	ПолучитьЗащищеннуюОбработку().УстановитьЗаголовокНадписиВзаиморасчеты(Форма, ДополнительныеПараметры, Объект);

КонецПроцедуры // УстановитьЗаголовокНадписиВзаиморасчеты()

// Производит формирование и установку представления надписи денежные средства.
//
// Параметры
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура УстановитьЗаголовокНадписиДенежныеСредства(Форма, ОбработкаПолучателя = ЛОЖЬ, Объект = Неопределено) Экспорт
	
	ПолучитьЗащищеннуюОбработку().УстановитьЗаголовокНадписиДенежныеСредства(Форма,ОбработкаПолучателя, Объект);

КонецПроцедуры // УстановитьЗаголовокНадписиДенежныеСредства()

