#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = Новый Структура;
	
	ИмяОтчета = "Блокировка ассортимента";
	
	РегистрационныеДанные.Вставить("Наименование", 		ИмяОтчета);
	РегистрационныеДанные.Вставить("БезопасныйРежим", 	Ложь);
	РегистрационныеДанные.Вставить("Версия", 			"1.0");
	РегистрационныеДанные.Вставить("Вид", 				"ДополнительныйОтчет");
	РегистрационныеДанные.Вставить("Информация", 		ИмяОтчета);
	
	тзКоманд = Новый ТаблицаЗначений;
	
	тзКоманд.Колонки.Добавить("Идентификатор");
	тзКоманд.Колонки.Добавить("Представление");
	тзКоманд.Колонки.Добавить("Модификатор");
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	тзКоманд.Колонки.Добавить("Использование");
	тзКоманд.Колонки.Добавить("ПроверкаПроведенияПередПечатью");
	 
	строкаКоманды = тзКоманд.Добавить();
	
	строкаКоманды.Идентификатор 		= "БлокировкаАссортимента";
	строкаКоманды.Представление 		= ИмяОтчета;
	строкаКоманды.ПоказыватьОповещение	= Истина;
	строкаКоманды.Использование 		= "ОткрытиеФормы";
	
	РегистрационныеДанные.Вставить("Команды", тзКоманд);
	
	Возврат РегистрационныеДанные;

	
КонецФункции

Процедура ПриИзмененииНастроек(ФормаОтчета) Экспорт
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	ХозОперацияОтчета = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ХозОперация"));
	Если НЕ ЗначениеЗаполнено(ХозОперацияОтчета.Значение) Тогда
		ХозОперацияОтчета.Значение = Справочники.ХозОперации.БлокировкаАссортиментаКЗаказу;
	КонецЕсли;
	
КонецПроцедуры //ПриИзмененииНастроек()

#КонецЕсли