#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОписаниеПеременных

Перем ДокументОбъект Экспорт; // Документ объект

#КонецОбласти

// Заполнение документа план операция: планирование.
Процедура ЗаполнитьПлан() Экспорт
	Перем Заказ;
	
	ТаблицаЗначений=ДокументОбъект.Показатели.Выгрузить();

	ЧислоСтрок=ТаблицаЗначений.Количество()-1;
	Если ЧислоСтрок=-1 Тогда
		ВывестиСообщение(НСтр("ru = 'Нет данных, на основании которых должно производиться заполнение заказов. Заполните план и затем попробуйте снова.'"));
		Возврат;
	КонецЕсли;
		
	ТаблицаЗначений.Сортировать("ВидАналитикиПланирования2");	
	ТекущийКонтрагент=Неопределено;
	ЭтоПервыйДокумент=Истина;
	ВывестиСообщение(НСтр("ru = 'Начало автоматического заполнения заказов поставщикам...'"));
	
	Для Счетчик=0 По ЧислоСтрок Цикл
		ТекущаяСтрока=ТаблицаЗначений.Получить(Счетчик);
		Если ТекущаяСтрока.ВидАналитикиПланирования2=Неопределено Тогда
			ТекущаяСтрока.ВидАналитикиПланирования2=Справочники.Контрагенты.ОсновнойПоставщик;
			Если ЭтоПервыйДокумент Тогда
				ВывестиСообщение(НСтр("ru = 'В следующий документ объединяются товары, поставщик которых неизвестен (подставляется «Основной поставщик»)'"));
			КонецЕсли;
		КонецЕсли;
		
		Если ТекущаяСтрока.ВидАналитикиПланирования2<>ТекущийКонтрагент Тогда
			Если НЕ ЭтоПервыйДокумент Тогда
				Заказ.Записать();
				ВывестиСообщение(НСтр("ru = 'Документ создан.'"));
			КонецЕсли;
			
			ТекущийКонтрагент=ТекущаяСтрока.ВидАналитикиПланирования2;
			
			// Заполнение шапки документа ЗаказПоставщику.
			Заказ=Документы.ЗаказПоставщику.СоздатьДокумент();
			Заказ.Дата=ТекущаяДатаСеанса();
			Заказ.УстановитьВремя();
			Заказ.УстановитьНовыйНомер();
			ЭтоПервыйДокумент=Ложь;
			ВывестиСообщение(НСтр("ru = 'Создание документа'" + "» "+Заказ+"» (" +НСтр("ru = 'поставщик:'") +" «"
								+ ТекущийКонтрагент+"»)..."));
			
			Заказ.Заполнить(Неопределено);
			Заказ.ХозОперация=Справочники.ХозОперации.ЗаказПоставщику;
			Документы.ЗаказПоставщику.ХозОперацияПриИзменении(Заказ);
			
			Заказ.ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
			Документы.ЗаказПоставщику.ВалютаДокументаПриИзменении(Заказ);
			
			Заказ.Контрагент=ТекущийКонтрагент;
			Документы.ЗаказПоставщику.КонтрагентПриИзменении(Заказ);
			
			Заказ.Организация=ДокументОбъект.Организация;
			Заказ.ПодразделениеКомпании=ДокументОбъект.ПодразделениеКомпании;
			Заказ.СрокПоставки=ДокументОбъект.ДатаКонца;
		КонецЕсли;
		
		// Заполнение ТЧ Товары документа ЗаказПоставщику.
		НоваяСтрокаЗаказа=Заказ.Товары.Добавить();
		
		НоваяСтрокаЗаказа.Номенклатура=ТекущаяСтрока.ВидАналитикиПланирования1;
		Заказ.ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрокаЗаказа);
		
		НоваяСтрокаЗаказа.Количество=ТекущаяСтрока.ПоказательПлана1;
		Заказ.ОбработкаРеквизита("Товары.Количество", НоваяСтрокаЗаказа);
		
		НоваяСтрокаЗаказа.Цена=ТекущаяСтрока.ПоказательПлана2;
		Заказ.ОбработкаРеквизита("Товары.Цена", НоваяСтрокаЗаказа);
		
	КонецЦикла;
	
	Заказ.Записать();
	ВывестиСообщение(НСтр("ru = 'Документ создан.'"));
	
	ВывестиСообщение(НСтр("ru = 'Окончание автоматического заполнения заказов поставщикам.'"));
КонецПроцедуры

#КонецЕсли