
#Область ПрограммныйИнтерфейс


// Процедура вызывается при очистке товаров в устройстве.
// Выполняет запись информации в узел плана обмена.
//
// Параметры:
//  Устройство       - СправочникСсылка.ПодключаемоеОборудование - Ссылка на устройство.
//  ВыполненоУспешно - Булево - Признак успешного выполнения операции.
//
Процедура ПриОчисткеТоваровВУстройстве(Устройство, ВыполненоУспешно = Истина) Экспорт
	
	МенеджерОборудованияРарусСервер.УстановитьМоментЗагрузки(Устройство, "Товары", 0, ТекущаяДатаСеанса());
	
КонецПроцедуры

Процедура ЗаполнитьПрайсЛистККМ(ОфлайнОборудование, ПрайсЛист, ПолнаяВыгрузка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(Штрихкоды.Штрихкод, """") КАК Штрихкод,
	|	ЕСТЬNULL(ТаблицаЦен.Цена, 0) КАК Цена
	|ПОМЕСТИТЬ
	|	ВременнаяТаблица
	|ИЗ
	|	Справочник.Номенклатура КАК ТаблицаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ПО
	|	Штрихкоды.Объект = ТаблицаНоменклатуры.Ссылка И 
	|	Штрихкоды.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) И 
	|	Штрихкоды.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Цены.СрезПоследних(,
	|				ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦен.ОсновнойТипЦенПродажи) И 
	|				ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
	|				ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) И 
	|				Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И 
	|				ПодразделениеКомпании = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ОсновноеПодразделение)
	|	
	|	) КАК ТаблицаЦен
	|ПО
	|	ТаблицаНоменклатуры.Ссылка = ТаблицаЦен.Номенклатура
	|ГДЕ
	|	ТаблицаНоменклатуры.ПометкаУдаления = ЛОЖЬ И 
	|	ТаблицаНоменклатуры.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Номенклатура КАК Наименование,
	|	1 КАК КодГруппы,
	|	ВременнаяТаблица.Номенклатура.Артикул КАК Артикул,
	|	ВременнаяТаблица.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	ВременнаяТаблица.Номенклатура.Код КАК Код,
	|	ЛОЖЬ КАК ЭтоАлкоголь,
	|	ЛОЖЬ КАК ЭтоВесовойТовар,
	|	ЛОЖЬ КАК ИмеетУпаковки,
	|	ЛОЖЬ КАК ИмеетХарактеристики,
	|	"""" КАК КодЕдиницыИзмерения,
	|	ВременнаяТаблица.Штрихкод КАК Штрихкод,
	|	ВременнаяТаблица.Цена КАК Цена,
	|	10 КАК Остаток
	|ИЗ
	|	ВременнаяТаблица
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Номенклатура,
	|	1,
	|	ВременнаяТаблица.Номенклатура.Артикул,
	|	ВременнаяТаблица.Номенклатура.СтавкаНДС,
	|	ВременнаяТаблица.Номенклатура.Код,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	"""",
	|	ВременнаяТаблица.Штрихкод,
	|	ВременнаяТаблица.Цена,
	|	15
	|ИЗ
	|	ВременнаяТаблица
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Номенклатура,
	|	1,
	|	ВременнаяТаблица.Номенклатура.Артикул,
	|	ВременнаяТаблица.Номенклатура.СтавкаНДС,
	|	ВременнаяТаблица.Номенклатура.Код,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	"""",
	|	ВременнаяТаблица.Штрихкод,
	|	ВременнаяТаблица.Цена,
	|	5
	|ИЗ
	|	ВременнаяТаблица
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Номенклатура,
	|	1,
	|	ВременнаяТаблица.Номенклатура.Артикул,
	|	ВременнаяТаблица.Номенклатура.СтавкаНДС,
	|	ВременнаяТаблица.Номенклатура.Код,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	"""",
	|	ВременнаяТаблица.Штрихкод,
	|	ВременнаяТаблица.Цена,
	|	3
	|ИЗ
	|	ВременнаяТаблица
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Номенклатура,
	|	1,
	|	ВременнаяТаблица.Номенклатура.Артикул,
	|	ВременнаяТаблица.Номенклатура.СтавкаНДС,
	|	ВременнаяТаблица.Номенклатура.Код,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	"""",
	|	ВременнаяТаблица.Штрихкод,
	|	ВременнаяТаблица.Цена,
	|	25
	|ИЗ
	|	ВременнаяТаблица
	|";
	
	ТоварыКВыгрузке = Запрос.Выполнить().Выгрузить();
	//ПрайсЛист.Товары = Запрос.Выполнить().Выгрузить();
	//ПрайсЛист.Товары = Результат.ВыгрузитьКолонку("Номенклатура");
	
	//Выборка = Запрос.Выполнить().Выбрать();
	//КоличествоСтрок = Выборка.Количество()/100;
	//НомерСтроки = 1;
	//Пока Выборка.Следующий() Цикл
	//	СтрокаЗаписи = "Номенклатура <" + Строка(Выборка.Номенклатура) + ">; Штрихкод <" + Строка(Выборка.Штрихкод) + ">; Цена = " + Формат(Выборка.Цена, "ЧН=0") + ".";
	//	Текст.ВставитьСтроку(НомерСтроки, СтрокаЗаписи);
	//	
	//	Процент = НомерСтроки/КоличествоСтрок;
	//	
	//	РезультатОбработкиСтроки = Новый Структура;
	//	РезультатОбработкиСтроки.Вставить("НомерСтроки", НомерСтроки);
	//	
	//	ДлительныеОперации.СообщитьПрогресс(Процент,, РезультатОбработкиСтроки);
	//	
	//	НомерСтроки = НомерСтроки + 1;
	//	
	//КонецЦикла;
	
	//Параметры = ПолучитьПараметрыУстройства(ОфлайнОборудование);
	//
	//Если Параметры = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если НЕ ЗначениеЗаполнено(Параметры.ОборудованиеОфлайн) Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Параметры.Вставить("ЧастичнаяВыгрузка", НЕ ПолнаяВыгрузка);
	//
	////Параметры.Вставить("КассаККМ",
	////	Справочники.КассыККМ.ПолучитьКассуККМПоЭкземпляруОборудования(ОфлайнОборудование)
	////);
	//
	//ТоварыКВыгрузке = ПолучитьТоварыКВыгрузкеККМ(ОфлайнОборудование, Параметры);
	//
	ЗаполнитьСтруктуруПрайсЛистаИзДанныхКВыгрузке(ПрайсЛист, ТоварыКВыгрузке);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПараметровУстройства() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ИндексМагазина",            0);
	ВозвращаемоеЗначение.Вставить("ОсновнойОтдел",             Неопределено);
	ВозвращаемоеЗначение.Вставить("ТипЦен",                    Неопределено);
	ВозвращаемоеЗначение.Вставить("ТипОборудования",           Неопределено);
	ВозвращаемоеЗначение.Вставить("Подразделение",             Неопределено);
	ВозвращаемоеЗначение.Вставить("ГруппаТоваровОборудования", Неопределено);
	ВозвращаемоеЗначение.Вставить("ВыгружатьТовары",           Ложь);
	ВозвращаемоеЗначение.Вставить("ВыгружатьСкидки",           Ложь);
	ВозвращаемоеЗначение.Вставить("ВыгружатьПерсонал",         Ложь);
	ВозвращаемоеЗначение.Вставить("ЗагружатьПродажи",          Ложь);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Функция получает параметры устройства.
//
Функция ПолучитьПараметрыУстройства(Устройство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПодключаемоеОборудование.ОсновнойОтдел.ТипЦенРозничнойТорговли, ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)) КАК ТипЦен,
	|	ПодключаемоеОборудование.ОсновнойОтдел КАК ОсновнойОтдел,
	|	ПодключаемоеОборудование.ОсновнойОтдел.ПодразделениеКомпании КАК Подразделение,
	|	ПодключаемоеОборудование.ИндексМагазина КАК ИндексМагазина,
	|	ПодключаемоеОборудование.ГруппаТоваровОборудования КАК ГруппаТоваровОборудования,
	|	ПодключаемоеОборудование.ТипОфлайнОборудования КАК ТипОборудования,
	|	ПодключаемоеОборудование.ВыгружатьТовары КАК ВыгружатьТовары,
	|	ПодключаемоеОборудование.ВыгружатьСкидки КАК ВыгружатьСкидки,
	|	ПодключаемоеОборудование.ВыгружатьПерсонал КАК ВыгружатьПерсонал,
	|	ПодключаемоеОборудование.ЗагружатьПродажи КАК ЗагружатьПродажи
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.Ссылка = &Устройство";
	
	Запрос.УстановитьПараметр("Устройство", Устройство);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВозвращаемоеЗначение = ПолучитьСтруктуруПараметровУстройства();
	ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение, Выборка);
	
	//ВозвращаемоеЗначение = Новый Структура;
	//ВозвращаемоеЗначение.Вставить("ИндексМагазина",            Выборка.ИндексМагазина);
	//ВозвращаемоеЗначение.Вставить("ОсновнойОтдел",             Выборка.ОсновнойОтдел);
	//ВозвращаемоеЗначение.Вставить("ТипЦен",                    Выборка.ТипЦен);
	//ВозвращаемоеЗначение.Вставить("ТипОборудования",           Выборка.ТипОборудования);
	//ВозвращаемоеЗначение.Вставить("Подразделение",             Выборка.Подразделение);
	////ВозвращаемоеЗначение.Вставить("ФорматОбмена",              Выборка.ФорматОбмена);
	//ВозвращаемоеЗначение.Вставить("ГруппаТоваровОборудования", Выборка.ГруппаТоваровОборудования);
	//ВозвращаемоеЗначение.Вставить("ВыгружатьТовары",           Выборка.ВыгружатьТовары);
	//ВозвращаемоеЗначение.Вставить("ВыгружатьСкидки",           Выборка.ВыгружатьСкидки);
	//ВозвращаемоеЗначение.Вставить("ВыгружатьПерсонал",         Выборка.ВыгружатьПерсонал);
	//ВозвращаемоеЗначение.Вставить("ЗагружатьПродажи",         Выборка.ЗагружатьПродажи);
	//
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПолучитьТоварыКВыгрузкеККМ(Устройство, Параметры, Штрихкод = "")
	
	//ГруппыТоваровОборудования = Параметры.ГруппыТоваровОборудования;
	//
	////РегистрироватьКОбменуПриИзмененииОстатка = Истина;
	//
	//ТаблицаТоваровПоПравилу = Справочники.ПравилаОбменаСПодключаемымОборудованием.СписокТоваровПоПравилу(ГруппыТоваровОборудования);
	//
	////АвтоматическиГенерироватьSKU = АвтоматическиГенерироватьSKU();
	//
	////РегистрыСведений.КодыТоваровSKU.ОбновитьКоды_SKU_PLU(ТаблицаТоваровПоПравилу, АвтоматическиГенерироватьSKU, ПравилоОбмена);
	//
	////ВерхняяГраница = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ВерхняяГраницаДиапазонаSKUВесовогоТовара");
	////НижняяГраница  = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("НижняяГраницаДиапазонаSKUВесовогоТовара");
	//
	////ВыгружатьГруппыТоваров = ?(Параметры.Свойство("ВыгружатьГруппыТоваров"), Параметры.ВыгружатьГруппыТоваров, Истина);
	//
	//УстановитьПривилегированныйРежим(Истина);
	//
	//#Область Запрос
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	КодыТоваровPLUНаОборудовании.КодТовараSKU КАК SKUГруппы,
	//|	КодыТоваровSKU.Номенклатура КАК Номенклатура
	//|ПОМЕСТИТЬ КодыГрупп
	//|ИЗ
	//|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
	//|		ПО (КодыТоваровPLUНаОборудовании.КодТовараSKU = КодыТоваровSKU.SKU)
	//|ГДЕ
	//|	КодыТоваровPLUНаОборудовании.ПравилоОбмена = &ПравилоОбмена
	//|	И КодыТоваровSKU.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	//|	И КодыТоваровSKU.Номенклатура.ЭтоГруппа
	//|	И &ВыгружатьГруппыТоваров
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТоварыНаСкладахИзменения.Регистратор КАК Регистратор
	//|ПОМЕСТИТЬ РегистраторыТоварыНаСкладах
	//|ИЗ
	//|	РегистрНакопления.ТоварыНаСкладах.Изменения КАК ТоварыНаСкладахИзменения
	//|ГДЕ
	//|	ТоварыНаСкладахИзменения.Узел = &Узел
	//|	И &РегистрироватьПриИзмененииОстатка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
	//|	ТоварыНаСкладах.Характеристика КАК Характеристика
	//|ПОМЕСТИТЬ ТоварыСИзменившемсяОстатком
	//|ИЗ
	//|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистраторыТоварыНаСкладах КАК РегистраторыТоварыНаСкладах
	//|		ПО ТоварыНаСкладах.Регистратор = РегистраторыТоварыНаСкладах.Регистратор
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	КодыТоваровSKU.SKU КАК SKU
	//|ПОМЕСТИТЬ SKU_КОбмену
	//|ИЗ
	//|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСИзменившемсяОстатком КАК ТоварыСИзменившемсяОстатком
	//|		ПО КодыТоваровSKU.Номенклатура = ТоварыСИзменившемсяОстатком.Номенклатура
	//|			И КодыТоваровSKU.Характеристика = ТоварыСИзменившемсяОстатком.Характеристика
	//|
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ
	//|	КодыТоваровPLUНаОборудовании.КодТовараSKU
	//|ИЗ
	//|	РегистрСведений.КодыТоваровPLUНаОборудовании КАК КодыТоваровPLUНаОборудовании
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			КодыТоваровPLUНаОборудованииИзменения.КодТовараPLU КАК КодТовараPLU,
	//|			КодыТоваровPLUНаОборудованииИзменения.ПравилоОбмена КАК ПравилоОбмена
	//|		ИЗ
	//|			РегистрСведений.КодыТоваровPLUНаОборудовании.Изменения КАК КодыТоваровPLUНаОборудованииИзменения
	//|		ГДЕ
	//|			КодыТоваровPLUНаОборудованииИзменения.Узел = &Узел
	//|			И КодыТоваровPLUНаОборудованииИзменения.ПравилоОбмена = &ПравилоОбмена) КАК PLUКОбмену
	//|		ПО КодыТоваровPLUНаОборудовании.КодТовараPLU = PLUКОбмену.КодТовараPLU
	//|			И КодыТоваровPLUНаОборудовании.ПравилоОбмена = PLUКОбмену.ПравилоОбмена
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	КодыТоваровSKU.SKU КАК SKU,
	//|	КодыТоваровSKU.Номенклатура КАК Номенклатура,
	//|	КодыТоваровSKU.Характеристика КАК Характеристика,
	//|	КодыТоваровSKU.Упаковка КАК Упаковка,
	//|	ВЫБОР
	//|		КОГДА SKU_КОбмену.SKU ЕСТЬ NULL
	//|			ТОГДА ЛОЖЬ
	//|		ИНАЧЕ ИСТИНА
	//|	КОНЕЦ КАК ЕстьИзменения
	//|ПОМЕСТИТЬ КодыТоваровSKU
	//|ИЗ
	//|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	//|		ЛЕВОЕ СОЕДИНЕНИЕ SKU_КОбмену КАК SKU_КОбмену
	//|		ПО КодыТоваровSKU.SKU = SKU_КОбмену.SKU
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТаблицаТоваровПоПравилу.PLU КАК PLU,
	//|	ТаблицаТоваровПоПравилу.SKU КАК SKU,
	//|	ТаблицаТоваровПоПравилу.Весовой КАК Весовой,
	//|	ТаблицаТоваровПоПравилу.Группа КАК Группа,
	//|	ТаблицаТоваровПоПравилу.КоличествоОстаток КАК КоличествоОстаток,
	//|	ТаблицаТоваровПоПравилу.Номенклатура КАК Номенклатура,
	//|	ТаблицаТоваровПоПравилу.Упаковка КАК Упаковка,
	//|	ТаблицаТоваровПоПравилу.Характеристика КАК Характеристика,
	//|	ТаблицаТоваровПоПравилу.Цена КАК Цена,
	//|	ТаблицаТоваровПоПравилу.ЭтоГруппа КАК ЭтоГруппа,
	//|	ТаблицаТоваровПоПравилу.ДоговорПлатежногоАгента КАК ДоговорПлатежногоАгента
	//|ПОМЕСТИТЬ ТаблицаТоваровПоПравилу
	//|ИЗ
	//|	&ТаблицаТоваровПоПравилу КАК ТаблицаТоваровПоПравилу
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТаблицаТоваровПоПравилу.PLU КАК PLU,
	//|	ТаблицаТоваровПоПравилу.SKU КАК SKU,
	//|	ТаблицаТоваровПоПравилу.Весовой КАК Весовой,
	//|	ТаблицаТоваровПоПравилу.Группа КАК Группа,
	//|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблицаТоваровПоПравилу.КоличествоОстаток, 0) КАК ЧИСЛО(15, 3)) КАК КоличествоОстаток,
	//|	ТаблицаТоваровПоПравилу.Номенклатура КАК Номенклатура,
	//|	ТаблицаТоваровПоПравилу.Упаковка КАК Упаковка,
	//|	ТаблицаТоваровПоПравилу.Характеристика КАК Характеристика,
	//|	ТаблицаТоваровПоПравилу.Цена КАК Цена,
	//|	ТаблицаТоваровПоПравилу.ЭтоГруппа КАК ЭтоГруппа,
	//|	СпрНоменклатура.Наименование КАК НоменклатураНаименование,
	//|	СпрНоменклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	//|	СпрНоменклатура.Артикул КАК Артикул,
	//|	СпрНоменклатура.Описание КАК Описание,
	//|	СпрНоменклатура.СтавкаНДС КАК СтавкаНДС,
	//|	СпрНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	//|	СпрНоменклатура.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	//|	СпрНоменклатура.ВидАлкогольнойПродукцииЕГАИС КАК ВидАлкогольнойПродукцииЕГАИС,
	//|	СпрНоменклатура.ОбъемДАЛ КАК ОбъемДАЛ,
	//|	СпрНоменклатура.Крепость КАК Крепость,
	//|	СпрНоменклатура.ПроизводительИмпортерАлкогольнойПродукции КАК ПроизводительИмпортерАлкогольнойПродукции,
	//|	ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 1) КАК КоэффициентУпаковки,
	//|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Наименование, &ПустаяСтрока) КАК ХарактеристикаНаименование,
	//|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	ЕСТЬNULL(УпаковкиНоменклатуры.Наименование, &ПустаяСтрока) КАК УпаковкаНаименование,
	//|	ВЫБОР
	//|		КОГДА SKU_КОбмену.SKU ЕСТЬ NULL
	//|			ТОГДА ЛОЖЬ
	//|		ИНАЧЕ ИСТИНА
	//|	КОНЕЦ КАК ЕстьИзменения,
	//|	СпрНоменклатура.КодТНВЭД КАК КодТНВЭД,
	//|	ТаблицаТоваровПоПравилу.ДоговорПлатежногоАгента КАК ДоговорПлатежногоАгента,
	//|	СпрНоменклатура.ВидНоменклатуры.ПродаетсяВРозлив КАК ПродаетсяВРозлив,
	//|	СпрНоменклатура.ВидНоменклатуры.ПризнакПредметаРасчета.ТипПризнакаПредметаРасчета КАК ПризнакПредметаРасчета
	//|ПОМЕСТИТЬ ТаблицаТоваров
	//|ИЗ
	//|	ТаблицаТоваровПоПравилу КАК ТаблицаТоваровПоПравилу
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	//|		ПО ТаблицаТоваровПоПравилу.Номенклатура = СпрНоменклатура.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	//|		ПО ТаблицаТоваровПоПравилу.Упаковка = УпаковкиНоменклатуры.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	//|		ПО ТаблицаТоваровПоПравилу.Характеристика = ХарактеристикиНоменклатуры.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ SKU_КОбмену КАК SKU_КОбмену
	//|		ПО ТаблицаТоваровПоПравилу.SKU = SKU_КОбмену.SKU
	//|ГДЕ
	//|	НЕ ТаблицаТоваровПоПравилу.SKU ЕСТЬ NULL
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТаблицаТоваров.PLU КАК КодТовараPLU,
	//|	ТаблицаТоваров.SKU КАК КодТовараSKU,
	//|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	//|	ТаблицаТоваров.Характеристика КАК Характеристика,
	//|	ТаблицаТоваров.Упаковка КАК Упаковка,
	//|	ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
	//|	ТаблицаТоваров.ЭтоГруппа КАК ЭтоГруппа,
	//|	ТаблицаТоваров.ТипНоменклатуры КАК ТипНоменклатуры,
	//|	ТаблицаТоваров.Весовой КАК Весовой,
	//|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	ТаблицаТоваров.КоэффициентУпаковки КАК КоэффициентУпаковки,
	//|	ТаблицаТоваров.НоменклатураНаименование КАК НоменклатураНаименование,
	//|	ТаблицаТоваров.НоменклатураНаименование КАК НоменклатураНаименованиеПолное,
	//|	ТаблицаТоваров.Артикул КАК Артикул,
	//|	ТаблицаТоваров.Описание КАК Описание,
	//|	ТаблицаТоваров.ХарактеристикаНаименование КАК ХарактеристикаНаименование,
	//|	ТаблицаТоваров.УпаковкаНаименование КАК УпаковкаНаименование,
	//|	ЕСТЬNULL(Штрихкоды.Штрихкод, &ПустаяСтрока) КАК Штрихкод,
	//|	ТаблицаТоваров.КоличествоОстаток / ВЫБОР
	//|		КОГДА ТаблицаТоваров.КоэффициентУпаковки = 0
	//|			ТОГДА 1
	//|		ИНАЧЕ ЕСТЬNULL(ТаблицаТоваров.КоэффициентУпаковки, 1)
	//|	КОНЕЦ КАК КоличествоОстаток,
	//|	ТаблицаТоваров.АлкогольнаяПродукция КАК Алкоголь,
	//|	ВЫБОР
	//|		КОГДА ТаблицаТоваров.АлкогольнаяПродукция
	//|			ТОГДА ТаблицаТоваров.ВидАлкогольнойПродукцииЕГАИС.Маркируемый
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК Маркируемый,
	//|	ВЫБОР
	//|		КОГДА ТаблицаТоваров.АлкогольнаяПродукция
	//|			ТОГДА ТаблицаТоваров.ВидАлкогольнойПродукцииЕГАИС.Код
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК КодВидаАлкогольнойПродукции,
	//|	ВЫБОР
	//|		КОГДА ТаблицаТоваров.АлкогольнаяПродукция
	//|			ТОГДА ТаблицаТоваров.ОбъемДАЛ * 10
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК ЕмкостьТары,
	//|	ВЫБОР
	//|		КОГДА ТаблицаТоваров.АлкогольнаяПродукция
	//|			ТОГДА ТаблицаТоваров.Крепость
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК Крепость,
	//|	ВЫБОР
	//|		КОГДА ТаблицаТоваров.АлкогольнаяПродукция
	//|			ТОГДА ТаблицаТоваров.ПроизводительИмпортерАлкогольнойПродукции.ИНН
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК ИННПроизводителя,
	//|	ВЫБОР
	//|		КОГДА ТаблицаТоваров.АлкогольнаяПродукция
	//|			ТОГДА ТаблицаТоваров.ПроизводительИмпортерАлкогольнойПродукции.КПП
	//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|	КОНЕЦ КАК КПППроизводителя,
	//|	КодыГрупп.SKUГруппы КАК SKUГруппы,
	//|	ТаблицаТоваров.Цена КАК Цена,
	//|	ТаблицаТоваров.ДоговорПлатежногоАгента КАК ДоговорПлатежногоАгента,
	//|	ТаблицаТоваров.ПризнакПредметаРасчета КАК ПризнакПредметаРасчета,
	//|	ТаблицаТоваров.ПродаетсяВРозлив КАК ПродаетсяВРозлив,
	//|	ТаблицаТоваров.Группа КАК Группа
	//|ИЗ
	//|	ТаблицаТоваров КАК ТаблицаТоваров
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	//|		ПО ТаблицаТоваров.Номенклатура = Штрихкоды.Владелец
	//|			И ТаблицаТоваров.Характеристика = Штрихкоды.Характеристика
	//|			И ТаблицаТоваров.Упаковка = Штрихкоды.Упаковка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ КодыГрупп КАК КодыГрупп
	//|		ПО ТаблицаТоваров.Группа = КодыГрупп.Номенклатура
	//|ГДЕ
	//|	ТаблицаТоваров.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	//|	И ВЫБОР
	//|			КОГДА &ТолькоИзмененные = ИСТИНА
	//|				ТОГДА ТаблицаТоваров.ЕстьИзменения = ИСТИНА
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И ВЫБОР
	//|			КОГДА &ВыгружатьГруппыТоваров = ЛОЖЬ
	//|				ТОГДА НЕ ТаблицаТоваров.ЭтоГруппа
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|	И ВЫБОР
	//|			КОГДА &ОтборПоШтрихкоду = ИСТИНА
	//|				ТОГДА ЕСТЬNULL(Штрихкоды.Штрихкод, &ПустаяСтрока) = &Штрихкод
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|ИТОГИ
	//|	МАКСИМУМ(Штрихкод)
	//|ПО
	//|	КодТовараPLU";
	//
	//Запрос.УстановитьПараметр("ТолькоИзмененные",       Параметры.ЧастичнаяВыгрузка); 
	//Запрос.УстановитьПараметр("ПравилоОбмена",          Параметры.ПравилоОбмена);
	//Запрос.УстановитьПараметр("Узел",                   Параметры.УзелИнформационнойБазы);
	//Запрос.УстановитьПараметр("Склад",                  Параметры.ПравилоОбмена.Склад);
	//Запрос.УстановитьПараметр("ВыгружатьГруппыТоваров", ВыгружатьГруппыТоваров);
	//Запрос.УстановитьПараметр("РегистрироватьПриИзмененииОстатка", РегистрироватьКОбменуПриИзмененииОстатка);
	//Запрос.УстановитьПараметр("ПустаяСтрока", "");
	//Запрос.УстановитьПараметр("ТаблицаТоваровПоПравилу", ТаблицаТоваровПоПравилу);
	//Запрос.УстановитьПараметр("ВыгружатьГруппыТоваров",  ВыгружатьГруппыТоваров);
	//Запрос.УстановитьПараметр("Устройство",              Устройство);
	//Запрос.УстановитьПараметр("ОтборПоШтрихкоду",        НЕ ПустаяСтрока(Штрихкод));
	//Запрос.УстановитьПараметр("Штрихкод",                Штрихкод);
	//
	//
	//#КонецОбласти
	//
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("PLU",								Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("SKU",								Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("SKUГруппы",						Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Номенклатура",						Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоваров.Колонки.Добавить("Группа",							Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоваров.Колонки.Добавить("Характеристика",					Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаТоваров.Колонки.Добавить("Упаковка",							Новый ОписаниеТипов("СправочникСсылка.УпаковкиНоменклатуры"));
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС",						Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ТаблицаТоваров.Колонки.Добавить("ТипНоменклатуры",					Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"));
	ТаблицаТоваров.Колонки.Добавить("Артикул",							Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("Описание",							Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмерения",					Новый ОписаниеТипов("СправочникСсылка.БазовыеЕдиницыИзмерения"));
	ТаблицаТоваров.Колонки.Добавить("Наименование",						Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("НаименованиеПолное",				Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("Штрихкод",							Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("МассивШтрихкодов",					Новый ОписаниеТипов("Массив"));
	ТаблицаТоваров.Колонки.Добавить("Цена",								Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Весовой",							Новый ОписаниеТипов("Булево"));
	ТаблицаТоваров.Колонки.Добавить("ЭтоГруппа",						Новый ОписаниеТипов("Булево"));
	ТаблицаТоваров.Колонки.Добавить("Остаток",							Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("КоэффициентУпаковки",				Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("ЕстьОшибки",						Новый ОписаниеТипов("Булево"));
	ТаблицаТоваров.Колонки.Добавить("ИндексКартинкиЕстьИзменения",		Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("НоменклатураНаименование",			Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("УпаковкаНаименование",				Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ХарактеристикаНаименование",		Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("Алкоголь",							Новый ОписаниеТипов("Булево"));
	ТаблицаТоваров.Колонки.Добавить("Маркируемый",						Новый ОписаниеТипов("Булево"));
	ТаблицаТоваров.Колонки.Добавить("КодВидаАлкогольнойПродукции",		Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ЕмкостьТары",						Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Крепость",							Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("ИННПроизводителя",					Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("КПППроизводителя",					Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ДоговорПлатежногоАгента",			Новый ОписаниеТипов("СправочникСсылка.ДоговорыПлатежныхАгентов"));
	ТаблицаТоваров.Колонки.Добавить("НомерСекции",						Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("ПризнакПредметаРасчета",			Новый ОписаниеТипов("ПеречислениеСсылка.ПризнакиПредметаРасчета"));
	ТаблицаТоваров.Колонки.Добавить("ПродаетсяВРозлив",					Новый ОписаниеТипов("Булево"));
	
	
	
	
	
	
	//
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//// определение номера секции товара
	//ТаблицаТовары = РезультатЗапроса.Выгрузить();
	//ТаблицаТовары.Свернуть("Номенклатура");
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Товары.Номенклатура КАК Ссылка
	//|ПОМЕСТИТЬ Товары
	//|ИЗ
	//|	&ТаблицаТовары КАК Товары
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Товары.Ссылка КАК Номенклатура,
	//|	Товары.Ссылка КАК НомерСтроки
	//|ИЗ
	//|	Товары КАК Товары
	//|ГДЕ
	//|	Товары.Ссылка ЕСТЬ НЕ NULL
	//|	И НЕ Товары.Ссылка.ЭтоГруппа";
	//
	//Запрос.УстановитьПараметр("ТаблицаТовары", ТаблицаТовары);
	//
	//ТаблицаТоварыДляСоответсвия = Запрос.Выполнить().Выгрузить();
	//
	//ТаблицаСоответствияТоваровСекциям = Новый Соответствие();
	//ПодключаемоеОборудованиеРТВызовСервера.ЗаполнитьСоответствиеСекцийДляТабличнойЧастиПоКассеККМ(
	//	Параметры.КассаККМ,
	//	ТаблицаТоварыДляСоответсвия,
	//	ТаблицаСоответствияТоваровСекциям
	//);
	//
	//ВыборкаПоКодам = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//
	//Пока ВыборкаПоКодам.Следующий() Цикл
	//	
	//	НоваяСтрока = ТаблицаТоваров.Добавить();
	//	
	//	Выборка = ВыборкаПоКодам.Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		
	//		Штрихкод = СокрЛП(Выборка.Штрихкод);
	//		
	//		Если НЕ ЗначениеЗаполнено(НоваяСтрока.PLU) Тогда
	//			
	//			НоваяСтрока.PLU								= Выборка.КодТовараPLU;
	//			НоваяСтрока.SKU								= Выборка.КодТовараSKU;
	//			НоваяСтрока.SKUГруппы						= ?(ВыгружатьГруппыТоваров, Выборка.SKUГруппы, 0);
	//			НоваяСтрока.Наименование					= ФормированиеПечатныхФормСервер.ПолучитьПредставлениеНоменклатурыДляПечати(Выборка.НоменклатураНаименование, Выборка.ХарактеристикаНаименование) + ?(ЗначениеЗаполнено(Выборка.УпаковкаНаименование),", " + Выборка.УпаковкаНаименование,"");
	//			НоваяСтрока.НаименованиеПолное				= ФормированиеПечатныхФормСервер.ПолучитьПредставлениеНоменклатурыДляПечати(Выборка.НоменклатураНаименованиеПолное, Выборка.ХарактеристикаНаименование) + ?(ЗначениеЗаполнено(Выборка.УпаковкаНаименование),", " + Выборка.УпаковкаНаименование,"");
	//			НоваяСтрока.Остаток							= Выборка.КоличествоОстаток;
	//			НоваяСтрока.ИндексКартинкиЕстьИзменения		= 0;
	//			НоваяСтрока.НомерСекции 					= ТаблицаСоответствияТоваровСекциям.Получить(Выборка.Номенклатура);
	//			
	//			НоваяСтрока.Штрихкод						= Штрихкод;
	//			
	//			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка,
	//				"Номенклатура,
	//				|Характеристика,
	//				|ЕдиницаИзмерения,
	//				|Группа,
	//				|ХарактеристикаНаименование,
	//				|Упаковка,
	//				|Весовой,
	//				|ЭтоГруппа,
	//				|Артикул,
	//				|Описание,
	//				|СтавкаНДС,
	//				|КоэффициентУпаковки,
	//				|ТипНоменклатуры,
	//				|УпаковкаНаименование,
	//				|НоменклатураНаименование,
	//				|Алкоголь,
	//				|Маркируемый,
	//				|КодВидаАлкогольнойПродукции,
	//				|ЕмкостьТары,
	//				|Крепость,
	//				|ИННПроизводителя,
	//				|КПППроизводителя,
	//				|Цена,
	//				|ДоговорПлатежногоАгента,
	//				|ПризнакПредметаРасчета,
	//				|ПродаетсяВРозлив
	//				|");
	//			
	//		Иначе
	//			НоваяСтрока.Штрихкод = НоваяСтрока.Штрихкод + " " + Штрихкод;
	//		КонецЕсли;
	//		
	//		Если ЗначениеЗаполнено(Штрихкод) Тогда
	//			НоваяСтрока.МассивШтрихкодов.Добавить(Штрихкод);
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//КонецЦикла;
	//
	//УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Процедура ЗаполнитьСтруктуруПрайсЛистаИзДанныхКВыгрузке(ПрайсЛистККМ, ТоварыКВыгрузке)
	
	Для Каждого ВыборкаПоНоменклатуре Из ТоварыКВыгрузке Цикл
		
		ЗаписьТовар = МенеджерОфлайнОборудования.ПолучитьЗаписьТовара();
		ЗаписьТовар.Наименование        = ВыборкаПоНоменклатуре.Наименование.НаименованиеПолное;
		ЗаписьТовар.Артикул             = ВыборкаПоНоменклатуре.Артикул;
		ЗаписьТовар.ЭтоВесовойТовар     = ВыборкаПоНоменклатуре.ЭтоВесовойТовар;
		ЗаписьТовар.ИмеетХарактеристики = ВыборкаПоНоменклатуре.ИмеетХарактеристики;
		ЗаписьТовар.ИмеетУпаковки       = ВыборкаПоНоменклатуре.ИмеетУпаковки;
		ЗаписьТовар.Код                 = Формат(ВыборкаПоНоменклатуре.Код, "ЧГ=0");
		ЗаписьТовар.КодГруппы           = Формат(ВыборкаПоНоменклатуре.КодГруппы, "ЧГ=0");
		ЗаписьТовар.КодЕдиницыИзмерения = Формат(ВыборкаПоНоменклатуре.КодЕдиницыИзмерения, "ЧГ=0");
		ЗаписьТовар.Цена                = ВыборкаПоНоменклатуре.Цена;
		ЗаписьТовар.Остаток             = ВыборкаПоНоменклатуре.Остаток;
		//ЗаписьТовар.Штрихкоды.Добавить(ВыборкаПоНоменклатуре.Штрихкоды);
		ЗаписатьШтрихкод(ВыборкаПоНоменклатуре, ЗаписьТовар);
		//ЗаписьТовар.СтавкаНДС           = ПолучитьСтавкуНДСККМ(ВыборкаПоНоменклатуре.СтавкаНДС);
		ЗаписьТовар.ЭтоАлкоголь         = ВыборкаПоНоменклатуре.ЭтоАлкоголь;
		ЗаписьТовар.УникальныйИдентификатор = ВыборкаПоНоменклатуре.Наименование.УникальныйИдентификатор();
		
		ПрайсЛистККМ.Товары.Добавить(ЗаписьТовар);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьШтрихкод(Выборка, Запись)
	
	ШтрихкодыМассив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Выборка.Штрихкод, " ", Истина);
	
	Для Каждого Штрихкод ИЗ ШтрихкодыМассив Цикл
		ДанныеШтрихкодаККМ = МенеджерОфлайнОборудования.ПолучитьЗаписьШтрихкода();
		ДанныеШтрихкодаККМ.Штрихкод = Штрихкод;
		
		Запись.Штрихкоды.Добавить(ДанныеШтрихкодаККМ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьОтчетыОПродажахИзККМ(ОфлайнОборудование, ДанныеОПродажах, Отказ, СообщениеОбОшибке) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Параметры = ПолучитьПараметрыУстройства(ОфлайнОборудование);
	Параметры.Вставить("КассаККМ",
		Справочники.КассыККМ.ПолучитьОсновнуюКассуККМ(ОфлайнОборудование.РабочееМесто)
	);
	
	Параметры.Вставить("Организация", Параметры.КассаККМ.Организация);
	
	МассивСозданныхДокументов = Новый Массив;
	
	ТаблицаТоваров 				= ПустаяТаблицаТоваров();
	ТаблицаВозвратов 			= ПустаяТаблицаТоваров();
	ТаблицаОплат 				= ПустаяТаблицаОплат();
	
	Для Каждого ОтчетОПродажах Из ДанныеОПродажах Цикл
		
		ТаблицаТоваров.Очистить();
		ТаблицаВозвратов.Очистить();
		ТаблицаОплат.Очистить();
		
		Для Каждого ЧекККМ Из ОтчетОПродажах.Чеки Цикл
			
			Если ЧекККМ.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств Тогда
				ЭтоЧекНаВозврат = Ложь;
				
			ИначеЕсли ЧекККМ.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств Тогда
				ЭтоЧекНаВозврат = Истина;
				
			Иначе
				Продолжить;
			КонецЕсли;
			
			СуммаТоваров = 0;
			
			Для Каждого СтрокаТЧ Из ЧекККМ.Товары Цикл
				
				Если НЕ (СтрокаТЧ.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаБезОплаты
					ИЛИ СтрокаТЧ.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой
					ИЛИ СтрокаТЧ.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСЧастичнойОплатой) Тогда
					
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = ТаблицаТоваров.Добавить();
				
				НоваяСтрока.Код 		= СтрокаТЧ.Код;
				НоваяСтрока.Количество 	= ?(ЭтоЧекНаВозврат, -СтрокаТЧ.Количество, СтрокаТЧ.Количество);
				НоваяСтрока.Сумма 		= ?(ЭтоЧекНаВозврат, -СтрокаТЧ.Сумма, СтрокаТЧ.Сумма);
				НоваяСтрока.Цена 		= СтрокаТЧ.Цена;
				НоваяСтрока.СтавкаНДС 	= ПолучитьСтавкуНДС(СтрокаТЧ.СтавкаНДС);
				НоваяСтрока.ШтрихкодАлкогольнойМарки = СтрокаТЧ.ШтрихкодАлкогольнойПродукции;
				
				НоваяСтрока.УникальныйИдентификатор = ОтчетОПродажах.УникальныйИдентификатор;
				
				СуммаТоваров = СуммаТоваров + СтрокаТЧ.Сумма;
				
				Если ЭтоЧекНаВозврат Тогда
					
					НоваяСтрока = ТаблицаВозвратов.Добавить();
					
					НоваяСтрока.Код 		= СтрокаТЧ.Код;
					НоваяСтрока.Количество 	= СтрокаТЧ.Количество;
					НоваяСтрока.Сумма 		= СтрокаТЧ.Сумма;
					НоваяСтрока.Цена 		= СтрокаТЧ.Цена;
					НоваяСтрока.СтавкаНДС 	= ПолучитьСтавкуНДС(СтрокаТЧ.СтавкаНДС);
					НоваяСтрока.ШтрихкодАлкогольнойМарки = СтрокаТЧ.ШтрихкодАлкогольнойПродукции;
					
				КонецЕсли;
				
			КонецЦикла;
			
			СуммаОплаты = 0;
			
			Для Каждого СтрокаТЧ Из ЧекККМ.Оплаты Цикл
				
				НоваяСтрока = ТаблицаОплат.Добавить();
				
				Если ЗначениеЗаполнено(СтрокаТЧ.КодВидаЭлектроннойОплаты) Тогда
					НоваяСтрока.КодВидаОплаты = СтрокаТЧ.КодВидаЭлектроннойОплаты;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТЧ.СуммаНаличнойОплаты) Тогда
					
					НоваяСтрока.Сумма = ?(ЭтоЧекНаВозврат, -СтрокаТЧ.СуммаНаличнойОплаты, СтрокаТЧ.СуммаНаличнойОплаты);
					НоваяСтрока.ТипОплаты = Справочники.ТипыОплат.Наличные;
					
				ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.СуммаЭлектроннойОплаты) Тогда
					
					НоваяСтрока.Сумма = ?(ЭтоЧекНаВозврат, -СтрокаТЧ.СуммаЭлектроннойОплаты, СтрокаТЧ.СуммаЭлектроннойОплаты);
					НоваяСтрока.ТипОплаты = Справочники.ТипыОплат.Безналичные;
					
				КонецЕсли;
				
				СуммаОплаты = СуммаОплаты + НоваяСтрока.Сумма;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ТаблицаТоваров.Свернуть("Код, Цена, СтавкаНДС, ШтрихкодАлкогольнойМарки, УникальныйИдентификатор", "Количество, Сумма, Скидка");
		ТаблицаВозвратов.Свернуть("Код, Цена, СтавкаНДС, ШтрихкодАлкогольнойМарки, УникальныйИдентификатор", "Количество, Сумма, Скидка");
		ТаблицаОплат.Свернуть("КодВидаОплаты, ТипОплаты", "Сумма");
		
		РеквизитыОтчета = Новый Структура;
		РеквизитыОтчета.Вставить("УникальныйИдентификатор", ОтчетОПродажах.УникальныйИдентификатор);
		РеквизитыОтчета.Вставить("Дата", ОтчетОПродажах.ДатаЗакрытияСмены);
		РеквизитыОтчета.Вставить("НомерСмены", ОтчетОПродажах.НомерСмены);
		
		ТаблицыДанных = Новый Структура("Товары, Оплаты, ВозвратыТоваров, Реквизиты");
		ТаблицыДанных.Товары = ТаблицаТоваров;
		ТаблицыДанных.Оплаты = ТаблицаОплат;
		ТаблицыДанных.ВозвратыТоваров = ТаблицаВозвратов;
		ТаблицыДанных.Реквизиты = РеквизитыОтчета;
		
		СоздатьИЗаполнитьОтчетОПродажах(МассивСозданныхДокументов, Параметры, ТаблицыДанных);
		
	КонецЦикла;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейсВыгрузкаТоваров

Функция ПолучитьТоварнуюСтроку() Экспорт
	
	ЭлементМассива = Новый Структура;
	ЭлементМассива.Вставить("КодВРегистре", 0);
	ЭлементМассива.Вставить("PLU", 0);
	ЭлементМассива.Вставить("Код", 0);
	ЭлементМассива.Вставить("Штрихкод", "");
	ЭлементМассива.Вставить("Артикул", "");
	ЭлементМассива.Вставить("Наименование", "");
	ЭлементМассива.Вставить("Цена", 0);
	ЭлементМассива.Вставить("ОписаниеТовара", "");
	ЭлементМассива.Вставить("СрокХранения");
	ЭлементМассива.Вставить("ЕдиницаСрокаХранения");
	ЭлементМассива.Вставить("БазаЦены", 0);
	ЭлементМассива.Вставить("Весовой", Ложь);
	ЭлементМассива.Вставить("ШтучноВесовой", Ложь);
	ЭлементМассива.Вставить("НомерЭтикетки", 0);
	ЭлементМассива.Вставить("НомерСообщения", 0);
	ЭлементМассива.Вставить("ВесТары", 0);
	ЭлементМассива.Вставить("Производитель", "");
	ЭлементМассива.Вставить("ВидСтандарта", "");
	ЭлементМассива.Вставить("НомерСтандарта", "");
	ЭлементМассива.Вставить("УсловияХранения", "");
	ЭлементМассива.Вставить("ЭнергетическаяЦенность", "");
	ЭлементМассива.Вставить("ЭнергетическаяЦенностьКДж", "");
	ЭлементМассива.Вставить("Удален", Ложь);
	ЭлементМассива.Вставить("ДатаИзготовления", Дата(1,1,1));
	ЭлементМассива.Вставить("КодГруппыТоваровВВесах", "");
	ЭлементМассива.Вставить("НаименованиеГруппыТоваровВВесах", "");
	ЭлементМассива.Вставить("ГруппаТоваровВВесах", "");
	
	Возврат ЭлементМассива;
	
КонецФункции

// Функция возвращает структуру с данными в формате, необходимом для выгрузки списка товаров в весы с печатью этикеток.
//
// Параметры:
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - Устройство для которого необходимо получить данные.
//  ТолькоИзмененные - Булево - Флаг получения только измененных данных.
//
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//  * Данные - Массив - Выгружаемые данные.
//  * КоличествоНеВыгруженныхСтрокСОшибками - Число - Количество строк с ошибками.
//  * ЧастичнаяВыгрузка - Булево - Признак частичной выгрузки.
//  * Параметры - Структура - см. функцию ПолучитьПараметрыУстройства.
//
Функция ПолучитьДанныеДляВесов(Устройство, ТолькоИзмененные = Истина, Параметры = Неопределено, МоментВремениГруппы = Неопределено) Экспорт
	
	Если НЕ Устройство = Неопределено Тогда
		Параметры = ПолучитьПараметрыУстройства(Устройство);
		Если Параметры = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Параметры.Вставить("ЧастичнаяВыгрузка", ТолькоИзмененные);
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Данные", Новый Массив);
	ВозвращаемоеЗначение.Вставить("КоличествоНеВыгруженныхСтрокСОшибками", 0);
	ВозвращаемоеЗначение.Вставить("ЧастичнаяВыгрузка", ТолькоИзмененные);
	ВозвращаемоеЗначение.Вставить("Параметры", Параметры);
	
	НомераЯчеекСПустымиЦенами = Новый Массив;
	
	Таблица = ДанныеТоваровДляВыгрузки(Устройство, Параметры, Истина,,НомераЯчеекСПустымиЦенами, МоментВремениГруппы);
	
	//МаксимальныйКодВесовогоТовара = ПодключаемоеОборудованиеOfflineВызовСервера.МаксимальныйКодВесовогоТовара();
	
	Для Каждого СтрокаТЧ Из Таблица Цикл
		
		//Если СтрокаТЧ.ЕстьОшибки Тогда
		//	ВозвращаемоеЗначение.КоличествоНеВыгруженныхСтрокСОшибками = ВозвращаемоеЗначение.КоличествоНеВыгруженныхСтрокСОшибками + 1;
		//	Продолжить;
		//КонецЕсли;
		
		ЭлементМассива = ПолучитьТоварнуюСтроку();
		
		// Все коды товаров в правилах выгрузки начинаются с 100000
		//Если СтрокаТЧ.Код > МаксимальныйКодВесовогоТовара Тогда
		//	ЭлементМассива.PLU = Число(СтрокаТЧ.Код - МаксимальныйКодВесовогоТовара);
		//Иначе
		//Мальцев А.Ю. +++
		Если Параметры.ГруппаТоваровОборудования.ВыгружатьВНомерЯчейкиАртикулНоменклатуры = Истина Тогда
			ЭлементМассива.PLU          = Число(СтрокаТЧ.Артикул);
		Иначе
			ЭлементМассива.PLU          = Число(СтрокаТЧ.НомерЯчейки);
		КонецЕсли;
		//Мальцев А.Ю. ---
		//ЭлементМассива.PLU          = Число(СтрокаТЧ.НомерЯчейки);
		ЭлементМассива.КодВРегистре = Число(СтрокаТЧ.НомерЯчейки);
		//ЭлементМассива.Код          = "00000000" + Сред(Прав(СокрЛП(СтрокаТЧ.ШтрихКод),5), 3);
		ШтрихКод = СокрЛП(СтрокаТЧ.ШтрихКод);
		Если СтрокаТЧ.Весовой И СтрДлина(ШтрихКод) = 7 Тогда
			ЭлементМассива.Код = ШтрихкодированиеВызовСервера.EAN13(Лев(ШтрихКод+"000000000000",12));
		ИначеЕсли СтрокаТЧ.ШтучноВесовой И СтрДлина(ШтрихКод) = 7 Тогда
			ЭлементМассива.Код = ШтрихкодированиеВызовСервера.EAN13(Лев(ШтрихКод+"000000000000",12));
		ИначеЕсли НЕ ПустаяСтрока(ШтрихКод) Тогда
			ЭлементМассива.Код = СокрЛП(ШтрихКод);
		КонецЕсли;
		ЭлементМассива.Артикул        = Строка(СтрокаТЧ.Артикул);
		ЭлементМассива.Наименование   = Строка(СтрокаТЧ.НаименованиеТовара);
		ЭлементМассива.ОписаниеТовара = СтрокаТЧ.ОписаниеТовара;
		ЭлементМассива.Цена           = СтрокаТЧ.Цена;
		ЭлементМассива.СрокХранения   = СтрокаТЧ.СрокХранения;
		ЭлементМассива.ЕдиницаСрокаХранения = СтрокаТЧ.ЕдиницаСрокаХранения;
		ЭлементМассива.Весовой        = СтрокаТЧ.Весовой;
		ЭлементМассива.ШтучноВесовой  = СтрокаТЧ.ШтучноВесовой;
		ЭлементМассива.Штрихкод       = СтрокаТЧ.Штрихкод;
		ЭлементМассива.НомерЭтикетки  = СтрокаТЧ.НомерЭтикетки;
		ЭлементМассива.НомерСообщения = СтрокаТЧ.НомерСообщения;
		ЭлементМассива.ВесТары        = СтрокаТЧ.ВесТары;
		ЭлементМассива.Производитель  = СтрокаТЧ.Производитель;
		ЭлементМассива.ВидСтандарта  = СтрокаТЧ.ВидСтандарта;
		ЭлементМассива.НомерСтандарта  = СтрокаТЧ.НомерСтандарта;
		ЭлементМассива.УсловияХранения  = СтрокаТЧ.УсловияХранения;
		ЭлементМассива.ЭнергетическаяЦенность  = СтрокаТЧ.ЭнергетическаяЦенность;
		Если ЗначениеЗаполнено(СтрокаТЧ.ЭнергетическаяЦенность) Тогда
			Попытка
				ЭнергетическаяЦенность = Число(ЭлементМассива.ЭнергетическаяЦенность);
				ЭлементМассива.ЭнергетическаяЦенностьКДж = СтрокаТЧ.ЭнергетическаяЦенность*4.184;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		ЭлементМассива.Удален  = СтрокаТЧ.Удален;
		ЭлементМассива.ДатаИзготовления  = СтрокаТЧ.ДатаИзготовления;
		//ЭлементМассива.КодГруппыТоваровВВесах  = СтрокаТЧ.КодГруппыТоваровВВесах;
		//ЭлементМассива.НаименованиеГруппыТоваровВВесах  = СтрокаТЧ.НаименованиеГруппыТоваровВВесах;
		//ЭлементМассива.ГруппаТоваровВВесах     = СтрокаТЧ.ГруппаТоваровВВесах;
		
		ВозвращаемоеЗначение.Данные.Добавить(ЭлементМассива);
		
	КонецЦикла;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	ДанныеСобытия = Новый Структура;
	ДанныеСобытия.Вставить("Устройство",        Устройство);
	ДанныеСобытия.Вставить("Параметры",         Параметры);
	ДанныеСобытия.Вставить("Данные",            ВозвращаемоеЗначение.Данные);
	ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
	
	Комментарий = "Количество записей: " + Формат(ВозвращаемоеЗначение.Данные.Количество(), "ЧН=0; ЧГ=");
	
	МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(Параметры.ГруппаТоваровОборудования, Устройство, "Получение данных для весов", Комментарий, ДанныеСобытия);
	
	Если НомераЯчеекСПустымиЦенами.Количество()>0 Тогда
		ДанныеСобытия = Новый Структура;
		ДанныеСобытия.Вставить("Устройство",        Устройство);
		ДанныеСобытия.Вставить("Параметры",         Параметры);
		ДанныеСобытия.Вставить("Данные",            НомераЯчеекСПустымиЦенами);
		ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
		
		Комментарий = "Количество записей: " + Формат(НомераЯчеекСПустымиЦенами.Количество(), "ЧН=0; ЧГ=");
		
		МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(Параметры.ГруппаТоваровОборудования, Устройство, "Номера ячеек весов с пустыми ценами", Комментарий, ДанныеСобытия);
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ДанныеТоваровДляВыгрузки(Устройство, Параметры, ОбновитьКодыТоваров = Ложь, Штрихкод = "", НомераЯчеекСПустымиЦенами = Неопределено, МоментВремениГруппы = Неопределено) Экспорт
	
	МоментИзменения = Дата(1,1,1);
	Если Параметры.ЧастичнаяВыгрузка Тогда
		
		Если НЕ Устройство = Неопределено Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	ЕСТЬNULL(МАКСИМУМ(МоментыПоследнейЗагрузки.МоментПоследнейЗагрузки), ДатаВремя(1,1,1)) КАК МоментИзменения
			|ИЗ
			|	РегистрСведений.МоментыПоследнейЗагрузки КАК МоментыПоследнейЗагрузки
			|ГДЕ
			|	МоментыПоследнейЗагрузки.Оборудование = &Оборудование
			|";
			
			Запрос.УстановитьПараметр("Оборудование", Устройство);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				МоментИзменения = Выборка.МоментИзменения;
			КонецЕсли;
		ИначеЕсли НЕ МоментВремениГруппы = Неопределено Тогда
			МоментИзменения = МоментВремениГруппы;
		КонецЕсли;
		
	КонецЕсли;
	
	МаксимальныйУровень = 1;
	Подразделения = Новый Массив;
	ТекущееПодразделение = Параметры.Подразделение;
	Пока ЗначениеЗаполнено(ТекущееПодразделение) Цикл
		Подразделения.Добавить(ТекущееПодразделение);
		ТекущееПодразделение = ТекущееПодразделение.Родитель;
		МаксимальныйУровень = МаксимальныйУровень + 1;
	КонецЦикла;
	
	Подразделения.Добавить(Справочники.ПодразделенияКомпании.ПустаяСсылка());
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МоментИзменения",       МоментИзменения);
	Запрос.УстановитьПараметр("ТипЦен",                Параметры.ТипЦен);
	Запрос.УстановитьПараметр("ГруппаТоваров",         Параметры.ГруппаТоваровОборудования);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Параметры.Подразделение);
	Запрос.УстановитьПараметр("ЗалОбслуживания",       Параметры.ОсновнойОтдел);
	Запрос.УстановитьПараметр("ТекущаяДата",           ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Подразделения",         Подразделения);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыВОборудовании.Номенклатура КАК Номенклатура
	//|	Цены.Период,
	//|	Цены.ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Цены КАК Цены
	|ПО
	|	ТоварыВОборудовании.Номенклатура = Цены.Номенклатура И 
	|	Цены.ТипЦен = &ТипЦен И 
	|	Цены.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
	|	Цены.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И 
	|	Цены.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка) И 
	|	ТоварыВОборудовании.МоментИзменения < Цены.Период
	|ГДЕ
	|	ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваров И 
	|	ТоварыВОборудовании.МоментИзменения < Цены.Период И 
	|	ТоварыВОборудовании.ВыполненаПечатьЦенников = Истина И 
	|	Цены.ТипЦен = &ТипЦен И 
	|	Цены.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
	|	Цены.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И 
	|	Цены.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка) И 
	|	Цены.Период <= &ТекущаяДата И 
	|	Цены.Активность И 
	|	Цены.ПодразделениеКомпании В (&ПодразделениеКомпании)
	|";
	
	НаборЗаписей = РегистрыСведений.ТоварыВОборудовании.СоздатьНаборЗаписей();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей.Отбор.ГруппаТоваров.Установить(Параметры.ГруппаТоваровОборудования);
		НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
		НаборЗаписей.Прочитать();
		Для Каждого ТекущаяЗапись ИЗ НаборЗаписей Цикл
			ТекущаяЗапись.МоментИзменения = ТекущаяДатаСеанса();
		КонецЦикла;
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкидкиВОборудовании.Номенклатура КАК Номенклатура,
	|	СкидкиВОборудовании.НачалоДействия,
	|	СкидкиВОборудовании.КонецДействия,
	|	СкидкиВОборудовании.Скидка,
	|	СкидкиВОборудовании.Свойство,
	|	ИСТИНА КАК Действует
	|ИЗ
	|	РегистрСведений.СкидкиВОборудовании КАК СкидкиВОборудовании
	|ГДЕ
	|	СкидкиВОборудовании.ПодразделениеКомпании = &ПодразделениеКомпании И 
	|	СкидкиВОборудовании.МоментИзменения < &МоментИзменения И 
	|	СкидкиВОборудовании.СпособВычисления = ЗНАЧЕНИЕ(Перечисление.СкидкиСпособВычисления.ФиксированнаяЦена) И 
	|	СкидкиВОборудовании.Действует И 
	|	СкидкиВОборудовании.МоментИзменения < СкидкиВОборудовании.НачалоДействия И 
	|	СкидкиВОборудовании.НачалоДействия <= &ТекущаяДата И 
	|	(НЕ СкидкиВОборудовании.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаШтрихкодТовара))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкидкиВОборудовании.Номенклатура КАК Номенклатура,
	|	СкидкиВОборудовании.НачалоДействия,
	|	СкидкиВОборудовании.КонецДействия,
	|	СкидкиВОборудовании.Скидка,
	|	СкидкиВОборудовании.Свойство,
	|	ЛОЖЬ КАК Действует
	|ИЗ
	|	РегистрСведений.СкидкиВОборудовании КАК СкидкиВОборудовании
	|ГДЕ
	|	СкидкиВОборудовании.ПодразделениеКомпании = &ПодразделениеКомпании И 
	|	СкидкиВОборудовании.МоментИзменения < &МоментИзменения И 
	|	СкидкиВОборудовании.СпособВычисления = ЗНАЧЕНИЕ(Перечисление.СкидкиСпособВычисления.ФиксированнаяЦена) И 
	|	СкидкиВОборудовании.Действует И 
	|	СкидкиВОборудовании.МоментИзменения < СкидкиВОборудовании.КонецДействия И 
	|	СкидкиВОборудовании.КонецДействия <= &ТекущаяДата И 
	|	(НЕ СкидкиВОборудовании.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаШтрихкодТовара))
	|";
	
	НаборЗаписей = РегистрыСведений.СкидкиВОборудовании.СоздатьНаборЗаписей();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
		НаборЗаписей.Отбор.НачалоДействия.Установить(Выборка.НачалоДействия);
		НаборЗаписей.Отбор.КонецДействия.Установить(Выборка.КонецДействия);
		НаборЗаписей.Отбор.Скидка.Установить(Выборка.Скидка);
		НаборЗаписей.Отбор.Свойство.Установить(Выборка.Свойство);
		НаборЗаписей.Прочитать();
		Для Каждого ТекущаяЗапись ИЗ НаборЗаписей Цикл
			ТекущаяЗапись.Действует       = Выборка.Действует;
			ТекущаяЗапись.МоментИзменения = ТекущаяДатаСеанса();
		КонецЦикла;
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//МаксимальныйУровень = 1;
	//Подразделения = Новый Массив;
	//ТекущееПодразделение = Параметры.Подразделение;
	//Пока ЗначениеЗаполнено(ТекущееПодразделение) Цикл
	//	Подразделения.Добавить(ТекущееПодразделение);
	//	ТекущееПодразделение = ТекущееПодразделение.Родитель;
	//	МаксимальныйУровень = МаксимальныйУровень + 1;
	//КонецЦикла;
	//
	//Подразделения.Добавить(Справочники.ПодразделенияКомпании.ПустаяСсылка());
	
	Уровень             = 1;
	ТекстЗапросаЦен     = "";
	ТекстПоказателяЦены = "";
	Для Каждого ТекущееПодразделение Из Подразделения Цикл
		
		ТекстУровня = Строка(Уровень);
		
		Запрос.УстановитьПараметр("ПодразделениеКомпании" + ТекстУровня, ТекущееПодразделение);
		
		ТекстПоказателяЦены = ТекстПоказателяЦены + "
		|		КОГДА МИНИМУМ(ВложенныйЗапрос.Приоритет)="+ТекстУровня+" ТОГДА
		|			МАКСИМУМ(ВложенныйЗапрос.Цена"+ТекстУровня+")";
		
		ТекстВыборкиЦены = "";
		ВложенныйУровень = 1;
		Пока ВложенныйУровень <= МаксимальныйУровень Цикл
			ТекстВыборкиЦены = ТекстВыборкиЦены + ",
			|	" + ?(ВложенныйУровень = Уровень, "ЦеныСрезПоследних.Цена", "0")+" КАК Цена"+Строка(ВложенныйУровень);
			ВложенныйУровень = ВложенныйУровень + 1;
		КонецЦикла;
		
		ТекстЗапросаЦен = ТекстЗапросаЦен + ?(Уровень = 1, "", Символы.ПС+" ОБЪЕДИНИТЬ ВСЕ") + "
		|ВЫБРАТЬ
		|	ЦеныСрезПоследних.Номенклатура,
		|	ЦеныСрезПоследних.ЕдиницаИзмерения,
		|	" + ТекстУровня + " КАК Приоритет" + ТекстВыборкиЦены + "
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(&ТекущаяДата,
		|		ТипЦен = &ТипЦен
		|		И ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|		И ПодразделениеКомпании = &ПодразделениеКомпании" + ТекстУровня +"
		|		И Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|		И ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		|		И Номенклатура В (ВЫБРАТЬ ТоварыВОборудовании.Номенклатура ИЗ ТоварыВОборудовании)) КАК ЦеныСрезПоследних";
		
		Уровень = Уровень + 1;
		
	КонецЦикла;
	
	ТекстЗапросаЦены = "
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ЕдиницаИзмерения,
	|	ВЫБОР
	|		"+ТекстПоказателяЦены+"
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ
	|	ТаблицаЦен
	|ИЗ
	|	("+ТекстЗапросаЦен+") КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ЕдиницаИзмерения
	|";
	
	//сформируем текст запроса
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТоварыВОборудовании.Номенклатура КАК Номенклатура,
	|	ТоварыВОборудовании.НомерЯчейки КАК НомерЯчейки,
	|	ТоварыВОборудовании.Штрихкод
	|ПОМЕСТИТЬ
	|	ТоварыВОборудовании
	|ИЗ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ГДЕ
	|	ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваров
	|	И ТоварыВОборудовании.ВыполненаПечатьЦенников = ИСТИНА
	|	И ТоварыВОборудовании.МоментИзменения >= &МоментИзменения
	//|	И ТоварыВОборудовании.Штрихкод = """"
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкидкиВОборудовании.Номенклатура КАК Номенклатура,
	|	ТоварыВОборудовании.НомерЯчейки КАК НомерЯчейки,
	|	ТоварыВОборудовании.Штрихкод
	|ИЗ
	|	РегистрСведений.СкидкиВОборудовании КАК СкидкиВОборудовании
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ПО
	|	СкидкиВОборудовании.Номенклатура = ТоварыВОборудовании.Номенклатура И 
	|	ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваров
	|	И ТоварыВОборудовании.Штрихкод = """"
	|	И ТоварыВОборудовании.ВыполненаПечатьЦенников = ИСТИНА
	|ГДЕ
	|	СкидкиВОборудовании.ПодразделениеКомпании = &ПодразделениеКомпании И 
	|	СкидкиВОборудовании.МоментИзменения >= &МоментИзменения И 
	|	СкидкиВОборудовании.СпособВычисления = ЗНАЧЕНИЕ(Перечисление.СкидкиСпособВычисления.ФиксированнаяЦена) И 
	|	ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваров И 
	|	(НЕ СкидкиВОборудовании.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаШтрихкодТовара))
	|;
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ШтрихКоды.ШтрихКод,"""") КАК ШтрихКод,
	|	ТоварыВОборудовании.Номенклатура КАК Номенклатура,
	|	ТоварыВОборудовании.НомерЯчейки КАК НомерЯчейки
	|ПОМЕСТИТЬ
	|	ШтрихкодыВОборудовании
	|ИЗ
	|	ТоварыВОборудовании КАК ТоварыВОборудовании
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ПО
	|	ТоварыВОборудовании.Номенклатура = Штрихкоды.Объект И 
	|	ШтрихКоды.ОсновнойШтрихкод = ИСТИНА И 
	|	ТоварыВОборудовании.Штрихкод = """" И 
	|	ШтрихКоды.Запрет = ЛОЖЬ 
	|ГДЕ
	|	ТоварыВОборудовании.Штрихкод = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВОборудовании.Штрихкод КАК Штрихкод,
	|	ТоварыВОборудовании.Номенклатура КАК Номенклатура,
	|	ТоварыВОборудовании.НомерЯчейки КАК НомерЯчейки
	|ИЗ
	|	ТоварыВОборудовании КАК ТоварыВОборудовании
	|ГДЕ
	|	(НЕ ТоварыВОборудовании.Штрихкод = """")
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СкидкиВОборудовании.НачалоДействия,
	|	СкидкиВОборудовании.ЗначениеСкидки КАК ЗначениеСкидки,
	|	СкидкиВОборудовании.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ
	|	СкидкиВОборудовании
	|ИЗ
	|	РегистрСведений.СкидкиВОборудовании КАК СкидкиВОборудовании
	|ГДЕ
	|	СкидкиВОборудовании.ПодразделениеКомпании = &ПодразделениеКомпании И 
	|	СкидкиВОборудовании.Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ТоварыВОборудовании) И 
	//|	СкидкиВОборудовании.МоментИзменения >= &МоментИзменения И 
	|	СкидкиВОборудовании.СпособВычисления = ЗНАЧЕНИЕ(Перечисление.СкидкиСпособВычисления.ФиксированнаяЦена) И 
	|	СкидкиВОборудовании.Действует И 
	|	(СкидкиВОборудовании.НачалоДействия <= &МоментИзменения ИЛИ 
	|	СкидкиВОборудовании.НачалоДействия = ДатаВремя(1,1,1)) И 
	|	(СкидкиВОборудовании.КонецДействия >= &МоментИзменения ИЛИ 
	|	СкидкиВОборудовании.КонецДействия = ДатаВремя(1,1,1)) И 
	|	(НЕ СкидкиВОборудовании.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаШтрихкодТовара))
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаСкидок.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ТаблицаСкидок.НачалоДействия) КАК НачалоДействия
	|ПОМЕСТИТЬ
	|	ТаблицаСкидокСрез
	|ИЗ
	|	СкидкиВОборудовании КАК ТаблицаСкидок
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСкидок.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаСкидокСрез.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(ТаблицаСкидок.ЗначениеСкидки) КАК Скидка
	|ПОМЕСТИТЬ
	|	ТаблицаСкидок
	|ИЗ
	|	ТаблицаСкидокСрез КАК ТаблицаСкидокСрез
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	СкидкиВОборудовании КАК ТаблицаСкидок
	|ПО
	|	ТаблицаСкидок.Номенклатура = ТаблицаСкидокСрез.Номенклатура И 
	|	ТаблицаСкидок.НачалоДействия = ТаблицаСкидокСрез.НачалоДействия
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСкидокСрез.Номенклатура
	|;
	| " + ТекстЗапросаЦены + "
	//|ВЫБРАТЬ
	//|	ЦеныСрезПоследних.Номенклатура,
	//|	ЦеныСрезПоследних.ЕдиницаИзмерения,
	//|	ЦеныСрезПоследних.Цена
	//|ПОМЕСТИТЬ
	//|	ТаблицаЦен
	//|ИЗ
	//|	РегистрСведений.Цены.СрезПоследних(&ТекущаяДата,
	//|		ТипЦен = &ТипЦен
	//|		И ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	//|		И ПодразделениеКомпании = &ПодразделениеКомпании
	//|		И Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|		И ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	//|		И Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ТоварыВОборудовании)) КАК ЦеныСрезПоследних
	|;
	|
	|ВЫБРАТЬ
	|	УценкаТовара.Номенклатура,
	|	УценкаТовара.ШтрихКод,
	|	УценкаТовара.Приоритет,
	|	&ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	МАКСИМУМ(УценкаТовара.Период) КАК Период
	|ПОМЕСТИТЬ
	|	СрезУценкаТовара
	|ИЗ
	|	РегистрСведений.УценкаТовара КАК УценкаТовара
	|ГДЕ
	|	УценкаТовара.ПодразделениеКомпании = &ПодразделениеКомпании 
	|	И УценкаТовара.Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ТоварыВОборудовании)
	|	И (УценкаТовара.ЗалОбслуживания = ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка) ИЛИ 
	|		УценкаТовара.ЗалОбслуживания = &ЗалОбслуживания)
	|	И УценкаТовара.Действует
	|СГРУППИРОВАТЬ ПО
	|	УценкаТовара.Номенклатура,
	|	УценкаТовара.ШтрихКод,
	|	УценкаТовара.Приоритет
	|;
	|
	|ВЫБРАТЬ
	|	СрезУценкаТовара.Номенклатура,
	|	СрезУценкаТовара.ШтрихКод,
	|	УценкаТовара.ЗначениеСкидки,
	|	УценкаТовара.СпособВычисления,
	|	УценкаТовара.Приоритет,
	|	УценкаТовара.ВариантОкругления
	|ПОМЕСТИТЬ
	|	УценкаТовараСПриоритетом
	//|	УценкаТовара
	|ИЗ
	|	СрезУценкаТовара КАК СрезУценкаТовара
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УценкаТовара КАК УценкаТовара
	|ПО
	|	СрезУценкаТовара.Номенклатура = УценкаТовара.Номенклатура И 
	|	СрезУценкаТовара.ШтрихКод = УценкаТовара.ШтрихКод И 
	|	СрезУценкаТовара.Период = УценкаТовара.Период И 
	|	СрезУценкаТовара.Приоритет = УценкаТовара.Приоритет И 
	|	СрезУценкаТовара.ПодразделениеКомпании = УценкаТовара.ПодразделениеКомпании И 
	|	УценкаТовара.Действует
	|ГДЕ
	|	(УценкаТовара.ЗалОбслуживания = ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка) ИЛИ 
	|	УценкаТовара.ЗалОбслуживания = &ЗалОбслуживания)
	|;
	|
	|ВЫБРАТЬ
	|	УценкаТовара.Номенклатура,
	|	УценкаТовара.ШтрихКод,
	|	МАКСИМУМ(УценкаТовара.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ
	|	СрезУценкаТовараСПриоритетом
	|ИЗ
	|	УценкаТовараСПриоритетом КАК УценкаТовара
	|СГРУППИРОВАТЬ ПО
	|	УценкаТовара.Номенклатура,
	|	УценкаТовара.ШтрихКод
	|;
	|
	|ВЫБРАТЬ
	|	СрезУценкаТовара.Номенклатура,
	|	СрезУценкаТовара.ШтрихКод,
	|	УценкаТовара.ЗначениеСкидки,
	|	УценкаТовара.СпособВычисления,
	|	УценкаТовара.ВариантОкругления
	|ПОМЕСТИТЬ
	|	УценкаТовара
	|ИЗ
	|	СрезУценкаТовараСПриоритетом КАК СрезУценкаТовара
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	УценкаТовараСПриоритетом КАК УценкаТовара
	|ПО
	|	СрезУценкаТовара.Номенклатура = УценкаТовара.Номенклатура И 
	|	СрезУценкаТовара.ШтрихКод = УценкаТовара.ШтрихКод И 
	|	СрезУценкаТовара.Приоритет = УценкаТовара.Приоритет
	|;
	|
	|ВЫБРАТЬ
	|	УценкаТовара.Номенклатура,
	|	УценкаТовара.ШтрихКод,
	|	ИСТИНА КАК Удален
	|ПОМЕСТИТЬ
	|	УдаленнаяУценкаТовара
	|ИЗ
	|	РегистрСведений.УценкаТовара КАК УценкаТовара
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	СрезУценкаТовара КАК СрезУценкаТовара
	|ПО
	|	УценкаТовара.Номенклатура = СрезУценкаТовара.Номенклатура И 
	|	УценкаТовара.Действует = ЛОЖЬ
	|ГДЕ
	|	УценкаТовара.ПодразделениеКомпании = &ПодразделениеКомпании
	|	И (УценкаТовара.ЗалОбслуживания = ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка) ИЛИ 
	|		УценкаТовара.ЗалОбслуживания = &ЗалОбслуживания) И 
	|	УценкаТовара.Действует = ЛОЖЬ
	|СГРУППИРОВАТЬ ПО
	|	УценкаТовара.Номенклатура,
	|	УценкаТовара.ШтрихКод
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА УценкаТовара.ШтрихКод = СрезУценкаТовара.ШтрихКод ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ) = ЛОЖЬ
	|;
	|
	|ВЫБРАТЬ
	|	ТоварыВОборудовании.НомерЯчейки КАК НомерЯчейки,
	|	ТоварыВОборудовании.ШтрихКод КАК ШтрихКод,
	|	ТоварыВОборудовании.Номенклатура КАК Номенклатура,
	|	ТоварыВОборудовании.Номенклатура.Наименование КАК НаименованиеТовара,
	|	ТоварыВОборудовании.Номенклатура.Код КАК Код,
	|	ТоварыВОборудовании.Номенклатура.Артикул КАК Артикул,
	|	ТоварыВОборудовании.Номенклатура.ТипНоменклатуры.Весовой КАК Весовой,
	|	ТоварыВОборудовании.Номенклатура.ТипНоменклатуры.ШтучноВесовой КАК ШтучноВесовой,
	|	ТоварыВОборудовании.Номенклатура.Описание КАК ОписаниеТовара,
	//Мальцев А.Ю. +++ Перенастройка параметра выгрузки на версы СрокХранения нового параметра 
	//|	ТоварыВОборудовании.Номенклатура.СрокХраненияТовара КАК СрокХранения,
	|	Выбор Когда ТоварыВОборудовании.Номенклатура.итСрокГодностиВНарезке = 0 Тогда ТоварыВОборудовании.Номенклатура.СрокХраненияТовара Иначе ТоварыВОборудовании.Номенклатура.итСрокГодностиВНарезке КОНЕЦ КАК СрокХранения,
	//|	ТоварыВОборудовании.Номенклатура.ЕдиницаИзмеренияСрокаХранения КАК ЕдиницаСрокаХранения,
	|	Выбор Когда ТоварыВОборудовании.Номенклатура.итСрокГодностиВНарезке = 0 Тогда ТоварыВОборудовании.Номенклатура.ЕдиницаИзмеренияСрокаХранения ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.Час) Конец КАК ЕдиницаСрокаХранения,
	//Мальцев А.Ю. ---	
	|	ТоварыВОборудовании.Номенклатура.Производитель.Наименование КАК Производитель,
	|	ТоварыВОборудовании.Номенклатура.ВидСтандарта КАК ВидСтандарта,
	|	ТоварыВОборудовании.Номенклатура.НомерСтандарта КАК НомерСтандарта,
	|	ТоварыВОборудовании.Номенклатура.УсловияХранения КАК УсловияХранения,
	|	ТоварыВОборудовании.Номенклатура.ЭнергетическаяЦенность КАК ЭнергетическаяЦенность,
	|	ТоварыВОборудовании.Номенклатура.ШтрихКодСвежесть КАК ШтрихКодСвежесть,
	|	ЕСТЬNULL(МАКСИМУМ(ЦеныСрезПоследних.Цена), 0) КАК Цена,
	|	ЕСТЬNULL(МАКСИМУМ(ТаблицаСкидок.Скидка), 0) КАК Скидка,
	|	МАКСИМУМ(УценкаТовара.ЗначениеСкидки) КАК ЗначениеСкидки,
	|	МАКСИМУМ(УценкаТовара.СпособВычисления) КАК СпособВычисления,
	|	МАКСИМУМ(УценкаТовара.ВариантОкругления) КАК ВариантОкругления,
	|	МАКСИМУМ(ЕСТЬNULL(УдаленнаяУценкаТовара.Удален, ЛОЖЬ)) КАК Удален,
	|	0 КАК НомерЭтикетки,
	|	0 КАК НомерСообщения,
	|	0 КАК ВесТары,
	|	0 КАК БазаЦены,
	|	ЕСТЬNULL(МАКСИМУМ(ОстаткиТоваров.ДатаИзготовления), ДатаВремя(1,1,1)) КАК ДатаИзготовления
	|ИЗ
	|	ШтрихкодыВОборудовании КАК ТоварыВОборудовании
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТаблицаЦен КАК ЦеныСрезПоследних
	|ПО
	|	ТоварыВОборудовании.Номенклатура = ЦеныСрезПоследних.Номенклатура
	|	И (ТоварыВОборудовании.Номенклатура.ОсновнаяЕдиницаИзмерения = ЦеныСрезПоследних.ЕдиницаИзмерения
	|	ИЛИ ЦеныСрезПоследних.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	УценкаТовара КАК УценкаТовара
	|ПО
	|	ТоварыВОборудовании.Номенклатура = УценкаТовара.Номенклатура И 
	|	ТоварыВОборудовании.ШтрихКод     = УценкаТовара.ШтрихКод
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ОстаткиТоваров КАК ОстаткиТоваров
	|ПО
	|	ТоварыВОборудовании.Номенклатура  = ОстаткиТоваров.Номенклатура И 
	|	ОстаткиТоваров.СкладКомпании = &ЗалОбслуживания
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТаблицаСкидок КАК ТаблицаСкидок
	|ПО
	|	ТоварыВОборудовании.Номенклатура = ТаблицаСкидок.Номенклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	УдаленнаяУценкаТовара КАК УдаленнаяУценкаТовара
	|ПО
	|	ТоварыВОборудовании.Номенклатура = УдаленнаяУценкаТовара.Номенклатура И 
	|	ТоварыВОборудовании.ШтрихКод     = УдаленнаяУценкаТовара.ШтрихКод
	|ГДЕ
	|	ТоварыВОборудовании.Номенклатура.ЭтоГруппа = Ложь
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВОборудовании.НомерЯчейки,
	|	ТоварыВОборудовании.ШтрихКод,
	|	ТоварыВОборудовании.Номенклатура
	|УПОРЯДОЧИТЬ ПО
	|	ТоварыВОборудовании.НомерЯчейки
	|";
	
	
	НомераЯчеекСПустымиЦенами = Новый Массив;
	
	// выполняем запрос
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		
		ТаблицаТоваров = Новый ТаблицаЗначений;
		Для Каждого ТекущаяКолонка Из РезультатЗапроса.Колонки Цикл
			ТаблицаТоваров.Колонки.Добавить(ТекущаяКолонка.Имя, Новый ОписаниеТипов(ТекущаяКолонка.ТипЗначения));
		КонецЦикла;
		
		ФиксированнаяЦена = Перечисления.СкидкиСпособВычисления.ФиксированнаяЦена;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			Если ЗначениеЗаполнено(Выборка.ШтрихКодСвежесть) И Выборка.ШтрихКодСвежесть = Выборка.Штрихкод Тогда
				
			ИначеЕсли ЗначениеЗаполнено(Выборка.Скидка) Тогда
				НоваяСтрока.Цена = Выборка.Скидка;
			ИначеЕсли Выборка.СпособВычисления = ФиксированнаяЦена Тогда
				НоваяСтрока.Цена = Выборка.ЗначениеСкидки;
			ИначеЕсли НЕ НоваяСтрока.Цена = 0 И ЗначениеЗаполнено(Выборка.ЗначениеСкидки) Тогда
				НоваяСтрока.Цена = НоваяСтрока.Цена - НоваяСтрока.Цена*(Выборка.ЗначениеСкидки/100);
				НоваяСтрока.Цена = Справочники.ВариантыОкругления.ОкруглитьЦену(Выборка.ВариантОкругления, НоваяСтрока.Цена);
			КонецЕсли;
			
			Если НоваяСтрока.Цена = 0 Тогда
				НомераЯчеекСПустымиЦенами.Добавить(Выборка.НомерЯчейки);
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		
		ОписаниеОшибки = НСтр("ru = 'При подготовке данных к выгрузке произошла ошибка.
		                            |Дополнительное описание:
		                            |%ДополнительноеОписание%'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", ИнформацияОбОшибке().Описание));
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Розничные продажи'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ТаблицаТоваров = Новый ТаблицаЗначений;
	КонецПопытки;
	
	Возврат ТаблицаТоваров;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьИЗаполнитьОтчетОПродажах(МассивСозданныхДокументов, РеквизитыККМ, ТаблицыДанных)
	
	ЗакрытиеСменыОбъект = Неопределено;
	
	Если ЗначениеЗаполнено(ТаблицыДанных.Реквизиты.УникальныйИдентификатор) Тогда
		
		УИ = ТаблицыДанных.Реквизиты.УникальныйИдентификатор;
		
		ДокументСсылка = Документы.ЗакрытиеСмены.ПолучитьСсылку(УИ);
		
		ЗакрытиеСменыОбъект = ДокументСсылка.ПолучитьОбъект();
		
		Если ЗакрытиеСменыОбъект = Неопределено Тогда
			ЗакрытиеСменыОбъект = Документы.ОтчетОРозничныхПродажах.СоздатьДокумент();
			ЗакрытиеСменыОбъект.УстановитьСсылкуНового(ДокументСсылка);
		КонецЕсли;
		
	Иначе
		
		ЗакрытиеСменыОбъект = Документы.ЗакрытиеСмены.СоздатьДокумент();
		
	КонецЕсли;
	
	ЗакрытиеСменыОбъект.Товары.Очистить();
	ЗакрытиеСменыОбъект.Оплаты.Очистить();
	
	ЗакрытиеСменыОбъект.ХозОперация        = Справочники.ХозОперации.ЗакрытиеСмены;
	ЗакрытиеСменыОбъект.Дата               = ТаблицыДанных.Реквизиты.Дата;
	ЗакрытиеСменыОбъект.КассаККМ           = РеквизитыККМ.КассаККМ;
	ЗакрытиеСменыОбъект.Организация        = РеквизитыККМ.Организация;
	
	ЗакрытиеСменыОбъект.Заполнить(Неопределено);
	
	Для Каждого СтрокаТовара Из ТаблицыДанных.Товары Цикл
		
		НоваяСтрока = ЗакрытиеСменыОбъект.Товары.Добавить();
		
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоКоду(СтрокаТовара.Код);
		НоваяСтрока.Количество = СтрокаТовара.Количество;
		НоваяСтрока.КоличествоПродано = СтрокаТовара.Количество;
		НоваяСтрока.Цена = СтрокаТовара.Цена;
		НоваяСтрока.Сумма = СтрокаТовара.Сумма;
		НоваяСтрока.СтавкаНДС = СтрокаТовара.СтавкаНДС;
		
	КонецЦикла;
	
	Для Каждого СтрокаОплат из ТаблицыДанных.Оплаты Цикл
		
		НоваяСтрока = ЗакрытиеСменыОбъект.Оплаты.Добавить();
		
		НоваяСтрока.Касса = РеквизитыККМ.КассаККМ;
		НоваяСтрока.ТипОплаты = СтрокаОплат.ТипОплаты;
		НоваяСтрока.Сумма = СтрокаОплат.Сумма;
		
	КонецЦикла;
	
	//Если НЕ ТаблицыДанных.ВозвратыТоваров = Неопределено Тогда
	//	
	//	ВыборкаПоВозвратам = ПолучитьВыборкуНоменклатуры(ТаблицыДанных.ВозвратыТоваров);
	//	
	//	Пока ВыборкаПоВозвратам.Следующий() Цикл
	//		
	//		Если НЕ ВыборкаПоВозвратам.Количество > 0 Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		НоваяСтрока = ЗакрытиеСменыОбъект.Товары.Добавить();
	//	
	//		НоваяСтрока.Номенклатура = ВыборкаПоТоварам.Номеклатура;
	//		НоваяСтрока.КоличествоПродано = ВыборкаПоТоварам.Количество;
	//		НоваяСтрока.Цена = ВыборкаПоТоварам.Цена;
	//		НоваяСтрока.Сумма = ВыборкаПоТоварам.Сумма;
	//		НоваяСтрока.СтавкаНДС = ВыборкаПоТоварам.СтавкаНДС;
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	//Если НЕ ТаблицыДанных.Оплаты = Неопределено Тогда
	//	
	//	
	//КонецЕсли;
	
	Попытка
		Если ЗакрытиеСменыОбъект.ПроверитьЗаполнение() Тогда
			ЗакрытиеСменыОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ЗакрытиеСменыОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	Исключение
		ЗакрытиеСменыОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
	МассивСозданныхДокументов.Добавить(ЗакрытиеСменыОбъект.Ссылка);
	
КонецПроцедуры

Функция ПустаяТаблицаТоваров()
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Код",        Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("Цена",       Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Скидка",     Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Сумма",      Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС",  Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
	ТаблицаТоваров.Колонки.Добавить("ШтрихкодАлкогольнойМарки", Новый ОписаниеТипов("Строка"));
	//ТаблицаТоваров.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
	ТаблицаТоваров.Колонки.Добавить("УникальныйИдентификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция ПустаяТаблицаОплат()
	
	ТаблицаОплат = Новый ТаблицаЗначений;
	ТаблицаОплат.Колонки.Добавить("КодВидаОплаты", Новый ОписаниеТипов("Строка"));
	ТаблицаОплат.Колонки.Добавить("Сумма",         Новый ОписаниеТипов("Число"));
	ТаблицаОплат.Колонки.Добавить("ТипОплаты",     Новый ОписаниеТипов("СправочникСсылка.ТипыОплат"));
	
	Возврат ТаблицаОплат;
	
КонецФункции

Функция ПолучитьСтавкуНДС(СтавкаНДСККМ)
	
	Если СтавкаНДСККМ = МенеджерОфлайнОборудования.ПолучитьСтавкуБезНДС() Тогда
		
		Возврат Справочники.СтавкиНДС.БезНДС;
		
	//ИначеЕсли СтавкаНДСККМ = МенеджерОфлайнОборудования.ПолучитьСтавкуНДС0() Тогда
	//	
	//	Возврат Справочники.СтавкиНДС.;
		
	ИначеЕсли СтавкаНДСККМ = МенеджерОфлайнОборудования.ПолучитьСтавкуНДС10() Тогда
		
		Возврат Справочники.СтавкиНДС.ОсновнаяСтавкаНДС10;
		
	ИначеЕсли СтавкаНДСККМ = МенеджерОфлайнОборудования.ПолучитьСтавкуНДС18() Тогда
		
		Возврат Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		
	ИначеЕсли СтавкаНДСККМ = МенеджерОфлайнОборудования.ПолучитьСтавкуНДС20() Тогда
		
		Возврат Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		
	КонецЕсли;
	
КонецФункции

Функция СформироватьКомментарий(Устройство)
	
	Комментарий = НСтр("ru = 'Загружено из ККМ Офлайн: %Устройство%'");
	Комментарий = СтрЗаменить(Комментарий, "%Устройство%", Устройство);
	
	Возврат Комментарий;
	
КонецФункции

Функция ПолучитьВыборкуНоменклатуры(ТаблицаТоваров)
	
	Запрос = Новый Запрос(
	
	"ВЫБРАТЬ
	|	Товары.Код КАК Код,
	|	Товары.Цена КАК Цена,
	|	Товары.Количество КАК Количество,
	|	Товары.Скидка КАК Скидка,
	|	Товары.Сумма КАК Сумма,
	|	Товары.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&ТаблицаЗначений КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Код КАК Код,
	|	ЕСТЬNULL(ТаблицаНоменклатур.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА Товары.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|			ТОГДА ТаблицаНоменклатур.СтавкаНДС
	|		ИНАЧЕ Товары.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДС
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТаблицаНоменклатур
	|		ПО Товары.Код = ТаблицаНоменклатур.Код");
	
	Запрос.УстановитьПараметр("ТаблицаЗначений", ТаблицаТоваров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

// получает момент последней загрузки оборудования по указанному виду данных
Функция ПолучитьМоментПоследнейЗагрузки(Оборудование, ВидЗагружаемойИнформации, НомерPOS = Неопределено) Экспорт
	
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	МоментыПоследнейЗагрузки.МоментПоследнейЗагрузки
	|ИЗ
	|	РегистрСведений.МоментыПоследнейЗагрузки КАК МоментыПоследнейЗагрузки
	|ГДЕ
	|	МоментыПоследнейЗагрузки.Оборудование = &Оборудование И 
	|	МоментыПоследнейЗагрузки.ВидЗагружаемойИнформации = &ВидЗагружаемойИнформации" + ?(НомерPOS = Неопределено, " И 
	|	МоментыПоследнейЗагрузки.НомерPOS = 0", " И 
	|	МоментыПоследнейЗагрузки.НомерPOS = &НомерPOS") + "
	|");
	Запрос.УстановитьПараметр("Оборудование",             Оборудование);
	Запрос.УстановитьПараметр("ВидЗагружаемойИнформации", ВидЗагружаемойИнформации);
	Запрос.УстановитьПараметр("НомерPOS",                 НомерPOS);
	
	МоментПоследнейЗагрузки='00010101';
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		МоментПоследнейЗагрузки = Выборка.МоментПоследнейЗагрузки;
	КонецЕсли;
	
	Возврат МоментПоследнейЗагрузки;
	
КонецФункции

#КонецОбласти
