// Модуль документа ВыпускПродукции


// Модуль объекта документа "Рецептура"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет контроль противоречий.
//
Процедура ВыполнитьПредварительныйКонтроль(Отказ)
	
	//// проверим нет ли уже таблице такой продукции
	//СтруктураОтбора = Новый Структура("Номенклатура",Строка.Номенклатура);
	//МассивНайденныхСтрок = Продукция.НайтиСтроки(СтруктураОтбора);
	//Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
	//	Если МассивНайденныхСтрок[Сч]<>Строка Тогда
	//		#Если Клиент Тогда
	//			Предупреждение("В таблице уже присутствует данная продукция!",обПраво("ТаймаутДиалогов"));
	//		#КонецЕсли
	//		Строка.Номенклатура=Неопределено;
	//		ОбработкаРеквизита("Продукция.Номенклатура",Строка,ЭтаФорма,ДопПараметры);
	//		Возврат Истина; 
	//	КонецЕсли;
	//КонецЦикла;
	
	//		// проверим соответствие продукции рецептуре
//		Если (НЕ обЗначениеНеЗаполнено(ТекСтрока.Рецептура) И НЕ обЗначениеНеЗаполнено(ТекСтрока.Номенклатура)) И ТекСтрока.Рецептура.Продукция<>ТекСтрока.Номенклатура Тогда
//			#Если Клиент Тогда
//				Предупреждение("Указанная рецептура не соответствует продукции!",обПраво("ТаймаутДиалогов"));
//			#КонецЕсли
//			ТекСтрока.Рецептура=Неопределено;
//		КонецЕсли;

//		Если ТекСтрока.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Продукция Тогда
//   			Сообщить("В табличную часть не может быть добавлен товар: "+ТекСтрока.Номенклатура);
//			ТекСтрока.Номенклатура=Неопределено;
//		КонецЕсли;
	
КонецПроцедуры

Функция ОбратныйОбходСтрокиДерева(СтрокаДерева, Полуфабрикат)
	
	Результат = Истина;
	
	Если СтрокаДерева.Номенклатура = Полуфабрикат Тогда
		Результат = Ложь;
	Иначе
		//Проверим более высокий уровень
		Если СтрокаДерева.Родитель<>Неопределено Тогда
			Результат = ОбратныйОбходСтрокиДерева(СтрокаДерева.Родитель, Полуфабрикат);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПовторныйОбходСтрокиДерева(СтрокаДерева, ОписаниеРецептуры, Полуфабрикат)
	
	Если СтрокаДерева.Родитель=Неопределено Тогда
		ОписаниеРецептуры = НСтр("ru = '* Продукция'") + Символы.НПП + "["+СокрЛП(СтрокаДерева.Номенклатура.Код)+"] "+СокрЛП(СтрокаДерева.Номенклатура) 
							+ НСтр("ru = ' по рецептуре - '") + СокрЛП(СтрокаДерева.Рецептура)+НСтр("ru = ' использует полуфабрикат - "+СокрЛП(Полуфабрикат))+НСтр("ru = ';")+Символы.ПС+ОписаниеРецептуры;
		
	Иначе
		ОписаниеРецептуры = НСтр("ru = '* Полуфабрикат - '") + Символы.НПП + "["+СокрЛП(СтрокаДерева.Номенклатура.Код)+"] "+СокрЛП(СтрокаДерева.Номенклатура) 
							+ НСтр("ru = ' по рецептуре - '") + СокрЛП(СтрокаДерева.Рецептура)+НСтр("ru = ' использует вложенный полуфабрикат - "+СокрЛП(Полуфабрикат))+НСтр("ru = ';")+Символы.ПС+ОписаниеРецептуры;
		
		ОписаниеРецептуры = ПовторныйОбходСтрокиДерева(СтрокаДерева.Родитель, ОписаниеРецептуры, СтрокаДерева.Номенклатура);
	КонецЕсли;
	
	Возврат ОписаниеРецептуры;
	
КонецФункции

Процедура ПроверитьСоставРецептуры(Рецепт, СтрокаДерева, ТекстОшибки, ЕстьОшибки)
	
	Для Каждого СтрокаРецепта ИЗ Рецепт.Товары Цикл
		
		ЭтоПолуфабрикат = СтрокаРецепта.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Продукция И (НЕ СтрокаРецепта.ЗапретитьВложенныйВыпуск);
		Если ЭтоПолуфабрикат Тогда
			Если ЗначениеЗаполнено(СтрокаРецепта.Рецептура) Тогда
				ВложенныйРецепт = СтрокаРецепта.Рецептура;
			Иначе
				ВложенныйРецепт = РасчетПроизводства.ПолучитьОсновнуюРецептуру(СтрокаРецепта.Номенклатура, Дата, Справочники.ХозОперации.Рецептура, ПодразделениеКомпании);
				Если НЕ ЗначениеЗаполнено(ВложенныйРецепт) Тогда
					ЭтоПолуфабрикат = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтоПолуфабрикат Тогда
			Если СтрокаРецепта.Номенклатура<>ВложенныйРецепт.Продукция Тогда
				ТекстОшибки = ТекстОшибки + НСтр("ru = 'В рецептуре'") + Символы.НПП + "["+СокрЛП(Рецепт.Код)+"] "+СокрЛП(Рецепт) 
							+ НСтр("ru = ' для полуфабриката '") + СокрЛП(СтрокаРецепта.Номенклатура)+НСтр("ru = ' не соответствует продукция "+СокрЛП(СтрокаРецепта.Рецептура.Продукция))+НСтр("ru = ' указанная во вложенной рецептуре "+СокрЛП(СтрокаРецепта.Рецептура)+".'");
				ЕстьОшибки = Истина;
			КонецЕсли;
			
			Результат = ОбратныйОбходСтрокиДерева(СтрокаДерева, СтрокаРецепта.Номенклатура);
			Если НЕ Результат Тогда
				ОписаниеРецептуры = ПовторныйОбходСтрокиДерева(СтрокаДерева,"",СтрокаРецепта.Номенклатура);
				ТекстОшибки = ТекстОшибки + Символы.ПС + "В рецептуре "+Рецепт+" содержится полуфабрикат '"+СтрокаРецепта.Номенклатура+"' который уже включен в список для вложенного выпуска продукции!" + Символы.ПС + ОписаниеРецептуры;
				ЕстьОшибки = Истина;
			КонецЕсли;
			НоваяСтрока = СтрокаДерева.Строки.Добавить();
			НоваяСтрока.Номенклатура = СтрокаРецепта.Номенклатура;
			НоваяСтрока.Рецептура    = ВложенныйРецепт;
			Если НЕ ЕстьОшибки Тогда
				ПроверитьСоставРецептуры(ВложенныйРецепт, НоваяСтрока, ТекстОшибки, ЕстьОшибки);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Рецептура".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Рецептура(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.НормыРазделки Тогда
		СтандартнаяОбработка = Ложь;
		Возврат Ложь;
	КонецЕсли;
	
	НоваяСтрока = Продукция.Добавить();
	НоваяСтрока.Номенклатура = ДанныеЗаполнения.Продукция;
	Документы.ОтчетПроизводстваЗаСмену.ПродукцияНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока);
	НоваяСтрока.Рецептура    = ДанныеЗаполнения;
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Рецептура()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

// вовзращает выборку по шапке
// ДокументСсылка - Ссылка на документ для которого получаем шапку
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	Док.Организация КАК Организация,
	//////////////////////
	|	Док.СкладКомпании КАК СкладКомпании
	|
	|ИЗ
	|	Документ.ОтчетПроизводстваЗаСмену КАК Док
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции

Процедура ДополнитьИтоговыеТаблицы(СтрокаТЧ,ТаблицаПродукцииИтоговая,ТаблицаИнгредиентовИтоговая,ПоследняяСтрока,ПоследняяСтрокаИнгредиента,ТекущийУровень=1,_ТипЦен,_ТипЦен2,РозничныйСклад,РежимПроведения, СводнаяТаблицаОстатков)
	
	КоэффициентРецептуры = СтрокаТЧ.Рецептура.Коэффициент*СтрокаТЧ.Рецептура.Количество;
	
	ТипБулево             = Новый ОписаниеТипов("Булево");
	ТипНоменклатура       = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ТипРецептура          = Новый ОписаниеТипов("ДокументСсылка.Рецептура");
	ТипЕдиница            = Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения");
	ТипЧисло10            = Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10));
	ТипЧисло10_3          = Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,3));
	ТипЧислоДляКоличества = Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(19,6));
	ТипЧислоДляЦены       = Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(19,2));
	ТипЧислоДляСуммы      = Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(19,2));
	
	ТаблицаПФ = Новый ТаблицаЗначений();
	ТаблицаПФ.Колонки.Добавить("НомерСтроки", ТипЧисло10);
	ТаблицаПФ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	ТаблицаПФ.Колонки.Добавить("Количество", ТипЧислоДляКоличества);
	ТаблицаПФ.Колонки.Добавить("ЕдиницаИзмерения", ТипЕдиница);
	ТаблицаПФ.Колонки.Добавить("Коэффициент", ТипЧисло10_3);
	ТаблицаПФ.Колонки.Добавить("Рецептура", ТипРецептура);
	ТаблицаПФ.Колонки.Добавить("ЦенаРозничная", ТипЧислоДляЦены);
	ТаблицаПФ.Колонки.Добавить("СуммаРозничная", ТипЧислоДляСуммы);
	
	ТаблицаПФ.Колонки.Добавить("ЭтоПолуфабрикат", ТипБулево);
	ТаблицаПФ.Колонки.Добавить("ДляПродукции", ТипНоменклатура);
	ТаблицаПФ.Колонки.Добавить("НомерСтрокиПродукции", ТипЧисло10);
	ТаблицаПФ.Колонки.Добавить("ЭтоДополнительныйВыпуск", ТипБулево);
	ТаблицаПФ.Колонки.Добавить("НомерСтрокиОсновнойТаблицы", ТипЧисло10);
	ТаблицаПФ.Колонки.Добавить("ЭтоСпеция", ТипБулево);
	ТаблицаПФ.Колонки.Добавить("УровеньПродукции", ТипЧисло10);
	
	ПодразделениеСклада = СкладКомпании.ПодразделениеКомпании;
	
	КонтролироватьПодразделениеРецептурПриВложенномВыпуске = ПолучитьЗначениеУчетнойПолитики("КонтролироватьПодразделениеРецептурПриВложенномВыпуске", ПодразделениеСклада, Дата);
	
	ХозОперацияРецептура = Справочники.ХозОперации.Рецептура;
	
	Для Каждого СтрокаРецепта ИЗ СтрокаТЧ.Рецептура.Товары Цикл
		//#Если Клиент Тогда
		//ОбработкаПрерыванияПользователя();
		//#КонецЕсли
		ПоследняяСтрокаИнгредиента=ПоследняяСтрокаИнгредиента+1;
		//Данные рецептуры
		// Данные текущей строки
		ЭтоСпеция=СтрокаРецепта.Специя;
		ЭтоПолуфабрикат=СтрокаРецепта.Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Продукция И НЕ СтрокаРецепта.ЗапретитьВложенныйВыпуск;
		//
		НовСтрИнгр=ТаблицаИнгредиентовИтоговая.Добавить();
		НовСтрИнгр.ПорядковыйНомерИнгредиента=СтрокаРецепта.НомерСтроки;
		//
		НовСтрИнгр.ДляПродукции=СтрокаТЧ.Номенклатура;
		НовСтрИнгр.НомерСтрокиПродукции=СтрокаТЧ.НомерСтроки;
		НовСтрИнгр.РецептураПродукции=СтрокаТЧ.Рецептура;
		Если ЭтоПолуфабрикат Тогда
			Если ЗначениеЗаполнено(СтрокаРецепта.Рецептура) Тогда
				НовСтрИнгр.Рецептура=СтрокаРецепта.Рецептура;
			Иначе
				НовСтрИнгр.Рецептура=РасчетПроизводства.ПолучитьОсновнуюРецептуру(СтрокаРецепта.Номенклатура, Дата, ХозОперацияРецептура, ПодразделениеКомпании);
				Если НЕ ЗначениеЗаполнено(НовСтрИнгр.Рецептура) Тогда
					ЭтоПолуфабрикат = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтоПолуфабрикат И КонтролироватьПодразделениеРецептурПриВложенномВыпуске Тогда //skud 22884
			Если НовСтрИнгр.Рецептура.Подразделения.Количество() = 0 Тогда
				Если НЕ НовСтрИнгр.Рецептура.ПодразделениеКомпании = ПодразделениеСклада Тогда
					ЭтоПолуфабрикат=Ложь;
				КонецЕсли;
			ИначеЕсли НовСтрИнгр.Рецептура.Подразделения.Найти(ПодразделениеСклада) = Неопределено Тогда
				ЭтоПолуфабрикат=Ложь;
			КонецЕсли;
		КонецЕсли;
		
		НовСтрИнгр.ЭтоПолуфабрикат = ЭтоПолуфабрикат;
		Рецепт=НовСтрИнгр.Рецептура;
		НовСтрИнгр.КоличествоПродукции=СтрокаТЧ.Количество*СтрокаТЧ.Коэффициент;
		НовСтрИнгр.ЦенаПродукцииРозничная=СтрокаТЧ.ЦенаРозничная;
		
		Если ТипЗнч(СтрокаТЧ)=Тип("СтрокаТаблицыЗначений") Тогда
			НовСтрИнгр.УровеньПродукции=СтрокаТЧ.УровеньПродукции;
		Иначе
			НовСтрИнгр.УровеньПродукции=0;
		КонецЕсли;
		НовСтрИнгр.Ингредиент=СтрокаРецепта.Номенклатура;
		НовСтрИнгр.ЭтоСпеция=ЭтоСпеция;
		НовСтрИнгр.КоличествоИнгредиентаФакт=0;
		
		Если ЭтоСпеция И НЕ ЭтоПолуфабрикат Тогда
			НовСтрИнгр.КоличествоИнгредиентаНаЕдиницуПродукции=СтрокаРецепта.Количество*СтрокаРецепта.Коэффициент/КоэффициентРецептуры;
			Если НовСтрИнгр.КоличествоИнгредиентаНаЕдиницуПродукции=0 Тогда
				НовСтрИнгр.КоличествоИнгредиентаНаЕдиницуПродукции=0.000001;
			КонецЕсли;
		Иначе
			НовСтрИнгр.КоличествоИнгредиентаНаЕдиницуПродукции=Окр(СтрокаРецепта.Количество*СтрокаРецепта.Коэффициент/КоэффициентРецептуры,3);
			Если НовСтрИнгр.КоличествоИнгредиентаНаЕдиницуПродукции=0 Тогда
				НовСтрИнгр.КоличествоИнгредиентаНаЕдиницуПродукции=0.001;
			КонецЕсли;
		КонецЕсли;
		//
		НовСтрИнгр.ЕдиницаИзмеренияИнгредиента=Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(СтрокаРецепта.Номенклатура);
		НовСтрИнгр.КоэффициентИнгредиента=1;
		//
		Если ЭтоСпеция И НЕ ЭтоПолуфабрикат Тогда
			НовСтрИнгр.КоличествоИнгредиентаНорма=СтрокаРецепта.Количество*СтрокаРецепта.Коэффициент*НовСтрИнгр.КоличествоПродукции/КоэффициентРецептуры;
			Если НовСтрИнгр.КоличествоИнгредиентаНорма=0 Тогда
				НовСтрИнгр.КоличествоИнгредиентаНорма=0.000001;
			КонецЕсли;
		Иначе
			НовСтрИнгр.КоличествоИнгредиентаНорма=Окр(СтрокаРецепта.Количество*СтрокаРецепта.Коэффициент*НовСтрИнгр.КоличествоПродукции/КоэффициентРецептуры,3);
			Если НовСтрИнгр.КоличествоИнгредиентаНорма=0 Тогда
				НовСтрИнгр.КоличествоИнгредиентаНорма=0.001;
			КонецЕсли;
		КонецЕсли;
		//
		Если РозничныйСклад Тогда
			НовСтрИнгр.ЦенаИнгредиентаРозничная = ЦенообразованиеСервер.ПолучитьЦену(_ТипЦен, СтрокаРецепта.Номенклатура, МоментВремени(),, ВалютаДокумента, КурсДокумента);
			Если НовСтрИнгр.ЦенаИнгредиентаРозничная=0 И (НЕ _ТипЦен2=Неопределено) Тогда
				//Попытаемся найти хотя бы цену склада
				НовСтрИнгр.ЦенаИнгредиентаРозничная = ЦенообразованиеСервер.ПолучитьЦену(_ТипЦен2, СтрокаРецепта.Номенклатура, МоментВремени(),, ВалютаДокумента, КурсДокумента);
			КонецЕсли;
		Иначе
			НовСтрИнгр.ЦенаИнгредиентаРозничная=0;
		КонецЕсли;
		//
		Если ЭтоПолуфабрикат Тогда		
			ПоследняяСтрока=ПоследняяСтрока+1;
			НовСтрИнгр.НомерСтрокиПолуфабриката=ПоследняяСтрока;
			НовСтрИнгр.УровеньПолуфабриката=ТекущийУровень;
			НовСтрИнгр.КоличествоИнгредиентаФакт=НовСтрИнгр.КоличествоИнгредиентаНорма;
			//СтрПФ
			СтрПФ=ТаблицаПФ.Добавить();
			СтрПФ.НомерСтроки=ПоследняяСтрока;
			СтрПФ.УровеньПродукции=ТекущийУровень;
			СтрПФ.Номенклатура=СтрокаРецепта.Номенклатура;
			СтрПФ.Рецептура=Рецепт;
			СтрПФ.ЕдиницаИзмерения=Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(СтрокаРецепта.Номенклатура);
			СтрПФ.Коэффициент=1;
			СтрПФ.Количество=НовСтрИнгр.КоличествоИнгредиентаНорма;
			СтрПФ.ЦенаРозничная=НовСтрИнгр.ЦенаИнгредиентаРозничная;
			СтрПФ.ЭтоПолуфабрикат=ЭтоПолуфабрикат;
			СтрПФ.ДляПродукции=НовСтрИнгр.ДляПродукции;
			СтрПФ.НомерСтрокиПродукции=НовСтрИнгр.НомерСтрокиПродукции;
			СтрПФ.ЭтоСпеция=ЭтоСпеция;
			
			//Ищем продукцию
			НайденнаяСтрока=Продукция.Найти(СтрокаРецепта.Номенклатура,"Номенклатура");
			Если НайденнаяСтрока=Неопределено Тогда
				НовСтрИнгр.ЭтоДополнительныйВыпуск=Ложь;
				НовСтрИнгр.НомерСтрокиОсновнойТаблицы=0;
				//
				СтрПФ.ЭтоДополнительныйВыпуск=Ложь;
				СтрПФ.НомерСтрокиОсновнойТаблицы=0;
			Иначе
				НовСтрИнгр.ЭтоДополнительныйВыпуск=Истина;
				НовСтрИнгр.НомерСтрокиОсновнойТаблицы=НайденнаяСтрока.НомерСтроки;
				//СтрПФ
				СтрПФ.ЭтоДополнительныйВыпуск=Истина;
				СтрПФ.НомерСтрокиОсновнойТаблицы=НайденнаяСтрока.НомерСтроки;
			КонецЕсли;
		Иначе
			//
			НовСтрИнгр.НомерСтрокиПолуфабриката=0;
			НовСтрИнгр.УровеньПолуфабриката=0;
			//
			НовСтрИнгр.ЭтоДополнительныйВыпуск=Ложь;
			НовСтрИнгр.НомерСтрокиОсновнойТаблицы=0;
		КонецЕсли;
		
	КонецЦикла;
	
	//Теперь добавляем полуфабрикаты для вложенного выпуска...
	МассивПФ=ТаблицаПФ.ВыгрузитьКолонку("Номенклатура");
	ДополнитьТаблицуОстатковПФ(МассивПФ,РежимПроведения, СводнаяТаблицаОстатков);
	Для Каждого СтрокаПФ ИЗ ТаблицаПФ Цикл
		НужноПересчитатьФакт=Ложь;
		//Сообщить(СтрокаПФ.Номенклатура);
		Если СтрокаПФ.ЭтоДополнительныйВыпуск Тогда
			//Не нужно проверять остаток - это дополнительный выпуск
			ДополнитьИтоговыеТаблицы(СтрокаПФ,ТаблицаПродукцииИтоговая,ТаблицаИнгредиентовИтоговая,ПоследняяСтрока,ПоследняяСтрокаИнгредиента,ТекущийУровень+1,_ТипЦен,_ТипЦен2,РозничныйСклад,РежимПроведения, СводнаяТаблицаОстатков);
			НужноПересчитатьФакт=Истина;
		Иначе
			СтрокаОстатка=СводнаяТаблицаОстатков.Найти(СтрокаПФ.Номенклатура,"Номенклатура");
			Если СтрокаОстатка=Неопределено Тогда
				//нет остатка
				ДополнитьИтоговыеТаблицы(СтрокаПФ,ТаблицаПродукцииИтоговая,ТаблицаИнгредиентовИтоговая,ПоследняяСтрока,ПоследняяСтрокаИнгредиента,ТекущийУровень+1,_ТипЦен,_ТипЦен2,РозничныйСклад,РежимПроведения, СводнаяТаблицаОстатков);
				НужноПересчитатьФакт=Истина;
			Иначе
				Если СтрокаОстатка.ОбщийОстаток>0 Тогда
					//
					//НадоСписать=СтрокаПФ.Количество*СтрокаПФ.Коэффициент;
					НадоСписать=СтрокаПФ.Количество;
					
					Если СтрокаОстатка.ОбщийОстаток>=НадоСписать Тогда
						//Остатка на складе достаточно для списания, доп. выпуск не нужен
						СтрокаОстатка.ОбщийОстаток=СтрокаОстатка.ОбщийОстаток-НадоСписать;
						СтрокаОстатка.РанееПередано=СтрокаОстатка.РанееПередано+НадоСписать;
						СтрокаПФ.Количество=0;
					Иначе
						//СтрокаПФ.Коэффициент=1 ВСЕГДА - см цикл выше. поэтому пересчет не делаем
						СтрокаПФ.Количество=НадоСписать-СтрокаОстатка.ОбщийОстаток;
						//Если СтрокаПФ.Коэффициент=1 ИЛИ СтрокаПФ.Коэффициент=0 Тогда
						//	СтрокаПФ.Количество=НадоСписать-СтрокаОстатка.ОбщийОстаток;
						//Иначе
						//	СтрокаПФ.Количество=(НадоСписать-СтрокаОстатка.ОбщийОстаток)/СтрокаПФ.Коэффициент;
						//КонецЕсли;
						СтрокаОстатка.ОбщийОстаток=0;
						СтрокаОстатка.РанееПередано=СтрокаОстатка.РанееПередано+СтрокаОстатка.ОбщийОстаток;
						ДополнитьИтоговыеТаблицы(СтрокаПФ,ТаблицаПродукцииИтоговая,ТаблицаИнгредиентовИтоговая,ПоследняяСтрока,ПоследняяСтрокаИнгредиента,ТекущийУровень+1,_ТипЦен,_ТипЦен2,РозничныйСклад,РежимПроведения, СводнаяТаблицаОстатков);
						НужноПересчитатьФакт=Истина;
					КонецЕсли;
				Иначе
					//нет остатка, но строка найдена: видимо, ранее передали все...
					ДополнитьИтоговыеТаблицы(СтрокаПФ,ТаблицаПродукцииИтоговая,ТаблицаИнгредиентовИтоговая,ПоследняяСтрока,ПоследняяСтрокаИнгредиента,ТекущийУровень+1,_ТипЦен,_ТипЦен2,РозничныйСклад,РежимПроведения, СводнаяТаблицаОстатков);
					НужноПересчитатьФакт=Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если НужноПересчитатьФакт Тогда
			СтруктураОтбора=Новый Структура();
			СтруктураОтбора.Вставить("НомерСтрокиПолуфабриката",СтрокаПФ.НомерСтроки);
			СтруктураОтбора.Вставить("УровеньПолуфабриката",СтрокаПФ.УровеньПродукции);
			СтруктураОтбора.Вставить("Ингредиент",СтрокаПФ.Номенклатура);
			Строки=ТаблицаИнгредиентовИтоговая.НайтиСтроки(СтруктураОтбора);
			Если Строки.Количество() > 0 Тогда
				Для Каждого СтрокаИнгр Из Строки Цикл
					СтрокаИнгр.КоличествоИнгредиентаФакт=СтрокаИнгр.КоличествоИнгредиентаФакт-СтрокаПФ.Количество;
					СтрокаИнгр.КоличествоИнгредиентаВыпустить=СтрокаПФ.Количество;
					//Сообщить(""+СтрокаИнгр.Ингредиент+": "+СтрокаИнгр.КоличествоИнгредиентаНорма+" - "+СтрокаИнгр.КоличествоИнгредиентаФакт);
				КонецЦикла;
			Иначе
			    //Хотя бы ругаемся
				Сообщить("Исключительная ситуация: не найдены строки для пересчета количества выпускаемых полуфабрикатов "+СтрокаПФ.Номенклатура,СтатусСообщения.Важное);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Дополняет строки в таблицу остатков ПФ
Процедура ДополнитьТаблицуОстатковПФ(ПФ,РежимПроведения,ДополняемаяТаблица) Экспорт
	
	СписыватьРезерв = (ПравоПользователя("РазрешениеСнятияРезервов", ЭтотОбъект)<>Перечисления.РезервыСпособыСписания.Запрещено);
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) КАК Количество,
	|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.РезервОстаток, 0) КАК Резерв,
	|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.СуммаРознОстаток, 0) КАК СуммаРозн,
	|	"+?(СписыватьРезерв,"ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0)","ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0)-ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.РезервОстаток, 0)")+" КАК ОбщийОстаток,
	|	0 КАК РанееПередано
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			&Момент,
	|			Номенклатура В (&Номенклатура)
	|				И СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровКомпанииОстатки
	|");
	
	Номенклатура2 = ДополняемаяТаблица.ВыгрузитьКолонку("Номенклатура");
	Сч = 0;
	
	Если Номенклатура2.Количество() > 0 Тогда
		Пока Сч < ПФ.Количество() Цикл
			Если НЕ Номенклатура2.Найти(ПФ[Сч]) = Неопределено Тогда
				ПФ.Удалить(Сч);
			Иначе
				Сч = Сч + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Момент",        ?(РежимПроведения=РежимПроведенияДокумента.Оперативный,Неопределено,МоментВремени()));
	Запрос.УстановитьПараметр("Номенклатура",  ПФ);
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	//>>++TREA
	
	ТаблицаДляБлокировки = Новый ТаблицаЗначений;
	ТаблицаДляБлокировки.Колонки.Добавить("Номенклатура");
	ТаблицаДляБлокировки.ЗагрузитьКолонку(ПФ, "Номенклатура");
	
	ЗначенияБлокировки = Новый Соответствие;
	ЗначенияБлокировки.Вставить("Период",        Новый Диапазон(, Дата));
	ЗначенияБлокировки.Вставить("СкладКомпании", СкладКомпании);
	
	СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы,ИмяТаблицы", "РегистрНакопления", "ОстаткиТоваровКомпании");
	СтруктураПараметровБлокировки.Вставить("ИсточникДанных", ТаблицаДляБлокировки);
	
	ОписаниеИсточника = Новый Соответствие;
	ОписаниеИсточника.Вставить("Номенклатура", "Номенклатура");
	
	ОбработкаСобытийДокументаСервер.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки, ОписаниеИсточника);
	
	РезультатОстатки=Запрос.Выполнить();
	Выборка=РезультатОстатки.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтр=ДополняемаяТаблица.добавить();
		НовСтр.Номенклатура=Выборка.Номенклатура;
		НовСтр.Количество=Выборка.Количество;
		НовСтр.Резерв=Выборка.Резерв;
		//НовСтр.СуммаРозн=Выборка.СуммаРозн;
		НовСтр.ОбщийОстаток=Выборка.ОбщийОстаток;
		НовСтр.РанееПередано=Выборка.РанееПередано;
	КонецЦикла;
	
	Возврат;
КонецПроцедуры

//Функция КурсСучетомКратности(НаДату,Валюта) Экспорт
//	Если обЗначениеНеЗаполнено(НаДату) Тогда
//		Возврат 1;
//	КонецЕсли;	
//	Если обЗначениеНеЗаполнено(Валюта) Тогда
//		Возврат 1;
//	КонецЕсли;
//	ЗапросКурс=Новый Запрос("ВЫБРАТЬ
//	                        |	КурсыВалютСрезПоследних.Валюта КАК Валюта,
//	                        |	МАКСИМУМ(КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) КАК Курс
//	                        |ИЗ
//	                        |	РегистрСведений.КурсыВалют.СрезПоследних(&НаДату, Валюта = &Валюта) КАК КурсыВалютСрезПоследних
//	                        |
//	                        |СГРУППИРОВАТЬ ПО
//	                        |	КурсыВалютСрезПоследних.Валюта");
//							
//	ЗапросКурс.УстановитьПараметр("НаДату",НаДату);
//	ЗапросКурс.УстановитьПараметр("Валюта",Валюта);
//	Выборка=ЗапросКурс.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		Возврат Выборка.Курс;
//	КонецЕсли;
//	Возврат 1;
//КонецФункции

// Возвращает результат запроса по остаткам товаров и резервам
Функция ПолучитьТаблицуОстатков(МассивНоменклатуры,РежимПроведения,ТаблицаСписанных=Неопределено) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) КАК Количество,
	|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.РезервОстаток, 0) КАК Резерв,
	|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.СуммаРознОстаток, 0) КАК СуммаРозн
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			&Момент,
	|			Номенклатура В (&Номенклатура)
	|				И СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровКомпанииОстатки
	|";
	Запрос.УстановитьПараметр("Момент",?(РежимПроведения=РежимПроведенияДокумента.Оперативный,Неопределено,МоментВремени()));
	Запрос.УстановитьПараметр("Номенклатура",МассивНоменклатуры);
	Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
	
	ТаблицаТоваровДляБлокировки = Новый ТаблицаЗначений;
	ТаблицаТоваровДляБлокировки.Колонки.Добавить("Номенклатура");
	ТаблицаТоваровДляБлокировки.ЗагрузитьКолонку(МассивНоменклатуры,"Номенклатура"); 
	
	ЗначенияБлокировки = Новый Соответствие;
	ЗначенияБлокировки.Вставить("Период",        Новый Диапазон(, Дата));
	ЗначенияБлокировки.Вставить("СкладКомпании", СкладКомпании);
	
	СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы,ИмяТаблицы", "РегистрНакопления", "ОстаткиТоваровКомпании");
	СтруктураПараметровБлокировки.Вставить("ИсточникДанных", ТаблицаТоваровДляБлокировки);
	
	ОписаниеИсточника = Новый Соответствие;
	ОписаниеИсточника.Вставить("Номенклатура", "Номенклатура");
	
	ОбработкаСобытийДокументаСервер.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки, ОписаниеИсточника);
	
	РезультатОстатки=Запрос.Выполнить();
	ТаблицаОстатки=РезультатОстатки.Выгрузить();
	//ПоказатьТаблицу(ТаблицаОстатки,"ТаблицаОстатки");
	Если ТаблицаСписанных=Неопределено Тогда
		Возврат ТаблицаОстатки;
	Иначе
		//Создаем очередной менеджер
		Менедж2=Новый МенеджерВременныхТаблиц;
		Запрос2=Новый Запрос;
		Запрос2.МенеджерВременныхТаблиц=Менедж2;
		Запрос2.Текст="ВЫБРАТЬ * ПОМЕСТИТЬ тзОстатки ИЗ &ТЗ КАК ТЗ";
		Запрос2.УстановитьПараметр("ТЗ",ТаблицаОстатки);
		Рез2=Запрос2.Выполнить();
		//
		Запрос2.Текст="ВЫБРАТЬ * ПОМЕСТИТЬ тзСписанных ИЗ &ТЗ КАК ТЗ";
		Запрос2.УстановитьПараметр("ТЗ",ТаблицаСписанных);
		Рез2=Запрос2.Выполнить();
		//
		Запрос3=Новый Запрос;
		Запрос3.МенеджерВременныхТаблиц=Менедж2;
		Запрос3.Текст="ВЫБРАТЬ
		             |	ПодзапросОстатки.Номенклатура,
		             |	ПодзапросОстатки.ХарактеристикаНоменклатуры,
		             |	СУММА(ПодзапросОстатки.Количество) КАК Количество,
		             |	СУММА(ПодзапросОстатки.Резерв) КАК Резерв,
		             |	СУММА(ПодзапросОстатки.СуммаРозн) КАК СуммаРозн,
		             |	Ложь КАК УжеБылаПереоценка
		             |ИЗ
		             |	(ВЫБРАТЬ
		             |		ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
		             |		ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		             |		СУММА(ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.Количество, 0)) КАК Количество,
		             |		СУММА(ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.Резерв, 0)) КАК Резерв,
		             |		СУММА(ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.СуммаРозн, 0)) КАК СуммаРозн
		             |	ИЗ
		             |		тзОстатки КАК ОстаткиТоваровКомпанииОстатки
		             |	
		             |	СГРУППИРОВАТЬ ПО
		             |		ОстаткиТоваровКомпанииОстатки.Номенклатура,
		             |		ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры
		             |	
		             |	ОБЪЕДИНИТЬ ВСЕ
		             |	
		             |	ВЫБРАТЬ
		             |		тзСписанных.Номенклатура,
		             |		тзСписанных.ХарактеристикаНоменклатуры,
		             |		СУММА(ЕСТЬNULL(-тзСписанных.Количество, 0)),
		             |		0,
		             |		СУММА(ЕСТЬNULL(-тзСписанных.СуммаРозн, 0))
		             |	ИЗ
		             |		тзСписанных КАК тзСписанных
		             |	
		             |	СГРУППИРОВАТЬ ПО
		             |		тзСписанных.Номенклатура,
		             |		тзСписанных.ХарактеристикаНоменклатуры) КАК ПодзапросОстатки
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	ПодзапросОстатки.Номенклатура,
		             |	ПодзапросОстатки.ХарактеристикаНоменклатуры
		             |
		             |ИМЕЮЩИЕ
		             |	СУММА(ПодзапросОстатки.Количество) > 0";
		
		РезультатОстатки=Запрос3.Выполнить();
		ТаблицаОстатки2=РезультатОстатки.Выгрузить();
		//На всякий...
		Менедж2=Неопределено;
		Возврат ТаблицаОстатки2;
	КонецЕсли;
КонецФункции

// формирует движения документа по партионным регистрам
// Режим - режим проведения (оперативный/неоперативный)
// ДокументСсылка - ссылка на документ который надо допровести по партиям
// Возвращает Истина - все хокей, ложь - чего-то не так
Функция ПровестиПоПартиям(Режим, ДокументСсылка, ТаблицаИнгредиентовИтоговая=Неопределено) Экспорт
	Отказ = Ложь;
	ОтложенноеПроведениеПоПартиям = Ложь;
	
	ШапкаДокумента = ПолучитьШапкуДокумента(ДокументСсылка);
	
	// Чтение значения для списания по датам
	СтратегияСписанияПартийТоваровПоДатам = ПолучитьСтратегиюСписанияПоДатам(ШапкаДокумента.СкладКомпании, ШапкаДокумента.Организация, ШапкаДокумента.Дата);
	Если СтратегияСписанияПартийТоваровПоДатам = Перечисления.СтратегияСписанияПартийТоваровПоДатам.Средняя Тогда
		ПартияЗаписей = Константы.ПартияТоваровОтрицательныхОстатков.Получить();;
	Иначе
		ПартияЗаписей = ШапкаДокумента.Ссылка;
	КонецЕсли;
	
	// проверим, если подразделение проводиться по партиям "отложенно", то дальше не идем
	НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	Отказ = НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		ОтложенноеПроведениеПоПартиям = Истина;
		Если ТаблицаИнгредиентовИтоговая<>Неопределено Тогда
			НаборАвтоВыпуск=Движения.ПроизводствоАвтоВыпуск;
			ХОВложенныйВыпуск=Справочники.ХозОперации.ВложенныйВыпускПолуфабрикатов;
			Для Каждого СтрокаТЧ ИЗ ТаблицаИнгредиентовИтоговая Цикл
				НовСтр=НаборАвтоВыпуск.Добавить();
				//Системные
				НовСтр.Регистратор=?(ДокументСсылка=Неопределено,Ссылка,ДокументСсылка);
				НовСтр.Период=ШапкаДокумента.Дата;
				//Все остальные
				//Основной реквизит
				Если СтрокаТЧ.УровеньПродукции=0 Тогда
					НовСтр.ХозОперация=ШапкаДокумента.ХозОперация;
				Иначе
					НовСтр.ХозОперация=ХОВложенныйВыпуск;
				КонецЕсли;
				//Основное измерение
				НовСтр.Продукция=СтрокаТЧ.ДляПродукции;
				//прочие измерения, ресурсы, реквизиты
				ЗаполнитьЗначенияСвойств(НовСтр,СтрокаТЧ);
			КонецЦикла;
		КонецЕсли;
		Возврат НЕ Отказ;
	КонецЕсли;
	//Обычное проведение по партиям
	//Спишем партии в соответствии с движениями по регистру "Остатки товаров компании"
	МенеджерВРПартии=Новый МенеджерВременныхТаблиц;
	Если ШапкаДокумента.Ссылка=Ссылка Тогда //Не допроведение по партиям
		ТЗ=Движения.ОстаткиТоваровКомпании.Выгрузить();
		//Помещаем еще во временную таблицу списания ингредиентов
		ЗапросВР1=Новый Запрос;
		ЗапросВР1.МенеджерВременныхТаблиц=МенеджерВРПартии;
		ЗапросВР1.Текст="ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТЗ.ВидДвижения КАК ВидДвижения,
		|	ТЗ.ХозОперация КАК ХозОперация,
		|	ТЗ.Количество КАК Количество
		|ПОМЕСТИТЬ тзСписанныхПоОстакам
		|ИЗ
		|	&ТЗ КАК ТЗ
		|";
		ЗапросВР1.УстановитьПараметр("ТЗ",ТЗ);
		РезВР1=ЗапросВР1.Выполнить();
	Иначе
		ЗапросВР1=Новый Запрос;
		ЗапросВР1.МенеджерВременныхТаблиц=МенеджерВРПартии;
		ЗапросВР1.Текст="ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТЗ.ВидДвижения КАК ВидДвижения,
		|	ТЗ.Количество КАК Количество,
		|	ТЗ.ХозОперация КАК ХозОперация
		|ПОМЕСТИТЬ тзСписанныхПоОстакам
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании КАК ТЗ
		|ГДЕ
		|	ТЗ.Регистратор = &Регистратор";
		ЗапросВР1.УстановитьПараметр("Регистратор",ШапкаДокумента.Ссылка);
		РезВР1=ЗапросВР1.Выполнить();
	КонецЕсли;
	//Получаем таблицу списанных ингредиентов
	Запрос=Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерВРПартии;
	Запрос.Текст="ВЫБРАТЬ
	|	тзСписания.Номенклатура КАК Номенклатура,
	//|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
	|	тзСписания.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	&ПустаяСтавкаНДС КАК СтавкаНДС,
	|	НЕОПРЕДЕЛЕНО КАК Партия,
	|	&СкладКомпании КАК СкладКомпании,
	|	СУММА(тзСписания.Количество) КАК Количество
	|ИЗ
	|	тзСписанныхПоОстакам КАК тзСписания
	|ГДЕ
	|	тзСписания.ВидДвижения = &ВидДвиженияРасход
	|	И тзСписания.ХозОперация = &ХозОперация
	|
	|СГРУППИРОВАТЬ ПО
	|	тзСписания.Номенклатура,
	|	тзСписания.ХарактеристикаНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры";
	Запрос.УстановитьПараметр("ХозОперация",Справочники.ХозОперации.ПередачаИнгредиентовВПроизводство);
	Запрос.УстановитьПараметр("ПустаяСтавкаНДС",Справочники.СтавкиНДС.ПустаяСсылка());
	Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
	Запрос.УстановитьПараметр("ВидДвиженияРасход",ВидДвиженияНакопления.Расход);
	Результ=Запрос.Выполнить();
	тзСписанныхПоОстакам=Результ.Выгрузить();
	
	//Воспользуемся стандартной функцией Расход() набора записей регистра Партии
	//
	ТоварКупленный=Перечисления.СтатусыПартий.ТоварКупленный;
	НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
	НаборЗаписейПартии.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейПартии.СкладКомпании=ШапкаДокумента.СкладКомпании;
	//НаборЗаписейПартии.ЦенаВДокументеПриОприходованииИзлишков=Неопределено;
	НаборЗаписейПартии.ЕстьСтавкаНДС=Ложь;
	НаборЗаписейПартии.ИмяРеквизитаДокумент="";
	НаборЗаписейПартии.ПоБазовомуКоличеству=Ложь;
	НаборЗаписейПартии.ШапкаДокумента=ШапкаДокумента;
	//НаборЗаписейПартии.ИдетДопроведение=(ДокументСсылка<>Неопределено);
	НаборЗаписейПартии.СтатусПартии=ТоварКупленный;
	НаборЗаписейПартии.РежимПроведения=Режим;
	НаборЗаписейПартии.РезультатЗапросаПоТоварам=тзСписанныхПоОстакам;
	НаборЗаписейПартии.ХозОперация = Справочники.ХозОперации.ПередачаИнгредиентовВПроизводство;
	Отказ=НЕ НаборЗаписейПартии.Расход() ИЛИ Отказ;
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Распределим себестоимость списанных партий по продукции
	//Сначала получим списанные партии
	
	ТЗ=Движения.ПартииТоваровКомпании.Выгрузить();
	//Получаем таблицу списанных ингредиентов
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	Запрос.Текст = "ВЫБРАТЬ
	|	ТЗ.Номенклатура КАК Номенклатура,
	|	ТЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТЗ.ВидДвижения КАК ВидДвижения,
	|	ТЗ.ХозОперация КАК ХозОперация,
	|	ТЗ.Количество КАК Количество,
	|	ТЗ.Сумма КАК Сумма,
	|	ТЗ.СуммаУпр КАК СуммаУпр,
	|	ТЗ.СуммаНДС КАК СуммаНДС,
	|	ТЗ.СуммаБезНДС,
	|	ТЗ.СуммаНДСУпр,
	|	ТЗ.СуммаБезНДСУпр
	|ПОМЕСТИТЬ
	|	тзСписанияИнгредиентов
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|ВЫБРАТЬ
	|	тзСписания.Номенклатура КАК Номенклатура,
	|	СУММА(тзСписания.Количество) КАК Количество,
	|	ВЫБОР
	|		КОГДА СУММА(тзСписания.Количество) = 0
	|			ТОГДА СУММА(тзСписания.Сумма)
	|		ИНАЧЕ СУММА(тзСписания.Сумма) / СУММА(тзСписания.Количество)
	|	КОНЕЦ КАК Цена,
	|	СУММА(тзСписания.Сумма) КАК Сумма,
	|	ВЫБОР
	|		КОГДА СУММА(тзСписания.Количество) = 0
	|			ТОГДА СУММА(тзСписания.СуммаУпр)
	|		ИНАЧЕ СУММА(тзСписания.СуммаУпр) / СУММА(тзСписания.Количество)
	|	КОНЕЦ КАК ЦенаУпр,
	|	СУММА(тзСписания.СуммаУпр) КАК СуммаУпр,
	|	ВЫБОР
	|		КОГДА СУММА(тзСписания.Количество) = 0
	|			ТОГДА СУММА(тзСписания.СуммаБезНДС)
	|		ИНАЧЕ СУММА(тзСписания.СуммаБезНДС) / СУММА(тзСписания.Количество)
	|	КОНЕЦ КАК ЦенаБезНДС,
	|	СУММА(тзСписания.СуммаБезНДС) КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА СУММА(тзСписания.Количество) = 0
	|			ТОГДА СУММА(тзСписания.СуммаНДСУпр)
	|		ИНАЧЕ СУММА(тзСписания.СуммаНДСУпр) / СУММА(тзСписания.Количество)
	|	КОНЕЦ КАК ЦенаНДСУпр,
	|	СУММА(тзСписания.СуммаНДСУпр) КАК СуммаНДСУпр,
	|	ВЫБОР
	|		КОГДА СУММА(тзСписания.Количество) = 0
	|			ТОГДА СУММА(тзСписания.СуммаБезНДСУпр)
	|		ИНАЧЕ СУММА(тзСписания.СуммаБезНДСУпр) / СУММА(тзСписания.Количество)
	|	КОНЕЦ КАК ЦенаБезНДСУпр,
	|	СУММА(тзСписания.СуммаБезНДСУпр) КАК СуммаБезНДСУпр,
	|	ВЫБОР
	|		КОГДА СУММА(тзСписания.Количество) = 0
	|			ТОГДА СУММА(тзСписания.СуммаНДС)
	|		ИНАЧЕ СУММА(тзСписания.СуммаНДС) / СУММА(тзСписания.Количество)
	|	КОНЕЦ КАК ЦенаНДС,
	|	СУММА(тзСписания.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|	тзСписанияИнгредиентов КАК тзСписания
	|ГДЕ
	|	тзСписания.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И тзСписания.ХозОперация = &ХозОперация
	|
	|СГРУППИРОВАТЬ ПО
	|	тзСписания.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	Запрос.УстановитьПараметр("ХозОперация", Справочники.ХозОперации.ПередачаИнгредиентовВПроизводство);
	Результ = Запрос.Выполнить();
	тзСписанияИнгредиентов=Результ.Выгрузить();
	
	НаборАвтоВыпуск=Движения.ПроизводствоАвтоВыпуск;
	Если ТаблицаИнгредиентовИтоговая=Неопределено Тогда
		ЗапросВыпуск=Новый Запрос("ВЫБРАТЬ
		|	ПроизводствоАвтоВыпуск.Период КАК Период,
		|	ПроизводствоАвтоВыпуск.Регистратор КАК Регистратор,
		|	ПроизводствоАвтоВыпуск.НомерСтроки КАК НомерСтроки,
		|	ПроизводствоАвтоВыпуск.СкладКомпании КАК СкладКомпании,
		|	ПроизводствоАвтоВыпуск.Продукция КАК ДляПродукции,
		|	ПроизводствоАвтоВыпуск.Ингредиент КАК Ингредиент,
		|	ПроизводствоАвтоВыпуск.КоличествоПродукции КАК КоличествоПродукции,
		|	ПроизводствоАвтоВыпуск.СуммаПродукцииРозничная КАК СуммаПродукцииРозничная,
		|	ПроизводствоАвтоВыпуск.СуммаПродукцииРозничнаяУпр КАК СуммаПродукцииРозничнаяУпр,
		|	ПроизводствоАвтоВыпуск.КоличествоИнгредиентаНорма КАК КоличествоИнгредиентаНорма,
		|	ПроизводствоАвтоВыпуск.КоличествоИнгредиентаФакт КАК КоличествоИнгредиентаФакт,
		|	ПроизводствоАвтоВыпуск.КоличествоИнгредиентаВыпустить КАК КоличествоИнгредиентаВыпустить,
		|	ПроизводствоАвтоВыпуск.СуммаИнгредиентаРозничнаяФакт КАК СуммаИнгредиентаРозничнаяФакт,
		|	ПроизводствоАвтоВыпуск.СуммаИнгредиентаРозничнаяВыпустить КАК СуммаИнгредиентаРозничнаяВыпустить,
		|	ПроизводствоАвтоВыпуск.СуммаИнгредиентаРозничнаяВыпуститьУпр КАК СуммаИнгредиентаРозничнаяВыпуститьУпр,
		|	ПроизводствоАвтоВыпуск.СебестоимостьИнгредиентаФакт КАК СебестоимостьИнгредиентаФакт,
		//|	ПроизводствоАвтоВыпуск.СебестоимостьИнгредиентаФактРегл КАК СебестоимостьИнгредиентаФактРегл,
		|	ПроизводствоАвтоВыпуск.СебестоимостьБезНДСИнгредиентаФакт КАК СебестоимостьБезНДСИнгредиентаФакт,
		|	ПроизводствоАвтоВыпуск.СебестоимостьБезНДСИнгредиентаФактУпр КАК СебестоимостьБезНДСИнгредиентаФактУпр,
		|	ПроизводствоАвтоВыпуск.НДССебестоимостиИнгредиентаФактУпр КАК НДССебестоимостиИнгредиентаФактУпр,
		|	ПроизводствоАвтоВыпуск.СебестоимостьИнгредиентаФактУпр КАК СебестоимостьИнгредиентаФактУпр,
		|	ПроизводствоАвтоВыпуск.НДССебестоимостиИнгредиентаФакт КАК НДССебестоимостиИнгредиентаФакт,
		|	ПроизводствоАвтоВыпуск.СебестоимостьИнгредиентаВыпустить КАК СебестоимостьИнгредиентаВыпустить,
		|	ПроизводствоАвтоВыпуск.СебестоимостьБезНДСИнгредиентаВыпустить КАК СебестоимостьБезНДСИнгредиентаВыпустить,
		|	ПроизводствоАвтоВыпуск.СебестоимостьБезНДСИнгредиентаВыпуститьУпр КАК СебестоимостьБезНДСИнгредиентаВыпуститьУпр,
		|	ПроизводствоАвтоВыпуск.НДССебестоимостиИнгредиентаВыпуститьУпр КАК НДССебестоимостиИнгредиентаВыпуститьУпр,
		|	ПроизводствоАвтоВыпуск.СебестоимостьИнгредиентаВыпуститьУпр КАК СебестоимостьИнгредиентаВыпуститьУпр,
		|	ПроизводствоАвтоВыпуск.НДССебестоимостиИнгредиентаВыпустить КАК НДССебестоимостиИнгредиентаВыпустить,
		|	ПроизводствоАвтоВыпуск.КоличествоЗаменяемогоИнгредиента КАК КоличествоЗаменяемогоИнгредиента,
		|	ПроизводствоАвтоВыпуск.ХозОперация КАК ХозОперация,
		|	ПроизводствоАвтоВыпуск.Рецептура КАК Рецептура,
		|	ПроизводствоАвтоВыпуск.НомерСтрокиПродукции КАК НомерСтрокиПродукции,
		|	ПроизводствоАвтоВыпуск.УровеньПродукции КАК УровеньПродукции,
		|	ПроизводствоАвтоВыпуск.КоличествоИнгредиентаНаЕдиницуПродукции КАК КоличествоИнгредиентаНаЕдиницуПродукции,
		|	ПроизводствоАвтоВыпуск.ЦенаПродукцииРозничная КАК ЦенаПродукцииРозничная,
		|	ПроизводствоАвтоВыпуск.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
		|	ПроизводствоАвтоВыпуск.НомерСтрокиПолуфабриката КАК НомерСтрокиПолуфабриката,
		|	ПроизводствоАвтоВыпуск.УровеньПолуфабриката КАК УровеньПолуфабриката,
		|	ПроизводствоАвтоВыпуск.ПорядковыйНомерИнгредиента КАК ПорядковыйНомерИнгредиента,
		|	ПроизводствоАвтоВыпуск.ЦенаИнгредиентаРозничная КАК ЦенаИнгредиентаРозничная,
		|	ПроизводствоАвтоВыпуск.ЭтоСпеция КАК ЭтоСпеция,
		|	ПроизводствоАвтоВыпуск.ЭтоДополнительныйВыпуск КАК ЭтоДополнительныйВыпуск,
		|	ПроизводствоАвтоВыпуск.НомерСтрокиОсновнойТаблицы КАК НомерСтрокиОсновнойТаблицы,
		|	ПроизводствоАвтоВыпуск.ЭтоЗаменаИнгредиента КАК ЭтоЗаменаИнгредиента,
		|	ПроизводствоАвтоВыпуск.ЗаменяемыйИнгредиент КАК ЗаменяемыйИнгредиент,
		|	ПроизводствоАвтоВыпуск.РецептураПродукции КАК РецептураПродукции
		|ИЗ
		|	РегистрНакопления.ПроизводствоАвтоВыпуск КАК ПроизводствоАвтоВыпуск
		|ГДЕ
		|	ПроизводствоАвтоВыпуск.Регистратор = &Регистратор");
		ЗапросВыпуск.УстановитьПараметр("Регистратор",ШапкаДокумента.Ссылка);
		ТаблицаИнгредиентовИтоговая=ЗапросВыпуск.Выполнить().Выгрузить();
	КонецЕсли;
	НаборАвтоВыпуск.Очистить();
	ТаблицаИнгредиентовИтоговая.Сортировать("Ингредиент ВОЗР, НомерСтрокиПродукции ВОЗР");
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Обходим таблицу ТаблицаИнгредиентовИтоговая, так же, как и в обработке проведения при распределении розничных сумм
	//ОТЛАДОЧНЫЕ СТРОКИ
	//ПоказатьТаблицу(тзСписанияИнгредиентов,"ТзСписанияИнгредиентов");
	//-ОТЛАДОЧНЫЕ СТРОКИ
	ПредыдущийИнгредиент=Неопределено;
	СтрокаПредыдущего=Неопределено;
	СтрокаСписанного=Неопределено;
	Для Каждого СтрокаИнгр Из ТаблицаИнгредиентовИтоговая Цикл
		
		//Начинаем распределение списанных с остатков ингредиентов
		Если СтрокаИнгр.КоличествоИнгредиентаФакт>0 Тогда
			Если ПредыдущийИнгредиент<>СтрокаИнгр.Ингредиент Тогда
				ПредыдущийИнгредиент=СтрокаИнгр.Ингредиент;
				СтрокаПредыдущего=СтрокаИнгр;
				СтрокаСписанного=тзСписанияИнгредиентов.Найти(СтрокаИнгр.Ингредиент,"Номенклатура");
			КонецЕсли;
			Если СтрокаСписанного=Неопределено Тогда
				//Маловероятно, но надо сообщить хоть что-нибудь
				Сообщить("- Не найдена запись о списании ингредиента "+СтрокаИнгр.Ингредиент+" в количестве "+СтрокаИнгр.КоличествоИнгредиентаФакт+"ед. для продукции "+СтрокаИнгр.ДляПродукции,СтатусСообщения.Важное);
			Иначе
				СтрокаИнгр.СебестоимостьИнгредиентаФакт=Окр(СтрокаСписанного.Цена*СтрокаИнгр.КоличествоИнгредиентаФакт,2);
				//СтрокаИнгр.СебестоимостьИнгредиентаФактРегл=Окр(СтрокаСписанного.ЦенаРегл*СтрокаИнгр.КоличествоИнгредиентаФакт,2);
				СтрокаИнгр.СебестоимостьБезНДСИнгредиентаФакт=Окр(СтрокаСписанного.ЦенаБезНДС*СтрокаИнгр.КоличествоИнгредиентаФакт,2);
				СтрокаИнгр.СебестоимостьБезНДСИнгредиентаФактУпр=Окр(СтрокаСписанного.ЦенаБезНДСУпр*СтрокаИнгр.КоличествоИнгредиентаФакт,2);
				СтрокаИнгр.НДССебестоимостиИнгредиентаФактУпр=Окр(СтрокаСписанного.ЦенаНДСУпр*СтрокаИнгр.КоличествоИнгредиентаФакт,2);
				СтрокаИнгр.СебестоимостьИнгредиентаФактУпр=Окр(СтрокаСписанного.ЦенаУпр*СтрокаИнгр.КоличествоИнгредиентаФакт,2);
				СтрокаИнгр.НДССебестоимостиИнгредиентаФакт=Окр(СтрокаСписанного.ЦенаНДС*СтрокаИнгр.КоличествоИнгредиентаФакт,2);
				//
				СтрокаСписанного.Количество=СтрокаСписанного.Количество-СтрокаИнгр.КоличествоИнгредиентаФакт;
				//
				СтрокаСписанного.Сумма=СтрокаСписанного.Сумма-СтрокаИнгр.СебестоимостьИнгредиентаФакт;
				СтрокаСписанного.СуммаБезНДС=СтрокаСписанного.СуммаБезНДС-СтрокаИнгр.СебестоимостьБезНДСИнгредиентаФакт;
				СтрокаСписанного.СуммаНДСУпр=СтрокаСписанного.СуммаНДСУпр-СтрокаИнгр.НДССебестоимостиИнгредиентаФактУпр;
				СтрокаСписанного.СуммаБезНДСУпр=СтрокаСписанного.СуммаБезНДСУпр-СтрокаИнгр.СебестоимостьБезНДСИнгредиентаФактУпр;
				СтрокаСписанного.СуммаУпр=СтрокаСписанного.СуммаУпр-СтрокаИнгр.СебестоимостьИнгредиентаФактУпр;
				СтрокаСписанного.СуммаНДС=СтрокаСписанного.СуммаНДС-СтрокаИнгр.НДССебестоимостиИнгредиентаФакт;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//закроем погрешности округления стоимости выпускаемой продукции, и списанных ингредиентов
	//ОТЛАДОЧНЫЕ СТРОКИ
	//ПоказатьТаблицу(тзСписанияИнгредиентов,"ТзСписанияИнгредиентовОсталосьНераспределенным");
	//-ОТЛАДОЧНЫЕ СТРОКИ
	Для Каждого СтрокаСпеции ИЗ тзСписанияИнгредиентов Цикл
		Если СтрокаСпеции.Сумма<>0 ИЛИ СтрокаСпеции.СуммаБезНДС<>0 ИЛИ СтрокаСпеции.СуммаНДСУпр<>0 ИЛИ СтрокаСпеции.СуммаБезНДСУпр<>0 ИЛИ СтрокаСпеции.СуммаУпр<>0 ИЛИ СтрокаСпеции.СуммаНДС<>0 Тогда
			//Надо распределить по продукции...
			СтруктураОтбора=Новый Структура();
			СтруктураОтбора.Вставить("Ингредиент",СтрокаСпеции.Номенклатура);
			Строки=ТаблицаИнгредиентовИтоговая.НайтиСтроки(СтруктураОтбора);
			КолвоСтрок=Строки.Количество();
			Если КолвоСтрок>0 Тогда
				Если СтрокаСпеции.Сумма<0 Тогда
					ЗнакСумма=-1;
				Иначе
					ЗнакСумма=1;
				КонецЕсли;
				НРСумма=Цел(СтрокаСпеции.Сумма*ЗнакСумма*100);
				
				//Сумма без НДС
				Если СтрокаСпеции.СуммаБезНДС<0 Тогда
					ЗнакСуммаБезНДС=-1;
				Иначе
					ЗнакСуммаБезНДС=1;
				КонецЕсли;
				НРСуммаБезНДС=Цел(СтрокаСпеции.СуммаБезНДС*ЗнакСуммаБезНДС*100);
				
				//Сумма без НДС упр
				Если СтрокаСпеции.СуммаБезНДСУпр<0 Тогда
					ЗнакСуммаБезНДСУпр=-1;
				Иначе
					ЗнакСуммаБезНДСУпр=1;
				КонецЕсли;
				НРСуммаБезНДСУпр=Цел(СтрокаСпеции.СуммаБезНДСУпр*ЗнакСуммаБезНДСУпр*100);
				
				//Сумма НДС упр
				Если СтрокаСпеции.СуммаНДСУпр<0 Тогда
					ЗнакСуммаНДСУпр=-1;
				Иначе
					ЗнакСуммаНДСУпр=1;
				КонецЕсли;
				НРСуммаНДСУпр=Цел(СтрокаСпеции.СуммаНДСУпр*ЗнакСуммаНДСУпр*100);
				
				//Сумма упр
				Если СтрокаСпеции.СуммаУпр<0 Тогда
					ЗнакСуммаУпр=-1;
				Иначе
					ЗнакСуммаУпр=1;
				КонецЕсли;
				НРСуммаУпр=Цел(СтрокаСпеции.СуммаУпр*ЗнакСуммаУпр*100);
				//Сумма НДС
				Если СтрокаСпеции.СуммаНДС<0 Тогда
					ЗнакСуммаНДС=-1;
				Иначе
					ЗнакСуммаНДС=1;
				КонецЕсли;
				НРСуммаНДС=Цел(СтрокаСпеции.СуммаНДС*ЗнакСуммаНДС*100);
				
				Пока НРСумма>0 ИЛИ НРСуммаБезНДС>0 ИЛИ НРСуммаБезНДСУпр>0 ИЛИ НРСуммаНДСУпр>0 ИЛИ НРСуммаУпр>0 ИЛИ НРСуммаНДС>0 Цикл
					Для Каждого Строка2 Из Строки Цикл
						Если НРСумма>0 Тогда
							Строка2.СебестоимостьИнгредиентаФакт=Строка2.СебестоимостьИнгредиентаФакт+ЗнакСумма/100;
							НРСумма=НРСумма-1;
						КонецЕсли;
						//Без НДС
						Если НРСуммаБезНДС>0 Тогда
							Строка2.СебестоимостьБезНДСИнгредиентаФакт=Строка2.СебестоимостьБезНДСИнгредиентаФакт+ЗнакСуммаБезНДС/100;
							НРСуммаБезНДС=НРСуммаБезНДС-1;
						КонецЕсли;
						//Без НДС упр
						Если НРСуммаБезНДСУпр>0 Тогда
							Строка2.СебестоимостьБезНДСИнгредиентаФактУпр=Строка2.СебестоимостьБезНДСИнгредиентаФактУпр+ЗнакСуммаБезНДСУпр/100;
							НРСуммаБезНДСУпр=НРСуммаБезНДСУпр-1;
						КонецЕсли;
						//НДС упр
						Если НРСуммаНДСУпр>0 Тогда
							Строка2.НДССебестоимостиИнгредиентаФактУпр=Строка2.НДССебестоимостиИнгредиентаФактУпр+ЗнакСуммаНДСУпр/100;
							НРСуммаНДСУпр=НРСуммаНДСУпр-1;
						КонецЕсли;
						//Упр
						Если НРСуммаУпр>0 Тогда
							Строка2.СебестоимостьИнгредиентаФактУпр=Строка2.СебестоимостьИнгредиентаФактУпр+ЗнакСуммаУпр/100;
							НРСуммаУпр=НРСуммаУпр-1;
						КонецЕсли;
						Если НРСуммаНДС>0 Тогда
							Строка2.НДССебестоимостиИнгредиентаФакт=Строка2.НДССебестоимостиИнгредиентаФакт+ЗнакСуммаНДС/100;
							НРСуммаНДС=НРСуммаНДС-1;
						КонецЕсли;
						Если НРСумма<=0 И НРСуммаБезНДС<=0 И НРСуммаБезНДСУпр<=0 И НРСуммаНДСУпр<=0 И НРСуммаУпр<=0 И НРСуммаНДС<=0 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//Выпустим продукцию и ПФ, причем ПФ тут же спишем в производство...
	ТаблицаИнгредиентовИтоговая.Сортировать("УровеньПродукции УБЫВ, НомерСтрокиПродукции ВОЗР, ПорядковыйНомерИнгредиента ВОЗР");
	//ПоказатьТаблицу(ТаблицаИнгредиентовИтоговая,"ТаблицаИнгредиентовИтоговая");
	ПустаяХарактеристика=Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	ПустойКонтрагент=Справочники.Контрагенты.ПустаяСсылка();
	ХОВложенныйВыпуск=Справочники.ХозОперации.ВложенныйВыпускПолуфабрикатов;
	ХОСписаниеПолуфабрикатов=Справочники.ХозОперации.ПередачаПолуфабрикатовВПроизводство;
	//
	ПредыдущаяПродукция=Неопределено;
	НомерСтрокиПредыдущей=0;
	УровеньПредыдущей=0;
	//Эти показатели тоже действуют для предыдущей...
	КоличествоПродукции=0;
	Сумма=0;
	СуммаБезНДС=0;
	СуммаБезНДСУпр=0;
	СуммаНДСУпр=0;
	СуммаУпр=0;
	СуммаНДС=0;
	//
	Для Каждого СтрокаИнгр ИЗ ТаблицаИнгредиентовИтоговая Цикл
		Если НомерСтрокиПредыдущей<>СтрокаИнгр.НомерСтрокиПродукции Тогда
			//сначала выпустим и спишем предыдущую продукцию
			Если НомерСтрокиПредыдущей<>0 Тогда
				//Сообщить("Выпускаем продукцию "+ПредыдущаяПродукция);
				НоваяЗаписьПартии=Движения.ПартииТоваровКомпании.Добавить();
				//НомерСтрокиРегистраОстатки=НомерСтрокиРегистраОстатки+1;
				//Системные
				НоваяЗаписьПартии.ВидДвижения=ВидДвиженияНакопления.Приход;
				//
				НоваяЗаписьПартии.Период=ШапкаДокумента.Дата;
				НоваяЗаписьПартии.Регистратор=ШапкаДокумента.Ссылка;
				//Измерения
				НоваяЗаписьПартии.Номенклатура=ПредыдущаяПродукция;
				НоваяЗаписьПартии.СкладКомпании=ШапкаДокумента.СкладКомпании;
				НоваяЗаписьПартии.ХарактеристикаНоменклатуры=ПустаяХарактеристика;
				НоваяЗаписьПартии.СтатусПартии=ТоварКупленный;
				//НоваяЗаписьПартии.Партия=ШапкаДокумента.Ссылка;
				// получим партию
				НоваяЗаписьПартии.Партия = ПартияЗаписей;
				
				//Ресурсы
				НоваяЗаписьПартии.Количество=КоличествоПродукции;
				НоваяЗаписьПартии.Сумма=Сумма;
				НоваяЗаписьПартии.СуммаБезНДС=СуммаБезНДС;
				НоваяЗаписьПартии.СуммаБезНДСУпр=СуммаБезНДСУпр;
				НоваяЗаписьПартии.СуммаНДСУпр=СуммаНДСУпр;
				НоваяЗаписьПартии.СуммаУпр=СуммаУпр;
				НоваяЗаписьПартии.СуммаНДС=СуммаНДС;
				
				//реквизиты
				НоваяЗаписьПартии.СтавкаНДС=ПредыдущаяПродукция.СтавкаНДС; //!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
				Если УровеньПредыдущей>0 Тогда
					НоваяЗаписьПартии.ХозОперация=ХОВложенныйВыпуск;
				Иначе
					НоваяЗаписьПартии.ХозОперация=ШапкаДокумента.ХозОперация;
				КонецЕсли;
				//
				Если УровеньПредыдущей>0 Тогда
					//Сообщить("Списываем продукцию в прозводство "+ПредыдущаяПродукция);
					НоваяЗаписьПартии=Движения.ПартииТоваровКомпании.Добавить();
					//НомерСтрокиРегистраОстатки=НомерСтрокиРегистраОстатки+1;
					//Системные
					НоваяЗаписьПартии.ВидДвижения=ВидДвиженияНакопления.Расход;
					//
					НоваяЗаписьПартии.Период=ШапкаДокумента.Дата;
					НоваяЗаписьПартии.Регистратор=ШапкаДокумента.Ссылка;
					//Измерения
					НоваяЗаписьПартии.Номенклатура=ПредыдущаяПродукция;
					НоваяЗаписьПартии.СкладКомпании=ШапкаДокумента.СкладКомпании;
					НоваяЗаписьПартии.ХарактеристикаНоменклатуры=ПустаяХарактеристика;
					НоваяЗаписьПартии.СтатусПартии=ТоварКупленный;
					//НоваяЗаписьПартии.Партия=ШапкаДокумента.Ссылка;
					// получим партию
					НоваяЗаписьПартии.Партия = ПартияЗаписей;
					//Ресурсы
					НоваяЗаписьПартии.Количество=КоличествоПродукции;
					НоваяЗаписьПартии.Сумма=Сумма;
					НоваяЗаписьПартии.СуммаБезНДС=СуммаБезНДС;
					НоваяЗаписьПартии.СуммаБезНДСУпр=СуммаБезНДСУпр;
					НоваяЗаписьПартии.СуммаНДСУпр=СуммаНДСУпр;
					НоваяЗаписьПартии.СуммаУпр=СуммаУпр;
					НоваяЗаписьПартии.СуммаНДС=СуммаНДС;
					
					//реквизиты
					НоваяЗаписьПартии.ХозОперация=ХОСписаниеПолуфабрикатов;
					НоваяЗаписьПартии.СтавкаНДС=ПредыдущаяПродукция.СтавкаНДС; //!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
					
					//Обновляем суммы в таблице
					СтруктураОтбора=Новый Структура();
					СтруктураОтбора.Вставить("НомерСтрокиПолуфабриката",НомерСтрокиПредыдущей);
					СтруктураОтбора.Вставить("УровеньПолуфабриката",УровеньПредыдущей);
					СтруктураОтбора.Вставить("Ингредиент",ПредыдущаяПродукция);
					Строки=ТаблицаИнгредиентовИтоговая.НайтиСтроки(СтруктураОтбора);
					Если Строки.Количество()>0 Тогда
						Для Каждого Строка2 Из Строки Цикл
							Строка2.СебестоимостьИнгредиентаВыпустить=Сумма;
							Строка2.СебестоимостьБезНДСИнгредиентаВыпустить=СуммаБезНДС;
							Строка2.СебестоимостьБезНДСИнгредиентаВыпуститьУпр=СуммаБезНДСУпр;
							Строка2.НДССебестоимостиИнгредиентаВыпуститьУпр=СуммаНДСУпр;
							Строка2.СебестоимостьИнгредиентаВыпуститьУпр=СуммаУпр;
							Строка2.НДССебестоимостиИнгредиентаВыпустить=СуммаНДС;
						КонецЦикла;
					Иначе
						//Хотя бы ругаемся
						Сообщить("Исключительная ситуация: не найдены строки для пересчета сумм выпускаемых полуфабрикатов "+ПредыдущаяПродукция,СтатусСообщения.Важное);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			//Теперь предыдущая становится текущей
			ПредыдущаяПродукция=СтрокаИнгр.ДляПродукции;
			НомерСтрокиПредыдущей=СтрокаИнгр.НомерСтрокиПродукции;
			УровеньПредыдущей=СтрокаИнгр.УровеньПродукции;
			//
			КоличествоПродукции=СтрокаИнгр.КоличествоПродукции;
			//Обнуляем суммы
			Сумма=0;
			СуммаБезНДС=0;
			СуммаБезНДСУпр=0;
			СуммаНДСУпр=0;
			СуммаУпр=0;
			СуммаНДС=0;
		КонецЕсли;
		Сумма=Сумма+СтрокаИнгр.СебестоимостьИнгредиентаФакт+СтрокаИнгр.СебестоимостьИнгредиентаВыпустить;
		СуммаБезНДС=СуммаБезНДС+СтрокаИнгр.СебестоимостьБезНДСИнгредиентаФакт+СтрокаИнгр.СебестоимостьБезНДСИнгредиентаВыпустить;
		СуммаБезНДСУпр=СуммаБезНДСУпр+СтрокаИнгр.СебестоимостьБезНДСИнгредиентаФактУпр+СтрокаИнгр.СебестоимостьБезНДСИнгредиентаВыпуститьУпр;
		СуммаНДСУпр=СуммаНДСУпр+СтрокаИнгр.НДССебестоимостиИнгредиентаФактУпр+СтрокаИнгр.НДССебестоимостиИнгредиентаВыпуститьУпр;
		СуммаУпр=СуммаУпр+СтрокаИнгр.СебестоимостьИнгредиентаФактУпр+СтрокаИнгр.СебестоимостьИнгредиентаВыпуститьУпр;
		СуммаНДС=СуммаНДС+СтрокаИнгр.НДССебестоимостиИнгредиентаФакт+СтрокаИнгр.НДССебестоимостиИнгредиентаВыпустить;
		
	КонецЦикла;
	//Последний выпуск
	Если НомерСтрокиПредыдущей<>0 Тогда
		//Последняя строка не может быть вложенным выпуском...
		//Сообщить("Выпускаем продукцию "+ПредыдущаяПродукция);
		НоваяЗаписьПартии=Движения.ПартииТоваровКомпании.Добавить();
		//НомерСтрокиРегистраОстатки=НомерСтрокиРегистраОстатки+1;
		//Системные
		НоваяЗаписьПартии.ВидДвижения=ВидДвиженияНакопления.Приход;
		
		НоваяЗаписьПартии.Период=ШапкаДокумента.Дата;
		НоваяЗаписьПартии.Регистратор=ШапкаДокумента.Ссылка;
		//Измерения
		НоваяЗаписьПартии.Номенклатура=ПредыдущаяПродукция;
		НоваяЗаписьПартии.СкладКомпании=ШапкаДокумента.СкладКомпании;
		НоваяЗаписьПартии.ХарактеристикаНоменклатуры=ПустаяХарактеристика;
		НоваяЗаписьПартии.СтатусПартии=ТоварКупленный;
		//НоваяЗаписьПартии.Партия=ШапкаДокумента.Ссылка;
		// получим партию
		НоваяЗаписьПартии.Партия = ПартияЗаписей;
		//Ресурсы
		НоваяЗаписьПартии.Количество=КоличествоПродукции;
		НоваяЗаписьПартии.Сумма=Сумма;
		НоваяЗаписьПартии.СуммаБезНДС=СуммаБезНДС;
		НоваяЗаписьПартии.СуммаБезНДСУпр=СуммаБезНДСУпр;
		НоваяЗаписьПартии.СуммаНДСУпр=СуммаНДСУпр;
		НоваяЗаписьПартии.СуммаУпр=СуммаУпр;
		НоваяЗаписьПартии.СуммаНДС=СуммаНДС;
		
		//реквизиты
		НоваяЗаписьПартии.СтавкаНДС=ПредыдущаяПродукция.СтавкаНДС; //!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
		НоваяЗаписьПартии.ХозОперация=ШапкаДокумента.ХозОперация;
	КонецЕсли;
	////ОТЛАДОЧНЫЕ СТРОКИ
	//ПоказатьТаблицу(ТаблицаИнгредиентовИтоговая,"тзИнгредиенты");
	////-ОТЛАДОЧНЫЕ СТРОКИ
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Заново заполним таблицу производства с учетом себестоимости продукции
	//
	ХОВложенныйВыпуск=Справочники.ХозОперации.ВложенныйВыпускПолуфабрикатов;
	Для Каждого СтрокаТЧ ИЗ ТаблицаИнгредиентовИтоговая Цикл
		НовСтр=НаборАвтоВыпуск.Добавить();
		//Системные
		НовСтр.Регистратор=?(ДокументСсылка=Неопределено,Ссылка,ДокументСсылка);
		НовСтр.Период=ШапкаДокумента.Дата;
		//Все остальные
		//Основной реквизит
		Если СтрокаТЧ.УровеньПродукции=0 Тогда
			НовСтр.ХозОперация=ШапкаДокумента.ХозОперация;
		Иначе
			НовСтр.ХозОперация=ХОВложенныйВыпуск;
		КонецЕсли;
		//Основное измерение
		НовСтр.Продукция=СтрокаТЧ.ДляПродукции;
		//прочие измерения, ресурсы, реквизиты
		//Сообщить(СтрокаТЧ.СуммаПродукцииРозничная);
		ЗаполнитьЗначенияСвойств(НовСтр,СтрокаТЧ);
		//Сообщить(НовСтр.СуммаПродукцииРозничная);
	КонецЦикла;
	//Рушим временные таблицы
	МенеджерВРПартии = Неопределено;
	
	Если Ссылка <> ДокументСсылка Тогда
		
		РаботаСГраницами.МоментВремениПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		РаботаСГраницами.ДвиженияПоПартиямПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		
	КонецЕсли;
	
	РаботаСГраницами.СдвинутьГраницуПартий(ДокументСсылка, ДополнительныеСвойства, Движения);
	
	Возврат НЕ Отказ;
КонецФункции //ПровестиПоПартиям()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьПредварительныйКонтроль(Отказ);
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоПартиямПередПроведением(Ссылка, ДополнительныеСвойства);
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	//Проверить корректность лучше здесь, а не ПередЗаписью
	ТекстОшибки = "";
	//Проверка корректности.
	//Вообще-то проверки нужно делать в ПроверитьКорректность()
	//НО! От этих проверок зависит проведение документа.
	//А если кто-нибудь будет восстаналивать последовательность без контроля корректности...
	//то может получиться, например, зацикливание вложенного выпуска
	//Которая, кстати, в УР делается в процессе проведения документа (или перед записью, но там уже итоговый расчет идет).
	
	//Поэтому проверка производится перед записью, но не в обработке проведения.
	Для Каждого СтрокаПродукция ИЗ Продукция Цикл
		//Сначала проверим - правильная ли у нас рецептура
		Если СтрокаПродукция.Рецептура.Продукция<>СтрокаПродукция.Номенклатура Тогда
			ВывестиСообщение(НСтр("ru = 'Продукции'") + Символы.НПП + "["+СокрЛП(СтрокаПродукция.Номенклатура.Код)+"] "+СокрЛП(СтрокаПродукция.Номенклатура) 
							+ НСтр("ru = ' не соответствует продукция '") + СокрЛП(СтрокаПродукция.Рецептура.Продукция)+НСтр("ru = ', указанная в рецептуре "+СокрЛП(СтрокаПродукция.Рецептура)+".'"),
							ЭтотОбъект, "Продукция[#].Номенклатура", СтрокаПродукция.НомерСтроки, Отказ);
		КонецЕсли;
		//Теперь нужно сформировать дерево вложенного выпуска по данной продукции
		//И проверить - нет ли ситуации, когда при производстве продукции используется полуфабрикат в состав которого входит эта продукция
		//Или эта продукция содержится в составе других полуфабрикатов, используемых для производства основного полуфабриката
		//ну и т.д.
		ДеревоПродукции = Новый ДеревоЗначений;
		ДеревоПродукции.Колонки.Добавить("Номенклатура");
		ДеревоПродукции.Колонки.Добавить("Рецептура");
		
		НоваяСтрока = ДеревоПродукции.Строки.Добавить();
		НоваяСтрока.Номенклатура = СтрокаПродукция.Номенклатура;
		НоваяСтрока.Рецептура    = СтрокаПродукция.Рецептура;
		
		ТекстОшибки = "";
		ЕстьОшибки  = Ложь;
		ПроверитьСоставРецептуры(СтрокаПродукция.Рецептура, НоваяСтрока, ТекстОшибки, ЕстьОшибки);
		Если ЕстьОшибки Тогда
			ВывестиСообщение(НСтр("ru = 'Продукции'") + Символы.НПП + "["+СокрЛП(СтрокаПродукция.Номенклатура.Код)+"] "+СокрЛП(СтрокаПродукция.Номенклатура) 
							+ НСтр("ru = ' некорректно заполнена рецептура: '") + Символы.ПС + ТекстОшибки,
							ЭтотОбъект, "Продукция[#].Рецептура", СтрокаПродукция.НомерСтроки, Отказ);
		КонецЕсли;
		
		ДеревоПродукции = Неопределено;//Актуально только в пределах одного цикла...
		
	КонецЦикла;
	
	//Курсы валют и проверки
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	//КурсРегл = КурсСучетомКратности(Дата, ВалютаРегл);
	Если ВалютаДокумента<>ВалютаРегл Тогда
		Отказ=Истина;
		Ошибки=Ошибки+"Валюта документа "+ВалютаДокумента+" не совпадает с валютой регламентированного учета организации "+ВалютаРегл+"!"+Символы.ПС;
		Ошибки=Ошибки+"	Документ может быть оформлен только в регламентированной валюте!"+Символы.ПС;
		
		
		ВывестиСообщение(НСтр("ru = 'Валюта документа '") + Символы.НПП + СокрЛП(ВалютаДокумента) 
							+ НСтр("ru = ' не совпадает с валютой регламентированного учета организации '"+СокрЛП(ВалютаРегл)+"'!'") + Символы.ПС + 
							НСтр("ru = ' Документ может быть оформлен только в регламентированной валюте!'"), ЭтотОбъект,,, Отказ);
	КонецЕсли;
	//ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	//КурсУпр=КурсСучетомКратности(Дата,ВалютаУпр);
	//Курс=обКурсДляВалюты(ВалютаДокумента,Дата).Курс;
	//КурсДок=КурсСучетомКратности(Дата,ВалютаДокумента);
	НуженКурсовойПересчет = (НЕ КурсДокумента = КурсВалютыУпр);
	
	Если Отказ Тогда
		//Сообщить("Документ "+Ссылка+" оформлен с нарушениями.",СтатусСообщения.Важное);
		//Сообщить(""+СокрЛП(Ошибки),СтатусСообщения.Важное);
		//Сообщить("Из-за некорректного оформления операция проведения была отменена."+Символы.ПС,СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	//#Если Клиент Тогда
	//Состояние("Формирование основных таблиц выпуска...");
	//#КонецЕсли
	
	//Рассчитываем таблицу итогового выпуска
	ТипБулево             = Новый ОписаниеТипов("Булево");
	ТипНоменклатура       = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ТипСклад              = Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании");
	ТипЕдиница            = Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения");
	ТипЧисло10            = Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10));
	ТипЧисло10_3          = Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,3));
	ТипЧислоДляКоличества = Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(19,6));
	ТипЧислоДляЦены       = Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(19,2));
	ТипЧислоДляСуммы      = Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(19,2));
	ТипРецептура          = Новый ОписаниеТипов("ДокументСсылка.Рецептура");
	
	ТаблицаПродукцииИтоговая = Продукция.Выгрузить();
	ТаблицаПродукцииИтоговая.Колонки.Добавить("ЭтоПолуфабрикат",            ТипБулево);
	ТаблицаПродукцииИтоговая.Колонки.Добавить("ДляПродукции",               ТипНоменклатура);
	ТаблицаПродукцииИтоговая.Колонки.Добавить("НомерСтрокиПродукции",       ТипЧисло10);
	ТаблицаПродукцииИтоговая.Колонки.Добавить("ЭтоДополнительныйВыпуск",    ТипБулево);
	ТаблицаПродукцииИтоговая.Колонки.Добавить("НомерСтрокиОсновнойТаблицы", ТипЧисло10);
	ТаблицаПродукцииИтоговая.Колонки.Добавить("ЭтоСпеция",                  ТипБулево);
	ТаблицаПродукцииИтоговая.Колонки.Добавить("УровеньПродукции",           ТипЧисло10);//Актуален для вложенного выпуска, который осуществляется от максимального уровня к нулевому
	
	ТаблицаИнгредиентовИтоговая=Новый ТаблицаЗначений;
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СкладКомпании",              ТипСклад);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("ДляПродукции",               ТипНоменклатура);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("НомерСтрокиПродукции",       ТипЧисло10);//Номер строки в ТаблицаПродукцииИтоговая
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("РецептураПродукции",         ТипРецептура);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("Рецептура",                  ТипРецептура);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("УровеньПродукции",           ТипЧисло10);//Актуален для вложенного выпуска, который осуществляется от максимального уровня к нулевому
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("КоличествоПродукции",        ТипЧислоДляКоличества);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("КоличествоИнгредиентаНаЕдиницуПродукции", ТипЧислоДляКоличества);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("ЦенаПродукцииРозничная",     ТипЧислоДляЦены);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СуммаПродукцииРозничная",    ТипЧислоДляСуммы);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СуммаПродукцииРозничнаяУпр", ТипЧислоДляСуммы);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("ЭтоПолуфабрикат",            ТипБулево);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("НомерСтрокиПолуфабриката",   ТипЧисло10);//Номер строки в ТаблицаПродукцииИтоговая
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("УровеньПолуфабриката",       ТипЧисло10);//Актуален для вложенного выпуска, который осуществляется от максимального уровня к нулевому
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Теперь колонки ингредиента....
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("ПорядковыйНомерИнгредиента",ТипЧисло10);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("Ингредиент",ТипНоменклатура);
	//
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("ЕдиницаИзмеренияИнгредиента",ТипЕдиница);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("КоэффициентИнгредиента",ТипЧисло10_3);//
	//
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("КоличествоИнгредиентаНорма",ТипЧислоДляКоличества);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("КоличествоИнгредиентаФакт",ТипЧислоДляКоличества);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("КоличествоИнгредиентаВыпустить",ТипЧислоДляКоличества);
	//
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("ЦенаИнгредиентаРозничная",ТипЧислоДляЦены);	
	//
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СуммаИнгредиентаРозничнаяФакт",ТипЧислоДляСуммы);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СуммаИнгредиентаРозничнаяФактУпр",ТипЧислоДляСуммы);
	//
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СуммаИнгредиентаРозничнаяВыпустить",ТипЧислоДляСуммы);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СуммаИнгредиентаРозничнаяВыпуститьУпр",ТипЧислоДляСуммы);
	//
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СебестоимостьИнгредиентаФакт",ТипЧислоДляСуммы);
	//ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СебестоимостьИнгредиентаФактРегл",ТипЧислоДляСуммы);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СебестоимостьИнгредиентаФактУпр",ТипЧислоДляСуммы);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СебестоимостьБезНДСИнгредиентаФакт",ТипЧислоДляСуммы);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СебестоимостьБезНДСИнгредиентаФактУпр",ТипЧислоДляСуммы);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("НДССебестоимостиИнгредиентаФактУпр",ТипЧислоДляСуммы);
	
	//с НДС - таже песня, что и с НДС продукции
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("НДССебестоимостиИнгредиентаФакт",ТипЧислоДляСуммы);
	//
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СебестоимостьИнгредиентаВыпустить",ТипЧислоДляСуммы);
	//ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СебестоимостьИнгредиентаВыпуститьРегл",ТипЧислоДляСуммы);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СебестоимостьИнгредиентаВыпуститьУпр",ТипЧислоДляСуммы);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СебестоимостьБезНДСИнгредиентаВыпустить",ТипЧислоДляСуммы);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("СебестоимостьБезНДСИнгредиентаВыпуститьУпр",ТипЧислоДляСуммы);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("НДССебестоимостиИнгредиентаВыпуститьУпр",ТипЧислоДляСуммы);
	
	//с НДС - таже песня, что и с НДС продукции
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("НДССебестоимостиИнгредиентаВыпустить",ТипЧислоДляСуммы);
	//
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("ЭтоСпеция",ТипБулево);
	//
	//Следующие 2 параметра актуальны в случае, если выпускаемый полуфабрикат есть еще и в таблице "Продукция", и числится на остатках...
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("ЭтоДополнительныйВыпуск",ТипБулево);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("НомерСтрокиОсновнойТаблицы",ТипЧисло10);
	//
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("ЭтоЗаменаИнгредиента",ТипБулево);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("ЗаменяемыйИнгредиент",ТипНоменклатура);
	ТаблицаИнгредиентовИтоговая.Колонки.Добавить("КоличествоЗаменяемогоИнгредиента",ТипЧислоДляКоличества);
	
	СводнаяТаблицаОстатков=Новый ТаблицаЗначений;
	СводнаяТаблицаОстатков.Колонки.Добавить("Номенклатура",ТипНоменклатура);
	СводнаяТаблицаОстатков.Колонки.Добавить("Количество",ТипЧислоДляКоличества);
	СводнаяТаблицаОстатков.Колонки.Добавить("Резерв",ТипЧислоДляКоличества);
	СводнаяТаблицаОстатков.Колонки.Добавить("ОбщийОстаток",ТипЧислоДляКоличества);
	СводнаяТаблицаОстатков.Колонки.Добавить("РанееПередано",ТипЧислоДляКоличества);
	
	РозничныйСклад = СкладКомпании.Розничный;
	итРегистрироватьРозничныеЦеныПриВыпускенаРозничномСкладе = СкладКомпании.итРегистрироватьРозничныеЦеныПриВыпускенаРозничномСкладе;
	
	//Если ПодразделениеКомпании.ИспользоватьЦеныПодразделенияПриЗаполненииДокументов Тогда
	//	_ТипЦен  = ПодразделениеКомпании.ТипЦенРеализации;
	//	_ТипЦен2 = СкладКомпании.ТипЦенРозничнойТорговли;
	//Иначе
		_ТипЦен  = СкладКомпании.ТипЦенРозничнойТорговли;
		_ТипЦен2 = Неопределено;
	//КонецЕсли;
	ПоследняяСтрока            = ТаблицаПродукцииИтоговая.Количество();
	ПоследняяСтрокаИнгредиента = 0;
	Для Каждого СтрокаТЧ ИЗ Продукция Цикл
		ДополнитьИтоговыеТаблицы(СтрокаТЧ, ТаблицаПродукцииИтоговая, ТаблицаИнгредиентовИтоговая, ПоследняяСтрока, ПоследняяСтрокаИнгредиента, 1, _ТипЦен,_ТипЦен2 ,РозничныйСклад, РежимПроведения, СводнаяТаблицаОстатков);
	КонецЦикла;
	МассивИнгредиентов=ТаблицаИнгредиентовИтоговая.ВыгрузитьКолонку("Ингредиент");
	//остатки ингредиентов будут там же, где и остатки ПФ
	//#Если Клиент Тогда
	//Состояние("Расчет остатков ингредиентов...");
	//#КонецЕсли	
	ДополнитьТаблицуОстатковПФ(МассивИнгредиентов, РежимПроведения, СводнаяТаблицаОстатков);
	
	МенеджерВР=Новый МенеджерВременныхТаблиц;
	//Помещаем во временную таблицу ингредиенты - но работать в основном будем с ТаблицаИнгредиентовИтоговая
	//тзИнгредиенты нам потребуется потом
	ЗапросВР1=Новый Запрос;
	ЗапросВР1.МенеджерВременныхТаблиц=МенеджерВР;
	ЗапросВР1.Текст="ВЫБРАТЬ * ПОМЕСТИТЬ тзИнгредиенты ИЗ &ТЗ КАК ТЗ";
	ЗапросВР1.УстановитьПараметр("ТЗ",ТаблицаИнгредиентовИтоговая);
	РезВР1=ЗапросВР1.Выполнить();
	
	//Помещаем во временную таблицу остатки ингредиентов
	ЗапросВР2=Новый Запрос;
	ЗапросВР2.МенеджерВременныхТаблиц=МенеджерВР;
	ЗапросВР2.Текст="ВЫБРАТЬ * ПОМЕСТИТЬ тзОстаткиИнгредиентов ИЗ &ТЗ КАК ТЗ";
	ЗапросВР2.УстановитьПараметр("ТЗ",СводнаяТаблицаОстатков);
	РезВР2=ЗапросВР2.Выполнить();
	ТаблицаОстаткиАналогов=СводнаяТаблицаОстатков.Скопировать();
	
	//Получим список недостающих товаров с аналогами
	Если ЗаменятьИнгредиентыАналогами Тогда
		//#Если Клиент Тогда
		//Состояние("Формирование списка аналогов и расчет их остатков...");
		//#КонецЕсли
		Запрос=Новый Запрос;
		Запрос.МенеджерВременныхТаблиц=МенеджерВР;
		Запрос.Текст="ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА тзОстатки.Номенклатура ЕСТЬ NULL 
		|			ТОГДА тзИнгредиенты.Ингредиент
		|		ИНАЧЕ тзОстатки.Номенклатура
		|	КОНЕЦ КАК Номенклатура,
		|	МАКСИМУМ(ЕСТЬNULL(тзОстатки.Количество, 0)) КАК Количество,
		|	МАКСИМУМ(ЕСТЬNULL(тзОстатки.Резерв, 0)) КАК Резерв,
		|	тзИнгредиенты.Ингредиент КАК Ингредиент,
		|	СУММА(тзИнгредиенты.КоличествоИнгредиентаНорма) КАК КоличествоИнгредиентаНорма,
		|	МАКСИМУМ(тзИнгредиенты.ЭтоСпеция) КАК ЭтоСпеция
		|ИЗ
		|	тзИнгредиенты КАК тзИнгредиенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ тзОстаткиИнгредиентов КАК тзОстатки
		|		ПО (тзОстатки.Номенклатура = тзИнгредиенты.Ингредиент)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА тзОстатки.Номенклатура ЕСТЬ NULL 
		|			ТОГДА тзИнгредиенты.Ингредиент
		|		ИНАЧЕ тзОстатки.Номенклатура
		|	КОНЕЦ,
		|	тзИнгредиенты.Ингредиент
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ЕСТЬNULL(тзОстатки.Количество, 0)) - МАКСИМУМ(ЕСТЬNULL(тзОстатки.Резерв, 0)) < СУММА(тзИнгредиенты.КоличествоИнгредиентаНорма)
		|";
		Результ=Запрос.Выполнить();
		ПредварительныйМассивНедостающих=Результ.Выгрузить().ВыгрузитьКолонку("Ингредиент");
		//Получаем список аналогов
		ЗапросАналоги=Новый Запрос("
		|ВЫБРАТЬ
		|	ГруппыАналогов.Номенклатура,
		|	ГруппыАналогов.ИдентификаторГруппы КАК ИдентификаторГруппы
		|ПОМЕСТИТЬ
		|	ТаблицаГрупп
		|ИЗ
		|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
		|ГДЕ
		|	ГруппыАналогов.Номенклатура В (&Заменяемое)
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаГрупп.Номенклатура КАК Заменяемое,
		|	ГруппыАналогов.Номенклатура КАК Заменитель,
		|	ГруппыАналогов.Коэффициент КАК Коэффициент,
		|	ГруппыАналогов.Приоритет КАК Приоритет
		|ИЗ
		|	ТаблицаГрупп КАК ТаблицаГрупп
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
		|ПО
		|	ТаблицаГрупп.ИдентификаторГруппы = ГруппыАналогов.ИдентификаторГруппы
		|ГДЕ
		|	(НЕ ТаблицаГрупп.Номенклатура = ГруппыАналогов.Номенклатура) И 
		|	(НЕ ГруппыАналогов.Коэффициент = 0) И 
		|	(НЕ ГруппыАналогов.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Продукция))
		|
		|");
		ЗапросАналоги.УстановитьПараметр("Заменяемое", ПредварительныйМассивНедостающих);
		//Получили аналоги - выгрузим в таблицу - она нам понадобится
		ТаблицаАналогов = ЗапросАналоги.Выполнить().Выгрузить();
		//Получаем остатки аналогов
		МассивАналогов = ТаблицаАналогов.ВыгрузитьКолонку("Заменитель");
		ДополнитьТаблицуОстатковПФ(МассивАналогов, РежимПроведения, ТаблицаОстаткиАналогов);
		////Можно было бы поместить временную таблицу остатки аналогов
		//Но, т.к. мы будем потом еще и строки в данной таблице изменять, то, разумеется, ничего помещать пока не надо
		//Зато помещаем во временную таблицу аналоги, которые есть на остатках, чтобы не анализирвоать аналоги, отсутствующие на складе
		ЗапросВР3=Новый Запрос;
		ЗапросВР3.МенеджерВременныхТаблиц=МенеджерВР;
		ЗапросВР3.Текст="ВЫБРАТЬ * ПОМЕСТИТЬ тзАналоги ИЗ &ТЗ КАК ТЗ ГДЕ ТЗ.Заменитель В(&МассивАналоговСОстатками)";
		ЗапросВР3.УстановитьПараметр("ТЗ",ТаблицаАналогов);
		ЗапросВР3.УстановитьПараметр("МассивАналоговСОстатками", ТаблицаОстаткиАналогов.ВыгрузитьКолонку("Номенклатура"));
		РезВР3 = ЗапросВР3.Выполнить();
		//ЗапросВР4=Новый Запрос;
		//ЗапросВР4.МенеджерВременныхТаблиц=МенеджерВР;
		//ЗапросВР4.Текст="ВЫБРАТЬ * ПОМЕСТИТЬ тзОстаткиАналогов ИЗ &ТЗ КАК ТЗ";
		//ЗапросВР4.УстановитьПараметр("ТЗ",ТаблицаОстаткиАналогов);
		//РезВР4=ЗапросВР4.Выполнить();
	КонецЕсли;
	
	//#Если Клиент Тогда
	//Состояние("Распределение ингредиентов в соответствии с рецептурами"+?(ЗаменятьИнгредиентыАналогами," и замена на аналоги","")+"...");
	//#КонецЕсли
	РазрешитьСписыватьРезерв   = (ПравоПользователя("РазрешениеСнятияРезервов", ЭтотОбъект)<>Перечисления.РезервыСпособыСписания.Запрещено);
	ПравоОприходованиеИзлишков = ПравоПользователя("РазрешитьОтрицательныеСкладскиеОстатки", ЭтотОбъект);
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ТаблицаИнгредиентовИтоговая.Сортировать("Ингредиент ВОЗР, НомерСтрокиПродукции ВОЗР");
	
	ПредыдущийИнгредиент=Неопределено;
	//СтрокаПредыдущего=Неопределено;
	СтрокаОстаткаИнгредиента=Неопределено;
	СтрокаОстаткаАналога=Неопределено;
	ВсегоСтрокПродукции=Продукция.Количество();
	//ОТЛАДКА
	//ПоказатьТаблицу(ТаблицаИнгредиентовИтоговая,"ТаблицаИнгредиентовИтоговая");
	//-ОТЛАДКА
	ТаблицаАналоговИтоговая=ТаблицаИнгредиентовИтоговая.СкопироватьКолонки();
	Для Каждого СтрокаИнгр Из ТаблицаИнгредиентовИтоговая Цикл
		//Начинаем распределение остатков
		//Если СтрокаИнгр.ЭтоСпеция Тогда
		//	ОсталосьСписать=Окр(СтрокаИнгр.КоличествоИнгредиентаНорма*СтрокаИнгр.КоэффициентИнгредиента,6); //Обычно коэффициент = 1
		//Иначе
		//	ОсталосьСписать=Окр(СтрокаИнгр.КоличествоИнгредиентаНорма*СтрокаИнгр.КоэффициентИнгредиента,3); //Обычно коэффициент = 1
		//КонецЕсли;
		//Пересчет уже сделан и СтрокаИнгр.КоличествоИнгредиентаНорма приведены к коэффициенту строки
		ОсталосьСписать=СтрокаИнгр.КоличествоИнгредиентаНорма;
		НадоСписатьВСообщении=ОсталосьСписать;
		
		Если СтрокаИнгр.ЭтоДополнительныйВыпуск  Тогда
			//Связано с тем, что продукция может быть на остатке, при этом выпускаться в ТЧ Продукция,
			//И содержаться во вложенном выпуске. В этом случае вложенный выпуск не должен пытаться списать остаток.
			//Все выпускаем, без учета остатка
			//НО Выпуск у нас уже расчитан!!!!
			//СтрокаИнгр.КоличествоИнгредиентаВыпустить=СтрокаИнгр.КоличествоИнгредиентаВыпустить+ОсталосьСписать;//ВыпускВсегдаВБазовых
			//??
			//РанееПередано=РанееПередано+ОсталосьСписать;
			//-??
			ОсталосьСписать=0;
		ИначеЕсли СтрокаИнгр.ЭтоПолуфабрикат  Тогда
			//Количество уже распределено с учетом остатка
			//И недостающее количество будет выпущено...
			ОсталосьСписать=0;
		Иначе
			//Получаем остаток и проверяем, хватит ли нам его для списания
			Если ПредыдущийИнгредиент<>СтрокаИнгр.Ингредиент Тогда
				//РанееПередано=0;
				ЕстьОстаток=Ложь;
				ПредыдущийИнгредиент=СтрокаИнгр.Ингредиент;
				//СтрокаПредыдущего=СтрокаИнгр;
				
				//Если НЕ СтрокаИнгр.ЭтоПолуфабрикат Тогда
				//	СтрокаОстаткаИнгредиента=СводнаяТаблицаОстатков.Найти(СтрокаИнгр.Ингредиент,"Номенклатура");
				//	
				//КонецЕсли;
				//Если СтрокаОстаткаИнгредиента=Неопределено Тогда
				СтрокаОстаткаИнгредиента=СводнаяТаблицаОстатков.Найти(СтрокаИнгр.Ингредиент,"Номенклатура");
				Если СтрокаОстаткаИнгредиента<>Неопределено Тогда
					ЕстьОстаток=Истина;
				КонецЕсли;
				//
				Если ЗаменятьИнгредиентыАналогами Тогда
					СтрокаОстаткаАналога=ТаблицаОстаткиАналогов.Найти(СтрокаИнгр.Ингредиент,"Номенклатура");
				КонецЕсли;
				//
			КонецЕсли;
			Если ЕстьОстаток Тогда
				Если СтрокаОстаткаИнгредиента.ОбщийОстаток>0 Тогда
					//Распределим количество
					Если ОсталосьСписать<=СтрокаОстаткаИнгредиента.ОбщийОстаток Тогда
						СтрокаИнгр.КоличествоИнгредиентаФакт=ОсталосьСписать;//ФактВсегдаВБазовых
						//ОсталосьСписать=0; //skud 20130724 перенес ниже
						СтрокаОстаткаИнгредиента.ОбщийОстаток=СтрокаОстаткаИнгредиента.ОбщийОстаток-ОсталосьСписать;
						ОсталосьСписать=0;
					Иначе
						СтрокаИнгр.КоличествоИнгредиентаФакт=СтрокаОстаткаИнгредиента.ОбщийОстаток;//ФактВсегдаВБазовых
						ОсталосьСписать=ОсталосьСписать-СтрокаОстаткаИнгредиента.ОбщийОстаток;
						СтрокаОстаткаИнгредиента.ОбщийОстаток=0;
					КонецЕсли;
					СтрокаОстаткаИнгредиента.РанееПередано=СтрокаОстаткаИнгредиента.РанееПередано+СтрокаИнгр.КоличествоИнгредиентаФакт;
					
					////Теперь нужно пересчитать ингредиенты для полуфабриката, т.к. 
					//
					//Если СтрокаИнгр.ЭтоПолуфабрикат Тогда
					//	Сообщить(""+СтрокаИнгр.Ингредиент);
					//КонецЕсли;
					/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
					//АНАЛОГИ
					Если ЗаменятьИнгредиентыАналогами Тогда
						Если СтрокаОстаткаАналога<>Неопределено Тогда
							//СтрокаОстаткаАналога.ОбщийОстаток=СтрокаОстаткаАналога.ОбщийОстаток-СтрокаИнгр.КоличествоИнгредиентаФакт;
							//СтрокаОстаткаАналога.РанееПередано=СтрокаИнгр.КоличествоИнгредиентаФакт;
							СтрокаОстаткаАналога.ОбщийОстаток=СтрокаОстаткаИнгредиента.ОбщийОстаток;
							СтрокаОстаткаАналога.РанееПередано=СтрокаОстаткаИнгредиента.РанееПередано;
						КонецЕсли;
					КонецЕсли;
					//-АНАЛОГИ
				КонецЕсли;
			КонецЕсли;
			
			//Если заменить не удалось или не требовалось, тогда или приходуем излишек, или отменяем проведение
			УдалосьЗаменитьВсего=0;
			Если ОсталосьСписать>0 Тогда
			/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
				//АНАЛОГИ
				//Если не хватило остатка тогда пытаемся заменить
				Если ЗаменятьИнгредиентыАналогами Тогда
					//Обычный товар заменяем на аналоги...
					//Искать строки в таблице уже полученных аналогов нельзя, т.к. может не работать упорядочивание по приортету
					//значит, будет запрос в цикле
					ЗапросАналоги=Новый Запрос("ВЫБРАТЬ
					|	Аналоги.Заменяемое КАК Заменяемое,
					|	Аналоги.Заменитель КАК Заменитель,
					|	Аналоги.Коэффициент КАК Коэффициент,
					|	Аналоги.Приоритет КАК Приоритет
					|ИЗ
					|	тзАналоги КАК Аналоги
					|ГДЕ
					|	Аналоги.Заменяемое = &Заменяемое
					|	И (НЕ Аналоги.Заменитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Продукция))
					|
					|УПОРЯДОЧИТЬ ПО
					|	Приоритет");
					ЗапросАналоги.МенеджерВременныхТаблиц=МенеджерВР;
					ЗапросАналоги.УстановитьПараметр("Заменяемое",СтрокаИнгр.Ингредиент);
					Результ=ЗапросАналоги.Выполнить();
					ВыборкаАналоги=Результ.Выбрать();
					Пока ВыборкаАналоги.Следующий() Цикл
						//Получаем остаток и проверяем, хватит ли нам его для списания
						//РанееПередано=0;
						ЕстьОстаток=Ложь;
						СтрокаОстаткаАналога=ТаблицаОстаткиАналогов.Найти(ВыборкаАналоги.Заменитель,"Номенклатура");
						СтрокаОстаткаИнгредиента=СводнаяТаблицаОстатков.Найти(ВыборкаАналоги.Заменитель,"Номенклатура");
						Если СтрокаОстаткаАналога<>Неопределено Тогда
							ЕстьОстатокАналога=Истина;
						КонецЕсли;
						Если ЕстьОстатокАналога Тогда
							Если СтрокаОстаткаАналога.ОбщийОстаток>0 Тогда
								//Распределим количество
								МожноЗаменить=0;
								Если СтрокаИнгр.ЭтоСпеция Тогда
									НужноЗаменить=Окр(ОсталосьСписать*ВыборкаАналоги.Коэффициент,6);
								Иначе
									НужноЗаменить=Окр(ОсталосьСписать*ВыборкаАналоги.Коэффициент,3);
								КонецЕсли;
								УдалосьЗаменить=0;
								Если НужноЗаменить<=СтрокаОстаткаАналога.ОбщийОстаток Тогда
									МожноЗаменить=НужноЗаменить;
									//СтрокаИнгр.КоличествоИнгредиентаФакт=ОсталосьСписать;//ФактВсегдаВБазовых
									УдалосьЗаменить=ОсталосьСписать;
									УдалосьЗаменитьВсего=УдалосьЗаменитьВсего+УдалосьЗаменить;
									СтрокаОстаткаАналога.ОбщийОстаток=СтрокаОстаткаАналога.ОбщийОстаток-МожноЗаменить;
									ОсталосьСписать=0;
								Иначе
									//СтрокаИнгр.КоличествоИнгредиентаФакт=СтрокаОстаткаАналога.ОбщийОстаток;//ФактВсегдаВБазовых
									МожноЗаменить=СтрокаОстаткаАналога.ОбщийОстаток;
									Если СтрокаИнгр.ЭтоСпеция Тогда
										УдалосьЗаменить=Окр(СтрокаОстаткаАналога.ОбщийОстаток/ВыборкаАналоги.Коэффициент,6);
									Иначе
										УдалосьЗаменить=Окр(СтрокаОстаткаАналога.ОбщийОстаток/ВыборкаАналоги.Коэффициент,3);
									КонецЕсли;
									ОсталосьСписать=ОсталосьСписать-УдалосьЗаменить;
									УдалосьЗаменитьВсего=УдалосьЗаменитьВсего+УдалосьЗаменить;
									СтрокаОстаткаАналога.ОбщийОстаток=0;
								КонецЕсли;
								СтрокаОстаткаАналога.РанееПередано=СтрокаОстаткаАналога.РанееПередано+МожноЗаменить;
								//нужно уменьшить количество еще и в таблице остатков
								Если СтрокаОстаткаИнгредиента<>Неопределено Тогда
									СтрокаОстаткаИнгредиента.ОбщийОстаток=СтрокаОстаткаАналога.ОбщийОстаток;
									СтрокаОстаткаИнгредиента.РанееПередано=СтрокаОстаткаАналога.РанееПередано;
								КонецЕсли;
								//Теперь заменяем
								Если МожноЗаменить>0 Тогда
									НовСтрИнгр=ТаблицаАналоговИтоговая.Добавить();
									НовСтрИнгр.ПорядковыйНомерИнгредиента=СтрокаИнгр.ПорядковыйНомерИнгредиента;
									НовСтрИнгр.ЭтоПолуфабрикат=Ложь;
									//
									НовСтрИнгр.ДляПродукции=СтрокаИнгр.ДляПродукции;
									НовСтрИнгр.НомерСтрокиПродукции=СтрокаИнгр.НомерСтрокиПродукции;
									НовСтрИнгр.РецептураПродукции=СтрокаИнгр.РецептураПродукции;
									НовСтрИнгр.КоличествоПродукции=СтрокаИнгр.КоличествоПродукции;
									НовСтрИнгр.ЦенаПродукцииРозничная=СтрокаИнгр.ЦенаПродукцииРозничная;
									НовСтрИнгр.УровеньПродукции=СтрокаИнгр.УровеньПродукции;
									НовСтрИнгр.Ингредиент=ВыборкаАналоги.Заменитель;
									НовСтрИнгр.ЭтоСпеция=НовСтрИнгр.ЭтоСпеция;
									НовСтрИнгр.КоличествоИнгредиентаФакт=МожноЗаменить;
									
									НовСтрИнгр.ЕдиницаИзмеренияИнгредиента = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(ВыборкаАналоги.Заменитель);
									НовСтрИнгр.КоэффициентИнгредиента=1;
									
									Если СтрокаИнгр.ЭтоСпеция Тогда
										//НовСтрИнгр.КоличествоИнгредиентаНорма=Окр(СтрокаИнгр.КоличествоИнгредиентаНорма*ВыборкаАналоги.Коэффициент,6);
										НовСтрИнгр.КоличествоИнгредиентаНаЕдиницуПродукции=Окр(СтрокаИнгр.КоличествоИнгредиентаНаЕдиницуПродукции*ВыборкаАналоги.Коэффициент,6);
									Иначе
										//НовСтрИнгр.КоличествоИнгредиентаНорма=Окр(СтрокаИнгр.КоличествоИнгредиентаНорма*ВыборкаАналоги.Коэффициент,3);
										НовСтрИнгр.КоличествоИнгредиентаНаЕдиницуПродукции=Окр(СтрокаИнгр.КоличествоИнгредиентаНаЕдиницуПродукции*ВыборкаАналоги.Коэффициент,3);
									КонецЕсли;
									НовСтрИнгр.КоличествоИнгредиентаНорма=0;//а норма нулевая, т.к. извините, но это аналог
									НовСтрИнгр.КоличествоИнгредиентаФакт=МожноЗаменить;
									//
									Если РозничныйСклад Тогда
										НовСтрИнгр.ЦенаИнгредиентаРозничная = ЦенообразованиеСервер.ПолучитьЦену(_ТипЦен, ВыборкаАналоги.Заменитель, МоментВремени(),, ВалютаДокумента, КурсДокумента);
										Если НовСтрИнгр.ЦенаИнгредиентаРозничная=0 И (НЕ _ТипЦен2=Неопределено) Тогда
											//Попытаемся найти хотя бы цену склада
											НовСтрИнгр.ЦенаИнгредиентаРозничная = ЦенообразованиеСервер.ПолучитьЦену(_ТипЦен2, ВыборкаАналоги.Заменитель, МоментВремени(),, ВалютаДокумента, КурсДокумента);
										КонецЕсли;
									Иначе
										НовСтрИнгр.ЦенаИнгредиентаРозничная=0;
									КонецЕсли;
									//
									НовСтрИнгр.НомерСтрокиПолуфабриката=0;
									НовСтрИнгр.УровеньПолуфабриката=0;
									//
									НовСтрИнгр.ЭтоДополнительныйВыпуск=Ложь;
									НовСтрИнгр.НомерСтрокиОсновнойТаблицы=0;
									//
									НовСтрИнгр.ЭтоЗаменаИнгредиента=Истина;
									НовСтрИнгр.ЗаменяемыйИнгредиент=СтрокаИнгр.Ингредиент;
									НовСтрИнгр.КоличествоЗаменяемогоИнгредиента=УдалосьЗаменить;
									//Сообщить("Можно заменить "+ВыборкаАналоги.Заменяемое+" на "+ВыборкаАналоги.Заменитель+" коэфф. "+ВыборкаАналоги.Коэффициент);
								КонецЕсли;
								Если ОсталосьСписать<=0 Тогда
									Прервать;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				//-АНАЛОГИ
			КонецЕсли;
			
			Если ОсталосьСписать>0 Тогда
				Если ПравоОприходованиеИзлишков=Перечисления.ВидыРазрешенныхОтрицательныхОстатков.ПоОстаткам Тогда
					СтрокаИнгр.КоличествоИнгредиентаФакт=СтрокаИнгр.КоличествоИнгредиентаФакт+ОсталосьСписать;//ФактВсегдаВБазовых
					ОсталосьСписать=0;
				Иначе
					//Определяем - это основной или вложенный выпуск
					Если СтрокаИнгр.НомерСтрокиПродукции>ВсегоСтрокПродукции Тогда
						СтрСообщения = НСтр("ru = 'Для вложенного выпуска'") + Символы.НПП + Строка(СтрокаИнгр.КоличествоПродукции) + НСтр("ru = ' ед. полуфабриката'") + Символы.НПП + Строка(СтрокаИнгр.дляПродукции);
					Иначе
						СтрСообщения = НСтр("ru = 'Для выпуска'") + Символы.НПП + Строка(СтрокаИнгр.КоличествоПродукции) + НСтр("ru = ' ед. продукции'") + Символы.НПП + Строка(СтрокаИнгр.дляПродукции) + НСтр("ru = ' в строке'") + Символы.НПП + Строка(СтрокаИнгр.НомерСтрокиПродукции);
					КонецЕсли;
					
					Если ЕстьОстаток Тогда
						СтрСообщения = СтрСообщения + Символы.ПС + 
						НСтр("ru = 'необходимо списать'") + Символы.НПП + Строка(СтрокаИнгр.Ингредиент)
						+НСтр("ru = ' в количестве'") + Символы.НПП + Строка(НадоСписатьВСообщении)+НСтр("ru = ' ед. Остаток на складе'") + Символы.НПП +?(РазрешитьСписыватьРезерв, Строка(СтрокаОстаткаИнгредиента.Количество), Строка(СтрокаОстаткаИнгредиента.Количество-СтрокаОстаткаИнгредиента.Резерв))
						+НСтр("ru = ' ед. Ранее уже передано в производство'")+Символы.НПП+Строка(СтрокаОстаткаИнгредиента.РанееПередано)
						+?(УдалосьЗаменитьВсего=0,НСтр("ru = ''"), НСтр("ru = ' ед. Заменено аналогами'")+Символы.НПП+Строка(УдалосьЗаменитьВсего))
						+НСтр("ru = ' ед. Требуется'")+Символы.НПП + Строка(ОсталосьСписать);
					Иначе
						СтрСообщения = СтрСообщения + Символы.ПС + 
						НСтр("ru = 'необходимо списать'") + Символы.НПП + Строка(СтрокаИнгр.Ингредиент)
						+НСтр("ru = ' в количестве'") + Символы.НПП + Строка(НадоСписатьВСообщении)+НСтр("ru = ' ед. Остаток на складе 0'")
						+?(УдалосьЗаменитьВсего=0,НСтр("ru = ''"),НСтр("ru = ' ед. Заменено аналогами'")+Символы.НПП+Строка(УдалосьЗаменитьВсего))
						+НСтр("ru = ' ед. Требуется'")+Символы.НПП + Строка(ОсталосьСписать);
					КонецЕсли;
					
					ВывестиСообщение(СтрСообщения,
							ЭтотОбъект, "Продукция[#].Номенклатура",, Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//ОТЛАДКА
	//ПоказатьТаблицу(ТаблицаИнгредиентовИтоговая,"ТаблицаИнгредиентовИтоговая2");
	//ПоказатьТаблицу(ТаблицаАналоговИтоговая,"ТаблицаАналоговИтоговая");
	//-ОТЛАДКА
	Если ЗаменятьИнгредиентыАналогами Тогда
		Для Каждого СтрокаАналогаИтоговая ИЗ ТаблицаАналоговИтоговая Цикл
			НовСтрИнгр=ТаблицаИнгредиентовИтоговая.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрИнгр,СтрокаАналогаИтоговая);
		КонецЦикла;
	КонецЕсли;
	//ОТЛАДКА
	//ПоказатьТаблицу(ТаблицаИнгредиентовИтоговая,"ТаблицаИнгредиентовИтоговая3");
	//-ОТЛАДКА
	//
	//Помещаем во временную таблицу ингредиенты
	ЗапросВР5=Новый Запрос;
	ЗапросВР5.МенеджерВременныхТаблиц=МенеджерВР;
	ЗапросВР5.Текст="ВЫБРАТЬ * ПОМЕСТИТЬ тзИнгредиентовОбработанная ИЗ &ТЗ КАК ТЗ";
	ЗапросВР5.УстановитьПараметр("ТЗ",ТаблицаИнгредиентовИтоговая);
	РезВР5=ЗапросВР5.Выполнить();
	
	//Получаем таблицу для списания ингредиентов
	Запрос=Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=МенеджерВР;
	Запрос.Текст="ВЫБРАТЬ
	|	&СкладКомпании КАК СкладКомпании,
	|	тзИнгредиенты.Ингредиент КАК Номенклатура,
	|	МАКСИМУМ(тзИнгредиенты.ЭтоСпеция) КАК ЭтоСпеция,
	|	&ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(тзИнгредиенты.КоличествоИнгредиентаФакт) КАК Количество,
	|	тзИнгредиенты.ЦенаИнгредиентаРозничная КАК ЦенаРозничная,
	|	ВЫРАЗИТЬ(тзИнгредиенты.ЦенаИнгредиентаРозничная * СУММА(тзИнгредиенты.КоличествоИнгредиентаФакт) КАК ЧИСЛО(17, 2)) КАК СуммаРозничная,
	|	0 КАК СуммаСкидки,
	|	ЕСТЬNULL(спрНоменклатура.Наименование, """") КАК Наименование
	|ИЗ
	|	тзИнгредиентовОбработанная КАК тзИнгредиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	|		ПО тзИнгредиенты.Ингредиент = спрНоменклатура.Ссылка
	//|ГДЕ
	//|	(НЕ тзИнгредиенты.этоПолуфабрикат)
	|
	|СГРУППИРОВАТЬ ПО
	|	тзИнгредиенты.Ингредиент,
	|	тзИнгредиенты.ЦенаИнгредиентаРозничная,
	|	спрНоменклатура.Наименование
	|ИМЕЮЩИЕ
	|	СУММА(тзИнгредиенты.КоличествоИнгредиентаФакт)>0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование,
	|	Номенклатура";
	Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	Результ=Запрос.Выполнить();
	ТаблицаИнгредиентовДляСписания=Результ.Выгрузить();
	
	//Обрабатываем количество, меньшее 0.001
	Для Каждого СтрокаТЧ ИЗ ТаблицаИнгредиентовДляСписания Цикл
		Колво2=СтрокаТЧ.Количество*1000;
		Если Цел(Колво2)<>Колво2 Тогда
			//Колво3=(Колво2-Цел(Колво2))/1000;
			//Сообщить(""+СтрокаТЧ.Номенклатура+" погрешность округления количества "+Колво3);
			Колво3=Цел(Колво2)/1000+0.001;
			СтрокаТЧ.Количество=Колво3;
			СтрокаТЧ.СуммаРозничная=Окр(СтрокаТЧ.Количество*СтрокаТЧ.ЦенаРозничная,2);
		КонецЕсли;
	КонецЦикла;
	
	//#Если Клиент Тогда
	//Состояние("Списание ингредиентов со склада...");
	//#КонецЕсли
	//Списываем ингредиенты стандартной функцией Расход() набора записей регистра ОстаткиТоваровКомпании
	НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	НаборЗаписейОстатки.РежимПроведения=РежимПроведения;
	НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=ТаблицаИнгредиентовДляСписания;
	НаборЗаписейОстатки.СкладКомпании=СкладКомпании;
	НаборЗаписейОстатки.Приходовать=Истина;
	НаборЗаписейОстатки.ПоБазовомуКоличеству=Истина;
	НаборЗаписейОстатки.ДвиженияПоРознице=СкладКомпании.Розничный;
	НаборЗаписейОстатки.СписыватьРозницуПоОстаткам=Истина;
	НаборЗаписейОстатки.ИмяРеквизитаЦенаРозничная="ЦенаРозничная";
	НаборЗаписейОстатки.Контрагент=Неопределено;
	НаборЗаписейОстатки.Резервировать=Ложь;
	НаборЗаписейОстатки.ХозОперация = Справочники.ХозОперации.ПередачаИнгредиентовВПроизводство;
	
	Отказ=НЕ НаборЗаписейОстатки.Расход() ИЛИ Отказ;
	
	Если РозничныйСклад Тогда
		//#Если Клиент Тогда
		//Состояние("Распределение розничных сумм...");
		//#КонецЕсли
		//Получаем таблицу списания ингредиентов...
		//В разрезе Ингредиент (Номенклатура), КоличествоСписано, СуммаРозничнаяСписано...
		
		ТЗ=Движения.ОстаткиТоваровКомпании.Выгрузить();
		//Помещаем еще во временную таблицу списания ингредиентов
		ЗапросВР6=Новый Запрос;
		ЗапросВР6.МенеджерВременныхТаблиц=МенеджерВР;
		ЗапросВР6.Текст="ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТЗ.ВидДвижения КАК ВидДвижения,
		|	ТЗ.ХозОперация КАК ХозОперация,
		|	ТЗ.Количество КАК Количество,
		|	ТЗ.СуммаРозн КАК СуммаРозн
		|ПОМЕСТИТЬ тзСписанияИнгредиентов
		|ИЗ
		|	&ТЗ КАК ТЗ
		|";
		ЗапросВР6.УстановитьПараметр("ТЗ",ТЗ);
		РезВР6=ЗапросВР6.Выполнить();
		//Получаем таблицу списанных ингредиентов
		Запрос=Новый Запрос;
		Запрос.МенеджерВременныхТаблиц=МенеджерВР;
		Запрос.Текст="ВЫБРАТЬ
		|	тзСписания.Номенклатура КАК Номенклатура,
		|	СУММА(тзСписания.Количество) КАК Количество,
		|	ВЫБОР
		|		КОГДА СУММА(тзСписания.Количество) = 0
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(тзСписания.СуммаРозн) / СУММА(тзСписания.Количество)
		|	КОНЕЦ КАК ЦенаРозн,
		|	СУММА(тзСписания.СуммаРозн) КАК СуммаРозн
		|ИЗ
		|	тзСписанияИнгредиентов КАК тзСписания
		|ГДЕ
		|	тзСписания.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И тзСписания.ХозОперация = &ХозОперация
		|
		|СГРУППИРОВАТЬ ПО
		|	тзСписания.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
		Запрос.УстановитьПараметр("ХозОперация",Справочники.ХозОперации.ПередачаИнгредиентовВПроизводство);
		Результ=Запрос.Выполнить();
		тзСписанияИнгредиентов=Результ.Выгрузить();
		//
		Если ПодразделениеКомпании.ПереоценкаРозницаПоПриходу Тогда
			//Получаем таблицу списанной продукции - то же самое, только для продукции
			//таблица нужна будет при переоценке остатков по приходу - но не сейчас, а позже
			Запрос.Текст="ВЫБРАТЬ
			|	тзСписания.Номенклатура КАК Номенклатура,
			|	тзСписания.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	СУММА(тзСписания.Количество) КАК Количество,
			|	ВЫБОР
			|		КОГДА СУММА(тзСписания.Количество) = 0
			|			ТОГДА 0
			|		ИНАЧЕ СУММА(тзСписания.СуммаРозн) / СУММА(тзСписания.Количество)
			|	КОНЕЦ КАК ЦенаРозн,
			|	СУММА(тзСписания.СуммаРозн) КАК СуммаРозн
			|ИЗ
			|	тзСписанияИнгредиентов КАК тзСписания
			|ГДЕ
			|	тзСписания.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|	И тзСписания.ХозОперация = &ХозОперация
			|	И тзСписания.Номенклатура.ВидНоменклатуры = &Продукция
			|
			|СГРУППИРОВАТЬ ПО
			|	тзСписания.Номенклатура,
			|	тзСписания.ХарактеристикаНоменклатуры
			|
			|УПОРЯДОЧИТЬ ПО
			|	Номенклатура,ХарактеристикаНоменклатуры";
			Запрос.УстановитьПараметр("Продукция",Перечисления.ВидыНоменклатуры.Продукция);
			Результ=Запрос.Выполнить();
			тзСписанияПродукции=Результ.Выгрузить();
			
		КонецЕсли;
		//
		//Пока таблица отсортирована по полю "Ингредиент" мы можем пройтись и распределить розничные суммы из тзСписанияИнгредиентов
		//, так же, как и обходили количество для расчета замен и выпуска...
		ПредыдущийИнгредиент=Неопределено;
		СтрокаПредыдущего=Неопределено;
		СтрокаСписанного=Неопределено;
		Для Каждого СтрокаИнгр Из ТаблицаИнгредиентовИтоговая Цикл
			
			//Начинаем распределение списанных с остатков ингредиентов
			Если СтрокаИнгр.КоличествоИнгредиентаФакт>0 Тогда
				//Сообщить(""+СтрокаИнгр.Ингредиент+" Количество = "+СтрокаИнгр.КоличествоИнгредиентаФакт+"");
				Если ПредыдущийИнгредиент<>СтрокаИнгр.Ингредиент Тогда
					//Если СтрокаПредыдущего<>Неопределено И СтрокаСписанного<>Неопределено Тогда
					//	//Посмотрим, что осталось
					//	Если СтрокаСписанного.СуммаРозн<=0.01 И СтрокаСписанного.СуммаРозн>=-0.01 Тогда
					//		
					//	КонецЕсли;
					//КонецЕсли;
					ПредыдущийИнгредиент=СтрокаИнгр.Ингредиент;
					СтрокаПредыдущего=СтрокаИнгр;
					СтрокаСписанного=тзСписанияИнгредиентов.Найти(СтрокаИнгр.Ингредиент,"Номенклатура");
				КонецЕсли;
				Если СтрокаСписанного=Неопределено Тогда
					//Маловероятно, но надо сообщить хоть что-нибудь
					Сообщить("- Не найдена запись о списании ингредиента "+СтрокаИнгр.Ингредиент+" в количестве "+СтрокаИнгр.КоличествоИнгредиентаФакт+"ед. для продукции "+СтрокаИнгр.ДляПродукции,СтатусСообщения.Важное);
				Иначе
					//Сообщить("+ Успешно найдена запись о списании ингредиента "+СтрокаИнгр.Ингредиент+" в количестве "+СтрокаИнгр.КоличествоИнгредиентаФакт+"ед. для продукции "+СтрокаИнгр.ДляПродукции);
					СтрокаИнгр.СуммаИнгредиентаРозничнаяФакт=Окр(СтрокаСписанного.ЦенаРозн*СтрокаИнгр.КоличествоИнгредиентаФакт,2);
					//
					СтрокаСписанного.Количество=СтрокаСписанного.Количество-СтрокаИнгр.КоличествоИнгредиентаФакт;
					//
					СтрокаСписанного.СуммаРозн=СтрокаСписанного.СуммаРозн-СтрокаИнгр.СуммаИнгредиентаРозничнаяФакт;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//тзСписанияИнгредиентов потребуется в дальнейшем для закрытия сумм в регистре "Производство"
		//а также по регистрам остатков и партий, для кооректного отражения сумм и количества специй,
		//а может быть и для обычных товаров 
		//- если мы списали со склада 9.999 кг на сумму 10 руб, то распределить на 3 позиции по 3.333 кг. на 10 руб. никак не выйдет
		//- т.е. есть погрешности округления стоимости выпускаемой продукции, и списанных ингредиентов
		//вот эти погрешности и надо как-либо отразить в учете.
		////ОТЛАДОЧНЫЕ СТРОКИ
		//ПоказатьТаблицу(тзСписанияИнгредиентов,"ТзСписанияИнгредиентовОсталосьНераспределенным");
		//ПоказатьТаблицу(ТаблицаИнгредиентовИтоговая,"ТаблицаИнгредиентовИтоговая");
		////-ОТЛАДОЧНЫЕ СТРОКИ
		Для Каждого СтрокаСпеции ИЗ тзСписанияИнгредиентов Цикл
			Если СтрокаСпеции.СуммаРозн<>0 Тогда
				////Надо распределить по продукции...
				////
				СтруктураОтбора=Новый Структура();
				СтруктураОтбора.Вставить("Ингредиент",СтрокаСпеции.Номенклатура);
				Строки=ТаблицаИнгредиентовИтоговая.НайтиСтроки(СтруктураОтбора);
				КолвоСтрок=Строки.Количество();
				Если КолвоСтрок>0 Тогда
					Если СтрокаСпеции.СуммаРозн<0 Тогда
						ЗнакСумма=-1;
					Иначе
						ЗнакСумма=1;
					КонецЕсли;
					НРСумма=Цел(СтрокаСпеции.СуммаРозн*ЗнакСумма*100);
					Пока НРСумма>0 Цикл
						Для Каждого Строка2 Из Строки Цикл
							Если НРСумма>0 Тогда
								Строка2.СуммаИнгредиентаРозничнаяФакт=Строка2.СуммаИнгредиентаРозничнаяФакт+ЗнакСумма/100;
								НРСумма=НРСумма-1;
							КонецЕсли;
							Если НРСумма<=0 Тогда
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//ОТЛАДОЧНЫЕ СТРОКИ
		//ПоказатьТаблицу(тзСписанияИнгредиентов,"ТзСписанияИнгредиентовОсталосьНераспределенным");
		//ПоказатьТаблицу(ТаблицаИнгредиентовИтоговая,"ТаблицаИнгредиентовИтоговая");
		//-ОТЛАДОЧНЫЕ СТРОКИ
	КонецЕсли;
	
	
	////#Если Клиент Тогда
	////Состояние("Выпуск продукции и вложенный выпуск ПФ...");
	////#КонецЕсли
	////ОТЛАДКА
	////ПоказатьТаблицу(ТаблицаИнгредиентовИтоговая,"ТаблицаИнгредиентовИтоговая3");
	////-ОТЛАДКА
	////Теперь сортируем таблицу и выпускаем продукцию, начиная с вложенного выпуска максимального уровня,
	////т.к. без стоимости полуфабрикатов мы не сможем выпустить продукцию, которая, в свою очередь, также может оказаться полуфабрикатом...
	//ТаблицаИнгредиентовИтоговая.Сортировать("УровеньПродукции УБЫВ, НомерСтрокиПродукции ВОЗР, ПорядковыйНомерИнгредиента ВОЗР");
	//
	////Теперь нужно выпустить ПФ и продукцию и ПФ тут же их списать и распределить суммы...
	//ПустаяХарактеристика=Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	//ПустойКонтрагент=Справочники.Контрагенты.ПустаяСсылка();
	//ХОВложенныйВыпуск=Справочники.ХозОперации.ВложенныйВыпускПолуфабрикатов;
	//ХОСписаниеПолуфабрикатов=Справочники.ХозОперации.ПередачаПолуфабрикатовВПроизводство;
	//ХОПереоценка=Справочники.ХозОперации.ПереоценкаРозницаПоПриходу;
	////И сразу можно выпустить продукцию
	//ПредыдущаяПродукция=Неопределено;
	//НомерСтрокиПредыдущей=0;
	//УровеньПредыдущей=0;
	////Эти показатели тоже действуют для предыдущей...
	//КоличествоПродукции=0;
	//ЦенаРозничная=0;
	//СуммаРозничная=0;
	//СуммаРозничнаяПлан=0;
	//ЦенаРозничнаяПлан=0;
	//СуммаРозничнаяПланУпр=0; //Не забыть про курсовой пересчет
	//Если РозничныйСклад И ПодразделениеКомпании.ПереоценкаРозницаПоПриходу Тогда
	//	//
	//	МассивПродукции=ТаблицаИнгредиентовИтоговая.ВыгрузитьКолонку("ДляПродукции");
	//	ТаблицаОстаткиДляПереоценки=ПолучитьТаблицуОстатков(МассивПродукции,РежимПроведения,тзСписанияПродукции);
	//	//ПоказатьТаблицу(ТаблицаОстаткиДляПереоценки,"ТаблицаОстаткиДляПереоценки");
	//	
	//КонецЕсли;
	//
	////
	//Для Каждого СтрокаИнгр ИЗ ТаблицаИнгредиентовИтоговая Цикл
	//	Если РозничныйСклад Тогда
	//		//Алгоритм курсового пересчета исходит из того, что выпуск продукции всегда оформляется в регламентной валюте....
	//		//Поэтому пересчет нужен только для управленческой валюты - если нужен вообще
	//		СтрокаИнгр.СуммаПродукцииРозничная=СтрокаИнгр.ЦенаПродукцииРозничная*СтрокаИнгр.КоличествоПродукции;
	//		Если НуженКурсовойПересчет Тогда
	//			СтрокаИнгр.СуммаПродукцииРозничнаяУпр=Окр(СтрокаИнгр.СуммаПродукцииРозничная*КурсДокумента/КурсВалютыУпр,2);
	//		Иначе
	//			СтрокаИнгр.СуммаПродукцииРозничнаяУпр=СтрокаИнгр.СуммаПродукцииРозничная;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	Если НомерСтрокиПредыдущей<>СтрокаИнгр.НомерСтрокиПродукции Тогда
	//		//сначала выпустим и спишем предыдущую продукцию
	//		Если НомерСтрокиПредыдущей<>0 Тогда
	//			//Сообщить("Выпускаем продукцию "+ПредыдущаяПродукция);
	//			НоваяЗаписьОстатки=Движения.ОстаткиТоваровКомпании.Добавить();
	//			//НомерСтрокиРегистраОстатки=НомерСтрокиРегистраОстатки+1;
	//			//Системные
	//			НоваяЗаписьОстатки.ВидДвижения=ВидДвиженияНакопления.Приход;
	//			
	//			НоваяЗаписьОстатки.Период=Дата;
	//			НоваяЗаписьОстатки.Регистратор=Ссылка;
	//			//Измерения
	//			НоваяЗаписьОстатки.Номенклатура=ПредыдущаяПродукция;
	//			НоваяЗаписьОстатки.СкладКомпании=СкладКомпании;
	//			НоваяЗаписьОстатки.ХарактеристикаНоменклатуры=ПустаяХарактеристика;
	//			//Ресурсы
	//			НоваяЗаписьОстатки.Количество=КоличествоПродукции;
	//			НоваяЗаписьОстатки.Резерв=0;
	//			Если РозничныйСклад Тогда
	//				НоваяЗаписьОстатки.СуммаРозн=СуммаРозничная;
	//			КонецЕсли;
	//			
	//			//реквизиты
	//			Если УровеньПредыдущей>0 Тогда
	//				НоваяЗаписьОстатки.ХозОперация=ХОВложенныйВыпуск;
	//			Иначе
	//				НоваяЗаписьОстатки.ХозОперация=ХозОперация;
	//			КонецЕсли;
	//			НоваяЗаписьОстатки.КоличествоПереоценки=0;
	//			НоваяЗаписьОстатки.Цена=0;
	//			НоваяЗаписьОстатки.Контрагент=ПустойКонтрагент;
	//			НоваяЗаписьОстатки.СуммаСкидки=0;
	//			//
	//			Если УровеньПредыдущей=0 Тогда
	//				Если РозничныйСклад Тогда
	//					//Нужно выпустить продукцию по той цене, которая указана в ТЧ
	//					//Следовательно - нужно выполнить переоценку
	//					//Не забыть про управленческую сумму
	//					//И самое сложное - переценить текущие складские остатки
	//					СуммаПереоценки=СуммаРозничнаяПлан-СуммаРозничная;
	//					Если СуммаПереоценки<>0 Тогда
	//						НоваяЗаписьОстатки=Движения.ОстаткиТоваровКомпании.Добавить();
	//						//НомерСтрокиРегистраОстатки=НомерСтрокиРегистраОстатки+1;
	//						//Системные
	//						НоваяЗаписьОстатки.ВидДвижения=ВидДвиженияНакопления.Приход;
	//						
	//						НоваяЗаписьОстатки.Период=Дата;
	//						НоваяЗаписьОстатки.Регистратор=Ссылка;
	//						//Измерения
	//						НоваяЗаписьОстатки.Номенклатура=ПредыдущаяПродукция;
	//						НоваяЗаписьОстатки.СкладКомпании=СкладКомпании;
	//						НоваяЗаписьОстатки.ХарактеристикаНоменклатуры=ПустаяХарактеристика;
	//						//Ресурсы
	//						НоваяЗаписьОстатки.Количество=0;
	//						НоваяЗаписьОстатки.Резерв=0;
	//						НоваяЗаписьОстатки.СуммаРозн=СуммаПереоценки;
	//						//реквизиты
	//						НоваяЗаписьОстатки.ХозОперация=ХОПереоценка;
	//						НоваяЗаписьОстатки.КоличествоПереоценки=КоличествоПродукции;
	//						НоваяЗаписьОстатки.Цена=ЦенаРозничнаяПлан;
	//						НоваяЗаписьОстатки.Контрагент=ПустойКонтрагент;
	//						НоваяЗаписьОстатки.СуммаСкидки=0;
	//					КонецЕсли;
	//					Если ПодразделениеКомпании.ПереоценкаРозницаПоПриходу Тогда
	//						//Нужно учитывать, что переоценить нужно не все остатки, 
	//						//а только те, которые не были списаны данным документом
	//						//Например в строке 5 мы выпускаем продукцию, которая является полуфабрикатом или ингредиентом для продукции в строке 15
	//						//Это или дополнительный выпуск, сейчас он со склада не списывается
	//						//или вообще списание ингредиента
	//						//Следовательно, при переоценке остатка продукции 5 нужно будет уменьшить этот остаток на количество,
	//						//списанное в строке 15
	//						//Что и сделано в функции ПолучитьТаблицуОстатков
	//						СтруктураОтбора=Новый Структура;
	//						СтруктураОтбора.Вставить("Номенклатура",ПредыдущаяПродукция);
	//						СтрокиОстатков=ТаблицаОстаткиДляПереоценки.НайтиСтроки(СтруктураОтбора);
	//						Если СтрокиОстатков<>Неопределено Тогда
	//							Для Каждого СтрокаОстатка ИЗ СтрокиОстатков Цикл
	//								НоваяСтоимостьОстатка=Окр(ЦенаРозничнаяПлан*СтрокаОстатка.Количество,2);
	//								Если НуженКурсовойПересчет Тогда
	//									НоваяСтоимостьОстаткаУпр=Окр(НоваяСтоимостьОстатка*КурсДокумента/КурсВалютыУпр,2);
	//								Иначе
	//									НоваяСтоимостьОстаткаУпр=НоваяСтоимостьОстатка;
	//								КонецЕсли;
	//								//
	//								СуммаПереоценкиОстатка=НоваяСтоимостьОстатка-СтрокаОстатка.СуммаРозн;
	//								Если СуммаПереоценкиОстатка<>0 Тогда
	//									НоваяЗаписьОстатки=Движения.ОстаткиТоваровКомпании.Добавить();
	//									//НомерСтрокиРегистраОстатки=НомерСтрокиРегистраОстатки+1;
	//									//Системные
	//									НоваяЗаписьОстатки.ВидДвижения=ВидДвиженияНакопления.Приход;
	//									
	//									НоваяЗаписьОстатки.Период=Дата;
	//									НоваяЗаписьОстатки.Регистратор=Ссылка;
	//									//Измерения
	//									НоваяЗаписьОстатки.Номенклатура=ПредыдущаяПродукция;
	//									НоваяЗаписьОстатки.СкладКомпании=СкладКомпании;
	//									НоваяЗаписьОстатки.ХарактеристикаНоменклатуры=СтрокаОстатка.ХарактеристикаНоменклатуры;
	//									//Ресурсы
	//									НоваяЗаписьОстатки.Количество=0;
	//									НоваяЗаписьОстатки.Резерв=0;
	//									НоваяЗаписьОстатки.СуммаРозн=СуммаПереоценкиОстатка;
	//									//реквизиты
	//									НоваяЗаписьОстатки.ХозОперация=ХОПереоценка;
	//									НоваяЗаписьОстатки.КоличествоПереоценки=СтрокаОстатка.Количество;
	//									НоваяЗаписьОстатки.Цена=ЦенаРозничнаяПлан;
	//									НоваяЗаписьОстатки.Контрагент=ПустойКонтрагент;
	//									НоваяЗаписьОстатки.СуммаСкидки=0;
	//								КонецЕсли;
	//							КонецЦикла;
	//						КонецЕсли;
	//						
	//					КонецЕсли;
	//				КонецЕсли;
	//				
	//			Иначе
	//				//Сообщить("Списываем продукцию в прозводство "+ПредыдущаяПродукция);
	//				НоваяЗаписьОстатки=Движения.ОстаткиТоваровКомпании.Добавить();
	//				//НомерСтрокиРегистраОстатки=НомерСтрокиРегистраОстатки+1;
	//				//Системные
	//				НоваяЗаписьОстатки.ВидДвижения=ВидДвиженияНакопления.Расход;
	//				//
	//				НоваяЗаписьОстатки.Период=Дата;
	//				НоваяЗаписьОстатки.Регистратор=Ссылка;
	//				//Измерения
	//				НоваяЗаписьОстатки.Номенклатура=ПредыдущаяПродукция;
	//				НоваяЗаписьОстатки.СкладКомпании=СкладКомпании;
	//				НоваяЗаписьОстатки.ХарактеристикаНоменклатуры=ПустаяХарактеристика;
	//				//Ресурсы
	//				НоваяЗаписьОстатки.Количество=КоличествоПродукции;
	//				НоваяЗаписьОстатки.Резерв=0;
	//				Если РозничныйСклад Тогда
	//					НоваяЗаписьОстатки.СуммаРозн=СуммаРозничная;
	//				КонецЕсли;
	//				
	//				//реквизиты
	//				НоваяЗаписьОстатки.ХозОперация=ХОСписаниеПолуфабрикатов;
	//				НоваяЗаписьОстатки.КоличествоПереоценки=0;
	//				НоваяЗаписьОстатки.Цена=0;
	//				НоваяЗаписьОстатки.Контрагент=ПустойКонтрагент;
	//				НоваяЗаписьОстатки.СуммаСкидки=0;
	//				
	//				Если РозничныйСклад Тогда
	//					//
	//					//Обновляем суммы в таблице
	//					СтруктураОтбора=Новый Структура();
	//					СтруктураОтбора.Вставить("НомерСтрокиПолуфабриката",НомерСтрокиПредыдущей);
	//					СтруктураОтбора.Вставить("УровеньПолуфабриката",УровеньПредыдущей);
	//					СтруктураОтбора.Вставить("Ингредиент",ПредыдущаяПродукция);
	//					Строки=ТаблицаИнгредиентовИтоговая.НайтиСтроки(СтруктураОтбора);
	//					Если Строки.Количество()>0 Тогда
	//						Для Каждого Строка2 Из Строки Цикл
	//							Строка2.СуммаИнгредиентаРозничнаяВыпустить=СуммаРозничная;
	//						КонецЦикла;
	//					Иначе
	//					    //Хотя бы ругаемся
	//						Сообщить("Исключительная ситуация: не найдены строки для пересчета сумм выпускаемых полуфабрикатов "+ПредыдущаяПродукция,СтатусСообщения.Важное);
	//					КонецЕсли;
	//				КонецЕсли;
	//				
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//		//Теперь предыдущая становится текущей
	//		ПредыдущаяПродукция=СтрокаИнгр.ДляПродукции;
	//		НомерСтрокиПредыдущей=СтрокаИнгр.НомерСтрокиПродукции;
	//		УровеньПредыдущей=СтрокаИнгр.УровеньПродукции;
	//		//
	//		КоличествоПродукции=СтрокаИнгр.КоличествоПродукции;
	//		ЦенаРозничная=СтрокаИнгр.ЦенаПродукцииРозничная;
	//		//Обнуляем суммы
	//		СуммаРозничная=0;
	//		
	//	КонецЕсли;
	//	СуммаРозничная=СуммаРозничная+СтрокаИнгр.СуммаИнгредиентаРозничнаяФакт+СтрокаИнгр.СуммаИнгредиентаРозничнаяВыпустить;
	//	СуммаРозничнаяПлан=СтрокаИнгр.СуммаПродукцииРозничная;
	//	ЦенаРозничнаяПлан=СтрокаИнгр.ЦенаПродукцииРозничная;
	//	СуммаРозничнаяПланУпр=СтрокаИнгр.СуммаПродукцииРозничнаяУпр;
	//	
	//КонецЦикла;
	////Последний выпуск
	//Если НомерСтрокиПредыдущей<>0 Тогда
	//	//Последняя строка не может быть вложенным выпуском...
	//	//Сообщить("Выпускаем продукцию "+ПредыдущаяПродукция);
	//	НоваяЗаписьОстатки=Движения.ОстаткиТоваровКомпании.Добавить();
	//	//НомерСтрокиРегистраОстатки=НомерСтрокиРегистраОстатки+1;
	//	//Системные
	//	НоваяЗаписьОстатки.ВидДвижения=ВидДвиженияНакопления.Приход;
	//	
	//	НоваяЗаписьОстатки.Период=Дата;
	//	НоваяЗаписьОстатки.Регистратор=Ссылка;
	//	//Измерения
	//	НоваяЗаписьОстатки.Номенклатура=ПредыдущаяПродукция;
	//	НоваяЗаписьОстатки.СкладКомпании=СкладКомпании;
	//	НоваяЗаписьОстатки.ХарактеристикаНоменклатуры=ПустаяХарактеристика;
	//	//Ресурсы
	//	НоваяЗаписьОстатки.Количество=КоличествоПродукции;
	//	НоваяЗаписьОстатки.Резерв=0;
	//	Если РозничныйСклад Тогда
	//		НоваяЗаписьОстатки.СуммаРозн=СуммаРозничная;
	//	КонецЕсли;
	//	//реквизиты
	//	НоваяЗаписьОстатки.ХозОперация=ХозОперация;
	//	НоваяЗаписьОстатки.КоличествоПереоценки=0;
	//	НоваяЗаписьОстатки.Цена=0;
	//	НоваяЗаписьОстатки.Контрагент=ПустойКонтрагент;
	//	НоваяЗаписьОстатки.СуммаСкидки=0;
	//	//
	//	Если РозничныйСклад Тогда
	//		//Нужно выпустить продукцию по той цене, которая указана в ТЧ
	//		//Следовательно - нужно выполнить переоценку
	//		//Не забыть про управленческую сумму
	//		СуммаПереоценки=СуммаРозничнаяПлан-СуммаРозничная;
	//		Если СуммаПереоценки<>0 Тогда
	//			НоваяЗаписьОстатки=Движения.ОстаткиТоваровКомпании.Добавить();
	//			//НомерСтрокиРегистраОстатки=НомерСтрокиРегистраОстатки+1;
	//			//Системные
	//			НоваяЗаписьОстатки.ВидДвижения=ВидДвиженияНакопления.Приход;
	//			
	//			НоваяЗаписьОстатки.Период=Дата;
	//			НоваяЗаписьОстатки.Регистратор=Ссылка;
	//			//Измерения
	//			НоваяЗаписьОстатки.Номенклатура=ПредыдущаяПродукция;
	//			НоваяЗаписьОстатки.СкладКомпании=СкладКомпании;
	//			НоваяЗаписьОстатки.ХарактеристикаНоменклатуры=ПустаяХарактеристика;
	//			//Ресурсы
	//			НоваяЗаписьОстатки.Количество=0;
	//			НоваяЗаписьОстатки.Резерв=0;
	//			НоваяЗаписьОстатки.СуммаРозн=СуммаПереоценки;
	//			//реквизиты
	//			НоваяЗаписьОстатки.ХозОперация=ХОПереоценка;
	//			НоваяЗаписьОстатки.КоличествоПереоценки=КоличествоПродукции;
	//			НоваяЗаписьОстатки.Цена=ЦенаРозничнаяПлан;
	//			НоваяЗаписьОстатки.Контрагент=ПустойКонтрагент;
	//			НоваяЗаписьОстатки.СуммаСкидки=0;
	//		КонецЕсли;
	//		Если ПодразделениеКомпании.ПереоценкаРозницаПоПриходу Тогда
	//			//Нужно учитывать, что переоценить нужно не все остатки, 
	//			//а только те, которые не были списаны данным документом
	//			//Например в строке 5 мы выпускаем продукцию, которая является полуфабрикатом или ингредиентом для продукции в строке 15
	//			//Это или дополнительный выпуск, сейчас он со склада не списывается
	//			//или вообще списание ингредиента
	//			//Следовательно, при переоценке остатка продукции 5 нужно будет уменьшить этот остаток на количество,
	//			//списанное в строке 15
	//			//Что и сделано в функции ПолучитьТаблицуОстатков
	//			СтруктураОтбора=Новый Структура;
	//			СтруктураОтбора.Вставить("Номенклатура",ПредыдущаяПродукция);
	//			СтрокиОстатков=ТаблицаОстаткиДляПереоценки.НайтиСтроки(СтруктураОтбора);
	//			Если СтрокиОстатков<>Неопределено Тогда
	//				Для Каждого СтрокаОстатка ИЗ СтрокиОстатков Цикл
	//					НоваяСтоимостьОстатка=Окр(ЦенаРозничнаяПлан*СтрокаОстатка.Количество,2);
	//					Если НуженКурсовойПересчет Тогда
	//						НоваяСтоимостьОстаткаУпр=Окр(НоваяСтоимостьОстатка*КурсДокумента/КурсВалютыУпр,2);
	//					Иначе
	//						НоваяСтоимостьОстаткаУпр=НоваяСтоимостьОстатка;
	//					КонецЕсли;
	//					//
	//					СуммаПереоценкиОстатка=НоваяСтоимостьОстатка-СтрокаОстатка.СуммаРозн;
	//					Если СуммаПереоценкиОстатка<>0 Тогда
	//						НоваяЗаписьОстатки=Движения.ОстаткиТоваровКомпании.Добавить();
	//						//НомерСтрокиРегистраОстатки=НомерСтрокиРегистраОстатки+1;
	//						//Системные
	//						НоваяЗаписьОстатки.ВидДвижения=ВидДвиженияНакопления.Приход;
	//						
	//						НоваяЗаписьОстатки.Период=Дата;
	//						НоваяЗаписьОстатки.Регистратор=Ссылка;
	//						//Измерения
	//						НоваяЗаписьОстатки.Номенклатура=ПредыдущаяПродукция;
	//						НоваяЗаписьОстатки.СкладКомпании=СкладКомпании;
	//						НоваяЗаписьОстатки.ХарактеристикаНоменклатуры=СтрокаОстатка.ХарактеристикаНоменклатуры;
	//						//Ресурсы
	//						НоваяЗаписьОстатки.Количество=0;
	//						НоваяЗаписьОстатки.Резерв=0;
	//						НоваяЗаписьОстатки.СуммаРозн=СуммаПереоценкиОстатка;
	//						//реквизиты
	//						НоваяЗаписьОстатки.ХозОперация=ХОПереоценка;
	//						НоваяЗаписьОстатки.КоличествоПереоценки=СтрокаОстатка.Количество;
	//						НоваяЗаписьОстатки.Цена=ЦенаРозничнаяПлан;
	//						НоваяЗаписьОстатки.Контрагент=ПустойКонтрагент;
	//						НоваяЗаписьОстатки.СуммаСкидки=0;
	//					КонецЕсли;
	//				КонецЦикла;
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//////ОТЛАДОЧНЫЕ СТРОКИ
	////ПоказатьТаблицу(ТаблицаИнгредиентовИтоговая,"тзИнгредиенты");
	//////-ОТЛАДОЧНЫЕ СТРОКИ
	
	// Проведем остатки товаров
	НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	НаборЗаписейОстатки.РежимПроведения=РежимПроведения;
	НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	РезультатЗапросаПоТоварам = Продукция.Выгрузить();
	РезультатЗапросаПоТоварам.Колонки.Добавить("ХарактеристикаНоменклатуры");
	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам;
	НаборЗаписейОстатки.СкладКомпании=СкладКомпании;
	НаборЗаписейОстатки.Приходовать=Истина;
	НаборЗаписейОстатки.ДвиженияПоРознице=СкладКомпании.Розничный;
	Отказ=НЕ НаборЗаписейОстатки.Приход() ИЛИ Отказ;
	
	//Рушим временные таблицы
	МенеджерВР=Неопределено;
	//ОТЛАДОЧНЫЕ СТРОКИ
	//ПоказатьТаблицу(ТаблицаИнгредиентовДляСписания,"ТаблицаИнгредиентовДляСписания");
	//ПоказатьТаблицу(ТаблицаОстаткиИнгредиентов,"тзОстатки2");
	//Если ЗаменятьИнгредиентыАналогами Тогда
	//	ПоказатьТаблицу(ТаблицаОстаткиАналогов,"ТаблицаОстаткиАналогов2");
	//	ПоказатьТаблицу(ТаблицаАналогов,"ТаблицаАналогов2");
	//КонецЕсли;
	//Ответ=Вопрос("Прекратить выполнение операции?",РежимДиалогаВопрос.ДаНет,обПраво("ТаймаутДиалогов"),КодВозвратаДиалога.Нет);
	//Если Ответ=КодВозвратаДиалога.Да Тогда
	//	Отказ=Истина;
	//КонецЕсли;
	//-ОТЛАДОЧНЫЕ СТРОКИ
	
	Если Отказ Тогда
		// выведем сообщения об ошибках и предупреждениях
		//дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
		Возврат;
	КонецЕсли;
	//Дальше проверок не должно быть, только в партиях.
	//Но партии - это совсем другая история, поэтому проверяются отдельно....
	//
	// проведем партии товаров 
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//#Если Клиент Тогда
	//Состояние("Проведение по партиям...");
	//#КонецЕсли
	ТаблицаИнгредиентовИтоговая.ЗаполнитьЗначения(СкладКомпании,"СкладКомпании");
	
	Отказ = НЕ ПровестиПоПартиям(РежимПроведения, Ссылка, ТаблицаИнгредиентовИтоговая) ИЛИ Отказ;
	
	Если Отказ Тогда
		// выведем сообщения об ошибках и предупреждениях
		//дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
		Возврат;
	Иначе
		//#Если Клиент Тогда
		//Состояние("Установка новых розничных цен...");	
		//#КонецЕсли
		Если РозничныйСклад и итРегистрироватьРозничныеЦеныПриВыпускенаРозничномСкладе Тогда
			
			//Провести по регистру цены
			Запрос=Новый Запрос("ВЫБРАТЬ
			|	Продукция.Номенклатура.Код КАК Код,
			|	Продукция.Номенклатура КАК Номенклатура,
			|	МАКСИМУМ(Продукция.ЦенаРозничная) КАК НоваяЦена,
			|	МАКСИМУМ(ЦеныСрезПоследних.Цена) КАК ЦенаВбазе,
			|	МАКСИМУМ(Продукция.НомерСтроки) КАК НомерСтрокиПродукции
			|ИЗ
			|	Документ.ОтчетПроизводстваЗаСмену.Продукция КАК Продукция
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	РегистрСведений.Цены.СрезПоследних(
			|				&НаМоментДокумента,
			|				Номенклатура В (&Номенклатура)
			|					И ТипЦен = &ТипЦен
			|					И ПодразделениеКомпании = &ПодразделениеКомпании
			|					И ДоговорВзаиморасчетов = &ПустойДоговор
			|					И Контрагент = &ПустойКонтрагент) КАК ЦеныСрезПоследних
			|ПО
			|	Продукция.Номенклатура = ЦеныСрезПоследних.Номенклатура
			|ГДЕ
			|	Продукция.Ссылка = &ДокументСсылка
			|	И Продукция.ЦенаРозничная > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	Продукция.Номенклатура.Код,
			|	Продукция.Номенклатура
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтрокиПродукции,
			|	Номенклатура");
			Запрос.УстановитьПараметр("ДокументСсылка",        Ссылка);
			Запрос.УстановитьПараметр("НаМоментДокумента",     МоментВремени());
			Запрос.УстановитьПараметр("ТипЦен",                СкладКомпании.ТипЦенРозничнойТорговли);
			Запрос.УстановитьПараметр("Номенклатура",          Продукция.ВыгрузитьКолонку("Номенклатура"));
			Запрос.УстановитьПараметр("ПодразделениеКомпании", СкладКомпании.ПодразделениеКомпании);
			Запрос.УстановитьПараметр("ПустойКонтрагент",      Справочники.Контрагенты.ПустаяСсылка());
			Запрос.УстановитьПараметр("ПустойДоговор",         Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка());
			
			ЗначенияБлокировки = Новый Соответствие;
			ЗначенияБлокировки.Вставить("Период",     Новый Диапазон(, Дата));
			ЗначенияБлокировки.Вставить("ТипЦен",     СкладКомпании.ТипЦенРозничнойТорговли);
			ЗначенияБлокировки.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
			
			СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы,ИмяТаблицы", "РегистрСведений", "Цены");
			СтруктураПараметровБлокировки.Вставить("ИсточникДанных", Продукция);
			
			ОписаниеИсточника = Новый Соответствие;
			ОписаниеИсточника.Вставить("Номенклатура", "Номенклатура");
			
			ОбработкаСобытийДокументаСервер.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки, ОписаниеИсточника);
			
			РезультатЗапросаПоТоварам=Запрос.Выполнить();
			// устанавливаем цену продукции
			НаборЗаписейЦены = Движения.Цены;
			НаборЗаписейЦены.ДокументОбъект            = ЭтотОбъект;
			НаборЗаписейЦены.Контрагент                = Неопределено;
			НаборЗаписейЦены.ТипЦен                    = СкладКомпании.ТипЦенРозничнойТорговли;
			НаборЗаписейЦены.ПодразделениеКомпании     = СкладКомпании.ПодразделениеКомпании;
			//НаборЗаписейЦены.ИмяРеквизитаЦена="ЦенаРозничная";
			НаборЗаписейЦены.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
			//НаборЗаписейЦены.НеУстанавливатьЦентрализованные=Ложь;
			НаборЗаписейЦены.ПроверятьОдинаковыеЦены   = Ложь;
			НаборЗаписейЦены.УстанавливатьЦеныУслуг    = Ложь;
			Отказ=НЕ НаборЗаписейЦены.УстановитьЦены();
			Если Отказ Тогда
				// выведем сообщения об ошибках и предупреждениях
				//дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
//	
//	// выведем сообщения об ошибках и предупреждениях
//	дкВыводРезультатовОбработки(ЭтотОбъект, Отказ);
//КонецПроцедуры // ОбработкаПроведения
	
КонецПроцедуры // ОбработкаПроведения()

#КонецЕсли
