#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// В процедуре нужно заполнить таблицу продаж по переданным параметрам для отчета "Обработанные чеки ЕГАИС".
//
// Параметры:
//  ТаблицаПродаж - ТаблицаЗначений - таблица, которую требуется заполнить. Колонки:
//   * Период - Дата
//   * ОрганизацияЕГАИС - СправочникСсылка.КлассификаторОрганизацийЕГАИС
//   * АлкогольнаяПродукция - СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС
//   * ЧековПродаж - Число
//   * ЧековНаВозврат - Число
Процедура ЗаполнитьКоличествоЧековПродаж(ТаблицаПродаж) Экспорт
	
	//++ НЕ ГОСИС
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаПродаж", ТаблицаПродаж);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПродаж.Период КАК Период,
	|	ВЫРАЗИТЬ(ТаблицаПродаж.ОрганизацияЕГАИС КАК Справочник.КлассификаторОрганизацийЕГАИС) КАК ОрганизацияЕГАИС,
	|	ВЫРАЗИТЬ(ТаблицаПродаж.АлкогольнаяПродукция КАК Справочник.КлассификаторАлкогольнойПродукцииЕГАИС) КАК АлкогольнаяПродукция
	|ПОМЕСТИТЬ ВТ_ТаблицаПродаж
	|ИЗ
	|	&ТаблицаПродаж КАК ТаблицаПродаж
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПродаж.Период КАК Период,
	|	ТаблицаПродаж.ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	ТаблицаПродаж.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ТаблицаПродаж.ОрганизацияЕГАИС.Контрагент КАК Организация,
	|	ТаблицаПродаж.ОрганизацияЕГАИС.ТорговыйОбъект КАК Склад
	|ПОМЕСТИТЬ ТаблицаПродаж
	|ИЗ
	|	ВТ_ТаблицаПродаж КАК ТаблицаПродаж
	|ГДЕ
	|	ТаблицаПродаж.ОрганизацияЕГАИС.Сопоставлено
	|	И ТаблицаПродаж.ОрганизацияЕГАИС.СоответствуетОрганизации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Склад,
	|	АлкогольнаяПродукция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЧекККМ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СписокЧековПродаж
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕГАИСПрисоединенныеФайлы КАК ЕГАИСПрисоединенныеФайлы
	|		ПО ЕГАИСПрисоединенныеФайлы.Документ = ЧекККМ.Ссылка
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ЧекККМ.Дата, МЕСЯЦ) В
	|			(ВЫБРАТЬ
	|				ТаблицаПродаж.Период
	|			ИЗ
	|				ТаблицаПродаж КАК ТаблицаПродаж)
	|	И ЧекККМ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|	И НЕ ЕГАИСПрисоединенныеФайлы.Ссылка ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПродаж.Период КАК Период,
	|	ТаблицаПродаж.ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	ТаблицаПродаж.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЧекККМТовары.Ссылка) КАК ЧековПродаж
	|ПОМЕСТИТЬ Продажи
	|ИЗ
	|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПродаж КАК ТаблицаПродаж
	|		ПО ЧекККМТовары.Ссылка.Организация = ТаблицаПродаж.Организация
	|			И ЧекККМТовары.Ссылка.Склад = ТаблицаПродаж.Склад
	|			И ЧекККМТовары.НоменклатураЕГАИС = ТаблицаПродаж.АлкогольнаяПродукция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокЧековПродаж КАК СписокЧековПродаж
	|		ПО ЧекККМТовары.Ссылка = СписокЧековПродаж.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродаж.Период,
	|	ТаблицаПродаж.ОрганизацияЕГАИС,
	|	ТаблицаПродаж.АлкогольнаяПродукция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЧекККМВозврат.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СписокЧековНаВозврат
	|ИЗ
	|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕГАИСПрисоединенныеФайлы КАК ЕГАИСПрисоединенныеФайлы
	|		ПО ЕГАИСПрисоединенныеФайлы.Документ = ЧекККМВозврат.Ссылка
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ЧекККМВозврат.Дата, МЕСЯЦ) В
	|			(ВЫБРАТЬ
	|				ТаблицаПродаж.Период
	|			ИЗ
	|				ТаблицаПродаж КАК ТаблицаПродаж)
	|	И ЧекККМВозврат.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|	И НЕ ЕГАИСПрисоединенныеФайлы.Ссылка ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПродаж.Период КАК Период,
	|	ТаблицаПродаж.ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	ТаблицаПродаж.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЧекККМВозвратТовары.Ссылка) КАК ЧековНаВозврат
	|ПОМЕСТИТЬ Возвраты
	|ИЗ
	|	Документ.ЧекККМВозврат.Товары КАК ЧекККМВозвратТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПродаж КАК ТаблицаПродаж
	|		ПО ЧекККМВозвратТовары.Ссылка.Организация = ТаблицаПродаж.Организация
	|			И ЧекККМВозвратТовары.Ссылка.Склад = ТаблицаПродаж.Склад
	|			И ЧекККМВозвратТовары.НоменклатураЕГАИС = ТаблицаПродаж.АлкогольнаяПродукция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокЧековНаВозврат КАК СписокЧековНаВозврат
	|		ПО ЧекККМВозвратТовары.Ссылка = СписокЧековНаВозврат.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродаж.Период,
	|	ТаблицаПродаж.ОрганизацияЕГАИС,
	|	ТаблицаПродаж.АлкогольнаяПродукция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период КАК Период,
	|	ВложенныйЗапрос.ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	ВложенныйЗапрос.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	СУММА(ВложенныйЗапрос.ЧековПродаж) КАК ЧековПродаж,
	|	СУММА(ВложенныйЗапрос.ЧековНаВозврат) КАК ЧековНаВозврат
	|ИЗ
	|	(ВЫБРАТЬ
	|		Продажи.Период КАК Период,
	|		Продажи.ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|		Продажи.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|		Продажи.ЧековПродаж КАК ЧековПродаж,
	|		0 КАК ЧековНаВозврат
	|	ИЗ
	|		Продажи КАК Продажи
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Возвраты.Период,
	|		Возвраты.ОрганизацияЕГАИС,
	|		Возвраты.АлкогольнаяПродукция,
	|		0,
	|		Возвраты.ЧековНаВозврат
	|	ИЗ
	|		Возвраты КАК Возвраты) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.ОрганизацияЕГАИС,
	|	ВложенныйЗапрос.АлкогольнаяПродукция";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Период", Выборка.Период);
		ПараметрыОтбора.Вставить("ОрганизацияЕГАИС", Выборка.ОрганизацияЕГАИС);
		ПараметрыОтбора.Вставить("АлкогольнаяПродукция", Выборка.АлкогольнаяПродукция);
		
		МассивСтрок = ТаблицаПродаж.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
		КонецЦикла;
	КонецЦикла;
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Возвращает внешний набор данных для построения отчета.
//
// Параметры:
//  СписокОтчетов - Массив - массив документов ОтчетЕГАИС.
//
// Возвращаемое значение:
//  ТаблицаЗначений - внешний набор данных.
//
Функция ДанныеИнформационнойБазы(СписокОтчетов) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ОрганизацияЕГАИС"    , Новый ОписаниеТипов("СправочникСсылка.КлассификаторОрганизацийЕГАИС"));
	Результат.Колонки.Добавить("АлкогольнаяПродукция", Новый ОписаниеТипов("СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС"));
	Результат.Колонки.Добавить("Период"              , Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ЧековПродаж"         , Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ЧековНаВозврат"      , Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОтчетЕГАИС", СписокОтчетов);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетЕГАИС.ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	ОтчетЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	НАЧАЛОПЕРИОДА(ОтчетЕГАИС.Период, МЕСЯЦ) КАК Период
	|ИЗ
	|	Документ.ОтчетЕГАИС КАК ОтчетЕГАИС
	|ГДЕ
	|	ОтчетЕГАИС.Ссылка В(&ОтчетЕГАИС)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
	КонецЦикла;
	
	ЗаполнитьКоличествоЧековПродаж(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли