#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Процедура обработки печати.
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_МХ1") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_МХ1",
															НСтр("ru = 'МХ-1 (Акт о приеме-передачи ТМЦ)'"),
															ПечатьМХ1Общая(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_МХ3") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_МХ3",
															НСтр("ru = 'МХ-3 (Акт о возврате ТМЦ)'"),
															ПечатьМХ3Общая(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;													
КонецПроцедуры

Функция ПечатьМХ1Общая(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_МХ1Общая";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	
	ПервыйДокумент = Истина; 
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ФорматВыводаСуммы      = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		ФорматВыводаКоличества = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Документ);
				
		// Зададим параметры макета
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		// Получим данные из документа
		ДанныеДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ).ПолучитьДанныеДляПечатиМХ1(Документ);
		Если ЗначениеЗаполнено(ДанныеДокумента) Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьМХ.ПФ_MXL_МХ1");
			ОбластьЗаголовок        = Макет.ПолучитьОбласть("Заголовок");
			ОбластьЗаголовокТаблицы	= Макет.ПолучитьОбласть("Шапка");
			ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
			ОбластьИтого			= Макет.ПолучитьОбласть("Итого");
			ОбластьПодвал	        = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьЗаголовок.Параметры.Заполнить(ДанныеДокумента);
			
			СтруктураПредставления = Новый Структура;
			СтруктураПредставления.Вставить("Наименование",     "");
			СтруктураПредставления.Вставить("ИНН",              "ИНН ");
			СтруктураПредставления.Вставить("КПП",              "КПП ");
			СтруктураПредставления.Вставить("АдресЮридический", "");
			СтруктураПредставления.Вставить("ТелефонРабочий",   "тел.: ");
			
			// Дата документа
			ДатаДокумента = Документ.Дата;
			ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
			
			ОбластьЗаголовок.Параметры.ПредставлениеОрганизации = 
			УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Организация, СтруктураПредставления,,,ДатаДокумента,ДополнительныеПараметры);
			
			ОбластьЗаголовок.Параметры.НомерДокумента                   = ДанныеДокумента.Номер;
			ОбластьЗаголовок.Параметры.ДатаДокумента                    = ДанныеДокумента.Дата;
			ОбластьЗаголовок.Параметры.ОрганизацияПоОКПО                = ДанныеДокумента.Организация.КодПоОКПО;
			ОбластьЗаголовок.Параметры.ОрганизацияВидДеятельностиПоОКДП = ДанныеДокумента.Организация.КодПоОКДП;
			ОбластьЗаголовок.Параметры.ПредставлениеАдресаХранителя     = ДанныеДокумента.СкладКомпании;
			
			// Подразделение полное наименование
			ОбластьЗаголовок.Параметры.ПодразделениеКомпании = 
			УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(ОбластьЗаголовок.Параметры.ПодразделениеКомпании);

			
			Если ЗначениеЗаполнено(ДанныеДокумента.ПодразделениеКомпании) 
				И ЗначениеЗаполнено(ДанныеДокумента.ПодразделениеКомпании.КПП) Тогда
				СтрокаПредставления = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Организация, СтруктураПредставления,,,ДатаДокумента,ДополнительныеПараметры);
				ОбластьЗаголовок.Параметры.ПредставлениеОрганизации = СтрЗаменить(СтрокаПредставления, ДанныеДокумента.Организация.КПП, ДанныеДокумента.ПодразделениеКомпании.КПП);
			Иначе	
				ОбластьЗаголовок.Параметры.ПредставлениеОрганизации	= УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Организация,СтруктураПредставления,,,ДатаДокумента,ДополнительныеПараметры);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеДокумента.ВладелецТовара) Тогда
				ОбластьЗаголовок.Параметры.ПредставлениеВладельца = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ДанныеДокумента.ВладелецТовара);
				Если Тип("СправочникСсылка.СкладыКомпании") = ТипЗнч(ДанныеДокумента.ВладелецТовара) Тогда
					ОбластьЗаголовок.Параметры.ВладелецПоОКПО = ДанныеДокумента.ВладелецТовара.Организация.КодПоОКПО;
				Иначе
					ОбластьЗаголовок.Параметры.ВладелецПоОКПО = ДанныеДокумента.ВладелецТовара.КодПоОКПО;
				КонецЕсли;
			КонецЕсли;

			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);  
			
			ВыборкаСтрок = ДанныеДокумента.Товары;
			НомерСтроки = 1;
			
			Для Каждого СтрокаТоваров Из ВыборкаСтрок Цикл
				ОбластьСтрока.Параметры.НомерСтроки  = НомерСтроки;
				ОбластьСтрока.Параметры.Номенклатура = Строка(СтрокаТоваров.Номенклатура);
				Если Тип("СправочникСсылка.Номенклатура") = ТипЗнч(СтрокаТоваров.Номенклатура) Тогда
					ОбластьСтрока.Параметры.Код              = СтрокаТоваров.Номенклатура.Артикул;
					ОбластьСтрока.Параметры.Характеристика 	 = СтрокаТоваров.ХарактеристикаНоменклатуры;
					ОбластьСтрока.Параметры.ЕдиницаИзмерения = СтрокаТоваров.ЕдиницаИзмерения;
					ОбластьСтрока.Параметры.КодОКЕИ          = СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
				КонецЕсли;
				ОбластьСтрока.Параметры.Цена = ?(СтрокаТоваров.Цена = 0,"",СтрокаТоваров.Цена);
				ОбластьСтрока.Параметры.Стоимость = ?(СтрокаТоваров.Сумма = 0,"",СтрокаТоваров.Сумма);
				ОбластьСтрока.Параметры.Количество =  Формат(СтрокаТоваров.Количество,ФорматВыводаКоличества);
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
			ОбластьИтого.Параметры.Количество = Формат(ВыборкаСтрок.Итог("Количество"),ФорматВыводаКоличества);
			ОбластьИтого.Параметры.ИтогЦена = ?(ВыборкаСтрок.Итог("Сумма")=0,"",ВыборкаСтрок.Итог("Сумма"));
			ОбластьИтого.Параметры.ИтогСтоимость = ?(ВыборкаСтрок.Итог("Сумма")=0,"",ВыборкаСтрок.Итог("Сумма"));
			ТабличныйДокумент.Вывести(ОбластьИтого);
			
			ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.Отпустил);
			ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.Получил);
			ТабличныйДокумент.Вывести(ОбластьПодвал);
		КонецЕсли;
		
		// Отметим конец области документа
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
		КонецЦикла;
	
	Возврат ТабличныйДокумент;	
КонецФункции

Функция ПечатьМХ3Общая(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_МХ3Общая";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	
	ПервыйДокумент = Истина; 
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ФорматВыводаСуммы      = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		ФорматВыводаКоличества = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Документ);
				
		// Зададим параметры макета
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		// Получим данные из документа
		ДанныеДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ).ПолучитьДанныеДляПечатиМХ3(Документ);
		Если ЗначениеЗаполнено(ДанныеДокумента) Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьМХ.ПФ_MXL_МХ3");
			
			ОбластьЗаголовок        = Макет.ПолучитьОбласть("Заголовок");
			ОбластьЗаголовокТаблицы	= Макет.ПолучитьОбласть("Шапка");
			ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
			ОбластьИтого			= Макет.ПолучитьОбласть("Итого");
			ОбластьПодвал	        = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьЗаголовок.Параметры.Заполнить(ДанныеДокумента);

			СтруктураПредставления = Новый Структура;
			СтруктураПредставления.Вставить("Наименование",     "");
			СтруктураПредставления.Вставить("ИНН",              "ИНН ");
			СтруктураПредставления.Вставить("КПП",              "КПП ");
			СтруктураПредставления.Вставить("АдресЮридический", "");
			СтруктураПредставления.Вставить("ТелефонРабочий",   "тел.: ");
			// Дата документа
			ДатаДокумента = Документ.Дата;
			ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
			
			ОбластьЗаголовок.Параметры.ПредставлениеОрганизации = 
			УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Организация, СтруктураПредставления,,,ДатаДокумента,ДополнительныеПараметры);
			
			ОбластьЗаголовок.Параметры.НомерДокумента                   = ДанныеДокумента.Номер;
			ОбластьЗаголовок.Параметры.ДатаДокумента                    = ДанныеДокумента.Дата;
			ОбластьЗаголовок.Параметры.ОрганизацияПоОКПО                = ДанныеДокумента.Организация.КодПоОКПО;
			ОбластьЗаголовок.Параметры.ОрганизацияВидДеятельностиПоОКДП = ДанныеДокумента.Организация.КодПоОКДП;
					
			Если ЗначениеЗаполнено(ДанныеДокумента.ПодразделениеКомпании) 
				И ЗначениеЗаполнено(ДанныеДокумента.ПодразделениеКомпании.КПП) Тогда
				
				СтрокаПредставления = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Организация, СтруктураПредставления,,,ДатаДокумента,ДополнительныеПараметры);
				ОбластьЗаголовок.Параметры.ПредставлениеОрганизации = СтрЗаменить(СтрокаПредставления, ДанныеДокумента.Организация.КПП, ДанныеДокумента.ПодразделениеКомпании.КПП);
			Иначе	
				ОбластьЗаголовок.Параметры.ПредставлениеОрганизации	= УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Организация,СтруктураПредставления,,,ДатаДокумента,ДополнительныеПараметры);
			КонецЕсли;
			
			// Подразделение полное наименование.
			ОбластьЗаголовок.Параметры.ПодразделениеКомпании = 
			УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(ОбластьЗаголовок.Параметры.ПодразделениеКомпании);
			
			Если ЗначениеЗаполнено(ДанныеДокумента.ВладелецТовара) Тогда
				ОбластьЗаголовок.Параметры.ПредставлениеВладельца = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ДанныеДокумента.ВладелецТовара);
				Если Тип("СправочникСсылка.СкладыКомпании") = ТипЗнч(ДанныеДокумента.ВладелецТовара) Тогда
					ОбластьЗаголовок.Параметры.ВладелецПоОКПО = ДанныеДокумента.ВладелецТовара.Организация.КодПоОКПО;
				Иначе
					ОбластьЗаголовок.Параметры.ВладелецПоОКПО = ДанныеДокумента.ВладелецТовара.КодПоОКПО;
				КонецЕсли;
			КонецЕсли;

			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);  
			
			ВыборкаСтрок = ДанныеДокумента.Товары;
			НомерСтроки = 1;
			
			ЕстьЦена = НЕ (ВыборкаСтрок.Колонки.Найти("Цена") = Неопределено);
			ЕстьСуммаВсего = НЕ (ВыборкаСтрок.Колонки.Найти("СуммаВсего") = Неопределено);
			
			Для Каждого СтрокаТоваров Из ВыборкаСтрок Цикл
				ОбластьСтрока.Параметры.НомерСтроки  = НомерСтроки;
				ОбластьСтрока.Параметры.Номенклатура = Строка(СтрокаТоваров.Номенклатура);
				Если Тип("СправочникСсылка.Номенклатура") = ТипЗнч(СтрокаТоваров.Номенклатура) Тогда
					ОбластьСтрока.Параметры.Код 			 = СтрокаТоваров.Номенклатура.Артикул;
					ОбластьСтрока.Параметры.Характеристика 	 = СтрокаТоваров.ХарактеристикаНоменклатуры;
					ОбластьСтрока.Параметры.ЕдиницаИзмерения = СтрокаТоваров.ЕдиницаИзмерения;
					ОбластьСтрока.Параметры.КодОКЕИ          = СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
				КонецЕсли;
				ОбластьСтрока.Параметры.Количество =  Формат(СтрокаТоваров.Количество,ФорматВыводаКоличества);
				ОбластьСтрока.Параметры.Цена       =  ?(ЕстьЦена, Формат(СтрокаТоваров.Цена,ФорматВыводаСуммы), "");
				ОбластьСтрока.Параметры.СуммаВсего =  ?(ЕстьСуммаВсего, Формат(СтрокаТоваров.СуммаВсего,ФорматВыводаСуммы), "");
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
			ОбластьИтого.Параметры.Количество = Формат(ВыборкаСтрок.Итог("Количество"),ФорматВыводаКоличества);
			ОбластьИтого.Параметры.Цена       = ?(ЕстьЦена, Формат(ВыборкаСтрок.Итог("Цена"),ФорматВыводаСуммы), "");
			ОбластьИтого.Параметры.СуммаВсего = ?(ЕстьСуммаВсего, Формат(ВыборкаСтрок.Итог("СуммаВсего"),ФорматВыводаСуммы), "");
			ТабличныйДокумент.Вывести(ОбластьИтого);
			
			ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.Отпустил);
			ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.Получил);
			ТабличныйДокумент.Вывести(ОбластьПодвал);
		КонецЕсли;
			
			// Отметим конец области документа
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
		КонецЦикла;
	
	Возврат ТабличныйДокумент;	
КонецФункции

#КонецЕсли