// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область КонтрактМенеджераДействийЭДО

// Параметры:
//  МенеджерыДействийЭДО - Соответствие из КлючИЗначение:
//  * Ключ - Строка - идентификатор интеграции ЭДО.
//  * Значение - ОбщийМодуль
Процедура ПриОпределенииМенеджеровДействийЭДО(МенеджерыДействийЭДО) Экспорт
	
	ИспользоватьИнтеграциюЦентраЭДО =
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиентПовтИсп.ИспользоватьИнтеграциюЦентраЭДО();
	
	Если ИспользоватьИнтеграциюЦентраЭДО Тогда
		МенеджерыДействийЭДО.Вставить(
			ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиентСервер.ИдентификаторМенеджераДействийЭДО(),
			ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиент);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения - результат: см. ЭлектронныеДокументыЭДОКлиент.НовыйРезультатОбработкиДействийИнтеграцииЭДО
//  РезультатВыполненияДействий - см. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.РезультатВыполненияДействийЭДОДляКлиента
//  СостояниеВыполненияДействий - см. НовоеСостояниеВыполненияДействийЭДО
//  ИсходныйНаборДействийЭДО - см. ИнтерфейсДокументовЭДОКлиентСервер.НовыйНаборДействийПоЭДО
//  ПаролиСертификатов - см. КриптографияБЭДКлиент.НовыеПаролиСертификатов
Процедура ОбработатьРезультатВыполненияДействийЭДО(ОповещениеОЗавершении, РезультатВыполненияДействий, СостояниеВыполненияДействий, ИсходныйНаборДействийЭДО, ПаролиСертификатов) Экспорт
	
	КонтекстОбработки = НовыйКонтекстОбработкиРезультатаВыполненияДействийЭДО();
	КонтекстОбработки.ОповещениеОЗавершении = ОповещениеОЗавершении;
	КонтекстОбработки.АсинхронныеОперации = РезультатВыполненияДействий.АсинхронныеОперации;
	КонтекстОбработки.РезультатыДействий = РезультатВыполненияДействий.РезультатыДействий;
	КонтекстОбработки.ИсходныйНаборДействийЭДО = ИсходныйНаборДействийЭДО;
	КонтекстОбработки.КонтекстДиагностики = РезультатВыполненияДействий.КонтекстДиагностики;
	КонтекстОбработки.ПаролиСертификатов = ПаролиСертификатов;
	
	Если ЗначениеЗаполнено(СостояниеВыполненияДействий) Тогда
		КонтекстОбработки.СостояниеВыполненияДействий = СостояниеВыполненияДействий;
	Иначе
		КонтекстОбработки.СостояниеВыполненияДействий = НовоеСостояниеВыполненияДействийЭДО();
	КонецЕсли;
	
	АсинхронныеОперации = КонтекстОбработки.АсинхронныеОперации;
	
	Если Не ЗначениеЗаполнено(АсинхронныеОперации) Тогда
		
		ОбработатьРезультатВыполненияДействийЭДОПослеОжиданияДействийЭДО(Новый Соответствие, КонтекстОбработки);
		Возврат;
		
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьРезультатВыполненияДействийЭДОПослеОжиданияДействийЭДО",
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиент, КонтекстОбработки);
	
	ОжидатьВыполненияДействийЭДО(Оповещение, АсинхронныеОперации, КонтекстОбработки.КонтекстДиагностики);
	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаВЦентрЭДО

// Параметры:
//  ИдентификаторЭДО - Строка
//  ФормаВладелец - Неопределено,ФормаКлиентскогоПриложения
Процедура ОткрытьФормуСостоянияВыгрузкиВЦентрЭДО(ИдентификаторЭДО, ФормаВладелец = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторЭДО", ИдентификаторЭДО);
	
	ОткрытьФорму("РегистрСведений.СостоянияВыгрузкиВЦентрЭДО.Форма.ПросмотрСостояния",
		ПараметрыФормы, ФормаВладелец)
	
КонецПроцедуры

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения - результат: см. ВыгрузитьНаборДокументовВЦентрЭДОЗавершение
//  ЭлектронныеДокументы - Массив из ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//  ФормаВладелец - Неопределено,ФормаКлиентскогоПриложения
Процедура ВыгрузитьНаборДокументовВЦентрЭДО(ОповещениеОЗавершении, ЭлектронныеДокументы, ФормаВладелец = Неопределено) Экспорт
	
	ИдентификаторФормы = Неопределено;
	Если ФормаВладелец <> Неопределено Тогда
		ИдентификаторФормы = ФормаВладелец.УникальныйИдентификатор;
	КонецЕсли;
	
	ДлительнаяОперация =
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОВызовСервера.ВыгрузитьНаборДокументовВЦентрЭДОВФоне(
		ЭлектронныеДокументы, ИдентификаторФормы);
	
	Контекст = НовыйКонтекстВыгрузкиНабораДокументовВЦентрЭДО();
	Контекст.ОповещениеОЗавершении = ОповещениеОЗавершении;
	
	Оповещение = Новый ОписаниеОповещения("ВыгрузитьНаборДокументовВЦентрЭДОЗавершение", ЭтотОбъект, Контекст);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ФормаВладелец);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЭДО - Строка
//  ФормаВладелец - ФормаКлиентскогоПриложения
Асинх Процедура ЗапуститьВыгрузкуВЦентрЭДО(ИдентификаторЭДО, ФормаВладелец) Экспорт
	
	СостояниеВыгрузки = ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОВызовСервера.СостояниеВыгрузкиВЦентрЭДО(ИдентификаторЭДО);
	Если ЗначениеЗаполнено(СостояниеВыгрузки.ДатаНачала)
		И Не ЗначениеЗаполнено(СостояниеВыгрузки.ДатаЗавершения) Тогда
		ОткрытьФормуСостоянияВыгрузкиВЦентрЭДО(ИдентификаторЭДО, ФормаВладелец);
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр(
		"ru = 'Перенос документов в Центр ЭДО может занять продолжительное время в зависимости от общего объема передаваемых файлов. Продолжить?'");
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет); // КодВозвратаДиалога
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	СостояниеВыгрузки = ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОВызовСервера.ЗапуститьВыгрузкуВЦентрЭДО(
		ИдентификаторЭДО);
	
	ЗаголовокОповещения = НСтр("ru = 'Переход в центр ЭДО'");
	ПояснениеОповещения = НСтр("ru = 'Запущена выгрузка электронных документов в центр ЭДО'");
	ДействиеПриНажатии = Новый ОписаниеОповещения("ОткрытьФормуСостоянияВыгрузкиВЦентрЭДОПослеЗапуска",
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиент, ИдентификаторЭДО);
	
	ПоказатьОповещениеПользователя(ЗаголовокОповещения, ДействиеПриНажатии, ПояснениеОповещения,
		БиблиотекаКартинок.ОбновлениеДанныхЭДО, СтатусОповещенияПользователя.Важное);
	
	ИмяСобытия = ИнтеграцияЦентраЭДОКлиент.ИмяСобытияОповещенияОбновлениеСостоянияВыгрузкиВЦентрЭДО();
	Оповестить(ИмяСобытия, СостояниеВыгрузки);
	
КонецПроцедуры

#КонецОбласти

#Область ВходящиеДокументы

// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО
//  ФормаВладелец - Неопределено,ФормаКлиентскогоПриложения
Процедура ИзменитьДанныеВходящегоДокументаВЦентреЭДО(ЭлектронныйДокумент, ФормаВладелец = Неопределено) Экспорт
	
	ИдентификаторФормы = Неопределено;
	Если ФормаВладелец <> Неопределено Тогда
		ИдентификаторФормы = ФормаВладелец.УникальныйИдентификатор;
	КонецЕсли;
	
	ДлительнаяОперация =
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОВызовСервера.ИзменитьДанныеВходящегоДокументаВЦентреЭДОВФоне(
		ЭлектронныйДокумент, ИдентификаторФормы);
	
	Оповещение = Новый ОписаниеОповещения("ИзменитьДанныеВходящегоДокументаВЦентреЭДОЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ФормаВладелец);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти // ВходящиеДокументы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщегоНазначения

// Параметры:
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//  ВидОперации - Строка
//  ТекстОшибки - Строка
Процедура ДобавитьНеизвестнуюОшибку(КонтекстДиагностики, ВидОперации, ТекстОшибки) Экспорт
	Ошибка = ОбработкаНеисправностейБЭДКлиент.НоваяОшибка(ВидОперации,
		ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(), ТекстОшибки, ТекстОшибки);
	ОбработкаНеисправностейБЭДКлиент.ДобавитьОшибку(КонтекстДиагностики, Ошибка,
		ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ИнтеграцияЦентраЭДО);
КонецПроцедуры

#КонецОбласти

#Область ОбработкаРезультатаВыполненияДействийЭДО

// Возвращаемое значение:
//  Структура:
//  * ОповещениеОЗавершении - ОписаниеОповещения
//  * АсинхронныеОперации - Массив из см. ИнтеграцияЦентраЭДО.НоваяАсинхроннаяОперация
//  * РезультатыДействий - см. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.НовыеРезультатыДействийПоУчетнымЗаписямЦентровЭДО
//  * СостояниеВыполненияДействий - см. НовоеСостояниеВыполненияДействийЭДО
//  * ИсходныйНаборДействийЭДО - см. ИнтерфейсДокументовЭДОКлиентСервер.НовыйНаборДействийПоЭДО
//  * ПаролиСертификатов - см. КриптографияБЭДКлиент.НовыеПаролиСертификатов
//  * КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
//  * РасшифрованныеМаркерыПоУчетнымЗаписям - см. НовыеРасшифрованныеМаркерыПоУчетнымЗаписям
//  * ПодписиДанныхПоУчетнымЗаписям - см. НовыеПодписиДанныхПоУчетнымЗаписям
Функция НовыйКонтекстОбработкиРезультатаВыполненияДействийЭДО()
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОЗавершении", Новый ОписаниеОповещения);
	Контекст.Вставить("АсинхронныеОперации", Новый Массив);
	Контекст.Вставить("РезультатыДействий", Новый Соответствие);
	Контекст.Вставить("СостояниеВыполненияДействий", Новый Структура);
	Контекст.Вставить("ИсходныйНаборДействийЭДО", ИнтерфейсДокументовЭДОКлиентСервер.НовыйНаборДействийПоЭДО());
	Контекст.Вставить("ПаролиСертификатов", КриптографияБЭДКлиент.НовыеПаролиСертификатов());
	Контекст.Вставить("КонтекстДиагностики", ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики());
	Контекст.Вставить("РасшифрованныеМаркерыПоУчетнымЗаписям", НовыеРасшифрованныеМаркерыПоУчетнымЗаписям());
	Контекст.Вставить("ПодписиДанныхПоУчетнымЗаписям", НовыеПодписиДанныхПоУчетнымЗаписям());
	Возврат Контекст;
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ВыполненныеДействияПоУчетнымЗаписям - см. НовыеВыполненныеДействияПоУчетнымЗаписям
Функция НовоеСостояниеВыполненияДействийЭДО()
	Состояние = Новый Структура;
	Состояние.Вставить("ВыполненныеДействияПоУчетнымЗаписям", НовыеВыполненныеДействияПоУчетнымЗаписям());
	Возврат Состояние;
КонецФункции

// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка - идентификатор учетной записи центра ЭДО.
//  * Значение - Массив из ПеречислениеСсылка.ДействияПоЭДО
Функция НовыеВыполненныеДействияПоУчетнымЗаписям()
	Возврат Новый Соответствие;
КонецФункции

// Параметры:
//  РезультатыДействий - см. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.НовыеРезультатыДействийПоУчетнымЗаписямЦентровЭДО
//  КонтекстОбработки - см. НовыйКонтекстОбработкиРезультатаВыполненияДействийЭДО
Процедура ОбработатьРезультатВыполненияДействийЭДОПослеОжиданияДействийЭДО(РезультатыДействий, КонтекстОбработки) Экспорт
	
	Если ЗначениеЗаполнено(РезультатыДействий) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(КонтекстОбработки.РезультатыДействий, РезультатыДействий);
	КонецЕсли;
	
	ЗашифрованныеМаркерыПоУчетнымЗаписям = НовыеЗашифрованныеМаркерыПоУчетнымЗаписям();
	
	Для Каждого РезультатДействийПоУчетнойЗаписи Из КонтекстОбработки.РезультатыДействий Цикл
		
		УчетнаяЗаписьЦентраЭДО = РезультатДействийПоУчетнойЗаписи.Ключ;
		РезультатДействий = РезультатДействийПоУчетнойЗаписи.Значение;
		ЗашифрованныеМаркеры = РезультатДействий.ЗашифрованныеМаркеры;
		
		Если ЗначениеЗаполнено(ЗашифрованныеМаркеры) Тогда
			ЗашифрованныеМаркерыПоУчетнымЗаписям.Вставить(УчетнаяЗаписьЦентраЭДО, ЗашифрованныеМаркеры);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ЗашифрованныеМаркерыПоУчетнымЗаписям) Тогда
		
		ОбработатьРезультатВыполненияДействийЭДОПослеРасшифровки(ЗашифрованныеМаркерыПоУчетнымЗаписям, КонтекстОбработки);
		Возврат;
		
	КонецЕсли;
		
	Оповещение = Новый ОписаниеОповещения("ОбработатьРезультатВыполненияДействийЭДОПослеРасшифровки",
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиент, КонтекстОбработки);
	
	РасшифроватьМаркерыПоУчетнымЗаписям(Оповещение, ЗашифрованныеМаркерыПоУчетнымЗаписям,
		КонтекстОбработки.ПаролиСертификатов, КонтекстОбработки.КонтекстДиагностики);
	
КонецПроцедуры

// Параметры:
//  РасшифрованныеМаркерыПоУчетнымЗаписям - см. НовыеРасшифрованныеМаркерыПоУчетнымЗаписям
//  КонтекстОбработки - см. НовыйКонтекстОбработкиРезультатаВыполненияДействийЭДО
Процедура ОбработатьРезультатВыполненияДействийЭДОПослеРасшифровки(РасшифрованныеМаркерыПоУчетнымЗаписям, КонтекстОбработки) Экспорт
	
	Если ЗначениеЗаполнено(РасшифрованныеМаркерыПоУчетнымЗаписям) Тогда
		КонтекстОбработки.РасшифрованныеМаркерыПоУчетнымЗаписям = РасшифрованныеМаркерыПоУчетнымЗаписям;
	КонецЕсли;
	
	ДанныеДляВыбораСертификатов = НовыеДанныеДляПодписанияПоУчетнымЗаписям();
	
	Для Каждого РезультатДействийПоУчетнойЗаписи Из КонтекстОбработки.РезультатыДействий Цикл
		
		УчетнаяЗаписьЦентраЭДО = РезультатДействийПоУчетнойЗаписи.Ключ;
		РезультатДействий = РезультатДействийПоУчетнойЗаписи.Значение;
		
		ДанныеДляПодписания = РезультатДействий.ДанныеДляПодписания;
		Если Не ЗначениеЗаполнено(ДанныеДляПодписания) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ОписаниеНабораДанных Из ДанныеДляПодписания Цикл
			ОписаниеНабораДанныхПоУчетнойЗаписи = НовоеОписаниеНабораДанныхДляИнтерактивногоПодписанияПоУчетнойЗаписи();
			ЗаполнитьЗначенияСвойств(ОписаниеНабораДанныхПоУчетнойЗаписи, ОписаниеНабораДанных);
			ОписаниеНабораДанныхПоУчетнойЗаписи.УчетнаяЗаписьЦентраЭДО = УчетнаяЗаписьЦентраЭДО;
			ДанныеДляВыбораСертификатов.Добавить(ОписаниеНабораДанныхПоУчетнойЗаписи);
		КонецЦикла;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ДанныеДляВыбораСертификатов) Тогда
		
		ЗавершитьОбработкуРезультатаВыполненияДействийЭДО(КонтекстОбработки);
		Возврат;
		
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьРезультатВыполненияДействийЭДОПослеВыбораСертификатов",
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиент, КонтекстОбработки);
	
	ВыбратьСертификатыДляПодписанияПоУчетнымЗаписям(Оповещение, ДанныеДляВыбораСертификатов,
		КонтекстОбработки.ПаролиСертификатов, КонтекстОбработки.КонтекстДиагностики);
	
КонецПроцедуры

// Параметры:
//  ДанныеДляЗаполненияПоУчетнымЗаписям - Массив из см. НовоеОписаниеНабораДанныхДляИнтерактивногоПодписанияПоУчетнойЗаписи
//  КонтекстОбработки - см. НовыйКонтекстОбработкиРезультатаВыполненияДействийЭДО
Процедура ОбработатьРезультатВыполненияДействийЭДОПослеВыбораСертификатов(ДанныеДляЗаполненияПоУчетнымЗаписям, КонтекстОбработки) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеДляЗаполненияПоУчетнымЗаписям) Тогда
		
		ЗавершитьОбработкуРезультатаВыполненияДействийЭДО(КонтекстОбработки);
		Возврат;
		
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьРезультатВыполненияДействийЭДОПослеЗаполненияПоСертификатам",
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиент, КонтекстОбработки);
	
	ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатам(Оповещение, ДанныеДляЗаполненияПоУчетнымЗаписям,
		КонтекстОбработки.КонтекстДиагностики);
	
КонецПроцедуры

// Параметры:
//  ДанныеДляПодписанияПоУчетнымЗаписям - Массив из см. НовоеОписаниеНабораДанныхДляИнтерактивногоПодписанияПоУчетнойЗаписи
//  КонтекстОбработки - см. НовыйКонтекстОбработкиРезультатаВыполненияДействийЭДО
Процедура ОбработатьРезультатВыполненияДействийЭДОПослеЗаполненияПоСертификатам(ДанныеДляПодписанияПоУчетнымЗаписям, КонтекстОбработки) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеДляПодписанияПоУчетнымЗаписям) Тогда
		
		ЗавершитьОбработкуРезультатаВыполненияДействийЭДО(КонтекстОбработки);
		Возврат;
		
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьРезультатВыполненияДействийЭДОПослеСозданияПодписей",
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиент, КонтекстОбработки);
	
	СоздатьПодписиПоВыбраннымСертификатам(Оповещение, ДанныеДляПодписанияПоУчетнымЗаписям,
		КонтекстОбработки.ПаролиСертификатов, КонтекстОбработки.КонтекстДиагностики);
	
КонецПроцедуры

// Параметры:
//  ПодписиДанныхПоУчетнымЗаписям - см. НовыеПодписиДанныхПоУчетнымЗаписям
//  КонтекстОбработки - см. НовыйКонтекстОбработкиРезультатаВыполненияДействийЭДО
Процедура ОбработатьРезультатВыполненияДействийЭДОПослеСозданияПодписей(ПодписиДанныхПоУчетнымЗаписям, КонтекстОбработки) Экспорт
	
	Если ЗначениеЗаполнено(ПодписиДанныхПоУчетнымЗаписям) Тогда
		КонтекстОбработки.ПодписиДанныхПоУчетнымЗаписям = ПодписиДанныхПоУчетнымЗаписям;
	КонецЕсли;
	
	ЗавершитьОбработкуРезультатаВыполненияДействийЭДО(КонтекстОбработки);
	
КонецПроцедуры

// Параметры:
//  КонтекстОбработки - см. НовыйКонтекстОбработкиРезультатаВыполненияДействийЭДО
Процедура ЗавершитьОбработкуРезультатаВыполненияДействийЭДО(КонтекстОбработки)
	
	РезультатОбработки = РезультатОбработкиДействийИнтеграцииЭДО(КонтекстОбработки);
	
	// См. ОбработатьРезультатВыполненияДействийЭДО.ОповещениеОЗавершении
	ВыполнитьОбработкуОповещения(КонтекстОбработки.ОповещениеОЗавершении, РезультатОбработки);
	
КонецПроцедуры

#Область ОжиданиеВыполненияДействийЭДО

// Возвращаемое значение:
//  Структура:
//  * ОповещениеОЗавершении - см. РасшифроватьМаркерыПоУчетнымЗаписям.ОповещениеОЗавершении
//  * КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
Функция НовыйКонтекстОжиданияВыполненияДействийПоЭДО()
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОЗавершении", Новый ОписаниеОповещения);
	Контекст.Вставить("КонтекстДиагностики", Новый Структура);
	Возврат Контекст;
КонецФункции

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения - результат: см. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОВызовСервера.РезультатыДействийЭДОАсинхронно
//  АсинхронныеОперации - Массив из см. ИнтеграцияЦентраЭДО.НоваяАсинхроннаяОперация
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
Процедура ОжидатьВыполненияДействийЭДО(ОповещениеОЗавершении, АсинхронныеОперации, КонтекстДиагностики)
	
	КонтекстОжидания = НовыйКонтекстОжиданияВыполненияДействийПоЭДО();
	КонтекстОжидания.ОповещениеОЗавершении = ОповещениеОЗавершении;
	КонтекстОжидания.КонтекстДиагностики = КонтекстДиагностики;
	
	Оповещение = Новый ОписаниеОповещения("ОжидатьВыполненияДействийЭДОПослеАсинхронныхОпераций",
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиент, КонтекстОжидания);
	ИнтеграцияЦентраЭДОКлиент.ОжидатьЗавершенияАсинхронныхОпераций(Оповещение, АсинхронныеОперации);
	
КонецПроцедуры

// Параметры:
//  АсинхронныеОперации - Массив из см. ИнтеграцияЦентраЭДО.НоваяАсинхроннаяОперация
//  КонтекстОжидания - см. НовыйКонтекстОжиданияВыполненияДействийПоЭДО
Процедура ОжидатьВыполненияДействийЭДОПослеАсинхронныхОпераций(АсинхронныеОперации, КонтекстОжидания) Экспорт
	АдресаРезультатов = ИнтеграцияЦентраЭДОКлиент.АдресаРезультатовАсинхронныхОпераций(
		АсинхронныеОперации, КонтекстОжидания.КонтекстДиагностики);
	
	РезультатыДействийЭДО = ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОВызовСервера.РезультатыДействийЭДОАсинхронно(
		АдресаРезультатов);
	
	// См. ОжидатьВыполненияДействийЭДО.ОповещениеОЗавершении
	ВыполнитьОбработкуОповещения(КонтекстОжидания.ОповещениеОЗавершении, РезультатыДействийЭДО);
	
КонецПроцедуры

#КонецОбласти

#Область РасшифроватьМаркерыПоУчетнымЗаписям

// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  * Значение - см. КриптографияБЭДКлиентСервер.НовыйНаборДанныхДляРасшифровки
Функция НовыеЗашифрованныеМаркерыПоУчетнымЗаписям()
	Возврат Новый Соответствие;
КонецФункции

// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  * Значение - см. КриптографияБЭДКлиентСервер.НовыйНаборРасшифрованныхДанных
Функция НовыеРасшифрованныеМаркерыПоУчетнымЗаписям()
	Возврат Новый Соответствие;
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ОповещениеОЗавершении - см. РасшифроватьМаркерыПоУчетнымЗаписям.ОповещениеОЗавершении
//  * КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
//  * ПаролиСертификатов - см. КриптографияБЭДКлиент.НовыеПаролиСертификатов
//  * ЗашифрованныеМаркерыПоУчетнымЗаписям - см. НовыеЗашифрованныеМаркерыПоУчетнымЗаписям
//  * ОбработанныеУчетныеЗаписи - Массив из СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  * УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  * ЗашифрованныеМаркеры - см. КриптографияБЭДКлиентСервер.НовыйНаборРасшифрованныхДанных
//  * РасшифрованныеМаркерыПоУчетнымЗаписям - см. НовыеРасшифрованныеМаркерыПоУчетнымЗаписям
Функция НовыйКонтекстРасшифровкиМаркеровПоУчетнымЗаписям()
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОЗавершении", Новый ОписаниеОповещения);
	Контекст.Вставить("КонтекстДиагностики", Новый Структура);
	Контекст.Вставить("ПаролиСертификатов", КриптографияБЭДКлиент.НовыеПаролиСертификатов());
	Контекст.Вставить("ЗашифрованныеМаркерыПоУчетнымЗаписям", НовыеЗашифрованныеМаркерыПоУчетнымЗаписям());
	Контекст.Вставить("ОбработанныеУчетныеЗаписи", Новый Массив);
	Контекст.Вставить("УчетнаяЗаписьЦентраЭДО", ПредопределенноеЗначение("Справочник.УчетныеЗаписиЦентровЭДО.ПустаяСсылка"));
	Контекст.Вставить("ЗашифрованныеМаркеры", КриптографияБЭДКлиентСервер.НовыйНаборРасшифрованныхДанных());
	Контекст.Вставить("РасшифрованныеМаркерыПоУчетнымЗаписям", НовыеРасшифрованныеМаркерыПоУчетнымЗаписям());
	Возврат Контекст;
КонецФункции

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения - результат см. НовыеРасшифрованныеМаркерыПоУчетнымЗаписям
//  ЗашифрованныеМаркерыПоУчетнымЗаписям - см. НовыеЗашифрованныеМаркерыПоУчетнымЗаписям
//  ПаролиСертификатов - см. КриптографияБЭДКлиент.НовыеПаролиСертификатов
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
Процедура РасшифроватьМаркерыПоУчетнымЗаписям(ОповещениеОЗавершении, ЗашифрованныеМаркерыПоУчетнымЗаписям, ПаролиСертификатов, КонтекстДиагностики)
	
	КонтекстРасшифровки = НовыйКонтекстРасшифровкиМаркеровПоУчетнымЗаписям();
	КонтекстРасшифровки.ОповещениеОЗавершении = ОповещениеОЗавершении;
	КонтекстРасшифровки.ЗашифрованныеМаркерыПоУчетнымЗаписям = ЗашифрованныеМаркерыПоУчетнымЗаписям;
	КонтекстРасшифровки.ПаролиСертификатов = ПаролиСертификатов;
	КонтекстРасшифровки.КонтекстДиагностики = КонтекстДиагностики;
	
	РасшифроватьМаркерыПоУчетнымЗаписямПослеПодготовкиКонтекста(КонтекстРасшифровки);
	
КонецПроцедуры

// Параметры:
//  КонтекстРасшифровки - см. НовыйКонтекстРасшифровкиМаркеровПоУчетнымЗаписям
Процедура РасшифроватьМаркерыПоУчетнымЗаписямПослеПодготовкиКонтекста(КонтекстРасшифровки)
	
	Установлен = УстановитьЗашифрованныйМаркерПоУчетнойЗаписиДляРасшифровки(КонтекстРасшифровки);
	
	Если Не Установлен Тогда
		РасшифроватьМаркерыПоУчетнымЗаписямЗавершение(КонтекстРасшифровки);
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("РасшифроватьМаркерыПоУчетнымЗаписямПослеОбработкиДанных",
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиент, КонтекстРасшифровки);
		
	ПараметрыРасшифровки = КриптографияБЭДКлиент.НовыеПараметрыРасшифровкиНабораДанных();
	ПараметрыРасшифровки.ПаролиСертификатов = КонтекстРасшифровки.ПаролиСертификатов;
	ПараметрыРасшифровки.КонтекстДиагностики = КонтекстРасшифровки.КонтекстДиагностики;
	
	КриптографияБЭДКлиент.НачатьРасшифровкуНабораДанных(Оповещение,
		КонтекстРасшифровки.ЗашифрованныеМаркеры, ПараметрыРасшифровки);
	
КонецПроцедуры

// Параметры:
//  ИтогРасшифровки - см. КриптографияБЭДКлиент.НовыйИтогРасшифровкиНабораДанных
//  КонтекстРасшифровки - см. НовыйКонтекстРасшифровкиМаркеровПоУчетнымЗаписям
Процедура РасшифроватьМаркерыПоУчетнымЗаписямПослеОбработкиДанных(ИтогРасшифровки, КонтекстРасшифровки) Экспорт
	
	КонтекстРасшифровки.РасшифрованныеМаркерыПоУчетнымЗаписям.Вставить(
		КонтекстРасшифровки.УчетнаяЗаписьЦентраЭДО, ИтогРасшифровки.НаборРасшифрованныхДанных);
	
	РасшифроватьМаркерыПоУчетнымЗаписямПослеПодготовкиКонтекста(КонтекстРасшифровки);
	
КонецПроцедуры

// Параметры:
//  КонтекстРасшифровки - см. НовыйКонтекстРасшифровкиМаркеровПоУчетнымЗаписям
Процедура РасшифроватьМаркерыПоУчетнымЗаписямЗавершение(КонтекстРасшифровки)
	
	// См. РасшифроватьМаркерыПоУчетнымЗаписям.ОповещениеОЗавершении
	ВыполнитьОбработкуОповещения(КонтекстРасшифровки.ОповещениеОЗавершении,
		КонтекстРасшифровки.РасшифрованныеМаркерыПоУчетнымЗаписям);
	
КонецПроцедуры

// Параметры:
//  КонтекстРасшифровки - см. НовыйКонтекстРасшифровкиМаркеровПоУчетнымЗаписям
// 
// Возвращаемое значение:
//  Булево
Функция УстановитьЗашифрованныйМаркерПоУчетнойЗаписиДляРасшифровки(КонтекстРасшифровки)
	
	Установлен = Ложь;
	
	ОбработанныеУчетныеЗаписи = КонтекстРасшифровки.ОбработанныеУчетныеЗаписи;
	
	Для Каждого ЗашифрованныйМаркерПоУчетнойЗаписи Из КонтекстРасшифровки.ЗашифрованныеМаркерыПоУчетнымЗаписям Цикл
		УчетнаяЗаписьЦентраЭДО = ЗашифрованныйМаркерПоУчетнойЗаписи.Ключ;
		Если ОбработанныеУчетныеЗаписи.Найти(УчетнаяЗаписьЦентраЭДО) = Неопределено Тогда
			КонтекстРасшифровки.УчетнаяЗаписьЦентраЭДО = УчетнаяЗаписьЦентраЭДО;
			КонтекстРасшифровки.ЗашифрованныеМаркеры = ЗашифрованныйМаркерПоУчетнойЗаписи.Значение;
			ОбработанныеУчетныеЗаписи.Добавить(УчетнаяЗаписьЦентраЭДО);
			Установлен = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Установлен;
	
КонецФункции

#КонецОбласти

#Область ВыборСертификатовДляПодписанияПоУчетнымЗаписям

// Возвращаемое значение:
//  Структура:
//  * ОповещениеОЗавершении - см. ВыбратьСертификатыДляПодписанияПоУчетнымЗаписям.ОповещениеОЗавершении
//  * КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
//  * ПаролиСертификатов - см. КриптографияБЭДКлиент.НовыеПаролиСертификатов
//  * ИндексНабораДанных - Число
//  * ДанныеДляВыбораСертификатов - см. НовыеДанныеДляПодписанияПоУчетнымЗаписям
//  * ДанныеДляЗаполненияПоСертификатам - см. НовыеДанныеДляПодписанияПоУчетнымЗаписям
Функция НовыйКонтекстВыбораСертификатовДляПодписанияПоУчетнымЗаписям()
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОЗавершении", Новый ОписаниеОповещения);
	Контекст.Вставить("КонтекстДиагностики", Новый Структура);
	Контекст.Вставить("ПаролиСертификатов", КриптографияБЭДКлиент.НовыеПаролиСертификатов());
	Контекст.Вставить("ИндексНабораДанных", 0);
	Контекст.Вставить("ДанныеДляВыбораСертификатов", Новый Массив);
	Контекст.Вставить("ДанныеДляЗаполненияПоСертификатам", Новый Массив);
	Возврат Контекст;
КонецФункции

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения - результат см. НовыеДанныеДляПодписанияВыбраннымиСертификатамиПоУчетнымЗаписям
//  ДанныеДляВыбораСертификатов - см. НовыеДанныеДляПодписанияПоУчетнымЗаписям
//  ПаролиСертификатов - см. КриптографияБЭДКлиент.НовыеПаролиСертификатов
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
Процедура ВыбратьСертификатыДляПодписанияПоУчетнымЗаписям(ОповещениеОЗавершении, ДанныеДляВыбораСертификатов, ПаролиСертификатов, КонтекстДиагностики)
	
	КонтекстВыбораСертификатов = НовыйКонтекстВыбораСертификатовДляПодписанияПоУчетнымЗаписям();
	КонтекстВыбораСертификатов.ОповещениеОЗавершении = ОповещениеОЗавершении;
	КонтекстВыбораСертификатов.ПаролиСертификатов = ПаролиСертификатов;
	КонтекстВыбораСертификатов.КонтекстДиагностики = КонтекстДиагностики;
	КонтекстВыбораСертификатов.ДанныеДляВыбораСертификатов = ДанныеДляВыбораСертификатов;
	
	ВыбратьСертификатыДляПодписанияПоУчетнымЗаписямПослеПодготовкиКонтекста(КонтекстВыбораСертификатов);
	
КонецПроцедуры

// Параметры:
//  КонтекстВыбораСертификатов - см. НовыйКонтекстВыбораСертификатовДляПодписанияПоУчетнымЗаписям
Процедура ВыбратьСертификатыДляПодписанияПоУчетнымЗаписямПослеПодготовкиКонтекста(КонтекстВыбораСертификатов)
	
	ОписаниеНабораДанныхДляВыбора = ОписаниеНабораДанныхДляВыбораСертификатаПоКонтексту(КонтекстВыбораСертификатов);
	
	Если ОписаниеНабораДанныхДляВыбора = Неопределено Тогда
		ВыбратьСертификатыДляПодписанияПоУчетнымЗаписямЗавершение(КонтекстВыбораСертификатов);
		Возврат;
	КонецЕсли;
	
	ОписаниеДанных = ОписаниеДанныхДляПодписанияЧерезБСП(ОписаниеНабораДанныхДляВыбора);
	
	ДанныеДляВыбораСертификата = Новый Структура("Данные", ПолучитьДвоичныеДанныеИзСтроки(""));
	
	ОписаниеДанных.НаборДанных = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеДляВыбораСертификата);
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьСертификатыДляПодписанияПоУчетнымЗаписямПослеВыполнения",
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиент, КонтекстВыбораСертификатов);
		
	Если ОписаниеНабораДанныхДляВыбора.ИспользоватьБазовыйТипПодписи Тогда
		ТипПодписи = ПредопределенноеЗначение("Перечисление.ТипыПодписиКриптографии.БазоваяCAdESBES");
	Иначе
		ТипПредметаПодписания = НастройкиЭДОКлиентСервер.ТипПредметаПодписанияЭД();
		ТипПодписи = НастройкиЭДОКлиентПовтИсп.ТипПодписи(ТипПредметаПодписания);
	КонецЕсли;
		
	КриптографияБЭДКлиент.Подписать(ОписаниеДанных, КонтекстВыбораСертификатов.КонтекстДиагностики,,
		Оповещение, КонтекстВыбораСертификатов.ПаролиСертификатов, ТипПодписи);
	
КонецПроцедуры

// Параметры:
//  Результат               - Структура:
//  * ЗаголовокДанных       - Строка
//  * СообщитьОЗавершении   - Булево
//  * ПоказатьКомментарий   - Булево
//  * КонтекстОперации      - Неопределено,Произвольный
//  * ПрекратитьВыполнение  - Булево
//  * БезПодтверждения      - Булево
//  * ОтборСертификатов     - Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  * НаборДанных           - Массив из Структура:
//    ** ПрисоединенныйФайл - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//    ** Данные             - ДвоичныеДанные
//    ** Представление      - Структура:
//       *** Значение       - ДокументСсылка.СообщениеЭДО
//       *** Представление  - Строка
//    ** ТребуетсяЗаполнитьПодписанта - Булево
//    ** ДоверенностиПоСертификатам - Соответствие из КлючИЗначение:
//       *** Ключ - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//       *** Значение - Строка - номер доверенности.
//    ** СертификатыТребующиеДоверенность - Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//    ** ДанныеИзменены     - Булево
//    ** АдресДанныхДляОбновления - Строка
//    ** СвойстваПодписи    - Строка
//                          - См. КриптографияБЭДКлиентСервер.НовыеСвойстваПодписи
//  * Операция              - Строка
//  * Успех                 - Булево
//  * Отказ                 - Булево
//  * ВыбранныйСертификат   - Структура:
//    ** Ссылка             - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//    ** Отпечаток          - Строка - отпечаток сертификата в формате строки Base64.
//    ** Данные             - Строка - адрес временного хранилища, содержащего двоичные данные сертификата.
//  * ПаролиСертификатов    - См. КриптографияБЭДКлиент.НовыеПаролиСертификатов
//  * ТекущийЭлементНабораДанных - Структура
//  * ПользовательНажалКнопкуПодписать - Булево
//  КонтекстВыбораСертификатов - См. НовыйКонтекстВыбораСертификатовДляПодписанияПоУчетнымЗаписям
Процедура ВыбратьСертификатыДляПодписанияПоУчетнымЗаписямПослеВыполнения(Результат, КонтекстВыбораСертификатов) Экспорт
	
	Если Результат = Неопределено
		ИЛИ Не Результат.Успех Тогда
		ВыбратьСледующийСертификатДляПодписанияПоУчетнымЗаписям(КонтекстВыбораСертификатов);
		Возврат;
	КонецЕсли;
	
	Сертификат = Результат.ВыбранныйСертификат.Ссылка;
	
	ДанныеДляВыбораСертификатов = КонтекстВыбораСертификатов.ДанныеДляВыбораСертификатов;
	ИндексНабораДанных = КонтекстВыбораСертификатов.ИндексНабораДанных;
	
	ОписаниеНабораДанныхДляВыбора = ДанныеДляВыбораСертификатов[ИндексНабораДанных];
	
	ОтсутствуетДоверенность = Ложь;
	
	Для Каждого ОписаниеДанных Из ОписаниеНабораДанныхДляВыбора.НаборДанных Цикл
		
		Если ОписаниеДанных.СертификатыТребующиеДоверенность.Найти(Сертификат) <> Неопределено
			И ОписаниеДанных.ДоверенностиПоСертификатам[Сертификат] = Неопределено Тогда
			ОтсутствуетДоверенность = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОтсутствуетДоверенность Тогда
		ВыбратьДругойСертификатПоУчетнымЗаписямПередПодписанием(Сертификат, КонтекстВыбораСертификатов);
		Возврат;
	КонецЕсли;
	
	ОписаниеНабораДанныхДляЗаполнения = НовоеОписаниеНабораДанныхДляИнтерактивногоПодписанияПоУчетнойЗаписи();
	ЗаполнитьЗначенияСвойств(ОписаниеНабораДанныхДляЗаполнения, ОписаниеНабораДанныхДляВыбора);
	ОписаниеНабораДанныхДляЗаполнения.Сертификаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сертификат);
	
	КонтекстВыбораСертификатов.ДанныеДляЗаполненияПоСертификатам.Добавить(ОписаниеНабораДанныхДляЗаполнения);
	
	ВыбратьСледующийСертификатДляПодписанияПоУчетнымЗаписям(КонтекстВыбораСертификатов);
	
КонецПроцедуры

// Параметры:
//  КонтекстВыбораСертификатов - см. НовыйКонтекстВыбораСертификатовДляПодписанияПоУчетнымЗаписям
Процедура ВыбратьСертификатыДляПодписанияПоУчетнымЗаписямЗавершение(КонтекстВыбораСертификатов)
	
	// См. ВыбратьСертификатыДляПодписанияПоУчетнымЗаписям.ОповещениеОЗавершении
	ВыполнитьОбработкуОповещения(КонтекстВыбораСертификатов.ОповещениеОЗавершении,
		КонтекстВыбораСертификатов.ДанныеДляЗаполненияПоСертификатам);
	
КонецПроцедуры

// Параметры:
//  КонтекстВыбораСертификатов - см. НовыйКонтекстВыбораСертификатовДляПодписанияПоУчетнымЗаписям
Процедура ВыбратьСледующийСертификатДляПодписанияПоУчетнымЗаписям(КонтекстВыбораСертификатов)
	
	КонтекстВыбораСертификатов.ИндексНабораДанных = КонтекстВыбораСертификатов.ИндексНабораДанных + 1;
	
	ВыбратьСертификатыДляПодписанияПоУчетнымЗаписямПослеПодготовкиКонтекста(КонтекстВыбораСертификатов);
	
КонецПроцедуры

// Параметры:
//  ВыбранныйСертификат - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  КонтекстВыбораСертификатов - см. НовыйКонтекстВыбораСертификатовДляПодписанияПоУчетнымЗаписям
Процедура ВыбратьДругойСертификатПоУчетнымЗаписямПередПодписанием(ВыбранныйСертификат, КонтекстВыбораСертификатов)
	
	КонтекстВыбораСертификатов.ПаролиСертификатов.Удалить(ВыбранныйСертификат);
	
	ТекстВопроса = НСтр("ru = 'Сертификатом <a href = ""%1"">%2</a> можно подписать только по доверенности. 
		|Для выбранного сертификата в программе нет подходящей машиночитаемой доверенности. 
		|Повторите подписание, выбрав другой сертификат или передайте документ на подпись руководителю.'");
		
	ТекстВопроса = СтроковыеФункцииКлиент.ФорматированнаяСтрока(ТекстВопроса,
		ПолучитьНавигационнуюСсылку(ВыбранныйСертификат), ВыбранныйСертификат);
	Оповещение = Новый ОписаниеОповещения("ВыбратьДругойСертификатПоУчетнымЗаписямПередПодписаниемПослеВопроса",
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиент, КонтекстВыбораСертификатов);
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ПовторитьОтмена);
	
КонецПроцедуры

// Параметры:
//  Ответ - КодВозвратаДиалога
//  КонтекстВыбораСертификатов - см. НовыйКонтекстВыбораСертификатовДляПодписанияПоУчетнымЗаписям
Процедура ВыбратьДругойСертификатПоУчетнымЗаписямПередПодписаниемПослеВопроса(Ответ, КонтекстВыбораСертификатов) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Повторить Тогда
		ВыбратьСертификатыДляПодписанияПоУчетнымЗаписямПослеПодготовкиКонтекста(КонтекстВыбораСертификатов);
	Иначе
		ВыбратьСледующийСертификатДляПодписанияПоУчетнымЗаписям(КонтекстВыбораСертификатов);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  КонтекстВыбораСертификатов - см. НовыйКонтекстВыбораСертификатовДляПодписанияПоУчетнымЗаписям
//  
// Возвращаемое значение:
//  - Неопределено
//  - См. НовоеОписаниеНабораДанныхДляИнтерактивногоПодписанияПоУчетнойЗаписи
Функция ОписаниеНабораДанныхДляВыбораСертификатаПоКонтексту(КонтекстВыбораСертификатов)
	
	ОписаниеНабораДанныхДляВыбора = Неопределено;
	
	ДанныеДляВыбораСертификатов = КонтекстВыбораСертификатов.ДанныеДляВыбораСертификатов;
	ИндексНабораДанных = КонтекстВыбораСертификатов.ИндексНабораДанных;
	
	ПаролиСертификатов = КонтекстВыбораСертификатов.ПаролиСертификатов;
	ДанныеДляЗаполненияПоСертификатам = КонтекстВыбораСертификатов.ДанныеДляЗаполненияПоСертификатам;
	КоличествоНаборовДанныхДляВыбораСертификатов = ДанныеДляВыбораСертификатов.Количество();
	
	Пока ИндексНабораДанных < КоличествоНаборовДанныхДляВыбораСертификатов Цикл
		
		ОписаниеНабораДанных = ДанныеДляВыбораСертификатов[ИндексНабораДанных];
		
		СертификатыСПаролем = КриптографияБЭДКлиент.СертификатыСПаролемИзНабора(
			ПаролиСертификатов, ОписаниеНабораДанных.Сертификаты);
		
		Если Не ЗначениеЗаполнено(СертификатыСПаролем) Тогда
			
			ОписаниеНабораДанныхДляВыбора = ОписаниеНабораДанных;
			Прервать;
		
		ИначеЕсли ОписаниеНабораДанных.Сертификаты.Количество() = 1 Тогда
			
			ДанныеДляЗаполненияПоСертификатам.Добавить(ОписаниеНабораДанных);
			
		Иначе
			
			ОписаниеНабораДанныхДляЗаполнения = НовоеОписаниеНабораДанныхДляИнтерактивногоПодписанияПоУчетнойЗаписи();
			ЗаполнитьЗначенияСвойств(ОписаниеНабораДанныхДляЗаполнения, ОписаниеНабораДанных);
			ОписаниеНабораДанныхДляЗаполнения.Сертификаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
				СертификатыСПаролем[0]);
			ДанныеДляЗаполненияПоСертификатам.Добавить(ОписаниеНабораДанныхДляЗаполнения);
			
		КонецЕсли;
		
		ИндексНабораДанных = ИндексНабораДанных + 1;
		
	КонецЦикла;
	
	КонтекстВыбораСертификатов.ИндексНабораДанных = ИндексНабораДанных;
	
	Возврат ОписаниеНабораДанныхДляВыбора;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеДанныхДляПодписанияПоВыбраннымСертификатам

// Возвращаемое значение:
//  Структура:
//  * ОповещениеОЗавершении - см. ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатам.ОповещениеОЗавершении
//  * КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
//  * ДанныеДляЗаполненияПоУчетнымЗаписям - Массив из см. НовоеОписаниеНабораДанныхДляИнтерактивногоПодписанияПоУчетнойЗаписи
//  * ЗаполненныеДанныеПоУчетнымЗаписям - Соответствие из КлючИЗначение
Функция НовыйКонтекстЗаполненияДанныхДляПодписанияПоВыбраннымСертификатам()
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОЗавершении", Новый ОписаниеОповещения);
	Контекст.Вставить("КонтекстДиагностики", Новый Структура);
	Контекст.Вставить("ДанныеДляЗаполненияПоУчетнымЗаписям", Новый Массив);
	Контекст.Вставить("ЗаполненныеДанныеПоУчетнымЗаписям", Новый Соответствие);
	Возврат Контекст;
КонецФункции

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения - результат: см. НовыеДанныеДляПодписанияВыбраннымиСертификатамиПоУчетнымЗаписям
//  ДанныеДляЗаполненияПоУчетнымЗаписям - Массив из см. НовоеОписаниеНабораДанныхДляИнтерактивногоПодписанияПоУчетнойЗаписи
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
Процедура ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатам(ОповещениеОЗавершении, ДанныеДляЗаполненияПоУчетнымЗаписям, КонтекстДиагностики)
	
	КонтекстЗаполнения = НовыйКонтекстЗаполненияДанныхДляПодписанияПоВыбраннымСертификатам();
	КонтекстЗаполнения.ОповещениеОЗавершении = ОповещениеОЗавершении;
	КонтекстЗаполнения.ДанныеДляЗаполненияПоУчетнымЗаписям = ДанныеДляЗаполненияПоУчетнымЗаписям;
	КонтекстЗаполнения.КонтекстДиагностики = КонтекстДиагностики;
	
	ДанныеДляЗаполненияНаСервере = ДанныеДляЗаполненияПоВыбраннымСертификатамНаСервере(
		ДанныеДляЗаполненияПоУчетнымЗаписям);
	
	Если Не ЗначениеЗаполнено(ДанныеДляЗаполненияНаСервере) Тогда
		ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатамЗавершение(КонтекстЗаполнения);
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОВызовСервера.ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатамВФоне(
		ДанныеДляЗаполненияНаСервере);
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатамПослеДлительнойОперации",
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиент, КонтекстЗаполнения);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Ложь;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

// Параметры:
//  ДлительнаяОперация - см. ДлительныеОперации.ВыполнитьФункцию
//  КонтекстЗаполнения - см. НовыйКонтекстЗаполненияДанныхДляПодписанияПоВыбраннымСертификатам
Процедура ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатамПослеДлительнойОперации(ДлительнаяОперация, КонтекстЗаполнения) Экспорт
	
	РезультатЗаполнения = ОбщегоНазначенияБЭДКлиент.РезультатДлительнойОперации(ДлительнаяОперация,
		КонтекстЗаполнения.КонтекстДиагностики,
		НСтр("ru = 'Выполнение действий по ЭДО.'"),
		ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ИнтеграцияЦентраЭДО); // См. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатам
	
	Если Не ЗначениеЗаполнено(РезультатЗаполнения) Тогда
		ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатамЗавершение(КонтекстЗаполнения);
		Возврат;
	КонецЕсли;
	
	ДополнитьКонтекстЗаполненияПоВыбраннымСертификатам(КонтекстЗаполнения, РезультатЗаполнения);
	
	Если Не ЗначениеЗаполнено(РезультатЗаполнения.АсинхронныеОперации) Тогда
		ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатамЗавершение(КонтекстЗаполнения);
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатамПослеАсинхронныхОпераций",
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиент, КонтекстЗаполнения);
	
	ИнтеграцияЦентраЭДОКлиент.ОжидатьЗавершенияАсинхронныхОпераций(Оповещение, РезультатЗаполнения.АсинхронныеОперации);
	
КонецПроцедуры

// Параметры:
//  АсинхронныеОперации - Массив из см. ИнтеграцияЦентраЭДО.НоваяАсинхроннаяОперация
//  КонтекстЗаполнения - см. НовыйКонтекстЗаполненияДанныхДляПодписанияПоВыбраннымСертификатам
Процедура ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатамПослеАсинхронныхОпераций(АсинхронныеОперации, КонтекстЗаполнения) Экспорт
	
	АдресаРезультатов = ИнтеграцияЦентраЭДОКлиент.АдресаРезультатовАсинхронныхОпераций(
		АсинхронныеОперации, КонтекстЗаполнения.КонтекстДиагностики);
	
	РезультатЗаполнения = 
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОВызовСервера.РезультатЗаполненияДанныхДляПодписанияПоВыбраннымСертификатамАсинхронно(
			АдресаРезультатов);
	
	ДополнитьКонтекстЗаполненияПоВыбраннымСертификатам(КонтекстЗаполнения, РезультатЗаполнения);
	
	ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатамЗавершение(КонтекстЗаполнения);
	
КонецПроцедуры

// Параметры:
//  КонтекстЗаполнения - см. НовыйКонтекстЗаполненияДанныхДляПодписанияПоВыбраннымСертификатам
Процедура ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатамЗавершение(КонтекстЗаполнения)
	
	ДанныеДляПодписанияПоУчетнымЗаписям = Новый Массив; // Массив из см. НовоеОписаниеНабораДанныхДляИнтерактивногоПодписанияПоУчетнойЗаписи
	ЗаполненныеДанныеПоУчетнымЗаписям = КонтекстЗаполнения.ЗаполненныеДанныеПоУчетнымЗаписям;
	
	Для Каждого ОписаниеНабораДанныхДляЗаполнения Из КонтекстЗаполнения.ДанныеДляЗаполненияПоУчетнымЗаписям Цикл
		
		УчетнаяЗаписьЦентраЭДО = ОписаниеНабораДанныхДляЗаполнения.УчетнаяЗаписьЦентраЭДО;
		
		ОписаниеНабораДанныхДляПодписания = НовоеОписаниеНабораДанныхДляИнтерактивногоПодписанияПоУчетнойЗаписи();
		ОписаниеНабораДанныхДляПодписания.УчетнаяЗаписьЦентраЭДО = УчетнаяЗаписьЦентраЭДО;
		ОписаниеНабораДанныхДляПодписания.Сертификаты = ОписаниеНабораДанныхДляЗаполнения.Сертификаты;
		
		НаборДанныхДляПодписания = ОписаниеНабораДанныхДляПодписания.НаборДанных;
		
		ЗаполненныеДанные = ЗаполненныеДанныеПоУчетнымЗаписям[УчетнаяЗаписьЦентраЭДО]; // См. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ОбработатьРезультатЗаполненияДанныхДляПодписанияПоВыбраннымСертификатам
		
		Для Каждого ОписаниеДанных Из ОписаниеНабораДанныхДляЗаполнения.НаборДанных Цикл
			
			Если Не ОписаниеДанных.ТребуетсяЗаполнитьПодписанта Тогда
				НаборДанныхДляПодписания.Добавить(ОписаниеДанных);
				Продолжить;
			КонецЕсли;
			
			Если ЗаполненныеДанные = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Данные = ЗаполненныеДанные[ОписаниеДанных.ИдентификаторДанных];
			
			Если Данные = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ОписаниеДанных.Данные = Данные;
			
			НаборДанныхДляПодписания.Добавить(ОписаниеДанных);
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(НаборДанныхДляПодписания) Тогда
			ДанныеДляПодписанияПоУчетнымЗаписям.Добавить(ОписаниеНабораДанныхДляПодписания);
		КонецЕсли;
		
	КонецЦикла;
	
	ВыполнитьОбработкуОповещения(КонтекстЗаполнения.ОповещениеОЗавершении, ДанныеДляПодписанияПоУчетнымЗаписям);
	
КонецПроцедуры

// Возвращаемое значение:
//  Структура:
//  * Сертификат - Неопределено,СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  * НомерДоверенности - Строка
//  * ИдентификаторыДанных - Массив из Строка
Функция ОписаниеНабораДанныхДляЗаполненияПоСертификатуНаСервере()
	Описание = Новый Структура;
	Описание.Вставить("Сертификат", Неопределено);
	Описание.Вставить("НомерДоверенности", "");
	Описание.Вставить("ИдентификаторыДанных", Новый Массив);
	Возврат Описание;
КонецФункции

// Параметры:
//  ДанныеДляЗаполненияПоУчетнымЗаписям - см. ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатам.ДанныеДляЗаполненияПоУчетнымЗаписям
// 
// Возвращаемое значение:
//  См. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатам.ДанныеДляЗаполненияПоУчетнымЗаписям
Функция ДанныеДляЗаполненияПоВыбраннымСертификатамНаСервере(ДанныеДляЗаполненияПоУчетнымЗаписям)
	
	ДанныеДляЗаполненияНаСервере = Новый Соответствие;
	
	ОписанияНаборовПоУчетнымЗаписям = Новый Соответствие;	
	
	Для Каждого ОписаниеНабораДанных Из ДанныеДляЗаполненияПоУчетнымЗаписям Цикл
		
		Если Не ЗначениеЗаполнено(ОписаниеНабораДанных.Сертификаты) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ОписаниеДанных Из ОписаниеНабораДанных.НаборДанных Цикл
			
			Если Не ОписаниеДанных.ТребуетсяЗаполнитьПодписанта Тогда
				Продолжить;
			КонецЕсли;
			
			УчетнаяЗаписьЦентраЭДО = ОписаниеНабораДанных.УчетнаяЗаписьЦентраЭДО;
			
			ОписанияНаборовПоСертификатам = ОписанияНаборовПоУчетнымЗаписям[УчетнаяЗаписьЦентраЭДО];
			Если ОписанияНаборовПоСертификатам = Неопределено Тогда
				ОписанияНаборовПоСертификатам = Новый Соответствие;
				ОписанияНаборовПоУчетнымЗаписям.Вставить(УчетнаяЗаписьЦентраЭДО, ОписанияНаборовПоСертификатам);
			КонецЕсли;
			
			Сертификат = ОписаниеНабораДанных.Сертификаты[0];
			
			ОписанияНаборовСертификатаПоДоверенностям = ОписанияНаборовПоСертификатам[Сертификат];
			Если ОписанияНаборовСертификатаПоДоверенностям = Неопределено Тогда
				ОписанияНаборовСертификатаПоДоверенностям = Новый Соответствие;
				ОписанияНаборовПоСертификатам.Вставить(Сертификат, ОписанияНаборовСертификатаПоДоверенностям);
			КонецЕсли;
			
			НомерДоверенности = ОписаниеДанных.ДоверенностиПоСертификатам[Сертификат];
			Если НомерДоверенности = Неопределено Тогда
				НомерДоверенности = "";
			КонецЕсли;
			
			ОписаниеНабораДанныхДляЗаполненияНаСервере = ОписанияНаборовСертификатаПоДоверенностям[НомерДоверенности];
			Если ОписаниеНабораДанныхДляЗаполненияНаСервере = Неопределено Тогда
				ОписаниеНабораДанныхДляЗаполненияНаСервере = ОписаниеНабораДанныхДляЗаполненияПоСертификатуНаСервере();
				ОписаниеНабораДанныхДляЗаполненияНаСервере.Сертификат = Сертификат;
				ОписаниеНабораДанныхДляЗаполненияНаСервере.НомерДоверенности = НомерДоверенности;
				ОписанияНаборовСертификатаПоДоверенностям.Вставить(
					НомерДоверенности, ОписаниеНабораДанныхДляЗаполненияНаСервере);
				ДанныеДляЗаполненияНаСервере.Вставить(УчетнаяЗаписьЦентраЭДО,
					ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОписаниеНабораДанныхДляЗаполненияНаСервере));
			КонецЕсли;
			
			ОписаниеНабораДанныхДляЗаполненияНаСервере.ИдентификаторыДанных.Добавить(ОписаниеДанных.ИдентификаторДанных);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ДанныеДляЗаполненияНаСервере;
	
КонецФункции

// Параметры:
//  КонтекстЗаполнения - см. НовыйКонтекстЗаполненияДанныхДляПодписанияПоВыбраннымСертификатам
//  РезультатЗаполнения - см. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОВызовСервера.РезультатЗаполненияДанныхДляПодписанияПоВыбраннымСертификатамАсинхронно
Процедура ДополнитьКонтекстЗаполненияПоВыбраннымСертификатам(КонтекстЗаполнения, РезультатЗаполнения)
	
	ОбработкаНеисправностейБЭДКлиент.ДополнитьКонтекстДиагностики(
		КонтекстЗаполнения.КонтекстДиагностики,
		РезультатЗаполнения.КонтекстДиагностики);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(
		КонтекстЗаполнения.ЗаполненныеДанныеПоУчетнымЗаписям,
		РезультатЗаполнения.ЗаполненныеДанныеПоУчетнымЗаписям);
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеПодписейПоВыбраннымСертификатам

// Возвращаемое значение:
//  Массив из см. НовоеОписаниеНабораДанныхДляИнтерактивногоПодписанияПоУчетнойЗаписи
Функция НовыеДанныеДляПодписанияПоУчетнымЗаписям()
	Возврат Новый Массив;
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * Сертификаты - Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  * НаборДанных - Массив из см. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.НовыеДанныеСообщенияДляИнтерактивногоПодписания
//  * ИспользоватьБазовыйТипПодписи - Булево - определяет необходимость использования базового типа подписи (CAdES-BES)
//                                             независимо от пользовательской настройки.
//  * УчетнаяЗаписьЦентраЭДО - СправочникСсылка.УчетныеЗаписиЦентровЭДО
Функция НовоеОписаниеНабораДанныхДляИнтерактивногоПодписанияПоУчетнойЗаписи()
	ОписаниеНабораДанных = ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиентСервер.НовоеОписаниеНабораДанныхДляИнтерактивногоПодписания();
	ОписаниеНабораДанных.Вставить("УчетнаяЗаписьЦентраЭДО",
		ПредопределенноеЗначение("Справочник.УчетныеЗаписиЦентровЭДО.ПустаяСсылка"));
	Возврат ОписаниеНабораДанных;
КонецФункции

// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка - идентификатор учетной записи центра ЭДО.
//  * Значение - Массив из см. НоваяПодписьДанных
Функция НовыеПодписиДанныхПоУчетнымЗаписям()
	Возврат Новый Соответствие;
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ИдентификаторДанных - Строка
//  * Подпись - Неопределено,ДвоичныеДанные
//  * НомерДоверенности - Строка
Функция НоваяПодписьДанных()
	ПодписьДанных = Новый Структура;
	ПодписьДанных.Вставить("ИдентификаторДанных", "");
	ПодписьДанных.Вставить("Подпись", Неопределено);
	ПодписьДанных.Вставить("НомерДоверенности", "");
	Возврат ПодписьДанных;
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ОповещениеОЗавершении - см. ВыбратьСертификатыДляПодписанияПоУчетнымЗаписям.ОповещениеОЗавершении
//  * КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
//  * ПаролиСертификатов - см. КриптографияБЭДКлиент.НовыеПаролиСертификатов
//  * ИндексНабораДанных - Число
//  * ДанныеДляПодписанияПоУчетнымЗаписям - Массив из см. НовоеОписаниеНабораДанныхДляИнтерактивногоПодписанияПоУчетнойЗаписи
Функция НовыйКонтекстСозданияПодписейПоВыбраннымСертификатам()
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОЗавершении", Новый ОписаниеОповещения);
	Контекст.Вставить("КонтекстДиагностики", Новый Структура);
	Контекст.Вставить("ПаролиСертификатов", КриптографияБЭДКлиент.НовыеПаролиСертификатов());
	Контекст.Вставить("ИндексНабораДанных", 0);
	Контекст.Вставить("ДанныеДляПодписанияПоУчетнымЗаписям", Новый Массив);
	Контекст.Вставить("ПодписиДанныхПоУчетнымЗаписям", НовыеПодписиДанныхПоУчетнымЗаписям());
	Возврат Контекст;
КонецФункции

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения - результат: см. НовыеДанныеДляПодписанияВыбраннымиСертификатамиПоУчетнымЗаписям
//  ДанныеДляПодписанияПоУчетнымЗаписям - Массив из см. НовоеОписаниеНабораДанныхДляИнтерактивногоПодписанияПоУчетнойЗаписи
//  ПаролиСертификатов - см. КриптографияБЭДКлиент.НовыеПаролиСертификатов
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики
Процедура СоздатьПодписиПоВыбраннымСертификатам(ОповещениеОЗавершении, ДанныеДляПодписанияПоУчетнымЗаписям, ПаролиСертификатов, КонтекстДиагностики)

	КонтекстСозданияПодписей = НовыйКонтекстСозданияПодписейПоВыбраннымСертификатам();
	КонтекстСозданияПодписей.ОповещениеОЗавершении = ОповещениеОЗавершении;
	КонтекстСозданияПодписей.ДанныеДляПодписанияПоУчетнымЗаписям = ДанныеДляПодписанияПоУчетнымЗаписям;
	КонтекстСозданияПодписей.ПаролиСертификатов = ПаролиСертификатов;
	КонтекстСозданияПодписей.КонтекстДиагностики = КонтекстДиагностики;
	
	СоздатьПодписиПоВыбраннымСертификатамПослеПодготовкиКонтекста(КонтекстСозданияПодписей);
	
КонецПроцедуры

// Параметры:
//  КонтекстСозданияПодписей - см. НовыйКонтекстСозданияПодписейПоВыбраннымСертификатам
Процедура СоздатьПодписиПоВыбраннымСертификатамПослеПодготовкиКонтекста(КонтекстСозданияПодписей)
	
	ДанныеДляПодписания = КонтекстСозданияПодписей.ДанныеДляПодписанияПоУчетнымЗаписям;
	ИндексНабораДанных = КонтекстСозданияПодписей.ИндексНабораДанных;
	
	Если ИндексНабораДанных > ДанныеДляПодписания.ВГраница() Тогда
		СоздатьПодписиПоВыбраннымСертификатамЗавершение(КонтекстСозданияПодписей);
		Возврат;
	КонецЕсли;
	
	ОписаниеНабораДанных = ДанныеДляПодписания[ИндексНабораДанных];
	
	ОписаниеДанных = ОписаниеДанныхДляПодписанияЧерезБСП(ОписаниеНабораДанных);
	
	Оповещение = Новый ОписаниеОповещения("СоздатьПодписиПоВыбраннымСертификатамПослеВыполнения",
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиент, КонтекстСозданияПодписей);
	
	Если ОписаниеНабораДанных.ИспользоватьБазовыйТипПодписи Тогда
		ТипПодписи = ПредопределенноеЗначение("Перечисление.ТипыПодписиКриптографии.БазоваяCAdESBES");
	Иначе
		ТипПредметаПодписания = НастройкиЭДОКлиентСервер.ТипПредметаПодписанияЭД();
		ТипПодписи = НастройкиЭДОКлиентПовтИсп.ТипПодписи(ТипПредметаПодписания);
	КонецЕсли;
	
	КриптографияБЭДКлиент.Подписать(ОписаниеДанных, КонтекстСозданияПодписей.КонтекстДиагностики,,
		Оповещение, КонтекстСозданияПодписей.ПаролиСертификатов, ТипПодписи);
	
КонецПроцедуры

// Параметры:
//  РезультатПодписания     - Структура:
//  * ЗаголовокДанных       - Строка
//  * СообщитьОЗавершении   - Булево
//  * ПоказатьКомментарий   - Булево
//  * КонтекстОперации      - Неопределено,Произвольный
//  * ПрекратитьВыполнение  - Булево
//  * БезПодтверждения      - Булево
//  * ОтборСертификатов     - Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  * НаборДанных           - Массив из Структура:
//    ** ИдентификаторДанных - Строка
//    ** Данные             - ДвоичныеДанные
//    ** Представление      - Структура:
//       *** Значение       - ДокументСсылка.СообщениеЭДО
//       *** Представление  - Строка
//    ** ТребуетсяЗаполнитьПодписанта - Булево
//    ** СвойстваПодписи    - Строка,
//                            См. КриптографияБЭДКлиентСервер.НовыеСвойстваПодписи
//    ** ДоверенностиПоСертификатам - Соответствие из КлючИЗначение:
//       *** Ключ - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//       *** Значение - Строка - номер доверенности.
//  * Операция              - Строка
//  * Успех                 - Булево
//  * Отказ                 - Булево
//  * ВыбранныйСертификат   - Структура:
//    ** Ссылка             - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//    ** Отпечаток          - Строка - отпечаток сертификата в формате строки Base64.
//    ** Данные             - Строка - адрес временного хранилища, содержащего двоичные данные сертификата.
//  * ПаролиСертификатов    - См. КриптографияБЭДКлиент.НовыеПаролиСертификатов
//  * ТекущийЭлементНабораДанных - Структура
//  * ПользовательНажалКнопкуПодписать - Булево
//  КонтекстСозданияПодписей - См. НовыйКонтекстСозданияПодписейПоВыбраннымСертификатам
Процедура СоздатьПодписиПоВыбраннымСертификатамПослеВыполнения(РезультатПодписания, КонтекстСозданияПодписей) Экспорт
	
	ДанныеДляПодписанияПоУчетнымЗаписям = КонтекстСозданияПодписей.ДанныеДляПодписанияПоУчетнымЗаписям;
	ИндексНабораДанных = КонтекстСозданияПодписей.ИндексНабораДанных;
	ОписаниеНабораДанных = ДанныеДляПодписанияПоУчетнымЗаписям[ИндексНабораДанных];
	
	ПодписиДанныхПоУчетнымЗаписям = КонтекстСозданияПодписей.ПодписиДанныхПоУчетнымЗаписям;
	НаборПодписейДанных = ПодписиДанныхПоУчетнымЗаписям[ОписаниеНабораДанных.УчетнаяЗаписьЦентраЭДО];
	Если НаборПодписейДанных = Неопределено Тогда
		НаборПодписейДанных = Новый Массив; // См. Массив из см. НоваяПодписьДанных
		ПодписиДанныхПоУчетнымЗаписям.Вставить(ОписаниеНабораДанных.УчетнаяЗаписьЦентраЭДО, НаборПодписейДанных);
	КонецЕсли;
	
	Если РезультатПодписания = Неопределено
		ИЛИ Не РезультатПодписания.Успех Тогда
		ВыбратьСледующиеДанныеДляСозданияПодписиПоВыбраннымСертификатам(КонтекстСозданияПодписей);
		Возврат;
	КонецЕсли;
	
	Сертификат = РезультатПодписания.ВыбранныйСертификат.Ссылка;
	
	Для Каждого ОписаниеДанных Из РезультатПодписания.НаборДанных Цикл
		
		Если Не ОписаниеДанных.Свойство("СвойстваПодписи") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтоАдресВременногоХранилища(ОписаниеДанных.СвойстваПодписи) Тогда
			СвойстваПодписи = ПолучитьИзВременногоХранилища(ОписаниеДанных.СвойстваПодписи);
		Иначе
			СвойстваПодписи = ОписаниеДанных.СвойстваПодписи;
		КонецЕсли;
		
		ПодписьДанных = НоваяПодписьДанных();
		ПодписьДанных.ИдентификаторДанных = ОписаниеДанных.ИдентификаторДанных;
		ПодписьДанных.Подпись = СвойстваПодписи.Подпись;
		
		НомерДоверенности = ОписаниеДанных.ДоверенностиПоСертификатам[Сертификат];
		Если ЗначениеЗаполнено(НомерДоверенности) Тогда
			ПодписьДанных.НомерДоверенности = НомерДоверенности;
		КонецЕсли;
		
		НаборПодписейДанных.Добавить(ПодписьДанных);
		
	КонецЦикла;
	
	ВыбратьСледующиеДанныеДляСозданияПодписиПоВыбраннымСертификатам(КонтекстСозданияПодписей);
	
КонецПроцедуры

// Параметры:
//  КонтекстСозданияПодписей - см. НовыйКонтекстСозданияПодписейПоВыбраннымСертификатам
Процедура ВыбратьСледующиеДанныеДляСозданияПодписиПоВыбраннымСертификатам(КонтекстСозданияПодписей)
	
	КонтекстСозданияПодписей.ИндексНабораДанных = КонтекстСозданияПодписей.ИндексНабораДанных + 1;
	
	СоздатьПодписиПоВыбраннымСертификатамПослеПодготовкиКонтекста(КонтекстСозданияПодписей);
	
КонецПроцедуры

// Параметры:
//  КонтекстСозданияПодписей - см. НовыйКонтекстСозданияПодписейПоВыбраннымСертификатам
Процедура СоздатьПодписиПоВыбраннымСертификатамЗавершение(КонтекстСозданияПодписей)
	
	// См. СоздатьПодписиПоВыбраннымСертификатам.ОповещениеОЗавершении
	ВыполнитьОбработкуОповещения(КонтекстСозданияПодписей.ОповещениеОЗавершении,
		КонтекстСозданияПодписей.ПодписиДанныхПоУчетнымЗаписям);
	
КонецПроцедуры

// Параметры:
//  ОписаниеНабораДанных - см. НовоеОписаниеНабораДанныхДляИнтерактивногоПодписанияПоУчетнойЗаписи
// 
// Возвращаемое значение:
//  Структура -  Описание данных для подписания через БСП:
// * ЗаголовокДанных - Строка
// * СообщитьОЗавершении - Булево
// * ПоказатьКомментарий - Булево
// * КонтекстОперации - Неопределено
// * ПрекратитьВыполнение - Булево
// * БезПодтверждения - Булево
// * ОтборСертификатов - Массив из СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
// * НаборДанных - Массив из см. ИнтеграцияЦентраЭДО.НовыеДанныеСообщенияДляИнтерактивногоПодписания
// * Операция - Строка
// * ПредставлениеНабора - Строка
Функция ОписаниеДанныхДляПодписанияЧерезБСП(ОписаниеНабораДанных)
	
	Сертификаты = ОписаниеНабораДанных.Сертификаты;
	НаборДанных = ОписаниеНабораДанных.НаборДанных;
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("ЗаголовокДанных",      НСтр("ru = 'Документ'"));
	ОписаниеДанных.Вставить("СообщитьОЗавершении",  Ложь);
	ОписаниеДанных.Вставить("ПоказатьКомментарий",  Ложь);
	ОписаниеДанных.Вставить("КонтекстОперации",     Неопределено);
	ОписаниеДанных.Вставить("ПрекратитьВыполнение", Истина);
	ОписаниеДанных.Вставить("БезПодтверждения",     Истина);
	ОписаниеДанных.Вставить("ОтборСертификатов",    Сертификаты);
	ОписаниеДанных.Вставить("НаборДанных",          НаборДанных);
	
	КоличествоДанных = НаборДанных.Количество();
	Если КоличествоДанных = 1 Тогда
		ОписаниеДанных.Вставить("Операция", НСтр("ru = 'Подписание электронного документа'"));
	Иначе
		ОписаниеДанных.Вставить("Операция", НСтр("ru = 'Подписание электронных документов'"));
		ОписаниеДанных.Вставить("ПредставлениеНабора",
			СтрШаблон(НСтр("ru = 'Электронные документы (%1)'"), КоличествоДанных));
	КонецЕсли;
	
	Возврат ОписаниеДанных;
	
КонецФункции

#КонецОбласти

#Область РезультатОбработкиДействийЭДО

// Параметры:
//  КонтекстОбработки - см. НовыйКонтекстОбработкиРезультатаВыполненияДействийЭДО
Функция РезультатОбработкиДействийИнтеграцииЭДО(КонтекстОбработки)
	
	РезультатОбработки = ЭлектронныеДокументыЭДОКлиент.НовыйРезультатОбработкиДействийИнтеграцииЭДО();
	
	РезультатОбработки.КонтекстДиагностики = КонтекстОбработки.КонтекстДиагностики;
	РезультатОбработки.СостояниеВыполненияДействий = КонтекстОбработки.СостояниеВыполненияДействий;
	СостояниеВыполненияДействий = РезультатОбработки.СостояниеВыполненияДействий; // см. НовоеСостояниеВыполненияДействийЭДО
	
	ИтогДействийЭДО = РезультатОбработки.ИтогВыполненияДействий;
	ДокументыДляОбработкиИзвещений = РезультатОбработки.ДокументыДляОбработкиИзвещений;
	ВыполненныеДействияПоУчетнымЗаписям = СостояниеВыполненияДействий.ВыполненныеДействияПоУчетнымЗаписям;
	ОшибкиФормирования = РезультатОбработки.ОшибкиФормирования;
	
	Для Каждого РезультатДействийПоУчетнойЗаписи Из КонтекстОбработки.РезультатыДействий Цикл
		УчетнаяЗаписьЦентраЭДО = РезультатДействийПоУчетнойЗаписи.Ключ;
		РезультатДействий = РезультатДействийПоУчетнойЗаписи.Значение;
		
		ЭлектронныеДокументыЭДОКлиентСервер.ДополнитьИтогВыполненияДействийПоЭДО(ИтогДействийЭДО, РезультатДействий.Итог);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(
			ДокументыДляОбработкиИзвещений, РезультатДействий.ДокументыДляОбработкиИзвещений, Истина);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОшибкиФормирования, РезультатДействий.ОшибкиФормирования);
		
		ВыполненныеДействия = ВыполненныеДействияПоУчетнымЗаписям[УчетнаяЗаписьЦентраЭДО];
		Если ВыполненныеДействия = Неопределено Тогда
			ВыполненныеДействия = Новый Массив; // Массив из ПеречислениеСсылка.ДействияПоЭДО
			ВыполненныеДействияПоУчетнымЗаписям.Вставить(УчетнаяЗаписьЦентраЭДО, ВыполненныеДействия);
		КонецЕсли;
		
		Для Каждого ОбработаноПоДействию Из РезультатДействий.Итог.ОбработаноПоДействиям Цикл
			ВыполненныеДействия.Добавить(ОбработаноПоДействию.Ключ);
		КонецЦикла;
	КонецЦикла;
	
	РезультатОбработки.СостояниеВыполненияДействий = КонтекстОбработки.СостояниеВыполненияДействий;
	
	НаборДействийДляПродолженияПоУчетнымЗаписям = НаборДействийДляПродолженияПоУчетнымЗаписям(
		КонтекстОбработки.ИсходныйНаборДействийЭДО, КонтекстОбработки.СостояниеВыполненияДействий.ВыполненныеДействияПоУчетнымЗаписям);
	
	РезультатОбработки.ПродолжитьВыполнениеДействий =
		ЗначениеЗаполнено(КонтекстОбработки.РасшифрованныеМаркерыПоУчетнымЗаписям)
		ИЛИ ЗначениеЗаполнено(КонтекстОбработки.ПодписиДанныхПоУчетнымЗаписям)
		ИЛИ ЗначениеЗаполнено(НаборДействийДляПродолженияПоУчетнымЗаписям);
	
	Если РезультатОбработки.ПродолжитьВыполнениеДействий Тогда
		РезультатОбработки.ПараметрыПродолженияДействий = ПараметрыПродолженияВыполненияДействийЭДОПоУчетнымЗаписям(
			КонтекстОбработки, НаборДействийДляПродолженияПоУчетнымЗаписям);
	КонецЕсли;
	
	Возврат РезультатОбработки;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ПодписиДанных - Неопределено,Массив из см. НоваяПодписьДанных
//  * РасшифрованныеМаркеры - Неопределено
//                          - см. КриптографияБЭДКлиентСервер.НовыйНаборРасшифрованныхДанных
//  * НаборДействий - см. ИнтерфейсДокументовЭДОКлиентСервер.НовыйНаборДействийПоЭДО
Функция НовыеПараметрыПродолженияВыполненияДействийЭДО() Экспорт
	Параметры = Новый Структура;
	Параметры.Вставить("ПодписиДанных", Неопределено);
	Параметры.Вставить("РасшифрованныеМаркеры", Неопределено);
	Параметры.Вставить("НаборДействий", ИнтерфейсДокументовЭДОКлиентСервер.НовыйНаборДействийПоЭДО());
	Возврат Параметры;
КонецФункции

// Параметры:
//  ИсходныйНаборДействий - см. ИнтерфейсДокументовЭДОКлиентСервер.НовыйНаборДействийПоЭДО
//  ВыполненныеДействияПоУчетнымЗаписям - см. НовыеВыполненныеДействияПоУчетнымЗаписям
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка - идентификатор учетной записи центра ЭДО.
//  * Значение - см. ИнтерфейсДокументовЭДОКлиентСервер.НовыйНаборДействийПоЭДО
Функция НаборДействийДляПродолженияПоУчетнымЗаписям(ИсходныйНаборДействий, ВыполненныеДействияПоУчетнымЗаписям)
	
	НаборДействийПоУчетнымЗаписям = Новый Соответствие;
	
	Для Каждого ВыполненныеДействияПоУчетнойЗаписи Из ВыполненныеДействияПоУчетнымЗаписям Цикл
		
		УчетнаяЗаписьЦентраЭДО = ВыполненныеДействияПоУчетнойЗаписи.Ключ;
		ВыполненныеДействия = ВыполненныеДействияПоУчетнойЗаписи.Значение;
		
		НаборДействийДляПродолжения = ЭлектронныеДокументыЭДОКлиент.НаборДействийПослеПодписанияРасшифровки(ИсходныйНаборДействий, ВыполненныеДействия);
		
		Если ЗначениеЗаполнено(НаборДействийДляПродолжения) Тогда
			НаборДействийПоУчетнымЗаписям.Вставить(УчетнаяЗаписьЦентраЭДО, НаборДействийДляПродолжения);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НаборДействийПоУчетнымЗаписям;
	
КонецФункции

// Параметры:
//  КонтекстОбработки - см. НовыйКонтекстОбработкиРезультатаВыполненияДействийЭДО
//  НаборДействийДляПродолженияПоУчетнымЗаписям - см. НаборДействийДляПродолженияПоУчетнымЗаписям
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка - идентификатор учетной записи центра ЭДО.
//  * Значение - Массив из см. НовыеПараметрыПродолженияВыполненияДействийЭДО
Функция ПараметрыПродолженияВыполненияДействийЭДОПоУчетнымЗаписям(КонтекстОбработки, НаборДействийДляПродолженияПоУчетнымЗаписям)
	
	ПродолженияВыполненияПоУчетнымЗаписям = Новый Соответствие;
	
	ПодписиДанныхПоУчетнымЗаписям = КонтекстОбработки.ПодписиДанныхПоУчетнымЗаписям;
	РасшифрованныеМаркерыПоУчетнымЗаписям = КонтекстОбработки.РасшифрованныеМаркерыПоУчетнымЗаписям;
	
	Для Каждого РезультатДействийПоУчетнойЗаписи Из КонтекстОбработки.РезультатыДействий Цикл
		
		УчетнаяЗаписьЦентраЭДО = РезультатДействийПоУчетнойЗаписи.Ключ;
		
		ПодписиДанных = ПодписиДанныхПоУчетнымЗаписям[УчетнаяЗаписьЦентраЭДО];
		РасшифрованныеМаркеры = РасшифрованныеМаркерыПоУчетнымЗаписям[УчетнаяЗаписьЦентраЭДО];
		НаборДействийДляПродолжения = НаборДействийДляПродолженияПоУчетнымЗаписям[УчетнаяЗаписьЦентраЭДО];
		
		Если Не ЗначениеЗаполнено(ПодписиДанных)
			И Не ЗначениеЗаполнено(РасшифрованныеМаркеры)
			И Не ЗначениеЗаполнено(НаборДействийДляПродолжения) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыПродолжения = НовыеПараметрыПродолженияВыполненияДействийЭДО();
		
		Если ПодписиДанных <> Неопределено Тогда
			ПараметрыПродолжения.ПодписиДанных = ПодписиДанных;
		ИначеЕсли ЗначениеЗаполнено(РезультатДействийПоУчетнойЗаписи.Значение.ДанныеДляПодписания) Тогда
			ПараметрыПродолжения.ПодписиДанных = Новый Массив;
		КонецЕсли;
		
		Если РасшифрованныеМаркеры <> Неопределено Тогда
			ПараметрыПродолжения.РасшифрованныеМаркеры = РасшифрованныеМаркеры;
		КонецЕсли;
		
		Если НаборДействийДляПродолжения <> Неопределено Тогда
			ПараметрыПродолжения.НаборДействий = НаборДействийДляПродолжения;
		КонецЕсли;
		
		ПродолженияВыполненияПоУчетнымЗаписям.Вставить(УчетнаяЗаписьЦентраЭДО, ПараметрыПродолжения);
		
	КонецЦикла;
	
	Возврат ПродолженияВыполненияПоУчетнымЗаписям;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ВходящиеДокументы

// Параметры:
//  ДлительнаяОперация - Неопределено
//                     - см. ДлительныеОперации.ВыполнитьФункцию
//  ДополнительныеПараметры - Неопределено
// 
Процедура ИзменитьДанныеВходящегоДокументаВЦентреЭДОЗавершение(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	ВидОперации = ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДОКлиентСервер.ВидОперацииИзменениеДанныхВходящегоДокументаВЦентреЭДО();
	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	
	РезультатИзменения = ОбщегоНазначенияБЭДКлиент.РезультатВыполненияФоновогоЗадания(
		ВидОперации, ДлительнаяОперация, КонтекстДиагностики); // См. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ИзменитьДанныеВходящегоДокументаВЦентреЭДО
	
	Если РезультатИзменения = Неопределено Тогда
		РезультатИзменения = Новый Структура("Успех, КонтекстДиагностики", Ложь, КонтекстДиагностики);
	КонецЕсли;
	
	ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(РезультатИзменения.КонтекстДиагностики);
	
КонецПроцедуры

#КонецОбласти // ВходящиеДокументы

#Область ВыгрузкаВЦентрЭДО

// Возвращаемое значение:
//  Строка
Функция ВидОперацииВыгрузкаНабораДокументовВЦентрЭДО()
	
	Возврат НСтр("ru = 'Выгрузка набора электронных документов в центр ЭДО.'");;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ОповещениеОЗавершении - см. ВыгрузитьНаборДокументовВЦентрЭДО.ОповещениеОЗавершении
Функция НовыйКонтекстВыгрузкиНабораДокументовВЦентрЭДО()
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОЗавершении", Новый ОписаниеОповещения);
	Возврат Контекст;
	
КонецФункции

// Параметры:
//  ДлительнаяОперация - Неопределено
//                     - см. ДлительныеОперации.ВыполнитьФункцию
//  Контекст - см. НовыйКонтекстВыгрузкиНабораДокументовВЦентрЭДО
//
// Возвращаемое значение:
//  - Неопределено
//  - См. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ВыгрузитьНаборДокументовВЦентрЭДО
Функция ВыгрузитьНаборДокументовВЦентрЭДОЗавершение(ДлительнаяОперация, Контекст) Экспорт
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	ВидОперации = ВидОперацииВыгрузкаНабораДокументовВЦентрЭДО();
	ПодсистемаБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ИнтеграцияЦентраЭДО;
	РезультатДлительнойОперации = ОбщегоНазначенияБЭДКлиент.РезультатДлительнойОперации(
		ДлительнаяОперация, КонтекстДиагностики, ВидОперации, ПодсистемаБЭД); 
	
	ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, РезультатДлительнойОперации);
	
	ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(КонтекстДиагностики);
	
	Возврат РезультатДлительнойОперации;
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - Строка
Процедура ОткрытьФормуСостоянияВыгрузкиВЦентрЭДОПослеЗапуска(ИдентификаторЭДО) Экспорт
	
	ОткрытьФормуСостоянияВыгрузкиВЦентрЭДО(ИдентификаторЭДО);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
