#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура УстановитьПараметры()
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрокаОсновныеСредства",       НСтр("ru = 'Основные средства'"));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрокаНМА",                    НСтр("ru = 'НМА'"));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрокаОборудование",           НСтр("ru = 'Оборудование'"));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрокаСпецоснастка",           НСтр("ru = 'Спецоснастка'"));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрокаИнструменты",            НСтр("ru = 'Инструменты'"));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрокаОбъектыСтроительства",   НСтр("ru = 'Объекты строительства'"));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрокаИнвестиционныеАктивы",   НСтр("ru = 'Инвестиционные активы'"));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрокаБалансоваяСтоимость",    " (" + НСтр("ru = 'балансовая стоимость'") + ")");
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрокаНакопленнаяАмортизация", " (" + НСтр("ru = 'накопленная амортизация'") + ")");
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	УстановитьПараметры();
	
	ОтчетыПлатформаСервер.ВывестиОтчет(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецЕсли
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.Использование Тогда
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПодразделениеКомпании")
				И (ЭлементОтбора.ПравоеЗначение = Неопределено ИЛИ ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Справочник.ПодразделенияКомпании.ПустаяСсылка")) Тогда
				ЭлементОтбора.Использование = Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Отбор по подразделению компании не установлен. Формируется отчет для компании в целом.'"));
			ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПодразделениеКомпании.Организация") = НСтр("ru = 'Организация (Подразделение)'")
				И (ЭлементОтбора.ПравоеЗначение = Неопределено ИЛИ ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка")) Тогда
				ЭлементОтбора.Использование = Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Отбор по организации компании не установлен. Формируется отчет для компании в целом.'"));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
