
&НаКлиенте
// Функция проверяет отправлено ли сообщение по его состоянию
//
// Параметры:
//	Состояние	- ПеречислениеСсылка	- Состояние сообщения
//
// Возвращаемое значение:
//	Булево	- Признак отправки сообщения
//
Функция смсСообщениеОтправлено(Состояние)
	Если Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументаСообщениеSMS.Черновик") Тогда
		Возврат Ложь;
	ИначеЕсли Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументаСообщениеSMS.Исходящее") Тогда
		Возврат Ложь;
	ИначеЕсли Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументаСообщениеSMS.ПустаяСсылка") Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
КонецФункции // смсСообщениеОтправлено()	

&НаКлиенте
// Процедура - обработчик команды
//
// Параметры:
//	ПараметрКоманды				- ДокументСсылка	- Сообщение СМС
//	ПараметрыВыполненияКоманды	- Структура			- Структура параметров команды
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если смсСообщениеОтправлено(ПараметрыВыполненияКоманды.Источник.Объект.Состояние) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Команда недоступна (сообщение уже отправлено)'"));
		Возврат;
	КонецЕсли;
	Форма				= ПараметрыВыполненияКоманды.Источник;	
	Адресаты			= Форма.Объект.Адресаты;
	ЕстьИзменения		= Ложь;
	КоличествоАдресатов	= Адресаты.Количество();
	Для НомерСтроки = 1 По КоличествоАдресатов Цикл
		СтрокаАдресата = Адресаты[КоличествоАдресатов - НомерСтроки];
		Если НЕ ПустаяСтрока(СтрокаАдресата.КакСвязаться) Тогда
			МассивСтрок = Адресаты.НайтиСтроки(Новый Структура("КакСвязаться", СтрокаАдресата.КакСвязаться));
			Если МассивСтрок.Количество() > 1 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Удален дублирующийся номер:'")
					+ СтрокаАдресата.КакСвязаться + НСтр("ru=' адресата: '") + СтрокаАдресата.ПредставлениеКонтакта); 
				Адресаты.Удалить(СтрокаАдресата);
				ЕстьИзменения = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	Если ЕстьИзменения Тогда
		Форма.КоличествоАдресатов	= Адресаты.Количество();
		Форма.ИзменилисьКонтакты	= Истина;
	КонецЕсли;	
КонецПроцедуры // ОбработкаКоманды()
