
Функция ПолучитьВременныйФайл()
	ИмяФайла = Новый УникальныйИдентификатор;
	Возврат КаталогВременныхФайлов() + ИмяФайла;
КонецФункции

Процедура РегистрацияОшибки(Знач ОписаниеОшибки, СистемаПолучатель = Неопределено) Экспорт
	Если Не (СистемаПолучатель = Неопределено) Тогда
		ОписаниеОшибки = "Система получатель: " + СистемаПолучатель + Символы.ПС + ОписаниеОшибки;
	КонецЕсли;

	ЗаписьЖурналаРегистрации("НСИ.ОшибкаСистемыОбмена", , , ОписаниеОшибки);

КонецПроцедуры

Функция ПолучитьТекущегоПользователя() Экспорт
	Перем ИмяПараметраСеанса;
	ИмяПараметраСеанса = Константы.НСИПараметрСеансаПользователь.Получить();

	Если Не ЗначениеЗаполнено(ИмяПараметраСеанса) Тогда
		ИмяПараметраСеанса = "ТекущийПользователь";
	КонецЕсли;

	Попытка
		Возврат ПараметрыСеанса[ИмяПараметраСеанса];
	Исключение
	КонецПопытки;

	Возврат "";

КонецФункции

Функция ВерсияНСИ() Экспорт
	Возврат "3.1.1";
КонецФункции

Функция ЭлементСоответствуетОтбору(НаименованиеОбъекта, Ссылка, Отбор) Экспорт
	Если Не ЗначениеЗаполнено(Отбор) Тогда
		Возврат Истина;
	КонецЕсли;


	Попытка
		СхемаКомпоновки = Новый СхемаКомпоновкиДанных;

		Источник = СхемаКомпоновки.ИсточникиДанных.Добавить();
		Источник.Имя = "ИсточникДанных";
		Источник.СтрокаСоединения = "";
		Источник.ТипИсточникаДанных = "Local";

		НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		НаборДанных.Имя = "НаборДанных";
		НаборДанных.ИсточникДанных = "ИсточникДанных";
		НаборДанных.Запрос = "ВЫБРАТЬ РАЗРЕШЕННЫЕ _.* ИЗ Справочник." + НаименованиеОбъекта + " КАК _ ГДЕ _.Ссылка = &Ссылка";

		ПолеНабораДанных = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабораДанных.Поле = "Ссылка";

		ИсточникДоступныхНастроекКомпоновкиДанных = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки);
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроекКомпоновкиДанных);
		КомпоновщикНастроек.ЗагрузитьНастройки(ЗначениеИзСтрокиВнутр(Отбор));

		Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Ссылка");
		Параметр.Использование = Истина;
		Параметр.Значение = Ссылка;


		ВыбранноеПолеКомпоновкиДанных = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
		ВыбранноеПолеКомпоновкиДанных.Использование = Истина;



		ГруппировкаНастроек = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		Поле = ГруппировкаНастроек.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));

		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;

		Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);

		Если Результат.Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	Исключение

		ОписаниеОшибки = ОписаниеОшибки();
		РегистрацияОшибки("Не удалось проверить отбор для " + НаименованиеОбъекта);
	КонецПопытки;

	Возврат Истина;

КонецФункции

Процедура НСИОтправкаИзменений() Экспорт
	ОтправитьИзменения();
КонецПроцедуры

Процедура НСИПрименитьИзменения(СписокИзменений = Неопределено) Экспорт
	Если Константы.НСИИспользоватьФоновыеЗадания.Получить() = Истина Тогда
		Параметры = Новый Массив;
		Параметры.Добавить(СписокИзменений);
		ФоновыеЗадания.Выполнить("НСИКлиентСервер.ПрименитьИзменения", Параметры, Новый УникальныйИдентификатор, "НСИ Применить изменения");
	Иначе
		ПрименитьИзменения(СписокИзменений);
	КонецЕсли;

КонецПроцедуры

Процедура НСИАрхивацияСправочникаИзмененийРеквизитов() Экспорт
	ДатаНачала = '00010101000000';
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(НСИАрхив.ДатаОкончания) КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.НСИАрхив КАК НСИАрхив";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаНачала = Выборка.ДатаОкончания;
	КонецЕсли;

	ДатаОкончания = ТекущаяДата() - 60 * 60 * 24 * Константы.НСИКоличествоДнейХраненияИстории.Получить();
	ЗаписьЖурналаРегистрации("Архивация справочника НСИИсторияИзмененияОбъектов", , , , "Период с " + ДатаНачала + " по " + ДатаОкончания);

	СжатьИсториюИзмененияОбъектов(ДатаНачала, ДатаОкончания);

КонецПроцедуры

Процедура НСИПередЗаписьюСправочникаПередЗаписью(Источник, Отказ) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Ссылка = Источник.Ссылка;

	ОбъектДляКонтроля = Неопределено;
	Если Не НСИКонтролироватьОбъект(Источник, ОбъектДляКонтроля) Тогда
		Возврат;
	КонецЕсли;

	ОписаниеОшибки = "";
	ЕстьИзменения = Ложь;

	ЕстьРеквизитыДляКонтроля = Ложь;

	Если Не ПроверитьИЗаписатьИзменениеОбъектаКонтроля(ОбъектДляКонтроля, Источник, ОписаниеОшибки, ЕстьИзменения, ЕстьРеквизитыДляКонтроля) Тогда
		Сообщить(ОписаниеОшибки);
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Не ЕстьИзменения Тогда
		Возврат;
	КонецЕсли;

	Если Не (ОбъектДляКонтроля.СистемаКонтролер = Константы.НСИТекущаяСистема.Получить()) И Источник.ЭтоНовый() Тогда
		Если ОтправитьИзменения(ОписаниеОшибки, ОбъектДляКонтроля.СистемаКонтролер, Истина) Тогда
			Сообщить("Запрос на добавление отправлен на утверждение");
		Иначе
			Сообщить("Ошибка отправки запроса на добавление");
			Сообщить(ОписаниеОшибки);
		КонецЕсли;
		Отказ = Истина;

	ИначеЕсли ЕстьРеквизитыДляКонтроля Тогда
		Сообщить("Запрос на изменение реквизитов справочника отправлен на утверждение");
	КонецЕсли;

КонецПроцедуры

Процедура НСИПередЗаписьюРегистраСведенийПередЗаписью(Источник, Отказ, Замещение) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОписаниеОшибки = "";
	ЕстьИзменения = Ложь;
	ЕстьРеквизитыДляКонтроля = Ложь;

	Для каждого СтрокаЗаписи Из Источник.ЭтотОбъект Цикл

		РеквизитыДляКонтроля = Неопределено;
		ОбъектДляКонтроля = Неопределено;
		ЭлементИзменения = Неопределено;


		Если Не НСИКонтролироватьСведения(Источник, СтрокаЗаписи, РеквизитыДляКонтроля, ОбъектДляКонтроля, ЭлементИзменения) Тогда
			Возврат;
		КонецЕсли;


		Если Не ПроверитьИЗаписатьИзменениеСведения(ОбъектДляКонтроля, РеквизитыДляКонтроля, ЭлементИзменения, Источник, СтрокаЗаписи, ОписаниеОшибки, ЕстьИзменения, ЕстьРеквизитыДляКонтроля) Тогда
			Сообщить(ОписаниеОшибки);
			Отказ = Истина;
			Возврат;
		КонецЕсли;

	КонецЦикла;

	Если ЕстьИзменения И ЕстьРеквизитыДляКонтроля Тогда
		Сообщить("Запрос на изменение сведений отправлен на утверждение");
	КонецЕсли;

КонецПроцедуры

Функция ПроверитьИЗаписатьИзменениеОбъектаКонтроля(ОбъектДляКонтроля, ЭлементИзменения, ОписаниеОшибки, ЕстьИзменения = Истина, ЕстьРеквизитыДляКонтроля = Ложь)
	СписокОбязательныхРеквизитов = Неопределено;


	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НСИРеквизитыОбъектов.Наименование КАК ИМЯ,
	               |	НСИРеквизитыОбъектов.ТипОбъектаСведений,
	               |	НСИРеквизитыОбъектов.ТипСсылочногоОбъекта,
	               |	НСИРеквизитыОбъектов.НаименованиеВСистемеКонтролере,
	               |	НСИРеквизитыОбъектов.ОбязательноеЗаполнение,
	               |	НСИРеквизитыОбъектов.СистемаКонтролер,
	               |	НСИРеквизитыОбъектов.РежимКонтроля,
	               |	НСИРеквизитыОбъектов.Ссылка,
	               |	НСИРеквизитыОбъектов.СоставКлючаПоиска.(
	               |		ИмяПоля,
	               |		ИмяПоляВКонтролере,
	               |		ТипСсылочногоОбъекта,
	               |		ОбъектДляКонтроля,
	               |		ТипЗначенияРеквизита
	               |	),
	               |	НСИРеквизитыОбъектов.ТипЗначенияРеквизита,
	               |	НСИРеквизитыОбъектов.НаименованиеОбъектаСведений,
	               |	НСИРеквизитыОбъектов.НаименованиеОбъектаСведенийВСистемеКонтролере
	               |ИЗ
	               |	Справочник.НСИРеквизитыОбъектов КАК НСИРеквизитыОбъектов
	               |ГДЕ
	               |	НСИРеквизитыОбъектов.Владелец = &ОбъектДляКонтроля
	               |	И НСИРеквизитыОбъектов.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("ОбъектДляКонтроля", ОбъектДляКонтроля.Ссылка);
	Реквизиты = Запрос.Выполнить().Выгрузить();

	Если ЭлементИзменения.ЭтоНовый() Тогда

		Отбор = Новый Структура("ОбязательноеЗаполнение", Истина);
		МассивОбязательныхПолей = Реквизиты.НайтиСтроки(Отбор);

		СписокОбязательныхРеквизитов = Новый СписокЗначений;

		Для к = 0 По МассивОбязательныхПолей.Количество() - 1 Цикл
			СписокОбязательныхРеквизитов.Добавить(МассивОбязательныхПолей[к].Имя);
		КонецЦикла;

	КонецЕсли;


	Попытка
		ТаблицаТабличныхЧастейСтрокДляУдаления = Новый ТаблицаЗначений;
		ТаблицаТабличныхЧастейСтрокДляУдаления.Колонки.Добавить("ИмяТабличнойЧасти");
		ТаблицаТабличныхЧастейСтрокДляУдаления.Колонки.Добавить("СтрокаДляУдаления");

		ЭлементИзмененияСcылка = ЭлементИзменения.Ссылка;

		ТекущаяСистема = Константы.НСИТекущаяСистема.Получить();
		ЕстьРеквизитыДляКонтроля = Ложь;

		Для каждого Реквизит Из Реквизиты Цикл

			Если Реквизит.ТипОбъектаСведений = Перечисления.НСИТипыРеквизитовОбъектов.ТабличнаяЧасть Тогда

				КоличествоСтрокОбъект = ЭлементИзменения[Реквизит.НаименованиеОбъектаСведений].Количество() - 1;
				КоличествоСтрокСсылка = ЭлементИзменения.Ссылка[Реквизит.НаименованиеОбъектаСведений].Количество() - 1;
				КоличествоСтрок = Макс(КоличествоСтрокОбъект, КоличествоСтрокСсылка);

				Для к = 0 По КоличествоСтрок Цикл

					Если к <= КоличествоСтрокОбъект Тогда
						НовоеЗначение = ЭлементИзменения[Реквизит.НаименованиеОбъектаСведений][к][Реквизит.Имя];
					Иначе
						ЭлементИзменения[Реквизит.НаименованиеОбъектаСведений].Добавить();
						НовоеЗначение = "";
					КонецЕсли;

					Если к <= КоличествоСтрокСсылка Тогда
						СтароеЗначение = ЭлементИзменения.Ссылка[Реквизит.НаименованиеОбъектаСведений][к][Реквизит.Имя];
					Иначе
						СтрокаТаблицаТабличныхЧастейСтрокДляУдаления = ТаблицаТабличныхЧастейСтрокДляУдаления.Добавить();
						СтрокаТаблицаТабличныхЧастейСтрокДляУдаления.ИмяТабличнойЧасти = Реквизит.НаименованиеОбъектаСведений;
						СтрокаТаблицаТабличныхЧастейСтрокДляУдаления.СтрокаДляУдаления = ЭлементИзменения[Реквизит.НаименованиеОбъектаСведений][к];

						СтароеЗначение = "";
					КонецЕсли;

					Если НовоеЗначение <> СтароеЗначение Тогда
						РежимКонтроля = ?(ЗначениеЗаполнено(Реквизит.РежимКонтроля), Реквизит.РежимКонтроля, ОбъектДляКонтроля.РежимКонтроля);
						Если РежимКонтроля = Перечисления.НСИРежимыКонтроля.Утверждение Тогда
							ЕстьРеквизитыДляКонтроля = Истина;
						КонецЕсли;
					КонецЕсли;


					Если Не ПроверитьИЗаписатьИзменениеРеквизита(ОбъектДляКонтроля, Реквизит, ЭлементИзмененияСcылка, ЭлементИзменения, ЭлементИзменения[Реквизит.НаименованиеОбъектаСведений][к], НовоеЗначение, СтароеЗначение, ОписаниеОшибки, СписокОбязательныхРеквизитов, ЕстьИзменения) Тогда
						Возврат Ложь;
					КонецЕсли;


				КонецЦикла;

			ИначеЕсли Реквизит.ТипОбъектаСведений = Перечисления.НСИТипыРеквизитовОбъектов.Простой Тогда

				НовоеЗначение = ЭлементИзменения[Реквизит.Имя];
				СтароеЗначение = ЭлементИзменения.Ссылка[Реквизит.Имя];

				Если НовоеЗначение <> СтароеЗначение Тогда
					РежимКонтроля = ?(ЗначениеЗаполнено(Реквизит.РежимКонтроля), Реквизит.РежимКонтроля, ОбъектДляКонтроля.РежимКонтроля);
					Если РежимКонтроля = Перечисления.НСИРежимыКонтроля.Утверждение Тогда
						ЕстьРеквизитыДляКонтроля = Истина;
					КонецЕсли;
				КонецЕсли;


				Если Не ПроверитьИЗаписатьИзменениеРеквизита(ОбъектДляКонтроля, Реквизит, ЭлементИзмененияСcылка, ЭлементИзменения, ЭлементИзменения, НовоеЗначение, СтароеЗначение, ОписаниеОшибки, СписокОбязательныхРеквизитов, ЕстьИзменения) Тогда
					Возврат Ложь;
				КонецЕсли;

			КонецЕсли;

		КонецЦикла;


		Если Не (СписокОбязательныхРеквизитов = Неопределено) И СписокОбязательныхРеквизитов.Количество() > 0 Тогда
			ОписаниеОшибки = "Не заполнены обязательные реквизиты";
			Возврат Ложь;
		КонецЕсли;
	Исключение

		ОписаниеОшибки = ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;

	Если Не ЭлементИзменения.ЭтоНовый() И Не (ОбъектДляКонтроля.СистемаКонтролер = Константы.НСИТекущаяСистема.Получить()) Тогда

		ТаблицаТабличныхЧастейСтрокДляУдаления.Свернуть("ИмяТабличнойЧасти,СтрокаДляУдаления");

		Для каждого Строка Из ТаблицаТабличныхЧастейСтрокДляУдаления Цикл
			ЭлементИзменения[Строка.ИмяТабличнойЧасти].Удалить(Строка.СтрокаДляУдаления);
		КонецЦикла;

	КонецЕсли;

	НСИОтправкаИзмененийВФоне(, , ЭлементИзменения);
	Возврат Истина;

КонецФункции

Функция ПроверитьИЗаписатьИзменениеСведения(ОбъектДляКонтроля, Реквизиты, ЭлементИзменения, Источник, СтрокаСведений, ОписаниеОшибки, ЕстьИзменения = Ложь, ЕстьРеквизитыДляКонтроля = Ложь)
	Попытка
		ЭлементИзмененияСсылка = ЭлементИзменения.Ссылка;

		Для каждого Реквизит Из Реквизиты Цикл

			НовоеЗначение = СтрокаСведений[Реквизит.Имя]; //123
			СтароеЗначение = ПолучитьСтароеЗначениеРегистраСведений(Источник, Реквизит.Имя, СтрокаСведений);
			ЭлементИзмененияСсылка = ЭлементИзменения.Ссылка;

			Если НовоеЗначение <> СтароеЗначение Тогда
				РежимКонтроля = ?(ЗначениеЗаполнено(Реквизит.РежимКонтроля), Реквизит.РежимКонтроля, ОбъектДляКонтроля.РежимКонтроля);
				Если РежимКонтроля = Перечисления.НСИРежимыКонтроля.Утверждение Тогда
					ЕстьРеквизитыДляКонтроля = Истина;
				КонецЕсли;
			КонецЕсли;

			Если Не ПроверитьИЗаписатьИзменениеРеквизита(ОбъектДляКонтроля, Реквизит, ЭлементИзмененияСсылка, ЭлементИзменения.ПолучитьОбъект(), СтрокаСведений, НовоеЗначение, СтароеЗначение, ОписаниеОшибки, , ЕстьИзменения) Тогда
				Возврат Ложь;
			КонецЕсли;

		КонецЦикла;
	Исключение

		ОписаниеОшибки = ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;


	Возврат Истина;

КонецФункции

Функция ПроверитьИЗаписатьИзменениеРеквизита(ОбъектДляКонтроля, РеквизитДляКонтроля, ЭлементИзмененияСсылка, ЭлементИзменения, ОбъектИзменения, НовоеЗначение, СтароеЗначение, ОписаниеОшибки, СписокОбязательныхРеквизитов = Неопределено, ЕстьИзменения = Ложь)
	Перем Элемент;
	Если НовоеЗначение <> СтароеЗначение Или ЭлементИзменения.ЭтоНовый() И РеквизитДляКонтроля.Имя = "Код" Тогда

		ЕстьИзменения = Истина;

		Если Не (СписокОбязательныхРеквизитов = Неопределено) Тогда
			Элемент = СписокОбязательныхРеквизитов.НайтиПоЗначению(РеквизитДляКонтроля.Имя);
			Если Не (Элемент = Неопределено) Тогда
				СписокОбязательныхРеквизитов.Удалить(Элемент);
			КонецЕсли;
		КонецЕсли;

		ОписаниеОшибки = "";

		Если ЗарегистрироватьИзменение(ОбъектДляКонтроля, РеквизитДляКонтроля, ЭлементИзмененияСсылка, ЭлементИзменения, ОбъектИзменения, СтароеЗначение, НовоеЗначение, ОписаниеОшибки) Тогда
			Если Не ЭлементИзменения.ЭтоНовый() Тогда
				ОбъектИзменения[РеквизитДляКонтроля.Имя] = НовоеЗначение;
			КонецЕсли;
			ПослатьСопутствующиеРеквизиты(ОбъектДляКонтроля, РеквизитДляКонтроля, ЭлементИзмененияСсылка, ЭлементИзменения, ОбъектИзменения, СтароеЗначение, НовоеЗначение, ОписаниеОшибки);//->Lexa 141113
		Иначе
			Возврат Ложь;
		КонецЕсли;

	КонецЕсли;

	Возврат Истина;

КонецФункции

Функция ЗарегистрироватьИзменение(ОбъектДляКонтроля, РеквизитДляКонтроля, Ссылка, ЭлементОбъект, ОбъектИзменения, СтароеЗначение, НовоеЗначение, ОписаниеОшибки, АвтоУтверждение = Ложь) Экспорт
	Перем СистемаКонтролер, РежимКонтроля, ТекущаяСистема;
	Попытка
		СистемаКонтролер = ?(ЗначениеЗаполнено(РеквизитДляКонтроля.СистемаКонтролер), РеквизитДляКонтроля.СистемаКонтролер, ОбъектДляКонтроля.СистемаКонтролер);
		РежимКонтроля = ?(ЗначениеЗаполнено(РеквизитДляКонтроля.РежимКонтроля), РеквизитДляКонтроля.РежимКонтроля, ОбъектДляКонтроля.РежимКонтроля);
		ТекущаяСистема = Константы.НСИТекущаяСистема.Получить();

		НоваяЗаписьИстория = Справочники.НСИИсторияИзмененияОбъектов.СоздатьЭлемент();
		НоваяЗаписьИстория.ДатаРегистрацииВСистемеИнициаторе = ТекущаяДата();
		Если СистемаКонтролер = ТекущаяСистема Тогда
			НоваяЗаписьИстория.ДатаРегистрацииВСистемеКонтролере = ТекущаяДата();
			Если РежимКонтроля = Перечисления.НСИРежимыКонтроля.Автоматически Или АвтоУтверждение Тогда
				НоваяЗаписьИстория.ДатаУтвержденияВСистемеКонтролере = ТекущаяДата();
				НоваяЗаписьИстория.Утверждено = Истина;
				НоваяЗаписьИстория.ПримененоВТекущейСистеме = Истина;
				НоваяЗаписьИстория.ДатаПримененияВТекущейСистеме = ТекущаяДата();
			КонецЕсли;
		КонецЕсли;
		// - ------- Тимофей 26062014
		ТекПользователь = ПолучитьТекущегоПользователя();
		НоваяЗаписьИстория.НовыйОбъект = ЭлементОбъект.ЭтоНовый();

		Если Ссылка = Неопределено Тогда
			Ссылка = ЭлементОбъект.Ссылка;
			НоваяЗаписьИстория.НовыйОбъект = Истина;
		КонецЕсли;

		НоваяЗаписьИстория.КлючПоиска = ЗначениеВСтрокуВнутр(ПолучитьТаблицуКлючейПоиска(ОбъектДляКонтроля, ЭлементОбъект, Ссылка, НоваяЗаписьИстория.НовыйОбъект));

		Если РеквизитДляКонтроля.ТипЗначенияРеквизита = Перечисления.НСИТипыЗначений.Справочник Тогда
			ТаблицаЗначенийСтруктураКлючаПоиска = ПолучитьСтруктуруКлючаПоиска(РеквизитДляКонтроля.НаименованиеВСистемеКонтролере, РеквизитДляКонтроля.ТипСсылочногоОбъекта, РеквизитДляКонтроля.ТипЗначенияРеквизита, НовоеЗначение);
			НоваяЗаписьИстория.КлючПоискаНовоеЗначение = ЗначениеВСтрокуВнутр(ТаблицаЗначенийСтруктураКлючаПоиска);
			ТаблицаЗначенийСтруктураКлючаПоиска = ПолучитьСтруктуруКлючаПоиска(РеквизитДляКонтроля.НаименованиеВСистемеКонтролере, РеквизитДляКонтроля.ТипСсылочногоОбъекта, РеквизитДляКонтроля.ТипЗначенияРеквизита, СтароеЗначение);
			НоваяЗаписьИстория.КлючПоискаСтароеЗначение = ЗначениеВСтрокуВнутр(ТаблицаЗначенийСтруктураКлючаПоиска);
		КонецЕсли;

		Если РеквизитДляКонтроля.ТипЗначенияРеквизита = Перечисления.НСИТипыЗначений.Перечисление Тогда
			ТаблицаЗначенийСтруктураКлючаПоиска = ПолучитьСтруктуруКлючаПоиска(РеквизитДляКонтроля.НаименованиеВСистемеКонтролере, РеквизитДляКонтроля.ТипСсылочногоОбъекта, РеквизитДляКонтроля.ТипЗначенияРеквизита, НовоеЗначение);
			НоваяЗаписьИстория.КлючПоискаНовоеЗначение = ЗначениеВСтрокуВнутр(ТаблицаЗначенийСтруктураКлючаПоиска);
			ТаблицаЗначенийСтруктураКлючаПоиска = ПолучитьСтруктуруКлючаПоиска(РеквизитДляКонтроля.НаименованиеВСистемеКонтролере, РеквизитДляКонтроля.ТипСсылочногоОбъекта, РеквизитДляКонтроля.ТипЗначенияРеквизита, СтароеЗначение);
			НоваяЗаписьИстория.КлючПоискаСтароеЗначение = ЗначениеВСтрокуВнутр(ТаблицаЗначенийСтруктураКлючаПоиска);
		КонецЕсли;

		Если РеквизитДляКонтроля.ТипОбъектаСведений = Перечисления.НСИТипыРеквизитовОбъектов.ТабличнаяЧасть Или РеквизитДляКонтроля.ТипОбъектаСведений = Перечисления.НСИТипыРеквизитовОбъектов.Сведения Тогда

			ВыборкаКлючейПоискаРеквизита = РеквизитДляКонтроля.СоставКлючаПоиска;
			ТаблицаЗначенийСтруктураКлючаПоиска = Неопределено;

			Для каждого ВыборкаКлючейПоискаРеквизита Из ВыборкаКлючейПоискаРеквизита Цикл
				Если ВыборкаКлючейПоискаРеквизита.ОбъектДляКонтроля Тогда
					ЗначениеЭлемента = Ссылка;
				Иначе
					ЗначениеЭлемента = ОбъектИзменения[ВыборкаКлючейПоискаРеквизита.ИмяПоля];
				КонецЕсли;
				ТаблицаЗначенийСтруктураКлючаПоиска = ПолучитьСтруктуруКлючаПоиска(ВыборкаКлючейПоискаРеквизита.ИмяПоляВКонтролере, ВыборкаКлючейПоискаРеквизита.ТипСсылочногоОбъекта, ВыборкаКлючейПоискаРеквизита.ТипЗначенияРеквизита, ЗначениеЭлемента, ТаблицаЗначенийСтруктураКлючаПоиска);
			КонецЦикла;
			НоваяЗаписьИстория.РасширениеКлючаПоиска = ЗначениеВСтрокуВнутр(ТаблицаЗначенийСтруктураКлючаПоиска);

		КонецЕсли;
        // Справочник НСИИсторияИзмененияОбъектов
		НоваяЗаписьИстория.НовоеЗначение = НовоеЗначение;
		НоваяЗаписьИстория.ОбъектИзменения = ОбъектДляКонтроля.Ссылка;
		НоваяЗаписьИстория.ПользовательИнициатор = ПолучитьТекущегоПользователя();
		НоваяЗаписьИстория.РеквизитИзменения = РеквизитДляКонтроля.Ссылка;
		// тдв
		//если РеквизитДляКонтроля.Ссылка.Наименование = "ЗначениеУсловия" тогда
		//	НоваяЗаписьИстория.РеквизитУсловия = ОбъектИзменения.ИмяУсловия.Ссылка;
		//иначе
		//	НоваяЗаписьИстория.РеквизитУсловия = РеквизитДляКонтроля.Ссылка.Наименование;
		//КонецЕсли;
		// тдв
		НоваяЗаписьИстория.СистемаИнициатор = ТекущаяСистема;
		НоваяЗаписьИстория.СистемаКонтролер = СистемаКонтролер;
		НоваяЗаписьИстория.СтароеЗначение = СтароеЗначение;
		НоваяЗаписьИстория.ЭлементИзменения = Ссылка;

		НоваяЗаписьИстория.Записать();
		НоваяЗаписьИстория.Код = НоваяЗаписьИстория.Ссылка.УникальныйИдентификатор();
		НоваяЗаписьИстория.Записать();
		
		//Если РеквизитДляКонтроля.Имя = "Блок" тогда
		//	НоваяЗаписьИстория.Утверждено = Истина;
		//	НоваяЗаписьИстория.Записать();
		//	
		//	СписокЗначений = Новый СписокЗначений;
		//	СписокЗначений.Добавить(НоваяЗаписьИстория.Ссылка);
		//	
		//	НСИКлиентСервер.НСИПрименитьИзменения(СписокЗначений);
		//	
		//конецЕсли;
		 

		// +++++ Тимофей 26062014
		Если Не (СистемаКонтролер = ТекущаяСистема И РежимКонтроля = Перечисления.НСИРежимыКонтроля.Утверждение) Или АвтоУтверждение = Истина Тогда
		//Если Не РежимКонтроля = Перечисления.НСИРежимыКонтроля.Утверждение Или АвтоУтверждение = Истина Тогда
			Если Не ЗарегистрироватьОчередьРассылки(НоваяЗаписьИстория, ОписаниеОшибки) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	Исключение

		ОписаниеОшибки = ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
     // +++++++++Тимофей
	Если Не (СистемаКонтролер = ТекущаяСистема И РежимКонтроля = Перечисления.НСИРежимыКонтроля.Автоматически) Тогда
	//Если Не (РежимКонтроля = Перечисления.НСИРежимыКонтроля.Автоматически) Тогда
		НовоеЗначение = СтароеЗначение;
	КонецЕсли;

	Возврат Истина;

КонецФункции

Функция ПолучитьСтароеЗначениеРегистраСведений(Источник, ИмяРеквизита, СтрокаСведений)
	//тдв 2014 июль	
	Если СокрЛП(Источник) = "РегистрСведенийНаборЗаписей.ит_ТорговыеТочки_Условия" тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ит_ТорговыеТочки_УсловияСрезПоследних.Период,
		|	ит_ТорговыеТочки_УсловияСрезПоследних.ТорговаяТочка,
		|	ит_ТорговыеТочки_УсловияСрезПоследних.ЗначениеУсловия,
		|	ит_ТорговыеТочки_УсловияСрезПоследних.ВидОплаты,
		|	ит_ТорговыеТочки_УсловияСрезПоследних.Валюта,
		|	ит_ТорговыеТочки_УсловияСрезПоследних.ИмяУсловия
		|ИЗ
		|	РегистрСведений.ит_ТорговыеТочки_Условия.СрезПоследних КАК ит_ТорговыеТочки_УсловияСрезПоследних
		|ГДЕ
		|	ит_ТорговыеТочки_УсловияСрезПоследних.ТорговаяТочка = &ТорговаяТочка
		|	И ит_ТорговыеТочки_УсловияСрезПоследних.ИмяУсловия = &ИмяУсловия";
		
		Запрос.УстановитьПараметр("ИмяУсловия", СтрокаСведений.ИмяУсловия);
		Запрос.УстановитьПараметр("ТорговаяТочка", СтрокаСведений.ТорговаяТочка);
		
		ТЗ = Запрос.Выполнить().Выгрузить();		
		Результат = Запрос.Выполнить();		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Возврат ВыборкаДетальныеЗаписи.ЗначениеУсловия;
		иначе
			Возврат Неопределено;
		КонецЕсли;
	//тдв 2014 июль
	иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Сведения." + ИмяРеквизита + " КАК ЗначениеРеквизита
		|ИЗ
		|	РегистрСведений." + Источник.Метаданные().Имя + " КАК Сведения
		|ГДЕ
		|";
		
		СуффиксИ = "";
		Для каждого СтрокаОтбора Из Источник.Отбор Цикл
			
			Запрос.Текст = Запрос.Текст + "
			|	" + СуффиксИ + " Сведения." + СтрокаОтбора.Имя + " = &" + СтрокаОтбора.Имя + "
			|";
			
			Запрос.УстановитьПараметр(СтрокаОтбора.Имя, СтрокаСведений[СтрокаОтбора.Имя]);
			
			СуффиксИ = " И ";
			
		КонецЦикла;
		
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Возврат Результат.ЗначениеРеквизита;
		Иначе
			Возврат Неопределено;
		КонецЕсли;		
	конецЕсли;	
		
КонецФункции

Функция НСИКонтролироватьСведения(Источник, СтрокаСведений, РеквизитыДляКонтроля, ОбъектДляКонтроля, ЭлементИзменения)
	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
	               |	НСИРеквизитыОбъектов.Наименование КАК ИМЯ,
	               |	НСИРеквизитыОбъектов.НаименованиеВСистемеКонтролере,
	               |	НСИРеквизитыОбъектов.СистемаКонтролер,
	               |	НСИРеквизитыОбъектов.РежимКонтроля,
	               |	НСИРеквизитыОбъектов.ОбязательноеЗаполнение,
	               |	НСИРеквизитыОбъектов.ТипОбъектаСведений,
	               |	НСИРеквизитыОбъектов.НаименованиеОбъектаСведений,
	               |	НСИРеквизитыОбъектов.НаименованиеОбъектаСведенийВСистемеКонтролере,
	               |	НСИРеквизитыОбъектов.ТипЗначенияРеквизита,
	               |	НСИРеквизитыОбъектов.ТипСсылочногоОбъекта,
	               |	НСИРеквизитыОбъектов.СоставКлючаПоиска.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		ИмяПоля,
	               |		ИмяПоляВКонтролере,
	               |		ТипЗначенияРеквизита,
	               |		ТипСсылочногоОбъекта,
	               |		ОбъектДляКонтроля
	               |	),
	               |	НСИРеквизитыОбъектов.Ссылка
	               |ИЗ
	               |	Справочник.НСИРеквизитыОбъектов КАК НСИРеквизитыОбъектов
	               |ГДЕ
	               |	НСИРеквизитыОбъектов.НаименованиеОбъектаСведений = &НаименованиеОбъектаСведений
	               |	И НСИРеквизитыОбъектов.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("НаименованиеОбъектаСведений", Источник.Метаданные().Имя);
	РезультатЗапроса = Запрос.Выполнить();
	РезультатТаблица = РезультатЗапроса.Выгрузить();

	ОбъектДляКонтроля = Неопределено;
	ЭлементИзменения = Неопределено;

	Если РезультатТаблица.Количество() > 0 Тогда

		Если РезультатТаблица[0].СоставКлючаПоиска.Количество() > 0 Тогда

			СтрокаПоискаОбъектаДляКонтроля = РезультатТаблица[0].СоставКлючаПоиска.Найти(Истина, "ОбъектДляКонтроля");
			Если Не (СтрокаПоискаОбъектаДляКонтроля = Неопределено) Тогда

				ЭлементИзменения = СтрокаСведений[СтрокаПоискаОбъектаДляКонтроля.ИмяПоля];
				Если Не (СтрокаСведений[СтрокаПоискаОбъектаДляКонтроля.ИмяПоля].Метаданные().Имя = СтрокаПоискаОбъектаДляКонтроля.ТипСсылочногоОбъекта.Наименование) Тогда
					Возврат Ложь;
				КонецЕсли;

				Если Не НСИКонтролироватьОбъект(ЭлементИзменения, ОбъектДляКонтроля) Тогда
					Возврат Ложь;
				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Если РезультатТаблица.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе
		РеквизитыДляКонтроля = РезультатТаблица;
		Возврат Истина;
	КонецЕсли;

КонецФункции

Функция НСИКонтролироватьОбъект(Объект, ОбъектДляКонтроля = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НСИОбъектыДляКонтроля.Наименование,
	               |	НСИОбъектыДляКонтроля.НаименованиеВСистемеКонтролере,
	               |	НСИОбъектыДляКонтроля.РежимКонтроля,
	               |	НСИОбъектыДляКонтроля.СистемаКонтролер,
	               |	НСИОбъектыДляКонтроля.Ссылка,
	               |	НСИОбъектыДляКонтроля.Отбор,
	               |	НСИОбъектыДляКонтроля.ТипОбъекта,
	               |	НСИОбъектыДляКонтроля.ПолучатьGUIDЗаписьюЭлемента
	               |ИЗ
	               |	Справочник.НСИОбъектыДляКонтроля КАК НСИОбъектыДляКонтроля
	               |ГДЕ
	               |	НСИОбъектыДляКонтроля.Наименование = &Наименование
	               |	И НСИОбъектыДляКонтроля.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("Наименование", Объект.Метаданные().Имя);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Ложь;
	Иначе

		Если Выборка.ТипОбъекта = Перечисления.НСИТипыОбъектов.Справочник И Не ЭлементСоответствуетОтбору(Выборка.Наименование, Объект.Ссылка, Выборка.Отбор) Тогда
			Возврат Ложь;
		КонецЕсли;

		ОбъектДляКонтроля = Выборка;
		Возврат Истина;
	КонецЕсли;

КонецФункции

Функция ОтправитьИзменения(ОписаниеОшибки = "", СистемаПолучатель = Неопределено, ТолькоНовые = Ложь, ЭлементИзменения = Неопределено) Экспорт

	Запрос = Новый Запрос;

	ТекстЗапроса = "ВЫБРАТЬ
	               |	НСИОчередьРегистрации.СистемаПолучатель.GUID,
	               |	НСИОчередьРегистрации.СистемаПолучатель.Наименование,
	               |	НСИОчередьРегистрации.СистемаПолучатель КАК СистемаПолучатель,
	               |	НСИОчередьРегистрации.СистемаПолучатель.Адрес,
	               |	НСИОчередьРегистрации.СистемаПолучатель.Пользователь,
	               |	НСИОчередьРегистрации.СистемаПолучатель.Пароль,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.ЭлементИзменения КАК ЭлементИзменения,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.КлючПоиска КАК КлючПоиска,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.СтароеЗначение КАК СтароеЗначение,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.НовоеЗначение КАК НовоеЗначение,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.ДатаРегистрацииВСистемеИнициаторе КАК ДатаРегистрацииВСистемеИнициаторе,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.ДатаРегистрацииВСистемеКонтролере КАК ДатаРегистрацииВСистемеКонтролере,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.ДатаУтвержденияВСистемеКонтролере КАК ДатаУтвержденияВСистемеКонтролере,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.ОбъектИзменения.НаименованиеВСистемеКонтролере КАК ОбъектИзмененияНаименованиеВСистемеКонтролере,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.РеквизитИзменения.НаименованиеВСистемеКонтролере КАК РеквизитИзмененияНаименованиеВСистемеКонтролере,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.СистемаИнициатор.GUID КАК СистемаИнициаторGUID,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.СистемаИнициатор.Наименование КАК СистемаИнициатор,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.СистемаКонтролер.GUID КАК СистемаКонтролерGUID,
	               |	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(НСИОчередьРегистрации.СтрокаИсторииИзменений.ПользовательКонтролер), """") КАК ПользовательКонтролер,
	               |	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(НСИОчередьРегистрации.СтрокаИсторииИзменений.ПользовательИнициатор), """") КАК ПользовательИнициатор,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.Утверждено КАК Утверждено,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.Отклонено КАК Отклонено,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.НовыйОбъект КАК НовыйОбъект,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.Код,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.Комментарий КАК Комментарий,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.КлючПоискаНовоеЗначение КАК КлючПоискаНовоеЗначение,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.КлючПоискаСтароеЗначение КАК КлючПоискаСтароеЗначение,
	               |	НСИОчередьРегистрации.СтрокаИсторииИзменений.РасширениеКлючаПоиска КАК РасширениеКлючаПоиска
	               |ИЗ
	               |	РегистрСведений.НСИОчередьРегистрации КАК НСИОчередьРегистрации
	               |ГДЕ
	               |	&УсловиеЗапроса
	               |ИТОГИ ПО
	               |	СистемаПолучатель";

	//было добавлено у тдв в блок ГДЕ			   
	//пока уберем
	//|	И НСИОчередьРегистрации.СтрокаИсторииИзменений.Утверждено
	
	УсловиеЗапроса = "ИСТИНА";

	Если ТолькоНовые Тогда
		УсловиеЗапроса = "НСИОчередьРегистрации.СтрокаИсторииИзменений.НовыйОбъект";
	КонецЕсли;

	Если Не (СистемаПолучатель = Неопределено) Тогда
		УсловиеЗапроса = ?(УсловиеЗапроса = "ИСТИНА", "", УсловиеЗапроса + " И ") + "НСИОчередьРегистрации.СистемаПолучатель = &СистемаПолучатель";
		Запрос.УстановитьПараметр("СистемаПолучатель", СистемаПолучатель);
	КонецЕсли;

	Если Не (ЭлементИзменения = Неопределено) Тогда
		УсловиеЗапроса = ?(УсловиеЗапроса = "ИСТИНА", "", УсловиеЗапроса + " И ") + "НСИОчередьРегистрации.СтрокаИсторииИзменений.ЭлементИзменения = &ЭлементИзменения";
		Запрос.УстановитьПараметр("ЭлементИзменения", ЭлементИзменения.Ссылка);
	КонецЕсли;

	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&УсловиеЗапроса", УсловиеЗапроса);

	Попытка
		ВыборкаСистем = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		РегистрацияОшибки(ОписаниеОшибки);
		Возврат Ложь;
	КонецПопытки;

	ОшибкаОтправки = Ложь;
	Пока ВыборкаСистем.Следующий() Цикл

		ВыборкаИзменений = ВыборкаСистем.Выбрать();
		Если ВыборкаИзменений.Количество() > 0 Тогда

			РегистрацияОшибки("Отправка в систему " + ВыборкаСистем.СистемаПолучатель);

			Если Не ОтправитьИзмененияВСистемуПолучатель(ВыборкаСистем, ВыборкаИзменений, ОписаниеОшибки) Тогда
				ОшибкаОтправки = Истина;
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Возврат Не ОшибкаОтправки;

КонецФункции

Процедура НСИОтправкаИзмененийВФоне(СистемаКонтролер = Неопределено, ТолькоНовые = Ложь, ЭлементИзменения = Неопределено) Экспорт
	Если Константы.НСИИспользоватьФоновыеЗадания.Получить() = Истина Тогда

		Параметры = Новый Массив;
		ОписаниеОшибки = "";
		Параметры.Добавить(ОписаниеОшибки);
		Параметры.Добавить(СистемаКонтролер);
		Параметры.Добавить(ТолькоНовые);
		Параметры.Добавить(ЭлементИзменения);

		Попытка
			ФоновыеЗадания.Выполнить("НСИКлиентСервер.ОтправитьИзменения", Параметры, Новый УникальныйИдентификатор, "НСИ Отправить изменения");
			Возврат;
		Исключение
		КонецПопытки;

	КонецЕсли;

	ОтправитьИзменения(ОписаниеОшибки, СистемаКонтролер, ТолькоНовые, ЭлементИзменения);

	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		РегистрацияОшибки(ОписаниеОшибки);
	КонецЕсли;

КонецПроцедуры

Функция ЗаполнитьДанныеДляОтправки(WSПроксиФабрикаXDTO, ВыборкаСистем, ВыборкаИзменений)
	URI = "http://1c.ru/NSIExchange";

	RecordsТип = WSПроксиФабрикаXDTO.Тип(URI, "Records");
	ЗаписьОбъектТип = WSПроксиФабрикаXDTO.Тип(URI, "RecordObject");
	ЭлементПолеЗначениеТип = WSПроксиФабрикаXDTO.Тип(URI, "ItemArrayOfFieldsAndValues");
	ЭлементСсылкаТип = WSПроксиФабрикаXDTO.Тип(URI, "LinkObject");
	IntТип = WSПроксиФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema", "int");
	СтрокаТип = WSПроксиФабрикаXDTO.Тип("http://www.w3.org/2001/XMLSchema", "string");

	Records = WSПроксиФабрикаXDTO.Создать(RecordsТип);
	ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
	ЭлементПолеЗначение.Field = "GUID";
	ЭлементПолеЗначение.Value = ВыборкаСистем.СистемаПолучательGUID;
	Records.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

	ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
	ЭлементПолеЗначение.Field = "Наименование";
	ЭлементПолеЗначение.Value = ВыборкаСистем.СистемаПолучательНаименование;
	Records.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

	НаименованиеЭлемента = "";

	Пока ВыборкаИзменений.Следующий() Цикл

		РегистрацияОшибки("Отправка реквизита """ + ВыборкаИзменений.РеквизитИзмененияНаименованиеВСистемеКонтролере + """ с новым значением """ + ВыборкаИзменений.НовоеЗначение + """");

		ЗаписьХДТО = WSПроксиФабрикаXDTO.Создать(ЗаписьОбъектТип);

		ТаблицаКлюча = ЗначениеИзСтрокиВнутр(ВыборкаИзменений.КлючПоиска);

		Для каждого СтрокаКлюча Из ТаблицаКлюча Цикл

			ЭлементКлючаПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
			ЭлементКлючаПолеЗначение.Field = СтрокаКлюча.ИмяПоля;
			ЭлементКлючаПолеЗначение.Value = СтрокаКлюча.Значение;

			Если СтрокаКлюча.ИмяПоля = "GUID" Тогда
				GUID = "";
				Если ПолучитьGUIDПоСоответствиюОбъектов(ВыборкаИзменений.ЭлементИзменения, ВыборкаСистем.СистемаПолучатель, GUID) Тогда
					ЭлементКлючаПолеЗначение.Value = GUID;
				КонецЕсли;
			КонецЕсли;

			ЗаписьХДТО.ArrayKeySearch.Добавить(ЭлементКлючаПолеЗначение);

			Если СтрокаКлюча.ИмяПоля = "Наименование" Тогда
				НаименованиеЭлемента = СтрокаКлюча.Значение;
			КонецЕсли;

		КонецЦикла;

		Если ЗначениеЗаполнено(ВыборкаИзменений.КлючПоискаНовоеЗначение) Тогда
			ТаблицаКлюча = ЗначениеИзСтрокиВнутр(ВыборкаИзменений.КлючПоискаНовоеЗначение);
			ЗаполнитьСтруктуруXDTOКлючаПоиска(WSПроксиФабрикаXDTO, ЗаписьХДТО.ArrayNewValueLink, ТаблицаКлюча, ЭлементСсылкаТип, ЭлементПолеЗначениеТип, ВыборкаСистем.СистемаПолучатель);
		КонецЕсли;

		Если ЗначениеЗаполнено(ВыборкаИзменений.КлючПоискаСтароеЗначение) Тогда
			ТаблицаКлюча = ЗначениеИзСтрокиВнутр(ВыборкаИзменений.КлючПоискаСтароеЗначение);
			ЗаполнитьСтруктуруXDTOКлючаПоиска(WSПроксиФабрикаXDTO, ЗаписьХДТО.ArrayOldValueLink, ТаблицаКлюча, ЭлементСсылкаТип, ЭлементПолеЗначениеТип, ВыборкаСистем.СистемаПолучатель);
		КонецЕсли;

		Если ЗначениеЗаполнено(ВыборкаИзменений.РасширениеКлючаПоиска) Тогда
			ТаблицаКлюча = ЗначениеИзСтрокиВнутр(ВыборкаИзменений.РасширениеКлючаПоиска);
			ЗаполнитьСтруктуруXDTOКлючаПоиска(WSПроксиФабрикаXDTO, ЗаписьХДТО.ArrayExtKeySearch, ТаблицаКлюча, ЭлементСсылкаТип, ЭлементПолеЗначениеТип, ВыборкаСистем.СистемаПолучатель);
		КонецЕсли;

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "СтрокаИсторииИзмененийКод";
		ЭлементПолеЗначение.Value = ВыборкаИзменений.СтрокаИсторииИзмененийКод;
		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "СтароеЗначение";
		Если ЗначениеЗаполнено(ВыборкаИзменений.СтароеЗначение) Тогда

			Если ТипЗнч(ВыборкаИзменений.НовоеЗначение) = Тип("Дата") Или ТипЗнч(ВыборкаИзменений.НовоеЗначение) = Тип("Число") Тогда
				ЭлементПолеЗначение.Value = ВыборкаИзменений.СтароеЗначение;
			Иначе
				ЭлементПолеЗначение.Value = Строка(ВыборкаИзменений.СтароеЗначение);
			КонецЕсли;
		Иначе

			ЭлементПолеЗначение.Value = "";
		КонецЕсли;

		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "НовоеЗначение";
		Если ЗначениеЗаполнено(ВыборкаИзменений.НовоеЗначение) Тогда
			Если ТипЗнч(ВыборкаИзменений.НовоеЗначение) = Тип("Дата") Или ТипЗнч(ВыборкаИзменений.НовоеЗначение) = Тип("Число") Тогда
				ЭлементПолеЗначение.Value = ВыборкаИзменений.НовоеЗначение;
			Иначе
				ЭлементПолеЗначение.Value = Строка(ВыборкаИзменений.НовоеЗначение);
			КонецЕсли;
		Иначе

			ЭлементПолеЗначение.Value = "";
		КонецЕсли;
		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "ДатаРегистрацииВСистемеИнициаторе";
		ЭлементПолеЗначение.Value = ВыборкаИзменений.ДатаРегистрацииВСистемеИнициаторе;
		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "ДатаРегистрацииВСистемеКонтролере";
		ЭлементПолеЗначение.Value = ВыборкаИзменений.ДатаРегистрацииВСистемеКонтролере;
		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "ДатаУтвержденияВСистемеКонтролере";
		ЭлементПолеЗначение.Value = ВыборкаИзменений.ДатаУтвержденияВСистемеКонтролере;
		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "ОбъектИзмененияНаименованиеВСистемеКонтролере";
		ЭлементПолеЗначение.Value = ВыборкаИзменений.ОбъектИзмененияНаименованиеВСистемеКонтролере;
		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "РеквизитИзмененияНаименованиеВСистемеКонтролере";
		ЭлементПолеЗначение.Value = ВыборкаИзменений.РеквизитИзмененияНаименованиеВСистемеКонтролере;
		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "СистемаИнициаторGUID";
		ЭлементПолеЗначение.Value = ВыборкаИзменений.СистемаИнициаторGUID;
		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "СистемаКонтролерGUID";
		ЭлементПолеЗначение.Value = ВыборкаИзменений.СистемаКонтролерGUID;
		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "ПользовательКонтролер";
		ЭлементПолеЗначение.Value = ВыборкаИзменений.ПользовательКонтролер;
		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "ПользовательИнициатор";
		ЭлементПолеЗначение.Value = ВыборкаИзменений.ПользовательИнициатор;
		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "Утверждено";
		ЭлементПолеЗначение.Value = ВыборкаИзменений.Утверждено;

		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "Отклонено";
		ЭлементПолеЗначение.Value = ВыборкаИзменений.Отклонено;
		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "ЭлементИзменения";
		ЭлементПолеЗначение.Value = НаименованиеЭлемента;
		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "НовыйОбъект";
		ЭлементПолеЗначение.Value = ВыборкаИзменений.НовыйОбъект;
		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		ЭлементПолеЗначение = WSПроксиФабрикаXDTO.Создать(ЭлементПолеЗначениеТип);
		ЭлементПолеЗначение.Field = "Комментарий";
		ЭлементПолеЗначение.Value = ВыборкаИзменений.Комментарий;
		ЗаписьХДТО.ArrayOfFieldsAndValues.Добавить(ЭлементПолеЗначение);

		Records.ArrayOfRecords.Добавить(ЗаписьХДТО);

	КонецЦикла;

	Возврат Records;

КонецФункции

Функция СохранитьДанныеДляОтправкиВФайл(СтрокиИсторииИзменения, ПутьКФайлу) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НСИИсторияИзмененияОбъектов.ЭлементИзменения КАК ЭлементИзменения,
	|	НСИИсторияИзмененияОбъектов.КлючПоиска КАК КлючПоиска,
	|	НСИИсторияИзмененияОбъектов.СтароеЗначение КАК СтароеЗначение,
	|	НСИИсторияИзмененияОбъектов.НовоеЗначение КАК НовоеЗначение,
	|	НСИИсторияИзмененияОбъектов.ДатаРегистрацииВСистемеИнициаторе КАК ДатаРегистрацииВСистемеИнициаторе,
	|	НСИИсторияИзмененияОбъектов.ДатаРегистрацииВСистемеКонтролере КАК ДатаРегистрацииВСистемеКонтролере,
	|	НСИИсторияИзмененияОбъектов.ДатаУтвержденияВСистемеКонтролере КАК ДатаУтвержденияВСистемеКонтролере,
	|	НСИИсторияИзмененияОбъектов.ОбъектИзменения.НаименованиеВСистемеКонтролере КАК ОбъектИзмененияНаименованиеВСистемеКонтролере,
	|	НСИИсторияИзмененияОбъектов.РеквизитИзменения.НаименованиеВСистемеКонтролере КАК РеквизитИзмененияНаименованиеВСистемеКонтролере,
	|	НСИИсторияИзмененияОбъектов.СистемаИнициатор.GUID КАК СистемаИнициаторGUID,
	|	НСИИсторияИзмененияОбъектов.СистемаИнициатор.Наименование КАК СистемаИнициатор,
	|	НСИИсторияИзмененияОбъектов.СистемаКонтролер.GUID КАК СистемаКонтролерGUID,
	|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(НСИИсторияИзмененияОбъектов.ПользовательКонтролер), """") КАК ПользовательКонтролер,
	|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(НСИИсторияИзмененияОбъектов.ПользовательИнициатор), """") КАК ПользовательИнициатор,
	|	НСИИсторияИзмененияОбъектов.Утверждено КАК Утверждено,
	|	НСИИсторияИзмененияОбъектов.Отклонено КАК Отклонено,
	|	НСИИсторияИзмененияОбъектов.НовыйОбъект КАК НовыйОбъект,
	|	НСИИсторияИзмененияОбъектов.Код КАК СтрокаИсторииИзмененийКод,
	|	НСИИсторияИзмененияОбъектов.Комментарий КАК Комментарий,
	|	НСИИсторияИзмененияОбъектов.КлючПоискаНовоеЗначение КАК КлючПоискаНовоеЗначение,
	|	НСИИсторияИзмененияОбъектов.КлючПоискаСтароеЗначение КАК КлючПоискаСтароеЗначение,
	|	НСИИсторияИзмененияОбъектов.РасширениеКлючаПоиска КАК РасширениеКлючаПоиска
	|ИЗ
	|	Справочник.НСИИсторияИзмененияОбъектов КАК НСИИсторияИзмененияОбъектов
	|ГДЕ
	|	НСИИсторияИзмененияОбъектов.Ссылка В(&Ссылка)";
	Запрос.УстановитьПараметр("Ссылка", СтрокиИсторииИзменения);

	ВыборкаИзменений = Запрос.Выполнить().Выбрать();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НСИИспользуемыеСистемы.GUID КАК СистемаПолучательGUID,
	|	НСИИспользуемыеСистемы.Наименование КАК СистемаПолучательНаименование,
	|	НСИИспользуемыеСистемы.Ссылка КАК СистемаПолучатель
	|ИЗ
	|	Справочник.НСИИспользуемыеСистемы КАК НСИИспользуемыеСистемы
	|ГДЕ
	|	НСИИспользуемыеСистемы.Ссылка = &Ссылка";

	ТекущаяСистема = Константы.НСИТекущаяСистема.Получить();
	Запрос.УстановитьПараметр("Ссылка", ТекущаяСистема);
	ВыборкаСистем = Запрос.Выполнить().Выбрать();
	ВыборкаСистем.Следующий();

	ОписаниеОшибки = "";

	WSПроксиФабрикаXDTO = ФабрикаXDTO;

	Records = ЗаполнитьДанныеДляОтправки(ФабрикаXDTO, ВыборкаСистем, ВыборкаИзменений);

	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ПутьКФайлу);
	WSПроксиФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Records);
	ЗаписьXML.Закрыть();

	Возврат ОписаниеОшибки;

КонецФункции

Функция ОтправитьИзмененияВСистемуПолучатель(ВыборкаСистем, ВыборкаИзменений, ОписаниеОшибки = "")
	Перем WSПрокси;
	Если ВыборкаСистем.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;

	WSПрокси = ПолучитьWSПроксиПоПараметрамПодключения(ВыборкаСистем.СистемаПолучатель, ОписаниеОшибки);

	Если WSПрокси = Неопределено Тогда
		РегистрацияОшибки(ОписаниеОшибки, ВыборкаСистем.СистемаПолучатель);
		Возврат Ложь;
	КонецЕсли;

	Если ВыборкаСистем.СистемаПолучатель.ФорматОбмена = Перечисления.НСИФорматыОбмена.XML Тогда
		WSПроксиФабрикаXDTO = ФабрикаXDTO;
	Иначе
		WSПроксиФабрикаXDTO = WSПрокси.ФабрикаXDTO;
	КонецЕсли;

	Records = ЗаполнитьДанныеДляОтправки(WSПроксиФабрикаXDTO, ВыборкаСистем, ВыборкаИзменений);


	Попытка
		ВызываемыйМетод = ВыборкаСистем.СистемаПолучатель.ВызываемыйМетод;

		Если ВыборкаСистем.СистемаПолучатель.ФорматОбмена = Перечисления.НСИФорматыОбмена.XML Тогда
			ЗаписьXML = Новый ЗаписьXML;
			ИмяФайла = Новый УникальныйИдентификатор;
			ВременныйФайл = КаталогВременныхФайлов() + ИмяФайла;

			ЗаписьXML.ОткрытьФайл(ВременныйФайл);
			WSПроксиФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Records);
			ЗаписьXML.Закрыть();

			Текст = Новый ТекстовыйДокумент;
			Текст.Прочитать(ВременныйФайл, КодировкаТекста.UTF8);
			Records = Текст.ПолучитьТекст();

			УдалитьФайлы(ВременныйФайл);

			Если ВызываемыйМетод = "" Или ВызываемыйМетод = "NSIRecordEditXML" Тогда
				ОписаниеОшибки = WSПрокси.NSIRecordEditXML(Records);
			Иначе
				Выполнить("ОписаниеОшибки = WSПрокси." + ВызываемыйМетод + "(Records)");
			КонецЕсли;
		Иначе

			Если ВызываемыйМетод = "" Или ВызываемыйМетод = "NSIRecordEdit" Тогда
				ОписаниеОшибки = WSПрокси.NSIRecordEdit(Records);
			Иначе
				Выполнить("ОписаниеОшибки = WSПрокси." + ВызываемыйМетод + "(Records)");
			КонецЕсли;

		КонецЕсли;
	Исключение

		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;

	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		РегистрацияОшибки(ОписаниеОшибки, ВыборкаСистем.СистемаПолучатель);
		Возврат Ложь;
	Иначе
		ОчиститьОчередьРегистрации(ВыборкаСистем.СистемаПолучатель);
	КонецЕсли;

	Возврат Истина;

КонецФункции

Функция ПолучитьGUIDПоСоответствиюОбъектов(ЭлементИзменения, СистемаПолучатель, GUID)
	Если Не ЗначениеЗаполнено(ЭлементИзменения) Или Не ЗначениеЗаполнено(СистемаПолучатель) Тогда
		Возврат Ложь;
	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
	|	НСИСоответствиеОбъектов.GUID
	|ИЗ
	|	РегистрСведений.НСИСоответствиеОбъектов КАК НСИСоответствиеОбъектов
	|ГДЕ
	|	НСИСоответствиеОбъектов.Объект = &ЭлементИзменения
	|	И НСИСоответствиеОбъектов.Система = &СистемаПолучатель";


	Запрос.УстановитьПараметр("ЭлементИзменения", ЭлементИзменения);
	Запрос.УстановитьПараметр("СистемаПолучатель", СистемаПолучатель);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда

		Если Не ПустаяСтрока(Выборка.GUID) Тогда
			GUID = Выборка.GUID;
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе

		Возврат Ложь;
	КонецЕсли;

КонецФункции

Функция ЗаполнитьСтруктуруXDTOКлючаПоиска(ТекущаяФабрикаXDTO, ЗаписьХДТОМассивКлюча, ТаблицаКлюча, ЭлементСсылкаТип, ЭлементКлючаПолеЗначениеТип, СистемаПолучатель)
	Для каждого СтрокаКлюча Из ТаблицаКлюча Цикл

		ЭлементКлюча = ТекущаяФабрикаXDTO.Создать(ЭлементСсылкаТип);

		ЭлементКлючаПолеЗначение = ТекущаяФабрикаXDTO.Создать(ЭлементКлючаПолеЗначениеТип);
		ЭлементКлючаПолеЗначение.Field = "ИмяПоляВКонтролере";
		ЭлементКлючаПолеЗначение.Value = СтрокаКлюча.ИмяПоляВКонтролере;
		ЭлементКлюча.ArrayOfFieldsAndValues.Добавить(ЭлементКлючаПолеЗначение);

		ЭлементКлючаПолеЗначение = ТекущаяФабрикаXDTO.Создать(ЭлементКлючаПолеЗначениеТип);
		ЭлементКлючаПолеЗначение.Field = "Значение";
		ЭлементКлючаПолеЗначение.Value = СтрокаКлюча.Значение;
		ЭлементКлюча.ArrayOfFieldsAndValues.Добавить(ЭлементКлючаПолеЗначение);

		ЭлементКлючаПолеЗначение = ТекущаяФабрикаXDTO.Создать(ЭлементКлючаПолеЗначениеТип);
		ЭлементКлючаПолеЗначение.Field = "ТипОбъекта";
		ЭлементКлючаПолеЗначение.Value = ?(ЗначениеЗаполнено(СтрокаКлюча.ТипОбъекта), СтрокаКлюча.ТипОбъекта, "");
		ЭлементКлюча.ArrayOfFieldsAndValues.Добавить(ЭлементКлючаПолеЗначение);

		ЭлементКлючаПолеЗначение = ТекущаяФабрикаXDTO.Создать(ЭлементКлючаПолеЗначениеТип);
		ЭлементКлючаПолеЗначение.Field = "ТипЗначения";
		ЭлементКлючаПолеЗначение.Value = СтрокаКлюча.ТипЗначения;
		ЭлементКлюча.ArrayOfFieldsAndValues.Добавить(ЭлементКлючаПолеЗначение);

		Если ЗначениеЗаполнено(СтрокаКлюча.КлючПоиска) Тогда

			Для каждого СтрокаВложенногоКлюча Из СтрокаКлюча.КлючПоиска Цикл

				Если СтрокаВложенногоКлюча.ИмяПоля = "GUID" Тогда
					Продолжить;
				КонецЕсли;

				ЭлементКлючаПолеЗначение = ТекущаяФабрикаXDTO.Создать(ЭлементКлючаПолеЗначениеТип);
				ЭлементКлючаПолеЗначение.Field = СтрокаВложенногоКлюча.ИмяПоля;
				Если ЗначениеЗаполнено(СтрокаВложенногоКлюча.Значение) Тогда
					ЭлементКлючаПолеЗначение.Value = СтрокаВложенногоКлюча.Значение;
				Иначе
					ЭлементКлючаПолеЗначение.Value = "";
				КонецЕсли;

				ЭлементКлюча.ArrayKeySearch.Добавить(ЭлементКлючаПолеЗначение);

			КонецЦикла;


			Отбор = Новый Структура("ИмяПоля", "GUID");

			МассивСтрокGUID = СтрокаКлюча.КлючПоиска.НайтиСтроки(Отбор);

			СтрокаПоУмолчанию = Неопределено;
			СтрокаСистемыПолучателя = Неопределено;
			СтрокаДляПередачи = Неопределено;


			Попытка
				Для к = 0 По МассивСтрокGUID.Количество() - 1 Цикл

					Если Не ЗначениеЗаполнено(МассивСтрокGUID[к].СистемаПолучатель) Тогда
						СтрокаПоУмолчанию = МассивСтрокGUID[к];
					ИначеЕсли МассивСтрокGUID[к].СистемаПолучатель = СистемаПолучатель Тогда
						СтрокаСистемыПолучателя = МассивСтрокGUID[к];
					КонецЕсли;

				КонецЦикла;

				Если Не (СтрокаСистемыПолучателя = Неопределено) Тогда
					СтрокаДляПередачи = СтрокаСистемыПолучателя;
				ИначеЕсли Не (СтрокаПоУмолчанию = Неопределено) Тогда
					СтрокаДляПередачи = СтрокаПоУмолчанию;
				КонецЕсли;
			Исключение

				Для к = 0 По МассивСтрокGUID.Количество() - 1 Цикл
					СтрокаДляПередачи = МассивСтрокGUID[к];
					Прервать;
				КонецЦикла;

			КонецПопытки;

			Если Не (СтрокаДляПередачи = Неопределено) Тогда

				ЭлементКлючаПолеЗначение = ТекущаяФабрикаXDTO.Создать(ЭлементКлючаПолеЗначениеТип);
				ЭлементКлючаПолеЗначение.Field = СтрокаДляПередачи.ИмяПоля;
				Если ЗначениеЗаполнено(СтрокаДляПередачи.Значение) Тогда
					ЭлементКлючаПолеЗначение.Value = СтрокаДляПередачи.Значение;
				Иначе
					ЭлементКлючаПолеЗначение.Value = "";
				КонецЕсли;

				ЭлементКлюча.ArrayKeySearch.Добавить(ЭлементКлючаПолеЗначение);

			КонецЕсли;

		КонецЕсли;

		ЗаписьХДТОМассивКлюча.Добавить(ЭлементКлюча);

	КонецЦикла;

КонецФункции

Функция ПолучитьWSПроксиПоПараметрамПодключения(СистемаПолучатель, СтрокаСообщенияОбОшибке = "") Экспорт
	МестоположениеXDTO = СокрЛП(СистемаПолучатель.Адрес);
	ИмяВебСервиса = ?(ЗначениеЗаполнено(СистемаПолучатель.ИмяВебСервиса), СистемаПолучатель.ИмяВебСервиса, "NSIService");

	Попытка
		Определение = Новый WSОпределения(МестоположениеXDTO, СокрЛП(СистемаПолучатель.Пользователь), СокрЛП(СистемаПолучатель.Пароль));




		WSПрокси = Новый WSПрокси(Определение, "http://1c.ru/NSIExchange", ИмяВебСервиса, "NSIServiceSoap", СистемаПолучатель.Таймаут);
		WSПрокси.Пользователь = СокрЛП(СистемаПолучатель.Пользователь);
		WSПрокси.Пароль = СокрЛП(СистемаПолучатель.Пароль);
	Исключение
		СтрокаСообщенияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Неопределено;
	КонецПопытки;

	Возврат WSПрокси;

КонецФункции

Процедура ОчиститьОчередьРегистрации(СистемаПолучатель)
	Отбор = Новый Структура("СистемаПолучатель", СистемаПолучатель);
	Выборка = РегистрыСведений.НСИОчередьРегистрации.Выбрать(Отбор);

	НачатьТранзакцию();

	Пока Выборка.Следующий() Цикл
		Выборка.ПолучитьМенеджерЗаписи().Удалить();
	КонецЦикла;

	ЗафиксироватьТранзакцию();

КонецПроцедуры

Функция ПринятьИзменения(Записи, ОписаниеОшибки = "") Экспорт
	Если Не НСИСервер.ЛицензияКорректна() Тогда
		ОписаниеОшибки = "Ошибка проверки лицензии";
		Возврат Ложь;
	КонецЕсли;

	ТекущаяСистемаПолучатель = Ложь;

	НСИТекущаяСистема = Константы.НСИТекущаяСистема.Получить();

	Если НСИТекущаяСистема.ФорматОбмена = Перечисления.НСИФорматыОбмена.XML Тогда

		ВременныйФайл = ПолучитьВременныйФайл();

		Текст = Новый ТекстовыйДокумент;
		Текст.УстановитьТекст(Записи);
		Текст.Записать(ВременныйФайл, КодировкаТекста.UTF8);

		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ВременныйФайл);

		URI = "http://1c.ru/NSIExchange";
		RecordsТип = ФабрикаXDTO.Тип(URI, "Records");

		Записи = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, RecordsТип);
		ЧтениеXML.Закрыть();

		УдалитьФайлы(ВременныйФайл);

	КонецЕсли;

	Для каждого СтрокаНастроек Из Записи.ArrayOfFieldsAndValues Цикл
		GUIDТекущейСистемы = НСИТекущаяСистема.GUID;
		Если СтрокаНастроек.Field = "GUID" Тогда
			Если СтрокаНастроек.Value = GUIDТекущейСистемы Тогда
				ТекущаяСистемаПолучатель = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если Не ТекущаяСистемаПолучатель Тогда
		ОписаниеОшибки = "Текущая система не является получателем изменений";
		Возврат Ложь;
	КонецЕсли;

	СписокИзменений = Новый СписокЗначений;

	Попытка
		Для каждого СтрокаЗаписи Из Записи.ArrayOfRecords Цикл

			ОписаниеОшибки = "";
			СтруктураПараметров = Новый Структура;

			Для каждого СтрокаПараметров Из СтрокаЗаписи.ArrayOfFieldsAndValues Цикл
				СтруктураПараметров.Вставить(СтрокаПараметров.Field, СтрокаПараметров.Value);
			КонецЦикла;

			ОбъектИзменения = Справочники.НСИОбъектыДляКонтроля.НайтиПоРеквизиту("НаименованиеВСистемеКонтролере", СтруктураПараметров.ОбъектИзмененияНаименованиеВСистемеКонтролере);

			Если ОбъектИзменения = Справочники.НСИОбъектыДляКонтроля.ПустаяСсылка() Тогда
				ОписаниеОшибки = "Не определена настройка получения изменений для объекта " + СтруктураПараметров.ОбъектИзмененияНаименованиеВСистемеКонтролере + " в системе " + НСИТекущаяСистема;
				Продолжить;
			КонецЕсли;

			//->Lexa 141114
			ОбъектРеквизитИзменения = Справочники.НСИРеквизитыОбъектов.ПустаяСсылка();
			Если ОбъектИзменения.ОбъектДляКонтроляРодитель <> Справочники.НСИОбъектыДляКонтроля.ПустаяСсылка() Тогда
				ОбъектИзменения = ОбъектИзменения.ОбъектДляКонтроляРодитель;
				Если СтруктураПараметров.РеквизитИзмененияНаименованиеВСистемеКонтролере = "Родитель" Тогда
					СтруктураПараметров.Вставить("ОбъектИзмененияНаименованиеВСистемеКонтроллере", ОбъектИзменения.НаименованиеВСистемеКонтролере);
					ОбъектРеквизитИзменения = Справочники.НСИРеквизитыОбъектов.НайтиПоНаименованию(СтруктураПараметров.РеквизитИзмененияНаименованиеВСистемеКонтролере,,, ОбъектИзменения);//->Lexa 141114
				КонецЕсли;
			КонецЕсли;
			//<-Lexa
			
			СтруктураПараметров.Вставить("ОбъектИзменения", ОбъектИзменения);
			Если ОбъектРеквизитИзменения = Справочники.НСИРеквизитыОбъектов.ПустаяСсылка() Тогда//->Lexa 141114
				ОбъектРеквизитИзменения = Справочники.НСИРеквизитыОбъектов.НайтиПоРеквизиту("НаименованиеВСистемеКонтролере", СтруктураПараметров.РеквизитИзмененияНаименованиеВСистемеКонтролере, , ОбъектИзменения);//->Lexa 141114
			КонецЕсли;
			
			Если ОбъектРеквизитИзменения = Справочники.НСИРеквизитыОбъектов.ПустаяСсылка() Тогда
				ОписаниеОшибки = "Не определена настройка получения изменений для реквизита " + СтруктураПараметров.РеквизитИзмененияНаименованиеВСистемеКонтролере + " объекта " + СтруктураПараметров.ОбъектИзмененияНаименованиеВСистемеКонтролере + " в системе " + НСИТекущаяСистема;
				Продолжить;
			КонецЕсли;

			СтруктураПараметров.Вставить("РеквизитИзменения", ОбъектРеквизитИзменения);
			СистемаКонтролер = Справочники.НСИИспользуемыеСистемы.НайтиПоРеквизиту("GUID", СтруктураПараметров.СистемаКонтролерGUID);

			Если СистемаКонтролер = Справочники.НСИИспользуемыеСистемы.ПустаяСсылка() Тогда
				ОписаниеОшибки = "Не определена настройка системы контролера для реквизита " + СтруктураПараметров.РеквизитИзмененияНаименованиеВСистемеКонтролере + " объекта " + СтруктураПараметров.ОбъектИзмененияНаименованиеВСистемеКонтролере + " в системе " + НСИТекущаяСистема;
				Продолжить;
			КонецЕсли;

			СтруктураПараметров.Вставить("СистемаКонтролер", СистемаКонтролер);
			СистемаИнициатор = Справочники.НСИИспользуемыеСистемы.НайтиПоРеквизиту("GUID", СтруктураПараметров.СистемаИнициаторGUID);

			Если СистемаИнициатор = Справочники.НСИИспользуемыеСистемы.ПустаяСсылка() Тогда

				Если ОбъектИзменения.СистемаКонтролер = НСИТекущаяСистема Тогда
					ОписаниеОшибки = "Не определена настройка получения изменений для реквизита " + СтруктураПараметров.РеквизитИзмененияНаименованиеВСистемеКонтролере + " объекта " + СтруктураПараметров.ОбъектИзмененияНаименованиеВСистемеКонтролере + " в системе " + НСИТекущаяСистема;
					Продолжить;
				Иначе
					СтруктураПараметров.Вставить("СистемаИнициатор", СтруктураПараметров.СистемаИнициатор);
				КонецЕсли;
			Иначе

				СтруктураПараметров.Вставить("СистемаИнициатор", СистемаИнициатор);
			КонецЕсли;

			КлючПоиска = XDTOПолучитьТаблицуКлючейПоиска(СтрокаЗаписи.ArrayKeySearch);
			ОписаниеОшибкиПоиска = "";

			//->Lexa 141118
			Если (СтруктураПараметров.ТипОбъектаСведений = "Сведения") И (ОбъектРеквизитИзменения.Наименование = "Родитель") Тогда
				СтруктураПараметров.Вставить("НовыйОбъект",Истина);
			КонецЕсли;
			//<-Lexa
			
			Если Не СтруктураПараметров.НовыйОбъект Тогда
				Элемент = Неопределено;
				Если НайтиЭлементПоКлючуПоиска(КлючПоиска, СтруктураПараметров.ОбъектИзменения.Наименование, Элемент, СтруктураПараметров.ОбъектИзменения, СистемаИнициатор) Тогда
					СтруктураПараметров.ЭлементИзменения = Элемент;
					КлючПоиска = ПолучитьТаблицуКлючейПоиска(ОбъектИзменения, Элемент, Элемент, Ложь);
				Иначе
					ОписаниеОшибкиПоиска = ОписаниеОшибки + Символы.ПС + "Не удается найти элемент " + СтруктураПараметров.ЭлементИзменения;
				КонецЕсли;
			КонецЕсли;

			СтруктураПараметров.Вставить("КлючПоиска", ЗначениеВСтрокуВнутр(КлючПоиска));
			Ссылка = Неопределено;
			СтруктураПараметров.Вставить("КлючПоискаНовоеЗначение", ЗначениеВСтрокуВнутр(XDTOПолучитьСтруктуруКлючаПоиска(СтрокаЗаписи.ArrayNewValueLink, Ссылка, ОписаниеОшибкиПоиска)));

			Если Не (Ссылка = Неопределено) Тогда
				СтруктураПараметров.НовоеЗначение = Ссылка;
			КонецЕсли;

			Ссылка = Неопределено;
			СтруктураПараметров.Вставить("КлючПоискаСтароеЗначение", ЗначениеВСтрокуВнутр(XDTOПолучитьСтруктуруКлючаПоиска(СтрокаЗаписи.ArrayOldValueLink, Ссылка, ОписаниеОшибкиПоиска)));

			Если Не (Ссылка = Неопределено) Тогда
				СтруктураПараметров.СтароеЗначение = Ссылка;
			КонецЕсли;

			СтруктураПараметров.Вставить("РасширениеКлючаПоиска", ЗначениеВСтрокуВнутр(XDTOПолучитьСтруктуруКлючаПоиска(СтрокаЗаписи.ArrayExtKeySearch, , ОписаниеОшибкиПоиска)));

			Если Не ПустаяСтрока(ОписаниеОшибкиПоиска) Тогда

				СтруктураПараметров.Комментарий = СтруктураПараметров.Комментарий + Символы.ПС + ОписаниеОшибкиПоиска;

				Если Не СтруктураПараметров.НовыйОбъект И СтруктураПараметров.РеквизитИзменения.ТипОбъектаСведений <> Перечисления.НСИТипыРеквизитовОбъектов.Сведения Тогда
					СтруктураПараметров.Отклонено = Истина;
				КонецЕсли;

			КонецЕсли;
             // ++++ Тимофей
			Если СистемаКонтролер = НСИТекущаяСистема Тогда
				СтруктураПараметров.Вставить("ДатаРегистрацииВСистемеКонтролере", ТекущаяДата());
			КонецЕсли;

			РежимКонтроля = ?(ЗначениеЗаполнено(ОбъектРеквизитИзменения.РежимКонтроля), ОбъектРеквизитИзменения.РежимКонтроля, ОбъектИзменения.РежимКонтроля);
			Если СистемаКонтролер = НСИТекущаяСистема И РежимКонтроля = Перечисления.НСИРежимыКонтроля.Автоматически И Не СтруктураПараметров.Отклонено Тогда
			//Если РежимКонтроля = Перечисления.НСИРежимыКонтроля.Автоматически И Не СтруктураПараметров.Отклонено Тогда

				СтруктураПараметров.Утверждено = Истина;
				СтруктураПараметров.ДатаУтвержденияВСистемеКонтролере = ТекущаяДата();

			КонецЕсли;

			СсылкаНаОбъектИстории = Справочники.НСИИсторияИзмененияОбъектов.НайтиПоКоду(СтруктураПараметров.СтрокаИсторииИзмененийКод);

			Если СсылкаНаОбъектИстории = Справочники.НСИИсторияИзмененияОбъектов.ПустаяСсылка() Тогда
				ОбъектИстории = Справочники.НСИИсторияИзмененияОбъектов.СоздатьЭлемент();
				ОбъектИстории.Код = СтруктураПараметров.СтрокаИсторииИзмененийКод;
			Иначе
				ОбъектИстории = СсылкаНаОбъектИстории.ПолучитьОбъект();
			КонецЕсли;

			ЗаполнитьЗначенияСвойств(ОбъектИстории, СтруктураПараметров);

			ОбъектИстории.ОбменДанными.Загрузка = Истина;
			ОбъектИстории.Записать();
             // +++++++ТИмофей	
			Если Не ПустаяСтрока(ОписаниеОшибкиПоиска) И ОбъектИстории.Отклонено И СистемаКонтролер = НСИТекущаяСистема Тогда
			//Если Не ПустаяСтрока(ОписаниеОшибкиПоиска) И ОбъектИстории.Отклонено Тогда
				ЗарегистрироватьОчередьРассылки(ОбъектИстории.Ссылка, , СистемаИнициатор);
			КонецЕсли;

			СписокИзменений.Добавить(ОбъектИстории.Ссылка);

		КонецЦикла;
	Исключение

		ОписаниеОшибки = ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;

	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда

		Возврат Ложь;
	КонецЕсли;

	ПрименитьИзменения(СписокИзменений);

	Возврат Истина;

КонецФункции

Процедура ПрименитьИзменения(СписокИзменений = Неопределено) Экспорт
	Если Не НСИСервер.ЛицензияКорректна() Тогда
		Возврат;
	КонецЕсли;

	Попытка
		ОписаниеОшибки = "";

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	НСИИсторияИзмененияОбъектов.Ссылка,
		               |	НСИИсторияИзмененияОбъектов.КлючПоиска,
		               |	НСИИсторияИзмененияОбъектов.НовоеЗначение,
		               |	НСИИсторияИзмененияОбъектов.ОбъектИзменения.Наименование,
		               |	НСИИсторияИзмененияОбъектов.ОбъектИзменения КАК ОбъектИзменения,
		               |	НСИИсторияИзмененияОбъектов.СистемаКонтролер,
		               |	НСИИсторияИзмененияОбъектов.РеквизитИзменения.Наименование,
		               |	НСИИсторияИзмененияОбъектов.ДатаРегистрацииВСистемеИнициаторе,
		               |	НСИИсторияИзмененияОбъектов.Утверждено,
		               |	НСИИсторияИзмененияОбъектов.ЭлементИзменения,
		               |	НСИИсторияИзмененияОбъектов.ОбъектИзменения.РежимКонтроля,
		               |	НСИИсторияИзмененияОбъектов.СистемаИнициатор,
		               |	НСИИсторияИзмененияОбъектов.КлючПоискаНовоеЗначение,
		               |	НСИИсторияИзмененияОбъектов.КлючПоискаСтароеЗначение,
		               |	НСИИсторияИзмененияОбъектов.РасширениеКлючаПоиска,
		               |	НСИИсторияИзмененияОбъектов.Комментарий,
		               |	НСИИсторияИзмененияОбъектов.РеквизитИзменения.Наименование КАК НаименованиеРеквизита_,
		               |	НСИИсторияИзмененияОбъектов.РеквизитИзменения.ТипОбъектаСведений КАК ТипОбъектаСведений,
		               |	НСИИсторияИзмененияОбъектов.РеквизитИзменения.НаименованиеОбъектаСведений КАК НаименованиеОбъектаСведений,
		               |	НСИИсторияИзмененияОбъектов.РеквизитИзменения.ТипЗначенияРеквизита КАК ТипЗначенияРеквизита,
		               |	НСИИсторияИзмененияОбъектов.РеквизитИзменения.ТипСсылочногоОбъекта КАК ТипСсылочногоОбъекта,
		               |	НСИИсторияИзмененияОбъектов.НовыйОбъект,
		               |	НСИИсторияИзмененияОбъектов.РеквизитИзменения.КонтролируетсяДокументом,
		               |	ВЫБОР
		               |		КОГДА НСИИсторияИзмененияОбъектов.РеквизитИзменения.ТипОбъектаСведений = ЗНАЧЕНИЕ(Перечисление.НСИТипыРеквизитовОбъектов.Сведения)
		               |			ТОГДА 3
		               |		КОГДА НСИИсторияИзмененияОбъектов.РеквизитИзменения.Наименование = ""Родитель""
		               |			ТОГДА 2
		               |		КОГДА ЕСТЬNULL(ВложенныйЗапрос.Ссылка, 0) = 0
		               |			ТОГДА 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Порядок,
		               |	ЕСТЬNULL(ВложенныйЗапрос.Ссылка, """") КАК СозданиеГруппы
		               |ИЗ
		               |	Справочник.НСИИсторияИзмененияОбъектов КАК НСИИсторияИзмененияОбъектов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			НСИИсторияИзмененияОбъектов.Ссылка КАК Ссылка,
		               |			НСИИсторияИзмененияОбъектов.ОбъектИзменения КАК ОбъектИзменения
		               |		ИЗ
		               |			Справочник.НСИИсторияИзмененияОбъектов КАК НСИИсторияИзмененияОбъектов
		               |		ГДЕ
		               |			НСИИсторияИзмененияОбъектов.РеквизитИзменения.Наименование = ""ЭтоГруппа""
		               |			И (НСИИсторияИзмененияОбъектов.НовоеЗначение = ""Yes""
		               |					ИЛИ НСИИсторияИзмененияОбъектов.НовоеЗначение = ""Да"")) КАК ВложенныйЗапрос
		               |		ПО НСИИсторияИзмененияОбъектов.Код = ВложенныйЗапрос.Ссылка.Код
		               |ГДЕ
		               |	НЕ НСИИсторияИзмененияОбъектов.ПримененоВТекущейСистеме
		               |	И НСИИсторияИзмененияОбъектов.Утверждено
		               |	И НЕ НСИИсторияИзмененияОбъектов.Отклонено" + ?(СписокИзменений = Неопределено, " ", " И НСИИсторияИзмененияОбъектов.Ссылка в (&СписокИзменений)");

                                                   
		Запрос.УстановитьПараметр("СписокИзменений", СписокИзменений);
		ТаблицаИзменений = Запрос.Выполнить().Выгрузить();

		ТаблицаИзменений.Сортировать("Порядок, КлючПоиска,  ДатаРегистрацииВСистемеИнициаторе");

		ТекущийКлючПоиска = Неопределено;
		ОбъектЭлементИзменения = Неопределено;

		НСИТекущаяСистема = Константы.НСИТекущаяСистема.Получить();

		ИзменялисьРеквизиты = Ложь;

		Для каждого СтрокаИзменений Из ТаблицаИзменений Цикл


			Если Не СтрокаИзменений.Утверждено И Не ЗначениеЗаполнено(СтрокаИзменений.ЭлементИзменения) Тогда
				Продолжить;
			КонецЕсли;

			ЭлементИсторияИзмененийОбъект = СтрокаИзменений.Ссылка.ПолучитьОбъект();

			Если СтрокаИзменений.РеквизитИзмененияКонтролируетсяДокументом Тогда

				ЭлементИсторияИзмененийОбъект.Комментарий = "Реквизит контролируется документом. Необходимо ввести документ";
				ЭлементИсторияИзмененийОбъект.Отклонено = Истина;
				ЭлементИсторияИзмененийОбъект.Записать();
				Продолжить;

			КонецЕсли;

			Если Не (ТекущийКлючПоиска = СтрокаИзменений.КлючПоиска) Тогда

				Если Не (ТекущийКлючПоиска = Неопределено) И Не (ОбъектЭлементИзменения = Неопределено) И ИзменялисьРеквизиты Тогда
					ОбъектЭлементИзменения.Записать();
				КонецЕсли;

				ТекущийКлючПоиска = СтрокаИзменений.КлючПоиска;
				ОбъектЭлементИзменения = ПолучитьЭлементИзменения(СтрокаИзменений);

				Если ОбъектЭлементИзменения = Неопределено Тогда
					Продолжить;
				КонецЕсли;

			КонецЕсли;

			ОшибкаУстановкиЗначения = Ложь;

			Если СтрокаИзменений.ТипОбъектаСведений = Перечисления.НСИТипыРеквизитовОбъектов.Простой Тогда
				ОшибкаУстановкиЗначения = Не УстановитьНовоеЗначениеРеквизита(ОбъектЭлементИзменения, СтрокаИзменений.РеквизитИзмененияНаименование, СтрокаИзменений.НовоеЗначение, СтрокаИзменений.ТипЗначенияРеквизита, СтрокаИзменений.ТипСсылочногоОбъекта, ОписаниеОшибки);
				ИзменялисьРеквизиты = Истина;

			ИначеЕсли СтрокаИзменений.ТипОбъектаСведений = Перечисления.НСИТипыРеквизитовОбъектов.ТабличнаяЧасть Тогда
				ОшибкаУстановкиЗначения = Не УстановитьРеквизитТабличнойЧасти(ОбъектЭлементИзменения, СтрокаИзменений, ОписаниеОшибки);
				ИзменялисьРеквизиты = Истина;

			ИначеЕсли СтрокаИзменений.ТипОбъектаСведений = Перечисления.НСИТипыРеквизитовОбъектов.Сведения Тогда
				ОшибкаУстановкиЗначения = Не УстановитьРеквизитРегистраСведений(ОбъектЭлементИзменения, СтрокаИзменений, ОписаниеОшибки);

			КонецЕсли;

			Если ОшибкаУстановкиЗначения Тогда
				ЭлементИсторияИзмененийОбъект.Отклонено = Истина;
				ЭлементИсторияИзмененийОбъект.Комментарий = ОписаниеОшибки;
				РегистрацияОшибки(ОписаниеОшибки, НСИТекущаяСистема);
			КонецЕсли;

			Если Не ЭлементИсторияИзмененийОбъект.Отклонено Тогда
				ОбъектЭлементИзменения.ОбменДанными.Загрузка = Истина;
				Если Не ЗначениеЗаполнено(ОбъектЭлементИзменения.Код) Тогда
					ОбъектЭлементИзменения.УстановитьНовыйКод();
				КонецЕсли;

				Если ЭлементИсторияИзмененийОбъект.НовыйОбъект Тогда

					Если СокрЛП(СтрокаИзменений.РеквизитИзмененияНаименование) = "Код" Тогда

						Если СтрокаИзменений.НовоеЗначение <> ОбъектЭлементИзменения.Код Тогда
							ЭлементИсторияИзмененийОбъект.НовоеЗначение = ОбъектЭлементИзменения.Код;
						КонецЕсли;

					КонецЕсли;
					ОбъектЭлементИзменения.Записать();
				КонецЕсли;

				ОбновитьИсториюИзменений(ЭлементИсторияИзмененийОбъект, ОбъектЭлементИзменения.Ссылка);

				Если ЭлементИсторияИзмененийОбъект.НовыйОбъект Тогда
					ЗарегистрироватьСоответствиеОбъектовПоИзменению(ЗначениеИзСтрокиВнутр(ЭлементИсторияИзмененийОбъект.КлючПоиска), ЭлементИсторияИзмененийОбъект.ЭлементИзменения, СтрокаИзменений.ОбъектИзменения, ЭлементИсторияИзмененийОбъект.СистемаИнициатор);
				КонецЕсли;

			КонецЕсли;

			Если ЭлементИсторияИзмененийОбъект.Утверждено И Не ЗначениеЗаполнено(ЭлементИсторияИзмененийОбъект.ДатаУтвержденияВСистемеКонтролере) И Не ЗначениеЗаполнено(ЭлементИсторияИзмененийОбъект.ПользовательКонтролер) Тогда
				ЭлементИсторияИзмененийОбъект.ДатаУтвержденияВСистемеКонтролере = ТекущаяДата();
				ЭлементИсторияИзмененийОбъект.ПользовательКонтролер = ПолучитьТекущегоПользователя();
			КонецЕсли;

			ЭлементИсторияИзмененийОбъект.ОбменДанными.Загрузка = Истина;
			ЭлементИсторияИзмененийОбъект.Записать();
  //+++++++++Тимофей	
			Если СтрокаИзменений.СистемаКонтролер = НСИТекущаяСистема И Не ЭлементИсторияИзмененийОбъект.Отклонено Тогда
			//Если  Не ЭлементИсторияИзмененийОбъект.Отклонено Тогда
  //-----Тимофей
				Если Не ЗарегистрироватьОчередьРассылки(ЭлементИсторияИзмененийОбъект.Ссылка, ОписаниеОшибки) Тогда

					РегистрацияОшибки(ОписаниеОшибки(), НСИТекущаяСистема);
					Возврат;
				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

		Если Не (ТекущийКлючПоиска = Неопределено) И Не (ОбъектЭлементИзменения = Неопределено) И ИзменялисьРеквизиты Тогда
			ОбъектЭлементИзменения.Записать();
		КонецЕсли;
	Исключение

		РегистрацияОшибки(ОписаниеОшибки(), НСИТекущаяСистема);
		Возврат;
	КонецПопытки;



	ОтправитьИзменения();

КонецПроцедуры

Функция ПолучитьЭлементИзменения(СтрокаИзменений) Экспорт
	Если ЗначениеЗаполнено(СтрокаИзменений.ЭлементИзменения) И Не (ТипЗнч(СтрокаИзменений.ЭлементИзменения) = Тип("Строка")) Тогда
		Возврат СтрокаИзменений.ЭлементИзменения.ПолучитьОбъект();
	КонецЕсли;

	Элемент = Неопределено;
	ТаблицаКлючПоиска = ЗначениеИзСтрокиВнутр(СтрокаИзменений.КлючПоиска);

	Если НайтиЭлементПоКлючуПоиска(ТаблицаКлючПоиска, СтрокаИзменений.ОбъектИзменения.Наименование, Элемент, СтрокаИзменений.ОбъектИзменения, СтрокаИзменений.СистемаИнициатор) Тогда
		ОбъектЭлементИзменения = Элемент.ПолучитьОбъект();
	Иначе

		Если СтрокаИзменений.Утверждено Тогда
			ЗаписьЖурналаРегистрации("НСИ", , ,  СтрокаИзменений.НаименованиеРеквизита_);
				Если СтрокаИзменений.НаименованиеРеквизита_="ЭтоГруппа" И (СтрокаИзменений.НовоеЗначение="Yes" или СтрокаИзменений.НовоеЗначение="Да") Тогда
				//Если СтрокаИзменений.НаименованиеРеквизита_="ЭтоГруппа" И (СтрокаИзменений.НовоеЗначение="Yes" или СтрокаИзменений.НовоеЗначение="Да" или СтрокаИзменений.НовоеЗначение = Истина) Тогда
				//Если НЕ СтрокаИзменений.СозданиеГруппы="" Тогда
					ОбъектЭлементИзменения = Справочники[СокрЛП(СтрокаИзменений.ОбъектИзменения.Наименование)].СоздатьГруппу();
				Иначе	
					ОбъектЭлементИзменения = Справочники[СокрЛП(СтрокаИзменений.ОбъектИзменения.Наименование)].СоздатьЭлемент();
				КонецЕсли;	

			Для каждого СтрокаКлюча Из ТаблицаКлючПоиска Цикл

				Если СтрокаКлюча.ИмяПоля = "GUID" Тогда

					Если Не ПустаяСтрока(СтрокаКлюча.Значение) Тогда

						Попытка
							Т_Ссылка = Новый УникальныйИдентификатор(СтрокаКлюча.Значение);
							СправочникСсылка = Справочники[СокрЛП(СтрокаИзменений.ОбъектИзменения.Наименование)].ПолучитьСсылку(Т_Ссылка);
							ОбъектЭлементИзменения.УстановитьСсылкуНового(СправочникСсылка);
						Исключение
							Продолжить;
						КонецПопытки;

					КонецЕсли;
				Иначе

					ОбъектЭлементИзменения[СтрокаКлюча.ИмяПоля] = СтрокаКлюча.Значение;
				КонецЕсли;

			КонецЦикла;
		Иначе

			ОбъектЭлементИзменения = Неопределено;
		КонецЕсли;

	КонецЕсли;

	Возврат ОбъектЭлементИзменения;

КонецФункции

Процедура ОбновитьИсториюИзменений(ЭлементИсторияИзмененийОбъект, ОбъектЭлементИзмененияСсылка) Экспорт
	ЭлементИсторияИзмененийОбъект.ЭлементИзменения = ОбъектЭлементИзмененияСсылка;
	ЭлементИсторияИзмененийОбъект.ДатаПримененияВТекущейСистеме = ТекущаяДата();
	ЭлементИсторияИзмененийОбъект.ПримененоВТекущейСистеме = Истина;

КонецПроцедуры

Процедура ЗарегистрироватьСоответствиеОбъектовПоИзменению(ТаблицаКлючПоиска, ЭлементИзменения, ОбъектДляКонтроля, СистемаИнициатор) Экспорт
	Перем СтрокаGUID;
	Если ЗначениеЗаполнено(ЭлементИзменения) И Не (ТипЗнч(ЭлементИзменения) = Тип("Строка")) Тогда

		СтрокаGUID = ТаблицаКлючПоиска.Найти("GUID", "ИмяПоля");

		Если Не (СтрокаGUID = Неопределено) И Не ПустаяСтрока(СтрокаGUID.Значение) Тогда

			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	НСИСоответствиеОбъектов.GUID
			|ИЗ
			|	РегистрСведений.НСИСоответствиеОбъектов КАК НСИСоответствиеОбъектов
			|ГДЕ
			|	НСИСоответствиеОбъектов.Объект = &Объект
			|	И НСИСоответствиеОбъектов.Система = &Система
			|	И НСИСоответствиеОбъектов.ОбъектДляКонтроля = &ОбъектДляКонтроля";

			Запрос.УстановитьПараметр("Объект", ЭлементИзменения);
			Запрос.УстановитьПараметр("Система", СистемаИнициатор);
			Запрос.УстановитьПараметр("ОбъектДляКонтроля", ОбъектДляКонтроля);

			Выборка = Запрос.Выполнить().Выбрать();

			Если Выборка.Следующий() Тогда
				Если Выборка.GUID = СтрокаGUID.Значение Тогда
					Возврат;
				КонецЕсли;
			КонецЕсли;

			ЗаписьНСИСоответствие = РегистрыСведений.НСИСоответствиеОбъектов.СоздатьМенеджерЗаписи();
			ЗаписьНСИСоответствие.GUID = СтрокаGUID.Значение;
			ЗаписьНСИСоответствие.Объект = ЭлементИзменения;
			ЗаписьНСИСоответствие.Система = СистемаИнициатор;
			ЗаписьНСИСоответствие.ОбъектДляКонтроля = ОбъектДляКонтроля;
			ЗаписьНСИСоответствие.Записать();

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Функция XDTOПолучитьТаблицуКлючейПоиска(МассивКлючей)
	ТаблицаКлюча = Новый ТаблицаЗначений;

	ТаблицаКлюча.Колонки.Добавить("ИмяПоля", , "Имя поля");
	ТаблицаКлюча.Колонки.Добавить("Значение");

	Для каждого СтрокаКлючаЗаписи Из МассивКлючей Цикл

		СтрокаКлюча = ТаблицаКлюча.Добавить();
		СтрокаКлюча.ИмяПоля = СтрокаКлючаЗаписи.Field;
		СтрокаКлюча.Значение = СтрокаКлючаЗаписи.Value;

	КонецЦикла;

	Возврат ТаблицаКлюча;

КонецФункции

Функция ПолучитьЗначениеПеречисленияПоЗначению(ТипОбъекта, Значение, Ссылка)
	Попытка
		НайденноеПеречисление = Перечисления[ТипОбъекта][Значение];
	Исключение
		Возврат Ложь;
	КонецПопытки;

	Ссылка = НайденноеПеречисление;

	Возврат Истина;

КонецФункции

Функция XDTOПолучитьСтруктуруКлючаПоиска(МассивСтруктурыКлюча, Ссылка = Неопределено, ОписаниеОшибки = "")
	ТаблицаЗначенийСтруктурыКлючаПоиска = Новый ТаблицаЗначений;
	ТаблицаЗначенийСтруктурыКлючаПоиска.Колонки.Добавить("ИмяПоляВКонтролере");
	ТаблицаЗначенийСтруктурыКлючаПоиска.Колонки.Добавить("Значение");
	ТаблицаЗначенийСтруктурыКлючаПоиска.Колонки.Добавить("ТипЗначения");
	ТаблицаЗначенийСтруктурыКлючаПоиска.Колонки.Добавить("ТипОбъекта");
	ТаблицаЗначенийСтруктурыКлючаПоиска.Колонки.Добавить("КлючПоиска");
	ТаблицаЗначенийСтруктурыКлючаПоиска.Колонки.Добавить("Ссылка");

	Для каждого СтрокаСтруктурыКлюча Из МассивСтруктурыКлюча Цикл

		СтрокаТаблицыЗначенийСтруктурыПоиска = ТаблицаЗначенийСтруктурыКлючаПоиска.Добавить();

		Для каждого СтрокаЗначенийАтрибутовКлюча Из СтрокаСтруктурыКлюча.ArrayOfFieldsAndValues Цикл

			Если СтрокаЗначенийАтрибутовКлюча.Field = "ИмяПоляВКонтролере" Тогда
				СтрокаТаблицыЗначенийСтруктурыПоиска.ИмяПоляВКонтролере = СтрокаЗначенийАтрибутовКлюча.Value;
			КонецЕсли;

			Если СтрокаЗначенийАтрибутовКлюча.Field = "Значение" Тогда
				СтрокаТаблицыЗначенийСтруктурыПоиска.Значение = СтрокаЗначенийАтрибутовКлюча.Value;
			КонецЕсли;

			Если СтрокаЗначенийАтрибутовКлюча.Field = "ТипОбъекта" Тогда

				ТипОбъекта = СтрокаЗначенийАтрибутовКлюча.Value;

				Если ЗначениеЗаполнено(ТипОбъекта) Тогда

					ТипОбъектаСсылка = Справочники.НСИОбъектыДляКонтроля.НайтиПоРеквизиту("НаименованиеВСистемеКонтролере", ТипОбъекта);

					Если ЗначениеЗаполнено(ТипОбъектаСсылка) Тогда
						СтрокаТаблицыЗначенийСтруктурыПоиска.ТипОбъекта = ТипОбъектаСсылка.Наименование;
					Иначе

						ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + "Не удается найти объект контроля " + ТипОбъекта;
						Продолжить;

					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

			Если СтрокаЗначенийАтрибутовКлюча.Field = "ТипЗначения" Тогда

				СтрокаТаблицыЗначенийСтруктурыПоиска.ТипЗначения = СтрокаЗначенийАтрибутовКлюча.Value;

			КонецЕсли;

		КонецЦикла;


		Если ЗначениеЗаполнено(СтрокаТаблицыЗначенийСтруктурыПоиска.ТипОбъекта) И ЗначениеЗаполнено(СтрокаТаблицыЗначенийСтруктурыПоиска.Значение) Тогда

			Если СтрокаТаблицыЗначенийСтруктурыПоиска.ТипЗначения = "Перечисление" Тогда

				Если ПолучитьЗначениеПеречисленияПоЗначению(СтрокаТаблицыЗначенийСтруктурыПоиска.ТипОбъекта, СтрокаТаблицыЗначенийСтруктурыПоиска.Значение, Ссылка) Тогда

					СтрокаТаблицыЗначенийСтруктурыПоиска.Ссылка = Ссылка;
				Иначе


					ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + "Не удается найти перечисление " + СтрокаТаблицыЗначенийСтруктурыПоиска.Значение;

				КонецЕсли;
			Иначе


				СтрокаТаблицыЗначенийСтруктурыПоиска.КлючПоиска = XDTOПолучитьТаблицуКлючейПоиска(СтрокаСтруктурыКлюча.ArrayKeySearch);

				Если НайтиЭлементПоКлючуПоиска(СтрокаТаблицыЗначенийСтруктурыПоиска.КлючПоиска, СтрокаТаблицыЗначенийСтруктурыПоиска.ТипОбъекта, Ссылка) Тогда

					СтрокаТаблицыЗначенийСтруктурыПоиска.Ссылка = Ссылка;

					СтрокаТаблицыЗначенийСтруктурыПоиска.КлючПоиска = ПолучитьТаблицуКлючейПоиска(ТипОбъектаСсылка, Ссылка, Ссылка, Ложь);
				Иначе


					ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + "Не удается найти элемент " + СтрокаТаблицыЗначенийСтруктурыПоиска.Значение;

				КонецЕсли;

			КонецЕсли;


		КонецЕсли;

	КонецЦикла;

	Возврат ТаблицаЗначенийСтруктурыКлючаПоиска;

КонецФункции

Функция ПолучитьТаблицуGUIDПоСоответствиюОбъектов(ОбъектДляКонтроля, Ссылка)
	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
	|	НСИСоответствиеОбъектов.GUID,
	|	НСИСоответствиеОбъектов.Система
	|ИЗ
	|	РегистрСведений.НСИСоответствиеОбъектов КАК НСИСоответствиеОбъектов
	|ГДЕ
	|	НСИСоответствиеОбъектов.Объект = &Объект
	|	И НСИСоответствиеОбъектов.ОбъектДляКонтроля = &ОбъектДляКонтроля";
	Запрос.УстановитьПараметр("ОбъектДляКонтроля", ОбъектДляКонтроля.Ссылка);
	Запрос.УстановитьПараметр("Объект", Ссылка);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПолучитьТаблицуКлючейПоиска(ОбъектДляКонтроля, ЭлементОбъект, Ссылка, НовыйОбъект = Ложь)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	| НСИОбъектыДляКонтроляСоставКлючаПоиска.ИмяПоля,
	| НСИОбъектыДляКонтроляСоставКлючаПоиска.ИмяПоляВКонтролере,
	| НСИОбъектыДляКонтроляСоставКлючаПоиска.GUID
	|ИЗ
	| Справочник.НСИОбъектыДляКонтроля.СоставКлючаПоиска КАК НСИОбъектыДляКонтроляСоставКлючаПоиска
	|ГДЕ
	| НСИОбъектыДляКонтроляСоставКлючаПоиска.Ссылка = &Объект";

	Запрос.УстановитьПараметр("Объект", ОбъектДляКонтроля.Ссылка);

	ВыборкаКлючейПоиска = Запрос.Выполнить().Выбрать();

	ТаблицаЗначенийКлючПоиска = Новый ТаблицаЗначений;
	ТаблицаЗначенийКлючПоиска.Колонки.Добавить("ИмяПоля");
	ТаблицаЗначенийКлючПоиска.Колонки.Добавить("СистемаПолучатель");
	ТаблицаЗначенийКлючПоиска.Колонки.Добавить("Значение");

	Пока ВыборкаКлючейПоиска.Следующий() Цикл

		СтрокаТаблицыЗначенийКлючПоиска = ТаблицаЗначенийКлючПоиска.Добавить();

		Если ВыборкаКлючейПоиска.GUID Тогда

			СтрокаТаблицыЗначенийКлючПоиска.ИмяПоля = "GUID";

			Если ЗначениеЗаполнено(Ссылка) Тогда

				СтрокаТаблицыЗначенийКлючПоиска.Значение = Строка(Ссылка.УникальныйИдентификатор());

				ТаблицаGUID = ПолучитьТаблицуGUIDПоСоответствиюОбъектов(ОбъектДляКонтроля, Ссылка);

				Для каждого СтрокаGUID Из ТаблицаGUID Цикл

					СтрокаТаблицыЗначенийКлючПоиска = ТаблицаЗначенийКлючПоиска.Добавить();
					СтрокаТаблицыЗначенийКлючПоиска.ИмяПоля = "GUID";
					СтрокаТаблицыЗначенийКлючПоиска.СистемаПолучатель = СтрокаGUID.Система;
					СтрокаТаблицыЗначенийКлючПоиска.Значение = СтрокаGUID.GUID;

				КонецЦикла;

			ИначеЕсли НовыйОбъект Тогда

				Если ОбъектДляКонтроля.ПолучатьGUIDЗаписьюЭлемента Тогда

					ЭлементОбъект.ОбменДанными.Загрузка = Истина;
					ЭлементОбъект.Записать();
					ЭлементОбъект.ОбменДанными.Загрузка = Ложь;

					СтрокаТаблицыЗначенийКлючПоиска.Значение = Строка(ЭлементОбъект.ССылка.УникальныйИдентификатор());
					Ссылка = ЭлементОбъект.ССылка;
				Иначе



					УникальныйИдентификатор = Новый УникальныйИдентификатор;
					СтрокаТаблицыЗначенийКлючПоиска.Значение = Строка(УникальныйИдентификатор);
					СправочникСсылка = Справочники[СокрЛП(ОбъектДляКонтроля.Наименование)].ПолучитьСсылку(УникальныйИдентификатор);
					ЭлементОбъект.УстановитьСсылкуНового(СправочникСсылка);
					Ссылка = СправочникСсылка;

				КонецЕсли;
			Иначе


				СтрокаТаблицыЗначенийКлючПоиска.Значение = "";
			КонецЕсли;
		Иначе



			СтрокаТаблицыЗначенийКлючПоиска.ИмяПоля = ВыборкаКлючейПоиска.ИмяПоляВКонтролере;

			Если НовыйОбъект Тогда
				СтрокаТаблицыЗначенийКлючПоиска.Значение = ЭлементОбъект[ВыборкаКлючейПоиска.ИмяПоля];
			Иначе

				Если ЗначениеЗаполнено(Ссылка) Тогда
					СтрокаТаблицыЗначенийКлючПоиска.Значение = Ссылка[ВыборкаКлючейПоиска.ИмяПоля];
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Возврат ТаблицаЗначенийКлючПоиска;

КонецФункции

Функция ПолучитьИмяПеречисления(ПеречислениеСсылка)
	Попытка
		Для каждого ОБъектМетаданных Из ПеречислениеСсылка.Метаданные().ЗначенияПеречисления Цикл
			Если Строка(ПеречислениеСсылка) = ОБъектМетаданных.Синоним Тогда
				Возврат ОБъектМетаданных.Имя;
			КонецЕсли;
		КонецЦикла;
	Исключение

	КонецПопытки;

	Возврат Строка(ПеречислениеСсылка);

КонецФункции

Функция ПолучитьСтруктуруКлючаПоиска(ИмяПоляВКонтролере, Объект, ТипЗначения, Элемент, ТаблицаЗначенийСтруктурыКлючаПоиска = Неопределено)
	Если ТаблицаЗначенийСтруктурыКлючаПоиска = Неопределено Тогда

		ТаблицаЗначенийСтруктурыКлючаПоиска = Новый ТаблицаЗначений;
		ТаблицаЗначенийСтруктурыКлючаПоиска.Колонки.Добавить("ИмяПоляВКонтролере");
		ТаблицаЗначенийСтруктурыКлючаПоиска.Колонки.Добавить("Значение");
		ТаблицаЗначенийСтруктурыКлючаПоиска.Колонки.Добавить("ТипЗначения");
		ТаблицаЗначенийСтруктурыКлючаПоиска.Колонки.Добавить("ТипОбъекта");
		ТаблицаЗначенийСтруктурыКлючаПоиска.Колонки.Добавить("КлючПоиска");
		ТаблицаЗначенийСтруктурыКлючаПоиска.Колонки.Добавить("Ссылка");

	КонецЕсли;

	Если ТипЗначения = Перечисления.НСИТипыЗначений.Справочник Тогда

		СтрокаТаблицыЗначенийСтруктурыПоиска = ТаблицаЗначенийСтруктурыКлючаПоиска.Добавить();

		СтрокаТаблицыЗначенийСтруктурыПоиска.ТипЗначения = "Справочник";
		СтрокаТаблицыЗначенийСтруктурыПоиска.ИмяПоляВКонтролере = ИмяПоляВКонтролере;
		СтрокаТаблицыЗначенийСтруктурыПоиска.Значение = Строка(Элемент);
		СтрокаТаблицыЗначенийСтруктурыПоиска.ТипОбъекта = Объект.НаименованиеВСистемеКонтролере;
		СтрокаТаблицыЗначенийСтруктурыПоиска.КлючПоиска = ПолучитьТаблицуКлючейПоиска(Объект, Элемент, Элемент);
		СтрокаТаблицыЗначенийСтруктурыПоиска.Ссылка = Элемент;

	ИначеЕсли ТипЗначения = Перечисления.НСИТипыЗначений.Перечисление Тогда

		СтрокаТаблицыЗначенийСтруктурыПоиска = ТаблицаЗначенийСтруктурыКлючаПоиска.Добавить();

		СтрокаТаблицыЗначенийСтруктурыПоиска.ТипЗначения = "Перечисление";
		СтрокаТаблицыЗначенийСтруктурыПоиска.ИмяПоляВКонтролере = ИмяПоляВКонтролере;
		СтрокаТаблицыЗначенийСтруктурыПоиска.Значение = ПолучитьИмяПеречисления(Элемент);
		СтрокаТаблицыЗначенийСтруктурыПоиска.ТипОбъекта = Объект.НаименованиеВСистемеКонтролере;
		СтрокаТаблицыЗначенийСтруктурыПоиска.КлючПоиска = "";
		СтрокаТаблицыЗначенийСтруктурыПоиска.Ссылка = Элемент;

	ИначеЕсли ТипЗначения = Перечисления.НСИТипыЗначений.Простой Тогда

		СтрокаТаблицыЗначенийСтруктурыПоиска = ТаблицаЗначенийСтруктурыКлючаПоиска.Добавить();

		СтрокаТаблицыЗначенийСтруктурыПоиска.ТипЗначения = "Простой";
		СтрокаТаблицыЗначенийСтруктурыПоиска.ИмяПоляВКонтролере = ИмяПоляВКонтролере;
		СтрокаТаблицыЗначенийСтруктурыПоиска.Значение = Элемент;
		СтрокаТаблицыЗначенийСтруктурыПоиска.ТипОбъекта = "";
		СтрокаТаблицыЗначенийСтруктурыПоиска.КлючПоиска = "";

	КонецЕсли;

	Возврат ТаблицаЗначенийСтруктурыКлючаПоиска;

КонецФункции


Функция УстановитьНовоеЗначениеРеквизита(ОбъектЭлементИзменения, РеквизитИзмененияНаименование, НовоеЗначение, ТипЗначенияРеквизита, ТипСсылочногоОбъекта, ОписаниеОшибки = "") Экспорт
	
	//->Lexa 141118
	Если РеквизитИзмененияНаименование = "ЭтоГруппа" И НовоеЗначение = "Да" Тогда
		Если ОбъектЭлементИзменения.ЭтоГруппа Тогда
			Возврат Истина;
		Иначе//!!!ПРОВЕРИТЬ НА ТО ЧТО у справочника иерархия групп
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	//<-Lexa
	
	Попытка
		Если ТипЗнч(ОбъектЭлементИзменения[РеквизитИзмененияНаименование]) = Тип("Строка") И ТипЗнч(НовоеЗначение) = Тип("Число") Тогда
			ОбъектЭлементИзменения[РеквизитИзмененияНаименование] = Формат(НовоеЗначение, "ЧГ=0");
		Иначе
			ОбъектЭлементИзменения[РеквизитИзмененияНаименование] = НовоеЗначение;
		КонецЕсли;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;

	Возврат Истина;

КонецФункции

Функция УстановитьРеквизитТабличнойЧасти(ОбъектЭлементИзменения, СтрокаИзменений, ОписаниеОшибки) Экспорт
	Перем ТаблицаСтруктурыКлюча, СтрокаКлючаНомераСтроки, к, СтрокаТабличнойЧасти;
	ТаблицаСтруктурыКлюча = ЗначениеИзСтрокиВнутр(СтрокаИзменений.РасширениеКлючаПоиска);
	СтрокаКлючаНомераСтроки = ТаблицаСтруктурыКлюча.Найти("НомерСтроки", "ИмяПоляВКонтролере");

	Если СтрокаКлючаНомераСтроки = Неопределено Тогда
		ОписаниеОшибки = "В ключе поиска строки табличной части отсутствует ключ номера строки. Объект: " + СтрокаИзменений.ЭлементИзменения;
		Возврат Ложь;
	КонецЕсли;

	Если ОбъектЭлементИзменения[СтрокаИзменений.НаименованиеОбъектаСведений].Количество() >= СтрокаКлючаНомераСтроки.Значение Тогда
		Возврат УстановитьНовоеЗначениеРеквизита(ОбъектЭлементИзменения[СтрокаИзменений.НаименованиеОбъектаСведений][СтрокаКлючаНомераСтроки.Значение - 1], СтрокаИзменений.РеквизитИзмененияНаименование, СтрокаИзменений.НовоеЗначение, СтрокаИзменений.ТипЗначенияРеквизита, СтрокаИзменений.ТипСсылочногоОбъекта, ОписаниеОшибки);
	Иначе

		Для к = ОбъектЭлементИзменения[СтрокаИзменений.НаименованиеОбъектаСведений].Количество() По СтрокаКлючаНомераСтроки.Значение - 1 Цикл
			СтрокаТабличнойЧасти = ОбъектЭлементИзменения[СтрокаИзменений.НаименованиеОбъектаСведений].Добавить();
		КонецЦикла;

		Возврат УстановитьНовоеЗначениеРеквизита(СтрокаТабличнойЧасти, СтрокаИзменений.РеквизитИзмененияНаименование, СтрокаИзменений.НовоеЗначение, СтрокаИзменений.ТипЗначенияРеквизита, СтрокаИзменений.ТипСсылочногоОбъекта, ОписаниеОшибки);

	КонецЕсли;

КонецФункции

Функция УстановитьРеквизитРегистраСведений(ОбъектЭлементИзменения, СтрокаИзменений, ОписаниеОшибки) Экспорт
	Перем ТаблицаСтруктурыКлюча;
	ТаблицаСтруктурыКлюча = ЗначениеИзСтрокиВнутр(СтрокаИзменений.РасширениеКлючаПоиска);

	Для каждого СтрокаТаблицыЗначенийСтруктурыПоиска Из ТаблицаСтруктурыКлюча Цикл

		Если СтрокаТаблицыЗначенийСтруктурыПоиска.ТипЗначения = "Справочник" И Не ЗначениеЗаполнено(СтрокаТаблицыЗначенийСтруктурыПоиска.Ссылка) Тогда
			Ссылка = Неопределено;

			Если НайтиЭлементПоКлючуПоиска(СтрокаТаблицыЗначенийСтруктурыПоиска.КлючПоиска, СтрокаТаблицыЗначенийСтруктурыПоиска.ТипОбъекта, Ссылка) Тогда
				СтрокаТаблицыЗначенийСтруктурыПоиска.Ссылка = Ссылка;
			Иначе
				ОписаниеОшибки = ОписаниеОшибки + Символы.ПС + "Не удается найти элемент " + СтрокаТаблицыЗначенийСтруктурыПоиска.Значение;
			КонецЕсли;

		КонецЕсли;

		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			Возврат Ложь;
		КонецЕсли;

	КонецЦикла;

	РегистрСведенийНаборЗаписей = РегистрыСведений[СтрокаИзменений.НаименованиеОбъектаСведений].СоздатьНаборЗаписей();

	ОтборРегистраСведений = РегистрСведенийНаборЗаписей.Отбор;
	
	// тдв то какое условие внизу то возвращает 0
	//                 |
	//   			   V
	если Строка(РегистрСведенийНаборЗаписей) = "РегистрСведенийНаборЗаписей.ит_ТорговыеТочки_Условия" тогда
		РегистрСведенийНаборЗаписей.Отбор.Период.Использование = истина;
		РегистрСведенийНаборЗаписей.Отбор.Период.Значение = ТекущаяДата();
	конецЕсли;
	// до сюда

	Для каждого СтрокаСтруктурыКлюча Из ТаблицаСтруктурыКлюча Цикл

		СтрокаОтбора = ОтборРегистраСведений.Найти(СтрокаСтруктурыКлюча.ИмяПоляВКонтролере);

		Если Не (СтрокаОтбора = Неопределено) Тогда

			Попытка
				СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
				СтрокаОтбора.Использование = Истина;
				СтрокаОтбора.Значение = ?(ЗначениеЗаполнено(СтрокаСтруктурыКлюча.Ссылка), СтрокаСтруктурыКлюча.Ссылка, СтрокаСтруктурыКлюча.Значение);
			Исключение

				ОписаниеОшибки = ОписаниеОшибки();
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;

	КонецЦикла;

	ОшибкаУстановкиЗначения = Ложь;
	
	РегистрСведенийНаборЗаписей.Прочитать();
	
    // тдв если закоментить условие что выше, текст ниже
	
	//если Строка(РегистрСведенийНаборЗаписей) = "РегистрСведенийНаборЗаписей.ит_ТорговыеТочки_Условия" тогда
	//	РегистрСведенийНаборЗаписей.Отбор.Период.Использование = истина;
	//	РегистрСведенийНаборЗаписей.Отбор.Период.Значение = ТекущаяДата();
	//конецЕсли;
	
	// тдв то возвращает несколько записей, а нужно чтоб вернуло одну по принципу срез последних
	
	
	Если РегистрСведенийНаборЗаписей.Количество() > 1 Тогда
		ОписаниеОшибки = "Для идентификации поля сведений не хватает ключей поиска. Полей более одного. Объект:" + СтрокаИзменений.ЭлементИзменения + " сведение: " + СтрокаИзменений.РеквизитИзмененияНаименование + " значение:" + СтрокаИзменений.НовоеЗначение;
		Возврат Ложь;

	ИначеЕсли РегистрСведенийНаборЗаписей.Количество() = 1 Тогда
		ЗаписьРегистраСведений = РегистрСведенийНаборЗаписей[0];
		ОшибкаУстановкиЗначения = Не УстановитьНовоеЗначениеРеквизита(ЗаписьРегистраСведений, СтрокаИзменений.РеквизитИзмененияНаименование, СтрокаИзменений.НовоеЗначение, СтрокаИзменений.ТипЗначенияРеквизита, СтрокаИзменений.ТипСсылочногоОбъекта, ОписаниеОшибки);
	Иначе

		ЗаписьРегистраСведений = РегистрСведенийНаборЗаписей.Добавить();
		ОшибкаУстановкиЗначения = Не УстановитьНовоеЗначениеРеквизита(ЗаписьРегистраСведений, СтрокаИзменений.РеквизитИзмененияНаименование, СтрокаИзменений.НовоеЗначение, СтрокаИзменений.ТипЗначенияРеквизита, СтрокаИзменений.ТипСсылочногоОбъекта, ОписаниеОшибки);

		Для каждого ОтборРегистраСведений Из РегистрСведенийНаборЗаписей.Отбор Цикл
			ЗаписьРегистраСведений[ОтборРегистраСведений.Имя] = ОтборРегистраСведений.Значение;
		КонецЦикла;

	КонецЕсли;

	Если ОшибкаУстановкиЗначения Тогда
		Возврат Ложь;
	Иначе

		Попытка
			РегистрСведенийНаборЗаписей.ОбменДанными.Загрузка = Истина;
			РегистрСведенийНаборЗаписей.Записать(Истина);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			Возврат Ложь;
		КонецПопытки;

	КонецЕсли;

	Возврат Истина;

КонецФункции

Функция ЗарегистрироватьОчередьРассылки(ЭлементИстория, ОписаниеОшибки = "", СистемаПолучатель = Неопределено) Экспорт
	Попытка
		СистемаКонтролер = ЭлементИстория.СистемаКонтролер;
		ТекущаяСистема = Константы.НСИТекущаяСистема.Получить();
		ОбъектИзменения = ЭлементИстория.ОбъектИзменения;

		ТекущаяСистемаКонтролер = СистемаКонтролер = ТекущаяСистема;

		Запрос = Новый Запрос;

		Если ТекущаяСистемаКонтролер Тогда
			Запрос.Текст = "ВЫБРАТЬ
			|	НСИИсторияИзмененияОбъектов.ЭлементИзменения,
			|	НСИИсторияИзмененияОбъектов.ОбъектИзменения,
			|	НСИИсторияИзмененияОбъектов.РеквизитИзменения,
			|	НСИИсторияИзмененияОбъектов.Ссылка КАК СтрокаИсторииИзменений
			|ПОМЕСТИТЬ ВТ_ИсторияИзмененияОбъектов
			|ИЗ
			|	Справочник.НСИИсторияИзмененияОбъектов КАК НСИИсторияИзмененияОбъектов
			|ГДЕ
			|	НСИИсторияИзмененияОбъектов.Ссылка = &ЭлементИсторииИзменений
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВложенныйЗапрос.ЭлементИзменения,
			|	ВложенныйЗапрос.ОбъектИзменения,
			|	ВложенныйЗапрос.РеквизитИзменения,
			|	ВложенныйЗапрос.СтрокаИсторииИзменений,
			|	ВЫБОР
			|		КОГДА ВложенныйЗапрос.Система ЕСТЬ NULL 
			|			ТОГДА НСИОбъектыДляКонтроляСистемыПользователи.Система
			|		ИНАЧЕ ВложенныйЗапрос.Система
			|	КОНЕЦ КАК СистемаПолучатель
			|ПОМЕСТИТЬ ВТ_Системы
			|ИЗ
			|	(ВЫБРАТЬ
			|		ВТ_ИсторияИзмененияОбъектов.ЭлементИзменения КАК ЭлементИзменения,
			|		ВТ_ИсторияИзмененияОбъектов.ОбъектИзменения КАК ОбъектИзменения,
			|		ВТ_ИсторияИзмененияОбъектов.РеквизитИзменения КАК РеквизитИзменения,
			|		ВТ_ИсторияИзмененияОбъектов.СтрокаИсторииИзменений КАК СтрокаИсторииИзменений,
			|		НСИРеквизитыОбъектовСистемыДляОбмена.Система КАК Система
			|	ИЗ
			|		ВТ_ИсторияИзмененияОбъектов КАК ВТ_ИсторияИзмененияОбъектов
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НСИРеквизитыОбъектов.СистемыДляОбмена КАК НСИРеквизитыОбъектовСистемыДляОбмена
			|			ПО ВТ_ИсторияИзмененияОбъектов.РеквизитИзменения = НСИРеквизитыОбъектовСистемыДляОбмена.Ссылка) КАК ВложенныйЗапрос
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НСИОбъектыДляКонтроля.СистемыПользователи КАК НСИОбъектыДляКонтроляСистемыПользователи
			|		ПО ВложенныйЗапрос.ОбъектИзменения = НСИОбъектыДляКонтроляСистемыПользователи.Ссылка
			|			И (ВложенныйЗапрос.Система ЕСТЬ NULL )
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Системы.ЭлементИзменения,
			|	ВТ_Системы.ОбъектИзменения,
			|	ВТ_Системы.РеквизитИзменения,
			|	ВТ_Системы.СтрокаИсторииИзменений,
			|	ЕСТЬNULL(ВТ_Системы.СистемаПолучатель, НСИИспользуемыеСистемы.Ссылка) КАК СистемаПолучатель
			|ПОМЕСТИТЬ ВТ_ВсеСистемы
			|ИЗ
			|	ВТ_Системы КАК ВТ_Системы
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НСИИспользуемыеСистемы КАК НСИИспользуемыеСистемы
			|		ПО (ВТ_Системы.СистемаПолучатель ЕСТЬ NULL )
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ВсеСистемы.ЭлементИзменения,
			|	ВТ_ВсеСистемы.ОбъектИзменения,
			|	ВТ_ВсеСистемы.РеквизитИзменения,
			|	ВТ_ВсеСистемы.СтрокаИсторииИзменений,
			|	ВТ_ВсеСистемы.СистемаПолучатель,
			|	ВТ_ВсеСистемы.ОбъектИзменения.Наименование КАК НаименованиеОбъекта,
			|	НСИОбъектыДляКонтроляСистемыПользователи.Отбор
			|ИЗ
			|	ВТ_ВсеСистемы КАК ВТ_ВсеСистемы
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НСИОбъектыДляКонтроля.СистемыПользователи КАК НСИОбъектыДляКонтроляСистемыПользователи
			|		ПО ВТ_ВсеСистемы.ОбъектИзменения = НСИОбъектыДляКонтроляСистемыПользователи.Ссылка
			|			И ВТ_ВсеСистемы.СистемаПолучатель = НСИОбъектыДляКонтроляСистемыПользователи.Система
			|ГДЕ
			|	(&ВоВсеСистемы
			|			ИЛИ ВТ_ВсеСистемы.СистемаПолучатель = &СистемаПолучатель)
			|	И ВТ_ВсеСистемы.СистемаПолучатель <> &ТекущаяСистема";
		Иначе

			Запрос.Текст = "ВЫБРАТЬ
			|	НСИИсторияИзмененияОбъектов.ЭлементИзменения,
			|	НСИИсторияИзмененияОбъектов.ОбъектИзменения,
			|	НСИИсторияИзмененияОбъектов.РеквизитИзменения,
			|	НСИИсторияИзмененияОбъектов.Ссылка КАК СтрокаИсторииИзменений,
			|	&СистемаКонтролер КАК СистемаПолучатель,
			|	НСИИсторияИзмененияОбъектов.ОбъектИзменения.Наименование КАК НаименованиеОбъекта,
			|	"""" КАК Отбор
			|ИЗ
			|	Справочник.НСИИсторияИзмененияОбъектов КАК НСИИсторияИзмененияОбъектов
			|ГДЕ
			|	НСИИсторияИзмененияОбъектов.Ссылка = &ЭлементИсторииИзменений";

		КонецЕсли;


		Запрос.УстановитьПараметр("ОбъектИзменения", ОбъектИзменения);
		Запрос.УстановитьПараметр("ТекущаяСистемаКонтролер", ТекущаяСистемаКонтролер);
		Запрос.УстановитьПараметр("ТекущаяСистема", ТекущаяСистема);
		Запрос.УстановитьПараметр("СистемаКонтролер", СистемаКонтролер);
		Запрос.УстановитьПараметр("СистемаПолучатель", СистемаПолучатель);
		Запрос.УстановитьПараметр("ВоВсеСистемы", СистемаПолучатель = Неопределено);
		Запрос.УстановитьПараметр("ЭлементИсторииИзменений", ЭлементИстория.Ссылка);

		ВыборкаСистем = Запрос.Выполнить().Выбрать();

		Пока ВыборкаСистем.Следующий() Цикл

			Если ЭлементСоответствуетОтбору(ВыборкаСистем.НаименованиеОбъекта, ВыборкаСистем.ЭлементИзменения, ВыборкаСистем.Отбор) Тогда
				НоваяЗаписьОчередь = РегистрыСведений.НСИОчередьРегистрации.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(НоваяЗаписьОчередь, ВыборкаСистем);
				НоваяЗаписьОчередь.ЭлементИзменения = ЭлементИстория.ЭлементИзменения;
				НоваяЗаписьОчередь.Записать();
			КонецЕсли;

		КонецЦикла;
	Исключение

		ОписаниеОшибки = ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;


КонецФункции

Функция НайтиЭлементПоКлючуПоиска(ТаблицаКлючПоиска, ОбъектНаименование, Элемент = Неопределено, ОбъектДляКонтроля = Неопределено, СистемаИнициатор = Неопределено)
	Перем СтрокаGUID;
	СтрокаGUID = ТаблицаКлючПоиска.Найти("GUID", "ИмяПоля");

	ЕстьGUID = Ложь;
	НашлиПоGUID = Ложь;
	НашлиПоСоответствиюGUID = Ложь;

	Если Не (СтрокаGUID = Неопределено) И Не ПустаяСтрока(СтрокаGUID.Значение) Тогда

		ЕстьGUID = Истина;
		НашлиПоGUID = Истина;
		GUID = СтрокаGUID.Значение;

		Попытка
			Элемент = Справочники[СокрЛП(ОбъектНаименование)].ПолучитьСсылку(Новый УникальныйИдентификатор(GUID));
			НашлиПоGUID = Не (Элемент = Неопределено);
		Исключение

			НашлиПоGUID = Ложь;
		КонецПопытки;

		Если НашлиПоGUID Тогда
			НашлиПоGUID = Не (Элемент.ПолучитьОбъект() = Неопределено);
		КонецЕсли;

		Если НашлиПоGUID Тогда
			Возврат Истина;
		Иначе
			Элемент = Неопределено;
		КонецЕсли;

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	НСИСоответствиеОбъектов.Объект
		|ИЗ
		|	РегистрСведений.НСИСоответствиеОбъектов КАК НСИСоответствиеОбъектов
		|ГДЕ
		|	НСИСоответствиеОбъектов.GUID = &GUID";

		Запрос.УстановитьПараметр("GUID", GUID);

		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда

			Если ЗначениеЗаполнено(Выборка.Объект) Тогда

				Если Не (ТипЗнч(Выборка.Объект) = Тип("Строка")) Тогда
					Элемент = Выборка.Объект;
					Возврат Истина;
				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СправочникНСИ.Ссылка
	|ИЗ
	|	Справочник." + ОбъектНаименование + " КАК СправочникНСИ
	|ГДЕ
	|";


	ПерваяСтрока = Истина;
	Для каждого СтрокаКлюча Из ТаблицаКлючПоиска Цикл

		Если СтрокаКлюча.ИмяПоля = "GUID" Тогда
			Продолжить;
		КонецЕсли;

		Запрос.Текст = Запрос.Текст + "
		|" + ?(ПерваяСтрока, "", "И") + "
		| СправочникНСИ." + СтрокаКлюча.ИмяПоля + " = &" + СтрокаКлюча.ИмяПоля + "
		|";

		Запрос.УстановитьПараметр(СтрокаКлюча.ИмяПоля, СтрокаКлюча.Значение);

		ПерваяСтрока = Ложь;

	КонецЦикла;

	ВыборкаУдалась = Истина;

	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		ВыборкаУдалась = Ложь;
	КонецПопытки;

	Если ВыборкаУдалась И Выборка.Следующий() Тогда
		Элемент = Выборка.Ссылка;
		Если ЕстьGUID И Не НашлиПоСоответствиюGUID Тогда

			Если Не (ОбъектДляКонтроля = Неопределено) И Не (СистемаИнициатор = Неопределено) Тогда
				ЗарегистрироватьСоответствиеОбъектовПоИзменению(ТаблицаКлючПоиска, Элемент, ОбъектДляКонтроля, СистемаИнициатор);
			КонецЕсли;

		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

Процедура СжатьИсториюИзмененияОбъектов(ДатаНачала, ДатаОкончания) Экспорт
	Перем ВременныйФайл, Выборка;
	Если Не НСИСервер.ЛицензияПрисутствует() Тогда
		РегистрацияОшибки("Архивация не работает в демо-режиме");
		Возврат;
	КонецЕсли;

	Попытка
		ВременныйФайл = ПолучитьВременныйФайл();
		Выборка = ОтобратьЭлементыИстории(ДатаНачала, ДатаОкончания);

		СоздатьФайлZip(ВременныйФайл, Выборка);

		НачатьТранзакцию();

		ДобавитьЗапись(ВременныйФайл, ДатаНачала, ДатаОкончания);
		УдалитьФайлы(ВременныйФайл);

		УдалитьЭлементыСправочника(Выборка);

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;

КонецПроцедуры

Функция ОтобратьЭлементыИстории(ДатаНачала, ДатаОкончания)
	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ 
	|	НСИИсторияИзмененияОбъектов.Ссылка
	|ИЗ
	|	Справочник.НСИИсторияИзмененияОбъектов КАК НСИИсторияИзмененияОбъектов
	|ГДЕ
	|	НСИИсторияИзмененияОбъектов.ДатаРегистрацииВСистемеИнициаторе >= &Дата1
	|	И НСИИсторияИзмененияОбъектов.ДатаРегистрацииВСистемеИнициаторе <= &Дата2";

	Запрос.УстановитьПараметр("Дата1", ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", ДатаОкончания);

	Возврат Запрос.Выполнить();

КонецФункции

Процедура СоздатьФайлZip(ПутьКАрхиву, Данные)
	СписокФайлов = Новый Массив;

	Выборка = Данные.Выбрать();

	ОбщееКоличество = Выборка.Количество();
	к = 0;
	КоличествоЭлементовВФайле = 100000;

	Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);

	ЗаписьXML = Неопределено;

	Пока Выборка.Следующий() Цикл

		Если к % КоличествоЭлементовВФайле = 0 Тогда

			Если Не (ЗаписьXML = Неопределено) Тогда
				ЗаписьXML.ЗаписатьКонецЭлемента();
				ЗаписьXML.Закрыть();
			КонецЕсли;

			ПутьКФайлу = ПолучитьВременныйФайл() + ".xml";
			СписокФайлов.Добавить(ПутьКФайлу);

			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.ОткрытьФайл(ПутьКФайлу);

			ЗаписьXML.ЗаписатьОбъявлениеXML();
			ЗаписьXML.ЗаписатьНачалоЭлемента("NSIОбъектыИстории");

		КонецЕсли;

		Сериализатор.ЗаписатьXML(ЗаписьXML, Выборка.Ссылка.ПолучитьОбъект());

		к = к + 1;
	КонецЦикла;

	Если Не (ЗаписьXML = Неопределено) Тогда
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.Закрыть();
	КонецЕсли;

	ПутьКАрхиву = СформироватьZipАрхив(СписокФайлов);

КонецПроцедуры

Процедура ДобавитьЗапись(ПутьКФайлу, ДатаНачала, ДатаОкончания)
	Запись = РегистрыСведений.НСИАрхив.СоздатьМенеджерЗаписи();
	Запись.ДатаНачала = ДатаНачала;
	Запись.ДатаОкончания = ДатаОкончания;

	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	Запись.Значение = Новый ХранилищеЗначения(ДвоичныеДанные);

	Запись.Записать();

КонецПроцедуры

Процедура УдалитьЭлементыСправочника(Данные)
	Перем Выборка, Объект;
	Выборка = Данные.Выбрать();

	Пока Выборка.Следующий() Цикл

		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.Удалить();

	КонецЦикла;

КонецПроцедуры

Функция СформироватьZipАрхив(МассивИменФайлов)
	Перем ПутьКАрхиву;
	ПутьКАрхиву = ПолучитьВременныйФайл() + ".zip";
	Архив = Новый ЗаписьZipФайла(ПутьКАрхиву, Неопределено, Неопределено, МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный);

	Для каждого ПутьКФайлу Из МассивИменФайлов Цикл
		Архив.Добавить(ПутьКФайлу, РежимСохраненияПутейZIP.НеСохранятьПути);
	КонецЦикла;
	Архив.Записать();

	Для каждого ПутьКФайлу Из МассивИменФайлов Цикл
		УдалитьФайлы(ПутьКФайлу);
	КонецЦикла;


	Возврат ПутьКАрхиву;
КонецФункции

Процедура ВосстановитьИсториюЗаПериод(ДатаНачала, ДатаОкончания) Экспорт
	Если Не НСИСервер.ЛицензияПрисутствует() Тогда
		РегистрацияОшибки("Архивация не работает в демо-режиме");
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НСИАрхив.Значение
	|ИЗ
	|	РегистрСведений.НСИАрхив КАК НСИАрхив
	|ГДЕ
	|	НСИАрхив.ДатаНачала >= &ДатаНачала
	|	И НСИАрхив.ДатаОкончания <= &ДатаОкончания";

	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВосстановитьИсториюИзмененияОбъектов(Выборка.Значение);
	КонецЦикла;

КонецПроцедуры

Процедура ВосстановитьИсториюИзмененияОбъектов(ХранилищеЗначения) Экспорт
	Перем ВременныйФайл;
	Если Не НСИСервер.ЛицензияПрисутствует() Тогда
		РегистрацияОшибки("Архивация не работает в демо-режиме");
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();

	Попытка
		ВременныйФайл = ЗаписатьАрхивВоВременныйФайл(ХранилищеЗначения);
		ВосстановитьИзZip(ВременныйФайл);
		УдалитьФайлы(ВременныйФайл);

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		РегистрацияОшибки(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

Функция ЗаписатьАрхивВоВременныйФайл(ХранилищеЗначения)
	Перем ПутьКФайлу, ДвоичныеДанные;
	ПутьКФайлу = ПолучитьВременныйФайл() + ".zip";
	ДвоичныеДанные = ХранилищеЗначения.Получить();
	ДвоичныеДанные.Записать(ПутьКФайлу);

	Возврат ПутьКФайлу;

КонецФункции

Процедура СериализоватьОбъекты(ПутьКФайлу)
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлу);
	ЧтениеXML.ПерейтиКСодержимому();
	ЧтениеXML.Прочитать();

	Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);

	Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл
		Объект = Сериализатор.ПрочитатьXML(ЧтениеXML);
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.Записать();
	КонецЦикла;

	ЧтениеXML.Закрыть();

КонецПроцедуры

Процедура ВосстановитьИзZip(ПутьКФайлу)
	Архив = Новый ЧтениеZipФайла(ПутьКФайлу);

	Каталог = ПолучитьВременныйФайл();
	СоздатьКаталог(Каталог);

	Архив.ИзвлечьВсе(Каталог);
	Для каждого ЭлементАрхива Из Архив.Элементы Цикл
		СериализоватьОбъекты(Каталог + "\" + ЭлементАрхива.Имя);
	КонецЦикла;

	УдалитьФайлы(Каталог);

	Архив.Закрыть();

КонецПроцедуры

//->Lexa 141113
Процедура ПослатьСопутствующиеРеквизиты(ОбъектДляКонтроля, РеквизитДляКонтроля, ЭлементИзмененияСсылка, ЭлементИзменения, ОбъектИзменения, СтароеЗначение, НовоеЗначение, ОписаниеОшибки)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	НСИРеквизитыОбъектовСопутствующиеРеквизиты.Реквизит,
	//			   |	НСИРеквизитыОбъектовСопутствующиеРеквизиты.ЗначениеПоУмолчанию
	//			   |ИЗ
	//			   |	Справочник.НСИРеквизитыОбъектов.СопутствующиеРеквизиты КАК НСИРеквизитыОбъектовСопутствующиеРеквизиты
	//			   |ГДЕ
	//			   |	НСИРеквизитыОбъектовСопутствующиеРеквизиты.Ссылка = &Ссылка";
	//Запрос.УстановитьПараметр("Ссылка",РеквизитДляКонтроля);
	//
	//Рез = Запрос.Выполнить().Выбрать();
	//
	//Пока Рез.Следующий() Цикл
	//КонецЦикла;
	
КонецПроцедуры
//<-Lexa