
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ВидОперации = Перечисления.ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами.КорректировкаЗадолженности Тогда
		
		Движения.Ит_ВзаиморасчетыСПродавцами.Записывать = Истина;
		Для Каждого ТекСтрокаКорректировки Из Корректировки Цикл
			
			СуммаКорректировки = ТекСтрокаКорректировки.Сумма;
			
			Если СуммаКорректировки < 0 Тогда
				СуммаКорректировки = -СуммаКорректировки;
				ВидДвижения = ВидДвиженияНакопления.Расход;	
			Иначе
				ВидДвижения = ВидДвиженияНакопления.Приход;
			КонецЕсли;
			
			Движение 								= Движения.Ит_ВзаиморасчетыСПродавцами.Добавить();
			Движение.ВидДвижения					= ВидДвижения;
			Движение.Период							= Дата;
			Движение.Продавец						= ТекСтрокаКорректировки.Продавец;
			Движение.ДокументИнвентаризации 		= ТекСтрокаКорректировки.ДокументИнвентаризации;
			Движение.Магазин						= ТекСтрокаКорректировки.Магазин;
			Движение.СуммаДолга						= СуммаКорректировки;
			
			Если ЗначениеЗаполнено(ТекСтрокаКорректировки.ПланируемыйИсточникУдержания) Тогда
				Движение.ПланируемыйИсточникУдержания = ТекСтрокаКорректировки.ПланируемыйИсточникУдержания;
			Иначе
				Движение.ПланируемыйИсточникУдержания 	= ПланируемыйИсточникУдержания;
			КонецЕсли;
		
			Если ЗначениеЗаполнено(ТекСтрокаКорректировки.ПериодУдержания) Тогда
				Движение.ПериодУдержания = НачалоМесяца(ТекСтрокаКорректировки.ПериодУдержания);
			Иначе
				Движение.ПериодУдержания = НачалоМесяца(ПериодУдержания);
			КонецЕсли;
			//Если ВидОперации = Перечисления.ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами.УдержаниеИзЗП Тогда
			Движение.ТипУдержания = ТекСтрокаКорректировки.ТипУдержания;
			//ИначеЕсли ВидОперации = Перечисления.ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами.ВнесениеДС Тогда
			//	Движение.ТипУдержания = Перечисления.ИТ_ТипыУдержанийПоРезультатамИнвентаризаций.ПоПКО;
			//КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ВидОперации = Перечисления.ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами.УдержаниеИзЗП
		Или ВидОперации = Перечисления.ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами.ВнесениеДС Тогда
		
		Движения.Ит_ВзаиморасчетыСПродавцами.Записывать = Истина;
		Для Каждого ТекСтрокаКорректировки Из Корректировки Цикл
			Движение								= Движения.Ит_ВзаиморасчетыСПродавцами.Добавить();		
			Движение.ВидДвижения					= ВидДвиженияНакопления.Расход;
			Движение.Период							= Дата;
			Движение.Продавец						= ТекСтрокаКорректировки.Продавец;
			Движение.ДокументИнвентаризации 		= ТекСтрокаКорректировки.ДокументИнвентаризации;
			Движение.Магазин						= ТекСтрокаКорректировки.Магазин;
			Движение.СуммаДолга						= ТекСтрокаКорректировки.Сумма;
			Движение.ТипУдержания					= ТекСтрокаКорректировки.ТипУдержания;
			
			Если ЗначениеЗаполнено(ТекСтрокаКорректировки.ПланируемыйИсточникУдержания) Тогда
				Движение.ПланируемыйИсточникУдержания = ТекСтрокаКорректировки.ПланируемыйИсточникУдержания;
			Иначе
				Движение.ПланируемыйИсточникУдержания = ПланируемыйИсточникУдержания;
			КонецЕсли;

			Если ЗначениеЗаполнено(ТекСтрокаКорректировки.ПериодУдержания) Тогда
				Движение.ПериодУдержания = НачалоМесяца(ТекСтрокаКорректировки.ПериодУдержания);
			Иначе
				Движение.ПериодУдержания = НачалоМесяца(ПериодУдержания);
			КонецЕсли;
		КонецЦикла;
		
	//ИначеЕсли Тогда	
	ИначеЕсли ВидОперации = Перечисления.ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами.СписаниеЗадолженности Тогда
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДокументОснование") И ДанныеЗаполнения.Свойство("ТаблицаДанныхДляКорректировки") Тогда
			
			Основание = ДанныеЗаполнения.ДокументОснование;
			
			Если Не ЗначениеЗаполнено(Основание) Тогда
				Сообщить("Корректировку можно создать только на основании Пакета документов или фиксации результатов инвентаризации!");
				Возврат;
			КонецЕсли;
			
			ДеньМесяцаДляПериодаУдержания = Константы.ИТ_ДеньМесяцаДляОпределенияПериодаУдержания.Получить();
			
			Дата							= ТекущаяДата();
			ВидОперации						= Перечисления.ИТ_ВидыОперацийКорректировкиВзаиморасчетовСПродавцами.КорректировкаЗадолженности;
			ДокументОснование				= Основание;
			ЛинейныйМенеджер				= Основание.ЛинейныйМенеджер;
			ПланируемыйИсточникУдержания	= Перечисления.ИТ_ПланируемыеИсточникиУдержаний.ЗП;
			
			Если День(ТекущаяДата()) < ДеньМесяцаДляПериодаУдержания Тогда
				ПериодУдержания = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), -1));
			Иначе
				ПериодУдержания = НачалоМесяца(ТекущаяДата());
			КонецЕсли;
			
			Для Каждого СтрокаДляКорректировки Из ДанныеЗаполнения.ТаблицаДанныхДляКорректировки Цикл
				НоваяСтрокаКорректировки = Корректировки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаКорректировки, СтрокаДляКорректировки);
				НоваяСтрокаКорректировки.ПланируемыйИсточникУдержания = Перечисления.ИТ_ПланируемыеИсточникиУдержаний.ЗП;
				НоваяСтрокаКорректировки.ПериодУдержания = ПериодУдержания;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

