
&НаКлиенте
Процедура Распределить(Команда)
	
	Если ТаможеннаяСтоимость ИЛИ ИмпортнаяПошлинаСумма ИЛИ АнтидемпинговаяПошлинаСумма ИЛИ СуммаАкциза ИЛИ СуммаНДС Тогда
		
		Распределить = Новый Структура();
		Распределить.Вставить("ТаможеннаяСтоимость", ТаможеннаяСтоимость);
		Распределить.Вставить("ИмпортнаяПошлинаСумма", ИмпортнаяПошлинаСумма);
		Распределить.Вставить("АнтидемпинговаяПошлинаСумма", АнтидемпинговаяПошлинаСумма);
		Распределить.Вставить("СуммаАкциза", СуммаАкциза);
		Распределить.Вставить("СуммаНДС", СуммаНДС);
		
	КонецЕсли;
	
	Закрыть(Распределить);
	
КонецПроцедуры
