// Модуль основной формы документа "Планирование ассортимента формата категорий"
&НаКлиенте
перем ШтрихКодДляПоиска;
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
//Формирует дерево Форматов. Если объект уже записан и у него заполнена таблица Форматы, 
//то в дереве для выбранных форматов устанавливается пометка.
//
Процедура ЗаполнитьДеревоФорматовНаСервере() Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ОбъектФорматы.Формат КАК Формат
	|ПОМЕСТИТЬ ОбъектФорматы
	|ИЗ
	|	&ОбъектФорматы КАК ОбъектФорматы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФорматыКатегорий.Ссылка КАК Формат,
	|	ФорматыКатегорий.Порядок КАК Порядок,
	|	ФорматыКатегорий.НеУчаствуетВДвижениях КАК НеУчаствуетВДвижениях,
	|	МАКСИМУМ(ВЫБОР КОГДА ОбъектФорматы.Формат ЕСТЬ NULL	ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ) КАК Пометка
	|ИЗ
	|	Справочник.ФорматыКатегорий КАК ФорматыКатегорий
	|	ЛЕВОЕ СОЕДИНЕНИЕ ОбъектФорматы КАК ОбъектФорматы
	|	ПО ФорматыКатегорий.Ссылка = ОбъектФорматы.Формат
	|ГДЕ
	|	НЕ ФорматыКатегорий.ПометкаУдаления
	|СГРУППИРОВАТЬ ПО
	|	ФорматыКатегорий.Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	ФорматыКатегорий.Порядок ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ");
	
	Запрос.УстановитьПараметр("ОбъектФорматы", Объект.Форматы.Выгрузить(,"Формат"));
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(Дерево, "ДеревоФорматов");
	
КонецПроцедуры //ЗаполнитьДеревоФорматовНаСервере()

// Процедура формирования данных табличной части "Товары" документа
//
&НаСервере
Процедура ЗаполнитьТаблицуТоваров()
	
	Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
		
		Для Каждого текФормат Из Объект.Форматы Цикл
			ПредставлениеФормата = СтрЗаменить(текФормат.Формат.УникальныйИдентификатор(),"-","_");
			
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.Номенклатура	= ТекущаяСтрока.Номенклатура;
			НоваяСтрока.Формат			= текФормат.Формат;
			НоваяСтрока.Количество		= ТекущаяСтрока["Количество"+ПредставлениеФормата];

		КонецЦикла;
		
		Для Каждого текСегмент Из ТаблицаЦеновыхСегментов Цикл
			ЦеновойСегмент = текСегмент.ЦеновойСегмент;
			
			НоваяСтрока = Объект.ЦеновыеСегменты.Добавить();
			НоваяСтрока.Номенклатура	= ТекущаяСтрока.Номенклатура;
			НоваяСтрока.ЦеновойСегмент	= текСегмент.ЦеновойСегмент;
			НоваяСтрока.Количество		= ТекущаяСтрока["ЦеновойСегмент"+ЦеновойСегмент.Код];
			
			НоваяСтрока.ЦенаМинимум		= ТекущаяСтрока.ЦенаМинимум;
			НоваяСтрока.ЦенаМаксимум	= ТекущаяСтрока.ЦенаМаксимум;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТаблицуТоваров()

// процедура заполнения реквизитов формы данными объекта
//
&НаСервере
Процедура ЗаполнениеДаннымиПоДокументу() Экспорт
	
	ТаблицаФорматов.Загрузить(Объект.Форматы.Выгрузить(, "Формат"));
	
	тзНоменклатуры = Объект.Товары.Выгрузить(, "Номенклатура");
	тзНоменклатуры.Свернуть("Номенклатура");
	
	//ТаблицаНоменклатуры.Загрузить(тзНоменклатуры);
	ТаблицаНоменклатуры.Очистить();
	Для Каждого ТекущаяСтрока Из тзНоменклатуры Цикл
		СтрокаНоменклатуры = ТаблицаНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНоменклатуры, ТекущаяСтрока);
		СтрокаНоменклатуры.НомерСтроки = ТаблицаНоменклатуры.Количество();
		
		Если ТекущаяСтрока.Номенклатура.ЭтоГруппа Тогда
			СтрокаНоменклатуры.КартинкаСтроки = БиблиотекаКартинок.Папка;
		Иначе
			СтрокаНоменклатуры.КартинкаСтроки = БиблиотекаКартинок.Реквизит;
		КонецЕсли;
	КонецЦикла;
	
	//добавим колонки из форматов
	Для Каждого текФормат Из Объект.Форматы Цикл
		СоздатьКолонкуФормата(текФормат.Формат, Истина);
		
		ИдентификаторФормата = СтрЗаменить(текФормат.Формат.УникальныйИдентификатор(),"-","_");
		
		Для Каждого ТекСтрока Из ТаблицаНоменклатуры Цикл
			НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура,Формат", ТекСтрока.Номенклатура, текФормат.Формат));
			Если НайденныеСтроки.Количество()>0 Тогда
				ТекСтрока["Количество" + ИдентификаторФормата] = НайденныеСтроки[0].Количество;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//рассчет итогов по колонкам
	тзТаблицаНоменклатуры = ТаблицаНоменклатуры.Выгрузить();
	Для Каждого текРекв Из ЭтотОбъект.ПолучитьРеквизиты("ТаблицаНоменклатуры") Цикл
		Если СтрНайти(текРекв.Имя,"Количество")>0 ИЛИ СтрНайти(текРекв.Имя,"ПредыдущееЗначение")>0 Тогда
			Элементы["ТаблицаНоменклатуры"+текРекв.Имя].ТекстПодвала = Формат(тзТаблицаНоменклатуры.Итог(текРекв.Имя), "ЧН=");
		КонецЕсли;
	КонецЦикла;
	
	//ЗаполнитьТаблицуЦеновыхСегментов();
	тзСегментов = Объект.ЦеновыеСегменты.Выгрузить(, "ЦеновойСегмент");
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.ЦеновыеСегменты ГДЕ Ссылка В(&Сегменты) УПОРЯДОЧИТЬ ПО Порядок");
	Запрос.УстановитьПараметр("Сегменты", тзСегментов.ВыгрузитьКолонку("ЦеновойСегмент"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаЦеновыхСегментов.Добавить();
		НоваяСтрока.ЦеновойСегмент = Выборка.Ссылка;
	КонецЦикла;
	
	СоздатьКолонкиЦеновыхСегментов();
	
	//заполним ценовые сегменты
	Для Каждого ТекущаяСтрока Из Объект.ЦеновыеСегменты Цикл
		ЦеновойСегмент = ТекущаяСтрока.ЦеновойСегмент;
		СтрокиНоменклатуры = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("Номенклатура", ТекущаяСтрока.Номенклатура));
		Если СтрокиНоменклатуры.Количество()>0 Тогда
			СтрокаНоменклатуры = СтрокиНоменклатуры[0];
			СтрокаНоменклатуры["ЦеновойСегмент"+ЦеновойСегмент.Код] = ТекущаяСтрока.Количество;
			
			СтрокаНоменклатуры.ЦенаМинимум	= ТекущаяСтрока.ЦенаМинимум;
			СтрокаНоменклатуры.ЦенаМаксимум	= ТекущаяСтрока.ЦенаМаксимум;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнениеДаннымиПоДокументу()

&НаСервере
Процедура СоздатьКолонкиЦеновыхСегментов()
	
	Если Элементы.Найти("ТаблицаНоменклатурыГруппаЦеновыеСегменты")<>Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокТекущихРеквизитов		= Новый СписокЗначений;
	СписокКолонок				= Новый СписокЗначений;
	МассивДобавляемыхРеквизитов	= Новый Массив;
	
	//получим в список, все реквизиты таблицы
	МассивРеквизитовТаблицы = ЭтотОбъект.ПолучитьРеквизиты("ТаблицаНоменклатуры");
	Для Каждого текРеквизит Из МассивРеквизитовТаблицы Цикл
		СписокТекущихРеквизитов.Добавить(текРеквизит.Имя);
	КонецЦикла;	
	
	//определим необходимые к добалению колонки Ценовых сегментов
	Для Каждого ТекущаяСтрока Из ТаблицаЦеновыхСегментов Цикл
		ЦеновойСегмент = ТекущаяСтрока.ЦеновойСегмент;
		ИмяРеквизита = "ЦеновойСегмент" + ЦеновойСегмент.Код;
		
		СписокКолонок.Добавить(ИмяРеквизита);
		
		Если СписокТекущихРеквизитов.НайтиПоЗначению(ИмяРеквизита)=Неопределено Тогда
			НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)), "ТаблицаНоменклатуры", НСтр("ru = '" + ЦеновойСегмент.Наименование + "'"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		КонецЕсли;
	КонецЦикла;
	
	//определим необходимые к добалению колонки Границ цен
	Если СписокТекущихРеквизитов.НайтиПоЗначению("ЦенаМинимум")=Неопределено Тогда
		НовыйРеквизит = Новый РеквизитФормы("ЦенаМинимум", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Неотрицательный)), "ТаблицаНоменклатуры", НСтр("ru = 'Цена мин.'"));
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ЦенаМаксимум", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Неотрицательный)), "ТаблицаНоменклатуры", НСтр("ru = 'Цена макс.'"));
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	КонецЕсли;
	
	//добавим отсутствующие реквизиты
	Если МассивДобавляемыхРеквизитов.Количество()<>0 Тогда
		ЭтотОбъект.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	КонецЕсли;
	
	
	// Создаем группу колонок Ценовых сегментов
	НоваяГруппаКолонок = Элементы.Добавить("ТаблицаНоменклатурыГруппаЦеновыеСегменты", Тип("ГруппаФормы"), Элементы.ТаблицаНоменклатуры);
	НоваяГруппаКолонок.Вид				= ВидГруппыФормы.ГруппаКолонок;
	НоваяГруппаКолонок.Заголовок		= "Ценовые сегменты";
	НоваяГруппаКолонок.ОтображатьВШапке	= Истина;
	НоваяГруппаКолонок.Группировка		= ГруппировкаКолонок.Горизонтальная;
	НоваяГруппаКолонок.Подсказка		= НСтр("ru = 'Ценовые сегменты'");
	
	// Создадим новые колонки Ценовых сегментов
	Для Каждого ТекСтрока Из СписокКолонок Цикл
		НоваяКолонка = Элементы.Добавить("ТаблицаНоменклатуры" + ТекСтрока.Значение, Тип("ПолеФормы"), НоваяГруппаКолонок);
		НоваяКолонка.Вид						= ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ПутьКДанным				= "ТаблицаНоменклатуры." + ТекСтрока.Значение;
		НоваяКолонка.Ширина						= 5;
		НоваяКолонка.РастягиватьПоГоризонтали	= Ложь;
		НоваяКолонка.РежимРедактирования		= РежимРедактированияКолонки.ВходПриВводе;
	КонецЦикла;
	
	
	// Создаем группу колонок Границы цен
	НоваяГруппаКолонок = Элементы.Добавить("ТаблицаНоменклатурыГруппаГраницыЦен", Тип("ГруппаФормы"), Элементы.ТаблицаНоменклатуры);
	НоваяГруппаКолонок.Вид = ВидГруппыФормы.ГруппаКолонок;
	НоваяГруппаКолонок.Заголовок = "Границы цен";
	НоваяГруппаКолонок.ОтображатьВШапке = Истина;
	НоваяГруппаКолонок.Группировка = ГруппировкаКолонок.Горизонтальная;
	НоваяГруппаКолонок.Подсказка = НСтр("ru = 'Границы цен'");
	
	// Создадим новые колонки в группе Границы цен
	НоваяКолонка = Элементы.Добавить("ТаблицаНоменклатурыЦенаМинимум", Тип("ПолеФормы"), НоваяГруппаКолонок);
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.ПутьКДанным = "ТаблицаНоменклатуры.ЦенаМинимум";
	НоваяКолонка.Ширина = 1;
	НоваяКолонка.РастягиватьПоГоризонтали = Ложь;
	НоваяКолонка.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
	
	НоваяКолонка = Элементы.Добавить("ТаблицаНоменклатурыЦенаМаксимум", Тип("ПолеФормы"), НоваяГруппаКолонок);
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.ПутьКДанным = "ТаблицаНоменклатуры.ЦенаМаксимум";
	НоваяКолонка.Ширина = 1;
	НоваяКолонка.РастягиватьПоГоризонтали = Ложь;
	НоваяКолонка.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
	
КонецПроцедуры //СоздатьКолонкиЦеновыхСегментов()

// Процедура создания реквизитов и элементов выбранных форматов
//
&НаСервере
Процедура СоздатьКолонкуФормата(Формат, СоздатьРеквизиты=Ложь); //МассивСтарыхФорматов=Неопределено)
	
	ИдентификаторФормата = СтрЗаменить(Формат.УникальныйИдентификатор(),"-","_");

	Если Элементы.Найти("ТаблицаНоменклатурыГруппа"+ИдентификаторФормата)<>Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяГруппаКолонок = Элементы.Добавить("ТаблицаНоменклатурыГруппа" + ИдентификаторФормата, Тип("ГруппаФормы"), Элементы.ТаблицаНоменклатуры);
	НоваяГруппаКолонок.Вид = ВидГруппыФормы.ГруппаКолонок;
	НоваяГруппаКолонок.Заголовок = Формат.Наименование;
	НоваяГруппаКолонок.ОтображатьВШапке = Истина;
	НоваяГруппаКолонок.Группировка = ГруппировкаКолонок.Горизонтальная;
	НоваяГруппаКолонок.Подсказка = НСтр("ru = 'Формат ""'") + Формат.Наименование + """";
	НоваяГруппаКолонок.РастягиватьПоГоризонтали = Ложь;
	
	МассивРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы("ПредыдущееЗначение"+ИдентификаторФормата, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)), "ТаблицаНоменклатуры", НСтр("ru = 'Тек.'"));
	МассивРеквизитов.Добавить(НовыйРеквизит);
	НовыйРеквизит = Новый РеквизитФормы("Количество"+ИдентификаторФормата, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)), "ТаблицаНоменклатуры", НСтр("ru = 'План'"));
	МассивРеквизитов.Добавить(НовыйРеквизит);
	
	Если СоздатьРеквизиты Тогда
		ЭтотОбъект.ИзменитьРеквизиты(МассивРеквизитов);
	КонецЕсли;
	
	Для Индекс=0 По МассивРеквизитов.Количество()-1 Цикл
		ТекСтрока = МассивРеквизитов[Индекс];
		
		// Создадим новые колонки
		НоваяКолонка = Элементы.Добавить("ТаблицаНоменклатуры" + ТекСтрока.Имя, Тип("ПолеФормы"), НоваяГруппаКолонок);
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ПутьКДанным = "ТаблицаНоменклатуры." + ТекСтрока.Имя;
		НоваяКолонка.Ширина = 2;
		НоваяКолонка.РастягиватьПоГоризонтали = Ложь;
		НоваяКолонка.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
		НоваяКолонка.ОтображатьВШапке = Ложь;
		НоваяКолонка.Доступность = Найти(ТекСтрока.Имя,"Количество")>0;
		Если НЕ НоваяКолонка.Доступность Тогда
			НоваяКолонка.ЦветТекста = ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет;
		КонецЕсли;
		
		Если СтрНайти(ТекСтрока.Имя,"Количество") Тогда
			НоваяКолонка.УстановитьДействие("ПриИзменении", "Подключаемый_ТаблицаНоменклатурыКоличествоПриИзменении");
		КонецЕсли;
		
		Если СтрНайти(ТекСтрока.Имя,"ПредыдущееЗначение") Тогда
			НоваяКолонка.Видимость = ОтобразитьПредыдущиеЗначения;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТекСтрока Из ТаблицаНоменклатуры Цикл
		ТекСтрока["ПредыдущееЗначение" + ИдентификаторФормата] = ПолучитьТекущийПлан(ТекСтрока.Номенклатура, Формат);
	КонецЦикла;
	
КонецПроцедуры //СоздатьКолонкуФормата()

&НаСервере
Функция ПолучитьТекущийПлан(Номенклатура, Формат, НаДату=Неопределено)
	
	Если НаДату=Неопределено Тогда
		НаДату = Объект.ДатаНачалаДействия - 1;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Регистратор,
	|	Номенклатура,
	|	Формат,
	|	Период,
	|	Количество	
	|ПОМЕСТИТЬ ПлановыеЗначения
	|ИЗ
	|	РегистрСведений.ПланированиеАссортиментаФорматов
	|ГДЕ
	|	Номенклатура=&Номенклатура
	|	И Формат=&Формат
	|	И Период<=&НаДату
	|;
	|ВЫБРАТЬ
	|	План.Количество КАК Количество
	|ИЗ
	|	ПлановыеЗначения КАК План
	|ГДЕ
	|	План.Регистратор В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ПлановыеЗначения.Регистратор
	|		ИЗ
	|			ПлановыеЗначения КАК ПлановыеЗначения
	|		ГДЕ
	|			ПлановыеЗначения.Номенклатура=План.Номенклатура
	|			И ПлановыеЗначения.Формат=План.Формат
	|		УПОРЯДОЧИТЬ ПО
	|			ПлановыеЗначения.Период УБЫВ)
	|	И План.Количество<>0
	|");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Формат", Формат);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции //ПолучитьТекущийПлан()

// Процедура заполнения табличной части товарами
//
&НаСервере
Процедура ЗаполнитьТаблицуТоварами(ТаблицаТоваров)
	
	Если ТаблицаТоваров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = ?(ТаблицаНоменклатуры.Количество() = 0, -1, Элементы.ТаблицаНоменклатуры.ТекущаяСтрока);
	
	Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
		Элементы.ТаблицаНоменклатуры.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		ТаблицаНоменклатурыНоменклатураПриИзмененииНаСервере();
	КонецЦикла;
	
	Если ТаблицаНоменклатуры.Количество() > 0 Тогда
		Элементы.ТаблицаНоменклатуры.ТекущаяСтрока = ?(ТекущаяСтрока = -1, ТаблицаНоменклатуры[0].ПолучитьИдентификатор(), ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьТаблицуТоварами()

// Обработчик заполнения документа выбранной группой или всей номенклатурой
//
&НаСервере
Процедура ТоварыЗаполнитьНоменклатурой(Объект, ГруппаНоменклатуры=Неопределено, ПомеченныеНаУдаление=Ложь)
	
	УровеньКатегории = ПолучитьЗначениеУчетнойПолитики("УровеньКатегорииНоменклатуры",, Объект.Дата);
	Если УровеньКатегории=0 Тогда
		ВывестиСообщение(НСтр("ru = 'Уровень категории равен нулю.'"), ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	стрРодитель = "";
	Для Уровень=1 По УровеньКатегории Цикл
		стрРодитель = стрРодитель + ?(ЗначениеЗаполнено(стрРодитель), ".", "") + "Родитель";
	КонецЦикла;
	
	//Запрос групп третьего уровня
	ТекстЗапроса = "
	|ВЫБРАТЬ Ссылка
	|ИЗ	Справочник.Номенклатура
	|ГДЕ ЭтоГруппа
	|	И "+?(ПомеченныеНаУдаление,"","НЕ")+" ПометкаУдаления
	|	И НЕ " + стрРодитель + " ЕСТЬ NULL
	|	И " + стрРодитель + ".Родитель ЕСТЬ NULL
	|	И (&ФильтрПоРодителю ИЛИ Ссылка В ИЕРАРХИИ (&Родитель))";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Родитель", ГруппаНоменклатуры);
	Запрос.УстановитьПараметр("ФильтрПоРодителю", ГруппаНоменклатуры=Неопределено);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Ссылка;
		НоваяСтрока.НомерСтроки = ТаблицаНоменклатуры.Количество();
		Элементы.ТаблицаНоменклатуры.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		ТаблицаНоменклатурыНоменклатураПриИзмененииНаСервере(ПомеченныеНаУдаление);
	КонецЦикла;
	
КонецПроцедуры // ТоварыЗаполнитьНоменклатурой()

&НаСервере
Процедура ОбновитьОтображениеТаблицаНоменклатуры()
	
	тзНовыхЦеновыхСегментов = Новый ТаблицаЗначений;
	тзНовыхЦеновыхСегментов.Колонки.Добавить("ЦеновойСегмент", Новый ОписаниеТипов("СправочникСсылка.ЦеновыеСегменты"));
	БылиИзмененияФорматов = Ложь;
	
	тзФорматов = ТаблицаФорматов.Выгрузить();
	
	// Удалим неиспользуемые форматы
	Для Каждого ТекущаяСтрока Из тзФорматов Цикл
		
		ПредставлениеФормата = СтрЗаменить(ТекущаяСтрока.Формат.УникальныйИдентификатор(), "-", "_");
		
		//удаляем все элемнты форматов
		СтарыйЭлементФормата = "ТаблицаНоменклатурыГруппа" + ПредставлениеФормата;
		Если Элементы.Найти(СтарыйЭлементФормата)<>Неопределено Тогда
			Элементы.Удалить(Элементы[СтарыйЭлементФормата]);
		КонецЕсли;
		
		//находим лишние форматы и удаляем их
		НайденныеСтроки = Объект.Форматы.НайтиСтроки(Новый Структура("Формат", ТекущаяСтрока.Формат));
		Если НайденныеСтроки.Количество()=0 Тогда
			НайденныеФорматы = ТаблицаФорматов.НайтиСтроки(Новый Структура("Формат", ТекущаяСтрока.Формат));
			
			Для Каждого ТекСтрока Из НайденныеФорматы Цикл
				ТаблицаФорматов.Удалить(ТекСтрока);
			КонецЦикла;
			
			МассивДляУдаления = Новый Массив;
			МассивДляУдаления.Добавить("ТаблицаНоменклатуры.ПредыдущееЗначение" + ПредставлениеФормата);
			МассивДляУдаления.Добавить("ТаблицаНоменклатуры.Количество" + ПредставлениеФормата);
		
			ЭтотОбъект.ИзменитьРеквизиты(, МассивДляУдаления);
			
			БылиИзмененияФорматов = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из Объект.Форматы Цикл
	
		НайденныеСтроки = тзФорматов.Найти(ТекущаяСтрока.Формат);
	
		Если НайденныеСтроки=Неопределено Тогда
			НоваяСтрока = ТаблицаФорматов.Добавить();
			НоваяСтрока.Формат = ТекущаяСтрока.Формат;
			
			СоздатьКолонкуФормата(ТекущаяСтрока.Формат, Истина);
			
			БылиИзмененияФорматов = Истина;

		Иначе
			
			СоздатьКолонкуФормата(ТекущаяСтрока.Формат);
		КонецЕсли;
		
		//получим ценовые сегменты формата
		тчЦеновыхСегментовФормата = ТекущаяСтрока.Формат.ЦеновыеСегменты;
		Если тчЦеновыхСегментовФормата.Количество()=0 Тогда
			тчЦеновыхСегментовФормата = ТекущаяСтрока.Формат.Родитель.ЦеновыеСегменты;
		КонецЕсли;
		
		Для Каждого текСтрока Из тчЦеновыхСегментовФормата Цикл
			НоваяСтрока = тзНовыхЦеновыхСегментов.Добавить();
			НоваяСтрока.ЦеновойСегмент = текСтрока.Сегмент;
		КонецЦикла;
		
	КонецЦикла;
	
	//рассчет итогов по колонкам
	тзТаблицаНоменклатуры = ТаблицаНоменклатуры.Выгрузить();
	Для Каждого текРекв Из ЭтотОбъект.ПолучитьРеквизиты("ТаблицаНоменклатуры") Цикл
		Если СтрНайти(текРекв.Имя,"Количество")>0 ИЛИ СтрНайти(текРекв.Имя,"ПредыдущееЗначение")>0 Тогда
			Элементы["ТаблицаНоменклатуры"+текРекв.Имя].ТекстПодвала = Формат(тзТаблицаНоменклатуры.Итог(текРекв.Имя), "ЧН=");
		КонецЕсли;
	КонецЦикла;
	
	//СЕГМЕНТЫ
	
	Если БылиИзмененияФорматов Тогда
		тзНовыхЦеновыхСегментов.Свернуть("ЦеновойСегмент");
	Иначе
		тзНовыхЦеновыхСегментов = ТаблицаЦеновыхСегментов.Выгрузить();
	КонецЕсли;
	
	//удаляем все элемнты сегментов
	Если Элементы.Найти("ТаблицаНоменклатурыГруппаЦеновыеСегменты")<>Неопределено Тогда
		Элементы.Удалить(Элементы["ТаблицаНоменклатурыГруппаЦеновыеСегменты"]);
	КонецЕсли;
	
	тзСегментов = ТаблицаЦеновыхСегментов.Выгрузить();
	
	// Удалим неиспользуемые сегменты
	Для Каждого ТекущаяСтрока Из тзСегментов Цикл
	
		//находим лишние сегменты и удаляем их
		НайденныеСтроки = тзНовыхЦеновыхСегментов.НайтиСтроки(Новый Структура("ЦеновойСегмент", ТекущаяСтрока.ЦеновойСегмент));
		Если НайденныеСтроки.Количество()=0 Тогда
			НайденныеСегменты = ТаблицаЦеновыхСегментов.НайтиСтроки(Новый Структура("ЦеновойСегмент", ТекущаяСтрока.ЦеновойСегмент));
			
			Для Каждого ТекСтрока Из НайденныеСегменты Цикл
				ТаблицаЦеновыхСегментов.Удалить(ТекСтрока);
			КонецЦикла;
			
			МассивДляУдаления = Новый Массив;
			МассивДляУдаления.Добавить("ТаблицаНоменклатуры.ЦеновойСегмент" + ТекущаяСтрока.ЦеновойСегмент.Код);
		
			ЭтотОбъект.ИзменитьРеквизиты(, МассивДляУдаления);
		КонецЕсли;
		
	КонецЦикла;
		
	// Создаем группу колонок Ценовых сегментов
	НоваяГруппаКолонок = Элементы.Добавить("ТаблицаНоменклатурыГруппаЦеновыеСегменты", Тип("ГруппаФормы"), Элементы.ТаблицаНоменклатуры);
	НоваяГруппаКолонок.Вид				= ВидГруппыФормы.ГруппаКолонок;
	НоваяГруппаКолонок.Заголовок		= "Ценовые сегменты";
	НоваяГруппаКолонок.ОтображатьВШапке	= Истина;
	НоваяГруппаКолонок.Группировка		= ГруппировкаКолонок.Горизонтальная;
	НоваяГруппаКолонок.Подсказка		= НСтр("ru = 'Ценовые сегменты'");
	
	Для Каждого ТекущаяСтрока Из тзНовыхЦеновыхСегментов Цикл
	
		НайденныеСтроки = тзСегментов.Найти(ТекущаяСтрока.ЦеновойСегмент);
	
		Если НайденныеСтроки=Неопределено Тогда
			НоваяСтрока = ТаблицаЦеновыхСегментов.Добавить();
			НоваяСтрока.ЦеновойСегмент = ТекущаяСтрока.ЦеновойСегмент;
			
			ИмяРеквизита = "ЦеновойСегмент" + ТекущаяСтрока.ЦеновойСегмент.Код;
			
			МассивРеквизитов = Новый Массив;
			НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)), "ТаблицаНоменклатуры", НСтр("ru = '" + ТекущаяСтрока.ЦеновойСегмент.Наименование + "'"));
			МассивРеквизитов.Добавить(НовыйРеквизит);
			
			ЭтотОбъект.ИзменитьРеквизиты(МассивРеквизитов);
			
			НоваяКолонка = Элементы.Добавить("ТаблицаНоменклатуры" + ИмяРеквизита, Тип("ПолеФормы"), НоваяГруппаКолонок);
			НоваяКолонка.Вид						= ВидПоляФормы.ПолеВвода;
			НоваяКолонка.ПутьКДанным				= "ТаблицаНоменклатуры." + ИмяРеквизита;
			НоваяКолонка.Ширина						= 5;
			НоваяКолонка.РастягиватьПоГоризонтали	= Ложь;
			НоваяКолонка.РежимРедактирования		= РежимРедактированияКолонки.ВходПриВводе;
			
		Иначе
			
			ИмяРеквизита = "ЦеновойСегмент" + ТекущаяСтрока.ЦеновойСегмент.Код;
			
			НоваяКолонка = Элементы.Добавить("ТаблицаНоменклатуры" + ИмяРеквизита, Тип("ПолеФормы"), НоваяГруппаКолонок);
			НоваяКолонка.Вид						= ВидПоляФормы.ПолеВвода;
			НоваяКолонка.ПутьКДанным				= "ТаблицаНоменклатуры." + ИмяРеквизита;
			НоваяКолонка.Ширина						= 5;
			НоваяКолонка.РастягиватьПоГоризонтали	= Ложь;
			НоваяКолонка.РежимРедактирования		= РежимРедактированияКолонки.ВходПриВводе;
			
		КонецЕсли;
		
	КонецЦикла;
	
	//ГРАНИЦЫ ЦЕН
	
	//удаляем все элемнты границ цен
	Если Элементы.Найти("ТаблицаНоменклатурыГруппаГраницыЦен")<>Неопределено Тогда
		Элементы.Удалить(Элементы["ТаблицаНоменклатурыГруппаГраницыЦен"]);
	КонецЕсли;
	
	Если тзНовыхЦеновыхСегментов.Количество()>0 Тогда
		
		//проверим наличие реквизитов
		МассивРеквизитовТаблицы = ЭтотОбъект.ПолучитьРеквизиты("ТаблицаНоменклатуры");
		
		//определим необходимые к добалению колонки Границ цен
		РеквизитовНет = Истина;
		Для Каждого РеквизитФормы Из МассивРеквизитовТаблицы Цикл
			Если РеквизитФормы.Имя="ЦенаМинимум" Тогда
				РеквизитовНет = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если РеквизитовНет Тогда
			МассивДобавляемыхРеквизитов = Новый Массив;
			
			НовыйРеквизит = Новый РеквизитФормы("ЦенаМинимум", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Неотрицательный)), "ТаблицаНоменклатуры", НСтр("ru = 'Цена мин.'"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			НовыйРеквизит = Новый РеквизитФормы("ЦенаМаксимум", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Неотрицательный)), "ТаблицаНоменклатуры", НСтр("ru = 'Цена макс.'"));
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
			
			ЭтотОбъект.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		КонецЕсли;
	
		// Создаем группу колонок Границы цен
		НоваяГруппаКолонок = Элементы.Добавить("ТаблицаНоменклатурыГруппаГраницыЦен", Тип("ГруппаФормы"), Элементы.ТаблицаНоменклатуры);
		НоваяГруппаКолонок.Вид = ВидГруппыФормы.ГруппаКолонок;
		НоваяГруппаКолонок.Заголовок = "Границы цен";
		НоваяГруппаКолонок.ОтображатьВШапке = Истина;
		НоваяГруппаКолонок.Группировка = ГруппировкаКолонок.Горизонтальная;
		НоваяГруппаКолонок.Подсказка = НСтр("ru = 'Границы цен'");
		
		// Создадим новые колонки в группе Границы цен
		НоваяКолонка = Элементы.Добавить("ТаблицаНоменклатурыЦенаМинимум", Тип("ПолеФормы"), НоваяГруппаКолонок);
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ПутьКДанным = "ТаблицаНоменклатуры.ЦенаМинимум";
		НоваяКолонка.Ширина = 1;
		НоваяКолонка.РастягиватьПоГоризонтали = Ложь;
		НоваяКолонка.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
		
		НоваяКолонка = Элементы.Добавить("ТаблицаНоменклатурыЦенаМаксимум", Тип("ПолеФормы"), НоваяГруппаКолонок);
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ПутьКДанным = "ТаблицаНоменклатуры.ЦенаМаксимум";
		НоваяКолонка.Ширина = 1;
		НоваяКолонка.РастягиватьПоГоризонтали = Ложь;
		НоваяКолонка.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
	КонецЕсли;
		
КонецПроцедуры //ОбновитьОтображениеТаблицаНоменклатуры()

&НаСервере
Процедура ОбновитьТекущиеПлановыеПоказатели()
	
	Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
		
		Для Каждого ТекФормат Из Объект.Форматы Цикл
			ИдентификаторФормата = СтрЗаменить(ТекФормат.Формат.УникальныйИдентификатор(), "-", "_");
			ТекущаяСтрока["ПредыдущееЗначение" + ИдентификаторФормата] = ПолучитьТекущийПлан(ТекущаяСтрока.Номенклатура, ТекФормат.Формат);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры //ОбновитьТекущиеПлановыеПоказатели()

&НаСервере
Функция ПроверитьСегментыВФорматахНаСервере(текФормат)
	
	Возврат Документы.ПланированиеАссортиментаФорматаКатегорий.ПроверитьСегментыВФорматах(Объект, текФормат);
	
КонецФункции //ПроверитьСегментыВФорматах()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	Элементы.ГруппаТоварыИЦеновыеСегменты.Видимость = ОтобразитьПанельТоваров;
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
	//отдельная раскраска флажка
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//ПолеЭлемента      = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.Имя);
	//	
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Товары.Номенклатура");
	//ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Истина;
	//	
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(250, 0, 0));
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	//Если Команда.Имя = "КомандаЗаполненияТоварыОчиститьТабличнуюЧасть" Тогда
	//	ТаблицаНоменклатуры.Очистить();
	//КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияПодбораНоменклатурыНаСервере(РезультатОповещения, ДополнительныеПараметры = Неопределено)
	
	// Получим параметры выполнения подбора
	ПодобраннаяНоменклатура = ПолучитьИзВременногоХранилища(РезультатОповещения.Корзина);
	
	ТекущаяСтрока = ?(ТаблицаНоменклатуры.Количество()=0, -1, Элементы.ТаблицаНоменклатуры.ТекущаяСтрока);
	
	// Производим перенос подобранной номенклатуры в табличную часть объекта
	Для Каждого СтрокаТоваров Из ПодобраннаяНоменклатура Цикл
		
		ПараметрыОтбора = Новый Структура("Номенклатура");
		
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаТоваров);
		НайденныеСтроки = ТаблицаНоменклатуры.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество()=0 Тогда
			
			// Добавим новую строку и заполним ее
			СтрокаТабличнойЧасти = ТаблицаНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТоваров);
			
			СтрокаТабличнойЧасти.НомерСтроки = ТаблицаНоменклатуры.Количество();
			Элементы.ТаблицаНоменклатуры.ТекущаяСтрока = СтрокаТабличнойЧасти.ПолучитьИдентификатор();
			ТаблицаНоменклатурыНоменклатураПриИзмененииНаСервере();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаНоменклатуры.Количество() > 0 Тогда
		Элементы.ТаблицаНоменклатуры.ТекущаяСтрока = ?(ТекущаяСтрока = -1, ТаблицаНоменклатуры[0].ПолучитьИдентификатор(), ТекущаяСтрока);
	КонецЕсли;
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияПодбораНоменклатуры()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	Если ЛЕВ(ДополнительныеПараметры, 17)="КомандаЗаполнения" Тогда
		
		//Если Тип(РезультатОповещения) = Тип("Структура")
		//	И РезультатОповещения.Свойство("ПараметрыЗаполнения")
		//	И РезультатОповещения.ПараметрыЗаполнения.Свойство("ОчиститьТабличнуюЧасть")
		//	И РезультатОповещения.ПараметрыЗаполнения.ОчиститьТабличнуюЧасть Тогда
		//	ТаблицаНоменклатуры.Очистить();
		//КонецЕсли;
		
		ТаблицаТоваров = Неопределено;
		
		Если ДополнительныеПараметры = "КомандаЗаполненияТоварыЗаполнитьПоДокументу" Тогда
			ДокументЗаполнения = РезультатОповещения.ПараметрыЗаполнения.ЗаполнитьПоДокументуВыборСсылки;
			Если ЕстьРеквизит(ДокументЗаполнения,, "Товары") Тогда
				ТаблицаТоваров = ДокументЗаполнения.Товары.Выгрузить();
			КонецЕсли;
			
		ИначеЕсли ДополнительныеПараметры = "КомандаЗаполненияТоварыЗагрузитьИзФайла" Тогда
			// Получим параметры работы
			АдресТаблицаЗагрузкаИЗФайлаВХранилище = РезультатОповещения.АдресТаблицаЗагрузкаИЗФайлаВХранилище;
			
			// Производим заполнение таблицы объекта
			Если ЗначениеЗаполнено(АдресТаблицаЗагрузкаИЗФайлаВХранилище) Тогда
				ТаблицаТоваров = ПолучитьИзВременногоХранилища(АдресТаблицаЗагрузкаИЗФайлаВХранилище);
			КонецЕсли;
			
		ИначеЕсли ДополнительныеПараметры="КомандаЗаполненияТоварыЗаполнитьПоГруппеНоменклатуры" Тогда
			ГруппаНоменклатуры = РезультатОповещения.ПараметрыЗаполнения.ГруппаНоменклатуры;
			ТоварыЗаполнитьНоменклатурой(Объект, ГруппаНоменклатуры);
			
		ИначеЕсли ДополнительныеПараметры="КомандаЗаполненияТоварыЗаполнитьВсемиГруппами" Тогда
			ТоварыЗаполнитьНоменклатурой(Объект);
			
		ИначеЕсли ДополнительныеПараметры="КомандаЗаполненияТоварыЗаполнитьУдаленнымиГруппами" Тогда
			ТоварыЗаполнитьНоменклатурой(Объект,,Истина);
			
		КонецЕсли;
		
		ЗаполнитьТаблицуТоварами(ТаблицаТоваров);
		
	Иначе
	
		// Вызываем общий обработчик события
		Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры="ПодборНоменклатуры" Тогда
		ОбработкаРезультатаОповещенияПодбораНоменклатурыНаСервере(РезультатОповещения);
	Иначе
		// Обработаем событие в контексте сервера
		ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	КонецЕсли;
	
	Если ДополнительныеПараметры="ПараметрыДокумента" Тогда
		
		Если ЗначениеЗаполнено(Объект.ДатаНачалаДействия) И Объект.ДатаНачалаДействия<НачалоДня(Объект.Дата) Тогда
			Объект.ДатаНачалаДействия = Объект.Дата;
			ДатаНачалаДействияПриИзменении(Неопределено);
		КонецЕсли;
		
	КонецЕсли;
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()

// Начало Подсистема «Обмен с контрагентами»
// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеСлужебныйКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры //Подключаемый_ВыполнитьКомандуЭДО()

// Обработчик ожидания событий ЭДО.
&НаКлиенте
Процедура Подключаемый_ОбработчикОжиданияЭДО()
	
	ОбменСКонтрагентамиКлиент.ОбработчикОжиданияЭДО(ЭтотОбъект);
	
КонецПроцедуры //Подключаемый_ОбработчикОжиданияЭДО()
// Конец Подсистема «Обмен с контрагентами»


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события нажатия кнопки "Подбор номенклатуры".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомКлиент.ОткрытьПодборНоменклатуры(ЭтотОбъект);
	
КонецПроцедуры // ПодборНоменклатуры()

// Процедура сортировки таблицы номенклатуры
//
&НаСервере
Процедура СортировкаТаблицыНоменклатуры(УсловиеСортировки)
	
	ТаблицаНоменклатуры.Сортировать(УсловиеСортировки);
	
КонецПроцедуры //СортировкаТаблицыНоменклатуры()

// Обработчик команды "Сортировать"
//
&НаКлиенте
Процедура Сортировать(Команда)
	
	УсловиеСортировки = "" + СтрЗаменить(Элементы.ТаблицаНоменклатуры.ТекущийЭлемент.Имя, "ТаблицаНоменклатуры", "");
	
	Если Найти(Команда.Имя,"ПоУбыванию")>0 Тогда
		УсловиеСортировки = УсловиеСортировки + " УБЫВ";
	КонецЕсли;
	
	СортировкаТаблицыНоменклатуры(УсловиеСортировки);
	
	// Пересчитаем номер строки
	НомерСтроки = 1;
	Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
		ТекущаяСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры // Сортировать()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.МониторингЦенКонкурентов.ДатаПриИзменении(Объект, ПараметрыДействия);
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.ДатаНачалаДействия) И Объект.ДатаНачалаДействия<НачалоДня(Объект.Дата) Тогда
		Объект.ДатаНачалаДействия = Объект.Дата;
		ДатаНачалаДействияПриИзменении(Неопределено);
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.МониторингЦенКонкурентов.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Документ основание" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.МониторингЦенКонкурентов.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДокументОснованиеПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДокументОснованиеПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДокументОснованиеПриИзменении()

&НаСервере
Процедура ДатаНачалаДействияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры //ДатаНачалаДействияПриИзмененииНаСервере()

&НаКлиенте
Процедура ДатаНачалаДействияПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.ДатаНачалаДействия) И Объект.ДатаНачалаДействия<НачалоДня(Объект.Дата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Дата начала действия, не может быть меньше даты документа.'"));
		Объект.ДатаНачалаДействия = Объект.Дата;
	КонецЕсли;
	
	ДатаНачалаДействияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
	ОбновитьТекущиеПлановыеПоказатели();
	
КонецПроцедуры //ДатаНачалаДействияПриИзменении()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПланированиеАссортиментаФорматаКатегорий.ТоварыНоменклатураПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	// Вызываем общий обработчик изменения реквизитов формы
	//УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(ЭтотОбъект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыНоменклатураПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыНоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЕдиницаИзмеренияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПланированиеАссортиментаФорматаКатегорий.ТоварыЕдиницаИзмеренияПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Единица измерения".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЕдиницаИзмеренияПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЦенаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	//Документы.ПланированиеАссортиментаФорматаКатегорий.ТоварыЦенаПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЦенаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Цена".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЦенаПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЦенаПриИзменении()

&НаСервере
Процедура ТоварыНоменклатураНачалоВыбораНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПланированиеАссортиментаФорматаКатегорий.ТоварыНоменклатураНачалоВыбора(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры //ТоварыНоменклатураНачалоВыбораНаСервере()

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТоварыНоменклатураНачалоВыбораНаСервере();
	
КонецПроцедуры //ТоварыНоменклатураНачалоВыбора()

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ТАБЛИЦА НОМЕНКЛАТУРЫ"

&НаСервере
Процедура ТаблицаНоменклатурыКоличествоПриИзмененииНаСервере()
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = ТаблицаНоменклатуры.НайтиПоИдентификатору(Элементы.ТаблицаНоменклатуры.ТекущаяСтрока);
	
	ПредставлениеФормата = СтрЗаменить(Элементы.ТаблицаНоменклатуры.ТекущийЭлемент.Имя, "ТаблицаНоменклатурыКоличество", "");
	
	//// Найдем формат по идентификатору
	//СтрокаФормата = Неопределено;
	//Для Каждого ТекущаяСтрока Из Объект.Форматы Цикл
	//	Если СтрНайти(СтрЗаменить(ТекущаяСтрока.Формат.УникальныйИдентификатор(),"-","_"), ПредставлениеФормата)<>0 Тогда
	//		СтрокаФормата = ТекущаяСтрока;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура,Формат", ТекущиеДанные.Номенклатура, СтрокаФормата.Формат));
	//
	//Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
	//	ТекущаяСтрока.Количество = ТекущиеДанные["Количество" + ПредставлениеФормата];
	//КонецЦикла;
	
	//пересчет итога по колонке
	ИмяКолонки = "Количество" + ПредставлениеФормата;
	тзТаблицаНоменклатуры = ТаблицаНоменклатуры.Выгрузить(,ИмяКолонки);
	Элементы.ТаблицаНоменклатуры.ТекущийЭлемент.ТекстПодвала = Формат(тзТаблицаНоменклатуры.Итог(ИмяКолонки), "ЧН=");
	
КонецПроцедуры //

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ТаблицаНоменклатурыКоличествоПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТаблицаНоменклатурыКоличествоПриИзмененииНаСервере();
	
КонецПроцедуры // Подключаемый_ТаблицаНоменклатурыЦенаНоваяПриИзменении()

&НаСервере
Процедура ТаблицаНоменклатурыНоменклатураПриИзмененииНаСервере(НеЗаполнятьКоличество=Ложь)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = ТаблицаНоменклатуры.НайтиПоИдентификатору(Элементы.ТаблицаНоменклатуры.ТекущаяСтрока);
	
	Если ТекущиеДанные.Номенклатура.ЭтоГруппа Тогда
		
		УровеньКатегории = ПолучитьЗначениеУчетнойПолитики("УровеньКатегорииНоменклатуры",, Объект.Дата);
		
		//проверим соответствие уровню категории
		Если УровеньКатегории<>0 Тогда
			ТекущийУровень = ТекущиеДанные.Номенклатура.Уровень()+1;
			Если УровеньКатегории<>ТекущийУровень Тогда
				ВывестиСообщение(НСтр("ru = 'Для " + ТекущиеДанные.Номенклатура + ", уровень категории ("+ТекущийУровень+"), не соответствет указанному в учетной политике ("+УровеньКатегории+").'"), Объект);
				ТекущиеДанные.Номенклатура = Неопределено;
				
				Возврат;
				
			КонецЕсли;
		КонецЕсли;
		
		ТекущиеДанные.КартинкаСтроки = БиблиотекаКартинок.Папка;
		
	Иначе
		
		ВывестиСообщение(НСтр("ru = '" + ТекущиеДанные.Номенклатура + ", не является Группой товара.'"), Объект);
		ТекущиеДанные.Номенклатура = Неопределено;
		
		Возврат;
		
		ТекущиеДанные.КартинкаСтроки = БиблиотекаКартинок.Реквизит;
		
	КонецЕсли;
	
	//НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", ТекущиеДанные.Номенклатура));
	
	Для Каждого ТекущаяСтрока Из Объект.Форматы Цикл
		
		ИдентификаторФормата = СтрЗаменить(ТекущаяСтрока.Формат.УникальныйИдентификатор(), "-", "_");
		ТекущиеДанные["ПредыдущееЗначение" + ИдентификаторФормата] = ПолучитьТекущийПлан(ТекущиеДанные.Номенклатура, ТекущаяСтрока.Формат);
		
		Если НеЗаполнятьКоличество Тогда
			Продолжить;
		КонецЕсли;
		ТекущиеДанные["Количество" + ИдентификаторФормата] = ТекущиеДанные["ПредыдущееЗначение" + ИдентификаторФормата];
		
	КонецЦикла;
	
	//заполним сегменты
	Для Каждого ТекущаяСтрока Из ТаблицаЦеновыхСегментов Цикл
		ЦеновойСегмент = ТекущаяСтрока.ЦеновойСегмент;
		ИмяРеквизита = "ЦеновойСегмент" + ЦеновойСегмент.Код;
		
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные[ИмяРеквизита]) Тогда
			ТекущиеДанные[ИмяРеквизита] = ЦеновойСегмент.Порог;
		КонецЕсли;
	КонецЦикла;
	
	//заполняем границы цен сегментов
	Если ЕстьРеквизит(ТекущиеДанные,"ЦенаМинимум") И ЕстьРеквизит(ТекущиеДанные,"ЦенаМаксимум") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 ЦенаМинимум, ЦенаМаксимум ИЗ РегистрСведений.ГраницыЦеновыхСегментов ГДЕ Номенклатура=&Номенклатура");
		Запрос.УстановитьПараметр("Номенклатура", ТекущиеДанные.Номенклатура);
		Рез = Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() И НЕ ЗначениеЗаполнено(ТекущиеДанные.ЦенаМинимум) И НЕ ЗначениеЗаполнено(ТекущиеДанные.ЦенаМаксимум) Тогда
			ТекущиеДанные.ЦенаМинимум = Рез.ЦенаМинимум;
			ТекущиеДанные.ЦенаМаксимум = Рез.ЦенаМаксимум;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры //ТаблицаНоменклатурыНоменклатураПриИзмененииНаСервере()

&НаКлиенте
Процедура ТаблицаНоменклатурыНоменклатураПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТаблицаНоменклатурыНоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры //ТаблицаНоменклатурыНоменклатураПриИзменении()

&НаКлиенте
Процедура ТаблицаНоменклатурыОчиститьТабличнуюЧасть(Команда)
	
	ТаблицаНоменклатуры.Очистить();
	
КонецПроцедуры //ТаблицаНоменклатурыОчиститьТабличнуюЧасть()

&НаКлиенте
Процедура ТаблицаНоменклатурыПоказатьПанельТоваров(Команда)
	
	ОтобразитьПанельТоваров = НЕ ОтобразитьПанельТоваров;
	Элементы.ТаблицаНоменклатурыПоказатьПанельТоваров.Пометка = ОтобразитьПанельТоваров;
		
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры //ТаблицаНоменклатурыПоказатьПанельТоваров()

&НаКлиенте
Процедура ТаблицаНоменклатурыПоказатьПредыдущиеЗначения(Команда)
	
	ОтобразитьПредыдущиеЗначения = НЕ ОтобразитьПредыдущиеЗначения;
	Элементы.ТаблицаНоменклатурыПоказатьПредыдущиеЗначения.Пометка = ОтобразитьПредыдущиеЗначения;
	
	ОбновитьОтображениеТаблицаНоменклатуры();
	
КонецПроцедуры //ТаблицаНоменклатурыПоказатьПредыдущиеЗначения()

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ФОРМАТЫ"

&НаКлиенте
Процедура ДеревоФорматовОбновитьФлажкиРекурсивно(ВеткаДерева, МассивФорматов)
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		Позиция = МассивФорматов.Найти(ТекущаяСтрока.Формат);
		Если Позиция=Неопределено Тогда
			ТекущаяСтрока.Пометка = Ложь;
		Иначе
			ТекущаяСтрока.Пометка = Истина;
			МассивФорматов.Удалить(Позиция);
		КонецЕсли;
		
		Если ТекущаяСтрока.Пометка Тогда
			ДеревоФорматовРазвернутьРодителя(Элементы.ДеревоФорматов, ТекущаяСтрока.ПолучитьРодителя());
		КонецЕсли;
		
		ДеревоФорматовОбновитьФлажкиРекурсивно(ТекущаяСтрока.ПолучитьЭлементы(), МассивФорматов);
	КонецЦикла;
	
КонецПроцедуры //ДеревоФорматовОбновитьФлажкиРекурсивно()

&НаКлиенте
Процедура ДеревоФорматовУстановитьФлажкиРекурсивно(ВеткаДерева, Пометка)
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		ТекущаяСтрока.Пометка = Пометка;// И НЕ ТекущаяСтрока.НеУчаствуетВДвижениях;
		ДеревоФорматовИзменениеПометки(ТекущаяСтрока);
		ДеревоФорматовУстановитьФлажкиРекурсивно(ТекущаяСтрока.ПолучитьЭлементы(), Пометка);
	КонецЦикла;
	
КонецПроцедуры //ДеревоФорматовУстановитьФлажкиРекурсивно()

&НаКлиенте
Процедура ДеревоФорматовИзменениеПометки(ТекущиеДанные)
	
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.НеУчаствуетВДвижениях Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Пометка Тогда
		Если Объект.Форматы.НайтиСтроки(Новый Структура("Формат", ТекущиеДанные.Формат)).Количество()=0 Тогда
			Если ПроверитьСегментыВФорматахНаСервере(ТекущиеДанные.Формат) Тогда
				НоваяСтрока = Объект.Форматы.Добавить();
				НоваяСтрока.Формат = ТекущиеДанные.Формат;
				НоваяСтрока.Порядок = ТекущиеДанные.Порядок;
			Иначе
				ВывестиСообщение(НСтр("ru = 'Состав ценовых сегментов у выбранного формата """ + ТекущиеДанные.Формат + """, не соответствет ценовым сегментам в документе.'"), Объект);
				ТекущиеДанные.Пометка = Ложь;
			КонецЕсли;
			
			Объект.Форматы.Сортировать("Порядок,Формат");
		КонецЕсли;
	Иначе
		НайденныеСтроки = Объект.Форматы.НайтиСтроки(Новый Структура("Формат", ТекущиеДанные.Формат));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Объект.Форматы.Удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //ДеревоФорматовИзменениеПометки()

&НаКлиенте
Процедура ДеревоФорматовПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоФорматов.ТекущиеДанные;
	
	ВеткаДерева = ТекущиеДанные.ПолучитьЭлементы();
	Если ВеткаДерева.Количество()=0 Тогда
		ДеревоФорматовИзменениеПометки(ТекущиеДанные);
	Иначе
		Пометка = ТекущиеДанные.Пометка;
		Если Пометка Тогда
			Элементы.ДеревоФорматов.Развернуть(ТекущиеДанные.ПолучитьИдентификатор());
		КонецЕсли;
		ДеревоФорматовУстановитьФлажкиРекурсивно(ТекущиеДанные.ПолучитьЭлементы(), Пометка);
	КонецЕсли;
	
КонецПроцедуры //ДеревоФорматовПометкаПриИзменении()

&НаКлиенте
Процедура ФорматыФорматПриИзменении(Элемент)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Элементы.Форматы.ТекущиеДанные;
	
	Если НЕ ПроверитьСегментыВФорматахНаСервере(ТекущиеДанные.Формат) Тогда
		ВывестиСообщение(НСтр("ru = 'Состав ценовых сегментов у выбранного формата """ + ТекущиеДанные.Формат + """, не соответствет ценовым сегментам в документе.'"), Объект);
		ТекущиеДанные.Формат = Неопределено;
		Возврат;
	КонецЕсли;
	
	МассивФорматов = Новый Массив;
	Для Каждого ТекущаяСтрока Из Объект.Форматы Цикл
		МассивФорматов.Добавить(ТекущаяСтрока.Формат);
	КонецЦикла;
	
	ДеревоФорматовОбновитьФлажкиРекурсивно(ДеревоФорматов.ПолучитьЭлементы(), МассивФорматов);
	
КонецПроцедуры //ФорматыФорматПриИзменении()

&НаКлиенте
Процедура ФорматыПослеУдаления(Элемент)
	
	МассивФорматов = Новый Массив;
	Для Каждого ТекущаяСтрока Из Объект.Форматы Цикл
		МассивФорматов.Добавить(ТекущаяСтрока.Формат);
	КонецЦикла;
	
	ДеревоФорматовОбновитьФлажкиРекурсивно(ДеревоФорматов.ПолучитьЭлементы(), МассивФорматов);
	
КонецПроцедуры //ФорматыПослеУдаления()

&НаКлиенте
Процедура ДеревоФорматовРазвернуть(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийРазвернутьВсеУровни(Элементы.ДеревоФорматов, ДеревоФорматов.ПолучитьЭлементы());
	
КонецПроцедуры //ДеревоФорматовРазвернуть()

&НаКлиенте
Процедура ДеревоФорматовСвернуть(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийСвернутьВсеУровни(Элементы.ДеревоФорматов, ДеревоФорматов.ПолучитьЭлементы());
	
КонецПроцедуры //ДеревоФорматовСвернуть()

&НаКлиенте
Процедура ДеревоФорматовСнятьФлажки(Команда)
	
	Объект.Форматы.Очистить();
	ДеревоФорматовУстановитьФлажкиРекурсивно(ДеревоФорматов.ПолучитьЭлементы(), Ложь);
	
КонецПроцедуры //ДеревоФорматовСнятьФлажки()

&НаКлиенте
Процедура ДеревоФорматовУстановитьФлажки(Команда)
	
	ДеревоФорматовУстановитьФлажкиРекурсивно(ДеревоФорматов.ПолучитьЭлементы(), Истина);
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийРазвернутьВсеУровни(Элементы.ДеревоФорматов, ДеревоФорматов.ПолучитьЭлементы());
	
КонецПроцедуры //ДеревоФорматовУстановитьФлажки()

&НаКлиенте
Процедура ДеревоФорматовРазвернутьРодителя(ЭлементФормыДерево, Родитель)
	
	Если Родитель=Неопределено Тогда
		Возврат;
	Иначе
		ЭлементФормыДерево.Развернуть(Родитель.ПолучитьИдентификатор());
		ДеревоФорматовРазвернутьРодителя(ЭлементФормыДерево, Родитель.ПолучитьРодителя());
	КонецЕсли;
	
КонецПроцедуры //ДеревоФорматовРазвернутьРодителя()

&НаКлиенте
Процедура ДеревоФорматовРазвернутьПомеченныеРекурсивно(ЭлементФормыДерево, ВеткаДерева)
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		Если ТекущаяСтрока.Пометка Тогда
			ДеревоФорматовРазвернутьРодителя(ЭлементФормыДерево, ТекущаяСтрока.ПолучитьРодителя());
		КонецЕсли;
		
		ДеревоФорматовРазвернутьПомеченныеРекурсивно(ЭлементФормыДерево, ТекущаяСтрока.ПолучитьЭлементы());
	КонецЦикла;
	
КонецПроцедуры //ДеревоФорматовРазвернутьПомеченныеРекурсивно()

&НаСервере
Процедура ФорматыФорматОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение)=Тип("СправочникСсылка.ФорматыКатегорий") И ВыбранноеЗначение.НеУчаствуетВДвижениях Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
		
КонецПроцедуры //ФорматыФорматОбработкаВыбораНаСервере()

&НаКлиенте
Процедура ФорматыФорматОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ФорматыФорматОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры //ФорматыФорматОбработкаВыбора()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры // ТоварыПередНачаломДобавления()

// Обработчик события возникающего на клиенте перед началом интерактивного изменения строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередНачаломИзменения()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередУдалением(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередУдалением()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПриОкончанииРедактирования(ЭтотОбъект, Элемент, НоваяСтрока, ОтменаРедактирования,,,"");
	
КонецПроцедуры // ТоварыПриОкончанииРедактирования()

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыПослеУдаленияНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ТоварыПослеУдаления(ЭтотОбъект, Элементы.Товары,ПараметрыДействия);
	
КонецПроцедуры // ТоварыПослеУдаленияНаСервере()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ТоварыПослеУдаленияНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ТоварыПослеУдаления()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                        - Строка таблицы, над которой находится курсор.
//  Поле                          - Элемент управляемой формы, с которым связана данная колонка таблицы.
//
&НаКлиенте
Процедура ТоварыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // ТоварыПроверкаПеретаскивания()

// Обработчик события возникающего на клиенте при при активизации ячейки таблицы.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПриАктивизацииЯчейки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПриАктивизацииЯчейки(ЭтотОбъект, Элемент);
		
КонецПроцедуры //ТоварыПриАктивизацииЯчейки()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "Таблица номенклатуры"

&НаКлиенте
Процедура ТаблицаНоменклатурыПослеУдаления(Элемент)
	
	НомерСтроки = 1;
	Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
		ТекущаяСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры //ТаблицаНоменклатурыПослеУдаления()

&НаКлиенте
Процедура ТаблицаНоменклатурыОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	НомерСтроки = 1;
	Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
		ТекущаяСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры //ТаблицаНоменклатурыОкончаниеПеретаскивания()

&НаКлиенте
Процедура ТаблицаНоменклатурыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ТаблицаНоменклатуры.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока ИЛИ Копирование Тогда
		ТекущиеДанные.НомерСтроки = ТаблицаНоменклатуры.Количество();
	КонецЕсли;
	
КонецПроцедуры //ТаблицаНоменклатурыПриНачалеРедактирования()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОбновитьОтображениеТаблицаНоменклатуры();
	
КонецПроцедуры //СтраницыПриСменеСтраницы()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ВКЛАДКИ "ДОПОЛНИТЕЛЬНО"
	
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор;
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачалаДействия) Тогда
		Объект.ДатаНачалаДействия = Объект.Дата;
	КонецЕсли;
		
	Элементы.КомандаЗаполненияТоварыОчиститьТабличнуюЧасть.ИмяКоманды = "ТаблицаНоменклатурыОчиститьТабличнуюЧасть";
	
	УправлениеДиалогомДокументаСервер.УстановитьВидимостьКолонокКодАртикул(ЭтотОбъект, "ТаблицаНоменклатуры");
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
		
	// Дальнейшие операции выполняются только для новых документов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	//ЗаполнитьТаблицуЦеновыхСегментов();
	
	// Заполним реквизиты форм данными с документа
	Если Объект.Товары.Количество()<>0 Тогда
		ЗаполнениеДаннымиПоДокументу();
	Иначе
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФорматы;
		//СоздатьКолонкиЦеновыхСегментов();
	КонецЕсли;
	
	ЗаполнитьДеревоФорматовНаСервере();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ДеревоФорматовРазвернутьПомеченныеРекурсивно(Элементы.ДеревоФорматов, ДеревоФорматов.ПолучитьЭлементы());
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	//ЗаполнитьТаблицуЦеновыхСегментов();
	
	ЗаполнитьДеревоФорматовНаСервере();
	
	// Заполним реквизиты форм данными с документа
	ЗаполнениеДаннымиПоДокументу();
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	// Сформируем ТЧ Товары
	Объект.Товары.Очистить();
	Объект.ЦеновыеСегменты.Очистить();
	
	ЗаполнитьТаблицуТоваров();
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	УправлениеДиалогомНаСервере();

КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ШтрихКодДляПоиска = "";
