
&НаКлиенте
Процедура ЗарегистрироватьДляОтправки(Команда)
	
	Попытка
		ОписаниеОшибки = "";	
		
		ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
		
		НСИКлиентСервер.ЗарегистрироватьОчередьРассылки(ТекущаяСтрока.Ссылка,ОписаниеОшибки);
		НСИКлиентСервер.НСИОтправкаИзмененийВФоне(,, ТекущаяСтрока.ЭлементИзменения);	
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Сообщить(ОписаниеОшибки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИзменения(Команда)
	СписокЗначений = новый СписокЗначений;
	
	Для к = 0 По Элементы.Список.ВыделенныеСтроки.Количество()-1 Цикл
		СписокЗначений.Добавить(Элементы.Список.ВыделенныеСтроки[к].Ссылка);	
	КонецЦикла;	
	
	НСИКлиентСервер.НСИПрименитьИзменения(СписокЗначений);
КонецПроцедуры

&НаКлиенте
Процедура Архивация(Команда)
	ПолучитьФорму("РегистрСведений.НСИАрхив.ФормаСписка").Открыть();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьИсториюНаСервере()
	Выборка = Справочники.НСИИсторияИзмененияОбъектов.Выбрать();
	
	НачатьТранзакцию();
	
	Пока Выборка.Следующий() Цикл	
		ОБъект = Выборка.ПолучитьОбъект();
		ОБъект.Удалить();	
	КонецЦикла;
		
	ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИсторию(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		Если Вопрос("История будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		ОчиститьИсториюНаСервере();
		
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение ИЛИ ТонкийКлиент  Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьИсториюЗавершение", ЭтотОбъект), "История будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет);
		
	#КонецЕсли
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводВXML(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = "Файл XML (*.xml)|*.xml|Все файлы|*.*";
	
	Если Диалог.Выбрать() Тогда
	
		СписокЗначений = Новый СписокЗначений;
		Для к = 0 По Элементы.Список.ВыделенныеСтроки.Количество()-1 Цикл
			СписокЗначений.Добавить(Элементы.Список.ВыделенныеСтроки[к].Ссылка);	
		КонецЦикла;
	
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
		
		ОписаниеОшибки = НСИКлиентСервер.СохранитьДанныеДляОтправкиВФайл(СписокЗначений, ПутьКФайлу);
		
		Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
			Сообщить(ОписаниеОшибки);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаИспользоватьОтборы.Пометка = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборы(Команда)
	
	Элементы.ФормаИспользоватьОтборы.Пометка = Не Элементы.ФормаИспользоватьОтборы.Пометка;
	НовоеЗначение = Элементы.ФормаИспользоватьОтборы.Пометка;
	
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		ЭлементОтбора.Использование = НовоеЗначение;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьГруппировки(Команда)
	
	Элементы.ФормаИспользоватьГруппировки.Пометка = Не Элементы.ФормаИспользоватьГруппировки.Пометка;
	НовоеЗначение = Элементы.ФормаИспользоватьГруппировки.Пометка;
	
	УстановитьГруппировкуНаСервере(НовоеЗначение);//->Lexa 141021
	
КонецПроцедуры

//->Lexa 141021
&НаКлиенте
Процедура ОчиститьИсториюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    
    ОчиститьИсториюНаСервере();

КонецПроцедуры

&НаСервере
Процедура УстановитьГруппировкуНаСервере(Флаг)
	Для Каждого ЭлементГруппировки Из Список.Группировка.Элементы Цикл
		ЭлементГруппировки.Использование = Флаг;
	КонецЦикла;
КонецПроцедуры
//<-Lexa 141021