
#Область ПрограммныйИнтерфейс

// Функция осуществляет подключение устройства.
//
Функция ПодключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	НовыйСтандарт = Ложь;
	
	ИДУстройства = "";
	//Если Параметры.P_CommunicationMethod=0 Тогда
	СтрIP = Параметры.P_IPAddress;
	Если СтрНайти(СтрIP, ".", НаправлениеПоиска.СКонца)>0 Тогда
		ИДУстройства = "S0"+ Сред(СтрIP, СтрНайти(СтрIP, ".", НаправлениеПоиска.СКонца)+1);
	КонецЕсли;
	//Иначе
	//	ИДУстройства = Параметры.P_IPAddress.;
	//КонецЕсли;
	//
	ВыходныеПараметры = Новый Массив();
	ПараметрыПодключения.Вставить("ИДУстройства", ИДУстройства);
	
	ТипОборудованияИспользуемый= "";
	
	Если ПараметрыПодключения.Свойство("ТипОборудования") Тогда
		ТипОборудованияИспользуемый = ПараметрыПодключения.ТипОборудования;
		// Предопределенный параметр с указанием типа драйвера.
		Попытка
			ОбъектДрайвера.УстановитьПараметр("EquipmentType", ТипОборудованияИспользуемый) 
		Исключение
			Результат = Ложь;
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(НСтр("ru='Ошибка обращения к драйверу.'"));
			Возврат Результат;
		КонецПопытки;
	КонецЕсли;
	
	НаименованиеДрайвера      = "";
	ОписаниеДрайвера          = "";
	ТипОборудования           = "";
	ИнтеграционныйКомпонент   = Ложь;
	ОсновнойДрайверУстановлен = Ложь;
	#Если Клиент Тогда
	РевизияИнтерфейса         = МенеджерОборудованияКлиентПовтИсп.РевизияИнтерфейсаДрайверов();
	#Иначе
	РевизияИнтерфейса         = 2005;
	#КонецЕсли
	URLЗагрузкиДрайвера       = "";
	ПараметрыДрайвера         = "";
	ДополнительныеДействия    = "";
	
	Попытка
		// Получаем ревизию интерфейса драйвера.
		РевизияИнтерфейса = ОбъектДрайвера.ПолучитьРевизиюИнтерфейса();
		НовыйСтандарт = Истина;
		// Получаем описание драйвера.
		ОписаниеДрайвера = "";
		ОбъектДрайвера.ПолучитьОписание(ОписаниеДрайвера);
		
		ОписаниеДрайвераПараметры = МенеджерОборудованияВызовСервера.ПолучитьОписаниеДрайвера(ОписаниеДрайвера);
		НаименованиеДрайвера      = ОписаниеДрайвераПараметры.НаименованиеДрайвера;
		ОписаниеДрайвера          = ОписаниеДрайвераПараметры.ОписаниеДрайвера;
		ТипОборудования           = ОписаниеДрайвераПараметры.ТипОборудования;
		ИнтеграционныйКомпонент   = ОписаниеДрайвераПараметры.ИнтеграционныйКомпонент;
		ОсновнойДрайверУстановлен = ОписаниеДрайвераПараметры.ОсновнойДрайверУстановлен;
		URLЗагрузкиДрайвера       = ОписаниеДрайвераПараметры.URLЗагрузкиДрайвера;
	Исключение
		// Используется стандарт драйверов ниже 2.0
		НовыйСтандарт = Ложь;
	КонецПопытки;
	
	Если Не НовыйСтандарт Тогда
		Попытка
			// Получаем описание драйвера
			ОбъектДрайвера.ПолучитьОписание(НаименованиеДрайвера, ОписаниеДрайвера, ТипОборудования, РевизияИнтерфейса, 
											ИнтеграционныйКомпонент, ОсновнойДрайверУстановлен, URLЗагрузкиДрайвера);
		Исключение
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ПолучитьОписание>.'") + Символы.ПС + ОписаниеОшибки());
			Возврат Результат;
		КонецПопытки;
	КонецЕсли;
	
	ПараметрыПодключения.Вставить("РевизияИнтерфейса", РевизияИнтерфейса);
	
	Для Каждого Параметр Из Параметры Цикл
		Если Лев(Параметр.Ключ, 2) = "P_" Тогда
			ЗначениеПараметра = Параметр.Значение;
			ИмяПараметра = Сред(Параметр.Ключ, 3);
			Попытка
				ОбъектДрайвера.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра) 
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	//ЕстьПодключение = ПроверитьПинг(СтрIP);
	
	//Если НЕ ЕстьПодключение Тогда
	//	Результат = Ложь;
	//	ВыходныеПараметры.Добавить(999);
	//	ВыходныеПараметры.Добавить("");
	//	ВыходныеПараметры.Добавить("С весами "+СтрIP + " не установлено соединение");
	//КонецЕсли;
	
	Попытка
		Ответ = ОбъектДрайвера.Подключить(ПараметрыПодключения.ИДУстройства);
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.Подключить>.'") + Символы.ПС + ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
	
	Если НЕ Ответ Тогда
		Результат = Ложь;
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1])
	КонецЕсли;
	
	//ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры
	//МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(ГруппаТоваровОборудования, Устройство, СобытиеЖурнала, Комментарий, ДанныеСобытия)
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет отключение устройства.
//
Функция ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	
	ВыходныеПараметры = Новый Массив();
	
	ОбъектДрайвера.Отключить(ПараметрыПодключения.ИДУстройства);
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает возможность работы модуля в асинхронном режиме.
// Стандартные команды модуля:
// - ПодключитьУстройство
// - ОтключитьУстройство
// - ВыполнитьКоманду
// Команды модуля для работы асинхронном режиме (должны быть определены):
// - НачатьПодключениеУстройства
// - НачатьОтключениеУстройства
// - НачатьВыполнениеКоманды.
//
Функция ПоддержкаАсинхронногоРежима() Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Функция получает, обрабатывает и перенаправляет на исполнение команду к драйверу.
//
Функция ВыполнитьКоманду(Команда, ВходныеПараметры = Неопределено, ВыходныеПараметры = Неопределено, ОбъектДрайвера, Параметры, ПараметрыПодключения) Экспорт
	
	Результат = Истина;
	ВыходныеПараметры = Новый Массив();
	
	// Выгрузка товаров в весы с печатью этикеток.
	Если Команда = "UploadGoods" ИЛИ Команда = "ВыгрузитьТовары" Тогда
		Товары         = ВходныеПараметры[0];
		ПолнаяВыгрузка = (ВходныеПараметры[1] = ЛОЖЬ);
		Результат = ВыгрузитьТовары(ОбъектДрайвера, Параметры, ПараметрыПодключения, Товары, ПолнаяВыгрузка, ВыходныеПараметры);
		
		// Очистить базу весов с печатью этикеток.
	ИначеЕсли Команда = "ClearBase" ИЛИ Команда = "ОчиститьБазу" Тогда
		Результат = ОчиститьТоварыВВесах(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
		// Тестирование устройства
	ИначеЕсли Команда = "ТестУстройства" ИЛИ Команда = "CheckHealth" Тогда
		Результат = ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "ВыполнитьДополнительноеДействие" ИЛИ Команда = "DoAdditionalAction" Тогда
		ИмяДействия = ВходныеПараметры[0];
		Результат = ВыполнитьДополнительноеДействие(ОбъектДрайвера, Параметры, ПараметрыПодключения, ИмяДействия, ВыходныеПараметры);
		
		// Получение версии драйвера
	ИначеЕсли Команда = "ПолучитьВерсиюДрайвера" ИЛИ Команда = "GetVersion" Тогда
		Результат = ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	// Тестирование устройства
	ИначеЕсли Команда = "ВыгрузитьНазваниеМагазина" Тогда
		ТаблицаМагазинов = ВходныеПараметры[0];
		Результат = ВыгрузитьНазваниеМагазина(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаМагазинов, ВыходныеПараметры);
		// Получение описание драйвера.
	ИначеЕсли Команда = "ПолучитьОписаниеДрайвера" ИЛИ Команда = "GetDescription" Тогда
		Результат = ПолучитьОписаниеДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	// Указанная команда не поддерживается данным драйвером.
	Иначе
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Команда ""%Команда%"" не поддерживается данным драйвером.'"));
		ВыходныеПараметры[1] = СтрЗаменить(ВыходныеПараметры[1], "%Команда%", Команда);
		
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВыгрузкаТоваров

Функция ПолучитьВариантыЕдиницСроковХранения()
	
	Результат = Новый Соответствие;
	#Если Клиент Тогда
		Результат.Вставить(ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Час"), 3600);
		Результат.Вставить(ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.День"), 86400);
		Результат.Вставить(ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Неделя"), 7*86400);
		Результат.Вставить(ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Месяц"), 30*86400);
		Результат.Вставить(ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.Год"), 365*86400);
	#Иначе
		Результат.Вставить(Перечисления.ЕдиницыИзмеренияВремени.Час, 3600);
		Результат.Вставить(Перечисления.ЕдиницыИзмеренияВремени.День, 86400);
		Результат.Вставить(Перечисления.ЕдиницыИзмеренияВремени.Неделя, 7*86400);
		Результат.Вставить(Перечисления.ЕдиницыИзмеренияВремени.Месяц, 30*86400);
		Результат.Вставить(Перечисления.ЕдиницыИзмеренияВремени.Год, 365*86400);
	#КонецЕсли
	
	//Результат = СрокХраненияТовара*86400;
	Возврат Результат;
	
КонецФункции

// Функция осуществляет выгрузку таблицы товаров в весы с печатью этикеток.
//
// Параметры:
//  ОбъектДрайвера                 - <*>
//                                 - Объект драйвера торгового оборудования.
//
//  Товары                         - <ТаблицаЗначений>
//                                 - Таблица товаров, подлежащих выгрузке в весы.
//                                   Таблица имеет следующие колонки:
//                                     PLU                        - <Число>
//                                                                - Идентификатор товара в весах.
//									   Штрихкод 				  - <Строка>
//                                                                - Штрихкод товара на кассе.
//                                     Наименование               - <Строка>
//																  - Наименование товара сокращенное (для печати на этикетке).
//                                     НаименованиеПолное         - <Строка>
//																  - Наименование товара полное (для отображения на табло).
//                                     Цена                       - <Число>
//                                                                - Цена номенклатуры.
//
//  ЧастичнаяВыгрузка               - <Булево>
//                                  - Признак частичной выгрузки товара.
//
Функция ВыгрузитьТовары(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаВыгрузки, ПолнаяВыгрузка, ВыходныеПараметры) 
	
	Результат = Истина;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Нет данных для выгрузки.'"));
		Возврат Ложь;
	КонецЕсли;
	
	РазмерПакета     = РазмерПакетаПоУмолчанию();
	ТекущийПакет     = 1;
	ЗаписьВПакете    = 0;
	ЗаписейВыгружено = 0;
	ЗаписейВсего     = ТаблицаВыгрузки.Количество();
	
	ДлинаКраткогоНаименования = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДлинаКраткогоНаименования", 32);
	ДлинаСтрокиНаименования   = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДлинаСтрокиНаименования", 50);
	ДлинаСтрокиИнгредиента    = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДлинаСтрокиИнгредиента", 50);
	ДлинаСтрокиСпецСообщения  = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДлинаСтрокиСпецСообщения", 50);
	
	ТекущийПроцент = 0;
	#Если Клиент Тогда
	МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Инициализация выгрузки...'"), Окр(ТекущийПроцент));
	#КонецЕсли
	ПроцентИнкремент = 100 / (ЗаписейВсего / РазмерПакета);
	
	МассивТоваров   = Новый Массив;
	
	Если Параметры.Свойство("МоментВыгрузкиДанных") Тогда
		МоментВыгрузкиДанных = Параметры.МоментВыгрузкиДанных;
	Иначе
		МоментВыгрузкиДанных = ТекущаяДата();
	КонецЕсли;
	
	ВариантыЕдиницСроковХранения = ПолучитьВариантыЕдиницСроковХранения();
	
	ЗаписатьМоментВыгрузки = Ложь;
	Для Каждого Позиция Из ТаблицаВыгрузки  Цикл
		
		Если ЗаписьВПакете = 0 Тогда
			МассивТоваров.Очистить();
		КонецЕсли;
		
		СпецСообщение = Строка(Позиция.Производитель);
		
		Если Позиция.Удален Тогда
			СтрокаМассиваТоваров = Новый СписокЗначений; 
			СтрокаМассиваТоваров.Добавить(Число(Позиция.PLU)); // PLU
			СтрокаМассиваТоваров.Добавить(Число(Позиция.PLU)); // Код
			СтрокаМассиваТоваров.Добавить(""); // ШтрихКод
			СтрокаМассиваТоваров.Добавить(""); // Кракое наименование
			СтрокаМассиваТоваров.Добавить(""); // Наименование
			СтрокаМассиваТоваров.Добавить(0);  // Код группы
			СтрокаМассиваТоваров.Добавить(0);  // Цена
			СтрокаМассиваТоваров.Добавить(0);  // дата реализации
			СтрокаМассиваТоваров.Добавить(0);  // время реализации
			СтрокаМассиваТоваров.Добавить(0);  // Срок годности
			СтрокаМассиваТоваров.Добавить(0);  // Дата упаковки
			СтрокаМассиваТоваров.Добавить(0);  // Время упаковки
			СтрокаМассиваТоваров.Добавить("false"); // весовой
			СтрокаМассиваТоваров.Добавить(""); // описание/состав
			СтрокаМассиваТоваров.Добавить(""); // спец. сообщения
		Иначе
			
			НаименованиеТовара = ?(Позиция.Свойство("Номенклатура"), Позиция.Номенклатура, "");
			НаименованиеТовара = ?(Позиция.Свойство("Наименование"), Позиция.Наименование, НаименованиеТовара);
			Если Позиция.Свойство("НаименованиеПолное") И Не ПустаяСтрока(Позиция.НаименованиеПолное) Тогда
				НаименованиеТовара = Позиция.НаименованиеПолное;
			КонецЕсли;
			
			НаименованиеТовара = СтрЗаменить(НаименованиеТовара, "'", """");
			
			КраткоеНаименование = Лев(НаименованиеТовара ,ДлинаКраткогоНаименования);
			
			НаименованиеТовара = ВыполнитьПереносСтрок(НаименованиеТовара, ДлинаСтрокиНаименования, 4,"||");
			
			Если НачалоДня(Позиция.ДатаИзготовления) = Позиция.ДатаИзготовления Тогда
				ДатаИзготовления = Формат(Позиция.ДатаИзготовления,"ДФ=dd/MM/yy");
			Иначе
				ДатаИзготовления = Формат(Позиция.ДатаИзготовления,"ДФ='dd/MM/yy hh:mm'");
			КонецЕсли;
			ОписаниеТовара = "";
			ОписаниеТовара = ОписаниеТовара + Позиция.ВидСтандарта + " " + Позиция.НомерСтандарта;
			ОписаниеТовара = ОписаниеТовара + " Пищевая и энергетическая ценность в 100 гр продукта: " + СокрЛП(Позиция.ЭнергетическаяЦенность)+" ккал/" + СокрЛП(Позиция.ЭнергетическаяЦенностьКДж) + " кДж";
			ОписаниеТовара = ОписаниеТовара + " Хранить при температуре: " + Позиция.УсловияХранения;
			ОписаниеТовара = ОписаниеТовара + " Дата изготовления: " + ДатаИзготовления;
			ОписаниеТовара = ОписаниеТовара + "
			|Состав:
			|" + СокрЛП(Позиция.ОписаниеТовара);
			
			Если ДлинаСтрокиИнгредиента = 0 Тогда
				Ингридиенты = СтрЗаменить(ОписаниеТовара, "|", "||");
			Иначе
				ОписаниеТовара = СтрЗаменить(ОписаниеТовара, "|", "");
				Ингридиенты = ВыполнитьПереносСтрок(ОписаниеТовара, ДлинаСтрокиИнгредиента, 24,"||");
			КонецЕсли;
			СпецСообщение = ВыполнитьПереносСтрок(СпецСообщение, ДлинаСтрокиСпецСообщения, 8,"||");
			
			Если Позиция.Весовой Тогда
				Штрихкод = Лев(Позиция.Код + 0000000, 7)+"0000001";
			ИначеЕсли Позиция.ШтучноВесовой Тогда
				Штрихкод = Лев(Позиция.Код + 0000000, 7)+"0000002";
			Иначе
				Штрихкод = Лев(Позиция.Код + 0000000, 7)+"0000002";
			КонецЕсли;
			
			СтрокаМассиваТоваров = Новый СписокЗначений; 
			СтрокаМассиваТоваров.Добавить(Число(Позиция.PLU));
			СтрокаМассиваТоваров.Добавить(Число(Позиция.PLU));
			СтрокаМассиваТоваров.Добавить(Штрихкод); // штрихкод
			СтрокаМассиваТоваров.Добавить(КраткоеНаименование);
			СтрокаМассиваТоваров.Добавить(НаименованиеТовара);
			СтрокаМассиваТоваров.Добавить(0); // код группы
			СтрокаМассиваТоваров.Добавить(Позиция.Цена);
			СтрокаМассиваТоваров.Добавить(0); // Срок продажи в днях
			СтрокаМассиваТоваров.Добавить(0); // Срок продажи в часах и минутах
			
			ДнейПродажи = "";
			Если ЗначениеЗаполнено(Позиция.СрокХранения) Тогда
				КоэффициентСроковХранения = ВариантыЕдиницСроковХранения.Получить(Позиция.ЕдиницаСрокаХранения);
				Если КоэффициентСроковХранения = Неопределено Тогда
					КоэффициентСроковХранения = 86400;
				КонецЕсли;
				
				СрокПродажи = Позиция.СрокХранения * КоэффициентСроковХранения;
				СрокПродажи = СрокПродажи/86400;
				ДнейПродажи = Цел(СрокПродажи);
				
				Если СрокПродажи>ДнейПродажи Тогда
					ДнейПродажи = ДнейПродажи+1;
				КонецЕсли;
				//ЧасовПродажи = Формат(Дата(1, 1, 1)+ОстатокВСекундах, "ДФ=HH");
				//МинутПродажи = Формат(Дата(1, 1, 1)+ОстатокВСекундах, "ДФ=mm");
				
				ДнейПродажи = Прав("000"+ДнейПродажи, 3);
				
				СтрокаМассиваТоваров.Добавить(ДнейПродажи); // Срок годности в днях
				//СтрокаМассиваТоваров.Добавить(ЧасовПродажи+МинутПродажи); // Срок продажи в часах и минутах
			Иначе
				СтрокаМассиваТоваров.Добавить(0); // Срок годности в днях
			КонецЕсли;
			
			//#Если Клиент Тогда
			//	ТекущаяМинута = Цел((ТекущаяДата()-НачалоДня(ТекущаяДата()))/60);
			//#Иначе
			//	ТекущаяМинута = Цел((ТекущаяДатаСеанса() - НачалоДня(ТекущаяДатаСеанса()))/60);
			//#КонецЕсли
			
			СтрокаМассиваТоваров.Добавить(0);  // Дата упаковки
			//СтрокаМассиваТоваров.Добавить(ТекущаяМинута);  // Время упаковки
			СтрокаМассиваТоваров.Добавить(0);  // Время упаковки
			СтрокаМассиваТоваров.Добавить(Позиция.Весовой);
			СтрокаМассиваТоваров.Добавить(Ингридиенты);
			СтрокаМассиваТоваров.Добавить(СпецСообщение);
			
			//Название товара 4 строки
			//Название магазина 3 строки
			//Специальные сообщения 8 строки
			//Ингредиенты 15 строк
			
			// + Лог выгрузки
			#Если НЕ Клиент Тогда			
				Попытка
					ЛогВыгркузки = РегистрыСведений.итВыгрузкаВВесыЛог.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(ЛогВыгркузки,Позиция);
					ЛогВыгркузки.Период = ТекущаяДата();
					ЛогВыгркузки.СпецСообщение = СпецСообщение;
					Попытка
						ЛогВыгркузки.НаименованиеОборудования = Параметры.Идентификатор.Наименование;
						ЛогВыгркузки.Склад = Параметры.Идентификатор.ОсновнойОтдел;
					Исключение
					КонецПопытки;					
					ЛогВыгркузки.Записать();
				Исключение
				КонецПопытки;
			#КонецЕсли
			// - Лог выгрузки	
		КонецЕсли;
		
		МассивТоваров.Добавить(СтрокаМассиваТоваров);
		
		ЗаписейВыгружено  = ЗаписейВыгружено + 1;
		ЗаписьВПакете = ЗаписьВПакете + 1;
		
		Если (ЗаписьВПакете = РазмерПакета) ИЛИ (ЗаписейВыгружено = ЗаписейВсего) Тогда  
			
			ДанныеДляВыгрузки = СформироватьТаблицуТоваров(МассивТоваров);
			
			Ответ = ОбъектДрайвера.ВыгрузитьТовары(ПараметрыПодключения.ИДУстройства, ДанныеДляВыгрузки, "");
			Если Ответ = Истина Тогда
				ДанныеСобытия = Новый Структура;
				ДанныеСобытия.Вставить("Устройство",        Параметры.Идентификатор);
				ДанныеСобытия.Вставить("Параметры",         Параметры);
				ДанныеСобытия.Вставить("Данные",            ДанныеДляВыгрузки);
				#Если Клиент Тогда
					ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДата());
				#Иначе
					ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
				#КонецЕсли
				
				Комментарий = "Прогрес: "+Формат(ТекущийПроцент, "ЧН=0; ЧГ=")+"; в пакете: " + Формат(ЗаписьВПакете, "ЧН=0; ЧГ=")+"; выгружено: " + Формат(ЗаписейВыгружено, "ЧН=0; ЧГ=");
				
				МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(Параметры.ГруппаТоваровОборудования, Параметры.Идентификатор, "Выгрузка данных в весы", Комментарий, ДанныеСобытия);
				ЗаписатьМоментВыгрузки = Истина;
			Иначе
				Результат = Ложь;
				ВыходныеПараметры.Очистить();
				ВыходныеПараметры.Добавить(999);
				ВыходныеПараметры.Добавить("");
				ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
				
				ДанныеСобытия = Новый Структура;
				ДанныеСобытия.Вставить("Устройство",        Параметры.Идентификатор);
				ДанныеСобытия.Вставить("Параметры",         Параметры);
				ДанныеСобытия.Вставить("Данные",            ДанныеДляВыгрузки);
				#Если Клиент Тогда
					ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДата());
				#Иначе
					ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
				#КонецЕсли
				
				Комментарий = "Прогрес: "+Формат(ТекущийПроцент, "ЧН=0; ЧГ=")+"; в пакете: " + Формат(ЗаписьВПакете, "ЧН=0; ЧГ=")+"; выгружено: " + Формат(ЗаписейВыгружено, "ЧН=0; ЧГ=");
				Комментарий = Комментарий + "
				|	Ошибка: " + ВыходныеПараметры[1];
				
				МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(Параметры.ГруппаТоваровОборудования, Параметры.Идентификатор, "Выгрузка данных в весы с ошибкой", Комментарий, ДанныеСобытия);
				
				Возврат Результат;
			КонецЕсли;
			
			ЗаписьВПакете = 0;
			ТекущийПакет = ТекущийПакет + 1;
			
			ТекущийПроцент = ТекущийПроцент + ПроцентИнкремент;
			
			#Если Клиент Тогда
			МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Выгрузка данных...'"), Окр(ТекущийПроцент));
			#КонецЕсли
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗаписатьМоментВыгрузки Тогда
		МенеджерОборудованияРарусСервер.УстановитьМоментЗагрузки(Параметры.Идентификатор, "Товары", 0, МоментВыгрузкиДанных);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВыгрузитьНазваниеМагазина(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаВыгрузки, ВыходныеПараметры)
	
	Результат = Истина;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Нет данных для выгрузки.'"));
		Возврат Ложь;
	КонецЕсли;
	
	#Если Клиент Тогда
	МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Инициализация выгрузки магазинов...'"), Окр(0));
	#КонецЕсли
	
	МассивМагазинов = Новый Массив;
	
	Для Каждого Позиция Из ТаблицаВыгрузки  Цикл
		
		КодМагазина          = Позиция.Код;
		НаименованиеМагазина = Позиция.Наименование;
		
		НаименованиеМагазина = ВыполнитьПереносСтрок(НаименованиеМагазина, 50, 3,"|");
		
		СтрокаМассива = Новый СписокЗначений; 
		СтрокаМассива.Добавить(КодМагазина);
		СтрокаМассива.Добавить(НаименованиеМагазина);
		
		МассивМагазинов.Добавить(СтрокаМассива);
		
	КонецЦикла;
	
	Если МассивМагазинов.Количество()>0 Тогда
		
		ДанныеДляВыгрузки = СформироватьТаблицуМагазинов(МассивМагазинов);
		
		Ответ = ОбъектДрайвера.ВыгрузитьМагазины(ДанныеДляВыгрузки);
		Если Ответ = Истина Тогда
			ДанныеСобытия = Новый Структура;
			ДанныеСобытия.Вставить("Устройство",        Параметры.Идентификатор);
			ДанныеСобытия.Вставить("Параметры",         Параметры);
			ДанныеСобытия.Вставить("Данные",            ДанныеДляВыгрузки);
			#Если Клиент Тогда
				ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДата());
			#Иначе
				ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
			#КонецЕсли
			
			Комментарий = "Прогрес: "+Формат(100, "ЧН=0; ЧГ=")+"; в таблице: " + Формат(ТаблицаВыгрузки.Количество(), "ЧН=0; ЧГ=")+"; выгружено: " + Формат(МассивМагазинов.Количество(), "ЧН=0; ЧГ=");
			
			МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(Параметры.ГруппаТоваровОборудования, Параметры.Идентификатор, "Выгрузка магазинов в весы", Комментарий, ДанныеСобытия);
			
		Иначе
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
			
			ДанныеСобытия = Новый Структура;
			ДанныеСобытия.Вставить("Устройство",        Параметры.Идентификатор);
			ДанныеСобытия.Вставить("Параметры",         Параметры);
			ДанныеСобытия.Вставить("Данные",            ДанныеДляВыгрузки);
			#Если Клиент Тогда
				ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДата());
			#Иначе
				ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
			#КонецЕсли
			
			Комментарий = "Прогрес: "+Формат(100, "ЧН=0; ЧГ=")+"; в таблице: " + Формат(ТаблицаВыгрузки.Количество(), "ЧН=0; ЧГ=")+"; выгружено: " + Формат(МассивМагазинов.Количество(), "ЧН=0; ЧГ=");
			Комментарий = Комментарий + "
			|	Ошибка: " + ВыходныеПараметры[1];
			
			МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(Параметры.ГруппаТоваровОборудования, Параметры.Идентификатор, "Выгрузка магазинов в весы с ошибкой", Комментарий, ДанныеСобытия);
			
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	#Если Клиент Тогда
		МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Выгрузка магазинов...'"), Окр(100));
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Размер пакета в элементах передаваемой информации в драйвер.
//
Функция РазмерПакетаПоУмолчанию() Экспорт
	
	РазмерПакета = 600;
	Возврат РазмерПакета;
	
КонецФункции

// Функция осуществляет очистку таблицы товаров в весы с печатью этикеток.
//
Функция ОчиститьТоварыВВесах(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) 

	Результат = Истина;
	
	Попытка
		Ответ = ОбъектДрайвера.ОчиститьТовары(ПараметрыПодключения.ИДУстройства);
		
		Если НЕ Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1])
		Иначе
			ВыходныеПараметры.Очистить();
		КонецЕсли;
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ОчиститьТовары>.'") +  ОписаниеОшибки());
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Функция осуществляет тестирование устройства.
//
Функция ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат            = Истина;
	РезультатТеста       = "";
	АктивированДемоРежим = "";
	
	Для Каждого Параметр Из Параметры Цикл
		Если Лев(Параметр.Ключ, 2) = "P_" Тогда
			ЗначениеПараметра = Параметр.Значение;
			ИмяПараметра = Сред(Параметр.Ключ, 3);
			Ответ = ОбъектДрайвера.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра) 
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		Ответ = ОбъектДрайвера.ТестУстройства(РезультатТеста, АктивированДемоРежим);
		
		Если Ответ Тогда
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(0);
		Иначе
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
		КонецЕсли;
		ВыходныеПараметры.Добавить(РезультатТеста);
		ВыходныеПараметры.Добавить(АктивированДемоРежим);
		
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ТестУстройства>.'") + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет выполнение дополнительного действия для устройства.
//
Функция ВыполнитьДополнительноеДействие(ОбъектДрайвера, Параметры, ПараметрыПодключения, ИмяДействия, ВыходныеПараметры)
	
	Результат  = Истина;
	
	Для Каждого Параметр Из Параметры Цикл
		Если Лев(Параметр.Ключ, 2) = "P_" Тогда
			ЗначениеПараметра = Параметр.Значение;
			ИмяПараметра = Сред(Параметр.Ключ, 3);
			Ответ = ОбъектДрайвера.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра) 
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		Ответ = ОбъектДрайвера.ВыполнитьДополнительноеДействие(ИмяДействия);
		Если НЕ Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1])
		Иначе
			ВыходныеПараметры.Очистить();  
		КонецЕсли;
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ВыполнитьДополнительноеДействие>.'") + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает версию установленного драйвера.
//
Функция ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	
	ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
	ВыходныеПараметры.Добавить(НСтр("ru='Не определена'"));
	
	Попытка
		ВерсияДрайвера = ОбъектДрайвера.ПолучитьНомерВерсии();
	Исключение
		
		Попытка
			// Получаем описание драйвера.
			ОписаниеДрайвера = "";
			ОбъектДрайвера.ПолучитьОписание(ОписаниеДрайвера);
			ОписаниеДрайвераПараметры = МенеджерОборудованияВызовСервера.ПолучитьОписаниеДрайвера(ОписаниеДрайвера);
			ВерсияДрайвера = ОписаниеДрайвераПараметры.ВерсияДрайвера;
		Исключение
			Результат = Истина;
		КонецПопытки;
	КонецПопытки;
	
	ВыходныеПараметры[1] = ВерсияДрайвера;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает описание установленного драйвера.
//
Функция ПолучитьОписаниеДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	//#Если Клиент Тогда
	ВыходныеПараметры.Очистить();
	ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
	ВыходныеПараметры.Добавить(НСтр("ru='Не определена'"));
	
	ВыходныеПараметры.Добавить(НСтр("ru='Не определено'"));
	ВыходныеПараметры.Добавить(НСтр("ru='Не определено'"));
	ВыходныеПараметры.Добавить(НСтр("ru='Не определено'"));
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	
	НаименованиеДрайвера      = "";
	ОписаниеДрайвера          = "";
	ТипОборудования           = "";
	ИнтеграционныйКомпонент   = Ложь;
	ОсновнойДрайверУстановлен = Ложь;
	#Если Клиент Тогда
	РевизияИнтерфейса         = МенеджерОборудованияКлиентПовтИсп.РевизияИнтерфейсаДрайверов();
	#Иначе
	РевизияИнтерфейса         = 2005;
	#КонецЕсли
	URLЗагрузкиДрайвера       = "";
	ПараметрыДрайвера         = "";
	ДополнительныеДействия    = "";
	
	Если ПараметрыПодключения.Свойство("ТипОборудования") Тогда
		ТипОборудования = ПараметрыПодключения.ТипОборудования;
		// Предопределенный параметр с указанием типа драйвера.
		ОбъектДрайвера.УстановитьПараметр("EquipmentType", ТипОборудования) 
	КонецЕсли;
		
	Попытка
		// Получаем версию драйвера
		ВерсияДрайвера = ОбъектДрайвера.ПолучитьНомерВерсии();
			// Получаем описание драйвера
		ОбъектДрайвера.ПолучитьОписание(НаименованиеДрайвера, ОписаниеДрайвера, ТипОборудования, РевизияИнтерфейса, ИнтеграционныйКомпонент, 
			ОсновнойДрайверУстановлен, URLЗагрузкиДрайвера);
	Исключение
		Попытка
			ОписаниеДрайвера = "";
			ОбъектДрайвера.ПолучитьОписание(ОписаниеДрайвера);
			ОписаниеДрайвераПараметры = МенеджерОборудованияВызовСервера.ПолучитьОписаниеДрайвера(ОписаниеДрайвера);
			ВерсияДрайвера            = ОписаниеДрайвераПараметры.ВерсияДрайвера;
			НаименованиеДрайвера      = ОписаниеДрайвераПараметры.НаименованиеДрайвера;
			ОписаниеДрайвера          = ОписаниеДрайвераПараметры.ОписаниеДрайвера;
			ТипОборудования           = ОписаниеДрайвераПараметры.ТипОборудования;
			ИнтеграционныйКомпонент   = ОписаниеДрайвераПараметры.ИнтеграционныйКомпонент;
			ОсновнойДрайверУстановлен = ОписаниеДрайвераПараметры.ОсновнойДрайверУстановлен;
			URLЗагрузкиДрайвера       = ОписаниеДрайвераПараметры.URLЗагрузкиДрайвера;
			// Получаем ревизию интерфейса драйвера.
			РевизияИнтерфейса = ОбъектДрайвера.ПолучитьРевизиюИнтерфейса();
		Исключение
			ИсключениеРезультат = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка получения описания драйвера'") + Символы.ПС + ОписаниеОшибки());
		КонецПопытки
	КонецПопытки;
	
	Если Результат Тогда
		ВыходныеПараметры[1] = ВерсияДрайвера;
		ВыходныеПараметры[2] = НаименованиеДрайвера;
		ВыходныеПараметры[3] = ОписаниеДрайвера;
		ВыходныеПараметры[4] = ТипОборудования;
		ВыходныеПараметры[5] = РевизияИнтерфейса;
		ВыходныеПараметры[6] = ИнтеграционныйКомпонент;
		ВыходныеПараметры[7] = ОсновнойДрайверУстановлен;
		ВыходныеПараметры[8] = URLЗагрузкиДрайвера;
		
		// Получаем описание драйвера
		ОбъектДрайвера.ПолучитьПараметры(ПараметрыДрайвера);
		ВыходныеПараметры[9] = ПараметрыДрайвера;
		// Получаем дополнительные действия.
		ОбъектДрайвера.ПолучитьДополнительныеДействия(ДополнительныеДействия);
		ВыходныеПараметры[10] = ДополнительныеДействия;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сформировать таблицу товаров в XML структуре для весов с печатью этикеток.
//
Функция СформироватьТаблицуТоваров(ДанныеЗагрузки) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	#Если Не ВебКлиент Тогда
	ЗаписьXML.ЗаписатьНачалоЭлемента("Table");
	Для Каждого Позиция Из ДанныеЗагрузки  Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Record");
		ЗаписьXML.ЗаписатьАтрибут("PLU",           XMLСтрока(Позиция[0].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Code",          XMLСтрока(Позиция[1].Значение));
		ЗаписьXML.ЗаписатьАтрибут("EANData",       XMLСтрока(Позиция[2].Значение));
		ЗаписьXML.ЗаписатьАтрибут("ShortName",     XMLСтрока(Позиция[3].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Name",          XMLСтрока(Позиция[4].Значение));
		ЗаписьXML.ЗаписатьАтрибут("GroupCode",     XMLСтрока(Позиция[5].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Price",         XMLСтрока(Позиция[6].Значение));
		ЗаписьXML.ЗаписатьАтрибут("SellByDate",    XMLСтрока(Позиция[7].Значение));
		ЗаписьXML.ЗаписатьАтрибут("SellByTime",    XMLСтрока(Позиция[8].Значение));
		ЗаписьXML.ЗаписатьАтрибут("UsedByDate",    XMLСтрока(Позиция[9].Значение));
		ЗаписьXML.ЗаписатьАтрибут("PackedDate",    XMLСтрока(Позиция[10].Значение));
		ЗаписьXML.ЗаписатьАтрибут("PackedTime",    XMLСтрока(Позиция[11].Значение));
		ЗаписьXML.ЗаписатьАтрибут("IsWeightGoods", XMLСтрока(Позиция[12].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Description",   XMLСтрока(Позиция[13].Значение));
		ЗаписьXML.ЗаписатьАтрибут("SpecMessage",   XMLСтрока(Позиция[14].Значение));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		//1 Наименование какие ограничения?
		//2. Формирование штрих кода - передавать менно в таком виде как в примере?
		//3. Срок годности - ?
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	#КонецЕсли
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

Функция СформироватьТаблицуСообщений(ДанныеЗагрузки) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	#Если Не ВебКлиент Тогда
	ЗаписьXML.ЗаписатьНачалоЭлемента("Table");
	Для Каждого Позиция Из ДанныеЗагрузки  Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Record");
		ЗаписьXML.ЗаписатьАтрибут("TextID", XMLСтрока(Позиция[0].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Value",  XMLСтрока(Позиция[1].Значение));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	#КонецЕсли
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

// Сформировать таблицу магазинов в XML структуре для весов с печатью этикеток.
//
Функция СформироватьТаблицуМагазинов(ДанныеЗагрузки) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	#Если Не ВебКлиент Тогда
	ЗаписьXML.ЗаписатьНачалоЭлемента("Table");
	Для Каждого Позиция Из ДанныеЗагрузки  Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Record");
		ЗаписьXML.ЗаписатьАтрибут("Code", XMLСтрока(Позиция[0].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Name", XMLСтрока(Позиция[1].Значение));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	#КонецЕсли
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

//Функция разбивает исходную строку на указанное количество строк заданной длины,
//При этом производится перенос только целых слов ...
//за исключением последнего слова, если его длина превышает максимальную длину строки
Функция ВыполнитьПереносСтрок(ИсходнаяСтрокаВходящая,ДлинаСтроки,КоличествоСтрок,РазделительСтрок=" ") Экспорт
	
	ИсходнаяСтрока = ИсходнаяСтрокаВходящая;
	ИсходнаяСтрока = СокрЛП(ИсходнаяСтрока);
	Если ПустаяСтрока(ИсходнаяСтрока) Тогда
		Возврат ИсходнаяСтрока;
	КонецЕсли;
	ИсходнаяСтрока=СтрЗаменить(ИсходнаяСтрока,Символы.ПС," ");
	ИсходнаяСтрока=СтрЗаменить(ИсходнаяСтрока,"|"," ");
	//Нужно ли добавлять пробелы к ",.:-"?
	//Может вообще MS-Office подключить для расстановки переносов?...
	ИсходнаяСтрока=СтрЗаменить(ИсходнаяСтрока,":",": ");
	//А вот эти символы пока не заменяем
	//ИсходнаяСтрока=СтрЗаменить(ИсходнаяСтрока,",",", ");
	//ИсходнаяСтрока=СтрЗаменить(ИсходнаяСтрока,".",". ");
	//ИсходнаяСтрока=СтрЗаменить(ИсходнаяСтрока,"-"," - ");
	//Убираем лишние пробелы
	ИсходнаяСтрока=СтрЗаменить(ИсходнаяСтрока,"  "," ");
	//ПромежуточнаяСтрока="";
	//ПромежуточнаяСтрока2="";
	ИтоговаяСтрока="";
	ПредыдущееСлово="";
	Слово="";
	ДобавилиСтрок=0;
	Пока Истина Цикл
		Рез=Найти(ИсходнаяСтрока," ");
		Если Рез=0 Тогда
			//осталось одно слово без пробелов.
			
			//Но могли забыть предыдущее слово
			Если НЕ ПустаяСтрока(ПредыдущееСлово) Тогда
				Если СтрДлина(СокрЛП(ПредыдущееСлово+" "+ИсходнаяСтрока))>ДлинаСтроки Тогда
					//ИтоговаяСтрока=ИтоговаяСтрока+Слово+"|";
					ИтоговаяСтрока=ИтоговаяСтрока+ПредыдущееСлово+РазделительСтрок;
					ДобавилиСтрок=ДобавилиСтрок+1;
				Иначе
					//Нужно добавить последнее слово к строке
					ИсходнаяСтрока=ПредыдущееСлово+" "+ИсходнаяСтрока;
				КонецЕсли;
			КонецЕсли;
			Если ДобавилиСтрок>=КоличествоСтрок Тогда
				Прервать;
			КонецЕсли;
			//теперь нужно разбить последнее слово
			
			Пока СтрДлина(ИсходнаяСтрока)>ДлинаСтроки Цикл
				ИтоговаяСтрока=ИтоговаяСтрока+Лев(ИсходнаяСтрока,ДлинаСтроки)+РазделительСтрок;
				ДлинаИсходной=СтрДлина(ИсходнаяСтрока);
				ИсходнаяСтрока=СокрЛП(Прав(ИсходнаяСтрока,ДлинаИсходной-ДлинаСтроки));
				ДобавилиСтрок=ДобавилиСтрок+1;
				Если ДобавилиСтрок>=КоличествоСтрок Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ДобавилиСтрок>=КоличествоСтрок Тогда
				Прервать;
			КонецЕсли;
			Если НЕ ПустаяСтрока(ИсходнаяСтрока) Тогда
				ИтоговаяСтрока=ИтоговаяСтрока+ИсходнаяСтрока;
				ДобавилиСтрок=ДобавилиСтрок+1;
			КонецЕсли;
			Прервать;
		Иначе
			Слово=СокрЛП(Лев(ИсходнаяСтрока,Рез));
			//Выделили слово
			ДлинаИсходной=СтрДлина(ИсходнаяСтрока);
			ИсходнаяСтрока=СокрЛП(Прав(ИсходнаяСтрока,ДлинаИсходной-Рез));
			//Уменьшим исходную строку
			Если СтрДлина(Слово)>=ДлинаСтроки Тогда
				//Выведем слово в итоговую строку
				//НО сначала выведем предыдущее слово, если оно есть
				//не важно, какой оно длины.
				Если НЕ ПустаяСтрока(ПредыдущееСлово) Тогда
					ИтоговаяСтрока=ИтоговаяСтрока+ПредыдущееСлово+РазделительСтрок;
					ПредыдущееСлово="";
					ДобавилиСтрок=ДобавилиСтрок+1;
				КонецЕсли;
				Если ДобавилиСтрок>=КоличествоСтрок Тогда
					Прервать;
				КонецЕсли;
				//Теперь частями выведем строку
				Пока СтрДлина(Слово)>ДлинаСтроки Цикл
					ИтоговаяСтрока=ИтоговаяСтрока+Лев(Слово,ДлинаСтроки)+РазделительСтрок;
					ДлинаСлова=СтрДлина(Слово);
					Слово=СокрЛП(Прав(Слово,ДлинаСлова-ДлинаСтроки));
					ДобавилиСтрок=ДобавилиСтрок+1;
					Если ДобавилиСтрок>=КоличествоСтрок Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
				//Все, что осталось от слова добавим к предыдущему слову
				//т.к. предыдущее мы только что вывели, то
				ПредыдущееСлово=Слово;
				Если ДобавилиСтрок>=КоличествоСтрок Тогда
					Прервать;
				КонецЕсли;
			Иначе
				//Увеличим предыдущее слово
				//но сначала проверим - вместится ли строка
				Если СтрДлина(СокрЛП(ПредыдущееСлово+" "+Слово))>ДлинаСтроки Тогда
					//Выведем предыдущее слово.
					ИтоговаяСтрока=ИтоговаяСтрока+ПредыдущееСлово+РазделительСтрок;
					ПредыдущееСлово="";
					ДобавилиСтрок=ДобавилиСтрок+1;
				КонецЕсли;
				ПредыдущееСлово=СокрЛП(ПредыдущееСлово+" "+Слово);
				Если ДобавилиСтрок>=КоличествоСтрок Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СокрЛП(ИтоговаяСтрока);
	
КонецФункции

#КонецОбласти
