// Модуль основной формы документа "Товарно-транспортная накладная ЕГАИС (исходящая)"

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


// Формирует содержание колонок Марок в ТЧ Товары.
//
&НаСервере
Процедура СформироватьПредставленияМарок()

	// Подчиненные ТЧ
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		
		НайденныеМарки     = Объект.Марки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтроки));
		Если НайденныеМарки.Количество() > 0 Тогда
			ПредставлениеМарок = "Введено марок: " + Строка(НайденныеМарки.Количество());
		Иначе
			ПредставлениеМарок = "Марки не указаны";
		КонецЕсли;
		
		ТекущаяСтрока.ПредставлениеМарок = ПредставлениеМарок;
	КонецЦикла;
	
КонецПроцедуры // СформироватьПредставленияМарок()

&НаКлиенте
Процедура ПослеПодбораМарок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = ДополнительныеПараметры.ДанныеСтроки;
	
	ИнтеграцияЕГАИСКлиент.ПослеПодбораМарок(ЭтотОбъект, Объект, ДанныеСтроки, Результат);
	
КонецПроцедуры // ПослеПодбораМарок()

&НаСервере
Процедура СформироватьПеремещениеИзТорговогоЗалаЕГАИС(ДокументСсылка)
	
	ПеремещениеИзТорговогоЗала = Документы.ПеремещениеВТорговыйЗалЕГАИС.СоздатьДокумент();
	ПеремещениеИзТорговогоЗала.Заполнить(ДокументСсылка);
	Если ПеремещениеИзТорговогоЗала.Товары.Количество() = 0 Тогда
		ВывестиСообщение(НСтр("ru = 'Документ Перемещение из торгового зала не сформирован'"), Объект);
		Возврат;
	КонецЕсли;
	ПеремещениеИзТорговогоЗала.Записать(РежимЗаписиДокумента.Проведение);
	
	ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные;
	ДанныеДляВыполненияОбменаНаКлиенте = ИнтеграцияЕГАИСВызовСервера.ПодготовитьКПередаче(ПеремещениеИзТорговогоЗала.Ссылка, ДальнейшееДействие);
	
	ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(Объект.Ссылка);
	ТекущееСостояние.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПеремещениеИзТЗ;
	ТекущееСостояние.ДальнейшееДействие2 = Перечисления.ДальнейшиеДействияЕГАИС.РазрешитеОтправкуТТН;
	ТекущееСостояние.ВидСтатуса          = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОжидаемПеремещениеИзТЗ;
	ТекущееСостояние.СтатусОбработки     = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработки(Объект.Ссылка.Метаданные(), ТекущееСостояние.ВидСтатуса);
	
	РегистрыСведений.СтатусыДокументовЕГАИС.ВыполнитьЗаписьВРегистр(ТекущееСостояние);
	ОбновитьСтатусОбработки();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтказОтПеремещенияИзТорговогоЗала(ДокументСсылка)
	
	ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(Объект.Ссылка);
	
	ТекущееСостояние.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные;
	ТекущееСостояние.ДальнейшееДействие2 = Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется;
	ТекущееСостояние.ВидСтатуса          = Перечисления.ВидыСтатусовОбработкиЕГАИС.КПередаче;
	ТекущееСостояние.СтатусОбработки     = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработки(Объект.Ссылка.Метаданные(), ТекущееСостояние.ВидСтатуса);
	
	РегистрыСведений.СтатусыДокументовЕГАИС.ВыполнитьЗаписьВРегистр(ТекущееСостояние);
	ОбновитьСтатусОбработки();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроверку()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",           Объект.Ссылка);
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", Объект.Грузоотправитель);
	//Запрос.УстановитьПараметр("Момент",           Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТТНТовары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Товары КАК ТТНТовары
	|ГДЕ
	|	ТТНТовары.Ссылка = &Ссылка И 
	|	ТТНТовары.Справка1 = ЗНАЧЕНИЕ(Справочник.Справки1ЕГАИС.ПустаяСсылка) И
	|	ТТНТовары.Справка2.НомерСправки1 = """"
	|";
	
	ЕстьОшиби = Ложь;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.НомерСтроки) Тогда
			ВывестиСообщение(НСтр("ru = 'В строке №# не указана справка 1'"), ЭтотОбъект,, Выборка.НомерСтроки);
			ЕстьОшиби = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОшиби Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТТНМарки.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ
	|	МаркированнаяПродукция
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Марки КАК ТТНМарки
	|ГДЕ
	|	ТТНМарки.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	ТТНТовары.АлкогольнаяПродукция,
	|	ТТНТовары.Справка2,
	|	СУММА(ТТНТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ
	|	ТТНТовары
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Товары КАК ТТНТовары
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	МаркированнаяПродукция КАК МаркированнаяПродукция
	|ПО
	|	ТТНТовары.ИдентификаторСтроки = МаркированнаяПродукция.ИдентификаторСтроки
	|ГДЕ
	|	ТТНТовары.Ссылка = &Ссылка И 
	|	МаркированнаяПродукция.ИдентификаторСтроки ЕСТЬ NULL И 
	|	(НЕ ТТНТовары.Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка))
	|СГРУППИРОВАТЬ ПО
	|	ТТНТовары.АлкогольнаяПродукция,
	|	ТТНТовары.Справка2
	|;
	|
	|ВЫБРАТЬ
	|	ТТНТовары.ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	ТТНТовары.АлкогольнаяПродукция,
	|	ТТНТовары.Справка2 КАК Справка2,
	|	ТТНТовары.Количество КАК Количество,
	|	ЕСТЬNULL(ОстаткиАлкогольнойПродукцииЕГАИС.КоличествоОстаток, 0) КАК КоличествоЗапас
	|ПОМЕСТИТЬ
	|	НеобеспеченныеТовары
	|ИЗ
	|	ТТНТовары КАК ТТНТовары
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(, (ОрганизацияЕГАИС, АлкогольнаяПродукция, Справка2) В (ВЫБРАТЬ ОрганизацияЕГАИС, АлкогольнаяПродукция, Справка2 ИЗ ТТНТовары)) КАК ОстаткиАлкогольнойПродукцииЕГАИС
	|ПО
	|	ТТНТовары.ОрганизацияЕГАИС = ОстаткиАлкогольнойПродукцииЕГАИС.ОрганизацияЕГАИС И 
	|	ТТНТовары.АлкогольнаяПродукция = ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция И 
	|	ТТНТовары.Справка2 = ОстаткиАлкогольнойПродукцииЕГАИС.Справка2
	|ГДЕ
	|	ТТНТовары.Количество > ЕСТЬNULL(ОстаткиАлкогольнойПродукцииЕГАИС.КоличествоОстаток, 0)
	|;
	|
	|ВЫБРАТЬ
	|	ПеремещениеВТЗ.Справка2,
	|	СУММА(ПеремещениеВТЗ.КоличествоВЗале) КАК КоличествоВЗале
	|ПОМЕСТИТЬ
	|	ПеремещениеВТЗ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТТНТовары.Справка2,
	|		СУММА(ПеремещениеВТЗ.Количество) КАК КоличествоВЗале
	|	ИЗ
	|		НеобеспеченныеТовары КАК ТТНТовары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС КАК ПеремещениеВТЗ
	|	ПО
	|		ТТНТовары.Справка2 = ПеремещениеВТЗ.Справка2 И 
	|		ТТНТовары.ОрганизацияЕГАИС = ПеремещениеВТЗ.ОрганизацияЕГАИС И 
	|		ПеремещениеВТЗ.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеВТорговыйЗалЕГАИС) И 
	|		ПеремещениеВТЗ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	СГРУППИРОВАТЬ ПО
	|		ТТНТовары.Справка2
	|	
	|	ОБЪЕДИНИТЬ ВСЕ	
	|	
	|	ВЫБРАТЬ
	|		ТТНТовары.Справка2,
	|		-СУММА(ПеремещениеИзТЗ.Количество) КАК КоличествоВЗале
	|	ИЗ
	|		НеобеспеченныеТовары КАК ТТНТовары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС КАК ПеремещениеИзТЗ
	|	ПО
	|		ТТНТовары.Справка2 = ПеремещениеИзТЗ.Справка2 И 
	|		ТТНТовары.ОрганизацияЕГАИС = ПеремещениеИзТЗ.ОрганизацияЕГАИС И 
	|		ПеремещениеИзТЗ.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеИзТорговогоЗалаЕГАИС) И 
	|		ПеремещениеИзТЗ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	СГРУППИРОВАТЬ ПО
	|		ТТНТовары.Справка2) КАК ПеремещениеВТЗ
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеВТЗ.Справка2
	|;
	|
	|ВЫБРАТЬ
	|	ТТНТовары.АлкогольнаяПродукция,
	|	ТТНТовары.АлкогольнаяПродукция.Код КАК Код,
	|	ТТНТовары.Количество КАК Количество,
	|	ТТНТовары.КоличествоЗапас КАК КоличествоЗапас,
	|	ЕСТЬNULL(ПеремещениеВТЗ.КоличествоВЗале, 0) КАК КоличествоВЗале
	|ИЗ
	|	НеобеспеченныеТовары КАК ТТНТовары
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ПеремещениеВТЗ КАК ПеремещениеВТЗ
	|ПО
	|	ТТНТовары.Справка2 = ПеремещениеВТЗ.Справка2
	|";
	
	Отказ = Ложь;
	Выборка = Запрос.Выполнить().Выбрать();
	МожноПереместить = Ложь;
	Пока Выборка.Следующий() Цикл
		ВывестиСообщение(НСтр("ru = 'Недостаточное количество продукции: [%2] %1. Требуемое количество %3, количество на складе %4, количество в торговом зале %5'"), 
			Объект,,,Отказ, СокрЛП(Выборка.АлкогольнаяПродукция), СокрЛП(Выборка.Код), Выборка.Количество, Выборка.КоличествоЗапас, Выборка.КоличествоВЗале);
		Если Выборка.КоличествоВЗале>0 Тогда
			МожноПереместить = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(Объект.Ссылка);
	Если Отказ И МожноПереместить Тогда
		ТекущееСостояние.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияЕГАИС.ВыполнитеПеремещениеИзТорговогоЗала;
		ТекущееСостояние.ДальнейшееДействие2 = Перечисления.ДальнейшиеДействияЕГАИС.РазрешитеОтправкуТТН;
		ТекущееСостояние.ВидСтатуса          = Перечисления.ВидыСтатусовОбработкиЕГАИС.ТребуетсяПеремещениеИзТорговогоЗала;
		ТекущееСостояние.СтатусОбработки     = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработки(Объект.Ссылка.Метаданные(), ТекущееСостояние.ВидСтатуса);
	Иначе
		ТекущееСостояние.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные;
		ТекущееСостояние.ДальнейшееДействие2 = Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется;
		ТекущееСостояние.ВидСтатуса          = Перечисления.ВидыСтатусовОбработкиЕГАИС.КПередаче;
		ТекущееСостояние.СтатусОбработки     = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработки(Объект.Ссылка.Метаданные(), ТекущееСостояние.ВидСтатуса);
	КонецЕсли;
	
	РегистрыСведений.СтатусыДокументовЕГАИС.ВыполнитьЗаписьВРегистр(ТекущееСостояние);
	ОбновитьСтатусОбработки();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

#Область Статус

&НаСервере
Процедура ОбновитьСтатусОбработки()
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	
	ИмяДокумента    = Объект.Ссылка.Метаданные().Имя;
	СтатусПоУмолчанию = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработкиПоУмолчанию(ИмяДокумента);
	СтатусОбработки    = СтатусПоУмолчанию.СтатусОбработки;
	ДальнейшееДействие = СтатусПоУмолчанию.ДальнейшееДействие;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Статусы.СтатусОбработки.ВидСтатуса КАК СтатусОбработки,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие1 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияЕГАИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие1
		|	КОНЕЦ КАК ДальнейшееДействие1,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие2 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияЕГАИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие2
		|	КОНЕЦ КАК ДальнейшееДействие2,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие3 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияЕГАИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие3
		|	КОНЕЦ КАК ДальнейшееДействие3
		|ИЗ
		|	РегистрСведений.СтатусыДокументовЕГАИС КАК Статусы
		|ГДЕ
		|	Статусы.Документ = &Документ";
		
		Запрос.УстановитьПараметр("Документ",                 Объект.Ссылка);
		Запрос.УстановитьПараметр("МассивДальнейшиеДействия", ИнтеграцияЕГАИС.НеотображаемыеВДокументахДальнейшиеДействия());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СтатусОбработки = Выборка.СтатусОбработки;
			ДальнейшееДействие = Новый Массив;
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие1);
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие2);
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие3);
		КонецЕсли;
		
	КонецЕсли;
	
	ДопустимыеДействия = Новый Массив;
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ВыполнитеПроверку);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ВыполнитеПеремещениеИзТорговогоЗала);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.РазрешитеОтправкуТТН);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПодтвердитеАктОРасхождениях);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтАктаОРасхождениях);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПодтвердитеЗапросНаОтменуПроведения);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтЗапросаНаОтменуПроведения);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеПередачуДанных);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтНакладной);
	
	СтатусОбработкиПредставление = ИнтеграцияЕГАИС.ПредставлениеСтатусаОбработки(
		СтатусОбработки,
		ДальнейшееДействие,
		ДопустимыеДействия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ВыполнитьПроверку" Тогда
		
		ВыполнитьПроверку();
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ВыполнитьПеремещениеИзТорговогоЗала" Тогда
		
		СформироватьПеремещениеИзТорговогоЗалаЕГАИС(Объект.Ссылка);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "РазрешитьОтправкуТТН" Тогда
		
		СформироватьОтказОтПеремещенияИзТорговогоЗала(Объект.Ссылка);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПередатьДанные" Тогда
		
		ИнтеграцияЕГАИСКлиент.ПодготовитьКПередаче(
			Объект.Ссылка,
			ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияЕГАИС.ПередайтеДанные"),
			ЭтотОбъект.УникальныйИдентификатор);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПодтвердитьАктОРасхождениях" Тогда
		
		ИнтеграцияЕГАИСКлиент.ПодготовитьКПередаче(
			Объект.Ссылка,
			ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияЕГАИС.ПодтвердитеАктОРасхождениях"),
			ЭтотОбъект.УникальныйИдентификатор);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтказатьсяОтАктаОРасхождениях" Тогда
		
		ИнтеграцияЕГАИСКлиент.ПодготовитьКПередаче(
			Объект.Ссылка,
			ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияЕГАИС.ОткажитесьОтАктаОРасхождениях"),
			ЭтотОбъект.УникальныйИдентификатор);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПодтвердитьЗапросНаОтменуПроведения" Тогда
		
		ИнтеграцияЕГАИСКлиент.ПодготовитьКПередаче(
			Объект.Ссылка,
			ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияЕГАИС.ПодтвердитеЗапросНаОтменуПроведения"),
			ЭтотОбъект.УникальныйИдентификатор);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтказатьсяОтЗапросаНаОтменуПроведения" Тогда
		
		ИнтеграцияЕГАИСКлиент.ПодготовитьКПередаче(
			Объект.Ссылка,
			ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияЕГАИС.ОткажитесьОтЗапросаНаОтменуПроведения"),
			ЭтотОбъект.УникальныйИдентификатор);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтказатьсяОтНакладной" Тогда
		
		ИнтеграцияЕГАИСКлиент.ПодготовитьКПередаче(
			Объект.Ссылка,
			ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияЕГАИС.ОткажитесьОтНакладной"),
			ЭтотОбъект.УникальныйИдентификатор);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтменитьОперацию" Тогда
		
		ИнтеграцияЕГАИСКлиент.ОтменитьПоследнююОперацию(Объект.Ссылка);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтменитьПередачу" Тогда
		
		ИнтеграцияЕГАИСКлиент.ОтменитьПередачу(Объект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбработкиОбработкаНавигационнойСсылкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда
		 Возврат;
	КонецЕсли;
	
	Если ПроверитьЗаполнение() Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	КонецЕсли;
	
	Если Не Модифицированность И Объект.Проведен Тогда
		ОбработатьНажатиеНавигационнойСсылки(ДополнительныеПараметры.НавигационнаяСсылкаФорматированнойСтроки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	Если СтатусОбработки = Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен Тогда   
		
		Элементы.СтраницаАктРасхождения.Видимость = Истина;
		Элементы.СтраницаАктРасхождения.Заголовок = НСтр("ru = 'Отмена ТТН'");
		
	ИначеЕсли Объект.ЕстьРасхождения Тогда
		
		Элементы.СтраницаАктРасхождения.Видимость = Истина;
		Элементы.СтраницаАктРасхождения.Заголовок = НСтр("ru = 'Акт расхождения'");
		
	Иначе
		
		Элементы.СтраницаАктРасхождения.Видимость = Ложь;
		
	КонецЕсли;
	
	Если Объект.ФорматОбмена = 4 Тогда
		Элементы.Автомобиль.Видимость           = Ложь;
		Элементы.ТранспортноеСредство.Видимость = Истина;
	Иначе
		Элементы.Автомобиль.Видимость           = Истина;
		Элементы.ТранспортноеСредство.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

&НаСервере
Процедура ОбновитьПредставленияНаФорме(Прочитать = Ложь)
	
	Если Прочитать Тогда
		Прочитать();
	Иначе
		ОбновитьСтатусОбработки();
	КонецЕсли;
	
	//ОбновитьИнформациюОткрытияФормыСканирования();
	//УправлениеДоступностьюЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформлениеПредставлениеМарок(ЭтотОбъект);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Марки.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Марки.Отвергнута");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(250,0,0));
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	Сформирован = НЕ (Документы.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ВидыСтатусовДвижений().Найти(СтатусОбработки) = Неопределено);
	ЭлементыФомы = ";СтраницаДополнительно, Шапка";
	СписокРеквизитов.Добавить("Марки", "Марки",Сформирован);
	СписокРеквизитов.Добавить("АктРасхождения", "АктРасхождения",Сформирован);
	СписокРеквизитов.Добавить("Товары","Товары",Сформирован);
	СписокРеквизитов.Добавить(ЭлементыФомы, ЭлементыФомы,Сформирован);
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
		
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаСервере
Процедура ОтказатьВПодтвержденииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьВПодтверждении(Команда)
	ОтказатьВПодтвержденииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтклонитьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ОтклонитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	ПодтвердитьНаСервере();
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	ОбновитьСтатусОбработки();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего на клиенте при нажатии на гиперссылку форматированной строки "Статус обработки представление".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НавигационнаяСсылкаФорматированнойСтроки - Строка - Значение гиперссылки форматированной строки.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура СтатусОбработкиПредставлениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	Если Модифицированность ИЛИ (Не ЗначениеЗаполнено(Объект.Ссылка)) Или (Не Объект.Проведен) Тогда
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("СтатусОбработкиОбработкаНавигационнойСсылкиЗавершение", ЭтотОбъект, Новый Структура("НавигационнаяСсылкаФорматированнойСтроки", НавигационнаяСсылкаФорматированнойСтроки));
		ТекстВопроса = НСтр("ru = 'Для продолжения документ необходимо провести. Провести?'");
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки);
	КонецЕсли;
	
КонецПроцедуры // СтатусОбработкиПредставлениеОбработкаНавигационнойСсылки()

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Количество" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыКоличествоПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ТоварыКоличествоПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыКоличествоПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыКоличествоПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыКоличествоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЦенаПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ТоварыКоличествоПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЦенаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Цена".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЦенаПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЦенаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ТоварыКоличествоПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСуммаПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры // ТоварыПередНачаломДобавления()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры // ТоварыПередУдалением()

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле - Булево - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИнтеграцияЕГАИСКлиент.ТоварыВыбор(Объект, ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры // ТоварыВыбор()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "МАРКИ"

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле - Булево - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура АктРасхожденияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИнтеграцияЕГАИСКлиент.ТоварыВыбор(Объект, ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры // ТоварыВыбор()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "МАРКИ"

// Обработчик события возникающего на клиенте при активизации строки таблицы.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура МаркиПриАктивизацииСтроки(Элемент)
	
	СтрокиУпаковок = МаркировкаУпаковок.ПолучитьЭлементы();
	СтрокиУпаковок.Очистить();
	ТекущиеДанные = Элементы.Марки.ТекущиеДанные;
	Если Объект.Марки.Количество() = 0 ИЛИ ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивУпаковок = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, МаркировкаУпаковки", ТекущиеДанные.ИдентификаторСтроки, ТекущиеДанные.МаркировкаУпаковки));
	ВложенностьУпаковки = МассивУпаковок.Количество();
	
	Пока ВложенностьУпаковки > 0 Цикл
		
		Для Каждого СтрокаУпаковки Из МассивУпаковок Цикл
			Если СтрокаУпаковки.УровеньВложенности = ВложенностьУпаковки Тогда
				НоваяУпаковка = СтрокиУпаковок.Добавить();
				НоваяУпаковка.МаркировкаУпаковки = СтрокаУпаковки.МаркировкаГруппыУпаковок;
				СтрокиУпаковок = НоваяУпаковка.ПолучитьЭлементы();
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ВложенностьУпаковки = ВложенностьУпаковки - 1;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.МаркировкаУпаковки) Тогда
		НоваяУпаковка = СтрокиУпаковок.Добавить();
		НоваяУпаковка.МаркировкаУпаковки = ТекущиеДанные.МаркировкаУпаковки;
		Элементы.МаркиУпаковок.ТекущаяСтрока = НоваяУпаковка;
	КонецЕсли;

КонецПроцедуры // МаркиПриАктивизацииСтроки()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	//ПроверитьВозможностьОтгрузки
	
	ОбновитьСтатусОбработки();
	СформироватьПредставленияМарок();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	ткОбработкаТабличнойЧастиТовары.ЗаполнитьРеквизитОстатокАлкоПродукции(Объект, Неопределено, "Товары");
	
	Если НЕ Элементы.ГлобальныеКоманды.ПодчиненныеЭлементы.Найти("ФормаСоздатьНаОсновании") = Неопределено 
		И НЕ Элементы.ГлобальныеКоманды.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.Найти("ФормаДокументПеремещениеВТорговыйЗалЕГАИССоздатьНаОсновании") = Неопределено Тогда
		Элементы.ГлобальныеКоманды.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокументПеремещениеВТорговыйЗалЕГАИССоздатьНаОсновании.Заголовок = "Перемещения из торового зала ЕГАИС";
	КонецЕсли;
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;

	Если НЕ Элементы.ГлобальныеКоманды.ПодчиненныеЭлементы.Найти("ФормаСоздатьНаОсновании") = Неопределено 
		И НЕ Элементы.ГлобальныеКоманды.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.Найти("ФормаДокументПеремещениеВТорговыйЗалЕГАИССоздатьНаОсновании") = Неопределено Тогда
		Элементы.ГлобальныеКоманды.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокументПеремещениеВТорговыйЗалЕГАИССоздатьНаОсновании.Заголовок = "Перемещения из торового зала ЕГАИС";
	КонецЕсли;

	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Элементы.ГлобальныеКоманды.ПодчиненныеЭлементы.Найти("ФормаСоздатьНаОсновании") = Неопределено 
		И НЕ Элементы.ГлобальныеКоманды.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.Найти("ФормаДокументПеремещениеВТорговыйЗалЕГАИССоздатьНаОсновании") = Неопределено Тогда
		Элементы.ГлобальныеКоманды.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокументПеремещениеВТорговыйЗалЕГАИССоздатьНаОсновании.Заголовок = "Перемещения из торового зала ЕГАИС";
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	Если ИмяСобытия = "ИзменениеСостоянияЕГАИС"
		И Параметр.Ссылка = Объект.Ссылка Тогда
		
		Если Параметр.Свойство("ОбъектИзменен")
			И Параметр.ОбъектИзменен Тогда
			ОбновитьПредставленияНаФорме(Истина);
		Иначе
			ОбновитьПредставленияНаФорме(Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ВыполненОбменЕГАИС"
		И (Параметр = Неопределено
		Или (ТипЗнч(Параметр) = Тип("Структура") И Параметр.ОбновлятьСтатусЕГАИСВФормахДокументов)) Тогда
		
		ОбновитьПредставленияНаФорме(Истина);
		
	КонецЕсли;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ткОбработкаТабличнойЧастиТовары.ЗаполнитьРеквизитОстатокАлкоПродукции(Объект, Неопределено, "Товары");
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	ОбновитьСтатусОбработки();
	СформироватьПредставленияМарок();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
	Если НЕ Элементы.ГлобальныеКоманды.ПодчиненныеЭлементы.Найти("ФормаСоздатьНаОсновании") = Неопределено 
		И НЕ Элементы.ГлобальныеКоманды.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.Найти("ФормаДокументПеремещениеВТорговыйЗалЕГАИССоздатьНаОсновании") = Неопределено Тогда
		Элементы.ГлобальныеКоманды.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокументПеремещениеВТорговыйЗалЕГАИССоздатьНаОсновании.Заголовок = "Перемещения из торового зала ЕГАИС";
	КонецЕсли;
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	ткОбработкаТабличнойЧастиТовары.ЗаполнитьРеквизитОстатокАлкоПродукции(Объект, Неопределено, "Товары");
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	ОбновитьСтатусОбработки();
	СформироватьПредставленияМарок();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
	РазблокироватьДанныеФормыДляРедактирования();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаСервере
Процедура ГрузоотправительПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ГрузоотправительПриИзменении(Объект, ПараметрыДействия);
	
	// настроим параметры выбора
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузоотправительПриИзменении(Элемент)
	
	ГрузоотправительПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ГрузополучательПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ГрузополучательПриИзменении(Объект, ПараметрыДействия);
	
	// настроим параметры выбора
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузополучательПриИзменении(Элемент)
	
	ГрузополучательПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТоварыАлкогольнаяПродукцияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ТоварыАлкогольнаяПродукцияПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыАлкогольнаяПродукцияПриИзменении(Элемент)
	
	ТоварыАлкогольнаяПродукцияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТоварыСправка2ПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ТоварыСправка2ПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСправка2ПриИзменении(Элемент)
	
	ТоварыСправка2ПриИзмененииНаСервере();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
