
&НаСервереБезКонтекста
Функция ПолучитьGuidПредприятия(Предприятие)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Предприятие, "Код");
	
КонецФункции

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	Элементы.Предприятие.ТолькоПросмотр = ОтключитьПредприятие;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьПредприятие(ХозяйствующийСубъект, Предприятие)
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Истина КАК Предприятие
	|ИЗ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС.Предприятия КАК ТаблицаПредприятия
	|ГДЕ
	|	ТаблицаПредприятия.Ссылка = &ХозяйствующийСубъект И 
	|	ТаблицаПредприятия.Предприятие = &Предприятие
	|";
	
	Запрос.УстановитьПараметр("ХозяйствующийСубъект",  ХозяйствующийСубъект);
	Запрос.УстановитьПараметр("Предприятие", Предприятие);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Предприятие) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ХозяйствующийСубъектПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(ХозяйствующийСубъект) Тогда
		Если (НЕ ОтключитьПредприятие) И ЗначениеЗаполнено(Предприятие) И (НЕ ПроверитьПредприятие(ХозяйствующийСубъект, Предприятие)) Тогда
			Предприятие = Неопределено;
		КонецЕсли;
	Иначе
		Предприятие = Неопределено;
	КонецЕсли;
	
	ИнтеграцияВЕТИС.УстановитьПараметрыВыбораПредприятий(Элементы.Предприятие, ХозяйствующийСубъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ХозяйствующийСубъектПриИзменении(Элемент)
	
	ХозяйствующийСубъектПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредприятиеПриИзменении(Элемент)
	
	ОтключитьПредприятие = НЕ ЗначениеЗаполнено(Предприятие);
	ОтключитьПредприятиеПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьПредприятиеПриИзменении(Элемент)
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ДанныеДляВыгрузки = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДанныеДляВыгрузки", Неопределено);
	//ВидОперации       = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ВидОперации",       Неопределено);
	ХозяйствующийСубъект        = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ХозяйствующийСубъект",        Неопределено);
	Предприятие       = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Предприятие",       Неопределено);
	ДатаНачала        = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДатаНачала",        НачалоДня(ТекущаяДата()));
	ДатаОкончания     = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДатаОкончания",     ТекущаяДата());
	ПолучатьИзменения = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ПолучатьИзменения", Ложь);
	ТипВСД            = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ТипВСД",            "INCOMING");
	
	ОтключитьПредприятие = (НЕ ЗначениеЗаполнено(Предприятие));
	
	Если ПолучатьИзменения Тогда
		СтатусВСД     = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СтатусВСД",         Перечисления.СтатусыВСДВЕТИС.ПустаяСсылка());
		Элементы.ДекорацияПериод.Заголовок = "Интервал времени обновления. В список попадают все ВСД, дата последнего обновления которых попадает в указанный интервал.";
	Иначе
		СтатусВСД     = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СтатусВСД",         Перечисления.СтатусыВСДВЕТИС.CONFIRMED);
		Элементы.ДекорацияПериод.Заголовок = "Интервал времени оформления документа. В список попадают все ВСД, дата оформления которых попадает в указанный интервал. Если не указан, возвращается все имеющиеся документы.";
	КонецЕсли;
	
	ИнтеграцияВЕТИС.УстановитьПараметрыВыбораПредприятий(Элементы.Предприятие, ХозяйствующийСубъект);
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

Функция ПолучитьДанныеВыгрузки()
	
	Если ЗначениеЗаполнено(Предприятие) И (НЕ ОтключитьПредприятие) Тогда
		
		guidПредприятия = ПолучитьGuidПредприятия(Предприятие);
		
		ДанныеДляВыгрузки = Новый Структура;
		ДанныеДляВыгрузки.Вставить("ХозяйствующийСубъект",   ХозяйствующийСубъект);
		ДанныеДляВыгрузки.Вставить("Предприятие",            Предприятие);
		ДанныеДляВыгрузки.Вставить("guidПредприятия",        guidПредприятия);
		
		Если НЕ ТипВСД = "Все" Тогда
			ДанныеДляВыгрузки.Вставить("ТипВСД",             ТипВСД);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтатусВСД) Тогда
			ДанныеДляВыгрузки.Вставить("СтатусВСД",          СтатусВСД);
		КонецЕсли;
		
		ДанныеДляВыгрузки.Вставить("ДатаСинхронизации",      ТекущаяДата());
		ДанныеДляВыгрузки.Вставить("ДатаНачала",             ДатаНачала);
		ДанныеДляВыгрузки.Вставить("ДатаОкончания",          ДатаОкончания);
		
	Иначе
		ОбработанныеПредприятия = Новый Массив;
		ДанныеДляВыгрузки       = Новый Массив;
		
		Предприятия = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьПредприятия(ХозяйствующийСубъект);
		
		Если Предприятия.Количество() = 0 Тогда
			ВывестиСообщение(НСтр("ru='У хоз. субъекта <%1> нет предприятий.'"),,,,, СокрЛП(ХозяйствующийСубъект));
			Возврат ДанныеДляВыгрузки;
		Иначе
			Для Каждого ТекПредприятие ИЗ Предприятия Цикл
				
				Если НЕ ОбработанныеПредприятия.Найти(ТекПредприятие) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				guidПредприятия = ПолучитьGuidПредприятия(ТекПредприятие);
				
				СтрокаВыгрузки = Новый Структура;
				СтрокаВыгрузки.Вставить("ХозяйствующийСубъект",   ХозяйствующийСубъект);
				СтрокаВыгрузки.Вставить("Предприятие",            ТекПредприятие);
				СтрокаВыгрузки.Вставить("guidПредприятия",        guidПредприятия);
				
				Если НЕ ТипВСД = "Все" Тогда
					СтрокаВыгрузки.Вставить("ТипВСД",             ТипВСД);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтатусВСД) Тогда
					СтрокаВыгрузки.Вставить("СтатусВСД",          СтатусВСД);
				КонецЕсли;
				
				СтрокаВыгрузки.Вставить("ДатаСинхронизации",      ТекущаяДата());
				СтрокаВыгрузки.Вставить("ДатаНачала",             ДатаНачала);
				СтрокаВыгрузки.Вставить("ДатаОкончания",          ДатаОкончания);
				
				ДанныеДляВыгрузки.Добавить(СтрокаВыгрузки);
				
				ОбработанныеПредприятия.Добавить(ТекПредприятие);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеДляВыгрузки;
	
КонецФункции

&НаКлиенте
Процедура Запросить(Команда)
	
	//guidПредприятия = ПолучитьGuidПредприятия(Предприятие);
	//
	//СтрокаВыгрузки = Новый Структура;
	//СтрокаВыгрузки.Вставить("ХозяйствующийСубъект",   ХозяйствующийСубъект);
	//СтрокаВыгрузки.Вставить("Предприятие",            Предприятие);
	//СтрокаВыгрузки.Вставить("guidПредприятия",        guidПредприятия);
	//
	//Если НЕ ТипВСД = "Все" Тогда
	//	СтрокаВыгрузки.Вставить("ТипВСД",             ТипВСД);
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(СтатусВСД) Тогда
	//	СтрокаВыгрузки.Вставить("СтатусВСД",          СтатусВСД);
	//КонецЕсли;
	//
	//СтрокаВыгрузки.Вставить("ДатаСинхронизации",      ТекущаяДата());
	//СтрокаВыгрузки.Вставить("ДатаНачала",             ДатаНачала);
	//СтрокаВыгрузки.Вставить("ДатаОкончания",          ДатаОкончания);
	
	ДанныеДляВыгрузки = ПолучитьДанныеВыгрузки();
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДанныеДляВыгрузки", ДанныеДляВыгрузки);
	Если ПолучатьИзменения Тогда
		ПараметрыОткрытия.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ЗапросИзмененныхВСД"));
	Иначе
		ПараметрыОткрытия.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ЗапросВсехВСД"));
	КонецЕсли;
	ПараметрыОткрытия.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
	ПараметрыОткрытия.Вставить("Предприятие",          Предприятие);
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ФормированиеЗапроса", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры
