
Функция ПолучитьОформление(ОформлениеТаблицы) Экспорт
	
	Рез = Неопределено;
	ТекПараметр = БиблиотекаМакетовОформленияКомпоновкиДанных.Найти(ОформлениеТаблицы);
	Если НЕ ТекПараметр = Неопределено Тогда
		Рез = Новый Структура("Имя, Представление", ТекПараметр.Имя, ТекПараметр.Представление);
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

Функция ЗначениеФункциональнойОпции(ИмяФункциональнойОпции) Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию(ИмяФункциональнойОпции);
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С КОМПОНОВЩИКОМ ДАННЫХ //////////////////////////////////////

Функция КомпоновщикПолучитьНастройки(Знач КомпоновщикНастроек) Экспорт
	
	Возврат КомпоновщикНастроек.ПолучитьНастройки();
	
КонецФункции

#Область ОТЧЕТЫ_ТП

Процедура ЗаполнитьНастройкиОтчета(ФормаОтчета, КоллекцияЭлементов, ОбъектНастройки, ДоступныеНастройки = Неопределено, РодительЭлементов = Неопределено) Экспорт
	
	ОтчетыПлатформаСервер.ЗаполнитьНастройкиОтчета(ФормаОтчета, КоллекцияЭлементов, ОбъектНастройки, ДоступныеНастройки, РодительЭлементов);
	
КонецПроцедуры

Функция ПолучитьКартинкуДиаграммы(ИмяТипаДиаграммы) Экспорт
	
	Результат = Неопределено;
	Если Метаданные.ОбщиеКартинки.Найти(ИмяТипаДиаграммы) = Неопределено Тогда
		Результат = БиблиотекаКартинок.ДиаграммаИТаблица;
	Иначе
		Результат = БиблиотекаКартинок[ИмяТипаДиаграммы];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
