// Модуль менеджера регистра сведений "Журнал состояний"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Добавляет новую запись в журнал состояний
Функция ЗаписьВЖурналСостояний(ОбъектСсылка,Состояние=Неопределено) Экспорт
	
	НовоеСостояние=Состояние;
	Если НовоеСостояние=Неопределено Тогда
		НовоеСостояние=ОбъектСсылка.Состояние;
	КонецЕсли;
	
	ДобавитьЗаписьВЖурнал=Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекДата=ТекущаяДатаСеанса();
	ПоследнееСостояние=РегистрыСведений.ЖурналСостояний.СрезПоследних(ТекДата,Новый Структура("Объект",ОбъектСсылка));
	Если ПоследнееСостояние.Количество()=0 Тогда
		ДобавитьЗаписьВЖурнал=Истина;
	Иначе
		Если ПоследнееСостояние[0].Состояние<>НовоеСостояние Тогда
			ДобавитьЗаписьВЖурнал=Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ДобавитьЗаписьВЖурнал Тогда
		НоваяЗапись=РегистрыСведений.ЖурналСостояний.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период=ТекДата;
		НоваяЗапись.Объект=ОбъектСсылка;
		НоваяЗапись.Состояние=НовоеСостояние;
		НоваяЗапись.Автор=ПараметрыСеанса.ТекущийПользователь;
		НоваяЗапись.Компьютер=ПараметрыСеанса.РабочееМестоКлиента;
		Попытка
			НоваяЗапись.Записать(Истина);
		Исключение
			ВывестиСообщение(НСтр("ru='Ошибка записи в журнал изменения состояния: %1'"),,,,, ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции // ЗаписьВЖурналСостояний() 


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты регистра
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли