// Модуль менеджера справочника "Склады компании"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	ПредопределенныйОсновнойСклад = Справочники.СкладыКомпании.ОсновнойСкладКомпании.ПолучитьОбъект();
	
	// перезаполняем реквизиты
	Если СтрДлина(СокрЛП(ПредопределенныйОсновнойСклад.Код))=1 Тогда
		ПредопределенныйОсновнойСклад.УстановитьНовыйКод();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПредопределенныйОсновнойСклад.ПодразделениеКомпании) Тогда
		ПредопределенныйОсновнойСклад.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПредопределенныйОсновнойСклад.Организация) Тогда
		ПредопределенныйОсновнойСклад.Организация = Справочники.Организации.ОсновнаяОрганизация;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПредопределенныйОсновнойСклад.Розничный) Тогда
		ПредопределенныйОсновнойСклад.Розничный = Ложь;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПредопределенныйОсновнойСклад.ВидСклада) Тогда
		ПредопределенныйОсновнойСклад.ВидСклада = Перечисления.ВидыСкладов.Обычный;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПредопределенныйОсновнойСклад.ГрафикРаботы) Тогда
		Если ЗначениеЗаполнено(ПредопределенныйОсновнойСклад.ПодразделениеКомпании.ГрафикРаботы) Тогда
			ПредопределенныйОсновнойСклад.ГрафикРаботы = ПредопределенныйОсновнойСклад.ПодразделениеКомпании.ГрафикРаботы;
		КонецЕсли;
	КонецЕсли;
	
	// Сохранение справочника
	НовыйЭлемент = ПредопределенныйОсновнойСклад.ЭтоНовый();
	Если ПредопределенныйОсновнойСклад.Модифицированность() Тогда
		Попытка
			ПредопределенныйОсновнойСклад.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Склады компании"". ""%1"" элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(ПредопределенныйОсновнойСклад.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Склады компании""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	// Заполним для всех складов реквизит "ВидСклада"
	ВыборкаСклады = Справочники.СкладыКомпании.Выбрать();
	Пока ВыборкаСклады.Следующий() Цикл
		Склад = ВыборкаСклады.ПолучитьОбъект();
		Если Склад.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Склад.ВидСклада) Тогда
			Склад.ВидСклада = Перечисления.ВидыСкладов.Обычный;
			Попытка
				Склад.Записать();
				ВывестиСообщение(НСтр("ru='Справочник ""Склады компании"". Модифицирован элемент ""%1""'"),,,,,СокрЛП(Склад.Наименование));
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Склады компании""'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),УровеньЖурналаРегистрации.Ошибка,,,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

// проверяет, нет ли у склада уже созданных ячеек
//
// Возвращаемое значение:
//    Булево  - Наличие созданных ячеек.
//
Функция ЕстьЗаполненныеЯчейки(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка ИЗ Справочник.ЯчейкиХранения ГДЕ Владелец = &Ссылка И НЕ ЭтоГруппа";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции // ЕстьЗаполненныеЯчейки()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	// Обработаем в зависимости от вида элемента
	Если НЕ Объект.ЭтоГруппа Тогда
		
		ОбязательныеРеквизиты.Добавить("Организация");
		ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
		ОбязательныеРеквизиты.Добавить("ВидСклада");
		
		Если Объект.Розничный Тогда
			ОбязательныеРеквизиты.Добавить("ТипЦенРозничнойТорговли");
			ОбязательныеРеквизиты.Добавить("НомерОтделаДляККМ");
		КонецЕсли;
		Если НЕ Объект.ВидСклада=Перечисления.ВидыСкладов.Обычный И НЕ Объект.ВидСклада=Перечисления.ВидыСкладов.Ячеистый Тогда
			ОбязательныеРеквизиты.Добавить("УчетЕдиницИзмерения");
		КонецЕсли;
		Если Объект.ВидСклада=Перечисления.ВидыСкладов.Ячеистый ИЛИ Объект.ВидСклада=Перечисления.ВидыСкладов.ОрдерныйЯчеистый Тогда
			ОбязательныеРеквизиты.Добавить("ДлинаСклада");
			ОбязательныеРеквизиты.Добавить("ШиринаСклада");
			ОбязательныеРеквизиты.Добавить("ЧислоУровней");
			ОбязательныеРеквизиты.Добавить("ДлинаЯчейкиПоУмолчанию");
			ОбязательныеРеквизиты.Добавить("ШиринаЯчейкиПоУмолчанию");
		КонецЕсли;
		
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Розничный");
	Результат.Добавить("ТипЦенРозничнойТорговли");
	Результат.Добавить("ВидСклада");
	Результат.Добавить("УчетЕдиницИзмерения");
	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Подразделение".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Вызываем общий обработчик события
	ОбработкаСобытийСправочникаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Вызываем общий обработчик события
	ОбработкаСобытийСправочникаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "МОЛ".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура МОЛПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Объект.МОЛ) Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.Организация = Объект.МОЛ.Организация;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ПодразделениеКомпании) Тогда
			Объект.ПодразделениеКомпании = Объект.МОЛ.ПодразделениеКомпании;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // МОЛПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Вид склада".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВидСкладаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.ВидСклада=Перечисления.ВидыСкладов.Обычный ИЛИ Объект.ВидСклада=Перечисления.ВидыСкладов.Ячеистый Тогда
		Объект.УчетЕдиницИзмерения = Перечисления.ВидыУчетаЕдиницИзмерения.ПустаяСсылка();
	Иначе
		Если НЕ ЗначениеЗаполнено(Объект.УчетЕдиницИзмерения) Тогда
			Объект.УчетЕдиницИзмерения = Перечисления.ВидыУчетаЕдиницИзмерения.НеВедется;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ВидСкладаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Розничный".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура РозничныйПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если НЕ Объект.Розничный Тогда
		Объект.ТипЦенРозничнойТорговли = Справочники.ТипыЦен.ПустаяСсылка();
		Объект.НомерОтделаДляККМ       = 0;
	КонецЕсли;
	
КонецПроцедуры // РозничныйПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Тип цен розничной торговли".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТипЦенРозничнойТорговлиПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Объект.ТипЦенРозничнойТорговли) И Объект.ТипЦенРозничнойТорговли.Закупка И НЕ Объект.ТипЦенРозничнойТорговли.Продажа Тогда
		Объект.ТипЦенРозничнойТорговли = Справочники.ТипыЦен.ПустаяСсылка();
		ВывестиСообщение(НСтр("ru='Тип цен розничного склада не может быть закупочным.'"),,"ТипЦенРозничнойТорговли");
	КонецЕсли;
	
КонецПроцедуры // ТипЦенРозничнойТорговлиПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Справочник.СкладыКомпании",
		"ПечатьЯчеекСклада",
		НСтр("ru = 'Печать ячеек склада'"),
		СсылкаНаДокумент);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьЯчеекСклада") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПечатьЯчеекСклада",
															"ПечатьЯчеекСклада",
															ПечатьЯчеекСклада(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Процедура печати ячеек склада.
//
Функция ПечатьЯчеекСклада(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СкладыКомпании_ПечатьЯчеекСклада";
	
	ПервыйДокумент = Истина;
	
	Для Каждого Документ Из МассивОбъектов Цикл
		
		// новый документ должен быть на отдельной странице
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		Если НЕ Документ.ЭтоГруппа Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка КАК Ячейка
			|ИЗ
			|	Справочник.ЯчейкиХранения
			|ГДЕ
			|   НЕ Ссылка.ЭтоГруппа И Ссылка.Владелец = &Склад
			|АВТОУПОРЯДОЧИВАНИЕ";
			Запрос = Новый Запрос;
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Склад", Документ.Ссылка);
			Результат = Запрос.Выполнить();
			Таблица = Результат.Выгрузить();
			Обработки.ПечатьЯчеек.Печать(Документ, ТабличныйДокумент, Таблица);
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьЯчеекСклада()

#КонецЕсли