
// Модуль формы настройки печати обработки "ПерсональныеНастройки"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция ПроверкаЗаполненныхДанных()
	Если НЕ ОтображатьПрава И НЕ ОтображатьНастройки И НЕ ПараметрыУтвержденияДокументов И НЕ УчастникиГруппДоступа И НЕ ПрофилиГруппДоступа Тогда
		Если ВыбранноеЗначение = 0 Тогда
			ВывестиСообщение(НСтр("ru = 'Должен быть включен хотя бы один флажок: ""Формировать права"", ""Формировать настройки"".'"),Объект);
			Возврат Ложь;
		Иначе
			ВывестиСообщение(НСтр("ru = 'Должен быть включен хотя бы один флажок: ""Формировать права"", ""Формировать настройки""
			|, ""Профили групп доступа"", ""Участники групп доступа"", ""Параметры утверждения документов"".'"),Объект);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	Если ВыбранноеЗначение = 0 Тогда
		Если СписокПользователиГруппыДоступа.Количество() = 0 Тогда
			ВывестиСообщение(НСтр("ru = 'Не выбрано ни одного пользователя'"),Объект,"СписокПользователей");
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Если СписокПользователиГруппыДоступа.Количество() = 0 Тогда
			ВывестиСообщение(НСтр("ru = 'Не выбрано ни одной группы доступа'"),Объект,"СписокГруппДоступа");
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Управление видимостью и доступностью элементов формы
//
//
&НаКлиенте
Процедура УправлениеДиалогом()
	Если ВыбранноеЗначение = 0 Тогда
		Элементы.ПараметрыУтвержденияДокументов.Доступность = Ложь;
		Элементы.УчастникиГруппДоступа.Доступность = Ложь;
		Элементы.ПрофилиГруппДоступа.Доступность = Ложь;
		ПараметрыУтвержденияДокументов = Ложь;
		УчастникиГруппДоступа = Ложь;
		ПрофилиГруппДоступа = Ложь;
		РежимПечатиПользователей = Истина;
	Иначе
		Элементы.ПараметрыУтвержденияДокументов.Доступность = Истина;
		Элементы.УчастникиГруппДоступа.Доступность = Истина;
		Элементы.ПрофилиГруппДоступа.Доступность = Истина;
		РежимПечатиПользователей = Ложь;
	КонецЕсли;
	Если НЕ ОтображатьПрава И НЕ ОтображатьНастройки Тогда
		ВыводитьОписаниеПрава = Ложь;
		ПоказыватьЗначениеПоУмолчанию = Ложь;
		Элементы.ВыводитьОписаниеПрава.Доступность = Ложь;
		Элементы.ПоказыватьЗначениеПоУмолчанию.Доступность = Ложь;
	Иначе
		Элементы.ВыводитьОписаниеПрава.Доступность = Истина;
		Элементы.ПоказыватьЗначениеПоУмолчанию.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВыбранноеЗначениеПриИзменении(Элемент)
	Если ВыбранноеЗначение = 0 Тогда
		СписокПользователиГруппыДоступа.Очистить();
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.Пользователи"));
		Типы = Новый ОписаниеТипов(МассивТипов);
		Элементы.СписокПользователиГруппыДоступаПользователиГруппы.ОграничениеТипа = Типы;
	Иначе
		СписокПользователиГруппыДоступа.Очистить();
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.ГруппыДоступа"));
		Типы = Новый ОписаниеТипов(МассивТипов);
		Элементы.СписокПользователиГруппыДоступаПользователиГруппы.ОграничениеТипа = Типы;
	КонецЕсли;
	УправлениеДиалогом();
КонецПроцедуры

&НаКлиенте
Процедура ПодборПользователей(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыПодбора.Вставить("РежимВыбора", Истина);
	
	Если  РежимПечатиПользователей Тогда
		ОткрытьФорму("Справочник.Пользователи.ФормаСписка",ПараметрыПодбора,Элементы.СписокПользователиГруппыДоступа,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("Справочник.ГруппыДоступа.ФормаВыбора",ПараметрыПодбора,Элементы.СписокПользователиГруппыДоступа,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)

	МассивПользователиГруппыДоступа = Новый Массив;
	
	Для Каждого Строка Из СписокПользователиГруппыДоступа Цикл
		Если НЕ ЗначениеЗаполнено(Строка.ПользователиГруппы) Тогда
			МассивПользователиГруппыДоступа.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из МассивПользователиГруппыДоступа Цикл
		СписокПользователиГруппыДоступа.Удалить(СтрокаТЧ);
	КонецЦикла;
	
	Если ПроверкаЗаполненныхДанных() Тогда
		
		// Установим параметры для печати
		МенеджерПечати = "Обработка.ПерсональныеНастройки";
		
		ИменаМакетов = Новый Массив;
		
		// Если необходимо напечатать персональные права и настройки добавим макет
		Если ОтображатьПрава Или ОтображатьНастройки Тогда 
			ИменаМакетов.Добавить("Макет");
		КонецЕсли;
		
		// Если необходимо напечатать перечень документов добавим макет.
		Если ПараметрыУтвержденияДокументов Тогда
			ИменаМакетов.Добавить("МакетСписокДокументов");
		КонецЕсли;
		
		// Если необходимо напечатать ограничения по профилям добавим макет.
		Если ПрофилиГруппДоступа Тогда
			ИменаМакетов.Добавить("МакетПрофилиДоступа");
		КонецЕсли;
		
		// Если необходимо напечатать список пользователей добавим макет.
		Если УчастникиГруппДоступа Тогда
			ИменаМакетов.Добавить("МакетУчастники");
		КонецЕсли;
		
		ПараметрКоманды = Новый Массив;
		Настройки = Новый Структура;
		
		ПараметрКоманды.Добавить(СписокПользователиГруппыДоступа[0].ПользователиГруппы);
		Настройки.Вставить("ДанныеДляПечати", СписокПользователиГруппыДоступа);
		
		Настройки.Вставить("РежимПечатиПользователей",РежимПечатиПользователей);
		Настройки.Вставить("ОтображатьНастройки", ОтображатьНастройки);
		Настройки.Вставить("ОтображатьПрава", ОтображатьПрава);
		Настройки.Вставить("ПоказыватьЗначениеПоУмолчанию", ПоказыватьЗначениеПоУмолчанию);
		Настройки.Вставить("ВыводитьОписаниеПрава", ВыводитьОписаниеПрава);
		Настройки.Вставить("ВременнаяТаблицаВсеВидыДоступа", ВременнаяТаблицаВидовДоступа);
		Если ОтображатьНастройки И ОтображатьПрава Тогда
			ТекстЗаголовка = НСтр("ru = 'Печать прав и настроек'");
		ИначеЕсли ОтображатьНастройки И НЕ ОтображатьПрава Тогда 
			ТекстЗаголовка = НСтр("ru = 'Печать настроек'");
		Иначе
			ТекстЗаголовка = НСтр("ru = 'Печать прав'");
		КонецЕсли;
		Настройки.Вставить("Заголовок", ТекстЗаголовка);
		Настройки.Вставить("ВычислятьСумму", Ложь);
		
		ПараметрыПечати = Новый Структура("СтруктураНастроек", Настройки);
		
		// Выведем на печатную форму
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(МенеджерПечати, ИменаМакетов, ПараметрКоманды, Неопределено, ПараметрыПечати);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПраваПриИзменении(Элемент)
	УправлениеДиалогом();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьНастройкиПриИзменении(Элемент)
	УправлениеДиалогом();
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ПОЛЬЗОВАТЕЛИГРУППЫДОСТУПА"

&НаКлиенте
Процедура СписокПользователиГруппыДоступаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		Для Каждого Элемент Из ВыбранноеЗначение Цикл
			СтруктураПоиска = Новый Структура("ПользователиГруппы",Элемент);
			Если СписокПользователиГруппыДоступа.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда 
				Строка = СписокПользователиГруппыДоступа.Добавить();
				Строка.ПользователиГруппы = Элемент;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователиГруппыДоступаПриИзменении(Элемент)
	Если СписокПользователиГруппыДоступа.Количество() > 0 Тогда
		Строка = Элементы.СписокПользователиГруппыДоступа.ТекущиеДанные;
		Поиск = Новый Структура("ПользователиГруппы", Строка.ПользователиГруппы);
		Если СписокПользователиГруппыДоступа.НайтиСтроки(Поиск).Количество() > 1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "" + Строка.ПользователиГруппы + "" + " " + НСтр("ru = 'уже есть в списке выбора'");
			Сообщение.Сообщить();
			СписокПользователиГруппыДоступа.Удалить(Строка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МассивТипов = Новый Массив;
	Если Параметры.Свойство("Пользователь") Тогда
		МассивТипов.Очистить();
		МассивТипов.Добавить(Тип("СправочникСсылка.Пользователи"));
		ПереданныйПараметр = Параметры.Пользователь;
		РежимПечатиПользователей = Истина;
		ВыбранноеЗначение = 0;
	КонецЕсли;
	Если Параметры.Свойство("ГруппаДоступа") Тогда
		МассивТипов.Очистить();
		МассивТипов.Добавить(Тип("СправочникСсылка.ГруппыДоступа"));
		ПереданныйПараметр = Параметры.ГруппаДоступа;
		РежимПечатиПользователей = Ложь;
		ВыбранноеЗначение = 1;
	КонецЕсли;
	
	Типы = Новый ОписаниеТипов(МассивТипов);
	Элементы.СписокПользователиГруппыДоступаПользователиГруппы.ОграничениеТипа = Типы;
	Строка = СписокПользователиГруппыДоступа.Добавить();
	Строка.ПользователиГруппы = ПереданныйПараметр;
	ОтображатьПрава = Истина;
	ОтображатьНастройки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект,"СписокПользователиГруппыДоступа");
	ИдФормыВладельца = ВладелецФормы.УникальныйИдентификатор;
	
	УправлениеДиалогом();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ


