// Модуль объекта документа "Корректировка поступления"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Поступление товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПоступлениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		Товары.Очистить();
		Контрагент = ДанныеЗаполнения.Контрагент;
		ДоговорВзаиморасчетов = ДанныеЗаполнения.ДоговорВзаиморасчетов;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПоступлениеТоваровТовары.Номенклатура,
			|	ПоступлениеТоваровТовары.Количество КАК Количество,
			|	ПоступлениеТоваровТовары.ЕдиницаИзмерения,
			|	ПоступлениеТоваровТовары.Коэффициент,
			|	ПоступлениеТоваровТовары.Цена,
			|	ПоступлениеТоваровТовары.Сумма КАК Сумма,
			|	ПоступлениеТоваровТовары.СуммаВсего КАК СуммаВсего,
			|	ПоступлениеТоваровТовары.СтавкаНДС,
			|	ПоступлениеТоваровТовары.СуммаНДС КАК СуммаНДС,
			|	ПоступлениеТоваровТовары.ЦенаРозничная,
			|	ПоступлениеТоваровТовары.СуммаРозничная КАК СуммаРозничная,
			|	ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры,
			|	ПоступлениеТоваровТовары.ГТД
			|ИЗ
			|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
			|ГДЕ
			|	ПоступлениеТоваровТовары.Ссылка = &Основание И ПоступлениеТоваровТовары.Количество > 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПоступлениеТоваровТовары.НомерСтроки";
			Запрос.УстановитьПараметр("Основание", ДанныеЗаполнения);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрокаТоваров                                        = Товары.Добавить();
				НоваяСтрокаТоваров.ПоДокументуПоступления                 = Истина;
				НоваяСтрокаТоваров.Подтверждение                          = Истина;
				НоваяСтрокаТоваров.Номенклатура                           = Выборка.Номенклатура;
				НоваяСтрокаТоваров.ХарактеристикаНоменклатуры             = Выборка.ХарактеристикаНоменклатуры;
				НоваяСтрокаТоваров.ЕдиницаИзмерения                       = Выборка.ЕдиницаИзмерения;
				НоваяСтрокаТоваров.ЕдиницаИзмеренияПоДокументуПоступления = Выборка.ЕдиницаИзмерения;
				НоваяСтрокаТоваров.Коэффициент                            = Выборка.Коэффициент;
				НоваяСтрокаТоваров.КоэффициентПоДокументуПоступления      = Выборка.Коэффициент;
				НоваяСтрокаТоваров.Количество                             = Выборка.Количество;
				НоваяСтрокаТоваров.КоличествоПоДокументуПоступления       = Выборка.Количество;
				НоваяСтрокаТоваров.Цена                                   = Выборка.Цена;
				НоваяСтрокаТоваров.ЦенаРозничная                          = Выборка.ЦенаРозничная;
				НоваяСтрокаТоваров.Сумма                                  = Выборка.Сумма;
				НоваяСтрокаТоваров.СуммаРозничная                         = Выборка.СуммаРозничная;
				НоваяСтрокаТоваров.СуммаРозничнаяПоДокументуПоступления    = Выборка.СуммаРозничная;
				НоваяСтрокаТоваров.СуммаВсего                             = Выборка.СуммаВсего;
				НоваяСтрокаТоваров.СуммаВсегоПоДокументуПоступления        = Выборка.СуммаВсего;
				НоваяСтрокаТоваров.СтавкаНДС                              = Выборка.СтавкаНДС;
				НоваяСтрокаТоваров.СуммаНДС                               = Выборка.СуммаНДС;
				НоваяСтрокаТоваров.СтавкаНДСПоДокументуПоступления        = Выборка.СтавкаНДС;
				НоваяСтрокаТоваров.СуммаНДСПоДокументуПоступления         = Выборка.СуммаНДС;
				НоваяСтрокаТоваров.ГТД                                    = Выборка.ГТД;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПриходныйСкладскойОрдер()

// Производит заполнение объекта на основании документа "Корректировка поступления".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_КорректировкаПоступления(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
			ОснованиеКорректировка = (ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияКорректировкаПоСогласованиюСторон);
			
			// Заполним табличную часть товары приватно
			Товары.Очистить();
			ТоварыОснования = ДанныеЗаполнения.Товары.Выгрузить();
			Для Каждого стрТоваров Из ТоварыОснования Цикл
				
				Если (НЕ стрТоваров.Подтверждение) ИЛИ (стрТоваров.Количество = 0) Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрокаТоваров = Товары.Добавить();
				НоваяСтрокаТоваров.ПоДокументуПоступления                 = Истина;
				НоваяСтрокаТоваров.Подтверждение                         = Истина;
				
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТоваров,стрТоваров,,"ПоДокументуПоступления,Подтверждение,КоличествоРазница,СуммаНДСРазница,СуммаРозничнаяРазница,СуммаВсегоРазница");
				НоваяСтрокаТоваров.КоличествоПоДокументуПоступления    = НоваяСтрокаТоваров.Количество;
				НоваяСтрокаТоваров.СуммаНДСПоДокументуПоступления      = НоваяСтрокаТоваров.СуммаНДС;
				НоваяСтрокаТоваров.СтавкаНДСПоДокументуПоступления     = НоваяСтрокаТоваров.СтавкаНДС;
				НоваяСтрокаТоваров.СуммаВсегоПоДокументуПоступления     = НоваяСтрокаТоваров.СуммаВсего;
				НоваяСтрокаТоваров.СуммаРозничнаяПоДокументуПоступления = НоваяСтрокаТоваров.СуммаРозничная;
				Если ОснованиеКорректировка Тогда
					НоваяСтрокаТоваров.КоличествоДоКорректировки     = НоваяСтрокаТоваров.КоличествоПоДокументуПоступления;
					НоваяСтрокаТоваров.СуммаНДСДоКорректировки       = НоваяСтрокаТоваров.СтавкаНДСПоДокументуПоступления;
					НоваяСтрокаТоваров.СуммаВсегоДоКорректировки     = НоваяСтрокаТоваров.СуммаВсегоПоДокументуПоступления;
					НоваяСтрокаТоваров.СуммаРозничнаяДоКорректировки = НоваяСтрокаТоваров.СуммаРозничнаяПоДокументуПоступления;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПриходныйСкладскойОрдер()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

// возвращает выборку по шапке
//
// Параметры:
//  ДокументСсылка - Ссылка на документ для которого получаем шапку.
//
// Возвращаемое значение:
//  Выборка - выборка по шапке
//
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	
	Запрос=Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ТипЦен КАК ТипЦен,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	/////////// ПРИВАТ ////////////
	|	Док.Контрагент КАК Контрагент,
	|	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	Док.СкладКомпании КАК СкладКомпании,
	|	&СуммаРазногласий КАК СуммаДокумента,
	|	Док.ДокументОснование КАК ДокументОснование,
	|	Док.Сделка КАК Сделка
	|
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Запрос.УстановитьПараметр("СуммаРазногласий",Товары.Итог("СуммаВсегоРазница"));
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции // ПолучитьШапкуДокумента()

// возвращает таблицу списания номенклатуры
Функция ПолучитьТаблицуНоменклатуры()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КорректировкаПоступленияТовары.Номенклатура,
	|	КорректировкаПоступленияТовары.ХарактеристикаНоменклатуры,
	|	СУММА(КорректировкаПоступленияТовары.КоличествоПоДокументуПоступления * КорректировкаПоступленияТовары.КоэффициентПоДокументуПоступления) КАК КоличествоПоДокументуПоступления,
	|	СУММА(КорректировкаПоступленияТовары.Количество * КорректировкаПоступленияТовары.Коэффициент) КАК Количество,
	|	СУММА(КорректировкаПоступленияТовары.КоличествоРазница * КорректировкаПоступленияТовары.Коэффициент) КАК КоличествоРазница,
	|	КорректировкаПоступленияТовары.СтавкаНДС,
	|	СУММА(КорректировкаПоступленияТовары.СуммаНДСПоДокументуПоступления) КАК СуммаНДСПоДокументуПоступления,
	|	СУММА(КорректировкаПоступленияТовары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(КорректировкаПоступленияТовары.СуммаВсего) КАК СуммаВсего,
	|	СУММА(КорректировкаПоступленияТовары.СуммаВсегоПоДокументуПоступления) КАК СуммаВсегоПоДокументуПоступления,
	|	СУММА(КорректировкаПоступленияТовары.СуммаРозничнаяПоДокументуПоступления) КАК СуммаРозничнаяПоДокументуПоступления,
	|	СУММА(КорректировкаПоступленияТовары.СуммаРозничная) КАК СуммаРозничная,
	|	КорректировкаПоступленияТовары.ЦенаРозничная,
	|	СУММА(КорректировкаПоступленияТовары.СуммаВсегоРазница) КАК СуммаВсегоРазница,
	|	СУММА(КорректировкаПоступленияТовары.СуммаРозничнаяРазница) КАК СуммаРозничнаяРазница,
	|	СУММА(КорректировкаПоступленияТовары.СуммаНДСРазница) КАК СуммаНДСРазница
	|ИЗ
	|	Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	|ГДЕ
	|	(КорректировкаПоступленияТовары.КоличествоРазница <> 0
	|			ИЛИ КорректировкаПоступленияТовары.СуммаРозничнаяРазница <> 0
	|			ИЛИ КорректировкаПоступленияТовары.СуммаВсегоРазница <> 0
	|			ИЛИ КорректировкаПоступленияТовары.СуммаНДСРазница <> 0)
	|	И КорректировкаПоступленияТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаПоступленияТовары.ХарактеристикаНоменклатуры,
	|	КорректировкаПоступленияТовары.Номенклатура,
	|	КорректировкаПоступленияТовары.СтавкаНДС,
	|	КорректировкаПоступленияТовары.ЦенаРозничная";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТаблицуНоменклатуры()

Функция ПолучитьПартииТоваров()
	
	СтрПартий = Новый Структура;
	
	// получим партию средних остатков
	СтрПартий.Вставить("ПартияОтрицательныхОстатков",Константы.ПартияТоваровОтрицательныхОстатков.Получить());
	
	// получим стратегию списания товаров
	СтратегияСписанияПартийТоваровПоДатам = ПолучитьСтратегиюСписанияПоДатам(СкладКомпании, Организация, Дата);
	
	Если СтратегияСписанияПартийТоваровПоДатам = Перечисления.СтратегияСписанияПартийТоваровПоДатам.Средняя Тогда
		СтрПартий.Вставить("ПартияДок", СтрПартий.ПартияОтрицательныхОстатков);
	ИначеЕсли ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияКорректировкаБезОснования Тогда
		СтрПартий.Вставить("ПартияДок", СтрПартий.ПартияОтрицательныхОстатков);
	Иначе
		ДокОснование = ДокументОснование;
		Пока ТипЗнч(ДокОснование) = Тип("ДокументСсылка.КорректировкаПоступления") Цикл
			ДокОснование = ДокОснование.ДокументОснование;
		КонецЦикла;
		
		СтрПартий.Вставить("ПартияДок",ДокОснование);
	КонецЕсли;
	
	Возврат СтрПартий;
	
КонецФункции // ПолучитьПартииТоваров()

Функция ВыполнитьДвиженияПоОстаткам(ТаблицаНоменклатуры, Отказ, Ошибки)
	
	// проверим разрешены ли отр. остатки
	ОтрицательныеОстаткиРазрешены = (ПравоПользователя("РазрешитьОтрицательныеСкладскиеОстатки",ЭтотОбъект)<>Перечисления.ВидыРазрешенныхОтрицательныхОстатков.Запрещены);
	// запишем движения
	Для Каждого стрНоменклатуры Из ТаблицаНоменклатуры Цикл
		Если стрНоменклатуры.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга ИЛИ стрНоменклатуры.КоличествоРазница = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись               = Движения.ОстаткиТоваровКомпании.Добавить();
		НоваяЗапись.Период        = Дата;
		НоваяЗапись.Регистратор   = Ссылка;
		НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Приход;
		НоваяЗапись.Номенклатура  = стрНоменклатуры.Номенклатура;
		НоваяЗапись.ХарактеристикаНоменклатуры = стрНоменклатуры.ХарактеристикаНоменклатуры;
		НоваяЗапись.СкладКомпании = СкладКомпании;
		НоваяЗапись.Количество    = стрНоменклатуры.КоличествоРазница;
		НоваяЗапись.СуммаРозн     = стрНоменклатуры.СуммаРозничнаяРазница;
		НоваяЗапись.ХозОперация   = ХозОперация;
		НоваяЗапись.Контрагент    = Контрагент;
		
	КонецЦикла;
	//Движения.ОстаткиТоваровКомпании.ЗаполнятьГруппыОборудования = Истина;
	Движения.ОстаткиТоваровКомпании.Записать();
	
	// получим остатки по складу
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура,
	|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры,
	|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток,
	|	ОстаткиТоваровКомпанииОстатки.РезервОстаток,
	|	ОстаткиТоваровКомпанииОстатки.СуммаРознОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			&Момент,
	|			СкладКомпании = &СкладКомпании
	|				И Номенклатура В (&СписокНоменклатуры)) КАК ОстаткиТоваровКомпанииОстатки";
	
	Запрос.УстановитьПараметр("Момент", Новый Граница(МоментВремени(),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	Запрос.УстановитьПараметр("СписокНоменклатуры", ТаблицаНоменклатуры.ВыгрузитьКолонку("Номенклатура"));
	
	ВыборкаОстатков = Запрос.Выполнить().Выбрать(); Ошибки = "";
	
	Пока ВыборкаОстатков.Следующий() Цикл
		
		// проверим остаток
		Если ВыборкаОстатков.КоличествоОстаток < ВыборкаОстатков.РезервОстаток И ВыборкаОстатков.РезервОстаток > 0 Тогда
			ВывестиСообщение(НСтр("ru = 'Нельзя откорректировать зарезервированный товар ""%1"" - превышение ""%2"".'"),ЭтотОбъект,,,Отказ,ВыборкаОстатков.Номенклатура,Строка(ВыборкаОстатков.РезервОстаток-ВыборкаОстатков.КоличествоОстаток));
		КонецЕсли;
		
		Если НЕ ОтрицательныеОстаткиРазрешены И ВыборкаОстатков.КоличествоОстаток < 0 Тогда
			ВывестиСообщение(НСтр("ru = 'Не хватает товара ""%1"" для корректировки в количестве ""%2"".'"),ЭтотОбъект,,,Отказ,ВыборкаОстатков.Номенклатура,Строка(-ВыборкаОстатков.КоличествоОстаток));
		КонецЕсли;
		
		Если СкладКомпании.Розничный И ПодразделениеКомпании.ПереоценкаРозницаПоПриходу Тогда
			// выполним переоценку
			// получим цену из ТЧ
			стрПоиска = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",ВыборкаОстатков.Номенклатура,ВыборкаОстатков.ХарактеристикаНоменклатуры);
			МассивСтрок = ТаблицаНоменклатуры.НайтиСтроки(стрПоиска);
			Если МассивСтрок.Количество() > 0 Тогда
				ЦенаПоДок = МассивСтрок[0].ЦенаРозничная;
			Иначе
				ЦенаПоДок = 0;
			КонецЕсли;
			
			Если (ЦенаПоДок <> 0) И (ЦенаПоДок*ВыборкаОстатков.КоличествоОстаток) <> ВыборкаОстатков.СуммаРознОстаток Тогда
				НоваяЗапись               = Движения.ОстаткиТоваровКомпании.Добавить();
				НоваяЗапись.Период        = Дата;
				НоваяЗапись.Регистратор   = Ссылка;
				НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Приход;
				НоваяЗапись.Номенклатура  = ВыборкаОстатков.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаОстатков.ХарактеристикаНоменклатуры;
				НоваяЗапись.СкладКомпании = СкладКомпании;
				НоваяЗапись.Количество    = 0;
				НоваяЗапись.СуммаРозн     = (ЦенаПоДок*ВыборкаОстатков.КоличествоОстаток)-ВыборкаОстатков.СуммаРознОстаток;
				НоваяЗапись.ХозОперация   = ХозОперация;
				НоваяЗапись.Контрагент    = Контрагент;
				НоваяЗапись.Цена          = ЦенаПоДок;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции // ВыполнитьДвиженияПоОстаткам()

Функция ВыполнитьДвиженияПоПартиям(ТаблицаНоменклатуры, Отказ,Ошибки)
	
	ШапкаДокумента = ПолучитьШапкуДокумента(Ссылка);
	
	// получим партии
	ОтрицательныеОстаткиРазрешены = (ПравоПользователя("РазрешитьОтрицательныеСкладскиеОстатки",ЭтотОбъект)<>Перечисления.ВидыРазрешенныхОтрицательныхОстатков.Запрещены);
	
	//Мальцев А.Ю. +++
	Если итЗаявкаНаВозврат Тогда
		ОтрицательныеОстаткиРазрешены = Истина;
	КонецЕсли;
	//Мальцев А.Ю. ---
	
	СтрПартий = ПолучитьПартииТоваров();
	
	// получим остатки по партии
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииТоваровКомпанииОстатки.Номенклатура,
	|	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпанииОстатки.КоличествоОстаток,
	|	ПартииТоваровКомпанииОстатки.СтатусПартии,
	|	ПартииТоваровКомпанииОстатки.СуммаОстаток,
	|	ПартииТоваровКомпанииОстатки.СуммаУпрОстаток,
	|	ПартииТоваровКомпанииОстатки.СуммаНДСОстаток,
	|	ПартииТоваровКомпанииОстатки.СуммаНДСУпрОстаток
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	|			&Период,
	|			СкладКомпании = &СкладКомпании
	|				И Партия = &Партия
	|				И Номенклатура В (&СписокНоменклатуры)) КАК ПартииТоваровКомпанииОстатки";
	
	Запрос.УстановитьПараметр("СкладКомпании"      , СкладКомпании);
	Запрос.УстановитьПараметр("Партия"             , СтрПартий.ПартияДок);
	Запрос.УстановитьПараметр("СписокНоменклатуры" , ТаблицаНоменклатуры.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Период", МоментВремени());
	
	ТаблицаПартий = Запрос.Выполнить().Выгрузить();
	
	Для Каждого стрНоменклатура Из ТаблицаНоменклатуры Цикл
		Если стрНоменклатура.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		
		Если стрНоменклатура.КоличествоРазница = 0 И стрНоменклатура.СуммаРозничнаяРазница = 0 И стрНоменклатура.СуммаВсегоРазница = 0 И стрНоменклатура.СуммаНДСРазница = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// получим сумму в упр. и регл. валюте
		СуммаУпрНом     = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(стрНоменклатура.СуммаВсегоРазница,ВалютаДокумента,Дата,Константы.ВалютаУправленческогоУчетаКомпании.Получить(),Дата, РежимОкругления.Окр15как20);
		СуммаРеглНом    = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(стрНоменклатура.СуммаВсегоРазница,ВалютаДокумента,Дата,Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(),Дата, РежимОкругления.Окр15как20);
		СуммаУпрНомНДС  = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(стрНоменклатура.СуммаНДСРазница,ВалютаДокумента,Дата,Константы.ВалютаУправленческогоУчетаКомпании.Получить(),Дата, РежимОкругления.Окр15как20);
		СуммаРеглНомНДС = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(стрНоменклатура.СуммаНДСРазница,ВалютаДокумента,Дата,Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(),Дата, РежимОкругления.Окр15как20);
		
		
		// получим строку остатков
		СтруктураПоиска = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",стрНоменклатура.Номенклатура,стрНоменклатура.ХарактеристикаНоменклатуры);
		
		МассивСтрок = ТаблицаПартий.НайтиСтроки(СтруктураПоиска);
		
		Если МассивСтрок.Количество() = 0 Тогда
			
			// от партии ничего не осталось
			//Если стрНоменклатура.КоличествоРазница = 0 Тогда
			//	ВывестиСообщение(НСтр("ru = 'Не удалось откорректировать сумму по товару ""%1"" - партия была расформирована.'"),ЭтотОбъект,,,Отказ,стрНоменклатура.Номенклатура);
			//	Продолжить;
			//ИначеЕсли НЕ ОтрицательныеОстаткиРазрешены И стрНоменклатура.КоличествоРазница < 0 Тогда
			//	ВывестиСообщение(НСтр("ru = 'Нехватка товара ""%1"" по партии в количестве ""%2"".'"),ЭтотОбъект,,,Отказ,стрНоменклатура.Номенклатура,Строка(-стрНоменклатура.КоличествоРазница));
			//	Продолжить;
			//КонецЕсли;
			Если НЕ ОтрицательныеОстаткиРазрешены И стрНоменклатура.КоличествоРазница < 0 Тогда
				ВывестиСообщение(НСтр("ru = 'Нехватка товара ""%1"" по партии в количестве ""%2"".'"),ЭтотОбъект,,,Отказ,стрНоменклатура.Номенклатура,Строка(-стрНоменклатура.КоличествоРазница));
				Продолжить;
			КонецЕсли;
			
			НоваяЗапись = Движения.ПартииТоваровКомпании.Добавить();
			НоваяЗапись.Период = Дата;
			НоваяЗапись.Регистратор   = Ссылка;
			НоваяЗапись.Номенклатура  = стрНоменклатура.Номенклатура;
			НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
			НоваяЗапись.СкладКомпании = СкладКомпании;
			НоваяЗапись.ХарактеристикаНоменклатуры = стрНоменклатура.ХарактеристикаНоменклатуры;
			НоваяЗапись.Партия = ?(стрНоменклатура.КоличествоРазница > 0, СтрПартий.ПартияДок, СтрПартий.ПартияОтрицательныхОстатков);
			Если СтрПартий.ПартияДок.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваровКомиссия Тогда
				НоваяЗапись.СтатусПартии = Перечисления.СтатусыПартий.ТоварПринятыйКомиссия;
			Иначе
				НоваяЗапись.СтатусПартии = Перечисления.СтатусыПартий.ТоварКупленный;
			КонецЕсли;
			НоваяЗапись.Количество = стрНоменклатура.КоличествоРазница;
			НоваяЗапись.Сумма = СуммаРеглНом;
			НоваяЗапись.СуммаУпр = СуммаУпрНом;
			НоваяЗапись.СуммаНДС = СуммаРеглНомНДС;
			НоваяЗапись.СуммаНДСУпр = СуммаУпрНомНДС;
			НоваяЗапись.ХозОперация = ХозОперация;
			НоваяЗапись.СтавкаНДС = стрНоменклатура.СтавкаНДС;
			НоваяЗапись.Проект = Проект;
			НоваяЗапись.СуммаБезНДС    = НоваяЗапись.Сумма - НоваяЗапись.СуммаНДС;
			НоваяЗапись.СуммаБезНДСУпр = НоваяЗапись.СуммаУпр - НоваяЗапись.СуммаНДСУпр;
		Иначе
			// списываем или оприходуем кол-во
			стрПартии = МассивСтрок[0];
			
			//Если (стрПартии.КоличествоОстаток + стрНоменклатура.КоличествоРазница) = 0 Тогда
			//	Если (стрПартии.СуммаУпрОстаток+СуммаУпрНом) <> 0 ИЛИ (стрПартии.СуммаОстаток+СуммаРеглНом) <> 0 Тогда
			//		ВывестиСообщение(НСтр("ru = 'Не удалось откорректировать сумму по товару ""%1"" - партия была расформирована.'"),ЭтотОбъект,,,Отказ,стрНоменклатура.Номенклатура);
			//		Продолжить;
			//	КонецЕсли;
			//ИначеЕсли НЕ ОтрицательныеОстаткиРазрешены И (стрПартии.КоличествоОстаток + стрНоменклатура.КоличествоРазница) < 0 И стрНоменклатура.КоличествоРазница < 0 Тогда
			//	ВывестиСообщение(НСтр("ru = 'Нехватка товара ""%1"" по партии в количестве ""%2"".'"),ЭтотОбъект,,,Отказ,стрНоменклатура.Номенклатура,Строка(-стрНоменклатура.КоличествоРазница));
			//	Продолжить;
			//КонецЕсли;
			Если НЕ ОтрицательныеОстаткиРазрешены И (стрПартии.КоличествоОстаток + стрНоменклатура.КоличествоРазница) < 0 И стрНоменклатура.КоличествоРазница < 0 Тогда
				ВывестиСообщение(НСтр("ru = 'Нехватка товара ""%1"" по партии в количестве ""%2"".'"),ЭтотОбъект,,,Отказ,стрНоменклатура.Номенклатура,Строка(-стрНоменклатура.КоличествоРазница));
				Продолжить;
			КонецЕсли;
			
			// оприходуем партию
			КолвоОприх = стрНоменклатура.КоличествоРазница;
			Если КолвоОприх > 0 Тогда
				НоваяЗапись = Движения.ПартииТоваровКомпании.Добавить();
				НоваяЗапись.Период = Дата;
				НоваяЗапись.Регистратор   = Ссылка;
				НоваяЗапись.Номенклатура  = стрНоменклатура.Номенклатура;
				НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
				НоваяЗапись.СкладКомпании = СкладКомпании;
				НоваяЗапись.ХарактеристикаНоменклатуры = стрНоменклатура.ХарактеристикаНоменклатуры;
				Если СтрПартий.ПартияДок.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваровКомиссия Тогда
					НоваяЗапись.СтатусПартии = Перечисления.СтатусыПартий.ТоварПринятыйКомиссия;
				Иначе
					НоваяЗапись.СтатусПартии = Перечисления.СтатусыПартий.ТоварКупленный;
				КонецЕсли;
				НоваяЗапись.Партия = СтрПартий.ПартияДок;
				НоваяЗапись.Количество = стрНоменклатура.КоличествоРазница;
				НоваяЗапись.Сумма = СуммаРеглНом;
				НоваяЗапись.СуммаУпр = СуммаУпрНом;
				НоваяЗапись.СуммаНДС = СуммаРеглНомНДС;
				НоваяЗапись.СуммаНДСУпр = СуммаУпрНомНДС;
				НоваяЗапись.ХозОперация = ХозОперация;
				НоваяЗапись.СтавкаНДС = стрНоменклатура.СтавкаНДС;
				НоваяЗапись.Проект = Проект;
				НоваяЗапись.СуммаБезНДС    = НоваяЗапись.Сумма - НоваяЗапись.СуммаНДС;
				НоваяЗапись.СуммаБезНДСУпр = НоваяЗапись.СуммаУпр - НоваяЗапись.СуммаНДСУпр;
			Иначе
				КолвоСпис = Мин(-КолвоОприх,стрПартии.КоличествоОстаток);
				
				Если (не ОтрицательныеОстаткиРазрешены) и КолвоСпис <> -КолвоОприх И КолвоОприх*КолвоСпис = 0  Тогда
					ВывестиСообщение(НСтр("ru = 'Нехватка товара ""%1"" по партии.'"),ЭтотОбъект,,,Отказ,стрНоменклатура.Номенклатура);
					Продолжить;
				КонецЕсли;

				Если КолвоСпис = -КолвоОприх или КолвоОприх*КолвоСпис = 0 Тогда
					СуммаСписУпр  = СуммаУпрНом;				
					СуммаСписРегл = СуммаРеглНом;
					СуммаСписРеглНДС = СуммаРеглНомНДС;
					СуммаСписУпрНДС = СуммаУпрНомНДС;
				Иначе
					СуммаСписУпр     = стрПартии.СуммаУпрОстаток/КолвоОприх*КолвоСпис;
					СуммаСписРегл    = стрПартии.СуммаОстаток/КолвоОприх*КолвоСпис;
					СуммаСписРеглНДС = стрПартии.СуммаНДСОстаток/КолвоОприх*КолвоСпис;
					СуммаСписУпрНДС  = стрПартии.СуммаНДСУпрОстаток/КолвоОприх*КолвоСпис;
				КонецЕсли;
				
				НоваяЗапись = Движения.ПартииТоваровКомпании.Добавить();
				НоваяЗапись.Период = Дата;
				НоваяЗапись.Регистратор   = Ссылка;
				НоваяЗапись.Номенклатура  = стрНоменклатура.Номенклатура;
				НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
				НоваяЗапись.СкладКомпании = СкладКомпании;
				НоваяЗапись.ХарактеристикаНоменклатуры = стрНоменклатура.ХарактеристикаНоменклатуры;
				НоваяЗапись.СтатусПартии = стрПартии.СтатусПартии;
				НоваяЗапись.Партия = СтрПартий.ПартияДок;
				НоваяЗапись.Количество = -КолвоСпис;
				НоваяЗапись.Сумма = СуммаСписРегл;
				НоваяЗапись.СуммаУпр = СуммаСписУпр;
				НоваяЗапись.СуммаНДС = СуммаСписРеглНДС;
				НоваяЗапись.СуммаНДСУпр = СуммаСписУпрНДС;
				НоваяЗапись.ХозОперация = ХозОперация;
				НоваяЗапись.СтавкаНДС = стрНоменклатура.СтавкаНДС;
				НоваяЗапись.Проект = Проект;
				НоваяЗапись.СуммаБезНДС    = НоваяЗапись.Сумма - НоваяЗапись.СуммаНДС;
				НоваяЗапись.СуммаБезНДСУпр = НоваяЗапись.СуммаУпр - НоваяЗапись.СуммаНДСУпр;
				
				Если -КолвоОприх <> КолвоСпис Тогда
					НоваяЗапись = Движения.ПартииТоваровКомпании.Добавить();
					НоваяЗапись.Период = Дата;
					НоваяЗапись.Регистратор   = Ссылка;
					НоваяЗапись.Номенклатура  = стрНоменклатура.Номенклатура;
					НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
					НоваяЗапись.СкладКомпании = СкладКомпании;
					НоваяЗапись.ХарактеристикаНоменклатуры = стрНоменклатура.ХарактеристикаНоменклатуры;
					НоваяЗапись.СтатусПартии = Перечисления.СтатусыПартий.ТоварКупленный;
					НоваяЗапись.Партия = СтрПартий.ПартияОтрицательныхОстатков;
					НоваяЗапись.Количество = КолвоОприх + КолвоСпис;
					НоваяЗапись.Сумма = СуммаСписРегл + СуммаРеглНом;
					НоваяЗапись.СуммаУпр = СуммаУпрНом + СуммаСписУпр;
					НоваяЗапись.СуммаНДС = СуммаРеглНомНДС + СуммаСписРеглНДС;
					НоваяЗапись.СуммаНДСУпр = СуммаУпрНомНДС + СуммаСписУпрНДС;
					НоваяЗапись.ХозОперация = ХозОперация;
					НоваяЗапись.СтавкаНДС = стрНоменклатура.СтавкаНДС;
					НоваяЗапись.Проект = Проект;
					НоваяЗапись.СуммаБезНДС    = НоваяЗапись.Сумма - НоваяЗапись.СуммаНДС;
					НоваяЗапись.СуммаБезНДСУпр = НоваяЗапись.СуммаУпр - НоваяЗапись.СуммаНДСУпр;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ПартииТоваровКомпании.Записать();
	
	Если НЕ Отказ Тогда
		ВыполнитьДвиженияПоГТД(Отказ, Ошибки);
	КонецЕсли;
	
КонецФункции // ВыполнитьДвиженияПоПартиям()

Функция ВыполнитьДвиженияПоУслугам(ТаблицаНоменклатуры, Отказ, Ошибки)
	
	ШапкаДокумента = ПолучитьШапкуДокумента(Ссылка);
	
	СуммаПоКоличествуБаз     = 0; СуммаПоКоличествуНДСБаз     = 0;
	СуммаПоСуммеБаз          = 0; СуммаПоСуммеНДСБаз          = 0;
	СуммаНаДоходыИРасходыБаз = 0; СуммаНаДоходыИРасходыНДСБаз = 0;
	МассивНаДоходыИРасходы = Новый Массив;
	СтрПартий = ПолучитьПартииТоваров();
	// получим набор услуг для распределения суммы на товары
	Для Каждого стрНом Из ТаблицаНоменклатуры Цикл
		Если стрНом.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;
		
		Если стрНом.Номенклатура.СпособРаспределенияДопРасходов = Перечисления.СпособыРаспределенияДопРасходов.ПоКоличеству Тогда
			СуммаПоКоличествуБаз = СуммаПоКоличествуБаз + стрНом.СуммаВсегоРазница;
			СуммаПоКоличествуНДСБаз = СуммаПоКоличествуНДСБаз + стрНом.СуммаНДСРазница;
		ИначеЕсли стрНом.Номенклатура.СпособРаспределенияДопРасходов = Перечисления.СпособыРаспределенияДопРасходов.НаДоходыИРасходы Тогда
			СуммаНаДоходыИРасходыБаз = СуммаНаДоходыИРасходыБаз + стрНом.СуммаВсегоРазница;
			СуммаНаДоходыИРасходыНДСБаз = СуммаНаДоходыИРасходыНДСБаз + стрНом.СуммаНДСРазница;
			МассивНаДоходыИРасходы.Добавить(стрНом);
		Иначе
			СуммаПоСуммеБаз = СуммаПоСуммеБаз + стрНом.СуммаВсегоРазница;
			СуммаПоСуммеНДСБаз = СуммаПоСуммеНДСБаз + стрНом.СуммаНДСРазница;
		КонецЕсли;
	КонецЦикла;
	
	// сразу переведем суммы
	ВалютаУпр                = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	ВалютаРегл               = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	// упр
	СуммаПоКоличеству        = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаПоКоличествуБаз, ВалютаДокумента, КурсДокумента, ВалютаУпр, КурсВалютыУпр); 
	СуммаПоСумме             = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаПоСуммеБаз, ВалютаДокумента, КурсДокумента, ВалютаУпр, КурсВалютыУпр); 
	СуммаНаДоходыИРасходы    = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаНаДоходыИРасходыБаз, ВалютаДокумента, КурсДокумента, ВалютаУпр, КурсВалютыУпр);
	СуммаНаДоходыИРасходыНДС = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаНаДоходыИРасходыНДСБаз, ВалютаДокумента, КурсДокумента, ВалютаУпр, КурсВалютыУпр);
	
	// регл
	СуммаПоКоличествуРегл        = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаПоКоличествуБаз, ВалютаДокумента, КурсДокумента, ВалютаРегл, Дата); 
	СуммаПоКоличествуНДСРегл     = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаПоКоличествуНДСБаз, ВалютаДокумента, КурсДокумента, ВалютаРегл, Дата);
	СуммаПоСуммеРегл             = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаПоСуммеБаз, ВалютаДокумента, КурсДокумента, ВалютаРегл, Дата); 
	СуммаПоСуммеНДСРегл          = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаПоСуммеНДСБаз, ВалютаДокумента, КурсДокумента, ВалютаРегл, Дата);
	// получим товары после проведения основных изысканий
	Если СуммаПоКоличеству <> 0 ИЛИ СуммаПоСумме <> 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПартииТоваровКомпанииОстатки.Номенклатура,
		|	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.КоличествоОстаток > 0
		|			ТОГДА ПартииТоваровКомпанииОстатки.КоличествоОстаток
		|		ИНАЧЕ -ПартииТоваровКомпанииОстатки.КоличествоОстаток
		|	КОНЕЦ КАК КоличествоОстаток,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.СуммаОстаток > 0
		|			ТОГДА ПартииТоваровКомпанииОстатки.СуммаОстаток
		|		ИНАЧЕ -ПартииТоваровКомпанииОстатки.СуммаОстаток
		|	КОНЕЦ КАК СуммаОстаток,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпанииОстатки.СуммаУпрОстаток > 0
		|			ТОГДА ПартииТоваровКомпанииОстатки.СуммаУпрОстаток
		|		ИНАЧЕ -ПартииТоваровКомпанииОстатки.СуммаУпрОстаток
		|	КОНЕЦ КАК СуммаУпрОстаток,
		|	ПартииТоваровКомпанииОстатки.СтатусПартии
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании.Остатки(
		|			&Граница,
		|			Партия = &Партия
		|				И СкладКомпании = &СкладКомпании) КАК ПартииТоваровКомпанииОстатки
		|ИТОГИ
		|	СУММА(КоличествоОстаток),
		|	СУММА(СуммаОстаток),
		|	СУММА(СуммаУпрОстаток)
		|ПО
		|	ОБЩИЕ";
		Запрос.УстановитьПараметр("Партия"        , СтрПартий.ПартияДок);
		Запрос.УстановитьПараметр("СкладКомпании" , СкладКомпании);
		Запрос.УстановитьПараметр("Граница"       , Новый Граница(МоментВремени(),ВидГраницы.Включая));
		
		ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ВыборкаИтоги.Следующий() Тогда
			Если СуммаПоКоличеству <> 0 И ВыборкаИтоги.КоличествоОстаток = 0 Тогда
				ВывестиСообщение(НСтр("ru = 'Не удалось распределить услуги по количеству так как количество товаров в партии 0.'"),ЭтотОбъект,,,Отказ);
			КонецЕсли;
			
			Если СуммаПоСумме <> 0 И ВыборкаИтоги.СуммаОстаток = 0 Тогда
				ВывестиСообщение(НСтр("ru = 'Не удалось распределить услуги по сумме так как сумма товаров в партии 0.'"),ЭтотОбъект,,,Отказ);
			КонецЕсли;
			
			Если Отказ Тогда
				Возврат Неопределено;
			КонецЕсли;
			
			// распишем услуги по количеству
			ВыборкаДетали     = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			СуммаНаЕдиницу    = Окр(СуммаПоКоличеству/ВыборкаИтоги.КоличествоОстаток,2,РежимОкругления.Окр15как20);
			СуммаОсталось     = СуммаПоКоличеству;
			
			СуммаНаЕдиницуРегл    = Окр(СуммаПоКоличествуРегл/ВыборкаИтоги.КоличествоОстаток,2,РежимОкругления.Окр15как20);
			СуммаНаЕдиницуНДСРегл = Окр(СуммаПоКоличествуНДСРегл/ВыборкаИтоги.КоличествоОстаток,2,РежимОкругления.Окр15как20);
			СуммаОсталосьРегл     = СуммаПоКоличествуРегл;
			СуммаОсталосьНДСРегл  = СуммаПоКоличествуНДСРегл;
			
			Пока ВыборкаДетали.Следующий() Цикл
				Если СуммаОсталось = 0 Тогда Прервать; КонецЕсли;
				
				СуммаОприх = СуммаНаЕдиницу*ВыборкаДетали.КоличествоОстаток;
				СуммаОприхРегл = СуммаНаЕдиницуРегл*ВыборкаДетали.СуммаОстаток;
				СуммаОприхНДСРегл = СуммаНаЕдиницуНДСРегл*ВыборкаДетали.СуммаОстаток;
				Если СуммаОприх <> 0 Тогда
					СуммаОсталось = СуммаОсталось - СуммаОприх;
					СуммаОсталосьРегл = СуммаОсталосьРегл - СуммаОприхРегл;
					СуммаОсталосьНДСРегл = СуммаОсталосьНДСРегл - СуммаОприхНДСРегл;
					
					НоваяЗапись = Движения.ПартииТоваровКомпании.Добавить();
					
					НоваяЗапись.СкладКомпании              = СкладКомпании;
					НоваяЗапись.ВидДвижения                = ВидДвиженияНакопления.Приход;
					НоваяЗапись.Период                     = Дата;
					НоваяЗапись.Регистратор                = Ссылка;
					НоваяЗапись.Номенклатура               = ВыборкаДетали.Номенклатура;
					НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаДетали.ХарактеристикаНоменклатуры;
					НоваяЗапись.СтатусПартии               = ВыборкаДетали.СтатусПартии;
					НоваяЗапись.Партия                     = СтрПартий.ПартияДок;
					
					НоваяЗапись.Количество                 = 0;
					НоваяЗапись.Сумма                      = СуммаОприхРегл;
					НоваяЗапись.СуммаУпр                   = СуммаОприх;
					НоваяЗапись.СуммаНДС                   = СуммаОприхНДСРегл;
					
					НоваяЗапись.ХозОперация = ХозОперация;
				КонецЕсли;
			КонецЦикла;
			
			Если СуммаОсталось <> 0 ИЛИ СуммаОсталосьРегл <> 0 ИЛИ СуммаОсталосьНДСРегл <> 0 И НоваяЗапись <> Неопределено Тогда
				НоваяЗапись.Сумма    = НоваяЗапись.Сумма + СуммаОсталосьРегл;
				НоваяЗапись.СуммаНДС = НоваяЗапись.СуммаНДС + СуммаОсталосьНДСРегл;
				НоваяЗапись.СуммаУпр = НоваяЗапись.СуммаУпр + СуммаОсталось;
			КонецЕсли;
			
			
			// распишем услуги по сумме
			ВыборкаДетали.Сбросить();
			ВыборкаДетали = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			СуммаНаЕдиницу = Окр(СуммаПоСумме/ВыборкаИтоги.СуммаОстаток,2,РежимОкругления.Окр15как20);
			СуммаОсталось = СуммаПоСумме;
			
			СуммаНаЕдиницуРегл    = Окр(СуммаПоСуммеРегл/ВыборкаИтоги.СуммаОстаток,2,РежимОкругления.Окр15как20);
			СуммаНаЕдиницуНДСРегл = Окр(СуммаПоСуммеНДСРегл/ВыборкаИтоги.СуммаОстаток,2,РежимОкругления.Окр15как20);
			СуммаОсталосьРегл     = СуммаПоСуммеРегл;
			СуммаОсталосьНДСРегл  = СуммаПоСуммеНДСРегл;

			Пока ВыборкаДетали.Следующий() Цикл
				Если СуммаОсталось = 0 Тогда Прервать; КонецЕсли;
				
				СуммаОприх = СуммаНаЕдиницу*ВыборкаДетали.СуммаОстаток;
				СуммаОприхРегл = СуммаНаЕдиницуРегл*ВыборкаДетали.СуммаОстаток;
				СуммаОприхНДСРегл = СуммаНаЕдиницуНДСРегл*ВыборкаДетали.СуммаОстаток;
				Если СуммаОприх <> 0 Тогда
					СуммаОсталось = СуммаОсталось - СуммаОприх;
					СуммаОсталосьРегл = СуммаОсталосьРегл - СуммаОприхРегл;
					СуммаОсталосьНДСРегл = СуммаОсталосьНДСРегл - СуммаОприхНДСРегл;
					
					НоваяЗапись = Движения.ПартииТоваровКомпании.Добавить();
					
					НоваяЗапись.СкладКомпании              = СкладКомпании;
					НоваяЗапись.ВидДвижения                = ВидДвиженияНакопления.Приход;
					НоваяЗапись.Период                     = Дата;
					НоваяЗапись.Регистратор                = Ссылка;
					НоваяЗапись.Номенклатура               = ВыборкаДетали.Номенклатура;
					НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаДетали.ХарактеристикаНоменклатуры;
					НоваяЗапись.СтатусПартии               = ВыборкаДетали.СтатусПартии;
					НоваяЗапись.Партия                     = СтрПартий.ПартияДок;
					
					НоваяЗапись.Количество                 = 0;
					НоваяЗапись.Сумма                      = СуммаОприхРегл;
					НоваяЗапись.СуммаУпр                   = СуммаОприх;
					НоваяЗапись.СуммаНДС                   = СуммаОприхНДСРегл;
					
					НоваяЗапись.ХозОперация = ХозОперация;
				КонецЕсли;
			КонецЦикла;
			
			Если СуммаОсталось <> 0 ИЛИ СуммаОсталосьРегл <> 0 ИЛИ СуммаОсталосьНДСРегл <> 0 И НоваяЗапись <> Неопределено Тогда
				НоваяЗапись.Сумма    = НоваяЗапись.Сумма + СуммаОсталосьРегл;
				НоваяЗапись.СуммаНДС = НоваяЗапись.СуммаНДС + СуммаОсталосьНДСРегл;
				НоваяЗапись.СуммаУпр = НоваяЗапись.СуммаУпр + СуммаОсталось;
			КонецЕсли;
		Иначе
			ВывестиСообщение(НСтр("ru = 'Не удалось распределить услуги так как товаров в партии не осталось.'"),ЭтотОбъект,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
	// Запишем сумму на доходы и расходы
	
	// определим необходимость формирования корректирующих проводок
	ВедетсяБалансПоПодразделению = БалансВедетсяПоПодразделениям(ШапкаДокумента.Дата);
	
	ПодразделениеСклад = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(СкладКомпании.ПодразделениеКомпании, Дата);
	ПодразделениеДоговорВзаиморасчетов = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ДоговорВзаиморасчетов.ПодразделениеКомпании, Дата);
	ПодразделениеПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ПодразделениеКомпании, Дата);
	Если ХозОперация = Справочники.ХозОперации.УслугиСтороннихОрганизаций Тогда
		БалансовыеПодразделенияНеРавны = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеПодразделениеКомпании);
	Иначе	
		БалансовыеПодразделенияНеРавны = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеСклад);
	КонецЕсли;
	
	Если СуммаНаДоходыИРасходы <> 0 И СтрПартий.ПартияДок.ХозОперация<>Справочники.ХозОперации.ПоступлениеБезвозмездное Тогда
		СуммаУслуг = 0;
		Для Каждого СтрокаУслуги Из МассивНаДоходыИРасходы Цикл
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
			Если ВедетсяБалансПоПодразделению Тогда
				НаборЗаписейДиР.Подразделение=ПодразделениеКомпании;
			КонецЕсли;
			НаборЗаписейДиР.ШапкаДокумента = ШапкаДокумента;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = СтрокаУслуги.Номенклатура.СтатьяДопРасходов;
			НаборЗаписейДиР.ВУпрВалюте = (ШапкаДокумента.ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
			НаборЗаписейДиР.Расход = СтрокаУслуги.СуммаВсегоРазница;
			СуммаУслуг = СуммаУслуг+СтрокаУслуги.СуммаВсегоРазница;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЦикла;
		
		// способ ведения не по подразделениям то ничего не будем корректировать
		Если ВедетсяБалансПоПодразделению И БалансовыеПодразделенияНеРавны  И СуммаУслуг<>0 Тогда	
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейДиР.Подразделение = ПодразделениеКомпании;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДиР.ВУпрВалюте = Ложь;
			НаборЗаписейДиР.Доход = СуммаУслуг;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;	
		КонецЕсли;
	КонецЕсли;
	
КонецФункции // ВыполнитьДвиженияПоУслугам()

Функция ВыполнитьДвиженияПоВзаиморасчетам(Отказ, Ошибки)
	
	Если ДоговорВзаиморасчетов.НеВестиВзаиморасчеты Тогда
		Возврат 0;
	КонецЕсли;
	
	// получим сумму документа
	СуммаДок = Товары.Итог("СуммаВсегоРазница");
	Если СуммаДок = 0 Тогда
		Возврат 0;
	КонецЕсли;
	СтрОснований = ПолучитьПартииТоваров();
	
	НаборВзаиморасчетов = Движения.ВзаиморасчетыКомпании;
	НоваяЗапись = НаборВзаиморасчетов.Добавить();
	НоваяЗапись.Регистратор				= Ссылка;
	НоваяЗапись.Период					= Дата;
	НоваяЗапись.ВидДвижения				= ВидДвиженияНакопления.Расход;
	НоваяЗапись.Контрагент				= Контрагент;
	НоваяЗапись.ДоговорВзаиморасчетов	= ДоговорВзаиморасчетов;
	Если ЕстьРеквизит(СтрОснований.ПартияДок,"ДокументОснование") И ЗначениеЗаполнено(СтрОснований.ПартияДок.ДокументОснование) И ТипЗнч(Сделка.ДокументОснование)=Тип("ДокументСсылка.ЗаказПоставщику")
		И ДоговорВзаиморасчетов.СпособЗакрытияСделок=Перечисления.СпособЗакрытияСделок.ПоСчетамИЗаказам Тогда
		НоваяЗапись.Сделка				= СтрОснований.ПартияДок.ДокументОснование;
	Иначе
		НоваяЗапись.Сделка				= СтрОснований.ПартияДок;
	КонецЕсли;
	НоваяЗапись.Сумма					= РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаДок, ВалютаДокумента, КурсДокумента,ДоговорВзаиморасчетов.ВалютаВзаиморасчетов, Дата);
	НоваяЗапись.СуммаУпр				= РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаДок, ВалютаДокумента, КурсДокумента, Константы.ВалютаУправленческогоУчетаКомпании.Получить(), КурсВалютыУпр);
	НоваяЗапись.СуммаБаз				= РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаДок, ВалютаДокумента, КурсДокумента, Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(), Дата);
	НоваяЗапись.ХозОперация				= ХозОперация;
	НоваяЗапись.ВидОперации				= Перечисления.ВидыОперацийВзаиморасчетов.НачислениеКредиторскойЗадолженности;
	НаборВзаиморасчетов.Записать();
	
	Возврат 0;
	
КонецФункции // ВыполнитьДвиженияПоВзаиморасчетам()

Функция ВыполнитьДвиженияПоГТД(Отказ, Ошибки)
	
	ШапкаДокумента = ПолучитьШапкуДокумента(Ссылка);
	
	// получим партии
	ОтрицательныеОстаткиРазрешены = (ПравоПользователя("РазрешитьОтрицательныеСкладскиеОстатки",ЭтотОбъект)<>Перечисления.ВидыРазрешенныхОтрицательныхОстатков.Запрещены);
	СтрПартий = ПолучитьПартииТоваров();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КорректировкаПоступленияТовары.Номенклатура,
	|	КорректировкаПоступленияТовары.ХарактеристикаНоменклатуры,
	|	КорректировкаПоступленияТовары.ГТД,
	|	СУММА(КорректировкаПоступленияТовары.КоличествоРазница) КАК Количество
	|ИЗ
	|	Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	|ГДЕ
	|	КорректировкаПоступленияТовары.КоличествоРазница <> 0
	|	И КорректировкаПоступленияТовары.Ссылка = &Ссылка
	|	И КорректировкаПоступленияТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаПоступленияТовары.ХарактеристикаНоменклатуры,
	|	КорректировкаПоступленияТовары.ГТД,
	|	КорректировкаПоступленияТовары.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// получим список ГТД
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГТДПартийТоваровКомпанииОстатки.Номенклатура,
	|	ГТДПартийТоваровКомпанииОстатки.ХарактеристикаНоменклатуры,
	|	ГТДПартийТоваровКомпанииОстатки.ГТД,
	|	СУММА(ГТДПартийТоваровКомпанииОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ГТДПартийТоваровКомпании.Остатки(
	|			&Момент,
	|			Партия = &Партия
	|				И СкладКомпании = &СкладКомпании) КАК ГТДПартийТоваровКомпанииОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ГТДПартийТоваровКомпанииОстатки.Номенклатура,
	|	ГТДПартийТоваровКомпанииОстатки.ХарактеристикаНоменклатуры,
	|	ГТДПартийТоваровКомпанииОстатки.ГТД";
	Запрос.УстановитьПараметр("Момент"       , МоментВремени());
	Запрос.УстановитьПараметр("Партия"       , СтрПартий.ПартияДок);
	Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
	ОстаткиГТД = Запрос.Выполнить().Выгрузить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество < 0 И НЕ ОтрицательныеОстаткиРазрешены Тогда
			
			// если расход проверим можно ли его отсторнировать
			НайденныеГТД = ОстаткиГТД.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ГТД",Выборка.Номенклатура,Выборка.ХарактеристикаНоменклатуры,Выборка.ГТД));
			Если (НЕ ОтрицательныеОстаткиРазрешены) и НайденныеГТД.Количество() = 0 Тогда
				ВывестиСообщение(НСтр("ru = 'Нехватка товара ""%1"" с ГТД ""%2"" в количестве %3.'"),ЭтотОбъект,,,Отказ,Выборка.Номенклатура,Выборка.ГТД,Строка(-Выборка.Количество));
				Продолжить;
			КонецЕсли;
			
			СтрокаГТД = НайденныеГТД[0];
			Если (НЕ ОтрицательныеОстаткиРазрешены) и СтрокаГТД.КоличествоОстаток < -Выборка.Количество Тогда
				ВывестиСообщение(НСтр("ru = 'Нехватка товара ""%1"" с ГТД ""%2"" в количестве %3.'"),ЭтотОбъект,,,Отказ,Выборка.Номенклатура,Выборка.ГТД,Строка(-Выборка.Количество-СтрокаГТД.КоличествоОстаток));
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		// если товара хватает спишем его
		НоваяЗапись = Движения.ГТДПартийТоваровКомпании.Добавить();
		
		НоваяЗапись.Регистратор                = Ссылка;
		НоваяЗапись.Период                     = Дата;
		НоваяЗапись.ВидДвижения                = ВидДвиженияНакопления.Приход;
		НоваяЗапись.ХозОперация                = ХозОперация;
		НоваяЗапись.Номенклатура               = Выборка.Номенклатура;
		НоваяЗапись.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		НоваяЗапись.ГТД                        = Выборка.ГТД;
		НоваяЗапись.СкладКомпании              = СкладКомпании;
		НоваяЗапись.Партия                     = СтрПартий.ПартияДок;
		НоваяЗапись.Количество                 = Выборка.Количество;
	КонецЦикла;
	
КонецФункции // ВыполнитьДвиженияПоГТД()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И НЕ Тип("Структура") = ТипЗнч(ДанныеЗаполнения) И (ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваров") Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкаПоступления")) Тогда
		
		Если НЕ ДанныеЗаполнения.Проведен Тогда
			УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, НСтр("ru = 'Корректировка поступления вводится только на основании проведенного документа.'"));
			Возврат;
		КонецЕсли;
		
		Если ДанныеЗаполнения = Ссылка Тогда
			УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, НСтр("ru = 'Ввод корректировки поступления на основании себя запрещен.'"));
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Сделка = Документы.КорректировкаПоступления.ПолучитьСделку(ДанныеЗаполнения);
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	итЗаявкаНаВозврат 	 = Ложь;
	итСтатусАкцептования = НЕОПРЕДЕЛЕНО;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Проверим хоз. операции
	// составим список документов движений.
	Если ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияКорректировкаПоСогласованиюСторон Тогда
		
		// заполним значение до корректировки
		Для Каждого стрТовары Из Товары Цикл
			стрТовары.КоличествоДоКорректировки = стрТовары.КоличествоПоДокументуПоступления;
			стрТовары.СуммаВсегоДоКорректировки = стрТовары.СуммаВсегоПоДокументуПоступления;
			стрТовары.СуммаНДСДоКорректировки   = стрТовары.СуммаНДСПоДокументуПоступления;
		КонецЦикла;
		
	ИначеЕсли ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияИсправлениеВПервичныхДокументах Тогда
		
		// проверим введенные на основании корректировки
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПодчиненныеДокументы.Ссылка КАК Документ
		|ИЗ
		|	КритерийОтбора.ПодчиненныеДокументы(&Основание) КАК ПодчиненныеДокументы
		|ГДЕ
		|	ПодчиненныеДокументы.Ссылка ССЫЛКА Документ.КорректировкаПоступления
		|	И НЕ ПодчиненныеДокументы.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаПоступленияКорректировкаПоСогласованиюСторон)
		|	И НЕ ПодчиненныеДокументы.Ссылка = &Ссылка";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Основание", ДокументОснование);
		Запрос.УстановитьПараметр("Ссылка",    Ссылка);
		ВыполнениеЗапроса = Запрос.Выполнить();
		
		Если НЕ ВыполнениеЗапроса.Пустой() Тогда
			ТекстСообщения = НСтр("ru = 'К документу %1 введено больше одного корректировочного документа с хоз. операцей ""Исправление первичных документов"". 
								|Каждую последующую корректировку следует вводить на основании предыдущей.'");
			ВывестиСообщение(ТекстСообщения, ЭтотОбъект,,, Отказ, Строка(ДокументОснование));
		КонецЕсли;
		
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Произведем очистку не использующихся в текущем контексте реквизитов
	ОбработкаСобытийДокументаСервер.ОчиститьПолеЦенаРозничнаяДляНеРозничныхСкладов(ЭтотОбъект, СкладКомпании);

	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	Если НЕ ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияКорректировкаБезОснования Тогда
		РаботаСГраницами.ДвиженияПоВзаиморасчетамПередПроведением(Ссылка, ДополнительныеСвойства);
	КонецЕсли;
	РаботаСГраницами.ДвиженияПоПартиямПередПроведением(Ссылка, ДополнительныеСвойства);
	
КонецПроцедуры

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Ошибки = "";
	ШапкаДокумента = ПолучитьШапкуДокумента(Ссылка);
	
	// определим необходимость формирования корректирующих проводок
	ВедетсяБалансПоПодразделению = БалансВедетсяПоПодразделениям(ШапкаДокумента.Дата);
	СтрОснований = ПолучитьПартииТоваров();
	ЭтоКорректировкаБезОснования = (ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияКорректировкаБезОснования);
	// Спишем остатки
	// выполним списание по регистру остатков и выполним переоценку если надо.
	ТаблицаНоменклатуры = ПолучитьТаблицуНоменклатуры();
	Если СтрОснований.ПартияДок.ХозОперация <> Справочники.ХозОперации.УслугиСтороннихОрганизаций Тогда
		ВыполнитьДвиженияПоОстаткам(ТаблицаНоменклатуры, Отказ, Ошибки);
		Если НЕ Отказ Тогда
			ВыполнитьДвиженияПоПартиям(ТаблицаНоменклатуры, Отказ, Ошибки);
		КонецЕсли;
	КонецЕсли;
	
	// оприходуем услуги
	Если НЕ Отказ Тогда
		ВыполнитьДвиженияПоУслугам(ТаблицаНоменклатуры, Отказ, Ошибки);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		// при безвозмездном поступлении сумму на доходы и расходы
		Если ЭтоКорректировкаБезОснования ИЛИ СтрОснований.ПартияДок.ХозОперация=Справочники.ХозОперации.ПоступлениеБезвозмездное Тогда
			СуммаСебестоимости = 0;
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект         = ЭтотОбъект;
			// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
			Если ВедетсяБалансПоПодразделению Тогда
				НаборЗаписейДиР.Подразделение          = ПодразделениеКомпании;
			КонецЕсли;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Себестоимость;
			НаборЗаписейДиР.ШапкаДокумента         = ШапкаДокумента;
			НаборЗаписейДиР.ВУпрВалюте             = Истина;
			НаборЗаписейДиР.Доход                  = Движения.ПартииТоваровКомпании.Итог("СуммаУпр");;
			СуммаСебестоимости                     = СуммаСебестоимости+НаборЗаписейДиР.Доход;
			Если НаборЗаписейДиР.Доход <> 0 Тогда
				Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
			КонецЕсли;
		КонецЕсли;
		
		// взаиморасчеты проведем
		Если (НЕ ЭтоКорректировкаБезОснования) И СтрОснований.ПартияДок.ХозОперация<>Справочники.ХозОперации.ПоступлениеТоваровКомиссия И СтрОснований.ПартияДок.ХозОперация<>Справочники.ХозОперации.ПоступлениеБезвозмездное Тогда // И Контрагент.ВидКонтрагента<>Перечисления.ВидыКонтрагентов.ПодотчетноеЛицо
			СуммаДоходаРасходаСуммовыхРазниц = ВыполнитьДвиженияПоВзаиморасчетам(Отказ, Ошибки);
			// доходы и расходы по суммовым разницам
			Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
				НаборЗаписейДиР = Движения.ДоходыИРасходы;
				НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
				// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
				Если ВедетсяБалансПоПодразделению Тогда
					НаборЗаписейДиР.Подразделение = ДоговорВзаиморасчетов.ПодразделениеКомпании;
				КонецЕсли;
				НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
				НаборЗаписейДиР.ВУпрВалюте = Истина;
				Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
					НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
				Иначе
					НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
				КонецЕсли;
				Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
			КонецЕсли;
		КонецЕсли;
		
		// Двигаем границы
		Если (НЕ ЭтоКорректировкаБезОснования) Тогда
			РаботаСГраницами.СдвинутьГраницуВзаиморасчетов(Ссылка, ДополнительныеСвойства, Движения);
		КонецЕсли;
		РаботаСГраницами.СдвинутьГраницуПартий(Ссылка,  ДополнительныеСвойства, Движения);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения


#Область Инициализация

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// Установим параметры проверки документа
ДополнительныеСвойства.Вставить("ТоварыЗапретАвтоСписанияХарактеристик", ИСТИНА);

#КонецОбласти

#КонецЕсли