
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Макет  = ПолучитьОбщийМакет("ТипыДиаграмм");
	Список = Макет.ПолучитьТекст();
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.Круговая.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$Круговая$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.КруговаяОбъемная.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$КруговаяОбъемная$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.График.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$График$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ГрафикПоШагам.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ГрафикПоШагам$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ГрафикСНакоплением.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ГрафикСНакоплением$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ГрафикСОбластями.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ГрафикСОбластями$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ГрафикСОбластямиИНакоплением.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ГрафикСОбластямиИНакоплением$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ГрафикСОбластямиНормированный.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ГрафикСОбластямиНормированный$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.Гистограмма.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$Гистограмма$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ГистограммаСНакоплением.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ГистограммаСНакоплением$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ГистограммаНормированная.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ГистограммаНормированная$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ГистограммаОбъемная.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ГистограммаОбъемная$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ГистограммаСНакоплениемОбъемная.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ГистограммаСНакоплениемОбъемная$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ГистограммаНормированнаяОбъемная.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ГистограммаНормированнаяОбъемная$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ГистограммаГоризонтальная.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ГистограммаГоризонтальная$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ГистограммаСНакоплениемГоризонтальная.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ГистограммаСНакоплениемГоризонтальная$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ГистограммаНормированнаяГоризонтальная.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ГистограммаНормированнаяГоризонтальная$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ГистограммаГоризонтальнаяОбъемная.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ГистограммаГоризонтальнаяОбъемная$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ГистограммаСНакоплениемГоризонтальнаяОбъемная.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ГистограммаСНакоплениемГоризонтальнаяОбъемная$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ГистограммаНормированнаяГоризонтальнаяОбъемная.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ГистограммаНормированнаяГоризонтальнаяОбъемная$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.Изометрическая.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$Изометрическая$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ИзометрическаяНепрерывная.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ИзометрическаяНепрерывная$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ИзометрическаяЛента.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ИзометрическаяЛента$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ИзометрическаяПирамида.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ИзометрическаяПирамида$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.Водопад.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$Водопад$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.КаркаснаяПоверхность.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$КаркаснаяПоверхность$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.Поверхность.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$Поверхность$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.Сотовая.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$Сотовая$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ВыпуклаяПоверхность.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ВыпуклаяПоверхность$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ВогнутаяПоверхность.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ВогнутаяПоверхность$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ЗатененнаяПоверхность.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ЗатененнаяПоверхность$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.РадарныйГрафик.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$РадарныйГрафик$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.РадарныйГрафикСНакоплением.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$РадарныйГрафикСНакоплением$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.РадарныйГрафикСОбластями.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$РадарныйГрафикСОбластями$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.РадарныйГрафикСОбластямиИНакоплением.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$РадарныйГрафикСОбластямиИНакоплением$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.РадарныйГрафикСОбластямиНормированный.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$РадарныйГрафикСОбластямиНормированный$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.Измерительная.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$Измерительная$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.Биржевая.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$Биржевая$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.БиржеваяСвеча.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$БиржеваяСвеча$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.Воронка.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$Воронка$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ВоронкаНормированная.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ВоронкаНормированная$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ВоронкаНормированнаяОбъемная.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ВоронкаНормированнаяОбъемная$", КартинкаВBase64);
	КартинкаВBase64 = Base64Строка(БиблиотекаКартинок.ВоронкаОбъемная.ПолучитьДвоичныеДанные());
	Список = СтрЗаменить(Список,"$ВоронкаОбъемная$", КартинкаВBase64);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ДанныеСобытия.Anchor = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТипаДиаграммы    = ДанныеСобытия.Anchor.nameProp;
	
	ЭлементТипДиаграммы = ТипДиаграммы[ИмяТипаДиаграммы];
	ИмяТипаДиаграммы    = СтрЗаменить(ПолучитьПолноеИмяПредопределенногоЗначения(ЭлементТипДиаграммы), "ТипДиаграммы.", "");
	Структура = Новый Структура();
	
	Закрыть(ИмяТипаДиаграммы);
	
КонецПроцедуры
