////////////////////////////////////////////////////////////////////////////////
// Реализаия расширяемого HTTP-клиента
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Синхронное выполнение HTTP запроса к серверу.
//  В случае ошибки генерирует исключение.
//
// Параметры:
//  МодульСоединения				 - Произвольный	 - Модуль объекта поддерживающего интерфейс создания соединения и параметров соединения.
//  ТипЗапроса						 - Строка		 - Глагол определяющий тип запроса согласно стандарту HTTP(https://tools.ietf.org/html/rfc2616).
//  Точка							 - Строка		 - Конечная точка(endpoint), определяющая ресурс к которому выполняется запрос.
//  Тело							 - Строка		 - Тело запроса, для запросов поддерживающих передачу тела.
//  Параметры						 - Структура	 - Параметры запроса, передаваемые в URL. Ключ - имя параметра, значение - значение параметра.
//  Заголовки						 - Соответствие	 - Дополнительные заголовки, которые необходимо передать в запросе.
//  ПараметрКонструктораСоединения	 - Произвольный	 - Параметр конструктора соединения, если модуль соединения поддерживает конструктор с парамтром.
//  ДопПараметры					 - Структура	 - используется для сквозной передачи параметров.
//      Ключ - имя параметра, значение - значение параметра.
// Возвращаемое значение:
//  Строка - Строкове представление тела ответа.
//
Функция ВыполнитьЗапрос(МодульСоединения, Знач ТипЗапроса, Знач Точка, Тело = Неопределено,
	Параметры = Неопределено,
	Заголовки = Неопределено,
	ПараметрКонструктораСоединения = Неопределено,
	ДопПараметры = Неопределено) Экспорт
	
	// Если соединение не передано извне, устанавливаем стандартное соединение.
	Если ПараметрКонструктораСоединения <> Неопределено Тогда
		СоединениеИПараметры = МодульСоединения.Соединение(ПараметрКонструктораСоединения);
	Иначе
		СоединениеИПараметры = МодульСоединения.Соединение();
	КонецЕсли;
	
	Соединение           = СоединениеИПараметры.Соединение;
	ПараметрыСоединения  = СоединениеИПараметры.Параметры;
	
	Если Ложь Тогда
		// Для работы контекстной подсказки.
		Соединение = Новый HTTPСоединение("",0);
	КонецЕсли;
	
	// Если есть параметры, мапим их в URL
	Если Параметры <> Неопределено Тогда
		
		МассивПараметров = Новый Массив();
		Для Каждого КлючИЗначение Из Параметры Цикл
			
			МассивПараметров.Добавить(СтрШаблон("%1=%2",
				КлючИЗначение.Ключ,
				XMLСтрока(КлючИЗначение.Значение)
			));
			
		КонецЦикла;
		
		Точка = СтрШаблон("%1?%2", Точка, СтрСоединить(МассивПараметров, "&"));
		
	КонецЕсли;
	
	КорневойПуть = Неопределено;
	Если ПараметрыСоединения.Свойство("ПутьНаСервере", КорневойПуть) Тогда
		
		Точка = "/" + КорневойПуть + Точка;
		
	КонецЕсли;
	
	Если Заголовки <> Неопределено Тогда
		Запрос = Новый HTTPЗапрос(Точка, Заголовки);
	Иначе
		Запрос = Новый HTTPЗапрос(Точка);
	КонецЕсли;
	
	ТипКонтента = Запрос.Заголовки.Получить("Content-Type");
	
	Если Запрос.Заголовки.Получить("Content-Type") = Неопределено Тогда
		Запрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	КонецЕсли;
	
	Если Тело <> Неопределено Тогда

		Если ТипЗнч(Тело) = Тип("ДвоичныеДанные") Тогда

			Запрос.УстановитьТелоИзДвоичныхДанных(Тело);

		Иначе

			Если НРег(ТипКонтента) = "application/x-www-form-urlencoded" Тогда

				МассивПараметров = Новый Массив();
				Для Каждого КлючИЗначение Из Тело Цикл
					МассивПараметров.Добавить(КлючИЗначение.Ключ + "=" + КлючИЗначение.Значение);
				КонецЦикла;

				ТелоСтрока = СтрСоединить(МассивПараметров, "&");

			ИначеЕсли НЕ ТипЗнч(Тело) = Тип("Строка") Тогда 

				ТелоСтрока = СобратьJSON(Тело);

			Иначе

				ТелоСтрока = Тело;

			КонецЕсли;
			
			Запрос.УстановитьТелоИзСтроки(ТелоСтрока,, ИспользованиеByteOrderMark.Авто);

		КонецЕсли;

	КонецЕсли;

	НачалоВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Ответ      = Соединение.ВызватьHTTPМетод(ВРег(ТипЗапроса), Запрос);
	
	Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоВыполнения;
	
	Если Ответ.КодСостояния = 302 Тогда
		// Должен быть заголовок ответа Location со ссылкой на ресурс.
		НоваяСсылка = Ответ.Заголовки.Получить("Location");
		Если НоваяСсылка = Неопределено Тогда
			ВызватьИсключение НСтр("ru='Не удалось получить файл, т.к. сервер не вернул валидный URL'");
		КонецЕсли;
		
		Соединение = СоздатьСоединениеНаОснованииURL(НоваяСсылка);
		СтруктураURL = HTTPКлиентСервер.СтруктураURI(НоваяСсылка);
		
		Если Заголовки <> Неопределено Тогда
			РедиректЗапрос = Новый HTTPЗапрос(СтруктураURL.ПутьНаСервере, Заголовки);
		Иначе
			РедиректЗапрос = Новый HTTPЗапрос(СтруктураURL.ПутьНаСервере);
		КонецЕсли;
		
		Ответ = Соединение.Получить(РедиректЗапрос);
		
	КонецЕсли;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Возврат Новый Структура(
		"Тело, Ошибка, Заголовки",
		ТелоОтвета,
		Ответ.КодСостояния <> 200,
		Ответ.Заголовки
	);
	
КонецФункции

// Сериализует переданную структуру в строку JSON.
// В случае ошибки генерирует исключение.
//
// Параметры:
//  Объект	 - Объект	 - Сериализуемый объект
// 
// Возвращаемое значение:
//  Строка - Строка в формате JSON
//
Функция СобратьJSON(Знач Объект) Экспорт
	
	Если Объект = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку();
	
	ЗаписатьJSON(Запись, Объект);
	
	Возврат Запись.Закрыть();
	
КонецФункции

// Десериализует переданную строку в структуру или соответствие.
// В случае ошибки генерирует исключение.
//
// Параметры:
//  СтрокаJSON		 - Строка	 - Строка в формате JSON.
//  ВСоответствие	 - Булево	 - Признак преобразования в соответствие.
// 
// Возвращаемое значение:
//  Структура, Соответствие - Десериализованный объект.
//
Функция РазобратьJSON(Знач СтрокаJSON, Знач ВСоответствие = Ложь) Экспорт
	
	Если СтрокаJSON = "" Тогда
		
		Если ВСоответствие Тогда
			Возврат Новый Соответствие();
		КонецЕсли;
		
		Возврат Новый Структура();
		
	КонецЕсли;
	
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(СтрокаJSON);
	
	Результат =  ПрочитатьJSON(Чтение, ВСоответствие);
	
	Чтение.Закрыть();
	
	Возврат Результат;
	
КонецФункции

// Создает HTTP-соединение на основании URL.
//
// Параметры:
//  URL	 - Строка	 - URL содержащий схему, хост, порт и адрес ресурса
// 
// Возвращаемое значение:
//  HTTPСоединение - Объект соединения
//
Функция СоздатьСоединениеНаОснованииURL(URL) Экспорт

	СтруктураURL = HTTPКлиентСервер.СтруктураURI(URL);

	ЗащищенноеСоединение = Неопределено;
	Если СтруктураURL.SSL Тогда
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	КонецЕсли;

	Соединение = Новый HTTPСоединение(
		СтруктураURL.Хост,
		СтруктураURL.Порт,
		СтруктураURL.Логин,
		СтруктураURL.Пароль,,,
		ЗащищенноеСоединение
	);

	Возврат Соединение;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти