#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьЗначениеВЕТИС(РешениеПринятияПартии) Экспорт
	
	ИндексЗначения = Перечисления.РешенияПринятияПартииВЕТИС.Индекс(РешениеПринятияПартии);
	
	Результат = Метаданные.Перечисления.РешенияПринятияПартииВЕТИС.ЗначенияПеречисления[ИндексЗначения].Имя;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначение(РешениеПринятияПартии) Экспорт
	
	Результат = Неопределено;
	
	ЗначениеПеречисления = Метаданные.Перечисления.РешенияПринятияПартииВЕТИС.ЗначенияПеречисления.Найти(РешениеПринятияПартии);
	Если Не ЗначениеПеречисления = Неопределено Тогда
		ИндексЗначения = Метаданные.Перечисления.РешенияПринятияПартииВЕТИС.ЗначенияПеречисления.Индекс(ЗначениеПеречисления);
		Результат = Перечисления.РешенияПринятияПартииВЕТИС[ИндексЗначения];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли