
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ЗаполнитьСписокОрганизацияБанк();
	ЗначенияФункциональныхОпций = Новый Структура;
	
	ПараметрыВыгрузки = СтруктураПараметровВыгрузкиЗагрузки();
	ПараметрыЗагрузки = СтруктураПараметровВыгрузкиЗагрузки();
	
	// Проверяем требуется выполнять прочие операции.
	Если ПравоПользователя("КонтролироватьСоответствиеОрганизацииПодразделения") Тогда
		
		Если Не Элементы.Найти("ДокументыКИмпортуПодразделение")=Неопределено Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(ЭтотОбъект.Элементы.ДокументыКИмпортуПодразделение.ПараметрыВыбора,
																"Отбор.Организация", Объект.Организация);
		КонецЕсли;
		
	КонецЕсли;

	УстановитьОтбор(ЭтотОбъект.Элементы.ДокументыКИмпортуДокумент.ПараметрыВыбора, "Отбор.ХозОперация");
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Только просмотр
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДокументыКИмпортуЗагружать");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДокументыКИмпорту.ТолькоПросмотр");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Только просмотр
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаКонтрагентовФлажок");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаКонтрагентов.ТолькоПросмотр");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
	// Цвет текста
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДокументыКИмпортуКонтрагент");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДокументыКИмпортуСчетКонтрагента");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДокументыКИмпорту.ПометитьКонтрагентСчет");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСписокОрганизацияБанк()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БанковскиеСчета.Владелец КАК Организация,
		|	БанковскиеСчета.Банк КАК Банк
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.Владелец ССЫЛКА Справочник.Организации
		|
		|СГРУППИРОВАТЬ ПО
		|	БанковскиеСчета.Владелец,
		|	БанковскиеСчета.Банк";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	МассивОрганизацияБанк = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаПрограмм.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Представление = Строка(Выборка.Организация) + "; " + Строка(Выборка.Банк);
		НоваяСтрока.ПутьКФайлу = ФайлЗагрузки;
		НоваяСтрока.Программа = Выборка.Банк;
		
	КонецЦикла;
	
	МассивПрограмм = ТаблицаПрограмм.Выгрузить(, "Представление").ВыгрузитьКолонку("Представление");
	Элементы.ПрограммаФайлЗагрузкиКлиентБанк.СписокВыбора.ЗагрузитьЗначения(МассивПрограмм);
	Элементы.ПрограммаФайлВыгрузкиКлиентБанк.СписокВыбора.ЗагрузитьЗначения(МассивПрограмм);

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ПараметрыВыгрузкиИзНастроек = Настройки.Получить("ПараметрыВыгрузки");
	Если ПараметрыВыгрузкиИзНастроек <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыВыгрузки, ПараметрыВыгрузкиИзНастроек);
		ФайлВыгрузки = ПараметрыВыгрузки.ПутьКФайлу;
		СтрТаблицаПрограммВыгрузки = ТаблицаПрограмм.НайтиСтроки(ПараметрыВыгрузки);
		Если СтрТаблицаПрограммВыгрузки.Количество() = 0 Тогда
			ПараметрыВыгрузки = СтруктураПараметровВыгрузкиЗагрузки();
		Иначе
			ПриИзмененииПараметровВыгрузкиЗагрузкиСервер(ПараметрыВыгрузки);
		КонецЕсли;
	КонецЕсли;
	
	СтрТаблицаПрограмм = ТаблицаПрограмм.НайтиСтроки(Новый Структура("Представление", ПараметрыВыгрузкиИзНастроек.Представление));
	Если СтрТаблицаПрограмм.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыВыгрузки, СтрТаблицаПрограмм[0]);
	КонецЕсли;
	
	ФайлЗагрузки = Настройки.Получить("ФайлЗагрузки");
	ПараметрыЗагрузки.ПутьКФайлу = ФайлЗагрузки;
	
	
	ПараметрыЗагрузкиИзНастроек = Настройки.Получить("ПараметрыЗагрузки");
	Если ПараметрыЗагрузкиИзНастроек <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗагрузки, ПараметрыЗагрузкиИзНастроек);
		ФайлЗагрузки = ПараметрыЗагрузки.ПутьКФайлу;
		СтрТаблицаПрограммЗагрузки = ТаблицаПрограмм.НайтиСтроки(ПараметрыЗагрузки);
		Если СтрТаблицаПрограммЗагрузки.Количество() = 0 Тогда
			ПараметрыЗагрузки = СтруктураПараметровВыгрузкиЗагрузки();
		Иначе
			ПриИзмененииПараметровВыгрузкиЗагрузкиСервер(ПараметрыЗагрузки);
		КонецЕсли;
	КонецЕсли;
	
	СтрТаблицаПрограмм = ТаблицаПрограмм.НайтиСтроки(Новый Структура("Представление", ПараметрыЗагрузкиИзНастроек.Представление));
	Если СтрТаблицаПрограмм.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыЗагрузки, СтрТаблицаПрограмм[0]);
	КонецЕсли;
	
	ФайлЗагрузки = Настройки.Получить("ФайлЗагрузки");
	ПараметрыЗагрузки.ПутьКФайлу = ФайлЗагрузки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммаФайлВыгрузкиКлиентБанкПриИзменении(Элемент)
	ПриИзмененииПараметровОбмена(Элемент, ПараметрыВыгрузки, ТаблицаПрограмм, ФайлВыгрузки);
КонецПроцедуры

&НаКлиенте
Процедура ПрограммаФайлЗагрузкиКлиентБанкПриИзменении(Элемент)
	
	ПараметрыЗагрузки.ПутьКФайлу = ФайлЗагрузки;
	ПриИзмененииПараметровОбмена(Элемент, ПараметрыЗагрузки, ТаблицаПрограмм, ФайлЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлВыгрузкиПриИзменении(Элемент)
	ПараметрыВыгрузки.ПутьКФайлу = ФайлВыгрузки;
КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиПриИзменении(Элемент)
	ПараметрыЗагрузки.ПутьКФайлу = ФайлЗагрузки;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлВыгрузки(Команда)
	ВыбратьФайлДанных("ФайлВыгрузки");
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлЗагрузки(Команда)
	
	ВыбратьФайлДанных("ФайлЗагрузки");
	ПрочитатьДанныеИзФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлВыгрузки(Элемент,СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФайлДляПросмотра(ПараметрыВыгрузки, НСтр("ru='Файл выгрузки'"));
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлЗагрузки(Элемент,СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФайлДляПросмотра(ПараметрыЗагрузки, НСтр("ru='Файл загрузки'"));
КонецПроцедуры

&НаКлиенте
Процедура ПериодВыгрузкиКлиентБанкПриИзменении(Элемент)
	
	Если ПериодВыгрузки.ДатаНачала > ПериодВыгрузки.ДатаОкончания Тогда
		ПоказатьПредупреждение(,НСтр("ru='Дата начала периода не должна быть больше даты окончания периода.'"));
		Возврат;
	КонецЕсли;
	
	ДокументыНаЭкспортОбновить();
	ВыгружатьПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНаЭкспортВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "Выгружать" Тогда
		
		Элемент.ТекущиеДанные.Выгружать = НЕ (Элемент.ТекущиеДанные.Выгружать);
		
	ИначеЕсли Поле.Имя = "ОписаниеОшибок" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст 
			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), Элемент.ТекущиеДанные.ОписаниеОшибок);
		
		Сообщение.Сообщить();
		
	ИначеЕсли Поле.Имя = "НазначениеПлатежа" Тогда
		
		ПоказатьПредупреждение(,СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), 
		Элемент.ТекущиеДанные.НазначениеПлатежа));
		
	Иначе
		
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНаЭкспортПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНаЭкспортПередНачаломИзменения(Элемент, Отказ)
	
	Если НЕ Элемент.ТекущийЭлемент.Имя = "Выгружать" Тогда
		
		Отказ = Истина;
		
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные) Тогда
			ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНаЭкспортПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьПриИзменении(Элемент)
	
	Сумма      = 0;
	Количество = 0;
	
	Для Каждого Строка Из Объект.ПлатежныеДокументы Цикл
		
		Если Строка.Выгружать Тогда
			
			Сумма      = Сумма + Строка.СуммаДокумента;
			Количество = Количество + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.Выгружать.ТекстПодвала = Формат(Количество, "ЧЦ=10");
	Элементы.СуммаДокумента.ТекстПодвала = Формат(Сумма, "ЧДЦ=2");
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыКИмпортуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
Если Поле.Имя = "ДокументыКИмпортуОписаниеОшибок" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), 
			Элемент.ТекущиеДанные.ОписаниеОшибок);
		
		Сообщение.Сообщить();
		
	ИначеЕсли Поле.Имя = "ДокументыКИмпортуНазначениеПлатежа" Тогда
		
		ПоказатьПредупреждение(,СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), 
			Элемент.ТекущиеДанные.НазначениеПлатежа));
		
	ИначеЕсли ЗначениеЗаполнено(Элемент.ТекущиеДанные.Документ) Тогда 
		
		Если (Поле.Имя = "ДокументыКИмпортуНомерСтроки"
			ИЛИ Поле.Имя = "ДокументыКИмпортуНомерДок"
			ИЛИ Поле.Имя = "ДокументыКИмпортуДатаДок"
			ИЛИ Поле.Имя = "ДокументыКИмпортуСуммаПоступило"
			ИЛИ Поле.Имя = "ДокументыКИмпортуСуммаСписано"
			ИЛИ Поле.Имя = "ДокументыКИмпортуДатаПроведения")
			ИЛИ (Поле.Имя = "ДокументыКИмпортуКонтрагент" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Контрагент)) 
			ИЛИ (Поле.Имя = "ДокументыКИмпортуСчетКонтрагента" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.СчетКонтрагента)) 
			ИЛИ (Поле.Имя = "ДокументыКИмпортуСтатьяДДС" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.СтатьяДДС))
			ИЛИ (Поле.Имя = "ДокументыКИмпортуСтатьяДоходовИлиРасходов" 
				И ЗначениеЗаполнено(Элемент.ТекущиеДанные.СтатьяДоходовИлиРасходов))
			ИЛИ (Поле.Имя = "ДокументыКИмпортуПодразделение" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Подразделение)) Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);
		
		КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	Элементы.ДокументыНаЭкспортОтчетОВыгрузке.Доступность = Ложь;
	
	Если Объект.ПлатежныеДокументы.Количество() > 0 Тогда
		
		Если ВыгрузитьДокументыНаЭкспортНаКлиенте() Тогда
			
			ТекстПредупреждения	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Данные успешно выгружены в файл %1'"), ПараметрыВыгрузки.ПутьКФайлу);
			
			ПоказатьПредупреждение(,ТекстПредупреждения);
			
			Элементы.ДокументыНаЭкспортОтчетОВыгрузке.Доступность = Истина;
			
		Иначе
			
			ТекстПредупреждения	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Не удалось записать данные в файл. 
					|Возможно, отсутствует каталог %1'"), 
					ПараметрыВыгрузки.ПутьКФайлу);
			
			ПоказатьПредупреждение(,ТекстПредупреждения);
			
		КонецЕсли;
		
	Иначе
		
		ТекстПредупреждения = НСтр("ru='Список документов для выгрузки пуст.
			|Проверьте правильность указанных параметров выгрузки.'");
		
		ПоказатьПредупреждение(,ТекстПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыКИмпортуОтметитьВсе(Команда)
	
	Для Каждого СтрокаДокумента Из ДокументыКИмпорту Цикл
		СтрокаДокумента.Загружать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыКИмпортуСнятьОтметкуСоВсех(Команда)
	
	Для Каждого СтрокаДокумента Из ДокументыКИмпорту Цикл
		СтрокаДокумента.Загружать = Ложь;
	КонецЦикла;
	           	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если ДокументыКИмпорту.Количество() > 0 Тогда
		ЗагрузитьДокументыКИмпорту();
	Иначе
		
		ТекстПредупреждения = НСтр("ru='Список документов для загрузки пуст.'");
		
		ПоказатьПредупреждение(,ТекстПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДокументыНаЭкспорт(Команда)
	
	ЗаполнитьДокументыНаЭкспорт1();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыНаЭкспорт1(Документы=Неопределено) Экспорт
	
	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.Текст = "ВЫБРАТЬ
	                           |	&ПлатежноеПоручение КАК ВидДокумента,
	                           |	ПлатежноеПоручение.Ссылка КАК Документ,
	                           |	ПлатежноеПоручение.Номер КАК Номер,
	                           |	ПлатежноеПоручение.Дата КАК Дата,
	                           |	ПлатежноеПоручение.Контрагент КАК Контрагент,
	                           |	ПлатежноеПоручение.СуммаДокумента КАК СуммаДокумента,
	                           |	ПлатежноеПоручение.СчетОрганизации.НомерСчета КАК ОрганизацияРасчСчет,
	                           |	ПлатежноеПоручение.СчетКонтрагента.НомерСчета КАК КонтрагентРасчСчет,
	                           |	ПлатежноеПоручение.СчетОрганизации.НомерСчета КАК НомерСчетаОрганизации,
	                           |	ПлатежноеПоручение.СчетКонтрагента.НомерСчета КАК НомерСчетаКонтрагента,
	                           |	ПлатежноеПоручение.НазначениеПлатежа КАК НазначениеПлатежа,
	                           |	СтатусыЗагрузкиВыгрузкиОбъектов.ВидСтатуса.Ссылка КАК ВидСтатуса,
	                           |	СтатусыЗагрузкиВыгрузкиОбъектов.Статус КАК Статус,
	                           |	СтатусыЗагрузкиВыгрузкиОбъектов.ИсточникПриемник КАК ИсточникПриемник,
	                           |	ВЫБОР
	                           |		КОГДА СтатусыЗагрузкиВыгрузкиОбъектов.Статус ЕСТЬ NULL
	                           |			ТОГДА ИСТИНА
	                           |		ИНАЧЕ ЛОЖЬ
	                           |	КОНЕЦ КАК Выгружать,
	                           |	ПлатежноеПоручение.КодБК КАК КодБК,
	                           |	ПлатежноеПоручение.КодОКТМО КАК КодОКАТО,
	                           |	ПлатежноеПоручение.СчетКонтрагента.Банк КАК КонтрагентБанк,
	                           |	ПлатежноеПоручение.СчетКонтрагента.БанкДляРасчетов КАК КонтрагентБанкДляРасчетов,
	                           |	ПлатежноеПоручение.СчетКонтрагента.Банк.Город КАК КонтрагентГородБанка,
	                           |	ПлатежноеПоручение.Контрагент.ИНН КАК КонтрагентИНН,
	                           |	ПлатежноеПоручение.КПППлательщика КАК КПППлательщика,
	                           |	ПлатежноеПоручение.КПППолучателя КАК КПППолучателя,
	                           |	ПлатежноеПоручение.СчетОрганизации.Банк КАК ОрганизацияБанк,
	                           |	ПлатежноеПоручение.СчетОрганизации.БанкДляРасчетов КАК ОрганизацияБанкДляРасчетов,
	                           |	ПлатежноеПоручение.СчетОрганизации.Банк.Город КАК ОрганизацияГородБанка,
	                           |	ПлатежноеПоручение.Организация.ИНН КАК ОрганизацияИНН,
	                           |	ПлатежноеПоручение.ХозОперация КАК ХозяйственнаяОперация,
	                           |	ПлатежноеПоручение.СчетКонтрагента.Банк.Код КАК КонтрагентБИКБанка,
	                           |	ПлатежноеПоручение.СчетКонтрагента.БанкДляРасчетов.Код КАК КонтрагентБИКРЦБанка,
	                           |	ПлатежноеПоручение.СчетКонтрагента.БанкДляРасчетов.Город КАК КонтрагентГородРЦБанка,
	                           |	ПлатежноеПоручение.СчетКонтрагента.Банк.КоррСчет КАК КонтрагентКоррСчет,
	                           |	ПлатежноеПоручение.СчетКонтрагента.БанкДляРасчетов.КоррСчет КАК КонтрагентКоррСчетРЦБанка,
	                           |	ПлатежноеПоручение.СчетОрганизации.Банк.Код КАК ОрганизацияБИКБанка,
	                           |	ПлатежноеПоручение.СчетОрганизации.БанкДляРасчетов.Код КАК ОрганизацияБИКРЦБанка,
	                           |	ПлатежноеПоручение.СчетОрганизации.БанкДляРасчетов.Город КАК ОрганизацияГородРЦБанка,
	                           |	ПлатежноеПоручение.СчетОрганизации.Банк.КоррСчет КАК ОрганизацияКоррСчет,
	                           |	ПлатежноеПоручение.СчетОрганизации.БанкДляРасчетов.КоррСчет КАК ОрганизацияКоррСчетРЦБанка,
	                           |	ПлатежноеПоручение.ВидПлатежа КАК ВидПлатежа,
	                           |	ПлатежноеПоручение.ОчередностьПлатежа КАК ОчередностьПлатежа,
	                           |	ПлатежноеПоручение.Организация.НаименованиеПолное КАК ОрганизацияНаим,
	                           |	ПлатежноеПоручение.ПеречислениеНалога КАК ПеречислениеВБюджет,
	                           |	ПлатежноеПоручение.СтатусСоставителя КАК СтатусСоставителя,
	                           |	ПлатежноеПоручение.ПоказательОснования КАК ПоказательОснования,
	                           |	ПлатежноеПоручение.ПоказательПериода КАК ПоказательПериода,
	                           |	ПлатежноеПоручение.ПоказательНомера КАК ПоказательНомера,
	                           |	ПлатежноеПоручение.ПоказательДаты КАК ПоказательДаты,
	                           |	ПлатежноеПоручение.ПоказательТипа КАК ПоказательТипа
	                           |ИЗ
	                           |	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
	                           |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗагрузкиВыгрузкиОбъектов КАК СтатусыЗагрузкиВыгрузкиОбъектов
	                           |		ПО ПлатежноеПоручение.Ссылка = СтатусыЗагрузкиВыгрузкиОбъектов.Объект
	                           |ГДЕ
	                           |	ПлатежноеПоручение.Дата МЕЖДУ &ДатаНачало И &ДатаОкончание
	                           |	И ПлатежноеПоручение.ПометкаУдаления = ЛОЖЬ
	                           |	И ПлатежноеПоручение.Организация = &Организация
	                           |	И ПлатежноеПоручение.СуммаДокумента <> 0";
	
	КонецПериода = ПериодЗагрузки.ДатаОкончания;
	Если ПериодЗагрузки.ДатаОкончания = Дата("00010101") Тогда
		КонецПериода = Дата("29990101");
	КонецЕсли;
	
	ЗапросПоДокументам.УстановитьПараметр("ПлатежноеПоручение", НСтр("ru = 'Платежное поручение'"));
	ЗапросПоДокументам.УстановитьПараметр("ДатаНачало",НачалоДня(ПериодЗагрузки.ДатаНачала));
	ЗапросПоДокументам.УстановитьПараметр("ДатаОкончание",КонецДня(КонецПериода));
	ЗапросПоДокументам.УстановитьПараметр("Организация", ПараметрыВыгрузки.Организация);
	
	Объект.ПлатежныеДокументы.Очистить();
	Объект.ПлатежныеДокументы.Загрузить(ЗапросПоДокументам.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	УстановитьФлажки(Истина);
	   
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрочитатьДанныеИзФайла(Команда)
	
	ПрочитатьДанныеИзФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуСоВсех(Команда)
	
	УстановитьФлажки(Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтрагентов(Команда)
	
	СоздатьНовыхКонтрагентов();
	
	Если ПрочитатьДанныеИзФайла(Ложь) Тогда
		
		Элементы.НеНайденныеРеквизиты.Видимость = (ТаблицаКонтрагентов.ПолучитьЭлементы().Количество() > 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетОВыгрузке(Команда)
	
	ПолеОтчета = Новый ТабличныйДокумент;
	
	ПолучитьОтчетОВыгрузке(ПолеОтчета);
	
	ПолеОтчета.ТолькоПросмотр = Истина;
	
	ПолеОтчета.Показать(НСтр("ru='Отчет о выгруженных документах'"));
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетОЗагрузке(Команда)
	
	ПолеОтчета = Новый ТабличныйДокумент;
	
	ПолучитьОтчетОЗагрузке(ПолеОтчета);
	
	ПолеОтчета.ТолькоПросмотр = Истина;
	
	ПолеОтчета.Показать(НСтр("ru='Отчет о загруженных документах'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьВыписку(Команда)
	
	ПолучитьВыпискуБанка( ПериодЗагрузки.ДатаНачала, ПериодЗагрузки.ДатаОкончания, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
// Отправляет запрос выписки в банк, а после получения выписки вызывает оповещение о выборе
// для формы или элемента формы, указанного в параметре Владелец.
//
// Параметры:
//  ДатаНачала - дата, начало периода запроса
//  ДатаОкончания - дата, окончание периода запроса
//  Владелец - Форма или элемент формы - получатель оповещения о выборе элемента - выписки банка
//  НомерСчета - Строка, номер банковского счета организации. Если не указан, то запрос по всем счетам;
//
Процедура ПолучитьВыпискуБанка( ДатаНачала, ДатаОкончания, Владелец, НомерСчета = Неопределено) Экспорт
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("НомерСчета",    НомерСчета);
	Параметры.Вставить("ДатаНачала",    ДатаНачала);
	Параметры.Вставить("ДатаОкончания", ДатаОкончания);
	Параметры.Вставить("Владелец",      Владелец);
	
	ПараметрыАвторизации = Новый Структура;
	РеквизитыСоглашения  = "1";
	
	ОткрытьФормуЗапросаВыписки(ПараметрыАвторизации, Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗапросаВыписки(ПараметрыАвторизации, ВходныеПараметры) Экспорт
	
	ВладелецФормы = ВходныеПараметры.Владелец;
	Если ЗначениеЗаполнено(ПараметрыАвторизации) Тогда
		ВходныеПараметры.Вставить("Пользователь", ПараметрыАвторизации.Пользователь);
		ВходныеПараметры.Вставить("Пароль", ПараметрыАвторизации.ПарольПользователя);
	ИначеЕсли ПараметрыАвторизации = Неопределено Тогда // при отказе пользователя от ввода пароля
		Возврат;
	КонецЕсли;
	ВходныеПараметры.Удалить("Владелец");
	ОткрытьФорму("Обработка.ОбменЭлектроннымиДокументамиСБанком.Форма.ЗапросВыписки", ВходныеПараметры, ВладелецФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровОбмена(Элемент, ПараметрыОбмена, ТаблицаПрограмм,  ПутьКФайлу)
	
	ОчиститьСообщения();
	СтрТаблицаПрограмм = ТаблицаПрограмм.НайтиСтроки(Новый Структура("Представление", Элемент.ТекстРедактирования));
	Если СтрТаблицаПрограмм.Количество() > 0 Тогда
		СтрТаблицаПрограмм[0].ПутьКФайлу = ПутьКФайлу;
		ЗаполнитьЗначенияСвойств(ПараметрыОбмена, СтрТаблицаПрограмм[0]);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПараметровВыгрузкиЗагрузкиСервер(ПараметрыОбмена)
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.ВыгрузкаДокументов Тогда
		ДокументыНаЭкспортОбновитьСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлДанных(Режим);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр = НСтр("ru='Текстовый файл (*.txt)|*.txt'");
	Если Режим = "ФайлВыгрузки" Тогда
		ДиалогВыбораФайла.Заголовок = НСтр("ru='Выберите файл для выгрузки данных в клиента банка'");
	ИначеЕсли Режим = "ФайлЗагрузки" Тогда
		ДиалогВыбораФайла.Заголовок = НСтр("ru='Выберите файл для загрузки данных в клиента банка'");
	КонецЕсли;
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "txt";
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	Если Режим = "ФайлВыгрузки" Тогда
		ДиалогВыбораФайла.ПолноеИмяФайла = ПараметрыВыгрузки.ПутьКФайлу;
	ИначеЕсли Режим = "ФайлЗагрузки" Тогда
		ДиалогВыбораФайла.ПолноеИмяФайла = ПараметрыЗагрузки.ПутьКФайлу;
	КонецЕсли;
	
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Если Режим = "ФайлВыгрузки" Тогда
			ФайлВыгрузки = ДиалогВыбораФайла.ПолноеИмяФайла;
			ПараметрыВыгрузки.ПутьКФайлу = ФайлВыгрузки;
		ИначеЕсли Режим = "ФайлЗагрузки" Тогда
			ФайлЗагрузки = ДиалогВыбораФайла.ПолноеИмяФайла;
			ПараметрыЗагрузки.ПутьКФайлу = ФайлЗагрузки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеТаблицыДокументов(Документы)
	
	Обработки.КлиентБанк.ПроверитьЗаполнениеТаблицыДокументов(?(Документы = "ДокументыНаЭкспорт",Объект.ПлатежныеДокументы,ДокументыКИмпорту));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыНаЭкспорт()
	
	Если НЕ ЗначениеЗаполнено(ПрограммаФайлВыгрузки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не выбрана программа в которую будет проводится выгрузка документов.'"));
		Возврат;
	КонецЕсли;
	
	ПутьКФайлуВыгрузки = "";
	
	СтрТаблицаПрограммВыгрузки = 
		ТаблицаПрограмм.НайтиСтроки(Новый Структура("Представление", ПрограммаФайлВыгрузки));
		
	Если СтрТаблицаПрограммВыгрузки.Количество() > 0 Тогда
		СтрПрограммаФайлВыгрузки = СтрТаблицаПрограммВыгрузки[0];
		ПутьКФайлуВыгрузки = СтрПрограммаФайлВыгрузки.ПутьКФайлу;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ДокументыНаЭкспортОбновитьСервер()
	
	ЗаполнитьДокументыНаЭкспорт();
	
	ПроверитьЗаполнениеТаблицыДокументов("ДокументыНаЭкспорт");
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыНаЭкспортОбновить()
	
	Объект.ПлатежныеДокументы.Очистить();
	
	ДокументыНаЭкспортОбновитьСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Флаг)
	
	Количество = 0;
	Сумма      = 0;
	
	Для Каждого СтрокаДокумента Из Объект.ПлатежныеДокументы Цикл
		
		СтрокаДокумента.Выгружать = Флаг;
		
		Если СтрокаДокумента.Выгружать Тогда
			
			Количество = Количество + 1;
			Сумма      = Сумма + СтрокаДокумента.СуммаДокумента;
			
		КонецЕсли;
		
	КонецЦикла;
			
	Элементы.Выгружать.ТекстПодвала = Формат(Количество, "ЧЦ=10");
	Элементы.СуммаДокумента.ТекстПодвала = Формат(Сумма, "ЧДЦ=2");
	
КонецПроцедуры

&НаКлиенте
Функция ВыгрузитьДокументыНаЭкспортНаКлиенте()
		
	ПотокВыгрузки = Новый ТекстовыйДокумент();
		
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ПотокВыгрузки, ЭтотОбъект.УникальныйИдентификатор);
		
	ВыгрузитьДокументыНаЭкспорт(АдресВременногоХранилища);
	
	ПотокВыгрузки = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	Попытка
		
		Если ПараметрыВыгрузки.Кодировка = "DOS" Тогда
			ПотокВыгрузки.Записать(ПараметрыВыгрузки.ПутьКФайлу, КодировкаТекста.OEM);
		Иначе
			ПотокВыгрузки.Записать(ПараметрыВыгрузки.ПутьКФайлу, КодировкаТекста.ANSI);
		КонецЕсли;
		
		// Отметим те документы, которые успешно выгрузились.
		Для Каждого СтрокаСекции Из Объект.ПлатежныеДокументы Цикл
			
			Если СтрокаСекции.Готовность = -2 Тогда
				СтрокаСекции.Готовность = -1;
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат 1;
		
	Исключение
		
		Возврат 0;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура ВыгрузитьДокументыНаЭкспорт(АдресВременногоХранилища)
	
	Параметры = Новый Структура;
	Параметры.Вставить("Кодировка",  Кодировка);
	Параметры.Вставить("Программа",  ПрограммаФайлВыгрузки);
	Параметры.Вставить("НачПериода", ПериодВыгрузки.ДатаНачала);
	Параметры.Вставить("КонПериода", ПериодВыгрузки.ДатаОкончания);
	Обработки.КлиентБанк.Выгрузить(
		Объект.ПлатежныеДокументы,
		Параметры,
		ФайлВыгрузки,
		Справочники.Организации.ОсновнаяОрганизация,
		АдресВременногоХранилища,
		ВыгружатьКПП);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьОтчетОВыгрузке(ПолеОтчета)
	
	Обработки.КлиентБанк.ПечатьОтчетаОВыгруженныхПлатежныхДокументах(
		ПолеОтчета,
		Объект.ПлатежныеДокументы,
		ПараметрыВыгрузки.Организация,
		ПериодВыгрузки.ДатаНачала,
		ПериодВыгрузки.ДатаОкончания);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьОтчетОЗагрузке(ПолеОтчета)
	
	Обработки.КлиентБанк.ПечатьОтчетаОЗагруженныхПлатежныхДокументах(
		ПолеОтчета,
		ДокументыКИмпорту,
		ПараметрыЗагрузки.Организация,
		Импорт_РасчетныеСчета,
		Импорт_Заголовок);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДокументыКИмпорту()
	
	// Проверка заполнения реквизитов таблицы документов к импорту.
	ЕстьОшибкиЗаполнения = Ложь;
	Для Каждого СтрокаТаблицы Из ДокументыКИмпорту Цикл
		
		Если СтрокаТаблицы.Загружать
		 И (СтрокаТаблицы.СтатьяДДС = Справочники.СтатьиДДС.ПеремещениеДС
		 	ИЛИ СтрокаТаблицы.СтатьяДДС = Справочники.СтатьиДДС.ВыдачаПодОтчет)
		 И Не ЗначениеЗаполнено(СтрокаТаблицы.Документ) Тогда
		 
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнена колонка ""Платежный документ"" в строке %1 списка загружаемых документов'"),
				СтрокаТаблицы.НомерСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				,
				"ДокументыКИмпорту[" + (СтрокаТаблицы.НомерСтроки - 1) + "].Документ");
			ЕстьОшибкиЗаполнения = Истина;
		 
		КонецЕсли;
		
		Если СтрокаТаблицы.Загружать И ТипЗнч(СтрокаТаблицы.Контрагент) = Тип("Строка") Тогда
			ВывестиСообщение(НСтр("ru = 'Контрагент не %1'"),,,,, Сред(СтрокаТаблицы.Контрагент, 4));
			ЕстьОшибкиЗаполнения = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЕстьОшибкиЗаполнения Тогда
		Обработки.КлиентБанк.Загрузить(
			ДокументыКИмпорту,
			Импорт_Заголовок,
			ПараметрыЗагрузки.Организация,
			Импорт_РасчетныеСчета);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНовыхКонтрагентов()
			
	Для Каждого Элемент Из ТаблицаКонтрагентов.ПолучитьЭлементы() Цикл
		
		Если Элемент.Флажок = 1 Тогда
			Обработки.КлиентБанк.СоздатьКонтрагента(Элемент);
		КонецЕсли;
				
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьФайл(Файл, Кодировка)
	
	ФайлЗагр = Новый Файл(Файл);
	
	Если НЕ ФайлЗагр.Существует() Тогда
		
		Сообщение = Новый СообщениеПользователю;
				
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Файл не выбран.'"),Файл);
				
		Сообщение.Сообщить();
		
		Возврат "ФайлНеСуществует";
		
	КонецЕсли;
	
	ПотокЧтения = Новый ТекстовыйДокумент();
	
	Попытка
		
		ПотокЧтения.Прочитать(Файл);
		
	Исключение
				
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ru='Файл не прочитан.'");
				
		Сообщение.Сообщить();
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Если Кодировка = "DOS" Тогда
		Кодир = КодировкаТекста.OEM;
	Иначе
		Кодир = КодировкаТекста.ANSI;
	КонецЕсли;

	ПотокЧтения.Прочитать(Файл, Кодир);

	Если ПотокЧтения.КоличествоСтрок() < 1 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ru='Файл загрузки не содержит данных.'");
				
		Сообщение.Сообщить();
				
		Возврат Неопределено;
		
	КонецЕсли;

	Если НЕ СокрЛП(ПотокЧтения.ПолучитьСтроку(1)) = "1CClientBankExchange" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ru='Указанный файл не является файлом обмена, или неверно указана кодировка.'");
				
		Сообщение.Сообщить();
				
		Возврат Неопределено;
		
	КонецЕсли;
	
	ФайлПрочитан = Ложь;
	Для НомерСтроки = 1 По ПотокЧтения.КоличествоСтрок() Цикл
		Если ВРЕГ(Лев(СокрЛП(ПотокЧтения.ПолучитьСтроку(НомерСтроки)), 13)) = "ВЕРСИЯФОРМАТА" Тогда
			ФайлПрочитан = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ФайлПрочитан Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Неверно указана кодировка файла обмена в банковском счете.'");
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	Возврат ПотокЧтения.ПолучитьТекст();
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПоказатьОповещениеПользователя(ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ПолучитьЗначениеПараметраСтруктуры(ДополнительныеПараметры, "Событие") = "ОповещениеПользователя" Тогда
		ПараметрыФормы = Новый Структура; ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("НомерСчета", ДополнительныеПараметры.НомерСчета);
		ПараметрыЗаполнения.Вставить("Владелец", ДополнительныеПараметры.Организация);
		ПараметрыФормы.Вставить("Основание", ПараметрыЗаполнения);
		ОткрытьФорму("Справочник.БанковскиеСчета.ФормаОбъекта",
			ПараметрыФормы,
			ЭтотОбъект,,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьДанныеИзФайла(ВыводитьСообщения = Истина)
	
	// Получаем исходные данные.
	Импорт_ТекстДляРазбора = ПрочитатьФайл(ПараметрыЗагрузки.ПутьКФайлу, ПараметрыЗагрузки.Кодировка);
	
	Если Импорт_ТекстДляРазбора = "ФайлНеСуществует" Тогда
		Возврат Ложь;
	ИначеЕсли Импорт_ТекстДляРазбора = Неопределено Тогда
		// Файл загрузки не содержит данных.
		Возврат Ложь;
	КонецЕсли;
	
	РезультатОперации = ПрочитатьДанныеИзФайлаСервер(Импорт_ТекстДляРазбора, ВыводитьСообщения);
	
	Если НЕ РезультатОперации = Неопределено Тогда
		// Чтобы дважды не выводить сообщение об одном счете.
		УжеВыведенныеСчета = Новый Массив;
		Для Каждого Результат Из РезультатОперации Цикл
			Если ЗначениеЗаполнено(Результат.ТекстСообщения) И УжеВыведенныеСчета.Найти(Результат.НомерСчета) = Неопределено Тогда
				ПоказатьОповещениеПользователя(НСтр("ru = 'Создать счет'") + " " + Результат.НомерСчета,
					Новый ОписаниеОповещения("Подключаемый_ПоказатьОповещениеПользователя",
						ЭтотОбъект,
						Новый Структура("Событие,НомерСчета,Организация", "ОповещениеПользователя", Результат.НомерСчета, 
																									Результат.Организация)),
					Результат.ТекстСообщения,
					БиблиотекаКартинок.Предупреждение32,
					СтатусОповещенияПользователя.Важное);
				УжеВыведенныеСчета.Добавить(Результат.НомерСчета);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПослеЗаполненияДокументыКИмпорту(ВыводитьСообщения);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаполненияДокументыКИмпорту(ВыводитьСообщения)
	
	Элементы.НеНайденныеРеквизиты.Видимость = (ТаблицаКонтрагентов.ПолучитьЭлементы().Количество() > 0);
	
	Элементы.ДокументыКИмпортуЗагружать.ТекстПодвала = ДокументыКИмпорту.Количество();
	Элементы.ДокументыКИмпортуСуммаПоступило.ТекстПодвала
		= Формат(ДокументыКИмпорту.Итог("СуммаПоступило"), "ЧЦ=12; ЧДЦ=2");
	Элементы.ДокументыКИмпортуСуммаСписано.ТекстПодвала
		= Формат(ДокументыКИмпорту.Итог("СуммаСписано"), "ЧЦ=12; ЧДЦ=2");
	
	ДокументыКИмпортуОтметитьВсе(Неопределено);
	
	Если ВыводитьСообщения Тогда
		ПроверитьЗаполнениеТаблицыДокументов("ДокументыКИмпорту");
		Элементы.ДокументыКИмпортуЗагрузить.Доступность = Истина;
		Элементы.ДокументыКИмпортуСформироватьОтчетОЗагрузке.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьДанныеИзФайлаСервер(Импорт_ТекстДляРазбора, ВыводитьСообщения)
	
	ДеревоРазбора = ЭлектронныеДокументыВнутренний.ДеревоРазбораВыпискиБанка(Импорт_ТекстДляРазбора);
	РезультатОперации = ЗаполнитьДокументыНаИмпорт(ДеревоРазбора);
	
	Возврат РезультатОперации;
	
КонецФункции

&НаСервере
Функция ЗаполнитьДокументыНаИмпорт(ДеревоРазбора)
	
	ВозвращаемыеДанные = Новый Структура;
	ВозвращаемыеДанные.Вставить("Импорт_Заголовок", Импорт_Заголовок);
	ВозвращаемыеДанные.Вставить("Импорт_РасчетныеСчета", Импорт_РасчетныеСчета);
	ВозвращаемыеДанные.Вставить("ДокументыКИмпорту", ДокументыКИмпорту);
	ВозвращаемыеДанные.Вставить("ТаблицаКонтрагентов", ТаблицаКонтрагентов);
	
	РезультатОперации = Обработки.КлиентБанк.ЗаполнитьДокументыНаИмпорт(
		ДеревоРазбора,
		ПараметрыЗагрузки.Организация,
		Элементы.ДокументыКИмпорту,
		ВозвращаемыеДанные);
	
	Импорт_Заголовок = ВозвращаемыеДанные.Импорт_Заголовок;
	
	Возврат РезультатОперации;
	
КонецФункции

&НаСервереБезКонтекста
Функция СтруктураПараметровВыгрузкиЗагрузки()
	
	СтруктураПараметровВыгрузкиЗагрузки = Новый Структура;
	СтруктураПараметровВыгрузкиЗагрузки.Вставить("Представление", "");
	СтруктураПараметровВыгрузкиЗагрузки.Вставить("Организация", Неопределено);
	СтруктураПараметровВыгрузкиЗагрузки.Вставить("Банк", Неопределено);
	СтруктураПараметровВыгрузкиЗагрузки.Вставить("Программа", "");
	СтруктураПараметровВыгрузкиЗагрузки.Вставить("ПутьКФайлу", "");
	СтруктураПараметровВыгрузкиЗагрузки.Вставить("Кодировка", "");
	Возврат СтруктураПараметровВыгрузкиЗагрузки;
КонецФункции

&НаКлиенте
Процедура ОткрытьФайлДляПросмотра(ПараметрыОбмена, Заголовок);
	
	ФайлНаДиске = Новый Файл(ПараметрыОбмена.ПутьКФайлу);
	
	Если Не ФайлНаДиске.Существует() Тогда
		ПоказатьПредупреждение(,НСтр("ru='Не найден файл.'"));
		Возврат;
	КонецЕсли;
	
	Текст = Новый ТекстовыйДокумент();
	Если ПараметрыОбмена.Кодировка = "DOS" Тогда
		Кодир = КодировкаТекста.OEM;
	Иначе
		Кодир = КодировкаТекста.ANSI;
	КонецЕсли;
	
	Текст.Прочитать(ПараметрыОбмена.ПутьКФайлу);
	Текст.Показать();
		
КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбратьФайлДанных("ФайлЗагрузки");

КонецПроцедуры

&НаКлиенте
Процедура ДокументыКИмпортуПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДокументыКИмпорту.ТекущиеДанные;
	
	Поступление = ТекущиеДанные.СуммаПоступило > 0;
	
	Если ТипЗнч(Элементы.ДокументыКИмпорту.ТекущиеДанные.Контрагент) = Тип("Строка") Тогда
		Элементы.ДокументыКИмпорту.ТекущиеДанные.ПометитьКонтрагентСчет = Истина;
	Иначе 
		Элементы.ДокументыКИмпорту.ТекущиеДанные.ПометитьКонтрагентСчет = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКонтрагентовФлажокПриИзменении(Элемент)
	ИДТекущейСтроки = Элементы.ТаблицаКонтрагентов.ТекущаяСтрока;
	Если ИДТекущейСтроки <> Неопределено Тогда		
		ЭлементКоллекции = ТаблицаКонтрагентов.НайтиПоИдентификатору(ИДТекущейСтроки);
		УстановкаФлажков(ЭлементКоллекции, ЭлементКоллекции.Флажок);
		Родитель = ЭлементКоллекции.ПолучитьРодителя();
		Пока Родитель <> Неопределено Цикл
			Родитель.Флажок = ?(УстановленоДляВсех(ЭлементКоллекции), ЭлементКоллекции.Флажок, 2);
			ЭлементКоллекции = Родитель;
			Родитель = ЭлементКоллекции.ПолучитьРодителя();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция УстановленоДляВсех(ЭлементКоллекции)
	СоседниеЭлементы = ЭлементКоллекции.ПолучитьРодителя().ПолучитьЭлементы();
	Для Каждого ТекЭлемент Из СоседниеЭлементы Цикл
		Если ТекЭлемент.Флажок <> ЭлементКоллекции.Флажок Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура УстановкаФлажков(ЭлементКоллекции, ЗначениеПометки)
	ПодчинЭлементы = ЭлементКоллекции.ПолучитьЭлементы();
	Для Каждого ТекЭлемент Из ПодчинЭлементы Цикл
		ТекЭлемент.Флажок = ЗначениеПометки;
		УстановкаФлажков(ТекЭлемент, ТекЭлемент.Флажок);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКонтрагентовОтметитьВсе(Команда)
	КоллекцияЭлементовДерева=ТаблицаКонтрагентов.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		Строка.Флажок = 1;
		ПодчинЭлементы = Строка.ПолучитьЭлементы();
		Для Каждого ПодчинСтрока Из ПодчинЭлементы Цикл
			ПодчинСтрока.Флажок = 1;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКонтрагентовСнятьОтметкуСоВсех(Команда)
	КоллекцияЭлементовДерева=ТаблицаКонтрагентов.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		Строка.Флажок = 0;
		ПодчинЭлементы = Строка.ПолучитьЭлементы();
		Для Каждого ПодчинСтрока Из ПодчинЭлементы Цикл
			ПодчинСтрока.Флажок = 0;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыКИмпортуКонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Типы = Новый Массив;
	Типы.Добавить(Тип("СправочникСсылка.Контрагенты"));
	ОписаниеТипов = Новый ОписаниеТипов(Типы);

	Элемент.ОграничениеТипа = ОписаниеТипов;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Кодировка) Тогда
		Кодировка = "Windows";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрограммаФайлЗагрузкиКлиентБанкОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Параметр = Новый Структура("Ключ", ПараметрыЗагрузки.Организация);
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта", Параметр);
КонецПроцедуры

&НаКлиенте
Процедура ПрограммаФайлВыгрузкиКлиентБанкОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Параметр = Новый Структура("Ключ", ПараметрыВыгрузки.Организация);
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта", Параметр);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыКИмпортуДокументПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДокументыКИмпорту.ТекущиеДанные;
	ТекущиеДанные.Подразделение = ДокументыКИмпортуДокументПриИзмененииНаСервере(ТекущиеДанные.Документ);
КонецПроцедуры

&НаСервере
Функция ДокументыКИмпортуДокументПриИзмененииНаСервере(ТекДанные)
	Возврат ТекДанные.ПодразделениеКомпании;
КонецФункции

&НаСервере
Процедура УстановитьОтбор(ПараметрыВыбора, ИмяПараметра)
	ЗначениеПараметра = Справочники.ХозОперации.СтрокаБанковскойВыписки;
	НовыйПараметрВыбора = Новый ПараметрВыбора(ИмяПараметра, ЗначениеПараметра);
	
	
	НоваяКоллекцияПараметров = Новый Массив;
	
	ИмяПараметра = НовыйПараметрВыбора.Имя;
	НоваяКоллекцияПараметров.Добавить(НовыйПараметрВыбора);
	
	
	ЭтотОбъект.Элементы.ДокументыКИмпортуДокумент.ПараметрыВыбора = Новый ФиксированныйМассив(НоваяКоллекцияПараметров);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКонтрагентовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыКИмпортуСчетКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаКонтрагента = Элементы.ДокументыКИмпорту.ТекущиеДанные;
	
	Если ТипЗнч(СтрокаКонтрагента.СчетКонтрагента) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура; ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("НомерСчета", СтрокаКонтрагента.СчетКонтрагента);
		ПараметрыЗаполнения.Вставить("Владелец", СтрокаКонтрагента.Контрагент);
		ПараметрыФормы.Вставить("Основание", ПараметрыЗаполнения);
		ОткрытьФорму("Справочник.БанковскиеСчета.ФормаОбъекта",
			ПараметрыФормы,
			ЭтотОбъект,,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписанБанковскийСчет" И Источник = ЭтотОбъект Тогда
		Элементы.ДокументыКИмпорту.ТекущиеДанные.СчетКонтрагента = Параметр;
		Типы = Новый Массив;
		Типы.Добавить(Тип("СправочникСсылка.БанковскиеСчета"));
		ОписаниеТипов = Новый ОписаниеТипов(Типы);
		Элементы.ДокументыКИмпорту.ТекущийЭлемент.ОграничениеТипа = ОписаниеТипов;
		ПрочитатьДанныеИзФайла();
	КонецЕсли;
	
КонецПроцедуры

