// Общий модуль "Технологическая платформа (сервер)"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Доопределяет структуру параметров, необходимых для работы клиентского кода при запуске конфигурации.
//
// Параметры:
//   Параметры   - Структура - структура параметров.
//
Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
КонецПроцедуры // ПриДобавленииПараметровРаботыКлиентаПриЗапуске()

// Позволяет указать роли специального назначения. Все остальные роли не требуется указывать -
// это роли, которые предназначены для любых пользователей, кроме внешних пользователей.
//
// Параметры:
//  НазначениеРолей - Структура - со свойствами:
//   * ТолькоДляАдминистраторовСистемы - Массив - имена ролей, которые при выключенном разделении
//     предназначены для любых пользователей, кроме внешних пользователей, а в разделенном режиме
//     предназначены только для администраторов сервиса, например:
//       Администрирование, ОбновлениеКонфигурацииБазыДанных, АдминистраторСистемы,
//     а также все роли с правами:
//       Администрирование,
//       Администрирование расширений конфигурации,
//       Обновление конфигурации базы данных.
//     Такие роли, как правило, существуют только в БСП и не встречаются в прикладных решениях.
//
//   * ТолькоДляПользователейСистемы - Массив - имена ролей, которые при выключенном разделении
//     предназначены для любых пользователей, кроме внешних пользователей, а в разделенном режиме
//     предназначены только для неразделенных пользователей (сотрудников технической поддержки сервиса и
//     администраторов сервиса), например:
//       ДобавлениеИзменениеАдресныхСведений, ДобавлениеИзменениеБанков,
//     а также все роли с правами изменения неразделенных данных и следующими правами:
//       Толстый клиент,
//       Внешнее соединение,
//       Automation,
//       Режим все функции,
//       Интерактивное открытие внешних обработок,
//       Интерактивное открытие внешних отчетов.
//     Такие роли в большей части существует в БСП, но могут встречаться и в прикладных решениях.
//
//   * ТолькоДляВнешнихПользователей - Массив - имена ролей, которые предназначены
//     только для внешних пользователей (роли со специально разработанным набором прав), например:
//       ДобавлениеИзменениеОтветовНаВопросыАнкет, БазовыеПраваВнешнегоПользователя.
//     Такие роли существуют и в БСП, и в прикладных решениях (если используются внешние пользователи).
//
//   * СовместноДляПользователейИВнешнихПользователей - Массив - имена ролей, которые предназначены
//     для любых пользователей (и внутренних, и внешних, и неразделенных), например:
//       ЧтениеОтветовНаВопросыАнкет, ДобавлениеИзменениеЛичныхВариантовОтчетов.
//     Такие роли существуют и в БСП, и в прикладных решениях (если используются внешние пользователи).
//
Процедура ПриОпределенииНазначенияРолей(НазначениеРолей) Экспорт
	
	// ТолькоДляАдминистраторовСистемы
	НазначениеРолей.ТолькоДляАдминистраторовСистемы.Добавить(Метаданные.Роли.ОбновлениеКонфигурации.Имя);
	НазначениеРолей.ТолькоДляАдминистраторовСистемы.Добавить(Метаданные.Роли.ПолныеПраваОграниченныеПоВидамДоступа.Имя);
	НазначениеРолей.ТолькоДляАдминистраторовСистемы.Добавить(Метаданные.Роли.ТестЦентр.Имя);
	
КонецПроцедуры // ПриОпределенииНазначенияРолей()

// Записывает событие в журнал регистрации.
// Параметры:
//  ИмяСобытия - Строка - имя события.
//  Комментарий - Строка - произвольная строка комментария к событию.
//
Процедура СделатьЗаписьЖурналаРегистрации(ИмяСобытия, Комментарий) Экспорт
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ СИСТЕМЫ

Процедура УстановкаПараметровСеанса(Знач ИмяПараметра, УстановленныеПараметры) Экспорт
	
	ПараметрыСеанса.ПодразделениеКомпании = ПараметрыСеанса.ТекущийПользователь.ПодразделениеКомпании;
	ПараметрыСеанса.Организация           = ПараметрыСеанса.ТекущийПользователь.Организация;
	ПараметрыСеанса.ОбщиеЗначения         = Новый ХранилищеЗначения(Новый Структура);
	
	УстановленныеПараметры.Добавить("ПодразделениеКомпании");
	УстановленныеПараметры.Добавить("Организация");
	УстановленныеПараметры.Добавить("ОбщиеЗначения");
	
КонецПроцедуры // УстановкаПараметровСеанса()


////////////////////////////////////////////////////////////////////////////////
// ОБНОВЛЕНИЕ ИНФОРМАЦИОННОЙ БАЗЫ

// Заполним предопределенные доп реквизиты и свойства
// запускается после релиза 3.0.01.03.
Процедура ОбновитьПредопределенныеДопРеквизитыИСвойства() Экспорт
	
	ДеревоДополнительныхРеквизитовИСвойств = ПолучитьДеревоСвойствИРеквизитов();
	
	Для Каждого СтрокаРодитель Из ДеревоДополнительныхРеквизитовИСвойств.Строки Цикл
		
		// получим доп свойство
		ДополнительныйРеквизитСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения[СтрокаРодитель.ИмяСвойства];
		
		ДополнительныйРеквизитСвойствоОбъект = ДополнительныйРеквизитСвойство.ПолучитьОбъект();
		ДополнительныйРеквизитСвойствоОбъект.ЭтоДополнительноеСведение = НЕ СтрокаРодитель.РеквизитСвойство;
		ДополнительныйРеквизитСвойствоОбъект.Подсказка                 = СтрокаРодитель.Подсказка;
		ДополнительныйРеквизитСвойствоОбъект.ТолькоДляПечати           = СтрокаРодитель.ТолькоДляПечати;
		ДополнительныйРеквизитСвойствоОбъект.Заголовок                 = СтрокаРодитель.Подсказка;
		
		ДополнительныйРеквизитСвойствоОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", ИСТИНА);
		ДополнительныйРеквизитСвойствоОбъект.Записать();
		
		// заполним наборы
		Для Каждого СтрокаДочерняя Из СтрокаРодитель.Строки Цикл
			Набор = Справочники.НаборыДополнительныхРеквизитовИСведений[СтрокаДочерняя.ИмяОбъекта];
			НаборОбъект = Набор.ПолучитьОбъект();
			
			ИмяТабличнойЧасти = ?(СтрокаРодитель.РеквизитСвойство, "ДополнительныеРеквизиты", "ДополнительныеСведения");
			
			СтрокаДобавить = НаборОбъект[ИмяТабличнойЧасти].Найти(ДополнительныйРеквизитСвойство,"Свойство");
			
			Если СтрокаДобавить = Неопределено Тогда
				СтрокаДобавить                 = НаборОбъект[ИмяТабличнойЧасти].Добавить();
				СтрокаДобавить.Свойство        = ДополнительныйРеквизитСвойство;
			КонецЕсли;
			
			НаборОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", ИСТИНА);
			НаборОбъект.Записать();
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция РежимПереносаДанныхИзПредыдущейРедакции() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НомераРелизаКонфигурацииПустой = Метаданные.Константы.Найти("НомерРелизаКонфигурации")=Неопределено ИЛИ ПустаяСтрока(Константы.НомерРелизаКонфигурации.Получить());
	
	Возврат (НЕ НомераРелизаКонфигурацииПустой) И ОбновлениеИнформационнойБазыСлужебный.РежимОбновленияДанных()="НачальноеЗаполнение";
	
КонецФункции // РежимПереносаДанныхИзПредыдущейРедакции()

Функция ЭтоФоновоеЗадание() Экспорт
	
	#Если ВнешнееСоединение Тогда
		Возврат ЛОЖЬ;
	#Иначе
		Возврат (ПолучитьИнформациюЭкрановКлиента()=Неопределено);
	#КонецЕсли
	
КонецФункции // ЭтоФоновоеЗадание()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ВНУТРЕННЕГО ИСПОЛЬЗОВАНИЯ

// Функция строит дерево предопределенных реквизитов и свойств по макету в ПВХ
// %
// Параметры:
//	Нет
//
// Возвращаемое значение - Дерево значений.
//
Функция ПолучитьДеревоСвойствИРеквизитов()
	// создадим дерево
	ДеревоРеквизитовИСвойств = Новый ДеревоЗначений();
	ДеревоРеквизитовИСвойств.Колонки.Добавить("ИмяСвойства", Новый ОписаниеТипов("Строка"));
	ДеревоРеквизитовИСвойств.Колонки.Добавить("РеквизитСвойство", Новый ОписаниеТипов("Булево"));
	ДеревоРеквизитовИСвойств.Колонки.Добавить("ИмяОбъекта", Новый ОписаниеТипов("Строка"));
	ДеревоРеквизитовИСвойств.Колонки.Добавить("Подсказка", Новый ОписаниеТипов("Строка"));
	ДеревоРеквизитовИСвойств.Колонки.Добавить("ТолькоДляПечати", Новый ОписаниеТипов("Булево"));
	
	// получим макет
	МакетСвойствИРеквизитов = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьМакет("ПредопределенныеСвойстваИРеквизиты");
	КоличествоЗаписейМакета = МакетСвойствИРеквизитов.ВысотаТаблицы;
	
	// запустим цикл для построения дерева
	Сч = 2;                ИмяСвойства = "";
	РеквизитСвойство = ""; ИмяОбъекта = "";
	СтрокаКорень = Неопределено;
	Пока Сч <= КоличествоЗаписейМакета Цикл
		// значения колонок строки
		ИмяСвойства      = Строка(МакетСвойствИРеквизитов.Область(Сч, 1, Сч, 1).Текст);
		РеквизитСвойство = Строка(МакетСвойствИРеквизитов.Область(Сч, 2, Сч, 2).Текст);
		ИмяОбъекта       = Строка(МакетСвойствИРеквизитов.Область(Сч, 3, Сч, 3).Текст);
		Подсказка        = Строка(МакетСвойствИРеквизитов.Область(Сч, 4, Сч, 4).Текст);
		ТолькоДляПечати  = Строка(МакетСвойствИРеквизитов.Область(Сч, 5, Сч, 5).Текст);
		
		Если ПустаяСтрока(ИмяСвойства) И ПустаяСтрока(ИмяОбъекта) Тогда
			Сч = Сч + 1; // увеличиваем счетчик
			Продолжить;
		КонецЕсли;
		
		ЭтоКорень = (НЕ ПустаяСтрока(ИмяСвойства) И ПустаяСтрока(ИмяОбъекта));
		
		Если ЭтоКорень Тогда
			СтрокаКорень = ДеревоРеквизитовИСвойств.Строки.Добавить();
			СтрокаКорень.ИмяСвойства      = ИмяСвойства;
			СтрокаКорень.РеквизитСвойство = (РеквизитСвойство = "Реквизит");
			СтрокаКорень.Подсказка        = Подсказка;
			СтрокаКорень.ТолькоДляПечати  = Булево(ТолькоДляПечати);
		Иначе
			НоваяСтрока = СтрокаКорень.Строки.Добавить();
			
			НоваяСтрока.ИмяСвойства = СтрокаКорень.ИмяСвойства;
			НоваяСтрока.ИмяОбъекта  = ИмяОбъекта;
		КонецЕсли;
		Сч = Сч + 1; // увеличиваем счетчик
	КонецЦикла;
	
	Возврат ДеревоРеквизитовИСвойств;
КонецФункции

// См. описание одноименной процедуры в общем модуле РегламентныеЗаданияПереопределяемый.
//
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	// Продажи / РезервированиеТоваров
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.АвтоматическоеСнятиеРезервов;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьЗаказы;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.НапоминаниеПроСнятиеРезервов;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьЗаказы;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	// ТехнологическаяПлатформа / БазоваяФункциональность (Администрирование) 
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.УдалениеПомеченных;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	// ТехнологическаяПлатформа / ПроведениеДокументов
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ВосстановлениеПоследовательностей;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ДопроведениеПоПартиям;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	// ТехнологическаяПлатформа / ПоискЗаменаЗначений
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ВыполнениеОтложенныхЗаменЗначений;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	// ТехнологическаяПлатформа / сфпСофтФонПроф
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.сфпОбновлениеТелефонныхКниг;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.сфпИспользоватьСофтФон;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	// СтандартныеПодсистемы / Валюты
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ЗагрузкаКурсовВалют;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	// СтандартныеПодсистемы / ВерсионированиеОбъектов
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ВыгрузкаВерсийОбъектов;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьВерсионированиеОбъектов;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОчисткаУстаревшихВерсийОбъектов;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьВерсионированиеОбъектов;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	// СтандартныеПодсистемы / ОбновлениеВерсииИБ
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОтложенноеОбновлениеИБ;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;

	// СтандартныеПодсистемы / УправлениеИтогамиИАгрегатами
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОбновлениеАгрегатов;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
		
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ПерестроениеАгрегатов;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
		
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.УстановкаПериодаРассчитанныхИтогов;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
	// СтандартныеПодсистемы / ОтправкаSMS
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОтправкаSMS;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьПочтовыйКлиент;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	// ПолучениеИОтправкаЭлектронныхПисем
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ПолучениеИОтправкаЭлектронныхПисем;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьПочтовыйКлиент;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	// ЭкспортОценкиПроизводительности
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ЭкспортОценкиПроизводительности;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
	
КонецПроцедуры
