#Область ОписаниеПеременных

// Модуль основной формы обработки "Настройки параметров учета"
&НаКлиенте
Перем ОбновитьИнтерфейс;

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	#Если НЕ ВебКлиент Тогда
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбновитьИнтерфейс();
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры //ОбновитьИнтерфейсПрограммы()

&НаКлиенте
Процедура Подключаемый_ОткрытьКонструкторФормата(Результат, ВходныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда 
		Если ВходныеПараметры = "Количество" Тогда
			НаборКонстант.ФорматВыводаКоличества = Результат;
			КонстантаПриИзменении(Элементы.ФорматВыводаКоличества);
		Иначе
			НаборКонстант.ФорматВыводаСуммы = Результат;
			КонстантаПриИзменении(Элементы.ФорматВыводаСуммы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //Подключаемый_ОткрытьКонструкторФормата()


&НаСервере
Процедура СохранитьЗначениеРеквизита(РеквизитПутьКДанным, Результат)
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	Иначе
		// Определение имени и запись значения реквизита в соответствующей константе из "НаборКонстант".
		// Используется для тех реквизитов формы, которые связаны с константами напрямую (в отношении один-к-одному).
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
		
		УправлениеДиалогомСервер.ДобавитьОповещениеФорм("Запись_НаборКонстант", Новый Структура, КонстантаИмя, Результат);
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "РежимПроведенияПоПартиям" Тогда
		Если НЕ ЭтотУзел.РежимПроведенияПоПартиям=ЭтотОбъект.РежимПроведенияПоПартиям Тогда
			Попытка
				ПланОбменаОбъект = ЭтотУзел.ПолучитьОбъект();
				ПланОбменаОбъект.РежимПроведенияПоПартиям = ЭтотОбъект.РежимПроведенияПоПартиям;
				ПланОбменаОбъект.Записать();
			Исключение
				ВызватьИсключение;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры //СохранитьЗначениеРеквизита()

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	Результат = Новый Структура;
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	СохранитьЗначениеРеквизита(РеквизитПутьКДанным, Результат);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат Результат;
	
КонецФункции //ПриИзмененииРеквизитаСервер()

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент, ОбновлятьИнтерфейс = Истина)
	
	Результат = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если ОбновлятьИнтерфейс Тогда
		#Если НЕ ВебКлиент Тогда
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 1, Истина);
		ОбновитьИнтерфейс = Истина;
		#КонецЕсли
	КонецЕсли;
	
	УправлениеДиалогомКлиент.ПоказатьРезультатВыполнения(ЭтотОбъект, Результат);

КонецПроцедуры //Подключаемый_ПриИзмененииРеквизита()

// Проверяет были ли введены документы.
//
&НаСервере
Функция ПроверитьНеобходимостьБлокировки()
	
	// проверим остатки
	ВалютаМожноИзменять = БалансЗакрыт();
	Если НЕ ВалютаМожноИзменять Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = ""; 
	Для Каждого Док Из Метаданные.Документы Цикл
		Запрос.Текст = Запрос.Текст
		+ "ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Документ." + Док.Имя + ".Ссылка
		|ГДЕ
		|	Документ." + Док.Имя + ".Проведен=Истина
		|";
	КонецЦикла;
	
	// Уберем первое "ОБЪЕДИНИТЬ ВСЕ"
	Запрос.Текст=Сред(Запрос.Текст,СтрДлина("ОБЪЕДИНИТЬ ВСЕ")+1);
	ВведеныДокументы = (Не Запрос.Выполнить().Пустой());
	Если ВведеныДокументы Тогда
		Возврат Истина;
	КонецЕсли; 
	Возврат Ложь;
	
КонецФункции // ПроверитьНеобходимостьБлокировки()

// Возвращает Истина в случае если нет остатков на балансовых регистрах
// Ложь если остатки нет.
//
&НаСервере
Функция БалансЗакрыт()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ДенежныеСредстваКомпанииОстатки.СуммаОстаток,0) КАК СуммаОстаток,
	|	ЕСТЬNULL(ПартииТоваровКомпанииОстатки.КоличествоОстаток,0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ПартииТоваровОтданныеОстатки.КоличествоОстаток,0) КАК КоличествоОстаток1,
	|	ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаОстаток,0) КАК СуммаОстаток1,
	|	ЕСТЬNULL(ДоходыИРасходыОстатки.ДоходУпрОстаток,0) КАК ДоходУпрОстаток,
	|	ЕСТЬNULL(ДоходыИРасходыОстатки.РасходУпрОстаток,0) КАК РасходУпрОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКомпании.Остатки КАК ДенежныеСредстваКомпанииОстатки,
	|	РегистрНакопления.ПартииТоваровКомпании.Остатки КАК ПартииТоваровКомпанииОстатки,
	|	РегистрНакопления.ПартииТоваровОтданные.Остатки КАК ПартииТоваровОтданныеОстатки,
	|	РегистрНакопления.ВзаиморасчетыКомпании.Остатки КАК ВзаиморасчетыКомпанииОстатки,
	|	РегистрНакопления.ДоходыИРасходы.Остатки КАК ДоходыИРасходыОстатки");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	// проверим остатки
	БалансЗакрыт = (Выборка.СуммаОстаток=0 И Выборка.КоличествоОстаток=0 И Выборка.КоличествоОстаток1=0 И Выборка.СуммаОстаток1=0 И Выборка.ДоходУпрОстаток=0 И Выборка.РасходУпрОстаток=0);
	Возврат БалансЗакрыт;
	
КонецФункции //БалансЗакрыт()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Проверим участвует ли реквизит в движениях
	НеобходимостьБлокировки = ПроверитьНеобходимостьБлокировки();
	Элементы.ВалютаРегламентированногоУчетаОрганизаций.ТолькоПросмотр = НеобходимостьБлокировки;
	Элементы.ВалютаУправленческогоУчетаКомпании.ТолькоПросмотр = НеобходимостьБлокировки;
	
КонецПроцедуры // БлокироватьЭлементыФормы()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события возникающего на клиенте при нажатии на кнопку "Настроить префиксацию".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура НастроитьПрефиксацию(Команда)
	
	ОткрытьФорму("РегистрСведений.ПрефиксацияОбъектов.ФормаСписка");
	
КонецПроцедуры // НастроитьПрефиксацию()

// Обработчик события возникающего на клиенте при нажатии на кнопку "Настроить параметры СУЗ".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура НастроитьПараметрыСУЗ(Команда)
	ОткрытьФорму(
		"Справочник.НастройкаОбменаМаркировкиТоваров.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОчисткуКодовМаркировки(Команда)
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(ОчисткаНапечатанныхКодовМаркировки);
	Диалог.Показать(Новый ОписаниеОповещения("ОчисткаНапечатанныхКодовМаркировки", ЭтотОбъект));
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ

// Обработчик события возникающего на клиенте при изменении данных констант.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура КонстантаПриИзменении(Элемент)
	
	ОбновитьИнтерфейс = ИСТИНА;
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры // КонстантаПриИзменении()

// Обработчик события возникающего в момент нажатия кнопки открытия реквизита "Формат вывода количества".
//
// Параметры:
//  Элемент              - ПолеФормы      - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево         - данный параметр передается признак выполнения стандартной (системной)
//                                          обработки события.
//
&НаКлиенте
Процедура ФорматВыводаКоличестваОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Конструктор = Новый КонструкторФорматнойСтроки;
	
	// форматная строка только для типов Число
	Конструктор.ДоступныеТипы = Новый ОписаниеТипов("Число");
	Конструктор.Текст = НаборКонстант.ФорматВыводаКоличества;
	Конструктор.Показать(Новый ОписаниеОповещения("Подключаемый_ОткрытьКонструкторФормата",ЭтотОбъект,"Количество"));
	
КонецПроцедуры //ФорматВыводаКоличестваОткрытие(0

// Обработчик события возникающего в момент нажатия кнопки открытия реквизита "Формат вывода суммы".
//
// Параметры:
//  Элемент              - ПолеФормы      - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево         - данный параметр передается признак выполнения стандартной (системной)
//                                          обработки события.
//
&НаКлиенте
Процедура ФорматВыводаСуммыОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Конструктор = Новый КонструкторФорматнойСтроки;
	
	// форматная строка только для типов Число
	Конструктор.ДоступныеТипы = Новый ОписаниеТипов("Число");
	Конструктор.Текст = НаборКонстант.ФорматВыводаСуммы;
	Конструктор.Показать(Новый ОписаниеОповещения("Подключаемый_ОткрытьКонструкторФормата",ЭтотОбъект,"Сумма"));
	
КонецПроцедуры //ФорматВыводаСуммыОткрытие()

// Обработчик события возникающего при изменении флага "Утверждение документов".
//
// Параметры:
//  Элемент              - ПолеФлажка      - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ИспользоватьУтверждениеДокументовПриИзменении(Элемент)
	
	ОбновитьИнтерфейс = ИСТИНА;
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
КонецПроцедуры // ИспользоватьУтверждениеДокументовПриИзменении() 

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотУзел = ПланыОбмена.УдаленныеПодразделения.ЭтотУзел();
	ЭтотОбъект.РежимПроведенияПоПартиям = ЭтотУзел.РежимПроведенияПоПартиям;
	
	// В режиме веб-клиента произведем показ кнопки изменения текущего объекта
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		Элементы.Изменить.Видимость = Истина;
		Элементы.ГруппаКнопки.Видимость = Истина;
	КонецЕсли;
	
	// Инициализация набора констант
	НаборКонстантОбъект = РеквизитФормыВЗначение("НаборКонстант");
	НаборКонстантОбъект.Прочитать();
	ЗначениеВДанныеФормы(НаборКонстантОбъект, НаборКонстант);
	
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
КонецПроцедуры // ПриСозданииНаСервере()

//Мальцев А.Ю. +++
&НаКлиенте
Процедура НаборКонстантитТранзитныйСкладПриИзменении(Элемент)
	ОбновитьИнтерфейс = ИСТИНА;
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантитНормативОтТоварооборотаПриИзменении(Элемент)	
	ОбновитьИнтерфейс = ИСТИНА;
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантитШтрафУправляющегоПриИзменении(Элемент)
	ОбновитьИнтерфейс = ИСТИНА;
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры
//Мальцев А.Ю. ---

//тк+
&НаКлиенте
Процедура НастроитьШаблонНаименования() Экспорт
	СтарыйШаблон = НаборКонстант.ОсновнойШаблонНаименованийТоваров;
	ОбъектШаблона = Неопределено;
	
	//ПараметрыКоманды = Новый Структура("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	ОбработчикЗакрытия = Новый ОписаниеОповещения("УстановитьШаблонНаименования", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектШаблона", ОбъектШаблона);
	ПараметрыФормы.Вставить("ТекущийШаблон",  СтарыйШаблон);
	
	ОткрытьФорму("ОбщаяФорма.ФормаРедактированияШаблонаНаименования", ПараметрыФормы, , , , , ОбработчикЗакрытия);

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИК РЕЗУЛЬТАТА РАБОТЫ ПОДЧИНЁННОЙ ФОРМЫ

&НаКлиенте
Процедура УстановитьШаблонНаименования(СтруктураРезультата, Параметры) Экспорт
	
	Перем Шаблон;
	
	Если ТипЗнч(СтруктураРезультата) = Тип ("Структура") Тогда 
		Если СтруктураРезультата.Свойство("Шаблон", Шаблон) Тогда 
			НаборКонстант.ОсновнойШаблонНаименованийТоваров = Шаблон;
		КонецЕсли;
	КонстантаПриИзменении(Элементы.ШаблонНаименованийТоваровПоУмолчанию)

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонНаименованийТоваровПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НастроитьШаблонНаименования();
	
КонецПроцедуры



//тк-






