// Модуль менеджера документа "Товарно-транспортная накладная ЕГАИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура СформироватьПеремещениеВТорговыйЗалЕГАИС(ДокументСсылка)
	
	ПеремещениеВТорговый = Документы.ПеремещениеВТорговыйЗалЕГАИС.СоздатьДокумент();
	ПеремещениеВТорговый.Заполнить(ДокументСсылка);
	Если ПеремещениеВТорговый.Товары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ПеремещениеВТорговый.Записать(РежимЗаписиДокумента.Проведение);
	
	ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные;
	ДанныеДляВыполненияОбменаНаКлиенте = ИнтеграцияЕГАИСВызовСервера.ПодготовитьКПередаче(ПеремещениеВТорговый.Ссылка, ДальнейшееДействие);
	
КонецПроцедуры

Процедура СформироватьАктПривязкиМарокЕГАИС(ДокументСсылка)
	
	//АктПривязкиМарок = Документы.АктПривязкиМарокЕГАИС.СоздатьДокумент();
	//АктПривязкиМарок.Заполнить(ДокументСсылка);
	//Если АктПривязкиМарок.Товары.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	//АктПривязкиМарок.Записать(РежимЗаписиДокумента.Проведение);
	//
	//ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные;
	//ДанныеДляВыполненияОбменаНаКлиенте = ИнтеграцияЕГАИСВызовСервера.ПодготовитьКПередаче(АктПривязкиМарок.Ссылка, ДальнейшееДействие);
	
КонецПроцедуры

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	ИтогиОперации.Вставить("СуммаДокумента", Объект.Товары.Итог("Сумма"));
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

Функция АктПодтвержденияXML(ДокументСсылка, ДополнительныеПараметры)
	
	ПодчиненныйОбъект = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеПараметры, "ПодчиненныйОбъект", Неопределено);
	Если НЕ ПодчиненныйОбъект = Неопределено Тогда
		ПолноеИмя = ПодчиненныйОбъект.Метаданные().ПолноеИмя();
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
		ВозвращаемоеЗначение = МенеджерОбъекта.АктПодтвержденияXML(ПодчиненныйОбъект, ДополнительныеПараметры);
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ХозОперация,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Ссылка,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ИзменениеПраваСобственности КАК ИзменениеПраваСобственности,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Грузополучатель КАК ОрганизацияЕГАИС,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Грузополучатель.Код КАК ИдентификаторФСРАР,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ФорматОбмена КАК ФорматОбмена,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.РегистрационныйНомер КАК РегистрационныйНомер,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Идентификатор КАК Идентификатор,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Номер,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Дата,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ДатаВходящая КАК ДатаВходящая,
	|	ВЫРАЗИТЬ(ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Комментарий КАК Строка(500)) КАК Комментарий
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС КАК ТоварноТранспортнаяНакладнаяВходящаяЕГАИС
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Ссылка = &Ссылка И 
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ПометкаУдаления = ЛОЖЬ
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		
		ПараметрыЗапроса = ПараметрыОбъектов[Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия3];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	Если Выборка.ФорматОбмена = 4 Тогда
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия4;
		ФорматОбмена = 4;
	Иначе
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия3;
		ФорматОбмена = 3;
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ИдентификаторФСРАР", Выборка.ИдентификаторФСРАР);
	ДанныеДляВыгрузки.Вставить("Объект",             ДокументСсылка);
	ДанныеДляВыгрузки.Вставить("ШапкаДокумента",     Выборка);
	
	СообщенияXML = ИнтеграцияЕГАИС.СформироватьСообщенияXML(ВидСообщения, ДанныеДляВыгрузки, ФорматОбмена);
	
	Возврат СообщенияXML;
	
КонецФункции

Функция АктОтказаXML(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ХозОперация,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Ссылка,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Грузополучатель КАК ОрганизацияЕГАИС,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Грузополучатель.Код КАК ИдентификаторФСРАР,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ИзменениеПраваСобственности КАК ИзменениеПраваСобственности,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ФорматОбмена КАК ФорматОбмена,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.РегистрационныйНомер КАК РегистрационныйНомер,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Идентификатор КАК Идентификатор,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Номер,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Дата,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ДатаВходящая КАК ДатаВходящая,
	|	ВЫРАЗИТЬ(ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Комментарий КАК Строка(500)) КАК Комментарий
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС КАК ТоварноТранспортнаяНакладнаяВходящаяЕГАИС
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Ссылка = &Ссылка И 
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ПометкаУдаления = ЛОЖЬ
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		
		ПараметрыЗапроса = ПараметрыОбъектов[Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	Если Выборка.ФорматОбмена = 4 Тогда
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4;
		ФорматОбмена = 4;
	Иначе
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН;
		ФорматОбмена = 3;
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ИдентификаторФСРАР", Выборка.ИдентификаторФСРАР);
	ДанныеДляВыгрузки.Вставить("Объект",             ДокументСсылка);
	ДанныеДляВыгрузки.Вставить("ШапкаДокумента",     Выборка);
	
	СообщенияXML = ИнтеграцияЕГАИС.СформироватьСообщенияXML(ВидСообщения, ДанныеДляВыгрузки, ФорматОбмена);
	
	Возврат СообщенияXML;
	
КонецФункции

Функция ЗапросНаОтменуПроведенияXML(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ХозОперация,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Ссылка,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ИзменениеПраваСобственности КАК ИзменениеПраваСобственности,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Грузополучатель КАК ОрганизацияЕГАИС,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Грузополучатель.Код КАК ИдентификаторФСРАР,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.РегистрационныйНомер КАК РегистрационныйНомер,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Идентификатор КАК Идентификатор,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Номер,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Дата,
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ДатаВходящая КАК ДатаВходящая,
	|	ВЫРАЗИТЬ(ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Комментарий КАК Строка(500)) КАК Комментарий
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС КАК ТоварноТранспортнаяНакладнаяВходящаяЕГАИС
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Ссылка = &Ссылка И 
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ПометкаУдаления = ЛОЖЬ
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТТН;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		
		ПараметрыЗапроса = ПараметрыОбъектов[ВидСообщения];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ИдентификаторФСРАР", Выборка.ИдентификаторФСРАР);
	ДанныеДляВыгрузки.Вставить("Объект",             ДокументСсылка);
	ДанныеДляВыгрузки.Вставить("ШапкаДокумента",     Выборка);
	
	СообщенияXML = ИнтеграцияЕГАИС.СформироватьСообщенияXML(ВидСообщения, ДанныеДляВыгрузки, 3);
	
	Возврат СообщенияXML;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("ДатаВходящая");
	ОбязательныеРеквизиты.Добавить("НомерВходящий");
	ОбязательныеРеквизиты.Добавить("ИдентификаторТТН");
	
	Если НЕ ПравоПользователя("ПроведениеНезаполненныхДокументов", Объект) Тогда
		ОбязательныеРеквизиты.Добавить("Товары");
	КонецЕсли; 
	
	ОбязательныеРеквизиты.Добавить("Товары.АлкогольнаяПродукция");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Уникальные поля таблицы товаров
	УникальныеТовары=Новый Массив();
	УникальныеТовары.Добавить("ИдентификаторСтроки");
	
	// Структура уникальных реквизитов табличных частей
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Товары", УникальныеТовары);
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПараметрыДействия=Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", Объект.Товары.Количество() > 0);
	ПараметрыДействия.Вставить("НетНоменклатуры", Истина);
	ПараметрыДействия.Вставить("ОрганизацияЕГАИС", Объект.Грузополучатель);
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДокументОснованиеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Прописать проверку соответствия реквизитов объекта выбранной хоз.операции
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Количество" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыКоличествоПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Строка.Сумма = Строка.Цена * Строка.Количество;
	
КонецПроцедуры // ТоварыКоличествоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыЦенаПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Строка.Сумма = Строка.Цена * Строка.Количество;
		
КонецПроцедуры // ТоварыЦенаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСуммаПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если Строка.Количество = 0 Тогда
		Строка.Цена = Строка.Сумма;
		Строка.Сумма = 0;
	Иначе
		Строка.Цена = Окр(Строка.Сумма/Строка.Количество, 2);
	КонецЕсли;

КонецПроцедуры // ТоварыСуммаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Алкогольная продукция" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ТоварыАлкогольнаяПродукцияПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.АлкогольнаяПродукцияПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыАлкогольнаяПродукцияПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОВЕДЕНИЕ 

Функция ТекстЗапросаОстаткиАлкогольнойПродукцииЕГАИС(ТекстыЗапроса)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&ДатаРегистрации                   КАК Период,
	|	ТаблицаТовары.Ссылка               КАК Регистратор,
	|	&ОрганизацияЕГАИС                  КАК ОрганизацияЕГАИС,
	|	&ХозОперация                       КАК ХозОперация,
	|	ТаблицаТовары.НомерСтроки          КАК НомерСтроки,
	|	ТаблицаТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ТаблицаТовары.Справка2             КАК Справка2,
	|	ТаблицаТовары.Количество           КАК Количество
	//|	ВЫБОР
	//|		КОГДА ТаблицаТовары.АлкогольнаяПродукция.Упакована ТОГДА
	//|			ТаблицаТовары.Количество
	//|		ИНАЧЕ
	//|			ТаблицаТовары.Количество*10
	//|	КОНЕЦ					           КАК Количество
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка И 
	|	&ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.ВидыСтатусовОбработкиЕГАИС.Подтвержден)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&ДатаРегистрации                   КАК Период,
	|	ТаблицаТовары.Ссылка               КАК Регистратор,
	|	&ОрганизацияЕГАИС                  КАК ОрганизацияЕГАИС,
	|	&ХозОперация                       КАК ХозОперация,
	|	ТаблицаТовары.НомерСтроки          КАК НомерСтроки,
	|	ТаблицаТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ТаблицаТовары.Справка2             КАК Справка2,
	|	ТаблицаТовары.КоличествоФакт КАК Количество
	//|	ВЫБОР
	//|		КОГДА ТаблицаТовары.АлкогольнаяПродукция.Упакована ТОГДА
	//|			ТаблицаТовары.КоличествоФакт
	//|		ИНАЧЕ
	//|			ТаблицаТовары.КоличествоФакт*10
	//|	КОНЕЦ					           КАК Количество
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка И 
	|	&ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.ВидыСтатусовОбработкиЕГАИС.ПодтвержденСРасхождениями)
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаТовары.НомерСтроки";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, "ОстаткиАлкогольнойПродукцииЕГАИС");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОстаткиМарокЕГАИС(ТекстыЗапроса)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&ДатаРегистрации                       КАК Период,
	|	ТаблицаМарки.Ссылка                    КАК Регистратор,
	|	&ОрганизацияЕГАИС                      КАК ОрганизацияЕГАИС,
	|	&ХозОперация                           КАК ХозОперация,
	|	ТаблицаМарки.НомерСтроки               КАК НомерСтроки,
	|	ТаблицаМарки.КодМарки                  КАК КодМарки,
	|	ТаблицаТовары.Справка2                 КАК Справка2,
	|	1                                      КАК Количество
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Марки КАК ТаблицаМарки
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Товары КАК ТаблицаТовары
	|ПО
	|	ТаблицаМарки.Ссылка = ТаблицаТовары.Ссылка И 
	|	ТаблицаМарки.ИдентификаторСтроки = ТаблицаТовары.ИдентификаторСтроки И 
	|	(НЕ ТаблицаМарки.КодМарки = """")
	|ГДЕ
	|	ТаблицаМарки.Ссылка = &Ссылка И 
	|	&ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.ВидыСтатусовОбработкиЕГАИС.Подтвержден)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&ДатаРегистрации                       КАК Период,
	|	ТаблицаМарки.Ссылка                    КАК Регистратор,
	|	&ОрганизацияЕГАИС                      КАК ОрганизацияЕГАИС,
	|	&ХозОперация                           КАК ХозОперация,
	|	ТаблицаМарки.НомерСтроки               КАК НомерСтроки,
	|	ТаблицаМарки.КодМарки                  КАК КодМарки,
	|	ТаблицаТовары.Справка2                 КАК Справка2,
	|	1                                      КАК Количество
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Марки КАК ТаблицаМарки
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Товары КАК ТаблицаТовары
	|ПО
	|	ТаблицаМарки.Ссылка = ТаблицаТовары.Ссылка И 
	|	ТаблицаМарки.ИдентификаторСтроки = ТаблицаТовары.ИдентификаторСтроки И 
	|	(НЕ ТаблицаМарки.КодМарки = """")
	|ГДЕ
	|	ТаблицаМарки.Ссылка = &Ссылка И 
	|	&ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.ВидыСтатусовОбработкиЕГАИС.ПодтвержденСРасхождениями) И 
	|	ТаблицаМарки.Отвергнута = ЛОЖЬ
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаМарки.НомерСтроки
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, "ОстаткиМарокЕГАИС");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаОстаткиАлкогольнойПродукцииЕГАИС(ТекстыЗапроса);
	ТекстЗапросаОстаткиМарокЕГАИС(ТекстыЗапроса);
	
	ИнтеграцияЕГАИС.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеШапки.Дата                  КАК Период,
	|	ДанныеШапки.Ссылка                КАК Ссылка,
	|	ДанныеШапки.Грузополучатель       КАК ОрганизацияЕГАИС,
	|	ДанныеШапки.ДатаРегистрации       КАК ДатаРегистрации,
	|	ДанныеШапки.ХозОперация           КАК ХозОперация,
	|	СтатусыДокументовЕГАИС.ВидСтатуса КАК ВидСтатуса
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС КАК ДанныеШапки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|ПО
	|	СтатусыДокументовЕГАИС.Документ = ДанныеШапки.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",               Реквизиты.Период);
	Запрос.УстановитьПараметр("Ссылка",               Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("ВидСтатуса",           Реквизиты.ВидСтатуса);
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС",     Реквизиты.ОрганизацияЕГАИС);
	Запрос.УстановитьПараметр("ДатаРегистрации",      ?(ЗначениеЗаполнено(Реквизиты.ДатаРегистрации), Реквизиты.ДатаРегистрации, Реквизиты.Период));
	Запрос.УстановитьПараметр("ХозОперация",          Реквизиты.ХозОперация);
	Запрос.УстановитьПараметр("ВидыСтатусовДвижений", ВидыСтатусовДвижений());
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью команд заполнения объекта
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть не доступны в зависимости от параметров объекта
	ДоступностьКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ДоступностьКоманд;
	
КонецФункции // ПолучитьДоступностьКомандЗаполнения()

#Область ДействияПриОбменеЕГАИС

// Статус после подготовки к передаче данных.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС - Ссылка на документ.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - ВидСообщения ЕГАИС.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения) Экспорт
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТН
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия2
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия3
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия4 Тогда
		ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктПодтвержденияКПередаче;
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктРазногласий
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия2
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия3
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия4 Тогда
		ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийКПередаче;
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН 
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4 Тогда
		ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктОтказаКПередаче;
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТТН Тогда
		ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(ДокументСсылка);
		Если ТекущееСостояние.ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен
			Или ТекущееСостояние.ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуАктаОтказаОшибка Тогда
			ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуАктаОтказаКПередаче;
		Иначе
			ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияКПередаче;
		КонецЕсли;
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыКПередаче(ДокументСсылка, ВидСтатуса);
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Статус после передачи данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * СтатусОбработки - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки) Экспорт
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТН
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия2
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия3
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия4 Тогда
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		
		ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктПодтвержденияПереданВУТМ;
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПолученЕГАИС);
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПроведенЕГАИС);
		
		ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктПодтвержденияОшибка;
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОформитеПоступление);
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеАктПодтверждения);
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусовБазовыйПроцесс);
		
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктРазногласий
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия2
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия3
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия4 Тогда
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		
		ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийПереданВУТМ;
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПолученЕГАИС);
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПроведенЕГАИС);
		
		ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи;
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОформитеПоступление);
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеАктПодтверждения);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусовБазовыйПроцесс);
		
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН 
		 Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4 Тогда
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		
		ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктОтказаПереданВУТМ;
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПолученЕГАИС);
		//ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПроведенЕГАИС);
		
		ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктОтказаОшибка;
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтНакладной);
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусовБазовыйПроцесс);
		
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТТН Тогда
		
		ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(ДокументСсылка);
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		
		Если ТекущееСостояние.ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуАктаОтказаКПередаче Тогда
			ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуАктаОтказаПереданВУТМ;
		Иначе
			ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПереданВУТМ;
		КонецЕсли;
		
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПолученЕГАИС);
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПроведенЕГАИС);
		
		Если ТекущееСостояние.ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуАктаОтказаКПередаче Тогда
			ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуАктаОтказаОшибка;
		Иначе
			ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОшибка;
		КонецЕсли;
		
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения);
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусовБазовыйПроцесс);
		
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Статус после получения данных из ЕГАИС.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС - Документ, для которого требуется обновить статус.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения обмена с ЕГАИС.
//  ДополнительныеПараметры - Неопределено, Структура со свойствами:
//   * СтатусОбработки - Перечисление.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения.
//   * ВидСообщенияКвитанции - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения, на которую получена квитанция.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ВидыСтатусовАктПодтвержденияТТН = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
	ВидыСтатусовАктПодтвержденияТТН.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.Подтвержден;
	ВидыСтатусовАктПодтвержденияТТН.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктПодтвержденияОбрабатываетсяЕГАИС;
	ВидыСтатусовАктПодтвержденияТТН.ОтменаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОтмененПоставщиком;
	ВидыСтатусовАктПодтвержденияТТН.ОшибкаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктПодтвержденияОшибка;
	ВидыСтатусовАктПодтвержденияТТН.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктПодтвержденияОшибка;
	ВидыСтатусовАктПодтвержденияТТН.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОформитеПоступление);
	ВидыСтатусовАктПодтвержденияТТН.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеАктПодтверждения);
	ВидыСтатусовАктПодтвержденияТТН.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
	ВидыСтатусовАктПодтвержденияТТН.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется);
	ВидыСтатусовАктПодтвержденияТТН.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения);
	ВидыСтатусовАктПодтвержденияТТН.УведомлениеОРегистрацииДвижения = Ложь;
	
	ВидыСтатусовАктРасхожденияТТН = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
	ВидыСтатусовАктРасхожденияТТН.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПодтвержденСРасхождениями;
	ВидыСтатусовАктРасхожденияТТН.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийОбрабатываетсяЕГАИС;
	ВидыСтатусовАктРасхожденияТТН.ОтменаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОтмененПоставщиком;
	//Акт расхождения отменен поставщиком
	ВидыСтатусовАктРасхожденияТТН.ОшибкаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийОшибка;
	ВидыСтатусовАктРасхожденияТТН.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийОшибка;
	ВидыСтатусовАктРасхожденияТТН.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОформитеПоступление);
	ВидыСтатусовАктРасхожденияТТН.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеАктПодтверждения);
	ВидыСтатусовАктРасхожденияТТН.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
	ВидыСтатусовАктРасхожденияТТН.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется);
	ВидыСтатусовАктРасхожденияТТН.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения);
	ВидыСтатусовАктРасхожденияТТН.ОтменаПроведенияДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения);
	//ВидыСтатусовАктРасхожденияТТН.ОтменаПроведенияДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОформитеПоступление);
	//ВидыСтатусовАктРасхожденияТТН.ОтменаПроведенияДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеАктПодтверждения);
	//ВидыСтатусовАктРасхожденияТТН.ОтменаПроведенияДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтНакладной);
	
	ВидыСтатусовАктРасхожденияТТН.УведомлениеОРегистрацииДвижения = Ложь;
	
	ВидыСтатусовАктОтказаТТН = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
	ВидыСтатусовАктОтказаТТН.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен;
	ВидыСтатусовАктОтказаТТН.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктОтказаОбрабатываетсяЕГАИС;
	ВидыСтатусовАктОтказаТТН.ОтменаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен;
	ВидыСтатусовАктОтказаТТН.ОшибкаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктОтказаОшибка;
	ВидыСтатусовАктОтказаТТН.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктОтказаОшибка;
	ВидыСтатусовАктОтказаТТН.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтНакладной);
	ВидыСтатусовАктОтказаТТН.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
	ВидыСтатусовАктОтказаТТН.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется);
	ВидыСтатусовАктОтказаТТН.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения);
	ВидыСтатусовАктОтказаТТН.ОтменаПроведенияДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется);
	ВидыСтатусовАктОтказаТТН.ОтменаПроведенияДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения);
	ВидыСтатусовАктОтказаТТН.КвитанцияВыполнена              = Ложь;
	ВидыСтатусовАктОтказаТТН.УведомлениеОРегистрацииДвижения = Ложь;
	
	ВидыСтатусовЗапросНаОтменуПроведения = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
	ВидыСтатусовЗапросНаОтменуПроведения.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПринятИзЕГАИС;
	ВидыСтатусовЗапросНаОтменуПроведения.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОбрабатываетсяЕГАИС;
	ВидыСтатусовЗапросНаОтменуПроведения.ОтменаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПринятИзЕГАИС;
	ВидыСтатусовЗапросНаОтменуПроведения.ОшибкаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОшибка;
	ВидыСтатусовЗапросНаОтменуПроведения.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОшибка;
	ВидыСтатусовЗапросНаОтменуПроведения.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения);
	ВидыСтатусовЗапросНаОтменуПроведения.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
	ВидыСтатусовЗапросНаОтменуПроведения.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОформитеПоступление);
	ВидыСтатусовЗапросНаОтменуПроведения.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеАктПодтверждения);
	ВидыСтатусовЗапросНаОтменуПроведения.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтНакладной);
	ВидыСтатусовЗапросНаОтменуПроведения.ОтменаПроведенияДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОформитеПоступление);
	ВидыСтатусовЗапросНаОтменуПроведения.ОтменаПроведенияДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеАктПодтверждения);
	ВидыСтатусовЗапросНаОтменуПроведения.ОтменаПроведенияДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтНакладной);
	ВидыСтатусовЗапросНаОтменуПроведения.УведомлениеОРегистрацииДвижения = Ложь;
	
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.Подтвержден;
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОбрабатываетсяЕГАИС;
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ.ОшибкаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОшибка;
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОшибка;
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения);
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется);
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения);
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ.УведомлениеОРегистрацииДвижения = Ложь;
	
	ВыполнитьРасчетТекущегоСостояния = Истина;
	Если ДополнительныеПараметры <> Неопределено
		И ДополнительныеПараметры.Свойство("ТекущееСостояние")
		И ДополнительныеПараметры.ТекущееСостояние <> Неопределено Тогда
		ВыполнитьРасчетТекущегоСостояния = ДополнительныеПараметры.ТекущееСостояние;
	КонецЕсли;
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТТН ИЛИ 
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия2 ИЛИ 
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия3 ИЛИ 
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия4 ИЛИ 
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияОРегистрацииФорм2 Тогда
		
		ВидыСтатусов = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		ВидыСтатусов.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПринятИзЕГАИС;
		ВидыСтатусов.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОформитеПоступление);
		ВидыСтатусов.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеАктПодтверждения);
		ВидыСтатусов.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтНакладной);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(
			ДокументСсылка,
			Перечисления.СтатусыОбработкиСообщенийЕГАИС.ПринятИзЕГАИС,
			ВидыСтатусов);
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияАктаРасхожденийОтказ Тогда
		
		ВидыСтатусов = ВидыСтатусовАктРасхожденияТТН;
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыПриПолученииКвитанции(
			ДокументСсылка,
			"КвитанцияВыполнена", Перечисления.СтатусыОбработкиСообщенийЕГАИС.ДокументОтменен,
			ВидыСтатусов, Ложь);
		
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияАктаРасхожденийПодтверждение Тогда
		
		ВидыСтатусов = ВидыСтатусовАктРасхожденияТТН;
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыПриПолученииКвитанции(
			ДокументСсылка,
			"КвитанцияВыполнена", Перечисления.СтатусыОбработкиСообщенийЕГАИС.ДокументПроведен,
			ВидыСтатусов, Ложь);
			
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ОтказОтменыПроведенияТТН Тогда
		
		ВидыСтатусов = ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ;
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыПриПолученииКвитанции(
			ДокументСсылка,
			"КвитанцияВыполнена", Перечисления.СтатусыОбработкиСообщенийЕГАИС.ДокументПроведен,
			ВидыСтатусов, Ложь);
			
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН Или 
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4 Тогда
		
		ВидыСтатусов = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		ВидыСтатусов.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОтмененПоставщиком;
		
		Если ДополнительныеПараметры.Свойство("ТекущееСостояние")
			И ДополнительныеПараметры.ТекущееСостояние <> Неопределено Тогда
			ТекущееСостояние = ДополнительныеПараметры.ТекущееСостояние;
		Иначе
			ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(ДокументСсылка);
		КонецЕсли;
		
		Если ТекущееСостояние.ВидСтатуса <> Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен Тогда
			ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(
			ДокументСсылка,
			Перечисления.СтатусыОбработкиСообщенийЕГАИС.ПринятИзЕГАИС,
			ВидыСтатусов);
		КонецЕсли;
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияДоставлена Тогда
		
		ВидыСтатусов = Неопределено;
		Если ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТН ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия2 ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия3 ИЛИ
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия4 Тогда
			
			ВидыСтатусов = ВидыСтатусовАктПодтвержденияТТН;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктРазногласий ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия2 ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия3 ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия4 Тогда
			
			ВидыСтатусов = ВидыСтатусовАктРасхожденияТТН;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4 Тогда
			
			ВидыСтатусов = ВидыСтатусовАктОтказаТТН;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТТН Тогда
			
			ВидыСтатусов = ВидыСтатусовЗапросНаОтменуПроведения;
			
			ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(ДокументСсылка);
			Если ТекущееСостояние.ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуАктаОтказаПереданВУТМ Тогда
				ВидыСтатусов.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуАктаОтказаОбрабатываетсяЕГАИС;
				ВидыСтатусов.ОшибкаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуАктаОтказаОшибка;
				ВидыСтатусов.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуАктаОтказаОшибка;
			КонецЕсли;
			
		Иначе
			ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
		КонецЕсли;
		
		Если ВидыСтатусов <> Неопределено Тогда
			ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыПриПолученииКвитанции(
				ДокументСсылка,
				"КвитанцияДоставлена", ДополнительныеПараметры.СтатусОбработки,
				ВидыСтатусов, ВыполнитьРасчетТекущегоСостояния);
		КонецЕсли;
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияВыполнена Тогда
		
		ВидыСтатусов = Неопределено;
		Если ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТН ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия2 ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия3 ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия4 Тогда
			
			ВидыСтатусов = ВидыСтатусовАктПодтвержденияТТН;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктРазногласий ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия2 ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия3 ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия4 Тогда
			
			ВидыСтатусов = ВидыСтатусовАктРасхожденияТТН;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН Или 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4 Тогда
			
			ВидыСтатусов = ВидыСтатусовАктОтказаТТН;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТТН Тогда
			
			ВидыСтатусов = ВидыСтатусовЗапросНаОтменуПроведения;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Неопределено
			И ДополнительныеПараметры.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийЕГАИС.ДокументРаспроведен Тогда
			
			ВидыСтатусовРаспроведение = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
			ВидыСтатусовРаспроведение.ОтменаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОтмененПоставщиком;
			
			ВидыСтатусов = ВидыСтатусовРаспроведение;
			
		Иначе
			ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
		КонецЕсли;
		
		Если ВидыСтатусов <> Неопределено Тогда
			ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыПриПолученииКвитанции(
				ДокументСсылка,
				"КвитанцияВыполнена", ДополнительныеПараметры.СтатусОбработки,
				ВидыСтатусов, ВыполнитьРасчетТекущегоСостояния);
		КонецЕсли;
		
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Обновить статус после подготовки к передаче данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(ДокументСсылка, ПараметрыОбновления, ДополнительныеПараметры);
	
	//Запрос = Новый Запрос;
	//Запрос.
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обновить статус после передачи данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обновить статус после получения данных из ЕГАИС.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС - Документ, для которого требуется обновить статус.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения обмена с ЕГАИС.
//  ДополнительныеПараметры - Неопределено, Структура со свойствами:
//   * СтатусОбработки - Перечисление.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения.
//   * ВидСообщенияКвитанции - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения, на которую получена квитанция.
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Получить последовательность операций в течении жизненного цикла документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС - Документ, для которого требуется обновить статус.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. функцию ИнтеграцияЕГАИС.ПустаяТаблицаПоследовательностьОпераций().
//
Функция ПоследовательностьОпераций(ДокументСсылка) Экспорт
	
	Таблица = ИнтеграцияЕГАИС.ПустаяТаблицаПоследовательностьОпераций();
	
	Исходящее = Перечисления.ВходящееИсходящееСобытие.Исходящее;
	Входящее  = Перечисления.ВходящееИсходящееСобытие.Входящее;
	
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0,  Входящее,  Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия3, ДокументСсылка);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0,  Входящее,  Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия4, ДокументСсылка);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0,  Входящее,  Перечисления.ВидыОбъектовЕГАИС.КвитанцияОРегистрацииФорм2);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0,  Входящее,  Перечисления.ВидыОбъектовЕГАИС.ИсторияТТН);
	
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0,  Исходящее, Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия3, ДокументСсылка);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0,  Исходящее, Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия4, ДокументСсылка);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 1,  Исходящее, Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН,,, Ложь);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 1,  Исходящее, Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4,,, Ложь);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 2,  Исходящее, Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТТН, ДокументСсылка);
	
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 2,  Входящее,  Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 2,  Входящее,  Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4);
	
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 2,  Исходящее, Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия3, ДокументСсылка);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 2,  Исходящее, Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия4, ДокументСсылка);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 2,  Исходящее, Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТТН, ДокументСсылка);
	
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 3,  Исходящее, Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия3);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 3,  Исходящее, Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия4);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 3,  Входящее, Перечисления.ВидыОбъектовЕГАИС.КвитанцияАктаРасхождений);
	
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 31, Входящее, Перечисления.ВидыОбъектовЕГАИС.КвитанцияАктаРасхожденийОтказ);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 32, Входящее, Перечисления.ВидыОбъектовЕГАИС.КвитанцияАктаРасхожденийПодтверждение);
	
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 31, Входящее, Перечисления.ВидыОбъектовЕГАИС.ОтказОтменыПроведенияТТН);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 32, Входящее, Перечисления.ВидыОбъектовЕГАИС.ПодтверждениеОтменыПроведенияТТН);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 32, Исходящее, Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТТН, ДокументСсылка);
	
	Возврат Таблица;
	
КонецФункции

// Обработчик изменения статуса документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Документ.
//  ПредыдущийСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиЕГАИС - Предыдущий статус.
//  НовыйСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиЕГАИС - Предыдущий статус.
//  ПараметрыОбновленияСтатуса - Структура - см. функцию ИнтеграцияЕГАИС.ПараметрыОбновленияСтатуса().
//
Процедура ПриИзмененииСтатусаДокумента(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус, ПараметрыОбновленияСтатуса) Экспорт
	
	ВидыСтатусовДвижений = ВидыСтатусовДвижений();
	
	ДобавитьДвижения = ИнтеграцияЕГАИС.СтатусТребуетДобавленияДвижений(ВидыСтатусовДвижений, ПредыдущийСтатус, НовыйСтатус);
	УдалитьДвижения = ИнтеграцияЕГАИС.СтатусТребуетУдаленияДвижений(ВидыСтатусовДвижений, ПредыдущийСтатус, НовыйСтатус);
	
	Если ПараметрыОбновленияСтатуса.ОбновлятьДвижения
		И (ДобавитьДвижения Или УдалитьДвижения) Тогда
		
		ДополнительныеСвойстваДляПроведения = Новый Структура;
		ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, ДополнительныеСвойстваДляПроведения);
		
		ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойстваДляПроведения);
		
		НаборЗаписей = РегистрыНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписей.Загрузить(ДополнительныеСвойстваДляПроведения.ТаблицыДляДвижений["ОстаткиАлкогольнойПродукцииЕГАИС"]);
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыНакопления.ОстаткиМарокЕГАИС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписей.Загрузить(ДополнительныеСвойстваДляПроведения.ТаблицыДляДвижений["ОстаткиМарокЕГАИС"]);
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	НастройкиОрганизации = Справочники.КлассификаторОрганизацийЕГАИС.ПолучитьНастройкиОрганизации(ДокументСсылка.Грузополучатель);
	Если ДобавитьДвижения И НастройкиОрганизации.АвтоматическоеПеремещениеВТЗ И 
		(НовыйСтатус = Перечисления.ВидыСтатусовОбработкиЕГАИС.Подтвержден ИЛИ 
		НовыйСтатус = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПодтвержденСРасхождениями) Тогда
		
		СформироватьПеремещениеВТорговыйЗалЕГАИС(ДокументСсылка);
		
	КонецЕсли;
	
	Если ДобавитьДвижения И (НЕ НастройкиОрганизации.ИспользоватьПартионныйУчет) И 
		(НовыйСтатус = Перечисления.ВидыСтатусовОбработкиЕГАИС.Подтвержден ИЛИ 
		НовыйСтатус = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПодтвержденСРасхождениями) Тогда
		
		СформироватьАктПривязкиМарокЕГАИС(ДокументСсылка);
		
	КонецЕсли;
	
	//РассчитатьСтатусОформления(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус);
	
КонецПроцедуры

#КонецОбласти

#Область Статусы

// Возвращает статусы ошибок.
//
// Возвращаемое значение:
//  Массив - Статусы ошибок.
//
Функция ВидыСтатусовОшибки() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.АктОтказаОшибка);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийПодтверждениеОшибка);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийОтказОшибка);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПодтверждениеОшибка);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОтказОшибка);
	
	Возврат ВидыСтатусов;
	
КонецФункции

// Возвращает конечные статусы.
//
// Возвращаемое значение:
//  Массив - Конечные статусы.
//
Функция КонечныеВидыСтатусов() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ОтмененКлиентом);
	
	Возврат ВидыСтатусов;
	
КонецФункции

// Возвращает запрос для получения статуса оформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Документ основание.
// 
// Возвращаемое значение:
//  Запрос - Запрос для получения статуса оформления.
//
Функция ЗапросСтатусаОформления(ДокументОснование) Экспорт
	
	Запрос = ИнтеграцияЕГАИС.ЗапросСтатусаОформленияДействияНеОпределены();
	Запрос.УстановитьПараметр("КонечныеВидыСтатусовТоварноТранспортнаяНакладнаяВходящаяЕГАИС", КонечныеВидыСтатусов());
	
	Возврат Запрос;
	
КонецФункции

// Возвращает статусы движений.
//
// Возвращаемое значение:
//  Массив - Статусы.
//
Функция ВидыСтатусовДвижений() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.Подтвержден);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ПодтвержденСРасхождениями);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияКПередаче);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПереданВУТМ);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОбрабатываетсяЕГАИС);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОшибка);
	
	Возврат ВидыСтатусов;
	
КонецФункции

#КонецОбласти

Функция СообщениеКПередачеXML(ДокументСсылка, ДальнейшееДействие, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеАктПодтверждения Тогда
		
		Возврат АктПодтвержденияXML(ДокументСсылка, ДополнительныеПараметры);
		
	ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтНакладной Тогда
		
		Возврат АктОтказаXML(ДокументСсылка);
		
	ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения Тогда
		
		Возврат ЗапросНаОтменуПроведенияXML(ДокументСсылка);
		
	КонецЕсли;
	
КонецФункции

#КонецЕсли