// Модуль менеджера справочника "Номенклатура"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
	////////////////////////////////////////////////////////////////////////////////
	// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
	
// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт

// Выполним заполнение необходимых справочников
Справочники.КлассификаторЕдиницИзмерения.ВыполнитьНачальноеЗаполнение();
Справочники.ТипыНоменклатуры.ВыполнитьНачальноеЗаполнение();

// !!!_Переход на ставку НДС 20%
// Делаем для корректного заполнения ставок НДС
Справочники.СтавкиНДС.ВыполнитьНачальноеЗаполнение();

// предопределенный - "Предоплата"

ДанныеЗаполнения = Новый Структура;
ДанныеЗаполнения.Вставить("НовоеНаименование",            "Предоплата");																	// Имя заполняемой номенклатуры
ДанныеЗаполнения.Вставить("НовыйКод",                     "00000001");																		// Код заполняемой номенклатуры
ДанныеЗаполнения.Вставить("НовыйТипНоменклатуры",         Справочники.ТипыНоменклатуры.Услуга);												// Тип заполняемой номенклатуры
ДанныеЗаполнения.Вставить("НовыйВидНоменклатуры",         Справочники.ТипыНоменклатуры.Услуга.ВидНоменклатуры); 							// Вид заполняемой номенклатуры
ДанныеЗаполнения.Вставить("НоваяБазоваяЕдиницаИзмерения", Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("-",Истина).Ссылка);	// Базовая единица измерения заполняемой номенклатуры
ДанныеЗаполнения.Вставить("НоваяСтавкаНДС",               Справочники.СтавкиНДС.ОсновнаяСтавкаНДС);  										// Ставка НДС заполняемой номенклатуры
ДанныеЗаполнения.Вставить("НовыйАвтор",                   Пользователи.НайтиПоИмени("Администратор"));										// Автор номенклатуры
ДанныеЗаполнения.Вставить("НоваяДатаСоздания",            ТекущаяДата());																	// Дата создания номенклатуры
ДанныеЗаполнения.Вставить("ВесЕИ",                        0);																				// Вес единицы измерения
ДанныеЗаполнения.Вставить("ТочностьЕИ",                   0);																				// Точность единицы измерения
ДанныеЗаполнения.Вставить("НовыйАртикул",				  "Предоплата");				
ЗаполнитьЭлемент(ДанныеЗаполнения);

// предопределенный - "КомиссионноеВознаграждение"

ДанныеЗаполнения = Новый Структура;
ДанныеЗаполнения.Вставить("НовоеНаименование",            "КомиссионноеВознаграждение");													// Имя заполняемой номенклатуры
ДанныеЗаполнения.Вставить("НовыйКод",                     "00000002");																		// Код заполняемой номенклатуры
ДанныеЗаполнения.Вставить("НовыйТипНоменклатуры",         Справочники.ТипыНоменклатуры.Услуга);												// Тип заполняемой номенклатуры
ДанныеЗаполнения.Вставить("НовыйВидНоменклатуры",         Справочники.ТипыНоменклатуры.Услуга.ВидНоменклатуры); 							// Вид заполняемой номенклатуры
ДанныеЗаполнения.Вставить("НоваяБазоваяЕдиницаИзмерения", Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("-",Истина).Ссылка);	// Базовая единица измерения заполняемой номенклатуры
ДанныеЗаполнения.Вставить("НоваяСтавкаНДС",               Справочники.СтавкиНДС.ОсновнаяСтавкаНДС);  										// Ставка НДС заполняемой номенклатуры
ДанныеЗаполнения.Вставить("НовыйАвтор",                   Пользователи.НайтиПоИмени("Администратор"));										// Автор номенклатуры
ДанныеЗаполнения.Вставить("НоваяДатаСоздания",            ТекущаяДата());																	// Дата создания номенклатуры
ДанныеЗаполнения.Вставить("ВесЕИ",                        0);																				// Вес единицы измерения
ДанныеЗаполнения.Вставить("ТочностьЕИ",                   0);																				// Точность единицы измерения
ДанныеЗаполнения.Вставить("НовыйАртикул",    			  "КомиссионноеВознаграждение");
ЗаполнитьЭлемент(ДанныеЗаполнения);

КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

// Процедура заполнения элемента справочника
//
// Параметры:
//
// ДанныеЗаполнения 				- Структура				- содержит данные заполнения:
//  * НовоеНаименование 			- Строка				- Имя заполняемой номенклатуры
//  * НовыйКод 						- Строка 				- Код заполняемой номенклатуры
//  * НовыйТипНоменклатуры 			- СправочникСсылка 		- Тип заполняемой номенклатуры
//  * НовыйВидНоменклатуры 			- ПеречислениеСсылка 	- Вид заполняемой номенклатуры
//  * НоваяБазоваяЕдиницаИзмерения	- СправочникСсылка 		- Базовая единица измерения заполняемой номенклатуры
//  * НоваяСтавкаНДС 				- СправочникСсылка		- Ставка НДС заполняемой номенклатуры
//  * ВесЕИ 						- Число 				- Вес единицы измерения
//  * ТочностьЕИ 					- Число					- Точность единицы измерения.
//
Процедура ЗаполнитьЭлемент(ДанныеЗаполнения)

ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
Если НЕ ЗначениеЗаполнено(ВалютаРегл) Тогда
	ВалютаРегл = Справочники.Валюты.НайтиПоКоду("643");
КонецЕсли;

Попытка
	ЭлементНоменклатуры = Справочники.Номенклатура[ДанныеЗаполнения.НовоеНаименование];
Исключение
	ЭлементНоменклатуры = Справочники.Номенклатура.ПустаяСсылка();
КонецПопытки;

Если ЭлементНоменклатуры.Пустая() Тогда
	ЭлементНоменклатуры = Справочники.Номенклатура.СоздатьЭлемент();
Иначе
	ЭлементНоменклатуры = ЭлементНоменклатуры.ПолучитьОбъект();
КонецЕсли;

Если НЕ ЗначениеЗаполнено(ЭлементНоменклатуры.Код) Тогда
	ЭлементНоменклатуры.Код = ДанныеЗаполнения.НовыйКод;
КонецЕсли;
Если НЕ ЗначениеЗаполнено(ЭлементНоменклатуры.Наименование) Тогда
	ЭлементНоменклатуры.Наименование = ДанныеЗаполнения.НовоеНаименование;
КонецЕсли;
Если НЕ ЗначениеЗаполнено(ЭлементНоменклатуры.НаименованиеИностранное) Тогда
	ЭлементНоменклатуры.НаименованиеИностранное = ДанныеЗаполнения.НовоеНаименование;
КонецЕсли;
Если НЕ ЗначениеЗаполнено(ЭлементНоменклатуры.НаименованиеПолное) Тогда
	ЭлементНоменклатуры.НаименованиеПолное = ДанныеЗаполнения.НовоеНаименование;
КонецЕсли;
Если НЕ ЗначениеЗаполнено(ЭлементНоменклатуры.ТипНоменклатуры) Тогда
	ЭлементНоменклатуры.ТипНоменклатуры = ДанныеЗаполнения.НовыйТипНоменклатуры;
КонецЕсли;
Если НЕ ЗначениеЗаполнено(ЭлементНоменклатуры.ВидНоменклатуры) Тогда
	ЭлементНоменклатуры.ВидНоменклатуры = ДанныеЗаполнения.НовыйВидНоменклатуры;
КонецЕсли;
Если НЕ ЗначениеЗаполнено(ЭлементНоменклатуры.БазоваяЕдиницаИзмерения) Тогда
	ЭлементНоменклатуры.БазоваяЕдиницаИзмерения = ДанныеЗаполнения.НоваяБазоваяЕдиницаИзмерения;
КонецЕсли;
Если НЕ ЗначениеЗаполнено(ЭлементНоменклатуры.СтавкаНДС) Тогда
	ЭлементНоменклатуры.СтавкаНДС = ДанныеЗаполнения.НоваяСтавкаНДС;
КонецЕсли;
Если НЕ ЗначениеЗаполнено(ЭлементНоменклатуры.Артикул) Тогда
	ЭлементНоменклатуры.Артикул = ДанныеЗаполнения.НовыйАртикул;
КонецЕсли;
Если НЕ ЗначениеЗаполнено(ЭлементНоменклатуры.ВалютаУчета) Тогда
	ЭлементНоменклатуры.ВалютаУчета = ВалютаРегл;
КонецЕсли;
Если ЭлементНоменклатуры.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
	Если НЕ ЗначениеЗаполнено(ЭлементНоменклатуры.СпособРаспределенияДопРасходов) Тогда
		ЭлементНоменклатуры.СпособРаспределенияДопРасходов=Перечисления.СпособыРаспределенияДопРасходов.НаДоходыИРасходы;
	КонецЕсли;
КонецЕсли;
Если ЭлементНоменклатуры.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга
	И ЭлементНоменклатуры.СпособРаспределенияДопРасходов=Перечисления.СпособыРаспределенияДопРасходов.НаДоходыИРасходы Тогда
	Если НЕ ЗначениеЗаполнено(ЭлементНоменклатуры.СтатьяДопРасходов) Тогда
		ЭлементНоменклатуры.СтатьяДопРасходов=Справочники.СтатьиДоходовИРасходов.ПрочиеЗатраты;
	КонецЕсли;
КонецЕсли;

Если НЕ ЗначениеЗаполнено(ЭлементНоменклатуры.Автор) Тогда
	
	ЭлементНоменклатуры.Автор = ДанныеЗаполнения.НовыйАвтор;
КонецЕсли;

Если НЕ ЗначениеЗаполнено(ЭлементНоменклатуры.ДатаСоздания) Тогда
	
	ЭлементНоменклатуры.ДатаСоздания = ДанныеЗаполнения.НоваяДатаСоздания;
КонецЕсли;

Если НЕ ЗначениеЗаполнено(ЭлементНоменклатуры.ОсновнаяЕдиницаИзмерения) Тогда
	ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(ЭлементНоменклатуры.БазоваяЕдиницаИзмерения.Наименование,Истина,,ЭлементНоменклатуры.Ссылка);
	Если  НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		ЕдиницаИзмерения              = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		ЕдиницаИзмерения.Владелец     = ЭлементНоменклатуры.Ссылка;
		ЕдиницаИзмерения.УстановитьНовыйКод("");
		ЕдиницаИзмерения.Наименование = ЭлементНоменклатуры.БазоваяЕдиницаИзмерения.Наименование;
		ЕдиницаИзмерения.ЕдиницаПоКлассификатору = ЭлементНоменклатуры.БазоваяЕдиницаИзмерения;
		ЕдиницаИзмерения.Коэффициент = 1;
		ЕдиницаИзмерения.Вес         = ДанныеЗаполнения.ВесЕИ;
		ЕдиницаИзмерения.Точность    = ДанныеЗаполнения.ТочностьЕИ;
		Попытка
			ЕдиницаИзмерения.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Типы номенклатуры"" элемент ""%1"" добавлена единица измерени ""%2""'"),,,,, СокрЛП(ЭлементНоменклатуры.ТипНоменклатуры.Наименование), СокрЛП(ЭлементНоменклатуры.ЕдиницаИзмерения.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Единицы измерения""'", 
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	ЭлементНоменклатуры.ОсновнаяЕдиницаИзмерения=ЕдиницаИзмерения.Ссылка;
КонецЕсли;

// Сохранение элемента
НовыйЭлемент = ЭлементНоменклатуры.ЭтоНовый();
Если ЭлементНоменклатуры.Модифицированность() Тогда
	Попытка
		ЭлементНоменклатуры.Записать();
		ВывестиСообщение(НСтр("ru='Справочник ""Номенклатура"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(ЭлементНоменклатуры.Наименование));
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Номенклатура""'",
		ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
КонецЕсли;

КонецПроцедуры // ЗаполнитьЭлемент()

// Функция получения ячейки хранения
//
// Параметры:
//	Склад - склад для которого определяется ячейка.
//
// Возвращает ссылку на ячейку если такая нашлась или пустую ссылку
//
Функция ПолучитьЯчейкуХранения(Ссылка, Склад) Экспорт

Результат = Справочники.ЯчейкиХранения.ПустаяСсылка();

Запрос = Новый Запрос();
Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
|	ЯчейкиХраненияПоУмолчанию.ЯчейкаХранения КАК ЯчейкаХранения
|ИЗ
|	РегистрСведений.ЯчейкиХраненияПоУмолчанию КАК ЯчейкиХраненияПоУмолчанию
|ГДЕ
|	ЯчейкиХраненияПоУмолчанию.Номенклатура = &Ссылка
|	И ЯчейкиХраненияПоУмолчанию.СкладКомпании = &СкладКомпании";
Запрос.УстановитьПараметр("Ссылка",        Ссылка);
Запрос.УстановитьПараметр("СкладКомпании", Склад);

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	Результат = Выборка.ЯчейкаХранения;
КонецЕсли;

Возврат Результат;

КонецФункции // ПолучитьЯчейкуХранения()

// Заполнить табличную часть номенклатурой подходящей по отбору
//
Функция ЗаполнитьИнформацию(Артикул, ПрайсЛистКонтрагента, Производитель) Экспорт

ПрайсЛисты = Новый ТаблицаЗначений;
ПрайсЛисты.Колонки.Добавить("ПрайсЛист");
ПрайсЛисты.Колонки.Добавить("Номенклатура");
ПрайсЛисты.Колонки.Добавить("Артикул");
ПрайсЛисты.Колонки.Добавить("Производитель");
ПрайсЛисты.Колонки.Добавить("Наименование");
ПрайсЛисты.Колонки.Добавить("НаименованиеИностранное");
ПрайсЛисты.Колонки.Добавить("Цена");
ПрайсЛисты.Колонки.Добавить("Количество");
ПрайсЛисты.Колонки.Добавить("СрокПоставки");
ПрайсЛисты.Колонки.Добавить("ВоВнешнемИсточнике");

Если ПустаяСтрока(Артикул) Тогда
	Возврат ПрайсЛисты;
КонецЕсли;

Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
|	ПрайсЛистыКонтрагентов.Ссылка
|ИЗ
|	Справочник.ПрайсЛистыКонтрагентов КАК ПрайсЛистыКонтрагентов
|ГДЕ
|	ПрайсЛистыКонтрагентов.ПометкаУдаления = ЛОЖЬ"+?(НЕ ЗначениеЗаполнено(ПрайсЛистКонтрагента),""," И ПрайсЛистыКонтрагентов.Ссылка = &Ссылка")+"";

Запрос.УстановитьПараметр("Ссылка",        ПрайсЛистКонтрагента);
Запрос.УстановитьПараметр("Производитель", Производитель);
Выборка = Запрос.Выполнить().Выбрать();

Пока Выборка.Следующий() Цикл
	
	ОбъектПрайсЛиста    = Выборка.Ссылка.ПолучитьОбъект();
	МенеджерОбъекта     = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Выборка.Ссылка);
	СтруктураПараметров = МенеджерОбъекта.ПолучитьПараметрыНоменклатуры(ОбъектПрайсЛиста, Артикул, "Артикул");
	
	Если СтруктураПараметров <> Неопределено Тогда
		СтрокаПрайса = ПрайсЛисты.Добавить();
		СтрокаПрайса.ПрайсЛист = Выборка.Ссылка;
		Для Каждого ПараметрНоменклатуры Из СтруктураПараметров Цикл
			Если ПрайсЛисты.Колонки.Найти(ПараметрНоменклатуры.Ключ) <> Неопределено Тогда
				
				Значение = ПараметрНоменклатуры.Значение;
				
				// если производитель имеет тип "строка", то поищем по строке объект в базе
				Если (ПараметрНоменклатуры.Ключ = "Производитель") И ТипЗнч(ПараметрНоменклатуры.Значение) = Тип("Строка")Тогда
					
					// сначала поищем на точное соответствие
					НайденныйОбъект = Справочники.Производители.НайтиПоНаименованию(ПараметрНоменклатуры.Значение,Истина);
					
					// если не нашли - на неточное соответствие
					Если НЕ ЗначениеЗаполнено(НайденныйОбъект) Тогда
						ЗапросПроизводители = Новый Запрос("ВЫБРАТЬ
						|	Производители.Ссылка
						|ИЗ
						|	Справочник.Производители КАК Производители
						|ГДЕ
						|	Производители.Наименование ПОДОБНО &Наименование");
						ЗапросПроизводители.УстановитьПараметр("Наименование","%"+ПараметрНоменклатуры.Значение+"%");
						ВыборкаПроизводители = ЗапросПроизводители.Выполнить().Выбрать();
						Если ВыборкаПроизводители.Количество() = 1 Тогда
							ВыборкаПроизводители.Следующий();
							НайденныйОбъект = ВыборкаПроизводители.Ссылка;
						КонецЕсли;
					КонецЕсли;
					
					Значение = ?(НЕ ЗначениеЗаполнено(НайденныйОбъект), Значение, НайденныйОбъект);
					
				КонецЕсли;
				
				СтрокаПрайса[ПараметрНоменклатуры.Ключ]=Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецЦикла;

Возврат ПрайсЛисты;

КонецФункции // ЗаполнитьИнформацию()

// Функция получения таблицы замен
//
Функция ПолучитьТаблицуЗамен(Номенклатура, Артикул=Неопределено, Производитель=Неопределено) Экспорт

ТаблицаЗамен = Новый ТаблицаЗначений;
ТаблицаЗамен.Колонки.Добавить("АртикулСтарый", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));
ТаблицаЗамен.Колонки.Добавить("АртикулНовый",  Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));
ТаблицаЗамен.Колонки.Добавить("Производитель", Новый ОписаниеТипов("СправочникСсылка.Производители"));
ТаблицаЗамен.Колонки.Добавить("Шаг",           Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2,0)));

Если Артикул = Неопределено Тогда
	АртикулПоиска = Номенклатура.Артикул;
Иначе
	АртикулПоиска = Артикул;
КонецЕсли;
Если НЕ ЗначениеЗаполнено(Производитель) Тогда
	ПроизводительПоиска = Номенклатура.Производитель;
Иначе
	ПроизводительПоиска = Производитель;
КонецЕсли;

ЗащищенныеФункцииСервер.ЗаполнитьЗамены(Артикул, Производитель, ТаблицаЗамен);

ТаблицаЗамен.Сортировать("Шаг");

Возврат ТаблицаЗамен;

КонецФункции // ПолучитьТаблицуЗамен()

// Получение таблиц замен номенклатуры
// Параметры:
// 	ЗаменыНовые - Булево
// 	ТаблицаЗамен - ТаблицаЗначений
// 	ДополнительныеПараметры - Структура - (необязательный) дополнительные параметры:
// 		 * НаличиеВСправочнике - Булево - (необязательный)
// 		 * ВНаличииНаСкладе - Булево - (необязательный)
// 		 * НаДату - Дата - (необязательный)
// 		 * СкладКомпании - СправочникСсылка.СкладыКомпании - (необязательный)
//
// Возвращаемое значение
//  ТаблицаЗначений - таблица замен.
//
Функция ПолучитьЗаменыНоменклатуры(ЗаменыНовые, ТаблицаЗамен, ДополнительныеПараметры=Неопределено) Экспорт 

Если ДополнительныеПараметры = Неопределено Тогда
	ДополнительныеПараметры = Новый Структура;
КонецЕсли;
Если НЕ ДополнительныеПараметры.Свойство("НаличиеВСправочнике") Тогда
	ДополнительныеПараметры.Вставить("НаличиеВСправочнике", Ложь);
КонецЕсли;
Если НЕ ДополнительныеПараметры.Свойство("ВНаличииНаСкладе") Тогда
	ДополнительныеПараметры.Вставить("ВНаличииНаСкладе", Ложь);
КонецЕсли;
Если НЕ ДополнительныеПараметры.Свойство("НаДату") Тогда
	ДополнительныеПараметры.Вставить("НаДату", Дата(1, 1, 1));
КонецЕсли;
Если НЕ ДополнительныеПараметры.Свойство("СкладКомпании") Тогда
	ДополнительныеПараметры.Вставить("СкладКомпании", Неопределено);
КонецЕсли;

ТаблицаЗаменНовыеСтарые = Новый ТаблицаЗначений;

ЗащищенныеФункцииСервер.ПолучитьЗаменыНоменклатуры(ЗаменыНовые, 
ТаблицаЗамен,
ТаблицаЗаменНовыеСтарые,
ДополнительныеПараметры.НаличиеВСправочнике,
ДополнительныеПараметры.ВНаличииНаСкладе,
ДополнительныеПараметры.НаДату,
ДополнительныеПараметры.СкладКомпании);

Возврат ТаблицаЗаменНовыеСтарые;

КонецФункции // ПолучитьЗаменыНоменклатуры()

// Функция - НайтиНоменклатуру производит поиск номенклатуры по переданным параметрам.
//
// Параметры:
//  АртикулДляПоиска  - Строка                         - Артикул, значение которого будет использовано для поиска
//  Производитель     - СправочникСсылка.Производители - Ссылка на производителя по которому будет осуществляться поиск
//  ИсключаемаяСсылка - СправочникСсылка.Номенклатура  - Ссылка на номенклатуру, которую надо исключить из выборки.
//
// Возвращаемое значение:
//  СправочникСсылка.Номенклатура - Ссылка на найденную номенклатуру.
//
Функция НайтиНоменклатуру(Артикул, Производитель = Неопределено,ИсключаемаяСсылка = Неопределено)Экспорт 

Если НЕ ЗначениеЗаполнено(Артикул) Тогда
	Возврат Справочники.Номенклатура.ПустаяСсылка();
КонецЕсли;

Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
|	Номенклатура.Ссылка
|ИЗ
|	Справочник.Номенклатура КАК Номенклатура
|ГДЕ
|	Номенклатура.Артикул = &Артикул
|	И Номенклатура.Производитель = &Производитель
|	И НЕ Номенклатура.Ссылка = &ИсключаемаяСсылка";

Запрос.УстановитьПараметр("Артикул", Артикул);

Если Производитель = Неопределено Тогда
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Номенклатура.Производитель = &Производитель","");
Иначе
	Запрос.УстановитьПараметр("Производитель" , Производитель);
КонецЕсли;
Если ИсключаемаяСсылка <> Неопределено Тогда
	Запрос.УстановитьПараметр("ИсключаемаяСсылка", ИсключаемаяСсылка);
Иначе 
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ Номенклатура.Ссылка = &ИсключаемаяСсылка","");
КонецЕсли;

Результат = Запрос.Выполнить();
Выборка = Результат.Выбрать();
Если Выборка.Следующий() Тогда
	Возврат Выборка.Ссылка;
Иначе
	Возврат Справочники.Номенклатура.ПустаяСсылка();
КонецЕсли;

КонецФункции // НайтиНоменклатуру()

// Получает единицу измерения в зависимости от базовой.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура  - Ссылка на номенклатуру, которую надо исключить из выборки.
//
// Возвращаемое значение:
//  СправочникСсылка.ЕдиницыИзмерения - Ссылка на найденную единицу измерения.
//
Функция ПолучитьОсновнуюЕдиницуПоБазовой(Номенклатура, ЕдиницаПоКлассификатору = Неопределено, НаименованиеКлассификатора = Неопределено, Создавать = Истина) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;
	
	// тк + 
	Если ЕдиницаПоКлассификатору = Неопределено Тогда
		ЕдиницаПоКлассификатору = Номенклатура.БазоваяЕдиницаИзмерения;
	КонецЕсли;
	
	Если НаименованиеКлассификатора = Неопределено Тогда
		НаименованиеКлассификатора = ЕдиницаПоКлассификатору.Наименование;
	КонецЕсли;
	
	Если Номенклатура.ТипНоменклатуры.ИспользованиеЕдиницИзмерения=1 Тогда
		Владелец =  Номенклатура.ТипНоменклатуры;
	Иначе
		Владелец =  Номенклатура.Ссылка;
	КонецЕсли;
	
	НоменклатураУдалена = Номенклатура.ПометкаУдаления;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕдиницыИзмерения.Ссылка,
	|	ЕдиницыИзмерения.Коэффициент КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА ЕдиницыИзмерения.Коэффициент = 1
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПолеСортировкиПоКоэффициенту,
	|	ВЫБОР
	|		КОГДА ЕдиницыИзмерения.Наименование = &НаименованиеКлассификатора
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПолеСортировки
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.Владелец = &Владелец"+?(НоменклатураУдалена, "", "
	|	И ЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ")+"
	|	И ЕдиницыИзмерения.ЕдиницаПоКлассификатору = &ЕдиницаПоКлассификатору
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПолеСортировкиПоКоэффициенту,
	|	Коэффициент,
	|	ПолеСортировки");
	Запрос.УстановитьПараметр("Владелец",                   Владелец);
	Запрос.УстановитьПараметр("ЕдиницаПоКлассификатору",    ЕдиницаПоКлассификатору);
	Запрос.УстановитьПараметр("НаименованиеКлассификатора", НаименованиеКлассификатора);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		НоваяЕдиницаИзмерения = Выборка.Ссылка;
	ИначеЕсли Создавать Тогда
		//НоваяЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		//НоваяЕдиницаИзмерения.Владелец                = Владелец;
		//НоваяЕдиницаИзмерения.ЕдиницаПоКлассификатору = ЕдиницаПоКлассификатору;
		//НоваяЕдиницаИзмерения.Наименование            = НаименованиеКлассификатора;
		//НоваяЕдиницаИзмерения.Коэффициент             = 1;
		//НоваяЕдиницаИзмерения.Записать();
		//НоваяЕдиницаИзмерения = НоваяЕдиницаИзмерения.Ссылка;
		НоваяЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	Иначе
		НоваяЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;
	// тк - 
	
	Возврат НоваяЕдиницаИзмерения;
	
КонецФункции // ПолучитьОсновнуюЕдиницуПоБазовой()

// Получает и загружает цены номенклатуры.
//
Процедура ЗагрузитьЦены(Форма, ДополнительныеПараметры) Экспорт

ТекущаяНоменклатура =   ДополнительныеПараметры.ТекущаяНоменклатура;
ТекущаяХарактеристика = ДополнительныеПараметры.ТекущаяХарактеристика;
ТекущееПодразделение = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеПараметры, "ПодразделениеКомпании" , Справочники.ПодразделенияКомпании.ПустаяСсылка());
ЗапросТекст =           ДополнительныеПараметры.ЗапросТекст;

Форма.Цены.Очистить();
Форма.ЦеныКонтрагентов.Очистить();

Запрос = Новый Запрос;
Запрос.Текст =
"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
|	ЦеныСрезПоследних.ТипЦен КАК ТипЦен,
|	ВЫБОР
|		КОГДА ЦеныСрезПоследних.ТипЦен.ВВалютеУчета = ИСТИНА
|			ТОГДА ЦеныСрезПоследних.Номенклатура.ВалютаУчета
|		ИНАЧЕ ЦеныСрезПоследних.ТипЦен.ВалютаЦены
|	КОНЕЦ КАК ВалютаЦены,
|	ЦеныСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
|	ЦеныСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
|	ЦеныСрезПоследних.ПодразделениеКомпании КАК Подразделение,
|	ЦеныСрезПоследних.Цена КАК Цена,
|	0 КАК ЦенаРегл
|ПОМЕСТИТЬ ТаблицаЦен
|ИЗ
|	РегистрСведений.Цены.СрезПоследних(
|			&НаДату,
|			Номенклатура = &Номенклатура
|				И Контрагент = &Контрагент
|				И ВЫБОР
|					КОГДА ТипЦен.АлгоритмПолученияЦены = &ПоХарактеристике
|						ТОГДА ИСТИНА
|					ИНАЧЕ ИСТИНА
|				КОНЕЦ"+? (НЕ ТекущееПодразделение = Справочники.ПодразделенияКомпании.ПустаяСсылка(), "
|				И ПодразделениеКомпании В ИЕРАРХИИ(&ПодразделениеКомпании)", "") +") КАК ЦеныСрезПоследних
|ГДЕ
|	ЦеныСрезПоследних.Цена > 0
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ТипыЦен.БазовыйТипЦен КАК БазовыйТипЦен,
|	ТипыЦен.БазовыйТипЦен.ВалютаЦены КАК БазоваяВалюта,
|	ТипыЦен.ВалютаЦены КАК ВалютаЦены,
|	ТипыЦен.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону,
|	ТипыЦен.Точность КАК Точность,
|	ВЫБОР
|		КОГДА ТипыЦенПроцентыСкидкиНаценки.ПроцентСкидкиНаценки ЕСТЬ NULL
|			ТОГДА ТипыЦен.ПроцентСкидкиНаценки
|		ИНАЧЕ ТипыЦенПроцентыСкидкиНаценки.ПроцентСкидкиНаценки
|	КОНЕЦ КАК ПроцентСкидкиНаценкиТаблица,
|	ТипыЦен.Ссылка КАК Ссылка,
|	ТипыЦенПроцентыСкидкиНаценки.УдалитьТипНоменклатуры КАК ТипНоменклатуры
|ПОМЕСТИТЬ ТипыЦенПоВидамНоменклатуры
|ИЗ
|	Справочник.ТипыЦен КАК ТипыЦен
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыЦен.ПроцентыСкидкиНаценки КАК ТипыЦенПроцентыСкидкиНаценки
|		ПО (ТипыЦенПроцентыСкидкиНаценки.Ссылка = ТипыЦен.Ссылка)
|			И (ТипыЦенПроцентыСкидкиНаценки.УдалитьТипНоменклатуры = &ТипНоменклатуры)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	ТаблицаЦен.ТипЦен КАК ТипЦен,
|	ТаблицаЦен.ТипЦен.Наименование КАК ТипЦенНаименование,
|	ТаблицаЦен.ВалютаЦены КАК ВалютаЦены,
|	ТаблицаЦен.ВалютаЦены КАК БазоваяВалюта,
|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК Характеристика,
|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
|	ТаблицаЦен.Подразделение КАК Подразделение,
|	ТаблицаЦен.Цена КАК Цена,
|	ТаблицаЦен.ЦенаРегл КАК ЦенаРегл,
|	NULL КАК ОкруглятьВБольшуюСторону,
|	NULL КАК Точность,
|	0 КАК ПолеСортировки,
|	ТаблицаЦен.ТипЦен.Рассчитывается КАК Рассчитывается
|ИЗ
|	ТаблицаЦен КАК ТаблицаЦен
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ТипыЦенПоВидамНоменклатуры.Ссылка,
|	ТипыЦенПоВидамНоменклатуры.Ссылка.Наименование,
|	ТипыЦенПоВидамНоменклатуры.ВалютаЦены,
|	ТипыЦенПоВидамНоменклатуры.БазоваяВалюта,
|	ТаблицаЦен.ХарактеристикаНоменклатуры,
|	ТаблицаЦен.ЕдиницаИзмерения,
|	ТаблицаЦен.Подразделение,
|	ТаблицаЦен.Цена + ТаблицаЦен.Цена * (ЕСТЬNULL(ТипыЦенПоВидамНоменклатуры.ПроцентСкидкиНаценкиТаблица, 0) / 100),
|	ТаблицаЦен.ЦенаРегл,
|	ТипыЦенПоВидамНоменклатуры.ОкруглятьВБольшуюСторону,
|	ТипыЦенПоВидамНоменклатуры.Точность,
|	1,
|	ТаблицаЦен.ТипЦен.Рассчитывается
|ИЗ
|	ТаблицаЦен КАК ТаблицаЦен
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТипыЦенПоВидамНоменклатуры КАК ТипыЦенПоВидамНоменклатуры
|		ПО ТаблицаЦен.ТипЦен = ТипыЦенПоВидамНоменклатуры.БазовыйТипЦен
|ГДЕ
|	ТаблицаЦен.Цена > 0
|
|УПОРЯДОЧИТЬ ПО
|	ПолеСортировки,
|	ТипЦенНаименование";

ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
Ставка = ТекущаяНоменклатура.СтавкаНДС.Ставка;

Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеПоХарактеристике%", ЗапросТекст);

Запрос.УстановитьПараметр("НаДату",                     ТекущаяДатаСеанса());
Запрос.УстановитьПараметр("ПоХарактеристике",           Перечисления.АлгоритмПолученияЦены.ПоХарактеристике);
Запрос.УстановитьПараметр("Контрагент",                 Справочники.Контрагенты.ПустаяСсылка());

Запрос.УстановитьПараметр("Номенклатура",               ТекущаяНоменклатура);
Запрос.УстановитьПараметр("ТипНоменклатуры",            ТекущаяНоменклатура.ТипНоменклатуры);
Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ТекущаяХарактеристика);
Запрос.УстановитьПараметр("ПодразделениеКомпании", 		ТекущееПодразделение);

ТаблицаЦены = Запрос.Выполнить().Выгрузить();

Для Каждого ТекСтрока Из ТаблицаЦены Цикл
	
	// для расчетных типов цен перерасчет из валюты базового типа цен
	ТекСтрока.Цена = ?(ТекСтрока.ВалютаЦены <> ТекСтрока.БазоваяВалюта, РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ТекСтрока.Цена, ТекСтрока.БазоваяВалюта, ТекущаяДатаСеанса(), ТекСтрока.ВалютаЦены, ТекущаяДатаСеанса()), ТекСтрока.Цена);
	
	Если ТекСтрока.ТипЦен.ОкруглятьВБольшуюСторону Тогда
		ТекСтрока.Цена = Окр(ТекСтрока.Цена, ТекСтрока.ТипЦен.Точность,1);
	Иначе
		ТекСтрока.Цена = Окр(ТекСтрока.Цена, ТекСтрока.ТипЦен.Точность,0);
	КонецЕсли;
	
	Если ВалютаРегламентированногоУчета <> Справочники.Валюты.ПустаяСсылка() Тогда
		ТекСтрока.ЦенаРегл = ?(ТекСтрока.ВалютаЦены = ВалютаРегламентированногоУчета, ТекСтрока.Цена,
		РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ТекСтрока.Цена, ТекСтрока.ВалютаЦены, ТекущаяДатаСеанса(), ВалютаРегламентированногоУчета, ТекущаяДатаСеанса()))	
	КонецЕсли;
	
	НоваяСтрока = Форма.Цены.Добавить();
	НоваяСтрока.Характеристика = ТекСтрока.Характеристика;
	ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
	
	Если ТекСтрока.ТипЦен.ЦенаВключаетНДС Тогда
		НоваяСтрока.ЦенаБезНДС     = ТекСтрока.Цена - Окр((ТекСтрока.Цена * Ставка)/(100 + Ставка), 2);
		НоваяСтрока.ЦенаБезНДСРегл = ТекСтрока.ЦенаРегл - Окр((ТекСтрока.ЦенаРегл * Ставка)/(100 + Ставка), 2);
	Иначе
		НоваяСтрока.ЦенаБезНДС     = ТекСтрока.Цена;
		НоваяСтрока.ЦенаБезНДСРегл = ТекСтрока.ЦенаРегл;
		НоваяСтрока.Цена           = ТекСтрока.Цена + Окр((ТекСтрока.Цена * Ставка)/100, 2);
		НоваяСтрока.ЦенаРегл       = ТекСтрока.ЦенаРегл + Окр((ТекСтрока.ЦенаРегл * Ставка)/100, 2);
	КонецЕсли;
	
КонецЦикла;

КонецПроцедуры // ЗагрузитьЦены()

// Возвращает иностранное наименование по умолчанию.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Функция СформироватьНаименованиеИностранноеПоУмолчанию(Объект, ПараметрыДействия=Неопределено) Экспорт

Возврат Объект.Наименование;

КонецФункции // СформироватьИностранноеНаименованиеПоУмолчанию()

// Возвращает полное наименование по умолчанию.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Функция СформироватьНаименованиеПолноеПоУмолчанию(Объект, ПараметрыДействия=Неопределено) Экспорт

Возврат Объект.Наименование;

КонецФункции

// Проверим корректность ставки НДС для устранения ситуации выбора ставки НДС 18%
//
Функция ПроверитьКорректностьСтавкиНДС(Объект) Экспорт

// По закону с 01.01.2019 вместо ставки НДС 18% необходимо использовать ставку НДС 20%.

ТекДата = ТекущаяДатаСеанса();

СтавкаНДСНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СтавкаНДС, "Ставка");

// !!!_Переход на ставку НДС 20%
// После 01.01.2019 убрать проверку на ввод ставки НДС 20%
Если ТекДата < Дата("20190101") Тогда
	Если СтавкаНДСНоменклатуры = 20 Тогда
		Возврат Ложь;
	КонецЕсли;
Иначе
	Если СтавкаНДСНоменклатуры = 18 Тогда
		Возврат Ложь;
	КонецЕсли;
КонецЕсли;

Возврат Истина;

КонецФункции // ПроверитьКорректностьСтавкиНДС()

//тк+
Функция ПолучитьСлучайноеЗначениеДополнительногоРеквизита(Свойство)

Результат = "";

Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
|	ДополнительныеРеквизиты.Значение КАК Значение,
|	ДополнительныеРеквизиты.ТекстоваяСтрока
|ИЗ
|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
|ГДЕ
|	ДополнительныеРеквизиты.Свойство = &Свойство
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ ПЕРВЫЕ 1
|	ЗначенияСвойствОбъектов.Ссылка,
|	""""
|ИЗ
|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
|ГДЕ
|	ЗначенияСвойствОбъектов.Владелец = &Свойство
|";

Запрос.УстановитьПараметр("Свойство", Свойство);

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	Если ЗначениеЗаполнено(Выборка.ТекстоваяСтрока) Тогда
		Результат = Выборка.ТекстоваяСтрока;
	Иначе
		Результат = Выборка.Значение;
	КонецЕсли;
КонецЕсли;

Возврат Результат;

КонецФункции

Функция ПолучитьСлучайноеЗначениеДополнительногоСведения(Свойство)

Результат = "";

Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
|	ТаблицаСвойств.Значение КАК Значение
|ИЗ
|	РегистрСведений.ДополнительныеСведения КАК ТаблицаСвойств
|ГДЕ
|	ТаблицаСвойств.Объект ССЫЛКА Справочник.Номенклатура И 
|	ТаблицаСвойств.Свойство = &Свойство
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ ПЕРВЫЕ 1
|	ЗначенияСвойствОбъектов.Ссылка
|ИЗ
|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
|ГДЕ
|	ЗначенияСвойствОбъектов.Владелец = &Свойство
|";
Запрос.УстановитьПараметр("Свойство", Свойство);

Выборка = Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	Результат = Выборка.Значение;
КонецЕсли;

Возврат Результат;

КонецФункции

Функция ПолучитьДопРеквизитыИСведенийОбъекта(НаборРеквизитовИСведений, ПолучатьДопРеквизиты = Истина, ПолучатьДопСведения = Истина) Экспорт

ТекстЗапросаРеквизиты = "
|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство КАК Свойство,
|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.Заголовок КАК ИмяПоля,
|	ИСТИНА КАК ЭтоРеквизит
|ИЗ
|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
|ГДЕ
|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = &СсылкаОбъекта
|
|ОБЪЕДИНИТЬ
|
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство,
|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.Заголовок,
|	ИСТИНА КАК ЭтоРеквизит
|ИЗ
|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
|ГДЕ
|	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = &НаборОбщихСвойствНоменклатуры";

ТекстЗапросаСвойства = "
|	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство КАК Свойство,
|	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство.Заголовок КАК ИмяПоля,
|	ЛОЖЬ КАК ЭтоРеквизит
|ИЗ
|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
|ГДЕ
|	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = &СсылкаОбъекта
|
|ОБЪЕДИНИТЬ
|
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство,
|	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство.Заголовок,
|	ЛОЖЬ
|ИЗ
|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
|ГДЕ
|	НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = &НаборОбщихСвойствНоменклатуры";

Запрос = Новый Запрос;

Если ПолучатьДопРеквизиты И ПолучатьДопСведения Тогда
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ" + ТекстЗапросаРеквизиты + "
	|	
	|ОБЪЕДИНИТЬ
	|	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ" + ТекстЗапросаСвойства;
ИначеЕсли ПолучатьДопРеквизиты Тогда
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ" + ТекстЗапросаРеквизиты;
ИначеЕсли ПолучатьДопСведения Тогда
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ" + ТекстЗапросаСвойства;
КонецЕсли;

Запрос.УстановитьПараметр("СсылкаОбъекта",                 НаборРеквизитовИСведений);
Запрос.УстановитьПараметр("НаборОбщихСвойствНоменклатуры", Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура_Общие);

Результат = Запрос.Выполнить().Выгрузить();

Возврат Результат;

КонецФункции
 
Функция ПолучитьМассивЗначенийШаблона(Знач ВремНаименование, ТегШаблона)

Результат = Новый Массив;

ВремНаименование = ВремНаименование + " "; 

ВремНаименованиеВРег = ВРег(ВремНаименование);
Пока Истина Цикл
	
	ПодписьЗН ="";
	ПозицияЗН = СтрНайти(ВремНаименованиеВРег, ТегШаблона);
	Если ПозицияЗН = 0 Тогда
		Прервать;
	КонецЕсли;
	
	ПозицияПравыйУгол = СтрНайти(Сред(ВремНаименование, ПозицияЗН), ">");
	ИмяЗН = Сред(ВремНаименование, ПозицияЗН + 5, ПозицияПравыйУгол - 6);
	
	ПозицияКрайПодписи = СтрНайти(Сред(ВремНаименование,ПозицияЗН + ПозицияПравыйУгол)," ");
	Если НЕ  ПозицияКрайПодписи = 1 Тогда
		ПодписьЗН =  Сред(ВремНаименование, ПозицияЗН + ПозицияПравыйУгол,ПозицияКрайПодписи-1 );
	КонецЕсли;
	
	СтруктураЗН = Новый Структура("Имя,Подпись");
	СтруктураЗн.Имя = ИмяЗН;
	СтруктураЗН.Подпись = ПодписьЗН;
	
	Результат.Добавить(СтруктураЗН);
	
	Если СтрДлина(ВремНаименование) > ПозицияЗН + ПозицияПравыйУгол + ПозицияКрайПодписи -1 Тогда 
		ВремНаименование = Сред(ВремНаименование, ПозицияЗН + ПозицияПравыйУгол +ПозицияКрайПодписи);
		ВремНаименованиеВРег = ВРег(ВремНаименование);
	Иначе
		Прервать;
	КонецЕсли;
	
КонецЦикла;

Возврат Результат;
КонецФункции

Процедура ПодставитьЗначениеВШаблон(ШаблонТекста, Знач ТегШаблона, Знач ИмяПоля = "", ЗначениеПоля,ПодписьРеквизита ="")


Если ЗначениеЗаполнено(ИмяПоля) Тогда
	ИмяПоля = "<" + ИмяПоля + ">";
КонецЕсли;

Если НЕ ЗначениеЗаполнено(ЗначениеПоля)  Тогда
	ШаблонТекста = СтрЗаменить(ШаблонТекста,ПодписьРеквизита, "");
КонецЕсли;

ШаблонТекста = СтрЗаменить(ШаблонТекста, ТегШаблона + ИмяПоля, ЗначениеПоля); 
ШаблонТекста = СтрЗаменить(ШаблонТекста, ВРег(ТегШаблона) + ИмяПоля, ВРег(ЗначениеПоля)); 
ШаблонТекста = СтрЗаменить(ШаблонТекста, ПодписьРеквизита, " " + ПодписьРеквизита); 

КонецПроцедуры

Функция СодержитсяВМассиве(МассивСтруктур,ПолеСтруктуры="", ИскомоеЗначение)
ИндексЭлемента = 0;
ЗначениеПоляСтруктуры = "";
Для Каждого ЭлементМассива Из МассивСтруктур Цикл
	Если Не ЭлементМассива.Свойство(ПолеСтруктуры ,ЗначениеПоляСтруктуры) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ЗначениеПоляСтруктуры = ИскомоеЗначение Тогда
		Возврат ИндексЭлемента;
	КонецЕсли;
	ИндексЭлемента = ИндексЭлемента+1;
КонецЦикла;
Возврат Неопределено;
КонецФункции

// Получает наименование номенклатуры по шаблону для данного типа номенклатуры
Функция СформироватьНаименованиеТовараПоШаблону(ШаблонНаименования, ТекущийОбъект) Экспорт

ВремНаименование  = СокрЛП(ШаблонНаименования);
ВремНаименованиеВРег = ВРег(ВремНаименование);

Если ТипЗнч(ТекущийОбъект) = Тип("ДанныеФормыСтруктура") Тогда
	ТипОбъекта = ТипЗнч(ТекущийОбъект.Ссылка);
Иначе
	ТипОбъекта = ТипЗнч(ТекущийОбъект);
КонецЕсли;

ЭтоНоменклатура    = Ложь;
ЭтоТипНоменклатуры = Ложь;
ЭтоСтрока          = Ложь;

Если (ТипОбъекта = Тип("СправочникСсылка.ТипыНоменклатуры") 
	ИЛИ ТипОбъекта = Тип("СправочникОбъект.ТипыНоменклатуры")) Тогда
	ЭтоТипНоменклатуры = Истина
ИначеЕсли (ТипОбъекта = Тип("СправочникСсылка.Номенклатура")
	ИЛИ ТипОбъекта = Тип("СправочникОбъект.Номенклатура")) Тогда
	ЭтоНоменклатура    = Истина;
Иначе
	ЭтоСтрока          = Истина;
КонецЕсли;

Если СтрНайти(ВремНаименованиеВРег, "#ТК#") > 0 Тогда 
	Если ЭтоТипНоменклатуры Тогда
		НаименованиеТипаНоменклатуры = ТекущийОбъект.Наименование;
	ИначеЕсли ЭтоНоменклатура Тогда
		НаименованиеТипаНоменклатуры = ТекущийОбъект.ТипНоменклатуры.Наименование;
	Иначе
		НаименованиеТипаНоменклатуры = "<Категория>";
	КонецЕсли;
	
	ПодставитьЗначениеВШаблон(ВремНаименование, "#тк#", "", НаименованиеТипаНоменклатуры);
	
КонецЕсли;

Если СтрНайти(ВремНаименованиеВРег, "#ТМ#") > 0 Тогда
	Если ЭтоНоменклатура Тогда
		ТоварнаяМарка = ТекущийОбъект.ТоварнаяМарка;
	Иначе
		ТоварнаяМарка = "<Марка>";
	КонецЕсли;
	
	ПодставитьЗначениеВШаблон(ВремНаименование, "#тм#", "", ТоварнаяМарка);
КонецЕсли;

Если СтрНайти(ВремНаименованиеВРег, "#ЗА#") > 0 Тогда
	Если ЭтоНоменклатура Тогда
		ЗначениеАссортиментаТоварнойМарки = ТекущийОбъект.ЗначениеАссортиментаТоварнойМарки;
	Иначе
		ЗначениеАссортиментаТоварнойМарки = "<Ассортимент>";
	КонецЕсли;
	
	ПодставитьЗначениеВШаблон(ВремНаименование, "#за#", "", ЗначениеАссортиментаТоварнойМарки);
КонецЕсли;


Если СтрНайти(ВремНаименованиеВРег, "#СП#") > 0 Тогда
	Если ЭтоНоменклатура Тогда
		Если ТекущийОбъект.СтранаПроисхождения.Пустая() Тогда
			Страна = "";
		Иначе
			Страна = ТекущийОбъект.СтранаПроисхождения.Наименование;
		КонецЕсли;
	Иначе
		Страна = "РОССИЯ";
	КонецЕсли;
	
	ПодставитьЗначениеВШаблон(ВремНаименование, "#сп#", "", Страна);
КонецЕсли;

Если СтрНайти(ВремНаименованиеВРег, "#ОБ#") > 0 Тогда
	Если ЭтоНоменклатура Тогда
		Если ТекущийОбъект.объем = 0 Тогда
			Объем = "";
		Иначе
			Объем = Строка(ТекущийОбъект.Объем);
		КонецЕсли;
	Иначе
		Объем = "";
	КонецЕсли;
	ПодставитьЗначениеВШаблон(ВремНаименование, "#об#", "", Объем);
КонецЕсли;


Если СтрНайти(ВремНаименованиеВРег, "#ПР#") > 0 Тогда
	Если ЭтоНоменклатура Тогда
		Если ТекущийОбъект.Производитель.Пустая() Тогда
			Производитель = "";
		Иначе
			Производитель = ТекущийОбъект.Производитель.Наименование;
		КонецЕсли;
	Иначе
		Производитель = "<Производитель>";
	КонецЕсли;
	
	ПодставитьЗначениеВШаблон(ВремНаименование, "#пр#", "", Производитель);
КонецЕсли;

//// все реквизиты
//Если ЭтоСтрока Тогда
//	ВсеДопРеквизиты = "<Все дополнительные реквизиты>";
//	ВремНаименование=СтрЗаменить(ВремНаименование,"#*др#", ВсеДопРеквизиты); 
//	ВремНаименование=СтрЗаменить(ВремНаименование,"#*ДР#", ВРег(ВсеДопРеквизиты)); 
//ИначеЕсли СтрНайти(ВремНаименованиеВРег, "#*ДР#") > 0 Тогда
//	МассивВсехРеквизитов = УправлениеСвойствами.ПолучитьСписокСвойств(ТекущийОбъект, Истина, Ложь);
//	
//	ШаблонВсеРеквизиты = " ";
//	Для Каждого ЗначениеМассива Из МассивВсехРеквизитов Цикл
//		ШаблонВсеРеквизиты = ШаблонВсеРеквизиты + " " + "#др#<" + ЗначениеМассива.Наименование + ">";
//	КонецЦикла;
//	Если СтрНайти(СокрЛП(ВремНаименование), "#*ДР#") > 0 Тогда 
//		ШаблонВсеРеквизиты = СтрЗаменить(ШаблонВсеРеквизиты, "#др#", "#ДР#");
//	КонецЕсли;
//	ВремНаименование = СтрЗаменить(ВремНаименование, "#*др#", ШаблонВсеРеквизиты);
//	ВремНаименование = СтрЗаменить(ВремНаименование, "#*ДР#", ВРег(ШаблонВсеРеквизиты));
//	
//КонецЕсли;

Если ЭтоТипНоменклатуры Тогда
	НаборСвойствНоменклатуры = ТекущийОбъект.НаборСвойствНоменклатуры;
ИначеЕсли ЭтоНоменклатура Тогда
	НаборСвойствНоменклатуры = ТекущийОбъект.ТипНоменклатуры.НаборСвойствНоменклатуры;
Иначе
	НаборСвойствНоменклатуры = Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка();
КонецЕсли;

МассивПроизвольногоТекста = ПолучитьМассивЗначенийШаблона(ВремНаименование, "#ПТ#");
МассивДополнительныхРеквизитов = ПолучитьМассивЗначенийШаблона(ВремНаименование, "#ДР#");
МассивДополнительныхСведений = ПолучитьМассивЗначенийШаблона(ВремНаименование, "#ДС#");

Если МассивПроизвольногоТекста.Количество() > 0 Тогда 
	Для Каждого ЗначениеМассива Из МассивПроизвольногоТекста Цикл
		ВремНаименование=СтрЗаменить(ВремНаименование,"#пт#" + "<" + ЗначениеМассива.Имя + ">", ЗначениеМассива.Имя); 
		ВремНаименование=СтрЗаменить(ВремНаименование,"#ПТ#" + "<" + ЗначениеМассива.Имя + ">", ВРег(ЗначениеМассива.Имя)); 
	КонецЦикла;	
КонецЕсли;

Если МассивДополнительныхРеквизитов.Количество() > 0 Тогда
	
	ДополнительныеРеквизиты = ПолучитьДопРеквизитыИСведенийОбъекта(НаборСвойствНоменклатуры, Истина, Ложь);
	//ДополнительныеРеквизиты = УправлениеСвойствами.ПолучитьСписокСвойств(ТекущийОбъект, Истина, Ложь);
	Если ЭтоНоменклатура Тогда
		МассивСвойств   = ДополнительныеРеквизиты.ВыгрузитьКолонку("Свойство");
		
		//06.08.19
		Если ТипЗнч(ТекущийОбъект) = Тип("СправочникСсылка.Номенклатура") Тогда
			ЗначенияРеквизитов = УправлениеСвойствами.ПолучитьЗначенияСвойств(ТекущийОбъект.Ссылка, Истина, Ложь, МассивСвойств);
		ИначеЕсли ТипЗнч(ТекущийОбъект) = Тип("СправочникОбъект.Номенклатура") Тогда 
			ЗначенияРеквизитов = ТекущийОбъект.ДополнительныеРеквизиты; 
		КонецЕсли;
		
		Для Каждого ИмяПоля Из МассивДополнительныхРеквизитов Цикл
			СтрокаСвойства = ДополнительныеРеквизиты.Найти(ИмяПоля.Имя, "ИмяПоля");
			
			Если СтрокаСвойства = Неопределено Тогда
				ПодставитьЗначениеВШаблон(ВремНаименование, "#др#", ИмяПоля.Имя, "",ИмяПоля.Подпись);
				Продолжить;
			КонецЕсли;
			
			ЗначениеСвойства = ЗначенияРеквизитов.Найти(СтрокаСвойства.Свойство, "Свойство");
			
			Если ЗначениеСвойства = Неопределено Тогда
				ПодставитьЗначениеВШаблон(ВремНаименование, "#др#", ИмяПоля.Имя, "",ИмяПоля.Подпись);
				Продолжить;
			КонецЕсли;
			
			
			ПодставитьЗначениеВШаблон(ВремНаименование, "#др#", ИмяПоля.Имя, ЗначениеСвойства.Значение,ИмяПоля.Подпись);
			
		КонецЦикла;
		
		
		//06.08.19
		
		//06.08.19
		//ЗначенияСвойств = УправлениеСвойствами.ПолучитьЗначенияСвойств(ТекущийОбъект.Ссылка, Истина, Ложь, МассивСвойств);
		//Для Каждого ИмяПоля Из МассивДополнительныхРеквизитов Цикл
		//	СтрокаСвойства = ДополнительныеРеквизиты.Найти(ИмяПоля, "ИмяПоля");
		//	
		//	Если СтрокаСвойства = Неопределено Тогда
		//		ПодставитьЗначениеВШаблон(ВремНаименование, "#др#", ИмяПоля, "");
		//		Продолжить;
		//	КонецЕсли;
		//	
		//	ЗначениеСвойства = ЗначенияСвойств.Найти(СтрокаСвойства.Свойство, "Свойство");
		//	
		//	Если ЗначениеСвойства = Неопределено Тогда
		//		ПодставитьЗначениеВШаблон(ВремНаименование, "#др#", ИмяПоля, "");
		//		Продолжить;
		//	КонецЕсли;
		//	
		//	ПодставитьЗначениеВШаблон(ВремНаименование, "#др#", ИмяПоля, ЗначениеСвойства.Значение);
		//	
		//КонецЦикла;
		//06.08.19
	Иначе
		Для Каждого ТекущийРеквизит Из ДополнительныеРеквизиты Цикл
			ИмяПоля = ТекущийРеквизит.ИмяПоля;
			//Если МассивДополнительныхРеквизитов.Найти(ИмяПоля) = Неопределено Тогда
			//	Продолжить;
			//КонецЕсли;
			НомерПозицииВМассиве = СодержитсяВМассиве(МассивДополнительныхРеквизитов,"Имя", ИмяПоля);
			Если НомерПозицииВМассиве = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЗначениеРеквизита = ПолучитьСлучайноеЗначениеДополнительногоРеквизита(ТекущийРеквизит.Свойство);
			ПодставитьЗначениеВШаблон(ВремНаименование, "#др#", ИмяПоля, ЗначениеРеквизита,МассивДополнительныхРеквизитов[НомерПозицииВМассиве].Подпись);
		КонецЦикла;
	КонецЕсли;
КонецЕсли;

Если МассивДополнительныхСведений.Количество() > 0 Тогда
	ДополнительныеСведения = ПолучитьДопРеквизитыИСведенийОбъекта(НаборСвойствНоменклатуры, Ложь, Истина);
	//ДополнительныеСведения = УправлениеСвойствами.ПолучитьСписокСвойств(ТекущийОбъект, Ложь, Истина);
	Если ЭтоНоменклатура Тогда
		МассивСвойств   = ДополнительныеСведения.ВыгрузитьКолонку("Свойство");
		ЗначенияСвойств = УправлениеСвойствами.ПолучитьЗначенияСвойств(ТекущийОбъект.Ссылка, Ложь, Истина, МассивСвойств);
		Для Каждого ИмяПоля Из МассивДополнительныхСведений Цикл
			СтрокаСвойства = ДополнительныеСведения.Найти(ИмяПоля.Имя, "ИмяПоля");
			
			Если СтрокаСвойства = Неопределено Тогда
				ПодставитьЗначениеВШаблон(ВремНаименование, "#дс#", ИмяПоля.Имя, "",ИмяПоля.Подпись);
				Продолжить;
			КонецЕсли;
			
			ЗначениеСвойства = ЗначенияСвойств.Найти(СтрокаСвойства.Свойство, "Свойство");
			
			Если ЗначениеСвойства = Неопределено Тогда
				ПодставитьЗначениеВШаблон(ВремНаименование, "#дс#", ИмяПоля.Имя, "",ИмяПоля.Подпись);
				Продолжить;
			КонецЕсли;
			
			ПодставитьЗначениеВШаблон(ВремНаименование, "#дс#", ИмяПоля.Имя, ЗначениеСвойства.Значение,ИмяПоля.Подпись);
			
		КонецЦикла;
	Иначе
		Для Каждого ТекущееСвойство Из ДополнительныеСведения Цикл
			ИмяПоля = ТекущееСвойство.ИмяПоля;
			//Если МассивДополнительныхСведений.Найти(ИмяПоля) = Неопределено Тогда
			//	Продолжить;
			//КонецЕсли;
			НомерПозицииВМассиве = СодержитсяВМассиве(МассивДополнительныхСведений,"Имя", ИмяПоля);
			Если НомерПозицииВМассиве = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЗначениеСвойства = ПолучитьСлучайноеЗначениеДополнительногоСведения(ТекущееСвойство.Свойство);
			ПодставитьЗначениеВШаблон(ВремНаименование, "#дс#", ИмяПоля, ЗначениеСвойства, МассивДополнительныхСведений[НомерПозицииВМассиве].Подпись);
		КонецЦикла;
	КонецЕсли;
КонецЕсли;

// если значение или сведения пустые, то в наименовании могут появиться два пробела подряд; исправим:
ВремНаименование = СтрЗаменить(ВремНаименование,"  ", " ");
// и ещё разок для верности...
ВремНаименование = СтрЗаменить(ВремНаименование,"  ", " ");

Возврат ВремНаименование;

КонецФункции
//тк-

Функция ПолучитьОсобенностьУчета(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабНоменклатура.ТипНоменклатуры.ОсобенностьУчета КАК ОсобенностьУчетаПоТипу,
	|	ТабНоменклатура.ОсобенностьУчета КАК ОсобенностьУчета,
	|	ТабНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТабНоменклатура.Родитель КАК Родитель,
	|	ТабНоменклатура.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ
	|	ТабНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК ТабНоменклатура
	|ГДЕ
	|	ТабНоменклатура.Ссылка В (&Номенклатура)
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабНоменклатура.Родитель КАК Номенклатура
	|ПОМЕСТИТЬ
	|	ГруппыТоваров
	|ИЗ
	|	ТабНоменклатура КАК ТабНоменклатура
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГруппыТоваров.Номенклатура.ОсобенностьУчета КАК ОсобенностьУчета,
	|	ГруппыТоваров.Номенклатура КАК Номенклатура,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ
	|	ТаблицаИерархии
	|ИЗ
	|	ГруппыТоваров КАК ГруппыТоваров
	|ГДЕ
	|	ГруппыТоваров.Номенклатура.ПометкаУдаления = Ложь И 
	|	(НЕ ГруппыТоваров.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Справочник.ОсобенностиУчетаНоменклатуры.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктураИерархииНоменклатуры.Группа.ОсобенностьУчета КАК ОсобенностьУчета,
	|	ГруппыТоваров.Номенклатура КАК Номенклатура,
	|	СтруктураИерархииНоменклатуры.Порядок КАК Приоритет
	|ИЗ
	|	ГруппыТоваров КАК ГруппыТоваров
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтруктураИерархииНоменклатуры КАК СтруктураИерархииНоменклатуры
	|ПО
	|	ГруппыТоваров.Номенклатура = СтруктураИерархииНоменклатуры.Номенклатура
	|ГДЕ
	|	(НЕ СтруктураИерархииНоменклатуры.Группа.ОсобенностьУчета = ЗНАЧЕНИЕ(Справочник.ОсобенностиУчетаНоменклатуры.ПустаяСсылка))
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаИерархии.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(ТаблицаИерархии.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ
	|	ТаблицаИерархииСрез
	|ИЗ
	|	ТаблицаИерархии КАК ТаблицаИерархии
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИерархии.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаИерархииСрез.Номенклатура КАК Номенклатура,
	|	ТаблицаИерархии.ОсобенностьУчета КАК ОсобенностьУчета
	|ПОМЕСТИТЬ
	|	ОсобенностиУчетаПоГруппам
	|ИЗ
	|	ТаблицаИерархииСрез КАК ТаблицаИерархииСрез
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаИерархии КАК ТаблицаИерархии
	|ПО
	|	ТаблицаИерархии.Номенклатура = ТаблицаИерархииСрез.Номенклатура И 
	|	ТаблицаИерархии.Приоритет = ТаблицаИерархииСрез.Приоритет
	|;
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ТабНоменклатура.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ ТабНоменклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Справочник.ОсобенностиУчетаНоменклатуры.ПустаяСсылка) ТОГДА
	|			ТабНоменклатура.ОсобенностьУчета
	|		КОГДА (НЕ ОсобенностиУчетаПоГруппам.ОсобенностьУчета ЕСТЬ NULL) ТОГДА
	|			ОсобенностиУчетаПоГруппам.ОсобенностьУчета
	|		ИНАЧЕ
	|			ТабНоменклатура.ОсобенностьУчетаПоТипу
	|	КОНЕЦ КАК ОсобенностьУчета
	|ИЗ
	|	ТабНоменклатура КАК ТабНоменклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ОсобенностиУчетаПоГруппам КАК ОсобенностиУчетаПоГруппам
	|ПО
	|	ТабНоменклатура.Родитель = ОсобенностиУчетаПоГруппам.Номенклатура
	|";
	
	//Запрос.Текст = СтрЗаменить(ТекстЗапроса, "#УсловиеОтбора", УсловиеОтбора);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Справочники.ОсобенностиУчетаНоменклатуры.ПустаяСсылка();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат = Выборка.ОсобенностьУчета;
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	// laza ОбязательныеРеквизиты.Добавить("Артикул");
	
	// Обработаем в зависимости от вида элемента	
	Если НЕ Объект.ЭтоГруппа Тогда
		
		ОбязательныеРеквизиты.Добавить("ТипНоменклатуры");
		// RADV - в прайс-листах можеь не быть артикула
		ОбязательныеРеквизиты.Добавить("ВидНоменклатуры");
		ОбязательныеРеквизиты.Добавить("СтавкаНДС");
		ОбязательныеРеквизиты.Добавить("БазоваяЕдиницаИзмерения");
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ОбязательныеРеквизиты.Добавить("ОсновнаяЕдиницаИзмерения");
		КонецЕсли;
		Если Объект.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
			ОбязательныеРеквизиты.Добавить("СпособРаспределенияДопРасходов");
		КонецЕсли;
		Если Объект.СпособРаспределенияДопРасходов = Перечисления.СпособыРаспределенияДопРасходов.НаДоходыИРасходы Тогда
			ОбязательныеРеквизиты.Добавить("СтатьяДопРасходов");
		КонецЕсли;
		
		ОбязательныеРеквизиты.Добавить("ВалютаУчета");
		
		// Проверка на уникальность строк в табличной части "Состав набора".
		Если Объект.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Комплект ИЛИ Объект.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Набор Тогда
			ОбязательныеРеквизиты.Добавить("СоставНабора.Номенклатура");
			ОбязательныеРеквизиты.Добавить("СоставНабора.Количество");
		КонецЕсли;
		
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты =  Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Обработаем в зависимости от вида элемента
	Если НЕ Объект.ЭтоГруппа Тогда
		
		// Проверка на уникальность строк в табличной части "Состав набора".
		Если Объект.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Комплект ИЛИ Объект.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Набор Тогда
			УникальныеСоставНабора = Новый Массив;
			УникальныеСоставНабора.Добавить("Номенклатура");
			УникальныеСоставНабора.Добавить("ХарактеристикаНоменклатуры");
			УникальныеРеквизиты.Вставить("СоставНабора", УникальныеСоставНабора);
		КонецЕсли;
		
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("СпособРаспределенияДопРасходов");
	Результат.Добавить("ЦеноваяГруппа");
	Возврат Результат;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ


// Обработчик события возникающего при изменении данных реквизита "Тип номенклатуры".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура ТипНоменклатурыПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.ВидНоменклатуры<>Объект.ТипНоменклатуры.ВидНоменклатуры Тогда
		Объект.ВидНоменклатуры=Объект.ТипНоменклатуры.ВидНоменклатуры;
	КонецЕсли;
	
	Если НЕ Объект.ЭтоГруппа Тогда
		Объект.БазоваяЕдиницаИзмерения = Объект.ТипНоменклатуры.БазоваяЕдиницаИзмерения;
	КонецЕсли;
	
КонецПроцедуры // ТипНоменклатурыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Производитель".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура ПроизводительПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Объект.Производитель) И (НЕ ЗначениеЗаполнено(Объект.СтранаПроисхождения)) Тогда
		Объект.СтранаПроисхождения = Объект.Производитель.СтранаПроисхождения;
	КонецЕсли;
	
КонецПроцедуры // ПроизводительПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура СтавкаНДСПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если НЕ ПроверитьКорректностьСтавкиНДС(Объект) Тогда
		ВывестиСообщение(НСтр("ru = 'Указана недействительная ставка НДС!'"), Объект);
	КонецЕсли;
	
КонецПроцедуры // СтавкаНДСПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
	Неопределено,
	"Ценники",
	НСтр("ru = 'Печать ценников'"),
	СсылкаНаДокумент,
	"УправлениеПечатиЭтикетокИЦенниковКлиент.ПодготовкаПечати");
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
	Неопределено,
	"Этикетки",
	НСтр("ru = 'Печать этикеток'"),
	СсылкаНаДокумент,
	"УправлениеПечатиЭтикетокИЦенниковКлиент.ПодготовкаПечати");
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

// Функция помещает необходимые данные в структуру. Структура помещается во временное хранилище.
//
// Возвращаемое значение:
//	Адрес   - адрес структуры данных во временном хранилище.
//
Функция ПолучитьДанныеДляПечатиЭтикеток(МассивЭлементов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	спрНоменклатура.Ссылка   КАК Номенклатура,
	|	спрНоменклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МИНИМУМ(1) КАК Порядок,
	|	СУММА(1) КАК Количество
	|ИЗ
	|	Справочник.Номенклатура КАК спрНоменклатура
	|	
	|ГДЕ
	|	спрНоменклатура.Ссылка В(&МассивЭлементов)
	|
	|СГРУППИРОВАТЬ ПО
	|	спрНоменклатура.Ссылка,
	|	спрНоменклатура.ОсновнаяЕдиницаИзмерения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	Запрос.УстановитьПараметр("МассивЭлементов", МассивЭлементов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// Подготовка структуры действий для обработки печати ценников и этикеток
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ОсновныйТипЦенПродаж = ПравоПользователя("ОсновнойТипЦенПродажи");
	ОсновнойСклад = ПравоПользователя("ОсновнойСкладКомпании");
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьОрганизацию", ?(ЗначениеЗаполнено(Пользователь.Организация), Пользователь.Организация, Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьПодразделениеКомпании", ?(ЗначениеЗаполнено(Пользователь.ПодразделениеКомпании), Пользователь.ПодразделениеКомпании, Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьСклад",       ?(ЗначениеЗаполнено(ОсновнойСклад),ОсновнойСклад,Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьТипЦены",     ?(ЗначениеЗаполнено(ОсновныйТипЦенПродаж), ОсновныйТипЦенПродаж, Неопределено));
	СтруктураДействий.Вставить("ПоказыватьКолонкуКоличествоВДокументе", Ложь);
	СтруктураДействий.Вставить("УстановитьРежим", "ПечатьЭтикеток");
	СтруктураДействий.Вставить("ЗаполнитьКоличествоЭтикетокПоДокументу");
	СтруктураДействий.Вставить("ЗаполнитьТаблицуТоваров");
	
	// Подготовка данных для заполнения табличной части обработки печати ценников и этикеток.
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Товары", МассивРезультатов[0].Выгрузить());
	СтруктураРезультат.Вставить("СтруктураДействий", СтруктураДействий);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураРезультат);
	
КонецФункции

// Функция помещает необходимые данные в структуру. Структура помещается во временное хранилище.
//
// Возвращаемое значение:
//	Адрес - адрес структуры данных во временном хранилище.
//
Функция ПолучитьДанныеДляПечатиЦенников(МассивЭлементов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	спрНоменклатура.Ссылка   КАК Номенклатура,
	|	спрНоменклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МИНИМУМ(1) КАК Порядок,
	|	СУММА(1) КАК Количество
	|ИЗ
	|	Справочник.Номенклатура КАК спрНоменклатура
	|	
	|ГДЕ
	|	спрНоменклатура.Ссылка В(&МассивЭлементов)
	|
	|СГРУППИРОВАТЬ ПО
	|	спрНоменклатура.Ссылка,
	|	спрНоменклатура.ОсновнаяЕдиницаИзмерения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	Запрос.УстановитьПараметр("МассивЭлементов", МассивЭлементов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// Подготовка структуры действий для обработки печати ценников и этикеток
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ОсновныйТипЦенПродаж = ПравоПользователя("ОсновнойТипЦенПродажи");
	ОсновнойСклад = ПравоПользователя("ОсновнойСкладКомпании");
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьОрганизацию", ?(ЗначениеЗаполнено(Пользователь.Организация), Пользователь.Организация, Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьПодразделениеКомпании", ?(ЗначениеЗаполнено(Пользователь.ПодразделениеКомпании), Пользователь.ПодразделениеКомпании, Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьСклад",       ?(ЗначениеЗаполнено(ОсновнойСклад), ОсновнойСклад, Неопределено));
	СтруктураДействий.Вставить("ЗаполнитьТипЦены",     ?(ЗначениеЗаполнено(ОсновныйТипЦенПродаж), ОсновныйТипЦенПродаж, Неопределено));
	СтруктураДействий.Вставить("ПоказыватьКолонкуКоличествоВДокументе", Истина);
	СтруктураДействий.Вставить("УстановитьРежим", "ПечатьЦенников");
	СтруктураДействий.Вставить("ЗаполнитьКоличествоЭтикетокПоДокументу");
	СтруктураДействий.Вставить("ЗаполнитьТаблицуТоваров");
	
	// Подготовка данных для заполнения табличной части обработки печати ценников и этикеток.
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Товары", МассивРезультатов[0].Выгрузить());
	СтруктураРезультат.Вставить("СтруктураДействий", СтруктураДействий);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураРезультат);
	
КонецФункции

	
#КонецЕсли

#Область ОбработчикиСобытий

// Обработчик события возникающего при изменении данных реквизита "Тип номенклатуры".
//
// Параметры:
//  ДанныеВыбора         - СписокЗначений - В обработчике можно сформировать и передать
//                                          в этом параметре данные для выбора.
//  Параметры            - Структура      - Содержит параметры выбора
//  СтандартнаяОбработка - Булево         - В данный параметр передается признак выполнения стандартной
//                                          (системной) обработки события.
//
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПоКодамПоставщика") Тогда
		
		Если НЕ ЗначениеЗаполнено(Параметры.ПоКодамПоставщика) ИЛИ НЕ Параметры.Свойство("СтрокаПоиска") ИЛИ Параметры.Свойство("СтрокаПоиска") И НЕ ЗначениеЗаполнено(Параметры.СтрокаПоиска) Тогда
			Возврат;
		КонецЕсли;
		
		// ищем
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
		|	ПрайсЛисты.Номенклатура КАК Номенклатура,
		|	ПрайсЛисты.Артикул КАК Артикул,
		|	1 КАК КодСортировки
		|ПОМЕСТИТЬ ВременнаяТаблицаПрайсЛист
		|ИЗ
		|	РегистрСведений.ПрайсЛистыКонтрагентов КАК ПрайсЛисты
		|ГДЕ
		|	ПрайсЛисты.ПрайсЛист.Владелец = &Контрагент
		|	И ПрайсЛисты.Номенклатура <> &ПустаяСсылка
		|	И ПрайсЛисты.Артикул ПОДОБНО &ТекстПоиска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
		|	ПодборНоменклатуры.Ссылка КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ПодборНоменклатуры.НаименованиеИностранное ПОДОБНО &ТекстПоиска
		|			ТОГДА ПодборНоменклатуры.НаименованиеИностранное
		|		КОГДА ПодборНоменклатуры.Артикул ПОДОБНО &ТекстПоиска
		|			ТОГДА ПодборНоменклатуры.Артикул
		|		КОГДА ПодборНоменклатуры.Наименование ПОДОБНО &ТекстПоиска
		|			ТОГДА ПодборНоменклатуры.Наименование
		|		КОГДА ПодборНоменклатуры.НаименованиеПолное ПОДОБНО &ТекстПоиска
		|			ТОГДА ПодборНоменклатуры.НаименованиеПолное
		|		КОГДА ПодборНоменклатуры.Код ПОДОБНО &ТекстПоиска
		|			ТОГДА ПодборНоменклатуры.Код
		|	КОНЕЦ КАК Артикул,
		|	ВЫБОР
		|		КОГДА ПодборНоменклатуры.Артикул ПОДОБНО &ТекстПоиска
		|			ТОГДА 2
		|		КОГДА ПодборНоменклатуры.Наименование ПОДОБНО &ТекстПоиска
		|			ТОГДА 3
		|		КОГДА ПодборНоменклатуры.НаименованиеПолное ПОДОБНО &ТекстПоиска
		|			ТОГДА 4
		|		КОГДА ПодборНоменклатуры.НаименованиеИностранное ПОДОБНО &ТекстПоиска
		|			ТОГДА 5
		|		КОГДА ПодборНоменклатуры.Код ПОДОБНО &ТекстПоиска
		|			ТОГДА 6
		|	КОНЕЦ КАК КодСортировки
		|ПОМЕСТИТЬ ВременнаяТаблицаНоменклатура
		|ИЗ
		|	Справочник.Номенклатура КАК ПодборНоменклатуры
		|ГДЕ
		|	(ПодборНоменклатуры.Наименование ПОДОБНО &ТекстПоиска
		|			ИЛИ ПодборНоменклатуры.НаименованиеИностранное ПОДОБНО &ТекстПоиска
		|			ИЛИ ПодборНоменклатуры.Артикул ПОДОБНО &ТекстПоиска
		|			ИЛИ ПодборНоменклатуры.Код ПОДОБНО &ТекстПоиска)
		|	И НЕ ПодборНоменклатуры.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
		|	ЕСТЬNULL(ВременнаяТаблицаПрайсЛист.Номенклатура, ВременнаяТаблицаНоменклатура.Номенклатура) КАК Номенклатура,
		|	ЕСТЬNULL(ВременнаяТаблицаПрайсЛист.Артикул, ВременнаяТаблицаНоменклатура.Артикул) КАК Артикул
		|ИЗ
		|	ВременнаяТаблицаПрайсЛист КАК ВременнаяТаблицаПрайсЛист
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНоменклатура КАК ВременнаяТаблицаНоменклатура
		|		ПО ВременнаяТаблицаПрайсЛист.Номенклатура = ВременнаяТаблицаНоменклатура.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВременнаяТаблицаПрайсЛист.Номенклатура, 0) = 0
		|			ТОГДА ВременнаяТаблицаНоменклатура.КодСортировки
		|		КОГДА ЕСТЬNULL(ВременнаяТаблицаНоменклатура.Номенклатура, 0) = 0
		|			ТОГДА ВременнаяТаблицаПрайсЛист.КодСортировки
		|	КОНЕЦ";
		Запрос.УстановитьПараметр("Контрагент",Параметры.ПоКодамПоставщика);
		Запрос.УстановитьПараметр("ПустаяСсылка",Справочники.Номенклатура.ПустаяСсылка());
		Запрос.УстановитьПараметр("ТекстПоиска", "" + Параметры.СтрокаПоиска + "%");
		Выборка = Запрос.Выполнить();
		
		// смотрим, что в результате
		Если НЕ Выборка.Пустой() Тогда
			
			РезультатПоиска = Выборка.Выбрать();
			
			// коды найдены.
			СтандартнаяОбработка = Ложь;
			ДанныеВыбора = Новый СписокЗначений();
			
			Пока РезультатПоиска.Следующий() Цикл
				ДанныеВыбора.Добавить(РезультатПоиска.Номенклатура,РезультатПоиска.Артикул + " (" + РезультатПоиска.Номенклатура + ")");
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //ОбработкаПолученияДанныхВыбора()

#КонецОбласти