// Модуль справочника Номенклатура

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПроверитьОграниченияЗаполненияГруппы(Номенклатура, ГруппаТоваров)
	
	Если ГруппаТоваров.ОграниченияЗаполненияГруппы.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Результат = Ложь;
	Для Каждого СтрокаГруппа Из ГруппаТоваров.ОграниченияЗаполненияГруппы Цикл
		
		Результат = Номенклатура.ПринадлежитЭлементу(СтрокаГруппа.ТипГруппаНоменклатуры);
		
		Если Результат Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает результат проверки на соответствие номенклатуры и режима заполнения группы товаров.
//
// Параметры
//  Номенклатура -  Объект           - Номенклатура, которая участвует в проверке на соответствие.
//  ГруппаТоваров - СправочникСсылка - Группа товаров оборудования.
//
Функция СоответствуетЗаполнениюГруппы(Номенклатура, ГруппаТоваров)
	
	Результат = Ложь;
	
	Если ГруппаТоваров.РежимЗаполнения = 0 Тогда 
		Результат = ПроверитьОграниченияЗаполненияГруппы(Номенклатура, ГруппаТоваров); // Все товары
	ИначеЕсли ГруппаТоваров.РежимЗаполнения = 1 Тогда
		Результат = Номенклатура.ТипНоменклатуры.Весовой И ПроверитьОграниченияЗаполненияГруппы(Номенклатура, ГруппаТоваров); // Весовой товар
	ИначеЕсли ГруппаТоваров.РежимЗаполнения = 2 Тогда
		Результат = (НЕ Номенклатура.ТипНоменклатуры.Весовой) И ПроверитьОграниченияЗаполненияГруппы(Номенклатура, ГруппаТоваров); // Штучный товар
	ИначеЕсли ГруппаТоваров.РежимЗаполнения = 3 Тогда // Типы товара из списка
		Результат = 
		(ГруппаТоваров.ОграниченияЗаполненияГруппы.Найти(Номенклатура.ТипНоменклатуры, "ТипГруппаНоменклатуры") <> Неопределено);		
	//ИначеЕсли ГруппаТоваров.РежимЗаполнения = 4 Тогда // Товар в иерархии из списка
		//Для Каждого СтрокаГруппа Из ГруппаТоваров.ОграниченияЗаполненияГруппы Цикл
		//	
		//	Результат = Номенклатура.ПринадлежитЭлементу(СтрокаГруппа.ТипГруппаНоменклатуры);
		//	
		//	Если Результат Тогда 
		//		Прервать; 
		//	КонецЕсли;
		//	
		//КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СоответствуетЗаполнениюГруппы()

// Добавляет элемент номенклатуры в товары в оборудовании
Процедура ДобавитьВГруппыОборудования(ВходнойОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокГрупп = Новый СписокЗначений;
	ГруппыТоваровВыборка = Справочники.ГруппыТоваровОборудования.Выбрать();
	Пока ГруппыТоваровВыборка.Следующий() Цикл
		ГруппаТоваров = ГруппыТоваровВыборка.Ссылка;
		ПередачаПослеПечати = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.ПередачаВОборудованиеПослеПечати, Справочники.ГруппыТоваровОборудования.ПолучитьПодразделениеКомпанииПоГруппеТоваров(ГруппаТоваров));
		Если НЕ ГруппыТоваровВыборка.АвтоматическиЗаполнятьНовымТоваром Тогда
			Продолжить;
		КонецЕсли;
	
		Если НЕ СоответствуетЗаполнениюГруппы(ВходнойОбъект.Ссылка, ГруппаТоваров) Тогда
			Продолжить;
		КонецЕсли;
		
		// Наложим блокировку на считываемые данные
		СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрСведений", "ТоварыВОборудовании");
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("ГруппаТоваров", ГруппаТоваров);
		
		Отказ = Ложь;
		ОбработкаСобытийДокументаСервер.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки,,Отказ);
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		//НомерЯчейки = РегистрыСведений.ТоварыВОборудовании.ПолучитьНомерНовойЯчейки(ГруппаТоваров, ГруппыТоваровВыборка.ЗаполнятьПропуски);
		НомерЯчейки = 0;
		КоличествоСвободныхЯчеек = 0;
		
		Если ГруппыТоваровВыборка.ЗаполнятьПропуски Тогда
			СвободныеНомераЯчеек = РегистрыСведений.ТоварыВОборудовании.ПолучитьСвободныеНомераЯчеек(ГруппаТоваров);
			КоличествоСвободныхЯчеек = СвободныеНомераЯчеек.Количество();
		Иначе
			НомерЯчейки = РегистрыСведений.ТоварыВОборудовании.ПолучитьМаксимальныйНомерЯчейки(ГруппаТоваров);
		КонецЕсли;
		
		Если КоличествоСвободныхЯчеек>0 Тогда
			ТекущийИндекс = КоличествоСвободныхЯчеек-1;
			НомерЯчейки = СвободныеНомераЯчеек[ТекущийИндекс];
			СвободныеНомераЯчеек.Удалить(ТекущийИндекс);
		Иначе
			НомерЯчейки = НомерЯчейки+1;
		КонецЕсли;
		
		ЗаписьТоварыВОборудовании = РегистрыСведений.ТоварыВОборудовании.СоздатьМенеджерЗаписи();
		ЗаписьТоварыВОборудовании.ГруппаТоваров   = ГруппаТоваров;
		ЗаписьТоварыВОборудовании.Номенклатура    = ВходнойОбъект.Ссылка;
		ЗаписьТоварыВОборудовании.НомерЯчейки     = НомерЯчейки;
		ЗаписьТоварыВОборудовании.МоментИзменения = ТекущаяДатаСеанса();
		ЗаписьТоварыВОборудовании.ВыполненаПечатьЦенников = ?(ПередачаПослеПечати = Неопределено, Истина, НЕ ПередачаПослеПечати);
		ЗаписьТоварыВОборудовании.Записать();
		
		ДанныеУценки = РегистрыСведений.ТоварыВОборудовании.ПолучитьДанныеУценки(ВходнойОбъект.Ссылка, ГруппаТоваров);
		Для Каждого ТекущаяСтрока Из ДанныеУценки Цикл
			
			Если КоличествоСвободныхЯчеек>0 Тогда
				ТекущийИндекс = КоличествоСвободныхЯчеек-1;
				НомерЯчейки = СвободныеНомераЯчеек[ТекущийИндекс];
				СвободныеНомераЯчеек.Удалить(ТекущийИндекс);
			Иначе
				НомерЯчейки = НомерЯчейки+1;
			КонецЕсли;
			
			ЗаписьТоварыВОборудовании = РегистрыСведений.ТоварыВОборудовании.СоздатьМенеджерЗаписи();
			ЗаписьТоварыВОборудовании.ГруппаТоваров   = ГруппаТоваров;
			ЗаписьТоварыВОборудовании.Номенклатура    = ТекущаяСтрока.Номенклатура;
			ЗаписьТоварыВОборудовании.ШтрихКод        = ТекущаяСтрока.ШтрихКод;
			ЗаписьТоварыВОборудовании.НомерЯчейки     = НомерЯчейки;
			ЗаписьТоварыВОборудовании.МоментИзменения = ТекущаяДатаСеанса();
			ЗаписьТоварыВОборудовании.ВыполненаПечатьЦенников = ?(ПередачаПослеПечати = Неопределено, Истина, НЕ ПередачаПослеПечати);
			ЗаписьТоварыВОборудовании.Записать();
		КонецЦикла;
		
		// Семья (Проект Свежесть)
		Если ЗначениеЗаполнено(СокрЛП(ШтрихКодСвежесть)) Тогда
			
			Если КоличествоСвободныхЯчеек>0 Тогда
				ТекущийИндекс = КоличествоСвободныхЯчеек-1;
				НомерЯчейки = СвободныеНомераЯчеек[ТекущийИндекс];
				СвободныеНомераЯчеек.Удалить(ТекущийИндекс);
			Иначе
				НомерЯчейки = НомерЯчейки+1;
			КонецЕсли;
			
			ЗаписьТоварыВОборудовании = РегистрыСведений.ТоварыВОборудовании.СоздатьМенеджерЗаписи();
			ЗаписьТоварыВОборудовании.ГруппаТоваров   = ГруппаТоваров;
			ЗаписьТоварыВОборудовании.Номенклатура    = ВходнойОбъект.Ссылка;
			ЗаписьТоварыВОборудовании.Штрихкод		  = ШтрихКодСвежесть;
			ЗаписьТоварыВОборудовании.НомерЯчейки     = НомерЯчейки;
			ЗаписьТоварыВОборудовании.МоментИзменения = ТекущаяДатаСеанса();
			ЗаписьТоварыВОборудовании.ВыполненаПечатьЦенников = ?(ПередачаПослеПечати = Неопределено, Истина, НЕ ПередачаПослеПечати);
			ЗаписьТоварыВОборудовании.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ДобавитьВГруппыОборудования()



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик заполнения при вводе нового на основании
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	РодительскаяГруппа = ЭтотОбъект.Родитель;
	
	// Заполняем специфические для данного объекта реквизиты
	Пока ЗначениеЗаполнено(РодительскаяГруппа) Цикл
		
		Если (НЕ ЭтотОбъект.ЭтоГруппа) И (НЕ ЗначениеЗаполнено(ЭтотОбъект.СпособРаспределенияДопРасходов)) И ЗначениеЗаполнено(РодительскаяГруппа.СпособРаспределенияДопРасходов) Тогда
			ЭтотОбъект.СпособРаспределенияДопРасходов = РодительскаяГруппа.СпособРаспределенияДопРасходов;
		КонецЕсли;
		Если (НЕ ЭтотОбъект.ЭтоГруппа) И (НЕ ЗначениеЗаполнено(ЭтотОбъект.СтатьяДопРасходов)) И ЗначениеЗаполнено(РодительскаяГруппа.СтатьяДопРасходов) Тогда
			ЭтотОбъект.СтатьяДопРасходов = РодительскаяГруппа.СтатьяДопРасходов;
		КонецЕсли;
		
		РодительскаяГруппа = РодительскаяГруппа.Родитель;
		
	КонецЦикла;
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "СпособРаспределенияДопРасходов,СтатьяДопРасходов, ЭтоГруппа, Артикул") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ТипНоменклатуры) Тогда
		Справочники.Номенклатура.ТипНоменклатурыПриИзменении(ЭтотОбъект);
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВидНоменклатуры) Тогда
		ЭтотОбъект.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ВалютаУчета) Тогда
			ЭтотОбъект.ВалютаУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СтавкаНДС) Тогда
			ЭтотОбъект.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.БазоваяЕдиницаИзмерения) Тогда
			ЭтотОбъект.БазоваяЕдиницаИзмерения = Константы.ОсновнаяЕдиницаИзмеренияКоличества.Получить();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

// Стандартный обработчик копирования объекта
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	// Затираем артикул - все равно он будет новый
	Если НЕ ОбъектКопирования.ЭтоГруппа Тогда
		ЭтотОбъект.Артикул = "";
		//тк+
		ИдентификаторНачальнойЗагрузки="";
		//тк-
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи объекта.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим корректность заполнения количества для серийного товара
	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		ОбработкаСобытийОбъектаСервер.ПроверитьКоличествоСерийнойНоменклатуры(ЭтотОбъект, Отказ);
		
		НайденнаяНоменклатура = Справочники.Номенклатура.НайтиНоменклатуру(Артикул, Производитель,Ссылка);
		
		// Информируем пользователя о найденной коллизии
		Если ЗначениеЗаполнено(НайденнаяНоменклатура) Тогда
			Если ЗначениеЗаполнено(Производитель) Тогда
				ВывестиСообщение(НСтр("ru = 'Поля ""Артикул"" и ""Производитель"" не уникальны в пределах ""Номенклатуры""'"),ЭтотОбъект,,,Отказ);
			Иначе 
				ВывестиСообщение(НСтр("ru = 'Поле ""Артикул"" не уникально в пределах ""Номенклатуры""'"),ЭтотОбъект,,,Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Справочники.Номенклатура.ПроверитьКорректностьСтавкиНДС(ЭтотОбъект) Тогда
			ВывестиСообщение(НСтр("ru = 'Указана недействительная ставка НДС!'"), ЭтотОбъект,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередЗаписью(Отказ)
	
	Если (НЕ ЭтоГруппа) И ПустаяСтрока(ЕРПМастерКлюч) И (НЕ ПометкаУдаления) Тогда
		Отказ = Истина;
		ЗаписьЖурналаРегистрации("Запись номенклатуры", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Номенклатура, ЭтотОбъект, "Не заполнен ЕРПМастерКлюч");
	КонецЕсли;
	
	Если (НЕ ЭтоГруппа) И ЗначениеЗаполнено(ОсновнаяЕдиницаИзмерения) И (НЕ ПометкаУдаления) и ПустаяСтрока(ОсновнаяЕдиницаИзмерения.ЕРПМастерКлюч) Тогда
		Отказ = Истина;
		ЗаписьЖурналаРегистрации("Запись номенклатуры", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Номенклатура, ЭтотОбъект, "Нельзя выбирать основной единицей измерения элемент без ЕРП-мастер-ключа");
	КонецЕсли;	
	
	//Мальцев А.Ю. +++
	Если Не Ссылка.Пустая() И ЗначениеЗаполнено(Ссылка.итГруппаКСО) И Ссылка.итГруппаКСО <>  итГруппаКСО Тогда		
		РегистрыСведений.итГруппыКСОНоменклатуры.ДобавитьЗаписьГруппы(Ссылка,Ссылка.итГруппаКСО); 
	Конецесли;
	//Мальцев А.Ю. ---
	
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПередЗаписью(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Произведем очистку лишних параметров номенклатуры
	Если НЕ(ЭтотОбъект.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Набор ИЛИ ЭтотОбъект.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Комплект ИЛИ ЭтотОбъект.ЭтоГруппа) Тогда
		ЭтотОбъект.СоставНабора.Очистить();
	КонецЕсли;
	
	Если ЭтоГруппа И ЭтоНовый() И НЕ ЗначениеЗаполнено(Артикул) Тогда  //skud блок перенесен из ОбработкаЗаполнения
		// получим подходящий артикул для группы
		Запрос=Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	СпрНоменклатура.Артикул КАК Артикул
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ГДЕ
		|	СпрНоменклатура.ЭтоГруппа
		|УПОРЯДОЧИТЬ ПО СпрНоменклатура.Артикул Убыв");
		ТекАртикул=0;
		РезультатАртикул=Запрос.Выполнить();
		Если НЕ РезультатАртикул.Пустой() Тогда
			Выборка=РезультатАртикул.Выбрать(); Выборка.Следующий();
			ВозвСтр=""; Стр=СокрЛП(Выборка.Артикул);
			Для Сч=1 По СтрДлина(Стр) Цикл
				ВозвСтр=ВозвСтр+?(Найти("1234567890",Сред(Стр,Сч,1))=0,"0",Сред(Стр,Сч,1));
			КонецЦикла;
			ТекАртикул=?(ПустаяСтрока(ВозвСтр),0,Число(ВозвСтр));
		КонецЕсли;
		Артикул="Г"+Прав("000000"+Формат(ТекАртикул+1,"ЧГ=0"),6);
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("СтароеЗначениеРодителя",Ссылка.Родитель);
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый И НЕ ЭтоГруппа Тогда
		
		// Добавим номенклатуру в группы товаров оборудования
		ДобавитьВГруппыОборудования(ЭтотОбъект)
		
	КонецЕсли;
	
	Если (НЕ ЭтоГруппа) И (НЕ ЗначениеЗаполнено(ОсновнаяЕдиницаИзмерения)) Тогда
		НоваяЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(Ссылка);
		ОсновнаяЕдиницаИзмерения = НоваяЕдиницаИзмерения;
		Если ЗначениеЗаполнено(ОсновнаяЕдиницаИзмерения) Тогда
			Записать();
		КонецЕсли;
	КонецЕсли;
	
	// Запись в регистр структура иерархии должен выполнятся всегда иначе произойдет рассинхронизация
	Если ЭтоГруппа И ДополнительныеСвойства.СтароеЗначениеРодителя <> Родитель Тогда
		// При смене родителя или создании нового элемента необходимо обновить структуру иерархии
		РегистрыСведений.СтруктураИерархииНоменклатуры.ОбновитьСтруктуруИерархииНоменклатуры(Ссылка);
	КонецЕсли;
	
	
	
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли