////////////////////////////////////////////////////////////////////////////////
// ОСНОВНЫЕ ПРОЦЕДУРЫ, РЕАЛИЗУЮЩИЕ АЛГОРИТМЫ РЕГЛАМЕНТНЫХ И ФОНОВЫХ ЗАДАНИЙ

// Вызов произвольной обработки или функции
Процедура ТестированиеИИсправлениеИБ(Знач СтруктураПараметров) Экспорт
	
	//ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
	//	Метаданные.РегламентныеЗадания.ТестированиеИИсправлениеБазыДанных);

КонецПроцедуры // ТестированиеИИсправлениеИБ()

// Процедура создание обмена с сайтом
Процедура ЗаданиеОбменССайтом(СтруктураПараметров) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ЗаданиеОбменССайтом);

	Если (НЕ ЗначениеЗаполнено(СтруктураПараметров.КодНастройки)) Тогда
		Возврат;
	Иначе
		КодНастройки	= СтруктураПараметров.КодНастройки;	
	КонецЕсли;
	
	НастройкаОбмена = ПланыОбмена.ОбменССайтом.НайтиПоКоду(КодНастройки);
	
	Если (НЕ ЗначениеЗаполнено(НастройкаОбмена)) Тогда
		Возврат;
	КонецЕсли;
	
	Если ( НастройкаОбмена.ПометкаУдаления ) Тогда
		Возврат;
	КонецЕсли;
		
	ОбработкаОбмена					= Обработки.ОбменССайтом.Создать();	
	ОбработкаОбмена.УзелОбмена		= НастройкаОбмена;
	ОбработкаОбмена.ПроизвестиВыгрузкуДанных();
	
КонецПроцедуры // ЗаданиеОбменССайтом()

