
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьИндикациюФормы("КнопкиЦентральнойПанели");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ УПРАВЛЕНИЯ ИНТЕРФЕЙСОМ


&НаКлиенте
Процедура ОбновитьИндикациюФормы(Индикатор)

	
	ТестВставки = СформироватьВставку(Индикатор);
	
	ЭтаФорма[Индикатор] = ТестВставки;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьВставку(НаименованиеВставки)
	
	Если НаименованиеВставки = "КнопкиЦентральнойПанели" Тогда
		// кнопки правой панели
		Возврат "<HTML><HEAD>
		|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
		|<STYLE>BODY {
		|	BACKGROUND: #fffbd2; MARGIN: 0px
		|}
		|BUTTON {
		|	FONT-SIZE: 14px; BORDER-TOP: #aa0000 1px solid; BORDER-RIGHT: #aa0000 1px solid; WIDTH: 225px; BACKGROUND: #cce0ff; BORDER-BOTTOM: #aa0000 1px solid; PADDING-BOTTOM: 5px; PADDING-TOP: 5px; PADDING-LEFT: 10px; BORDER-LEFT: #aa0000 1px solid; PADDING-RIGHT: 10px; font-colore: #CCE0FF
		|}
		|DIV {
		|	HEIGHT: 100%; WIDTH: 100%; VERTICAL-ALIGN: bottom
		|}
		|</STYLE>
		|
		|<META name=GENERATOR content=""MSHTML 11.00.9600.16663""></HEAD>
		|<BODY style=""OVERFLOW: hidden"">
		|<TABLE width=""100%"" align=center border=0>
		|<TBODY>
		|<TR>
		|<TD vAlign=top width=""33%"" align=center><BUTTON id=кнКасса>ВЫБОР КАССЫ (ФР)</BUTTON></TD>
		|<TD vAlign=top width=""33%"" align=center><BUTTON id=кн0Чек>НАЧАЛО СМЕНЫ</BUTTON></TD>
		|<TD vAlign=top width=""33%"" align=center><BUTTON id=кнЯщик>ДЕН.ЯЩИК</BUTTON></TD></TR>
		|<TR>
		|<TD vAlign=bottom width=""33%"" align=center><BUTTON id=кнСтатус>СТАТУС ФР</BUTTON></TD>
		|<TD vAlign=bottom width=""33%"" align=center><BUTTON id=кнХотчет>Х - отчет</BUTTON></TD>
		|<TD vAlign=bottom width=""33%"" align=center><BUTTON id=кнВнесение>ВНЕСЕНИЕ</BUTTON></TD></TR>
		|<TR>
		|<TD vAlign=top width=""33%"" align=center><BUTTON id=кнДокумент>ПОСЛЕДНИЙ ДОК.</BUTTON></TD>
		|<TD vAlign=top width=""33%"" align=center><BUTTON id=кнZотчет>Z - отчет</BUTTON></TD>
		|<TD vAlign=top width=""33%"" align=center><BUTTON id=кнИзъятие>ИЗЪЯТИЕ</BUTTON></TD></TR>
		|<TR>
		|<TD vAlign=bottom width=""33%"" align=center></TD>
		|<TD vAlign=bottom width=""33%"" align=center><BUTTON id=кнГашениеАвторизатора>Закрытие смены авторизатора</BUTTON></TD>
		|<TD vAlign=bottom width=""33%"" align=center><BUTTON id=кнЗакрыть>Закрыть</BUTTON></TD></TR></TBODY></TABLE></BODY></HTML>";
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБРАБОТКИ ДЕЙСТВИЙ ФОРМЫ


&НаКлиенте
Процедура ОбработатьДействиеЗакрыть()
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура кнКассаНажатие()
	
	// ДействиеКасса(ЭтаФорма); // Запускаем действие от имени родителя
	
КонецПроцедуры // кнКассаНажатие()

&НаСервере
Процедура кнСтатусНажатие()
	
	//ДействиеСтатус(ЭтаФорма);
		
КонецПроцедуры // кнСтатусНажатие()

&НаСервере
Процедура кнДокументНажатие()
	
	//ДействиеДокумент(ЭтаФорма);	
	
КонецПроцедуры // кнДокументНажатие()

&НаСервере
Процедура кнЯщикНажатие()
	
	//ДействиеЯщик(ЭтаФорма);
	
КонецПроцедуры // кнЯщикНажатие()

&НаСервере
Процедура кнВнесениеНажатие()
	
	//Если флРазрешитьПроводитьИнкассацию Тогда
	//	ДействиеВнесение(ЭтаФорма);	
	//КонецЕсли;
	
КонецПроцедуры // кнВнесениеНажатие()

&НаСервере
Процедура кнИзъятиеНажатие()
	
	//Если флРазрешитьПроводитьИнкассацию Тогда
	//	ДействиеИзъятие(ЭтотОбъект);
	//КонецЕсли;

КонецПроцедуры // кнИзъятиеНажатие()

&НаСервере
Процедура кн0ЧекНажатие()
	
	//Действие0Чек(ЭтаФорма);	
	
КонецПроцедуры // кн0ЧекНажатие()

&НаСервере
Процедура кнХотчетНажатие()
	
	//ДействиеХОтчет(ЭтаФорма);
	
КонецПроцедуры // кнХотчетНажатие()

&НаСервере
Процедура кнZотчетНажатие()
	
	//ДействиеZОтчет(ЭтаФорма);
	
КонецПроцедуры // кнZотчетНажатие()

&НаСервере
Процедура кнГашениеАвторизатораНажатие()
	
	//ДействиеГашениеАвторизатора(ЭтаФорма);
	
КонецПроцедуры
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОбработатьДействиеФормы(Действие)

	Если Действие = "кнЗакрыть" Тогда
		
		ОбработатьДействиеЗакрыть();
		
	ИначеЕсли Действие = "кнКассаНажатие" Тогда
		
		кнКассаНажатие();
		
	ИначеЕсли Действие = "кнДокумент" Тогда
		
		кнДокументНажатие();
		
	ИначеЕсли Действие = "кнЯщик" Тогда
		
		кнЯщикНажатие();
		
	ИначеЕсли Действие = "кнВнесение" Тогда
		
		кнВнесениеНажатие();
		
	ИначеЕсли Действие = "кнИзъятие" Тогда
		
		кнИзъятиеНажатие();
		
	ИначеЕсли Действие = "кн0Чек" Тогда
		
		кн0ЧекНажатие();
		
	ИначеЕсли Действие = "кнХотчет" Тогда
		
		кнХотчетНажатие();
		
	ИначеЕсли Действие = "кнZотчет" Тогда
		
		кнZотчетНажатие();
		
	ИначеЕсли Действие = "кнГашениеАвторизатора" Тогда
		
		кнГашениеАвторизатораНажатие();
		
	ИначеЕсли Действие = "кнСтатус" Тогда
		
		кнСтатусНажатие();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкиЦентральнойПанелиПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Button = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьДействиеФормы(ДанныеСобытия.Button.id);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
// управление интерфейсом
//
Процедура УправлениеИнтерфейсом() Экспорт
	
	//// Изменим доступность кнопок в зависимости от состояния формы и текущего чека
	//ЭлементыФормы.кнВнесение.Доступность = флРазрешитьПроводитьИнкассацию;
	//ЭлементыФормы.кнИзъятие .Доступность = флРазрешитьПроводитьИнкассацию;
	//
КонецПроцедуры // УправлениеИнтерфейсом()

// перехват окна
//
//Процедура УстановитьПерехватОкна()
//	// Повесим перехват для кнопок управления чеком
//	Рарус_Компонента.УстановитьПерехватОкна("Управление кассой");
//	Рарус_Компонента.ДобавитьКлавишу("Управление кассой",116);	// <F5>
//	Рарус_Компонента.ДобавитьКлавишу("Управление кассой",117);	// <F6>
//	Рарус_Компонента.ДобавитьКлавишу("Управление кассой",120);	// <F9>
//	Рарус_Компонента.ДобавитьКлавишу("Управление кассой",122);	// <F11>

//КонецПроцедуры // УстановитьПерехватОкна()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ФОРМЫ



