// Общий модуль "Утверждение документов (повторного использования)"

// Проверяет участие документа в подсистеме утверждения, получает режим отмены проведения.
//
// Параметры:
//  Документ   - Строка  - Полное имя документа, для которого производится проверка.
//
// Возвращаемое значение:
//  ОтклонениеПриОтменеПроведения - Булево - Истина: при отмене проведения уст. статус «Отклонен», Ложь: «Согласован».
//  Булево  - Участие документа в подсистеме утверждения: Истина - участвует, Ложь - статус не контролируется.
//
Функция КонтролироватьУтверждениеДокумента(Документ, ОтклонениеПриОтменеПроведения = Ложь) Экспорт
	
	ДокументУчаствуетВУтверждении = Ложь;
	ОтклонениеПриОтменеПроведения = Ложь;
	
	// Получаем значение настройки ОтклонениеПриОтменеПроведения из регистра для текущего документа.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИспользоватьУтверждениеДокументов.ОтклонениеПриОтменеПроведения
	                      |ИЗ
	                      |	РегистрСведений.ИспользоватьУтверждениеДокументов КАК ИспользоватьУтверждениеДокументов
	                      |ГДЕ
	                      |	ИспользоватьУтверждениеДокументов.Документ = &Документ
	                      |	И ИспользоватьУтверждениеДокументов.Использовать = ИСТИНА");
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ДокументУчаствуетВУтверждении = Истина;
		ОтклонениеПриОтменеПроведения = Выборка.ОтклонениеПриОтменеПроведения;
	КонецЕсли;
	
	Возврат ДокументУчаствуетВУтверждении;
	
КонецФункции // ИспользоватьУтверждениеДокументов()

// Формирует список доступных статусов утверждения документа.
//
// Параметры:
//  Документ      - Строка - Полное имя документа (из метаданных), для которого выбираются доступные статусы.
//
// Возвращаемое значение:
//   Соответствие  - Перечень доступных статусов утверждения для пользователя/группы доступа.
//
Функция ДоступныеСтатусы(Документ) Экспорт
	
	ДоступныеСтатусы = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ГруппыДоступаПользователи.Ссылка) КАК Количество
		|ПОМЕСТИТЬ КоличествоГруппДоступа
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|ГДЕ
		|	ГруппыДоступаПользователи.Пользователь = &Пользователь
		|	И НЕ ГруппыДоступаПользователи.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГруппыДоступаПользователи.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ГруппаДоступаПользователя
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|ГДЕ
		|	ГруппыДоступаПользователи.Пользователь = &Пользователь
		|	И НЕ ГруппыДоступаПользователи.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА КоличествоГруппДоступа.Количество > 0
		|			ТОГДА ГруппаДоступаПользователя.Ссылка
		|		ИНАЧЕ &Пользователь
		|	КОНЕЦ КАК Объект
		|ПОМЕСТИТЬ ТекОбъект
		|ИЗ
		|	ГруппаДоступаПользователя КАК ГруппаДоступаПользователя,
		|	КоличествоГруппДоступа КАК КоличествоГруппДоступа
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиУтвержденияДокументов.Согласован КАК Согласован,
		|	НастройкиУтвержденияДокументов.Утвержден КАК Утвержден,
		|	НастройкиУтвержденияДокументов.Объект КАК Объект
		|ПОМЕСТИТЬ СтатусыДокумента
		|ИЗ
		|	РегистрСведений.НастройкиУтвержденияДокументов КАК НастройкиУтвержденияДокументов
		|ГДЕ
		|	НастройкиУтвержденияДокументов.Документ = &Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СтатусыДокумента.Согласован, ЛОЖЬ) КАК Согласован,
		|	ЕСТЬNULL(СтатусыДокумента.Утвержден, ЛОЖЬ) КАК Утвержден
		|ИЗ
		|	ТекОбъект КАК ТекОбъект
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыДокумента КАК СтатусыДокумента
		|		ПО ТекОбъект.Объект = СтатусыДокумента.Объект
		|ГДЕ
		|	ЕСТЬNULL(СтатусыДокумента.Объект, 0) <> 0";
	
	Запрос.УстановитьПараметр("Пользователь",  Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Документ",      Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыДокументов.Подготовка, "Подготовка");
		ДоступныеСтатусы.Добавить(Перечисления.СтатусыДокументов.Подготовлен, "Подготовлен");
		
		Если Выборка.Согласован Тогда
			ДоступныеСтатусы.Добавить(Перечисления.СтатусыДокументов.Согласован, "Согласован");
		КонецЕсли;
		
		Если Выборка.Утвержден Тогда
			ДоступныеСтатусы.Добавить(Перечисления.СтатусыДокументов.Утвержден, "Утвержден");
		КонецЕсли;
		
		Если Выборка.Согласован ИЛИ Выборка.Утвержден Тогда
			ДоступныеСтатусы.Добавить(Перечисления.СтатусыДокументов.Отклонен, "Отклонен");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДоступныеСтатусы;
	
КонецФункции // ДоступныеСтатусы()
