//rarus+AleksT 21.09.2020 для Мясницкий ряд
// взято из конфигурации Многозадачник и адаптировано.

#Область РегламентныеИФоновыеЗадания

Процедура ИТ_КонсолидацияИнтернетЗаказов(НачалоПериода_ДатаДоставки = Неопределено, КонецПериода_ДатаДоставки = Неопределено) Экспорт
	
	// ПОДГОТОВКА //
	// Формирование периодов
	ИТ_ОбработкаДанных.ОпределитьЗначение(НачалоПериода_ДатаДоставки,	Тип("Дата"), НачалоДня(ТекущаяДата() + 86400));
	ИТ_ОбработкаДанных.ОпределитьЗначение(КонецПериода_ДатаДоставки,	Тип("Дата"), КонецДня(НачалоПериода_ДатаДоставки));
	
	// Актуализация номенклатуры
	ит_ОбщегоНазначения.ит_ОбновлениеНоменПозицийИз1С77();	
		
	// СБОРКА ДАННЫХ //
	// Получение товаров по заказам и распределение из по видам продукции
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_ИнтернетЗаказ.Ссылка
		|ПОМЕСТИТЬ ЗаказыДляКонсолидации
		|ИЗ
		//rarus+AleksT 25.09.2020 для Мясницкий ряд немного адаптировал
		//|	Документ.ИТ_ИнтернетЗаказ КАК ИТ_ИнтернетЗаказ
		|	Документ.ЗаказПокупателя КАК ИТ_ИнтернетЗаказ
		|ГДЕ
		//|	ИТ_ИнтернетЗаказ.ДатаДоставки >= &НачалоПериода_ДатаДоставки
		//|	И ИТ_ИнтернетЗаказ.ДатаДоставки <= &КонецПериода_ДатаДоставки
		|	ИТ_ИнтернетЗаказ.СрокПоставки >= &НачалоПериода_ДатаДоставки
		|	И ИТ_ИнтернетЗаказ.СрокПоставки <= &КонецПериода_ДатаДоставки
		
		//|	И ИТ_ИнтернетЗаказ.Состояние = &Состояние_Обработка
		
		|	И ИТ_ИнтернетЗаказ.Дата <= &ДатаКонсолидацииЗаказов
		|	И НЕ ИТ_ИнтернетЗаказ.ПометкаУдаления
		|	И ИТ_ИнтернетЗаказ.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИТ_ИнтернетЗаказТовары.Ссылка КАК ДокументОснование,
		|	ИТ_ИнтернетЗаказТовары.Ссылка.ТорговаяТочка КАК ТорговаяТочка,
		|	ИТ_ИнтернетЗаказТовары.Номенклатура.ВидПродукции КАК ВидПродукции,
		|	ИТ_ИнтернетЗаказТовары.Номенклатура КАК Номенклатура,
		|	ИТ_ИнтернетЗаказТовары.Цена КАК Цена,
		|	СУММА(ИТ_ИнтернетЗаказТовары.Сумма) КАК Сумма,
		|	СУММА(ИТ_ИнтернетЗаказТовары.Количество_Шт) КАК Количество_Шт,
		|	СУММА(ИТ_ИнтернетЗаказТовары.Количество_Кг) КАК Количество_Кг
		|ИЗ
		|	Документ.ИТ_ИнтернетЗаказ.Товары КАК ИТ_ИнтернетЗаказТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаказыДляКонсолидации КАК ЗаказыДляКонсолидации
		|		ПО ИТ_ИнтернетЗаказТовары.Ссылка = ЗаказыДляКонсолидации.Ссылка
		|ГДЕ
		|	ИТ_ИнтернетЗаказТовары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИТ_ИнтернетЗаказТовары.Ссылка.ТорговаяТочка,
		|	ИТ_ИнтернетЗаказТовары.Номенклатура,
		|	ИТ_ИнтернетЗаказТовары.Цена,
		|	ИТ_ИнтернетЗаказТовары.Ссылка,
		|	ИТ_ИнтернетЗаказТовары.Номенклатура.ВидПродукции
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТорговаяТочка,
		|	ВидПродукции,
		|	ДокументОснование";
	
	Запрос.УстановитьПараметр("НачалоПериода_ДатаДоставки",	НачалоПериода_ДатаДоставки);
	Запрос.УстановитьПараметр("КонецПериода_ДатаДоставки",	КонецПериода_ДатаДоставки);
	//Запрос.УстановитьПараметр("Состояние_Обработка",		Справочники.ИТ_СостоянияИнтернетЗаказов.Обработка);
	Запрос.УстановитьПараметр("ДатаКонсолидацииЗаказов",	ИТ_ИнтернетЗаказы.ПолучитьДатуКонсолидацииЗаказов());
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	ДанныеТоваров = ПолучитьДанныеТоваров();
	
	// Обнуление
	ТекущаяТорговаяТочка	= Неопределено;
	ТекущийВидПродукции		= Неопределено;
	ДокументОбъект			= Неопределено;
	ДокументОснование		= Неопределено;
	МассивИнтернетЗаказов	= Новый Массив();
	
	Пока ВыборкаДанных.Следующий() Цикл 
		// Формирование связанных документов
		Если ДокументОснование <> ВыборкаДанных.ДокументОснование Тогда 
			ДокументОснование = ВыборкаДанных.ДокументОснование;
			
			Если ДокументОснование <> Неопределено Тогда 
				МассивИнтернетЗаказов.Добавить(ДокументОснование);
			КонецЕсли;
		КонецЕсли;	
		
		// Запись документа
		Если ТекущаяТорговаяТочка <> ВыборкаДанных.ТорговаяТочка
			ИЛИ ТекущийВидПродукции <> ВыборкаДанных.ВидПродукции Тогда 
			
			// Финальная обработка документа и запись связи
			ОбработатьКонсолидированныйДокумент(ДокументОбъект, ДанныеТоваров, МассивИнтернетЗаказов); 
			
			// Создание нового документа
			ТекущаяТорговаяТочка	= ВыборкаДанных.ТорговаяТочка;
			ТекущийВидПродукции		= ВыборкаДанных.ВидПродукции;
			
			ДокументОбъект = Документы.ЗаявкаПокупателя.СоздатьДокумент();
			ДокументОбъект.Дата						= ТекущаяДата();
			ДокументОбъект.ДатаЗаявки				= НачалоПериода_ДатаДоставки;
			ДокументОбъект.ВидПродукции				= ТекущийВидПродукции;
			ДокументОбъект.Контрагент				= ТекущаяТорговаяТочка;
			ДокументОбъект.МастерКлючТТ				= ТекущаяТорговаяТочка.ЕРПМастерКлюч;
			ДокументОбъект.ПредставлениеКонтрагента	= Строка(ТекущаяТорговаяТочка);
			ДокументОбъект.Логин					= "Консолидация интернет заказов";
			ДокументОбъект.Комментарий				= СтрШаблон("Консолидация интернет-заказов от %1.", Формат(ТекущаяДата(), "ДЛФ=DT"));
		КонецЕсли;
		
		// Заполнение товаров
		СтрокаТовара = ДокументОбъект.Товары.Добавить();
		СтрокаТовара.Номенклатура	= ВыборкаДанных.Номенклатура;
		СтрокаТовара.Количество		= ИТ_ОбработкаДанных.ОкруглитьЧисло(ВыборкаДанных.Количество_Шт, 1, Истина);;
		СтрокаТовара.Цена			= ВыборкаДанных.Цена;
	КонецЦикла;
	
	ОбработатьКонсолидированныйДокумент(ДокументОбъект, ДанныеТоваров, МассивИнтернетЗаказов);
	
КонецПроцедуры

Процедура ИТ_РассылкаИнтернетЗаказов(НачалоПериода_ДатаДоставки = Неопределено, КонецПериода_ДатаДоставки = Неопределено) Экспорт
	
	// Формирование периодов
	ИТ_ОбработкаДанных.ОпределитьЗначение(НачалоПериода_ДатаДоставки,	Тип("Дата"), НачалоДня(ТекущаяДата() + 86400));
	ИТ_ОбработкаДанных.ОпределитьЗначение(КонецПериода_ДатаДоставки,	Тип("Дата"), КонецДня(НачалоПериода_ДатаДоставки));
	
	// Определение объектов отправки
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_ИнтернетЗаказ.Ссылка КАК ИнтернетЗаказ,
		|	ИТ_ИнтернетЗаказ.ВариантОтветственногоЗаДоставку КАК ВариантОтветственногоЗаДоставку,
		|	ИТ_ИнтернетЗаказ.СтаршийМенеджер КАК СтаршийМенеджер,
		|	ИТ_ИнтернетЗаказ.ЛинейныйМенеджер КАК ЛинейныйМенеджер
		|ПОМЕСТИТЬ ДокументыДляОтправки
		|ИЗ
		|	Документ.ИТ_ИнтернетЗаказ КАК ИТ_ИнтернетЗаказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИТ_ИсходящиеПисьмаДокументов КАК ИТ_ИсходящиеПисьмаДокументов
		|		ПО ИТ_ИнтернетЗаказ.Ссылка = ИТ_ИсходящиеПисьмаДокументов.Документ
		|ГДЕ
		|	ИТ_ИнтернетЗаказ.ДатаДоставки МЕЖДУ &НачалоПериода_ДатаДоставки И &КонецПериода_ДатаДоставки
		|	И ИТ_ИнтернетЗаказ.Состояние = &Состояние_Сборка
		|	И ИТ_ИсходящиеПисьмаДокументов.Письмо ЕСТЬ NULL
		|	И НЕ ИТ_ИнтернетЗаказ.ПометкаУдаления
		|	И ИТ_ИнтернетЗаказ.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыДляОтправки.ИнтернетЗаказ КАК ИнтернетЗаказ
		|ИЗ
		|	ДокументыДляОтправки КАК ДокументыДляОтправки
		|ГДЕ
		|	ДокументыДляОтправки.ВариантОтветственногоЗаДоставку = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыДляОтправки.ИнтернетЗаказ КАК ИнтернетЗаказ
		|ИЗ
		|	ДокументыДляОтправки КАК ДокументыДляОтправки
		|ГДЕ
		|	ДокументыДляОтправки.ВариантОтветственногоЗаДоставку = 3
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыДляОтправки.ИнтернетЗаказ КАК ИнтернетЗаказ,
		|	Пользователи_СтаршиеМенеджеры.Ссылка КАК СтаршийМенеджер,
		|	Пользователи_ЛинейныеМенеджеры.Ссылка КАК ЛинейныйМенеджер
		|ИЗ
		|	ДокументыДляОтправки КАК ДокументыДляОтправки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи_СтаршиеМенеджеры
		|		ПО ДокументыДляОтправки.СтаршийМенеджер = Пользователи_СтаршиеМенеджеры.ФизическоеЛицо
		|			И (НЕ Пользователи_СтаршиеМенеджеры.ПометкаУдаления)
		|			И (НЕ Пользователи_СтаршиеМенеджеры.Недействителен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи_ЛинейныеМенеджеры
		|		ПО ДокументыДляОтправки.ЛинейныйМенеджер = Пользователи_ЛинейныеМенеджеры.ФизическоеЛицо
		|			И (НЕ Пользователи_ЛинейныеМенеджеры.ПометкаУдаления)
		|			И (НЕ Пользователи_ЛинейныеМенеджеры.Недействителен)
		|ГДЕ
		|	ДокументыДляОтправки.ВариантОтветственногоЗаДоставку = 2
		|ИТОГИ ПО
		|	СтаршийМенеджер,
		|	ЛинейныйМенеджер";
	
	Запрос.УстановитьПараметр("НачалоПериода_ДатаДоставки",	НачалоПериода_ДатаДоставки);
	Запрос.УстановитьПараметр("КонецПериода_ДатаДоставки",	КонецПериода_ДатаДоставки);
	Запрос.УстановитьПараметр("Состояние_Сборка", Справочники.ИТ_СостоянияИнтернетЗаказов.Сборка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// Проверка наличия данных для отправки.
	Если РезультатЗапроса.Получить(1).Пустой()
		И РезультатЗапроса.Получить(2).Пустой()
		И РезультатЗапроса.Получить(3).Пустой()Тогда 
		Возврат;
	КонецЕсли;	
	
	// Общие параметры писем
	ПараметрыПисьма = ПолучитьПараметрыЭлектронногоПисьма();
	ТемаПисьма = "Интернет-заказы ""Мясницкий Ряд""";
	
	// Контролеры рассылки в копии письма
	XMLСтрока = Константы.ИТ_КонтролерыРассылкиИнтернетЗаказов.Получить();
	КонтролерыРассылки = Новый Массив();
	
	Если Не(ПустаяСтрока(XMLСтрока)) Тогда 
		КонтролерыРассылки = глДесериализовать(XMLСтрока);
		КонтролерыРассылки = КонтролерыРассылки.ВыгрузитьКолонку("Контакт");
	КонецЕсли;	
	
	
	// КУРЬЕРЫ
	ТаблицаИнтернетЗаказов = РезультатЗапроса.Получить(1).Выгрузить();
	МассивОбъектовПечати = ТаблицаИнтернетЗаказов.ВыгрузитьКолонку("ИнтернетЗаказ");
	
	Если МассивОбъектовПечати.Количество() > 0 Тогда 
		// Вложения
		ДанныеПечатныхФорм = ПолучитьПечатныеФормыИнтернетЗаказов(МассивОбъектовПечати,,, "ФормаВыгрузки_1");
		ОписанияФайловПечати = ПоместитьПечатныеФормыВоВременноеХранилище(
			ДанныеПечатныхФорм.КоллекцияПечатныхФорм, 
			ДанныеПечатныхФорм.ОбъектыПечати,
			Перечисления.ФорматыСохраненияОтчетов.XLS);
			
		ДанныеПечатныхФорм = ПолучитьПечатныеФормыИнтернетЗаказов(МассивОбъектовПечати);	
		ДополнительныеОписанияФайловПечати = ПоместитьПечатныеФормыВоВременноеХранилище(
			ДанныеПечатныхФорм.КоллекцияПечатныхФорм, 
			ДанныеПечатныхФорм.ОбъектыПечати,
			Перечисления.ФорматыСохраненияОтчетов.XLS);
			
		Для Каждого ОписаниеФайловПечати Из ДополнительныеОписанияФайловПечати Цикл 
	   		ОписанияФайловПечати.Добавить(ОписаниеФайловПечати);	
		КонецЦикла;	
			
		// Текст	
		ТекстПисьма =
			"Алексей, добрый день. 
			|Направляю заказы на завтра."; 
		
		// Получатели
		ПолучателиПисьма = Новый Массив();
		ПолучателиПисьма.Добавить(Справочники.СтроковыеКонтактыВзаимодействий.DeliveryFoodMSK);
		
		// Письмо
		СоздатьЭлектронноеПисьмо(ПолучателиПисьма, КонтролерыРассылки, ТемаПисьма, ТекстПисьма, ОписанияФайловПечати, МассивОбъектовПечати, ПараметрыПисьма);  	
	КонецЕсли;	
	
	
	// ДОСТАВУШКА
	ТаблицаИнтернетЗаказов = РезультатЗапроса.Получить(2).Выгрузить();
	МассивОбъектовПечати = ТаблицаИнтернетЗаказов.ВыгрузитьКолонку("ИнтернетЗаказ");
	
	Если МассивОбъектовПечати.Количество() > 0 Тогда 
		// Вложения
		ДанныеПечатныхФорм = ПолучитьПечатныеФормыИнтернетЗаказов(
			МассивОбъектовПечати, Новый Структура("РазделениеПоТорговымТочкам", Истина),, "ФормаВыгрузки_1");
		ОписанияФайловПечати = ПоместитьПечатныеФормыВоВременноеХранилище(
			ДанныеПечатныхФорм.КоллекцияПечатныхФорм, 
			ДанныеПечатныхФорм.ОбъектыПечати,
			Перечисления.ФорматыСохраненияОтчетов.XLS);
			
		// Текст	
		ТекстПисьма =
			"Добрый день! 
			|Направляю заказы на завтра."; 
		
		// Получатели
		ПолучателиПисьма = Новый Массив();
		ПолучателиПисьма.Добавить(Новый Структура("Адрес,Представление", "egroceryservice@gmail.com", "E-grocery Service"));
		
		// Письмо
		СоздатьЭлектронноеПисьмо(ПолучателиПисьма, КонтролерыРассылки, ТемаПисьма, ТекстПисьма, ОписанияФайловПечати, МассивОбъектовПечати, ПараметрыПисьма);  	
	КонецЕсли;	
	
	
	// ЛИНЕЙНЫЕ МЕНЕДЖЕРЫ
	ВыборкаПоСтаршимМенеджерам = РезультатЗапроса.Получить(3).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоСтаршимМенеджерам.Следующий() Цикл 
		ТекущиеКонтролерыРассылки = Новый Массив();
		ТекущиеКонтролерыРассылки.Добавить(ВыборкаПоСтаршимМенеджерам.СтаршийМенеджер);
		
		Для Каждого КонтролерРассылки Из КонтролерыРассылки Цикл 
			ТекущиеКонтролерыРассылки.Добавить(КонтролерРассылки);
		КонецЦикла;	
		
		// Индивидуальная рассылка по ЛМ
		ВыборкаПоЛинейнымМенеджерам = ВыборкаПоСтаршимМенеджерам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		
		Пока ВыборкаПоЛинейнымМенеджерам.Следующий() Цикл 
			МассивОбъектовПечати = Новый Массив();
			ВыборкаИнтернетЗаказов = ВыборкаПоЛинейнымМенеджерам.Выбрать();
			
			Пока ВыборкаИнтернетЗаказов.Следующий() Цикл 
				МассивОбъектовПечати.Добавить(ВыборкаИнтернетЗаказов.ИнтернетЗаказ);	
			КонецЦикла;	
			
			Если МассивОбъектовПечати.Количество() > 0 Тогда 
				// Вложения
				ДанныеПечатныхФорм = ПолучитьПечатныеФормыИнтернетЗаказов(МассивОбъектовПечати);
				ОписанияФайловПечати = ПоместитьПечатныеФормыВоВременноеХранилище(
					ДанныеПечатныхФорм.КоллекцияПечатныхФорм, 
					ДанныеПечатныхФорм.ОбъектыПечати,
					Перечисления.ФорматыСохраненияОтчетов.XLS);
					
				// Текст	
				ТекстПисьма =
					"Коллеги, добрый день!
					|Во вложениях интернет-заказы на завтра, необходимо сделать доставку.
					|
					|Процедура следующая:
					|1.	Вы приезжаете на ТТ указанную в заказе. 
					|2.	Продавец собирает товар по заказу, как обычному покупателю.
					|	- Если в заказе указано 1 кг докторской в белкозине, соответственно, берем 1 батон.
					|	- Если в заказе указано 1 кг бекона по-французски, соответственно, отрезаем 1 кг.
					|3. На этапе применения карты ПЛ диктуете продавцу номер телефона ПЛ из заявки. ЭТО ОБЯЗАТЕЛЬНО!!!
					|4. Расплачиваетесь с продавцом деньгами по чеку.
					|5. Привозите клиенту продукты с чеком.
					|6. Получаете деньги по чеку + 249 рублей доставки (это Ваш бонус). 
					|
					|Возьмите с собой товарные чеки ООО «ФММР», на случай если клиент будет отказываться оплачивать доставку, т.к. она не указана в основном чеке."; 
				
				// Получатели
				ПолучателиПисьма = Новый Массив();
				ПолучателиПисьма.Добавить(ВыборкаПоЛинейнымМенеджерам.ЛинейныйМенеджер);
				
				// Письмо
				СоздатьЭлектронноеПисьмо(ПолучателиПисьма, ТекущиеКонтролерыРассылки, ТемаПисьма, ТекстПисьма, ОписанияФайловПечати, МассивОбъектовПечати, ПараметрыПисьма);  	
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;	
	
КонецПроцедуры

//Процедура ИТ_ОтправкаИнтернетЗаказовВУКМ() Экспорт
//	
//	//итОбменСРозницей.ВыгрузитьИнтернетЗаказыВУКМ();			
//	
//КонецПроцедуры

//Процедура ИТ_ОперативнаяЗагрузкаЧековИнтернетЗаказовИзУКМ() Экспорт
//	
//	итОбменСРозницей.ЗагрузитьЧекиИнтернетЗаказовИзУКМ();
//	
//КонецПроцедуры

//Процедура ИТ_ОтложеннаяЗагрузкаЧековИнтернетЗаказовИзУКМ() Экспорт
//	
//	НачалоПериода = НачалоДня(ТекущаяДата() - 8 * 86400);
//	КонецПериода = КонецДня(НачалоПериода + 7 * 86400);
//	
//	Пока НачалоПериода <= КонецПериода Цикл 
//		итОбменСРозницей.ЗагрузитьЧекиИнтернетЗаказовИзУКМ(НачалоПериода, КонецПериода);
//		НачалоПериода = НачалоДня(НачалоПериода + 86400);	
//	КонецЦикла;	
//	
//КонецПроцедуры

Процедура ИТ_ОтправкаОтчетовАгентаКлиентам(НачалоПериода = Неопределено, КонецПериода = Неопределено) Экспорт
	
	// ФОРМИРОВАНИЕ ПАРАМЕТРОВ
	ИТ_ОбработкаДанных.ОпределитьЗначение(НачалоПериода,	Тип("Дата"), НачалоДня(ТекущаяДата() - 7 * 86400));
	ИТ_ОбработкаДанных.ОпределитьЗначение(КонецПериода,		Тип("Дата"), КонецДня(ТекущаяДата()));	
	
	
	// ФОРМИРОВАНИЕ ДАННЫХ
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_ИнтернетЗаказ.Ссылка КАК ИнтернетЗаказ,
		|	ИТ_ЧекИнтернетЗаказа.Ссылка КАК ЧекИнтернетЗаказа,
		|	ИТ_ИнтернетЗаказ.АдресЭП КАК Адрес,
		|	ИТ_ИнтернетЗаказ.Фамилия КАК Фамилия,
		|	ИТ_ИнтернетЗаказ.Имя КАК Имя,
		|	ИТ_ИнтернетЗаказ.ВариантОтветственногоЗаДоставку КАК ВариантДоставки
		|ИЗ
		|	Документ.ИТ_ИнтернетЗаказ КАК ИТ_ИнтернетЗаказ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИТ_ЧекИнтернетЗаказа КАК ИТ_ЧекИнтернетЗаказа
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИТ_ИсходящиеПисьмаДокументов КАК ИТ_ИсходящиеПисьмаДокументов
		|			ПО ИТ_ЧекИнтернетЗаказа.Ссылка = ИТ_ИсходящиеПисьмаДокументов.Документ
		|		ПО ИТ_ИнтернетЗаказ.Ссылка = ИТ_ЧекИнтернетЗаказа.ИнтернетЗаказ
		|			И (ИТ_ЧекИнтернетЗаказа.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
		|			И (ИТ_ЧекИнтернетЗаказа.Проведен)
		|			И (НЕ ИТ_ЧекИнтернетЗаказа.ПометкаУдаления)
		|ГДЕ
		|	ИТ_ИсходящиеПисьмаДокументов.Документ ЕСТЬ NULL
		|	И ИТ_ИнтернетЗаказ.ВариантОтветственногоЗаДоставку В (1, 3)
		|	И ИТ_ИнтернетЗаказ.АдресЭП <> """"
		|	И ИТ_ЧекИнтернетЗаказа.Дата <= &ГраницаОтправки";
	
	Запрос.УстановитьПараметр("ГраницаОтправки", ТекущаяДата() - 7 * 3600); // Отсрочка отправки в 7 часов
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;	
	
	ВыборкаПолучателей = РезультатЗапроса.Выбрать();
	ПараметрыПисьма = ПолучитьПараметрыЭлектронногоПисьма();
	ТемаПисьма = "«Мясницкий Ряд» доставка – Отчет о выполнении заказа";
	
	
	// ОТПРАВКА ПИСЕМ
	Пока ВыборкаПолучателей.Следующий() Цикл 
		ПредставлениеКлиента = СокрЛП(СтрШаблон("%1 %2", ВыборкаПолучателей.Фамилия, ВыборкаПолучателей.Имя));
		АдресКлиента = СокрЛП(НРег(ВыборкаПолучателей.Адрес));
		
		Если ПустаяСтрока(АдресКлиента) Тогда
			Продолжить;
		КонецЕсли;	
		
		ПолучателиПисьма = Новый Массив();
		ПолучателиПисьма.Добавить(Новый Структура("Адрес,Представление", АдресКлиента, ПредставлениеКлиента));

		Если ВыборкаПолучателей.ВариантДоставки = 3 Тогда 
			ПолучателиПисьма.Добавить(Новый Структура("Адрес,Представление", "egroceryservice@gmail.com", "E-grocery Service"));
		КонецЕсли;	
		
		МассивОбъектовПечати = Новый Массив();
		МассивОбъектовПечати.Добавить(ВыборкаПолучателей.ИнтернетЗаказ);
		
		МассивСвязанныхДокументов = Новый Массив();
		МассивСвязанныхДокументов.Добавить(ВыборкаПолучателей.ЧекИнтернетЗаказа);
		
		ДанныеПечатныхФорм = ПолучитьПечатныеФормыИнтернетЗаказов(МассивОбъектовПечати,,, "ОтчетАгента");
		ОписанияФайловПечати = ПоместитьПечатныеФормыВоВременноеХранилище(
			ДанныеПечатныхФорм.КоллекцияПечатныхФорм, 
			ДанныеПечатныхФорм.ОбъектыПечати,
			Перечисления.ФорматыСохраненияОтчетов.PDF);
			
		СоздатьЭлектронноеПисьмо(ПолучателиПисьма, Новый Массив(), ТемаПисьма, "", ОписанияФайловПечати, МассивСвязанныхДокументов, ПараметрыПисьма);  	
	КонецЦикла;	
	
КонецПроцедуры

//#Область РегламентныеЗадания_bazium

//Процедура ИТ_ЗагрузкаИнтернетЗаказов_bazium() Экспорт
//	
//	Запрос = Новый Запрос();
//	Запрос.Текст = 
//		"ВЫБРАТЬ ПЕРВЫЕ 1
//		|	ИТ_ИнтернетЗаказ.Идентификатор_bazium КАК Идентификатор_bazium
//		|ИЗ
//		|	Документ.ИТ_ИнтернетЗаказ КАК ИТ_ИнтернетЗаказ
//		|ГДЕ
//		|	ИТ_ИнтернетЗаказ.Проведен
//		|	И НЕ ИТ_ИнтернетЗаказ.ПометкаУдаления
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	Идентификатор_bazium УБЫВ";
//	
//	РезультатЗапроса		= Запрос.Выполнить();
//	ВыборкаИдентификатора	= РезультатЗапроса.Выбрать();
//	
//	Если ВыборкаИдентификатора.Следующий() Тогда 
//		РазмерПорции		= Константы.ИТ_ИнтернетЗаказы_РазмерПорцииBazium.Получить();
//		ИдентификаторЗаказа	= ВыборкаИдентификатора.Идентификатор_bazium;
//		НомерИтерацииЦикла	= 0;
//		
//		Пока ИдентификаторЗаказа > 0 
//			И НомерИтерацииЦикла <= РазмерПорции Цикл 
//			ДанныеЗаказа = ПолучитьДанныеИнтернетЗаказа_bazium(ИдентификаторЗаказа);
//			
//			Если СформироватьИнтернетЗаказ_bazium(ДанныеЗаказа) Тогда 
//				АдресСледующегоЗаказа = ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(ДанныеЗаказа, "next_path", Тип("Строка"), ""); 
//			Иначе
//				// Оправить уведомления об ошибке.
//				Возврат; // Ошибка формирования заказа, дальнейшая обработка остановлена.
//			КонецЕсли;	
//			
//			ЧастиАдресаСледующегоЗаказа = СтрРазделить(АдресСледующегоЗаказа, "/", Ложь);
//			
//			Если ЧастиАдресаСледующегоЗаказа.Количество() = 3 Тогда 
//				ИдентификаторЗаказа = Число(ЧастиАдресаСледующегоЗаказа.Получить(2));
//			Иначе
//				ИдентификаторЗаказа	= 0;
//			КонецЕсли;	
//			
//			НомерИтерацииЦикла	= НомерИтерацииЦикла + 1;
//		КонецЦикла;	
//	Иначе
//		МассивЗаказов = ПолучитьМассивИнтернетЗаказов_bazium();
//		
//		Если МассивЗаказов = Неопределено Тогда 
//			Возврат;
//		КонецЕсли;
//		
//		Для Каждого СтруктураЗаказа Из МассивЗаказов Цикл
//			ДанныеЗаказа = ПолучитьДанныеИнтернетЗаказа_bazium(СтруктураЗаказа.id);
//			СформироватьИнтернетЗаказ_bazium(ДанныеЗаказа);
//		КонецЦикла;	
//	КонецЕсли;	
//	
//КонецПроцедуры

//#КонецОбласти

#КонецОбласти


#Область ПрограммныйИнтерфейс

Функция ОпределитьКлиента(ИнтернетЗаказ) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_КлиентыИнтернетМагазина.Ссылка КАК Клиент
		|ИЗ
		|	Справочник.ИТ_КлиентыИнтернетМагазина КАК ИТ_КлиентыИнтернетМагазина
		|ГДЕ
		|	ИТ_КлиентыИнтернетМагазина.Телефон = &Телефон
		|	И НЕ ИТ_КлиентыИнтернетМагазина.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Телефон", ИнтернетЗаказ.Телефон);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДанных.Следующий() Тогда 
		Возврат ВыборкаДанных.Клиент;
		//КлиентОбъект = ВыборкаДанных.Клиент.ПолучитьОбъект();	
	Иначе
		КлиентОбъект = Справочники.ИТ_КлиентыИнтернетМагазина.СоздатьЭлемент();
	КонецЕсли;	
	
	ЗаполнитьЗначенияСвойств(КлиентОбъект, ИнтернетЗаказ);
	КлиентОбъект.Записать();
	
	// Возврат
	Возврат КлиентОбъект.Ссылка;
	
КонецФункции	

Функция ОпределитьДокументОбъект(Идентификатор, ТолькоНовые = Истина) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ИТ_ИнтернетЗаказ.Ссылка КАК Документ
	//|ИЗ
	//|	Документ.ИТ_ИнтернетЗаказ КАК ИТ_ИнтернетЗаказ
	//|ГДЕ
	//|	ИТ_ИнтернетЗаказ.Идентификатор = &Идентификатор";
	
	//rarus+AleksT 21.09.2020 для Мясницкий ряд
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказПокупателя.Ссылка КАК Документ
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Идентификатор = &Идентификатор
	|
	//rarus+AleksT 05.10.2020 для Мясницкий ряд.
	// Пока сидел в отладке, прилетало несколько http-запросов с сайта - возможно,
	// при долгом не ответе 1С, сайт стучится ещё раз, а объект у нас ещё не записан.
	// Значит, возможны дубли заказов!
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПокупателя.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДанных.Следующий() Тогда 
		Если ТолькоНовые Тогда 
			ДокументОбъект = Неопределено;
		Иначе
			ДокументОбъект = ВыборкаДанных.Документ.ПолучитьОбъект();
		КонецЕсли;
	Иначе
		//ДокументОбъект = Документы.ИТ_ИнтернетЗаказ.СоздатьДокумент();
		ДокументОбъект = Документы.ЗаказПокупателя.СоздатьДокумент();
	КонецЕсли;
	
	// Возврат 
	Возврат ДокументОбъект;
	
КонецФункции

Функция ОпределитьСпособОплатыПоКлючу(КлючСпособаОплаты, ИмяСпособаОплаты = "") Экспорт 
	//rarus+AleksT 25.09.2020 для Мясницкий ряд
	
	Если ПустаяСтрока(КлючСпособаОплаты) Тогда 
		Возврат Справочники.ИТ_СпособыОплатыИнтернетЗаказов.ПустаяСсылка();
		//Возврат Справочники.ТипыОплат.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИТ_СпособыОплатыИнтернетЗаказов.Ссылка КАК СпособОплаты
	|	,ИТ_СпособыОплатыИнтернетЗаказов.ТипОплаты КАК ТипОплаты
	|ИЗ
	|	Справочник.ИТ_СпособыОплатыИнтернетЗаказов КАК ИТ_СпособыОплатыИнтернетЗаказов
	|ГДЕ
	|	ИТ_СпособыОплатыИнтернетЗаказов.Ключ = &Ключ";
	
	КлючСпособаОплаты = СокрЛП(КлючСпособаОплаты);
	Запрос.УстановитьПараметр("Ключ", КлючСпособаОплаты);
	
	РезультатЗапроса	= Запрос.Выполнить();
	ВыборкаДанных		= РезультатЗапроса.Выбрать();
	
	Если ВыборкаДанных.Следующий() Тогда 
		Возврат ВыборкаДанных.СпособОплаты;
	Иначе
		
		НовыйСпособОплаты = Справочники.ИТ_СпособыОплатыИнтернетЗаказов.СоздатьЭлемент();
		НовыйСпособОплаты.Ключ			= КлючСпособаОплаты;
		НовыйСпособОплаты.Наименование	= ?(ПустаяСтрока(ИмяСпособаОплаты), КлючСпособаОплаты, ИмяСпособаОплаты);
		Если СтрНайти(ИмяСпособаОплаты, "Безнал") > 1 Тогда
			НовыйСпособОплаты.ТипОплаты		= Справочники.ТипыОплат.Безналичные;
		ИначеЕсли СтрНайти(ИмяСпособаОплаты, "Наличн") = 1 Тогда
			НовыйСпособОплаты.ТипОплаты		= Справочники.ТипыОплат.Наличные;
		Иначе
			НовыйСпособОплаты.ТипОплаты		= Справочники.ТипыОплат.Безналичные;
		КонецЕсли;
		НовыйСпособОплаты.Записать();
		
		Возврат НовыйСпособОплаты.Ссылка;
	КонецЕсли;
	
КонецФункции //ОпределитьСпособОплатыПоКлючу()

//rarus+AleksT 25.09.2020 для Мясницкий ряд адаптировал под ПодразделенияКомпании
// ДанныеЗаказа.delivery.store.erp
// Возвращает Структуру с полями ПодразделениеКомпании, Организация, СкладКомпании
Функция ОпределитьДанныеТорговойТочки(МастерКлюч, ДанныеЗаказаid = Неопределено) Экспорт
	
	СтруктураДанных = Новый Структура();
	
	Запрос = Новый Запрос();
	//Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ит_ТорговыеТочки.Ссылка КАК ТорговаяТочка,
	//	|	ЕСТЬNULL(ИТ_ЛокацииДоставки.ВариантОтветственногоЗаДоставку, 1) КАК ВариантОтветственногоЗаДоставку
	//	|ИЗ
	//	|	Справочник.ит_ТорговыеТочки КАК ит_ТорговыеТочки
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИТ_ЛокацииДоставки КАК ИТ_ЛокацииДоставки
	//	|		ПО ит_ТорговыеТочки.Ссылка = ИТ_ЛокацииДоставки.ОсновнаяТорговаяТочка
	//	|ГДЕ
	//	|	ит_ТорговыеТочки.ЕРПМастерКлюч = &МастерКлюч
	//	|	И НЕ ит_ТорговыеТочки.ПометкаУдаления
	//	|	И ит_ТорговыеТочки.ЕРПМастерКлюч <> """"";
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодразделенияКомпании.Ссылка КАК ПодразделениеКомпании,
	|	ПодразделенияКомпании.Организация КАК Организация
	|ПОМЕСТИТЬ Подразделения
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|	ПодразделенияКомпании.ЕРПМастерКлюч = &МастерКлюч
	|	И НЕ ПодразделенияКомпании.ПометкаУдаления
	|	И ПодразделенияКомпании.ЕРПМастерКлюч <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Подразделения.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	Подразделения.Организация КАК Организация,
	|	ЕСТЬNULL(СкладыКомпании.Ссылка, ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)) КАК СкладКомпании
	|ИЗ
	|	Подразделения КАК Подразделения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СкладыКомпании КАК СкладыКомпании
	|		ПО (СкладыКомпании.ПодразделениеКомпании = Подразделения.ПодразделениеКомпании)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СкладыКомпании.мрТорговыйЗал УБЫВ,
	|	СкладыКомпании.ПометкаУдаления";
	
	//rarus+AleksT 25.09.2020 для Мясницкий ряд
	//В справочнике ЕРП Маппинг для загрузки есть такое:
	//30 ТорговыеТочки	dbo.Outlets	ПодразделенияКомпании
	Запрос.УстановитьПараметр("МастерКлюч", МастерКлюч);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДанных = РезультатЗапроса.Выбрать();
		ВыборкаДанных.Следующий();
		//СтруктураДанных.Вставить("ТорговаяТочка", ВыборкаДанных.ТорговаяТочка);
		//СтруктураДанных.Вставить("ВариантОтветственногоЗаДоставку", ВыборкаДанных.ВариантОтветственногоЗаДоставку);
		СтруктураДанных.Вставить("ПодразделениеКомпании",	ВыборкаДанных.ПодразделениеКомпании);
		СтруктураДанных.Вставить("Организация",				ВыборкаДанных.Организация);
		СтруктураДанных.Вставить("СкладКомпании",			ВыборкаДанных.СкладКомпании);
	Иначе
		ЗаписьЖурналаРегистрации("ExternalTransfer.POST_CreateOnlineOrders.ОпределитьДанныеТорговойТочки", УровеньЖурналаРегистрации.Предупреждение, , ,
			"МастерКлюч=" + МастерКлюч
			+ ". Не удалось по ключу найти данные торговой точки!"
			+ ?(ЗначениеЗаполнено(ДанныеЗаказаid), Символы.ПС + "Заказ № " + ДанныеЗаказаid, ""));
			
		//СтруктураДанных.Вставить("ТорговаяТочка", Справочники.ит_ТорговыеТочки.ПустаяСсылка());
		СтруктураДанных.Вставить("ПодразделениеКомпании",	Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
		СтруктураДанных.Вставить("Организация",				Справочники.ПодразделенияКомпании.ОсновноеПодразделение.Организация);
		СтруктураДанных.Вставить("СкладКомпании",			Справочники.СкладыКомпании.ОсновнойСкладКомпании);
		//СтруктураДанных.Вставить("ВариантОтветственногоЗаДоставку", 1);
	КонецЕсли;
	
	СтруктураДанных.Вставить("ВариантОтветственногоЗаДоставку", 1);
	
	// Возврат
	Возврат СтруктураДанных;
	
КонецФункции //ОпределитьДанныеТорговойТочки()

//rarus+AleksT 25.09.2020 для Мясницкий ряд
//ЗаоплнитьТоварыДокумента переименовал в ЗаполнитьТоварыДокумента
Функция ЗаполнитьТоварыДокумента(ДанныеТоваров, ТоварыДокумента) Экспорт
	
	ТаблицаТоваров = Новый ТаблицаЗначений();
	ТаблицаТоваров.Колонки.Добавить("artnumber",	ОбщегоНазначения.ОписаниеТипаСтрока(15));
	ТаблицаТоваров.Колонки.Добавить("name",			ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаТоваров.Колонки.Добавить("measure_code",	ОбщегоНазначения.ОписаниеТипаСтрока(9));
	ТаблицаТоваров.Колонки.Добавить("measure_name",	ОбщегоНазначения.ОписаниеТипаСтрока(25));
	ТаблицаТоваров.Колонки.Добавить("price",		ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	ТаблицаТоваров.Колонки.Добавить("quantity",		ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	ТаблицаТоваров.Колонки.Добавить("summa",		ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	ТаблицаТоваров.Колонки.Добавить("zavod",		Новый ОписаниеТипов("Булево"));
	ТаблицаТоваров.Колонки.Добавить("narezka",		Новый ОписаниеТипов("Булево"));
	
	Для Каждого ДанныеТовара Из ДанныеТоваров Цикл 
		СтрокаТовара = ТаблицаТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовара, ДанныеТовара);
		СтрокаТовара.artnumber = СокрЛП(ДанныеТовара.artnumber);
		
		// Не вскрывать
		Если ВРег(СокрЛП(ДанныеТовара.zavod)) = "Y" Тогда
			СтрокаТовара.zavod = Истина;
		Иначе
			СтрокаТовара.zavod = Ложь;
		КонецЕсли;
		
		// Нарезать
		Если ВРег(СокрЛП(ДанныеТовара.narezka)) = "Y" Тогда
			СтрокаТовара.narezka = Истина;
		Иначе
			СтрокаТовара.narezka = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТоваров.name КАК Наименование,
	|	ТаблицаТоваров.artnumber КАК МастерКлюч,
	|	ТаблицаТоваров.measure_name КАК ЕдИзм_Имя,
	|	ТаблицаТоваров.measure_code КАК ЕдИзм_Код,
	|	ТаблицаТоваров.price КАК Цена,
	|	ТаблицаТоваров.quantity КАК Количество,
	|	ТаблицаТоваров.summa КАК Сумма,
	|	ТаблицаТоваров.zavod КАК НеВскрывать,
	|	ТаблицаТоваров.narezka КАК Нарезать
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Ссылка КАК Номенклатура,
	//|	ВЫБОР
	//|		КОГДА ТаблицаТоваров.ЕдИзм_Код = ""166""
	//|				ИЛИ ТаблицаТоваров.ЕдИзм_Имя ПОДОБНО ""[кК], [гГ]""
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК КоличествоВКг,
	|	ТаблицаТоваров.Цена КАК Цена,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.Сумма КАК Сумма,
	|	ТаблицаТоваров.Наименование КАК Наименование,
	|	ТаблицаТоваров.МастерКлюч КАК МастерКлюч,
	|	ТаблицаТоваров.ЕдИзм_Имя КАК ЕдИзм_Имя,
	|	ТаблицаТоваров.ЕдИзм_Код КАК ЕдИзм_Код,
	|	ТаблицаТоваров.НеВскрывать КАК НеВскрывать,
	|	ТаблицаТоваров.Нарезать КАК Нарезать
	//rarus+AleksT 05.10.2020 для Мясницкий ряд
	|	,ТаблицаТоваров.Сумма КАК СуммаВсего,
	|	ТаблицаНоменклатуры.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТаблицаНоменклатуры.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент
	//-
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТаблицаНоменклатуры
	|		ПО ТаблицаТоваров.МастерКлюч = ТаблицаНоменклатуры.ЕРПМастерКлюч
	|			И (НЕ ТаблицаНоменклатуры.ПометкаУдаления)
	|			И (НЕ ТаблицаНоменклатуры.ЭтоГруппа)
	|			И (ТаблицаНоменклатуры.ЕРПМастерКлюч <> """")";
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаТоваров = РезультатЗапроса.Выбрать();
	
	Если Ложь Тогда ТоварыДокумента = Документы.ЗаказПокупателя.СоздатьДокумент().Товары; КонецЕсли; //для отладки
	
	Пока ВыборкаТоваров.Следующий() Цикл 
		СтрокаТовара = ТоварыДокумента.Добавить();
		//ЗаполнитьЗначенияСвойств(СтрокаТовара, ВыборкаТоваров, "Номенклатура,Цена,Сумма,НеВскрывать,Нарезать);
		//rarus+AleksT 25.09.2020 для Мясницкий ряд
		ЗаполнитьЗначенияСвойств(СтрокаТовара, ВыборкаТоваров);//, "Номенклатура,Цена,Сумма,НеВскрывать,Нарезать,Количество");
		
		//СтрокаТовара.СуммаВсего = СтрокаТовара.Сумма;
		
		//rarus+AleksT 05.10.2020 для Мясницкий ряд Решено, что раз ТК3 будет отправлять только осн.ед.изм, то ответ в них и получаем.
		//Если ВыборкаТоваров.КоличествоВКг Тогда
		//	//СтрокаТовара.Количество_Кг = ВыборкаТоваров.Количество;
		//	СтрокаТовара.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиЕдиницуИзмерения(
		//		СтрокаТовара.Номенклатура,
		//		СтрокаТовара.Номенклатура.БазоваяЕдиницаИзмерения,
		//		ВыборкаТоваров.ЕдИзм_Имя);
		//	//rarus+AleksT 05.10.2020 для Мясницкий ряд пока так, т.к. есть дубли КлассификаторЕдиницИзмерения, а базовая != ОсновнаяЕИ.ЕИПоКлассификатору
		//	Если Не (ЗначениеЗаполнено(СтрокаТовара.ЕдиницаИзмерения)) Тогда
		//		СтрокаТовара.ЕдиницаИзмерения = СтрокаТовара.Номенклатура.ОсновнаяЕдиницаИзмерения;
		//	КонецЕсли;
		//	//rarus-AleksT 05.10.2020
		//	СтрокаТовара.Коэффициент = 1;
		//Иначе
		//	//СтрокаТовара.Количество_Шт = ВыборкаТоваров.Количество;
		//	СтрокаТовара.ЕдиницаИзмерения = СтрокаТовара.Номенклатура.ОсновнаяЕдиницаИзмерения;
		//	СтрокаТовара.Коэффициент = СтрокаТовара.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент;
		//КонецЕсли;
		
		Если Не(ЗначениеЗаполнено(СтрокаТовара.Номенклатура)) Тогда 
			//СтрокаТовара.Комментарий = 
			СтрокаТовара.ПримечаниеНоменклатура = 
				СтрШаблон("Товар: %1, мастер-ключ: %2, ед. изм.: %3, количество: %4",
				//Строка(ВыборкаТоваров.Номенклатура),
				Строка(ВыборкаТоваров.Наименование), //rarus+AleksT 05.10.2020 для Мясницкий ряд. Ну раз номенклатуру не нашли, то будет пустая ссылка.
				Строка(ВыборкаТоваров.МастерКлюч),
				Строка(ВыборкаТоваров.ЕдИзм_Имя),
				Формат(ВыборкаТоваров.Количество, "ЧДЦ=3; ЧН=0,000; ЧГ=3,0"));
		КонецЕсли;
	КонецЦикла;
	
	// Возврат
	Возврат Истина;
	
КонецФункции //ЗаполнитьТоварыДокумента()

Функция ПолучитьДанныеТоваров() Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Ссылка КАК Номенклатура,
		|	ТаблицаНоменклатуры.ЕРПМастерКлюч КАК МастерКлюч,
		|	ТаблицаНоменклатуры.ВидПродукции КАК ВидПродукции,
		|	ТаблицаНоменклатуры.Вес КАК Вес,
		|	ТаблицаНоменклатуры.БазоваяЕИ КАК БазоваяЕдиница,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатуры.ОсновнаяЕдиница ПОДОБНО ""%упак%""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоУпаковка,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатуры.БазоваяЕИ ПОДОБНО ""%кг%""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ХранениеВКг,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатуры.Коэф = 0
		|			ТОГДА 1
		|		ИНАЧЕ ТаблицаНоменклатуры.Коэф
		|	КОНЕЦ КАК Коэффициент,
		|	ТаблицаНоменклатуры.Коэф КАК БазовыйКоэффициент,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатуры.ОсновнаяЕдиница ПОДОБНО ""%упак%""
		|				И ТаблицаНоменклатуры.Вес <> 0
		|			ТОГДА ТаблицаНоменклатуры.КоэффициентОснЕИ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Кратность,
		|	ТаблицаНоменклатуры.КратностьКороба КАК КратностьКороба,
		|	ТаблицаНоменклатуры.ИТ_Квант КАК Квант
		|ИЗ
		|	Справочник.Номенклатура КАК ТаблицаНоменклатуры
		|ГДЕ
		|	НЕ ТаблицаНоменклатуры.ЭтоГруппа
		|	И ТаблицаНоменклатуры.ЕРПМастерКлюч <> """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеТоваров = РезультатЗапроса.Выгрузить();
	
	// Возврат
	Возврат ДанныеТоваров;
	
КонецФункции	

Функция ОпределитьЦеныТоваров(ТорговаяТочка, Дата) Экспорт
	
	// Получение цен
	ПараметрыWebСервиса = Новый Структура();
	ПараметрыWebСервиса.Вставить("Дата", Дата);
	ПараметрыWebСервиса.Вставить("ТорговаяТочка", ТорговаяТочка.МастерКлючСГП);
	
	//rarus+AleksT 21.09.2020 для Мясницкий ряд адаптация Многозадачник: перенаправил вызов из ит_ОбщегоНазначенияСерверГлобальный
	//НастройкиПодключения	= НастройкиПодключенияWSHS(Справочники.ИнформационныеБазы1С.ERP_integ77_Prices, "GetTable");
	НастройкиПодключения	= ИТ_ОбщегоНазначения.НастройкиПодключенияWSHS(Справочники.ИнформационныеБазы1С.ERP_integ77_Prices, "GetTable");
	//ХранилищеЦен			= ПеренаправлениеНаДругойСервис(ПараметрыWebСервиса, НастройкиПодключения);
	ХранилищеЦен			= ИТ_ОбщегоНазначения.ПеренаправлениеНаДругойСервис(ПараметрыWebСервиса, НастройкиПодключения);
	ТаблицаЦен				= глДесериализовать(ХранилищеЦен.Получить());
	
	// Обработка данных
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЦен.НоменклатураМастерКлюч КАК Номенклатура_МастерКлюч,
		|	ТаблицаЦен.Цена КАК Цена
		|ПОМЕСТИТЬ ТаблицаЦен
		|ИЗ
		|	&ТаблицаЦен КАК ТаблицаЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Ссылка КАК Номенклатура,
		|	МАКСИМУМ(ТаблицаЦен.Цена) КАК Цена
		|ИЗ
		|	ТаблицаЦен КАК ТаблицаЦен
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТаблицаНоменклатуры
		|		ПО ТаблицаЦен.Номенклатура_МастерКлюч = ТаблицаНоменклатуры.ЕРПМастерКлюч
		|			И (ТаблицаЦен.Номенклатура_МастерКлюч <> """")
		|			И (ТаблицаНоменклатуры.ЕРПМастерКлюч <> """")
		|			И (НЕ ТаблицаНоменклатуры.ЭтоГруппа)
		|			И (НЕ ТаблицаНоменклатуры.ПометкаУдаления)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНоменклатуры.Ссылка";
	
	Запрос.УстановитьПараметр("ТаблицаЦен", ТаблицаЦен);
	
	РезультатЗапроса	= Запрос.Выполнить();
	ЦеныТоваров			= РезультатЗапроса.Выгрузить();
	
	// Возврат
	Возврат ЦеныТоваров;
	
КонецФункции	

Функция ПолучитьДатуКонсолидацииЗаказов() Экспорт 
	
	ВремяКонсолидацииЗаказов = Константы.ИТ_ВремяКонсолидацииИнтернетЗаказов.Получить();
	
	Если Не(ЗначениеЗаполнено(ВремяКонсолидацииЗаказов)) Тогда 
		ВремяКонсолидацииЗаказов = Дата(1, 1, 1, 21, 0, 0); //21:00 время по умолчанию.
		Константы.ИТ_ВремяКонсолидацииИнтернетЗаказов.Установить(ВремяКонсолидацииЗаказов);
	КонецЕсли;	
	
	ВремяКонсолидацииВСекундах	= ВремяКонсолидацииЗаказов - Дата(1, 1, 1);
	ДатаКонсолидацииЗаказов		= НачалоДня(ТекущаяДата()) + ВремяКонсолидацииВСекундах;
	
	// Возврат
	Возврат ДатаКонсолидацииЗаказов;
	
КонецФункции	

// Фомирует штрихкод для УКМ используя 9998 - как обязательный префикс и 000000000001 - как номер заказа.
// При этом обязательно выводить лидирующие нули в номере заказа после префикса.
// 
Функция СформироватьШтрихКодУКМ(НомерЗаказа) Экспорт  
	
	ШтрихКод = Формат(НомерЗаказа, "ЧЦ=12; ЧДЦ=0; ЧН=0; ЧВН=; ЧГ=0; ЧФ=9998Ч");
	
	// Возврат
	Возврат ШтрихКод;
	
КонецФункции

Процедура ОбработатьНомерТелефона(НомерТелефона) Экспорт 
	
	НомерТелефона	= СтрЗаменить(НомерТелефона, " ", "");
	НомерТелефона	= СтрЗаменить(НомерТелефона, "-", "");
	НомерТелефона	= СтрЗаменить(НомерТелефона, "(", "");
	НомерТелефона	= СтрЗаменить(НомерТелефона, ")", "");
	НомерТелефона	= СтрЗаменить(НомерТелефона, "+", "");
	НомерТелефона	= СокрЛП(НомерТелефона);
	
	Если СтрДлина(НомерТелефона) > 10 Тогда 
		НомерТелефона = Прав(НомерТелефона, 10);	
	КонецЕсли;	
	
	НомерТелефона = СтрШаблон(
		"+7 (%1) %2-%3-%4", 
		Сред(НомерТелефона, 1, 3),
		Сред(НомерТелефона, 4, 3),
		Сред(НомерТелефона, 7, 2),
		Сред(НомерТелефона, 9, 2));
	
КонецПроцедуры	

#Область ПрограммныйИнтерфейс_bazium

//Функция ПолучитьТокенАвторизации_bazium(ПринудительноеОбновление = Ложь)
//	
//	//Если ПринудительноеОбновление Тогда 
//		ТокенАвторизации = Неопределено;
//	//Иначе	
//	//	ТокенАвторизации = Константы.ИТ_ИнтернетЗаказы_ТокенАвторизацииBazium.Получить();
//	//	ИТ_ОбработкаДанных.ОпределитьЗначение(ТокенАвторизации, Тип("Строка"), Неопределено);
//	//КонецЕсли;	
//	
//	Если ТокенАвторизации = Неопределено Тогда 
//		HTTPСоединение = ПолучитьHTTPСоединение_bazium("bazium.com");
//		
//		Если HTTPСоединение = Неопределено Тогда 
//		 	Возврат Неопределено;
//		КонецЕсли;	
//		
//		// Запрос 
//		Попытка 
//			HTTPЗапрос = Новый HTTPЗапрос();
//			HTTPЗапрос.АдресРесурса = "/users/sessions.json?email=zakaz@kolbasa.ru&password=64hdjHHHHSssss"; 
//			ДобавитьЗаголовкиHTTPЗапроса_bazium(HTTPЗапрос);
//			
//			СтруктураДанных = ПолучитьСтруктураДанныхHTTPОтвета_bazium(HTTPСоединение, HTTPЗапрос, "POST"); 
//			
//			// Обработка ответа
//			Результат = ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(СтруктураДанных, "result", Тип("Строка"), "fail");
//			
//			Если Результат = "ok" Тогда 
//				ТокенАвторизации = ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(СтруктураДанных, "jwt", Тип("Строка"), Неопределено);
//				
//				// Проверка корректности токена
//				Если ТокенАвторизации = Неопределено Тогда 
//					ЗаписатьОшибку_bazium(
//						"Не удолось получить токен авторизации, свойство ""result"" вернуло требуемый ответ ""ok"", однако свойство ""jwt"" не содержит токена.");
//				Иначе
//					//Константы.ИТ_ИнтернетЗаказы_ТокенАвторизацииBazium.Установить(ТокенАвторизации);
//				КонецЕсли;
//			Иначе
//				ЗаписатьОшибку_bazium(
//					"Не удолось получить токен авторизации, свойство ""result"" не вернуло требуемый ответ ""ok"".");	
//			КонецЕсли;	
//		Исключение
//			ТекстОшибки = ОписаниеОшибки();
//			ЗаписатьОшибку_bazium(ТекстОшибки);
//		КонецПопытки;
//	КонецЕсли; 
//	
//	// Возврат
//	Возврат ТокенАвторизации;
//	
//КонецФункции

//Функция ПолучитьМассивИнтернетЗаказов_bazium(ТокенАвторизации = Неопределено) 
//	
//	ТокенАвторизации = ОпределитьТокенАвторизации_bazium(ТокенАвторизации);
//	
//	Если ТокенАвторизации = Неопределено Тогда 
//		Возврат Неопределено;
//	КонецЕсли;	
//	
//	HTTPСоединение = ПолучитьHTTPСоединение_bazium("kolbasaru.bazium.com");
//	
//	Если HTTPСоединение = Неопределено Тогда 
//	 	Возврат Неопределено;
//	КонецЕсли;
//	
//	// Запрос 
//	Попытка 
//		HTTPЗапрос = Новый HTTPЗапрос();
//		HTTPЗапрос.АдресРесурса = СтрШаблон("/builder/product_orders.json"); 
//		HTTPЗапрос.Заголовки.Вставить("Authorization", ТокенАвторизации);
//		ДобавитьЗаголовкиHTTPЗапроса_bazium(HTTPЗапрос);
//		
//		СтруктураДанных	= ПолучитьСтруктураДанныхHTTPОтвета_bazium(HTTPСоединение, HTTPЗапрос, "GET"); 
//		МассивЗаказов	= ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(СтруктураДанных, "product_orders", Тип("Массив"), Неопределено);
//		
//		Если МассивЗаказов = Неопределено Тогда 
//			ЗаписатьОшибку_bazium("Не удолось получить массив заказов, свойство ""product_orders"" остутствует или не является массивом.");
//		Иначе
//			Возврат МассивЗаказов;
//		КонецЕсли;	
//	Исключение
//		ТекстОшибки = ОписаниеОшибки();
//		ЗаписатьОшибку_bazium(ТекстОшибки);
//	КонецПопытки;
//	
//	// Возврат
//	Возврат Неопределено;	
//	
//КонецФункции	

//Функция ПолучитьДанныеИнтернетЗаказа_bazium(ИдентификаторЗаказа, ТокенАвторизации = Неопределено) Экспорт 
//	
//	ТокенАвторизации = ОпределитьТокенАвторизации_bazium(ТокенАвторизации);
//	
//	Если ТокенАвторизации = Неопределено Тогда 
//		Возврат Неопределено;
//	КонецЕсли;	
//	
//	HTTPСоединение = ПолучитьHTTPСоединение_bazium("kolbasaru.bazium.com");
//	
//	Если HTTPСоединение = Неопределено Тогда 
//	 	Возврат Неопределено;
//	КонецЕсли;
//	
//	// Запрос 
//	Попытка 
//		HTTPЗапрос = Новый HTTPЗапрос();
//		HTTPЗапрос.АдресРесурса = СтрШаблон("/builder/product_orders/%1.json", Формат(ИдентификаторЗаказа, "ЧДЦ=0; ЧН=0; ЧГ=0")); 
//		HTTPЗапрос.Заголовки.Вставить("Authorization", ТокенАвторизации);
//		ДобавитьЗаголовкиHTTPЗапроса_bazium(HTTPЗапрос);
//		
//		СтруктураДанных	= ПолучитьСтруктураДанныхHTTPОтвета_bazium(HTTPСоединение, HTTPЗапрос, "GET"); 
//		ДанныеЗаказа	= ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(СтруктураДанных, "product_order", Тип("Структура"), Неопределено);
//		
//		Если ДанныеЗаказа = Неопределено Тогда 
//			ЗаписатьОшибку_bazium(СтрШаблон(
//				"Не удолось получить данные заказа (id=%1), свойство ""product_order"" остутствует или не является структурой.", ИдентификаторЗаказа));
//		Иначе
//			Возврат ДанныеЗаказа;
//		КонецЕсли;
//	Исключение
//		ТекстОшибки = ОписаниеОшибки();
//		ЗаписатьОшибку_bazium(ТекстОшибки);
//	КонецПопытки;
//	
//	// Возврат
//	Возврат Неопределено;
//	
//КонецФункции	

//Функция СформироватьИнтернетЗаказ_bazium(ДанныеЗаказа, ПринудительноеОбновление = Ложь) Экспорт
//	
//	// ОПРЕДЕЛЕНИЕ ДОКУМЕНТА //
//	// Получение идентификатора
//	Идентификатор_bazium = ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(ДанныеЗаказа, "id", Тип("Число"), 0); 
//	
//	Если Идентификатор_bazium = 0 Тогда 
//		ЗаписатьОшибку_bazium("Ошибка формирования интернет-заказа. Свойство ""id"" равно 0 или не задано.");
//		Возврат Ложь;
//	КонецЕсли;	
//	
//	// Получение объекта документа
//	Запрос = Новый Запрос();
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ИТ_ИнтернетЗаказ.Ссылка КАК Документ
//		|ИЗ
//		|	Документ.ИТ_ИнтернетЗаказ КАК ИТ_ИнтернетЗаказ
//		|ГДЕ
//		|	ИТ_ИнтернетЗаказ.Идентификатор_bazium = &Идентификатор_bazium";
//	
//	Запрос.УстановитьПараметр("Идентификатор_bazium", Идентификатор_bazium);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	ВыборкаДанных = РезультатЗапроса.Выбрать();
//	
//	Если ВыборкаДанных.Следующий() Тогда 
//		Если ПринудительноеОбновление Тогда 
//			ДокументОбъект = ВыборкаДанных.Документ.ПолучитьОбъект();
//		Иначе
//			// Заказ уже есть
//			Возврат Истина;
//		КонецЕсли;
//	Иначе
//		ДокументОбъект = Документы.ИТ_ИнтернетЗаказ.СоздатьДокумент();
//		ДокументОбъект.Дата					= ТекущаяДата();
//		ДокументОбъект.Состояние			= Справочники.ИТ_СостоянияИнтернетЗаказов.Новый;
//		ДокументОбъект.Идентификатор_bazium	= Идентификатор_bazium;
//	КонецЕсли;	
//	
//	// ЗАПОЛНЕНИЕ ШАПКИ ДОКУМЕНТА //
//	// Номер заказа
//	НомерЗаказа	= ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(ДанныеЗаказа, "number", Тип("Строка"), "");
//	НомерЗаказа = СтрЗаменить(НомерЗаказа, "#", "");
//	ДокументОбъект.НомерЗаказа = Число(НомерЗаказа);
//	
//	// Данные доставки
//	ДанныеДоставки	= ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(ДанныеЗаказа, "delivery_form", Тип("Массив"), Новый Массив);
//	
//	Для Каждого СтруктураЭлемента Из ДанныеДоставки Цикл 
//		ТипДанных	= ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(СтруктураЭлемента, "type",	Тип("Строка"), "");  
//		Заголовок	= ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(СтруктураЭлемента, "label",	Тип("Строка"), "");
//		Значение	= ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(СтруктураЭлемента, "value",	Тип("Строка"), "");
//		
//		Если ЭтоПодходящийЭлемент_bazium("text", "Фамилия", ТипДанных, Заголовок) Тогда 
//			ДокументОбъект.Фамилия = Значение;	
//			
//		ИначеЕсли ЭтоПодходящийЭлемент_bazium("name", "Имя", ТипДанных, Заголовок) Тогда
//			ДокументОбъект.Имя = Значение;
//			
//		ИначеЕсли ЭтоПодходящийЭлемент_bazium("text", "Отчество", ТипДанных, Заголовок) Тогда
//			ДокументОбъект.Отчество = Значение;
//			
//		ИначеЕсли ЭтоПодходящийЭлемент_bazium("phone", "Телефон", ТипДанных, Заголовок) Тогда
//			ДокументОбъект.Телефон = Значение;	
//			
//		ИначеЕсли ЭтоПодходящийЭлемент_bazium("email", "E-mail", ТипДанных, Заголовок) Тогда
//			ДокументОбъект.АдресЭП = Значение;	
//			
//		ИначеЕсли ЭтоПодходящийЭлемент_bazium("address", "Адрес", ТипДанных, Заголовок) Тогда
//			ДокументОбъект.АдресДоставки = Значение;
//			
//		ИначеЕсли ЭтоПодходящийЭлемент_bazium("text", "карта", ТипДанных, Заголовок) Тогда
//			ДокументОбъект.ТелефонКартыПЛ = Значение; 
//			
//		ИначеЕсли ЭтоПодходящийЭлемент_bazium("date", "доставк", ТипДанных, Заголовок) Тогда
//			ЭлементыДатыВремени = СтрРазделить(Значение, " ", Ложь);
//					
//			Если ЭлементыДатыВремени.Количество() > 0 Тогда
//				ЭлементыДаты = СтрРазделить(ЭлементыДатыВремени.Получить(0), ".", Ложь);
//				
//				Если ЭлементыДаты.Количество() = 3 Тогда 
//					НомерДня	= Число(ЭлементыДаты.Получить(0)); 
//					НомерМесяца	= Число(ЭлементыДаты.Получить(1));	
//					НомерГода	= Число(ЭлементыДаты.Получить(2));
//					НомерЧаса	= 0;
//					НомерМинуты	= 0;
//				Иначе
//					Продолжить; 
//				КонецЕсли;	
//				
//				Если ЭлементыДатыВремени.Количество() > 1 Тогда
//					ЭлементыВремени = СтрРазделить(ЭлементыДатыВремени.Получить(1), ":", Ложь);
//					
//					Если ЭлементыВремени.Количество() = 2 Тогда 
//						НомерЧаса	= Число(ЭлементыВремени.Получить(0));
//						НомерМинуты	= Число(ЭлементыВремени.Получить(1));	
//					КонецЕсли;	
//				КонецЕсли;
//				
//				ДокументОбъект.ДатаДоставки = Дата(НомерГода, НомерМесяца, НомерДня, НомерЧаса, НомерМинуты, 0);
//			КонецЕсли;	
//			
//		ИначеЕсли ЭтоПодходящийЭлемент_bazium("text", "Комментарий", ТипДанных, Заголовок) Тогда
//			ДокументОбъект.Комментарий = Значение;
//		Иначе
//			// Обработка неопределенного свойства 	
//		КонецЕсли;	
//	КонецЦикла;	
//	
//	// Способ оплаты
//	СпособОплаты = ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(ДанныеЗаказа, "payment_system", Тип("Строка"), "");
//	ДокументОбъект.СпособОплаты = Справочники.ИТ_СпособыОплатыИнтернетЗаказов.ОпределитьСпособОплатыПоИмени(СпособОплаты);
//	
//	// Стоимость доставки
//	СтоимостьДоставки = ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(ДанныеЗаказа, "delivery_amount", Тип("Строка"), "");
//	ДокументОбъект.СтоимостьДоставки = ПолучитьЧисло_bazium(СтоимостьДоставки); 
//	
//	// ЗАПОЛНЕНИЕ ТОВАРОВ ДОКУМЕНТА //
//	МассивТоваров	= ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(ДанныеЗаказа, "products", Тип("Массив"), Новый Массив()); 
//	ТаблицаТоваров	= Новый ТаблицаЗначений();
//	ТаблицаТоваров.Колонки.Добавить("ИмяТовара",	ОбщегоНазначения.ОписаниеТипаСтрока(150));
//	ТаблицаТоваров.Колонки.Добавить("МастерКлюч",	ОбщегоНазначения.ОписаниеТипаСтрока(15));
//	ТаблицаТоваров.Колонки.Добавить("Количество",	ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
//	ТаблицаТоваров.Колонки.Добавить("Цена",			ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	ТаблицаТоваров.Колонки.Добавить("Сумма",		ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
//	
//	Для Каждого СтруктураТовара Из МассивТоваров Цикл 
//		СтрокаТовара = ТаблицаТоваров.Добавить();
//		СтрокаТовара.ИмяТовара	= СокрЛП(ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(СтруктураТовара,	"name",		Тип("Строка"),	""));	
//		СтрокаТовара.МастерКлюч	= СокрЛП(ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(СтруктураТовара,	"sku",		Тип("Строка"),	""));	
//		СтрокаТовара.Количество	= Число(ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(СтруктураТовара,	"quantity",	Тип("Строка"),	0));
//		
//		СтрокаТовара.Цена = ПолучитьЧисло_bazium(
//			ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(СтруктураТовара, "price", Тип("Строка"), ""));
//		СтрокаТовара.Сумма = ПолучитьЧисло_bazium(
//			ИТ_ОбработкаДанных.ПолучитьСвойствоСтруктуры(СтруктураТовара, "amount", Тип("Строка"), ""));
//	КонецЦикла;
//	
//	Запрос = Новый Запрос();
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ТаблицаТоваров.ИмяТовара,
//		|	ТаблицаТоваров.МастерКлюч,
//		|	ТаблицаТоваров.Количество,
//		|	ТаблицаТоваров.Цена,
//		|	ТаблицаТоваров.Сумма
//		|ПОМЕСТИТЬ ТаблицаТоваров
//		|ИЗ
//		|	&ТаблицаТоваров КАК ТаблицаТоваров
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	МАКСИМУМ(Номенклатура.Ссылка) КАК Товар,
//		|	ТаблицаТоваров.ИмяТовара,
//		|	ТаблицаТоваров.МастерКлюч,
//		|	ТаблицаТоваров.Количество,
//		|	ТаблицаТоваров.Цена,
//		|	ТаблицаТоваров.Сумма
//		|ИЗ
//		|	ТаблицаТоваров КАК ТаблицаТоваров
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
//		|		ПО ТаблицаТоваров.МастерКлюч = Номенклатура.ЕРПМастерКлюч
//		|			И (ТаблицаТоваров.МастерКлюч <> """")
//		|			И (Номенклатура.ЕРПМастерКлюч <> """")
//		|			И (НЕ Номенклатура.ПометкаУдаления)
//		|			И (НЕ Номенклатура.ЭтоГруппа)
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ТаблицаТоваров.ИмяТовара,
//		|	ТаблицаТоваров.МастерКлюч,
//		|	ТаблицаТоваров.Количество,
//		|	ТаблицаТоваров.Цена,
//		|	ТаблицаТоваров.Сумма";
//	
//	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
//	РезультатЗапроса	= Запрос.Выполнить();
//	ВыборкаДанных		= РезультатЗапроса.Выбрать();
//	ТоварыДокумента		= ДокументОбъект.Товары;
//	ТоварыДокумента.Очистить();
//	
//	Пока ВыборкаДанных.Следующий() Цикл 
//		НоваяСтрокаТовара = ТоварыДокумента.Добавить();
//		НоваяСтрокаТовара.Номенклатура	= ВыборкаДанных.Товар;
//		НоваяСтрокаТовара.Количество	= ВыборкаДанных.Количество;
//		НоваяСтрокаТовара.Цена			= ВыборкаДанных.Цена;
//		НоваяСтрокаТовара.Сумма			= ВыборкаДанных.Сумма;
//		
//		// Инициация пересчета
//		НоваяСтрокаТовара.Количество_Кг = НоваяСтрокаТовара.Количество;
//		
//		Если Не(ЗначениеЗаполнено(НоваяСтрокаТовара.Номенклатура)) Тогда 
//			НоваяСтрокаТовара.Комментарий = СтрШаблон(
//				"Товар не найден! Мастер ключ: %1; Наименование: %2",
//				ВыборкаДанных.МастерКлюч,
//				ВыборкаДанных.ИмяТовара);
//		КонецЕсли;	
//		
//		// Пересчет сумм
//		Если НоваяСтрокаТовара.Сумма = 0 Тогда 
//			НоваяСтрокаТовара.Сумма = НоваяСтрокаТовара.Цена * НоваяСтрокаТовара.Количество;
//		КонецЕсли;	
//	КонецЦикла;	
//	
//	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
//	
//	// Возврат
//	Возврат Истина; 
//	
//КонецФункции	

//Функция ЭтоПодходящийЭлемент_bazium(ТребуемыТипДанных, ТребуемыЗаголовок, ТипДанных, Заголовок)
//	
//	Если ТипДанных = ТребуемыТипДанных 
//		И СтрНайти(Заголовок, ТребуемыЗаголовок) <> 0 Тогда
//		Возврат Истина;
//	Иначе
//		Возврат Ложь;
//	КонецЕсли;	
//	
//КонецФункции	

//Функция ПолучитьЧисло_bazium(ПредставлениеЧисла)
//	
//	ПредставлениеЧисла	= ВРег(СокрЛП(ПредставлениеЧисла));
//	ПредставлениеЧисла	= СтрЗаменить(ПредставлениеЧисла, "РУБ", "");
//	ПредставлениеЧисла	= СтрЗаменить(ПредставлениеЧисла, "руб", "");
//	ПредставлениеЧисла	= СтрЗаменить(ПредставлениеЧисла, " ", "");
//	ПредставлениеЧисла	= СтрЗаменить(ПредставлениеЧисла, ".", "");
//	ПредставлениеЧисла	= СтрЗаменить(ПредставлениеЧисла, "/", "");
//	ПредставлениеЧисла	= СтрЗаменить(ПредставлениеЧисла, "шт", "");
//	ПредставлениеЧисла	= СтрЗаменить(ПредставлениеЧисла, "ШТ", "");
//	ПредставлениеЧисла	= СтрЗаменить(ПредставлениеЧисла, "кг", "");
//	ПредставлениеЧисла	= СтрЗаменить(ПредставлениеЧисла, "КГ", "");
//	ПредставлениеЧисла	= СтрЗаменить(ПредставлениеЧисла, "\", "");
//	
//	Попытка 
//		Число_bazium = Число(ПредставлениеЧисла);	
//	Исключение
//		Число_bazium = 0;	
//	КонецПопытки;
//	
//	// Возврат
//	Возврат Число_bazium;
//		
//КонецФункции	

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ОбработатьКонсолидированныйДокумент(ДокументОбъект, ДанныеТоваров, МассивИнтернетЗаказов) Экспорт
	
	// Отбойник
	Если ДокументОбъект = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	// Кэш значений
	ВидПродукции_Полуфабрикаты = Перечисления.ВидПродукции.Полуфабрикаты;
	ВидПродукции_МолочнаяПродукция = Перечисления.ВидПродукции.МолочнаяПродукция;
	ОстаткиТоваров = ПолучитьТекущиеОстаткиТоваров(ДокументОбъект);
	МинимальныеОстатки = ПолучитьМинимальныеОстаткиТоваров(ДокументОбъект.ДатаЗаявки);
	УдаляемыеСтроки = Новый Массив();
	
	// СверткаЗаказа
	ДокументОбъект.Товары.Свернуть("Номенклатура,Цена", "Количество");	

	// приведение к кратности короба
	Для Каждого СтрокаТовара Из ДокументОбъект.Товары Цикл
		Если Не(ЗначениеЗаполнено(СтрокаТовара.Номенклатура)) Тогда 
			Продолжить;
		КонецЕсли;	
		
		ДанныеТовара = ДанныеТоваров.Найти(СтрокаТовара.Номенклатура, "Номенклатура");
		
		Если ДанныеТовара = Неопределено Тогда 
			// Такой ситуации быть не должно
			СтрокаТовара.Коэффициент = ?(СтрокаТовара.Номенклатура.Коэф = 0, 1, СтрокаТовара.Номенклатура.Коэф);
		Иначе
			СтрокаТовара.Коэффициент = ДанныеТовара.Коэффициент;
			
			Если ДанныеТовара.ВидПродукции = ВидПродукции_Полуфабрикаты Тогда // Полуфабрикаты отгружаются коробами, с количетсве указывается количество коробов.
				// Проверка необходимости отгрузки, т.к. товаров с прошлых остатком может быть достаточно.
				Если ОстаткиТоваров <> Неопределено
					И МинимальныеОстатки <> Неопределено Тогда 
					ТекущийОстаток = ОстаткиТоваров.Найти(СокрЛП(ДанныеТовара.МастерКлюч), "Номенклатура_МастерКлюч"); 
					МинимальныйОстаток = МинимальныеОстатки.Найти(СтрокаТовара.Номенклатура, "Номенклатура");
				КонецЕсли;	
					
				Если ТекущийОстаток <> Неопределено
					И МинимальныйОстаток <> Неопределено Тогда 
					СтрокаТовара.Количество = СтрокаТовара.Количество + МинимальныйОстаток.Количество - ТекущийОстаток.Количество;  
				КонецЕсли;	
				
				Если СтрокаТовара.Количество > 0 Тогда 
					КоличествоУпаковок		= СтрокаТовара.Количество / ДанныеТовара.КратностьКороба;
					СтрокаТовара.Количество	= Цел(КоличествоУпаковок);
					
					Если СтрокаТовара.Количество <> КоличествоУпаковок Тогда
						СтрокаТовара.Количество = СтрокаТовара.Количество + 1;
					КонецЕсли;	
				Иначе
					УдаляемыеСтроки.Добавить(СтрокаТовара);	
				КонецЕсли;	
			Иначе
				//// Пока что пересчет удален
				//Если ДанныеТовара.Кратность <> 0 Тогда 
				//	КоличествоУпаковок		= СтрокаТовара.Количество / ДанныеТовара.Кратность;
				//	СтрокаТовара.Количество	= Цел(КоличествоУпаковок);
				//	
				//	Если СтрокаТовара.Количество <> КоличествоУпаковок Тогда
				//		СтрокаТовара.Количество = СтрокаТовара.Количество + ДанныеТовара.Кратность;
				//	КонецЕсли;	
				//КонецЕсли;	
			КонецЕсли;
			
			СтрокаТовара.КоличествоКГ	= СтрокаТовара.Количество * ДанныеТовара.БазовыйКоэффициент;
			СтрокаТовара.ИтогКГ			= СтрокаТовара.Количество * ДанныеТовара.БазовыйКоэффициент;
			
			Если ДанныеТовара.ХранениеВКг Тогда
				СтрокаТовара.Сумма = СтрокаТовара.Количество * ДанныеТовара.БазовыйКоэффициент * СтрокаТовара.Цена;
			Иначе
				СтрокаТовара.Сумма = СтрокаТовара.Количество * СтрокаТовара.Цена;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
	Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл 
		ДокументОбъект.Товары.Удалить(УдаляемаяСтрока);	
	КонецЦикла;
	
	// Документы данных видов не выгружаются. 
	// На ТТ должно быть достаточно товаров для обеспечения заказов.
	Если ДокументОбъект.ВидПродукции = ВидПродукции_Полуфабрикаты
		ИЛИ ДокументОбъект.ВидПродукции = ВидПродукции_МолочнаяПродукция Тогда 
		ДокументОбъект.Созданв77	= ДокументОбъект.Дата;
		ДокументОбъект.Номер77		= "Не для выгрузки";
		ДокументОбъект.Записать();	
	Иначе
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	// Запись связей 
	Для Каждого ИнтернетЗаказ Из МассивИнтернетЗаказов Цикл 
		ИнтернетЗаказОбъект = ИнтернетЗаказ.ПолучитьОбъект();
		ИнтернетЗаказОбъект.Состояние = Справочники.ИТ_СостоянияИнтернетЗаказов.Сборка;
		ИнтернетЗаказОбъект.Записать();
		
		РегистрыСведений.ИТ_СвязиКонсолидированныхИнтернетЗаказов.ОпределитьСвязь(
			ИнтернетЗаказ, 
			ДокументОбъект.Ссылка, 
			ДокументОбъект.Контрагент, 
			ДокументОбъект.ВидПродукции);
	КонецЦикла;	
		
	МассивИнтернетЗаказов = Новый Массив();
	
	// Возврат
	Возврат Истина;
	
КонецФункции	

Функция ПолучитьТекущиеОстаткиТоваров(ДокументОбъект)
	
	Если ПустаяСтрока(ДокументОбъект.МастерКлючТТ) Тогда 
		ДокументОбъект.Комментарий = ДокументОбъект.Комментарий + Символы.ПС 
			+ "Не удалось получить остатки товаров: не задан мастер ключ ТТ.";
		Возврат Неопределено;
	КонецЕсли;	
	
	Попытка
		ПараметрыСервиса = Новый Структура("МастерКлючиМагазинов", ДокументОбъект.МастерКлючТТ);
		ОстаткиТоваров = SSL_IT_УниверсальныйОбмен.ВыполнитьЗапрос_HTTP(
			"УниверсальныеОбмены_1СРозница", "CurrentGoodsRemains", ПараметрыСервиса);
		Возврат ОстаткиТоваров;
	Исключение 
		ДокументОбъект.Комментарий = ДокументОбъект.Комментарий + Символы.ПС 
			+ "Не удалось получить остатки товаров: " + ОписаниеОшибки();
		Возврат Неопределено;	
	КонецПопытки;		
	
КонецФункции	

Функция ПолучитьМинимальныеОстаткиТоваров(ДатаОстатков)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_МинимальныеОстаткиТоваровСрезПоследних.Номенклатура,
		|	ИТ_МинимальныеОстаткиТоваровСрезПоследних.Количество
		|ИЗ
		|	РегистрСведений.ИТ_МинимальныеОстаткиТоваров.СрезПоследних(&ДатаОстатков, ) КАК ИТ_МинимальныеОстаткиТоваровСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	РезультатЗапроса = Запрос.Выполнить();
	МинимальныеОстатки = РезультатЗапроса.Выгрузить();
	
	// Возврат
	Возврат МинимальныеОстатки;
	
КонецФункции	

#Область ПечатныеФормы

Функция ПолучитьПечатныеФормыИнтернетЗаказов(МассивОбъектовПечати, ДополнительныеПараметры = Неопределено, ТипыОбъектовПечати = Неопределено, ИменаМакетов = "") Экспорт 
	
	// Определение параметров
	ИТ_ОбработкаДанных.ОпределитьЗначение(ДополнительныеПараметры,	Тип("Структура"),	Новый Структура());
	ИТ_ОбработкаДанных.ОпределитьЗначение(ИменаМакетов,				Тип("Строка"),		"ИнтернетЗаказ_Курьер");
	
	// Формирование ответа
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("КоллекцияПечатныхФорм",	Неопределено);
	СтруктураДанных.Вставить("ПараметрыВывода",			Неопределено);
	СтруктураДанных.Вставить("ОбъектыПечати",			Новый СписокЗначений());
	
	// Формирование печатных форм 
	УправлениеПечатью.СформироватьПечатныеФормы(
		//"Документ.ИТ_ИнтернетЗаказ",
		"Документ.ЗаказПокупателя",
		ИменаМакетов,
		МассивОбъектовПечати, 
		ДополнительныеПараметры,
		СтруктураДанных.КоллекцияПечатныхФорм,
		СтруктураДанных.ОбъектыПечати, 
		СтруктураДанных.ПараметрыВывода, 
		ТипыОбъектовПечати);

	// Возврат 
	Возврат СтруктураДанных;
	
КонецФункции	

Функция ПоместитьПечатныеФормыВоВременноеХранилище(КоллекцияПечатныхФорм, ОбъектыПечати, СсылкиФорматов, УпаковатьВАрхив = Ложь)
	
	// Предрасчет форматов
	ТаблицаФорматов = УправлениеПечатью.НастройкиФорматовСохраненияТабличногоДокумента();
	ФорматыСохранения = Новый Массив();

	Если ТипЗнч(СсылкиФорматов) = Тип("Массив") Тогда 	
		МассивФорматов = СсылкиФорматов; 		
	Иначе
		МассивФорматов = Новый Массив();
		
		Если ТипЗнч(СсылкиФорматов) = Тип("ПеречислениеСсылка.ФорматыСохраненияОтчетов") Тогда 
			МассивФорматов.Добавить(СсылкиФорматов);
		КонецЕсли;
	КонецЕсли;	
		
	Для Каждого СсылкаФормата Из МассивФорматов Цикл 
		ФорматСохранения = ТаблицаФорматов.Найти(СсылкаФормата, "Ссылка");
		
		Если ФорматСохранения <> Неопределено Тогда 
			ФорматыСохранения.Добавить(ФорматСохранения);	
		КонецЕсли;	
	КонецЦикла;	
	
	// Временные файловые объекты
	ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременнойПапки);

	Если УпаковатьВАрхив Тогда
		ИмяАрхива = ПолучитьИмяВременногоФайла("zip");
		ЗаписьZipФайла = Новый ЗаписьZipФайла(ИмяАрхива);
	КонецЕсли;

	// Служебные объекты
	ОбработанныеПечатныеФормы = Новый Массив();
	НаследуемыеСвойства = ПолучитьНаследуемыеСвойстваТабличногоДокумента();
	ОписанияФайлов = Новый Массив();
	
	Для Каждого СтрокаПечатнойФормы Из КоллекцияПечатныхФорм Цикл
		ПечатнаяФорма = СтрокаПечатнойФормы.ТабличныйДокумент;
		НазваниеПечатнойФормы = СтрокаПечатнойФормы.СинонимМакета;
		
		// Блоки обработки (стандартный функционал)
		Если ОбработанныеПечатныеФормы.Найти(ПечатнаяФорма) <> Неопределено
			ИЛИ ПечатнаяФорма.Вывод = ИспользованиеВывода.Запретить
			ИЛИ (ПечатнаяФорма.Вывод = ИспользованиеВывода.Авто И Не(ПравоДоступа("Вывод", Метаданные)))
			ИЛИ ПечатнаяФорма.Защита
			ИЛИ ПечатнаяФорма.ВысотаТаблицы = 0 Тогда 
			
			Продолжить; 
		КонецЕсли;

		ОбработанныеПечатныеФормы.Добавить(ПечатнаяФорма);
		
		// Фомирование файлов по каждому объекту и по каждому формату
		Для Каждого ОбъектПечати Из ОбъектыПечати Цикл 
			ИмяЭлементаПечати = ОбъектПечати.Представление;
			ЭлементПечати = ОбъектПечати.Значение;
			
			Если ПечатнаяФорма.Области.Найти(ИмяЭлементаПечати) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТабличныйДокумент = ПечатнаяФорма.ПолучитьОбласть(ИмяЭлементаПечати);
			ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ПечатнаяФорма, НаследуемыеСвойства);
			
			// Формирование сохраняемых данных по форматам
			Для Каждого ФорматСохранения Из ФорматыСохранения Цикл
				// Формирование имени файла
				Если ТипЗнч(СтрокаПечатнойФормы.ИмяФайлаПечатнойФормы) = Тип("Соответствие") Тогда 
					ИмяФайла = Строка(СтрокаПечатнойФормы.ИмяФайлаПечатнойФормы.Получить(ЭлементПечати));
					
				ИначеЕсли ТипЗнч(СтрокаПечатнойФормы.ИмяФайлаПечатнойФормы) = Тип("Строка") 
					И Не(ПустаяСтрока(СтрокаПечатнойФормы.ИмяФайлаПечатнойФормы)) Тогда 	
					ИмяФайла = СтрокаПечатнойФормы.ИмяФайлаПечатнойФормы;
					
				Иначе	
					ИмяФайла = ПолучитьИмяФайлаПечатиПоУмолчанию(ЭлементПечати, НазваниеПечатнойФормы);
				КонецЕсли;	
				
				ИмяФайла = ИмяФайла + "." + ФорматСохранения.Расширение;
				//ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла);
				//ИмяФайла = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяВременнойПапки) + ИмяФайла; 
				//ПолноеИмяФайла = ПолучитьПолноеИмяФайлаПечати(ИмяФайла);				
				
				// Запись файла
				ПолноеИмяФайла = ПолучитьИмяВременногоФайла(ФорматСохранения.Расширение);
				ТабличныйДокумент.Записать(ПолноеИмяФайла, ФорматСохранения.ТипФайлаТабличногоДокумента);
				
				Если ФорматСохранения.ТипФайлаТабличногоДокумента = ТипФайлаТабличногоДокумента.HTML Тогда
					ВставитьКартинкиВHTML(ПолноеИмяФайла);
				КонецЕсли;
				
				Если УпаковатьВАрхив Тогда 
					ЗаписьZipФайла.Добавить(ПолноеИмяФайла);
				Иначе
					ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
					ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор());
					
					ОписаниеФайла = Новый Структура;
					ОписаниеФайла.Вставить("ИмяФайла",	ИмяФайла);
					ОписаниеФайла.Вставить("Адрес",		ПутьВоВременномХранилище);
					
					Если ФорматСохранения.ТипФайлаТабличногоДокумента = ТипФайлаТабличногоДокумента.ANSITXT Тогда
						ОписаниеФайла.Вставить("Кодировка", "windows-1251");
					КонецЕсли;
					
					ОписанияФайлов.Добавить(ОписаниеФайла); 
				КонецЕсли;
			КонецЦикла;			
		КонецЦикла;	
	КонецЦикла;

	// Возврат
	Возврат ОписанияФайлов;
	
КонецФункции	

Функция ПолучитьНаследуемыеСвойстваТабличногоДокумента()
	
	НаследуемыеСвойства = "АвтоМасштаб,Вывод,ВысотаСтраницы,ДвусторонняяПечать,Защита,ИмяПринтера,КодЯзыкаМакета,КоличествоЭкземпляров,";
	НаследуемыеСвойства = НаследуемыеСвойства + "МасштабПечати,ОриентацияСтраницы,ПолеСверху,ПолеСлева,ПолеСнизу,ПолеСправа,РазборПоКопиям,";
	НаследуемыеСвойства = НаследуемыеСвойства + "РазмерКолонтитулаСверху,РазмерКолонтитулаСнизу,РазмерСтраницы,ТочностьПечати,";
	НаследуемыеСвойства = НаследуемыеСвойства + "ЧерноБелаяПечать,ШиринаСтраницы,ЭкземпляровНаСтранице";
	
	// Возврат;
	Возврат НаследуемыеСвойства;
	
КонецФункции	

Функция ПолучитьИмяФайлаПечатиПоУмолчанию(ЭлементПечати, НазваниеПечатнойФормы)
	
	Если ОбщегоНазначения.ЭтоДокумент(Метаданные.НайтиПоТипу(ТипЗнч(ЭлементПечати))) Тогда
		ПараметрыДляВставки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлементПечати, "Дата,Номер");
		
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПрефиксацияОбъектов") Тогда
			МодульПрефиксацияОбъектовКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ПрефиксацияОбъектовКлиентСервер");
			ПараметрыДляВставки.Номер = МодульПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ПараметрыДляВставки.Номер);
		КонецЕсли;
		
		ПараметрыДляВставки.Дата = Формат(ПараметрыДляВставки.Дата, "ДЛФ=D");
		ПараметрыДляВставки.Вставить("НазваниеПечатнойФормы", НазваниеПечатнойФормы);
		Шаблон = НСтр("ru = '[НазваниеПечатнойФормы] № [Номер] от [Дата]'");
	Иначе
		ПараметрыДляВставки = Новый Структура;
		ПараметрыДляВставки.Вставить("НазваниеПечатнойФормы",	НазваниеПечатнойФормы);
		ПараметрыДляВставки.Вставить("ПредставлениеОбъекта",	ОбщегоНазначения.ПредметСтрокой(ЭлементПечати));
		ПараметрыДляВставки.Вставить("ТекущаяДата",				Формат(ТекущаяДатаСеанса(), "ДЛФ=D"));
		Шаблон = НСтр("ru = '[НазваниеПечатнойФормы] - [ПредставлениеОбъекта] - [ТекущаяДата]'");
	КонецЕсли;
	
	ИмяФайла = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ПараметрыДляВставки);
	
	// Возврат
	Возврат ИмяФайла;
	
КонецФункции	

Функция ПолучитьПолноеИмяФайлаПечати(ИмяФайла, КоличествоПопыток = 100)
	
	Файл = Новый Файл(ИмяФайла);
	ИмяБезРасширения = Файл.ИмяБезРасширения;
	Расширение = Файл.Расширение;
	Папка = Файл.Путь;
	
	Счетчик = 1;
	Пока Файл.Существует() 
		И Счетчик <= КоличествоПопыток Цикл
		Счетчик = Счетчик + 1;
		Файл = Новый Файл(Папка + ИмяБезРасширения + " (" + Счетчик + ")" + Расширение);
	КонецЦикла;
	
	ПолноеИмяФайла = Файл.ПолноеИмя;

	// Возврат 
	Возврат ПолноеИмяФайла;
	
КонецФункции	

Процедура ВставитьКартинкиВHTML(ИмяФайлаHTML)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	ТекстHTML = ТекстовыйДокумент.ПолучитьТекст();
	
	ФайлHTML = Новый Файл(ИмяФайлаHTML);
	
	ИмяПапкиКартинок = ФайлHTML.ИмяБезРасширения + "_files";
	ПутьКПапкеКартинок = СтрЗаменить(ФайлHTML.ПолноеИмя, ФайлHTML.Имя, ИмяПапкиКартинок);
	
	// ожидается, что в папке будут только картинки
	ФайлыКартинок = НайтиФайлы(ПутьКПапкеКартинок, "*");
	
	Для Каждого ФайлКартинки Из ФайлыКартинок Цикл
		КартинкаТекстом = Base64Строка(Новый ДвоичныеДанные(ФайлКартинки.ПолноеИмя));
		КартинкаТекстом = "data:image/" + Сред(ФайлКартинки.Расширение, 2) + ";base64," + Символы.ПС + КартинкаТекстом;
		
		ТекстHTML = СтрЗаменить(ТекстHTML, ИмяПапкиКартинок + "\" + ФайлКартинки.Имя, КартинкаТекстом);
	КонецЦикла;
		
	ТекстовыйДокумент.УстановитьТекст(ТекстHTML);
	ТекстовыйДокумент.Записать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектроннаяПочта

Функция СоздатьЭлектронноеПисьмо(ПолучателиПисьма, ПолучателиКопий, Тема, Текст, Вложения, СвязанныеДокументы, ПараметрыПисьма) Экспорт
	
	// Формирование письма
	НачатьТранзакцию();
	
	Попытка
		ЭлектронноеПисьмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
		ЭлектронноеПисьмо.Дата = ТекущаяДата();
		ЭлектронноеПисьмо.Тема = Тема;
		ЭлектронноеПисьмо.Текст = Текст;
		ЗаполнитьЗначенияСвойств(ЭлектронноеПисьмо, ПараметрыПисьма);
		
		ЗаполнитьПолучателей(ЭлектронноеПисьмо.ПолучателиПисьма, ПолучателиПисьма);
		ЭлектронноеПисьмо.СписокПолучателейПисьма = ВзаимодействияКлиентСервер.ПолучитьПредставлениеСпискаАдресатов(ЭлектронноеПисьмо.ПолучателиПисьма, Ложь);
		
		ЗаполнитьПолучателей(ЭлектронноеПисьмо.ПолучателиКопий, ПолучателиКопий);
		ЭлектронноеПисьмо.СписокПолучателейКопий = ВзаимодействияКлиентСервер.ПолучитьПредставлениеСпискаАдресатов(ЭлектронноеПисьмо.ПолучателиКопий, Ложь);
		
		// Запись
		ЭлектронноеПисьмо.Записать(РежимЗаписиДокумента.Запись);
		
		// Формирование вложений
		Для Каждого Вложение Из Вложения Цикл 
			УправлениеЭлектроннойПочтой.ЗаписатьВложениеЭлектронногоПисьмаИзВременногоХранилища(
				ЭлектронноеПисьмо.Ссылка,
				Вложение.Адрес,
				Вложение.ИмяФайла,
				0);
		КонецЦикла;	
		
		Для Каждого СвязанныйДокумент Из СвязанныеДокументы Цикл 
			РегистрыСведений.ИТ_ИсходящиеПисьмаДокументов.СоздатьЗаписьПоПисьмуИДокументу(СвязанныйДокумент, ЭлектронноеПисьмо.Ссылка); 
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(
			"Рассылка интернет заказов",
			УровеньЖурналаРегистрации.Ошибка,,, 
			ОписаниеОшибки);
	КонецПопытки;	

КонецФункции	

Функция ПолучитьПараметрыЭлектронногоПисьма(
	УчетнаяЗапись	= Неопределено, 
	СтатусПисьма	= Неопределено, 
	Важность		= Неопределено,
	ТипТекста		= Неопределено, 
	Кодировка		= Неопределено) Экспорт 
	
	ПараметрыПисьма = Новый Структура(
		"УчетнаяЗапись,СтатусПисьма,Важность,ТипТекста,Кодировка",
		УчетнаяЗапись,СтатусПисьма,Важность,ТипТекста,Кодировка);
	
	ИТ_ОбработкаДанных.ОпределитьСвойствоСтруктуры(ПараметрыПисьма, "ТипТекста",
		Тип("ПеречислениеСсылка.ТипыТекстовЭлектронныхПисем"), Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст); 
	ИТ_ОбработкаДанных.ОпределитьСвойствоСтруктуры(ПараметрыПисьма, "Кодировка",
		Тип("Строка"), "UTF-8");
	ИТ_ОбработкаДанных.ОпределитьСвойствоСтруктуры(ПараметрыПисьма, "Важность",
		Тип("ПеречислениеСсылка.ВариантыВажностиВзаимодействия"), Перечисления.ВариантыВажностиВзаимодействия.Обычная);
	ИТ_ОбработкаДанных.ОпределитьСвойствоСтруктуры(ПараметрыПисьма, "СтатусПисьма",
		Тип("ПеречислениеСсылка.СтатусыИсходящегоЭлектронногоПисьма"), Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Исходящее);
	ИТ_ОбработкаДанных.ОпределитьСвойствоСтруктуры(ПараметрыПисьма, "УчетнаяЗапись",
		Тип("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты"), Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты);

	// Возврат
	Возврат ПараметрыПисьма;
	
КонецФункции	

Функция ЗаполнитьПолучателей(ТаблицаПолучателей, МассивКонтактов)
	
	Для Каждого Контакт Из МассивКонтактов Цикл 
		ТипКонтакта = ТипЗнч(Контакт);
		
		Если ТипКонтакта = Тип("Структура") Тогда 
			ЗаполнитьЗначенияСвойств(ТаблицаПолучателей.Добавить(), Контакт, "Адрес,Представление");
			
		ИначеЕсли ТипКонтакта = Тип("СправочникСсылка.СтроковыеКонтактыВзаимодействий") Тогда 
			Если ТаблицаПолучателей.Найти(Контакт, "Контакт") = Неопределено Тогда
				СтруктураКонтакта = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(Контакт);
			
				Если СтруктураКонтакта.Количество() > 0 Тогда 
					СтрокаПолучателя = ТаблицаПолучателей.Добавить();
					СтрокаПолучателя.Контакт = Контакт;
					ЗаполнитьЗначенияСвойств(СтрокаПолучателя, СтруктураКонтакта.Получить(0));
				КонецЕсли;	
			КонецЕсли;	
		ИначеЕсли ТипКонтакта = Тип("СправочникСсылка.Пользователи") Тогда	
			Если ТаблицаПолучателей.Найти(Контакт, "Контакт") = Неопределено Тогда
				СтрокаПолучателя = ТаблицаПолучателей.Добавить();
				СтрокаПолучателя.Контакт = Контакт;
				Взаимодействия.ДозаполнитьПоляКонтактов(
					СтрокаПолучателя.Контакт, 
					СтрокаПолучателя.Представление,
					СтрокаПолучателя.Адрес,
					Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);	
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_bazium

//Функция ОпределитьТокенАвторизации_bazium(ТокенАвторизации)
//	
//	// Формирование токена
//	// Если токен не передан попытка его определить
//	Если ТокенАвторизации = Неопределено Тогда 
//		ТокенАвторизации = ПолучитьТокенАвторизации_bazium();
//	КонецЕсли;	
//	
//	// Если определить токен не удалось, получение данных невозможно
//	Если ТокенАвторизации = Неопределено Тогда 
//		ЗаписатьОшибку_bazium("Токен не передан и его не удалось определить, получение данных невозможно");
//	КонецЕсли;
//	
//	// Возврат
//	Возврат ТокенАвторизации;
//	
//КонецФункции	

//Функция ПолучитьHTTPСоединение_bazium(АдресСервера)
//	
//	ЗащищенноеСоединение	= Новый ЗащищенноеСоединениеOpenSSL();
//	HTTPСоединение			= Новый HTTPСоединение(АдресСервера,,,,,, ЗащищенноеСоединение);;
//	
//	Если HTTPСоединение = Неопределено Тогда 
//	 	ЗаписатьОшибку_bazium(СтрШаблон(
//			"Не удалось сформировать http-соединение. Адрес сервера: ""%1""",
//			Строка(АдресСервера)));
//	КонецЕсли;	
//	
//	// Возврат
//	Возврат HTTPСоединение; 
//	
//КонецФункции	

//Функция ПолучитьСтруктураДанныхHTTPОтвета_bazium(HTTPСоединение, HTTPЗапрос, МетодЗапроса)
//	
//	Если МетодЗапроса = "GET" Тогда 
//		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
//	ИначеЕсли МетодЗапроса = "POST" Тогда
//	    HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
//	Иначе
//		Возврат Неопределено;	
//	КонецЕсли;	
//		
//	ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
//	ЧтениеJSON = Новый ЧтениеJSON();
//	ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
//	
//	// Возврат
//	Возврат ПрочитатьJSON(ЧтениеJSON);
//	
//КонецФункции	

//Функция ДобавитьЗаголовкиHTTPЗапроса_bazium(HTTPЗапрос)
//	
//	HTTPЗапрос.Заголовки.Вставить("Accept",			"application/json");
//	HTTPЗапрос.Заголовки.Вставить("Content-Type",	"application/x-www-form-urlencoded");
//	HTTPЗапрос.Заголовки.Вставить("Authority",		"bazium.com");
//	HTTPЗапрос.Заголовки.Вставить("Pragma",			"no-cache");
//	HTTPЗапрос.Заголовки.Вставить("User-Agent",		"none");
//	
//	// Возврат
//	Возврат Истина;
//	
//Конецфункции

//Процедура ЗаписатьОшибку_bazium(ТекстОшибки)
//	
//	ЗаписьЖурналаРегистрации(
//		"Интернет-заказы: запрос данных bazium",
//		УровеньЖурналаРегистрации.Ошибка,,,
//		ТекстОшибки);
//	
//КонецПроцедуры

#КонецОбласти

#Область ЗачаткиГлобальныхПроцедур

Функция ПолучитьАктуальныеТорговыеТочки(НачалоПериода = Неопределено, КонецПериода = Неопределено) Экспорт

	ИТ_ОбработкаДанных.ОпределитьЗначение(НачалоПериода,	Тип("Дата"), НачалоДня(ТекущаяДата()));	
	ИТ_ОбработкаДанных.ОпределитьЗначение(КонецПериода,		Тип("Дата"), КонецДня(НачалоПериода));
	
	// Торговая точка должна принадлежать локации
	// Торговая точка должна быть открыта
	// Локация должна быть открыта
	Запрос = Новый Запрос();
	Запрос.Текст = 
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ИТ_ЛокацииДоставки.Ссылка КАК ЛокацияДоставки,
		//|	ИТ_ЛокацииДоставки.ОсновнаяТорговаяТочка КАК ОсновнаяТорговаяТочка
		//|ИЗ
		//|	Справочник.ИТ_ЛокацииДоставки КАК ИТ_ЛокацииДоставки
		//|ГДЕ
		//|	НЕ ИТ_ЛокацииДоставки.ПометкаУдаления
		//|	И ИТ_ЛокацииДоставки.ДатаОткрытия <> ДАТАВРЕМЯ(1, 1, 1)
		//|	И ИТ_ЛокацииДоставки.ДатаОткрытия <= &КонецПериода
		//|	И (ИТ_ЛокацииДоставки.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		//|			ИЛИ ИТ_ЛокацииДоставки.ДатаЗакрытия >= &НачалоПериода)
		//|	И ИТ_ЛокацииДоставки.ОсновнаяТорговаяТочка.ДатаОткрытия <> ДАТАВРЕМЯ(1, 1, 1)
		//|	И ИТ_ЛокацииДоставки.ОсновнаяТорговаяТочка.ДатаОткрытия <= &КонецПериода
		//|	И (ИТ_ЛокацииДоставки.ОсновнаяТорговаяТочка.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		//|			ИЛИ ИТ_ЛокацииДоставки.ОсновнаяТорговаяТочка.ДатаЗакрытия >= &НачалоПериода)
		//|	И ИТ_ЛокацииДоставки.ОсновнаяТорговаяТочка.Направление В(&НаправленияЛокаций)
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	ЗНАЧЕНИЕ(Справочник.ИТ_ЛокацииДоставки.ПустаяСсылка),
		//|	ит_ТорговыеТочки.Ссылка
		//|ИЗ
		//|	Справочник.ит_ТорговыеТочки КАК ит_ТорговыеТочки
		//|ГДЕ
		//|	НЕ ит_ТорговыеТочки.ПометкаУдаления
		//|	И ит_ТорговыеТочки.ДатаОткрытия <> ДАТАВРЕМЯ(1, 1, 1)
		//|	И ит_ТорговыеТочки.ДатаОткрытия <= &КонецПериода
		//|	И (ит_ТорговыеТочки.ДатаЗакрытия >= &НачалоПериода
		//|			ИЛИ ит_ТорговыеТочки.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
		//|	И НЕ ит_ТорговыеТочки.Направление В (&НаправленияЛокаций)";
	
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.ИТ_ЛокацииДоставки.ПустаяСсылка) КАК ЛокацияДоставки,
		|	ит_ТорговыеТочки.Ссылка КАК ОсновнаяТорговаяТочка
		|ИЗ
		|	Справочник.ит_ТорговыеТочки КАК ит_ТорговыеТочки
		|ГДЕ
		|	НЕ ит_ТорговыеТочки.ПометкаУдаления
		|	И ит_ТорговыеТочки.ДатаОткрытия <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ит_ТорговыеТочки.ДатаОткрытия <= &КонецПериода
		|	И (ит_ТорговыеТочки.ДатаЗакрытия >= &НачалоПериода
		|			ИЛИ ит_ТорговыеТочки.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))";
	
	НаправленияЛокаций = Новый Массив();
	НаправленияЛокаций.Добавить(Перечисления.ит_Направление.Москва);
	НаправленияЛокаций.Добавить(Перечисления.ит_Направление.Москва_ВТ_Север);
	НаправленияЛокаций.Добавить(Перечисления.ит_Направление.Москва_ВТ_ЮГ);
	
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);
	Запрос.УстановитьПараметр("НаправленияЛокаций",	НаправленияЛокаций);
	
	РезультатЗапроса	= Запрос.Выполнить();
	ТаблицаДанных		= РезультатЗапроса.Выгрузить();
	
	// Возврат
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ПолучитьАктуальнуюНоменклатуру(ПолучитьМассив = Истина) Экспорт
	
	ЗапрещенныеТовары = Константы.ИТ_ЗапрещенныеТовары.Получить().Получить();
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК ТаблицаНоменклатуры
		|ГДЕ
		|	НЕ ТаблицаНоменклатуры.ПометкаУдаления
		|	И НЕ ТаблицаНоменклатуры.ЭтоГруппа
		|	И ТаблицаНоменклатуры.ЕРПМастерКлюч <> """"
		|	И НЕ ТаблицаНоменклатуры.Ссылка В ИЕРАРХИИ (&ЗапрещенныеТовары)";
	
	Запрос.УстановитьПараметр("ЗапрещенныеТовары", ЗапрещенныеТовары);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаНоменклатуры = РезультатЗапроса.Выгрузить();
	
	// Возврат	
	Если ПолучитьМассив Тогда 
		Возврат ТаблицаНоменклатуры.ВыгрузитьКолонку("Номенклатура");
	Иначе
		Возврат ТаблицаНоменклатуры;	
	КонецЕсли;	
		
		
КонецФункции	

#КонецОбласти

#КонецОбласти
