
&НаСервере
Функция ПолучитьТранспортныйМодуль(Грузополучатель)
	
	ТранспортныйМодуль = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(Грузополучатель) Тогда
		Возврат ТранспортныйМодуль;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТранспортныеМодулиЕГАИС.Ссылка КАК ТранспортныйМодуль
	|ИЗ
	|	Справочник.ТранспортныеМодулиЕГАИС КАК ТранспортныеМодулиЕГАИС
	|ГДЕ
	|	ТранспортныеМодулиЕГАИС.ОрганизацияЕГАИС = &ОрганизацияЕГАИС
	|");
	
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", Грузополучатель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		ТранспортныйМодуль = Выборка.ТранспортныйМодуль;
	КонецЕсли;
	
	Возврат ТранспортныйМодуль;
	
КонецФункции // ПолучитьТранспортныйМодуль()

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыЗапроса = Новый Структура("Номер");
	ТекущиеДанные = ПараметрыВыполненияКоманды.Источник.Элементы.Список.ТекущиеДанные;
	ВыделенныеСправки = ПараметрыВыполненияКоманды.Источник.Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСправки.Количество()>1 Тогда
		Если НЕ ТекущиеДанные = Неопределено Тогда
			ПараметрыЗапроса = ПоискСправок2(ВыделенныеСправки);
			ТранспортныйМодуль = Новый Структура;
			Для Каждого ТекСтрока Из ВыделенныеСправки Цикл
				ТранспортныйМодуль1 = ПолучитьТранспортныйМодуль(ТекущиеДанные.Грузополучатель);
				ТранспортныйМодуль.Вставить("ТранспортныйМодуль", ТранспортныйМодуль1);
			КонецЦикла;
		КонецЕсли;
		ВыделенныеСтроки = ПараметрыВыполненияКоманды.Источник.Элементы.Список.ВыделенныеСтроки;
		ПараметрыЗапроса = ПоискСправок2(ВыделенныеСтроки);
	ИначеЕсли НЕ ТекущиеДанные = Неопределено Тогда
		ПараметрыЗапроса = Новый Структура("Номер", ТекущиеДанные.Номер);
		ТранспортныйМодуль = ПолучитьТранспортныйМодуль(ТекущиеДанные.Грузополучатель);
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидСообщения",       ПредопределенноеЗначение("Перечисление.ВидыОбъектовЕГАИС.ЗапросФормы2"));
	ПараметрыФормы.Вставить("ДанныеДляВыгрузки",  ДанныеДляВыгрузки);
	ПараметрыФормы.Вставить("ТранспортныйМодуль", ТранспортныйМодуль);
	
	ОткрытьФорму("Обработка.МодульОбменаЕГАИС.Форма.ФормированиеЗапроса",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
&НаСервере
Функция ПоискСправок2(МассивСправок)
	РезультатПоиска = Новый Массив;
	Для Каждого ТекСправка Из МассивСправок Цикл
		ПараметрыЗапросаСтруктура = Новый Структура("Номер");
		ПараметрыЗапросаСтруктура.Вставить("Номер", ТекСправка);
		РезультатПоиска.Добавить(ПараметрыЗапросаСтруктура);
	КонецЦикла;
	Возврат РезультатПоиска;
КонецФункции

