
#Область Строки

Функция ПолучитьКлючПоСтроке(Знач Строка) Экспорт
	
	Строка = УбратьНеЗначащиеСимволы(Строка);
	
	// ФормированиеКлюча
	ДлинаКлюча = СтрДлина(Строка);
	ПрошлыйСимвол = " ";
	ТекущийСимвол = "";
	
	Для НомерСимвола = 1 По ДлинаКлюча Цикл
		ТекущийСимвол = Сред(Строка, НомерСимвола, 1);
		
		Если ТекущийСимвол <> " "
			И ТекущийСимвол <> Символы.НПП
			И (ПрошлыйСимвол = " "
				Или ПрошлыйСимвол = Символы.НПП) Тогда 
			Строка = СтрШаблон("%1%2%3",
				Лев(Строка, НомерСимвола - 1),
				ВРег(ТекущийСимвол),
				?(НомерСимвола + 1 < ДлинаКлюча, Сред(Строка, НомерСимвола + 1), ""));
		КонецЕсли;
		
		ПрошлыйСимвол = ТекущийСимвол;
	КонецЦикла;	
	
	Строка = СтрЗаменить(Строка, " ", "");
	Строка = СтрЗаменить(Строка, Символы.НПП, "");
	
	// Возврат
	Возврат Строка;

КонецФункции	

Функция УбратьНеЗначащиеСимволы(Знач Строка) Экспорт
	
	Строка = СокрЛП(Строка);
	Строка = СтрЗаменить(Строка, Символы.ВК, "");
	Строка = СтрЗаменить(Строка, Символы.ВТаб, "");
	Строка = СтрЗаменить(Строка, Символы.ПС, "");
	Строка = СтрЗаменить(Строка, Символы.ПФ, "");
	Строка = СтрЗаменить(Строка, Символы.Таб, "");
	Строка = СтрЗаменить(Строка, "ё", "е");
	Строка = СтрЗаменить(Строка, "Ё", "Е");
	Строка = СтрЗаменить(Строка, """", "");
	Строка = СтрЗаменить(Строка, "!", "");
	Строка = СтрЗаменить(Строка, "@", "");
	Строка = СтрЗаменить(Строка, "№", "");
	Строка = СтрЗаменить(Строка, "#", "");
	Строка = СтрЗаменить(Строка, ";", "");
	Строка = СтрЗаменить(Строка, "$", "");
	Строка = СтрЗаменить(Строка, "%", "");
	Строка = СтрЗаменить(Строка, "^", "");
	Строка = СтрЗаменить(Строка, ":", "");
	Строка = СтрЗаменить(Строка, "?", "");
	Строка = СтрЗаменить(Строка, "&", "");
	Строка = СтрЗаменить(Строка, "*", "");
	Строка = СтрЗаменить(Строка, "(", "");
	Строка = СтрЗаменить(Строка, ")", "");
	Строка = СтрЗаменить(Строка, "-", "");
	Строка = СтрЗаменить(Строка, "+", "");
	Строка = СтрЗаменить(Строка, "=", "");
	Строка = СтрЗаменить(Строка, "/", "");
	Строка = СтрЗаменить(Строка, "|", "");
	Строка = СтрЗаменить(Строка, "\", "");
	Строка = СтрЗаменить(Строка, "'", "");
	Строка = СтрЗаменить(Строка, "<", "");
	Строка = СтрЗаменить(Строка, ">", "");
	Строка = СтрЗаменить(Строка, "`", "");
	Строка = СтрЗаменить(Строка, "~", "");
	Строка = СтрЗаменить(Строка, ".", "");
	Строка = СтрЗаменить(Строка, ",", "");
	
	// Возврат 
	Возврат Строка;
	
КонецФункции	

#КонецОбласти

#Область ТекстовыеДокументы

Процедура ДобавитьУдалитьКомментарий(ЭлементФормы, РеквизитФормы, Добавить = Истина) Экспорт
	
	ПерваяСтрока = 0;		ПерваяКолонка = 0; 
	ПоследняяСтрока = 0;	ПоследняяКолонка = 0;
	ЭлементФормы.ПолучитьГраницыВыделения(ПерваяСтрока, ПерваяКолонка, ПоследняяСтрока, ПоследняяКолонка);
	
	ТекстДоИзменения = РеквизитФормы.ПолучитьТекст();
	КоличествоСтрок = СтрЧислоСтрок(ТекстДоИзменения);
	ВыделенныйФрагмент = "";
	ДлинаПоследнейСтроки = ПоследняяКолонка;
	
	Если ПоследняяКолонка = 1 Тогда 
		ПоследняяСтрока = ПоследняяСтрока - 1;
	КонецЕсли;
	
	Если ПерваяСтрока >= ПоследняяСтрока 
		И ПоследняяКолонка = 1 Тогда 
		ПоследняяКолонка = СтрДлина(СтрПолучитьСтроку(ТекстДоИзменения, ПерваяСтрока));
		ПоследняяСтрока = ПерваяСтрока;
	КонецЕсли;

	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		Фрагмент = СтрПолучитьСтроку(ТекстДоИзменения, НомерСтроки);
		
		Если НомерСтроки >= ПерваяСтрока 
			И НомерСтроки <= ПоследняяСтрока Тогда
			
			Если Добавить Тогда 
				Если НомерСтроки = ПерваяСтрока Тогда 
					ВыделенныйФрагмент = ВыделенныйФрагмент + "//" + Фрагмент;
				Иначе
					ВыделенныйФрагмент = ВыделенныйФрагмент + Символы.ПС + "//" +Фрагмент;
				КонецЕсли;
			Иначе		
				Если СтрНачинаетсяС(СокрЛ(Фрагмент), "//") Тогда
					Позиция = СтрНайти(Фрагмент, "//");
					Фрагмент = Лев(Фрагмент, Позиция - 1) + Сред(Фрагмент, Позиция + 2);
				КонецЕсли;
				
				Если НомерСтроки = ПерваяСтрока Тогда 
					ВыделенныйФрагмент = ВыделенныйФрагмент + Фрагмент;
				Иначе
					ВыделенныйФрагмент = ВыделенныйФрагмент + Символы.ПС + Фрагмент;
				КонецЕсли;
			КонецЕсли;	
			
			Если НомерСтроки = ПоследняяСтрока Тогда 
				ДлинаПоследнейСтроки = СтрДлина(Фрагмент) + 3;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ПоследняяКолонка = 1 Тогда 
		ПоследняяСтрока = ПоследняяСтрока + 1;
		ДлинаПоследнейСтроки = 1;
		ВыделенныйФрагмент =  ВыделенныйФрагмент + Символы.ПС;
	КонецЕсли;

	ЭлементФормы.УстановитьГраницыВыделения(ПерваяСтрока, 1, ПоследняяСтрока, ДлинаПоследнейСтроки);
	ЭлементФормы.ВыделенныйТекст = ВыделенныйФрагмент;
	ЭлементФормы.УстановитьГраницыВыделения(ПерваяСтрока, 1, ПоследняяСтрока, ДлинаПоследнейСтроки);
	
КонецПроцедуры

#КонецОбласти