#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьЗначениеВЕТИС(РезультатСоответствия) Экспорт
	
	ИндексЗначения = Перечисления.РезультатыСоответствияВЕТИС.Индекс(РезультатСоответствия);
	
	Результат = Метаданные.Перечисления.РезультатыСоответствияВЕТИС.ЗначенияПеречисления[ИндексЗначения].Имя;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначение(РезультатСоответствия) Экспорт
	
	Результат = Неопределено;
	
	ЗначениеПеречисления = Метаданные.Перечисления.РезультатыСоответствияВЕТИС.ЗначенияПеречисления.Найти(РезультатСоответствия);
	Если Не ЗначениеПеречисления = Неопределено Тогда
		ИндексЗначения = Метаданные.Перечисления.РезультатыСоответствияВЕТИС.ЗначенияПеречисления.Индекс(ЗначениеПеречисления);
		Результат = Перечисления.РезультатыСоответствияВЕТИС[ИндексЗначения];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли