#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьЗначениеВЕТИС(УровеньУпаковки) Экспорт
	
	Если Не ЗначениеЗаполнено(УровеньУпаковки) Тогда
		Возврат 5;
	КонецЕсли;
	
	ИндексЗначения = Перечисления.УровниУпаковокВЕТИС.Индекс(УровеньУпаковки);
	
	Результат = Число(Метаданные.Перечисления.УровниУпаковокВЕТИС.ЗначенияПеречисления[ИндексЗначения].Комментарий);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначение(Знач УровеньУпаковки) Экспорт
	
	Результат = Перечисления.УровниУпаковокВЕТИС.ДополнительныйУровень;
	
	Если Не ЗначениеЗаполнено(УровеньУпаковки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	УровеньУпаковки = Строка(УровеньУпаковки);
	
	НайденноеЗначение = Неопределено;
	
	ЗначенияПеречисления = Метаданные.Перечисления.УровниУпаковокВЕТИС.ЗначенияПеречисления;
	Для Каждого ЗначениеПеречисления Из ЗначенияПеречисления Цикл
		Если ЗначениеПеречисления.Комментарий = УровеньУпаковки Тогда
			НайденноеЗначение = ЗначениеПеречисления;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не НайденноеЗначение = Неопределено Тогда
		ИндексЗначения = Метаданные.Перечисления.УровниУпаковокВЕТИС.ЗначенияПеречисления.Индекс(НайденноеЗначение);
		Результат = Перечисления.УровниУпаковокВЕТИС[ИндексЗначения];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли