// Модуль основной формы документа "Выписка"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
&НаКлиенте
перем ШтрихКодДляПоиска;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
	Если Объект.ХозОперация = Справочники.ХозОперации.БанковскаяВыписка Тогда
		ВидыДоговоров = Справочники.ХозОперации.ПолучитьВидыДоговоров(Объект.ХозОперация);
		Если Не Элементы.Найти("СоставДоговорВзаиморасчетов")=Неопределено Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.СоставДоговорВзаиморасчетов.ПараметрыВыбора, "Отбор.ВидДоговора", ВидыДоговоров);
		КонецЕсли;
		
		// добавим отбор по Договору и Контрагенту для сделки
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(Новый СвязьПараметраВыбора("Отбор.Контрагент", "Элементы.Состав.ТекущиеДанные.Контрагент"));
		НовыйМассив.Добавить(Новый СвязьПараметраВыбора("Отбор.ДоговорВзаиморасчетов", "Элементы.Состав.ТекущиеДанные.ДоговорВзаиморасчетов"));
		
	Иначе
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.Контрагент"));
		НовыйМассив.Добавить(Новый СвязьПараметраВыбора("Отбор.ДоговорВзаиморасчетов", "Объект.ДоговорВзаиморасчетов"));
		
	КонецЕсли;
	
	Если НЕ Объект.ХозОперация = Справочники.ХозОперации.СтрокаБанковскойВыписки И Объект.Товары.Количество()>0 Тогда
		Объект.Товары.Очистить();
		РедактироватьТовары = Ложь;
	Конецесли;
	
	Элементы.СоставСделка.СвязиПараметровВыбора= Новый ФиксированныйМассив(НовыйМассив);

КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	Элементы.СтраницаПлатеж.Видимость = НЕ (Объект.ХозОперация = Справочники.ХозОперации.БанковскаяВыписка);
	
	ЭтоСтрокаБанковскойВыписки = (Объект.ХозОперация = Справочники.ХозОперации.СтрокаБанковскойВыписки)
								ИЛИ (Объект.ХозОперация = Справочники.ХозОперации.ПоступлениеВОперационнуюКассу)
								ИЛИ (Объект.ХозОперация = Справочники.ХозОперации.РасходИзОперационнойКассы);
	Элементы.ПлатежноеПоручениеОснование.Видимость = ЭтоСтрокаБанковскойВыписки;
	Элементы.СоставСтатьяДДС.Видимость = НЕ ЭтоСтрокаБанковскойВыписки;
	Элементы.СоставКонтрагент.Видимость = НЕ ЭтоСтрокаБанковскойВыписки;
	Элементы.СоставДоговорВзаиморасчетов.Видимость = НЕ ЭтоСтрокаБанковскойВыписки;
	Элементы.СоставСтавкаНДС.Видимость = НЕ ЭтоСтрокаБанковскойВыписки;
	Элементы.СоставНазначениеПлатежа.Видимость = НЕ ЭтоСтрокаБанковскойВыписки;
	Элементы.СоставПлатежноеПоручениеОснование.Видимость = НЕ ЭтоСтрокаБанковскойВыписки;
	Элементы.ОписаниеВходящегоДокумента.Видимость = ЭтоСтрокаБанковскойВыписки;
	Элементы.СоставНомерВходящегоДокумента.Видимость = НЕ ЭтоСтрокаБанковскойВыписки;
	Элементы.СоставДатаВходящегоДокумента.Видимость = НЕ ЭтоСтрокаБанковскойВыписки;
	
	Элементы.СуммаДокументаПриход.Доступность=Ложь;
	Элементы.СуммаДокументаРасход.Доступность=Ложь;
	Элементы.СуммаУслуг.Доступность = ?(Объект.СтатьяДДС = Справочники.СтатьиДДС.ОплатаБанковскихУслуг, Ложь, Истина);
	Если ЗначениеЗаполнено(Объект.СтатьяДДС) Тогда
		Если Объект.СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Приход Тогда
			Элементы.СуммаДокументаПриход.Доступность=Истина;
		ИначеЕсли Объект.СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Расход Тогда
			Элементы.СуммаДокументаРасход.Доступность=Истина;
		ИначеЕсли Объект.СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Прочее Тогда
			Элементы.СуммаДокументаПриход.Доступность=Истина;
			Элементы.СуммаДокументаРасход.Доступность=Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Установим доступность полей ввода фискальных данных
	Элементы.ФискальныеРеквизиты.Видимость = (Объект.ХозОперация = Справочники.ХозОперации.СтрокаБанковскойВыписки);
	Элементы.СтраницаТовары.Видимость = (Объект.ХозОперация = Справочники.ХозОперации.СтрокаБанковскойВыписки);
	Если Элементы.ФискальныеРеквизиты.Видимость Тогда
		Элементы.ФискальныеРеквизитыПараметры.Доступность = Объект.ДляПробитияНаФР;
		Элементы.ФормаПробитьЧек.Доступность = НЕ ЗначениеЗаполнено(Объект.ДатаФР) И НЕ ТолькоПросмотр;
		Элементы.СтраницаТовары.Видимость = Объект.Товары.Количество()>0 И Объект.ДляПробитияНаФР И РедактироватьТовары;
		Элементы.РедактироватьТовары.Доступность = Объект.ДляПробитияНаФР ;
	КонецЕсли;
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
	// Просмотр сумм
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СоставСуммаРасход.Имя);
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СоставПлатежноеПоручениеОснование.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Состав.ВидДвижения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВидыДвижений.Приход;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СоставСуммаПриход.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Состав.ВидДвижения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВидыДвижений.Расход;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СоставПроцентКомиссии.Имя);
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СоставСуммаУслуг.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Состав.СтатьяДДС");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.СтатьиДДС.ОплатаБанковскихУслуг;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	Пробит = ЗначениеЗаполнено(Объект.ДатаФР);
	СписокРеквизитов.Добавить("ЭтотОбъект","ЭтотОбъект",Пробит);
	
	Для Каждого ИмяРеквизита Из Метаданные.Документы.Выписка.ТабличныеЧасти.Товары.Реквизиты Цикл
		Если ИмяРеквизита.Имя = "ДоговорВзаиморасчетов" Тогда
			Продолжить;	
		КонецЕсли;
		СписокРеквизитов.Добавить("Товары."+ИмяРеквизита.Имя,"Товары."+ИмяРеквизита.Имя,Истина);
	КонецЦикла;
	ЭлементыКомандноеПанели = ";ТоварыКоманднаяПанель, ТоварыКонтекстноеМенюДобавить, ТоварыКонтекстноеМенюСкопировать, ТоварыКонтекстноеМенюУдалить, ТоварыКонтекстноеМенюПереместить";
	СписокРеквизитов.Добавить(ЭлементыКомандноеПанели,ЭлементыКомандноеПанели,Истина);

	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗапретитьРедактированиеВалютыДокумента", Истина);
	ПараметрыДействия.Вставить("ДопПараметры", ДополнительныеПараметры);
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события кнопки "ПробитьЧек"
//
&НаКлиенте
Процедура ПробитьЧек(Команда)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
		
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ПробитьЧек(ЭтотОбъект,ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события кнопки "УправлениеККМ"
&НаКлиенте
Процедура УправлениеККМ(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ФР", Объект.ФР);
	
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.УправлениеФискальнымУстройством", ПараметрыФормы, ЭтотОбъект,, ВариантОткрытияОкна.ОтдельноеОкно);

КонецПроцедуры //УправлениеККМ()

// Обработчик события нажатия кнопки "Подбор номенклатуры".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомКлиент.ОткрытьПодборНоменклатуры(ЭтотОбъект);
	
КонецПроцедуры // ПодборНоменклатуры()

// Обработчик события нажатия кнопки "Перезаполнить товары" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ПерезаполнитьТоварыНаСервере(ПараметрыДействия = Неопределено)
	
	Объект.Товары.Очистить();
	Если РедактироватьТовары И Объект.ДляПробитияНаФР Тогда
		Объект.Товары.Загрузить(УправлениеДиалогомДокументаСервер.ПодготовитьТаблицуТоваров(Объект));	
	КонецЕсли;

КонецПроцедуры // ПерезаполнитьТоварыНаСервере()

// Обработчик события нажатия кнопки "Перезаполнить товары".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПерезаполнитьТовары(Команда)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ПерезаполнитьТоварыНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ПерезаполнитьТовары()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Банковский счет" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура БанковскийСчетПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Обработаем событие в контексте сервера
	Документы.Выписка.БанковскийСчетПриИзменении(Объект,ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // БанковскийСчетПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Банковский счет".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура БанковскийСчетПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ПараметрыДействия = Новый Структура;
	
	БанковскийСчетПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // БанковскийСчетПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ПлатежноеПоручениеОснованиеПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ПлатежноеПоручениеОснованиеПриИзменении(Объект, ПараметрыДействия);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПлатежноеПоручениеОснованиеПриИзменении(Команда)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ПлатежноеПоручениеОснованиеПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

&НаКлиенте
Процедура НомерВходящегоДокументаПриИзменении(Элемент)
	
	Если НЕ ПустаяСтрока(Объект.НомерВходящегоДокумента) И НЕ ЗначениеЗаполнено(Объект.ДатаВходящегоДокумента) Тогда
		Объект.ДатаВходящегоДокумента = ОбщегоНазначенияКлиент.ДатаСеанса();
	ИначеЕсли ПустаяСтрока(Объект.НомерВходящегоДокумента) Тогда
		Объект.ДатаВходящегоДокумента = Дата(1, 1, 1);
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ СТРАНИЦЫ "ПЛАТЕЖ"

// Обработчик события возникающего на клиенте при изменении данных реквизита "Контрагент" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура КонтрагентПриИзмененииНаСервере(Элемент, ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	ПараметрыДействия = Новый Структура;
	Документы.Выписка.КонтрагентПриИзменении(Объект, ПараметрыДействия);
	
	// настроим параметры выбора
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();

КонецПроцедуры // КонтрагентПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Контрагент".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ПараметрыДействия = Новый Структура;
	КонтрагентПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // КонтрагентПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Договор взаиморасчетов" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДоговорВзаиморасчетовПриИзмененииНаСервере(Элемент, ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	ПараметрыДействия = Новый Структура;
	Документы.Выписка.ДоговорВзаиморасчетовПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();

КонецПроцедуры // ДоговорВзаиморасчетовПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Договор взаиморасчетов".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДоговорВзаиморасчетовПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ПараметрыДействия = Новый Структура;
	ДоговорВзаиморасчетовПриИзмененииНаСервере(ПараметрыДействия);

КонецПроцедуры  // ДоговорВзаиморасчетовПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Статья ДДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СтатьяДДСПриИзмененииНаСервере(Элемент, ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	ПараметрыДействия = Новый Структура;
	Документы.Выписка.СтатьяДДСПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // СтатьяДДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Статья ДДС".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СтатьяДДСПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ПараметрыДействия = Новый Структура;
	СтатьяДДСПриИзмененииНаСервере(ПараметрыДействия);

КонецПроцедуры // СтатьяДДСПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма документа приход" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СуммаДокументаПриходПриИзмененииНаСервере(Элемент, ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	ПараметрыДействия = Новый Структура;
	Документы.Выписка.СуммаДокументаПриходПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();

КонецПроцедуры // СуммаДокументаПриходПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма документа приход".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СуммаДокументаПриходПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ПараметрыДействия = Новый Структура;
	СуммаДокументаПриходПриИзмененииНаСервере(ПараметрыДействия);

КонецПроцедуры // СуммаДокументаПриходПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма документа расход" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СуммаДокументаРасходПриИзмененииНаСервере(Элемент, ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	ПараметрыДействия = Новый Структура;
	Документы.Выписка.СуммаДокументаРасходПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();

КонецПроцедуры // СуммаДокументаРасходПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма документа расход".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СуммаДокументаРасходПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ПараметрыДействия = Новый Структура;
	СуммаДокументаРасходПриИзмененииНаСервере(ПараметрыДействия);

КонецПроцедуры // СуммаДокументаРасходПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма услуг" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СуммаУслугПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.СуммаУслугПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // СуммаУслугПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма услуг".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СуммаУслугПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СуммаУслугПриИзмененииНаСервере();
	
КонецПроцедуры // СуммаУслугПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Ставка НДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СтавкаНДСПриИзмененииНаСервере(Элемент, ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	ПараметрыДействия = Новый Структура;
	Документы.Выписка.СтавкаНДСПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();

КонецПроцедуры // СтавкаНДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Ставка НДС".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ПараметрыДействия = Новый Структура;
	СтавкаНДСПриИзмененииНаСервере(ПараметрыДействия);

КонецПроцедуры // СтавкаНДСПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма НДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СуммаНДСПриИзмененииНаСервере(Элемент, ПараметрыДействия = Неопределено)
	
	Зарезервировано = Истина;
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();

КонецПроцедуры // СуммаНДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма НДС".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СуммаНДСПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ПараметрыДействия = Новый Структура;
	СуммаНДСПриИзмененииНаСервере(ПараметрыДействия);

КонецПроцедуры // СуммаНДСПриИзменении()

// Обработчик события возникающего на клиенте при изменении значения флага "Для ФР".
//
// Параметры:
//  Элемент - ПолеФормы - элемент формы, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДляПробитияНаФРПриИзменении(Элемент)
	
	// Установим доступность полей ввода фискальных данных
	Элементы.ФискальныеРеквизитыПараметры.Доступность = Объект.ДляПробитияНаФР;
	Элементы.РедактироватьТовары.Доступность = Объект.ДляПробитияНаФР ;
		
КонецПроцедуры // ДляПробитияНаФРПриИзменении()

// Обработчик события возникающего  при изменении данных реквизита "Касса ККМ" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура КассаККМПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.КассаККМПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // КассаККМПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Касса ККМ".
//
// Параметры:
//  Элемент - ПолеФормы - элемент формы, в котором возникло данное событие.
//
&НаКлиенте
Процедура КассаККМПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
		
	// Обработаем событие в контексте сервера
	КассаККМПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // КассаККМПриИзменении()

// Обработчик события возникающего  при изменении данных реквизита "Редактировать товары" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура РедактироватьТоварыПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	ПерезаполнитьТоварыНаСервере();
		
	// Обновляем отображение формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // РедактироватьТоварыПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Редактировать товары".
//
// Параметры:
//  Элемент - ПолеФормы - элемент формы, в котором возникло данное событие.
//
&НаКлиенте
Процедура РедактироватьТоварыПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	РедактироватьТоварыПриИзмененииНаСервере();
	
КонецПроцедуры // РедактироватьТоварыПриИзменении()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "СОСТАВ"

// Обработчик события возникающего при изменении данных реквизита "Статья ДДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СоставСтатьяДДСПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Состав.НайтиПоИдентификатору(Элементы.Состав.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.СоставСтатьяДДСПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	Если ТекущиеДанные.ВидДвижения = Перечисления.ВидыДвижений.Приход
		И ЗначениеЗаполнено(ТекущиеДанные.ПлатежноеПоручениеОснование) Тогда
		
		ТекущиеДанные.ПлатежноеПоручениеОснование = Неопределено;
		СоставПлатежноеПоручениеОснованиеПриИзмененииНаСервере(ПараметрыДействия);
		
	КонецЕсли;
	
	// Настроим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
КонецПроцедуры // СоставСтатьяДДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Статья ДДС".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СоставСтатьяДДСПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СоставСтатьяДДСПриИзмененииНаСервере();

КонецПроцедуры // СоставСтатьяДДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Контрагент" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СоставКонтрагентПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Состав.НайтиПоИдентификатору(Элементы.Состав.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.СоставКонтрагентПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // СоставКонтрагентПриИзмененииНаСервере()

// Обработчик события, возникающего на клиенте при изменении данных реквизита "Контрагент".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СоставКонтрагентПриИзменении(Элемент)

	// Обработаем событие в контексте сервера
	СоставКонтрагентПриИзмененииНаСервере();

КонецПроцедуры // СоставКонтрагентПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Договор взаиморасчетов" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СоставДоговорВзаиморасчетовПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Состав.НайтиПоИдентификатору(Элементы.Состав.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.СоставДоговорВзаиморасчетовПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // СоставДоговорВзаиморасчетовПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Договор взаиморасчетов".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СоставДоговорВзаиморасчетовПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СоставДоговорВзаиморасчетовПриИзмененииНаСервере();
	
КонецПроцедуры // СоставДоговорВзаиморасчетовПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сделка" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СоставСделкаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Состав.НайтиПоИдентификатору(Элементы.Состав.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.СоставСделкаПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	ПерезаполнитьТоварыНаСервере();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // СоставСделкаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сделка".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СоставСделкаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СоставСделкаПриИзмененииНаСервере();

КонецПроцедуры  // СоставСделкаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма приход" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СоставСуммаПриходПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Состав.НайтиПоИдентификатору(Элементы.Состав.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.СоставСуммаПриходПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // СоставСуммаПриходПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма приход".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СоставСуммаПриходПриИзменении(Элемент)

	// Обработаем событие в контексте сервера
	СоставСуммаПриходПриИзмененииНаСервере();

КонецПроцедуры // СоставСуммаПриходПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма расход" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СоставСуммаРасходПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Состав.НайтиПоИдентификатору(Элементы.Состав.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.СоставСуммаРасходПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // СоставСуммаРасходПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма расход".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СоставСуммаРасходПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СоставСуммаРасходПриИзмененииНаСервере();
	
КонецПроцедуры // СоставСуммаРасходПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Процент комиссии" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СоставПроцентКомиссииПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Состав.НайтиПоИдентификатору(Элементы.Состав.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.СоставПроцентКомиссииПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // СоставПроцентКомиссииПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Процент комиссии".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СоставПроцентКомиссииПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СоставПроцентКомиссииПриИзмененииНаСервере();
	
КонецПроцедуры // СоставПроцентКомиссииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма услуг" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СоставСуммаУслугПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Состав.НайтиПоИдентификатору(Элементы.Состав.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.СоставСуммаУслугПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // СоставСуммаУслугПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма услуг".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СоставСуммаУслугПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СоставСуммаУслугПриИзмененииНаСервере();
	
КонецПроцедуры // СоставСуммаУслугПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма разница" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СоставСуммаРазницаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Состав.НайтиПоИдентификатору(Элементы.Состав.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.СоставСуммаРазницаПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // СоставСуммаРазницаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма разница".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СоставСуммаРазницаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СоставСуммаРазницаПриИзмененииНаСервере();
	
КонецПроцедуры // СоставСуммаРазницаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СоставСтавкаНДСПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Состав.НайтиПоИдентификатору(Элементы.Состав.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.СоставСтавкаНДСПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // СоставСтавкаНДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Ставка НДС".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СоставСтавкаНДСПриИзменении(Элемент)

	// Обработаем событие в контексте сервера
	СоставСтавкаНДСПриИзмененииНаСервере();

КонецПроцедуры // СоставСтавкаНДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма НДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СоставСуммаНДСПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	Зарезервировано = Истина;
	
КонецПроцедуры // СоставСуммаНДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма НДС".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СоставСуммаНДСПриИзменении(Элемент)

	// Обработаем событие в контексте сервера
	СоставСуммаНДСПриИзмененииНаСервере();

КонецПроцедуры // СоставСуммаНДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Платежное поручение основание" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СоставПлатежноеПоручениеОснованиеПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Состав.НайтиПоИдентификатору(Элементы.Состав.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.СоставПлатежноеПоручениеОснованиеПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // СоставПлатежноеПоручениеОснованиеПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Платежное поручение основание".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СоставПлатежноеПоручениеОснованиеПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СоставПлатежноеПоручениеОснованиеПриИзмененииНаСервере();
	
КонецПроцедуры // СоставПлатежноеПоручениеОснованиеПриИзменении()

&НаКлиенте
Процедура СоставНомерВходящегоДокументаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.НомерВходящегоДокумента)
		И НЕ ЗначениеЗаполнено(ТекущиеДанные.ДатаВходящегоДокумента) Тогда
		
		ТекущиеДанные.ДатаВходящегоДокумента = ОбщегоНазначенияКлиент.ДатаСеанса();
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущиеДанные.НомерВходящегоДокумента) Тогда
		
		ТекущиеДанные.ДатаВходящегоДокумента = Дата(1, 1, 1);
		
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "СОСТАВ"

// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура СоставПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Зарезервировано = Истина;
	
КонецПроцедуры // СоставПередНачаломДобавления()

// Обработчик события возникающего на клиенте перед началом интерактивного изменения строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура СоставПередНачаломИзменения(Элемент, Отказ)
	
	Зарезервировано = Истина;
	
КонецПроцедуры // СоставПередНачаломИзменения()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура СоставПередУдалением(Элемент, Отказ)
	
	Зарезервировано = Истина;
	
КонецПроцедуры // СоставПередУдалением()

// Обработчик события возникающего на клиенте при изменении данных табличной части "Состав" в контексте сервера.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаСервере
Процедура СоставПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	Зарезервировано = Истина;
	
	Если Объект.ХозОперация = Справочники.ХозОперации.СтрокаБанковскойВыписки И Элементы.Состав.ТекущаяСтрока <> Неопределено Тогда
		ТекущиеДанные = Объект.Состав.НайтиПоИдентификатору(Элементы.Состав.ТекущаяСтрока);
		Если ТекущиеДанные.СтатьяДДС <> Объект.СтатьяДДС Тогда
			ТекущиеДанные.СтатьяДДС = Объект.СтатьяДДС;
			Документы.Выписка.СоставСтатьяДДСПриИзменении(Объект, ТекущиеДанные);
		КонецЕсли;
		Если ТекущиеДанные.Контрагент <> Объект.Контрагент Тогда
			ТекущиеДанные.Контрагент = Объект.Контрагент;
			ПараметрыДействия        = Новый Структура("ПерерасчетНеТребуется",Истина);
			Документы.Выписка.СоставКонтрагентПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
		КонецЕсли;
		Если ТекущиеДанные.ДоговорВзаиморасчетов <> Объект.ДоговорВзаиморасчетов Тогда
			ТекущиеДанные.ДоговорВзаиморасчетов = Объект.ДоговорВзаиморасчетов;
			ПараметрыДействия                   = Новый Структура("ПерерасчетНеТребуется",Истина);
			Документы.Выписка.СоставДоговорВзаиморасчетовПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
		КонецЕсли; 
		Если ТекущиеДанные.СтавкаНДС <> Объект.СтавкаНДС Тогда
			ТекущиеДанные.СтавкаНДС = Объект.СтавкаНДС;
			Документы.Выписка.СоставСтавкаНДСПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
		КонецЕсли; 
	КонецЕсли;
	
	ЗащищенныеФункцииСервер.УстановитьЗаголовокНадписиСуммаДокумента(ЭтотОбъект);
	
	Документы.Выписка.ЗаполнитьПлатежноеПоручениеОснование(Объект);
	
КонецПроцедуры // СоставПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных табличной части "Состав".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СоставПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СоставПриИзмененииНаСервере();
	
КонецПроцедуры // СоставПриИзменении()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура СоставПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПриОкончанииРедактирования(ЭтотОбъект, Элемент, НоваяСтрока, ОтменаРедактирования, "Состав");
	
КонецПроцедуры // СоставПриОкончанииРедактирования()

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СоставПослеУдаленияНаСервере(ПараметрыДействия = Неопределено)
	
	ПерезаполнитьТоварыНаСервере();
	
	// Обновляем отображение формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // СоставПослеУдаленияНаСервере()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СоставПослеУдаления(Элемент)
	
	// Обработаем событие в контексте сервера
	СоставПослеУдаленияНаСервере();
	
КонецПроцедуры // СоставПослеУдаления()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                        - Строка таблицы, над которой находится курсор.
//  Поле                          - Элемент управляемой формы, с которым связана данная колонка таблицы.
//
&НаКлиенте
Процедура СоставПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Зарезервировано = Истина;
	
КонецПроцедуры // СоставПроверкаПеретаскивания()

&НаСервере
Процедура СоставДокументПланированияПриИзмененииНаСервере()
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Состав.НайтиПоИдентификатору(Элементы.Состав.ТекущаяСтрока);
	
	Если ТекущиеДанные.ДокументПланирования = Документы.ЗаявкаНаРасходДС.ПустаяСсылка() ИЛИ ТекущиеДанные.ДокументПланирования = Документы.ПланПоступленияДС.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	// Очистим текущуюСтроку
	ТекущиеДанные.ВидДвижения 			      = Перечисления.ВидыДвижений.ПустаяСсылка();
	ТекущиеДанные.ДоговорВзаиморасчетов       = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	ТекущиеДанные.Контрагент                  = Справочники.Контрагенты.ПустаяСсылка();
	ТекущиеДанные.КоррСчет                    = ПланыСчетов.Регламентированный.ПустаяСсылка();
	ТекущиеДанные.КурсВалютыВзаиморасчетов    = 0;
	ТекущиеДанные.НазначениеПлатежа           = "";
	ТекущиеДанные.ПлатежноеПоручениеОснование = Документы.ПлатежноеПоручение.ПустаяСсылка();
	ТекущиеДанные.ПроцентКомиссии             = 0;
	ТекущиеДанные.Сделка                      = Неопределено;
	ТекущиеДанные.СтавкаНДС                   = Справочники.СтавкиНДС.ПустаяСсылка();
	ТекущиеДанные.СтатьяДДС                   = Справочники.СтатьиДДС.ПустаяСсылка();
	ТекущиеДанные.СуммаНДС                    = 0;
	ТекущиеДанные.СуммаПриход                 = 0;
	ТекущиеДанные.СуммаРасход                 = 0;
	ТекущиеДанные.СуммаУслуг                  = 0;
	
	Запрос = Новый Запрос;
	Если ТипЗнч(ТекущиеДанные.ДокументПланирования) = Тип("ДокументСсылка.ЗаявкаНаРасходДС") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗаявкаНаРасходДС.СтатьяДДС КАК СтатьяДДС,
			|	ЗаявкаНаРасходДС.Контрагент КАК Контрагент,
			|	ЗаявкаНаРасходДС.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
			|	ЗаявкаНаРасходДС.ДокументОснование КАК Сделка,
			|	СУММА(ЗаявкаНаРасходДСПлатежи.Сумма) КАК СуммаРасход,
			|	0 КАК СуммаПриход
			|ИЗ
			|	Документ.ЗаявкаНаРасходДС.Платежи КАК ЗаявкаНаРасходДСПлатежи
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходДС КАК ЗаявкаНаРасходДС
			|		ПО ЗаявкаНаРасходДСПлатежи.Ссылка = ЗаявкаНаРасходДС.Ссылка
			|ГДЕ
			|	ЗаявкаНаРасходДС.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаявкаНаРасходДС.СтатьяДДС,
			|	ЗаявкаНаРасходДС.Контрагент,
			|	ЗаявкаНаРасходДС.ДоговорВзаиморасчетов,
			|	ЗаявкаНаРасходДС.ДокументОснование";
	
	ИначеЕсли ТипЗнч(ТекущиеДанные.ДокументПланирования) = Тип("ДокументСсылка.ПланПоступленияДС") Тогда
		Запрос.Текст = 
			 "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			 |	ПланПоступленияДС.СтатьяДДС КАК СтатьяДДС,
			 |	ПланПоступленияДС.Контрагент КАК Контрагент,
			 |	ПланПоступленияДС.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
			 |	ПланПоступленияДС.ДокументОснование КАК Сделка,
			 |	0 КАК СуммаРасход,
			 |	СУММА(ПланПоступленияДСПлатежи.Сумма) КАК СуммаПриход
			 |ИЗ
			 |	Документ.ПланПоступленияДС.Платежи КАК ПланПоступленияДСПлатежи
			 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПланПоступленияДС КАК ПланПоступленияДС
			 |		ПО (ПланПоступленияДС.Ссылка = ПланПоступленияДС.Ссылка)
			 |ГДЕ
			 |	ПланПоступленияДС.Ссылка = &Ссылка
			 |
			 |СГРУППИРОВАТЬ ПО
			 |	ПланПоступленияДС.СтатьяДДС,
			 |	ПланПоступленияДС.Контрагент,
			 |	ПланПоступленияДС.ДоговорВзаиморасчетов,
			 |	ПланПоступленияДС.ДокументОснование";
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Ссылка", ТекущиеДанные.ДокументПланирования);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекущиеДанные.СтатьяДДС             = Выборка.СтатьяДДС;
		ТекущиеДанные.Контрагент            = Выборка.Контрагент;
		ТекущиеДанные.ДоговорВзаиморасчетов = Выборка.ДоговорВзаиморасчетов;
		ТекущиеДанные.Сделка                = Выборка.Сделка;
		ТекущиеДанные.СуммаРасход           = Выборка.СуммаРасход;
		ТекущиеДанные.СуммаПриход           = Выборка.СуммаПриход;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставДокументПланированияПриИзменении(Элемент)
	СоставДокументПланированияПриИзмененииНаСервере()
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ТоварыНоменклатураПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	// Вызываем общий обработчик изменения реквизитов формы
	УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(ЭтотОбъект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыНоменклатураПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыНоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Характеристика номенклатуры" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ТоварыХарактеристикаНоменклатурыПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Характеристика номенклатуры".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЕдиницаИзмеренияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ТоварыЕдиницаИзмеренияПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Единица измерения".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЕдиницаИзмеренияПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыКоличествоПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ТоварыКоличествоПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыКоличествоПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыКоличествоПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыКоличествоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество базовое" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыКоличествоБазовоеПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ТоварыКоличествоБазовоеПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыКоличествоБазовоеПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество базовое".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыКоличествоБазовоеПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыКоличествоБазовоеПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыКоличествоБазовоеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЦенаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ТоварыЦенаПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЦенаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Цена".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЦенаПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЦенаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ТоварыСуммаПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСуммаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма всего" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаВсегоПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ТоварыСуммаВсегоПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаВсегоПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма всего".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаВсегоПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаВсегоПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСуммаВсегоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСтавкаНДСПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ТоварыСтавкаНДСПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСтавкаНДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Ставка НДС".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСтавкаНДСПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСтавкаНДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма НДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаНДСПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ТоварыСуммаНДСПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаНДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма НДС".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаНДСПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаНДСПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСуммаНДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма скидки строки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаСкидкиСтрокиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ТоварыСуммаСкидкиСтрокиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма скидки строки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаСкидкиСтрокиПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаСкидкиСтрокиПриИзмененииНаСервере();
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Сумма скидки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаСкидкиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ТоварыСуммаСкидкиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма скидки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаСкидкиПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаСкидкиПриИзмененииНаСервере();
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Скидка на товар" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСкидкаНаТоварПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ТоварыСкидкаНаТоварПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении данных реквизита "Скидка на товар".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСкидкаНаТоварПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСкидкаНаТоварПриИзмененииНаСервере();
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Процент скидки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыПроцентСкидкиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ТоварыПроцентСкидкиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении данных реквизита "Процент скидки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПроцентСкидкиПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыПроцентСкидкиПриИзмененииНаСервере();
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Процент скидки строки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыПроцентСкидкиСтрокиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Выписка.ТоварыПроцентСкидкиСтрокиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыПроцентСкидкиСтрокиПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Процент скидки строки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПроцентСкидкиСтрокиПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыПроцентСкидкиСтрокиПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыПроцентСкидкиСтрокиПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры // ТоварыПередНачаломДобавления()

// Обработчик события возникающего на клиенте перед началом интерактивного изменения строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередНачаломИзменения()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередУдалением(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередУдалением()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПриОкончанииРедактирования(ЭтотОбъект, Элемент, НоваяСтрока, ОтменаРедактирования);
	
КонецПроцедуры // ТоварыПриОкончанииРедактирования()

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыПослеУдаленияНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ТоварыПослеУдаления(ЭтотОбъект, Элементы.Товары, ПараметрыДействия);
	
КонецПроцедуры // ТоварыПослеУдаленияНаСервере()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыПослеУдаленияНаСервере();
	
КонецПроцедуры // ТоварыПослеУдаления()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                        - Строка таблицы, над которой находится курсор.
//  Поле                          - Элемент управляемой формы, с которым связана данная колонка таблицы.
//
&НаКлиенте
Процедура ТоварыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // ТоварыПроверкаПеретаскивания()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()

// Обработчик события возникающего на клиенте при нажатии на надпись "Сумма документа".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьСуммаДокументаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.ПоказатьРасширенныеИтогиОперации(ЭтотОбъект, Элемент);
	
КонецПроцедуры // НадписьСуммаДокументаНажатие()

// Обработчик события возникающего на клиенте при нажатии на надпись "Взаиморасчеты".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьВзаиморасчетыНажатие(Элемент)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.НадписьВзаиморасчетыНажатие(ЭтотОбъект);
	
КонецПроцедуры // НадписьВзаиморасчетыНажатие()

&НаКлиенте
Процедура БанковскийСчетРасширеннаяПодсказкаНажатие(Элемент)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.НадписьДенежныеСредстваНажатие(ЭтотОбъект, "БанковскийСчет");
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним служебные реквизиты ТЧ Состав
	Для Каждого ТекущаяСтрока Из Объект.Состав Цикл
		ТекущаяСтрока.ВидДвижения = ТекущаяСтрока.СтатьяДДС.ВидДвижения;
	КонецЦикла;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Заблокируем выбор строки в платежное получение
	Ограничение = Новый ОписаниеТипов("ДокументСсылка.ПлатежноеПоручение");
	Элементы.ПлатежноеПоручениеОснование.ОграничениеТипа = Ограничение;
	Элементы.СоставПлатежноеПоручениеОснование.ОграничениеТипа = Ограничение;
	
	РедактироватьТовары = Объект.Товары.Количество()>0;
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	 	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура ПоискВТаблицеТовары(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПоискВТаблицеТоварыРезультатОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ПоискВТаблицеТоварыРезультатОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ШтрихКодДляПоиска = РезультатОповещения;
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ПоискПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКоду(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ДобавлениеНовыхПозицийПоШтрихКодуОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКодуОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ДобавлениеНовыхПозицийПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтборВТаблицеТовары(Команда)
	Элементы.Товары.ОтборСтрок = Неопределено;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ШтрихКодДляПоиска = "";