
#Область ОбработкаСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	Если ЗначениеЗаполнено(Объект.ПериодПлана) Тогда 
		ОбновитьДанныеПланаПродаж();
	КонецЕсли;	
	
	ОбновитьПраваДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПланаПриИзменении(Элемент)
	
	ОбновитьДанныеПланаПродаж();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПраваДоступа()
	
	Если ЗначениеЗаполнено(Объект.Статус) Тогда 
		ПраваПоДокументу		= ИТ_ПланыПродаж.ПолучитьПраваДоступа("ЛинейныйМенеджер", Объект.Статус);
		РедактированиеДоступно	= ПраваПоДокументу.Редактирование;
		ТолькоПросмотр			= Не(РедактированиеДоступно);
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьДанныеПланаПродаж()
	
	// УДАЛЕНИЕ ПРОШЛЫХ ЭЛЕМЕНТОВ //
	Для НомерДня = 0 По МаксимальныйНомерДня Цикл 
		УдалитьЭлементФормы(ПолучитьИмяЭлементаСуммыПоНомеру(НомерДня));	
		УдалитьЭлементФормы(ПолучитьИмяЭлементаОбнуленияПоНомеру(НомерДня));
	КонецЦикла;	
	
	// ФОРМИРОВАНИЕ ПЕРИОДОВ //
	Объект.ПериодПлана	= НачалоМесяца(Объект.ПериодПлана);
	НачалоПериода		= Объект.ПериодПлана;
	КонецПериода		= НачалоДня(КонецМесяца(Объект.ПериодПлана));
	ПолноеНачалоПериода	= НачалоНедели(НачалоПериода);
	ПолныйКонецПериода	= НачалоДня(КонецНедели(КонецПериода));
	
	// НАЧАЛЬНЫЕ ДАННЫЕ //
	ТекущийДень			= ПолноеНачалоПериода - 86400;
	НомерДня			= 0;
	НомерДняПланаПродаж	= 0;
	НомерНедели			= 0;
	
	// ПАРАМЕТРЫ ЭЛЕМЕНТОВ //
	ТипЭлемента				= Тип("ПолеФормы");
	ВидЭлементаСуммы		= ВидПоляФормы.ПолеВвода;
	ВидЭлементаОбнуления	= ВидПоляФормы.ПолеФлажка;
	
	// ПОСТРОЕНИЕ ЭЛЕМЕНТОВ //
	Пока ТекущийДень < ПолныйКонецПериода Цикл 
		ТекущийДень			= НачалоДня(ТекущийДень + 86401);
		НомерДня			= НомерДня + 1;
		НомерДня_Строка		= ПолучитьЧислоСтрокой(НомерДня); 
		ДеньНедели			= ДеньНедели(ТекущийДень);
		ДеньНедели_Строка	= ПолучитьЧислоСтрокой(ДеньНедели);
		
		Если ДеньНедели = 1 Тогда 
			НомерНедели				= НомерНедели + 1;
			НомерНедели_Строка		= ПолучитьЧислоСтрокой(НомерНедели);
			ГруппаНедели			= Элементы.Найти(СтрШаблон("Группа_ПланПродаж_Неделя_%1", НомерНедели_Строка));
			ГруппаНедели.Заголовок	= СтрШаблон("Неделя с %1 по %2", Формат(НачалоНедели(ТекущийДень), "ДФ=дд.ММ"), Формат(КонецНедели(ТекущийДень), "ДФ=дд.ММ"));
		КонецЕсли;
		
		ГруппаДня				= Элементы.Найти(СтрШаблон("Группа_ПланПродаж_Неделя_%1_День_%2", НомерНедели_Строка, ДеньНедели_Строка));
		ИмяЭлементаСуммы		= ПолучитьИмяЭлементаСуммыПоНомеру(НомерДня);	
		ИмяЭлементаОбнуления	= ПолучитьИмяЭлементаОбнуленияПоНомеру(НомерДня);
		ЭлементСуммы			= Элементы.Добавить(ИмяЭлементаСуммы,		ТипЭлемента, ГруппаДня);			
		ЭлементОбнуления		= Элементы.Добавить(ИмяЭлементаОбнуления,	ТипЭлемента, ГруппаДня);
		
		Если ТекущийДень >= НачалоПериода
			И ТекущийДень <= КонецПериода Тогда 
			НомерДняПланаПродаж				= НомерДняПланаПродаж + 1;
			НомерДняПланаПродаж_Строка		= ПолучитьЧислоСтрокой(НомерДняПланаПродаж);
			ЭлементСуммы.ПутьКДанным		= СтрШаблон("Объект.СуммаДень_%1",		НомерДняПланаПродаж_Строка);
			ЭлементОбнуления.ПутьКДанным	= СтрШаблон("Объект.ОбнулитьДень_%1",	НомерДняПланаПродаж_Строка);
		Иначе
			ЭлементСуммы.ПутьКДанным		= "ПустаяСумма";
			ЭлементСуммы.Доступность		= Ложь;
			ЭлементОбнуления.ПутьКДанным	= "ПустоеОбнуление";
			ЭлементОбнуления.Доступность	= Ложь;
		КонецЕсли;	
		
		ЭлементСуммы.Вид					= ВидЭлементаСуммы;
		ЭлементСуммы.АвтоМаксимальнаяШирина	= Ложь;
		ЭлементСуммы.Заголовок				= Формат(ТекущийДень, "ДФ='дд.ММ / ддд'");
		ЭлементСуммы.ПоложениеЗаголовка		= ПоложениеЗаголовкаЭлементаФормы.Верх;
		
		ЭлементОбнуления.Вид				= ВидЭлементаОбнуления;
		ЭлементОбнуления.Заголовок			= "Обнулить";
	КонецЦикла;	
	
	МаксимальныйНомерДня = НомерДня;
	
КонецПроцедуры	

&НаСервере
Процедура УдалитьЭлементФормы(ИмяЭлемента)
	
	ЭлементФормы = Элементы.Найти(ИмяЭлемента);

	Если ЭлементФормы <> Неопределено Тогда 
		Элементы.Удалить(ЭлементФормы);
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьИмяЭлементаСуммыПоНомеру(НомерЭлемента)
	
	Возврат СтрШаблон("Элемент_Сумма_День_%1", ПолучитьЧислоСтрокой(НомерЭлемента))
	
КонецФункции	

&НаСервере
Функция ПолучитьИмяЭлементаОбнуленияПоНомеру(НомерЭлемента)
	
	Возврат СтрШаблон("Элемент_Обнулить_День_%1", ПолучитьЧислоСтрокой(НомерЭлемента))
	
КонецФункции

&НаСервере
Функция ПолучитьЧислоСтрокой(Число)
	
	Возврат Формат(Число, "ЧДЦ=0; ЧН=0; ЧГ=0");
	
КонецФункции

#КонецОбласти




	


