// @strict-types

#Область ПрограммныйИнтерфейс

#Область Подключение

// Возвращает результат проверки прав для подключения центра ЭДО.
// 
// Параметры:
//  ИдентификаторПриложения - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * ЕстьПраво - Булево
//  * Описание - Строка
Функция ПроверитьПравоНастройкиПодключения(ИдентификаторПриложения) Экспорт
	
	Возврат ПодключениеЦентраЭДО.ПроверитьПравоНастройкиПодключения(ИдентификаторПриложения);
	
КонецФункции

// Возвращает результат проверки прав на выполнение действий по ЭДО.
// 
// Возвращаемое значение:
//  Структура:
//  * ЕстьПраво - Булево
//  * Описание - Строка
Функция ПроверитьПравоВыполненияДействийПоЭДО() Экспорт
	
	Возврат ПодключениеЦентраЭДО.ПроверитьПравоВыполненияДействийПоЭДО();
	
КонецФункции

// Возвращает сведения для настройки подключения.
// 
// Параметры:
//  ИдентификаторПриложения - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибка - Неопределено,Строка
//  * Наименование - Строка
//  * ТокенАвторизации - Строка
Функция НастройкаПодключения(ИдентификаторПриложения) Экспорт
	
	Возврат ПодключениеЦентраЭДО.НастройкаПодключения(ИдентификаторПриложения);
	
КонецФункции

#КонецОбласти // Подключение

#Область УчетныеЗаписиЭДО

// Возвращает список доступных учетных записей ЭДО.
// 
// Параметры:
//  КлючевыеРеквизитыОрганизации - См. ИнтеграцияЭДО.КлючевыеРеквизитыОрганизации
// 
// Возвращаемое значение:
//  Массив из Строка
Функция ИдентификаторыУчетныхЗаписейЭДО(КлючевыеРеквизитыОрганизации) Экспорт
	
	Возврат УчетныеЗаписиЭДОЦентрЭДО.ИдентификаторыУчетныхЗаписейЭДО(КлючевыеРеквизитыОрганизации);
	
КонецФункции

// Возвращает идентификаторы организации по данным сервиса 1С-ЭДО.
// 
// Параметры:
//  КлючевыеРеквизитыОрганизации - См. ИнтеграцияЭДО.КлючевыеРеквизитыОрганизации
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * Наименование - Строка
Функция ИдентификаторыУчетныхЗаписейЭДОВСервисе1СЭДО(КлючевыеРеквизитыОрганизации) Экспорт
	
	Возврат УчетныеЗаписиЭДОЦентрЭДО.ИдентификаторыУчетныхЗаписейЭДОВСервисе1СЭДО(КлючевыеРеквизитыОрганизации);
	
КонецФункции

// Возвращает операторов электронного документооборота, которые доступны для подключения через 1С.
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * Наименование - Строка
//  * ИНН - Строка
//  * КПП - Строка
//  * ОГРН - Строка
//  * ОтпечатокСертификата - Строка
//  * СпособОбмена - Строка
Функция ОператорыДляРегистрацииВЭДО() Экспорт
	
	Возврат УчетныеЗаписиЭДОЦентрЭДО.ОператорыДляРегистрацииВЭДО();
	
КонецФункции

// Возвращает результаты создания заявок на регистрацию в сервисе ЭДО.
// 
// Параметры:
//  ДанныеОрганизации - Структура:
//  * НаименованиеСокращенное - Строка
//  * НаименованиеПолное - Строка
//  * ИНН - Строка
//  * КПП - Строка
//  * ОГРН - Строка
//  * СвидетельствоДатаВыдачи - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * СвидетельствоСерияНомер - Строка
//  ДанныеЗаявки - Структура:
//  * Идентификатор - Строка
//  * ОператорЭДО - Строка - код оператора ЭДО.
//  * ИдентификаторЭДО - Строка - уникальный идентификатор участника в обмене электронными документами.
//  * АдресОрганизации - Строка
//  * КодНалоговогоОргана - Строка - код налоговой инспекции, в которой зарегистрирована организация.
//  * ЭлектроннаяПочта - Строка
//  * СертификатыДляРегистрации - Массив из Строка
//  * ДоверенностиСертификатов - Массив из Структура:
//    ** ОтпечатокСертификата - Строка
//    ** ДанныеДоверенности - Структура:
//       *** Номер - Строка
//       *** ДанныеФайла - Строка
//       *** ДанныеПодписи - Строка
//       *** СтатусВРеестреФНС - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * Ошибка - Неопределено - ошибка отсутствует.
//           - Структура:
//  ** СертификатыУжеЗарегистрированы - Булево
//  ** ОтпечаткиСертификатовБезДоверенностей - Неопределено - отсутствуют сертификаты без доверенностей.
//                                           - Массив из Строка - набор отпечатков сертификатов, по которым не найдена доверенность.
//  ** ОжиданиеДругойЗаявки - Неопределено - ожидание отсутствует.
//                          - Строка - идентификатор ожидаемой заявки.
//  ** Представление - Строка
Функция СформироватьЗаявкуНаРегистрациюВЭДО(ДанныеОрганизации, ДанныеЗаявки) Экспорт
	
	Возврат УчетныеЗаписиЭДОЦентрЭДО.СформироватьЗаявкуНаРегистрациюВЭДОДляСовместимости(ДанныеОрганизации, ДанныеЗаявки);
	
КонецФункции

// Заполнить подписанта данных на регистрацию ВЭДО.
// 
// Параметры:
//  ИдентификаторЗаявки - Строка
//  ОтпечатокСертификата - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * Ошибка - Неопределено,Строка
Функция ЗаполнитьПодписантаДанныхНаРегистрациюВЭДО(ИдентификаторЗаявки, ОтпечатокСертификата) Экспорт
	
	Возврат УчетныеЗаписиЭДОЦентрЭДО.ЗаполнитьПодписантаДанныхНаРегистрациюВЭДО(
		ИдентификаторЗаявки, ОтпечатокСертификата);
	
КонецФункции

// Возвращает данные для подписания на регистрацию ВЭДО.
// 
// Параметры:
//  ИдентификаторЗаявки - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибка - Неопределено,Строка
//  * ДанныеДляПодписания - Неопределено,Структура:
//    ** ОтпечаткиСертификатов - Массив из Строка
//    ** ДанныеСоглашения - Строка
//    ** ДанныеДляРегистрации - Строка
Функция ПодготовитьДанныеДляПодписанияНаРегистрациюВЭДО(ИдентификаторЗаявки) Экспорт
	
	Возврат УчетныеЗаписиЭДОЦентрЭДО.ПодготовитьДанныеДляПодписанияНаРегистрациюВЭДО(ИдентификаторЗаявки);
	
КонецФункции

// Добавить подписи данных на регистрацию ВЭДО.
// 
// Параметры:
//  ПодписиЗаявки - Структура:
//  * Идентификатор - Строка
//  * ПодписьСоглашения - Строка
//  * ПодписьДанныхДляРегистрации - Строка
//  * НомерДоверенности - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * Ошибка - Неопределено,Строка
Функция ДобавитьПодписиЗаявкиНаРегистрациюВЭДО(ПодписиЗаявки) Экспорт
	
	Возврат УчетныеЗаписиЭДОЦентрЭДО.ДобавитьПодписиЗаявкиНаРегистрациюВЭДО(ПодписиЗаявки);
	
КонецФункции

// Отправить заявку на регистрацию ВЭДО.
// 
// Параметры:
//  ИдентификаторЗаявки - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * Ошибка - Неопределено,Строка
Функция ОтправитьЗаявкуНаРегистрациюВЭДО(ИдентификаторЗаявки) Экспорт
	
	Возврат УчетныеЗаписиЭДОЦентрЭДО.ОтправитьЗаявкуНаРегистрациюВЭДО(ИдентификаторЗаявки);
	
КонецФункции

// Возвращает состояния регистрации в сервисе ЭДО.
// 
// Параметры:
//  ИдентификаторыЗаявок - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ИдентификаторЗаявки - Строка
//  * ВОбработке - Булево
//  * ИдентификаторЭДО - Неопределено,Строка
//  * Ошибка - Неопределено,Строка
Функция СостоянияРегистрацииЗаявокВЭДО(ИдентификаторыЗаявок) Экспорт
	
	Возврат УчетныеЗаписиЭДОЦентрЭДО.СостоянияРегистрацииЗаявокВЭДО(ИдентификаторыЗаявок);
	
КонецФункции

// Изменяет информацию об учетной записи ЭДО.
// 
// Параметры:
//  ИнформацияОбУчетнойЗаписиЭДО - Структура:
//  * ИдентификаторЭДО - Строка
//  * Наименование - Строка
//  * Назначение - Строка
//  * ПодробноеОписание - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * Ошибка - Неопределено,Строка
Функция ОбновитьИнформациюОбУчетнойЗаписиЭДО(ИнформацияОбУчетнойЗаписиЭДО) Экспорт
	
	Возврат УчетныеЗаписиЭДОЦентрЭДО.ОбновитьИнформациюОбУчетнойЗаписиЭДО(ИнформацияОбУчетнойЗаписиЭДО);
	
КонецФункции

// Изменяет настройки уведомлений учетной записи ЭДО.
// 
// Параметры:
//  ИдентификаторУчетнойЗаписиЭДО - Строка
//  НастройкиУведомлений - Структура:
//  * АдресУведомлений - Строка
//  * УведомлятьОНовыхПриглашениях - Булево
//  * УведомлятьОбОтветахНаПриглашения - Булево
//  * УведомлятьОНовыхДокументах - Булево
//  * УведомлятьОНеОбработанныхДокументах - Булево
//  * УведомлятьОбОкончанииСрокаДействияСертификата - Булево
//  МаркерАвторизации - Структура:
//  * ИдентификаторУчетнойЗаписиЭДО - Строка
//  * ОтпечатокСертификата - Строка
//  * Данные - Строка - двоичные данные в формате base64.
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * Ошибка - Неопределено,Строка
Функция ОбновитьНастройкиУведомленийУчетнойЗаписиЭДО(ИдентификаторУчетнойЗаписиЭДО, НастройкиУведомлений, МаркерАвторизации) Экспорт
	
	Возврат УчетныеЗаписиЭДОЦентрЭДО.ОбновитьНастройкиУведомленийУчетнойЗаписиЭДО(
		ИдентификаторУчетнойЗаписиЭДО, НастройкиУведомлений, МаркерАвторизации);
	
КонецФункции

// Возвращает настройки уведомлений по учетной записи ЭДО.
// 
// Параметры:
//  ИдентификаторУчетнойЗаписиЭДО - Строка
//  МаркерАвторизации - Структура:
//  * ИдентификаторУчетнойЗаписиЭДО - Строка
//  * ОтпечатокСертификата - Строка
//  * Данные - Строка - двоичные данные в формате base64.
// 
// Возвращаемое значение:
//  Структура:
//  * Настройки - Неопределено,Структура:
//  ** АдресУведомлений - Строка
//  ** УведомлятьОСобытиях - Булево
//  ** УведомлятьОНовыхПриглашениях - Булево
//  ** УведомлятьОбОтветахНаПриглашения - Булево
//  ** УведомлятьОНовыхДокументах - Булево
//  ** УведомлятьОНеобработанныхДокументах - Булево
//  ** УведомлятьОбОкончанииСрокаДействияСертификата - Булево
//  * Ошибка - Неопределено,Строка
Функция НастройкиУведомленийУчетнойЗаписиЭДО(ИдентификаторУчетнойЗаписиЭДО, МаркерАвторизации) Экспорт
	
	Возврат УчетныеЗаписиЭДОЦентрЭДО.НастройкиУведомленийУчетнойЗаписиЭДО(
		ИдентификаторУчетнойЗаписиЭДО, МаркерАвторизации);
	
КонецФункции

// Возвращает маркеры авторизации по учетным записям ЭДО зашифрованные на сертификат.
// 
// Параметры:
//  ОтпечаткиСертификатов - Массив из Строка
//  ИдентификаторыУчетныхЗаписейЭДО - Неопределено
//                                  - Массив из Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Структура:
//             ** ИдентификаторУчетнойЗаписиЭДО - Строка
//             ** Тип - Строка
//             ** Текст - Строка
//  * ЗашифрованныеМаркеры - Массив из Структура:
//                           ** ИдентификаторУчетнойЗаписиЭДО - Строка
//                           ** ОтпечатокСертификата - Строка
//                           ** Данные - Строка - двоичные данные в формате base64.
Функция ПолучитьМаркерыАвторизацииПоУчетнымЗаписямЭДО(ОтпечаткиСертификатов, ИдентификаторыУчетныхЗаписейЭДО = Неопределено) Экспорт
	
	Возврат УчетныеЗаписиЭДОЦентрЭДО.ПолучитьМаркерыАвторизацииПоУчетнымЗаписямЭДО(
		ОтпечаткиСертификатов, ИдентификаторыУчетныхЗаписейЭДО);
	
КонецФункции

// Возвращает порцию сведений по учетным записям ЭДО.
// 
// Параметры:
//  МеткиВремениПоИдентификаторамЭДО - Массив из Структура:
//  * МеткаВремени - Число
//  * ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * ЭтоПоследний - Булево
//  * НаборДанных - см. ДанныеСинхронизацииУчетныхЗаписейЭДО
Функция ПорцияДанныхСинхронизацииУчетныхЗаписейЭДОПоМеткамВремени(МеткиВремениПоИдентификаторамЭДО) Экспорт
	
	Возврат УчетныеЗаписиЭДОЦентрЭДО.ПорцияДанныхСинхронизацииУчетныхЗаписейЭДОПоМеткамВремени(
		МеткиВремениПоИдентификаторамЭДО);
	
КонецФункции

// Возвращает сведения по учетным записям ЭДО.
//
// Параметры:
//  ИдентификаторыЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * Состояние - Неопределено,Структура:
//    ** ИдентификаторЭДО - Строка 
//    ** МеткаВремени - Число
//    ** Удаление - Булево
//  * Описание - Неопределено,Структура:
//    ** Идентификатор - Строка
//    ** Наименование - Строка
//    ** Назначение - Строка
//    ** ПодробноеОписание - Строка
//    ** ОператорЭДО - Строка
//    ** ПредставлениеОператораЭДО - Строка
//    ** СпособОбмена - Строка
//    ** ЭлектроннаяПочтаДляУведомлений - Строка
//    ** ОжидатьИзвещениеОПолучении - Булево
//    ** УведомлятьОНовыхПриглашениях - Булево
//    ** УведомлятьОбОтветахНаПриглашения - Булево
//    ** УведомлятьОНовыхДокументах - Булево
//    ** УведомлятьОНеОбработанныхДокументах - Булево
//    ** УведомлятьОбОкончанииСрокаДействияСертификата - Булево
//    ** КодНалоговогоОргана - Строка
//    ** АдресОрганизации - Строка
//    ** Организация - Структура:
//       *** ИНН - Строка
//       *** КПП - Строка
//    ** Сертификаты - Массив из Структура:
//       *** Данные - Строка
//       *** Доверенность - Неопределено,Структура:
//           **** Номер - Строка
//           **** ДанныеФайла - Строка
//           **** ДанныеПодписи - Строка
//           **** СтатусВРеестреФНС - Строка
Функция ДанныеСинхронизацииУчетныхЗаписейЭДО(ИдентификаторыЭДО) Экспорт
	
	Возврат УчетныеЗаписиЭДОЦентрЭДО.ДанныеСинхронизацииУчетныхЗаписейЭДО(ИдентификаторыЭДО);
	
КонецФункции

// Включает использование ключа доступа к сервису ЭДО для автоматического получения
// 
// Параметры:
//  ИдентификаторыУчетнойЗаписиЭДО - Массив из Строка
//  МаркерыАвторизации - Массив из Структура:
//  * ИдентификаторУчетнойЗаписиЭДО - Строка
//  * ОтпечатокСертификата - Строка
//  * Данные - Строка - двоичные данные в формате base64.
// 
// Возвращаемое значение:
//  См. АвтоматическоеПолучениеЭДОЦентрЭДО.ВключитьИспользованиеКлючаДоступаКСервисуЭДО
Функция ВключитьИспользованиеКлючаДоступаКСервисуЭДО(ИдентификаторыУчетнойЗаписиЭДО, МаркерыАвторизации) Экспорт
	
	Возврат АвтоматическоеПолучениеЭДОЦентрЭДО.ВключитьИспользованиеКлючаДоступаКСервисуЭДО(
		ИдентификаторыУчетнойЗаписиЭДО, МаркерыАвторизации);
	
КонецФункции

#КонецОбласти // УчетныеЗаписиЭДО

#Область ПриглашенияЭДО

// Возвращает список доступных операторов ЭДО.
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * Наименование - Строка
Функция СписокОператоровЭДО() Экспорт
	
	Возврат ПриглашенияЭДОЦентрЭДО.СписокОператоровЭДО();
	
КонецФункции

// Возвращает параметры связи между идентификаторами ЭДО организации и идентификаторами ЭДО контрагентов.
// 
// Параметры:
//  ПараметрыАбонентовЭДО - Структура:
//  * Организация - Структура:
//  ** ИНН - Строка
//  ** КПП - Строка
//  * Контрагенты - Массив из Структура:
//  ** НаименованиеСокращенное - Строка
//  ** НаименованиеПолное - Строка
//  ** ИНН - Строка
//  ** КПП - Строка
//  ** ОГРН - Строка
//  ** ЮридическийАдрес - Строка
//  * ИдентификаторыКонтрагента - Массив из Строка
//  * ИдентификаторыОрганизации - Массив из Строка
//  * ФормироватьСписокВыбора - Булево
//  * ПриоритетПодключенные - Булево
// 
// Возвращаемое значение:
//  Массив из см. НовыеПараметрыСвязиИдентификаторовАбонентовЭДО
//
Функция НаборПараметровСвязиИдентификаторовАбонентовЭДО(ПараметрыАбонентовЭДО) Экспорт
	
	Возврат ПриглашенияЭДОЦентрЭДО.НаборПараметровСвязиИдентификаторовАбонентовЭДО(ПараметрыАбонентовЭДО);
	
КонецФункции

// Возвращает шаблон письма о выборе оператора.
// 
// Параметры:
//  ПараметрыПисьма - Структура:
//  * ИдентификаторЭДО - Строка
//  * Организация - Структура:
//  ** Наименование - Строка
//  ** ИНН - Строка
//  ** КПП - Строка
//  * Руководитель - Структура:
//  ** Фамилия - Строка
//  ** Имя - Строка
//  ** Отчество - Строка
//  ** Должность - Строка
// 
// Возвращаемое значение:
//  Строка - ДвоичныеДанные в формате base64.
Функция ШаблонПисьмаОВыбореОператора(ПараметрыПисьма) Экспорт
	
	Возврат ПриглашенияЭДОЦентрЭДО.ШаблонПисьмаОВыбореОператора(ПараметрыПисьма);
	
КонецФункции

// Возвращает результат формирования приглашений ЭДО.
// 
// Параметры:
//  ДанныеПриглашенийЭДО - Массив из Структура:
//  * ЭтоНовоеПриглашение - Булево
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторКонтрагента - Строка
//  * ПолучательИНН - Строка
//  * ПолучательКПП - Строка
//  * ОператорЭДО - Строка
//  * Организация - Структура:
//  ** ИНН - Строка
//  ** КПП - Строка
//  * Контрагент - Структура:
//  ** НаименованиеСокращенное - Строка
//  ** НаименованиеПолное - Строка
//  ** ИНН - Строка
//  ** КПП - Строка
//  ** ОГРН - Строка
//  ** ЮридическийАдрес - Строка
//  * EmailОрганизации - Строка
//  * EmailКонтрагента - Строка
//  * ТекстПриглашения - Строка
//  * ПисьмоОВыбореОператора - Структура:
//  ** ИмяФайла - Строка
//  ** Данные - Строка - ДвоичныеДанные в формате base64.
//  МаркерыАвторизации - См. СинхронизацияЭДОЦентрЭДО.КлючиСинхронизацииИзМаркеровАвторизации.МаркерыАвторизации
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * Статус - Строка
//  * ДатаИзмененияСтатуса - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ОписаниеОшибки - Строка
Функция СформироватьПриглашенияЭДО(ДанныеПриглашенийЭДО, МаркерыАвторизации) Экспорт
	
	Возврат ПриглашенияЭДОЦентрЭДО.СформироватьПриглашенияЭДО(ДанныеПриглашенийЭДО, МаркерыАвторизации);
	
КонецФункции

// Возвращает результат отправки приглашений ЭДО.
// 
// Параметры:
//  ДанныеПриглашенийЭДО - Массив из Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторКонтрагента - Строка
//  МаркерыАвторизации - см. ОтправитьКонтейнерыЭДО.МаркерыАвторизации
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * Статус - Строка
//  * ДатаИзмененияСтатуса - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ОписаниеОшибки - Строка
Функция ОтправитьПриглашенияЭДО(ДанныеПриглашенийЭДО, МаркерыАвторизации) Экспорт
	
	Возврат ПриглашенияЭДОЦентрЭДО.ОтправитьПриглашенияЭДО(ДанныеПриглашенийЭДО, МаркерыАвторизации);
	
КонецФункции

// Возвращает результат принятия приглашения ЭДО.
// 
// Параметры:
//  ДанныеПриглашенийЭДО - Массив из Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторКонтрагента - Строка
//  МаркерыАвторизации - см. ОтправитьКонтейнерыЭДО.МаркерыАвторизации
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * Статус - Строка
//  * ДатаИзмененияСтатуса - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ОписаниеОшибки - Строка
Функция ПринятьПриглашенияЭДО(ДанныеПриглашенийЭДО, МаркерыАвторизации) Экспорт
	
	Возврат ПриглашенияЭДОЦентрЭДО.ПринятьПриглашенияЭДО(ДанныеПриглашенийЭДО, МаркерыАвторизации);
	
КонецФункции

// Отклонить приглашения ЭДО.
// 
// Параметры:
//  ДанныеПриглашенийЭДО - Массив из Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторКонтрагента - Строка
//  * ПричинаОтказа - Строка
//  МаркерыАвторизации - см. ОтправитьКонтейнерыЭДО.МаркерыАвторизации
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * Статус - Строка
//  * ДатаИзмененияСтатуса - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ОписаниеОшибки - Строка
Функция ОтклонитьПриглашенияЭДО(ДанныеПриглашенийЭДО, МаркерыАвторизации) Экспорт
	
	Возврат ПриглашенияЭДОЦентрЭДО.ОтклонитьПриглашенияЭДО(ДанныеПриглашенийЭДО, МаркерыАвторизации);
	
КонецФункции

// Возвращает данные приглашений ЭДО по идентификаторам ключей.
// 
// Параметры:
//  ИдентификаторыПриглашенийЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * Состояние - Неопределено,Структура:
//    ** ИдентификаторЭДО - Строка 
//    ** МеткаВремени - Число
//    ** Удаление - Булево
//  * Описание - Неопределено,Структура:
//    ** Ключ - Строка
//    ** Тип - Строка
//    ** ИдентификаторОрганизации - Строка
//    ** ИдентификаторКонтрагента - Строка
//    ** ПолучательИНН - Строка
//    ** ПолучательКПП - Строка
//    ** ИдентификаторОператора - Строка
//    ** Организация - Структура:
//       *** ИНН - Строка
//       *** КПП - Строка
//    ** Контрагент - Структура:
//       *** Наименование - Строка
//       *** ИНН - Строка
//       *** КПП - Строка
//    ** EmailОрганизации - Строка
//    ** EmailКонтрагента - Строка
//    ** ТекстПриглашения - Строка
//    ** ПричинаОтказа - Строка
//    ** Статус - Строка
//    ** ДатаИзмененияСтатуса - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//    ** ОписаниеОшибки - Строка
Функция ДанныеСинхронизацииПриглашенийЭДО(ИдентификаторыПриглашенийЭДО) Экспорт
	
	Возврат ПриглашенияЭДОЦентрЭДО.ДанныеСинхронизацииПриглашенийЭДО(ИдентификаторыПриглашенийЭДО);
	
КонецФункции

// Измененные приглашения ЭДО.
// 
// Параметры:
//  МеткиВремениПоИдентификаторамЭДО - Массив из Структура:
//  * МеткаВремени - Число
//  * ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * ЭтоПоследний - Булево
//  * НаборДанных - см. ДанныеСинхронизацииПриглашенийЭДО
Функция ПорцияДанныхСинхронизацииПриглашенийЭДОПоМеткамВремени(МеткиВремениПоИдентификаторамЭДО) Экспорт
	
	Возврат ПриглашенияЭДОЦентрЭДО.ПорцияДанныхСинхронизацииПриглашенийЭДОПоМеткамВремени(
		МеткиВремениПоИдентификаторамЭДО);
	
КонецФункции

#КонецОбласти // ПриглашенияЭДО

#Область ЭлектронныеДокументыЭДО

#Область ДействияСДокументамиЭДО

// Возвращает сведения по созданным документам ЭДО.
//
// Параметры:
//  ДанныеДокументовЭДО - Массив из Структура:
//  * Идентификатор     - Строка
//  * Отправитель       - Структура:
//  ** ИНН              - Строка
//  ** КПП              - Строка
//  * Получатель        - Структура:
//  ** ИНН              - Строка
//  ** КПП              - Строка
//  * ВидДокумента      - См. НовыйВидДокументаВФорматеСервиса
//  * ИдентификаторОтправителя - Строка
//  * ИдентификаторПолучателя - Строка
//  * ТребуетсяОтветнаяПодпись - Булево
//  * ТребуетсяИзвещениеОПолучении - Булево
//  * Формат            - Строка - формат, в который конвертируются учетные данные.
//  * УчетныеДанные     - Неопределено,Структура - данные прикладного решения:
//  ** Данные           - Структура
//  ** Формат           - Строка - формат учетных данных.
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * ОписанияДокументовЭДО - Массив из Структура:
//    ** ЭтоВходящийЭДО - Булево
//    ** Идентификатор - Строка
//    ** Формат - Строка
//    ** ВидДокумента - Структура:
//       *** Наименование - Строка
//       *** ТипДокумента - Строка
//    ** Организация - Структура:
//       *** ИНН - Строка
//       *** КПП - Строка
//    ** Контрагент - Структура:
//       *** ИНН - Строка
//       *** КПП - Строка
//    ** Договор - Неопределено,Структура:
//       *** Наименование - Строка
//       *** Номер - Строка
//       *** Дата - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//    ** Дата - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//    ** Номер - Строка
//    ** Сумма - Число
//    ** СпособОбмена - Строка
//    ** ТипРегламента - Строка
//    ** ТребуетсяИзвещение - Булево
//    ** ТребуетсяПодтверждение - Булево
//    ** ИдентификаторОрганизации - Строка
//    ** ИдентификаторКонтрагента - Строка
//    ** ИдентификаторДокументооборота - Строка
//    ** ИмяСостояния - Строка
//    ** СостояниеДополнение - Строка
//    ** ДатаИзмененияСостояния - Строка
//    ** КомментарийСостояния - Строка
//    ** ИдентификаторПакета - Строка
Функция СформироватьДокументыЭДО(ДанныеДокументовЭДО) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.СформироватьДокументыЭДО(ДанныеДокументовЭДО);
	
КонецФункции

// Возвращает сформированные файлы документа ЭДО.
//
// Параметры:
//  ДанныеДокументовЭДО - Массив из Структура:
//  * Идентификатор     - Строка
//  * Отправитель       - Структура:
//  ** ИНН              - Строка
//  ** КПП              - Строка
//  * Получатель        - Структура:
//  ** ИНН              - Строка
//  ** КПП              - Строка
//  * ВидДокумента      - Структура:
//  ** Наименование     - Строка
//  ** ТипДокумента     - Строка
//  * ИдентификаторОтправителя - Строка
//  * ИдентификаторПолучателя - Строка
//  * Формат            - Строка - формат, в который конвертируются учетные данные.
//  * УчетныеДанные     - Структура:
//  ** Данные           - Структура
//  ** Формат           - Строка - формат учетных данных.
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * Ошибки - Неопределено - при формировании без ошибок.
//           - Массив из Строка
//  * ОсновнойФайл - Неопределено - при наличии ошибок.
//                 - Структура:
//  ** ИмяФайла - Строка
//  ** Данные - Строка - двоичные данные в формате base64.
//  * ДополнительныйФайл - Неопределено - при наличии ошибок или отсутствии соответствующих учетных данных.
//                       - Структура:
//  ** ИмяФайла - Строка
//  ** Данные - Строка - двоичные данные в формате base64.
//
Функция СформироватьФайлыДокументовЭДО(ДанныеДокументовЭДО) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.СформироватьФайлыДокументовЭДО(ДанныеДокументовЭДО);
	
КонецФункции

// Возвращает сведения по созданным документам ЭДО на основании файлов.
//
// Параметры:
//  ДанныеДокументовЭДО - Массив из Структура:
//  * Идентификатор     - Строка
//  * Отправитель       - Структура:
//  ** ИНН              - Строка
//  ** КПП              - Строка
//  * Получатель        - Структура:
//  ** ИНН              - Строка
//  ** КПП              - Строка
//  * ВидДокумента      - Структура:
//  ** Наименование     - Строка
//  ** ТипДокумента     - Строка
//  * ИдентификаторОтправителя - Строка
//  * ИдентификаторПолучателя - Строка
//  * ТребуетсяОтветнаяПодпись - Булево
//  * ТребуетсяИзвещениеОПолучении - Булево
//  * Номер                   - Строка
//  * Дата                    - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * Сумма                   - Число
//  * СопроводительнаяЗаписка - Строка
//  * ФайлыТитулов      - Массив Из Структура:
//  ** Основной - Структура:
//  *** ИмяФайла - Строка
//  *** Данные - Строка - двоичные данные в формате base64.
//  ** Дополнительный - Структура:
//  *** ИмяФайла - Строка
//  *** Данные - Строка - двоичные данные в формате base64.
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * ОписанияДокументовЭДО - Массив из Структура:
//    ** ЭтоВходящийЭДО - Булево
//    ** Идентификатор - Строка
//    ** Формат - Строка
//    ** ВидДокумента - Структура:
//       *** Наименование - Строка
//       *** ТипДокумента - Строка
//    ** Организация - Структура:
//       *** ИНН - Строка
//       *** КПП - Строка
//    ** Контрагент - Структура:
//       *** ИНН - Строка
//       *** КПП - Строка
//    ** Договор - Неопределено,Структура:
//       *** Наименование - Строка
//       *** Номер - Строка
//       *** Дата - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//    ** Дата - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//    ** Номер - Строка
//    ** Сумма - Число
//    ** СпособОбмена - Строка
//    ** ТипРегламента - Строка
//    ** ТребуетсяИзвещение - Булево
//    ** ТребуетсяПодтверждение - Булево
//    ** ИдентификаторОрганизации - Строка
//    ** ИдентификаторКонтрагента - Строка
//    ** ИдентификаторДокументооборота - Строка
//    ** ИмяСостояния - Строка
//    ** СостояниеДополнение - Строка
//    ** ДатаИзмененияСостояния - Строка
//    ** КомментарийСостояния - Строка
//    ** ИдентификаторПакета - Строка
Функция СформироватьДокументыЭДОПоФайлам(ДанныеДокументовЭДО) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.СформироватьДокументыЭДОПоФайлам(ДанныеДокументовЭДО);
	
КонецФункции

// Возвращает сведения по переформированным документам ЭДО на основании файлов.
//
// Параметры:
//  ДанныеДокументовЭДО - Массив из Структура:
//  * Идентификатор     - Строка
//  * Отправитель       - Структура:
//  ** ИНН              - Строка
//  ** КПП              - Строка
//  * Получатель        - Структура:
//  ** ИНН              - Строка
//  ** КПП              - Строка
//  * ВидДокумента      - Структура:
//  ** Наименование     - Строка
//  ** ТипДокумента     - Строка
//  * ИдентификаторОтправителя - Строка
//  * ИдентификаторПолучателя - Строка
//  * ТребуетсяОтветнаяПодпись - Булево
//  * ТребуетсяИзвещениеОПолучении - Булево
//  * Номер                   - Строка
//  * Дата                    - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * Сумма                   - Число
//  * СопроводительнаяЗаписка - Строка
//  * ФайлыТитулов      - Массив Из Структура:
//  ** Основной - Структура:
//  *** ИмяФайла - Строка
//  *** Данные - Строка - двоичные данные в формате base64.
//  ** Дополнительный - Структура:
//  *** ИмяФайла - Строка
//  *** Данные - Строка - двоичные данные в формате base64.
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Массив из Строка
//  * ОписанияДокументовЭДО - Массив из Структура:
//    ** ЭтоВходящийЭДО - Булево
//    ** Идентификатор - Строка
//    ** Формат - Строка
//    ** ВидДокумента - Структура:
//       *** Наименование - Строка
//       *** ТипДокумента - Строка
//    ** Организация - Структура:
//       *** ИНН - Строка
//       *** КПП - Строка
//    ** Контрагент - Структура:
//       *** ИНН - Строка
//       *** КПП - Строка
//    ** Договор - Неопределено,Структура:
//       *** Наименование - Строка
//       *** Номер - Строка
//       *** Дата - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//    ** Дата - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//    ** Номер - Строка
//    ** Сумма - Число
//    ** СпособОбмена - Строка
//    ** ТипРегламента - Строка
//    ** ТребуетсяИзвещение - Булево
//    ** ТребуетсяПодтверждение - Булево
//    ** ИдентификаторОрганизации - Строка
//    ** ИдентификаторКонтрагента - Строка
//    ** ИдентификаторДокументооборота - Строка
//    ** ИмяСостояния - Строка
//    ** СостояниеДополнение - Строка
//    ** ДатаИзмененияСостояния - Строка
//    ** КомментарийСостояния - Строка
//    ** ИдентификаторПакета - Строка
Функция ПереформироватьДокументыЭДОПоФайлам(ДанныеДокументовЭДО) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ПереформироватьДокументыЭДОПоФайлам(ДанныеДокументовЭДО);
	
КонецФункции

// Возвращает данные для подписания документов ЭДО.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  ОтпечаткиСертификатов - Массив из Строка
// 
// Возвращаемое значение:
//  См. ЭлектронныеДокументыЭДОЦентрЭДО.ПодготовитьДанныеДляПодписанияДокументовЭДО
Функция ПодготовитьДанныеДляПодписанияДокументовЭДО(ИдентификаторыДокументовЭДО, ОтпечаткиСертификатов) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ПодготовитьДанныеДляПодписанияДокументовЭДО(
		ИдентификаторыДокументовЭДО, ОтпечаткиСертификатов);
	
КонецФункции

// Возвращает данные файлов электронных документов с заполненными подписантами и доверенностями.
//
// Параметры:
//  ДанныеДляЗаполненияПоСертификатам - Массив из Структура:
//  * ИдентификаторыДанных - Массив из Строка
//  * ОтпечатокСертификата - Строка
//  * НомерДоверенности - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * НаборДанных - Массив из Структура:
//  ** ИдентификаторДанных - Строка - идентификатор данных электронного документа в сервисе.
//  ** Данные - Строка - двоичные данные в формате base64.
//
Функция ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатам(ДанныеДляЗаполненияПоСертификатам) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатам(
		ДанныеДляЗаполненияПоСертификатам);
	
КонецФункции

// Возвращает результат добавления подписей к файлам электронных документов.
// 
// Параметры:
//  ПодписиФайлов - Массив из Структура:
//  * ИдентификаторДанных - Строка - идентификатор файла электронного документа.
//  * Подпись - Строка - данные подписи в формате base64.
//  * НомерДоверенности - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из См. НовоеСостояниеДокументаЭДОВФорматеСервиса
//  
Функция ДобавитьПодписиФайловДокументовЭДО(ПодписиФайлов) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ДобавитьПодписиФайловДокументовЭДО(ПодписиФайлов);
	
КонецФункции

// Возвращает результат отправки электронных документов по ЭДО.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  МаркерыАвторизации - см. ОтправитьКонтейнерыЭДО.МаркерыАвторизации
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из См. НовоеСостояниеДокументаЭДОВФорматеСервиса
//  * ЗашифрованныеМаркеры - Неопределено
//                         - Массив из Структура:
//                           ** ИдентификаторУчетнойЗаписиЭДО - Строка
//                           ** ОтпечатокСертификата - Строка
//                           ** Данные - Строка - двоичные данные в формате base64.
Функция ОтправитьДокументыЭДО(ИдентификаторыДокументовЭДО, МаркерыАвторизации = Неопределено) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ОтправитьДокументыЭДО(
		ИдентификаторыДокументовЭДО, МаркерыАвторизации);
	
КонецФункции

// Возвращает результат утверждения электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция УтвердитьДокументыЭДО(ИдентификаторыДокументовЭДО) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.УтвердитьДокументыЭДО(ИдентификаторыДокументовЭДО);
	
КонецФункции

// Возвращает результат формирования ответных титулов по электронным документам.
// 
// Параметры:
//  ДанныеОтветныхТитулов - Массив из Структура:
//  * ИдентификаторДокумента - Строка
//  * УчетныеДанные - Структура - данные прикладного решения:
//  ** Данные - Структура - учетные данные для конвертации.
//  ** Формат - Строка - формат учетных данных.
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
Функция СформироватьОтветныеТитулыДокументовЭДО(ДанныеОтветныхТитулов) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.СформироватьОтветныеТитулыДокументовЭДО(ДанныеОтветныхТитулов);
	
КонецФункции

// Возвращает описания отправленных документов.
// 
// Параметры:
//  МаркерыАвторизации - Массив из Структура:
//  * ИдентификаторУчетнойЗаписиЭДО - Строка
//  * ОтпечатокСертификата - Строка
//  * Данные - Строка - двоичные данные в формате base64.
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * Отправлено - Число
//  
Функция ОтправитьКонтейнерыЭДО(МаркерыАвторизации) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ОтправитьКонтейнерыЭДО(МаркерыАвторизации);
	
КонецФункции

// Возвращает результат отклонения подписания электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  Комментарий - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция ОтклонитьПодписаниеДокументовЭДО(ИдентификаторыДокументовЭДО, Комментарий) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ОтклонитьПодписаниеДокументовЭДО(ИдентификаторыДокументовЭДО, Комментарий);
	
КонецФункции

// Возвращает результат отклонения электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  Комментарий - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция ОтклонитьДокументыЭДО(ИдентификаторыДокументовЭДО, Комментарий) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ОтклонитьДокументыЭДО(ИдентификаторыДокументовЭДО, Комментарий);
	
КонецФункции

// Возвращает результат аннулирования электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  Комментарий - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция АннулироватьДокументыЭДО(ИдентификаторыДокументовЭДО, Комментарий) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.АннулироватьДокументыЭДО(ИдентификаторыДокументовЭДО, Комментарий);
	
КонецФункции

// Возвращает результат принятия аннулирования электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция ПринятьАннулированиеДокументовЭДО(ИдентификаторыДокументовЭДО) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ПринятьАннулированиеДокументовЭДО(ИдентификаторыДокументовЭДО);
	
КонецФункции

// Возвращает результат отклонения аннулирования электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  Комментарий - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция ОтклонитьАннулированиеДокументовЭДО(ИдентификаторыДокументовЭДО, Комментарий = "") Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ОтклонитьАннулированиеДокументовЭДО(
		ИдентификаторыДокументовЭДО, Комментарий);
	
КонецФункции

// Возвращает результат принудительного закрытия электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  Комментарий - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция ЗакрытьДокументыЭДО(ИдентификаторыДокументовЭДО, Комментарий = "") Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ЗакрытьДокументыЭДО(ИдентификаторыДокументовЭДО, Комментарий);
	
КонецФункции

// Возвращает результат возврата в работу электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция ВернутьВРаботуДокументыЭДО(ИдентификаторыДокументовЭДО) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ВернутьВРаботуДокументыЭДО(ИдентификаторыДокументовЭДО);
	
КонецФункции

// Возвращает результат отправки в архив электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция ОтправитьВАрхивДокументыЭДО(ИдентификаторыДокументовЭДО) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ОтправитьВАрхивДокументыЭДО(ИдентификаторыДокументовЭДО);
	
КонецФункции

// Возвращает результат формирования извещений электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
Функция СформироватьИзвещенияДокументовЭДО(ИдентификаторыДокументовЭДО) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.СформироватьИзвещенияДокументовЭДО(ИдентификаторыДокументовЭДО);
	
КонецФункции

// Возвращает данные для подписания извещений электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  ОтпечаткиСертификатов - Массив из Строка
// 
// Возвращаемое значение:
//  См. ПодготовитьДанныеДляПодписанияДокументовЭДО
Функция ПодготовитьДанныеДляПодписанияИзвещенийДокументовЭДО(ИдентификаторыДокументовЭДО, ОтпечаткиСертификатов) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ПодготовитьДанныеДляПодписанияИзвещенийДокументовЭДО(
		ИдентификаторыДокументовЭДО, ОтпечаткиСертификатов);
	
КонецФункции

// Возвращает результат отправки извещений электронных документов по ЭДО.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  МаркерыАвторизации - см. ОтправитьКонтейнерыЭДО.МаркерыАвторизации
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из См. НовоеСостояниеДокументаЭДОВФорматеСервиса
//  * ЗашифрованныеМаркеры - Неопределено
//                         - Массив из Структура:
//                           ** ИдентификаторУчетнойЗаписиЭДО - Строка
//                           ** ОтпечатокСертификата - Строка
//                           ** Данные - Строка - двоичные данные в формате base64.
//
Функция ОтправитьИзвещенияДокументовЭДО(ИдентификаторыДокументовЭДО, МаркерыАвторизации = Неопределено) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ОтправитьИзвещенияДокументовЭДО(
		ИдентификаторыДокументовЭДО, МаркерыАвторизации);
	
КонецФункции

#КонецОбласти // ДействияСДокументамиЭДО

#Область ДанныеДокументовЭДО

// Возвращает учетные данные основных титулов электронного документа.
// 
// Параметры:
//  ИдентификаторДокумента - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * ДанныеОтправителя - Неопределено,Структура:
//    ** Данные - См. ЭлектронныеДокументыЭДОЦентрЭДО.ДеревоУчетныхДанныхВСтруктуру
//    ** Формат - Строка - формат учетных данных.
//  * ДанныеПолучателя - Неопределено,Структура:
//    ** Данные - См. ЭлектронныеДокументыЭДОЦентрЭДО.ДеревоУчетныхДанныхВСтруктуру
//    ** Формат - Строка - формат учетных данных.
Функция УчетныеДанныеДокумента(ИдентификаторДокумента) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.УчетныеДанныеДокумента(ИдентификаторДокумента);
	
КонецФункции

// Возвращает информацию о номенклатуре из файлов основных титулов электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументов - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ИдентификаторДокумента - Строка
//  * СведенияОНоменклатуре - Массив из Структура:
//  ** ИД - Строка
//  ** Штрихкод - Строка
//  ** Наименование - Строка
//  ** НаименованиеХарактеристики - Строка
//  ** КодТовара - Строка
//  ** Артикул - Строка
//  ** БазоваяЕдиницаКод - Строка
//  ** БазоваяЕдиницаНаименование - Строка
//  ** БазоваяЕдиницаНаименованиеПолное - Строка
//  ** БазоваяЕдиницаМеждународноеСокращение - Строка
//  ** БазоваяЕдиницаНаименованиеКраткое - Строка
//  ** СтавкаНДС - Строка
//  ** Описание - Строка
//  ** ИсторияИдентификаторов - Массив из см. СопоставлениеНоменклатурыКонтрагентов.ИдентификаторТовараПоДаннымНоменклатуры
//  ** ТипНоменклатурыФНС - Строка
//  ** КодПоКТРУ - Строка
//  ** КодТНВЭД - Строка
//  ** СтранаПроисхожденияКод - Строка
//  ** ПрослеживаемыйТовар - Булево
//  ** МаркируемыйТовар - Булево
//
Функция СведенияНоменклатурыДокументовЭДО(ИдентификаторыДокументов) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.СведенияНоменклатурыДокументовЭДО(ИдентификаторыДокументов);
	
КонецФункции

// Возвращает учетные данные из файлов основных титулов электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументов - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ИдентификаторДокумента - Строка
//  * УчетныеДанные - Структура - данные прикладного решения:
//  ** Данные - См. ЭлектронныеДокументыЭДОЦентрЭДО.ДеревоУчетныхДанныхВСтруктуру
//  ** Формат - Строка - формат учетных данных.
//
Функция УчетныеДанныеОтправителейДокументовЭДО(ИдентификаторыДокументов) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.УчетныеДанныеОтправителейДокументовЭДО(ИдентификаторыДокументов);
	
КонецФункции

// Возвращает сведения по документам ЭДО.
//
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  См. ЭлектронныеДокументыЭДОЦентрЭДО.ДанныеСинхронизацииДокументовЭДО
Функция ДанныеСинхронизацииДокументовЭДО(ИдентификаторыДокументовЭДО) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ДанныеСинхронизацииДокументовЭДО(ИдентификаторыДокументовЭДО);
	
КонецФункции

// Возвращает порцию сведений по документам ЭДО.
// 
// Параметры:
//  МеткиВремениПоИдентификаторамЭДО - Массив из Структура:
//  * МеткаВремени - Число
//  * ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * ЭтоПоследний - Булево
//  * НаборДанных - см. ДанныеСинхронизацииДокументовЭДО
Функция ПорцияДанныхСинхронизацииДокументовЭДОПоМеткамВремени(МеткиВремениПоИдентификаторамЭДО) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ПорцияДанныхСинхронизацииДокументовЭДОПоМеткамВремени(
		МеткиВремениПоИдентификаторамЭДО);
	
КонецФункции

// Возвращает порцию сведений по документам ЭДО.
// 
// Параметры:
//  МеткиВремениПоИдентификаторамЭДО - Массив из Структура:
//  * МеткаВремени - Число
//  * ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * ЭтоПоследний - Булево
//  * НаборДанных - Массив из Структура:
//    ** ИдентификаторЭДО - Строка
//    ** ИдентификаторОбъекта - Строка
//    ** МеткаВремени - Число
Функция ПорцияМетокВремениПолныхДанныхДокументовЭДО(МеткиВремениПоИдентификаторамЭДО) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ПорцияМетокВремениПолныхДанныхДокументовЭДО(
		МеткиВремениПоИдентификаторамЭДО);
	
КонецФункции

// Возвращает сведения по документам ЭДО.
//
// Параметры:
//  ИдентификаторДокументаЭДО - Строка
//  МеткаВремени - Число
// 
// Возвращаемое значение:
//  Структура:
//  * МеткаВремени - Число
//  * Сообщения - Неопределено,Массив из Структура:
//    ** Идентификатор - Строка
//    ** ИдентификаторДокумента - Строка
//    ** ИдентификаторОсновногоФайла - Строка
//    ** Направление - Строка
//    ** Тип - Строка
//    ** ТипЭлементаРегламента - Строка
//    ** Статус - Строка
//    ** ДатаИзмененияСтатуса - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//    ** СопроводительнаяЗаписка - Строка
//  * ФайлыСообщений - Неопределено,Массив из Структура:
//    ** Идентификатор - Строка
//    ** ИдентификаторСообщения - Строка
//    ** Имя - Строка
//    ** Данные - Строка - Двоичные данные в формате base64.
//  * ПодписиФайлов - Неопределено,Массив из Структура:
//    ** Идентификатор - Строка
//    ** ИдентификаторФайла - Строка
//    ** ПорядковыйНомер - Число
//    ** Подпись - Строка - Двоичные данные в формате base64.
//    ** ИмяФайлаПодписи - Строка
//    ** Сертификат - Строка - Двоичные данные в формате base64.
//    ** ДатаПодписи - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//    ** ПодписьВерна - Булево
//    ** ДатаПроверкиПодписи - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//    ** ТипПодписи - Строка
//    ** СрокДействияПоследнейМеткиВремени - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//    ** ПропуститьПриПродлении - Булево
//  * ПроверкиПодписейПоМЧД - Неопределено,Массив из Структура:
//    ** ИдентификаторФайла - Строка
//    ** ХешПодписи - Строка
//    ** Доверенность - Неопределено,Структура:
//       *** Номер - Строка
//       *** ДанныеФайла - Строка
//       *** ДанныеПодписи - Строка
//       *** СтатусВРеестреФНС - Строка
//    ** ПроверкаВыполнена - Булево
//    ** ДатаПроверки - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//    ** ПодписьВерна - Булево
//    ** ПротоколПроверки - См. МашиночитаемыеДоверенностиКлиентСервер.НовыйПротоколПроверкиМЧД
//  * События - Неопределено,Массив из Структура:
//    ** Тип - Строка
//    ** Параметры - Неопределено
//                 - Структура
Функция ДанныеПолнойСинхронизацииДокументаЭДО(ИдентификаторДокументаЭДО, МеткаВремени = 0) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ДанныеПолнойСинхронизацииДокументаЭДО(
		ИдентификаторДокументаЭДО, МеткаВремени);
	
КонецФункции

#КонецОбласти // ДанныеДокументовЭДО

#Область ПакетыДокументовЭДО

// Возвращает результат создания пакета электронных документов.
//
// Параметры:
//  ИдентификаторыДокументов - Массив Из Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * Ошибки - Массив Из Строка
//  * ИдентификаторПакета - Строка
Функция СоздатьПакетДокументовЭДО(ИдентификаторыДокументов) Экспорт
	
	Возврат ПакетыДокументовЭДОЦентрЭДО.СоздатьПакетДокументовЭДО(ИдентификаторыДокументов);
	
КонецФункции

// Возвращает результат добавления электронных документов в пакет.
//
// Параметры:
//  ИдентификаторПакета - Строка
//  ИдентификаторыДокументов - Массив Из Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * Ошибки - Массив Из Строка
Функция ДобавитьДокументыЭДОВПакет(ИдентификаторПакета, ИдентификаторыДокументов) Экспорт
	
	Возврат ПакетыДокументовЭДОЦентрЭДО.ДобавитьДокументыЭДОВПакет(ИдентификаторПакета, ИдентификаторыДокументов);
	
КонецФункции

// Возвращает результат удаления электронного документа из пакета.
//
// Параметры:
//  ИдентификаторПакета - Строка
//  ИдентификаторДокумента - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * Ошибки - Массив Из Строка
Функция УдалитьДокументЭДОИзПакета(ИдентификаторПакета, ИдентификаторДокумента) Экспорт
	
	Возврат ПакетыДокументовЭДОЦентрЭДО.УдалитьДокументЭДОИзПакета(ИдентификаторПакета, ИдентификаторДокумента);
	
КонецФункции

// Возвращает идентификаторы документов ЭДО, входящие в состав пакета.
// 
// Параметры:
//  ИдентификаторПакетаСтрокой - Строка
// 
// Возвращаемое значение:
//  Массив из Строка
Функция СоставПакетаДокументовЭДО(ИдентификаторПакетаСтрокой) Экспорт
	
	Возврат ПакетыДокументовЭДОЦентрЭДО.СоставПакетаДокументовЭДО(ИдентификаторПакетаСтрокой);
	
КонецФункции

#КонецОбласти // ПакетыДокументовЭДО

#Область ВизуализацияДокументовЭДО

// Возвращает визуализацию электронного документа.
//
// Параметры:
//  ИдентификаторДокумента - Строка
//  ПараметрыВизуализации - Структура:
//  * ВыводитьДопДанные - Булево
//  * ВыводитьБанковскиеРеквизиты - Булево
//  * ВыводитьКопияВерна - Булево
//  * ПодсказкаQRКода - Строка
//  * ПубличнаяСсылкаQRКода - Строка
//  ТребуетсяОбновитьКэш - Булево - Признак необходимости обновить кэш в облаке
// 
// Возвращаемое значение:
//  - Неопределено
//  - См. ВизуализацияЭДОЦентрЭДО.ВизуализацияДокументаЭДОВФорматеСервиса
Функция ВизуализацияДокументаЭДО(ИдентификаторДокумента, ПараметрыВизуализации = Неопределено,
	ТребуетсяОбновитьКэш = Ложь) Экспорт
	
	Возврат ВизуализацияЭДОЦентрЭДО.ВизуализацияДокументаЭДО(ИдентификаторДокумента, ПараметрыВизуализации,
		ТребуетсяОбновитьКэш);

КонецФункции

// Возвращает представление xml файлов электронного документа.
// 
// Параметры:
//  ФайлыДокумента - Массив из Структура:
//  * ИмяФайла - Строка
//  * Данные - Строка - двоичные данные в формате base64.
//  ВидДокумента - Структура:
//  * Наименование - Строка
//  * ТипДокумента - Строка
//  Формат - Строка
//  ПараметрыВизуализации - Структура:
//  * ВыводитьДопДанные - Булево
//  * ВыводитьБанковскиеРеквизиты - Булево
//  * ВыводитьКопияВерна - Булево
//  * ПодсказкаQRКода - Строка
//  * ПубличнаяСсылкаQRКода - Строка
// 
// Возвращаемое значение:
//  - Неопределено
//  - См. ВизуализацияЭДОЦентрЭДО.ВизуализацияДокументаЭДОВФорматеСервиса
//  
Функция ВизуализацияФайловДокументаЭДО(ФайлыДокумента, ВидДокумента, Формат, ПараметрыВизуализации = Неопределено) Экспорт
	
	Возврат ВизуализацияЭДОЦентрЭДО.ВизуализацияФайловДокументаЭДО(ФайлыДокумента, ВидДокумента, Формат,
		ПараметрыВизуализации);

КонецФункции

#КонецОбласти // ВизуализацияДокументовЭДО

#Область ИнтерфейсДокументовЭДО

#Область ПросмотрФайлаЭлектронногоДокумента

// Возвращает данные файла информации отправителя.
//
// Параметры:
//  ИдентификаторДокументаЭДО - Строка
// 
// Возвращаемое значение:
// - Неопределено,Структура:
//   * Данные - Строка - двоичные данные в формате base64.
//   * ИмяФайла - Строка
//   * ПомеченНаУдаление - Булево
Функция ДанныеФайлаИнформацииОтправителяДокумента(ИдентификаторДокументаЭДО) Экспорт
	
	Возврат ИнтерфейсДокументовЭДОЦентрЭДО.ДанныеФайлаИнформацииОтправителяДокумента(ИдентификаторДокументаЭДО);
	
КонецФункции

#КонецОбласти // ПросмотрФайлаЭлектронногоДокумента

#Область ПросмотрДокумента

// Возвращает сформированные файлы с визуализацией документа ЭДО.
//
// Параметры:
//  ДанныеДокументаЭДО - Структура:
//  * Идентификатор     - Строка
//  * Отправитель       - Структура:
//  ** ИНН              - Строка
//  ** КПП              - Строка
//  * Получатель        - Структура:
//  ** ИНН              - Строка
//  ** КПП              - Строка
//  * Договор           - Структура:
//  ** Наименование     - Строка
//  ** Номер            - Строка
//  ** Дата             - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ВидДокумента      - Структура:
//  ** Наименование     - Строка
//  ** ТипДокумента     - Строка
//  * ИдентификаторОтправителя - Строка
//  * ИдентификаторПолучателя - Строка
//  * Формат            - Строка - формат, в который конвертируются учетные данные.
//  * УчетныеДанные     - Структура:
//  ** Данные           - Структура - учетные данные для конвертации.
//  ** Формат           - Строка - формат учетных данных.
//  ПараметрыВизуализации - Структура:
//  * ВыводитьДопДанные - Булево
//  * ВыводитьБанковскиеРеквизиты - Булево
//  * ВыводитьКопияВерна - Булево
//  * ПодсказкаQRКода - Строка
//  * ПубличнаяСсылкаQRКода - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * ФайлыДокумента - Структура:
//  ** Идентификатор - Строка
//  ** Ошибка - Неопределено - при формировании без ошибок.
//            - Строка
//  ** ОсновнойФайл - Неопределено - при наличии ошибок.
//                  - Структура:
//                    *** ИмяФайла - Строка
//                    *** Данные - Строка - двоичные данные в формате base64.
//  ** ДополнительныйФайл - Неопределено - при наличии ошибок или отсутствии соответствующих учетных данных.
//                        - Структура:
//                          *** ИмяФайла - Строка
//                          *** Данные - Строка - двоичные данные в формате base64.
//  * Визуализация - Неопределено
//                 - См. ВизуализацияФайловДокументаЭДО
//  * ДанныеИзСодержанияФайла - Неопределено,Структура:
//    ** НомерДокумента - Строка 
//    ** ДатаДокумента - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//    ** СуммаДокумента - Число
//    ** ТипРегламента - Строка
//    ** СуммаНДСДокумента - Число
//    ** СтавкаНДСДокумента - Строка
//    ** ВалютаДокумента - Строка
//
Функция СформироватьФайлыИВизуализациюДокументаЭДО(ДанныеДокументаЭДО, ПараметрыВизуализации) Экспорт
	
	Возврат ИнтерфейсДокументовЭДОЦентрЭДО.СформироватьФайлыИВизуализациюДокументаЭДО(
		ДанныеДокументаЭДО, ПараметрыВизуализации);
	
КонецФункции

// Возвращает двоичные данные проштампованного файла информации отправителя документа ЭДО.
// 
// Параметры:
//  ИдентификаторДокументаЭДО - Строка
// 
// Возвращаемое значение:
//  - Неопределено
//  - См. ВизуализацияЭДОЦентрЭДО.ПредставлениеФайлаДокументаЭДОВФорматеСервиса
Функция ПредставлениеФайлаДокументаЭДО(ИдентификаторДокументаЭДО) Экспорт
	
	Возврат ИнтерфейсДокументовЭДОЦентрЭДО.ПредставлениеФайлаДокументаЭДО(
		ИдентификаторДокументаЭДО);
	
КонецФункции

#КонецОбласти // ПросмотрДокумента

#Область ПроверкаПодписей

// Возвращает результат проверок подписей документов ЭДО.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ИдентификаторДокумента - Строка
//  * Ошибка - Неопределено,Строка
Функция ПроверитьПодписиДокументовЭДО(ИдентификаторыДокументовЭДО) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОЦентрЭДО.ПроверитьПодписиДокументовЭДО(ИдентификаторыДокументовЭДО);
	
КонецФункции

#КонецОбласти // ПроверкаПодписей

#КонецОбласти // ИнтерфейсДокументовЭДО

#КонецОбласти // ЭлектронныеДокументыЭДО

#Область МашиночитаемыеДоверенности

// Загружает доверенность из реестра ФНС по номеру и ИНН доверителя.
// 
// Параметры:
//  НомерДоверенности - Строка
//  ИННДоверителя - Строка
//  ИННПредставителя - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибка - Неопределено
//           - Строка
//  * ОписаниеДоверенности - Неопределено
//                         - Структура:
//  ** НомерДоверенности - Строка
//  ** ХэшДанных - Строка
//  ** СтатусВРеестре - Строка
Функция ЗагрузитьДоверенностьИзРеестраФНС(НомерДоверенности, ИННДоверителя, ИННПредставителя) Экспорт
	
	Возврат МашиночитаемыеДоверенностиЦентрЭДО.ЗагрузитьДоверенностьИзРеестраФНС(
		НомерДоверенности, ИННДоверителя, ИННПредставителя);
	
КонецФункции

// Загрузить доверенность из файла.
// 
// Параметры:
//  ДанныеДоверенности - Структура:
//  * Номер - Строка
//  * ДанныеФайла - Строка - двоичные данные в формате base64.
//  * ДанныеПодписи - Строка - двоичные данные в формате base64.
//  * СтатусВРеестреФНС - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * Ошибка - Неопределено,Строка
Функция ЗагрузитьДоверенность(ДанныеДоверенности) Экспорт
	
	Возврат МашиночитаемыеДоверенностиЦентрЭДО.ЗагрузитьДоверенность(ДанныеДоверенности);
	
КонецФункции

#КонецОбласти // МашиночитаемыеДоверенности

#Область АвтоматическоеПолучениеЭДО

// Запускает получение приглашений и документов из сервиса ЭДО.
//
// Параметры:
//  МаркерыАвторизации - Неопределено,Массив из Структура:
//  * ИдентификаторУчетнойЗаписиЭДО - Строка
//  * ОтпечатокСертификата - Строка
//  * Данные - Строка - двоичные данные в формате base64.
// 
// Возвращаемое значение:
//  Структура:
//  * ДатаПоследнегоПолучения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
Функция ПолучитьЭДОЧерезИнтервал(МаркерыАвторизации = Неопределено) Экспорт
	
	Возврат АвтоматическоеПолучениеЭДОЦентрЭДО.ПолучитьЧерезИнтервал(МаркерыАвторизации);
	
КонецФункции

#КонецОбласти

#КонецОбласти