// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область РегистрацияДанных

// Параметры:
//  ИдентификаторЭДО - См. РегистрСведений.МеткиВремениДанныхЭДО.ИдентификаторЭДО
//  ТипДанных - См. РегистрСведений.МеткиВремениДанныхЭДО.ТипДанных
//  ИдентификаторОбъекта - См. РегистрСведений.МеткиВремениДанныхЭДО.ИдентификаторОбъекта
Процедура Зафиксировать(ИдентификаторЭДО, ТипДанных, ИдентификаторОбъекта) Экспорт
	
	РегистрыСведений.МеткиВремениДанныхЭДО.Зафиксировать(
		ИдентификаторЭДО, ТипДанных, ИдентификаторОбъекта);
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеДанных

// Параметры:
//  ОписаниеЗапроса - Структура:
//  * Параметры - Структура
//  * Тексты - Массив из Строка
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  МеткиВремениПоИдентификаторамЭДО - Массив из Структура:
//  * МеткаВремени - Число
//  * ИдентификаторЭДО - Строка
//  Порция - Число
//  ПоместитьВоВременнуюТаблицу - Булево 
Процедура ДобавитьТекстЗапросаИдентификаторовДанныхПоМеткамВремени(ОписаниеЗапроса, ТипДанных,
	МеткиВремениПоИдентификаторамЭДО, Порция = 1000, ПоместитьВоВременнуюТаблицу = Истина) Экспорт
	
	ПараметрыЗапроса = ОписаниеЗапроса.Параметры;
	ПараметрыЗапроса.Вставить("ТипДанных", ТипДанных);
	
	ШаблонПодзапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	МеткиВремениДанныхЭДО.ИдентификаторЭДО КАК ИдентификаторЭДО,
		|	МеткиВремениДанныхЭДО.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
		|	МеткиВремениДанныхЭДО.МеткаВремени КАК МеткаВремени
		|ИЗ
		|	РегистрСведений.МеткиВремениДанныхЭДО КАК МеткиВремениДанныхЭДО
		|ГДЕ
		|	МеткиВремениДанныхЭДО.ИдентификаторЭДО = &ИдентификаторЭДО
		|	И МеткиВремениДанныхЭДО.ТипДанных = &ТипДанных
		|	И МеткиВремениДанныхЭДО.МеткаВремени > &МеткаВремени";
		
	ШаблонДляУпорядочиванияПодзапроса = "
		|УПОРЯДОЧИТЬ ПО
		|	МеткаВремени";
	
	ШаблонПараметраИдентификаторЭДО = "&ИдентификаторЭДО";
	ШаблонПараметраМеткаВремени = "&МеткаВремени";
	
	ТекстыПодзапроса = Новый Массив; // Массив из Строка
	Счетчик = 0;
	КоличествоМеток = МеткиВремениПоИдентификаторамЭДО.Количество();
	
	Для Каждого МеткаВремениПоИдентификаторуЭДО Из МеткиВремениПоИдентификаторамЭДО Цикл
		
		Счетчик = Счетчик + 1;
		
		ПараметрИдентификаторЭДО = ШаблонПараметраИдентификаторЭДО + Счетчик;
		ТекстПодзапроса = СтрЗаменить(ШаблонПодзапроса, ШаблонПараметраИдентификаторЭДО, ПараметрИдентификаторЭДО);
		ПараметрыЗапроса.Вставить(Сред(ПараметрИдентификаторЭДО, 2), МеткаВремениПоИдентификаторуЭДО.ИдентификаторЭДО);
		
		ПараметрМеткаВремени = ШаблонПараметраМеткаВремени + Счетчик;
		ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, ШаблонПараметраМеткаВремени, ПараметрМеткаВремени);
		ПараметрыЗапроса.Вставить(Сред(ПараметрМеткаВремени, 2), МеткаВремениПоИдентификаторуЭДО.МеткаВремени);
		
		Если Счетчик = КоличествоМеток Тогда
			ТекстПодзапроса = СтрШаблон("%1
				|%2", ТекстПодзапроса, ШаблонДляУпорядочиванияПодзапроса);
		КонецЕсли;
		
		ТекстыПодзапроса.Добавить(ТекстПодзапроса);
		
	КонецЦикла;
	
	ТекстПодзапроса = СтрСоединить(ТекстыПодзапроса, ОбщегоНазначения.ТекстОбъединитьВсе());
	
	Если ПоместитьВоВременнуюТаблицу Тогда
		ШаблонЗапроса = 
			"ВЫБРАТЬ ПЕРВЫЕ 1000
			|	Подзапрос.ИдентификаторЭДО,
			|	Подзапрос.ИдентификаторОбъекта,
			|	Подзапрос.МеткаВремени
			|ПОМЕСТИТЬ ИдентификаторыДанныхПоМеткамВремени
			|ИЗ
			|	&Подзапрос КАК Подзапрос
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ИдентификаторОбъекта";
	Иначе
		ШаблонЗапроса = 
			"ВЫБРАТЬ ПЕРВЫЕ 1000
			|	Подзапрос.ИдентификаторЭДО,
			|	Подзапрос.ИдентификаторОбъекта,
			|	Подзапрос.МеткаВремени
			|ИЗ
			|	&Подзапрос КАК Подзапрос";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "&Подзапрос", СтрШаблон("(%1)",ТекстПодзапроса));
	
	Если Порция <> 1000 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 1000", СтрШаблон("ПЕРВЫЕ %1", Формат(Порция, "ЧГ=0")));
	КонецЕсли;
	
	ОписаниеЗапроса.Тексты.Добавить(ТекстЗапроса);
	
КонецПроцедуры

// Параметры:
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  МеткиВремениПоИдентификаторамЭДО - Массив из Структура:
//  * МеткаВремени - Число
//  * ИдентификаторЭДО - Строка
//  Порция - Число
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  * ИдентификаторЭДО - Строка
//  * ИдентификаторОбъекта - Строка
//  * МеткаВремени - Число
Функция ВыборкаИдентификаторовДанныхПоМеткамВремени(ТипДанных, МеткиВремениПоИдентификаторамЭДО, Порция) Экспорт
	
	ОписаниеЗапроса = Новый Структура("Параметры, Тексты", Новый Структура, Новый Массив);
	ДобавитьТекстЗапросаИдентификаторовДанныхПоМеткамВремени(
		ОписаниеЗапроса, ТипДанных, МеткиВремениПоИдентификаторамЭДО, Порция, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ОписаниеЗапроса.Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	Для Каждого Параметр Из ОписаниеЗапроса.Параметры Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Параметры:
//  ИдентификаторДокументаЭДО - Строка
//  МеткаВремени - Число
// 
// Возвращаемое значение:
//  Структура:
//  * Сообщения - Массив из ДокументСсылка.СообщениеЭДО
//  * ФайлыСообщений - Массив из СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  * ПодписиФайлов - ТаблицаЗначений:
//    ** ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//    ** ПорядковыйНомер - Число
//  * ПроверкиПодписейПоМЧД - ТаблицаЗначений:
//    ** ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//    ** ХешПодписи - Строка
//  * События - Массив из ПеречислениеСсылка.ТипыСобытийДокументаЦентраЭДО
Функция КлючиДанныхДокументаПоТипам(ИдентификаторДокументаЭДО, МеткаВремени) Экспорт
	
	Возврат РегистрыСведений.МеткиВремениДанныхДокументовЭДО.КлючиДанныхДокументаПоТипам(
		ИдентификаторДокументаЭДО, МеткаВремени);
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - Строка
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  ИдентификаторОбъекта - Строка
// 
// Возвращаемое значение:
//  Число
Функция МеткаВремениОбъекта(ИдентификаторЭДО, ТипДанных, ИдентификаторОбъекта) Экспорт
	
	Возврат РегистрыСведений.МеткиВремениДанныхЭДО.МеткаВремениОбъекта(
		ИдентификаторЭДО, ТипДанных, ИдентификаторОбъекта);
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - Строка
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  ИдентификаторыОбъектов - Массив из Строка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка - идентификатор объекта.
//  * Значение - Число - метка времени.
Функция МеткиВремениОбъектов(ИдентификаторЭДО, ТипДанных, ИдентификаторыОбъектов) Экспорт
	
	Возврат РегистрыСведений.МеткиВремениДанныхЭДО.МеткиВремениОбъектов(
		ИдентификаторЭДО, ТипДанных, ИдентификаторыОбъектов);
	
КонецФункции

// Параметры:
//  ИдентификаторыЭДО - Массив из Строка
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ИдентификаторЭДО - Строка
//  * МеткаВремени - Неопределено,Число
Функция ПоследниеМеткиВремениОбъектов(ИдентификаторыЭДО, ТипДанных) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПоследниеМеткиВремени = Новый Массив; // См. ПоследниеМеткиВремениОбъектов
	
	Для Каждого ИдентификаторЭДО Из ИдентификаторыЭДО Цикл
		МеткаВремени = РегистрыСведений.МеткиВремениДанныхЭДО.ПоследняяМеткаВремениОбъектов(
			ИдентификаторЭДО, ТипДанных);
		ПоследняяМеткаВремени = Новый Структура("ИдентификаторЭДО, МеткаВремени", ИдентификаторЭДО, МеткаВремени);
		ПоследниеМеткиВремени.Добавить(ПоследняяМеткаВремени);
	КонецЦикла;
	
	Возврат ПоследниеМеткиВремени;
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - Строка
//  ТипДанных - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
//  ИдентификаторыОбъектов - Массив из Строка
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  * ИдентификаторОбъекта - Строка
//  * МеткаВремени - Число
Функция ВыбратьМеткиВремениОбъектов(ИдентификаторЭДО, ТипДанных, ИдентификаторыОбъектов) Экспорт
	
	Возврат РегистрыСведений.МеткиВремениДанныхЭДО.ВыбратьМеткиВремениОбъектов(
		ИдентификаторЭДО, ТипДанных, ИдентификаторыОбъектов);
	
КонецФункции

// Параметры:
//  ИдентификаторДокументаЭДО - Строка
// 
// Возвращаемое значение:
//  Число
Функция МеткаВремениДанныхДокументаЭДО(ИдентификаторДокументаЭДО) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МеткиВремениДанныхЭДО.МеткаВремени
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МеткиВремениДанныхЭДО КАК МеткиВремениДанныхЭДО
		|		ПО ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации = МеткиВремениДанныхЭДО.ИдентификаторЭДО
		|		И МеткиВремениДанныхЭДО.ТипДанных = ЗНАЧЕНИЕ(Перечисление.ТипыСинхронизацииСЦентромЭДО.ДанныеДокументовЭДО)
		|		И ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента = МеткиВремениДанныхЭДО.ИдентификаторОбъекта
		|ГДЕ
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента = &ИдентификаторДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МеткиВремениДанныхЭДО.МеткаВремени
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МеткиВремениДанныхЭДО КАК МеткиВремениДанныхЭДО
		|		ПО ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации = МеткиВремениДанныхЭДО.ИдентификаторЭДО
		|		И МеткиВремениДанныхЭДО.ТипДанных = ЗНАЧЕНИЕ(Перечисление.ТипыСинхронизацииСЦентромЭДО.ДанныеДокументовЭДО)
		|		И ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента = МеткиВремениДанныхЭДО.ИдентификаторОбъекта
		|ГДЕ
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента = &ИдентификаторДокумента";
	
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокументаЭДО);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МеткаВремени;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//  ТипСобытия - ПеречислениеСсылка.ТипыСобытийДокументаЦентраЭДО
Процедура ЗафиксироватьСобытиеДокументаЭДО(ЭлектронныйДокумент, ТипСобытия) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьРежимЦентрЭДО") Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.МеткиВремениДанныхДокументовЭДО.ЗафиксироватьПоТипуСобытияДокументаЭДО(
		ЭлектронныйДокумент, ТипСобытия);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиПодписокНаСобытия

// Обработчик подписки на событие: см. ПодпискаНаСобытие.МеткиВремениДанныхЭДОПриЗаписиДокумента
//
// Параметры:
//  Источник - ДокументОбъект.ЭлектронныйДокументВходящийЭДО,ДокументОбъект.ЭлектронныйДокументИсходящийЭДО
//  Отказ - Булево
Процедура МеткиВремениДанныхЭДОПриЗаписиДокумента(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьРежимЦентрЭДО") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСеанса.РежимЗагрузкиДанныхВЦентрЭДО Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства = Источник.ДополнительныеСвойства;
	ЭтоНовый = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ЭтоНовый", Ложь);
	Если ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.МеткиВремениДанныхЭДО.ЗафиксироватьПоДокументу(Источник);
	
КонецПроцедуры

// Обработчик подписки на событие: см. ПодпискаНаСобытие.МеткиВремениДанныхЭДОПередЗаписьюНабораЗаписей
//
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ПроверкиЭлектронныхПодписейЭДО,РегистрСведенийНаборЗаписей.СостоянияДокументовЭДО,РегистрСведенийНаборЗаписей.УчетныеЗаписиЭДО,РегистрСведенийНаборЗаписей.СоставПакетовДокументовЭДО,РегистрСведенийНаборЗаписей.ПриглашенияКОбменуЭлектроннымиДокументами
//  Отказ - Булево
//  Замещение - Булево
Процедура МеткиВремениДанныхЭДОПередЗаписьюНабораЗаписей(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьРежимЦентрЭДО") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСеанса.РежимЗагрузкиДанныхВЦентрЭДО Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.МеткиВремениДанныхЭДО.ЗафиксироватьПоНаборуЗаписей(Источник, Замещение);
	
КонецПроцедуры

// Обработчик подписки на событие: см. ПодпискаНаСобытие.МеткиВремениДанныхДокументовЭДОПриЗаписиОбъекта
// 
// Параметры:
//  Источник - ДокументОбъект.СообщениеЭДО,СправочникОбъект.СообщениеЭДОПрисоединенныеФайлы
//  Отказ - Булево
Процедура МеткиВремениДанныхДокументовЭДОПриЗаписиОбъекта(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьРежимЦентрЭДО") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСеанса.РежимЗагрузкиДанныхВЦентрЭДО Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.МеткиВремениДанныхДокументовЭДО.ЗафиксироватьПоОбъекту(Источник);
	
КонецПроцедуры

// Обработчик подписки на событие: см. ПодпискаНаСобытие.МеткиВремениДанныхДокументовЭДОПередЗаписьюНабораЗаписей
//
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ЭлектронныеПодписиПоМЧД,РегистрСведенийНаборЗаписей.ЭлектронныеПодписи
//  Отказ - Булево
//  Замещение - Булево
Процедура МеткиВремениДанныхДокументовЭДОПередЗаписьюНабораЗаписей(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьРежимЦентрЭДО") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСеанса.РежимЗагрузкиДанныхВЦентрЭДО Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.МеткиВремениДанныхДокументовЭДО.ЗафиксироватьПоНаборуЗаписей(Источник, Замещение);
	
КонецПроцедуры

Процедура МеткиВремениДанныхЭДОПриЗаписиДоверенности(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьРежимЦентрЭДО") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСеанса.РежимЗагрузкиДанныхВЦентрЭДО Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияРеквизитов = Новый Структура("ДатаОбновленияСтатуса, Подписана", '00010101', Ложь);
	ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, Источник);
	
	Если Не ЗначенияРеквизитов.Подписана Или Не ЗначениеЗаполнено(ЗначенияРеквизитов.ДатаОбновленияСтатуса) Тогда
		Возврат;
	КонецЕсли;
	
	ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.СтатусыДоверенностей;
	ИдентификаторОбъекта = Строка(Источник.Ссылка.УникальныйИдентификатор());
	РегистрыСведений.МеткиВремениДанныхЭДО.Зафиксировать("", ТипДанных, ИдентификаторОбъекта);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаНабораЗаписей

// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.ЭлектронныеПодписи
//           - РегистрСведенийНаборЗаписей.ЭлектронныеПодписиПоМЧД
//           - РегистрСведенийНаборЗаписей.СостоянияДокументовЭДО
//           - РегистрСведенийНаборЗаписей.СоставПакетовДокументовЭДО
//           - РегистрСведенийНаборЗаписей.ПроверкиЭлектронныхПодписейЭДО
//           - РегистрСведенийНаборЗаписей.ПриглашенияКОбменуЭлектроннымиДокументами
//           - РегистрСведенийНаборЗаписей.УчетныеЗаписиЭДО
// 
// Возвращаемое значение:
//  ТаблицаЗначений
//@skip-check function-return-types
Функция ВыгрузкаИзмененийПоНаборуЗаписей(Источник) Экспорт
	
	ПолноеИмя = Источник.Метаданные().ПолноеИмя();
	ИмяРегистра = Сред(ПолноеИмя, СтрНайти(ПолноеИмя, ".") + 1);
	ИсточникДоИзменения = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
		Если ЗначениеЗаполнено(ЭлементОтбора.Значение) Тогда
			ИсточникДоИзменения.Отбор[ЭлементОтбора.Имя].Установить(ЭлементОтбора.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ИсточникДоИзменения.Прочитать();
	
	ВыгрузкаЗаписей = ИсточникДоИзменения.Выгрузить();
	Для Каждого ЗаписьНабора Из Источник Цикл
		ЗаполнитьЗначенияСвойств(ВыгрузкаЗаписей.Добавить(), ЗаписьНабора);
	КонецЦикла;
	
	ИменаКолонок = Новый Массив; // Массив из Строка
	Для Каждого Колонка Из ВыгрузкаЗаписей.Колонки Цикл
		ИменаКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	ИменаКолонокСтрокой = СтрСоединить(ИменаКолонок, ",");
	
	ИмяКолонкиКоличествоПовторений = "КоличествоПовторений";
	ВыгрузкаЗаписей.Колонки.Добавить(ИмяКолонкиКоличествоПовторений, ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ВыгрузкаЗаписей.ЗаполнитьЗначения(1, ИмяКолонкиКоличествоПовторений);
	
	ВыгрузкаЗаписей.Свернуть(ИменаКолонокСтрокой, ИмяКолонкиКоличествоПовторений);
	
	Отбор = Новый Структура(ИмяКолонкиКоличествоПовторений, 1);
	
	Возврат ВыгрузкаЗаписей.Скопировать(Отбор, ИменаКолонокСтрокой);
	
КонецФункции

#КонецОбласти

#КонецОбласти
