
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДокументОснование") И ДанныеЗаполнения.Свойство("ТаблицаДанныхДляФиксации") Тогда
			
			ДеньМесяцаДляПериодаУдержания = Константы.ИТ_ДеньМесяцаДляОпределенияПериодаУдержания.Получить();
			
			Основание 						= ДанныеЗаполнения.ДокументОснование;
			Дата							= ТекущаяДата();
			ДокументОснование				= Основание;
			ЛинейныйМенеджер				= Основание.ЛинейныйМенеджер;
			ПланируемыйИсточникУдержания	= Перечисления.ИТ_ПланируемыеИсточникиУдержаний.ЗП;
			
			Если День(ТекущаяДата()) < ДеньМесяцаДляПериодаУдержания Тогда
				ПериодУдержания = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), -1));
			Иначе
				ПериодУдержания = НачалоМесяца(ТекущаяДата());
			КонецЕсли;
			
			Для Каждого СтрокаДляФиксации Из ДанныеЗаполнения.ТаблицаДанныхДляФиксации Цикл
				НоваяСтрокаФиксации = РезультатыИнвентаризаций.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаФиксации, СтрокаДляФиксации);
				
				Если Не ЗначениеЗаполнено(НоваяСтрокаФиксации.ТипУдержания) Тогда
					НоваяСтрокаФиксации.ТипУдержания = Перечисления.ИТ_ТипыУдержанийПоРезультатамИнвентаризаций.ИзЗарплаты;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Регистр Ит_ВзаиморасчетыСПродавцами Приход
	Движения.Ит_ВзаиморасчетыСПродавцами.Записывать = Истина;
	
	Для Каждого ТекСтрокаРезультатыИнвентаризаций Из РезультатыИнвентаризаций Цикл
		Движение								= Движения.Ит_ВзаиморасчетыСПродавцами.Добавить();
		Движение.ВидДвижения					= ВидДвиженияНакопления.Приход;
		Движение.Период							= Дата;
		Движение.Продавец						= ТекСтрокаРезультатыИнвентаризаций.Продавец;
		Движение.ДокументИнвентаризации 		= ТекСтрокаРезультатыИнвентаризаций.ДокументИнвентаризации;
		Движение.Магазин						= ТекСтрокаРезультатыИнвентаризаций.Магазин;
		Движение.ПериодУдержания				= ПериодУдержания;
		Движение.ТипУдержания					= ТекСтрокаРезультатыИнвентаризаций.ТипУдержания;
		ДВижение.ПланируемыйИсточникУдержания	= ПланируемыйИсточникУдержания;
		Движение.СуммаДолга						= ТекСтрокаРезультатыИнвентаризаций.СуммаКУдержанию;
	КонецЦикла;

КонецПроцедуры
