// Модуль менеджера справочника "Прайс листы контрагентов"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура очистки прайс-листа.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура ОчиститьПрайсЛист(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	РегистрПрайсЛистов = РегистрыСведений.ПрайсЛистыКонтрагентов.СоздатьНаборЗаписей();
	РегистрПрайсЛистов.Отбор.ПрайсЛист.Значение = Объект.Ссылка;
	РегистрПрайсЛистов.Отбор.ПрайсЛист.Использование = Истина;
	Попытка
		РегистрПрайсЛистов.Записать();
	Исключение
		ВывестиСообщение(НСтр("ru='Ошибка записи прайс-листа <""%1"">: %2'"),,,,,Объект.Наименование, ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	ВывестиСообщение(НСтр("ru='Очистка прайс-листа завершена.'"));
	
КонецПроцедуры // ОчиститьПрайсЛист()

// Возвращает в структуре параметры номенклатуры.
//
// Параметры:
//  Объект       - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыНоменклатуры(Объект, Знач Артикул, ИмяКлючевогоПоля=Неопределено) Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПрайса = Метаданные.РегистрыСведений.ПрайсЛистыКонтрагентов.Измерения;
	Для каждого Измерение Из СтруктураПрайса Цикл
		СтруктураПараметров.Вставить(Измерение.Имя);
 	КонецЦикла;
	СтруктураПрайса = Метаданные.РегистрыСведений.ПрайсЛистыКонтрагентов.Ресурсы;
	Для каждого Ресурс Из СтруктураПрайса Цикл
		СтруктураПараметров.Вставить(Ресурс.Имя);
	КонецЦикла;

	Артикул = СокрЛП(Артикул);
	
	// Попробуем найти эту номенклатуру в базе
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	*
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентов КАК ПрайсЛистыКонтрагентов
	|ГДЕ
	|	ПрайсЛистыКонтрагентов.Артикул = &Артикул"
	+ ?(ЗначениеЗаполнено(Объект.Производитель), " И ПрайсЛистыКонтрагентов.Производитель = &Производитель","") + "
	|	И ПрайсЛистыКонтрагентов.ПрайсЛист = &ПрайсЛист");
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.УстановитьПараметр("Производитель", Объект.Производитель);
	Запрос.УстановитьПараметр("ПрайсЛист", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		// Есть такой артикул в базе - возвращаем его
		Для каждого РеквизитПрайсЛиста Из СтруктураПараметров Цикл
			СтруктураПараметров[РеквизитПрайсЛиста.Ключ]=Выборка[РеквизитПрайсЛиста.Ключ];
		КонецЦикла;
		СтруктураПараметров.Вставить("ВоВнешнемИсточнике",Ложь);
		Возврат СтруктураПараметров;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьПараметрыНоменклатуры()

// Процедура установки нового контрагента.
//
// Параметры:
//  Объект       - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Процедура УстановитьНовогоКонтрагента(Объект) Экспорт
	
	// Теперь для всех записей прайс-листа переключим контрагента
	УстановитьПривилегированныйРежим(Истина);
	РегистрПрайсЛистов=РегистрыСведений.ПрайсЛистыКонтрагентов.СоздатьНаборЗаписей();
	РегистрПрайсЛистов.Отбор.ПрайсЛист.Значение=Объект.Ссылка;
	РегистрПрайсЛистов.Отбор.ПрайсЛист.Использование=Истина;
	РегистрПрайсЛистов.Прочитать();
	ТЗПрайсЛиста=РегистрПрайсЛистов.Выгрузить();
	ТЗПрайсЛиста.ЗаполнитьЗначения(Объект.Владелец,"Контрагент");
	РегистрПрайсЛистов.Загрузить(ТЗПрайсЛиста);
	Попытка
		РегистрПрайсЛистов.Записать();
	Исключение
		ВывестиСообщение(НСтр("ru='Ошибка записи нового контрагента прайс-листа <""%1"">: %2'"),,,,,Объект.Наименование,ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры // УстановитьНовогоКонтрагента()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	ОбязательныеРеквизиты.Добавить("Владелец");
	ОбязательныеРеквизиты.Добавить("Валюта");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Возвращает наименование объекта.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Функция СформироватьНаименованиеПоУмолчанию(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Наименование = "";
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Наименование = "Прайс-лист <" + СокрЛП(Объект.Владелец.Наименование) + ">";
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции // СформироватьНаименованиеПоУмолчанию()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли