#Область СлужебныйПрограммныйИнтерфейс

// Кэш доступности сервиса 1С:Номенклатура.
//
// Возвращаемое значение:
//  Булево - признак доступности сервиса.
//
Функция Сервис1СНоменклатураДоступен() Экспорт
	Возврат РаботаСНоменклатурой.ДоступнаФункциональностьПодсистемы();
КонецФункции

// Возвращает информацию о работе ИБ в режиме Легкого Клиента ЭДО.
//
// Возвращаемое значение:
//  Булево
Функция ИспользуетсяЛегкийКлиентЭДО() Экспорт
	//Возврат ПолучитьФункциональнуюОпцию("ИспользоватьЛегкийКлиентЭДО");
	Возврат Ложь;
КонецФункции

#КонецОбласти
