// Модуль менеджера регистра сведений "Прайс листы контрагентов"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьСтавкуНДС(СтавкаЧисло)
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНДС.Ссылка
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС
	|ГДЕ
	|	СтавкиНДС.Ставка = &Ставка
	|УПОРЯДОЧИТЬ ПО
	|	СтавкиНДС.Наименование
	|";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ставка", СтавкаЧисло);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Результат = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьСтавкуНДС()

Процедура СоздатьНовуюНоменклатуру(ЗаписьПрайсЛиста, ПараметрыДанных)
	
	//Номенклатура не прописана - поищем с таким штрихкодом
	НайденныеШтрихКоды = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(ЗаписьПрайсЛиста.Штрихкод);
	НоменклатураСтрокаПрайсЛиста = Неопределено;
	Если НайденныеШтрихКоды.Количество()> 0 Тогда
		НоменклатураСтрокаПрайсЛиста = НайденныеШтрихКоды[0];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НоменклатураСтрокаПрайсЛиста) Тогда
		ЗаписьПрайсЛиста.Номенклатура = НоменклатураСтрокаПрайсЛиста.Объект;
		Возврат;
	КонецЕсли;
	
	ВывестиСообщение(НСтр("ru='Создание номенклатуры ""%1""'"), ,,,, ЗаписьПрайсЛиста.Наименование);
	
	//Нет номенклатуры с таким штрихкодом - создаем новую
	НоменклатураСтрокаПрайсЛиста = Справочники.Номенклатура.СоздатьЭлемент();
	НоменклатураСтрокаПрайсЛиста.Родитель     = ПараметрыДанных.ГруппаНоменклатуры;
	НоменклатураСтрокаПрайсЛиста.Наименование = ЗаписьПрайсЛиста.Наименование;
	
	//Если КодЯзыка<>"0" И ЗначениеЗаполнено(ЗаписьПрайсЛиста.НаименованиеЛокализованное) Тогда
	//	НоменклатураСтрокаПрайсЛиста["Наименование"+КодЯзыка]=ЗаписьПрайсЛиста.НаименованиеЛокализованное;
	//КонецЕсли;
	
	НоменклатураСтрокаПрайсЛиста.УстановитьНовыйКод();
	НоменклатураСтрокаПрайсЛиста.НаименованиеПолное = НоменклатураСтрокаПрайсЛиста.Наименование;
	Если НЕ ПараметрыДанных.НеЗаполнятьАртикул Тогда
		НоменклатураСтрокаПрайсЛиста.Артикул = ЗаписьПрайсЛиста.Артикул;
	КонецЕсли;
	
	НоменклатураСтрокаПрайсЛиста.ТипНоменклатуры         = ПараметрыДанных.ТипНоменклатуры;
	НоменклатураСтрокаПрайсЛиста.ВидНоменклатуры         = ПараметрыДанных.ВидНоменклатуры;
	НоменклатураСтрокаПрайсЛиста.БазоваяЕдиницаИзмерения = ПараметрыДанных.БазоваяЕдиницаИзмерения;
	//НоменклатураСтрокаПрайсЛиста.НормативныйДокумент     = ЗаписьПрайсЛиста.НормативныйДокумент;
	//НоменклатураСтрокаПрайсЛиста.Состав=ЗаписьПрайсЛиста.Состав;
	НоменклатураСтрокаПрайсЛиста.ТоварнаяМарка           = ЗаписьПрайсЛиста.ТоварнаяМарка;
	НоменклатураСтрокаПрайсЛиста.ВидАлкогольнойПродукции = Справочники.ВидыАлкогольнойПродукции.НайтиПоКоду(ЗаписьПрайсЛиста.КодВидаАлкогольнойПродукции);
	
	Если ПараметрыДанных.ЗаполнятьСтавкуНДС Тогда
		НоменклатураСтрокаПрайсЛиста.СтавкаНДС           = ПараметрыДанных.СтавкаНДС;
	Иначе
		НоменклатураСтрокаПрайсЛиста.СтавкаНДС           = ПолучитьСтавкуНДС(ЗаписьПрайсЛиста.СтавкаНДС);
	КонецЕсли;
	
	НоменклатураСтрокаПрайсЛиста.ВалютаУчета             = ПараметрыДанных.ВалютаУчета;
	НоменклатураСтрокаПрайсЛиста.СтранаПроисхождения     = ?(ЗначениеЗаполнено(ЗаписьПрайсЛиста.СтранаПроизводитель), ЗаписьПрайсЛиста.СтранаПроизводитель, ПараметрыДанных.СтранаПроизводитель);
	НоменклатураСтрокаПрайсЛиста.ПроцентНаценки          = ПараметрыДанных.ПроцентНаценки;
	НоменклатураСтрокаПрайсЛиста.Производитель           = Справочники.Производители.НайтиПоНаименованию(ЗаписьПрайсЛиста.Производитель, Истина);
	
	Попытка
		
		Если Не НоменклатураСтрокаПрайсЛиста.ПроверитьЗаполнение() Тогда
			ВывестиСообщение(НСтр("ru='Номенклатура ""%1"" не записана'"), НоменклатураСтрокаПрайсЛиста,,,, СокрЛП(НоменклатураСтрокаПрайсЛиста.Наименование));
			Возврат;
			//	|%2'"), НоменклатураСтрокаПрайсЛиста,,,, СокрЛП(НоменклатураСтрокаПрайсЛиста.Наименование), ПредставлениеОшибки);
			//ПредставлениеОшибки = "";
			//МассивСообщений = ПолучитьСообщенияПользователю(Ложь);
			//
			//КоличествоСообщений = МассивСообщений.Количество()-1;
			//Пока КоличествоСообщений>=0 Цикл
			//	СообщениеПользователю = МассивСообщений[КоличествоСообщений];
			//	Если СообщениеПользователю.Поле = "" Тогда
			//		КоличествоСообщений = КоличествоСообщений - 1;
			//		Продолжить;
			//	КонецЕсли;
			//	ПредставлениеОшибки = СообщениеПользователю.Текст;
			//	Прервать;
			//КонецЦикла;
			//
			//Если ЗначениеЗаполнено(ПредставлениеОшибки) Тогда
			//	ВывестиСообщение(НСтр("ru='Ошибка заполнения справочника ""%1"":
			//	|%2'"), НоменклатураСтрокаПрайсЛиста,,,, СокрЛП(НоменклатураСтрокаПрайсЛиста.Наименование), ПредставлениеОшибки);
			//	Возврат;
			//КонецЕсли;
		КонецЕсли;
		
		НоменклатураСтрокаПрайсЛиста.Записать();
		ЗаписьПрайсЛиста.Номенклатура = НоменклатураСтрокаПрайсЛиста.Ссылка;
		//Если ЗначениеЗаполнено(ЗаписьПрайсЛиста.НаименованиеЛокализованное) Тогда
		//	//запись наименования полного
		//	ЛокализованныеЗначенияРеквизитов.ЗаписатьЛокализованноеЗначение(НоменклатураСтрокаПрайсЛиста.Ссылка,ПланыВидовХарактеристик.ЛокализуемыеРеквизитыОбъектов.Номенклатура_НаименованиеПолное,ЗаписьПрайсЛиста.НаименованиеЛокализованное);	
		//КонецЕсли;
		
		//Проверим, назначено ли свойство номенклатуры Производитель. Если назначено, то попробуем записать производителя
		//Если ПланыВидовХарактеристик.НазначенияСвойствОбъектов.Справочник_Номенклатура.ВидыСвойств.Найти(ПланыВидовХарактеристик.СвойстваОбъектов.Производитель,"Свойство") <> Неопределено Тогда
		//	Производитель = Справочники.Контрагенты.НайтиПоНаименованию(ЗаписьПрайсЛиста.Производитель);
		//	Если ЗначениеЗаполнено(Производитель) Тогда
		//		нзЗначенияСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		//		нзЗначенияСвойств.Объект = НоменклатураСтрокаПрайсЛиста.Ссылка;
		//		нзЗначенияСвойств.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.Производитель;
		//		нзЗначенияСвойств.Значение = Производитель;
		//		Попытка
		//			нзЗначенияСвойств.Записать();
		//		Исключение
		//			Сообщить("Ошибка записи доп. свойства Производитель номенклатуры """+НоменклатураСтрокаПрайсЛиста.Наименование+"""");
		//		КонецПопытки;
		//	КонецЕсли;
		//КонецЕсли;
		//Проверим, назначено ли свойство типа номенклатуры Емкость. Если назначено, то попробуем записать емкость
		//Если ТипНоменклатуры.СвойстваТоварнойКатегории.Найти(ПланыВидовХарактеристик.СвойстваОбъектов.Емкость,"Свойство") <> Неопределено Тогда
		//	Если ЗаписьПрайсЛиста.Емкость<>0 Тогда
		//		нзЗначенияСвойств = РегистрыСведений.ЗначенияСвойствТоварныхКатегорий.СоздатьМенеджерЗаписи();
		//		нзЗначенияСвойств.Номенклатура = НоменклатураСтрокаПрайсЛиста.Ссылка;
		//		нзЗначенияСвойств.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.Емкость;
		//		нзЗначенияСвойств.Значение = ЗаписьПрайсЛиста.Емкость;
		//		Попытка
		//			нзЗначенияСвойств.Записать();
		//		Исключение
		//			Сообщить("Ошибка записи доп. свойства Емкость номенклатуры """+НоменклатураСтрокаПрайсЛиста.Наименование+"""");
		//		КонецПопытки;
		//	КонецЕсли;
		//КонецЕсли;
		//Проверим, назначено ли свойство типа номенклатуры Крепость. Если назначено, то попробуем записать крепость
		//Если ТипНоменклатуры.СвойстваТоварнойКатегории.Найти(ПланыВидовХарактеристик.СвойстваОбъектов.Крепость,"Свойство") <> Неопределено Тогда
		//	Если ЗаписьПрайсЛиста.Крепость<>0 Тогда
		//		нзЗначенияСвойств = РегистрыСведений.ЗначенияСвойствТоварныхКатегорий.СоздатьМенеджерЗаписи();
		//		нзЗначенияСвойств.Номенклатура = НоменклатураСтрокаПрайсЛиста.Ссылка;
		//		нзЗначенияСвойств.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.Крепость;
		//		нзЗначенияСвойств.Значение = ЗаписьПрайсЛиста.Крепость;
		//		Попытка
		//			нзЗначенияСвойств.Записать();
		//		Исключение
		//			Сообщить("Ошибка записи доп. свойства Крепость номенклатуры """+НоменклатураСтрокаПрайсЛиста.Наименование+"""");
		//		КонецПопытки;
		//	КонецЕсли;
		//КонецЕсли;
		
		Попытка // Возможна ошибка при записи основной единицы измерения (если не задана базовая)
			спрЕдиницыИзмерения = Справочники.ЕдиницыИзмерения;
			ОсновнаяЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(НоменклатураСтрокаПрайсЛиста.Ссылка);
			НоменклатураСтрокаПрайсЛиста.ОсновнаяЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;
			НоменклатураСтрокаПрайсЛиста.Записать();
			
			// создаем штрихкод
			ТекущийШтрихКод = "";
			Если ЗначениеЗаполнено(ЗаписьПрайсЛиста.Штрихкод) Тогда
				ТекущийШтрихКод = ЗаписьПрайсЛиста.Штрихкод;
			ИначеЕсли ПараметрыДанных.ГенерироватьШтрихкоды Тогда
				ТекущийШтрихКод = ШтрихкодированиеВызовСервера.СформироватьНовыйШтрихкод(НоменклатураСтрокаПрайсЛиста.Ссылка);
			КонецЕсли;
			
			// создаем штрихкод
			Если ЗначениеЗаполнено(ТекущийШтрихКод) Тогда
				ЗаписьШтрихкоды = РегистрыСведений.ШтрихКоды.СоздатьМенеджерЗаписи();
				ЗаписьШтрихкоды.Объект           = НоменклатураСтрокаПрайсЛиста.Ссылка;
				ЗаписьШтрихкоды.ЕдиницаИзмерения = НоменклатураСтрокаПрайсЛиста.ОсновнаяЕдиницаИзмерения;
				ЗаписьШтрихкоды.ШтрихКод         = ЗаписьПрайсЛиста.Штрихкод;
				ЗаписьШтрихкоды.Записать(Истина);
			КонецЕсли;
			
			//ВывестиСообщение(НСтр("ru='Обновлен документ ""%1"".'"),,,,, СокрЛП(ДокументВзаимодействия.Ссылка));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка записи основной единицы измерения для номенклатуры'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()) + " " + СокрЛП(НоменклатураСтрокаПрайсЛиста.Наименование), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	Исключение
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка записи номенклатуры'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()) + " " + СокрЛП(НоменклатураСтрокаПрайсЛиста.Наименование), УровеньЖурналаРегистрации.Ошибка,,, ПредставлениеОшибки);
	КонецПопытки; 
	
КонецПроцедуры

Процедура ВыполнитьЗапись(СтрокаОтбора, СтруктураОтборов, ПараметрыДанных)
	
	//Отобразим процесс загрузки
	//ЭлементыФормы.ИндикаторЗагрузки.Значение=ТекСтрокаПрайсЛиста;
	
	//Получим редактируемую запись
	НаборЗаписейПрайсЛиста = РегистрыСведений.ПрайсЛистыКонтрагентов.СоздатьНаборЗаписей();
	Для Каждого ИзмерениеРегистра Из СтруктураОтборов Цикл
		//Если ИзмерениеРегистра.Ключ = "Номенклатура" Тогда
		//	Продолжить;
		//КонецЕсли;
		НаборЗаписейПрайсЛиста.Отбор[ИзмерениеРегистра.Ключ].Значение      = СтрокаОтбора[ИзмерениеРегистра.Ключ];
		НаборЗаписейПрайсЛиста.Отбор[ИзмерениеРегистра.Ключ].Использование = Истина;
	КонецЦикла;
	НаборЗаписейПрайсЛиста.Прочитать();
	
	Если НаборЗаписейПрайсЛиста.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьПрайсЛиста = НаборЗаписейПрайсЛиста[0];
	
	//Если артикул ссылки на номенклатуру отличается от прайс-листа - сотрем ссылку
	Если ПараметрыДанных.ОчищатьСсылки Тогда
		Если ЗначениеЗаполнено(ЗаписьПрайсЛиста.Номенклатура) Тогда
			Если ЗаписьПрайсЛиста.Номенклатура.Артикул<>ЗаписьПрайсЛиста.Артикул Тогда
				ЗаписьПрайсЛиста.Номенклатура=Справочники.Номенклатура.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Попробуем создать новую номенклатуру или связать с существующей
	Если НЕ ЗначениеЗаполнено(ЗаписьПрайсЛиста.Номенклатура) Тогда
		Если ПараметрыДанных.СоздаватьНовые Тогда
			СоздатьНовуюНоменклатуру(ЗаписьПрайсЛиста, ПараметрыДанных);
			//Если ЗаписьПрайсЛиста.КоличествоВУпаковке > 0 Тогда 
			//	НоменклатураДляСистемыЗаказов.Вставить(ЗаписьПрайсЛиста.Номенклатура, ЗаписьПрайсЛиста.КоличествоВУпаковке);
			//КонецЕсли;
		КонецЕсли;
	ИначеЕсли ПараметрыДанных.ПерезаписыватьРеквизиты Тогда //Обновим реквизиты номенклатуры, связанной со строки прайс-листа
		//Если НЕ обЗначениеНеЗаполнено(ЗаписьПрайсЛиста.Номенклатура) Тогда
		
		НоменклатураСтрокаПрайсЛиста = ЗаписьПрайсЛиста.Номенклатура.ПолучитьОбъект();
		Если ЗначениеЗаполнено(НоменклатураСтрокаПрайсЛиста.Наименование) Тогда
			НоменклатураСтрокаПрайсЛиста.Наименование       = ЗаписьПрайсЛиста.Наименование;
			НоменклатураСтрокаПрайсЛиста.НаименованиеПолное = НоменклатураСтрокаПрайсЛиста.Наименование;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаписьПрайсЛиста.Артикул) И (НЕ ПараметрыДанных.НеЗаполнятьАртикул) Тогда
			НоменклатураСтрокаПрайсЛиста.Артикул = ЗаписьПрайсЛиста.Артикул;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаписьПрайсЛиста.ТоварнаяМарка) Тогда
			НоменклатураСтрокаПрайсЛиста.ТоварнаяМарка = ЗаписьПрайсЛиста.ТоварнаяМарка;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаписьПрайсЛиста.КодВидаАлкогольнойПродукции) Тогда
			НоменклатураСтрокаПрайсЛиста.ВидАлкогольнойПродукции = Справочники.ВидыАлкогольнойПродукции.НайтиПоКоду(ЗаписьПрайсЛиста.КодВидаАлкогольнойПродукции);
		КонецЕсли;
		
		//Если КодЯзыка<>"0" И ЗначениеЗаполнено(ЗаписьПрайсЛиста.НаименованиеЛокализованное) Тогда
		//	НоменклатураСтрокаПрайсЛиста["Наименование"+КодЯзыка]=ЗаписьПрайсЛиста.НаименованиеЛокализованное;
		//	ЛокализованныеЗначенияРеквизитов.ЗаписатьЛокализованноеЗначение(НоменклатураСтрокаПрайсЛиста.Ссылка,ПланыВидовХарактеристик.ЛокализуемыеРеквизитыОбъектов.Номенклатура_НаименованиеПолное,ЗаписьПрайсЛиста.НаименованиеЛокализованное);	
		//КонецЕсли;
		Если ЗначениеЗаполнено(ЗаписьПрайсЛиста.СтранаПроизводитель) Тогда
			НоменклатураСтрокаПрайсЛиста.СтранаПроисхождения = ЗаписьПрайсЛиста.СтранаПроизводитель;
		КонецЕсли;
		
		Попытка
			НоменклатураСтрокаПрайсЛиста.Записать();
		Исключение
			//Сообщить("Ошибка записи номенклатуры """+НоменклатураСтрокаПрайсЛиста.Наименование+"""");
		КонецПопытки; 
		//КонецЕсли; 
	КонецЕсли; 
	//Теперь попробуем записать то, что насоздавали
	//ЗаписьПрайсЛиста.Номенклатура=Справочники.Номенклатура.ПустаяСсылка();
	Попытка
		НаборЗаписейПрайсЛиста.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка записи строки прайс-листа'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	//	ТекСтрокаПрайсЛиста=ТекСтрокаПрайсЛиста+1;
	//КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьНоменклатуруНаСервере(ВходныеПараметры, АдресХранилища1=Неопределено) Экспорт
	
//	Если ВходныеПараметры.ИмяКоманды = "ВыгрузитьДанные" Тогда
//		ВыгрузитьДанныеВОборудование(ВходныеПараметры.ИдентификаторУстройства, ВходныеПараметры.ПараметрыДанных);
//	ИначеЕсли ВходныеПараметры.ИмяКоманды = "ЗагрузитьДанные" Тогда
//		ЗагрузитьДанныеИзОборудования(ВходныеПараметры.ИдентификаторУстройства);
//	КонецЕсли;
	
	// сначала поищем соответствие ШК
	НаборЗаписей=РегистрыСведений.ПрайсЛистыКонтрагентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПрайсЛист.Значение = ВходныеПараметры.ПрайсЛистКонтрагента;
	НаборЗаписей.Отбор.ПрайсЛист.Использование=Истина;
	НаборЗаписей.Прочитать();
	
	ШтрихКоды = Новый Массив;
	Для Каждого Запись из НаборЗаписей Цикл
		Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.Штрихкод) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ШтрихКоды.Найти(Запись.Штрихкод) = Неопределено Тогда
			ШтрихКоды.Добавить(Запись.Штрихкод);
		КонецЕсли;
	КонецЦикла;
	
	ПустаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	НайденныеШтрихКоды = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(ШтрихКоды);
	Для Каждого СтрокаШтрихКода Из НайденныеШтрихКоды Цикл
		Если СтрокаШтрихКода.Запрет Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаШтрихКода.Объект) Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеЗаписи = НаборЗаписей.НайтиСтроки(Новый Структура("Штрихкод, Номенклатура", СтрокаШтрихКода.Штрихкод, ПустаяНоменклатура));
		Для Каждого ТекущаяЗапись Из НайденныеЗаписи Цикл
			ТекущаяЗапись.Номенклатура = СтрокаШтрихКода.Объект;
		КонецЦикла;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
	СтруктураОтборов = Новый Структура;
	ИзмеренияРегистра = Метаданные.РегистрыСведений.ПрайсЛистыКонтрагентов.Измерения;
	Для Каждого ТекущаяКолонка Из ИзмеренияРегистра Цикл
		Если ТекущаяКолонка.Имя = "Номенклатура" Тогда
			Продолжить;
		КонецЕсли;
		СтруктураОтборов.Вставить(ТекущаяКолонка.Имя);
	КонецЦикла;
	
	ТаблицаОтборов = ВходныеПараметры.ТаблицаОтборов;
	
	НомерСтроки = 1;
	КоличествоСтрок = ТаблицаОтборов.Количество()/100;
	Для Каждого ТекущийОтбор Из ТаблицаОтборов Цикл
		ВыполнитьЗапись(ТекущийОтбор, СтруктураОтборов, ВходныеПараметры.ПараметрыДанных);
		
		Процент = НомерСтроки/КоличествоСтрок;
		РезультатОбработкиСтроки = Новый Структура;
		РезультатОбработкиСтроки.Вставить("НомерСтроки", НомерСтроки);
		ДлительныеОперации.СообщитьПрогресс(Процент,, РезультатОбработкиСтроки);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	//Если ЭтоАдресВременногоХранилища(ВходныеПараметры.АдресХранилища) Тогда
	//	НомерСтроки = 1;
	//	ОтборыРегистра = ПолучитьИзВременногоХранилища(ВходныеПараметры.АдресХранилища);
	//	КоличествоСтрок = ОтборыРегистра.Количество()/100;
	//	Для Каждого ТекущийОтбор Из ОтборыРегистра Цикл
	//		ВыполнитьЗапись(ТекущийОтбор, СтруктураОтборов, ВходныеПараметры.ПараметрыДанных);
	//		
	//		Процент = НомерСтроки/КоличествоСтрок;
	//		РезультатОбработкиСтроки = Новый Структура;
	//		РезультатОбработкиСтроки.Вставить("НомерСтроки", НомерСтроки);
	//		ДлительныеОперации.СообщитьПрогресс(Процент,, РезультатОбработкиСтроки);
	//		НомерСтроки = НомерСтроки + 1;
	//	КонецЦикла;
	//Иначе
	//	Запрос = Новый Запрос;
	//	ОтборыСКД   = ВходныеПараметры.НастройкиСписка.Отбор;
	//	ТекстОтбора = ОтчетыПлатформаСервер.КомпоновщикПолучитьТекстОтбора(ОтборыСКД.Элементы, ОтборыСКД.ДоступныеПоляОтбора, "ПрайсЛистыКонтрагентов", Запрос.Параметры);
	//	
	//	Запрос.УстановитьПараметр("ПрайсЛистКонтрагента", ВходныеПараметры.ПрайсЛистКонтрагента);
	//	Запрос.Текст = "
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ПрайсЛистыКонтрагентов.ПрайсЛист,
	//	|	ПрайсЛистыКонтрагентов.Артикул,
	//	|	ПрайсЛистыКонтрагентов.Производитель,
	//	|	ПрайсЛистыКонтрагентов.Штрихкод
	//	|ИЗ
	//	|	РегистрСведений.ПрайсЛистыКонтрагентов КАК ПрайсЛистыКонтрагентов
	//	|ГДЕ
	//	|	ПрайсЛистыКонтрагентов.ПрайсЛист = &ПрайсЛистКонтрагента
	//	|	" + ?(ЗначениеЗаполнено(ТекстОтбора), " И 
	//	|	" + ТекстОтбора, "") + "
	//	|";
	//	
	//	НомерСтроки = 1;
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	КоличествоСтрок = Выборка.Количество()/100;
	//	Пока Выборка.Следующий() Цикл
	//		ВыполнитьЗапись(Выборка, СтруктураОтборов, ВходныеПараметры.ПараметрыДанных);
	//		
	//		Процент = НомерСтроки/КоличествоСтрок;
	//		РезультатОбработкиСтроки = Новый Структура;
	//		РезультатОбработкиСтроки.Вставить("НомерСтроки", НомерСтроки);
	//		ДлительныеОперации.СообщитьПрогресс(Процент,, РезультатОбработкиСтроки);
	//		НомерСтроки = НомерСтроки + 1;
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	//	ТекСтрокаПрайсЛиста=ТекСтрокаПрайсЛиста+1;
	//КонецЦикла; 
	//
	//////вберем подразделения для которых надо записать квант поставки
	////ПараметрыОтбора = Новый Структура;
	////ПараметрыОтбора.Вставить("ПодразделениеВыбрано",Истина);
	////МассивПодразделений = Новый Массив;
	////НайденыеСтроки = ДеревоПодразделений.Строки.НайтиСтроки(ПараметрыОтбора, Истина);
	////
	////Для каждого СтрокаДерева Из НайденыеСтроки Цикл
	////	Для каждого НоменклатураДляЗаписи Из НоменклатураДляСистемыЗаказов Цикл 
	////		КвантПоставки = РегистрыСведений.ПараметрыСистемыЗаказов.СоздатьМенеджерЗаписи();
	////		КвантПоставки.Объект = НоменклатураДляЗаписи.Ключ;
	////		КвантПоставки.ПодразделениеКомпании = СтрокаДерева.ПодразделениеКомпании;
	////		КвантПоставки.ДополнительныйРеквизит = ПланыВидовХарактеристик.ПараметрыСистемыЗаказов.КвантПоставки;
	////		КвантПоставки.ЗначениеРеквизита = НоменклатураДляЗаписи.Значение;
	////		КвантПоставки.ОтНоменклатуры = Истина;
	////		КвантПоставки.Записать();
	////	КонецЦикла;
	////КонецЦикла; 
	//	
	//ЭлементыФормы.ИндикаторЗагрузки.Видимость=Ложь;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты регистра
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли