
&НаСервере
Функция НайтиХранилищеЗначенийПоДатам(ДатаНачала, ДатаОкончания) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НСИАрхив.Значение
	               |ИЗ
	               |	РегистрСведений.НСИАрхив КАК НСИАрхив
	               |ГДЕ
	               |	НСИАрхив.ДатаНачала = &ДатаНачала
	               |	И НСИАрхив.ДатаОкончания = &ДатаОкончания";
				   
	Запрос.УстановитьПараметр("ДатаНачала",    ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция АрхивацияРазрешена()
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьЗаписиВАрхив(Команда)
	
	Если Не АрхивацияРазрешена() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ИмяЭлемента", "Выберите период");
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		НастройкаПериода = Новый НастройкаПериода;
		НастройкаПериода.РедактироватьКакИнтервал = Истина;
		НастройкаПериода.РедактироватьКакПериод = Истина;
		НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
		
		Если НастройкаПериода.Редактировать() Тогда
			СтруктураПериода = Новый Структура("НачалоПериода,КонецПериода",НастройкаПериода.ПолучитьДатуНачала(),НастройкаПериода.ПолучитьДатуОкончания());
			ДобавитьЗаписиВАрхивЗавершение(СтруктураПериода,Неопределено);
		Иначе
			Возврат;	
		КонецЕсли;
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение ИЛИ ТонкийКлиент  Тогда
		ОткрытьФорму("ОбщаяФорма.ВыборПроизвольногоПериода",ПараметрыФормы,,,,, Новый ОписаниеОповещения("ДобавитьЗаписиВАрхивЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Восстановить(Команда)
	
	Если Не АрхивацияРазрешена() Тогда
		Возврат;
	КонецЕсли;

	ТекСтрока = Элементы.Список.ТекущиеДанные;
	ВосстановитьСервер(ТекСтрока.ДатаНачала, ТекСтрока.ДатаОкончания);

КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьЗаПериод(Команда)
	
	Если Не АрхивацияРазрешена() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ИмяЭлемента", "Выберите период");
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		НастройкаПериода = Новый НастройкаПериода;
		НастройкаПериода.РедактироватьКакИнтервал = Истина;
		НастройкаПериода.РедактироватьКакПериод = Истина;
		НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
		
		Если НастройкаПериода.Редактировать() Тогда
			СтруктураПериода = Новый Структура("НачалоПериода,КонецПериода",НастройкаПериода.ПолучитьДатуНачала(),НастройкаПериода.ПолучитьДатуОкончания());
			ВосстановитьЗаПериодЗавершение(СтруктураПериода,Неопределено);
		Иначе
			Возврат;	
		КонецЕсли;
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение ИЛИ ТонкийКлиент  Тогда
		ОткрытьФорму("ОбщаяФорма.ВыборПроизвольногоПериода",ПараметрыФормы,,,,, Новый ОписаниеОповещения("ВосстановитьЗаПериодЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	#КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ВосстановитьСервер(ДатаНачала, ДатаОкончания)
	Хранилище = НайтиХранилищеЗначенийПоДатам(ДатаНачала, ДатаОкончания);
	
	Если Не Хранилище = Неопределено Тогда
		НСИКлиентСервер.ВосстановитьИсториюИзмененияОбъектов(Хранилище);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьЗаПериодЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
	Если Результат <> Неопределено Тогда
		НачПериода = Результат.НачалоПериода;
		КонПериода = КонецДня(Результат.КонецПериода);
		НСИКлиентСервер.ВосстановитьИсториюЗаПериод(НачПериода, КонПериода);
	КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаписиВАрхивЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> неопределено Тогда
		НачПериода = Результат.НачалоПериода;
		КонПериода = КонецДня(Результат.КонецПериода);
		НСИКлиентСервер.СжатьИсториюИзмененияОбъектов(НачПериода, КонПериода);
	КонецЕсли; 
КонецПроцедуры
