
&НаКлиенте
Процедура АвтоТаймаутПодготовки(Команда)
	
	Максимум = МаксимумКлиентовНаКомпьютере();
	Объект.ТаймаутПодготовки =
		ТЦОбщий.ОкрВверх(Максимум / 10) * Объект.ТаймаутЗапускаКлиента + 60;
	
КонецПроцедуры // АвтоТаймаутПодготовки()

&НаСервере
// Определить максимальное количество клиентов, запускаемых на одном компьютере
//
// Параметры:
//  Сценарий
//
// Возвращаемое значение:
//  Число - максимальное количество клиентов
//
Функция МаксимумКлиентовНаКомпьютере()
	
	Компьютеры = Объект.Структура.Выгрузить(, "Клиент, Количество");
	Компьютеры.Колонки.Добавить("Компьютер");
	
	Для каждого СтрокаКомпьютера Из Компьютеры Цикл
		СтрокаКомпьютера.Компьютер = СтрокаКомпьютера.Клиент.Компьютер;
	КонецЦикла;
	
	Компьютеры.Свернуть("Компьютер", "Количество");
	Максимум = 0;
	
	Для каждого СтрокаКомпьютера Из Компьютеры Цикл
		Если СтрокаКомпьютера.Количество > Максимум Тогда
			Максимум = СтрокаКомпьютера.Количество;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Максимум;
	
КонецФункции // МаксимумКлиентовНаКомпьютере()

&НаКлиенте
Процедура СтруктураКлиентПриИзменении(Элемент)
	
	Если ТЦСервер.ЭтоВебКлиент(Элементы.Структура.ТекущиеДанные.Клиент) Тогда
		Элементы.СтруктураКоличество.МаксимальноеЗначение = 1;
		Элементы.Структура.ТекущиеДанные.Количество = 1;
	Иначе
		Элементы.СтруктураКоличество.МаксимальноеЗначение = 1000000;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДлительностьВыполненияПриИзменении(Элемент)
	
	Если Объект.ДлительностьВыполнения > Объект.ТаймаутВыполнения Тогда
		Объект.ДлительностьВыполнения = Объект.ТаймаутВыполнения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураРольОткрытие(Элемент, СтандартнаяОбработка)
	
	П = Новый Структура;
	П.Вставить("Ключ", Элементы.Структура.ТекущиеДанные.Роль);
	П.Вставить("ТЦСценарий", Объект.Ссылка);
	ОткрытьФорму("Справочник.ТЦРоли.Форма.Роль", П);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры // СтруктураРольОткрытие()

&НаКлиенте
Процедура ЗапуститьИтеративныйТест(Команда)
	
	Если Модифицированность Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(НСтр("ru = 'Необходимо записать сценарий перед выполнением. Записать?'"), Режим, 30, КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			Успешно = Записать();
			Если Не Успешно Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		ДатаНачала = ТекущаяДата();
		Сценарий = Объект.Ссылка;
		Если НЕ ЗначениеЗаполнено(Сценарий) Тогда
			Возврат;
		КонецЕсли;
		Если ТЦСервер.БСППодсистемаИспользуется(ТЦОбщий.БСПИмяПодсистемыУправленияДоступом()) И Не ТЦСервер.БСПРольДоступна("ПолныеПрава") Тогда
			Предупреждение(НСтр("ru = 'В конфигурации используется подсистема управления доступом БСП.
							|Для корректной работы Тест-центра управляющее подключение должно быть запущено под пользователем с ролью ""ПолныеПрава"".'"));
			Возврат;
		КонецЕсли;
		НеобходимыеРоли = ТЦСервер.ПодобратьПраваДляПодсистемы("ТестЦентр");
		Если ЗначениеЗаполнено(НеобходимыеРоли) Тогда
			ДобавляемыеРоли = ТЦСервер.ПроверитьПраваОригинальныхПользователей(Сценарий, НеобходимыеРоли);
			Если ЗначениеЗаполнено(ДобавляемыеРоли) Тогда
				КодВозврата = Вопрос(НСтр("ru = 'Для корректной работы Тест-центра у пользователей участвующих в сценарии должны быть установлены следующие роли: " + "
									  |" + ТЦОбщий.МассивВСтроку(ДобавляемыеРоли) + "
									  |Установить их автоматически?'") , РежимДиалогаВопрос.ДаНетОтмена);
				Если КодВозврата = КодВозвратаДиалога.Да Тогда
					// ТЦСервер.УстановитьПраваОригинальныхПользователей(Сценарий, ДобавляемыеРоли);
				ИначеЕсли КодВозврата = КодВозвратаДиалога.Отмена Тогда
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Тест = ТЦСервер.ВыполнитьСценарий(Сценарий, Объект.НачальноеКоличествоПользователей, Объект.НачальныйШаг, Объект.КонечныйШаг, Объект.ПороговыйAPDEX, Объект.МаксимальноеКоличествоИтераций);
		Если НЕ ЗначениеЗаполнено(Тест) Тогда
			Предупреждение(НСтр("ru = 'В данный момент уже выполняется тест," + Символы.ПС + "следует дождаться его окончания.'"),30, НСтр("ru = 'Ошибка'"));
			Возврат;
		КонецЕсли;
		
		ТЦКлиент.ПоказатьСостояниеТестирования();
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТЦОбщий.ЗаписатьВЖурнал(Ошибка);
		ТЦКлиент.СообщитьОбОшибке(Ошибка, ДатаНачала, ТекущаяДата());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьДинамическийТест(Команда)
	
	Если Модифицированность Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(НСтр("ru = 'Необходимо записать сценарий перед выполнением. Записать?'"), Режим, 30, КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		Иначе
			Успешно = Записать();
			Если Не Успешно Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		ДатаНачала = ТекущаяДата();
		Сценарий = Объект.Ссылка;
		Если НЕ ЗначениеЗаполнено(Сценарий) Тогда
			Возврат;
		КонецЕсли;
		Если ТЦСервер.БСППодсистемаИспользуется(ТЦОбщий.БСПИмяПодсистемыУправленияДоступом()) И Не ТЦСервер.БСПРольДоступна("ПолныеПрава") Тогда
			Предупреждение(НСтр("ru = 'В конфигурации используется подсистема управления доступом БСП.
							|Для корректной работы Тест-центра управляющее подключение должно быть запущено под пользователем с ролью ""ПолныеПрава"".'"));
			Возврат;
		КонецЕсли;
		НеобходимыеРоли = ТЦСервер.ПодобратьПраваДляПодсистемы("ТестЦентр");
		Если ЗначениеЗаполнено(НеобходимыеРоли) Тогда
			ДобавляемыеРоли = ТЦСервер.ПроверитьПраваОригинальныхПользователей(Сценарий, НеобходимыеРоли);
			Если ЗначениеЗаполнено(ДобавляемыеРоли) Тогда
				КодВозврата = Вопрос(НСтр("ru = 'Для корректной работы Тест-центра у пользователей участвующих в сценарии должны быть установлены следующие роли: " + "
									  |" + ТЦОбщий.МассивВСтроку(ДобавляемыеРоли) + "
									  |Установить их автоматически?'") , РежимДиалогаВопрос.ДаНетОтмена);
				Если КодВозврата = КодВозвратаДиалога.Да Тогда
					// ТЦСервер.УстановитьПраваОригинальныхПользователей(Сценарий, ДобавляемыеРоли);
				ИначеЕсли КодВозврата = КодВозвратаДиалога.Отмена Тогда
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Тест = ТЦСервер.ВыполнитьСценарий(Сценарий, Объект.НачальноеКоличествоПользователей, Объект.НачальныйШаг, Объект.КонечныйШаг, Объект.ПороговыйAPDEX, Объект.МаксимальноеКоличествоИтераций, Истина);
		Если НЕ ЗначениеЗаполнено(Тест) Тогда
			Предупреждение(НСтр("ru = 'В данный момент уже выполняется тест," + Символы.ПС + "следует дождаться его окончания.'") ,30,НСтр("ru = 'Ошибка'"));
			Возврат;
		КонецЕсли;
		
		ТЦКлиент.ПоказатьСостояниеТестирования();
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТЦОбщий.ЗаписатьВЖурнал(Ошибка);
		ТЦКлиент.СообщитьОбОшибке(Ошибка, ДатаНачала, ТекущаяДата());
	КонецПопытки;
	
КонецПроцедуры

