// Модуль объекта документа "Поступление товаров"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьОсновнойЗаказ()
	
	ОсновнойЗаказ = Документы.ЗаказПоставщику.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") И ДокументОснование.ХозОперация = Справочники.ХозОперации.ЗаказПоставщику Тогда
		ОсновнойЗаказ = ДокументОснование;
	ИначеЕсли РаспределениеПоставки.Количество()>0 Тогда
		ОсновнойЗаказ = РаспределениеПоставки[0].ЗаказПоставщику;
	КонецЕсли;
	
	Возврат ОсновнойЗаказ;
	
КонецФункции

// Возвращает результат запроса по таблице товаров поставщика.
Функция ПолучитьТаблицуТоваровЗаказыРаспределение()
	
	// Формируем запрос к табличной части документа.
	
	СостояниеПриемки = ИТ_СпециальныйМодульСервер.ПолучитьТекущееСостояниеПоступления(Ссылка);
	
	Запрос = Новый Запрос();
	Запрос.Текст = "
	| ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ДокументТовары.ЦенаРозничная*ДокументТовары.КоличествоБазовое)/СУММА(ДокументТовары.КоличествоБазовое) КАК ЦенаРозничная,
	|	СУММА(ДокументТовары.КоличествоБазовое) КАК Количество,
	|	СУММА(ДокументТовары.КоличествоБазовое) КАК ДоступноЗакрыть,
	|	0 КАК Резерв
	|ИЗ
	|	Документ.ПоступлениеТоваров.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка=&Ссылка И
	|	ДокументТовары.Номенклатура.ВидНоменклатуры<>&Услуга И ДокументТовары.Количество > 0
	|СГРУППИРОВАТЬ ПО
	|	ДокументТовары.Номенклатура,
	|	ДокументТовары.ХарактеристикаНоменклатуры
	|ИМЕЮЩИЕ
	|	СУММА(ДокументТовары.Количество) > 0
	|";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Услуга", Перечисления.ВидыНоменклатуры.Услуга);
	
	ТаблицаРаспределения = Запрос.Выполнить().Выгрузить();	
	
	Возврат ТаблицаРаспределения;
	
КонецФункции

Процедура ОтразитьРучноеРаспределение(ТаблицаТоваров)
	
	ТаблицаТоваров.Индексы.Добавить("Номенклатура");
	
	//ТаблицаРаспределения = ТаблицаТоваров.СкопироватьКолонки();
	ТаблицаТоваров.Колонки.Добавить("ЗаказПоставщику", Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику"));
	ТаблицаТоваров.ЗаполнитьЗначения(0, "ДоступноЗакрыть");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Поставки.Номенклатура КАК Номенклатура,
	|	Поставки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	СУММА(Поставки.Количество * Поставки.Коэффициент) КАК Количество
	|ИЗ
	|	Документ.ПоступлениеТоваров.РаспределениеПоставки КАК Поставки
	|ГДЕ
	|	Поставки.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	Поставки.Номенклатура,
	|	Поставки.ЗаказПоставщику
	|ИМЕЮЩИЕ
	|	СУММА(Поставки.Количество) > 0
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Номенклатура", Выборка.Номенклатура);
		
		КоличествоРаспределить = Выборка.Количество;
		Если КоличествоРаспределить = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = ТаблицаТоваров.НайтиСтроки(СтруктураОтбора);
		Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			
			Если КоличествоРаспределить = 0 Тогда
				Прервать;
			КонецЕсли;
			
			НеРаспределено = ТекущаяСтрока.Количество - ТекущаяСтрока.ДоступноЗакрыть;
			
			Если НеРаспределено <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			КоличествоСтроки = Мин(КоличествоРаспределить, НеРаспределено);
			
			ТекущаяСтрока.ЗаказПоставщику      = Выборка.ЗаказПоставщику;
			ТекущаяСтрока.ДоступноЗакрыть = ТекущаяСтрока.ДоступноЗакрыть + КоличествоСтроки;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Определяет заказы поставщикам доступные к закрытию при оприходовании товаров.
//
// Параметры:
//  Документ - ДокументОбъект - Документ выполняющий закрытие заказов.
//  ЗакрытыеРаспределения - ТаблицаЗначений - Распределения по заказам покупателей закрытые документом.
//  ЗакрытиеЗаказовПоПодразделению - Булево, Неопределено - Признак закрытия заказов только по 
//                                                          подразделению документа и подчиненным.
//    Если Неопределено то будет получено из значения соответствующей учетной политики.
//  ЗакрытиеЗаказовПоОрганизации - ТаблицаЗначений - Признак закрытия заказов только по организации документа.
//    Если Неопределено то будет получено из значения соответствующей учетной политики.
//
// Возвращаемое значение:
//   РезультатЗапроса - результат выполнения запроса, содержащий заказы поставщикам,
//                      доступные к закрытию при оприходовании товаров.
//
Функция ЗаказыПоставщикамКЗакрытию(ЗакрытыеРаспределения, ОсновнойЗаказ)
	
	РежимПроведения = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеСвойства, "РежимПроведения", РежимПроведенияДокумента.Оперативный);
	Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
		Момент = МоментВремени();
	Иначе
		Момент = Неопределено;
	КонецЕсли;
	
	ЗакрытиеЗаказовПоОрганизации = ПолучитьЗначениеУчетнойПолитики("ЗакрытиеЗаказовПоОрганизации",, Дата);
	ЗакрытиеЗаказовПоПодразделению = ПолучитьЗначениеУчетнойПолитики("ЗакрытиеЗаказовПоПодразделению", ПодразделениеКомпании, Дата);
	
	Запрос = Новый Запрос;
	Отборы = Новый Массив;
	
	Если ЗакрытиеЗаказовПоОрганизации Тогда
		Отборы.Добавить("И ЗаказыПоставщикамОстатки.ЗаказПоставщику.Организация = &Организация");
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	
	Если ЗакрытиеЗаказовПоПодразделению Тогда
		Отборы.Добавить("И ЗаказыПоставщикамОстатки.ЗаказПоставщику.ПодразделениеКомпании В ИЕРАРХИИ(&ПодразделениеКомпании)");
		Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	КонецЕсли;
	
	ТекстОтбора = "";
	Если Отборы.Количество() > 0 Тогда
		ТекстОтбора = СтрСоединить(Отборы, Символы.ПС);
	КонецЕсли;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТабЗакрытыхРаспределений.ЗаказПоставщика КАК ЗаказПоставщика,
	|	ТабЗакрытыхРаспределений.Номенклатура КАК Номенклатура,
	|	ТабЗакрытыхРаспределений.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабЗакрытыхРаспределений.Количество КАК Количество
	|ПОМЕСТИТЬ
	|	ВремТаблицаЗакрытыхРаспределений
	|ИЗ
	|	&ТабЗакрытыхРаспределений КАК ТабЗакрытыхРаспределений
	|;
	|
	|ВЫБРАТЬ
	|	ТабЗакрытыхРаспределений.ЗаказПоставщика КАК ЗаказПоставщика,
	|	ТабЗакрытыхРаспределений.Номенклатура КАК Номенклатура,
	|	ТабЗакрытыхРаспределений.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ТабЗакрытыхРаспределений.Количество) КАК Количество
	|ПОМЕСТИТЬ
	|	ТаблицаЗакрытыхРаспределений
	|ИЗ
	|	ВремТаблицаЗакрытыхРаспределений КАК ТабЗакрытыхРаспределений
	|СГРУППИРОВАТЬ ПО
	|	ТабЗакрытыхРаспределений.ЗаказПоставщика,
	|	ТабЗакрытыхРаспределений.Номенклатура,
	|	ТабЗакрытыхРаспределений.ХарактеристикаНоменклатуры
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ТаблицаЗакрытыхРаспределений.ЗаказПоставщика ЕСТЬ NULL ТОГДА
	|			0
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ КАК ЗаказРаспределение,
	|	ЗаказыПоставщикамОстатки.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ЗаказыПоставщикамОстатки.ЗаказПоставщику=&ЗаказОснование ТОГДА
	|			0
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ КАК ЗаказОснование,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов КАК ВалютаДоговора,
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА ЗаказыПоставщикамОстатки.ЗаказаноОстаток = 0 ТОГДА
	|			ЗаказыПоставщикамОстатки.СуммаОстаток
	|		КОГДА (ЕСТЬNULL(ЗаказыРаспределениеОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТаблицаЗакрытыхРаспределений.Количество, 0)) = 0 ТОГДА
	|			ЗаказыПоставщикамОстатки.СуммаОстаток
	|		ИНАЧЕ
	|			(ЗаказыПоставщикамОстатки.СуммаОстаток/ЗаказыПоставщикамОстатки.ЗаказаноОстаток)*(ЗаказыПоставщикамОстатки.ЗаказаноОстаток - (ЕСТЬNULL(ЗаказыРаспределениеОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТаблицаЗакрытыхРаспределений.Количество, 0)))
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЗаказыПоставщикамОстатки.ЗаказаноОстаток = 0 ТОГДА
	|			ЗаказыПоставщикамОстатки.СуммаУпрОстаток
	|		КОГДА (ЕСТЬNULL(ЗаказыРаспределениеОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТаблицаЗакрытыхРаспределений.Количество, 0)) = 0 ТОГДА
	|			ЗаказыПоставщикамОстатки.СуммаУпрОстаток
	|		ИНАЧЕ
	|			(ЗаказыПоставщикамОстатки.СуммаУпрОстаток/ЗаказыПоставщикамОстатки.ЗаказаноОстаток)*(ЗаказыПоставщикамОстатки.ЗаказаноОстаток - (ЕСТЬNULL(ЗаказыРаспределениеОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТаблицаЗакрытыхРаспределений.Количество, 0)))
	|	КОНЕЦ КАК СуммаУпр,
	|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток - (ЕСТЬNULL(ЗаказыРаспределениеОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТаблицаЗакрытыхРаспределений.Количество, 0)) КАК Заказано,
	|	0 КАК Получено
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&Момент,
	|		ЗаказПоставщику В (&ЗаказыПоставщику)
	|		//И Номенклатура В (&Номенклатура)
	|		//И ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры)
	|		И Контрагент=&Контрагент
	|	) КАК ЗаказыПоставщикамОстатки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТаблицаЗакрытыхРаспределений КАК ТаблицаЗакрытыхРаспределений
	|ПО
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику              = ТаблицаЗакрытыхРаспределений.ЗаказПоставщика
	|	И ЗаказыПоставщикамОстатки.Номенклатура               = ТаблицаЗакрытыхРаспределений.Номенклатура
	|	И ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры = ТаблицаЗакрытыхРаспределений.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ЗаказыРаспределение.Остатки(&Момент, 
	|	Номенклатура В (&Номенклатура)
	|	И ЗаказПоставщика В (&ЗаказыПоставщику)
	|	И ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры)
	|	) КАК ЗаказыРаспределениеОстатки
	|ПО
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику            = ЗаказыРаспределениеОстатки.ЗаказПоставщика
	|	И ЗаказыПоставщикамОстатки.Номенклатура               = ЗаказыРаспределениеОстатки.Номенклатура
	|	И ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры = ЗаказыРаспределениеОстатки.ХарактеристикаНоменклатуры
	|ГДЕ
	|	(ЗаказыПоставщикамОстатки.ЗаказаноОстаток - (ЕСТЬNULL(ЗаказыРаспределениеОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТаблицаЗакрытыхРаспределений.Количество, 0))) <> 0
	|	%1
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА ТаблицаЗакрытыхРаспределений.ЗаказПоставщика ЕСТЬ NULL ТОГДА
	|			0
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ Убыв,
	|	ВЫБОР
	|		КОГДА ЗаказыПоставщикамОстатки.ЗаказПоставщику=&ЗаказОснование ТОГДА
	|			0
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ ВОЗР,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата,
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры.Сортировка ВОЗР
	|";
	
	ХарактеристикаНоменклатуры = Товары.ВыгрузитьКолонку("ХарактеристикаНоменклатуры");
	ХарактеристикаНоменклатуры.Добавить(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	
	Запрос.Текст = СтрШаблон(Запрос.Текст, ТекстОтбора);
	Запрос.УстановитьПараметр("ТабЗакрытыхРаспределений", ЗакрытыеРаспределения);
	Запрос.УстановитьПараметр("Момент", Момент);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ЗаказОснование", ОсновнойЗаказ);
	Запрос.УстановитьПараметр("ЗаказыПоставщику", РаспределениеПоставки.ВыгрузитьКолонку("ЗаказПоставщику"));
	Запрос.УстановитьПараметр("Номенклатура", Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	
	Возврат Запрос.Выполнить();
	
КонецФункции // ЗаказыПоставщикамКЗакрытию()

// Накладывает блокировку на регистр заказы поставщиков.
//
Процедура ЗаблокироватьЗаказыПоставщикам()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ
	|	СтрокиДокумента
	|ИЗ
	|	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	|ГДЕ
	|	ПоступлениеТоваровТовары.Ссылка = &Документ
	|	И ПоступлениеТоваровТовары.Количество > 0
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаспределениеПоставки.ЗаказПоставщику КАК ЗаказПоставщику
	|ПОМЕСТИТЬ
	|	РаспределениеПоставки
	|ИЗ
	|	Документ.ПоступлениеТоваров.РаспределениеПоставки КАК РаспределениеПоставки
	|ГДЕ
	|	РаспределениеПоставки.Ссылка = &Документ
	|;
	|
	|ВЫБРАТЬ
	|	СтрокиДокумента.Номенклатура КАК Номенклатура,
	|	СтрокиДокумента.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(РаспределениеПоставки.ЗаказПоставщику, ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)) КАК ЗаказПоставщику
	|ИЗ
	|	СтрокиДокумента КАК СтрокиДокумента
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РаспределениеПоставки КАК РаспределениеПоставки
	|ПО
	|	ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтрокиДокумента.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	ЕСТЬNULL(РаспределениеПоставки.ЗаказПоставщику, ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка))
	|ИЗ
	|	СтрокиДокумента КАК СтрокиДокумента
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РаспределениеПоставки КАК РаспределениеПоставки
	|ПО
	|	ИСТИНА
	|");
	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	ЗначенияБлокировки = Новый Соответствие;
	ЗначенияБлокировки.Вставить("Период", Новый Диапазон(, Дата));
	ЗначенияБлокировки.Вставить("Контрагент", Контрагент);
	
	СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы,ИмяТаблицы", "РегистрНакопления", "ЗаказыПоставщикам");
	СтруктураПараметровБлокировки.Вставить("ИсточникДанных", Запрос.Выполнить().Выгрузить());
	
	ОписаниеИсточника = Новый Соответствие;
	ОписаниеИсточника.Вставить("Номенклатура", "Номенклатура");
	ОписаниеИсточника.Вставить("ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры");
	
	ОбработкаСобытийДокументаСервер.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки, ОписаниеИсточника);
	
КонецПроцедуры // ЗаблокироватьЗаказыПоставщикам()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Приходный складской ордер".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПриходныйСкладскойОрдер(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Заполняем специфические для данной операции реквизиты.
	Если ЗначениеЗаполнено(ДанныеЗаполнения.ВладелецТовара) 
		И ТипЗнч(ДанныеЗаполнения.ВладелецТовара)=Тип("СправочникСсылка.Контрагенты") Тогда
		
		Контрагент = ДанныеЗаполнения.ВладелецТовара;
		Документы.ПоступлениеТоваров.КонтрагентПриИзменении(ЭтотОбъект,ДополнительныеСвойства.ПараметрыДействия);
	КонецЕсли;
	
	Для Каждого СтрокаТабличнойЧасти Из Товары Цикл
		Документы.ПоступлениеТоваров.ТоварыНоменклатураПриИзменении(ЭтотОбъект, СтрокаТабличнойЧасти,
																		ДополнительныеСвойства.ПараметрыДействия);
		СтрокаТабличнойЧасти.КоличествоПоНакладной = СтрокаТабличнойЧасти.Количество;
	КонецЦикла;
	
	ВхДокНомер = ДанныеЗаполнения.Номер;
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПриходныйСкладскойОрдер()

// Производит заполнение объекта на основании документа "Заказ поставщику".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ЗаказПоставщику(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, 
			СтандартнаяОбработка) Тогда
			
		Возврат ИСТИНА;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток КАК ЗаказаноОстаток,
	|	ЗаказыПоставщикамОстатки.СуммаОстаток КАК Сумма,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.Количество * ЗаказПоставщикуТовары.Коэффициент, 1) КАК КоличествоБазовое,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.ЕдиницаИзмерения, Значение(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.Коэффициент, 1) КАК Коэффициент,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.СтавкаНДС, ЗаказыПоставщикамОстатки.Номенклатура.СтавкаНДС) КАК СтавкаНДС,
	|	ЕСТЬNULL(ЗаказПоставщикуТовары.НомерСтроки, 1000000) КАК НомерСтроки
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|				&Момент,
	|				ЗаказПоставщику = &ВыбЗаказПоставщику
	|					И Контрагент = &ВыбКонтрагент) КАК ЗаказыПоставщикамОстатки
	|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ПО ЗаказыПоставщикамОстатки.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка
	|		 И ЗаказыПоставщикамОстатки.Номенклатура = ЗаказПоставщикуТовары.Номенклатура
	|		 И ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры = ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(КоличествоБазовое),
	|	МАКСИМУМ(ЗаказаноОстаток),
	|	МАКСИМУМ(Сумма)
	|ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Момент",             Новый МоментВремени(КонецДня(Дата)));
	Запрос.УстановитьПараметр("ВыбКонтрагент",      Контрагент);
	Запрос.УстановитьПараметр("ВыбЗаказПоставщику", ДокументОснование);
	
	// Нужные только скорректированные позиции.
	Товары.Очистить();
	
	ВалютаЗаказа   = ДанныеЗаполнения.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаЗаказа,Дата);
	КурсЗаказа     = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	
	ВыборкаНоменклатуры = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		ВыборкаХарактеристик = ВыборкаНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаХарактеристик.Следующий() Цикл
			ВсегоОсталось = ВыборкаХарактеристик.ЗаказаноОстаток;
			КоличествоБазовоеПоЗаказу = ВыборкаХарактеристик.КоличествоБазовое;
			СуммаОсталось = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ВыборкаХарактеристик.Сумма, ВалютаЗаказа, КурсЗаказа, 
								ВалютаДокумента, КурсДокумента);
			ВыборкаДетали = ВыборкаХарактеристик.Выбрать(ОбходРезультатаЗапроса.Прямой);
			НоваяСтрока   = Неопределено;
			Пока ВыборкаДетали.Следующий() Цикл
				Если ВсегоОсталось=0 Тогда
					Прервать;
				КонецЕсли;
				Если ВыборкаДетали.ЗаказаноОстаток = 0 Тогда
					Продолжить;
				КонецЕсли;
				Если КоличествоБазовоеПоЗаказу = 1 Тогда
					КоличествоСтроки = ВыборкаДетали.ЗаказаноОстаток;
				Иначе
					КоличествоСтроки = ВыборкаДетали.ЗаказаноОстаток*(ВыборкаДетали.КоличествоБазовое/КоличествоБазовоеПоЗаказу);
				КонецЕсли;
				ТекущееКоличество = Мин(ВсегоОсталось, КоличествоСтроки);
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура               = ВыборкаДетали.Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры = ВыборкаДетали.ХарактеристикаНоменклатуры;
				НоваяСтрока.ЕдиницаИзмерения           = ВыборкаДетали.ЕдиницаИзмерения;
				НоваяСтрока.Коэффициент                = ВыборкаДетали.Коэффициент;
				Документы.ПоступлениеТоваров.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока,
																				ДополнительныеСвойства.ПараметрыДействия);
				НоваяСтрока.СтавкаНДС                  = ВыборкаДетали.СтавкаНДС;
				НоваяСтрока.Количество                 = ТекущееКоличество/?(НЕ ЗначениеЗаполнено(НоваяСтрока.Коэффициент),1,НоваяСтрока.Коэффициент);
				НоваяСтрока.КоличествоБазовое          = ТекущееКоличество;
				НоваяСтрока.КоличествоПоНакладной      = НоваяСтрока.Количество; 
				
				ТекСумма = СуммаОсталось/ВсегоОсталось*ТекущееКоличество;
				
				СуммаОсталось = СуммаОсталось - ТекСумма;
				НоваяСтрока.СуммаВсего = ТекСумма;
				Документы.ПоступлениеТоваров.ТоварыСуммаВсегоПриИзменении(ЭтотОбъект, НоваяСтрока,
																				ДополнительныеСвойства.ПараметрыДействия);
				
				ВсегоОсталось = ВсегоОсталось - ТекущееКоличество;
			КонецЦикла;
			Если ВсегоОсталось>0 ИЛИ СуммаОсталось>0 Тогда
				Если НЕ НоваяСтрока = Неопределено Тогда
					НоваяСтрока.Количество        = НоваяСтрока.Количество + (ВсегоОсталось/НоваяСтрока.Коэффициент);
					НоваяСтрока.КоличествоПоНакладной = НоваяСтрока.Количество;
					НоваяСтрока.КоличествоБазовое = НоваяСтрока.КоличествоБазовое + ВсегоОсталось;
					Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(ЭтотОбъект, НоваяСтрока,
																				ДополнительныеСвойства.ПараметрыДействия);
					НоваяСтрока.СуммаВсего        = НоваяСтрока.СуммаВсего + СуммаОсталось;
					
					Документы.ПоступлениеТоваров.ТоварыСуммаВсегоПриИзменении(ЭтотОбъект, НоваяСтрока,
																				ДополнительныеСвойства.ПараметрыДействия);
				ИначеЕсли ВсегоОсталось>0 Тогда
					НоваяСтрока=Товары.Добавить();
					НоваяСтрока.Номенклатура               = ВыборкаХарактеристик.Номенклатура;
					НоваяСтрока.ХарактеристикаНоменклатуры = ВыборкаХарактеристик.ХарактеристикаНоменклатуры;
					Документы.ПоступлениеТоваров.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока,
																				ДополнительныеСвойства.ПараметрыДействия);
					НоваяСтрока.СтавкаНДС                  = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
					НоваяСтрока.Количество                 = ВсегоОсталось/НоваяСтрока.Коэффициент;
					НоваяСтрока.КоличествоПоНакладной      = НоваяСтрока.Количество;
					НоваяСтрока.КоличествоБазовое          = ВсегоОсталось;
					Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(ЭтотОбъект, НоваяСтрока,
																				ДополнительныеСвойства.ПараметрыДействия);
					НоваяСтрока.СуммаВсего                 = СуммаОсталось;
					
					Документы.ПоступлениеТоваров.ТоварыСуммаВсегоПриИзменении(ЭтотОбъект, НоваяСтрока,
																				ДополнительныеСвойства.ПараметрыДействия);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	НоваяСтрока = РаспределениеПоставки.Добавить();
	НоваяСтрока.ЗаказПоставщику = ДанныеЗаполнения;
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ЗаказПоставщику()

// Производит заполнение объекта на основании документа "Предварительное поступление товаров".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПредварительноеПоступлениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, 
			СтандартнаяОбработка) Тогда
			
		Возврат ИСТИНА;
	КонецЕсли;
	
	// проверим ранее введенные поступления по этому предварительному поступлению
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПоступлениеТоваров.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	                      |ГДЕ
	                      |	ПоступлениеТоваров.ДокументОснование = &ДокументОснование
	                      |	И НЕ ПоступлениеТоваров.ПометкаУдаления");
	Запрос.УстановитьПараметр("ДокументОснование",ДанныеЗаполнения);
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		// очистим весь документ
		Товары.Очистить();
		Возврат ИСТИНА;
	КонецЕсли;
	
	ЗакрытиеЗаказовПоставщикам = 1;
	МассивЗаказов = Новый Массив;
	Для Каждого ТекСтрокаЗаказы Из ДанныеЗаполнения.Заказы Цикл
		МассивЗаказов.Добавить(ТекСтрокаЗаказы.ЗаказПоставщику);
		НоваяСтрока = РаспределениеПоставки.Добавить();
		НоваяСтрока.ЗаказПоставщику = ТекСтрокаЗаказы.ЗаказПоставщику;
	КонецЦикла;	
	
	// Очистим табличную часть "Товары".
	Товары.Очистить();
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПредварительноеПоступлениеТоваровТовары.Номенклатура КАК Номенклатура,
	               |	ПредварительноеПоступлениеТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ПредварительноеПоступлениеТоваровТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ПредварительноеПоступлениеТоваровТовары.Количество КАК Количество,
	               |	ПредварительноеПоступлениеТоваровТовары.СтавкаНДС КАК СтавкаНДС,
	               |	ПредварительноеПоступлениеТоваровТовары.СуммаВсего КАК СуммаВсего
	               |ИЗ
	               |	Документ.ПредварительноеПоступлениеТоваров.Товары КАК ПредварительноеПоступлениеТоваровТовары
	               |ГДЕ
	               |	ПредварительноеПоступлениеТоваровТовары.Ссылка = &Ссылка";
	Запрос=Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура               = Выборка.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		Документы.ПоступлениеТоваров.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока,ДополнительныеСвойства.ПараметрыДействия);
		НоваяСтрока.СтавкаНДС = Выборка.СтавкаНДС;
		НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
		НоваяСтрока.Количество                 = Выборка.Количество;
		НоваяСтрока.КоличествоПоНакладной      = Выборка.Количество;
		Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(ЭтотОбъект, НоваяСтрока,ДополнительныеСвойства.ПараметрыДействия);
		НоваяСтрока.СуммаВсего = Выборка.СуммаВсего;
		Документы.ПоступлениеТоваров.ТоварыСуммаВсегоПриИзменении(ЭтотОбъект, НоваяСтрока,ДополнительныеСвойства.ПараметрыДействия);
	КонецЦикла;
	
	//// по ТЗ от DP-Trade не будем пересчитывать таблицу товаров по остаткам заказов.
	//ТекстЗапроса =
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	//|	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток КАК ЗаказаноОстаток,
	//|	ЗаказыПоставщикамОстатки.СуммаОстаток КАК Сумма,
	//|	ЕСТЬNULL(ЗаказПоставщикуТовары.Количество * ЗаказПоставщикуТовары.Коэффициент, 1) КАК КоличествоБазовое,
	//|	ЕСТЬNULL(ЗаказПоставщикуТовары.ЕдиницаИзмерения, Значение(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	//|	ЕСТЬNULL(ЗаказПоставщикуТовары.Коэффициент, 1) КАК Коэффициент,
	//|	ЕСТЬNULL(ЗаказПоставщикуТовары.СтавкаНДС, ЗаказыПоставщикамОстатки.Номенклатура.СтавкаНДС) КАК СтавкаНДС,
	//|	ЕСТЬNULL(ЗаказПоставщикуТовары.НомерСтроки, 1000000) КАК НомерСтроки
	//|ИЗ
	//|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	//|				&Момент,
	//|				ЗаказПоставщику В(&МассивЗаказов)
	//|					И Контрагент = &ВыбКонтрагент) КАК ЗаказыПоставщикамОстатки
	//|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	//|		ПО ЗаказыПоставщикамОстатки.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка
	//|		 И ЗаказыПоставщикамОстатки.Номенклатура = ЗаказПоставщикуТовары.Номенклатура
	//|		 И ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры = ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	НомерСтроки
	//|ИТОГИ
	//|	СУММА(КоличествоБазовое),
	//|	МАКСИМУМ(ЗаказаноОстаток),
	//|	МАКСИМУМ(Сумма)
	//|ПО
	//|	Номенклатура,
	//|	ХарактеристикаНоменклатуры";
	//
	//Запрос = Новый Запрос(ТекстЗапроса);
	//Запрос.УстановитьПараметр("Момент",             Новый МоментВремени(КонецДня(Дата)));
	//Запрос.УстановитьПараметр("ВыбКонтрагент",      Контрагент);
	//Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	//
	//// Нужные только скорректированные позиции.
	//Товары.Очистить();
	//
	//ВалютаЗаказа   = ДанныеЗаполнения.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
	//СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаЗаказа,Дата);
	//КурсЗаказа     = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	//
	//ВыборкаНоменклатуры = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Пока ВыборкаНоменклатуры.Следующий() Цикл
	//	ВыборкаХарактеристик = ВыборкаНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	Пока ВыборкаХарактеристик.Следующий() Цикл
	//		ВсегоОсталось = ВыборкаХарактеристик.ЗаказаноОстаток;
	//		КоличествоБазовоеПоЗаказу = ВыборкаХарактеристик.КоличествоБазовое;
	//		СуммаОсталось = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ВыборкаХарактеристик.Сумма, ВалютаЗаказа, КурсЗаказа, 
	//							ВалютаДокумента, КурсДокумента);
	//		ВыборкаДетали = ВыборкаХарактеристик.Выбрать(ОбходРезультатаЗапроса.Прямой);
	//		НоваяСтрока   = Неопределено;
	//		Пока ВыборкаДетали.Следующий() Цикл
	//			Если ВсегоОсталось=0 Тогда
	//				Прервать;
	//			КонецЕсли;
	//			Если ВыборкаДетали.ЗаказаноОстаток = 0 Тогда
	//				Продолжить;
	//			КонецЕсли;
	//			Если КоличествоБазовоеПоЗаказу = 1 Тогда
	//				КоличествоСтроки = ВыборкаДетали.ЗаказаноОстаток;
	//			Иначе
	//				КоличествоСтроки = ВыборкаДетали.ЗаказаноОстаток*(ВыборкаДетали.КоличествоБазовое/КоличествоБазовоеПоЗаказу);
	//			КонецЕсли;
	//			ТекущееКоличество = Мин(ВсегоОсталось, КоличествоСтроки);
	//			НоваяСтрока = Товары.Добавить();
	//			НоваяСтрока.Номенклатура               = ВыборкаДетали.Номенклатура;
	//			НоваяСтрока.ХарактеристикаНоменклатуры = ВыборкаДетали.ХарактеристикаНоменклатуры;
	//			НоваяСтрока.ЕдиницаИзмерения           = ВыборкаДетали.ЕдиницаИзмерения;
	//			НоваяСтрока.Коэффициент                = ВыборкаДетали.Коэффициент;
	//			Документы.ПоступлениеТоваров.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока,
	//																			ДополнительныеСвойства.ПараметрыДействия);
	//			НоваяСтрока.СтавкаНДС                  = ВыборкаДетали.СтавкаНДС;
	//			НоваяСтрока.Количество                 = ТекущееКоличество/?(НЕ ЗначениеЗаполнено(НоваяСтрока.Коэффициент),1,НоваяСтрока.Коэффициент);
	//			НоваяСтрока.КоличествоБазовое          = ТекущееКоличество;
	//			НоваяСтрока.КоличествоПоНакладной      = НоваяСтрока.Количество; 
	//			
	//			ТекСумма = СуммаОсталось/ВсегоОсталось*ТекущееКоличество;
	//			
	//			СуммаОсталось = СуммаОсталось - ТекСумма;
	//			НоваяСтрока.СуммаВсего = ТекСумма;
	//			Документы.ПоступлениеТоваров.ТоварыСуммаВсегоПриИзменении(ЭтотОбъект, НоваяСтрока,
	//																			ДополнительныеСвойства.ПараметрыДействия);
	//			
	//			ВсегоОсталось = ВсегоОсталось - ТекущееКоличество;
	//		КонецЦикла;
	//		Если ВсегоОсталось>0 ИЛИ СуммаОсталось>0 Тогда
	//			Если НЕ НоваяСтрока = Неопределено Тогда
	//				НоваяСтрока.Количество        = НоваяСтрока.Количество + (ВсегоОсталось/НоваяСтрока.Коэффициент);
	//				НоваяСтрока.КоличествоПоНакладной = НоваяСтрока.Количество;
	//				НоваяСтрока.КоличествоБазовое = НоваяСтрока.КоличествоБазовое + ВсегоОсталось;
	//				Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(ЭтотОбъект, НоваяСтрока,
	//																			ДополнительныеСвойства.ПараметрыДействия);
	//				НоваяСтрока.СуммаВсего        = НоваяСтрока.СуммаВсего + СуммаОсталось;
	//			ИначеЕсли ВсегоОсталось>0 Тогда
	//				НоваяСтрока=Товары.Добавить();
	//				НоваяСтрока.Номенклатура               = ВыборкаХарактеристик.Номенклатура;
	//				НоваяСтрока.ХарактеристикаНоменклатуры = ВыборкаХарактеристик.ХарактеристикаНоменклатуры;
	//				Документы.ПоступлениеТоваров.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока,
	//																			ДополнительныеСвойства.ПараметрыДействия);
	//				НоваяСтрока.СтавкаНДС                  = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	//				НоваяСтрока.Количество                 = ВсегоОсталось/НоваяСтрока.Коэффициент;
	//				НоваяСтрока.КоличествоПоНакладной      = НоваяСтрока.Количество;
	//				НоваяСтрока.КоличествоБазовое          = ВсегоОсталось;
	//				Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(ЭтотОбъект, НоваяСтрока,
	//																			ДополнительныеСвойства.ПараметрыДействия);
	//				НоваяСтрока.СуммаВсего                 = СуммаОсталось;
	//			КонецЕсли;
	//			Документы.ПоступлениеТоваров.ТоварыСуммаВсегоПриИзменении(ЭтотОбъект, НоваяСтрока,
	//																			ДополнительныеСвойства.ПараметрыДействия);
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЦикла;
	
	//// это алгоритм DP-Trade, вместо него попробуем использовать типовой "Не закрывать"
	//
	//ЗакрытиеЗаказовПоставщикам = 0;
	//НаДату = ?(ЭтоНовый(), КонецДня(ТекущаяДата()), МоментВремени());
	//ТекстЗапроса = "ВЫБРАТЬ
	//               |	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	//               |	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	//               |	СУММА(ЗаказыПоставщикамОстатки.ЗаказаноОстаток) КАК ЗаказаноОстаток
	//               |ИЗ
	//               |	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	//               |		&Момент,
	//               |		Номенклатура В (&Номенклатура)
	//               |		    И 
	//			   |		    ВЫБОР
	//               |		        КОГДА &ЕстьОтборПоЗаказам
	//               |		            ТОГДА ЗаказПоставщику В (&МассивЗаказов)
	//               |		        ИНАЧЕ ИСТИНА
	//               |		    КОНЕЦ) КАК ЗаказыПоставщикамОстатки
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ЗаказыПоставщикамОстатки.Номенклатура,
	//               |	ЗаказыПоставщикамОстатки.ЗаказПоставщику
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	Номенклатура,
	//               |	ЗаказПоставщику
	//               |АВТОУПОРЯДОЧИВАНИЕ";
	//Запрос = Новый Запрос(ТекстЗапроса);
	//Запрос.УстановитьПараметр("Момент", НаДату);
	//Запрос.УстановитьПараметр("Номенклатура",Товары.ВыгрузитьКолонку("Номенклатура"));
	//Запрос.УстановитьПараметр("МассивЗаказов",МассивЗаказов);
	//Запрос.УстановитьПараметр("ЕстьОтборПоЗаказам",МассивЗаказов.Количество()<>0);
	//НезаказанныеТовары = Запрос.Выполнить().Выгрузить();
	//
	//ТаблицаТовары = Товары.Выгрузить();
	//ТаблицаТовары.Свернуть("Номенклатура", "Количество");
	//
	//Для Каждого ТекСтрокаТовары Из ТаблицаТовары Цикл
	//	
	//	Отбор = Новый Структура("Номенклатура", ТекСтрокаТовары.Номенклатура);
	//	НайденныеСтрокиРаспределениеПоставки = НезаказанныеТовары.НайтиСтроки(Отбор);
	//	УжеРаспределено = 0;
	//	Для Каждого ТекСтрокаНСРП Из НайденныеСтрокиРаспределениеПоставки Цикл
	//		
	//		НужноРаспределить = ТекСтрокаНСРП.ЗаказаноОстаток;
	//		ТоварыКоличество  = ТекСтрокаТовары.Количество;
	//		МожноРаспределить = Мин(НужноРаспределить, ТоварыКоличество - УжеРаспределено);
	//		Если МожноРаспределить <= 0 Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		НайденныйТовар = Товары.Найти(ТекСтрокаТовары.Номенклатура);
	//				
	//		НоваяСтрока = РаспределениеПоставки.Добавить();
	//		НоваяСтрока.Номенклатура		= ТекСтрокаТовары.Номенклатура;
	//		НоваяСтрока.ЕдиницаИзмерения	= НайденныйТовар.ЕдиницаИзмерения;
	//		НоваяСтрока.Коэффициент			= НайденныйТовар.Коэффициент;
	//		НоваяСтрока.Количество			= МожноРаспределить;
	//		НоваяСтрока.ЗаказПоставщику		= ТекСтрокаНСРП.ЗаказПоставщику;
	//		УжеРаспределено = УжеРаспределено + МожноРаспределить;
	//		
	//	КонецЦикла;
	//КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ЗаказПоставщику()

// Производит заполнение объекта на основании документа "Реализация товаров".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_РеализацияТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Способ ведения не по организации или не прошла предыдущая проверка, то и проверять ничего не будем.
	Если БалансВедетсяПоОрганизациям(ТекущаяДатаСеанса()) Тогда
		Организация           = ПараметрыСеанса.Организация;
		ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
		СкладКомпании         = ПравоПользователя("ОсновнойСкладКомпании", ЭтотОбъект);
		Контрагент            = ПравоПользователя("ОсновнойПоставщик", ЭтотОбъект);
		ДоговорВзаиморасчетов = ОбработкаРеквизитовДокументаСервер.ПолучитьДоговорВзаиморасчетов(Контрагент, Перечисления.ВидыДоговоров.Покупка,ЭтотОбъект,ДополнительныеСвойства.ПараметрыДействия);
		Документы.ПоступлениеТоваров.ДоговорВзаиморасчетовПриИзменении(ЭтотОбъект,ДополнительныеСвойства.ПараметрыДействия);
	КонецЕсли;
	
	// Заполним количеств по накладной.
	Для Каждого ТекСтрока Из Товары Цикл
		ТекСтрока.КоличествоПоНакладной = ТекСтрока.Количество;
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_РеализацияТоваров()

// Производит заполнение объекта на основании документа "Корректировка заказа поставщику".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_КорректировкаЗаказаПоставщику(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Заполняем специфические для данной операции реквизиты.
	ДоговорВзаиморасчетов = ДанныеЗаполнения.ДокументОснование.ДоговорВзаиморасчетов;
	
	// Очистим табличную часть "Товары".
	Товары.Очистить();
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры,
	|	СУММА(ЗаказыПоставщикамОстатки.ЗаказаноОстаток) КАК ЗаказаноОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|		&Момент,
	|		ЗаказПоставщику = &ВыбЗаказПоставщику
	|			И Контрагент = &ВыбКонтрагент) КАК ЗаказыПоставщикамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры";
	Запрос=Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Момент", Новый МоментВремени(КонецДня(Дата)));
	Запрос.УстановитьПараметр("ВыбКонтрагент", Контрагент);
	Запрос.УстановитьПараметр("ВыбЗаказПоставщику", ДанныеЗаполнения.ДокументОснование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура               = Выборка.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		Документы.ПоступлениеТоваров.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока,ДополнительныеСвойства.ПараметрыДействия);
		НоваяСтрока.Количество                 = Выборка.ЗаказаноОстаток;
		НоваяСтрока.КоличествоПоНакладной      = НоваяСтрока.Количество;
		Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(ЭтотОбъект, НоваяСтрока,ДополнительныеСвойства.ПараметрыДействия);
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_КорректировкаЗаказаПоставщику()

// Производит заполнение объекта на основании документа "Товарно-транспортная накладная ЕГАИС (входящая)".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ТоварноТранспортнаяНакладнаяВходящаяЕГАИС(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.Хозоперация = Справочники.ХозОперации.ТТНПоступлениеТоваровЕГАИС Тогда
		ТекстСообщения = НСтр("ru='Поступление товаров вводится только для товарно-транспортной накладной с операцией ""Поступление товаров ЕГАИС"".'");
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ДанныеЗаполнения, ТекстСообщения);
		Возврат ЛОЖЬ;
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПодчиненныеДокументы.Ссылка КАК Документ
		|ИЗ
		|	КритерийОтбора.ПодчиненныеДокументы(&Основание) КАК ПодчиненныеДокументы
		|ГДЕ
		|	ПодчиненныеДокументы.Ссылка ССЫЛКА Документ.ПоступлениеТоваров";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Основание",ДанныеЗаполнения);
		Выборка = Запрос.Выполнить().Выгрузить();
		
		Если Выборка.Количество() > 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='На основании документа <%1> уже введен <%2>.'"),ДанныеЗаполнения,Выборка[0].Документ);
			УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(Выборка[0].Документ, ТекстСообщения);
			Возврат ЛОЖЬ;
		КонецЕсли;
	КонецЕсли;
	
	Товары.Очистить();
	Марки.Очистить();
	ТоварноТранспортнаяНакладнаяЕГАИС = ДанныеЗаполнения;
	ЗакрытиеЗаказовПоставщикам = 1;
	
	ИнтеграцияЕГАИС.ЗаполнитьДокументПоВходящейТТН(ЭтотОбъект, ТоварноТранспортнаяНакладнаяЕГАИС);
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ТоварноТранспортнаяНакладнаяВходящаяЕГАИС()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

// Формирует движения документа по партионным регистрам.
//
// Параметры:
//  Режим           - режим проведения (оперативный/неоперативный)
//  ДокументСсылка  - ссылка на документ который надо допровести по партиям.
//
// Возвращаемое значение:
//  Возвращает Истина - все ОК, ложь - чего-то не так.
//
Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	Отказ=Ложь;
	
	// Получим шапку документа.
	ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	
	// Посчитаем суммы товаров и услуг.
	Запрос=Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР КОГДА ДокументТовары.Номенклатура.ВидНоменклатуры=&Услуга И ДокументТовары.Номенклатура.СпособРаспределенияДопРасходов=&НаДоходыРасходы ТОГДА &Услуга ИНАЧЕ &Товар КОНЕЦ КАК ВидНоменклатуры,
	|	ВЫБОР КОГДА ДокументТовары.Номенклатура.ВидНоменклатуры=&Услуга ТОГДА ДокументТовары.Номенклатура.СтатьяДопРасходов ИНАЧЕ NULL КОНЕЦ КАК СтатьяДопРасходов,
	|	СУММА(ДокументТовары.СуммаВсего) КАК СуммаВсего
	|ИЗ
	|	Документ.ПоступлениеТоваров.Товары 	КАК ДокументТовары
	|
	|ГДЕ  
	|	ДокументТовары.Ссылка = &ДокументСсылка И ДокументТовары.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО 
	|	ВЫБОР КОГДА ДокументТовары.Номенклатура.ВидНоменклатуры=&Услуга И ДокументТовары.Номенклатура.СпособРаспределенияДопРасходов=&НаДоходыРасходы ТОГДА &Услуга ИНАЧЕ &Товар КОНЕЦ,
	|	ВЫБОР КОГДА ДокументТовары.Номенклатура.ВидНоменклатуры=&Услуга ТОГДА ДокументТовары.Номенклатура.СтатьяДопРасходов ИНАЧЕ NULL КОНЕЦ
	|
	|ИТОГИ ПО ВидНоменклатуры
	|");
	Запрос.УстановитьПараметр("ДокументСсылка",ШапкаДокумента.Ссылка);
	Запрос.УстановитьПараметр("Услуга",Перечисления.ВидыНоменклатуры.Услуга);
	Запрос.УстановитьПараметр("Товар",Перечисления.ВидыНоменклатуры.Товар);
	Запрос.УстановитьПараметр("НаДоходыРасходы",Перечисления.СпособыРаспределенияДопРасходов.НаДоходыИРасходы);
	ДеревоДоходовИРасходов=Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВедетсяБалансПоПодразделению = БалансВедетсяПоПодразделениям(ШапкаДокумента.Дата);
	
	// Проверим, если подразделение проводится по партиям "отложенно", то дальше не идем.
	НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		НайденнаяСтрокаТоваров=ДеревоДоходовИРасходов.Строки.Найти(Перечисления.ВидыНоменклатуры.Товар,"ВидНоменклатуры");
		НайденнаяСтрокаУслуг=ДеревоДоходовИРасходов.Строки.Найти(Перечисления.ВидыНоменклатуры.Услуга,"ВидНоменклатуры");
		Если ШапкаДокумента.ХозОперация<>Справочники.ХозОперации.ПоступлениеТоваровКомиссия 
			И ШапкаДокумента.ХозОперация<>Справочники.ХозОперации.ПоступлениеБезвозмездное
			И (НайденнаяСтрокаТоваров<>Неопределено 
			ИЛИ НайденнаяСтрокаУслуг<>Неопределено) Тогда
			// Доходы и расходы на себестоимость не оприходованных партий
			СуммаВсего=?(НайденнаяСтрокаТоваров<>Неопределено,НайденнаяСтрокаТоваров.СуммаВсего,0)+?(НайденнаяСтрокаУслуг<>Неопределено,НайденнаяСтрокаУслуг.СуммаВсего,0);
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
			// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
			Если ВедетсяБалансПоПодразделению Тогда
				НаборЗаписейДоходыИРасходы.Подразделение = ШапкаДокумента.СкладКомпании.ПодразделениеКомпании;
			КонецЕсли;
			НаборЗаписейДоходыИРасходы.ШапкаДокумента = ШапкаДокумента;
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте = Ложь;
			НаборЗаписейДоходыИРасходы.Расход = СуммаВсего;
			НаборЗаписейДоходыИРасходы.Приход();
		КонецЕсли;
		Возврат НЕ Отказ;
	КонецЕсли;
	
	// Определим необходимость формирования корректирующих проводок.
	
	ПодразделениеСклад = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(СкладКомпании.ПодразделениеКомпании, ШапкаДокумента.Дата);
	ПодразделениеДоговорВзаиморасчетов = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ДоговорВзаиморасчетов.ПодразделениеКомпании, ШапкаДокумента.Дата);
	БалансовыеПодразделенияНеРавны = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеСклад);
	
	НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
	НаборЗаписейПартии.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейПартии.СкладКомпании=ШапкаДокумента.СкладКомпании;
	НаборЗаписейПартии.Организация=ШапкаДокумента.Организация;
	НаборЗаписейПартии.ЕстьСтавкаНДС=Истина;
	Если ШапкаДокумента.ХозОперация=Справочники.ХозОперации.ПоступлениеТоваровКомиссия Тогда
		НаборЗаписейПартии.СтатусПартии=Перечисления.СтатусыПартий.ТоварПринятыйКомиссия;
	Иначе
		НаборЗаписейПартии.СтатусПартии=Перечисления.СтатусыПартий.ТоварКупленный;
	КонецЕсли;
	НаборЗаписейПартии.ПоБазовомуКоличеству=Истина;
	НаборЗаписейПартии.ШапкаДокумента=ШапкаДокумента;	
	НаборЗаписейПартии.РежимДопРасходы	= 1;	
	Отказ=НЕ НаборЗаписейПартии.Приход() ИЛИ Отказ;
	
	// Запишем в ДоходыИРасходы услуги стоимость которых не распределяется на себестоимость поступления.
	НайденнаяСтрокаУслуг=ДеревоДоходовИРасходов.Строки.Найти(Перечисления.ВидыНоменклатуры.Услуга,"ВидНоменклатуры");
	Если НайденнаяСтрокаУслуг<>Неопределено Тогда
		СуммаУслуг = 0;
		Для Каждого СтрокаУслуги Из НайденнаяСтрокаУслуг.Строки Цикл
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
			Если ВедетсяБалансПоПодразделению Тогда
				НаборЗаписейДиР.Подразделение = ШапкаДокумента.СкладКомпании.ПодразделениеКомпании;
			КонецЕсли;
			НаборЗаписейДиР.ШапкаДокумента = ШапкаДокумента;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = СтрокаУслуги.СтатьяДопРасходов;
			НаборЗаписейДиР.ВУпрВалюте = (ШапкаДокумента.ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
			НаборЗаписейДиР.Расход = СтрокаУслуги.СуммаВсего;
			СуммаУслуг = СуммаУслуг+СтрокаУслуги.СуммаВсего;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЦикла;
		
		// Способ ведения не по подразделениям то ничего не будем корректировать.
		Если ВедетсяБалансПоПодразделению И БалансовыеПодразделенияНеРавны И СуммаУслуг<>0 Тогда	
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейДиР.Подразделение = ШапкаДокумента.СкладКомпании.ПодразделениеКомпании;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДиР.ВУпрВалюте = Ложь;
			НаборЗаписейДиР.Доход = СуммаУслуг;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;	
		КонецЕсли;	
	КонецЕсли;
	
	// При безвозмездном поступлении сумму на доходы и расходы.
	Если ШапкаДокумента.ХозОперация=Справочники.ХозОперации.ПоступлениеБезвозмездное Тогда
		НайденнаяСтрокаТоваров=ДеревоДоходовИРасходов.Строки.Найти(Перечисления.ВидыНоменклатуры.Товар,"ВидНоменклатуры");
		СуммаСебестоимости = 0;
		Если НайденнаяСтрокаТоваров<>Неопределено Тогда
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект         = ЭтотОбъект;
			// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
			Если ВедетсяБалансПоПодразделению Тогда
				НаборЗаписейДиР.Подразделение = ШапкаДокумента.СкладКомпании.ПодразделениеКомпании;
			КонецЕсли;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Себестоимость;
			НаборЗаписейДиР.ШапкаДокумента         = ШапкаДокумента;
			НаборЗаписейДиР.ВУпрВалюте             = Ложь;
			НаборЗаписейДиР.Доход                  = НайденнаяСтрокаТоваров.СуммаВсего;
			СуммаСебестоимости                     = СуммаСебестоимости+НайденнаяСтрокаТоваров.СуммаВсего;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
	КонецЕсли;
	
	Если Ссылка <> ДокументСсылка Тогда
		
		РаботаСГраницами.МоментВремениПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		РаботаСГраницами.ДвиженияПоПартиямПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		
	КонецЕсли;
	
	РаботаСГраницами.СдвинутьГраницуПартий(ДокументСсылка, ДополнительныеСвойства, Движения);
	
	Возврат НЕ Отказ;
КонецФункции // ПровестиПоПартиям()

// Возвращает выборку по шапке.
//
// Параметры:
//  ДокументСсылка - Ссылка на документ для которого получаем шапку.
//
// Возвращаемое значение:
//  Выборка - выборка по шапке.
//
Функция ПолучитьШапкуДокумента(ДокументСсылка)

	Запрос=Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ТипЦен КАК ТипЦен,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.Организация КАК Организация,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	Док.Проект КАК Проект,
	/////////// ПРИВАТ ////////////
	|	Док.СкладКомпании КАК СкладКомпании,
	|	Док.СуммаДокумента КАК СуммаДокумента,
	|	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	Док.ДокументОснование КАК ДокументОснование
	|
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции // ПолучитьШапкуДокумента()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	//Мальцев А.Ю.+++
	итДатаПриемкиТСД = НЕОПРЕДЕЛЕНО;
	//Мальцев А.Ю.---
	
	// Заполняем специфические для данной операции реквизиты
	Если НЕ ЗначениеЗаполнено(ЗакрытиеЗаказовПоставщикам) Тогда
		ЗакрытиеЗаказовПоставщикам = 1;
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// для счета от поставщика заполним количество по накладной
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетОтПоставщика") Тогда
		Для Каждого ТекСтрока Из Товары Цикл
			ТекСтрока.КоличествоПоНакладной = ТекСтрока.Количество;
		КонецЦикла;
	КонецЕсли;
	
	// Заполняем специфические для данной операции реквизиты
	Если НЕ ЗначениеЗаполнено(ВхДокДата) Тогда
		ВхДокДата = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	РаспределениеПоставки.Очистить();
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	КонтролироватьАссортимент = ПравоПользователя("КонтролироватьАссортиментПодразделения", ЭтотОбъект);
	
	// - Конов Для интернет заказов контроль отключаем, т.к. в них может продаватьмя внематричный товар. Интернет заказы приходят из системы Многозадачник
	Если КонтролироватьАссортимент = Перечисления.ВидыКонтроля.Запрещать Тогда
		Если ЗначениеЗаполнено(ДокументОснование)Тогда 
			ТекЗаказПоставщику = Неопределено;
			
			Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПредварительноеПоступлениеТоваров") Тогда
				ДокументОснованиеОснования = ДокументОснование.ДокументОснование;
				Если  ЗначениеЗаполнено(ДокументОснованиеОснования) И ТипЗнч(ДокументОснованиеОснования) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
					ТекЗаказПоставщику = ДокументОснованиеОснования;
				КонецЕсли;	
			ИначеЕсли  ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				ТекЗаказПоставщику = ДокументОснование;
			КонецЕсли;
			
			Если НЕ ТекЗаказПоставщику = Неопределено ТОгда
				КонтролироватьАссортимент = ?(ТекЗаказПоставщику.ит_ИсточникЗаказа = Перечисления.ит_ИсточникиЗаказовПоставщику.Многозадачник,Перечисления.ВидыКонтроля.НеКонтролировать,КонтролироватьАссортимент);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	
	// - Конов Для интернет заказов контроль отключаем, т.к. в них может продаватьмя внематричный товар
	
	//Мальцев А.Ю.+++ Контроль только по наличию в заказе
	КонтролироватьНаличиеВЗаказе = ПравоПользователя("итКонтрольНаличияВЗаказе", ЭтотОбъект);
	Если КонтролироватьНаличиеВЗаказе Тогда
		КонтролироватьАссортимент = Перечисления.ВидыКонтроля.НеКонтролировать;
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
		
		Запрос.Текст = "ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ втНоменклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&Номенклатура)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказыПоставщикамОстатки.Номенклатура КАК НоменклатураЗаказа,
		|	втНоменклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	втНоменклатура КАК втНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки(
		|				&Дата,
		|				ЗаказПоставщику В (&СписокЗаказов)
		|					И Номенклатура В (&Номенклатура)) КАК ЗаказыПоставщикамОстатки
		|		ПО втНоменклатура.Ссылка = ЗаказыПоставщикамОстатки.Номенклатура
		|ГДЕ
		|	ЗаказыПоставщикамОстатки.Номенклатура ЕСТЬ NULL";
		
		СписокЗаказов = Новый Массив;
		Если РаспределениеПоставки.Количество() = 0 Тогда
			Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") И ДокументОснование.ХозОперация = Справочники.ХозОперации.ЗаказПоставщику Тогда
				СписокЗаказов.Добавить(ДокументОснование);
			КонецЕсли;
		Иначе
			СписокЗаказов = РаспределениеПоставки.ВыгрузитьКолонку("ЗаказПоставщику");
		КонецЕсли;
		
		ТаблицаЗаказа = Товары.Выгрузить(, "Номенклатура");
		ТаблицаЗаказа.Свернуть("Номенклатура");
		МассивЗаказа = ТаблицаЗаказа.ВыгрузитьКолонку("Номенклатура");
		
		Запрос.УстановитьПараметр("Номенклатура",  МассивЗаказа);
		Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ВывестиСообщение(НСтр("ru = 'Номенклатура ""%1"" отсутствует в заказе'"), ЭтотОбъект,,, Отказ, Выборка.Номенклатура);
		КонецЦикла;
		 
	КонецЕсли;
	
	//Мальцев А.Ю.---
	
	ПозицииДляИсключения = Новый Массив;
	МассивОтсутствующихВАссортименте = Неопределено;
	Если (НЕ КонтролироватьАссортимент = Перечисления.ВидыКонтроля.НеКонтролировать) И ПравоПользователя("РазрешатьПриемкуОтсутствующихВАссортиментеЕслиПозицииСодержатсяВЗаказе", ЭтотОбъект) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата", Новый Граница(?(Ссылка.Пустая(),МоментВремени(),Ссылка.МоментВремени()), ВидГраницы.Исключая));
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказыПоставщикамОстатки.Номенклатура
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&Дата, ЗаказПоставщику В (&СписокЗаказов)) КАК ЗаказыПоставщикамОстатки
		|ГДЕ
		|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток > 0
		|";
		
		СписокЗаказов = Новый Массив;
		Если РаспределениеПоставки.Количество() = 0 Тогда
			Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") И ДокументОснование.ХозОперация = Справочники.ХозОперации.ЗаказПоставщику Тогда
				СписокЗаказов.Добавить(ДокументОснование);
			КонецЕсли;
		Иначе
			СписокЗаказов = РаспределениеПоставки.ВыгрузитьКолонку("ЗаказПоставщику");
		КонецЕсли;
				
		ТаблицаОтсутствующихВАссортименте = Товары.Выгрузить(, "Номенклатура");
		ТаблицаОтсутствующихВАссортименте.Свернуть("Номенклатура");
		МассивОтсутствующихВАссортименте = ТаблицаОтсутствующихВАссортименте.ВыгрузитьКолонку("Номенклатура");
		
		
		//Запрос.УстановитьПараметр("Номенклатура",  МассивОтсутствующихВАссортименте);
		Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);
		
		ТаблицаВыборкаНоменклатрыЗаказов = Запрос.Выполнить().Выгрузить();
		МассивНоменклатрыЗаказов = ТаблицаВыборкаНоменклатрыЗаказов.ВыгрузитьКолонку("Номенклатура");
		
		//Мальцев А.Ю. +++
		ДобавитьАналогиВСписок(МассивНоменклатрыЗаказов);
		//Мальцев А.Ю. ---
		
		Для Каждого НоменклатураВыборка Из МассивНоменклатрыЗаказов Цикл
			УдаляемаяСтрока = МассивОтсутствующихВАссортименте.Найти(НоменклатураВыборка);
			Если НЕ УдаляемаяСтрока = Неопределено Тогда
				МассивОтсутствующихВАссортименте.Удалить(УдаляемаяСтрока);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	РегистрыСведений.ОграничениеАссортиментаПодразделения.ПроверитьАссортиментПодразделения(ЭтотОбъект, Дата, КонтролироватьАссортимент, Отказ,,, МассивОтсутствующихВАссортименте);

	//КонтролироватьАссортиментПоСрокуПоставки = ПравоПользователя("итКонтролироватьАссртиментПоступленияПоСрокуПоставкиЗаказа", ЭтотОбъект);
	//Если КонтролироватьАссортиментПоСрокуПоставки И ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
	//	РегистрыСведений.ОграничениеАссортиментаПодразделения.ПроверитьАссортиментПодразделения(ЭтотОбъект, ДокументОснование.СрокПоставки, КонтролироватьАссортимент, Отказ,,, МассивОтсутствующихВАссортименте);		
	//Иначе
	//	РегистрыСведений.ОграничениеАссортиментаПодразделения.ПроверитьАссортиментПодразделения(ЭтотОбъект, Дата, КонтролироватьАссортимент, Отказ,,, МассивОтсутствующихВАссортименте);
	//КонецЕсли;
	
	Если ХозОперация=Справочники.ХозОперации.УслугиСтороннихОрганизаций Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
		|				ИЛИ Номенклатура.СпособРаспределенияДопРасходов <> ЗНАЧЕНИЕ(Перечисление.СпособыРаспределенияДопРасходов.НаДоходыИРасходы)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Выбрано
		|ПОМЕСТИТЬ ВремТаб
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&СписокНоменклатуры)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВремТаб.Ссылка КАК Ссылка
		|ИЗ
		|	ВремТаб КАК ВремТаб
		|ГДЕ
		|	ВремТаб.Выбрано";
		
		Запрос.УстановитьПараметр("СписокНоменклатуры", Товары.ВыгрузитьКолонку("Номенклатура"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ВывестиСообщение(НСтр("ru = 'Номенклатура'") + Символы.НПП + СокрЛП(Выборка.Ссылка) 
					+ НСтр("ru = 'не является услугой, относящейся на доходы и расходы.'"),
					ЭтотОбъект, "Товары[#].Номенклатура",,Отказ);
		КонецЦикла;
		
	КонецЕсли;
	
	//проверка блокировки приёмки
	ЗапросБлокировки = Новый Запрос("
	|ВЫБРАТЬ
	|	ПодразделениеКомпании,
	|	Контрагент,
	|	Номенклатура
	|ИЗ
	|	РегистрСведений.БлокировкаАссортимента.СрезПоследних(&НаМомент, ХозОперация=ЗНАЧЕНИЕ(Справочник.ХозОперации.БлокировкаПриемки) И ПодразделениеКомпании В(&Подразделение) И Контрагент В(&Контрагент) И Номенклатура В(&Номенклатура))
	|ГДЕ
	|	Заблокировано И (СрокДействия >= &НаДату ИЛИ СрокДействия=ДАТАВРЕМЯ(1,1,1))");
	
	МассивПодразделений = Новый Массив;
	МассивПодразделений.Добавить(ПодразделениеКомпании);
	МассивПодразделений.Добавить(Справочники.ПодразделенияКомпании.ПустаяСсылка());
	МассивКонтрагентов = Новый Массив;
	МассивКонтрагентов.Добавить(Контрагент);
	МассивКонтрагентов.Добавить(Справочники.Контрагенты.ПустаяСсылка());
	МассивНоменклатуры = Товары.ВыгрузитьКолонку("Номенклатура");
	МассивНоменклатуры.Добавить(Справочники.Номенклатура.ПустаяСсылка());
	
	НаМомент = ?(НЕ ЗначениеЗаполнено(Ссылка), КонецДня(ТекущаяДатаСеанса()), Новый Граница(Новый МоментВремени(Дата, Ссылка), ВидГраницы.Исключая));
	ЗапросБлокировки.УстановитьПараметр("НаМомент", НаМомент);
	ЗапросБлокировки.УстановитьПараметр("НаДату", Дата);
	ЗапросБлокировки.УстановитьПараметр("Подразделение", МассивПодразделений);
	ЗапросБлокировки.УстановитьПараметр("Контрагент", МассивКонтрагентов);
	ЗапросБлокировки.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	
	тзБлокировок = ЗапросБлокировки.Выполнить().Выгрузить();
	
	БлокПодразделения = тзБлокировок.НайтиСтроки(Новый Структура("ПодразделениеКомпании,Контрагент,Номенклатура",ПодразделениеКомпании, Справочники.Контрагенты.ПустаяСсылка(), Справочники.Номенклатура.ПустаяСсылка()));
	БлокКонтрагента = тзБлокировок.НайтиСтроки(Новый Структура("Контрагент,Номенклатура",Контрагент, Справочники.Номенклатура.ПустаяСсылка()));
	Если БлокПодразделения.Количество()>0 Тогда
		ВывестиСообщение(НСтр("ru='Подразделение ""%1"" заблокировано для приёмки.'"), ЭтотОбъект,,, Отказ, ПодразделениеКомпании);
	ИначеЕсли БлокКонтрагента.Количество()>0 Тогда
		ВывестиСообщение(НСтр("ru='Контрагент ""%1"" заблокирован для приёмки.'"), ЭтотОбъект,,, Отказ, Контрагент);
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Товары Цикл
		БлокНоменклатуры = тзБлокировок.НайтиСтроки(Новый Структура("Номенклатура", ТекСтрока.Номенклатура));
		Если БлокНоменклатуры.Количество()>0 Тогда
			ВывестиСообщение(НСтр("ru = 'Номенклатура ""%1"" заблокирована для приёмки. Строка №#'"), ЭтотОбъект,, ТекСтрока.НомерСтроки, Отказ, ТекСтрока.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	//--------------------------
	
	Если ХозОперация=Справочники.ХозОперации.ПоступлениеТоваровКомиссия Тогда
		
		СтратегияСписанияПартийПоДатам = ПолучитьСтратегиюСписанияПоДатам(СкладКомпании, Организация, Дата);
		
		Если СтратегияСписанияПартийПоДатам=Перечисления.СтратегияСписанияПартийТоваровПоДатам.Средняя Тогда
			ВывестиСообщение(НСтр("ru='При стратегии списания партий по среднему нельзя приходовать комиссионный товар.'"), ЭтотОбъект,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// корректируем сумму документа
	ТекСуммаДокумента 	 = 0;
	ТекСуммаНДСДокумента = 0;
	Для Каждого ТекСтрока Из Товары Цикл
		Если ТекСтрока.Количество > 0 Тогда
			ТекСуммаДокумента 		= ТекСуммаДокумента + ТекСтрока.СуммаВсего;
			ТекСуммаНДСДокумента    = ТекСуммаНДСДокумента +  + ТекСтрока.СуммаНДС;
		КонецЕсли; 
	КонецЦикла;
	СуммаДокумента = ТекСуммаДокумента;
	СуммаНДС	   = ТекСуммаНДСДокумента;
	
	
	// корректируем количество базовое 
	Для Каждого Строка Из Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.КоличествоБазовое) Тогда
			Строка.КоличествоБазовое = Строка.Количество * Строка.Коэффициент;
		КонецЕсли;
	КонецЦикла;
	
	//Мальцев А.Ю. +++
	Если Марки.Количество() = 0 Тогда
		Для Каждого стр Из Товары Цикл
			
			Если Не ЗначениеЗаполнено(стр.ИдентификаторСтроки) Тогда
				стр.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	//Мальцев А.Ю. ---
	
	//Мальцев А.Ю. +++
	Отказ = ИТ_СпециальныйМодульСервер.ПроверитьСоответствиеНоменклатуреЕГАИС(Товары);
	//Мальцев А.Ю. ---

	Если ПолученИзЕГАИС Тогда
		Если Не Отказ Тогда
			ИнтеграцияЕГАИС.ЗаписатьСоответствиеНоменклатуры(Товары,, Ложь);
		КонецЕсли;
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем пометку удаления, если это отрицательная партия (константа).
	Если ПометкаУдаления И Ссылка=Константы.ПартияТоваровОтрицательныхОстатков.Получить() Тогда
		ВывестиСообщение(НСтр("ru='Невозможно пометить на удаление документ партий отрицательных остатков.'"), ЭтотОбъект,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Если ХозОперация=Справочники.ХозОперации.УслугиСтороннихОрганизаций Тогда
		СкладКомпании = Справочники.СкладыКомпании.ПустаяСсылка();
	КонецЕсли;
	
	// Произведем очистку не использующихся в текущем контексте реквизитов
	ОбработкаСобытийДокументаСервер.ОчиститьПолеЦенаРозничнаяДляНеРозничныхСкладов(ЭтотОбъект, СкладКомпании);
	
	//ПравоИзмененияДоверительнойПриемки = ПравоПользователя("итИзменениеДоверительнойПриемкиРазрешено");
	//Если Не Отказ И Контрагент.итДоверительнаяПриемка И ПравоИзмененияДоверительнойПриемки = Ложь 
	//	И (РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
	//	
	//	Отказ = Истина;
	//	ВывестиСообщение(НСтр("ru = 'Нет прав на изменение поставки доверительной приемки'"), ЭтотОбъект,,,Отказ);

	//КонецЕсли;
	//
	
	Если НЕ Отказ И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорВзаиморасчетов, "НеКонтролироватьСогласованныеЦены, НеКонтролироватьНаличиеЗаказа");
		НеКонтролироватьСогласованныеЦены = РеквизитыДоговора.НеКонтролироватьСогласованныеЦены;
		НеКонтролироватьНаличиеЗаказа     = РеквизитыДоговора.НеКонтролироватьНаличиеЗаказа;
		
		// Проверим соответствие цен в документе с протоколом согласования цен
		ПравоКонтролироватьИзмененияЦенПоставщиков = ПравоПользователя("КонтролироватьИзмененияЦенПоставщиков", ЭтотОбъект);
		
		// - Конов Для интернет заказов контроль отключаем, т.к. в них может быть внематричный товар. Интернет заказы приходят из системы Многозадачник
		Если ПравоКонтролироватьИзмененияЦенПоставщиков = Перечисления.ВидыКонтроля.Запрещать Тогда
			Если ЗначениеЗаполнено(ДокументОснование)Тогда 
				ТекЗаказПоставщику = Неопределено;
				
				Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПредварительноеПоступлениеТоваров") Тогда
					ДокументОснованиеОснования = ДокументОснование.ДокументОснование;
					Если  ЗначениеЗаполнено(ДокументОснованиеОснования) И ТипЗнч(ДокументОснованиеОснования) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
						ТекЗаказПоставщику = ДокументОснованиеОснования;
					КонецЕсли;	
				ИначеЕсли  ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
					ТекЗаказПоставщику = ДокументОснование;
				КонецЕсли;
				
				Если НЕ ТекЗаказПоставщику = Неопределено ТОгда
					ПравоКонтролироватьИзмененияЦенПоставщиков = ?(ТекЗаказПоставщику.ит_ИсточникЗаказа = Перечисления.ит_ИсточникиЗаказовПоставщику.Многозадачник,Перечисления.ВидыКонтроля.НеКонтролировать,ПравоКонтролироватьИзмененияЦенПоставщиков);
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
		// - Конов Для интернет заказов контроль отключаем, т.к. в них может быть внематричный товар
		
		
		ПравоЗапрещатьПоступлениеБезЗаказа         = ПравоПользователя("ЗапрещатьПоступлениеБезЗаказа", ЭтотОбъект);
		
		//Мальцев А.Ю. +++		
		ПравоРазрешитьПоступлениеБезЗаказа         = ПравоПользователя("итРазрешитьСозданиеПоступленияБезЗаказов", ЭтотОбъект);
		Если Не ПравоРазрешитьПоступлениеБезЗаказа Тогда
			Если НЕ ЗначениеЗаполнено(ДокументОснование)Тогда 
				Отказ = Истина;
				ВывестиСообщение(НСтр("ru = 'Допускается создание поступления товаров только на основании заказа поставщику'"), ЭтотОбъект,,,Отказ);
			ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПредварительноеПоступлениеТоваров") Тогда
				ДокументОснованиеОснования = ДокументОснование.ДокументОснование;
				Если  ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснованиеОснования) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
					//Проверка пройдена
				Иначе
					Отказ = Истина;
					ВывестиСообщение(НСтр("ru = 'Допускается создание поступления товаров только на основании заказа поставщику'"), ЭтотОбъект,,,Отказ);
				КонецЕсли;	
			ИначеЕсли  ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				Отказ = Истина;
				ВывестиСообщение(НСтр("ru = 'Допускается создание поступления товаров только на основании заказа поставщику'"), ЭтотОбъект,,,Отказ);
			КонецЕсли;
		КонецЕсли;
		//Мальцев А.Ю. ---
			
		Если ПравоЗапрещатьПоступлениеБезЗаказа И (НЕ НеКонтролироватьНаличиеЗаказа) Тогда
			Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
				Если ЗакрытиеЗаказовПоставщикам=0 Тогда
					ВывестиСообщение(НСтр("ru = 'Допускается создание поступления товаров только на основании заказа поставщику'"), ЭтотОбъект,,,Отказ);
				Иначе
					Если РаспределениеПоставки.Количество()=0 Тогда
						ВывестиСообщение(НСтр("ru = 'Допускается создание поступления товаров только на основании заказа поставщику'"), ЭтотОбъект,,,Отказ);
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ТипЗнч(ДокументОснование)<>Тип("ДокументСсылка.ЗаказПоставщику") И ТипЗнч(ДокументОснование.ДокументОснование)<>Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				ВывестиСообщение(НСтр("ru = 'Допускается создание поступления товаров только на основании заказа поставщику'"), ЭтотОбъект,,,Отказ);
			КонецЕсли;
			ВидНоменклатурыТара   = Перечисления.ВидыНоменклатуры.Тара;
			ВидНоменклатурыУслуга = Перечисления.ВидыНоменклатуры.Услуга;
			
			//Мальцев А.Ю. +++
			массивВышестоящие = Новый Массив;
			массивПодчиненные = Новый Массив;
			ИТ_СпециальныйМодульСервер.ПолучитьВышестоящиеПодчиненныеПодразделения(ПодразделениеКомпании, массивВышестоящие, массивПодчиненные);
			//Мальцев А.Ю. ---

			ОтклонениеГраммКомпания = ПолучитьЗначениеУчетнойПолитики("ДопустимоеОтклонениеКоличестваВесовогоТовараГрамм", ПодразделениеКомпании, Дата);
			Если ТипЗнч(ОтклонениеГраммКомпания)<>Тип("Число") ИЛИ ОтклонениеГраммКомпания = 0 Тогда
				ОтклонениеГраммКомпания = 0;
				//Мальцев А.Ю. +++
				Для Каждого головноеПодразделения Из массивВышестоящие Цикл
					ОтклонениеГраммКомпания = ПолучитьЗначениеУчетнойПолитики("ДопустимоеОтклонениеКоличестваВесовогоТовараГрамм", головноеПодразделения, Дата);
					Если ТипЗнч(ОтклонениеГраммКомпания)=Тип("Число") Тогда
						ОтклонениеГраммКомпания = ОтклонениеГраммКомпания / 1000;
						Прервать;
					КонецЕсли;
				КонецЦикла;	
				//Мальцев А.Ю. ---
			Иначе
				ОтклонениеГраммКомпания = ОтклонениеГраммКомпания / 1000;
			КонецЕсли;
			
			ОтклонениеПроцентКомпания = ПолучитьЗначениеУчетнойПолитики("ДопустимоеОтклонениеКоличестваВесовогоТовараПроцентов", ПодразделениеКомпании, Дата);
			Если ТипЗнч(ОтклонениеПроцентКомпания)<>Тип("Число") ИЛИ ОтклонениеПроцентКомпания = 0 Тогда
				ОтклонениеПроцентКомпания = 0;
				//Мальцев А.Ю. +++
				Для Каждого головноеПодразделения Из массивВышестоящие Цикл
					ОтклонениеПроцентКомпания = ПолучитьЗначениеУчетнойПолитики("ДопустимоеОтклонениеКоличестваВесовогоТовараПроцентов", головноеПодразделения, Дата);
					Если ТипЗнч(ОтклонениеПроцентКомпания)=Тип("Число") Тогда
						ОтклонениеПроцентКомпания = ОтклонениеПроцентКомпания / 100;
						Прервать;
					КонецЕсли;
				КонецЦикла;	
				//Мальцев А.Ю. ---
			Иначе
				ОтклонениеПроцентКомпания = ОтклонениеПроцентКомпания / 100;
			КонецЕсли;
			
			ОтклонениеКопеекКомпания = ПолучитьЗначениеУчетнойПолитики("ДопустимоеОтклонениеЦеныОтСогласованной", ПодразделениеКомпании, Дата);
			Если ТипЗнч(ОтклонениеКопеекКомпания)<>Тип("Число") ИЛИ ОтклонениеКопеекКомпания = 0 Тогда
				ОтклонениеКопеекКомпания = 0;
				//Мальцев А.Ю. +++
				Для Каждого головноеПодразделения Из массивВышестоящие Цикл
					ОтклонениеКопеекКомпания = ПолучитьЗначениеУчетнойПолитики("ДопустимоеОтклонениеЦеныОтСогласованной", головноеПодразделения, Дата);
					Если ТипЗнч(ОтклонениеКопеекКомпания)=Тип("Число") Тогда
						ОтклонениеКопеекКомпания = ОтклонениеКопеекКомпания / 100;
						Прервать;
					КонецЕсли;
				КонецЦикла;	
				//Мальцев А.Ю. ---
			Иначе
				ОтклонениеКопеекКомпания = ОтклонениеКопеекКомпания / 100;
			КонецЕсли;
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	Подзапрос.Номенклатура,
			|	СУММА(Подзапрос.КоличествоВЗаказе) КАК КоличествоВЗаказе,
			|	СУММА(Подзапрос.СуммаЗаказа) КАК СуммаЗаказа,
			|	МАКСИМУМ(Подзапрос.МаксимальнаяЦенаЗаказа) КАК МаксимальнаяЦенаЗаказа
			|ИЗ
			|	(ВЫБРАТЬ
			|		ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
			|		ЕСТЬNULL(ЗаказыПоставщикамОстатки.ЗаказаноОстаток, 0) КАК КоличествоВЗаказе,
			|		ЕСТЬNULL(ЗаказыПоставщикамОстатки.СуммаУпрОстаток, 0) КАК СуммаЗаказа,
			|		0 КАК МаксимальнаяЦенаЗаказа
			|	ИЗ
			|		РегистрНакопления.ЗаказыПоставщикам.Остатки(&НаДату, ЗаказПоставщику В (&СписокЗаказов)) КАК ЗаказыПоставщикамОстатки
			|	ГДЕ
			|		ЗаказыПоставщикамОстатки.Номенклатура.ВидНоменклатуры <> &Тара
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ЗаказПоставщикуТовары.Номенклатура,
			|		0,
			|		0,
			|		МАКСИМУМ(ЗаказПоставщикуТовары.Цена)
			|	ИЗ
			|		Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
			|	ГДЕ
			|		ЗаказПоставщикуТовары.Ссылка В(&СписокЗаказов)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ЗаказПоставщикуТовары.Номенклатура) КАК Подзапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	Подзапрос.Номенклатура");
			Если РаспределениеПоставки=0 Тогда
				Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ПредварительноеПоступлениеТоваров") Тогда
					Если ДокументОснование.Заказы.Количество()=0 Тогда
						Запрос.УстановитьПараметр("СписокЗаказов", ДокументОснование.ДокументОснование);
					Иначе
						Запрос.УстановитьПараметр("СписокЗаказов", ДокументОснование.Заказы.ВыгрузитьКолонку("ЗаказПоставщику"));
					КонецЕсли;
				Иначе
					Запрос.УстановитьПараметр("СписокЗаказов", ДокументОснование);
				КонецЕсли;
			Иначе
				Запрос.УстановитьПараметр("СписокЗаказов", РаспределениеПоставки.ВыгрузитьКолонку("ЗаказПоставщику"));
			КонецЕсли;
			
			Если ЭтоНовый() Тогда
				Запрос.УстановитьПараметр("НаДату", КонецДня(ТекущаяДата()));
			Иначе
				Запрос.УстановитьПараметр("НаДату", МоментВремени());
			КонецЕсли;
			//Запрос.УстановитьПараметр("Номенклатура", Товары.ВыгрузитьКолонку("Номенклатура"));
			Запрос.УстановитьПараметр("Тара", ВидНоменклатурыТара);
			Выборка = Запрос.Выполнить().Выбрать();
			СтруктураПоиска = Новый Структура("Номенклатура", 0);
			ТабТовары = Товары.Выгрузить();
			ТабТовары.Свернуть("Номенклатура,Цена", "Количество,КоличествоБазовое,СуммаВсего");
			Для Каждого СтрокаТовара Из ТабТовары Цикл
				Выборка.Сбросить();
				Если СтрокаТовара.Номенклатура.ВидНоменклатуры=ВидНоменклатурыТара ИЛИ 
					СтрокаТовара.Номенклатура.ВидНоменклатуры=ВидНоменклатурыУслуга Тогда
					Продолжить;
				КонецЕсли;
				Если СтрокаТовара.Количество = 0 Тогда
					Продолжить;
				КонецЕсли;
				Сообщение = "";
				СтруктураПоиска.Номенклатура = СтрокаТовара.Номенклатура;
				Если Выборка.НайтиСледующий(СтруктураПоиска) Тогда
					Если Выборка.КоличествоВЗаказе>0 Тогда
						Если СтрокаТовара.Номенклатура.ТипНоменклатуры.Весовой Тогда
							ДопустимоеКоличествоВесового = Выборка.КоличествоВЗаказе * (1 + ОтклонениеПроцентКомпания) + ОтклонениеГраммКомпания;
							//Мальцев А.Ю. +++
							//БЫЛО: Если СтрокаТовара.КоличествоБазовое>ДопустимоеКоличествоВесового Тогда
							Если СтрокаТовара.КоличествоБазовое>ДопустимоеКоличествоВесового И Не Контрагент.итКоличествоПоставщикаВПриемкеНаТСД Тогда
							//Мальцев А.Ю. ---
								ВывестиСообщение(НСтр("ru = 'Товар'") + Символы.НПП + "["+СокрЛП(СтрокаТовара.Номенклатура.Код)+"] "+СокрЛП(СтрокаТовара.Номенклатура) 
								+ НСтр("ru = 'Несоответствие количества товара в накладной: %1 и максимально допустимого по заказам: %2'"),
								ЭтотОбъект,,,Отказ, СтрокаТовара.КоличествоБазовое, ДопустимоеКоличествоВесового);
							КонецЕсли;
						Иначе
							//Мальцев А.Ю. +++
							//БЫЛО: Если СтрокаТовара.КоличествоБазовое>Выборка.КоличествоВЗаказе Тогда
							Если СтрокаТовара.КоличествоБазовое>Выборка.КоличествоВЗаказе И Не Контрагент.итКоличествоПоставщикаВПриемкеНаТСД Тогда
							//Мальцев А.Ю. ---
								ВывестиСообщение(НСтр("ru = 'Товар'") + Символы.НПП + "["+СокрЛП(СтрокаТовара.Номенклатура.Код)+"] "+СокрЛП(СтрокаТовара.Номенклатура) 
								+ НСтр("ru = 'Несоответствие количества товара в накладной: %1 и максимально допустимого по заказам: %2'"),
								ЭтотОбъект,,,Отказ, СтрокаТовара.КоличествоБазовое, Выборка.КоличествоВЗаказе);
							КонецЕсли;
						КонецЕсли;
						ЦенаЗаказа=Выборка.МаксимальнаяЦенаЗаказа;
						
						//Мальцев А.Ю. +++
						//БЫЛО: Если СтрокаТовара.Цена>ЦенаЗаказа+ОтклонениеКопеекКомпания Тогда
						Если СтрокаТовара.Цена>ЦенаЗаказа+ОтклонениеКопеекКомпания И Не Контрагент.итЦеныПоставщикаВПриемкеНаТСД Тогда
				        //Мальцев А.Ю. ---
						
							ВывестиСообщение(НСтр("ru = 'Товар'") + Символы.НПП + "["+СокрЛП(СтрокаТовара.Номенклатура.Код)+"] "+СокрЛП(СтрокаТовара.Номенклатура) 
								+ НСтр("ru = 'Цена в документе: %1 больше чем в заказе: %2'"),
								ЭтотОбъект,,,Отказ, СтрокаТовара.Цена, ЦенаЗаказа);
						КонецЕсли;
					Иначе
						ВывестиСообщение(НСтр("ru = 'Товар'") + Символы.НПП + "["+СокрЛП(СтрокаТовара.Номенклатура.Код)+"] "+СокрЛП(СтрокаТовара.Номенклатура) 
							+ НСтр("ru = 'не содержится в заказах поставщикам или заказ по данному товару уже был исполнен!'"), ЭтотОбъект,,,Отказ);
					КонецЕсли;
				Иначе
					ВывестиСообщение(НСтр("ru = 'Товар'") + Символы.НПП + "["+СокрЛП(СтрокаТовара.Номенклатура.Код)+"] "+СокрЛП(СтрокаТовара.Номенклатура) 
							+ НСтр("ru = 'не содержится в заказах поставщикам или заказ по данному товару уже был исполнен!'"), ЭтотОбъект,,,Отказ);
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли (НЕ ПравоКонтролироватьИзмененияЦенПоставщиков = Перечисления.ВидыКонтроля.НеКонтролировать) И (НЕ НеКонтролироватьСогласованныеЦены) Тогда
			
			ДатаЦен = Дата;
			ТаблицаЗаказов = Неопределено;
			Если ЗначениеЗаполнено(ДоговорВзаиморасчетов) Тогда
				ВидСогласованнойЦены = ДоговорВзаиморасчетов.ВидСогласованнойЦены;
				Если ВидСогласованнойЦены=1 Тогда
					ДатаЦен = ?(ЗначениеЗаполнено(ВхДокДата),ВхДокДата,Дата);
				ИначеЕсли ВидСогласованнойЦены=2 Тогда
					МассивЗаказов = РаспределениеПоставки.ВыгрузитьКолонку("ЗаказПоставщику");
					Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказПоставщику") Тогда
						МассивЗаказов.Добавить(ДокументОснование);
					КонецЕсли;
					
					Запрос = Новый Запрос("ВЫБРАТЬ
					                      |	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
					                      |	МАКСИМУМ(ЗаказПоставщикуТовары.Цена) КАК Цена,
					                      |	МАКСИМУМ(ЗаказПоставщикуТовары.Цена) КАК ЦенаБезНДС,
					                      |	0 КАК ПроцентОтклонения
					                      |ИЗ
					                      |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
					                      |ГДЕ
					                      |	ЗаказПоставщикуТовары.Ссылка В(&МассивЗаказов)
					                      |
					                      |СГРУППИРОВАТЬ ПО
					                      |	ЗаказПоставщикуТовары.Номенклатура");
					Запрос.УстановитьПараметр("МассивЗаказов",МассивЗаказов);
					ТаблицаЗаказов = Запрос.Выполнить().Выгрузить();
				КонецЕсли;
			КонецЕсли;
			
			ТаблицаЦен = ЦенообразованиеСервер.ПолучитьСогласованныеЦены(ДатаЦен, Контрагент, ПодразделениеКомпании, Товары.ВыгрузитьКолонку("Номенклатура"), ТаблицаЗаказов);
			
			//Мальцев А.Ю. +++
			массивВышестоящие = Новый Массив;
			массивПодчиненные = Новый Массив;
			ИТ_СпециальныйМодульСервер.ПолучитьВышестоящиеПодчиненныеПодразделения(ПодразделениеКомпании, массивВышестоящие, массивПодчиненные);
			//Мальцев А.Ю. ---			
			
			//ДопустимоеОтклонениеЦеныОтСогласованной    = ПолучитьЗначениеУчетнойПолитики("ДопустимоеОтклонениеЦеныОтСогласованной", ПодразделениеКомпании, Дата)/100;
			ОтклонениеКопеекКомпания = ПолучитьЗначениеУчетнойПолитики("ДопустимоеОтклонениеЦеныОтСогласованной", ПодразделениеКомпании, Дата);
			Если ТипЗнч(ОтклонениеКопеекКомпания)<>Тип("Число") ИЛИ ОтклонениеКопеекКомпания = 0 Тогда
				ОтклонениеКопеекКомпания = 0;
				//Мальцев А.Ю. +++
				Для Каждого головноеПодразделения Из массивВышестоящие Цикл
					ОтклонениеКопеекКомпания = ПолучитьЗначениеУчетнойПолитики("ДопустимоеОтклонениеЦеныОтСогласованной", головноеПодразделения, Дата);
					Если ТипЗнч(ОтклонениеКопеекКомпания)=Тип("Число") Тогда
						ОтклонениеКопеекКомпания = ОтклонениеКопеекКомпания / 100;
						Прервать;
					КонецЕсли;
				КонецЦикла;	
				//Мальцев А.Ю. ---
			Иначе
				ОтклонениеКопеекКомпания = ОтклонениеКопеекКомпания / 100;
			КонецЕсли;
			ДопустимоеОтклонениеЦеныОтСогласованной = ОтклонениеКопеекКомпания;
			
			ПравоКонтролироватьТолькоСогласованныеЦены = ПравоПользователя("КонтролироватьТолькоСогласованныеЦены", ЭтотОбъект);
			
			ЦенаВключаетНДС = ТипЦен.ЦенаВключаетНДС;
			
			Для Каждого СтрокаТовары Из Товары Цикл
				
				Если СтрокаТовары.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Тара Тогда
					Продолжить;
				КонецЕсли;
				
				ТекСогласованнаяЦена = ТаблицаЦен.Найти(СтрокаТовары.Номенклатура, "Номенклатура");
				Если ТекСогласованнаяЦена = Неопределено Тогда
					Если НЕ ПравоКонтролироватьТолькоСогласованныеЦены И Не Контрагент.итЦеныПоставщикаВПриемкеНаТСД Тогда//не контролируем цены если есть такое право
						ВывестиСообщение(НСтр("ru = ' В строке № '")+ СтрокаТовары.НомерСтроки + НСтр("ru = ' На товар'") + Символы.НПП + "["+СокрЛП(СтрокаТовары.Номенклатура.Код)+"] "+СокрЛП(СтрокаТовары.Номенклатура) 
						+ НСтр("ru = ' нет согласованных цен.'"),
						ЭтотОбъект);
						
						Отказ = Отказ ИЛИ (ПравоКонтролироватьИзмененияЦенПоставщиков=Перечисления.ВидыКонтроля.Запрещать);
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				
				Если ТекСогласованнаяЦена.Цена = 0 Тогда
					Если НЕ ПравоКонтролироватьТолькоСогласованныеЦены И Не Контрагент.итЦеныПоставщикаВПриемкеНаТСД Тогда//не контролируем цены если есть такое право
						ВывестиСообщение(НСтр("ru = ' В строке № '")+ СтрокаТовары.НомерСтроки + НСтр("ru = ' На товар'") + Символы.НПП + "["+СокрЛП(СтрокаТовары.Номенклатура.Код)+"] "+СокрЛП(СтрокаТовары.Номенклатура) 
						+ НСтр("ru = ' нет согласованных цен.'"),
						ЭтотОбъект);
						
						Отказ = Отказ ИЛИ (ПравоКонтролироватьИзмененияЦенПоставщиков=Перечисления.ВидыКонтроля.Запрещать);
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				
				ЦенаПротокола = ?(ЦенаВключаетНДС, ТекСогласованнаяЦена.Цена, ТекСогласованнаяЦена.ЦенаБезНДС);
				Если ЦенаПротокола<СтрокаТовары.Цена Тогда
					ЦенаДляКонтроля = Окр(ЦенаПротокола * (100 + ТекСогласованнаяЦена.ПроцентОтклонения) / 100, 2) + ДопустимоеОтклонениеЦеныОтСогласованной;
					Если ЦенаДляКонтроля<СтрокаТовары.Цена Тогда
						Если ПравоКонтролироватьИзмененияЦенПоставщиков=Перечисления.ВидыКонтроля.Запрещать И Не Контрагент.итЦеныПоставщикаВПриемкеНаТСД Тогда
							ВывестиСообщение(НСтр("ru = ' В строке № '")+ СтрокаТовары.НомерСтроки + НСтр("ru = ' На товар'") + Символы.НПП + "["+СокрЛП(СтрокаТовары.Номенклатура.Код)+"] "+СокрЛП(СтрокаТовары.Номенклатура) 
							+ НСтр("ru = ' цена в документе ('") + СокрЛП(СтрокаТовары.Цена)+НСтр("ru = ' ) не соответствует согласованной цене ("+СокрЛП(ЦенаПротокола)+").'"),
							ЭтотОбъект);
							
							Отказ = Истина;
						ИначеЕсли Не Контрагент.итЦеныПоставщикаВПриемкеНаТСД Тогда
							ВывестиСообщение(НСтр("ru = ' В строке № '")+ СтрокаТовары.НомерСтроки + НСтр("ru = ' На товар'") + Символы.НПП + "["+СокрЛП(СтрокаТовары.Номенклатура.Код)+"] "+СокрЛП(СтрокаТовары.Номенклатура) 
							+ НСтр("ru = ' цена в документе ('") + СокрЛП(СтрокаТовары.Цена)+НСтр("ru = ' ) не соответствует согласованной цене ("+СокрЛП(ЦенаПротокола)+").'"),
							ЭтотОбъект);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		//установим способ поставки, если он не был заполнен
		Если НЕ ЗначениеЗаполнено(СпособПоставки) Тогда
			Если ЗначениеЗаполнено(СкладКомпании.ПодразделениеКомпании.ГруппаПоставки) Тогда
				ГруппаПоставки = СкладКомпании.ПодразделениеКомпании.ГруппаПоставки;
			Иначе
				ГруппаПоставки = ПодразделениеКомпании.ГруппаПоставки;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ГруппаПоставки) Тогда
				СтрокаГП = Контрагент.ГруппыПоставки.Найти(ГруппаПоставки);
				Если СтрокаГП<>Неопределено Тогда
					СпособПоставки = СтрокаГП.СпособПоставки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	
	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоВзаиморасчетамПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоЗаказамПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоПартиямПередПроведением(Ссылка, ДополнительныеСвойства);
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолученИзЕГАИС Тогда
		ИнтеграцияЕГАИС.ЗаписатьСтатусДокументаЕГАИСПоУмолчанию(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Запретим удалять документ партии отрицательных остатков
	Если Ссылка=Константы.ПартияТоваровОтрицательныхОстатков.Получить() Тогда
		ВывестиСообщение(НСтр("ru='Документ является документом партии отрицательных остатках и не может быть удален.'"), ЭтотОбъект,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	ПравоИзмененияДоверительнойПриемки = ПравоПользователя("итИзменениеДоверительнойПриемкиРазрешено");
	Если Контрагент.итДоверительнаяПриемка и НЕ ПравоИзмененияДоверительнойПриемки Тогда 
		Отказ = Истина;
		ВывестиСообщение(НСтр("ru='Документ в режиме доверительной приемки, изменение возможно только через Заявку на расхождение'"), ЭтотОбъект,,, Отказ);		
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Определим необходимость формирования корректирующих проводок
	ВедетсяБалансПоПодразделению = БалансВедетсяПоПодразделениям(Дата);
	//Проверка на необходимость пересчета по ставке НДС
	
	ПодразделениеСклад = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(СкладКомпании.ПодразделениеКомпании, Дата);
	ПодразделениеДоговорВзаиморасчетов = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ДоговорВзаиморасчетов.ПодразделениеКомпании, Дата);
	ПодразделениеПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ПодразделениеКомпании, Дата);
	Если ХозОперация = Справочники.ХозОперации.УслугиСтороннихОрганизаций Тогда
		БалансовыеПодразделенияНеРавны = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеПодразделениеКомпании);
	Иначе	
		БалансовыеПодразделенияНеРавны = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеСклад);
	КонецЕсли;
	
	ФлагУпрВалюты = (ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
	СписокТоваров = Товары.ВыгрузитьКолонку("Номенклатура");
	// Проведем взаиморасчеты если поступление не комиссионное
	Если ХозОперация<>Справочники.ХозОперации.ПоступлениеТоваровКомиссия И ХозОперация<>Справочники.ХозОперации.ПоступлениеБезвозмездное Тогда // И Контрагент.ВидКонтрагента<>Перечисления.ВидыКонтрагентов.ПодотчетноеЛицо
		НаборЗаписейВзаиморасчеты=Движения.ВзаиморасчетыКомпании;
		НаборЗаписейВзаиморасчеты.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейВзаиморасчеты.РежимПроведения=РежимПроведения;
		НаборЗаписейВзаиморасчеты.Контрагент=Контрагент;
		НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
		Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказПоставщику")
			И ДоговорВзаиморасчетов.СпособЗакрытияСделок=Перечисления.СпособЗакрытияСделок.ПоСчетамИЗаказам Тогда
			НаборЗаписейВзаиморасчеты.Сделка=ДокументОснование;
		Иначе
			НаборЗаписейВзаиморасчеты.Сделка=Неопределено;
		КонецЕсли; 
		НаборЗаписейВзаиморасчеты.АвтоЗакрытиеСделок=АвтоЗакрытиеСделок;
		НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Ложь;
		НаборЗаписейВзаиморасчеты.Сумма=СуммаДокумента;
		НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц=0;
		Отказ=НЕ НаборЗаписейВзаиморасчеты.Расход() ИЛИ Отказ;
		// Доходы и расходы по суммовым разницам
		СуммаДоходаРасходаСуммовыхРазниц=НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
		
		Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
			Если ВедетсяБалансПоПодразделению Тогда
				НаборЗаписейДиР.Подразделение = ДоговорВзаиморасчетов.ПодразделениеКомпании;
			КонецЕсли;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
			НаборЗаписейДиР.ВУпрВалюте = Истина;
			Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
				НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
			Иначе
				НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
			КонецЕсли;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
	КонецЕсли;
	
	Если (НЕ (ХозОперация = Справочники.ХозОперации.УслугиСтороннихОрганизаций)) Тогда
		
		ОсновнойЗаказ = ПолучитьОсновнойЗаказ();
		
		РезультатЗапросаПоТоварам = ПолучитьТаблицуТоваровЗаказыРаспределение();
		
		Если ЗакрытиеЗаказовПоставщикам = 0 Тогда
			ОтразитьРучноеРаспределение(РезультатЗапросаПоТоварам);
		КонецЕсли;
		
		// Закрытие распределений заказов поставщику
		НаборЗаписейРаспределения=Движения.ЗаказыРаспределение;
		НаборЗаписейРаспределения.РежимПроведения=РежимПроведения;
		НаборЗаписейРаспределения.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейРаспределения.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
		НаборЗаписейРаспределения.ЗаказПокупателя=Неопределено;
		НаборЗаписейРаспределения.ЗаказПоставщика=Неопределено;
		НаборЗаписейРаспределения.Контрагент=Контрагент;
		НаборЗаписейРаспределения.ДвиженияПоРознице=Истина;
		НаборЗаписейРаспределения.ПоБазовомуКоличеству=Истина;
		Отказ=НЕ НаборЗаписейРаспределения.ЗакрытиеРаспределенийЗаказовПоставщику() ИЛИ Отказ;
		
		// Резервирование товаров по заказам покупателей
		НаборЗаписейЗаказыПокупателей=Движения.ЗаказыПокупателей;
		НаборЗаписейЗаказыПокупателей.РежимПроведения=РежимПроведения;
		НаборЗаписейЗаказыПокупателей.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам=НаборЗаписейРаспределения.ТаблицаЗакрытияРаспределений;
		НаборЗаписейЗаказыПокупателей.Контрагент=Неопределено;
		НаборЗаписейЗаказыПокупателей.Заказ=Неопределено;
		НаборЗаписейЗаказыПокупателей.СкладКомпании=СкладКомпании;
		НаборЗаписейЗаказыПокупателей.Заказывать=Ложь;
		НаборЗаписейЗаказыПокупателей.Резервировать=Истина;
		НаборЗаписейЗаказыПокупателей.ПоБазовомуКоличеству=Истина;
		Отказ=НЕ НаборЗаписейЗаказыПокупателей.Приход() ИЛИ Отказ;
		
		// Закрытие нераспределенных заказов покупателей
		ЗакрыватьНераспределенныеЗаказыПокупателей = ПолучитьЗначениеУчетнойПолитики("ЗакрыватьНераспределенныеЗаказыПокупателей", ПодразделениеКомпании, Дата);
		Если ЗакрыватьНераспределенныеЗаказыПокупателей Тогда
			НаборЗаписейЗаказыПокупателей.РежимПроведения=РежимПроведения;
			НаборЗаписейЗаказыПокупателей.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам=НаборЗаписейРаспределения.РезультатЗапросаПоТоварам;
			НаборЗаписейЗаказыПокупателей.Контрагент=Неопределено;
			НаборЗаписейЗаказыПокупателей.Заказ=Неопределено;
			НаборЗаписейЗаказыПокупателей.СкладКомпании=СкладКомпании;
			НаборЗаписейЗаказыПокупателей.Заказывать=Ложь;
			НаборЗаписейЗаказыПокупателей.Резервировать=Истина;
			НаборЗаписейЗаказыПокупателей.ПоБазовомуКоличеству=Истина;
			Отказ=НЕ НаборЗаписейЗаказыПокупателей.ЗакрытиеНераспределенныхЗаказов() ИЛИ Отказ;
		КонецЕсли;
		
		// Закрытие заказов поставщику
		НаборЗаписейЗаказыПоставщикам=Движения.ЗаказыПоставщикам;
		НаборЗаписейЗаказыПоставщикам.РежимПроведения=РежимПроведения;
		НаборЗаписейЗаказыПоставщикам.ДокументОбъект=ЭтотОбъект;
		
		НаборЗаписейЗаказыПоставщикам.ЗакрытиеЗаказовПоставщикам=ЗакрытиеЗаказовПоставщикам;
		Если ЗакрытиеЗаказовПоставщикам = 0 Тогда
			НаборЗаписейЗаказыПоставщикам.РезультатЗапросаПоТоварам=НаборЗаписейРаспределения.РезультатЗапросаПоТоварам.Скопировать();
		Иначе
			НаборЗаписейЗаказыПоставщикам.РезультатЗапросаПоТоварам=Неопределено;
		КонецЕсли;
		НаборЗаписейЗаказыПоставщикам.Контрагент=Контрагент;
		НаборЗаписейЗаказыПоставщикам.ПоБазовомуКоличеству=Истина;
		НаборЗаписейЗаказыПоставщикам.ЗаказПоставщику=Неопределено;
		
		НаборЗаписейЗаказыПоставщикам.ЗаказОснование = ОсновнойЗаказ;
		
		ЗаблокироватьЗаказыПоставщикам();
		
		ДополнительныеСвойства.Вставить("ЗаказОснование", НаборЗаписейЗаказыПоставщикам.ЗаказОснование);
		
		ЗакрытыеРаспределения     = НаборЗаписейРаспределения.Выгрузить();
		//РезультатЗапросаПоТоварам = НаборЗаписейРаспределения.РезультатЗапросаПоТоварам;
		
		//НаборЗаписейЗаказыПоставщикам.РезультатЗапросаПоЗаказам = ЗаказыПоставщикамКЗакрытию(ЗакрытыеРаспределения, РезультатЗапросаПоТоварам).Выгрузить();
		НаборЗаписейЗаказыПоставщикам.РезультатЗапросаПоЗаказам = ЗаказыПоставщикамКЗакрытию(ЗакрытыеРаспределения, ОсновнойЗаказ).Выгрузить();
		
		Отказ = НЕ НаборЗаписейЗаказыПоставщикам.ЗакрытиеЗаказовПоставщику() ИЛИ Отказ;
		
		// Проведем остатки товаров
		НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
		НаборЗаписейОстатки.РежимПроведения=РежимПроведения;
		НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейОстатки.РезультатЗапросаПоТоварам=НаборЗаписейРаспределения.РезультатЗапросаПоТоварам;
		//Если ЗакрытиеЗаказовПоставщикам = 0 Тогда
		//	НаборЗаписейРаспределения.РезультатЗапросаПоТоварам = ПолучитьТаблицуРучногоРаспределения(РезультатЗапросаПоТоварам);
		//Иначе
		//	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=НаборЗаписейРаспределения.РезультатЗапросаПоТоварам;
		//КонецЕсли;
		
		НаборЗаписейОстатки.СкладКомпании=СкладКомпании;
		НаборЗаписейОстатки.Приходовать=Истина;
		НаборЗаписейОстатки.Резервировать=Истина;
		НаборЗаписейОстатки.Контрагент=Контрагент;
		НаборЗаписейОстатки.ПоБазовомуКоличеству=Истина;
		НаборЗаписейОстатки.ДвиженияПоРознице=СкладКомпании.Розничный;
		//НаборЗаписейОстатки.ЗаполнятьГруппыОборудования = Истина;
		Отказ=НЕ НаборЗаписейОстатки.Приход() ИЛИ Отказ;
		
		// Проведем партии товаров
		Отказ=НЕ ПровестиПоПартиям(РежимПроведения,Ссылка) ИЛИ Отказ;
		
		НаборЗаписейЗакупкиПоЗаказам = Движения.ЗакупкиПоЗаказам;
		НаборЗаписейЗакупкиПоЗаказам.РежимПроведения=РежимПроведения;
		НаборЗаписейЗакупкиПоЗаказам.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейЗакупкиПоЗаказам.ЗаказОснование = ОсновнойЗаказ;
		НаборЗаписейЗакупкиПоЗаказам.Контрагент = Контрагент;
		НаборЗаписейЗакупкиПоЗаказам.ЗакрытиеЗаказовПоставщикам=ЗакрытиеЗаказовПоставщикам;
		Отказ = НЕ НаборЗаписейЗакупкиПоЗаказам.Приход() ИЛИ Отказ;
		
		// Способ ведения не по подразделениям или балансовые подразделения равны, то ничего не будем корректировать.
		Если ВедетсяБалансПоПодразделению И БалансовыеПодразделенияНеРавны Тогда	
			Если ХозОперация<>Справочники.ХозОперации.ПоступлениеТоваровКомиссия
				И ХозОперация<>Справочники.ХозОперации.ПоступлениеБезвозмездное Тогда
				СуммаПартий = Движения.ПартииТоваровКомпании.Итог("СуммаУпр");
				Если СуммаПартий<>0 Тогда
					НаборЗаписейДиР = Движения.ДоходыИРасходы;
					НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
					НаборЗаписейДиР.Подразделение = СкладКомпании.ПодразделениеКомпании;
					НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
					НаборЗаписейДиР.ВУпрВалюте = Истина;
					НаборЗаписейДиР.Доход = СуммаПартий;
					Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;	
				КонецЕсли;			
				
				НаборЗаписейДиР = Движения.ДоходыИРасходы;
				НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
				НаборЗаписейДиР.Подразделение = ДоговорВзаиморасчетов.ПодразделениеКомпании;
				НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
				НаборЗаписейДиР.ВУпрВалюте = Ложь;
				НаборЗаписейДиР.Расход = СуммаДокумента;
				Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;	
			КонецЕсли;
		КонецЕсли;	
	
	Иначе
		// Проведем услуги по доходам и расходам
		Запрос=Новый Запрос("ВЫБРАТЬ 
		| ПоступлениеТовары.Номенклатура.СтатьяДопРасходов КАК СтатьяРасходов,
		| ПоступлениеТовары.СуммаВсего
		| ПОМЕСТИТЬ ТаблицаТоваров
		| ИЗ Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТовары
		| ГДЕ ПоступлениеТовары.Ссылка = &ТекДок И ПоступлениеТовары.Номенклатура.ВидНоменклатуры = &Услуга;
		|
		| ВЫБРАТЬ
		|	ТаблицаТоваров.СтатьяРасходов КАК СтатьяРасходов,
		|	Сумма(ТаблицаТоваров.СуммаВсего) КАК СуммаУслуг
		|
		| ИЗ ТаблицаТоваров КАК ТаблицаТоваров
		|
		| СГРУППИРОВАТЬ ПО ТаблицаТоваров.СтатьяРасходов");
		
		Запрос.УстановитьПараметр("ТекДок",Ссылка);
		Запрос.УстановитьПараметр("Услуга",Перечисления.ВидыНоменклатуры.Услуга);
		Выборка=Запрос.Выполнить().Выбрать();
		СуммаУслуг = 0;
		Пока Выборка.Следующий() Цикл
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте=(ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Выборка.СтатьяРасходов;
			НаборЗаписейДоходыИРасходы.Расход=Выборка.СуммаУслуг;//
			СуммаУслуг=СуммаУслуг+Выборка.СуммаУслуг; 
			Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		КонецЦикла;
		// Если балансовые подразделение договора и подразделения склад не равны, то сформируем корректирующие проводки.
		Если ВедетсяБалансПоПодразделению И БалансовыеПодразделенияНеРавны Тогда
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.Подразделение = ДоговорВзаиморасчетов.ПодразделениеКомпании;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте=Ложь;
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДоходыИРасходы.Расход=СуммаУслуг;
			Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
			
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.Подразделение = ПодразделениеКомпании;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте=(ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДоходыИРасходы.Доход=СуммаУслуг;
			Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		КонецЕсли;
		
	КонецЕсли;
	
	// Если приходуем товар на розничный склад, то установим розничные цены на этот товар.
	Если НЕ Отказ И ХозОперация=Справочники.ХозОперации.ПоступлениеТоваров И СкладКомпании.Розничный И ПодразделениеКомпании.УстановкаЦенДокументамиПоступления И НЕ СкладКомпании.ТипЦенРозничнойТорговли.Рассчитывается Тогда
		НаборЗаписейЦены=Движения.Цены;
		НаборЗаписейЦены.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейЦены.Контрагент=Неопределено;
		НаборЗаписейЦены.ТипЦен=СкладКомпании.ТипЦенРозничнойТорговли;
		НаборЗаписейЦены.ПодразделениеКомпании = СкладКомпании.ПодразделениеКомпании;
		НаборЗаписейЦены.УстанавливатьЦеныУслуг=Ложь;
		НаборЗаписейЦены.ИмяРеквизитаЦена="ЦенаРозничная";
		Отказ = НЕ НаборЗаписейЦены.УстановитьЦены() ИЛИ Отказ;
	КонецЕсли;
	
	// Установим цены контрагентов
	Если НЕ Отказ И ХозОперация=Справочники.ХозОперации.ПоступлениеТоваров И ТипЦен.РегистрироватьЦеныПоПриходу И (ЗначениеЗаполнено(Контрагент)) И НЕ ТипЦен.Рассчитывается Тогда
		НаборЗаписейЦены=Движения.Цены;
		НаборЗаписейЦены.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейЦены.Контрагент=Контрагент;
		НаборЗаписейЦены.ТипЦен=ТипЦен;
		НаборЗаписейЦены.УстанавливатьЦеныУслуг=Истина;
		НаборЗаписейЦены.ИмяРеквизитаЦена="Цена";
		Отказ = НЕ НаборЗаписейЦены.УстановитьЦены() ИЛИ Отказ;
	КонецЕсли;
	
	// Установим закупочные цены компании
	Если НЕ Отказ И ПодразделениеКомпании.ФормироватьЗакупочнуюЦену И НЕ Справочники.ТипыЦен.ОсновнойТипЦенЗакупки.Рассчитывается Тогда
		НаборЗаписейЦены=Движения.Цены;
		НаборЗаписейЦены.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейЦены.Контрагент=Неопределено;
		НаборЗаписейЦены.ИмяРеквизитаЦена="Цена";
		Если ТипЦен.ЦенаВключаетНДС И НЕ Справочники.ТипыЦен.ОсновнойТипЦенЗакупки.ЦенаВключаетНДС Тогда
			НаборЗаписейЦены.ПересчитатьСУчетомНДС = Истина;
		ИначеЕсли НЕ ТипЦен.ЦенаВключаетНДС И Справочники.ТипыЦен.ОсновнойТипЦенЗакупки.ЦенаВключаетНДС Тогда
			НаборЗаписейЦены.ПересчитатьСУчетомНДС = Ложь;
		КонецЕсли;
		НаборЗаписейЦены.ТипЦен=Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
		Отказ = НЕ НаборЗаписейЦены.УстановитьЦены() ИЛИ Отказ;
	КонецЕсли;
	
	// Установим нормативные цены компании
	Если НЕ Отказ И ПодразделениеКомпании.ФормироватьНормативнуюЦену И НЕ Справочники.ТипыЦен.НормативнаяЦена.Рассчитывается И НЕ Справочники.ТипыЦен.НормативнаяЦена.ЦенаВключаетНДС Тогда
		НаборЗаписейЦены=Движения.Цены;
		НаборЗаписейЦены.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейЦены.Контрагент=Неопределено;
		НаборЗаписейЦены.ИмяРеквизитаЦена="Цена";
		Если ТипЦен.ЦенаВключаетНДС = Истина Тогда
			НаборЗаписейЦены.ПересчитатьСУчетомНДС = Истина;
		КонецЕсли;
		НаборЗаписейЦены.ТипЦен=Справочники.ТипыЦен.НормативнаяЦена;
		Отказ = НЕ НаборЗаписейЦены.УстановитьЦены() ИЛИ Отказ;
	КонецЕсли;
	
	// Регистрируем состояния кодов маркировки
	Если НЕ Отказ И ХозОперация=Справочники.ХозОперации.ПоступлениеТоваров и Марки.Количество() > 0 Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ПоступлениеТоваровМарки.КодМарки КАК КодМаркировки,
		|	ПоступлениеТоваровМарки.GTIN КАК GTIN,
		|	ПоступлениеТоваровМарки.СерийныйНомер КАК СерийныйНомер,
		|	ПоступлениеТоваровМарки.НормализованныйКодМарки КАК НормализованныйКодМарки,
		|	ПоступлениеТоваровТовары.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровМарки.Ссылка КАК ДокументОснование
		|ИЗ
		|	Документ.ПоступлениеТоваров.Марки КАК ПоступлениеТоваровМарки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
		|		ПО ПоступлениеТоваровМарки.Ссылка = ПоступлениеТоваровТовары.Ссылка
		|			И ПоступлениеТоваровМарки.ИдентификаторСтроки = ПоступлениеТоваровТовары.ИдентификаторСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияКодовМаркировки КАК СостоянияКодовМаркировки
		|		ПО ПоступлениеТоваровМарки.Ссылка = СостоянияКодовМаркировки.ДокументОснование
		|			И ПоступлениеТоваровМарки.КодМарки = СостоянияКодовМаркировки.КодМаркировки
		|ГДЕ
		|	ПоступлениеТоваровТовары.Номенклатура.ОсобенностьУчета.итРегистрироватьСостоянияКодовМаркировкиПриПриемке
		|	И СостоянияКодовМаркировки.КодМаркировки ЕСТЬ NULL
		|	И ПоступлениеТоваровМарки.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Результат = Запрос.Выполнить();
		ВыборкаЗапроса = Результат.Выбрать();
		
		Пока ВыборкаЗапроса.Следующий() Цикл
			регСостоянияКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(регСостоянияКодовМаркировки, ВыборкаЗапроса);
			Если Лев(Прав(регСостоянияКодовМаркировки.КодМаркировки,6),2)="93" Тогда
				регСостоянияКодовМаркировки.КодМаркировки = стрЗаменить(регСостоянияКодовМаркировки.КодМаркировки,Прав(регСостоянияКодовМаркировки.КодМаркировки,6),"");
			КонецЕсли;
			регСостоянияКодовМаркировки.Состояние = Перечисления.СостоянияКодовМаркировки.Неопределен;
			регСостоянияКодовМаркировки.Записать(Истина);
		КонецЦикла;
	КонецЕсли;	
	// Возможно расхождение баланса на "копейки" из-за округления.
	// Возникшую разницу необходимо списать на доходы и расходы.
	Отказ = НЕ ОбработкаСобытийДокументаСервер.СписаниеКопейкиПриОкругленииВалютныхСчетов(ЭтотОбъект) ИЛИ Отказ;
	
	РаботаСГраницами.СдвинутьГраницуВзаиморасчетов(Ссылка, ДополнительныеСвойства, Движения);
	РаботаСГраницами.СдвинутьГраницуЗаказов(Ссылка,  ДополнительныеСвойства, Движения);
	
КонецПроцедуры // ОбработкаПроведения()

//Мальцев А.Ю. +++
Процедура ДобавитьАналогиВСписок(СписокНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыАналогов.ИдентификаторГруппы КАК ИдентификаторГруппы
	|ПОМЕСТИТЬ втИдентификаторы
	|ИЗ
	|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	|ГДЕ
	|	ГруппыАналогов.Номенклатура В(&массивНоменклатуры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыАналогов.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИдентификаторы КАК втИдентификаторы
	|		ПО ГруппыАналогов.ИдентификаторГруппы = втИдентификаторы.ИдентификаторГруппы
	//|			И (ГруппыАналогов.Приоритет > 0)
	|			И (НЕ ГруппыАналогов.Номенклатура В (&МассивНоменклатуры))";
	
	Запрос.УстановитьПараметр("массивНоменклатуры", СписокНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокНоменклатуры.Добавить(ВыборкаДетальныеЗаписи.Номенклатура);
	КонецЦикла;

КонецПроцедуры

#Область Инициализация

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// Установим параметры проверки документа
ДополнительныеСвойства.Вставить("ТоварыЗапретАвтоСписанияХарактеристик", ИСТИНА);

#КонецОбласти

#КонецЕсли