// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает визуализацию электронного документа.
//
// Параметры:
//  ИдентификаторДокумента - Строка
//  ПараметрыВизуализацииВСервисе - Структура:
//  * ВыводитьДопДанные - Булево
//  * ВыводитьБанковскиеРеквизиты - Булево
//  * ВыводитьКопияВерна - Булево
//  * ПодсказкаQRКода - Строка
//  * ПубличнаяСсылкаQRКода - Строка
//  ТребуетсяОбновитьКэш - Булево - Признак необходимости обновить кэш в облаке
// 
// Возвращаемое значение:
//  - Неопределено
//  - См. ВизуализацияДокументаЭДОВФорматеСервиса
Функция ВизуализацияДокументаЭДО(ИдентификаторДокумента, ПараметрыВизуализацииВСервисе = Неопределено, ТребуетсяОбновитьКэш = Ложь) Экспорт

	ЭлектронныйДокумент = ЭлектронныеДокументыЭДОЦентрЭДО.ДокументПоИдентификатору(ИдентификаторДокумента);
	Если Не ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЦентрЭДО.АвторизованСлужебныйПользователь() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйДокумент,
		"ПометкаУдаления, ВидДокумента, ФорматОсновногоТитула");
	ДанныеДокументаДляФормированияВизуализации =
		ЭлектронныеДокументыЭДО.НовыеСвойстваДокументаДляФормированияВизуализации();
	ДанныеДокументаДляФормированияВизуализации.Ссылка = ЭлектронныйДокумент;
	ДанныеДокументаДляФормированияВизуализации.ВидДокумента = РеквизитыДокумента.ВидДокумента;
	ДанныеДокументаДляФормированияВизуализации.ТипДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			РеквизитыДокумента.ВидДокумента, "ТипДокумента");
	ДанныеДокументаДляФормированияВизуализации.ТипЭлементаРегламента =
		Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя;
	
	ПараметрыВизуализации = ВизуализацияЭДОСлужебный.НовыеПараметрыВизуализацииДокумента();
	ЗаполнитьЗначенияСвойств(ПараметрыВизуализации, ПараметрыВизуализацииВСервисе);
	ПараметрыВизуализации.Формат = РеквизитыДокумента.ФорматОсновногоТитула;

	РезультатФормирования = ВизуализацияЭДО.ВизуализацияДокумента(ДанныеДокументаДляФормированияВизуализации,
		ПараметрыВизуализации, ТребуетсяОбновитьКэш);

	Возврат ВизуализацияДокументаЭДОВФорматеСервиса(ЭлектронныйДокумент, РезультатФормирования);

КонецФункции
	
// Возвращает представление xml файлов электронного документа.
// 
// Параметры:
//  ФайлыДокумента - Массив из Структура:
//  * ИмяФайла - Строка
//  * Данные - Строка - двоичные данные в формате base64.
//  ВидДокумента - Структура:
//  * Наименование - Строка
//  * ТипДокумента - Строка
//  Формат - Строка
//  ПараметрыВизуализации - Структура:
//  * ВыводитьДопДанные - Булево
//  * ВыводитьБанковскиеРеквизиты - Булево
//  * ВыводитьКопияВерна - Булево
//  * ПодсказкаQRКода - Строка
//  * ПубличнаяСсылкаQRКода - Строка
// 
// Возвращаемое значение:
//  - Неопределено
//  - См. ВизуализацияДокументаЭДОВФорматеСервиса
//  
Функция ВизуализацияФайловДокументаЭДО(ФайлыДокумента, ВидДокумента, Формат, ПараметрыВизуализации = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(ФайлыДокумента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЦентрЭДО.АвторизованСлужебныйПользователь() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ВидыДокументовИзФорматаСервиса = ЭлектронныеДокументыЭДОЦентрЭДО.ВидыДокументовИзФорматаСервиса(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВидДокумента));
	ВидДокументаИзФорматаСервиса = ВидыДокументовИзФорматаСервиса[ВидДокумента.ТипДокумента];
	ТипДокументаИзФорматаСервиса = ЭлектронныеДокументыЭДОЦентрЭДО.ТипДокументаИзФорматаСервиса(
			ВидДокумента.ТипДокумента);

	ФайлОсновногоТитула = ФайлыДокумента[0];
	ФайлОтветногоТитула = Неопределено;
	ФорматОтветногоФайла = ФорматыЭДО.ФорматОтветногоТитула(Формат);
	Если ФайлыДокумента.Количество() > 1 И ФорматОтветногоФайла <> Неопределено Тогда
		ФайлОтветногоТитула = ФайлыДокумента[1];
	КонецЕсли;
	ДвоичныеДанныеФайлаОсновногоТитула = Base64Значение(ФайлОсновногоТитула.Данные);

	ПараметрыПредварительнойВизуализации = 
		ВизуализацияЭДО.НовыеПараметрыПредварительнойВизуализацииДокумента();
	ЗаполнитьЗначенияСвойств(ПараметрыПредварительнойВизуализации.ПараметрыВизуализации, ПараметрыВизуализации);
	ПараметрыПредварительнойВизуализации.ВидДокумента = ВидДокументаИзФорматаСервиса;
	ПараметрыПредварительнойВизуализации.ТипДокумента = ТипДокументаИзФорматаСервиса;
	ПараметрыПредварительнойВизуализации.ФорматОсновногоТитула = Формат;
	ПараметрыПредварительнойВизуализации.ИмяФайла = ФайлОсновногоТитула.ИмяФайла;
	ПараметрыПредварительнойВизуализации.ДвоичныеДанныеФайла = ДвоичныеДанныеФайлаОсновногоТитула;
	Если ЗначениеЗаполнено(ФайлОтветногоТитула) Тогда
		ПараметрыПредварительнойВизуализации.ДвоичныеДанныеФайлаОтвета = ФайлОтветногоТитула.Данные;
	КонецЕсли;

	РезультатФормирования = ВизуализацияЭДО.ПредварительнаяВизуализацияДокумента(
			ПараметрыПредварительнойВизуализации);

	Возврат ВизуализацияФайловДокументаЭДОВФорматеСервиса(РезультатФормирования, ДвоичныеДанныеФайлаОсновногоТитула);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//  ВизуализацияДокумента - См. ВизуализацияЭДО.ВизуализацияДокумента
// 
// Возвращаемое значение:
//  См. НовыеСвойстваВизуализацииДокументаЭДОВФорматеСервиса
Функция ВизуализацияДокументаЭДОВФорматеСервиса(ЭлектронныйДокумент, ВизуализацияДокумента)
	
	СвойстваВизуализации = НовыеСвойстваВизуализацииДокументаЭДОВФорматеСервиса();
	СвойстваВизуализации.ПолученИзКэша = ВизуализацияДокумента.ПолученИзКэша;
	СвойстваВизуализации.ТипДанных = ОбщегоНазначения.ИмяЗначенияПеречисления(ВизуализацияДокумента.ТипДанных);
	
	ФайлИнформацииОтправителя = ЭлектронныеДокументыЭДО.ОсновнойФайлИнформацииОтправителя(ЭлектронныйДокумент);
	ДвоичныеДанныеИнформацииОтправителя = РаботаСФайлами.ДвоичныеДанныеФайла(ФайлИнформацииОтправителя, Ложь);
	СвойстваВизуализации.РазмерФайла = ДвоичныеДанныеИнформацииОтправителя.Размер();
	СвойстваВизуализации.ИмяФайла = ВизуализацияДокумента.ИмяФайла;
	СвойстваВизуализации.РасширениеФайла = ВизуализацияДокумента.РасширениеФайла;
	Если ВизуализацияДокумента.ТипДанных = Перечисления.ТипыДанныхВизуализацииДокументаЭДО.ТабличныйДокумент Тогда
		Поток = Новый ПотокВПамяти;
		ВизуализацияДокумента.ПредставлениеДокумента.Записать(Поток);
		ДвоичныеДанныеВизуализации = Поток.ЗакрытьИПолучитьДвоичныеДанные();
		
		СвойстваВизуализации.Данные = Base64Строка(ДвоичныеДанныеВизуализации);
		
	ИначеЕсли ВизуализацияДокумента.ТипДанных = Перечисления.ТипыДанныхВизуализацииДокументаЭДО.HTMLДокумент Тогда
		СвойстваВизуализации.Данные = ВизуализацияДокумента.ПредставлениеДокумента;

	Иначе
		СвойстваВизуализации.Данные = Base64Строка(ВизуализацияДокумента.ПредставлениеДокумента);
		
	КонецЕсли;
	//@skip-check property-return-type
	ЗаполнитьЗначенияСвойств(СвойстваВизуализации.НастройкиПредставления, ВизуализацияДокумента.НастройкиПредставления);
	ЗаполнитьЗначенияСвойств(СвойстваВизуализации.ПользовательскиеНастройкиПредставления, 
		ВизуализацияДокумента.ПользовательскиеНастройкиПредставления);
	Возврат СвойстваВизуализации;
	
КонецФункции

// Параметры:
//  ПредварительнаяВизуализация - См. ВизуализацияЭДО.ВизуализацияДокумента
//  ДвоичныеДанныеФайлаОсновногоТитула - ДвоичныеДанные
// 
// Возвращаемое значение:
//  См. НовыеСвойстваВизуализацииДокументаЭДОВФорматеСервиса
Функция ВизуализацияФайловДокументаЭДОВФорматеСервиса(ПредварительнаяВизуализация,
	ДвоичныеДанныеФайлаОсновногоТитула)
	
	СвойстваВизуализации = НовыеСвойстваВизуализацииДокументаЭДОВФорматеСервиса();
	СвойстваВизуализации.ИмяФайла = ПредварительнаяВизуализация.ИмяФайла;
	СвойстваВизуализации.ТипДанных = ОбщегоНазначения.ИмяЗначенияПеречисления(ПредварительнаяВизуализация.ТипДанных);
	СвойстваВизуализации.РазмерФайла = ДвоичныеДанныеФайлаОсновногоТитула.Размер();
	СвойстваВизуализации.ПолученИзКэша = ПредварительнаяВизуализация.ПолученИзКэша;
	
	Если ПредварительнаяВизуализация.ТипДанных = Перечисления.ТипыДанныхВизуализацииДокументаЭДО.ТабличныйДокумент Тогда
		Поток = Новый ПотокВПамяти;
		ПредварительнаяВизуализация.ПредставлениеДокумента.Записать(Поток);
		ДвоичныеДанныеВизуализации = Поток.ЗакрытьИПолучитьДвоичныеДанные();
		СвойстваВизуализации.Данные = Base64Строка(ДвоичныеДанныеВизуализации);
	ИначеЕсли ПредварительнаяВизуализация.ТипДанных = Перечисления.ТипыДанныхВизуализацииДокументаЭДО.HTMLДокумент Тогда
		СвойстваВизуализации.Данные = ПредварительнаяВизуализация.ПредставлениеДокумента;
	Иначе
		Если ЗначениеЗаполнено(ПредварительнаяВизуализация.ПредставлениеДокумента) Тогда
			СвойстваВизуализации.Данные = Base64Строка(ПредварительнаяВизуализация.ПредставлениеДокумента);
		КонецЕсли;
	КонецЕсли;
	
	//@skip-check property-return-type
	ЗаполнитьЗначенияСвойств(СвойстваВизуализации.НастройкиПредставления, 
		ПредварительнаяВизуализация.НастройкиПредставления);
	
	ЗаполнитьЗначенияСвойств(СвойстваВизуализации.ПользовательскиеНастройкиПредставления, 
		ПредварительнаяВизуализация.ПользовательскиеНастройкиПредставления);
	
	Возврат СвойстваВизуализации;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ИмяФайла - Строка - имя прикрепленного файла.
//  * РасширениеФайла - Строка - имя прикрепленного файла.
//  * Данные - Строка - двоичные данные в формате base64/строка html.
//  * ТипДанных - Строка - имя значения перечисления Перечисления.ТипыДанныхВизуализацииДокументаЭДО
//  * НастройкиПредставления - См. ВизуализацияЭДО.НовыеНастройкиПредставления
//  * РазмерФайла - Число
//  * ПолученИзКэша - Булево - получен из кэша в облаке
//  * ПользовательскиеНастройкиПредставления - См. ВизуализацияЭДО.ПользовательскиеНастройкиПредставления
Функция НовыеСвойстваВизуализацииДокументаЭДОВФорматеСервиса()
	Свойства = Новый Структура;
	Свойства.Вставить("ИмяФайла", "");
	Свойства.Вставить("РасширениеФайла", "");
	Свойства.Вставить("Данные", "");
	Свойства.Вставить("ТипДанных", "");
	Свойства.Вставить("РазмерФайла", 0);
	Свойства.Вставить("НастройкиПредставления", ВизуализацияЭДО.НовыеНастройкиПредставления());
	Свойства.Вставить("ПолученИзКэша", Ложь);
	Свойства.Вставить("ПользовательскиеНастройкиПредставления", 
		ВизуализацияЭДО.ПользовательскиеНастройкиПредставления());
	
	Возврат Свойства;
КонецФункции

#КонецОбласти
