//порядковый номер версии: 8.2.000326

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем Текст,
спСоответствияСправочников,
спСоответствияПеречислений,
спСоответствияДокументов,
ИмяОперации,
тзЭлементов,
тзДокументов,
тзСравнения,
ПервыйОбъект,
ПервыйСправочник,  // признак первого выгружаемого справочника
ОбщееОписание,
КонецБлокаДанных;
Перем тзПодтверждения Экспорт;
Перем тзСоответствий Экспорт;	  // Таблица соответствий объектов (для текстового варианта)
Перем СубконтоДт1, СубконтоДт2, СубконтоДт3, СубконтоКт1, СубконтоКт2, СубконтоКт3; // Субконто счетов
Перем ПервыйЗапуск Экспорт;
Перем RecordSet Экспорт;
Перем Connection Экспорт;
Перем Command Экспорт;
Перем ЭтоВерсияКорп Экспорт;
Перем Лог Экспорт;

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	
	ПараметрыРегистрации.Вид			 = "ДополнительнаяОбработка";
	ПараметрыРегистрации.Версия			 = "8.2.000326";
	//ПараметрыРегистрации.Назначение		 = Неопределено;
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.ВерсияБСП		 = Метаданные.Версия;

	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Загрузка данных из ТКПТ v.8 Гастроном'");
	НоваяКоманда.Идентификатор = "ОткрытьГлобально";
	НоваяКоманда.Использование = "ОткрытиеФормы";
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	
	//НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	//НоваяКоманда.Представление = НСтр("ru = 'Автоматическая загрузка данных из ТКПТ v.8'");
	//НоваяКоманда.Идентификатор = "ВыполнитьЗагрузкуДанных";
	//НоваяКоманда.Использование = "ВызовСерверногоМетода";
	//НоваяКоманда.ПоказыватьОповещение = Истина;
	
	Возврат ПараметрыРегистрации;
КонецФункции //СведенияОВнешнейОбработке()

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполненияКоманды) Экспорт
	Если ИдентификаторКоманды="ВыполнитьЗагрузкуДанных" Тогда
		//Переменные
		СтрокаПодключения = "???";
		КаталогОбмена = "C:";
		//////////
		
		Попытка
			Connection = Новый COMОбъект("ADODB.Connection");
			Connection.Open(СокрЛП(СтрокаПодключения));
			Command = Новый COMОбъект("ADODB.Command");
			Command.ActiveConnection = Connection;
			RecordSet = Новый COMОбъект("ADODB.Recordset");
		Исключение
			ТекстСообщения = "Ошибка подключения к БД соответствий объектов";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
		
		//ЗаполнитьСписокДоступныхДляЗагрузкиФайлов();
		НайденныеФайлы = НайтиФайлы(КаталогОбмена, "*.txt");
		СписокФайлов.Очистить();
		Для Индекс=0 По НайденныеФайлы.ВГраница() Цикл
			ИмяФайла = НайденныеФайлы[Индекс].ПолноеИмя;
			Если СтрЧислоВхождений(ИмяФайла, "unload_TK_")=0 Тогда Продолжить; КонецЕсли;
			
			Попытка
				Текст1 = Новый ТекстовыйДокумент();
				Текст1.Прочитать(ИмяФайла);
			Исключение
				Продолжить;
			КонецПопытки;
			
			СписокФайлов.Добавить(ИмяФайла, , Ложь);
		КонецЦикла;
		
		СписокФайлов.СортироватьПоЗначению(НаправлениеСортировки.Возр);
		//--------------------------------------------
		
		Индекс = 0;
		Если СписокФайлов.Количество()>0 Тогда
			Пока Индекс<=(СписокФайлов.Количество()-1) Цикл
				
				ФайлЗагрузки = СписокФайлов[Индекс].Значение;
				
				//Текст = ЗагрузитьНачальныеДанные(ФайлЗагрузки);
				Текст = Новый ТекстовыйДокумент();
				Текст.Прочитать(ФайлЗагрузки);	
				ТекущаяСтрока		= Текст.ПолучитьСтроку(1);
				ТекущаяСтрока		= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
				ИдентификаторБазы	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
				НомерРелиза			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
				ДляРелизаБух		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
				ВерсияОбменаТК		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
				ДатаВыгрузки		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
				ВыгрузкаС			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
				ВыгрузкаПо			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
				ЕстьНоменклатура	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
				ВыгрузкаЗаПериод	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
				ВерсияПлатформы		= СокрЛП(ТекущаяСтрока);
				
				ЗагрузкаНоменклатуры = (ЕстьНоменклатура="Истина");
				ЗагрузкаИзменений = (ВыгрузкаЗаПериод="Ложь");
				
				ТекстСообщения = "Загрузка данных из "+ВосстПредстРеквизита(ИдентификаторБазы)+" (выгрузка от "+СокрЛП(ДатаВыгрузки)+") за период с "+СокрЛП(ВыгрузкаС)+" по "+СокрЛП(ВыгрузкаПо);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				//------------------------------------------------
				ТекстПодтверждения = ""; Лог = Новый ТекстовыйДокумент;
				
				Загрузить(Текст, "", ТекстПодтверждения, Лог);
				
				Если ЗагрузкаИзменений И ЗначениеЗаполнено(ТекстПодтверждения) Тогда
					ТекстПодтв = Новый ЗаписьТекста(КаталогОбмена + "\" + "tk_rcpt_" + Формат(ТекущаяДата(), "ДФ=yyyyMMdd_HHmmss") + ".xml");
					ТекстПодтв.Записать(ТекстПодтверждения);
					ТекстПодтв.Закрыть();
				КонецЕсли;
				
				Лог.Записать(КаталогОбмена + "\" + "bp_log_" + Формат(ТекущаяДата(), "ДФ=yyyyMMdd_HHmmss") + ".txt");
				
				УдалитьФайлы(ФайлЗагрузки);
					
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры //ВыполнитьКоманду()

Функция обЗначениеНеЗаполнено(Значение) Экспорт

	Результат = Ложь;
	ТипЗначения = ТипЗнч(Значение);

	// Сначала примитивные типы
	Если Значение=Неопределено Тогда
		Результат = Истина;
	ИначеЕсли Значение=NULL Тогда
		Результат = Истина;
	ИначеЕсли ТипЗначения=Тип("Строка") Тогда
		Если СокрЛП(Значение)="" Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения=Тип("Число") Тогда
		Если Значение=0 Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения=Тип("Дата") Тогда
		Если Значение=Дата('00010101') Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения=Тип("Булево") Тогда
		Результат = Ложь; // Булево будем считать не пустым
	ИначеЕсли ТипЗначения=Тип("МоментВремени") Тогда
		Если Значение.Дата=Дата('00010101') Тогда
			Результат = Истина;
		КонецЕсли; 
	ИначеЕсли ТипЗначения=Тип("COMОбъект") Тогда
		Результат = Ложь; // Если уж он объект, значит не пустой
	ИначеЕсли ТипЗначения=Тип("СписокЗначений") Тогда
		Если Значение.Количество()<1 Тогда
			Результат = Истина;
		КонецЕсли;
	ИначеЕсли ТипЗначения=Тип("ХранилищеЗначения") Тогда
		Если Значение.Получить()=Неопределено Тогда
			Результат = Истина;
		КонецЕсли; 
		
	// Для остальных будем считать значение пустым, если оно равно
	// дефолтному значению своего типа
	Иначе
		Если Значение=Новый(ТипЗначения) Тогда
			Результат = Истина;
		КонецЕсли; 
	КонецЕсли; 

	Возврат Результат;
	
КонецФункции // обЗначениеНеЗаполнено()

Функция обНайтиПодчиненныйСчФ(ДокументСсылка, ВидДокумента="СчетФактураВыданный") Экспорт
	НайденныйДокумент = Неопределено;

	Если НЕ обЗначениеНеЗаполнено(ДокументСсылка) Тогда
		Запрос = Новый Запрос;
		// Установим параметры запроса
		Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка
		|ИЗ
		|	Документ." + ВидДокумента + " 
		|ГДЕ
		|	ДокументОснование = &ДокументСсылка";
		ВыборкаИзЗапроса = Запрос.Выполнить().Выбрать();

		Если ВыборкаИзЗапроса.Следующий() Тогда
			НайденныйДокумент = ВыборкаИзЗапроса.Ссылка;
		КонецЕсли;
	КонецЕсли;

	Возврат НайденныйДокумент;
КонецФункции // обНайтиПодчиненныйСчФ()

Функция НайтиОбъектПоGUID(GUID=Неопределено, ТипОбъекта=Неопределено) 
	Объект = Неопределено;
	
	Если ТекстоваяТС Тогда
		Если GUID<>Неопределено Тогда
			СтруктураПоиска = Новый Структура("ObjectTCID", GUID);
		Иначе
			Возврат Объект;
		КонецЕсли;
		Если ТипОбъекта<>Неопределено Тогда
			СтруктураПоиска.Вставить("ObjectTCType", ТипОбъекта);
		КонецЕсли;
		Попытка               
			СтрокаПоиска = тзСоответствий.НайтиСтроки(СтруктураПоиска);
		Исключение
			ТекстСообщения = "Ошибка выполнения поиска объекта по идентификатору: " + ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Объект;
		КонецПопытки;
		
		Если СтрокаПоиска.Количество()>0 Тогда
			IDобъектаБух  = СокрЛП(СтрокаПоиска[0].ObjectBPID);
			ТипОбъектаБух = СокрЛП(СтрокаПоиска[0].ObjectBPType);
			ОбъектМетаданных = Неопределено;
			Если СтрЧислоВхождений(ТипОбъектаБух,"Справочник")>0 Тогда
				// получаем справочник Бух
				ОбъектМетаданных = Справочники[Сред(ТипОбъектаБух, Найти(ТипОбъектаБух, ".") + 1)];
				//ТекстЗапр = "ВЫБРАТЬ Код ИЗ " + ТипОбъектаБух + " ГДЕ Ссылка=&Ссылка";
				ТекстЗапр = "ВЫБРАТЬ Наименование ИЗ " + ТипОбъектаБух + " ГДЕ Ссылка=&Ссылка";
			ИначеЕсли СтрЧислоВхождений(ТипОбъектаБух,"Документ")>0 Тогда
				// получаем документ Бух
				ОбъектМетаданных = Документы[Сред(ТипОбъектаБух, Найти(ТипОбъектаБух, ".") + 1)];
				ТекстЗапр = "ВЫБРАТЬ Номер ИЗ " + ТипОбъектаБух + " ГДЕ Ссылка=&Ссылка";
			Иначе
				Возврат Объект;
			КонецЕсли;
			// получаем ссылку на объект
			Объект = ОбъектМетаданных.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(IDобъектаБух)));
		КонецЕсли;
		
		// проверим наличие самого объекта в базе
		Если Объект<>Неопределено Тогда
			Запрос = Новый Запрос(ТекстЗапр);
			Запрос.УстановитьПараметр("Ссылка", Объект);
			Рез = Запрос.Выполнить().Выбрать();
			Если НЕ Рез.Следующий() Тогда
				// почистим битую ссылку
				Попытка
					тзСоответствий.Удалить(СтрокаПоиска[0]);
				Исключение 
					ТекстСообщения = "Ошибка выполнения команды удаления битой ссылки" + ОписаниеОшибки();
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Лог.ДобавитьСтроку(ТекстСообщения);
				КонецПопытки;	
				// нет объекта
				Объект = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		Если НЕ обЗначениеНеЗаполнено(GUID) Тогда
			ТекстЗапроса = "SELECT ObjectBPID, ObjectBPType FROM TCBP WHERE ObjectTCID = '" + GUID + "'";
		Иначе
			Возврат Объект;
		КонецЕсли;
		
		Если НЕ обЗначениеНеЗаполнено(ТипОбъекта) Тогда
			ТекстЗапроса = ТекстЗапроса + " AND ObjectTCType = '" + ТипОбъекта + "'";
		КонецЕсли;
		
		Попытка               
			RecordSet.Open(ТекстЗапроса, Connection, 2, 3, 1);	
		Исключение 
			ТекстСообщения = "Ошибка выполнения SQL запроса: " + ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Объект;
		КонецПопытки;
		
		Если НЕ RecordSet.EOF Тогда
			IDобъектаБух = СокрЛП(RecordSet.Fields("ObjectBPID").Value);
			ТипОбъектаБух = СокрЛП(RecordSet.Fields("ObjectBPType").Value);
			ОбъектМетаданных = Неопределено;
			Если СтрЧислоВхождений(ТипОбъектаБух,"Справочник")>0 Тогда
				// получаем справочник Бух
				ОбъектМетаданных = Справочники[Сред(ТипОбъектаБух, Найти(ТипОбъектаБух, ".") + 1)];
				//ТекстЗапр = "ВЫБРАТЬ Код ИЗ " + ТипОбъектаБух + " ГДЕ Ссылка=&Ссылка";
				ТекстЗапр = "ВЫБРАТЬ Наименование ИЗ " + ТипОбъектаБух + " ГДЕ Ссылка=&Ссылка";
			ИначеЕсли СтрЧислоВхождений(ТипОбъектаБух,"Документ")>0 Тогда
				// получаем документ Бух
				ОбъектМетаданных = Документы[Сред(ТипОбъектаБух, Найти(ТипОбъектаБух, ".") + 1)];
				ТекстЗапр = "ВЫБРАТЬ Номер ИЗ " + ТипОбъектаБух + " ГДЕ Ссылка=&Ссылка";
			Иначе
				Возврат Объект;
			КонецЕсли;
			// получаем ссылку на объект
			Объект = ОбъектМетаданных.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(IDобъектаБух)));
		КонецЕсли;
		RecordSet.Close();
		
		// проверим наличие самого объекта в базе
		Если Объект<>Неопределено Тогда
			Запрос = Новый Запрос(ТекстЗапр);
			Запрос.УстановитьПараметр("Ссылка", Объект);
			Рез = Запрос.Выполнить().Выбрать();
			Если НЕ Рез.Следующий() Тогда
				// почистим битую ссылку
				ТекстЗапроса = "DELETE FROM TCBP WHERE ObjectTCID = '" + GUID + "'";
				Если ТипОбъекта<>Неопределено Тогда
					ТекстЗапроса = ТекстЗапроса + " AND ObjectTCType = '" + ТипОбъекта + "'";
				КонецЕсли;
				Попытка
					Command.CommandText = ТекстЗапроса;
					Result = Command.Execute();
				Исключение 
					ТекстСообщения = "Ошибка выполнения команды " + ОписаниеОшибки();
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Лог.ДобавитьСтроку(ТекстСообщения);
				КонецПопытки;	
				// нет объекта
				Объект = Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Объект;
КонецФункции //НайтиОбъектПоGUID()

Функция ЗаписатьGUIDОбъекта(Объект, IDобъектаТК, ТипОбъектаТК) 
	Если обЗначениеНеЗаполнено(Объект) Тогда
		Возврат Ложь;
	КонецЕсли;
	ТипОбъектаБух = ?(Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Объект)), "Справочник.", "Документ.") + Объект.Метаданные().Имя;
	ТекстЗапроса = "INSERT INTO TCBP (ObjectTCID,ObjectTCType,ObjectBPID,ObjectBPType) VALUES ('" + СокрЛП(IDобъектаТК) + "','" + СокрЛП(ТипОбъектаТК) + "','" + СокрЛП(Объект.УникальныйИдентификатор()) + "','" + СокрЛП(ТипОбъектаБух) + "')";
	Попытка               
		Если ТекстоваяТС Тогда
			НоваяСтрока = тзСоответствий.Добавить();
			НоваяСтрока.ObjectTCID		= СокрЛП(IDобъектаТК);
			НоваяСтрока.ObjectTCType	= СокрЛП(ТипОбъектаТК);
			НоваяСтрока.ObjectBPID		= СокрЛП(Объект.УникальныйИдентификатор());
			НоваяСтрока.ObjectBPType	= СокрЛП(ТипОбъектаБух);
		Иначе
			Command.CommandText = ТекстЗапроса;
			Result = Command.Execute();
		КонецЕсли;
	Исключение 
		ТекстСообщения = "Ошибка записи в базу соответствий объектов ! " + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции //ЗаписатьGUIDОбъекта()

// Функция возвращает очищенную от <СтрСимв> символов строку <СтрВозв>
//
Функция УбратьСимволы(СтрВозв, СтрСимв) 
	Если обЗначениеНеЗаполнено(СтрСимв) Тогда Возврат СтрВозв; КонецЕсли;
	Для к=1 По СтрДлина(СтрСимв) Цикл
		ТекСимв = Сред(СтрСимв, к, 1);
		СтрВозв = СтрЗаменить(СтрВозв, ТекСимв, "");
	КонецЦикла;
	
	Возврат СтрВозв;
КонецФункции  // УбратьСимволы()

Функция УдалитьВедущиеНули(Значение) 
	Пока 1=1 Цикл
		ПервыйСимвол = Лев(Значение, 1);
		Если ПервыйСимвол<>"0" Тогда
			Прервать;
		КонецЕсли;   
		Значение = Прав(Значение, СтрДлина(Значение) - 1);
	КонецЦикла;
	
	Возврат Значение;
КонецФункции // УдалитьВедущиеНули()

Функция ПреобразоватьСчет(Сч) 
	ВремСч = СокрЛП(Сч);
	//Если Сч="" тогда
	//	Возврат "";
	//КонецЕсли;
	//
	//Если Сред(ВремСч,3,1)="." тогда
	//	Если СтрДлина(ВремСч)=4 тогда
	//		ВремСч = Лев(ВремСч, 3) + "0" + Прав(ВремСч, 1);
	//	ИначеЕсли СтрДлина(ВремСч)=6 тогда
	//		ВремСч = Лев(ВремСч, 3) + "0" + Прав(ВремСч, 3);
	//	КонецЕсли;
	//КонецЕсли;
	
	Возврат ВремСч;
КонецФункции //ПреобразоватьСчет()

Функция ПроверкаДоговора(Знач Договор, Знач Документ)
	ТекстСообщения = "";
	Если ТипЗнч(Договор)<>Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		ТекстСообщения = "Отсутствует договор контрагента " + Документ.Контрагент + ", в документе " + Документ + " !";
	ИначеЕсли Договор.Организация<>Документ.Организация Тогда
		ТекстСообщения = "Организация договора " + Договор + " (" + Договор.Владелец + ")" + " не соответствует организации в документе " + Документ + " !";
	ИначеЕсли Договор.Владелец<>Документ.Контрагент Тогда
		ТекстСообщения = "Владелец договора " + Договор + " (" + Договор.Владелец + ")" + " не соответствует контрагенту в документе " + Документ + " !";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
	КонецЕсли;
	
	Если (Найти(Документ.ВидОперации,"Покупка")>0 И Договор.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПокупателем)
		ИЛИ (Найти(Документ.ВидОперации,"Продажа")>0 И Договор.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком) Тогда
		ТекстСообщения = "Вид договора " + Договор + " (" + Договор.Владелец + ")" + " возможно не соответствует типу документа " + Документ + " !";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
	КонецЕсли;
	
	Возврат Договор;	
КонецФункции //ПроверкаДоговора()

Функция ПолучитьОсновнойДоговор(ВладелецДоговора, ОрганизацияДоговора)
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Ссылка,
	|	НЕ ОсновныеДоговорыКонтрагента.Договор ЕСТЬ NULL КАК Основной
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДоговорыКонтрагента КАК ОсновныеДоговорыКонтрагента
	|		ПО (ОсновныеДоговорыКонтрагента.Договор = ДоговорыКонтрагентов.Ссылка)
	|			И ДоговорыКонтрагентов.Организация = ОсновныеДоговорыКонтрагента.Организация
	|			И ДоговорыКонтрагентов.Владелец = ОсновныеДоговорыКонтрагента.Контрагент
	|			И ДоговорыКонтрагентов.ВидДоговора = ОсновныеДоговорыКонтрагента.ВидДоговора
	|ГДЕ
	|	ДоговорыКонтрагентов.Организация = &ОрганизацияДоговора
	|	И ДоговорыКонтрагентов.Владелец = &ВладелецДоговора
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	//|	И ДоговорыКонтрагентов.ВидДоговора В (&СписокВидовДоговора)
	|УПОРЯДОЧИТЬ ПО
	|	Основной УБЫВ");
	
	Запрос.УстановитьПараметр("ОрганизацияДоговора", ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(ОрганизацияДоговора));
	Запрос.УстановитьПараметр("ВладелецДоговора", ВладелецДоговора);
	//Запрос.УстановитьПараметр("СписокВидовДоговора", СписокВидовДоговора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
КонецФункции //ПолучитьОсновнойДоговор()

Процедура ДобавитьСчетаУчета()
	
	//СчетаУчетаНоменклатуры
	СчетУчета							= ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
	СчетДоходовОтРеализации				= ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД;
	СчетРасходовОтРеализации			= ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД;
	СчетУчетаНДСПоПриобретеннымЦенностям= ПланыСчетов.Хозрасчетный.НДСпоПриобретеннымМПЗ;
	СчетУчетаНДСПоРеализации			= ПланыСчетов.Хозрасчетный.Продажи_НДС;
	СчетУчетаНДСУплаченногоНаТаможне	= ПланыСчетов.Хозрасчетный.НДСуплачиваемыйТаможеннымОрганам;
	СчетУчетаПередачи					= ПланыСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные;
	СчетУчетаЗабалансовый				= ПланыСчетов.Хозрасчетный.МатериалыПринятыеВПереработку;
	СчетУчетаПередачиЗабалансовый		= ПланыСчетов.Хозрасчетный.МатериалыПринятыеВПереработкуВПроизводстве;
	
	НаборЗаписей = РегистрыСведений.СчетаУчетаНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Неопределено);
	НаборЗаписей.Отбор.Номенклатура.Установить(Неопределено);
	НаборЗаписей.Отбор.Склад.Установить(Неопределено);
	НаборЗаписей.Отбор.ТипСклада.Установить(Неопределено);
	НаборЗаписей.Прочитать();
	
	НаборИзменен = Ложь;
	Если НаборЗаписей.Количество()>0 Тогда
		ТекЗапись = НаборЗаписей[0];
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетУчета) Тогда
			ТекЗапись.СчетУчета = СчетУчета;
			НаборИзменен = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетДоходовОтРеализации) Тогда
			ТекЗапись.СчетДоходовОтРеализации = СчетДоходовОтРеализации;
			НаборИзменен = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетРасходовОтРеализации) Тогда
			ТекЗапись.СчетРасходовОтРеализации = СчетРасходовОтРеализации;
			НаборИзменен = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетУчетаНДСПоПриобретеннымЦенностям) Тогда
			ТекЗапись.СчетУчетаНДСПоПриобретеннымЦенностям = СчетУчетаНДСПоПриобретеннымЦенностям;
			НаборИзменен = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетУчетаНДСПоРеализации) Тогда
			ТекЗапись.СчетУчетаНДСПоРеализации = СчетУчетаНДСПоРеализации;
			НаборИзменен = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетУчетаНДСУплаченногоНаТаможне) Тогда
			ТекЗапись.СчетУчетаНДСУплаченногоНаТаможне = СчетУчетаНДСУплаченногоНаТаможне;
			НаборИзменен = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетУчетаПередачи) Тогда
			ТекЗапись.СчетУчетаПередачи = СчетУчетаПередачи;
			НаборИзменен = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетУчетаЗабалансовый) Тогда
			ТекЗапись.СчетУчетаЗабалансовый = СчетУчетаЗабалансовый;
			НаборИзменен = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетУчетаПередачиЗабалансовый) Тогда
			ТекЗапись.СчетУчетаПередачиЗабалансовый = СчетУчетаПередачиЗабалансовый;
			НаборИзменен = Истина;
		КонецЕсли;
	Иначе
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Организация							= Неопределено;
		НоваяЗапись.Номенклатура						= Неопределено;
		НоваяЗапись.Склад								= Неопределено;
		НоваяЗапись.ТипСклада							= Неопределено;
		НоваяЗапись.СчетУчета							= СчетУчета;
		НоваяЗапись.СчетДоходовОтРеализации				= СчетДоходовОтРеализации;
		НоваяЗапись.СчетРасходовОтРеализации			= СчетРасходовОтРеализации;
		НоваяЗапись.СчетУчетаНДСПоПриобретеннымЦенностям= СчетУчетаНДСПоПриобретеннымЦенностям;
		НоваяЗапись.СчетУчетаНДСПоРеализации			= СчетУчетаНДСПоРеализации;
		НоваяЗапись.СчетУчетаНДСУплаченногоНаТаможне	= СчетУчетаНДСУплаченногоНаТаможне;
		НоваяЗапись.СчетУчетаПередачи					= СчетУчетаПередачи;
		НоваяЗапись.СчетУчетаЗабалансовый				= СчетУчетаЗабалансовый;
		НоваяЗапись.СчетУчетаПередачиЗабалансовый		= СчетУчетаПередачиЗабалансовый;
		
		НаборИзменен = Истина;
	КонецЕсли;
	
	Если НаборИзменен Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
	
	//СчетаУчетаРасчетовСКонтрагентами
	СчетРасчетовПоПретензиям			= ПланыСчетов.Хозрасчетный.РасчетыПоПретензиям;
	СчетУчетаАвансовВыданных			= ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным;
	СчетУчетаАвансовПолученных			= ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным;
	//СчетУчетаДоходовПоТаре				= ПланыСчетов.Хозрасчетный.ПрочиеДоходы;
	//СчетУчетаРасходовПоТаре				= ПланыСчетов.Хозрасчетный.ПрочиеРасходы;
	СчетУчетаРасчетовПоТареСПокупателем	= ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками;
	СчетУчетаРасчетовПоТареСПоставщиком	= ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками;
	СчетУчетаРасчетовСКомитентом		= ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами;
	СчетУчетаРасчетовСПокупателем		= ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	СчетУчетаРасчетовСПоставщиком		= ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
	
	НаборЗаписей = РегистрыСведений.СчетаУчетаРасчетовСКонтрагентами.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Неопределено);
	НаборЗаписей.Отбор.Контрагент.Установить(Неопределено);
	НаборЗаписей.Отбор.Договор.Установить(Неопределено);
	НаборЗаписей.Отбор.ВидРасчетовПоДоговору.Установить(Неопределено);
	НаборЗаписей.Прочитать();
	
	НаборИзменен = Ложь;
	Если НаборЗаписей.Количество()>0 Тогда
		ТекЗапись = НаборЗаписей[0];
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетРасчетовПоПретензиям) Тогда
			ТекЗапись.СчетРасчетовПоПретензиям = СчетРасчетовПоПретензиям;
			НаборИзменен = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетУчетаАвансовВыданных) Тогда
			ТекЗапись.СчетУчетаАвансовВыданных = СчетУчетаАвансовВыданных;
			НаборИзменен = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетУчетаАвансовПолученных) Тогда
			ТекЗапись.СчетУчетаАвансовПолученных = СчетУчетаАвансовПолученных;
			НаборИзменен = Истина;
		КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетУчетаДоходовПоТаре) Тогда
		//	ТекЗапись.СчетУчетаДоходовПоТаре = СчетУчетаДоходовПоТаре;
		//	НаборИзменен = Истина;
		//КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетУчетаРасходовПоТаре) Тогда
		//	ТекЗапись.СчетУчетаРасходовПоТаре = СчетУчетаРасходовПоТаре;
		//	НаборИзменен = Истина;
		//КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетУчетаРасчетовПоТареСПокупателем) Тогда
			ТекЗапись.СчетУчетаРасчетовПоТареСПокупателем = СчетУчетаРасчетовПоТареСПокупателем;
			НаборИзменен = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетУчетаРасчетовПоТареСПоставщиком) Тогда
			ТекЗапись.СчетУчетаРасчетовПоТареСПоставщиком = СчетУчетаРасчетовПоТареСПоставщиком;
			НаборИзменен = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетУчетаРасчетовСКомитентом) Тогда
			ТекЗапись.СчетУчетаРасчетовСКомитентом = СчетУчетаРасчетовСКомитентом;
			НаборИзменен = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетУчетаРасчетовСПокупателем) Тогда
			ТекЗапись.СчетУчетаРасчетовСПокупателем = СчетУчетаРасчетовСПокупателем;
			НаборИзменен = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекЗапись.СчетУчетаРасчетовСПоставщиком) Тогда
			ТекЗапись.СчетУчетаРасчетовСПоставщиком = СчетУчетаРасчетовСПоставщиком;
			НаборИзменен = Истина;
		КонецЕсли;
	Иначе
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Организация							= Неопределено;
		НоваяЗапись.Контрагент							= Неопределено;
		НоваяЗапись.Договор								= Неопределено;
		НоваяЗапись.ВидРасчетовПоДоговору				= Неопределено;
		НоваяЗапись.СчетРасчетовПоПретензиям			= СчетРасчетовПоПретензиям;
		НоваяЗапись.СчетУчетаАвансовВыданных			= СчетУчетаАвансовВыданных;
		НоваяЗапись.СчетУчетаАвансовПолученных			= СчетУчетаАвансовПолученных;
		//НоваяЗапись.СчетУчетаДоходовПоТаре				= СчетУчетаДоходовПоТаре;
		//НоваяЗапись.СчетУчетаРасходовПоТаре				= СчетУчетаРасходовПоТаре;
		НоваяЗапись.СчетУчетаРасчетовПоТареСПокупателем	= СчетУчетаРасчетовПоТареСПокупателем;
		НоваяЗапись.СчетУчетаРасчетовПоТареСПоставщиком	= СчетУчетаРасчетовПоТареСПоставщиком;
		НоваяЗапись.СчетУчетаРасчетовСКомитентом		= СчетУчетаРасчетовСКомитентом;
		НоваяЗапись.СчетУчетаРасчетовСПокупателем		= СчетУчетаРасчетовСПокупателем;
		НоваяЗапись.СчетУчетаРасчетовСПоставщиком		= СчетУчетаРасчетовСПоставщиком;
		
		НаборИзменен = Истина;
	КонецЕсли;	
	
	Если НаборИзменен Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры //ДобавитьСчетаУчета()

// Возвращает строку - внутреннее представление переданного значения
Функция ПредставлениеРеквизита(Знач ЗнРекв, УказыватьТип=Ложь) 
	// Работаем только с ссылочными типами
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗнРекв)) ИЛИ
		Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗнРекв)) ИЛИ
		Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗнРекв)) Тогда
		
		// Для пустых значений
		Если ЗнРекв=Неопределено ИЛИ ЗнРекв.Пустая() Тогда
			ЗнРекв = """""";
		ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗнРекв)) Тогда
			// Для перечислений	вернем полное имя + значение перечисления
			МД = ЗнРекв.Метаданные();
			ЗнРекв = МД.ПолноеИмя() + "." + МД.ЗначенияПеречисления[Перечисления[МД.Имя].Индекс(ЗнРекв)].Имя;
		Иначе // Для остальных типов - уникальный идентификатор
			СтрТипа = "";
			Если УказыватьТип Тогда
				Тип = ТипЗнч(ЗнРекв);
				Если Справочники.ТипВсеСсылки().СодержитТип(Тип) Тогда
					СтрТипа = "Справочник." + ЗнРекв.Метаданные().Имя + ".";
				ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(Тип) Тогда
					СтрТипа = "Документ." + ЗнРекв.Метаданные().Имя + ".";
				КонецЕсли;
			КонецЕсли;
			ЗнРекв = СтрТипа + ЗнРекв.УникальныйИдентификатор();
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЗнРекв)=Тип("Число") Тогда
		ЗнРекв = Формат(ЗнРекв, "ЧГ=0;ЧРД='.';ЧН=");
	ИначеЕсли ТипЗнч(ЗнРекв)=Тип("Булево") Тогда
		ЗнРекв = Формат(ЗнРекв, "БЛ=Ложь; БИ=Истина");
	Иначе // ну и для всех остальных вернем текст, лишенный "мешающих" символов
		ЗнРекв = СокрЛП(СтрЗаменить(ЗнРекв, """", "¤"));
		ЗнРекв = СокрЛП(СтрЗаменить(ЗнРекв, ",", "†"));
		ЗнРекв = СокрЛП(СтрЗаменить(ЗнРекв, Символы.ПС, "‡"));
		ЗнРекв = СокрЛП(СтрЗаменить(ЗнРекв, "{", "["));
		ЗнРекв = СокрЛП(СтрЗаменить(ЗнРекв, "}", "]"));
	КонецЕсли;
	
	Возврат СокрЛП(ЗнРекв);
КонецФункции //ПредставлениеРеквизита()

Процедура ПроверкаПервогоЗапускаИналичияПредопределенныхЭлементов(Отказ) Экспорт
	НетТовара	 = обЗначениеНеЗаполнено(Справочники.Номенклатура.НайтиПоКоду("Т00000001"));
	НетУслуги	 = обЗначениеНеЗаполнено(Справочники.Номенклатура.НайтиПоКоду("Т00000002"));
	НетКомплекта = обЗначениеНеЗаполнено(Справочники.Номенклатура.НайтиПоКоду("Т00000003"));
	НетТары		 = обЗначениеНеЗаполнено(Справочники.Номенклатура.НайтиПоКоду("Т00000004"));
	НетПродукции = обЗначениеНеЗаполнено(Справочники.Номенклатура.НайтиПоКоду("Т00000005"));
	НетКомиссии	 = обЗначениеНеЗаполнено(Справочники.Номенклатура.НайтиПоКоду("Т00000006"));
	НетНомГруппы = обЗначениеНеЗаполнено(Справочники.НоменклатурныеГруппы.НайтиПоНаименованию("Товар"));
	
	ПервыйЗапуск = Ложь;
	
	Если НетТовара Или НетУслуги Или НетКомплекта Или НетТары Или НетПродукции Или НетКомиссии Или НетНомГруппы Тогда
		ТекстСообщения = "Обнаружен первый запуск обработки. Будут созданы необходимые элементы справочников.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ПервыйЗапуск = Истина;
	КонецЕсли;
	
	Если ПервыйЗапуск Тогда
		БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию();
		//СтавкаНДС				= Перечисления.СтавкиНДС.НДС18;
		ВидСтавкиНДС			= Перечисления.ВидыСтавокНДС.Общая;
		//ТипЦен				= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойТипЦенПродажи");
		Если обЗначениеНеЗаполнено(БазоваяЕдиницаИзмерения) Тогда
			новЭлемент = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
			новЭлемент.Код					= "796";
			новЭлемент.Наименование			= "шт";
			новЭлемент.НаименованиеПолное	= "Штука";
			новЭлемент.Записать();
			БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию();
			Если обЗначениеНеЗаполнено(БазоваяЕдиницаИзмерения) Тогда
				ТекстСообщения = "Для пользователя не определены основные реквизиты по умолчанию: Единица измерения.
				|Запуск обработки не возможен !";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если НетНомГруппы Тогда
			новЭлементНомГруппа = Справочники.НоменклатурныеГруппы.СоздатьЭлемент();
			новЭлементНомГруппа.Наименование = "Товар";
			новЭлементНомГруппа.Записать();
		КонецЕсли;
		
		ГруппаТовара	= Справочники.Номенклатура.НайтиПоНаименованию("Товары", Истина); ГруппаТовара = ?(ГруппаТовара.ЭтоГруппа, ГруппаТовара, Неопределено);
		ГруппаУслуги	= Справочники.Номенклатура.НайтиПоНаименованию("Услуги", Истина); ГруппаУслуги = ?(ГруппаУслуги.ЭтоГруппа, ГруппаУслуги, Неопределено);
		ГруппаТары		= Справочники.Номенклатура.НайтиПоНаименованию("Возвратная тара", Истина); ГруппаТары = ?(ГруппаТары.ЭтоГруппа, ГруппаТары, Неопределено);
		ГруппаПродукции = Справочники.Номенклатура.НайтиПоНаименованию("Продукция", Истина); ГруппаПродукции = ?(ГруппаПродукции.ЭтоГруппа, ГруппаПродукции, Неопределено);
		ГруппаКомиссии	= Справочники.Номенклатура.НайтиПоНаименованию("Товары на комиссии", Истина); ГруппаКомиссии = ?(ГруппаКомиссии.ЭтоГруппа, ГруппаКомиссии, Неопределено);
		НомГруппа		= Справочники.НоменклатурныеГруппы.НайтиПоНаименованию("Товар");
		
		Если НетТовара Тогда
			новЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
			новЭлемент.Родитель				= ГруппаТовара;
			новЭлемент.Наименование			= "Товар ТК 8";
			новЭлемент.Код					= "Т00000001";
			новЭлемент.НаименованиеПолное	= "Товар ТК 8";
			новЭлемент.ЕдиницаИзмерения		= БазоваяЕдиницаИзмерения;
			//новЭлемент.СтавкаНДС			= СтавкаНДС;
			новЭлемент.ВидСтавкиНДС			= ВидСтавкиНДС;
			новЭлемент.НоменклатурнаяГруппа	= НомГруппа;
			новЭлемент.Комментарий			= "Элемент создан автоматически (" + ТекущаяДата() + ").";
			новЭлемент.Записать();
		КонецЕсли;
				
		Если НетУслуги Тогда
			новЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
			новЭлемент.Родитель				= ГруппаУслуги;
			новЭлемент.Наименование			= "Услуга ТК 8";
			новЭлемент.Код					= "Т00000002";
			новЭлемент.НаименованиеПолное	= "Услуга ТК 8";
			//новЭлемент.СтавкаНДС			= СтавкаНДС;
			новЭлемент.ВидСтавкиНДС			= ВидСтавкиНДС;
			новЭлемент.Услуга				=  Истина;
			новЭлемент.НоменклатурнаяГруппа	= НомГруппа;
			новЭлемент.Комментарий			= "Элемент создан автоматически (" + ТекущаяДата() + ").";
			новЭлемент.Записать();
		КонецЕсли;
			
		Если НетКомплекта Тогда
			новЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
			новЭлемент.Родитель				= ГруппаТовара;
			новЭлемент.Наименование			= "Комплект ТК 8";
			новЭлемент.Код					= "Т00000003";
			новЭлемент.НаименованиеПолное	= "Комплект ТК 8";
			новЭлемент.ЕдиницаИзмерения		= БазоваяЕдиницаИзмерения;
			//новЭлемент.СтавкаНДС			= СтавкаНДС;
			новЭлемент.ВидСтавкиНДС			= ВидСтавкиНДС;
			новЭлемент.НоменклатурнаяГруппа	= НомГруппа;
			новЭлемент.Комментарий			= "Элемент создан автоматически (" + ТекущаяДата() + ").";
			новЭлемент.Записать();
		КонецЕсли;
		
		Если НетТары Тогда
			новЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
			новЭлемент.Родитель				= ГруппаТары;
			новЭлемент.Наименование			= "Тара ТК 8";
			новЭлемент.Код					= "Т00000004";
			новЭлемент.НаименованиеПолное	= "Тара ТК 8";
			новЭлемент.ЕдиницаИзмерения		= БазоваяЕдиницаИзмерения;
			//новЭлемент.СтавкаНДС			= Перечисления.СтавкиНДС.БезНДС;
			новЭлемент.ВидСтавкиНДС			= Перечисления.ВидыСтавокНДС.БезНДС;
			новЭлемент.НоменклатурнаяГруппа	= НомГруппа;
			новЭлемент.Комментарий			= "Элемент создан автоматически (" + ТекущаяДата() + ").";
			новЭлемент.Записать();
		КонецЕсли;
		
		Если НетПродукции Тогда
			новЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
			новЭлемент.Родитель				= ГруппаПродукции;
			новЭлемент.Наименование			= "Продукция ТК 8";
			новЭлемент.Код					= "Т00000005";
			новЭлемент.НаименованиеПолное	= "Продукция ТК 8";
			новЭлемент.ЕдиницаИзмерения		= БазоваяЕдиницаИзмерения;
			//новЭлемент.СтавкаНДС			= СтавкаНДС;
			новЭлемент.ВидСтавкиНДС			= ВидСтавкиНДС;
			новЭлемент.НоменклатурнаяГруппа	= НомГруппа;
			новЭлемент.Комментарий			= "Элемент создан автоматически (" + ТекущаяДата() + ").";
			новЭлемент.Записать();
		КонецЕсли;
		
		Если НетКомиссии Тогда
			новЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
			новЭлемент.Родитель				= ГруппаКомиссии;
			новЭлемент.Наименование			= "Комиссия ТК 8";
			новЭлемент.Код					= "Т00000006";
			новЭлемент.НаименованиеПолное	= "Комиссия ТК 8";
			новЭлемент.ЕдиницаИзмерения		= БазоваяЕдиницаИзмерения;
			//новЭлемент.СтавкаНДС			= СтавкаНДС;
			новЭлемент.ВидСтавкиНДС			= ВидСтавкиНДС;
			новЭлемент.НоменклатурнаяГруппа	= НомГруппа;
			новЭлемент.Комментарий			= "Элемент создан автоматически (" + ТекущаяДата() + ").";
			новЭлемент.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры //ПроверкаПервогоЗапускаИналичияПредопределенныхЭлементов()

Процедура СравнениеОбъектов(Знач Документ, ИмяТЧ=Неопределено)
	Если тзСравнения=Неопределено Тогда
		тзСравнения = Новый ТаблицаЗначений;
		тзСравнения.Колонки.Добавить("Документ");
		тзСравнения.Колонки.Добавить("Реквизит");
		тзСравнения.Колонки.Добавить("Таблица");
		тзСравнения.Колонки.Добавить("Значение");
		тзСравнения.Колонки.Добавить("ЗначениеНовое");
		тзСравнения.Колонки.Добавить("НомерСтрокиТЧ", Новый ОписаниеТипов("Число"));
	КонецЕсли;
	
	Ссылка = Документ.Ссылка;
	
	//сравним реквизиты шапки документа и ссылки
	Если Ссылка.Дата<>Документ.Дата Тогда
		НоваяСтрока = тзСравнения.Добавить();
		НоваяСтрока.Документ		= Документ;
		НоваяСтрока.Реквизит		= "Дата";
		НоваяСтрока.Значение		= Ссылка.Дата;
		НоваяСтрока.ЗначениеНовое   = Документ.Дата;
	КонецЕсли;
	
	Для Каждого Реквизит Из Ссылка.Метаданные().Реквизиты Цикл
		Реквизит = СокрЛП(Реквизит.Имя);
		
		Если Реквизит="Комментарий"
			ИЛИ Реквизит="РучнаяКорректировка" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Ссылка[Реквизит]<>Документ[Реквизит] Тогда
			НоваяСтрока = тзСравнения.Добавить();
			НоваяСтрока.Документ		= Документ;
			НоваяСтрока.Реквизит		= Реквизит;
			НоваяСтрока.Значение		= Ссылка[Реквизит];
			НоваяСтрока.ЗначениеНовое   = Документ[Реквизит];
		КонецЕсли;
	КонецЦикла;
	
	//определим ТЧ документа и ссылки
	Если ТипЗнч(Ссылка)=Тип("ДокументСсылка.ОперацияБух") Тогда
		ИмяТЧ = "Хозрасчетный";
	ИначеЕсли обЗначениеНеЗаполнено(ИмяТЧ) Тогда
		Возврат;
	КонецЕсли;
	
	МассивТЧ = СтрРазделить(ИмяТЧ, ",", Ложь);
	Для Каждого текИмяТЧ Из МассивТЧ Цикл
		Если ТипЗнч(Ссылка)=Тип("ДокументСсылка.ОперацияБух") Тогда
			НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Значение = Ссылка;
			НаборЗаписей.Прочитать();
			тзСсылка = НаборЗаписей.Выгрузить();
			тзДок	 = Документ.Движения.Хозрасчетный.Выгрузить();
		Иначе
			тзСсылка = Ссылка[текИмяТЧ].Выгрузить();
			тзДок	 = Документ[текИмяТЧ].Выгрузить();
		КонецЕсли;
		
		//определим ТЧ для обхода по большему количеству записей
		СсылкаБольше = (тзСсылка.Количество()>тзДок.Количество());
		тз1 = ?(СсылкаБольше, тзСсылка, тзДок);
		тз2 = ?(СсылкаБольше, тзДок, тзСсылка);
		
		//сравним ТЧ документа и ссылки
		Ном = 0;
		Для Каждого Строка1 Из тз1 Цикл
			Для Каждого Реквизит Из тз1.Колонки Цикл
				Реквизит = СокрЛП(Реквизит.Имя);
				
				Если Реквизит="Регистратор" Тогда
					Продолжить;
				КонецЕсли;
				
				Попытка
					Строка2 = тз2.Получить(Ном);
					Если Строка1[Реквизит]<>Строка2[Реквизит] Тогда
						Если обЗначениеНеЗаполнено(Строка1[Реквизит]) И обЗначениеНеЗаполнено(Строка2[Реквизит]) Тогда Продолжить; КонецЕсли;
						
						НоваяСтрока = тзСравнения.Добавить();
						НоваяСтрока.Документ		= Документ;
						НоваяСтрока.Таблица			= текИмяТЧ;
						НоваяСтрока.Реквизит		= Реквизит;
						НоваяСтрока.Значение		= ?(СсылкаБольше, Строка1[Реквизит], Строка2[Реквизит]);
						НоваяСтрока.ЗначениеНовое   = ?(СсылкаБольше, Строка2[Реквизит], Строка1[Реквизит]);
						НоваяСтрока.НомерСтрокиТЧ	= Ном + 1;
					КонецЕсли;
				Исключение
					Если обЗначениеНеЗаполнено(Строка1[Реквизит]) Тогда Продолжить; КонецЕсли;
					
					НоваяСтрока = тзСравнения.Добавить();
					НоваяСтрока.Документ		= Документ;
					НоваяСтрока.Таблица			= текИмяТЧ;
					НоваяСтрока.Реквизит		= Реквизит;
					НоваяСтрока.Значение		= ?(СсылкаБольше, Строка1[Реквизит], "");
					НоваяСтрока.ЗначениеНовое   = ?(СсылкаБольше, "", Строка1[Реквизит]);
					НоваяСтрока.НомерСтрокиТЧ	= Ном + 1;
				КонецПопытки;
			КонецЦикла;
			
			Ном = Ном + 1;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры //СравнениеОбъектов()

Процедура ПечатьСравнения(Таб)
	Если ТипЗнч(тзСравнения)<>Тип("ТаблицаЗначений") ИЛИ тзСравнения.Количество()=0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При сверке загружаемых документов, различий не обнаружено.");
		Возврат;
	КонецЕсли;
	
	тзСравнения.Свернуть("Документ,Реквизит,Таблица,Значение,ЗначениеНовое,НомерСтрокиТЧ");
	
	Таб = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("МакетСравнения");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	Таб.Вывести(ОбластьМакета);
	
	ПредДок = Неопределено; ПредТЧ = Неопределено;
	Для Каждого Строка Из тзСравнения Цикл
		Если ПредДок<>Строка.Документ Тогда
			Если ПредТЧ<>Неопределено Тогда
				Таб.ЗакончитьГруппуСтрок();
			КонецЕсли;
			Если ПредДок<>Неопределено Тогда
				Таб.ЗакончитьГруппуСтрок();
			КонецЕсли;
			ОбластьДокумента = Макет.ПолучитьОбласть("Документ");
			ОбластьДокумента.Параметры.Заполнить(Строка);
			Таб.Вывести(ОбластьДокумента);
			Таб.НачатьГруппуСтрок(,Ложь);
			ПредТЧ = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.Таблица) И ПредТЧ<>Строка.Таблица Тогда
			Если ПредДок=Строка.Документ И ПредТЧ<>Неопределено Тогда
				Таб.ЗакончитьГруппуСтрок();
			КонецЕсли;
			ОбластьМакета = Макет.ПолучитьОбласть("ИмяТЧ");
			ОбластьМакета.Параметры.Название = Строка.Таблица;
			Таб.Вывести(ОбластьМакета);
			Таб.НачатьГруппуСтрок(,Ложь);
		КонецЕсли;
		
		Если Строка.НомерСтрокиТЧ=0 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТЧ");
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(Строка);
		
		Таб.Вывести(ОбластьМакета);
		
		ПредДок = Строка.Документ;
		ПредТЧ = Строка.Таблица;
	КонецЦикла;
	Если ЗначениеЗаполнено(ПредТЧ) Тогда
		Таб.ЗакончитьГруппуСтрок();
	КонецЕсли;
	Таб.ЗакончитьГруппуСтрок();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	Таб.Вывести(ОбластьМакета);
	
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.АвтоМасштаб = Истина;
	Таб.ТолькоПросмотр = Истина;
	//Таб.Показать();
	тзСравнения.Очистить();
КонецПроцедуры //ПечатьСравнения()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАГРУЗКИ ДАННЫХ

Процедура Загрузить(ТекстФайла, СтрокаXML, ТекстПодтверждения="", РезЛог="", РезСравнения="") Экспорт
	Текст = ТекстФайла;	
	Лог = РезЛог;
	
	Если ТипЗнч(Лог)<>Тип("ТекстовыйДокумент") Тогда
		Лог = Новый ТекстовыйДокумент;
	КонецЕсли;
	Лог.ДобавитьСтроку(Текст.ПолучитьСтроку(1));
	
	Если обЗначениеНеЗаполнено(СтрокаПодключения) Тогда
		ТекстСообщения = "Отсутствует настройка подключения к базе соответствий объектов.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		Возврат;
	Иначе
		Попытка
			Если ТекстоваяТС Тогда
				//тзСоответствий = ЗначениеИзФайла(СокрЛП(СтрокаПодключения));
				//ТекстСоотв = Новый ЧтениеТекста(СокрЛП(СтрокаПодключения));
				//СтрокаXML = ТекстСоотв.Прочитать();
				//ТекстСоотв.Закрыть();
				ЧтениеXML = Новый ЧтениеXML();
				ЧтениеXML.УстановитьСтроку(СтрокаXML);
				Попытка
					тзСоответствий = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("ТаблицаЗначений"));
				Исключение
					тзСоответствий = ЗначениеИзФайла(СокрЛП(СтрокаПодключения));
				КонецПопытки;
				ЧтениеXML.Закрыть();
				
				Если ТипЗнч(тзСоответствий)<>Тип("ТаблицаЗначений") Тогда
					ТекстСообщения = "Некорректный файл БД соответствий или он поврежден!";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Лог.ДобавитьСтроку(ТекстСообщения);
					Возврат;
				КонецЕсли;
			Иначе
				Connection	= Новый COMОбъект("ADODB.Connection");
				Connection.Open(СокрЛП(СтрокаПодключения));
				Command		= Новый COMОбъект("ADODB.Command");
				Command.ActiveConnection = Connection;
				RecordSet	= Новый COMОбъект("ADODB.Recordset");
			КонецЕсли;
		Исключение
			ТекстСообщения = "Ошибка подключения к БД соответствий объектов." + Символы.ПС + ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	ЗагрузитьСвязанныеДанные(1);
	ЗагрузитьСвязанныеДанные(2);
	
	Попытка
		Если ТекстоваяТС Тогда
			//ЗначениеВФайл(СокрЛП(СтрокаПодключения), тзСоответствий);
			ЗаписьXML = Новый ЗаписьXML();
			ЗаписьXML.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьXML(ЗаписьXML, тзСоответствий);
			СтрокаXML = ЗаписьXML.Закрыть();
			//ТекстСоотв = Новый ЗаписьТекста(СокрЛП(СтрокаПодключения));
			//ТекстСоотв.Записать(СтрокаXML);
			//ТекстСоотв.Закрыть();
			
			тзСоответствий = Неопределено;
		Иначе
			Попытка Connection.Close();	Исключение КонецПопытки;
			Попытка RecordSet.Close(); Исключение КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Ошибка отсоединения от БД соответствий объектов!" + Символы.ПС + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		Возврат;
	КонецПопытки;

	//сформируем текст подтверждения загрузки
	Если тзПодтверждения<>Неопределено И тзПодтверждения.Количество()>0 Тогда
		XMLдокумент = Новый ЗаписьXML();
		XMLдокумент.УстановитьСтроку();
		XMLдокумент.ЗаписатьОбъявлениеXML();
		
		XMLдокумент.ЗаписатьНачалоЭлемента("ПодтверждениеЗагрузки");
			XMLдокумент.ЗаписатьАтрибут("Дата",	Формат(ТекущаяДата(), "ДФ='dd.MM.yyyy HH:mm:ss'"));
			
			XMLдокумент.ЗаписатьНачалоЭлемента("Документы");
			Для Каждого стрДокумент Из тзПодтверждения Цикл
				XMLдокумент.ЗаписатьНачалоЭлемента("Документ");
					XMLдокумент.ЗаписатьАтрибут("ТипОбъекта", Сред(стрДокумент.ТипОбъекта, Найти(стрДокумент.ТипОбъекта, ".") + 1));
					XMLдокумент.ЗаписатьАтрибут("GUID", СокрЛП(стрДокумент.GUID));
				XMLдокумент.ЗаписатьКонецЭлемента(); //Документ
			КонецЦикла;
			XMLдокумент.ЗаписатьКонецЭлемента(); //Документы
		
		XMLдокумент.ЗаписатьКонецЭлемента(); //ПодтверждениеЗагрузки
		
		ТекстПодтверждения = XMLдокумент.Закрыть();
		
		тзПодтверждения = Неопределено;
	КонецЕсли;
	//-----------------------------------------
	
	Если СравнениеДанных Тогда
		ПечатьСравнения(РезСравнения);
	КонецЕсли;
	
	Лог.ДобавитьСтроку("Загрузка завершена (" + ТекущаяДата() + ").");
	РезЛог = Лог;
КонецПроцедуры //Загрузить()

Функция НайтиСоответствиеСправочника(ИмяРеквизита) Экспорт
	ИдентификаторСправочникаБух = спСоответствияСправочников.НайтиПоЗначению(СтрЗаменить(ИмяРеквизита, "Справочник.", ""));
	
	Если ИдентификаторСправочникаБух=Неопределено Тогда
		ИдентификаторСправочникаБух = СтрЗаменить(ИмяРеквизита, "Справочник.", "");	
	КонецЕсли;
	// проверим
	Попытка
		Спр = Справочники[СокрЛП(ИдентификаторСправочникаБух)].ПустаяСсылка();
		Результат = ИдентификаторСправочникаБух;
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции //НайтиСоответствиеСправочника()

Функция НайтиСоответствиеПеречисления(ИмяРеквизита)
	ИдентификаторПеречисленияБух = спСоответствияПеречислений.НайтиПоЗначению(СтрЗаменить(ИмяРеквизита, "Перечисление.", ""));
	
	Если ИдентификаторПеречисленияБух=Неопределено Тогда
		ИдентификаторПеречисленияБух = СтрЗаменить(ИмяРеквизита, "Перечисление.", "");
	КонецЕсли;
	
	Попытка
		Результат = Вычислить("Перечисления." + ИдентификаторПеречисленияБух);
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции //НайтиСоответствиеПеречисления()

Функция НайтиСоответствиеДокумента(ИмяРеквизита)
	ИдентификаторДокументаБух = спСоответствияДокументов.НайтиПоЗначению(СтрЗаменить(ИмяРеквизита, "Документ.", ""));
	Если ИдентификаторДокументаБух=Неопределено Тогда
		ИдентификаторДокументаБух = СтрЗаменить(ИмяРеквизита, "Документ.", "");	
	КонецЕсли;
	// проверим
	Попытка
		Док = Документы[СокрЛП(ИдентификаторДокументаБух)].ПустаяСсылка();
		Результат = ИдентификаторДокументаБух;
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции //НайтиСоответствиеДокумента()

Процедура ЗаполнитьТаблицуОбъектов(ТекстФайла, СтрокаXML) Экспорт
	
	тзОбъектов = Новый ТаблицаЗначений;
	тзОбъектов.Колонки.Добавить("КодТК",				Новый ОписаниеТипов("Строка"));
	тзОбъектов.Колонки.Добавить("ИмяОбъекта",			Новый ОписаниеТипов("Строка"));
	тзОбъектов.Колонки.Добавить("IDвладельца",			Новый ОписаниеТипов("Строка"));
	тзОбъектов.Колонки.Добавить("IDобъектаТК",			Новый ОписаниеТипов("Строка"));
	тзОбъектов.Колонки.Добавить("ТипОбъектаТК",			Новый ОписаниеТипов("Строка"));
	тзОбъектов.Колонки.Добавить("ERPMasterKey",			Новый ОписаниеТипов("Строка"));
	тзОбъектов.Колонки.Добавить("ТипОбъектаБух",		Новый ОписаниеТипов("Строка"));
	тзОбъектов.Колонки.Добавить("ОбъектБух");
	тзОбъектов.Колонки.Добавить("РодительТК",			Новый ОписаниеТипов("Строка"));
	тзОбъектов.Колонки.Добавить("ИНН",					Новый ОписаниеТипов("Строка"));
	тзОбъектов.Колонки.Добавить("КПП",					Новый ОписаниеТипов("Строка"));
	тзОбъектов.Колонки.Добавить("Счет",					Новый ОписаниеТипов("Строка"));
	тзОбъектов.Колонки.Добавить("Бик",					Новый ОписаниеТипов("Строка"));
	тзОбъектов.Колонки.Добавить("Модифицированность",	Новый ОписаниеТипов("Булево"));
	тзОбъектов.Колонки.Добавить("Картинка",				Новый ОписаниеТипов("Число"));
	тзОбъектов.Колонки.Добавить("ЭтоГруппа",			Новый ОписаниеТипов("Булево"));
	тзОбъектов.Колонки.Добавить("Уровень",				Новый ОписаниеТипов("Число"));
	
	Текст = ТекстФайла;
	
	НомерТекущейСтроки = 2;
	спРеквизитыЗагружаемогоОбъекта = Новый СписокЗначений;
	ИдентификаторСправочникаБух = "";
	СписокID = "";
	Пока НомерТекущейСтроки<Текст.КоличествоСтрок() Цикл
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока, "{}""");
		Если СтрЧислоВхождений(ТекущаяСтрока,"Справочник")>0 Тогда
			ПозицияСимвола = Найти(ТекущаяСтрока, ",");
			ИдентификаторСправочникаТК = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1)); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола); ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ПозицияСимвола = Найти(ИдентификаторСправочникаТК, ".");
			ИдентификаторСправочникаТК  = Прав(ИдентификаторСправочникаТК,СтрДлина(ИдентификаторСправочникаТК)-ПозицияСимвола);
			ИдентификаторСправочникаБух = НайтиСоответствиеСправочника(ИдентификаторСправочникаТК);
			Если ИдентификаторСправочникаБух=Неопределено Тогда
				// нет аналога
				НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки) + 1;       
				Продолжить;
			КонецЕсли;   
			//загрузим реквизиты справочника
			Если АвтоУстСоотв Тогда
				спРеквизитыЗагружаемогоОбъекта.Очистить();
				НомерТекущейСтроки = НомерТекущейСтроки + 1;
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
				ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока, """");
				Пока СтрДлина(ТекущаяСтрока)>0 Цикл
					ПозицияСимвола	= Найти(ТекущаяСтрока, "}");
					СтрокаДанных	= Лев(ТекущаяСтрока, ПозицияСимвола - 1);                                          
					СтрокаДанных	= УбратьСимволы(СтрокаДанных, "{}");                                                 
					// отрезаем загруженные данные...
					ТекущаяСтрока	= СокрЛП(Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока) - ПозицияСимвола));
					// Разбираем чего зятянули. Порядок описания реквизита таков:  Имя, Тип, Длина, Точность, СоставнойТип (последний нам по фене)
					ПозицияСимвола	= Найти(СтрокаДанных, ",");
					ИмяРеквизита	= Лев(СтрокаДанных, ПозицияСимвола - 1);
					СтрокаДанных	= Прав(СтрокаДанных, СтрДлина(СтрокаДанных) - ПозицияСимвола);
					ПозицияСимвола	= Найти(СтрокаДанных, ",");
					ТипРеквизита	= Лев(СтрокаДанных, ПозицияСимвола - 1);
					спРеквизитыЗагружаемогоОбъекта.Добавить(ИмяРеквизита, ТипРеквизита);
				КонецЦикла;
				НомерТекущейСтроки = НомерТекущейСтроки + 1;
			Иначе
				НомерТекущейСтроки = НомерТекущейСтроки + 2;
			КонецЕсли;
			
			ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
			Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
				// пустые строки пропускаем
				Если СокрЛП(ТекущаяСтрока)="" Тогда
					НомерТекущейСтроки = НомерТекущейСтроки + 1;                
					ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
					Продолжить;
				КонецЕсли;        
				// Табличные поля справочников не грузим
				Если СтрЧислоВхождений(ТекущаяСтрока,"Таблица.")>0 Тогда
					НомерТекущейСтроки = НомерТекущейСтроки + 1;                
					ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
					Продолжить;
				КонецЕсли;
				// Шаблон строки 
				// Уровень, GUIDЭлемента , Владелец, IDВладельца, Родитель, ЭтоГруппа, Код, Наименование
				ТекущаяСтрока = УбратьСимволы(СокрЛП(ТекущаяСтрока),"""{}"); ПозицияСимвола=Найти(ТекущаяСтрока,",");
				Уровень			= Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
				GUIDЭлемента	= Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); 
				Владелец		= Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
				IDВладельца 	= Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
				ИдСпрВладТК		= Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); 
				РодительТК		= Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); 
				ЭтоГруппа		= Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
				Код				= Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); 
				Наименование	= Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
				Основной		= Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=?(Найти(ТекущаяСтрока,",")=0,СтрДлина(ТекущаяСтрока)+1,Найти(ТекущаяСтрока,","));
				// alav
				ERPMasterKey	= Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
				// alav
				
				Наименование	= ВосстПредстРеквизита(Наименование);
				ЭтоГруппа		= Вычислить(ЭтоГруппа);
				Уровень			= ?(Уровень="", 0, Число(Уровень));
				
				// заполняем временную тз
				НоваяСтрока = тзОбъектов.Добавить();
				НоваяСтрока.IDобъектаТК			= GUIDЭлемента;
				НоваяСтрока.ТипОбъектаТК		= "Справочник." + ИдентификаторСправочникаТК;
				НоваяСтрока.КодТК				= Код;
				НоваяСтрока.ИмяОбъекта			= Наименование;
				НоваяСтрока.IDвладельца			= IDВладельца;
				НоваяСтрока.РодительТК			= РодительТК;
				НоваяСтрока.Модифицированность	= Ложь;
				НоваяСтрока.Картинка			= ?(ЭтоГруппа, 0, 3);
				НоваяСтрока.ЭтоГруппа			= ЭтоГруппа;
				НоваяСтрока.Уровень				= Уровень;
				НоваяСтрока.ERPMasterKey        = ERPMasterKey;
				НоваяСтрока.ТипОбъектаБух		= "Справочник." + ИдентификаторСправочникаБух;
				Попытка
					НоваяСтрока.ОбъектБух		= Справочники[СокрЛП(ИдентификаторСправочникаБух)].ПустаяСсылка();
					//МетаданныеОбъекта = Справочники[СокрЛП(ИдентификаторСправочникаБух)].ПустаяСсылка().Метаданные();
					////alav
					//Если не МетаданныеОбъекта.Реквизиты.Найти("ЕРПМастерКлюч")= Неопределено тогда
					//	НоваяСтрока.ОбъектБух = Справочники[СокрЛП(ИдентификаторСправочникаБух)].НайтиПоРеквизиту("ЕРПМастерКлюч", НоваяСтрока.ERPMasterKey);
					//иначе
					//	НоваяСтрока.ОбъектБух		= Справочники[СокрЛП(ИдентификаторСправочникаБух)].ПустаяСсылка();
					//конецЕсли;
					//// alav
				Исключение КонецПопытки;
				
				Если АвтоУстСоотв Тогда
					Если СокрЛП(ИдентификаторСправочникаБух)="Контрагенты" Тогда
						ТекСтр = ТекущаяСтрока;
						Для НомРек=0 По спРеквизитыЗагружаемогоОбъекта.Количество()-1 Цикл
							ИмяРек = спРеквизитыЗагружаемогоОбъекта.Получить(НомРек);
							ИмяРек = СокрЛП(ИмяРек.Значение);
							// читаем значение реквизита из файла
							ПозицияСимвола = ?(Найти(ТекСтр,",")=0,СтрДлина(ТекСтр)+1,Найти(ТекСтр,","));
							ЗначениеРеквизита = Лев(ТекСтр,ПозицияСимвола-1); ТекСтр = Прав(ТекСтр,СтрДлина(ТекСтр)-ПозицияСимвола);
							Если ИмяРек="ИНН" Тогда
								Если СокрЛП(ЗначениеРеквизита)="" Тогда Прервать; КонецЕсли;
								НоваяСтрока.ИНН = СокрЛП(ЗначениеРеквизита);
							ИначеЕсли ИмяРек="КПП" Тогда
								Если СокрЛП(ЗначениеРеквизита)="" Тогда Прервать; КонецЕсли;
								НоваяСтрока.КПП = СокрЛП(ЗначениеРеквизита);
							КонецЕсли;
						КонецЦикла;
						
					ИначеЕсли СокрЛП(ИдентификаторСправочникаБух)="БанковскиеСчета" Тогда
						ТекСтр = ТекущаяСтрока;
						Для НомРек=0 По спРеквизитыЗагружаемогоОбъекта.Количество()-1 Цикл
							ИмяРек = спРеквизитыЗагружаемогоОбъекта.Получить(НомРек);
							ИмяРек = СокрЛП(ИмяРек.Значение);
							// читаем значение реквизита из файла
							ПозицияСимвола = ?(Найти(ТекСтр,",")=0, СтрДлина(ТекСтр)+1, Найти(ТекСтр,","));
							ЗначениеРеквизита = Лев(ТекСтр, ПозицияСимвола - 1); ТекСтр=Прав(ТекСтр,СтрДлина(ТекСтр)-ПозицияСимвола);
							Если ИмяРек="НомерСчета" Тогда
								Если СокрЛП(ЗначениеРеквизита)="" Тогда Прервать; КонецЕсли;
								НоваяСтрока.Счет = СокрЛП(ЗначениеРеквизита);
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
					ИначеЕсли СокрЛП(ИдентификаторСправочникаБух)="Банки" Тогда
						Если СокрЛП(Код)<>"" Тогда
							НоваяСтрока.Бик = СокрЛП(Код);
						КонецЕсли;
						
					ИначеЕсли СокрЛП(ИдентификаторСправочникаБух)="Организации" Тогда
						//ТекСтр = ТекущаяСтрока;
						//Для НомРек = 0 По спРеквизитыЗагружаемогоОбъекта.Количество()-1 Цикл
						//	ИмяРек = спРеквизитыЗагружаемогоОбъекта.Получить(НомРек);
						//	ИмяРек = СокрЛП(ИмяРек.Значение);
						//	// читаем значение реквизита из файла
						//	ПозицияСимвола = Найти(ТекСтр,",");
						//	ЗначениеРеквизита = Лев(ТекСтр,ПозицияСимвола-1); ТекСтр = Прав(ТекСтр,СтрДлина(ТекСтр)-ПозицияСимвола);
						//	Если ИмяРек = "ИНН" Тогда
						//		Если СокрЛП(ЗначениеРеквизита) = "" Тогда Продолжить; КонецЕсли;
						//		НоваяСтрока.ИНН = СокрЛП(ЗначениеРеквизита);
						//		Продолжить;
						//	ИначеЕсли ИмяРек = "КПП" Тогда
						//		Если СокрЛП(ЗначениеРеквизита) = "" Тогда Продолжить; КонецЕсли;
						//		НоваяСтрока.КПП = СокрЛП(ЗначениеРеквизита);
						//		Продолжить;
						//	КонецЕсли;
						//КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				// накопим для запроса
				Если ТекстоваяТС Тогда
					СписокID = СписокID + ?(СписокID="", """", ",""") + GUIDЭлемента + """";
				Иначе
					СписокID = СписокID + ?(СписокID="", "'", ",'") + GUIDЭлемента + "'";
				КонецЕсли;
				
				НомерТекущейСтроки = НомерТекущейСтроки + 1;
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
			КонецЦикла;
		Иначе
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		КонецЕсли;
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                                         
	КонецЦикла;
	
	// свернем временную тз
	тзОбъектов.Свернуть("КодТК,ИмяОбъекта,IDвладельца,РодительТК,IDобъектаТК,ОбъектБух,Модифицированность,ТипОбъектаТК,ERPMasterKey,ТипОбъектаБух,ИНН,КПП,Счет,Бик,Картинка,ЭтоГруппа,Уровень", );
	тзОбъектов.Сортировать("ТипОбъектаТК Убыв, ЭтоГруппа Убыв, Уровень Возр, IDвладельца Возр, РодительТК Возр, ИмяОбъекта Возр, Картинка Убыв");
	
	// получим соответствия для этих объектов
	Если НЕ ЗначениеЗаполнено(СтрокаПодключения) Тогда
		ТекстСообщения = "Отсутствует настройка подключения к базе соответствий объектов";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	Иначе
		Попытка
			Если ТекстоваяТС Тогда
				//тзСоответствий = ЗначениеИзФайла(СокрЛП(СтрокаПодключения));
				//ТекстСоотв = Новый ЧтениеТекста(СокрЛП(СтрокаПодключения));
				//СтрокаXML = ТекстСоотв.Прочитать();
				//ТекстСоотв.Закрыть();
				ЧтениеXML = Новый ЧтениеXML();
				ЧтениеXML.УстановитьСтроку(СтрокаXML);
				Попытка
					тзСоответствий = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("ТаблицаЗначений"));
				Исключение
					тзСоответствий = ЗначениеИзФайла(СокрЛП(СтрокаПодключения));
				КонецПопытки;
				ЧтениеXML.Закрыть();
				
				Если ТипЗнч(тзСоответствий)<>Тип("ТаблицаЗначений") Тогда
					ТекстСообщения = "Некорректный файл БД соответствий или он поврежден!";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Возврат;
				КонецЕсли;
			Иначе
				Connection	= Новый COMОбъект("ADODB.Connection");
				Connection.Open(СокрЛП(СтрокаПодключения));
				RecordSet	= Новый COMОбъект("ADODB.Recordset");
			КонецЕсли;
		Исключение
			ТекстСообщения = "Ошибка подключения к БД соответствий объектов." + Символы.ПС + ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	Если СписокID<>"" Тогда
		Если ТекстоваяТС Тогда
			Запрос = Новый Запрос("
			|ВЫБРАТЬ ВнТз.ObjectTCID, ВнТз.ObjectBPID, ВнТз.ObjectBPType
			|ПОМЕСТИТЬ тзСоответствий
			|ИЗ	&ВнТз КАК ВнТз
			|;
			|////////////////////////////////////////////
			|ВЫБРАТЬ ObjectTCID, ObjectBPID, ObjectBPType
			|ИЗ тзСоответствий
			|ГДЕ ObjectTCID В(" + СписокID + ")");
			Запрос.УстановитьПараметр("ВнТз", тзСоответствий);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				IDобъектаТК  = СокрЛП(Выборка.ObjectTCID);
				IDобъектаБух = СокрЛП(Выборка.ObjectBPID);
				ТипОбъектаБух = СокрЛП(Выборка.ObjectBPType);
				// найдем строку
				СтрокаТО = тзОбъектов.Найти(IDобъектаТК, "IDобъектаТК");
				Попытка
					// получаем справочник Бух
					СпрБух = Справочники[Сред(ТипОбъектаБух, Найти(ТипОбъектаБух, ".") + 1)];
					// помещаем ссылку на объект
					СтрокаТО.ОбъектБух = СпрБух.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(IDобъектаБух)));
					
					//очистим явно ошибочные соответствия объектов
					Если Найти(СтрокаТО.ОбъектБух,"Объект не найден")>0 Тогда
						СтрокаТО.ОбъектБух = СпрБух.ПустаяСсылка();
						СтрокаТО.Модифицированность = Истина;
					ИначеЕсли СтрокаТО.ЭтоГруппа<>СтрокаТО.ОбъектБух.ЭтоГруппа Тогда
						СтрокаТО.ОбъектБух = СпрБух.ПустаяСсылка();
						СтрокаТО.Модифицированность = Истина;
					КонецЕсли;
					//--------------------------------------------
					
					Если ЗначениеЗаполнено(СтрокаТО.ОбъектБух) Тогда
						СтрокаТО.ТипОбъектаБух = СокрЛП(ТипОбъектаБух);
					КонецЕсли;
				Исключение КонецПопытки;
			КонецЦикла;
		Иначе
			ТекстЗапроса = "Select ObjectTCID, ObjectBPID, ObjectBPType from TCBP where ObjectTCID IN(" + СписокID + ")";
			Попытка               
				RecordSet.Open(ТекстЗапроса, Connection, 2, 3, 1);	
			Исключение 
				ТекстСообщения = "Ошибка выполнения SQL запроса: " + ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецПопытки;	
			Пока НЕ RecordSet.EOF Цикл
				IDобъектаТК		= СокрЛП(RecordSet.Fields("ObjectTCID").Value);
				IDобъектаБух	= СокрЛП(RecordSet.Fields("ObjectBPID").Value);
				ТипОбъектаБух	= СокрЛП(RecordSet.Fields("ObjectBPType").Value);
				// найдем строку
				СтрокаТО = тзОбъектов.Найти(IDобъектаТК, "IDобъектаТК");
				// получаем справочник Бух
				Попытка
					СпрБух = Справочники[Сред(ТипОбъектаБух, Найти(ТипОбъектаБух, ".") + 1)];
					// помещаем ссылку на объект
					СтрокаТО.ОбъектБух = СпрБух.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(IDобъектаБух)));
					
					//очистим явно ошибочные соответствия объектов
					Если Найти(СтрокаТО.ОбъектБух,"Объект не найден")>0 Тогда
						СтрокаТО.ОбъектБух = СпрБух.ПустаяСсылка();
						СтрокаТО.Модифицированность = Истина;
					ИначеЕсли СтрокаТО.ЭтоГруппа<>СтрокаТО.ОбъектБух.ЭтоГруппа Тогда
						СтрокаТО.ОбъектБух = СпрБух.ПустаяСсылка();
						СтрокаТО.Модифицированность = Истина;
					КонецЕсли;
					//--------------------------------------------
					
					Если ЗначениеЗаполнено(СтрокаТО.ОбъектБух) Тогда
						СтрокаТО.ТипОбъектаБух = СокрЛП(ТипОбъектаБух);
					КонецЕсли;
				Исключение КонецПопытки;
				RecordSet.MoveNext(); 
			КонецЦикла;
			RecordSet.Close();
		КонецЕсли;
		
		Для Каждого СтрокаТО Из тзОбъектов Цикл
			Если ЗначениеЗаполнено(СтрокаТО.ERPMasterKey) И НЕ ЗначениеЗаполнено(СтрокаТО.ОбъектБух) Тогда
				СпрБух = Справочники[Сред(СтрокаТО.ТипОбъектаБух, Найти(СтрокаТО.ТипОбъектаБух, ".") + 1)];
				МетаданныеОбъекта = СпрБух.ПустаяСсылка().Метаданные();
				Если МетаданныеОбъекта.Реквизиты.Найти("ЕРПМастерКлюч")<>Неопределено Тогда
					СтрокаТО.ОбъектБух = СпрБух.НайтиПоРеквизиту("ЕРПМастерКлюч", СтрокаТО.ERPMasterKey);
					СтрокаТО.Модифицированность = Истина;
				КонецЕсли;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаТО.ОбъектБух) Тогда
				СтрокаТО.ТипОбъектаБух = "";
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// заполняем дерево
	ДеревоОбъектов.Колонки.Очистить();
	ДеревоОбъектов.Строки.Очистить();
	
	Для Каждого КолонкаТЗ Из тзОбъектов.Колонки Цикл
		ДеревоОбъектов.Колонки.Добавить(КолонкаТЗ.Имя, КолонкаТЗ.ТипЗначения);
	КонецЦикла;
	
	ПредТипДанных = Неопределено;	
	Для Каждого СтрокаТЗ Из тзОбъектов Цикл
		
		Если ПредТипДанных<>СтрокаТЗ.ТипОбъектаТК Тогда
			Если ЗначениеЗаполнено(СтрокаТЗ.IDвладельца) Тогда
				СтрокаРодитель = ДеревоОбъектов;
			Иначе
				СтрокаРодитель = ДеревоОбъектов.Строки.Добавить();
				//СтрокаРодитель.ИмяОбъекта	= Метаданные.Справочники[Сред(СтрокаТЗ.ТипОбъектаБух,Найти(СтрокаТЗ.ТипОбъектаБух,".")+1)];
				СтрокаРодитель.ИмяОбъекта	= СокрЛП(ТипЗнч(СтрокаТЗ.ОбъектБух));
				СтрокаРодитель.Картинка		= 2;
				СтрокаРодитель.ЭтоГруппа	= Истина;
			КонецЕсли;
		КонецЕсли;
		ПредТипДанных = СтрокаТЗ.ТипОбъектаТК;
		
		// добавляем в дерево
		Если ЗначениеЗаполнено(СтрокаТЗ.IDвладельца) Тогда
			ТекСтрока = ДеревоОбъектов.Строки.Найти(СтрокаТЗ.IDвладельца, "IDобъектаТК",Истина);
			
		ИначеЕсли ЗначениеЗаполнено(СтрокаТЗ.РодительТК) Тогда
			ТекСтрока = ДеревоОбъектов.Строки.Найти(СтрокаТЗ.РодительТК, "IDобъектаТК",Истина);
			
		Иначе
			ТекСтрока = Неопределено;
			
		КонецЕсли;
		
		Если ТекСтрока=Неопределено Тогда
			НоваяСтрока = СтрокаРодитель.Строки.Добавить();
		Иначе
			НоваяСтрока = ТекСтрока.Строки.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
	
	ДеревоОбъектов.Строки.Сортировать("ИмяОбъекта Возр");
КонецПроцедуры //ЗапролнитьТаблицуОбъектов()

Функция ЗаписатьТаблицуОбъектов(СтрокаXML) Экспорт
	Если НЕ ЗначениеЗаполнено(СтрокаПодключения) Тогда
		ТекстСообщения = "Отсутствует настройка подключения к базе соответствий объектов";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	Иначе
		Попытка
			Если ТекстоваяТС Тогда
				//тзСоответствий = ЗначениеИзФайла(СокрЛП(СтрокаПодключения));
				//ТекстСоотв = Новый ЧтениеТекста(СокрЛП(СтрокаПодключения));
				//СтрокаXML = ТекстСоотв.Прочитать();
				//ТекстСоотв.Закрыть();
				ЧтениеXML = Новый ЧтениеXML();
				ЧтениеXML.УстановитьСтроку(СтрокаXML);
				Попытка
					тзСоответствий = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("ТаблицаЗначений"));
				Исключение
					тзСоответствий = ЗначениеИзФайла(СокрЛП(СтрокаПодключения));
				КонецПопытки;
				ЧтениеXML.Закрыть();
				
				Если ТипЗнч(тзСоответствий)<>Тип("ТаблицаЗначений") Тогда
					ТекстСообщения = "Некорректный файл БД соответствий или он поврежден!";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Возврат Ложь;
				КонецЕсли;
			Иначе
				Connection	= Новый COMОбъект("ADODB.Connection");
				Connection.Open(СокрЛП(СтрокаПодключения));
				Command		= Новый COMОбъект("ADODB.Command");
				Command.ActiveConnection = Connection;
			КонецЕсли;
		Исключение
			ТекстСообщения = "Ошибка подключения к БД соответствий объектов" + Символы.ПС + ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	СписокID = "";
	МассивСтрок = ДеревоОбъектов.Строки.НайтиСтроки(Новый Структура("Модифицированность", Истина), Истина);
	
	Если ТекстоваяТС Тогда
		Для Каждого Строка Из МассивСтрок Цикл
			// удалим аналогичные записи
			текСтрока = тзСоответствий.Найти(Строка.IDобъектаТК, "ObjectTCID");
			Если текСтрока<>Неопределено Тогда
				тзСоответствий.Удалить(текСтрока);
			КонецЕсли;
			// теперь добавим
			Если обЗначениеНеЗаполнено(Строка.ОбъектБух) Тогда Продолжить; КонецЕсли;
			НоваяСтрока = тзСоответствий.Добавить();
			НоваяСтрока.ObjectTCID		= СокрЛП(Строка.IDобъектаТК);
			НоваяСтрока.ObjectTCType	= СокрЛП(Строка.ТипОбъектаТК);
			НоваяСтрока.ObjectBPID		= СокрЛП(Строка.ОбъектБух.УникальныйИдентификатор());
			НоваяСтрока.ObjectBPType	= СокрЛП(Строка.ТипОбъектаБух);
		КонецЦикла;
		
		//ЗначениеВФайл(СокрЛП(СтрокаПодключения), тзСоответствий);
		ЗаписьXML = Новый ЗаписьXML();
		ЗаписьXML.УстановитьСтроку();
		СериализаторXDTO.ЗаписатьXML(ЗаписьXML, тзСоответствий);
		СтрокаXML = ЗаписьXML.Закрыть();
		//ТекстСоотв = Новый ЗаписьТекста(СокрЛП(СтрокаПодключения));
		//ТекстСоотв.Записать(СтрокаXML);
		//ТекстСоотв.Закрыть();
		
	Иначе
		Для Каждого Строка Из МассивСтрок Цикл
			СписокID = СписокID + ?(СписокID="", "'", ",'") + Строка.IDобъектаТК + "'";
		КонецЦикла;
		
		Если СписокID<>"" Тогда
			// удалим аналогичные записи
			ТекстЗапроса = "DELETE FROM TCBP WHERE ObjectTCID IN(" + СписокID + ")";
			Попытка
				Command.CommandText = ТекстЗапроса;
				Result = Command.Execute();
			Исключение 
				ТекстСообщения = "Ошибка выполнения команды " + ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат Ложь;
			КонецПопытки;	
			
			// теперь добавим
			МассивСтрок = ДеревоОбъектов.Строки.НайтиСтроки(Новый Структура("Модифицированность", Истина), Истина);
			Для Каждого Строка Из МассивСтрок Цикл
				Если обЗначениеНеЗаполнено(Строка.ОбъектБух) Тогда Продолжить; КонецЕсли;
				ТекстЗапроса = "INSERT INTO TCBP (ObjectTCID,ObjectTCType,ObjectBPID,ObjectBPType) VALUES ('" + СокрЛП(Строка.IDобъектаТК) + "','" + СокрЛП(Строка.ТипОбъектаТК) + "','" + СокрЛП(Строка.ОбъектБух.УникальныйИдентификатор()) + "','" + СокрЛП(Строка.ТипОбъектаБух) + "')";
				Попытка               
					Command.CommandText = ТекстЗапроса;
					Result = Command.Execute();
				Исключение 
					ТекстСообщения = "Ошибка выполнения запроса " + ОписаниеОшибки();
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Возврат Ложь;
				КонецПопытки;	
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции //ЗаписатьТаблицуОбъектов()

Процедура ЗагрузитьСвязанныеДанные(НомерПрохода=1) Экспорт
	//начнем
	НомерТекущейСтроки = 2;     
	Пока НомерТекущейСтроки<Текст.КоличествоСтрок()  Цикл
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока, "{}""");
		Если СтрЧислоВхождений(ТекущаяСтрока,"Справочник")>0 Тогда
			БезОшибок = ЗагрузитьСправочники(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Операция")>0 Тогда
			БезОшибок = ЗагрузитьОперация(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Запись_КУДиР")>0 Тогда
			БезОшибок = ЗагрузитьЗаписьКУДиР(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_ПКО")>0 Тогда
			БезОшибок = ЗагрузитьПриходныйКассовыйОрдер(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_РКО")>0 Тогда
			БезОшибок = ЗагрузитьРасходныйКассовыйОрдер(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_ПлатежноеПоручение")>0 Тогда		
			БезОшибок = ЗагрузитьПлатежноеПоручение(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_ПоступлениеТоваров")>0 Тогда
			БезОшибок = ЗагрузитьПоступлениеТоваров(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_АктКорректировкиПоставки")>0 Тогда
			БезОшибок = ЗагрузитьАктКорректировкиПоставки(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_РеализацияТоваров")>0 Тогда
			БезОшибок = ЗагрузитьРеализацияТоваров(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_АктКорректировкиОтгрузки")>0 Тогда
			БезОшибок = ЗагрузитьАктКорректировкиОтгрузки(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_ОприходованиеИзлишков")>0 Тогда
			БезОшибок = ЗагрузитьОприходованиеИзлишков(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_ЗакрытиеСмены")>0 Тогда
			БезОшибок = ЗагрузитьЗакрытиеСмены(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_СписаниеТоваров")>0 Тогда
			БезОшибок = ЗагрузитьСписаниеТоваров(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_ВозвратПоставщику")>0 Тогда
			БезОшибок = ЗагрузитьВозвратПоставщику(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_ВозвратОтПокупателя")>0 Тогда
			БезОшибок = ЗагрузитьВозвратОтПокупателя(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_ПеремещениеТоваров")>0 Тогда
			БезОшибок = ЗагрузитьПеремещениеТоваров(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_Инвентаризация")>0 Тогда
			БезОшибок = ЗагрузитьИнвентаризация(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_ПоступлениеДопРасходов")>0 Тогда
			БезОшибок = ЗагрузитьПоступлениеДопРасходов(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_ОтчетПроизводстваЗаСмену")>0 Тогда
			БезОшибок = ЗагрузитьОтчетПроизводстваЗаСмену(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_Взаимозачет")>0 Тогда
			БезОшибок = ЗагрузитьВзаимозачет(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_КорректировкаДолга")>0 Тогда
			БезОшибок = ЗагрузитьКорректировкуДолга(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_АвансовыйОтчет")>0 Тогда
			БезОшибок = ЗагрузитьАвансовыйОтчет(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_ОтчетКомиссионера")>0 Тогда
			БезОшибок = ЗагрузитьОтчетКомиссионера(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_ОтчетКомитенту")>0 Тогда
			БезОшибок = ЗагрузитьОтчетКомитенту(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_Переоценка")>0 Тогда
			БезОшибок = ЗагрузитьПереоценка(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_ВводОстатковТоваров")>0 Тогда
			БезОшибок = ЗагрузитьВводОстатковТоваров(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_СчетФактураПолученный")>0 Тогда
			БезОшибок = ЗагрузитьСчетФактураПолученный(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Документ_СчетФактураВыданный")>0 Тогда
			БезОшибок = ЗагрузитьСчетФактураВыданный(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Изменения")>0 И НЕ СравнениеДанных Тогда
			БезОшибок = ЗагрузитьИзменения(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		ИначеЕсли СтрЧислоВхождений(ТекущаяСтрока,"Запись_Контактная_Информация")>0 И НЕ СравнениеДанных Тогда
			БезОшибок = ЗагрузитьКонтактнаяИнформация(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода);
			
		Иначе
			БезОшибок = Истина;
		КонецЕсли;
		
		Если БезОшибок Тогда
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                                         
		Иначе
			ТекстСообщения = "Загрузка прервана !!!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //ЗагрузитьСвязанныеДанные()

Процедура ОбработатьСписанияИОприходованияИнвентаризации(обДокумент, Знач ТекущийСтатус, ИнвентаризацияТоваровНаСкладе, Подразделение)
	ЭтоСписание = (ТипЗнч(обДокумент)=Тип("ДокументОбъект.СписаниеТоваров"));
	
	ЗаполнениеДокументов.Заполнить(обДокумент);
	
	обДокумент.Дата							 = ИнвентаризацияТоваровНаСкладе.Дата;
	обДокумент.Организация					 = ИнвентаризацияТоваровНаСкладе.Организация;
	обДокумент.Склад						 = ИнвентаризацияТоваровНаСкладе.Склад;
	обДокумент.ИнвентаризацияТоваровНаСкладе = ИнвентаризацияТоваровНаСкладе;
	обДокумент.Основание					 = СокрЛП(ИнвентаризацияТоваровНаСкладе);
	обДокумент.Комментарий					 = ИнвентаризацияТоваровНаСкладе.Комментарий;
	обДокумент.Ответственный				 = ПараметрыСеанса.ТекущийПользователь;
	//обДокумент.РучнаяКорректировка			 = Ложь;
	Если ЭтоВерсияКорп Тогда
		обДокумент.ПодразделениеОрганизации	 = Подразделение;	
	КонецЕсли;
	
	//КоличествоОтклонение = ИнвентаризацияТоваровНаСкладе.Товары.Итог("Количество") - ИнвентаризацияТоваровНаСкладе.Товары.Итог("КоличествоУчет");	
	//Если (ЭтоСписание И КоличествоОтклонение<0) ИЛИ (НЕ ЭтоСписание И КоличествоОтклонение>0) Тогда //а надо ли заполнять ?
		обДокумент.ЗаполнитьТоварыПоИнвентаризацииТоваров(ИнвентаризацияТоваровНаСкладе);
	
		//Заполним суммы(себестоимость)
		Для Каждого СтрокаТов Из обДокумент.Товары Цикл
			СтрокаИнв = ИнвентаризацияТоваровНаСкладе.Товары.Найти(СтрокаТов.Номенклатура);
			
			Если ЭтоСписание Тогда
				СтрокаТов.Сумма = СтрокаИнв.СуммаУчет - СтрокаИнв.Сумма;
				СтрокаТов.Себестоимость = СтрокаТов.Сумма;
				//Трофимова 04.02.2019 +++
				СтрокаТов.Цена = СтрокаТов.Сумма/СтрокаТов.Количество;
				//Трофимова 04.02.2019 --- 
			Иначе
				СтрокаТов.Сумма = СтрокаИнв.Сумма - СтрокаИнв.СуммаУчет;
			КонецЕсли;
		КонецЦикла;
		
	//ИначеЕсли обДокумент.ЭтоНовый() Тогда
	//	Возврат;
	//	
	//Иначе
	//	ТекущийСтатус = 0;
	//КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			обДокумент.ПометкаУдаления	= Истина;
			обДокумент.Проведен			= Ложь;
			обДокумент.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			обДокумент.ПометкаУдаления	= Ложь;
			обДокумент.Проведен			= Ложь;
			обДокумент.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			обДокумент.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					обДокумент.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					обДокумент.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+обДокумент+Символы.ПС+"Документ источник: "+ИнвентаризацияТоваровНаСкладе+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				обДокумент.ПометкаУдаления = Ложь;
				обДокумент.Проведен = Ложь;
				обДокумент.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+обДокумент+Символы.ПС+"Документ источник: "+ИнвентаризацияТоваровНаСкладе+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;
	ЗафиксироватьТранзакцию();
КонецПроцедуры //ОбработатьСписанияИОприходованияИнвентаризации()

Процедура ПодтвердитьЗагрузку(GUID, ТипОбъекта)
	Если ЗагрузкаИзменений И ЗначениеЗаполнено(GUID) И ЗначениеЗаполнено(ТипОбъекта) Тогда
		Если тзПодтверждения=Неопределено Тогда
			тзПодтверждения = Новый ТаблицаЗначений;
			тзПодтверждения.Колонки.Добавить("ТипОбъекта");
			тзПодтверждения.Колонки.Добавить("GUID");
		КонецЕсли;
		
		Если тзПодтверждения.Найти(GUID,"GUID")=Неопределено Тогда
			НоваяСтрока = тзПодтверждения.Добавить();
			НоваяСтрока.ТипОбъекта = ТипОбъекта;
			НоваяСтрока.GUID = GUID;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры //ПодтвердитьЗагрузку()

///////////////////////////////////////////////////////////////////////////////
//ФУНКЦИИ ЗАГРУЗКИ ОБЪЕКТОВ

Функция ЗагрузитьСправочники(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	
	ПозицияСимвола				= Найти(ТекущаяСтрока,",");
	ИдентификаторСправочникаТК	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1)); ТекущаяСтрока = Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола); ПозицияСимвола = Найти(ТекущаяСтрока,",");
	ДлиннаКода					= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1)); ТекущаяСтрока = Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола); ПозицияСимвола = Найти(ТекущаяСтрока,","); 
	ДлиннаНаименования			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1)); ТекущаяСтрока = Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола); ПозицияСимвола = Найти(ТекущаяСтрока,","); 
	Владелец					= СокрЛП(ТекущаяСтрока);
	// Если первый проход, а нужно создавать подчиненные элементы, то пропустим его... В следующий проход их создадим
	// А вот когда второй проход, то все наоборот! Создаем только подчиненные, а остальные пропускаем!
	// Кстати - проводки будем создавать тож только на втором проходе!
	Если (Владелец<>"" И НомерПрохода=1) ИЛИ (Владелец="" И НомерПрохода=2) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	ПозицияСимвола = Найти(ИдентификаторСправочникаТК, ".");
	ИдентификаторСправочникаТК  = Прав(ИдентификаторСправочникаТК, СтрДлина(ИдентификаторСправочникаТК) - ПозицияСимвола);
	ИдентификаторСправочникаБух	= НайтиСоответствиеСправочника(ИдентификаторСправочникаТК);
	Если ИдентификаторСправочникаБух=Неопределено Тогда
		// нет аналога
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;   

	спРеквизитыЗагружаемогоОбъекта = Новый СписокЗначений;
	
	НомерТекущейСтроки = НомерТекущейСтроки + 1;
	ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока, """");
	// Теперь загружаем в список все описания реквизитов, выгруженных со справочником.
	Пока СтрДлина(ТекущаяСтрока)>0 Цикл
		ПозицияСимвола = Найти(ТекущаяСтрока, "}");
		СтрокаДанных = Лев(ТекущаяСтрока, ПозицияСимвола-1);                                          
		СтрокаДанных = УбратьСимволы(СтрокаДанных, "{}");                                                 
		// отрезаем загруженные данные...
		ТекущаяСтрока = СокрЛП(Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола));
		// Разбираем чего зятянули. Порядок описания реквизита таков:  Имя, Тип, Длина, Точность, СоставнойТип (последний нам по фене)
		ПозицияСимвола = Найти(СтрокаДанных, ",");
		ИмяРеквизита = Лев(СтрокаДанных, ПозицияСимвола-1);
		СтрокаДанных = Прав(СтрокаДанных, СтрДлина(СтрокаДанных)-ПозицияСимвола);
		ПозицияСимвола = Найти(СтрокаДанных, ",");
		ТипРеквизита = Лев(СтрокаДанных, ПозицияСимвола-1);
		спРеквизитыЗагружаемогоОбъекта.Добавить(ИмяРеквизита, ТипРеквизита);
	КонецЦикла;
	// Далее идет непосредственная обработка элементов справочника.
	// Если элемент уже есть в сисиетме - мы его пропускаем, если нет - создаем
	ОбъектСправочник		= Справочники[СокрЛП(ИдентификаторСправочникаБух)];
	ОбъектСправочникГруппа	= Справочники[СокрЛП(ИдентификаторСправочникаБух)];
	
	НомерТекущейСтроки = НомерТекущейСтроки + 1;                
	ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);			
	Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
		// пустые строки пропускаем
		Если СокрЛП(ТекущаяСтрока)="" Тогда
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
			Продолжить;
		КонецЕсли;        
		// Табличные поля справочников не грузим
		Если СтрЧислоВхождений(ТекущаяСтрока,"Таблица.")>0 Тогда
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
			Продолжить;
		КонецЕсли;
		// Шаблон строки 
		// Уровень, GUIDЭлемента , Владелец, IDВладельца, Родитель, ЭтоГруппа, Код, Наименование
		ТекущаяСтрока = УбратьСимволы(СокрЛП(ТекущаяСтрока),"""{}"); ПозицияСимвола=Найти(ТекущаяСтрока,",");
		Уровень		  = Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		GUIDЭлемента  = Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		Владелец	  = Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		IDВладельца   = Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		ИдСпрВладТК	  = Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		Родитель	  = Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		ЭтоГруппа	  = Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		Код			  = Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		Наименование  = Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		Основной	  = Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=?(Найти(ТекущаяСтрока,",")=0,СтрДлина(ТекущаяСтрока)+1,Найти(ТекущаяСтрока,","));
		// alav
		ERPMasterKey  = Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока, СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
		// alav
		
		Владелец		= ВосстПредстРеквизита(Владелец);
		Наименование	= ВосстПредстРеквизита(Наименование);
		ЭтоГруппа		= Вычислить(ЭтоГруппа);
		Основной		= Вычислить(Основной);
		
		ИдентификаторСправочникаВлательцаБух = НайтиСоответствиеСправочника(ИдСпрВладТК);
		
		// проверим, может у нас длина кода меньше...
		ДлинаКода = Метаданные.Справочники[СокрЛП(ИдентификаторСправочникаБух)].ДлинаКода;
		Если СтрДлина(Код)>ДлинаКода Тогда
			Код = Прав(Код, ДлинаКода);
		КонецЕсли;
		ДлинаНаименования = Метаданные.Справочники[СокрЛП(ИдентификаторСправочникаБух)].ДлинаНаименования;
		Если СтрДлина(Наименование)>ДлинаНаименования Тогда
			Наименование = Лев(Наименование, ДлинаНаименования);
		КонецЕсли;
		
		// поищим элемент справочника
		НайденЭлемент = Ложь;
		
		РезультатПоиска = НайтиОбъектПоGUID(GUIDЭлемента);
		
		Если ЗначениеЗаполнено(РезультатПоиска) Тогда
			НайденЭлемент = Истина;
		КонецЕсли;                              
		
		// Допустимая глубина вложения элементов
		ДопустимоеКоличествоУровней = Метаданные.Справочники[СокрЛП(ИдентификаторСправочникаБух)].КоличествоУровней;
		// Тип кода - строка или число
		ТипКода = Строка(Метаданные.Справочники[СокрЛП(ИдентификаторСправочникаБух)].ТипКода);
		// Владелец справочника
		ВладелецСправочника = 0; 
		
		Попытка     
			Для Каждого ТекВлад Из Метаданные.Справочники[СокрЛП(ИдентификаторСправочникаБух)].Владельцы Цикл
				ВладелецСправочника = ТекВлад.Имя;
			КонецЦикла;
		Исключение КонецПопытки;
		
		// создадим элемент, или обновим...
		//Если ВРЕГ(ЭтоГруппа)<>"ЛОЖЬ" И ВРЕГ(ЭтоГруппа)<>"НЕТ" Тогда
		Если ЭтоГруппа Тогда
			Если ДопустимоеКоличествоУровней=1 Тогда
				// Группы создавать нельзя
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;
			
			Если НЕ НайденЭлемент ИЛИ ОбновлениеОбъектов Тогда
				Если НайденЭлемент Тогда
					Попытка 
						НовГрупСпр = РезультатПоиска.ПолучитьОбъект();
					Исключение
						ТекстСообщения = "Не удалось получить объект группы справочника. " + Символы.ПС + "Элемент источник: " + Наименование + Символы.ПС + "по причине:" + Символы.ПС + ОписаниеОшибки() + Символы.ПС + "Продолжение загрузки не возможно!";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						Лог.ДобавитьСтроку(ТекстСообщения);
						Возврат Ложь;
					КонецПопытки;
				Иначе
					Попытка
						НовГрупСпр = ОбъектСправочник.СоздатьГруппу();            
						//НовГрупСпр.Код = Код;
					Исключение
						ТекстСообщения = "Не удалось создать объект группы справочника. " + Символы.ПС + "Элемент источник: " + Наименование + Символы.ПС + "по причине:" + Символы.ПС + ОписаниеОшибки() + Символы.ПС + "Продолжение загрузки не возможно!";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						Лог.ДобавитьСтроку(ТекстСообщения);
						Возврат Ложь;
					КонецПопытки;
				КонецЕсли;
				
				Если НовГрупСпр.Наименование<>Наименование Тогда
					НовГрупСпр.Наименование = Наименование;
				КонецЕсли;
				
				Если НЕ обЗначениеНеЗаполнено(IDВладельца) Тогда
					РезультатПоиска = НайтиОбъектПоGUID(IDВладельца);
					Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
						Если НовГрупСпр.Владелец<>РезультатПоиска Тогда
							НовГрупСпр.Владелец = РезультатПоиска;
						КонецЕсли;
					Иначе
						ТекстСообщения = "Не найден владелец: " + Владелец + ", для элемента справочника " + Наименование + " с кодом: " + Код;
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						Лог.ДобавитьСтроку(ТекстСообщения);
					КонецЕсли;						
				КонецЕсли;
				
				// если есть группа для данного элемента - в нее его и помещаем
				Если НЕ обЗначениеНеЗаполнено(Родитель) Тогда              
					РезультатПоиска = НайтиОбъектПоGUID(Родитель);
					Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
						Если НовГрупСпр.Родитель<>РезультатПоиска.Ссылка Тогда
							НовГрупСпр.Родитель = РезультатПоиска.Ссылка;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если НовГрупСпр.Модифицированность() Тогда
					НачатьТранзакцию();
					Попытка
						НовГрупСпр.Записать();
					Исключение
						ТекстСообщения = "Не удалось записать элемент: " + НовГрупСпр + ", с кодом: " + НовГрупСпр.Код + Символы.ПС + "Элемент источник: " + Наименование + Символы.ПС + "по причине:" + Символы.ПС + ОписаниеОшибки() + Символы.ПС + "Продолжение загрузки не возможно!";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						Лог.ДобавитьСтроку(ТекстСообщения);
						ОтменитьТранзакцию();
						Возврат Ложь;
					КонецПопытки;
					Если НайденЭлемент Тогда
						ЗафиксироватьТранзакцию();
					Иначе
						Если ЗаписатьGUIDОбъекта(НовГрупСпр.Ссылка, GUIDЭлемента, "Справочник."+ИдентификаторСправочникаТК) Тогда
							ЗафиксироватьТранзакцию();
						Иначе
							ОтменитьТранзакцию();
							Возврат Ложь;
						КонецЕсли;
					КонецЕсли
				КонецЕсли;
			КонецЕсли;
		Иначе
			// создаем простой элемент справочника
			Если НЕ НайденЭлемент ИЛИ ОбновлениеОбъектов ИЛИ (ОбновлениеНоменклатуры И СокрЛП(ИдентификаторСправочникаБух)="Номенклатура") Тогда
				Если НайденЭлемент Тогда
					Попытка
						НовСпр = РезультатПоиска.ПолучитьОбъект();
					Исключение
						ТекстСообщения = "Не удалось получить объект элемента справочника. " + Символы.ПС + "Элемент источник: " + Наименование + Символы.ПС + "по причине:" + Символы.ПС + ОписаниеОшибки() + Символы.ПС + "Продолжение загрузки не возможно!";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						Лог.ДобавитьСтроку(ТекстСообщения);
						Возврат Ложь;
					КонецПопытки;
				Иначе
					Попытка
						НовСпр = ОбъектСправочник.СоздатьЭлемент();
					Исключение
						ТекстСообщения = "Не удалось создать объект элемента справочника. " + Символы.ПС + "Элемент источник: " + Наименование + Символы.ПС + "по причине:" + Символы.ПС + ОписаниеОшибки() + Символы.ПС + "Продолжение загрузки не возможно!";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						Лог.ДобавитьСтроку(ТекстСообщения);
						Возврат Ложь;
					КонецПопытки;
				КонецЕсли;
				
				Если НовСпр.Наименование<>Наименование Тогда
					НовСпр.Наименование = Наименование;
				КонецЕсли;
				
				// установим владельца элемента
				СтрВладелец = "";
				Если НЕ обЗначениеНеЗаполнено(IDВладельца) Тогда	
					РезультатПоиска = НайтиОбъектПоGUID(IDВладельца);
					Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
						Если НовСпр.Владелец<>РезультатПоиска Тогда
							// запомним владельца для вывода в случае ошибки
							СтрВладелец = СокрЛП(НовСпр.Владелец);
                            НовСпр.Владелец = РезультатПоиска;
						КонецЕсли;
					ИначеЕсли СокрЛП(ИдентификаторСправочникаБух)="ДоговорыКонтрагентов" Тогда
						ТекстСообщения = "Не найден владелец(Контрагент): " + Владелец + ", для договора " + Наименование + " с кодом: " + Код;
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						Лог.ДобавитьСтроку(ТекстСообщения);
					Иначе
						ТекстСообщения = "Не найден владелец: " + Владелец + ", для элемента справочника " + Наименование + " с кодом: " + Код;
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						Лог.ДобавитьСтроку(ТекстСообщения);
					КонецЕсли;
				КонецЕсли;
				
				// если есть группа для данного элемента - в нее его и помещаем
				Если НЕ обЗначениеНеЗаполнено(Родитель) И НовСпр.Метаданные().Иерархический Тогда              
					РезультатПоиска = НайтиОбъектПоGUID(Родитель);
					Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
						Если НовСпр.Родитель<>РезультатПоиска Тогда
							НовСпр.Родитель = РезультатПоиска;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если СокрЛП(ИдентификаторСправочникаБух)="Организации" Тогда //ИЛИ СокрЛП(ИдентификаторСправочникаБух)="Контрагенты" Тогда 
					Если НовСпр.ЮридическоеФизическоеЛицо.Пустая() Тогда
						НовСпр.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
					КонецЕсли;
				КонецЕсли;
				
				Если СокрЛП(ИдентификаторСправочникаБух)="Банки"
					ИЛИ СокрЛП(ИдентификаторСправочникаБух)="СтраныМира"
					ИЛИ СокрЛП(ИдентификаторСправочникаБух)="КлассификаторЕдиницИзмерения"
					ИЛИ СокрЛП(ИдентификаторСправочникаБух)="Валюты" Тогда
					
					Если НовСпр.Код<>Код Тогда
						НовСпр.Код = Код;
					КонецЕсли;
				КонецЕсли;
				
				Если СокрЛП(ИдентификаторСправочникаБух)="ДоговорыКонтрагентов" Тогда
					Если НовСпр.ВалютаВзаиморасчетов<>Константы.ВалютаРегламентированногоУчета.Получить() Тогда
						НовСпр.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить();
					КонецЕсли;
				КонецЕсли;
				
				Если СокрЛП(ИдентификаторСправочникаБух)="Склады" И НЕ НайденЭлемент Тогда
					НовСпр.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад;
				КонецЕсли;
				
				// Теперь заполняем реквизиты элементов справочника. Тут идем путем простого сравнения.
				// Если есть реквизит с таким именем - пытаемся его назначить
				ТипРеквизита = "";
				Для НомерРеквизита=0 По спРеквизитыЗагружаемогоОбъекта.Количество()-1 Цикл
					ИмяРеквизита = спРеквизитыЗагружаемогоОбъекта.Получить(НомерРеквизита);
					ТипРеквизита = ИмяРеквизита.Представление;
					ИмяРеквизита = СокрЛП(ИмяРеквизита.Значение);
					// читаем значение реквизита из файла
					ПозицияСимвола = ?(Найти(ТекущаяСтрока,",")=0,СтрДлина(ТекущаяСтрока)+1,Найти(ТекущаяСтрока,","));
					ЗначениеРеквизита = Лев(ТекущаяСтрока,ПозицияСимвола-1); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);
					Попытка
						//приведем в соответствие название реквизитов
						Если СокрЛП(ИдентификаторСправочникаБух)="Склады" И ИмяРеквизита="Подразделение" Тогда
							ИмяРеквизита = "ПодразделениеОрганизации";
						ИначеЕсли СокрЛП(ИдентификаторСправочникаБух)="Номенклатура" И ИмяРеквизита="СтавкаНДС" Тогда
							ТипРеквизита = "Перечисление";
						ИначеЕсли СокрЛП(ИдентификаторСправочникаБух)="Номенклатура" И ИмяРеквизита="ГруппаДляБухгалтерии" Тогда
							ИмяРеквизита = "НоменклатурнаяГруппа";
						ИначеЕсли СокрЛП(ИдентификаторСправочникаБух)="Номенклатура" И ИмяРеквизита="ВидНоменклатуры" Тогда
							ИмяРеквизита="ТипНоменклатуры";
						ИначеЕсли СокрЛП(ИдентификаторСправочникаБух)="Номенклатура" И ИмяРеквизита="ТипНоменклатуры" Тогда
							ИмяРеквизита="ВидНоменклатуры";
						КонецЕсли;
						// если есть такой реквизит
						Тип = Метаданные.Справочники[СокрЛП(ИдентификаторСправочникаБух)].Реквизиты[ИмяРеквизита].Тип;
						// Назначаем значение реквизита
						Если ТипРеквизита="Строка" Тогда
							ЗначениеРеквизита = ВосстПредстРеквизита(СокрЛП(ЗначениеРеквизита));
							Если НовСпр[ИмяРеквизита]<>СокрЛП(ЗначениеРеквизита) Тогда
								НовСпр[ИмяРеквизита] = СокрЛП(ЗначениеРеквизита);
							КонецЕсли;
						ИначеЕсли ТипРеквизита="Число" Тогда
							Если НовСпр[ИмяРеквизита]<>Число(ЗначениеРеквизита) Тогда
								НовСпр[ИмяРеквизита] = Число(ЗначениеРеквизита);
							КонецЕсли;
						ИначеЕсли ТипРеквизита="Дата" Тогда
							Если НовСпр[ИмяРеквизита]<>Дата(ЗначениеРеквизита) Тогда
								НовСпр[ИмяРеквизита] = Дата(ЗначениеРеквизита);
							КонецЕсли;
						ИначеЕсли ТипРеквизита="Булево" Тогда
							Если НовСпр[ИмяРеквизита]<>(ЗначениеРеквизита="Истина") Тогда
								НовСпр[ИмяРеквизита] = (ЗначениеРеквизита="Истина")
							КонецЕсли;
						ИначеЕсли ТипРеквизита="Справочник" Тогда
							//ИдентификаторСправочникаБухДляПоиска = НайтиСоответствиеСправочника(ИмяРеквизита);
							РезультатПоиска = НайтиОбъектПоGUID(СокрЛП(ЗначениеРеквизита));
							Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
								Если НовСпр[ИмяРеквизита]<>РезультатПоиска Тогда
									НовСпр[ИмяРеквизита] = РезультатПоиска;
								КонецЕсли;
							КонецЕсли;
						ИначеЕсли ТипРеквизита="Перечисление" Тогда //И НЕ НайденЭлемент Тогда //ТОЛЬКО ДЛЯ НОВЫХ
							Если НовСпр[ИмяРеквизита]<>НайтиСоответствиеПеречисления(ЗначениеРеквизита) Тогда
								НовСпр[ИмяРеквизита] = НайтиСоответствиеПеречисления(ЗначениеРеквизита);
							КонецЕсли;
						Иначе
							// Дополнить по необходимости
						КонецЕсли;
					Исключение
						Попытка
							// Для подразделения нужен владелец, а в ТК нет подчинения владельцу !
							Если СокрЛП(ИдентификаторСправочникаБух)="ПодразделенияОрганизаций" И ИмяРеквизита="Организация" И ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
								РезультатПоиска = НайтиОбъектПоGUID(СокрЛП(ЗначениеРеквизита));
								Если ЗначениеЗаполнено(РезультатПоиска) И ТипЗнч(РезультатПоиска)=Тип("СправочникСсылка.Организации") И НовСпр.Владелец<>РезультатПоиска Тогда
									НовСпр.Владелец = РезультатПоиска;
									Попытка
										Если НовСпр.Родитель.Владелец<>НовСпр.Владелец Тогда
											ТекстСообщения = "Группа для подразделения " + НовСпр.Наименование + " не присвоена, по причине:" + Символы.ПС + "Организация вышестоящего подразделения " + НовСпр.Родитель + ", не соответствует организации создаваемого подразделения.";
											ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
											Лог.ДобавитьСтроку(ТекстСообщения);
											НовСпр.Родитель = Неопределено;	
										КонецЕсли;
									Исключение КонецПопытки;
								КонецЕсли;
							КонецЕсли;
							// Для складов установим тип склада (розничный/оптовый)
							Если СокрЛП(ИдентификаторСправочникаБух)="Склады" И ИмяРеквизита="Розничный" И НЕ НайденЭлемент Тогда //ТОЛЬКО ДЛЯ НОВЫХ
								Если Вычислить(СокрЛП(ЗначениеРеквизита)) Тогда
									НовСпр.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин;
									//НовСпр.ТипЦенРозничнойТорговли = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновнойТипЦенПродажи");//Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000001");
								Иначе
									НовСпр.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад;
								КонецЕсли;
							КонецЕсли;
							// Для контрагентов заполним форму собственности
							Если СокрЛП(ИдентификаторСправочникаБух)="Контрагенты" И ИмяРеквизита="ФормаСобственности" Тогда
								Если Найти(ЗначениеРеквизита,"ЧастныйПредприниматель")>0 ИЛИ Найти(ЗначениеРеквизита,"ЧастноеЛицо")>0 Тогда
									ЮрФизЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
								Иначе
									ЮрФизЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
								КонецЕсли;
								Если НовСпр.ЮридическоеФизическоеЛицо<>ЮрФизЛицо Тогда
									НовСпр.ЮридическоеФизическоеЛицо = ЮрФизЛицо;
								КонецЕсли;
							КонецЕсли;
							// Для договоров дозаполним значения реквизитов
							Если СокрЛП(ИдентификаторСправочникаБух)="ДоговорыКонтрагентов" И НЕ НайденЭлемент Тогда //ТОЛЬКО ДЛЯ НОВЫХ
								Если ИмяРеквизита="СрокОплатыЗадолженности" Тогда
									Если ЗначениеЗаполнено(ЗначениеРеквизита) И ТипРеквизита="Число" И Число(ЗначениеРеквизита)<>0 Тогда
										НовСпр.УстановленСрокОплаты = Истина;
										НовСпр.СрокОплаты = Число(ЗначениеРеквизита);
									Иначе
										НовСпр.УстановленСрокОплаты = Ложь;
									КонецЕсли;
								ИначеЕсли ИмяРеквизита="НомерДоговора" И ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
									ЗначениеРеквизита = ВосстПредстРеквизита(ЗначениеРеквизита); 
									Если НовСпр.Номер<>ЗначениеРеквизита Тогда
										НовСпр.Номер = ЗначениеРеквизита;
									КонецЕсли;
								ИначеЕсли ИмяРеквизита="ДатаНачала" И ЗначениеЗаполнено(ЗначениеРеквизита) И ТипРеквизита="Дата" Тогда
									Если НовСпр.Дата<>Дата(ЗначениеРеквизита) Тогда
										НовСпр.Дата = Дата(ЗначениеРеквизита);
									КонецЕсли;
								ИначеЕсли ИмяРеквизита="ДатаКонца" И ЗначениеЗаполнено(ЗначениеРеквизита) И ТипРеквизита="Дата" Тогда
									Если НовСпр.СрокДействия<>Дата(ЗначениеРеквизита) Тогда
										НовСпр.СрокДействия = Дата(ЗначениеРеквизита);
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							//Для Номенклатуры заполним
							Если СокрЛП(ИдентификаторСправочникаБух)="Номенклатура" Тогда
								//Если ИмяРеквизита="ВидНоменклатуры" Тогда
								//	РезультатПоиска = Справочники.ВидыНоменклатуры.НайтиПоНаименованию(СтрЗаменить(ЗначениеРеквизита,"Перечисление.ВидыНоменклатуры.", ""));
								//	Если ЗначениеЗаполнено(РезультатПоиска) И НовСпр.ВидНоменклатуры<>РезультатПоиска Тогда
								//		НовСпр.ВидНоменклатуры = РезультатПоиска;
								//	КонецЕсли;
								Если ИмяРеквизита="БазоваяЕдиницаИзмерения" Тогда
									РезультатПоиска = НайтиОбъектПоGUID(СокрЛП(ЗначениеРеквизита));
									Если ЗначениеЗаполнено(РезультатПоиска) И ТипЗнч(РезультатПоиска)=Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") И НовСпр.ЕдиницаИзмерения<>РезультатПоиска Тогда
										НовСпр.ЕдиницаИзмерения = РезультатПоиска;
									КонецЕсли;
								ИначеЕсли ИмяРеквизита="СтавкаНДС" Тогда
									Если НЕ ЗначениеЗаполнено(НовСпр.ВидСтавкиНДС) ИЛИ ОбновлениеНоменклатуры Тогда
										Если ЗначениеРеквизита="20" ИЛИ ЗначениеРеквизита="18" Тогда
											НовСпр.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая;
										ИначеЕсли ЗначениеРеквизита="10" Тогда
											НовСпр.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Пониженная;
										ИначеЕсли ЗначениеРеквизита="0" Тогда
											НовСпр.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Нулевая;
										Иначе
											НовСпр.ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.БезНДС;
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						Исключение КонецПопытки;
					КонецПопытки;
				КонецЦикла;
				
				Если НовСпр.Модифицированность() Тогда
					НачатьТранзакцию();
					Попытка
						НовСпр.Записать();
						// уберем принадлежность к холдингу для нового контрагента
						Если НЕ НайденЭлемент И СокрЛП(ИдентификаторСправочникаБух)="Контрагенты" Тогда
							НовСпр.ГоловнойКонтрагент = НовСпр.Ссылка;
							НовСпр.Записать();
						КонецЕсли;
						//Если Основной Тогда
						//	Установка основного договора или счета
						//КонецЕсли;
					Исключение
						ТекстСообщения = "Не удалось записать элемент: " + НовСпр + ", с кодом: " + НовСпр.Код + ", владелец: " + СтрВладелец + Символы.ПС + "Элемент источник: " + Наименование + ", владелец: " + Владелец + Символы.ПС + "по причине:" + Символы.ПС + ОписаниеОшибки() + Символы.ПС + "Продолжение загрузки не возможно!";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
						Лог.ДобавитьСтроку(ТекстСообщения);
						ОтменитьТранзакцию();
						Если ОбновлениеОбъектов И СокрЛП(ИдентификаторСправочникаБух)="ДоговорыКонтрагентов" Тогда
							//если по договору были движения, обновить его уже не получится, но и прерывать загрузку не стоит из-за этого....
							Продолжить;
						Иначе
							Возврат Ложь;
						КонецЕсли;
					КонецПопытки;
					Если НайденЭлемент Тогда
						ЗафиксироватьТранзакцию();
					Иначе
						Если ЗаписатьGUIDОбъекта(НовСпр.Ссылка, GUIDЭлемента, "Справочник."+ИдентификаторСправочникаТК) Тогда
							ЗафиксироватьТранзакцию();
						Иначе
							ОтменитьТранзакцию();
							Возврат Ложь;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
	КонецЦикла;
	
	Возврат Истина;	
КонецФункции //ЗагрузитьСправочники()

Функция ЗагрузитьЗаписьКУДиР(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	// Читаем данные по документу
	ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола	= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация		= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента	= ВосстПредстРеквизита(ИмяДокумента);
	Организация		= НайтиОбъектПоGUID(Организация);
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ЗаписьКУДиР");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.Строки.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.ЗаписьКУДиР.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;			
	
	Документ.Дата			= Дата(ДатаДокумента);
	Документ.Комментарий	= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Организация	= Организация;
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);			
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}");ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ДоходРасход		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Содержание		= СокрЛП(ТекущаяСтрока);
			
			//заполнение ТЧ документа
			НовСтр = Документ.Строки.Добавить();
			НовСтр.ДатаНомер  = ДатаДокумента + " №" + НомерДокумента;
			НовСтр.Содержание = ВосстПредстРеквизита(Содержание);
			Если ДоходРасход="Расход" Тогда
				НовСтр.Графа6 = Сумма;
			ИначеЕсли ДоходРасход="Доход" Тогда
				НовСтр.Графа4 = Сумма;
			КонецЕсли; 
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "Строки");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать();
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать();
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Документ.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен		 = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ЗаписьКУДиР") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции //ЗагрузитьЗаписьКУДиР()

Функция ЗагрузитьКонтактнаяИнформация(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=2 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	// Адреса контрагентов
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");ПозицияСимвола=Найти(ТекущаяСтрока,","); 
	ТекущаяСтрока = Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	
	киОбъект 	                    = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	киОбъектУникальныйИдентификатор = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	киТип		                	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	киВид	 	                    = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	киЗначениеПоУмолчанию 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	киКомментарий 		        	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");				
	
	киПоле1  = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); //Индекс / Код страны
	киПоле2  = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); //Регион / Код города
	киПоле3  = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); //Район / Номер телефона
	киПоле4  = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); //Город / Внутренний
	киПоле5  = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); //Нас.пункт
	киПоле6  = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); //Улица
	киПоле7  = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); //Дом
	киПоле8  = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); //Корпус
	киПоле9  = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); //Квартира
	киПоле10 = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); //Подъезд
	киПоле11 = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); //Этаж
	киПоле12 = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); //Код
	
	киПредставление	= ВосстПредстРеквизита(ТекущаяСтрока);
	
	ОбъектСсылка = НайтиОбъектПоGUID(киОбъектУникальныйИдентификатор, "Справочник.Контрагенты");
	Если ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Если Найти(киТип,"Адрес")>0 Тогда
			ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
			Если Найти(киВид, "Юридический адрес")>0 Тогда
				ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
			Иначе
				ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
			КонецЕсли;
		ИначеЕсли Найти(киТип, "Телефон")>0 Тогда
			ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
			ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		Иначе
			Возврат Истина;
		КонецЕсли;
		
		СтрОтбора = Новый Структура("Тип,Вид", ТипКонтактнойИнформации, ВидКонтактнойИнформации);
		МассивКИ = ОбъектСсылка.КонтактнаяИнформация.НайтиСтроки(СтрОтбора);
		Если МассивКИ.Количество()=0 ИЛИ ОбновлениеОбъектов Тогда
			ТекОбъект = ОбъектСсылка.ПолучитьОбъект();
			Если Найти(киТип, "Телефон")>0 Тогда
				//формируем свое представление
				Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(киПоле1, киПоле2, киПоле3, киПоле4, "");
				
				//пишем телефон
				НоваяСтрока = ТекОбъект.КонтактнаяИнформация.Найти(Представление, "Представление");
				Если НоваяСтрока=Неопределено Тогда
					НоваяСтрока = ТекОбъект.КонтактнаяИнформация.Добавить();
				КонецЕсли;
				НоваяСтрока.Тип				= ТипКонтактнойИнформации;
				НоваяСтрока.Вид				= ВидКонтактнойИнформации;
				НоваяСтрока.Представление	= Представление;
							
				ПространствоИмен = УправлениеКонтактнойИнформациейКлиентСервер.ПространствоИмен();
				Данные = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИмен, "НомерТелефона"));
				Данные.КодСтраны	= киПоле1;
				Данные.КодГорода	= киПоле2;
				Данные.Номер		= киПоле3;
				Данные.Добавочный	= киПоле4;
				
				обXDTO = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИмен, "КонтактнаяИнформация"));
				обXDTO.Состав			= Данные;
				обXDTO.Представление	= Представление;
				
			Иначе
				//СтруктураАдреса = УправлениеКонтактнойИнформациейКлиентСервер.СтруктураКонтактнойИнформацииПоТипу(ТипКонтактнойИнформации);
				СтруктураАдреса = РаботаСАдресамиКлиентСервер.СтруктураКонтактнойИнформацииПоТипу(ТипКонтактнойИнформации);
				СтруктураАдреса.Страна				= "РОССИЯ";
				Если ЗначениеЗаполнено(киПоле1) Тогда
					СтруктураАдреса.Индекс			= киПоле1;
				КонецЕсли;
				Если ЗначениеЗаполнено(киПоле2) Тогда
					СтруктураАдреса.Регион			= киПоле2;
				КонецЕсли;
				Если ЗначениеЗаполнено(киПоле3) Тогда
					СтруктураАдреса.Район			= киПоле3;
				КонецЕсли;
				Если ЗначениеЗаполнено(киПоле4) Тогда
					СтруктураАдреса.Город			= киПоле4;
				КонецЕсли;
				Если ЗначениеЗаполнено(киПоле5) Тогда
					СтруктураАдреса.НаселенныйПункт	= киПоле5;
				КонецЕсли;
				Если ЗначениеЗаполнено(киПоле6) Тогда
					СтруктураАдреса.Улица			= киПоле6;
				КонецЕсли;
				Если ЗначениеЗаполнено(киПоле7) Тогда
					СтруктураАдреса.Дом				= киПоле7;
					СтруктураАдреса.ТипДома			= "дом";
				КонецЕсли;
				Если ЗначениеЗаполнено(киПоле8) Тогда
					СтруктураАдреса.Корпус			= киПоле8;
					СтруктураАдреса.ТипКорпуса		= "корпус";
				КонецЕсли;
				Если ЗначениеЗаполнено(киПоле9) Тогда
					СтруктураАдреса.Квартира		= киПоле9;
					СтруктураАдреса.ТипКвартиры		= "кв.";
				КонецЕсли;
				
				//формируем свое представление
				Представление = "";
				УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеАдреса(СтруктураАдреса, Представление);
				СтруктураАдреса.Представление		= Представление;
				
				//удалим старый адрес
				МассивКИ = ТекОбъект.КонтактнаяИнформация.НайтиСтроки(СтрОтбора);
				Для Каждого СтрокаКИ Из МассивКИ Цикл
					ТекОбъект.КонтактнаяИнформация.Удалить(СтрокаКИ);
				КонецЦикла;
				
				//пишем адрес
				НоваяСтрока = ТекОбъект.КонтактнаяИнформация.Добавить();
				НоваяСтрока.Тип				= ТипКонтактнойИнформации;
				НоваяСтрока.Вид				= ВидКонтактнойИнформации;
				НоваяСтрока.Представление	= Представление;
				НоваяСтрока.Страна			= "РОССИЯ";
							
				обXDTO = УправлениеКонтактнойИнформациейСлужебный.АдресXMLВXDTO(СтруктураАдреса);
			КонецЕсли;
			НоваяСтрока.ЗначенияПолей		= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(обXDTO);
				
			Попытка
				ТекОбъект.Записать();
			Исключение КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции //ЗагрузитьКонтактнаяИнформация()

Функция ЗагрузитьИзменения(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	// Имеем дело с обновлением операции... проверим
	// Если такую не найдем, значить её ещё не проводили
	// Читаем данные по операции  
	
	ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола	= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); // Слово "Операция" не нужно
	ИмяОперации		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаОперации	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус	= СокрЛП(ТекущаяСтрока);
	
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		Операция = РезультатПоиска.ПолучитьОбъект();
		ТекстСообщения = "Обновляется операция: " + ИмяОперации;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Если Число(ТекущийСтатус)=0 Тогда
			Операция.ПометкаУдаления = Истина;
			Операция.Проведен		 = Ложь;
            Операция.Записать();
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Операция.ПометкаУдаления = Истина;
			Операция.Проведен		 = Ложь;
			Операция.Записать();
		КонецЕсли;			
	КонецЕсли;
	
	Возврат Истина;
КонецФункции //ЗагрузитьИзменения()

Функция ЗагрузитьПриходныйКассовыйОрдер(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВидДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	//СчетУчета			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	//СчетРасчетов		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Основание			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Приложение			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЕстьОк				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Дополнительно		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	СчетУчета			= ПланыСчетов.Хозрасчетный.НайтиПоКоду(ПреобразоватьСчет(СчетУчета));
	СчетРасчетов		= ПланыСчетов.Хозрасчетный.НайтиПоКоду(ПреобразоватьСчет(СчетРасчетов));
	Основание			= ВосстПредстРеквизита(Основание);
	Приложение			= ВосстПредстРеквизита(Приложение);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	ЕстьОК				= (ЕстьОК="Истина");
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ПриходныйКассовыйОрдер");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.РасшифровкаПлатежа.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	//Трофимова 25.02.2019 +++
	ДеятельностьНаТорговомСборе = Ложь;
	//Трофимова 25.02.2019 --- 
	
	Если ВидДокумента="Выручка" Тогда
		//ВидОперации = Перечисления.ВидыОперацийПКО.ПрочийПриход; //Здесь была "РозничнаяВыручка"
		//Трофимова 04.02.2019 +++
		ВидОперации = Перечисления.ВидыОперацийПКО.РозничнаяВыручка;
		// alav
		Если Не Контрагент =  Неопределено тогда
		Документ.ВыручкаСНТТ = Истина;
		//Документ.ВыручкаСНТТ = Контрагент.ТипСклада = Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка;
		ДеятельностьНаТорговомСборе = УчетнаяПолитика.ПлательщикТорговогоСбора(Организация, ДатаДокумента);
		Документ.ДеятельностьНаТорговомСборе = ДеятельностьНаТорговомСборе;
		КонецЕсли;
		// alav
		//Трофимова 04.02.2019 --- 
	ИначеЕсли ВидДокумента="Подотчет" Тогда
		ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратОтПодотчетногоЛица;
	ИначеЕсли ВидДокумента="Оплата" Тогда
		ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя;
	ИначеЕсли ВидДокумента="Возврат" Тогда
		ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратОтПоставщика;
	Иначе
		ВидОперации = Перечисления.ВидыОперацийПКО.ПрочийПриход;
	КонецЕсли;
	
	Документ.Дата								= ДатаДокумента;
	Документ.ВидОперации						= ВидОперации;
	Документ.Комментарий						= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный						= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация						= Организация;
	Документ.Контрагент							= Контрагент;
	//Документ.СчетКасса							= ?(обЗначениеНеЗаполнено(СчетУчета), ПланыСчетов.Хозрасчетный.КассаОрганизации, СчетУчета);
	Если Дополнительно = "ВнесениеВКассуККМ" Тогда
		Документ.СчетКасса							= ПланыСчетов.Хозрасчетный.ОперационнаяКасса;
	Иначе
		Документ.СчетКасса							= ПланыСчетов.Хозрасчетный.КассаОрганизации;
	КонецЕсли;
	Документ.ВалютаДокумента					= Константы.ВалютаРегламентированногоУчета.Получить();
	Документ.Основание							= Основание;
	Документ.Приложение							= Приложение;
	Документ.РучнаяКорректировка				= Ложь;
	Если ВидОперации=Перечисления.ВидыОперацийПКО.РозничнаяВыручка ИЛИ ВидДокумента="Выручка" Тогда
		Документ.СчетУчетаРасчетовСКонтрагентом = ?(обЗначениеНеЗаполнено(СчетРасчетов), ПланыСчетов.Хозрасчетный.ОперационнаяКасса, СчетРасчетов);
	КонецЕсли;
	Документ.ПринятоОт							= Контрагент;
	Если ЕстьОк Тогда
		Документ.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("57.01");
		Документ.СтатьяДвиженияДенежныхСредств	= Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоРеквизиту("ЕРПМастерКлюч", "00-000793");
		Документ.СубконтоКт1					= Документ.СтатьяДвиженияДенежныхСредств;
	КонецЕсли;
	
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации		= Подразделение;
		Если ВидОперации=Перечисления.ВидыОперацийПКО.ПрочийПриход Тогда
			Документ.ПодразделениеКт			= Подразделение;	
		КонецЕсли;
	КонецЕсли;
	
	Если НеМенятьНомераДок Тогда
		Документ.Номер							= НомерДокумента;		
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);			
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}");ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтатьяДДС		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Договор			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДС		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДСИмя	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СчетРасчетов	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма			= СокрЛП(ТекущаяСтрока);
			
			Сумма			= ?(Сумма="", 0, Число(Сумма));
			СуммаНДС		= ?(СуммаНДС="", 0, Число(СуммаНДС));
			СтавкаНДС		= ПолучитьЗначениеРеквизита(СтавкаНДС, СтавкаНДСИмя);
			Договор			= НайтиОбъектПоGUID(Договор);
			СтатьяДДС		= НайтиОбъектПоGUID(СтатьяДДС);
			СчетРасчетов	= ПланыСчетов.Хозрасчетный.НайтиПоКоду(ПреобразоватьСчет(СчетРасчетов));
			
			Если ВидДокумента="Выручка" Тогда
				Попытка
					Документ.СубконтоКт1 = СтатьяДДС;
					Документ.СтатьяДвиженияДенежныхСредств = СтатьяДДС;
				Исключение КонецПопытки;
			КонецЕсли;
			
			//заполнение ТЧ документа
			НовСтр = Документ.РасшифровкаПлатежа.Добавить();
			Если ВидОперации<>Перечисления.ВидыОперацийПКО.ВозвратОтПодотчетногоЛица И ВидОперации<>Перечисления.ВидыОперацийПКО.РозничнаяВыручка Тогда
				НовСтр.ДоговорКонтрагента				= Договор;
				НовСтр.СтатьяДвиженияДенежныхСредств	= СтатьяДДС;
				НовСтр.СпособПогашенияЗадолженности		= Перечисления.СпособыПогашенияЗадолженности.Автоматически;
			КонецЕсли;
			//Трофимова 04.02.2019 +++
			Если ВидОперации=Перечисления.ВидыОперацийПКО.РозничнаяВыручка Тогда 
				НовСтр.СтатьяДвиженияДенежныхСредств	= СтатьяДДС;	
			КонецЕсли;
			//Трофимова 04.02.2019 --- 
			НовСтр.КурсВзаиморасчетов					= 1;
			НовСтр.СуммаПлатежа							= Сумма;
			НовСтр.КратностьВзаиморасчетов 				= 1;
			НовСтр.СуммаВзаиморасчетов					= Сумма;
			НовСтр.СтавкаНДС							= СтавкаНДС;
			НовСтр.СуммаНДС								= СуммаНДС;
			
			//установка счетов учета и расчетов
			Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(Договор) Тогда
				СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, Договор);
				Если ВидОперации=Перечисления.ВидыОперацийПКО.ВозвратОтПоставщика Тогда
					НовСтр.СчетУчетаРасчетовСКонтрагентом	= СчетаУчета.СчетРасчетов;
					НовСтр.СчетУчетаРасчетовПоАвансам		= СчетаУчета.СчетАвансов;
				Иначе
					НовСтр.СчетУчетаРасчетовСКонтрагентом	= СчетаУчета.СчетРасчетовПокупателя;
					НовСтр.СчетУчетаРасчетовПоАвансам		= СчетаУчета.СчетАвансовПокупателя;
				КонецЕсли;
			КонецЕсли;
			//Если НЕ ЗначениеЗаполнено(НовСтр.СчетУчетаРасчетовСКонтрагентом) Тогда
			//	НовСтр.СчетУчетаРасчетовСКонтрагентом = СчетРасчетов;
			//	Если ВидОперации = Перечисления.ВидыОперацийПКО.ПрочийПриход Тогда
			//		Документ.СчетУчетаРасчетовСКонтрагентом = СчетРасчетов;
			//	КонецЕсли;
			//КонецЕсли;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Документ.СуммаДокумента = Документ.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	//Трофимова 25.02.2019 +++
	Документ.Графа5_УСН = ?(ДеятельностьНаТорговомСборе,Документ.СуммаДокумента,0);
	//Трофимова 25.02.2019 --- 
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "РасшифровкаПлатежа");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен		 = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ПриходныйКассовыйОрдер") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.ПриходныйКассовыйОрдер");
	
	Возврат Истина;
КонецФункции //ЗагрузитьПриходныйКассовыйОрдер()

Функция ЗагрузитьРасходныйКассовыйОрдер(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВидДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	//СчетУчета			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	//СчетРасчетов		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Основание			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Приложение			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЕстьОК				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Дополнительно		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	СчетУчета			= ПланыСчетов.Хозрасчетный.НайтиПоКоду(ПреобразоватьСчет(СчетУчета));         
	СчетРасчетов		= ПланыСчетов.Хозрасчетный.НайтиПоКоду(ПреобразоватьСчет(СчетРасчетов));
	Основание			= ВосстПредстРеквизита(Основание);
	Приложение			= ВосстПредстРеквизита(Приложение);
	ЕстьОК				= (ЕстьОК="Истина");
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.РасходныйКассовыйОрдер");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.РасшифровкаПлатежа.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.РасходныйКассовыйОрдер.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	//Если ВидДокумента="Подотчет" Тогда
	//	ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаПодотчетномуЛицу;
	//ИначеЕсли ВидДокумента="Оплата" Тогда
	//	ВидОперации = Перечисления.ВидыОперацийРКО.ОплатаПоставщику;
	//ИначеЕсли ВидДокумента="Возврат" Тогда
	//	ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратПокупателю;
	//ИначеЕсли ВидДокумента="Инкассация" Тогда
	//	ВидОперации = Перечисления.ВидыОперацийРКО.Инкассация;
	//Иначе
		ВидОперации = Перечисления.ВидыОперацийРКО.ПрочийРасход;
	//КонецЕсли;
	
	Документ.Дата							= ДатаДокумента;
	Документ.ВидОперации					= ВидОперации;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	//Документ.Контрагент						= Контрагент;
	//Документ.СчетКасса						= ПланыСчетов.Хозрасчетный.НайтиПоКоду("50.02");//?(обЗначениеНеЗаполнено(СчетУчета),ПланыСчетов.Хозрасчетный.КассаОрганизации,СчетУчета);
	Если Дополнительно = "ИзъятиеИзКассыККМ" Тогда
		Документ.СчетКасса							= ПланыСчетов.Хозрасчетный.ОперационнаяКасса;
	Иначе
		Документ.СчетКасса							= ПланыСчетов.Хозрасчетный.КассаОрганизации;
	КонецЕсли;
	Документ.ВалютаДокумента				= Константы.ВалютаРегламентированногоУчета.Получить();
	//Документ.СчетОрганизации				= Документ.Организация.ОсновнойБанковскийСчет;
	Документ.СтатьяДвиженияДенежныхСредств	= Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоРеквизиту("ЕРПМастерКлюч", "00-000793");
	Документ.СубконтоДт1					= Документ.СтатьяДвиженияДенежныхСредств;
	Документ.Выдать							= Контрагент;
	Документ.Основание						= Основание;
	Документ.Приложение						= Приложение;
	Документ.РучнаяКорректировка			= Ложь;
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;
		Если ВидОперации=Перечисления.ВидыОперацийРКО.Инкассация ИЛИ ВидОперации=Перечисления.ВидыОперацийРКО.ПрочийРасход Тогда
			Документ.ПодразделениеДт		= Подразделение;	
		КонецЕсли;
	КонецЕсли;
	
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}");ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтатьяДДС		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Договор			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДС		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДСИмя	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			//СчетРасчетов	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма			= СокрЛП(ТекущаяСтрока);
			
			Сумма			= ?(Сумма="", 0, Число(Сумма));
			СуммаНДС		= ?(СуммаНДС="", 0, Число(СуммаНДС));
			СтавкаНДС		= ПолучитьЗначениеРеквизита(СтавкаНДС, СтавкаНДСИмя);
			Договор			= НайтиОбъектПоGUID(Договор);
			СтатьяДДС		= НайтиОбъектПоGUID(СтатьяДДС);
			СчетРасчетов	= ПланыСчетов.Хозрасчетный.НайтиПоКоду(ПреобразоватьСчет(СчетРасчетов));
			
			//Если ВидДокумента="Инкассация" Тогда
			//	Попытка
			//		Документ.СубконтоДт1 = СтатьяДДС;
			//		Документ.СтатьяДвиженияДенежныхСредств = СтатьяДДС;
			//	Исключение КонецПопытки;
			//КонецЕсли;
			
			//заполнение ТЧ документа
			НовСтр = Документ.РасшифровкаПлатежа.Добавить();
			//Если ВидОперации<>Перечисления.ВидыОперацийРКО.ВыдачаПодотчетномуЛицу Тогда
			//	НовСтр.ДоговорКонтрагента				= Договор;
			//	НовСтр.СтатьяДвиженияДенежныхСредств	= Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоРеквизиту("ЕРПМастерКлюч", "00-000793");//СтатьяДДС;
			//	НовСтр.СпособПогашенияЗадолженности		= Перечисления.СпособыПогашенияЗадолженности.Автоматически;
			//КонецЕсли;
			НовСтр.КурсВзаиморасчетов					= 1;
			НовСтр.СуммаПлатежа							= Сумма;
			НовСтр.КратностьВзаиморасчетов 				= 1;
			НовСтр.СуммаВзаиморасчетов					= Сумма;
			НовСтр.СтавкаНДС							= СтавкаНДС;
			НовСтр.СуммаНДС								= СуммаНДС;
			
			//установка счетов учета и расчетов
			Документ.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("57.01");
			//Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(Договор) И ВидОперации<>Перечисления.ВидыОперацийРКО.Инкассация Тогда
			//	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, Договор);
			//	Если ВидОперации=Перечисления.ВидыОперацийРКО.ВозвратПокупателю Тогда
			//		НовСтр.СчетУчетаРасчетовСКонтрагентом	= СчетаУчета.СчетРасчетовПокупателя;
			//		НовСтр.СчетУчетаРасчетовПоАвансам		= СчетаУчета.СчетАвансовПокупателя;
			//	Иначе
			//		НовСтр.СчетУчетаРасчетовСКонтрагентом	= СчетаУчета.СчетРасчетов;
			//		НовСтр.СчетУчетаРасчетовПоАвансам		= СчетаУчета.СчетАвансов;
			//	КонецЕсли;
			//КонецЕсли;	
			//Если НЕ ЗначениеЗаполнено(НовСтр.СчетУчетаРасчетовСКонтрагентом) Тогда
			//	НовСтр.СчетУчетаРасчетовСКонтрагентом = ?(обЗначениеНеЗаполнено(СчетРасчетов), ПланыСчетов.Хозрасчетный.НайтиПоКоду("57.04") ,СчетРасчетов);
			//	Если ВидОперации=Перечисления.ВидыОперацийРКО.Инкассация ИЛИ ВидОперации=Перечисления.ВидыОперацийРКО.ПрочийРасход Тогда
			//		Документ.СчетУчетаРасчетовСКонтрагентом =?(обЗначениеНеЗаполнено(СчетРасчетов), ПланыСчетов.Хозрасчетный.НайтиПоКоду("57.04") ,СчетРасчетов);
			//	КонецЕсли;
			//КонецЕсли;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Документ.СуммаДокумента = Документ.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "РасшифровкаПлатежа");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен		 = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.РасходныйКассовыйОрдер") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.РасходныйКассовыйОрдер");
	
	Если НЕ НайденДокумент И НЕ Документ.Проведен Тогда
		Возврат Истина;
	Иначе
		РКО = Документ.Ссылка;
	КонецЕсли;
	
	Если ЕстьОК И НЕ ВидДокумента="Инкассация" Тогда
		// не создаем зеркальный документ для ЦМГ, т.к. он будет выгружен из ТК
		Возврат Истина;
	КонецЕсли;
	
	//Теперь создаём аналогичный документ, но приходный
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ПриходныйКассовыйОрдер");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.РасшифровкаПлатежа.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	ВидОперации = Перечисления.ВидыОперацийПКО.ПрочийПриход;
	
	Документ.Дата								= ДатаДокумента+1;
	Документ.ВидОперации						= ВидОперации;
	Документ.Комментарий						= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный						= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация						= Организация;
	//Документ.Контрагент							= Контрагент;
	Документ.СчетКасса							= ПланыСчетов.Хозрасчетный.НайтиПоКоду("50.01");//?(обЗначениеНеЗаполнено(СчетУчета), ПланыСчетов.Хозрасчетный.КассаОрганизации, СчетУчета);
	Документ.ВалютаДокумента					= Константы.ВалютаРегламентированногоУчета.Получить();
	Документ.Основание							= Основание;
	Документ.Приложение							= Приложение;
	Документ.СтатьяДвиженияДенежныхСредств		= Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоРеквизиту("ЕРПМастерКлюч", "00-000793");
	Документ.СубконтоКт1						= Документ.СтатьяДвиженияДенежныхСредств;
	Документ.РучнаяКорректировка				= Ложь;
	//Если ВидОперации=Перечисления.ВидыОперацийПКО.РозничнаяВыручка ИЛИ ВидДокумента="Выручка" Тогда
	//	Документ.СчетУчетаРасчетовСКонтрагентом = ?(обЗначениеНеЗаполнено(СчетРасчетов), ПланыСчетов.Хозрасчетный.ОперационнаяКасса, СчетРасчетов);
	//КонецЕсли;
	Документ.ПринятоОт							= Контрагент;
	
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации		= ?(ЕстьОК И НЕ ВидДокумента="Инкассация", Подразделение, Справочники.ПодразделенияОрганизаций.НайтиПоРеквизиту("ЕРПМастерКлюч", "ФР00-0026"));
		Если ВидОперации=Перечисления.ВидыОперацийПКО.ПрочийПриход Тогда
			Документ.ПодразделениеКт			= Подразделение;	
		КонецЕсли;
	КонецЕсли;
	
	Если НеМенятьНомераДок Тогда
		Документ.Номер							= НомерДокумента;		
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 Тогда
		//Если ВидДокумента="Выручка" Тогда
		//	Попытка
		//		Документ.СубконтоКт1 = СтатьяДДС;
		//		Документ.СтатьяДвиженияДенежныхСредств = СтатьяДДС;
		//	Исключение КонецПопытки;
		//КонецЕсли;
		
		//заполнение ТЧ документа
		НовСтр = Документ.РасшифровкаПлатежа.Добавить();
		//Если ВидОперации<>Перечисления.ВидыОперацийПКО.ВозвратОтПодотчетногоЛица И ВидОперации<>Перечисления.ВидыОперацийПКО.РозничнаяВыручка Тогда
		//	НовСтр.ДоговорКонтрагента				= Договор;
		//	НовСтр.СтатьяДвиженияДенежныхСредств	= СтатьяДДС;
		//	НовСтр.СпособПогашенияЗадолженности		= Перечисления.СпособыПогашенияЗадолженности.Автоматически;
		//КонецЕсли;
		////Трофимова 04.02.2019 +++
		//Если ВидОперации=Перечисления.ВидыОперацийПКО.РозничнаяВыручка Тогда 
		//	НовСтр.СтатьяДвиженияДенежныхСредств	= СтатьяДДС;	
		//КонецЕсли;
		//Трофимова 04.02.2019 --- 
		НовСтр.КурсВзаиморасчетов					= 1;
		НовСтр.СуммаПлатежа							= РКО.РасшифровкаПлатежа.Итог("СуммаПлатежа");
		НовСтр.КратностьВзаиморасчетов 				= 1;
		НовСтр.СуммаВзаиморасчетов					= НовСтр.СуммаПлатежа;
		НовСтр.СтавкаНДС							= ?(РКО.РасшифровкаПлатежа.Количество()=0, Перечисления.СтавкиНДС.БезНДС, РКО.РасшифровкаПлатежа[0].СтавкаНДС);
		НовСтр.СуммаНДС								= РКО.РасшифровкаПлатежа.Итог("СуммаНДС");
		
		//установка счетов учета и расчетов
		Документ.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("57.01");
		//Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(Договор) Тогда
		//	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, Договор);
		//	Если ВидОперации=Перечисления.ВидыОперацийПКО.ВозвратОтПоставщика Тогда
		//		НовСтр.СчетУчетаРасчетовСКонтрагентом	= СчетаУчета.СчетРасчетов;
		//		НовСтр.СчетУчетаРасчетовПоАвансам		= СчетаУчета.СчетАвансов;
		//	Иначе
		//		НовСтр.СчетУчетаРасчетовСКонтрагентом	= СчетаУчета.СчетРасчетовПокупателя;
		//		НовСтр.СчетУчетаРасчетовПоАвансам		= СчетаУчета.СчетАвансовПокупателя;
		//	КонецЕсли;
		//КонецЕсли;
		//Если НЕ ЗначениеЗаполнено(НовСтр.СчетУчетаРасчетовСКонтрагентом) Тогда
		//	НовСтр.СчетУчетаРасчетовСКонтрагентом = СчетРасчетов;
		//	Если ВидОперации = Перечисления.ВидыОперацийПКО.ПрочийПриход Тогда
		//		Документ.СчетУчетаРасчетовСКонтрагентом = СчетРасчетов;
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли;
	
	Документ.СуммаДокумента = Документ.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	////Трофимова 25.02.2019 +++
	//Документ.Графа5_УСН = ?(ДеятельностьНаТорговомСборе,Документ.СуммаДокумента,0);
	////Трофимова 25.02.2019 --- 
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен		 = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ПриходныйКассовыйОрдер") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат Истина;
КонецФункции //ЗагрузитьРасходныйКассовыйОрдер()

Функция ЗагрузитьОперация(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	// Проводки создаются только на втором проходе.
	Если НомерПрохода=1 Тогда
		// Пропускаем блок данных с проводками
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	// Читаем данные по операции
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,","); // Слово "Операция" не нужно
	ТипОперации			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяОперации			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаОперации		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяОперации			= ВосстПредстРеквизита(ИмяОперации);
	Организация 		= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	// Создаем операцию
	НайденаОперация = Ложь; ЭтоДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ."+НайтиСоответствиеДокумента(ТипОперации));
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Иначе
		ЭтоДокумент = Истина;
	КонецЕсли;	
	
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НайденаОперация = Истина;
	КонецЕсли;
	
	Если НЕ НайденаОперация ИЛИ ЭтоДокумент Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	КонецЕсли;
	
	Если НайденаОперация Тогда
		Попытка
			Операция = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяОперации+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Если ЭтоДокумент Тогда
			Если НЕ ЗамещатьПроводки Тогда
				Операция.Движения.Хозрасчетный.Прочитать();
			КонецЕсли;
		Иначе
			Операция.Движения.Хозрасчетный.Очистить();
			Операция.ПометкаУдаления	= Ложь;
			Операция.СпособЗаполнения	= "Вручную";
			Операция.СуммаОперации		= 0;
		КонецЕсли;
	Иначе
		// Создаем операцию
		Попытка
			Операция = Документы.ОперацияБух.СоздатьДокумент();
			Операция.СпособЗаполнения = "Вручную";
			Операция.СуммаОперации	  = 0;
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяОперации+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ЭтоДокумент Тогда
		Операция.РучнаяКорректировка = Истина;
	Иначе
		ПредидущаяДата = Операция.Дата;
		Операция.Дата			= Дата(ДатаОперации);
		Операция.Комментарий	= "Экспортирован " + СокрЛП(ТекущаяДата());
		Операция.Содержание		= ИмяОперации;
		Операция.Организация	= Организация;
		Операция.Ответственный	= ПараметрыСеанса.ТекущийПользователь;
		
		Если НЕ НайденаОперация И обЗначениеНеЗаполнено(Операция.Организация.Префикс) Тогда
			Операция.УстановитьНовыйНомер(Операция.Организация.Префикс);
		ИначеЕсли НайденаОперация И Год(Операция.Дата)<>Год(ПредидущаяДата) Тогда
			Операция.УстановитьНовыйНомер(?(обЗначениеНеЗаполнено(Операция.Организация.Префикс), "00", Операция.Организация.Префикс));
		КонецЕсли;
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);			
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ВидПроводки			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СчетДт				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СубконтоДт1			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипСубконтоДт1		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СубконтоДт2			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипСубконтоДт2		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СубконтоДт3			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипСубконтоДт3		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			КоличествоДт		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ВалютаДт			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаДт				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаДтНУ			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ПодразделениеДт		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СчетКт				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СубконтоКт1			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипСубконтоКт1		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СубконтоКт2			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипСубконтоКт2		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СубконтоКт3			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипСубконтоКт3		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			КоличествоКт		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ВалютаКт			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаКт				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаКтНУ			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ПодразделениеКт		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаПроводки		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаВИтог			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СодержаниеПроводки	= СокрЛП(ТекущаяСтрока);
			
			СуммаПроводки		= ?(СуммаПроводки="", 0, Число(СуммаПроводки));
			КоличествоДт		= ?(КоличествоДт="",  0, Число(КоличествоДт));
			КоличествоКт		= ?(КоличествоКт="",  0, Число(КоличествоКт));
			СуммаДт				= ?(СуммаДт="",		  0, Число(СуммаДт));
			СуммаКт				= ?(СуммаКт="",		  0, Число(СуммаКт));
			СуммаДтНУ			= ?(СуммаДтНУ="",	  0, Число(СуммаДтНУ));
			СуммаКтНУ			= ?(СуммаКтНУ="",	  0, Число(СуммаКтНУ));
			
			СчетДт				= ПланыСчетов.Хозрасчетный.НайтиПоКоду(ПреобразоватьСчет(СчетДт));
			СчетКт				= ПланыСчетов.Хозрасчетный.НайтиПоКоду(ПреобразоватьСчет(СчетКт));
			СодержаниеПроводки	= ВосстПредстРеквизита(СодержаниеПроводки);
			ПодразделениеДт		= НайтиОбъектПоGUID(ПодразделениеДт);
			ПодразделениеКт		= НайтиОбъектПоGUID(ПодразделениеКт);
			СуммаВИтог			= (СуммаВИтог="Истина");
			
			//создаем проводки
			НовСтр = Операция.Движения.Хозрасчетный.Добавить();
			НовСтр.Содержание	= СодержаниеПроводки;
			НовСтр.Период		= Операция.Дата;
			НовСтр.Организация	= Организация;
			
			Если ЭтоВерсияКорп Тогда
				Если СчетДт.УчетПоПодразделениям Тогда
					НовСтр.ПодразделениеДт = ПодразделениеДт;
				КонецЕсли;
				Если СчетКт.УчетПоПодразделениям Тогда
					НовСтр.ПодразделениеКт = ПодразделениеКт;
				КонецЕсли;
			КонецЕсли;
			
			НовСтр.СчетДт = СчетДт;
			Если СчетДт.ВидыСубконто.Количество()>0 Тогда
				СубконтоДт1 = ПолучитьЗначениеРеквизита(СубконтоДт1, ТипСубконтоДт1, 0, СчетДт);
				НовСтр.СубконтоДт.Вставить(СчетДт.ВидыСубконто[0].ВидСубконто, СубконтоДт1);
			КонецЕсли;
			Если СчетДт.ВидыСубконто.Количество()>1 Тогда
				СубконтоДт2 = ПолучитьЗначениеРеквизита(СубконтоДт2, ТипСубконтоДт2, 1, СчетДт);
				НовСтр.СубконтоДт.Вставить(СчетДт.ВидыСубконто[1].ВидСубконто, СубконтоДт2);
			КонецЕсли;
			Если СчетДт.ВидыСубконто.Количество()>2 Тогда
				СубконтоДт3 = ПолучитьЗначениеРеквизита(СубконтоДт3, ТипСубконтоДт3, 2, СчетДт);
				НовСтр.СубконтоДт.Вставить(СчетДт.ВидыСубконто[2].ВидСубконто, СубконтоДт3);
			КонецЕсли;
			Если СчетДт.Количественный Тогда
				НовСтр.КоличествоДт = КоличествоДт;
			КонецЕсли;
			Если СчетДт.Валютный Тогда
				НовСтр.ВалютаДт = НайтиОбъектПоGUID(ВалютаДт);
				НовСтр.ВалютнаяСуммаДт = СуммаДт;
			КонецЕсли;
			
			НовСтр.СчетКт = СчетКт;
			Если СчетКт.ВидыСубконто.Количество()>0 Тогда
				СубконтоКт1 = ПолучитьЗначениеРеквизита(СубконтоКт1, ТипСубконтоКт1, 0, СчетКт);
				НовСтр.СубконтоКт.Вставить(СчетКт.ВидыСубконто[0].ВидСубконто, СубконтоКт1);
			КонецЕсли;
			Если СчетКт.ВидыСубконто.Количество()>1 Тогда
				СубконтоКт2 = ПолучитьЗначениеРеквизита(СубконтоКт2, ТипСубконтоКт2, 1, СчетКт);
				НовСтр.СубконтоКт.Вставить(СчетКт.ВидыСубконто[1].ВидСубконто, СубконтоКт2);
			КонецЕсли;
			Если СчетКт.ВидыСубконто.Количество()>2 Тогда
				СубконтоКт3 = ПолучитьЗначениеРеквизита(СубконтоКт3, ТипСубконтоКт3, 2, СчетКт);
				НовСтр.СубконтоКт.Вставить(СчетКт.ВидыСубконто[2].ВидСубконто, СубконтоКт3);
			КонецЕсли;
			Если СчетКт.Количественный Тогда
				НовСтр.КоличествоКт = КоличествоКт;
			КонецЕсли;
			Если СчетКт.Валютный Тогда
				НовСтр.ВалютаКт = НайтиОбъектПоGUID(ВалютаКт);
				НовСтр.ВалютнаяСуммаКт = СуммаКт;
			КонецЕсли;
			
			Если ВидПроводки="БУ" ИЛИ ВидПроводки="БУ_НУ" Тогда
				НовСтр.Сумма = СуммаПроводки;
			КонецЕсли;
			
			Если ВидПроводки="НУ" Тогда
				Если СчетДт.НалоговыйУчет Тогда
					НовСтр.СуммаНУДт = ?(ЗначениеЗаполнено(СуммаДтНУ),СуммаДтНУ,СуммаПроводки);
				КонецЕсли;
				Если СчетКт.НалоговыйУчет Тогда
					НовСтр.СуммаНУКт = ?(ЗначениеЗаполнено(СуммаКтНУ),СуммаКтНУ,СуммаПроводки);
				КонецЕсли;
			КонецЕсли;

			Если ВидПроводки="БУ_НУ" Тогда
				Попытка
					СкорректироватьНалоговыеСуммы(Операция, НовСтр);
				Исключение
					ТекстСообщения = "Не удалось скорректировать налоговые суммы в проводке """ + СодержаниеПроводки + """" + Символы.ПС + "Документ источник: " + ИмяОперации + Символы.ПС + "по причине:" + Символы.ПС + ОписаниеОшибки();
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Лог.ДобавитьСтроку(ТекстСообщения);
			    КонецПопытки;
				
				Если СчетДт.НалоговыйУчет И ЗначениеЗаполнено(СуммаДтНУ) Тогда
					НовСтр.СуммаНУДт = СуммаДтНУ;
				КонецЕсли;
				Если СчетКт.НалоговыйУчет И ЗначениеЗаполнено(СуммаКтНУ) Тогда
					НовСтр.СуммаНУКт = СуммаКтНУ;
				КонецЕсли;
			КонецЕсли;
			
			Если СуммаВИтог И НЕ ЭтоДокумент Тогда
				Операция.СуммаОперации = Операция.СуммаОперации + СуммаПроводки;
			КонецЕсли;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Операция);
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем операцию
	НачатьТранзакцию();
	Попытка
		Операция.Движения.Хозрасчетный.Записывать = Истина;
		Если НайденаОперация Тогда
			Операция.Движения.Хозрасчетный.Записать();
		КонецЕсли;
		
		Если Число(ТекущийСтатус)=0 ИЛИ Число(ТекущийСтатус)=1 Тогда
			Операция.ПометкаУдаления = Истина;
			Операция.Записать();
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Операция.ПометкаУдаления = Ложь;
			Если ЭтоДокумент И ЗамещатьПроводки И НЕ Операция.Проведен Тогда
				Попытка
					Операция.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ТекстСообщения = "Не удалось провести документ "+Операция+Символы.ПС+"Документ источник: "+ИмяОперации+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Лог.ДобавитьСтроку(ТекстСообщения);
					ОтменитьТранзакцию();
					// ну хоть записать попробуем...
					НачатьТранзакцию();
					Операция.ПометкаУдаления = Ложь;
					Операция.Записать();
				КонецПопытки;
			Иначе
				Операция.Записать();
			КонецЕсли;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Операция+Символы.ПС+"Документ источник: "+ИмяОперации+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденаОперация Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Операция.Ссылка, GUID, "Документ.ОперацияБух") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

	Возврат Истина;
КонецФункции //ЗагрузитьОперация()

Функция ЗагрузитьПоступлениеТоваров(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
			
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Договор				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Склад				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерВх				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаВх				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	Договор				= НайтиОбъектПоGUID(Договор);
	Склад				= НайтиОбъектПоGUID(Склад);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	НомерВх				= ?(ЗначениеЗаполнено(НомерВх), ВосстПредстРеквизита(НомерВх), "Без номера");
	ДатаВх				= ?(ЗначениеЗаполнено(Дата(ДатаВх)), Дата(ДатаВх), ДатаДокумента);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ПоступлениеТоваровУслуг");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, Договор);
	УСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, ДатаДокумента);
	ОргБезНДС = УчетнаяПолитика.ПлательщикНДС(Организация, ДатаДокумента);
	УчетПоРозЦенам = (УчетнаяПолитика.СпособОценкиТоваровВРознице(Организация, ДатаДокумента)=Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости);
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.Товары.Очистить();
		Документ.ВозвратнаяТара.Очистить();
		Документ.Услуги.Очистить();
		Документ.Оборудование.Очистить();
		Документ.ОбъектыСтроительства.Очистить();
		Документ.ЗачетАвансов.Очистить();
		Документ.АгентскиеУслуги.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация="ПоступлениеТоваров" Тогда
		ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
		ЭтоКомиссия = Ложь;
	ИначеЕсли ХозОперация="ПоступлениеТоваровКомиссия" ИЛИ ХозОперация="ПоступлениеТоваровУпрощеннаяКомиссия" Тогда
		ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия;
		ЭтоКомиссия = Истина;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента;
	Документ.ВидОперации					= ВидОперации;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.Контрагент						= Контрагент;
	Документ.ДоговорКонтрагента				= ПроверкаДоговора(Договор, Документ);
	Документ.Склад							= Склад;
	Документ.ВалютаДокумента				= Константы.ВалютаРегламентированногоУчета.Получить();
	Документ.КурсВзаиморасчетов				= 1;
	Документ.КратностьВзаиморасчетов		= 1;
	Документ.СпособЗачетаАвансов			= Перечисления.СпособыЗачетаАвансов.Автоматически;
	Документ.СуммаВключаетНДС				= Истина;
	Документ.НДСВключенВСтоимость			= УСН;
	Документ.НДСНеВыделять					= Ложь;
	Документ.НомерВходящегоДокумента		= НомерВх;
	Документ.ДатаВходящегоДокумента			= ДатаВх;
	Документ.РучнаяКорректировка			= Ложь;
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;	
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
	
	Документы.ПоступлениеТоваровУслуг.ЗаполнитьСчетаУчетаРасчетов(Документ);
	
	тзРознЦен = Новый ТаблицаЗначений; тзРознЦен.Колонки.Добавить("Номенклатура"); тзРознЦен.Колонки.Добавить("Цена");
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			НомерГТД		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			КодСтраны		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДС		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДСИмя	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма	 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаРозн 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество			= СокрЛП(ТекущаяСтрока);
			
			СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			СуммаРозн			= ?(СуммаРозн="", 0, Число(СуммаРозн));
			Количество			= ?(Количество="", 0, Число(Количество));
			СтавкаНДС			= ПолучитьЗначениеРеквизита(СтавкаНДС, СтавкаНДСИмя);
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			НомерГТД			= ВосстПредстРеквизита(НомерГТД);
			
			Если ЭтоКомиссия И НЕ Номенклатура.Услуга И НЕ ЗагрузкаНоменклатуры Тогда
				Номенклатура	= Справочники.Номенклатура.НайтиПоКоду("Т00000006");
			КонецЕсли;
			
			//заполнение ТЧ документа
			Если Найти(Номенклатура,"Тара")>0 Тогда
				НовСтр = Документ.ВозвратнаяТара.Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.Количество			= Количество;
				НовСтр.Сумма				= Сумма;
				
			Иначе
				НовСтр = Документ[?(Номенклатура.Услуга, "Услуги", "Товары")].Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.Количество			= Количество;
				НовСтр.СтавкаНДС			= СтавкаНДС;
				НовСтр.СуммаНДС				= СуммаНДС;
				НовСтр.Сумма				= Сумма;
				НовСтр.ОтражениеВУСН		= ?(УСН, Перечисления.ОтражениеВУСН.Принимаются, Перечисления.ОтражениеВУСН.НеПринимаются);
				
				Если НЕ Номенклатура.Услуга И УчетПоРозЦенам И Склад.ТипСклада=Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
					НовСтр.СуммаВРознице	= СуммаРозн;
				КонецЕсли;
				
				//НикифоровАО 03.08.2024 +++ Задача: обновление ИБ
				//Документы.ПоступлениеТоваровУслуг.ЗаполнитьОтражениеВУСНВСтрокеТабличнойЧасти(Документ, НовСтр);
				ЗаполнитьОтражениеВУСНВСтрокеТабличнойЧасти(Документ, НовСтр);
				//НикифоровАО 03.08.2024 ---
				
				// Установка номера ГТД
				Если НомерГТД<>"" И НЕ Номенклатура.Услуга Тогда
					СпрСтрана = Справочники.СтраныМира.НайтиПоКоду(КодСтраны);
					СпрГТД = Справочники.НомераГТД.НайтиПоКоду(НомерГТД);
					Если ЗначениеЗаполнено(СпрГТД) Тогда
						НовСтр.НомерГТД = СпрГТД;
						НовСтр.СтранаПроисхождения = СпрСтрана;
					Иначе
						Попытка
							НовыйГТД = Справочники.НомераГТД.СоздатьЭлемент();
							НовыйГТД.Код = НомерГТД;
							НовыйГТД.Записать();
							НовСтр.НомерГТД = НовыйГТД.Ссылка;
							НовСтр.СтранаПроисхождения = СпрСтрана;
						Исключение
							ТекстСообщения = "Не удалось записать номер ГТД (" + НомерГТД + ")";							
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
							Лог.ДобавитьСтроку(ТекстСообщения);
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если УчетПоРозЦенам И СуммаРозн<>0 Тогда
				НоваяСтрокаЦен = тзРознЦен.Добавить();
				НоваяСтрокаЦен.Номенклатура = Номенклатура;
				НоваяСтрокаЦен.Цена			= СуммаРозн / ?(Количество=0, 1, Количество);
			КонецЕсли;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
		
		Документы.ПоступлениеТоваровУслуг.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "ВозвратнаяТара");
		Документы.ПоступлениеТоваровУслуг.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Услуги");
		Документы.ПоступлениеТоваровУслуг.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Товары");
		
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "Товары,Услуги,ВозвратнаяТара");
		Возврат Истина;
	КонецЕсли;
	
	Если УчетПоРозЦенам И Склад.ТипСклада=Перечисления.ТипыСкладов.РозничныйМагазин И ЗагрузкаНоменклатуры Тогда
		СформироватьДокументУстановкиРозничныхЦен(Документ, тзРознЦен, GUID, ТекущийСтатус);
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ПоступлениеТоваровУслуг") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.ПоступлениеТоваров");
	
	Возврат Истина;	
КонецФункции //ЗагрузитьПоступлениеТоваров()

Функция ЗагрузитьАктКорректировкиПоставки(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
			
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Договор				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Склад				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Основание			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерВх				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаВх				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	Договор				= НайтиОбъектПоGUID(Договор);
	Склад				= НайтиОбъектПоGUID(Склад);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	Основание			= НайтиОбъектПоGUID(Основание, "Документ.ПоступлениеТоваровУслуг");
	НомерВх				= ?(ЗначениеЗаполнено(НомерВх), ВосстПредстРеквизита(НомерВх), "Без номера");
	ДатаВх				= ?(ЗначениеЗаполнено(Дата(ДатаВх)), Дата(ДатаВх), ДатаДокумента);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) ИЛИ обЗначениеНеЗаполнено(Основание) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.КорректировкаПоступления");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, Договор);
	УСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, ДатаДокумента);
	ОргБезНДС = УчетнаяПолитика.ПлательщикНДС(Организация, ДатаДокумента);
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.Товары.Очистить();
		Документ.Услуги.Очистить();
		Документ.АгентскиеУслуги.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.КорректировкаПоступления.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация="АктКорректировкиПоставки" Тогда
		ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
		ЭтоКомиссия = Ложь;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата								= ДатаДокумента;
	Документ.ВидОперации						= ВидОперации;
	Документ.Комментарий						= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный						= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация						= Организация;
	Документ.Контрагент							= Контрагент;
	Документ.ДоговорКонтрагента					= ПроверкаДоговора(Договор, Документ);
	Документ.Склад								= Склад;
	Документ.ВалютаДокумента					= Константы.ВалютаРегламентированногоУчета.Получить();
	Документ.ПризнаватьЗачитыватьАванс			= Истина;
	Документ.СуммаВключаетНДС					= Истина;
	Документ.НДСВключенВСтоимость				= УСН;
	Документ.ВосстановитьНДС					= Истина;
	Документ.НомерВходящегоДокумента			= НомерВх;
	Документ.ДатаВходящегоДокумента				= ДатаВх;
	Документ.РучнаяКорректировка				= Ложь;
	Документ.ДокументПоступления				= Основание;
	Документ.ИсправляемыйДокументПоступления	= Основание;
	Документ.КорректироватьБУиНУ				= Истина;
	Документ.КорректироватьНДС					= Истина;
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации		= Подразделение;
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер							= НомерДокумента;
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			НомерГТД		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			КодСтраны		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДС		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДСИмя	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма	 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаРозн 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество			= СокрЛП(ТекущаяСтрока);
			
			СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			СуммаРозн			= ?(СуммаРозн="", 0, Число(СуммаРозн));
			Количество			= ?(Количество="", 0, Число(Количество));
			СтавкаНДС			= ПолучитьЗначениеРеквизита(СтавкаНДС, СтавкаНДСИмя);
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			НомерГТД			= ВосстПредстРеквизита(НомерГТД);
			
			Если ЭтоКомиссия И НЕ Номенклатура.Услуга И НЕ ЗагрузкаНоменклатуры Тогда
				Номенклатура	= Справочники.Номенклатура.НайтиПоКоду("Т00000006");
			КонецЕсли;
			
			//заполнение ТЧ документа
			НовСтр = Документ[?(Номенклатура.Услуга, "Услуги", "Товары")].Добавить();
			НовСтр.Номенклатура				= Номенклатура;
			//НовСтр.Количество				= Количество;
			НовСтр.СтавкаНДС				= СтавкаНДС;
			НовСтр.ОтражениеВУСН			= ?(УСН, Перечисления.ОтражениеВУСН.Принимаются, Перечисления.ОтражениеВУСН.НеПринимаются);
			
			Если Сумма>0 Тогда
				НовСтр.Сумма				= Сумма;
				НовСтр.СуммаНДС				= СуммаНДС;
				НовСтр.Количество			= Количество;
			Иначе
				НовСтр.СуммаДоИзменения		= -Сумма;
				НовСтр.СуммаНДСДоИзменения	= -СуммаНДС;
				НовСтр.КоличествоДоИзменения= -Количество;
			КонецЕсли;
			
			//при УСН, не допускается корректировка в ноль, т.е. Количество=0
			Если УСН Тогда
				НовСтр.Количество			= 1;
				НовСтр.КоличествоДоИзменения= 1;
			КонецЕсли;
			
			ПараметрыОбъекта = Новый Структура("Организация, Дата, Ссылка, ТипЦен, СуммаВключаетНДС, ВалютаДокумента, Склад, ВидОперации, ДоговорКонтрагента, РассчитыватьСуммаВРознице");
			ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Документ);
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
		
		Документы.КорректировкаПоступления.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Услуги");
		Документы.КорректировкаПоступления.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Товары");
		
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "Товары,Услуги");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.КорректировкаПоступления") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.АктКорректировкиПоставки");
	
	Возврат Истина;	
КонецФункции //ЗагрузитьАктКорректировкиПоставки()

Функция ЗагрузитьРеализацияТоваров(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
			
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Договор				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Склад				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	Договор				= НайтиОбъектПоGUID(Договор);
	Склад				= НайтиОбъектПоGUID(Склад);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.РеализацияТоваровУслуг");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, Договор);
	УСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, ДатаДокумента);
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.Товары.Очистить();
		Документ.ВозвратнаяТара.Очистить();
		Документ.Услуги.Очистить();
		Документ.АгентскиеУслуги.Очистить();
		Документ.ЗачетАвансов.Очистить();
		Документ.ПометкаУдаления = Ложь;
		
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация="РеализацияТоваров" ИЛИ ХозОперация="РеализацияТоваровРозница" ИЛИ ХозОперация="ВозвратПоставщикуОтгрузкой" Тогда
		ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
		ЭтоКомиссия = Ложь;
	ИначеЕсли ХозОперация="РеализацияТоваровКомиссия" Тогда
		ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
		ЭтоКомиссия = Истина;
	ИначеЕсли ХозОперация="АктОбОказанииУслуг" Тогда
		ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.Услуги;
		ЭтоКомиссия = Ложь;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента;
	Документ.ВидОперации					= ВидОперации;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.Контрагент						= Контрагент;
	Документ.ДоговорКонтрагента				= ПроверкаДоговора(Договор, Документ);
	Документ.Склад							= Склад;
	Документ.ВалютаДокумента				= Константы.ВалютаРегламентированногоУчета.Получить();
	Документ.КурсВзаиморасчетов				= 1;
	Документ.КратностьВзаиморасчетов		= 1;
	Документ.СпособЗачетаАвансов			= Перечисления.СпособыЗачетаАвансов.Автоматически;
	Документ.СуммаВключаетНДС				= Истина;
	Документ.ДокументБезНДС					= Ложь;
	//Документ.СтатьяДоходовИРасходовПоТаре	= Справочники.ПрочиеДоходыИРасходы.РазницыЗалоговойИФактическойСтоимостиТары;
	Документ.РучнаяКорректировка			= Ложь;
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;	
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
	
	Документы.РеализацияТоваровУслуг.ЗаполнитьСчетаУчетаРасчетов(Документ);
		
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтатусПартии	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Партия				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			НомерГТД		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			КодСтраны		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДС		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДСИмя	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма	 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Себестоимость		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДССеб			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество 			= СокрЛП(ТекущаяСтрока);
			
			СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			Себестоимость		= ?(Себестоимость="", 0, Число(Себестоимость));
			СуммаНДССеб			= ?(СуммаНДССеб="", 0, Число(СуммаНДССеб));
			Количество			= ?(Количество="", 0, Число(Количество));
			СтавкаНДС			= ПолучитьЗначениеРеквизита(СтавкаНДС, СтавкаНДСИмя);
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			НомерГТД			= ВосстПредстРеквизита(НомерГТД);
			ДокОприходования	= Неопределено;
			
			Если СтатусПартии="Принятый" Тогда
				Если НЕ ЗагрузкаНоменклатуры Тогда
					Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Т00000006");
				КонецЕсли;
				
				ДокОприходования		= НайтиОбъектПоGUID(Партия, "Документ.ПоступлениеТоваровУслуг");
				Если обЗначениеНеЗаполнено(ДокОприходования) Тогда
					ДокОприходования	= ПолучитьДокументПартии(Партия, Документ, Контрагент, Договор);
				КонецЕсли;
			КонецЕсли;
			
			//заполнение ТЧ документа
			Если Найти(Номенклатура, "Тара")>0 Тогда
				НовСтр = Документ.ВозвратнаяТара.Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.Количество			= Количество;
				НовСтр.Сумма				= Сумма;
				
			Иначе
				НовСтр = Документ[?(Номенклатура.Услуга, "Услуги", "Товары")].Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.Количество			= Количество;
				НовСтр.СтавкаНДС			= СтавкаНДС;
				НовСтр.СуммаНДС				= СуммаНДС;
				НовСтр.Сумма				= Сумма;
				Если НЕ Номенклатура.Услуга Тогда
					НовСтр.Себестоимость	= ?(НеЗагружатьСебестоимость, 0, Себестоимость - ?(УСН, 0, СуммаНДССеб));
					
					Если НЕ обЗначениеНеЗаполнено(ДокОприходования) Тогда
						НовСтр.ДокументОприходования = ДокОприходования;
					КонецЕсли;
				КонецЕсли;
				
				Если ТипЗнч(НовСтр.Субконто)=Тип("СправочникСсылка.НоменклатурныеГруппы") И ЗначениеЗаполнено(Номенклатура.НоменклатурнаяГруппа) Тогда
					НовСтр.Субконто	= Номенклатура.НоменклатурнаяГруппа;
				КонецЕсли;
				
				// Установка номера ГТД
				Если НомерГТД<>"" И НЕ Номенклатура.Услуга Тогда
					СпрСтрана = Справочники.СтраныМира.НайтиПоКоду(КодСтраны);
					СпрГТД = Справочники.НомераГТД.НайтиПоКоду(НомерГТД);
					Если ЗначениеЗаполнено(СпрГТД) Тогда
						НовСтр.НомерГТД = СпрГТД;
						НовСтр.СтранаПроисхождения = СпрСтрана;
					Иначе
						Попытка
							НовыйГТД = Справочники.НомераГТД.СоздатьЭлемент();
							НовыйГТД.Код = НомерГТД;
							НовыйГТД.Записать();
							НовСтр.НомерГТД = НовыйГТД.Ссылка;
							НовСтр.СтранаПроисхождения = СпрСтрана;
						Исключение
							ТекстСообщения = "Не удалось записать номер ГТД ("+НомерГТД+")";
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
							Лог.ДобавитьСтроку(ТекстСообщения);
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
		
		Документы.РеализацияТоваровУслуг.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "ВозвратнаяТара");
		Документы.РеализацияТоваровУслуг.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Услуги");
		Документы.РеализацияТоваровУслуг.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Товары");
		
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "Товары,Услуги,ВозвратнаяТара");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.РеализацияТоваровУслуг") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.РеализацияТоваров");
	
	Возврат Истина;	
КонецФункции //ЗагрузитьРеализацияТоваров()

Функция ЗагрузитьАктКорректировкиОтгрузки(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
			
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Договор				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Склад				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Основание			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	Договор				= НайтиОбъектПоGUID(Договор);
	Склад				= НайтиОбъектПоGUID(Склад);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	Основание			= НайтиОбъектПоGUID(Основание, "Документ.РеализацияТоваровУслуг");
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) ИЛИ обЗначениеНеЗаполнено(Основание) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.КорректировкаРеализации");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, Договор);
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.Товары.Очистить();
		Документ.Услуги.Очистить();
		Документ.АгентскиеУслуги.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.КорректировкаРеализации.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация="АктКорректировкиОтгрузки" Тогда
		ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
		ЭтоКомиссия = Ложь;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента;
	Документ.ВидОперации					= ВидОперации;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.Контрагент						= Контрагент;
	Документ.ДоговорКонтрагента				= ПроверкаДоговора(Договор, Документ);
	Документ.Склад							= Склад;
	Документ.ВалютаДокумента				= Константы.ВалютаРегламентированногоУчета.Получить();
	Документ.ПризнаватьЗачитыватьАванс		= Истина;
	Документ.СуммаВключаетНДС				= Истина;
	//Документ.СтатьяДоходовИРасходовПоТаре	= Справочники.ПрочиеДоходыИРасходы.РазницыЗалоговойИФактическойСтоимостиТары;
	Документ.РучнаяКорректировка			= Ложь;
	Документ.КорректироватьБУиНУ			= Истина;
	Документ.КорректироватьНДС				= Истина;
	Документ.ДокументРеализации				= Основание;
	Документ.ИсправляемыйДокументРеализации	= Основание;
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;	
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
	
	Документы.КорректировкаРеализации.УстановитьСчетаУчетаРасчетов(Документ, Основание);
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтатусПартии	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			НомерГТД		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			КодСтраны		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДС		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДСИмя	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма	 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Себестоимость		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДССеб			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество 			= СокрЛП(ТекущаяСтрока);
			
			СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			Себестоимость		= ?(Себестоимость="", 0, Число(Себестоимость));
			СуммаНДССеб			= ?(СуммаНДССеб="", 0, Число(СуммаНДССеб));
			Количество			= ?(Количество="", 0, Число(Количество));
			СтавкаНДС			= ПолучитьЗначениеРеквизита(СтавкаНДС, СтавкаНДСИмя);
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			НомерГТД			= ВосстПредстРеквизита(НомерГТД);
			
			Если СтатусПартии="Принятый" И НЕ ЗагрузкаНоменклатуры Тогда
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Т00000006");
			КонецЕсли;
			
			//заполнение ТЧ документа
			НовСтр = Документ[?(Номенклатура.Услуга, "Услуги", "Товары")].Добавить();
			НовСтр.Номенклатура		= Номенклатура;
			//НовСтр.Количество		= Количество;
			НовСтр.СтавкаНДС		= СтавкаНДС;
			
			Если Сумма>0 Тогда
				НовСтр.Сумма				= Сумма;
				НовСтр.СуммаНДС				= СуммаНДС;
			Иначе
				НовСтр.СуммаДоИзменения		= -Сумма;
				НовСтр.СуммаНДСДоИзменения	= -СуммаНДС;
			КонецЕсли;
			
			Если ТипЗнч(НовСтр.Субконто)=Тип("СправочникСсылка.НоменклатурныеГруппы") И ЗначениеЗаполнено(Номенклатура.НоменклатурнаяГруппа) Тогда
				НовСтр.Субконто	= Номенклатура.НоменклатурнаяГруппа;
			КонецЕсли;
			
			// Установка номера ГТД
			//Если НомерГТД<>"" И НЕ Номенклатура.Услуга Тогда
			//	СпрСтрана = Справочники.СтраныМира.НайтиПоКоду(КодСтраны);
			//	СпрГТД = Справочники.НомераГТД.НайтиПоКоду(НомерГТД);
			//	Если ЗначениеЗаполнено(СпрГТД) Тогда
			//		НовСтр.НомерГТД = СпрГТД;
			//		НовСтр.СтранаПроисхождения = СпрСтрана;
			//	Иначе
			//		Попытка
			//			НовыйГТД = Справочники.НомераГТД.СоздатьЭлемент();
			//			НовыйГТД.Код = НомерГТД;
			//			НовыйГТД.Записать();
			//			НовСтр.НомерГТД = НовыйГТД.Ссылка;
			//			НовСтр.СтранаПроисхождения = СпрСтрана;
			//		Исключение
			//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать номер ГТД ("+НомерГТД+")");
			//		КонецПопытки;
			//	КонецЕсли;
			//КонецЕсли;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
		
		Документы.КорректировкаРеализации.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Услуги");
		Документы.КорректировкаРеализации.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Товары");
		
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "Товары,Услуги");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.КорректировкаРеализации") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.АктКорректировкиОтгрузки");
	
	Возврат Истина;	
КонецФункции //ЗагрузитьАктКорректировкиОтгрузки()

Функция ЗагрузитьОприходованиеИзлишков(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Склад				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Статья				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Склад				= НайтиОбъектПоGUID(Склад);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОприходованиеТоваров");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	УСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, ДатаДокумента);
	УчетПоРозЦенам = (УчетнаяПолитика.СпособОценкиТоваровВРознице(Организация, ДатаДокумента)=Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости);
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.Товары.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.ОприходованиеТоваров.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация="ЗакрытиеСмены" Тогда
		ДатаДокумента = ДатаДокумента - 1; //что-б до Закрытия смены было
		ПредопределеннаяСтатья = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПрочиеДоходыИРасходы.ОприходованиеИзлишков");
		СтатьяДиР = ?(ЗначениеЗаполнено(ПредопределеннаяСтатья), ПредопределеннаяСтатья, СтатьяДиР);
		
	ИначеЕсли ХозОперация="ПересортицаТоваров" ИЛИ ХозОперация="ПеретариваниеТоваров" ИЛИ ХозОперация="ПонижениеСортности" Тогда
		//СтатьяДиР = ?(ЗначениеЗаполнено(СтатьяДиР), СтатьяДиР, ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПрочиеДоходыИРасходы.ОприходованиеИзлишков"));
		СтатьяДиР = Справочники.ПрочиеДоходыИРасходы.НайтиПоРеквизиту("ЕРПМастерКлюч", "00-000065");
		
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента - 1; //что-б до Закрытия смены было
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.Склад							= Склад;
	Документ.СтатьяПрочихДоходовРасходов	= СтатьяДиР;//ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПрочиеДоходыИРасходы.ОприходованиеИзлишков");
	Документ.РучнаяКорректировка			= ?(ЗамещатьПроводки, Истина, Ложь); //здесь проводки не нужны, если в ЗС замещаем...
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;	
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаРозничная		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество 			= СокрЛП(ТекущаяСтрока);
			
			СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			СуммаРозничная		= ?(СуммаРозничная="", 0, Число(СуммаРозничная));
			Количество			= ?(Количество="", 0, Число(Количество));
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			
			//заполнение ТЧ документа
			НовСтр = Документ.Товары.Добавить();
			НовСтр.Номенклатура			= Номенклатура;
			НовСтр.Количество			= Количество;
			НовСтр.Сумма				= Сумма;
			НовСтр.Цена					= Сумма / ?(Количество=0, 1, Количество);
			НовСтр.ОтражениеВУСН		= ?(УСН, Перечисления.ОтражениеВУСН.Принимаются, Перечисления.ОтражениеВУСН.НеПринимаются);
			
			Если УчетПоРозЦенам И Склад.ТипСклада=Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
				НовСтр.СуммаВРознице	= СуммаРозничная;
			КонецЕсли;
				
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
		
		Документы.ОприходованиеТоваров.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Товары");
		
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	// не будем создавать новый документ пустым
	Если НЕ НайденДокумент И Документ.Товары.Количество()=0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если ЗамещатьПроводки И НайденДокумент Тогда
			//здесь проводки не нужны, если в ЗС замещаем, поэтому запишем пустой набор, что-б очистить все проводки
			Документ.Движения.Хозрасчетный.Записать();
		КонецЕсли;
		
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ОприходованиеТоваров") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;	
КонецФункции //ЗагрузитьОприходованиеИзлишков()

Функция ЗагрузитьЗакрытиеСмены(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	//Трофимова 04.02.2019 +++
	//будем только по безналичной оплате вводить ОперацияПоПлатежнойКарте из ЗакрытияСмены
	//Трофимова 04.02.2019 --- 
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
			
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Договор				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Склад				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КонтрагентБН		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДоговорБН			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СуммаБезнал			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СуммаНДСБезнал		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СтатьяДДС			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СчетКассы			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	Договор				= НайтиОбъектПоGUID(Договор);
	Склад				= НайтиОбъектПоGUID(Склад);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	КонтрагентБН		= НайтиОбъектПоGUID(КонтрагентБН);
	ДоговорБН			= НайтиОбъектПоGUID(ДоговорБН);
	СуммаБезнал			= ?(СуммаБезнал="", 0, Число(СуммаБезнал));
	СуммаНДСБезнал		= ?(СуммаНДСБезнал="", 0, Число(СуммаНДСБезнал));
	//СчетКассы			= ПланыСчетов.Хозрасчетный.НайтиПоКоду(ПреобразоватьСчет(СчетКассы));
	//Трофимова 04.02.2019 +++
	СчетКассы			= ПланыСчетов.Хозрасчетный.НайтиПоКоду("57.03");
	//Трофимова 04.02.2019 --- 
	СтатьяДДС			= НайтиОбъектПоGUID(СтатьяДДС);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Трофимова 04.02.2019 +++
	//Если СуммаБезнал = 0 Тогда
	//	НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	//	Возврат Истина;
	//КонецЕсли;
	//Трофимова 04.02.2019 --- 
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	//РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОтчетОРозничныхПродажах");
	//Трофимова 04.02.2019 +++
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОплатаПлатежнойКартой");
	//Трофимова 04.02.2019 --- 
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	УСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, ДатаДокумента);
	//ЕстьСтатьиДДС = ОбщегоНазначенияБПВызовСервера.ОпределитьПараметрыУчета().ВестиУчетПоСтатьямДДС;
	ЕстьСтатьиДДС = ОбщегоНазначенияБП.ОпределитьПараметрыУчета().ВестиУчетПоСтатьямДДС;
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		//Документ.Товары.Очистить();
		//Документ.Оплата.Очистить();
		//Документ.АгентскиеУслуги.Очистить();
		//Трофимова 04.02.2019 +++
		Документ.РасшифровкаПлатежа.Очистить();
		//Трофимова 04.02.2019 --- 
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			//Документ = Документы.ОтчетОРозничныхПродажах.СоздатьДокумент();
			//Трофимова 04.02.2019 +++
			Документ = Документы.ОплатаПлатежнойКартой.СоздатьДокумент();
			//Трофимова 04.02.2019 --- 
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация="ЗакрытиеСмены" Тогда
		//ВидОперации = Перечисления.ВидыОперацийОтчетОРозничныхПродажах.ОтчетККМОПродажах;
		//Трофимова 04.02.2019 +++
		ВидОперации = Перечисления.ВидыОперацийОплатаПлатежнойКартой.РозничнаяВыручка;
		//Трофимова 04.02.2019 --- 
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента;
	Документ.ВидОперации					= ВидОперации;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	//Документ.Склад							= Склад;
	Документ.Контрагент						= Склад;
	Документ.ВалютаДокумента				= Константы.ВалютаРегламентированногоУчета.Получить();
	//Документ.КурсДокумента					= 1;
	//Документ.КратностьДокумента				= 1;
	Документ.СчетКасса						= ?(обЗначениеНеЗаполнено(СчетКассы), ПланыСчетов.Хозрасчетный.ОперационнаяКасса, СчетКассы); //ПланыСчетов.Хозрасчетный.ОперационнаяКасса,КассаОрганизации
	//Документ.СтатьяДвиженияДенежныхСредств	= ?(ЕстьСтатьиДДС, СтатьяДДС, Неопределено);
	//Документ.СуммаВключаетНДС				= Истина;
	//Документ.ДокументБезНДС					= Ложь;
	//Трофимова 04.02.2019 +++
	//Документ.СтавкаНДС						= Перечисления.СтавкиНДС.БезНДС;
	//Трофимова 04.02.2019 --- 
	Документ.РучнаяКорректировка			= Ложь;
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;	
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
	//Трофимова 25.02.2019 +++
	Документ.ДеятельностьНаТорговомСборе	= УчетнаяПолитика.ПлательщикТорговогоСбора(Организация,ДатаДокумента);
	//Трофимова 25.02.2019 --- 
	
	// оформим безналичные продажи
	Если СуммаБезнал<>0 Тогда
		ВидОплаты = Неопределено;
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.ВидыОплатОрганизаций ГДЕ Организация=&Организация И Контрагент=&Контрагент И ДоговорКонтрагента=&Договор И ТипОплаты=ЗНАЧЕНИЕ(Перечисление.ТипыОплат.ПлатежнаяКарта)");
		Запрос.УстановитьПараметр("Организация", Организация);
		//Запрос.УстановитьПараметр("Контрагент",	 КонтрагентБН);
		//Запрос.УстановитьПараметр("Договор",	 ДоговорБН);
		//Трофимова 28.10.2019 +++
		Если ЗначениеЗаполнено(КонтрагентБезНал) Тогда
			КонтрагентБН 		= КонтрагентБезНал;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДоговорБезНал) Тогда 
			ДоговорБН			= ДоговорБезНал;
		КонецЕсли;
		//Трофимова 28.10.2019 ---
		//Трофимова 04.02.2019 +++
		Запрос.УстановитьПараметр("Контрагент",	 ?(КонтрагентБН=Неопределено,Справочники.Контрагенты.ПустаяСсылка(),КонтрагентБН));
		Запрос.УстановитьПараметр("Договор",	 ?(ДоговорБН=Неопределено,Справочники.ДоговорыКонтрагентов.ПустаяСсылка(),ДоговорБН));
		//Трофимова 04.02.2019 --- 
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ВидОплаты = Выборка.Ссылка;
		Иначе
			//создадим элемент Вида оплаты, в случае его отсутствия
			НовыйВидОплаты = Справочники.ВидыОплатОрганизаций.СоздатьЭлемент();
			НовыйВидОплаты.ТипОплаты			= Перечисления.ТипыОплат.ПлатежнаяКарта;
			НовыйВидОплаты.Организация			= Организация;
			НовыйВидОплаты.Контрагент			= КонтрагентБН;
			НовыйВидОплаты.ДоговорКонтрагента	= ДоговорБН;
			НовыйВидОплаты.СчетУчетаРасчетов	= ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам;
			НовыйВидОплаты.Наименование			= "Безналичная оплата";
			Попытка
				НовыйВидОплаты.Записать();
				ВидОплаты = НовыйВидОплаты.Ссылка;
			Исключение
				ТекстСообщения = "Не удалось записать Вид оплаты организации!";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
			КонецПопытки;
		КонецЕсли;
		Документ.ВидОплаты = ВидОплаты;
		Документ.Эквайер = КонтрагентБН;
		Документ.ДоговорЭквайринга = ДоговорБН;
		Документ.СуммаДокумента = СуммаБезнал;
		
		//Если ЗначениеЗаполнено(ВидОплаты) Тогда
		//	//НовСтр = Документ.Оплата.Добавить();
		//	//НовСтр.ВидОплаты			= ВидОплаты;
		//	//НовСтр.СуммаОплаты			= СуммаБезнал;
		//	//Трофимова 04.02.2019 +++
		//	Если Документ.РасшифровкаПлатежа.Количество()>0 Тогда 
		//		НовСтр = Документ.РасшифровкаПлатежа[0];
		//	Иначе
		//		НовСтр = Документ.РасшифровкаПлатежа.Добавить();
		//	КонецЕсли;
		//	НовСтр.СуммаПлатежа = СуммаБезнал;
		//	НовСтр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		//	//Трофимова 04.02.2019 --- 
		//КонецЕсли;
	КонецЕсли;
	
	//Трофимова 04.02.2019 +++
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		//НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		//Трофимова 18.06.2019 +++
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		ТЗРозничнаяПродажа = ПолучитьПустуюТЗПродажи();
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтатусПартии	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Партия				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			НомерГТД		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			КодСтраны		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДС		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДСИмя	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Себестоимость		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДССеб			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество 			= СокрЛП(ТекущаяСтрока);
			
			СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			Себестоимость		= ?(Себестоимость="", 0, Число(Себестоимость));
			СуммаНДССеб			= ?(СуммаНДССеб="", 0, Число(СуммаНДССеб));
			Количество			= ?(Количество="", 0, Число(Количество));
			СтавкаНДС			= ПолучитьЗначениеРеквизита(СтавкаНДС, СтавкаНДСИмя);
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			НомерГТД			= ВосстПредстРеквизита(НомерГТД);
			ДокОприходования	= Неопределено;
			
			НСтрока = ТЗРозничнаяПродажа.Добавить();
			НСтрока.СуммаПродажи = Сумма;
			НСтрока.Себестоимость = Себестоимость;
			НСтрока.СебестоимостьНДС = СуммаНДССеб;
			НСтрока.СуммаНДС = СуммаНДС;
			НСтрока.СтавкаНДС = СтавкаНДС;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
		СуммаПродажи = ТЗРозничнаяПродажа.Итог("СуммаПродажи");
		Себестоимость = ТЗРозничнаяПродажа.Итог("Себестоимость") + ТЗРозничнаяПродажа.Итог("СебестоимостьНДС");
		СуммаНДСПродажи = ТЗРозничнаяПродажа.Итог("СуммаНДС");
		СуммаПКО = СуммаПродажи - СуммаБезнал;
		СебестоимостьБезНал = ?(СуммаБезнал=0,СебестоимостьБезНал=0,Окр(СуммаБезнал/СуммаПродажи*Себестоимость,2));
		СебестоимостьНал = Себестоимость - СебестоимостьБезНал;
		
		Если СуммаБезнал>0 И СуммаНДСБезнал = 0 Тогда
			СуммаНДСБезнал = СуммаНДСПродажи*(СуммаБезнал/СуммаПродажи);
		КонецЕсли;
		
		СтруктураОплатыСНДС = ПолучитьСтруктуруОплатыСНДС(ТЗРозничнаяПродажа,СуммаПКО,СуммаБезнал,СуммаНДСПродажи-СуммаНДСБезнал,СуммаНДСБезнал);
		
		//заполняем РасшифровкаПлатежа документа ОплатаПлатежнойКартой
		ТЗОплатаПлатежнойКартой = СтруктураОплатыСНДС.ОплатаПлатежнойКартой;
		Документ.РасшифровкаПлатежа.Очистить();
		Для каждого СтрокаОплаты Из ТЗОплатаПлатежнойКартой Цикл
			НовСтр = Документ.РасшифровкаПлатежа.Добавить();
			//НовСтр.СтатьяДвиженияДенежныхСредств		= СтатьяДДС;	
			НовСтр.КурсВзаиморасчетов					= 1;
			НовСтр.СуммаПлатежа							= СтрокаОплаты.Сумма;
			НовСтр.КратностьВзаиморасчетов 				= 1;
			НовСтр.СуммаВзаиморасчетов					= СтрокаОплаты.Сумма;
			НовСтр.СтавкаНДС							= СтрокаОплаты.СтавкаНДС;
			НовСтр.СуммаНДС								= СтрокаОплаты.СуммаНДС;
		КонецЦикла;
		
		//Документ.Графа7_УСН = СебестоимостьБезНал;
		
		// Создаем документ ПКО
		НайденДокументПКО = Ложь;
		РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ПриходныйКассовыйОрдер");
		Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
			// если не нашли и документ не проведен, то грузить его не будем
			Если Число(ТекущийСтатус)<>2 Тогда
				Возврат Истина;	
			КонецЕсли;
		Иначе
			НайденДокументПКО = Истина;
		КонецЕсли;
		Если НайденДокументПКО Тогда
			Попытка
				ДокументПКО = РезультатПоиска.ПолучитьОбъект();
			Исключение
				ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				Возврат Ложь;
			КонецПопытки;
			ДокументПКО.РасшифровкаПлатежа.Очистить();
			ДокументПКО.ПометкаУдаления = Ложь;
		Иначе
			// Создаем документ
			Попытка
				ДокументПКО = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
			Исключение
				ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
		
		//Трофимова 25.02.2019 +++
		ДеятельностьНаТорговомСборе = Ложь;
		//Трофимова 25.02.2019 --- 
		
		ВидОперации = Перечисления.ВидыОперацийПКО.РозничнаяВыручка;
		ДокументПКО.ВыручкаСНТТ = Склад.ТипСклада = Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка;
		ДеятельностьНаТорговомСборе = УчетнаяПолитика.ПлательщикТорговогоСбора(Организация, ДатаДокумента);
		ДокументПКО.ДеятельностьНаТорговомСборе = ДеятельностьНаТорговомСборе;
		
		ДокументПКО.Дата							= ДатаДокумента;
		ДокументПКО.ВидОперации						= ВидОперации;
		ДокументПКО.Комментарий						= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
		ДокументПКО.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
		ДокументПКО.Организация						= Организация;
		ДокументПКО.Контрагент						= Склад;
		ДокументПКО.СчетКасса						= ПланыСчетов.Хозрасчетный.ОперационнаяКасса;
		ДокументПКО.ВалютаДокумента					= Константы.ВалютаРегламентированногоУчета.Получить();
		ДокументПКО.Основание						= ИмяДокумента;
		ДокументПКО.РучнаяКорректировка				= Ложь;
		ДокументПКО.ПринятоОт						= Склад;
		ДокументПКО.СуммаДокумента					= СуммаПКО;
		ДокументПКО.СтатьяДвиженияДенежныхСредств 	= СтатьяДДС;
		Если ЭтоВерсияКорп Тогда
			ДокументПКО.ПодразделениеОрганизации	= Подразделение;
			//ДокументПКО.ПодразделениеКт				= Подразделение;
		КонецЕсли;
		
		//заполнение ТЧ документа
		//НовСтр = ДокументПКО.РасшифровкаПлатежа.Добавить();
		//НовСтр.СтатьяДвиженияДенежныхСредств	= СтатьяДДС;	
		//НовСтр.КурсВзаиморасчетов					= 1;
		//НовСтр.СуммаПлатежа							= СуммаПКО;
		//НовСтр.КратностьВзаиморасчетов 				= 1;
		//НовСтр.СуммаВзаиморасчетов					= СуммаПКО;
		//НовСтр.СтавкаНДС							= СтавкаНДС;
		//НовСтр.СуммаНДС								= СуммаНДС;
		//ДокументПКО.Графа7_УСН 						= СебестоимостьНал; 
		//ДокументПКО.Графа5_УСН 						= ?(ДеятельностьНаТорговомСборе,ДокументПКО.СуммаДокумента,0);
		ТЗОплатаНаличные = СтруктураОплатыСНДС.ОплатаНаличные;
		Для каждого СтрокаОплаты Из ТЗОплатаНаличные Цикл
			НовСтр = ДокументПКО.РасшифровкаПлатежа.Добавить();
			НовСтр.СтатьяДвиженияДенежныхСредств	= СтатьяДДС;	
			НовСтр.КурсВзаиморасчетов					= 1;
			НовСтр.СуммаПлатежа							= СтрокаОплаты.Сумма;
			НовСтр.КратностьВзаиморасчетов 				= 1;
			НовСтр.СуммаВзаиморасчетов					= СтрокаОплаты.Сумма;
			НовСтр.СтавкаНДС							= СтрокаОплаты.СтавкаНДС;
			НовСтр.СуммаНДС								= СтрокаОплаты.СуммаНДС;
		КонецЦикла; 
		//Трофимова 18.06.2019 --- 
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	//Трофимова 04.02.2019 --- 
	
	//Если Число(ТекущийСтатус)=2 Тогда
	//	НомерТекущейСтроки = НомерТекущейСтроки + 1;                
	//	ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
	//	
	//	ЕстьКомиссия = Ложь;
	//	Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
	//		// пустые строки пропускаем
	//		Если СокрЛП(ТекущаяСтрока)="" Тогда
	//			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
	//			ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
	//			Продолжить;
	//		КонецЕсли;        
	//		
	//		// Разбираем строку          
	//		ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
	//		ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	//		ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	//		СтатусПартии	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	//		Партия				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	//		НомерГТД		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	//		КодСтраны		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	//		СтавкаНДС		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	//		СтавкаНДСИмя	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	//		СуммаНДС 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	//		Сумма				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	//		Себестоимость		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	//		СуммаНДССеб			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	//		Количество 			= СокрЛП(ТекущаяСтрока);
	//		
	//		СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
	//		Сумма				= ?(Сумма="", 0, Число(Сумма));
	//		Себестоимость		= ?(Себестоимость="", 0, Число(Себестоимость));
	//		СуммаНДССеб			= ?(СуммаНДССеб="", 0, Число(СуммаНДССеб));
	//		Количество			= ?(Количество="", 0, Число(Количество));
	//		СтавкаНДС			= ПолучитьЗначениеРеквизита(СтавкаНДС, СтавкаНДСИмя);
	//		Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
	//		НомерГТД			= ВосстПредстРеквизита(НомерГТД);
	//		ДокОприходования	= Неопределено;
	//		
	//		Если СтатусПартии="Принятый" Тогда
	//			Если НЕ ЗагрузкаНоменклатуры Тогда
	//				Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Т00000006");
	//			КонецЕсли;
	//			
	//			ДокОприходования		= НайтиОбъектПоGUID(Партия, "Документ.ПоступлениеТоваровУслуг");
	//			Если обЗначениеНеЗаполнено(ДокОприходования) Тогда
	//				ДокОприходования	= ПолучитьДокументПартии(Партия, Документ, Контрагент, Договор);
	//			КонецЕсли;
	//			
	//			ЕстьКомиссия = Истина;
	//		КонецЕсли;
	//		
	//		//заполнение ТЧ документа
	//		НовСтр = Документ.Товары.Добавить();
	//		НовСтр.Номенклатура		= Номенклатура;
	//		НовСтр.Количество		= Количество;
	//		НовСтр.СтавкаНДС		= СтавкаНДС;
	//		НовСтр.СуммаНДС			= СуммаНДС;
	//		НовСтр.Сумма			= Сумма;
	//		НовСтр.Себестоимость	= ?(НеЗагружатьСебестоимость, 0, Себестоимость - ?(УСН, 0, СуммаНДССеб));
	//			
	//		Если НЕ обЗначениеНеЗаполнено(ДокОприходования) Тогда
	//			НовСтр.ДокументОприходования = ДокОприходования;
	//		КонецЕсли;
	//		
	//		Если ТипЗнч(НовСтр.Субконто)=Тип("СправочникСсылка.НоменклатурныеГруппы") И ЗначениеЗаполнено(Номенклатура.НоменклатурнаяГруппа) Тогда
	//			НовСтр.Субконто	= Номенклатура.НоменклатурнаяГруппа;
	//		КонецЕсли;
	//		
	//		// Установка номера ГТД
	//		Если НомерГТД<>"" Тогда
	//			СпрСтрана = Справочники.СтраныМира.НайтиПоКоду(КодСтраны);
	//			СпрГТД = Справочники.НомераГТД.НайтиПоКоду(НомерГТД);
	//			Если ЗначениеЗаполнено(СпрГТД) Тогда
	//				НовСтр.НомерГТД = СпрГТД;
	//				НовСтр.СтранаПроисхождения = СпрСтрана;
	//			Иначе
	//				Попытка
	//					НовыйГТД = Справочники.НомераГТД.СоздатьЭлемент();
	//					НовыйГТД.Код = НомерГТД;
	//					НовыйГТД.Записать();
	//					НовСтр.НомерГТД = НовыйГТД.Ссылка;
	//					НовСтр.СтранаПроисхождения = СпрСтрана;
	//				Исключение
	//					ТекстСообщения = "Не удалось записать номер ГТД ("+НомерГТД+")";
	//					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//					Лог.ДобавитьСтроку(ТекстСообщения);
	//				КонецПопытки;
	//			КонецЕсли;
	//		КонецЕсли;
	//		
	//		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
	//		ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
	//	КонецЦикла;
	//	
	//	Документы.ОтчетОРозничныхПродажах.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Товары");
	//	
	//	//для комисионных товаров, найдем и исправим счет учета
	//	Если ЗагрузкаНоменклатуры И ЕстьКомиссия Тогда
	//		Для Каждого СтрокаДок Из Документ.Товары Цикл
	//			Если ЗначениеЗаполнено(СтрокаДок.ДокументОприходования) И ТипЗнч(СтрокаДок.ДокументОприходования)=Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
	//				СтрокаДокОприходования = СтрокаДок.ДокументОприходования.Товары.Найти(СтрокаДок.Номенклатура);
	//				Если СтрокаДокОприходования<>Неопределено И ЗначениеЗаполнено(СтрокаДокОприходования.СчетУчета) Тогда
	//					НовСтр.СчетУчета = СтрокаДокОприходования.СчетУчета;
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли;
	//	
	//Иначе
	//	НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	//КонецЕсли;
	
	//Если СравнениеДанных Тогда
	//	СравнениеОбъектов(Документ, "Товары,Оплата");
	//	Возврат Истина;
	//КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		//Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ОтчетОРозничныхПродажах") Тогда
		//Трофимова 04.02.2019 +++
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ОплатаПлатежнойКартой") Тогда		
		//Трофимова 04.02.2019 --- 
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//Сохраняем документ  ПКО:
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			ДокументПКО.ПометкаУдаления = Истина;
			ДокументПКО.Проведен		 = Ложь;
			ДокументПКО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			ДокументПКО.ПометкаУдаления = Ложь;
			ДокументПКО.Проведен		 = Ложь;
			ДокументПКО.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			ДокументПКО.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					ДокументПКО.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					ДокументПКО.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+ДокументПКО+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				ДокументПКО.ПометкаУдаления = Ложь;
				ДокументПКО.Проведен = Ложь;
				ДокументПКО.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+ДокументПКО+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокументПКО Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(ДокументПКО.Ссылка, GUID, "Документ.ПриходныйКассовыйОрдер") Тогда		
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.ЗакрытиеСмены");
	
	Возврат Истина;	
КонецФункции //ЗагрузитьЗакрытиеСмены()

//Трофимова 03.05.2020 +++
//
Функция ПолучитьСтруктуруОплатыСНДС(ТЗРозничнаяПродажа,СуммаНал,СуммаБезнал,СуммаНДСНал,СуммаНДСБезНал)
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТЗРозничнаяПродажа.СтавкаНДС КАК СтавкаНДС,
	|	ТЗРозничнаяПродажа.СуммаНДС КАК СуммаНДС,
	|	ТЗРозничнаяПродажа.СуммаПродажи КАК Сумма
	|ПОМЕСТИТЬ ВТ_НДС
	|ИЗ
	|	&ТЗРозничнаяПродажа КАК ТЗРозничнаяПродажа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НДС.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВТ_НДС.СуммаНДС) КАК СуммаНДС20,
	|	СУММА(ВТ_НДС.Сумма) КАК Сумма
	|ПОМЕСТИТЬ СуммыНДС20
	|ИЗ
	|	ВТ_НДС КАК ВТ_НДС
	|ГДЕ
	|	ВТ_НДС.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_НДС.СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НДС.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВТ_НДС.СуммаНДС) КАК СуммаНДС10,
	|	СУММА(ВТ_НДС.Сумма) КАК Сумма
	|ПОМЕСТИТЬ СуммыНДС10
	|ИЗ
	|	ВТ_НДС КАК ВТ_НДС
	|ГДЕ
	|	ВТ_НДС.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_НДС.СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НДС.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВТ_НДС.СуммаНДС) КАК СуммаБезНДС,
	|	СУММА(ВТ_НДС.Сумма) КАК Сумма
	|ПОМЕСТИТЬ СуммыБезНДС
	|ИЗ
	|	ВТ_НДС КАК ВТ_НДС
	|ГДЕ
	|	ВТ_НДС.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_НДС.СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_НДС.СуммаНДС) КАК СуммаНДСВсего,
	|	СУММА(ВТ_НДС.Сумма) КАК СуммаВсего
	|ПОМЕСТИТЬ ВТ_ИтогСуммы
	|ИЗ
	|	ВТ_НДС КАК ВТ_НДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&СуммаНДСНал / ВТ_ИтогСуммы.СуммаНДСВсего КАК КоэфНДСНал,
	|	&СуммаНДСБезНал / ВТ_ИтогСуммы.СуммаНДСВсего КАК КоэфНДСБезНал,
	|	&СуммаНал / ВТ_ИтогСуммы.СуммаВсего КАК КоэфСуммаНал,
	|	&СуммаБезНал / ВТ_ИтогСуммы.СуммаВсего КАК КоэфСуммаБезНал
	|ПОМЕСТИТЬ ВТ_Коэфф
	|ИЗ
	|	ВТ_ИтогСуммы КАК ВТ_ИтогСуммы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыНДС20.СтавкаНДС КАК СтавкаНДС,
	|	СуммыНДС20.СуммаНДС20 * ВТ_Коэфф.КоэфНДСНал КАК СуммаНДСНал,
	|	СуммыНДС20.Сумма * ВТ_Коэфф.КоэфСуммаНал КАК СуммаНал,
	|	СуммыНДС20.СуммаНДС20 * ВТ_Коэфф.КоэфНДСБезНал КАК СуммаНДСБезНал,
	|	СуммыНДС20.Сумма * ВТ_Коэфф.КоэфСуммаБезНал КАК СуммаБезНал
	|ПОМЕСТИТЬ ВТ_РаспрНДС20
	|ИЗ
	|	СуммыНДС20 КАК СуммыНДС20,
	|	ВТ_Коэфф КАК ВТ_Коэфф
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыНДС10.СтавкаНДС КАК СтавкаНДС,
	|	СуммыНДС10.СуммаНДС10 * ВТ_Коэфф.КоэфНДСНал КАК СуммаНДСНал,
	|	СуммыНДС10.Сумма * ВТ_Коэфф.КоэфСуммаНал КАК СуммаНал,
	|	СуммыНДС10.СуммаНДС10 * ВТ_Коэфф.КоэфНДСБезНал КАК СуммаНДСБезНал,
	|	СуммыНДС10.Сумма * ВТ_Коэфф.КоэфСуммаБезНал КАК СуммаБезНал
	|ПОМЕСТИТЬ ВТ_РаспрНДС10
	|ИЗ
	|	СуммыНДС10 КАК СуммыНДС10,
	|	ВТ_Коэфф КАК ВТ_Коэфф
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыБезНДС.СтавкаНДС КАК СтавкаНДС,
	|	СуммыБезНДС.СуммаБезНДС * ВТ_Коэфф.КоэфНДСНал КАК СуммаНДСНал,
	|	СуммыБезНДС.Сумма * ВТ_Коэфф.КоэфСуммаНал КАК СуммаНал,
	|	СуммыБезНДС.СуммаБезНДС * ВТ_Коэфф.КоэфНДСБезНал КАК СуммаНДСБезНал,
	|	СуммыБезНДС.Сумма * ВТ_Коэфф.КоэфСуммаБезНал КАК СуммаБезНал
	|ПОМЕСТИТЬ ВТ_РаспрБезНДС
	|ИЗ
	|	ВТ_Коэфф КАК ВТ_Коэфф,
	|	СуммыБезНДС КАК СуммыБезНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РаспрНДС20.СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ВТ_РаспрНДС20.СуммаНДСНал КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ВТ_РаспрНДС20.СуммаНал КАК ЧИСЛО(15, 2)) КАК Сумма
	|ИЗ
	|	ВТ_РаспрНДС20 КАК ВТ_РаспрНДС20
	|ГДЕ
	|	ВТ_РаспрНДС20.СуммаНал <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РаспрНДС10.СтавкаНДС,
	|	ВЫРАЗИТЬ(ВТ_РаспрНДС10.СуммаНДСНал КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ВТ_РаспрНДС10.СуммаНал КАК ЧИСЛО(15, 2))
	|ИЗ
	|	ВТ_РаспрНДС10 КАК ВТ_РаспрНДС10
	|ГДЕ
	|	ВТ_РаспрНДС10.СуммаНал <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РаспрБезНДС.СтавкаНДС,
	|	ВЫРАЗИТЬ(ВТ_РаспрБезНДС.СуммаНДСНал КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ВТ_РаспрБезНДС.СуммаНал КАК ЧИСЛО(15, 2))
	|ИЗ
	|	ВТ_РаспрБезНДС КАК ВТ_РаспрБезНДС
	|ГДЕ
	|	ВТ_РаспрБезНДС.СуммаНал <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РаспрНДС20.СтавкаНДС КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ВТ_РаспрНДС20.СуммаНДСБезНал КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ВТ_РаспрНДС20.СуммаБезНал КАК ЧИСЛО(15, 2)) КАК Сумма
	|ИЗ
	|	ВТ_РаспрНДС20 КАК ВТ_РаспрНДС20
	|ГДЕ
	|	ВТ_РаспрНДС20.СуммаБезНал <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РаспрНДС10.СтавкаНДС,
	|	ВЫРАЗИТЬ(ВТ_РаспрНДС10.СуммаНДСБезНал КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ВТ_РаспрНДС10.СуммаБезНал КАК ЧИСЛО(15, 2))
	|ИЗ
	|	ВТ_РаспрНДС10 КАК ВТ_РаспрНДС10
	|ГДЕ
	|	ВТ_РаспрНДС10.СуммаБезНал <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РаспрБезНДС.СтавкаНДС,
	|	ВЫРАЗИТЬ(ВТ_РаспрБезНДС.СуммаНДСБезНал КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ВТ_РаспрБезНДС.СуммаБезНал КАК ЧИСЛО(15, 2))
	|ИЗ
	|	ВТ_РаспрБезНДС КАК ВТ_РаспрБезНДС
	|ГДЕ
	|	ВТ_РаспрБезНДС.СуммаБезНал <> 0";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТЗРозничнаяПродажа",ТЗРозничнаяПродажа);
	Запрос.УстановитьПараметр("СуммаНал",СуммаНал);
	Запрос.УстановитьПараметр("СуммаБезнал",СуммаБезнал);
	Запрос.УстановитьПараметр("СуммаНДСНал",СуммаНДСНал);
	Запрос.УстановитьПараметр("СуммаНДСБезНал",СуммаНДСБезНал);
	ПакетыЗапроса = Запрос.ВыполнитьПакет();
	СтрутураОплат = Новый Структура("ОплатаНаличные,ОплатаПлатежнойКартой");
	СтрутураОплат.ОплатаНаличные = ПакетыЗапроса[9].Выгрузить();
	СтрутураОплат.ОплатаПлатежнойКартой = ПакетыЗапроса[10].Выгрузить();
	
	Возврат СтрутураОплат;
КонецФункции //Трофимова 03.05.2020 --- 

//НикифоровАО 03.08.2024 +++ Задача: обновление ИБ
//
Процедура ЗаполнитьОтражениеВУСНВСтрокеТабличнойЧасти(Объект, СтрокаТаблицы) Экспорт
	
	Если УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы(Объект.Организация, Объект.Дата) Тогда
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				Объект.ДоговорКонтрагента, "ВидДоговора") = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
			СтрокаТаблицы.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку Тогда
		Иначе
			СтрокаТаблицы.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //НикифоровАО 03.08.2024 ---

Функция ЗагрузитьСписаниеТоваров(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
			
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Склад				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Статья				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СтатьяНаименование	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КоррСчет			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Склад				= НайтиОбъектПоGUID(Склад);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.СписаниеТоваров");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	УСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, ДатаДокумента);
	УчетПоРозЦенам = (УчетнаяПолитика.СпособОценкиТоваровВРознице(Организация, ДатаДокумента)=Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости);
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.Товары.Очистить();
		Документ.ВозвратнаяТара.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.СписаниеТоваров.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация="СписаниеТоваров" ИЛИ ХозОперация="ПересортицаТоваров"
		ИЛИ ХозОперация="ПеретариваниеТоваров" ИЛИ ХозОперация="ПонижениеСортности"
		ИЛИ ХозОперация="СписаниеТоваровСТорговогоЗалаЕГАИС" Тогда
		//
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.Склад							= Склад;
	Документ.РучнаяКорректировка			= Ложь;
	Документ.Основание						= ВосстПредстРеквизита(СтатьяНаименование);
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;	
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
	
	//Документы.СписаниеТоваров.ЗаполнитьСчетаУчетаРасчетов(Документ);
	СчетаУчетаВДокументах.ЗаполнитьСчетаУчетаРасчетов(Документ);
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтатусПартии	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			НомерГТД		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			КодСтраны		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма	 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаРозничная		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество			= СокрЛП(ТекущаяСтрока);
			
			СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			СуммаРозничная		= ?(СуммаРозничная="", 0, Число(СуммаРозничная));
			Количество			= ?(Количество="", 0, Число(Количество));
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			НомерГТД			= ВосстПредстРеквизита(НомерГТД);
			
			Если СтатусПартии="Принятый" И НЕ ЗагрузкаНоменклатуры Тогда
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Т00000006");
			КонецЕсли;
			
			//заполнение ТЧ документа
			Если Найти(Номенклатура,"Тара")>0 Тогда
				НовСтр = Документ.ВозвратнаяТара.Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.Количество			= Количество;
				
			Иначе
				НовСтр = Документ.Товары.Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.Количество			= Количество;
				НовСтр.СтавкаНДСВРознице	= ?(ДатаДокумента>=Дата("20190101"), Перечисления.СтавкиНДС.НДС20, Перечисления.СтавкиНДС.НДС18);
				НовСтр.Сумма				= Сумма;
				//Трофимова 04.02.2019 +++
				НовСтр.Цена					= Сумма/Количество;
				//Трофимова 04.02.2019 --- 
				НовСтр.Себестоимость		= ?(НеЗагружатьСебестоимость, 0, Сумма - ?(УСН, 0, СуммаНДС));
				НовСтр.ОтражениеВУСН		= ?(УСН, Перечисления.ОтражениеВУСН.Принимаются, Перечисления.ОтражениеВУСН.НеПринимаются);
				
				Если УчетПоРозЦенам И Склад.ТипСклада=Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
					НовСтр.Сумма			= СуммаРозничная;
				КонецЕсли;
				
				// Установка номера ГТД
				Если НомерГТД<>"" Тогда
					СпрСтрана = Справочники.СтраныМира.НайтиПоКоду(КодСтраны);
					СпрГТД = Справочники.НомераГТД.НайтиПоКоду(НомерГТД);
					Если ЗначениеЗаполнено(СпрГТД) Тогда
						НовСтр.НомерГТД = СпрГТД;
						НовСтр.СтранаПроисхождения = СпрСтрана;
					Иначе
						Попытка
							НовыйГТД = Справочники.НомераГТД.СоздатьЭлемент();
							НовыйГТД.Код = НомерГТД;
							НовыйГТД.Записать();
							НовСтр.НомерГТД = НовыйГТД.Ссылка;
							НовСтр.СтранаПроисхождения = СпрСтрана;
						Исключение
							ТекстСообщения = "Не удалось записать номер ГТД ("+НомерГТД+")";
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
							Лог.ДобавитьСтроку(ТекстСообщения);
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
		
		//Документы.СписаниеТоваров.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "ВозвратнаяТара");
		//Документы.СписаниеТоваров.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Товары");
		СчетаУчетаВДокументах.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "ВозвратнаяТара"); 
		СчетаУчетаВДокументах.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Товары"); 

	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "Товары,ВозвратнаяТара");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.СписаниеТоваров") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.СписаниеТоваров");
	
	Возврат Истина;	
КонецФункции //ЗагрузитьСписаниеТоваров()

Функция ЗагрузитьВозвратПоставщику(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
			
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Договор				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Склад				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДокОснование		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТипДокОснование		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	Договор				= НайтиОбъектПоGUID(Договор);
	Склад				= НайтиОбъектПоGUID(Склад);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	ДокОснование		= НайтиОбъектПоGUID(ДокОснование, "Документ."+НайтиСоответствиеДокумента(ТипДокОснование));	
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ВозвратТоваровПоставщику");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 И обЗначениеНеЗаполнено(ДокОснование) Тогда
		ТекстСообщения = "Не найден документ основание(сделка) для документа "+ИмяДокумента;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
	КонецЕсли;
		
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, Договор);
	УСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, ДатаДокумента);
	ОргБезНДС = УчетнаяПолитика.ПлательщикНДС(Организация, ДатаДокумента);
	УчетПоРозЦенам = (УчетнаяПолитика.СпособОценкиТоваровВРознице(Организация, ДатаДокумента)=Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости);
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.Товары.Очистить();
		Документ.ВозвратнаяТара.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.ВозвратТоваровПоставщику.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация="ВозвратТоваровПоставщику" Тогда
		ВидОперации = Перечисления.ВидыОперацийВозвратТоваровПоставщику.ПокупкаКомиссия;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента;
	Документ.ВидОперации					= ВидОперации;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.Контрагент						= Контрагент;
	Документ.ДоговорКонтрагента				= ПроверкаДоговора(Договор, Документ);
	Документ.Склад							= Склад;
	Документ.ВалютаДокумента				= Константы.ВалютаРегламентированногоУчета.Получить();
	Документ.КурсВзаиморасчетов				= 1;
	Документ.КратностьВзаиморасчетов		= 1;
	Документ.СуммаВключаетНДС				= Истина;
	//Документ.НДСВключенВСтоимость			= УСН;
	Документ.ДокументБезНДС					= Ложь;
	Документ.РучнаяКорректировка			= Ложь;
	Документ.Сделка							= ДокОснование;
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;	
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
	
	Документы.ВозвратТоваровПоставщику.ЗаполнитьСчетаУчетаРасчетов(Документ);
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтатусПартии	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			НомерГТД		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			КодСтраны		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДС		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДСИмя	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма	 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаРозничная		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество			= СокрЛП(ТекущаяСтрока);
			
			СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			СуммаРозничная		= ?(СуммаРозничная="", 0, Число(СуммаРозничная));
			Количество			= ?(Количество="", 0, Число(Количество));
			СтавкаНДС			= ПолучитьЗначениеРеквизита(СтавкаНДС, СтавкаНДСИмя);
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			НомерГТД			= ВосстПредстРеквизита(НомерГТД);
			
			Если СтатусПартии="Принятый" И НЕ ЗагрузкаНоменклатуры Тогда
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Т00000006");
			КонецЕсли;
			
			//заполнение ТЧ документа
			Если Найти(Номенклатура,"Тара")>0 Тогда
				НовСтр = Документ.ВозвратнаяТара.Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.Количество			= Количество;
				НовСтр.Сумма				= Сумма;
				
			Иначе
				НовСтр = Документ.Товары.Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.Количество			= Количество;
				НовСтр.Сумма				= Сумма;
				НовСтр.СтавкаНДС			= ?(УСН, Перечисления.СтавкиНДС.БезНДС, СтавкаНДС);
				НовСтр.СуммаНДС				= ?(УСН, 0, СуммаНДС);
				НовСтр.Себестоимость		= ?(НеЗагружатьСебестоимость, 0, Сумма - ?(УСН, 0, СуммаНДС));
				
				Если УчетПоРозЦенам И Склад.ТипСклада=Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
					НовСтр.СуммаВРознице	= СуммаРозничная;
				КонецЕсли;
				
				// Установка номера ГТД
				Если НомерГТД<>"" Тогда
					СпрСтрана = Справочники.СтраныМира.НайтиПоКоду(КодСтраны);
					СпрГТД = Справочники.НомераГТД.НайтиПоКоду(НомерГТД);
					Если ЗначениеЗаполнено(СпрГТД) Тогда
						НовСтр.НомерГТД = СпрГТД;
						НовСтр.СтранаПроисхождения = СпрСтрана;
					Иначе
						Попытка
							НовыйГТД = Справочники.НомераГТД.СоздатьЭлемент();
							НовыйГТД.Код = НомерГТД;
							НовыйГТД.Записать();
							НовСтр.НомерГТД = НовыйГТД.Ссылка;
							НовСтр.СтранаПроисхождения = СпрСтрана;
						Исключение
							ТекстСообщения = "Не удалось записать номер ГТД ("+НомерГТД+")";
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
							Лог.ДобавитьСтроку(ТекстСообщения);
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
		
		Документы.ВозвратТоваровПоставщику.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "ВозвратнаяТара");
		Документы.ВозвратТоваровПоставщику.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Товары");
		
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "Товары,ВозвратнаяТара");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ВозвратТоваровПоставщику") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.ВозвратПоставщику");
	
	Возврат Истина;	
КонецФункции //ЗагрузитьВозвратПоставщику()

Функция ЗагрузитьВозвратОтПокупателя(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
			
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Договор				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Склад				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДокОснование		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТипДокОснование		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	Договор				= НайтиОбъектПоGUID(Договор);
	Склад				= НайтиОбъектПоGUID(Склад);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	ДокОснование		= НайтиОбъектПоGUID(ДокОснование, "Документ."+НайтиСоответствиеДокумента(ТипДокОснование));
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ВозвратТоваровОтПокупателя");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 И обЗначениеНеЗаполнено(ДокОснование) Тогда
		ТекстСообщения = "Не найден документ основание(сделка) для документа "+ИмяДокумента;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
	КонецЕсли;
	
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, Договор);
	УСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, ДатаДокумента);
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.Товары.Очистить();
		Документ.ВозвратнаяТара.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация="ВозвратТоваровОтПокупателя" Тогда
		ВидОперации = Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.ПродажаКомиссия;
		ЭтоКомиссия = Ложь;
	ИначеЕсли ХозОперация="ВозвратТоваровОтПокупателяКомиссия" Тогда
		ВидОперации = Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.ПродажаКомиссия;
		ЭтоКомиссия = Истина;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента;
	Документ.ВидОперации					= ВидОперации;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.Контрагент						= Контрагент;
	Документ.ДоговорКонтрагента				= ПроверкаДоговора(Договор, Документ);
	Документ.Склад							= Склад;
	Документ.ВалютаДокумента				= Константы.ВалютаРегламентированногоУчета.Получить();
	Документ.КурсВзаиморасчетов				= 1;
	Документ.КратностьВзаиморасчетов		= 1;
	Документ.СуммаВключаетНДС				= Истина;
	Документ.РучнаяКорректировка			= Ложь;
	Документ.Сделка							= ДокОснование;
	Документ.СчетУчетаНДС					= ПланыСчетов.Хозрасчетный.НДСпоПриобретеннымМПЗ;
	Документ.ОтразитьВКнигеПокупок			= Истина;
	Документ.ПокупателемВыставляетсяСчетФактураНаВозврат = (НЕ ТипЗнч(Документ.Сделка) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах"));
	Документ.УстановитьРеквизитыУчетаНДС();
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;	
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
		
	Документы.ВозвратТоваровОтПокупателя.ЗаполнитьСчетаУчетаРасчетов(Документ);
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтатусПартии	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			НомерГТД		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			КодСтраны		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДС		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДСИмя	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма	 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Себестоимость		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДССеб			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество			= СокрЛП(ТекущаяСтрока);
			
			СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			Себестоимость		= ?(Себестоимость="", 0, Число(Себестоимость));
			СуммаНДССеб			= ?(СуммаНДССеб="", 0, Число(СуммаНДССеб));
			Количество			= ?(Количество="", 0, Число(Количество));
			СтавкаНДС			= ПолучитьЗначениеРеквизита(СтавкаНДС, СтавкаНДСИмя);
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			НомерГТД			= ВосстПредстРеквизита(НомерГТД);
			
			Если СтатусПартии="Принятый" И НЕ ЗагрузкаНоменклатуры Тогда
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Т00000006");
			КонецЕсли;
			
			//заполнение ТЧ документа
			Если Найти(Номенклатура, "Тара")>0 Тогда
				НовСтр = Документ.ВозвратнаяТара.Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.Количество			= Количество;
				НовСтр.Сумма				= Сумма;
				
			Иначе
				НовСтр = Документ.Товары.Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.Количество			= Количество;
				НовСтр.Сумма				= Сумма;
				НовСтр.СтавкаНДС			= СтавкаНДС;
				НовСтр.СуммаНДС				= СуммаНДС;
				НовСтр.Себестоимость		= ?(НеЗагружатьСебестоимость, 0, Себестоимость - ?(УСН, 0, СуммаНДССеб));
				НовСтр.ОтражениеВУСН		= ?(УСН, Перечисления.ОтражениеВУСН.Принимаются, Перечисления.ОтражениеВУСН.НеПринимаются);
				
				Если ТипЗнч(НовСтр.Субконто)=Тип("СправочникСсылка.НоменклатурныеГруппы") И ЗначениеЗаполнено(Номенклатура.НоменклатурнаяГруппа) Тогда
					НовСтр.Субконто	= Номенклатура.НоменклатурнаяГруппа;
				КонецЕсли;
					
				// Установка номера ГТД
				Если НомерГТД<>"" Тогда
					СпрСтрана = Справочники.СтраныМира.НайтиПоКоду(КодСтраны);
					СпрГТД = Справочники.НомераГТД.НайтиПоКоду(НомерГТД);
					Если ЗначениеЗаполнено(СпрГТД) Тогда
						НовСтр.НомерГТД = СпрГТД;
						НовСтр.СтранаПроисхождения = СпрСтрана;
					Иначе
						Попытка
							НовыйГТД = Справочники.НомераГТД.СоздатьЭлемент();
							НовыйГТД.Код = НомерГТД;
							НовыйГТД.Записать();
							НовСтр.НомерГТД = НовыйГТД.Ссылка;
							НовСтр.СтранаПроисхождения = СпрСтрана;
						Исключение
							ТекстСообщения = "Не удалось записать номер ГТД ("+НомерГТД+")";
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
							Лог.ДобавитьСтроку(ТекстСообщения);
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
		
		Документы.ВозвратТоваровОтПокупателя.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "ВозвратнаяТара");
		Документы.ВозвратТоваровОтПокупателя.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Товары");
		
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "Товары,ВозвратнаяТара");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ВозвратТоваровОтПокупателя") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.ВозвратОтПокупателя");
	
	Возврат Истина;	
КонецФункции //ЗагрузитьВозвратОтПокупателя()

Функция ЗагрузитьПеремещениеТоваров(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СкладОтправитель	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СкладПолучатель		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ПодраздОтправитель	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ПодраздПолучатель	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	СкладОтправитель	= НайтиОбъектПоGUID(СкладОтправитель);
	СкладПолучатель		= НайтиОбъектПоGUID(СкладПолучатель);
	ПодраздОтправитель	= НайтиОбъектПоGUID(ПодраздОтправитель);
	ПодраздПолучатель	= НайтиОбъектПоGUID(ПодраздПолучатель);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ПеремещениеТоваров");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	УСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, ДатаДокумента);
	УчетПоРозЦенам = (УчетнаяПолитика.СпособОценкиТоваровВРознице(Организация, ДатаДокумента)=Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости);
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.Товары.Очистить();
		Документ.ТоварыНаКомиссии.Очистить();
		Документ.ВозвратнаяТара.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	//Если ХозОперация<>"ПеремещениеТоваров" Тогда
	//	НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	//	Возврат Истина;
	//КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.СкладОтправитель				= СкладОтправитель;
	Документ.СкладПолучатель				= СкладПолучатель;
	Документ.РучнаяКорректировка			= Ложь;
	Документ.НДСвСтоимостиТоваров			= Перечисления.ДействиеНДСВСтоимостиТоваров.НеИзменять;
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОтправитель	= ?(ТипЗнч(СкладОтправитель) = ТипЗНч(Справочники.Склады.ПустаяССылка()),СкладОтправитель.ПодразделениеОрганизации,СкладОтправитель);
		Документ.ПодразделениеПолучатель	= ?(ТипЗнч(СкладПолучатель) = ТипЗНч(Справочники.Склады.ПустаяССылка()),СкладПолучатель.ПодразделениеОрганизации,СкладПолучатель);
		Если НЕ ЗначениеЗаполнено(Документ.ПодразделениеОтправитель) Тогда
			Документ.ПодразделениеОтправитель = ПодраздОтправитель;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Документ.ПодразделениеПолучатель) Тогда
			Документ.ПодразделениеПолучатель = ПодраздПолучатель;
		КонецЕсли;
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтатусПартии	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма	 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаРозничная		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество			= СокрЛП(ТекущаяСтрока);
			
			СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			СуммаРозничная		= ?(СуммаРозничная="", 0, Число(СуммаРозничная));
			Количество			= ?(Количество="", 0, Число(Количество));
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			
			Если СтатусПартии="Принятый" И НЕ ЗагрузкаНоменклатуры Тогда
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Т00000006");
			КонецЕсли;
			
			//заполнение ТЧ документа
			Если Найти(Номенклатура,"Тара")>0 Тогда
				НовСтр = Документ.ВозвратнаяТара.Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.Количество			= Количество;
				
			ИначеЕсли СтатусПартии="Принятый" Тогда
				НовСтр = Документ.ТоварыНаКомиссии.Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.Количество			= Количество;
				
			Иначе
				НовСтр = Документ.Товары.Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.Количество			= Количество;
				НовСтр.Себестоимость		= ?(НеЗагружатьСебестоимость, 0, Сумма - ?(УСН, 0, СуммаНДС));
				
				Если УчетПоРозЦенам И СкладОтправитель.ТипСклада=Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
					НовСтр.СуммаВРознице	= СуммаРозничная;
				КонецЕсли;
				
			КонецЕсли;
				
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
		
		Документы.ПеремещениеТоваров.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "ВозвратнаяТара");
		Документы.ПеремещениеТоваров.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "ТоварыНаКомиссии");
		Документы.ПеремещениеТоваров.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Товары");
		
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "Товары,ТоварыНаКомиссии,ВозвратнаяТара");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ПеремещениеТоваров") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.ПеремещениеТоваров");
	
	Возврат Истина;	
КонецФункции //ЗагрузитьПеремещениеТоваров()

Функция ЗагрузитьИнвентаризация(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Склад			 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СтатьяНедостач	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СтатьяНедостачНаим	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СтатьяИзлишков	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СтатьяИзлишковНаим	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Склад				= НайтиОбъектПоGUID(Склад);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	СтатьяНедостач		= НайтиОбъектПоGUID(СтатьяНедостач);
	СтатьяИзлишков		= НайтиОбъектПоGUID(СтатьяИзлишков);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	//РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	//Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
	//	НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	//	Возврат Истина;	
	//КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ИнвентаризацияТоваровНаСкладе");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	УСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, ДатаДокумента);
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.Товары.Очистить();
		Документ.ИнвентаризационнаяКомиссия.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.ИнвентаризацияТоваровНаСкладе.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация<>"ИнвентаризацияТоваров" Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.Склад							= Склад;
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтатусПартии	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаРозничная		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество			= СокрЛП(ТекущаяСтрока);
			
			СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			СуммаРозничная		= ?(СуммаРозничная="", 0, Число(СуммаРозничная));
			Количество			= ?(Количество="", 0, Число(Количество));
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			
			Если СтатусПартии="Принятый" И НЕ ЗагрузкаНоменклатуры Тогда
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Т00000006");
			КонецЕсли;
			
			//заполнение ТЧ документа
			НовСтр = Документ.Товары.Добавить();
			НовСтр.Номенклатура		= Номенклатура;
			НовСтр.Количество		= ?(Количество>0, Количество, 0);
			НовСтр.Сумма			= ?(Количество>0, Сумма, 0);
			НовСтр.КоличествоУчет	= ?(Количество>0, 0, -Количество);
			НовСтр.СуммаУчет		= ?(Количество>0, 0, -Сумма);
			//НовСтр.Цена				=
			//НовСтр.ЦенаВРознице		=
				
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
		
		Документы.ИнвентаризацияТоваровНаСкладе.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Товары");
		
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "Товары");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ИнвентаризацияТоваровНаСкладе") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	тзОприходования = Новый ТаблицаЗначений; тзСписания = тзОприходования;
	Если НайденДокумент Тогда
		//Найдем списания и оприходования
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ Ссылка ИЗ Документ.ОприходованиеТоваров ГДЕ ИнвентаризацияТоваровНаСкладе=&Инвентаризация";
		Запрос.УстановитьПараметр("Инвентаризация", Документ.Ссылка);
		тзОприходования = Запрос.Выполнить().Выгрузить();
		Запрос.Текст = "ВЫБРАТЬ Ссылка ИЗ Документ.СписаниеТоваров ГДЕ ИнвентаризацияТоваровНаСкладе=&Инвентаризация";
		Запрос.УстановитьПараметр("Инвентаризация", Документ.Ссылка);
		тзСписания = Запрос.Выполнить().Выгрузить();
	КонецЕсли;	
	
	//проверим наличие излишков и недостач
	ЕстьИзлишки = Ложь; ЕстьНедостача = Ложь;
	Для Каждого СтрокаИнв Из Документ.Товары Цикл
		Отклонение = СтрокаИнв.Количество - СтрокаИнв.КоличествоУчет;	
		Если Отклонение>0 Тогда
			ЕстьИзлишки = Истина;	
		ИначеЕсли Отклонение<0 Тогда
			ЕстьНедостача = Истина;
		КонецЕсли;
		
		Если ЕстьНедостача И ЕстьИзлишки Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	//Обработаем документы оприходования и списания
	Если тзСписания.Количество()=0 И НЕ ЗамещатьПроводки Тогда
		обСписание = Документы.СписаниеТоваров.СоздатьДокумент();
	Иначе//Получим первый документ, а остальные удалим
		ПервыйДокумент = НЕ ЗамещатьПроводки; //удалим все документы, при замещении проводками.
		Для Каждого СтрокаТаблица Из тзСписания Цикл
			Если ПервыйДокумент Тогда
				обСписание = СтрокаТаблица.Ссылка.ПолучитьОбъект();
				обСписание.Товары.Очистить();
				обСписание.ПометкаУдаления	= Истина;
				обСписание.Проведен			= Ложь;
				обСписание.Записать();
				ПервыйДокумент = Ложь;
			Иначе
				Попытка
					обЛишниеСписания = СтрокаТаблица.Ссылка.ПолучитьОбъект();
					обЛишниеСписания.ПометкаУдаления = Истина;
					обЛишниеСписания.Проведен		 = Ложь;
					обЛишниеСписания.Записать();
				Исключение
					ТекстСообщения = "Не удалось удалить списание по причине"+Символы.ПС+ОписаниеОшибки();
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Лог.ДобавитьСтроку(ТекстСообщения);
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ЕстьНедостача И НЕ ЗамещатьПроводки Тогда
		ОбработатьСписанияИОприходованияИнвентаризации(обСписание, ТекущийСтатус, Документ.Ссылка, Подразделение);
	КонецЕсли;
	
	Если тзОприходования.Количество()=0 И НЕ ЗамещатьПроводки Тогда
		обОприходование = Документы.ОприходованиеТоваров.СоздатьДокумент();
	Иначе//Получим первый документ, а остальные удалим
		ПервыйДокумент = НЕ ЗамещатьПроводки; //удалим все документы, при замещении проводками.
		Для каждого СтрокаТаблица Из тзОприходования Цикл
			Если ПервыйДокумент Тогда
				обОприходование = СтрокаТаблица.Ссылка.ПолучитьОбъект();
				обОприходование.Товары.Очистить();
				обОприходование.ПометкаУдаления	= Истина;
				обОприходование.Проведен		= Ложь;
				обОприходование.Записать();
				ПервыйДокумент = Ложь;
			Иначе
				Попытка
					обЛишниеОприходования = СтрокаТаблица.Ссылка.ПолучитьОбъект();
					обЛишниеОприходования.ПометкаУдаления = Истина;
					обЛишниеОприходования.Проведен		  = Ложь;
					обЛишниеОприходования.Записать();
				Исключение
					ТекстСообщения = "Не удалось удалить оприходование по причине"+Символы.ПС+ОписаниеОшибки();
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Лог.ДобавитьСтроку(ТекстСообщения);
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ЕстьИзлишки И НЕ ЗамещатьПроводки Тогда
		обОприходование.СтатьяПрочихДоходовРасходов = СтатьяИзлишков;
		ОбработатьСписанияИОприходованияИнвентаризации(обОприходование, ТекущийСтатус, Документ.Ссылка, Подразделение);
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.Инвентаризация");
	
	Возврат Истина;	
КонецФункции //ЗагрузитьИнвентаризация()

Функция ЗагрузитьПоступлениеДопРасходов(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Договор				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Склад				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДокОснование		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТипДокОснование		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерВх				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаВх				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	Договор				= НайтиОбъектПоGUID(Договор);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	ДокОснование		= НайтиОбъектПоGUID(ДокОснование, "Документ."+НайтиСоответствиеДокумента(ТипДокОснование));	
	НомерВх				= ?(ЗначениеЗаполнено(НомерВх), ВосстПредстРеквизита(НомерВх), "Без номера");
	ДатаВх				= ?(ЗначениеЗаполнено(Дата(ДатаВх)), Дата(ДатаВх), ДатаДокумента);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");

	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 И обЗначениеНеЗаполнено(ДокОснование) Тогда
		ТекстСообщения = "Не найден документ основание(ДокументПартии) для документа " + ИмяДокумента;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ПоступлениеДопРасходов");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, Договор);
	УСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, ДатаДокумента);
	ОргБезНДС = УчетнаяПолитика.ПлательщикНДС(Организация, ДатаДокумента);
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.Товары.Очистить();
		Документ.ЗачетАвансов.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.ПоступлениеДопРасходов.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация<>"ПоступлениеДопРасходов" Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.Контрагент						= Контрагент;
	Документ.ДоговорКонтрагента				= Договор;
	Документ.ВалютаДокумента				= Константы.ВалютаРегламентированногоУчета.Получить();
	Документ.КурсВзаиморасчетов				= 1;
	Документ.КратностьВзаиморасчетов		= 1;
	Документ.СпособЗачетаАвансов			= Перечисления.СпособыЗачетаАвансов.Автоматически;
	Документ.СуммаВключаетНДС				= Истина;
	Документ.НДСВключенВСтоимость			= УСН;
	Документ.НДСНеВыделять					= Ложь;
	Документ.СпособРаспределения			= Перечисления.СпособыРаспределенияДопРасходов.ПоСумме;
	Документ.ДатаВходящегоДокумента			= ДатаВх;
	Документ.НомерВходящегоДокумента		= НомерВх;
	Документ.РучнаяКорректировка			= Ложь;
	Документ.Содержание						= "Доп.расходы";
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;	
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
	
	Документы.ПоступлениеДопРасходов.ЗаполнитьСчетаУчетаРасчетов(Документ);
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтатусПартии	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДС		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДСИмя	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма	 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество			= СокрЛП(ТекущаяСтрока);
			
			СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			Количество			= ?(Количество="", 0, Число(Количество));
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			
			Если СтатусПартии="Принятый" И НЕ ЗагрузкаНоменклатуры Тогда
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Т00000006");
			КонецЕсли;
			
			//заполнение ТЧ документа
			НовСтр = Документ.Товары.Добавить();
			НовСтр.Номенклатура		= Номенклатура;
			НовСтр.Количество		= 1;
			НовСтр.СуммаТовара		= Сумма;
			НовСтр.Сумма			= Сумма;
			НовСтр.СуммаНДС			= СуммаНДС;
			НовСтр.ДокументПартии	= ДокОснование;
			НовСтр.ОтражениеВУСН	= ?(УСН, Перечисления.ОтражениеВУСН.Принимаются, Перечисления.ОтражениеВУСН.НеПринимаются);
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
		
		Документы.ПоступлениеДопРасходов.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Товары");
		
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "Товары");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ПоступлениеДопРасходов") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.ПоступлениеДопРасходов");
	
	Возврат Истина;
КонецФункции //ЗагрузитьПоступлениеДопРасходов()

Функция ЗагрузитьОтчетПроизводстваЗаСмену(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Склад				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СуммаРознРасход		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СуммаРозничная		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Склад				= НайтиОбъектПоGUID(Склад);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОтчетПроизводстваЗаСмену");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	УСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, ДатаДокумента);
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.Продукция.Очистить();
		Документ.Услуги.Очистить();
		Документ.ВозвратныеОтходы.Очистить();
		Документ.Материалы.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.ОтчетПроизводстваЗаСмену.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация<>"ОтчетПроизводстваЗаСмену" И ХозОперация<>"Разделка" Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.ПодразделениеЗатрат			= Подразделение;
	Документ.Склад							= Склад;
//	Документ.СчетЗатрат						= ПланыСчетов.Хозрасчетный.ОсновноеПроизводство;
	Документ.СчетЗатрат						= ПланыСчетов.Хозрасчетный.НайтиПоКоду("20.03");
	Документ.СуммаРознРасход  				= Число(?(СуммаРознРасход = "",0,СуммаРознРасход));
	Документ.СуммаРозничная                 = Число(?(СуммаРозничная = "",0,СуммаРозничная));
	Документ.НДСвСтоимостиТоваров			= Перечисления.ДействиеНДСВСтоимостиТоваров.НеИзменять;
	Документ.ДляСписанияНДСиспользоватьСчетИАналитикуУчетаЗатрат = Истина;
	//Документ.СчетСписанияНДС				=
	//Документ.СубконтоСписанияНДС1			=
	//Документ.СубконтоСписанияНДС2			=
	//Документ.СубконтоСписанияНДС3			=
	//Документ.ИспользоватьМатериалы		= Истина;
	Документ.РучнаяКорректировка			= Ложь;
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;	
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтатусПартии	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ВидНоменклатуры		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма	 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество			= СокрЛП(ТекущаяСтрока);
			
			СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			Количество			= ?(Количество="", 0, Число(Количество));
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			
			Если СтатусПартии="Принятый" И НЕ ЗагрузкаНоменклатуры Тогда
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Т00000006");
			КонецЕсли;
			
			//заполнение ТЧ документа
			Если ВидНоменклатуры="Продукция" Тогда
				НовСтр = Документ.Продукция.Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.НоменклатурнаяГруппа	= Номенклатура.НоменклатурнаяГруппа;
				НовСтр.Спецификация			= Номенклатура.ОсновнаяСпецификацияНоменклатуры;
				НовСтр.Количество			= Количество;
				//НовСтр.СуммаПлановая		= Сумма - ?(УСН, 0, СуммаНДС);
				НовСтр.СуммаПлановая		= Сумма;
				
			Иначе
				НовСтр = Документ.Материалы.Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.НоменклатурнаяГруппа	= Номенклатура.НоменклатурнаяГруппа;
				НовСтр.СтатьяЗатрат			= Номенклатура.СтатьяЗатрат;
				НовСтр.Количество			= Количество;
				//НовСтр.Себестоимость		= ?(НеЗагружатьСебестоимость, 0, Сумма - ?(УСН, 0, СуммаНДС));
				НовСтр.Себестоимость		= ?(НеЗагружатьСебестоимость, 0, Сумма);
				НовСтр.ОтражениеВУСН		= ?(УСН, Перечисления.ОтражениеВУСН.Принимаются, Перечисления.ОтражениеВУСН.НеПринимаются);
				
			КонецЕсли;
			
			СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(Организация, НовСтр.Номенклатура, Склад);
			НовСтр.Счет						= СчетаУчета.СчетУчета;
				
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
		
		Документы.ОтчетПроизводстваЗаСмену.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Продукция");
		Документы.ОтчетПроизводстваЗаСмену.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Материалы");
		
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "Продукция,Материалы");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен		 = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ОтчетПроизводстваЗаСмену") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.ОтчетПроизводстваЗаСмену");
	
	Возврат Истина;
КонецФункции //ЗагрузитьОтчетПроизводстваЗаСмену()

Функция ЗагрузитьВзаимозачет(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КонтрагентДебитор	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КонтрагентКредитор	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	КонтрагентДебитор	= НайтиОбъектПоGUID(КонтрагентДебитор);
	КонтрагентКредитор	= НайтиОбъектПоGUID(КонтрагентКредитор);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.Взаимозачет");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.ПометкаУдаления = Ложь;
		Документ.ДебиторскаяЗадолженность.Очистить();
		Документ.КредиторскаяЗадолженность.Очистить();
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.КорректировкаДолга.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация="Взаимозачет" Тогда
		ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.ВидОперации					= ВидОперации;
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.КонтрагентДебитор				= КонтрагентДебитор;
	Документ.КонтрагентКредитор				= КонтрагентКредитор;
	Документ.ВалютаДокумента				= Константы.ВалютаРегламентированногоУчета.Получить();
	Документ.КурсДокумента					= 1;
	Документ.КратностьДокумента				= 1;
	//Документ.СуммаКтЗадолженности			= 0;
	//Документ.СуммаДтЗадолженности			= 0;
	Документ.РучнаяКорректировка			= Ложь;
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);			
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ДоговорДебитор	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ДоговорКредитор	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СделкаДебитор	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СделкаКредитор	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма			= СокрЛП(ТекущаяСтрока);
			
			ДоговорДебитор	= НайтиОбъектПоGUID(ДоговорДебитор);
			ДоговорКредитор	= НайтиОбъектПоGUID(ДоговорКредитор);
			СделкаДебитор	= НайтиОбъектПоGUID(СделкаДебитор);
			СделкаКредитор	= НайтиОбъектПоGUID(СделкаКредитор);
			Сумма			= ?(Сумма="", 0, Число(Сумма));
			
			//добавляем строку по дебетору
			НовСтр = Документ.ДебиторскаяЗадолженность.Добавить();
			НовСтр.ДоговорКонтрагента		= ДоговорДебитор;
			НовСтр.Сумма					= Сумма;
			НовСтр.СуммаВзаиморасчетов		= Сумма;
			НовСтр.Сделка					= СделкаДебитор;
			НовСтр.КурсВзаиморасчетов		= 1;
			НовСтр.КратностьВзаиморасчетов	= 1;
			
			СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, КонтрагентДебитор, НовСтр.ДоговорКонтрагента);
			Если НовСтр.ДоговорКонтрагента.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
				НовСтр.СчетУчетаРасчетов	= СчетаУчета.СчетАвансов;
			ИначеЕсли НовСтр.ДоговорКонтрагента.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
				НовСтр.СчетУчетаРасчетов	= СчетаУчета.СчетРасчетовПокупателя;
			КонецЕсли;
			
			//добавляем строку по кредитору
			НовСтр = Документ.КредиторскаяЗадолженность.Добавить();
			НовСтр.ДоговорКонтрагента		= ДоговорКредитор;
			НовСтр.Сумма					= Сумма;
			НовСтр.СуммаВзаиморасчетов		= Сумма;
			НовСтр.Сделка					= СделкаКредитор;
			НовСтр.КурсВзаиморасчетов		= 1;
			НовСтр.КратностьВзаиморасчетов	= 1;
		
			СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, КонтрагентКредитор, НовСтр.ДоговорКонтрагента);
			Если НовСтр.ДоговорКонтрагента.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
				НовСтр.СчетУчетаРасчетов	= СчетаУчета.СчетРасчетов;
			ИначеЕсли НовСтр.ДоговорКонтрагента.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
				НовСтр.СчетУчетаРасчетов	= СчетаУчета.СчетАвансовПокупателя;
			КонецЕсли;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "ДебиторскаяЗадолженность,КредиторскаяЗадолженность");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен		 = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.Взаимозачет") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.Взаимозачет");
	
	Возврат Истина;
КонецФункции //ЗагрузитьВзаимозачет()

Функция ЗагрузитьКорректировкуДолга(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СтатьяДохода		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");	
	СтатьяРасхода		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");	
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	СтатьяДохода		= НайтиОбъектПоGUID(СтатьяДохода);
	СтатьяРасхода		= НайтиОбъектПоGUID(СтатьяРасхода);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.КорректировкаДолга");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.ПометкаУдаления = Ложь;
		Документ.ДебиторскаяЗадолженность.Очистить();
		Документ.КредиторскаяЗадолженность.Очистить();
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.КорректировкаДолга.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация="КорректировкаДолга" Тогда
		ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.ВидОперации					= ВидОперации;
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.КонтрагентДебитор				= Контрагент;
	Документ.КонтрагентКредитор				= Контрагент;
	Документ.ВалютаДокумента				= Константы.ВалютаРегламентированногоУчета.Получить();
	Документ.КурсДокумента					= 1;
	Документ.КратностьДокумента				= 1;
	//Документ.СуммаКтЗадолженности			= 0;
	//Документ.СуммаДтЗадолженности			= 0;
	Документ.СчетДт							= ПланыСчетов.Хозрасчетный.ПрочиеРасходы;
	Документ.СубконтоДт1					= СтатьяРасхода;
	Документ.СчетКт							= ПланыСчетов.Хозрасчетный.ПрочиеДоходы;
	Документ.СубконтоКт1					= СтатьяДохода;
	Документ.РучнаяКорректировка			= Ложь;
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);			
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			Договор			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			УвеличениеДолга	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			УменьшениеДолга	= СокрЛП(ТекущаяСтрока);
			
			УвеличениеДолга	= ?(УвеличениеДолга="", 0, Число(УвеличениеДолга));
			УменьшениеДолга	= ?(УменьшениеДолга="", 0, Число(УменьшениеДолга));
			Договор			= НайтиОбъектПоGUID(Договор);
			Сумма			= УвеличениеДолга - УменьшениеДолга;
			
			Если Сумма>0 Тогда
				НовСтр = Документ.ДебиторскаяЗадолженность.Добавить();
				НовСтр.Сумма				= Сумма;
			Иначе
				НовСтр = Документ.КредиторскаяЗадолженность.Добавить();
				НовСтр.Сумма				= -Сумма;
			КонецЕсли;
			НовСтр.ДоговорКонтрагента		= Договор;
			НовСтр.КурсВзаиморасчетов		= 1;
			НовСтр.КратностьВзаиморасчетов	= 1;
			НовСтр.СуммаВзаиморасчетов		= НовСтр.Сумма;
		
			СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, НовСтр.ДоговорКонтрагента);
			Если НовСтр.ДоговорКонтрагента.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
				НовСтр.СчетУчетаРасчетов	= ?(Сумма>0, СчетаУчета.СчетАвансов, СчетаУчета.СчетРасчетов);
			ИначеЕсли НовСтр.ДоговорКонтрагента.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
				НовСтр.СчетУчетаРасчетов	= ?(Сумма>0, СчетаУчета.СчетРасчетовПокупателя, СчетаУчета.СчетАвансовПокупателя);
			КонецЕсли;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "ДебиторскаяЗадолженность,КредиторскаяЗадолженность");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.КорректировкаДолга") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.КорректировкаДолга");
	
	Возврат Истина;	
КонецФункции //ЗагрузитьКорректировкуДолга()

Функция ЗагрузитьСчетФактураПолученный(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	// Читаем данные по документу
	ТекущаяСтрока		= УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока = Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID 				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Договор 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерВх				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаВх				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Основание			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ОснованиеИмя		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВидСчФ				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ПервНомерВх			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ПервДатаВх			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);	
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	Договор				= НайтиОбъектПоGUID(Договор);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	СчетУчетаНДСВх		= ПланыСчетов.Хозрасчетный.НайтиПоКоду("19.03");
	НомерВх				= ?(ЗначениеЗаполнено(НомерВх), ВосстПредстРеквизита(НомерВх), "Без номера");
	ДатаВх				= ?(ЗначениеЗаполнено(Дата(ДатаВх)), Дата(ДатаВх), ДатаДокумента);
	ПервНомерВх			= ?(ЗначениеЗаполнено(ПервНомерВх), ВосстПредстРеквизита(ПервНомерВх), "Без номера");
	ПервДатаВх			= ?(ЗначениеЗаполнено(Дата(ПервДатаВх)), Дата(ПервДатаВх), ДатаДокумента);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(Основание, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	Иначе
		ОснованиеДляСчФ = НайтиОбъектПоGUID(Основание, "Документ."+НайтиСоответствиеДокумента(ОснованиеИмя));
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ОснованиеДляСчФ) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	//Попытаемся найти счет-фактуру
	НайденДокумент = Ложь;
	СчетФактура = обНайтиПодчиненныйСчФ(ОснованиеДляСчФ, "СчетФактураПолученный");
	
	// Создаем документ
	ОбъектСчетаФактуры = Неопределено;
	Если обЗначениеНеЗаполнено(СчетФактура) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
		
		Попытка
			ОбъектСчетаФактуры = Документы.СчетФактураПолученный.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	Иначе
		Попытка
			ОбъектСчетаФактуры = СчетФактура.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		НайденДокумент = Истина;
	КонецЕсли;
	
	ОбъектСчетаФактуры.ВидСчетаФактуры = ?(ВидСчФ="1", Перечисления.ВидСчетаФактурыПолученного.НаПоступление, Перечисления.ВидСчетаФактурыПолученного.Корректировочный);
	Если НЕ НайденДокумент Тогда
		Попытка
			ОбъектСчетаФактуры.Заполнить(ОснованиеДляСчФ);
		Исключение
			ТекстСообщения = "Не удалось создать документ Счет-фактура на основании: "+ОснованиеДляСчФ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
				
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;
		КонецПопытки;
	КонецЕсли;
	ОбъектСчетаФактуры.Дата							= ДатаДокумента;
	ОбъектСчетаФактуры.ДокументОснование			= ОснованиеДляСчФ;
	ОбъектСчетаФактуры.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	ОбъектСчетаФактуры.Ответственный				= ОснованиеДляСчФ.Ответственный;
	ОбъектСчетаФактуры.Контрагент					= ОснованиеДляСчФ.Контрагент;
	ОбъектСчетаФактуры.ДоговорКонтрагента			= ОснованиеДляСчФ.ДоговорКонтрагента;
	ОбъектСчетаФактуры.Организация					= ОснованиеДляСчФ.Организация;
	ОбъектСчетаФактуры.РучнаяКорректировка			= Ложь;
	ОбъектСчетаФактуры.НомерВходящегоДокумента		= НомерВх;
	ОбъектСчетаФактуры.ДатаВходящегоДокумента		= ДатаВх;
	Если ВидСчФ="2" Тогда //корректировочный счф
		ОбъектСчетаФактуры.НомерИсходногоДокумента	= ПервНомерВх;
		ОбъектСчетаФактуры.ДатаИсходногоДокумента	= ПервДатаВх;
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		ОбъектСчетаФактуры.Номер					= НомерДокумента;		
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			ОбъектСчетаФактуры.ПометкаУдаления	= Истина;
			ОбъектСчетаФактуры.Проведен			= Ложь;
			ОбъектСчетаФактуры.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			ОбъектСчетаФактуры.ПометкаУдаления	= Ложь;
			ОбъектСчетаФактуры.Проведен			= Ложь;
			ОбъектСчетаФактуры.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			ОбъектСчетаФактуры.ПометкаУдаления	= Ложь;
			Попытка
				Если НеПроводить Тогда
					ОбъектСчетаФактуры.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					ОбъектСчетаФактуры.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+ОбъектСчетаФактуры+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				ОбъектСчетаФактуры.ПометкаУдаления	= Ложь;
				ОбъектСчетаФактуры.Проведен			= Ложь;
				ОбъектСчетаФактуры.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+ОбъектСчетаФактуры+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(ОбъектСчетаФактуры.Ссылка, GUID, "Документ.СчетФактураПолученный") Тогда
			ЗафиксироватьТранзакцию();	
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.СчетФактураПолученный");
	
	Возврат Истина;
КонецФункции //ЗагрузитьСчетФактураПолученный()

Функция ЗагрузитьСчетФактураВыданный(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID 				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Договор				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерОснования		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаОснования		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Основание			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ОснованиеИмя		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВидСчФ				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
				
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	Договор				= НайтиОбъектПоGUID(Договор);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	НомерОснования		= ?(ЗначениеЗаполнено(НомерОснования), ВосстПредстРеквизита(НомерОснования), "Без номера");
	ДатаОснования		= ?(ЗначениеЗаполнено(Дата(ДатаОснования)), Дата(ДатаОснования), ДатаДокумента);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(Основание, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	Иначе
		ОснованиеДляСчФ = НайтиОбъектПоGUID(Основание, "Документ."+НайтиСоответствиеДокумента(ОснованиеИмя));
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ОснованиеДляСчФ) ИЛИ ТипЗнч(ОснованиеДляСчФ)=Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
		
	//Попытаемся найти счет-фактуру
	НайденДокумент = Ложь;
	СчетФактура = обНайтиПодчиненныйСчФ(ОснованиеДляСчФ, "СчетФактураВыданный");
	ОбъектСчетаФактуры = Неопределено;
	
	// Создаем документ
	Если обЗначениеНеЗаполнено(СчетФактура) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
		
		Попытка
			ОбъектСчетаФактуры = Документы.СчетФактураВыданный.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	Иначе
		Попытка
			ОбъектСчетаФактуры = СчетФактура.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		НайденДокумент = Истина;
	КонецЕсли;
	
	ОбъектСчетаФактуры.ВидСчетаФактуры = ?(ВидСчФ="1", Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию, Перечисления.ВидСчетаФактурыВыставленного.Корректировочный);
	Если НЕ НайденДокумент Тогда
		Попытка
			ОбъектСчетаФактуры.Заполнить(ОснованиеДляСчФ);
		Исключение
			ТекстСообщения = "Не удалось создать документ Счет-фактура на основании: "+ОснованиеДляСчФ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
				
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;
		КонецПопытки;
	КонецЕсли;
	ОбъектСчетаФактуры.Дата							= ДатаДокумента;
	ОбъектСчетаФактуры.ДокументОснование			= ОснованиеДляСчФ;
	ОбъектСчетаФактуры.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	ОбъектСчетаФактуры.Ответственный				= ОснованиеДляСчФ.Ответственный;
	ОбъектСчетаФактуры.Контрагент					= ОснованиеДляСчФ.Контрагент;
	ОбъектСчетаФактуры.ДоговорКонтрагента			= ОснованиеДляСчФ.ДоговорКонтрагента;
	ОбъектСчетаФактуры.Организация					= ОснованиеДляСчФ.Организация;
	ОбъектСчетаФактуры.РучнаяКорректировка			= Ложь;
	Если НеМенятьНомерИсхСчФ ИЛИ НеМенятьНомераДок Тогда
		ОбъектСчетаФактуры.Номер					= НомерДокумента;		
	КонецЕсли;
	Если ВидСчФ="2" Тогда //корректировочный счф
		ОбъектСчетаФактуры.НомерИсходногоДокумента	= НомерОснования;
		ОбъектСчетаФактуры.ДатаИсходногоДокумента	= ДатаОснования;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			ОбъектСчетаФактуры.ПометкаУдаления	= Истина;
			ОбъектСчетаФактуры.Проведен			= Ложь;
			ОбъектСчетаФактуры.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			ОбъектСчетаФактуры.ПометкаУдаления	= Ложь;
			ОбъектСчетаФактуры.Проведен			= Ложь;
			ОбъектСчетаФактуры.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			ОбъектСчетаФактуры.ПометкаУдаления	= Ложь;
			Попытка
				Если НеПроводить Тогда
					ОбъектСчетаФактуры.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					ОбъектСчетаФактуры.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+ОбъектСчетаФактуры+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				ОбъектСчетаФактуры.ПометкаУдаления	= Ложь;
				ОбъектСчетаФактуры.Проведен			= Ложь;
				ОбъектСчетаФактуры.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+ОбъектСчетаФактуры+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;			
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(ОбъектСчетаФактуры.Ссылка, GUID, "Документ.СчетФактураВыданный") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.СчетФактураВыданный");
	
	Возврат Истина;
КонецФункции //ЗагрузитьСчетФактураВыданный()

Функция ЗагрузитьПлатежноеПоручение(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СчетОрганизации		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СчетКонтрагента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СтатьяДДС			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВидПлатежа			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ОчередностьПлатежа	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИдентПлатежа		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ПеречислениеВБюджет = СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НазначениеПлатежа	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	СчетОрганизации		= НайтиОбъектПоGUID(СчетОрганизации);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	СчетКонтрагента		= НайтиОбъектПоGUID(СчетКонтрагента);
	СтатьяДДС			= НайтиОбъектПоGUID(СтатьяДДС);
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ПлатежноеПоручение");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.ПлатежноеПоручение.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация="ПлатежноеПоручение" ИЛИ ХозОперация="ЗаявкаНаРасходДенежныхСредствБанк" Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(СчетОрганизации) ИЛИ обЗначениеНеЗаполнено(СчетКонтрагента) Тогда
		АвтоЗначенияРеквизитов = Неопределено;
	Иначе
		АвтоЗначенияРеквизитов = УчетДенежныхСредствБП.СформироватьАвтоЗначенияРеквизитовПлательщикаПолучателя(Организация, СчетОрганизации, Контрагент, СчетКонтрагента, ПеречислениеВБюджет);
	КонецЕсли;
	
	Документ.Дата							= ДатаДокумента;
	Документ.ВидОперации					= ВидОперации;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.СчетОрганизации				= СчетОрганизации;
	Документ.ИННПлательщика					= ?(АвтоЗначенияРеквизитов=Неопределено, "", АвтоЗначенияРеквизитов.ИННПлательщика);
	Документ.КПППлательщика					= ?(АвтоЗначенияРеквизитов=Неопределено, "", АвтоЗначенияРеквизитов.КПППлательщика);
	Документ.ТекстПлательщика				= ?(АвтоЗначенияРеквизитов=Неопределено, "", АвтоЗначенияРеквизитов.ТекстПлательщика);
	Документ.Контрагент						= Контрагент;
	Документ.СчетКонтрагента				= СчетКонтрагента;
	Документ.ИННПолучателя					= ?(АвтоЗначенияРеквизитов=Неопределено, "", АвтоЗначенияРеквизитов.ИННПолучателя);
	Документ.КПППолучателя					= ?(АвтоЗначенияРеквизитов=Неопределено, "", АвтоЗначенияРеквизитов.КПППолучателя);
	Документ.ТекстПолучателя				= ?(АвтоЗначенияРеквизитов=Неопределено, "", АвтоЗначенияРеквизитов.ТекстПолучателя);
	Документ.ДоговорКонтрагента				= Неопределено;
	Документ.ВидПлатежа						= ВосстПредстРеквизита(ВидПлатежа);
	Документ.ОчередностьПлатежа				= ОчередностьПлатежа;
	Документ.НазначениеПлатежа				= ВосстПредстРеквизита(НазначениеПлатежа);
	Документ.ВалютаДокумента				= Константы.ВалютаРегламентированногоУчета.Получить();
	Документ.ПеречислениеВБюджет			= ПеречислениеВБюджет;
	Документ.КодОКАТО						= ?(ПеречислениеВБюджет, Организация.КодПоОКАТО, "");
	Документ.СтавкаНДС						= Неопределено;
	Документ.СуммаНДС						= 0;
	Документ.СуммаДокумента					= 0;
	Документ.СтатьяДвиженияДенежныхСредств	= СтатьяДДС;
	//Документ.ИдентификаторПлатежа			= ВосстПредстРеквизита(ИдентПлатежа);
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;
	КонецЕсли;
	//Если НеМенятьНомераДок Тогда
	//	Документ.Номер						= НомерДокумента;		
	//КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);			
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			Договор			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДС		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДСИмя	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма			= СокрЛП(ТекущаяСтрока);
			
			Сумма			= ?(Сумма="", 0, Число(Сумма));
			СуммаНДС		= ?(СуммаНДС="", 0, Число(СуммаНДС));
			СтавкаНДС		= ПолучитьЗначениеРеквизита(СтавкаНДС, СтавкаНДСИмя);
			Договор			= НайтиОбъектПоGUID(Договор);
			
			Если обЗначениеНеЗаполнено(Документ.ДоговорКонтрагента) Тогда
				Документ.ДоговорКонтрагента = Договор;
			КонецЕсли;
			Если обЗначениеНеЗаполнено(Документ.СтавкаНДС) Тогда
				Документ.СтавкаНДС = СтавкаНДС;
			КонецЕсли;
			Документ.СуммаДокумента = Документ.СуммаДокумента + Сумма;
			Документ.СуммаНДС		= Документ.СуммаНДС + СуммаНДС;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ);
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить ИЛИ НЕ ПроводитьПП Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли
		////Установим статус
		//Если РегистрыСведений.СостоянияБанковскихДокументов.ТекущееСостояниеДокумента(Документ.Ссылка)<>Неопределено Тогда
		//	РегистрыСведений.СостоянияБанковскихДокументов.УстановитьСостояниеДокумента(Документ.Ссылка, "Подготовлено");
		//КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ПлатежноеПоручение") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.ПлатежноеПоручение");
	
	Возврат Истина;	
КонецФункции //ЗагрузитьПлатежноеПоручение()

Функция ЗагрузитьОтчетКомитенту(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
			
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Договор				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ПроцентВозн			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	Договор				= НайтиОбъектПоGUID(Договор);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	ПроцентВозн			= ?(ПроцентВозн="", 0, Число(ПроцентВозн));
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОтчетКомитентуОПродажах");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, Договор);
	УСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, ДатаДокумента);
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.Товары.Очистить();
		Документ.ДенежныеСредства.Очистить();
		Документ.Поставщики.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.ОтчетКомитентуОПродажах.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация="ОтчетКомитенту" Тогда
		ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата										= ДатаДокумента;
	Документ.ВидОперации								= ВидОперации;
	Документ.Комментарий								= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный								= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация								= Организация;
	Документ.Контрагент									= Контрагент;
	Документ.ДоговорКонтрагента							= ПроверкаДоговора(Договор, Документ);
	Документ.ВалютаДокумента							= Константы.ВалютаРегламентированногоУчета.Получить();
	Документ.КурсВзаиморасчетов							= 1;
	Документ.КратностьВзаиморасчетов					= 1;
	Документ.СуммаВключаетНДС							= Истина;
	Документ.УдержатьВознаграждение						= Истина;
	Документ.СпособРасчетаКомиссионногоВознаграждения	= Документ.ДоговорКонтрагента.СпособРасчетаКомиссионногоВознаграждения;
	Документ.ПроцентКомиссионногоВознаграждения			= Документ.ДоговорКонтрагента.ПроцентКомиссионногоВознаграждения;
	Документ.СтавкаНДСВознаграждения					= ?(УСН, Перечисления.СтавкиНДС.БезНДС, ?(ДатаДокумента>=Дата("20190101"), Перечисления.СтавкиНДС.НДС20, Перечисления.СтавкиНДС.НДС18));
	Документ.СчетУчетаНДСПоРеализации					= ПланыСчетов.Хозрасчетный.Продажи_НДС;
	Документ.СчетДоходов								= ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД;
	Документ.РучнаяКорректировка						= Ложь;
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации				= Подразделение;	
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер									= НомерДокумента;		
	КонецЕсли;
	
	Документы.ОтчетКомитентуОПродажах.ЗаполнитьСчетаУчетаРасчетов(Документ, СчетаУчета);

	НовСтр = Документ.Поставщики.Добавить();
	НовСтр.Поставщик		= Контрагент;
	//НовСтр.Партия			=
	//НовСтр.ПолученСФ		=
	//НовСтр.ДатаСФ			=
	//НовСтр.СчетФактура	=
	НовСтр.КлючСтроки		= 0;
	//НовСтр.НомерСчетаФактуры
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДС		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДСИмя	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма	 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаПоступления	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Вознаграждение		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество			= СокрЛП(ТекущаяСтрока);
			
			СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			СуммаПоступления	= ?(СуммаПоступления="", 0, Число(СуммаПоступления));
			Вознаграждение		= ?(Вознаграждение="", 0, Число(Вознаграждение));
			Количество			= ?(Количество="", 0, Число(Количество));
			СтавкаНДС			= ПолучитьЗначениеРеквизита(СтавкаНДС, СтавкаНДСИмя);
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			
			Если НЕ ЗагрузкаНоменклатуры Тогда
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Т00000006");
			КонецЕсли;
			
			//заполнение ТЧ документа
			НовСтр = Документ.Товары.Добавить();
			НовСтр.Номенклатура 			= Номенклатура;
			НовСтр.Количество				= Количество;
			НовСтр.СтавкаНДС				= СтавкаНДС;
			НовСтр.СуммаНДС					= СуммаНДС;
			НовСтр.Сумма					= Сумма;
			НовСтр.СуммаПоступления			= СуммаПоступления;
			НовСтр.СуммаВознаграждения		= Вознаграждение;
			НовСтр.СуммаНДСВознаграждения	= ?(УСН, 0, ?(ДатаДокумента>=Дата("20190101"), НовСтр.СуммаВознаграждения*20/120, НовСтр.СуммаВознаграждения*18/118));
			НовСтр.КлючСтроки				= 0;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "Товары");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ОтчетКомитентуОПродажах") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.ОтчетКомитенту");
	
	Возврат Истина;	
КонецФункции //ЗагрузитьОтчетКомитенту()

Функция ЗагрузитьОтчетКомиссионера(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
			
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Договор				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерВх				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаВх				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ПроцентВозн			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");	//Биопродукты
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	Договор				= НайтиОбъектПоGUID(Договор);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	НомерВх				= ?(ЗначениеЗаполнено(НомерВх), ВосстПредстРеквизита(НомерВх), "Без номера");
	ДатаВх				= ?(ЗначениеЗаполнено(Дата(ДатаВх)), Дата(ДатаВх), ДатаДокумента);
	ПроцентВозн			= ?(ПроцентВозн="", 0, Число(ПроцентВозн));
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОтчетКомиссионераОПродажах");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, Контрагент, Договор);
	УСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, ДатаДокумента);
	ОргБезНДС = УчетнаяПолитика.ПлательщикНДС(Организация, ДатаДокумента);
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.Товары.Очистить();
		Документ.Услуги.Очистить();
		Документ.ДенежныеСредства.Очистить();
		Документ.ЗачетАвансов.Очистить();
		Документ.Покупатели.Очистить();
		Документ.Возвраты.Очистить();
		Документ.ТоварыВозвращенные.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.ОтчетКомиссионераОПродажах.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация<>"ОтчетКомиссионера" Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата										= ДатаДокумента;
	Документ.Комментарий								= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный								= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация								= Организация;
	Документ.Контрагент									= Контрагент;
	Документ.ДоговорКонтрагента							= Договор;
	Документ.ВалютаДокумента							= Константы.ВалютаРегламентированногоУчета.Получить();
	Документ.КурсВзаиморасчетов							= 1;
	Документ.КратностьВзаиморасчетов					= 1;
	Документ.СпособЗачетаАвансов						= Перечисления.СпособыЗачетаАвансов.Автоматически;
	Документ.СуммаВключаетНДС							= Истина;
	Документ.НДСВключенВСтоимость						= УСН;
	//Документ.СпособУчетаНДС							= Перечисления.СпособыУчетаНДС.УчитываетсяВCтоимости;
	Документ.СпособРасчетаКомиссионногоВознаграждения	= Документ.ДоговорКонтрагента.СпособРасчетаКомиссионногоВознаграждения;
	Документ.ПроцентКомиссионногоВознаграждения			= Документ.ДоговорКонтрагента.ПроцентКомиссионногоВознаграждения;
	Документ.СтавкаНДСВознаграждения					= ?(ДатаДокумента>=Дата("20190101"), Перечисления.СтавкиНДС.НДС20, Перечисления.СтавкиНДС.НДС18);
	Документ.УдержатьВознаграждение						= Истина;
	Документ.СчетУчетаЗатрат							= ПланыСчетов.Хозрасчетный.ИздержкиОбращения;
	Документ.НомерВходящегоДокумента					= НомерВх;
	Документ.ДатаВходящегоДокумента						= ДатаВх;
	Документ.ДокументБезНДС								= Ложь;
	Документ.РучнаяКорректировка						= Ложь;
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации				= Подразделение;	
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер									= НомерДокумента;		
	КонецЕсли;
	
	НовСтр = Документ.Покупатели.Добавить();
	НовСтр.Покупатель		= Контрагент;
	//НовСтр.ВыставленСФ	=
	//НовСтр.ДатаСФ			=
	//НовСтр.СчетФактура	=
	НовСтр.КлючСтроки		= 0;
	
	Документы.ОтчетКомиссионераОПродажах.ЗаполнитьСчетаУчетаРасчетов(СчетаУчета,,Документ);
		
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтатусПартии	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			НомерГТД		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			КодСтраны		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДС		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДСИмя	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма	 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Себестоимость		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДССеб			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаПередачи		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Вознаграждение		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество 			= СокрЛП(ТекущаяСтрока);
			
			СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			Себестоимость		= ?(Себестоимость="", 0, Число(Себестоимость));
			СуммаНДССеб			= ?(СуммаНДССеб="", 0, Число(СуммаНДССеб));
			СуммаПередачи		= ?(СуммаПередачи="", 0, Число(СуммаПередачи));
			Вознаграждение		= ?(Вознаграждение="", 0, Число(Вознаграждение));
			Количество			= ?(Количество="", 0, Число(Количество));
			СтавкаНДС			= ПолучитьЗначениеРеквизита(СтавкаНДС, СтавкаНДСИмя);
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			НомерГТД			= ВосстПредстРеквизита(НомерГТД);
			
			Если СтатусПартии="Принятый" И НЕ ЗагрузкаНоменклатуры Тогда
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Т00000006");
			КонецЕсли;
			
			//Если Документ.СпособРасчетаКомиссионногоВознаграждения=Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтСуммыПродажи Тогда
			//	Вознаграждение	= Окр(Сумма*ПроцентВозн/100, 2);
			//ИначеЕсли Документ.СпособРасчетаКомиссионногоВознаграждения=Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтРазностиСуммПродажиИПоступления Тогда 
			//	Вознаграждение	= Окр((Сумма-Себестоимость)*ПроцентВозн/100, 2);
			//КонецЕсли;
			
			//заполнение ТЧ документа
			Если Номенклатура.Услуга Тогда
				НовСтр = Документ.Услуги.Добавить();
				НовСтр.Номенклатура				= Номенклатура;
				НовСтр.Количество				= Количество;
				НовСтр.СтавкаНДС				= СтавкаНДС;
				НовСтр.СуммаНДС					= СуммаНДС;
				НовСтр.Сумма					= Сумма;
				НовСтр.СуммаВознаграждения		= Вознаграждение;
				НовСтр.СуммаНДСВознаграждения	= ?(УСН, 0, ?(ДатаДокумента>=Дата("20190101"), НовСтр.СуммаВознаграждения*20/120, НовСтр.СуммаВознаграждения*18/118));
				НовСтр.КлючСтроки				= 0;
			Иначе
				НовСтр = Документ.Товары.Добавить();
				НовСтр.Номенклатура				= Номенклатура;
				НовСтр.Количество				= Количество;
				НовСтр.СтавкаНДС				= СтавкаНДС;
				НовСтр.СуммаНДС					= СуммаНДС;
				НовСтр.Сумма					= Сумма;
				НовСтр.СуммаПередачи			= СуммаПередачи;
				НовСтр.СуммаВознаграждения		= Вознаграждение;
				НовСтр.СуммаНДСВознаграждения	= ?(УСН, 0, ?(ДатаДокумента>=Дата("20190101"), НовСтр.СуммаВознаграждения*20/120, НовСтр.СуммаВознаграждения*18/118));
				НовСтр.Себестоимость			= ?(НеЗагружатьСебестоимость, 0, Себестоимость - ?(УСН, 0, СуммаНДССеб));
				НовСтр.КлючСтроки				= 0;
				
				Если ТипЗнч(НовСтр.Субконто)=Тип("СправочникСсылка.НоменклатурныеГруппы") И ЗначениеЗаполнено(Номенклатура.НоменклатурнаяГруппа) Тогда
					НовСтр.Субконто				= Номенклатура.НоменклатурнаяГруппа;
				КонецЕсли;
				
				// Установка номера ГТД
				Если НомерГТД<>"" И НЕ Номенклатура.Услуга Тогда
					СпрСтрана = Справочники.СтраныМира.НайтиПоКоду(КодСтраны);
					СпрГТД = Справочники.НомераГТД.НайтиПоКоду(НомерГТД);
					Если ЗначениеЗаполнено(СпрГТД) Тогда
						НовСтр.НомерГТД = СпрГТД;
						НовСтр.СтранаПроисхождения = СпрСтрана;
					Иначе
						Попытка
							НовыйГТД = Справочники.НомераГТД.СоздатьЭлемент();
							НовыйГТД.Код = НомерГТД;
							НовыйГТД.Записать();
							НовСтр.НомерГТД = НовыйГТД.Ссылка;
							НовСтр.СтранаПроисхождения = СпрСтрана;
						Исключение
							ТекстСообщения = "Не удалось записать номер ГТД ("+НомерГТД+")";
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
							Лог.ДобавитьСтроку(ТекстСообщения);
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
		
		Документы.ОтчетКомиссионераОПродажах.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Товары");
		Документы.ОтчетКомиссионераОПродажах.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Услуги");
		
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "Товары,Услуги");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ОтчетКомиссионераОПродажах") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.ОтчетКомиссионера");
	
	Возврат Истина;	
КонецФункции //ЗагрузитьОтчетКомиссионера()

Функция ЗагрузитьПереоценка(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
			
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Склад				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Склад				= НайтиОбъектПоGUID(Склад);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ПереоценкаТоваровВРознице");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	СпособОценкиТоваров = УчетнаяПолитика.СпособОценкиТоваровВРознице(Организация, ДатаДокумента);
	Если СпособОценкиТоваров=Перечисления.СпособыОценкиТоваровВРознице.ПоСтоимостиПриобретения Тогда
		Если НайденДокумент Тогда
			ТекущийСтатус = Мин(Число(ТекущийСтатус), 1);
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	//УСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, ДатаДокумента);
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.Товары.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.ПереоценкаТоваровВРознице.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация<>"ПереоценкаТоваровВРознице" Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.Склад							= Склад;
	//Документ.ДокументУстановкиЦен			= Неопределено;
	Документ.РучнаяКорректировка			= Ложь;
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;	
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Цена			 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ЦенаСтарая		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма	 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаУценки			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			КоличествоУценки	= СокрЛП(ТекущаяСтрока);
			
			Цена				= ?(Цена="", 0, Число(Цена));
			ЦенаСтарая			= ?(ЦенаСтарая="", 0, Число(ЦенаСтарая));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			Количество			= ?(Количество="", 0, Число(Количество));
			СуммаУценки			= ?(СуммаУценки="", 0, Число(СуммаУценки));
			КоличествоУценки	= ?(КоличествоУценки="", 0, Число(КоличествоУценки));
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			
			Если Сумма <> 0 Тогда 
				НовСтр = Документ.Товары.Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.Количество			= Количество;
				НовСтр.ЦенаВРозницеСтарая	= ЦенаСтарая;
				НовСтр.ЦенаВРознице			= Цена;
				НовСтр.СуммаПереоценки		= Сумма;
			КонецЕсли;
			Если СуммаУценки <> 0 Тогда 
				НовСтр = Документ.Товары.Добавить();
				НовСтр.Номенклатура			= Номенклатура;
				НовСтр.Количество			= КоличествоУценки;
				НовСтр.ЦенаВРозницеСтарая	= ЦенаСтарая;
				НовСтр.ЦенаВРознице			= Цена;
				НовСтр.СуммаПереоценки		= -СуммаУценки;
			КонецЕсли;
			
				
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
		
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "Товары");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен		 = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
		//Трофимова 04.02.2019 +++
		//пометим на удаление документы с суммой переоценки = 0;
		Если Документ.Товары.Итог("СуммаПереоценки") = 0 Тогда 
			Документ.УстановитьПометкуУдаления(Истина);
			Документ.Записать();
		КонецЕсли;
		//Трофимова 04.02.2019 --- 
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ПереоценкаТоваровВРознице") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.Переоценка");
	
	Возврат Истина;
КонецФункции //ЗагрузитьПереоценка()

Функция ЗагрузитьАвансовыйОтчет(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
	
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Сотрудник			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Сотрудник			= НайтиОбъектПоGUID(Сотрудник);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.АвансовыйОтчет");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.ВыданныеАвансы.Очистить();
		Документ.Товары.Очистить();
		Документ.ВозвратнаяТара.Очистить();
		Документ.ОплатаПоставщикам.Очистить();
		Документ.Прочее.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.АвансовыйОтчет.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация<>"АвансовыйОтчет" Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.ФизЛицо						= Сотрудник;
	Документ.ВалютаДокумента				= Константы.ВалютаРегламентированногоУчета.Получить();
	Документ.КурсДокумента					= 1;
	Документ.КратностьДокумента				= 1;
	Документ.СуммаВключаетНДС				= Истина;
	Документ.НДСВключенВСтоимость			= Истина;
	Документ.НДСНеВыделять					= Ложь;
	Документ.РучнаяКорректировка			= Ложь;
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;
	КонецЕсли;
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);			
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			Контрагент		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Договор			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ДокументРасхода	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Содержание		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма			= СокрЛП(ТекущаяСтрока);
			
			Контрагент		= НайтиОбъектПоGUID(Контрагент);
			Договор			= НайтиОбъектПоGUID(Договор);
			Сумма			= ?(Сумма="", 0, Число(Сумма));
			
			//добавляем строку по дебетору
			НовСтр = Документ.ОплатаПоставщикам.Добавить();
			НовСтр.Контрагент					= Контрагент;
			НовСтр.ДоговорКонтрагента			= Договор;
			НовСтр.ВидДокВходящий				= ДокументРасхода;
			НовСтр.Содержание					= Содержание;
			НовСтр.Сумма						= Сумма;
			НовСтр.СуммаВзаиморасчетов			= Сумма;
			НовСтр.КурсВзаиморасчетов			= 1;
			НовСтр.КратностьВзаиморасчетов		= 1;
			//НовСтр.Сделка						= ;
			НовСтр.СпособПогашенияЗадолженности	= Перечисления.СпособыПогашенияЗадолженности.Автоматически;
			
			СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(Организация, НовСтр.Контрагент, НовСтр.ДоговорКонтрагента);
			Если НовСтр.ДоговорКонтрагента.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СКомитентом
				ИЛИ НовСтр.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку Тогда
				НовСтр.СчетУчетаРасчетовСКонтрагентом	= СчетаУчета.СчетРасчетовСКомитентом;
			Иначе
				НовСтр.СчетУчетаРасчетовСКонтрагентом	= СчетаУчета.СчетРасчетов;
			КонецЕсли;
			НовСтр.СчетУчетаРасчетовПоАвансам = СчетаУчета.СчетАвансов;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "ОплатаПоставщикам");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен		 = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.АвансовыйОтчет") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.АвансовыйОтчет");
	
	Возврат Истина;
КонецФункции //ЗагрузитьАвансовыйОтчет()

Функция ЗагрузитьВводОстатковТоваров(ТекущаяСтрока, НомерТекущейСтроки, НомерПрохода)
	Если НомерПрохода=1 Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);       
		Возврат Истина;
	КонецЕсли;
			
	// Читаем данные по документу
	ТекущаяСтрока = УбратьСимволы(ТекущаяСтрока,"""{}");
	ПозицияСимвола		= Найти(ТекущаяСтрока,","); ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ИмяДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ХозОперация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ДатаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	НомерДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	GUID				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ТекущийСтатус		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ВалютаДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	КурсДокумента		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Организация			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Подразделение 		= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Контрагент			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Договор				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Склад				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	Статья				= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	СтатьяНаименование	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
	ЗамещатьПроводки	= СокрЛП(ТекущаяСтрока);
	
	ИмяДокумента		= ВосстПредстРеквизита(ИмяДокумента);
	Организация			= НайтиОбъектПоGUID(Организация);
	Подразделение		= НайтиОбъектПоGUID(Подразделение);
	Контрагент			= НайтиОбъектПоGUID(Контрагент);
	Договор				= НайтиОбъектПоGUID(Договор);
	Склад				= НайтиОбъектПоGUID(Склад);
	ВалютаДокумента		= НайтиОбъектПоGUID(ВалютаДокумента);
	КурсДокумента		= ?(КурсДокумента="", 1, Число(КурсДокумента));
	ДатаДокумента		= Дата(ДатаДокумента);
	ЗамещатьПроводки	= (ЗамещатьПроводки="Истина");
	
	//Если уже есть Операция, то документ не загружаем
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ОперацияБух");
	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;	
	КонецЕсли;
	
	// Создаем документ
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.ВводНачальныхОстатков");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то грузить его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат Истина;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	УСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, ДатаДокумента);
	ОргБезНДС = УчетнаяПолитика.ПлательщикНДС(Организация, ДатаДокумента);
	УчетПоРозЦенам = (УчетнаяПолитика.СпособОценкиТоваровВРознице(Организация, ДатаДокумента)=Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости);
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
		Документ.ОС.Очистить();
		Документ.НМА.Очистить();
		Документ.РасчетыСКонтрагентами.Очистить();
		Документ.РасчетыПоНалогамИСборам.Очистить();
		Документ.РасчетыПоЗаработнойПлате.Очистить();
		Документ.БухСправка.Очистить();
		Документ.РасчетыСПодотчетнымиЛицами.Очистить();
		Документ.МПЗОтгруженные.Очистить();
		Документ.ДанныеПоСФ.Очистить();
		Документ.Обороты.Очистить();
		Документ.ДанныеПоНДС.Очистить();
		Документ.РасходыБудущихПериодов.Очистить();
		Документ.МПЗРеализованныеИП.Очистить();
		Документ.ДопРасходыИП.Очистить();
		Документ.ПрочиеРасходыИП.Очистить();
		Документ.МПЗРеализованныеУСН.Очистить();
		Документ.ДопРасходыУСН.Очистить();
		Документ.УслугиУСН.Очистить();
		Документ.НоменклатураНаСкладе.Очистить();
		Документ.СпецодеждаИСпецоснасткаВЭксплуатации.Очистить();
		Документ.МатериалыПереданныеВПереработку.Очистить();
		Документ.ТоварыВРозничнойТорговлеАТТ.Очистить();
		Документ.ТоварыВРозничнойТорговлеНТТ.Очистить();
		Документ.УдалитьМПЗПриобретенные.Очистить();
		Документ.СтруктураСтоимостиЗапасов.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе
		// Создаем документ
		Попытка
			Документ = Документы.ВводНачальныхОстатков.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если ХозОперация="ВводОстатковТоваров" Тогда
		ВидОперации = Перечисления.РазделыУчетаДляВводаОстатков.Товары;
		ЭтоКомиссия = Ложь;
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
		Возврат Истина;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата							= ДатаДокумента;
	Документ.РазделУчета					= ВидОперации;
	Документ.Комментарий					= "Экспортирован " + СокрЛП(ТекущаяДата()) + " (" + ИмяДокумента + ")";
	Документ.Ответственный					= ПараметрыСеанса.ТекущийПользователь;
	Документ.Организация					= Организация;
	Документ.ОтражатьВБухгалтерскомУчете	= Истина;
	Документ.ОтражатьВНалоговомУчете		= Истина;
	Документ.ОтражатьПоСпециальнымРегистрам	= Истина;
	Документ.РучнаяКорректировка			= Ложь;
	Если НеМенятьНомераДок Тогда
		Документ.Номер						= НомерДокумента;		
	КонецЕсли;
	Если ЭтоВерсияКорп Тогда
		Документ.ПодразделениеОрганизации	= Подразделение;	
	КонецЕсли;
	
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	
	СчетУчета = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
	Если Склад.ТипСклада=Перечисления.ТипыСкладов.РозничныйМагазин Тогда
		СчетУчета = ПланыСчетов.Хозрасчетный[?(УчетПоРозЦенам, "ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ", "ТоварыВРозничнойТорговле")]; //41.11 / 41.02 
	ИначеЕсли Склад.ТипСклада=Перечисления.ТипыСкладов.ОптовыйСклад Тогда
		СчетУчета = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах; //41.01
	ИначеЕсли Склад.ТипСклада=Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
		СчетУчета = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ; //41.12
	КонецЕсли;
	
	Если Число(ТекущийСтатус)=2 Тогда
		НомерТекущейСтроки = НомерТекущейСтроки + 1;                
		ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки);
		
		Пока (ТекущаяСтрока<>КонецБлокаДанных) И (НомерТекущейСтроки<=Текст.КоличествоСтрок()) Цикл
			// пустые строки пропускаем
			Если СокрЛП(ТекущаяСтрока)="" Тогда
				НомерТекущейСтроки = НомерТекущейСтроки + 1;                
				ТекущаяСтрока = Текст.ПолучитьСтроку(НомерТекущейСтроки); 
				Продолжить;
			КонецЕсли;        
			
			// Разбираем строку          
			ТекущаяСтрока	= УбратьСимволы(ТекущаяСтрока,"""{}"); ПозицияСимвола = Найти(ТекущаяСтрока,",");
			ТипНоменклатуры 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			ТипНоменклатурыИмя 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			НомерГТД		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			КодСтраны		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДС		 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СтавкаНДСИмя	 	= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаНДС 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Сумма	 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			СуммаРозн 			= СокрЛП(Лев(ТекущаяСтрока,ПозицияСимвола-1));ТекущаяСтрока=Прав(ТекущаяСтрока,СтрДлина(ТекущаяСтрока)-ПозицияСимвола);ПозицияСимвола=Найти(ТекущаяСтрока,",");
			Количество			= СокрЛП(ТекущаяСтрока);
			
			СуммаНДС			= ?(СуммаНДС="", 0, Число(СуммаНДС));
			Сумма				= ?(Сумма="", 0, Число(Сумма));
			СуммаРозн			= ?(СуммаРозн="", 0, Число(СуммаРозн));
			Количество			= ?(Количество="", 0, Число(Количество));
			СтавкаНДС			= ПолучитьЗначениеРеквизита(СтавкаНДС, СтавкаНДСИмя);
			Номенклатура		= ПолучитьЗначениеРеквизита(ТипНоменклатуры, ТипНоменклатурыИмя);
			НомерГТД			= ВосстПредстРеквизита(НомерГТД);
			
			Если ЭтоКомиссия И НЕ ЗагрузкаНоменклатуры Тогда
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду("Т00000006");
			КонецЕсли;
			
			//заполнение ТЧ документа
			НовСтр = Документ.НоменклатураНаСкладе.Добавить(); //ТоварыВРозничнойТорговлеАТТ
			НовСтр.Номенклатура			= Номенклатура;
			НовСтр.Количество			= Количество;
			НовСтр.Сумма				= Сумма;
			НовСтр.СтавкаНДС			= СтавкаНДС;
			НовСтр.НДС					= СуммаНДС;
			НовСтр.НДСВключенВстоимость	= Истина;
			НовСтр.Валюта				= ВалютаРегл;
			НовСтр.ОтражениеВУСН		= ?(УСН, Перечисления.ОтражениеВУСН.Принимаются, Перечисления.ОтражениеВУСН.НеПринимаются);
			НовСтр.СтатусыОплатыРасходовУСН=Перечисления.СтатусыРасходовУСН.НеСписано; //НеСписаноНеОплачено
			НовСтр.СтатусыПартийУСН		= ?(ЭтоКомиссия, Перечисления.СтатусыПартийУСН.НаРеализации, Перечисления.СтатусыПартийУСН.Купленные);
			НовСтр.Оплачен				= Истина;
			НовСтр.Склад				= Склад;
			НовСтр.СчетУчета			= СчетУчета;
			//НовСтр.ТорговаяНаценка
				
			// Установка номера ГТД
			//Если НомерГТД<>"" Тогда
			//	СпрСтрана = Справочники.СтраныМира.НайтиПоКоду(КодСтраны);
			//	СпрГТД = Справочники.НомераГТД.НайтиПоКоду(НомерГТД);
			//	Если ЗначениеЗаполнено(СпрГТД) Тогда
			//		НовСтр.НомерГТД = СпрГТД;
			//		НовСтр.СтранаПроисхождения = СпрСтрана;
			//	Иначе
			//		Попытка
			//			НовыйГТД = Справочники.НомераГТД.СоздатьЭлемент();
			//			НовыйГТД.Код = НомерГТД;
			//			НовыйГТД.Записать();
			//			НовСтр.НомерГТД = НовыйГТД.Ссылка;
			//			НовСтр.СтранаПроисхождения = СпрСтрана;
			//		Исключение
			//			ТекстСообщения = "Не удалось записать номер ГТД ("+НомерГТД+")";
			//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			//			Лог.ДобавитьСтроку(ТекстСообщения);
			//		КонецПопытки;
			//	КонецЕсли;
			//КонецЕсли;
			
			НомерТекущейСтроки = НомерТекущейСтроки + 1;                
			ТекущаяСтрока = СокрЛП(Текст.ПолучитьСтроку(НомерТекущейСтроки));
		КонецЦикла;
		
		//Документы.ВводНачальныхОстатков.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Товары");
		
	Иначе
		НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
	КонецЕсли;
	
	Если СравнениеДанных Тогда
		СравнениеОбъектов(Документ, "НоменклатураНаСкладе,ТоварыВРозничнойТорговлеАТТ");
		Возврат Истина;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+ИмяДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки()+Символы.ПС+"Продолжение загрузки не возможно!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.ВводНачальныхОстатков") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПодтвердитьЗагрузку(GUID, "Документ.ВводОстатковТоваров");
	
	Возврат Истина;	
КонецФункции //ЗагрузитьВводОстатковТоваров()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ

//Трофимова 18.06.2019 +++
Функция ПолучитьПустуюТЗПродажи()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("СуммаПродажи",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
	ТЗ.Колонки.Добавить("Себестоимость",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
	ТЗ.Колонки.Добавить("СебестоимостьНДС",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
	ТЗ.Колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)));
	ТЗ.Колонки.Добавить("СтавкаНДС",Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	Возврат ТЗ;
КонецФункции
//Трофимова 18.06.2019 --- 

Процедура СозданиеБазыСоответствий(Параметры) Экспорт
	Если Параметры.Очистка Тогда
		Если Параметры.ТипБазы=0 Тогда
			ConnectionADODB = Новый COMОбъект("ADODB.Connection");
			ConnectionADODB.Open("Provider=SQLOLEDB.1;Password=" + Параметры.Пароль + ";User ID=" + Параметры.Логин + ";Data Source=" + Параметры.ИмяСервера);
			CommandADODB = Новый COMОбъект("ADODB.Command");
			CommandADODB.ActiveConnection = ConnectionADODB;
			
			Попытка               
				CommandADODB.CommandText = "DELETE FROM [" + Параметры.ИмяБазы + "].[dbo].[TCBP]";
				Result = CommandADODB.Execute();
			Исключение
				ТекстСообщения = "Ошибка очистки таблицы! " + ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецПопытки;
			ТекстСообщения = "База " + Параметры.ИмяБазы + " очищена !";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		ИначеЕсли Параметры.ТипБазы=1 Тогда
			//
		ИначеЕсли Параметры.ТипБазы=2 Тогда
			//
		КонецЕсли;
		
	Иначе
		Если Параметры.ТипБазы=0 Тогда
			ConnectionADODB = Новый COMОбъект("ADODB.Connection");
			//Если ПустаяСтрока(СтрокаПодключенияМастер) Тогда
				ConnectionADODB.Open("Provider=SQLOLEDB.1;Password=" + Параметры.Пароль + ";User ID=" + Параметры.Логин + ";Data Source=" + Параметры.ИмяСервера);
			//Иначе
			//	ConnectionADODB.Open(СтрокаПодключенияМастер);
			//КонецЕсли;
			CommandADODB = Новый COMОбъект("ADODB.Command");
			CommandADODB.ActiveConnection = ConnectionADODB;
			///////////////////////////////////////////////////////////////////////////
			//Сначала проверим - существует ли база...
			Recordset2 = Новый COMОбъект("ADODB.Recordset");
			RecordSet2.CursorLocation = 3;
			ТекстЗапросаSQL = "
			|SELECT * FROM sys.databases
			|WHERE NAME='" + СокрЛП(Параметры.ИмяБазы) + "'
			|";
			//Выполнение SQL-запроса
			БазаНеСуществует = Истина;
			Попытка               
				Recordset2.Open(ТекстЗапросаSQL, ConnectionADODB, 2, 3, 1);
			Исключение
				ТекстСообщения = "Ошибка проверки существования базы соответствий! " + ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецПопытки;
			//Пошел основной цикл
			Если Recordset2.EOF()=0 Тогда
				Recordset2.MoveFirst();
			КонецЕсли;
			Пока Recordset2.EOF()=0 Цикл
				//ОбработкаПрерыванияПользователя();
				БазаНеСуществует = Ложь;
				Recordset2.MoveNext();
			КонецЦикла;
			Recordset2.Close();
			
			///////////////////////////////////////////////////////////////////////////
			Если БазаНеСуществует Тогда
				Попытка               
					CommandADODB.CommandText = "CREATE DATABASE [" + Параметры.ИмяБазы + "]";
					Result = CommandADODB.Execute();
				Исключение 
					ТекстСообщения = "Ошибка создания базы! " + ОписаниеОшибки();
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Возврат;
				КонецПопытки;
			КонецЕсли;
			
			//Теперь пытаемся создать таблицы
			ТекстЗапроса = "
			|CREATE TABLE [" + Параметры.ИмяБазы + "].[dbo].[TCBP] (
			|	[ObjectTCID] [nvarchar] (150) NULL ,
			|	[ObjectTCType] [nvarchar] (150) NULL ,
			|	[ObjectBPID] [nvarchar] (150) NULL ,
			|	[ObjectBPType] [nvarchar] (150) NULL 
			|) ON [PRIMARY]
			|CREATE INDEX [IX_ObjectBPID_ObjectBPType] ON [" + Параметры.ИмяБазы + "].[dbo].[TCBP]([ObjectBPID], [ObjectBPType]) ON [PRIMARY]
			|CREATE INDEX [IX_ObjectTCID_ObjectTCType] ON [" + Параметры.ИмяБазы + "].[dbo].[TCBP]([ObjectTCID], [ObjectTCType]) ON [PRIMARY]
			|";
			Попытка               
				CommandADODB.CommandText = ТекстЗапроса;
				Result = CommandADODB.Execute();
			Исключение 
				ТекстСообщения = "Ошибка создания таблиц! " + ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецПопытки;
			
		ИначеЕсли Параметры.ТипБазы=1 Тогда
			ConnectionADOX = Новый COMОбъект("ADOX.Catalog");
			ConnectionADOX.Create("Provider=Microsoft.Jet.OLEDB.4.0;Data Source=" + Параметры.ИмяБазы);
			TableADOX = Новый COMОбъект("ADOX.Table"); TableADOX.Name = "TCBP";
			ColumnADOX = Новый COMОбъект("ADOX.Column"); ColumnADOX.ParentCatalog=ConnectionADOX; ColumnADOX.Name="ObjectTCID"; ColumnADOX.Properties("Nullable").Value=Ложь; ColumnADOX.Properties("Jet OLEDB:Compressed UNICODE Strings").Value=Ложь;
			TableADOX.Columns.Append(ColumnADOX);
			ColumnADOX = Новый COMОбъект("ADOX.Column"); ColumnADOX.ParentCatalog=ConnectionADOX; ColumnADOX.Name="ObjectTCType"; ColumnADOX.Properties("Nullable").Value=Истина; ColumnADOX.Properties("Jet OLEDB:Compressed UNICODE Strings").Value=Ложь;
			TableADOX.Columns.Append(ColumnADOX);
			ColumnADOX = Новый COMОбъект("ADOX.Column"); ColumnADOX.ParentCatalog=ConnectionADOX; ColumnADOX.Name="ObjectBPID"; ColumnADOX.Properties("Nullable").Value=Ложь; ColumnADOX.Properties("Jet OLEDB:Compressed UNICODE Strings").Value=Ложь;
			TableADOX.Columns.Append(ColumnADOX);
			ColumnADOX = Новый COMОбъект("ADOX.Column"); ColumnADOX.ParentCatalog=ConnectionADOX; ColumnADOX.Name="ObjectBPType"; ColumnADOX.Properties("Nullable").Value=Истина; ColumnADOX.Properties("Jet OLEDB:Compressed UNICODE Strings").Value=Ложь;
			TableADOX.Columns.Append(ColumnADOX);
			IndexADOX = Новый COMОбъект("ADOX.Index"); IndexADOX.Name="IX_ObjectTCID_ObjectTCType"; IndexADOX.Columns.Append("ObjectTCID"); IndexADOX.Columns.Append("ObjectTCType");
			TableADOX.Indexes.Append(IndexADOX);
			IndexADOX = Новый COMОбъект("ADOX.Index"); IndexADOX.Name="IX_ObjectBPID_ObjectBPType"; IndexADOX.Columns.Append("ObjectBPID"); IndexADOX.Columns.Append("ObjectBPType");
			TableADOX.Indexes.Append(IndexADOX);
			ConnectionADOX.Tables.Append(TableADOX);
			
		ИначеЕсли Параметры.ТипБазы=2 Тогда
			тзСоотв = Новый ТаблицаЗначений;
			ТипСтрока 	= Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная));
			тзСоотв.Колонки.Добавить("ObjectTCID", ТипСтрока);
			тзСоотв.Колонки.Добавить("ObjectTCType", ТипСтрока);
			тзСоотв.Колонки.Добавить("ObjectBPID", ТипСтрока);
			тзСоотв.Колонки.Добавить("ObjectBPType", ТипСтрока);
			//ЗначениеВФайл(Параметры.ИмяБазы, тзСоотв);
			ЗаписьXML = Новый ЗаписьXML();
			ЗаписьXML.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьXML(ЗаписьXML, тзСоотв);
			СтрокаXML = ЗаписьXML.Закрыть();
			//ТекстСоотв = Новый ЗаписьТекста(Параметры.ИмяБазы);
			//ТекстСоотв.Записать(СтрокаXML);
			//ТекстСоотв.Закрыть();
			Параметры.СтрокаXML = СтрокаXML;
		КонецЕсли;
		
		ТекстСообщения = "База " + Параметры.ИмяБазы + " создана успешно !";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры //СозданиеБазыСоответствий()

Функция ВосстПредстРеквизита(Знач ЗнРекв)
	Если ТипЗнч(ЗнРекв)=Тип("Строка") Тогда
		ЗнРекв = СокрЛП(СтрЗаменить(ЗнРекв, "¤", """"));
		ЗнРекв = СокрЛП(СтрЗаменить(ЗнРекв, "†", ","));
		ЗнРекв = СокрЛП(СтрЗаменить(ЗнРекв, "‡", Символы.ПС));
		ЗнРекв = СокрЛП(СтрЗаменить(ЗнРекв, "[", "{"));
		ЗнРекв = СокрЛП(СтрЗаменить(ЗнРекв, "]", "}"));
	КонецЕсли;
	
	Возврат ЗнРекв;
КонецФункции //ПреобразованиеСтроки()

Функция ПолучитьЗначениеРеквизита(Субконто, ТипСубконто, НомерСубконто=Неопределено, Счет=Неопределено)
	
	Если обЗначениеНеЗаполнено(Субконто) Тогда
		Если ЗначениеЗаполнено(Счет) И НомерСубконто<>Неопределено И Счет.ВидыСубконто[НомерСубконто].ВидСубконто.ТипЗначения.Типы().Количество()=1 Тогда
			Возврат Новый(Счет.ВидыСубконто[НомерСубконто].ВидСубконто.ТипЗначения.Типы()[0]);
		КонецЕсли;
		
		Возврат Неопределено;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ТипСубконто) И ЗначениеЗаполнено(Счет) И НомерСубконто<>Неопределено Тогда
		ТипСубконто = Метаданные.НайтиПоТипу(Счет.ВидыСубконто[НомерСубконто].ВидСубконто.ТипЗначения.Типы()[0]).ПолноеИмя();
	КонецЕсли;
	
	Если СтрЧислоВхождений(Строка(ТипСубконто),"Перечисл")>0 Тогда
		// Установка номенклатуры по виду
		Если СтрЧислоВхождений(Строка(ТипСубконто),"ВидыНоменклатуры")>0 Тогда
			Если СтрЧислоВхождений(Строка(Субконто),"Услуга")>0 Тогда
				Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000002");
			ИначеЕсли СтрЧислоВхождений(Строка(Субконто),"Комплект")>0 Тогда
				Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000003");
			ИначеЕсли СтрЧислоВхождений(Строка(Субконто),"Тара")>0 Тогда
				Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000004");
			ИначеЕсли СтрЧислоВхождений(Строка(Субконто),"Продукция")>0 Тогда
				Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000005");
			ИначеЕсли СтрЧислоВхождений(Строка(Субконто),"Комиссия")>0 Тогда
				Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000006");
			Иначе
				Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000001");
			КонецЕсли;
			
		ИначеЕсли СтрЧислоВхождений(Строка(ТипСубконто),"ВидыПлатежейВГосБюджет")>0 Тогда
			Возврат Перечисления.ВидыПлатежейВГосБюджет.Налог;
			
		ИначеЕсли СтрЧислоВхождений(Строка(ТипСубконто),"СтавкиНДС")>0 Тогда
			Если Субконто="0" Тогда
				Возврат Перечисления.СтавкиНДС.БезНДС;
			Иначе
				СтавкаНДС = "НДС" + СокрЛП(Субконто);
				Возвращаемое = ?(ТекущаяДата()>=Дата("20190101"), Перечисления.СтавкиНДС.НДС20, Перечисления.СтавкиНДС.НДС18);
				Попытка
					Возвращаемое = Перечисления.СтавкиНДС[СтавкаНДС];
				Исключение
					СтрОш = ОписаниеОшибки();
					ТекстСообщения = "При загрузке не удалось получить ставку " + СтавкаНДС + " по причине: " + СтрОш;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Лог.ДобавитьСтроку(ТекстСообщения);
				КонецПопытки;
				Возврат Возвращаемое;
			КонецЕсли;
		Иначе
			Попытка
				Возвращаемое = Перечисления[Сред(ТипСубконто, Найти(ТипСубконто, ".") + 1)][СокрЛП(Субконто)];
			Исключение
				Возвращаемое = Неопределено;
			КонецПопытки;
			Возврат Возвращаемое;
		КонецЕсли;
		
	ИначеЕсли СтрЧислоВхождений(Строка(ТипСубконто),"Справочник")>0 Тогда
		Если СтрЧислоВхождений(Строка(ТипСубконто),"НДС")>0 Тогда
			Если Субконто="0" Тогда
				Возврат Перечисления.СтавкиНДС.БезНДС;
			Иначе
				СтавкаНДС = "НДС" + СокрЛП(Субконто);
				Возвращаемое = ?(ТекущаяДата()>=Дата("20190101"), Перечисления.СтавкиНДС.НДС20, Перечисления.СтавкиНДС.НДС18);
				Попытка
					Возвращаемое = Перечисления.СтавкиНДС[СтавкаНДС];
				Исключение
					СтрОш = ОписаниеОшибки();
					ТекстСообщения = "При загрузке не удалось получить ставку " + СтавкаНДС + " по причине: " + СтрОш;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Лог.ДобавитьСтроку(ТекстСообщения);
				КонецПопытки;
				Возврат Возвращаемое;
			КонецЕсли;
		//ИначеЕсли СтрЧислоВхождений(ВидСубконто,"Партии")>0 Тогда
		//	РезультатПоиска = НайтиОбъектПоGUID(Субконто,ТипСубконто);
		//	Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) И СтрЧислоВхождений(ТипЗнч(РезультатПоиска),"Контрагент")>0 Тогда
		//		НоваяПартия = Документы.Партия.СоздатьДокумент();
		//		НоваяПартия.Дата = ТекущаяДата();
		//		//НоваяПартия.Организация = ОсновнаяОрганизация;
		//		НоваяПартия.Контрагент = РезультатПоиска;
		//		//НоваяПартия.ДоговорКонтрагента =
		//		НоваяПартия.Комментарий = "Документ создан автоматически для подстановки контрагента.";
		//		НоваяПартия.Записать();
		//		Возврат НоваяПартия.Ссылка;
		//	КонецЕсли;
		
		Иначе
			РезультатПоиска = НайтиОбъектПоGUID(Субконто, ТипСубконто);
			Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
				Возврат РезультатПоиска;
			КонецЕсли;
			
			Если СтрЧислоВхождений(Строка(ТипСубконто),"Номенклатура")>0 Тогда
				Если СтрЧислоВхождений(Строка(Субконто),"Услуга")>0 Тогда
					Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000002");
				ИначеЕсли СтрЧислоВхождений(Строка(Субконто),"Комплект")>0 Тогда
					Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000003");
				ИначеЕсли СтрЧислоВхождений(Строка(Субконто),"Тара")>0 Тогда
					Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000004");				
				ИначеЕсли СтрЧислоВхождений(Строка(Субконто),"Продукция")>0 Тогда
					Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000005");
				ИначеЕсли СтрЧислоВхождений(Строка(Субконто),"Комиссия")>0 Тогда
					Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000006");
				ИначеЕсли СтрЧислоВхождений(Строка(Субконто),"Товар")>0 Тогда
					Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000001");
				КонецЕсли;
			КонецЕсли;
			
			ИдентификаторСправочникаБух = НайтиСоответствиеСправочника(СтрЗаменить(ТипСубконто, "Справочник.", ""));
			Если ИдентификаторСправочникаБух<>Неопределено Тогда
				РезультатПоиска = Справочники[СокрЛП(ИдентификаторСправочникаБух)].НайтиПоКоду(Субконто);
				Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
					Возврат РезультатПоиска;
				КонецЕсли;  
				РезультатПоиска = Справочники[СокрЛП(ИдентификаторСправочникаБух)].НайтиПоНаименованию(Субконто, Истина);
				Если НЕ обЗначениеНеЗаполнено(РезультатПоиска) Тогда
					Возврат РезультатПоиска;
				КонецЕсли;  
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли СтрЧислоВхождений(Строка(ТипСубконто),"Документ")>0 Тогда	
		РезультатПоиска = НайтиОбъектПоGUID(Субконто, ТипСубконто);
		Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
			Возврат НайтиОбъектПоGUID(Субконто);
		Иначе
			Возврат РезультатПоиска;
		КонецЕсли;
		
	ИначеЕсли обЗначениеНеЗаполнено(ТипСубконто) Тогда
		Если СтрЧислоВхождений(Строка(Субконто),"Услуга")>0 Тогда
			Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000002");
		ИначеЕсли СтрЧислоВхождений(Строка(Субконто),"Комплект")>0 Тогда
			Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000003");
		ИначеЕсли СтрЧислоВхождений(Строка(Субконто),"Тара")>0 Тогда
			Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000004");
		ИначеЕсли СтрЧислоВхождений(Строка(Субконто),"Продукция")>0 Тогда
			Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000005");
		ИначеЕсли СтрЧислоВхождений(Строка(Субконто),"Комиссия")>0 Тогда
			Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000006");
		Иначе
			Возврат Справочники.Номенклатура.НайтиПоКоду("Т00000001");				
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции //ПолучитьЗначениеРеквизита()

Функция ПропуститьБлок(НомерСтроки)
	ТекСтрока = Текст.ПолучитьСтроку(НомерСтроки);
	Пока СтрЧислоВхождений(ТекСтрока,КонецБлокаДанных)=0 И НомерСтроки<=Текст.КоличествоСтрок() Цикл
		НомерСтроки = НомерСтроки + 1;
		ТекСтрока = Текст.ПолучитьСтроку(НомерСтроки);
	КонецЦикла;
	
	Возврат НомерСтроки;
КонецФункции // ПропуститьБлок()

// Начальная инициализация переменных объекта
Процедура Инициализация() Экспорт
	//заполнение переменных
	ДатаНачала = НачалоМесяца(ТекущаяДата());
	ДатаКонца  = ТекущаяДата();
		
	КонецБлокаДанных = "{КонецБлока}";
	РелизыТК		 = "08.1.24.09";
	ВерсияОбмена	 = "30326.0";
	
	ЭтоВерсияКорп	 = (Найти(НРег(Метаданные.Имя), "корп")>0);
	
	// заполним список выгружаемых документов   
	ВидыДокументов.Очистить();
	ТекСтрока = ВидыДокументов.Добавить();
	ТекСтрока.Пометка		= Истина;
	ТекСтрока.Объект		= "ПоступлениеНаРасчетныйСчет";
	ТекСтрока.Представление	= "Поступление на расчетный счет";
	ТекСтрока = ВидыДокументов.Добавить();
	ТекСтрока.Пометка		= Истина;
	ТекСтрока.Объект		= "СписаниеСРасчетногоСчета";
	ТекСтрока.Представление	= "Списание с расчетного счета";
	ТекСтрока = ВидыДокументов.Добавить();
	ТекСтрока.Пометка		= Истина;
	ТекСтрока.Объект		= "ПриходныйКассовыйОрдер";
	ТекСтрока.Представление = "Приходный кассовый ордер";
	ТекСтрока = ВидыДокументов.Добавить();
	ТекСтрока.Пометка		= Истина;
	ТекСтрока.Объект		= "РасходныйКассовыйОрдер";
	ТекСтрока.Представление	= "Расходный кассовый ордер";
	
	// Список соответствия справочников конфигурации-источника и текущей конфигурации 
	спСоответствияСправочников = Новый СписокЗначений;
	спСоответствияСправочников.Добавить("АссортиментТоварныхМарок",	"");
	спСоответствияСправочников.Добавить("ДоговорыВзаиморасчетов",	"ДоговорыКонтрагентов");
	спСоответствияСправочников.Добавить("Должности",				"ДолжностиОрганизаций");
	спСоответствияСправочников.Добавить("ЕдиницыИзмерения",			"");
	спСоответствияСправочников.Добавить("Организация",				"Организации");
	спСоответствияСправочников.Добавить("СкладыКомпании",			"Склады");
	спСоответствияСправочников.Добавить("ТипыНоменклатуры",			"ВидыНоменклатуры");//"НоменклатурныеГруппы");
	спСоответствияСправочников.Добавить("НоменклатурныеГруппы1C",	"НоменклатурныеГруппы");
	спСоответствияСправочников.Добавить("ТипыСкидок",				"");
	спСоответствияСправочников.Добавить("ТоварныеМарки",			"");
	//спСоответствияСправочников.Добавить("СтатьиДоходовИРасходов",	"СтатьиЗатрат"); //???
	спСоответствияСправочников.Добавить("СтатьиДоходовИРасходов",	"ПрочиеДоходыИРасходы"); //для корректировки долга !!!
	спСоответствияСправочников.Добавить("СтатьиДДС",				"СтатьиДвиженияДенежныхСредств");
	спСоответствияСправочников.Добавить("Банк",						"Банки");
	спСоответствияСправочников.Добавить("ВалютаДенежныхСредств",	"Валюты");
	спСоответствияСправочников.Добавить("ПодразделенияКомпании",	"ПодразделенияОрганизаций");
	спСоответствияСправочников.Добавить("Сотрудники",				"ФизическиеЛица");
	спСоответствияСправочников.Добавить("КлассификаторСтранМира",	"СтраныМира");
	спСоответствияСправочников.Добавить("ТипыЦен",					"ТипыЦенНоменклатуры");
	спСоответствияСправочников.Добавить("ТипыПлатежныхКарт",		"ВидыОплатОрганизаций");

	спСоответствияПеречислений = Новый СписокЗначений;
	спСоответствияПеречислений.Добавить("ВидыДоговоров.Покупка",			"ВидыДоговоровКонтрагентов.СПоставщиком");
	спСоответствияПеречислений.Добавить("ВидыДоговоров.Продажа",			"ВидыДоговоровКонтрагентов.СПокупателем");
	спСоответствияПеречислений.Добавить("ВидыДоговоров.Комиссия",			"ВидыДоговоровКонтрагентов.Прочее");
	спСоответствияПеречислений.Добавить("ВидыДоговоров.УпрощеннаяКомиссия",	"ВидыДоговоровКонтрагентов.Прочее");
	спСоответствияПеречислений.Добавить("ВидыДоговоров.Прочее",				"ВидыДоговоровКонтрагентов.Прочее");
	спСоответствияПеречислений.Добавить("ВидыДоговоров.Бонус",				"ВидыДоговоровКонтрагентов.Прочее");
	спСоответствияПеречислений.Добавить("ВидыДоговоров.СКомитентом",		"ВидыДоговоровКонтрагентов.СКомитентом");
	спСоответствияПеречислений.Добавить("ВидыДоговоров.СКомиссионером",		"ВидыДоговоровКонтрагентов.СКомиссионером");
	спСоответствияПеречислений.Добавить("0",								"СтавкиНДС.БезНДС");
	спСоответствияПеречислений.Добавить("10",								"СтавкиНДС.НДС10");
	спСоответствияПеречислений.Добавить("18",								"СтавкиНДС.НДС18");
	спСоответствияПеречислений.Добавить("20",								"СтавкиНДС.НДС20");
	спСоответствияПеречислений.Добавить("СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтПродажи", "СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтСуммыПродажи");
	спСоответствияПеречислений.Добавить("СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтНаценки", "СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтРазностиСуммПродажиИПоступления");

	спСоответствияДокументов = Новый СписокЗначений;
	спСоответствияДокументов.Добавить("ПоступлениеТоваров",			"ПоступлениеТоваровУслуг");
	спСоответствияДокументов.Добавить("АктКорректировкиПоставки",	"КорректировкаПоступления");
	спСоответствияДокументов.Добавить("РеализацияТоваров",			"РеализацияТоваровУслуг");
	спСоответствияДокументов.Добавить("АктКорректировкиОтгрузки",	"КорректировкаРеализации");
	спСоответствияДокументов.Добавить("ЗакрытиеСмены",				"ОтчетОРозничныхПродажах");
	спСоответствияДокументов.Добавить("ВозвратОтПокупателя",		"ВозвратТоваровОтПокупателя");
	спСоответствияДокументов.Добавить("ВозвратПоставщику",			"ВозвратТоваровПоставщику");
	спСоответствияДокументов.Добавить("СписаниеТоваров",			"СписаниеТоваров");
	спСоответствияДокументов.Добавить("ПересортицаТоваров",			"СписаниеТоваров");
	//спСоответствияДокументов.Добавить("Инвентаризация",				"ИнвентаризацияТоваровНаСкладе");
	спСоответствияДокументов.Добавить("ОтчетПроизводстваЗаСмену",	"ОтчетПроизводстваЗаСмену");
	спСоответствияДокументов.Добавить("Разделка",					"ОтчетПроизводстваЗаСмену");
	спСоответствияДокументов.Добавить("Взаимозачет",				"КорректировкаДолга");
	
	ДобавитьСчетаУчета();
КонецПроцедуры //Инициализация()

//для СкорректироватьНалоговыеСуммы()
Функция ОпределитьНеПринимаемыеДоходы(СтруктураПроводки) Экспорт

	Если СтруктураПроводки.СчетКт <> ПланыСчетов.Хозрасчетный.ПустаяСсылка()
		И (СтруктураПроводки.СчетКт = ПланыСчетов.Хозрасчетный.ПрочиеДоходы
		ИЛИ СтруктураПроводки.СчетКт.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ПрочиеДоходы)) Тогда
		//Для С=1 По 3 Цикл
		Для Каждого Субконто Из СтруктураПроводки.СубконтоКт Цикл
			//Субконто = СтруктураПроводки["СубконтоКт" + С];
			Если ТипЗнч(Субконто) = Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
				РеквизитыСубконто = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Субконто, "ЭтоГруппа,ПринятиеКналоговомуУчету");
				Если НЕ РеквизитыСубконто.ЭтоГруппа
					И Субконто <> Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка() И 
					НЕ РеквизитыСубконто.ПринятиеКналоговомуУчету Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции //ОпределитьНеПринимаемыеДоходы()

//для СкорректироватьНалоговыеСуммы()
Функция ОпределитьНеПринимаемыеРасходы(СтруктураПроводки, Операция) Экспорт

	//Для С=1 По 3 Цикл
	Для Каждого Субконто Из СтруктураПроводки.СубконтоДт Цикл
		//Субконто = СтруктураПроводки["СубконтоДт" + С];
		Если ТипЗнч(Субконто) = Тип("СправочникСсылка.СтатьиЗатрат")
				И НЕ Субконто.ЭтоГруппа Тогда
			Если Субконто.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения Тогда
				// Расходы на строительство объектов основных средств, не относятся к расходам по производству и реализации
				Если СтруктураПроводки.СчетДт = ПланыСчетов.Хозрасчетный.СтроительствоОбъектовОсновныхСредств
						ИЛИ СтруктураПроводки.СчетДт.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.СтроительствоОбъектовОсновныхСредств) Тогда
					Возврат Ложь;
				КонецЕсли;
				ОтнесениеКЕНВД = Субконто.ВидДеятельностиДляНалоговогоУчетаЗатрат;
				Если ОтнесениеКЕНВД = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения Тогда
					Отказ = Истина;
					ШаблонСообщения = НСтр("ru='%1 - неправильно указана: для непринимаемых расходов (%2).
						|Расходы, не учитываемые для целей налогообложения, не следует относить к распределяемым - это не имеет смысла для расчета налоговой базы и не поддерживается программой.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ШаблонСообщения,
						Субконто,
						ОтнесениеКЕНВД);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Операция, "Хозрасчетный[" + Формат(СтруктураПроводки.НомерСтроки, "ЧГ=0") + "].СчетКт", "Объект", Отказ);
					Лог.ДобавитьСтроку(ТекстСообщения);
					Возврат Ложь;
				КонецЕсли;
				Если ОтнесениеКЕНВД = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты Тогда
					Отказ = Истина;
					ШаблонСообщения = НСтр("ru='%1 - неправильно указана: для непринимаемых расходов (%2).
						|Расходы, не учитываемые для целей налогообложения, не следует относить к распределяемым - это не имеет смысла для расчета налоговой базы и не поддерживается программой.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ШаблонСообщения,
						Субконто,
						ОтнесениеКЕНВД);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Операция, "Хозрасчетный[" + Формат(СтруктураПроводки.НомерСтроки, "ЧГ=0") + "].СчетКт", "Объект", Отказ);
					Лог.ДобавитьСтроку(ТекстСообщения);
					Возврат Ложь;
				КонецЕсли;
				Возврат Истина;
			КонецЕсли;

		ИначеЕсли ТипЗнч(Субконто) = Тип("СправочникСсылка.ПрочиеДоходыИРасходы")
				И НЕ Субконто.ЭтоГруппа Тогда
			Если Субконто <> Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка()
					И НЕ Субконто.ПринятиеКналоговомуУчету Тогда
				ОтнесениеКЕНВД = Субконто.ВидДеятельностиДляНалоговогоУчетаЗатрат;
				Если ОтнесениеКЕНВД = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения Тогда
					Отказ = Истина;
					ШаблонСообщения = НСтр("ru='СтруктураПроводки %1: неправильно указана статья затрат для непринимаемых расходов (%2).
						|Расходы, не учитываемые для целей налогообложения, не следует относить к деятельности, облагаемой ЕНВД, - это не имеет смысла для расчета налоговой базы и не поддерживается программой.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ШаблонСообщения,
						СтруктураПроводки.Содержание,
						ОтнесениеКЕНВД);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Операция, "Хозрасчетный[" + Формат(СтруктураПроводки.НомерСтроки, "ЧГ=0") + "].СчетКт", "Объект", Отказ);
					Лог.ДобавитьСтроку(ТекстСообщения);
					Возврат Ложь;
				КонецЕсли;
				Если ОтнесениеКЕНВД = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты Тогда
					Отказ = Истина;
					ШаблонСообщения = НСтр("ru='СтруктураПроводки %1: неправильно указана статья затрат для непринимаемых расходов (%2).
						|Расходы, не учитываемые для целей налогообложения, не следует относить к распределяемым - это не имеет смысла для расчета налоговой базы и не поддерживается программой.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ШаблонСообщения,
						СтруктураПроводки.Содержание,
						ОтнесениеКЕНВД);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Операция, "Хозрасчетный[" + Формат(СтруктураПроводки.НомерСтроки, "ЧГ=0") + "].СчетКт", "Объект", Отказ);
					Лог.ДобавитьСтроку(ТекстСообщения);
					Возврат Ложь;
				КонецЕсли;
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Возврат Ложь;

КонецФункции //ОпределитьНеПринимаемыеРасходы()

//Адаптированный фрагмент модуля набора записей регистра бухгалтерии хозрасчетный
Процедура СкорректироватьНалоговыеСуммы(Операция, Проводка)
	
	Организация = Проводка.Организация;
	Период		= Проводка.Период;
	Содержание	= Проводка.Содержание;
	Сумма		= Проводка.Сумма;
	СчетДт 		= Проводка.СчетДт;
	СчетКт 		= Проводка.СчетКт;
	
	ВедетсяНалоговыйУчетДт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СчетДт).НалоговыйУчет;
	ВедетсяНалоговыйУчетКт = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СчетКт).НалоговыйУчет;
		
	//ОперацияБух.ОтразитьНепринимаемыеДоходыИРасходы()
	
	Если ВедетсяНалоговыйУчетКт И ОпределитьНеПринимаемыеДоходы(Проводка) Тогда
		Проводка.СуммаПРКт = Проводка.Сумма;
	КонецЕсли;

	Если ВедетсяНалоговыйУчетДт И ОпределитьНеПринимаемыеРасходы(Проводка, Операция) Тогда
		Проводка.СуммаПРДт = Проводка.Сумма;
	КонецЕсли;
	
	Если ВедетсяНалоговыйУчетДт Тогда
		Проводка.СуммаНУДт = Проводка.Сумма - Проводка.СуммаПРДт - Проводка.СуммаВРДт;
	КонецЕсли;
	
	Если ВедетсяНалоговыйУчетКт Тогда
		Проводка.СуммаНУКт = Проводка.Сумма - Проводка.СуммаПРКт - Проводка.СуммаВРКт;
	КонецЕсли;

	
	//ХозРасчетный.ЗаполнитьСуммыНалоговогоУчета()
	
	ПлательщикНалогаНаПрибыль = УчетнаяПолитика.ПлательщикНалогаНаПрибыль(Организация, Период);
	
	Если ПлательщикНалогаНаПрибыль И Проводка.Сумма<>0 Тогда
		Если НЕ БухгалтерскийУчетПовтИсп.СчетВИерархии(СчетДт, ПланыСчетов.Хозрасчетный.ЦелевоеФинансирование)
			И НЕ БухгалтерскийУчетПовтИсп.СчетВИерархии(СчетКт, ПланыСчетов.Хозрасчетный.ЦелевоеФинансирование)
			И НЕ СчетДт = ПланыСчетов.Хозрасчетный.СпецодеждаВЭксплуатацииВспомогательный
			И НЕ СчетДт = ПланыСчетов.Хозрасчетный.СпецоснасткаВЭксплуатацииВспомогательный
			И НЕ СчетКт = ПланыСчетов.Хозрасчетный.СпецодеждаВЭксплуатацииВспомогательный
			И НЕ СчетКт = ПланыСчетов.Хозрасчетный.СпецоснасткаВЭксплуатацииВспомогательный
			И НЕ (СчетКт = ПланыСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке
				ИЛИ БухгалтерскийУчетПовтИсп.СчетВИерархии(СчетКт, ПланыСчетов.Хозрасчетный.НДС))
			И НЕ БухгалтерскийУчетПовтИсп.СчетВИерархии(СчетДт, ПланыСчетов.Хозрасчетный.ПрочиеРасходы)	Тогда // НДС не учитывается в НУ
			
			Если СчетДт.НалоговыйУчет И Проводка.СуммаНУДт=0 И Проводка.СуммаПРДт=0 И Проводка.СуммаВРДт=0 Тогда
				Проводка.СуммаНУДт = Проводка.Сумма;
			КонецЕсли;
			
			Если СчетКт.НалоговыйУчет И Проводка.СуммаНУКт=0 И Проводка.СуммаПРКт=0	И Проводка.СуммаВРКт=0 Тогда
				Проводка.СуммаНУКт = Проводка.Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//ХозРасчетный.ОтразитьДоходыРасходыНеУчитываемыеВНалоговомУчете()	
	
	Если ПлательщикНалогаНаПрибыль Тогда
		ЭтоПроводкаДоходыНеУчитываемыеДляНалогаНаПрибыль = Ложь; ПроводкиПоДоходам = Ложь; ПроводкиПоРасходам = Ложь;
		Если ЗначениеЗаполнено(СчетКт)И СчетКт.НалоговыйУчет И Проводка.СубконтоКт.Количество()<>0
		   И БухгалтерскийУчетПовтИсп.СчетВИерархии(СчетКт, ПланыСчетов.Хозрасчетный.ПрочиеДоходы) Тогда
			Для Каждого Субконто Из Проводка.СубконтоКт Цикл
				Если Субконто.Ключ=ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы Тогда 
					Если НЕ НалоговыйУчетПовтИсп.ВидДоходовРасходовУчитывается(Субконто.Значение) Тогда
						ПроводкиПоДоходам = Истина;
						ЭтоПроводкаДоходыНеУчитываемыеДляНалогаНаПрибыль = Истина;
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Обработаем не учитываемые доходы:
		// - обеспечим, чтобы они не отражались в налоговом учете
		// - добавим проводки по забалансовому учету
		Если ПроводкиПоДоходам Тогда
			Если ЗначениеЗаполнено(Проводка.СуммаНУКт) Тогда
				Проводка.СуммаПРКт = Проводка.СуммаПРКт + Проводка.СуммаНУКт;
				Проводка.СуммаНУКт = 0;
			КонецЕсли;
			
			СуммаНеУчитываемыхДоходов = Проводка.Сумма - Проводка.СуммаВРДт - Проводка.СуммаПРДт;
			Если СуммаНеУчитываемыхДоходов<>0 Тогда
				НоваяПроводка = Операция.Движения.Хозрасчетный.Добавить();
				НоваяПроводка.Организация = Проводка.Организация;
				НоваяПроводка.Период      = Проводка.Период;
				НоваяПроводка.Содержание  = Проводка.Содержание;
				НоваяПроводка.СчетКт      = ПланыСчетов.Хозрасчетный.ДоходыНеУчитываемые;
				НоваяПроводка.СуммаНУКт   = СуммаНеУчитываемыхДоходов;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЭтоПроводкаДоходыНеУчитываемыеДляНалогаНаПрибыль И ЗначениеЗаполнено(СчетДт) И СчетДт.НалоговыйУчет И Проводка.СубконтоДт.Количество()<>0
		   И БухгалтерскийУчетПовтИсп.СчетВИерархии(СчетДт, ПланыСчетов.Хозрасчетный.СтроительствоОбъектовОсновныхСредств) Тогда
			Для Каждого Субконто Из Проводка.СубконтоДт Цикл
				Если Субконто.Ключ=ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы Тогда 
					Если Не НалоговыйУчетПовтИсп.ВидДоходовРасходовУчитывается(Субконто.Значение) Тогда
						ПроводкиПоРасходам = Истина;
						Прервать;
					КонецЕсли;
				ИначеЕсли Субконто.Ключ=ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат Тогда 
					Если Не НалоговыйУчетПовтИсп.СтатьяЗатратУчитывается(Субконто.Значение) Тогда
						ПроводкиПоРасходам = Истина;
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Обработаем не учитываемые расходы (также, как и доходы)
		Если ПроводкиПоРасходам Тогда
			Если ЗначениеЗаполнено(Проводка.СуммаНУКт) Тогда
				Проводка.СуммаПРКт = Проводка.СуммаПРКт + Проводка.СуммаНУКт;
				Проводка.СуммаНУКт = 0;
			КонецЕсли;
			
			СуммаНеУчитываемыхРасходов = Проводка.Сумма - Проводка.СуммаВРКт - Проводка.СуммаПРКт;
			Если СуммаНеУчитываемыхРасходов<>0 Тогда
				Запрос = Новый Запрос("
				|ВЫБРАТЬ ПрочиеДоходыИРасходы.Ссылка КАК Ссылка
				|ИЗ	Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
				|ГДЕ ПрочиеДоходыИРасходы.ВидПрочихДоходовИРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы)");
				Выборка = Запрос.Выполнить().Выбрать();
				ПрочиеДоходыИРасходыВнереализационные = Новый Соответствие;
				Пока Выборка.Следующий() Цикл
					ПрочиеДоходыИРасходыВнереализационные.Вставить(Выборка.Ссылка, Истина);
				КонецЦикла;
				
				// анализируем проводку на принадлежность к внереализационным доходам и расходам
				ЭтоВнереализационныеДоходыРасходы = Ложь;
				Если СчетКт<>ПланыСчетов.Хозрасчетный.ПустаяСсылка() 
				   И БухгалтерскийУчетПовтИсп.СчетВИерархии(СчетКт, ПланыСчетов.Хозрасчетный.ПрочиеДоходы) Тогда
					Для Каждого Субконто Из Проводка.СубконтоКт Цикл
						Если ТипЗнч(Субконто.Значение)=Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
							Если ПрочиеДоходыИРасходыВнереализационные[Субконто.Значение] = Истина Тогда
								ЭтоВнереализационныеДоходыРасходы = Истина;
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				Иначе
					Для Каждого Субконто Из Проводка.СубконтоДт Цикл
						Если ТипЗнч(Субконто.Значение)=Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
							Если ПрочиеДоходыИРасходыВнереализационные[Субконто.Значение] = Истина Тогда
								ЭтоВнереализационныеДоходыРасходы = Истина;
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если ЭтоВнереализационныеДоходыРасходы Тогда
					СчетЗабалансовогоУчета = ПланыСчетов.Хозрасчетный.ВнереализационныеРасходыНеУчитываемые;
				ИначеЕсли ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда=СчетДт Или ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда=СчетКт Тогда
					СчетЗабалансовогоУчета = ПланыСчетов.Хозрасчетный.ВыплатыВпользуФизЛицПоП_1_48;
				Иначе
					СчетЗабалансовогоУчета = ПланыСчетов.Хозрасчетный.ДругиеВыплатыПоП_1_48;
				КонецЕсли;
				
				НоваяПроводка = Операция.Движения.Хозрасчетный.Добавить();
				НоваяПроводка.Организация = Проводка.Организация;
				НоваяПроводка.Период      = Проводка.Период;
				НоваяПроводка.Содержание  = Проводка.Содержание;
				НоваяПроводка.СчетДт      = СчетЗабалансовогоУчета;
				НоваяПроводка.СуммаНУДт   = СуммаНеУчитываемыхРасходов;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//ХозРасчетный.ОчиститьНеИспользуемыеСуммы()
	
	ПоддержкаПБУ18 = УчетнаяПолитика.ПоддержкаПБУ18(Организация, Период);

	Если НЕ ПлательщикНалогаНаПрибыль Тогда
		Проводка.СуммаНУДт = 0;
		Проводка.СуммаНУКт = 0;
		Проводка.СуммаПРДт = 0;
		Проводка.СуммаПРКт = 0;
		Проводка.СуммаВРДт = 0;
		Проводка.СуммаВРКт = 0;
	ИначеЕсли НЕ ПоддержкаПБУ18 Тогда
		// Налог на прибыль уплачивается
		Проводка.СуммаПРДт = 0;
		Проводка.СуммаВРДт = 0;
		Проводка.СуммаПРКт = 0;
		Проводка.СуммаВРКт = 0;
	КонецЕсли;
	
	//ХозРасчетный.ПривестиПустыеЗначенияСубконтоСоставногоТипа()
	
	// Приведение пустых значений субконто составного типа.
	ВидыСоставныхСубконто = Новый соответствие;
	
	Для Каждого Субконто Из Проводка.СубконтоДт Цикл
		Составной = ВидыСоставныхСубконто.Получить(Субконто.Ключ);          //
		Если Составной=Неопределено Тогда                                   //  
			Составной = Субконто.Ключ.ТипЗначения.Типы().Количество() > 1;  // Кэширование: вид субконто + признак Составной
			ВидыСоставныхСубконто.Вставить(Субконто.Ключ,Составной);        //
		КонецЕсли;                                                          //
		Если Составной И НЕ ЗначениеЗаполнено(Субконто.Значение) И НЕ (Субконто.Значение=Неопределено) Тогда
			Проводка.СубконтоДт.Вставить(Субконто.Ключ, Неопределено);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Субконто Из Проводка.СубконтоКт Цикл
		Составной = ВидыСоставныхСубконто.Получить(Субконто.Ключ);          //
		Если Составной=Неопределено Тогда                                   //  
			Составной = Субконто.Ключ.ТипЗначения.Типы().Количество() > 1;  // Кэширование: вид субконто + признак Составной
			ВидыСоставныхСубконто.Вставить(Субконто.Ключ,Составной);        //
		КонецЕсли;                                                          //
		Если Составной И НЕ ЗначениеЗаполнено(Субконто.Значение) И НЕ (Субконто.Значение=Неопределено) Тогда
			Проводка.СубконтоКт.Вставить(Субконто.Ключ, Неопределено);
		КонецЕсли;
	КонецЦикла;
	
	// Проводки со статьей "Доходы (расходы), связанные с продажей (покупкой) валюты" в НУ не отражаются
	//СтатьяДоходовРасходовОтПродажиВалюты = Справочники.ПрочиеДоходыИРасходы.ДоходыРасходыПриПродажеПокупкеВалюты;
	//ЕстьДоходыРасходыОтПродажиВалюты = Ложь;
	//Для каждого Субконто Из Проводка.СубконтоДт Цикл
	//	Если Субконто.Значение=СтатьяДоходовРасходовОтПродажиВалюты Тогда
	//		ЕстьДоходыРасходыОтПродажиВалюты = Истина;
	//	КонецЕсли;
	//КонецЦикла;
	//Для каждого Субконто Из Проводка.СубконтоКт Цикл
	//	Если Субконто.Значение=СтатьяДоходовРасходовОтПродажиВалюты Тогда
	//		ЕстьДоходыРасходыОтПродажиВалюты = Истина;
	//	КонецЕсли;
	//КонецЦикла;
	//Если ЕстьДоходыРасходыОтПродажиВалюты Тогда
	//	Проводка.СуммаНУДт = 0;
	//	Проводка.СуммаНУКт = 0;
	//	Проводка.СуммаПРДт = 0;
	//	Проводка.СуммаПРКт = 0;
	//	Проводка.СуммаВРДт = 0;
	//	Проводка.СуммаВРКт = 0;
	//	Возврат;
	//КонецЕсли;
КонецПроцедуры //СкорректироватьНалоговыеСуммы()

Функция ПолучитьДокументРасчетовСКонтрагентом(Субконто, Счет, Операция)
	Если обЗначениеНеЗаполнено(Операция) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ДокументРасчетов = НайтиОбъектПоGUID(Субконто, "Документ.ДокументРасчетовСКонтрагентом");
	
	Если ЗначениеЗаполнено(ДокументРасчетов) Тогда
		Возврат	ДокументРасчетов;	
	КонецЕсли;
	
	Проводка = Операция.Движения.Хозрасчетный[Операция.Движения.Хозрасчетный.Количество() - 1];
	
	ДокументРасчетов = Документы.ДокументРасчетовСКонтрагентом.СоздатьДокумент();
	ДокументРасчетов.Дата						= Операция.Дата;
	ДокументРасчетов.Организация				= Операция.Организация;
	ДокументРасчетов.Контрагент					= Проводка["Субконто" + ?(Счет=Проводка.СчетДт, "Дт", "Кт")].Контрагенты;
	ДокументРасчетов.ДоговорКонтрагента			= Проводка["Субконто" + ?(Счет=Проводка.СчетДт, "Дт", "Кт")].Договоры;
	ДокументРасчетов.ВалютаДокумента			= ДокументРасчетов.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	//ДокументРасчетов.ДатаВходящегоДокумента	= ;
	//ДокументРасчетов.НомерВходящегоДокумента	= ;
	//ДокументРасчетов.СуммаДокумента			= ;
	ДокументРасчетов.Комментарий				= Операция.Содержание;
	
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		ДокументРасчетов.Записать();
	Исключение
		ТекстСообщения = "Не удалось записать документ " + ДокументРасчетов + Символы.ПС + "по причине:" + Символы.ПС + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецПопытки;
	
	Если ЗаписатьGUIDОбъекта(ДокументРасчетов.Ссылка, Субконто, "Документ.ДокументРасчетовСКонтрагентом") Тогда
		ЗафиксироватьТранзакцию();
		Возврат	ДокументРасчетов.Ссылка;
	Иначе
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецЕсли;
КонецФункции //ПолучитьДокументРасчетовСКонтрагентом()

Функция ПолучитьДокументПартии(Основание, Документ, Контрагент, Договор)
	Если обЗначениеНеЗаполнено(Основание) ИЛИ обЗначениеНеЗаполнено(Документ) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ДокументПартии = НайтиОбъектПоGUID(Основание, "Документ.Партия");
	
	Если ЗначениеЗаполнено(ДокументПартии) Тогда
		Возврат	ДокументПартии;	
	КонецЕсли;
	
	//Контрагент	= Документ.Контрагент;
	//Договор		= Документ.ДоговорКонтрагента;
	
	ДокументПартии = Документы.Партия.СоздатьДокумент();
	ДокументПартии.Дата						= Документ.Дата;
	ДокументПартии.Организация				= Документ.Организация;
	ДокументПартии.Контрагент				= Контрагент;
	ДокументПартии.ДоговорКонтрагента		= Договор;
	Если ЗначениеЗаполнено(ДокументПартии.ДоговорКонтрагента) Тогда
		ДокументПартии.ВалютаДокумента		= ДокументПартии.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	КонецЕсли;
	//ДокументПартии.СчетУчетаРасчетовСКомитентом	= ;
	ДокументПартии.Комментарий				= Документ.Комментарий;
	
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		ДокументПартии.Записать();
	Исключение
		ТекстСообщения = "Не удалось записать документ " + ДокументПартии + Символы.ПС + "по причине:" + Символы.ПС + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецПопытки;
	
	Если ЗаписатьGUIDОбъекта(ДокументПартии.Ссылка, Основание, "Документ.Партия") Тогда
		ЗафиксироватьТранзакцию();
		Возврат	ДокументПартии.Ссылка;
	Иначе
		ОтменитьТранзакцию();
		Возврат Неопределено;
	КонецЕсли;
КонецФункции //ПолучитьДокументПартии()

Процедура СформироватьДокументУстановкиРозничныхЦен(Знач Основание, тзРознЦен, GUID, ТекущийСтатус)
	
	НайденДокумент = Ложь;
	РезультатПоиска = НайтиОбъектПоGUID(GUID, "Документ.УстановкаЦенНоменклатуры");
	Если обЗначениеНеЗаполнено(РезультатПоиска) Тогда
		// если не нашли и документ не проведен, то создавать его не будем
		Если Число(ТекущийСтатус)<>2 Тогда
			НомерТекущейСтроки = ПропуститьБлок(НомерТекущейСтроки);
			Возврат;	
		КонецЕсли;
	Иначе
		НайденДокумент = Истина;
	КонецЕсли;
	
	Если НайденДокумент Тогда
		Попытка
			Документ = РезультатПоиска.ПолучитьОбъект();
		Исключение
			ТекстСообщения = "Не удалось создать объект документа. "+Символы.ПС+"Документ источник: "+Основание+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат;
		КонецПопытки;
		Документ.Товары.Очистить();
		Документ.ПометкаУдаления = Ложь;
	Иначе		
		Попытка
			Документ = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
		Исключение
			ТекстСообщения = "Не удалось получить объект документа. "+Символы.ПС+"Документ источник: "+Основание+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Лог.ДобавитьСтроку(ТекстСообщения);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(Документ);
	
	Документ.Дата			= Основание.Дата - 1;
	Документ.ТипЦен			= ?(обЗначениеНеЗаполнено(Основание.ТипЦен), Основание.Склад.ТипЦенРозничнойТорговли, Основание.ТипЦен);
	Документ.Комментарий	= Основание.Комментарий;
	Документ.Ответственный	= ПараметрыСеанса.ТекущийПользователь;
	
	//запрос для проверки существования документа установки цен, в этот-же день
	Запрос = Новый Запрос("
	|ВЫБРАТЬ Регистратор, Цена, Период
	|ИЗ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, Номенклатура=&Номенклатура И ТипЦен=&ТипЦен И Валюта=&Валюта И Регистратор<>&Ссылка)");
	Запрос.УстановитьПараметр("НаДату", НачалоДня(Документ.Дата));
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
	Запрос.УстановитьПараметр("ТипЦен", Документ.ТипЦен);
	Запрос.УстановитьПараметр("Валюта", Основание.ВалютаДокумента);
	
	тзНовыхЦен = Новый ТаблицаЗначений;
	тзНовыхЦен.Колонки.Добавить("Номенклатура");
	тзНовыхЦен.Колонки.Добавить("Цена");
	тзНовыхЦен.Колонки.Добавить("Регистратор");
	
	Для Каждого СтрокаЦен Из тзРознЦен Цикл
		Запрос.УстановитьПараметр("Номенклатура", СтрокаЦен.Номенклатура);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если СтрокаЦен.Цена=Выборка.Цена ИЛИ СтрокаЦен.Цена=0 Тогда
				Продолжить;
			ИначеЕсли Выборка.Период=НачалоДня(Документ.Дата) Тогда
				//запомним новые цены
				НоваяСтрока = тзНовыхЦен.Добавить();
				НоваяСтрока.Номенклатура = СтрокаЦен.Номенклатура;
				НоваяСтрока.Цена		 = СтрокаЦен.Цена;
				НоваяСтрока.Регистратор	 = Выборка.Регистратор;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НовСтр = Документ.Товары.Добавить();
		НовСтр.Номенклатура	= СтрокаЦен.Номенклатура;
		НовСтр.Цена			= СтрокаЦен.Цена;
		НовСтр.Валюта		= Основание.ВалютаДокумента;
	КонецЦикла;
	
	//если есть новые цены за день, изменим их в первоначальном документе
	//Если тзНовыхЦен.Количество()>0 Тогда
	//	тзНовыхЦен.Сортировать("Регистратор"); текДокСсылка = Неопределено; ОбДокумента = Неопределено;
	//	Для Каждого СтрокаТз Из тзНовыхЦен Цикл
	//		Если текДокСсылка<>СтрокаТз.Регистратор Тогда
	//			текДокСсылка = СтрокаТз.Регистратор;
	//			Если ОбДокумента<>Неопределено Тогда
	//				Попытка
	//					ОбДокумента.Записать(РежимЗаписиДокумента.Проведение);
	//				Исключение
	//					ТекстСообщения = "Не удалось перепровести документ установки цен: "+ОбДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
	//					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//				КонецПопытки;
	//			КонецЕсли;
	//			ОбДокумента = текДокСсылка.ПолучитьОбъект();
	//		КонецЕсли;
	//		СтрокаДок = ОбДокумента.Товары.Найти(СтрокаТз.Номенклатура);
	//		Если СтрокаДок<>Неопределено Тогда
	//			СтрокаДок.Цена = СтрокаТз.Цена;
	//		КонецЕсли;
	//	КонецЦикла;
	//	Если ОбДокумента<>Неопределено Тогда
	//		Попытка
	//			ОбДокумента.Записать(РежимЗаписиДокумента.Проведение);
	//		Исключение
	//			ТекстСообщения = "Не удалось перепровести документ установки цен: "+ОбДокумента+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЕсли;
	
	Если Документ.Товары.Количество()=0 И НЕ НайденДокумент Тогда
		Возврат;
	КонецЕсли;
	
	// сохраняем документ
	НачатьТранзакцию();
	Попытка
		Если Число(ТекущийСтатус)=0 Тогда
			Документ.ПометкаУдаления = Истина;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=1 Тогда
			Документ.ПометкаУдаления = Ложь;
			Документ.Проведен		 = Ложь;
			Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ИначеЕсли Число(ТекущийСтатус)=2 Тогда
			Документ.ПометкаУдаления = Ложь;
			Попытка
				Если НеПроводить Тогда
					Документ.Записать(РежимЗаписиДокумента.Запись);
				Иначе
					Документ.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ТекстСообщения = "Не удалось провести документ "+Документ+Символы.ПС+"Документ источник: "+Основание+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Лог.ДобавитьСтроку(ТекстСообщения);
				ОтменитьТранзакцию();
				// ну хоть записать попробуем...
				НачатьТранзакцию();
				Документ.ПометкаУдаления = Ложь;
				Документ.Проведен = Ложь;
				Документ.Записать();
			КонецПопытки;
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось записать документ "+Документ+Символы.ПС+"Документ источник: "+Основание+Символы.ПС+"по причине:"+Символы.ПС+ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Лог.ДобавитьСтроку(ТекстСообщения);
		ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;
	
	Если НайденДокумент Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Если ЗаписатьGUIDОбъекта(Документ.Ссылка, GUID, "Документ.УстановкаЦенНоменклатуры") Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //СформироватьДокументУстановкиРозничныхЦен()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ВЫГРУЗКИ ДАННЫХ

Процедура Выгрузить(ТекстФайла) Экспорт
	Текст = ТекстФайла;	
	
	Если ДокументыДляВыгрузки.Количество()=0 Тогда
		ЗаполнитьДокументыДляВыгрузки();
	КонецЕсли;

	// проверим что выгружать
	ЕстьДанные = Ложь;
	Для Каждого Строка Из ДокументыДляВыгрузки Цикл
		Если Строка.Пометка Тогда
			ЕстьДанные = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьДанные Тогда
		ТекстСообщения = "Нет документов для выгрузки !";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// Объекты, подлежащие выгрузке, накапливаем отдельно для справочников и документов
	тзЭлементов = Новый ТаблицаЗначений;
	тзЭлементов.Колонки.Добавить("Тип");
	тзЭлементов.Колонки.Добавить("Уровень");
	тзЭлементов.Колонки.Добавить("Ссылка");
	
	тзДокументов = Новый ТаблицаЗначений;
	тзДокументов.Колонки.Добавить("Документ");
	тзДокументов.Колонки.Добавить("ВидОперации");
	тзДокументов.Колонки.Добавить("Дата");
	тзДокументов.Колонки.Добавить("ДатаВыписки");
	тзДокументов.Колонки.Добавить("GUID");
	тзДокументов.Колонки.Добавить("ВалютаДокумента");
	тзДокументов.Колонки.Добавить("КурсДокумента");
	тзДокументов.Колонки.Добавить("Организация");
	тзДокументов.Колонки.Добавить("Подразделение");
	тзДокументов.Колонки.Добавить("СчетОрганизации");
	тзДокументов.Колонки.Добавить("Контрагент");
	тзДокументов.Колонки.Добавить("СчетКонтрагента");
	тзДокументов.Колонки.Добавить("ДоговорКонтрагента");
	тзДокументов.Колонки.Добавить("СтатьяДвиженияДенежныхСредств");
	тзДокументов.Колонки.Добавить("Оплачено");
	тзДокументов.Колонки.Добавить("Сделка");
	тзДокументов.Колонки.Добавить("СуммаПлатежа");
	тзДокументов.Колонки.Добавить("СтавкаНДС");
	тзДокументов.Колонки.Добавить("СуммаНДС");
	тзДокументов.Колонки.Добавить("Основание");
	
	// начало формирования выгрузки
	КолДок = 0;
	Для Каждого Строка Из ДокументыДляВыгрузки Цикл
		КолДок = КолДок + 1;
		
		Если НЕ Строка.Пометка Тогда Продолжить; КонецЕсли;
		
		ВыбДокумент = Строка.Документ;
		НоваяСтрока = тзДокументов.Добавить();
		НоваяСтрока.Документ			= ВыбДокумент.Ссылка;
		НоваяСтрока.ВидОперации			= ВыбДокумент.ВидОперации.Метаданные().ЗначенияПеречисления[Перечисления[ВыбДокумент.ВидОперации.Метаданные().Имя].Индекс(ВыбДокумент.ВидОперации)].Имя;
		НоваяСтрока.Дата				= ВыбДокумент.Дата;
		НоваяСтрока.GUID				= ВыбДокумент.Ссылка.УникальныйИдентификатор();
		НоваяСтрока.Организация 		= ВыбДокумент.Организация.УникальныйИдентификатор();
		ДобавитьПоСсылкам(ВыбДокумент.Организация);
		
		Подразделение = ?(ЭтоВерсияКорп, ВыбДокумент.ПодразделениеОрганизации, Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
		НоваяСтрока.Подразделение		= ?(обЗначениеНеЗаполнено(Подразделение), "", Подразделение.УникальныйИдентификатор());	
		ДобавитьПоСсылкам(Подразделение);
		
		Если ВыбДокумент.Метаданные().Имя<>"ПриходныйКассовыйОрдер" Тогда
			НоваяСтрока.СчетОрганизации = ?(обЗначениеНеЗаполнено(ВыбДокумент.СчетОрганизации), "", ВыбДокумент.СчетОрганизации.УникальныйИдентификатор());
			ДобавитьПоСсылкам(ВыбДокумент.СчетОрганизации);
		КонецЕсли;
		
		НоваяСтрока.Контрагент 			= ?(обЗначениеНеЗаполнено(ВыбДокумент.Контрагент), "", ВыбДокумент.Контрагент.УникальныйИдентификатор());
		ДобавитьПоСсылкам(ВыбДокумент.Контрагент);
		
		НоваяСтрока.ДоговорКонтрагента	= ?(обЗначениеНеЗаполнено(ВыбДокумент.ДоговорКонтрагента), "", ВыбДокумент.ДоговорКонтрагента.УникальныйИдентификатор());
		ДобавитьПоСсылкам(ВыбДокумент.ДоговорКонтрагента);
		
		НоваяСтрока.СтатьяДвиженияДенежныхСредств = ?(обЗначениеНеЗаполнено(ВыбДокумент.СтатьяДвиженияДенежныхСредств), "", ВыбДокумент.СтатьяДвиженияДенежныхСредств.УникальныйИдентификатор());
		ДобавитьПоСсылкам(ВыбДокумент.СтатьяДвиженияДенежныхСредств);
		
		НоваяСтрока.Основание			= ?(обЗначениеНеЗаполнено(ВыбДокумент.ДокументОснование), "", ВыбДокумент.ДокументОснование.УникальныйИдентификатор()); 

		Если Найти(ВыбДокумент.Метаданные().Имя,"Кассовый")>0 Тогда
			НоваяСтрока.ДатаВыписки 	= ВыбДокумент.Дата;
			НоваяСтрока.Оплачено 		= "Истина";
		Иначе	
			НоваяСтрока.СчетКонтрагента = ?(обЗначениеНеЗаполнено(ВыбДокумент.СчетКонтрагента), "", ВыбДокумент.СчетКонтрагента.УникальныйИдентификатор());
			ДобавитьПоСсылкам(ВыбДокумент.СчетКонтрагента.Ссылка);
			Если обЗначениеНеЗаполнено(ВыбДокумент.ДатаВходящегоДокумента)
				Или НачалоДня(ВыбДокумент.ДатаВходящегоДокумента)=НачалоДня(ВыбДокумент.Дата) Тогда
				НоваяСтрока.ДатаВыписки	= ВыбДокумент.Дата;
			Иначе
				НоваяСтрока.ДатаВыписки = КонецДня(ВыбДокумент.ДатаВходящегоДокумента);	
			КонецЕсли;
			НоваяСтрока.Оплачено 		= "Истина";//Строка(ВыбДокумент.Оплачено);
		КонецЕсли;
		
		НоваяСтрока.СуммаПлатежа		= ВыбДокумент.СуммаДокумента;
		
		Если ВыбДокумент.РасшифровкаПлатежа.Количество()<>0 Тогда
			СтрокаДок = ВыбДокумент.РасшифровкаПлатежа[0];
			ДоговорКонтрагента = СтрокаДок.ДоговорКонтрагента;
			Если обЗначениеНеЗаполнено(ДоговорКонтрагента) Тогда
				Для Каждого РеквДок Из ВыбДокумент.Метаданные().Реквизиты Цикл
					Если ТипЗнч(ВыбДокумент[РеквДок.Имя])=Тип("СправочникСсылка.ДоговорыКонтрагентов") И ЗначениеЗаполнено(ВыбДокумент[РеквДок.Имя]) Тогда
						ДоговорКонтрагента = ВыбДокумент[РеквДок.Имя];	
					КонецЕсли;
				КонецЦикла;
				Если обЗначениеНеЗаполнено(ДоговорКонтрагента) И ЗначениеЗаполнено(ВыбДокумент.Контрагент) И ТипЗнч(ВыбДокумент.Контрагент)=Тип("СправочникСсылка.Контрагенты") Тогда
					ДоговорКонтрагента = ПолучитьОсновнойДоговор(ВыбДокумент.Контрагент, ВыбДокумент.Организация);	
				КонецЕсли;
			КонецЕсли;
			
			НоваяСтрока.ДоговорКонтрагента 			  = ?(обЗначениеНеЗаполнено(ДоговорКонтрагента), "", ДоговорКонтрагента.УникальныйИдентификатор());
			ДобавитьПоСсылкам(ДоговорКонтрагента);
			
			НоваяСтрока.Сделка				  		  = ?(обЗначениеНеЗаполнено(СтрокаДок.Сделка), "", СтрокаДок.Сделка.УникальныйИдентификатор());
			ДобавитьПоСсылкам(СтрокаДок.Сделка);
			
			НоваяСтрока.СтатьяДвиженияДенежныхСредств = ?(обЗначениеНеЗаполнено(СтрокаДок.СтатьяДвиженияДенежныхСредств), "", СтрокаДок.СтатьяДвиженияДенежныхСредств.УникальныйИдентификатор());
			ДобавитьПоСсылкам(СтрокаДок.СтатьяДвиженияДенежныхСредств);
			
			НоваяСтрока.СуммаПлатежа				  = СтрокаДок.СуммаПлатежа;
			НоваяСтрока.СтавкаНДС					  = СокрЛП(СтрокаДок.СтавкаНДС);
			НоваяСтрока.СуммаНДС					  = СтрокаДок.СуммаНДС;
		КонецЕсли;
	КонецЦикла;
	
	// Шапка файла с идентификатором конфигурации
	ИдентификаторКонфигурации = "{""" + ПредставлениеРеквизита(СокрЛП(Метаданные.Синоним)) + """,""" + ПредставлениеРеквизита(Метаданные.Версия) + """,""" + РелизыТК + """,""" + ВерсияОбмена + """,""" + СокрЛП(ТекущаяДата()) + """,""" + ?(ДатаНачала = Дата("00010101"), "", Формат(ДатаНачала,"ДЛФ=D")) + """,""" + ?(ДатаКонца = Дата("00010101"), "", Формат(ДатаКонца,"ДЛФ=D")) + """,""v8""}";
	// запишем строку
	Текст.ДобавитьСтроку(ИдентификаторКонфигурации);
	
	Если тзЭлементов.Количество()>0 Тогда	
		ПредТип = "";
		тзЭлементов.Сортировать("Тип,Уровень,Ссылка");
			
		ПервыйСправочник = Истина;
			
		Для Каждого ТекСтрока Из тзЭлементов Цикл
			Если ТекСтрока.Тип<>ПредТип Тогда
				ПервыйОбъект = Истина;
			КонецЕсли;
				
			ВыгрузитьОбъект(ТекСтрока);
			Если ПервыйОбъект Тогда ПервыйОбъект = Ложь; КонецЕсли;
			Если ПервыйСправочник Тогда ПервыйСправочник = Ложь; КонецЕсли;
				
			ПредТип = ТекСтрока.Тип;
		КонецЦикла;	
		Текст.ДобавитьСтроку(КонецБлокаДанных);
	КонецЕсли;
	
	
	Если тзДокументов.Количество()>0 Тогда
		ВыгрузитьДокументы();		
	КонецЕсли; 
	
	ДокументыДляВыгрузки.Очистить();
	
	ТекстФайла = Текст;	
КонецПроцедуры //Выгрузить()

//ПроцедураВыгрузкиДокументов
Процедура ВыгрузитьДокументы()
	ТекДокумент = ""; КолДок=0;
	Для каждого ТекСтрока Из тзДокументов Цикл
		КолДок = КолДок + 1;
		Если ТекСтрока.Документ<>ТекДокумент Тогда
			Если ТекДокумент<>"" Тогда
				Текст.ДобавитьСтроку(КонецБлокаДанных);
			КонецЕсли;
			
			Статус = 2;
			Если ТекСтрока.Документ.ПометкаУдаления Тогда
				Статус = 0;
			ИначеЕсли НЕ ТекСтрока.Документ.Проведен Тогда
				Статус = 1;
			КонецЕсли;
			
			Если ТекСтрока.Документ.Метаданные().Имя="ПоступлениеНаРасчетныйСчет" Тогда
				ТипДокумента = "Документ_Выписка_Приход";
			ИначеЕсли ТекСтрока.Документ.Метаданные().Имя="СписаниеСРасчетногоСчета" Тогда
				ТипДокумента = "Документ_Выписка_Расход";
			ИначеЕсли ТекСтрока.Документ.Метаданные().Имя="ПриходныйКассовыйОрдер" Тогда
				ТипДокумента = "Документ_ПКО";
			ИначеЕсли ТекСтрока.Документ.Метаданные().Имя="РасходныйКассовыйОрдер" Тогда
				ТипДокумента = "Документ_РКО";
			//ИначеЕсли ТекСтрока.Документ.Метаданные().Имя="ПлатежноеПоручение" Тогда
			//	ТипДокумента = "Документ_ПлатежноеПоручение";
			КонецЕсли;
			
			ОбщееОписание = " {"+ТипДокумента+", """ + УбратьСимволы(ТекСтрока.Документ,",") + """, """ + ТекСтрока.ВидОперации + """, """ + ТекСтрока.Дата + """, """ + ТекСтрока.ДатаВыписки + """, """ + ТекСтрока.GUID + """, """ + Статус + """, """ + ТекСтрока.Организация + """, """ + ТекСтрока.Подразделение + """, """ + ТекСтрока.СчетОрганизации + """, """ + ТекСтрока.Оплачено + """, """ + ТекСтрока.Основание + """}";			

			Текст.ДобавитьСтроку(ОбщееОписание);
			ТекДокумент = ТекСтрока.Документ;
		КонецЕсли;
		
		ОбщееОписание = "   {""" + ТекСтрока.Контрагент + """, """ + ТекСтрока.СчетКонтрагента + """, """ + ТекСтрока.ДоговорКонтрагента + """, """ + ТекСтрока.СтатьяДвиженияДенежныхСредств + """, """ + ТекСтрока.Сделка + """, """ + Формат(ТекСтрока.СуммаПлатежа,"ЧРД=.; ЧГ=0") + """, """ + ТекСтрока.СтавкаНДС + """, """ + Формат(ТекСтрока.СуммаНДС,"ЧРД=.; ЧГ=0") + """}";
		Текст.ДобавитьСтроку(ОбщееОписание);
	КонецЦикла;
	
	Текст.ДобавитьСтроку(КонецБлокаДанных);
КонецПроцедуры //ВыгрузитьДокументы()

// Выгружает структуру реквизитов или значения реквизитов
Процедура ВыгрузитьРеквизиты(НаборРеквизитов, Ссылка, ЭтоСтруктура=Ложь) 
	Для Каждого Рекв Из НаборРеквизитов Цикл
		СтрТипов      = "";
		Квалификаторы = ?(ТипЗнч(Рекв)<>Тип("КолонкаРезультатаЗапроса"), Рекв.Тип, Рекв.ТипЗначения);
		ТипыРеквизита = Квалификаторы.Типы();
		СоставнойТип  = Ложь;
		ПервыйТип     = Истина;
		
		Для Каждого Тип Из ТипыРеквизита Цикл
			Если Справочники.ТипВсеСсылки().СодержитТип(Тип) Тогда ТипСтр = "Справочник";
			ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(Тип) Тогда ТипСтр = "Перечисление";
			Иначе ТипСтр = Строка(Тип);
			КонецЕсли;
			
			Если Найти(СтрТипов,ТипСтр)=0 Тогда
				СтрТипов = СтрТипов + ?(СтрТипов="", "" , ";") + ТипСтр;
			КонецЕсли;
			
			Если ТипЗнч(Рекв)<>Тип("КолонкаРезультатаЗапроса") И НЕ ПервыйТип Тогда
				СоставнойТип = Истина;
			КонецЕсли;
			
			Если ПервыйТип Тогда ПервыйТип = Ложь; КонецЕсли;
		КонецЦикла;
		
		// Если ссылка на объект пуста, то выгрузим структуру реквизитов
		Если ЭтоСтруктура Тогда
			Длина	 = Квалификаторы.КвалификаторыСтроки.Длина;
			Точность = 0;
			Если Длина=0 Тогда
				Длина    = Квалификаторы.КвалификаторыЧисла.Разрядность;
				Точность = Квалификаторы.КвалификаторыЧисла.РазрядностьДробнойЧасти;
			КонецЕсли;
			
			СтрТипов = СтрЗаменить(СтрЗаменить(СтрТипов, "Null, ", ""), ", Null", "");
			СтрТипов = СтрЗаменить(СтрЗаменить(СтрТипов, "Null; ", ""), "; Null", "");
			СтрТипов = СтрЗаменить(СтрЗаменить(СтрТипов, "Null,",  ""), ",Null",  "");
			СтрТипов = СтрЗаменить(СтрЗаменить(СтрТипов, "Null;",  ""), ";Null",  "");
			
			ОбщееОписание = ОбщееОписание + "{""" + Рекв.Имя + """,""" + СтрТипов + """," + СокрЛП(Длина) + "," + СокрЛП(Точность) + ",""" + ПредставлениеРеквизита(СоставнойТип) + """}";
		Иначе
			ОбщееОписание = ОбщееОписание + "," + ПредставлениеРеквизита(Ссылка[Рекв.Имя], СоставнойТип);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЭтоСтруктура Тогда
		ОбщееОписание = ОбщееОписание + "}";
	КонецЕсли;
	
	Текст.ДобавитьСтроку(ОбщееОписание);
КонецПроцедуры	//	ВыгрузитьРеквизиты()

// Выгружает объект в файл-выгрузки и добавляет "связанные" значения реквизитов
Процедура ВыгрузитьОбъект(ТекСтрокаОбъекта) 
	Ссылка   = ТекСтрокаОбъекта.Ссылка;
	ТекТипЗн = ТипЗнч(Ссылка);
	ТипВыгружаемого = СокрЛП(ТекТипЗн);
	
	// Для первого объекта (т.е. если объекты данного вида еще не выгружались)
	// добавим системную информацию и структуру реквизитов
	Если ПервыйОбъект Тогда
		ИдентификаторВладельца = "";
		Для Каждого Владелец Из Ссылка.Метаданные().Владельцы Цикл
			ИдентификаторВладельца = ИдентификаторВладельца + ?(ИдентификаторВладельца="", "", ";") + Владелец.Имя;
		КонецЦикла;
		
		ДлинаКода         = СокрЛП(Ссылка.Метаданные().ДлинаКода);
		ДлинаНаименования = СокрЛП(Ссылка.Метаданные().ДлинаНаименования);
		КоличествоУровней = СокрЛП(Ссылка.Метаданные().КоличествоУровней);
		
		ОбщееОписание = "{""Справочник." + Ссылка.Метаданные().Имя + """," + ДлинаКода + "," + ДлинаНаименования + ",""" + ИдентификаторВладельца + """}";
		Если НЕ ПервыйСправочник Тогда
			Текст.ДобавитьСтроку(КонецБлокаДанных);
		КонецЕсли;
		Текст.ДобавитьСтроку(ОбщееОписание);
		ОбщееОписание = "  ";
		ВыгрузитьРеквизиты(Ссылка.Метаданные().Реквизиты, Ссылка, Истина);
		Если Найти(ТипВыгружаемого,"Документ")>0 Тогда
			Для Каждого ТекТабл Из Ссылка.Метаданные().ТабличныеЧасти Цикл
				ОбщееОписание = "  {""Таблица." + ТекТабл.Имя + """}";
				ВыгрузитьРеквизиты(ТекТабл.Реквизиты, Ссылка[ТекТабл.Имя], Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
		
	ИдентификаторБД		= СокрЛП(Ссылка.УникальныйИдентификатор());
	Уровень 			= СокрЛП(ТекСтрокаОбъекта.Уровень);
	Владелец 			= ПредставлениеРеквизита(?(обЗначениеНеЗаполнено(Ссылка.Владелец), "", Ссылка.Владелец.Наименование));
	ИДВладельца			= СокрЛП(?(обЗначениеНеЗаполнено(Ссылка.Владелец), "", Ссылка.Владелец.УникальныйИдентификатор()));
	ВладелецСправочник 	= СокрЛП(?(обЗначениеНеЗаполнено(Ссылка.Владелец), "", Ссылка.Владелец.Ссылка.Метаданные().Имя));
	Родитель 			= СокрЛП(?(обЗначениеНеЗаполнено(Ссылка.Родитель), "", Ссылка.Родитель.УникальныйИдентификатор()));
	ЭтоГруппа 			= ПредставлениеРеквизита(Ссылка.ЭтоГруппа);
	Код 				= СокрЛП(Ссылка.Код);
	Наименование 		= ПредставлениеРеквизита(Ссылка.Наименование);
	ОбщееОписание 		= "    {" + Уровень + ",""" + ИдентификаторБД + """,""" + ПредставлениеРеквизита(Владелец) + """,""" + ИДВладельца + """,""" + ВладелецСправочник + """,""" + Родитель + """,""" + ЭтоГруппа + """,""" + Код + """," + ПредставлениеРеквизита(Наименование);
	
	// Ну и выгрузим значения реквизитов
	ВыгрузитьРеквизиты(Ссылка.Метаданные().Реквизиты, Ссылка);
	Если Найти(ТипВыгружаемого,"Документ")>0 Тогда
		Для Каждого ТекТабл Из Ссылка.Метаданные().ТабличныеЧасти Цикл
			Для Каждого ТекСтрока Из Ссылка[ТекТабл.Имя] Цикл
				ОбщееОписание = "    {""Таблица." + ТекТабл.Имя + """";
				ВыгрузитьРеквизиты(ТекТабл.Реквизиты, ТекСтрока);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры	//ВыгрузитьОбъект()

// Процедура поиска данных ссылочного типа в обрабатываемом объекте
Процедура ДобавитьПоСсылкам(Знач ЗнРекв, Знач Уровень=1) 
	
	// Проверим, может хватит "углубляться" по ссылкам?
	Если Уровень>3 Тогда Возврат; КонецЕсли;
	
	// Работаем только со справочниками
	ТекТипЗн = ТипЗнч(ЗнРекв);
	Если ЗнРекв=Неопределено Тогда Возврат; КонецЕсли;
	Если НЕ Справочники.ТипВсеСсылки().СодержитТип(ТекТипЗн) Тогда Возврат; КонецЕсли;
	Если ЗнРекв.Пустая() Тогда Возврат; КонецЕсли;
	
	// Добавим сам объект для которого ищем ссылки в таблицу выгружаемых объектов
	ТекСтрока = тзЭлементов.Найти(ЗнРекв, "Ссылка");
	Если ТекСтрока<>Неопределено Тогда
		Если ТекСтрока.Уровень>Уровень И ЗнРекв.ЭтоГруппа Тогда
			ТекСтрока.Уровень = Уровень;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	// Для справочников, обязательно сначала выгрузим владельца и родителя
	Если ЗнРекв.Владелец<>Неопределено Тогда
		Если НЕ ЗнРекв.Владелец.Пустая() Тогда
			ДобавитьПоСсылкам(ЗнРекв.Владелец, Уровень-1);
		КонецЕсли;
	КонецЕсли;
	Если ЗнРекв.Родитель<>Неопределено И ТипЗнч(ЗнРекв)<>Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда //отключим выгрузку иерархии для подразделений
		Если НЕ ЗнРекв.Родитель.Пустая() Тогда
			ДобавитьПоСсылкам(ЗнРекв.Родитель, Уровень-1);
		КонецЕсли;
	КонецЕсли;
	
	ТекСтрока = тзЭлементов.Найти(ЗнРекв, "Ссылка");
	Если ТекСтрока=Неопределено Тогда
		ТекСтрока = тзЭлементов.Добавить();
		ТекСтрока.Тип     = ТипЗнч(ЗнРекв);
		ТекСтрока.Уровень = Уровень;
		ТекСтрока.Ссылка  = ЗнРекв;
	КонецЕсли;
	
	// Пройдемся по реквизитам объекта
	Для Каждого Рекв Из ЗнРекв.Метаданные().Реквизиты Цикл
		ДобавитьПоСсылкам(ЗнРекв[Рекв.Имя], Уровень);
	КонецЦикла;
КонецПроцедуры	//ДобавитьПоСсылкам()

Процедура ЗаполнитьДокументыДляВыгрузки() Экспорт
	ДокументыДляВыгрузки.Очистить();
	
	Если ВидыДокументов.Найти(Истина, "Пометка")=Неопределено Тогда Возврат; КонецЕсли;
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНачала"));;
	Параметр.Значение = ДатаНачала;
	Параметр.Использование = Истина;
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаКонца"));;
	Параметр.Значение = КонецДня(ДатаКонца);
	Параметр.Использование = Истина;
	
	
	СхемаКД = ПолучитьМакет("СхемаКомпановкиДанных");
	
	ОбщийНаборДанных = СхемаКД.НаборыДанных.Найти("НаборДанныхОбъединение");
	ОбщийНаборДанных.Элементы.Очистить();
	
	Для Каждого ТекВидДокумента Из ВидыДокументов Цикл
		Если НЕ ТекВидДокумента.Пометка Тогда
			Продолжить;
		КонецЕсли;
	
		Набор = ОбщийНаборДанных.Элементы.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		Набор.Запрос = "
		|ВЫБРАТЬ
		|	Ссылка,
		|	ВидОперации,
		|	Организация,
		|	Контрагент,
		|	СтатьяДвиженияДенежныхСредств
		|ИЗ
		|	Документ." + ТекВидДокумента.Объект + "
		|ГДЕ Дата МЕЖДУ &ДатаНачала И &ДатаКонца";
		Набор.Имя = ТекВидДокумента.Объект;//"ПоступлениеНаРасчетныйСчет";
		Набор.ИсточникДанных = "ИсточникДанных1";
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.Настройки;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКД, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// Построение таблицы значений.
	Процессор = Новый ПроцессорКомпоновкиДанных;
	Процессор.Инициализировать(МакетКомпоновкиДанных);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	тзПлДок = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(тзПлДок);	
	ПроцессорВывода.Вывести(Процессор);
	
	ДокументыДляВыгрузки.Загрузить(тзПлДок);	
	
КонецПроцедуры //ЗаполнитьДокументыДляВыгрузки()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// Начальная инициализация данных обработки
Инициализация();
#КонецЕсли