
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Номенклатура", ПараметрКоманды));
	ПараметрыФормы.Вставить("СкрытьНоменклатуру", Истина);
	ПараметрыФормы.Вставить("ЗакрепитьСПрава", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	Массив = Новый Массив;
	Массив.Добавить("Номенклатура");
	ПараметрыФормы.Вставить("ЗаблокированныеПоля", Массив);
	
	ОткрытьФорму(
		"РегистрСведений.ЯчейкиХраненияПоУмолчанию.ФормаСписка",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
