
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// +Рарус Сделано для того чтобы была возможность редактировать общие реквизиты из типов номенклатуры.
	//ТолькоПросмотр = Истина;
	// -Рарус
	
	ВидыСвойствНабора = УправлениеСвойствамиСлужебный.ВидыСвойствНабора(Объект.Ссылка);
	ИспользоватьДопРеквизиты = ВидыСвойствНабора.ДополнительныеРеквизиты;
	ИспользоватьДопСведения  = ВидыСвойствНабора.ДополнительныеСведения;
	
	Если ИспользоватьДопРеквизиты И ИспользоватьДопСведения Тогда
		Заголовок = Объект.Наименование + " " + НСтр("ru = '(Набор дополнительных реквизитов и сведений)'")
		
	ИначеЕсли ИспользоватьДопРеквизиты Тогда
		Заголовок = Объект.Наименование + " " + НСтр("ru = '(Набор дополнительных реквизитов)'")
		
	ИначеЕсли ИспользоватьДопСведения Тогда
		Заголовок = Объект.Наименование + " " + НСтр("ru = '(Набор дополнительных сведений)'")
	КонецЕсли;
	
	Если НЕ ИспользоватьДопРеквизиты И Объект.ДополнительныеРеквизиты.Количество() = 0 Тогда
		Элементы.ДополнительныеРеквизиты.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ ИспользоватьДопСведения И Объект.ДополнительныеСведения.Количество() = 0 Тогда
		Элементы.ДополнительныеСведения.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// +Рарус

// Производит подбор дополнительных реквизитов и свойств.
//
// Параметры:
//  Таблица                   - ДанныеФормаСтруктура - Имя данных формы для которых производиться подбор.
//  Владелец                  - Таблица формы        - Таблица формы в которую будет помещен результат подбора.
//  ЭтоДополнительноеСведение - Булево               - Позволяет определить вид необходимых данных.
//                                                      Истина - дополнительные свойства;
//                                                      Ложь - дополнительные реквизиты.
//
&НаКлиенте
Процедура ПодобратьДополнительныеСвойства(Таблица,Владелец,ЭтоДополнительноеСведение)
	
	// +РАРУС
	НаборСвойств = ПредопределенноеЗначение("Справочник.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура_Общие");
	
	ДоступныеНаборыСвойств = Новый Массив();
	ДоступныеНаборыСвойств.Добавить(ПредопределенноеЗначение("Справочник.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка"));
	ДоступныеНаборыСвойств.Добавить(НаборСвойств);
	
	Отбор = Новый Структура("НаборСвойств", ДоступныеНаборыСвойств);
	// -РАРУС
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	// +РАРУС
	ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", ЭтоДополнительноеСведение);
	ПараметрыФормы.Вставить("ДополнительныеПараметры", Новый Структура("ТекущийНаборСвойств", НаборСвойств));
	// -РАРУС
	
	ВыбранныеСвойства = Новый Массив;
	
	Если ЭтоДополнительноеСведение Тогда
		Для Каждого Строка Из Таблица.ДополнительныеСведения Цикл
			ВыбранныеСвойства.Добавить(Строка.Свойство);
		КонецЦикла;
		ВладелецФормы = Владелец;
	Иначе
		Для Каждого Строка Из Таблица.ДополнительныеРеквизиты Цикл
			ВыбранныеСвойства.Добавить(Строка.Свойство);
		КонецЦикла;
		ВладелецФормы = Владелец;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ВыбранныеЗначения", ВыбранныеСвойства);
	
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаВыбора",
	             ПараметрыФормы,
	             ВладелецФормы,
	             Объект.Ссылка);
	
КонецПроцедуры // ПодобратьДополнительныеСвойства()

// Обработчик события, вызывающийся перед началом интерактивного добавления строки.
//
// Параметры:
//  ВыбранноеЗначение - Выбранное значение.
//  Таблица           - ДанныеФормыКоллекция - Таблица формы в которой произошло событие.
//
&НаКлиенте
Процедура ОбработкаВыбораСвойства(ВыбранноеЗначение, Таблица)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Для каждого Значение Из ВыбранноеЗначение Цикл
			ДобавитьВыбранноеСвойство(Значение, Таблица);
		КонецЦикла;
	Иначе
		ДобавитьВыбранноеСвойство(ВыбранноеЗначение, Таблица);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаВыбораСвойства()

// Процедура добавляющая выбранные подбором строки.
//
// Параметры:
//  Значение - Выбранное значение.
//  Таблица  - ДанныеФормыКоллекция - Таблица формы в которой произошло событие.
//
&НаКлиенте
Процедура ДобавитьВыбранноеСвойство(Значение, Таблица)
	
	Если ТипЗнч(Значение) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
		
		Отбор = Новый Структура("Свойство", Значение);
		Если Таблица.НайтиСтроки(Отбор).Количество() = 0 Тогда
			
			Таблица.Добавить().Свойство = Значение;
			Модифицированность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьВыбранноеСвойство()

// Обработчик события возникающего при нажатии кнопки "Подбор" табличного поля "Дополнительные реквизиты" на странице "Наборы свойств номенклатуры".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПодборДопРеквизитов(Команда)
	
	ПодобратьДополнительныеСвойства(Объект,Элементы.ДополнительныеРеквизиты,Ложь);
	
КонецПроцедуры // ПодборДопРеквизитов()

// Обработчик события возникающего при нажатии кнопки "Подбор" табличного поля "Дополнительные сведения" на странице "Наборы свойств номенклатуры".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПодборДопСведений(Команда)
	
	ПодобратьДополнительныеСвойства(Объект,Элементы.ДополнительныеСведения,Истина);
	
КонецПроцедуры // ПодборДопСведений()

// Обработчик события вызывающийся перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент              - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбранноеЗначение    - Выбранное значение.
//  СтандартнаяОбработка - Булево    - В данный параметр передается признак выполнения стандартной (системной) обработки события..
//
&НаКлиенте
Процедура ДополнительныеРеквизитыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбработкаВыбораСвойства(ВыбранноеЗначение, Объект.ДополнительныеРеквизиты);
	
КонецПроцедуры //ДополнительныеРеквизитыОбработкаВыбора()

// Обработчик события вызывающийся перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент              - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбранноеЗначение    - Выбранное значение.
//  СтандартнаяОбработка - Булево    - В данный параметр передается признак выполнения стандартной (системной) обработки события..
//
&НаКлиенте
Процедура ДополнительныеСведенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбработкаВыбораСвойства(ВыбранноеЗначение, Объект.ДополнительныеСведения);
	
КонецПроцедуры //ДополнительныеСведенияОбработкаВыбора()

// -РАРУС

