// Модуль основной формы документа "Назначение скидок строки"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьДеревоПодразделений()
	
	УправлениеДиалогомСервер.ЗаполнитьДеревоПодразделений(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДеньНедели()
	
	ТекущиеДанные = Элементы.Скидки.ТекущиеДанные;
	
	ТекущиеДанные.ДниНедели = ?(ПустаяСтрока(ТекущиеДанные.ДниНедели), "0000000", ТекущиеДанные.ДниНедели);
	
	ИмяКолонки = СтрЗаменить(Элементы.Скидки.ТекущийЭлемент.Имя, "Скидки", "");
	
	Действует  = ТекущиеДанные[ИмяКолонки];
	Значение   = ?(Действует, "1", "0");
	
	НомерДня = 1;
	Для Каждого ЭлементСписка Из СписокДней Цикл
		Если ЭлементСписка.Представление = ИмяКолонки Тогда
			НомерДня = ЭлементСписка.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЛеваяЧасть  = Лев(ТекущиеДанные.ДниНедели, НомерДня-1);
	ПраваяЧасть = Сред(ТекущиеДанные.ДниНедели, НомерДня+1);
	
	ТекущиеДанные.ДниНедели = ЛеваяЧасть + Значение + ПраваяЧасть;
	
КонецПроцедуры // УстановитьДеньНедели()

&НаСервере
Процедура ОбновитьНаименованияСкидокВОборудовании()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СоответствиеСкидокВОборудовании.Наименование КАК Наименование,
	|	СоответствиеСкидокВОборудовании.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.СоответствиеСкидокВОборудовании КАК СоответствиеСкидокВОборудовании
	|ГДЕ
	|	СоответствиеСкидокВОборудовании.Идентификатор В (&Идентификаторы)
	|";
	
	Запрос.УстановитьПараметр("Идентификаторы", Объект.Скидки.Выгрузить(, "ИдентификаторСкидкиВОборудовании").ВыгрузитьКолонку("ИдентификаторСкидкиВОборудовании"));
	
	Скидки = Объект.Скидки;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеСтроки = Скидки.НайтиСтроки(Новый Структура("ИдентификаторСкидкиВОборудовании", Выборка.Идентификатор));
		Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			ТекущаяСтрока.НаименованиеСкидкиВОборудовании = Выборка.Наименование;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыСкидок()
	
	Для Каждого ТекущаяСтрока Из Объект.Скидки Цикл
		
		ОбновитьПараметрыСкидки(ТекущаяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры // ОбновитьПараметрыСкидок()

&НаСервере
Процедура ОбновитьПараметрыСкидки(ТекущаяСтрока)
	
	Для Каждого ДеньНедели Из СписокДней Цикл
		ТекущаяСтрока[ДеньНедели.Представление] = (Сред(ТекущаяСтрока.ДниНедели, ДеньНедели.Значение, 1) = "1");
	КонецЦикла;
		
	Если ЗначениеЗаполнено(ТекущаяСтрока.Скидка.ВидСвойства) Тогда
		
		ТекущаяСтрока.Свойство = ТекущаяСтрока.Скидка.ВидСвойства.ТипЗначения.ПривестиЗначение(ТекущаяСтрока.Свойство);
		
		Если ЕстьРеквизит(Объект, "ВладелецСвойства", "Скидки") Тогда
			
			ТекущаяСтрока.ВладелецСвойства = ?(ТипЗнч(ТекущаяСтрока.Свойство)=Тип("СправочникСсылка.ЗначенияСвойствОбъектов"), ТекущаяСтрока.Скидка.ВидСвойства, Неопределено);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбновитьПараметрыСкидки()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаОповещенияЗаполнитьДействующимиСкидками(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДействующимиСкидкамиНаСервере();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияЗаполнитьДействующимиСкидками()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
	СписокДней.Добавить(1, "ДниНеделиПн");
	СписокДней.Добавить(2, "ДниНеделиВт");
	СписокДней.Добавить(3, "ДниНеделиСр");
	СписокДней.Добавить(4, "ДниНеделиЧт");
	СписокДней.Добавить(5, "ДниНеделиПт");
	СписокДней.Добавить(6, "ДниНеделиСб");
	СписокДней.Добавить(7, "ДниНеделиВс");
	
	ОбновитьПараметрыСкидок();
	
	ВидыНоменклатуры = Справочники.ХозОперации.ПолучитьВидыНоменклатуры(Объект.ХозОперация);
	Если Не Элементы.Найти("СкидкиНоменклатура")=Неопределено Тогда
		УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.СкидкиНоменклатура.ПараметрыВыбора, "Отбор.ВидНоменклатуры", ВидыНоменклатуры);
	КонецЕсли;
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	ОтменаСкидки = (Объект.ХозОперация = Справочники.ХозОперации.ОтменаСтрочныхСкидок);
	
	//определение видимости колонк Время действия и Дни недели
	ВидимостьВремени = Элементы.СкидкиВывестиКолонкиВремяИДниНедели.Пометка;
	Элементы.СкидкиНачВремя.Видимость    = ВидимостьВремени;
	Элементы.СкидкиКонВремя.Видимость    = ВидимостьВремени;
	Элементы.СкидкиДниНеделиПн.Видимость = ВидимостьВремени;
	Элементы.СкидкиДниНеделиВт.Видимость = ВидимостьВремени;
	Элементы.СкидкиДниНеделиСр.Видимость = ВидимостьВремени;
	Элементы.СкидкиДниНеделиЧт.Видимость = ВидимостьВремени;
	Элементы.СкидкиДниНеделиПт.Видимость = ВидимостьВремени;
	Элементы.СкидкиДниНеделиСб.Видимость = ВидимостьВремени;
	Элементы.СкидкиДниНеделиВс.Видимость = ВидимостьВремени;
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
		
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОбработчикаКоманды = ПолучитьЗначениеПараметраСтруктуры(РезультатОповещения, "ИмяОбработчикаКоманды", "");
	Если ИмяОбработчикаКоманды = "ПодразделенияОчиститьТабличнуюЧасть" Тогда
		УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивно(ДеревоПодразделений.ПолучитьЭлементы(), Ложь, Объект.Подразделения);
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения - Произвольный - Результат выполнения операции в подчиненной форме.
//
&НаСервере
Процедура ОбработкаРезультатаВыбораСкидкиОборудованияНаСервере(РезультатОповещения)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	ТекущиеДанные.ИдентификаторСкидкиВОборудовании = РезультатОповещения.Идентификатор;
	ТекущиеДанные.НаименованиеСкидкиВОборудовании  = РезультатОповещения.Идентификатор;
	
	СкидкиНаименованиеСкидкиВОборудованииПриИзмененииНаСервере();
	//
	//ВремСкидка = ТекущиеДанные.Скидка;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "
	//|ВЫБРАТЬ
	//|	СоответствиеСкидокВОборудовании.Наименование КАК Наименование,
	//|	СоответствиеСкидокВОборудовании.Скидка КАК Скидка
	//|ИЗ
	//|	РегистрСведений.СоответствиеСкидокВОборудовании КАК СоответствиеСкидокВОборудовании
	//|ГДЕ
	//|	СоответствиеСкидокВОборудовании.Идентификатор = &Идентификатор
	//|";
	//
	//Запрос.УстановитьПараметр("Идентификатор", РезультатОповещения.Идентификатор);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	ТекущиеДанные.НаименованиеСкидкиВОборудовании = Выборка.Наименование;
	//	ТекущиеДанные.Скидка                          = Выборка.Скидка;
	//Иначе
	//	ТекущиеДанные.Скидка = Справочники.ТипыСкидок.ПустаяСсылка();
	//КонецЕсли;
	//
	//Если ТекущиеДанные.Скидка = ВремСкидка Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//// Вызываем обработчик изменения данных объекта
	//Документы.НазначениеСкидокСтроки.СкидкиСкидкаПриИзменении(Объект, ТекущиеДанные);
	//
	//ОбновитьПараметрыСкидки(ТекущиеДанные);
	
КонецПроцедуры

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыбораСкидкиОборудования(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если РезультатОповещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаРезультатаВыбораСкидкиОборудованияНаСервере(РезультатОповещения);
	
КонецПроцедуры // ОбработкаРезультатаОповещенияЗаполнитьДействующимиСкидками()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения - Произвольный - Результат выполнения операции в подчиненной форме.
//
&НаСервере
Процедура ОбработкаРезультатаНастройкиНабораНаСервере(РезультатОповещения)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторСтроки) Тогда
		ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	НайденныеСтроки = Объект.СоставНабора.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
	Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
		Объект.СоставНабора.Удалить(СтрокаТЧ);
	КонецЦикла;
	
	Для Каждого СтрокаНабора Из РезультатОповещения Цикл
		НоваяСтрока = Объект.СоставНабора.Добавить();
		НоваяСтрока.ИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНабора);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НазначениеСкидокСтрокиСоставНабора.Номенклатура1 КАК Номенклатура1,
	|	НазначениеСкидокСтрокиСоставНабора.Номенклатура2 КАК Номенклатура2,
	|	НазначениеСкидокСтрокиСоставНабора.Количество1 КАК Количество1,
	|	НазначениеСкидокСтрокиСоставНабора.Количество2 КАК Количество2,
	|	НазначениеСкидокСтрокиСоставНабора.Скидка1 КАК Скидка1,
	|	НазначениеСкидокСтрокиСоставНабора.Скидка2 КАК Скидка2
	|ИЗ
	|	Документ.НазначениеСкидокСтроки.СоставНабора КАК НазначениеСкидокСтрокиСоставНабора
	|ГДЕ
	|	НазначениеСкидокСтрокиСоставНабора.Ссылка = &Ссылка
	|	И НазначениеСкидокСтрокиСоставНабора.ИдентификаторСтроки = &ИдентификаторСтроки";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
	ТаблицаСостава = Запрос.Выполнить().Выгрузить();
	
	// Вызываем обработчик изменения данных объекта
	Документы.НазначениеСкидокСтроки.СкидкиСкидкаПриИзменении(Объект, ТекущиеДанные);
	
	ОбновитьПараметрыСкидки(ТекущиеДанные);
	
КонецПроцедуры

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаНастройкиНабора(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если РезультатОповещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаРезультатаНастройкиНабораНаСервере(РезультатОповещения);
	
КонецПроцедуры // ОбработкаРезультатаОповещенияЗаполнитьДействующимиСкидками()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаСервере
Процедура ЗаполнитьДействующимиСкидкамиНаСервере()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СкидкиСтрокиСрезПоследних.Скидка,
	|	СкидкиСтрокиСрезПоследних.ФлагВытеснения,
	|	СкидкиСтрокиСрезПоследних.ЗначениеСкидки,
	|	СкидкиСтрокиСрезПоследних.Объект КАК Номенклатура,
	|	СкидкиСтрокиСрезПоследних.Объект КАК ТипНоменклатуры,
	|	СкидкиСтрокиСрезПоследних.Свойство,
	|	СкидкиСтрокиСрезПоследних.ОтКоличества КАК Количество,
	|	СкидкиСтрокиСрезПоследних.Правило,
	|	СкидкиСтрокиСрезПоследних.ОтСуммыСтроки КАК СуммаСтроки,
	|	СкидкиСтрокиСрезПоследних.ДисконтнаяКарта,
	|	СкидкиСтрокиСрезПоследних.ОтСуммыНакопленияНаКарте КАК СуммаНакопления,
	|	СкидкиСтрокиСрезПоследних.НачВремя,
	|	СкидкиСтрокиСрезПоследних.КонВремя,
	|	СкидкиСтрокиСрезПоследних.ДниНедели,
	|	СкидкиСтрокиСрезПоследних.ВидПрайсЛистаПодарка,
	|	СкидкиСтрокиСрезПоследних.МаксимальнаяСуммаПодарка,
	|	СкидкиСтрокиСрезПоследних.ЗалОбслуживания КАК СкладКомпании,
	|	СкидкиСтрокиСрезПоследних.ИдентификаторСкидки КАК ИдентификаторСкидки
	|ИЗ
	|	РегистрСведений.СкидкиСтроки.СрезПоследних(
	|		&Дата,
	|		Подразделение = &ПодразделениеКомпании
	|		    И Скидка.ВидСкидки = &ВидСкидкиНаСтроку) КАК СкидкиСтрокиСрезПоследних
	|ГДЕ
	|	СкидкиСтрокиСрезПоследних.Действует
	|
	|УПОРЯДОЧИТЬ ПО
	|	СкидкиСтрокиСрезПоследних.Период
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Дата",                  Новый Граница(Объект.ДатаНачалаДействия, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ВидСкидкиНаСтроку",     Перечисления.ВидыСкидок.НаСтрокуДокумента);
	
	Объект.Скидки.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ОбновитьПараметрыСкидок();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДействующимиСкидками(Команда)
	
	Если Объект.Скидки.Количество() = 0 Тогда
		
		ЗаполнитьДействующимиСкидкамиНаСервере();
		
	Иначе
		// Формируем описание обработчика перехвата закрытия формы
		ОбработчикВопроса = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияЗаполнитьДействующимиСкидками", ЭтотОбъект);
		
		// Формируем текст вопроса
		ТекстВопроса = НСтр("ru = 'Все строки из таблицы будут удалены."+Символы.ПС+"Продолжить ?'");
		
		// Получаем подтверждение операции от пользователя
		ПоказатьВопрос(ОбработчикВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиКолонкиВремяИДниНедели(Команда)
	
	Элементы.СкидкиВывестиКолонкиВремяИДниНедели.Пометка = НЕ Элементы.СкидкиВывестиКолонкиВремяИДниНедели.Пометка;
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.НазначениеСкидокСтроки.ДатаПриИзменении(Объект);
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.НазначениеСкидокСтроки.ХозОперацияПриИзменении(Объект);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзменении()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "СКИДКИ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкидкиНоменклатураПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.НазначениеСкидокСтроки.СкидкиНоменклатураПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	// Вызываем общий обработчик изменения реквизитов формы
	УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(ЭтотОбъект, ТекущиеДанные, ПараметрыДействия);

КонецПроцедуры // СкидкиНоменклатураПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиНоменклатураПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СкидкиНоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры // СкидкиНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Скидка" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкидкиСкидкаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.НазначениеСкидокСтроки.СкидкиСкидкаПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	ОбновитьПараметрыСкидки(ТекущиеДанные);

КонецПроцедуры // СкидкиСкидкаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Скидка".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиСкидкаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СкидкиСкидкаПриИзмененииНаСервере();

КонецПроцедуры // СкидкиСкидкаПриИзменении()

&НаСервере
Процедура СкидкиНаименованиеСкидкиВОборудованииПриИзмененииНаСервере()
	
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	ТекущиеДанные.ИдентификаторСкидкиВОборудовании = ТекущиеДанные.НаименованиеСкидкиВОборудовании;
	//ТекущиеДанные.НаименованиеСкидкиВОборудовании  = РезультатОповещения.Идентификатор;
	
	ВремСкидка = ТекущиеДанные.Скидка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СоответствиеСкидокВОборудовании.Наименование КАК Наименование,
	|	СоответствиеСкидокВОборудовании.Скидка КАК Скидка
	|ИЗ
	|	РегистрСведений.СоответствиеСкидокВОборудовании КАК СоответствиеСкидокВОборудовании
	|ГДЕ
	|	СоответствиеСкидокВОборудовании.Идентификатор = &Идентификатор
	|";
	
	Запрос.УстановитьПараметр("Идентификатор", ТекущиеДанные.ИдентификаторСкидкиВОборудовании);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекущиеДанные.НаименованиеСкидкиВОборудовании = Выборка.Наименование;
		ТекущиеДанные.Скидка                          = Выборка.Скидка;
	Иначе
		ТекущиеДанные.Скидка = Справочники.ТипыСкидок.ПустаяСсылка();
	КонецЕсли;
	
	Если ТекущиеДанные.Скидка = ВремСкидка Тогда
		Возврат;
	КонецЕсли;
	
	// Вызываем обработчик изменения данных объекта
	Документы.НазначениеСкидокСтроки.СкидкиСкидкаПриИзменении(Объект, ТекущиеДанные);
	
	ОбновитьПараметрыСкидки(ТекущиеДанные);
	//Если ЗначениеЗаполнено(ТекущиеДанные.НаименованиеСкидкиВОборудовании) Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.УстановитьПараметр("", ТекущиеДанные.НаименованиеСкидкиВОборудовании);
	//	Запрос.Текст = "
	//	|ВЫБРАТЬ
	//	|	СоответствиеСкидокВОборудовании.Наименование КАК Наименование,
	//	|	СоответствиеСкидокВОборудовании.Идентификатор КАК Идентификатор
	//	|ИЗ
	//	|	РегистрСведений.СоответствиеСкидокВОборудовании КАК СоответствиеСкидокВОборудовании
	//	|ГДЕ
	//	|	СоответствиеСкидокВОборудовании.Идентификатор = &Идентификатор
	//	|";
	//	
	//	//Запрос.УстановитьПараметр("Идентификаторы", Объект.Скидки.Выгрузить(, "ИдентификаторСкидкиВОборудовании").ВыгрузитьКолонку("ИдентификаторСкидкиВОборудовании"));
	//	
	//	Скидки = Объект.Скидки;
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		НайденныеСтроки = Скидки.НайтиСтроки(Новый Структура("ИдентификаторСкидкиВОборудовании", Выборка.Идентификатор));
	//		Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
	//			ТекущаяСтрока.НаименованиеСкидкиВОборудовании = Выборка.Наименование;
	//		КонецЦикла;
	//	КонецЦикла;
	//	
	//	//ОбработкаРезультатаВыбораСкидкиОборудованияНаСервере(РезультатОповещения);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиНаименованиеСкидкиВОборудованииПриИзменении(Элемент)
	
	СкидкиНаименованиеСкидкиВОборудованииПриИзмененииНаСервере();
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении данных реквизита "Наименование скидки в оборудовании".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиНаименованиеСкидкиВОборудованииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ОбработчикВыбора = Новый ОписаниеОповещения("ОбработкаРезультатаВыбораСкидкиОборудования", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.СоответствиеСкидокВОборудовании.ФормаСписка", ПараметрыФормы, ЭтотОбъект,,,,ОбработчикВыбора);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Значение скидки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкидкиЗначениеСкидкиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.НазначениеСкидокСтроки.СкидкиЗначениеСкидкиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);

КонецПроцедуры // СкидкиЗначениеСкидкиПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Значение скидки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиЗначениеСкидкиПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СкидкиЗначениеСкидкиПриИзмененииНаСервере();

КонецПроцедуры // СкидкиЗначениеСкидкиПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Тип номенклатуры" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкидкиТипНоменклатурыПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.НазначениеСкидокСтроки.СкидкиТипНоменклатурыПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // СкидкиТипНоменклатурыПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Тип номенклатуры".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиТипНоменклатурыПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СкидкиТипНоменклатурыПриИзмененииНаСервере();

КонецПроцедуры // СкидкиТипНоменклатурыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Ценовая группа" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкидкиЦеноваяГруппаПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.НазначениеСкидокСтроки.СкидкиЦеноваяГруппаПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении данных реквизита "Ценовая группа".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиЦеноваяГруппаПриИзменении(Элемент)
	
	СкидкиЦеноваяГруппаПриИзмененииНаСервере();
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Дисконтная карта" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкидкиДисконтнаяКартаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.НазначениеСкидокСтроки.СкидкиДисконтнаяКартаПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);

КонецПроцедуры // СкидкиДисконтнаяКартаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дисконтная карта".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиДисконтнаяКартаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СкидкиДисконтнаяКартаПриИзмененииНаСервере();

КонецПроцедуры // СкидкиДисконтнаяКартаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Конечное время" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкидкиКонВремяПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.НазначениеСкидокСтроки.СкидкиКонВремяПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);

КонецПроцедуры // СкидкиКонВремяПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Конечное время".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиКонВремяПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СкидкиКонВремяПриИзмененииНаСервере();

КонецПроцедуры // СкидкиКонВремяПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дни недели Пн".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиДниНеделиПнПриИзменении(Элемент)
	
	УстановитьДеньНедели();
	
КонецПроцедуры // СкидкиДниНеделиПнПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дни недели Вт".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиДниНеделиВтПриИзменении(Элемент)
	
	УстановитьДеньНедели();
	
КонецПроцедуры // СкидкиДниНеделиВтПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дни недели Ср".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиДниНеделиСрПриИзменении(Элемент)
	
	УстановитьДеньНедели();
	
КонецПроцедуры // СкидкиДниНеделиСрПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дни недели Чт".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиДниНеделиЧтПриИзменении(Элемент)
	
	УстановитьДеньНедели();
	
КонецПроцедуры // СкидкиДниНеделиЧтПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дни недели Пт".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиДниНеделиПтПриИзменении(Элемент)
	
	УстановитьДеньНедели();
	
КонецПроцедуры // СкидкиДниНеделиПтПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дни недели Сб".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиДниНеделиСбПриИзменении(Элемент)
	
	УстановитьДеньНедели();
	
КонецПроцедуры // СкидкиДниНеделиСбПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дни недели Вс".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиДниНеделиВсПриИзменении(Элемент)
	
	УстановитьДеньНедели();
	
КонецПроцедуры // СкидкиДниНеделиВсПриИзменении()

&НаКлиенте
Процедура НастроитьНабор(Команда)
	
	ТекущиеДанные = Элементы.Скидки.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные.Скидка = ПредопределенноеЗначение("Справочник.ТипыСкидок.СкидкаНаНабор") Тогда
		ТекстСообщения = НСтр("ru = 'Настраивать наборы можно только для скидок на набор'");
		ВывестиСообщение(ТекстСообщения);
		Возврат;
	КонецЕсли;
		
	ОбработчикВыбора = Новый ОписаниеОповещения("ОбработкаРезультатаНастройкиНабора", ЭтотОбъект);
	НайденныеСтроки = Объект.СоставНабора.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
	НастроенныеНаборы = Новый Массив;
	Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("Номенклатура1",СтрокаТЧ.Номенклатура1);
		НоваяСтрока.Вставить("Номенклатура2",СтрокаТЧ.Номенклатура2);
		НоваяСтрока.Вставить("Количество1",СтрокаТЧ.Количество1);
		НоваяСтрока.Вставить("Количество2",СтрокаТЧ.Количество2);
		НоваяСтрока.Вставить("Скидка1",СтрокаТЧ.Скидка1);
		НоваяСтрока.Вставить("Скидка2",СтрокаТЧ.Скидка2);
		НастроенныеНаборы.Добавить(НоваяСтрока);
	КонецЦикла;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СоставНабора", НастроенныеНаборы);
	
	ОткрытьФорму("Обработка.ОбработкаСкидок.Форма.ФормаНастройкиНабора",ПараметрыФормы, ЭтотОбъект,,,,ОбработчикВыбора);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "СКИДКИ"

// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//
&НаКлиенте
Процедура СкидкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
	Если Копирование Тогда
		Элемент.ТекущиеДанные.ИдентификаторСкидки = 0;
	КонецЕсли;
	
КонецПроцедуры // СкидкиПередНачаломДобавления()

// Обработчик события возникающего на клиенте перед началом интерактивного изменения строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура СкидкиПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередНачаломИзменения()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура СкидкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПриОкончанииРедактирования(ЭтотОбъект, Элемент, НоваяСтрока, ОтменаРедактирования, "Скидки");
	
КонецПроцедуры // СкидкиПриОкончанииРедактирования()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура СкидкиПередУдалением(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередУдалением(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // СкидкиПередУдалением()

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
&НаСервере
Процедура СкидкиПослеУдаленияНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ТоварыПослеУдаления(ЭтотОбъект, Элементы.Скидки, ПараметрыДействия);
	
КонецПроцедуры // СкидкиПослеУдаленияНаСервере()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиПослеУдаления(Элемент)
	
	// Обработаем событие в контексте сервера
	СкидкиПослеУдаленияНаСервере();
	
	ТекущиеДанные = Элементы.Скидки.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторСтроки) Тогда
		НайденныеСтроки = Объект.СоставНабора.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
		
		Для каждого СтрокаТаблицы Из НайденныеСтроки Цикл
			Объект.СоставНабора.Удалить(СтрокаТаблицы)
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // СкидкиПослеУдаления()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                        - Строка таблицы, над которой находится курсор.
//  Поле                          - Элемент управляемой формы, с которым связана данная колонка таблицы.
//
&НаКлиенте
Процедура СкидкиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // СкидкиПроверкаПеретаскивания()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	Если ЕстьРеквизит(Объект, "СпособВычисления", "Скидки") Тогда
		Для Каждого Строка Из Объект.Скидки Цикл
			Строка.СпособВычисления = ?(Строка.Скидка.СпособВычисления = Перечисления.СкидкиСпособВычисления.Абсолютная, ВалютаРегл, "%");
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьРеквизит(Объект, "НаименованиеСкидкиВОборудовании", "Скидки") Тогда
		ОбновитьНаименованияСкидокВОборудовании();
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДеревоПодразделений();
	
	Элементы.СкидкиВывестиКолонкиВремяИДниНедели.Пометка = Ложь;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	УправлениеДиалогомКлиент.ДеревоПодразделенийРазвернутьТолькоПомеченныеУровни(Элементы.ДеревоПодразделений, ДеревоПодразделений.ПолучитьЭлементы());
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДеревоПодразделений();
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	Элементы.СкидкиВывестиКолонкиВремяИДниНедели.Пометка = Ложь;
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьРеквизит(Объект, "СпособВычисления", "Скидки") Тогда
		Для Каждого Строка Из Объект.Скидки Цикл
			Строка.СпособВычисления = ?(Строка.Скидка.СпособВычисления = Перечисления.СкидкиСпособВычисления.Абсолютная, ВалютаРегл, "%");
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьНаименованияСкидокВОборудовании();
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ПОДРАЗДЕЛЕНИЯ"

&НаКлиенте
Процедура ДеревоПодразделенийУстановитьФлажки(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивно(ДеревоПодразделений.ПолучитьЭлементы(), Истина, Объект.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийСнятьФлажки(Команда)
	
	Объект.Подразделения.Очистить();
	УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивно(ДеревоПодразделений.ПолучитьЭлементы(), Ложь, Объект.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияПодразделениеКомпанииПриИзменении(Элемент)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийОбновитьФлажкиПодразделений(ДеревоПодразделений.ПолучитьЭлементы(), Объект.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоПодразделений.ТекущиеДанные;
	УправлениеДиалогомКлиент.ДеревоПодразделенийПометкаПриИзменении(ТекущиеДанные, Объект.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияПослеУдаления(Элемент)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийОбновитьФлажкиПодразделений(ДеревоПодразделений.ПолучитьЭлементы(), Объект.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийРазвернуть(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийРазвернутьВсеУровни(Элементы.ДеревоПодразделений, ДеревоПодразделений.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийСвернуть(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийСвернутьВсеУровни(Элементы.ДеревоПодразделений, ДеревоПодразделений.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиСвойствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

