
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из Параметры.ТипыКлиентскихПриложений Цикл
		Элементы.ТипПриложения.СписокВыбора.Добавить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Для Каждого Элемент Из Параметры.Сценарии Цикл
		Элементы.Сценарий.СписокВыбора.Добавить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	ПараметрыКлиента = Параметры.ПараметрыКлиента;
	Наименование    = ПараметрыКлиента.Наименование;
	УИД             = ПараметрыКлиента.УИД;
	Хост            = ПараметрыКлиента.Хост;
	ТипКлиента      = ПараметрыКлиента.ТипКлиента;
	ТипПриложения   = ПараметрыКлиента.ТипПриложения;
	ДатаНачала      = ПараметрыКлиента.ДатаНачала;
	ДатаОкончания   = ПараметрыКлиента.ДатаОкончания;
	Сценарий        = ПараметрыКлиента.Сценарий;
	Выполнение      = ПараметрыКлиента.Выполнение;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	
	ТипКлиентаЭлемент = Элементы.ТипКлиента.СписокВыбора.НайтиПоЗначению(ТипКлиента);
	ТипПриложенияЭлемент = Элементы.ТипПриложения.СписокВыбора.НайтиПоЗначению(ТипПриложения);
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", Наименование);
	Результат.Вставить("УИД", УИД);
	Результат.Вставить("Хост", Хост);
	Результат.Вставить("ТипКлиента", ТипКлиента);
	Результат.Вставить("ТипПриложенияИД", ТипПриложения);
	Если ТипПриложенияЭлемент <> Неопределено Тогда
		Результат.Вставить("ТипПриложения", ТипПриложенияЭлемент.Представление);
	Иначе
		Результат.Вставить("ТипПриложения", "");
	КонецЕсли;
	Результат.Вставить("ДатаНачала", ДатаНачала);
	Результат.Вставить("ДатаОкончания", ДатаОкончания);
	Результат.Вставить("Сценарий", Сценарий);
	Результат.Вставить("Выполнение", Выполнение);
	
	Закрыть(Результат);
	
КонецПроцедуры





