// Модуль документа "Заказ покупателя"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Поступление товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПоступлениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ТипЦен					= ПравоПользователя("ОсновнойТипЦенПродажи", ЭтотОбъект);
	
	Контрагент 				= Неопределено;
	ДоговорВзаиморасчетов 	= Неопределено;
	ВремЯчейка 							= Неопределено;
	
	Сч = 0;
	Пока Сч < Товары.Количество() Цикл
		СтрокаТоваров = Товары[Сч];
		Если СтрокаТоваров.Количество = 0 Тогда
			Товары.Удалить(Сч);
		Иначе
			ВремЯчейка 						= СтрокаТоваров.Ячейка;
			Документы.ЗаказПокупателя.ТоварыНоменклатураПриИзменении(ЭтотОбъект, СтрокаТоваров,ДополнительныеСвойства.ПараметрыДействия);
			СтрокаТоваров.Ячейка 			= ВремЯчейка;
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;
		
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПоступлениеТоваров()

// Производит заполнение объекта на основании документа "Отчет комиссионера"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ОтчетКомиссионера(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Попробуем автоматически предложить сразу зарезервировать товар на складе
	Документы.ЗаказПокупателя.ЗаполнитьРезервОстатками(ЭтотОбъект);
	
	Резерв = Товары.Итог("Резерв");
	Если Резерв=0 Тогда
		// Товара нет в наличии - будем только заказывать
		ХозОперация = Справочники.ХозОперации.ЗаказПокупателя;
	КонецЕсли;
	
	// Перерасчитаем цены и ставки
	Для Каждого СтрокаТоваров Из Товары Цикл
		Документы.ЗаказПокупателя.ТоварыЦенаПриИзменении(ЭтотОбъект, СтрокаТоваров);
	КонецЦикла;
	
	//////////////////////////////////////////////////////////////////////////////		
	// Заполним ПроцентПредоплаты для нового документа
	
	Если ЗначениеЗаполнено(ПодразделениеКомпании) Тогда
		СрокПоставкиДней = ПодразделениеКомпании.СрокПоставкиПокупателюПоУмолчанию
	Иначе
		СрокПоставкиДней = 0;
	КонецЕсли;
	
	СрокПоставки = ТекущаяДатаСеанса();
	СрокПоставки = СрокПоставки+СрокПоставкиДней*60*60*24;
	
	// Заполнение предоплаты
	СуммаСоСкидкой = Товары.Итог("СуммаВсего");
	
	ПроцентПредоплаты = ПравоПользователя("МинимальныйПроцентПредоплаты", ЭтотОбъект);
	СуммаПредоплаты   = СуммаСоСкидкой*ПроцентПредоплаты/100;
		
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ОтчетКомиссионера()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА)
	
	// установка хоз. операции
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		ХозОперация = Справочники.ХозОперации.ЗаказРезервированиеПокупателя;
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипЦен) Тогда
		ТипЦен = ПравоПользователя("ОсновнойТипЦенПродажи", ЭтотОбъект);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		// Чтение значения для срока поставки
		СрокПоставкиДней =  ПодразделениеКомпании.СрокПоставкиПокупателюПоУмолчанию;
		СрокПоставки     = НачалоДня(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса())) + СрокПоставкиДней*60*60*24;
	КонецЕсли; 
	
	ЗаполненНаОснованииДокумента = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеСвойства, "ВыполненоЗаполнениеНаОсновании", "");
	
	Если Не ЗначениеЗаполнено(ПроцентПредоплаты) Тогда 
		
		Если ДоговорВзаиморасчетов.ПроцентПредоплаты = -1 Тогда
			ПроцентПредоплаты = ПравоПользователя("МинимальныйПроцентПредоплаты", ЭтотОбъект);
		Иначе
			ПроцентПредоплаты = ДоговорВзаиморасчетов.ПроцентПредоплаты;
		КонецЕсли;
	КонецЕсли;
	
	СуммаСоСкидкой				= Товары.Итог("СуммаВсего");
	СуммаПредоплаты	= СуммаСоСкидкой * ПроцентПредоплаты / 100;
	
	// Заполним срок снятия резервов
	ОтсрочкаСнятияРезервов = ПравоПользователя("СрокРезерваПоУмолчанию");
	Если ЗначениеЗаполнено(ОтсрочкаСнятияРезервов) И НЕ ЗначениеЗаполнено(СрокСнятияРезерва) Тогда
		СрокСнятияРезерва = НачалоДня(ТекущаяДатаСеанса()) + 86400 * ОтсрочкаСнятияРезервов;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ХозОперация = Справочники.ХозОперации.РезервированиеПокупателя Тогда
		// проверим заполнены ли резервы
		Для Каждого ТекСтрока Из Товары Цикл
			Если ТекСтрока.Резерв = 0 Тогда
				ВывестиСообщение(НСтр("ru = 'Строка: <%1>, номенклатура: <%2> не заполнено количество резерва.'"),ЭтотОбъект,,,Отказ, ТекСтрока.НомерСтроки, ТекСтрока.Номенклатура);
				Возврат;
			Иначе
				ТекСтрока.Количество = ТекСтрока.Резерв;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//laza {
	// проверим, а не запрещена ли отгрузка
	ДатаЗапретаОтгрузкиПоДоговору = ДоговорВзаиморасчетов.ДатаЗапретаОтгрузкиПоДоговору;
	Если ЗначениеЗаполнено(ДатаЗапретаОтгрузкиПоДоговору) И ДатаЗапретаОтгрузкиПоДоговору <= Дата Тогда
		КонтролироватьДатуЗапретаОтгрузкиПоДоговору = ПравоПользователя("КонтролироватьДатуЗапретаОтгрузкиПоДоговору",ЭтотОбъект);
		Если  КонтролироватьДатуЗапретаОтгрузкиПоДоговору = Перечисления.ВидыКонтроля.Запрещать ИЛИ
			КонтролироватьДатуЗапретаОтгрузкиПоДоговору = Перечисления.ВидыКонтроля.Предупреждать Тогда 
			СтарыйОтказ = Отказ;
			ВывестиСообщение(НСтр("ru = 'По договору ""%1"" запрещена отгрузка с %2 .'"),ЭтотОбъект,,,Отказ, СокрЛП(ДоговорВзаиморасчетов), Формат(ДатаЗапретаОтгрузкиПоДоговору,"ДФ=dd.MM.yyyy"));
			Если  КонтролироватьДатуЗапретаОтгрузкиПоДоговору = Перечисления.ВидыКонтроля.Предупреждать Тогда 	
				Отказ =  СтарыйОтказ;
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	//laza }

	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	// Если общий обработчик вывил ошибку и не идет восстановление последовательности
	Если Отказ И НЕ ПолучитьЗначениеПараметраСтруктуры(ДополнительныеСвойства, "ЭтоВосстановлениеПоследовательностей", Ложь) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Номенклатура.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Номенклатура КАК Номенклатура
		               |ГДЕ
		               |	(Номенклатура.ЗапретПродажи = ИСТИНА
		               |	ИЛИ Номенклатура.ЗапретЗакупки = ИСТИНА)
		               |	И Номенклатура.Ссылка В (&Номенклатура)";
		
		Запрос.УстановитьПараметр("Номенклатура", Товары.ВыгрузитьКолонку("Номенклатура"));
		
		ЗапрещеннаяНоменклатура = Запрос.Выполнить().Выгрузить();
		
		// В списке товаров есть Номенклатура запрещенная для покупки или закупки
		Если ЗапрещеннаяНоменклатура.Количество() > 0 Тогда
			
			Отказ = Ложь;
			
			Для каждого СтрокаНоменклатуры Из ЗапрещеннаяНоменклатура Цикл
				
				СтрокиТоваров = Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаНоменклатуры.Ссылка));
				
				Для каждого СтрокаТоваров Из СтрокиТоваров Цикл
					
					// Если пытаются списать не зарезервированное количество товара
					Если СтрокаТоваров.Количество <> СтрокаТоваров.Резерв Тогда
						
						Отказ = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Отказ Тогда
					
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		Документы.ЗаказПокупателя.ХозОперацияПриИзменении(ЭтотОбъект);
	КонецЕсли;
	
	Если ПолучитьЗначениеПараметраСтруктуры(ДополнительныеСвойства,"ИзменениеПроцентаПредоплаты", Ложь) Тогда
		
		ОбменДанными.Загрузка = Ложь;
		
		// Вызываем общий обработчик события
		Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
			Возврат;
		КонецЕсли;
		
		Если (НЕ ЗначениеЗаполнено(ДокументОснование)) Тогда
			
			МинимальныйПроцентПредоплаты = ПравоПользователя("МинимальныйПроцентПредоплаты", ЭтотОбъект);
			
			Если МинимальныйПроцентПредоплаты > ПроцентПредоплаты Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'При записи <%1> обнаружены ошибки:'"),СокрЛП(ЭтотОбъект));
				ТекстСообщения = ТекстСообщения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Запрещено изменять минимальный процент предоплаты менее, чем <%1> %'"),Формат(МинимальныйПроцентПредоплаты, "ЧЦ=5; ЧДЦ=2; ЧН=0"));
				ТекстСообщения = ТекстСообщения + Символы.ПС + НСтр("ru = 'Из-за возникших ошибок операция записи была отменена.'");
				ВывестиСообщение(ТекстСообщения, ЭтотОбъект,,,Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		ОбменДанными.Загрузка = Истина;
		
		Возврат;
		
	Иначе
		// Вызываем общий обработчик события
		Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ХозОперация = Справочники.ХозОперации.ЗаказПокупателя Тогда
		Для Каждого СтрокаТабличнойЧасти Из Товары Цикл
			СтрокаТабличнойЧасти.Резерв = 0;
		КонецЦикла;
	КонецЕсли;
	
	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоЗаказамПередПроведением(Ссылка, ДополнительныеСвойства);
		
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим сумму предоплаты
	Если СуммаДокумента < СуммаПредоплаты Тогда
		ВывестиСообщение(НСтр("ru = 'Сумма предоплаты не может быть больше суммы документа'"), ЭтотОбъект,,,Отказ);
		Возврат;
	КонецЕсли; 
	
	// Проверим количество резервируемого товара
	Если ХозОперация = Справочники.ХозОперации.ЗаказРезервированиеПокупателя Тогда
		
		Для каждого СтрокаТабличнойЧасти Из Товары Цикл
			
			Если СтрокаТабличнойЧасти.Количество < СтрокаТабличнойЧасти.Резерв Тогда
				ВывестиСообщение(НСтр("ru = 'Количество номенклатуры не может быть менее количества резервирования.'"), ЭтотОбъект,,,Отказ);
				Возврат;
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ПровестиПоЗаказамПокупателей(РежимПроведения, Заказывать, Резервировать, Отказ)
	
	НаборЗаписейЗаказыПокупателей=Движения.ЗаказыПокупателей;
	НаборЗаписейЗаказыПокупателей.РежимПроведения=РежимПроведения;
	НаборЗаписейЗаказыПокупателей.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам=Неопределено;
	НаборЗаписейЗаказыПокупателей.Контрагент=Контрагент;
	НаборЗаписейЗаказыПокупателей.Заказ=Ссылка;
	НаборЗаписейЗаказыПокупателей.СкладКомпании=СкладКомпании;
	НаборЗаписейЗаказыПокупателей.Заказывать=Заказывать;
	НаборЗаписейЗаказыПокупателей.Резервировать=Резервировать;
	Отказ = НЕ НаборЗаписейЗаказыПокупателей.Приход() ИЛИ Отказ;
	
	// двигаем границу последовательности заказов
	РаботаСГраницами.СдвинутьГраницуЗаказов(Ссылка,  ДополнительныеСвойства, Движения);
	
КонецПроцедуры

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПравоПользователя("ПроверкаМаксимальногоПревышенияКредитаКонтрагента", ЭтотОбъект) И НЕ ДоговорВзаиморасчетов.ОтменаКонтроляСуммыКредита Тогда
		// получим долг
		СтруктураОтбора=Новый Структура();
		СтруктураОтбора.Вставить("Контрагент",Контрагент);
		СтруктураОтбора.Вставить("ДоговорВзаиморасчетов",ДоговорВзаиморасчетов);
		// получаем текущие остатки, т.к. оплата может быть позже заказа
		тзДолги=РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(,СтруктураОтбора,,"Сумма,СуммаУпр");
		Долг=тзДолги.Итог("Сумма");
		СуммаДокументаВВалютеДоговора=РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаДокумента,ВалютаДокумента,КурсДокумента,ДоговорВзаиморасчетов.ВалютаВзаиморасчетов,Дата);
		Если (Долг+СуммаДокументаВВалютеДоговора)>ДоговорВзаиморасчетов.МаксимальныйКредит Тогда
			ВалютаВзаиморасчетов=СокрЛП(ДоговорВзаиморасчетов.ВалютаВзаиморасчетов.Наименование);
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Сумма долга по договору составляет %1 %2.'"),Формат(Долг,"ЧДЦ=2; ЧН=0.00"),ВалютаВзаиморасчетов);
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Сумма заказа составляет %1 %2'"),Формат(СуммаДокументаВВалютеДоговора,"ЧДЦ=2; ЧН=0.00"),ВалютаВзаиморасчетов);
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Итого %1 %2'"),Формат(Долг+СуммаДокументаВВалютеДоговора,"ЧДЦ=2; ЧН=0.00"),ВалютаВзаиморасчетов);
			ТекстСообщения = ТекстСообщения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'А максимальный кредит по договору %1 %2'"),Формат(ДоговорВзаиморасчетов.МаксимальныйКредит,"ЧДЦ=2; ЧН=0.00"),ВалютаВзаиморасчетов);
			ВывестиСообщение(ТекстСообщения, ЭтотОбъект);
		КонецЕсли; 
	КонецЕсли; 
	
	Заказывать=Истина;
	Резервировать=((ХозОперация=Справочники.ХозОперации.ЗаказРезервированиеПокупателя) ИЛИ (ХозОперация=Справочники.ХозОперации.РезервированиеПокупателя));
	
	// проводим заказ покупателя
	
	Если Резервировать Тогда
		// резервирование заказа покупателя
		НаборЗаписейОстатки = Движения.ОстаткиТоваровКомпании;
		НаборЗаписейОстатки.РежимПроведения           = РежимПроведения;
		НаборЗаписейОстатки.ДокументОбъект            = ЭтотОбъект;
		НаборЗаписейОстатки.РезультатЗапросаПоТоварам = Неопределено;
		НаборЗаписейОстатки.СкладКомпании             = СкладКомпании;
		НаборЗаписейОстатки.ДвиженияПоРознице         = Ложь;
		Отказ = НЕ НаборЗаписейОстатки.Зарезервировать() ИЛИ Отказ;
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказПокупателяТовары.ИдентификаторСтроки,
		|	ЗаказПокупателяТовары.Номенклатура,
		|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры,
		|	ЗаказПокупателяТовары.Количество*ЗаказПокупателяТовары.Коэффициент КАК КоличествоЗаказа,
		|	ГрафикПоставок.Количество,
		|	ГрафикПоставок.ДатаПоставки,
		|	ГрафикПоставок.Контрагент,
		|	ГрафикПоставок.ДатаПоступления,
		|	ГрафикПоставок.Информация
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.ГрафикПоставок КАК ГрафикПоставок
		|ПО
		|	ЗаказПокупателяТовары.Ссылка = &Ссылка
		|	И ЗаказПокупателяТовары.Ссылка = ГрафикПоставок.ЗаказПокупателя
		|	И ЗаказПокупателяТовары.ИдентификаторСтроки = ГрафикПоставок.ИдентификаторСтроки
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &Ссылка
		|ИТОГИ
		|	МАКСИМУМ(КоличествоЗаказа)
		|ПО
		|	ЗаказПокупателяТовары.ИдентификаторСтроки
		|";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		ВыборкаСтроки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		РегистрыСведений.ГрафикПоставок.ЗаписатьГрафикПоставок(Ссылка, ВыборкаСтроки);
		
	КонецЕсли;
	
	Если ПолучитьЗначениеУчетнойПолитики("ПравилоПроверкиХарактеристики",, Дата) = Ложь Тогда
		ПровестиПоЗаказамПокупателей(РежимПроведения, Заказывать, Резервировать, Отказ);
		Возврат;
	КонецЕсли;
	//проставим характеристики в ТЧ документа
	Если НЕ Отказ Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВнешнийИсточник.Номенклатура КАК Номенклатура,
		|	ВнешнийИсточник.ХарактеристикаНоменклатуры КАК Характеристика,
		|	ВнешнийИсточник.Количество КАК Количество,
		|	ВнешнийИсточник.Резерв КАК Резерв
		|ПОМЕСТИТЬ ТаблицаДвижений
		|ИЗ
		|	&ВнешнийИсточник КАК ВнешнийИсточник
		|ГДЕ
		|	ВнешнийИсточник.ХозОперация = &ХозОперация
		|	И ВнешнийИсточник.ХарактеристикаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|	И ВнешнийИсточник.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДвижений.Номенклатура КАК Номенклатура,
		|	ТаблицаДвижений.Характеристика КАК Характеристика,
		|	СУММА(ТаблицаДвижений.Резерв) КАК Резерв
		|ИЗ
		|	ТаблицаДвижений КАК ТаблицаДвижений
		|ГДЕ
		|	НЕ ТаблицаДвижений.Характеристика В (&Характеристики)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДвижений.Номенклатура,
		|	ТаблицаДвижений.Характеристика
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТаблицаДвижений.Резерв) <> 0");
		Запрос.УстановитьПараметр("ВнешнийИсточник", Движения.ОстаткиТоваровКомпании.Выгрузить());
		Запрос.УстановитьПараметр("ХозОперация", ХозОперация);
		Запрос.УстановитьПараметр("Характеристики", Товары.ВыгрузитьКолонку("ХарактеристикаНоменклатуры"));
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТаблицаДвижений = РезультатЗапроса.Выгрузить();
			СтруктураОтбора = Новый Структура("Номенклатура");
			Для Каждого СтрокаТовар Из Товары Цикл
				Если ЗначениеЗаполнено(СтрокаТовар.ХарактеристикаНоменклатуры) Тогда 
					Продолжить; 
				КонецЕсли;
				//запомним исходные данные
				СуммаСтроки = СтрокаТовар.СуммаВсего;
				СуммаНДССтроки = СтрокаТовар.СуммаНДС;
				СуммаИтого = 0; 
				СуммаНДСИтого = 0;
				СтруктураОтбора.Номенклатура = СтрокаТовар.Номенклатура;
				МассивНайденныхСтрок = ТаблицаДвижений.НайтиСтроки(СтруктураОтбора);
				Если МассивНайденныхСтрок.Количество()=0 Тогда 
					Продолжить; 
				КонецЕсли;
					КоличествоПоСтроке = СтрокаТовар.Резерв;				
				Для ЭлементМассива=0 По МассивНайденныхСтрок.ВГраница() Цикл
					ТекСтрока = МассивНайденныхСтрок[ЭлементМассива];
					Если ТекСтрока.Резерв=NULL ИЛИ ТекСтрока.Резерв=0 Тогда 
						Продолжить; 
					КонецЕсли;

					Если КоличествоПоСтроке>ТекСтрока.Резерв Тогда
						//разбиваем строку
						
						КоличествоПоСтроке = КоличествоПоСтроке - ТекСтрока.Резерв;
						Документы.ЗаказПокупателя.ТоварыКоличествоПриИзменении(ЭтотОбъект, СтрокаТовар);
						
						НоваяСтрока = Товары.Вставить(Товары.Индекс(СтрокаТовар));// + 1 + Сч);
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовар);
						НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрока.Характеристика;
						НоваяСтрока.Резерв = ТекСтрока.Резерв;
						НоваяСтрока.Количество = ТекСтрока.Резерв;
						Документы.ЗаказПокупателя.ТоварыКоличествоПриИзменении(ЭтотОбъект, НоваяСтрока);
						НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
						СуммаИтого = СуммаИтого + НоваяСтрока.СуммаВсего;
						СуммаНДСИтого = СуммаНДСИтого + НоваяСтрока.СуммаНДС;
						ТаблицаДвижений.Удалить(ТекСтрока);
						Если ЭлементМассива =  МассивНайденныхСтрок.ВГраница() Тогда
							ВывестиСообщение(НСтр("ru = 'Для номенклатуры %1 код %2 не найдена характеристика'"), ЭтотОбъект,"Номенклатура",,, СтрокаТовар.Номенклатура, СтрокаТовар.Номенклатура.Код);
						КонецЕсли;
						
					Иначе
						СтрокаТовар.ХарактеристикаНоменклатуры = ТекСтрока.Характеристика;
						СуммаИтого = СуммаИтого + СтрокаТовар.СуммаВсего;
						СуммаНДСИтого = СуммаНДСИтого + СтрокаТовар.СуммаНДС;
						Если КоличествоПоСтроке<ТекСтрока.Резерв Тогда
							ТекСтрока.Резерв = ТекСтрока.Резерв - КоличествоПоСтроке;
						Иначе
							СтрокаТовар.Количество = ТекСтрока.Резерв;							
							СтрокаТовар.Резерв = ТекСтрока.Резерв;							
							ТаблицаДвижений.Удалить(ТекСтрока);
						КонецЕсли;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				//проверим результат
				РазницаСуммы = СуммаСтроки - СуммаИтого;
				Если РазницаСуммы<>0 ТОгда
					СтрокаТовар.СуммаВсего = СтрокаТовар.СуммаВсего + РазницаСуммы;
				КонецЕсли;
				РазницаНДС = СуммаНДССтроки - СуммаНДСИтого;
				Если РазницаНДС<>0 Тогда
					СтрокаТовар.СуммаНДС = СтрокаТовар.СуммаНДС + РазницаНДС;
				КонецЕсли;
			КонецЦикла;
			
			// если модифицировали документ, то запишем его
			Если НЕ Отказ И Модифицированность() Тогда
				ОбменДанными.Загрузка = Истина;
				Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПровестиПоЗаказамПокупателей(РежимПроведения, Заказывать, Резервировать, Отказ);
	
КонецПроцедуры // ОбработкаПроведения()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли