////////////////////////////////////////////////////////////////////////////////
// Подсистема "Отправка SMS"
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция отправляет SMS через веб-сервис SMS4B и возвращает идентификатор сообщения
//
// Параметры:
//  НомераПолучателей - Массив - номера получателей в формате +7ХХХХХХХХХХ;
//  Текст 			  - Строка - текст сообщения, длиной не более 480 символов;
//  ИмяОтправителя 	  - Строка - имя отправителя, которое будет отображаться вместо номера входящего SMS;
//  Логин			  - Строка - логин пользователя услуги отправки sms;
//  Пароль			  - Строка - пароль пользователя услуги отправки sms.
//
// Возвращаемое значение:
//  Структура: ОтправленныеСообщения - Массив 	- Элемент массива структура: НомерОтправителя, ИдентификаторСообщения
//             ОписаниеОшибки        - Строка	- Пользовательское представление ошибки
//
Функция смсОтправитьSMS(НомераПолучателей, Текст, ИмяОтправителя, Логин, Пароль) Экспорт
	// Подготавливаем сообщения для отправки
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("НомерПолучателя");
	Таблица.Колонки.Добавить("GUID");
	Таблица.Колонки.Добавить("ТекстСообщения");
	Таблица.Колонки.Добавить("КодОшибки");
	// Выбираем сообщения для отправки
	Для Каждого НомерПолучателя Из НомераПолучателей Цикл  
		НовСтрока = Таблица.Добавить();
		НовСтрока.НомерПолучателя	= смсОчиститьНомераТелефона(НомерПолучателя);
		НовСтрока.GUID				= смсПолучитьИдентификаторСообщения();
		НовСтрока.ТекстСообщения	= Текст;
		НовСтрока.КодОшибки			= 0;
	КонецЦикла;  
	// Заполняем номер отправителя
	Если ПустаяСтрока(ИмяОтправителя) Тогда
		ИмяОтправителя = Константы.смсИмяОтправителя.Получить();
	КонецЕсли;
	// Заполняем параметры отправки сообщений
	СписокСообщений	= смсТаблицаЗначенийВМассивСтруктур(Таблица);
	Результат = Новый Структура("ОтправленныеСообщения,ОписаниеОшибки", Новый Массив, "");
	// Отправляем сообщения
	ДатаОтправки = ТекущаяДата();
	КодОшибки = смсОтправитьСообщения(СписокСообщений, ИмяОтправителя, Текст, ДатаОтправки);
	Если КодОшибки > 0 Тогда
		// Может быть что отправились не все сообщения, а только часть из них
		КолОтправленных = 0;
		ВсегоСообщений = СписокСообщений.Количество();
		ОписаниеОшибки = "";
		Для Каждого Строка Из СписокСообщений Цикл
			Если Строка.КодОшибки >= 1 Тогда // Отправленное(-ые) сообщение(-я), части сообщений
				ОтправленноеСообщение = Новый Структура("НомерПолучателя,ИдентификаторСообщения", "+" + Строка.НомерПолучателя, Строка.GUID);
				Результат.ОтправленныеСообщения.Добавить(ОтправленноеСообщение);
				КолОтправленных = КолОтправленных + 1;
			Иначе
				ОписаниеОшибки = ОписаниеОшибки +  смсОписаниеОшибокВебСервиса(Строка.КодОшибки) + Символы.ПС;
			КонецЕсли; 
		КонецЦикла; 
		// Если отправились не все сообщения
		Если КолОтправленных < ВсегоСообщений Тогда
			смсВывестиСообщение(НСтр("ru = 'Отправлено: " + КолОтправленных + " из " + ВсегоСообщений + "'"),
				СтатусСообщения.Важное, "Отправка сообщений", УровеньЖурналаРегистрации.Предупреждение);
		КонецЕсли;
		Результат.ОписаниеОшибки = СокрП(ОписаниеОшибки);
	ИначеЕсли КодОшибки < 0 Тогда
		// Если метод вернул ошибку
		смсВывестиСообщение(НСтр("ru = 'Не удалось отправить сообщения. " +  смсОписаниеОшибокВебСервиса(КодОшибки) + "'"),
			СтатусСообщения.Важное, "Отправка сообщений", УровеньЖурналаРегистрации.Предупреждение);
		Результат.ОписаниеОшибки = смсОписаниеОшибокВебСервиса(КодОшибки);
	КонецЕсли;	
	Возврат Результат;
КонецФункции // смсОтправитьSMS()

// Функция возвращает текстовое представление статуса доставки сообщения
//
// Параметры:
//  ИдентификаторСообщения - Строка - идентификатор, присвоенный sms при отправке;
//  Логин			- Строка - логин пользователя услуги отправки sms;
//  Пароль			- Строка - пароль пользователя услуги отправки sms.
//
// Возвращаемое значение:
//  Строка - статус доставки. См. описание функции ОтправкаSMS.СтатусДоставки
//
Функция смсСтатусДоставки(ИдентификаторСообщения, Логин, Пароль) Экспорт
	КодОшибки = смсПолучитьСтатус(смсПолучитьИдентификаторСообщения(ИдентификаторСообщения));
	Если КодОшибки < 0 Тогда
		смсВывестиСообщение(НСтр("ru = 'Не удалось получить статус сообщения. " +  смсОписаниеОшибокВебСервиса(КодОшибки) + "'"),
			СтатусСообщения.Важное,  НСтр("ru='Обновление статусов сообщений'"), УровеньЖурналаРегистрации.Предупреждение);
		КодОшибки = 7;
	КонецЕсли;
	Возврат смсКодВСтатус(КодОшибки);
КонецФункции // смсСтатусДоставки()

//////////////////////////////////////////////////////////////
//
// ЯДРО (API) ДЛЯ РАБОТЫ С WEB-СЕРВИСОМ SMS4B
//
// Ядро включает в себя весь необходимый функционал для взаимодействия  с веб-сервисом SMS4B. 
// Оно независимо от конкретной конфигурации. Ядро реализует функциональность низшего уровня, поэтому 
// оно не содержит обращений к метаданным конфигурации и вызовов методов других модулей.

//////////////////////////////////////////////////////////////
// ОСНОВНЫЕ МЕТОДЫ ЯДРА

// Функция предназначена для получения параметров пользователя. 
// Вызывается после подключения к серверу, и после отправки sms-сообщений,
// чтобы пользователь видел остаток sms-сообщений. 
//
// Параметры:
//	СтруктураПараметровСессии	- Структура	- Возвращаемый параметр. 
// 
// Возвращаемое значение:
//	Число	- Числовой код ошибки, 1 - если функция выполнена успешно, 
// 				и код ошибки < 0, если функция выполнена не успешно.
//
Функция смсПолучитьПараметрыСессии(СтруктураПараметровСессии) Экспорт
	НомерСессии		= смсПолучитьНомерСессии();
	ОсновнойСервер	= смсПолучитьОсновнойСервер();
	КодОшибки		= 1;
	// Подключаем веб-сервис
	ВебСервис = смсПодключитьВебСервис();
	Если ВебСервис = Неопределено Тогда
		смсПоменятьСервер();
		ВебСервис = смсПодключитьВебСервис();
		Если ВебСервис = Неопределено Тогда
			КодОшибки = -9;
			Возврат КодОшибки;
		КонецЕсли;	
	КонецЕсли; 
	// Получаем фабрику XDTO
	Фабрика = ВебСервис.ФабрикаXDTO;		
	Попытка
		// Получаем с веб-сервиса параметры сессии
		ПараметрыСессии = ВебСервис.ParamSMS(НомерСессии);
	Исключение
		ПараметрыСессии = Неопределено;
	КонецПопытки;
	// Проверяем результат выполнения
	Если ПараметрыСессии = Неопределено Тогда
		 // Проблема с интернетом (сервис не ответил)
		 КодОшибки = -99999;
	Иначе	
		// Код ошибки при неуспешном выполнении метода
		КодОшибки = Число(ПараметрыСессии.Result);
		// Если сессия устарела или ее нет
		Если (КодОшибки = -1) ИЛИ (КодОшибки = -2) Тогда
			// Подключаемся
			КодОшибкиПодключения = смсПодключиться();
			// Если удалось подключится
			Если КодОшибкиПодключения > 0 Тогда
				// Пробуем получить еще раз
				ПараметрыСеанса.смсНомерСессии = КодОшибкиПодключения;
				НомерСессии = смсПолучитьНомерСессии();
				Попытка
					// Получаем с веб сервиса параметры сессии
					ПараметрыСессии = ВебСервис.ParamSMS(НомерСессии);
				Исключение
					ПараметрыСессии = Неопределено;
				КонецПопытки;
				Если ПараметрыСессии = Неопределено Тогда
				 // Проблема с интернетом (сервис не ответил)
					КодОшибки = -99999;
				Иначе	
					КодОшибки = Число(ПараметрыСессии.Result);
				КонецЕсли;							
			КонецЕсли;
		КонецЕсли;
		Если КодОшибки > 0 Тогда 
			СтруктураПараметровСессии.Вставить("НомерСессии",	НомерСессии);
			СтруктураПараметровСессии.Вставить("Номера",		ПараметрыСессии.Addresses);
			СтруктураПараметровСессии.Вставить("ОстатокСМС",	ПараметрыСессии.Rest);
			СтруктураПараметровСессии.Вставить("КолНомеров",	ПараметрыСессии.AddrMask);
			// Получаем время веб-сервера в UTC
			СтрВремяСервера = Сред(ПараметрыСессии.UTC, 1, 19);
			ВремяСервера = смсСтрокаВДату(СтрЗаменить(СтрВремяСервера, "T", " "));
			СтруктураПараметровСессии.Вставить("ВремяСервера",				ВремяСервера);
			СтруктураПараметровСессии.Вставить("МаксАктуальностьДоставки",	ПараметрыСессии.Limit);
			СтруктураПараметровСессии.Вставить("МаксДлительностьДоставки",	ПараметрыСессии.Duration);
		ИначеЕсли КодОшибки < 0 Тогда 
			// Выводим текст с описанием ошибки
			смсВывестиСообщение(смсОписаниеОшибокВебСервиса(КодОшибки), СтатусСообщения.Важное, "Подключение SMS", УровеньЖурналаРегистрации.Предупреждение);
		КонецЕсли;
	КонецЕсли;
	Возврат КодОшибки;
КонецФункции // смсПолучитьПараметрыСессии()

// Функция возвращает массив доступных номеров отправителя из строки
//
// Параметры:
//	НомерОтправителя - Строка	- Строка, содержащая список номеров
//
// Возвращаемое значение:
//	Массив	- Массив номеров отправителя
//
Функция  смсПолучитьМассивНомеровИзСтроки(НомерОтправителя) Экспорт
	// Создаем массив
	МассивВозврата = Новый Массив;
	// Берем строку с номерами
	ТекстКонстанты = СокрЛП(НомерОтправителя);
	Пока НЕ ПустаяСтрока(ТекстКонстанты) Цикл
		// Ищем позицию разделителя
		НомерРазделителя = СтрНайти(ТекстКонстанты, Символы.ПС);
		Если НомерРазделителя = 0 Тогда // всего один номер
			МассивВозврата.Добавить(СокрЛП(ТекстКонстанты));
			ТекстКонстанты = "";	
		Иначе // если больше одного
			// Получаем номер
			ЛевСтрокаНомера = Лев(ТекстКонстанты, НомерРазделителя - 1);
			// Добавляем в список
			МассивВозврата.Добавить(СокрЛП(ЛевСтрокаНомера));
			Если НомерРазделителя = СтрДлина(ТекстКонстанты) Тогда
				ТекстКонстанты = "";	
			Иначе	
				ТекстКонстанты = Сред(ТекстКонстанты, НомерРазделителя + 1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат МассивВозврата;
КонецФункции //  смсПолучитьМассивНомеровИзСтроки()

// Функция определяет, какую кодировку необходимо применять к тексту сообщения
//
// Параметры:
//	Сообщение	- Строка	- Текст сообщения
//
// Возвращаемое значение:
//	Число	- Вид кодировки	- 0 - латинский, 1 - другие алфавиты, в т.ч. русский
//
Функция  смсИспользовать7БитСообщение(Сообщение) Экспорт
	ДлинаСообщения = СтрДлина(Сообщение);
	Результат = 0;
	Для К = 1 По ДлинаСообщения Цикл
		ТекСимвол = Сред(Сообщение, К, 1);
		Если ТекСимвол = "@" Тогда
			Продолжить;
		ИначеЕсли ТекСимвол = "$" Тогда
			Продолжить;
		ИначеЕсли КодСимвола(ТекСимвол) > 122 Тогда
  			Результат = 1;
			Прервать;
		ИначеЕсли КодСимвола(ТекСимвол) > 96 Тогда
			Продолжить;
		ИначеЕсли  КодСимвола(ТекСимвол) > 91 Тогда
  			Результат = 1;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Возврат Результат;
КонецФункции //  смсИспользовать7БитСообщение()

//////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ МЕТОДЫ ЯДРА

// Функция предназначена для перевода числового кода статуса в строковое представление
//
// Параметры:
//  КодСтатуса	- Число	- Числовой код статуса.
// 
// Возвращаемое значение:
//	Строка	- Представление статуса
//
Функция смсКодВСтатус(КодСтатуса) Экспорт
	Если КодСтатуса = 1 Тогда
		Статус = "НеОтправлялось";
	ИначеЕсли КодСтатуса = 2 Тогда 
		Статус = "Отправляется";
	ИначеЕсли КодСтатуса = 3 Тогда 
		Статус = "Отправлено";
	ИначеЕсли КодСтатуса = 4 Тогда 
		Статус = "НеОтправлено";
	ИначеЕсли КодСтатуса = 5 Тогда 
		Статус = "Доставлено";
	ИначеЕсли КодСтатуса = 6 Тогда 
		Статус = "НеДоставлено";
	ИначеЕсли КодСтатуса = 7 Тогда 
		Статус = "Ошибка";
	ИначеЕсли КодСтатуса = 8 Тогда 
		Статус = "Доставлено";
	ИначеЕсли КодСтатуса = 9 Тогда 
		Статус = "НеДоставлено";
	КонецЕсли; 
	Возврат Статус;
КонецФункции // смсКодВСтатус()

//////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ СО СТРОКАМИ

// Функция возвращает номер телефона в котором убраны все символы, кроме цифр
//
// Параметры:
//	НомерТелефона	- Строка	- Номер телефона
//
// Возвращаемое значение:
//	Строка	- Очищенный номер телефона
//
Функция смсОчиститьНомераТелефона(НомерТелефона) Экспорт
	СтрокаЦифр = "0123456789";
	ОчищенныйНомер = "";
	ДлинаНомера = СтрДлина(НомерТелефона);
	Для НомерСимвола = 1 По ДлинаНомера Цикл
		ТекущийСимвол = Сред(НомерТелефона, НомерСимвола, 1);
		Если СтрНайти(СтрокаЦифр, ТекущийСимвол) > 0 Тогда
			ОчищенныйНомер = ОчищенныйНомер + ТекущийСимвол;
		КонецЕсли;
	КонецЦикла;
	Возврат ОчищенныйНомер;
КонецФункции // смсОчиститьНомераТелефона()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает значение параметра сеанса "смсНомерСессии"
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Число	- Номер сессии
//
Функция смсПолучитьНомерСессии()
	Попытка
		НомерСессии = ПараметрыСеанса.смсНомерСессии;
	Исключение	
		НомерСессии = 0;
		ПараметрыСеанса.смсНомерСессии = НомерСессии;
	КонецПопытки;	
	Возврат НомерСессии;
КонецФункции // смсПолучитьНомерСессии()	

// Функция возвращает значение параметра сеанса "смсОсновнойСервер"
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Число	- Номер сессии
//
Функция смсПолучитьОсновнойСервер()
	Попытка
		ОсновнойСервер = ПараметрыСеанса.смсОсновнойСервер;
	Исключение
		ОсновнойСервер = Истина;
		ПараметрыСеанса.смсОсновнойСервер = ОсновнойСервер;
	КонецПопытки;	
	Возврат ОсновнойСервер;
КонецФункции // смсПолучитьОсновнойСервер()	

//////////////////////////////////////////////////////////////
// ОСНОВНЫЕ МЕТОДЫ ЯДРА

// Функция предназначена для отправки группы sms-сообщений на сервер SMS4B. 
// Группу сообщений объединяют единые временные характеристики отправки 
// (дата отправки, актуальность и т.п.). В предметной реализации группой 
// можно считать отдельный документ рассылки либо, например, набор сообщений 
// с незаполненными временными характеристиками.
//							
// Параметры:
//							
//  СписокСообщений (массив) -	Обязательный параметр. Содержит массив структур, содержащих поля
//								sms-сообщений, предназначенных для отправки на сервер.
//							
// НомерОтправителя (строка) - 	Обязательный параметр. Номер, с которого отправляются сообщения.
//							
//  ТекстСообщенияПоУмолчанию (строка) - Необязательный параметр. Данный текст будет использоваться
//								для отправки тем получателям, для которых в списке сообщений не указан
//								текст сообщения. В случае групповой рассылки сообщений с одним общим
//								текстом достаточно заполнить данный параметр и в списке сообщений 
//								нигде не указывать текст сообщения. В случае если для получателя указан
//								персональный текст, текст по умолчанию не будет использоваться для
//								отправки сообщения данному получателю.
//							
//  ДатаОтправки (дата) - 		Необязательный параметр. Дата начала отправки sms-сообщения
//							
//  Актуальность (дата) - 		Необязательный параметр. Дата, до которой сообщение будет пытаться
//								отправиться сервером sms4b.
//							
//  НачалоПериодаЗапрета (дата) - Необязательный параметр. Указывает, с какого времени начинается период,
//								в который сообщения не должны отправляться (например, чтобы они не 
//								приходили получателям ночью). Актуальным является только временная часть
//								даты (ЧЧ:ММ:СС). Сама дата (ДД.ММ,ГГГГ) не анализируется и может быть 
//								передана любая (в том числе пустая).
//							
// - КонецПериодаЗапрета (дата) - Необязательный параметр. Указывает время окончания периода, в который
//								сообщения не должны отправляться (например, чтобы они не приходили 
//								получателям ночью). Актуальным является только временная часть даты 
//								(ЧЧ:ММ:СС). Сама дата (ДД.ММ,ГГГГ) не анализируется и может быть передана 
//								любая (в том числе пустая).
//							
// - РавномернаяРассылка(булево) - Необязательный параметр. Содержит признак равномерной рассылки. При 
//								использовании равномерной рассылки сообщения группы будут отправляться
//								через равные промежутки времени пропорционально периоду рассылки. 
//								Значение по умолчанию - ложь.
//
// 
// Возвращаемое значение (число):
// 
// Возвращает числовой код ошибки, 1 - если функция выполнена успешно, 
// и код ошибки < 0, если функция выполнена не успешно.
//
Функция смсОтправитьСообщения(СписокСообщений, НомерОтправителя, ТекстСообщенияПоУмолчанию, _ДатаОтправки, _Актуальность = '00010101', НачалоПериодаЗапрета = '00010101', КонецПериодаЗапрета = '00010101', РавномернаяРассылка = Ложь)
	// Проверяем наличие сессии
	НомерСессии = смсПолучитьНомерСессии();
	Если НомерСессии = 0 Тогда
		КодОшибки = смсПодключиться();
		Если КодОшибки < 0 Тогда
			// Пробуем переключиться на резервный сервер
			смсПоменятьСервер();
			КодОшибки = смсПодключиться();
			Если КодОшибки < 0 Тогда
				КодОшибки = -199999;
				Возврат КодОшибки; // Проблема с интернетом
			КонецЕсли;
		КонецЕсли;	
		ПараметрыСеанса.смсНомерСессии = КодОшибки;
		НомерСессии = смсПолучитьНомерСессии();
	КонецЕсли;	
	// Проверяем номер отправителя
	ПараметрыСессии	= Новый Структура;
	КодОшибки = смсПолучитьПараметрыСессии(ПараметрыСессии);
	Если КодОшибки > 0 Тогда
		Если НЕ ПараметрыСессии.Свойство("Номера") Тогда
			КодОшибки =  - 50;
		ИначеЕсли ПустаяСтрока(ПараметрыСессии.Номера) Тогда
			КодОшибки =  - 50;
		Иначе	
			МассивНомеров = смсПолучитьМассивНомеровИзСтроки(ПараметрыСессии.Номера);
			Если МассивНомеров.Количество() = 0 Тогда
				КодОшибки =  - 50;
			ИначеЕсли ПустаяСтрока(НомерОтправителя) Тогда
				НомерОтправителя = МассивНомеров[0];
			ИначеЕсли МассивНомеров.Найти(НомерОтправителя) = Неопределено Тогда
				НомерОтправителя = МассивНомеров[0];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если КодОшибки < 0 Тогда
		Возврат КодОшибки;
	КонецЕсли;
	ОсновнойСервер	= смсПолучитьОсновнойСервер();
	КодОшибки		= 1;
	// Устанавливаем код группы равным 0
	КодГруппы = 0;
	// Количество отправляемых сообщений
	КолвоСообщений = СписокСообщений.Количество();
	// Размер пакета сообщений для отправки на сервер
	РазмерПакета = 100;
	// Все сообщения отправились успешно
	ЕстьНеОтправленныеСообщения = Ложь;
	// Создаем структуру с пустой датой
	СтруктураДаты = Новый Структура();
	СтруктураДаты.Вставить("Дата",			Дата('00010101'));
	СтруктураДаты.Вставить("Миллисекунда",	0);
	// Переводим дату отправки и дату актуальности к времени UTC
	ДатаОтправкиUTC		= ПараметрыСессии.ВремяСервера;
	АктуальностьUTC		= _Актуальность;
	// Переводим дату отправки и дату актуальности в строку
	СтруктураДаты.Дата	= ДатаОтправкиUTC;
	ДатаОтправки		= смсДатаВСтроку(СтруктураДаты); // Дата отправки СМС в формате "YYYYMMDD"
	СтруктураДаты.Дата	= АктуальностьUTC;
	Актуальность		= смсДатаВСтроку(СтруктураДаты); // Дата жизни СМС в формате "YYYYMMDD"
	Период				= "";	
	// Обработка таблицы сообщений
	СчетчикПакетаСообщений = 0;
	// Подключаем веб-сервис
	ВебСервис = смсПодключитьВебСервис();
	Если ВебСервис = Неопределено Тогда
		смсПоменятьСервер();
		ВебСервис = смсПодключитьВебСервис();
		Если ВебСервис = Неопределено Тогда
			КодОшибки = -9;
			Возврат КодОшибки;
		КонецЕсли;	
	КонецЕсли; 
	// Получаем фабрику XDTO
	Фабрика  = ВебСервис.ФабрикаXDTO;
	МассивСообщений = Фабрика.Создать(Фабрика.Тип("SMS client", "ArrayOfGroupSMSList"));
	// Если какие то сообщения не удастся отправить с первого раза, отправим на второй итерации.
	КолвоОтправок = 2;
	Для Индекс = 1 По КолвоОтправок Цикл
		ТекущийИндекс = -1;
		Для Каждого Сообщение Из СписокСообщений Цикл
			ТекущийИндекс = ТекущийИндекс + 1;
			// Уже отправленное сообщение
			Если Сообщение.КодОшибки = 1 Тогда Продолжить; КонецЕсли; 
			СчетчикПакетаСообщений = СчетчикПакетаСообщений + 1;
			// Получаем кодировку сообщения, если русский текст то 1, иначе 0
			Кодировка =  смсИспользовать7БитСообщение(Сообщение.ТекстСообщения);
			// Создаем и заполняем строку массива сообщений
			СтрокаМассива = Фабрика.Создать(Фабрика.Тип("SMS client", "GroupSMSList"));
			СтрокаМассива.Установить("B", ?(ЗначениеЗаполнено(Сообщение.ТекстСообщения), смсСтрокуВШестнадцатеричноеПредставление(Сообщение.ТекстСообщения, Кодировка), ""));
			СтрокаМассива.Установить("D", Сообщение.НомерПолучателя);
			СтрокаМассива.Установить("E", Кодировка);
			СтрокаМассива.Установить("G", Сообщение.GUID);
			МассивСообщений.GroupSMSList.Добавить(СтрокаМассива);
			// Отправка пакета сообщений или остатка сообщений
			Если (СчетчикПакетаСообщений = РазмерПакета) ИЛИ (СчетчикПакетаСообщений = КолвоСообщений) Тогда
				КолвоСообщений = КолвоСообщений - РазмерПакета;
				Если ЗначениеЗаполнено(ТекстСообщенияПоУмолчанию) Тогда
					КодировкаСообщенияШапки =  смсИспользовать7БитСообщение(ТекстСообщенияПоУмолчанию);
				Иначе
					КодировкаСообщенияШапки = 0;
				КонецЕсли; 
				Попытка
					// Если первая отправка, то код группы = -2, если требуется равномерная рассылка, или -1 если не требуется.
					Cod = ?(КодГруппы = 0, ?(РавномернаяРассылка, -2, -1), КодГруппы); // КодГруппы
					// Переводим общий текст в шестнадцатеричное представление
					Bdy = ?(ЗначениеЗаполнено(ТекстСообщенияПоУмолчанию), смсСтрокуВШестнадцатеричноеПредставление(ТекстСообщенияПоУмолчанию, КодировкаСообщенияШапки), "");
					// Оправка сообщений на сервер
					РезультатОтправки = ВебСервис.GroupSMS(НомерСессии, Cod, Строка(НомерОтправителя),
						КодировкаСообщенияШапки, Bdy, Актуальность, ДатаОтправки, Период, МассивСообщений);
				Исключение
					РезультатОтправки = Неопределено;
				КонецПопытки;
				// Проверяем результат отправки
				Если РезультатОтправки = Неопределено Тогда
					// Проблема с интернетом (сервис не ответил)
					КодОшибки = -99999;
				Иначе					
					// Получаем код ошибки
					КодОшибки = РезультатОтправки.Result;
					Если (КодОшибки = -1) ИЛИ (КодОшибки = -2) Тогда
						// Если сессия устарела или ее нет
						КодОшибки = смсПодключиться();
						Если КодОшибки > 0 Тогда
							ПараметрыСеанса.смсНомерСессии = КодОшибки;
							НомерСессии = смсПолучитьНомерСессии();
							Попытка
								// Пробуем отправить еще раз
								РезультатОтправки = ВебСервис.GroupSMS(НомерСессии, Cod, Строка(НомерОтправителя),
									КодировкаСообщенияШапки, Bdy, Актуальность, ДатаОтправки, Период, МассивСообщений);
							Исключение
								РезультатОтправки = Неопределено;
							КонецПопытки;
							// Получим результат отправки
							Если РезультатОтправки = Неопределено Тогда
								КодОшибки = -99999;
							Иначе	
								КодОшибки = РезультатОтправки.Result;
							КонецЕсли;							
						КонецЕсли;							
					ИначеЕсли (КодОшибки > -20) И (КодОшибки < -2) Тогда
						// Возможно, что Основной сервер не доступен, пробуем переключится на резервный.
						смсПоменятьСервер();
						КодОшибки = смсПодключиться();
						// Если ошибка подключения
						Если КодОшибки > 0 Тогда
							ПараметрыСеанса.смсНомерСессии = КодОшибки;
							НомерСессии = смсПолучитьНомерСессии();
							Попытка
								// Пробуем отправить еще раз
								РезультатОтправки = ВебСервис.GroupSMS(НомерСессии, Cod, Строка(НомерОтправителя),
									КодировкаСообщенияШапки, Bdy, Актуальность, ДатаОтправки, Период, МассивСообщений);
							Исключение
								РезультатОтправки = Неопределено;
							КонецПопытки;
							// Получим результат отправки
							Если РезультатОтправки = Неопределено Тогда
								КодОшибки = -99999;
							Иначе	
								КодОшибки = РезультатОтправки.Result;
							КонецЕсли;							
						КонецЕсли;
					КонецЕсли; 
				КонецЕсли;
				Если КодОшибки > 0 Тогда 
					// Запоминаем код созданной группы
					КодГруппы = РезультатОтправки.Group;
					// Записываем результат отправки каждого из сообщений
					КолвоОтправленных = РезультатОтправки.List.CheckSMSList.Количество();
					Для Счетчик = 1 По КолвоОтправленных Цикл
						ТекСообщение  = СписокСообщений.Получить((ТекущийИндекс-КолвоОтправленных) + Счетчик);
						ОтпрСообщение = РезультатОтправки.List.CheckSMSList.Получить(Счетчик-1);
						Если ТекСообщение.GUID = ОтпрСообщение.G Тогда
							ТекСообщение.КодОшибки = ОтпрСообщение.R;
						КонецЕсли;
						// Есть ли неотправленные сообщения
						Если ТекСообщение.КодОшибки < 0 Тогда 
							ЕстьНеОтправленныеСообщения = Истина;
						КонецЕсли;
					КонецЦикла; 
					// Очищаем список отправленных сообщений
					СчетчикПакетаСообщений = 0;
					МассивСообщений.GroupSMSList.Очистить();
				ИначеЕсли КодОшибки < 0 Тогда 						
					ЕстьНеОтправленныеСообщения = Ложь;
					Прервать;
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
		// Если есть не отправленные, то повторяем отправку еще один раз
		Если НЕ ЕстьНеОтправленныеСообщения Тогда Прервать; КонецЕсли; 
	КонецЦикла;
	Возврат КодОшибки;
КонецФункции // смсОтправитьСообщения()

// Функция предназначена для получения статуса отправленного sms-сообщения 
//
// Параметры:
//	ИдентификаторСообщения	- Строка	- Уникальный идентификатор сообщения
// 
// Возвращаемое значение:
//	Число	- Числовой код ошибки < 0 или код текущего статуса > 0
//
Функция смсПолучитьСтатус(ИдентификаторСообщения)
	// Проверяем наличие сессии
	НомерСессии = смсПолучитьНомерСессии();
	Если НомерСессии = 0 Тогда
		КодОшибки = смсПодключиться();
		Если КодОшибки < 0 Тогда
			// Пробуем переключиться на резервный сервер
			смсПоменятьСервер();
			КодОшибки = смсПодключиться();
			Если КодОшибки < 0 Тогда
				КодОшибки = -199999;
				Возврат КодОшибки; // Проблема с интернетом
			КонецЕсли;
		КонецЕсли;	
		ПараметрыСеанса.смсНомерСессии = КодОшибки;
		НомерСессии = смсПолучитьНомерСессии();
	КонецЕсли;	
	КодОшибки = 1;
	// Подключаем веб-сервис
	ВебСервис = смсПодключитьВебСервис();
	Если ВебСервис = Неопределено Тогда
		смсПоменятьСервер();
		ВебСервис = смсПодключитьВебСервис();
		Если ВебСервис = Неопределено Тогда
			КодОшибки = -9;
			Возврат КодОшибки;
		КонецЕсли;	
	КонецЕсли; 
	// Получаем фабрику XDTO
	Фабрика   = ВебСервис.ФабрикаXDTO;
	МассивСообщений = Фабрика.Создать(Фабрика.Тип("SMS client", "ArrayOfString"));
	// Добавляем GUID сообщения в массив
	МассивСообщений.string.Добавить(ИдентификаторСообщения);
	Попытка	
		// Запрос статусов сообщений на сервере
		РезультатОтправки = ВебСервис.CheckSMS(НомерСессии, МассивСообщений);
	Исключение
		РезультатОтправки = Неопределено;
	КонецПопытки; 
	Если РезультатОтправки = Неопределено Тогда
		КодОшибки = -199999;
	Иначе
		// Получаем код ошибки
		КодОшибки = РезультатОтправки.Result;
		Если (КодОшибки = -1) ИЛИ (КодОшибки = -2) Тогда
			// Если сессия устарела или ее нет
			КодОшибкиПодключения = смсПодключиться();
			Если КодОшибкиПодключения > 0 Тогда
				// Пробуем получить еще раз
				ПараметрыСеанса.смсНомерСессии = КодОшибкиПодключения;
				НомерСессии = смсПолучитьНомерСессии();
				Попытка
					// Запрос статусов сообщений на сервере
					РезультатОтправки = ВебСервис.CheckSMS(НомерСессии, МассивСообщений);
				Исключение
					РезультатОтправки = Неопределено;
				КонецПопытки;
				Если РезультатОтправки = Неопределено Тогда
					КодОшибки = -99999;
				Иначе	
					КодОшибки = РезультатОтправки.Result;
				КонецЕсли;							
			КонецЕсли;
		ИначеЕсли (КодОшибки > -20) И (КодОшибки < -2) Тогда
			// Возможно, что Основной сервер не доступен, пробуем переключится на резервный.
			смсПоменятьСервер();
			КодОшибкиПодключения = смсПодключиться();
			// Если ошибка подключения
			Если КодОшибкиПодключения < 1 Тогда
				КодОшибки = -199999;
				Возврат КодОшибки; // Проблема с интернетом
			Иначе
				ПараметрыСеанса.смсНомерСессии = КодОшибки;
				НомерСессии = смсПолучитьНомерСессии();
				Попытка	
					// Запрос статусов сообщений на сервере
					РезультатОтправки = ВебСервис.CheckSMS(НомерСессии, МассивСообщений);
				Исключение
					РезультатОтправки = Неопределено;
				КонецПопытки; 
				Если РезультатОтправки = Неопределено Тогда
					КодОшибки = -199999;
					Возврат КодОшибки; // Проблема с интернетом
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если КодОшибки > 0 Тогда
		// Получаем список со статусами
		СписокСтатусов = РезультатОтправки.List.CheckSMSList;
		Если Тип(СписокСтатусов) = ТипЗнч("ОбъектXDTO") Тогда
			НовыйСписок = Новый ТаблицаЗначений;
			НовыйСписок.Колонки.Добавить("G");
			НовыйСписок.Колонки.Добавить("R");
			НовСтрока = НовыйСписок.Добавить();
			НовСтрока.G		= СписокСтатусов.G;
			НовСтрока.R		= СписокСтатусов.R;
			СписокСтатусов	= НовыйСписок;
		КонецЕсли;
		// статус возвращается в виде числа представляющего из себя битовую маску
		КодСтатуса		= СписокСтатусов[0].R;
		Если Число(КодСтатуса) < 0 Тогда
			// Ошибка 
			КодОшибки = КодСтатуса;
		Иначе
			// Раскладываем битовую маску статуса
			к3 = Цел(КодСтатуса / 65536);						// если нечетное то статус окончательный, 
																// если четное - то еще идет обработка сообщения
			к2 = Цел((КодСтатуса - (к3 * 65536)) / 256);		// количество доставленных частей
			к1 = Цел(КодСтатуса - (к3 * 65536) - (к2 * 256));	// количество частей всего
			// Вычисляем статус сообщения
			Если НЕ (к3/2 = Цел(к3/2)) Тогда // нечетное
				Если к1 = к2 Тогда
					Если к2 = 0 Тогда
						ТекСтатус = 7; // Ошибка
					Иначе 
						ТекСтатус = 5; // Доставлено
					КонецЕсли;
				Иначе
					ТекСтатус = 4; // Не отправлено
				КонецЕсли;	
			Иначе // четное 
				Если к1 = к2 Тогда
					ТекСтатус = 3; // Отправлено
				ИначеЕсли к2 = 0 ИЛИ (к3 = 0 И к2 < к1) Тогда
					ТекСтатус = 3; // Отправлено
				КонецЕсли;
			КонецЕсли;
			КодОшибки = ТекСтатус;
		КонецЕсли; 
		МассивСообщений.string.Очистить();
	КонецЕсли; 
	Возврат КодОшибки;
КонецФункции // смсПолучитьСтатус()

// Функция преобразует таблицу значений в массив структур
//
// Параметры:
//	ТаблицаЗначений	- ТаблицаЗначений	- Таблица значений
//
// Возвращаемое значение:
//	Массив	- Массив структур
//
Функция смсТаблицаЗначенийВМассивСтруктур(ТаблицаЗначений)
	Результат = Новый Массив;
	// Обходим таблицу значений
	Для Каждого Строка Из ТаблицаЗначений Цикл
		// Создаем структуру
		Свойства = Новый Структура;
		// Заполняем структуру колонками таблицы значений
		Для каждого Колонка Из ТаблицаЗначений.Колонки Цикл
			Свойства.Вставить(Колонка.Имя, Строка[Колонка.Имя]);
		КонецЦикла;
		// Добавляем созданную структуру в таблицу значений
		Результат.Добавить(Свойства);
	КонецЦикла;
	Возврат Результат;
КонецФункции // смсТаблицаЗначенийВМассивСтруктур()

// Функция возвращает описание ошибки по ее коду
// 
// Параметры:
//	КодОшибки	- Число	- Код ошибки
//
// Возвращаемое значение:
//	Строка	- Текст сообщения об ошибке
//
Функция  смсОписаниеОшибокВебСервиса(КодОшибки)
	Если КодОшибки = 0 Тогда
		ТекстСообщить = "ru = ""Превышен предел открытых сессий.""";
	ИначеЕсли КодОшибки = -1 Тогда
		ТекстСообщить = "ru = ""Неверный логин или пароль (Необходимо использовать пароль для доступа к SMS сервису из внешних программ).""";
	ИначеЕсли КодОшибки = -2 Тогда
		ТекстСообщить = "ru = ""Сессия закрыта.""";
	ИначеЕсли КодОшибки = -9 Тогда
		ТекстСообщить = "ru = ""Отказ сервера.""";
	ИначеЕсли КодОшибки = -10 Тогда
		ТекстСообщить = "ru = ""Неизвестная ошибка сервера.""";
	ИначеЕсли КодОшибки = -20 Тогда
		ТекстСообщить = "ru = ""Сбой сеанса связи.""";
	ИначеЕсли КодОшибки = -21 Тогда
		ТекстСообщить = "ru = ""Сообщение не идентифицировано.""";
	ИначеЕсли КодОшибки = -22 Тогда
		ТекстСообщить = "ru = ""Неверный идентификатор сообщения.""";
	ИначеЕсли КодОшибки = -23 Тогда
		ТекстСообщить = "ru = ""Неверный параметр - GMT""";
	ИначеЕсли КодОшибки = -30 Тогда
		ТекстСообщить = "ru = ""Неизвестная кодировка сообщения. (не заполнен текст сообщения)""";
	ИначеЕсли КодОшибки = -31 Тогда
		ТекстСообщить = "ru = ""Неразрешенная зона тарификации.""";
	ИначеЕсли КодОшибки = -32 Тогда
		ТекстСообщить = "ru = ""Неверный параметр - дата начала или окончания доставки сообщения.""";
	ИначеЕсли КодОшибки = -33 Тогда
		ТекстСообщить = "ru = ""Превышение длительности доставки.""";
	ИначеЕсли КодОшибки = -34 Тогда
		ТекстСообщить = "ru = ""Превышение срока актуальности доставки.""";
	ИначеЕсли КодОшибки = -35 Тогда
		ТекстСообщить = "ru = ""Неверный параметр - период доставки сообщения.""";
	ИначеЕсли КодОшибки = -36 Тогда
		ТекстСообщить = "ru = ""Неизвестный код группы.""";
	ИначеЕсли КодОшибки = -50 Тогда
		ТекстСообщить = "ru = ""Неверный отправитель.""";
	ИначеЕсли КодОшибки = -51 Тогда
		ТекстСообщить = "ru = ""Неразрешенный получатель.""";
	ИначеЕсли КодОшибки = -52 Тогда
		ТекстСообщить = "ru = ""Недостаточно средств на Вашем счете.""";
	ИначеЕсли КодОшибки = -53 Тогда
		ТекстСообщить = "ru = ""Незарегистрированный отправитель.""";
	ИначеЕсли КодОшибки <= -54 И КодОшибки >= -59 Тогда
		ТекстСообщить = "ru = ""Таймаут изменения счета.""";
	ИначеЕсли КодОшибки = -66 Тогда
		ТекстСообщить = "ru = ""Не задан отправитель.""";
	ИначеЕсли КодОшибки = -67 Тогда
		ТекстСообщить = "ru = ""Превышение сроков отправки""";
	ИначеЕсли КодОшибки = -68 Тогда
		ТекстСообщить = "ru = ""Пользователь заблокирован.""";
	ИначеЕсли КодОшибки = -99999 Тогда
		ТекстСообщить = "ru = ""Ошибка соединения (нет доступа к интернету или не указаны настройки прокси-сервера).""";
	Иначе
		ТекстСообщить = "ru = ""Неизвестная ошибка... код ошибки: " + Строка(КодОшибки) + ".""";
	КонецЕсли;
	Возврат НСтр(ТекстСообщить);
КонецФункции //  смсОписаниеОшибокВебСервиса()

// Функция предназначена для подключению к серверу SMS4B. Вызывается перед первой попыткой обращения
// к функциям сервера либо после разрыва сервером SMS4B открытой ранее сессии.
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Число	- НомерСессии > 0, если функция выполнена успешно,
//				или код ошибки < 0, если функция выполнена не успешно 
//				(см описание функции ОписаниеОшибокВебСервиса ()). 
//
Функция смсПодключиться()
	// Получаем имя пользователя и пароль
	КодОшибки = 1;
	Попытка
		Владелец = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Константа.ПровайдерSMS");
		УстановитьПривилегированныйРежим(Истина);
		ИмяПользователя    = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец, "Логин");
		ПарольПользователя = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец);
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		// Не были определены имя или пароль пользователя для отправки СМС
		КодОшибки = -1;
		Возврат КодОшибки;
	КонецПопытки;
	// Устанавливаем GMT=0, т.к. всегда будем работать по UTC (как сервер SMS4B)
	GMT = 0;
	// Собираем информацию о конфигурации (для статистики на сервере SMS4B)
	ИмяКонфигурации 	= СтрЗаменить(Метаданные.Имя, " ", "_");
	КраткаяИнформация 	= СтрЗаменить(Метаданные.КраткаяИнформация," ","_");
	ИмяКонфигурации = ИмяКонфигурации + "(" + КраткаяИнформация + ")";
	Если СтрДлина(ИмяКонфигурации) > 425 Тогда
		ИмяКонфигурации = Лев(ИмяКонфигурации, 425);
	КонецЕсли;	
	ВерсияЯдра			= смсВернутьВерсиюЯдра();
	ИнформацияОСистеме	= Новый СистемнаяИнформация;
	// Дополняем имя пользователя сведениями о конфигурации
	Пользователь = " S_" + ВерсияЯдра + "_" + Метаданные.Версия + "_" + ИмяКонфигурации + "_" + ИнформацияОСистеме.ВерсияПриложения + " " + ИмяПользователя;
	Пароль 		 = ПарольПользователя;
	// Всегда пробуем сначала подключиться на основной сервер
	ВебСервис = смсПодключитьВебСервис();
	Если ВебСервис = Неопределено Тогда
		смсПоменятьСервер();
		ВебСервис = смсПодключитьВебСервис();
		Если ВебСервис = Неопределено Тогда
			КодОшибки = -9;
			Возврат КодОшибки;
		КонецЕсли;	
	КонецЕсли; 
	// Открываем сессию для работы с веб-сервисом
	Попытка
		РезультатПодключения = ВебСервис.StartSession(Пользователь, Пароль, GMT); 
	Исключение
		РезультатПодключения = Неопределено;
	КонецПопытки;
	// Запомним код ошибки
	КодОшибки = РезультатПодключения;
	// Проверяем результат подключения первый раз
	// Если нет связи, либо ошибки от -1 до -19, то подключаемся на резервный сервер
	Если (РезультатПодключения = Неопределено) ИЛИ ((РезультатПодключения <= -1) И (РезультатПодключения >= -19)) Тогда
		// Подключаемся к резервному серверу
		смсПоменятьСервер();
		ВебСервис = смсПодключитьВебСервис();
		Если ВебСервис = Неопределено Тогда
			смсПоменятьСервер();
			ВебСервис = смсПодключитьВебСервис();
			Если ВебСервис = Неопределено Тогда
				КодОшибки = -9;
				Возврат КодОшибки;
			КонецЕсли;	
		КонецЕсли; 
		Попытка
			РезультатПодключения = ВебСервис.StartSession(Пользователь, Пароль, GMT); 
		Исключение
			РезультатПодключения = Неопределено;
		КонецПопытки;
		// Запомним код ошибки
		КодОшибки = РезультатПодключения;
	КонецЕсли;
	// Проверяем результат подключения второй раз
	Если РезультатПодключения = Неопределено Тогда
		// Проверяем код ошибки, если не доступен резервный сервер
		Если КодОшибки = Неопределено Тогда
			КодОшибки = -99999; // Проблема с интернетом (сервис не ответил)
		КонецЕсли; 
	Иначе
		// Проверяем РезультатПодключения на ошибки 
		КодОшибки = РезультатПодключения;
		Если КодОшибки > 0 Тогда
			ПараметрыСеанса.смсНомерСессии = КодОшибки;
		ИначеЕсли КодОшибки < 0 Тогда
			смсВывестиСообщение(смсОписаниеОшибокВебСервиса(КодОшибки), СтатусСообщения.Важное, "Подключение SMS", УровеньЖурналаРегистрации.Ошибка);
		КонецЕсли;
	КонецЕсли;	
	// Возвращаем результат работы функции
	Возврат КодОшибки;	
КонецФункции // смсПодключиться()

//////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ МЕТОДЫ ЯДРА

// Функция выполняет подключение к ВебСервису
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	WS-ссылка	- Ссылка на ВебСервис
//
Функция смсПодключитьВебСервис()
	смсОсновнойСервер	= смсПолучитьОсновнойСервер();
	Владелец = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Константа.ПровайдерSMS");
	УстановитьПривилегированныйРежим(Истина);
	ИмяПользователя    = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец, "Логин");
	ПарольПользователя = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Владелец);
	УстановитьПривилегированныйРежим(Ложь);
	Попытка
		Если смсОсновнойСервер Тогда
			// Основной сервер
			Определения = Новый WSОпределения("https://sms4b.ru/webservices/sms.asmx?WSDL", ИмяПользователя, ПарольПользователя);
			ВебСервис = Новый WSПрокси(Определения, "SMS client", "WSSM", "WSSMSoap12");
		Иначе
			// Резервный сервер
			Определения = Новый WSОпределения("https://s.sms4b.ru/webservices/sms.asmx?WSDL", ИмяПользователя, ПарольПользователя);
			ВебСервис = Новый WSПрокси(Определения, "SMS client", "WSSM", "WSSMSoap12");
		КонецЕсли; 
	Исключение
		Возврат Неопределено;
	КонецПопытки; 
	Возврат ВебСервис;
КонецФункции // смсПодключитьВебСервис()

// Процедура меняет основной сервер
//
// Параметры:
//	Нет.
//
Процедура смсПоменятьСервер()
	ОсновнойСервер	= смсПолучитьОсновнойСервер();
	ПараметрыСеанса.смсОсновнойСервер = НЕ ОсновнойСервер;
КонецПроцедуры // смсПоменятьСервер()

// Функция возвращает версию ядра
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	Строка	- Номер версии ядра
//
Функция смсВернутьВерсиюЯдра()
	Возврат "2.0.2.1";
КонецФункции // смсВернутьВерсиюЯдра()

// Функция переводит дату из текстовый формат вида 'YYYYMMDD hh:mm:ss' в канонический формат
//
// Параметры:
//	СтрокаДаты	- Строка	- Строка даты
//
// Возвращаемое значение:
//	Дата	- Дата
//
Функция смсСтрокаВДату(СтрокаДаты)
	Стр = СтрЗаменить(СтрокаДаты, "-", "");
	Стр = СтрЗаменить(Стр, ":", "");
	Стр = СтрЗаменить(Стр, " ", "");
	Возврат Дата(Стр);
КонецФункции // смсСтрокаВДату()

// Функция переводит дату в формате 1С в международный текстовый формат 
// вида 'YYYYMMDD hh:mm:ss'
//
// Параметры:
//	СтруктураДаты - Структура - Структура, содержащая дату и количество миллисекунд
//	
// Возвращаемое значение:
//	Строка	- Дата в международном текстовом формате
//
Функция смсДатаВСтроку(СтруктураДаты)
	Если ТипЗнч(СтруктураДаты) = Тип("Структура") Тогда 
		Дата1С			= СтруктураДаты.Дата;
		Миллисекунда1С	= СтруктураДаты.Миллисекунда;
	Иначе
		Дата1С			= СтруктураДаты;
		Миллисекунда1С	= 0;
	КонецЕсли;
	Если Дата1С = Дата('00010101') Тогда
		Результат = "";
	Иначе
		Результат = Формат(Год(Дата1С), "ЧГ=0") 
		+ ?(СтрДлина(Строка(Месяц(Дата1С))) < 2,"0" + Строка(Месяц(Дата1С)) , Строка(Месяц(Дата1С)))
		+ ?(СтрДлина(Строка(День(Дата1С))) < 2, "0" + Строка(День(Дата1С)), Строка(День(Дата1С))) + " "
		+ ?(СтрДлина(Строка(Час(Дата1С))) < 2, "0" + Строка(Час(Дата1С)), Строка(Час(Дата1С))) + ":" 
		+ ?(СтрДлина(Строка(Минута(Дата1С))) < 2, "0" + Строка(Минута(Дата1С)), Строка(Минута(Дата1С))) + ":"
		+ ?(СтрДлина(Строка(Секунда(Дата1С))) < 2, "0" + Строка(Секунда(Дата1С)), Строка(Секунда(Дата1С)))+ "."	
		+ Строка(Миллисекунда1С);
	КонецЕсли;	
	Возврат Результат;
КонецФункции // смсДатаВСтроку()

// Процедура выводит переданное сообщение
//
// Параметры:
//	Сообщение	- Строка					- Текст сообщения
//	Статус		- СтатусСообщения			- Статус сообщения
//	Заголовок	- Строка					- Событие для журнала регистрации
//	Уровень		- УровеньЖурналаРегистрации	- Уровень для журнала регистрации
//
Процедура смсВывестиСообщение(Сообщение, Статус, Заголовок, Уровень)
	
	ЗаписьЖурналаРегистрации(Заголовок, Уровень, , , Сообщение);
	
	СообщениеДляПользователя=Новый СообщениеПользователю;
	СообщениеДляПользователя.Текст=Сообщение;
	СообщениеДляПользователя.Сообщить();
	
КонецПроцедуры // смсВывестиСообщение()

//////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ СО СТРОКАМИ

// Функция дополняет строку до указанной длины определенным символов
//
// Параметры:
//	Стр		- Строка	- Строка
//	Длина	- Число		- Длина строки
//	Чем		- Строка	- Символ для добавления
//
// Возвращаемое значение:
//	Строка	- Строка, дополненная до указанной длины
//
Функция смсДополнитьСтроку(Знач Стр, Длина, Чем = " ")  // Padl
	СимволовДополнить = Длина - СтрДлина(Стр);
	Добавок = "";
	Для Н = 1 По СимволовДополнить Цикл
		Добавок = Добавок + Чем;
	КонецЦикла;
	Возврат  Добавок + Стр;
КонецФункции // смсДополнитьСтроку()

// Функция переводит десятичное число в шестнадцатеричное
//
// Параметры:
//	Число	- Число	- Десятичное число
//
// Возвращаемое значение:
//	Строка	- Шестнадцатеричное число
//
Функция смсДесятичноеВШестнадцатеричное(Знач _Число) // DecToHex
	База = 16;
	Результат = "";
	Пока _Число <> 0 Цикл
		Поз =_Число % База;
		Результат = Сред("0123456789ABCDEF", Поз + 1, 1) + Результат;
		_Число = Цел(_Число / База);
	КонецЦикла;
	Возврат Результат;
КонецФункции // смсДесятичноеВШестнадцатеричное()

// Функция переводит обычную строку в шестнадцатеричное представление
//
// Параметры:
//	ТекстСообщения	- Строка	- Текст сообщения
//	ТипКодировки	- Число		- Тип кодировки (1 - каждый символ 
//								  представляется 2 байтами, 0 - 1 байтом)
//
// Возвращаемое значение:
//	Строка	- Строка после перекодировки
//
Функция смсСтрокуВШестнадцатеричноеПредставление(ТекстСообщения, ТипКодировки) // Str2Hex
	СтрокаЗнаков = "";
	Если ТипКодировки = 1 Тогда
		ДлинаКодаСимвола = 4;
	Иначе
		ДлинаКодаСимвола = 2;
	КонецЕсли;
	Для К = 1 По СтрДлина(ТекстСообщения) Цикл
		СтрокаЗнаков = СтрокаЗнаков + смсДополнитьСтроку(смсДесятичноеВШестнадцатеричное(КодСимвола(Сред(ТекстСообщения, К, 1))), ДлинаКодаСимвола, "0");
	КонецЦикла;
	Возврат СтрокаЗнаков;
КонецФункции // смсСтрокуВШестнадцатеричноеПредставление()

// Функция возвращает обработанный идентификатор сообщения
//
// Параметры:
//	ИдентификаторСообщения	- Строка	- Идентификатор сообщения
//
// Возвращаемое значение:
//	Строка	- Идентификатор сообщения
//
Функция смсПолучитьИдентификаторСообщения(ИдентификаторСообщения = "")
	Если ПустаяСтрока(ИдентификаторСообщения) Тогда
		ИдентификаторСообщения = Лев(Строка(Новый УникальныйИдентификатор), 20);
	КонецЕсли;	
	Возврат (ИдентификаторСообщения + Сред(ИдентификаторСообщения, 16, 3) + "-" + Сред(ИдентификаторСообщения, 10, 4 ) + Лев(ИдентификаторСообщения, 8));
КонецФункции // смсПолучитьИдентификаторСообщения()

#КонецОбласти