// +Рарус
// Модуль менеджера справочника "Ключевые операции".

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	// Сформируем таблицу ключевых операций
	МетаданныеСправочника = Метаданные.Справочники.КлючевыеОперации;
	
	ТаблицаКлючевыхОпераций = Новый ТаблицаЗначений;
	ТаблицаКлючевыхОпераций.Колонки.Добавить("ИмяКлючевойОперации", МетаданныеСправочника.Реквизиты.Имя.Тип);
	ТаблицаКлючевыхОпераций.Колонки.Добавить("ЦелевоеВремя", 		МетаданныеСправочника.Реквизиты.ЦелевоеВремя.Тип);
	
	ЗаполнитьТаблицуЦелевогоВремениКлючевыхОпераций(ТаблицаКлючевыхОпераций);
	
	Для Каждого Строка Из ТаблицаКлючевыхОпераций Цикл
		УстановитьРеквизитыКлючевойОперации(Строка.ИмяКлючевойОперации,Строка.ЦелевоеВремя);
	КонецЦикла;
	
	// РАРУС +
	// Выполним заполнение приоритета элементов, где они не заполнены
	Выборка = Справочники.КлючевыеОперации.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВыборкаОбъект = Выборка.ПолучитьОбъект();
		ВыборкаОбъект.Приоритет = ?(ЗначениеЗаполнено(ВыборкаОбъект.Приоритет), ВыборкаОбъект.Приоритет, 1);
		ВыборкаОбъект.ОбменДанными.Загрузка = Истина;
		ВыборкаОбъект.Записать();
	КонецЦикла;
	// РАРУС -
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

Процедура УстановитьРеквизитыКлючевойОперации(ИмяКлючевойОперации, ЦелевоеВремя, Приоритет=1)
	
	СсылкаНаКлючевуюОперацию = ОценкаПроизводительностиПовтИсп.ПолучитьКлючевуюОперациюПоИмени(ИмяКлючевойОперации);
	СпрОбъект = СсылкаНаКлючевуюОперацию.ПолучитьОбъект();

	СпрОбъект.ДополнительныеСвойства.Вставить(ОценкаПроизводительностиКлиентСервер.НеПроверятьПриоритет());
	
	СпрОбъект.ПометкаУдаления				= Ложь;
	СпрОбъект.Имя							= ИмяКлючевойОперации;
	СпрОбъект.МинимальноДопустимыйУровень 	= Перечисления.УровниПроизводительности.Хорошо;
	Если НЕ ЗначениеЗаполнено(СпрОбъект.Приоритет) Тогда
		СпрОбъект.Приоритет					= Приоритет;
	КонецЕсли;
	СпрОбъект.ЦелевоеВремя					= ЦелевоеВремя;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СпрОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуЦелевогоВремениКлючевыхОпераций(ТаблицаКлючевыхОпераций)

	// Переберем все метаданные, заполняя таблицу
	Для Каждого Объект Из Метаданные.Справочники Цикл
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыСправочника" + Объект.Имя,0.5);
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыСправочника" + Объект.Имя,0.5);
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЗаписьСправочника" + Объект.Имя,0.5);
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "КопированиеСправочника" + Объект.Имя,0.5);
	КонецЦикла;
	
	// Переберем все метаданные, заполняя таблицу
	Для Каждого Объект Из Метаданные.Документы Цикл
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокумента" + Объект.Имя,0.5);
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокумента" + Объект.Имя,0.5);
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "КопированиеДокумента" + Объект.Имя,1.5);
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокумента" + Объект.Имя,3);
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЗаписьДокумента" + Объект.Имя,0.5);
	КонецЦикла;
	
	// Переберем все метаданные, заполняя таблицу
	Для Каждого Объект Из Метаданные.РегистрыСведений Цикл
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеРегистра" + Объект.Имя,0.5);
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеРегистра" + Объект.Имя,0.5);
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "КопированиеРегистра" + Объект.Имя,0.5);
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЗаписьРегистра" + Объект.Имя,0.5);
	КонецЦикла;

	// Переберем все метаданные, заполняя таблицу
	Для Каждого Объект Из Метаданные.ПланыВидовХарактеристик Цикл
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыПланаВидаХарактеристик" + Объект.Имя,0.5);
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыПланаВидаХарактеристик" + Объект.Имя,0.5);
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЗаписьПланаВидаХарактеристик" + Объект.Имя,0.5);
		ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "КопированиеПланаВидаХарактеристик" + Объект.Имя,0.5);
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, ИмяКлючевойОперации, ЦелевоеВремя=1)

	НоваяСтрока = ТаблицаКлючевыхОпераций.Добавить();
	НоваяСтрока.ИмяКлючевойОперации = ИмяКлючевойОперации;
	НоваяСтрока.ЦелевоеВремя 		= ЦелевоеВремя;

КонецПроцедуры 

#КонецЕсли
// -Рарус
