// Модуль основной формы документа "Поступление товаров"
&НаКлиенте
перем ШтрихКодДляПоиска;
&НаКлиенте
Перем УдаляемыеСтроки; // Для удаления акцизных марок


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ПослеПодбораМарок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = ДополнительныеПараметры.ДанныеСтроки;
	
	ИнтеграцияЕГАИСКлиент.ПослеПодбораМарок(ЭтотОбъект, Объект, ДанныеСтроки, Результат);
	
	ТоварыКоличествоПриИзменении(Неопределено);
	
КонецПроцедуры // ПослеПодбораМарок()

&НаСервере
Процедура СохранитьСтатусПроверкиМарок()
	
	Если Объект.Марки.Количество()=0 ИЛИ Объект.ПолученИзЕГАИС Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.СтатусыПроверкиМарокДокументовМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Объект.Ссылка);
	ЗаписьРегистра = НаборЗаписей.Добавить();
	ЗаписьРегистра.Документ = Объект.Ссылка;
	ЗаписьРегистра.Статус   = СтатусПроверки;
	
	НаборЗаписей.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСтатусПроверкиМарок()
	
	Если Объект.Марки.Количество()=0 ИЛИ Объект.ПолученИзЕГАИС Тогда
		Возврат;
	КонецЕсли;
	
	ТекстГиперссылки = "НеВыполнялось";
	СтатусПроверки = Перечисления.СтатусыПроверкиМарокВДокументахМП.НеВыполнялось;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбновитьПредставлениеСтатусаПроверкиМарок(ТекстГиперссылки);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(СтатусыПроверкиМарокДокументовМП.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыПроверкиМарокВДокументахМП.НеВыполнялось)) КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыПроверкиМарокДокументовМП КАК СтатусыПроверкиМарокДокументовМП
	|ГДЕ
	|	СтатусыПроверкиМарокДокументовМП.Документ = &ДокументСсылка
	|";
	Запрос.УстановитьПараметр("ДокументСсылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтатусПроверки = Выборка.Статус;
		ТекстГиперссылки = Перечисления.СтатусыПроверкиМарокВДокументахМП.ПолучитьИмя(Выборка.Статус);
	КонецЕсли;
	ОбновитьПредставлениеСтатусаПроверкиМарок(ТекстГиперссылки);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

#Область Статус

&НаСервере
Процедура ОбновитьСтатусОбработки()
	
	Если НЕ Объект.ПолученИзЕГАИС Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.ТоварноТранспортнаяНакладнаяЕГАИС);
	
	ИмяДокумента       = Объект.ТоварноТранспортнаяНакладнаяЕГАИС.Метаданные().Имя;
	СтатусПоУмолчанию  = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработкиПоУмолчанию(ИмяДокумента);
	СтатусОбработки    = СтатусПоУмолчанию.СтатусОбработки;
	ДальнейшееДействие = СтатусПоУмолчанию.ДальнейшееДействие;
	
	Если ЗначениеЗаполнено(Объект.ТоварноТранспортнаяНакладнаяЕГАИС) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Статусы.СтатусОбработки КАК СтатусОбработки,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие1 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияЕГАИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие1
		|	КОНЕЦ КАК ДальнейшееДействие1,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие2 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияЕГАИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие2
		|	КОНЕЦ КАК ДальнейшееДействие2,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие3 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияЕГАИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие3
		|	КОНЕЦ КАК ДальнейшееДействие3
		|ИЗ
		|	РегистрСведений.СтатусыДокументовЕГАИС КАК Статусы
		|ГДЕ
		|	Статусы.Документ = &Документ";
		
		Запрос.УстановитьПараметр("Документ",                 Объект.ТоварноТранспортнаяНакладнаяЕГАИС);
		Запрос.УстановитьПараметр("МассивДальнейшиеДействия", ИнтеграцияЕГАИС.НеотображаемыеВДокументахДальнейшиеДействия());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СтатусОбработки = Выборка.СтатусОбработки;
			ДальнейшееДействие = Новый Массив;
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие1);
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие2);
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие3);
		КонецЕсли;
		
	КонецЕсли;
	
	ДопустимыеДействия = Новый Массив;
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеАктПодтверждения);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеПередачуДанных);
	
	СтатусОбработкиПредставление = ИнтеграцияЕГАИС.ПредставлениеСтатусаОбработки(
		СтатусОбработки,
		ДальнейшееДействие,
		ДопустимыеДействия,
		Объект);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при нажатии на гиперссылку форматированной строки "Статус обработки представление".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НавигационнаяСсылкаФорматированнойСтроки - Строка - Значение гиперссылки форматированной строки.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура СтатусОбработкиПредставлениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	Если Модифицированность ИЛИ (Не ЗначениеЗаполнено(Объект.Ссылка)) Или (Не Объект.Проведен) Тогда
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("СтатусОбработкиОбработкаНавигационнойСсылкиЗавершение", ЭтотОбъект, Новый Структура("НавигационнаяСсылкаФорматированнойСтроки", НавигационнаяСсылкаФорматированнойСтроки));
		ТекстВопроса = НСтр("ru = 'Для продолжения документ необходимо провести. Провести?'");
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки);
	КонецЕсли;
	
КонецПроцедуры // СтатусОбработкиПредставлениеОбработкаНавигационнойСсылки()

&НаСервере
Процедура ОбновитьСтатусПроверкиМарок()
	
	ТекстГиперссылки = "НеВыполнялось";	
	Если СтатусПроверки = Перечисления.СтатусыПроверкиМарокВДокументахМП.Выполняется Тогда
		ТекстГиперссылки = "Выполняется";
	ИначеЕсли СтатусПроверки = Перечисления.СтатусыПроверкиМарокВДокументахМП.Завершено Тогда
		ТекстГиперссылки = "Завершено";
	КонецЕсли;
	
	ОбновитьПредставлениеСтатусаПроверкиМарок(ТекстГиперссылки);
		// сохраняем статус марки
	СохранитьСтатусПроверкиМарок();

КонецПроцедуры // СтатусСтатусПроверкиПредставлениеОбработкаНавигационнойСсылки()

&НаКлиенте
Процедура СтатусПроверкиПредставлениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "НеВыполнялось" Тогда
		СтатусПроверки = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиМарокВДокументахМП.Выполняется");
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "Выполняется" Тогда
		Если ЕстьНеПроверенныеМарки() Тогда
			ДополнительныеПараметры = Новый Структура;
			ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ОбработкаОповещенияСтатусаПроверкиМарок", ЭтотОбъект, ДополнительныеПараметры);
			ТекстВопроса = НСтр("ru = 'Есть марки со статусом ""Не проверялась"", завершить сканирование?'");
			ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет,НСтр("ru = 'Подтверждение статуса'"));
			Возврат;
		Иначе
			СтатусПроверки = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиМарокВДокументахМП.Завершено");
		КонецЕсли;
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "Завершено" Тогда
		СтатусПроверки = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиМарокВДокументахМП.Выполняется");
	КонецЕсли;
	
	ОбновитьСтатусПроверкиМарок();
	
КонецПроцедуры // СтатусСтатусПроверкиПредставлениеОбработкаНавигационнойСсылки()

&НаКлиенте
Функция ЕстьНеПроверенныеМарки()
	
	ЕстьНепроверенныеМарки = Ложь;
	НеПроверялась = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиМаркированнойПродукции.НеПроверялась");
	ПустаяСсылка  = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиМаркированнойПродукции.ПустаяСсылка");
	Для Каждого ТекМарка из Объект.Марки Цикл
		Если ТекМарка.СтатусПроверки = НеПроверялась ИЛИ ТекМарка.СтатусПроверки = ПустаяСсылка Тогда
			ЕстьНепроверенныеМарки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьНепроверенныеМарки;
	
КонецФункции // ПроверкаНаСуществованиеНепроверенныхМарок()

&НаКлиенте
Процедура ОбработкаОповещенияСтатусаПроверкиМарок(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если (РезультатВопроса = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		СтатусПроверки = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиМарокВДокументахМП.Выполняется");
	Иначе
		СтатусПроверки = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиМарокВДокументахМП.Завершено");
		
		НеПроверялась = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиМаркированнойПродукции.НеПроверялась");
		ПустаяСсылка  = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиМаркированнойПродукции.ПустаяСсылка");
		Отсутствует   = ПредопределенноеЗначение("Перечисление.СтатусыПроверкиМаркированнойПродукции.Отсутствует");
		
		Для Каждого ТекМарка из Объект.Марки Цикл
			Если ТекМарка.СтатусПроверки = НеПроверялась ИЛИ ТекМарка.СтатусПроверки = ПустаяСсылка Тогда
				ТекМарка.СтатусПроверки = Отсутствует;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьСтатусПроверкиМарок();
	
КонецПроцедуры // ОбработкаОповещенияСтатусаПроверкиМарок()

&НаКлиенте
Процедура ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПередатьАктПодтверждения" Тогда
		
		ИнтеграцияЕГАИСКлиент.ОтправитьАктЕГАИС(Объект, УникальныйИдентификатор);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтменитьОперацию" Тогда
		
		ИнтеграцияЕГАИСКлиент.ОтменитьПоследнююОперацию(Объект.ТоварноТранспортнаяНакладнаяЕГАИС);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтменитьПередачу" Тогда
		
		ИнтеграцияЕГАИСКлиент.ОтменитьПередачу(Объект.ТоварноТранспортнаяНакладнаяЕГАИС);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеСтатусаПроверкиМарок(ТекстГиперссылки)
	
	ТекстГиперссылки   = "НеВыполнялось";	
	ДальнейшееДействие = НСтр("ru = 'Начать сканирование'");
	Если СтатусПроверки = Перечисления.СтатусыПроверкиМарокВДокументахМП.Выполняется Тогда
		ТекстГиперссылки = "Выполняется";
		ДальнейшееДействие = НСтр("ru = 'Завершить сканирование'");
	ИначеЕсли СтатусПроверки = Перечисления.СтатусыПроверкиМарокВДокументахМП.Завершено Тогда
		ДальнейшееДействие = НСтр("ru = 'Продолжить сканирование'");
		ТекстГиперссылки = "Завершено";
	КонецЕсли;
	
	СтатусПроверкиМарокПредставление = Новый ФорматированнаяСтрока(
	НРег(Перечисления.СтатусыПроверкиМарокВДокументахМП.ПолучитьСиноним(СтатусПроверки)));
	
	СтрокаДальнейшееДействие = Новый ФорматированнаяСтрока(
	ДальнейшееДействие,
	Новый Шрифт(,,,,Истина),
	ЦветаСтиля.ЦветГиперссылкиБЭД,
	,
	ТекстГиперссылки);
	
	СтрокиДальнейшееДействие = Новый Массив;
	СтрокиДальнейшееДействие.Добавить(СтатусПроверкиМарокПредставление);
	СтрокиДальнейшееДействие.Добавить(", ");
	СтрокиДальнейшееДействие.Добавить(СтрокаДальнейшееДействие);
	
	СтатусПроверкиПредставление = Новый ФорматированнаяСтрока(СтрокиДальнейшееДействие);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбработкиОбработкаНавигационнойСсылкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда
		 Возврат;
	КонецЕсли;
	
	Если ПроверитьЗаполнение() Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	КонецЕсли;
	
	Если Не Модифицированность И Объект.Проведен Тогда
		ОбработатьНажатиеНавигационнойСсылки(ДополнительныеПараметры.НавигационнаяСсылкаФорматированнойСтроки);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
	// Запретим использование розничного склада при поступлении товаров на комиссию
	Если Не Элементы.Найти("СкладКомпании")=Неопределено Тогда
		Если Объект.ХозОперация=Справочники.ХозОперации.ПоступлениеТоваровКомиссия Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.СкладКомпании.ПараметрыВыбора, "Отбор.Розничный", ЛОЖЬ);
		Иначе
			УправлениеДиалогомСервер.УдалитьПараметрВыбора(Элементы.СкладКомпании.ПараметрыВыбора, "Отбор.Розничный");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	Элементы.СкладКомпании.Доступность = НЕ(Объект.ХозОперация=Справочники.ХозОперации.УслугиСтороннихОрганизаций);
	
	// Произведем установку видимости колонок розничной цены
	ЗащищенныеФункцииСервер.УстановитьВидимостьКолонкиЦенаРозничная(ЭтотОбъект, Объект.СкладКомпании);
	
	// тк + 
	// Определим, имеет ли смысл давать возможность пользователю редактировать колонки розничной цены.
	ЭтоРозничныйСклад = (ЗначениеЗаполнено(Объект.СкладКомпании) И Объект.СкладКомпании.Розничный);
	// Не во всех объектах имеется реквизит процент рекомендуемой наценки.
	Если НЕ ЭтотОбъект.Элементы.Найти("ТоварыРекомендуемыйПроцентНаценки")=Неопределено Тогда
		ЭтотОбъект.Элементы.ТоварыРекомендуемыйПроцентНаценки.Видимость = ЭтоРозничныйСклад;
		ЭтотОбъект.Элементы.ТоварыУстановитьРекомендуемуюНаценкуНаВесьТовар.Видимость  = ЭтоРозничныйСклад;
		//Форма.Элементы.ТоварыУстановитьРекомендуемуюНаценкуНаВесьТовар.Доступность = РедактированиеДоступно;
	КонецЕсли;
	
	РучноеРаспределение = (Объект.ЗакрытиеЗаказовПоставщикам = 0);
	
	Элементы.РаспределениеПоставкиЕдиницаИзмерения.Видимость = РучноеРаспределение;
	Элементы.РаспределениеПоставкиКоличество.Видимость       = РучноеРаспределение;
	Элементы.РаспределениеПоставкиКоэффициент.Видимость      = РучноеРаспределение;
	Элементы.РаспределениеПоставкиНоменклатура.Видимость     = РучноеРаспределение;
	
	Элементы.ТоварыАлкогольнаяПродукция.Видимость   = Объект.ПолученИзЕГАИС;
	Элементы.ТоварыИдентификаторУпаковки.Видимость  = Объект.ПолученИзЕГАИС;
	Элементы.ТоварыОбъем.Видимость                  = Объект.ПолученИзЕГАИС;
	Элементы.ТоварыПроизводитель.Видимость          = Объект.ПолученИзЕГАИС;
	Элементы.ТоварыПредставлениеМарок.Видимость     = Объект.ПолученИзЕГАИС;
	Элементы.СтраницаМарки.Видимость                = Объект.ПолученИзЕГАИС;
	Элементы.СтатусОбработкиПредставление.Видимость = Объект.ПолученИзЕГАИС;
	Элементы.ТоварыОткрытьСопоставлениеЕГАИС.Видимость = Объект.ПолученИзЕГАИС;
	
	//Мальцев А.Ю. +++
	Элементы.СтраницаМарки.Видимость                = Объект.Марки.Количество() > 0;
	Если Объект.ПолученИзЕГАИС Тогда
		Элементы.ТоварыКоличествоДок.Видимость  = Истина;
		Элементы.ТоварыЦенаДок.Видимость        = Истина;
		Элементы.ТоварыСуммаДок.Видимость       = Истина;
	КонецЕсли;
	
	Элементы.ТоварыПоказатьРасхождение.Видимость   = Ложь;
	Элементы.ТоварыКоличествоПоНакладной.Видимость = Ложь;
	
	Элементы.ТоварыКоличествоДок.ТолькоПросмотр = Объект.ПолученИзЕГАИС;
	Элементы.ТоварыЦенаДок.ТолькоПросмотр       = Объект.ПолученИзЕГАИС;
	Элементы.ТоварыСуммаДок.ТолькоПросмотр      = Объект.ПолученИзЕГАИС;
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Элементы.Контрагент.Доступность = Ложь;
	КонецЕсли;
	
	ИнтеграцияМПВызовСервера.ПоступлениеТоваровУправлениеДиалогом(ЭтотОбъект, Объект);
	//Элементы.СтраницаМарки.Видимость = Ложь;
	
	ОтображатьРасхождения = (Объект.ПолученИзЕГАИС ИЛИ Объект.Товары.Итог("КоличествоДок")>0);
	
	Элементы.НадписьНалоговыйДокумент.Видимость = НЕ Объект.Контрагент.ОсвобожденОтНДС;
	Элементы.АкцептованБухгалтером.Видимость = НЕ Элементы.НадписьНалоговыйДокумент.Видимость;
	// тк - 
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

&НаСервере
Процедура ОбновитьПредставленияНаФорме(Прочитать = Ложь)
	
	Если Прочитать Тогда
		Прочитать();
	Иначе
		ОбновитьСтатусОбработки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставленияСтатусаПослеЗагрузкиМарокМП();
	
	НеПроверялась = Перечисления.СтатусыПроверкиМаркированнойПродукции.НеПроверялась;
	
	ЕстьНепроверенныеМарки = Ложь;
	Для Каждого ТекМарка из Объект.Марки Цикл
		Если ТекМарка.СтатусПроверки = НеПроверялась Тогда
			ЕстьНепроверенныеМарки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьНепроверенныеМарки Тогда
		СтатусПроверки = Перечисления.СтатусыПроверкиМарокВДокументахМП.Выполняется;
		ВывестиСообщение(НСтр("ru = 'Есть не проверенные марки'"), УникальныйИдентификатор);
	Иначе
		СтатусПроверки = Перечисления.СтатусыПроверкиМарокВДокументахМП.Завершено;
	КонецЕсли;
	
	ОбновитьСтатусПроверкиМарок();
	
КонецПроцедуры


// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформлениеПредставлениеМарок(ЭтотОбъект);
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформлениеАлкогольнаяПродукция(ЭтотОбъект);
	
	// Способ распределения
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	// Товары сумма "Только просмотр", если не заполнено количество по накладной
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСумма.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоПоНакладной");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Товары сумма всего "Только просмотр", если не заполнено количество по накладной
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСуммаВсего.Имя);
	
	ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоПоНакладной");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТоварыСуммаВсегоТолькоПросмотр");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКоличество.Имя);
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКоличествоДок.Имя);
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыНоменклатура.Имя);
	
	//ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	//ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Количество");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоДок");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОтображатьРасхождения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(150, 0, 0));
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыЦена.Имя);
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыЦенаДок.Имя);
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыНоменклатура.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Цена");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ЦенаДок");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОтображатьРасхождения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(150, 0, 0));
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
// Параметры:
//  ИмяСобытия - Строка - Имя события, при работе которого необходимо проверить блокировку.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	СписокРеквизитов.Добавить("ЭтотОбъект","ЭтотОбъект",?(ПредопределенноеЗначение("Справочник.ХозОперации.ПоступлениеТоваровСреднееОтрицательное") = Объект.ХозОперация,Истина,Ложь));
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элемент.Заголовок="Грузоотправитель" Тогда
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("Отбор", Новый Структура("ГоловнойКонтрагент", Объект.Контрагент));

		ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора",ПараметрыФормы,Элемент,ЭтотОбъект,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры = "ПодборПоСпискуЗаказанного" И ЭтоАдресВременногоХранилища(РезультатОповещения) Тогда
		ПодобранныеТовары = ПолучитьИзВременногоХранилища(РезультатОповещения);
		
		УсловиеПоиска = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения");
		Для Каждого Строка Из ПодобранныеТовары Цикл
			ЗаполнитьЗначенияСвойств(УсловиеПоиска, Строка);
			
			ПараметрыДействия = Новый Структура;
			
			ПодходящиеСтроки = Объект.Товары.НайтиСтроки(УсловиеПоиска);
			Если ПодходящиеСтроки.Количество() = 0 Тогда
				НоваяСтрока = Объект.Товары.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Количество,Коэффициент");
				
				Документы.ПоступлениеТоваров.ТоварыНоменклатураПриИзменении(Объект, НоваяСтрока, ПараметрыДействия);
				
				// Вызываем общий обработчик изменения реквизитов формы
				УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока, ПараметрыДействия);
			Иначе
				НоваяСтрока = ПодходящиеСтроки[0];
				НоваяСтрока.Количество = НоваяСтрока.Количество + Строка.Количество;
				
				Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(Объект, НоваяСтрока, ПараметрыДействия);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
	// заполним количество по накладной
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Строка") И ДополнительныеПараметры = "КомандаЗаполненияМаркиЗагрузкаИзФайла" Тогда
		СтрокиКУдалению = Новый Массив;
		Для Каждого ТекущиеДанные Из Объект.Марки Цикл
			
			КодМарки = ТекущиеДанные.КодМарки;
			
			Если ПустаяСтрока(КодМарки) Тогда
				СтрокиКУдалению.Добавить(ТекущиеДанные.ПолучитьИдентификатор());
				Продолжить;
			КонецЕсли;
			
			Если Объект.ПолученИзЕГАИС Тогда
				
				ТекущиеДанные.КодМарки = "";
				
				ТекущаяСтрока = Неопределено;
				Если НЕ ИнтеграцияЕГАИСВызовСервера.ПроверитьМарку(Объект, КодМарки, ТекущаяСтрока) Тогда
					СтрокиКУдалению.Добавить(ТекущиеДанные.ПолучитьИдентификатор());
					Продолжить;
				КонецЕсли;
				
				ТекущиеДанные.КодМарки = КодМарки;
				
				// Код АП
				КодАП = ИнтеграцияЕГАИСВызовСервера.ПолучитьКодАПИзАкцизнойМарки(ТекущиеДанные.КодМарки);
				Если КодАП = Неопределено Тогда
					ВывестиСообщение(НСтр("ru = 'Не удалось вычислить код алкогольной продукции для акцизной марки: %1'"),,,,, ТекущиеДанные.КодМарки);
					СтрокиКУдалению.Добавить(ТекущиеДанные.ПолучитьИдентификатор());
					Продолжить;
				КонецЕсли;
				// Шк акцизной марки 
				ИнтеграцияЕГАИС.ДобавитьМаркуПриход(Неопределено, Объект, ТекущиеДанные.КодМарки, КодАП, ТекущиеДанные);
				
				// Вызываем обработчик изменения данных объекта
				Документы.ПоступлениеТоваров.МаркиКодМаркиПриИзменении(Объект, ТекущиеДанные);
				
			Иначе
				
				ДобавитьМаркуНаСервере(КодМарки);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого ТекущаяСтрока Из СтрокиКУдалению Цикл
			Объект.Марки.Удалить(ТекущаяСтрока);
		КонецЦикла;
	ИначеЕсли ТиПЗнч(ДополнительныеПараметры) = Тип("Строка") И ЛЕВ(ДополнительныеПараметры, 17)="КомандаЗаполнения" Тогда
		Для Каждого ТекСтрока Из Объект.Товары Цикл
			ТекСтрока.КоличествоПоНакладной = ТекСтрока.Количество;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
	ТребуетсяСопоставление = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТребуетсяСопоставление", Ложь);
	Если ТребуетсяСопоставление Тогда
		ОткрытьСопоставлениеЕГАИС(Неопределено);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()

// Обработчик события возникающего при нажатии кнопки "Количество по накладной" подменю "Заполнение".
&НаКлиенте
Процедура УстановитьПоНакладной(Команда)
	// устанавливаем значение реквизит количество по накладной
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		ТекСтрока.КоличествоПоНакладной = ТекСтрока.Количество;
	КонецЦикла;
КонецПроцедуры

// Начало Подсистема «Обмен с контрагентами»
// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеСлужебныйКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры //Подключаемый_ВыполнитьКомандуЭДО()

// Обработчик ожидания событий ЭДО.
&НаКлиенте
Процедура Подключаемый_ОбработчикОжиданияЭДО()
	
	ОбменСКонтрагентамиКлиент.ОбработчикОжиданияЭДО(ЭтотОбъект);
	
КонецПроцедуры //Подключаемый_ОбработчикОжиданияЭДО()
// Конец Подсистема «Обмен с контрагентами»


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события нажатия кнопки "Подбор номенклатуры".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомКлиент.ОткрытьПодборНоменклатуры(ЭтотОбъект, Истина);
	
КонецПроцедуры // ПодборНоменклатуры()

// Обработчик события нажатия кнопки "Подбор по списку заказанного".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПодборПоЗаказам(Команда)
	
	Отборы = Новый Соответствие;
	Отборы.Вставить("Контрагент", Объект.Контрагент);
	Отборы.Вставить("Заказ.Организация", Объект.Организация);
	
	УправлениеДиалогомКлиент.ОткрытьПодборПоЗаказам(ЭтотОбъект, "СКД_ЗаказыПоставщикам", Отборы);
	
КонецПроцедуры // ПодборПоЗаказам()

// Обработчик события нажатия кнопки "Расхождение".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПоказатьРасхождение(Команда)
	// регулируем пометку нажатой кнопки и ставим видимость колонки
	Элементы.ТоварыПоказатьРасхождение.Пометка = Не Элементы.ТоварыПоказатьРасхождение.Пометка;
	Элементы.ТоварыКоличествоПоНакладной.Видимость = Элементы.ТоварыПоказатьРасхождение.Пометка;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Склад компании" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкладКомпанииПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.СкладКомпанииПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // СкладКомпанииПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Склад компании".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкладКомпанииПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	СкладКомпанииПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // СкладКомпанииПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Контрагент" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура КонтрагентПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.КонтрагентПриИзменении(Объект, ПараметрыДействия);
	
	// Проверим наличие заметок по выбранному объекту.
	ЗаметкиПользователяПлатформа.ПроверитьЗаметкиПоПредмету(Объект.Контрагент, ПараметрыДействия);
	
	// Пересоздадим подменю "Анкеты"
	АнкетированиеПлатформаСервер.СформироватьМенюАнкетирование(ЭтотОбъект);
	
	// настроим параметры выбора
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // КонтрагентПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Контрагент".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	КонтрагентПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // КонтрагентПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ДоговорВзаиморасчетов" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДоговорВзаиморасчетовПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	УправлениеДиалогомДокументаСервер.ПереустановитьДоступРедактированияЦенИСумм(ЭтотОбъект, Объект);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ДоговорВзаиморасчетовПриИзменении(Объект, ПараметрыДействия);
	
	// Проверим наличие заметок по выбранному объекту.
	ЗаметкиПользователяПлатформа.ПроверитьЗаметкиПоПредмету(Объект.ДоговорВзаиморасчетов, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДоговорВзаиморасчетовПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ДоговорВзаиморасчетов".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДоговорВзаиморасчетовПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДоговорВзаиморасчетовПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДоговорВзаиморасчетовПриИзменении()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыНоменклатураПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	// Вызываем общий обработчик изменения реквизитов формы
	УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(ЭтотОбъект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыНоменклатураПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
		
	// Обработаем событие в контексте сервера
	ТоварыНоменклатураПриИзмененииНаСервере();
	
	// + Конов	
	Если Элементы.Товары.ТекущиеДанные <> НЕОПРЕДЕЛЕНО И ЗапрещеноМенятьКоличество(Элементы.Товары.ТекущиеДанные.Номенклатура) Тогда
		Элементы.Товары.ТекущиеДанные.Количество = 0;
	КонецЕсли;
	// - Конов
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Номенклатура поставщика" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыНоменклатураПоставщикаПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыНоменклатураПоставщикаПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	// Вызываем общий обработчик изменения реквизитов формы
	УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(ЭтотОбъект, ТекущиеДанные, ПараметрыДействия);

КонецПроцедуры // ТоварыНоменклатураПоставщикаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура поставщика".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыНоменклатураПоставщикаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыНоменклатураПоставщикаПриИзмененииНаСервере();

КонецПроцедуры //ТоварыНоменклатураПоставщикаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Характеристика номенклатуры" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыХарактеристикаНоменклатурыПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Характеристика номенклатуры".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЕдиницаИзмеренияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыЕдиницаИзмеренияПриИзменении(Объект, ТекущиеДанные);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Единица измерения".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЕдиницаИзмеренияПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыКоличествоПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыКоличествоПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	// + Конов	
	Если Элементы.Товары.ТекущиеДанные <> НЕОПРЕДЕЛЕНО И ЗапрещеноМенятьКоличество(Элементы.Товары.ТекущиеДанные.Номенклатура) Тогда
		Элементы.Товары.ТекущиеДанные.Количество = 0;
		Сообщить("Зарещены ручные изменения количества для маркируемой позиции");
		Возврат;
	КонецЕсли;
	// - Конов	
	
	// Обработаем событие в контексте сервера
	ТоварыКоличествоПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыКоличествоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество базовое" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыКоличествоБазовоеПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыКоличествоБазовоеПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыКоличествоБазовоеПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество базовое".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыКоличествоБазовоеПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыКоличествоБазовоеПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыКоличествоБазовоеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЦенаПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыЦенаПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЦенаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Цена".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЦенаПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЦенаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыСуммаПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСуммаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма всего" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаВсегоПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыСуммаВсегоПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаВсегоПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма всего".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаВсегоПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаВсегоПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСуммаВсегоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСтавкаНДСПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыСтавкаНДСПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСтавкаНДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Ставка НДС".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСтавкаНДСПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСтавкаНДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма НДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаНДСПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыСуммаНДСПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаНДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма НДС".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаНДСПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаНДСПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСуммаНДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Процент наценки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыПроцентНаценкиПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	//тк + 
	// Получим данные текущей строки табличной части
	Если ТипЗнч(ПараметрыДействия) = Тип("Структура") И ПараметрыДействия.Свойство("ТекущаяСтрока") Тогда
		ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(ПараметрыДействия.ТекущаяСтрока);
	Иначе
		ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	КонецЕсли;
	//тк - 
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыПроцентНаценкиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыПроцентНаценкиПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Процент наценки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПроцентНаценкиПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыПроцентНаценкиПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыПроцентНаценкиПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена (розничная)" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЦенаРозничнаяПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыЦенаРозничнаяПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЦенаРозничнаяПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Цена (розничная)".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЦенаРозничнаяПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЦенаРозничнаяПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЦенаРозничнаяПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма (розничная)" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаРозничнаяПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыСуммаРозничнаяПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаРозничнаяПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма (розничная)".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаРозничнаяПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаРозничнаяПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСуммаРозничнаяПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Алкогольная продукция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыАлкогольнаяПродукцияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	ПараметрыДействия = Новый Структура;
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыАлкогольнаяПродукцияПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ИзмениласьНоменклатура", Ложь) Тогда
		ТоварыНоменклатураПриИзмененииНаСервере(ПараметрыДействия);
	КонецЕсли;

КонецПроцедуры // ТоварыАлкогольнаяПродукцияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Алкогольная продукция".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыАлкогольнаяПродукцияПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыАлкогольнаяПродукцияПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыАлкогольнаяПродукцияПриИзменении()

// Обработчик события возникающего на клиенте  в момент нажатия кнопки выбора или клавиши F4 реквизита "Алкогольная продукция".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыАлкогольнаяПродукцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыАлкогольнаяПродукцияНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры //ТоварыАлкогольнаяПродукцияНачалоВыбора()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры // ТоварыПередНачаломДобавления()

// Обработчик события возникающего на клиенте перед началом интерактивного изменения строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	//Мальцев А.Ю. +++
	Если Элемент.ТекущийЭлемент.Имя	= "ТоварыКоличество" Тогда
		 ТекСтрока 				  = Элементы.Товары.ТекущиеДанные;
		 Если ТекСтрока <> НЕОПРЕДЕЛЕНО И ЗапрещеноМенятьКоличество(ТекСтрока.Номенклатура) Тогда
			 Отказ = Истина;
			 Сообщить("Зарещены ручные изменения количества для маркируемой позиции");
	     КонецЕсли;
	КонецЕсли;
	//Мальцев А.Ю. ---
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередНачаломИзменения()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	УдаляемыеСтроки = Новый Массив;
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередУдалением(ЭтотОбъект, Элемент, Отказ, УдаляемыеСтроки);
	
КонецПроцедуры // ТоварыПередУдалением()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПриОкончанииРедактирования(ЭтотОбъект, Элемент, НоваяСтрока, ОтменаРедактирования);
	
КонецПроцедуры // ТоварыПриОкончанииРедактирования()

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
&НаСервере
Процедура ТоварыПослеУдаленияНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ТоварыПослеУдаления(ЭтотОбъект, Элементы.Товары, ПараметрыДействия);
	
КонецПроцедуры // ТоварыПослеУдаленияНаСервере()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("УдаляемыеСтрокиМарки",УдаляемыеСтроки);
	
	// Обработаем событие в контексте сервера
	ТоварыПослеУдаленияНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ТоварыПослеУдаления()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                        - Строка таблицы, над которой находится курсор.
//  Поле                          - Элемент управляемой формы, с которым связана данная колонка таблицы.
//
&НаКлиенте
Процедура ТоварыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // ТоварыПроверкаПеретаскивания()

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле - Булево - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИнтеграцияЕГАИСКлиент.ТоварыВыбор(Объект, ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры //ТоварыВыбор()

// Обработчик события возникающего на клиенте при при активизации ячейки таблицы.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПриАктивизацииЯчейки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПриАктивизацииЯчейки(ЭтотОбъект, Элемент);
	
	Если Элементы.Товары.ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АктивнаяКолонка = Элементы.Товары.ТекущийЭлемент.Имя;
	Если АктивнаяКолонка = "ТоварыСрокГодности" ИЛИ АктивнаяКолонка = "ТоварыДатаИзготовления" Тогда
		Элементы.ТоварыУстановитьДляВсех.Доступность = Истина;
	Иначе
		Элементы.ТоварыУстановитьДляВсех.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры //ТоварыПриАктивизацииЯчейки()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "МАРКИ"

// Обработчик события возникающего при изменении данных реквизита "КодМарки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура МаркиКодМаркиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Марки.НайтиПоИдентификатору(Элементы.Марки.ТекущаяСтрока);
	
	КодМарки = ТекущиеДанные.КодМарки;
	ТекущиеДанные.КодМарки = "";
	
	ТекущаяСтрока = Неопределено;
	Если НЕ ИнтеграцияЕГАИСВызовСервера.ПроверитьМарку(Объект, КодМарки, ТекущаяСтрока) Тогда
		Элементы.Марки.ТекущаяСтрока = ТекущаяСтрока;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.КодМарки = КодМарки;
	
	// Код АП
	КодАП = ИнтеграцияЕГАИСВызовСервера.ПолучитьКодАПИзАкцизнойМарки(ТекущиеДанные.КодМарки);
	Если КодАП = Неопределено Тогда
		ВывестиСообщение(НСтр("ru = 'Не удалось вычислить код алкогольной продукции для акцизной марки: %1'"),,,,, ТекущиеДанные.КодМарки);						
		Возврат;
	КонецЕсли;
	
	// Шк акцизной марки 
	ИнтеграцияЕГАИС.ДобавитьМаркуПриход(ЭтотОбъект, Объект, ТекущиеДанные.КодМарки, КодАП, ТекущиеДанные);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.МаркиКодМаркиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // МаркиКодМаркиПриИзмененииНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "МАРКИ"

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура МаркиПередУдалением(Элемент, Отказ)                                                    
	
	// Определим структуру параметров обработки текущего события
	УдаляемыеСтроки = Новый Массив;
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.МаркиПередУдалением(ЭтотОбъект, Элемент, Отказ, УдаляемыеСтроки);
	
КонецПроцедуры // МаркиПередУдалением()

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура МаркиПослеУдаленияНаСервере(ПараметрыДействия = Неопределено)
	
	УправлениеДиалогомДокументаСервер.МаркиПослеУдаления(ЭтотОбъект, Элементы.Товары, ПараметрыДействия);
	
КонецПроцедуры // МаркиПослеУдаленияНаСервере()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура МаркиПослеУдаления(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("УдаляемыеСтрокиМарки",УдаляемыеСтроки);
	
	// Обработаем событие в контексте сервера
	МаркиПослеУдаленияНаСервере(ПараметрыДействия);
	
КонецПроцедуры // МаркиПослеУдаления()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура МаркиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.МаркиПриОкончанииРедактирования(ЭтотОбъект, Элемент, НоваяСтрока, ОтменаРедактирования);

КонецПроцедуры // МаркиПриОкончанииРедактирования()

&НаСервере
Процедура ДобавитьМаркуНаСервере(КодМарки)
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("ШтрихКод", КодМарки);
	
	УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, "ДобавитьМарку", ПараметрыДействия, Объект);
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМарку(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(РезультатВопроса) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьМаркуНаСервере(РезультатВопроса)
	
КонецПроцедуры

&НаКлиенте
Процедура МаркиПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура МаркиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ОписаниеОповещенияДобавитьМарку = Новый ОписаниеОповещения("ДобавитьМарку", ЭтотОбъект);
	КодМарки = "";
	ПоказатьВводСтроки(ОписаниеОповещенияДобавитьМарку, КодМарки, НСтр("ru = 'Введите код акцизной марки'"), 200, Ложь);
	
КонецПроцедуры // МаркиПередНачаломДобавления()




////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при нажатии на надпись "Налоговый документ".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьНалоговыйДокументНажатие(Элемент)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.НадписьНалоговыйДокументНажатие(ЭтотОбъект);
	
КонецПроцедуры // НадписьНалоговыйДокументНажатие()

// Обработчик события возникающего на клиенте при нажатии на надпись "Взаиморасчеты".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьВзаиморасчетыНажатие(Элемент)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.НадписьВзаиморасчетыНажатие(ЭтотОбъект);
	
КонецПроцедуры // НадписьВзаиморасчетыНажатие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()

// Обработчик события возникающего на клиенте при нажатии на надпись "Сумма документа".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьСуммаДокументаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.ПоказатьРасширенныеИтогиОперации(ЭтотОбъект, Элемент);
	
КонецПроцедуры // НадписьСуммаДокументаНажатие()

// Начало Подсистема «Обмен с контрагентами»
// Обработчик события возникающего на клиенте при нажатии на надпись "Состояние ЭДО".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСКонтрагентамиКлиент.ОткрытьДеревоЭД(Объект.Ссылка);
	
КонецПроцедуры //ДекорацияЭДОНажатие()
// Конец Подсистема «Обмен с контрагентами»


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоРозничныйСклад = (ЗначениеЗаполнено(Объект.СкладКомпании) И Объект.СкладКомпании.Розничный);
	Если ЭтоРозничныйСклад И ЕстьРеквизит(Объект,"РекомендуемыйПроцентНаценки","Товары") Тогда
	//	// Получим данные текущей строки табличной части
	//ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
		ПараметрыДействия = Новый Структура;
		ткОбработкаТабличнойЧастиТовары.ЗаполнитьРеквизитРекомендуемыйПроцентНаценки(Объект, Объект.СкладКомпании.ТипЦенРозничнойТорговли, Неопределено, "РекомендуемыйПроцентНаценки", "Товары", ПараметрыДействия);
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	//Мальцев А.Ю. +++
	ИзменениеДокументовЗавершенныеСтатусыЭДО   = ПравоПользователя("итРазрешитьИзмененияСЗавершеннымСтатусомЭДО");
	Если Не ИзменениеДокументовЗавершенныеСтатусыЭДО 
			И Документы.ПоступлениеТоваров.ДокументВЗавершенномСтатусеЭДО(Объект.Ссылка) Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	ПравоИзмененияДоверительнойПриемки = ПравоПользователя("итИзменениеДоверительнойПриемкиРазрешено");
	Если Объект.Контрагент.итДоверительнаяПриемка Тогда 
	//	
		Если ПравоИзмененияДоверительнойПриемки = Ложь Тогда
			ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;
		Элементы.НадписьОбработкаРасхождений.Видимость = Истина;
		ТекущееСостояние = ИТ_СпециальныйМодульСервер.ПолучитьТекущееСостояниеПоступления(Объект.Ссылка);
		Если ТекущееСостояние = Перечисления.итСостоянияВыполненияПоступленийТоваров.ЕстьРасхождения Тогда
			Элементы.НадписьОбработкаРасхождений.Видимость = Истина;
	//	ИначеЕсли ТекущееСостояние = Перечисления.итСостоянияВыполненияПоступленийТоваров.Принят Тогда
	//		ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;
			
		Попытка
			итЗаявкаНаРасхождение  = Документы.итЗаявкаНаРасхождение.ПроверитьНаличиеЗаявкиНаРасхождение(Объект.Ссылка, НЕОПРЕДЕЛЕНО);
			Если ЗначениеЗаполнено(итЗаявкаНаРасхождение) Тогда
				Элементы.НадписьОбработкаРасхождений.Заголовок = "Статус заявки на расхождение: " + Строка(итЗаявкаНаРасхождение.Статус);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;

	ИнициализироватьРасхожденияДС();

	//Мальцев А.Ю. ---
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;	
	
	ОбновитьСтатусОбработки();
	ЗагрузитьСтатусПроверкиМарок();
	
	ЗакрытиеЗаказов = Объект.ЗакрытиеЗаказовПоставщикам;
	
	Если Объект.ПолученИзЕГАИС И Параметры.Свойство("ТаблицаСопоставления") Тогда
		ТаблицаЗаказов = Параметры.ТаблицаСопоставления.Выгрузить(,"ЗаказПоставщику");
		ТаблицаЗаказов.Свернуть("ЗаказПоставщику");
		Для Каждого ТекущаяСтрока Из ТаблицаЗаказов Цикл
			НоваяСтрока = Объект.РаспределениеПоставки.Добавить();
			НоваяСтрока.ЗаказПоставщику = ТекущаяСтрока.ЗаказПоставщику;
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из Параметры.ТаблицаСопоставления Цикл
			Если ПустаяСтрока(ТекущаяСтрока.ИдентификаторСтроки) Тогда
				Продолжить;
			КонецЕсли;
			НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтроки));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				//НайденнаяСтрока.Количество   = ТекущаяСтрока.Количество;
				Документы.ПоступлениеТоваров.ТоварыНоменклатураПриИзменении(Объект, НайденнаяСтрока);
				НайденнаяСтрока.АлкогольнаяПродукция = ТекущаяСтрока.АлкогольнаяПродукция;
				НайденнаяСтрока.Количество   = 0;
				Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(Объект, НайденнаяСтрока);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();	
	
	//Мальцев А.Ю. +++ При ручном создании заказа "Не закрывать"	
	Объект.ЗакрытиеЗаказовПоставщикам = 2;	
	//Мальцев А.Ю. ---
	
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	
	//Мальцев А.Ю. +++			
	Элементы.АкцептованБухгалтером.Доступность   = ИТ_СпециальныйМодульСервер.ПроверитьПравоНаСервере("итРазрешитьУстановкуАкцептованБухгалтеромВСчетФактуре");
	//Мальцев А.Ю. ---
	
	//// В том случае, если хотя бы в одной строке есть разница по накладной, отразим колонку.
	//ЕстьРазница = Ложь;
	//Для Каждого ТекСтрока Из Объект.Товары Цикл
	//	Если ТекСтрока.КоличествоПоНакладной <> ТекСтрока.Количество 
	//		Или ТекСтрока.Количество * ТекСтрока.Коэффициент <> ТекСтрока.КоличествоБазовое Тогда
	//			ЕстьРазница = Истина;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//// регулируем пометку и видимость
	//Элементы.ТоварыПоказатьРасхождение.Пометка = ЕстьРазница;
	//Элементы.ТоварыКоличествоПоНакладной.Видимость = ЕстьРазница;
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия=Неопределено)
	
	ЗагрузитьСтатусПроверкиМарок();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	Если ИмяСобытия = "ИзменениеСостоянияЕГАИС"
		И Параметр.Ссылка = Объект.ТоварноТранспортнаяНакладнаяЕГАИС Тогда
		
		Если Параметр.Свойство("ОбъектИзменен")
			И Параметр.ОбъектИзменен Тогда
			ОбновитьПредставленияНаФорме(Истина);
		Иначе
			ОбновитьПредставленияНаФорме(Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	//Мальцев А.Ю.+++
	Если ИмяСобытия = "ЗаписьЗаявкиНаРасходДС" Тогда
		ИнициализироватьРасхожденияДС();		
	КонецЕсли;	
	//Мальцев А.Ю.---
		
	Если ИмяСобытия = "ВыполненОбменЕГАИС"
		И (Параметр = Неопределено
		Или (ТипЗнч(Параметр) = Тип("Структура") И Параметр.ОбновлятьСтатусЕГАИСВФормахДокументов)) Тогда
		
		ОбновитьПредставленияНаФорме(Истина);
		
	КонецЕсли;
	
	Если ИмяСобытия = "ЗагруженыМаркиМП" Тогда
		ОбновитьПредставленияСтатусаПослеЗагрузкиМарокМП();
		Возврат;
	КонецЕсли;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСтатусОбработки();
	
	// ТК + 
	ЗакрытиеЗаказов = Объект.ЗакрытиеЗаказовПоставщикам;
	// ТК - 
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	ЗагрузитьСтатусПроверкиМарок();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	//Мальцев А.Ю. +++
	Если  ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ЗапуститьКонтрольПревышенияРозничнойЦены(Отказ);
	КонецЕсли;
	//Мальцев А.Ю. ---
	
	Если НЕ Объект.ПолученИзЕГАИС Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьСопоставление = Ложь;
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		
		Если ПустаяСтрока(ТекущаяСтрока.ИдентификаторСтроки) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			ВыполнитьСопоставление = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВыполнитьСопоставление Тогда
		ВывестиСообщение(НСтр("ru = 'Обнаружена не сопоставленная продукция!'"), Объект,,,Отказ);
		ОткрытьСопоставлениеЕГАИС(Неопределено);
	КонецЕсли;
		
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	//Мальцев А.Ю.+++
	Попытка
		
		Если ТекущийОбъект.Проведен = Ложь Тогда
			
			мз = РегистрыСведений.итСостоянияВыполненияПоступленийТоваров.СоздатьМенеджерЗаписи();
			мз.Поступление = ТекущийОбъект.Ссылка;
			мз.Прочитать();
			Если Не мз.Выбран() Тогда
				мз.Поступление = ТекущийОбъект.Ссылка;
				мз.Состояние   = Перечисления.итСостоянияВыполненияПоступленийТоваров.КПриемке;
				мз.ДатаСостояния = ТекущаяДата();
				мз.Сотрудник 	 = ПараметрыСеанса.ТекущийПользователь;
				мз.Записать();
			КонецЕсли;

		КонецЕсли;	
	Исключение
	КонецПопытки;
	//Мальцев А.Ю.---

	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	ОбновитьСтатусОбработки();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МассивВидов = Новый Массив;
	МассивВидов.Добавить("СчетФактураПолученный");
	МассивВидов.Добавить("СчетФактураВыданный");
	МассивВидов.Добавить("СчетОтПоставщика");
	
	ПараметрыЗаписи.Вставить("МассивВидов", МассивВидов);
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура УстановитьРекомендуемуюНаценкуНаВесьТовар(Команда)
	
	// установим рекомендуемую наценку на всю таблицу
	//ТипЦенЦенообразования=СкладКомпании.ТипЦенРозничнойТорговли;
	Для Каждого СтрокаТовар Из Объект.Товары Цикл
		Если СтрокаТовар.ПроцентНаценки = СтрокаТовар.РекомендуемыйПроцентНаценки Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТовар.ПроцентНаценки = СтрокаТовар.РекомендуемыйПроцентНаценки;
		ПараметрыДействия = Новый Структура;
		ПараметрыДействия.Вставить("ТекущаяСтрока", СтрокаТовар.ПолучитьИдентификатор());
		ТоварыПроцентНаценкиПриИзмененииНаСервере(ПараметрыДействия);
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении данных реквизита "ЗакрытиеЗаказовПоставщикам" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ЗакрытиеЗаказовПоставщикамПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	ТаблицаЗаказов = Объект.РаспределениеПоставки.Выгрузить(,"ЗаказПоставщику");
	ТаблицаЗаказов.Свернуть("ЗаказПоставщику");
	
	Объект.РаспределениеПоставки.Очистить();
	Объект.РаспределениеПоставки.Загрузить(ТаблицаЗаказов);
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") И ЗначениеЗаполнено(Объект.ДокументОснование) И Объект.РаспределениеПоставки.НайтиСтроки(Новый Структура("ЗаказПоставщику", Объект.ДокументОснование)).Количество() = 0 Тогда
		НоваяСтрока = Объект.РаспределениеПоставки.Добавить();
		НоваяСтрока.ЗаказПоставщику = Объект.ДокументОснование;
	КонецЕсли;
	
	ЗакрытиеЗаказов = Объект.ЗакрытиеЗаказовПоставщикам;
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ЗакрытиеЗаказовПоставщикамПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ЗакрытиеЗаказовПоставщикам".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ЗакрытиеЗаказовПоставщикамПриИзменении(Элемент)
	
	Если Объект.ЗакрытиеЗаказовПоставщикам = ЗакрытиеЗаказов Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ЗакрытиеЗаказовПоставщикам = 0 Тогда
		Если Объект.РаспределениеПоставки.Количество() = 0 Тогда
			ЗакрытиеЗаказов = Объект.ЗакрытиеЗаказовПоставщикам;
			УправлениеДиалогомНаСервере();
			Возврат;
		КонецЕсли;
		
		ОбработкаОповещения = Новый ОписаниеОповещения("ЗакрытиеЗаказовПоставщикамЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОбработкаОповещения, НСтр("ru = 'Таблица распределений поставки будет очищена.
		|Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗакрытиеЗаказовПоставщикамПриИзмененииНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры // ЗакрытиеЗаказовПоставщикамПриИзменении()

// Обработчик результата ответа на вопрос при изменении реквизита "ЗакрытиеЗаказовПоставщикам"
//
&НаКлиенте
Процедура ЗакрытиеЗаказовПоставщикамЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.РаспределениеПоставки.Очистить();
		ЗакрытиеЗаказов = Объект.ЗакрытиеЗаказовПоставщикам;
	Иначе
		Объект.ЗакрытиеЗаказовПоставщикам = ЗакрытиеЗаказов;
	КонецЕсли;
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаУчетаКратности()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "РАСПРЕДЕЛЕНИЕ ПОСТАВКИ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура РаспределениеПоставкиНоменклатураПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.РаспределениеПоставки.НайтиПоИдентификатору(Элементы.РаспределениеПоставки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.РаспределениеПоставкиНоменклатураПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	// Вызываем общий обработчик изменения реквизитов формы
	УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(ЭтотОбъект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // РаспределениеПоставкиНоменклатураПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура РаспределениеПоставкиНоменклатураПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	РаспределениеПоставкиНоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры // РаспределениеПоставкиНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура РаспределениеПоставкиЕдиницаИзмеренияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.РаспределениеПоставки.НайтиПоИдентификатору(Элементы.РаспределениеПоставки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.РаспределениеПоставкиЕдиницаИзмеренияПриИзменении(Объект, ТекущиеДанные);
	
КонецПроцедуры // РаспределениеПоставкиЕдиницаИзмеренияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Единица измерения".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура РаспределениеПоставкиЕдиницаИзмеренияПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	РаспределениеПоставкиЕдиницаИзмеренияПриИзмененииНаСервере();
	
КонецПроцедуры // РаспределениеПоставкиЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего на клиенте при начале выбора данных реквизита "ЗаказПоставщику".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура РаспределениеПоставкиЗаказПоставщикуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Момент = ?(Объект.Ссылка.Пустая(), КонецДня(ТекущаяДата()), Объект.Ссылка);
	
	ПараметрыФормы = Новый Структура("Контрагент, Момент", Объект.Контрагент, Момент);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаВыбора", ПараметрыФормы, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // РаспределениеПоставкиЗаказПоставщикуНачалоВыбора()

// заполняет таблицу распределения
//
&НаСервере
Процедура ЗаполнитьТаблицуРаспределенияПоставки(ЗаказПоставщику = Неопределено)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	//Запрос.УстановитьПараметр("Подразделение",?(ЗначениеЗаполнено(СкладКомпании),СкладКомпании.Подразделение,ПодразделениеКомпании));
	Запрос.УстановитьПараметр("Контрагент",      Объект.Контрагент);
	Если Не Объект.Ссылка.Пустая() Тогда
		Запрос.УстановитьПараметр("Момент",      Объект.Ссылка.МоментВремени());
	КонецЕсли;
	
	ЗакрытиеЗаказовПоОрганизации   = ПолучитьЗначениеУчетнойПолитики("ЗакрытиеЗаказовПоОрганизации",, Объект.Дата);
	ЗакрытиеЗаказовПоПодразделению = ПолучитьЗначениеУчетнойПолитики("ЗакрытиеЗаказовПоПодразделению", Объект.ПодразделениеКомпании, Объект.Дата);
	
	ТекстОтбора = "";
	Если ЗакрытиеЗаказовПоОрганизации Тогда
		ТекстОтбора = "ГДЕ
		|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Организация = &Организация";
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
	КонецЕсли;
	
	Если ЗакрытиеЗаказовПоПодразделению Тогда
		ТекстОтбора = ТекстОтбора + ?(ТекстОтбора = "", "ГДЕ","И") + "
		|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.ПодразделениеКомпании В ИЕРАРХИИ(&ПодразделениеКомпании)";
		Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	КонецЕсли;
	
	Если Объект.ЗакрытиеЗаказовПоставщикам > 0 Тогда
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
		|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Номер КАК ЗаказПоставщикуНомер,
		|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата КАК ЗаказПоставщикуДата,
		|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток КАК ЗаказаноОстаток
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
		|			" + ?(Объект.Ссылка.Пустая(), "", "&Момент") + ",
		|	Контрагент = &Контрагент И 
		|	Номенклатура В (&Номенклатура)" + ?(ЗначениеЗаполнено(ЗаказПоставщику), " И 
		|	ЗаказПоставщику = &ЗаказПоставщику", "") + ") КАК ЗаказыПоставщикамОстатки
		|" + ТекстОтбора +"
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказПоставщикуДата,
		|	ЗаказПоставщикуНомер";
		
		ТаблицаТовары = Объект.Товары.Выгрузить(,"Номенклатура");
		ТаблицаТовары.Свернуть("Номенклатура");
		Запрос.УстановитьПараметр("Номенклатура",    ТаблицаТовары.ВыгрузитьКолонку("Номенклатура"));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если Объект.РаспределениеПоставки.НайтиСтроки(Новый Структура("ЗаказПоставщику", Выборка.ЗаказПоставщику)).Количество() = 0 Тогда
				НоваяСтрока = Объект.РаспределениеПоставки.Добавить();
				НоваяСтрока.ЗаказПоставщику = Выборка.ЗаказПоставщику;
			КонецЕсли;
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	ТаблицаТовары = Объект.Товары.Выгрузить(,"Номенклатура, НомерСтроки, ЕдиницаИзмерения, Коэффициент, Количество");
	Запрос.УстановитьПараметр("ТаблицаТовары", ТаблицаТовары);
	
	Если ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		ТекстОтбора = "(Контрагент, ЗаказПоставщику, Номенклатура) В (ВЫБРАТЬ Контрагент, ЗаказПоставщику, Номенклатура ИЗ ТаблицаТовары)";
	Иначе
		ТекстОтбора = "(Контрагент, Номенклатура) В (ВЫБРАТЬ Контрагент, Номенклатура ИЗ ТаблицаТовары)";
	КонецЕсли;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТаблицаТовары.НомерСтроки,
	|	ТаблицаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаТовары.Коэффициент КАК Коэффициент,
	|	ТаблицаТовары.Количество
	|ПОМЕСТИТЬ
	|	ВременнаяТаблицаТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ТаблицаТовары.Количество*ТаблицаТовары.Коэффициент) КАК Количество,
	|	МИНИМУМ(ТаблицаТовары.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ
	|	ТаблицаТоварыСрез
	|ИЗ
	|	ВременнаяТаблицаТовары КАК ТаблицаТовары
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Номенклатура
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаТовары.Количество)>0
	|;
	|
	|ВЫБРАТЬ
	|	&Контрагент КАК Контрагент," + ?(ЗначениеЗаполнено(ЗаказПоставщику), "
	|	&ЗаказПоставщику КАК ЗаказПоставщику,", "") + "
	|	ТаблицаТоварыСрез.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаТовары.Коэффициент КАК Коэффициент,
	|	ТаблицаТоварыСрез.Количество
	|ПОМЕСТИТЬ
	|	ТаблицаТовары
	|ИЗ
	|	ТаблицаТоварыСрез КАК ТаблицаТоварыСрез
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ВременнаяТаблицаТовары КАК ТаблицаТовары
	|ПО
	|	ТаблицаТоварыСрез.Номенклатура = ТаблицаТовары.Номенклатура И 
	|	ТаблицаТоварыСрез.НомерСтроки = ТаблицаТовары.НомерСтроки
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ТаблицаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаТовары.Коэффициент КАК Коэффициент,
	|	ТаблицаТовары.Количество,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Номер КАК ЗаказПоставщикуНомер,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата КАК ЗаказПоставщикуДата,
	|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток КАК ЗаказаноОстаток
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|			" + ?(Объект.Ссылка.Пустая(), "", "&Момент") + ",
	|			
	|	" + ТекстОтбора + ") КАК ЗаказыПоставщикамОстатки
	|ПО
	|	ТаблицаТовары.Номенклатура = ЗаказыПоставщикамОстатки.Номенклатура
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураНаименование,
	|	ЗаказПоставщикуДата,
	|	ЗаказПоставщикуНомер
	|ИТОГИ
	|	МАКСИМУМ(Количество)
	|ПО
	|	Номенклатура
	|";
	
	ВыборкаНоменклатура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		ТоварыКоличество = ВыборкаНоменклатура.Количество;
		
		Выборка = ВыборкаНоменклатура.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ТоварыКоличество = 0 Тогда
				Прервать;
			КонецЕсли;
			
			МожноРаспределить = Мин(ТоварыКоличество, Выборка.ЗаказаноОстаток);
			
			НоваяСтрока = Объект.РаспределениеПоставки.Добавить();
			НоваяСтрока.Номенклатура     = Выборка.Номенклатура;
			НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
			НоваяСтрока.Коэффициент      = Выборка.Коэффициент;
			Если Выборка.Коэффициент = 0 Тогда
				НоваяСтрока.Количество   = МожноРаспределить;
			Иначе
				НоваяСтрока.Количество   = МожноРаспределить/Выборка.Коэффициент;
			КонецЕсли;
			НоваяСтрока.ЗаказПоставщику  = Выборка.ЗаказПоставщику;
			
			ТоварыКоличество = ТоварыКоличество - МожноРаспределить;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьТаблицуРаспределенияПоставки(

// Обработчик результата ответа на вопрос при заполнении табличной части "РаспределениеПоставки"
//
&НаКлиенте
Процедура ЗаполнитьРаспределениеПоставкиОбработкаОтвета(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена ИЛИ Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.РаспределениеПоставки.Очистить();
	КонецЕсли;
	
	ЗаполнитьРаспределениеПоставкиЗавершение(ДополнительныеПараметры.ИмяКоманды);
	
КонецПроцедуры

// Обработчик результата ответа на вопрос при заполнении табличной части "РаспределениеПоставки"
//
&НаКлиенте
Процедура ЗаполнитьРаспределениеПоставкиВыборЗаказа(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуРаспределенияПоставки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРаспределениеПоставкиЗавершение(ИмяКоманды)
	
	Если ИмяКоманды = "РаспределениеПоставкиЗаполнитьПоЗаказу" Тогда
		Момент = ?(Объект.Ссылка.Пустая(), КонецДня(ТекущаяДата()), Объект.Ссылка);
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды);
		ОбработкаОповещения = Новый ОписаниеОповещения("ЗаполнитьРаспределениеПоставкиВыборЗаказа", ЭтотОбъект, ДополнительныеПараметры);
		ПараметрыФормы = Новый Структура("Контрагент, Момент", Объект.Контрагент, Момент);
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ОткрытьФорму("Документ.ЗаказПоставщику.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,, ОбработкаОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуРаспределенияПоставки();
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПоставкиЗаполнитьПоЗаказу(Команда)
	
	Если Объект.РаспределениеПоставки.Количество() > 0 Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяКоманды", Команда.Имя);
		ОбработкаОповещения = Новый ОписаниеОповещения("ЗаполнитьРаспределениеПоставкиОбработкаОтвета", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОбработкаОповещения, НСтр("ru = 'Очистить таблицу распределения перед заполнением?'"), РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРаспределениеПоставкиЗавершение(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПоставкиЗаполнитьПоВсемЗаказам(Команда)
	
	Если Объект.РаспределениеПоставки.Количество() > 0 Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяКоманды", Команда.Имя);
		ОбработкаОповещения = Новый ОписаниеОповещения("ЗаполнитьРаспределениеПоставкиОбработкаОтвета", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОбработкаОповещения, НСтр("ru = 'Очистить таблицу распределения перед заполнением?'"), РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРаспределениеПоставкиЗавершение(Команда.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьДокументПоТТНЗавершение()
	
	ИнтеграцияЕГАИС.ЗаполнитьДокументПоВходящейТТН(Объект, Объект.ТоварноТранспортнаяНакладнаяЕГАИС);
	ЗащищенныеФункцииСервер.ЗаполнитьРеквизитАлкогольнойПродукции(Объект, Объект.Товары, Объект.Марки);
	ОбновитьСтатусОбработки();
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

// Обработчик результата ответа на вопрос при заполнении табличной части "РаспределениеПоставки"
//
&НаКлиенте
Процедура ПерезаполнитьДокументПоТТНОбработкаОтвета(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена ИЛИ Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Марки.Очистить();
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Товары.Очистить();
	Иначе
		ИндексСтроки = Объект.Товары.Количество()-1;
		Пока ИндексСтроки>=0 Цикл
			ТекущаяСтрока = Объект.Товары[ИндексСтроки];
			Если ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторСтроки) Тогда
				Объект.Товары.Удалить(ТекущаяСтрока);
			КонецЕсли;
			ИндексСтроки = ИндексСтроки - 1;
		КонецЦикла;
	КонецЕсли;
	
	ПерезаполнитьДокументПоТТНЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьДокументПоТТН()
	
	Если НЕ ЗначениеЗаполнено(Объект.ТоварноТранспортнаяНакладнаяЕГАИС) Тогда
		Объект.ПолученИзЕГАИС = Ложь;
		ВывестиСообщение(НСтр("ru='Не задана ТТН.'"));
		УправлениеДиалогомНаСервере();
		Возврат;
	КонецЕсли;
	
	Если Объект.Товары.Количество() > 0 Тогда
		
		ОбработкаОповещения = Новый ОписаниеОповещения("ПерезаполнитьДокументПоТТНОбработкаОтвета", ЭтотОбъект);
		
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить(КодВозвратаДиалога.Да, "Все строки");
		СписокКнопок.Добавить(КодВозвратаДиалога.Нет, "Только строки из ТТН");
		СписокКнопок.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
		
		ПоказатьВопрос(ОбработкаОповещения, НСтр("ru = 'Перед перезаполнением удалять строки табличной части?'"), СписокКнопок, 20, КодВозвратаДиалога.Нет, НСтр("ru = 'Очистка таблицы'"), КодВозвратаДиалога.Отмена);
		Возврат;
	КонецЕсли;
	
	ПерезаполнитьДокументПоТТНЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерезаполнитьДокументПоТТН(Команда)
	
	ПерезаполнитьДокументПоТТН();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварноТранспортнаяНакладнаяЕГАИСПриИзменении(Элемент)
	
	ПерезаполнитьДокументПоТТН();
	
КонецПроцедуры

&НаСервере
Процедура ТоварыКоличествоДокПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыКоличествоДокПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоДокПриИзменении(Элемент)
	ТоварыКоличествоДокПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТоварыЦенаДокПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыЦенаДокПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаДокПриИзменении(Элемент)
	
	ТоварыЦенаДокПриИзмененииНаСервере()
	
КонецПроцедуры

&НаСервере
Процедура ТоварыСуммаДокПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ТоварыСуммаДокПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаДокПриИзменении(Элемент)
	
	ТоварыСуммаДокПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДляВсех(Команда)
	
	ТекущаяКолонка = Элементы.Товары.ТекущийЭлемент.Имя;
	ТекущаяКолонка = СтрЗаменить(ТекущаяКолонка, "Товары", "");
	ЗначениеАктивнойЯчейки = Элементы.Товары.ТекущиеДанные[ТекущаяКолонка];

	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ[ТекущаяКолонка] = ЗначениеАктивнойЯчейки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеСопоставленияЕГАИСНаСервере(ИзмененныеСтроки, ИзмененныеСтрокиПоКоличеству)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.ИдентификаторСтроки,
	|	ТаблицаТоваров.ИдентификаторУпаковки,
	|	ТаблицаТоваров.Количество,
	|	ТаблицаТоваров.Цена,
	|	ТаблицаТоваров.Сумма
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Товары КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ТоварноТранспортнаяНакладнаяЕГАИС);
	ТоварыТТН = Запрос.Выполнить().Выгрузить();
	
	ТаблицаУдаления = Новый Массив;
	
	ПараметрыДействия = Документы.ПоступлениеТоваров.ПолучитьПараметрыДействия(Объект);
	
	Для Каждого ИндексСтроки Из ИзмененныеСтроки Цикл
		ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ИндексСтроки);
		
		НайденнаяСтрока = ТоварыТТН.Найти(ТекущаяСтрока.ИдентификаторСтроки, "ИдентификаторСтроки");
		Если НайденнаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяСтрока.ИдентификаторУпаковки = НайденнаяСтрока.ИдентификаторУпаковки;
		ТекущаяСтрока.КоличествоДок         = НайденнаяСтрока.Количество;
		ТекущаяСтрока.ЦенаДок               = НайденнаяСтрока.Цена;
		ТекущаяСтрока.СуммаДок              = НайденнаяСтрока.Сумма;
		
		ТоварыДляУдаления = Объект.Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки, Номенклатура", ТекущаяСтрока.ИдентификаторСтроки, Справочники.Номенклатура.ПустаяСсылка()));
		Для Каждого СтрокаУдаления Из ТоварыДляУдаления Цикл
			ТаблицаУдаления.Добавить(СтрокаУдаления);
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ИндексСтроки Из ИзмененныеСтрокиПоКоличеству Цикл
		ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ИндексСтроки);
		Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(Объект, ТекущаяСтрока, ПараметрыДействия);
	КонецЦикла;
	
	Для Каждого СтрокаУдаления Из ТаблицаУдаления Цикл
		Объект.Товары.Удалить(СтрокаУдаления);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеСопоставленияЕГАИС(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененныеСтроки             = Новый Массив;
	ИзмененныеСтрокиПоКоличеству = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из Результат Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока.СтрокаРодителя) Тогда
			ТоварнаяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(ТоварнаяСтрока, Объект.Товары[ТекущаяСтрока.СтрокаРодителя-1]);
		Иначе
			ТоварнаяСтрока = Объект.Товары[ТекущаяСтрока.НомерСтроки-1];
		КонецЕсли;
		
		Если НЕ ТоварнаяСтрока.Количество = ТекущаяСтрока.Количество Тогда
			ИзмененныеСтрокиПоКоличеству.Добавить(ТоварнаяСтрока.ПолучитьИдентификатор());
			ТоварнаяСтрока.Количество        = ТекущаяСтрока.Количество;
		КонецЕсли;
		
		Если НЕ ТоварнаяСтрока.ИдентификаторСтроки   = ТекущаяСтрока.ИдентификаторСтроки Тогда
			ИзмененныеСтроки.Добавить(ТоварнаяСтрока.ПолучитьИдентификатор());
			ТоварнаяСтрока.АлкогольнаяПродукция  = ТекущаяСтрока.АлкогольнаяПродукция;
			ТоварнаяСтрока.ИдентификаторСтроки   = ТекущаяСтрока.ИдентификаторСтроки;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗавершениеСопоставленияЕГАИСНаСервере(ИзмененныеСтроки, ИзмененныеСтрокиПоКоличеству);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСопоставлениеЕГАИС(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДокументОбъект", Объект);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеСопоставленияЕГАИС", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.МодульОбменаЕГАИС.Форма.ФормаПоступления", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискВТаблицеТовары(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПоискВТаблицеТоварыРезультатОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ПоискВТаблицеТоварыРезультатОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ШтрихКодДляПоиска = РезультатОповещения;
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ПоискПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКоду(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ДобавлениеНовыхПозицийПоШтрихКодуОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКодуОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ДобавлениеНовыхПозицийПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтборВТаблицеТовары(Команда)
	Элементы.Товары.ОтборСтрок = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура МаркиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "МаркиСтатусПроверки" Тогда
		СтандартнаяОбработка = Ложь;
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПроверкиМаркированнойПродукции.ВНаличии"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПроверкиМаркированнойПродукции.НеПроверялась"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПроверкиМаркированнойПродукции.Отсутствует"));
		ПоказатьВыборИзСписка(, СписокВыбора, Поле);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьКонтрольПревышенияРозничнойЦены(Отказ)
	
	Об = РеквизитФормыВЗначение("Объект");
	ИТ_СпециальныйМодульСервер.ВыполнитьКонтрольПревышенияРозничныхЦен(Об.Товары, Отказ);
	
КонецПроцедуры //ПередЗаписью()


//Мальцев А.Ю. +++
&НаСервере
Функция ЗапрещеноМенятьКоличество(Номенклатура)
	
	Результат = Ложь;
	
	ПравоИзмененияКоличества = ПравоПользователя("итПриемкаБезТСДРазрешена");
	Если Объект.ПодразделениеКомпании.итЗапретПриемкиБезТСД И Не ПравоИзмененияКоличества И  Номенклатура.ОсобенностьУчета.Маркируется Тогда
		Результат = Истина;
	КонецЕсли;

	Возврат  Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРасхождения(Команда)
	
	параметрыОткрытия = Новый Структура;
	параметрыОткрытия.Вставить("ДанныеПриемкиТСД", 		ПолучитьДанныеПриемкиТСД());
	параметрыОткрытия.Вставить("Приемка", 		   		Объект.Ссылка);
	параметрыОткрытия.Вставить("итЗаявкаНаРасхождение", итЗаявкаНаРасхождение);
	
	ОткрытьФорму("Документ.ПоступлениеТоваров.Форма.ФормаОбработкиРасхождений", параметрыОткрытия, Элементы.Товары);
	// Вставить содержимое обработчика.
	
КонецПроцедуры

&НаСервере
Функция  ПолучитьДанныеПриемкиТСД();
	
	Об = РеквизитФормыВЗначение("Объект");
	
	массивПриемки = Новый Массив;	
	
	Для Каждого строкаТовары Из Об.Товары Цикл
		
		строкаМассива = Новый Структура;
		строкаМассива.Вставить("Номенклатура",строкаТовары.Номенклатура);
		строкаМассива.Вставить("Количество",  строкаТовары.Количество);
				
		строкаПриемки = Об.ДанныеПриемкиНаТСД.Найти(строкаТовары.Номенклатура, "Номенклатура");
		Если строкаПриемки <> НЕОПРЕДЕЛЕНО Тогда
			строкаМассива.Вставить("КоличествоПриемки",    строкаПриемки.Количество);
		Иначе
			строкаМассива.Вставить("КоличествоПриемки",    0);
		КонецЕсли;
		строкаМассива.Вставить("ПозицияНакладной",  Истина);
		
		массивПриемки.Добавить(строкаМассива);
		
	КонецЦикла;
	
	Для Каждого стрПриемки Из Об.ДанныеПриемкиНаТСД Цикл
		
		строкаТовары = Об.Товары.Найти(стрПриемки.Номенклатура, "Номенклатура");
		Если строкаТовары = НЕОПРЕДЕЛЕНО Тогда
			строкаМассива = Новый Структура;
			строкаМассива.Вставить("Номенклатура",		стрПриемки.Номенклатура);
			строкаМассива.Вставить("Количество", 		0);
			строкаМассива.Вставить("КоличествоПриемки", стрПриемки.Количество);
			строкаМассива.Вставить("ПозицияНакладной",  Ложь);
			массивПриемки.Добавить(строкаМассива);

		КонецЕсли;
		
	КонецЦикла;
	
	Возврат массивПриемки;
	
КонецФункции

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("Результат") Тогда
		
		ЗагрузитьДанныеПриемки(ВыбранноеЗначение.Результат);
		
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
		Записать(ПараметрыЗаписи);
		
		//Если ВыбранноеЗначение.ПроверятьСтатус Тогда
		//
		//	ТекущееСостояние = ИТ_СпециальныйМодульСервер.ПолучитьТекущееСостояниеПоступления(Объект.Ссылка);
		//	Если ТекущееСостояние = ПредопределенноеЗначение("Перечисление.итСостоянияВыполненияПоступленийТоваров.Принят") Тогда
		//		Элементы.НадписьОбработкаРасхождений.Видимость = Ложь;
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
		Если ВыбранноеЗначение.Свойство("ЗаявкаНаРасхождение") Тогда
			итЗаявкаНаРасхождение  = ВыбранноеЗначение.ЗаявкаНаРасхождение;
			Если ЗначениеЗаполнено(итЗаявкаНаРасхождение) Тогда
				Элементы.НадписьОбработкаРасхождений.Заголовок = "Статус заявки на расхождение: " + Строка(ПолучитьСтатусЗаявкиРасхождение(итЗаявкаНаРасхождение));
			Иначе
				Элементы.НадписьОбработкаРасхождений.Заголовок = "Обработать расхождения";
				
			КонецЕсли;
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатусЗаявкиРасхождение(ЗаявкаНаРасхождение)
	Возврат ЗаявкаНаРасхождение.Статус;		
КонецФункции

&НаСервере
Процедура ЗагрузитьДанныеПриемки(ДанныеПриемки)
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.ДанныеПриемкиНаТСД.Очистить();
	
	Для Каждого стр Из ДанныеПриемки Цикл
		
		НовСтр = Об.ДанныеПриемкиНаТСД.Добавить();
		НовСтр.Номенклатура = стр.Номенклатура;
		НовСтр.Количество   = стр.КоличествоПриемки;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Об, "Объект");
	
	
КонецПроцедуры	

&НаКлиенте
Процедура НадписьОбработкаРасхожденийНажатие(Элемент)
	//Если ЗначениеЗаполнено(итЗаявкаНаРасхождение) Тогда
	//	ОткрытьЗначение(итЗаявкаНаРасхождение);
	//Иначе
		ОбработатьРасхождения(НЕОПРЕДЕЛЕНО);
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВыполнитьПроверкиДляСозданияЗаявкиНаРасходованиеДС()
	
	Если Не Объект.Проведен Тогда
		Сообщить("Документ не проведен.");
		Возврат Ложь;
	Конецесли;
	
	ТекущееСостояние = ИТ_СпециальныйМодульСервер.ПолучитьТекущееСостояниеПоступления(Объект.Ссылка);
	Если ТекущееСостояние <> Перечисления.итСостоянияВыполненияПоступленийТоваров.Проверен Тогда
		Сообщить("Создание заявки на расходование ДС возможно только в статусе Проверен.");
		Возврат Ложь;
	Конецесли;
	
	СФ_Аксептован = ПроверитьАкцептованСФ(Объект.Ссылка);
	Если Не СФ_Аксептован Тогда
		Сообщить("Создание заявки на расходование ДС возможно только, если Счет Фактура акцептован.");
		Возврат Ложь;
	Конецесли;
	
	//Контроль файла
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭДПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
	|ГДЕ
	|	ЭДПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ПройденКонтрольФайла = Не РезультатЗапроса.Пустой();
	Если Не ПройденКонтрольФайла Тогда
		Сообщить("К поступлению не приложен скан накладной.");
		Возврат Ложь;
	Конецесли;
		
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьАкцептованСФ(Поступление)
	
	Если Поступление.АкцептованБухгалтером и Поступление.Контрагент.ОсвобожденОтНДС Тогда 
		Возврат Истина;
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураПолученный.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.ДокументОснование = &Поступление
	|	И СчетФактураПолученный.ПометкаУдаления = ЛОЖЬ
	|	И СчетФактураПолученный.Проведен = ИСТИНА
	|	И СчетФактураПолученный.АкцептованБухгалтером = ИСТИНА";
	
	Запрос.УстановитьПараметр("Поступление", Поступление);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

&НаКлиенте
Процедура НадписьЗаявкаНаРасходованияеДСНажатие(Элемент)
	
	РезультатПроверки = ВыполнитьПроверкиДляСозданияЗаявкиНаРасходованиеДС();
	Если РезультатПроверки Тогда
		
		ПараметрыОткрытия = Новый Структура;
		Если ЗначениеЗаполнено(итЗаявкаНаРасходованиеДС) Тогда
			ПараметрыОткрытия.Вставить("Ключ",итЗаявкаНаРасходованиеДС);
		КонецЕсли;
		ПараметрыОткрытия.Вставить("ДокументОснование",Объект.Ссылка);

		ОткрытьФорму("Документ.ЗаявкаНаРасходДС.Форма.ФормаДокумента", ПараметрыОткрытия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьРасхожденияДС()
	
	итЗаявкаНаРасходованиеДС  = Документы.ЗаявкаНаРасходДС.ПроверитьНаличиеЗаявкиНаРасходДС(Объект.Ссылка, НЕОПРЕДЕЛЕНО);
	Если ЗначениеЗаполнено(итЗаявкаНаРасходованиеДС) Тогда
		Элементы.НадписьЗаявкаНаРасходованияеДС.Заголовок = "Статус заявки на расходование ДС: " + Строка(итЗаявкаНаРасходованиеДС.Статус) 
												+ ?(ЗначениеЗаполнено(итЗаявкаНаРасходованиеДС.СтатусЕРП)," (" + итЗаявкаНаРасходованиеДС.СтатусЕРП + ", " + Строка(итЗаявкаНаРасходованиеДС.СуммаЕРП) + " руб.)","");
	КонецЕсли;	
	
КонецПроцедуры

//Мальцев А.Ю. ---
////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ШтрихКодДляПоиска = "";

