
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("ДокументЗаполнения", ПараметрКоманды);
	СтруктураЗаполнения.Вставить("ХозОперация",        ПредопределенноеЗначение("Справочник.ХозОперации.АктСписанияСТорговогоЗалаЕГАИС"));
	
	ПараметрыФормы = Новый Структура("Основание", СтруктураЗаполнения);
	
	ОткрытьФорму("Документ.АктСписанияЕГАИС.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, Новый УникальныйИдентификатор);
	
КонецПроцедуры
