
// Записывает в журнал регистрации описание ошибки
// с именем события "Гос ИС".
//
// Параметры:
//	СообщениеОбОшибке - Строка - строковое представление ошибки.
//	ИмяСобытия        - Строка - имя события.
//	ОбъектМетаданных  - ОбъектМетаданных - объект метаданных с ошибкой.
//	Данные            - Произвольный - данные, к которым относится сообщение об ошибке.
//
Процедура ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке, ИмяСобытия = Неопределено, ОбъектМетаданных = Неопределено, Данные = Неопределено) Экспорт
	
	Если ИмяСобытия = Неопределено Тогда
		ИмяСобытия = НСтр("ru='Вет ИС'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, ОбъектМетаданных, Данные, СообщениеОбОшибке);
	
КонецПроцедуры

Функция ОбработатьОчередьСообщений(ПараметрыОбмена)
	
	//СтруктураПоискаСтопЛист = Новый Структура("ХозяйствующийСубъект, Предприятие");
	
	ПовторитьЦиклОбработкиСообщений = Истина;
	МинимальноеКоличествоИтераций   = Неопределено;
	ЕстьЭлементыОчередиКУдалению    = Ложь;
	КоличествоОбработанныхСообщений = Неопределено;
	КоличествоСообщенийВОбработке   = Неопределено;
	
	Пока ПовторитьЦиклОбработкиСообщений Цикл
		
		ПовторитьЦиклОбработкиСообщений = Ложь;
		
		КоличествоОбработанныхСообщений = 0;
		КоличествоСообщенийВОбработке   = 0;
		
		Для Каждого ЭлементОчереди Из ПараметрыОбмена.ОчередьСообщений Цикл
			
			//СтруктураПоискаСтопЛист.ХозяйствующийСубъект = ЭлементОчереди.ХозяйствующийСубъект;
			//СтруктураПоискаСтопЛист.Предприятие          = ЭлементОчереди.Предприятие;
			//
			//Если ПараметрыОбмена.СтопЛист.НайтиСтроки(СтруктураПоискаСтопЛист).Количество() > 0 Тогда
			//	// При выполнении обмена по текущей паре ХозяйствующийСубъект - Предприятие
			//	// были ошибки. Пропустим сообщения.
			//	Продолжить;
			//КонецЕсли;
			
			//Если ПараметрыОбмена.КоличествоПопытокВосстановленияДокументов <= 0 Тогда
			//	ЕстьПопыткиВосстановления = Истина;
			//Иначе
			//	ЕстьПопыткиВосстановления = (ЭлементОчереди.КоличествоПопытокВосстановления < ПараметрыОбмена.КоличествоПопытокВосстановленияДокументов);
			//КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ЭлементОчереди.ИдентификаторЗаявки) Тогда
				
				Если Не ИнтеграцияВЕТИС.ИнтервалМеждуЗапросамиСписковВыдержан(ПараметрыОбмена, ЭлементОчереди.ВидОперации, ЭлементОчереди.Предприятие) Тогда
					Продолжить;
				КонецЕсли;
				
				НайденныеЗависимости = Неопределено;
				Если СообщениеМожноПередавать(ЭлементОчереди, ПараметрыОбмена, НайденныеЗависимости)
					И Не ЭлементОчереди.ЕстьОшибкиСервиса Тогда
					//И (ЭлементОчереди.ПроверенаКорректностьОформления) Тогда
					
					КоличествоОбработанныхСообщений = КоличествоОбработанныхСообщений + 1;
					ИнтеграцияВЕТИС.ОбработатьЭлементОчередиПередачиДанных(ЭлементОчереди, ПараметрыОбмена);
					
				ИначеЕсли НайденныеЗависимости <> Неопределено Тогда
					
					// Если зависимых сообщений нет в очереди - сообщение удаляется из очереди (Защита от зацикливания).
					Для Каждого НайденныеЗависимостиЭлементДанных Из НайденныеЗависимости Цикл
						Если ПараметрыОбмена.ОчередьСообщений.Найти(НайденныеЗависимостиЭлементДанных.Сообщение2, "Сообщение") = Неопределено Тогда
							ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				
				НайденныеЗависимости = Неопределено;
				Если СообщениеМожноЗагружать(ЭлементОчереди, ПараметрыОбмена, НайденныеЗависимости) Тогда
					
					КоличествоОбработанныхСообщений = КоличествоОбработанныхСообщений + 1;
					
					ЕстьЗависимыеСообщенияОжидающиеПередачи = ЕстьЗависимыеСообщенияОжидающиеПередачи(ЭлементОчереди, ПараметрыОбмена);
					ЕстьЗависимыеСообщенияОжидающиеЗагрузки = ЕстьЗависимыеСообщенияОжидающиеЗагрузки(ЭлементОчереди, ПараметрыОбмена);
					
					КоличествоЭлементовОчередиДоОбработки = ПараметрыОбмена.ОбработанныеЭлементыОчереди.Количество();
					ИнтеграцияВЕТИС.ЗагрузитьРезультатОбработкиЗаявки(ЭлементОчереди, ПараметрыОбмена);
					КоличествоЭлементовОчередиПослеОбработки = ПараметрыОбмена.ОбработанныеЭлементыОчереди.Количество();
					
					Если КоличествоЭлементовОчередиПослеОбработки = КоличествоЭлементовОчередиДоОбработки
						Или ЭлементОчереди.ЕстьОшибкиСервиса Тогда
						
						КоличествоСообщенийВОбработке = КоличествоСообщенийВОбработке + 1;
						
						Если ЭлементОчереди.КоличествоИтераций = Неопределено Тогда
							ЭлементОчереди.КоличествоИтераций = 1;
						Иначе
							ЭлементОчереди.КоличествоИтераций    = ЭлементОчереди.КоличествоИтераций + 1;
							ЭлементОчереди.ДатаСледующейИтерации = ТекущаяДатаСеанса() + ВремяОжиданияИтерации(ЭлементОчереди.КоличествоИтераций);
						КонецЕсли;
						
					КонецЕсли;
					
					// Минимальное время ожидания перед выполнением следующей итерации.
					Если (ЕстьЗависимыеСообщенияОжидающиеПередачи Или ЕстьЗависимыеСообщенияОжидающиеЗагрузки)
						И КоличествоЭлементовОчередиПослеОбработки > КоличествоЭлементовОчередиДоОбработки Тогда
						
						ПараметрыОбмена.НомерИтерации = 1;
						
						ПовторитьЦиклОбработкиСообщений = Истина;
						
					КонецЕсли;
					
				ИначеЕсли НайденныеЗависимости <> Неопределено Тогда
					
					// Если зависимых сообщений нет в очереди - сообщение удаляется из очереди (Защита от зацикливания).
					Для Каждого НайденныеЗависимостиЭлементДанных Из НайденныеЗависимости Цикл
						Если ПараметрыОбмена.ОчередьСообщений.Найти(НайденныеЗависимостиЭлементДанных.Сообщение2, "Сообщение") = Неопределено Тогда
							ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлементОчереди.КоличествоИтераций) Тогда
				Если МинимальноеКоличествоИтераций = Неопределено Тогда
					МинимальноеКоличествоИтераций = ЭлементОчереди.КоличествоИтераций;
				ИначеЕсли ЭлементОчереди.КоличествоИтераций < МинимальноеКоличествоИтераций Тогда
					МинимальноеКоличествоИтераций = ЭлементОчереди.КоличествоИтераций;
				КонецЕсли;
			КонецЕсли;
			
			//Если ЭлементОчереди.КоличествоПопытокВосстановления >= ПараметрыОбмена.КоличествоПопытокВосстановленияДокументов
			//	И СообщениеМожноПередавать(ЭлементОчереди, ПараметрыОбмена, Неопределено) Тогда
			//	ЕстьЭлементыОчередиКУдалению = Истина;
			//КонецЕсли;
			
		КонецЦикла;
		
		// Действия после основного цикла очереди.
		Для Каждого ЭлементОчереди Из ПараметрыОбмена.ОбработанныеЭлементыОчереди Цикл
			Если ПараметрыОбмена.ОчередьСообщений.Индекс(ЭлементОчереди) <> -1 Тогда
				ПараметрыОбмена.ОчередьСообщений.Удалить(ЭлементОчереди);
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыОбмена.ОбработанныеЭлементыОчереди.Очистить();
		
		Если КоличествоСообщенийВОбработке <> КоличествоОбработанныхСообщений Тогда
			
			ПараметрыОбмена.НомерИтерации = 1;
			
			ПовторитьЦиклОбработкиСообщений = Истина;
			
		КонецЕсли;
		
		// Запрос ВСД и записей складского учета при ошибке сервиса.
		//ИнтеграцияВЕТИС.ПодготовитьЗапросыДляПроверкиКорректностиОформления(ПараметрыОбмена, ПовторитьЦиклОбработкиСообщений);
		
	КонецЦикла;
	
	//Если ЕстьЭлементыОчередиКУдалению Тогда
	//	
	//	ЭлементыОчередиКУдалению = Новый Массив;
	//	Для Каждого ЭлементОчереди Из ПараметрыОбмена.ОчередьСообщений Цикл
	//		
	//		//Если ЭлементОчереди.КоличествоПопытокВосстановления > 0
	//		//	И ЭлементОчереди.КоличествоПопытокВосстановления >= ПараметрыОбмена.КоличествоПопытокВосстановленияДокументов Тогда
	//		//	
	//		//	ИнтеграцияВЕТИС.ДобавитьСообщениеПриОшибкеВИзменения(
	//		//		ЭлементОчереди,
	//		//		ЭлементОчереди.ТекстОшибки, Истина, ПараметрыОбмена);
	//		//	ЭлементыОчередиКУдалению.Добавить(ЭлементОчереди);
	//		//	
	//		//ИначеЕсли ЭлементОчереди.ЕстьОшибкиСервиса
	//		//	И ПараметрыОбмена.КоличествоПопытокВосстановленияДокументов = 0 Тогда
	//		//	
	//		//	ИнтеграцияВЕТИС.ДобавитьСообщениеПриОшибкеВИзменения(
	//		//		ЭлементОчереди,
	//		//		ЭлементОчереди.ТекстОшибки, Истина, ПараметрыОбмена);
	//		//	ЭлементыОчередиКУдалению.Добавить(ЭлементОчереди);
	//		//	
	//		//КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//	Для Каждого ЭлементОчереди Из ЭлементыОчередиКУдалению Цикл
	//		ПараметрыОбмена.ОчередьСообщений.Удалить(ЭлементОчереди);
	//	КонецЦикла;
	//	
	//КонецЕсли;
	//
	//Если (МинимальноеКоличествоИтераций <> Неопределено И МинимальноеКоличествоИтераций > 20) Тогда
	//	
	//	Для Каждого ЭлементОчереди Из ПараметрыОбмена.ОчередьСообщений Цикл
	//		
	//		ТекстОшибки = СтрШаблон(
	//				НСтр("ru = 'Не удалось получить результат операции ""%1"" (id = %2)
	//				      |При следующем выполнении обмена с ВетИС будет выполнена повторная попытка получения результата.'"),
	//				ЭлементОчереди.Операция,
	//				ЭлементОчереди.ИдентификаторЗаявки);
	//		
	//		ИнтеграцияВЕТИС.ДобавитьСообщениеПриОшибкеВИзменения(ЭлементОчереди, ТекстОшибки, Ложь, ПараметрыОбмена);
	//		
	//	КонецЦикла;
	//	
	//	ПараметрыОбмена.ОчередьСообщений.Очистить();
	//	
	//КонецЕсли;
	
	Возврат КоличествоСообщенийВОбработке <> Неопределено И КоличествоСообщенийВОбработке > 0;
	
КонецФункции

Функция ЕстьЗависимыеСообщенияОжидающиеЗагрузки(ЭлементОчереди, ПараметрыОбмена)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Сообщение2", ЭлементОчереди.Сообщение);
	ПараметрыОтбора.Вставить("Загрузка",   Ложь);
	НайденныеЗависимости = ПараметрыОбмена.ЗависимостиСообщений.НайтиСтроки(ПараметрыОтбора);
	
	Возврат НайденныеЗависимости.Количество() > 0;
	
КонецФункции

Функция ЕстьЗависимыеСообщенияОжидающиеПередачи(ЭлементОчереди, ПараметрыОбмена)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Сообщение2", ЭлементОчереди.Сообщение);
	ПараметрыОтбора.Вставить("Передача",   Ложь);
	НайденныеЗависимости = ПараметрыОбмена.ЗависимостиСообщений.НайтиСтроки(ПараметрыОтбора);
	
	Возврат НайденныеЗависимости.Количество() > 0;
	
КонецФункции

Функция СообщениеМожноПередавать(ЭлементОчереди, ПараметрыОбмена, НайденныеЗависимости)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Сообщение1", ЭлементОчереди.Сообщение);
	ПараметрыОтбора.Вставить("Передача",   Ложь);
	
	НайденныеЗависимости = ПараметрыОбмена.ЗависимостиСообщений.НайтиСтроки(ПараметрыОтбора);
	
	Возврат НайденныеЗависимости.Количество() = 0;
	
КонецФункции

Функция СообщениеМожноЗагружать(ЭлементОчереди, ПараметрыОбмена, НайденныеЗависимости)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Сообщение1", ЭлементОчереди.Сообщение);
	ПараметрыОтбора.Вставить("Загрузка",   Ложь);
	
	НайденныеЗависимости = ПараметрыОбмена.ЗависимостиСообщений.НайтиСтроки(ПараметрыОтбора);
	
	Возврат НайденныеЗависимости.Количество() = 0 И ЭлементОчереди.ДатаСледующейИтерации < ТекущаяДатаСеанса();
	
КонецФункции

Функция ДоступноВыполнениеОбменаНаКлиентеПоРасписанию() Экспорт
	
	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.ХозяйствующиеСубъектыВЕТИС) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//Если Не ПравоДоступа("Чтение", Метаданные.Справочники.ТранспортныеМодулиВЕТИС) Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ЗапросыВЕТИС) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыОбменаВЕТИС = ИнтеграцияВЕТИС.ПараметрыОбмена();
	
	Если ПараметрыОбменаВЕТИС.ОбменНаСервере.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПриЗавершенииПередачиДанных(РезультатыПередачиСообщений) Экспорт
	
	Изменения = Новый Массив;
	
	Для Каждого КлючИЗначение Из РезультатыПередачиСообщений Цикл
		
		//ТранспортныйМодуль = КлючИЗначение.Ключ;
		//
		//Для Каждого ЭлементДанных Из КлючИЗначение.Значение Цикл
		//	
		//	ЗначенияРеквизитов = ДанныеДокументаСообщения(ЭлементДанных.ИсходящийЗапрос, ТранспортныйМодуль);
		//	
		//	Результат = ОбработатьРезультатПередачиДанных(
		//		ЭлементДанных.ИсходящийЗапрос,
		//		ЗначенияРеквизитов,
		//		ЭлементДанных.РезультатОтправкиHTTPЗапроса);
		//	
		//	ТекстОшибки = "";
		//	Если ЗначениеЗаполнено(Результат.РезультатОбработкиОтвета.ТекстОшибки) Тогда
		//		ТекстОшибки = Результат.РезультатОбработкиОтвета.ТекстОшибки;
		//	ИначеЕсли ЗначениеЗаполнено(Результат.РезультатОтправкиЗапроса.ТекстОшибки) Тогда
		//		ТекстОшибки = Результат.РезультатОтправкиЗапроса.ТекстОшибки;
		//	КонецЕсли;
		//	
		//	СтрокаРезультата = ИнтеграцияВетИСКлиентСервер.СтруктураИзменения();
		//	СтрокаРезультата.ТранспортныйМодуль = ТранспортныйМодуль;
		//	СтрокаРезультата.ВидСообщения       = ЗначенияРеквизитов.ВидСообщения;
		//	СтрокаРезультата.ФорматОбмена       = ЗначенияРеквизитов.ФорматОбмена;
		//	
		//	СтрокаРезультата.ТекстОшибки           = ТекстОшибки;
		//	СтрокаРезультата.ПодготовленоКПередаче = Истина;
		//	СтрокаРезультата.ПереданоВУТМ          = Не ЗначениеЗаполнено(ТекстОшибки);
		//	СтрокаРезультата.Принято               = Ложь;
		//	
		//	СтрокаРезультата.ИсходящийЗапрос = Результат.ИсходящийЗапрос;
		//	СтрокаРезультата.ВходящийЗапрос  = Результат.ВходящийЗапрос;
		//	
		//	СтрокаРезультата.Объект          = Результат.Объект;
		//	СтрокаРезультата.НовыйСтатус     = Результат.РезультатОбработкиОтвета.НовыйСтатус;
		//	
		//	Если ПолучитьЗначениеПараметраСтруктуры(Результат, "ОбъектИзменен", Ложь) Тогда
		//		СтрокаРезультата.ОбъектИзменен = Истина;
		//	КонецЕсли;
		//	Если ПолучитьЗначениеПараметраСтруктуры(Результат, "Принято", Ложь) Тогда
		//		СтрокаРезультата.Принято = Истина;
		//	КонецЕсли;
		//	
		//	// Результат чека ЕГАИС
		//	СтрокаРезультата.ИдентификаторЗапроса = Результат.ИдентификаторЗапроса;
		//	СтрокаРезультата.Подпись              = Результат.Подпись;
		//	
		//	Изменения.Добавить(СтрокаРезультата);
		//	
		//КонецЦикла;
		
	КонецЦикла;
	
	Возврат Изменения;
	
КонецФункции

#Область ОбменДанными

Функция ВыполнитьОбмен(ХозяйствующиеСубъекты = Неопределено, ДатыПоследнегоЗапуска = Неопределено, ИдентификаторВладельца = Неопределено, ПоВсемПользователям = Ложь, ДляСинхронизации = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получение настроек обмена ВЕТИС для выполнения обмена на клиенте и сервере
	ПараметрыОбмена = ИнтеграцияВЕТИС.ПараметрыОбмена(ХозяйствующиеСубъекты, ИдентификаторВладельца, ДатыПоследнегоЗапуска, ПоВсемПользователям);
	
	ИнтеграцияВЕТИС.ПостроитьОчередьСообщений(ПараметрыОбмена,,, ДляСинхронизации);
	
	Если ИдентификаторВладельца = Неопределено Тогда
		
		ВозвращаемоеЗначение = ВыполнитьОбменУниверсально(ПараметрыОбмена);
		
	Иначе
		
		ВозвращаемоеЗначение = Новый Структура;
		ВозвращаемоеЗначение.Вставить("Изменения",                 Новый Массив);
		ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",        Неопределено);
		ВозвращаемоеЗначение.Вставить("Ожидать",                   Неопределено);
		ВозвращаемоеЗначение.Вставить("АдресВоВременномХранилище", Неопределено);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторВладельца);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru='Выполнение обмена с ВетИС'");
		
		ВозвращаемоеЗначение.ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("ИнтеграцияВЕТИСВызовСервера.ВыполнитьОбменДлительнаяОперация",
			ПараметрыОбмена, ПараметрыВыполнения);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПродолжитьВыполнениеОбмена(АдресВоВременномХранилище) Экспорт
	
	ПараметрыОбмена = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	Если ПараметрыОбмена.УникальныйИдентификатор <> Неопределено Тогда
		
		ВозвращаемоеЗначение = Новый Структура;
		ВозвращаемоеЗначение.Вставить("Изменения",                 Новый Массив);
		ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",        Неопределено);
		ВозвращаемоеЗначение.Вставить("Ожидать",                   Неопределено);
		ВозвращаемоеЗначение.Вставить("АдресВоВременномХранилище", Неопределено);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ПараметрыОбмена.УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru='Выполнение обмена с ВетИС'");
		
		//ИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыОбмена, ПараметрыВыполнения);
		
		ВозвращаемоеЗначение.ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("ИнтеграцияВЕТИСВызовСервера.ПродолжитьВыполнениеОбменаДлительнаяОперация",
			ПараметрыОбмена, ПараметрыВыполнения);
		
	Иначе
		
		//ВозвращаемоеЗначение = ПродолжитьВыполнениеОбменаУниверсально(ПараметрыОбмена);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ВыполнитьОбменУниверсально(ПараметрыОбмена) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Изменения",                 Новый Массив);
	ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",        Неопределено);
	ВозвращаемоеЗначение.Вставить("Ожидать",                   Неопределено);
	ВозвращаемоеЗначение.Вставить("АдресВоВременномХранилище", Неопределено);
	
	//ПараметрыОбмена.ПараметрыПреобразования = ИнтеграцияВЕТИС.ПараметрыПреобразования();
	
	//Если ПараметрыОбмена.ВыполнятьСинхронизации Тогда
	//	// Передача запросов для загрузки входящих ВСД и измененных записей складского журнала.
	//	ЗаявкиВЕТИС.ПодготовитьЗапросыДляЗагрузкиИзмененныхДанных(ПараметрыОбмена);
	//КонецЕсли;
	
	ЕстьСообщенияТребующиеОжидания = ОбработатьОчередьСообщений(ПараметрыОбмена);
	
	ЕстьОшибки = Ложь;
	Если ПараметрыОбмена.УникальныйИдентификатор <> Неопределено Тогда
		Для Каждого ИзмененияЭлементДанных Из ПараметрыОбмена.Изменения Цикл
			Если ЗначениеЗаполнено(ИзмененияЭлементДанных.ТекстОшибки) Тогда
				ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ВремяОжидания     = Неопределено;
	ТребуетсяОжидание = ЕстьСообщенияТребующиеОжидания
	               Или (Не ЕстьОшибки И ПараметрыОбмена.ОчередьСообщений.Количество() > 0);
	
	Если ТребуетсяОжидание Тогда
		
		ВремяОжидания = 1;
		Если ПараметрыОбмена.ИнтервалМеждуЗапросамиСписков <> 0 Тогда
			ВремяОжиданияСледующегоЗапроса = ИнтеграцияВЕТИС.ВремяОжиданияСледующегоЗапроса(ПараметрыОбмена);
			Если ВремяОжидания < ВремяОжиданияСледующегоЗапроса Тогда
				ВремяОжидания = ВремяОжиданияСледующегоЗапроса;
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыОбмена.ОжидатьНаСервере Тогда
			ИнтеграцияГосИС.Ожидать(ВремяОжидания, ПараметрыОбмена);
			Возврат ПродолжитьВыполнениеОбменаУниверсально(ПараметрыОбмена);
		ИначеЕсли Не ПараметрыОбмена.ОжидатьНаКлиенте Тогда
			Возврат ПродолжитьВыполнениеОбменаУниверсально(ПараметрыОбмена);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТребуетсяОжидание И ПараметрыОбмена.АдресВоВременномХранилище <> Неопределено Тогда
		
		// Параметры не сериализуются => не могут быть размещены во временном хранилище.
		//ПараметрыОбмена.ПараметрыПреобразования = Неопределено;
		ПараметрыОбмена.ФоновоеЗадание          = Неопределено;
		
		ВозвращаемоеЗначение.Ожидать                   = ?(ВремяОжидания = 0, Неопределено, ВремяОжидания);
		ВозвращаемоеЗначение.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ПараметрыОбмена, ПараметрыОбмена.АдресВоВременномХранилище);
		
	Иначе
		
		//ЗагрузитьНезагруженныеЭлементыКлассификаторов(,,ПараметрыОбмена);
		
		Если ЗначениеЗаполнено(ПараметрыОбмена.АдресВоВременномХранилище) Тогда
			УдалитьИзВременногоХранилища(ПараметрыОбмена.АдресВоВременномХранилище);
		КонецЕсли;
		
		ВозвращаемоеЗначение.Изменения = ПараметрыОбмена.Изменения;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПродолжитьВыполнениеОбменаУниверсально(ПараметрыОбмена) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Изменения",                 Новый Массив);
	ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",        Неопределено);
	ВозвращаемоеЗначение.Вставить("Ожидать",                   Неопределено);
	ВозвращаемоеЗначение.Вставить("АдресВоВременномХранилище", Неопределено);
	
	//ПараметрыОбмена.ПараметрыПреобразования = ИнтеграцияВЕТИС.ПараметрыПреобразования();
	
	ВыполнитьИтерацию = Истина;
	ВремяОжидания     = 0;
	Пока ВыполнитьИтерацию Цикл
		
		ПараметрыОбмена.НомерИтерации = ПараметрыОбмена.НомерИтерации + 1;
		
		ЕстьСообщенияТребующиеОжидания = ОбработатьОчередьСообщений(ПараметрыОбмена);
		
		ЕстьОшибки = Ложь;
		Для Каждого ИзмененияЭлементДанных Из ПараметрыОбмена.Изменения Цикл
			Если ЗначениеЗаполнено(ИзмененияЭлементДанных.ТекстОшибки) Тогда
				ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЦикла;
		
		ТребуетсяОжидание = ЕстьСообщенияТребующиеОжидания
		                Или (Не ЕстьОшибки И ПараметрыОбмена.ОчередьСообщений.Количество() > 0);
		
		Если ТребуетсяОжидание Тогда
			
			ВремяОжидания = ВремяОжидания(ПараметрыОбмена);
			Если ПараметрыОбмена.ИнтервалМеждуЗапросамиСписков <> 0 Тогда
				ВремяОжиданияСледующегоЗапроса = ИнтеграцияВЕТИС.ВремяОжиданияСледующегоЗапроса(ПараметрыОбмена);
				Если ВремяОжидания < ВремяОжиданияСледующегоЗапроса Тогда
					ВремяОжидания = ВремяОжиданияСледующегоЗапроса;
				КонецЕсли;
			КонецЕсли;
			
			Если ПараметрыОбмена.ОжидатьНаСервере Тогда
				ИнтеграцияГосИС.Ожидать(ВремяОжидания, ПараметрыОбмена);
			ИначеЕсли ПараметрыОбмена.ОжидатьНаКлиенте Тогда
				ВыполнитьИтерацию = Ложь;
			КонецЕсли;
			
		Иначе
			
			ВыполнитьИтерацию = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТребуетсяОжидание И ПараметрыОбмена.АдресВоВременномХранилище <> Неопределено Тогда
		
		// Параметры не сериализуются => не могут быть размещены во временном хранилище.
		//ПараметрыОбмена.ПараметрыПреобразования = Неопределено;
		ПараметрыОбмена.ФоновоеЗадание          = Неопределено;
		
		ВозвращаемоеЗначение.Ожидать                   = ?(ВремяОжидания = 0, Неопределено, ВремяОжидания);
		ВозвращаемоеЗначение.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ПараметрыОбмена, ПараметрыОбмена.АдресВоВременномХранилище);
		
	Иначе
		
		//ЗагрузитьНезагруженныеЭлементыКлассификаторов(,,ПараметрыОбмена);
		
		Если ЗначениеЗаполнено(ПараметрыОбмена.АдресВоВременномХранилище) Тогда
			УдалитьИзВременногоХранилища(ПараметрыОбмена.АдресВоВременномХранилище);
		КонецЕсли;
		
		ВозвращаемоеЗначение.Изменения = ПараметрыОбмена.Изменения;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ВыполнитьОбменДлительнаяОперация(ПараметрыОбмена, АдресРезультата) Экспорт
	
	ВозвращаемоеЗначение = ВыполнитьОбменУниверсально(ПараметрыОбмена);
	
	ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
	
КонецПроцедуры

Процедура ПродолжитьВыполнениеОбменаДлительнаяОперация(ПараметрыОбмена, АдресРезультата) Экспорт
	
	ВозвращаемоеЗначение = ПродолжитьВыполнениеОбменаУниверсально(ПараметрыОбмена);
	
	ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресРезультата);
	
КонецПроцедуры

Функция ВремяОжиданияИтерации(НомерИтерации)
	
	Если НомерИтерации <= 1 Тогда
		ВремяОжидания = 0;
	ИначеЕсли НомерИтерации < 15 Тогда
		ВремяОжидания = 5 * Pow(1.4, НомерИтерации - 1);
	Иначе
		ВремяОжидания = 120;
	КонецЕсли;
	
	Возврат ВремяОжидания;
	
КонецФункции

Функция ВремяОжидания(ПараметрыОбмена)
	
	ВремяОжидания = ВремяОжиданияИтерации(ПараметрыОбмена.НомерИтерации);
	
	ВремяОжиданияСледующегоЗапроса = ИнтеграцияВЕТИС.ВремяОжиданияСледующегоЗапроса(ПараметрыОбмена);
	
	Если Не ПараметрыОбмена.ОжидатьНаСервере
		И ПараметрыОбмена.ОчередьСообщений.Количество() > 0
		И ВремяОжиданияСледующегоЗапроса > ВремяОжидания Тогда
		
		ВОчередиЕстьЗапросыСписков = Ложь;
		Для Каждого ЭлементОчереди Из ПараметрыОбмена.ОчередьСообщений Цикл
			Если ИнтеграцияВЕТИС.ЭтоЗапросСписка(ЭлементОчереди) Тогда
				ВОчередиЕстьЗапросыСписков = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ВОчередиЕстьЗапросыСписков Тогда
			ВремяОжидания = ВремяОжиданияСледующегоЗапроса;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Окр(ВремяОжидания, 0, РежимОкругления.Окр15как20);
	
КонецФункции

Функция ВходящиеСообщения(ХозяйствующиеСубъекты = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ДокументыКЗагрузке",    Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("НастройкаПодключения",  Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",           "");
	
	// Получение настроек обмена ВЕТИС для выполнения обмена на клиенте и сервере
	ПараметрыОбмена = ИнтеграцияВЕТИС.ПараметрыОбмена(ХозяйствующиеСубъекты);
	ВозвращаемоеЗначение.НастройкаПодключения = ПараметрыОбмена.ОбменНаСервере;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция УдалитьВходящиеДокументы(ДокументыКУдалению) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ДокументыКУдалению",    Новый Массив);
	ВозвращаемоеЗначение.Вставить("НастройкаПодключения",  Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",           "");
	
	ХозяйствующиеСубъекты = Новый Массив;
	Для Каждого ЭлементДанных Из ДокументыКУдалению Цикл
		Если ХозяйствующиеСубъекты.Найти(ЭлементДанных.ХозяйствующийСубъект) = Неопределено Тогда
			ХозяйствующиеСубъекты.Добавить(ЭлементДанных.ХозяйствующийСубъект);
		КонецЕсли;
	КонецЦикла;
	
	// Получение настроек обмена ВЕТИС для выполнения обмена на клиенте и сервере
	ПараметрыОбмена = ИнтеграцияВЕТИС.ПараметрыОбмена(ХозяйствующиеСубъекты);
	ВозвращаемоеЗначение.НастройкаПодключения = ПараметрыОбмена.ОбменНаСервере;
	
	ДокументыКУдалениюНаСервере = Новый Массив;
	Для Каждого ЭлементДанных Из ДокументыКУдалению Цикл
		
		Если ПараметрыОбмена.ОбменНаСервере.Получить(ЭлементДанных.ХозяйствующийСубъект) <> Неопределено Тогда
			ВозвращаемоеЗначение.ДокументыКУдалению.Добавить(ЭлементДанных);
		//ИначеЕсли ПараметрыОбмена.ОбменНаСервере.Получить(ЭлементДанных.ХозяйствующийСубъект) <> Неопределено Тогда
		//	ДокументыКУдалениюНаСервере.Добавить(ЭлементДанных);
		КонецЕсли;
		
	КонецЦикла;
	
	//УдалитьДокументыИзУТМ(
	//	ДокументыКУдалениюНаСервере,
	//	ПараметрыОбмена.ОбменНаСервере,
	//	ВозвращаемоеЗначение);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПроверитьВходящиеДокументы(ХозяйствующиеСубъекты = Неопределено, ИдентификаторВладельца = Неопределено) Экспорт
	
	//ВозвращаемоеЗначение = Новый Структура;
	//ВозвращаемоеЗначение.Вставить("АдресаURLВходящихДокументов", Новый Массив);
	//ВозвращаемоеЗначение.Вставить("НастройкаПодключения",        Новый Соответствие);
	//ВозвращаемоеЗначение.Вставить("ТекстОшибки",                 "");
	//ВозвращаемоеЗначение.Вставить("ИдентификаторВладельца",      ИдентификаторВладельца);
	//
	ПараметрыОбмена = ИнтеграцияВЕТИС.ПараметрыОбмена(ХозяйствующиеСубъекты);
	//
	//ВозвращаемоеЗначение.НастройкаПодключения = ПараметрыОбмена.ОбменНаКлиенте;
	//
	//МассивТранспортныеМодули = ИнтеграцияВЕТИСКлиентСервер.ТранспортныеМодули(ПараметрыОбмена.ОбменНаСервере);
	//Для Каждого ТранспортныйМодуль Из МассивТранспортныеМодули Цикл
	//	
	//	АдресаURLВходящихДокументов = ИнтеграцияВЕТИСКлиентСервер.АдресаURLВходящихДокументов(
	//		ПараметрыОбмена.ОбменНаСервере, ТранспортныйМодуль);
	//	
	//	Если ЗначениеЗаполнено(АдресаURLВходящихДокументов.ТекстОшибки) Тогда
	//		
	//		ТекстОшибки = СтрШаблон(
	//			НСтр("ru = 'Не удалось получить список входящих документов организации %1:
	//			           |По причине:
	//			           |%2'"),
	//			ТранспортныйМодуль,
	//			АдресаURLВходящихДокументов.ТекстОшибки);
	//		
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	//		
	//		Если ЗначениеЗаполнено(ВозвращаемоеЗначение.ТекстОшибки) Тогда
	//			ВозвращаемоеЗначение.ТекстОшибки = ВозвращаемоеЗначение.ТекстОшибки
	//			                                 + Символы.ПС + ТекстОшибки;
	//		Иначе
	//			ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибки;
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//	Для Каждого ДанныеКПолучению Из АдресаURLВходящихДокументов.ДанныеОбработки Цикл
	//		ВозвращаемоеЗначение.АдресаURLВходящихДокументов.Добавить(ДанныеКПолучению);
	//	КонецЦикла;
	//	
	//КонецЦикла;
	//
	//Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПолучитьВходящиеДокументы(ПараметрыОбмена) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Изменения",   Новый Массив);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки", "");
	
	//ДокументыКЗагрузке = ДокументыКЗагрузке(ПараметрыОбмена, ВозвращаемоеЗначение);
	//
	//Результат = ОбработатьВходящиеДокументы(ДокументыКЗагрузке);
	//
	//Для Каждого ЭлементДанных Из Результат.Изменения Цикл
	//	
	//	ЭтоВходящее = (НЕ ЗначениеЗаполнено(ЭлементДанных.ИсходящийЗапрос));
	//	
	//	///УдалитьДокументыИзУТМ(ЭлементДанных.СлужебныеДанные, ПараметрыОбмена, ВозвращаемоеЗначение, ЭтоВходящее);
	//	
	//	ВозвращаемоеЗначение.Изменения.Добавить(ЭлементДанных);
	//	
	//КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ОбработатьВходящиеДокументы(ДокументыКЗагрузке, ИдентификаторВладельца = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Изменения", Новый Массив);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция РежимТестовогоКонтура() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Константы.РежимТестовогоКонтураВЕТИС.Получить();
	
КонецФункции

// Возвращает адрес и порт сервера ВетИС.
//
// Возвращаемое значение:
//  Структура - Адрес и порт сервера.
Функция АдресСервера() Экспорт
	
	Результат = Новый Структура;
	
	Если РежимТестовогоКонтура() Тогда
		Результат.Вставить("Адрес", "api2.vetrf.ru");
		Результат.Вставить("Порт", 8002);
	Иначе
		Результат.Вставить("Адрес", "api.vetrf.ru");
		Результат.Вставить("Порт", 443);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьСобственныйХозСубъект() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ХозяйствующиеСубъектыВЕТИС.Ссылка КАК ХозяйствующийСубъект
	|ИЗ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС КАК ХозяйствующиеСубъектыВЕТИС
	|ГДЕ
	|	ХозяйствующиеСубъектыВЕТИС.Собственный = ИСТИНА
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ХозяйствующийСубъект = Выборка.ХозяйствующийСубъект;
	КонецЕсли;
	
	Возврат ХозяйствующийСубъект;
	
КонецФункции

#КонецОбласти

#Область ФормированиеЗаявок

Функция ПодготовитьЗапрос(ХозяйствующийСубъект, Предприятие, ВидОперации, ДанныеДляВыгрузки, УникальныйИдентификатор=Неопределено, ПараметрыОбмена = Неопределено) Экспорт
	
	Если ПараметрыОбмена = Неопределено Тогда
		ПараметрыОбмена = ИнтеграцияВЕТИС.ПараметрыОбмена(ХозяйствующийСубъект, УникальныйИдентификатор);
	КонецЕсли;
	
	Если ТипЗнч(ДанныеДляВыгрузки) = Тип("Массив") Тогда
		МассивДанныхДляВыгрузки = ДанныеДляВыгрузки;
	ИначеЕсли ТипЗнч(ДанныеДляВыгрузки) = Тип("СписокЗначений") Тогда
		МассивДанныхДляВыгрузки = ДанныеДляВыгрузки.ВыгрузитьЗначения();
	Иначе
		МассивДанныхДляВыгрузки = Новый Массив;
		МассивДанныхДляВыгрузки.Добавить(ДанныеДляВыгрузки);
	КонецЕсли;
	
	ВсеСообщенияXML = Новый Массив;
	Для Каждого ТекущиеДанные Из МассивДанныхДляВыгрузки Цикл
		
		Если (НЕ ТекущиеДанные.Свойство("ХозяйствующийСубъект")) ИЛИ (НЕ ЗначениеЗаполнено(ТекущиеДанные.ХозяйствующийСубъект)) Тогда
			ТекущиеДанные.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
		КонецЕсли;
		Если (НЕ ТекущиеДанные.Свойство("Предприятие")) ИЛИ (НЕ ЗначениеЗаполнено(ТекущиеДанные.Предприятие)) Тогда
			ТекущиеДанные.Вставить("Предприятие",          Предприятие);
		КонецЕсли;
		Если (НЕ ТекущиеДанные.Свойство("ВидОперации")) ИЛИ (НЕ ЗначениеЗаполнено(ТекущиеДанные.ВидОперации)) Тогда
			ТекущиеДанные.Вставить("ВидОперации",           ВидОперации);
		КонецЕсли;
		
		СообщенияXML = ИнтеграцияВЕТИС.СформироватьСообщенияXML(ТекущиеДанные.ВидОперации, ТекущиеДанные, ПараметрыОбмена, ТекущиеДанные.ХозяйствующийСубъект, ТекущиеДанные.Предприятие);
		
		Для Каждого СообщениеXML Из СообщенияXML Цикл
			ВсеСообщенияXML.Добавить(СообщениеXML);
		КонецЦикла;
		
	КонецЦикла;
	
	ВозвращаемоеЗначение = ИнтеграцияВЕТИС.ПодготовитьКПередачеСОжиданием(ВсеСообщенияXML, ПараметрыОбмена, УникальныйИдентификатор, Ложь);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область ОбработкаЗаявок

#КонецОбласти