// Модуль формы справочника "Шаблоны этикеток и ценников"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СвойстваЯчеек.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СвойстваЯчеек.ИмяСвойства");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = НСтр("ru = 'Разделитель'");

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ReportHeaderBackColor);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СвойстваЯчеекЗначение.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СвойстваЯчеек.ИмяСвойства");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = НСтр("ru = 'Разделитель'");

	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоды()
	
	Возврат Справочники.ШаблоныЭтикетокИЦенников.ПолучитьОбразцыШтрихкодов();
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяПараметраШтрихкод()
	
	Возврат "Штрихкод";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РазмерСтраницы(ПолеТабличногоДокумента)
	
	ВысотаСтраницы = ПолеТабличногоДокумента.ВысотаСтраницы;
	ШиринаСтраницы = ПолеТабличногоДокумента.ШиринаСтраницы;
	
	Наименование = Строка(ШиринаСтраницы)+"х"+Строка(ВысотаСтраницы);
	
	Если ШиринаСтраницы = 210 И ВысотаСтраницы = 297 Тогда
		Наименование = "A4";
	ИначеЕсли ШиринаСтраницы = 148 И ВысотаСтраницы = 210 Тогда
		Наименование = "A5";
	ИначеЕсли ШиринаСтраницы = 105 И ВысотаСтраницы = 148 Тогда
		Наименование = "A6";
	ИначеЕсли ШиринаСтраницы = 74 И ВысотаСтраницы = 105 Тогда
		Наименование = "A7";
	ИначеЕсли ШиринаСтраницы = 52 И ВысотаСтраницы = 74 Тогда
		Наименование = "A8";
	ИначеЕсли ШиринаСтраницы = 37 И ВысотаСтраницы = 52 Тогда
		Наименование = "A9";
	ИначеЕсли ШиринаСтраницы = 26 И ВысотаСтраницы = 37 Тогда
		Наименование = "A10";
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЗаголовок(Форма)
	
	Наименование = Форма.Объект.Наименование;
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Наименование = НСтр("ru = '(Создание)'");
	КонецЕсли;
	
	Форма.Автозаголовок = Ложь;
	Если Форма.Объект.Назначение      = ПредопределенноеЗначение("Перечисление.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров") Тогда
		Форма.Заголовок = НСтр("ru = 'Шаблон этикетки:'") + " " + Наименование;
	ИначеЕсли Форма.Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров") Тогда
		Форма.Заголовок = НСтр("ru = 'Шаблон ценника:'") + " "+ Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьШаблон()
	
	СтруктураШаблона = СтруктураШаблона();
	
	Если СтруктураШаблона <> Неопределено Тогда
		// Загрузка шаблона.
		СтруктураШаблона.Свойство("РедакторТабличныйДокумент", ПолеТабличногоДокумента);
		СтруктураШаблона.Свойство("КоличествоПоВертикали"    , КоличествоПоВертикали);
		СтруктураШаблона.Свойство("КоличествоПоГоризонтали"  , КоличествоПоГоризонтали);
		СтруктураШаблона.Свойство("ТипКода"                  , ТипКода);
		СтруктураШаблона.Свойство("РазмерШрифта"             , РазмерШрифта);
		СтруктураШаблона.Свойство("УголПоворота"             , УголПоворота);
		СтруктураШаблона.Свойство("ОтображатьТекст"          , ОтображатьТекст);
		
		Элементы.РазмерШрифта.Доступность = ОтображатьТекст;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьМаксимальноеКоличествоНаСтранице()
	
	РазмерБумаги = РазмерБумагиНаСервере();	
	ПолеТабличногоДокумента.ВысотаСтраницы = РазмерБумаги.ВысотаСтраницы;
	ПолеТабличногоДокумента.ШиринаСтраницы = РазмерБумаги.ШиринаСтраницы;
	
	МаксимальноеКоличество = МаксимальноеКоличествоЭтикетокНаСтранице();
	
	КоличествоПоВертикали   = МаксимальноеКоличество.ПоВертикали;
	КоличествоПоГоризонтали = МаксимальноеКоличество.ПоГоризонтали;
	
	ОписаниеРазмещенияДляЦенников = НСтр("ru = 'На странице'") + " """+ МаксимальноеКоличество.ФорматБумаги + """ " 
	+ НСтр("ru = 'помещается по вертикали:'")
	+ " " + КоличествоПоВертикали
	+ ", "
	+ НСтр("ru = 'по горизонтали:'")
	+ " "
	+ КоличествоПоГоризонтали;
	
КонецПроцедуры

&НаСервере
Процедура НазначениеПриИзмененииСервер(Знач ОчищатьНазначение = Истина)
	
	ОбновитьЗаголовок(ЭтотОбъект);
	Элементы.ГруппаОписаниеРазмера.Видимость = Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров");
	
	ЗаполнитьДоступныеПоля();
		
	РассчитатьМаксимальноеКоличествоНаСтранице();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьШаблонПоУмолчанию(ИмяШаблона)
	
	ШаблонПоУмолчанию = Справочники.ШаблоныЭтикетокИЦенников.ПолучитьМакет(ИмяШаблона);
	
	ПолеТабличногоДокумента = ШаблонПоУмолчанию;
	
	
		ТипКода = 1; // EAN13
			
		ОтображатьТекст = Истина;
		РазмерШрифта    = 12;
		
КонецПроцедуры

&НаСервере
Функция СтруктураШаблона()
	
	СтруктураШаблона = Неопределено;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	СтруктураШаблона = Объект.Ссылка.Шаблон.Получить();
	Иначе
		ЗначениеКопирования = Неопределено;
		Параметры.Свойство("ЗначениеКопирования", ЗначениеКопирования);
		Если ЗначениеКопирования <> Неопределено Тогда
			СтруктураШаблона = ЗначениеКопирования.Шаблон.Получить();
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураШаблона;
	
КонецФункции

&НаСервере
Функция ПодготовитьСтруктуруМакетаШаблона()
	
	СтруктураМакетаШаблона = Справочники.ШаблоныЭтикетокИЦенников.ПодготовитьСтруктуруМакетаШаблона(ПолеТабличногоДокумента, Объект.РазмерБумаги);
	СтруктураМакетаШаблона.ТипКода          = ТипКода;
	СтруктураМакетаШаблона.РазмерШрифта     = РазмерШрифта;
	СтруктураМакетаШаблона.ОтображатьТекст  = ОтображатьТекст;
	СтруктураМакетаШаблона.УголПоворота  = УголПоворота;
	Возврат СтруктураМакетаШаблона;
	
КонецФункции

&НаСервере
Функция ПроверитьРазмещение()
	
	Ошибка = Ложь;
	
	МаксимальноеКоличество = МаксимальноеКоличествоЭтикетокНаСтранице();
	
	Если МаксимальноеКоличество.ПоГоризонтали > 0
		И КоличествоПоГоризонтали > МаксимальноеКоличество.ПоГоризонтали Тогда
		
		ТекстСообщения = НСтр("ru = 'Максимальное количество по горизонтали: %Количество%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", МаксимальноеКоличество.ПоГоризонтали);

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"КоличествоПоГоризонтали",,Ошибка);
		
	КонецЕсли;	
	
	Если МаксимальноеКоличество.ПоВертикали > 0
		И КоличествоПоВертикали > МаксимальноеКоличество.ПоВертикали Тогда
		
		ТекстСообщения = НСтр("ru = 'Максимальное количество по вертикали: %Количество%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", МаксимальноеКоличество.ПоВертикали);

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"КоличествоПоВертикали",,Ошибка);
		
	КонецЕсли;	
	
	Возврат НЕ Ошибка;
	
КонецФункции

&НаСервере
Функция  МаксимальноеКоличествоЭтикетокНаСтранице()
	
	Возврат Справочники.ШаблоныЭтикетокИЦенников.МаксимальноеКоличествоНаСтранице(ПолеТабличногоДокумента, Объект.РазмерБумаги);
	
КонецФункции

&НаСервере
Функция РазмерБумагиНаСервере()
	
	Возврат Справочники.ШаблоныЭтикетокИЦенников.РазмерБумаги(Объект.РазмерБумаги);
	
КонецФункции

&НаСервере
Процедура УстановитьОбластьПечатиНаСервере(ИмяОбласти)
	
	ВыделеннаяОбласть = ПолеТабличногоДокумента.Область(ИмяОбласти);
	
	НетЛинии = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии, 0);
	РедкийПунктир = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.РедкийПунктир, 1);
	
	Если ПолеТабличногоДокумента.ОбластьПечати <> Неопределено Тогда
		ПолеТабличногоДокумента.ОбластьПечати.Обвести(НетЛинии,НетЛинии,НетЛинии,НетЛинии);
	КонецЕсли;
	
	ПолеТабличногоДокумента.ОбластьПечати = ВыделеннаяОбласть;
	ПолеТабличногоДокумента.ОбластьПечати.Обвести(РедкийПунктир,РедкийПунктир,РедкийПунктир,РедкийПунктир);
	
	ПолеТабличногоДокумента.ОбластьПечати.АвтоВысотаСтроки = Ложь;
	
КонецПроцедуры

&НаСервере
Функция УстановитьКартинкуШтрихкода(РисунокШтрихкода)
	
	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	ПримерШтрихкода = Неопределено;
	Коды = ПолучитьКоды();
	Для Каждого СтрокаТЧ Из Коды Цикл
		Если СтрокаТЧ.ТипКода = ТипКода Тогда
			ПримерШтрихкода = СтрокаТЧ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",          Окр(РисунокШтрихкода.Ширина / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Высота",          Окр(РисунокШтрихкода.Высота / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(ПримерШтрихкода.Пример));
	ПараметрыШтрихкода.Вставить("ТипКода",         ПримерШтрихкода.ТипКода);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст", ОтображатьТекст);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",    РазмерШрифта);
	ПараметрыШтрихкода.Вставить("УголПоворота",    УголПоворота);
	
	РисунокШтрихкода.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	
КонецФункции

&НаСервере
Функция ВставитьРисунокШтрихкода(ИмяТекущейОбласти)
	
	РисунокШтрихкода = ПолеТабличногоДокумента.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	Индекс = ПолеТабличногоДокумента.Рисунки.Индекс(РисунокШтрихкода);
	РисунокШтрихкода.Расположить(ПолеТабличногоДокумента.Область(ИмяТекущейОбласти));
	РисунокШтрихкода.Имя = ИмяПараметраШтрихкод()+СтрЗаменить(Новый УникальныйИдентификатор,"-","_");
	
	УстановитьКартинкуШтрихкода(ПолеТабличногоДокумента.Рисунки[Индекс]);
	
	Возврат Индекс;
	
КонецФункции

&НаСервере
Функция ЗаменитьРисунокШтрихкода(ИмяРисунка)
	
	РисунокШтрихкодаИсточник = Неопределено;
	Для Каждого Рисунок Из ПолеТабличногоДокумента.Рисунки Цикл
		Если Рисунок.Имя <> ИмяРисунка Тогда
			Продолжить;
		КонецЕсли;
		РисунокШтрихкодаИсточник = Рисунок;
		Прервать;
	КонецЦикла;
	
	РисунокШтрихкода = ПолеТабличногоДокумента.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	Если РисунокШтрихкодаИсточник=Неопределено Тогда
	Иначе
		РисунокШтрихкода.Верх   = РисунокШтрихкодаИсточник.Верх;
		РисунокШтрихкода.Лево   = РисунокШтрихкодаИсточник.Лево;
		РисунокШтрихкода.Высота = РисунокШтрихкодаИсточник.Высота;
		РисунокШтрихкода.Ширина = РисунокШтрихкодаИсточник.Ширина;
		РисунокШтрихкода.Имя    = РисунокШтрихкодаИсточник.Имя;
		
		ПолеТабличногоДокумента.Рисунки.Удалить(РисунокШтрихкодаИсточник);
	КонецЕсли;
	
	
	Индекс = ПолеТабличногоДокумента.Рисунки.Индекс(РисунокШтрихкода);
	УстановитьКартинкуШтрихкода(ПолеТабличногоДокумента.Рисунки[Индекс]);
	
	Возврат Индекс;
	
КонецФункции

&НаСервере
Процедура ОбъединитьОбласть(ИмяОбласти)
	
	Область = ПолеТабличногоДокумента.Область(ИмяОбласти);
	Область.Объединить();
	
КонецПроцедуры

&НаСервере
Процедура РазъединитьОбласть(ИмяОбласти)
	
	Область = ПолеТабличногоДокумента.Область(ИмяОбласти);
	Область.Разъединить();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьШаблон()
	
	Если ЗначениеЗаполнено(ИмяМакета) Тогда
		УстановитьШаблонПоУмолчанию(ИмяМакета);
	Иначе
		ПолеТабличногоДокумента = Новый ТабличныйДокумент;
		ПолеТабличногоДокумента.ОбластьПечати = ПолеТабличногоДокумента.Область("R2C2:R20C5");
		РедкийПунктир = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.РедкийПунктир, 1);
		ПолеТабличногоДокумента.ОбластьПечати.Обвести(РедкийПунктир,РедкийПунктир,РедкийПунктир,РедкийПунктир);
		КоличествоПоГоризонтали = 1;
		КоличествоПоВертикали   = 1;
		ТипКода                 = 1; // EAN-13
		ОтображатьТекст         = Истина;
		РазмерШрифта            = 12;
		
		Элементы.ОтображатьТекст.Доступность = Истина;
		Элементы.ТипКода.Доступность         = Истина;
	КонецЕсли;
	
	Элементы.РазмерШрифта.Доступность = ОтображатьТекст;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоле(Коллекция, СтруктураПоля, Дерево)
	
	Результат = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтруктураПоля, ",");
	ИмяПоля = Результат[0];
	Иерархия = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяПоля, ".");
	
	Если Результат.Количество() = 2 Тогда
		Действия = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Результат[1], ";");
	Иначе
		Действия = Новый Массив;
	КонецЕсли;
	
	КоллекцияСтрокДерева = Дерево.Строки;
	КоллекцияПолейКомпоновки = Коллекция;
	НайденныйЭлементПолеКомпоновки = Неопределено;
	НайденныйЭлементДерева = Неопределено;
	ИмяЭлемента = "";
	ИмяЭлементаОписание = "";
	ИмяРодителя = "";
	ИмяРодителяОписание = "";
	Для Каждого ЭлементИерархии Из Иерархия Цикл
		
		ИмяРодителя = ?(ЗначениеЗаполнено(ИмяЭлемента), ИмяЭлемента + ".", "");
		ИмяЭлемента = ИмяРодителя + ЭлементИерархии;
		
		НайденныйЭлементПолеКомпоновки = КоллекцияПолейКомпоновки.Найти(ИмяЭлемента);
		Если НайденныйЭлементПолеКомпоновки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		КоллекцияПолейКомпоновки = НайденныйЭлементПолеКомпоновки.Элементы;
		
		ИмяРодителяОписание = ?(ЗначениеЗаполнено(ИмяЭлементаОписание), ИмяЭлементаОписание + ".", "");
		ИмяЭлементаОписание = ИмяРодителяОписание + НайденныйЭлементПолеКомпоновки.Заголовок;
		
		НайденныйЭлементДерева = КоллекцияСтрокДерева.Найти(ЭлементИерархии, "ИмяПоля");
		Если НайденныйЭлементДерева = Неопределено Тогда
			
			НайденныйЭлементДерева = КоллекцияСтрокДерева.Добавить();
			Если КоллекцияСтрокДерева.Родитель <> Неопределено Тогда
				КоллекцияСтрокДерева.Родитель.ИндексКартинки = 0;
			КонецЕсли;
			
			НайденныйЭлементДерева.ИмяПоля = ЭлементИерархии;
			НайденныйЭлементДерева.Описание = СтрЗаменить(НайденныйЭлементПолеКомпоновки.Заголовок, ИмяРодителяОписание, "");
			
		КонецЕсли;
		КоллекцияСтрокДерева = НайденныйЭлементДерева.Строки;
		
	КонецЦикла;
	
	НайденныйЭлементДерева.ПолеКомпоновкиДанных = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Если НайденныйЭлементДерева.Строки.Количество() > 0 Тогда
		НайденныйЭлементДерева.ИндексКартинки = 0;
	Иначе
		НайденныйЭлементДерева.ИндексКартинки = 7;
	КонецЕсли;
	НайденныйЭлементДерева.Описание = СтрЗаменить(НайденныйЭлементПолеКомпоновки.Заголовок, ИмяРодителяОписание, "");
	
	Если Действия.Найти("Свойства") <> Неопределено Тогда
		
		НаборыРеквизитовИСведений = Новый Массив;
		Для Каждого Тип Из НайденныйЭлементПолеКомпоновки.Тип.Типы() Цикл
				
				ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
				
				Для Каждого Характеристика Из ОбъектМетаданных.Характеристики Цикл
					Если ЗначениеЗаполнено(Характеристика.ЗначениеОтбораВидов) И НаборыРеквизитовИСведений.Найти(Характеристика.ЗначениеОтбораВидов) = Неопределено Тогда
						НаборыРеквизитовИСведений.Добавить(Характеристика.ЗначениеОтбораВидов);
					КонецЕсли;
				КонецЦикла
				
		КонецЦикла;
				
		Для Каждого НаборСсылка Из НаборыРеквизитовИСведений Цикл
			Набор = НаборСсылка.ПолучитьОбъект();
			Для Каждого ДополнительныйРеквизит Из Набор.ДополнительныеРеквизиты Цикл
				НоваяСтрока = НайденныйЭлементДерева.Строки.Добавить();
				НоваяСтрока.ИндексКартинки = 1;
				НоваяСтрока.ПолеКомпоновкиДанных = Новый ПолеКомпоновкиДанных(ИмяПоля+".["+ДополнительныйРеквизит.Свойство.Наименование+"]");
				НоваяСтрока.Описание = ДополнительныйРеквизит.Свойство.Наименование;
			КонецЦикла;
			Для Каждого ДополнительноеСведение Из Набор.ДополнительныеСведения Цикл
				НоваяСтрока = НайденныйЭлементДерева.Строки.Добавить();
				НоваяСтрока.ИндексКартинки = 2;
				НоваяСтрока.ПолеКомпоновкиДанных = Новый ПолеКомпоновкиДанных(ИмяПоля+".["+ДополнительноеСведение.Свойство.Наименование+"]");
				НоваяСтрока.Описание = ДополнительноеСведение.Свойство.Наименование;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеПоля()
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Заполнение доступных полей
	Если Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров Тогда
		СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("ПоляШаблонаТовары");
	Иначе
		СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("ПоляШаблонаТовары");
	КонецЕсли;
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтотОбъект.УникальныйИдентификатор);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВХранилище));
	УстановитьПривилегированныйРежим(Ложь);
	
	ИменаПолей = Новый Массив;
	
	ИменаПолей.Добавить("Штрихкод");
	
	ИменаПолей.Добавить("ТипЦены");
	ИменаПолей.Добавить("ТипЦены.ВалютаЦены");
	ИменаПолей.Добавить("ТипЦены.Наименование");
	ИменаПолей.Добавить("ТипЦены.ЦенаВключаетНДС");
	ИменаПолей.Добавить("Цена");
	ИменаПолей.Добавить("ДатаПоследнегоИзмененияЦены");
	
	ИменаПолей.Добавить("ТипЦеныДополнительно");
	ИменаПолей.Добавить("ТипЦеныДополнительно.ВалютаЦены");
	ИменаПолей.Добавить("ТипЦеныДополнительно.Наименование");
	ИменаПолей.Добавить("ТипЦеныДополнительно.ЦенаВключаетНДС");
	ИменаПолей.Добавить("ЦенаДополнительно");
	ИменаПолей.Добавить("ДатаПоследнегоИзмененияЦеныДополнительно");
	
	ИменаПолей.Добавить("Номенклатура.Артикул");
	ИменаПолей.Добавить("Номенклатура.ВидНоменклатуры");
	ИменаПолей.Добавить("Номенклатура.Родитель");
	ИменаПолей.Добавить("Номенклатура.ОсновнаяЕдиницаИзмерения");
	ИменаПолей.Добавить("Номенклатура.Код");
	ИменаПолей.Добавить("Номенклатура.Наименование");
	ИменаПолей.Добавить("Номенклатура.НаименованиеПолное");
	
	//+ НСИ наименования для ценников
	ИменаПолей.Добавить("Номенклатура.бит_НаименованиеДляЦенника_Строка1");
	ИменаПолей.Добавить("Номенклатура.бит_НаименованиеДляЦенника_Строка2");
	ИменаПолей.Добавить("Номенклатура.бит_НаименованиеДляЦенника_Строка3");
	ИменаПолей.Добавить("Номенклатура.бит_НаименованиеДляЦенника_Строка4");
	//- НСИ наименования для ценников
	
	ИменаПолей.Добавить("Номенклатура.Производитель");
	ИменаПолей.Добавить("Номенклатура.СтавкаНДС");
	ИменаПолей.Добавить("Номенклатура.ТипНоменклатуры");
	ИменаПолей.Добавить("Номенклатура.СтранаПроисхождения");
	ИменаПолей.Добавить("Номенклатура,Свойства");
	
	ИменаПолей.Добавить("Характеристика.Наименование");
	ИменаПолей.Добавить("Характеристика.Владелец");
	ИменаПолей.Добавить("Характеристика,Свойства");
	
	ИменаПолей.Добавить("ЕдиницаИзмерения");
	ИменаПолей.Добавить("Весовой");
	ИменаПолей.Добавить("Организация");
	ИменаПолей.Добавить("ПодразделениеКомпании");
	ИменаПолей.Добавить("ТекущееВремя");
	ИменаПолей.Добавить("ТекущийПользователь");	
	
	ИменаПолей.Добавить("ЦенаДоАкции");
	ИменаПолей.Добавить("АкцияНачалоДействия");
	ИменаПолей.Добавить("АкцияКонецДействия");
	ИменаПолей.Добавить("ЦенаКопейки");
	ИменаПолей.Добавить("ЦенаДоАкцииКопейки");
	ИменаПолей.Добавить("ЦенаРубли");
	ИменаПолей.Добавить("ЦенаДоАкцииРубли");
	ИменаПолей.Добавить("ПЛУ");
	ИменаПолей.Добавить("Цена100Копейки");
	ИменаПолей.Добавить("ЦенаДоАкции100Копейки");
	ИменаПолей.Добавить("Цена100Рубли");
	ИменаПолей.Добавить("ЦенаДоАкции100Рубли");
	
	//Мальцев А.Ю. +++
	ИменаПолей.Добавить("ЦенаДоАкции100");
	ИменаПолей.Добавить("НаименованиеАкции");
	ИменаПолей.Добавить("ОписаниеАкции");	
	ИменаПолей.Добавить("ПроцентСкидки");
	//Мальцев А.Ю. ---
	
	Дерево = РеквизитФормыВЗначение("ДоступныеПоляКомпоновкиДанных");
	Дерево.Строки.Очистить();
	Для Каждого ИмяПоля Из ИменаПолей Цикл
		ДобавитьПоле(КомпоновщикНастроек.Настройки.Порядок.ДоступныеПоляПорядка.Элементы, ИмяПоля, Дерево);
	КонецЦикла;
	ЗначениеВДанныеФормы(Дерево, ДоступныеПоляКомпоновкиДанных);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРазмер(ШиринаОбластиВМиллиметрах, ВысотаОбластиВМиллиметрах, РазмерЯчейкиВМиллиметрах)
	
	ЭталонРазмеров = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("ЭталонРазмерыЯчеек");
	Картинка = ЭталонРазмеров.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	Картинка.Расположить(ЭталонРазмеров.Область("R1C1:R100C100"));
	ВысотаКартинкиВМиллиметрах = Картинка.Высота;
	ШиринаКартинкиВМиллиметрах = Картинка.Ширина;
	
	ВысотаВМиллиметрахЯчейкиВысотой0_25  = ВысотаКартинкиВМиллиметрах / 100;
	ШиринаВМиллиметрахЯчейкиШириной0_125 = (ШиринаКартинкиВМиллиметрах / 100) / 4;
	
	МинимальныйШагУстановкиШирины = 0.125;
	МинимальныйШагУстановкиВысоты = 0.25;
	
	КоличествоШаговВМиллиметреПоВысоте = 0;
	Пока КоличествоШаговВМиллиметреПоВысоте * ВысотаВМиллиметрахЯчейкиВысотой0_25 < 1 Цикл
		КоличествоШаговВМиллиметреПоВысоте = КоличествоШаговВМиллиметреПоВысоте + 1;
	КонецЦикла;
	КоличествоШаговВМиллиметреПоВысоте = КоличествоШаговВМиллиметреПоВысоте - 1;
	
	КоличествоШаговВМиллиметреПоШирине = 0;
	Пока КоличествоШаговВМиллиметреПоШирине * ШиринаВМиллиметрахЯчейкиШириной0_125 < 1 Цикл
		КоличествоШаговВМиллиметреПоШирине = КоличествоШаговВМиллиметреПоШирине + 1;
	КонецЦикла;
	КоличествоШаговВМиллиметреПоШирине = КоличествоШаговВМиллиметреПоШирине - 1;
	
	ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел;
	ПолеТабличногоДокумента.Очистить();
	
	КоличествоЯчеекПоШирине = Цел(ШиринаОбластиВМиллиметрах / РазмерЯчейкиВМиллиметрах);
	КоличествоЯчеекПоВысоте = Цел(ВысотаОбластиВМиллиметрах / РазмерЯчейкиВМиллиметрах);
	
	ШиринаДокумента = 1 + КоличествоЯчеекПоШирине;
	ВысотаДокумента = 1 + КоличествоЯчеекПоВысоте;
	
	Для НомерКолонки = 2 По ШиринаДокумента Цикл
		// Минимальный шаг установки ширины = 0.125
		// 1 ячейка при ширине 0.5 занимает 0,97 мм.
		ИмяОбласти = "C" + НомерКолонки;
		ПолеТабличногоДокумента.Область(ИмяОбласти).ШиринаКолонки = (МинимальныйШагУстановкиШирины * КоличествоШаговВМиллиметреПоШирине) * РазмерЯчейкиВМиллиметрах;
	КонецЦикла;
	
	Для НомерСтроки = 2 По ВысотаДокумента Цикл
		// Минимальный шаг установки высоты = 0.25
		// 1 ячейка при ширине 2.75 занимает 0,97 мм.
		ИмяОбласти = "R" + НомерСтроки;
		ПолеТабличногоДокумента.Область(ИмяОбласти).АвтоВысотаСтроки = Ложь;
		ПолеТабличногоДокумента.Область(ИмяОбласти).ВысотаСтроки = (МинимальныйШагУстановкиВысоты * КоличествоШаговВМиллиметреПоВысоте) * РазмерЯчейкиВМиллиметрах;
	КонецЦикла;

	ИмяОбластиПечати = "R2C2"+":"+"R"+Формат(ВысотаДокумента,"ЧГ=0")+"C"+Формат(ШиринаДокумента,"ЧГ=0");
	ПолеТабличногоДокумента.Область("R1C1:"+"R"+200+"C"+200).ЦветФона = WebЦвета.Серый;
	ПолеТабличногоДокумента.Область(ИмяОбластиПечати).ЦветФона = Новый Цвет;
	УстановитьОбластьПечатиНаСервере(ИмяОбластиПечати);
	
	ИндексКартинки = ВставитьРисунокШтрихкода(ИмяОбластиПечати);
	ФактическаяШиринаВМиллиметрах = ПолеТабличногоДокумента.Рисунки[ИндексКартинки].Ширина;
	ФактическаяВысотаВМиллиметрах = ПолеТабличногоДокумента.Рисунки[ИндексКартинки].Высота;
	
	// Выполним подгонку для более точного соответствия реальным значениям.
	НедостающаяШиринаВМиллиметрах = ШиринаОбластиВМиллиметрах - ФактическаяШиринаВМиллиметрах;
	КоличествоЯчеекДляИзмененияШирины = Цел(НедостающаяШиринаВМиллиметрах / ((ФактическаяШиринаВМиллиметрах/ШиринаОбластиВМиллиметрах) / КоличествоШаговВМиллиметреПоШирине));
	
	Коэффициент = 1;
	КоличествоИзмененныхЯчеек = 0;
	Пока КоличествоЯчеекДляИзмененияШирины > 0 Цикл // -1 для того что бы не превысить реальные требуемые значения
		
		НомерКолонки = ГенераторСлучайныхЧисел.СлучайноеЧисло(2, ШиринаДокумента);
		ИмяОбласти = "C" + НомерКолонки;
		Если ПолеТабличногоДокумента.Область(ИмяОбласти).ШиринаКолонки = (МинимальныйШагУстановкиШирины * КоличествоШаговВМиллиметреПоШирине) * РазмерЯчейкиВМиллиметрах + МинимальныйШагУстановкиШирины * (Коэффициент - 1) Тогда
			ПолеТабличногоДокумента.Область(ИмяОбласти).ШиринаКолонки = (МинимальныйШагУстановкиШирины * КоличествоШаговВМиллиметреПоШирине) * РазмерЯчейкиВМиллиметрах + МинимальныйШагУстановкиШирины * Коэффициент;
			КоличествоЯчеекДляИзмененияШирины = КоличествоЯчеекДляИзмененияШирины - 1;
			
			КоличествоИзмененныхЯчеек = КоличествоИзмененныхЯчеек + 1;
		КонецЕсли;
		
		Если КоличествоИзмененныхЯчеек = КоличествоЯчеекПоШирине Тогда
			КоличествоИзмененныхЯчеек = 0;
			Коэффициент = Коэффициент + 1;
		КонецЕсли;
		
		Если КоличествоЯчеекДляИзмененияШирины = 0 Тогда
			ФактическаяШиринаВМиллиметрах = ПолеТабличногоДокумента.Рисунки[ИндексКартинки].Ширина;
			НедостающаяШиринаВМиллиметрах = ШиринаОбластиВМиллиметрах - ФактическаяШиринаВМиллиметрах;
			КоличествоЯчеекДляИзмененияШирины = Цел(НедостающаяШиринаВМиллиметрах / ((ФактическаяШиринаВМиллиметрах/ШиринаОбластиВМиллиметрах) / КоличествоШаговВМиллиметреПоШирине));
		КонецЕсли;
		
	КонецЦикла;
	
	// Выполним подгонку для более точного соответствия реальным значениям.
	НедостающаяВысотаВМиллиметрах = ВысотаОбластиВМиллиметрах - ФактическаяВысотаВМиллиметрах;
	КоличествоЯчеекДляИзмененияВысоты = Цел(НедостающаяВысотаВМиллиметрах / ((ФактическаяВысотаВМиллиметрах/ВысотаОбластиВМиллиметрах) / КоличествоШаговВМиллиметреПоВысоте));
	
	Коэффициент = 1;
	КоличествоИзмененныхЯчеек = 0;
	Пока КоличествоЯчеекДляИзмененияВысоты > 0 Цикл // -1 для того что бы не превысить реальные требуемые значения
		
		НомерСтроки = ГенераторСлучайныхЧисел.СлучайноеЧисло(2, ВысотаДокумента);
		ИмяОбласти = "R" + НомерСтроки;
		Если ПолеТабличногоДокумента.Область(ИмяОбласти).ВысотаСтроки = (МинимальныйШагУстановкиВысоты * КоличествоШаговВМиллиметреПоВысоте) * РазмерЯчейкиВМиллиметрах + МинимальныйШагУстановкиВысоты * (Коэффициент - 1) Тогда
			ПолеТабличногоДокумента.Область(ИмяОбласти).ВысотаСтроки = (МинимальныйШагУстановкиВысоты * КоличествоШаговВМиллиметреПоВысоте) * РазмерЯчейкиВМиллиметрах + МинимальныйШагУстановкиВысоты * Коэффициент;
			КоличествоЯчеекДляИзмененияВысоты = КоличествоЯчеекДляИзмененияВысоты - 1;
			
			КоличествоИзмененныхЯчеек = КоличествоИзмененныхЯчеек + 1;
		КонецЕсли;
		
		Если КоличествоИзмененныхЯчеек = КоличествоЯчеекПоВысоте Тогда
			КоличествоИзмененныхЯчеек = 0;
			Коэффициент = Коэффициент + 1;
		КонецЕсли;
		
		Если КоличествоЯчеекДляИзмененияВысоты = 0 Тогда
			ФактическаяВысотаВМиллиметрах = ПолеТабличногоДокумента.Рисунки[ИндексКартинки].Высота;
			НедостающаяВысотаВМиллиметрах = ВысотаОбластиВМиллиметрах - ФактическаяВысотаВМиллиметрах;
			КоличествоЯчеекДляИзмененияВысоты = Цел(НедостающаяВысотаВМиллиметрах / ((ФактическаяВысотаВМиллиметрах/ВысотаОбластиВМиллиметрах) / КоличествоШаговВМиллиметреПоВысоте));
		КонецЕсли;
		
	КонецЦикла;
	
	ПолеТабличногоДокумента.Рисунки.Удалить(ПолеТабличногоДокумента.Рисунки[ИндексКартинки]);
	
	РассчитатьМаксимальноеКоличествоНаСтранице();
	
КонецПроцедуры

&НаСервере
Функция ДополнитьПараметрыДляПечатиОбразца(ПараметрыПечати)
	
	ПараметрыПечати.Вставить("СтруктураМакетаШаблона", ПодготовитьСтруктуруМакетаШаблона());
	
	Возврат ПараметрыПечати;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыДляПечатиОбразцаЭтикеткиТовара()
	
	ПараметрыПечати = Справочники.ШаблоныЭтикетокИЦенников.ПолучитьПараметрыДляПечатиОбразцаЭтикеткиТовара(ТипКода, УникальныйИдентификатор);
	Возврат ДополнитьПараметрыДляПечатиОбразца(ПараметрыПечати);
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыДляПечатиОбразцаЦенникаТовара()
	
	ПараметрыПечати = Справочники.ШаблоныЭтикетокИЦенников.ПолучитьПараметрыДляПечатиОбразцаЦенникаТовара(ТипКода, УникальныйИдентификатор);
	Возврат ДополнитьПараметрыДляПечатиОбразца(ПараметрыПечати);
	
КонецФункции

&НаКлиенте
Процедура ПолеТабличногоДокументаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)
	
	СтандартнаяОбработка = Ложь;
	
	//Мальцев А.Ю. +++
	//ПодставитьПолеШаблона(Область, Элементы.ДоступныеПоляКомпоновкиДанных.ТекущаяСтрока);

	ТекСтрока = Элементы.ДоступныеПоляКомпоновкиДанных.ТекущаяСтрока;
	Если ТекСтрока <> НЕОПРЕДЕЛЕНО Тогда
		ПодставитьПолеШаблона(Область, ТекСтрока);
	КонецЕсли;

	пТекСтрока = Элементы.ПользовательскиеПоля.ТекущаяСтрока;
	Если ТекСтрока = НЕОПРЕДЕЛЕНО И пТекСтрока <> НЕОПРЕДЕЛЕНО Тогда
		ПодставитьПолеШаблона(Область, пТекСтрока, Истина);
	КонецЕсли;

	//Мальцев А.Ю. --
	
КонецПроцедуры

&НаКлиенте
Функция ПредставлениеЛинии(Линия)
	
	Возврат Строка(Линия.ТипЛинии) + ", " + Строка(?(Линия.Толщина=0,1,Линия.Толщина));
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицуСвойств()
	
	ВыделеннаяОбласть = ПолеТабличногоДокумента.ТекущаяОбласть;
	СвойстваЯчеек.Очистить();
	
	Если ТипЗнч(ВыделеннаяОбласть) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "Разделитель";
		НоваяСтрока.Представление = "Оформление";
		НоваяСтрока.Значение = "Разделитель";
		
		// Шрифт и цвет
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "Шрифт";
		НоваяСтрока.Представление = "Шрифт";
		НоваяСтрока.Значение = ВыделеннаяОбласть.Шрифт;
		
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "ЦветФона";
		НоваяСтрока.Представление = НСтр("ru = 'Цвет фона'");
		НоваяСтрока.Значение = ВыделеннаяОбласть.ЦветФона;
		
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "ЦветТекста";
		НоваяСтрока.Представление = НСтр("ru = 'Цвет текста'");
		НоваяСтрока.Значение = ВыделеннаяОбласть.ЦветТекста;
		
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "ОриентацияТекста";
		НоваяСтрока.Представление = НСтр("ru = 'Ориентация текста'");
		НоваяСтрока.Значение = ВыделеннаяОбласть.ОриентацияТекста;
		
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "Разделитель";
		НоваяСтрока.Представление = "Границы";
		НоваяСтрока.Значение = "Разделитель";
		
		// Границы
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "ГраницаСлева";
		НоваяСтрока.Представление = НСтр("ru = 'Граница слева'");
		Если ВыделеннаяОбласть.ГраницаСлева <> Неопределено Тогда	
			НоваяСтрока.Значение = ПредставлениеЛинии(ВыделеннаяОбласть.ГраницаСлева);
		Иначе
			НоваяСтрока.Значение = НСтр("ru = 'Нет линии, 1'");
		КонецЕсли;
		
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "ГраницаСверху";
		НоваяСтрока.Представление = НСтр("ru = 'Граница сверху'");
		Если ВыделеннаяОбласть.ГраницаСверху <> Неопределено Тогда
			НоваяСтрока.Значение = ПредставлениеЛинии(ВыделеннаяОбласть.ГраницаСверху);
		Иначе
			НоваяСтрока.Значение = НСтр("ru = 'Нет линии, 1'");
		КонецЕсли;
				
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "ГраницаСправа";
		НоваяСтрока.Представление = НСтр("ru = 'Граница справа'");
		Если ВыделеннаяОбласть.ГраницаСправа <> Неопределено Тогда
			НоваяСтрока.Значение = ПредставлениеЛинии(ВыделеннаяОбласть.ГраницаСправа);	
		Иначе
			НоваяСтрока.Значение = НСтр("ru = 'Нет линии, 1'");
		КонецЕсли;
	
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "ГраницаСнизу";
		НоваяСтрока.Представление = НСтр("ru = 'Граница снизу'");
		Если ВыделеннаяОбласть.ГраницаСнизу <> Неопределено Тогда 
			НоваяСтрока.Значение = ПредставлениеЛинии(ВыделеннаяОбласть.ГраницаСнизу);
		Иначе
			НоваяСтрока.Значение = НСтр("ru = 'Нет линии, 1'");
		КонецЕсли;
		  	
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "Разделитель";
		НоваяСтрока.Представление = "Заполнение";
		НоваяСтрока.Значение = "Разделитель";
		
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "Формат";
		НоваяСтрока.Представление = "Формат";
		НоваяСтрока.Значение = ВыделеннаяОбласть.Формат;
		
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "Заполнение";
		НоваяСтрока.Представление = "Заполнение";
		НоваяСтрока.Значение = ВыделеннаяОбласть.Заполнение;
		
		Если ВыделеннаяОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр Тогда
			НоваяСтрока = СвойстваЯчеек.Добавить();
			НоваяСтрока.ИмяСвойства = "Параметр";
			НоваяСтрока.Представление = "Параметр";
			НоваяСтрока.Значение = ВыделеннаяОбласть.Параметр;
			Если НоваяСтрока.Значение = Неопределено Тогда
				НоваяСтрока.Значение = "";
			КонецЕсли;
		Иначе
			НоваяСтрока = СвойстваЯчеек.Добавить();
			НоваяСтрока.ИмяСвойства = "Текст";
			НоваяСтрока.Представление = "Текст";
			НоваяСтрока.Значение = ВыделеннаяОбласть.Текст;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ВыделеннаяОбласть) = Тип("РисунокТабличногоДокумента") Тогда
		
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "Разделитель";
		НоваяСтрока.Представление = НСтр("ru = 'Параметры штрихкода'");
		НоваяСтрока.Значение = "Разделитель";
		
		Если СтрНайти(ВыделеннаяОбласть.Имя, "Штрихкод") > 0 Тогда
			
			НоваяСтрока = СвойстваЯчеек.Добавить();
			НоваяСтрока.ИмяСвойства = "ТипКода";
			НоваяСтрока.Представление = НСтр("ru = 'Тип кода'");
			
			ЭлементСписка = СписокТипыКодов.НайтиПоЗначению(ТипКода);
			НоваяСтрока.Значение = ЭлементСписка.Представление;
			
			НоваяСтрока = СвойстваЯчеек.Добавить();
			НоваяСтрока.ИмяСвойства = "РазмерШрифта";
			НоваяСтрока.Представление = НСтр("ru = 'Размер шрифта'");
			НоваяСтрока.Значение = РазмерШрифта;
			
			НоваяСтрока = СвойстваЯчеек.Добавить();
			НоваяСтрока.ИмяСвойства = "ОтображатьТекст";
			НоваяСтрока.Представление = НСтр("ru = 'Отображать текст'");
			НоваяСтрока.Значение = ОтображатьТекст;
			
			НоваяСтрока = СвойстваЯчеек.Добавить();
			НоваяСтрока.ИмяСвойства = "УголПоворота";
			НоваяСтрока.Представление = НСтр("ru = 'Угол поворота'");
			НоваяСтрока.Значение = УголПоворота;
			
		КонецЕсли;
		
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "Имя";
		НоваяСтрока.Представление = "Имя";
		НоваяСтрока.Значение = ВыделеннаяОбласть.Имя;
		
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "Высота";
		НоваяСтрока.Представление = "Высота";
		НоваяСтрока.Значение = ВыделеннаяОбласть.Высота;
		
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "Ширина";
		НоваяСтрока.Представление = "Ширина";
		НоваяСтрока.Значение = ВыделеннаяОбласть.Ширина;
		
		НоваяСтрока = СвойстваЯчеек.Добавить();
		НоваяСтрока.ИмяСвойства = "Линия";
		НоваяСтрока.Представление = "Линия";
		НоваяСтрока.Значение = ПредставлениеЛинии(ВыделеннаяОбласть.Линия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПредопределенныхШаблонов()
	
	Если Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров Тогда
		ПризнакПредопределенногоМакета = ВРег("Товары");
		ТипШаблона = "Ценника";
	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров Тогда
		ТипШаблона = "Этикетки";
		ПризнакПредопределенногоМакета = ВРег("Товары");
	КонецЕсли;
	ЭтотОбъект.СписокПредопределенныхШаблонов.Очистить();
	ДлинаПризнакаПредопределенногоМакета = СтрДлина(ПризнакПредопределенногоМакета);
	Для каждого Макет Из Метаданные.НайтиПоТипу(Тип("СправочникСсылка.ШаблоныЭтикетокИЦенников")).Макеты Цикл
		Если Макет.ТипМакета = Метаданные.СвойстваОбъектов.ТипМакета.ТабличныйДокумент Тогда
			Если ВРег(Прав(Макет.Имя, ДлинаПризнакаПредопределенногоМакета)) = ПризнакПредопределенногоМакета Тогда
				Если СтрНайти(Макет.Имя, ТипШаблона) > 0 Тогда
					ЭтотОбъект.СписокПредопределенныхШаблонов.Добавить(Макет.Имя, Макет.Синоним);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеТабличногоДокументаПриАктивизацииОбласти(Элемент)
	
	ПодключитьОбработчикОжидания("ЗаполнитьТаблицуСвойств", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЛинию(ВыделеннаяОбласть, ТекущиеДанные)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипЛинии", ?(ТипЗнч(ВыделеннаяОбласть[ТекущиеДанные.ИмяСвойства]) = Тип("Неопределено"), ТипЛинииЯчейкиТабличногоДокумента.НетЛинии ,ВыделеннаяОбласть[ТекущиеДанные.ИмяСвойства].ТипЛинии));
	ПараметрыФормы.Вставить("Толщина",  ?(ТипЗнч(ВыделеннаяОбласть[ТекущиеДанные.ИмяСвойства]) = Тип("Неопределено"), 1 ,ВыделеннаяОбласть[ТекущиеДанные.ИмяСвойства].Толщина));
	
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("КомандаОповещения","КомандаВыбораТипаЛинии");
	ПараметрыВызова.Вставить("ВыделеннаяОбласть",ВыделеннаяОбласть);
	ПараметрыВызова.Вставить("ТекущиеДанные",ТекущиеДанные);
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения",ЭтотОбъект,ПараметрыВызова);
	ОткрытьФорму("Справочник.ШаблоныЭтикетокИЦенников.Форма.ФормаВыбораТипаЛинии",ПараметрыФормы,ЭтотОбъект,,,,Оповещение);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекущийРазмерСтраницы(Форма)
	
	ТекущийРазмер = 
	  "ПолеСверху:" + Форма.ПолеТабличногоДокумента.ПолеСверху
	+ "ПолеСнизу:" + Форма.ПолеТабличногоДокумента.ПолеСнизу
	+ "ПолеСлева:" + Форма.ПолеТабличногоДокумента.ПолеСлева
	+ "ПолеСправа:" + Форма.ПолеТабличногоДокумента.ПолеСправа
	+ "Размер:" + РазмерСтраницы(Форма.ПолеТабличногоДокумента);
	
	Возврат ТекущийРазмер;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьРазмещение()
	
	ТекущийРазмер = ТекущийРазмерСтраницы(ЭтотОбъект);
	
	Если ТекущийРазмер <> РазмерСтраницы Тогда
		РазмерСтраницы = ТекущийРазмер;
		РассчитатьМаксимальноеКоличествоНаСтранице();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодставитьПолеШаблона(Область, ВыбраннаяСтрока, ПользовательскоеПоле = Ложь)
	
	// Перед началом добавления необходимо выделить область в табличном документе.
	Если ТипЗнч(Область) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Для переноса поля шаблона нужно выделить ячейку или область ячеек.'"));
		Возврат;
	Иначе
		ТекущаяОбласть = Область;
		ОбъединитьОбласть(ТекущаяОбласть.Имя);
	КонецЕсли;

	// Подготовка данных.
	Если Не ПользовательскоеПоле Тогда
		ИмяПоляВШаблоне = Строка(ДоступныеПоляКомпоновкиДанных.НайтиПоИдентификатору(ВыбраннаяСтрока).ПолеКомпоновкиДанных);
	Иначе
		ИмяПоляВШаблоне = Строка(Объект.ПользовательскиеПоля.НайтиПоИдентификатору(ВыбраннаяСтрока).Поле);
	КонецЕсли;
	
	//Мальцев А.Ю. +++
	Если ИмяПоляВШаблоне = "ЦенаДоАкции" Тогда
		ТекущаяОбласть.Имя    = ИмяПоляВШаблоне;
	КонецЕсли;
	//Мальцев А.Ю. ---
	
	// Размещение поля в шаблоне.
	Если ИмяПоляВШаблоне = ИмяПараметраШтрихкод() Тогда
		
		ПараметрыВызова = Новый Структура;
		ПараметрыВызова.Вставить("КомандаОповещения","КомандаВопросДобавитьШтрихкод");
		ПараметрыВызова.Вставить("ТекущаяОбласть",ТекущаяОбласть);
		ПараметрыВызова.Вставить("ИмяПоляВШаблоне",ИмяПоляВШаблоне);
		
		ТекстВопроса = НСтр("ru = 'Добавить штрихкод, как картинку?'");
		ОповещениеЗаписи = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения",ЭтотОбъект,ПараметрыВызова);
		ПоказатьВопрос(ОповещениеЗаписи,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ТекущаяОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Шаблон;
		Если ЗначениеЗаполнено(ТекущаяОбласть.Текст) Тогда 
			ТекущаяОбласть.Текст = ТекущаяОбласть.Текст + "["+ИмяПоляВШаблоне+"]";
		Иначе 
			ТекущаяОбласть.Текст = "["+ИмяПоляВШаблоне+"]";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДоступногоПоля(ВыбраннаяСтрока)
	
	ПодставитьПолеШаблона(ПолеТабличногоДокумента.ТекущаяОбласть, ВыбраннаяСтрока);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Объединить(Команда)
	
	Если ПолеТабличногоДокумента.ВыделенныеОбласти.Количество() = 1
		И ТипЗнч(ПолеТабличногоДокумента.ВыделенныеОбласти[0]) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		
		ТекущаяОбласть = ПолеТабличногоДокумента.ТекущаяОбласть;
		ОбъединитьОбласть(ТекущаяОбласть.Имя);
		
	Иначе
		
		ОчиститьСообщения();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Некорректная область.'");
		Сообщение.Поле = "ПолеТабличногоДокумента";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Разъединить(Команда)
	
	Если ПолеТабличногоДокумента.ВыделенныеОбласти.Количество() = 1
		И ТипЗнч(ПолеТабличногоДокумента.ВыделенныеОбласти[0]) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		
		ТекущаяОбласть = ПолеТабличногоДокумента.ТекущаяОбласть;
		РазъединитьОбласть(ТекущаяОбласть.Имя);
		
	Иначе
		
		ОчиститьСообщения();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Некорректная область.'");
		Сообщение.Поле = "ПолеТабличногоДокумента";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущаяСтрока = Элементы.ДоступныеПоляКомпоновкиДанных.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда
		ВыборДоступногоПоля(ТекущаяСтрока);
	КонецЕсли;
	
	//Мальцев А.Ю. +++
	пТекущаяСтрока = Элементы.ДоступныеПоляКомпоновкиДанных.ТекущаяСтрока;
	Если ТекущаяСтрока = НЕОПРЕДЕЛЕНО И пТекущаяСтрока <> Неопределено Тогда
		ПодставитьПолеШаблона(ПолеТабличногоДокумента.ТекущаяОбласть, пТекущаяСтрока, Истина);
	КонецЕсли;
	
	//Мальцев А.Ю. ---
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбластьПечати(Команда)
	
	Если (ПолеТабличногоДокумента.ВыделенныеОбласти[0].Лево <> 0 И ПолеТабличногоДокумента.ВыделенныеОбласти[0].Верх <> 0)
		И ПолеТабличногоДокумента.ВыделенныеОбласти.Количество() = 1
		И ТипЗнч(ПолеТабличногоДокумента.ВыделенныеОбласти[0]) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		
		УстановитьОбластьПечатиНаСервере(ПолеТабличногоДокумента.ВыделенныеОбласти[0].Имя);
		
	Иначе
		
		ОчиститьСообщения();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Некорректная область печати'");
		Сообщение.Поле = "ПолеТабличногоДокумента";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьОбразец(Команда)
	
	ОчиститьСообщения();
		
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	
	Если Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров") Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Обработка.ПечатьЭтикетокИЦенников",
			"ЦенникТовары",
			ПараметрКоманды,
			Неопределено,
			ПолучитьПараметрыДляПечатиОбразцаЦенникаТовара());
		
	ИначеЕсли Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров") Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Обработка.ПечатьЭтикетокИЦенников",
			"ЭтикеткаТовары",
			ПараметрКоманды,
			Неопределено, 
			ПолучитьПараметрыДляПечатиОбразцаЭтикеткиТовара());
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыравниваниеВертикальноеВерх(Команда)
	
	Если ТипЗнч(ПолеТабличногоДокумента.ТекущаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Операция может быть выполнена только над ячейкой табличного документа.'"));
		Возврат;
	КонецЕсли;
	
	ПолеТабличногоДокумента.ТекущаяОбласть.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыравниваниеВертикальноеЦентр(Команда)
	
	Если ТипЗнч(ПолеТабличногоДокумента.ТекущаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Операция может быть выполнена только над ячейкой табличного документа.'"));
		Возврат;
	КонецЕсли;
	
	ПолеТабличногоДокумента.ТекущаяОбласть.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыравниваниеВертикальноеНиз(Команда)
	
	Если ТипЗнч(ПолеТабличногоДокумента.ТекущаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Операция может быть выполнена только над ячейкой табличного документа.'"));
		Возврат;
	КонецЕсли;
	
	ПолеТабличногоДокумента.ТекущаяОбласть.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыравниваниеГоризонтальноеЛево(Команда)
	
	Если ТипЗнч(ПолеТабличногоДокумента.ТекущаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Операция может быть выполнена только над ячейкой табличного документа.'"));
		Возврат;
	КонецЕсли;
	
	ПолеТабличногоДокумента.ТекущаяОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыравниваниеГоризонтальноеЦентр(Команда)
	
	Если ТипЗнч(ПолеТабличногоДокумента.ТекущаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Операция может быть выполнена только над ячейкой табличного документа.'"));
		Возврат;
	КонецЕсли;
	
	ПолеТабличногоДокумента.ТекущаяОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыравниваниеГоризонтальноеПраво(Команда)
	
	Если ТипЗнч(ПолеТабличногоДокумента.ТекущаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Операция может быть выполнена только над ячейкой табличного документа.'"));
		Возврат;
	КонецЕсли;
	
	ПолеТабличногоДокумента.ТекущаяОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	
КонецПроцедуры

&НаКлиенте
Процедура Назначить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ТекстВопроса = НСтр("ru = 'Перед выполнением операции элемент необходимо записать. Выполнить запись элемента и продолжить?'");
		ОповещениеЗаписи = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения",ЭтотОбъект,"КомандаЗаписи");
		ПоказатьВопрос(ОповещениеЗаписи,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	Иначе 
		НазначениеШаблонаТипаНоменклатуры();
	КонецЕсли; 		
				
КонецПроцедуры

&НаКлиенте
Процедура НазначениеШаблонаТипаНоменклатуры()
	
	ОповещениеЗаписи = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения",ЭтотОбъект,"КомандаВыбораТипаНоменклатуры");
	ОткрытьФорму("Справочник.ТипыНоменклатуры.ФормаВыбора",Новый Структура("РежимВыбора", Истина),ЭтотОбъект,,,,ОповещениеЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура НазначитьНаСервере(ТипНоменклатуры, ШаблонЭЦ, Назначение)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров Тогда
		ОбъектТип = ТипНоменклатуры.ПолучитьОбъект();
		ОбъектТип.ШаблонЦенника = ШаблонЭЦ;
		ОбъектТип.Записать();		
	ИначеЕсли Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров Тогда
		ОбъектТип = ТипНоменклатуры.ПолучитьОбъект();
		ОбъектТип.ШаблонЭтикетки = ШаблонЭЦ;
		ОбъектТип.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры = "КомандаЗаписи" Тогда 
		Если РезультатОповещения = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
		Если ПроверитьЗаполнение() Тогда
			Если Не Записать() Тогда
				Возврат;
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;
		НазначениеШаблонаТипаНоменклатуры();
		Возврат;
	ИначеЕсли ДополнительныеПараметры = "КомандаВыбораТипаНоменклатуры" Тогда
		Если ЗначениеЗаполнено(РезультатОповещения) Тогда 
			ТекстВопроса = НСтр("ru = 'Текущий шаблон будет установлен как шаблон по умолчанию для типа номенклатуры """+РезультатОповещения+""".
			                           |Продолжить?'");			   
			ПараметрыВызова = Новый Структура;
			ПараметрыВызова.Вставить("КомандаОповещения","КомандаЗаписиШаблонаВТип");
			ПараметрыВызова.Вставить("ТипНоменклатуры",РезультатОповещения);
			ОповещениеЗаписи = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения",ЭтотОбъект,ПараметрыВызова);
			ПоказатьВопрос(ОповещениеЗаписи,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		Возврат;
		
	ИначеЕсли ДополнительныеПараметры.Свойство("КомандаОповещения") И ДополнительныеПараметры.КомандаОповещения = "КомандаВыбораШаблона" Тогда
		Если РезультатОповещения <> Неопределено И ЗначениеЗаполнено(РезультатОповещения.Значение) Тогда
			ТекстВопроса = НСтр("ru = 'Редактируемый шаблон будет заменен на шаблон по умолчанию, продолжить?'");
			ПараметрыВызова = Новый Структура;
			ПараметрыВызова.Вставить("КомандаОповещения","КомандаВыбратьШаблон");
			ПараметрыВызова.Вставить("ИмяШаблона",РезультатОповещения.Значение);
			ОповещениеЗаписи = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения",ЭтотОбъект,ПараметрыВызова);
			ПоказатьВопрос(ОповещениеЗаписи,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	    Возврат;
			
	ИначеЕсли ДополнительныеПараметры.Свойство("КомандаОповещения") И ДополнительныеПараметры.КомандаОповещения = "КомандаВопросДобавитьШтрихкод" Тогда
		Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
			ВставитьРисунокШтрихкода(ДополнительныеПараметры.ТекущаяОбласть.Имя);
		Иначе                                                    
			ДополнительныеПараметры.ТекущаяОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Шаблон;
			ДополнительныеПараметры.ТекущаяОбласть.Текст = ДополнительныеПараметры.ТекущаяОбласть.Текст + "["+ДополнительныеПараметры.ИмяПоляВШаблоне+"]";
		КонецЕсли;
		Возврат;
	
	ИначеЕсли ДополнительныеПараметры.Свойство("КомандаОповещения") И ДополнительныеПараметры.КомандаОповещения = "КомандаВыбораТипаЛинии" Тогда
		Если РезультатОповещения <> Неопределено Тогда
			ДополнительныеПараметры.ВыделеннаяОбласть[ДополнительныеПараметры.ТекущиеДанные.ИмяСвойства] = Новый Линия(РезультатОповещения.ТипЛинии, РезультатОповещения.Толщина);
			ЗаполнитьТаблицуСвойств();
		КонецЕсли;
		Возврат;
	
	ИначеЕсли ДополнительныеПараметры.Свойство("КомандаОповещения") И ДополнительныеПараметры.КомандаОповещения = "КомандаЗаписиШаблонаВТип" Тогда
		Если РезультатОповещения = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		НазначитьНаСервере(ДополнительныеПараметры.ТипНоменклатуры, Объект.Ссылка, Объект.Назначение); 
		Возврат;	
			
	ИначеЕсли ДополнительныеПараметры.Свойство("КомандаОповещения") И ДополнительныеПараметры.КомандаОповещения = "КомандаВыбратьШаблон" Тогда
		Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
			УстановитьШаблонПоУмолчанию(ДополнительныеПараметры.ИмяШаблона);
		КонецЕсли;
		Возврат;
		
	ИначеЕсли ДополнительныеПараметры.Свойство("КомандаОповещения") И ДополнительныеПараметры.КомандаОповещения = "КомандаКонструкторФорматнойСтроки" Тогда
		Если ЗначениеЗаполнено(РезультатОповещения) Тогда
			ДополнительныеПараметры.ТекущиеДанные.Значение = ДополнительныеПараметры.Конструктор.Текст;
			ДополнительныеПараметры.ВыделеннаяОбласть.Формат = ДополнительныеПараметры.Конструктор.Текст;
		КонецЕсли;
		Возврат;
		
	ИначеЕсли ДополнительныеПараметры.Свойство("КомандаОповещения") И ДополнительныеПараметры.КомандаОповещения = "КомандаВыбратьИзСписка" Тогда
		Если РезультатОповещения <> Неопределено Тогда
			ДополнительныеПараметры.ТекущиеДанные.Значение = Строка(РезультатОповещения.Значение);
			ДополнительныеПараметры.ВыделеннаяОбласть.Заполнение = РезультатОповещения.Значение;
		КонецЕсли;
		ЗаполнитьТаблицуСвойств();
		Возврат;	
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
		
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

&НаКлиенте
Процедура ВыбратьШаблон(Команда)
	
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("КомандаОповещения","КомандаВыбораШаблона");
	СписокПредопределенныхШаблонов.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", 
		ЭтотОбъект,ПараметрыВызова), НСтр("ru = 'Выберите вариант шаблона'") + "...");
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Элементы.Назначение.СписокВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров);
	Элементы.Назначение.СписокВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ЗначениеКопирования = Неопределено;
		Параметры.Свойство("ЗначениеКопирования", ЗначениеКопирования);
		
		Если Не ЗначениеЗаполнено(ЗначениеКопирования) Тогда
			
			ИмяМакета = Параметры.ИмяМакета;
			Если ЗначениеЗаполнено(Параметры.Назначение) Тогда
				Объект.Назначение = Параметры.Назначение;
			КонецЕсли;
			Если ЗначениеЗаполнено(Параметры.Высота) Тогда
				Объект.Высота = Параметры.Высота;
			КонецЕсли;
			Если Параметры.Ширина > 0 Тогда
				Объект.Ширина = Параметры.Ширина;
			КонецЕсли;
			Если ЗначениеЗаполнено(Параметры.Наименование) Тогда
				Объект.Наименование = Параметры.Наименование;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ИмяМакета) Тогда
				УстановитьРазмер(Объект.Ширина, Объект.Высота, Объект.РазмерЯчейки);
			КонецЕсли;
			Если Параметры.Свойство("ФорматБумаги") И ЗначениеЗаполнено(Параметры.ФорматБумаги) Тогда
				Объект.РазмерБумаги = Параметры.ФорматБумаги;
			КонецЕсли;

			ЗаполнитьДоступныеПоля();
			НастроитьШаблон();
			
		Иначе
			
			ЗаполнитьДоступныеПоля();
			ЗагрузитьШаблон();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущийРазмер = ТекущийРазмерСтраницы(ЭтотОбъект);
	РазмерСтраницы = ТекущийРазмер;
	
	ОбновитьЗаголовок(ЭтотОбъект);
	НазначениеПриИзмененииСервер(Ложь);
	
	Коды = ПолучитьКоды();
	Для Каждого СтрокаТЧ Из Коды Цикл
		СписокТипыКодов.Добавить(СтрокаТЧ.ТипКода, СтрокаТЧ.Наименование);
	КонецЦикла;

	ЗаполнитьСписокПредопределенныхШаблонов();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОбновитьРазмещение", 1, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ШаблоныЭтикетокИЦенников", ПараметрыЗаписи, Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьДоступныеПоля();
	
	ЗагрузитьШаблон();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РассчитатьМаксимальноеКоличествоНаСтранице();
	
	Если НЕ ПроверитьРазмещение() Тогда
		Отказ = Истина;
	Иначе
		ТекущийОбъект.Шаблон = Новый ХранилищеЗначения(ПодготовитьСтруктуруМакетаШаблона());
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ОбновитьЗаголовок(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЭтотОбъект.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;

	Модифицированность = Истина;
	ВыборДоступногоПоля(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТекстПриИзменении(Элемент)
	Элементы.РазмерШрифта.Доступность = ОтображатьТекст;
КонецПроцедуры

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)
	
	ТипКода = 1; // EAN13
		
	НазначениеПриИзмененииСервер();
	
	Для Каждого Область Из ПолеТабличногоДокумента.Области Цикл
		
		Имя = Область.Имя;
		Индекс = ЗаменитьРисунокШтрихкода(Имя);
		ПолеТабличногоДокумента.Рисунки[Индекс].Имя = Имя;
		
	КонецЦикла;
	
	ЗаполнитьТаблицуСвойств();
	ЗаполнитьСписокПредопределенныхШаблонов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеТабличногоДокументаПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ШиринаПриИзменении(Элемент)
	УстановитьРазмер(Объект.Ширина, Объект.Высота, Объект.РазмерЯчейки);
КонецПроцедуры

&НаКлиенте
Процедура ВысотаПриИзменении(Элемент)
	УстановитьРазмер(Объект.Ширина, Объект.Высота, Объект.РазмерЯчейки);
КонецПроцедуры

&НаКлиенте
Процедура РазмерЯчейкиПриИзменении(Элемент)
	УстановитьРазмер(Объект.Ширина, Объект.Высота, Объект.РазмерЯчейки);
КонецПроцедуры

&НаКлиенте
Процедура ФорматБумагиПриИзменении(Элемент)
	РассчитатьМаксимальноеКоличествоНаСтранице();
КонецПроцедуры

&НаКлиенте
Процедура НазначениеОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СвойстваЯчеекЗначениеПриИзменении(Элемент)
	
	ВыделеннаяОбласть = ПолеТабличногоДокумента.ТекущаяОбласть;
	ТекущиеДанные = Элементы.СвойстваЯчеек.ТекущиеДанные;
	
	Если ТипЗнч(ВыделеннаяОбласть) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		ВыделеннаяОбласть[ТекущиеДанные.ИмяСвойства] = ТекущиеДанные.Значение;
		УстановитьТекущийЭлемент = Неопределено;
	ИначеЕсли ТипЗнч(ВыделеннаяОбласть) = Тип("РисунокТабличногоДокумента") Тогда
		
		Если ТекущиеДанные.ИмяСвойства = "ТипКода" Тогда
			
			Для Каждого КлючИЗначение Из СписокТипыКодов Цикл
				Представление = КлючИЗначение.Представление;
				Если ТекущиеДанные.Значение = Представление Тогда
					ТипКода = КлючИЗначение.Значение;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли ТекущиеДанные.ИмяСвойства = "РазмерШрифта" Тогда
			РазмерШрифта = ТекущиеДанные.Значение;
		ИначеЕсли ТекущиеДанные.ИмяСвойства = "УголПоворота" Тогда
			УголПоворота = ТекущиеДанные.Значение;
		ИначеЕсли ТекущиеДанные.ИмяСвойства = "ОтображатьТекст" Тогда
			ОтображатьТекст = ТекущиеДанные.Значение;
		Иначе
			ВыделеннаяОбласть[ТекущиеДанные.ИмяСвойства] = ТекущиеДанные.Значение;
		КонецЕсли;
		
		Имя = ВыделеннаяОбласть.Имя;
		Индекс = ЗаменитьРисунокШтрихкода(Имя);
		ПолеТабличногоДокумента.Рисунки[Индекс].Имя = Имя;
		
		ПодключитьОбработчикОжидания("ЗаполнитьТаблицуСвойств", 1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваЯчеекЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыделеннаяОбласть = ПолеТабличногоДокумента.ТекущаяОбласть;
	ТекущиеДанные = Элементы.СвойстваЯчеек.ТекущиеДанные;
	
	Если ТипЗнч(ВыделеннаяОбласть) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
	
		Если СтрНайти(ТекущиеДанные.ИмяСвойства, "Граница") > 0 Тогда
			
			СтандартнаяОбработка = Ложь;
			НастроитьЛинию(ВыделеннаяОбласть, ТекущиеДанные);
			
		КонецЕсли;
		
		Если СтрНайти(ТекущиеДанные.ИмяСвойства, "Формат") > 0 Тогда
			
			СтандартнаяОбработка = Ложь;
			Конструктор = Новый КонструкторФорматнойСтроки(ВыделеннаяОбласть.Формат);
			ПараметрыВызова = Новый Структура;
			ПараметрыВызова.Вставить("КомандаОповещения","КомандаКонструкторФорматнойСтроки");
			ПараметрыВызова.Вставить("ТекущиеДанные",ТекущиеДанные);
			ПараметрыВызова.Вставить("ВыделеннаяОбласть",ВыделеннаяОбласть);
			ПараметрыВызова.Вставить("Конструктор",Конструктор);

			Оповещение = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения",ЭтотОбъект,ПараметрыВызова);
			Конструктор.Показать(Оповещение);
						
		КонецЕсли;
		
		Если СтрНайти(ТекущиеДанные.ИмяСвойства, "Заполнение") > 0 Тогда
			
			СтандартнаяОбработка = Ложь;
			СписокЗначений = Новый СписокЗначений;
			СписокЗначений.Добавить(ТипЗаполненияОбластиТабличногоДокумента.Параметр);
			СписокЗначений.Добавить(ТипЗаполненияОбластиТабличногоДокумента.Текст);
			СписокЗначений.Добавить(ТипЗаполненияОбластиТабличногоДокумента.Шаблон);
			
			ПараметрыВызова = Новый Структура;
			ПараметрыВызова.Вставить("КомандаОповещения","КомандаВыбратьИзСписка");
			ПараметрыВызова.Вставить("ТекущиеДанные",ТекущиеДанные);
			ПараметрыВызова.Вставить("ВыделеннаяОбласть",ВыделеннаяОбласть);
			
			Оповещение = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения",ЭтотОбъект,ПараметрыВызова);
			ПоказатьВыборИзСписка(Оповещение, СписокЗначений);  
						
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ВыделеннаяОбласть) = Тип("РисунокТабличногоДокумента") Тогда
		
		Если СтрНайти(ТекущиеДанные.ИмяСвойства, "Линия") > 0 Тогда
			
			СтандартнаяОбработка = Ложь;
			НастроитьЛинию(ВыделеннаяОбласть, ТекущиеДанные);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваЯчеекПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СвойстваЯчеек.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СвойстваЯчеекЗначение.СписокВыбора.Очистить();
	
	ЭтоСтрокаСТипомКода = СтрНайти(ТекущиеДанные.ИмяСвойства, "ТипКода") > 0;
	ЭтоСтрокаГраница    = СтрНайти(ТекущиеДанные.ИмяСвойства, "Граница") > 0;
	ЭтоСтрокаЛиния      = СтрНайти(ТекущиеДанные.ИмяСвойства, "Линия")   > 0;
	
	Если ЭтоСтрокаСТипомКода Тогда
		
		Для Каждого ЭлементСписка Из СписокТипыКодов Цикл
			Элементы.СвойстваЯчеекЗначение.СписокВыбора.Добавить(ЭлементСписка.Представление);
		КонецЦикла;
		
		Элементы.СвойстваЯчеекЗначение.РежимВыбораИзСписка     = Истина;
		Элементы.СвойстваЯчеекЗначение.КнопкаВыпадающегоСписка = Ложь;
		
	Иначе
		
		Элементы.СвойстваЯчеекЗначение.РежимВыбораИзСписка     = Ложь;
		Элементы.СвойстваЯчеекЗначение.КнопкаВыпадающегоСписка = Ложь;
		
	КонецЕсли;
	
	Элементы.СвойстваЯчеекЗначение.РедактированиеТекста =  Не (ЭтоСтрокаГраница ИЛИ ЭтоСтрокаСТипомКода ИЛИ ЭтоСтрокаЛиния);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеПоляПриАктивизацииПоля(Элемент)
	Элементы.ДоступныеПоляКомпоновкиДанных.ТекущаяСтрока = НЕОПРЕДЕЛЕНО;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеПоляПриАктивизацииЯчейки(Элемент)
	Элементы.ДоступныеПоляКомпоновкиДанных.ТекущаяСтрока = НЕОПРЕДЕЛЕНО;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеПоляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//Если ЭтотОбъект.ТолькоПросмотр Тогда
	//	Возврат;
	//КонецЕсли;

	//Модифицированность = Истина;
	//ПодставитьПолеШаблона(ПолеТабличногоДокумента.ТекущаяОбласть, ВыбраннаяСтрока, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеПоляПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ТекСтрока  = Элементы.ДоступныеПоляКомпоновкиДанных.ТекущаяСтрока;
	пТекСтрока = Элементы.ПользовательскиеПоля.ТекущаяСтрока;
	
	Если ТекСтрока <> НЕОПРЕДЕЛЕНО И пТекСтрока <> НЕОПРЕДЕЛЕНО Тогда
		
	    а1=0;а2=0; а3=0; а4=0;    
	    Элементы.ПользовательскиеПоляВыражениеВычисления.ПолучитьГраницыВыделения(а1,а2,а3,а4); 
		
		ИмяПоляВШаблоне = Строка(ДоступныеПоляКомпоновкиДанных.НайтиПоИдентификатору(ТекСтрока).ПолеКомпоновкиДанных);
		//пТекСтрока.ПользовательскиеПоля.ВыражениеВычисления = пТекСтрока.ПользовательскиеПоляВыражениеВычисления + ИмяПоляВШаблоне;
		Объект.ПользовательскиеПоля.НайтиПоИдентификатору(пТекСтрока).ВыражениеВычисления = Объект.ПользовательскиеПоля.НайтиПоИдентификатору(пТекСтрока).ВыражениеВычисления + ИмяПоляВШаблоне;
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеПоляВыражениеВычисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьПанельРедактирования(Команда)
	
	Элементы.ГруппаТекстАлгоритма.Видимость = Не Элементы.ГруппаТекстАлгоритма.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляКомпоновкиДанныхНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	ТекущийИдентификаторСтроки = ПараметрыПеретаскивания.Значение[0];
КонецПроцедуры

&НаКлиенте
Процедура ТекстАлгоритмаПриИзменении(Элемент)
	Если ТекущийИдентификаторСтроки > 0 Тогда
		
		ТекстВычПоля      = "";
		НаименованиеКолонки = Строка(ДоступныеПоляКомпоновкиДанных.НайтиПоИдентификатору(ТекущийИдентификаторСтроки).ПолеКомпоновкиДанных);
		
		Если НаименованиеКолонки="ЦенаКопейки" Тогда
			ТекстВычПоля = "(СтрокаТовары.Цена-Цел(СтрокаТовары.Цена))*100";
		ИначеЕсли НаименованиеКолонки="ЦенаДоАкцииКопейки" Тогда
			ТекстВычПоля = "(СтрокаТовары.ЦенаДоАкции-Цел(СтрокаТовары.ЦенаДоАкции))*100";
		ИначеЕсли НаименованиеКолонки="ЦенаРубли" Тогда
			ТекстВычПоля = "Цел(СтрокаТовары.Цена)";
		ИначеЕсли НаименованиеКолонки="ЦенаДоАкцииРубли" Тогда
			ТекстВычПоля = "Цел(СтрокаТовары.ЦенаДоАкции)";
		ИначеЕсли НаименованиеКолонки="ПЛУ" Тогда
			ТекстВычПоля = "ПолучитьКодыПЛУ(СтрокаТовары.Номенклатура,ДанныеПечати.Склад,СтрокаТовары.Штрихкод,ДанныеПечати.ГруппыТоваровОборудования)";
		ИначеЕсли НаименованиеКолонки="Цена100Копейки" Тогда
			//Цена100 = Окр(СтрокаТовары.Цена/10,2);
			ТекстВычПоля = "(Окр(СтрокаТовары.Цена/10,2)-Цел(Окр(СтрокаТовары.Цена/10,2)))*100";
		ИначеЕсли НаименованиеКолонки="ЦенаДоАкции100Копейки" Тогда
			//ЦенаДоАкции100 = Окр(СтрокаТовары.ЦенаДоАкции/10,2);
			ТекстВычПоля = "(Окр(СтрокаТовары.ЦенаДоАкции/10,2)-Цел(Окр(СтрокаТовары.ЦенаДоАкции/10,2)))*100";
		ИначеЕсли НаименованиеКолонки="Цена100Рубли" Тогда
			ТекстВычПоля = "Цел(Окр(СтрокаТовары.Цена/10,2))";
			//ТекстВычПоля = Цел(Цена100);
		ИначеЕсли НаименованиеКолонки="ЦенаДоАкции100Рубли" Тогда
			ТекстВычПоля = "Цел(Окр(СтрокаТовары.ЦенаДоАкции/10,2))";
			//ТекстВычПоля = Цел(ЦенаДоАкции100);
		ИначеЕсли НаименованиеКолонки="ЦенаДоАкции100" Тогда
			ТекстВычПоля = "Окр(СтрокаТовары.ЦенаДоАкции/10,2)";
			//ТекстВычПоля = ЦенаДоАкции100;

		////++ ПервыйБит ШиряеваВ	
		//ИначеЕсли НаименованиеКолонки="Номенклатурабит_РейтингВиВино" Тогда
		//	Если СтрокаТовары[НаименованиеКолонки]>=3.5 Тогда
		//		Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки];
		//	КонецЕсли;
		//ИначеЕсли НаименованиеКолонки="НоменклатураСтранаПроисхождения" Тогда
		//	Если ЗначениеЗаполнено(СтрокаТовары[НаименованиеКолонки]) Тогда
		//		Если ЗначениеЗаполнено(СтрокаТовары[НаименованиеКолонки].бит_НаименованиеДляЦенника) Тогда
		//			Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки].бит_НаименованиеДляЦенника;
		//		Иначе
		//			Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки];
		//		КонецЕсли;	
		//	Иначе
		//		Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки];
		//	КонецЕсли;
		//	//-- ПервыйБит ШиряеваВ
		//	
		ИначеЕсли НаименованиеКолонки="ЦенаДоАкции" Тогда
			//Если СтрокаТовары[НаименованиеКолонки] > 0 Тогда
				
				//Мальцев А.Ю. +++

				ТекстВычПоля = "ПривестиСуммуКФорматуРублиКопейки(СтрокаТовары.ЦенаДоАкции)";
				//Область.Параметры[ПараметрШаблона.Значение] = ФорматЦены;
														
				//Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки];
				//Мальцев А.Ю. ---

			//КонецЕсли;
			
			
		Иначе

			ТекстВычПоля = "СтрокаТовары." + НаименованиеКолонки;
		КонецЕсли;
		
		
		ТекстАлгоритма = СтрЗаменить(ТекстАлгоритма, Строка(ТекущийИдентификаторСтроки), ТекстВычПоля);
		
		ТекущийИдентификаторСтроки = 0;
	КонецЕсли;		
	пТекСтрока = Элементы.ПользовательскиеПоля.ТекущаяСтрока;
	Если пТекСтрока  <> НЕОПРЕДЕЛЕНО Тогда
		Объект.ПользовательскиеПоля.НайтиПоИдентификатору(пТекСтрока).ВыражениеВычисления = ТекстАлгоритма;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТекстАлгоритмаПослеЗаписи(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляКомпоновкиДанныхОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	ПодключитьОбработчикОжидания("Ожидалка",1/10, Истина);
КонецПроцедуры

&НаКлиенте
Процедура Ожидалка() Экспорт
	Если ЭтаФорма.ТекущийЭлемент = Элементы.ТекстАлгоритма Тогда
		
		//а1=0;а2=0; а3=0; а4=0;    
		//Элементы.ТекстАлгоритма.ПолучитьГраницыВыделения(а1,а2,а3,а4); 
	
   		ЭтаФорма.ТекущийЭлемент = Элементы.ДоступныеПоляКомпоновкиДанных;
		ЭтаФорма.ТекущийЭлемент = Элементы.ТекстАлгоритма;
		//КоличествоСимволов      = СтрДлина(ТекстАлгоритма);
		//Элементы.ТекстАлгоритма.УстановитьГраницыВыделения(а1, а2);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеПоляПриАктивизацииСтроки(Элемент)
	пТекСтрока = Элементы.ПользовательскиеПоля.ТекущаяСтрока;
	Если пТекСтрока <> НЕОПРЕДЕЛЕНО Тогда
		
		ВыражениеВычисления = Строка(Объект.ПользовательскиеПоля.НайтиПоИдентификатору(пТекСтрока).ВыражениеВычисления);
		
		ТекстАлгоритма = ВыражениеВычисления; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеПоляВыражениеВычисленияПриИзменении(Элемент)
	пТекСтрока = Элементы.ПользовательскиеПоля.ТекущаяСтрока;
	Если пТекСтрока <> НЕОПРЕДЕЛЕНО Тогда
		
		ВыражениеВычисления = Строка(Объект.ПользовательскиеПоля.НайтиПоИдентификатору(пТекСтрока).ВыражениеВычисления);
		
		ТекстАлгоритма = ВыражениеВычисления; 
	КонецЕсли;

КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
