// Модуль менеджера документа "Изменение рекомендуемых наценок"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	ИтогиОперации.Вставить("СуммаДокумента", 0);
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

//// Инициализирует таблицы значений, содержащие данные табличных частей документа.
//// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
////
//Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ИзменениеРекомендуемыхНаценокТовары.ТипЦен,
//	|	ИзменениеРекомендуемыхНаценокТовары.Номенклатура,
//	|	ИзменениеРекомендуемыхНаценокТовары.ПроцентНаценки,
//	|	ИзменениеРекомендуемыхНаценокТовары.Ссылка.ДатаНачалаДействия КАК Период
//	|ИЗ
//	|	Документ.ИзменениеРекомендуемыхНаценок.Товары КАК ИзменениеРекомендуемыхНаценокТовары
//	|ГДЕ
//	|	ИзменениеРекомендуемыхНаценокТовары.Ссылка = &Ссылка И 
//	|	(НЕ ИзменениеРекомендуемыхНаценокТовары.ПроцентНаценки = 0)
//	|";
//	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНаценки", РезультатЗапроса.Выгрузить());
//	
//КонецПроцедуры // УЦАИнициализироватьДанныеДокумента()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	//ОбязательныеРеквизиты.Добавить("ПодразделениеКомпанииПолучатель");
	//ОбязательныеРеквизиты.Добавить("ДатаНачалаДействия");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	
	Если НЕ ПравоПользователя("ПроведениеНезаполненныхДокументов", Объект) Тогда
		ОбязательныеРеквизиты.Добавить("Товары");
	КонецЕсли;
	ОбязательныеРеквизиты.Добавить("Товары.Номенклатура");
	ОбязательныеРеквизиты.Добавить("Товары.ТипЦен");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;

КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов табличных частей
	УникальныеТабличныеЧасти=Новый Структура();
		
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеТабличныеЧасти;
	
КонецФункции // ПолучитьУникальныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();

	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", ИСТИНА);
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Обработка пересчета табличных частей объекта.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);

КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	ПараметрыДействия.Вставить("ТребуетсяУстановкаДатыНачала", Истина);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Подразделение".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СуммаДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
КонецПроцедуры // СуммаДокументаПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ТоварыНоменклатураПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Строка.Номенклатура) И Строка.Номенклатура.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ОбработатьИзменениеНоменклатура(Объект, Строка, ПараметрыДействия);
	
	// Проверим, имеют ли смысл дальнейшие действия
	Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Отказ", ЛОЖЬ) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Строка.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	//Строка.ЕдиницаИзмерения =Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(Строка.Номенклатура);
	//ТоварыЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

//// Обработчик события возникающего при изменении данных реквизита "Цена" в таблице "Товары".
////
//// Параметры:
////  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
////  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
////
//Процедура ТоварыЦенаПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
//	
//	Строка.ПроцентНаценки = ?(Строка.ЦенаБазовая = 0, 0, ((Строка.Цена-Строка.ЦенаБазовая)/Строка.ЦенаБазовая)*100);
//	Строка.СуммаНаценки   = Строка.Цена-Строка.ЦенаБазовая;
//	
//КонецПроцедуры // ТоварыЦенаПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.ИзменениеРекомендуемыхНаценок",
		"ПФ_MXL_ИзменениеРекомендуемыхНаценок",
		НСтр("ru = 'Изменение рекомендуемых наценок'"),
		СсылкаНаДокумент);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик печати документа
//
// Параметры:
//  МассивОбъектов         - Массив           - массив объектов для формирования печатных форм
//  ПараметрыПечати        - Структура        - дополнительные параметры печати
//  КоллекцияПечатныхФорм  - Таблица значений - таблица с идентификаторами печатных форм и макетами печати
//  ОбъектыПечати          - Структура        - список областей печатной формы в разрезе документов
//  ПараметрыВывода        - Структура        - дополнительные параметры вывода формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ИзменениеРекомендуемыхНаценок") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_ИзменениеРекомендуемыхНаценок",
															НСтр("ru = 'Изменение рекомендуемых наценок'"),
															ПечатьИзменениеРекомендуемыхНаценок(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;	

КонецПроцедуры // Печать()

// Формирует печатную форму "ИзменениеРекомендуемыхНаценок"
//
Функция ПечатьИзменениеРекомендуемыхНаценок(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИзменениеРекомендуемыхНаценок_ИзменениеРекомендуемыхНаценок";
	ТабличныйДокумент.АвтоМасштаб = Истина;

	ПервыйДокумент = Истина;
	
	//
	Для Каждого Документ Из МассивОбъектов Цикл
			
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ИзменениеРекомендуемыхНаценокТовары.ТипЦен КАК ТипЦен,
		               |	ИзменениеРекомендуемыхНаценокТовары.Номенклатура КАК Номенклатура,
		               |	ИзменениеРекомендуемыхНаценокТовары.ПроцентНаценки КАК ПроцентНаценки,
		               |	ИзменениеРекомендуемыхНаценокТовары.НомерСтроки КАК НомерСтроки
		               |ИЗ
		               |	Документ.ИзменениеРекомендуемыхНаценок.Товары КАК ИзменениеРекомендуемыхНаценокТовары
		               |ГДЕ
		               |	ИзменениеРекомендуемыхНаценокТовары.Ссылка = &Ссылка
		               |ИТОГИ
		               |	КОЛИЧЕСТВО(Номенклатура),
		               |	СРЕДНЕЕ(ПроцентНаценки)
		               |ПО
		               |	ТипЦен";
		Запрос.УстановитьПараметр("Ссылка", Документ);
		Результат = Запрос.Выполнить();
		ВыборкаТиповЦен = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
	//	
		Пока ВыборкаТиповЦен.Следующий() Цикл

			Если НЕ ПервыйДокумент Тогда // Новый документ должен быть на отдельной странице.
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;

			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИзменениеРекомендуемыхНаценок.ПФ_MXL_ИзменениеРекомендуемыхНаценок");
	
			ОбластьТовар = Макет.Область("Товар");

			// Проверим нужно ли выводить код в печатных формах.
			ЕстьКод = ПравоПользователя("ВыводитьКодВПечатныхФормах");
			Если НЕ ЕстьКод Тогда
				ОбластьКод = Макет.Область("Код");
				ОбластьТовар.ШиринаКолонки = ОбластьТовар.ШиринаКолонки + ОбластьКод.ШиринаКолонки;
				Макет.УдалитьОбласть(ОбластьКод,ТипСмещенияТабличногоДокумента.ПоВертикали);
			КонецЕсли;
	
			// Теперь запишем параметры шапки.
			ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
			Если ЕстьКод Тогда
				КолонкаКода = УправлениеПечатьюПлатформа.ПолучитьПараметрыРежимаВыводаКодаВДокументах();
				ОбластьШапкаТаблицы.Параметры.ИмяКолонкиКод = КолонкаКода.Синоним;
			КонецЕсли;
	
			ОбластьЗаголовок       = Макет.ПолучитьОбласть("Заголовок");
			ОбластьСтрока          = Макет.ПолучитьОбласть("Строка");
			ОбластьИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
			ОбластьПодвал          = Макет.ПолучитьОбласть("Подвал");

	//		// дата документа
			ДатаДокумента = Документ.Дата;
			ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);

	//		// Вывод заголовка документа.
			ОбластьЗаголовок.Параметры.Заполнить(Документ);
			ТекстЗаголовка = УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(Документ);
			ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
			Если ЗначениеЗаполнено(Документ.ПодразделениеКомпании) И ЗначениеЗаполнено(Документ.ПодразделениеКомпании.КПП) Тогда
				СтрокаПредставления = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
				ОбластьЗаголовок.Параметры.ПредставлениеОрганизации	= СтрЗаменить(СтрокаПредставления, ОбщегоНазначения.ПолучитьКППНаДату(Документ.Организация, ДатаДокумента), ОбщегоНазначения.ПолучитьКППНаДату(Документ.ПодразделениеКомпании, ДатаДокумента));
			Иначе
				ОбластьЗаголовок.Параметры.ПредставлениеОрганизации	= УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
			КонецЕсли;
			ОбластьЗаголовок.Параметры.ПредставлениеТипаЦен	= ВыборкаТиповЦен.ТипЦен;
			
			// Вывод свойств
			УправлениеПечатьюПлатформа.ЗаполнитьСвойствамиОбъекта(ОбластьЗаголовок, Документ);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	//		
			// Готовим шапку
			НомерСтраницы = 2;
			НомерСтраницыПред = 2;
			СтруктураИтоговПоСтранице = Новый Структура();
			ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы;
	//		
			НомерСтроки = 1;
			// Готовим области строки.
			СтруктураСтроки = Новый Структура();
			
			ВыборкаТоваров = ВыборкаТиповЦен.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока ВыборкаТоваров.Следующий() Цикл
			
				ТоварНаименование = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(ВыборкаТоваров.Номенклатура);
				СтруктураСтроки.Вставить("ТоварНаименование",ТоварНаименование);
				СтруктураСтроки.Вставить("Код", УправлениеПечатьюПлатформа.ПолучитьЗначениеКолонкиКода(ВыборкаТоваров.Номенклатура));
				СтруктураСтроки.Вставить("НомерСтроки",НомерСтроки);
				СтруктураСтроки.Вставить("ПроцентНаценки",ВыборкаТоваров.ПроцентНаценки);
				
				НомерСтроки = НомерСтроки + 1;
				ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры,СтруктураСтроки);
				
				// Найдем старую наценку
				ДатаНачалаДействия = ?(НЕ ЗначениеЗаполнено(Документ.ДатаНачалаДействия),Документ.Дата,Документ.ДатаНачалаДействия);

				НаценкаСтарая = ЦенообразованиеСервер.ПолучитьРекомендуемуюНаценку(ВыборкаТоваров.Номенклатура,
																					ДатаНачалаДействия, ВыборкаТиповЦен.ТипЦен, Документ);
				СтруктураСтроки.Вставить("НаценкаСтарая",НаценкаСтарая);
				ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			
			
				// Доп. области
				мсвДопОбластиПодвала = Неопределено;
				Если ВыборкаТоваров.НомерСтроки = Документ.Товары.Количество() Тогда
					мсвДопОбластиПодвала = Новый Массив;
					мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
				КонецЕсли;
	//			
				НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьШапкаТаблицы, ОбластьИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице, Документ, мсвДопОбластиПодвала);
	//			
				// Инициализация итогов по странице.
				Если НомерСтраницы <> НомерСтраницыПред Тогда
					СтруктураИтоговПоСтранице = Новый Структура();
					НомерСтраницыПред   = НомерСтраницы;
					ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
				КонецЕсли;
	//			
	//			// Добавляем итоги
				УправлениеПечатьюПлатформа.ДобавитьИтогиПоСтранице(ВыборкаТоваров,СтруктураИтоговПоСтранице);
				
			КонецЦикла;
	//		
			Если НомерСтраницы > 2 Тогда
				УправлениеПечатьюПлатформа.ВывестиИтогиПоСтранице(ТабличныйДокумент,ОбластьИтогоПоСтранице,СтруктураИтоговПоСтранице,Документ);
			КонецЕсли;
	//		
	//		// Итоги
			ОбластьПодвал.Параметры.СуммаПрописью = НСтр("ru = 'Всего наименований: '") + Символы.НПП + ВыборкаТиповЦен.Номенклатура;
			ОбластьПодвал.Параметры.Заполнить(УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"ПредседательКомиссии","ПредседательКомиссии"));
			ОбластьПодвал.Параметры.Заполнить(УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"ГлавныйБухгалтер","ГлавныйБухгалтер"));
			
			УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент,ОбластьПодвал,,,НомерСтраницы,,Документ);
			
			КонецЦикла;
			
			// Отметим конец области документа.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);

	КонецЦикла;
	
	Возврат ТабличныйДокумент;

	
КонецФункции // ПечатьИзменениеРекомендуемыхНаценок()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	ПараметрыКоманды = Новый Структура();
	//ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "СкладКомпании", "Справочник.СкладыКомпании.Форма.ФормаСписка",,, ИСТИНА, НСтр("ru = 'Необходимо выбрать склад компании.'"));
	//
	//ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьСкладскимиОстатками",, "Товары", НСтр("ru = 'Заполнить складскими остатками'"), ПараметрыКоманды);
	//
	//ПараметрыКоманды = Новый Структура();
	//ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ПрайсЛистКонтрагента","Справочник.ПрайсЛистыКонтрагентов.Форма.ФормаСписка",,, Истина, НСтр("ru = 'Необходимо выбрать прайс-лист контрагента.'"));
	//
	//ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьНоменклатуройПоПрайсЛистуКонтрагента", "ТоварыПоПрайсЛистуКонтрагента", "Товары", НСтр("ru = 'По номенклатуре прайс-листа контрагента'"), ПараметрыКоманды);
	//
	//ПараметрыКоманды = Новый Структура();
	//ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ЦеноваяГруппа","Справочник.ЦеновыеГруппы.Форма.ФормаСписка",,, Истина, НСтр("ru = 'Необходимо выбрать ценовую группу'"));
	//ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьНоменклатуройПоЦеновойГруппе",, "Товары", НСтр("ru = 'По ценовой группе'"), ПараметрыКоманды);
	//
	//ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоОснованию",, "Товары", НСтр("ru = 'Заполнить по документу-основанию'"));
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	ПараметрыКоманд.Вставить("ТоварыУстановитьНаценкуДляВсейТаблицы.Видимость", Ложь);
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()

// Обработчик заполнения документа складскими остатками
//
Функция ТоварыЗаполнитьСкладскимиОстатками(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	ЗаполнениеДокументовСервер.ЗаполнитьТоварыСкладскимиОстатками(Объект, ПараметрыЗаполнения);
	
КонецФункции // ТоварыЗаполнитьСкладскимиОстатками()

// Обработчик заполнения документа по прайс-листу контрагента
//
Функция ТоварыПоПрайсЛистуКонтрагента(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Обработка заполнения обрабатывается на форме документа
	
КонецФункции // ТоварыПоПрайсЛистуКонтрагента()

// Обработчик заполнения документа по документу основанию
//
Функция ТоварыЗаполнитьПоОснованию(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Обработка заполнения обрабатывается на форме документа
	
КонецФункции // ТоварыЗаполнитьПоОснованию()

#КонецЕсли