// Модуль документа "Изменение цен"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет контроль противоречий.
//
Процедура ВыполнитьПредварительныйКонтроль(Отказ)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИзменениеРекомендуемыхНаценок.Номенклатура,
	|	ИзменениеРекомендуемыхНаценок.Номенклатура.Наименование КАК Наименование,
	|	ИзменениеРекомендуемыхНаценок.ТипЦен,
	|	ИзменениеРекомендуемыхНаценок.НомерСтроки
	|ПОМЕСТИТЬ
	|	ТаблицаДокумента
	|ИЗ
	|	Документ.ИзменениеРекомендуемыхНаценок.Товары КАК ИзменениеРекомендуемыхНаценок
	|ГДЕ
	|	ИзменениеРекомендуемыхНаценок.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Наименование КАК Наименование,
	|	Наценки.Регистратор
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Наценки КАК Наценки
	|ПО
	|	Наценки.Период = &НаДату
	|	И ТаблицаДокумента.Номенклатура = Наценки.Номенклатура 
	|	И ТаблицаДокумента.ТипЦен       = Наценки.ТипЦен
	|ГДЕ
	|	Наценки.Период = &НаДату
	|	И НЕ Наценки.Регистратор = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаДокумента.НомерСтроки
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокументаДублиСтрок.Номенклатура,
	|	ТаблицаДокументаДублиСтрок.ТипЦен,
	|	МАКСИМУМ(ТаблицаДокументаДублиСтрок.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаДокумента КАК ТаблицаДокументаДублиСтрок
	|ПО
	|	ТаблицаДокумента.НомерСтроки    <> ТаблицаДокументаДублиСтрок.НомерСтроки 
	|	И ТаблицаДокумента.Номенклатура = ТаблицаДокументаДублиСтрок.Номенклатура 
	|	И ТаблицаДокумента.ТипЦен       = ТаблицаДокументаДублиСтрок.ТипЦен
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокументаДублиСтрок.Номенклатура,
	|	ТаблицаДокументаДублиСтрок.ТипЦен
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|");
	Запрос.УстановитьПараметр("НаДату", ДатаНачалаДействия);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Если НЕ МассивРезультатов[1].Пустой() Тогда
		Выборка = МассивРезультатов[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Шаблон = НСтр("ru = 'В строке №%1 табл. части ""Товары"": Обнаружен повторный ввод наценки на дату: %2!
			|Цена уже установлена документом: <" + СокрЛП(Выборка.Регистратор) + ">!'");
			
			ТекстСообщения = СтрШаблон(Шаблон, СокрЛП(Выборка.НомерСтроки), Формат(ДатаНачалаДействия, "ДЛФ=DD"));
			ВывестиСообщение(ТекстСообщения, ЭтотОбъект, "Товары", Выборка.НомерСтроки, Отказ);
			
		КонецЦикла;
	КонецЕсли;
	
	// Дубли строк.
	Если НЕ МассивРезультатов[2].Пустой() Тогда
		Выборка = МассивРезультатов[2].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Шаблон = НСтр("ru = 'В строке №%1 табл. части ""Товары"": Тип цен и Номенклатура указываются повторно!
			|Цена уже установлена документом: <" + СокрЛП(Выборка.Регистратор) + ">!'");
			
			ТекстСообщения = СтрШаблон(Шаблон, СокрЛП(Выборка.НомерСтроки));
			ВывестиСообщение(ТекстСообщения, ЭтотОбъект, "Товары", Выборка.НомерСтроки, Отказ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта по передаваемой структуре
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Структура(ДанныеЗаполнения, СтандартнаяОбработка=ИСТИНА) Экспорт
	
	Если ДанныеЗаполнения.Свойство("ХозОперация") Тогда
		ХозОперация = ДанныеЗаполнения.ХозОперация;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("СписокТиповЦен") И ДанныеЗаполнения.Свойство("Номенклатура") Тогда
		
		ПроцентНаценкиИзНоменклатуры = Ложь;
		РасчетЦенОт                  = 0;
		
		Если ДанныеЗаполнения.Свойство("Номенклатура") Тогда
			Номенклатура = ДанныеЗаполнения.Номенклатура;
			Для Каждого ТекущийТипЦен Из ДанныеЗаполнения.СписокТиповЦен.ТекущийСписокТипЦен Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура = Номенклатура;
				НоваяСтрока.ТипЦен = ТекущийТипЦен.Значение;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Структура()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ОбработкаЗаполнения_Структура(ДанныеЗаполнения, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Если Товары.Количество() = 0 Тогда
		ВывестиСообщение(НСтр("ru = 'Некорректно заполнена таблица номенклатуры! Недостаточно данных для установки процента наценки!'"),ЭтотОбъект,,,Отказ);
	КонецЕсли;
	
	ВыполнитьПредварительныйКонтроль(Отказ);
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Предварительный контроль
	//ВыполнитьПредварительныйКонтроль(Отказ);
	
	// Инициализация дополнительных свойств для проведения документа.
	//ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	//Документы.ИзменениеРекомендуемыхНаценок.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИзменениеРекомендуемыхНаценокТовары.ТипЦен КАК ТипЦен,
	               |	ИзменениеРекомендуемыхНаценокТовары.Номенклатура КАК Номенклатура,
	               |	ИзменениеРекомендуемыхНаценокТовары.ПроцентНаценки КАК ПроцентНаценки,
	               |	ИзменениеРекомендуемыхНаценокТовары.СуммаНаценки КАК СуммаНаценки,
	               |	ИзменениеРекомендуемыхНаценокТовары.МинимальнаяНаценка КАК МинимальнаяНаценка
	               |ИЗ
	               |	Документ.ИзменениеРекомендуемыхНаценок.Товары КАК ИзменениеРекомендуемыхНаценокТовары
	               |ГДЕ
	               |	ИзменениеРекомендуемыхНаценокТовары.Ссылка = &Ссылка
	               |	И НЕ(ИзменениеРекомендуемыхНаценокТовары.ПроцентНаценки = 0
	               |				И ИзменениеРекомендуемыхНаценокТовары.СуммаНаценки = 0)";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НаборЗаписейНаценки = Движения.Наценки;
	НаборЗаписейНаценки.ДокументОбъект            = ЭтотОбъект;
	НаборЗаписейНаценки.ДатаНачалаДействия        = ДатаНачалаДействия;
	НаборЗаписейНаценки.РезультатЗапросаПоТоварам = РезультатЗапроса;
	Отказ = НЕ НаборЗаписейНаценки.УстановитьНаценки() ИЛИ Отказ;
	
КонецПроцедуры // ОбработкаПроведения()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли