// Модуль менеджера обработки "Обновление ставки НДС".

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьПерезаполнениеСтавокНДС(ПараметрыВыполнения, АдресХранилища) Экспорт
	
	КлиентОтметитьПрогрессОбходаКоллекции(НСтр("ru = 'Переопределение основной ставки НДС'"));
	
	// 1. Заполнение ставки НДС 20% данными из предопределенной основной ставки.
	Отказ = ЗаполнитьОсновнуюСтавкуНДС(ПараметрыВыполнения.СтавкаНДС20, ПараметрыВыполнения.СтавкаНДСРасчетная20);
	
	Если Отказ Тогда
		// Не удалось ставку переназначить - дальнейшие действия не имеют смысла.
		ВывестиСообщение(НСтр("ru = 'Выполнение операции прервано!'"));
		ПоместитьВоВременноеХранилище(Неопределено, АдресХранилища);
		Возврат;
	КонецЕсли;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("Объект",       Новый ОписаниеТипов(МассивТипов));
	ТаблицаРезультат.Колонки.Добавить("Перезаписано", Новый ОписаниеТипов("Булево"));
	
	// 2. Перезаполним справочники ставкой 20% вместо 18%
	КлиентОтметитьПрогрессОбходаКоллекции(НСтр("ru = 'Перезаполнение ставок НДС в справочнике ""Номенклатура""'"));
	ПерезаполнитьСтавкуНДССправочников(ТаблицаРезультат, ПараметрыВыполнения.СтавкаНДС20);
	
	ПоместитьВоВременноеХранилище(ТаблицаРезультат, АдресХранилища);
КонецПроцедуры

Функция ЗаполнитьОсновнуюСтавкуНДС(ОсновнаяСтавкаНДС20, ОсновнаяСтавкаНДСРасчетная20)
	
	ОсновнаяСтавкаНДС          = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС.ПолучитьОбъект();
	ОсновнаяСтавкаНДСРасчетная = Справочники.СтавкиНДС.ОсновнаяСтавкаНДСРасчетная.ПолучитьОбъект(); // rarus antsyu не актуально 
	
	СтавкаНДС20          = ОсновнаяСтавкаНДС20.ПолучитьОбъект();
	СтавкаНДСРасчетная20 = ОсновнаяСтавкаНДСРасчетная20.ПолучитьОбъект(); // rarus antsyu не актуально
	
	// Отменим пометку удаления если она есть на выбранных ставок НДС 20
	Если СтавкаНДС20.ПометкаУдаления Тогда
		СтавкаНДС20.ПометкаУдаления = Ложь;
	КонецЕсли;
	
	Если СтавкаНДСРасчетная20.ПометкаУдаления Тогда
		СтавкаНДСРасчетная20.ПометкаУдаления = Ложь;
	КонецЕсли;
	
	ОсновнаяСтавка18  = (ОсновнаяСтавкаНДС.Ставка = 18);
	РасчетнаяСтавка18 = (ОсновнаяСтавкаНДСРасчетная.Ставка = 18);
	
	СтавкаНДС20.ОбменДанными.Загрузка=Истина;
	СтавкаНДСРасчетная20.ОбменДанными.Загрузка=Истина;
	
	Если ОсновнаяСтавка18 Тогда
		ОсновнаяСтавкаНДС.ОбменДанными.Загрузка = Истина;
		СтавкаНДС20.ИмяПредопределенныхДанных=ОсновнаяСтавкаНДС.ИмяПредопределенныхДанных;
		ОсновнаяСтавкаНДС.ИмяПредопределенныхДанных = "";
	КонецЕсли;
	
	Если РасчетнаяСтавка18 Тогда
		ОсновнаяСтавкаНДСРасчетная.ОбменДанными.Загрузка = Истина;
		СтавкаНДСРасчетная20.ИмяПредопределенныхДанных=ОсновнаяСтавкаНДСРасчетная.ИмяПредопределенныхДанных;
		ОсновнаяСтавкаНДСРасчетная.ИмяПредопределенныхДанных = "";
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		Если ОсновнаяСтавка18 Тогда
			ОсновнаяСтавкаНДС.Записать();
		КонецЕсли;
		СтавкаНДС20.Записать();
		Если РасчетнаяСтавка18 Тогда
			ОсновнаяСтавкаНДСРасчетная.Записать();
		КонецЕсли;
		СтавкаНДСРасчетная20.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		КлиентОтметитьПрогрессОбходаКоллекции(НСтр("ru = 'Не удалось переопределелить предопределенные элементы справочника ""Ставки НДС"". Выполнение обработки прервано!'"));
		Возврат Истина;
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции // ЗаполнитьОсновнуюСтавкуНДС()

Процедура ПерезаполнитьСтавкуНДССправочников(ТаблицаОбъектов, СтавкаНДС20)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка,
	               |	Номенклатура.СтавкаНДС КАК СтавкаНДС
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.СтавкаНДС.Ставка = 18";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Всего = Выборка.Количество();
	НомерЭлемента = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НоменклатураОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		НоменклатураОбъект.СтавкаНДС = СтавкаНДС20;
		
		НоменклатураОбъект.ОбменДанными.Загрузка = Истина;
		
		НоваяСтрока = ТаблицаОбъектов.Добавить();
		ИмяОбъекта = Выборка.Ссылка.Метаданные().Синоним;
		НоваяСтрока.Объект     = Выборка.Ссылка;
		
		Попытка
			НоменклатураОбъект.Записать();
			НоваяСтрока.Перезаписано = Истина;
			НомерЭлемента = НомерЭлемента + 1;
		Исключение
			НоваяСтрока.Перезаписано = Ложь;
		КонецПопытки;
		
		КлиентОтметитьПрогрессОбходаКоллекции(СтрШаблон(НСтр("ru = 'Справочник ""Номенклатура"". Обновлено %1 из %2 элементов'"), НомерЭлемента, Всего));
		
	КонецЦикла;
	
КонецПроцедуры // ПерезаполнитьСтавкуНДСНоменклатры()


////////////////////////////////////////////////////////////////////////////////
// Передача информации на клиент.

// Регистрирует прогресс.
Процедура КлиентОтметитьПрогрессОбходаКоллекции(Текст)
	
	// Регистрация сообщения для чтения из клиентского сеанса.
	ДлительныеОперации.СообщитьПрогресс(,Текст);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Обработчик печати.
//
// Параметры:
//  МассивОбъектов         - Массив           - массив объектов для формирования печатных форм
//  ПараметрыПечати        - Структура        - дополнительные параметры печати
//  КоллекцияПечатныхФорм  - Таблица значений - таблица с идентификаторами печатных форм и макетами печати
//  ОбъектыПечати          - Структура        - список областей печатной формы в разрезе документов
//  ПараметрыВывода        - Структура        - дополнительные параметры вывода формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Отчет") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"Отчет",
		НСтр("ru = 'Результат перезаполнения ставки НДС с 18% на 20%'"),
		ПечатьРезультат(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Формирует данные в табличном документе.
//
Функция ПечатьРезультат(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	// Создадим табличные документы
	ДокументРезультат = Новый ТабличныйДокумент;
	
	МакетОтчета = ПолучитьМакет("Отчет");
	
	// Необходимые параметры
	ТаблицаРезультат = ПолучитьИзВременногоХранилища(ПараметрыПечати.АдресВременногоХранилища);
	
	Шапка    = МакетОтчета.ПолучитьОбласть("Шапка");
	Группа   = МакетОтчета.ПолучитьОбласть("ГруппаОбъекта");
	ИмяОбъекта = МакетОтчета.ПолучитьОбласть("ИмяОбъекта");
	Строка   = МакетОтчета.ПолучитьОбласть("Строка");
	Подвал   = МакетОтчета.ПолучитьОбласть("Подвал");
	ДокументРезультат.Вывести(Шапка);
	
	ТекущийТипОбъекта = "";
	ТекущийОбъект     = "";
	
	Для Каждого ТекущаяСтрока Из ТаблицаРезультат Цикл
		
		Строка.Параметры.Объект    = СокрЛП(Строка(ТекущаяСтрока.Объект));
		Строка.Параметры.Документ  = ТекущаяСтрока.Объект;
		Строка.Параметры.Результат = ТекущаяСтрока.Перезаписано;
		ДокументРезультат.Вывести(Строка);
		
	КонецЦикла;
	
	ДокументРезультат.Вывести(Подвал);
	
	Возврат ДокументРезультат;
	
КонецФункции // ПечатьРезультат()

#КонецОбласти

#КонецЕсли