// Общий модуль "Технологическая платформа (служебный)"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//	Описание - Структура - сведения о библиотеке:
//
//		Имя					- Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//		Версия					- Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//		ТребуемыеПодсистемы	- Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//									Обработчики обновления таких библиотек должны быть вызваны ранее обработчиков обновления данной библиотеки.
//									При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//									порядок вызова обработчиков обновления определяется порядком добавления модулей
//									в процедуре ПриДобавленииПодсистем общего модуля ПодсистемыКонфигурацииПереопределяемый.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя                                  = "ТехнологическаяПлатформа3";
	Описание.Версия                               = Метаданные.Подсистемы.ТехнологическаяПлатформа.Комментарий;
	Описание.ДобавлятьСлужебныеСобытия            = ИСТИНА;
	Описание.ДобавлятьОбработчикиСлужебныхСобытий = ИСТИНА;
	Описание.ТребуемыеПодсистемы.Добавить("УправлениеЛицензированием");
	
КонецПроцедуры // ПриДобавленииПодсистемы()

// Доопределяет обработчики служебных событий, объявленных через процедуру ПриДобавленииСлужебныхСобытий.
//
// Параметры:
//  КлиентскиеОбработчики - Соответствие, где
//                            Ключ     - Строка - полное имя события,
//                            Значение - Массив - массив имен клиентских общих модулей обработчиков.
//
//  СерверныеОбработчики  - Соответствие, где
//                            Ключ     - Строка - полное имя события,
//                            Значение - Массив - массив имен серверных общих модулей обработчиков.
//
// Для упрощения поддержки, рекомендуется делать вызов такой же процедуры в общем модуле библиотеки.
//
Процедура ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики) Экспорт
	
	// События возникающие в контексте Клиента
	КлиентскиеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПередНачаломРаботыСистемы"]    .Добавить("ТехнологическаяПлатформаКлиент");
	КлиентскиеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПриНачалеРаботыСистемы"]       .Добавить("ТехнологическаяПлатформаКлиент");
	КлиентскиеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПередЗавершениемРаботыСистемы"].Добавить("ТехнологическаяПлатформаКлиент");
	КлиентскиеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПриЗавершенииРаботыСистемы"]   .Добавить("ТехнологическаяПлатформаКлиент");
	КлиентскиеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ОбработкаВнешнегоСобытия"]     .Добавить("ТехнологическаяПлатформаКлиент");
	
	// События возникающие в контексте Сервера
	СерверныеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииПараметровРаботыКлиентаПриЗапуске"].Добавить("ТехнологическаяПлатформаВызовСервера");
	СерверныеОбработчики["СтандартныеПодсистемы.Печать\ПриОпределенииОбъектовСКомандамиПечати"].Добавить("УправлениеПечатьюПлатформа");
	
КонецПроцедуры // ПриДобавленииОбработчиковСлужебныхСобытий()

// Доопределяет события, к которым можно будет добавить обработчики через процедуру
// ПриДобавленииОбработчиковСлужебныхСобытий.
//
// Параметры:
//  КлиентскиеСобытия - Массив, где значения типа Строка - полное имя события.
//  СерверныеСобытия  - Массив, где значения типа Строка - полное имя события.
//
// Для упрощения поддержки, рекомендуется делать вызов такой же процедуры в общем модуле библиотеки.
//
Процедура ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия) Экспорт
	
	// Регистрируем новое клиентское событие системы
	КлиентскиеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПриЗавершенииРаботыСистемы");
	КлиентскиеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ОбработкаВнешнегоСобытия");
	
КонецПроцедуры // ПриДобавленииСлужебныхСобытий()

// Возвращает соответствие имен параметров сеанса и обработчиков для их инициализации.
//
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	
	Обработчики.Вставить("ПодразделениеКомпании", "ТехнологическаяПлатформаВызовСервера.УстановкаПараметровСеанса");
	Обработчики.Вставить("Организация",           "ТехнологическаяПлатформаВызовСервера.УстановкаПараметровСеанса");
	Обработчики.Вставить("ОбщиеЗначения",         "ТехнологическаяПлатформаВызовСервера.УстановкаПараметровСеанса");
	
	// Подключаемое оборудование
	Обработчики.Вставить("РабочееМестоКлиента", "МенеджерОборудованияВызовСервера.УстановитьПараметрыСеансаПодключаемогоОборудования");
	// Подключаемое оборудование

КонецПроцедуры // ПриДобавленииОбработчиковУстановкиПараметровСеанса()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОБНОВЛЕНИЯ ПОДСИСТЕМЫ

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры // ПриОпределенииРежимаОбновленияДанных()

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//	Обработчики - ТаблицаЗначений 	- с колонками:
//		* ПредыдущееИмяКонфигурации	- Строка - имя конфигурации, с которой выполняется переход;
//		* Процедура					- Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации.
//										Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику".
//
// Обязательно должна быть экспортной.
//
// Пример добавления процедуры-обработчика в список:
//	Обработчик = Обработчики.Добавить();
//	Обработчик.ПредыдущееИмяКонфигурации	= "УправлениеТорговлей";
//	Обработчик.Процедура					= "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры // ПриДобавленииОбработчиковПереходаСДругойПрограммы()

// Вызывается после выполнения обработчиков перехода с другой программы
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(ПредыдущееИмяКонфигурации, ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры // ПриЗавершенииПереходаСДругойПрограммы()

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.МонопольныйРежим    = Ложь;
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	// Обновим объекты конфигурации, заполняющиеся на основании поставляемых с конфигурацией данных.
	ОбработчикиОбновленияПоставляемыхДанных(Обработчики);
	
	// Обработчики начального заполнения параметров ведения учета
	ОбработчикиНачальногоЗаполненияПараметрыУчета(Обработчики);
	
	// Обработчики инициализации предопределенных элементов системы
	ОбработчикиНачальногоЗаполненияКлассификаторы(Обработчики);
	
	// Обработчики инициализации нормативно-справочной информации
	ОбработчикиНачальногоЗаполненияНСИ(Обработчики);
	
	// Обработчики инициализации отраслевых объектов системы
	ОбработчикиНачальногоЗаполненияОтраслевыеОбъекты(Обработчики);
	
	// Удаление программно созданных элементов ПВХ.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.29";
	Обработчик.Процедура                    = "ПланыВидовХарактеристик.ПраваИНастройки.УдалитьНеПредопределенныеЭлементы";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.36";
	Обработчик.Процедура                    = "МенеджерОборудованияВызовСервераПереопределяемый.ОбновитьДрайверыВСправочникеПодключаемогоОборудования";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	// Обновим элементы справочника "Договоры взаиморасчетов"
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.72";
	Обработчик.Процедура                    = "Справочники.ДоговорыВзаиморасчетов.УстановкаКонтроляМаксимальнойСуммыКредита";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	// Обновим Функциональную Опцию  НастраиватьДоступНаУровнеЗаписей
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.92";
	Обработчик.Процедура                    = "ТехнологическаяПлатформаСлужебный.НачальноеЗаполнениеФункциональнойОпции_НастраиватьДоступНаУровнеЗаписей";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	// Обновим документы взаимодействий
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.27";
	Обработчик.Процедура                    = "ВзаимодействияПереопределяемый.ЗаполнитьОрганизациюИПодразделения";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	// Обновим документы взаимодействий
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.27";
	Обработчик.Процедура                    = "АнкетированиеПлатформаСервер.ЗаполнитьОрганизациюИПодразделения";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;

	// Обновим элементы справочника "Договоры взаиморасчетов"
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.04";
	Обработчик.Процедура                    = "Справочники.ДоговорыВзаиморасчетов.УстановитьТипДоговора";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	// Создадим Документы СогласиеНаОбработкуПерсональныхДанных из данных справочника Контрагенты.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.12";
	Обработчик.Процедура                    = "Справочники.Контрагенты.НачальноеЗаполнениеДокументовСогласиеНаОбработкуПерсональныхДанных";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	// Заменим роли ИзменитьТекущегоПользователя и ИзменениеТекущегоВнешнегоПользователя.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.02.17";
	Обработчик.Процедура = "ТехнологическаяПлатформаСлужебный.ЗаменитьРолиВПрофиляхДоступа";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение = Истина;
	
	// Обновим документы взаимодействий
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.23";
	Обработчик.Процедура                    = "ВзаимодействияПереопределяемый.ОчиститьДанныеРегистраСведенияКомпании";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	// Обновим права пользователей для открытия формы "Параметры документа"
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.25";
	Обработчик.Процедура                    = "ТехнологическаяПлатформаСлужебный.ЗаполнитьПраваПользователейФормыПараметрыДокумента";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.28";
	Обработчик.Процедура                    = "Справочники.ИдентификаторыОбъектовМетаданных.ОбновитьДанныеСправочника";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.34";
	Обработчик.Процедура                    = "ТехнологическаяПлатформаСлужебный.ОбновитьПредопределенныеВидыКИ";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.35";
	Обработчик.Процедура                    = "ТехнологическаяПлатформаСлужебный.ЗаполнитьПериодическиеДанныеСправочников";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.37";
	Обработчик.Процедура                    = "Справочники.ТипыОплат.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.37";
	Обработчик.Процедура                    = "Справочники.ТипыНоменклатуры.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	// Процедура вызывается повторно, так как начальное заполнение по умолчанию заполнило некорректно.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.64";
	Обработчик.Процедура                    = "Справочники.КлючевыеОперации.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	// Процедура вызывается повторно, так как начальное заполнение по умолчанию заполнило некорректно.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.45";
	Обработчик.Процедура                    = "Справочники.ПрограммыЭлектроннойПодписиИШифрования.ЗаполнитьНачальныеНастройкиВОблачномСервисе";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	// Платежно расчетные документы счетов-фактур
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.49";
	Обработчик.Процедура                    = "ПлатежноРасчетныеДокументыСервер.ВыполнитьОбновлениеСчетовФактур";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	// Платежно расчетные документы выписок
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.49";
	Обработчик.Процедура                    = "ПлатежноРасчетныеДокументыСервер.ВыполнитьОбновлениеВыписок";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.52";
	Обработчик.Процедура                    = "Документы.Разукомплектация.ВыполнитьЗаполнениеСуммаВсего";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.55";
	Обработчик.Процедура                    = "Справочники.ДоговорыВзаиморасчетов.ЗаполнитьФлагАвтоЗакрытиеСделок";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.58";
	Обработчик.Процедура                    = "ПланыВидовХарактеристик.ПраваИНастройки.ОбновлениеЗначенияПравПерезаписьАвтораПерезаписьПодразделения";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.59";
	Обработчик.Процедура                    = "Справочники.Контрагенты.ВыполнитьОбновлениеИНН";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.75";
	Обработчик.Процедура                    = "Перечисления.ТипыСпособаРасчетаККТ.ЗаполнитьТипСпособаРасчетаККТДокументов";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.77";
	Обработчик.Процедура                    = "РегистрыСведений.УчетныеПолитики.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.84";
	Обработчик.Процедура                    = "Справочники.НастройкаПечатиКомплекта.ЗаполнитьСпособФормированияДереваДокументов";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.89";
	Обработчик.Процедура                    = "РегистрыНакопления.НаличныеРасчеты.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.90";
	Обработчик.Процедура                    = "Документы.СогласиеНаОбработкуПерсональныхДанных.ЗаполнитьПодразделениеДокументов";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.90";
	Обработчик.Процедура                    = "Документы.ОтзывСогласияНаОбработкуПерсональныхДанных.ЗаполнитьПодразделениеДокументов";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.90";
	Обработчик.Процедура                    = "Документы.КассовыйЧекКоррекции.ЗаполнитьПодразделениеДокументов";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
КонецПроцедуры // ПриДобавленииОбработчиковОбновления()

Процедура ОбновитьПредопределенныеВидыКИ() Экспорт
	УправлениеКонтактнойИнформациейПлатформа.ОбновитьПредопределенныеВидыКонтактнойИнформацииКонтрагентов();
	УправлениеКонтактнойИнформациейПлатформа.ОбновитьПредопределенныеВидыКонтактнойИнформацииОрганизаций();
	УправлениеКонтактнойИнформациейПлатформа.ОбновитьПредопределенныеВидыКонтактнойИнформацииПодразделенийКомпании();
	УправлениеКонтактнойИнформациейПлатформа.ОбновитьПредопределенныеВидыКонтактнойИнформацииСотрудников();
КонецПроцедуры

Процедура ЗаполнитьПериодическиеДанныеСправочников() Экспорт 
	// выбираем все объекты
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Ссылка, КПП, НаименованиеПолное ИЗ Справочник.Организации ГДЕ НЕ ПометкаУдаления
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ Ссылка, КПП, НаименованиеПолное ИЗ Справочник.ПодразделенияКомпании ГДЕ НЕ ПометкаУдаления
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ Ссылка, КПП, НаименованиеПолное ИЗ Справочник.Контрагенты ГДЕ НЕ ПометкаУдаления И НЕ ЭтоГруппа";
	
	// выполняем
	РезультатЗапроса = Запрос.Выполнить();
	
	// смотрим, есть ли данные
	Если НЕ РезультатЗапроса.Пустой() Тогда
		// выбираем
		Выборка = РезультатЗапроса.Выбрать();
		
		// перебираем данные
		Пока Выборка.Следующий() Цикл
			// получаем объект
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			// ставим параметры КПП
			Если СправочникОбъект.ИсторияКПП.Количество() = 0 Тогда
				НоваяСтрокаКПП = СправочникОбъект.ИсторияКПП.Добавить();
				НоваяСтрокаКПП.Период = '00010101';
				НоваяСтрокаКПП.КПП = Выборка.КПП;
			КонецЕсли;
			
			// ставим параметры Наименования
			Если СправочникОбъект.ИсторияНаименований.Количество() = 0 Тогда
				НоваяСтрокаНаименования = СправочникОбъект.ИсторияНаименований.Добавить();
				НоваяСтрокаНаименования.Период = '00010101';
				НоваяСтрокаНаименования.НаименованиеПолное = Выборка.НаименованиеПолное;
			КонецЕсли;
			
			// записываем
			Попытка
				СправочникОбъект.Записать()
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника" + Символы.НПП + ТипЗнч(СправочникОбъект) + ".'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры // ПередОбновлениемИнформационнойБазы()

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - (возвращаемое значение) если установить Истина,
//                                то будет выведена форма с описанием обновлений. По умолчанию, Истина.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
// Пример обхода выполненных обработчиков обновления:
//
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия, Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры // ПослеОбновленияИнформационнойБазы()

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры // ПриПодготовкеМакетаОписанияОбновлений()

// процедура заменяет ненужные роли в профилях доступа
Процедура ЗаменитьРолиВПрофиляхДоступа() Экспорт
	
	// инициализируем массив ролей
	МассивРолей = Новый СписокЗначений;
	МассивРолей.Добавить("ИзменениеТекущегоПользователя");
	МассивРолей.Добавить("ИзменениеТекущегоВнешнегоПользователя");
	
	// формируем запрос
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РолиПрофилей.Ссылка КАК Профиль,
	|	ИдентификаторыУдаленныхРолей.Ссылка КАК ИдентификаторРоли,
	|	ИдентификаторыУдаленныхРолей.Имя
	|ИЗ
	|	Справочник.ПрофилиГруппДоступа.Роли КАК РолиПрофилей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыУдаленныхРолей
	|		ПО РолиПрофилей.Роль = ИдентификаторыУдаленныхРолей.Ссылка
	|		И ИдентификаторыУдаленныхРолей.Имя В (&МассивРолей)
	|ИТОГИ ПО
	|	Профиль";
	
	// ставим параметры
	Запрос.УстановитьПараметр("МассивРолей", МассивРолей);
	
	// выполняем
	РезультатЗапроса = Запрос.Выполнить();
	
	// смотрим есть ли данные
	Если Не РезультатЗапроса.Пустой() Тогда
		// выбираем данные
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// обходим
		Пока Выборка.Следующий() Цикл
			// получаем объект
			ПрофильОбъект = Выборка.Профиль.ПолучитьОбъект();
			РолиПрофиля = ПрофильОбъект.Роли;
			
			// выбираем на втором уровне
			ВыборкаДетальная = Выборка.Выбрать();
			
			// обходим детально
			Пока ВыборкаДетальная.Следующий() Цикл
				// Удаляем роль из профиля
				Отбор = Новый Структура("Роль", ВыборкаДетальная.ИдентификаторРоли);
				СтрокаТабличнойЧасти = РолиПрофиля.НайтиСтроки(Отбор)[0];
				РолиПрофиля.Удалить(СтрокаТабличнойЧасти);
				
				// получаем роль базовые права
				ДобавляемаяРоль = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Роль.БазовыеПрава");
				
				// добавляем новую роль
				Отбор = Новый Структура;
				Отбор.Вставить("Роль", ДобавляемаяРоль);
				Если РолиПрофиля.НайтиСтроки(Отбор).Количество() = 0 Тогда
					НоваяСтрока = РолиПрофиля.Добавить();
					НоваяСтрока.Роль = ДобавляемаяРоль;
				КонецЕсли
			КонецЦикла;
		КонецЦикла;
		
		// записываем данные
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПрофильОбъект,, Истина);
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ СИСТЕМЫ

Процедура УстановкаПараметровСеанса(Знач ИмяПараметра, УстановленныеПараметры) Экспорт
	
	ПараметрыСеанса.ПодразделениеКомпании = ПараметрыСеанса.ТекущийПользователь.ПодразделениеКомпании;
	ПараметрыСеанса.Организация           = ПараметрыСеанса.ТекущийПользователь.Организация;
	ПараметрыСеанса.ОбщиеЗначения         = Новый ХранилищеЗначения(Новый Структура);
	
	УстановленныеПараметры.Добавить("ПодразделениеКомпании");
	УстановленныеПараметры.Добавить("Организация");
	УстановленныеПараметры.Добавить("ОбщиеЗначения");
	
КонецПроцедуры // УстановкаПараметровСеанса()

Процедура ЗаполнитьПраваПользователейФормыПараметрыДокумента() Экспорт
	// инициализируем
	СписокРолей = Новый СписокЗначений;
	
	// перебираем роли
	Для каждого ТекРоль Из Метаданные.Роли Цикл
		// получаем значение
		ПравоНаПросмотр = ПравоДоступа("Просмотр", Метаданные.ОбщиеФормы.ПараметрыДокумента, ТекРоль);
		
		// если стоит право на просмотр то добавляем роль в список
		Если ПравоНаПросмотр Тогда
			СписокРолей.Добавить(ТекРоль.Имя, ТекРоль);
		КонецЕсли;
	КонецЦикла; 
	
	// получаем массив пользователей
	МассивПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	// перебираем
	Для Каждого ТекПользователь Из МассивПользователей Цикл
		// получаем роли пользователя
		РолиПользователя = ТекПользователь.Роли;
		
		// сбрасываем флаг
		УстанавливатьПраво = Ложь;
		
		// перебираем роли
		Для Каждого ТекРоль Из РолиПользователя Цикл
			// ищем роль в списке
			НайденнаяРоль = СписокРолей.НайтиПоЗначению(ТекРоль.Имя);
			
			// смотрим нашли ли мы роль
			Если НайденнаяРоль <> Неопределено Тогда
				// взводим флаг
				УстанавливатьПраво = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		// если флаг взведен обновляем право для пользователя
		Если УстанавливатьПраво Тогда
			ОбновитьПравоВКэше("ОткрытиеФормыПараметрыДокументаВРежимеРедактирование", Истина);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОбработчикиОбновленияПоставляемыхДанных(Обработчики)
	
	// Инициализация системы прав и настроек...
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "*";
	Обработчик.Приоритет                    = 98;
	Обработчик.Процедура                    = "ПланыВидовХарактеристик.ПраваИНастройки.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	Обработчик.ОбщиеДанные                  = Истина;
	
	// Инициализация системы учетных политик...
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "*";
	Обработчик.Приоритет                    = 98;
	Обработчик.Процедура                    = "ПланыВидовХарактеристик.УчетныеПолитики.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	Обработчик.ОбщиеДанные                  = Истина;
	
	// Обновим правила префиксации объектов
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "*";
	Обработчик.Процедура                    = "РегистрыСведений.ПрефиксацияОбъектов.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	// Обновим правила утверждения документов
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "*";
	Обработчик.Процедура                    = "РегистрыСведений.НастройкиУтвержденияДокументов.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "*";
	Обработчик.Процедура                    = "РегистрыСведений.ИспользоватьУтверждениеДокументов.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	// Обновим элементы справочника значимые события
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "*";
	Обработчик.Процедура                    = "Справочники.ЗначимыеСобытия.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	// Обновим элементы справочника действия на значимые события
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "*";
	Обработчик.Процедура                    = "Справочники.ДействияНаЗначимыеСобытия.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	// Обновим элементы справочника хозяйственных операций
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "*";
	Обработчик.Процедура                    = "Справочники.ХозОперации.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	Обработчик.ОбщиеДанные                  = Истина;
	
	// Подключаемое оборудование
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыБПО.ОбновитьПоставляемыеДрайвера";
	Обработчик.Комментарий = НСтр("ru = 'Обновление поставляемых драйверов подключаемого оборудования.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыБПО.ОбновитьПараметрыККТ";
	Обработчик.Комментарий = НСтр("ru = 'Обновление параметров ККТ.'");
	
	// Обработчики обновления иерархических структур.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "РегистрыСведений.СтруктураИерархииПодразделений.ОбновитьСтруктуруИерархии";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	Обработчик.ОбщиеДанные                  = Истина;
	
	// Обработчики обновления иерархических структур.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "РегистрыСведений.СтруктураИерархииНоменклатуры.ОбновитьСтруктуруИерархии";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	Обработчик.ОбщиеДанные                  = Истина;
	
	
КонецПроцедуры // ОбработчикиОбновленияПоставляемыхДанных()

Процедура ОбработчикиНачальногоЗаполненияПараметрыУчета(Обработчики)
	
	// Инициализируем параметры ведения учета
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.56";
	Обработчик.Процедура                    = "Обработки.НастройкаПараметровУчета.ВыполнитьНачальноеЗаполнениеПараметрыУчета";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.40";
	Обработчик.Процедура                    = "Обработки.НастройкаПараметровУчета.ВыполнитьНачальноеЗаполнениеРазделыУчета";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.40";
	Обработчик.Процедура                    = "Обработки.НастройкаПараметровУчета.ВыполнитьНачальноеЗаполнениеАналитикиУчета";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.40";
	Обработчик.Процедура                    = "Обработки.НастройкаПараметровУчета.ВыполнитьНачальноеЗаполнениеСлужебныеПодсистемы";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
КонецПроцедуры // ОбработчикиНачальногоЗаполнения()

Процедура ОбработчикиНачальногоЗаполненияКлассификаторы(Обработчики)
	
	// Дополнительные реквизиты и сведения
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.91";
	Обработчик.Процедура                    = "ТехнологическаяПлатформаВызовСервера.ОбновитьПредопределенныеДопРеквизитыИСвойства";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
		
	// Виды контактной информации
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.25";
	Обработчик.Процедура                    = "УправлениеКонтактнойИнформациейПлатформа.ОбновитьПредопределенныеВидыКонтактнойИнформацииПодразделенийКомпании";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.25";
	Обработчик.Процедура                    = "УправлениеКонтактнойИнформациейПлатформа.ОбновитьПредопределенныеВидыКонтактнойИнформацииОрганизаций";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.25";
	Обработчик.Процедура                    = "УправлениеКонтактнойИнформациейПлатформа.ОбновитьПредопределенныеВидыКонтактнойИнформацииКонтрагентов";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.25";
	Обработчик.Процедура                    = "УправлениеКонтактнойИнформациейПлатформа.ОбновитьПредопределенныеВидыКонтактнойИнформацииСотрудников";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "ПользователиСлужебный.ОбновитьПредопределенныеВидыКонтактнойИнформацииПользователей";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	
	//////////////////////////////////////////////////////////////////////////////
	// КЛАССИФИКАТОРЫ И СВОЙСТВА
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.35";
	Обработчик.Процедура                    = "Справочники.КлассификаторЕдиницИзмерения.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.73";
	Обработчик.Процедура                    = "Справочники.СтатьиДДС.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.73";
	Обработчик.Процедура                    = "Справочники.СтатьиДоходовИРасходов.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "Справочники.СтавкиНДС.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "Справочники.ТипыОплат.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "Справочники.ТипыНоменклатуры.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "Справочники.ТипыЦен.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "Справочники.Карточки.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "Справочники.ГрафикиРаботы.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "ПланыВидовХарактеристик.ТипыСделок.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "ПланыВидовХарактеристик.ТипыПартий.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.58";
	Обработчик.Процедура                    = "ПланыВидовРасчета.НачисленияИУдержания.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "РегистрыСведений.ПорядокЗакрытияБалансовыхСтатей.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	// Планирование
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "ПланыВидовХарактеристик.АналитическиеРазрезыПланирования.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "ПланыВидовХарактеристик.ПараметрыПланирования.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "Справочники.ВидыПлановКомпании.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.01";
	Обработчик.Процедура                    = "Справочники.ВидыИнтервалов.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
КонецПроцедуры // ОбработчикиНачальногоЗаполненияКлассификаторы()

Процедура ОбработчикиНачальногоЗаполненияНСИ(Обработчики)
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "Справочники.Организации.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "Справочники.ПодразделенияКомпании.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "Справочники.Пользователи.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.57";
	Обработчик.Процедура                    = "Справочники.КассыКомпании.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "Справочники.СкладыКомпании.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.50";
	Обработчик.Процедура                    = "Справочники.Номенклатура.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "Справочники.Контрагенты.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.33";
	Обработчик.Процедура                    = "Справочники.Карточки.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.74";
	Обработчик.Процедура                    = "Справочники.ТипыСкидок.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.86";
	Обработчик.Процедура                    = "Справочники.Смены.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.85";
	Обработчик.Процедура                    = "Справочники.КлючевыеОперации.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.01.49";
	Обработчик.Процедура                    = "Справочники.Валюты.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
КонецПроцедуры // ОбработчикиНачальногоЗаполненияНСИ()

Процедура ОбработчикиНачальногоЗаполненияОтраслевыеОбъекты(Обработчики)
	
	
	
КонецПроцедуры // ОбработчикиНачальногоЗаполненияОтраслевыеОбъекты()

Процедура НачальноеЗаполнениеФункциональнойОпции_НастраиватьДоступНаУровнеЗаписей()   Экспорт

	// +Рарус
	Если Константы.ОграничиватьДоступНаУровнеЗаписей.Получить() Тогда
		Константы.НастраиватьДоступНаУровнеЗаписей.Установить(Истина);
	КонецЕсли;
	// -Рарус


КонецПроцедуры

