

/////////////////////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
&НаКлиенте
Перем ВспомогательныеДанные Экспорт;


// Обработчик события возникающего при переключении с одной страницы на другую в контексте сервера.
&НаСервере
Процедура СтраницыПриСменеСтраницыНаСервере()
	
	СтраницаНастроек = Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройки;
	
	Элементы.ФормаРассчитатьЗаказ.КнопкаПоУмолчанию = СтраницаНастроек;
	Элементы.ФормаЗагрузитьРасчетИзФайла.Видимость = СтраницаНастроек;
	
	Элементы.ФормаДобавитьВДокумент.КнопкаПоУмолчанию = НЕ СтраницаНастроек;
	Элементы.ЗаказатьРекомендованное.Видимость = НЕ СтраницаНастроек;
	Элементы.ФормаДобавитьВДокумент.Видимость = НЕ СтраницаНастроек;
	Элементы.ФормаОтправитьПочтой.Видимость = НЕ СтраницаНастроек;
	Элементы.ФормаЗакрыть.Видимость = НЕ СтраницаНастроек;
	Элементы.ФормаОтобразитьИсторию.Видимость = НЕ СтраницаНастроек;
	Элементы.ФормаПоказатьРасчет.Видимость = НЕ СтраницаНастроек;
	Элементы.ФормаОтобратьПоТекущемуЗначению.Видимость = НЕ СтраницаНастроек;
	Элементы.ФормаСохранитьРасчетВФайл.Видимость = НЕ СтраницаНастроек;
	
	Если СтраницаНастроек Тогда
		
		
	Иначе
		
		Элементы.ФормаПоказатьРасчет.Видимость = Элементы["Свод" + Сред(Элементы.Страницы.ТекущаяСтраница.Имя,9)].Видимость;
		
		Элементы.ФормаДобавитьВДокумент.Доступность = Истина;
		Элементы.ФормаОтправитьПочтой.Доступность = Истина;
		Элементы.ЗаказатьРекомендованное.Доступность = Истина;
		
		
		
		Попытка
			Расчет = ЭтотОбъект["Расчет" + Сред(Элементы.Страницы.ТекущаяСтраница.Имя,9)];
			
			НетДокумента = Расчет.Области.Найти("Документ")=Неопределено ИЛИ НЕ ЗначениеЗаполнено(Расчет.Область("Документ").Текст);
			
			Элементы.ФормаДобавитьВДокумент.Доступность = НетДокумента;
			Элементы.ФормаОтправитьПочтой.Доступность = НетДокумента;
			Элементы.ЗаказатьРекомендованное.Доступность = НетДокумента;
		Исключение КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры // СтраницыПриСменеСтраницыНаСервере()

// Обработчик события возникающего на клиенте при переключении с одной страницы на другую.
&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	СтраницыПриСменеСтраницыНаСервере();
	
КонецПроцедуры // СтраницыПриСменеСтраницы()

/////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	Элементы.ТекущийГрафик.Видимость	= Объект.ВариантФормирования=0 И НЕ БезГрафика;
	Элементы.СкладКомпании.Видимость	= Объект.ВариантФормирования=0;
	Элементы.СписокМагазинов.Видимость	= Объект.ВариантФормирования<>0;
	
	КонтрагентОбязателен = (Объект.ВариантФормирования=1 ИЛИ Объект.ВариантФормирования=2 ИЛИ (БезГрафика И Объект.ВариантФормирования<>3));
	Элементы.Поставщик.ОтметкаНезаполненного		= КонтрагентОбязателен;
	Элементы.Поставщик.АвтоОтметкаНезаполненного	= КонтрагентОбязателен;
	
	ОснПодразделение = (ПараметрыСеанса.ПодразделениеКомпании=Справочники.ПодразделенияКомпании.ОсновноеПодразделение);

	Элементы.ВариантФормирования.Доступность		= ОснПодразделение;
	Элементы.НеУчитыватьВремяЗаказа.Доступность		= ОснПодразделение И НЕ БезГрафика;
	Элементы.НеУчитыватьАссортимент.Доступность		= ОснПодразделение;
	Элементы.БезГрафика.Доступность					= ОснПодразделение И Объект.ВариантФормирования<>1 И Объект.ВариантФормирования<>3;
	Элементы.СтраховойЗапасВДнях.Доступность		= ОснПодразделение И НЕ БезГрафика;
	Элементы.ГрафикиЦОИМагазинов.Доступность		= ОснПодразделение И Объект.ВариантФормирования=1;
	Элементы.КоличествоЗаказов.Доступность			= Объект.ВариантФормирования<>3;
	Элементы.ПолучитьВесьГрафик.Доступность			= НЕ БезГрафика;
	
	
	//Элементы.ПодразделениеКомпании.ТолькоПросмотр = НЕ ОснПодразделение;
	Элементы.ГруппаФормированиеБезГрафика.Видимость	= БезГрафика;
	
КонецПроцедуры //УправлениеДиалогомНаСервере()

// Обработчик события возникающего на клиенте при выполнении команды "Рассчитать заказ".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура РассчитатьЗаказ(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Поставщик) И НЕ ЗначениеЗаполнено(Объект.ПоставщикРЦ)
		И СписокНоменклатуры.Количество()=0 И КоличествоЗаказов=0 И СписокМагазинов.Количество()=0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Должен быть выбран хотя бы один фильтр.'"), 20, НСтр("ru = 'Отмена действия'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо указать дату !'"), 20, НСтр("ru = 'Отмена действия'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ПодразделениеКомпании) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо указать подразделение !'"), 20, НСтр("ru = 'Отмена действия'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СкладКомпании) И Объект.ВариантФормирования=0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо указать склад !'"), 20, НСтр("ru = 'Отмена действия'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Поставщик) И (Объект.ВариантФормирования=1 ИЛИ Объект.ВариантФормирования=2 ИЛИ БезГрафика) И Объект.ВариантФормирования<>3 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо указать поставщика !'"), 20, НСтр("ru = 'Отмена действия'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ Элементы.ВариантФормирования.Доступность Тогда //только для магазина
		Если Объект.Дата>НачалоДня(ТекущаяДата())+3*86400 Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Указать будущую дату можно не более 3х дней от текущей !'"), 20, НСтр("ru = 'Отмена действия'"));
			Возврат;
		КонецЕсли;
		Если Объект.Дата<НачалоДня(ТекущаяДата()) Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Дата не может быть меньше текущей !'"), 20, НСтр("ru = 'Отмена действия'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;

	//скроем ранее сформированные страницы
	//Для Каждого текСтраница Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
	//	Если Лев(текСтраница.Имя,8)="Страница" И текСтраница<>Элементы.СтраницаНастройки Тогда
	//		//ЭтотОбъект["Расчет" + Сред(текСтраница.Имя,9)] = Неопределено;
	//		текСтраница.Видимость = Ложь;
	//	КонецЕсли;
	//КонецЦикла;
	
	СформироватьГрафик();
	
КонецПроцедуры // РассчитатьЗаказ()

// Обработчик события возникающего на клиенте при выполнении команды "Рассчитать заказ".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура РассчитатьЗаказПоСтрокам(Команда)
	
	//Если НачалоДня(Объект.СрокПоставки) < НачалоДня(Объект.Дата) Тогда
	//	ПоказатьПредупреждение(, НСтр("ru = 'Срок поставки должен быть больше даты расчета.'"), 20, НСтр("ru = 'Отмена действия'"));
	//	Возврат;
	//КонецЕсли;
	//
	//Если НачалоДня(Объект.СрокПоставки) < НачалоДня(Объект.Дата) Тогда
	//	ПоказатьПредупреждение(, НСтр("ru = 'Срок поставки должен быть больше даты расчета.'"), 20, НСтр("ru = 'Отмена действия'"));
	//	Возврат;
	//КонецЕсли;
	//
	//Если НачалоДня(Объект.СрокПоставки) > НачалоДня(Объект.СрокСледующейПоставки) Тогда
	//	ПоказатьПредупреждение(, НСтр("ru = 'Срок следующей поставки должен быть больше текущего срока поставки.'"), 20, НСтр("ru = 'Отмена действия'"));
	//	Возврат;
	//КонецЕсли;
	//
	//Если НачалоДня(Объект.НачалоПериодаВыборки) > НачалоДня(Объект.КонецПериодаВыборки) Тогда
	//	ПоказатьПредупреждение(, НСтр("ru = 'Начало перода продаж должно быть больше окончания перода продаж.'"), 20, НСтр("ru = 'Отмена действия'"));
	//	Возврат;
	//КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(Объект.Поставщик) И НЕ ЗначениеЗаполнено(Объект.ПоставщикРЦ) И СписокНоменклатуры.Количество()=0 И КоличествоЗаказов=0 Тогда
	//	ПоказатьПредупреждение(, НСтр("ru = 'Должен быть выбран хотябы один фильтр.'"), 20, НСтр("ru = 'Отмена действия'"));
	//	Возврат;
	//КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо указать дату !'"), 20, НСтр("ru = 'Отмена действия'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ПодразделениеКомпании) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо указать подразделение !'"), 20, НСтр("ru = 'Отмена действия'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СкладКомпании) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо указать склад !'"), 20, НСтр("ru = 'Отмена действия'"));
		Возврат;
	КонецЕсли;

	//скроем ранее сформированные страницы
	//Для Каждого текСтраница Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
	//	Если Лев(текСтраница.Имя,8)="Страница" И текСтраница<>Элементы.СтраницаНастройки Тогда
	//		//ЭтотОбъект["Расчет" + Сред(текСтраница.Имя,9)] = Неопределено;
	//		текСтраница.Видимость = Ложь;
	//	КонецЕсли;
	//КонецЦикла;
	
	СформироватьПоГрафику();		
	
КонецПроцедуры // РассчитатьЗаказ()

&НаСервере
Процедура СформироватьПоГрафику()
	
	ПараметрыРасчета = Новый Структура("ДатаЗаказа,Контрагент,СубПоставщик,Номенклатура,СрокПоставки,ВремяПринятия,СтраховойЗапас,ВариантРасчета,ПромежутокДней,ДнейПродаж,ОтборНоменклатуры,Исключения,ОтборПользователя,Подразделение,БиржевыеТовары,ВремяФормирования,СогласованныеЦены,НачалоАнализаПродаж,КонецАнализаПродаж");
	
	//добавим отборы групп с формы
	ОтборПользователя = СписокНоменклатуры.ВыгрузитьЗначения();//Новый Массив;
	//Для Каждого СтрокаСписка Из СписокНоменклатуры Цикл
	//    ОтборПользователя.Добавить(СтрокаСписка.Значение);
	//КонецЦикла;	
	
	МассивВыбранныхСтрок = Элементы.ТекущийГрафик.ВыделенныеСтроки;
	
	Если Объект.Специфика="Семья" Тогда
		ЗапросБиржи = Новый Запрос("ВЫБРАТЬ	Ссылка ИЗ Справочник.Номенклатура ГДЕ НЕ ЭтоГруппа И смБонуснаяГруппа.Наименование ПОДОБНО ""%биржа%""");
		БиржевыеТовары = ЗапросБиржи.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Иначе
		БиржевыеТовары = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	//обработка графика
	Для Каждого СтрокаГрафика Из ТекущийГрафик Цикл
		
		Если МассивВыбранныхСтрок.Найти(СтрокаГрафика.ПолучитьИдентификатор())=Неопределено Тогда //если строка не выделена, то не используем её
			Продолжить;
		КонецЕсли;
		
		текОтборПользователя = ОтборПользователя;
		
		Если НЕ Объект.НеУчитыватьВремяЗаказа Тогда
			Если Объект.Специфика="мясницкий" И СтрокаГрафика.Контрагент.ЕРПМастерКлюч="00000019376" Тогда
				текОтборПользователя = РеквизитФормыВЗначение("Объект").ПолучитьНоменклатуруПоВидамЗаказа(Объект.ПодразделениеКомпании);
				
				Если текОтборПользователя.Количество()=0 Тогда Продолжить; КонецЕсли;
				
			ИначеЕсли ЗначениеЗаполнено(СтрокаГрафика.ВремяПринятияЗаказа) И НачалоДня(Объект.Дата)=НачалоДня(ТекущаяДата())
				И СтрокаГрафика.ВремяПринятияЗаказа < Дата(0001,01,01,Час(ТекущаяДата()),Минута(ТекущаяДата()),Секунда(ТекущаяДата())) Тогда
				
				Сообщить("Текущее время, превышает время принятия заказа по графику(" + Формат(СтрокаГрафика.ВремяПринятияЗаказа,"ДФ=ЧЧ:мм") + ")," + ?(ЗначениеЗаполнено(СтрокаГрафика.Номенклатура)," по группе """ + СтрокаГрафика.Номенклатура + """", "") + " для поставщика: """ + СтрокаГрафика.Контрагент + """" + ?(ЗначениеЗаполнено(СтрокаГрафика.СубПоставщик), ", (субпоставщик: " + СтрокаГрафика.СубПоставщик + ")", "") + ".");
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыРасчета.ДатаЗаказа			= НачалоДня(Объект.Дата);
		ПараметрыРасчета.Контрагент			= СтрокаГрафика.Контрагент;
		ПараметрыРасчета.СубПоставщик		= СтрокаГрафика.СубПоставщик;
		ПараметрыРасчета.Номенклатура		= ?(ЗначениеЗаполнено(СтрокаГрафика.СегментНоменклатуры), СтрокаГрафика.СегментНоменклатуры, СтрокаГрафика.Номенклатура);
		ПараметрыРасчета.СрокПоставки		= СтрокаГрафика.СрокПоставки;
		ПараметрыРасчета.ВремяПринятия		= СтрокаГрафика.ВремяПринятияЗаказа;
		ПараметрыРасчета.СтраховойЗапас		= ?(СтрокаГрафика.СтраховойЗапас=0, СтраховойЗапасВДнях, СтрокаГрафика.СтраховойЗапас);
		ПараметрыРасчета.ВариантРасчета		= СтрокаГрафика.ВариантРасчета;
		ПараметрыРасчета.ПромежутокДней		= СтрокаГрафика.ПромежутокДней;
		ПараметрыРасчета.Подразделение		= Объект.ПодразделениеКомпании;
		ПараметрыРасчета.ОтборНоменклатуры	= СтрокаГрафика.ОтборНоменклатуры.ВыгрузитьЗначения();
		ПараметрыРасчета.Исключения			= СтрокаГрафика.ИсключенияНоменклатуры.ВыгрузитьЗначения();
		ПараметрыРасчета.ДнейПродаж			= 0;
		ПараметрыРасчета.ОтборПользователя	= текОтборПользователя;
		ПараметрыРасчета.НачалоАнализаПродаж= НачалоАнализаПродаж;
		ПараметрыРасчета.КонецАнализаПродаж	= КонецАнализаПродаж;
		ПараметрыРасчета.БиржевыеТовары		= БиржевыеТовары;
		
		ВремяНачалаФормирования = ТекущаяДата();
		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ВсеОк = ОбработкаОбъект.РассчитатьЗаказНаСервере(ПараметрыРасчета);
		
		ПараметрыРасчета.ВремяФормирования	= ТекущаяДата() - ВремяНачалаФормирования;
		
		Если ВсеОк Тогда
			ЗначениеВРеквизитФормы(ОбработкаОбъект.Товары, "Объект.Товары");
			ДобавитьСтраницуЗаказа(ПараметрыРасчета);
		КонецЕсли;
		
	КонецЦикла
	
КонецПроцедуры //СформироватьПоГрафику()

&НаСервере
Процедура СформироватьГрафик(БезПечати=Ложь, Быстро=Ложь)
	
	//тзПредыдущихЗаказов = Новый ТаблицаЗначений;
	//тзПредыдущихЗаказов.Колонки.Добавить("Заказ",					Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику"));
	//тзПредыдущихЗаказов.Колонки.Добавить("Дата",					Новый ОписаниеТипов("Дата"));
	//тзПредыдущихЗаказов.Колонки.Добавить("Подразделение",			Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
	//тзПредыдущихЗаказов.Колонки.Добавить("Контрагент",				Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	//тзПредыдущихЗаказов.Колонки.Добавить("СубПоставщик",			Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	//тзПредыдущихЗаказов.Колонки.Добавить("ОграничениеНоменклатуры",	Новый ОписаниеТипов("СправочникСсылка.Номенклатура, СправочникСсылка.СегментыНоменклатуры"));
	
	Если БезГрафика Тогда
		
		тзГрафик = Новый ТаблицаЗначений;
		тзГрафик.Колонки.Добавить("Подразделение",			Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
		тзГрафик.Колонки.Добавить("Контрагент",				Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		тзГрафик.Колонки.Добавить("Номенклатура",			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		тзГрафик.Колонки.Добавить("СегментНоменклатуры",	Новый ОписаниеТипов("СправочникСсылка.СегментыНоменклатуры"));
		тзГрафик.Колонки.Добавить("ДниНедели",				Новый ОписаниеТипов("Строка"));
		тзГрафик.Колонки.Добавить("ДниНеделиПоставки",		Новый ОписаниеТипов("Строка"));
		тзГрафик.Колонки.Добавить("Неделя",					Новый ОписаниеТипов("Число"));
		тзГрафик.Колонки.Добавить("Периодичность",			Новый ОписаниеТипов("Число"));
		тзГрафик.Колонки.Добавить("СрокПоставки",			Новый ОписаниеТипов("Число"));
		тзГрафик.Колонки.Добавить("СтраховойЗапас",			Новый ОписаниеТипов("Число"));
		тзГрафик.Колонки.Добавить("ВремяПринятияЗаказа",	Новый ОписаниеТипов("Дата"));
		тзГрафик.Колонки.Добавить("ВариантРасчета",			Новый ОписаниеТипов("Число"));
		тзГрафик.Колонки.Добавить("СубПоставщик",			Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		тзГрафик.Колонки.Добавить("ФормированиеЗаказаВЦО",	Новый ОписаниеТипов("Булево"));
		тзГрафик.Колонки.Добавить("ПромежутокДней",			Новый ОписаниеТипов("Число"));
		тзГрафик.Колонки.Добавить("ДатаЗаказа",				Новый ОписаниеТипов("Дата"));
		тзГрафик.Колонки.Добавить("ДатаПоследнегоЗаказа",	Новый ОписаниеТипов("Дата"));
		тзГрафик.Колонки.Добавить("ДатаСледующегоЗаказа",	Новый ОписаниеТипов("Дата"));
		тзГрафик.Колонки.Добавить("ОтборНоменклатуры",		Новый ОписаниеТипов("Массив"));
		тзГрафик.Колонки.Добавить("ИсключенияНоменклатуры",	Новый ОписаниеТипов("Массив"));
		тзГрафик.Колонки.Добавить("Заказ",					Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику"));
		
		СтрокаГрафика = тзГрафик.Добавить();
		СтрокаГрафика.Подразделение			= Объект.ПодразделениеКомпании;
		СтрокаГрафика.Контрагент			= Объект.Поставщик;
		СтрокаГрафика.СубПоставщик			= Объект.ПоставщикРЦ;
		СтрокаГрафика.ФормированиеЗаказаВЦО = Объект.ФормированиеЗаказаВЦО;
		СтрокаГрафика.ПромежутокДней		= ДнейРасчета;
		СтрокаГрафика.ДатаЗаказа			= Объект.Дата;
		СтрокаГрафика.СрокПоставки			= (ДатаПоставки - Объект.Дата) / 86400;
		СтрокаГрафика.ДатаСледующегоЗаказа	= НачалоДня(Объект.Дата) + 86400;
		СтрокаГрафика.СтраховойЗапас		= СтраховойЗапасВДнях;
		
	Иначе
		
		ПараметрыГрафиков = Новый Структура("ПолучитьВесьГрафик,ГрафикиЦОИМагазинов,СтраховойЗапасВДнях,МассивПодразделений, МассивНоменклатуры", ПолучитьВесьГрафик, ГрафикиЦОИМагазинов, СтраховойЗапасВДнях, СписокМагазинов.ВыгрузитьЗначения(), СписокНоменклатуры.ВыгрузитьЗначения());
		
		тзГрафик = РеквизитФормыВЗначение("Объект").ПолучитьГрафики(ПараметрыГрафиков);
		
	КонецЕсли;
	
	ПараметрыРасчета = Новый Структура("ДатаЗаказа,Контрагент,СубПоставщик,Номенклатура,СрокПоставки,ВремяПринятия,СтраховойЗапас,ВариантРасчета,ПромежутокДней,ДнейПродаж,ОтборНоменклатуры,Исключения,ОтборПользователя,Подразделение,БиржевыеТовары,ВремяФормирования,СогласованныеЦены,НачалоАнализаПродаж,КонецАнализаПродаж");
	
	Если Объект.Специфика="Семья" Тогда
		ЗапросБиржи = Новый Запрос("ВЫБРАТЬ	Ссылка ИЗ Справочник.Номенклатура ГДЕ НЕ ЭтоГруппа И смБонуснаяГруппа.Наименование ПОДОБНО ""%биржа%""");
		БиржевыеТовары = ЗапросБиржи.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Иначе
		БиржевыеТовары = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	//добавим отборы групп с формы
	ОтборПользователя = СписокНоменклатуры.ВыгрузитьЗначения();//Новый Массив;
	//Для Каждого СтрокаСписка Из СписокНоменклатуры Цикл
	//    ОтборПользователя.Добавить(СтрокаСписка.Значение);
	//КонецЦикла;	
	
	СогласованныеЦены = РеквизитФормыВЗначение("Объект").ПолучитьСогласованныеЦены(ОтборПользователя, БиржевыеТовары);
	
	Объект.Товары.Очистить();
	
	Ном = 0;
	ВремяФормирования = 0;
	
	//обработка графика
	Для Каждого СтрокаГрафика Из тзГрафик Цикл
		
		Если КоличествоЗаказов<>0 И Ном>=КоличествоЗаказов И НЕ БезПечати Тогда
			Прервать;
		КонецЕсли;
		
		//пропускаем графики на другую дату
		Если НачалоДня(СтрокаГрафика.ДатаЗаказа)<>НачалоДня(Объект.Дата) Тогда
			Продолжить;
		КонецЕсли;
		
		текОтборПользователя = ОтборПользователя;
		
		Если НЕ Объект.НеУчитыватьВремяЗаказа Тогда 
			Если Объект.Специфика="мясницкий" И СтрокаГрафика.Контрагент.ЕРПМастерКлюч="00000019376" Тогда
				текОтборПользователя = РеквизитФормыВЗначение("Объект").ПолучитьНоменклатуруПоВидамЗаказа(СтрокаГрафика.Подразделение);
				
				Если текОтборПользователя.Количество()=0 Тогда Продолжить; КонецЕсли;
				
			ИначеЕсли ЗначениеЗаполнено(СтрокаГрафика.ВремяПринятияЗаказа) И НачалоДня(Объект.Дата)=НачалоДня(ТекущаяДата())
				И СтрокаГрафика.ВремяПринятияЗаказа < Дата(0001,01,01,Час(ТекущаяДата()),Минута(ТекущаяДата()),Секунда(ТекущаяДата())) Тогда
			
				Сообщить("Текущее время, превышает время принятия заказа по графику(" + Формат(СтрокаГрафика.ВремяПринятияЗаказа,"ДФ=ЧЧ:мм") + ")," + ?(ЗначениеЗаполнено(СтрокаГрафика.Номенклатура)," по группе """ + СтрокаГрафика.Номенклатура + """", "") + " для поставщика: """ + СтрокаГрафика.Контрагент + """" + ?(ЗначениеЗаполнено(СтрокаГрафика.СубПоставщик), ", (субпоставщик: " + СтрокаГрафика.СубПоставщик + ")", "") + ".");
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если Быстро Тогда
			
			//ОграничениеНоменклатуры = ?(ЗначениеЗаполнено(СтрокаГрафика.СегментНоменклатуры), СтрокаГрафика.СегментНоменклатуры, СтрокаГрафика.Номенклатура);
			//СтруктураОтбора = Новый Структура("Дата,Подразделение,Контрагент,СубПоставщик,ОграничениеНоменклатуры", НачалоДня(Объект.Дата), Объект.ПодразделениеКомпании, СтрокаГрафика.Контрагент, СтрокаГрафика.СубПоставщик, ОграничениеНоменклатуры);
			//МассивЗаказов = тзПредыдущихЗаказов.НайтиСтроки(СтруктураОтбора);
			
			//Если МассивЗаказов.Количество()=0 ИЛИ ПолучитьВесьГрафик Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаГрафика.Заказ) ИЛИ ПолучитьВесьГрафик Тогда
				СтрокаТекГрафика = ТекущийГрафик.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТекГрафика, СтрокаГрафика,,"ОтборНоменклатуры,ИсключенияНоменклатуры");
				СтрокаТекГрафика.ОтборНоменклатуры.ЗагрузитьЗначения(СтрокаГрафика.ОтборНоменклатуры);
				СтрокаТекГрафика.ИсключенияНоменклатуры.ЗагрузитьЗначения(СтрокаГрафика.ИсключенияНоменклатуры);
				Если СтрокаТекГрафика.ВремяПринятияЗаказа=Дата("00010101235959") Тогда
					СтрокаТекГрафика.ВремяПринятияЗаказа=Дата("00010101");
				КонецЕсли;
				//Если МассивЗаказов.Количество()>0 Тогда
				//	СтрокаТекГрафика.Заказ = МассивЗаказов[0].Заказ;
				//КонецЕсли;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДнейПоставки) Тогда
			СтрокаГрафика.СрокПоставки = ДнейПоставки;
		КонецЕсли;
		
		ПараметрыРасчета.ДатаЗаказа			= СтрокаГрафика.ДатаЗаказа;
		ПараметрыРасчета.Контрагент			= СтрокаГрафика.Контрагент;
		ПараметрыРасчета.СубПоставщик		= СтрокаГрафика.СубПоставщик;
		ПараметрыРасчета.Номенклатура		= ?(ЗначениеЗаполнено(СтрокаГрафика.СегментНоменклатуры), СтрокаГрафика.СегментНоменклатуры, СтрокаГрафика.Номенклатура);
		ПараметрыРасчета.СрокПоставки		= СтрокаГрафика.СрокПоставки;
		ПараметрыРасчета.ВремяПринятия		= СтрокаГрафика.ВремяПринятияЗаказа;
		ПараметрыРасчета.СтраховойЗапас		= ?(СтрокаГрафика.СтраховойЗапас=0, СтраховойЗапасВДнях, СтрокаГрафика.СтраховойЗапас);
		ПараметрыРасчета.ВариантРасчета		= СтрокаГрафика.ВариантРасчета;
		ПараметрыРасчета.ПромежутокДней		= СтрокаГрафика.ПромежутокДней;
		ПараметрыРасчета.ОтборНоменклатуры	= СтрокаГрафика.ОтборНоменклатуры;
		ПараметрыРасчета.Исключения			= СтрокаГрафика.ИсключенияНоменклатуры;
		ПараметрыРасчета.ДнейПродаж			= 0;
		ПараметрыРасчета.Подразделение		= СтрокаГрафика.Подразделение;
		ПараметрыРасчета.ОтборПользователя	= текОтборПользователя;
		ПараметрыРасчета.БиржевыеТовары		= БиржевыеТовары;
		ПараметрыРасчета.СогласованныеЦены	= СогласованныеЦены;
		ПараметрыРасчета.ВремяФормирования	= ТекущаяДата();
		ПараметрыРасчета.НачалоАнализаПродаж= НачалоАнализаПродаж;
		ПараметрыРасчета.КонецАнализаПродаж	= КонецАнализаПродаж;
		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ВсеОк = ОбработкаОбъект.РассчитатьЗаказНаСервере(ПараметрыРасчета);
		
		Если ВсеОк Тогда
			ЗначениеВРеквизитФормы(ОбработкаОбъект.Товары, "Объект.Товары");
			Ном = Ном + 1;
		КонецЕсли;
		
		Если Объект.ВариантФормирования=1 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВсеОк Тогда
			//ОграничениеНоменклатуры = ?(ЗначениеЗаполнено(СтрокаГрафика.СегментНоменклатуры), СтрокаГрафика.СегментНоменклатуры, СтрокаГрафика.Номенклатура);
			//СтруктураОтбора = Новый Структура("Дата,Подразделение,Контрагент,СубПоставщик,ОграничениеНоменклатуры", НачалоДня(Объект.Дата), Объект.ПодразделениеКомпании, СтрокаГрафика.Контрагент, СтрокаГрафика.СубПоставщик, ОграничениеНоменклатуры);
			//МассивЗаказов = тзПредыдущихЗаказов.НайтиСтроки(СтруктураОтбора);
			
			//Если МассивЗаказов.Количество()=0 ИЛИ ПолучитьВесьГрафик Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаГрафика.Заказ) ИЛИ ПолучитьВесьГрафик Тогда
				Если БезПечати Тогда
					СтрокаТекГрафика = ТекущийГрафик.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТекГрафика, СтрокаГрафика,,"ОтборНоменклатуры,ИсключенияНоменклатуры");
					СтрокаТекГрафика.ОтборНоменклатуры.ЗагрузитьЗначения(СтрокаГрафика.ОтборНоменклатуры);
					СтрокаТекГрафика.ИсключенияНоменклатуры.ЗагрузитьЗначения(СтрокаГрафика.ИсключенияНоменклатуры);
					Если СтрокаТекГрафика.ВремяПринятияЗаказа=Дата("00010101235959") Тогда
						СтрокаТекГрафика.ВремяПринятияЗаказа = Дата("00010101");
					КонецЕсли;
					//Если МассивЗаказов.Количество()>0 Тогда
					//	СтрокаТекГрафика.Заказ = МассивЗаказов[0].Заказ;//Заказ;
					//КонецЕсли;
				Иначе
					ДобавитьСтраницуЗаказа(ПараметрыРасчета);
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;
	
	ДнейПоставки = 0;
	
	Если Объект.ВариантФормирования=1 И Объект.Товары.Количество()>0 Тогда
		тзКонтрагентов = Объект.Товары.Выгрузить(,"Контрагент,ВремяПринятия,СрокПоставки,ПромежутокДней"); //,СубПоставщик,ОграничениеНоменклатуры
		тзКонтрагентов.Свернуть("Контрагент,ВремяПринятия,СрокПоставки,ПромежутокДней");
		
		Для Каждого текКонтрагент Из тзКонтрагентов Цикл
			
			ПараметрыРасчета.Контрагент			= текКонтрагент.Контрагент;
			ПараметрыРасчета.ВремяПринятия		= текКонтрагент.ВремяПринятия;
			ПараметрыРасчета.СрокПоставки		= текКонтрагент.СрокПоставки;
			ПараметрыРасчета.ПромежутокДней		= СтрокаГрафика.ПромежутокДней;
			
			ДобавитьСтраницуЗаказа(ПараметрыРасчета);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // СформироватьГрафик()

&НаСервере
Процедура СформироватьГрафикиМагазинов(Знач ПараметрыРасчета)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	График.Подразделение,
	|	График.Контрагент
	|ИЗ
	|	РегистрСведений.ГрафикиЗаказов.СрезПоследних(&НаДату, Истина И Подразделение В(&Подразделение) И Контрагент=&Контрагент И СубПоставщик=ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК График
	|ГДЕ
	|	График.Контрагент<>ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|");
	Запрос.УстановитьПараметр("НаДату", КонецДня(Объект.Дата));
	//Запрос.УстановитьПараметр("ЗаказЦО", Ложь);
	
	МассивПодразделений = СписокМагазинов.ВыгрузитьЗначения();//Новый Массив;
	//Для Каждого СтрокаСписка Из СписокМагазинов Цикл
	//    МассивПодразделений.Добавить(СтрокаСписка.Значение);
	//КонецЦикла;
	Если МассивПодразделений.Количество()=0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Подразделение В(&Подразделение)", "");
	Иначе
		Запрос.УстановитьПараметр("Подразделение", МассивПодразделений);
	КонецЕсли;
	Если Объект.Специфика="Семья" Тогда
		Запрос.УстановитьПараметр("Контрагент", СемьяОпт);
	Иначе
		Если НЕ ЗначениеЗаполнено(Объект.Поставщик) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Контрагент=&Контрагент", "");
		Иначе
			Запрос.УстановитьПараметр("Контрагент", Объект.Поставщик);
		КонецЕсли;
	КонецЕсли;
	
	тзГрафик = Запрос.Выполнить().Выгрузить();
	
	//добавим отборы групп с формы
	ОтборПользователя = СписокНоменклатуры.ВыгрузитьЗначения();//Новый Массив;
	//Для Каждого СтрокаСписка Из СписокНоменклатуры Цикл
	//    ОтборПользователя.Добавить(СтрокаСписка.Значение);
	//КонецЦикла;	
	
	Объект.Товары.Очистить();
	
	//обработка графика
	Для Каждого СтрокаГрафика Из тзГрафик Цикл
		
		ПараметрыРасчета.Контрагент			= СтрокаГрафика.Контрагент;
		//ПараметрыРасчета.СубПоставщик		= СтрокаГрафика.СубПоставщик;
		//ПараметрыРасчета.Номенклатура		= СтрокаГрафика.Номенклатура;
		//ПараметрыРасчета.СрокПоставки		= СтрокаГрафика.СрокПоставки;
		//ПараметрыРасчета.ВремяПринятия		= СтрокаГрафика.ВремяПринятияЗаказа;
		//ПараметрыРасчета.СтраховойЗапас		= СтрокаГрафика.СтраховойЗапас;
		//ПараметрыРасчета.ВариантРасчета		= СтрокаГрафика.ВариантРасчета;
		//ПараметрыРасчета.ПромежутокДней		= СтрокаГрафика.ПромежутокДней;
		//ПараметрыРасчета.ОтборНоменклатуры	= СтрокаГрафика.ОтборНоменклатуры;
		//ПараметрыРасчета.Исключения			= СтрокаГрафика.ИсключенияНоменклатуры;
		//ПараметрыРасчета.ДнейПродаж			= 0;
		ПараметрыРасчета.Подразделение		= СтрокаГрафика.Подразделение;
		ПараметрыРасчета.ОтборПользователя	= ОтборПользователя;
		//ПараметрыРасчета.БиржевыеТовары		= БиржевыеТовары;
		//ПараметрыРасчета.СогласованныеЦены	= СогласованныеЦены;
		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ВсеОк = ОбработкаОбъект.РассчитатьЗаказНаСервере(ПараметрыРасчета);
		
		Если ВсеОк Тогда
			ЗначениеВРеквизитФормы(ОбработкаОбъект.Товары, "Объект.Товары");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //СформироватьГрафикиМагазинов()

&НаСервере
Процедура ДобавитьСтраницуЗаказа(ПараметрыРасчета);        ///////////////////////////////////СТРАНИЦА
	
	
	Если ПараметрыРасчета.Свойство("Расчет") Тогда //грузим данные из файла
		Готовые = Истина;
		ЕстьСвод = ПараметрыРасчета.Свод.ВысотаТаблицы>1;
	Иначе	
		Готовые = Ложь;
		ЕстьСвод = Ложь;
	    Контрагент		= ПараметрыРасчета.Контрагент;
		СубПоставщик	= ПараметрыРасчета.СубПоставщик;
		ВремяПринятия	= ПараметрыРасчета.ВремяПринятия;
	КонецЕсли;
	
	
	НР = Формат(Элементы.Количество() + 1,"ЧДЦ=0; ЧГ=");
	ИмяСтраницы = "Страница"+НР;
	Страница = Элементы.Добавить(ИмяСтраницы ,Тип("ГруппаФормы"),Элементы.Страницы);
	Если Готовые Тогда
		Страница.Заголовок = ПараметрыРасчета.Имя;
	Иначе
		
		Если ЗначениеЗаполнено(СубПоставщик) Тогда
			Страница.Заголовок = СокрЛП(СубПоставщик);
		ИначеЕсли ЗначениеЗаполнено(Контрагент) Тогда
			Страница.Заголовок = СокрЛП(Контрагент);
		Иначе
			Страница.Заголовок = "Фрукты и овощи";
		КонецЕсли;
		Если ЗначениеЗаполнено(ВремяПринятия) И ВремяПринятия<>Дата("00010101235959") Тогда
			 Страница.Заголовок = Страница.Заголовок + " (" + Формат(ВремяПринятия, "ДФ=ЧЧ:мм") + ")"
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Страница;
	
	
	Реквизиты = Новый Массив;
	
	ИмяРасчета = "Расчет" + НР;
	Расчет = Новый РеквизитФормы(ИмяРасчета, Новый ОписаниеТипов("ТабличныйДокумент"), "", ИмяРасчета);
	Реквизиты.Добавить(Расчет);
	
	ИмяСвода = "Свод" + НР;
	Свод = Новый РеквизитФормы(ИмяСвода, Новый ОписаниеТипов("ТабличныйДокумент"), "", ИмяСвода);
	Реквизиты.Добавить(Свод);
	
	ИмяИстория = "История" + НР;
	История = Новый РеквизитФормы(ИмяИстория, Новый ОписаниеТипов("ТабличныйДокумент"), "", ИмяИстория);
	Реквизиты.Добавить(История);
	
	ИмяОтбор = "ОтборСвод" + НР;
	Отбор = Новый РеквизитФормы(ИмяОтбор, Новый ОписаниеТипов("СписокЗначений"), "", ИмяОтбор);
	Реквизиты.Добавить(Отбор);

	ИзменитьРеквизиты(Реквизиты);
	
	
	ИмяПоляГГ = "ПолеГГ" + НР;
	ПолеГГ = Элементы.Добавить(ИмяПоляГГ, Тип("ГруппаФормы"),Страница);
	ПолеГГ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ПолеГГ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ПолеГГ.ОтображатьЗаголовок = Ложь;
	
	
	ИмяПоляВГ = "ПолеВГ" + НР;
	ПолеВГ = Элементы.Добавить(ИмяПоляВГ, Тип("ГруппаФормы"),ПолеГГ);
	ПолеВГ.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ПолеВГ.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ПолеВГ.ОтображатьЗаголовок = Ложь;
	
	
	ПолеСвод = Элементы.Добавить(ИмяСвода, Тип("ПолеФормы"),ПолеВГ);
	ПолеСвод.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
	ПолеСвод.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеСвод.ПутьКДанным = ИмяСвода;
	ПолеСвод.ОтображатьЗаголовки = Истина;
	ПолеСвод.Видимость = Объект.ФормированиеСводногоЗаказа ИЛИ ЕстьСвод;
	
	ПолеРасчет = Элементы.Добавить(ИмяРасчета, Тип("ПолеФормы"),ПолеВГ);
	ПолеРасчет.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
	ПолеРасчет.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеРасчет.ПутьКДанным = ИмяРасчета;
	ПолеРасчет.ОтображатьЗаголовки = Истина;
	
	
	ПолеИстория = Элементы.Добавить(ИмяИстория, Тип("ПолеФормы"),ПолеГГ);
	ПолеИстория.Вид = ВидПоляФормы.ПолеТабличногоДокумента;
	ПолеИстория.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеИстория.ПутьКДанным = ИмяИстория;
	ПолеИстория.Ширина = 15;
	ПолеИстория.АвтоМаксимальнаяШирина = Ложь;
	ПолеИстория.Видимость = Ложь;
	//ЭтотОбъект[ИмяИстория] = РеквизитФормыВЗначение("Объект").СформироватьИсторию(ПараметрыИстории);
	//Элементы[ИмяИстория].УстановитьДействие("ПриИзмененииСодержимогоОбласти", "тдПриИзмененииСодержимогоОбласти");
	История = ЭтотОбъект[ИмяИстория];  
	
	Если Объект.ВариантФормирования=2 ИЛИ Объект.ВариантФормирования=3 ИЛИ ЕстьСвод Тогда
		ЭтотОбъект[ИмяСвода] = ?(Готовые, ПараметрыРасчета.Свод, РеквизитФормыВЗначение("Объект").СформироватьТаблицуЗаказа(ПараметрыРасчета, Истина));
		Элементы[ИмяСвода].УстановитьДействие("ПриИзмененииСодержимогоОбласти", "сводПриИзмененииСодержимогоОбласти");
		Элементы[ИмяСвода].УстановитьДействие("ОбработкаРасшифровки", "сводОбработкаРасшифровки");
		Элементы[ИмяСвода].УстановитьДействие("Выбор", "сводОбработкаВыбора");
		Элементы[ИмяСвода].УстановитьДействие("ПриАктивизации", "сводПриАктивизации");
		Свод = ЭтотОбъект[ИмяСвода];  
		
		
		///////////////////////////////////////////БЛОК ОТБОРОВ
		//ИмяОтбор = "ОтборСвод" + НР;
		//Реквизиты = Новый Массив;
		//Отбор = Новый РеквизитФормы(ИмяОтбор, Новый ОписаниеТипов("СписокЗначений"), "", ИмяОтбор);
		//Реквизиты.Добавить(Отбор);
		//ИзменитьРеквизиты(Реквизиты);
		
		Если Готовые Тогда
			Отбор = ПараметрыРасчета.ОтборСвод;
			ЭтотОбъект[ИмяОтбор] = Отбор;
		Иначе	
			Расчет = ЭтотОбъект[ИмяСвода];
			Для ч=1 по 10 Цикл
				Если нрег(Лев(Расчет.Область(ч,1).Текст,5)) = "отбор" Тогда
					Расчет.Область(ч,1).Текст = Сред(Расчет.Область(ч,1).Текст,6);
					Отбор = Новый СписокЗначений;
					Отбор.Добавить(ч);  //в нулевом индексе будем хранить номер строки отборов
					
					Для чч = 1 по Расчет.ШиринаТаблицы Цикл
						Текст = Расчет.Область(ч,чч).Текст;
						Отбор.Добавить(Текст+"-"+чч);
						Расчет.Область(ч,чч).Текст = "";
					КонецЦикла;
					ЭтотОбъект[ИмяОтбор] = Отбор;
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
			ЭтотОбъект[ИмяСвода] = Расчет;
		КонецЕсли;
		///////////////////////////////////////////БЛОК ОТБОРОВ
	КонецЕсли;

	Если Объект.ВариантФормирования=2 ИЛИ Объект.ВариантФормирования=3 Тогда
		ПараметрыРасчета.ВремяФормирования = ТекущаяДата();
		//получим графики магазинов и определим товары магазинов
		СформироватьГрафикиМагазинов(ПараметрыРасчета);
		РассчитатьИтогиДляСвода(ИмяСвода);
	КонецЕсли;
	
	ЭтотОбъект[ИмяРасчета] = ?(Готовые, ПараметрыРасчета.Расчет,РеквизитФормыВЗначение("Объект").СформироватьТаблицуЗаказа(ПараметрыРасчета));
	Элементы[ИмяРасчета].УстановитьДействие("ПриИзмененииСодержимогоОбласти", "тдПриИзмененииСодержимогоОбласти");
	Элементы[ИмяРасчета].УстановитьДействие("ОбработкаРасшифровки", "тдОбработкаРасшифровки");
	//Элементы[ИмяРасчета].УстановитьДействие("Выбор", "тдОбработкаВыбора");
	Элементы[ИмяРасчета].УстановитьДействие("ПриАктивизации", "тдПриАктивизации");
	Расчет = ЭтотОбъект[ИмяРасчета];  

	//определим видимость колонок
	/////////////////////////////
	Для НомКол=1 По Расчет.ШиринаТаблицы Цикл
		ИмяКолонки = Расчет.Область(1, НомКол).Текст;
		
		Если Объект.ВариантФормирования=1 ИЛИ Объект.ВариантФормирования=2 Тогда
			Если ИмяКолонки="Завтра" Тогда
				Расчет.Область("C"+Формат(НомКол,"ЧН=; ЧГ=")).ШиринаКолонки = 0;
			ИначеЕсли ИмяКолонки="ВБудущем" Тогда
				Расчет.Область("C"+Формат(НомКол,"ЧН=; ЧГ=")).ШиринаКолонки = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	/////////////////////////////
	
	///////////////////////////////////////////БЛОК ОТБОРОВ
	Элементы[ИмяРасчета].УстановитьДействие("Выбор", "тдОбработкаВыбора");
	ИмяОтбор = "Отбор" + НР;
	Реквизиты = Новый Массив;
	Отбор = Новый РеквизитФормы(ИмяОтбор, Новый ОписаниеТипов("СписокЗначений"), "", ИмяОтбор);
	Реквизиты.Добавить(Отбор);
	ИзменитьРеквизиты(Реквизиты);
	
	Если Готовые Тогда
		Отбор = ПараметрыРасчета.Отбор;
		ЭтотОбъект[ИмяОтбор] = Отбор;
	Иначе	
		Расчет = ЭтотОбъект[ИмяРасчета];
		Для ч=1 по 10 Цикл
			Если нрег(Лев(Расчет.Область(ч,1).Текст,5)) = "отбор" Тогда
				Расчет.Область(ч,1).Текст = Сред(Расчет.Область(ч,1).Текст,6);
				Отбор = Новый СписокЗначений;
				Отбор.Добавить(ч); //в нулевом индексе будем хранить номер строки отборов
				
				Для чч = 1 по Расчет.ШиринаТаблицы Цикл
					Текст = Расчет.Область(ч,чч).Текст;
					Отбор.Добавить(Текст+"-"+чч);
					Расчет.Область(ч,чч).Текст = "";
				КонецЦикла;
				ЭтотОбъект[ИмяОтбор] = Отбор;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		ЭтотОбъект[ИмяРасчета] = Расчет;
	КонецЕсли;
	///////////////////////////////////////////БЛОК ОТБОРОВ
	
	Если Объект.ВариантФормирования=2 ИЛИ Объект.ВариантФормирования=3 Тогда
		Объект.Товары.Очистить();
	КонецЕсли;
	
	СтраницыПриСменеСтраницыНаСервере();
	
КонецПроцедуры //ДобавитьСтраницуЗаказа()

&НаСервере
Процедура РассчитатьИтогиДляСвода(ИмяСвода)
	
	тзИтогов = Объект.Товары.Выгрузить(,"Номенклатура,КоличествоПродаж,СреднесуточнаяПродажа,РекомендуемоеКоличество,КоличествоСУчетомКратности,ОстатокНаСкладе,ПродажаЗаПериод,ДопЗапасНаАкцию,ПоставкаЗавтра,ПоставкаВБудущем");
	тзИтогов.Свернуть("Номенклатура", "КоличествоПродаж,СреднесуточнаяПродажа,РекомендуемоеКоличество,КоличествоСУчетомКратности,ОстатокНаСкладе,ПродажаЗаПериод,ДопЗапасНаАкцию,ПоставкаЗавтра,ПоставкаВБудущем");
	тзИтогов.Индексы.Добавить("Номенклатура");
	
	Свод = ЭтотОбъект[ИмяСвода];
	
	колТовар = 0; колКолПродаж = 0; колСредПродаж = 0; колОстаток = 0; колРекОкр = 0; колРекРасч = 0; колПрПрод = 0; колДопЗапас = 0; колЗавтра = 0; колВБудущем = 0;
	
	Для НомКол=1 По Свод.ШиринаТаблицы Цикл
		ИмяКолонки = Свод.Область(1, НомКол).Текст;
		
		Если ИмяКолонки="Товар" Тогда
			колТовар = НомКол;
		ИначеЕсли ИмяКолонки="КолПродаж" Тогда
			колКолПродаж = НомКол;
		ИначеЕсли ИмяКолонки="СредПродаж" Тогда
			колСредПродаж = НомКол;
		ИначеЕсли ИмяКолонки="Остаток" Тогда
			колОстаток = НомКол;
		ИначеЕсли ИмяКолонки="РекОкр" Тогда
			колРекОкр = НомКол;
		ИначеЕсли ИмяКолонки="РекРасч" Тогда
			колРекРасч = НомКол;
		ИначеЕсли ИмяКолонки="ПрПрод" Тогда
			колПрПрод = НомКол;
		ИначеЕсли ИмяКолонки="ДопЗапас" Тогда
			колДопЗапас = НомКол;
		ИначеЕсли ИмяКолонки="Завтра" Тогда
			колЗавтра = НомКол;
		ИначеЕсли ИмяКолонки="ВБудущем" Тогда
			колВБудущем = НомКол;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураОтбора = Новый Структура("Номенклатура");
	
	Для С=Свод.ФиксацияСверху+1 По Свод.ВысотаТаблицы Цикл
		Номенклатура = Свод.Область(с, колТовар).Расшифровка;
		
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда Продолжить; КонецЕсли;
		
		СтруктураОтбора.Номенклатура = Номенклатура;
		
		текИтог = тзИтогов.НайтиСтроки(СтруктураОтбора);
		
		Если текИтог.Количество()>0 Тогда
			СтрокаИтога = текИтог[0];
			
			Свод.Область(с, колКолПродаж).Текст		= СтрокаИтога.КоличествоПродаж;
			Свод.Область(с, колСредПродаж).Текст	= СтрокаИтога.СреднесуточнаяПродажа;
			Свод.Область(с, колОстаток).Текст		= СтрокаИтога.ОстатокНаСкладе;
			Свод.Область(с, колРекОкр).Текст		= СтрокаИтога.КоличествоСУчетомКратности;
			Свод.Область(с, колРекРасч).Текст		= СтрокаИтога.РекомендуемоеКоличество;
			Свод.Область(с, колПрПрод).Текст		= СтрокаИтога.ПродажаЗаПериод;
			Свод.Область(с, колДопЗапас).Текст		= СтрокаИтога.ДопЗапасНаАкцию;
			Если колЗавтра<>0 И колВБудущем<>0 Тогда
				Свод.Область(с, колЗавтра).Текст	= СтрокаИтога.ПоставкаЗавтра;
				Свод.Область(с, колВБудущем).Текст	= СтрокаИтога.ПоставкаВБудущем;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
		
КонецПроцедуры //РассчитатьИтогиДляСвода()

&НаКлиенте
Процедура РассчитатьИтоги(ИмяСвода)
	
	Свод = ЭтотОбъект[ИмяСвода];
	
	колЗаказать = 0; колСумма = 0;
	
	Для НомКол=1 По Свод.ШиринаТаблицы Цикл
		ИмяКолонки = Свод.Область(1, НомКол).Текст;
		
		Если ИмяКолонки="Заказать" Тогда
			колЗаказать = НомКол;
		ИначеЕсли ИмяКолонки="Сумма" Тогда
			колСумма = НомКол;
		КонецЕсли;
	КонецЦикла;
	
	ИтогоСумма = 0; ИтогоЗаказать = 0;
	
	Для С=Свод.ФиксацияСверху+1 По Свод.ВысотаТаблицы Цикл
		Если колЗаказать<>0 Тогда
			ОбластьЗаказать = Свод.Область(с, колЗаказать);
			Если ОбластьЗаказать.СодержитЗначение Тогда
				ИтогоЗаказать = ИтогоЗаказать + ОбластьЗаказать.Значение;
			КонецЕсли;
		КонецЕсли;
		Если колСумма<>0 Тогда
			ОбластьСумма = Свод.Область(с, колСумма);
			Если ОбластьСумма.СодержитЗначение Тогда
				ИтогоСумма = ИтогоСумма + ОбластьСумма.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	Если Свод.Области.Найти("ИтогоЗаказать")<>Неопределено Тогда 
		Свод.Область("ИтогоЗаказать").Текст	= ИтогоЗаказать;
	КонецЕсли;
	Если Свод.Области.Найти("ИтогоСумма")<>Неопределено Тогда
		Свод.Область("ИтогоСумма").Текст	= ИтогоСумма;
	КонецЕсли;
	
КонецПроцедуры //РассчитатьИтоги()

//////////////////////////////////////////////////////////////////////////////////СВОДНАЯ ТАБЛИЦА

&НаКлиенте
Функция ВспомогательныеДанныеФормы(КодРасчета)
	
	Если ВспомогательныеДанные = Неопределено Тогда
		ВспомогательныеДанные = Новый Соответствие;
	КонецЕсли;	
	
	ДанныеРасчета = ВспомогательныеДанные.Получить(КодРасчета);
	Если ДанныеРасчета = Неопределено Тогда
		Расчет = ЭтотОбъект["Расчет" + КодРасчета];
		Свод = ЭтотОбъект["Свод" + КодРасчета];
		ДанныеРасчета = Новый Структура;
		
		элСвод = Элементы["Свод" + КодРасчета];
		СтрокиНоменклатуры = Новый Соответствие;
		СтрокиНоменклатурыСвода = Новый Соответствие;
		Если элСвод.Видимость Тогда
			колонкаТовар = 0;
			Для НомКол=1 По Расчет.ШиринаТаблицы Цикл
				ИмяКолонки = Расчет.Область(1, НомКол).Текст;
				Если ИмяКолонки="Код" Тогда
					колонкаТовар = НомКол;
					ДанныеРасчета.Вставить("КолонкаКодаТовара",колонкаТовар);
					
					Расчет.Область("C"+Формат(колонкаТовар,"ЧН=; ЧГ=")).ШиринаКолонки=0;
					Расчет.Область("C"+Формат(колонкаТовар+1,"ЧН=; ЧГ=")).ШиринаКолонки=0;
					//Расчет.Область("C"+Формат(колонкаТовар+2,"ЧН=; ЧГ=")).ШиринаКолонки=0;
					
					//Прервать;
				ИначеЕсли ИмяКолонки="Поставка" Тогда
					Расчет.Область("C"+Формат(НомКол,"ЧН=; ЧГ=")).ШиринаКолонки=0;
				ИначеЕсли ИмяКолонки="РасчДней" Тогда
					Расчет.Область("C"+Формат(НомКол,"ЧН=; ЧГ=")).ШиринаКолонки=0;
				ИначеЕсли ИмяКолонки="ВарРасч" Тогда
					Расчет.Область("C"+Формат(НомКол,"ЧН=; ЧГ=")).ШиринаКолонки=0;
				ИначеЕсли ИмяКолонки="Время" Тогда
					Расчет.Область("C"+Формат(НомКол,"ЧН=; ЧГ=")).ШиринаКолонки=0;
				ИначеЕсли ИмяКолонки="ОстРЦ" Тогда
					Расчет.Область("C"+Формат(НомКол,"ЧН=; ЧГ=")).ШиринаКолонки=0;
				КонецЕсли;
			КонецЦикла;
			
			ПрошлиШапку = Ложь;
			Для ч = 2 По Расчет.ВысотаТаблицы Цикл
				Код = Расчет.Область(ч, колонкаТовар).Текст;
				Если Не ПрошлиШапку Тогда
					ПрошлиШапку = Код = "Код";
					ДанныеРасчета.Вставить("ВысотаШапки",ч);
					Продолжить;
				КонецЕсли;
				Расчет.Область("R"+Формат(ч,"ЧН=; ЧГ=")).Видимость=Ложь;
				Если Не ЗначениеЗаполнено(Код) Тогда
					Продолжить;
				КонецЕсли;
				
				МассивСтрокТовара = СтрокиНоменклатуры.Получить(Код);
				Если МассивСтрокТовара = Неопределено Тогда
					МассивСтрокТовара = Новый Массив;
					СтрокиНоменклатуры.Вставить(Код,МассивСтрокТовара);
				КонецЕсли;
				МассивСтрокТовара.Добавить(ч);
				
			КонецЦикла;	
			
			ПрошлиШапку = Ложь;
			Для ч = 2 По Свод.ВысотаТаблицы Цикл
				Код = Свод.Область(ч, колонкаТовар).Текст;
				Если Не ПрошлиШапку Тогда
					ПрошлиШапку = Код = "Код";
					ДанныеРасчета.Вставить("ВысотаШапкиСвод",ч);
					Продолжить;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Код) Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокиНоменклатурыСвода.Вставить(Код,Ч);
			КонецЦикла;	
			
		КонецЕсли;	
		ДанныеРасчета.Вставить("СтрокиНоменклатуры", СтрокиНоменклатуры);
		ДанныеРасчета.Вставить("ТекущийОтображаемыйТовар", "");
		ДанныеРасчета.Вставить("СтрокиНоменклатурыСвод", СтрокиНоменклатурыСвода);
		
		ВспомогательныеДанные.Вставить(КодРасчета,ДанныеРасчета);
	КонецЕсли;
	
	Возврат ДанныеРасчета;
	
КонецФункции //ВспомогательныеДанныеФормы()

&НаКлиенте
Процедура ОтобразитьСтрокиКонменклатуры(КодРасчета, НоменклатураКод, ПослеОтбора = Ложь)
	
	Расчет = ЭтотОбъект["Расчет" + КодРасчета];
	
	Данные = ВспомогательныеДанныеФормы(КодРасчета); Если Данные = Неопределено Тогда Данные = Новый Структура; КонецЕсли;
	
	Если ПослеОтбора Тогда 
		ТекущийТовар = Данные.ТекущийОтображаемыйТовар;
		Если ЗначениеЗаполнено(ТекущийТовар) Тогда
			МассивСтрокТовара = Данные.СтрокиНоменклатуры.Получить(ТекущийТовар);
			Если НЕ МассивСтрокТовара = Неопределено Тогда
				Для Каждого Стр Из МассивСтрокТовара Цикл
					Расчет.Область("R"+Формат(Стр,"ЧН=; ЧГ=")).Видимость = Ложь;
				КонецЦикла;
			КонецЕсли;
			Данные.ТекущийОтображаемыйТовар = "";
		КонецЕсли;	
		
	Иначе
		
		ТекущийТовар = Данные.ТекущийОтображаемыйТовар;
		Если ТекущийТовар=НоменклатураКод Тогда
			Возврат;
		КонецЕсли;
		
		колВПути = 0;
		Для НомКол=1 По Расчет.ШиринаТаблицы Цикл
			ИмяКолонки = Расчет.Область(1, НомКол).Текст;
			
			Если ИмяКолонки="ВПути" Тогда
				колВПути = НомКол;
			КонецЕсли;
		КонецЦикла;
			
		Если ЗначениеЗаполнено(ТекущийТовар) Тогда
			МассивСтрокТовара = Данные.СтрокиНоменклатуры.Получить(ТекущийТовар);
			Если МассивСтрокТовара<>Неопределено Тогда
				Для Каждого Стр Из МассивСтрокТовара Цикл
					Расчет.Область("R"+Формат(Стр,"ЧН=; ЧГ=")).Видимость = Ложь;
				КонецЦикла;
			КонецЕсли;
			Данные.ТекущийОтображаемыйТовар = "";
		КонецЕсли;	
		
		ИтогоВПути = 0;
		
		Если ЗначениеЗаполнено(НоменклатураКод) Тогда
			МассивСтрокТовара = Данные.СтрокиНоменклатуры.Получить(НоменклатураКод);
			Если МассивСтрокТовара<>Неопределено Тогда
				Для Каждого Стр Из МассивСтрокТовара Цикл
					Расчет.Область("R"+Формат(Стр,"ЧН=; ЧГ=")).Видимость = Истина;
					
					Попытка
						ИтогоВПути = ИтогоВПути + Число(Расчет.Область(Стр, колВПути).Текст);
					Исключение КонецПопытки;
				КонецЦикла;
				
			КонецЕсли;
			Данные.ТекущийОтображаемыйТовар = НоменклатураКод;
		КонецЕсли;
		
		Расчет.Область("ИтогоВПути").Текст = ИтогоВПути;
		Расчет.Область("ТекстИтогоВПути").Текст = "Всего в пути:";
		
	КонецЕсли;
	
КонецПроцедуры //ОтобразитьСтрокиКонменклатуры()
		  		  
&НаКлиенте		  
Процедура сводПриАктивизации(Элемент)
	
	КодРасчета = Сред(Элемент.Имя,5);
	ПолеСвода = Элементы["Свод" + КодРасчета];
	ПолеРасчета = Элементы["Расчет" + КодРасчета];
	Если НЕ ПолеСвода.Видимость ИЛИ НЕ ПолеРасчета.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Свод = ЭтотОбъект["Свод" + КодРасчета];
	Область = Элемент.ТекущаяОбласть;
	НомерСтроки = Область.Верх;
	НомерКолонки = Область.Лево;
	
	колонкаТовар = 0;
	
	//Код,Товар,Группа,КолПродаж,ДнейПродаж,СредПродаж,Остаток,РасчПотр,МинЗапас,МинЗаказ,РекРасч,РекОкр,Заказать,Акция,ЦенаРозн,Квант,ТМ,ВПути,УчетДней
	//Для НомКол=1 По Свод.ШиринаТаблицы Цикл
	//	ИмяКолонки = Свод.Область(1, НомКол).Текст;
	//	
	//	Если ИмяКолонки="Код" Тогда
	//		колонкаТовар = НомКол;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	колонкаТовар = 2;
	
	тНоменклатураКод = Свод.Область(НомерСтроки, колонкаТовар).Текст;
	
	ОтобразитьСтрокиКонменклатуры(КодРасчета, тНоменклатураКод);
	
	ОбновитьОтборСтрок(КодРасчета);
	
КонецПроцедуры //сводПриАктивизации()

&НаКлиенте
Процедура сводПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	ИмяРасчета = Элемент.Имя;
	НомерСтроки = Область.Верх;
	НомерКолонки = Область.Лево;
	
	КолонкаЗаказать = 0;
	КолонкаКвант = 0;
	КолонкаБлок = 0;
	КолонкаЗаказМаг = 0;
	КолонкаНаСклад = 0;
	КолонкаСумма = 0;
	КолонкаЦена = 0;
	КолонкаРекРЦ = 0;
	
	//Код,Товар,Группа,КолПродаж,ДнейПродаж,СредПродаж,Остаток,РасчПотр,МинЗапас,МинЗаказ,РекРасч,РекОкр,Заказать,Акция,ЦенаРозн,Квант,ТМ,ВПути,УчетДней
	Для НомКол=1 По ЭтотОбъект[ИмяРасчета].ШиринаТаблицы Цикл
		ИмяКолонки = ЭтотОбъект[ИмяРасчета].Область(1, НомКол).Текст;
		Если ИмяКолонки="Заказать" Тогда
			КолонкаЗаказать = НомКол;
		ИначеЕсли ИмяКолонки="Квант" Тогда
			КолонкаКвант = НомКол;
		ИначеЕсли ИмяКолонки="Блок" Тогда
			КолонкаБлок = НомКол;
		ИначеЕсли ИмяКолонки="ЗаказМаг" Тогда
			КолонкаЗаказМаг = НомКол;
		ИначеЕсли ИмяКолонки="НаСклад" Тогда
			КолонкаНаСклад = НомКол;
		ИначеЕсли ИмяКолонки="Сумма" Тогда
			КолонкаСумма = НомКол;
		ИначеЕсли ИмяКолонки="Цена" Тогда
			КолонкаЦена = НомКол;
		ИначеЕсли ИмяКолонки="РекРЦ" Тогда
			КолонкаРекРЦ = НомКол;
		КонецЕсли;
	КонецЦикла;
	
	Если КолонкаЗаказать=0 ИЛИ КолонкаКвант=0 ИЛИ КолонкаБлок=0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НомерКолонки=КолонкаЗаказать Тогда
		
		Попытка
			Заблокировано = (ЭтотОбъект[ИмяРасчета].Область(НомерСтроки, КолонкаБлок).Расшифровка = Истина);
		Исключение
			Заблокировано = Ложь;
		КонецПопытки;
		
		Если Заблокировано И Элементы[ИмяРасчета].ТекущаяОбласть.Значение<>0 Тогда
			Элементы[ИмяРасчета].ТекущаяОбласть.Значение = 0;
			Сообщить("Данная позиция, заблокирована к заказу !");
		КонецЕсли;
		
		Если КолонкаКвант>0 Тогда
			
			КвантПоставки = ЭтотОбъект[ИмяРасчета].Область(НомерСтроки, КолонкаКвант).Значение;
			
			ТекЗначение = Элементы[ИмяРасчета].ТекущаяОбласть.Значение;
			
			Если КвантПоставки>=1 Тогда
				Кратность = ТекЗначение%КвантПоставки;
				Если Кратность=0 Тогда
					ЭтотОбъект[ИмяРасчета].Область(НомерСтроки, КолонкаКвант).ЦветФона = Новый Цвет(255, 255, 255);
				Иначе
					ЭтотОбъект[ИмяРасчета].Область(НомерСтроки, КолонкаКвант).ЦветФона = Новый Цвет(255, 0, 0);
				КонецЕсли;
			КонецЕсли;
			
			//НаСклад
			ОбластьНаСклад = ЭтотОбъект[ИмяРасчета].Область(НомерСтроки, КолонкаНаСклад);
			Если ОбластьНаСклад.СодержитЗначение Тогда
				//пересчитаем количество на склад
				РекРЦ = ЭтотОбъект[ИмяРасчета].Область(НомерСтроки, КолонкаРекРЦ).Значение;
				ОбластьНаСклад.Значение = Макс(ТекЗначение - РекРЦ, 0);
				//считаем сумму
				Цена = ЭтотОбъект[ИмяРасчета].Область(НомерСтроки, КолонкаЦена).Значение;
				ОбластьСумма = ЭтотОбъект[ИмяРасчета].Область(НомерСтроки, КолонкаСумма);
				ОбластьСумма.Значение = Цена * ТекЗначение;
			КонецЕсли;
		КонецЕсли;
		
		//переход к следующей строке
		Для нс=1 По 3 Цикл
			СледОбласть = ЭтотОбъект[ИмяРасчета].Область(НомерСтроки + нс, КолонкаЗаказать);
			Если СледОбласть.СодержитЗначение Тогда
				Элементы[ИмяРасчета].ТекущаяОбласть = СледОбласть;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		//Элементы[ИмяРасчета].ТекущаяОбласть = ЭтотОбъект[ИмяРасчета].Область(НомерСтроки + 1, КолонкаЗаказать);
		РассчитатьИтоги(ИмяРасчета);
		
	ИначеЕсли НомерКолонки=КолонкаНаСклад Тогда
		
		Попытка
			Заблокировано = (ЭтотОбъект[ИмяРасчета].Область(НомерСтроки, КолонкаБлок).Расшифровка = Истина);
		Исключение
			Заблокировано = Ложь;
		КонецПопытки;
		
		Если Заблокировано И Элементы[ИмяРасчета].ТекущаяОбласть.Значение<>0 Тогда
			Элементы[ИмяРасчета].ТекущаяОбласть.Значение = 0;
			Сообщить("Данная позиция, заблокирована к заказу !");
		КонецЕсли;
		
		Если КолонкаКвант>0 Тогда
			
			КвантПоставки = ЭтотОбъект[ИмяРасчета].Область(НомерСтроки, КолонкаКвант).Значение;
			
			ТекЗначение = Элементы[ИмяРасчета].ТекущаяОбласть.Значение;
			
			//К заказу(итог)
			ОбластьКЗаказу = ЭтотОбъект[ИмяРасчета].Область(НомерСтроки, КолонкаЗаказать);
			Если ОбластьКЗаказу.СодержитЗначение Тогда
				//пересчитаем количество к заказу
				ОбластьРекРЦ = ЭтотОбъект[ИмяРасчета].Область(НомерСтроки, КолонкаРекРЦ);
				ОбластьКЗаказу.Значение = Макс(ТекЗначение + ОбластьРекРЦ.Значение, 0);
				
				Если КвантПоставки>=1 Тогда
					Кратность = ОбластьКЗаказу.Значение%КвантПоставки;
					Если Кратность=0 Тогда
						ЭтотОбъект[ИмяРасчета].Область(НомерСтроки, КолонкаКвант).ЦветФона = Новый Цвет(255, 255, 255);
					Иначе
						ЭтотОбъект[ИмяРасчета].Область(НомерСтроки, КолонкаКвант).ЦветФона = Новый Цвет(255, 0, 0);
					КонецЕсли;
				КонецЕсли;
				
				//считаем сумму
				Цена = ЭтотОбъект[ИмяРасчета].Область(НомерСтроки, КолонкаЦена).Значение;
				ОбластьСумма = ЭтотОбъект[ИмяРасчета].Область(НомерСтроки, КолонкаСумма);
				ОбластьСумма.Значение = Цена * ОбластьКЗаказу.Значение;
			КонецЕсли;
		КонецЕсли;
		
		//переход к следующей строке
		Для нс=1 По 3 Цикл
			СледОбласть = ЭтотОбъект[ИмяРасчета].Область(НомерСтроки + нс, КолонкаНаСклад);
			Если СледОбласть.СодержитЗначение Тогда
				Элементы[ИмяРасчета].ТекущаяОбласть = СледОбласть;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		РассчитатьИтоги(ИмяРасчета);
		
	КонецЕсли;
		
КонецПроцедуры //сводПриИзмененииСодержимогоОбласти()

&НаКлиенте
Процедура сводОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка)=Тип("СправочникСсылка.Номенклатура") Тогда
		СтандартнаяОбработка = Ложь;
		
		Форма = ПолучитьФорму("Справочник.Номенклатура.ФормаСписка", Новый Структура("ТекущаяСтрока", Расшифровка),, Истина);
		Форма.Открыть();
		Форма.ВыполнитьПереход(Расшифровка);
	КонецЕсли;
	
КонецПроцедуры //сводОбработкаРасшифровки

&НаКлиенте
Процедура ПоказатьРасчет(Команда)
	ТС = Элементы.Страницы.ТекущаяСтраница;
	ПолеРасчет = Элементы["Расчет" + Сред(ТС.Имя,9)];
	
	ПолеРасчет.Видимость = НЕ ПолеРасчет.Видимость;
	
	Если ПолеРасчет.Видимость Тогда
		сводПриАктивизации(Элементы["Свод" + Сред(ТС.Имя,9)]);
	КонецЕсли;	
КонецПроцедуры

///////////////////////////////////////////БЛОК ОТБОРОВ СВОД
&НаКлиенте
Процедура сводОбработкаВыбора(Элемент, Область, СтандартнаяОбработка)  
	ИмяСвода = Элемент.Имя;
	
	НомерСтроки = Область.Верх;
	НомерКолонки = Область.Лево;
	Текст = Область.Текст;
	
	КодРасчета = Сред(Элемент.Имя,5);
	Отбор = ЭтотОбъект["ОтборСвод" + КодРасчета]; 
	Расчет = ЭтотОбъект["Свод" + КодРасчета];
	
	НомерСтрокиШапки = Отбор[0].Значение;
	Если (НомерСтроки = НомерСтрокиШапки+1 ) и НомерКолонки<Отбор.Количество() Тогда //ОТБОР
		
		ОбновитьОтборСтрок = Ложь;	
		
		тОтбор = Отбор[НомерКолонки];
		Если тОтбор = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТипОтбора = тОтбор.Значение;
		ТипОтбора = Лев(ТипОтбора,Найти(ТипОтбора,"-")-1);
		//строка	список10 списокодин	списокмного	число
		
		Если тОтбор.Пометка Тогда
			Расчет.Область(Отбор[0].Значение,НомерКолонки).Текст = "";
			тОтбор.Пометка = Ложь;
			ОбновитьОтборСтрок = Истина;
		ИначеЕсли ТипОтбора = "строка" ИЛИ ТипОтбора = "число" Тогда
			Строка = тОтбор.Представление;;
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЗначенияОтбораСвод", ЭтаФорма,Новый Структура("КодРасчета,ПолеОтбора",КодРасчета,НомерКолонки));
			ПоказатьВводСтроки(ОписаниеОповещения, Строка, "Введите значение");

		ИначеЕсли Лев(ТипОтбора,6) = "список" Тогда	
			ТекЗначение = тОтбор.Представление;
			
			Варианты = Новый СписокЗначений;
			Для ч = НомерСтрокиШапки+3 По Расчет.ВысотаТаблицы Цикл
				Если НЕ Расчет.Область("R"+Формат(ч,"ЧН=; ЧГ=")).Видимость Тогда Продолжить; КонецЕсли;
				тЗнач = Расчет.Область(ч,НомерКолонки).Текст;
				Если Варианты.НайтиПоЗначению(тЗнач)=Неопределено Тогда
					Варианты.Добавить(тЗнач,тЗнач,Найти(ТекЗначение,"["+тЗнач+"]")>0);
				КонецЕсли;
			КонецЦикла;
			
			Если Варианты.Количество()<2 Тогда
				Возврат;
			КонецЕсли;
			ВидСписка = Сред(ТипОтбора,7);
			ВидСписка = ?(СтрДлина(ВидСписка)<4,?(Варианты.Количество()>Число(ВидСписка),"много","один"),ВидСписка);
			Если ВидСписка="много" Тогда //ВыборНескольких
				ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЗначенияОтбораСвод", ЭтаФорма,Новый Структура("КодРасчета,ПолеОтбора",КодРасчета,НомерКолонки));
				Варианты.ПоказатьОтметкуЭлементов(ОписаниеОповещения, "Выберите варианты");
				
			Иначе //Выбор одного варианта
				ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЗначенияОтбораСвод", ЭтаФорма,Новый Структура("КодРасчета,ПолеОтбора",КодРасчета,НомерКолонки));
				ПоказатьВыборИзСписка(ОписаниеОповещения, Варианты);
			КонецЕсли;
		КонецЕсли;
		
		
		Если ОбновитьОтборСтрок Тогда
			ЭтотОбъект["ОтборСвод" + КодРасчета] = Отбор;
			ОбновитьОтборСтрокСвод(КодРасчета);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗначенияОтбораСвод(Значение, ПереданныеПараметры) Экспорт
	КодРасчета = ПереданныеПараметры.КодРасчета;
	ПолеОтбора = ПереданныеПараметры.ПолеОтбора;
	Отбор = ЭтотОбъект["ОтборСвод" + КодРасчета];Если Отбор=Неопределено Тогда Отбор = Новый СписокЗначений; КонецЕсли;
	Расчет = ЭтотОбъект["Свод" + КодРасчета];	Если Расчет=Неопределено Тогда Расчет = Новый ТабличныйДокумент; КонецЕсли;
	тОтбор = Отбор[ПолеОтбора];
	ТипОтбора = тОтбор.Значение;
	ТипОтбора = Лев(ТипОтбора,Найти(ТипОтбора,"-")-1);
		
	
	ОбновитьОтборСтрок = Ложь;
	Если Значение = Неопределено  Тогда
		Если тОтбор.Пометка Тогда
			Расчет.Область(Отбор[0].Значение,ПолеОтбора).Текст = "";
			тОтбор.Пометка = Ложь;
			ОбновитьОтборСтрок = Истина;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Значение) = Тип("Строка") Тогда
		Если ЗначениеЗаполнено(Значение) Тогда
			Если ТипОтбора="число" Тогда
				Значение = СтрЗаменить(Значение,"/","*");
				Значение = СтрЗаменить(Значение,"**","*");
				//Если Найти(Значение,"*")=0 Тогда
				//	ВывестиСообщение("Не верное значение отбора по числу. Используйте знак ""*""(звездочка, умножение). Напромер: -10*40, *60, 77*90");
				//	Возврат;
				//КонецЕсли;	
				тОтбор.Пометка = Истина;
				ОбновитьОтборСтрок = Истина;
				Значение = СтрЗаменить(Значение,"   "," ");
				Значение = СтрЗаменить(Значение,"  "," ");
				Значение = СтрЗаменить(Значение," ","");
				Значение = СтрЗаменить(Значение,",",".");
				
				тОтбор.Представление = Значение;
			Иначе	
				тОтбор.Пометка = Истина;
				ОбновитьОтборСтрок = Истина;
				Значение = Значение + " ";
				Значение = СтрЗаменить(Значение,"   "," ");
				Значение = СтрЗаменить(Значение,"  "," ");
				Значение = СтрЗаменить(Значение,","," ");
				Значение = СтрЗаменить(Значение,";"," ");
				Значение = СтрЗаменить(Значение,"."," ");
				тОтбор.Представление = Значение;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Значение) = Тип("ЭлементСпискаЗначений") Тогда
		тОтбор.Пометка = Истина;
		ОбновитьОтборСтрок = Истина;
		тОтбор.Представление = "["+Значение.Значение+"]";
	ИначеЕсли Значение.Количество() > 0 Тогда
		Стр = "";
		Для Каждого Элемент Из Значение Цикл
			Если Элемент.Пометка Тогда
				Стр = Стр + "["+Элемент.Значение+"]";
			КонецЕсли;
		КонецЦикла;	
		Если ЗначениеЗаполнено(Стр) Тогда
			тОтбор.Пометка = Истина;
			ОбновитьОтборСтрок = Истина;
			тОтбор.Представление = Стр;
		КонецЕсли;	
	КонецЕсли;
	
	Если ОбновитьОтборСтрок Тогда
		
		Расчет.Область(Отбор[0].Значение,ПолеОтбора).Текст = тОтбор.Представление;
		ЭтотОбъект["ОтборСвод" + КодРасчета] = Отбор;
		ОбновитьОтборСтрокСвод(КодРасчета);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборСтрокСвод(КодРасчета)
	Расчет = ЭтотОбъект["Свод" + КодРасчета];
	Отбор = ЭтотОбъект["ОтборСвод" + КодРасчета];
	Если Расчет=Неопределено Тогда Расчет = Новый ТабличныйДокумент; КонецЕсли;
	Если Отбор=Неопределено Тогда Отбор = Новый СписокЗначений; КонецЕсли;
	
	//ЕстьОтбор=Ложь;
	//Для Каждого тОтбор Из Отбор Цикл
	//	Если тОтбор.Пометка Тогда
	//		ЕстьОтбор = Истина;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;	
	//Если НЕ ЕстьОтбор Тогда
	//	Возврат;
	//КонецЕсли;
	
	
	//Поля = Новый Соответствие;
	//Для ч = 1 по Расчет.ШиринаТаблицы Цикл
	//	ИмяПоля = Расчет.Область(4,ч).Текст;
	//	Поля.Вставить(ИмяПоля,ч);
	//КонецЦикла;	
	НомерСтрокиШапки = Отбор[0].Значение;
	Для ч = НомерСтрокиШапки+2 по Расчет.ВысотаТаблицы Цикл
		
		//Если Расчет.Область(ч,3).Текст="" Тогда //Пропустим группировки
		//	Продолжить;
		//КонецЕсли;
		
		Скрыть = Ложь;
		чч=-1;
		Для Каждого тОтбор Из Отбор Цикл
			чч=чч+1;
			Если Скрыть Тогда Прервать; КонецЕсли;
			Если НЕ тОтбор.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначениеПоля = Расчет.Область(ч,чч).Текст;
			ЗначениеОтбора = тОтбор.Представление;
			ТипОтбора = тОтбор.Значение;
			ТипОтбора = Лев(ТипОтбора,Найти(ТипОтбора,"-")-1);
		
			Если ТипОтбора = "строка" Тогда
				//Скрыть = Найти(ЗначениеПоля,ЗначениеОтбора) = 0;
				Ок = Истина;
				Если СтрЧислоВхождений(ЗначениеОтбора," ")>3 Тогда
					Скрыть = НЕ СокрЛП(нРег(ЗначениеПоля)) = СокрЛП(нРег(ЗначениеОтбора));
				Иначе
					Пока Найти(ЗначениеОтбора," ") Цикл
						Вхождение = Лев(ЗначениеОтбора,Найти(ЗначениеОтбора," ")-1);
						ЗначениеОтбора = Сред(ЗначениеОтбора,Найти(ЗначениеОтбора," ")+1);
						ОК = Найти(нРег(ЗначениеПоля),нРег(Вхождение)) > 0;
						Если НЕ ОК Тогда Прервать; КонецЕсли;
					КонецЦикла;
					Скрыть = Не ОК;
				КонецЕсли;
			ИначеЕсли ТипОтбора = "число" Тогда	
				Попытка
					ЗначениеПоля = ?(ЗначениеЗаполнено(ЗначениеПоля),Число(ЗначениеПоля),0);
					Если Найти(ЗначениеОтбора,"*")=0 Тогда
						Число = Число(ЗначениеОтбора);
						Если ЗначениеПоля<>Число Тогда
							Скрыть = Истина;
						КонецЕсли;
					ИначеЕсли Лев(ЗначениеОтбора,1) = "*" Тогда
						Число2 = Число(СтрЗаменить(ЗначениеОтбора,"*",""));
						Если ЗначениеПоля>Число2 Тогда
							Скрыть = Истина;
						КонецЕсли;
					ИначеЕсли Прав(ЗначениеОтбора,1) = "*" Тогда
						Число1 = Число(СтрЗаменить(ЗначениеОтбора,"*",""));
						Число1 = ?(Число1=0,-0.00001,Число1);
						Если ЗначениеПоля<Число1 Тогда
							Скрыть = Истина;
						КонецЕсли;
					Иначе
						Позиция = Найти(ЗначениеОтбора,"*");
						Число1 = Число(Лев(ЗначениеОтбора,Позиция-1));
						Число2 = Число(Сред(ЗначениеОтбора,Позиция+1));
						Если Число1>Число2 Тогда
							Число = Число1;
							Число1 = Число2;
							Число2 = Число;
						КонецЕсли;
						
						Если ЗначениеПоля<Число1 ИЛИ ЗначениеПоля>Число2 Тогда
							Скрыть = Истина;
						КонецЕсли;
					КонецЕсли;	
				Исключение
				КонецПопытки;	
			Иначе
				Скрыть = Найти(ЗначениеОтбора,"["+ЗначениеПоля+"]")=0;
			КонецЕсли;
			
		КонецЦикла;
		
		Расчет.Область("R"+Формат(ч,"ЧН=; ЧГ=")).Видимость=Не Скрыть;
	КонецЦикла;
	ЭтотОбъект["Свод" + КодРасчета] = Расчет;
КонецПроцедуры

///////////////////////////////////////////БЛОК ОТБОРОВ СВОД



//////////////////////////////////////////////////////////////////////////////////СВОДНАЯ ТАБЛИЦА






&НаКлиенте
Процедура ОтобразитьИсторию(Команда)
	
	ТС = Элементы.Страницы.ТекущаяСтраница;
	ПолеИстория = Элементы["История" + Сред(ТС.Имя,9)];
	ПолеИстория.Видимость = НЕ ПолеИстория.Видимость;
	Если ПолеИстория.Видимость Тогда
		ЭтотОбъект["История" + Сред(ТС.Имя,9)] = Новый ТабличныйДокумент;
		тдПриАктивизации(Элементы["Расчет" + Сред(ТС.Имя,9)]);
	КонецЕсли;
	
КонецПроцедуры //ОтобразитьИсторию()

&НаКлиенте
Процедура тдПриАктивизации(Элемент)
	
	КодРасчета = Сред(Элемент.Имя,7);
	ПолеИстория = Элементы["История" + КодРасчета];
	Если НЕ ПолеИстория.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Расчет = ЭтотОбъект["Расчет" + КодРасчета];
	История = ЭтотОбъект["История" + КодРасчета];
	Область = Элемент.ТекущаяОбласть;
	НомерСтроки = Область.Верх;
	НомерКолонки = Область.Лево;
	
	колТовар = 0;
	колДнейПродаж = 0;
	колПодр = 0;
	
	//Код,Товар,Группа,КолПродаж,ДнейПродаж,СредПродаж,Остаток,РасчПотр,МинЗапас,МинЗаказ,РекРасч,РекОкр,Заказать,Акция,ЦенаРозн,Квант,ТМ,ВПути,УчетДней
	Для НомКол=1 По Расчет.ШиринаТаблицы Цикл
		ИмяКолонки = Расчет.Область(1, НомКол).Текст;
		
		Если ИмяКолонки="Товар" Тогда
			колТовар = НомКол;
		ИначеЕсли ИмяКолонки="ДнейПродаж" Тогда
			колДнейПродаж = НомКол;
		ИначеЕсли ИмяКолонки="Подразделение" Тогда
			колПодр = НомКол;
		КонецЕсли;
	КонецЦикла;
	
	ТипОбласти = Расчет.Область(1,НомерКолонки).Текст;
	тНоменклатура = Расчет.Область(НомерСтроки, колТовар).Расшифровка;
	
	Если колПодр=0 Тогда
		тСкладКомпании = Расчет.Область("Подразделение").Расшифровка;
	Иначе
		тСкладКомпании = Расчет.Область(НомерСтроки, колПодр).Расшифровка;
	КонецЕсли;
		
	Попытка
		Дней = Число(Расчет.Область(НомерСтроки,колДнейПродаж).Расшифровка);
	    СформироватьИсторию(История, ТипОбласти, тНоменклатура, тСкладКомпании, Дней, КодРасчета);
	Исключение
		Ош = ОписаниеОшибки();
		ЭтотОбъект["История" + КодРасчета] = Новый ТабличныйДокумент;
	КонецПопытки;	
	
КонецПроцедуры //тдПриАктивизации()

&НаСервере
Функция СформироватьИсторию(История,ТипОбласти=Неопределено,тНоменклатура=Неопределено,тСкладКомпании=Неопределено,тДней=Неопределено,КодРасчета=Неопределено)
	
	РеквизитФормыВЗначение("Объект").СформироватьИсторию(История, ТипОбласти, тНоменклатура, тСкладКомпании, тДней);
	ЭтотОбъект["История" + КодРасчета] = История;

КонецФункции //СформироватьИсторию()


///////////////////////////////////////////БЛОК ОТБОРОВ
&НаКлиенте
Процедура тдОбработкаВыбора(Элемент, Область, СтандартнаяОбработка)  
	ИмяРасчета = Элемент.Имя;
	
	НомерСтроки = Область.Верх;
	НомерКолонки = Область.Лево;
	Текст = Область.Текст;
	
	КодРасчета = Сред(Элемент.Имя,7);
	Отбор = ЭтотОбъект["Отбор" + КодРасчета]; Если Отбор=Неопределено Тогда Отбор = Новый СписокЗначений; КонецЕсли;
	Расчет = ЭтотОбъект["Расчет" + КодРасчета];	Если Расчет=Неопределено Тогда Расчет = Новый ТабличныйДокумент; КонецЕсли;
	
	НомерСтрокиШапки = Отбор[0].Значение;
	Если (НомерСтроки = НомерСтрокиШапки+1 ) и НомерКолонки<Отбор.Количество() Тогда //ОТБОР
		Расчет = ЭтотОбъект["Расчет" + КодРасчета];
		Если Расчет=Неопределено Тогда Расчет = Новый ТабличныйДокумент; КонецЕсли;
		
		ОбновитьОтборСтрок = Ложь;	
		
		тОтбор = Отбор[НомерКолонки];
		Если тОтбор = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТипОтбора = тОтбор.Значение;
		ТипОтбора = Лев(ТипОтбора,Найти(ТипОтбора,"-")-1);
		//строка	список10 списокодин	списокмного	число
		
		Если тОтбор.Пометка Тогда
			Расчет.Область(Отбор[0].Значение,НомерКолонки).Текст = "";
			тОтбор.Пометка = Ложь;
			ЭтотОбъект["Отбор" + КодРасчета] = Отбор;
			ОбновитьОтборСтрок(КодРасчета,Истина);
		ИначеЕсли ТипОтбора = "строка" ИЛИ ТипОтбора = "число" Тогда
			Строка = тОтбор.Представление;;
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЗначенияОтбора", ЭтаФорма,Новый Структура("КодРасчета,ПолеОтбора",КодРасчета,НомерКолонки));
			ПоказатьВводСтроки(ОписаниеОповещения, Строка, "Введите значение");

		ИначеЕсли Лев(ТипОтбора,6) = "список" Тогда	
			ТекЗначение = тОтбор.Представление;
			
			Варианты = Новый СписокЗначений;
			Для ч = НомерСтрокиШапки+3 По Расчет.ВысотаТаблицы Цикл
				Если НЕ Расчет.Область("R"+Формат(ч,"ЧН=; ЧГ=")).Видимость Тогда Продолжить; КонецЕсли;
				тЗнач = Расчет.Область(ч,НомерКолонки).Текст;
				Если Варианты.НайтиПоЗначению(тЗнач)=Неопределено Тогда
					Варианты.Добавить(тЗнач,тЗнач,Найти(ТекЗначение,"["+тЗнач+"]")>0);
				КонецЕсли;
			КонецЦикла;
			
			Если Варианты.Количество()<2 Тогда
				Возврат;
			КонецЕсли;
			ВидСписка = Сред(ТипОтбора,7);
			ВидСписка = ?(СтрДлина(ВидСписка)<4,?(Варианты.Количество()>Число(ВидСписка),"много","один"),ВидСписка);
			Если ВидСписка="много" Тогда //ВыборНескольких
				ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЗначенияОтбора", ЭтаФорма,Новый Структура("КодРасчета,ПолеОтбора",КодРасчета,НомерКолонки));
				Варианты.ПоказатьОтметкуЭлементов(ОписаниеОповещения, "Выберите варианты");
				
			Иначе //Выбор одного варианта
				ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЗначенияОтбора", ЭтаФорма,Новый Структура("КодРасчета,ПолеОтбора",КодРасчета,НомерКолонки));
				ПоказатьВыборИзСписка(ОписаниеОповещения, Варианты);
			КонецЕсли;
		КонецЕсли;
		
		
		Если ОбновитьОтборСтрок Тогда
			ЭтотОбъект["Отбор" + КодРасчета] = Отбор;
			ОбновитьОтборСтрок(КодРасчета);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗначенияОтбора(Значение, ПереданныеПараметры) Экспорт
	КодРасчета = ПереданныеПараметры.КодРасчета;
	ПолеОтбора = ПереданныеПараметры.ПолеОтбора;
	Отбор = ЭтотОбъект["Отбор" + КодРасчета];Если Отбор=Неопределено Тогда Отбор = Новый СписокЗначений; КонецЕсли;
	Расчет = ЭтотОбъект["Расчет" + КодРасчета];	Если Расчет=Неопределено Тогда Расчет = Новый ТабличныйДокумент; КонецЕсли;
	тОтбор = Отбор[ПолеОтбора];
	ТипОтбора = тОтбор.Значение;
	ТипОтбора = Лев(ТипОтбора,Найти(ТипОтбора,"-")-1);
		
	
	ОбновитьОтборСтрок = Ложь;
	Если Значение = Неопределено  Тогда
		Если тОтбор.Пометка Тогда
			Расчет.Область(Отбор[0].Значение,ПолеОтбора).Текст = "";
			тОтбор.Пометка = Ложь;
			ОбновитьОтборСтрок = Истина;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Значение) = Тип("Строка") Тогда
		Если ЗначениеЗаполнено(Значение) Тогда
			Если ТипОтбора="число" Тогда
				Значение = СтрЗаменить(Значение,"/","*");
				Значение = СтрЗаменить(Значение,"**","*");
				//Если Найти(Значение,"*")=0 Тогда
				//	ВывестиСообщение("Не верное значение отбора по числу. Используйте знак ""*""(звездочка, умножение). Напромер: -10*40, *60, 77*90");
				//	Возврат;
				//КонецЕсли;	
				тОтбор.Пометка = Истина;
				ОбновитьОтборСтрок = Истина;
				Значение = СтрЗаменить(Значение,"   "," ");
				Значение = СтрЗаменить(Значение,"  "," ");
				Значение = СтрЗаменить(Значение," ","");
				Значение = СтрЗаменить(Значение,",",".");
				
				тОтбор.Представление = Значение;
			Иначе	
				тОтбор.Пометка = Истина;
				ОбновитьОтборСтрок = Истина;
				Значение = Значение + " ";
				Значение = СтрЗаменить(Значение,"   "," ");
				Значение = СтрЗаменить(Значение,"  "," ");
				Значение = СтрЗаменить(Значение,","," ");
				Значение = СтрЗаменить(Значение,";"," ");
				Значение = СтрЗаменить(Значение,"."," ");
				тОтбор.Представление = Значение;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Значение) = Тип("ЭлементСпискаЗначений") Тогда
		тОтбор.Пометка = Истина;
		ОбновитьОтборСтрок = Истина;
		тОтбор.Представление = "["+Значение.Значение+"]";
	ИначеЕсли Значение.Количество() > 0 Тогда
		Стр = "";
		Для Каждого Элемент Из Значение Цикл
			Если Элемент.Пометка Тогда
				Стр = Стр + "["+Элемент.Значение+"]";
			КонецЕсли;
		КонецЦикла;	
		Если ЗначениеЗаполнено(Стр) Тогда
			тОтбор.Пометка = Истина;
			ОбновитьОтборСтрок = Истина;
			тОтбор.Представление = Стр;
		КонецЕсли;	
	КонецЕсли;
	
	Если ОбновитьОтборСтрок Тогда
		
		Расчет.Область(Отбор[0].Значение,ПолеОтбора).Текст = тОтбор.Представление;
		ЭтотОбъект["Отбор" + КодРасчета] = Отбор;
		ОбновитьОтборСтрок(КодРасчета);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборСтрок(КодРасчета,СнятиеОтбора=Ложь)
	
	Расчет = ЭтотОбъект["Расчет" + КодРасчета];
	Отбор = ЭтотОбъект["Отбор" + КодРасчета];
	Если Расчет=Неопределено Тогда Расчет = Новый ТабличныйДокумент; КонецЕсли;
	Если Отбор=Неопределено Тогда Отбор = Новый СписокЗначений; КонецЕсли;
	
	ЕстьОтбор=Ложь;
	Для Каждого тОтбор Из Отбор Цикл
		Если тОтбор.Пометка Тогда
			ЕстьОтбор = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	Если НЕ ЕстьОтбор И НЕ СнятиеОтбора Тогда
		Возврат;
	КонецЕсли;
		
	Данные = ВспомогательныеДанныеФормы(КодРасчета); Если Данные = Неопределено Тогда Данные = Новый Структура; КонецЕсли;
	
	ТекущийТоварСвода = Неопределено;
	Если Элементы["Свод" + КодРасчета].Видимость Тогда
		ТекущийТоварСвода = Данные.ТекущийОтображаемыйТовар;
		Если ТекущийТоварСвода="" Тогда 
			Возврат;
		КонецЕсли;	
		МассивСтрокТовара = Данные.СтрокиНоменклатуры.Получить(ТекущийТоварСвода);
		Если МассивСтрокТовара = Неопределено Тогда
			МассивСтрокТовара = Новый Массив;
		КонецЕсли;
	КонецЕсли;
	
	//Поля = Новый Соответствие;
	//Для ч = 1 по Расчет.ШиринаТаблицы Цикл
	//	ИмяПоля = Расчет.Область(4,ч).Текст;
	//	Поля.Вставить(ИмяПоля,ч);
	//КонецЦикла;	
	НомерСтрокиШапки = Отбор[0].Значение;
	
	ПроверятьСтрокиПоМассивуСтрокТовара = НЕ ТекущийТоварСвода=Неопределено;
	
	Для нч = ?(ПроверятьСтрокиПоМассивуСтрокТовара,1,НомерСтрокиШапки+2) по ?(ПроверятьСтрокиПоМассивуСтрокТовара,МассивСтрокТовара.Количество(),Расчет.ВысотаТаблицы) Цикл
		
		ч = ?(ПроверятьСтрокиПоМассивуСтрокТовара,МассивСтрокТовара[нч-1],нч);
		
		//Если НЕ ТекущийТоварСвода=Неопределено И  НЕ ТекущийТоварСвода = Расчет.Область(ч,2).Текст Тогда
		//	Продолжить;
		//КонецЕсли;
		//
		//Если ПроверятьСтрокиПоМассивуСтрокТовара Тогда
		//	Если МассивСтрокТовара.Найти(ч)= Неопределено Тогда
		//		Продолжить;
		//	КонецЕсли;	
		//КонецЕсли;
		
		
		//Если Расчет.Область(ч,3).Текст="" Тогда //Пропустим группировки
		//	Продолжить;
		//КонецЕсли;
		
		Скрыть = Ложь;
		чч=-1;
		Для Каждого тОтбор Из Отбор Цикл
			чч=чч+1;
			Если Скрыть Тогда Прервать; КонецЕсли;
			Если НЕ тОтбор.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначениеПоля = Расчет.Область(ч,чч).Текст;
			ЗначениеОтбора = тОтбор.Представление;
			ТипОтбора = тОтбор.Значение;
			ТипОтбора = Лев(ТипОтбора,Найти(ТипОтбора,"-")-1);
		
			Если ТипОтбора = "строка" Тогда
				//Скрыть = Найти(ЗначениеПоля,ЗначениеОтбора) = 0;
				Ок = Истина;
				Если СтрЧислоВхождений(ЗначениеОтбора," ")>3 Тогда
					Скрыть = НЕ СокрЛП(нРег(ЗначениеПоля)) = СокрЛП(нРег(ЗначениеОтбора));
				Иначе
					Пока Найти(ЗначениеОтбора," ") Цикл
						Вхождение = Лев(ЗначениеОтбора,Найти(ЗначениеОтбора," ")-1);
						ЗначениеОтбора = Сред(ЗначениеОтбора,Найти(ЗначениеОтбора," ")+1);
						ОК = Найти(нРег(ЗначениеПоля),нРег(Вхождение)) > 0;
						Если НЕ ОК Тогда Прервать; КонецЕсли;
					КонецЦикла;
					Скрыть = Не ОК;
				КонецЕсли;
			ИначеЕсли ТипОтбора = "число" Тогда	
				Попытка
					ЗначениеПоля = ?(ЗначениеЗаполнено(ЗначениеПоля),Число(ЗначениеПоля),0);
					Если Найти(ЗначениеОтбора,"*")=0 Тогда
						Число = Число(ЗначениеОтбора);
						Если ЗначениеПоля<>Число Тогда
							Скрыть = Истина;
						КонецЕсли;
					ИначеЕсли Лев(ЗначениеОтбора,1) = "*" Тогда
						Число2 = Число(СтрЗаменить(ЗначениеОтбора,"*",""));
						Если ЗначениеПоля>Число2 Тогда
							Скрыть = Истина;
						КонецЕсли;
					ИначеЕсли Прав(ЗначениеОтбора,1) = "*" Тогда
						Число1 = Число(СтрЗаменить(ЗначениеОтбора,"*",""));
						Число1 = ?(Число1=0,-0.00001,Число1);
						Если ЗначениеПоля<Число1 Тогда
							Скрыть = Истина;
						КонецЕсли;
					Иначе
						Позиция = Найти(ЗначениеОтбора,"*");
						Число1 = Число(Лев(ЗначениеОтбора,Позиция-1));
						Число2 = Число(Сред(ЗначениеОтбора,Позиция+1));
						Если Число1>Число2 Тогда
							Число = Число1;
							Число1 = Число2;
							Число2 = Число;
						КонецЕсли;
						
						Если ЗначениеПоля<Число1 ИЛИ ЗначениеПоля>Число2 Тогда
							Скрыть = Истина;
						КонецЕсли;
					КонецЕсли;	
				Исключение
				КонецПопытки;	
			Иначе
				Скрыть = Найти(ЗначениеОтбора,"["+ЗначениеПоля+"]")=0;
			КонецЕсли;
			
		КонецЦикла;
		
		Расчет.Область("R"+Формат(ч,"ЧН=; ЧГ=")).Видимость=Не Скрыть;
	КонецЦикла;
	ЭтотОбъект["Расчет" + КодРасчета] = Расчет;
	
КонецПроцедуры //ОбновитьОтборСтрок()

&НаКлиенте
Процедура ОтобратьПоТекущемуЗначению(Команда)
	
	ТС = Элементы.Страницы.ТекущаяСтраница;
	КодРасчета = Сред(ТС.Имя,9);
	
	Отбор = ЭтотОбъект["Отбор" + КодРасчета]; Если Отбор=Неопределено Тогда Отбор = Новый СписокЗначений; КонецЕсли;
	Расчет = ЭтотОбъект["Расчет" + КодРасчета];	Если Расчет=Неопределено Тогда Расчет = Новый ТабличныйДокумент; КонецЕсли;
	
	Область = Расчет.ТекущаяОбласть;
	
	НомерСтроки = Область.Верх;
	НомерКолонки = Область.Лево;
	Текст = Область.Текст;
	
	НомерСтрокиШапки = Отбор[0].Значение;
	
	Если НомерСтроки<НомерСтрокиШапки+2 ИЛИ НомерКолонки>= Отбор.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ПолеОтбора = НомерКолонки;
	тОтбор = Отбор[ПолеОтбора];
	ТипОтбора = тОтбор.Значение;
	ТипОтбора = Лев(ТипОтбора,Найти(ТипОтбора,"-")-1);
	
	ОбновитьОтборСтрок = Ложь;
	
	Если тОтбор.Пометка Тогда
		Расчет.Область(Отбор[0].Значение,НомерКолонки).Текст = "";
		тОтбор.Пометка = Ложь;
		ЭтотОбъект["Отбор" + КодРасчета] = Отбор;
		ОбновитьОтборСтрок(КодРасчета,Истина);
	ИначеЕсли ТипОтбора = "строка" ИЛИ ТипОтбора = "число" Тогда
		тОтбор.Представление = Текст + " ";
		тОтбор.Пометка = Истина;
		ОбновитьОтборСтрок = Истина;
		Расчет.Область(Отбор[0].Значение,ПолеОтбора).Текст = тОтбор.Представление;
	ИначеЕсли Лев(ТипОтбора,6) = "список" Тогда	
		тОтбор.Представление = "["+Текст+"]";
		тОтбор.Пометка = Истина;
		ОбновитьОтборСтрок = Истина;
		Расчет.Область(Отбор[0].Значение,ПолеОтбора).Текст = тОтбор.Представление;
	КонецЕсли;

	Если ОбновитьОтборСтрок Тогда
		ЭтотОбъект["Отбор" + КодРасчета] = Отбор;
		ОбновитьОтборСтрок(КодРасчета);
	КонецЕсли;

КонецПроцедуры

///////////////////////////////////////////БЛОК ОТБОРОВ





// Обработчик события возникающего при выполнении команды "Добавить в документ" в контексте сервера.
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаСервере
Процедура ДобавитьВДокументНаСервере(ПараметрыВыполнения)
	
	РеквизитФормыВЗначение("Объект").ВыполнитьКоманду("ФормированиеЗаказовПоставщику", ПараметрыВыполнения);
	
КонецПроцедуры // ВыполнитьКомандуЗагрузки()

&НаСервере
Функция ПодготовитьТаблицыИзТЧ(СтруктураДокумента)
	
	ТС = Элементы.Страницы.ТекущаяСтраница;
	Если Объект.ВариантФормирования=2 ИЛИ Объект.ВариантФормирования=3 Тогда
		Расчет = ЭтотОбъект["Свод" + Сред(ТС.Имя,9)];
	Иначе
		Расчет = ЭтотОбъект["Расчет" + Сред(ТС.Имя,9)];
	КонецЕсли;
	
	колТовар = 0; колЗаказать = 0; колКвант = 0; колПодр = 0; колПоставка = 0; колВремя = 0;
	
	//Код,Товар,Группа,КолПродаж,ДнейПродаж,СредПродаж,Остаток,РасчПотр,МинЗапас,МинЗаказ,РекРасч,РекОкр,Заказать,Акция,ЦенаРозн,Квант,ТМ,ВПути,УчетДней
	Для НомКол=1 По Расчет.ШиринаТаблицы Цикл
		ИмяКолонки = Расчет.Область(1, НомКол).Текст;
		
		Если ИмяКолонки="Товар" Тогда
			колТовар = НомКол;
		ИначеЕсли ИмяКолонки="Заказать" Тогда
			колЗаказать = НомКол;
		ИначеЕсли ИмяКолонки="Квант" Тогда
			колКвант = НомКол;
		ИначеЕсли ИмяКолонки="Подразделение" Тогда
			колПодр = НомКол;
		ИначеЕсли ИмяКолонки="Поставка" Тогда
			колПоставка = НомКол;
		ИначеЕсли ИмяКолонки="Время" Тогда
			колВремя = НомКол;
		КонецЕсли;
	КонецЦикла;
	
	Если колТовар=0 ИЛИ колЗаказать=0 ИЛИ колКвант=0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтруктураДокумента.Свойство("ВидЗаказа") Тогда //Объект.Специфика="мясницкий"
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ВидЗаказа, ВидЗаказаНоменклатура ИЗ РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры");
		тзВидовЗаказа = Запрос.Выполнить().Выгрузить();
		тзВидовЗаказа.Индексы.Добавить("ВидЗаказаНоменклатура");
	КонецЕсли;
	
	ВыбранныеТовары = Новый Соответствие;
	Для С = Расчет.ФиксацияСверху+1 По Расчет.ВысотаТаблицы Цикл
		
		Если Объект.ВариантФормирования=1 Тогда
			ПодразделениеЗаказа = Расчет.Область(с, колПодр).Расшифровка;
			Если ТипЗнч(ПодразделениеЗаказа)=Тип("Массив") И ПодразделениеЗаказа.Количество()>0 Тогда //skud e;fcysq rjcnskm
				ПодразделениеЗаказа = ПодразделениеЗаказа[0].ПодразделениеКомпании;
			КонецЕсли;
			Если СтруктураДокумента.Подразделение<>ПодразделениеЗаказа Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтруктураДокумента.ДатаПоставки) Тогда
				СтруктураДокумента.ДатаПоставки = Расчет.Область(с, колПоставка).Расшифровка;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтруктураДокумента.ВремяПринятия) Тогда
				СтруктураДокумента.ВремяПринятия = Расчет.Область(с, колВремя).Расшифровка;
			КонецЕсли;
		КонецЕсли;
		
		ОбластьЗаказать = Расчет.Область(с, колЗаказать);
		Если НЕ ОбластьЗаказать.СодержитЗначение Тогда
			Продолжить;
		КонецЕсли;
		
		Количество = ОбластьЗаказать.Значение;
		
		КвантПоставки = Расчет.Область(с, колКвант).Значение;
		
		Если КвантПоставки>=1 И Объект.ВариантФормирования=0 Тогда
			Кратность = Количество%КвантПоставки;
			Если Кратность<>0 Тогда
				Сообщить("Количество к заказу, по строке № " + (с-5) + ", не кратно указанному кванту поставки.");
				//Количество = 0;
				//Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если Количество<=0 И Объект.Специфика<>"мясницкий" Тогда
			Продолжить;
		КонецЕсли;
		
		Номенклатура = Расчет.Область(с, колТовар).Расшифровка;
		
		Если ЗначениеЗаполнено(СтруктураДокумента.Номенклатура) И НЕ Номенклатура.ПринадлежитЭлементу(СтруктураДокумента.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураДокумента.Свойство("Категория") И НЕ Номенклатура.ПринадлежитЭлементу(СтруктураДокумента.Категория) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураДокумента.Свойство("Производитель") И Номенклатура.Производитель<>СтруктураДокумента.Производитель Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтруктураДокумента.Свойство("ВидЗаказа") Тогда //Объект.Специфика="мясницкий"
			СтрокаВидаЗаказа = тзВидовЗаказа.Найти(Номенклатура.ит_ВидЗаявки,"ВидЗаказаНоменклатура");
			Если СтрокаВидаЗаказа=Неопределено Тогда
				ВидЗаказа = Перечисления.рздВидыЗаказовЕРП.ПустаяСсылка();
			Иначе
				ВидЗаказа = СтрокаВидаЗаказа.ВидЗаказа;
			КонецЕсли;
			Если СтруктураДокумента.ВидЗаказа<>ВидЗаказа Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ВыбранныеТовары.Вставить(Номенклатура, Количество);
		
	КонецЦикла;		
	
	Возврат ВыбранныеТовары;
	
КонецФункции //ПодготовитьТаблицыИзТЧ()

&НаСервере
Функция ПолучитьСтруктуруДеления(Контрагент)
	
	МассивПодразделений	 = Новый Массив;
	МассивКартегорий	 = Новый Массив;
	МассивПроизводителей = Новый Массив;
	МассивВидовЗаказа	 = Новый Массив;
	
	//получим доп.реквизиты контрагента для разделения
	ЗапросКонтрагентов = Новый Запрос("ВЫБРАТЬ Значение ИЗ Справочник.Контрагенты.ДополнительныеРеквизиты ГДЕ Ссылка=&Ссылка И Свойство=&Свойство");
	ЗапросКонтрагентов.УстановитьПараметр("Ссылка", Контрагент);
	
	ДопРеквПроизводитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Разбивать заказ по производителю (Контрагенты и контакты)", Истина);
	ЗапросКонтрагентов.УстановитьПараметр("Свойство", ДопРеквПроизводитель);
	Выборка = ЗапросКонтрагентов.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДелениеПоПроизводителю = Выборка.Значение;
	Иначе
		ДелениеПоПроизводителю = Ложь;
	КонецЕсли;
	
	ДопРеквКатегория = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Разбивать заказ по категории (Контрагенты и контакты)", Истина);
	ЗапросКонтрагентов.УстановитьПараметр("Свойство", ДопРеквКатегория);
	Выборка = ЗапросКонтрагентов.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		УровеньКатегории = Выборка.Значение;
	Иначе
		УровеньКатегории = 0;
	КонецЕсли;
	
	МассивГрупп = Новый Массив;
	Если УровеньКатегории<>0 Тогда
		ЗапросГрупп = Новый Запрос("
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Группа
		|ПОМЕСТИТЬ Группы
		|ИЗ
		|	РегистрСведений.СтруктураИерархииНоменклатуры
		|ГДЕ
		|	Уровень=&УровеньКатегории
		|;
		|ВЫБРАТЬ
		|	Номенклатура
		|ИЗ
		|	РегистрСведений.СтруктураИерархииНоменклатуры
		|ГДЕ
		|	Порядок=1
		|	И НЕ Номенклатура В(ВЫБРАТЬ Группа ИЗ Группы)
		|	И Уровень+1=&УровеньКатегории
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ
		|	Группа
		|ИЗ
		|	Группы
		|");
		ЗапросГрупп.УстановитьПараметр("УровеньКатегории", УровеньКатегории - 1);
		МассивГрупп = ЗапросГрупп.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	КонецЕсли;
	
	//Для Заказ ЦО за магазины, список подразделений будем получать из расчета
		
	ТС = Элементы.Страницы.ТекущаяСтраница;
	//Расчет = ЭтотОбъект["Расчет" + Сред(ТС.Имя,9)];
	Если Объект.ВариантФормирования=2 ИЛИ Объект.ВариантФормирования=3 Тогда
		Расчет = ЭтотОбъект["Свод" + Сред(ТС.Имя,9)];
	Иначе
		Расчет = ЭтотОбъект["Расчет" + Сред(ТС.Имя,9)];
	КонецЕсли;

	//Код,Товар,Группа,КолПродаж,ДнейПродаж,СредПродаж,Остаток,РасчПотр,МинЗапас,МинЗаказ,РекРасч,РекОкр,Заказать,Акция,ЦенаРозн,Квант,ТМ,ВПути,УчетДней
	Для НомКол=1 По Расчет.ШиринаТаблицы Цикл
		ИмяКолонки = Расчет.Область(1, НомКол).Текст;
		
		Если ИмяКолонки="Подразделение" Тогда
			колПодр = НомКол;
		ИначеЕсли ИмяКолонки="Товар" Тогда
			колТовар = НомКол;
		КонецЕсли;
	КонецЦикла;

	ДелениеПоВидуЗаявки = ЕстьРеквизит(Контрагент,"ЕРПМастерКлюч") И Контрагент.ЕРПМастерКлюч="00000019376"; //Объект.Специфика="мясницкий"
	МассивЗаявок = Новый Массив;
	
	Для С = Расчет.ФиксацияСверху+1 По Расчет.ВысотаТаблицы Цикл
		
		Если Объект.ВариантФормирования=1 Тогда
			ПодразделениеЗаказа = Расчет.Область(с, колПодр).Расшифровка;
			Если НЕ ЗначениеЗаполнено(ПодразделениеЗаказа) Тогда
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(ПодразделениеЗаказа)=Тип("Массив") И ПодразделениеЗаказа.Количество()>0 Тогда //skud e;fcysq rjcnskm
				ПодразделениеЗаказа = ПодразделениеЗаказа[0].ПодразделениеКомпании;
			КонецЕсли;
			Если МассивПодразделений.Найти(ПодразделениеЗаказа) = Неопределено Тогда
				МассивПодразделений.Добавить(ПодразделениеЗаказа);
			КонецЕсли;
		КонецЕсли;
		
		Номенклатура = Расчет.Область(с, колТовар).Расшифровка;
		
		Если ТипЗнч(Номенклатура)<>Тип("СправочникСсылка.Номенклатура") ИЛИ НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДелениеПоПроизводителю И ЗначениеЗаполнено(Номенклатура.Производитель) И МассивПроизводителей.Найти(Номенклатура.Производитель)=Неопределено Тогда
			МассивПроизводителей.Добавить(Номенклатура.Производитель);
		КонецЕсли;
		
		Для Каждого Группа Из МассивГрупп Цикл
			Если Номенклатура.ПринадлежитЭлементу(Группа) Тогда
				МассивКартегорий.Добавить(Группа);
			КонецЕсли;
		КонецЦикла;
		
		Если ДелениеПоВидуЗаявки И ЗначениеЗаполнено(Номенклатура.ит_ВидЗаявки) И МассивЗаявок.Найти(Номенклатура.ит_ВидЗаявки)=Неопределено Тогда
			МассивЗаявок.Добавить(Номенклатура.ит_ВидЗаявки);
		КонецЕсли;
		
	КонецЦикла;	
	
	Если МассивЗаявок.Количество()>0 Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ВидЗаказа ИЗ РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры ГДЕ ВидЗаказаНоменклатура В(&МассивЗаявок)");
		Запрос.УстановитьПараметр("МассивЗаявок", МассивЗаявок);
		МассивВидовЗаказа = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидЗаказа");
	КонецЕсли;
	
	Если МассивПодразделений.Количество()=0 Тогда
		МассивПодразделений.Добавить(Объект.ПодразделениеКомпании);
	КонецЕсли;
	
	Если МассивПроизводителей.Количество()=0 Тогда
		МассивПроизводителей.Добавить();
	Иначе
		МассивПроизводителей.Добавить(Справочники.Производители.ПустаяСсылка());
	КонецЕсли;
	
	Если МассивКартегорий.Количество()=0 Тогда
		МассивКартегорий.Добавить();
	КонецЕсли;
	
	Если МассивВидовЗаказа.Количество()=0 Тогда
		МассивВидовЗаказа.Добавить();
	Иначе
		МассивВидовЗаказа.Добавить(Перечисления.рздВидыЗаказовЕРП.ПустаяСсылка());
	КонецЕсли;
	
	Возврат Новый Структура("Подразделения,Категории,Производители,ВидыЗаказа", МассивПодразделений, МассивКартегорий, МассивПроизводителей, МассивВидовЗаказа);
	
КонецФункции //ПолучитьСтруктуруДеления()

&НаСервере
Функция ПолучитьСкладыЗаказаНаСервере(Подразделение)
	
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьСкладыЗаказа(Подразделение);
	
КонецФункции //ПолучитьСкладыЗаказа()

// Обработчик события возникающего на клиенте при выполнении команды "Добавить в документ".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура ДобавитьВДокумент(Команда)
	
	ТС = Элементы.Страницы.ТекущаяСтраница;
	
	Если Лев(ТС.Имя,8)<>"Страница" Тогда
		Возврат;	
	КонецЕсли;
	
	Если Объект.ВариантФормирования=2 ИЛИ Объект.ВариантФормирования=3 Тогда
		Расчет = ЭтотОбъект["Свод" + Сред(ТС.Имя,9)];
	Иначе
		Расчет = ЭтотОбъект["Расчет" + Сред(ТС.Имя,9)];
	КонецЕсли;
	
	// + Конов по кнопке заполняем и таблицу товаров
	ТекСпецифика = Объект.Специфика;
	Если Объект.Специфика = "мясницкий" Тогда
		Объект.Специфика = "";
		Объект.ОткрыватьДокумент = Истина;
	КонецЕсли;
	// - Конов
	
	Контрагент = Расчет.Область("Контрагент").Расшифровка;
	СубПоставщик = Расчет.Область("СубПоставщик").Расшифровка;
	
	текДатаПоставки = Неопределено; текВремяПринятия = Неопределено; текОграничениеНоменклатуры = Неопределено;
	Если Объект.ВариантФормирования<>1 Тогда
		текДатаПоставки = Расчет.Область("ДатаПоставки").Расшифровка;
		текВремяПринятия = Расчет.Область("ВремяПринятия").Расшифровка;
		текОграничениеНоменклатуры = Расчет.Область("ОграничениеНоменклатуры").Расшифровка;
	КонецЕсли;
	
	НетДокумента = Расчет.Области.Найти("Документ")=Неопределено ИЛИ НЕ ЗначениеЗаполнено(Расчет.Область("Документ").Текст);
	
	Если НЕ НетДокумента Тогда
		Сообщить("Документ был ранее сформирован, повторное формирование не доступно.");
		Возврат;
	КонецЕсли;
	
	СтруктураДеления = ПолучитьСтруктуруДеления(Контрагент);
	
	МассивПодразделений	 = СтруктураДеления.Подразделения;
	МассивКатегорий		 = СтруктураДеления.Категории;
	МассивПроизводителей = СтруктураДеления.Производители;
	МассивВидовЗаказа	 = СтруктураДеления.ВидыЗаказа;
	
	Для Каждого текПодразделение Из МассивПодразделений Цикл
		
		СкладыЗаказа = ПолучитьСкладыЗаказаНаСервере(текПодразделение);
		
		Для Каждого СтрокаСклада Из СкладыЗаказа Цикл //деление по юр.лицам
			
			Для Каждого Категория Из МассивКатегорий Цикл
			
				Для Каждого Производитель Из МассивПроизводителей Цикл
					
					Для Каждого ВидЗаказа Из МассивВидовЗаказа Цикл
						
						Результат = Новый Структура;
						Результат.Вставить("Подразделение", текПодразделение);
						Результат.Вставить("СкладКомпании", СтрокаСклада.Ключ);
						Результат.Вставить("Номенклатура", СтрокаСклада.Значение);
						
						Если Категория<>Неопределено Тогда 
							Результат.Вставить("Категория", Категория);
						КонецЕсли;
						
						Если Производитель<>Неопределено Тогда 
							Результат.Вставить("Производитель", Производитель);
						КонецЕсли;
						
						Если ВидЗаказа<>Неопределено Тогда 
							Результат.Вставить("ВидЗаказа", ВидЗаказа);
						КонецЕсли;
						
						Результат.Вставить("ДатаПоставки", текДатаПоставки);
						Результат.Вставить("ВремяПринятия", текВремяПринятия);
						
						ВыбранныеТовары = ПодготовитьТаблицыИзТЧ(Результат);
						Если ВыбранныеТовары = Неопределено Тогда
							ВывестиСообщение("Не удалось сформировать таблицу расчета");
							Возврат;
						ИначеЕсли ВыбранныеТовары.Количество()=0 Тогда
							Продолжить;
						КонецЕсли;
						
						Результат.Вставить("ВыбранныеТовары", ВыбранныеТовары);
						Результат.Вставить("Контрагент", Контрагент);
						Результат.Вставить("СубПоставщик", СубПоставщик);
						Результат.Вставить("ОграничениеНоменклатуры", текОграничениеНоменклатуры);
						Результат.Вставить("СоздатьДокумент", СоздатьДокумент);
						Результат.Вставить("Объект", Объект);
						Результат.Вставить("Проводить", Объект.ПроводитьДокумент);
						Если НЕ СоздатьДокумент Тогда
							Результат.Вставить("ОбъектДокумента", ВладелецФормы.Объект);
						Конецесли;
						Если ЗначениеЗаполнено(СтрокаСклада.Ключ) Тогда
							Результат.Вставить("Организация", СтрокаСклада.Ключ.Организация);
						КонецЕсли;
						
						Если НЕ Объект.НеУчитыватьВремяЗаказа И ЗначениеЗаполнено(Результат.ВремяПринятия)
							И Результат.ВремяПринятия < (Дата(0001,01,01,Час(ТекущаяДата()),Минута(ТекущаяДата()),Секунда(ТекущаяДата())))
							И НачалоДня(Объект.Дата)=НачалоДня(ТекущаяДата()) Тогда
										
							//Сообщить("Текущее время, превышает время принятия заказа по графику(" + Формат(Результат.ВремяПринятия,"ДФ=ЧЧ:мм") + ")," + " для поставщика: """ + Результат.Контрагент + """" + ?(ЗначениеЗаполнено(Результат.СубПоставщик), ", (субпоставщик: " + Результат.СубПоставщик + ")", "") + ".");
							
							//Оповещение = Новый ОписаниеОповещения("ОтветНаВопросСозданияДокумента", ЭтотОбъект);
							//ПоказатьВопрос(Оповещение, "Текущее время, превышает время принятия заказа по графику(" + Формат(Результат.ВремяПринятия,"ДФ=ЧЧ:мм") + ", сформировать заказ не проведенным ?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, ""); 

							Если Вопрос("Текущее время, превышает время принятия заказа по графику(" + Формат(Результат.ВремяПринятия,"ДФ=ЧЧ:мм") + ", сформировать заказ не проведенным ?",
								РежимДиалогаВопрос.ОКОтмена)=КодВозвратаДиалога.ОК Тогда
							    			
								Результат.Вставить("Проводить", Ложь);
							Иначе
								Продолжить;
							КонецЕсли;		
							
						КонецЕсли;
						
						ДобавитьВДокументНаСервере(Результат);
						
						Если Результат.Свойство("Ошибка") Тогда
							//ВывестиСообщение(Результат.Ошибка);
							Возврат;
						КонецЕсли;
						
						Если НЕ СоздатьДокумент Тогда
							КопироватьДанныеФормы(Результат.ОбъектДокумента, ВладелецФормы.Объект);	
							Закрыть(ВыбранныеТовары);
						Иначе
							ОповеститьОбИзменении(Тип("ДокументСсылка.ЗаказПоставщику"));
							//ОповеститьОбИзменении(ВладелецФормы.Объект.Ссылка);
							//КопироватьДанныеФормы(Результат.ОбъектДокумента, ВладелецФормы.Объект);
							УстановитьЗаказПоставщикуВРасчет(Результат.ОбъектДокумента);
							Если Объект.ОткрыватьДокумент тогда
								Попытка
									ПараметрыФормы = Новый Структура("Ключ", Результат.ОбъектДокумента);
					        		ОткрытьФорму("Документ.ЗаказПоставщику.Форма.ФормаДокумента", ПараметрыФормы);
								Исключение
								КонецПопытки;
								
							ИначеЕсли Объект.ОтправлятьДокументПочтой И НЕ ЗначениеЗаполнено(Результат.СубПоставщик) И Объект.ВариантФормирования=0 Тогда
								
								ОтправитьПочтой();
								
							КонецЕсли;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	НетДокумента = Расчет.Области.Найти("Документ")=Неопределено ИЛИ НЕ ЗначениеЗаполнено(Расчет.Область("Документ").Текст);
	
	Элементы.ФормаДобавитьВДокумент.Доступность = НетДокумента;
	Элементы.ФормаОтправитьПочтой.Доступность = НетДокумента;
	Элементы.ЗаказатьРекомендованное.Доступность = НетДокумента;
	
	// + Конов по кнопке заполняем и таблицу товаров
	Объект.Специфика = ТекСпецифика;
	// - Конов
КонецПроцедуры // ДобавитьВДокумент()

//&НаКлиенте
//Процедура ОтветНаВопросСозданияДокумента(Результат, Параметры) Экспорт
//
//КонецПроцедуры //ОтветНаВопросСозданияДокумента()

// Обработчик события возникающего на клиенте при выполнении команды "Добавить в документ".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура ВыбранныеТовары(ВыбранныеТовары,Строки)
	
	Для Каждого Строка Из Строки Цикл
		
		Если Строка.Количество>0 Тогда
			ВыбранныеТовары.Вставить(Строка.Номенклатура, Строка.Количество);
		КонецЕсли;
		
		ВыбранныеТовары(ВыбранныеТовары, Строка.ПолучитьЭлементы());
	 
	КонецЦикла;
	
КонецПроцедуры // ДобавитьВДокумент()

// Обработчик события возникающего на клиенте при выполнении команды "Установить пометки".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	Значение = (Команда.Имя = "УстановитьПометки");
	Для Каждого Строка Из Объект.Товары Цикл
		Строка.ПеренестиВЗаказ = Значение;
	КонецЦикла;
	
КонецПроцедуры // УстановитьПометки()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура тдПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	ИмяРасчета = Элемент.Имя;
	Расчет = ЭтотОбъект[ИмяРасчета];
	КодРасчета = Сред(ИмяРасчета, 7);
	Свод = ЭтотОбъект["Свод" + КодРасчета];
	
	НомерСтроки = Область.Верх;
	НомерКолонки = Область.Лево;
	
	КолонкаЗаказать = 0;
	КолонкаКвант = 0;
	КолонкаБлок = 0;
	КолонкаКод = 0;
	КолонкаЗаказМаг = 0;
	КолонкаНаСклад = 0;
	КолонкаКЗаказу = 0;
	КолонкаЦена = 0;
	КолонкаСумма = 0;
	КолонкаРекРЦ = 0;
	КолонкаОстРЦ = 0;
	КолонкаКвантСвод = 0;
	КолонкаМинЗаказ = 0;
	
	//Код,Товар,Группа,КолПродаж,ДнейПродаж,СредПродаж,Остаток,РасчПотр,МинЗапас,МинЗаказ,РекРасч,РекОкр,Заказать,Акция,ЦенаРозн,Квант,ТМ,ВПути,УчетДней
	Для НомКол=1 По Расчет.ШиринаТаблицы Цикл
		ИмяКолонки = Расчет.Область(1, НомКол).Текст;
		Если ИмяКолонки="Заказать" Тогда
			КолонкаЗаказать = НомКол;
		ИначеЕсли ИмяКолонки="Квант" Тогда
			КолонкаКвант = НомКол;
		ИначеЕсли ИмяКолонки="Блок" Тогда
			КолонкаБлок = НомКол;
		ИначеЕсли ИмяКолонки="Код" Тогда
			КолонкаКод = НомКол;
		КонецЕсли;
	КонецЦикла;
	
	Если КолонкаЗаказать=0 ИЛИ КолонкаКвант=0 ИЛИ КолонкаБлок=0 ИЛИ КолонкаКод=0 Тогда
		Возврат;
	КонецЕсли;
	
	Для НомКол=1 По Свод.ШиринаТаблицы Цикл
		ИмяКолонки = Свод.Область(1, НомКол).Текст;
		Если ИмяКолонки="ЗаказМаг" Тогда
			КолонкаЗаказМаг = НомКол;
		ИначеЕсли ИмяКолонки="НаСклад" Тогда
			КолонкаНаСклад = НомКол;
		ИначеЕсли ИмяКолонки="Заказать" Тогда
			КолонкаКЗаказу = НомКол;
		ИначеЕсли ИмяКолонки="Цена" Тогда
			КолонкаЦена = НомКол;
		ИначеЕсли ИмяКолонки="Сумма" Тогда
			КолонкаСумма = НомКол;
		ИначеЕсли ИмяКолонки="РекРЦ" Тогда
			КолонкаРекРЦ = НомКол;
		ИначеЕсли ИмяКолонки="ОстРЦ" Тогда
			КолонкаОстРЦ = НомКол;
		ИначеЕсли ИмяКолонки="Квант" Тогда
			КолонкаКвантСвод = НомКол;
		ИначеЕсли ИмяКолонки="МинЗаказ" Тогда
			КолонкаМинЗаказ = НомКол;
		КонецЕсли;
	КонецЦикла;
	
	Если НомерКолонки=КолонкаЗаказать Тогда
		
		Попытка
			Заблокировано = (Расчет.Область(НомерСтроки, КолонкаБлок).Расшифровка = Истина);
		Исключение
			Заблокировано = Ложь;
		КонецПопытки;
		
		Если Заблокировано И Элементы[ИмяРасчета].ТекущаяОбласть.Значение<>0 Тогда
			Элементы[ИмяРасчета].ТекущаяОбласть.Значение = 0;
			Сообщить("Данная позиция, заблокирована к заказу !");
		КонецЕсли;
		
		Если КолонкаКвант>0 Тогда
			
			КвантПоставки = Расчет.Область(НомерСтроки, КолонкаКвант).Значение;
			
			ТекЗначение = Элементы[ИмяРасчета].ТекущаяОбласть.Значение;
			Если КвантПоставки>=1 Тогда
				Кратность = ТекЗначение%КвантПоставки;
				Если Кратность=0 Тогда
					Расчет.Область(НомерСтроки, КолонкаКвант).ЦветФона = Новый Цвет(255, 255, 255);
				Иначе
					Расчет.Область(НомерСтроки, КолонкаКвант).ЦветФона = Новый Цвет(255, 0, 0);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//обновляем количество в своде
		Если КолонкаЗаказМаг<>0 Тогда
			СтруктураДанных = ВспомогательныеДанныеФормы(КодРасчета);
			
			КодТовара = Расчет.Область(НомерСтроки, КолонкаКод).Текст;
			МассивСтрок = СтруктураДанных.СтрокиНоменклатуры[КодТовара];
			
			ОбщееКоличество = 0;
			Для Каждого текСтрока Из МассивСтрок Цикл
				Количество = Расчет.Область(текСтрока, КолонкаЗаказать).Значение;
				ОбщееКоличество = ОбщееКоличество + Количество;
			КонецЦикла;
			НомерСтрокиСвод = СтруктураДанных.СтрокиНоменклатурыСвод[КодТовара];
			
			Свод.Область(НомерСтрокиСвод, КолонкаЗаказМаг).Значение = ОбщееКоличество;
			
			ОбластьОстатокРЦ = Свод.Область(НомерСтрокиСвод, КолонкаОстРЦ);
			ОбластьРекРЦ = Свод.Область(НомерСтрокиСвод, КолонкаРекРЦ);
			ОбластьНаСклад = Свод.Область(НомерСтрокиСвод, КолонкаНаСклад);
			ОбластьКЗаказу = Свод.Область(НомерСтрокиСвод, КолонкаКЗаказу);
			ОбластьМинЗаказ = Свод.Область(НомерСтрокиСвод, КолонкаМинЗаказ);
			
			РекомендуемоеРЦ = ОбщееКоличество - ОбластьОстатокРЦ.Значение;
			
			//РекомендуемоеРЦ = ?(ОбластьМинЗаказ.Значение>РекомендуемоеРЦ, ОбластьМинЗаказ.Значение, РекомендуемоеРЦ);
			
			Если КвантПоставки>0 Тогда
				Если (РекомендуемоеРЦ - Окр(РекомендуемоеРЦ / КвантПоставки - 0.25, 0) * КвантПоставки) < (КвантПоставки / 4) Тогда
					РекомендуемоеРЦ = КвантПоставки * Окр(РекомендуемоеРЦ / КвантПоставки - 0.25, 0);
				Иначе
					РекомендуемоеРЦ = КвантПоставки * (1 + Окр(РекомендуемоеРЦ / КвантПоставки - 0.25, 0));
				КонецЕсли;
			КонецЕсли;
			
			ОбластьРекРЦ.Значение = РекомендуемоеРЦ;
			ОбластьКЗаказу.Значение = Макс(ОбластьРекРЦ.Значение + ОбластьНаСклад.Значение, 0);
			
			Если КвантПоставки>=1 Тогда
				Кратность = ОбластьКЗаказу.Значение%КвантПоставки;
				Если Кратность=0 Тогда
					Свод.Область(НомерСтрокиСвод, КолонкаКвантСвод).ЦветФона = Новый Цвет(255, 255, 255);
				Иначе
					Свод.Область(НомерСтрокиСвод, КолонкаКвантСвод).ЦветФона = Новый Цвет(255, 0, 0);
				КонецЕсли;
			КонецЕсли;
			
			//считаем сумму
			Цена = Свод.Область(НомерСтрокиСвод, КолонкаЦена).Значение;
			ОбластьСумма = Свод.Область(НомерСтрокиСвод, КолонкаСумма);
			ОбластьСумма.Значение = Цена * ОбластьКЗаказу.Значение;
		КонецЕсли;
		
		//перезодим к следующей строке
		ОставшиесяСтроки = Расчет.ВысотаТаблицы - Расчет.ТекущаяОбласть.Верх;
		
		Для нс=1 По ОставшиесяСтроки Цикл
			СледОбласть = Расчет.Область(НомерСтроки + нс, КолонкаЗаказать);
			Если СледОбласть.СодержитЗначение И СледОбласть.Видимость Тогда
				Элементы[ИмяРасчета].ТекущаяОбласть = СледОбласть;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		//Элементы[ИмяРасчета].ТекущаяОбласть = ЭтотОбъект[ИмяРасчета].Область(НомерСтроки + 1, КолонкаЗаказать);
		Если Элементы["Свод" + КодРасчета].Видимость Тогда
			РассчитатьИтоги("Свод" + КодРасчета);
		Иначе
			РассчитатьИтоги(ИмяРасчета);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //тдПриИзмененииСодержимогоОбласти()

&НаКлиенте
Процедура тдОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка)=Тип("СправочникСсылка.Номенклатура") Тогда
		СтандартнаяОбработка = Ложь;
		
		Форма = ПолучитьФорму("Справочник.Номенклатура.ФормаСписка", Новый Структура("ТекущаяСтрока", Расшифровка),, Истина);
		Форма.Открыть();
		Форма.ВыполнитьПереход(Расшифровка);
	КонецЕсли;
	
КонецПроцедуры //ОбработкаРасшифровки

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество" таблицы "Товары".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если  (ТекущиеДанные.Количество>0) Тогда
	   ТекущиеДанные.ПеренестиВЗаказ = Истина;
   КонецЕсли;
   
КонецПроцедуры //ТоварыКоличествоПриИзменении ()

&НаСервере
Процедура ВариантФормированияПриИзмененииНаСервере()
	
	Если Объект.ВариантФормирования=1 Тогда //Заказ ЦО за магазины
		Объект.ФормированиеЗаказаВЦО		= Истина;
		Объект.ФормированиеСводногоЗаказа	= Ложь;
		ГрафикиЦОИМагазинов					= Ложь;
		БезГрафика							= Ложь;
		
	ИначеЕсли Объект.ВариантФормирования=2 Тогда //Заказ РЦ поставщику
		Объект.ФормированиеЗаказаВЦО		= Истина;
		Объект.ФормированиеСводногоЗаказа	= Истина;
		ГрафикиЦОИМагазинов					= Ложь;
		БезГрафика							= Ложь;
		
	ИначеЕсли Объект.ВариантФормирования=3 Тогда //Заказ РЦ для ФрОв
		Объект.ФормированиеЗаказаВЦО		= Истина;
		Объект.ФормированиеСводногоЗаказа	= Истина;
		ГрафикиЦОИМагазинов					= Ложь;
		БезГрафика							= Истина;
		
	Иначе //0 - Заказ магазина
		Объект.ФормированиеЗаказаВЦО		= Ложь;
		Объект.ФормированиеСводногоЗаказа	= Ложь;
		ГрафикиЦОИМагазинов					= Ложь;
		БезГрафика							= Ложь;
	КонецЕсли;
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры //ВариантФормированияПриИзмененииНаСервере()

&НаКлиенте
Процедура ВариантФормированияПриИзменении(Элемент)
	
	ВариантФормированияПриИзмененииНаСервере();
	
КонецПроцедуры //ВариантФормированияПриИзменении()

&НаКлиенте
Процедура БезГрафикаПриИзменении(Элемент)
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры //БезГрафикаПриИзменении()

/////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ


// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ОбъектыНазначения") И Параметры.ОбъектыНазначения.Количество()>0 Тогда
		СоздатьДокумент = ?(СтрНайти(Параметры.ИмяФормы,"ФормаДокумента") = 0,Истина,Ложь);
		ОбъектФормы = Параметры.ОбъектыНазначения[0];
		Объект.Дата = ?(ЗначениеЗаполнено(ОбъектФормы.Дата), ОбъектФормы.Дата, ТекущаяДатаСеанса());
		Объект.Поставщик = ОбъектФормы.Поставщик;
		Объект.ПодразделениеКомпании = ОбъектФормы.ПодразделениеКомпании;
		//Объект.СрокПоставки = ?(ЗначениеЗаполнено(ОбъектФормы.СрокПоставки),ОбъектФормы.СрокПоставки,ТекущаяДата() +  + 60 * 60 * 24);
		ТоварыДокумента = ОбъектФормы.Товары.ВыгрузитьКолонку("Номенклатура");
		Если ТоварыДокумента.Количество()>0 Тогда
			СписокНоменклатуры.ЗагрузитьЗначения(ТоварыДокумента);
			ВыполнитьРасчет = Истина;
		КонецЕсли;
	Иначе
		СоздатьДокумент = Истина;
		Объект.Дата = ТекущаяДата();
		ДатаПоставки = КонецДня(Объект.Дата) + 1;
		ДнейРасчета = 2;
		Объект.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
		ПодразделениеКомпанииПриИзмененииНаСервере();
	КонецЕсли;
	
	Объект.ПериодВыбытияПоУмолчанию = 1;
	Объект.УчетДнейПриРасчетеЗаказаПоУмолчанию = 3;
	Объект.ДнейУчетаНезакрытыхЗаказов = 5;
	КоличествоЗаказов = 0;
	Объект.ПроцентПикаПродаж = 200;
	Объект.ДатаАнализа = Объект.Дата - 86400;
	
	ОснПодразделение = (ПараметрыСеанса.ПодразделениеКомпании=Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
	
	//Объект.ФормированиеЗаказаВЦО = ОснПодразделение;
	Объект.ВариантФормирования = ?(ОснПодразделение, 1, 0);
	ВариантФормированияПриИзмененииНаСервере();
	
	//Объект.ТипЦены = ПравоПользователя("ОсновнойТипЦенПродажи");
	//Объект.СкладКомпании = ПравоПользователя("ОсновнойСкладКомпании");
	//СкладКомпанииПриИзмененииНаСервере();
	
	УправлениеДиалогомНаСервере();
	
	СтраницыПриСменеСтраницыНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ИнициализацияНаСервере()
	
	СемьяОпт = Справочники.Контрагенты.НайтиПоКоду("000001843");
	СемьяОптПодр = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000162");
	РемиОпт = Справочники.ПодразделенияКомпании.НайтиПоКоду("ДК-000065");

	//Если СтрНайти(НРег(СемьяОпт.Наименование),"семья")>0 Тогда
	//	Объект.Специфика = "Семья";
	//ИначеЕсли СтрНайти(НРег(РемиОпт.Наименование),"хабаровск")>0 Тогда
	//	Объект.Специфика = "Реми";
	//ИначеЕсли ЕстьРеквизит(Объект.Поставщик,"ЕРПМастерКлюч") Тогда
	//	Объект.Специфика = "мясницкий";
	//Иначе
	//	Объект.Специфика = "";
	//КонецЕсли;
	
	Объект.ОткрыватьДокумент = Ложь;
	Объект.ПроводитьДокумент = Истина;
	Объект.ОтправлятьДокументПочтой = Истина;
	
	Если НЕ Объект.ФормированиеЗаказаВЦО Тогда
		Элементы.ОткрыватьДокумент.Доступность = Ложь;
		Элементы.ПроводитьДокумент.Доступность = Ложь;
		Элементы.ОтправлятьДокументПочтой.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры //ИнициализацияНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройка кнопок командной панели табличной части
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "Товары");
	ИнициализацияНаСервере();
	
	Если НЕ ВыполнитьРасчет=Неопределено И ВыполнитьРасчет Тогда
		ВыполнитьРасчет = Ложь;
		РассчитатьЗаказ(Неопределено);
		
	Иначе
		КонтрагентПриИзменении(Неопределено);
	КонецЕсли;
	
	ЗаполнитьСписокВыбораАнализа();
	
	Заголовок = Заголовок + " (" + Объект.Специфика + ")";
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура СкладКомпанииПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.СкладКомпании) Тогда
		Объект.ПодразделениеКомпании = Объект.СкладКомпании.ПодразделениеКомпании;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СкладКомпании.ТипЦенРозничнойТорговли) Тогда
		Объект.ТипЦены = Объект.СкладКомпании.ТипЦенРозничнойТорговли;
	ИначеЕсли ЗначениеЗаполнено(Объект.ПодразделениеКомпании.ТипЦенРеализации) Тогда
		Объект.ТипЦены = Объект.ПодразделениеКомпании.ТипЦенРеализации;
	Иначе
		Объект.ТипЦены = ПравоПользователя("ОсновнойТипЦенПродажи");
	КонецЕсли;
	
КонецПроцедуры //СкладКомпанииПриИзмененииНаСервере()

&НаКлиенте
Процедура СкладКомпанииПриИзменении(Элемент)
	
	СкладКомпанииПриИзмененииНаСервере();
	
КонецПроцедуры //СкладКомпанииПриИзменении()

&НаСервере
Процедура ПодразделениеКомпанииПриИзмененииНаСервере()
	Если Объект.Специфика = "мясницкий" Тогда
		ОсновнойСклад = Справочники.СкладыКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч", Объект.ПодразделениеКомпании.ЕРПМастерКлючСклада);
		Если Не ОсновнойСклад.Пустая() Тогда
			Объект.СкладКомпании = ОсновнойСклад;
		КонецЕсли;		
	Иначе
		Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка
		|ИЗ
		|	Справочник.СкладыКомпании
		|ГДЕ
		|	ПодразделениеКомпании=&Подразделение
		|	И Наименование ПОДОБНО ""%амообслуживание%""");
		Запрос.УстановитьПараметр("Подразделение", Объект.ПодразделениеКомпании);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Объект.СкладКомпании = Выборка.Ссылка;
			СкладКомпанииПриИзмененииНаСервере();
		Иначе
			Объект.СкладКомпании = Справочники.СкладыКомпании.ПустаяСсылка();
			СкладКомпанииПриИзмененииНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //ПодразделениеКомпанииПриИзмененииНаСервере()

&НаКлиенте
Процедура ПодразделениеКомпанииПриИзменении(Элемент)
	
	ПодразделениеКомпанииПриИзмененииНаСервере();
	
КонецПроцедуры //ПодразделениеКомпанииПриИзменении()


&НаСервере
Процедура ОтобратьТолькоНаСервере()
	Если НЕ Элементы.ТоварыОтобратьТолькоРекомендации.Пометка 
	   И НЕ Элементы.ТоварыОтобратьТолькоНеАкции.Пометка
	   И НЕ Элементы.ТоварыОтобратьТолькоАкции.Пометка Тогда
	    Элементы.Товары.ОтборСтрок = Неопределено;
	Иначе	
		Для Каждого Стр Из Объект.Товары Цикл
			Стр.Отбор = Истина;
			//Если Стр.Код = "" Тогда Продолжить; КонецЕсли;
			
			Если Стр.Отбор И Элементы.ТоварыОтобратьТолькоРекомендации.Пометка Тогда
				Стр.Отбор = Стр.Отбор И (Стр.РекомендуемоеКоличество>0 ИЛИ Стр.Количество>0);
			КонецЕсли;
			Если Стр.Отбор И Элементы.ТоварыОтобратьТолькоАкции.Пометка Тогда
				Стр.Отбор = Стр.Отбор И (Найти(Стр.ПериодАкции,"  ")>0);
			КонецЕсли;
			Если Стр.Отбор И Элементы.ТоварыОтобратьТолькоНеАкции.Пометка Тогда
				Стр.Отбор = Стр.Отбор И (Найти(Стр.ПериодАкции,"  ")=0);
			КонецЕсли;
		КонецЦикла;	
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("Отбор",Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьТолько(Команда)
	Элементы["Товары"+Команда.Имя].Пометка = НЕ Элементы["Товары"+Команда.Имя].Пометка;
	ОтобратьТолькоНаСервере();
	
	//Элементы.Товары.
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналЗаказов(Команда)
	
    ОткрытьФорму("Документ.ЗаказПоставщику.Форма.ФормаСписка");

КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	Если Объект.Поставщик = СемьяОпт Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	СогласованныеЦены.Контрагент КАК Контрагент,
		                      |	СогласованныеЦены.Контрагент.Наименование КАК Наименование
		                      |ИЗ
		                      |	РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
		                      |ГДЕ
		                      |	СогласованныеЦены.ПодразделениеКомпании = &ПодразделениеКомпании
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	СогласованныеЦены.Контрагент,
		                      |	СогласованныеЦены.Контрагент.Наименование
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	СогласованныеЦены.Контрагент.Наименование");
		Запрос.УстановитьПараметр("ПодразделениеКомпании",СемьяОптПодр);
		Элементы.ПоставщикРЦ.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент"));
		//Элементы.ПоставщикРЦ.Видимость = Истина;
	Иначе
		//Элементы.ПоставщикРЦ.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры //КонтрагентПриИзмененииНаСервере()

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры //КонтрагентПриИзменении()

&НаСервере
Процедура ЗакрытьНаСервере()
	
	ТС = Элементы.Страницы.ТекущаяСтраница;
	Если Лев(ТС.Имя,8)="Страница" Тогда
		ЭтотОбъект["Расчет" + Сред(ТС.Имя,9)] = Неопределено;
		ТС.Видимость=Ложь;
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройки;
		СтраницыПриСменеСтраницыНаСервере();
	Иначе
	
	КонецЕсли;
	
КонецПроцедуры //ЗакрытьНаСервере()

&НаКлиенте
Процедура ЗакрытьС(Команда)
	
	ЗакрытьНаСервере();
	
КонецПроцедуры //ЗакрытьНаСервере();


&НаСервере
Процедура УстановитьЗаказПоставщикуВРасчет(ЗаказПоставщику=Неопределено)
	
	Если НЕ ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		ЗаказПоставщику = Документы.ЗаказПоставщику.НайтиПоНомеру("572-0012548", Дата("20200630"));
		//ВывестиСообщение(ЗаказПоставщику);
		//ЗаказПоставщику = Документы.ЗаказПоставщику.НайтиПоНомеру("АН000000002",Дата("20200605"));
	КонецЕсли;	
	
	ТС = Элементы.Страницы.ТекущаяСтраница;
	
	Если Лев(ТС.Имя,8)<>"Страница" Тогда
		Возврат;
	КонецЕсли;
	
	Расчет = ЭтотОбъект["Расчет" + Сред(ТС.Имя,9)];
	
	Если Объект.ВариантФормирования=1 Тогда
		
		РеквизитФормыВЗначение("Объект").ВывестиДокумент(Расчет, ЗаказПоставщику);
		ЭтотОбъект["Расчет" + Сред(ТС.Имя,9)] = Расчет;
		
	ИначеЕсли Объект.ВариантФормирования=2 Тогда
		
		Свод = ЭтотОбъект["Свод" + Сред(ТС.Имя,9)];
		ОбластьДокумент = Свод.Область("Документ");
		ОбластьДокумент.Текст = ЗаказПоставщику;
		ОбластьДокумент.Расшифровка = ЗаказПоставщику;
		
		Элементы["Свод" + Сред(ТС.Имя,9)].ТолькоПросмотр = Истина;
		
	ИначеЕсли Объект.ВариантФормирования=3 Тогда
		
		
		
	Иначе
		
		Расчет = ЭтотОбъект["Расчет" + Сред(ТС.Имя,9)];
		
		//Расчет.Область(2,8).Текст = ЗаказПоставщику;
		//Расчет.Область(2,8).Расшифровка = ЗаказПоставщику;
		//Расчет.Область(2,7).Текст = "Готов";
		ОбластьДокумент = Расчет.Область("Документ");
		ОбластьДокумент.Текст = ЗаказПоставщику;
		ОбластьДокумент.Расшифровка = ЗаказПоставщику;
		ОбластьГотов = Расчет.Область("Готов");
		ОбластьГотов.Текст = "Готов";
		
	КонецЕсли;
	
	Элементы["Расчет" + Сред(ТС.Имя,9)].ТолькоПросмотр = Истина;
	
КонецПроцедуры //УстановитьЗаказПоставщикуВРасчет()

&НаСервере
Функция ПолучитьТабличныеДокументы(ЗаказПоставщику)
	
	ДанныеОтправкиПисем = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		ЗаказПоставщику = Документы.ЗаказПоставщику.НайтиПоНомеру("234593-0012548", Дата("20200630"));
		//ЗаказПоставщику = Документы.ЗаказПоставщику.НайтиПоНомеру("АН000000002",Дата("20200605"));
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Если НЕ ЗаказПоставщику.Проведен Тогда
		ВывестиСообщение("Документа заказа не проведен. Проведите документ для отправкой почтой");
		Возврат Неопределено;
	КонецЕсли;	
	
		
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(ЗаказПоставщику);
	
	ЗаказПоставщикуОбъект = ЗаказПоставщику.ПолучитьОбъект();
	СписокОбъектов = Новый СписокЗначений;
	СписокОбъектов.Добавить(ЗаказПоставщикуОбъект);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТабличныйДокумент = ОбработкаОбъект.ПечатьЗаказПоставщику(МассивДокументов, СписокОбъектов);
	
	Если 1=0 Тогда ТабличныйДокумент = Новый ТабличныйДокумент; КонецЕсли;
	
	
	Контрагенты = Новый Массив;
	Контрагенты.Добавить(ЗаказПоставщику.Контрагент);
	
	EmailКонтрагента = "";
	
	ВидКИ = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
	ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	
	КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(Контрагенты, ТипКИ, ВидКИ);
	СтрокиКИ = КонтактнаяИнформация.НайтиСтроки(Новый Структура("Объект", ЗаказПоставщикуОбъект.Контрагент));
	Если СтрокиКИ.Количество() = 1 Тогда
		EmailКонтрагента = СтрокиКИ[0].Представление;
	ИначеЕсли СтрокиКИ.Количество() > 1 Тогда
		EmailКонтрагента = Новый СписокЗначений;
		Для Каждого СтрокаКИ Из СтрокиКИ Цикл
			EmailКонтрагента.Добавить(СтрокаКИ.Представление);
			//Если НЕ СтрокаКИ = Неопределено Тогда
			//	EmailКонтрагента = EmailКонтрагента + ?(EmailКонтрагента="","",";")+СтрокаКИ.Представление;
			//КонецЕсли;
		КонецЦикла;
		//EmailКонтрагента.Добавить("xclsda@gmail.com");
	КонецЕсли;

	
	ТабличныеДокументы = Новый СписокЗначений;
	ТабличныеДокументы.Добавить(ТабличныйДокумент, "Заказ_" + ЗаказПоставщикуОбъект.Контрагент + ".xls");
	
	НоваяСтрока = Новый Структура;
	НоваяСтрока.Вставить("Получатель",         ЗаказПоставщикуОбъект.Контрагент);
	НоваяСтрока.Вставить("EmailКонтрагента",   EmailКонтрагента);
	НоваяСтрока.Вставить("ТабличныеДокументы", ТабличныеДокументы);
	//Заказ_2254204_ООО "Большая СемьЯ" "Филиал на Комсомольском пр-кте,11

	НоваяСтрока.Вставить("Тема", "Заказ " + ЗаказПоставщику.Номер 
	+ " от " + Формат(ЗаказПоставщику.Дата,"ДФ=dd.MM.yy") 
	+ " """+ЗаказПоставщику.Организация.Наименование + """ "
	+ " """+ЗаказПоставщику.ПодразделениеКомпании.Наименование+"""");
	
	НоваяСтрока.Вставить("Текст", "	");

	ДанныеОтправкиПисем.Добавить(НоваяСтрока);
	
	Возврат ДанныеОтправкиПисем;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьПочтой()
	
	
	//УстановитьЗаказПоставщикуВРасчет();
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройки Тогда
		Возврат;
	КонецЕсли;
	
	ТС = Элементы.Страницы.ТекущаяСтраница;
	Если Лев(ТС.Имя,8)="Страница" Тогда
		ТС = Элементы.Страницы.ТекущаяСтраница;
		Расчет = ЭтотОбъект["Расчет" + Сред(ТС.Имя,9)];;
		//Если НЕ Расчет.Область(2,7).Текст = "Готов" Тогда
		Если НЕ Расчет.Область("Готов").Текст = "Готов" Тогда
			ВывестиСообщение("Данный расчет еще не готов для отправки почтой. Нужно перенести в документ и провести его.");
			Возврат;
		КонецЕсли;	
		
		
		//ЗаказПоставщику = Расчет.Область(2,8).Расшифровка;
		ЗаказПоставщику = Расчет.Область("Документ").Расшифровка;
		Попытка
			Если НЕ ЗначениеЗаполнено(ЗаказПоставщику) Тогда
				ВызватьИсключение Ложь;
			КонецЕсли;
		Исключение
			ВывестиСообщение("Не удалось получить заказ для отправки");
			Возврат;
		КонецПопытки;
	Иначе
		Возврат;
	КонецЕсли;
	
	
	ДанныеОтправкиПисем = ПолучитьТабличныеДокументы(ЗаказПоставщику);
	Если ДанныеОтправкиПисем = Неопределено Тогда
		ВывестиСообщение("Не удалось сформировать письмо поставщику.");
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущееПисьмо Из ДанныеОтправкиПисем Цикл
		
		ПараметрыОтправки = Новый Структура("Тема, Текст, Отправитель, Получатель");
		Если ТекущееПисьмо.Свойство("Тема") Тогда
			ПараметрыОтправки.Тема  = ТекущееПисьмо.Тема;
			ПараметрыОтправки.Текст = ТекущееПисьмо.Текст;
		Иначе
			ПараметрыОтправки.Тема  = "<без темы>";
			ПараметрыОтправки.Текст = "";
		КонецЕсли;
		ПараметрыОтправки.Отправитель = "";
		ПараметрыОтправки.Получатель  = ТекущееПисьмо.EmailКонтрагента;
		
		ЗаголовокСобщения = "Заказ поставщику";
		
		Если ЗначениеЗаполнено(ТекущееПисьмо.EmailКонтрагента) Тогда
			РаботаСПочтовымиСообщениямиКлиент.ОтправитьТабличныеДокументы(ТекущееПисьмо.ТабличныеДокументы, ЗаголовокСобщения, ПараметрыОтправки);
			ВывестиСообщение("Отправлено письмо поставщику.");
		Иначе
			ВывестиСообщение("Не указан электронный адрес по поставщику: " + ТекущееПисьмо.Получатель);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //ОтправитьПочтой()

&НаКлиенте
Процедура ЗаказатьРекомендованное(Команда)
	
	ТС = Элементы.Страницы.ТекущаяСтраница;
	КодРасчета = Сред(ТС.Имя,9);
	Расчет = ЭтотОбъект["Расчет" + КодРасчета];
	Свод = ЭтотОбъект["Свод" + КодРасчета];
	//текЭлРасчет = СтрЗаменить(ЭтаФорма.ТекущийЭлемент.Имя, КодРасчета, "")="Расчет";
	
	колЗаказать = 0;
	колРек = 0;
	колБлок = 0;
	колЗаказМаг = 0;
	колКЗаказу = 0;
	колНаСклад = 0;
	колЦена = 0;
	колСумма = 0;
	колОстРЦ = 0;
	колРекРЦ = 0;
	колМинЗаказ = 0;
	колКвант = 0;
	
	//Код,Товар,Группа,КолПродаж,ДнейПродаж,СредПродаж,Остаток,РасчПотр,МинЗапас,МинЗаказ,РекРасч,РекОкр,Заказать,Акция,ЦенаРозн,Квант,ТМ,ВПути,УчетДней,Блок
	Для НомКол=1 По Расчет.ШиринаТаблицы Цикл
		ИмяКолонки = Расчет.Область(1, НомКол).Текст;
		
		Если ИмяКолонки="Заказать" Тогда
			колЗаказать = НомКол;
		ИначеЕсли ИмяКолонки="РекОкр" Тогда
			колРек = НомКол;
		ИначеЕсли ИмяКолонки="Блок" Тогда
			колБлок = НомКол;
		КонецЕсли;
	КонецЦикла;
	
	Если колЗаказать=0 ИЛИ колРек=0 ИЛИ колБлок=0 Тогда
		Возврат;
	КонецЕсли;
	
	Для НомКол=1 По Свод.ШиринаТаблицы Цикл
		ИмяКолонки = Свод.Область(1, НомКол).Текст;
		Если ИмяКолонки="ЗаказМаг" Тогда
			колЗаказМаг = НомКол;
		ИначеЕсли ИмяКолонки="Заказать" Тогда
			колКЗаказу = НомКол;
		ИначеЕсли ИмяКолонки="НаСклад" Тогда
			колНаСклад = НомКол;
		ИначеЕсли ИмяКолонки="Цена" Тогда
			колЦена = НомКол;
		ИначеЕсли ИмяКолонки="Сумма" Тогда
			колСумма = НомКол;
		ИначеЕсли ИмяКолонки="Код" Тогда
			колКод = НомКол;
		ИначеЕсли ИмяКолонки="ОстРЦ" Тогда
			колОстРЦ = НомКол;
		ИначеЕсли ИмяКолонки="РекРЦ" Тогда
			колРекРЦ = НомКол;
		ИначеЕсли ИмяКолонки="МинЗаказ" Тогда
			колМинЗаказ = НомКол;
		ИначеЕсли ИмяКолонки="Квант" Тогда
			колКвант = НомКол;
		КонецЕсли;
	КонецЦикла;
	
	Если колЗаказМаг=0 Тогда
	
		Для С = Расчет.ФиксацияСверху+1 По Расчет.ВысотаТаблицы Цикл
			Попытка
				Заблокировано = (Расчет.Область(с, колБлок).Расшифровка = Истина);
			Исключение
				Заблокировано = Ложь;
			КонецПопытки;
			
			Если Заблокировано Тогда
				Рекомендация = 0;
			Иначе
				Попытка
					Рекомендация = Число(Расчет.Область(с, колРек).Текст);
				Исключение
					Рекомендация = 0;
				КонецПопытки;
			КонецЕсли;
			
			ОбластьЗаказать = Расчет.Область(с, колЗаказать, с, колЗаказать);
			Если ОбластьЗаказать.СодержитЗначение Тогда
				ОбластьЗаказать.Значение = Рекомендация;
			КонецЕсли;
		КонецЦикла;
		
		РассчитатьИтоги("Расчет" + КодРасчета);
		
	Иначе
		
		//ПризнакОтбора = ?(текЭлРасчет, ОбластьЗаказать.Видимость, Истина);
		//ОбластьЗаказМагазина = Свод.Область(Свод.ТекущаяОбласть.Верх, колЗаказМаг);
		Для НомерСтроки = Свод.ФиксацияСверху+1 По Свод.ВысотаТаблицы Цикл
			
			ОбластьЗаказМагазина = Свод.Область(НомерСтроки, колЗаказМаг);
			Если НЕ ОбластьЗаказМагазина.СодержитЗначение Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураДанных = ВспомогательныеДанныеФормы(КодРасчета);
			
			КодТовара = Свод.Область(НомерСтроки, колКод).Текст;
			МассивСтрок = СтруктураДанных.СтрокиНоменклатуры[КодТовара];
			
			Если НЕ ЗначениеЗаполнено(МассивСтрок) Тогда
				Продолжить;
			КонецЕсли;
			
			ОбщееКоличество = 0;
			//идем по строкам расчета(нижняя таблица)
			Для Каждого текСтрока Из МассивСтрок Цикл
				
				Попытка
					Заблокировано = (Расчет.Область(текСтрока, колБлок).Расшифровка = Истина);
				Исключение
					Заблокировано = Ложь;
				КонецПопытки;
				
				Если Заблокировано Тогда
					Рекомендация = 0;
				Иначе
					Попытка
						Рекомендация = Число(Расчет.Область(текСтрока, колРек).Текст);
					Исключение
						Рекомендация = 0;
					КонецПопытки;
				КонецЕсли;
				
				ОбластьЗаказать = Расчет.Область(текСтрока, колЗаказать);
				Если ОбластьЗаказать.СодержитЗначение Тогда
					ОбластьЗаказать.Значение = Рекомендация;
					ОбщееКоличество = ОбщееКоличество + Рекомендация;
				КонецЕсли;
				
			КонецЦикла;
			
			//установим итог в своде
			ОбластьЗаказМагазина.Значение = ОбщееКоличество;
			
			КвантПоставки = Свод.Область(НомерСтроки, колКвант).Значение;
			
			//обновляем количество и сумму в своде
			ОбластьКЗаказу = Свод.Область(НомерСтроки, колКЗаказу);
			ОбластьНаСклад = Свод.Область(НомерСтроки, колНаСклад);
			ОбластьОстРЦ = Свод.Область(НомерСтроки, колОстРЦ);
			ОбластьРекРЦ = Свод.Область(НомерСтроки, колРекРЦ);
			ОбластьМинЗаказ = Свод.Область(НомерСтроки, колМинЗаказ);
			
			РекомендуемоеРЦ = ОбластьЗаказМагазина.Значение - ОбластьОстРЦ.Значение;
			
			//РекомендуемоеРЦ = ?(ОбластьМинЗаказ.Значение>РекомендуемоеРЦ, ОбластьМинЗаказ.Значение, РекомендуемоеРЦ);
			
			Если КвантПоставки>0 Тогда
				Если (РекомендуемоеРЦ - Окр(РекомендуемоеРЦ / КвантПоставки - 0.25, 0) * КвантПоставки) < (КвантПоставки / 4) Тогда
					РекомендуемоеРЦ = КвантПоставки * Окр(РекомендуемоеРЦ / КвантПоставки - 0.25, 0);
				Иначе
					РекомендуемоеРЦ = КвантПоставки * (1 + Окр(РекомендуемоеРЦ / КвантПоставки - 0.25, 0));
				КонецЕсли;
			КонецЕсли;
			
			ОбластьРекРЦ.Значение = РекомендуемоеРЦ;
			
			ОбластьКЗаказу.Значение = Макс(ОбластьНаСклад.Значение + ОбластьРекРЦ.Значение, 0);
			
			//проверяем квант
			Если КвантПоставки>=1 Тогда
				Кратность = ОбластьКЗаказу.Значение%КвантПоставки;
				Если Кратность=0 Тогда
					Свод.Область(НомерСтроки, колКвант).ЦветФона = Новый Цвет(255, 255, 255);
				Иначе
					Свод.Область(НомерСтроки, колКвант).ЦветФона = Новый Цвет(255, 0, 0);
				КонецЕсли;
			КонецЕсли;
			
			//считаем сумму
			Цена = Свод.Область(НомерСтроки, колЦена).Значение;
			ОбластьСумма = Свод.Область(НомерСтроки, колСумма);
			ОбластьСумма.Значение = Цена * ОбластьКЗаказу.Значение;
			
		КонецЦикла;
		
		//Если Элементы["Свод" + КодРасчета].Видимость Тогда
		РассчитатьИтоги("Свод" + КодРасчета);
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //ЗаказатьРекомендованное()

&НаКлиенте
Процедура ОбновитьГрафик(Команда)
	
	ТекущийГрафик.Очистить();
	
	Если Команда.Имя="ОбновитьГрафик" Тогда
		СформироватьГрафик(Истина);
	Иначе
		СформироватьГрафик(,Истина);
	КонецЕсли;
	
КонецПроцедуры //ОбновитьГрафик()

&НаКлиенте
Процедура ОчиститьГрафик(Команда)
	
	ТекущийГрафик.Очистить();
	
КонецПроцедуры //ОчиститьГрафик()

&НаКлиенте
Процедура УбратьСтрокуГрафика(Команда)
	
	МассивУдаления = Новый Массив;
	
	Для Каждого СтрокаГрафика Из Элементы.ТекущийГрафик.ВыделенныеСтроки Цикл
		МассивУдаления.Добавить(ТекущийГрафик.НайтиПоИдентификатору(СтрокаГрафика));
	КонецЦикла;
	
	Для Каждого СтрокаГрафика Из МассивУдаления Цикл
		ТекущийГрафик.Удалить(СтрокаГрафика);
	КонецЦикла;
	
КонецПроцедуры // УбратьСтрокуГрафика()

&НаКлиенте
Процедура ЗаполнитьСписокВыбораАнализа()
	
	СписокВыбора = Элементы.ДатаАнализа.СписокВыбора;
	СписокВыбора.Очистить();
	
	Пн = ДеньНедели(Объект.Дата) - 1;
	Вт = ДеньНедели(Объект.Дата) - 2;
	Ср = ДеньНедели(Объект.Дата) - 3;
	Чт = ДеньНедели(Объект.Дата) - 4;
	Пт = ДеньНедели(Объект.Дата) - 5;
	Сб = ДеньНедели(Объект.Дата) - 6;
	Вс = ДеньНедели(Объект.Дата) - 7;
	
	Понедельник	= Объект.Дата - ?(Пн>0, Пн, 7+Пн) *86400;
	Вторник		= Объект.Дата - ?(Вт>0, Вт, 7+Вт) * 86400;
	Среда		= Объект.Дата - ?(Ср>0, Ср, 7+Ср) * 86400;
	Четверг		= Объект.Дата - ?(Чт>0, Чт, 7+Чт) * 86400;
	Пятница		= Объект.Дата - ?(Пт>0, Пт, 7+Пт) * 86400;
	Суббота		= Объект.Дата - ?(Сб>0, Сб, 7+Сб) * 86400;
	Воскресенье	= Объект.Дата - ?(Вс>0, Вс, 7+Вс) * 86400;
	
	//СписокВыбора.Добавить(Объект.Дата-86400, "Вчера");
	СписокВыбора.Добавить(Понедельник, "Прошлый понедельник (" + Формат(Понедельник, "ДФ=dd.MM.yyyy") + ")");
	СписокВыбора.Добавить(Вторник, "Прошлый вторник (" + Формат(Вторник, "ДФ=dd.MM.yyyy") + ")");
	СписокВыбора.Добавить(Среда, "Прошлая среда (" + Формат(Среда, "ДФ=dd.MM.yyyy") + ")");
	СписокВыбора.Добавить(Четверг, "Прошлый четверг (" + Формат(Четверг, "ДФ=dd.MM.yyyy") + ")");
	СписокВыбора.Добавить(Пятница, "Прошлая пятница (" + Формат(Пятница, "ДФ=dd.MM.yyyy") + ")");
	СписокВыбора.Добавить(Суббота, "Прошлая суббота (" + Формат(Суббота, "ДФ=dd.MM.yyyy") + ")");
	СписокВыбора.Добавить(Воскресенье, "Прошлое воскресенье (" + Формат(Воскресенье, "ДФ=dd.MM.yyyy") + ")");
	
КонецПроцедуры //ЗаполнитьСписокВыбораАнализа()

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.ДатаАнализа = Объект.Дата-86400;
	
	ЗаполнитьСписокВыбораАнализа();
	
КонецПроцедуры //ДатаПриИзменении()

&НаКлиенте
Процедура ДатаАнализаПриИзменении(Элемент)
	
	Если Объект.ДатаАнализа > Объект.Дата Тогда
		Объект.ДатаАнализа = Объект.Дата;
	КонецЕсли;
	
КонецПроцедуры //ДатаАнализаПриИзменении()


&НаСервере
Функция СохранитьРасчетВФайлНаСервере(КодРасчета)
	Отбор = ЭтотОбъект["Отбор" + КодРасчета]; 
	ОтборСвод = ЭтотОбъект["ОтборСвод" + КодРасчета]; 
	Свод = ЭтотОбъект["Свод" + КодРасчета]; 
	Расчет = ЭтотОбъект["Расчет" + КодРасчета];	Если Расчет=Неопределено Тогда Расчет = Новый ТабличныйДокумент; КонецЕсли;
	
	Данные = Новый Структура;
	Данные.Вставить("Дата", ТекущаяДата());
	Данные.Вставить("Имя", Элементы.Страницы.ТекущаяСтраница.Заголовок);
	Данные.Вставить("Свод", Свод);
	Данные.Вставить("Расчет", Расчет);
	Данные.Вставить("Отбор", Отбор);
	Данные.Вставить("ОтборСвод", ОтборСвод);

	
	ВремФайл = ПолучитьИмяВременногоФайла();
	
	ЗначениеВФайл(ВремФайл,Данные);
	Двоичное=Новый ДвоичныеДанные(ВремФайл);
	Адрес=ПоместитьВоВременноеХранилище(Двоичное,ЭтаФорма.УникальныйИдентификатор);
	Возврат Адрес
КонецФункции

&НаКлиенте
Процедура СохранитьРасчетВФайл(Команда)
	ТС = Элементы.Страницы.ТекущаяСтраница;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Расширение = "rz";
	Имя = "Расчет заказа " + ТС.Заголовок + " от " + Формат(ТекущаяДата(),"ДФ='dd-MM-yyyy HH-mm'");
	Имя = СтрЗаменить(Имя,":","-");
	Имя = СтрЗаменить(Имя,",","_");
	Имя = СтрЗаменить(Имя,";","_");
	Диалог.ПолноеИмяФайла = Имя;
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	
		КодРасчета = Сред(ТС.Имя,9);
		Адрес = СохранитьРасчетВФайлНаСервере(КодРасчета);
		
		Описание=Новый ОписаниеПередаваемогоФайла(ИмяФайла,Адрес);
		МассивОписаний=Новый Массив;
		МассивОписаний.Добавить(Описание);
		ПолучитьФайлы(МассивОписаний,,,Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРасчетИзФайлаНаСервере(Адрес)
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	тФайл = ПолучитьИмяВременногоФайла();
	ДвоичныеДанные.Записать(тФайл);
	Данные = ЗначениеИзФайла(тФайл);
	ДобавитьСтраницуЗаказа(Данные);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРасчетИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.Расширение = "rz";
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	
		Файл = Новый ДвоичныеДанные(ИмяФайла);
		Адрес = ПоместитьВоВременноеХранилище(Файл, ЭтаФорма.УникальныйИдентификатор);
		ЗагрузитьРасчетИзФайлаНаСервере(Адрес);		
	КонецЕсли;
	
КонецПроцедуры //ЗагрузитьРасчетИзФайла()

&НаСервере
Функция ПолучитьМассивНоменклатурыПоТексту(Буфер,МассивСообщений)
	
	Буфер = СтрЗаменить(Буфер, Символы.Таб, Символы.ПС);
	Буфер = СтрЗаменить(Буфер, Символы.ВТаб, Символы.ПС);
	Буфер = СтрЗаменить(Буфер, ",", Символы.ПС);
	Буфер = СтрЗаменить(Буфер, ";", Символы.ПС);
	Буфер = СтрЗаменить(Буфер, "	", Символы.ПС);
	
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(Буфер);
	
	МассивНоменклатуры = Новый Массив;
	Для ч=1 по Текст.КоличествоСтрок() Цикл
		Значение = СокрЛП(Текст.ПолучитьСтроку(ч));
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Продолжить;
		КонецЕсли;	
		Если СтрДлина(Значение)>13 Тогда 
			МассивСообщений.Добавить("Пропущено значение [" + Значение + "]");
			Продолжить;
		КонецЕсли;	
		
		Товар = Справочники.Номенклатура.НайтиПоКоду(Значение);
		Если НЕ ЗначениеЗаполнено(Товар) Тогда
			Товар = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Значение);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Товар) Тогда
			Если СтрДлина(Значение)=8 ИЛИ СтрДлина(Значение)=13 Тогда
				Запрос = Новый Запрос("ВЫБРАТЬ Штрихкоды.Объект КАК Объект ИЗ РегистрСведений.Штрихкоды КАК Штрихкоды ГДЕ	Штрихкоды.Штрихкод = &Штрихкод");
				Запрос.УстановитьПараметр("ШтрихКод",Значение);
				Рез = Запрос.Выполнить().Выбрать();
				Если Рез.Следующий() Тогда
					Если Рез.Количество()>1 Тогда
						МассивСообщений.Добавить("Найдено несколько товаров при поиске по штрихкоду по значению [" + Значение + "]");
					Иначе
						Товар = Рез.Объект;		
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(Товар) Тогда
			МассивСообщений.Добавить("Не удалось определить товар по значению [" + Значение + "]");
			Продолжить;
		КонецЕсли;
		Если Товар.ЭтоГруппа Тогда 
			Продолжить;
		КонецЕсли;
		
		МассивНоменклатуры.Добавить(Товар);
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
	
КонецФункции //ПолучитьМассивНоменклатурыПоТексту()

&НаКлиенте
Функция ПолучитьТекстИзБуфера()
	
   	ОбъектШ = Новый COMОбъект("htmlfile");
	ТекстИзБуфера = ОбъектШ.ParentWindow.ClipboardData.Getdata("Text");
	
	Если ТекстИзБуфера=Неопределено Тогда
		ВывестиСообщение("Не удалось получить буфер обмена");
		Возврат "";
	КонецЕсли;
	
	ТекстИзБуфера = СокрЛП(ТекстИзБуфера);
	Если ТекстИзБуфера="" Тогда
		ВывестиСообщение("Буфер пуст");
	КонецЕсли;
	
	Возврат ТекстИзБуфера;
	
КонецФункции //ПолучитьТекстИзБуфера()

&НаКлиенте
Процедура ВставитьИзБуфера(Команда)
	
	ТекстИзБуфера = ПолучитьТекстИзБуфера();
	
	МассивСообщений = Новый Массив;
	
	СписокНоменклатуры.ЗагрузитьЗначения(ПолучитьМассивНоменклатурыПоТексту(ТекстИзБуфера, МассивСообщений));
	
	Для Каждого Сообщение Из МассивСообщений Цикл
		ВывестиСообщение(Сообщение);
	КонецЦикла;
	
КонецПроцедуры // ВставитьИзБуфера()


&НаСервере
Функция ПолучитьЗначениеЯчейки(ЛистExcel, НомерСтроки, НомерКолонки)
	
	Область = ЛистExcel.ПолучитьОбласть(НомерСтроки, НомерКолонки);
	
	Возврат СокрЛП(Область.ТекущаяОбласть.Текст);
	
КонецФункции //ПолучитьЗначениеЯчейки()

&НаСервере
Функция ПолучитьНоменклатуруПоАртикулу(Артикул)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1 Номенклатура.Ссылка
	|ИЗ	РегистрСведений.Штрихкоды КАК Штрихкоды
	|	ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|	ПО Штрихкоды.Объект = Номенклатура.Ссылка
	|ГДЕ НЕ Номенклатура.ЭтоГруппа И (Номенклатура.Артикул=&Артикул ИЛИ ЕСТЬNULL(ШтрихКоды.ШтрихКод,"""")=&Артикул)");
	Запрос.УстановитьПараметр("Артикул", СокрЛП(Артикул));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Лев("000000", 6 - СтрДлина(Артикул)) + Артикул);
		
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			Сообщить("Не удалось найти номенклатуру с артикулом: " + Лев("000000", 6 - СтрДлина(Артикул)) + Артикул);
			Возврат Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		
		Возврат Номенклатура;
	КонецЕсли;
	
КонецФункции //ПолучитьНоменклатуруПоАртикулу()



&НаСервере
Процедура ЗагрузитьЗаказыИзФайлаНаСервере(Адрес)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	ВременныйФайл = ПолучитьИмяВременногоФайла("xlsx");
	ДвоичныеДанные.Записать(ВременныйФайл);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ВременныйФайл);
	
	Попытка
		ИмяЛиста = ТабличныйДокумент.Области[0].Имя;
	Исключение
		Сообщить("Не удалось получить первый лист в файле.");
		Возврат;
	КонецПопытки;
	
	ЛистExcel = ТабличныйДокумент.ПолучитьОбласть(ИмяЛиста);
	
	КоличествоСтрок = ЛистExcel.ПолучитьРазмерОбластиДанныхПоВертикали();
	КоличествоКолонок = ЛистExcel.ПолучитьРазмерОбластиДанныхПоГоризонтали();
	
	Если КоличествоСтрок<7 ИЛИ КоличествоКолонок<5 Тогда
		Сообщить("Файл не содержит необходимых строк или колонок для загрузки. Проверьте корректность выбранного файла.");
		Возврат;
	КонецЕсли;
	
	тзЗагрузки = Новый ТаблицаЗначений;
	тзЗагрузки.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	тзЗагрузки.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
	тзЗагрузки.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	тзЗагрузки.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	тзЗагрузки.Колонки.Добавить("ДатаПоставки", Новый ОписаниеТипов("Дата"));
	тзЗагрузки.Индексы.Добавить("Контрагент,ДатаПоставки");
	
	
	ЕстьОшибки = Ложь;
	//читаем документ построчно
	Для НомСтр=7 По КоличествоСтрок Цикл
		Артикул			= ПолучитьЗначениеЯчейки(ЛистExcel, НомСтр, 1);
		КодСклада		= ПолучитьЗначениеЯчейки(ЛистExcel, НомСтр, 2);
		КодПоставщика	= ПолучитьЗначениеЯчейки(ЛистExcel, НомСтр, 3);
		Количество		= ПолучитьЗначениеЯчейки(ЛистExcel, НомСтр, 4);
		стрДатаПоставки	= ПолучитьЗначениеЯчейки(ЛистExcel, НомСтр, 5);
		
		//определяем номенклатуру
		Если ЗначениеЗаполнено(Артикул) Тогда
			Номенклатура = ПолучитьНоменклатуруПоАртикулу(Артикул);
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			ВывестиСообщение("Не удалось найти номенклатуру по артикулу: " + Артикул);//, Объект, Поле, НомерСтроки, Отказ, Параметр)
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		//определяем контрагента
		Контрагент = Неопределено;
		Если ЗначениеЗаполнено(КодПоставщика) Тогда
			Контрагент = Справочники.Контрагенты.НайтиПоКоду(КодПоставщика);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
			ВывестиСообщение("Не удалось найти контрагента по коду: " + КодПоставщика);//, Объект, Поле, НомерСтроки, Отказ, Параметр)
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		//определяем склад
		Склад = Неопределено;
		Если ЗначениеЗаполнено(КодСклада) Тогда
			//Склад = Справочники.СкладыКомпании.НайтиПоКоду(КодСклада);
			Склад = Справочники.ПодразделенияКомпании.НайтиПоРеквизиту("Префикс",КодСклада+"-");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Склад) Тогда
			ВывестиСообщение("Не удалось найти склад по коду: " + КодСклада);//, Объект, Поле, НомерСтроки, Отказ, Параметр)
			ЕстьОшибки = Истина;
		КонецЕсли;
		
		//определяем количество
		Попытка
			Количество = Число(Количество);
		Исключение
			Количество = 0;
		КонецПопытки;
			
		Если Количество=0 Тогда
			//ВывестиСообщение("Нет количества для заказа, по товару : " + Номенклатура);//, Объект, Поле, НомерСтроки, Отказ, Параметр)
			Продолжить;
		КонецЕсли;
		
		//определяем дату поставки
		
		тДатаПоставки = стрДатаПоставки;
		Если НЕ ТипЗнч(тДатаПоставки)=Тип("Дата") Тогда
			
			Попытка
				стрДатаПоставки= СтрЗаменить(стрДатаПоставки,".","");
				стрДатаПоставки= СтрЗаменить(стрДатаПоставки,"-","");
				стрДатаПоставки= СтрЗаменить(стрДатаПоставки,"/","");
				стрДатаПоставки= СтрЗаменить(стрДатаПоставки,"\","");
				тДатаПоставки = Дата(стрДатаПоставки);
			Исключение
				ВывестиСообщение("Не удалось определить дату поставки по значению: " + стрДатаПоставки);//, Объект, Поле, НомерСтроки, Отказ, Параметр)
				ЕстьОшибки = Истина;
			КонецПопытки;
		КонецЕсли;	
		

		//добавляем строки
		НоваяСтрока = тзЗагрузки.Добавить();
		НоваяСтрока.Номенклатура	= Номенклатура;
		НоваяСтрока.Склад			= Склад;
		НоваяСтрока.Контрагент		= Контрагент;
		НоваяСтрока.Количество		= Количество;
		НоваяСтрока.ДатаПоставки	= тДатаПоставки;
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		ВывестиСообщение("При чтении данных возникли ошибки, загрузка отменена");
		Возврат;
	КонецЕсли;
	
	тзЗагрузки.Свернуть("Склад,Номенклатура,Контрагент,ДатаПоставки", "Количество");
	
	тзСкладов = тзЗагрузки.Скопировать(,"Склад");
	тзСкладов.Свернуть("Склад");
	тзКонтрагентов = тзЗагрузки.Скопировать(,"Контрагент");
	тзКонтрагентов.Свернуть("Контрагент");
	тзДатПоставки = тзЗагрузки.Скопировать(,"ДатаПоставки");
	тзДатПоставки.Свернуть("ДатаПоставки");
	
	НачатьТранзакцию();
	
	Для Каждого СтрокаСклад  Из тзСкладов Цикл
		Для Каждого СтрокаПоставки Из тзДатПоставки Цикл
			Для Каждого СтрокаКонтрагент Из тзКонтрагентов Цикл
				НайденныеСтроки = тзЗагрузки.НайтиСтроки(Новый Структура("Контрагент,ДатаПоставки,Склад", СтрокаКонтрагент.Контрагент, СтрокаПоставки.ДатаПоставки,СтрокаСклад.Склад));
				Если НайденныеСтроки.Количество()>0 Тогда

					
					Результат = Новый Структура;
					Результат.Вставить("Подразделение", СтрокаСклад.Склад); //
					//Результат.Вставить("СкладКомпании", СтрокаСклад.Склад);
					Результат.Вставить("ДатаПоставки", СтрокаПоставки.ДатаПоставки);
					Результат.Вставить("Контрагент", СтрокаКонтрагент.Контрагент);
					Результат.Вставить("СоздатьДокумент", Истина);
					Результат.Вставить("Объект", Объект);
					Результат.Вставить("Проводить", Объект.ПроводитьДокумент);
					
					ВыбранныеТовары = Новый Соответствие;
					Для Каждого текСтрока Из НайденныеСтроки Цикл
						ВыбранныеТовары.Вставить(текСтрока.Номенклатура, текСтрока.Количество);
					КонецЦикла;
					
					Результат.Вставить("ВыбранныеТовары", ВыбранныеТовары);
					
					ДобавитьВДокументНаСервере(Результат);
						
					Если Результат.Свойство("Ошибка") Тогда
						ВывестиСообщение(Результат.Ошибка);
						ОтменитьТранзакцию();
						Возврат;
					Иначе
						//ВывестиСообщение("Создан документ заказа : " + Результат.ОбъектДокумента, Результат.ОбъектДокумента);//, Объект, Поле, НомерСтроки, Отказ, Параметр)
					КонецЕсли;
				
				КонецЕсли;
			КонецЦикла;

		КонецЦикла;
	КонецЦикла;
	ЗафиксироватьТранзакцию();		

КонецПроцедуры //ЗагрузитьЗаказыИзФайлаНаСервере()


&НаКлиенте
Процедура ЗагрузитьЗаказыИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.Расширение = "xlsx";
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
		
		Файл = Новый Файл(ИмяФайла); 
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
		КопироватьФайл(ИмяФайла, ИмяВременногоФайла);
		
		Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), ЭтаФорма.УникальныйИдентификатор);
		ЗагрузитьЗаказыИзФайлаНаСервере(Адрес);		
	КонецЕсли;
	
КонецПроцедуры //ЗагрузитьЗаказыИзФайла()








