
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не РольДоступна("итДобавлениеИзменениеЗаявкиНаВозврат") И Не РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Цвет) Тогда
		ЦветОформления = Обработки.бит_ПреобразованияЦветов.HexToColor(Объект.Цвет);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЦветОформленияПриИзмененииНаСервере()
	Если ЦветОформления.Красный >= 0 И ЦветОформления.Зеленый >= 0 И ЦветОформления.Синий >= 0 Тогда
		Объект.Цвет = Обработки.бит_ПреобразованияЦветов.ColorToHEX(ЦветОформления.Красный, ЦветОформления.Зеленый, ЦветОформления.Синий);
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЦветОформленияПриИзменении(Элемент)
	ЦветОформленияПриИзмененииНаСервере();
КонецПроцедуры

