// Модуль основной формы документа "Изменение цен"
&НаКлиенте
перем ШтрихКодДляПоиска;


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура НайтиРазницу(ТекущиеДанные = Неопределено, ТекущиеИмяКолонки = Неопределено)
	
	Если ТекущиеИмяКолонки = Неопределено Тогда
		Для Каждого ТекущийТипЦен Из ТипыЦен Цикл
			Если ТекущиеДанные = Неопределено Тогда
				Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
					ТекущаяСтрока["Разница"+ТекущийТипЦен.ИмяКолонки] = ТекущаяСтрока["ПроцентНаценки"+ТекущийТипЦен.ИмяКолонки] - ТекущаяСтрока["ТекущийПроцентНаценки"+ТекущийТипЦен.ИмяКолонки];
				КонецЦикла;
			Иначе
				ТекущиеДанные["Разница"+ТекущийТипЦен.ИмяКолонки] = ТекущиеДанные["ПроцентНаценки"+ТекущийТипЦен.ИмяКолонки] - ТекущиеДанные["ТекущийПроцентНаценки"+ТекущийТипЦен.ИмяКолонки];
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТекущиеДанные = Неопределено Тогда
		Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
			ТекущаяСтрока["Разница"+ТекущиеИмяКолонки] = ТекущаяСтрока["ПроцентНаценки"+ТекущиеИмяКолонки] - ТекущаяСтрока["ТекущийПроцентНаценки"+ТекущиеИмяКолонки];
		КонецЦикла;
	Иначе
		ТекущиеДанные["Разница"+ТекущиеИмяКолонки] = ТекущиеДанные["ПроцентНаценки"+ТекущиеИмяКолонки] - ТекущиеДанные["ТекущийПроцентНаценки"+ТекущиеИмяКолонки];
	КонецЕсли;
	
	Если ТекущиеИмяКолонки = Неопределено Тогда
		Для Каждого ТекущийТипЦен Из ТипыЦен Цикл
			Если ТекущиеДанные = Неопределено Тогда
				Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
					ТекущаяСтрока["РазницаСумма"+ТекущийТипЦен.ИмяКолонки] = ТекущаяСтрока["СуммаНаценки"+ТекущийТипЦен.ИмяКолонки] - ТекущаяСтрока["ТекущаяСуммаНаценки"+ТекущийТипЦен.ИмяКолонки];
				КонецЦикла;
			Иначе
				ТекущиеДанные["РазницаСумма"+ТекущийТипЦен.ИмяКолонки] = ТекущиеДанные["СуммаНаценки"+ТекущийТипЦен.ИмяКолонки] - ТекущиеДанные["ТекущаяСуммаНаценки"+ТекущийТипЦен.ИмяКолонки];
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТекущиеДанные = Неопределено Тогда
		Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
			ТекущаяСтрока["РазницаСумма"+ТекущиеИмяКолонки] = ТекущаяСтрока["СуммаНаценки"+ТекущиеИмяКолонки] - ТекущаяСтрока["ТекущаяСуммаНаценки"+ТекущиеИмяКолонки];
		КонецЦикла;
	Иначе
		ТекущиеДанные["РазницаСумма"+ТекущиеИмяКолонки] = ТекущиеДанные["СуммаНаценки"+ТекущиеИмяКолонки] - ТекущиеДанные["ТекущаяСуммаНаценки"+ТекущиеИмяКолонки];
	КонецЕсли;
КонецПроцедуры

// Процедура получения наценки номенклатуры
//
&НаСервере
Процедура ОбновитьТекущиеНаценки(ТекущиеДанные = Неопределено, ДанныеТипаЦен = Неопределено)
	
	Момент = ?(Объект.Ссылка.Пустая(), Новый МоментВремени(КонецДня(Объект.ДатаНачалаДействия)), Новый Граница(Новый МоментВремени(Объект.ДатаНачалаДействия, Объект.Ссылка),ВидГраницы.Исключая));
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("Момент", Момент);
	ПараметрыДействия.Вставить("ТаблицаТоваров", ТаблицаНоменклатуры);
	
	Если ДанныеТипаЦен = Неопределено Тогда
		Для Каждого ТекущийТипЦен Из ТипыЦен Цикл
			ткОбработкаТабличнойЧастиТовары.ЗаполнитьРеквизитРекомендуемыйПроцентНаценки(Объект, ТекущийТипЦен.ТипЦен, ТекущиеДанные, "ТекущийПроцентНаценки"+ТекущийТипЦен.ИмяКолонки, "Товары", ПараметрыДействия);
			НайтиРазницу(ТекущиеДанные, ТекущийТипЦен.ИмяКолонки);
		КонецЦикла;
	Иначе
		ткОбработкаТабличнойЧастиТовары.ЗаполнитьРеквизитРекомендуемыйПроцентНаценки(Объект, ДанныеТипаЦен.ТипЦен, ТекущиеДанные, "ТекущийПроцентНаценки"+ДанныеТипаЦен.ИмяКолонки, "Товары", ПараметрыДействия);
		НайтиРазницу(ТекущиеДанные, ДанныеТипаЦен.ИмяКолонки);
	КонецЕсли;
	
КонецПроцедуры

// Процедура получения цен номенклатуры
//
&НаСервере
Процедура ОбновитьЦены(ТекущиеДанные = Неопределено, ДанныеТипаЦен = Неопределено)
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("ТаблицаТоваров", ТаблицаНоменклатуры);
	ПараметрыДействия.Вставить("Момент",         Объект.ДатаНачалаДействия);
	
	Если ДанныеТипаЦен = Неопределено Тогда
		Для Каждого ТекущийТипЦен Из ТипыЦен Цикл
			ткОбработкаТабличнойЧастиТовары.ЗаполнитьРеквизитЦена(Объект, ТекущийТипЦен.ТипЦен, ТекущиеДанные, "Цена"+ТекущийТипЦен.ИмяКолонки, "Товары", ПараметрыДействия);
		КонецЦикла;
	Иначе
		ткОбработкаТабличнойЧастиТовары.ЗаполнитьРеквизитЦена(Объект, ДанныеТипаЦен.ТипЦен, ТекущиеДанные, "Цена"+ДанныеТипаЦен.ИмяКолонки, "Товары", ПараметрыДействия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьКолонкуТипаЦен(ИмяКолонки, РодительКолонки)
	
	// Создадим новые колонки
	НоваяКолонка = Элементы.Добавить("ТаблицаНоменклатуры"+ИмяКолонки, Тип("ПолеФормы"), РодительКолонки);
	НоваяКолонка.Вид=ВидПоляФормы.ПолеВвода;
	НоваяКолонка.ПутьКДанным = "ТаблицаНоменклатуры."+ИмяКолонки;
	НоваяКолонка.РастягиватьПоГоризонтали = Ложь;
	НоваяКолонка.АвтоМаксимальнаяШирина = Ложь;
	НоваяКолонка.Ширина = 8;
	НоваяКолонка.МаксимальнаяШирина = 8;
	
	Видимость = Ложь;
	
	Для Каждого ТекКолонка Из ВидимостьКолонок Цикл
		Если НЕ СтрНайти(ИмяКолонки, ТекКолонка.Значение) = 0 Тогда
			Видимость = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	НоваяКолонка.Видимость = Видимость;
	
	Возврат НоваяКолонка;
	
КонецФункции

// Процедура создания реквизитов и элементов выбранных типов цен
//
&НаСервере
Процедура СоздатьКолонкуТипаЦен(ТипЦен, ИдентификаторТипаЦен, ДобавлятьРеквизит = Истина) Экспорт
	
	Если ИдентификаторТипаЦен = Неопределено Тогда
		ИдентификаторТипаЦен = СтрЗаменить(ТипЦен.УникальныйИдентификатор(),"-","_");
	КонецЕсли;
	
	Если НЕ Элементы.Найти("ТаблицаНоменклатурыГруппа"+ИдентификаторТипаЦен) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Создадим новые колонки
	НоваяГруппаКолонок           = Элементы.Добавить("ТаблицаНоменклатурыГруппа"+ИдентификаторТипаЦен, Тип("ГруппаФормы"), Элементы.ТаблицаНоменклатуры);
	НоваяГруппаКолонок.Вид       = ВидГруппыФормы.ГруппаКолонок;
	НоваяГруппаКолонок.Заголовок = ТипЦен.Наименование;
	НоваяГруппаКолонок.ОтображатьВШапке = Истина;
	НоваяГруппаКолонок.Группировка = ГруппировкаКолонок.Горизонтальная;
	НоваяГруппаКолонок.Подсказка = НСтр("ru = 'Тип цен ""'") + ТипЦен.Наименование + """";
	
	НоваяГруппаИнфоКолонок           = Элементы.Добавить("ТаблицаНоменклатурыГруппаИнформации"+ИдентификаторТипаЦен, Тип("ГруппаФормы"), НоваяГруппаКолонок);
	НоваяГруппаИнфоКолонок.Вид       = ВидГруппыФормы.ГруппаКолонок;
	НоваяГруппаИнфоКолонок.Заголовок = ТипЦен.Наименование;
	НоваяГруппаИнфоКолонок.ОтображатьЗаголовок = Ложь;
	НоваяГруппаИнфоКолонок.Группировка = ГруппировкаКолонок.Вертикальная;
	НоваяГруппаИнфоКолонок.Подсказка = НСтр("ru = 'Тип цен ""'") + ТипЦен.Наименование + """";
	
	НоваяГруппаИнфоКолонокСумма           = Элементы.Добавить("ТаблицаНоменклатурыГруппаИнформацииСумма"+ИдентификаторТипаЦен, Тип("ГруппаФормы"), НоваяГруппаКолонок);
	НоваяГруппаИнфоКолонокСумма.Вид       = ВидГруппыФормы.ГруппаКолонок;
	НоваяГруппаИнфоКолонокСумма.Заголовок = ТипЦен.Наименование;
	НоваяГруппаИнфоКолонокСумма.ОтображатьЗаголовок = Ложь;
	НоваяГруппаИнфоКолонокСумма.Группировка = ГруппировкаКолонок.Вертикальная;
	НоваяГруппаИнфоКолонокСумма.Подсказка = НСтр("ru = 'Тип цен ""'") + ТипЦен.Наименование + """";
	
	Если ДобавлятьРеквизит Тогда
		МассивРеквизитов = Новый Массив;
		НовыйРеквизит = Новый РеквизитФормы("ПроцентНаценки"+ИдентификаторТипаЦен, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3, ДопустимыйЗнак.Неотрицательный)), "ТаблицаНоменклатуры", "% наценки");
		МассивРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("МинимальнаяНаценка"+ИдентификаторТипаЦен, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3, ДопустимыйЗнак.Неотрицательный)), "ТаблицаНоменклатуры", "% мин. наценки");
		МассивРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ТекущийПроцентНаценки"+ИдентификаторТипаЦен, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3, ДопустимыйЗнак.Неотрицательный)), "ТаблицаНоменклатуры", "Текущий % наценки");
		МассивРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("Разница"+ИдентификаторТипаЦен, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 3)), "ТаблицаНоменклатуры", "Разница");
		МассивРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("СуммаНаценки"+ИдентификаторТипаЦен, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Неотрицательный)), "ТаблицаНоменклатуры", "Сумма наценки");
		МассивРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("ТекущаяСуммаНаценки"+ИдентификаторТипаЦен, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Неотрицательный)), "ТаблицаНоменклатуры", "Текущая сумма наценки");
		МассивРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("РазницаСумма"+ИдентификаторТипаЦен, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2)), "ТаблицаНоменклатуры", "Разница суммы");
		МассивРеквизитов.Добавить(НовыйРеквизит);
		НовыйРеквизит = Новый РеквизитФормы("Цена"+ИдентификаторТипаЦен, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)), "ТаблицаНоменклатуры", НСтр("ru = 'Цена'"));
		МассивРеквизитов.Добавить(НовыйРеквизит);
		
		ЭтотОбъект.ИзменитьРеквизиты(МассивРеквизитов);
	КонецЕсли;
	
	НоваяКолонка = ДобавитьКолонкуТипаЦен("ПроцентНаценки"+ИдентификаторТипаЦен, НоваяГруппаКолонок);
	НоваяКолонка.Видимость      = Истина;
	НоваяКолонка.ТолькоПросмотр = Ложь;
	НоваяКолонка.Подсказка      = НСтр("ru = 'Процент наценки'");
	НоваяКолонка.УстановитьДействие("ПриИзменении", "Подключаемый_ТаблицаНоменклатурыПроцентНаценкиПриИзменении");
	
	Если ВидимостьКолонок.Количество() = 1 И ВидимостьКолонок[0].Значение = "ПроцентНаценки" Тогда
		НоваяКолонка.ОтображатьВШапке = Ложь;
	Иначе
		НоваяКолонка.ОтображатьВШапке = Истина;
	КонецЕсли;
	
	НоваяКолонка = ДобавитьКолонкуТипаЦен("МинимальнаяНаценка"+ИдентификаторТипаЦен, НоваяГруппаКолонок);
	НоваяКолонка.Видимость      = Истина;
	НоваяКолонка.ТолькоПросмотр = Ложь;
	НоваяКолонка.Подсказка      = НСтр("ru = 'Минимальная наценка'");
	
	Если ВидимостьКолонок.Количество() = 1 И ВидимостьКолонок[0].Значение = "МинимальнаяНаценка" Тогда
		НоваяКолонка.ОтображатьВШапке = Ложь;
	Иначе
		НоваяКолонка.ОтображатьВШапке = Истина;
	КонецЕсли;
	
	НоваяКолонка = ДобавитьКолонкуТипаЦен("СуммаНаценки"+ИдентификаторТипаЦен, НоваяГруппаКолонок);
	НоваяКолонка.Видимость      = Истина;
	НоваяКолонка.ТолькоПросмотр = Ложь;
	НоваяКолонка.Подсказка      = НСтр("ru = 'Сумма наценки'");
	НоваяКолонка.УстановитьДействие("ПриИзменении", "Подключаемый_ТаблицаНоменклатурыСуммаНаценкиПриИзменении");
	
	Если ВидимостьКолонок.Количество() = 1 И ВидимостьКолонок[0].Значение = "СуммаНаценки" Тогда
		НоваяКолонка.ОтображатьВШапке = Ложь;
	Иначе
		НоваяКолонка.ОтображатьВШапке = Истина;
	КонецЕсли;
	
	НоваяКолонка = ДобавитьКолонкуТипаЦен("ТекущийПроцентНаценки"+ИдентификаторТипаЦен, НоваяГруппаИнфоКолонок);
	НоваяКолонка.ТолькоПросмотр = Истина;
	НоваяКолонка.Подсказка = НСтр("ru = 'Текущий процент наценки'");
	
	НоваяКолонка = ДобавитьКолонкуТипаЦен("Разница"+ИдентификаторТипаЦен, НоваяГруппаИнфоКолонок);
	НоваяКолонка.ТолькоПросмотр = Ложь;
	НоваяКолонка.Подсказка = НСтр("ru = 'Разница'");
	НоваяКолонка.ПропускатьПриВводе = Истина;
	НоваяКолонка.УстановитьДействие("ПриИзменении", "Подключаемый_ТаблицаНоменклатурыРазницаПриИзменении");
	
	НоваяКолонка = ДобавитьКолонкуТипаЦен("ТекущаяСуммаНаценки"+ИдентификаторТипаЦен, НоваяГруппаИнфоКолонокСумма);
	НоваяКолонка.ТолькоПросмотр = Истина;
	НоваяКолонка.Подсказка = НСтр("ru = 'Текущая сумма наценки'");
	
	НоваяКолонка = ДобавитьКолонкуТипаЦен("РазницаСумма"+ИдентификаторТипаЦен, НоваяГруппаИнфоКолонокСумма);
	НоваяКолонка.ТолькоПросмотр = Ложь;
	НоваяКолонка.Подсказка = НСтр("ru = 'Разница суммы'");
	НоваяКолонка.ПропускатьПриВводе = Истина;
	НоваяКолонка.УстановитьДействие("ПриИзменении", "Подключаемый_ТаблицаНоменклатурыРазницаСуммаПриИзменении");
	
	НоваяКолонка = ДобавитьКолонкуТипаЦен("Цена"+ИдентификаторТипаЦен, НоваяГруппаИнфоКолонок);
	НоваяКолонка.ТолькоПросмотр = Истина;
	НоваяКолонка.Подсказка = НСтр("ru = 'Цена'");
	
КонецПроцедуры // СоздатьКолонкуТипаЦен()

// Процедура установки реквизитов цен для "Таблица номенклатуры" по настроенной видимости колонок.
//
&НаСервере
Процедура УстановитьВидимостьРеквизитовЦен()
	
	ВидимостьТекущийПроцентНаценки = (НЕ ВидимостьКолонок.НайтиПоЗначению("ТекущийПроцентНаценки") = Неопределено);
	ВидимостьРазница               = (НЕ ВидимостьКолонок.НайтиПоЗначению("Разница") = Неопределено);
	ВидимостьЦена                  = (НЕ ВидимостьКолонок.НайтиПоЗначению("Цена") = Неопределено);
	ВидимостьМинимальнаяНаценка    = (НЕ ВидимостьКолонок.НайтиПоЗначению("МинимальнаяНаценка") = Неопределено);
	
	ВидимостьНаценкаСуммой				= (НЕ ВидимостьКолонок.НайтиПоЗначению("НаценкаСуммой") = Неопределено);
	ВидимостьТекущаяСуммаНаценкиНаценки = ВидимостьТекущийПроцентНаценки И ВидимостьНаценкаСуммой;
	ВидимостьРазницаСумма               = ВидимостьРазница И ВидимостьНаценкаСуммой;
	
	ВыводитьТолькоПроцентНаценки = ВидимостьКолонок.Количество() = 1 И ВидимостьКолонок[0].Значение = "ПроцентНаценки";
	
	// Обновим видимость колонок типов цен
	Для Каждого ТекущаяСтрока Из ТипыЦен Цикл
		
		ИмяКолонки = ТекущаяСтрока.ИмяКолонки;
		
		Элементы["ТаблицаНоменклатурыТекущийПроцентНаценки"+ИмяКолонки].Видимость = ВидимостьТекущийПроцентНаценки;
		Элементы["ТаблицаНоменклатурыРазница"+ИмяКолонки].Видимость               = ВидимостьРазница;
		Элементы["ТаблицаНоменклатурыЦена"+ИмяКолонки].Видимость                  = ВидимостьЦена;
		Элементы["ТаблицаНоменклатурыПроцентНаценки"+ИмяКолонки].Видимость        = Истина;
		Элементы["ТаблицаНоменклатурыПроцентНаценки"+ИмяКолонки].ОтображатьВШапке = (НЕ ВыводитьТолькоПроцентНаценки);
		
		Элементы["ТаблицаНоменклатурыМинимальнаяНаценка"+ИмяКолонки].Видимость        = ВидимостьМинимальнаяНаценка;
		Элементы["ТаблицаНоменклатурыМинимальнаяНаценка"+ИмяКолонки].ОтображатьВШапке = ВидимостьМинимальнаяНаценка;
		
		Элементы["ТаблицаНоменклатурыТекущаяСуммаНаценки"+ИмяКолонки].Видимость   = ВидимостьТекущаяСуммаНаценкиНаценки;
		Элементы["ТаблицаНоменклатурыРазницаСумма"+ИмяКолонки].Видимость          = ВидимостьРазницаСумма;
		Элементы["ТаблицаНоменклатурыСуммаНаценки"+ИмяКолонки].Видимость          = ВидимостьНаценкаСуммой;
		Элементы["ТаблицаНоменклатурыСуммаНаценки"+ИмяКолонки].ОтображатьВШапке   = ВидимостьНаценкаСуммой;
	КонецЦикла;
	
КонецПроцедуры // УстановитьВидимостьРеквизитовЦен()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияИзмененияНастроекТиповЦенНаСервере(РезультатОповещения, ДополнительныеПараметры)
	
	УправлениеДиалогомНаСервере();
	
	НовыйСписокЦен = РезультатОповещения;
	
	ИзменилсяСоставТиповЦен = (НЕ НовыйСписокЦен.Количество() = ТипыЦен.Количество());
	
	Если НЕ ИзменилсяСоставТиповЦен Тогда
		
		Для Индекс = 0 По ТипыЦен.Количество() - 1 Цикл
			Если НЕ НовыйСписокЦен[Индекс].Значение = ТипыЦен[Индекс].ТипЦен Тогда
				ИзменилсяСоставТиповЦен = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ИзменилсяСоставТиповЦен Тогда
			
			ВидимостьТекущийПроцентНаценки = (НЕ ВидимостьКолонок.НайтиПоЗначению("ТекущийПроцентНаценки") = Неопределено);
			ВидимостьРазница               = (НЕ ВидимостьКолонок.НайтиПоЗначению("Разница") = Неопределено);
			ВидимостьЦена                  = (НЕ ВидимостьКолонок.НайтиПоЗначению("Цена") = Неопределено);
			
			ВидимостьМинимальнаяНаценка    = (НЕ ВидимостьКолонок.НайтиПоЗначению("МинимальнаяНаценка") = Неопределено);
			
			ВидимостьНаценкаСуммой				= (НЕ ВидимостьКолонок.НайтиПоЗначению("НаценкаСуммой") = Неопределено);
			ВидимостьТекущаяСуммаНаценкиНаценки = ВидимостьТекущийПроцентНаценки И ВидимостьНаценкаСуммой;
			ВидимостьРазницаСумма               = ВидимостьРазница И ВидимостьНаценкаСуммой;
			
			// Обновим видимость колонок типов цен
			Для Каждого ТекущаяСтрока Из ТипыЦен Цикл
				Элементы["ТаблицаНоменклатурыТекущийПроцентНаценки"+ТекущаяСтрока.ИмяКолонки].Видимость = ВидимостьТекущийПроцентНаценки;
				Элементы["ТаблицаНоменклатурыРазница"+ТекущаяСтрока.ИмяКолонки].Видимость                     = ВидимостьРазница;
				Элементы["ТаблицаНоменклатурыЦена"+ТекущаяСтрока.ИмяКолонки].Видимость                        = ВидимостьЦена;
				
				Элементы["ТаблицаНоменклатурыТекущаяСуммаНаценки"+ТекущаяСтрока.ИмяКолонки].Видимость         = ВидимостьТекущаяСуммаНаценкиНаценки;
				Элементы["ТаблицаНоменклатурыРазницаСумма"+ТекущаяСтрока.ИмяКолонки].Видимость                = ВидимостьРазницаСумма;
				
				Элементы["ТаблицаНоменклатурыСуммаНаценки"+ТекущаяСтрока.ИмяКолонки].Видимость          = ВидимостьНаценкаСуммой;
				Элементы["ТаблицаНоменклатурыСуммаНаценки"+ТекущаяСтрока.ИмяКолонки].ОтображатьВШапке   = ВидимостьНаценкаСуммой;
				
				Элементы["ТаблицаНоменклатурыМинимальнаяНаценка"+ТекущаяСтрока.ИмяКолонки].Видимость          = ВидимостьМинимальнаяНаценка;
				Элементы["ТаблицаНоменклатурыМинимальнаяНаценка"+ТекущаяСтрока.ИмяКолонки].ОтображатьВШапке   = ВидимостьМинимальнаяНаценка;
			КонецЦикла;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СтарыеТипыЦен = Новый Массив;
	
	УдаляемыеРеквизиты = Новый Массив;
	Для Каждого ТекущаяСтрока Из ТипыЦен Цикл
		
		ИмяКолонки = ТекущаяСтрока.ИмяКолонки;
		
		Если НовыйСписокЦен.НайтиПоЗначению(ТекущаяСтрока.ТипЦен) = Неопределено Тогда
			УдаляемыеРеквизиты.Добавить("ТаблицаНоменклатуры.ТекущийПроцентНаценки"+ИмяКолонки);
			УдаляемыеРеквизиты.Добавить("ТаблицаНоменклатуры.ПроцентНаценки"+ИмяКолонки);
			УдаляемыеРеквизиты.Добавить("ТаблицаНоменклатуры.Разница"+ИмяКолонки);
			УдаляемыеРеквизиты.Добавить("ТаблицаНоменклатуры.Цена"+ИмяКолонки);
			
			УдаляемыеРеквизиты.Добавить("ТаблицаНоменклатуры.ТекущаяСуммаНаценки"+ИмяКолонки);
			УдаляемыеРеквизиты.Добавить("ТаблицаНоменклатуры.СуммаНаценки"+ИмяКолонки);
			УдаляемыеРеквизиты.Добавить("ТаблицаНоменклатуры.РазницаСумма"+ИмяКолонки);
			
			УдаляемыеРеквизиты.Добавить("ТаблицаНоменклатуры.МинимальнаяНаценка"+ИмяКолонки);
			
			СтарыеТипыЦен.Добавить(ТекущаяСтрока);
		КонецЕсли;
		
		ИмяГруппыТипаЦен = "ТаблицаНоменклатурыГруппа"+ИмяКолонки;
		
		Если НЕ Элементы.Найти(ИмяГруппыТипаЦен) = Неопределено Тогда
			Элементы.Удалить(Элементы[ИмяГруппыТипаЦен]);
		КонецЕсли;
	
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из СтарыеТипыЦен Цикл
		ТипыЦен.Удалить(ТекущаяСтрока);
	КонецЦикла;
	
	ЭтотОбъект.ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	
	Для Каждого ТекущаяСтрока Из НовыйСписокЦен Цикл
		
		НайденныеСтроки = ТипыЦен.НайтиСтроки(Новый Структура("ТипЦен", ТекущаяСтрока.Значение));
		Если НайденныеСтроки.Количество() = 0 Тогда
			ИдентификаторТипа = СтрЗаменить(ТекущаяСтрока.Значение.УникальныйИдентификатор(),"-","_");
			НоваяСтрока = ТипыЦен.Добавить();
			НоваяСтрока.ТипЦен        = ТекущаяСтрока.Значение;
			НоваяСтрока.ИмяКолонки    = ИдентификаторТипа;
			НоваяСтрока.Представление = ТекущаяСтрока.Значение.Наименование;
			
			СоздатьКолонкуТипаЦен(ТекущаяСтрока.Значение, ИдентификаторТипа);
			
			ОбновитьТекущиеНаценки(, НоваяСтрока);
			ОбновитьЦены(, НоваяСтрока);
		Иначе
			НайденнаяСтрока = НайденныеСтроки[0];
			
			СоздатьКолонкуТипаЦен(НайденнаяСтрока.ТипЦен, НайденнаяСтрока.ИмяКолонки, Ложь);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияИзмененияНастроекТиповЦенНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаОповещенияИзмененияНастроекТиповЦен(РезультатОповещения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатОповещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидимостьКолонок.Очистить();
	ВидимостьКолонок.ЗагрузитьЗначения(РезультатОповещения.РезультатКолонки);
	ЭтотОбъект.СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	
	ОбработкаРезультатаОповещенияИзмененияНастроекТиповЦенНаСервере(РезультатОповещения.ТекущийСписокТипЦен, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРезультатаОповещенияИзмененияНастроекТиповЦен()

// процедура заполнения реквизитов формы данными объекта
//
&НаСервере
Процедура ЗаполнениеДаннымиПоДокументу()
	
	//Если ВидимостьКолонок.Количество() > 0 Тогда
	//	// Данные формы уже сформированы
	//	Возврат;
	//КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		НайденныйТипЦен = ТипыЦен.НайтиСтроки(Новый Структура("ТипЦен", ТекущаяСтрока.ТипЦен));
		Если НайденныйТипЦен.Количество() = 0 Тогда
			ИдентификаторТипа = СтрЗаменить(ТекущаяСтрока.ТипЦен.УникальныйИдентификатор(),"-","_");
			НоваяСтрока = ТипыЦен.Добавить();
			НоваяСтрока.ТипЦен        = ТекущаяСтрока.ТипЦен;
			НоваяСтрока.ИмяКолонки    = ИдентификаторТипа;
			НоваяСтрока.Представление = ТекущаяСтрока.ТипЦен.Наименование;
			
			СоздатьКолонкуТипаЦен(ТекущаяСтрока.ТипЦен, ИдентификаторТипа);
		КонецЕсли
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		
		// найдем строку для данной номенклатуры
		СтрокаНоменклатуры = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("Номенклатура", ТекущаяСтрока.Номенклатура));
		Если СтрокаНоменклатуры.Количество() = 0 Тогда
			СтрокаНоменклатуры = ТаблицаНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНоменклатуры, ТекущаяСтрока);
			//СтрокаНоменклатуры.ИдентификаторСтроки = Новый УникальныйИдентификатор;
			СтрокаНоменклатуры.НомерСтроки = ТаблицаНоменклатуры.Количество();
		Иначе
			СтрокаНоменклатуры = СтрокаНоменклатуры[0];
		КонецЕсли;
		
		Для Каждого ТекущийТипЦен из ТипыЦен Цикл
			Если ТекущаяСтрока.ТипЦен = ТекущийТипЦен.ТипЦен Тогда
				СтрокаНоменклатуры["ПроцентНаценки"+ТекущийТипцен.ИмяКолонки] = ТекущаяСтрока.ПроцентНаценки;
				СтрокаНоменклатуры["СуммаНаценки"+ТекущийТипцен.ИмяКолонки] = ТекущаяСтрока.СуммаНаценки;
				СтрокаНоменклатуры["МинимальнаяНаценка"+ТекущийТипцен.ИмяКолонки] = ТекущаяСтрока.МинимальнаяНаценка;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнениеДаннымиПоДокументу()

// Обработчик результата при перемещении строк в таблице номенклатур
//
&НаСервере
Процедура ПеремещениеСтрокиНоменклатуры(Смещение)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = ТаблицаНоменклатуры.НайтиПоИдентификатору(Элементы.ТаблицаНоменклатуры.ТекущаяСтрока);
	
	ИндексСтроки = ТекущиеДанные.НомерСтроки - 1;
	Если (ИндексСтроки = ТаблицаНоменклатуры.Количество() - 1 И Смещение = 1) ИЛИ (ИндексСтроки = 0 И Смещение = -1) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаНоменклатуры.Сдвинуть(ИндексСтроки, Смещение);
	
КонецПроцедуры // ПеремещениеСтрокиНоменклатуры()

// Процедура сортировки таблицы номенклатуры
//
&НаСервере
Процедура СортировкаТаблицыНоменклатуры(УсловиеСортировки)
	
	ТаблицаНоменклатуры.Сортировать(УсловиеСортировки);
	
КонецПроцедуры

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаОповещенияПроцентНаценкиИзНоменклатуры(РезультатОповещения, ДополнительныеПараметры) Экспорт
	
//	ИзменениеПараметровРасчетаТипаЦены(ДополнительныеПараметры.ПараметрыРасчетаТипаЦен, ?(РезультатОповещения = КодВозвратаДиалога.Да, Истина, Ложь));
	
КонецПроцедуры // ОбработкаРезультатаОповещенияПроцентНаценкиИзНоменклатуры()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияПодбораНоменклатурыНаСервере(РезультатОповещения, ДополнительныеПараметры = Неопределено)
	
	// Получим параметры выполнения подбора
	ПодобраннаяНоменклатура = ПолучитьИзВременногоХранилища(РезультатОповещения.Корзина);
	
	ТекущаяСтрока = ?(ТаблицаНоменклатуры.Количество() = 0, -1, Элементы.ТаблицаНоменклатуры.ТекущаяСтрока);
	
	// Производим перенос подобранной номенклатуры в табличную часть объекта
	Для Каждого СтрокаТоваров Из ПодобраннаяНоменклатура Цикл
		
		ПараметрыОтбора = Новый Структура("Номенклатура");
		
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаТоваров);
		НайденныеСтроки = ТаблицаНоменклатуры.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество()=0 Тогда
			
			// Добавим новую строку и заполним ее
			СтрокаТабличнойЧасти = ТаблицаНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТоваров);
			
			//СтрокаТабличнойЧасти.ИдентификаторСтроки = Новый УникальныйИдентификатор;
			СтрокаТабличнойЧасти.НомерСтроки = ТаблицаНоменклатуры.Количество();
			Элементы.ТаблицаНоменклатуры.ТекущаяСтрока = СтрокаТабличнойЧасти.ПолучитьИдентификатор();
			ТаблицаНоменклатурыНоменклатураПриИзмененииНаСервере();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаНоменклатуры.Количество() > 0 Тогда
		Элементы.ТаблицаНоменклатуры.ТекущаяСтрока = ?(ТекущаяСтрока = -1, ТаблицаНоменклатуры[0].ПолучитьИдентификатор(), ТекущаяСтрока);
	КонецЕсли;
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияПодбораНоменклатуры()

// Процедура формирования данных табличной части "Товары" документа
//
&НаКлиенте
Процедура ЗаполнитьЦеныТоваров()
	
	Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
		
		Для Каждого ТекущийТипЦен Из ТипыЦен Цикл
			НоваяСтрока = Объект.Товары.Добавить();
			НоваяСтрока.ТипЦен         = ТекущийТипЦен.ТипЦен;
			НоваяСтрока.Номенклатура   = ТекущаяСтрока.Номенклатура;
			НоваяСтрока.ПроцентНаценки = ТекущаяСтрока["ПроцентНаценки" + ТекущийТипЦен.ИмяКолонки];
			НоваяСтрока.СуммаНаценки = ТекущаяСтрока["СуммаНаценки" + ТекущийТипЦен.ИмяКолонки];
			НоваяСтрока.МинимальнаяНаценка = ТекущаяСтрока["МинимальнаяНаценка" + ТекущийТипЦен.ИмяКолонки];
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьЦеныТоваров()


// Процедура выделения текущего типа цен при активизации соответствующей ячейки в таблице "Номенклатуры".
//
&НаКлиенте
Процедура УстановкаПоложенияТекущегоТипаЦен()
	
	//Если Элементы.ТаблицаНоменклатуры.ТекущийЭлемент = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ИмяЭлемента = Элементы.ТаблицаНоменклатуры.ТекущийЭлемент.Имя;
	//
	//ТекущиеДанные = Элементы.ТаблицаНоменклатуры.ТекущиеДанные;
	//
	//Если НЕ ТекущиеДанные = Неопределено Тогда
	//	
	//	ИдентификаторНоменклатуры = ТекущиеДанные.ИдентификаторСтроки;
	//	
	//	Если СтрНайти(ИмяЭлемента, "Цена") > 0 ИЛИ СтрНайти(ИмяЭлемента, "Наценки") > 0 Тогда
	//		Для Каждого ТекущаяСтрокаТипаЦен Из ТипыЦен Цикл
	//			Если ТекущаяСтрокаТипаЦен.ИдентификаторСтроки = ИдентификаторНоменклатуры И СтрНайти(ИмяЭлемента, СтрЗаменить(ТекущаяСтрокаТипаЦен.ТипЦен.УникальныйИдентификатор(),"-","_")) И НЕ ТекущаяСтрокаТипаЦен.Рассчитывается Тогда
	//				Элементы.ТаблицаТипыЦен.ТекущаяСтрока = ТекущаяСтрокаТипаЦен.ПолучитьИдентификатор();
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//ТекущиеДанныеТипаЦен = Элементы.ТаблицаТипыЦен.ТекущиеДанные;
	//Если ТекущиеДанныеТипаЦен <> Неопределено Тогда
	//	Элементы.ТаблицаНоменклатурыПересчитатьЦенуТипаЦены.Заголовок = НСтр("ru = 'Для типа цен ""'")+ ТекущиеДанныеТипаЦен.ТипЦен + """";
	//КонецЕсли;
	
КонецПроцедуры // УстановкаПоложенияТекущегоТипаЦен()

// Процедура выделения текущей ячейки в таблице "Номенклатуры" по текущей строке типа цен.
//
&НаКлиенте
Процедура УстановкаПоложенияТекущегоТипаЦенНоменклатуры()
	
	//ТекущиеДанные = Элементы.ТаблицаТипыЦен.ТекущиеДанные;
	//Если ТекущиеДанные <> Неопределено И ЭтотОбъект.ТекущийЭлемент.Имя = "ТаблицаТипыЦен" Тогда
	//	Элементы.ТаблицаНоменклатуры.ТекущийЭлемент = Элементы["ТаблицаНоменклатурыЦенаНовая"+СтрЗаменить(ТекущиеДанные.ТипЦен.УникальныйИдентификатор(),"-","_")];
	//КонецЕсли;
	
КонецПроцедуры // УстановкаПоложенияТекущегоТипаЦенНоменклатуры()


// Процедура заполнения табличной части товарами
//
&НаСервере
Процедура ЗаполнитьТаблицуТоварами(ТаблицаТоваров)
	
	Если ТаблицаТоваров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = ?(ТаблицаНоменклатуры.Количество() = 0, -1, Элементы.ТаблицаНоменклатуры.ТекущаяСтрока);
	
	Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		//НоваяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
		НоваяСтрока.НомерСтроки = ТаблицаНоменклатуры.Количество();
		Элементы.ТаблицаНоменклатуры.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		ТаблицаНоменклатурыНоменклатураПриИзмененииНаСервере();
	КонецЦикла;
	
	Если ТаблицаНоменклатуры.Количество() > 0 Тогда
		Элементы.ТаблицаНоменклатуры.ТекущаяСтрока = ?(ТекущаяСтрока = -1, ТаблицаНоменклатуры[0].ПолучитьИдентификатор(), ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьТаблицуТоварами()

//// Процедура дозаполнения таблицы ПараметрыРасчета не сохраняемыми реквизитами.
////
//&НаСервере
//Процедура ЗаполнитьТаблицуПараметрыРасчета()
//	
//	Запрос Новый 
//	
//	//Для Каждого Строка Из Объект.Товары Цикл
//	//	Строка.Рассчитывается        = Строка.ТипЦен.Рассчитывается;
//	//	Строка.ВВалютеУчета          = Строка.ТипЦен.ВВалютеУчета;
//	//	Строка.ВалютаЦены            = Строка.ТипЦен.ВалютаЦены;
//	//	Строка.АлгоритмПолученияЦены = Строка.ТипЦен.АлгоритмПолученияЦены;
//	//КонецЦикла;
//	
//КонецПроцедуры // ЗаполнитьТаблицуПараметрыРасчета()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаОповещенияТребуетсяУстановкаДатыНачала(РезультатОповещения, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
		Объект.ДатаНачалаДействия = Объект.Дата;
		ДатаНачалаДействияПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияТребуетсяУстановкаДатыНачала()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
	// RadV
	//ВидыНоменклатуры = Справочники.ХозОперации.ПолучитьВидыНоменклатуры(Объект.ХозОперация);
	//Если Не Элементы.Найти("ТаблицаНоменклатурыНоменклатура")=Неопределено Тогда
	//	УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.ТаблицаНоменклатурыНоменклатура.ПараметрыВыбора, "Отбор.ВидНоменклатуры", ВидыНоменклатуры);
	//КонецЕсли;
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	Элементы.ТаблицаНоменклатурыНоменклатура.ОтметкаНезаполненного     = Истина;
	Элементы.ТаблицаНоменклатурыНоменклатура.АвтоОтметкаНезаполненного = Истина;
	
	ЗаголовокТовары = ТаблицаНоменклатуры.Количество();
	
	Элементы.ТаблицаНоменклатурыПереместитьВверх.Доступность         = ЗаголовокТовары > 0;
	Элементы.ТаблицаНоменклатурыПереместитьВниз.Доступность          = ЗаголовокТовары > 0;
	Элементы.ТаблицаНоменклатурыСортироватьПоВозрастанию.Доступность = ЗаголовокТовары > 0;
	Элементы.ТаблицаНоменклатурыСортироватьПоУбыванию.Доступность    = ЗаголовокТовары > 0;
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Настройка условного оформления формы
//
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	Если ЛЕВ(Команда.Имя, 17)="КомандаЗаполнения" Тогда
		// заполним ТЧ актуальными данными
		Объект.Товары.Очистить();
		ЗаполнитьЦеныТоваров();
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	Если ЛЕВ(ДополнительныеПараметры, 17)="КомандаЗаполнения" Тогда
		
		Если Тип(РезультатОповещения) = Тип("Структура")
			 И РезультатОповещения.Свойство("ПараметрыЗаполнения")
			 И РезультатОповещения.ПараметрыЗаполнения.Свойство("ОчиститьТабличнуюЧасть")
			 И РезультатОповещения.ПараметрыЗаполнения.ОчиститьТабличнуюЧасть Тогда
			ТаблицаНоменклатуры.Очистить();
			ТипыЦен.Очистить();
		КонецЕсли;
		
		ТаблицаТоваров = Неопределено;
		
		//Если ДополнительныеПараметры = "КомандаЗаполненияТоварыЗаполнитьСкладскимиОстатками" Тогда
		//	ТаблицаТоваров = ЗаполнениеДокументовСервер.ПолучитьСкладскиеОстатки(Объект, РезультатОповещения.ПараметрыЗаполнения);
		//ИначеЕсли ДополнительныеПараметры = "КомандаЗаполненияТоварыЗаполнитьПоДокументу" Тогда
		//	ДокументЗаполнения = РезультатОповещения.ПараметрыЗаполнения.ЗаполнитьПоДокументуВыборСсылки;
		//	Если ЕстьРеквизит(ДокументЗаполнения,, "Товары") Тогда
		//		ТаблицаТоваров = ДокументЗаполнения.Товары.Выгрузить();
		//	КонецЕсли;
		//ИначеЕсли ДополнительныеПараметры = "КомандаЗаполненияТоварыЗагрузитьИзФайла" Тогда
		//	// Получим параметры работы
		//	АдресТаблицаЗагрузкаИЗФайлаВХранилище = РезультатОповещения.АдресТаблицаЗагрузкаИЗФайлаВХранилище;
		//	
		//	// Производим заполнение таблицы объекта
		//	Если ЗначениеЗаполнено(АдресТаблицаЗагрузкаИЗФайлаВХранилище) Тогда
		//		ТаблицаТоваров = ПолучитьИзВременногоХранилища(АдресТаблицаЗагрузкаИЗФайлаВХранилище);
		//	КонецЕсли;
		//ИначеЕсли ДополнительныеПараметры = "КомандаЗаполненияТоварыЗаполнитьНоменклатуройПоЦеновойГруппе" Тогда
		//	ЦеноваяГруппа = РезультатОповещения.ПараметрыЗаполнения.ЦеноваяГруппа;
		//	ТаблицаТоваров = Документы.ИзменениеРекомендуемыхНаценок.ЗаполнитьПоЦеновойГруппе(Объект,ЦеноваяГруппа);
		//КонецЕсли;
		
		//ЗаполнитьТаблицуТоварами(ТаблицаТоваров);
	ИначеЕсли ДополнительныеПараметры = "РазрешенияДляПересчета" И РезультатОповещения.Свойство("ТребуетсяУстановкаЦен") И РезультатОповещения.ТребуетсяУстановкаЦен Тогда
		РезультатОповещения.ТребуетсяУстановкаЦен = Ложь;
		//Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
		//	ПолучениеСтаройБазовойЦены(ТекущаяСтрока.ИдентификаторСтроки);
		//КонецЦикла;
	Иначе
		// Вызываем общий обработчик события
		Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//Если ДополнительныеПараметры="ПараметрыДокумента" И Тип(РезультатОповещения) = Тип("Структура") И РезультатОповещения.Свойство("ИзмененныеРеквизиты") И РезультатОповещения.ИзмененныеРеквизиты.Свойство("ДокументОснование") Тогда
	//	// Найдем типы цен, которые рассчитываются от документа основания и перезаполним базовые цены.
	//	НайденныеТипыЦен = Объект.ПараметрыРасчета.НайтиСтроки(Новый Структура("РасчетЦенОт", 1));
	//	
	//	Для Каждого ТекущаяСтрока Из НайденныеТипыЦен Цикл
	//		
	//		// Найдем описанные типы цен
	//		НайденныеСтроки = ТаблицаТипыЦен.НайтиСтроки(Новый Структура("ТипЦен,Рассчитывается", ТекущаяСтрока.ТипЦен, Ложь));
	//		
	//		//Для Каждого ТекущийТипЦен Из НайденныеСтроки Цикл
	//		//	ПолучениеСтаройБазовойЦены(ТекущийТипЦен.ИдентификаторСтроки);
	//		//КонецЦикла;
	//		
	//	КонецЦикла;
	//	
	//	//// Пересчет расчетных цен документа
	//	//ПерерасчетРасчетныхЦен();
	//	
	//	УстановитьВидимостьРеквизитовЦен();
	//КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры = "ПодборНоменклатуры" Тогда
		ОбработкаРезультатаОповещенияПодбораНоменклатурыНаСервере(РезультатОповещения);
	Иначе
		// Обработаем событие в контексте сервера
		ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	КонецЕсли;
	
	Если ДополнительныеПараметры="ПараметрыДокумента" Тогда
		
		Если ЗначениеЗаполнено(Объект.ДатаНачалаДействия) И Объект.ДатаНачалаДействия<НачалоДня(Объект.Дата) Тогда
			Объект.ДатаНачалаДействия = Объект.Дата;
			ДатаНачалаДействияПриИзменении(Неопределено);
		Иначе
			Если Тип(РезультатОповещения) = Тип("Структура") И РезультатОповещения.Свойство("ТребуетсяУстановкаДатыНачала") И РезультатОповещения.ТребуетсяУстановкаДатыНачала Тогда
				// Формируем описание обработчика перехвата закрытия формы
				ОбработчикВопроса = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияТребуетсяУстановкаДатыНачала", ЭтотОбъект, "ТребуетсяУстановкаДатыНачала");
				
				// Формируем текст вопроса
				ТекстВопроса = НСтр("ru = 'Дата документа изменена. Сменить дату начала действия цен товаров?'");
				
				// Получаем подтверждение операции от пользователя
				ПоказатьВопрос(ОбработчикВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик команды "Переместить вниз/вверх"
//
&НаКлиенте
Процедура Переместить(Команда)
	
	Если Команда.Имя = "ПереместитьВверх" Тогда
		Смещение = -1;
	Иначе
		Смещение = 1;
	КонецЕсли;
	
	ПеремещениеСтрокиНоменклатуры(Смещение);
	
	// Пересчитаем номер строки
	НомерСтроки = 1;
	Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
		ТекущаяСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры // Переместить()

// Обработчик команды "Сортировать"
//
&НаКлиенте
Процедура Сортировать(Команда)
	
	УсловиеСортировки = "" + СтрЗаменить(Элементы.ТаблицаНоменклатуры.ТекущийЭлемент.Имя, "ТаблицаНоменклатуры", "");
	
	Если Команда.Имя = "СортироватьПоУбыванию" Тогда
		УсловиеСортировки = УсловиеСортировки + " УБЫВ";
	КонецЕсли;
	
	СортировкаТаблицыНоменклатуры(УсловиеСортировки);
	
	// Пересчитаем номер строки
	НомерСтроки = 1;
	Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
		ТекущаяСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры // Сортировать()

// Обработчик команды "Настройка типов цен"
//
&НаКлиенте
Процедура НастройкаТиповЦен(Команда)
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияИзмененияНастроекТиповЦен", ЭтотОбъект);
	
	ВыбранныеТипыЦен = Новый Массив;
	Для Каждого ТекущаяСтрока Из ТипыЦен Цикл
		ВыбранныеТипыЦен.Добавить(ТекущаяСтрока.ТипЦен);
	КонецЦикла;
	
	ОткрытьФорму("Документ.ИзменениеРекомендуемыхНаценок.Форма.ФормаНастройкиТиповЦен", Новый Структура("СписокВидимости, ВыбранныеТипыЦен", ВидимостьКолонок, ВыбранныеТипыЦен), ЭтотОбъект,,,, ОбработкаОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // НастройкаТиповЦен()

// Обработчик события нажатия кнопки "Подбор номенклатуры".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомКлиент.ОткрытьПодборНоменклатуры(ЭтотОбъект);
	
КонецПроцедуры // ПодборНоменклатуры()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаНачалаДействия) И Объект.ДатаНачалаДействия<НачалоДня(Объект.Дата) Тогда
		Объект.ДатаНачалаДействия = Объект.Дата;
		ДатаНачалаДействияПриИзменении(Неопределено);
	Иначе
		// Формируем описание обработчика перехвата закрытия формы
		ОбработчикВопроса = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияТребуетсяУстановкаДатыНачала", ЭтотОбъект, "ТребуетсяУстановкаДатыНачала");
		
		// Формируем текст вопроса
		ТекстВопроса = НСтр("ru = 'Дата документа изменена. Сменить дату начала действия цен товаров?'");
			
		// Получаем подтверждение операции от пользователя
		ПоказатьВопрос(ОбработчикВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
		
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ИзменениеРекомендуемыхНаценок.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	//ПерерасчетРасчетныхЦен();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата начала действия" в контексте сервера.
//
&НаСервере
Процедура ДатаНачалаДействияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	ОбновитьТекущиеНаценки();
	ОбновитьЦены();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаНачалаДействияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата начала действия".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаНачалаДействияПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.ДатаНачалаДействия) И Объект.ДатаНачалаДействия<НачалоДня(Объект.Дата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Дата начала действия, не может быть меньше даты документа.'"));
		Объект.ДатаНачалаДействия = Объект.Дата;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ДатаНачалаДействияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДатаНачалаДействияПриИзменении()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ТАБЛИЦА НОМЕНКЛАТУРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в контексте сервера.
//
&НаСервере
Процедура ТаблицаНоменклатурыНоменклатураПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = ТаблицаНоменклатуры.НайтиПоИдентификатору(Элементы.ТаблицаНоменклатуры.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ИзменениеРекомендуемыхНаценок.ТоварыНоменклатураПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	Если ТекущиеДанные.Номенклатура.ЭтоГруппа Тогда
		ТекущиеДанные.КартинкаСтроки = БиблиотекаКартинок.Папка;
	Иначе
		ТекущиеДанные.КартинкаСтроки = БиблиотекаКартинок.Реквизит;
	КонецЕсли;
	
	//ДобавитьТипыЦенНоменклатуры(ТекущиеДанные.ИдентификаторСтроки);
	
	ОбновитьТекущиеНаценки(ТекущиеДанные);
	ОбновитьЦены(ТекущиеДанные);
	
КонецПроцедуры // ТоварыНоменклатураПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТаблицаНоменклатурыНоменклатураПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТаблицаНоменклатурыНоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Новая цена".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ТаблицаНоменклатурыЦенаНоваяПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	//ТаблицаНоменклатурыЦенаНоваяПриИзмененииНаСервере();
	
КонецПроцедуры // Подключаемый_ТаблицаНоменклатурыЦенаНоваяПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Процент наценки" в контексте сервера.
//
&НаСервере
Процедура ТаблицаНоменклатурыПроцентНаценкиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ИмяКолонки = СтрЗаменить(Элементы.ТаблицаНоменклатуры.ТекущийЭлемент.Имя, "ТаблицаНоменклатурыПроцентНаценки", "");
	ТекущиеДанные = ТаблицаНоменклатуры.НайтиПоИдентификатору(Элементы.ТаблицаНоменклатуры.ТекущаяСтрока);
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные["СуммаНаценки"+ИмяКолонки] = 0;
	КонецЕсли;
	
	НайтиРазницу(ТекущиеДанные, ИмяКолонки);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Процент наценки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ТаблицаНоменклатурыПроцентНаценкиПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТаблицаНоменклатурыПроцентНаценкиПриИзмененииНаСервере();
	
КонецПроцедуры // Подключаемый_ТаблицаНоменклатурыПроцентНаценкиПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Разница" в контексте сервера.
//
&НаСервере
Процедура ТаблицаНоменклатурыРазницаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ИмяКолонки = СтрЗаменить(Элементы.ТаблицаНоменклатуры.ТекущийЭлемент.Имя, "ТаблицаНоменклатурыРазница", "");
	ТекущиеДанные = ТаблицаНоменклатуры.НайтиПоИдентификатору(Элементы.ТаблицаНоменклатуры.ТекущаяСтрока);
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные["ПроцентНаценки"+ИмяКолонки] = ТекущиеДанные["Разница"+ИмяКолонки] + ТекущиеДанные["ТекущийПроцентНаценки"+ИмяКолонки];
	ТекущиеДанные["СуммаНаценки"+ИмяКолонки] = 0;
	НайтиРазницу(ТекущиеДанные, ИмяКолонки);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Разница".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ТаблицаНоменклатурыРазницаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТаблицаНоменклатурыРазницаПриИзмененииНаСервере();
	
КонецПроцедуры // Подключаемый_ТаблицаНоменклатурыРазницаПриИзменении()

#Область СуммаНаценки

// Обработчик события возникающего при изменении данных реквизита "Сумма наценки" в контексте сервера.
//
&НаСервере
Процедура ТаблицаНоменклатурыСуммаНаценкиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ИмяКолонки = СтрЗаменить(Элементы.ТаблицаНоменклатуры.ТекущийЭлемент.Имя, "ТаблицаНоменклатурыСуммаНаценки", "");
	ТекущиеДанные = ТаблицаНоменклатуры.НайтиПоИдентификатору(Элементы.ТаблицаНоменклатуры.ТекущаяСтрока);
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные["ПроцентНаценки"+ИмяКолонки] = 0;
	КонецЕсли;
	
	НайтиРазницу(ТекущиеДанные, ИмяКолонки);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма наценки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ТаблицаНоменклатурыСуммаНаценкиПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТаблицаНоменклатурыСуммаНаценкиПриИзмененииНаСервере();
	
КонецПроцедуры // Подключаемый_ТаблицаНоменклатурыПроцентНаценкиПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Разница" в контексте сервера.
//
&НаСервере
Процедура ТаблицаНоменклатурыРазницаСуммаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ИмяКолонки = СтрЗаменить(Элементы.ТаблицаНоменклатуры.ТекущийЭлемент.Имя, "ТаблицаНоменклатурыРазницаСумма", "");
	ТекущиеДанные = ТаблицаНоменклатуры.НайтиПоИдентификатору(Элементы.ТаблицаНоменклатуры.ТекущаяСтрока);
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные["СуммаНаценки"+ИмяКолонки] = ТекущиеДанные["РазницаСумма"+ИмяКолонки] + ТекущиеДанные["ТекущаяСуммаНаценки"+ИмяКолонки];
	ТекущиеДанные["ПроцентНаценки"+ИмяКолонки] = 0;
	НайтиРазницу(ТекущиеДанные, ИмяКолонки);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Разница".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ТаблицаНоменклатурыРазницаСуммаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТаблицаНоменклатурыРазницаСуммаПриИзмененииНаСервере();
	
КонецПроцедуры // Подключаемый_ТаблицаНоменклатурыРазницаПриИзменении()

#КонецОбласти
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ТАБЛИЦА НОМЕНКЛАТУРЫ"

// Обработчик события возникающего на клиенте при активизации строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТаблицаНоменклатурыПриАктивизацииСтроки(Элемент)
	
	Если ТаблицаНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//ТекущиеДанные = ТаблицаНоменклатуры.НайтиПоИдентификатору(Элементы.ТаблицаНоменклатуры.ТекущаяСтрока);
	//Если НЕ ЭтотОбъект.ТекущийЭлемент.Имя = "ТаблицаТипыЦен" Тогда
	//	Элементы.ТаблицаТипыЦен.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтроки,Рассчитывается", ТекущиеДанные.ИдентификаторСтроки, Ложь);
	//	Элементы.ТаблицаТипыЦен.Обновить();
	//КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при активизации ячейки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТаблицаНоменклатурыПриАктивизацииЯчейки(Элемент)
	
	Если Элемент.ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДоступностьСортировки = НЕ (Элемент.ТекущийЭлемент.Имя = "ТаблицаНоменклатурыКод" ИЛИ Элемент.ТекущийЭлемент.Имя = "ТаблицаНоменклатурыАртикул");
	Элементы.ТаблицаНоменклатурыСортироватьПоВозрастанию.Доступность = ДоступностьСортировки И ТаблицаНоменклатуры.Количество()>0;
	Элементы.ТаблицаНоменклатурыСортироватьПоУбыванию.Доступность    = ДоступностьСортировки И ТаблицаНоменклатуры.Количество()>0;
	
	ПодключитьОбработчикОжидания("УстановкаПоложенияТекущегоТипаЦен", 0.1, Истина);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при начале редактирования строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТаблицаНоменклатурыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ТаблицаНоменклатуры.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока ИЛИ Копирование Тогда
		ТаблицаНоменклатурыПриАктивизацииСтроки(Неопределено);
		ТекущиеДанные.НомерСтроки = ТаблицаНоменклатуры.Количество();
	КонецЕсли;
	
	ЗаголовокТовары = ТаблицаНоменклатуры.Количество();
	
	Элементы.ТаблицаНоменклатурыПереместитьВверх.Доступность         = ЗаголовокТовары > 0;
	Элементы.ТаблицаНоменклатурыПереместитьВниз.Доступность          = ЗаголовокТовары > 0;
	Элементы.ТаблицаНоменклатурыСортироватьПоВозрастанию.Доступность = ЗаголовокТовары > 0;
	Элементы.ТаблицаНоменклатурыСортироватьПоУбыванию.Доступность    = ЗаголовокТовары > 0;
	
КонецПроцедуры // ТаблицаНоменклатурыПриНачалеРедактирования()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТаблицаНоменклатурыПослеУдаления(Элемент)
	
	НомерСтроки = 1;
	
	Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
		ТекущаяСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	ЗаголовокТовары = ТаблицаНоменклатуры.Количество();
	
	Элементы.ТаблицаНоменклатурыПереместитьВверх.Доступность         = ЗаголовокТовары > 0;
	Элементы.ТаблицаНоменклатурыПереместитьВниз.Доступность          = ЗаголовокТовары > 0;
	Элементы.ТаблицаНоменклатурыСортироватьПоВозрастанию.Доступность = ЗаголовокТовары > 0;
	Элементы.ТаблицаНоменклатурыСортироватьПоУбыванию.Доступность    = ЗаголовокТовары > 0;
	
КонецПроцедуры // ТаблицаНоменклатурыПослеУдаления()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеДиалогомДокументаСервер.УстановитьВидимостьКолонокКодАртикул(ЭтотОбъект, "ТаблицаНаценок");
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновляем условное оформление
	УстановитьУсловноеОформление();
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачалаДействия) Тогда
		Объект.ДатаНачалаДействия = Объект.Дата;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Сформируем начальный список типов цен
	Если Объект.Товары.Количество() = 0 Тогда
		ТипЦенПродажи = ПравоПользователя("ОсновнойТипЦенПродажи");
		НайденныеТипыЦен = ТипыЦен.НайтиСтроки(Новый Структура("ТипЦен", ТипЦенПродажи));
		Если НайденныеТипыЦен.Количество() = 0 Тогда
			ИдентификаторТипа = СтрЗаменить(ТипЦенПродажи.УникальныйИдентификатор(),"-","_");
			НоваяСтрока = ТипыЦен.Добавить();
			НоваяСтрока.ТипЦен        = ТипЦенПродажи;
			НоваяСтрока.ИмяКолонки    = ИдентификаторТипа;
			НоваяСтрока.Представление = ТипЦенПродажи.Наименование;
			СоздатьКолонкуТипаЦен(ТипЦенПродажи, ИдентификаторТипа);
		КонецЕсли;
	Иначе
		ЗаполнениеДаннымиПоДокументу();
	КонецЕсли;
	
	ОбновитьТекущиеНаценки();
	ОбновитьЦены();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним реквизиты форм данными с документа
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИзменениеРекомендуемыхНаценок.ТипЦен КАК ТипЦен,
	|	ИзменениеРекомендуемыхНаценок.ТипЦен.Наименование КАК ТипЦенНаименование
	|ИЗ
	|	Документ.ИзменениеРекомендуемыхНаценок.Товары КАК ИзменениеРекомендуемыхНаценок
	|ГДЕ
	|	ИзменениеРекомендуемыхНаценок.Ссылка = &Ссылка
	|";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИдентификаторТипа = СтрЗаменить(Выборка.ТипЦен.УникальныйИдентификатор(),"-","_");
		НоваяСтрока = ТипыЦен.Добавить();
		НоваяСтрока.ТипЦен        = Выборка.ТипЦен;
		НоваяСтрока.ИмяКолонки    = ИдентификаторТипа;
		НоваяСтрока.Представление = Выборка.ТипЦенНаименование;
		СоздатьКолонкуТипаЦен(Выборка.ТипЦен, ИдентификаторТипа);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТипыЦен.ТипЦен КАК ТипЦен,
	|	ТипыЦен.ИмяКолонки КАК ИмяКолонки
	|ПОМЕСТИТЬ
	|	ТипыЦен
	|ИЗ
	|	&ТипыЦен КАК ТипыЦен
	|;
	|
	|ВЫБРАТЬ
	|	ИзменениеРекомендуемыхНаценок.ТипЦен КАК ТипЦен,
	|	ИзменениеРекомендуемыхНаценок.Номенклатура КАК Номенклатура,
	|	ИзменениеРекомендуемыхНаценок.ПроцентНаценки КАК ПроцентНаценки,
	|	ИзменениеРекомендуемыхНаценок.СуммаНаценки КАК СуммаНаценки,
	|	ИзменениеРекомендуемыхНаценок.МинимальнаяНаценка КАК МинимальнаяНаценка,
	|	ТипыЦен.ИмяКолонки
	|ИЗ
	|	ТипыЦен КАК ТипыЦен
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ИзменениеРекомендуемыхНаценок.Товары КАК ИзменениеРекомендуемыхНаценок
	|ПО
	|	ИзменениеРекомендуемыхНаценок.Ссылка = &Ссылка И 
	|	ТипыЦен.ТипЦен = ИзменениеРекомендуемыхНаценок.ТипЦен
	|ГДЕ
	|	ИзменениеРекомендуемыхНаценок.Ссылка = &Ссылка
	|ИТОГИ
	|ПО
	|	Номенклатура
	|";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТипыЦен", ТипыЦен.Выгрузить());
	
	ВыборкаНоменклатура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
		НоваяСтрока = ТаблицаНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура = ВыборкаНоменклатура.Номенклатура;
		Выборка = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока Выборка.Следующий() Цикл
			НоваяСтрока["ПроцентНаценки" + Выборка.ИмяКолонки] = Выборка.ПроцентНаценки;
			НоваяСтрока["СуммаНаценки" + Выборка.ИмяКолонки] = Выборка.СуммаНаценки;
			НоваяСтрока["МинимальнаяНаценка" + Выборка.ИмяКолонки] = Выборка.МинимальнаяНаценка;
		КонецЦикла;
	КонецЦикла;
	
	НомерСтроки = 1;
	Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
		ТекущаяСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
		Если ТекущаяСтрока.Номенклатура.ЭтоГруппа Тогда
			ТекущаяСтрока.КартинкаСтроки = БиблиотекаКартинок.Папка;
		Иначе
			ТекущаяСтрока.КартинкаСтроки = БиблиотекаКартинок.Реквизит;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьТекущиеНаценки();
	
	// Заполнить цены
	ОбновитьЦены();
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	// Сформируем ТЧ Товары
	Объект.Товары.Очистить();
	
	ЗаполнитьЦеныТоваров();
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Проведен Тогда
		Оповестить("ЗаписаныЦены", Объект.Товары);
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Подготовим списки для накопления сведений о дублирующихся строках
	СписокНайденныхДублей = Новый Массив;
	ОбработанныеСтроки    = Новый Соответствие;
	
	// Создадим структуру отбора для проверки уникальности реквизитов
	ПоляПоискаДублей = Новый Структура("Номенклатура");
	
	// Проверим таблицу номенклатуры
	Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
		
		// Обязательные поля
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			ВывестиСообщение(НСтр("ru = 'Не заполнена колонка ""Номенклатура"" в строке %1 таблицы ""Товары""'"), ЭтотОбъект, ТекущаяСтрока, ТекущаяСтрока.НомерСтроки, Отказ, ТекущаяСтрока.НомерСтроки);
		КонецЕсли;
		
		//ЦеныЗаполнены = Ложь;
		//Для Каждого ТекущаяСтрокаЦены Из ТипыЦен Цикл
		//	
		//	Если ЗначениеЗаполнено(ТекущаяСтрока["ПроцентНаценки"+ТекущаяСтрокаЦены.ИмяКолонки]) Тогда
		//		ЦеныЗаполнены = Истина;
		//		Прервать;
		//	КонецЕсли;
		//	
		//КонецЦикла;
		
		//Если НЕ ЦеныЗаполнены Тогда
		//	ВывестиСообщение(НСтр("ru = 'В строке %1 таблицы ""Товары"" не заполнены проценты наценки ни для одного типа цен.'"), ЭтотОбъект, ТекущаяСтрока, ТекущаяСтрока.НомерСтроки, Отказ, ТекущаяСтрока.НомерСтроки);
		//КонецЕсли;
		
		// Уникальность
		
		// Пропустим строки уже попавшие в черный список
		Если НЕ ОбработанныеСтроки.Получить(ТекущаяСтрока)=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Производим поиск строк удовлетворяющих структуре отбора
		ЗаполнитьЗначенияСвойств(ПоляПоискаДублей, ТекущаяСтрока);
		НайденныеСтроки = ТаблицаНоменклатуры.НайтиСтроки(ПоляПоискаДублей);
		
		// Если нашли и их больше 1, то строки не уникальные
		Если НайденныеСтроки.Количество() > 1 Тогда
			
			// Определим номера дублирующихся строк и занесем их в черный список
			НомераСтрокДублей = "";
			Для каждого НайденныйДубль Из НайденныеСтроки Цикл
				НомераСтрокДублей = НомераСтрокДублей + ", " + СокрЛП(НайденныйДубль.НомерСтроки);
				ОбработанныеСтроки.Вставить(НайденныйДубль, ИСТИНА);
			КонецЦикла;
			
			// Запоминаем номера найденных дублей
			СписокНайденныхДублей.Добавить(Сред(НомераСтрокДублей, 3));
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Выводим сведения о найденных дублях по текущему ключу поиска
	Если СписокНайденныхДублей.Количество() > 0 Тогда
		
		// Произведем формирование заголовка сообщения об обнаруженных дублях
		ПредставленияПолей      = "Номенклатура";
		ПредставленияСтрок      = "";
		
		// Получим представление дублирующихся строк
		Для каждого НайденныеДубли Из СписокНайденныхДублей Цикл
			ПредставленияСтрок = ПредставленияСтрок + Символы.ПС + НСтр("ru = 'Строки:" + Символы.НПП + НайденныеДубли + "'");
		КонецЦикла;
		
		// Информируем пользователя о найденной коллизии
		ВывестиСообщение(НСтр("ru = 'Строки таблицы ""%1"" не уникальны по значению полей (%2)%3'"), ЭтотОбъект, "ТаблицаНоменклатуры",, Отказ, "Товары", ПредставленияПолей, ПредставленияСтрок);
		
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Производим сохранение параметров видимости колонок
	Настройки.Вставить("ВидимостьКолонок", ВидимостьКолонок);
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	НастройкаВидимостиКолонок = Настройки.Получить("ВидимостьКолонок");
	
	Если НЕ НастройкаВидимостиКолонок = Неопределено Тогда
		ВидимостьКолонок.ЗагрузитьЗначения(НастройкаВидимостиКолонок.ВыгрузитьЗначения());
	КонецЕсли;
	
	// колонка "Новая цена" всегда устанавливается для вывода
	Если ВидимостьКолонок.НайтиПоЗначению("ПроцентНаценки") = Неопределено Тогда
		ВидимостьКолонок.Добавить("ПроцентНаценки");
	КонецЕсли;
	Если ВидимостьКолонок.НайтиПоЗначению("СуммаНаценки") = Неопределено Тогда
		ВидимостьКолонок.Добавить("СуммаНаценки");
	КонецЕсли;
	Если ВидимостьКолонок.НайтиПоЗначению("МинимальнаяНаценка") = Неопределено Тогда
		ВидимостьКолонок.Добавить("МинимальнаяНаценка");
	КонецЕсли;
	
	УстановитьВидимостьРеквизитовЦен();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура ПоискВТаблицеТовары(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПоискВТаблицеТоварыРезультатОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ПоискВТаблицеТоварыРезультатОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ШтрихКодДляПоиска = РезультатОповещения;
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ПоискПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКоду(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ДобавлениеНовыхПозицийПоШтрихКодуОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКодуОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ДобавлениеНовыхПозицийПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтборВТаблицеТовары(Команда)
	Элементы.Товары.ОтборСтрок = Неопределено;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ШтрихКодДляПоиска = "";
