
#Область ПрограммныйИнтерфейс

 // Возвращает список доступных типов оборудования.
//
// Возвращаемое значение:
//   Массив - Массив доступных типов офлайн подключаемого оборудования в конфигурации
//
Функция ПолучитьДоступныеТипыРарусОборудования() Экспорт
	
	СписокОборудования = Новый Массив;
	СписокОборудования.Добавить(Перечисления.ТипыРарусОборудования.POS);
	
	Возврат СписокОборудования;
	
КонецФункции

Функция ПолучитьИнформациюПоОборудованию(Оборудование) Экспорт
	
	ПараметрыОборудования = Новый Структура;
	ПараметрыОборудования.Вставить("ТипЦен",                Оборудование.ОсновнойОтдел.ТипЦенРозничнойТорговли);
	ПараметрыОборудования.Вставить("ПодразделениеКомпании", Оборудование.ОсновнойОтдел.ПодразделениеКомпании);
	ПараметрыОборудования.Вставить("ГруппаТоваров",         Оборудование.ГруппаТоваровОборудования);
	ПараметрыОборудования.Вставить("ТекущаяДата",           ТекущаяДатаСеанса());
	ПараметрыОборудования.Вставить("ЗалОбслуживания",       Оборудование.ОсновнойОтдел);
	
	Возврат ПараметрыОборудования;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейсСлужебный

// Обработчик регламентного задания УдалениеУстаревшихПараметровРаботыВерсийРасширений.
Процедура УдалениеНеактуальныхТоваровВОборудовании() Экспорт
	
	РегламентноеЗадание = Метаданные.РегламентныеЗадания.ВыгрузкаВВесы;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяМетода", РегламентноеЗадание.ИмяМетода);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	ФоновыеЗаданияОбновлениеВыгрузки = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если ФоновыеЗаданияОбновлениеВыгрузки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	РегламентноеЗадание = Метаданные.РегламентныеЗадания.УдалениеНеактуальныхТоваровВОборудовании;
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.УдалениеНеактуальныхТоваровВОборудовании);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяМетода", РегламентноеЗадание.ИмяМетода);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	ФоновыеЗаданияОбновлениеВыгрузки = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если ФоновыеЗаданияОбновлениеВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодключаемоеОборудование.Ссылка КАК Оборудование,
	|	ПодключаемоеОборудование.ОсновнойОтдел КАК СкладКомпании,
	|	ПодключаемоеОборудование.ОсновнойОтдел.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ГруппыТоваровОборудования.Ссылка КАК ГруппаТоваров
	|ПОМЕСТИТЬ
	|	ГруппыТоваровОборудования
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ГруппыТоваровОборудования КАК ГруппыТоваровОборудования
	|ПО
	|	ПодключаемоеОборудование.ГруппаТоваровОборудования = ГруппыТоваровОборудования.Ссылка
	|ГДЕ
	|	ГруппыТоваровОборудования.АвтоУдаление = ИСТИНА И 
	|	ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток)
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыТоваровОборудования.Оборудование КАК Оборудование,
	|	ГруппыТоваровОборудования.СкладКомпании КАК СкладКомпании,
	|	ГруппыТоваровОборудования.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ГруппыТоваровОборудования.ГруппаТоваров,
	|	ТоварыВОборудовании.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ
	|	ОборудованиеСТоварами
	|ИЗ
	|	ГруппыТоваровОборудования КАК ГруппыТоваровОборудования
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ПО
	|	ТоварыВОборудовании.ГруппаТоваров = ГруппыТоваровОборудования.ГруппаТоваров
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыВОборудовании.СкладКомпании,
	|	ТоварыВОборудовании.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ
	|	ТоварыИСклады
	|ИЗ
	|	ОборудованиеСТоварами КАК ТоварыВОборудовании
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыВОборудовании.ПодразделениеКомпании,
	|	ТоварыВОборудовании.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ
	|	ТоварыИПодразделения
	|ИЗ
	|	ОборудованиеСТоварами КАК ТоварыВОборудовании
	|;
	|
	|ВЫБРАТЬ
	|	ОборудованиеСТоварами.ГруппаТоваров,
	|	ОборудованиеСТоварами.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ
	|	ТоварыСОстатками
	|ИЗ
	|	ОборудованиеСТоварами КАК ОборудованиеСТоварами
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, (СкладКомпании, Номенклатура) В (ВЫБРАТЬ СкладКомпании, Номенклатура ИЗ ТоварыИСклады КАК ТоварыИСклады)) КАК ОстаткиТоваровКомпании
	|ПО
	|	ОборудованиеСТоварами.Номенклатура = ОстаткиТоваровКомпании.Номенклатура И 
	|	ОборудованиеСТоварами.СкладКомпании = ОстаткиТоваровКомпании.СкладКомпании И 
	|	ОстаткиТоваровКомпании.КоличествоОстаток>0
	|СГРУППИРОВАТЬ ПО
	|	ОборудованиеСТоварами.ГруппаТоваров,
	|	ОборудованиеСТоварами.Номенклатура
	|ИМЕЮЩИЕ
	|	ЕСТЬNULL(СУММА(ОстаткиТоваровКомпании.КоличествоОстаток), 0) = 0
	|;
	|
	|ВЫБРАТЬ
	|	ОборудованиеСТоварами.ГруппаТоваров,
	|	ОборудованиеСТоварами.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ
	|	ТоварыБезДвижений
	|ИЗ
	|	ОборудованиеСТоварами КАК ОборудованиеСТоварами
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
	|ПО
	|	ОборудованиеСТоварами.СкладКомпании = ОстаткиТоваровКомпании.СкладКомпании И 
	|	ОборудованиеСТоварами.Номенклатура = ОстаткиТоваровКомпании.Номенклатура И 
	|	ОстаткиТоваровКомпании.Количество>0 И 
	|	ОстаткиТоваровКомпании.Период>=&Период14
	|СГРУППИРОВАТЬ ПО
	|	ОборудованиеСТоварами.ГруппаТоваров,
	|	ОборудованиеСТоварами.Номенклатура
	|ИМЕЮЩИЕ
	|	ЕСТЬNULL(СУММА(ОстаткиТоваровКомпании.Количество), 0) = 0
	|;
	|
	|ВЫБРАТЬ
	|	ОборудованиеСТоварами.ГруппаТоваров КАК ГруппаТоваров,
	|	ОборудованиеСТоварами.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ
	|	ТоварыБезАссортимента
	|ИЗ
	|	ОборудованиеСТоварами КАК ОборудованиеСТоварами
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ОграничениеАссортиментаПодразделения.СрезПоследних(, (ПодразделениеКомпании, Номенклатура) В (ВЫБРАТЬ ПодразделениеКомпании, Номенклатура ИЗ ТоварыИПодразделения КАК ТоварыИПодразделения)) КАК ОграничениеАссортиментаПодразделенияСрезПоследних
	|ПО
	|	ОборудованиеСТоварами.ПодразделениеКомпании = ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании И 
	|	ОборудованиеСТоварами.Номенклатура = ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура И 
	|	ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
	|СГРУППИРОВАТЬ ПО
	|	ОборудованиеСТоварами.ГруппаТоваров,
	|	ОборудованиеСТоварами.Номенклатура
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|		КОГДА ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние ЕСТЬ NULL ТОГДА
	|			0
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ) = 0
	|;
	|
	|ВЫБРАТЬ
	|	ОборудованиеСТоварами.ГруппаТоваров,
	|	ОборудованиеСТоварами.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ
	|	ТоварыБезДвиженийАссортимента
	|ИЗ
	|	ОборудованиеСТоварами КАК ОборудованиеСТоварами
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ОграничениеАссортиментаПодразделения КАК ОграничениеАссортиментаПодразделения
	|ПО
	|	ОборудованиеСТоварами.Номенклатура = ОграничениеАссортиментаПодразделения.Номенклатура И 
	|	ОборудованиеСТоварами.ПодразделениеКомпании = ОграничениеАссортиментаПодразделения.ПодразделениеКомпании И 
	|	ОграничениеАссортиментаПодразделения.Период>=&Период14
	|СГРУППИРОВАТЬ ПО
	|	ОборудованиеСТоварами.ГруппаТоваров,
	|	ОборудованиеСТоварами.Номенклатура
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|		КОГДА ОграничениеАссортиментаПодразделения.Состояние ЕСТЬ NULL ТОГДА
	|			0
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ) = 0
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваров.ГруппаТоваров,
	|	ТаблицаТоваров.Номенклатура
	|ПОМЕСТИТЬ
	|	ТаблицаТоваров
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыСОстатками.ГруппаТоваров КАК ГруппаТоваров,
	|		ТоварыБезДвижений.Номенклатура КАК Номенклатура,
	|		1 КАК Счетчик
	|	ИЗ
	|		ТоварыСОстатками КАК ТоварыСОстатками
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТоварыБезДвижений КАК ТоварыБезДвижений
	|	ПО
	|		ТоварыСОстатками.ГруппаТоваров = ТоварыБезДвижений.ГруппаТоваров И 
	|		ТоварыСОстатками.Номенклатура = ТоварыБезДвижений.Номенклатура
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыБезАссортимента.ГруппаТоваров КАК ГруппаТоваров,
	|		ТоварыБезДвиженийАссортимента.Номенклатура КАК Номенклатура,
	|		1 КАК Счетчик
	|	ИЗ
	|		ТоварыБезАссортимента КАК ТоварыБезАссортимента
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТоварыБезДвиженийАссортимента КАК ТоварыБезДвиженийАссортимента
	|	ПО
	|		ТоварыБезАссортимента.ГруппаТоваров = ТоварыБезДвиженийАссортимента.ГруппаТоваров И 
	|		ТоварыБезАссортимента.Номенклатура = ТоварыБезДвиженийАссортимента.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОборудованиеСТоварами.ГруппаТоваров,
	|		ОборудованиеСТоварами.Номенклатура КАК Номенклатура,
	|		1
	|	ИЗ
	|		ОборудованиеСТоварами КАК ОборудованиеСТоварами
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ЗаказыПоставщикам.Остатки(, Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ТоварыИПодразделения КАК ТоварыИПодразделения)) КАК ЗаказыПоставщикам
	|	ПО
	|		ОборудованиеСТоварами.ПодразделениеКомпании = ЗаказыПоставщикам.ЗаказПоставщику.ПодразделениеКомпании И 
	|		ОборудованиеСТоварами.Номенклатура = ЗаказыПоставщикам.Номенклатура И 
	|		ЗаказыПоставщикам.ЗаказаноОстаток>0
	|	СГРУППИРОВАТЬ ПО
	|		ОборудованиеСТоварами.ГруппаТоваров,
	|		ОборудованиеСТоварами.Номенклатура
	|	ИМЕЮЩИЕ
	|		ЕСТЬNULL(СУММА(ЗаказыПоставщикам.ЗаказаноОстаток), 0) = 0) КАК ТаблицаТоваров
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.ГруппаТоваров,
	|	ТаблицаТоваров.Номенклатура
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаТоваров.Счетчик) = 3
	|;
	|
	|ВЫБРАТЬ
	|	ГруппыТоваровОборудования.Оборудование КАК Оборудование,
	|	ГруппыТоваровОборудования.ГруппаТоваров КАК ГруппаТоваров
	|ИЗ
	|	ГруппыТоваровОборудования КАК ГруппыТоваровОборудования
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваров.ГруппаТоваров КАК ГруппаТоваров,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТоварыВОборудовании.НомерЯчейки КАК НомерЯчейки
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ПО
	|	ТаблицаТоваров.ГруппаТоваров = ТоварыВОборудовании.ГруппаТоваров И 
	|	ТаблицаТоваров.Номенклатура = ТоварыВОборудовании.Номенклатура
	|ИТОГИ ПО
	|	ГруппаТоваров
	|";
	
	Запрос.УстановитьПараметр("Период14", НачалоДня(ТекущаяДата()-14*86400));
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ТаблицаОборудования = ПакетЗапросов[ПакетЗапросов.Количество()-2].Выгрузить();
	ЗапросТоваров       = ПакетЗапросов[ПакетЗапросов.Количество()-1];
	
	ДрайвераПодключаемогоОборудования = Новый Соответствие();
	СписокПодключений = Новый Массив;
	
	ВыборкаГрупп = ЗапросТоваров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГрупп.Следующий() Цикл
		Данные = Новый Массив;
		
		ДанныеСобытия = Новый Структура;
		ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
		
		Комментарий = "Удаление нектуальных товаров от: " + Формат(НачалоДня(ТекущаяДата()-14*86400), "ДФ=dd.MM.yyyy");
		
		МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(ВыборкаГрупп.ГруппаТоваров, , "Удаление неактуальных товаров (начало)", Комментарий, ДанныеСобытия);
		
		ТекстОшибки = "";
		
		НачатьТранзакцию();
		Попытка
			// Наложим блокировку на считываемые данные
			СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрСведений", "ТоварыВОборудовании");
			ЗначенияБлокировки = Новый Соответствие;
			ЗначенияБлокировки.Вставить("ГруппаТоваров", ВыборкаГрупп.ГруппаТоваров);
			
			ОбработкаСобытийДокументаСервер.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки);
			
			Выборка = ВыборкаГрупп.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЭлементМассива = ПодключаемоеОборудованиеOfflineВызовСервера.ПолучитьТоварнуюСтроку();
				ЭлементМассива.PLU          = Число(Выборка.НомерЯчейки);
				ЭлементМассива.КодВРегистре = Число(Выборка.НомерЯчейки);
				Данные.Добавить(ЭлементМассива);
			КонецЦикла;
			
			Если Данные.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			МассивУстройств = ТаблицаОборудования.НайтиСтроки(Новый Структура("ГруппаТоваров", ВыборкаГрупп.ГруппаТоваров));
			Для Каждого ИдентификаторУстройства Из МассивУстройств Цикл
				
				ПараметрыДанных = Новый Структура;
				ПараметрыДанных.Вставить("ЧастичнаяВыгрузка",      Истина);
				ПараметрыДанных.Вставить("ТаблицаВыгрузкиТоваров", Данные);
				
				Контекст = Новый Структура;
				Контекст.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
				Контекст.Вставить("ПараметрыДанных",         ПараметрыДанных);
				Контекст.Вставить("Команда",                 "ВыгрузитьТовары");
				Контекст.Вставить("ОтображатьСообщения",     Ложь);
				
				НачатьВыгрузкуДанныхВВесы(ДрайвераПодключаемогоОборудования, СписокПодключений, Контекст);
				
			КонецЦикла;
			
			Выборка.Сбросить();
			Пока Выборка.Следующий() Цикл
				НаборЗаписей = РегистрыСведений.ТоварыВОборудовании.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Объект.Установить(Выборка.ГруппаТоваров);
				НаборЗаписей.Отбор.Объект.Установить(Выборка.Номенклатура);
				Попытка
					НаборЗаписей.Записать(Истина);
				Исключение
				КонецПопытки;
			КонецЦикла;
			
		Исключение
			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ОтменитьТранзакцию();
			Продолжить;
		КонецПопытки;
		ЗафиксироватьТранзакцию();
		
		ДанныеСобытия = Новый Структура;
		ДанныеСобытия.Вставить("Данные",            Данные);
		ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
		
		Комментарий = "Удаление нектуальных товаров от: " + Формат(НачалоДня(ТекущаяДата()-14*86400), "ДФ=dd.MM.yyyy")+". Удалено: " + Формат(Данные.Количество(), "ЧН=0; ЧГ=0");
		Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
			Комментарий = Комментарий + Символы.ПС + "Ошибка: " + ТекстОшибки;
		КонецЕсли;
		
		МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(ВыборкаГрупп.ГруппаТоваров, , "Удаление неактуальных товаров (окончание)", Комментарий, ДанныеСобытия);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодключаемоеОборудование.Ссылка КАК Оборудование,
	|	ПодключаемоеОборудование.ОсновнойОтдел КАК СкладКомпании,
	|	ПодключаемоеОборудование.ОсновнойОтдел.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ГруппыТоваровОборудования.Ссылка КАК ГруппаТоваров
	|ПОМЕСТИТЬ
	|	ГруппыТоваровОборудования
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ГруппыТоваровОборудования КАК ГруппыТоваровОборудования
	|ПО
	|	ПодключаемоеОборудование.ГруппаТоваровОборудования = ГруппыТоваровОборудования.Ссылка
	|ГДЕ
	|	ГруппыТоваровОборудования.АвтоУдаление = ИСТИНА И 
	|	ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток)
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыТоваровОборудования.Оборудование КАК Оборудование,
	|	ГруппыТоваровОборудования.СкладКомпании КАК СкладКомпании,
	|	ГруппыТоваровОборудования.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ГруппыТоваровОборудования.ГруппаТоваров,
	|	ТоварыВОборудовании.Номенклатура КАК Номенклатура,
	|	ТоварыВОборудовании.Штрихкод
	|ПОМЕСТИТЬ
	|	ОборудованиеСТоварами
	|ИЗ
	|	ГруппыТоваровОборудования КАК ГруппыТоваровОборудования
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ПО
	|	ТоварыВОборудовании.ГруппаТоваров = ГруппыТоваровОборудования.ГруппаТоваров И 
	|	(НЕ ТоварыВОборудовании.Штрихкод = """")
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыВОборудовании.СкладКомпании,
	|	ТоварыВОборудовании.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ТоварыВОборудовании.Номенклатура КАК Номенклатура,
	|	ТоварыВОборудовании.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ
	|	ТоварыИСклады
	|ИЗ
	|	ОборудованиеСТоварами КАК ТоварыВОборудовании
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка) КАК СкладКомпании,
	|	ТоварыВОборудовании.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ТоварыВОборудовании.Номенклатура КАК Номенклатура,
	|	ТоварыВОборудовании.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ
	|	ТоварыИПодразделения
	|ИЗ
	|	ОборудованиеСТоварами КАК ТоварыВОборудовании
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваров.ГруппаТоваров,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.ШтрихКод
	|ПОМЕСТИТЬ
	|	ТаблицаТоваров
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОборудованиеСТоварами.ГруппаТоваров,
	|		ОборудованиеСТоварами.Номенклатура,
	|		ОборудованиеСТоварами.ШтрихКод,
	|		1 КАК Счетчик
	|	ИЗ
	|		ОборудованиеСТоварами КАК ОборудованиеСТоварами
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.УценкаТовара.СрезПоследних(,
	|			(ПодразделениеКомпании, ЗалОбслуживания, Номенклатура, Штрихкод) В (ВЫБРАТЬ ПодразделениеКомпании, СкладКомпании, Номенклатура, Штрихкод ИЗ ТоварыИПодразделения) И Действует) КАК УценкаТовара
	|	ПО
	|		ОборудованиеСТоварами.СкладКомпании = УценкаТовара.ЗалОбслуживания И 
	|		ОборудованиеСТоварами.ПодразделениеКомпании = УценкаТовара.ПодразделениеКомпании И 
	|		ОборудованиеСТоварами.Номенклатура = УценкаТовара.Номенклатура И 
	|		ОборудованиеСТоварами.Штрихкод = УценкаТовара.Штрихкод
	|	СГРУППИРОВАТЬ ПО
	|		ОборудованиеСТоварами.ГруппаТоваров,
	|		ОборудованиеСТоварами.Номенклатура,
	|		ОборудованиеСТоварами.ШтрихКод
	|	ИМЕЮЩИЕ
	|		СУММА(ВЫБОР
	|			КОГДА УценкаТовара.Штрихкод ЕСТЬ NULL ТОГДА
	|				0
	|			ИНАЧЕ
	|				1
	|		КОНЕЦ) > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОборудованиеСТоварами.ГруппаТоваров,
	|		ОборудованиеСТоварами.Номенклатура,
	|		ОборудованиеСТоварами.ШтрихКод,
	|		1 КАК Счетчик
	|	ИЗ
	|		ОборудованиеСТоварами КАК ОборудованиеСТоварами
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.УценкаТовара.СрезПоследних(,
	|			(ПодразделениеКомпании, ЗалОбслуживания, Номенклатура, Штрихкод) В (ВЫБРАТЬ ПодразделениеКомпании, СкладКомпании, Номенклатура, Штрихкод ИЗ ТоварыИСклады) И Действует) КАК УценкаТовара
	|	ПО
	|		ОборудованиеСТоварами.СкладКомпании = УценкаТовара.ЗалОбслуживания И 
	|		ОборудованиеСТоварами.ПодразделениеКомпании = УценкаТовара.ПодразделениеКомпании И 
	|		ОборудованиеСТоварами.Номенклатура = УценкаТовара.Номенклатура И 
	|		ОборудованиеСТоварами.Штрихкод = УценкаТовара.Штрихкод
	|	СГРУППИРОВАТЬ ПО
	|		ОборудованиеСТоварами.ГруппаТоваров,
	|		ОборудованиеСТоварами.Номенклатура,
	|		ОборудованиеСТоварами.ШтрихКод
	|	ИМЕЮЩИЕ
	|		СУММА(ВЫБОР
	|			КОГДА УценкаТовара.Штрихкод ЕСТЬ NULL ТОГДА
	|				0
	|			ИНАЧЕ
	|				1
	|		КОНЕЦ) > 0) КАК ТаблицаТоваров
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.ГруппаТоваров,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.ШтрихКод
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаТоваров.Счетчик) = 2
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваров.ГруппаТоваров КАК ГруппаТоваров,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.ШтрихКод КАК ШтрихКод,
	|	ТоварыВОборудовании.НомерЯчейки КАК НомерЯчейки
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ПО
	|	ТаблицаТоваров.ГруппаТоваров = ТоварыВОборудовании.ГруппаТоваров И 
	|	ТаблицаТоваров.Номенклатура = ТоварыВОборудовании.Номенклатура И 
	|	ТаблицаТоваров.ШтрихКод = ТоварыВОборудовании.ШтрихКод
	|ИТОГИ ПО
	|	ГруппаТоваров
	|";
	
	ПакетЗапросов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаГрупп = ЗапросТоваров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГрупп.Следующий() Цикл
		Данные = Новый Массив;
		
		ДанныеСобытия = Новый Структура;
		ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
		
		Комментарий = "Удаление нектуальных товаров от: " + Формат(НачалоДня(ТекущаяДата()-14*86400), "ДФ=dd.MM.yyyy");
		
		МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(ВыборкаГрупп.ГруппаТоваров, , "Удаление неактуальных уцененных товаров (начало)", Комментарий, ДанныеСобытия);
		
		ТекстОшибки = "";
		
		НачатьТранзакцию();
		Попытка
			// Наложим блокировку на считываемые данные
			СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрСведений", "ТоварыВОборудовании");
			ЗначенияБлокировки = Новый Соответствие;
			ЗначенияБлокировки.Вставить("ГруппаТоваров", ВыборкаГрупп.ГруппаТоваров);
			
			ОбработкаСобытийДокументаСервер.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки);
			
			Выборка = ВыборкаГрупп.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЭлементМассива = ПодключаемоеОборудованиеOfflineВызовСервера.ПолучитьТоварнуюСтроку();
				ЭлементМассива.PLU          = Число(Выборка.НомерЯчейки);
				ЭлементМассива.КодВРегистре = Число(Выборка.НомерЯчейки);
				Данные.Добавить(ЭлементМассива);
			КонецЦикла;
			
			Если Данные.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			МассивУстройств = ТаблицаОборудования.НайтиСтроки(Новый Структура("ГруппаТоваров", ВыборкаГрупп.ГруппаТоваров));
			Для Каждого ИдентификаторУстройства Из МассивУстройств Цикл
				
				ПараметрыДанных = Новый Структура;
				ПараметрыДанных.Вставить("ЧастичнаяВыгрузка",      Истина);
				ПараметрыДанных.Вставить("ТаблицаВыгрузкиТоваров", Данные);
				
				Контекст = Новый Структура;
				Контекст.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
				Контекст.Вставить("ПараметрыДанных",         ПараметрыДанных);
				Контекст.Вставить("Команда",                 "ВыгрузитьТовары");
				Контекст.Вставить("ОтображатьСообщения",     Ложь);
				
				НачатьВыгрузкуДанныхВВесы(ДрайвераПодключаемогоОборудования, СписокПодключений, Контекст);
				
			КонецЦикла;
			
			Выборка.Сбросить();
			Пока Выборка.Следующий() Цикл
				НаборЗаписей = РегистрыСведений.ТоварыВОборудовании.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Объект.Установить(Выборка.ГруппаТоваров);
				НаборЗаписей.Отбор.Объект.Установить(Выборка.Номенклатура);
				Попытка
					НаборЗаписей.Записать(Истина);
				Исключение
				КонецПопытки;
			КонецЦикла;
			
		Исключение
			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ОтменитьТранзакцию();
			Продолжить;
		КонецПопытки;
		ЗафиксироватьТранзакцию();
		
		ДанныеСобытия = Новый Структура;
		ДанныеСобытия.Вставить("Данные",            Данные);
		ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
		
		Комментарий = "Удаление нектуальных товаров от: " + Формат(НачалоДня(ТекущаяДата()-14*86400), "ДФ=dd.MM.yyyy")+". Удалено: " + Формат(Данные.Количество(), "ЧН=0; ЧГ=0");
		Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
			Комментарий = Комментарий + Символы.ПС + "Ошибка: " + ТекстОшибки;
		КонецЕсли;
		
		МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(ВыборкаГрупп.ГруппаТоваров, , "Удаление неактуальных уцененных товаров (окончание)", Комментарий, ДанныеСобытия);
		
	КонецЦикла;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуОборудования(ДрайвераПодключаемогоОборудования, СписокПодключений, ВходныеПараметры, АдресХранилища=Неопределено) Экспорт
	
	Если ВходныеПараметры.ИмяКоманды = "ВыгрузитьДанные" Тогда
		ВыгрузитьДанныеВОборудование(ДрайвераПодключаемогоОборудования, СписокПодключений, ВходныеПараметры.ИдентификаторУстройства, ВходныеПараметры.ПараметрыДанных);
	ИначеЕсли ВходныеПараметры.ИмяКоманды = "ЗагрузитьДанные" Тогда
		ЗагрузитьДанныеИзОборудования(ДрайвераПодключаемогоОборудования, СписокПодключений, ВходныеПараметры.ИдентификаторУстройства);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьДанныеВОборудование(ДрайвераПодключаемогоОборудования, СписокПодключений, ИдентификаторУстройства, ПараметрыДанных, ОтображатьСообщения = Истина) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОтображатьСообщения",     ОтображатьСообщения);
	Контекст.Вставить("ПараметрыДанных",         ПараметрыДанных);
	Контекст.Вставить("Команда",                 "ВыгрузитьДанные");
	Контекст.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	
	Если ИдентификаторУстройства = Неопределено Тогда
		Возврат;
	Иначе
		РезультатВыполнения = НачатьВыгрузкуДанных(ДрайвераПодключаемогоОборудования, СписокПодключений, Контекст);
		Если НЕ РезультатВыполнения.Результат Тогда
			ТекстСообщения = "";
			Если РезультатВыполнения.Свойство("ВыходныеПараметры") Тогда
				ТекстСообщения = РезультатВыполнения.ВыходныеПараметры[1];
			ИначеЕсли РезультатВыполнения.Свойство("ОписаниеОшибки") Тогда
				ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
			КонецЕсли;
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура добавляет в массив выходных параметров сообщение об ошибке.
//		Параметры:
//			- ВыходныеПараметры - массив, в который будет помещено сообщение об ошибке.
//			- ТекстСообщения - текст сообщения, содержащий информация об ошибке.
Процедура СоздатьСообщениеОбОшибке(ВыходныеПараметры, ТекстСообщения)
	
	ВыходныеПараметры.Добавить(999);
	ВыходныеПараметры.Добавить(ТекстСообщения);
	
КонецПроцедуры

Функция ПолучитьЗагружаемыеДанныеИзККМ() Экспорт
	
	ЗагружаемыеДанные = Новый Структура;
	ЗагружаемыеДанные.Вставить("ОтчетыОПродажах", Новый Массив);
	ЗагружаемыеДанные.Вставить("ВскрытияАлкогольнойТары", Новый Массив);
	
	Возврат ЗагружаемыеДанные;
	
КонецФункции

Функция ПолучитьОтчетОПродажахККМ() Экспорт
	
	ОтчетОПродажахККМ = Новый Структура;
	ОтчетОПродажахККМ.Вставить("НомерСмены");
	ОтчетОПродажахККМ.Вставить("НомерКассы");
	ОтчетОПродажахККМ.Вставить("ДатаОткрытияСмены");
	ОтчетОПродажахККМ.Вставить("ДатаЗакрытияСмены");
	ОтчетОПродажахККМ.Вставить("Чеки", Новый Массив);
	ОтчетОПродажахККМ.Вставить("ДвиженияДС", Новый Массив);
	ОтчетОПродажахККМ.Вставить("УникальныйИдентификатор");
	ОтчетОПродажахККМ.Вставить("СтатусСмены", Перечисления.СтатусыКассовойСмены.Закрыта);
	
	Возврат ОтчетОПродажахККМ;
	
КонецФункции

#Область КомандаВыгрузкаДанных

Функция НачатьВыгрузкуДанных(ДрайвераПодключаемогоОборудования, СписокПодключений, Контекст) Экспорт
	
	ОписаниеОшибки = "";
	
	СписокОборудования = ПодключитьОборудование(ДрайвераПодключаемогоОборудования, СписокПодключений,, Контекст.ИдентификаторУстройства, ОписаниеОшибки);
	
	Если СписокОборудования.Количество()>0 Тогда
		
		РезультатВыполнения = НачатьВыполнениеКоманды(ДрайвераПодключаемогоОборудования, СписокПодключений, Контекст.ИдентификаторУстройства, Контекст.Команда, Контекст.ПараметрыДанных, СписокОборудования);
		
	Иначе
		
		ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка.
									|%ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
		
		Если Контекст.ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства",
												Ложь, ТекстСообщения, Контекст.ИдентификаторУстройства
		);
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти

#Область КомандаЗагрузкаДанных

Функция НачатьЗагрузкуДанных(ДрайвераПодключаемогоОборудования, СписокПодключений, Контекст) Экспорт
	
	ОписаниеОшибки = "";
	
	СписокОборудования = ПодключитьОборудование(ДрайвераПодключаемогоОборудования, СписокПодключений,, Контекст.ИдентификаторУстройства, ОписаниеОшибки);
	
	Если СписокОборудования.Количество()>0 Тогда
		
		РезультатВыполнения = НачатьВыполнениеКоманды(ДрайвераПодключаемогоОборудования, СписокПодключений, Контекст.ИдентификаторУстройства, Контекст.Команда, Контекст.ПараметрыДанных, СписокОборудования);
		
	Иначе
		
		ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка.
									|%ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
		
		Если Контекст.ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства",
												Ложь, ТекстСообщения, Контекст.ИдентификаторУстройства
		);
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция НачатьЗагрузкуДанныхИзККМЗавершение(ДрайвераПодключаемогоОборудования, СписокПодключений, РезультатКоманды, Параметры) Экспорт
	
	ЕстьОшибки = Ложь;
	
	ВыходныеПараметры = РезультатКоманды.ВыходныеПараметры;
	
	Если РезультатКоманды.Результат Тогда
		
		Контекст = Новый Структура;
		Контекст.Вставить("ИдентификаторУстройства", Параметры.ИдентификаторУстройства);
		Контекст.Вставить("ДанныеИзККМ", РезультатКоманды.ВыходныеПараметры[0]);
		
		РезультатПередачиДанных = МенеджерОфлайнОборудованияВызовСервера.ПередатьДанныеЗагрузки(Контекст);
		
		Если РезультатПередачиДанных.Успешно Тогда
			
			ВходныеПараметры = Неопределено;
			
			//ОписаниеОповещения = Новый ОписаниеОповещения("НачатьЗагрузкуДанныхИзККМПослеУстановкиФлагаОбработанности", ЭтотОбъект, Параметры);
			РезультатВыполнения = НачатьВыполнениеКоманды(ДрайвераПодключаемогоОборудования, СписокПодключений, Параметры.ИдентификаторУстройства, "УстановитьФлагДанныеЗагружены", ВходныеПараметры);
			НачатьЗагрузкуДанныхИзККМПослеУстановкиФлагаОбработанности(РезультатВыполнения, Параметры);
			
		Иначе
			
			ВыходныеПараметры = Новый Массив;
			ЕстьОшибки = Истина;
			СоздатьСообщениеОбОшибке(ВыходныеПараметры, РезультатПередачиДанных.СообщениеОбОшибке);
		КонецЕсли;
		
	Иначе
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		
		РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Ложь, ВыходныеПараметры);
		
		//ОписаниеОповещения = Новый ОписаниеОповещения("НачатьЗагрузкуДанныхИзККМПослеУстановкиФлагаОбработанности", ЭтотОбъект, Параметры);
		//ВыполнитьОбработкуОповещения(ОписаниеОповещения, РезультатВыполнения);
		НачатьЗагрузкуДанныхИзККМПослеУстановкиФлагаОбработанности(РезультатВыполнения, Параметры);
		
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

Процедура НачатьЗагрузкуДанныхИзККМПослеУстановкиФлагаОбработанности(РезультатКоманды, Параметры) Экспорт
	
	Если РезультатКоманды.Результат Тогда
		ТекстСообщения = НСтр("ru='Данные загружены успешно'");
	Иначе
		ТекстСообщения = РезультатКоманды.ВыходныеПараметры[1];
	КонецЕсли;
	
	//Если Параметры.СледующееОповещение <> Неопределено Тогда
	//	
	//	РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(
	//		РезультатКоманды.Результат,
	//		ТекстСообщения,
	//		Параметры.ИдентификаторУстройства
	//	);
	//	
	//	//ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатВыполнения);
	//Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//КонецЕсли;
	
	//ОтключитьОборудованиеПоИдентификатору(Параметры.ИдентификаторУстройства);
	
КонецПроцедуры

#КонецОбласти

// Начать выполнение команды ответственному обработчику драйвера
//
Функция НачатьВыполнениеКоманды(ДрайвераПодключаемогоОборудования, СписокПодключений, Идентификатор, Команда, ВходныеПараметры, СписокОборудования = Неопределено) Экспорт
	
	РезультатВыполнения = Неопределено;
	
	// Поиск подключенного устройства.
	//ПодключенноеУстройство = ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО, Идентификатор);
	Если СписокОборудования = Неопределено Тогда
		СписокОборудования = ПодключитьОборудование(ДрайвераПодключаемогоОборудования, СписокПодключений,, Идентификатор);
		
		Если СписокОборудования.Количество()=0 Тогда
			ТекстОшибки = НСтр("ru='Не удалось подключить обработчик драйвера или загрузить драйвер.'");
			РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании();
			РезультатВыполнения.Результат = Ложь;
			РезультатВыполнения.ОписаниеОшибки = ТекстОшибки; 
			Возврат РезультатВыполнения;
		КонецЕсли;
		
	КонецЕсли;
	
	ПодключенноеУстройство = СписокОборудования[Идентификатор];
	
	ОбработчикДрайвераМодуль = ПодключенноеУстройство.ОбработчикДрайвераМодуль;
	ОбъектДрайвера           = ПодключенноеУстройство.ОбъектДрайвера;
	
	Если ОбработчикДрайвераМодуль = Неопределено Или ОбъектДрайвера = Неопределено Тогда
		// Сообщить об ошибке, что не удалось загрузить драйвер.
		ТекстОшибки = НСтр("ru='Не удалось подключить обработчик драйвера или загрузить драйвер.'");
		РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании();
		РезультатВыполнения.Результат = Ложь;
		РезультатВыполнения.ОписаниеОшибки = ТекстОшибки; 
		//ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
	Иначе
		Если ОбработчикДрайвераМодуль.ПоддержкаАсинхронногоРежима() Тогда
			РезультатВыполнения = ОбработчикДрайвераМодуль.НачатьВыполнениеКоманды(, Команда, ВходныеПараметры, ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
		Иначе
			ТекстОшибки = "";
			ВыходныеПараметры = Неопределено;
			Результат = ОбработчикДрайвераМодуль.ВыполнитьКоманду(Команда, ВходныеПараметры,
			ВыходныеПараметры,  ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
			Если Не Результат Тогда
				Если ВыходныеПараметры.Количество() >= 2 Тогда
					ТекстОшибки = ВыходныеПараметры[1];
				КонецЕсли;
				ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
			КонецЕсли;
			РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Результат, ТекстОшибки, Идентификатор);
			РезультатВыполнения.ВыходныеПараметры = ВыходныеПараметры;
			РезультатВыполнения.Вставить("ОбработчикДрайвераМодуль", ОбработчикДрайвераМодуль);
			РезультатВыполнения.Вставить("ОбъектДрайвера"          , ОбъектДрайвера);
			РезультатВыполнения.Вставить("ПодключенноеУстройство"  , ПодключенноеУстройство);
			//ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

#Область Служебный

Процедура ЗаписатьСобытиеЖурналаОборудования(ГруппаТоваровОборудования, Устройство = Неопределено, СобытиеЖурнала, Комментарий, ДанныеСобытия) Экспорт
	
	РегистрыСведений.ЖурналСобытийОборудования.ЗафиксироватьСобытие(ГруппаТоваровОборудования, Устройство, СобытиеЖурнала, Комментарий, ДанныеСобытия);
	
КонецПроцедуры

// Заполняет структуру выполнения операции на Оборудовании.
// 
Функция ПараметрыВыполненияОперацииНаОборудовании(Результат = Ложь, ОписаниеОшибки = Неопределено, ИдентификаторУстройства = Неопределено) Экспорт; 
	
	РезультатВыполнения = Новый Структура();
	РезультатВыполнения.Вставить("Результат"              , Результат);
	РезультатВыполнения.Вставить("ОписаниеОшибки"         , ОписаниеОшибки);
	РезультатВыполнения.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	РезультатВыполнения.Вставить("ВыходныеПараметры"      , Неопределено);
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьМоментПоследнейВыгрузки(Оборудование, ВидЗагружаемойИнформации) Экспорт
	
	Если ТипЗнч(ВидЗагружаемойИнформации)=Тип("Строка") Тогда ВидЗагружаемойИнформации=Перечисления.ВидыЗагружаемойИнформации[ВидЗагружаемойИнформации] КонецЕсли;
	
	Результат = Дата(1, 1, 1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МАКСИМУМ(МоментыПоследнейЗагрузки.МоментПоследнейЗагрузки) КАК МоментПоследнейЗагрузки
	|ИЗ
	|	РегистрСведений.МоментыПоследнейЗагрузки КАК МоментыПоследнейЗагрузки
	|ГДЕ
	|	МоментыПоследнейЗагрузки.Оборудование = &Оборудование И 
	|	МоментыПоследнейЗагрузки.ВидЗагружаемойИнформации = &ВидЗагружаемойИнформации
	|";
	Запрос.УстановитьПараметр("Оборудование",             Оборудование);
	Запрос.УстановитьПараметр("ВидЗагружаемойИнформации", ВидЗагружаемойИнформации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = ?(ЗначениеЗаполнено(Выборка.МоментПоследнейЗагрузки),Выборка.МоментПоследнейЗагрузки,Дата(1, 1, 1));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает массив моментов последней загрузки
Функция ПолучитьМоментыПоследнейВыгрузки(Оборудование,Кассы,ВидЗагружаемойИнформации,ПолнаяВыгрузка) Экспорт
	
	МоментыПоследнейВыгрузки = Новый Массив;
	
	Если Кассы.Количество()=0 Тогда
		Возврат МоментыПоследнейВыгрузки;
	КонецЕсли;
	
	Если ПолнаяВыгрузка Тогда
		МоментыПоследнейВыгрузки.Добавить(Новый Структура("МоментПоследнейВыгрузки, Кассы",'00010101',Кассы));
		Возврат МоментыПоследнейВыгрузки;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаКасс = Новый ТаблицаЗначений;
	ТаблицаКасс.Колонки.Добавить("НомерPOS",Новый ОписаниеТипов("Число"));
	ТаблицаКасс.Колонки.Добавить("СтруктураКассы");
	Для Каждого Касса из Кассы Цикл
		НоваяСтрока = ТаблицаКасс.Добавить();
		НоваяСтрока.НомерPOS = Касса.НомерPOS;
		НоваяСтрока.СтруктураКассы = Касса;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НомераКасс.НомерPOS КАК НомерPOS
	               |ПОМЕСТИТЬ НомераКассы
	               |ИЗ
	               |	&ТаблицаКасс КАК НомераКасс
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НомераКассы.НомерPOS КАК НомерPOS,
	               |	ЕСТЬNULL(МоментыПоследнейЗагрузки.МоментПоследнейЗагрузки, ДАТАВРЕМЯ(1, 1, 1)) КАК МоментПоследнейЗагрузки
	               |ИЗ
	               |	НомераКассы КАК НомераКассы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МоментыПоследнейЗагрузки КАК МоментыПоследнейЗагрузки
	               |		ПО НомераКассы.НомерPOS = МоментыПоследнейЗагрузки.НомерPOS
	               |			И (МоментыПоследнейЗагрузки.Оборудование = &Оборудование)
	               |			И (МоментыПоследнейЗагрузки.ВидЗагружаемойИнформации = &ВидЗагружаемойИнформации)
	               |ИТОГИ ПО
	               |	МоментПоследнейЗагрузки";
	Запрос.УстановитьПараметр("ТаблицаКасс",              ТаблицаКасс);
	Запрос.УстановитьПараметр("Оборудование",             Оборудование);
	Запрос.УстановитьПараметр("ВидЗагружаемойИнформации", Перечисления.ВидыЗагружаемойИнформации[ВидЗагружаемойИнформации]);
	
	ВыборкаМоменты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМоменты.Следующий() Цикл
		Выборка = ВыборкаМоменты.Выбрать();
		МассивКасс = Новый Массив;
		Пока Выборка.Следующий() Цикл
			СтрокаКассы = ТаблицаКасс.Найти(Выборка.НомерPOS, "НомерPOS");
			Если СтрокаКассы<>Неопределено Тогда
				МассивКасс.Добавить(СтрокаКассы.СтруктураКассы);
			КонецЕсли;
		КонецЦикла;
		МоментыПоследнейВыгрузки.Добавить(Новый Структура("МоментПоследнейВыгрузки, Кассы",ВыборкаМоменты.МоментПоследнейЗагрузки,МассивКасс));
	КонецЦикла;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат МоментыПоследнейВыгрузки;
	
КонецФункции

// Обработчик регламентного задания.
Процедура ВыгрузкаВОборудованиеPOS(ОборудованиеPOS) Экспорт
	
	Если ТипЗнч(ОборудованиеPOS) <> Тип("СправочникСсылка.ПодключаемоеОборудование")
		Или Не ЗначениеЗаполнено(ОборудованиеPOS) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ВыгрузкаВОборудованиеPOS);
	
	//РегламентноеЗадание = Метаданные.РегламентныеЗадания.ВыгрузкаВОборудованиеPOS;
	
	//Отбор = Новый Структура;
	//Отбор.Вставить("ИмяМетода", РегламентноеЗадание.ИмяМетода);
	//Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	//ФоновыеЗаданияОбновлениеВыгрузки = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	//Если ФоновыеЗаданияОбновлениеВыгрузки.Количество() > 0 Тогда
	//	Возврат;
	//КонецЕсли;
	
	ДрайвераПодключаемогоОборудования = Новый Соответствие;
	СписокПодключений                 = Новый Массив;
	
	ПараметрыДанных = Новый Структура;
	Если ОборудованиеPOS.ВыгружатьТовары ИЛИ 
		ОборудованиеPOS.ВыгружатьСкидки ИЛИ 
		ОборудованиеPOS.ВыгружатьПерсонал Тогда
		
		ПараметрыДанных.Вставить("ПолнаяВыгрузка",    Ложь);
		ПараметрыДанных.Вставить("ВыгружатьТовары",   ОборудованиеPOS.ВыгружатьТовары);
		ПараметрыДанных.Вставить("ВыгружатьСкидки",   ОборудованиеPOS.ВыгружатьСкидки);
		ПараметрыДанных.Вставить("ВыгружатьПерсонал", ОборудованиеPOS.ВыгружатьПерсонал);
		
		ВходныеПараметры = Новый Структура;
		ВходныеПараметры.Вставить("ИдентификаторУстройства", ОборудованиеPOS);
		ВходныеПараметры.Вставить("ИмяКоманды",              "ВыгрузитьДанные");
		ВходныеПараметры.Вставить("ПараметрыДанных",         ПараметрыДанных);
		
		ВыполнитьКомандуОборудования(ДрайвераПодключаемогоОборудования, СписокПодключений, ВходныеПараметры);
	КонецЕсли;
	
	Если ОборудованиеPOS.ЗагружатьПродажи Тогда
		
		ВходныеПараметры = Новый Структура;
		ВходныеПараметры.Вставить("ИдентификаторУстройства", ОборудованиеPOS);
		ВходныеПараметры.Вставить("ИмяКоманды",              "ЗагрузитьДанные");
		ВходныеПараметры.Вставить("ПараметрыДанных",         ПараметрыДанных);
		
		ВыполнитьКомандуОборудования(ДрайвераПодключаемогоОборудования, СписокПодключений, ВходныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик регламентного задания.
Процедура ВыгрузкаВВесы(ПодразделениеКомпании) Экспорт
	
	РегламентноеЗадание = Метаданные.РегламентныеЗадания.УдалениеНеактуальныхТоваровВОборудовании;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяМетода", РегламентноеЗадание.ИмяМетода);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	ФоновыеЗаданияОбновлениеВыгрузки = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если ФоновыеЗаданияОбновлениеВыгрузки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	РегламентноеЗадание = Метаданные.РегламентныеЗадания.ВыгрузкаВВесы;
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(РегламентноеЗадание);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяМетода", РегламентноеЗадание.ИмяМетода);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	ФоновыеЗаданияОбновлениеВыгрузки = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	//Если ФоновыеЗаданияОбновлениеВыгрузки.Количество() > 30 Тогда
	Если ФоновыеЗаданияОбновлениеВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Счетчик = 0;
	Для Каждого ТекСтрока Из ФоновыеЗаданияОбновлениеВыгрузки Цикл
		Если ТекСтрока.РегламентноеЗадание = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ПараметрыЗадания = ТекСтрока.РегламентноеЗадание.Параметры;
		Если ТипЗнч(ПараметрыЗадания) = Тип("Массив") И ПараметрыЗадания.Количество()>0 И ПараметрыЗадания[0] = ПодразделениеКомпании Тогда
			Счетчик = Счетчик + 1;
		КонецЕсли;
		
		Если Счетчик>1 Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПодключаемоеОборудование.ДрайверОборудования,
	|	ПодключаемоеОборудование.ДрайверОборудования.ПоставляетсяДистрибутивом КАК ПоставляетсяДистрибутивом,
	|	ПодключаемоеОборудование.Ссылка КАК ИдентификаторУстройства,
	|	ПодключаемоеОборудование.ГруппаТоваровОборудования КАК ГруппаТоваров,
	|	МАКСИМУМ(ЕСТЬNULL(ТабМоментыПоследнейЗагрузки.МоментПоследнейЗагрузки, ДатаВремя(1,1,1))) КАК МоментПоследнейЗагрузки,
	|	ЕСТЬNULL(ПодключаемоеОборудование.ОсновнойОтдел.ТипЦенРозничнойТорговли, ЗНАЧЕНИЕ(Справочник.ТипыЦен.ПустаяСсылка)) КАК ТипЦен,
	|	ПодключаемоеОборудование.ОсновнойОтдел КАК ОсновнойОтдел,
	|	ПодключаемоеОборудование.ОсновнойОтдел.ПодразделениеКомпании КАК Подразделение
	|ПОМЕСТИТЬ
	|	ПодключаемоеОборудование
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.МоментыПоследнейЗагрузки КАК ТабМоментыПоследнейЗагрузки
	|ПО
	|	ПодключаемоеОборудование.Ссылка = ТабМоментыПоследнейЗагрузки.Оборудование И 
	|	ТабМоментыПоследнейЗагрузки.ВидЗагружаемойИнформации = ЗНАЧЕНИЕ(Перечисление.ВидыЗагружаемойИнформации.Товары)
	|ГДЕ
	|	ПодключаемоеОборудование.ПометкаУдаления = ЛОЖЬ И 
	|	ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток) И 
	|	ПодключаемоеОборудование.ВыполнятьПоРасписанию = ИСТИНА И 
	|	ПодключаемоеОборудование.УстройствоИспользуется = ИСТИНА
	//|	ПодключаемоеОборудование.ОсновнойОтдел.ПодразделениеКомпании = &ПодразделениеКомпании
	|СГРУППИРОВАТЬ ПО
	|	ПодключаемоеОборудование.Ссылка,
	|	ПодключаемоеОборудование.ГруппаТоваровОборудования
	|;
	|
	|ВЫБРАТЬ ПЕРВЫЕ 30
	//|ВЫБРАТЬ
	|	ПодключаемоеОборудование.ДрайверОборудования КАК ДрайверОборудования,
	|	МАКСИМУМ(ПодключаемоеОборудование.ПоставляетсяДистрибутивом) КАК ПоставляетсяДистрибутивом,
	|	ПодключаемоеОборудование.ГруппаТоваров КАК ГруппаТоваров,
	|	ПодключаемоеОборудование.ИдентификаторУстройства,
	|	МАКСИМУМ(ПодключаемоеОборудование.МоментПоследнейЗагрузки) КАК МоментПоследнейЗагрузки,
	|	МАКСИМУМ(ТоварыВОборудовании.МоментИзменения) КАК МоментИзменения,
	|	МАКСИМУМ(ПодключаемоеОборудование.ТипЦен) КАК ТипЦен,
	|	ПодключаемоеОборудование.ОсновнойОтдел КАК ОсновнойОтдел,
	|	МАКСИМУМ(ПодключаемоеОборудование.Подразделение) КАК Подразделение
	|ИЗ
	|	ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ПО
	|	ТоварыВОборудовании.ГруппаТоваров = ПодключаемоеОборудование.ГруппаТоваров
	|СГРУППИРОВАТЬ ПО
	|	ПодключаемоеОборудование.ОсновнойОтдел,
	|	ПодключаемоеОборудование.ГруппаТоваров,
	|	ПодключаемоеОборудование.ДрайверОборудования,
	|	ПодключаемоеОборудование.ИдентификаторУстройства
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ТоварыВОборудовании.МоментИзменения) > МАКСИМУМ(ПодключаемоеОборудование.МоментПоследнейЗагрузки)
	|УПОРЯДОЧИТЬ ПО
	|	МоментПоследнейЗагрузки
	|ИТОГИ
	|	МАКСИМУМ(ТипЦен),
	|	МАКСИМУМ(Подразделение),
	|	МИНИМУМ(МоментПоследнейЗагрузки),
	|	МИНИМУМ(ПоставляетсяДистрибутивом)
	|ПО
	|	ДрайверОборудования,
	|	ГруппаТоваров,
	|	ОсновнойОтдел
	|";
	
	ДрайвераПодключаемогоОборудования = Новый Соответствие();
	
	ОписаниеОшибки = "";
	ВыборкаДрайверОборудования = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДрайверОборудования.Следующий() Цикл
		
		ДанныеДрайвера = Справочники.ДрайверыОборудования.ПолучитьДанныеДрайвера(ВыборкаДрайверОборудования.ДрайверОборудования);
		
		ОбъектДрайвера = ПолучитьОбъектДрайвера(ДанныеДрайвера, ДрайвераПодключаемогоОборудования);
		Если ОбъектДрайвера = Неопределено Тогда
			// Сообщить об ошибке, что не удалось загрузить драйвер.
			ОписаниеОшибки = ОписаниеОшибки + ?(ПустаяСтрока(ОписаниеОшибки), "", Символы.ПС)
			+ НСтр("ru='%Наименование%: Не удалось загрузить драйвер устройства.
			|Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", СокрЛП(ДанныеДрайвера.ДрайверОборудования));
			Продолжить;
		КонецЕсли;
		
		ДанныеДрайвера.Вставить("ТипОборудованияИмя", МенеджерОборудованияВызовСервера.ПолучитьИмяТипаОборудования(ДанныеДрайвера.ТипОборудования));
		
		ОбработчикДрайвераМодуль = ПолучитьОбработчикДрайвера(ДанныеДрайвера.ОбработчикДрайвера, Не ДанныеДрайвера.ВСоставеКонфигурации, ДанныеДрайвера.ТипОборудованияИмя);
		
		Если ОбработчикДрайвераМодуль = Неопределено Тогда
			// Сообщить об ошибке, что не удалось загрузить драйвер.
			ОписаниеОшибки = ОписаниеОшибки +  НСтр("ru='Не удалось подключить обработчик драйвера.'");
			Продолжить;
		КонецЕсли;
		
		ВыборкаГруппаТоваров = ВыборкаДрайверОборудования.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГруппаТоваров.Следующий() Цикл
			ВыборкаОсновнойОтдел = ВыборкаГруппаТоваров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаОсновнойОтдел.Следующий() Цикл
				МоментВыгрузкиДанных = ТекущаяДатаСеанса();
				
				ПараметрыГруппы = ПодключаемоеОборудованиеOfflineВызовСервера.ПолучитьСтруктуруПараметровУстройства();
				ПараметрыГруппы.ОсновнойОтдел = ВыборкаОсновнойОтдел.ОсновнойОтдел;
				ПараметрыГруппы.ТипЦен        = ВыборкаОсновнойОтдел.ТипЦен;
				ПараметрыГруппы.Подразделение = ВыборкаОсновнойОтдел.Подразделение;
				ПараметрыГруппы.ГруппаТоваровОборудования = ВыборкаОсновнойОтдел.ГруппаТоваров;
				
				СтруктураДанные = ПодключаемоеОборудованиеOfflineВызовСервера.ПолучитьДанныеДляВесов(, Истина, ПараметрыГруппы, ВыборкаОсновнойОтдел.МоментПоследнейЗагрузки);
				Если СтруктураДанные.Данные.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Выборка = ВыборкаОсновнойОтдел.Выбрать();
				Пока Выборка.Следующий() Цикл
					
					ПараметрыДанных = Новый Массив;
					ПараметрыДанных.Добавить(СтруктураДанные.Данные);
					ПараметрыДанных.Добавить(СтруктураДанные.ЧастичнаяВыгрузка);
					
					//ВходныеПараметры = Новый Структура;
					//ВходныеПараметры.Вставить("ИдентификаторУстройства", Выборка.ИдентификаторУстройства);
					//ВходныеПараметры.Вставить("ПараметрыДанных",         ПараметрыДанных);
					//ВходныеПараметры.Вставить("Команда",                 "ВыгрузитьТовары");
					//ВходныеПараметры.Вставить("ОтображатьСообщения",     Истина);
					
					ДанныеУстройства = Справочники.ПодключаемоеОборудование.ПолучитьДанныеУстройства(Выборка.ИдентификаторУстройства);
					
					ПараметрыПодключения = Новый Структура;
					ПараметрыПодключения.Вставить("ТипОборудования", ДанныеУстройства.ТипОборудованияИмя);
					
					ДанныеУстройства.Вставить("ПараметрыПодключения", ПараметрыПодключения);
					
					ВыходныеПараметры = Неопределено;
					
					Результат = ОбработчикДрайвераМодуль.ПодключитьУстройство(ОбъектДрайвера, ДанныеУстройства.Параметры, ДанныеУстройства.ПараметрыПодключения, ВыходныеПараметры);
					
					Если НЕ Результат Тогда
						// Сообщим пользователю о том, что не удалось подключить устройство.
						ОписаниеОшибки = ОписаниеОшибки + ?(ПустаяСтрока(ОписаниеОшибки), "", Символы.ПС)
						+ НСтр("ru='Не удалось подключить устройство ""%Наименование%"": %ОписаниеОшибки% (%КодОшибки%)'");
						ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%"  , ДанныеУстройства.Наименование);
						ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
						ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%КодОшибки%"     , ВыходныеПараметры[0]);
						Продолжить;
					КонецЕсли;
					
					Если ВыходныеПараметры.Количество() >= 2 Тогда
						ДанныеУстройства.Вставить("ИсточникСобытия", ВыходныеПараметры[0]);
						ДанныеУстройства.Вставить("ИменаСобытий",    ВыходныеПараметры[1]);
					Иначе
						ДанныеУстройства.Вставить("ИсточникСобытия", "");
						ДанныеУстройства.Вставить("ИменаСобытий",    Неопределено);
					КонецЕсли;
					ДанныеУстройства.Вставить("ОбъектДрайвера",           ОбъектДрайвера);
					ДанныеУстройства.Вставить("ОбработчикДрайвераМодуль", ОбработчикДрайвераМодуль);
					
					ДанныеУстройства.Параметры.Вставить("МоментВыгрузкиДанных", МоментВыгрузкиДанных);
					ДанныеУстройства.Параметры.Вставить("ГруппаТоваровОборудования", ВыборкаОсновнойОтдел.ГруппаТоваров);
					
					ТекстОшибки = "";
					ВыходныеПараметры = Неопределено;
					Результат = ОбработчикДрайвераМодуль.ВыполнитьКоманду("ВыгрузитьТовары", ПараметрыДанных,
					ВыходныеПараметры,  ОбъектДрайвера, ДанныеУстройства.Параметры, ДанныеУстройства.ПараметрыПодключения);
					
					ВыходныеПараметры = Неопределено;
					Результат = ОбработчикДрайвераМодуль.ОтключитьУстройство(ОбъектДрайвера, ДанныеУстройства.Параметры, ДанныеУстройства.ПараметрыПодключения, ВыходныеПараметры);
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		ОбъектДрайвера = Неопределено;
		
	КонецЦикла;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Функция НачатьВыгрузкуДанныхВВесы(ДрайвераПодключаемогоОборудования, СписокПодключений, Контекст) Экспорт
	
	ОписаниеОшибки = "";
	
	СписокОборудования = ПодключитьОборудование(ДрайвераПодключаемогоОборудования, СписокПодключений,, Контекст.ИдентификаторУстройства, ОписаниеОшибки);
	
	Если ПустаяСтрока(ОписаниеОшибки) И СписокОборудования.Количество()>0 Тогда
		
		РезультатВыполнения = НачатьВыполнениеКоманды(ДрайвераПодключаемогоОборудования, СписокПодключений, Контекст.ИдентификаторУстройства, Контекст.Команда, Контекст.ПараметрыДанных, СписокОборудования);
		
		ПодключенноеУстройство = СписокОборудования[Контекст.ИдентификаторУстройства];
		Если НЕ ПодключенноеУстройство = Неопределено Тогда
			ОбработчикДрайвераМодуль = ПодключенноеУстройство.ОбработчикДрайвераМодуль;
			ОбъектДрайвера           = ПодключенноеУстройство.ОбъектДрайвера;
			Если (НЕ ОбработчикДрайвераМодуль = Неопределено) И (НЕ ОбъектДрайвера = Неопределено) Тогда
				ВыходныеПараметры = Неопределено;
				Результат = ОбработчикДрайвераМодуль.ОтключитьУстройство(ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения, ВыходныеПараметры);
				
				Если Результат Тогда
					ПодключенноеУстройство.КоличествоПодключенных = 0;
				Иначе
					ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", Символы.ПС)
					+ НСтр("ru='При отключении устройства ""%Наименование%"" произошла ошибка: %ОписаниеОшибки% (%КодОшибки%)'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Наименование%", ПодключенноеУстройство.Наименование);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КодОшибки%", ВыходныеПараметры[0]);
					
					Если Контекст.ОтображатьСообщения Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					КонецЕсли;
					РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства",
					Ложь, ТекстСообщения, Контекст.ИдентификаторУстройства);
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка.
									|%ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
		
		Если Контекст.ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства",
												Ложь, ТекстСообщения, Контекст.ИдентификаторУстройства
		);
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ОборудованиеПоПараметрам(ТипыПО = Неопределено, Идентификатор = Неопределено, РабочееМесто = Неопределено) Экспорт

	Возврат МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам(ТипыПО, Идентификатор, РабочееМесто);

КонецФункции

Функция ПолучитьПодключенноеУстройство(СписокПодключений, Идентификатор) Экспорт
	
	ПодключенноеУстройство = Неопределено;
	
	Для Каждого Подключение Из СписокПодключений Цикл
		Если Подключение.Ссылка = Идентификатор Тогда
			ПодключенноеУстройство = Подключение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПодключенноеУстройство;
	
КонецФункции

Функция ПодключитьОборудование(ДрайвераПодключаемогоОборудования, СписокПодключений, ТипыПО = Неопределено, ИдентификаторУстройства = Неопределено, ОписаниеОшибки = "") Экспорт
	
	//КонечныйРезультат = Истина;
	//Результат         = Истина;
	
	//ОбъектДрайвера    = Неопределено;
	ОписаниеОшибки    = "";
	//ОписаниеОшибкиУстройства = "";
	
	//Результат = ОбновитьРабочееМестоКлиента();
	//Если Не Результат Тогда
	//	ОписаниеОшибки = НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");
	//	Возврат Ложь;
	//КонецЕсли;
	
	КонечныйРезультат = Новый Соответствие;
	
	СписокОборудования = ОборудованиеПоПараметрам(ТипыПО, ИдентификаторУстройства);
	
	Если СписокОборудования.Количество() > 0 Тогда
		Для Каждого Устройство Из СписокОборудования Цикл
			
			// Проверим, не подключено ли устройство ранее.
			ПодключенноеУстройство = ПолучитьПодключенноеУстройство(СписокПодключений, Устройство.Ссылка);
			
			Если ПодключенноеУстройство = Неопределено Тогда // Если устройство не было подключено ранее.
				ОбъектДрайвера = ПолучитьОбъектДрайвера(Устройство, ДрайвераПодключаемогоОборудования);
				Если ОбъектДрайвера = Неопределено Тогда
					// Сообщить об ошибке, что не удалось загрузить драйвер.
					ОписаниеОшибки = ОписаниеОшибки + ?(ПустаяСтрока(ОписаниеОшибки), "", Символы.ПС)
								   + НСтр("ru='%Наименование%: Не удалось загрузить драйвер устройства.
									 |Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", Устройство.Наименование);
					//КонечныйРезультат = Ложь;
					КонечныйРезультат.Вставить(Устройство.Ссылка, Неопределено);
					Продолжить;
				КонецЕсли;
				
				НовоеПодключение = Новый Структура();
				НовоеПодключение.Вставить("Клиенты"               , Новый Массив());
				//НовоеПодключение.Клиенты.Добавить(ИдентификаторКлиента);
				НовоеПодключение.Вставить("Ссылка"                  , Устройство.Ссылка);
				НовоеПодключение.Вставить("ИдентификаторУстройства" , Устройство.ИдентификаторУстройства);
				НовоеПодключение.Вставить("ОбработчикДрайвера"      , Устройство.ОбработчикДрайвера);
				НовоеПодключение.Вставить("Наименование"            , Устройство.Наименование);
				НовоеПодключение.Вставить("ТипОборудования"         , Устройство.ТипОборудования);
				НовоеПодключение.Вставить("ТипОборудованияИмя"      , Устройство.ТипОборудованияИмя);
				НовоеПодключение.Вставить("ДрайверОборудования"     , Устройство.ДрайверОборудования);
				НовоеПодключение.Вставить("ВСоставеКонфигурации"    , Устройство.ВСоставеКонфигурации);
				НовоеПодключение.Вставить("ИдентификаторОбъекта"    , Устройство.ИдентификаторОбъекта);
				НовоеПодключение.Вставить("ИмяМакетаДрайвера"       , Устройство.ИмяМакетаДрайвера);
				НовоеПодключение.Вставить("ИмяФайлаДрайвера"        , Устройство.ИмяФайлаДрайвера);
				НовоеПодключение.Вставить("РабочееМесто"            , Устройство.РабочееМесто);
				НовоеПодключение.Вставить("ИмяКомпьютера"           , Устройство.ИмяКомпьютера);
				НовоеПодключение.Вставить("Параметры"               , Устройство.Параметры);
				НовоеПодключение.Вставить("КоличествоПодключенных"  , 1);
				НовоеПодключение.Вставить("ПараметрыПодключения"    , Новый Структура());
				НовоеПодключение.ПараметрыПодключения.Вставить("ТипОборудования", Устройство.ТипОборудованияИмя);
				
				ВыходныеПараметры = Неопределено;
				ОбработчикДрайвераМодуль = ПолучитьОбработчикДрайвера(НовоеПодключение.ОбработчикДрайвера, Не НовоеПодключение.ВСоставеКонфигурации, НовоеПодключение.ТипОборудованияИмя);
				
				Если ОбработчикДрайвераМодуль = Неопределено Тогда
					// Сообщить об ошибке, что не удалось загрузить драйвер.
					ОписаниеОшибки = ОписаниеОшибки +  НСтр("ru='Не удалось подключить обработчик драйвера.'");
					//КонечныйРезультат = Ложь;
					КонечныйРезультат.Вставить(Устройство.Ссылка, Неопределено);
					Продолжить;
				Иначе
					//#Если ВебКлиент Тогда
					//// Принудительно заменяем асинхронный обработчик на синхронный, так как работам в синхронном режиме.
					//Если ОбработчикДрайвераМодуль = ПодключаемоеОборудованиеУниверсальныйДрайверАсинхронноКлиент Тогда
					//	ОбработчикДрайвераМодуль = ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
					//КонецЕсли;
					//#КонецЕсли
					Результат = ОбработчикДрайвераМодуль.ПодключитьУстройство(ОбъектДрайвера, НовоеПодключение.Параметры, 
						НовоеПодключение.ПараметрыПодключения, ВыходныеПараметры);
				КонецЕсли;
				
				Если Результат Тогда
					Если ВыходныеПараметры.Количество() >= 2 Тогда
						НовоеПодключение.Вставить("ИсточникСобытия", ВыходныеПараметры[0]);
						НовоеПодключение.Вставить("ИменаСобытий",    ВыходныеПараметры[1]);
					Иначе
						НовоеПодключение.Вставить("ИсточникСобытия", "");
						НовоеПодключение.Вставить("ИменаСобытий",    Неопределено);
					КонецЕсли;
					НовоеПодключение.Вставить("ОбъектДрайвера"          , ОбъектДрайвера);
					НовоеПодключение.Вставить("ОбработчикДрайвераМодуль", ОбработчикДрайвераМодуль);
					
					КонечныйРезультат.Вставить(Устройство.Ссылка, НовоеПодключение);
					
					СписокПодключений.Добавить(НовоеПодключение);
					
				Иначе
					// Сообщим пользователю о том, что не удалось подключить устройство.
					
					КонечныйРезультат.Вставить(Устройство.Ссылка, Неопределено);
					
					ОписаниеОшибки = ОписаниеОшибки + ?(ПустаяСтрока(ОписаниеОшибки), "", Символы.ПС)
								   + НСтр("ru='Не удалось подключить устройство ""%Наименование%"": %ОписаниеОшибки% (%КодОшибки%)'");
					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%"  , Устройство.Наименование);
					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%КодОшибки%"     , ВыходныеПараметры[0]);
				КонецЕсли;
			Иначе // Устройство было подключено ранее.
				КонечныйРезультат.Вставить(Устройство.Ссылка, ПодключенноеУстройство);
				//	// Увеличим количество пользователей данного соединения.
				//	ПодключенноеУстройство.Клиенты.Добавить(ИдентификаторКлиента);
				//	ПодключенноеУстройство.КоличествоПодключенных = ПодключенноеУстройство.КоличествоПодключенных + 1;
			КонецЕсли;
			
			//КонечныйРезультат = КонечныйРезультат И Результат;
		КонецЦикла;
		
	ИначеЕсли ИдентификаторУстройства <> Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='Выбранное устройство не может использоваться для подключения.
		|Укажите другое устройство.'");
		//КонечныйРезультат = Ложь;
	ИначеЕсли ТипыПО = Неопределено И ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='Нет доступного оборудования для подключения.'");
		//КонечныйРезультат = Ложь;
	КонецЕсли;
	
	Возврат КонечныйРезультат;
	
КонецФункции

// Получение объекта драйвера
//
Функция ПолучитьОбъектДрайвера(ДанныеДрайвера, ДрайвераПодключаемогоОборудования, ТекстОшибки = Неопределено) Экспорт
	
	ОбъектДрайвера = Неопределено;
	
	Для Каждого ДрайверПО Из ДрайвераПодключаемогоОборудования Цикл
		Если ДрайверПО.Ключ = ДанныеДрайвера.ДрайверОборудования  Тогда
			ОбъектДрайвера = ДрайверПО.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбъектДрайвера = Неопределено Тогда
		Попытка
			
			ProgID = ДанныеДрайвера.ИдентификаторОбъекта;
			Если ПустаяСтрока(ProgID) Тогда
				ОбъектДрайвера = ""; // Драйвер не требуется
			Иначе
				ProgID1 = ?(Найти(ProgID, "|") > 0, Сред(ProgID, 1, Найти(ProgID, "|")-1), ProgID); 
				ProgID2 = ?(Найти(ProgID, "|") > 0, Сред(ProgID, Найти(ProgID, "|")+1), ProgID); 
				Если ДанныеДрайвера.ПоставляетсяДистрибутивом Тогда
					ПодключитьВнешнююКомпоненту(ProgID1);
				Иначе
					ИмяОбъекта = Сред(ProgID1, Найти(ProgID1, ".") + 1); 
					Префикс = Сред(ProgID1, 1, Найти(ProgID1, ".")); 
					ProgID2 = Префикс + СтрЗаменить(ИмяОбъекта, ".", "_") + "." + ИмяОбъекта;
					Если ДанныеДрайвера.ВСоставеКонфигурации Тогда
						ДвоичныеДанныеДрайвера = ПолучитьОбщийМакет(ДанныеДрайвера.ИмяМакетаДрайвера);
						АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанныеДрайвера);
						//Результат = ПодключитьВнешнююКомпоненту("ОбщийМакет." + ДанныеДрайвера.ИмяМакетаДрайвера, СтрЗаменить(ИмяОбъекта, ".", "_"));
						Результат = ПодключитьВнешнююКомпоненту(АдресХранилища, СтрЗаменить(ИмяОбъекта, ".", "_"));
					Иначе
						СсылкаНаДрайвер = ПолучитьНавигационнуюСсылку(ДанныеДрайвера.ДрайверОборудования, "ЗагруженныйДрайвер");
						Результат = ПодключитьВнешнююКомпоненту(СсылкаНаДрайвер, СтрЗаменить(ИмяОбъекта, ".", "_"));
					КонецЕсли;
				КонецЕсли;
				ОбъектДрайвера = Новый (ProgID2);
			КонецЕсли;
			
		Исключение
			Инфо = ИнформацияОбОшибке();
			ТекстОшибки = Инфо.Описание;
		КонецПопытки;
		
		Если ОбъектДрайвера <> Неопределено Тогда
			ДрайвераПодключаемогоОборудования.Вставить(ДанныеДрайвера.ДрайверОборудования, ОбъектДрайвера);
			ОбъектДрайвера = ДрайвераПодключаемогоОборудования[ДанныеДрайвера.ДрайверОборудования];
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОбъектДрайвера;
	
КонецФункции

// Функция возвращает объект обработчика драйвера по его наименованию.
//
// Параметры:
//  ОбработчикДрайвера  - Перечисление, ссылка на обработчик драйвера подключаемого оборудования.
//  ЗагружаемыйДрайвер  - Булево, признак, что драйвер загружаемый
//  ТипОборудованияИмя  - Строка, представление типа оборудования
//
// Возвращаемое значение:
//  Результат - Используемый модуль обработчика драйвера.
//
Функция ПолучитьОбработчикДрайвера(ОбработчикДрайвера, ЗагружаемыйДрайвер, ТипОборудованияИмя) Экспорт
	//ПодключаемоеОборудованиеУниверсальныйДрайверКлиент
	//Результат = ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
	Результат = Неопределено;
	
	// Обработчики драйверов не удовлетворяющие стандарту "1С:Совместимо".
	Если Не ЗагружаемыйДрайвер И ОбработчикДрайвера <> Неопределено Тогда
		
		// Сканеры штрихкода
		//Если ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССканерыШтрихкода Тогда
		//	Возврат ПодключаемоеОборудование1ССканерыШтрихкодаКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодСканерыШтрихкода Тогда
		//	Возврат ПодключаемоеОборудованиеСканкодСканерыШтрихкодаКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолСканерыШтрихкода Тогда
		//	Возврат ПодключаемоеОборудованиеАтолСканерыШтрихкодаКлиент;
		//КонецЕсли;
		//// Конец Сканеры штрихкода
		//
		//// Считыватели магнитных карт
		//Если ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССчитывателиМагнитныхКарт Тогда
		//	Возврат ПодключаемоеОборудование1ССчитывателиМагнитныхКартКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолСчитывателиМагнитныхКарт Тогда
		//	Возврат ПодключаемоеОборудованиеАтолСчитывателиМагнитныхКартКлиент;
		//КонецЕсли;
		//// Конец Считыватели магнитных карт.
		//
		//// Фискальные регистраторы
		//Если ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолФискальныеРегистраторы Тогда
		//	Возврат ПодключаемоеОборудованиеАтолФискальныеРегистраторыКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВерсияТФискальныеРегистраторы Тогда
		//	Возврат ПодключаемоеОборудованиеВерсияТФискальныеРегистраторыКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикККСФискальныеРегистраторы Тогда
		//	Возврат ПодключаемоеОборудованиеККСФискальныеРегистраторыКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМФискальныеРегистраторы Тогда
		//	Возврат ПодключаемоеОборудованиеШтрихМФискальныеРегистраторыКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикОРИОНФискальныеРегистраторы Тогда
		//	Возврат ПодключаемоеОборудованиеОРИОНФискальныеРегистраторыКлиент;
		//КонецЕсли;
		//// Конец Фискальные регистраторы.
		//
		//// Дисплеи покупателя
		//Если ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолДисплеиПокупателя Тогда
		//	Возврат ПодключаемоеОборудованиеАтолДисплеиПокупателяКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодДисплеиПокупателя Тогда
		//	Возврат ПодключаемоеОборудованиеСканкодДисплеиПокупателяКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМДисплеиПокупателя Тогда
		//	Возврат ПодключаемоеОборудованиеШтрихМДисплеиПокупателяКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикККСДисплеиПокупателя Тогда
		//	Возврат ПодключаемоеОборудованиеККСДисплеиПокупателяКлиент;
		//КонецЕсли;
		//// Конец Дисплеи покупателя
		//
		//// Терминалы сбора данных
		//Если ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолТерминалыСбораДанных Тогда
		//	Возврат ПодключаемоеОборудованиеАтолТерминалыСбораДанныхКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМТерминалыСбораДанных Тогда
		//	Возврат ПодключаемоеОборудованиеШтрихМТерминалыСбораДанныхКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодТерминалыСбораДанных Тогда
		//	Возврат ПодключаемоеОборудованиеСканкодТерминалыСбораДанныхКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканситиТерминалыСбораДанных Тогда
		//	Возврат ПодключаемоеОборудованиеСканситиТерминалыСбораДанныхКлиент;
		//КонецЕсли;
		//// Конец Терминалы сбора данных.
		//
		//// Эквайринговые терминалы
		//Если ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСБРФЭквайринговыеТерминалы Тогда
		//	Возврат ПодключаемоеОборудованиеСБРФЭквайринговыеТерминалыКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикИНПАСЭквайринговыеТерминалыSmart Тогда
		//	Возврат ПодключаемоеОборудованиеИНПАСЭквайринговыеТерминалыSmartКлиент;
		//КонецЕсли;
		//// Конец Эквайринговые терминалы.
		//
		//// Электронные весы
		//Если ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолЭлектронныеВесы Тогда
		//	Возврат ПодключаемоеОборудованиеАтолЭлектронныеВесыКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМЭлектронныеВесы Тогда
		//	Возврат ПодключаемоеОборудованиеШтрихМЭлектронныеВесыКлиент;
		//КонецЕсли;
		//// Конец Электронные весы
		//
		//// Весы с печатью этикеток
		//Если ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикACOMВесыСПечатьюЭтикеток Тогда
		//	Возврат ПодключаемоеОборудованиеACOMВесыСПечатьюЭтикетокКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМВесыСПечатьюЭтикеток Тогда
		//	Возврат ПодключаемоеОборудованиеШтрихМВесыСПечатьюЭтикетокКлиент;
		//КонецЕсли;
		//// Конец Весы с печатью этикеток.
		//
		//// ККМ Офлайн
		Если ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолККМOffline Тогда
			Возврат ОфлайнОборудованиеАтолККМСервер;
		//	Возврат ОфлайнОборудованиеАтолККМКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМККМOffline Тогда
		//	Возврат ОфлайнОборудованиеШтрихМККМКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СККМOffline Тогда
		//	Возврат ОфлайнОборудование1СККМКлиент;
		//ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СЭвоторККМOffline Тогда
		//	Возврат ОфлайнОборудование1СЭвоторКлиент;
		ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикPOSFrontol Тогда
			Возврат ОфлайнОборудованиеPOSFrontolКлиентСервер;
		ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикPOSСуперМАГ Тогда
			Возврат ОфлайнОборудованиеPOSСуперМАГКлиентСервер;
		ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикPOSУКМ5 Тогда
			Возврат УКМ5КлиентСервер;			
		ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикPOSПрофиТ Тогда
			Возврат ОфлайнОборудованиеPOSПрофиТКлиентСервер;
		ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикDIGIВесыСПечатьюЭтикеток Тогда
			Возврат ПодключаемоеОборудованиеDIGIВесыСПечатьюЭтикетокКлиентСервер;
		ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикFalconВесыСПечатьюЭтикеток Тогда
			Возврат ПодключаемоеОборудованиеFalconВесыСПечатьюЭтикетокКлиентСервер;
		ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикMettlerВесыСПечатьюЭтикеток Тогда
			Возврат ПодключаемоеОборудованиеMettlerВесыСПечатьюЭтикетокКлиентСервер;
		ИначеЕсли ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикDIGIВесыСПечатьюЭтикетокNew Тогда
			Возврат ПодключаемоеОборудованиеDIGIВесыСПечатьюЭтикетокNewКлиентСервер;
		КонецЕсли;
		// Конец ККМ Офлайн
		
		// Web-сервис оборудование
		Если ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СWebСервисОборудование Тогда
			Возврат Неопределено;
		КонецЕсли;
		// Конец Web-сервис оборудование
		
		//Мальцев А.Ю. +++ Обработчик VRM
		Если ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикVRM Тогда
			Возврат ОфлайнОборудованиеVRMКлиентСервер;
		КонецЕсли;
		//Мальцев А.Ю. --- Обработчик VRM
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

//Процедура НачатьОчисткуПрайсЛистаНаККМ(ИдентификаторУстройства,
//	ОтображатьСообщения = Истина) Экспорт
//	
//	НачатьОчисткуТоваровВККМOffline(ИдентификаторУстройства, ОтображатьСообщения);
//	
//КонецПроцедуры

Процедура ЗагрузитьДанныеИзОборудования(ДрайвераПодключаемогоОборудования, СписокПодключений, ИдентификаторУстройства, ОтображатьСообщения = Истина) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОтображатьСообщения",     ОтображатьСообщения);
	Контекст.Вставить("ПараметрыДанных",         Неопределено);
	Контекст.Вставить("Команда",                 "ЗагрузитьДанные");
	Контекст.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	
	Если ИдентификаторУстройства = Неопределено Тогда
		Возврат;
	Иначе
		НачатьЗагрузкуДанных(ДрайвераПодключаемогоОборудования, СписокПодключений, Контекст);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаТоваров

Функция ПолучитьТаблицуНалогов(ЭтоКлиент = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтавкиНДС.Ставка КАК СтавкаНДС
	|ИЗ
	|	Справочник.СтавкиНДС КАК СтавкиНДС";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаписьНалог = Неопределено;
	Если ЭтоКлиент Тогда
		НалогиКВыгрузке = Новый Массив;
		Пока Выборка.Следующий() Цикл
			ЗаписьНалог = ПолучитьЗаписьНалога();
			ЗаписьНалог.СтавкаНДС           = Выборка.СтавкаНДС;
			
			НалогиКВыгрузке.Добавить(ЗаписьНалог);
		КонецЦикла;
	Иначе
		НалогиКВыгрузке = Новый ТаблицаЗначений;
		
		ЗаписьНалог = ПолучитьЗаписьНалога();
		Для Каждого ТекущееПоле Из ЗаписьНалог Цикл
			Если ТекущееПоле.Значение = Неопределено Тогда
				НалогиКВыгрузке.Колонки.Добавить(ТекущееПоле.Ключ);
			Иначе
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипЗнч(ТекущееПоле.Значение));
				ТипКолонки = Новый ОписаниеТипов(МассивТипов);
				НалогиКВыгрузке.Колонки.Добавить(ТекущееПоле.Ключ, ТипКолонки);
			КонецЕсли;
		КонецЦикла;
		
		Пока Выборка.Следующий() Цикл
			ЗаписьНалог = НалогиКВыгрузке.Добавить();
			ЗаписьНалог.СтавкаНДС           = Выборка.СтавкаНДС;
		КонецЦикла;
	КонецЕсли;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат НалогиКВыгрузке;
	
КонецФункции

Функция ПолучитьТаблицуГруппТоваров(Оборудование, ЭтоКлиент = Истина, МоментПоследнейЗагрузки, ВыгружатьГруппыПоКоду = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|	ЕСТЬNULL(Ссылка."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель1,
	|	""0"" КАК Родитель2,
	|	""0"" КАК Родитель3,
	|	""0"" КАК Родитель4,
	|	""0"" КАК Родитель5,
	|	Наименование КАК Наименование,
	|	"+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+" КАК КодГруппы,
	|	ВЫБОР КОГДА ЕСТЬNULL(Родитель,ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))=ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА ""0"" ИНАЧЕ ЕСТЬNULL(Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КОНЕЦ КАК КодРодителя
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	ЭтоГруппа И Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
    |
	|ВЫБРАТЬ 
	|	ЕСТЬNULL(Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель1,
	|	ЕСТЬNULL(Ссылка."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель2,
	|	""0"" КАК Родитель3,
	|	""0"" КАК Родитель4,
	|	""0"" КАК Родитель5,
	|	Наименование КАК Наименование,
	|	"+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+" КАК КодГруппы,
	|	ВЫБОР КОГДА ЕСТЬNULL(Родитель,ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))=ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА ""0"" ИНАЧЕ ЕСТЬNULL(Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КОНЕЦ КАК КодРодителя
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	ЭтоГруппа И Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
    |
	|ВЫБРАТЬ 
	|	ЕСТЬNULL(Родитель.Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель1,
	|	ЕСТЬNULL(Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель2,
	|	ЕСТЬNULL(Ссылка."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель3,
	|	""0"" КАК Родитель4,
	|	""0"" КАК Родитель5,
	|	Наименование КАК Наименование,
	|	"+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+" КАК КодГруппы,
	|	ВЫБОР КОГДА ЕСТЬNULL(Родитель,ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))=ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА ""0"" ИНАЧЕ ЕСТЬNULL(Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КОНЕЦ КАК КодРодителя
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	ЭтоГруппа И Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
    |
	|ОБЪЕДИНИТЬ ВСЕ
    |
	|ВЫБРАТЬ 
	|	ЕСТЬNULL(Родитель.Родитель.Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель1,
	|	ЕСТЬNULL(Родитель.Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель2,
	|	ЕСТЬNULL(Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель3,
	|	ЕСТЬNULL(Ссылка."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель4,
	|	""0"" КАК Родитель5,
	|	Наименование КАК Наименование,
	|	"+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+" КАК КодГруппы,
	|	ВЫБОР КОГДА ЕСТЬNULL(Родитель,ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))=ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА ""0"" ИНАЧЕ ЕСТЬNULL(Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КОНЕЦ КАК КодРодителя
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	ЭтоГруппа И Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
    |
	|ОБЪЕДИНИТЬ ВСЕ
    |
	|ВЫБРАТЬ 
	|	ЕСТЬNULL(Родитель.Родитель.Родитель.Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель1,
	|	ЕСТЬNULL(Родитель.Родитель.Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель2,
	|	ЕСТЬNULL(Родитель.Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель3,
	|	ЕСТЬNULL(Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель4,
	|	ЕСТЬNULL(Ссылка."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель5,
	|	Наименование КАК Наименование,
	|	"+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+" КАК КодГруппы,
	|	ВЫБОР КОГДА ЕСТЬNULL(Родитель,ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))=ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА ""0"" ИНАЧЕ ЕСТЬNULL(Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КОНЕЦ КАК КодРодителя
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	ЭтоГруппа И Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
    |
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Родитель.Родитель.Родитель.Родитель.Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель1,
	|	ЕСТЬNULL(Родитель.Родитель.Родитель.Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель2,
	|	ЕСТЬNULL(Родитель.Родитель.Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель3,
	|	ЕСТЬNULL(Родитель.Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель4,
	|	ЕСТЬNULL("+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КАК Родитель5,
	|	Наименование КАК Наименование,
	|	"+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+" КАК КодГруппы,
	|	ВЫБОР КОГДА ЕСТЬNULL(Родитель.Родитель,ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))=ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ТОГДА ""0"" ИНАЧЕ ЕСТЬNULL(Родитель.Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",""0"") КОНЕЦ КАК КодРодителя
	|ИЗ
	|	(
	|	ВЫБРАТЬ
	|		"+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+",
	|		Ссылка,
	|		Наименование,
	|		ВЫБОР
	|			КОГДА Родитель В (ВЫБРАТЬ Ссылка ИЗ Справочник.Номенклатура ГДЕ ЭтоГруппа И Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) ТОГДА Родитель
	|			КОГДА Родитель.Родитель В (ВЫБРАТЬ Ссылка ИЗ Справочник.Номенклатура ГДЕ ЭтоГруппа И Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) ТОГДА Родитель.Родитель
	|			КОГДА Родитель.Родитель.Родитель В (ВЫБРАТЬ Ссылка ИЗ Справочник.Номенклатура ГДЕ ЭтоГруппа И Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) ТОГДА Родитель.Родитель.Родитель
	|			КОГДА Родитель.Родитель.Родитель.Родитель В (ВЫБРАТЬ Ссылка ИЗ Справочник.Номенклатура ГДЕ ЭтоГруппа И Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) ТОГДА Родитель.Родитель.Родитель.Родитель
	|			КОГДА Родитель.Родитель.Родитель.Родитель.Родитель В (ВЫБРАТЬ Ссылка ИЗ Справочник.Номенклатура ГДЕ ЭтоГруппа И Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) ТОГДА Родитель.Родитель.Родитель.Родитель.Родитель
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		КОНЕЦ КАК Родитель
	|	ИЗ
	|		Справочник.Номенклатура
	|	ГДЕ
	|		ЭтоГруппа
	|		И Родитель.Родитель.Родитель.Родитель.Родитель<>ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	) КАК Группы6
	|
	|УПОРЯДОЧИТЬ ПО Родитель1,Родитель2,Родитель3,Родитель4,Родитель5";
	//ЗапросГруппы.УстановитьПараметр("ПустойРодитель",Справочники.Номенклатура.ПустаяСсылка());
	
	ТаблицаГрупп = Запрос.Выполнить().Выгрузить();
	
	ЗаписьГруппыТовара = Неопределено;
	Если ЭтоКлиент Тогда
		ГруппыТоваровКВыгрузке = Новый Массив;
		Для Каждого СтрокаДанных Из ТаблицаГрупп Цикл
			
			ЗаписьГруппыТовара = ПолучитьЗаписьГруппыТовара();
			ЗаписьГруппыТовара.Код = СОКРЛП(СтрокаДанных.КодГруппы);
			ЗаписьГруппыТовара.КодРодителя = СтрокаДанных.КодРодителя;
			ЗаписьГруппыТовара.Наименование = СтрокаДанных.Наименование;
		
			ГруппыТоваровКВыгрузке.Добавить(ЗаписьГруппыТовара);
		КонецЦикла;
	Иначе
		
		ГруппыТоваровКВыгрузке = Новый ТаблицаЗначений;
		
		ЗаписьГруппыТовара = ПолучитьЗаписьГруппыТовара();
		Для Каждого ТекущееПоле Из ЗаписьГруппыТовара Цикл
			Если ТекущееПоле.Значение = Неопределено Тогда
				ГруппыТоваровКВыгрузке.Колонки.Добавить(ТекущееПоле.Ключ);
			Иначе
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипЗнч(ТекущееПоле.Значение));
				ТипКолонки = Новый ОписаниеТипов(МассивТипов);
				ГруппыТоваровКВыгрузке.Колонки.Добавить(ТекущееПоле.Ключ, ТипКолонки);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаДанных Из ТаблицаГрупп Цикл
			
			ЗаписьГруппыТовара = ГруппыТоваровКВыгрузке.Добавить();
			ЗаписьГруппыТовара.Код = СОКРЛП(СтрокаДанных.КодГруппы);
			ЗаписьГруппыТовара.КодРодителя = СтрокаДанных.КодРодителя;
			ЗаписьГруппыТовара.Наименование = СтрокаДанных.Наименование;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ГруппыТоваровКВыгрузке;
	
КонецФункции

Функция ПолучитьТаблицуТоваров(Оборудование, ПолнаяВыгрузка, ЭтоКлиент = Истина, МоментПоследнейЗагрузки, ВыгружатьГруппыПоКоду=Истина, ВыгружатьОстатки=Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипЦен                = Оборудование.ОсновнойОтдел.ТипЦенРозничнойТорговли;
	ПодразделениеКомпании = Оборудование.ОсновнойОтдел.ПодразделениеКомпании;
	ГруппаТоваров         = Оборудование.ГруппаТоваровОборудования;
	МоментИзменения       = МоментПоследнейЗагрузки;
	ТекущаяДата           = ТекущаяДатаСеанса();
	ЗалОбслуживания       = Оборудование.ОсновнойОтдел;
	
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ТоварыВОборудовании.Номенклатура КАК Номенклатура
	//|ИЗ
	//|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	//|	РегистрСведений.Цены КАК Цены
	//|ПО
	//|	ТоварыВОборудовании.Номенклатура = Цены.Номенклатура И 
	//|	Цены.ТипЦен = &ТипЦен И 
	//|	Цены.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
	//|	Цены.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И 
	//|	Цены.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка) И 
	//|	ТоварыВОборудовании.МоментИзменения < Цены.Период
	//|ГДЕ
	//|	ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваров И 
	//|	ТоварыВОборудовании.МоментИзменения < Цены.Период И 
	//|	ТоварыВОборудовании.ВыполненаПечатьЦенников = Истина И 
	//|	Цены.ТипЦен = &ТипЦен И 
	//|	Цены.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
	//|	Цены.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И 
	//|	Цены.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	//|	Цены.НачалоДействия >= &ТекущаяДата И 
	//|	Цены.Активность И 
	//|	Цены.ПодразделениеКомпании = &ПодразделениеКомпании
	//|";
	//
	
	МаксимальныйУровень = 1;
	Подразделения = Новый Массив;
	ТекущееПодразделение = Оборудование.ОсновнойОтдел.ПодразделениеКомпании;
	Пока ЗначениеЗаполнено(ТекущееПодразделение) Цикл
		Подразделения.Добавить(ТекущееПодразделение);
		ТекущееПодразделение = ТекущееПодразделение.Родитель;
		МаксимальныйУровень = МаксимальныйУровень + 1;
	КонецЦикла;
	
	Подразделения.Добавить(Справочники.ПодразделенияКомпании.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделения",         Подразделения);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("МоментИзменения",       МоментИзменения);
	Запрос.УстановитьПараметр("ТекущаяДата",           ТекущаяДата);
	Запрос.УстановитьПараметр("ТипЦен",                ТипЦен);
	Запрос.УстановитьПараметр("ГруппаТоваров",         ГруппаТоваров);
	Запрос.УстановитьПараметр("ЗалОбслуживания",       ЗалОбслуживания);
	Запрос.УстановитьПараметр("СостояниеБлокировки",   Перечисления.итСостояниеБлокировкиТоваров.Блокировка);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыВОборудовании.Номенклатура КАК Номенклатура
	//|	Цены.Период,
	//|	Цены.ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Цены КАК Цены
	|ПО
	|	ТоварыВОборудовании.Номенклатура = Цены.Номенклатура И 
	|	Цены.ТипЦен = &ТипЦен И 
	|	Цены.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
	|	Цены.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И 
	|	Цены.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка) И 
	|	ТоварыВОборудовании.МоментИзменения < Цены.Период
	|ГДЕ
	|	ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваров И 
	|	ТоварыВОборудовании.МоментИзменения < Цены.Период И 
	|	ТоварыВОборудовании.ВыполненаПечатьЦенников = Истина И 
	|	Цены.ТипЦен = &ТипЦен И 
	|	Цены.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
	|	Цены.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И 
	|	Цены.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка) И 
	|	Цены.Период <= &ТекущаяДата И 
	|	Цены.Активность И 
	|	Цены.ПодразделениеКомпании В (&ПодразделениеКомпании)
	|";
	
	
	НаборЗаписей = РегистрыСведений.ТоварыВОборудовании.СоздатьНаборЗаписей();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей.Отбор.ГруппаТоваров.Установить(ГруппаТоваров);
		НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
		НаборЗаписей.Прочитать();
		Для Каждого ТекущаяЗапись ИЗ НаборЗаписей Цикл
			ТекущаяЗапись.МоментИзменения = ТекущаяДатаСеанса();
		КонецЦикла;
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкидкиВОборудовании.Номенклатура КАК Номенклатура,
	|	СкидкиВОборудовании.НачалоДействия,
	|	СкидкиВОборудовании.КонецДействия,
	|	СкидкиВОборудовании.Скидка,
	|	СкидкиВОборудовании.Свойство,
	|	ИСТИНА КАК Действует
	|ИЗ
	|	РегистрСведений.СкидкиВОборудовании КАК СкидкиВОборудовании
	|ГДЕ
	|	СкидкиВОборудовании.ПодразделениеКомпании = &ПодразделениеКомпании И 
	|	СкидкиВОборудовании.МоментИзменения < &МоментИзменения И 
	|	СкидкиВОборудовании.СпособВычисления = ЗНАЧЕНИЕ(Перечисление.СкидкиСпособВычисления.ФиксированнаяЦена) И 
	|	СкидкиВОборудовании.Действует И 
	|	СкидкиВОборудовании.МоментИзменения < СкидкиВОборудовании.НачалоДействия И 
	|	СкидкиВОборудовании.НачалоДействия <= &ТекущаяДата И 
	|	(НЕ СкидкиВОборудовании.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаШтрихкодТовара))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкидкиВОборудовании.Номенклатура КАК Номенклатура,
	|	СкидкиВОборудовании.НачалоДействия,
	|	СкидкиВОборудовании.КонецДействия,
	|	СкидкиВОборудовании.Скидка,
	|	СкидкиВОборудовании.Свойство,
	|	ЛОЖЬ КАК Действует
	|ИЗ
	|	РегистрСведений.СкидкиВОборудовании КАК СкидкиВОборудовании
	|ГДЕ
	|	СкидкиВОборудовании.ПодразделениеКомпании = &ПодразделениеКомпании И 
	|	СкидкиВОборудовании.МоментИзменения < &МоментИзменения И 
	|	СкидкиВОборудовании.СпособВычисления = ЗНАЧЕНИЕ(Перечисление.СкидкиСпособВычисления.ФиксированнаяЦена) И 
	|	СкидкиВОборудовании.Действует И 
	|	СкидкиВОборудовании.МоментИзменения < СкидкиВОборудовании.КонецДействия И 
	|	СкидкиВОборудовании.КонецДействия <= &ТекущаяДата И 
	|	(НЕ СкидкиВОборудовании.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаШтрихкодТовара))
	|";
	
	НаборЗаписей = РегистрыСведений.СкидкиВОборудовании.СоздатьНаборЗаписей();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
		НаборЗаписей.Отбор.НачалоДействия.Установить(Выборка.НачалоДействия);
		НаборЗаписей.Отбор.КонецДействия.Установить(Выборка.КонецДействия);
		НаборЗаписей.Отбор.Скидка.Установить(Выборка.Скидка);
		НаборЗаписей.Отбор.Свойство.Установить(Выборка.Свойство);
		НаборЗаписей.Прочитать();
		Для Каждого ТекущаяЗапись ИЗ НаборЗаписей Цикл
			
			ТекущаяЗапись.Действует       = Выборка.Действует;
			ТекущаяЗапись.МоментИзменения = ТекущаяДатаСеанса();
		КонецЦикла;
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
	
	//МаксимальныйУровень = 1;
	//Подразделения = Новый Массив;
	//ТекущееПодразделение = Оборудование.ОсновнойОтдел.ПодразделениеКомпании;
	//Пока ЗначениеЗаполнено(ТекущееПодразделение) Цикл
	//	Подразделения.Добавить(ТекущееПодразделение);
	//	ТекущееПодразделение = ТекущееПодразделение.Родитель;
	//	МаксимальныйУровень = МаксимальныйУровень + 1;
	//КонецЦикла;
	//
	//Подразделения.Добавить(Справочники.ПодразделенияКомпании.ПустаяСсылка());
	
	Уровень             = 1;
	ТекстЗапросаЦен     = "";
	ТекстПоказателяЦены = "";
	Для Каждого ТекущееПодразделение Из Подразделения Цикл
		
		ТекстУровня = Строка(Уровень);
		
		Запрос.УстановитьПараметр("ПодразделениеКомпании" + ТекстУровня, ТекущееПодразделение);
		
		ТекстПоказателяЦены = ТекстПоказателяЦены + "
		|		КОГДА МИНИМУМ(ВложенныйЗапрос.Приоритет)="+ТекстУровня+" ТОГДА
		|			МАКСИМУМ(ВложенныйЗапрос.Цена"+ТекстУровня+")";
		
		ТекстВыборкиЦены = "";
		ВложенныйУровень = 1;
		Пока ВложенныйУровень <= МаксимальныйУровень Цикл
			ТекстВыборкиЦены = ТекстВыборкиЦены + ",
			|	" + ?(ВложенныйУровень = Уровень, "ЦеныСрезПоследних.Цена", "0")+" КАК Цена"+Строка(ВложенныйУровень);
			ВложенныйУровень = ВложенныйУровень + 1;
		КонецЦикла;
		
		ТекстЗапросаЦен = ТекстЗапросаЦен + ?(Уровень = 1, "", Символы.ПС+" ОБЪЕДИНИТЬ ВСЕ") + "
		|ВЫБРАТЬ
		|	ЦеныСрезПоследних.Номенклатура,
		|	ВЫБОР
		|		КОГДА ЦеныСрезПоследних.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) ТОГДА
		|			ЦеныСрезПоследних.Номенклатура.ОсновнаяЕдиницаИзмерения
		|		ИНАЧЕ
		|			ЦеныСрезПоследних.ЕдиницаИзмерения
		|	КОНЕЦ КАК ЕдиницаИзмерения,
		|	" + ТекстУровня + " КАК Приоритет" + ТекстВыборкиЦены + "
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(&ТекущаяДата,
		|		ТипЦен = &ТипЦен
		|		И ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|		И ПодразделениеКомпании = &ПодразделениеКомпании" + ТекстУровня +"
		|		И Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|		И ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		|		И Номенклатура В (ВЫБРАТЬ ТоварыВОборудовании.Номенклатура ИЗ ТоварыВОборудовании)) КАК ЦеныСрезПоследних";
		
		Уровень = Уровень + 1;
		
	КонецЦикла;
	
	ТекстЗапросаЦены = "
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ЕдиницаИзмерения,
	|	ВЫБОР
	|		"+ТекстПоказателяЦены+"
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ
	|	ТаблицаЦен
	|ИЗ
	|	("+ТекстЗапросаЦен+") КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ЕдиницаИзмерения
	|";
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыВОборудовании.Номенклатура КАК Номенклатура,
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(Штрихкоды.ЕдиницаИзмерения.Коэффициент, 1) КАК Кратность
	|ПОМЕСТИТЬ
	|	ТоварыВОборудовании
	|ИЗ
	|	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ПО
	|	ТоварыВОборудовании.Номенклатура = Штрихкоды.Объект И 
	|	ШтрихКоды.Запрет = ЛОЖЬ 
	|ГДЕ
	|	ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваров
	|	И ТоварыВОборудовании.МоментИзменения >= &МоментИзменения
	|	И ТоварыВОборудовании.ВыполненаПечатьЦенников = Истина
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкидкиВОборудовании.Номенклатура КАК Номенклатура,
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(Штрихкоды.ЕдиницаИзмерения.Коэффициент, 1) КАК Кратность
	|ИЗ
	|	РегистрСведений.СкидкиВОборудовании КАК СкидкиВОборудовании
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ПО
	|	СкидкиВОборудовании.Номенклатура = Штрихкоды.Объект И 
	|	ШтрихКоды.Запрет = ЛОЖЬ 
	|ГДЕ
	|	СкидкиВОборудовании.ПодразделениеКомпании = &ПодразделениеКомпании И 
	|	СкидкиВОборудовании.МоментИзменения >= &МоментИзменения И 
	|	СкидкиВОборудовании.СпособВычисления = ЗНАЧЕНИЕ(Перечисление.СкидкиСпособВычисления.ФиксированнаяЦена) И 
	//|	СкидкиВОборудовании.Действует И 
	//|	(СкидкиВОборудовании.НачалоДействия <= &МоментИзменения ИЛИ 
	//|	СкидкиВОборудовании.НачалоДействия = ДатаВремя(1,1,1)) И 
	//|	(СкидкиВОборудовании.КонецДействия >= &МоментИзменения ИЛИ 
	//|	СкидкиВОборудовании.КонецДействия = ДатаВремя(1,1,1)) И 
	|	(НЕ СкидкиВОборудовании.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаШтрихкодТовара))
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СкидкиВОборудовании.НачалоДействия,
	|	СкидкиВОборудовании.ЗначениеСкидки КАК ЗначениеСкидки,
	|	СкидкиВОборудовании.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ
	|	СкидкиВОборудовании
	|ИЗ
	|	РегистрСведений.СкидкиВОборудовании КАК СкидкиВОборудовании
	|ГДЕ
	|	СкидкиВОборудовании.ПодразделениеКомпании = &ПодразделениеКомпании И 
	|	СкидкиВОборудовании.Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ТоварыВОборудовании) И 
	//|	СкидкиВОборудовании.МоментИзменения >= &МоментИзменения И 
	|	СкидкиВОборудовании.СпособВычисления = ЗНАЧЕНИЕ(Перечисление.СкидкиСпособВычисления.ФиксированнаяЦена) И 
	|	СкидкиВОборудовании.Действует И 
	|	(СкидкиВОборудовании.НачалоДействия <= &МоментИзменения ИЛИ 
	|	СкидкиВОборудовании.НачалоДействия = ДатаВремя(1,1,1)) И 
	|	(СкидкиВОборудовании.КонецДействия >= &МоментИзменения ИЛИ 
	|	СкидкиВОборудовании.КонецДействия = ДатаВремя(1,1,1)) И 
	|	(НЕ СкидкиВОборудовании.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаШтрихкодТовара))
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаСкидок.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ТаблицаСкидок.НачалоДействия) КАК НачалоДействия
	|ПОМЕСТИТЬ
	|	ТаблицаСкидокСрез
	|ИЗ
	|	СкидкиВОборудовании КАК ТаблицаСкидок
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСкидок.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаСкидокСрез.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(ТаблицаСкидок.ЗначениеСкидки) КАК Скидка
	|ПОМЕСТИТЬ
	|	ТаблицаСкидок
	|ИЗ
	|	ТаблицаСкидокСрез КАК ТаблицаСкидокСрез
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	СкидкиВОборудовании КАК ТаблицаСкидок
	|ПО
	|	ТаблицаСкидок.Номенклатура = ТаблицаСкидокСрез.Номенклатура И 
	|	ТаблицаСкидок.НачалоДействия = ТаблицаСкидокСрез.НачалоДействия
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСкидокСрез.Номенклатура
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыВОборудовании.Номенклатура.Родитель КАК Номенклатура
	|ПОМЕСТИТЬ
	|	ГруппыТоваров
	|ИЗ
	|	ТоварыВОборудовании КАК ТоварыВОборудовании
	|;
	|
	|ВЫБРАТЬ
	|	ГруппыТоваров.Номенклатура.ОсобенностьУчета КАК ОсобенностьУчета,
	|	ГруппыТоваров.Номенклатура КАК Номенклатура,
	|	0 КАК Приоритет
	|ПОМЕСТИТЬ
	|	ТаблицаИерархии
	|ИЗ
	|	ГруппыТоваров КАК ГруппыТоваров
	|ГДЕ
	|	ГруппыТоваров.Номенклатура.ПометкаУдаления = Ложь И 
	|	(НЕ ГруппыТоваров.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Справочник.ОсобенностиУчетаНоменклатуры.ПустаяСсылка))
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктураИерархииНоменклатуры.Группа.ОсобенностьУчета КАК ОсобенностьУчета,
	|	ГруппыТоваров.Номенклатура КАК Номенклатура,
	|	СтруктураИерархииНоменклатуры.Порядок КАК Приоритет
	|ИЗ
	|	ГруппыТоваров КАК ГруппыТоваров
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтруктураИерархииНоменклатуры КАК СтруктураИерархииНоменклатуры
	|ПО
	|	ГруппыТоваров.Номенклатура = СтруктураИерархииНоменклатуры.Номенклатура
	|ГДЕ
	|	(НЕ СтруктураИерархииНоменклатуры.Группа.ОсобенностьУчета = ЗНАЧЕНИЕ(Справочник.ОсобенностиУчетаНоменклатуры.ПустаяСсылка))
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаИерархии.Номенклатура КАК Номенклатура,
	|	МИНИМУМ(ТаблицаИерархии.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ
	|	ТаблицаИерархииСрез
	|ИЗ
	|	ТаблицаИерархии КАК ТаблицаИерархии
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИерархии.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаИерархииСрез.Номенклатура КАК Номенклатура,
	|	ТаблицаИерархии.ОсобенностьУчета КАК ОсобенностьУчета
	|ПОМЕСТИТЬ
	|	ОсобенностиУчетаПоГруппам
	|ИЗ
	|	ТаблицаИерархииСрез КАК ТаблицаИерархииСрез
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаИерархии КАК ТаблицаИерархии
	|ПО
	|	ТаблицаИерархии.Номенклатура = ТаблицаИерархииСрез.Номенклатура И 
	|	ТаблицаИерархии.Приоритет = ТаблицаИерархииСрез.Приоритет
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаИерархии
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаИерархииСрез
	|;
	| " + ТекстЗапросаЦены + "
	//|ВЫБРАТЬ
	//|	ЦеныСрезПоследних.Номенклатура,
	//|	ЦеныСрезПоследних.ЕдиницаИзмерения,
	//|	ЦеныСрезПоследних.Цена
	//|ПОМЕСТИТЬ
	//|	ТаблицаЦен
	//|ИЗ
	//|	РегистрСведений.Цены.СрезПоследних(,
	//|		ТипЦен = &ТипЦен
	//|		И ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	//|		И ПодразделениеКомпании = &ПодразделениеКомпании
	//|		И Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	//|		И ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	//|		И Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ТоварыВОборудовании)) КАК ЦеныСрезПоследних
	|;
	|
	|ВЫБРАТЬ
	|	УценкаТовара.Номенклатура,
	|	УценкаТовара.ШтрихКод,
	|	УценкаТовара.Приоритет,
	|	&ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	МАКСИМУМ(УценкаТовара.Период) КАК Период
	|ПОМЕСТИТЬ
	|	СрезУценкаТовара
	|ИЗ
	|	РегистрСведений.УценкаТовара КАК УценкаТовара
	|ГДЕ
	|	УценкаТовара.ПодразделениеКомпании = &ПодразделениеКомпании 
	|	И УценкаТовара.Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ТоварыВОборудовании)
	|	И (УценкаТовара.ЗалОбслуживания = ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка) ИЛИ 
	|		УценкаТовара.ЗалОбслуживания = &ЗалОбслуживания)
	|	И УценкаТовара.Действует
	|СГРУППИРОВАТЬ ПО
	|	УценкаТовара.Номенклатура,
	|	УценкаТовара.ШтрихКод,
	|	УценкаТовара.Приоритет
	|;
	|
	|ВЫБРАТЬ
	|	СрезУценкаТовара.Номенклатура,
	|	СрезУценкаТовара.ШтрихКод,
	|	УценкаТовара.ЗначениеСкидки,
	|	УценкаТовара.СпособВычисления,
	|	УценкаТовара.Приоритет,
	|	УценкаТовара.ВариантОкругления
	|ПОМЕСТИТЬ
	|	УценкаТовараСПриоритетом
	//|	УценкаТовара
	|ИЗ
	|	СрезУценкаТовара КАК СрезУценкаТовара
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.УценкаТовара КАК УценкаТовара
	|ПО
	|	СрезУценкаТовара.Номенклатура = УценкаТовара.Номенклатура И 
	|	СрезУценкаТовара.ШтрихКод = УценкаТовара.ШтрихКод И 
	|	СрезУценкаТовара.Период = УценкаТовара.Период И 
	|	СрезУценкаТовара.Приоритет = УценкаТовара.Приоритет И 
	|	СрезУценкаТовара.ПодразделениеКомпании = УценкаТовара.ПодразделениеКомпании И 
	|	УценкаТовара.Действует
	|ГДЕ
	|	(УценкаТовара.ЗалОбслуживания = ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка) ИЛИ 
	|	УценкаТовара.ЗалОбслуживания = &ЗалОбслуживания)
	|;
	|
	|ВЫБРАТЬ
	|	УценкаТовара.Номенклатура,
	|	УценкаТовара.ШтрихКод,
	|	МАКСИМУМ(УценкаТовара.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ
	|	СрезУценкаТовараСПриоритетом
	|ИЗ
	|	УценкаТовараСПриоритетом КАК УценкаТовара
	|СГРУППИРОВАТЬ ПО
	|	УценкаТовара.Номенклатура,
	|	УценкаТовара.ШтрихКод
	|;
	|
	|ВЫБРАТЬ
	|	СрезУценкаТовара.Номенклатура,
	|	СрезУценкаТовара.ШтрихКод,
	|	УценкаТовара.ЗначениеСкидки,
	|	УценкаТовара.СпособВычисления,
	|	УценкаТовара.ВариантОкругления
	|ПОМЕСТИТЬ
	|	УценкаТовара
	|ИЗ
	|	СрезУценкаТовараСПриоритетом КАК СрезУценкаТовара
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	УценкаТовараСПриоритетом КАК УценкаТовара
	|ПО
	|	СрезУценкаТовара.Номенклатура = УценкаТовара.Номенклатура И 
	|	СрезУценкаТовара.ШтрихКод = УценкаТовара.ШтрихКод И 
	|	СрезУценкаТовара.Приоритет = УценкаТовара.Приоритет
	|;
	|
	|ВЫБРАТЬ
	|	УценкаТовара.Номенклатура,
	|	УценкаТовара.ШтрихКод,
	|	ИСТИНА КАК Удален
	|ПОМЕСТИТЬ
	|	УдаленнаяУценкаТовара
	|ИЗ
	|	РегистрСведений.УценкаТовара КАК УценкаТовара
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	СрезУценкаТовара КАК СрезУценкаТовара
	|ПО
	|	УценкаТовара.Номенклатура = СрезУценкаТовара.Номенклатура И 
	|	УценкаТовара.Действует = ЛОЖЬ
	|ГДЕ
	|	УценкаТовара.ПодразделениеКомпании = &ПодразделениеКомпании 
	|	И (УценкаТовара.ЗалОбслуживания = ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка) ИЛИ 
	|		УценкаТовара.ЗалОбслуживания = &ЗалОбслуживания) И 
	|	УценкаТовара.Действует = ЛОЖЬ
	|СГРУППИРОВАТЬ ПО
	|	УценкаТовара.Номенклатура,
	|	УценкаТовара.ШтрихКод
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА УценкаТовара.ШтрихКод = СрезУценкаТовара.ШтрихКод ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ) = ЛОЖЬ
	|;
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	Номенклатура.ВидАлкогольнойПродукции.Родитель КАК ГруппаГАК,
	|	Номенклатура.ВидАлкогольнойПродукции.Родитель.итНомерГруппыГАК КАК НомерГруппыГАК,
	|	Номенклатура.ВидАлкогольнойПродукции.Родитель.итУдельныйОбъем КАК УдельныйОбъем,
	|	Номенклатура.Крепость КАК Крепость,
	|	Номенклатура.Объем КАК Объем,
	|	Номенклатура.ЕРПМастерКлюч КАК ЕРПМастерКлюч,
	|	Номенклатура.Код КАК Код
	|ПОМЕСТИТЬ втНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В
	|			(ВЫБРАТЬ
	|				ТоварыВОборудовании.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ТоварыВОборудовании КАК ТоварыВОборудовании)
	|	И Номенклатура.ВидАлкогольнойПродукции <> ЗНАЧЕНИЕ(Справочник.ВидыАлкогольнойПродукции.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итУдельныеРозничныеЦеныСрезПоследних.Группа КАК Группа,
	|	итУдельныеРозничныеЦеныСрезПоследних.Крепость КАК Крепость,
	|	итУдельныеРозничныеЦеныСрезПоследних.УдельнаяЦена КАК УдельнаяЦена
	|ПОМЕСТИТЬ втУдельныеЦены
	|ИЗ
	|	РегистрСведений.итУдельныеРозничныеЦены.СрезПоследних(&ТекущаяДата, ) КАК итУдельныеРозничныеЦеныСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф.Ссылка КАК Группа,
	|	ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф.МинимальныйОбъем КАК МинимальныйОбъем,
	|	ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф.МаксимальныйОбъем КАК МаксимальныйОбъем,
	|	ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф.ОбъемИскл КАК ОбъемИскл
	|ПОМЕСТИТЬ втИключенияОбъемныхКоэфф
	|ИЗ
	|	Справочник.ВидыАлкогольнойПродукции.итИсключенияОбъемныхКоэфф КАК ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНоменклатура.Номенклатура КАК Номенклатура,
	|	втНоменклатура.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	втНоменклатура.ГруппаГАК КАК ГруппаГАК,
	|	втНоменклатура.НомерГруппыГАК КАК НомерГруппыГАК,
	|	втНоменклатура.УдельныйОбъем КАК УдельныйОбъем,
	|	втНоменклатура.Крепость КАК Крепость,
	|	втНоменклатура.Объем КАК Объем,
	|	ЕСТЬNULL(втУдельныеЦены.УдельнаяЦена, 0) КАК УдельнаяЦена,
	|	ЕСТЬNULL(втИключенияОбъемныхКоэфф.ОбъемИскл, 0) КАК ОбъемИскл,
	|	втНоменклатура.ЕРПМастерКлюч КАК ЕРПМастерКлюч,
	|	втНоменклатура.Код КАК Код
	|ПОМЕСТИТЬ втСгруппированнаяТаблица
	|ИЗ
	|	втНоменклатура КАК втНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втУдельныеЦены КАК втУдельныеЦены
	|		ПО втНоменклатура.ГруппаГАК = втУдельныеЦены.Группа
	|			И втНоменклатура.Крепость = втУдельныеЦены.Крепость
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИключенияОбъемныхКоэфф КАК втИключенияОбъемныхКоэфф
	|		ПО втНоменклатура.Объем > втИключенияОбъемныхКоэфф.МинимальныйОбъем
	|			И втНоменклатура.Объем <= втИключенияОбъемныхКоэфф.МаксимальныйОбъем
	|			И втНоменклатура.ГруппаГАК <= втИключенияОбъемныхКоэфф.Группа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСгруппированнаяТаблица.Номенклатура КАК Номенклатура,
	|	втСгруппированнаяТаблица.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	втСгруппированнаяТаблица.ГруппаГАК КАК ГруппаГАК,
	|	втСгруппированнаяТаблица.НомерГруппыГАК КАК НомерГруппыГАК,
	|	втСгруппированнаяТаблица.УдельныйОбъем КАК УдельныйОбъем,
	|	втСгруппированнаяТаблица.Крепость КАК Крепость,
	|	втСгруппированнаяТаблица.Объем КАК Объем,
	|	втСгруппированнаяТаблица.УдельнаяЦена КАК УдельнаяЦена,
	|	втСгруппированнаяТаблица.ОбъемИскл КАК ОбъемИскл,
	|	ВЫБОР
	|		КОГДА втСгруппированнаяТаблица.УдельныйОбъем = 0
	|			ТОГДА 0
	|		КОГДА втСгруппированнаяТаблица.ОбъемИскл > 0
	|			ТОГДА втСгруппированнаяТаблица.УдельнаяЦена * втСгруппированнаяТаблица.ОбъемИскл / втСгруппированнаяТаблица.УдельныйОбъем
	|		ИНАЧЕ втСгруппированнаяТаблица.УдельнаяЦена * втСгруппированнаяТаблица.Объем / втСгруппированнаяТаблица.УдельныйОбъем
	|	КОНЕЦ КАК МРЦ,
	|	втСгруппированнаяТаблица.ЕРПМастерКлюч КАК ЕРПМастерКлюч,
	|	втСгруппированнаяТаблица.Код КАК Код
	|ПОМЕСТИТЬ втИтоговая
	|ИЗ
	|	втСгруппированнаяТаблица КАК втСгруппированнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтоговая.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(втИтоговая.МРЦ) КАК МРЦ
	|ПОМЕСТИТЬ втЦеныМРЦ
	|ИЗ
	|	втИтоговая КАК втИтоговая
	|ГДЕ
	|	втИтоговая.МРЦ > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	втИтоговая.Номенклатура
	|;	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итСостояниеБлокировкиТовараСрезПоследних.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ втБлокироватьКПродаже
	|ИЗ
	|	РегистрСведений.итСостояниеБлокировкиТовара.СрезПоследних(, ПодразделениеКомпании = &ПодразделениеКомпании) КАК итСостояниеБлокировкиТовараСрезПоследних
	|ГДЕ
	|	итСостояниеБлокировкиТовараСрезПоследних.Состояние = &СостояниеБлокировки
	|	И итСостояниеБлокировкиТовараСрезПоследних.СрокДействия > &ТекущаяДата
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВОборудовании.Номенклатура КАК Номенклатура,
	|	ТоварыВОборудовании.Штрихкод КАК Штрихкод,
	|	ТоварыВОборудовании.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ТоварыВОборудовании.ЕдиницаИзмерения.Коэффициент, 1) КАК Кратность,
	|	ТоварыВОборудовании.Номенклатура.Код КАК Код,
	|	ТоварыВОборудовании.Номенклатура.Артикул КАК Артикул,
	|	ТоварыВОборудовании.Номенклатура.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА ТоварыВОборудовании.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)
	|			ТОГДА ""none""
	|		ИНАЧЕ ТоварыВОборудовании.Номенклатура.СтавкаНДС.Ставка
	|	КОНЕЦ КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ТоварыВОборудовании.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)
	|			ТОГДА ""none""
	|		ИНАЧЕ ТоварыВОборудовании.Номенклатура.СтавкаНДС.idУКМ5
	|	КОНЕЦ КАК СтавкаНДСУКМ5,	
	|	ТоварыВОборудовании.Номенклатура.ОсновнаяЕдиницаИзмерения.Наименование КАК ОсновнаяЕдиницаИзмерения,
	|	ЕСТЬNULL(ТоварыВОборудовании.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 1) КАК ОсновнаяКратностьЕдиницы,
	|	ТоварыВОборудовании.Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	ТоварыВОборудовании.Номенклатура.ТипНоменклатуры.Весовой КАК ЭтоВесовой,
	|	ТоварыВОборудовании.Номенклатура.КоличествоВМультипаке КАК КоличествоВМультипаке,
	|	ТоварыВОборудовании.Номенклатура.ШтрихКодСвежесть КАК ШтрихКодСвежесть,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ЦеныЕдиницы.Цена, ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)) КАК ЦенаЕдиницы,
	|	ТоварыВОборудовании.Номенклатура.Родитель КАК Родитель,
	|	ТоварыВОборудовании.Номенклатура.Родитель."+?(ВыгружатьГруппыПоКоду,"Код","Артикул")+" КАК КодГруппы,
	|	ТоварыВОборудовании.Номенклатура.ТипНоменклатуры.ПризнакПредметаРасчета КАК ПризнакПредметаРасчета,
	//|	ПРЕДСТАВЛЕНИЕ(ТоварыВОборудовании.Номенклатура.ТипНоменклатуры.ПризнакПредметаРасчета) КАК ИмяПризнакаПредметаРасчета,
	|	ТоварыВОборудовании.Номенклатура.Объем КАК Объем,
	|	ТоварыВОборудовании.Номенклатура.Крепость КАК Крепость,
	|	ВЫБОР
	|		КОГДА НЕ ТоварыВОборудовании.Номенклатура.итОсобенностьУчета = ЗНАЧЕНИЕ(Справочник.ОсобенностиУчетаНоменклатуры.ПустаяСсылка) ТОГДА
	|			ТоварыВОборудовании.Номенклатура.итОсобенностьУчета	
	|		КОГДА НЕ ТоварыВОборудовании.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Справочник.ОсобенностиУчетаНоменклатуры.ПустаяСсылка) ТОГДА
	|			ТоварыВОборудовании.Номенклатура.ОсобенностьУчета
	|		КОГДА (НЕ ОсобенностиУчетаПоГруппам.ОсобенностьУчета ЕСТЬ NULL) ТОГДА
	|			ОсобенностиУчетаПоГруппам.ОсобенностьУчета
	|		ИНАЧЕ
	|			ТоварыВОборудовании.Номенклатура.ТипНоменклатуры.ОсобенностьУчета
	|	КОНЕЦ КАК ОсобенностьУчета,
	|	ТоварыВОборудовании.Номенклатура.ВидАлкогольнойПродукции.Маркируемый КАК Маркируемый,
	|	ТоварыВОборудовании.Номенклатура.ВидАлкогольнойПродукции.Код КАК КодВидаАлкогольнойПродукции,
	|	ТоварыВОборудовании.Номенклатура.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	ТоварыВОборудовании.Номенклатура.ит_ImgToWeb КАК Картинка,	
	|	ТоварыВОборудовании.Номенклатура.ит_ImgToKSO КАК КартинкаКСО,
	|	ТоварыВОборудовании.Номенклатура.итГруппаКСО.Наименование КАК ГруппаКСО,
	|	ТоварыВОборудовании.Номенклатура.итГруппаКСО.ИДГруппы КАК ИДГруппаКСО,	
	|	ТоварыВОборудовании.Номенклатура.итГруппаКСО.КартинкаГруппы КАК КартинкаГруппы,		
	|	ТоварыВОборудовании.Номенклатура.итГруппаКСО.Порядок КАК ПорядокГруппы,		
	|	ТоварыВОборудовании.Номенклатура.ПорядокВГруппеКСО КАК ПорядокВГруппеКСО,		
	|	ЕСТЬNULL(ТаблицаСкидок.Скидка, 0) КАК Скидка,
	|	УценкаТовара.ЗначениеСкидки,
	|	УценкаТовара.СпособВычисления,
	|	УценкаТовара.ВариантОкругления,
	|	ЕСТЬNULL(УдаленнаяУценкаТовара.Удален, ЛОЖЬ) КАК Удален,
	|	ВЫБОР КОГДА ЕСТЬNULL(втЦеныМРЦ.МРЦ,0) = 0 ТОГДА ЕСТЬNULL(ТоварыВОборудовании.Номенклатура.ОсобенностьУчета.МРЦ,0) ИНАЧЕ ЕСТЬNULL(втЦеныМРЦ.МРЦ,0) КОНЕЦ КАК МРЦ,
	|	ВЫБОР
	|		КОГДА втБлокироватьКПродаже.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК БлокироватьКПродаже
	|ИЗ
	|	ТоварыВОборудовании КАК ТоварыВОборудовании
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ОсобенностиУчетаПоГруппам КАК ОсобенностиУчетаПоГруппам
	|ПО
	|	ТоварыВОборудовании.Номенклатура.Родитель = ОсобенностиУчетаПоГруппам.Номенклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТаблицаЦен КАК ЦеныНоменклатуры
	|ПО
	|	ТоварыВОборудовании.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|	И (ТоварыВОборудовании.Номенклатура.ОсновнаяЕдиницаИзмерения = ЦеныНоменклатуры.ЕдиницаИзмерения
	|	ИЛИ ЦеныНоменклатуры.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТаблицаЦен КАК ЦеныЕдиницы
	|ПО
	|	ТоварыВОборудовании.Номенклатура = ЦеныЕдиницы.Номенклатура И 
	|	ТоварыВОборудовании.ЕдиницаИзмерения = ЦеныЕдиницы.ЕдиницаИзмерения
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	УценкаТовара КАК УценкаТовара
	|ПО
	|	ТоварыВОборудовании.Номенклатура = УценкаТовара.Номенклатура И 
	|	ТоварыВОборудовании.ШтрихКод     = УценкаТовара.ШтрихКод
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТаблицаСкидок КАК ТаблицаСкидок
	|ПО
	|	ТоварыВОборудовании.Номенклатура = ТаблицаСкидок.Номенклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	УдаленнаяУценкаТовара КАК УдаленнаяУценкаТовара
	|ПО
	|	ТоварыВОборудовании.Номенклатура = УдаленнаяУценкаТовара.Номенклатура И 
	|	ТоварыВОборудовании.ШтрихКод     = УдаленнаяУценкаТовара.ШтрихКод	
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	втЦеныМРЦ КАК втЦеныМРЦ
	|ПО
	|	ТоварыВОборудовании.Номенклатура = втЦеныМРЦ.Номенклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ втБлокироватьКПродаже КАК втБлокироватьКПродаже
	|	ПО ТоварыВОборудовании.Номенклатура = втБлокироватьКПродаже.Номенклатура	
	|ИТОГИ
	|	МАКСИМУМ(Цена),
	|	МАКСИМУМ(МРЦ),
	|	МАКСИМУМ(БлокироватьКПродаже),		
	|	МАКСИМУМ(ОсобенностьУчета)
	|	//МАКСИМУМ(КодГруппы)
	|ПО
	|	Номенклатура ИЕРАРХИЯ
	|";
	
	Если ВыгружатьОстатки Тогда
		ЗапросОстатки = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                             |	ТоварыВОборудовании.Номенклатура КАК Номенклатура,
		                             |	Штрихкоды.Штрихкод КАК Штрихкод,
		                             |	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		                             |	ЕСТЬNULL(Штрихкоды.ЕдиницаИзмерения.Коэффициент, 1) КАК Кратность
		                             |ПОМЕСТИТЬ ТоварыВОборудовании
		                             |ИЗ
		                             |	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
		                             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
		                             |		ПО ТоварыВОборудовании.Номенклатура = Штрихкоды.Объект
		                             |			И (Штрихкоды.Запрет = ЛОЖЬ)
		                             |ГДЕ
		                             |	ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваров
		                             |	И ТоварыВОборудовании.МоментИзменения >= &МоментИзменения
		                             |	И ТоварыВОборудовании.ВыполненаПечатьЦенников = ИСТИНА
		                             |;
		                             |
		                             |////////////////////////////////////////////////////////////////////////////////
		                             |ВЫБРАТЬ
		                             |	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
		                             |	СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК КоличествоОстаток
		                             |ИЗ
		                             |	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
		                             |			,
		                             |			СкладКомпании = &ЗалОбслуживания
		                             |				И Номенклатура В
		                             |					(ВЫБРАТЬ
		                             |						ТоварыВОборудовании.Номенклатура
		                             |					ИЗ
		                             |						ТоварыВОборудовании КАК ТоварыВОборудовании)) КАК ОстаткиТоваровКомпанииОстатки
		                             |
		                             |СГРУППИРОВАТЬ ПО
		                             |	ОстаткиТоваровКомпанииОстатки.Номенклатура");
		ЗапросОстатки.УстановитьПараметр("ГруппаТоваров",         ГруппаТоваров);
		ЗапросОстатки.УстановитьПараметр("МоментИзменения",       МоментИзменения);
		ЗапросОстатки.УстановитьПараметр("ЗалОбслуживания",       ЗалОбслуживания);
		
		ТаблицаОстатков = ЗапросОстатки.Выполнить().Выгрузить();
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Если ЭтоКлиент Тогда
		ТоварыКВыгрузке = Новый Массив;
	Иначе
		ТоварыКВыгрузке = Новый ТаблицаЗначений;
		ЗаписьТовар = ПолучитьЗаписьТовара();
		Для Каждого ТекущееПоле Из ЗаписьТовар Цикл
			Если ТекущееПоле.Значение = Неопределено Тогда
				ТоварыКВыгрузке.Колонки.Добавить(ТекущееПоле.Ключ);
			Иначе
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипЗнч(ТекущееПоле.Значение));
				ТипКолонки = Новый ОписаниеТипов(МассивТипов);
				ТоварыКВыгрузке.Колонки.Добавить(ТекущееПоле.Ключ, ТипКолонки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ИтогПоГруппировке = ТипЗаписиЗапроса.ИтогПоГруппировке;
	ДетальнаяЗапись   = ТипЗаписиЗапроса.ДетальнаяЗапись;
	ФиксированнаяЦена = Перечисления.СкидкиСпособВычисления.ФиксированнаяЦена;
	ЗаписьТовар = Неопределено;
	Штрихкоды   = Новый Массив;
	ПроверкаШтрихкодов = Новый Массив;
	ШтрихкодыСПустымиЦенами = Новый Массив;
	Если ЭтоКлиент Тогда
		Пока Выборка.Следующий() Цикл
			ТипЗаписи = Выборка.ТипЗаписи();
			Если ТипЗаписи = ДетальнаяЗапись Тогда
				
				Если НЕ ПроверкаШтрихкодов.Найти(Выборка.Штрихкод) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.ШтрихКодСвежесть) И Выборка.ШтрихКодСвежесть = Выборка.Штрихкод Тогда
					ЦенаЕдиницы = Выборка.ЦенаЕдиницы;
				ИначеЕсли ЗначениеЗаполнено(Выборка.Скидка) Тогда
					ЦенаЕдиницы = Выборка.Скидка;
				ИначеЕсли Выборка.СпособВычисления = ФиксированнаяЦена Тогда
					ЦенаЕдиницы = Выборка.ЗначениеСкидки;
				ИначеЕсли НЕ Выборка.ЦенаЕдиницы = 0 И ЗначениеЗаполнено(Выборка.ЗначениеСкидки) Тогда
					ЦенаЕдиницы = Выборка.ЦенаЕдиницы - Выборка.ЦенаЕдиницы*(Выборка.ЗначениеСкидки/100);
					ЦенаЕдиницы = Справочники.ВариантыОкругления.ОкруглитьЦену(Выборка.ВариантОкругления, ЦенаЕдиницы);
				Иначе
					ЦенаЕдиницы = Выборка.ЦенаЕдиницы;
				КонецЕсли;
				
				Если ЦенаЕдиницы = 0 И (НЕ Выборка.Удален) Тогда
					ШтрихкодыСПустымиЦенами.Добавить(Выборка.Штрихкод);
					ПроверкаШтрихкодов.Добавить(Выборка.Штрихкод);
					Продолжить;
				КонецЕсли;
				
				СтрокаШтрихкод = Новый Структура;
				СтрокаШтрихкод.Вставить("Штрихкод",  Выборка.Штрихкод);
				СтрокаШтрихкод.Вставить("Кратность", Выборка.Кратность);
				СтрокаШтрихкод.Вставить("Удален",    Выборка.Удален);
				СтрокаШтрихкод.Вставить("Цена",      ЦенаЕдиницы);
				
				Штрихкоды.Добавить(СтрокаШтрихкод);
				ПроверкаШтрихкодов.Добавить(Выборка.Штрихкод);
				Продолжить;
			КонецЕсли;
			
			Если Не ЗаписьТовар = Неопределено Тогда
				ЗаписьТовар.Штрихкоды = Штрихкоды;
			КонецЕсли;
			
			Если ТипЗаписи = ИтогПоГруппировке Тогда
				// Новая запись
				ЗаписьТовар = ПолучитьЗаписьТовара();
				ЗаписьТовар.ЭтоВесовой       = Выборка.ЭтоВесовой;
				ЗаписьТовар.ОсобенностьУчета = Выборка.ОсобенностьУчета;
				ЗаписьТовар.ЕдиницаИзмерения = Выборка.ОсновнаяЕдиницаИзмерения;
				ЗаписатьАлкогольныеРеквизиты(Выборка, ЗаписьТовар);
				ЗаписьТовар.СтавкаНДС        = Выборка.СтавкаНДС;
				ЗаписьТовар.СтавкаНДСУКМ5        = Выборка.СтавкаНДСУКМ5;				
				ЗаписьТовар.ПризнакПредметаРасчета = Выборка.ПризнакПредметаРасчета;
				ЗаписьТовар.КоличествоВМультипаке  = Выборка.КоличествоВМультипаке;
				ЗаписьТовар.Цена             = Выборка.Цена;
				ЗаписьТовар.МРЦ              = Выборка.МРЦ;
				ЗаписьТовар.БлокироватьКПродаже = Выборка.БлокироватьКПродаже;
				ЗаписьТовар.Картинка 	 	 = Выборка.Картинка;
				ЗаписьТовар.КартинкаКСО 	 = Выборка.КартинкаКСО;

				ЗаписьТовар.ГруппаКСО 	 	= Выборка.ГруппаКСО;
				ЗаписьТовар.ИДГруппаКСО  	= Выборка.ИДГруппаКСО;
				ЗаписьТовар.КартинкаГруппы 	= Выборка.КартинкаГруппы;
				ЗаписьТовар.ПорядокГруппы 	= Выборка.ПорядокГруппы;
				ЗаписьТовар.ПорядокВГруппеКСО = Выборка.ПорядокВГруппеКСО;
			
				Если ВыгружатьОстатки Тогда
					СтрокаОстатка = ТаблицаОстатков.Найти(Выборка.Номенклатура,"Номенклатура");
					Если СтрокаОстатка<>Неопределено Тогда
						ЗаписьТовар.Остаток = СтрокаОстатка.КоличествоОстаток;
					КонецЕсли;
				КонецЕсли;
			Иначе
				ЗаписьТовар = ПолучитьЗаписьТовара();
			КонецЕсли;
			
			ЗаписьТовар.Наименование 	= Выборка.Наименование;
			ЗаписьТовар.Артикул      	= Выборка.Артикул;
			ЗаписьТовар.ЭтоГруппа   	= Выборка.ЭтоГруппа;
			ЗаписьТовар.Код          	= СокрЛП(Выборка.Код);
			ЗаписьТовар.Родитель     	= Выборка.Родитель;
			ЗаписьТовар.КодГруппы    	= СокрЛП(Выборка.КодГруппы);
			ЗаписьТовар.Крепость	 	= Выборка.Крепость;
			ЗаписьТовар.Картинка 	 	= Выборка.Картинка;
			ЗаписьТовар.КартинкаКСО 	 = Выборка.КартинкаКСО;

			ЗаписьТовар.ГруппаКСО 	 	= Выборка.ГруппаКСО;
			ЗаписьТовар.ИДГруппаКСО  	= Выборка.ИДГруппаКСО;
			ЗаписьТовар.КартинкаГруппы 	= Выборка.КартинкаГруппы;
			ЗаписьТовар.ПорядокГруппы 	= Выборка.ПорядокГруппы;
			ЗаписьТовар.ПорядокВГруппеКСО = Выборка.ПорядокВГруппеКСО;
			
			Штрихкоды = Новый Массив;
			ПроверкаШтрихкодов = Новый Массив;
			
			ТоварыКВыгрузке.Добавить(ЗаписьТовар);
		КонецЦикла;
	Иначе
		Пока Выборка.Следующий() Цикл
			ТипЗаписи = Выборка.ТипЗаписи();
			Если ТипЗаписи = ДетальнаяЗапись Тогда
				
				Если НЕ ПроверкаШтрихкодов.Найти(Выборка.Штрихкод) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.ШтрихКодСвежесть) И Выборка.ШтрихКодСвежесть = Выборка.Штрихкод Тогда
					ЦенаЕдиницы = Выборка.ЦенаЕдиницы;
				ИначеЕсли ЗначениеЗаполнено(Выборка.Скидка) Тогда
					ЦенаЕдиницы = Выборка.Скидка;
				ИначеЕсли Выборка.СпособВычисления = ФиксированнаяЦена Тогда
					ЦенаЕдиницы = Выборка.ЗначениеСкидки;
				ИначеЕсли НЕ Выборка.ЦенаЕдиницы = 0 И ЗначениеЗаполнено(Выборка.ЗначениеСкидки) Тогда
					ЦенаЕдиницы = Выборка.ЦенаЕдиницы - Выборка.ЦенаЕдиницы*(Выборка.ЗначениеСкидки/100);
					ЦенаЕдиницы = Справочники.ВариантыОкругления.ОкруглитьЦену(Выборка.ВариантОкругления, ЦенаЕдиницы);
				Иначе
					ЦенаЕдиницы = Выборка.ЦенаЕдиницы;
				КонецЕсли;
				
				Если ЦенаЕдиницы = 0 И (НЕ Выборка.Удален) Тогда
					ШтрихкодыСПустымиЦенами.Добавить(Выборка.Штрихкод);
					ПроверкаШтрихкодов.Добавить(Выборка.Штрихкод);
					Продолжить;
				КонецЕсли;
				
				СтрокаШтрихкод = Новый Структура;
				СтрокаШтрихкод.Вставить("Штрихкод",  Выборка.Штрихкод);
				СтрокаШтрихкод.Вставить("Кратность", Выборка.Кратность);
				СтрокаШтрихкод.Вставить("Удален",    Выборка.Удален);
				СтрокаШтрихкод.Вставить("Цена",      ЦенаЕдиницы);
				
				Штрихкоды.Добавить(СтрокаШтрихкод);
				ПроверкаШтрихкодов.Добавить(Выборка.Штрихкод);
				Продолжить;
			КонецЕсли;
			
			Если Не ЗаписьТовар = Неопределено Тогда
				ЗаписьТовар.Штрихкоды = Штрихкоды;
			КонецЕсли;
			
			Если ТипЗаписи = ИтогПоГруппировке Тогда
				// Новая запись
				ЗаписьТовар = ТоварыКВыгрузке.Добавить();
				ЗаписьТовар.ЭтоВесовой       = Выборка.ЭтоВесовой;
				ЗаписьТовар.ОсобенностьУчета = Выборка.ОсобенностьУчета;
				ЗаписьТовар.ЕдиницаИзмерения = Выборка.ОсновнаяЕдиницаИзмерения;
				ЗаписатьАлкогольныеРеквизиты(Выборка, ЗаписьТовар);
				ЗаписьТовар.СтавкаНДС        = Выборка.СтавкаНДС;
				ЗаписьТовар.СтавкаНДСУКМ5        = Выборка.СтавкаНДСУКМ5;				
				ЗаписьТовар.ПризнакПредметаРасчета = Выборка.ПризнакПредметаРасчета;
				ЗаписьТовар.КоличествоВМультипаке  = Выборка.КоличествоВМультипаке;
				ЗаписьТовар.Цена             = Выборка.Цена;
				ЗаписьТовар.МРЦ              = Выборка.МРЦ;
				ЗаписьТовар.БлокироватьКПродаже = Выборка.БлокироватьКПродаже;
				ЗаписьТовар.Картинка 		 = Выборка.Картинка;
				ЗаписьТовар.КартинкаКСО 	 = Выборка.КартинкаКСО;

				ЗаписьТовар.ГруппаКСО 	 	= Выборка.ГруппаКСО;
				ЗаписьТовар.ИДГруппаКСО  	= Выборка.ИДГруппаКСО;
				ЗаписьТовар.КартинкаГруппы 	= Выборка.КартинкаГруппы;
				ЗаписьТовар.ПорядокГруппы 	= Выборка.ПорядокГруппы;
				ЗаписьТовар.ПорядокВГруппеКСО = Выборка.ПорядокВГруппеКСО;
				
				Если ВыгружатьОстатки Тогда
					СтрокаОстатка = ТаблицаОстатков.Найти(Выборка.Номенклатура,"Номенклатура");
					Если СтрокаОстатка<>Неопределено Тогда
						ЗаписьТовар.Остаток = СтрокаОстатка.КоличествоОстаток;
					КонецЕсли;
				КонецЕсли;
			Иначе
				ЗаписьТовар = ТоварыКВыгрузке.Добавить();
			КонецЕсли;
			
			ЗаписьТовар.Наименование 	= Выборка.Наименование;
			ЗаписьТовар.Артикул      	= Выборка.Артикул;
			ЗаписьТовар.ЭтоГруппа    	= Выборка.ЭтоГруппа;
			ЗаписьТовар.Код         	= СокрЛП(Выборка.Код);
			ЗаписьТовар.Родитель    	= Выборка.Родитель;
			ЗаписьТовар.КодГруппы    	= СокрЛП(Выборка.КодГруппы);
			ЗаписьТовар.Крепость     	= Выборка.Крепость;
			ЗаписьТовар.Картинка 	 	= Выборка.Картинка;
			ЗаписьТовар.КартинкаКСО 	 = Выборка.КартинкаКСО;

			ЗаписьТовар.ГруппаКСО 	 	= Выборка.ГруппаКСО;
			ЗаписьТовар.ИДГруппаКСО  	= Выборка.ИДГруппаКСО;
			ЗаписьТовар.КартинкаГруппы 	= Выборка.КартинкаГруппы;
			ЗаписьТовар.ПорядокГруппы 	= Выборка.ПорядокГруппы;
			ЗаписьТовар.ПорядокВГруппеКСО = Выборка.ПорядокВГруппеКСО;
			
			Штрихкоды = Новый Массив;
			ПроверкаШтрихкодов = Новый Массив;
			
		КонецЦикла;
	КонецЕсли;
	
	Если Не ЗаписьТовар = Неопределено Тогда
		ЗаписьТовар.Штрихкоды = Штрихкоды;
	КонецЕсли;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТипЦен",                ТипЦен);
	Параметры.Вставить("ПодразделениеКомпании", ПодразделениеКомпании);
	Параметры.Вставить("ГруппаТоваров",         ГруппаТоваров);
	Параметры.Вставить("МоментИзменения",       МоментИзменения);
	Параметры.Вставить("ЗалОбслуживания",       ЗалОбслуживания);
	Параметры.Вставить("ЭтоКлиент",             ЭтоКлиент);
	
	ДанныеСобытия = Новый Структура;
	ДанныеСобытия.Вставить("Устройство",        Оборудование);
	ДанныеСобытия.Вставить("Параметры",         Параметры);
	ДанныеСобытия.Вставить("Данные",            ТоварыКВыгрузке);
	ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
	
	Комментарий = "Количество записей: " + Формат(ТоварыКВыгрузке.Количество(), "ЧН=0; ЧГ=");
	
	МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(Параметры.ГруппаТоваров, Оборудование, "Получение данных для касс", Комментарий, ДанныеСобытия);
	
	Если ШтрихкодыСПустымиЦенами.Количество()>0 Тогда
		ДанныеСобытия = Новый Структура;
		ДанныеСобытия.Вставить("Устройство",        Оборудование);
		ДанныеСобытия.Вставить("Параметры",         Параметры);
		ДанныеСобытия.Вставить("Данные",            ШтрихкодыСПустымиЦенами);
		ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
		
		Комментарий = "Количество записей: " + Формат(ШтрихкодыСПустымиЦенами.Количество(), "ЧН=0; ЧГ=");
		МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(Параметры.ГруппаТоваров, Оборудование, "Штрих-коды для касс с пустыми ценами", Комментарий, ДанныеСобытия);
	КонецЕсли;
	
	Возврат ТоварыКВыгрузке;
	
КонецФункции


Функция ПолучитьТаблицуМарок(МоментПоследнейЗагрузки, ЭтоКлиент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МаркиВОборудовании.GTIN КАК GTIN,
	|	МаркиВОборудовании.КодМарки КАК КодМарки,
	|	МаркиВОборудовании.Удален КАК Удален,
	|	МаркиВОборудовании.ДатаИстеченияСрокаГодности КАК ДатаИстеченияСрокаГодности
	|ИЗ
	|	РегистрСведений.МаркиВОборудовании КАК МаркиВОборудовании
	|ГДЕ
	|	МаркиВОборудовании.МоментИзменения >= &МоментПоследнейЗагрузки";	
	Запрос.УстановитьПараметр("МоментПоследнейЗагрузки",МоментПоследнейЗагрузки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ЭтоКлиент Тогда
		ТоварыКВыгрузке = Новый Массив;
	Иначе
		ТоварыКВыгрузке = Новый ТаблицаЗначений;
		ЗаписьТовар = ПолучитьЗаписьМарки();
		Для Каждого ТекущееПоле Из ЗаписьТовар Цикл
			Если ТекущееПоле.Значение = Неопределено Тогда
				ТоварыКВыгрузке.Колонки.Добавить(ТекущееПоле.Ключ);
			Иначе
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипЗнч(ТекущееПоле.Значение));
				ТипКолонки = Новый ОписаниеТипов(МассивТипов);
				ТоварыКВыгрузке.Колонки.Добавить(ТекущееПоле.Ключ, ТипКолонки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтоКлиент Тогда
		Пока Выборка.Следующий() Цикл

			ЗаписьТовар = ПолучитьЗаписьМарки();			
			ЗаписьТовар.GTIN 						= Выборка.GTIN;
			ЗаписьТовар.КодМарки      				= Выборка.КодМарки;
			ЗаписьТовар.Удален   					= Выборка.Удален;
			ЗаписьТовар.ДатаИстеченияСрокаГодности  = Выборка.ДатаИстеченияСрокаГодности;
			
			
			ТоварыКВыгрузке.Добавить(ЗаписьТовар);
		КонецЦикла;
	Иначе
		Пока Выборка.Следующий() Цикл
			ЗаписьТовар = ТоварыКВыгрузке.Добавить();
			
			ЗаписьТовар.GTIN 						= Выборка.GTIN;
			ЗаписьТовар.КодМарки      				= Выборка.КодМарки;
			ЗаписьТовар.Удален   					= Выборка.Удален;
			ЗаписьТовар.ДатаИстеченияСрокаГодности  = Выборка.ДатаИстеченияСрокаГодности;

						
		КонецЦикла;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТоварыКВыгрузке;
	
КонецФункции

Функция ПолучитьТаблицуСкидок(Оборудование, ЭтоКлиент = Истина, МоментПоследнейЗагрузки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// получим группы
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА Скидки.Действует
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК УдалитьСкидку,
	|	Скидки.ДниНедели КАК ДниНедели,
	|	Скидки.Идентификатор КАК Идентификатор,
	|	Скидки.Количество КАК Количество,
	|	Скидки.ЗначениеСкидки КАК ЗначениеСкидки,
	|	Скидки.СуммаЧека КАК СуммаЧека,
	|	Скидки.СуммаНакопления КАК СуммаНакопления,
	|	Скидки.РучнаяСкидка КАК РучнаяСкидка,
	|	Скидки.НачалоДействия КАК НачалоДействия,
	|	Скидки.КонецДействия КАК КонецДействия,
	|	Скидки.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	ВЫБОР
	|		КОГДА Скидки.Правило = ЗНАЧЕНИЕ(Перечисление.ПравилаРасчетаСкидкиПоКоличеству.Больше)
	|			ТОГДА ""2""
	|		КОГДА Скидки.Правило = ЗНАЧЕНИЕ(Перечисление.ПравилаРасчетаСкидкиПоКоличеству.Упаковка)
	|			ТОГДА ""1""
	|		КОГДА Скидки.Правило = ЗНАЧЕНИЕ(Перечисление.ПравилаРасчетаСкидкиПоКоличеству.Меньше)
	|			ТОГДА ""4""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Правило,
	|	ВЫБОР
	|		КОГДА Скидки.СпособВычисления = ЗНАЧЕНИЕ(Перечисление.СкидкиСпособВычисления.Абсолютная)
	|			ТОГДА 1
	|		КОГДА Скидки.СпособВычисления = ЗНАЧЕНИЕ(Перечисление.СкидкиСпособВычисления.Относительная)
	|			ТОГДА 0
	|		КОГДА Скидки.СпособВычисления = ЗНАЧЕНИЕ(Перечисление.СкидкиСпособВычисления.ФиксированнаяЦена)
	|			ТОГДА 8
	|	КОНЕЦ КАК СпособВычисления,
	|	ВЫБОР
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаГруппуПоТипуКарты)
	|			ТОГДА 1001
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаТоварПоТипуКарты)
	|			ТОГДА 1002
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаСуммуЧекаПоТипуКарты)
	|			ТОГДА 1003
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаПоКарте)
	|			ТОГДА 1004
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаГруппуПоКарте)
	|			ТОГДА 1005
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаКоличествоПоГруппеПоКарте)
	|			ТОГДА 1006
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаСуммуЧекаПоКарте)
	|			ТОГДА 1007
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаГруппу)
	|			ТОГДА 1008
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаКоличествоПоГруппе)
	|			ТОГДА 1009
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаТовар)
	|			ТОГДА 1010
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаКоличествоТовара)
	|			ТОГДА 1011
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаСуммуЧека)
	|			ТОГДА 1012
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаНабор)
	|			ТОГДА 1013
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаАтолл)
	|			ТОГДА 1014
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СпециальнаяЦена)
	|			ТОГДА 1015
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.ОграничениеНаГруппу)
	|			ТОГДА 1016
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.Ограничение)
	|			ТОГДА 1017
	|		КОГДА Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.РучнаяСкидка)
	|			ТОГДА 1018
	|		ИНАЧЕ 9999
	|	КОНЕЦ КАК ТипСкидки,
	|	ВЫБОР
	|		КОГДА Скидки.Наименование = """"
	|			ТОГДА Скидки.Скидка.Наименование
	|		ИНАЧЕ Скидки.Наименование
	|	КОНЕЦ КАК Наименование,
	|	Скидки.Свойство КАК ИдентификаторСкидкиВОборудовании,
	|	Скидки.НачВремя КАК НачВремя,
	|	Скидки.КонВремя КАК КонВремя,
	|	Скидки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Скидки.Номенклатура.Артикул, """") КАК КодПЛУ,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА Скидки.Номенклатура.ЭтоГруппа
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК СкидкаНаГруппуТоваров,
	|	Скидки.СоставНабора КАК СоставНабора
	|ПОМЕСТИТЬ ТаблицаСкидок
	|ИЗ
	|	РегистрСведений.СкидкиВОборудовании КАК Скидки
	|ГДЕ
	|	Скидки.ПодразделениеКомпании = &ПодразделениеКомпании
	|	И НЕ Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаШтрихкодТовара)
	|	И Скидки.МоментИзменения >= &МоментИзменения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Карточки.Родитель.Код КАК ТипКартыКод,
	|	Карточки.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ(Карточки.Комментарий КАК СТРОКА(100)) КАК Комментарий,
	|	Штрихкоды.Штрихкод КАК Код,
	|	Карточки.Код КАК КартаКод1С
	|ИЗ
	|	Справочник.Карточки КАК Карточки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ПО Карточки.Ссылка = Штрихкоды.Объект
	|ГДЕ
	|	Карточки.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Скидки.ДисконтнаяКарта
	|			ИЗ
	|				ТаблицаСкидок КАК Скидки
	|			ГДЕ
	|				Скидки.УдалитьСкидку = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСкидок.ИдентификаторСкидкиВОборудовании КАК ИдентификаторСкидкиВОборудовании,
	|	ТаблицаСкидок.Наименование КАК Наименование,
	|	ТаблицаСкидок.ТипСкидки КАК ТипСкидки,
	|	ТаблицаСкидок.СпособВычисления КАК СпособВычисления,
	|	ЕСТЬNULL(ТаблицаСкидок.ДисконтнаяКарта.Код, """") КАК КартаКод1С,
	|	ТаблицаСкидок.НачалоДействия КАК НачалоДействия,
	|	ТаблицаСкидок.КонецДействия КАК КонецДействия,
	|	ТаблицаСкидок.НачВремя КАК НачВремя,
	|	ТаблицаСкидок.КонВремя КАК КонВремя,
	|	ТаблицаСкидок.ДниНедели КАК ДниНедели,
	|	ТаблицаСкидок.СуммаЧека КАК СуммаЧека,
	|	ТаблицаСкидок.ЗначениеСкидки КАК ЗначениеСкидки,
	|	ВЫБОР
	|		КОГДА ТаблицаСкидок.КодПЛУ = """"
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаСкидок.СкидкаНаГруппуТоваров = 1
	|					ТОГДА 2
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|	КОНЕЦ КАК СкидкаПоТовару,
	|	ТаблицаСкидок.СоставНабора КАК СоставНабора
	|ИЗ
	|	ТаблицаСкидок КАК ТаблицаСкидок
	|ГДЕ
	|	ТаблицаСкидок.УдалитьСкидку = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСкидок.ТипСкидки КАК ТипСкидки,
	|	ТаблицаСкидок.УдалитьСкидку КАК УдалитьСкидку,
	|	ТаблицаСкидок.КодПЛУ КАК КодПЛУ,
	|	ТаблицаСкидок.Наименование КАК Наименование,
	|	ТаблицаСкидок.СпособВычисления КАК СпособВычисления,
	|	ТаблицаСкидок.Номенклатура КАК Номенклатура,
	|	ТаблицаСкидок.ИдентификаторСкидкиВОборудовании КАК ИдентификаторСкидкиВОборудовании,
	|	ТаблицаСкидок.Количество КАК Количество,
	|	ТаблицаСкидок.ЗначениеСкидки КАК ЗначениеСкидки,
	|	ЕСТЬNULL(ШтрихКоды.Штрихкод, """") КАК ШтрихКод
	|ИЗ
	|	ТаблицаСкидок КАК ТаблицаСкидок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихКоды
	|		ПО ТаблицаСкидок.Номенклатура = ШтрихКоды.Объект
	|			И (ВЫБОР
	|				КОГДА ТаблицаСкидок.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Справочник.ТипыНоменклатуры.Весовой)
	|					ТОГДА НЕ ПОДСТРОКА(ШтрихКоды.Штрихкод, 0, 3) В (""229"", ""249"", ""269"", ""279"", ""289"")
	|				ИНАЧЕ НЕ ПОДСТРОКА(ШтрихКоды.Штрихкод, 0, 1) = ""9""
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ ТаблицаСкидок.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСкидок.Номенклатура,
	|	ТаблицаСкидок.УдалитьСкидку,
	|	ТаблицаСкидок.КодПЛУ,
	|	ТаблицаСкидок.Наименование,
	|	ТаблицаСкидок.ИдентификаторСкидкиВОборудовании,
	|	ТаблицаСкидок.СпособВычисления,
	|	ТаблицаСкидок.ТипСкидки,
	|	ТаблицаСкидок.Количество,
	|	ТаблицаСкидок.ЗначениеСкидки,
	|	ЕСТЬNULL(ШтрихКоды.Штрихкод, """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ВЫБОР
	|			КОГДА Скидки.Действует
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК Действует,
	|	Скидки.Свойство КАК ИдентификаторСкидкиВОборудовании,
	|	&ИндексМагазина КАК ИндексМагазина,
	|	ВЫБОР
	|		КОГДА Скидки.Наименование = """"""""
	|			ТОГДА Скидки.Скидка.Наименование
	|		ИНАЧЕ Скидки.Наименование
	|	КОНЕЦ КАК Наименование
	|ИЗ
	|	РегистрСведений.СкидкиВОборудовании КАК Скидки
	|ГДЕ
	|	Скидки.ПодразделениеКомпании = &ПодразделениеКомпании
	|	И НЕ Скидки.Скидка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.СкидкаНаШтрихкодТовара)
	|	И Скидки.КонецДействия >= &МоментИзменения
	|
	|СГРУППИРОВАТЬ ПО
	|	Скидки.Свойство,
	|	ВЫБОР
	|		КОГДА Скидки.Наименование = """"""""
	|			ТОГДА Скидки.Скидка.Наименование
	|		ИНАЧЕ Скидки.Наименование
	|	КОНЕЦ");
	//МАЛЬЦЕВ А.Ю. ---
	
	Запрос.УстановитьПараметр("МоментИзменения",		МоментПоследнейЗагрузки);
	Запрос.УстановитьПараметр("ПодразделениеКомпании",  Оборудование.ОсновнойОтдел.ПодразделениеКомпании);
	
	//МАЛЬЦЕВ А.Ю. +++		
	Запрос.УстановитьПараметр("ИндексМагазина", 		Формат(Оборудование.ИндексМагазина, "ЧН=0; ЧГ=0"));
	//МАЛЬЦЕВ А.Ю. ---		
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаДискотныеКарты = МассивРезультатов[1].Выбрать();
	ВыборкаТипыСкидок 	  = МассивРезультатов[2].Выбрать();
	ВыборкаНомеклатура 	  = МассивРезультатов[3].Выбрать();
	
	//МАЛЬЦЕВ А.Ю. +++			
	ВыпоркаПодразделения  = МассивРезультатов[4].Выбрать();
	//МАЛЬЦЕВ А.Ю. ---	
	
	СтруктураВыгрузки = Новый Структура;
	
	Если ЭтоКлиент Тогда
		ДисконтныеКарты = Новый Массив;
		ТипыСкидок = Новый Массив;
		СкидкиНаНомеклатуру = Новый Массив;
		
		Пока ВыборкаДискотныеКарты.Следующий() Цикл
			ЗаписьКарта = ПолучитьЗаписьДискотнаяКарта();
			ЗаписьКарта.ТипКартыКод      = ВыборкаДискотныеКарты.ТипКартыКод;
			ЗаписьКарта.Наименование     = ВыборкаДискотныеКарты.Наименование;
			ЗаписьКарта.Комментарий      = ВыборкаДискотныеКарты.Комментарий;
			ЗаписьКарта.Код              = ВыборкаДискотныеКарты.Код;
			ЗаписьКарта.КартаКод1С       = СокрЛП(ВыборкаДискотныеКарты.КартаКод1С);
			
			ДисконтныеКарты.Добавить(ЗаписьКарта);
		КонецЦикла;
		
		Пока ВыборкаТипыСкидок.Следующий() Цикл
			ЗаписьСкидка = ПолучитьЗаписьТипаСкидки();
			ЗаписьСкидка.ИдентификаторСкидкиВОборудовании      = ВыборкаТипыСкидок.ИдентификаторСкидкиВОборудовании;
			ЗаписьСкидка.Наименование              = ВыборкаТипыСкидок.Наименование;
			ЗаписьСкидка.ТипСкидки                 = ВыборкаТипыСкидок.ТипСкидки;
			ЗаписьСкидка.СпособВычисления          = ВыборкаТипыСкидок.СпособВычисления;
			ЗаписьСкидка.КартаКод1С                = СокрЛП(ВыборкаТипыСкидок.КартаКод1С);
			ЗаписьСкидка.НачалоДействия            = ВыборкаТипыСкидок.НачалоДействия;
			ЗаписьСкидка.КонецДействия             = ВыборкаТипыСкидок.КонецДействия;
			ЗаписьСкидка.НачВремя                  = ВыборкаТипыСкидок.НачВремя;
			ЗаписьСкидка.КонВремя                  = ВыборкаТипыСкидок.КонВремя;
			ЗаписьСкидка.ДниНедели                 = ВыборкаТипыСкидок.ДниНедели;
			ЗаписьСкидка.СуммаЧека                 = ВыборкаТипыСкидок.СуммаЧека;
			ЗаписьСкидка.ЗначениеСкидки            = ВыборкаТипыСкидок.ЗначениеСкидки;
			ЗаписьСкидка.СкидкаПоТовару            = ВыборкаТипыСкидок.СкидкаПоТовару;
			ЗаписьСкидка.СоставНабора              = ВыборкаТипыСкидок.СоставНабора;
			 
			ТипыСкидок.Добавить(ЗаписьСкидка);
		КонецЦикла;
		
		Пока ВыборкаНомеклатура.Следующий() Цикл
			ЗаписьНомеклатура = ПолучитьЗаписьСкидокНоменклатуры();
			ЗаписьНомеклатура.ТипСкидки             = ВыборкаНомеклатура.ТипСкидки;
			ЗаписьНомеклатура.УдалитьСкидку         = ВыборкаНомеклатура.УдалитьСкидку;
			ЗаписьНомеклатура.КодПЛУ                = СокрЛП(ВыборкаНомеклатура.КодПЛУ);
			ЗаписьНомеклатура.Наименование          = СокрЛП(ВыборкаНомеклатура.Наименование);
			ЗаписьНомеклатура.СпособВычисления      = ВыборкаНомеклатура.СпособВычисления;
			ЗаписьНомеклатура.Номенклатура          = ВыборкаНомеклатура.Номенклатура;
			ЗаписьНомеклатура.ИдентификаторСкидкиВОборудовании  = ВыборкаНомеклатура.ИдентификаторСкидкиВОборудовании;
			ЗаписьНомеклатура.Количество            = ВыборкаНомеклатура.Количество;
			ЗаписьНомеклатура.ЗначениеСкидки        = ВыборкаНомеклатура.ЗначениеСкидки;
			ЗаписьНомеклатура.ШтрихКод				= ВыборкаНомеклатура.ШтрихКод;
		
			СкидкиНаНомеклатуру.Добавить(ЗаписьНомеклатура);
		КонецЦикла;
		
		СтруктураВыгрузки.Вставить("ДисконтныеКарты", ДисконтныеКарты);
		СтруктураВыгрузки.Вставить("ТипыСкидок", ТипыСкидок);
		СтруктураВыгрузки.Вставить("СкидкиНаНомеклатуру", СкидкиНаНомеклатуру);
		
		
		//МАЛЬЦЕВ А.Ю. +++			
		ДоступностьДляПодразделений = Новый Массив;
		
		Пока ВыпоркаПодразделения.Следующий() Цикл
			ЗаписьПодразделения = ПолучитьЗаписьТипаСкидкиПоПодразделениям();
			ЗаписьПодразделения.ИдентификаторСкидкиВОборудовании   = ВыпоркаПодразделения.ИдентификаторСкидкиВОборудовании;
			ЗаписьПодразделения.ИндексМагазина            	= ВыпоркаПодразделения.ИндексМагазина;
			ЗаписьПодразделения.Действует         			= ВыпоркаПодразделения.Действует;
			ЗаписьПодразделения.Наименование         		= ВыпоркаПодразделения.Наименование;
			
			ДоступностьДляПодразделений.Добавить(ЗаписьПодразделения);
		КонецЦикла;
		
		СтруктураВыгрузки.Вставить("ДоступностьДляПодразделений", ДоступностьДляПодразделений);
		//МАЛЬЦЕВ А.Ю. ---		
	Иначе
		
		ДисконтныеКарты = Новый ТаблицаЗначений;
		ТипыСкидок = Новый ТаблицаЗначений;
		СкидкиНаНомеклатуру = Новый ТаблицаЗначений;
		ДоступностьДляПодразделений = Новый ТаблицаЗначений;
		
		ЗаписьКарта = ПолучитьЗаписьДискотнаяКарта();
		Для Каждого ТекущееПоле Из ЗаписьКарта Цикл
			Если ТекущееПоле.Значение = Неопределено Тогда
				ДисконтныеКарты.Колонки.Добавить(ТекущееПоле.Ключ);
			Иначе
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипЗнч(ТекущееПоле.Значение));
				ТипКолонки = Новый ОписаниеТипов(МассивТипов);
				ДисконтныеКарты.Колонки.Добавить(ТекущееПоле.Ключ, ТипКолонки);
			КонецЕсли;
		КонецЦикла;
		
		ЗаписьСкидка = ПолучитьЗаписьТипаСкидки();
		Для Каждого ТекущееПоле Из ЗаписьСкидка Цикл
			Если ТекущееПоле.Значение = Неопределено Тогда
				ТипыСкидок.Колонки.Добавить(ТекущееПоле.Ключ);
			Иначе
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипЗнч(ТекущееПоле.Значение));
				ТипКолонки = Новый ОписаниеТипов(МассивТипов);
				ТипыСкидок.Колонки.Добавить(ТекущееПоле.Ключ, ТипКолонки);
			КонецЕсли;
		КонецЦикла;
		
		ЗаписьНомеклатура = ПолучитьЗаписьСкидокНоменклатуры();
		Для Каждого ТекущееПоле Из ЗаписьНомеклатура Цикл
			Если ТекущееПоле.Значение = Неопределено Тогда
				СкидкиНаНомеклатуру.Колонки.Добавить(ТекущееПоле.Ключ);
			Иначе
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипЗнч(ТекущееПоле.Значение));
				ТипКолонки = Новый ОписаниеТипов(МассивТипов);
				СкидкиНаНомеклатуру.Колонки.Добавить(ТекущееПоле.Ключ, ТипКолонки);
			КонецЕсли;
		КонецЦикла;
		
		//МАЛЬЦЕВ А.Ю. +++			

		ЗаписьПодразделения = ПолучитьЗаписьТипаСкидкиПоПодразделениям();
		Для Каждого ТекущееПоле Из ЗаписьПодразделения Цикл
			Если ТекущееПоле.Значение = Неопределено Тогда
				ДоступностьДляПодразделений.Колонки.Добавить(ТекущееПоле.Ключ);
			Иначе
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипЗнч(ТекущееПоле.Значение));
				ТипКолонки = Новый ОписаниеТипов(МассивТипов);
				ДоступностьДляПодразделений.Колонки.Добавить(ТекущееПоле.Ключ, ТипКолонки);
			КонецЕсли;
		КонецЦикла;
		//МАЛЬЦЕВ А.Ю. ---			
	
		Пока ВыборкаДискотныеКарты.Следующий() Цикл
			ЗаписьКарта = ДисконтныеКарты.Добавить();
			ЗаписьКарта.ТипКартыКод      = ВыборкаДискотныеКарты.ТипКартыКод;
			ЗаписьКарта.Наименование     = ВыборкаДискотныеКарты.Наименование;
			ЗаписьКарта.Комментарий      = ВыборкаДискотныеКарты.Комментарий;
			ЗаписьКарта.Код              = ВыборкаДискотныеКарты.Код;
			ЗаписьКарта.КартаКод1С       = СокрЛП(ВыборкаДискотныеКарты.КартаКод1С);
		КонецЦикла;
		
		Пока ВыборкаТипыСкидок.Следующий() Цикл
			ЗаписьСкидка = ТипыСкидок.Добавить();
			ЗаписьСкидка.ИдентификаторСкидкиВОборудовании      = ВыборкаТипыСкидок.ИдентификаторСкидкиВОборудовании;
			ЗаписьСкидка.Наименование              = ВыборкаТипыСкидок.Наименование;
			ЗаписьСкидка.ТипСкидки                 = ВыборкаТипыСкидок.ТипСкидки;
			ЗаписьСкидка.СпособВычисления          = ВыборкаТипыСкидок.СпособВычисления;
			ЗаписьСкидка.КартаКод1С                = СокрЛП(ВыборкаТипыСкидок.КартаКод1С);
			ЗаписьСкидка.НачалоДействия            = ВыборкаТипыСкидок.НачалоДействия;
			ЗаписьСкидка.КонецДействия             = ВыборкаТипыСкидок.КонецДействия;
			ЗаписьСкидка.НачВремя                  = ВыборкаТипыСкидок.НачВремя;
			ЗаписьСкидка.КонВремя                  = ВыборкаТипыСкидок.КонВремя;
			ЗаписьСкидка.ДниНедели                 = ВыборкаТипыСкидок.ДниНедели;
			ЗаписьСкидка.СуммаЧека                 = ВыборкаТипыСкидок.СуммаЧека;
			ЗаписьСкидка.ЗначениеСкидки            = ВыборкаТипыСкидок.ЗначениеСкидки;
			ЗаписьСкидка.СкидкаПоТовару            = ВыборкаТипыСкидок.СкидкаПоТовару;
			ЗаписьСкидка.СоставНабора              = ВыборкаТипыСкидок.СоставНабора;
		КонецЦикла;
		
		Пока ВыборкаНомеклатура.Следующий() Цикл
			ЗаписьНомеклатура = СкидкиНаНомеклатуру.Добавить();
			ЗаписьНомеклатура.ТипСкидки             = ВыборкаНомеклатура.ТипСкидки;
			ЗаписьНомеклатура.УдалитьСкидку         = ВыборкаНомеклатура.УдалитьСкидку;
			ЗаписьНомеклатура.КодПЛУ                = СокрЛП(ВыборкаНомеклатура.КодПЛУ);
			ЗаписьНомеклатура.Наименование          = СокрЛП(ВыборкаНомеклатура.Наименование);
			ЗаписьНомеклатура.СпособВычисления      = ВыборкаНомеклатура.СпособВычисления;
			ЗаписьНомеклатура.Номенклатура          = ВыборкаНомеклатура.Номенклатура;
			ЗаписьНомеклатура.ИдентификаторСкидкиВОборудовании  = ВыборкаНомеклатура.ИдентификаторСкидкиВОборудовании;
			ЗаписьНомеклатура.Количество            = ВыборкаНомеклатура.Количество;
			ЗаписьНомеклатура.ЗначениеСкидки        = ВыборкаНомеклатура.ЗначениеСкидки;
		КонецЦикла;
		
		//МАЛЬЦЕВ А.Ю. +++			
		
		Пока ВыпоркаПодразделения.Следующий() Цикл
			ЗаписьПодразделения = ДоступностьДляПодразделений.Добавить();
			ЗаписьПодразделения.ИдентификаторСкидкиВОборудовании   = ВыпоркаПодразделения.ИдентификаторСкидкиВОборудовании;
			ЗаписьПодразделения.ИндексМагазина            	= ВыпоркаПодразделения.ИндексМагазина;
			ЗаписьПодразделения.Действует         			= ВыпоркаПодразделения.Действует;
			ЗаписьПодразделения.Наименование         		= ВыпоркаПодразделения.Наименование;
			
		КонецЦикла;
		
		СтруктураВыгрузки.Вставить("ДоступностьДляПодразделений", ДоступностьДляПодразделений);
		//МАЛЬЦЕВ А.Ю. ---	
		
		СтруктураВыгрузки.Вставить("ДисконтныеКарты", ДисконтныеКарты);
		СтруктураВыгрузки.Вставить("ТипыСкидок", ТипыСкидок);
		СтруктураВыгрузки.Вставить("СкидкиНаНомеклатуру", СкидкиНаНомеклатуру);
	КонецЕсли;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат СтруктураВыгрузки;
	
КонецФункции

Функция ПолучитьТаблицуНабораСкиди(Хранилище, ЭтоКлиент = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураХранения = Хранилище.Получить();
	Если ТипЗнч(СтруктураХранения) = Тип("Структура") Тогда
		СоставНабора = СтруктураХранения.СоставНабора;
	Иначе
		СоставНабора = СтруктураХранения
	КонецЕсли;
	
	МассивНоменклатуры1 = Новый Массив;
	МассивНоменклатуры2 = Новый Массив;
	МассивКоличества1 = Новый Массив;
	МассивКоличества2 = Новый Массив;
	МассивСкидок1 = Новый Массив;
	МассивСкидок2 = Новый Массив;
	номерПозиции = 0;
	Для каждого СтрокаТЧ из СоставНабора Цикл
		МассивНоменклатуры1.Добавить(СокрЛП(СтрокаТЧ.Номенклатура1.Артикул));
		МассивНоменклатуры2.Добавить(СокрЛП(СтрокаТЧ.Номенклатура2.Артикул));
		МассивКоличества1.Добавить(СтрокаТЧ.Количество1);
		МассивКоличества2.Добавить(СтрокаТЧ.Количество2);
		МассивСкидок1.Добавить(СтрокаТЧ.Скидка1);
		МассивСкидок2.Добавить(СтрокаТЧ.Скидка2);
		// Заполнено только для прохождения проверки заполнения
		номерПозиции = номерПозиции + 1;
	КонецЦикла;

	ТаблицаНаборСостав1 = Новый ТаблицаЗначений;
	ТаблицаНаборСостав1.Колонки.Добавить("Артикул",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(8)));
	ТаблицаНаборСостав1.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНаборСостав1.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,3,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаНаборСостав1.Колонки.Добавить("Скидка",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0)));
	ТаблицаНаборСостав2 = Новый ТаблицаЗначений;
	ТаблицаНаборСостав2.Колонки.Добавить("Артикул",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(8)));
	ТаблицаНаборСостав2.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНаборСостав2.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,3,ДопустимыйЗнак.Неотрицательный)));
	ТаблицаНаборСостав2.Колонки.Добавить("Скидка",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0)));

	Если МассивНоменклатуры1.Количество()>0 Тогда
		номерПозиции = 0;
		Для каждого стрМассив из МассивНоменклатуры1 Цикл
			Если ЗначениеЗаполнено(стрМассив) Тогда
				найдНоменклатура1 = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СокрЛП(стрМассив));
				Если НЕ ЗначениеЗаполнено(найдНоменклатура1) Тогда
					найдНоменклатура1 = Справочники.Номенклатура.НайтиПоКоду(СокрЛП(стрМассив));
				КонецЕсли;
			Иначе
				найдНоменклатура1 = Справочники.Номенклатура.ПустаяСсылка();
			КонецЕсли;
			новСтрокаНабора1 = ТаблицаНаборСостав1.Добавить();
			новСтрокаНабора1.Артикул = ?(ЗначениеЗаполнено(СокрЛП(стрМассив)),найдНоменклатура1.Артикул,СокрЛП(стрМассив));
			новСтрокаНабора1.Номенклатура = найдНоменклатура1;
			
			Если МассивНоменклатуры2.Количество()>0 Тогда
				Если ЗначениеЗаполнено(МассивНоменклатуры2[номерПозиции]) Тогда
					найдНоменклатура2 = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",СокрЛП(МассивНоменклатуры2[номерПозиции]));
					Если НЕ ЗначениеЗаполнено(найдНоменклатура2) Тогда
						найдНоменклатура2 = Справочники.Номенклатура.НайтиПоКоду(СокрЛП(МассивНоменклатуры2[номерПозиции]));
					КонецЕсли;
				Иначе
					найдНоменклатура2 = Справочники.Номенклатура.ПустаяСсылка();
				КонецЕсли;
				//Если НЕ найдНоменклатура2 = Справочники.Номенклатура.ПустаяСсылка() Тогда
					новСтрокаНабора2 = ТаблицаНаборСостав2.Добавить();
					новСтрокаНабора2.Артикул = ?(ЗначениеЗаполнено(СокрЛП(МассивНоменклатуры2[номерПозиции])),найдНоменклатура2.Артикул,СокрЛП(МассивНоменклатуры2[номерПозиции]));
					новСтрокаНабора2.Номенклатура = найдНоменклатура2;
				//КонецЕсли;
			КонецЕсли;
			
			Если МассивКоличества1.Количество()>0 Тогда
				новСтрокаНабора1.Количество = СтрЗаменить(МассивКоличества1[номерПозиции],".",",");
			КонецЕсли;
			
			Если МассивКоличества2.Количество()>0 Тогда
				новСтрокаНабора2.Количество = СтрЗаменить(МассивКоличества2[номерПозиции],".",",");
			КонецЕсли;
			
			Если МассивСкидок1.Количество()>0 Тогда
				новСтрокаНабора1.Скидка = МассивСкидок1[номерПозиции];
			КонецЕсли;
			
			Если МассивСкидок2.Количество()>0 Тогда
				новСтрокаНабора2.Скидка = МассивСкидок2[номерПозиции];
			КонецЕсли;
			
			номерПозиции = номерПозиции + 1;
		КонецЦикла;
	КонецЕсли;

	ЗапросНаборСкидок = Новый Запрос(
	"ВЫБРАТЬ
	|	Данные1.Артикул,
	|	Данные1.Количество,
	|	Данные1.Скидка
	|ПОМЕСТИТЬ ДанныеСкидки1
	|ИЗ
	|	&ТаблицаДанных1 КАК Данные1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные2.Артикул,
	|	Данные2.Количество,
	|	Данные2.Скидка
	|ПОМЕСТИТЬ ДанныеСкидки2
	|ИЗ
	|	&ТаблицаДанных2 КАК Данные2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСкидки1.Артикул КАК Артикул1,
	|	ДанныеСкидки1.Количество КАК Количество1,
	|	ДанныеСкидки1.Скидка КАК Скидка1,
	|	спрНоменклатура1.Ссылка КАК Номенклатура1,
	|	ДанныеСкидки2.Артикул КАК Артикул2,
	|	ДанныеСкидки2.Количество КАК Количество2,
	|	ДанныеСкидки2.Скидка КАК Скидка2,
	|	ДанныеСкидки2.Номенклатура КАК Номенклатура2
	|ИЗ
	|	ДанныеСкидки1 КАК ДанныеСкидки1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура1
	|		ПО ДанныеСкидки1.Артикул = спрНоменклатура1.Артикул
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|		ДанныеСкидки2.Артикул КАК Артикул,
	|		ДанныеСкидки2.Количество КАК Количество,
	|		ДанныеСкидки2.Скидка КАК Скидка,
	|		спрНоменклатура2.Ссылка КАК Номенклатура
	|	ИЗ
	|		ДанныеСкидки2 КАК ДанныеСкидки2
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура2
	|			ПО ДанныеСкидки2.Артикул = спрНоменклатура2.Артикул
	|	ГДЕ
	|		ДанныеСкидки2.Количество > 0 И ДанныеСкидки2.Артикул<>"""") КАК ДанныеСкидки2
	|	ПО (ИСТИНА)
	|ГДЕ
	|	ДанныеСкидки1.Количество > 0 И ДанныеСкидки1.Артикул<>""""
	|	И (ДанныеСкидки1.Скидка <> 0
	|	ИЛИ ДанныеСкидки2.Скидка <> 0)");
	ЗапросНаборСкидок.УстановитьПараметр("ТаблицаДанных1",ТаблицаНаборСостав1);
	ЗапросНаборСкидок.УстановитьПараметр("ТаблицаДанных2",ТаблицаНаборСостав2);
	РезЗапросаНаборСкидок = ЗапросНаборСкидок.Выполнить().Выбрать();
	
	Если ЭтоКлиент Тогда
		НаборСкидки = Новый Массив;
		
		Пока РезЗапросаНаборСкидок.Следующий() Цикл
			ЗаписьНабор = ПолучитьЗаписьНабораСкидки();
			ЗаписьНабор.Артикул1		= РезЗапросаНаборСкидок.Артикул1;
			ЗаписьНабор.Количество1		= РезЗапросаНаборСкидок.Количество1;
			ЗаписьНабор.Скидка1			= РезЗапросаНаборСкидок.Скидка1;
			ЗаписьНабор.Номенклатура1	= РезЗапросаНаборСкидок.Номенклатура1;
			ЗаписьНабор.Артикул2		= РезЗапросаНаборСкидок.Артикул2;
			ЗаписьНабор.Количество2		= РезЗапросаНаборСкидок.Количество2;
			ЗаписьНабор.Скидка2			= РезЗапросаНаборСкидок.Скидка2;
			ЗаписьНабор.Номенклатура2	= РезЗапросаНаборСкидок.Номенклатура2;
			
			НаборСкидки.Добавить(ЗаписьНабор);
		КонецЦикла;
		
	Иначе
		НаборСкидки = Новый ТаблицаЗначений;
		
		ЗаписьНабор = ПолучитьЗаписьНабораСкидки();
		Для Каждого ТекущееПоле Из ЗаписьНабор Цикл
			Если ТекущееПоле.Значение = Неопределено Тогда
				НаборСкидки.Колонки.Добавить(ТекущееПоле.Ключ);
			Иначе
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипЗнч(ТекущееПоле.Значение));
				ТипКолонки = Новый ОписаниеТипов(МассивТипов);
				НаборСкидки.Колонки.Добавить(ТекущееПоле.Ключ, ТипКолонки);
			КонецЕсли;
		КонецЦикла;
		
		Пока РезЗапросаНаборСкидок.Следующий() Цикл
			ЗаписьНабор = НаборСкидки.Добавить();
			ЗаписьНабор.Артикул1		= РезЗапросаНаборСкидок.Артикул1;
			ЗаписьНабор.Количество1		= РезЗапросаНаборСкидок.Количество1;
			ЗаписьНабор.Скидка1			= РезЗапросаНаборСкидок.Скидка1;
			ЗаписьНабор.Номенклатура1	= РезЗапросаНаборСкидок.Номенклатура1;
			ЗаписьНабор.Артикул2		= РезЗапросаНаборСкидок.Артикул2;
			ЗаписьНабор.Количество2		= РезЗапросаНаборСкидок.Количество2;
			ЗаписьНабор.Скидка2			= РезЗапросаНаборСкидок.Скидка2;
			ЗаписьНабор.Номенклатура2	= РезЗапросаНаборСкидок.Номенклатура2;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат НаборСкидки;
	
КонецФункции

Функция ПолучитьТаблицуПерсонала(Оборудование, ЭтоКлиент, МоментПоследнейЗагрузки = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МоментПоследнейЗагрузки = ?(МоментПоследнейЗагрузки = Неопределено, ТекущаяДата(), МоментПоследнейЗагрузки);
	
	Запрос = Новый Запрос;
	// Изменено для МР - dmboro ++
	Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Пользователи.КодКассираPOS КАК Код,
	//|	СведенияОСотрудникахСрезПоследних.Сотрудник.Наименование КАК Наименование,
	//|	Пользователи.ПарольККМ КАК ПарольКассира
	//|ИЗ
	//|	РегистрСведений.СведенияОСотрудниках.СрезПоследних(
	//|			&Дата,
	//|			ПодразделениеКомпании = &ПодразделениеКомпании
	//|				И Должность = ЗНАЧЕНИЕ(Справочник.Должности.Кассир)) КАК СведенияОСотрудникахСрезПоследних
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	//|	Справочник.Пользователи КАК Пользователи
	//|ПО
	//|	СведенияОСотрудникахСрезПоследних.Сотрудник = Пользователи.Сотрудник
	//|ГДЕ
	//|	(НЕ Пользователи.КодКассираPOS = """") И
	//|	(НЕ Пользователи.ПарольККМ = """") И 
	//|	СведенияОСотрудникахСрезПоследних.Сотрудник.ФлагУволен = ЛОЖЬ";
	//
	//Запрос.УстановитьПараметр("Дата",                  ТекущаяДата());
	//Запрос.УстановитьПараметр("ПодразделениеКомпании", Оборудование.ОсновнойОтдел.ПодразделениеКомпании);
	
	// Запрос взят из модуля "Розница_ОбменСоСтороннимиСистемами.epf". Согласовано с Коновым С, что
	// берём из 1С:Розницы справочник "ит_Продавцы" и используем его для получения и последующей
	// выгрузки в УКМ СуперМаг, всего списка действующих проадвцов, выгружаемого во все магазины
	// по списку подключаемого оборудования с типом "Рарус" и типом рарус "POS".
		"ВЫБРАТЬ
		|	ит_Продавцы.Наименование КАК Наименование,
		|	ит_Продавцы.ШтрихКод КАК ШтрихКод,
		//+Сарабеев К.А
		//|	ВЫБОР
		//|		КОГДА ит_Продавцы.ПометкаУдаления
		//|				ИЛИ ит_Продавцы.Заблокирован
		//|			ТОГДА 1
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК Удален,
		|	ВЫБОР
		|		КОГДА ит_Продавцы.ПометкаУдаления
		|				ИЛИ ит_Продавцы.Заблокирован
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Удален,
		//-Сарабеев К.А.
		|	ит_Продавцы.ПарольМенеджера КАК ПарольМенеджера,
		|	ВЫБОР
		|		КОГДА ит_ТорговыеТочки_ОтветственныеСрезПоследних.Менеджер ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЭтоЛинейныйМенеджер,    
		//+Сарабеев К.А.
		|	ит_Продавцы.Должность КАК Должность
		//-Сарабеев К.А.
		|ПОМЕСТИТЬ ВсеПродавцы
		|ИЗ
		|	Справочник.ит_Продавцы КАК ит_Продавцы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ит_ТорговыеТочки_Ответственные.СрезПоследних(, ТорговаяТочка = &ПодразделениеКомпании) КАК ит_ТорговыеТочки_ОтветственныеСрезПоследних
		|		ПО ит_Продавцы.ФизическоеЛицо = ит_ТорговыеТочки_ОтветственныеСрезПоследних.Менеджер
		|ГДЕ
		|	ит_Продавцы.ДатаПоследнегоИзменения >= &МоментПоследнейЗагрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВсеПродавцы.Наименование) КАК Наименование,
		|	ВсеПродавцы.ШтрихКод КАК Код,
		|	МИНИМУМ(ВсеПродавцы.Удален) КАК Удален,
		|	МАКСИМУМ(ВсеПродавцы.ПарольМенеджера) КАК ПарольКассира,
		|	МАКСИМУМ(ВсеПродавцы.ЭтоЛинейныйМенеджер) КАК ЭтоЛинейныйМенеджер,
		//+Сарабеев К.А.
		|	ВЫБОР
		|		КОГДА ВсеПродавцы.Должность = ""Управляющий магазином Центра мясной гастрономии""
		|			ТОГДА 10002
		|		ИНАЧЕ 10001
		|	КОНЕЦ КАК Должность
		//-Сарабеев К.А.
		|ИЗ
		|	ВсеПродавцы КАК ВсеПродавцы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеПродавцы.ШтрихКод,
		|	ВЫБОР
		|		КОГДА ВсеПродавцы.Должность = ""Управляющий магазином Центра мясной гастрономии""
		|			ТОГДА 10002
		|		ИНАЧЕ 10001
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("МоментПоследнейЗагрузки", МоментПоследнейЗагрузки);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Оборудование.ОсновнойОтдел.ПодразделениеКомпании);
	// dmboro --
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаписьПерсонал = Неопределено;
	Если ЭтоКлиент Тогда
		ПерсоналКВыгрузке = Новый Массив;
		Пока Выборка.Следующий() Цикл
			ЗаписьПерсонал = ПолучитьЗаписьПерсонала();
			ЗаписьПерсонал.Код             		 = Выборка.Код;
			ЗаписьПерсонал.Наименование    		 = Выборка.Наименование;
			ЗаписьПерсонал.ПарольКассира   		 = Выборка.ПарольКассира;
			ЗаписьПерсонал.ЭтоЛинейныйМенеджер   = Выборка.ЭтоЛинейныйМенеджер;
			
			ПерсоналКВыгрузке.Добавить(ЗаписьПерсонал);
		КонецЦикла;
	Иначе
		ПерсоналКВыгрузке = Новый ТаблицаЗначений;
		
		ЗаписьПерсонал = ПолучитьЗаписьПерсонала();
		Для Каждого ТекущееПоле Из ЗаписьПерсонал Цикл
			Если ТекущееПоле.Значение = Неопределено Тогда
				ПерсоналКВыгрузке.Колонки.Добавить(ТекущееПоле.Ключ);
			Иначе
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипЗнч(ТекущееПоле.Значение));
				ТипКолонки = Новый ОписаниеТипов(МассивТипов);
				ПерсоналКВыгрузке.Колонки.Добавить(ТекущееПоле.Ключ, ТипКолонки);
			КонецЕсли;
		КонецЦикла;
		
		Пока Выборка.Следующий() Цикл
			ЗаписьПерсонал = ПерсоналКВыгрузке.Добавить();
			ЗаписьПерсонал.Код             = Выборка.Код;
			ЗаписьПерсонал.Наименование    = Выборка.Наименование;
			ЗаписьПерсонал.ПарольКассира   = Выборка.ПарольКассира;
			ЗаписьПерсонал.ЭтоЛинейныйМенеджер   = Выборка.ЭтоЛинейныйМенеджер;
			//+Сарабеев К.А. 13.10.2025
			ЗаписьПерсонал.Должность   		= Выборка.Должность;
			ЗаписьПерсонал.Удален   		= Выборка.Удален;
			//-Сарабеев К.А. 13.10.2025
		КонецЦикла;
	КонецЕсли;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ПерсоналКВыгрузке;
	
КонецФункции

Функция ПолучитьТаблицуКарточек(Оборудование, ЭтоКлиент, МоментПоследнейЗагрузки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	""+"" КАК Режим,
	|	ШтрихКоды.ШтрихКод КАК КодКарты,
	|	Карточки.Код КАК Код,
	|	ЕСТЬNULL(Карточки.Родитель.Код,"""") КАК ТипКартыКод,
	|	ЕСТЬNULL(Карточки.Родитель.Наименование,"""") КАК ТипКартыНаименование,
	|	Карточки.Наименование КАК Представление,
	|	Карточки.Код КАК КартаКод1С,
	|	Карточки.ДатаСоздания КАК НачалоДействия,
	//|	Карточки.ОкончаниеДействия КАК КонецДействия,
	|	ЕСТЬNULL(Карточки.Родитель.Код,""0"") КАК Категория,
	|	ЕСТЬNULL(Карточки.Объект.Код,"""") КАК КодПокупателя,
	|	ЕСТЬNULL(Карточки.Объект.Наименование,"""") КАК Покупатель,
	|	ЕСТЬNULL(СуммыНакопления.Сумма,0) КАК СуммаНакопления
	|ИЗ
	|	Справочник.Карточки КАК Карточки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
	|	ПО ШтрихКоды.Объект=Карточки.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ (
	|				ВЫБРАТЬ
	|					СУММА(ПредоставленныеСкидкиОбороты.СуммаОборот) КАК Сумма,
	|					ПредоставленныеСкидкиОбороты.Карточка КАК Карточка
	|				ИЗ
	|					РегистрНакопления.НакопленияПоКарточкамКонтрагентов.Обороты(, &Момент, , ) КАК ПредоставленныеСкидкиОбороты
	|				СГРУППИРОВАТЬ ПО
	|					ПредоставленныеСкидкиОбороты.Карточка		
	|	) КАК СуммыНакопления
	|	ПО Карточки.Ссылка = СуммыНакопления.Карточка
	|ГДЕ
	|	НЕ ЭтоГруппа
	|	И НЕ ПометкаУдаления
	|	И ШтрихКоды.ШтрихКод<>""""
	|	И Карточки.МоментИзменения>=&МоментИзменения
	|";
	Запрос.УстановитьПараметр("МоментИзменения",МоментПоследнейЗагрузки);
	Запрос.УстановитьПараметр("Момент",КонецДня(ТекущаяДата()));
	РезультатКарты=Запрос.Выполнить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаписьКарточка = Неопределено;
	Если ЭтоКлиент Тогда
		КарточкиКВыгрузке = Новый Массив;
		Пока Выборка.Следующий() Цикл
			ЗаписьКарточка = ПолучитьЗаписьКарточки();
			ЗаписьКарточка.Режим                   = Выборка.Режим;
			ЗаписьКарточка.КодКарты                = Выборка.КодКарты;
			ЗаписьКарточка.Код                     = Выборка.Код;
			ЗаписьКарточка.ТипКартыКод             = Выборка.ТипКартыКод;
			ЗаписьКарточка.ТипКартыНаименование    = Выборка.ТипКартыНаименование;
			ЗаписьКарточка.Представление           = Выборка.Представление;
			ЗаписьКарточка.КартаКод1С              = Выборка.КартаКод1С;
			ЗаписьКарточка.НачалоДействия          = Выборка.НачалоДействия;
			ЗаписьКарточка.Категория               = Выборка.Категория;
			ЗаписьКарточка.КодПокупателя           = Выборка.КодПокупателя;
			ЗаписьКарточка.Покупатель              = Выборка.Покупатель;
			ЗаписьКарточка.СуммаНакопления         = Выборка.СуммаНакопления;
			
			КарточкиКВыгрузке.Добавить(ЗаписьКарточка);
		КонецЦикла;
	Иначе
		КарточкиКВыгрузке = Новый ТаблицаЗначений;
		
		ЗаписьКарточка = ПолучитьЗаписьКарточки();
		Для Каждого ТекущееПоле Из ЗаписьКарточка Цикл
			Если ТекущееПоле.Значение = Неопределено Тогда
				КарточкиКВыгрузке.Колонки.Добавить(ТекущееПоле.Ключ);
			Иначе
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипЗнч(ТекущееПоле.Значение));
				ТипКолонки = Новый ОписаниеТипов(МассивТипов);
				КарточкиКВыгрузке.Колонки.Добавить(ТекущееПоле.Ключ, ТипКолонки);
			КонецЕсли;
		КонецЦикла;
		
		Пока Выборка.Следующий() Цикл
			ЗаписьКарточка = КарточкиКВыгрузке.Добавить();
			ЗаписьКарточка.Режим                   = Выборка.Режим;
			ЗаписьКарточка.КодКарты                = Выборка.КодКарты;
			ЗаписьКарточка.Код                     = Выборка.Код;
			ЗаписьКарточка.ТипКартыКод             = Выборка.ТипКартыКод;
			ЗаписьКарточка.ТипКартыНаименование    = Выборка.ТипКартыНаименование;
			ЗаписьКарточка.Представление           = Выборка.Представление;
			ЗаписьКарточка.КартаКод1С              = Выборка.КартаКод1С;
			ЗаписьКарточка.НачалоДействия          = Выборка.НачалоДействия;
			ЗаписьКарточка.Категория               = Выборка.Категория;
			ЗаписьКарточка.КодПокупателя           = Выборка.КодПокупателя;
			ЗаписьКарточка.Покупатель              = Выборка.Покупатель;
			ЗаписьКарточка.СуммаНакопления         = Выборка.СуммаНакопления;
		КонецЦикла;
	КонецЕсли;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат КарточкиКВыгрузке;
	
КонецФункции

Процедура ЗаписатьШтрихкод(Выборка, Запись, ТаблицаШтрихКодов)
	
	Если Выборка.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Штрихкоды = ТаблицаШтрихКодов.НайтиСтроки(Новый Структура("Номенклатура",Выборка.Номенклатура));
	
	Для Каждого Штрихкод ИЗ Штрихкоды Цикл
		Запись.Штрихкоды.Добавить(Штрихкод.Штрихкод);
		
		ШтрихкодСуперМага = Новый Структура;
		ШтрихкодСуперМага.Вставить("Штрихкод",  Штрихкод.Штрихкод);
		ШтрихкодСуперМага.Вставить("Кратность", Штрихкод.Кратность);
		Запись.ШтрихкодыСуперМаг.Добавить(ШтрихкодСуперМага);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьАлкогольныеРеквизиты(Выборка, Запись)
	
	Если ЗначениеЗаполнено(Выборка.ВидАлкогольнойПродукции) Тогда
		Запись.ЭтоАлкоголь = Истина;
		АлкогольныеРеквизиты = Запись.АлкогольныеРеквизиты;
		АлкогольныеРеквизиты.Вставить("Маркируемый",                 Выборка.Маркируемый);
		АлкогольныеРеквизиты.Вставить("КодВидаАлкогольнойПродукции", Выборка.КодВидаАлкогольнойПродукции);
		АлкогольныеРеквизиты.Вставить("ЕмкостьТары",                 Выборка.Объем);
		АлкогольныеРеквизиты.Вставить("Крепость",                    Выборка.Крепость);
		АлкогольныеРеквизиты.Вставить("ИННПроизводителя", "");
		АлкогольныеРеквизиты.Вставить("КПППроизводителя", "");
		АлкогольныеРеквизиты.Вставить("ВРозлив", Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьМоментЗагрузки(Оборудование,ВидЗагружаемойИнформации,НомерPOS,МоментВыгрузкиДанных) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьМомент = РегистрыСведений.МоментыПоследнейЗагрузки.СоздатьМенеджерЗаписи();
	ЗаписьМомент.Оборудование = Оборудование;
	ЗаписьМомент.ВидЗагружаемойИнформации = Перечисления.ВидыЗагружаемойИнформации[ВидЗагружаемойИнформации];
	ЗаписьМомент.НомерPOS = НомерPOS;
	ЗаписьМомент.МоментПоследнейЗагрузки = МоментВыгрузкиДанных;
	
	Попытка
		ЗаписьМомент.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Розничные продажи'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Событие вызываемое после успешной выгрузки данных на оборудование. Тип офлайн оборудования: ККМ, Прайс-чекер
// Вызывается при файловом или Web-сервис обмене 
//    (методы EquipmentService: GetSettings; GetPriceList; GetPriceListPackage; GetDocs, DocType = "Order")
//
// Параметры:
//   ОфлайнОборудование - Справочник.ПодключаемоеОборудование - ссылка на экземпляр оборудования.
//   НаборВыгруженныхДанных - Структура - структура, в которой описаны типы наборов выгруженных данных "Настройки", "ПрайсЛист", "Заказы";
//   в зависимости от набора необходимо снимать данные с регистрации в узлах обмена.
//
Процедура ПослеУспешнойВыгрузкиДанных(ОфлайнОборудование, Набор) Экспорт
	
	Если ПолучитьЗначениеПараметраСтруктуры(Набор, "ВыгружатьТовары", Ложь) Тогда
		// снять с регистрации товары
	КонецЕсли;
	
	Если ПолучитьЗначениеПараметраСтруктуры(Набор, "ВыгружатьСкидки", Ложь) Тогда
		// снять с регистрации скидки
	КонецЕсли;
	
	Если ПолучитьЗначениеПараметраСтруктуры(Набор, "ВыгружатьПерсонал", Ложь) Тогда
		// снять с регистрации скидки
	КонецЕсли;
	
	//Набор.ПолнаяВыгрузка
	
КонецПроцедуры

Функция ПолучитьИндексМагазина(Оборудование) Экспорт 
	Возврат Оборудование.ИндексМагазина;
КонецФункции

Функция РазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ";") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока Истина Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтруктуруОтдела(ОсновнойОтдел) Экспорт
	
	СтруктураОтдела = Новый Структура();
	СтруктураОтдела.Вставить("КодОрганизации", СокрЛП(ОсновнойОтдел.Организация.Код));
	СтруктураОтдела.Вставить("ИННОрганизации", СокрЛП(ОсновнойОтдел.Организация.ИНН));
	СтруктураОтдела.Вставить("Подразделение", СтрЗаменить(ОсновнойОтдел.ПодразделениеКомпании.Наименование,"'",""""));
	СтруктураОтдела.Вставить("Склад", СтрЗаменить(ОсновнойОтдел.Наименование,"'",""""));
	СтруктураОтдела.Вставить("ТипЦен", СтрЗаменить(ОсновнойОтдел.ТипЦенРозничнойТорговли.Наименование,"'",""""));
	СтруктураОтдела.Вставить("КодТипаЦен", СокрЛП(ОсновнойОтдел.ТипЦенРозничнойТорговли.Код));
	
	Возврат СтруктураОтдела;
	
КонецФункции //ПолучитьСтруктуруОтдела()

#КонецОбласти

// Пустая структура для заполнения массива Товары прайс-листа выгружаемого на оборудование,
// прайс-лист заполняется в МенеджерОфлайнОборудованияПереопределяемый.ПриВыгрузкеПрайсЛиста
//
Функция ПолучитьЗаписьТовара() Экспорт
	
	ЗаписьТовара = Новый Структура;
	ЗаписьТовара.Вставить("Код");
	ЗаписьТовара.Вставить("Штрихкоды", Новый Массив);
	ЗаписьТовара.Вставить("ШтрихкодыСуперМаг", Новый Массив);
	ЗаписьТовара.Вставить("Цена");
	ЗаписьТовара.Вставить("Наименование");

	ЗаписьТовара.Вставить("СтавкаНДС");
	ЗаписьТовара.Вставить("СтавкаНДСУКМ5");	
	ЗаписьТовара.Вставить("ЕдиницаИзмерения");
	ЗаписьТовара.Вставить("Родитель");
	ЗаписьТовара.Вставить("КодГруппы");
	ЗаписьТовара.Вставить("Артикул");
	ЗаписьТовара.Вставить("ЭтоВесовой", Ложь);
	ЗаписьТовара.Вставить("ЭтоГруппа", Ложь);
	ЗаписьТовара.Вставить("ОсобенностьУчета");
	ЗаписьТовара.Вставить("ПризнакПредметаРасчета");
	ЗаписьТовара.Вставить("КоличествоВМультипаке");
	ЗаписьТовара.Вставить("Крепость");
	ЗаписьТовара.Вставить("Остаток",0);
	ЗаписьТовара.Вставить("МРЦ",0);
	ЗаписьТовара.Вставить("БлокироватьКПродаже",Ложь);
	ЗаписьТовара.Вставить("Картинка","");
	ЗаписьТовара.Вставить("КартинкаКСО","");

	ЗаписьТовара.Вставить("ГруппаКСО","");
	ЗаписьТовара.Вставить("ИДГруппаКСО","");
	ЗаписьТовара.Вставить("КартинкаГруппы","");
	ЗаписьТовара.Вставить("ПорядокГруппы","");
	ЗаписьТовара.Вставить("ПорядокВГруппеКСО","");

	// Алкоголь
	ЗаписьТовара.Вставить("ЭтоАлкоголь", Ложь);
	АлкогольныеРеквизиты = Новый Структура;
	ЗаписьТовара.Вставить("АлкогольныеРеквизиты", АлкогольныеРеквизиты);
	
	Возврат ЗаписьТовара;
	
КонецФункции

Функция ПолучитьЗаписьМарки() Экспорт
	
	ЗаписьТовара = Новый Структура;
	ЗаписьТовара.Вставить("GTIN");
	ЗаписьТовара.Вставить("КодМарки");
	ЗаписьТовара.Вставить("ШтрихкодыСуперМаг");
	ЗаписьТовара.Вставить("Удален");
	ЗаписьТовара.Вставить("ДатаИстеченияСрокаГодности");
	
	Возврат ЗаписьТовара;
	
КонецФункции
Функция ПолучитьГруппыКСО_ДляУдаления(МоментПоследнейВыгрузки, Артикул, ИДТекГруппы) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итГруппыКСОНоменклатуры.Период КАК Период,
	|	итГруппыКСОНоменклатуры.Номенклатура КАК Номенклатура,
	|	итГруппыКСОНоменклатуры.ГруппаКСО КАК ГруппаКСО,
	|	итГруппыКСОНоменклатуры.ГруппаКСО.ИДГруппы КАК ИДГруппы
	|ИЗ
	|	РегистрСведений.итГруппыКСОНоменклатуры КАК итГруппыКСОНоменклатуры
	|ГДЕ
	|	итГруппыКСОНоменклатуры.Номенклатура.Артикул = &Артикул
	|	И итГруппыКСОНоменклатуры.ГруппаКСО.ИДГруппы <> &ИДТекГруппы
	|	И итГруппыКСОНоменклатуры.Период >= &МоментПоследнейВыгрузки";
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.УстановитьПараметр("МоментПоследнейВыгрузки", МоментПоследнейВыгрузки);

	Запрос.УстановитьПараметр("ИДТекГруппы", Число(ИДТекГруппы));
	
	массГрупп = Новый Массив;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МЗ = РегистрыСведений.итГруппыКСОНоменклатуры.СоздатьМенеджерЗаписи();
		МЗ.Период = Выборка.Период;
		МЗ.Номенклатура = Выборка.Номенклатура;
		МЗ.ГруппаКСО 	= Выборка.ГруппаКСО;
		МЗ.Удалена = Истина;
		МЗ.Записать();
		
		массГрупп.Добавить(Выборка.ИДГруппы);
			
	КонецЦикла;
	
	
	Возврат массГрупп;
	
КонецФункции

Функция ПолучитьГруппыКСО() Экспорт
	
	Узел 			 = ПланыОбмена.итОбменКСО.НайтиПоКоду("КСО");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итГруппыНоменклатурыКСОИзменения.Ссылка КАК Ссылка,
	|	итГруппыНоменклатурыКСОИзменения.Ссылка.Наименование КАК ГруппаКСО,
	|	итГруппыНоменклатурыКСОИзменения.Ссылка.ИДГруппы КАК ИДГруппы,
	|	итГруппыНоменклатурыКСОИзменения.Ссылка.КартинкаГруппы КАК КартинкаГруппы,
	|	итГруппыНоменклатурыКСОИзменения.Ссылка.Порядок КАК ПорядокГруппы
	|ИЗ
	|	Справочник.итГруппыНоменклатурыКСО.Изменения КАК итГруппыНоменклатурыКСОИзменения
	|ГДЕ
	|	итГруппыНоменклатурыКСОИзменения.Узел = &Узел
	|	И итГруппыНоменклатурыКСОИзменения.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Узел", Узел);
	
	массГрупп = Новый Массив;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стСтрока = Новый Структура;
		стСтрока.Вставить("ГруппаКСО",Выборка.ГруппаКСО);
		стСтрока.Вставить("ИДГруппы",Выборка.ИДГруппы);
		стСтрока.Вставить("КартинкаГруппы",Выборка.КартинкаГруппы);
		стСтрока.Вставить("ПорядокГруппы",Выборка.ПорядокГруппы);
		
		массГрупп.Добавить(стСтрока);
		
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Выборка.Ссылка);
		
	КонецЦикла;
	
	
	Возврат массГрупп;
	
КонецФункции

Функция ПолучитьВсеГруппыКСО() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итГруппыНоменклатурыКСОИзменения.Ссылка КАК Ссылка,
	|	итГруппыНоменклатурыКСОИзменения.Ссылка.Наименование КАК ГруппаКСО,
	|	итГруппыНоменклатурыКСОИзменения.Ссылка.ИДГруппы КАК ИДГруппы,
	|	итГруппыНоменклатурыКСОИзменения.Ссылка.КартинкаГруппы КАК КартинкаГруппы,
	|	итГруппыНоменклатурыКСОИзменения.Ссылка.Порядок КАК ПорядокГруппы
	|ИЗ
	|	Справочник.итГруппыНоменклатурыКСО КАК итГруппыНоменклатурыКСОИзменения
	|ГДЕ
	|	итГруппыНоменклатурыКСОИзменения.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	массГрупп = Новый Массив;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стСтрока = Новый Структура;
		стСтрока.Вставить("ГруппаКСО",Выборка.ГруппаКСО);
		стСтрока.Вставить("ИДГруппы",Выборка.ИДГруппы);
		стСтрока.Вставить("КартинкаГруппы",Выборка.КартинкаГруппы);
		стСтрока.Вставить("ПорядокГруппы",Выборка.ПорядокГруппы);
		
		массГрупп.Добавить(стСтрока);
				
	КонецЦикла;
	
	
	Возврат массГрупп;
	
КонецФункции

Функция ПолучитьЗаписьГруппыТовара() Экспорт
	
	ЗаписьГруппыТовара = Новый Структура;

	ЗаписьГруппыТовара.Вставить("Код");
	ЗаписьГруппыТовара.Вставить("КодРодителя");
	ЗаписьГруппыТовара.Вставить("Наименование");
	
	Возврат ЗаписьГруппыТовара;
	
КонецФункции

Функция ПолучитьЗаписьНалога() Экспорт
	
	ЗаписьНалога = Новый Структура;
	
	ЗаписьНалога.Вставить("СтавкаНДС");
	
	Возврат ЗаписьНалога;
	
КонецФункции

Функция ПолучитьЗаписьДискотнаяКарта() Экспорт
	
	ЗаписьСкидка = Новый Структура;
	
	ЗаписьСкидка.Вставить("ТипКартыКод");
	ЗаписьСкидка.Вставить("Наименование");
	ЗаписьСкидка.Вставить("Комментарий");
	ЗаписьСкидка.Вставить("Код");
	ЗаписьСкидка.Вставить("КартаКод1С");
	
	Возврат ЗаписьСкидка;
	
КонецФункции

Функция ПолучитьЗаписьНабораСкидки() Экспорт
	
	ЗаписьСкидка = Новый Структура;

	ЗаписьСкидка.Вставить("Артикул1");
	ЗаписьСкидка.Вставить("Количество1");
	ЗаписьСкидка.Вставить("Скидка1");
	ЗаписьСкидка.Вставить("Номенклатура1");
	ЗаписьСкидка.Вставить("Артикул2");
	ЗаписьСкидка.Вставить("Количество2");
	ЗаписьСкидка.Вставить("Скидка2");
	ЗаписьСкидка.Вставить("Номенклатура2");
	
	Возврат ЗаписьСкидка;
	
КонецФункции

Функция ПолучитьЗаписьТипаСкидки() Экспорт
	
	ЗаписьСкидка = Новый Структура;
	
	ЗаписьСкидка.Вставить("ИдентификаторСкидкиВОборудовании");
	ЗаписьСкидка.Вставить("Наименование");
	ЗаписьСкидка.Вставить("ТипСкидки");
	ЗаписьСкидка.Вставить("СпособВычисления");
	ЗаписьСкидка.Вставить("КартаКод1С");
	ЗаписьСкидка.Вставить("НачалоДействия");
	ЗаписьСкидка.Вставить("КонецДействия");
	ЗаписьСкидка.Вставить("НачВремя");
	ЗаписьСкидка.Вставить("КонВремя");
	ЗаписьСкидка.Вставить("ДниНедели");
	ЗаписьСкидка.Вставить("СуммаЧека");
	ЗаписьСкидка.Вставить("ЗначениеСкидки");
	ЗаписьСкидка.Вставить("СкидкаПоТовару");
	ЗаписьСкидка.Вставить("СоставНабора");
	
	Возврат ЗаписьСкидка;
	
КонецФункции

Функция ПолучитьЗаписьСкидокНоменклатуры() Экспорт
	
	ЗаписьСкидка = Новый Структура;
	
	ЗаписьСкидка.Вставить("ТипСкидки");
	ЗаписьСкидка.Вставить("УдалитьСкидку");
	ЗаписьСкидка.Вставить("КодПЛУ");
	ЗаписьСкидка.Вставить("Наименование");
	ЗаписьСкидка.Вставить("СпособВычисления");
	ЗаписьСкидка.Вставить("Номенклатура");
	ЗаписьСкидка.Вставить("ИдентификаторСкидкиВОборудовании");
	ЗаписьСкидка.Вставить("Количество");
	ЗаписьСкидка.Вставить("ЗначениеСкидки");
	ЗаписьСкидка.Вставить("ШтрихКод");

	Возврат ЗаписьСкидка;
	
КонецФункции

Функция ПолучитьЗаписьПерсонала() Экспорт
	
	ЗаписьПерсонал = Новый Структура;
	
	ЗаписьПерсонал.Вставить("Код");
	ЗаписьПерсонал.Вставить("Наименование");
	ЗаписьПерсонал.Вставить("ПарольКассира");
	ЗаписьПерсонал.Вставить("Удален");
	ЗаписьПерсонал.Вставить("ЭтоЛинейныйМенеджер");
	//+Сарабеев К.А. 13.10.2025
	ЗаписьПерсонал.Вставить("Должность");
	//-Сарабеев К.А. 13.10.2025
	
	Возврат ЗаписьПерсонал;
	
КонецФункции

Функция ПолучитьЗаписьКарточки() Экспорт
	
	ЗаписьПерсонал = Новый Структура;
	
	ЗаписьПерсонал.Вставить("Код");
	ЗаписьПерсонал.Вставить("Наименование");
	ЗаписьПерсонал.Вставить("ПарольКассира");
	
	Возврат ЗаписьПерсонал;
	
КонецФункции

//МАЛЬЦЕВ А.Ю. +++
Функция ПолучитьСводнуюТаблицуСкидок(массивПродаж) Экспорт
	
	тзСводнаяТаблица = Новый ТаблицаЗначений();
	тзСводнаяТаблица.Колонки.Добавить("Касса");
	тзСводнаяТаблица.Колонки.Добавить("Смена");
	тзСводнаяТаблица.Колонки.Добавить("КоличествоЧеков");
	тзСводнаяТаблица.Колонки.Добавить("СуммаВсего");
	тзСводнаяТаблица.Колонки.Добавить("СуммаСкидки");
	
	Для Каждого стр Из массивПродаж Цикл
		
		НовСтр = тзСводнаяТаблица.Добавить();
		НовСтр.Касса 			= стр.НомерКассы;
		НовСтр.Смена 			= стр.ИдСмены;
		НовСтр.КоличествоЧеков 	= стр.КоличествоЧеков;
		НовСтр.СуммаВсего 		= стр.СуммаВсего;
		НовСтр.СуммаСкидки 		= стр.СуммаСкидки;
		
	КонецЦикла;
	
	тзСводнаяТаблица.Свернуть("Касса,Смена","КоличествоЧеков,СуммаВсего,СуммаСкидки");
	
	массСвод = Новый Массив;
	
	Для Каждого стрСв Из тзСводнаяТаблица Цикл
		
		стСтроки = Новый Структура;
		стСтроки.Вставить("Касса",			стрСв.Касса);
		стСтроки.Вставить("Смена",			стрСв.Смена);
		стСтроки.Вставить("КоличествоЧеков",стрСв.КоличествоЧеков);
		стСтроки.Вставить("СуммаВсего",		стрСв.СуммаВсего);
		стСтроки.Вставить("СуммаСкидки",	стрСв.СуммаСкидки);
		
		массСвод.Добавить(стСтроки);
		
	КонецЦикла;
	
	Возврат массСвод;
	
КонецФункции

Функция ПолучитьЗаписьТипаСкидкиПоПодразделениям() Экспорт
	
	ЗаписьСкидка = Новый Структура;
	
	ЗаписьСкидка.Вставить("ИдентификаторСкидкиВОборудовании");
	ЗаписьСкидка.Вставить("ИндексМагазина");
	ЗаписьСкидка.Вставить("Действует");
	ЗаписьСкидка.Вставить("Наименование");
	
	Возврат ЗаписьСкидка;
	
КонецФункции

Функция MD5ХешСтрока(тСтрока)  Экспорт
 Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
 
 Хеш.Добавить(тСтрока);
 
 Возврат Хеш.ХешСумма; 
КонецФункции

// ++ МР запись лога при выгрузке на кассу
Процедура ЗаписатьЛог(ИмяТаблицы,СтруктураЗначенийДанных) Экспорт
	ЛогТаблицаМенеджер = РегистрыСведений[ИмяТаблицы].СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЛогТаблицаМенеджер,СтруктураЗначенийДанных);
	ЛогТаблицаМенеджер.Записать();
КонецПроцедуры
// ++ МР запись лога при выгрузке на кассу

#Область ПроцедурыРаботыСФайлами

// Процедура получения содержания текстовых файлов.
// Параметры:
//  ИменаФайлов  - Строка или Массив - имя файла или массив с именами файлов.
//  ОписаниеОповещенияПриЗавершении  - ОписаниеОповещения - вызывается после завершения чтения файлов.
//  Кодировка - КодировкаТекста - кодировка при чтении текстового файла, по умолчанию КодировкаТекста.UTF8.
//
Процедура ПолучитьСодержаниеТекстовыхФайлов(ИменаФайлов, РезультатЧтенияФайлов, Кодировка = Неопределено) Экспорт
	
	ПомещаемыеФайлы = Новый Массив;
	
	Если Кодировка = Неопределено Тогда
		Кодировка = КодировкаТекста.UTF8;
	КонецЕсли;
	
	Если ТипЗнч(ИменаФайлов) = Тип("Строка") Тогда
		ОписаниеФайла = Новый ОписаниеПередаваемогоФайла(ИменаФайлов);
		ПомещаемыеФайлы.Добавить(ОписаниеФайла);
	ИначеЕсли ТипЗнч(ИменаФайлов) = Тип("Массив") Тогда
		Если ИменаФайлов.Количество() = 0 Тогда
			РезультатЧтенияФайлов = Новый Структура;
			РезультатЧтенияФайлов.Вставить("СодержаниеФайлов", Новый Массив);
			РезультатЧтенияФайлов.Вставить("Успешно", Истина);
			РезультатЧтенияФайлов.Вставить("ТекстОшибки","");
			//ВыполнитьОбработкуОповещения(ОписаниеОповещенияПриЗавершении, РезультатЧтенияФайлов);
			Возврат;
		Иначе
			Для Каждого ИмяФайла Из ИменаФайлов Цикл
				ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ИмяФайла));
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Содержание = Новый Массив;
	РезультатЧтенияФайлов = Новый Структура;
	РезультатЧтенияФайлов.Вставить("СодержаниеФайлов", Неопределено);
	РезультатЧтенияФайлов.Вставить("Успешно", Ложь);
	РезультатЧтенияФайлов.Вставить("ТекстОшибки", "");
	
	Для Каждого Файл Из ПомещаемыеФайлы Цикл
		
		СтруктураСодержанияФайла = Новый Структура;
		
		Попытка
			ЧтениеТекста = Новый ЧтениеТекста(Файл.Имя, Кодировка);
			ТекстСодержания = ЧтениеТекста.Прочитать();
		Исключение
			
			ТекстСообщения =  НСтр("ru = 'При чтении файла %ИмяФайла% произошла ошибка'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяФайла%", Файл.Имя);
			
			РезультатЧтенияФайлов.ТекстОшибки = ТекстСообщения + Символы.ПС + ОписаниеОшибки();
			//ВыполнитьОбработкуОповещения(ОписаниеОповещенияПриЗавершении, РезультатЧтенияФайлов);
			Возврат;
			
		КонецПопытки;
		
		СтруктураСодержанияФайла.Вставить("ОписаниеПереданногоФайла", Файл);
		СтруктураСодержанияФайла.Вставить("ТекстСодержания",          ТекстСодержания);
		
		Содержание.Добавить(СтруктураСодержанияФайла);
		ЧтениеТекста.Закрыть();
		
	КонецЦикла;
	
	РезультатЧтенияФайлов.Успешно = Истина;
	РезультатЧтенияФайлов.СодержаниеФайлов = Содержание;
	
КонецПроцедуры

#КонецОбласти