#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура обработки печати.
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТОРГ12") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_ТОРГ12",
															НСтр("ru = 'ТОРГ-12 (Товарная накладная)'"),
															ПечатьТОРГ12Общая(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТОРГ16") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_ТОРГ16",
															НСтр("ru = 'ТОРГ-16 (Акт списания товаров)'"),
															ПечатьТОРГ16Общая(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТОРГ13") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_ТОРГ13",
															НСтр("ru = 'ТОРГ-13 (Накладная на внутреннее перемещение)'"),
															ПечатьТОРГ13Общая(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТОРГ1") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_ТОРГ1",
															НСтр("ru = 'ТОРГ-1 (Акт о приемке товара)'"),
															ПечатьТОРГ1Общая(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТОРГ2") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_ТОРГ2",
															НСтр("ru = 'ТОРГ-2 (Акт о расхождении по количеству и качеству)'"),
															ПечатьТОРГ2Общая(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;													
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТОРГ4") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_ТОРГ4",
															НСтр("ru = 'ТОРГ-4 (Акт о приемке товаров без счета поставщика)'"),
															ПечатьТОРГ4Общая(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;													
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТТН30122011_Приложение4") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_ТТН30122011_Приложение4",
															НСтр("ru = 'Приложение №4 (Транспортная накладная)'"),
															ПечатьТТНОбщая(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТТН") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_ТТН",
															НСтр("ru = '1-Т (Товарно-транспортная накладная)'"),
															ПечатьТ1Общая(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;													
КонецПроцедуры 

Функция ПечатьТОРГ12Общая(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТОРГ12Общая";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	
	ПервыйДокумент = Истина; 
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ФорматВыводаСуммы      = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		ФорматВыводаКоличества = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Документ);
		
		// Зададим параметры макета
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабличныйДокумент.АвтоМасштаб        = Истина;
		
		// получим данные из документа
		ДанныеДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ).ПолучитьДанныеДляПечатиТОРГ12(Документ);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТОРГ.ПФ_MXL_ТОРГ12");
		
		ОбластьЗаголовок        = Макет.ПолучитьОбласть("Шапка");
		ОбластьЗаголовокТаблицы	= Макет.ПолучитьОбласть("ЗаголовокТаб");
		ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
		ОбластьИтоги			= Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьВсего			= Макет.ПолучитьОбласть("Всего");
		ОбластьПодвал           = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьЗаголовок.Параметры.Заполнить(ДанныеДокумента);
		
		СтруктураПредставления1=Новый Структура;
		СтруктураПредставления1.Вставить("Наименование",     "");
		СтруктураПредставления1.Вставить("ИНН",              "ИНН ");
		СтруктураПредставления1.Вставить("КПП",              "КПП ");
		СтруктураПредставления1.Вставить("АдресЮридический", "");
		СтруктураПредставления1.Вставить("ТелефонРабочий",   "тел.: ");
		СтруктураПредставления1.Вставить("Факс",             "Факс ");
		СтруктураПредставления1.Вставить("БанковскийСчет",   "р/с ");
		СтруктураПредставления1.Вставить("Банк",             НСтр("ru = 'в банке'") + " ");
		СтруктураПредставления1.Вставить("БИК",              "БИК ");
		СтруктураПредставления1.Вставить("КоррСчет",         "к/с ");
		
		СтруктураПредставления2=Новый Структура;
		СтруктураПредставления2.Вставить("Наименование",     "");
		СтруктураПредставления2.Вставить("ИНН",              "ИНН ");
		СтруктураПредставления2.Вставить("КПП",              "КПП ");
		СтруктураПредставления2.Вставить("АдресФактический", "");
		СтруктураПредставления2.Вставить("ТелефонРабочий",   "тел.: ");
		СтруктураПредставления2.Вставить("Факс",             "Факс ");
		СтруктураПредставления2.Вставить("БанковскийСчет",   "р/с ");
		СтруктураПредставления2.Вставить("Банк",             НСтр("ru = 'в банке'") + " ");
		СтруктураПредставления2.Вставить("БИК",              "БИК ");
		СтруктураПредставления2.Вставить("КоррСчет",         "к/с ");
		
		АдресДоставки = "";
		ДанныеДокумента.Свойство("АдресДоставки", АдресДоставки);
		
		СтруктураПредставления3 = Новый Структура;
		СтруктураПредставления3.Вставить("Наименование",     "");
		СтруктураПредставления3.Вставить("ИНН",              "ИНН ");
		СтруктураПредставления3.Вставить("КПП",              "КПП ");
		СтруктураПредставления3.Вставить("ПечатьЗначенияПараметра", АдресДоставки);
		СтруктураПредставления3.Вставить("ТелефонРабочий",   "тел.: ");
		СтруктураПредставления3.Вставить("Факс",             "Факс ");
		СтруктураПредставления3.Вставить("БанковскийСчет",   "р/с ");
		СтруктураПредставления3.Вставить("Банк",             НСтр("ru = 'в банке'") + " ");
		СтруктураПредставления3.Вставить("БИК",              "БИК ");
		СтруктураПредставления3.Вставить("КоррСчет",         "к/с ");
		
		// Дата документа
		ДатаДокумента = Документ.Дата;
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		ОбластьЗаголовок.Параметры.ПредставлениеОрганизации = 
		УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Организация, 
																		СтруктураПредставления1,,,ДатаДокумента,ДополнительныеПараметры);
		
		// Подразделение полное наименование
		ОбластьЗаголовок.Параметры.ПодразделениеКомпании = 
			УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(ОбластьЗаголовок.Параметры.ПодразделениеКомпании);
		
		ОбластьЗаголовок.Параметры.ПредставлениеПоставщика = 
			УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Поставщик, СтруктураПредставления2);
		
		ОбластьЗаголовок.Параметры.ПредставлениеГрузополучателя = 
			УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Грузополучатель, ?(ЗначениеЗаполнено(АдресДоставки), СтруктураПредставления3, СтруктураПредставления2) , Истина , ДанныеДокумента.РасчетныйСчетДокумента);
		
		ОбластьЗаголовок.Параметры.ПредставлениеПлательщика = 
			УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Плательщик, СтруктураПредставления1);
		
		Если ЗначениеЗаполнено(ОбластьЗаголовок.Параметры.ДокументОснование) Тогда 
			Если ОбщегоНазначения.ВидОбъектаПоСсылке(ОбластьЗаголовок.Параметры.ДокументОснование) = "Документ" Тогда
				ОбластьЗаголовок.Параметры.ДокументОснованиеПредставление = 
					УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(ОбластьЗаголовок.Параметры.ДокументОснование);
			Иначе
				ОбластьЗаголовок.Параметры.ДокументОснованиеПредставление = 
					ОбластьЗаголовок.Параметры.ДокументОснование.Наименование;
			КонецЕсли;
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.НомерДокумента = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(Документ);
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		// Готовим шапку
		НомерСтраницы = 2; НомерСтраницыПредыдущий = 2;
		СтруктураИтоговНаСтранице = Новый Структура;
		СтруктураИтоговНаСтранице.Вставить("ИтогоКоличествоМестНаСтранице", 0);
		СтруктураИтоговНаСтранице.Вставить("ИтогоКоличествоНаСтранице",     0);
		СтруктураИтоговНаСтранице.Вставить("ИтогоСуммаБезНДСНаСтранице",    0);
		СтруктураИтоговНаСтранице.Вставить("ИтогоСуммаНДСНаСтранице",       0);
		СтруктураИтоговНаСтранице.Вставить("ИтогоСуммаСНДСНаСтранице",      0);
		СтруктураИтоговНаСтранице.Вставить("ИтогоМассаБруттоНаСтранице",    0);
		
		ОбластьЗаголовокТаблицы.Параметры.Валюта = ДанныеДокумента.ВалютаДокумента;
		ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
		
		ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница:" + " " + НомерСтраницы;
		
		
		// Инициализация итогов по документу.
		ИтогоКоличество = 0;
		ИтогоСумма      = 0;
		ИтогоНДС        = 0;
		ИтогоСуммаСНДС  = 0;
		ИтогоКоличествоМест = 0;
		ИтогоМассаБрутто = 0;
		
		ЕстьКоличествоБазовое = Ложь;
		Если ЕстьРеквизит(ДанныеДокумента, "КоличествоБазовое", "ВыборкаТабличнойЧасти") Тогда
			ЕстьКоличествоБазовое = Истина;
		КонецЕсли;
		
		СоответствиеИтоговПоставкамНДС = Новый Соответствие();
		Для Каждого СтрокаТоваров Из ДанныеДокумента.ВыборкаТабличнойЧасти Цикл
			ДанныеСтрокиСтроки = УправлениеПечатьюПлатформа.ЗаполнитьПредставлениеДанныхТоварнойСтроки(СтрокаТоваров, Документ, ПолучитьЗначениеПараметраСтруктуры(ДанныеДокумента, "ИмяТабличнойЧасти", "Товары"));
			ОбластьСтрока.Параметры.Заполнить(ДанныеСтрокиСтроки);
			ОбластьСтрока.Параметры.ТоварНаименование			    = ДанныеСтрокиСтроки.ТоварНаименование + ?(ЗначениеЗаполнено(СтрокаТоваров.Номенклатура.Артикул),", " + СтрокаТоваров.Номенклатура.Артикул, "");
			ОбластьСтрока.Параметры.ЕдиницаИзмеренияНаименование	= СтрокаТоваров.ЕдиницаИзмерения;
			ОбластьСтрока.Параметры.ЕдиницаИзмеренияКод				= СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
			Если ЕстьКоличествоБазовое Тогда
				ОбластьСтрока.Параметры.Количество				= Формат(СтрокаТоваров.КоличествоБазовое,ФорматВыводаКоличества);
			Иначе
				ОбластьСтрока.Параметры.Количество				= Формат(СтрокаТоваров.Количество,ФорматВыводаКоличества);
			КонецЕсли;
			ОбластьСтрока.Параметры.КоличествоМест				= Формат(СтрокаТоваров.Количество,ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.КоличествоВОдномМесте		= Формат(?(СтрокаТоваров.Количество = 0, 0, СтрокаТоваров.Коэффициент),ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.МассаБрутто = Формат(ДанныеСтрокиСтроки.МассаБрутто,ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.ЦенаБезНДС  = Формат(?(СтрокаТоваров.Количество = 0, 0 , (СтрокаТоваров.СуммаВсего - СтрокаТоваров.СуммаНДС) / (СтрокаТоваров.Количество * ?(СтрокаТоваров.Коэффициент = 0, 1, СтрокаТоваров.Коэффициент))), ФорматВыводаСуммы);
			
			мсвДопОбластиПодвала = Неопределено;
			Если ДанныеДокумента.ВыборкаТабличнойЧасти.Индекс(СтрокаТоваров) = ДанныеДокумента.ВыборкаТабличнойЧасти.Количество()-1 Тогда
				мсвДопОбластиПодвала = Новый Массив;
				мсвДопОбластиПодвала.Добавить(ОбластьВсего);
				мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
			КонецЕсли;
			
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьЗаголовокТаблицы, ОбластьИтоги, НомерСтраницы, СтруктураИтоговНаСтранице, Документ, мсвДопОбластиПодвала);
			
			// Увеличим итоги по странице
			СтруктураСтрокиИтогов = Новый Структура("ИтогоКоличествоМестНаСтранице,ИтогоКоличествоНаСтранице,ИтогоСуммаБезНДСНаСтранице,ИтогоСуммаНДСНаСтранице,ИтогоСуммаСНДСНаСтранице,ИтогоМассаБруттоНаСтранице");
			Если ЕстьКоличествоБазовое Тогда
				СтруктураСтрокиИтогов.ИтогоКоличествоНаСтранице = СтрокаТоваров.КоличествоБазовое;
			Иначе
				СтруктураСтрокиИтогов.ИтогоКоличествоНаСтранице = СтрокаТоваров.Количество;
			КонецЕсли;
			СтруктураСтрокиИтогов.ИтогоМассаБруттоНаСтранице    = ДанныеСтрокиСтроки.МассаБрутто;
			СтруктураСтрокиИтогов.ИтогоКоличествоМестНаСтранице = СтрокаТоваров.Количество;
			СтруктураСтрокиИтогов.ИтогоСуммаБезНДСНаСтранице    = СтрокаТоваров.СуммаВсего-СтрокаТоваров.СуммаНДС;
			СтруктураСтрокиИтогов.ИтогоСуммаНДСНаСтранице       = СтрокаТоваров.СуммаНДС;
			СтруктураСтрокиИтогов.ИтогоСуммаСНДСНаСтранице      = СтрокаТоваров.СуммаВсего;
			ИтогоМассаБрутто = ИтогоМассаБрутто + ДанныеСтрокиСтроки.МассаБрутто;
			
			// Инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПредыдущий Тогда
				СтруктураИтоговНаСтранице = Новый Структура;
				СтруктураИтоговНаСтранице.Вставить("ИтогоКоличествоМестНаСтранице", 0);
				СтруктураИтоговНаСтранице.Вставить("ИтогоКоличествоНаСтранице",     0);
				СтруктураИтоговНаСтранице.Вставить("ИтогоСуммаБезНДСНаСтранице",    0);
				СтруктураИтоговНаСтранице.Вставить("ИтогоСуммаНДСНаСтранице",       0);
				СтруктураИтоговНаСтранице.Вставить("ИтогоСуммаСНДСНаСтранице",      0);
				СтруктураИтоговНаСтранице.Вставить("ИтогоМассаБруттоНаСтранице",    0);
				
				НомерСтраницыПред = НомерСтраницы;
				КоличествоСтрокНаТекущейСтранице=0;
				ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница:" + " " + НомерСтраницы; 
			КонецЕсли;
			
			// Добавляем итоги
			УправлениеПечатьюПлатформа.ДобавитьИтогиПоСтранице(СтруктураСтрокиИтогов,СтруктураИтоговНаСтранице);
		КонецЦикла;
		
		// Выводим последний подвал, если страниц больше единицы.
		Если НомерСтраницы > 2 Тогда
			УправлениеПечатьюПлатформа.ВывестиИтогиПоСтранице(ТабличныйДокумент,ОбластьИтоги,СтруктураИтоговНаСтранице,Документ);
		КонецЕсли;
		
		// Выводим итоги по документу в целом.
		Если ЕстьКоличествоБазовое Тогда
			ОбластьВсего.Параметры.ИтогоКоличество = Формат(ДанныеДокумента.ВыборкаТабличнойЧасти.Итог("КоличествоБазовое"), ФорматВыводаКоличества);
		Иначе
			ОбластьВсего.Параметры.ИтогоКоличество = Формат(ДанныеДокумента.ВыборкаТабличнойЧасти.Итог("Количество"), ФорматВыводаКоличества);
		КонецЕсли;
		ОбластьВсего.Параметры.ИтогоКоличествоМест = Формат(ДанныеДокумента.ВыборкаТабличнойЧасти.Итог("Количество"), ФорматВыводаКоличества);
		ОбластьВсего.Параметры.ИтогоМассаБрутто    = Формат(ИтогоМассаБрутто, ФорматВыводаКоличества);
		ОбластьВсего.Параметры.ИтогоСуммаБезНДС    = Формат(ДанныеДокумента.ВыборкаТабличнойЧасти.Итог("СуммаВсего")-ДанныеДокумента.ВыборкаТабличнойЧасти.Итог("СуммаНДС"), ФорматВыводаСуммы);
		ОбластьВсего.Параметры.ИтогоСуммаНДС       = Формат(ДанныеДокумента.ВыборкаТабличнойЧасти.Итог("СуммаНДС"), ФорматВыводаСуммы);
		ОбластьВсего.Параметры.ИтогоСуммаСНДС      = Формат(ДанныеДокумента.ВыборкаТабличнойЧасти.Итог("СуммаВсего"), ФорматВыводаСуммы);
		ТабличныйДокумент.Вывести(ОбластьВсего);
		
		// Выводим подвал документа.
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента);
		ОбластьПодвал.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(ДанныеДокумента.ВыборкаТабличнойЧасти.Количество(), ,",,,,,,,,0");
		ОбластьПодвал.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ДанныеДокумента.ВыборкаТабличнойЧасти.Итог("СуммаВсего"),ДанныеДокумента.ВалютаДокумента);
		
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.Отпустил);
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.Получил);
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.ГлавныйБухгалтер);
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.Руководитель);
		
		УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьПодвал, , , НомерСтраницы,,Документ);
		
		// Отметим конец области документа.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьТОРГ1Общая(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТОРГ1Общая";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;

	ПервыйДокумент = Истина; 
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ФорматВыводаСуммы      = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		ФорматВыводаКоличества = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Документ);
		
		// Зададим параметры макета
		ТабличныйДокумент.ПолеСлева  		 = 15;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.АвтоМасштаб        = Истина;
		
		// Получим данные из документа
		ДанныеДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ).ПолучитьДанныеДляПечатиТОРГ1(Документ);
	
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТОРГ.ПФ_MXL_ТОРГ1");
		
		ОбластьЗаголовок         = Макет.ПолучитьОбласть("Шапка");
		ОбластьВведение          = Макет.ПолучитьОбласть("Введение");
		ОбластьТаблицаВремени    = Макет.ПолучитьОбласть("ТаблицаВремени");
		ОбластьШапкаТаблицы	 	 = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьСтрока			 = Макет.ПолучитьОбласть("Строка");
		ОбластьСтрокаСертификата = Макет.ПолучитьОбласть("СтрокаСертификата");
		ОбластьИтоги			 = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьВсего			 = Макет.ПолучитьОбласть("Всего");
		ОбластьПодвал            = Макет.ПолучитьОбласть("Подвал");
		ОбластьСтрока2           = Макет.ПолучитьОбласть("СтрокаТаблицы2");
		ОбластьИтоги2			 = Макет.ПолучитьОбласть("ИтогоПоСтранице2");
		ОбластьВсего2			 = Макет.ПолучитьОбласть("Всего2");
		ОбластьОсмотрТовара    	 = Макет.ПолучитьОбласть("ОсмотрТовара");
		ОбластьШапкаТаблицы2     = Макет.ПолучитьОбласть("ЗаголовокТаблицы2");


		ОбластьЗаголовок.Параметры.Заполнить(ДанныеДокумента);

		СтруктураПредставления1=Новый Структура;
		СтруктураПредставления1.Вставить("Наименование",     "");
		СтруктураПредставления1.Вставить("ИНН",              "ИНН ");
		СтруктураПредставления1.Вставить("КПП",              "КПП ");
		СтруктураПредставления1.Вставить("АдресЮридический", "");
		СтруктураПредставления1.Вставить("ТелефонРабочий",   "тел.: ");
		
		СтруктураПредставления2=Новый Структура;
		СтруктураПредставления2.Вставить("Наименование",     "");
		СтруктураПредставления2.Вставить("ИНН",              "ИНН ");
		СтруктураПредставления2.Вставить("КПП",              "КПП ");
		СтруктураПредставления2.Вставить("АдресФактический", "");
		СтруктураПредставления2.Вставить("ТелефонРабочий",   "тел.: ");
		
		// дата документа
		ДатаДокумента = Документ.Дата;
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		// Правим, что автоматом не заполнилось, или заполнилось неправильно.
		Если ЗначениеЗаполнено(ДанныеДокумента.ПодразделениеКомпании) 
			И ЗначениеЗаполнено(ДанныеДокумента.ПодразделениеКомпании.КПП) Тогда
			
			СтрокаПредставления = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Организация,СтруктураПредставления1,,,ДатаДокумента,ДополнительныеПараметры);
			ОбластьЗаголовок.Параметры.ОрганизацияПредставление = 
				СтрЗаменить(СтрокаПредставления, ДанныеДокумента.Организация.КПП, ДанныеДокумента.ПодразделениеКомпании.КПП);
		Иначе	
			ОбластьЗаголовок.Параметры.ОрганизацияПредставление	= 
				УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Организация,СтруктураПредставления1,,,ДатаДокумента,ДополнительныеПараметры);
		КонецЕсли;
		ОбластьЗаголовок.Параметры.КодПоОКПО					= ОбластьЗаголовок.Параметры.Организация.КодПоОКПО;
		ОбластьЗаголовок.Параметры.ВидДеятельностиПоОКДП		= ОбластьЗаголовок.Параметры.Организация.КодПоОКДП;
		
		// Подразделение полное наименование
		ОбластьЗаголовок.Параметры.ПодразделениеКомпании = 
		УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(ДанныеДокумента.ПодразделениеКомпании);
		
		ОбластьЗаголовок.Параметры.Номер		= ?(НЕ ЗначениеЗаполнено(ДанныеДокумента.ВхДокНомер),ДанныеДокумента.номер, ДанныеДокумента.ВхДокНомер);
		ОбластьЗаголовок.Параметры.Дата			= ?(НЕ ЗначениеЗаполнено(ДанныеДокумента.ВхДокНомер),ДанныеДокумента.Дата, ДанныеДокумента.ВхДокДата);
		ОбластьЗаголовок.Параметры.МестоПриемки	= ДанныеДокумента.СкладКомпании;
		
		// Заполним информацию о руководителе организации.
		ОбластьЗаголовок.Параметры.Заполнить(ДанныеДокумента.Руководитель);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);

		// Область введение
		ОбластьВведение.Параметры.Заполнить(ДанныеДокумента);
		ОбластьВведение.Параметры.Грузоотправитель				= ДанныеДокумента.Грузоотправитель;
		ОбластьВведение.Параметры.ГрузоотправительПредставление	= УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьВведение.Параметры.Грузоотправитель,СтруктураПредставления2);
		
		ОбластьВведение.Параметры.Поставщик						= ДанныеДокумента.Контрагент;
		ОбластьВведение.Параметры.ПоставщикПредставление		= УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьВведение.Параметры.Поставщик,СтруктураПредставления1);
		ТабличныйДокумент.Вывести(ОбластьВведение);
		
		// Область таблица времени
		ОбластьТаблицаВремени.Параметры.Заполнить(ДанныеДокумента);
		ТабличныйДокумент.Вывести(ОбластьТаблицаВремени);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// Переменные управляющие постраничным выводом.
		НомерСтраницы   = 2;	
		
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
		ОбластьШапкаТаблицы.Параметры.Валюта = ДанныеДокумента.ВалютаДокумента;
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		ВыборкаСтрок = ДанныеДокумента.ВыборкаТабличнойЧасти;
				
		// Определим имя показываемой колонки кода.
		ИмяКолонкиКода = УправлениеПечатьюПлатформа.ПолучитьПараметрыРежимаВыводаКодаВДокументах().Имя;
		
		// Инициализация итогов по странице.
		ИтогоКоличествоНаСтранице	= 0;
		ИтогоСуммаНаСтранице		= 0;
		ИтогоНДСНаСтранице			= 0;
		ИтогоСНДСНаСтранице			= 0;
		ИтогоМассаБруттоНаСтранице 	= 0;
		
		// Инициализация итогов по документу
		ИтогоКоличество  = 0;
		ИтогоСумма       = 0;
		ИтогоНДС         = 0;
		ИтогоСНДС        = 0;
		Ном              = 0;
		ИтогоМассаБрутто = 0;
		
		// Выводим многострочную часть документа.
		Для каждого СтрокаТоваров Из ВыборкаСтрок Цикл
						
			Если Не (ТабличныйДокумент.ПроверитьВывод(ОбластьСтрока)) Тогда
                  				
				ОбластьИтоги.Параметры.ПоставкаКоличествоПоСтранице  = Формат(ИтогоКоличествоНаСтранице,ФорматВыводаКоличества);
				ОбластьИтоги.Параметры.ПоставкаМассаБруттоПоСтранице = ИтогоМассаБруттоНаСтранице;
				ОбластьИтоги.Параметры.ПоставкаСтоимостьПоСтранице   = Формат(ИтогоСуммаНаСтранице,ФорматВыводаСуммы);
				ТабличныйДокумент.Вывести(ОбластьИтоги);
				
				// Очистим итоги по странице
				ИтогоКоличествоНаСтранице	= 0;
				ИтогоМассаБруттоНаСтранице	= 0;
				ИтогоСуммаНаСтранице		= 0;
				ИтогоНДСНаСтранице			= 0;
				ИтогоСуммаСНДСНаСтранице	= 0;
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(СтрокаТоваров);
			ОбластьСтрока.Параметры.ТоварНаименование             = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(СтрокаТоваров.Номенклатура);
			ОбластьСтрока.Параметры.ТоварКод                      = УправлениеПечатьюПлатформа.ПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура);
			ОбластьСтрока.Параметры.ЕдиницаИзмеренияНаименование  = СтрокаТоваров.ЕдиницаИзмерения;
			ОбластьСтрока.Параметры.ЕдиницаИзмеренияКодПоОКЕИ     = СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код; 
			МассаБруттоСтр										  = СтрокаТоваров.ЕдиницаИзмерения.Вес * СтрокаТоваров.Количество;
			
			ОбластьСтрока.Параметры.ПоставкаКоличествоВОдномМесте	= Формат(СтрокаТоваров.Коэффициент,ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.ПоставкаКоличествоМест			= Формат(СтрокаТоваров.КоличествоБазовое,ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.ПоставкаМассаБрутто				= МассаБруттоСтр;
			ОбластьСтрока.Параметры.ПоставкаСтоимость				= Формат(СтрокаТоваров.Сумма,ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.Цена							= Формат(СтрокаТоваров.Цена,ФорматВыводаСуммы);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			// Увеличим итоги по странице
			ИтогоКоличествоНаСтранице  = ИтогоКоличествоНаСтранице  + СтрокаТоваров.КоличествоБазовое;
			ИтогоМассаБруттоНаСтранице = ИтогоМассаБруттоНаСтранице + МассаБруттоСтр;
			ИтогоСуммаНаСтранице       = ИтогоСуммаНаСтранице       + СтрокаТоваров.Сумма;
			
			// Увеличим итоги по странице
			ИтогоКоличество  = ИтогоКоличество  + СтрокаТоваров.КоличествоБазовое;
			ИтогоМассаБрутто = ИтогоМассаБрутто + МассаБруттоСтр;
			ИтогоСумма       = ИтогоСумма       + СтрокаТоваров.Сумма;
		КонецЦикла;
		
		
		// Выводим итоги по последней странице.
		ОбластьИтоги.Параметры.ПоставкаКоличествоПоСтранице  = Формат(ИтогоКоличествоНаСтранице,ФорматВыводаКоличества);;
		ОбластьИтоги.Параметры.ПоставкаМассаБруттоПоСтранице = ИтогоМассаБруттоНаСтранице;
		ОбластьИтоги.Параметры.ПоставкаСтоимостьПоСтранице   = Формат(ИтогоСуммаНаСтранице,ФорматВыводаСуммы);
		ТабличныйДокумент.Вывести(ОбластьИтоги);
		
		// Выводим итоги по всему документу.
		ОбластьВсего.Параметры.ПоставкаКоличество  = Формат(ИтогоКоличество,ФорматВыводаКоличества);
		ОбластьВсего.Параметры.ПоставкаМассаБрутто = ИтогоМассаБрутто;
		ОбластьВсего.Параметры.ПоставкаСтоимость   = Формат(ИтогоСумма,ФорматВыводаСуммы);
		ТабличныйДокумент.Вывести(ОбластьВсего);

		
		ОбластьОсмотрТовара.Параметры.Заполнить(ДанныеДокумента);
		ТабличныйДокумент.Вывести(ОбластьОсмотрТовара);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ОбластьШапкаТаблицы2.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
		ОбластьШапкаТаблицы2.Параметры.Валюта = ДанныеДокумента.ВалютаДокумента;
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы2);
		
		    // По второй части таблицы
		Для Каждого СтрокаТоваров Из ВыборкаСтрок Цикл
			
		 Если Не (ТабличныйДокумент.ПроверитьВывод(ОбластьСтрока)) Тогда

				ОбластьИтоги2.Параметры.СуммаНДСПоСтранице  = Формат(ИтогоНДСНаСтранице,ФорматВыводаСуммы);
				ОбластьИтоги2.Параметры.СуммаСНДСПоСтранице = Формат(ИтогоСНДСНаСтранице,ФорматВыводаСуммы);
				ТабличныйДокумент.Вывести(ОбластьИтоги2);
				
				// Очистим итоги по странице
				ИтогоКоличествоНаСтранице	= 0;
				ИтогоМассаБруттоНаСтранице	= 0;
				ИтогоСуммаНаСтранице		= 0;
				ИтогоНДСНаСтранице			= 0;
				ИтогоСуммаСНДСНаСтранице	= 0;
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьШапкаТаблицы2.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы2);
			КонецЕсли;
			
			ОбластьСтрока2.Параметры.Заполнить(СтрокаТоваров);
			ОбластьСтрока2.Параметры.СуммаСНДС				  = Формат(СтрокаТоваров.СуммаВсего,ФорматВыводаСуммы);//2
			ОбластьСтрока2.Параметры.СуммаНДС				  = Формат(СтрокаТоваров.СуммаНДС,ФорматВыводаСуммы);
			ТабличныйДокумент.Вывести(ОбластьСтрока2);
			
			// Увеличим итоги по странице
			ИтогоНДСНаСтранице  = ИтогоНДСНаСтранице   + СтрокаТоваров.СуммаНДС;
			ИтогоСНДСНаСтранице = ИтогоСНДСНаСтранице  + СтрокаТоваров.СуммаВсего;
			
			// Увеличим итоги по странице
			ИтогоНДС            = ИтогоНДС          + СтрокаТоваров.СуммаНДС;
			ИтогоСНДС           = ИтогоСНДС         + СтрокаТоваров.СуммаВсего;
		КонецЦикла;
		
		ОбластьИтоги2.Параметры.СуммаНДСПоСтранице  = Формат(ИтогоНДСНаСтранице,ФорматВыводаСуммы);
		ОбластьИтоги2.Параметры.СуммаСНДСПоСтранице = Формат(ИтогоСНДСНаСтранице,ФорматВыводаСуммы);
		ТабличныйДокумент.Вывести(ОбластьИтоги2);
		
		ОбластьВсего2.Параметры.СуммаНДС            = Формат(ИтогоНДС,ФорматВыводаСуммы);
		ОбластьВсего2.Параметры.СуммаСНДС           = Формат(ИтогоСНДС,ФорматВыводаСуммы);
		ТабличныйДокумент.Вывести(ОбластьВсего2);
			
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();

		// Выводим подвал документа.
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента);
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.ГлавныйБухгалтер);
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.МОЛ);
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.ПредседательКомиссии);
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.ЧленКомиссии1);
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.ЧленКомиссии2);

		ТабличныйДокумент.Вывести(ОбластьПодвал);

		// Отметим конец области документа.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции


Функция ПечатьТОРГ2Общая(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТОРГ2Общая";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	
	ПервыйДокумент = Истина; 
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ЭтоПоступление = (ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваров"));
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ФорматВыводаСуммы      = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		ФорматВыводаКоличества = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Документ);
		
		// получим данные из документа
		ДанныеДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ).ПолучитьДанныеДляПечатиТОРГ2(Документ);
		
		// Получим табличную часть за исключением услуг
		тзТовары = ДанныеДокумента.ВыборкаТабличнойЧасти.Выгрузить();
		тзТовары.Колонки.Добавить("Брутто", Новый ОписаниеТипов("Число",
		Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
		тзТовары.Колонки.Добавить("БруттоПоНакладной", Новый ОписаниеТипов("Число",
		Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
		мсвУдалить = Новый Массив;
		
		//Мальцев А.Ю.+++
		тзТовары.Колонки.Добавить("пЦена", Новый ОписаниеТипов("Число",
		Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
		тзТовары.Колонки.Добавить("пСуммаВсего", Новый ОписаниеТипов("Число",
		Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
		
		ДокВСтатусеКонтроля = Ложь;
		Если ДокументНаходитсяВСтатусеКонтроле(Документ) И  ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.ПредварительноеПоступлениеТоваров")  Тогда
			ДокВСтатусеКонтроля =  Истина;
		КонецЕсли;	
		//Мальцев А.Ю.---

		ВсегоПоНакладной = 0;
		Для каждого ТекСтрока Из тзТовары Цикл
			Если ТекСтрока.Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Услуга Тогда
				мсвУдалить.Добавить(ТекСтрока);
				Продолжить;
			КонецЕсли;
			ТекСтрока.Брутто = ТекСтрока.Количество * ТекСтрока.ЕдиницаИзмерения.Вес;
			ТекСтрока.БруттоПоНакладной = ТекСтрока.КоличествоПоНакладной * ТекСтрока.ЕдиницаИзмерения.Вес;
			
			//Мальцев А.Ю.+++
			Если ДокВСтатусеКонтроля Тогда
				
				ПредварительноеПоступление = Документ.ДокументОснование;
				стрНоменклатуры = ПредварительноеПоступление.Товары.Найти(ТекСтрока.Номенклатура, "Номенклатура");
				Если стрНоменклатуры = НЕОПРЕДЕЛЕНО Тогда
					ТекСтрока.КоличествоПоНакладной = 0;
					ТекСтрока.пЦена = ТекСтрока.Цена;					
					ТекСтрока.пСуммаВсего = 0;					
				Иначе
					ТекСтрока.КоличествоПоНакладной = стрНоменклатуры.Количество;
					ТекСтрока.пЦена 				= стрНоменклатуры.Цена;					
					ТекСтрока.пСуммаВсего 			= стрНоменклатуры.СуммаВсего;					
				КонецЕсли;			
				
			КонецЕсли;
			//Мальцев А.Ю.---
			
			ВсегоПоНакладной = ВсегоПоНакладной + ТекСтрока.КоличествоПоНакладной * ТекСтрока.Коэффициент; 
						
		КонецЦикла;
		Для каждого ТекСтрока Из мсвУдалить Цикл
			тзТовары.Удалить(ТекСтрока);	   
		КонецЦикла;

		
		// Зададим параметры макета
		ТабличныйДокумент.ПолеСлева          = 15;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.АвтоМасштаб        = Истина;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТОРГ.ПФ_MXL_ТОРГ2");
		
		ОбластьЗаголовокСтр1        = Макет.ПолучитьОбласть("ШапкаСтраница1");
		ОбластьНомерСтраницы     	= Макет.ПолучитьОбласть("НомерСтраницы");
		ОбластьЗаголовокСтр2        = Макет.ПолучитьОбласть("ШапкаСтраница2");
		ОбластьШапкаТаблицы1	 	= Макет.ПолучитьОбласть("ШапкаТабличнойЧасти");
		ОбластьСтрока1			 	= Макет.ПолучитьОбласть("Строка1");
		ОбластьЗаголовокСтр3        = Макет.ПолучитьОбласть("ШапкаСтраница3");
		ОбластьШапкаТаблицы2	 	= Макет.ПолучитьОбласть("ШапкаТабличнойЧасти2");
		ОбластьСтрока2			 	= Макет.ПолучитьОбласть("Строка2");
		ОбластьПодвал        		= Макет.ПолучитьОбласть("ШапкаСтраница4");

		Параметры = Новый Структура;
		
		СтруктураПредставления1=Новый Структура;
		СтруктураПредставления1.Вставить("Наименование",     "");
		СтруктураПредставления1.Вставить("ИНН",              "ИНН ");
		СтруктураПредставления1.Вставить("КПП",              "КПП ");
		СтруктураПредставления1.Вставить("АдресЮридический", "");
		СтруктураПредставления1.Вставить("ТелефонРабочий",   "тел.: ");
		
		СтруктураПредставления2=Новый Структура;
		СтруктураПредставления2.Вставить("Наименование",     "");
		СтруктураПредставления2.Вставить("ИНН",              "ИНН ");
		СтруктураПредставления2.Вставить("КПП",              "КПП ");
		СтруктураПредставления2.Вставить("АдресФактический", "");
		СтруктураПредставления2.Вставить("ТелефонРабочий",   "тел.: ");
		
		ОбластьЗаголовокСтр1.Параметры.Заполнить(ДанныеДокумента);
		ОбластьЗаголовокСтр1.Параметры.Заполнить(ДанныеДокумента.Руководитель);
		
		// дата документа
		ДатаДокумента = Документ.Дата;
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		// Правим, что автоматом не заполнилось, или заполнилось неправильно
		Если ЗначениеЗаполнено(ДанныеДокумента.ПодразделениеКомпании) И ЗначениеЗаполнено(ДанныеДокумента.ПодразделениеКомпании.КПП) Тогда
			СтрокаПредставления = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ДанныеДокумента.Организация, СтруктураПредставления1,,,ДатаДокумента,ДополнительныеПараметры);
			Параметры.Вставить("ОрганизацияПредставление", СтрЗаменить(СтрокаПредставления, ДанныеДокумента.Организация.КПП, ДанныеДокумента.ПодразделениеКомпании.КПП));
		Иначе	
			Параметры.Вставить("ОрганизацияПредставление", УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ДанныеДокумента.Организация, СтруктураПредставления1,,,ДатаДокумента,ДополнительныеПараметры));
		КонецЕсли;
		Параметры.Вставить("КодПоОКПО",				 ДанныеДокумента.Организация.КодПоОКПО);
		Параметры.Вставить("ВидДеятельностиПоОКДП",	 ДанныеДокумента.Организация.КодПоОКДП);
		
		// Подразделение полное наименование
		ОбластьЗаголовокСтр1.Параметры.ПодразделениеКомпании = 
		УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(ДанныеДокумента.ПодразделениеКомпании);
		
		
		Параметры.Вставить("ПредставлениеДокумента", УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(Документ));
		Параметры.Вставить("Номер",	 ?(НЕ ЗначениеЗаполнено(ДанныеДокумента.ВхДокНомер),ДанныеДокумента.Номер, ДанныеДокумента.ВхДокНомер));
		Параметры.Вставить("Дата",	 ?(НЕ ЗначениеЗаполнено(ДанныеДокумента.ВхДокДата) ,ДанныеДокумента.Дата , ДанныеДокумента.ВхДокДата));
		
		Параметры.Вставить("МестоПриемки",	                 ДанныеДокумента.СкладКомпании);
		Параметры.Вставить("ГрузоотправительПредставление",	 УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ДанныеДокумента.Грузоотправитель,СтруктураПредставления2));
		Параметры.Вставить("ПоставщикПредставление",	     УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ДанныеДокумента.Поставщик,СтруктураПредставления1));
		Параметры.Вставить("ПроизводительПредставление",	 ДанныеДокумента.Производитель);
		Параметры.Вставить("СтраховаяКомпанияПредставление", ДанныеДокумента.СтраховаяКомпания);
		Параметры.Вставить("СпособДоставкиПредставление",    ДанныеДокумента.СпособДоставки);
		
		ДатаОтправления = ДанныеДокумента.ДатаОтправления;
		Если ДатаОтправления<>"" Тогда
			ДатаОтправления = НСтр("ru = 'Дата отправления товара:'") + " " + Формат(ДатаОтправления, "ДЛФ=DD");
		Иначе
			ДатаОтправления = НСтр("ru = 'Дата отправления товара'") + " " + " ""_______""  _____________________ _______ г.";
		КонецЕсли;
		
		Параметры.Вставить("ДатаОтправления", ДатаОтправления);
		
		Параметры.Вставить("НомерДоговора",	СокрЛП(ДанныеДокумента.НомерДоговора));
		Параметры.Вставить("ДатаДоговора",  Формат(ДанныеДокумента.ДатаДоговора, "ДЛФ=DD"));
		
		// Счет-фактура, если есть.
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СчетФактураПолученный.Ссылка
			|ИЗ
			|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
			|ГДЕ
			|	СчетФактураПолученный.Ссылка = &Ссылка";

		Запрос.УстановитьПараметр("Ссылка", Документ.ДокументОснование);

		Выборка = Запрос.Выполнить().Выбрать();

		Если Выборка.Количество()>0 Тогда
				Выборка.Следующий();
				СФ=Выборка.Ссылка;
				Попытка
					НомерСФ = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(СФ);
					ДатаСФ  = Формат(СФ.Дата, "ДЛФ=DD");
				Исключение
					НомерСФ = "";
					ДатаСФ  = """" + "_______"  + """" + "  __________________________  " + "__________ г.";
				КонецПопытки; 
		Иначе
				НомерСФ = "";
				ДатаСФ  = """" + "_______"  + """" + "  __________________________  " + "__________ г.";
		КонецЕсли;		
		Параметры.Вставить("НомерСФ", НомерСФ);
		Параметры.Вставить("ДатаСФ",  ДатаСФ);
		
		ОбластьЗаголовокСтр1.Параметры.Заполнить(Параметры);
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовокСтр1);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();

		// ВТОРАЯ СТРАНИЦА
		НомерСтраницы     = 3;
		НомерСтраницыПред = НомерСтраницы;
		
		ОбластьНомерСтраницы.Параметры.НомерСтраницы = "Страница: " + 2; 
		ТабличныйДокумент.Вывести(ОбластьНомерСтраницы);
		
		КоличествоВсегоПоДокументу = тзТовары.Итог("КоличествоБазовое");
		КоличествоВсегоПоНакладной = ВсегоПоНакладной;
		БруттоВсегоПоДокументу = тзТовары.Итог("Брутто");
		БруттоВсегоПоНакладной = тзТовары.Итог("БруттоПоНакладной"); 
		
		// разница
		РазницаКоличество = КоличествоВсегоПоДокументу - КоличествоВсегоПоНакладной;
		РазницаКоличество = Макс(РазницаКоличество, -РазницаКоличество);
		РазницаБрутто = БруттоВсегоПоДокументу -БруттоВсегоПоНакладной;
		РазницаБрутто = Макс(РазницаБрутто, -РазницаБрутто);
		
		ОбластьЗаголовокСтр2.Параметры.КоличествоМестПоДокументу = Формат(КоличествоВсегоПоДокументу, ФорматВыводаКоличества);
		ОбластьЗаголовокСтр2.Параметры.Брутто                    = Формат(БруттоВсегоПоДокументу, ФорматВыводаКоличества);
		ОбластьЗаголовокСтр2.Параметры.КоличествоМестПоНакладной = Формат(КоличествоВсегоПоНакладной, ФорматВыводаКоличества);
		ОбластьЗаголовокСтр2.Параметры.БруттоПоНакладной         = Формат(БруттоВсегоПоНакладной, ФорматВыводаКоличества);
		ОбластьЗаголовокСтр2.Параметры.РазницаКоличество         = Формат(РазницаКоличество, ФорматВыводаКоличества);
		ОбластьЗаголовокСтр2.Параметры.РазницаБрутто             = Формат(РазницаБрутто, ФорматВыводаКоличества);		
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовокСтр2);

		// ВЫВОДИМ ТАБЛИЧНУЮ ЧАСТЬ
		
		ОбластьШапкаТаблицы1.Параметры.Валюта = ДанныеДокумента.ВалютаДокумента;
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы1);
		// Для последующего вывода
		ОбластьШапкаТаблицы1.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		
		// временная таблица для вычислений
		ТаблицаНоменклатуры = Новый ТаблицаЗначений;
		ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаНоменклатуры.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		ТаблицаНоменклатуры.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
		ТаблицаНоменклатуры.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
		
		
		// перебор строк
		Для каждого СтрокаТЧ Из тзТовары Цикл
			
			// заполняем данные строки
			ЗаполнитьЗначенияСвойств(ОбластьСтрока1.Параметры,УправлениеПечатьюПлатформа.ЗаполнитьПредставлениеДанныхТоварнойСтроки(СтрокаТЧ,Документ));
			
			//Мальцев А.Ю.+++  замена стандартного реквизита на добавленные реквизиты в рамках доработки с префиксом "п"
			//Цена = СтрокаТЧ.Цена;
			//СуммаВсего = СтрокаТЧ.СуммаВсего;
			Если ДокВСтатусеКонтроля Тогда
				Цена 	   = СтрокаТЧ.пЦена;
				СуммаВсего = СтрокаТЧ.пСуммаВсего;
			Иначе
				Цена = СтрокаТЧ.Цена;
				СуммаВсего = СтрокаТЧ.СуммаВсего;				
			КонецЕсли;
			//Мальцев А.Ю.---

			// Рассчитаем цену.
			Если СтрокаТЧ.Количество = 0 Тогда
				ОбластьСтрока1.Параметры.Цена = Цена;
			Иначе
				ОбластьСтрока1.Параметры.Цена = Формат(СуммаВсего / СтрокаТЧ.Количество, ФорматВыводаСуммы);
			КонецЕсли;
			
			ОбластьСтрока1.Параметры.КодЕдиницыПоОКЕИ = "" + СокрЛП(СтрокаТЧ.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код);
			ОбластьСтрока1.Параметры.Артикул          = "" + СтрокаТЧ.Номенклатура.Артикул;
			
			Если ЭтоПоступление Тогда
				// Определяем признак необходимости отражения данных в основных единицах измерения.
				ОтражаемВОсновныхЕдиницах = (СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент = СтрокаТЧ.КоличествоБазовое) Или СтрокаТЧ.Коэффициент = 1;
				
				// заполняем параметры
				КоличествоДляВывода = ?(ОтражаемВОсновныхЕдиницах, СтрокаТЧ.КоличествоПоНакладной, СтрокаТЧ.КоличествоПоНакладной * СтрокаТЧ.Коэффициент);
				КоличествоПоФакту =  ?(ОтражаемВОсновныхЕдиницах, СтрокаТЧ.Количество, СтрокаТЧ.КоличествоБазовое);
				ОбластьСтрока1.Параметры.Количество = КоличествоДляВывода;
				
				//Мальцев А.Ю.+++
				//Если СтрокаТЧ.КоличествоПоНакладной = 0 Или КоличествоПоФакту = 0 Тогда
				Если ДокВСтатусеКонтроля И СтрокаТЧ.КоличествоПоНакладной > 0 Тогда
					
					ЦенаЗаЕдиницу = СуммаВсего / КоличествоДляВывода;					
						
					ОбластьСтрока1.Параметры.Цена = Формат(ЦенаЗаЕдиницу, ФорматВыводаСуммы);
					ОбластьСтрока1.Параметры.СуммаВсего = КоличествоДляВывода * ЦенаЗаЕдиницу;
				
				ИначеЕсли СтрокаТЧ.КоличествоПоНакладной = 0 Или КоличествоПоФакту = 0 Тогда
				//Мальцев А.Ю.---
	
					ОбластьСтрока1.Параметры.Цена = Цена;
					ОбластьСтрока1.Параметры.СуммаВсего = 0;
				Иначе
					Если КоличествоДляВывода = КоличествоПоФакту Тогда
						ОбластьСтрока1.Параметры.СуммаВсего = СуммаВсего;
						ОбластьСтрока1.Параметры.Цена = Формат(СуммаВсего / КоличествоДляВывода, ФорматВыводаСуммы);
					Иначе
						ЦенаЗаЕдиницу = СуммаВсего / КоличествоПоФакту;					
						
						ОбластьСтрока1.Параметры.Цена = Формат(ЦенаЗаЕдиницу, ФорматВыводаСуммы);
						ОбластьСтрока1.Параметры.СуммаВсего = КоличествоДляВывода * ЦенаЗаЕдиницу;
					КонецЕсли;
				КонецЕсли;
				
				НоваяСтрока = ТаблицаНоменклатуры.Добавить();
				НоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура;
				НоваяСтрока.Количество = КоличествоДляВывода;
				НоваяСтрока.Сумма = ОбластьСтрока1.Параметры.СуммаВсего;
				НоваяСтрока.НомерСтроки = тзТовары.Индекс(СтрокаТЧ);
			КонецЕсли;
			
			// выводим строку, делая проверку попадания на лист
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока1, ОбластьШапкаТаблицы1, , НомерСтраницы, , Документ);
			
			// инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаТаблицы1.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли; 		
		КонецЦикла;
		
		// ВЫВОДИМ 3-Ю СТРАНИЦУ
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		ОбластьНомерСтраницы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		ТабличныйДокумент.Вывести(ОбластьНомерСтраницы);	
		ТабличныйДокумент.Вывести(ОбластьЗаголовокСтр3);
		
		НомерСтраницы = НомерСтраницы + 1;
		
		// ВЫВОДИМ ПРОДОЛЖЕНИЕ ТАБЛИЧНОЙ ЧАСТИ
		ОбластьШапкаТаблицы2.Параметры.Валюта = ДанныеДокумента.ВалютаДокумента;
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы2);
		// Для последующего вывода
		ОбластьШапкаТаблицы2.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		
		// строка поиска в таблице номенклатура
		СтрокаПоиска = Новый Структура("НомерСтроки");
		
		// перебор строк
		Для каждого СтрокаТЧ Из тзТовары Цикл
			// заполняем данные строки
			СтруктураСтроки = УправлениеПечатьюПлатформа.ЗаполнитьПредставлениеДанныхТоварнойСтроки(СтрокаТЧ,Документ);
			ОбластьСтрока2.Параметры.Заполнить(СтруктураСтроки);		
			ОбластьСтрока2.Параметры.Артикул = "" + СтруктураСтроки.Номенклатура.Артикул;
			
			Если ЭтоПоступление Тогда
				// Определяем признак необходимости отражения данных в основных единицах измерения.
				ОтражаемВОсновныхЕдиницах = (СтрокаТЧ.Количество * СтрокаТЧ.Коэффициент = СтрокаТЧ.КоличествоБазовое) Или СтрокаТЧ.Коэффициент = 1;

				КоличествоПоФакту =  ?(ОтражаемВОсновныхЕдиницах, СтрокаТЧ.Количество, СтрокаТЧ.КоличествоБазовое);
				ОбластьСтрока2.Параметры.КоличествоФакт = КоличествоПоФакту;
				
				Если КоличествоПоФакту <> 0 Тогда
					ОбластьСтрока2.Параметры.СуммаФакт = СтрокаТЧ.СуммаВсего;
					//Мальцев А.Ю. +++
					//ОбластьСтрока2.Параметры.ЦенаФакт = СтрокаТЧ.СуммаВсего / КоличествоПоФакту; 
					ОбластьСтрока2.Параметры.ЦенаФакт = Окр(СтрокаТЧ.СуммаВсего / КоличествоПоФакту,2);
					//Мальцев А.Ю. ---
				КонецЕсли;
				
				// определяем разницу
				СтрокаПоиска.НомерСтроки = тзТовары.Индекс(СтрокаТЧ); 
				
				ПереченьСтрок = ТаблицаНоменклатуры.НайтиСтроки(СтрокаПоиска);
				
				Если ПереченьСтрок.Количество() > 0 Тогда
					Если ПереченьСтрок[0].Количество <> КоличествоПоФакту Тогда
						ЭтоНедостача = ПереченьСтрок[0].Количество > КоличествоПоФакту;
						
						КоличествоРазница = ПереченьСтрок[0].Количество - КоличествоПоФакту;
						КоличествоРазница = Макс(КоличествоРазница, - КоличествоРазница);
						
						СуммаРазница = ПереченьСтрок[0].Сумма - СтрокаТЧ.СуммаВсего;
						СуммаРазница = Макс(СуммаРазница, - СуммаРазница);
						
						Если ЭтоНедостача Тогда
							ОбластьСтрока2.Параметры.КоличествоНедостача = КоличествоРазница;
							ОбластьСтрока2.Параметры.СуммаНедостача = СуммаРазница;
						Иначе
							ОбластьСтрока2.Параметры.КоличествоЛишнее = КоличествоРазница;
							ОбластьСтрока2.Параметры.СуммаЛишнее = СуммаРазница;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// выводим строку, делая проверку попадания на лист
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока2, ОбластьШапкаТаблицы2, , НомерСтраницы, , Документ);
			
			ОбластьСтрока2.Параметры.КоличествоНедостача = 0;
			ОбластьСтрока2.Параметры.СуммаНедостача = 0;
			ОбластьСтрока2.Параметры.КоличествоЛишнее = 0;
			ОбластьСтрока2.Параметры.СуммаЛишнее = 0;
			
			// инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаТаблицы2.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли; 		
		КонецЦикла;
		
		// ВЫВОДИМ 4-Ю СТРАНИЦУ
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ОбластьНомерСтраницы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		ТабличныйДокумент.Вывести(ОбластьНомерСтраницы);
		
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.ГлавныйБухгалтер);
		
		// Комиссия
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.ПредседательКомиссии);
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.ЧленКомиссии1);
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.ЧленКомиссии2);
		
		ТабличныйДокумент.Вывести(ОбластьПодвал); 
		
		// отметим конец области документа
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьТОРГ4Общая(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТОРГ4Общая";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
		
	ПервыйДокумент = Истина; 
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ФорматВыводаСуммы      = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		ФорматВыводаКоличества = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Документ);
		
		// Зададим параметры макета
		ТабличныйДокумент.ПолеСлева  = 15;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		// Получим данные из документа
		ДанныеДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ).ПолучитьДанныеДляПечатиТОРГ4(Документ);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТОРГ.ПФ_MXL_ТОРГ4");
		
		ОбластьЗаголовок         = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапкаТаблицы	 	 = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьСтрока			 = Макет.ПолучитьОбласть("Строка");
		ОбластьИтоги			 = Макет.ПолучитьОбласть("ИтогиПоСтранице");
		ОбластьВсего			 = Макет.ПолучитьОбласть("Всего");
		ОбластьПодвал            = Макет.ПолучитьОбласть("Подвал");
		
		СтруктураПредставления1=Новый Структура;
		СтруктураПредставления1.Вставить("Наименование",     "");
		СтруктураПредставления1.Вставить("ИНН",              "ИНН ");
		СтруктураПредставления1.Вставить("АдресЮридический", "");
		СтруктураПредставления1.Вставить("ТелефонРабочий",   "тел.: ");
		СтруктураПредставления1.Вставить("БанковскийСчет",   "р/с ");
		СтруктураПредставления1.Вставить("Банк",             НСтр("ru = 'в банке'") + " ");
		СтруктураПредставления1.Вставить("БИК",              "БИК ");
		СтруктураПредставления1.Вставить("КоррСчет",         "к/с ");
		
		СтруктураПредставления2=Новый Структура;
		СтруктураПредставления2.Вставить("Наименование",     "");
		СтруктураПредставления2.Вставить("ИНН",              "ИНН ");
		СтруктураПредставления2.Вставить("АдресФактический", "");
		СтруктураПредставления2.Вставить("ТелефонРабочий",   "тел.: ");
		СтруктураПредставления2.Вставить("БанковскийСчет",   "р/с ");
		СтруктураПредставления2.Вставить("Банк",             НСтр("ru = 'в банке'") + " ");
		СтруктураПредставления2.Вставить("БИК",              "БИК ");
		СтруктураПредставления2.Вставить("КоррСчет",         "к/с ");
		
		// Дата документа
		ДатаДокумента = Документ.Дата;
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		ОбластьЗаголовок.Параметры.Заполнить(ДанныеДокумента);
		ОбластьЗаголовок.Параметры.ОрганизацияПредставление			
			= УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Организация,СтруктураПредставления1,,,ДатаДокумента,ДополнительныеПараметры);
		ОбластьЗаголовок.Параметры.ОрганизацияПоОКПО 				= ДанныеДокумента.Организация.КодПоОКПО;
		ОбластьЗаголовок.Параметры.ПодразделениеКомпании			= 
			УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(ДанныеДокумента.ПодразделениеКомпании);
		ОбластьЗаголовок.Параметры.Поставщик						= ДанныеДокумента.Поставщик;
		ОбластьЗаголовок.Параметры.ПоставщикПоОКПО 					= ДанныеДокумента.Поставщик.КодПоОКПО;
		ОбластьЗаголовок.Параметры.ПоставщикПредставление			= 
			УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Поставщик,СтруктураПредставления1);
		ОбластьЗаголовок.Параметры.Грузоотправитель					= ДанныеДокумента.Грузоотправитель;
		ОбластьЗаголовок.Параметры.ГрузополучательПоОКПО			= ДанныеДокумента.Грузоотправитель.КодПоОКПО;
		ОбластьЗаголовок.Параметры.ГрузоотправительПредставление	= 
			УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Грузоотправитель,СтруктураПредставления2);
		
		ОбластьЗаголовок.Параметры.Номер							= ?(НЕ ЗначениеЗаполнено(ДанныеДокумента.ВхДокНомер),ДанныеДокумента.Номер,
																				ДанныеДокумента.ВхДокНомер);
		ОбластьЗаголовок.Параметры.Дата								= ?(НЕ ЗначениеЗаполнено(ДанныеДокумента.ВхДокНомер),ДанныеДокумента.Дата, 
																				ДанныеДокумента.ВхДокДата);
		ОбластьЗаголовок.Параметры.МестоПриемки						= ДанныеДокумента.СкладКомпании;
		
		// Заполним информацию о руководителе организации.
		ОбластьЗаголовок.Параметры.Заполнить(ДанныеДокумента.Руководитель);
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		// Переменные управляющие постраничным выводом.
		СтрокНаСтранице = 23;
		СтрокШапки      = 20;
		СтрокПодвала    = 7;
		НомерСтраницы   = 1;
		
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		ОбластьШапкаТаблицы.Параметры.Валюта = ДанныеДокумента.ВалютаДокумента;
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		ВыборкаСтрок = ДанныеДокумента.ВыборкаТабличнойЧасти;
		
		КоличествоСтрок = ВыборкаСтрок.Количество();
		Если КоличествоСтрок = 1 Тогда
			ПереноситьПоследнююСтроку = 0;
		Иначе
			ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
			ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
			ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		КонецЕсли;
		
		// Определим имя показываемой колонки кода.
		ИмяКолонкиКода = УправлениеПечатьюПлатформа.ПолучитьПараметрыРежимаВыводаКодаВДокументах().Имя;
		
		// Инициализация итогов по странице
		ИтогоМассаБруттоПоСтранице = 0;
		ИтогоКоличествоПоСтранице  = 0;
		ИтогоСуммаПоСтранице       = 0;
		
		// Инициализация итогов по документу
		ИтогоМассаБрутто = 0;
		ИтогоКоличество  = 0;
		ИтогоСумма       = 0;
		Ном              = 0;
		
		// Выводим многострочную часть документа.
		Для каждого СтрокаТоваров Из ВыборкаСтрок Цикл
			Ном = Ном + 1;
			ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
			
			Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				ИЛИ ((ПереноситьПоследнююСтроку = 1) И (Ном = КоличествоСтрок)) Тогда
				ОбластьИтоги.Параметры.ИтогоМассаБруттоПоСтранице = ИтогоМассаБруттоПоСтранице;
				ОбластьИтоги.Параметры.ИтогоШтукПоСтранице        = Формат(ИтогоКоличествоПоСтранице,ФорматВыводаКоличества);
				ОбластьИтоги.Параметры.ИтогоСтоимостьПоСтранице   = Формат(ИтогоСуммаПоСтранице,ФорматВыводаСуммы);
				ТабличныйДокумент.Вывести(ОбластьИтоги);
				
				// Очистим итоги по странице.
				ИтогоБруттоПоСтранице     = 0;
				ИтогоКоличествоПоСтранице = 0;
				ИтогоСуммаПоСтранице      = 0;
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(СтрокаТоваров);
			Характеристика											= Строка(СтрокаТоваров.ХарактеристикаНоменклатуры);
			ОбластьСтрока.Параметры.ТоварНаименование				= УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(СтрокаТоваров.Номенклатура) + ?(НЕ ЗначениеЗаполнено(Характеристика), "",", " + Характеристика)+ ?(ЕстьРеквизит(СтрокаТоваров.Номенклатура, "Артикул"),?(ЗначениеЗаполнено(СтрокаТоваров.Номенклатура.Артикул), ", "+СтрокаТоваров.Номенклатура.Артикул, ""), "");
			ОбластьСтрока.Параметры.ТоварКод						= УправлениеПечатьюПлатформа.ПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура);
			ОбластьСтрока.Параметры.ЕдиницаИзмеренияНаименование	= СтрокаТоваров.ЕдиницаИзмерения;
			ОбластьСтрока.Параметры.ЕдиницаИзмеренияКодПоОКЕИ		= СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
			
			МассаБруттоСтр											= СтрокаТоваров.ЕдиницаИзмерения.Вес * СтрокаТоваров.Количество;
			ОбластьСтрока.Параметры.МассаБрутто						= МассаБруттоСтр;
			ОбластьСтрока.Параметры.КоличествоМест					= Формат(СтрокаТоваров.Количество,ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.КоличествоВОдномМесте			= Формат(СтрокаТоваров.Коэффициент,ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.КоличествоШтук					= Формат(СтрокаТоваров.КоличествоБазовое,ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.Цена							= Формат(СтрокаТоваров.Цена,ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.Стоимость						= Формат(СтрокаТоваров.Сумма,ФорматВыводаСуммы);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			// Увеличим итоги по странице
			ИтогоМассаБруттоПоСтранице = ИтогоМассаБруттоПоСтранице + МассаБруттоСтр;
			ИтогоКоличествоПоСтранице  = ИтогоКоличествоПоСтранице  + СтрокаТоваров.КоличествоБазовое;
			ИтогоСуммаПоСтранице       = ИтогоСуммаПоСтранице       + СтрокаТоваров.Сумма;
			
			// Увеличим итоги по документу
			ИтогоМассаБрутто = ИтогоМассаБрутто + МассаБруттоСтр;
			ИтогоКоличество  = ИтогоКоличество  + СтрокаТоваров.КоличествоБазовое;
			ИтогоСумма       = ИтогоСумма       + СтрокаТоваров.Сумма;
		КонецЦикла;
		
		// Выводим итоги по последней странице.
		ОбластьИтоги.Параметры.ИтогоМассаБруттоПоСтранице = ИтогоМассаБруттоПоСтранице;
		ОбластьИтоги.Параметры.ИтогоШтукПоСтранице        = Формат(ИтогоКоличествоПоСтранице,ФорматВыводаКоличества);
		ОбластьИтоги.Параметры.ИтогоСтоимостьПоСтранице   = Формат(ИтогоСуммаПоСтранице,ФорматВыводаСуммы);
		ТабличныйДокумент.Вывести(ОбластьИтоги);
		
		// Выводим итоги по документу в целом.
		ОбластьВсего.Параметры.ИтогоМассаБрутто = ИтогоМассаБрутто;
		ОбластьВсего.Параметры.ИтогоШтук        = Формат(ИтогоКоличество,ФорматВыводаКоличества);
		ОбластьВсего.Параметры.ИтогоСтоимость   = Формат(ИтогоСумма,ФорматВыводаСуммы);
		ТабличныйДокумент.Вывести(ОбластьВсего);
		
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента);
		// Комиссия.
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.ПредседательКомиссии);
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.ЧленКомиссии1);
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.ЧленКомиссии2);
		// Кладовщик.
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.МОЛ);
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// Отметим конец области документа.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьТОРГ16Общая(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТОРГ16Общая";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	
	ПервыйДокумент = Истина; 
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ФорматВыводаСуммы      = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		ФорматВыводаКоличества = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Документ);
		ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		
		// Зададим параметры макета
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		// Получим данные из документа
		ДанныеДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ).ПолучитьДанныеДляПечатиТОРГ16(Документ);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТОРГ.ПФ_MXL_ТОРГ16");
		
		ОбластьЗаголовок        	= Макет.ПолучитьОбласть("Шапка");
		ОбластьШапкаТаблицы			= Макет.ПолучитьОбласть("ЗаголовокТаблицыПервогоЛиста");
		ОбластьСтрока				= Макет.ПолучитьОбласть("СтрокаПервогоЛиста");
		ОбластьИтого				= Макет.ПолучитьОбласть("Итого");
		ОбластьПодвал           	= Макет.ПолучитьОбласть("Подвал");
		
		ОбластьЗаголовок.Параметры.Заполнить(ДанныеДокумента);
		
		СтруктураПредставления = Новый Структура;
		СтруктураПредставления.Вставить("Наименование",     "");
		СтруктураПредставления.Вставить("ИНН",              "ИНН ");
		СтруктураПредставления.Вставить("АдресЮридический", "");
		СтруктураПредставления.Вставить("ТелефонРабочий",   "тел.: ");
		СтруктураПредставления.Вставить("БанковскийСчет",   "р/с ");
		СтруктураПредставления.Вставить("Банк",             НСтр("ru = 'в банке'") + " ");
		СтруктураПредставления.Вставить("БИК",              "БИК ");
		СтруктураПредставления.Вставить("КоррСчет",         "к/с ");
		
		// Дата документа
		ДатаДокумента = Документ.Дата;
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		// Выводим общие реквизиты шапки.
		ОбластьЗаголовок.Параметры.Заполнить(ДанныеДокумента);
		ОбластьЗаголовок.Параметры.ОрганизацияПредставление  
			= УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ДанныеДокумента.Организация, СтруктураПредставления,,,ДатаДокумента,ДополнительныеПараметры);
		ОбластьЗаголовок.Параметры.ПодразделениеКомпании  
			= УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(ДанныеДокумента.ПодразделениеКомпании);
		ОбластьЗаголовок.Параметры.ОрганизацияПоОКПО		 = ДанныеДокумента.Организация.КодПоОКПО;
		ОбластьЗаголовок.Параметры.Заполнить(ДанныеДокумента.Руководитель);
		ОбластьЗаголовок.Параметры.Номер = ДанныеДокумента.Номер;
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ОбластьИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтраницеПервогоЛиста");      
		НомерСтраницы = 2;
		НомерСтраницыПред = НомерСтраницы;
		
		// Теперь выводим шапку
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		
		// Таблица партий - преобразование
		тблПартий = ДанныеДокумента.ВыборкаСтрокТовары.Скопировать();
		Если ДанныеДокумента.ЕстьДвиженияПоРегистру И НЕ ДанныеДокумента.ПростоеСписание Тогда
			Если тблПартий.Колонки.Найти("Партия") <> Неопределено Тогда
				тблПартий.Колонки.Партия.Имя = "ПартияСтарый";
			КонецЕсли;
			тблПартий.Колонки.ДокументПередачи.Имя = "Партия";
		КонецЕсли;
		тблПартий.Колонки.Добавить("ДатаПоступленияТовара", Новый ОписаниеТипов("Дата"));
		тблПартий.Колонки.Добавить("ТоварнаяНакладнаяНомер", Новый ОписаниеТипов("Строка"));
		тблПартий.Колонки.Добавить("ТоварнаяНакладнаяДата", Новый ОписаниеТипов("Дата"));
		тблПартий.Колонки.Добавить("ДатаСписанияТовара", Новый ОписаниеТипов("Дата"));
		Для Каждого ТекПартия Из тблПартий Цикл
			ТекПартия.ДатаСписанияТовара = ДанныеДокумента.Дата;
			Если ТекПартия.Партия <> Неопределено Тогда
				ТекПартия.ДатаПоступленияТовара = ТекПартия.Партия.Дата;
				ТекПартия.ТоварнаяНакладнаяНомер = ТекПартия.Партия.Номер;
				ТекПартия.ТоварнаяНакладнаяДата = ТекПартия.Партия.Дата; //OkoE - а так ли это? //тут вопрос о разнице ДатаПоступленияТовара и ТоварнаяНакладнаяДата KOZT
			КонецЕсли;
		КонецЦикла;
		тблПартий.Сортировать("ДатаПоступленияТовара, ДатаСписанияТовара, ТоварнаяНакладнаяДата");
		
		Для каждого СтрокаПартия Из тблПартий Цикл
			ОбластьСтрока.Параметры.Заполнить(СтрокаПартия);
			
			// Выводим строку, делая проверку попадания на лист.
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьШапкаТаблицы,
														ОбластьИтогоПоСтранице, НомерСтраницы, , Документ,);
			
			// Инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьИтогоПоСтранице);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();

		ОбластьШапкаТаблицы 	= Макет.ПолучитьОбласть("ЗаголовокТаблицыВторогоЛиста");
		ОбластьСтрока 			= Макет.ПолучитьОбласть("СтрокаВторогоЛиста");
		ОбластьИтогоПоСтранице	= Макет.ПолучитьОбласть("ИтогоПоСтранице");
		
		НомерСтраницы = 2;
		НомерСтраницыПред = НомерСтраницы;
		
		// Теперь выводим шапку
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		
		СтруктураИтоговПоСтранице = Новый Структура("Сумма", 0);
		
		// Определим, что показывать в колонке кода - код или артикул.
		ИмяКолонкиКода = УправлениеПечатьюПлатформа.ПолучитьПараметрыРежимаВыводаКодаВДокументах().Имя;
		СуммаПечатногоДокумента = 0;

		// Выводим многострочную часть документа.
		Для Каждого СтрокаТовар Из ДанныеДокумента.ВыборкаСтрокТовары Цикл
			Если ДанныеДокумента.ЕстьДвиженияПоРегистру Тогда
				Если ДанныеДокумента.ПростоеСписание Тогда
					//skud 19-10-18 всегда будем работать с себестоимостью
					//Если Документ.СкладКомпании.Розничный Тогда
					//	СтрокаТовар.Сумма = СтрокаТовар.СуммаРозничная;
					//	СтрокаТовар.Цена = СтрокаТовар.СуммаРозничная / СтрокаТовар.Количество;
					//Иначе
						СтрокаТовар.Цена = СтрокаТовар.Сумма / СтрокаТовар.Количество;
					//КонецЕсли; 
				Иначе
					СтрокаТовар.Цена = СтрокаТовар.Сумма / СтрокаТовар.Количество;
				КонецЕсли; 
			Иначе
				СтрокаТовар.НоменклатураПредставление = Строка(СтрокаТовар.Номенклатура);
				СтрокаТовар.ХарактеристикаНоменклатурыПредставление = Строка(СтрокаТовар.ХарактеристикаНоменклатуры);
				СтрокаТовар.Цена = СтрокаТовар.ЦенаРозничная;
				СтрокаТовар.Сумма = СтрокаТовар.ЦенаРозничная * СтрокаТовар.Количество;
				Если ДанныеДокумента.ВалютаДокумента <> ВалютаРегл Тогда
					СтрокаТовар.Сумма = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СтрокаТовар.Сумма, 
											ДанныеДокумента.ВалютаДокумента, ДанныеДокумента.Дата, ВалютаРегл, ДанныеДокумента.Дата);
					СтрокаТовар.Цена = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СтрокаТовар.Цена, ДанныеДокумента.ВалютаДокумента,
											ДанныеДокумента.Дата, ВалютаРегл, ДанныеДокумента.Дата);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		Для каждого СтрокаТовар Из ДанныеДокумента.ВыборкаСтрокТовары Цикл
			ОбластьСтрока.Параметры.Заполнить(СтрокаТовар);
			ОбластьСтрока.Параметры.ТоварНаименование = СтрокаТовар.НоменклатураПредставление
				+ ?(СтрокаТовар.ХарактеристикаНоменклатурыПредставление = "", "", 
															", " + СтрокаТовар.ХарактеристикаНоменклатурыПредставление);
			// Вывод кода товаров
			ОбластьСтрока.Параметры.ТоварКод = УправлениеПечатьюПлатформа.ПолучитьЗначениеКолонкиКода(СтрокаТовар.Номенклатура);
			ОбластьСтрока.Параметры.КоличествоМест = Формат(СтрокаТовар.Количество,ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.Цена = Формат(СтрокаТовар.Цена,ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.Сумма = Формат(СтрокаТовар.Сумма,ФорматВыводаСуммы);
			
			Если ДанныеДокумента.ЕстьДвиженияПоРегистру Тогда
				Если ЕстьРеквизит(СтрокаТовар.Номенклатура,"БазоваяЕдиницаИзмерения") Тогда
					ОбластьСтрока.Параметры.ЕдиницаИзмерения = СтрокаТовар.Номенклатура.БазоваяЕдиницаИзмерения;	
					ОбластьСтрока.Параметры.ЕдиницаИзмеренияКодПоОКЕИ = СтрокаТовар.Номенклатура.БазоваяЕдиницаИзмерения.Код;
				Иначе
					ОбластьСтрока.Параметры.ЕдиницаИзмерения = СтрокаТовар.ЕдиницаИзмерения;	
					ОбластьСтрока.Параметры.ЕдиницаИзмеренияКодПоОКЕИ = СтрокаТовар.ЕдиницаИзмеренияКодПоОКЕИ;
				КонецЕсли; 
			Иначе
				ОбластьСтрока.Параметры.ЕдиницаИзмерения = СтрокаТовар.ЕдиницаИзмерения;
				ОбластьСтрока.Параметры.ЕдиницаИзмеренияКодПоОКЕИ = СтрокаТовар.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
			КонецЕсли;
			
			// Доп. области
			мсвДопОбластиПодвала = Неопределено;
			Если ДанныеДокумента.ВыборкаСтрокТовары.Индекс(СтрокаТовар) = ДанныеДокумента.ВыборкаСтрокТовары.Количество()-1 Тогда
				мсвДопОбластиПодвала = Новый Массив;
				мсвДопОбластиПодвала.Добавить(ОбластьИтого);
				мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
			КонецЕсли;
			
			// Выводим строку, делая проверку попадания на лист.
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьШапкаТаблицы,
														ОбластьИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице, Документ, мсвДопОбластиПодвала);
			
			// Инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("Сумма", 0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница:" + " " + НомерСтраницы; 
			КонецЕсли;
			
			// Добавляем итоги
			УправлениеПечатьюПлатформа.ДобавитьИтогиПоСтранице(СтрокаТовар,СтруктураИтоговПоСтранице);
		КонецЦикла;
		
		// Выводим последний подвал, если страниц больше единицы.
		Если НомерСтраницы > 2 Тогда
			УправлениеПечатьюПлатформа.ВывестиИтогиПоСтранице(ТабличныйДокумент,ОбластьИтого,СтруктураИтоговПоСтранице,Документ);
		КонецЕсли;
		
		// Выводим итоги по документу в общем
		СуммаИтого = ДанныеДокумента.ВыборкаСтрокТовары.Итог("Сумма");
		ОбластьИтого.Параметры.Сумма = Формат(СуммаИтого, ФорматВыводаСуммы);
		ТабличныйДокумент.Вывести(ОбластьИтого);

		// Выводим подвал документа
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента);
		// Форма регламентированная, все суммы в руб., итого - тоже в руб.
		ОбластьПодвал.Параметры.СуммаСписанияПрописью = 
				РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаИтого, Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить());
				
		//Мальцев А.Ю. +++
				
		// Комиссия
		//ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.ПредседательКомиссии);
		//ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.ЧленКомиссии1);
		//ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.ЧленКомиссии2);
		//ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.МОЛ);
		
		ОбластьПодвал.Параметры.ПредседательКомиссииДолжность 	  = ДанныеДокумента.ПредседательКомиссии.Должность;
		ОбластьПодвал.Параметры.ПредседательКомиссииПредставление = ДанныеДокумента.ПредседательКомиссии;
		ОбластьПодвал.Параметры.МОЛДолжность 					  = ДанныеДокумента.МОЛ.МОЛДолжность;
		ОбластьПодвал.Параметры.МОЛПредставление 				  = ДанныеДокумента.МОЛ.МОЛ;
		
		счЧК = 1;
		Для Каждого ЧленКомиссии Из ДанныеДокумента.МассивЧленовКомиссии Цикл 			
			Если счЧК > 3 Тогда
				Продолжить;
			КонецЕсли;			
			ОбластьПодвал.Параметры["ЧленКомиссии" + Строка(счЧК) + "Должность"] 		  = ЧленКомиссии.Должность;
			ОбластьПодвал.Параметры["ЧленКомиссии" + Строка(счЧК) + "Представление"] 	  = ЧленКомиссии;			
			счЧК = счЧК + 1;			
		КонецЦикла;			
		//Мальцев А.Ю. ---		
		
		УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьПодвал, , , НомерСтраницы,,Документ);
		
		// Отметим конец области документа
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьТОРГ13Общая(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТОРГ13Общая";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;

	ПервыйДокумент = Истина; 
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ФорматВыводаСуммы      = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		ФорматВыводаКоличества = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Документ);
				
		// Получим данные из документа
		ДанныеДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ).ПолучитьДанныеДляПечатиТОРГ13(Документ);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТОРГ.ПФ_MXL_ТОРГ13");
		
		ОбластьЗаголовок        = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапкаТаблицы		= Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
		ОбластьИтоговПоСтранице	= Макет.ПолучитьОбласть("ИтогиПоСтранице");
		ОбластьВсего			= Макет.ПолучитьОбласть("Всего");
		ОбластьПодвал           = Макет.ПолучитьОбласть("Подвал");
		
		СтруктураПредставления = Новый Структура;
		СтруктураПредставления.Вставить("Наименование",     "");
		СтруктураПредставления.Вставить("ИНН",              "ИНН ");
		СтруктураПредставления.Вставить("АдресЮридический", "");
		СтруктураПредставления.Вставить("ТелефонРабочий",   "тел.: ");
		СтруктураПредставления.Вставить("БанковскийСчет",   "р/с ");
		СтруктураПредставления.Вставить("Банк",             НСтр("ru = 'в банке'") + " ");
		СтруктураПредставления.Вставить("БИК",              "БИК ");
		СтруктураПредставления.Вставить("КоррСчет",         "к/с ");
		
		// Дата документа
		ДатаДокумента = Документ.Дата;
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		ОбластьЗаголовок.Параметры.Заполнить(ДанныеДокумента);
		ОбластьЗаголовок.Параметры.ОрганизацияПредставление	= 
				УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ДанныеДокумента.Организация,СтруктураПредставления,,,ДатаДокумента,ДополнительныеПараметры);
		ОбластьЗаголовок.Параметры.ОрганизацияПоОКПО		= ДанныеДокумента.Организация.КодПоОКПО;
		ОбластьЗаголовок.Параметры.ОтправительПодразделение	= 
				УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(ДанныеДокумента.Грузоотправитель);
		ОбластьЗаголовок.Параметры.ПолучательПодразделение	= 
				УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(ДанныеДокумента.Грузополучатель);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ВалютаРегл   = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		КурсРегл     = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалюты(ВалютаРегл, ДанныеДокумента.Дата);
		ВалютаУпр    = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		ВалютаОтчета = ?(ДанныеДокумента.Розничный, ВалютаРегл, ДанныеДокумента.ВалютаДокумента);
		КурсОтчета   = ?(ДанныеДокумента.Розничный, КурсРегл, ДанныеДокумента.КурсДокумента);
		
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента.КурсВалютыУпр) Тогда
			КурсУпр = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалюты(ВалютаУпр,ДанныеДокумента.Дата);
		Иначе
			КурсУпр = ДанныеДокумента.КурсВалютыУпр; 
		КонецЕсли; 
		
		СтрокНаСтранице = 25;
		СтрокШапки      = 12;
		СтрокПодвала    = 5;
		НомерСтраницы   = 1;
		
		// Выводим заголовок таблицы
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		ОбластьШапкаТаблицы.Параметры.Валюта = ВалютаОтчета;
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		КоличествоСтрок = ДанныеДокумента.КоличествоСтрок;
	    Если КоличествоСтрок = 1 Тогда
			ПереноситьПоследнююСтроку	= 0;
		Иначе
			ЦелыхСтраницСПодвалом		= Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
			ЦелыхСтраницБезПодвала		= Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
			ПереноситьПоследнююСтроку	= ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		КонецЕсли;
		
		// Определим, что показывать в колонке кода - код или артикул.
		ИмяКолонкиКода = УправлениеПечатьюПлатформа.ПолучитьПараметрыРежимаВыводаКодаВДокументах().Имя;
		
		// Инициализация итогов по странице.
		ИтогКоличествоМестПоСтранице = 0;
		ИтогМассаБруттоПоСтранице    = 0;
		ИтогМассыНеттоПоСтранице     = 0;
		ИтогСуммыПоСтранице          = 0;
		
		// Инициализация итогов по документу.
		ИтогоКоличество  = 0;
		ИтогоМассаБрутто = 0;
		ИтогоМассаНетто  = 0;
		ИтогоСумма       = 0;
		Ном = 0;
		Для Каждого ТекСтрока Из ДанныеДокумента.ТаблицаСуммСписания Цикл
			Ном = Ном + 1;
			ЦелаяСтраница	= (СтрокШапки + Ном - 1) / СтрокНаСтранице;
			
			Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
				ИЛИ ((ПереноситьПоследнююСтроку = 1) И (Ном = КоличествоСтрок)) Тогда
				ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = Формат(ИтогКоличествоМестПоСтранице,ФорматВыводаКоличества);
				ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
				ОбластьИтоговПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
				ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = Формат(ИтогСуммыПоСтранице,ФорматВыводаСуммы);
				ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
				
				// Инициализация итогов по странице.
				ИтогКоличествоМестПоСтранице = 0;
				ИтогМассаБруттоПоСтранице    = 0;
				ИтогМассаНеттоПоСтранице     = 0;
				ИтогСуммыПоСтранице          = 0;
				
				НомерСтраницы = НомерСтраницы + 1;
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница" + " " + НомерСтраницы;
				ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
			КонецЕсли;
			
			Если ДанныеДокумента.ТребуетсяПересчет Тогда 
				Если ДанныеДокумента.Розничный Тогда
					Сумма = ТекСтрока.СуммаРозн;
				Иначе
					Если ВалютаОтчета=ВалютаУпр Тогда
						Сумма = ТекСтрока.СуммаУпр-?(ТекСтрока.СуммаНДС<>0, РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ТекСтрока.СуммаНДС, ВалютаРегл, КурсРегл, ВалютаОтчета, КурсОтчета), 0);
					ИначеЕсли ВалютаОтчета=ВалютаРегл Тогда
						Сумма = ТекСтрока.Сумма-ТекСтрока.СуммаНДС;
					Иначе
						Сумма = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ТекСтрока.Сумма, ВалютаРегл, КурсРегл, ВалютаОтчета, КурсОтчета)-?(ТекСтрока.СуммаНДС<>0, РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ТекСтрока.СуммаНДС, ВалютаРегл, КурсРегл, ВалютаОтчета, КурсОтчета),0);
					КонецЕсли; 
				КонецЕсли;
			Иначе
				Сумма = ТекСтрока.Сумма-ТекСтрока.СуммаНДС;
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(ТекСтрока);
			Характеристика										= Строка(ТекСтрока.ХарактеристикаНоменклатуры);
			ОбластьСтрока.Параметры.ТоварНаименование			= УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(ТекСтрока.Номенклатура) + ?(Характеристика = "", "",", " + Характеристика);
			ОбластьСтрока.Параметры.ТоварКод					= УправлениеПечатьюПлатформа.ПолучитьЗначениеКолонкиКода(ТекСтрока.Номенклатура);
			ОбластьСтрока.Параметры.ЕдиницаИзмерения			= ТекСтрока.ЕдиницаИзмерения;
			ОбластьСтрока.Параметры.ЕдиницаИзмеренияКодПоОКЕИ	= ТекСтрока.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
			
			ОбластьСтрока.Параметры.КоличествоВОдномМесте		= Формат(ТекСтрока.ЕдиницаИзмерения.Коэффициент,ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.КоличествоМест				= Формат(ТекСтрока.Количество,ФорматВыводаКоличества);
			МассаБрутто 										= ТекСтрока.Количество * ТекСтрока.ЕдиницаИзмерения.Вес;
			ОбластьСтрока.Параметры.МассаБрутто					= МассаБрутто;
			ОбластьСтрока.Параметры.Цена						= Формат(Сумма/ТекСтрока.Количество,ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.Сумма						= Формат(Сумма,ФорматВыводаСуммы);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			// Обновим итоги по странице
			ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + ТекСтрока.Количество;
			ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице    + МассаБрутто;
			ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице     + 0;
			ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице          + Сумма;
			
			// Обновим итоги по документу
			ИтогоКоличество  = ИтогоКоличество  + ТекСтрока.Количество;
			ИтогоМассаБрутто = ИтогоМассаБрутто + МассаБрутто;
			ИтогоМассаНетто  = ИтогоМассаНетто  + 0;
			ИтогоСумма       = ИтогоСумма       + Сумма;
		КонецЦикла;
		
		ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = Формат(ИтогКоличествоМестПоСтранице,ФорматВыводаКоличества);
		ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = Формат(ИтогСуммыПоСтранице,ФорматВыводаСуммы);
		ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);

		// Выводим итоги по документу в целом
		ОбластьВсего.Параметры.ИтогоКоличествоМест = Формат(ИтогоКоличество,ФорматВыводаКоличества);
		ОбластьВсего.Параметры.ИтогоМассаБрутто    = ИтогоМассаБрутто;
		ОбластьВсего.Параметры.ИтогоМассаНетто     = ИтогоМассаНетто;
		ОбластьВсего.Параметры.ИтогоСумма          = Формат(ИтогоСумма,ФорматВыводаСуммы);
		ТабличныйДокумент.Вывести(ОбластьВсего);
		
		// Выводим подвал документа
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента);
		
		// Текст без копеек (не Сто 00   , а   просто Сто).
		ПараметрыПрописиНаРусскомОбщ = ВалютаОтчета.ПараметрыПрописиНаРусском;
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусскомОбщ, "1", "0");
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "2", "0");
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "3", "0");
		ФорматнаяСтрока = "L=ru_RU; НП=Ложь; НД=Ложь";
		ОбластьПодвал.Параметры.ИтогоСуммаПрописью = ЧислоПрописью(Цел(ИтогоСумма), ФорматнаяСтрока, ПараметрыПрописиНаРусском);
		ОбластьПодвал.Параметры.Валюта = ВалютаОтчета;
		ФорматнаяСтрока = "L=ru_RU; НП=Ложь; НД=Истина";
		ОбщаяСумма = ЧислоПрописью(ИтогоСумма, ФорматнаяСтрока, ПараметрыПрописиНаРусскомОбщ);
		ОбластьПодвал.Параметры.ИтогоСуммаКоп      = СокрЛП(СтрЗаменить(ОбщаяСумма,ОбластьПодвал.Параметры.ИтогоСуммаПрописью,""));
		
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.Отпустил);
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.Получил);

		УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьПодвал, , , НомерСтраницы,,Документ);
		
		// Зададим параметры макета.
		ТабличныйДокумент.ПолеСлева  = 15;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		// Отметим конец области документа.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Формирование печатной формы ТТН.
// Параметры:
//	ДокументОбъект - Документ объект печати
//	ТабДокумент    - начальный табличный документ.
//
Функция ПечатьТТНОбщая(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТТНОбщая";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;

	ПервыйДокумент = Истина; 
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		ИмяРеквизитаОтправителя = "СкладКомпании";
		ИмяРеквизитаПолучателя  = "СкладПолучатель";
		
		ТипДок = ТипЗнч(Документ);
		
		Если ТипДок = Тип("ДокументСсылка.РеализацияТоваров") Тогда
			ИмяРеквизитаОтправителя = "СкладКомпании";
			ИмяРеквизитаПолучателя  = "Контрагент";
		КонецЕсли;
		
		Если Документ.Дата < '20120313' Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТОРГ.ПФ_MXL_ТТН25072011");
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТОРГ.ПФ_MXL_ТТН30122011_Приложение4");
		КонецЕсли;
		
		СтруктураОбластей = Новый Структура("Шапка,Пункт12,Пункт3,Пункт4,Пункт5,Пункт67,Пункт8,Пункт9,Пункт10,Пункт11,Пункт12,Пункт_12,Пункт13,Пункт14,Пункт15,Пункт16,Пункт17");
		// Заполним шапку
		СтруктураПредставления = Новый Структура;
		СтруктураПредставления.Вставить("Наименование",     "");
		СтруктураПредставления.Вставить("ИНН",              "ИНН ");
		СтруктураПредставления.Вставить("КПП",              "КПП ");
		СтруктураПредставления.Вставить("АдресФактический", "");
		СтруктураПредставления.Вставить("ТелефонРабочий",   "тел.: ");
		СтруктураПредставления.Вставить("БанковскийСчет",   "р/с ");
		СтруктураПредставления.Вставить("Банк",             НСтр("ru = 'в банке'") + " ");
		СтруктураПредставления.Вставить("БИК",              "БИК ");
		СтруктураПредставления.Вставить("КоррСчет",         "к/с ");
		
		ОбластьМакета = Макет.ПолучитьОбласть("ВесьМакет");
		
		ОбщийВес = 0;
		КоличествоМест = 0;
		
		Для Каждого ИмяТабличнойЧасти Из Документ.Метаданные().ТабличныеЧасти Цикл
			Если ИмяТабличнойЧасти.Имя = "Товары" Тогда
				Для Каждого ТекСтрока Из Документ[ИмяТабличнойЧасти.Имя] Цикл
					Если ЕстьРеквизит(Документ, "Количество", ИмяТабличнойЧасти.Имя) Тогда
						КоличествоМест = КоличествоМест + ТекСтрока.Количество;
					КонецЕсли;
					Если ЕстьРеквизит(Документ, "ЕдиницаИзмерения", ИмяТабличнойЧасти.Имя)
						И ЕстьРеквизит(Документ, "Количество", ИмяТабличнойЧасти.Имя)
						И ЗначениеЗаполнено(ТекСтрока.ЕдиницаИзмерения) Тогда
						ОбщийВес = ОбщийВес + ТекСтрока.Количество*ТекСтрока.ЕдиницаИзмерения.Вес;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		// Заполнение параметров
		ДатаДляПечати    = Формат(Документ.Дата,"ДЛФ=D");
		// Свойства
		ИскомыеСвойства = Новый Массив();
		ИскомыеСвойства.Добавить(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Грузополучатель);
		ИскомыеСвойства.Добавить(ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Грузоотправитель);
		
		ЗначенияСвойствОбъекта = УправлениеСвойствами.ПолучитьЗначенияСвойств(Документ, Ложь, Истина, ИскомыеСвойства);

		Грузоотправитель = УправлениеСвойствамиПлатформа.ПолучитьЗначениеСвойства("Грузоотправитель", ЗначенияСвойствОбъекта,Документ[ИмяРеквизитаОтправителя]);
		Грузополучатель  = УправлениеСвойствамиПлатформа.ПолучитьЗначениеСвойства("Грузополучатель",  ЗначенияСвойствОбъекта,Документ[ИмяРеквизитаПолучателя]);
		
		// Дата документа
		ДатаДокумента = Документ.Дата;
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		// Заполним адреса
		Если ТипЗнч(Грузоотправитель) = Тип("СправочникСсылка.СкладыКомпании") Тогда
			ОбластьМакета.Параметры.Грузоотправитель = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Грузоотправитель.Организация,СтруктураПредставления,,,ДатаДокумента,ДополнительныеПараметры);
		ИначеЕсли ТипЗнч(Грузоотправитель) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
			ОбластьМакета.Параметры.Грузоотправитель = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Грузоотправитель,СтруктураПредставления);
		Иначе
			ОбластьМакета.Параметры.Грузоотправитель = Грузоотправитель.Наименование;
		КонецЕсли;
		
		Если ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.СкладыКомпании") Тогда
			ОбластьМакета.Параметры.Грузополучатель = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Грузополучатель.Организация,СтруктураПредставления,,,ДатаДокумента,ДополнительныеПараметры);
		ИначеЕсли ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
			ОбластьМакета.Параметры.Грузополучатель = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Грузополучатель,СтруктураПредставления);
		ИначеЕсли ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.Контрагенты") Тогда
			ОбластьМакета.Параметры.Грузополучатель = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Грузополучатель,СтруктураПредставления);
		Иначе
			ОбластьМакета.Параметры.Грузополучатель = Грузополучатель.Наименование;
		КонецЕсли;
		
		ОбластьМакета.Параметры.МассаГруза      = НСтр("ru = 'Масса брутто груза:'") + " "       + ОбщийВес;
		ОбластьМакета.Параметры.КоличествоГруза = НСтр("ru = 'Количество грузовых мест:'") + " " + КоличествоМест;
		
		// Заполним дату
		Если Документ.Дата < '20120313' Тогда
			ОбластьМакета.Параметры.ДатаСоставления = ДатаДляПечати + " /" ;
		Иначе
			ОбластьМакета.Параметры.ДатаСоставления = ДатаДляПечати;
		КонецЕсли;
		
		НачалоВторогоЛиста = Макет.ПолучитьОбласть("ВторойЛист");
		НомерСтраницы = 2;
		НомерСтраницыПред = 2;
		Для Каждого Обл Из СтруктураОбластей Цикл
			ОбластьПункт = ОбластьМакета.ПолучитьОбласть(Обл.Ключ);
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьПункт, НачалоВторогоЛиста, , НомерСтраницы, ,Документ);
		КонецЦикла;
	
		// Отметим конец области документа.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьТ1Общая(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Т1Общая";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;

	ПервыйДокумент = Истина; 
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ФорматВыводаСуммы      = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		ФорматВыводаКоличества = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Документ);
		
		// Зададим параметры макета
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		// Получим данные из документа
		ДанныеДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ).ПолучитьДанныеДляПечатиТ1(Документ);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТОРГ.ПФ_MXL_ТТН");
		
		ОбластьЗаголовок        	= Макет.ПолучитьОбласть("Шапка");
		ОбластьШапкаТаблицы			= Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьСтрока				= Макет.ПолучитьОбласть("Строка");
		ОбластьИтоговПоСтранице		= Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьВсего				= Макет.ПолучитьОбласть("Всего");
		ОбластьПодвал           	= Макет.ПолучитьОбласть("Подвал");
		ОбластьТранспортныйРаздел   = Макет.ПолучитьОбласть("ТранспортныйРаздел");
		ОбластьСведенияОГрузе	    = Макет.ПолучитьОбласть("СведенияОГрузе");
		ОбластьПодвалСведенийОГрузе	= Макет.ПолучитьОбласть("ПодвалСведенийОГрузе");
		ОбластьПогрузочныеОперации	= Макет.ПолучитьОбласть("ПогрузочныеОперации");
		ОбластьПрочиеСведения		= Макет.ПолучитьОбласть("ПрочиеСведения");
		
		СтруктураПредставления1=Новый Структура;
		СтруктураПредставления1.Вставить("Наименование",     "");
		СтруктураПредставления1.Вставить("ИНН",              "ИНН ");
		СтруктураПредставления1.Вставить("КПП",              "КПП ");
		СтруктураПредставления1.Вставить("АдресЮридический", "");
		СтруктураПредставления1.Вставить("ТелефонРабочий",   "тел.: ");
		СтруктураПредставления1.Вставить("БанковскийСчет",   "р/с ");
		СтруктураПредставления1.Вставить("Банк",             НСтр("ru = 'в банке'") + " ");
		СтруктураПредставления1.Вставить("БИК",              "БИК ");
		СтруктураПредставления1.Вставить("КоррСчет",         "к/с ");
		
		СтруктураПредставления2=Новый Структура;
		СтруктураПредставления2.Вставить("Наименование",     "");
		СтруктураПредставления2.Вставить("ИНН",              "ИНН ");
		СтруктураПредставления2.Вставить("КПП",              "КПП ");
		СтруктураПредставления2.Вставить("АдресФактический", "");
		СтруктураПредставления2.Вставить("ТелефонРабочий",   "тел.: ");
		СтруктураПредставления2.Вставить("БанковскийСчет",   "р/с ");
		СтруктураПредставления2.Вставить("Банк",             НСтр("ru = 'в банке'") + " ");
		СтруктураПредставления2.Вставить("БИК",              "БИК ");
		СтруктураПредставления2.Вставить("КоррСчет",         "к/с ");
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Шапка");
		ОбластьЗаголовок.Параметры.НомерДокумента                = ДанныеДокумента.Номер;
		ОбластьЗаголовок.Параметры.ДатаДокумента                 = Формат(ДанныеДокумента.Дата,"ДЛФ=D");
		ОбластьЗаголовок.Параметры.Грузоотправитель              = ДанныеДокумента.Грузоотправитель;
		ОбластьЗаголовок.Параметры.Грузополучатель               = ДанныеДокумента.Грузополучатель;
		ОбластьЗаголовок.Параметры.Плательщик                    = ДанныеДокумента.Плательщик;
		Если ЗначениеЗаполнено(ДанныеДокумента.Плательщик) Тогда
			ОбластьЗаголовок.Параметры.ПлательщикПредставление       = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Плательщик,СтруктураПредставления1);
		КонецЕсли;
		
		Если ТипЗнч(ОбластьЗаголовок.Параметры.Грузоотправитель) = Тип("СправочникСсылка.СкладыКомпании") Тогда
			ОбластьЗаголовок.Параметры.ГрузоотправительПоОКПО	 = ОбластьЗаголовок.Параметры.Грузоотправитель.Организация.КодПоОКПО;
			ОбластьЗаголовок.Параметры.ГрузоотправительПредставление = ДанныеДокумента.Грузоотправитель;
		ИначеЕсли ТипЗнч(ОбластьЗаголовок.Параметры.Грузоотправитель) = Тип("СправочникСсылка.Контрагенты") ИЛИ ТипЗнч(ОбластьЗаголовок.Параметры.Грузоотправитель) = Тип("СправочникСсылка.Организации") Тогда 
			ОбластьЗаголовок.Параметры.ГрузоотправительПоОКПО	 = ОбластьЗаголовок.Параметры.Грузоотправитель.КодПоОКПО;
			ОбластьЗаголовок.Параметры.ГрузоотправительПредставление = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Грузоотправитель,СтруктураПредставления2);
		КонецЕсли;
		
		Если ТипЗнч(ОбластьЗаголовок.Параметры.Грузополучатель) = Тип("СправочникСсылка.СкладыКомпании") Тогда
			 ОбластьЗаголовок.Параметры.ГрузополучательПоОКПО		  = ОбластьЗаголовок.Параметры.Грузополучатель.Организация.КодПоОКПО;
			 ОбластьЗаголовок.Параметры.ГрузополучательПредставление  = ДанныеДокумента.Грузополучатель;
		ИначеЕсли ТипЗнч(ОбластьЗаголовок.Параметры.Грузополучатель) = Тип("СправочникСсылка.Контрагенты") ИЛИ ТипЗнч(ОбластьЗаголовок.Параметры.Грузополучатель) = Тип("СправочникСсылка.Организации") Тогда  	
			 ОбластьЗаголовок.Параметры.ГрузополучательПоОКПО		 = ОбластьЗаголовок.Параметры.Грузополучатель.КодПоОКПО;
			 ОбластьЗаголовок.Параметры.ГрузополучательПредставление  = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Грузополучатель,СтруктураПредставления2);
		КонецЕсли;
		ОбластьЗаголовок.Параметры.ПлательщикПоОКПО			  	 = ?(ЗначениеЗаполнено(ДанныеДокумента.Плательщик),ОбластьЗаголовок.Параметры.Плательщик.КодПоОКПО,"") ;
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		// Выводим заголовок таблицы
		ОбластьШапкаТаблицы.Параметры.Валюта= ДанныеДокумента.ВалютаДокумента;
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		НомерСтраницы	= 2;
		НомерСтраницыПред = НомерСтраницы;	
		
		// Инициализация итогов по документу.
		Ном            = 0;
		ИтогоМест      = 0;
		ИтогоВес       = 0;
		
		// Инициализация итогов по странице.
		СтруктураИтоговПоСтранице = Новый Структура("Количество, СуммаВсего",0,0);
	
		// Заполним параметры шапки таблицы для следующего листа.
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы  = "Страница:" + " " + НомерСтраницы;
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = НСтр("ru = 'Товарно-транспортная накладная товарный раздел'") + " ";
	
		ВыборкаСтрок = ДанныеДокумента.ВыборкаТабличнойЧасти;
		КоличествоСтрок = ВыборкаСтрок.Количество();

		// Доп. области
		мсвДопОбластиПодвала = Новый Массив;
		мсвДопОбластиПодвала.Добавить(ОбластьВсего);
		мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		
		Для Каждого СтрокаТоваров Из ВыборкаСтрок Цикл
			// Заполняем данные строки
			Ном = Ном + 1;
			ТоварНаименование = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(СтрокаТоваров.Номенклатура);
			Характеристика = СтрокаТоваров.ХарактеристикаНоменклатуры;
			// Характеристику выводим в строке с наименованием.
			ТоварНаименование = ТоварНаименование 
									+ ?(ЗначениеЗаполнено(Характеристика),", " 
									+ УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Характеристика),"");
			
			Цена=СтрокаТоваров.СуммаВсего/(СтрокаТоваров.КоличествоБазовое);
			
			МассаБрутто = 0;
			Если ЕстьРеквизит(ВыборкаСтрок, "КодПродукции") Тогда
				ОбластьСтрока.Параметры.КодПродукции 				= СтрокаТоваров.КодПродукции;
			Иначе
				ОбластьСтрока.Параметры.КодПродукции			= СтрокаТоваров.Номенклатура.Код;
			КонецЕсли;
			
			Если ЕстьРеквизит(ВыборкаСтрок, "Артикул") Тогда
				ОбластьСтрока.Параметры.Артикул 				= СтрокаТоваров.Артикул;
			Иначе
				ОбластьСтрока.Параметры.Артикул 				= СтрокаТоваров.Номенклатура.Артикул;
			КонецЕсли;
			ОбластьСтрока.Параметры.Количество					= Формат(СтрокаТоваров.КоличествоБазовое, ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.Цена						= Формат(Цена, ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.ТоварНаименование			= ТоварНаименование;
			ОбластьСтрока.Параметры.Номенклатура				= СтрокаТоваров.Номенклатура;
			Если ЕстьРеквизит(ВыборкаСтрок, "ЕдиницаИзмерения") Тогда
				МассаБрутто = СтрокаТоваров.ЕдиницаИзмерения.Вес*СтрокаТоваров.Количество;
				ОбластьСтрока.Параметры.БазоваяЕдиницаНаименование	= УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(СтрокаТоваров.ЕдиницаИзмерения);
				ОбластьСтрока.Параметры.ВидУпаковки					= СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору;
			КонецЕсли;
			ОбластьСтрока.Параметры.КоличествоМест				= Формат(СтрокаТоваров.Количество, ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.Масса						= Формат(МассаБрутто, ФорматВыводаКоличества);
			ОбластьСтрока.Параметры.СуммаВсего					= Формат(СтрокаТоваров.СуммаВсего, ФорматВыводаСуммы);
			
			ИтогоМест = ИтогоМест + СтрокаТоваров.Количество;
			ИтогоВес  = ИтогоВес + МассаБрутто;
			
			// Выводим строку, делая проверку попадания на лист
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока,
								ОбластьШапкаТаблицы, ОбластьИтоговПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице, Документ, 
								мсвДопОбластиПодвала);
			
			// Инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("Количество, СуммаВсего",0,0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			
			// Обновим итоги по странице
			СтруктураИтоговПоСтранице.Количество = СтруктураИтоговПоСтранице.Количество + СтрокаТоваров.КоличествоБазовое;
			СтруктураИтоговПоСтранице.СуммаВсего = СтруктураИтоговПоСтранице.СуммаВсего + (СтрокаТоваров.СуммаВсего);
		КонецЦикла;
		
			// Выводим последний подвал, если страниц больше единицы.
		Если НомерСтраницы > 2 Тогда
			УправлениеПечатьюПлатформа.ВывестиИтогиПоСтранице(ТабличныйДокумент,ОбластьИтоговПоСтранице,СтруктураИтоговПоСтранице,Документ);
		КонецЕсли;
		
		ИтогоКоличество = ДанныеДокумента.ВыборкаТабличнойЧасти.Итог("КоличествоБазовое");
		ИтогоСуммаСНДС  = ДанныеДокумента.ВыборкаТабличнойЧасти.Итог("СуммаВсего");
		
		// Выводим итоги по документу в целом.
		ОбластьВсего.Параметры.Количество = Формат(ИтогоКоличество, ФорматВыводаКоличества);
		ОбластьВсего.Параметры.СуммаВсего = Формат(ИтогоСуммаСНДС, ФорматВыводаСуммы);
		
		ТабличныйДокумент.Вывести(ОбластьВсего);
		
		// Выводим подвал документа.
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.Руководитель);
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.ГлавныйБухгалтер);
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.Отпустил);
		ОбластьПодвал.Параметры.Заполнить(ДанныеДокумента.Получил);
		ОбластьПодвал.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок,,",,,,,,,,0");
		ОбластьПодвал.Параметры.КоличествоСтрок         = КоличествоСтрок;
		ОбластьПодвал.Параметры.ВсегоМестПрописью       = ЧислоПрописью(ИтогоМест,,",,,,,,,,3");
		ОбластьПодвал.Параметры.ВсегоНаименований       = ЧислоПрописью(КоличествоСтрок,,",,,,,,,,0");
		ОбластьПодвал.Параметры.ОтпущеноНаСуммуПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ИтогоСуммаСНДС,ДанныеДокумента.ВалютаДокумента);
		ОбластьПодвал.Параметры.ВсегоКОплате			 = Формат(ИтогоСуммаСНДС, ФорматВыводаСуммы);
		Если НЕ Цел(ИтогоМест) = ИтогоМест Тогда
			Если ИтогоВес <> 0 Тогда
				ОбластьПодвал.Параметры.МассаГрузаБрутто		= ЧислоПрописью(ИтогоВес,,",,,,,,,,3");
			КонецЕсли;
			ОбластьПодвал.Параметры.ВсегоМестПрописью       = ЧислоПрописью(ИтогоМест,,",,,,,,,,3");
		Иначе
			Если ИтогоВес <> 0 Тогда
				ОбластьПодвал.Параметры.МассаГрузаБрутто		= ЧислоПрописью(ИтогоВес,,",,,,,,,,0");
			КонецЕсли;
			ОбластьПодвал.Параметры.ВсегоМестПрописью       = ЧислоПрописью(ИтогоМест,,",,,,,,,,0");
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// Область Транс. раздел.
		Если ТипЗнч(ДанныеДокумента.ЛицензионнаяКарточка) = Тип("Булево") Тогда
			ШрифтСтандарт   = Новый Шрифт(ОбластьТранспортныйРаздел.Области.Стандарт.Шрифт, , , , , , НЕ ДанныеДокумента.ЛицензионнаяКарточка);
			ШрифтОграничено = Новый Шрифт(ОбластьТранспортныйРаздел.Области.Стандарт.Шрифт, , , , , , ДанныеДокумента.ЛицензионнаяКарточка);
			ОбластьТранспортныйРаздел.Области.Стандарт.Шрифт   = ШрифтСтандарт;
			ОбластьТранспортныйРаздел.Области.Ограничено.Шрифт = ШрифтОграничено;
		КонецЕсли;

		ОбластьТранспортныйРаздел.Параметры.СрокДоставки              = ДанныеДокумента.СрокДоставки;
		ОбластьТранспортныйРаздел.Параметры.Номер                     = ДанныеДокумента.Номер;
		ОбластьТранспортныйРаздел.Параметры.ОрганизацияПеревозчик     = ДанныеДокумента.Перевозчик;
		ОбластьТранспортныйРаздел.Параметры.МаркаАвтомобиля           = ДанныеДокумента.МаркаАвтомобиля;
		ОбластьТранспортныйРаздел.Параметры.ГосНомерАвтомобиля        = ДанныеДокумента.ГосНомерАвтомобиля;
		ОбластьТранспортныйРаздел.Параметры.ОрганизацияЗаказчик       = ДанныеДокумента.Заказчик;
		ОбластьТранспортныйРаздел.Параметры.ФИОВодителя               = ДанныеДокумента.Водитель;
		ОбластьТранспортныйРаздел.Параметры.ВодительскоеУдостоверение = ДанныеДокумента.ВодительскоеУдостоверение;
		ОбластьТранспортныйРаздел.Параметры.ВидПеревозки              = ДанныеДокумента.ВидПеревозки;
		ОбластьТранспортныйРаздел.Параметры.ПунктПогрузки             = ДанныеДокумента.ПунктПогрузки;
		ОбластьТранспортныйРаздел.Параметры.ПунктРазгрузки            = ДанныеДокумента.ПунктРазгрузки;
		ОбластьТранспортныйРаздел.Параметры.Прицеп                    = ДанныеДокумента.МаркаПрицепа;
		ОбластьТранспортныйРаздел.Параметры.ГосНомерПрицепа           = ДанныеДокумента.ГосНомерПрицепа;
		
		ТабличныйДокумент.Вывести(ОбластьТранспортныйРаздел);
		ТабличныйДокумент.Вывести(ОбластьСведенияОГрузе);
		ТабличныйДокумент.Вывести(ОбластьПодвалСведенийОГрузе);
		ТабличныйДокумент.Вывести(ОбластьПогрузочныеОперации);
		
		ОбластьПрочиеСведения.Параметры.Валюта = ДанныеДокумента.ВалютаДокумента;
		ТабличныйДокумент.Вывести(ОбластьПрочиеСведения);
		
		ТабличныйДокумент.АвтоМасштаб = Истина;
		
		// Отметим конец области документа
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

//Мальцев А.Ю.+++
Функция ДокументНаходитсяВСтатусеКонтроле(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итСостоянияВыполненияПоступленийТоваров.Поступление КАК Поступление,
	|	итСостоянияВыполненияПоступленийТоваров.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.итСостоянияВыполненияПоступленийТоваров КАК итСостоянияВыполненияПоступленийТоваров
	|ГДЕ
	|	итСостоянияВыполненияПоступленийТоваров.Поступление = &Документ
	|	И итСостоянияВыполненияПоступленийТоваров.Состояние = &Состояние";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Состояние", Перечисления.итСостоянияВыполненияПоступленийТоваров.НаКонтроле);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции
//Мальцев А.Ю.---

#КонецЕсли