
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьПоУмолчаниюПриСоздании();
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.КоманднаяПанельПодменюПечать);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчаниюПриСоздании()
	
	Период.ДатаНачала    = Объект.ДатаНачала;
	Период.ДатаОкончания = Объект.ДатаОкончания;				
		
	Если Объект.Ссылка.Пустая() Тогда
		
		ТекПользователь    			 = ПараметрыСеанса.ТекущийПользователь;
		Объект.Организация 			 = ТекПользователь.Организация;
		Объект.ПодразделениеКомпании = ТекПользователь.ПодразделениеКомпании;
		Объект.Ответственный         = ТекПользователь;
			
		Период.ДатаНачала    = НачалоМесяца(ТекущаяДата());
		Период.ДатаОкончания = КонецМесяца(ТекущаяДата());		
		
		Объект.ДатаНачала 	 = Период.ДатаНачала;
		Объект.ДатаОкончания = Период.ДатаОкончания;
			
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.ДатаНачала 	 = НачалоДня(Период.ДатаНачала);
	Объект.ДатаОкончания = КонецДня(Период.ДатаОкончания);

КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Печать
&НаКлиенте
//Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
Процедура Подключаемый_ОбработкаКомандыФормы(Команда)
	 
	ОбновитьПовторноИспользуемыеЗначения();
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	//ДополнениеКомандПечатиНаСервере(); 
	//ОбновитьПовторноИспользуемыеЗначения();
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодчиненныеДокументы(Команда)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

&НаСервере
Процедура ЗаполнитьПродавцовНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.Продавцы.Очистить();
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаПредИнвентаризации  = Документы.Инвентаризация.ПолучитьДатуПредыдущейИнвентаризацииОтДаты(КонецДня(Объект.ДатаОкончания), Объект.ПодразделениеКомпании);
	Если ДатаПредИнвентаризации = НЕОПРЕДЕЛЕНО Тогда
		Сообщить("Не обнаружено предыдущей инвентаризации");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ит_Продавцы.ФизическоеЛицо.ЕРПМастерКлюч КАК ЕРПМастерКлюч
	|ИЗ
	|	Справочник.ит_Продавцы КАК ит_Продавцы
	|ГДЕ
	|	ит_Продавцы.ЕРПМастерКлюч <> """"";

	РезультатЗапроса		= Запрос.Выполнить();
	ТаблицаМастерКлючей		= РезультатЗапроса.Выгрузить();
	ХранилищеМастерКлючей	= Новый ХранилищеЗначения(ТаблицаМастерКлючей);
	WSПрокси				= ИТ_СпециальныйМодульСервер.СоздатьWSПроксиПоКлючу("mysteryshopper_ocenkaprodavcov");
	СериализованныеДанные	= WSПрокси.dannietabelya(ДатаПредИнвентаризации, Объект.ДатаОкончания, ХранилищеМастерКлючей).Получить();
	ТаблицаПродавцов		= ИТ_СпециальныйМодульСервер.Десериализовать(СериализованныеДанные);
	ТаблицаПродавцов.Свернуть("ПродавецЕРПМастерКлюч,ТорговаяТочкаЕРПМастерКлюч");
	
	ПродавцыТочки 		  = ТаблицаПродавцов.НайтиСтроки(Новый Структура("ТорговаяТочкаЕРПМастерКлюч",Объект.ПодразделениеКомпании.ЕРПМастерКлюч));
	Для Каждого стр Из ПродавцыТочки Цикл
		
		МОЛ = Справочники.Сотрудники.НайтиПоРеквизиту("ЕРПМастерКлюч", стр.ПродавецЕРПМастерКлюч);
		Если ЗначениеЗаполнено(МОЛ) Тогда
			НовСтр = Об.Продавцы.Добавить();
			НовСтр.МОЛ = МОЛ;
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	ЗначениеВРеквизитФормы(Об, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПродавцов(Команда)
	Записать();
	ЗаполнитьПродавцовНаСервере();
КонецПроцедуры
