// Модуль менеджера справочника "Подразделения компании"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	ПодразделенияКомпанииОсновноеПодразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение.ПолучитьОбъект();
	
	// перезаполняем реквизиты
	Если НЕ ЗначениеЗаполнено(ПодразделенияКомпанииОсновноеПодразделение.Организация) Тогда
		ПодразделенияКомпанииОсновноеПодразделение.Организация = Справочники.Организации.ОсновнаяОрганизация;
	КонецЕсли;
	
	ПодразделенияКомпанииОсновноеПодразделение.Балансовое = Истина;
	
	// Сохранение справочника
	НовыйЭлемент = ПодразделенияКомпанииОсновноеПодразделение.ЭтоНовый();
	Если ПодразделенияКомпанииОсновноеПодразделение.Модифицированность() Тогда
		Попытка
			ПодразделенияКомпанииОсновноеПодразделение.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Подразделения компании"". %1 элемент ""%2""'"),,,,,?(НовыйЭлемент,"Создан","Модифицирован"),СокрЛП(ПодразделенияКомпанииОсновноеПодразделение.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Подразделения компании""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
		
	// На нулевом уровне может находится только предопределенный элемент "Вся компания". 
	// Поэтому все лишнее перенесем на первый уровень.
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодразделенияКомпании.Ссылка
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|	ПодразделенияКомпании.Родитель = &Родитель
	|	И ПодразделенияКомпании.Ссылка <> &Ссылка";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Родитель", Справочники.ПодразделенияКомпании.ПустаяСсылка());
	Запрос.УстановитьПараметр("Ссылка",   Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл // Все элементы на этом уровне "Лишние".
		ТекОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ТекОбъект.Родитель = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		ТекОбъект.Записать();
	КонецЦикла;
	
	// Подразделение "Вся компания" (корневой элемент) всегда будет балансовым.
	// SUIG - на необходимость записи как бы тоже надо проверять (а то так и будет по обменам ходить...).
	ПодразделенияКомпанииОсновноеПодразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение.ПолучитьОбъект();
	Если НЕ ПодразделенияКомпанииОсновноеПодразделение.Балансовое  Тогда
		ПодразделенияКомпанииОсновноеПодразделение.Балансовое = Истина;
		ПодразделенияКомпанииОсновноеПодразделение.ОбменДанными.Загрузка = Истина;
		ПодразделенияКомпанииОсновноеПодразделение.Записать();
	КонецЕсли; 
	
	ПодразделенияКомпанииОсновноеПодразделение = Неопределено;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

// функция устанавливает актуальное значение КПП
Процедура УстановитьАктуальноеЗначениеИсторииКПП(КПП, ИсторияКПП) Экспорт
	
	КоличествоЗаписей = ИсторияКПП.Количество();
	
	Если КоличествоЗаписей > 0 Тогда
		
		ИсторияКПП.Сортировать("Период");
		АктуальнаяЗаписьИстории = ИсторияКПП[КоличествоЗаписей - 1];
		АктуальнаяЗаписьИстории.КПП = КПП;
		
	КонецЕсли;
	
КонецПроцедуры

// функция устанавливает актуальное значение наименования
Процедура УстановитьАктуальноеЗначениеИсторииНаименований(НаименованиеПолное, ИсторияНаименований) Экспорт
	
	КоличествоЗаписей = ИсторияНаименований.Количество();
	
	Если КоличествоЗаписей > 0 Тогда
		
		ИсторияНаименований.Сортировать("Период");
		АктуальнаяЗаписьИстории = ИсторияНаименований[КоличествоЗаписей - 1];
		АктуальнаяЗаписьИстории.НаименованиеПолное = НаименованиеПолное;
		
	КонецЕсли;
	
КонецПроцедуры

// функция получает актуальный КПП на дату
Функция КППНаДату(Подразделение, ДатаСведений) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Подразделение)
		ИЛИ ТипЗнч(Подразделение) <> Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаСведений) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "КПП");
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Подразделение", Подразделение);
	Запрос.Параметры.Вставить("ДатаСведений", ДатаСведений);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ИсторияКПППодразделений.Период) КАК Период,
	|	ИсторияКПППодразделений.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ЗначенияКПП
	|ИЗ
	|	Справочник.ПодразделенияКомпании.ИсторияКПП КАК ИсторияКПППодразделений
	|ГДЕ
	|	ИсторияКПППодразделений.Ссылка = &Подразделение
	|	И ИсторияКПППодразделений.Период <= &ДатаСведений
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияКПППодразделений.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсторияКПППодразделений.КПП КАК КПП
	|ИЗ
	|	ЗначенияКПП КАК ЗначенияКПП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании.ИсторияКПП КАК ИсторияКПППодразделений
	|		ПО ЗначенияКПП.Ссылка = ИсторияКПППодразделений.Ссылка
	|			И ЗначенияКПП.Период = ИсторияКПППодразделений.Период";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КПП;
	Иначе
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "КПП");
	КонецЕсли;
КонецФункции

// функция получает актуальные наименования на дату
Функция НаименованияНаДату(Подразделение, ДатаСведений) Экспорт
	
	НаименованияПодразделения = Новый Структура("СокращенноеНаименование, НаименованиеПолное, НаименованиеДляПечатныхФорм", "", "", "");
	
	Если НЕ ЗначениеЗаполнено(Подразделение)
		ИЛИ ТипЗнч(Подразделение) <> Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		Возврат НаименованияПодразделения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаСведений) Тогда
		Запрос = Новый Запрос();
		Запрос.Параметры.Вставить("Подразделение", Подразделение);
		Запрос.Параметры.Вставить("ДатаСведений", ДатаСведений);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ИсторияНаименованийПодразделений.Период) КАК Период,
		|	ИсторияНаименованийПодразделений.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ЗначенияНаименований
		|ИЗ
		|	Справочник.Контрагенты.ИсторияНаименований КАК ИсторияНаименованийПодразделений
		|ГДЕ
		|	ИсторияНаименованийПодразделений.Ссылка = &Подразделение
		|	И ИсторияНаименованийПодразделений.Период <= &ДатаСведений
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияНаименованийПодразделений.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсторияНаименованийПодразделений.Ссылка.Наименование КАК Наименование,
		|	ИсторияНаименованийПодразделений.НаименованиеПолное КАК НаименованиеПолное
		|ИЗ
		|	ЗначенияНаименований КАК ЗначенияНаименований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании.ИсторияНаименований КАК ИсторияНаименованийПодразделений
		|		ПО ЗначенияНаименований.Ссылка = ИсторияНаименованийПодразделений.Ссылка
		|			И ЗначенияНаименований.Период = ИсторияНаименованийПодразделений.Период";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НаименованияПодразделения.СокращенноеНаименование     = Выборка.Наименование;
			НаименованияПодразделения.НаименованиеПолное          = Выборка.НаименованиеПолное;
			НаименованияПодразделения.НаименованиеДляПечатныхФорм = Выборка.НаименованиеПолное;
			Возврат НаименованияПодразделения;
		КонецЕсли;
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подразделение, "Наименование, НаименованиеПолное");
	НаименованияПодразделения.СокращенноеНаименование     = ЗначенияРеквизитов.Наименование;
	НаименованияПодразделения.НаименованиеПолное          = ЗначенияРеквизитов.НаименованиеПолное;
	НаименованияПодразделения.НаименованиеДляПечатныхФорм = ЗначенияРеквизитов.НаименованиеПолное;
	Возврат НаименованияПодразделения;
	
КонецФункции



////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	// Указания корневому подразделению не требуется
	Если НЕ(Объект.Ссылка=Справочники.ПодразделенияКомпании.ОсновноеПодразделение) Тогда
		ОбязательныеРеквизиты.Добавить("Организация");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Наименование");
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Балансовое");
	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция получает для небалансового подразделения соответствующее балансовое подразделение
// (на которое будут переноситься остатки при закрытии периода).
//
// Параметры:
//  Источник - "СправочникСсылка.ПодразделениеКомпании" - небалансовое подразделение,
//                                                        остатки которого необходимо перенести.
//
// Возвращаемое значение:
//   "СправочникСсылка.ПодразделениеКомпании" - балансовое подразделение, на которое будут перенесены остатки.
// 
Функция ПолучитьБалансовоеПодразделение(ПодразделениеИсточник, Дата) Экспорт
	
	КорневойЭлемент = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
	
	// Если учет ведется не по подразделениям, то вернем корневое подразделение.
	Если ПолучитьЗначениеУчетнойПолитики("СпособВеденияБаланса", Неопределено, Дата)<>Перечисления.СпособВеденияБаланса.ПоПодразделению Тогда
		Возврат КорневойЭлемент;
	КонецЕсли;
	
	Если ПодразделениеИсточник.Балансовое ИЛИ (ПодразделениеИсточник=КорневойЭлемент) Тогда
		Возврат ПодразделениеИсточник;
	КонецЕсли;
	
	ТекЭлемент = ПодразделениеИсточник;
	Пока Истина Цикл
		ТекЭлемент = ТекЭлемент.Родитель;
		Если ТекЭлемент.Пустая() Или (ТекЭлемент=КорневойЭлемент) Тогда
			Возврат КорневойЭлемент;
		КонецЕсли;
		
		Если ТекЭлемент.Балансовое Тогда
			Возврат ТекЭлемент;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции // ПолучитьБалансовоеПодразделение()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Вызываем общий обработчик события
	ОбработкаСобытийСправочникаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Наименование".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура НаименованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры // НаименованиеПриИзменении()

// Обработчик события при окончании изменения данных реквизита "НаименованиеПолное"
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура НаименованиеПолноеПриИзменении(Объект, ПараметрыДействия) Экспорт
	// смотрим заполнено ли наименование
	Если ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
		// получаем структура наименований
		СтруктураНаименований = ОбщегоНазначения.ПолучитьНаименованияНаДату(Объект.Ссылка, ТекущаяДатаСеанса());
		
		// получаем наименование
		НаименованиеНаСегодня = СтруктураНаименований.НаименованиеПолное;
		
		// смотрим заполнено ли значение
		Если Объект.ИсторияНаименований.Количество() > 0 И ЗначениеЗаполнено(НаименованиеНаСегодня) Тогда
			// проверяем изменилось ли наименование
			Если НаименованиеНаСегодня <> Объект.НаименованиеПолное Тогда
				// формируем структуру отбора
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Период", НачалоДня(ТекущаяДатаСеанса()));
				
				// ищем значение на сегодня в ТЧ
				НайденныеСтроки = Объект.ИсторияНаименований.НайтиСтроки(СтруктураОтбора);
				
				// проверяем
				Если НайденныеСтроки.Количество() > 0 Тогда
					// получаем строку
					ТекСтрока = НайденныеСтроки[0];
					ТекСтрока.НаименованиеПолное = Объект.НаименованиеПолное;
				Иначе
					// добавляем строку
					НоваяСтрока = Объект.ИсторияНаименований.Добавить();
					НоваяСтрока.Период = ТекущаяДатаСеанса();
					НоваяСтрока.НаименованиеПолное = Объект.НаименованиеПолное;
				КонецЕсли;
			КонецЕсли;
		Иначе
			// ищем строку с пустым периодом
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Период", Дата("00010101"));
			
			// ищем значение на сегодня в ТЧ
			НайденныеСтроки = Объект.ИсторияНаименований.НайтиСтроки(СтруктураОтбора);
			
			// смотрим нашли или нет
			Если НайденныеСтроки.Количество() > 0 Тогда
				// получаем строку
				ТекСтрока = НайденныеСтроки[0];
				ТекСтрока.НаименованиеПолное = Объект.НаименованиеПолное;
			Иначе
				// добавляем строку
				НоваяСтрока = Объект.ИсторияНаименований.Добавить();
				НоваяСтрока.Период = Дата("00010101");
				НоваяСтрока.НаименованиеПолное = Объект.НаименованиеПолное;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры  //НаименованиеПолноеПриИзменении()


// Обработчик события при окончании изменения данных реквизита "КПП"
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КПППриИзменении(Объект, ПараметрыДействия) Экспорт
	// смотрим заполнено ли КПП
	Если ЗначениеЗаполнено(Объект.КПП) Тогда
		// получаем ссылку
		ТекОбъект = Объект.Ссылка;
		
		// получаем последний КПП
		КППНаСегодня = ОбщегоНазначения.ПолучитьКППНаДату(ТекОбъект, ТекущаяДатаСеанса());
		
		// смотрим заполнено ли значение
		Если Объект.ИсторияКПП.Количество() > 0 И ЗначениеЗаполнено(КППНаСегодня) Тогда 
			// проверяем изменился ли КПП
			Если КППНаСегодня <> Объект.КПП Тогда
				// формируем структуру отбора
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Период", НачалоДня(ТекущаяДатаСеанса()));
				
				// ищем значение на сегодня в ТЧ
				НайденныеСтроки = Объект.ИсторияКПП.НайтиСтроки(СтруктураОтбора);
				
				// проверяем
				Если НайденныеСтроки.Количество() > 0 Тогда
					// получаем строку
					ТекСтрока = НайденныеСтроки[0];
					ТекСтрока.КПП = Объект.КПП;
				Иначе
					// добавляем строку
					НоваяСтрока = Объект.ИсторияКПП.Добавить();
					НоваяСтрока.Период = ТекущаяДатаСеанса();
					НоваяСтрока.КПП = Объект.КПП;
				КонецЕсли;
			КонецЕсли;
		Иначе
			// ищем строку с пустым периодом
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Период", Дата("00010101"));
			
			// ищем значение на сегодня в ТЧ
			НайденныеСтроки = Объект.ИсторияКПП.НайтиСтроки(СтруктураОтбора);
			
			// смотрим нашли или нет
			Если НайденныеСтроки.Количество() > 0 Тогда
				// получаем строку
				ТекСтрока = НайденныеСтроки[0];
				ТекСтрока.КПП = Объект.КПП;
			Иначе
				// добавляем строку
				НоваяСтрока = Объект.ИсторияКПП.Добавить();
				НоваяСтрока.Период = Дата("00010101");
				НоваяСтрока.КПП = Объект.КПП;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли