// Общий модуль "Управление списком регистра (сервер)"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедуры производит инициализацию служебных реквизитов формы списка.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которую производиться добавление реквизитов.
//
Процедура ИнициализироватьСлужебныеРеквизиты(Форма)
	
	// Составим перечень добавляемых в форму реквизитов
	СлужебныеРеквизиты = Новый Структура();
	СлужебныеРеквизиты.Вставить("ПолноеИмяОбъекта", Форма.Список.ОсновнаяТаблица);
	СлужебныеРеквизиты.Вставить("КлючОбъекта",      Форма.Список.ОсновнаяТаблица+?(ПолучитьЗначениеПараметраСтруктуры(Форма.Параметры, "РежимВыбора", ЛОЖЬ), ".РежимВыбора", ""));
	
	// Корректировочный реквизит формы, используется для пропуска лишних вызовов событий активизации строки.
	СлужебныеРеквизиты.Вставить("ТекущийЭлементСписка", Неопределено);
	
	// Производим создание дополнительных реквизитов формы
	УправлениеДиалогомСервер.ДобавитьРеквизитыФормы(Форма, СлужебныеРеквизиты);
	
КонецПроцедуры // ИнициализироватьСлужебныеРеквизиты()

// Процедуры производит инициализацию команд в форме списка.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которую производиться добавление команды.
//
Процедура ИнициализироватьКомандыПанелиДействий(Форма)
	
	 // Определим в какую панель формы необходимо помещать новые кнопки
	ИмяКоманднойПанелиФормы = ?(Форма.Элементы.Найти("ОсновныеДействия")=Неопределено, "ФормаКоманднаяПанель", "ОсновныеДействия");
	
	// Произведем добавление панели для размещения дополнительных операций с формой
	НазначитьДополнительныеДействия = (НЕ Форма.Элементы.Найти("ДополнительныеДействия")=Неопределено);
	
	// Инициализируем элементы формы связанные с Дополнительными отчетами и обработками.
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(Форма, "ФормаСписка");
	
	// Создаем подменю печати
	ПодменюПечати = ЗащищенныеФункцииСервер.ДобавитьГруппуКоманд(Форма, "ПодменюПечать", ИмяКоманднойПанелиФормы,, "Печать", БиблиотекаКартинок.ПодменюПечать,,, ОтображениеКнопки.Картинка);
	
	// Добавим команды печати печати
	УправлениеПечатью.ПриСозданииНаСервере(Форма, ПодменюПечати);
	
	// Производим инициализацию дополнительных команд формы списка
	Если НазначитьДополнительныеДействия Тогда
		
		// Формируем секцию команд группировки списка
		Если НЕ ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
			ЗащищенныеФункцииСервер.ДобавитьГруппуКоманд(Форма, "ГруппировкаСписка", "ДополнительныеДействия", ЛОЖЬ, НСтр("ru = 'Группировка списка'"));
			ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ГруппироватьПоКолонке",  "ГруппировкаСписка", БиблиотекаКартинок.ДинамическийСписокУстановитьГруппировку, НСтр("ru = 'Группировать по значениям колонки'"), НСтр("ru = 'Произвести группировку элементов списка по значениям текущей колонки'"));
			ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ОтменаГруппировки",      "ГруппировкаСписка", БиблиотекаКартинок.ДинамическийСписокОтменитьГруппировку,   НСтр("ru = 'Отменить группировку строк'"),       НСтр("ru = 'Отменить все группировки списка'"));
			
			ЗащищенныеФункцииСервер.ДобавитьГруппуКоманд(Форма, "ГруппировкаСпискаМеню", "СписокКонтекстноеМеню", ЛОЖЬ, НСтр("ru = 'Группировка списка'"));
			ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ГруппироватьПоКолонке",  "ГруппировкаСпискаМеню",    БиблиотекаКартинок.ДинамическийСписокУстановитьГруппировку, НСтр("ru = 'Группировать по значениям колонки'"), НСтр("ru = 'Произвести группировку элементов списка по значениям текущей колонки'"),,,,, "Меню");
			ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ОтменаГруппировки",      "ГруппировкаСпискаМеню",    БиблиотекаКартинок.ДинамическийСписокОтменитьГруппировку,   НСтр("ru = 'Отменить группировку строк'"),        НСтр("ru = 'Отменить все группировки списка'"),,,,, "Меню");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ИнициализироватьКомандыПанелиДействий()

// Производит установку расширенного заголовка формы списка регистров.
//
// Параметры:
//  Форма - УправляемаяФорма - форма переданного регистра.
//
Процедура УстановитьЗаголовокСпискаРегистра(Форма)
	
	// Получим представление объекта, к которому относиться динамический список
	ПредставлениеСписка = УправлениеДиалогомСервер.ПредставлениеСпискаОбъектов(Форма);
	
	// Получим представление наложенного на список отбора по владельцу
	ПредставлениеРегистратора = ?(Форма.Параметры.Свойство("Отбор") И Форма.Параметры.Отбор.Свойство("Регистратор") И ЗначениеЗаполнено(Форма.Параметры.Отбор.Регистратор), СокрЛП(Форма.Параметры.Отбор.Регистратор), "");
	
	// Сформируем итоговое представление динамического списка
	Форма.Заголовок = ПредставлениеСписка + ?(ПустаяСтрока(ПредставлениеРегистратора), "", " ("+ПредставлениеРегистратора+")");
	
КонецПроцедуры // УстановитьЗаголовокСпискаРегистра()



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Общий обработчик события выбора одного из пунктов меню доступных хоз. операций
// 
// Параметры:
//  Форма             - УправляемаяФорма          - Форма, в которой возникло событие.
//  КомандаИмя        - Строка                    - Имя команды, в которой возникло данное событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
Функция ОбработкаКомандыФормы(Форма, КомандаИмя, ПараметрыДействия = Неопределено) Экспорт
	
	Если ЛЕВ(КомандаИмя, 40)="КомандаДополнительнойОбработкиЗаполнения" Тогда
		
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(Форма, КомандаИмя, РезультатВыполнения);
		Если НЕ РезультатВыполнения = Неопределено Тогда
			
			Для каждого Элемент Из РезультатВыполнения Цикл
				ПараметрыДействия.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаКомандыФормы()

// Общий обработчик события возникающего при оповещении формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  Форма                   - УправляемаяФорма - Форма, в которой возникло событие.
//  РезультатОповещения     - Произвольный     - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный     - Значение, которое было указано при создании описания оповещения.
//
Функция ОбработкаРезультатаОповещения(Форма, РезультатОповещения, ДополнительныеПараметры=Неопределено, Объект = Неопределено) Экспорт
	
	// Обработаем в зависимости от переданного параметра события
	УправлениеДиалогомСервер.ОбработкаРезультатаОповещения(Форма, РезультатОповещения, ДополнительныеПараметры, Объект);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаРезультатаОповещения()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ СПИСКА РЕГИСТРА

// Общий обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Форма                - УправляемаяФорма - Форма, в которой возникло событие.
//  Параметры            - Структура - Содержит коллекцию параметров формы.
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
Функция ПриСозданииНаСервере(Форма, Параметры, Отказ=ЛОЖЬ, СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Произведем инициализацию служебных реквизитов формы
	ИнициализироватьСлужебныеРеквизиты(Форма);
	
	// Настроим состав и параметры отображения командной панели формы
	ИнициализироватьКомандыПанелиДействий(Форма);
	
	// Произведем настройку основного динамического списка формы
	ЗащищенныеФункцииСервер.НастроитьОсновнойДинамическийСписокФормы(Форма);
	
	// Производим обновление отображения заголовка формы
	УстановитьЗаголовокСпискаРегистра(Форма);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат (НЕ Отказ);
	
КонецФункции // ПриСозданииНаСервере()

// Общий обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  Форма             - УправляемаяФорма - Форма, в которой возникло событие.
//  ИмяСобытия        - Строка           - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура        - Набор параметров, использующихся при выполнения операции.
//
Функция ОбработкаОповещения(Форма, ИмяСобытия, ПараметрыДействия=Неопределено, Объект = Неопределено) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Обработаем в зависимости от 
	Если ПараметрыДействия.Свойство("ШтрихКод") Тогда
		
		Если ПараметрыДействия.ШтрихКод = "" Тогда
			Возврат Истина;
		КонецЕсли;
		
		// поиск объектов по штрихкоду
		ОбъектыПоШтрихкоду = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(ПараметрыДействия.ШтрихКод,,Истина);
		ПараметрыДействия.Вставить("ОбъектыПоШтрихкоду",ОбъектыПоШтрихкоду);
		ШтрихкодированиеВызовСервера.ОбработкаОбъектовПоШтрихкоду(ПараметрыДействия, Форма, Объект);
		
	ИначеЕсли ПараметрыДействия.Свойство("КодКарты") Тогда
		
		РезультатПоиска = ШтрихкодированиеВызовСервера.ПолучитьКарточкуПоКоду(ПараметрыДействия.КодКарты);
		
		Если РезультатПоиска=Неопределено Тогда
			ВывестиСообщение(НСтр("ru = 'Не найдена карточка по считанному коду: %1'"), Объект,,,, ПараметрыДействия.КодКарты);
			Возврат ЛОЖЬ;
		КонецЕсли;
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(РезультатПоиска.Объект));
		ПараметрыДействия.Вставить("ИмяФормыСписка", ОбъектМетаданных.ПолноеИмя()+".ФормаСписка");
		ПараметрыДействия.Вставить("НайтиОбъект",    РезультатПоиска.Объект)
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаОповещения()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Форма     - УправляемаяФорма - Форма, в которой возникло событие.
//  Настройки - Соответствие     - Значения сохраняемых реквизитов и настроек формы.
//
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Форма, Настройки) Экспорт
	
	Зарезервировано = ИСТИНА;
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Общий обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек.
//
// Параметры:
//  Форма     - УправляемаяФорма - Форма, в которой возникло событие.
//  Настройки - Соответствие     - Значения сохраненных реквизитов и настроек формы.
//
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Форма, Настройки) Экспорт
	
	Зарезервировано = ИСТИНА;
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДИНАМИЧЕСКОГО СПИСКА ФОРМЫ

// Общий обработчик события возникающего при активизации строки списка.
//
// Параметры:
//  Форма   - УправляемаяФорма - Форма, в которой возникло событие.
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
Процедура СписокПриАктивизацииСтроки(Форма, Элемент) Экспорт
	
	Зарезервировано = ИСТИНА;
	
КонецПроцедуры // СписокПриАктивизацииСтроки()

// Общий обработчик события возникающего на сервере при сохранении пользовательских настроек формы списка.
//
// Параметры:
//  Форма     - УправляемаяФорма - Форма, в которой возникло событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Восстанавливаемые настройки. 
//
Процедура СписокПриСохраненииПользовательскихНастроекНаСервере(Форма, Настройки) Экспорт
	
	Зарезервировано = ИСТИНА;
	
КонецПроцедуры // СписокПриСохраненииПользовательскихНастроекНаСервере()

// Общий обработчик события возникающего на сервере при загрузке пользовательских настроек формы списка.
//
// Параметры:
//  Форма     - УправляемаяФорма - Форма, в которой возникло событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Восстанавливаемые настройки. 
//
Процедура СписокПриЗагрузкеПользовательскихНастроекНаСервере(Форма, Настройки) Экспорт
	
	Зарезервировано = ИСТИНА;
	
КонецПроцедуры // СписокПриЗагрузкеПользовательскихНастроекНаСервере()

// Общий обработчик события сохранения настроек формы списка регистров.
//
// Параметры:
//   Форма     - Управляемая форма, форма переданного списка регистров.
//   Настройки - Соответствие, коллекция настроек формы.
//
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(Форма, СтандартнаяОбработка=ИСТИНА) Экспорт
	
	Зарезервировано = ИСТИНА;
	
КонецПроцедуры // СписокПриОбновленииСоставаПользовательскихНастроекНаСервере()

// Общий обработчик события вызывается на сервере после получения данных динамическим списком.
//
// Параметры:
//  ИмяЭлемента - Строка - Содержит имя таблицы формы, из которой вызван обработчик события.
//  Настройки   - НастройкиКомпоновкиДанных - Содержит копию полных настроек динамического списка.
//  Строки      - СтрокиДинамическогоСписка - Данные и оформление всех строк, получаемых в списке.
//
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки) Экспорт
	
	Зарезервировано = ИСТИНА;
	
КонецПроцедуры // СписокПриПолученииДанныхНаСервере()

