#Область СобытияФормы
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода	= НачалоМесяца(НачалоМесяца(ТекущаяДата()) - 1);
	КонецПериода	= КонецМесяца(НачалоПериода);
	
	Объект.ПериодУдержания = НачалоМесяца(ТекущаяДата());
	Объект.ДатаСозданияКорректировки = ТекущаяДата();
	
	НачалоПериодаЗагрузкиПКО	= НачалоМесяца(ТекущаяДата());
	КонецПериодаЗагрузкиПКО		= КонецМесяца(НачалоПериодаЗагрузкиПКО);
	
	//Отладка!
	//НачалоПериодаЗагрузкиПКО	= '20201101';
	//КонецПериодаЗагрузкиПКО		= КонецМесяца(НачалоПериодаЗагрузкиПКО);
	//НачалоПериода = '20201001';
	//КонецПериода = '20201231';
	
	//Объект.ПакетТест = Документы.ИТ_ПакетДокументовРезультатовИнвентаризации.НайтиПоНомеру("000006047", ТекущаяДата());
	
	Элементы.ФизЛицаДляВыборочнойЗагрузкиДанныхВнешнихСистем.Видимость = Ложь;
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	Элементы.ДекорацияПериодУдержания.Заголовок = Формат(Объект.ПериодУдержания, "ДФ='MMMM yyyy'");
	
	ФизЛицоТекущегоПользователя = Пользователи.ТекущийПользователь().Сотрудник;
	
	ТекущийПользовательЛМ = ИТ_СпециальныйМодульСервер.ФизЛицоЯвляетсяЛМ_СМ(ФизЛицоТекущегоПользователя,, Истина);
	ТекущийПользовательСМ = ИТ_СпециальныйМодульСервер.ФизЛицоЯвляетсяЛМ_СМ(ФизЛицоТекущегоПользователя, Истина);
	
	Если ТекущийПользовательЛМ И Не ТекущийПользовательСМ Тогда
		ЛинейныйМенеджер = ФизЛицоТекущегоПользователя;
		
		Элементы.ЛинейныйМенеджер.ТолькоПросмотр	= Истина;
		Элементы.СтаршийМенеджер.ТолькоПросмотр		= Истина;
	ИначеЕсли ТекущийПользовательСМ Тогда
		Элементы.ЛинейныйМенеджер.ТолькоПросмотр	= Ложь;
	КонецЕсли;
	
	Если ТекущийПользовательЛМ Или ТекущийПользовательСМ Тогда
		Элементы.ЗагрузитьДанныеЗУП.Доступность					= Ложь;
		Элементы.ЗагрузитьДанныеИзERP.Доступность				= Ложь;
		Элементы.СоздатьКорректировкиПоДаннымИзERP.Доступность	= Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВыборочноНажатие(Элемент)
	Элементы.ФизЛицаДляВыборочнойЗагрузкиДанныхВнешнихСистем.Видимость = Не Элементы.ФизЛицаДляВыборочнойЗагрузкиДанныхВнешнихСистем.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ПериодУдержанияПриИзменении(Элемент)
	Объект.ПериодУдержания = НачалоМесяца(Объект.ПериодУдержания);
	
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицаДляВыборочнойЗагрузкиДанныхВнешнихСистемФизическоеЛицоПриИзменении(Элемент)
	ЗаполнениеМастерКлючаФизЛица();
КонецПроцедуры

&НаКлиенте
Процедура ЗагруженныеДанныеИзERPПродавецНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗагруженныеДанныеИзERP.ТекущиеДанные;
	
	СписокПродавцов = ПолучитьСписокПродавцовПоИнвентаризации(ТекущиеДанные.ДокументИнвентаризации);
	
	Если СписокПродавцов.Количество() = 0 Тогда
		СтандартнаяОбработка = Истина;	
	Иначе
		СтандартнаяОбработка = Ложь;

		ЭлементСпискаПродавцов = СписокПродавцов.ВыбратьЭлемент("Выберите продавца, участвующего в инвентаризации");
		Если ЭлементСпискаПродавцов <> Неопределено Тогда
			Продавец = ЭлементСпискаПродавцов.Значение;
			Если Продавец <> ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка") Тогда
				ТекущиеДанные.Продавец = Продавец;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаСервере
Процедура СоздатьПакетыКорректировокНаСервере()
	
	ТаблицаПакетовСРасхождениями = ПакетыДокументовСРасхождениями.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаПакетовСРасхождениями", ТаблицаПакетовСРасхождениями);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаПакетовСРасхождениями.ДокументПакет,
	               |	ТаблицаПакетовСРасхождениями.ДокументИнвентаризации,
	               |	ТаблицаПакетовСРасхождениями.СуммаИнвентаризацииНаМоментЗаполненияПакета,
	               |	ТаблицаПакетовСРасхождениями.ТекущаяСуммаИнвентаризации
	               |ПОМЕСТИТЬ ТаблицаПакетовСРасхождениями
	               |ИЗ
	               |	&ТаблицаПакетовСРасхождениями КАК ТаблицаПакетовСРасхождениями
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПакетовСРасхождениями.ДокументПакет КАК ДокументПакет,
	               |	ТаблицаПакетовСРасхождениями.ДокументИнвентаризации,
	               |	ТаблицаПакетовСРасхождениями.СуммаИнвентаризацииНаМоментЗаполненияПакета,
	               |	ТаблицаПакетовСРасхождениями.ТекущаяСуммаИнвентаризации
	               |ИЗ
	               |	ТаблицаПакетовСРасхождениями КАК ТаблицаПакетовСРасхождениями
	               |ИТОГИ ПО
	               |	ДокументПакет";
	
	ВыборкаДокументПакет = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументПакет.Следующий() Цикл
		
		КорректировочныйПакет = Документы.ИТ_ПакетДокументовРезультатовИнвентаризации.СоздатьДокумент();
		КорректировочныйПакет.Заполнить(ВыборкаДокументПакет.ДокументПакет);
		
		Если КорректировочныйПакет.Инвентаризации.Количество() > 0 Тогда
			КорректировочныйПакет.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПакетыКорректировок(Команда)
	СоздатьПакетыКорректировокНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасхожденияРезультатовИнвентаризацийНаСервере()
	
	//Заполним отборы по менеджерам
	ОтборПоЛМ = Справочники.Сотрудники.ПустаяСсылка();
	Если ЗначениеЗаполнено(СтаршийМенеджер) Тогда
		
		ПараметрыПостроения = ИТ_СпециальныйМодульСервер.ПолучитьПараметрыПостроения(,,,,
		Истина,
		Истина,,,
		Истина,
		СтаршийМенеджер,,,,,,,
		Истина);
		
		ДанныеМагазинов = ИТ_СпециальныйМодульСервер.ПолучитьДанныеПоМагазинам(ПараметрыПостроения);
		
		ДанныеМагазинов.Свернуть("ЛинейныйМенеджер");
		ОтборПоЛМ = ДанныеМагазинов.ВыгрузитьКолонку("ЛинейныйМенеджер");
		
	ИначеЕсли ЗначениеЗаполнено(ЛинейныйМенеджер) Тогда
		ОтборПоЛМ = Новый Массив;
		ОтборПоЛМ.Добавить(ЛинейныйМенеджер);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПересчетТоваровТовары.Ссылка КАК ДокументИнвентаризации,
	               |	СУММА(ПересчетТоваровТовары.СуммаРозничная) КАК ТекущаяСуммаИнвентаризации
	               |ПОМЕСТИТЬ РезультатыИнвентаризаций
	               |ИЗ
	               |	Документ.Инвентаризация.Товары КАК ПересчетТоваровТовары
	               |ГДЕ
	               |	ПересчетТоваровТовары.Ссылка.Проведен
	               |	И ВЫБОР
	               |			КОГДА &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПересчетТоваровТовары.Ссылка.Дата >= НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &КонецПериода = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ПересчетТоваровТовары.Ссылка.Дата <= КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПересчетТоваровТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Ссылка КАК ДокументПакет,
	               |	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ДокументИнвентаризация КАК ДокументИнвентаризации,
	               |	МАКСИМУМ(ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.СуммаИнвентаризации) КАК СуммаИнвентаризацииНаМоментЗаполненияПакета,
	               |	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ТипУдержания,
	               |	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Ссылка.ЛинейныйМенеджер,
	               |	ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцамРезультатыИнвентаризаций.Ссылка.ПланируемыйИсточникУдержания
	               |ПОМЕСТИТЬ ПакетыДокументов
	               |ИЗ
	               |	Документ.ИТ_ПакетДокументовРезультатовИнвентаризации.Инвентаризации КАК ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцам.РезультатыИнвентаризаций КАК ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцамРезультатыИнвентаризаций
	               |		ПО ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Ссылка = ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцамРезультатыИнвентаризаций.Ссылка.ДокументОснование
	               |			И ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ДокументИнвентаризация = ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцамРезультатыИнвентаризаций.ДокументИнвентаризации
	               |			И ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Продавец = ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцамРезультатыИнвентаризаций.Продавец
	               |			И ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Магазин = ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцамРезультатыИнвентаризаций.Магазин
	               |			И ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ТипУдержания = ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцамРезультатыИнвентаризаций.ТипУдержания
	               |			И (ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцамРезультатыИнвентаризаций.Ссылка.Проведен)
	               |			И (ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Ссылка.Проведен)
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Ссылка.НачалоПериода >= НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &КонецПериода = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Ссылка.КонецПериода <= КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
	               |		КОНЕЦ
	               |	И ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.СуммаИнвентаризации <> 0
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоЛМ = ИСТИНА
	               |				ТОГДА ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Ссылка.ЛинейныйМенеджер В (&ЛинейныеМенеджеры)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Ссылка,
	               |	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ДокументИнвентаризация,
	               |	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ТипУдержания,
	               |	ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцамРезультатыИнвентаризаций.Ссылка.ПланируемыйИсточникУдержания,
	               |	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Ссылка.ЛинейныйМенеджер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПакетыДокументов.ДокументПакет КАК ДокументПакет,
	               |	ПакетыДокументов.ДокументИнвентаризации,
	               |	ПакетыДокументов.СуммаИнвентаризацииНаМоментЗаполненияПакета,
	               |	РезультатыИнвентаризаций.ТекущаяСуммаИнвентаризации,
	               |	ПакетыДокументов.ТипУдержания,
	               |	ПакетыДокументов.ЛинейныйМенеджер,
	               |	ПакетыДокументов.ПланируемыйИсточникУдержания
	               |ИЗ
	               |	ПакетыДокументов КАК ПакетыДокументов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РезультатыИнвентаризаций КАК РезультатыИнвентаризаций
	               |		ПО ПакетыДокументов.ДокументИнвентаризации = РезультатыИнвентаризаций.ДокументИнвентаризации
	               |			И ПакетыДокументов.СуммаИнвентаризацииНаМоментЗаполненияПакета <> РезультатыИнвентаризаций.ТекущаяСуммаИнвентаризации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПакетыДокументов.ДокументПакет,
	               |	ПакетыДокументов.ДокументИнвентаризации,
	               |	ПакетыДокументов.СуммаИнвентаризацииНаМоментЗаполненияПакета,
	               |	РезультатыИнвентаризаций.ТекущаяСуммаИнвентаризации,
	               |	ПакетыДокументов.ТипУдержания,
	               |	ПакетыДокументов.ЛинейныйМенеджер,
	               |	ПакетыДокументов.ПланируемыйИсточникУдержания";
	
	Если ОтборПоЛМ = Справочники.Сотрудники.ПустаяСсылка() Тогда
		Запрос.УстановитьПараметр("ОтборПоЛМ", Ложь);
	Иначе
		Запрос.УстановитьПараметр("ОтборПоЛМ", ОтборПоЛМ.Количество() > 0);	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЛинейныеМенеджеры",	ОтборПоЛМ);
	Запрос.УстановитьПараметр("НачалоПериода",		НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",		КонецПериода);
	//Запрос.УстановитьПараметр("Ссылка", ПакетТест);//Отладка!!!!!
	
	Результат = Запрос.Выполнить();
	
	ПакетыДокументовСРасхождениями.Загрузить(Результат.Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРасхожденияРезультатовИнвентаризаций(Команда)
	ЗаполнитьРасхожденияРезультатовИнвентаризацийНаСервере();
КонецПроцедуры

#Область КомандыЗагрузкиИзВнешнихСистем

&НаКлиенте
Процедура ЗагрузитьДанныеИзВнешнихСистем(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ПериодУдержания) Тогда
		Сообщить("Необходимо указать период удержания для загрузки данных из внешних систем!");
		Возврат;	
	КонецЕсли;
	
	ЗагрузитьДанныеЗУПНаСервере();
	ЗагрузитьДанныеИзERPНаСервере();
	Сообщить("Загрузка данных завершена");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеЗУПНаСервере()
	СписокФизЛицДляЗагрузки = ФизЛицаДляВыборочнойЗагрузкиДанныхВнешнихСистем.Выгрузить(, "ФизическоеЛицоЕРПМастерКлюч");
	ИТ_СпециальныйМодульСервер.ЗагрузкаДанныхУдержанийИзЗУП(Объект.ПериодУдержания, Объект.ДатаСозданияКорректировки, СписокФизЛицДляЗагрузки);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеЗУП(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ПериодУдержания) Тогда
		Сообщить("Необходимо указать период удержания для загрузки данных из ЗУП!");
		Возврат;	
	КонецЕсли;
	
	ЗагрузитьДанныеЗУПНаСервере();
	Сообщить("Загрузка данных из ЗУП завершена.");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеИзERPНаСервере()
	
	СписокФизЛицДляЗагрузки		= ФизЛицаДляВыборочнойЗагрузкиДанныхВнешнихСистем.Выгрузить(, "ФизическоеЛицоЕРПМастерКлюч");
	ТаблицаДанныхПогашенийИзERP = ИТ_СпециальныйМодульСервер.ЗагрузкаДанныхУдержанийИзERP(НачалоПериодаЗагрузкиПКО, КонецПериодаЗагрузкиПКО, Объект.ДатаСозданияКорректировки, СписокФизЛицДляЗагрузки);
	
	Если ТаблицаДанныхПогашенийИзERP <> Неопределено Тогда
		ЗагруженныеДанныеИзERP.Загрузить(ТаблицаДанныхПогашенийИзERP);
		
		Для Каждого СтрокаДанныхИзERP Из ЗагруженныеДанныеИзERP Цикл
			ПринятоОт = СокрЛП(СтрокаДанныхИзERP.ПринятоОт);
			Если Не ЗначениеЗаполнено(СтрокаДанныхИзERP.Продавец) И Не ПустаяСтрока(ПринятоОт) Тогда
				СтрокаДанныхИзERP.Продавец = Справочники.Сотрудники.НайтиПоНаименованию(ПринятоОт);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДанныхИзERP.ДокументИнвентаризации) Тогда
				СтрокаДанныхИзERP.РезультатИнвентаризации = ИТ_СпециальныйМодульСервер.ПолучитьРезультатИнвентаризации(СтрокаДанныхИзERP.ДокументИнвентаризации);
			КонецЕсли;
			СтрокаДанныхИзERP.СоздаватьКорректировку = ВсеДанныеСтрокиИзERPЗаполнены(СтрокаДанныхИзERP);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзERP(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ПериодУдержания) Тогда
		Сообщить("Необходимо указать период удержания для загрузки данных из ERP!");
		Возврат;	
	КонецЕсли;
	
	Если ЗагруженныеДанныеИзERP.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Таблица загруженных данных из ERP не пустая! Она будет очищена! Продолжить?", Режим,,, "Внимание!");
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗагрузитьДанныеИзERPНаСервере();
	Сообщить("Считывание данных из ERP завершено. Отметье флагами нужные документы для создания корректировок");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКорректировкиПоДаннымИзERPНаСервере()
	
	БылаПопыткаСоздатьДокумент = Ложь;
	Для Каждого СтрокаДанныхИзERP Из ЗагруженныеДанныеИзERP Цикл
		Если СтрокаДанныхИзERP.СоздаватьКорректировку Тогда
			ИТ_СпециальныйМодульСервер.СозданиеДокументаКорректировкиПоДаннымИзERP(СтрокаДанныхИзERP);	
			БылаПопыткаСоздатьДокумент = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если БылаПопыткаСоздатьДокумент Тогда
		Сообщить("Создание/изменение документов корректировок завершено.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКорректировкиПоДаннымИзERP(Команда)
	
	ЕстьНайденныеКорректировки = Ложь;
	
	Для Каждого СтрокаДанныхИзERP Из ЗагруженныеДанныеИзERP Цикл
		Если СтрокаДанныхИзERP.СоздаватьКорректировку
			 И ЗначениеЗаполнено(СтрокаДанныхИзERP.Корректировка) Тогда
			ЕстьНайденныеКорректировки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьНайденныеКорректировки Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("В найденных документах корректировок информация будет замещена данными из ERP! Продолжить?", Режим,,, "Внимание!");
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СоздатьКорректировкиПоДаннымИзERPНаСервере();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнениеМастерКлючаФизЛица()
	
	ТекущиеДанные = Элементы.ФизЛицаДляВыборочнойЗагрузкиДанныхВнешнихСистем.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ФизЛицо) Тогда
		ТекущиеДанные.ФизическоеЛицоЕРПМастерКлюч = СокрЛП(ТекущиеДанные.ФизЛицо.ЕРПМастерКлюч);
	Иначе
		ТекущиеДанные.ФизическоеЛицоЕРПМастерКлюч = "";
	КонецЕсли;
	
КонецПроцедуры

Функция ВсеДанныеСтрокиИзERPЗаполнены(ТекущаяСтрока)
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Продавец)
		И ЗначениеЗаполнено(ТекущаяСтрока.ДокументИнвентаризации)
		И ЗначениеЗаполнено(ТекущаяСтрока.Магазин)
		И ЗначениеЗаполнено(ТекущаяСтрока.ПериодУдержания)
		И ТекущаяСтрока.СуммаПогашения <> 0
		И Не ЗначениеЗаполнено(ТекущаяСтрока.Корректировка)
		Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

//Функция получает список продавцов, которые указаны во всех проведенных пакетах документов результатов инвентаризации
// Параметры:
// ДокИнвентаризации - ДокументСсылка.ПересчетТоваров - Документ инвентаризации по которому надо определить продавцов.
//					 - Неопределено - Не передан документ инвентаризации. Будет возвращен пустой список значений.
// Возвращаемое значение:
// СписокЗначений
&НаСервереБезКонтекста
Функция ПолучитьСписокПродавцовПоИнвентаризации(ДокИнвентаризации = Неопределено)
	
	СписокПродавцов = Новый СписокЗначений;
	
	Если ДокИнвентаризации = Неопределено Или ДокИнвентаризации = Документы.ПересчетТоваров.ПустаяСсылка() Тогда
		Возврат СписокПродавцов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Продавец
		|ИЗ
		|	Документ.ИТ_ПакетДокументовРезультатовИнвентаризации.Инвентаризации КАК ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации
		|ГДЕ
		|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Ссылка.Проведен
		|	И ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.ДокументИнвентаризация = &ДокументИнвентаризация
		|	И ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Продавец <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИТ_ПакетДокументовРезультатовИнвентаризацииИнвентаризации.Продавец
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДокументИнвентаризация", ДокИнвентаризации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокПродавцов.Добавить(Выборка.Продавец);	
	КонецЦикла;
	
	Возврат СписокПродавцов;
	
КонецФункции

#КонецОбласти