// Модуль формы списка документа "ВСД ВетИС"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Функция ПолучитьGuidПредприятия(Предприятие)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Предприятие, "Код");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНастройкуЗапрещатьГаситьВСДБезВСЭ(ХозяйствующийСубъект)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ХозяйствующийСубъект, "ЗапрещатьГаситьВСДБезВСЭ");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоПодразделений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ХозяйствующиеСубъектыВЕТИС.Ссылка КАК ХозяйствующийСубъект,
	|	ПредприятияХозСубъекта.Предприятие
	|ИЗ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС КАК ХозяйствующиеСубъектыВЕТИС
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС.Предприятия КАК ПредприятияХозСубъекта
	|ПО
	|	ХозяйствующиеСубъектыВЕТИС.Ссылка = ПредприятияХозСубъекта.Ссылка
	|ГДЕ
	|	ХозяйствующиеСубъектыВЕТИС.Собственный И 
	|	ХозяйствующиеСубъектыВЕТИС.ПометкаУдаления = ЛОЖЬ
	|ИТОГИ ПО
	|	ХозяйствующийСубъект
	|";
	
	СтрокиХозСубъектов = ДеревоПредприятий.ПолучитьЭлементы();
	ВыборкаХозСубъект = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаХозСубъект.Следующий() Цикл
		СтрокаХозСубъект = СтрокиХозСубъектов.Добавить();
		СтрокаХозСубъект.Предприятие = ВыборкаХозСубъект.ХозяйствующийСубъект;
		СтрокаХозСубъект.КартинкаПредприятия = 0;
		СтрокиПредприятий = СтрокаХозСубъект.ПолучитьЭлементы();
		Выборка = ВыборкаХозСубъект.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаПредприятия = СтрокиПредприятий.Добавить();
			СтрокаПредприятия.Предприятие = Выборка.Предприятие;
			СтрокаПредприятия.КартинкаПредприятия = 1;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Элементы.Список.ТекущиеДанные, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеСпискомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеСпискомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДИНАМИЧЕСКОГО СПИСКА ФОРМЫ

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии Enter) в ячейке таблицы "Список".
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока      - Ссылка       - Значение выбранной строки.
//  Поле                 - ПолеФормы    - Активное поле.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаКлиент.СписокВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры // СписокВыбор()

// Обработчик события возникающего на клиенте при активизации строки списка с задержкой в контексте сервера.
//
&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере()
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаСервер.СписокПриАктивизацииСтроки(ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры // СписокПриАктивизацииСтрокиНаСервере()

// Обработчик события возникающего на клиенте при активизации строки списка выполняемый с задержкой.
//
&НаКлиенте
Процедура Подключаемый_СписокПриАктивизацииСтроки()
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элементы.Список, ИСТИНА) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	СписокПриАктивизацииСтрокиНаСервере();
	
КонецПроцедуры // Подключаемый_СписокПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаКлиент.СписокПриАктивизацииЯчейки(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриАктивизацииЯчейки()

// Обработчик события возникающего на клиенте перед добавления строки в таблицу "Список".
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от действия.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаКлиент.СписокПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры // СписокПередНачаломДобавления

// Обработчик события возникающего на клиенте перед началом изменения списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от действия.
//
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаКлиент.СписокПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // СписокПередНачаломИзменения()

// Обработчик события возникающего на клиенте после удаления строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаКлиент.СписокПослеУдаления(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПослеУдаления()

// Обработчик события возникающего при сохранении пользовательских настроек в контексте сервера.
//
// Параметры:
//  Элемент   - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Сохраняемые настройки. 
//
&НаСервере
Процедура СписокПриСохраненииПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаСервер.СписокПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // СписокПриСохраненииПользовательскихНастроекНаСервере()

// Обработчик события возникающего при восстановлении пользовательских настроек в контексте сервера.
//
// Параметры:
//  Элемент   - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Восстанавливаемые настройки.
//
&НаСервере
Процедура СписокПриЗагрузкеПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаСервер.СписокПриЗагрузкеПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // СписокПриЗагрузкеПользовательскихНастроекНаСервере()

// Обработчик события возникающего на сервере при обновлении пользовательских настроек списка.
//
// Параметры:
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаСервер.СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры // СписокПриОбновленииСоставаПользовательскихНастроекНаСервере()

// Обработчик события вызывается на сервере после получения данных динамическим списком.
//
// Параметры:
//  ИмяЭлемента - Строка - Содержит имя таблицы формы, из которой вызван обработчик события.
//  Настройки   - НастройкиКомпоновкиДанных - Содержит копию полных настроек динамического списка.
//  Строки      - СтрокиДинамическогоСписка - Данные и оформление всех строк, получаемых в списке.
//
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаСервер.СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры // СписокПриПолученииДанныхНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЯ РАСШИРЕННОЙ ИНФОРМАЦИИ

// Обработчик события возникающего на клиенте при нажатии на поле "Расширенная информация".
//
// Параметры:
//  Элемент              - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ДанныеСобытия        - ФиксированнаяСтруктура - Параметр заполняется фиксированной структурой со свойствами:
//                         Anchor, Element, Button, Event, Document, Href.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура РасширеннаяИнформацияПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	// Вызываем специальный обработчик события
	РасширеннаяИнформацияКлиент.ПриНажатии(ЭтотОбъект, Элемент, ДанныеСобытия, СтандартнаяОбработка);
	
КонецПроцедуры // РасширеннаяИнформацияПриНажатии()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДеревоПодразделений();
	
	СтатусВСД = Перечисления.СтатусыВСДВЕТИС.CONFIRMED;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ЭтаФорма.Список,
		"Статус",
		СтатусВСД,
		ВидСравненияКомпоновкиДанных.Равно,,
		ЗначениеЗаполнено(СтатусВСД));
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеСпискомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на клиенте при вызове метода ОповеститьОбАктивизации из формы-владельца.
//
// Параметры:
//  АктивныйОбъект - Произвольный     - Активный объект.
//  Источник       - УправляемаяФорма - Форма, источник сообщения.
//
&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаКлиент.ОбработкаАктивизации(ЭтотОбъект, АктивныйОбъект, Источник) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаАктивизации()

// Обработчик события возникающего на клиенте при записи объекта в одной из подчиненных форм.
//
// Параметры:
//  НовыйОбъект          - Произвольный     - Добавленный в подчиненной форме объект.
//  Источник             - УправляемаяФорма - Форма, источник сообщения.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаКлиент.ОбработкаЗаписиНового(ЭтотОбъект, НовыйОбъект, Источник, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаписиНового()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ЭтаФорма.Список,
		"Статус",
		СтатусВСД,
		ВидСравненияКомпоновкиДанных.Равно,,
		ЗначениеЗаполнено(СтатусВСД));
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОтбор(ИмяОтбора)
	
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяОтбора);
	Результат = Неопределено;
	Для Каждого ТекущийОтбор Из Список.Отбор.Элементы Цикл
		Если ТекущийОтбор.ЛевоеЗначение = ЛевоеЗначение Тогда
			Результат = ТекущийОтбор;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Результат = Неопределено Тогда
		Результат = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Результат.ЛевоеЗначение = ЛевоеЗначение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработчикОжиданияДеревоПредприятийПриАктивизацииСтроки()
	
	ТекущиеДанные = Элементы.ДеревоПредприятий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПредприятиеОтправитель = ПолучитьОтбор("ПредприятиеОтправитель");
	ОтборПредприятиеПолучатель  = ПолучитьОтбор("ПредприятиеПолучатель");
	ОтборПолучатель             = ПолучитьОтбор("Получатель");
	ОтборОтправитель            = ПолучитьОтбор("Отправитель");
	
	ОтборПолучатель.Использование  = Ложь;
	ОтборОтправитель.Использование = Ложь;
	ОтборПредприятиеОтправитель.Использование = Ложь;
	ОтборПредприятиеПолучатель.Использование  = Ложь;
	
	Если ТипЗнч(ТекущиеДанные.Предприятие) = Тип("СправочникСсылка.ХозяйствующиеСубъектыВЕТИС") Тогда
		
		Если ТипВСД = 0 Тогда
			ОтборПолучатель.Использование  = Истина;
			ОтборПолучатель.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ОтборПолучатель.ПравоеЗначение = ТекущиеДанные.Предприятие;
		ИначеЕсли ТипВСД = 1 Тогда
			ОтборОтправитель.Использование  = Истина;
			ОтборОтправитель.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ОтборОтправитель.ПравоеЗначение = ТекущиеДанные.Предприятие;
		КонецЕсли;
		
		Элементы.ФормаПерезапросить.Доступность = Ложь;
		Элементы.ФормаПогаситьВСД.Доступность   = Ложь;
		Элементы.ФормаВернутьВСД.Доступность    = Ложь;
		Элементы.ФормаАннулировать.Доступность  = Ложь;
		Элементы.ФормаЗапроситьВСД.Доступность  = Ложь;
		Элементы.ФормаЗапроситьИзмененныеВСД.Доступность = Ложь;
		
	Иначе
		
		Если ТипВСД = 0 Тогда
			ОтборПредприятиеПолучатель.Использование  = Истина;
			ОтборПредприятиеПолучатель.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ОтборПредприятиеПолучатель.ПравоеЗначение = ТекущиеДанные.Предприятие;
		ИначеЕсли ТипВСД = 1 Тогда
			ОтборПредприятиеОтправитель.Использование  = Истина;
			ОтборПредприятиеОтправитель.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ОтборПредприятиеОтправитель.ПравоеЗначение = ТекущиеДанные.Предприятие;
		КонецЕсли;
		
		Элементы.ФормаПерезапросить.Доступность = Истина;
		Элементы.ФормаПогаситьВСД.Доступность   = (ТипВСД = 0);
		Элементы.ФормаВернутьВСД.Доступность    = Истина;
		Элементы.ФормаЗапроситьВСД.Доступность  = Истина;
		Элементы.ФормаЗапроситьИзмененныеВСД.Доступность = Истина;
		Элементы.ФормаАннулировать.Доступность  = (ТипВСД = 1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПредприятийПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияДеревоПредприятийПриАктивизацииСтроки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Перезапросить(Команда)
	
	ТекущиеДанные = Элементы.ДеревоПредприятий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Предприятие) = Тип("СправочникСсылка.ХозяйствующиеСубъектыВЕТИС") Тогда
		ХозяйствующийСубъект = ТекущиеДанные.Предприятие;
	Иначе
		ХозяйствующийСубъект = ТекущиеДанные.ПолучитьРодителя().Предприятие;
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый СписокЗначений;
	
	Для Каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		
		ТекущаяВСД = Элементы.Список.ДанныеСтроки(ТекущаяСтрока);

		Если ТипВСД = 0 И ЗначениеЗаполнено(ТекущаяВСД.ПредприятиеПолучатель) Тогда
			Предприятие = ТекущаяВСД.ПредприятиеПолучатель;
		Иначе
			Предприятие = ТекущаяВСД.ПредприятиеОтправитель;
		КонецЕсли;
		
		guidПредприятия = ПолучитьGuidПредприятия(Предприятие);
		
		СтрокаВыгрузки = Новый Структура;
		СтрокаВыгрузки.Вставить("uuid",            ТекущаяВСД.Идентификатор);
		СтрокаВыгрузки.Вставить("guidПредприятия", guidПредприятия);
		СтрокаВыгрузки.Вставить("Предприятие",     Предприятие);
		
		ДанныеДляВыгрузки.Добавить(СтрокаВыгрузки);
		
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДанныеДляВыгрузки",    ДанныеДляВыгрузки);
	ПараметрыОткрытия.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
	ПараметрыОткрытия.Вставить("ВидОперации",          ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ЗапросВСД"));
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ФормированиеЗапроса", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИПогасить(Команда)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Погасить(Команда)
	
	ТекущиеДанные = Элементы.ДеревоПредприятий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Предприятие) = Тип("СправочникСсылка.ХозяйствующиеСубъектыВЕТИС") Тогда
		ХозяйствующийСубъект = ТекущиеДанные.Предприятие;
	Иначе
		ХозяйствующийСубъект = ТекущиеДанные.ПолучитьРодителя().Предприятие;
	КонецЕсли;
	
	ЗапрещатьГаситьВСДБезВСЭ = ПолучитьНастройкуЗапрещатьГаситьВСДБезВСЭ(ХозяйствующийСубъект);
	
	ДоступныеРезультатыВСЭ = Новый Массив;
	ДоступныеРезультатыВСЭ.Добавить(ПредопределенноеЗначение("Перечисление.РезультатыИсследованияВЕТИС.VSEFULL"));
	ДоступныеРезультатыВСЭ.Добавить(ПредопределенноеЗначение("Перечисление.РезультатыИсследованияВЕТИС.VSERAW"));
	
	ДанныеДляВыгрузки = Новый СписокЗначений;
	
	ПороговаяДата = ТекущаяДата();
	Для Каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		
		ТекущаяВСД = Элементы.Список.ДанныеСтроки(ТекущаяСтрока);
		
		Если ЗапрещатьГаситьВСДБезВСЭ И ДоступныеРезультатыВСЭ.Найти(ТекущаяВСД.ЭкспертизаРезультат) = Неопределено Тогда
			ВывестиСообщение(НСтр("ru = 'ВСД <%1> не может быть погашет, т.к. его продукция не подвергнута ВСЭ в полном объеме!'"),,,,, Строка(ТекущаяВСД.Ссылка));
			Продолжить;
		КонецЕсли;
		
		//СрокГодности = ?(ЗначениеЗаполнено(ТекущаяСтрока.СрокГодностиПо), ТекущаяСтрока.СрокГодностиПо, ТекущаяСтрока.СрокГодности);
		//Если СрокГодности<ПороговаяДата Тогда
		//	ВывестиСообщение(НСтр("ru = 'ВСД <%1> запрещено гасить. Срок годности продукции до %2!'"),,,,, Строка(ТекущаяСтрока.Ссылка), Формат(СрокГодности, "ДФ=dd.MM.yyyy"));
		//	Продолжить;
		//КонецЕсли;
		
		Предприятие = ТекущаяВСД.ПредприятиеПолучатель;
		
		guidПредприятия = ПолучитьGuidПредприятия(Предприятие);
		
		СтрокаВыгрузки = Новый Структура;
		СтрокаВыгрузки.Вставить("uuid",            ТекущаяВСД.Идентификатор);
		СтрокаВыгрузки.Вставить("guidПредприятия", guidПредприятия);
		СтрокаВыгрузки.Вставить("Предприятие",     Предприятие);
		СтрокаВыгрузки.Вставить("Объект",          ТекущаяВСД.Ссылка);
		
		ДанныеДляВыгрузки.Добавить(СтрокаВыгрузки);
		
	КонецЦикла;
	
	Если ДанныеДляВыгрузки.Количество() = 0 Тогда
		ВывестиСообщение(НСтр("ru = 'Нет данных для гашения!'"),,,,, Строка(ТекущаяВСД.Ссылка));
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДанныеДляВыгрузки",    ДанныеДляВыгрузки);
	ПараметрыОткрытия.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
	ПараметрыОткрытия.Вставить("ВидОперации",          ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ЗапросНаОформлениеВходящейПартии"));
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ФормированиеЗапроса", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьВСД(Команда)
	
	ТекущиеДанные = Элементы.ДеревоПредприятий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ВывестиСообщение(НСтр("ru = 'Выберите предпритие хоз. субъекта!'"));
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Предприятие) = Тип("СправочникСсылка.ХозяйствующиеСубъектыВЕТИС") Тогда
		ВывестиСообщение(НСтр("ru = 'Выберите предпритие хоз. субъекта!'"));
		Возврат;
	КонецЕсли;
	
	ХозяйствующийСубъект = ТекущиеДанные.ПолучитьРодителя().Предприятие;
	Предприятие          = ТекущиеДанные.Предприятие;
	
	ПараметрыОткрытия = Новый Структура;
	
	Если ТипВСД = 0 Тогда
		ПараметрыОткрытия.Вставить("ТипВСД", "INCOMING");
	ИначеЕсли ТипВСД = 1 Тогда
		ПараметрыОткрытия.Вставить("ТипВСД", "OUTGOING");
	Иначе
		ПараметрыОткрытия.Вставить("ТипВСД", "Все");
	КонецЕсли;
	
	Если СтатусВСД = ПредопределенноеЗначение("Перечисление.СтатусыВСДВЕТИС.UTILIZED") Тогда
		ПараметрыОткрытия.Вставить("СтатусВСД",     СтатусВСД);
	ИначеЕсли СтатусВСД = ПредопределенноеЗначение("Перечисление.СтатусыВСДВЕТИС.WITHDRAWN") Тогда
		ПараметрыОткрытия.Вставить("СтатусВСД",     СтатусВСД);
	ИначеЕсли СтатусВСД = ПредопределенноеЗначение("Перечисление.СтатусыВСДВЕТИС.CREATED") Тогда
		ПараметрыОткрытия.Вставить("СтатусВСД",     СтатусВСД);
	Иначе
		ПараметрыОткрытия.Вставить("СтатусВСД",     ПредопределенноеЗначение("Перечисление.СтатусыВСДВЕТИС.CONFIRMED"));
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("ДатаНачала",    Дата(1, 1, 1));
	ПараметрыОткрытия.Вставить("ДатаОкончания", ТекущаяДата());
	ПараметрыОткрытия.Вставить("ПолучатьИзменения", Ложь);
	ПараметрыОткрытия.Вставить("ХозяйствующийСубъект",        ХозяйствующийСубъект);
	ПараметрыОткрытия.Вставить("Предприятие",       Предприятие);
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ФормаПолученияВСД", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Аннулировать(Команда)
	
	ТекущиеДанные = Элементы.ДеревоПредприятий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Предприятие) = Тип("СправочникСсылка.ХозяйствующиеСубъектыВЕТИС") Тогда
		ХозяйствующийСубъект = ТекущиеДанные.Предприятие;
	Иначе
		ХозяйствующийСубъект = ТекущиеДанные.ПолучитьРодителя().Предприятие;
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый СписокЗначений;
	
	ПороговаяДата = ТекущаяДата();
	Для Каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		
		Предприятие = ТекущаяСтрока.ПредприятиеПолучатель;
		
		guidПредприятия = ПолучитьGuidПредприятия(Предприятие);
		
		СтрокаВыгрузки = Новый Структура;
		СтрокаВыгрузки.Вставить("uuid",            ТекущаяСтрока.Идентификатор);
		СтрокаВыгрузки.Вставить("guidПредприятия", guidПредприятия);
		СтрокаВыгрузки.Вставить("Предприятие",     Предприятие);
		СтрокаВыгрузки.Вставить("Объект",          ТекущаяСтрока.Ссылка);
		
		ДанныеДляВыгрузки.Добавить(СтрокаВыгрузки);
		
	КонецЦикла;
	
	Если ДанныеДляВыгрузки.Количество() = 0 Тогда
		ВывестиСообщение(НСтр("ru = 'Нет данных для аннулирования!'"),,,,, Строка(ТекущаяСтрока.Ссылка));
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДанныеДляВыгрузки",    ДанныеДляВыгрузки);
	ПараметрыОткрытия.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
	ПараметрыОткрытия.Вставить("ВидОперации",          ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ЗапросНаАннулированиеВСД"));
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ФормированиеЗапроса", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВБраузере(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Идентификатор) Тогда
		ВывестиСообщение(НСтр("ru = 'Идентификатор ВСД %1 не заполнен!'"),,,,, СокрЛП(ТекущиеДанные.Ссылка));
		Возврат;
	КонецЕсли;
	
	Если ИнтеграцияВЕТИСВызовСервера.РежимТестовогоКонтура() Тогда
		АдресВСД = "https://t2-mercury.vetrf.ru/pub/operatorui?_language=ru&_action=showVetDocumentFormByUuid&uuid="+СокрЛП(ТекущиеДанные.Идентификатор);
		//http://t2-mercury.vetrf.ru/hs/operatorui?_language=ru&_action=showVetDocumentFormByUuid&uuid=6ea3d13c-e4bc-46a2-a5e7-44483abe896d
		//https://t2-mercury.vetrf.ru/hs/operatorui?_action=showVetDocumentForm&_language=ru&vetDocument=7250066
		////https://t2-mercury.vetrf.ru/hs/operatorui?_action=showVetDocumentForm&_language=ru&vetDocument=7803381&status=6&request=false&input=Input&pageList=1&anchor=tr7803381
		////https://t2-mercury.vetrf.ru/hs/operatorui?_action=showVetDocumentForm&_language=ru&vetDocument=7250066&status=1&request=false&input=Input&pageList=1&anchor=tr7250066
		//https://t2-mercury.vetrf.ru/hs/operatorui?_action=showVetDocumentForm&_language=ru&vetDocument=7250066&status=1&request=false&input=Input&pageList=1&anchor=tr7250066
	Иначе
		АдресВСД = "https://mercury.vetrf.ru/pub/operatorui?_language=ru&_action=showVetDocumentFormByUuid&uuid="+СокрЛП(ТекущиеДанные.Идентификатор);
	КонецЕсли;
	
	Попытка
		ЗапуститьПриложение(АдресВСД);
	Исключение
		ТекстОписания = ОписаниеОшибки();
		Сообщить(ТекстОписания);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипВСДПриИзменении(Элемент)
	
	ОбработчикОжиданияДеревоПредприятийПриАктивизацииСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПредприятийПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьВСД(Команда)
	
	ТекущиеДанные = Элементы.ДеревоПредприятий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Предприятие) = Тип("СправочникСсылка.ХозяйствующиеСубъектыВЕТИС") Тогда
		ХозяйствующийСубъект = ТекущиеДанные.Предприятие;
	Иначе
		ХозяйствующийСубъект = ТекущиеДанные.ПолучитьРодителя().Предприятие;
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый СписокЗначений;
	
	ПороговаяДата = ТекущаяДата();
	Для Каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		
		ТекущаяВСД = Элементы.Список.ДанныеСтроки(ТекущаяСтрока);
		
		Предприятие = ТекущаяВСД.ПредприятиеПолучатель;
		
		guidПредприятия = ПолучитьGuidПредприятия(Предприятие);
		
		СтрокаВыгрузки = Новый Структура;
		СтрокаВыгрузки.Вставить("uuid",            ТекущаяВСД.Идентификатор);
		СтрокаВыгрузки.Вставить("guidПредприятия", guidПредприятия);
		СтрокаВыгрузки.Вставить("Предприятие",     Предприятие);
		СтрокаВыгрузки.Вставить("Объект",          ТекущаяВСД.Ссылка);
		СтрокаВыгрузки.Вставить("ЭтоВозврат",      Истина);
		
		ДанныеДляВыгрузки.Добавить(СтрокаВыгрузки);
		
	КонецЦикла;
	
	Если ДанныеДляВыгрузки.Количество() = 0 Тогда
		ВывестиСообщение(НСтр("ru = 'Нет данных для возвратов!'"),,,,, Строка(ТекущаяСтрока.Ссылка));
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДанныеДляВыгрузки",    ДанныеДляВыгрузки);
	ПараметрыОткрытия.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
	ПараметрыОткрытия.Вставить("ВидОперации",          ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ЗапросНаОформлениеВходящейПартии"));
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ФормированиеЗапроса", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПечатьВСДНаСервере(МассивДляПечати)
	Документы.ВСДВЕТИС.ПечатьВСД(МассивДляПечати);
КонецПроцедуры

&НаСервереБезКонтекста
Функция РежимТестовогоКонтураВЕТИС()
	
	РежимТестовогоКонтураВЕТИС = Константы.РежимТестовогоКонтураВЕТИС.Получить();
	
	Возврат РежимТестовогоКонтураВЕТИС;
	
КонецФункции

&НаКлиенте
Процедура ПечатьВСД(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РежимТестовогоКонтураВЕТИС = РежимТестовогоКонтураВЕТИС();
	
	Для Каждого ТекущаяСтрока Из ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ТекущаяСтрока);
		
		Если РежимТестовогоКонтураВЕТИС Тогда
			Путь = "https://t2-mercury.vetrf.ru/pub/operatorui?_action=printVetDocumentByUuid&uuid=" + СокрЛП(ДанныеСтроки.Идентификатор);
		Иначе
			Путь = "https://mercury.vetrf.ru/pub/operatorui?_action=printVetDocumentByUuid&uuid=" + СокрЛП(ДанныеСтроки.Идентификатор);
		КонецЕсли;
		
		ПутьФайла = КаталогВременныхФайлов() + ДанныеСтроки.Идентификатор + ".pdf";
		
		Попытка
			КопироватьФайл(Путь, ПутьФайла);
		Исключение
			ВывестиСообщение(НСтр("ru = 'Для данного ВСД печать не предусмотрена!'"));
			Возврат;
		КонецПопытки;
		
		//Если СразуНаПринтер Тогда
		//	Shell = Новый COMОбъект("Shell.Application");
		//	Shell.ShellExecute(ПутьФайла, "", "", "print", 0);
		//Иначе  
		ЗапуститьПриложение(ПутьФайла);
		//КонецЕсли;
		
	КонецЦикла;
	
	//ПечатьВСДНаСервере(МассивДляПечати);
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьИзмененныеВСД(Команда)
	
	ТекущиеДанные = Элементы.ДеревоПредприятий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ВывестиСообщение(НСтр("ru = 'Выберите предпритие хоз. субъекта!'"));
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Предприятие) = Тип("СправочникСсылка.ХозяйствующиеСубъектыВЕТИС") Тогда
		ВывестиСообщение(НСтр("ru = 'Выберите предпритие хоз. субъекта!'"));
		Возврат;
	КонецЕсли;
	
	ХозяйствующийСубъект = ТекущиеДанные.ПолучитьРодителя().Предприятие;
	Предприятие          = ТекущиеДанные.Предприятие;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ТипВСД",               "Все");
	ПараметрыОткрытия.Вставить("ДатаНачала",           НачалоДня(ТекущаяДата()));
	ПараметрыОткрытия.Вставить("ДатаОкончания",        ТекущаяДата());
	ПараметрыОткрытия.Вставить("ПолучатьИзменения",    Истина);
	ПараметрыОткрытия.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
	ПараметрыОткрытия.Вставить("Предприятие",          Предприятие);
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ФормаПолученияВСД", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

