
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьПризнакСпособаРасчета(ТипСпособаРасчетаККТ, Ссылка) Экспорт
	
	ЕстьТовары = ЕстьРеквизит(Ссылка,, "Товары");
	ЕстьОплаты = ЕстьРеквизит(Ссылка,, "Оплаты");
	
	Если ЕстьОплаты И ЕстьТовары Тогда
		ЭтоАванс = Ссылка.Товары.Итог("СуммаВсего") = 0 ИЛИ Ссылка.Товары.НайтиСтроки(Новый Структура("Номенклатура", Справочники.Номенклатура.Предоплата)).Количество() <> 0;
		
		СуммаТовары = Ссылка.Товары.Итог("СуммаВсего");
		СуммаОплат = Ссылка.Оплаты.Итог("Сумма");
		
		СуммаОплатБезРассрочки = 0;
		Для Каждого СтрокаОплат Из Ссылка.Оплаты Цикл
			Если СтрокаОплат.ТипОплаты.ТипОплатыККТ <> Перечисления.ТипыОплатыККТ.Постоплата Тогда
				СуммаОплатБезРассрочки = СуммаОплатБезРассрочки + СтрокаОплат.Сумма;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЭтоАванс = Истина;
		СуммаТовары = 0;
		СуммаОплат = ?(Ссылка.СуммаДокумента<0, -Ссылка.СуммаДокумента, Ссылка.СуммаДокумента);
		СуммаОплатБезРассрочки = СуммаОплат;
	КонецЕсли;
	
	Если ТипСпособаРасчетаККТ = Передача Тогда
		Если СуммаОплатБезРассрочки = 0 Тогда
			Возврат Перечисления.ПризнакиСпособаРасчета.ПередачаБезОплаты;
		ИначеЕсли СуммаОплатБезРассрочки < СуммаТовары Тогда
			Возврат Перечисления.ПризнакиСпособаРасчета.ПередачаСЧастичнойОплатой;
		ИначеЕсли СуммаОплатБезРассрочки >= СуммаТовары Тогда
			Возврат Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		КонецЕсли;
	ИначеЕсли ТипСпособаРасчетаККТ = Предоплата Тогда
		Если ЭтоАванс Тогда
			Возврат Перечисления.ПризнакиСпособаРасчета.Аванс;
		ИначеЕсли СуммаОплат < СуммаТовары Тогда
			Возврат Перечисления.ПризнакиСпособаРасчета.ПредоплатаЧастичная;
		ИначеЕсли СуммаОплат >= СуммаТовары Тогда
			Возврат Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная;
		КонецЕсли;
	ИначеЕсли ТипСпособаРасчетаККТ = Постоплата Тогда
		Возврат Перечисления.ПризнакиСпособаРасчета.ОплатаКредита;
	Иначе
		Возврат Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	КонецЕсли;
КонецФункции

// Процедура заполнения реквизита "Способ расчета" у документов оплаты.
//
Процедура ЗаполнитьТипСпособаРасчетаККТДокументов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходныйКассовыйОрдер.Ссылка КАК Ссылка,
	               |	ПриходныйКассовыйОрдер.СуммаДокумента КАК СуммаОплаты,
	               |	ПриходныйКассовыйОрдер.ДокументОснование КАК ДокументОснование,
	               |	ПриходныйКассовыйОрдер.КурсДокумента КАК КурсДокумента,
	               |	ПриходныйКассовыйОрдер.ВалютаДокумента КАК ВалютаДокумента
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	               |ГДЕ
	               |	ПриходныйКассовыйОрдер.ТипСпособаРасчетаККТ = ЗНАЧЕНИЕ(Перечисление.ТипыСпособаРасчетаККТ.ПустаяСсылка)
	               |	И ПриходныйКассовыйОрдер.ДляПробитияНаФР
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РасходныйКассовыйОрдер.Ссылка,
	               |	РасходныйКассовыйОрдер.СуммаДокумента,
	               |	РасходныйКассовыйОрдер.ДокументОснование,
	               |	РасходныйКассовыйОрдер.КурсДокумента,
	               |	РасходныйКассовыйОрдер.ВалютаДокумента
	               |ИЗ
	               |	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	               |ГДЕ
	               |	РасходныйКассовыйОрдер.ТипСпособаРасчетаККТ = ЗНАЧЕНИЕ(Перечисление.ТипыСпособаРасчетаККТ.ПустаяСсылка)
	               |	И РасходныйКассовыйОрдер.ДляПробитияНаФР
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЧекНаОплату.Ссылка КАК Ссылка,
	               |	ЧекНаОплату.СуммаДокумента КАК СуммаДокумента
	               |ПОМЕСТИТЬ ЧекиНаОплату
	               |ИЗ
	               |	Документ.ЧекНаОплату КАК ЧекНаОплату
	               |ГДЕ
	               |	ЧекНаОплату.ТипСпособаРасчетаККТ = ЗНАЧЕНИЕ(Перечисление.ТипыСпособаРасчетаККТ.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЧекиНаОплату.Ссылка КАК Ссылка,
	               |	ЧекиНаОплату.СуммаДокумента КАК СуммаДокумента,
	               |	СУММА(ЧекНаОплатуТовары.СуммаВсего) КАК СуммаВсего
	               |ИЗ
	               |	ЧекиНаОплату КАК ЧекиНаОплату
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекНаОплату.Товары КАК ЧекНаОплатуТовары
	               |		ПО ЧекиНаОплату.Ссылка = ЧекНаОплатуТовары.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЧекиНаОплату.Ссылка,
	               |	ЧекиНаОплату.СуммаДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Выписка.Ссылка КАК Ссылка,
	               |	Выписка.СуммаДокумента КАК СуммаДокумента,
	               |	Выписка.КурсДокумента КАК КурсДокумента
	               |ИЗ
	               |	Документ.Выписка КАК Выписка
	               |ГДЕ
	               |	Выписка.ТипСпособаРасчетаККТ = ЗНАЧЕНИЕ(Перечисление.ТипыСпособаРасчетаККТ.ПустаяСсылка)
	               |	И Выписка.ДляПробитияНаФР";
	
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	// ПКО и РКО
	Выборка = ПакетЗапросов[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
		
		ТабличнаяЧастьДокументаОснования = УправлениеДиалогомДокументаСервер.ПолучитьТабличнуюЧастьДокументаОснования(Выборка.Ссылка);
		
		Если НЕ ТабличнаяЧастьДокументаОснования=Неопределено И ТабличнаяЧастьДокументаОснования.Количество()>0 Тогда
			
			ОбъектДокумента.ТипСпособаРасчетаККТ =
				?(ОбъектДокумента.СуммаДокумента * Выборка.КурсДокумента = ТабличнаяЧастьДокументаОснования.Итог("СуммаВсего") * Выборка.КурсДокумента,
				Перечисления.ТипыСпособаРасчетаККТ.Передача,
				Перечисления.ТипыСпособаРасчетаККТ.Предоплата);
		Иначе
			ОбъектДокумента.ТипСпособаРасчетаККТ = Перечисления.ТипыСпособаРасчетаККТ.Передача;
		КонецЕсли;
		
		ОбъектДокумента.ОбменДанными.Загрузка = Истина;
		
		Попытка
			ОбъектДокумента.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(
				СтрШаблон(НСтр("ru = 'Не удалось записать документ %1 при заполнении способа расчета.'"), Строка(ОбъектДокумента.Ссылка)),
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
	// Чек на оплату
	Выборка = ПакетЗапросов[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
		
		ОбъектДокумента.ТипСпособаРасчетаККТ =
			?(ОбъектДокумента.СуммаДокумента = Выборка.СуммаВсего,
			Перечисления.ТипыСпособаРасчетаККТ.Передача,
			Перечисления.ТипыСпособаРасчетаККТ.Предоплата);
		
		Если ОбъектДокумента.ТипСпособаРасчетаККТ = Перечисления.ТипыСпособаРасчетаККТ.Предоплата Тогда
			
			ТаблицаТоваров = ОбъектДокумента.Товары.Выгрузить();
			
			Документы.ЧекНаОплату.ПроизвестиРаспределениеСуммыОплаты(ОбъектДокумента.СуммаДокумента, ТаблицаТоваров);
			
			// Заполним суммы распределения
			Для Каждого ТекущаяСтрока Из ОбъектДокумента.Товары Цикл
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("НомерСтроки",ТекущаяСтрока.НомерСтроки);
				СтрокаТаблицы = ТаблицаТоваров.НайтиСтроки(СтруктураОтбора);
				ТекущаяСтрока.СуммаОплаты = СтрокаТаблицы[0].СуммаОплаты;
			КонецЦикла;
			
		Иначе
			
			Для Каждого СтрокаТоваров Из ОбъектДокумента.Товары Цикл
				СтрокаТоваров.СуммаОплаты = СтрокаТоваров.СуммаВсего;
			КонецЦикла;
			
		КонецЕсли;
		
		ОбъектДокумента.ОбменДанными.Загрузка = Истина;
		
		Попытка
			ОбъектДокумента.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(
				СтрШаблон(НСтр("ru = 'Не удалось записать документ %1 при заполнении способа расчета.'"), Строка(ОбъектДокумента.Ссылка)),
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
	// Выписка
	Выборка = ПакетЗапросов[3].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
		
		// Подготовим данные для получение номенклатуры по сделке
		СтрукутраСделки = Новый Структура("ДокументОснование,ВалютаДокумента,КурсДокумента");
		ЗаполнитьЗначенияСвойств(СтрукутраСделки, ОбъектДокумента,, "ДокументОснование");
		
		ЭтоПредоплата = Ложь;
		Для Каждого ТекущаяСтрока Из ОбъектДокумента.Состав Цикл
			
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Сделка) Тогда
				ЭтоПредоплата = Истина;
				Прервать;
			Иначе
				СтрукутраСделки.ДокументОснование = ТекущаяСтрока.Сделка;
				ТабличнаяЧастьДокументаОснования=УправлениеДиалогомДокументаСервер.ПолучитьТабличнуюЧастьДокументаОснования(СтрукутраСделки);
				Если ТабличнаяЧастьДокументаОснования=Неопределено ИЛИ ТабличнаяЧастьДокументаОснования.Количество()=0 Тогда
					ЭтоПредоплата = Истина;
					Прервать;
				ИначеЕсли ТабличнаяЧастьДокументаОснования.Итог("СуммаВсего") * Выборка.КурсДокумента <> ОбъектДокумента.СуммаДокумента Тогда
					ЭтоПредоплата = Истина;
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		ОбъектДокумента.ТипСпособаРасчетаККТ =
			?(НЕ ЭтоПредоплата,
			Перечисления.ТипыСпособаРасчетаККТ.Передача,
			Перечисления.ТипыСпособаРасчетаККТ.Предоплата);
		
		ОбъектДокумента.ОбменДанными.Загрузка = Истина;
		
		Попытка
			ОбъектДокумента.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(
				СтрШаблон(НСтр("ru = 'Не удалось записать документ %1 при заполнении способа расчета.'"), Строка(ОбъектДокумента.Ссылка)),
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТипСпособаРасчетаККТДокументов()

#КонецЕсли