
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		Отбор = Новый Структура("ПодразделениеКомпании", ПараметрКоманды);
	Иначе
		Отбор = Новый Структура("Номенклатура", ПараметрКоманды);
	КонецЕсли;
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.ОграничениеАссортиментаПодразделения.ФормаСписка",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка,
		,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры
