
&НаСервере
Процедура УстановитьИнтервал()
	
	ДатаОтбора = НачалоДня(ТекущаяДатаСеанса()) - ИнтервалДней*86400;
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных("Дата");
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(СписокДокументов.Отбор, ПолеОтбора, ДатаОтбора, ВидСравненияКомпоновкиДанных.БольшеИлиРавно, Истина);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокДокументов()
	
	СписокДокументов.ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДокументСписок.Ссылка,
	|	ДокументСписок.ПометкаУдаления,
	|	ДокументСписок.Номер,
	|	ДокументСписок.Дата,
	|	ДокументСписок.СкладКомпании,
	|	"+?(ВидДокумента = "ПеремещениеТоваров","", "ДокументСписок.Контрагент,")+"
	|	ДокументСписок.Организация,
	|	ДокументСписок.ПодразделениеКомпании
	|ИЗ
	|	Документ."+ВидДокумента+" КАК ДокументСписок
	|";
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутсяНазад(Команда)
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТСД.Форма.НачальнаяСтраница");
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДокумент(Команда)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытияФормы = Новый Структура;
	Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВРаботе Тогда
		ТекущиеДанные = Элементы.ДокументыТСД.ТекущиеДанные;
		ИдентификаторОбъекта = ТекущиеДанные.ИдентификаторОбъекта;
		ПараметрыОткрытияФормы.Вставить("СкладКомпании",     ТекущиеДанные.СкладКомпании);
		//ПараметрыОткрытияФормы.Вставить("ДокументОснование", ТекущиеДанные.ДокументОснование);
		ДокументЗаполнения = ПолучитьДокументПоИдентификатору(ИдентификаторОбъекта, ВидДокумента);
	ИначеЕсли Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВСписке Тогда
		ТекущаяСтрока = Элементы.СписокДокументов.ТекущаяСтрока;
		ДокументЗаполнения = ТекущаяСтрока;
		ИдентификаторОбъекта = ДобавитьДокументВРаботу(ВидДокумента, ДокументЗаполнения);
	Иначе
		ТекстСообщения = НСтр("ru='Документ не выбран!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытияФормы.Вставить("ДокументЗаполнения",   ДокументЗаполнения);
	ПараметрыОткрытияФормы.Вставить("ВидДокумента",         ВидДокумента);
	ПараметрыОткрытияФормы.Вставить("ИдентификаторОбъекта", ИдентификаторОбъекта);
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТСД.Форма.СборДанных", ПараметрыОткрытияФормы);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСкладПользователя()
	
	Возврат ПравоПользователя("ОсновнойСкладКомпании");
	
КонецФункции

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	
	СкладКомпании = ПолучитьСкладПользователя();
	
	Если ЗначениеЗаполнено(СкладКомпании) Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("СкладКомпании", СкладКомпании);
		
		ОповещениеВыбораСклада = Новый ОписаниеОповещения("ОбработатьВопросВыборСклада", ЭтотОбъект, ДополнительныеПараметры);
		
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Создать документ для склада ""%1""?'"), 
		Строка(СкладКомпании));
		
		ПоказатьВопрос(ОповещениеВыбораСклада, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена,,,"Выбор склада");
		Возврат;
	КонецЕсли;
	
	ВыбратьСклад();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросВыборСклада(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработатьВыборСклада(ДополнительныеПараметры.СкладКомпании);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ВыбратьСклад();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСклад()
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("РежимВыбора", Истина);
	
	ОповещениеВыбораСклада = Новый ОписаниеОповещения("ПолучитьВыбранныйСклад", ЭтотОбъект);
	ОткрытьФорму("Справочник.СкладыКомпании.ФормаВыбора", ПараметрыОткрытияФормы, ЭтотОбъект,,,,ОповещениеВыбораСклада);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВыбранныйСклад(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ОбработатьВыборСклада(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСкладПолучатель()
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("РежимВыбора", Истина);
	
	ОповещениеВыбораСклада = Новый ОписаниеОповещения("ПолучитьВыбранныйСклад", ЭтотОбъект);
	ОткрытьФорму("Справочник.СкладыКомпании.ФормаВыбора", ПараметрыОткрытияФормы, ЭтотОбъект,,,,ОповещениеВыбораСклада);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОперацию(ВидДокумента)
	
	Результат = "";
	Если ВидДокумента = "ВозвратПоставщику" Тогда
		Результат = "Возврат поставщику";
	ИначеЕсли ВидДокумента = "Инвентаризация" Тогда
		Результат = "Инвентаризация";
	ИначеЕсли ВидДокумента = "ПеремещениеТоваров" Тогда
		Результат = "Перемещение товаров";
	ИначеЕсли ВидДокумента = "ПоступлениеТоваров" Тогда
		Результат = "Поступление товаров";
	ИначеЕсли ВидДокумента = "СписаниеТоваров" Тогда
		Результат = "Списание товаров";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СоздатьНовыйДокумент(ИдентификаторОбъекта, ВидДокумента, СкладКомпании, ДокументОснование = Неопределено)
	
	Если ПустаяСтрока(ИдентификаторОбъекта) Тогда
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			ИдентификаторОбъекта = ДокументОснование.УникальныйИдентификатор();
		Иначе
			ИдентификаторОбъекта = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	ДокументыТСД = РегистрыСведений.ДокументыТСД.СоздатьМенеджерЗаписи();
	ДокументыТСД.ИдентификаторОбъекта = ИдентификаторОбъекта;
	ДокументыТСД.ВидДокумента         = ВидДокумента;
	ДокументыТСД.Прочитать();
	Если ДокументыТСД.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДатаСеанса()));
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДокументыТСД.НомерДокумента
	|ИЗ
	|	РегистрСведений.ДокументыТСД КАК ДокументыТСД
	|ГДЕ
	|	НачалоПериода(ДокументыТСД.ДатаНачала, ДЕНЬ) = &ДатаНачала
	|УПОРЯДОЧИТЬ ПО
	|	ДокументыТСД.НомерДокумента УБЫВ
	|";
	
	НомерДокумента = 1;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НомерДокумента = Выборка.НомерДокумента + 1;
	КонецЕсли;
	
	ДокументыТСД.ИдентификаторОбъекта = ИдентификаторОбъекта;
	ДокументыТСД.ВидДокумента         = ВидДокумента;
	ДокументыТСД.НомерДокумента       = НомерДокумента;
	ДокументыТСД.ДатаНачала           = ТекущаяДатаСеанса();
	ДокументыТСД.СкладКомпании        = СкладКомпании;
	//ДокументыТСД.ДокументОснование    = ДокументОснование;
	ДокументыТСД.Операция             = ПолучитьОперацию(ВидДокумента);
	ДокументыТСД.Пользователь         = ПараметрыСеанса.ТекущийПользователь;
	ДокументыТСД.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСклада(СкладКомпании)
	
	СоздатьНовыйДокумент(ИдентификаторОбъекта, ВидДокумента, СкладКомпании, ДокументОснование);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ДокументЗаполнения",   Неопределено);
	ПараметрыОткрытияФормы.Вставить("ВидДокумента",         ВидДокумента);
	ПараметрыОткрытияФормы.Вставить("ИдентификаторОбъекта", ИдентификаторОбъекта);
	ПараметрыОткрытияФормы.Вставить("СкладКомпании",        СкладКомпании);
	ПараметрыОткрытияФормы.Вставить("ДокументОснование",    ДокументОснование);
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТСД.Форма.СборДанных", ПараметрыОткрытияФормы);
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавитьДокументВРаботу(ВидДокумента, ДокументЗаполнения)
	
	ИдентификаторОбъекта = ДокументЗаполнения.УникальныйИдентификатор();
	СоздатьНовыйДокумент(ИдентификаторОбъекта, ВидДокумента, ДокументЗаполнения.СкладКомпании);
	
	Возврат ИдентификаторОбъекта;
	
КонецФункции

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументЗаполнения   = ВыбраннаяСтрока;
	ИдентификаторОбъекта = ДобавитьДокументВРаботу(ВидДокумента, ДокументЗаполнения);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ДокументЗаполнения",   ДокументЗаполнения);
	ПараметрыОткрытияФормы.Вставить("ВидДокумента",         ВидДокумента);
	ПараметрыОткрытияФормы.Вставить("ИдентификаторОбъекта", ИдентификаторОбъекта);
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТСД.Форма.СборДанных", ПараметрыОткрытияФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалДнейПриИзменении(Элемент)
	
	УстановитьИнтервал();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПоискПоЗаказу = Ложь;
	ВидДокумента = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ВидДокумента", "ПоступлениеТоваров");
	Если ВидДокумента = "ПоступлениеТоваров" Тогда
		Элементы.ПоискПоЗаказу.Доступность = Истина;
		ПоискПоЗаказу = Ложь;
	Иначе
		Элементы.ПоискПоЗаказу.Доступность = Ложь;
		ПоискПоЗаказу = Ложь;
	КонецЕсли;
	
	НастроитьСписокДокументов();
	
	ДокументЗаполнения = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДокументЗаполнения", Неопределено);
	ИдентификаторОбъекта = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ИдентификаторОбъекта", Неопределено);
	
	Если ДокументЗаполнения = Неопределено И ЗначениеЗаполнено(ИдентификаторОбъекта) Тогда
		
		ИнтервалДней = 1;
		
		РезультатПоиска = СокрЛП(ДокументЗаполнения);
		
		КлючЗаписи = РегистрыСведений.ДокументыТСД.СоздатьКлючЗаписи(Новый Структура("ИдентификаторОбъекта, ВидДокумента", ИдентификаторОбъекта, ВидДокумента));
		Элементы.ДокументыТСД.ТекущаяСтрока = КлючЗаписи;
		
		ТекущиеДанные = Элементы.ДокументыТСД.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			РезультатПоиска = "Документ не выбран";
		Иначе
			РезультатПоиска = "Документ № " + СокрЛП(ТекущиеДанные.НомерДокумента) + " от " + ТекущиеДанные.ДатаНачала;
		КонецЕсли;
		
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВРаботе;
		
	ИначеЕсли ДокументЗаполнения = Неопределено Тогда
		ИнтервалДней = 1;
		РезультатПоиска = "Документ не выбран";
	Иначе
		РезультатПоиска = СокрЛП(ДокументЗаполнения);
		Элементы.СписокДокументов.ТекущаяСтрока = ДокументЗаполнения;
		ИнтервалДней = (НачалоДня(ТекущаяДатаСеанса())-НачалоДня(ДокументЗаполнения.Дата))/86400;
		
		ИдентификаторОбъекта = ДокументЗаполнения.УникальныйИдентификатор();
		КлючЗаписи = РегистрыСведений.ДокументыТСД.СоздатьКлючЗаписи(Новый Структура("ИдентификаторОбъекта, ВидДокумента", ИдентификаторОбъекта, ВидДокумента));
		
		Элементы.ДокументыТСД.ТекущаяСтрока = КлючЗаписи;
		
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВСписке;
		
	КонецЕсли;
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных("ВидДокумента");
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ДокументыТСД.Отбор, ПолеОтбора, ВидДокумента, ВидСравненияКомпоновкиДанных.БольшеИлиРавно, Истина);
	УстановитьИнтервал();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыйДокумент(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДокументТСД(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КнопкаНоль(Команда)
	
	СтрокаШтрихкода = СтрокаШтрихкода + "0";
	ТекущийЭлемент = Элементы.СтрокаШтрихкода;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОдин(Команда)
	
	СтрокаШтрихкода = СтрокаШтрихкода + "1";
	ТекущийЭлемент = Элементы.СтрокаШтрихкода;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДва(Команда)
	
	СтрокаШтрихкода = СтрокаШтрихкода + "2";
	ТекущийЭлемент = Элементы.СтрокаШтрихкода;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаТри(Команда)
	
	СтрокаШтрихкода = СтрокаШтрихкода + "3";
	ТекущийЭлемент = Элементы.СтрокаШтрихкода;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЧетыре(Команда)
	
	СтрокаШтрихкода = СтрокаШтрихкода + "4";
	ТекущийЭлемент = Элементы.СтрокаШтрихкода;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаПять(Команда)
	
	СтрокаШтрихкода = СтрокаШтрихкода + "5";
	ТекущийЭлемент = Элементы.СтрокаШтрихкода;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаШесть(Команда)
	
	СтрокаШтрихкода = СтрокаШтрихкода + "6";
	ТекущийЭлемент = Элементы.СтрокаШтрихкода;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСемь(Команда)
	
	СтрокаШтрихкода = СтрокаШтрихкода + "7";
	ТекущийЭлемент = Элементы.СтрокаШтрихкода;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВосемь(Команда)
	
	СтрокаШтрихкода = СтрокаШтрихкода + "8";
	ТекущийЭлемент = Элементы.СтрокаШтрихкода;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДевять(Команда)
	
	СтрокаШтрихкода = СтрокаШтрихкода + "9";
	ТекущийЭлемент = Элементы.СтрокаШтрихкода;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиОбъектПоКоду(ШтрихкодПараметр, ВидДокумента, ПоискПоЗаказу, ДокументОснование)
	ВидДок = ВидДокумента;
	Если ПоискПоЗаказу = Истина Тогда
		ВидДок = "ЗаказПоставщику";
	КонецЕсли;
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ШтрихкодПараметр", "%"+ШтрихкодПараметр+"%");
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПараметрыСеанса.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ПериодОтбора", НачалоДня(ТекущаяДата() - 90*86400));
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ."+ВидДок+" КАК Документ
	|ГДЕ 
	|	Документ.Номер ПОДОБНО &ШтрихкодПараметр И
	|	Документ.ПодразделениеКомпании = &ПодразделениеКомпании И
	|	Документ.Дата >= &ПериодОтбора
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ПоискПоЗаказу = Истина Тогда
			ДокументОснование = Выборка.Ссылка;
			Результат         = НайтиПоЗаказуПоставщику(Выборка.Ссылка);
		Иначе
			Результат = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // НайтиОбъектПоКоду()

&НаСервереБезКонтекста
Функция НайтиПоЗаказуПоставщику(Ссылка)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК Документ
	|ГДЕ
	|	Документ.ДокументОснование = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // НайтиПоЗаказуПоставщику()

&НаСервере
Процедура НайтиДокумент()
	
	ДокументОснование  = Неопределено;
	ДокументЗаполнения = Неопределено;
	ОбъетПоШтрихКоду = Неопределено;
	ДатыЗапрета = ДатыЗапретаИзмененияСлужебный.ДействующиеДатыЗапрета();
	// Поиск объектов по штрихкоду.
	ОбъектыПоШтрихкоду = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(СтрокаШтрихкода, Ложь);
	Если ОбъектыПоШтрихкоду.Количество() > 0 Тогда
		ОбъетПоШтрихКоду = ОбъектыПоШтрихкоду[0].Объект;
	КонецЕсли;
	
	// Если ищем в документах по заказу поставщику
	Если ЗначениеЗаполнено(ОбъетПоШтрихКоду) И ТипЗнч(ОбъетПоШтрихКоду) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ДокументОснование = ОбъетПоШтрихКоду;
		ДокументЗаполнения = НайтиПоЗаказуПоставщику(ОбъетПоШтрихКоду);
	ИначеЕсли ЗначениеЗаполнено(ОбъетПоШтрихКоду) Тогда
		ТипДокумента = Новый ОписаниеТипов("ДокументСсылка."+ВидДокумента);
		ДокументЗаполнения = ТипДокумента.ПривестиЗначение(ОбъетПоШтрихКоду);
	КонецЕсли;
	
	//Поиск по коду
	Если НЕ ЗначениеЗаполнено(ДокументЗаполнения) Тогда
		ДокументЗаполнения = НайтиОбъектПоКоду(СтрокаШтрихкода, ВидДокумента, ПоискПоЗаказу, ДокументОснование);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументЗаполнения) Тогда
		Если ДатыЗапретаИзменения.ИзменениеЗапрещено(ДокументЗаполнения.Метаданные().ПолноеИмя(), ДокументЗаполнения) Тогда
			РезультатПоиска = "[" + СтрокаШтрихкода + "] Документ запрещено изменять";
			Штрихкод = СтрокаШтрихкода;
			СтрокаШтрихкода = "";
		КонецЕсли;
		РезультатПоиска = "[" + СтрокаШтрихкода + "] " + СокрЛП(ДокументЗаполнения);
		Элементы.СписокДокументов.ТекущаяСтрока = ДокументЗаполнения;
		ИнтервалДней = (НачалоДня(ТекущаяДатаСеанса())-НачалоДня(ДокументЗаполнения.Дата))/86400;
		УстановитьИнтервал();
		ИдентификаторОбъекта = ДокументЗаполнения.УникальныйИдентификатор();
		КлючЗаписи = РегистрыСведений.ДокументыТСД.СоздатьКлючЗаписи(Новый Структура("ИдентификаторОбъекта, ВидДокумента", ИдентификаторОбъекта, ВидДокумента));
		Элементы.ДокументыТСД.ТекущаяСтрока = КлючЗаписи;
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВСписке;
		ЭтотОбъект.ТекущийЭлемент = Элементы.ВыбратьДокумент;
	ИначеЕсли ЗначениеЗаполнено(ДокументОснование) Тогда
		ИдентификаторОбъекта = ДокументОснование.УникальныйИдентификатор();
	Иначе
		ДокументЗаполнения = Неопределено;
		//Элементы.РезультатПоиска1.Заголовок = "[" + СтрокаШтрихкода + "] Документ не найден";
		РезультатПоиска = "[" + СтрокаШтрихкода + "] Документ не найден";
		ЭтотОбъект.ТекущийЭлемент = Элементы.СтрокаШтрихкода;
	КонецЕсли;
	
	Штрихкод = СтрокаШтрихкода;
	СтрокаШтрихкода = "";
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаПоиск(Команда)
	
	НайтиДокумент();
	ОбработатьРезультатПоиска();
	
КонецПроцедуры

&НаКлиенте
Процедура СтеретьКод(Команда)
	
	СтрокаШтрихкода = Лев(СтрокаШтрихкода, СтрДлина(СтрокаШтрихкода)-1);
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОчистить(Команда)
	
	СтрокаШтрихкода = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ДеньВперед(Команда)
	
	ИнтервалДней = Мин(ИнтервалДней + 1, 99);
	УстановитьИнтервал();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеньНазад(Команда)
	
	ИнтервалДней = Макс(ИнтервалДней - 1, 1);
	УстановитьИнтервал();
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьКод(Команда)
	
	Если ПустаяСтрока(Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаШтрихкода = Штрихкод;
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаполнитьЗаголовокДокументаВРаботе(Заголовок, ТекущиеДанные)
	
	Заголовок = "Документ № " + СокрЛП(ТекущиеДанные.НомерДокумента) + " от " + ТекущиеДанные.ДатаНачала;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыТСДПриАктивизацииСтрокиОбработчикОжидания()
	
	ТекущиеДанные = Элементы.ДокументыТСД.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторОбъекта = ТекущиеДанные.ИдентификаторОбъекта;
	
	//ЗаполнитьЗаголовокДокументаВРаботе(Элементы.РезультатПоиска1.Заголовок, ТекущиеДанные);
	ЗаполнитьЗаголовокДокументаВРаботе(РезультатПоиска, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыТСДПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ДокументыТСДПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьЗаголовокДокумента(Заголовок, ДокументЗаполнения)
	
	Заголовок = СокрЛП(ДокументЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПриАктивизацииСтрокиОбработчикОжидания();
	
	ТекущаяСтрока = Элементы.СписокДокументов.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДокументЗаполнения = ТекущаяСтрока;
	//ЗаполнитьЗаголовокДокумента(Элементы.РезультатПоиска1.Заголовок, ДокументЗаполнения);
	ЗаполнитьЗаголовокДокумента(РезультатПоиска, ДокументЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("СписокДокументовПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДокументПоИдентификатору(ИдентификаторОбъекта, ВидДокумента)
	
	Если ТипЗнч(ИдентификаторОбъекта) = Тип("Строка") Тогда
		ИдентификаторОбъекта = Новый УникальныйИдентификатор(ИдентификаторОбъекта);
	КонецЕсли;
	
	ДокументЗаполнения = Документы[ВидДокумента].ПолучитьСсылку(ИдентификаторОбъекта);
	Если Найти(Строка(ДокументЗаполнения), "<Объект не найден>") = 1 Тогда
		ДокументЗаполнения = Неопределено;
	КонецЕсли;
	
	Возврат ДокументЗаполнения;
	
КонецФункции

&НаКлиенте
Процедура ДокументыТСДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ДокументыТСД.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторОбъекта = ТекущиеДанные.ИдентификаторОбъекта;
	
	Результат = ПолучитьДокументПоИдентификатору(ИдентификаторОбъекта, ВидДокумента);
	Если ЗначениеЗаполнено(Результат) Тогда
		ДокументЗаполнения = Результат;
	Иначе
		ДокументЗаполнения = Неопределено;
	КонецЕсли;
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ДокументЗаполнения",   ДокументЗаполнения);
	ПараметрыОткрытияФормы.Вставить("ВидДокумента",         ВидДокумента);
	ПараметрыОткрытияФормы.Вставить("СкладКомпании",        ТекущиеДанные.СкладКомпании);
	//ПараметрыОткрытияФормы.Вставить("ДокументОснование",    ТекущиеДанные.ДокументОснование);
	ПараметрыОткрытияФормы.Вставить("ИдентификаторОбъекта", ИдентификаторОбъекта);
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТСД.Форма.СборДанных", ПараметрыОткрытияФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатПоиска()
	
	Если НЕ ЗначениеЗаполнено(ДокументЗаполнения) И ЗначениеЗаполнено(ДокументОснование) Тогда
		СоздатьДокумент(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаШтрихкодаПриИзменении(Элемент)
	
	НайтиДокумент();
	ОбработатьРезультатПоиска();
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Источник = "Сканер" Тогда
		СтрокаШтрихкода = Данные;
		НайтиДокумент();
		ОбработатьРезультатПоиска();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимВыбораПриИзменении(Элемент)
	
	Если РежимВыбора = 0 Тогда
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаПоКоду;
	ИначеЕсли РежимВыбора = 1 Тогда
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВРаботе;
	Иначе
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВСписке;
	КонецЕсли;
	
КонецПроцедуры

