// Общий модуль "Управление списком справочников (сервер)"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедуры производит инициализацию служебных реквизитов формы списка.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которую производиться добавление реквизитов.
//
Процедура ИнициализироватьСлужебныеРеквизиты(Форма)
	
	Если ПустаяСтрока(Форма.Список.ОсновнаяТаблица) И Форма.Список.ПоляКлюча.Количество()=1 Тогда
		ПолеКлюча = Новый ПолеКомпоновкиДанных(Форма.Список.ПоляКлюча[0]);
		ПолеВыбора = Форма.Список.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(Форма.Список.ПоляКлюча[0]));
		ТипЗначенияПоля = ПолеВыбора.ТипЗначения.Типы()[0];
		ОсновнаяТаблица = Метаданные.НайтиПоТипу(ТипЗначенияПоля).ПолноеИмя();
	Иначе
		ОсновнаяТаблица = Форма.Список.ОсновнаяТаблица;
	КонецЕсли;
	
	// Составим перечень добавляемых в форму реквизитов
	СлужебныеРеквизиты = Новый Структура();
	СлужебныеРеквизиты.Вставить("ПолноеИмяОбъекта",       ОсновнаяТаблица);
	СлужебныеРеквизиты.Вставить("КлючОбъекта",            ОсновнаяТаблица+?(ПолучитьЗначениеПараметраСтруктуры(Форма.Параметры, "РежимВыбора", ЛОЖЬ), ".РежимВыбора", ""));
	СлужебныеРеквизиты.Вставить("СтатусДокумента",        "СтатусДокумента");
	СлужебныеРеквизиты.Вставить("ИмяДополнительнойФормы", УправлениеДиалогомВызовСервера.ПолучитьИмяДополнительнойФормыОбъекта(СлужебныеРеквизиты.ПолноеИмяОбъекта));
	
	// Корректировочный реквизит формы, используется для пропуска лишних вызовов событий активизации строки.
	СлужебныеРеквизиты.Вставить("ТекущийЭлементСписка",   Неопределено);
	
	// Признак разрешения пользователю изменять состояние пометки на удаление у объектов.
	СлужебныеРеквизиты.Вставить("РазрешитьУправлениеПометкойУдаления", РольПользователя("УправлениеПометкойУдаленияОбъектов"));
	
	// Производим создание дополнительных реквизитов формы
	УправлениеДиалогомСервер.ДобавитьРеквизитыФормы(Форма, СлужебныеРеквизиты);
	
КонецПроцедуры // ИнициализироватьСлужебныеРеквизиты()

// Процедуры производит инициализацию команд в форме списка.
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которую производиться добавление команды.
//
Процедура ИнициализироватьКомандыПанелиДействий(Форма)
	
	// Определим в какую панель формы необходимо помещать новые кнопки
	ИмяКоманднойПанелиФормы = ?(Форма.Элементы.Найти("ОсновныеДействия")=Неопределено, "ФормаКоманднаяПанель", "ОсновныеДействия");
	
	// Произведем добавление панели для размещения дополнительных операций с формой
	НазначитьДополнительныеДействия = (НЕ Форма.Элементы.Найти("ДополнительныеДействия")=Неопределено);
	
	// Получим описание метаданных текущего объекта
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Форма.ПолноеИмяОбъекта);
	
	// Инициализируем элементы формы связанные с Дополнительными отчетами и обработками.
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(Форма, "ФормаСписка");
	
	// Создаем подменю печати
	ПодменюПечати = ЗащищенныеФункцииСервер.ДобавитьГруппуКоманд(Форма, "ПодменюПечать", ИмяКоманднойПанелиФормы,, "Печать", БиблиотекаКартинок.ПодменюПечать, НСтр("ru = 'Подменю печати'"),, ОтображениеКнопки.Картинка);
	
	// Добавим команды печати
	УправлениеПечатью.ПриСозданииНаСервере(Форма, ПодменюПечати);
	
	Если НЕ Форма.Элементы.Найти("Дерево")=Неопределено Тогда
		ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ПоказатьДерево", ИмяКоманднойПанелиФормы, БиблиотекаКартинок.ПоказатьДерево, НСтр("ru = 'Показать дерево элементов'"), НСтр("ru = 'Показать/скрыть структуру иерархии элементов справочника'"), ЛОЖЬ);
		Форма.Элементы.ПоказатьДерево.Пометка = Форма.Элементы.Дерево.Видимость;
	КонецЕсли;
	
	Если НЕ Форма.Элементы.Найти("СтраницыРасширеннаяИнформация")=Неопределено Тогда
		ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ПоказатьРасширеннуюИнформацию", ИмяКоманднойПанелиФормы, БиблиотекаКартинок.РасширеннаяИнформация, НСтр("ru = 'Расширенная информация об операции'"), НСтр("ru = 'Показать/скрыть поле расширенной информации'"), ЛОЖЬ);
		Форма.Элементы.ПоказатьРасширеннуюИнформацию.Пометка = Форма.Элементы.СтраницыРасширеннаяИнформация.Видимость;
	КонецЕсли;
	
	// Производим инициализацию дополнительных команд формы списка
	Если НазначитьДополнительныеДействия Тогда
		
		// Формируем секцию команд группировки списка
		Если НЕ ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
			ЗащищенныеФункцииСервер.ДобавитьГруппуКоманд(Форма, "ГруппировкаСписка", "ДополнительныеДействия", ЛОЖЬ, НСтр("ru = 'Группировка списка'"));
			ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ГруппироватьПоКолонке",  "ГруппировкаСписка", БиблиотекаКартинок.ДинамическийСписокУстановитьГруппировку, НСтр("ru = 'Группировать по значениям колонки'"), НСтр("ru = 'Произвести группировку элементов списка по значениям текущей колонки'"));
			ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ОтменаГруппировки",      "ГруппировкаСписка", БиблиотекаКартинок.ДинамическийСписокОтменитьГруппировку,   НСтр("ru = 'Отменить группировку строк'"),        НСтр("ru = 'Отменить все группировки списка'"));
			
			ЗащищенныеФункцииСервер.ДобавитьГруппуКоманд(Форма, "ГруппировкаСпискаМеню", "СписокКонтекстноеМеню", ЛОЖЬ, НСтр("ru = 'Группировка списка'"));
			ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ГруппироватьПоКолонке",  "ГруппировкаСпискаМеню",    БиблиотекаКартинок.ДинамическийСписокУстановитьГруппировку, НСтр("ru = 'Группировать по значениям колонки'"), НСтр("ru = 'Произвести группировку элементов списка по значениям текущей колонки'"),,,,, "Меню");
			ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ОтменаГруппировки",      "ГруппировкаСпискаМеню",    БиблиотекаКартинок.ДинамическийСписокОтменитьГруппировку,   НСтр("ru = 'Отменить группировку строк'"),        НСтр("ru = 'Отменить все группировки списка'"),,,,, "Меню");
		КонецЕсли;
		
		// Пользователю с правами администратора данных позволим производить дополнительные манипуляции с данными.
		Если ПравоДоступа("АдминистрированиеДанных", Метаданные) И Форма.Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Множественный Тогда
			ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ИзменитьВыделенные",  "ДополнительныеДействия", БиблиотекаКартинок.ДействиеИзменить, НСтр("ru = 'Изменить выделенные объекты'"), НСтр("ru = 'Изменить выделенные объекты'"));
		КонецЕсли;
		
		// Пункт меню для открытия дополнительной формы редактирования объекта
		Если ЗначениеЗаполнено(Форма.ИмяДополнительнойФормы) ИЛИ ЕстьРеквизит(ОбъектМетаданных, "Комментарий") Тогда
			ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ДополнительнаяФорма", "ДополнительныеДействия", БиблиотекаКартинок.РедактироватьВДиалоге, НСтр("ru = 'Дополнительная форма'"), НСтр("ru = 'Открыть дополнительную форму редактирования'"),,,,,, Новый СочетаниеКлавиш(Клавиша.L, Истина));
		КонецЕсли;
		
		Если ПравоДоступа("Использование", Метаданные.Обработки.ПоискЗаменаЗначений) Тогда
			ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ПоискЗаменаЗначений", "ДополнительныеДействия", БиблиотекаКартинок.Заменить,         НСтр("ru = 'Поиск и замена значений'"),     НСтр("ru = 'Поиск и замена значений'"));
		КонецЕсли;
		
		ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ЖурналРегистрации",      "ДополнительныеДействия", БиблиотекаКартинок.ЖурналРегистрации,      НСтр("ru = 'Журнал регистрации'"),      НСтр("ru = 'Журнал регистрации'"));
		
		// Проверим использование дополнительных сведений для данного документа
		Если УправлениеСвойствами.ИспользоватьДопСведения(ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Форма.ПолноеИмяОбъекта).ПустаяСсылка()) Тогда
			ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, "ДополнительныеСведения", "ДополнительныеДействия", БиблиотекаКартинок.ДополнительныеСведения, НСтр("ru = 'Дополнительные сведения'"), НСтр("ru = 'Дополнительные сведения'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ИнициализироватьКомандыПанелиДействий()

// Производит установку расширенного заголовка формы списка справочников.
//
// Параметры:
//  Форма - УправляемаяФорма - форма переданного справочника.
//
Процедура УстановитьЗаголовокСпискаСправочника(Форма)
	
	// Получим представление объекта, к которому относиться динамический список
	ПредставлениеСписка = УправлениеДиалогомСервер.ПредставлениеСпискаОбъектов(Форма);
	
	// Получим представление наложенного на список отбора по владельцу
	ПредставлениеВладельца = ?(Форма.Параметры.Свойство("Отбор") И Форма.Параметры.Отбор.Свойство("Владелец") И ЗначениеЗаполнено(Форма.Параметры.Отбор.Владелец), СокрЛП(Форма.Параметры.Отбор.Владелец), "");
	
	// Сформируем итоговое представление динамического списка
	Форма.Заголовок = ПредставлениеСписка + ?(ПустаяСтрока(ПредставлениеВладельца), "", " ("+ПредставлениеВладельца+")");
	
КонецПроцедуры // УстановитьЗаголовокСпискаСправочника()

// Получает отборы недоступные для изменения пользователем при выборе элементов
// для всей конфигурации.
//
// Параметры:
//  Форма - УправляемаяФорма - форма переданного справочника.
//
Функция ЗаблокированныеОтборыПоУмолчанию(Форма) Экспорт
	
	Поля = Новый Массив;
	Поля.Добавить("Владелец");
	
	Попытка
		ИзмененныеПоля = УправлениеСпискомСправочникаПереопределяемый.ЗаблокированныеОтборыПоУмолчанию(Поля, Форма);
	Исключение
		ИзмененныеПоля = Поля;
	КонецПопытки;
	
	Если ИзмененныеПоля = Неопределено Тогда
		Возврат Поля;
	КонецЕсли;
	
	Возврат ИзмененныеПоля;
	
КонецФункции // ЗаблокированныеОтборыПоУмолчанию()

// Определяет состав заблокированных полей открываемой формы
//
// Параметры:
//  Форма - УправляемаяФорма - форма переданного справочника.
//
Функция ЗаблокированныеПоля(Форма) Экспорт
	
	// Получим поля установленные в форме.
	ЗаблокированныеПоля = ПолучитьЗначениеПараметраСтруктуры(Форма.Параметры, "ЗаблокированныеПоля", Неопределено);
	
	// Если у формы не были установлены блокируемые поля, получим значения по умолчанию.
	Если ЗаблокированныеПоля = Неопределено Тогда
		
		ЗаблокированныеПоля = УправлениеСпискомСправочникаСервер.ЗаблокированныеОтборыПоУмолчанию(Форма);
		
	КонецЕсли;
	
	Если ТипЗнч(ЗаблокированныеПоля) <> Тип("Массив") Тогда
		
		ЗаблокированныеПоля = Новый Массив;
		
	КонецЕсли;
	
	Возврат ЗаблокированныеПоля;
	
КонецФункции // ЗаблокированныеПоля()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Общий обработчик события выбора одного из пунктов меню доступных хоз. операций
// 
// Параметры:
//  Форма             - УправляемаяФорма          - Форма, в которой возникло событие.
//  КомандаИмя        - Строка                    - Имя команды, в которой возникло данное событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
Функция ОбработкаКомандыФормы(Форма, КомандаИмя, ПараметрыДействия=Неопределено) Экспорт
	
	Если ЛЕВ(КомандаИмя, 40)="КомандаДополнительнойОбработкиЗаполнения" Тогда
		
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(Форма, КомандаИмя, РезультатВыполнения);
		Если НЕ РезультатВыполнения = Неопределено Тогда
			
			Для каждого Элемент Из РезультатВыполнения Цикл
				ПараметрыДействия.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыДействия.Свойство("КомандаПечатиИдентификатор") И ПараметрыДействия.КомандаПечатиИдентификатор="ПечатьРеестра" Тогда

		Настройки = Форма.Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
		СхемаКомпоновки = ПоместитьВоВременноеХранилище(Форма.Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных(),Форма.УникальныйИдентификатор);
		ПараметрыДействия.Вставить("Схема",     СхемаКомпоновки);
		ПараметрыДействия.Вставить("Настройки", Настройки);
		ПараметрыДействия.Вставить("Заголовок", " " + Форма.Заголовок);
		ПараметрыДействия.Вставить("ПечатьРеестра");
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаКомандыФормы()

// Общий обработчик события возникающего при оповещении формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  Форма                   - УправляемаяФорма - Форма, в которой возникло событие.
//  РезультатОповещения     - Произвольный     - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный     - Значение, которое было указано при создании описания оповещения.
//
Функция ОбработкаРезультатаОповещения(Форма, РезультатОповещения, ДополнительныеПараметры=Неопределено, Объект =Неопределено) Экспорт
	
	// Обработаем в зависимости от переданного параметра события
	УправлениеДиалогомСервер.ОбработкаРезультатаОповещения(Форма, РезультатОповещения, ДополнительныеПараметры, Объект);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаРезультатаОповещения()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ МОДУЛЯ МЕНДЖЕРА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ СПИСКА СПРАВОЧНИКОВ

// Общий обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Форма                - УправляемаяФорма - Форма, в которой возникло событие.
//  Параметры            - Структура - Содержит коллекцию параметров формы.
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
Функция ПриСозданииНаСервере(Форма, Параметры, Отказ=ЛОЖЬ, СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Проверяем переданный при открытии отбор по владельцу
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") И ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда
		
		ОбъектЯвляетсяГруппой = Ложь;
		
		Если ТипЗнч(Параметры.Отбор.Владелец) = Тип("ФиксированныйМассив") Тогда
			Для Каждого ВладелецОбъекта Из Параметры.Отбор.Владелец Цикл
				Если ОбщегоНазначения.ОбъектЯвляетсяГруппой(ВладелецОбъекта) Тогда
					ОбъектЯвляетсяГруппой = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ОбъектЯвляетсяГруппой = ОбщегоНазначения.ОбъектЯвляетсяГруппой(Параметры.Отбор.Владелец);
		КонецЕсли;
		
		Если ОбъектЯвляетсяГруппой Тогда
			ВывестиСообщение(НСтр("ru='Использование для групп запрещено.'"),,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	// Произведем инициализацию служебных реквизитов формы
	ИнициализироватьСлужебныеРеквизиты(Форма);
	
	// Настроим состав и параметры отображения командной панели формы
	ИнициализироватьКомандыПанелиДействий(Форма);
	
	// Установим режим выбора поля списка в соответствии с режимом открытия формы
	Форма.Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	Если Параметры.Свойство("ТекущаяСтрока") и ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
		Форма.Элементы.Список.ВосстанавливатьТекущуюСтроку = Ложь;
	КонецЕсли;
	
	// Устанавливаем дополнительный отбор в дереве для подчиненных иерархических справочников.
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Форма.ПолноеИмяОбъекта);
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) И ОбъектМетаданных.Иерархический И ОбъектМетаданных.Владельцы.Количество() > 0 И (НЕ Форма.Элементы.Найти("Дерево")=Неопределено) Тогда
		
		ЭлементОтбора = Форма.Дерево.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Владелец");
		ЭлементОтбора.Использование  = Истина;
		
		Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") И Параметры.Отбор.Владелец <> Неопределено Тогда
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Параметры.Отбор.Владелец;
		Иначе
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
		КонецЕсли;
		
	КонецЕсли;
	
	// Для режима выбора, произведем настройку элементов управления формы
	Если Форма.Элементы.Список.РежимВыбора Тогда
		
		// Произведем настройку основных параметров формы
		Форма.КлючСохраненияПоложенияОкна = Форма.КлючОбъекта;
		Форма.КлючНазначенияИспользования = Форма.КлючОбъекта;
		Форма.РежимОткрытияОкна           = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		
		// При выборе не нужно сохранять и загружать настройки пользователя, они будут только мешать.
		Форма.Список.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
		
		// Форме списка справочника в режиме выбора ограничим возможность выделения только одной строки.
		Форма.Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
		
		// В режиме выбора скроем помеченные на удаление элементы
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Форма.Список,
			"ПометкаУдаления",
			Ложь,
			,
			,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
			
	Иначе
			
		Если ПравоПользователя("НеОтображатьПомеченныеНаУдалениеЭлементыСправочниковВСписках") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Форма.Список,
			"ПометкаУдаления",
			Ложь,
			,
			,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
		КонецЕсли;		
	КонецЕсли;
	
	// Произведем настройку основного динамического списка формы
	ЗащищенныеФункцииСервер.НастроитьОсновнойДинамическийСписокФормы(Форма);
	
	// Производим инициализацию элементов расширенной информации
	Если НЕ Форма.Элементы.Найти("СтраницыРасширеннаяИнформация")=Неопределено Тогда
		
		// В режиме выбора по умолчанию поле расширенной информации должно быть скрыто
		Если Форма.Элементы.Список.РежимВыбора Тогда
			Форма.Элементы.СтраницыРасширеннаяИнформация.Видимость = ЛОЖЬ;
			Форма.Элементы.ПоказатьРасширеннуюИнформацию.Пометка   = ЛОЖЬ;
		КонецЕсли;
		
	КонецЕсли;
	
	// Производим обновление отображения заголовка формы
	УстановитьЗаголовокСпискаСправочника(Форма);
	
	// Стандартные подсистемы - Версионирование объектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(Форма);
	
	// подключаемые команды
	ПодключаемыеКоманды.ПриСозданииНаСервере(Форма, Неопределено, Истина);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат (НЕ Отказ);
	
КонецФункции // ПриСозданииНаСервере()

// Общий обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  Форма             - УправляемаяФорма - Форма, в которой возникло событие.
//  ИмяСобытия        - Строка           - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура        - Набор параметров, использующихся при выполнения операции.
//
Функция ОбработкаОповещения(Форма, ИмяСобытия, ПараметрыДействия=Неопределено, Объект =Неопределено) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Обработаем в зависимости от 
	Если ПараметрыДействия.Свойство("ШтрихКод") Тогда
		
		Если ПараметрыДействия.ШтрихКод = "" Тогда
			Возврат Истина;
		КонецЕсли;
		
		// поиск объектов по штрихкоду
		ОбъектыПоШтрихкоду = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(ПараметрыДействия.ШтрихКод,,Истина);
		ПараметрыДействия.Вставить("ОбъектыПоШтрихкоду",ОбъектыПоШтрихкоду);
		ШтрихкодированиеВызовСервера.ОбработкаОбъектовПоШтрихкоду(ПараметрыДействия, Форма, Объект);
		
	ИначеЕсли ПараметрыДействия.Свойство("КодКарты") Тогда
		
		РезультатПоиска = ШтрихкодированиеВызовСервера.ПолучитьКарточкуПоКоду(ПараметрыДействия.КодКарты);
		
		Если РезультатПоиска=Неопределено Тогда
			ВывестиСообщение(НСтр("ru = 'Не найдена карточка по считанному коду: %1'"), , , , , ПараметрыДействия.КодКарты);
			Возврат ЛОЖЬ;
		КонецЕсли;
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(РезультатПоиска.Объект));
		ПараметрыДействия.Вставить("ИмяФормыСписка", ОбъектМетаданных.ПолноеИмя()+".ФормаСписка");
		ПараметрыДействия.Вставить("НайтиОбъект",     РезультатПоиска.Объект);
		ПараметрыДействия.Вставить("РезультатПоиска", РезультатПоиска);
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаОповещения()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Форма     - УправляемаяФорма - Форма, в которой возникло событие.
//  Настройки - Соответствие     - Значения сохраняемых реквизитов и настроек формы.
//
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Форма, Настройки) Экспорт
	
	// Производим сохранение параметра отображения дерева элементов
	Если НЕ Форма.Элементы.Найти("Дерево")=Неопределено Тогда
		Настройки.Вставить("ДеревоВидимость", Форма.Элементы.Дерево.Видимость);
	КонецЕсли;
	
	// Производим сохранение параметра отображения страниц расширенной информации
	Если НЕ Форма.Элементы.Найти("СтраницыРасширеннаяИнформация")=Неопределено Тогда
		Настройки.Вставить("СтраницыРасширеннаяИнформацияВидимость", Форма.Элементы.СтраницыРасширеннаяИнформация.Видимость);
	КонецЕсли;
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Общий обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек.
//
// Параметры:
//  Форма     - УправляемаяФорма - Форма, в которой возникло событие.
//  Настройки - Соответствие     - Значения сохраненных реквизитов и настроек формы.
//
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Форма, Настройки) Экспорт
	
	// Восстанавливаем параметры отображения дерева элементов
	Если НЕ(Форма.Элементы.Найти("Дерево")=Неопределено ИЛИ Настройки.Получить("ДеревоВидимость")=Неопределено) Тогда
		
		// Получим значение сохраненной настройки
		ПоказатьДерево = (НЕ Настройки.Получить("ДеревоВидимость")=ЛОЖЬ);
		
		// Произведем настройку параметров отображения полей расширенной информации
		Форма.Элементы.Дерево.Видимость       = ПоказатьДерево;
		Форма.Элементы.ПоказатьДерево.Пометка = ПоказатьДерево;
		
	КонецЕсли;
	
	// Восстанавливаем параметры отображения страниц расширенной информации
	Если НЕ(Форма.Элементы.Найти("СтраницыРасширеннаяИнформация")=Неопределено ИЛИ Настройки.Получить("СтраницыРасширеннаяИнформацияВидимость")=Неопределено) Тогда
		
		// Получим значение сохраненной настройки
		ПоказатьРасширеннуюИнформацию = (НЕ Настройки.Получить("СтраницыРасширеннаяИнформацияВидимость")=ЛОЖЬ);
		
		// Произведем настройку параметров отображения полей расширенной информации
		Форма.Элементы.СтраницыРасширеннаяИнформация.Видимость = ПоказатьРасширеннуюИнформацию;
		Форма.Элементы.ПоказатьРасширеннуюИнформацию.Пометка   = ПоказатьРасширеннуюИнформацию;
		
	КонецЕсли;
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДИНАМИЧЕСКОГО СПИСКА ФОРМЫ

// Общий обработчик события возникающего при активизации строки списка.
//
// Параметры:
//  Форма   - УправляемаяФорма - Форма, в которой возникло событие.
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
Процедура СписокПриАктивизацииСтроки(Форма, Элемент) Экспорт
	
	// Производим подключение обработчика обновления содержимого поля расширенной информации.
	РасширеннаяИнформацияВызовСервера.СписокПриАктивизацииСтроки(Форма, Элемент.ТекущаяСтрока);
	
	// Установим доступность и видимость команд печати
	ЗащищенныеФункцииСервер.УстановитьПараметрыКомандПечати(Форма, Элемент.ТекущаяСтрока);
	
КонецПроцедуры // СписокПриАктивизацииСтроки()

// Общий обработчик события возникающего на сервере при сохранении пользовательских настроек формы списка.
//
// Параметры:
//  Форма     - УправляемаяФорма - Форма, в которой возникло событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Восстанавливаемые настройки. 
//
Процедура СписокПриСохраненииПользовательскихНастроекНаСервере(Форма, Настройки) Экспорт
	
	Зарезервировано = ИСТИНА;
	
КонецПроцедуры // СписокПриСохраненииПользовательскихНастроекНаСервере()

// Общий обработчик события возникающего на сервере при загрузке пользовательских настроек формы списка.
//
// Параметры:
//  Форма     - УправляемаяФорма - Форма, в которой возникло событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Восстанавливаемые настройки. 
//
Процедура СписокПриЗагрузкеПользовательскихНастроекНаСервере(Форма, Настройки) Экспорт
	
	Зарезервировано = ИСТИНА;
	
КонецПроцедуры // СписокПриЗагрузкеПользовательскихНастроекНаСервере()

// Общий обработчик события сохранения настроек формы списка справочников.
//
// Параметры:
//   Форма     - Управляемая форма, форма переданного списка справочников.
//   Настройки - Соответствие, коллекция настроек формы.
//
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(Форма, СтандартнаяОбработка=ИСТИНА) Экспорт
	
	Зарезервировано = ИСТИНА;
	
	// установим представление для отбора ПометкаУдаления.
	Для Каждого Элемент Из Форма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ОтборКомпоновкиДанных") Тогда
			Для Каждого Строка Из Элемент.Элементы Цикл
				Если Строка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления") Тогда
					Строка.Представление = НСтр("ru = 'Пометка удаления'");
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // СписокПриОбновленииСоставаПользовательскихНастроекНаСервере()

// Общий обработчик события вызывается на сервере после получения данных динамическим списком.
//
// Параметры:
//  ИмяЭлемента - Строка - Содержит имя таблицы формы, из которой вызван обработчик события.
//  Настройки   - НастройкиКомпоновкиДанных - Содержит копию полных настроек динамического списка.
//  Строки      - СтрокиДинамическогоСписка - Данные и оформление всех строк, получаемых в списке.
//
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки) Экспорт
	
	Зарезервировано = ИСТИНА;
	
КонецПроцедуры // СписокПриПолученииДанныхНаСервере()
