
&НаКлиенте
// Функция проверяет отправлено ли сообщение по его состоянию
//
// Параметры:
//	Состояние	- ПеречислениеСсылка	- Состояние сообщения
//
// Возвращаемое значение:
//	Булево	- Признак отправки сообщения
//
Функция смсСообщениеОтправлено(Состояние)
	Если Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументаСообщениеSMS.Черновик") Тогда
		Возврат Ложь;
	ИначеЕсли Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументаСообщениеSMS.Исходящее") Тогда
		Возврат Ложь;
	ИначеЕсли Состояние = ПредопределенноеЗначение("Перечисление.СостоянияДокументаСообщениеSMS.ПустаяСсылка") Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
КонецФункции // смсСообщениеОтправлено()	

&НаКлиенте
// Процедура - обработчик команды
//
// Параметры:
//	ПараметрКоманды				- ДокументСсылка	- Сообщение СМС
//	ПараметрыВыполненияКоманды	- Структура			- Структура параметров команды
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если смсСообщениеОтправлено(ПараметрыВыполненияКоманды.Источник.Объект.Состояние) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Команда недоступна (сообщение уже отправлено)'"));
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",			Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",	Ложь);
	ПараметрыФормы.Вставить("МножественныйВыбор",	Ложь);
	ОткрытьФорму("ОбщаяФорма.смсФормаАдреснаяКнига", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность, ВариантОткрытияОкна.ОтдельноеОкно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры // ОбработкаКоманды()
