
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("АлкогольнаяПродукция", ПараметрКоманды));
	ПараметрыФормы.Вставить("СкрыватьОбъект");
	ПараметрыФормы.Вставить("ЗакрепитьСПрава");
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	Массив = Новый Массив;
	Массив.Добавить("Объект");
	ПараметрыФормы.Вставить("ЗаблокированныеПоля", Массив);
	
	ОткрытьФорму(
		"РегистрСведений.СоответствиеНоменклатурыЕГАИС.ФормаСписка",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);

	
КонецПроцедуры
