// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// См. ИнтеграцияЦентраЭДО.ПараметрыВыполненияМетодаСервиса
Функция ПараметрыВыполненияМетодаСервиса(УчетнаяЗаписьЦентраЭДО, Пользователь = Неопределено) Экспорт
	Возврат ИнтеграцияЦентраЭДО.ПараметрыВыполненияМетодаСервиса(УчетнаяЗаписьЦентраЭДО, Пользователь);
КонецФункции

// См. ИнтеграцияЦентраЭДО.ИнформацияОПриложении
Функция ИнформацияОПриложении() Экспорт
	Возврат ИнтеграцияЦентраЭДО.ИнформацияОПриложении();
КонецФункции

// См. ИнтеграцияЦентраЭДО.ПараметрыСинхронизацииОбъекта
Функция ПараметрыСинхронизацииОбъекта(Ссылка) Экспорт
	
	Возврат ИнтеграцияЦентраЭДО.ПараметрыСинхронизацииОбъекта(Ссылка);
	
КонецФункции

#КонецОбласти
