// Общий модуль "Расширенная информация (клиент)"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ФОРМЫ ДОКУМЕНТА

// Общий обработчик события возникающего при нажатии на кнопку "Показать расширенную информацию".
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//
Процедура ПоказатьРасширеннуюИнформацию(Форма) Экспорт
	
	// Определим новое значение статуса отображения расширенной информации
	ПоказатьРасширеннуюИнформацию = (НЕ Форма.Элементы.РасширеннаяИнформация.Видимость);
	
	// Произведем настройку параметров отображения полей расширенной информации
	Форма.Элементы.РасширеннаяИнформация        .Видимость = ПоказатьРасширеннуюИнформацию;
	Форма.Элементы.ПоказатьРасширеннуюИнформацию.Пометка   = ПоказатьРасширеннуюИнформацию;
	
	// Взведем признак необходимости выполнить сохранение настроек формы при закрытии
	Форма.СохраняемыеВНастройкахДанныеМодифицированы = ИСТИНА;
	
	// Обновим информации по строке
	Форма.ПодключитьОбработчикОжидания("Подключаемый_СписокПриАктивизацииСтроки", 0.5, ИСТИНА);
		
КонецПроцедуры // ПоказатьРасширеннуюИнформацию()

// Общий обработчик события возникающего на клиенте при нажатии на поле "Расширенная информация".
//
// Параметры:
//  Форма                - УправляемаяФорма       - Форма, в которой возникло событие.
//  Элемент              - ПолеФормы              - Элемент управления, в котором возникло данное событие.
//  ДанныеСобытия        - ФиксированнаяСтруктура - Параметр заполняется фиксированной структурой со свойствами:
//                         Anchor, Element, Button, Event, Document, Href.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ПриНажатии(Форма, Элемент, ДанныеСобытия, СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Обработаем в зависимости от вида нажатой гиперссылки
	Если НЕ ДанныеСобытия.Anchor = Неопределено Тогда
		Если ДанныеСобытия.Anchor.name = "НастройкаПолейОтображения" Тогда
			Если Лев(Форма.ПолноеИмяОбъекта, 16) = "ЖурналДокументов" И НЕ Форма.Элементы.Список.ТекущаяСтрока = Неопределено Тогда
				ОткрытьФорму("Обработка.НастройкаПоляРасширеннойИнформации.Форма", Новый Структура("ПолноеИмяОбъекта,СсылкаНаОбъект", Форма.ПолноеИмяОбъекта, Форма.Элементы.Список.ТекущаяСтрока),Форма);
			Иначе
				ОткрытьФорму("Обработка.НастройкаПоляРасширеннойИнформации.Форма", Новый Структура("ПолноеИмяОбъекта", Форма.ПолноеИмяОбъекта),Форма);
			КонецЕсли;
		ИначеЕсли ДанныеСобытия.Anchor.name = "НастройкаПечати" Тогда
			ДанныеСобытия.Document.execCommand("Print")
		КонецЕсли;
	ИначеЕсли НЕ ЗначениеЗаполнено(ДанныеСобытия.href) Тогда
		// Клик по пустому полю
	Иначе
		Попытка
			ПерейтиПоНавигационнойСсылке(ДанныеСобытия.href);
		Исключение
			ТехнологическаяПлатформаВызовСервера.СделатьЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка перехода по ссылке'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()) + " " + СокрЛП(ДанныеСобытия.href), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры // ПриНажатии()


