#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура обработки печати.
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_УПД") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_УПД",
															НСтр("ru = 'Универсальный передаточный документ'"),
															ПечатьУПДОбщая(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьУПДОбщая(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УПДОбщая";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;

	ПервыйДокумент = Истина; 
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ФорматВыводаСуммы      = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		ФорматВыводаКоличества = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Документ);
		
		ВыводитьКодТНВЭД      = ПравоПользователя("ВыводитьКодТНВЭД");
		
		// Зададим параметры макета
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабличныйДокумент.АвтоМасштаб		 = Истина;
		
		// Получим данные из документа.
		ДанныеДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ).ПолучитьДанныеДляПечатиУПД(Документ);
		Если ЗначениеЗаполнено(ДанныеДокумента) Тогда 
			
			ВыводитьКодВидаТовара = (ДанныеДокумента.Дата >= Дата('20171001'));
			Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьУПД.ПФ_MXL_УПД");
			
			ОбластьЗаголовок        = Макет.ПолучитьОбласть("Шапка");
			ОбластьЗаголовокТаблицы	= Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
			ОбластьИтого			= Макет.ПолучитьОбласть("Итого");
			ОбластьПодвал      		= Макет.ПолучитьОбласть("Подвал");
			ОбластьПодвалНакладной  = Макет.ПолучитьОбласть("ПодвалНакладной");
			
			ОбластьЗаголовок.Параметры.Заполнить(ДанныеДокумента);
			ОбластьЗаголовок.Параметры.СтатусУПД = ДанныеДокумента.Статус;
			Статус = ДанныеДокумента.Статус;
			
			
			ВыборкаТабличнойЧасти = ДанныеДокумента.Товары;
			КоличествоСтрок =  ВыборкаТабличнойЧасти.Количество();
			
			Если Статус = 1 Тогда
				Если ДанныеДокумента.ХозОперация = Справочники.ХозОперации.СчетФактураВыданный Тогда
					ОбластьЗаголовок.Параметры.Номер    = ДанныеДокумента.Номер;
					ОбластьЗаголовок.Параметры.Дата 	= Формат(ДанныеДокумента.Дата, "ДЛФ=DD");
					ОбластьЗаголовок.Параметры.НомерИсправления = "--";
					ОбластьЗаголовок.Параметры.ДатаИсправления 	= "--";
				Иначе
					ОбластьЗаголовок.Параметры.НомерИсправления = ДанныеДокумента.НомерИсправления;
					ОбластьЗаголовок.Параметры.ДатаИсправления = Формат(ДанныеДокумента.Дата, "ДЛФ=DD");
					// Найдем изначальную счет фактуру.
					ДокументОсн = ДанныеДокумента.ДокументОснование;
					Пока ТипЗнч(ДокументОсн) = Тип("ДокументСсылка.КорректировкаРеализации") Цикл
						ДокументОсн = ДокументОсн.ДокументОснование;
					КонецЦикла;
					
					Запрос = Новый Запрос;
					Запрос.Текст =
					"ВЫБРАТЬ
					|	СчетФактураВыданный.Ссылка
					|ИЗ
					|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
					|ГДЕ
					|	СчетФактураВыданный.ДокументОснование = &ДокументОсн";
					Запрос.УстановитьПараметр("ДокументОсн",ДокументОсн);
					ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
					
					Если ВыборкаЗапроса.Следующий() Тогда 
						ОбластьЗаголовок.Параметры.Номер = 
							УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(ВыборкаЗапроса.Ссылка.ПолучитьОбъект());
						ОбластьЗаголовок.Параметры.Дата = Формат(ВыборкаЗапроса.Ссылка.Дата, "ДЛФ=DD");
					Иначе
						ОбластьЗаголовок.Параметры.Номер    = "--";
						ОбластьЗаголовок.Параметры.Дата = "--";
					КонецЕсли;
				КонецЕсли;
			Иначе
				// Заполним номер и дату
				ОбластьЗаголовок.Параметры.Номер			  = ДанныеДокумента.Номер;
				ОбластьЗаголовок.Параметры.Дата			  = Формат(ДанныеДокумента.Дата, "ДЛФ=DD");
				ОбластьЗаголовок.Параметры.НомерИсправления = "--";
				ОбластьЗаголовок.Параметры.ДатаИсправления  = "--";
			КонецЕсли;
			
			ОбластьЗаголовок.Параметры.Валюта = 
					?(ЗначениеЗаполнено(ДанныеДокумента.ВалютаДокумента.НаименованиеПолное), 
							ДанныеДокумента.ВалютаДокумента.НаименованиеПолное, ДанныеДокумента.ВалютаДокумента.Наименование) 
							+ ", " + ДанныеДокумента.ВалютаДокумента.Код;
			ОбластьЗаголовок.Параметры.Поставщик				= ДанныеДокумента.Поставщик;
			ОбластьЗаголовок.Параметры.ПредставлениеПоставщика	= 
					УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Поставщик, 
							Новый Структура("Наименование"," "));
			ОбластьЗаголовок.Параметры.АдресПоставщика	= 
					УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Поставщик, 
							Новый Структура("АдресЮридический"," "),Истина);
			ОбластьЗаголовок.Параметры.АдресПоставщика = 
				?(ЗначениеЗаполнено(ОбластьЗаголовок.Параметры.АдресПоставщика), ОбластьЗаголовок.Параметры.АдресПоставщика, "--");
			ОбластьЗаголовок.Параметры.ИННПоставщика = 
				?(ЗначениеЗаполнено(ДанныеДокумента.Поставщик.ИНН),ДанныеДокумента.Поставщик.ИНН, "--") 
				+"/"+?(ЗначениеЗаполнено(ДанныеДокумента.Поставщик.КПП), ДанныеДокумента.Поставщик.КПП, "--");
			
			ОбластьЗаголовок.Параметры.Грузоотправитель				= ДанныеДокумента.Грузоотправитель;
			Если ТипЗнч(ОбластьЗаголовок.Параметры.Грузоотправитель)=Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
				ОргДляСравнения=ОбластьЗаголовок.Параметры.Грузоотправитель.Организация;
			Иначе
				ОргДляСравнения=ОбластьЗаголовок.Параметры.Грузоотправитель;
			КонецЕсли;
			Если ОргДляСравнения = ДанныеДокумента.Поставщик Тогда
				ОбластьЗаголовок.Параметры.ПредставлениеГрузоотправителя	= НСтр("ru = 'он же'");
			Иначе
				ОбластьЗаголовок.Параметры.ПредставлениеГрузоотправителя	= 
					УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Грузоотправитель, 
							Новый Структура("Наименование,АдресФактический"," ",""));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеДокумента.Грузополучатель) Тогда 
				ОбластьЗаголовок.Параметры.Грузополучатель	= ДанныеДокумента.Грузополучатель;
				ОбластьЗаголовок.Параметры.ПредставлениеГрузополучателя = 
					УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Грузополучатель,
							Новый Структура("Наименование,АдресФактический"," ",""));
			КонецЕсли;	
			
			Если КоличествоСтрок>0 Тогда
				ЕстьТовары=Ложь;
				Для Каждого СтрокаТоваров Из ВыборкаТабличнойЧасти Цикл
					Если ТипЗнч(СтрокаТоваров.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
						Если СтрокаТоваров.Номенклатура.ВидНоменклатуры<>Перечисления.ВидыНоменклатуры.Услуга Тогда
							ЕстьТовары=Истина; Прервать;
						КонецЕсли; 
					КонецЕсли;
				КонецЦикла;
				Если НЕ ЕстьТовары Тогда
					ОбластьЗаголовок.Параметры.ПредставлениеГрузоотправителя = "--";
					ОбластьЗаголовок.Параметры.ПредставлениеГрузополучателя = "--";
				КонецЕсли; 
			КонецЕсли;
			
			Если Статус = 1 Тогда
				ОбластьЗаголовок.Параметры.ПоДокументу = ?(ЗначениеЗаполнено(ДанныеДокумента.ПлатежноРасчетныеДокументы), ДанныеДокумента.ПлатежноРасчетныеДокументы, "--");
			КонецЕсли;
			ОбластьЗаголовок.Параметры.Покупатель	= ДанныеДокумента.Покупатель;
			ОбластьЗаголовок.Параметры.ПредставлениеПокупателя = 
				УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Покупатель,
						Новый Структура("Наименование",""));
			ОбластьЗаголовок.Параметры.АдресПокупателя = 
				УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(ОбластьЗаголовок.Параметры.Покупатель,
						Новый Структура("АдресЮридический",""));
			ОбластьЗаголовок.Параметры.ИННПокупателя = ?(ЗначениеЗаполнено(ДанныеДокумента.Покупатель.ИНН), 
				ДанныеДокумента.Покупатель.ИНН, "--") +"/"+?(ЗначениеЗаполнено(ДанныеДокумента.Покупатель.КПП), 
				ДанныеДокумента.Покупатель.КПП, "--");
			
			// Если дата документа позднее 01.07.2017.
			Если ВыводитьКодВидаТовара Тогда
				ОбластьЗаголовок.Параметры.Редакция = 
					НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 19 августа 2017 № 981)'");
			ИначеЕсли ДанныеДокумента.Дата >= Дата('20170701') Тогда
				ОбластьЗаголовок.Параметры.Редакция = 
					НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 25 мая 2017 г. № 625)'");
			КонецЕсли;
			
			// Выводим область.
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			// Если дата документа позднее 01.07.2017.
			Если ДанныеДокумента.Дата >= Дата('20170701') Тогда
				ОбластьШапкаИдГосКонтракта = Макет.ПолучитьОбласть("ШапкаИдГосКонтракта");
				ЗаголовокИдентификатораГосударственногоКонтракта = 
						НСтр("ru = 'Идентификатор государственного контракта, договора (соглашения)'") 
						+ ?(ВыводитьКодВидаТовара, " (" + НСтр("ru = 'при наличии'") + ")", "")+": ";
						
				ОбластьШапкаИдГосКонтракта.Параметры.ИдентификаторГосударственногоКонтракта = 
					ЗаголовокИдентификатораГосударственногоКонтракта + ДанныеДокумента.ИдентификаторГосударственногоКонтракта;
				ТабличныйДокумент.Вывести(ОбластьШапкаИдГосКонтракта);
			КонецЕсли;
			
			ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			// Уберем колонку, вывод которой утвержден с 1 октября 2017 г.
			ОбластьКодВидаТовара = Макет.Область("КодВидаТовара");
			Если НЕ ВыводитьКодВидаТовара Тогда
				
				НовыйТекст = ОбластьЗаголовокТаблицы.Область(3,ОбластьКодВидаТовара.Лево-1,4,ОбластьКодВидаТовара.Лево-1).Текст;
				
				ОбластьВыреза = ОбластьЗаголовокТаблицы.Область(3,ОбластьКодВидаТовара.Лево-1,4,ОбластьКодВидаТовара.Право);
				ОбластьВыреза.Объединить();
				ОбластьВыреза.Текст = НовыйТекст;
				
				ОбластьВыреза = ОбластьЗаголовокТаблицы.Область(5,ОбластьКодВидаТовара.Лево-1,5,ОбластьКодВидаТовара.Право);
				ОбластьВыреза.Объединить();
				
				ОбластьЗаголовокТаблицы.Параметры.ТекстНомерТаможеннойДекларации = НСтр("ru = 'Номер таможенной декларации'");
				
			Иначе
				
				ОбластьЗаголовокТаблицы.Параметры.ТекстНомерТаможеннойДекларации = 
						НСтр("ru = 'Регистрацион- ный номер таможенной декларации'");
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
			Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
			Область = ТабличныйДокумент.Область(?(ДанныеДокумента.Дата >= Дата('20170701'),"R17","R16"));
			ТабличныйДокумент.УдалитьОбласть(Область, Смещать); 
			НомерСтраницы	= 2;
			НомерСтраницыПред = НомерСтраницы;
			
			// Заполним параметры шапки таблицы для следующего листа
			ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы  = "Лист" + " " + НомерСтраницы;
			Если ОбластьЗаголовок.Параметры.Номер <> "--" И ОбластьЗаголовок.Параметры.Дата <> "--" Тогда
				ОбластьЗаголовокТаблицы.Параметры.ТекстЗаголовка = НСтр("ru = 'Универсальный передаточный документ'") + " № " 
						+ ОбластьЗаголовок.Параметры.Номер+" от "+ОбластьЗаголовок.Параметры.Дата;
			Иначе
				ОбластьЗаголовокТаблицы.Параметры.ТекстЗаголовка = НСтр("ru = 'Универсальный передаточный документ'") + " № " 
						+ ОбластьЗаголовок.Параметры.НомерИсправления+" от "+ОбластьЗаголовок.Параметры.ДатаИсправления;
			КонецЕсли;
			
			// Уберем колонку, вывод которой утвержден с 1 октября 2017 г.
			Если НЕ ВыводитьКодВидаТовара Тогда
				НовыйПараметр = ОбластьСтрока.Область(1,ОбластьКодВидаТовара.Лево-1,1,ОбластьКодВидаТовара.Лево-1).Параметр;
				ОбластьВыреза = ОбластьСтрока.Область(1,ОбластьКодВидаТовара.Лево-1,1,ОбластьКодВидаТовара.Право);
				ОбластьВыреза.Объединить();
				ОбластьВыреза.Параметр = НовыйПараметр;
			КонецЕсли;
			
			СуммаБезНДС = 0;
			СуммаНДС = 0;
			Итого = 0;
			НомерСтраницы = 1;
			НомерСтраницыПред = НомерСтраницы;
			СтруктураИтоговПоСтранице = Новый Структура("Сумма", 0);
			
			Если ВыборкаТабличнойЧасти.Количество() > 0 Тогда
				Для Каждого ТекСтрока Из ВыборкаТабличнойЧасти Цикл
					ОбластьСтрока.Параметры.Заполнить(ТекСтрока);
					Если НЕ ЕстьРеквизит(ВыборкаТабличнойЧасти, "ГТД") ИЛИ НЕ ЗначениеЗаполнено(ТекСтрока.ГТД) Тогда
						ОбластьСтрока.Параметры.ПредставлениеГТД	= "--";
						ОбластьСтрока.Параметры.ПредставлениеСтраны	= "--";
						ОбластьСтрока.Параметры.СтранаПроисхожденияКод = "--";
					Иначе
						ОбластьСтрока.Параметры.ПредставлениеГТД	= 
							УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(ТекСтрока.ГТД);
						ОбластьСтрока.Параметры.ПредставлениеСтраны	= ТекСтрока.ГТД.Страна.Наименование;
						ОбластьСтрока.Параметры.СтранаПроисхожденияКод = ТекСтрока.ГТД.Страна.Код;
					КонецЕсли;
					Если ТипЗнч(ТекСтрока.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
						ОбластьСтрока.Параметры.ТоварКод = ТекСтрока.Номенклатура.Артикул;
						Если ВыводитьКодВидаТовара Тогда
							КодТНВЭД = ТекСтрока.Номенклатура.КодТНВЭД;
							Если ЗначениеЗаполнено(КодТНВЭД) И ВыводитьКодТНВЭД Тогда
								ОбластьСтрока.Параметры.КодВидаТовара = СокрЛП(КодТНВЭД);
							Иначе
								ОбластьСтрока.Параметры.КодВидаТовара = "--";
							КонецЕсли;
						КонецЕсли;
					Иначе
						Если ВыводитьКодВидаТовара Тогда
							ОбластьСтрока.Параметры.КодВидаТовара = "--";
						КонецЕсли;
					КонецЕсли;
					Если ЕстьРеквизит(ВыборкаТабличнойЧасти, "ТоварНаименование") Тогда
						Наименование = ТекСтрока.ТоварНаименование;
					Иначе
						Наименование = ?(ЗначениеЗаполнено(ТекСтрока.Номенклатура.НаименованиеПолное), 
								ТекСтрока.Номенклатура.НаименованиеПолное, ТекСтрока.Номенклатура.Наименование);
					КонецЕсли;
					Если Документ.Дата >= Дата(2016, 07, 01) И НЕ ВыводитьКодВидаТовара Тогда
						Если ЕстьРеквизит(СтрокаТоваров.Номенклатура, "КодТНВЭД") Тогда
							Если СтрокаТоваров.СтавкаНДС = Справочники.СтавкиНДС.БезНДС 
								И СокрЛП(СтрокаТоваров.Номенклатура.КодТНВЭД) <> "" Тогда
								
								Наименование = Наименование + ", " + НСтр("ru='код ТН ВЭД'") + " " + СтрокаТоваров.Номенклатура.КодТНВЭД;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					ОбластьСтрока.Параметры.ТоварНаименование = Наименование;
					
					Если ЕстьРеквизит(ТекСтрока.Номенклатура, "ВидНоменклатуры") И ТекСтрока.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга Тогда
						ОбластьСтрока.Параметры.ЕдиницаИзмеренияКод  = ТекСтрока.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
						ОбластьСтрока.Параметры.ЕдиницаИзмерения     = ТекСтрока.ЕдиницаИзмерения;
					Иначе
						ОбластьСтрока.Параметры.ЕдиницаИзмеренияКод          = "--";
						ОбластьСтрока.Параметры.ЕдиницаИзмерения = "--";
					КонецЕсли;
					
					ОбластьСтрока.Параметры.Акциз = НСтр("ru = 'без акциза'");
					ОбластьСтрока.Параметры.Всего =  ТекСтрока.СуммаВсего;
					
					ОбластьСтрока.Параметры.Стоимость = ТекСтрока.СуммаВсего - ТекСтрока.СуммаНДС;
					ОбластьСтрока.Параметры.Цена = ?(ТекСтрока.Количество <> 0, ОбластьСтрока.Параметры.Стоимость/ТекСтрока.Количество, 0);
					
					СуммаБезНДС = ОбластьСтрока.Параметры.Стоимость + СуммаБезНДС;
					СуммаНДС = ТекСтрока.СуммаНДС + СуммаНДС;
					
					Итого = ТекСтрока.СуммаВсего + Итого;
					
					// Выводим строку, делая проверку попадания на лист.
					НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока,
										ОбластьЗаголовокТаблицы,, НомерСтраницы, , Документ,);
					
					// Инициализация итогов по странице.
					Если НомерСтраницы <> НомерСтраницыПред Тогда
						НомерСтраницыПред = НомерСтраницы;
						ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница:" + " " + НомерСтраницы; 
					КонецЕсли;
					
					
				КонецЦикла;
			КонецЕсли;
			
			ОбластьИтого.Параметры.ИтогоСтоимость = СуммаБезНДС;
			ОбластьИтого.Параметры.ИтогоСуммаНДС = СуммаНДС;
			ОбластьИтого.Параметры.ИтогоВсего = Итого;
			ТабличныйДокумент.Вывести(ОбластьИтого);
			
			// Заполним информацию о руководителях организации.
			Если ДанныеДокумента.Организация.ФормаСобственности =
					Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель Тогда
					
				ОбластьПодвал.Параметры.ФИОПБОЮЛ = ДанныеДокумента.Руководитель.Руководитель;
				ОбластьПодвал.Параметры.Свидетельство = 
				Справочники.ПодтверждающиеДокументы.ПолучитьПодтверждающийДокументОбъектаПоВиду(ДанныеДокумента.Поставщик,
																						Перечисления.ВидыДокументов.Свидетельство);
			Иначе
				ОбластьПодвал.Параметры.ФИОРуководителя = ДанныеДокумента.Руководитель.Руководитель;
			КонецЕсли;
			ОбластьПодвал.Параметры.ФИОГлавногоБухгалтера = ДанныеДокумента.ГлавныйБухгалтер.ГлавныйБухгалтер;
			ОбластьПодвал.Параметры.КоличествоЛистов = НСтр("ru = 'Документ 
			|составлен на'")
			+ Символы.ПС + ТабличныйДокумент.КоличествоСтраниц() + " " + "листах";
			
			ОбластьПодвал.Параметры.ТекстИндивидуальныйПредприниматель =
				?(ВыводитьКодВидаТовара,НСтр("ru = 'Индивидуальный предприниматель или иное уполномоченное лицо'"), 
										НСтр("ru = 'Индивидуальный предприниматель'"));
			
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
			ОбластьПодвалНакладной.Параметры.Основание = ?(ЗначениеЗаполнено(ДанныеДокумента.ДоговорВзаиморасчетов), 
															ДанныеДокумента.ДоговорВзаиморасчетов, "");
			Если ЕстьРеквизит(ДанныеДокумента,"Доверенность") И ЗначениеЗаполнено(ДанныеДокумента.Доверенность) Тогда
				ОбластьПодвалНакладной.Параметры.Основание = ?(НЕ ЗначениеЗаполнено(ОбластьПодвалНакладной.Параметры.Основание),
					"", Строка(ОбластьПодвалНакладной.Параметры.Основание) + ", ") + ДанныеДокумента.Доверенность;
			КонецЕсли;
			ОбластьПодвалНакладной.Параметры.Основание = ?(НЕ ЗначениеЗаполнено(ОбластьПодвалНакладной.Параметры.Основание), 
				"--", ОбластьПодвалНакладной.Параметры.Основание);
			
			ОбластьПодвалНакладной.Параметры.ФИОКладовщика = ДанныеДокумента.Отпустил.Отпустил;
			ОбластьПодвалНакладной.Параметры.ФИОКладовщика = 
				?(ЗначениеЗаполнено(ОбластьПодвалНакладной.Параметры.ФИОКладовщика), ОбластьПодвалНакладной.Параметры.ФИОКладовщика, "");
			Если Строка(ОбластьПодвалНакладной.Параметры.ФИОКладовщика) <> "" Тогда
				ОбластьПодвалНакладной.Параметры.ДолжностьКладовщика = ДанныеДокумента.Отпустил.ОтпустилДолжность;
			Иначе
				ОбластьПодвалНакладной.Параметры.ДолжностьКладовщика = "";
			КонецЕсли;
			ОбластьПодвалНакладной.Параметры.ДатаОтгрузкиПередачи = ДанныеДокумента.ДатаОтгрузки;
			
			Если НЕ ЗначениеЗаполнено(ОбластьПодвалНакладной.Параметры.ДатаОтгрузкиПередачи) Тогда
				ОбластьПодвалНакладной.Параметры.ДатаОтгрузкиПередачи = ДанныеДокумента.Дата;
			КонецЕсли;
			ОбластьПодвалНакладной.Параметры.ДатаОтгрузкиПередачи = Формат(ОбластьПодвалНакладной.Параметры.ДатаОтгрузкиПередачи, "ДЛФ=ДД");
			
			ОбластьПодвалНакладной.Параметры.ПредставлениеОрганизации = ОбластьЗаголовок.Параметры.ПредставлениеПоставщика 
					+", " + "ИНН/КПП" +" "+ОбластьЗаголовок.Параметры.ИННПоставщика;
			Если ЕстьРеквизит(ДанныеДокумента,"Получил") Тогда
				ОбластьПодвалНакладной.Параметры.ФИОГрузополучателя = ДанныеДокумента.Получил.Получил;
			КонецЕсли;
			ОбластьПодвалНакладной.Параметры.ФИОГрузополучателя = ?(ЗначениеЗаполнено(ОбластьПодвалНакладной.Параметры.ФИОГрузополучателя), 
																		ОбластьПодвалНакладной.Параметры.ФИОГрузополучателя, "");
			Если Строка(ОбластьПодвалНакладной.Параметры.ФИОГрузополучателя) <> "" 
				И ТипЗнч(ОбластьПодвалНакладной.Параметры.ФИОГрузополучателя) <> Тип("Строка") Тогда
				ОбластьПодвалНакладной.Параметры.ДолжностьГрузополучателя =
					Строка(ОбластьПодвалНакладной.Параметры.ФИОГрузополучателя.Должность.Наименование);
			Иначе
				ОбластьПодвалНакладной.Параметры.ДолжностьГрузополучателя = "";
			КонецЕсли;
			
			ОбластьПодвалНакладной.Параметры.ПредставлениеКонтрагента = ОбластьЗаголовок.Параметры.ПредставлениеПокупателя
						+", " + "ИНН/КПП" + " " + ОбластьЗаголовок.Параметры.ИННПокупателя;
			ТабличныйДокумент.Вывести(ОбластьПодвалНакладной);
			
			// отметим конец области документа
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;	
КонецФункции

#КонецЕсли