
#Область ОбработкаЗапроса

Функция НачатьОбработкуЗапроса(ЗапросСервиса, ИмяКоманды, ТипСистемИнтеграции) Экспорт
	
	// Обработка входных параметров.
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("КодРезультата", 200);
	ПараметрыОбработки.Вставить("МассивОшибок", Новый Массив);
	ПараметрыОбработки.Вставить("МетодЗапроса", ЗапросСервиса.HTTPМетод);
	ПараметрыОбработки.Вставить("ОтносительныйURL", ЗапросСервиса.ОтносительныйURL);
	ПараметрыОбработки.Вставить("ВыходныеПараметры", Новый Структура);
	ПараметрыОбработки.Вставить("ИмяКоманды", ИмяКоманды);
	ПараметрыОбработки.Вставить("ТипСистемИнтеграции", ТипСистемИнтеграции);
	
	ПолучитьПараметрыИзЗаголовка(ЗапросСервиса.Заголовки, ПараметрыОбработки, "Заголовок");
	ПолучитьПараметрыИзЗаголовка(ЗапросСервиса.ПараметрыURL, ПараметрыОбработки, "ПараметрАдреса");
	ПолучитьПараметрыИзЗаголовка(ЗапросСервиса.ПараметрыЗапроса, ПараметрыОбработки, "ПараметрЗапроса");
	
	
	Если ПараметрыОбработки.МетодЗапроса = "GET" Тогда
		
		// В соответствии с параметрами получим запрашиваемые данные.
		ОбработатьДанныеЗапроса(Неопределено, ПараметрыОбработки);
		
	ИначеЕсли ПараметрыОбработки.МетодЗапроса = "PUT" 
		ИЛИ ПараметрыОбработки.МетодЗапроса = "POST"
		ИЛИ ПараметрыОбработки.МетодЗапроса = "DELETE" Тогда
		
		// Обработаем входные данные.
		
		// Преобразуем ответ json в структуры данных 1с.
		СтруктураСообщения = ОбработатьТелоЗапроса(ЗапросСервиса, ПараметрыОбработки);
		
		// Преобразуем в рабочую структуру данных.
		ОбработатьДанныеЗапроса(СтруктураСообщения, ПараметрыОбработки);
		
	Иначе
		ЗафиксироватьОшибку(ПараметрыОбработки, 2);
	КонецЕсли;
	
	ТекстОтветаJSON = СформироватьТекстОтвета(ПараметрыОбработки);
	
	Ответ = Новый HTTPСервисОтвет(ПараметрыОбработки.КодРезультата);
	
	Если ЗначениеЗаполнено(ТекстОтветаJSON) Тогда
		Ответ.УстановитьТелоИзСтроки(ТекстОтветаJSON, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ОбработатьТелоЗапроса(ЗапросСервиса, ПараметрыОбработки) Экспорт
	ВходныеПараметры = Неопределено;
	
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ТекстJSON = ЗапросСервиса.ПолучитьТелоКакСтроку("UTF-8");
		
		Если ЗначениеЗаполнено(ТекстJSON) Тогда
			ЧтениеJSON.УстановитьСтроку(ТекстJSON);
			// В результате некоторых команд возможно получение не только команд.
			Если ЭтоJSON(ТекстJSON) Тогда
				ВходныеПараметры = ПрочитатьJSON(ЧтениеJSON,,ПолучитьМассивПолейДат());
			Иначе
				ВходныеПараметры = Новый Структура;
				ВходныеПараметры.Вставить("Текст", ТекстJSON);
			КонецЕсли;
		Иначе
			ТекстJSON = "";
			ВходныеПараметры = Новый Структура;
		КонецЕсли;
		
		ЧтениеJSON.Закрыть();
		
	Исключение
		
		ЗафиксироватьОшибку(ПараметрыОбработки, 1);
		
		ИнфОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ИнфОбОшибке.Описание;
		Пока ИнфОбОшибке.Причина <> Неопределено Цикл
			ИнфОбОшибке = ИнфОбОшибке.Причина;
			ТекстОшибки = ТекстОшибки + "
			|" + ИнфОбОшибке.Описание;
		КонецЦикла;
		ТекстОшибки = "Ошибка выполнения процедуры ""ОбработатьТелоЗапроса"": " + ТекстОшибки;
		Событие = "ЯндексЕда.ЧтениеСообщения";
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		
		
	КонецПопытки;
	
	ЗафиксироватьВСлужебномЛоге(ТекстJSON, ПараметрыОбработки, Ложь);
	
	Возврат ВходныеПараметры;
	
КонецФункции

Процедура ОбработатьДанныеЗапроса(СтруктураСообщения, ПараметрыОбработки)
	
	Если СтруктураСообщения = Неопределено Тогда
		СтруктураСообщения = Неопределено;
	КонецЕсли;
	
	Попытка
		Выполнить(СтрШаблон("Подключаемый_%1(СтруктураСообщения, ПараметрыОбработки)",ПараметрыОбработки.ИмяКоманды));
	Исключение
		
		ИнфОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ИнфОбОшибке.Описание;
		Пока ИнфОбОшибке.Причина <> Неопределено Цикл
			ИнфОбОшибке = ИнфОбОшибке.Причина;
			ТекстОшибки = ТекстОшибки + "
			|" + ИнфОбОшибке.Описание;
		КонецЦикла;
		ТекстОшибки = "Ошибка выполнения процедуры ""ОбработатьДанныеЗапроса"": " + ТекстОшибки;
		Событие = "ЯндексЕда.ЧтениеСообщенияЗаказа";
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		
		ЗафиксироватьОшибку(ПараметрыОбработки, 3);
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Функция СформироватьТекстОтвета(ПараметрыОбработки)
	
	Результат = "";
	
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON( , Символы.Таб);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
		ЗаписатьJSON(ЗаписьJSON, ПараметрыОбработки.ВыходныеПараметры,,"ПреобразоватьВJSON",СистемыИнтеграции);
		Результат = ЗаписьJSON.Закрыть();
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ИнфОбОшибке.Описание;
		Пока ИнфОбОшибке.Причина <> Неопределено Цикл
			ИнфОбОшибке = ИнфОбОшибке.Причина;
			ТекстОшибки = ТекстОшибки + "
			|" + ИнфОбОшибке.Описание;
		КонецЦикла;
		ТекстОшибки = "Ошибка выполнения процедуры ""СформироватьТекстОтвета"": " + ТекстОшибки;
		Событие = "ОбщийМодуль.рестМобильныйОфициант";
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;
	
	//ЗафиксироватьВСлужебномЛоге(Результат, ПараметрыОбработки, Истина);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКартинкуПоПараметрам(ПараметрыЗапроса) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	
	МассивТекстаЗапроса = Новый Массив;
	Если ПараметрыЗапроса["typeId"] = "menu"
		И НЕ ПараметрыЗапроса["elemId"] = "0" Тогда
		
		ЭлементМеню = ПолучитьСсылкуПоИД(ПараметрыЗапроса["elemId"],Справочники.рестМеню);
		
		МассивТекстаЗапроса.Добавить("ВЫБРАТЬ
		|	рестМеню.ЦветФонаКнопок КАК ФайлХранилище
		|ИЗ
		|	Справочник.рестМеню КАК рестМеню
		|ГДЕ
		|	рестМеню.Ссылка = &рестМеню
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|");
		
		Запрос.УстановитьПараметр("рестМеню", ЭлементМеню);
		
	КонецЕсли;
	
	Если НЕ ПараметрыЗапроса["prodimageId"] = "0" Тогда
		
		МассивТекстаЗапроса.Добавить("ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла КАК ФайлХранилище
		|ИЗ
		|	РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
		|ГДЕ
		|	ДвоичныеДанныеФайлов.Файл = &ВладелецФайла");
		
		ЭлементФайлНоменклатуры = ПолучитьСсылкуПоИД(ПараметрыЗапроса["prodimageId"],
				Справочники.НоменклатураПрисоединенныеФайлы);
		Запрос.УстановитьПараметр("ВладелецФайла", ЭлементФайлНоменклатуры);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(МассивТекстаЗапроса) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос.Текст = СтрСоединить(МассивТекстаЗапроса, Символы.ПС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.ФайлХранилище.Получить();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ОбработчикиЗапросов

Процедура Подключаемый_Авторизация(СтруктураСообщения, ПараметрыОбработки)
	
	Если СтруктураСообщения.Свойство("Текст") Тогда
		ПолучитьПараметрыИзСтроки(ПараметрыОбработки, СтруктураСообщения.Текст);
	КонецЕсли;
	
	КодКлиента = "";
	Если ПараметрыОбработки.Свойство("client_id") Тогда
		КодКлиента = ПараметрыОбработки.client_id;
	КонецЕсли;
	
	СекретКлиента = "";
	Если ПараметрыОбработки.Свойство("client_secret") Тогда
		СекретКлиента = ПараметрыОбработки.client_secret;
	КонецЕсли;
	
	ДанныеТокена = ПроверитьАктуальностьТокена(КодКлиента, СекретКлиента);
	
	// Если токена нет или он не актуальный, то запросим новый.
	Если ДанныеТокена = Неопределено 
		ИЛИ ДанныеТокена.ДатаЗавершения <= (ТекущаяДата()) 
		ИЛИ НЕ ЗначениеЗаполнено(ДанныеТокена.Токен) Тогда
		
		ТокенПриложения = Новый УникальныйИдентификатор;
		
		ПериодАктуальностиТокенаВЧасах = Константы.ПериодАктуальностиТокенаСистемыИнтеграции.Получить();
		Если ЗначениеЗаполнено(ПериодАктуальностиТокенаВЧасах) Тогда
			ПериодАктуальностиТокена = ПериодАктуальностиТокенаВЧасах*3600;
		Иначе
			// Считаем что значение по умолчанию будет 1 ч.
			ПериодАктуальностиТокена = 3600;
		КонецЕсли;
		
		Запись = РегистрыСведений.ХранилищеТокеновСистемыИнтеграции.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторПриложения = КодКлиента;
		Запись.СекретПриложения = СекретКлиента;
		Запись.ДатаВыдачи = ТекущаяДата();
		Запись.ДатаЗавершения = Запись.ДатаВыдачи + ПериодАктуальностиТокена;
		Запись.Токен = ТокенПриложения;
		Запись.Записать(Истина);
		
	Иначе
		
		ТокенПриложения = ДанныеТокена.Токен;
		ПериодАктуальностиТокена = ДанныеТокена.ДатаЗавершения - ТекущаяДата();
		
	КонецЕсли;
	
	// Сформируем ответ.
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "access_token",  XMLСтрока(ТокенПриложения));
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "expires",  Формат(ПериодАктуальностиТокена, "ЧДЦ=0; ЧН=0; ЧГ="));
	
КонецПроцедуры

Процедура Подключаемый_ПолучитьАктуальноеМеню(СтруктураСообщения, ПараметрыОбработки)
	
	// Получим данные ресторана.
	ПараметрыЯндексЕда = ПолучитьСистемуИнтеграции(ПараметрыОбработки.ТипСистемИнтеграции,
		ПараметрыОбработки.restaurantId);
	
	Если ПараметрыЯндексЕда = Неопределено Тогда
		ЗафиксироватьОшибку(ПараметрыОбработки,4,404);
		Возврат;
	КонецЕсли;
	
	ТекДата = ТекущаяДата();
	
	// Получим данные по меню.
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаАктуальногоМеню();
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыЯндексЕда.СистемаИнтеграции);
	Запрос.УстановитьПараметр("ТекущаяДата", 		ТекДата);
	Запрос.УстановитьПараметр("ПустаяДата", 		'00010101000000');
	Запрос.УстановитьПараметр("НаДату", 			НачалоДня(ТекДата));
	Запрос.УстановитьПараметр("НаВремя", 			Дата(1, 1, 1, Час(ТекДата), Минута(ТекДата), 0));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	// Заполним данные по Категориям.
	#Область Категории
	МассивКатегорий = Новый Массив;
	Если НЕ РезультатЗапроса[1].Пустой() Тогда
		Выборка = РезультатЗапроса[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекОбъект = СтруктураКатегория();
			ТекОбъект.id = Выборка.ИдентификаторМеню;
			ТекОбъект.parentId = Выборка.ИдентификаторМенюРодитель;
			ТекОбъект.name = Выборка.Наименование;
			ТекОбъект.sortOrder = Выборка.НомерВГруппе;
			МассивКатегорий.Добавить(ТекОбъект);
		КонецЦикла;
	КонецЕсли;
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки,"categories",МассивКатегорий);
	#КонецОбласти
	
	#Область Меню
	
	// Подготовим данные по модификаторам.
	СоответствиеМодификаторовНоменклатуры = Новый Соответствие;
	
	#Область МодификаторыНоменклатуры
	СоответствиеГруппМодификаторов = Новый Соответствие;
	Если НЕ РезультатЗапроса[14].Пустой() Тогда
		Выборка = РезультатЗапроса[14].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл
			
			МассивМодификаторов = Новый Массив;
			Если ЗначениеЗаполнено(Выборка.ГруппаМодификатора) Тогда
				
				ТекОбъект = СтруктураГруппаМодификатора();
				ТекОбъект.id = Выборка.ГруппаМодификатора;
				ТекОбъект.name = Выборка.ГруппаМодификатораНаименование;
				ТекОбъект.minSelectedModifiers = Выборка.МинимальноеКоличество;
				ТекОбъект.maxSelectedModifiers = Выборка.МаксимальноеКоличество;
				ТекОбъект.modifiers = МассивМодификаторов;
				СоответствиеГруппМодификаторов[Выборка.ГруппаМодификатора] = ТекОбъект;
			КонецЕсли;
			
			ВыборкаДЗ = Выборка.Выбрать();
			Пока ВыборкаДЗ.Следующий() Цикл
				
				ТекОбъектМодификатор = СтруктураМодификатор();
				ТекОбъектМодификатор.id = ВыборкаДЗ.Модификатор;
				ТекОбъектМодификатор.name = ВыборкаДЗ.МодификаторНаименование;
				ТекОбъектМодификатор.price = ВыборкаДЗ.МодификаторЦена;
				ТекОбъектМодификатор.vat = ПолучитьСтавкуНДС(ВыборкаДЗ.МодификаторСтавкаНДС);
				ТекОбъектМодификатор.minAmount = ВыборкаДЗ.МодификаторМинимальноеКоличество;
				ТекОбъектМодификатор.maxAmount = ВыборкаДЗ.МодификаторМаксимальноеКоличество;
				
				Если НЕ ЗначениеЗаполнено(ВыборкаДЗ.ГруппаМодификатора) Тогда
					
					СоответствиеГруппМодификаторов[ВыборкаДЗ.Модификатор] = ТекОбъектМодификатор;
					
				КонецЕсли;
				
				МассивМодификаторов.Добавить(ТекОбъектМодификатор);
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	// Подготовим данные по модификаторам.
	Если НЕ РезультатЗапроса[15].Пустой() Тогда
		Выборка = РезультатЗапроса[15].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка.Следующий() Цикл
			
			МассивМодификаторов = Новый Массив;
			МассивГруппМодификаторов = Новый Массив;
			
			// Соберем данные по группам модификаторов и модификаторам.
			ВыборкаДЗ = Выборка.Выбрать();
			Пока ВыборкаДЗ.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаДЗ.ГруппаМодификатора) Тогда
					ОбъектВСоответствии = ВыборкаДЗ.ГруппаМодификатора;
				ИначеЕсли ЗначениеЗаполнено(ВыборкаДЗ.Модификатор) Тогда
					ОбъектВСоответствии = ВыборкаДЗ.Модификатор;
				Иначе
					Продолжить;
				КонецЕсли;
				
				РезультатПоиска = СоответствиеГруппМодификаторов[ОбъектВСоответствии];
				Если РезультатПоиска = Неопределено Тогда
					// Данные по модификатору или группе не были получены.
					Продолжить;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаДЗ.ГруппаМодификатора) Тогда
					МассивГруппМодификаторов.Добавить(РезультатПоиска);
				ИначеЕсли ЗначениеЗаполнено(ВыборкаДЗ.Модификатор) Тогда
					МассивМодификаторов.Добавить(РезультатПоиска);
				КонецЕсли;
				
			КонецЦикла;
			
			// Соберем отдельно общие модификаторы.
			Если ЗначениеЗаполнено(МассивМодификаторов) Тогда
				ТекОбъект = СтруктураГруппаМодификатора();
				ТекОбъект.id = XMLСтрока(Новый УникальныйИдентификатор);
				ТекОбъект.name = НСтр("ru='Общие модификаторы'", "ru");
				ТекОбъект.modifiers = МассивМодификаторов;
				ТекОбъект.sortOrder = 1;
				МассивГруппМодификаторов.Добавить(ТекОбъект);
			КонецЕсли;
			
			СоответствиеМодификаторовНоменклатуры[Выборка.Номенклатура] = МассивГруппМодификаторов;
			
		КонецЦикла;
	КонецЕсли;
	#КонецОбласти
	
	СерверИзобрабражений = Константы.АдресПубликацииИнформационнойБазыВИнтернете.Получить();
	Если НЕ ЗначениеЗаполнено(СерверИзобрабражений) Тогда
		СерверИзобрабражений = "http://localhost/ИмяПубликации";
	КонецЕсли;
	ШаблонАдресаПоУмолчанию = СтрШаблон("%1/hs/eda.yandex/images",СерверИзобрабражений);
	
	ЗначениеФорматаЦены = ФорматЦены();
	
	СоответствиеКартинокНоменклатуры = Новый Соответствие;
	МассивМеню = Новый Массив;
	Если НЕ РезультатЗапроса[7].Пустой() Тогда
		Выборка = РезультатЗапроса[7].Выбрать();
		Пока Выборка.Следующий() Цикл
			ИдентификаторМенюСтрокой = ПолучитьИДПоСсылке(Выборка.ИдентификаторМеню);
			ТекОбъект = СтруктураМеню();
			ТекОбъект.id = ИдентификаторМенюСтрокой;
			ТекОбъект.categoryId = Выборка.ИдентификаторМенюРодитель;
			ТекОбъект.name = Выборка.Наименование;
			ТекОбъект.sortOrder = Выборка.НомерВГруппе;
			ТекОбъект.description = Выборка.ПолноеОписание;
			ТекОбъект.price = Формат(Выборка.Цена, ЗначениеФорматаЦены);
			ТекОбъект.vat = ПолучитьСтавкуНДС(Выборка.Наименование);
			ТекОбъект.measure = Выборка.Вес;
			ТекОбъект.measureUnit = ПолучитьЕдиницуИзмеренияСтрокой(Выборка.ЕдиницаИзмеренияНаименование);
			
			МассивГруппМодификаторов = СоответствиеМодификаторовНоменклатуры[Выборка.Номенклатура];
			Если МассивГруппМодификаторов = Неопределено Тогда
				МассивГруппМодификаторов = Новый Массив;
			КонецЕсли;
			ТекОбъект.modifierGroups = МассивГруппМодификаторов;
			
			ТекОбъект.images = Новый Массив;
			Если ЗначениеЗаполнено(Выборка.ИмяКартинкиМеню)
				ИЛИ НЕ Выборка.ДвоичныеДанныеФайлаНоменклатуры = Неопределено Тогда
				ЗаполнитьДанныеПоКартинке(ТекОбъект.images, 
					Выборка, 
					СоответствиеКартинокНоменклатуры, 
					ШаблонАдресаПоУмолчанию,
					ИдентификаторМенюСтрокой);
			КонецЕсли;
			МассивМеню.Добавить(ТекОбъект);
		КонецЦикла;
	КонецЕсли;
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки,"items",МассивМеню);
	
	#КонецОбласти
	
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки,"lastChange", Формат(ТекущаяДата(), "ДФ='yyyy-MM-ddTHH:mm:ss'"));
	
КонецПроцедуры

Процедура Подключаемый_ПолучитьНедоступноеМеню(СтруктураСообщения, ПараметрыОбработки)
	
	// Получим данные ресторана.
	ПараметрыЯндексЕда = ПолучитьСистемуИнтеграции(ПараметрыОбработки.ТипСистемИнтеграции,
		ПараметрыОбработки.restaurantId);
	
	Если ПараметрыЯндексЕда = Неопределено Тогда
		ЗафиксироватьОшибку(ПараметрыОбработки,4,404);
		Возврат;
	КонецЕсли;
	
	ТекДата = ТекущаяДата();
	
	// Получим данные по меню.
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаНедоступногоМеню();
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыЯндексЕда.СистемаИнтеграции);
	Запрос.УстановитьПараметр("ТекущаяДата", 		ТекДата);
	Запрос.УстановитьПараметр("ПустаяДата", 		'00010101000000');
	Запрос.УстановитьПараметр("НаДату", 			НачалоДня(ТекДата));
	Запрос.УстановитьПараметр("НаВремя", 			Дата(1, 1, 1, Час(ТекДата), Минута(ТекДата), 0));
	
	РезультатЗапроса = Запрос.Выполнить();
	МассивМеню = Новый Массив;
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекОбъект = СтруктураНедоступноеМеню();
			ТекОбъект.id = Выборка.ИдентификаторМеню;
			МассивМеню.Добавить(ТекОбъект);
		КонецЦикла;
	КонецЕсли;
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки,"items",МассивМеню);
	
КонецПроцедуры

Процедура Подключаемый_ПолучитьАкционноеМеню(СтруктураСообщения, ПараметрыОбработки)
	
	// Получим данные ресторана.
	ПараметрыЯндексЕда = ПолучитьСистемуИнтеграции(ПараметрыОбработки.ТипСистемИнтеграции,
		ПараметрыОбработки.restaurantId);
	
	Если ПараметрыЯндексЕда = Неопределено Тогда
		ЗафиксироватьОшибку(ПараметрыОбработки,4,404);
		Возврат;
	КонецЕсли;
	
	// Т.к. функционал еще не поддерживается, то будем возвращать пустые данные.
	МассивМеню = Новый Массив;
	ЗафиксироватьВыходныеПараметры(ПараметрыОбработки,"promoItems",МассивМеню);

КонецПроцедуры

Процедура Подключаемый_ДобавитьЗаказ(СтруктураСообщения, ПараметрыОбработки)
	
	ЗаказПокупателя = ОбработатьЗаказПокупателя(СтруктураСообщения, ПараметрыОбработки);
	
	Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "orderId", ЗаказПокупателя.Ссылка);
		ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "result", "OK");
	КонецЕсли;
	
КонецПроцедуры

Процедура Подключаемый_ОбновитьЗаказ(СтруктураСообщения, ПараметрыОбработки)
	
	ЗаказПокупателя = ОбработатьЗаказПокупателя(СтруктураСообщения, ПараметрыОбработки);
	
	Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, "result", "OK");
	КонецЕсли;
	
КонецПроцедуры

Процедура Подключаемый_УдалитьЗаказ(СтруктураСообщения, ПараметрыОбработки)
	
	ДанныеОтменыЗаказа = СтруктураОтменаЗаказа();
	ЗаполнитьЗначенияСвойств(ДанныеОтменыЗаказа, СтруктураСообщения);
	
	ЗаказОбъект = Неопределено;
	Если ПараметрыОбработки.Свойство("orderId") Тогда
		ЗаказОбъект = ПолучитьОбъектПоИД(ПараметрыОбработки.orderId, Документы.ЗаказПокупателя,Ложь, Истина);
	КонецЕсли;
	
	Если ЗаказОбъект = Неопределено Тогда
		ЗафиксироватьОшибку(ПараметрыОбработки,4,404);
		Возврат;
	КонецЕсли;
	
	// Получим текст отмены.
	ПричинаОтмены = Неопределено;
	АналитикаОтмены = Неопределено;
	Если ЗначениеЗаполнено(ДанныеОтменыЗаказа.comment) Тогда
		ПричинаОтмены = ПолучитьПричинуОтменЗаказаПокупателей(ДанныеОтменыЗаказа.comment);
		ИД_Причины = ПолучитьИДПоСсылке(ПричинаОтмены);
		АналитикаОтмены = ПолучитьСсылкуПоИД(ИД_Причины, Справочники.АналитикаХозяйственныхОпераций);
	КонецЕсли;
	
	ЗаказОбъект.рестЭтап = Перечисления.рестЭтапыЗаказа.ОтмененКлиентомЗаказДоставки;
	ЗаказОбъект.рестАналитикаХозяйственнойОперации = АналитикаОтмены;
	Для Каждого ТекСтрока Из ЗаказОбъект.Товары Цикл
		//ТекСтрока.Отменено = Истина;
		ТекСтрока.ПричинаОтмены = ПричинаОтмены;
	КонецЦикла;
	
	Попытка
		// Запишем документ заказа.
		ЗаказОбъект.Записать();
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ИнфОбОшибке.Описание;
		Пока ИнфОбОшибке.Причина <> Неопределено Цикл
			ИнфОбОшибке = ИнфОбОшибке.Причина;
			ТекстОшибки = ТекстОшибки + "
			|" + ИнфОбОшибке.Описание;
		КонецЦикла;
		ТекстОшибки = "Ошибка выполнения процедуры ""Подключаемый_УдалитьЗаказ"": " + ТекстОшибки;
		Событие = "ЯндексЕда";
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ЗафиксироватьОшибку(ПараметрыОбработки,5);
	КонецПопытки;
	
КонецПроцедуры

Процедура Подключаемый_ПолучитьСтатусЗаказа(СтруктураСообщения, ПараметрыОбработки)
	
	ЗаказОбъект = Неопределено;
	Если ПараметрыОбработки.Свойство("orderId") Тогда
		ЗаказОбъект = ПолучитьСсылкуПоИД(ПараметрыОбработки.orderId, Документы.ЗаказПокупателя);
	КонецЕсли;
	
	Если ЗаказОбъект = Неопределено Тогда
		ЗафиксироватьОшибку(ПараметрыОбработки,4,404);
		Возврат;
	КонецЕсли;
	
	
	// заказ может перейти на любом этапе. Описание статусов: NEW - новый, 
	// только отправлен в ресторан. ACCEPTED_BY_RESTAURANT - заказ подтвержден рестораном. 
	// COOKING - началось приготовление заказа. READY - заказ приготовлен. 
	// TAKEN_BY_COURIER - курьер забрал заказ из ресторана. DELIVERED - заказ завершен. 
	// CANCELLED - заказ отменён\nNEW -> ACCEPTED_BY_RESTAURANT -> COOKING -> READY -> 
	// TAKEN_BY_COURIER -> DELIVERED. Из любого статуса -> CANCELLED."
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДокЗаказПокупателя.рестЭтап = ЗНАЧЕНИЕ(Перечисление.рестЭтапыЗаказа.ПринятЗаказДоставки)
	|			ТОГДА ВЫБОР
	|					КОГДА рестУчетЗаказовНаПриготовление.ЗаказНаПриготовление ЕСТЬ NULL
	|							И ДокЗаказПокупателя.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПокупателей.НеСогласован)
	|						ТОГДА ""NEW""
	|					КОГДА рестУчетЗаказовНаПриготовление.ЗаказНаПриготовление ЕСТЬ NULL
	|							И ДокЗаказПокупателя.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПокупателей.Согласован)
	|						ТОГДА ""ACCEPTED_BY_RESTAURANT""
	|					КОГДА рестЗаказНаПриготовление.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.рестСтатусыЗаказов.Готово)
	|							ИЛИ рестЗаказНаПриготовление.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.рестСтатусыЗаказов.Подано)
	|						ТОГДА ""READY""
	|					КОГДА рестЗаказНаПриготовление.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.рестСтатусыЗаказов.Отменено)
	|						ТОГДА ""CANCELLED""
	|					ИНАЧЕ ""COOKING""
	|				КОНЕЦ
	|		КОГДА ДокЗаказПокупателя.рестЭтап = ЗНАЧЕНИЕ(Перечисление.рестЭтапыЗаказа.ОтправленЗаказДоставки)
	|			ТОГДА ""TAKEN_BY_COURIER""
	|		КОГДА ДокЗаказПокупателя.рестЭтап = ЗНАЧЕНИЕ(Перечисление.рестЭтапыЗаказа.ОтмененКлиентомЗаказДоставки)
	|				ИЛИ ДокЗаказПокупателя.рестЭтап = ЗНАЧЕНИЕ(Перечисление.рестЭтапыЗаказа.Аннулирован)
	|			ТОГДА ""CANCELLED""
	|		КОГДА ДокЗаказПокупателя.рестЭтап = ЗНАЧЕНИЕ(Перечисление.рестЭтапыЗаказа.Закрыт)
	|			ТОГДА ""DELIVERED""
	|		ИНАЧЕ ""ACCEPTED_BY_RESTAURANT""
	|	КОНЕЦ КАК СтатусСтрокой,
	|	ЕСТЬNULL(рестЗаказНаПриготовление.ДатаИзменения, ДокЗаказПокупателя.Дата) КАК ДатаИзменения
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДокЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рестУчетЗаказовНаПриготовление КАК рестУчетЗаказовНаПриготовление
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.рестЗаказНаПриготовление КАК рестЗаказНаПриготовление
	|			ПО рестУчетЗаказовНаПриготовление.ЗаказНаПриготовление = рестЗаказНаПриготовление.Ссылка
	|		ПО ДокЗаказПокупателя.Ссылка = рестУчетЗаказовНаПриготовление.ДокументРегистратор
	|ГДЕ
	|	ДокЗаказПокупателя.Ссылка = &ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказОбъект);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		// Данные по заказу не найдены.
		ЗафиксироватьОшибку(ПараметрыОбработки,4,404);
		Возврат;
	КонецЕсли;
	
	ДанныеСтатуса = СтруктураСтатусЗаказа();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеСтатуса.status = Выборка.СтатусСтрокой;
		ДанныеСтатуса.updatedAt = Формат(Выборка.ДатаИзменения, "ДФ='yyyy-MM-ddTHH:mm:ss'");
	КонецЕсли;
	
	Для Каждого ТекСвойство Из ДанныеСтатуса Цикл
		ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, ТекСвойство.Ключ, ТекСвойство.Значение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СтруктуруДанных

Функция СтруктураКатегория()
	
	Результат = Новый Структура;
	Результат.Вставить("id");
	Результат.Вставить("parentId");
	Результат.Вставить("name", "");
	Результат.Вставить("sortOrder", 0);
	
	Возврат Результат;
КонецФункции

Функция СтруктураГруппаМодификатора()
	
	Результат = Новый Структура;
	Результат.Вставить("id");
	Результат.Вставить("name", "");
	Результат.Вставить("modifiers", Новый Массив);
	Результат.Вставить("minSelectedModifiers", 0);
	Результат.Вставить("maxSelectedModifiers", 0);
	Результат.Вставить("sortOrder", 0);
	
	Возврат Результат;
КонецФункции

Функция СтруктураМодификатор()
	
	Результат = Новый Структура;
	Результат.Вставить("id");
	Результат.Вставить("name", "");
	Результат.Вставить("price", 0);
	Результат.Вставить("vat", 0);
	Результат.Вставить("minAmount", 0);
	Результат.Вставить("maxAmount", 0);
	
	Возврат Результат;
КонецФункции

Функция СтруктураМеню()
	
	Результат = Новый Структура;
	// Идентификатор.
	Результат.Вставить("id");
	// Родитель.
	Результат.Вставить("categoryId",);
	// Наименование.
	Результат.Вставить("name", "");
	// Полное описание.
	Результат.Вставить("description", "");
	Результат.Вставить("price", 0);
	// Процент ставки ндс.
	Результат.Вставить("vat", 0);
	// Характеристика/Вес/Объем.
	Результат.Вставить("measure", 0);
	// Единица измерения г или мл.
	Результат.Вставить("measureUnit","г");
	// Поле сортировки.
	Результат.Вставить("sortOrder", 0);
	// Группы модификаторов.
	Результат.Вставить("modifierGroups", Новый Массив);
	// Изображения.
	Результат.Вставить("images", Новый Массив);
	
	Возврат Результат;
КонецФункции

Функция СтруктураИзображения()
	
	Результат = Новый Структура;
	
	// SHA1-хэш от содержимого файла изображения. 
	// Служит признаком уникальности. В случае если он меняется, Яндекс.Еда перезагружает картинку..
	Результат.Вставить("hash","");
	
	// Ссылка на изображение для скачивания.
	Результат.Вставить("url","");
		
	Возврат Результат;
КонецФункции

Функция СтруктураНедоступноеМеню()
	
	Результат = Новый Структура;
	// Идентификатор.
	Результат.Вставить("id");
	// Остатки.
	Результат.Вставить("stock", 0 );
	
	Возврат Результат;
КонецФункции

Функция СтруктураЗаказПокупателя()

	Результат = Новый Структура;
	// Дискриминатор схемы обьекта. 
	// Для MarketplaceOrder равен \"marketplace\".
	// Для YandexOrder равен \"yandex\".
	Результат.Вставить("discriminator", "");
	// Сквозной идентификатор заказа на стороне Яндекс.Еды в формате DDDDDD-DDDDDD.
	Результат.Вставить("eatsId","");
	// Внутренний идентификатор заведения в системе партнера, в которое передаётся заказ.
	Результат.Вставить("restaurantId", "");
	// Данные доставки.
	Результат.Вставить("deliveryInfo", Новый Структура);
	// Предварительная оплата.
	Результат.Вставить("paymentInfo", Новый Структура);
	// Товары.
	Результат.Вставить("items", Новый Массив);
	// Количество персон, на которых делается заказ.
	Результат.Вставить("persons", 0);
	// Дополнительная информация о заказе.
	Результат.Вставить("comment","");
	// Список акций, действующих на весь заказ.
	Результат.Вставить("promo", Новый Массив);
	
	Возврат Результат;
КонецФункции

Функция СтруктураДанныеДоставки()

	Результат = Новый Структура;
	
	// При схеме marketplace.
	
	// Имя клиента в сервисе Яндекс.Еда.
	Результат.Вставить("clientName");
	// Маскировочный номер телефона для связи с клиентом в международном формате. 
	// Состоит из частей +<код страны><номер> доб. <добавочный номер>.
	// Пример: +79031111111 доб. 4432".
	Результат.Вставить("phoneNumber");
	// Дата доставки (к которой клиент ожидает доставку заказа), 
	// в формате RFC3339 с дробной частью секунд (Y-m-d\\TH:i:s.uP).
	Результат.Вставить("deliveryDate", "");
	// Адрес доставки.
	Результат.Вставить("deliveryAddress", Новый Структура);
	
	// При схеме yandex.
	// Дата, когда придет курьер в ресторан, в формате RFC3339 с дробной частью секунд (Y-m-d\\TH:i:s.uP).
	Результат.Вставить("courierArrivementDate");
	
	Возврат Результат;
КонецФункции

Функция СтруктураАдрес()

	Результат = Новый Структура;
	// Полный адрес "Москва, улица Тверская, дом 1, строение 4, подъезд 2. 4-й этаж, код домофона: 123 К 4567.
	Результат.Вставить("full");
	// Широта точки доставки.
	Результат.Вставить("latitude");
	// Долгота точки доставки.
	Результат.Вставить("longitude");
	// Адрес доставки.
	Результат.Вставить("deliveryAddress", "");
	
	Возврат Результат;
КонецФункции

Функция СтруктураДанныеОплаты()

	Результат = Новый Структура;
	
	// При схеме yandex.
	// Информация о типе оплаты CARD,CASH.
	Результат.Вставить("paymentType","");
	// Полная сумма стоимости блюд в заказе.
	Результат.Вставить("itemsCost",0);
	
	// Только при схеме marketplace.
	// Стоимость доставки.
	Результат.Вставить("deliveryFee", 0);
	// Общая стоимость заказа.
	Результат.Вставить("total", 0);
	// Требуемая сдача с суммы.
	Результат.Вставить("change",0);
	
	Возврат Результат;
КонецФункции

Функция СтруктураСтрокаТовары()

	Результат = Новый Структура;
	
	// ID позиции меню в системе партнера.
	Результат.Вставить("id","");
	// Наименование позиции меню.
	Результат.Вставить("name",0);
	
	// Количество позиции в заказе.
	Результат.Вставить("quantity", 0);
	// Цена пункта меню.
	Результат.Вставить("price", 0);
	// Список выбранных модификаций. Может быть пустым, передаётся явно, для каждой отдельной позиции в заказе..
	Результат.Вставить("modifications",Новый Массив);
	// Список акций, действующих на текущее блюдо..
	Результат.Вставить("promo", Новый Массив);
	
	Возврат Результат;
КонецФункции

Функция СтруктураСтрокаМодификаторы()

	Результат = Новый Структура;
	
	// ID позиции модификатора в системе партнера.
	Результат.Вставить("id","");
	// Наименование позиции модификатора
	Результат.Вставить("name",0);
	
	// Количество позиции в заказе.
	Результат.Вставить("quantity", 0);
	
	// Цена модификатора для пункта меню.
	Результат.Вставить("price", 0);
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураСтрокаСкидки()

	Результат = Новый Структура;
	
	// Тип акции. Может быть подарок \"GIFT\", процентная скидка \"PERCENTAGE\", фиксированная скидка \"FIXED\".
	Результат.Вставить("type","");
	// Сумма скидки в валюте.
	Результат.Вставить("discount",0);
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураСтатусЗаказа()
	
	Результат = Новый Структура;
	
	// Статус заказа. Должен быть допустимым - т.е. приготовленный заказ нельзя 
	// снова сделать новым. Переход по статусам возможен только в указанном 
	// направлении - от NEW до DELIVERED. Исключение - в статус CANCELLED 
	// заказ может перейти на любом этапе. Описание статусов: NEW - новый, 
	// только отправлен в ресторан. ACCEPTED_BY_RESTAURANT - заказ подтвержден рестораном. 
	// COOKING - началось приготовление заказа. READY - заказ приготовлен. 
	// TAKEN_BY_COURIER - курьер забрал заказ из ресторана. DELIVERED - заказ завершен. 
	// CANCELLED - заказ отменён\nNEW -> ACCEPTED_BY_RESTAURANT -> COOKING -> READY -> 
	// TAKEN_BY_COURIER -> DELIVERED. Из любого статуса -> CANCELLED."
	Результат.Вставить("status","NEW");
	
	// Комментарий к смене статуса.
	Результат.Вставить("comment","");
	
	// Дата, когда сменился статус заказа, в формате RFC3339 с дробной частью секунд (Y-m-d\\TH:i:s.uP).
	Результат.Вставить("updatedAt");
	
	Возврат Результат;
КонецФункции

Функция СтруктураОтменаЗаказа()
	
	Результат = Новый Структура;
	
	// Сквозной идентификатор заказа на стороне Яндекс.Еды в формате DDDDDD-DDDDDD.
	Результат.Вставить("eatsId","");
	
	// Описание причин отмены (может быть пустым).
	Результат.Вставить("comment","");
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ПроверкиВозможностиРаботы

Функция ПроверитьАктуальностьТокена(КодКлиента, СекретКлиента)
	
	Результат = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(КодКлиента) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатаЗавершения КАК ДатаЗавершения,
	|	Токен КАК Токен
	|ИЗ
	|	РегистрСведений.ХранилищеТокеновСистемыИнтеграции
	|ГДЕ
	|	ИдентификаторПриложения = &КодКлиента
	|	И СекретПриложения = &СекретКлиента";
	Запрос.УстановитьПараметр("КодКлиента", КодКлиента);
	Запрос.УстановитьПараметр("СекретКлиента", СекретКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = Новый Структура("ДатаЗавершения, Токен");
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
		КонецЕсли;
	КонецЕсли;
 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ТекстыЗапросов

Функция ТекстЗапросаАктуальногоМеню()
	Результат = "ВЫБРАТЬ
	|	рестСистемыИнтеграцииВидыМеню.ВидМеню КАК ВидМеню
	|ПОМЕСТИТЬ ВТ_ВидыМеню
	|ИЗ
	|	Справочник.рестСистемыИнтеграции.ВидыМеню КАК рестСистемыИнтеграцииВидыМеню
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рестВидыМеню КАК рестВидыМеню
	|		ПО рестСистемыИнтеграцииВидыМеню.ВидМеню = рестВидыМеню.Ссылка
	|ГДЕ
	|	рестСистемыИнтеграцииВидыМеню.Ссылка = &Ссылка
	|	И ПОДСТРОКА(рестВидыМеню.ДниНедели, ДЕНЬНЕДЕЛИ(&НаДату), 1) = ""1""
	|	И (рестВидыМеню.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				И рестВидыМеню.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ рестВидыМеню.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				И &НаДату <= рестВидыМеню.ДатаОкончанияДействия
	|			ИЛИ рестВидыМеню.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				И &НаДату >= рестВидыМеню.ДатаНачалаДействия
	|			ИЛИ &НаДату МЕЖДУ рестВидыМеню.ДатаНачалаДействия И рестВидыМеню.ДатаОкончанияДействия)
	|	И (рестВидыМеню.ВремяНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				И рестВидыМеню.ВремяОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ рестВидыМеню.ВремяНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				И &НаВремя <= рестВидыМеню.ВремяОкончанияДействия
	|			ИЛИ рестВидыМеню.ВремяОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				И &НаВремя >= рестВидыМеню.ВремяНачалаДействия
	|			ИЛИ &НаВремя МЕЖДУ рестВидыМеню.ВремяНачалаДействия И рестВидыМеню.ВремяОкончанияДействия
	|			ИЛИ рестВидыМеню.ВремяНачалаДействия > рестВидыМеню.ВремяОкончанияДействия
	|				И (&НаВремя МЕЖДУ рестВидыМеню.ВремяНачалаДействия И ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59)
	|					ИЛИ &НаВремя МЕЖДУ ДАТАВРЕМЯ(1, 1, 1) И рестВидыМеню.ВремяОкончанияДействия))
	|	И НЕ рестВидыМеню.ЭтоГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	рестСистемыИнтеграцииВидыМеню.ВидМеню
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рестМеню.Ссылка КАК ИдентификаторМеню,
	|	рестМеню.Родитель КАК ИдентификаторМенюРодитель,
	|	рестМеню.Наименование КАК Наименование,
	|	рестМеню.НомерВГруппе КАК НомерВГруппе
	|ИЗ
	|	Справочник.рестМеню КАК рестМеню
	|ГДЕ
	|	рестМеню.Владелец В
	|			(ВЫБРАТЬ
	|				ВТ_ВидыМеню.ВидМеню
	|			ИЗ
	|				ВТ_ВидыМеню)
	|	И рестМеню.ЭтоГруппа
	|	И НЕ рестМеню.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рестМеню.Ссылка КАК ИдентификаторМеню,
	|	рестМеню.Родитель КАК ИдентификаторМенюРодитель,
	|	рестМеню.Наименование КАК Наименование,
	|	рестМеню.НомерВГруппе КАК НомерВГруппе,
	|	рестМеню.Номенклатура КАК Номенклатура,
	|	рестВидыМеню.ВидЦены КАК ВидЦены,
	|	рестМеню.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла,
	|	рестМеню.ИмяКартинки КАК ИмяКартинки
	|ПОМЕСТИТЬ ВТ_Меню
	|ИЗ
	|	Справочник.рестМеню КАК рестМеню
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рестВидыМеню КАК рестВидыМеню
	|		ПО рестМеню.Владелец = рестВидыМеню.Ссылка
	|ГДЕ
	|	рестМеню.Владелец В
	|			(ВЫБРАТЬ
	|				ВТ_ВидыМеню.ВидМеню
	|			ИЗ
	|				ВТ_ВидыМеню)
	|	И НЕ рестМеню.ЭтоГруппа
	|	И НЕ рестМеню.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВидыМеню
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Меню.Номенклатура КАК Номенклатура,
	|	ВТ_Меню.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ВТ_НоменклатураВидЦен
	|ИЗ
	|	ВТ_Меню КАК ВТ_Меню
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Меню.Номенклатура,
	|	ВТ_Меню.ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ТекущаяДата,
	|			(Номенклатура, ВидЦены) В
	|				(ВЫБРАТЬ
	|					ВТ.Номенклатура,
	|					ВТ.ВидЦены
	|				ИЗ
	|					ВТ_НоменклатураВидЦен КАК ВТ)) КАК ЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	БазовыеЕдиницыИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	БазовыеЕдиницыИзмерения.Код КАК ЕдиницаИзмеренияКод,
	|	СпрНоменклатура.Описание КАК ПолноеОписание,
	|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена,
	|	ВТ_Номенклатура.ВидЦены КАК ВидЦены,
	|	СпрНоменклатура.СтавкаНДС КАК СтавкаНДС,
	|	СпрНоменклатура.Вес КАК Вес,
	|	ЕСТЬNULL(СпрНоменклатура.ФайлКартинки, ЗНАЧЕНИЕ(Справочник.НоменклатураПрисоединенныеФайлы.ПустаяСсылка)) КАК ФайлКартинки,
	|	ЕСТЬNULL(ДвоичныеДанныеФайлов.ДвоичныеДанныеФайла, НЕОПРЕДЕЛЕНО) КАК ДвоичныеДанныеФайла
	|ПОМЕСТИТЬ ВТ_ДанныеНоменклатуры
	|ИЗ
	|	ВТ_НоменклатураВидЦен КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БазовыеЕдиницыИзмерения КАК БазовыеЕдиницыИзмерения
	|			ПО СпрНоменклатура.ЕдиницаИзмерения = БазовыеЕдиницыИзмерения.Ссылка
	|		ПО ВТ_Номенклатура.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|		ПО ВТ_Номенклатура.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
	|			И ВТ_Номенклатура.ВидЦены = ВТ_ЦеныНоменклатуры.ВидЦены
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДвоичныеДанныеФайлов КАК ДвоичныеДанныеФайлов
	|		ПО (СпрНоменклатура.ФайлКартинки = ДвоичныеДанныеФайлов.Файл)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Меню.ИдентификаторМеню КАК ИдентификаторМеню,
	|	ВТ_Меню.ИдентификаторМенюРодитель КАК ИдентификаторМенюРодитель,
	|	ВТ_Меню.Наименование КАК Наименование,
	|	ВТ_Меню.НомерВГруппе КАК НомерВГруппе,
	|	ВТ_Меню.Номенклатура КАК Номенклатура,
	|	ВТ_Меню.ВидЦены КАК ВидЦены,
	|	ВТ_ДанныеНоменклатуры.ЕдиницаИзмеренияНаименование КАК ЕдиницаИзмеренияНаименование,
	|	ВТ_ДанныеНоменклатуры.ЕдиницаИзмеренияКод КАК ЕдиницаИзмеренияКод,
	|	ВТ_ДанныеНоменклатуры.ПолноеОписание КАК ПолноеОписание,
	|	ВТ_ДанныеНоменклатуры.Цена КАК Цена,
	|	ВТ_ДанныеНоменклатуры.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ДанныеНоменклатуры.Вес КАК Вес,
	|	ВТ_ДанныеНоменклатуры.ФайлКартинки КАК ФайлКартинкиНоменклатура,
	|	ВТ_ДанныеНоменклатуры.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайлаНоменклатуры,
	|	ВТ_Меню.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайлаМеню,
	|	ВТ_Меню.ИмяКартинки КАК ИмяКартинкиМеню
	|ИЗ
	|	ВТ_Меню КАК ВТ_Меню
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеНоменклатуры КАК ВТ_ДанныеНоменклатуры
	|		ПО ВТ_Меню.Номенклатура = ВТ_ДанныеНоменклатуры.Номенклатура
	|			И ВТ_Меню.ВидЦены = ВТ_ДанныеНоменклатуры.ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рестМодификаторыНоменклатуры.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_СписокПривязанныхГрупп
	|ИЗ
	|	РегистрСведений.рестМодификаторыНоменклатуры КАК рестМодификаторыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО рестМодификаторыНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	СпрНоменклатура.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СписокПривязанныхГрупп.Номенклатура КАК НоменклатураСПривязкой,
	|	ВТ_НоменклатураВидЦен.Номенклатура КАК Номенклатура,
	|	ВТ_НоменклатураВидЦен.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ВТ_НоменклатураСПривязаннойНоменклатурой
	|ИЗ
	|	ВТ_СписокПривязанныхГрупп КАК ВТ_СписокПривязанныхГрупп
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НоменклатураВидЦен КАК ВТ_НоменклатураВидЦен
	|		ПО (ВТ_НоменклатураВидЦен.Номенклатура В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					ВТ_СписокПривязанныхГрупп.Номенклатура КАК Номенклатура
	|				ИЗ
	|					ВТ_СписокПривязанныхГрупп КАК ВТ_СписокПривязанныхГрупп))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	рестМодификаторыНоменклатуры.Номенклатура,
	|	ВТ_НоменклатураВидЦен.Номенклатура,
	|	ВТ_НоменклатураВидЦен.ВидЦены
	|ИЗ
	|	РегистрСведений.рестМодификаторыНоменклатуры КАК рестМодификаторыНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НоменклатураВидЦен КАК ВТ_НоменклатураВидЦен
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ПО ВТ_НоменклатураВидЦен.Номенклатура = СпрНоменклатура.Ссылка
	|		ПО рестМодификаторыНоменклатуры.Номенклатура = ВТ_НоменклатураВидЦен.Номенклатура
	|ГДЕ
	|	НЕ СпрНоменклатура.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СписокПривязанныхГрупп
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НоменклатураСПривязаннойНоменклатурой.Номенклатура КАК Номенклатура,
	|	рестМодификаторыНоменклатуры.Модификатор КАК Модификатор,
	|	рестМодификаторыНоменклатуры.ГруппаМодификатора КАК ГруппаМодификатора
	|ПОМЕСТИТЬ ВТ_МодификаторыНоменклатуры
	|ИЗ
	|	ВТ_НоменклатураСПривязаннойНоменклатурой КАК ВТ_НоменклатураСПривязаннойНоменклатурой
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рестМодификаторыНоменклатуры КАК рестМодификаторыНоменклатуры
	|		ПО ВТ_НоменклатураСПривязаннойНоменклатурой.НоменклатураСПривязкой = рестМодификаторыНоменклатуры.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_НоменклатураСПривязаннойНоменклатурой.Номенклатура,
	|	рестМодификаторыНоменклатуры.Модификатор,
	|	рестМодификаторыНоменклатуры.ГруппаМодификатора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_НоменклатураСПривязаннойНоменклатурой
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(рестГруппыМодификаторов.Наименование, """") КАК ГруппаМодификатораНаименование,
	|	ЕСТЬNULL(рестГруппыМодификаторов.ОбязательныйВыбор, ЛОЖЬ) КАК ОбязательныйВыбор,
	|	ЕСТЬNULL(рестГруппыМодификаторов.МинимальноеКоличествоМодификаторов, 0) КАК МинимальноеКоличествоМодификаторов,
	|	ЕСТЬNULL(рестГруппыМодификаторов.МаксимальноеКоличествоМодификаторов, 0) КАК МаксимальноеКоличествоМодификаторов,
	|	ВТ_МодификаторыНоменклатуры.ГруппаМодификатора КАК ГруппаМодификатора,
	|	ВЫБОР
	|		КОГДА ВТ_МодификаторыНоменклатуры.ГруппаМодификатора = ЗНАЧЕНИЕ(Справочник.рестГруппыМодификаторов.ПустаяСсылка)
	|			ТОГДА ВТ_МодификаторыНоменклатуры.Модификатор
	|		ИНАЧЕ рестГруппыМодификаторовМодификаторы.Модификатор
	|	КОНЕЦ КАК Модификатор
	|ПОМЕСТИТЬ ВТ_ВсеМодификаторы
	|ИЗ
	|	ВТ_МодификаторыНоменклатуры КАК ВТ_МодификаторыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рестГруппыМодификаторов КАК рестГруппыМодификаторов
	|		ПО ВТ_МодификаторыНоменклатуры.ГруппаМодификатора = рестГруппыМодификаторов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рестГруппыМодификаторов.Модификаторы КАК рестГруппыМодификаторовМодификаторы
	|		ПО ВТ_МодификаторыНоменклатуры.ГруппаМодификатора = рестГруппыМодификаторовМодификаторы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеМодификаторы.ГруппаМодификатора КАК ГруппаМодификатора,
	|	ВТ_ВсеМодификаторы.ГруппаМодификатораНаименование КАК ГруппаМодификатораНаименование,
	|	ВТ_ВсеМодификаторы.ОбязательныйВыбор КАК ОбязательныйВыбор,
	|	ВТ_ВсеМодификаторы.МинимальноеКоличествоМодификаторов КАК МинимальноеКоличество,
	|	ВТ_ВсеМодификаторы.МаксимальноеКоличествоМодификаторов КАК МаксимальноеКоличество,
	|	ВТ_ВсеМодификаторы.Модификатор КАК Модификатор,
	|	ЕСТЬNULL(рестМодификаторы.Цена, 0) КАК МодификаторЦена,
	|	ВЫБОР
	|		КОГДА рестМодификаторы.ДопНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА рестМодификаторы.СлужебнаяНоменклатура
	|		ИНАЧЕ рестМодификаторы.ДопНоменклатура
	|	КОНЕЦ КАК МодификаторНоменклатура,
	|	СпрНоменклатура.СтавкаНДС КАК МодификаторСтавкаНДС,
	|	рестМодификаторы.Наименование КАК МодификаторНаименование,
	|	рестМодификаторы.МинимальноеКоличествоМодификаторов КАК МодификаторМинимальноеКоличество,
	|	рестМодификаторы.МаксимальноеКоличествоМодификаторов КАК МодификаторМаксимальноеКоличество,
	|	рестМодификаторы.ОбязательныйВыбор КАК МодификаторОбязательныйВыбор
	|ИЗ
	|	ВТ_ВсеМодификаторы КАК ВТ_ВсеМодификаторы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рестМодификаторы КАК рестМодификаторы
	|		ПО ВТ_ВсеМодификаторы.Модификатор = рестМодификаторы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО (рестМодификаторы.ДопНоменклатура = СпрНоменклатура.Ссылка
	|				ИЛИ рестМодификаторы.СлужебнаяНоменклатура = СпрНоменклатура.Ссылка)
	|ИТОГИ
	|	МАКСИМУМ(ГруппаМодификатораНаименование),
	|	МАКСИМУМ(ОбязательныйВыбор),
	|	МИНИМУМ(МинимальноеКоличество),
	|	МАКСИМУМ(МаксимальноеКоличество)
	|ПО
	|	ГруппаМодификатора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МодификаторыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВТ_МодификаторыНоменклатуры.Модификатор КАК Модификатор,
	|	ВТ_МодификаторыНоменклатуры.ГруппаМодификатора КАК ГруппаМодификатора
	|ИЗ
	|	ВТ_МодификаторыНоменклатуры КАК ВТ_МодификаторыНоменклатуры
	|ИТОГИ ПО
	|	Номенклатура";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаНедоступногоМеню()
	Результат = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	рестСистемыИнтеграцииВидыМеню.ВидМеню КАК ВидМеню,
	|	рестВидыМеню.ДниНедели КАК ДниНедели,
	|	рестВидыМеню.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	рестВидыМеню.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	рестВидыМеню.ВремяНачалаДействия КАК ВремяНачалаДействия,
	|	рестВидыМеню.ВремяОкончанияДействия КАК ВремяОкончанияДействия
	|ПОМЕСТИТЬ ВТ_ВидыМеню
	|ИЗ
	|	Справочник.рестСистемыИнтеграции.ВидыМеню КАК рестСистемыИнтеграцииВидыМеню
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рестВидыМеню КАК рестВидыМеню
	|		ПО рестСистемыИнтеграцииВидыМеню.ВидМеню = рестВидыМеню.Ссылка
	|ГДЕ
	|	рестСистемыИнтеграцииВидыМеню.Ссылка = &Ссылка
	|	И НЕ рестВидыМеню.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рестВидыМеню.ВидМеню КАК ВидМеню
	|ПОМЕСТИТЬ ВТ_ВидыМенюДоступные
	|ИЗ
	|	ВТ_ВидыМеню КАК рестВидыМеню
	|ГДЕ
	|	ПОДСТРОКА(рестВидыМеню.ДниНедели, ДЕНЬНЕДЕЛИ(&НаДату), 1) = ""1""
	|	И (рестВидыМеню.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				И рестВидыМеню.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ рестВидыМеню.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				И &НаДату <= рестВидыМеню.ДатаОкончанияДействия
	|			ИЛИ рестВидыМеню.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				И &НаДату >= рестВидыМеню.ДатаНачалаДействия
	|			ИЛИ &НаДату МЕЖДУ рестВидыМеню.ДатаНачалаДействия И рестВидыМеню.ДатаОкончанияДействия)
	|	И (рестВидыМеню.ВремяНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				И рестВидыМеню.ВремяОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ рестВидыМеню.ВремяНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				И &НаВремя <= рестВидыМеню.ВремяОкончанияДействия
	|			ИЛИ рестВидыМеню.ВремяОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				И &НаВремя >= рестВидыМеню.ВремяНачалаДействия
	|			ИЛИ &НаВремя МЕЖДУ рестВидыМеню.ВремяНачалаДействия И рестВидыМеню.ВремяОкончанияДействия
	|			ИЛИ рестВидыМеню.ВремяНачалаДействия > рестВидыМеню.ВремяОкончанияДействия
	|				И (&НаВремя МЕЖДУ рестВидыМеню.ВремяНачалаДействия И ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59)
	|					ИЛИ &НаВремя МЕЖДУ ДАТАВРЕМЯ(1, 1, 1) И рестВидыМеню.ВремяОкончанияДействия))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рестВидыМеню.ВидМеню КАК ВидМеню
	|ПОМЕСТИТЬ ВТ_ВидыМенюНедоступные
	|ИЗ
	|	ВТ_ВидыМеню КАК рестВидыМеню
	|ГДЕ
	|	НЕ(ПОДСТРОКА(рестВидыМеню.ДниНедели, ДЕНЬНЕДЕЛИ(&НаДату), 1) = ""1""
	|				И (рестВидыМеню.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|						И рестВидыМеню.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ рестВидыМеню.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|						И &НаДату <= рестВидыМеню.ДатаОкончанияДействия
	|					ИЛИ рестВидыМеню.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|						И &НаДату >= рестВидыМеню.ДатаНачалаДействия
	|					ИЛИ &НаДату МЕЖДУ рестВидыМеню.ДатаНачалаДействия И рестВидыМеню.ДатаОкончанияДействия)
	|				И (рестВидыМеню.ВремяНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|						И рестВидыМеню.ВремяОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ рестВидыМеню.ВремяНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|						И &НаВремя <= рестВидыМеню.ВремяОкончанияДействия
	|					ИЛИ рестВидыМеню.ВремяОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|						И &НаВремя >= рестВидыМеню.ВремяНачалаДействия
	|					ИЛИ &НаВремя МЕЖДУ рестВидыМеню.ВремяНачалаДействия И рестВидыМеню.ВремяОкончанияДействия
	|					ИЛИ рестВидыМеню.ВремяНачалаДействия > рестВидыМеню.ВремяОкончанияДействия
	|						И (&НаВремя МЕЖДУ рестВидыМеню.ВремяНачалаДействия И ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59)
	|							ИЛИ &НаВремя МЕЖДУ ДАТАВРЕМЯ(1, 1, 1) И рестВидыМеню.ВремяОкончанияДействия)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рестМеню.Ссылка КАК ИдентификаторМеню,
	|	рестМеню.Родитель КАК ИдентификаторМенюРодитель
	|ПОМЕСТИТЬ ВТ_НедоступныеГруппы
	|ИЗ
	|	Справочник.рестМеню КАК рестМеню
	|ГДЕ
	|	рестМеню.Владелец В
	|			(ВЫБРАТЬ
	|				ВТ_ВидыМеню.ВидМеню
	|			ИЗ
	|				ВТ_ВидыМенюДоступные КАК ВТ_ВидыМеню)
	|	И рестМеню.ЭтоГруппа
	|	И НЕ рестМеню.ПометкаУдаления
	|	И рестМеню.Выключен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	рестМеню.Ссылка КАК ИдентификаторМеню,
	|	рестМеню.Родитель КАК ИдентификаторМенюРодитель,
	|	рестМеню.Выключен КАК Выключен
	|ПОМЕСТИТЬ ВТ_Меню
	|ИЗ
	|	Справочник.рестМеню КАК рестМеню
	|ГДЕ
	|	рестМеню.Владелец В
	|			(ВЫБРАТЬ
	|				ВТ_ВидыМеню.ВидМеню
	|			ИЗ
	|				ВТ_ВидыМенюДоступные КАК ВТ_ВидыМеню)
	|	И НЕ рестМеню.ЭтоГруппа
	|	И НЕ рестМеню.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Меню.ИдентификаторМеню КАК ИдентификаторМеню
	|ПОМЕСТИТЬ ВТ_НедоступноеМеню
	|ИЗ
	|	ВТ_Меню КАК ВТ_Меню
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НедоступныеГруппы КАК ВТ_НедоступныеГруппы
	|		ПО (ВТ_Меню.ИдентификаторМеню В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					ВТ_НедоступныеГруппы.ИдентификаторМеню КАК ИдентификаторМеню
	|				ИЗ
	|					ВТ_НедоступныеГруппы КАК ВТ_НедоступныеГруппы))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Меню.ИдентификаторМеню
	|ИЗ
	|	ВТ_Меню КАК ВТ_Меню
	|ГДЕ
	|	ВТ_Меню.Выключен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	рестМеню.Ссылка
	|ИЗ
	|	Справочник.рестМеню КАК рестМеню
	|ГДЕ
	|	рестМеню.Владелец В
	|			(ВЫБРАТЬ
	|				ВТ_ВидыМеню.ВидМеню
	|			ИЗ
	|				ВТ_ВидыМенюНедоступные КАК ВТ_ВидыМеню)
	|	И НЕ рестМеню.ЭтоГруппа
	|	И НЕ рестМеню.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НедоступноеМеню.ИдентификаторМеню КАК ИдентификаторМеню
	|ИЗ
	|	ВТ_НедоступноеМеню КАК ВТ_НедоступноеМеню
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_НедоступноеМеню.ИдентификаторМеню";
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ФоновыеЗадания

Процедура ВыполнитьОчисткуСтарыхЗаписейХранилищаЗаданий(ВходныеПараметры = Неопределено) Экспорт
	
	ПериодАктуальностиЗаписей = Константы.ПериодАктуальностиХраненияТокеновСистемыИнтеграции.Получить();
	
	Если НЕ ЗначениеЗаполнено(ПериодАктуальностиЗаписей) Тогда
		ПериодАктуальностиЗаписей = 30;
	КонецЕсли;
	
	ИмяСобытия = НСтр("ru='Яндекс.Еда. Очистка старых записей хранила токенов'", "ru");
	
	НоваяДатаАктуальныхЗаписей = НачалоДня(ТекущаяДата()) - ПериодАктуальностиЗаписей*86400; 
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, ,, НСтр("ru='Начало выполнение фонового задания <Очистка старых токенов. Яндекс.Еда>'", "ru"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИдентификаторПриложения КАК ИдентификаторПриложения,
	|	СекретПриложения КАК СекретПриложения
	|ИЗ
	|	РегистрСведений.ХранилищеТокеновСистемыИнтеграции
	|ГДЕ
	|	ДатаЗавершения < &НоваяДатаАктуальныхЗаписей";
	Запрос.УстановитьПараметр("НоваяДатаАктуальныхЗаписей", НоваяДатаАктуальныхЗаписей);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		НачатьТранзакцию();
		Пока Выборка.Следующий() Цикл
			
			Попытка
				
				Запись = РегистрыСведений.ХранилищеТокеновСистемыИнтеграции.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				Запись.Удалить();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ИнфОбОшибке = ИнформацияОбОшибке();
				ТекстОшибки = ИнфОбОшибке.Описание;
				Пока ИнфОбОшибке.Причина <> Неопределено Цикл
					ИнфОбОшибке = ИнфОбОшибке.Причина;
					ТекстОшибки = ТекстОшибки + "
					|" + ИнфОбОшибке.Описание;
				КонецЦикла;
				ТекстОшибки = "Ошибка выполнения процедуры ""ВыполнитьОчисткуСтарыхЗаписейХранилищаЗаданий"": " + ТекстОшибки;
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
				
				Прервать;
			КонецПопытки;
			
		КонецЦикла;
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, ,, НСтр("ru='Завершение выполнения фонового задания <Очистка старых токенов. Яндекс.Еда>'", "ru"));

	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыИзЗаголовка(Заголовки, ВходныеПараметры, ИмяПоУмолчанию = "")
	
	СчетчикПустыхЭлементов = 1;
	Для Каждого ТекЗаголовок Из Заголовки Цикл
		
		ИмяЗаголовка = ТекЗаголовок.Ключ;
		
		Если ВРег(ИмяЗаголовка) = ВРег("token") Тогда
			
			ИмяЗаголовка = "Токен";
			
		КонецЕсли;
		
		ИмяЗаголовка = СтрЗаменить(ИмяЗаголовка, "-","_");
		ИмяЗаголовка = СтрЗаменить(ИмяЗаголовка, "*","");
		
		Если НЕ ЗначениеЗаполнено(ИмяЗаголовка) И ЗначениеЗаполнено(ИмяПоУмолчанию) Тогда
			ВходныеПараметры.Вставить(ИмяПоУмолчанию + Формат(СчетчикПустыхЭлементов, "ЧГ="), ТекЗаголовок.Значение);
			СчетчикПустыхЭлементов = СчетчикПустыхЭлементов + 1;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяЗаголовка) Тогда
			ВходныеПараметры.Вставить(ИмяЗаголовка, ТекЗаголовок.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВходныеПараметры;
	
КонецФункции

Процедура ЗафиксироватьОшибку(ПараметрыОбработки, КодОшибки = 0, КодРезультата = 500)
	
	ПараметрыОбработки.КодРезультата = КодРезультата;
	
	Если ЗначениеЗаполнено(КодОшибки) Тогда
		ТекстОшибки = "";
		Если КодОшибки = 1 Тогда
			ТекстОшибки = НСтр("ru = 'Не удалось прочитать сообщение'");
		ИначеЕсли КодОшибки = 2 Тогда
			ТекстОшибки = НСтр("ru='Обработка сообщения завершилась с ошибкой. Неизвестный тип запроса'", "ru");
		ИначеЕсли КодОшибки = 3 Тогда
			ТекстОшибки = НСтр("ru='Ошибка обработки запроса'", "ru");
		ИначеЕсли КодОшибки = 4 Тогда
			ТекстОшибки = НСтр("ru='Ресторан не найден'", "ru");
		ИначеЕсли КодОшибки = 5 Тогда
			ТекстОшибки = НСтр("ru='Ошибка сохранения заказа'", "ru");
		КонецЕсли;
		
		СтруктураОшибки = Новый Структура;
		СтруктураОшибки.Вставить("code" , КодОшибки);
		СтруктураОшибки.Вставить("description", ТекстОшибки);
		
		ПараметрыОбработки.МассивОшибок.Добавить(СтруктураОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗафиксироватьВыходныеПараметры(ПараметрыОбработки, ИмяПеременной, ЗначениеПременной)
	
	ПараметрыОбработки.ВыходныеПараметры.Вставить(ИмяПеременной, ЗначениеПременной);
	
КонецПроцедуры

Процедура ЗафиксироватьВСлужебномЛоге(Знач СтрокаСообщения, ПараметрыОбработки, ЭтоОтвет)
	
	Если ПараметрыОбработки.Свойство("РежимОтладки") Тогда
		
		Префикс = ?(ЭтоОтвет, "<--","-->");
		ТекстШапки = СтрШаблон("%1 %2 %3 %4", ТекущаяДата(), Префикс, ПараметрыОбработки.МетодЗапроса, ПараметрыОбработки.ОтносительныйURL);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения,Символы.ПС, "/n");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения,Символы.ВК, "");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения,Символы.Таб, "");
		
		Попытка
			Файл = Новый ЗаписьТекста();
			Файл.Открыть("C:\ЯндексЕда.txt",КодировкаТекста.UTF8," ",Истина);
			Файл.ЗаписатьСтроку("=============================================================================");
			Файл.ЗаписатьСтроку(Символы.ПС);
			Файл.ЗаписатьСтроку(ТекстШапки);
			Файл.ЗаписатьСтроку(Символы.ПС);
			Файл.ЗаписатьСтроку(СтрокаСообщения);
			Файл.ЗаписатьСтроку(Символы.ПС);
			Файл.Закрыть();
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			ТекстОшибки = ИнфОбОшибке.Описание;
			Пока ИнфОбОшибке.Причина <> Неопределено Цикл
				ИнфОбОшибке = ИнфОбОшибке.Причина;
				ТекстОшибки = ТекстОшибки + "
				|" + ИнфОбОшибке.Описание;
			КонецЦикла;
			ТекстОшибки = "Ошибка выполнения процедуры: " + ТекстОшибки;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СкорректироватьГУИД(ЗначениеГУИДа)
	
	ДлинаИдентификатора = СтрДлина(ЗначениеГУИДа);
	Если ДлинаИдентификатора = 36 Тогда
		// Значит все в норме.
		Возврат ЗначениеГУИДа;
	ИначеЕсли ДлинаИдентификатора < 32 Тогда
		// Не все символы пришли, а они нужны. 
		ЗначениеГУИДа = Прав("000000000000000000000000000000000000" + ЗначениеГУИДа, 32);
	КонецЕсли;
	ЗначениеГУИДа = СтрШаблон("%1-%2-%3-%4-%5", Сред(ЗначениеГУИДа, 1,8),Сред(ЗначениеГУИДа, 9,4),Сред(ЗначениеГУИДа, 13,4),Сред(ЗначениеГУИДа, 17,4), Сред(ЗначениеГУИДа, 21));
	ЗначениеГУИДа = ВРег(ЗначениеГУИДа);
	
	Возврат ЗначениеГУИДа;
КонецФункции

Функция ПолучитьСистемуИнтеграции(ТипСистемы, ИдентификаторСистемы) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	рестСистемыИнтеграции.Ссылка КАК СистемаИнтеграции,
	|	рестСистемыИнтеграции.ТипСистемы КАК ТипСистемы,
	|	рестСистемыИнтеграции.ИдентификаторСистемы КАК ИдентификаторСистемы,
	|	рестСистемыИнтеграции.ВидОплатыНаличные КАК ВидОплатыНаличные,
	|	рестСистемыИнтеграции.ВидОплатыПлатежнаяКарта КАК ВидОплатыПлатежнаяКарта
	|ИЗ
	|	Справочник.рестСистемыИнтеграции КАК рестСистемыИнтеграции
	|ГДЕ
	|	НЕ рестСистемыИнтеграции.ПометкаУдаления
	|	И рестСистемыИнтеграции.ИдентификаторСистемы = &ИдентификаторСистемы
	|	И рестСистемыИнтеграции.ТипСистемы = &ТипСистемы";
	Запрос.УстановитьПараметр("ИдентификаторСистемы", ИдентификаторСистемы);
	Запрос.УстановитьПараметр("ТипСистемы", ТипСистемы);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = СтруктураСистемыИнтеграции();
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция СтруктураСистемыИнтеграции() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("СистемаИнтеграции");
	Результат.Вставить("ТипСистемы");
	Результат.Вставить("ИдентификаторСистемы");
	Результат.Вставить("ВидОплатыНаличные");
	Результат.Вставить("ВидОплатыПлатежнаяКарта");
	Возврат Результат;
КонецФункции

Функция ЭтоJSON(Текст)
	Результат = ТипЗнч(Текст) = Тип("Строка") 
		И (СтрНачинаетсяС(СокрЛ(Текст), "{")
			ИЛИ СтрНачинаетсяС(СокрЛ(Текст), "["));
	Возврат Результат;
КонецФункции

// Функция - Преобразовать из JSON
//
// Параметры:
//  Свойство				 - Строка - Ключ строки.
//  Тип						 - Тип - Тип фабрики XDTO.
//  Значение				 - Произвольный - Значение.
//  ДополнительныеПараметры	 - Структура - Дополнительные параметры.
// 
// Возвращаемое значение:
//  Произвольный - Преобразованное значение.
//
Функция ПреобразоватьВJSON(Знач Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	ТипЭлемента = ТипЗнч(Значение);
	ИмяТипа = XMLТип(ТипЭлемента).ИмяТипа;
	ПреобразованноеЗначение = Неопределено;
	Попытка
		
		Если СтрНайти(ИмяТипа,"Ref") > 0 Тогда
			ПреобразованноеЗначение = ПолучитьИДПоСсылке(Значение);
		ИначеЕсли ИмяТипа = "Null" Тогда
			ПреобразованноеЗначение = "";
		ИначеЕсли ИмяТипа = "ValueStorage" Тогда
			ПреобразованноеЗначение = ЗначениеВСтрокуВнутр(Значение);
		Иначе
			// Неизвестно, что было отправлено.
			Отказ = Истина;
		КонецЕсли;
		
	Исключение
		Отказ = Истина;
		ИнфОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ИнфОбОшибке.Описание;
		Пока ИнфОбОшибке.Причина <> Неопределено Цикл
			ИнфОбОшибке = ИнфОбОшибке.Причина;
			ТекстОшибки = ТекстОшибки + "
			|" + ИнфОбОшибке.Описание;
		КонецЦикла;
		ТекстОшибки = "Ошибка выполнения процедуры ""ПреобразоватьВJSON"": " + ТекстОшибки;
		Событие = "ЯндексЕда";
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецПопытки;
	
	Возврат ПреобразованноеЗначение;
КонецФункции

Функция ПолучитьИДПоСсылке(Ссылка)
	
	Результат = "";
	
	Попытка
		
		Результат = XMLСтрока(Ссылка);
		
	Исключение
		
		ИнфОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ИнфОбОшибке.Описание;
		Пока ИнфОбОшибке.Причина <> Неопределено Цикл
			ИнфОбОшибке = ИнфОбОшибке.Причина;
			ТекстОшибки = ТекстОшибки + "
			|" + ИнфОбОшибке.Описание;
		КонецЦикла;
		ТекстОшибки = "Ошибка получения XML-представления ссылки <" + Ссылка + "> - " + ТекстОшибки;
		ЗаписьЖурналаРегистрации("ЯндексЕда", УровеньЖурналаРегистрации.Ошибка, , Ссылка, ТекстОшибки);
		
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

// Функция - Получить ставку НДС
//
// Параметры:
//  ЗначениеСтавкиНДС		 - 	 - 
//  УчитыватьРасчетныеСтавки - 	 - 
// 
// Возвращаемое значение:
//  Результат - Ставка ндс представленная строкой или 
//
Функция ПолучитьСтавкуНДС(ЗначениеСтавкиНДС, УчитыватьРасчетныеСтавки = Ложь)
	
	Результат = Неопределено;
	
	
	// Преобразование из перечисления в строку.
	Если ЗначениеСтавкиНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		
		Результат = 0;
		
	ИначеЕсли ЗначениеСтавкиНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		
		Результат = 10;
		
	ИначеЕсли ЗначениеСтавкиНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		
		Результат = 10;
		
	ИначеЕсли ЗначениеСтавкиНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		
		Результат = 18;
		
	ИначеЕсли ЗначениеСтавкиНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		
		Результат = 18;
		
	ИначеЕсли ЗначениеСтавкиНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		
		Результат = 20;
		
	ИначеЕсли ЗначениеСтавкиНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		
		Результат = 20;
		
	ИначеЕсли ЗначениеСтавкиНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		
		Результат = 0;
		
	ИначеЕсли ТипЗнч(ЗначениеСтавкиНДС) = Тип("ПеречислениеСсылка.СтавкиНДС") Тогда
		
		Результат = "0";
		
		
		
	// Обратное преобразование из строки в перечисление.
	ИначеЕсли ЗначениеСтавкиНДС = 10 
		ИЛИ (НЕ УчитыватьРасчетныеСтавки И ЗначениеСтавкиНДС = 10) Тогда
		
		Результат = Перечисления.СтавкиНДС.НДС10;
		
	ИначеЕсли ЗначениеСтавкиНДС = 10 Тогда
		
		Результат = Перечисления.СтавкиНДС.НДС10_110;
		
	ИначеЕсли ЗначениеСтавкиНДС = 18
		ИЛИ (НЕ УчитыватьРасчетныеСтавки И ЗначениеСтавкиНДС = 18) Тогда
		
		Результат = Перечисления.СтавкиНДС.НДС18;
		
	ИначеЕсли ЗначениеСтавкиНДС = 18 Тогда
		
		Результат = Перечисления.СтавкиНДС.НДС18_118;
		
	ИначеЕсли ЗначениеСтавкиНДС = 20
		ИЛИ (НЕ УчитыватьРасчетныеСтавки И ЗначениеСтавкиНДС = 20) Тогда
		
		Результат = Перечисления.СтавкиНДС.НДС20;
		
	ИначеЕсли ЗначениеСтавкиНДС = 20 Тогда
		
		Результат = Перечисления.СтавкиНДС.НДС20_120;
		
	ИначеЕсли ЗначениеСтавкиНДС = 0 Тогда
		
		Результат = Перечисления.СтавкиНДС.БезНДС;
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЕдиницуИзмеренияСтрокой(НаименованиеЕИ)
	
	Результат = Неопределено;
	
	
	// Преобразование из перечисления в строку.
	Если СтрНайти(НаименованиеЕИ, "мл") > 0 Тогда
		
		Результат = "мл";
		
	Иначе
		Результат = "г";
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Процедура ПолучитьПараметрыИзСтроки(ПараметрыОбработки, ТекстЗапроса)
	
	Если ПараметрыОбработки.Свойство("Content_Type")
		И ПараметрыОбработки.Content_Type = "application/x-www-form-urlencoded" Тогда
		ТекстЗапроса = РаскодироватьСтроку(ТекстЗапроса, СпособКодированияСтроки.URLВКодировкеURL)
	КонецЕсли;
	
	СписокПараметров = СтрРазделить(ТекстЗапроса, "&");
	Для Каждого ТекПараметр Из СписокПараметров Цикл
		ТекСвойство = СтрРазделить(ТекПараметр,"=", Истина);
		Если ТекСвойство.Количество() > 1 Тогда
			КлючСвойства = СокрЛП(ТекСвойство[0]);
			ЗначениеСвойства = СокрЛП(ТекСвойство[1]);
			ПараметрыОбработки.Вставить(КлючСвойства, ЗначениеСвойства);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьМассивПолейДат()
	Результат = Новый Массив;
	Результат.Добавить("deliveryDate");
	Результат.Добавить("courierArrivementDate");
	Возврат Результат;
КонецФункции

Функция ПолучитьПричинуОтменЗаказаПокупателей(Знач ТекстПричины)
	
	ТекстПричины = Лев(ТекстПричины, 100);
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПричиныОтменыЗаказовПокупателей.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПричиныОтменыЗаказовПокупателей КАК ПричиныОтменыЗаказовПокупателей
	|ГДЕ
	|	ПричиныОтменыЗаказовПокупателей.Наименование = &Наименование
	|	И НЕ ПричиныОтменыЗаказовПокупателей.ПометкаУдаления";
	Запрос.УстановитьПараметр("Наименование", );
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	СпрОбъект = Справочники.ПричиныОтменыЗаказовПокупателей.СоздатьЭлемент();
	СпрОбъект.Наименование = ТекстПричины; 
	СпрОбъект.Записать();
	
	Возврат СпрОбъект.Ссылка;
КонецФункции

Процедура ЗаполнитьДанныеПоКартинке(МассивКартинок, 
		Выборка, 
		СоответствиеКартинокНоменклатуры, 
		ШаблонАдресаПоУмолчанию,
		ИдентификаторМенюСтрокой)
	
	ХэшСумма = "";
	ПараметрКартинки1 = "0";
	ПараметрКартинки2 = "0";
	АдресКартинки = "";
	ДанныеКартинки = Неопределено;
	// Проверим есть ли данные в меню. 
	// Считаем, что проверять данные нужно только если есть имя.
	Если ЗначениеЗаполнено(Выборка.ИмяКартинкиМеню) Тогда
		
		Если СтрНачинаетсяС(Выборка.ИмяКартинкиМеню, "http") Тогда
			АдресКартинки = Выборка.ИмяКартинкиМеню; 
		КонецЕсли;
		
		ДанныеКартинки = Выборка.ДвоичныеДанныеФайлаМеню.Получить();
		// Если данные пустые, то параметр будем передавать 0.
		Если НЕ ДанныеКартинки = Неопределено Тогда
			ПараметрКартинки1 = ИдентификаторМенюСтрокой;
		КонецЕсли
		
	КонецЕсли;
	
	// Зафиксируем адрес номенклатуры.
	Если ЗначениеЗаполнено(Выборка.ФайлКартинкиНоменклатура) Тогда
		ПараметрКартинки2 = XMLСтрока(Выборка.ФайлКартинкиНоменклатура);
	КонецЕсли;
	
	// Если Данные картинки еще не были получены, то проверим получали ли мы их уже.
	Если НЕ ЗначениеЗаполнено(АдресКартинки) И ДанныеКартинки = Неопределено 
		И ЗначениеЗаполнено(Выборка.ФайлКартинкиНоменклатура) Тогда
		Если СоответствиеКартинокНоменклатуры[Выборка.ФайлКартинкиНоменклатура] = Неопределено Тогда
			ДанныеКартинки = Выборка.ДвоичныеДанныеФайлаНоменклатуры.Получить();
		Иначе
			ХэшСумма = СоответствиеКартинокНоменклатуры[Выборка.ФайлКартинкиНоменклатура];
		КонецЕсли;
	КонецЕсли;
	
	
	Если НЕ ДанныеКартинки = Неопределено Тогда
		ТекОбъектКартинка = СтруктураИзображения();
		
		Если ЗначениеЗаполнено(АдресКартинки) Тогда
			ТекОбъектКартинка.url = АдресКартинки;
		Иначе
			ТекОбъектКартинка.url = СтрШаблон("%1/menu/%2/%3", ШаблонАдресаПоУмолчанию, ПараметрКартинки1, ПараметрКартинки2);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ХэшСумма) Тогда
			Хеш = Новый ХешированиеДанных(ХешФункция.SHA1);
			Хеш.Добавить(ДанныеКартинки);
			ХэшСумма = НРег(СтрЗаменить(Хеш.ХешСумма, " ", ""))
		КонецЕсли;
		
		ТекОбъектКартинка.hash = ХэшСумма;
		// Если помещали картинку номенклатуры, то обновим данные по ее хэшу.
		Если ПараметрКартинки1 = "0" Тогда
			СоответствиеКартинокНоменклатуры[Выборка.ФайлКартинкиНоменклатура] = ХэшСумма;
		КонецЕсли;
		МассивКартинок.Добавить(ТекОбъектКартинка);
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает структуру цены для конструктора Формат()
//
// Возвращаемое значение:
//   Строка - Структура цены для конструктора Формат()
//
Функция ФорматЦены() Экспорт
	
	Возврат "ЧН=;ЧГ='';ЧРД='.';ЧДЦ=2";
	
КонецФункции // ФорматЦены(

Функция ОбработатьЗаказПокупателя(СтруктураСообщения, ПараметрыОбработки)
	Результат = Неопределено;
	
	ДанныеЗаказаПокупателя = СтруктураЗаказПокупателя();
	ЗаполнитьЗначенияСвойств(ДанныеЗаказаПокупателя, СтруктураСообщения);
	
	// Получим данные ресторана.
	ПараметрыЯндексЕда = ПолучитьСистемуИнтеграции(ПараметрыОбработки.ТипСистемИнтеграции,
		ДанныеЗаказаПокупателя.restaurantId);
	
	Если ПараметрыЯндексЕда = Неопределено Тогда
		ЗафиксироватьОшибку(ПараметрыОбработки,4,404);
		Возврат Результат;
	КонецЕсли;
	
	// Получим дополнительные данные документа.
	ДанныеДоставки = СтруктураДанныеДоставки();
	ЗаполнитьЗначенияСвойств(ДанныеДоставки,ДанныеЗаказаПокупателя.deliveryInfo);
	
	ДанныеАдреса = СтруктураАдрес();
	ЗаполнитьЗначенияСвойств(ДанныеАдреса, ДанныеДоставки.deliveryAddress);
	
	ДанныеОплаты = СтруктураДанныеОплаты();
	ЗаполнитьЗначенияСвойств(ДанныеОплаты, ДанныеЗаказаПокупателя.paymentInfo);
	
	РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	
	// Зафиксируем документ.
	Если ПараметрыОбработки.Свойство("orderId") Тогда
		ЗаказОбъект = ПолучитьОбъектПоИД(ПараметрыОбработки.orderId, Документы.ЗаказПокупателя,Ложь, Истина);
		Если ЗаказОбъект = Неопределено Тогда
			ЗафиксироватьОшибку(ПараметрыОбработки,4,404);
			Возврат Результат;
		КонецЕсли;
	Иначе
		ЗаказОбъект = Документы.ЗаказПокупателя.СоздатьДокумент();
		//ЗаказОбъект.УстановитьНовыйНомер("Y");
		ЗаказОбъект.Дата = ТекущаяДата();
		
		ЗаказОбъект.рестЭтап = Перечисления.рестЭтапыЗаказа.ПринятЗаказДоставки;
		ЗаказОбъект.Статус = Перечисления.СтатусыЗаказовПокупателей.НеСогласован;
	КонецЕсли;
	
	ПрименятьСкидки = Константы.рестПрименятьСкидкиЗаказовСистемыИнтеграциитеграции.Получить();
	
	#Область ШапкаДокумента
	
	ЗаказОбъект.рестИсточникЗаказа = ПараметрыЯндексЕда.СистемаИнтеграции;
	
	Если НЕ ЗначениеЗаполнено(ЗаказОбъект.Ответственный) Тогда
		ЗаказОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗаказОбъект.Магазин) Тогда
		ЗаказОбъект.Магазин = ПараметрыСеанса.ТекущийМагазин;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗаказОбъект.Склад ) Тогда
		СкладПродажиПоУмолчанию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказОбъект.Магазин, "СкладПродажи");
		ЗаказОбъект.Склад = СкладПродажиПоУмолчанию;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗаказОбъект.Продавец) Тогда
		ПродавецПоУмолчанию = Пользователи.АвторизованныйПользователь();//ЗначениеНастроекПовтИсп.ПродавецПользователяПоУмолчанию(ЗаказОбъект.Ответственный);
		ЗаказОбъект.Продавец = ПродавецПоУмолчанию;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗаказОбъект.Продавец) Тогда
		ЗаказОбъект.Продавец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказОбъект.Ответственный, "ФизическоеЛицо");
	КонецЕсли;
	
	ЗаказОбъект.ЦенаВключаетНДС = Истина;
	
	ЗаказОбъект.рестВидОперации = Перечисления.рестВидыОперацийЗаказПокупателя.ЗаказДоставки;
	ЗаказОбъект.НомерЗаказаНаСайте = ДанныеЗаказаПокупателя.eatsId;
	ЗаказОбъект.рестКоличествоГостей = ДанныеЗаказаПокупателя.persons;
	ЗаказОбъект.Комментарий = ДанныеЗаказаПокупателя.comment;
	
	Если ДанныеЗаказаПокупателя.discriminator = "yandex" Тогда
		ЗаказОбъект.рестКурьер = Справочники.ФизическиеЛица.рестКурьерЯндексЕда();
		Гость = Справочники.ФизическиеЛица.рестКлиентЯндексЕда();
		АдресДоставки = НСтр("ru='-'", "ru");
	Иначе
		//ДанныеГостяДоставки = Новый Структура;
		//ДанныеГостяДоставки.Вставить("Наименование",ДанныеДоставки.clientName);
		//ДанныеГостяДоставки.Вставить("Телефон",ДанныеДоставки.phoneNumber);
		//Гость = рестПолучениеДанных.ПолучитьНовоеФизическоеЛицо(ДанныеГостяДоставки, ЗаказОбъект.рестГость, 2);
		//АдресДоставки = ДанныеАдреса.full;
		АдресДоставки = "";
	КонецЕсли;
	
	Если ПараметрыОбработки.ТипСистемИнтеграции = Перечисления.ТипыСистемИнтеграции.ЯндексЕда Тогда
		рестАдресДоставкиСлужебный = ПреобразоватьАдресЯндексЕда(ДанныеАдреса.full);
	Иначе
		рестАдресДоставкиСлужебный = АдресДоставки;
	КонецЕсли;
	
	ЗаказОбъект.рестГость = Гость;
	ЗаказОбъект.АдресДоставки = АдресДоставки;
	ЗаказОбъект.рестАдресДоставкиСлужебный = рестАдресДоставкиСлужебный;
	
	// Если заполнена дата когда придет курьер, то требуется приготовить к ней.
	Если ЗначениеЗаполнено(ДанныеДоставки.courierArrivementDate) Тогда
		ДатаПриготовитьК = ДанныеДоставки.courierArrivementDate;
		ДатаДоставитьК = ДанныеДоставки.courierArrivementDate;
	ИначеЕсли ЗначениеЗаполнено(ДанныеДоставки.deliveryDate) Тогда
		ДатаПриготовитьК = ?((ДанныеДоставки.deliveryDate - 2700) > ТекущаяДата(),
			ДанныеДоставки.deliveryDate - 2700, 
			ДанныеДоставки.deliveryDate);
		ДатаДоставитьК = ДанныеДоставки.deliveryDate;
	Иначе
		ДатаПриготовитьК = ТекущаяДата();
		ДатаДоставитьК = ДатаПриготовитьК + 2700;
	КонецЕсли;
	
	Если ДатаПриготовитьК < ТекущаяДата() Тогда
		ДатаПриготовитьК = ТекущаяДата();
	КонецЕсли;
	
	Если ДатаДоставитьК < ТекущаяДата() Тогда
		ДатаДоставитьК = ТекущаяДата();
	КонецЕсли;
	
	ЗаказОбъект.ЖелаемаяДатаПродажи = ДатаПриготовитьК;
	ЗаказОбъект.рестДатаДоставки = ДатаДоставитьК;
	
	#КонецОбласти
	
	#Область ТЧТовары
	
	ТаблицаТовары = Новый ТаблицаЗначений;
	ТаблицаТовары.Колонки.Добавить("КлючСвязи", ОбщегоНазначения.ОписаниеТипаЧисло(5));
	ТаблицаТовары.Колонки.Добавить("КлючСвязиОсновнойПозиции", ОбщегоНазначения.ОписаниеТипаЧисло(5));
	ТаблицаТовары.Колонки.Добавить("Меню", Новый ОписаниеТипов(("СправочникСсылка.рестМеню")));
	ТаблицаТовары.Колонки.Добавить("Модификатор", Новый ОписаниеТипов(("СправочникСсылка.рестМодификаторы")));
	ТаблицаТовары.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ТаблицаТовары.Колонки.Добавить("Цена", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаТовары.Колонки.Добавить("СуммаРучнойСкидки", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	ТаблицаТовары.Колонки.Добавить("ПроцентРучнойСкидки", ОбщегоНазначения.ОписаниеТипаЧисло(5,2));
	
	КлючСвязи = 0;
	ЗначениеПроцентаСкидкиКакСуммы = (ПараметрыОбработки.ТипСистемИнтеграции = Перечисления.ТипыСистемИнтеграции.ЯндексЕда);
	Для Каждого ТекСтрокаЗаказа Из ДанныеЗаказаПокупателя.items Цикл
		
		КлючСвязи = КлючСвязи + 1;
		
		ДанныеСтрокиТоваров = СтруктураСтрокаТовары();
		ЗаполнитьЗначенияСвойств(ДанныеСтрокиТоваров, ТекСтрокаЗаказа);
		
		// Идентификатор вида акций пока не поддерживаем.
		Если СтрНачинаетсяС(ДанныеСтрокиТоваров.id ,"promo") Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементМеню = ПолучитьСсылкуПоИД(ДанныеСтрокиТоваров.id, Справочники.рестМеню);
		
		НоваяСтрокаТаблицы = ТаблицаТовары.Добавить();
		НоваяСтрокаТаблицы.КлючСвязи = КлючСвязи;
		НоваяСтрокаТаблицы.КлючСвязиОсновнойПозиции = 0;
		НоваяСтрокаТаблицы.Меню = ЭлементМеню;
		НоваяСтрокаТаблицы.Цена = ДанныеСтрокиТоваров.price;
		НоваяСтрокаТаблицы.Количество = ДанныеСтрокиТоваров.quantity;
		
		Если ПрименятьСкидки 
			И ЗначениеЗаполнено(ДанныеСтрокиТоваров.promo) Тогда
			СуммаТовара = НоваяСтрокаТаблицы.Количество * НоваяСтрокаТаблицы.Цена;
			СуммаСкидки = 0;
			Для Каждого ТекСтрокаСкидок Из ДанныеСтрокиТоваров.promo Цикл
				ДаннныеСкидки = СтруктураСтрокаСкидки();
				ЗаполнитьЗначенияСвойств(ДаннныеСкидки, ТекСтрокаСкидок);
				
				Если ДаннныеСкидки.type = "FIXED" 
					ИЛИ (ДаннныеСкидки.type = "PERCENTAGE" И ЗначениеПроцентаСкидкиКакСуммы) Тогда
					// По полученным данным при получении фиксированной суммы и процента приходит сумма.
					ЗначениеСкидки = Число(ДаннныеСкидки.discount);
					СуммаСкидки = СуммаСкидки + ЗначениеСкидки;
					
				ИначеЕсли НЕ ЗначениеПроцентаСкидкиКакСуммы И ДаннныеСкидки.type = "PERCENTAGE" Тогда
					// Сохраним на случай когда процент будет приходить как процент скидки.
					ЗначениеСкидки = Число(ДаннныеСкидки.discount);
					СуммаСкидки = СуммаСкидки + Окр((СуммаТовара*ЗначениеСкидки) / 100, 2);
	
				ИначеЕсли ДаннныеСкидки.type = "GIFT" Тогда
					// Товар как подарок.
					Если НоваяСтрокаТаблицы.Цена > 1 Тогда
						СуммаСкидки = (НоваяСтрокаТаблицы.Цена * НоваяСтрокаТаблицы.Количество) - 1;
					КонецЕсли;
					
					Продолжить;
				Иначе
					Продолжить;
				КонецЕсли;
				
				Если СуммаТовара > СуммаСкидки Тогда
					НоваяСтрокаТаблицы.СуммаРучнойСкидки = СуммаСкидки;
					
					Если СуммаТовара <> 0 Тогда
						НоваяСтрокаТаблицы.ПроцентРучнойСкидки = 100 * НоваяСтрокаТаблицы.СуммаРучнойСкидки / СуммаТовара;
					Иначе
						НоваяСтрокаТаблицы.ПроцентРучнойСкидки = 0;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		
		КлючСвязиОсновнойПозиции = КлючСвязи;
		Для Каждого ТекСтрокаМодификатора Из ДанныеСтрокиТоваров.modifications Цикл
			
			КлючСвязи = КлючСвязи + 1;
			ДанныеСтрокиМодификаторы = СтруктураСтрокаМодификаторы();
			ЗаполнитьЗначенияСвойств(ДанныеСтрокиМодификаторы, ТекСтрокаМодификатора);
			ЭлементМодификатор = ПолучитьСсылкуПоИД(ДанныеСтрокиМодификаторы.id, Справочники.рестМодификаторы);
			
			НоваяСтрокаТаблицыМодификатор = ТаблицаТовары.Добавить();
			НоваяСтрокаТаблицыМодификатор.КлючСвязи = КлючСвязи;
			НоваяСтрокаТаблицыМодификатор.КлючСвязиОсновнойПозиции = КлючСвязиОсновнойПозиции;
			НоваяСтрокаТаблицыМодификатор.Меню = ЭлементМеню;
			НоваяСтрокаТаблицыМодификатор.Модификатор = ЭлементМодификатор;
			НоваяСтрокаТаблицыМодификатор.Цена = ДанныеСтрокиМодификаторы.price;
			НоваяСтрокаТаблицыМодификатор.Количество = ДанныеСтрокиМодификаторы.quantity;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.КлючСвязи КАК КлючСвязи,
	|	Товары.КлючСвязиОсновнойПозиции КАК КлючСвязиОсновнойПозиции,
	|	Товары.Меню КАК Меню,
	|	Товары.Модификатор КАК Модификатор,
	|	Товары.Цена КАК Цена,
	|	Товары.Количество КАК Количество,
	|	Товары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	Товары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки
	|ПОМЕСТИТЬ ВТ_НовыеТовары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НовыеТовары.КлючСвязи КАК КлючСвязи,
	|	ВТ_НовыеТовары.КлючСвязиОсновнойПозиции КАК КлючСвязиОсновнойПозиции,
	|	ВТ_НовыеТовары.Меню КАК рестМеню,
	|	ВТ_НовыеТовары.Модификатор КАК рестМодификатор,
	|	ВТ_НовыеТовары.Цена КАК Цена,
	|	ВТ_НовыеТовары.Количество КАК Количество,
	|	ВТ_НовыеТовары.Количество КАК КоличествоУпаковок,
	|	ВТ_НовыеТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ВТ_НовыеТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_НовыеТовары.Модификатор = ЗНАЧЕНИЕ(Справочник.рестМодификаторы.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА рестМодификаторы.ДопНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|						ТОГДА рестМодификаторы.СлужебнаяНоменклатура
	|					ИНАЧЕ рестМодификаторы.ДопНоменклатура
	|				КОНЕЦ
	|		ИНАЧЕ рестМеню.Номенклатура
	|	КОНЕЦ КАК Номенклатура,
	|	рестМодификаторы.КоличествоНоменклатуры * ВТ_НовыеТовары.Количество КАК КоличествоНоменклатуры,
	|	ВЫБОР
	|		КОГДА ВТ_НовыеТовары.Модификатор = ЗНАЧЕНИЕ(Справочник.рестМодификаторы.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		ИНАЧЕ рестМеню.Номенклатура
	|	КОНЕЦ КАК НоменклатураОсновнойПозиции,
	|	рестМеню.Владелец КАК ВидМеню,
	|	рестМодификаторы.ЕдиницаИзмеренияНоменклатуры КАК ЕдиницаИзмеренияНоменклатуры
	|ИЗ
	|	ВТ_НовыеТовары КАК ВТ_НовыеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рестМеню КАК рестМеню
	|		ПО ВТ_НовыеТовары.Меню = рестМеню.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рестМодификаторы КАК рестМодификаторы
	|		ПО ВТ_НовыеТовары.Модификатор = рестМодификаторы.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	КлючСвязи";
	Запрос.УстановитьПараметр("Товары", ТаблицаТовары);
	РезультатЗапроса = Запрос.Выполнить();
	НоваяТаблицаТоваров = РезультатЗапроса.Выгрузить();//рестОбщегоНазначения.ВыгрузитьРезультатЗапроса(РезультатЗапроса);
	
	УслугаДоставки = Константы.рестУслугаДоставкиСистемыИнтеграциитеграции.Получить();
	Если НЕ ЗначениеЗаполнено(УслугаДоставки) Тогда
		УслугаДоставки = Справочники.Номенклатура.рестУслугаДоставки();
	КонецЕсли;
	
	УслугаДоставкиУжеВключена = Ложь;
	МассивКлючейОтмененныхМодификаторов = Новый Массив;
	Для Каждого ТекСтрокаТоваров Из ЗаказОбъект.Товары Цикл
		// В любом случае сбросим сохраненную ручную скидку.
		ТекСтрокаТоваров.СуммаРучнойСкидки = 0;
		ТекСтрокаТоваров.ПроцентРучнойСкидки = 0;
		
		// Выполним поиск строки, если строку нашли, то изменять данные по ней не будем.
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("КлючСвязи", ТекСтрокаТоваров.КлючСвязи);
		СтруктураПоиска.Вставить("Номенклатура", ТекСтрокаТоваров.Номенклатура);
		СтруктураПоиска.Вставить("рестМеню", ТекСтрокаТоваров.рестМеню);
		СтруктураПоиска.Вставить("рестМодификатор", ТекСтрокаТоваров.рестМодификатор);
		СтруктураПоиска.Вставить("КоличествоУпаковок", ТекСтрокаТоваров.КоличествоУпаковок);
		МассивСтрок = НоваяТаблицаТоваров.НайтиСтроки(СтруктураПоиска);
		Если ЗначениеЗаполнено(МассивСтрок) 
			И МассивКлючейОтмененныхМодификаторов.Найти(ТекСтрокаТоваров.КлючСвязи) = Неопределено Тогда
			НайденнаяСтрока = МассивСтрок[0];
			ТекСтрокаТоваров.СуммаРучнойСкидки = НайденнаяСтрока.СуммаРучнойСкидки;
			ТекСтрокаТоваров.ПроцентРучнойСкидки = НайденнаяСтрока.ПроцентРучнойСкидки;
			НоваяТаблицаТоваров.Удалить(НайденнаяСтрока);
			Продолжить;
		КонецЕсли;
		
		// Если строку не нашли в новой, то отменен ее только если это не услуга доставки.
		Если ТекСтрокаТоваров.Номенклатура = УслугаДоставки Тогда
			УслугаДоставкиУжеВключена = Истина;
			Продолжить;
		КонецЕсли;
		
		ТекСтрокаТоваров.Отменено = Истина;
		
		Если ЗначениеЗаполнено(ТекСтрокаТоваров.рестМодификатор) Тогда
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("КлючСвязи", ТекСтрокаТоваров.КлючСвязи);
			СтруктураПоиска.Вставить("Модификатор", ТекСтрокаТоваров.рестМодификатор);
			МассивСтрок = ЗаказОбъект.рестМодификаторы.НайтиСтроки(СтруктураПоиска);
			Если ЗначениеЗаполнено(МассивСтрок) Тогда
				ЗаказОбъект.рестМодификаторы.Удалить(МассивСтрок[0]);
				Продолжить;
			КонецЕсли;
		Иначе
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("КлючСвязиОсновнойПозиции", ТекСтрокаТоваров.КлючСвязи);
			СтруктураПоиска.Вставить("НоменклатураОсновнойПозиции", ТекСтрокаТоваров.Номенклатура);
			МассивСтрок = ЗаказОбъект.рестМодификаторы.НайтиСтроки(СтруктураПоиска);
			Для Каждого ТекСтрока Из МассивСтрок Цикл
				МассивКлючейОтмененныхМодификаторов.Добавить(ТекСтрока.КлючСвязи);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДанныеОплаты.deliveryFee)
		И НЕ УслугаДоставкиУжеВключена Тогда
		НоваяСтрока = НоваяТаблицаТоваров.Добавить();
		НоваяСтрока.Номенклатура = УслугаДоставки;
		НоваяСтрока.Цена = ДанныеОплаты.deliveryFee;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.КоличествоУпаковок = 1;
	КонецЕсли;
	
	СоответствиеЗанятыхКлючей = Новый Соответствие;
	
	// Обойдем новые строки и зафиксируем их.
	Для Каждого ТекСтрокаТоваров Из НоваяТаблицаТоваров Цикл
		НоваяСтрока = ЗаказОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТоваров);
		
		//рестМобильныйОфициант.ДозаполнитьСтрокуТЧТовары(НоваяСтрока, ЗаказОбъект, РабочееМесто, Истина);
		
		Если НЕ НоваяСтрока.КлючСвязи = ТекСтрокаТоваров.КлючСвязи Тогда
			СоответствиеЗанятыхКлючей[ТекСтрокаТоваров.КлючСвязи] = НоваяСтрока.КлючСвязи;
		КонецЕсли;
		
		//НоваяСтрока.рестСтатус = Перечисления.рестСтатусыЗаказов.Отменено;
		
		Если ЗначениеЗаполнено(ТекСтрокаТоваров.рестМодификатор)Тогда
			
			НоваяСтрокаМодификаторы = ЗаказОбъект.рестМодификаторы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаМодификаторы, ТекСтрокаТоваров);
			НоваяСтрокаМодификаторы.Модификатор = ТекСтрокаТоваров.рестМодификатор;
			НоваяСтрокаМодификаторы.Сумма = НоваяСтрока.Сумма;
			Если НЕ СоответствиеЗанятыхКлючей[ТекСтрокаТоваров.КлючСвязиОсновнойПозиции] = Неопределено  Тогда
				НоваяСтрокаМодификаторы.КлючСвязиОсновнойПозиции = СоответствиеЗанятыхКлючей[ТекСтрокаТоваров.КлючСвязиОсновнойПозиции];
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	#КонецОбласти
	
	#Область ТЧСкидки
	
	Если ПрименятьСкидки 
		И ЗначениеЗаполнено(ДанныеЗаказаПокупателя.promo) Тогда
		
		СуммаСкидки = 0;
		СуммаТоваров = 0;
		МассивНеОтмененныхТоваров = ЗаказОбъект.Товары.НайтиСтроки(Новый Структура("Отменено", Ложь));
		Для Каждого ТекСтрока Из МассивНеОтмененныхТоваров Цикл
			СуммаТоваров = СуммаТоваров + ТекСтрока.Сумма;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДанныеОплаты.deliveryFee) Тогда
			СуммаТоваров = СуммаТоваров - ДанныеОплаты.deliveryFee;
		КонецЕсли;
		
		// Выполним расчет общей суммы скидок.
		Для Каждого ТекСтрокаСкидок Из ДанныеЗаказаПокупателя.promo Цикл
			ДаннныеСкидки = СтруктураСтрокаСкидки();
			ЗаполнитьЗначенияСвойств(ДаннныеСкидки, ТекСтрокаСкидок);
			
			Если ДаннныеСкидки.type = "FIXED" 
				ИЛИ (ДаннныеСкидки.type = "PERCENTAGE" И ЗначениеПроцентаСкидкиКакСуммы) Тогда
				// Если фиксированная сумма.
				ЗначениеСкидки = Число(ДаннныеСкидки.discount);
				СуммаСкидки = СуммаСкидки + ЗначениеСкидки;
			ИначеЕсли НЕ ЗначениеПроцентаСкидкиКакСуммы И ДаннныеСкидки.type = "PERCENTAGE" Тогда
				// Если процент скидки.
				ЗначениеСкидки = Число(ДаннныеСкидки.discount);
				СуммаСкидки = СуммаСкидки + Окр((СуммаТоваров*ЗначениеСкидки) / 100, 2);
			ИначеЕсли ДаннныеСкидки.type = "GIFT" Тогда
				// Обработаем отдельно.
				Продолжить;
			Иначе
				Продолжить;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СуммаСкидки) Тогда
			//рестФронтыРесторанаСервер.НазначитьСкидкуВРучную(ЗаказОбъект, "Товары", СуммаСкидки, Истина,Ложь, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	// Выполним расчет скидок.
	УправляемыеСкидки = Новый СписокЗначений;
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Ложь);
	СтруктураПараметры.Вставить("УправляемыеСкидки",                УправляемыеСкидки);
	СтруктураПараметры.Вставить("ТолькоСообщенияПослеОформления",   Ложь);
	СтруктураПараметры.Вставить("РабочееМесто", РабочееМесто);
	СтруктураПараметры.Вставить("РасчетСФормы", Ложь);
	
	//рестФронтыРесторанаСервер.РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры, ЗаказОбъект);
	
	#КонецОбласти
	
	
	#Область ТЧОплата
	
	// Зафиксируем оплату.
	Если ДанныеОплаты.paymentType = "CARD" Тогда
		ВидОплаты = ПараметрыЯндексЕда.ВидОплатыПлатежнаяКарта;
	ИначеЕсли ДанныеОплаты.paymentType = "CASH" Тогда
		ВидОплаты = ПараметрыЯндексЕда.ВидОплатыНаличные;
	Иначе
		ВидОплаты = Неопределено;
	КонецЕсли;
	
	ЗаказОбъект.рестПредварительнаяОплата.Очистить();
	Если ЗначениеЗаполнено(ВидОплаты) Тогда
		ПредварительнаяОплата = ЗаказОбъект.рестПредварительнаяОплата.Добавить();
		ПредварительнаяОплата.ВидОплаты = ВидОплаты;
		Если ДанныеОплаты.paymentType = "CASH" 
			И ЗначениеЗаполнено(ДанныеОплаты.change)
			И ДанныеОплаты.change > ДанныеОплаты.itemsCost Тогда
			СуммаОплаты = ДанныеОплаты.change;
			СуммаСдачи = ДанныеОплаты.change - ДанныеОплаты.itemsCost;
		Иначе
			СуммаОплаты = ДанныеОплаты.itemsCost;
			СуммаСдачи = 0;
		КонецЕсли;
		ПредварительнаяОплата.рестФискальный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидОплаты,"рестФискальный");
		ПредварительнаяОплата.Сумма = СуммаОплаты;
		ПредварительнаяОплата.рестСуммаСдачи = СуммаСдачи;
	КонецЕсли;
	#КонецОбласти
	
	// Зафиксируем все данные.
	Попытка
		
		// Запишем документ заказа.
		ЗаказОбъект.Записать();
		Результат = ЗаказОбъект.Ссылка;
	
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ИнфОбОшибке.Описание;
		Пока ИнфОбОшибке.Причина <> Неопределено Цикл
			ИнфОбОшибке = ИнфОбОшибке.Причина;
			ТекстОшибки = ТекстОшибки + "
			|" + ИнфОбОшибке.Описание;
		КонецЦикла;
		ТекстОшибки = "Ошибка выполнения процедуры ""ОбработатьЗаказПокупателя"": " + ТекстОшибки;
		Событие = "ЯндексЕда";
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		ЗафиксироватьОшибку(ПараметрыОбработки,5);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьАдресЯндексЕда(АдресЯндексЕда)
	
	СтруктураАдреса = ПреобразоватьАдресБСПВАдресРесторана(АдресЯндексЕда, );
	// Т.к. разделить : приходит не всегда, то уберем его как лишний символ.
	АдресЯндексЕда = СтрЗаменить(АдресЯндексЕда, ":","");
	
	МассивЧастейАдреса = СтрРазделить(АдресЯндексЕда,",");
	
	Для Каждого ТекЧасть Из МассивЧастейАдреса Цикл
		
		Если ТекЧасть = "Россия" Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтруктураАдреса.Регион) Тогда
			
			СтруктураАдреса.Регион = ТекЧасть;
			
		ИначеЕсли (СтрНайти(ТекЧасть,"район") > 0 
			ИЛИ СтрНайти(ТекЧасть,"р-н") > 0)
			И НЕ ЗначениеЗаполнено(СтруктураАдреса.Район) Тогда
			
			СтруктураАдреса.Район = ТекЧасть;
			
		ИначеЕсли (СтрНайти(ТекЧасть,"город") > 0 ИЛИ СтрНайти(ТекЧасть,"г.") > 0)
			И НЕ ЗначениеЗаполнено(СтруктураАдреса.Город) Тогда
			
			ТекЧасть = СтрЗаменить(ТекЧасть, "город", "");
			ТекЧасть = СтрЗаменить(ТекЧасть, "г.", "");
			
			СтруктураАдреса.Город = ТекЧасть;
			СтруктураАдреса.ГородСокращение = "г.";
			
		ИначеЕсли (СтрНайти(ТекЧасть,"село") > 0 ИЛИ СтрНайти(ТекЧасть,"с.") > 0)
			И НЕ ЗначениеЗаполнено(СтруктураАдреса.НаселенныйПункт) Тогда
			
			ТекЧасть = СтрЗаменить(ТекЧасть, "село", "");
			ТекЧасть = СтрЗаменить(ТекЧасть, "с.", "");
			
			СтруктураАдреса.НаселенныйПункт = ТекЧасть;
			
		ИначеЕсли (СтрНайти(ТекЧасть,"улица") > 0 ИЛИ СтрНайти(ТекЧасть,"ул.") > 0)
			И НЕ ЗначениеЗаполнено(СтруктураАдреса.Улица) Тогда
			ТекЧасть = СтрЗаменить(ТекЧасть, "улица", "");
			ТекЧасть = СтрЗаменить(ТекЧасть, "ул.", "");
			
			СтруктураАдреса.Улица = ТекЧасть;
			СтруктураАдреса.УлицаСокращение = "ул.";
			
		ИначеЕсли (СтрНайти(ТекЧасть,"дом") > 0 ИЛИ СтрНайти(ТекЧасть,"д.") > 0)
			И НЕ ЗначениеЗаполнено(СтруктураАдреса.Дом) Тогда
			
			ТекЧасть = СтрЗаменить(ТекЧасть, "дом", "");
			ТекЧасть = СтрЗаменить(ТекЧасть, "д.", "");
			
			СтруктураАдреса.Дом = ТекЧасть;
			
		ИначеЕсли (СтрНайти(ТекЧасть,"корпус") > 0 
			ИЛИ СтрНайти(ТекЧасть,"корп.") > 0 
			ИЛИ СтрНайти(ТекЧасть,"к.") > 0
			ИЛИ СтрНайти(ТекЧасть,"строение") > 0)
			И НЕ ЗначениеЗаполнено(СтруктураАдреса.Корпус) Тогда
			
			ТекЧасть = СтрЗаменить(ТекЧасть, "корпус", "");
			ТекЧасть = СтрЗаменить(ТекЧасть, "корп.", "");
			ТекЧасть = СтрЗаменить(ТекЧасть, "строение", "");
			
			СтруктураАдреса.Корпус = ТекЧасть;
		ИначеЕсли (СтрНайти(ТекЧасть,"подъезд") > 0 ИЛИ СтрНайти(ТекЧасть,"под.") > 0)
			И НЕ ЗначениеЗаполнено(СтруктураАдреса.Подъезд) Тогда
			
			ТекЧасть = СтрЗаменить(ТекЧасть, "подъезд", "");
			ТекЧасть = СтрЗаменить(ТекЧасть, "под.", "");
			
			СтруктураАдреса.Подъезд = ТекЧасть;
		ИначеЕсли (СтрНайти(ТекЧасть,"этаж") > 0 ИЛИ СтрНайти(ТекЧасть,"э.") > 0)
			И НЕ ЗначениеЗаполнено(СтруктураАдреса.Этаж) Тогда
			
			ТекЧасть = СтрЗаменить(ТекЧасть, "этаж", "");
			ТекЧасть = СтрЗаменить(ТекЧасть, "э.", "");
			
			СтруктураАдреса.Этаж = ТекЧасть;
			
		ИначеЕсли (СтрНайти(ТекЧасть,"домофон") > 0)
			И НЕ ЗначениеЗаполнено(СтруктураАдреса.Домофон) Тогда
			
			ТекЧасть = СтрЗаменить(ТекЧасть, "код домофона", "");
			ТекЧасть = СтрЗаменить(ТекЧасть, "домофон", "");
			СтруктураАдреса.Домофон = ТекЧасть;
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = СформироватьАдресРесторана(СтруктураАдреса);
	Возврат Результат;
КонецФункции


//дополнительно

// Функция - Города регионы.
// 
// Возвращаемое значение:
//  Массив - Города, которые приравниваются к регионам. Например, города федерального значения.
//
Функция ГородаФедеральногоЗначения() Экспорт 
	Результат = Новый Массив;
	Результат.Добавить("Севастополь");
	Результат.Добавить("Москва");
	Результат.Добавить("Санкт-Петербург");
	Результат.Добавить("Байконур");
	Возврат Результат;
КонецФункции

// Функция - Структура адреса ресторан.
// 
// Возвращаемое значение:
//  Структура - Пустая структура адреса.
//
Функция СтруктураАдресаРесторан() Экспорт
	
	СтруктураАдреса = Новый Структура;
	СтруктураАдреса.Вставить("Индекс");
	СтруктураАдреса.Вставить("Регион");
	СтруктураАдреса.Вставить("Район");
	СтруктураАдреса.Вставить("Город");
	СтруктураАдреса.Вставить("НаселенныйПункт");
	СтруктураАдреса.Вставить("Улица");
	СтруктураАдреса.Вставить("Дом");
	СтруктураАдреса.Вставить("Корпус");
	СтруктураАдреса.Вставить("Квартира");
	СтруктураАдреса.Вставить("Подъезд");
	СтруктураАдреса.Вставить("Этаж");
	СтруктураАдреса.Вставить("Домофон");
	СтруктураАдреса.Вставить("Станция");
	СтруктураАдреса.Вставить("Зона");
	СтруктураАдреса.Вставить("Комментарий");
	
	// Для обработной совместимости с БСП.
	СтруктураАдреса.Вставить("РегионСокращение", "");
	СтруктураАдреса.Вставить("ГородСокращение", "");
	СтруктураАдреса.Вставить("РайонСокращение", "");
	СтруктураАдреса.Вставить("НаселенныйПунктСокращение", "");
	СтруктураАдреса.Вставить("УлицаСокращение", "");
	СтруктураАдреса.Вставить("ИдентификаторАдресногоОбъекта", "");
	СтруктураАдреса.Вставить("Комментарий");
	
	Возврат СтруктураАдреса;
	
КонецФункции

// Получает ссылку объекта ИБ по его идентификатору.
//
// Параметры:
// 	ИДСтрокой     	- Строка - Идентификатор объекта.
// 	МенеджерОбъекта - Менеджер - Менеджер объекта.
//
// Возвращаемое значение:
//	Ссылка - Ссылка объекта ИБ.
//
Функция ПолучитьИДПоСтроке(Знач ИДСтрокой) Экспорт 
	
	ИДСтрокой = СтрЗаменить(ИДСтрокой, "{", "");
	ИДСтрокой = СтрЗаменить(ИДСтрокой, "}", "");
	
	Возврат ИДСтрокой;
	
КонецФункции

// Получает объект ИБ по его идентификатору.
//
// Параметры:
// 	ИДСтрокой     	- Строка - Идентификатор объекта.
// 	МенеджерОбъекта - Менеджер - Менеджер объекта.
// 	ЭтоГруппа     	- Булево - Флаг группы.
// 	СоздаватьОбъект - Булево - Флаг необходимости создания объекта.
//
// Возвращаемое значение:
//	Массив - Массив родителей всех уровней.
//
Функция ПолучитьОбъектПоИД(Знач ИДСтрокой, МенеджерОбъекта, ЭтоГруппа, СоздаватьОбъект = Истина) Экспорт
	ОбъектСсылка = ПолучитьСсылкуПоИД(ИДСтрокой, МенеджерОбъекта);
	Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбъектБазыДанных = ОбъектСсылка.ПолучитьОбъект();
	Если ОбъектБазыДанных = Неопределено Тогда
		Если СоздаватьОбъект Тогда
			Если НЕ Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) Тогда
				Если ЭтоГруппа Тогда
					Объект = МенеджерОбъекта.СоздатьГруппу();
				Иначе
					Объект = МенеджерОбъекта.СоздатьЭлемент();
				КонецЕсли; 
			Иначе
				Объект = МенеджерОбъекта.СоздатьДокумент();
			КонецЕсли; 
			Объект.УстановитьСсылкуНового(ОбъектСсылка);
		Иначе
			Объект = ОбъектБазыДанных;
		КонецЕсли; 
	Иначе
		Объект = ОбъектБазыДанных;
	КонецЕсли;
	
	Возврат Объект;
	
КонецФункции

// Получает ссылку по ее идентификатору.
//
// Параметры:
//  ИсхИДСтрокой	 - Строка - Строковое представление идентификатора.
//  МенеджерОбъекта	 - Менеджер - Менеджер объекта.
//  ПроверитьНаличие - Булево - Флаг необходимости проверить наличие в базе объекта с такой ссылкой.
// 
// Возвращаемое значение:
//  ЛюбаяСсылка - Искомая ссылка.
//
Функция ПолучитьСсылкуПоИД(Знач ИсхИДСтрокой, МенеджерОбъекта, ПроверитьНаличие = Ложь) Экспорт
	
	Результат = МенеджерОбъекта.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ИсхИДСтрокой) Тогда
		
		// Преобразуем в корректное значение ID
		ИДСтрокой = ПолучитьИДПоСтроке(ИсхИДСтрокой);
		// Получение ИД из строки
		ИД = Новый УникальныйИдентификатор(ИДСтрокой);
		// Получение ссылки по ИД
		Результат = МенеджерОбъекта.ПолучитьСсылку(ИД);
		// Проверяем есть объект в нашей БД
		Если ПроверитьНаличие Тогда
			Если ПустаяСтрока(Результат.ВерсияДанных) Тогда
				// Такого объекта в базе нет
				Результат = МенеджерОбъекта.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
	// Возврат ссылки (без проверки не исключается что "битая").
	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьАдресБСПВАдресРесторана(КонтактнаяИнформацияБСП, ДанныеОбАдресеБСП) Экспорт
	
	СтруктураАдресаРесторан = СтруктураАдресаРесторан();
	
	Если ДанныеОбАдресеБСП = Неопределено Тогда
		Если НЕ УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВJSON(КонтактнаяИнформацияБСП) Тогда
			// Если пришло не значение, а просто Строка, то преобразуем ее в правильную.
			КонтактнаяИнформацияБСП = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(КонтактнаяИнформацияБСП, Перечисления.ТипыКонтактнойИнформации.Адрес);
		КонецЕсли;
		// Считаем что пришло поле БСП в json или xml.
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("КодыАдреса", Истина);
	
		ДанныеОбАдресеБСП = УправлениеКонтактнойИнформацией.СведенияОбАдресе(КонтактнаяИнформацияБСП,ДополнительныеПараметры);
		
	КонецЕсли;
	
	// Если адрес в свободной форме, значит адрес не распознается.
	Если НЕ ДанныеОбАдресеБСП.ТипАдреса = "ВСвободнойФорме" Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураАдресаРесторан, ДанныеОбАдресеБСП);
		
		// Заполним номер дома.
		Если ДанныеОбАдресеБСП.Здание.Свойство("Номер") Тогда
			СтруктураАдресаРесторан.Дом = ДанныеОбАдресеБСП.Здание.Номер;
		КонецЕсли;
		
		// Заполним данные о корпусе.
		Если ЗначениеЗаполнено(ДанныеОбАдресеБСП.Корпуса) Тогда
			Для Каждого ТекЭлемент Из ДанныеОбАдресеБСП.Корпуса Цикл
				Если ТекЭлемент.ТипКорпуса = "Корпус" Тогда
					СтруктураАдресаРесторан.Корпус = ТекЭлемент.Номер;
				ИначеЕсли ТекЭлемент.ТипКорпуса = "Строение" Тогда
					// Будем считать строение и корпус аналогичным понятием.
					СтруктураАдресаРесторан.Корпус = ТекЭлемент.Номер;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Заполним данные о прочих реквизитах.
		Если ЗначениеЗаполнено(ДанныеОбАдресеБСП.Помещения) Тогда
			
			СоответствиеПолей = Новый Соответствие;
			СоответствиеПолей.Вставить("Квартира", "Квартира");
			СоответствиеПолей.Вставить("Подъезд", "Подъезд");
			СоответствиеПолей.Вставить("Этаж", "Этаж");
			СоответствиеПолей.Вставить("Домофон", "Домофон");
			СоответствиеПолей.Вставить("Станция", "Станция");
			СоответствиеПолей.Вставить("Зона", "Зона");
			
			Для Каждого ТекЭлемент Из ДанныеОбАдресеБСП.Помещения Цикл
				
				НайденноеПоле = СоответствиеПолей.Получить(ТекЭлемент.ТипПомещения);
				Если НЕ НайденноеПоле = Неопределено Тогда
					СтруктураАдресаРесторан[НайденноеПоле] = ТекЭлемент.Номер;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеОбАдресеБСП.РегионТипКраткий) Тогда
			СтруктураАдресаРесторан.РегионСокращение = ДанныеОбАдресеБСП.РегионТипКраткий;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеОбАдресеБСП.ГородТипКраткий) Тогда
			СтруктураАдресаРесторан.ГородСокращение = ДанныеОбАдресеБСП.ГородТипКраткий;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураАдресаРесторан;
КонецФункции

Функция СформироватьАдресРесторана(ВходнаяСтруктура, СтруктураСоответствий = Неопределено, ОтображатьСокращения = Истина) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураСоответствий) Тогда
		СтруктураСоответствий = Новый Структура;
	КонецЕсли;
	
	// Получим пустую структуру и заполним ее, чтобы все поля были точно на месте.
	АдресРесторана = СтруктураАдресаРесторан();
	ЗаполнитьЗначенияСвойств(АдресРесторана, ВходнаяСтруктура);
	
	// Заполним поля, которые отличаются во входной структуре.
	// Ключ - Наименование поля во входной структуре.
	// Значение - Наименование поля в выходной структуре.
	Для Каждого ТекСвойство Из СтруктураСоответствий Цикл
		Если АдресРесторана.Свойство(ТекСвойство.Значение) Тогда
			АдресРесторана[ТекСвойство.Значение] = ВходнаяСтруктура[ТекСвойство.Ключ];
		КонецЕсли;
	КонецЦикла;
	
	// Если город имеет статус федеральный, то пропустим его.
	ГородаИсключения = ГородаФедеральногоЗначения();
	Если НЕ ГородаИсключения.Найти(АдресРесторана.Город) = Неопределено Тогда
		АдресРесторана.Город = "";
	КонецЕсли;
	
	МассивПолей = Новый Массив;
	ШаблонПолей = "%1 %2";
	Для Каждого ТекСвойство Из АдресРесторана Цикл
		ТекЗначение = "";
		Если СтрЗаканчиваетсяНа(ТекСвойство.Ключ, "Сокращение") Тогда
			Продолжить;
		ИначеЕсли ЗначениеЗаполнено(ТекСвойство.Значение) 
			И ОтображатьСокращения Тогда
			Если ТекСвойство.Ключ = "Регион" Тогда
				ТекЗначение = СтрШаблон(ШаблонПолей, АдресРесторана.Регион, АдресРесторана.РегионСокращение);
			ИначеЕсли ТекСвойство.Ключ = "Город" Тогда
				ТекЗначение = СтрШаблон(ШаблонПолей, АдресРесторана.Город, АдресРесторана.ГородСокращение);
			ИначеЕсли ТекСвойство.Ключ = "Улица" Тогда
				ТекЗначение = СтрШаблон(ШаблонПолей, ТекСвойство.Значение, АдресРесторана.УлицаСокращение);
			ИначеЕсли ТекСвойство.Ключ = "Район" Тогда
				ТекЗначение = СтрШаблон(ШаблонПолей, ТекСвойство.Значение, АдресРесторана.РайонСокращение);
			ИначеЕсли ТекСвойство.Ключ = "НаселенныйПункт" Тогда
				ТекЗначение = СтрШаблон(ШаблонПолей, ТекСвойство.Значение, АдресРесторана.НаселенныйПунктСокращение);
			ИначеЕсли ТекСвойство.Ключ = "Индекс" Тогда
				ТекЗначение = ТекСвойство.Значение;
			Иначе
				ТекЗначение = СтрШаблон(ШаблонПолей, НРег(ТекСвойство.Ключ), ТекСвойство.Значение);
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(ТекСвойство.Значение) 
			И НЕ ОтображатьСокращения Тогда
			
			Если ТекСвойство.Ключ = "Регион" Тогда
				ТекЗначение = АдресРесторана.Регион;
			ИначеЕсли ТекСвойство.Ключ = "Город" Тогда
				ТекЗначение = АдресРесторана.Город;
			Иначе
				ТекЗначение = ТекСвойство.Значение;
			КонецЕсли;
			
		КонецЕсли;
		МассивПолей.Добавить(СокрЛП(ТекЗначение));
	КонецЦикла;
	Результат = СтрСоединить(МассивПолей, ",");
	Возврат Результат;
КонецФункции


#КонецОбласти