// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  МаркерыАвторизации - Массив из см. УчетныеЗаписиЭДОЦентрЭДО.НовыйМаркерАвторизацииПоУчетнойЗаписиЭДО
//
// Возвращаемое значение:
//  Структура:
//  * ДатаПоследнегоПолучения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
Функция ПолучитьЧерезИнтервал(МаркерыАвторизации = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(МаркерыАвторизации) Тогда
		ДатаПоследнегоПолучения = '00010101';
	Иначе
		ДатаПоследнегоПолучения = Константы.ДатаАвтоматическогоПолученияЭДО.Получить();
	КонецЕсли;
	
	ТребуетсяПолучение = АвтоматическоеПолучениеЭДО.ТребуетсяПолучениеЧерезИнтервал(Ложь, ДатаПоследнегоПолучения);
	Если ТребуетсяПолучение Тогда
		
		РасшифрованныеМаркеры = ЭлектронныеДокументыЭДОЦентрЭДО.РасшифрованныеМаркерыИзМаркеровАвторизации(
			МаркерыАвторизации);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
		ПараметрыВыполнения.ОжидатьЗавершение = 7;
		ПараметрыВыполнения.КлючФоновогоЗадания = АвтоматическоеПолучениеЭДО.КлючЗадания();
		ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
			"АвтоматическоеПолучениеЭДО.ПолучитьЧерезИнтервал", РасшифрованныеМаркеры); // См. АвтоматическоеПолучениеЭДО.ПолучитьЧерезИнтервал
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ДатаПоследнегоПолучения", ОбщегоНазначенияБЭД.ДатаВФорматеISO(ДатаПоследнегоПолучения));
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторыУчетныхЗаписейЭДО - Массив Из Строка 
//  МаркерыАвторизации - Массив из Структура:
//  * ИдентификаторУчетнойЗаписиЭДО - Строка
//  * ОтпечатокСертификата - Строка
//  * Данные - Строка - двоичные данные в формате base64.
// 
// Возвращаемое значение:
//  См. РезультатВключенияИспользованияКлючаДоступаКСервисуЭДО
Функция ВключитьИспользованиеКлючаДоступаКСервисуЭДО(ИдентификаторыУчетныхЗаписейЭДО, МаркерыАвторизации) Экспорт
	
	Результат = РезультатВключенияИспользованияКлючаДоступаКСервисуЭДО();
	
	РасшифрованныеМаркеры = ЭлектронныеДокументыЭДОЦентрЭДО.РасшифрованныеМаркерыИзМаркеровАвторизации(
		МаркерыАвторизации);
	
	РезультатВключения = АвтоматическоеПолучениеЭДО.ВключитьПоУчетнымЗаписямЭДО(
		ИдентификаторыУчетныхЗаписейЭДО, РасшифрованныеМаркеры);
	
	Если РезультатВключения = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОшибкиВключения = ОбработкаНеисправностейБЭДКлиентСервер.ПолучитьОшибки(РезультатВключения.КонтекстДиагностики);
	Для Каждого Ошибка Из ОшибкиВключения Цикл
		Результат.Ошибки.Добавить(Ошибка.КраткоеПредставлениеОшибки);
	КонецЦикла;
	
	Для Каждого КлючЗначение Из РезультатВключения.СостояниеПоИдентификаторамЭДО Цикл
		СостояниеВключения = КлючЗначение.Значение;
		ИдентификаторЭДО = КлючЗначение.Ключ;
		
		СостояниеВключенияИдентификаторовЭДО = НовоеСостояниеВключенияИдентификаторовЭДО();
		СостояниеВключенияИдентификаторовЭДО.ИдентификаторЭДО = ИдентификаторЭДО;
		СостояниеВключенияИдентификаторовЭДО.ЕстьОшибки = СостояниеВключения.ЕстьОшибки;
		СостояниеВключенияИдентификаторовЭДО.Остановлено = СостояниеВключения.Остановлено;
		
		Результат.СостоянияВключенияИдентификаторовЭДО.Добавить(СостояниеВключенияИдентификаторовЭДО);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторыУчетныхЗаписейЭДО - Массив Из Строка 
//  МаркерыАвторизации - Массив из Структура:
//  * ИдентификаторУчетнойЗаписиЭДО - Строка
//  * ОтпечатокСертификата - Строка
//  * Данные - Строка - двоичные данные в формате base64.
// 
// Возвращаемое значение:
//  См. РезультатВключенияВФорматеСервиса
Функция ВключитьАвтоматическоеПолучениеЭДО(ИдентификаторыУчетныхЗаписейЭДО, МаркерыАвторизации) Экспорт
	
	Результат = АвтоматическоеПолучениеЭДО.НовыйРезультатВключенияПоУчетнымЗаписямЭДО();
	
	СостоянияПолучения = РегистрыСведений.СостоянияАвтоматическогоПолученияЭДО.СостояниеПоИдентификаторамЭДО(
		ИдентификаторыУчетныхЗаписейЭДО);
	
	ИдентификаторыЭДОДляВключения = Новый Массив; // Массив из Строка
	
	Для Каждого ИдентификаторЭДО Из ИдентификаторыУчетныхЗаписейЭДО Цикл
		Состояние = СостоянияПолучения[ИдентификаторЭДО];
		Если Состояние = Неопределено Или Состояние.Остановлено Тогда
			ИдентификаторыЭДОДляВключения.Добавить(ИдентификаторЭДО);
		Иначе
			Результат.СостояниеПоИдентификаторамЭДО.Вставить(ИдентификаторЭДО, Состояние);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИдентификаторыЭДОДляВключения) Тогда
		
		РасшифрованныеМаркеры = ЭлектронныеДокументыЭДОЦентрЭДО.РасшифрованныеМаркерыИзМаркеровАвторизации(
			МаркерыАвторизации);
		
		РезультатВключения = АвтоматическоеПолучениеЭДО.ВключитьПоУчетнымЗаписямЭДО(ИдентификаторыЭДОДляВключения, РасшифрованныеМаркеры);
		
		Результат.КонтекстДиагностики = РезультатВключения.КонтекстДиагностики;
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(Результат.СостояниеПоИдентификаторамЭДО,
			РезультатВключения.СостояниеПоИдентификаторамЭДО, Истина);
		
	КонецЕсли;
	
	Возврат РезультатВключенияВФорматеСервиса(Результат);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  РезультатВключения - см. АвтоматическоеПолучениеЭДО.ВключитьПоУчетнымЗаписямЭДО
//
// Возвращаемое значение:
//  Структура:
//  * СостоянияВключенияИдентификаторовЭДО - Массив из См. НовоеСостояниеВключенияИдентификаторовЭДО
//  * Ошибки - Массив Из Строка
Функция РезультатВключенияВФорматеСервиса(РезультатВключения)
	
	СостоянияВФорматеСервиса = Новый Массив; //  Массив из См. НовоеСостояниеВключенияИдентификаторовЭДО
	ОшибкиВФорматеСервиса = Новый Массив; // Массив Из Строка
	
	РезультатВФорматеСервиса = Новый Структура;
	РезультатВФорматеСервиса.Вставить("СостоянияВключенияИдентификаторовЭДО", СостоянияВФорматеСервиса);
	РезультатВФорматеСервиса.Вставить("Ошибки", ОшибкиВФорматеСервиса);
	
	Если РезультатВключения = Неопределено Тогда
		Возврат РезультатВФорматеСервиса;
	КонецЕсли;
	
	ОшибкиВключения = ОбработкаНеисправностейБЭДКлиентСервер.ПолучитьОшибки(РезультатВключения.КонтекстДиагностики);
	Для Каждого Ошибка Из ОшибкиВключения Цикл
		ОшибкиВФорматеСервиса.Добавить(Ошибка.КраткоеПредставлениеОшибки);
	КонецЦикла;
	
	Для Каждого КлючЗначение Из РезультатВключения.СостояниеПоИдентификаторамЭДО Цикл
		СостояниеВключения = КлючЗначение.Значение;
		ИдентификаторЭДО = КлючЗначение.Ключ;
		
		СостояниеВключенияИдентификаторовЭДО = НовоеСостояниеВключенияИдентификаторовЭДО();
		СостояниеВключенияИдентификаторовЭДО.ИдентификаторЭДО = ИдентификаторЭДО;
		СостояниеВключенияИдентификаторовЭДО.ЕстьОшибки = СостояниеВключения.ЕстьОшибки;
		СостояниеВключенияИдентификаторовЭДО.Остановлено = СостояниеВключения.Остановлено;
		
		СостоянияВФорматеСервиса.Добавить(СостояниеВключенияИдентификаторовЭДО);
		
	КонецЦикла;
	
	Возврат РезультатВФорматеСервиса;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * СостоянияВключенияИдентификаторовЭДО - Массив из См. НовоеСостояниеВключенияИдентификаторовЭДО
//  * Ошибки - Массив Из Строка
Функция РезультатВключенияИспользованияКлючаДоступаКСервисуЭДО()
	Результат = Новый Структура;
	Результат.Вставить("СостоянияВключенияИдентификаторовЭДО", Новый Массив);
	Результат.Вставить("Ошибки", Новый Массив);
	
	Возврат Результат;
КонецФункции

// Возвращаемое значение:
//  Структура:
// * ИдентификаторЭДО - Строка
// * ЕстьОшибки - Булево
// * Остановлено - Булево
Функция НовоеСостояниеВключенияИдентификаторовЭДО()
	СостояниеВключенияИдентификаторовЭДО = Новый Структура;
	СостояниеВключенияИдентификаторовЭДО.Вставить("ИдентификаторЭДО", "");
	СостояниеВключенияИдентификаторовЭДО.Вставить("ЕстьОшибки", Ложь);
	СостояниеВключенияИдентификаторовЭДО.Вставить("Остановлено", Ложь);
	
	Возврат СостояниеВключенияИдентификаторовЭДО;
КонецФункции

#КонецОбласти

