// Модуль произвольной формы документа "Изменение цен"


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	//УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	Элементы.ДеревоТиповЦенУстановитьФлажки.Доступность = НЕ ТолькоОдинТипЦен;
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Настройка условного оформления формы
//
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаТиповЦенВалюта");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТиповЦен.Валюта");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<В валюте товара>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
КонецПроцедуры // УстановитьУсловноеОформление()

&НаСервере
Процедура ЗаполнитьДеревоТиповЦен()
	
	СписокВыбранныхТиповЦен = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СписокТиповЦен", Неопределено);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТипыЦен.Ссылка КАК ТипЦен
	                      |ПОМЕСТИТЬ ТаблицаТиповЦен
	                      |ИЗ
	                      |	Справочник.ТипыЦен КАК ТипыЦен
	                      |ГДЕ
	                      |	ТипыЦен.Ссылка В(&СписокТиповЦен)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТипыЦен.Ссылка КАК ТипЦен,
	                      |	ТипыЦен.ВалютаЦены КАК Валюта,
	                      |	ТипыЦен.ЦенаВключаетНДС КАК ВключаетНДС,
	                      |	ТипыЦен.ЭтоГруппа КАК ЭтоГруппа,
	                      |	ВЫБОР
	                      |		КОГДА ТаблицаТиповЦен.ТипЦен ЕСТЬ NULL
	                      |			ТОГДА ЛОЖЬ
	                      |		ИНАЧЕ ИСТИНА
	                      |	КОНЕЦ КАК Пометка
	                      |ИЗ
	                      |	Справочник.ТипыЦен КАК ТипыЦен
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТиповЦен КАК ТаблицаТиповЦен
	                      |		ПО ТипыЦен.Ссылка = ТаблицаТиповЦен.ТипЦен
	                      |ГДЕ
	                      |	НЕ ТипыЦен.ПометкаУдаления
	                      |	И ТипыЦен.Продажа
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТипыЦен.Ссылка ИЕРАРХИЯ
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("СписокТиповЦен", СписокВыбранныхТиповЦен);
	
	//РезультатЗапроса = Запрос.Выполнить();
	//ОбходДереваТиповЦен(Элементы.ДеревоТиповЦен, ДеревоТиповЦен.ПолучитьЭлементы(), РезультатЗапроса);
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(Дерево, "ДеревоТиповЦен");

КонецПроцедуры //ЗаполнитьДеревоТиповЦен()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события нажатия кнопки "Применить".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Применить(Команда)
	
	Результат = Новый Структура;
	
	Если НЕ РежимВыбораТиповЦен Тогда
		РезультатКолонки = Новый Массив;
		
		Если ЕдиницаИзмерения = Истина Тогда
			РезультатКолонки.Добавить("ЕдиницаИзмерения");
		КонецЕсли;
		Если СтараяЦена = Истина Тогда
			РезультатКолонки.Добавить("ЦенаСтарая");
		КонецЕсли;
		Если СтарыйПроцентНаценки = Истина Тогда
			РезультатКолонки.Добавить("СтарыйПроцентНаценки");
		КонецЕсли;
		Если НоваяЦена = Истина Тогда
			РезультатКолонки.Добавить("ЦенаНовая");
		КонецЕсли;
		Если БазоваяЦена = Истина Тогда
			РезультатКолонки.Добавить("ЦенаБазовая");
		КонецЕсли;
		Если ПроцентНаценки = Истина Тогда
			РезультатКолонки.Добавить("ПроцентНаценки");
		КонецЕсли;
		// тк+
		Если РекомендуемыйПроцентНаценки = Истина Тогда
			РезультатКолонки.Добавить("РекомендуемыйПроцентНаценки");
		КонецЕсли;
		// тк-
		Если СуммаНаценки = Истина Тогда
			РезультатКолонки.Добавить("СуммаНаценки");
		КонецЕсли;
		Если ЦенаКонкурента = Истина Тогда
			РезультатКолонки.Добавить("ЦенаКонкурента");
		КонецЕсли;
		
		Результат.Вставить("РезультатКолонки", РезультатКолонки);
		
	КонецЕсли;
	СписокТиповЦены = Новый СписокЗначений;
	
	//Для Каждого ТекущаяСтрока Из ТаблицаТиповЦен Цикл
	//	Если ТекущаяСтрока.Пометка Тогда
	//		СписокТиповЦены.Добавить(ТекущаяСтрока.ТипЦен);
	//	КонецЕсли;
	//КонецЦикла;
	
	ДеревоВСписокЗначений(ДеревоТиповЦен.ПолучитьЭлементы(), СписокТиповЦены);
	
	Результат.Вставить("ТекущийСписокТипЦен", СписокТиповЦены);
	
	Закрыть(Результат);
	
КонецПроцедуры // Применить()

&НаКлиенте
Процедура ДеревоВСписокЗначений(ВеткаДерева, СписокТиповЦены)
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		Если ТекущаяСтрока.Пометка И НЕ ТекущаяСтрока.ЭтоГруппа Тогда
			СписокТиповЦены.Добавить(ТекущаяСтрока.ТипЦен);
		КонецЕсли;
		
		ДеревоВСписокЗначений(ТекущаяСтрока.ПолучитьЭлементы(), СписокТиповЦены);
	КонецЦикла;
	
КонецПроцедуры //ДеревоВСписокЗначений()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДЕРЕВА ФОРМЫ "ТИПЫ ЦЕН"

&НаКлиенте
Процедура ДеревоТиповЦенВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоТиповЦен.ТекущиеДанные;
	
	Если Элемент.ТекущийЭлемент.Имя = "ДеревоТиповЦенТипЦен" И ТекущиеДанные <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("Справочник.ТипыЦен.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.ТипЦен), ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры //ДеревоТиповЦенВыбор()

&НаКлиенте
Процедура ДеревоТиповЦенУстановитьФлажкиРекурсивно(ВеткаДерева, Пометка)
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		ТекущаяСтрока.Пометка = Пометка И НЕ ТекущаяСтрока.ЭтоГруппа;
		ДеревоТиповЦенУстановитьФлажкиРекурсивно(ТекущаяСтрока.ПолучитьЭлементы(), Пометка);
	КонецЦикла;
	
КонецПроцедуры //ДеревоТиповЦенУстановитьФлажкиРекурсивно()

&НаКлиенте
Процедура ДеревоТиповЦенУстановитьФлажки(Команда)
	
	ДеревоТиповЦенУстановитьФлажкиРекурсивно(ДеревоТиповЦен.ПолучитьЭлементы(), Истина);
	
КонецПроцедуры //ДеревоТиповЦенУстановитьФлажки()

&НаКлиенте
Процедура ДеревоТиповЦенСнятьФлажки(Команда)
	
	ДеревоТиповЦенУстановитьФлажкиРекурсивно(ДеревоТиповЦен.ПолучитьЭлементы(), Ложь);
	
КонецПроцедуры //ДеревоТиповЦенСнятьФлажки()

&НаКлиенте
Процедура ДеревоТиповЦенПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоТиповЦен.ТекущиеДанные;
	
	Если ТолькоОдинТипЦен Тогда
		
		Если ТекущиеДанные.ЭтоГруппа Тогда
			ТекущиеДанные.Пометка = Ложь;
			Возврат;
		КонецЕсли;
		
		Пометка = ТекущиеДанные.Пометка;
		
		ДеревоТиповЦенУстановитьФлажкиРекурсивно(ДеревоТиповЦен.ПолучитьЭлементы(), Ложь);
		
		ТекущиеДанные.Пометка = Пометка;
	Иначе
		Если ТекущиеДанные.Пометка Тогда
			Элементы.ДеревоТиповЦен.Развернуть(ТекущиеДанные.ПолучитьИдентификатор(), Истина);
		КонецЕсли;
		ДеревоТиповЦенУстановитьФлажкиРекурсивно(ТекущиеДанные.ПолучитьЭлементы(), ТекущиеДанные.Пометка);
	КонецЕсли;
	
	//не помечаем группы
	Если ТекущиеДанные.ЭтоГруппа Тогда
		ТекущиеДанные.Пометка = Ложь;
	КонецЕсли;
	
КонецПроцедуры //ДеревоТиповЦенПометкаПриИзменении()

&НаКлиенте
Процедура ДеревоРазвернуть(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийРазвернутьВсеУровни(Элементы.ДеревоТиповЦен, ДеревоТиповЦен.ПолучитьЭлементы());
	
КонецПроцедуры //ДеревоРазвернуть()

&НаКлиенте
Процедура ДеревоСвернуть(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийСвернутьВсеУровни(Элементы.ДеревоТиповЦен, ДеревоТиповЦен.ПолучитьЭлементы());
	
КонецПроцедуры //ДеревоСвернуть()

&НаКлиенте
Процедура ДеревоТиповЦенРазвернутьРодителя(ЭлементФормыДерево, Родитель)
	
	Если Родитель=Неопределено Тогда
		Возврат;
	Иначе
		ЭлементФормыДерево.Развернуть(Родитель.ПолучитьИдентификатор());
		ДеревоТиповЦенРазвернутьРодителя(ЭлементФормыДерево, Родитель.ПолучитьРодителя());
	КонецЕсли;
	
КонецПроцедуры //ДеревоГруппПоставокРазвернутьРодителя()

&НаКлиенте
Процедура ДеревоТиповЦенРазвернутьПомеченныеРекурсивно(ЭлементФормыДерево, ВеткаДерева, Пометка=Ложь)
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		Если ТекущаяСтрока.Пометка Тогда
			ДеревоТиповЦенРазвернутьРодителя(ЭлементФормыДерево, ТекущаяСтрока.ПолучитьРодителя());
		КонецЕсли;
		
		ДеревоТиповЦенРазвернутьПомеченныеРекурсивно(ЭлементФормыДерево, ТекущаяСтрока.ПолучитьЭлементы());
	КонецЦикла;
	
КонецПроцедуры //ТипыЦенРазвернутьПомеченныеРекурсивно()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	РежимВыбораТиповЦен = ПолучитьЗначениеПараметраСтруктуры(Параметры, "РежимВыбораТиповЦен", Ложь);
	
	СписокВидимости = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СписокВидимости", Неопределено);
	
	ТолькоОдинТипЦен = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ТолькоОдинТипЦен", Ложь);
	
	Если СписокВидимости<>Неопределено Тогда
		Для Каждого ТекВидимость Из СписокВидимости Цикл
			Если ТекВидимость.Значение = "ЕдиницаИзмерения" Тогда
				ЕдиницаИзмерения = Истина;
			ИначеЕсли ТекВидимость.Значение = "ЦенаСтарая" Тогда
				СтараяЦена = Истина;
			ИначеЕсли ТекВидимость.Значение = "СтарыйПроцентНаценки" Тогда
				СтарыйПроцентНаценки = Истина;
			ИначеЕсли ТекВидимость.Значение = "ЦенаНовая" Тогда
				НоваяЦена = Истина;
			ИначеЕсли ТекВидимость.Значение = "ЦенаБазовая" Тогда
				БазоваяЦена = Истина;
			ИначеЕсли ТекВидимость.Значение = "ПроцентНаценки" Тогда
				ПроцентНаценки = Истина;
			// тк+
			ИначеЕсли ТекВидимость.Значение = "РекомендуемыйПроцентНаценки" Тогда
				РекомендуемыйПроцентНаценки = Истина;
			// тк-
			ИначеЕсли ТекВидимость.Значение = "СуммаНаценки" Тогда
				СуммаНаценки = Истина;
			ИначеЕсли ТекВидимость.Значение = "ЦенаКонкурента" Тогда
				ЦенаКонкурента = Истина;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Элементы.ГруппаВидимостьКолонок.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьДеревоТиповЦен();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДеревоТиповЦенРазвернутьПомеченныеРекурсивно(Элементы.ДеревоТиповЦен, ДеревоТиповЦен.ПолучитьЭлементы());
	
КонецПроцедуры //ПриОткрытии()

