// Модуль менеджера справочника "Графики работы"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	// Заполним основной график работы компании
	ОсновнойГрафикРаботыКомпании = Справочники.ГрафикиРаботы.ГрафикРаботыКомпании.ПолучитьОбъект();
	
	ОсновнойГрафикРаботыКомпании.Периодичность = Перечисления.Периодичность.Произвольный;
	ОсновнойГрафикРаботыКомпании.ДатаНачала = ТекущаяДатаСеанса();
	
	// Сохранение справочника
	Попытка
		ОсновнойГрафикРаботыКомпании.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Графики работ""'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
	КонецПопытки;
	
КонецПроцедуры //ВыполнитьНачальноеЗаполнение()

// Функция читает данные производственного календаря из регистра
//
// Параметры
//  ПроизводственныйКалендарь - Ссылка на текущий элемент справочника
//  НомерГода                 - Номер года, за который необходимо прочитать производственный календарь.
//
// Возвращаемое значение
//  ДанныеПроизводственногоКалендаря - таблица значений, в которой хранятся сведения о виде дня
//                                     на каждую дату календаря.
//
Функция ДанныеПроизводственногоКалендаря(ПроизводственныйКалендарь, НачалоГрафика, ОкончаниеГрафика) Экспорт
	
	СписокЛет = Новый Массив;
	СписокЛет.Добавить(Год(НачалоГрафика));
	СледующийГод = Год(НачалоГрафика)+1;
	Для Год = СледующийГод По Год(ОкончаниеГрафика) Цикл
		СписокЛет.Добавить(Год);
		СледующийГод = Год+1;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", ПроизводственныйКалендарь);
	Запрос.УстановитьПараметр("СписокЛет", СписокЛет);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеПроизводственногоКалендаря.Дата,
	|	ДанныеПроизводственногоКалендаря.ВидДня,
	|	ДанныеПроизводственногоКалендаря.ДатаПереноса
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Год В(&СписокЛет)
	|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СтруктураИзМассива(Массив)
	
	Структура = Новый Структура;
	Сч = 0;
	Для Каждого Элемент Из Массив Цикл
		Структура.Вставить("Ключ" + Строка(Сч), Элемент);
		
		Сч = Сч + 1;
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

Функция МассивИзСтруктуры(Структура) Экспорт
	
	Массив = Новый Массив;
	
	Для Каждого Элемент Из Структура Цикл
		Массив.Добавить(Элемент.Значение);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

// Получение ТЗ описывающую полную таблицу графика
//
// Параметры:
//  График           - ТаблицаЗначений - График по которому вычисляется продолжительность
//  НачалоГрафика    - Дата            - Дата начала вычисления продолжительности
//  ОкончаниеГрафика - Дата            - Дата окончания вычисления продолжительности
//  ВыходныеДни      - Структура       - структура, содержащая выходные дни:
//     * Суббота     - Булево          - Истина, если суббота выходной,
//     * Воскресенье - Булево          - Истина, если воскресенье - выходной,
//  ВидыИнтервалов   - Массив          - Массив либо элемент перечисления вид интервала,
//                                       для которого вычисляется продолжительность
//  ВидыДней         - Массив          - Массив либо элемент перечисления вид дня,
//                                       для которого вычисляется продолжительность
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица графика.
//
Функция ПолучитьГрафик(
	График,
	Знач НачалоГрафика,
	Знач ОкончаниеГрафика,
	ВыходныеДни,
	Знач ВидыИнтервалов = Неопределено,
	Знач ВидыДней = Неопределено,
	РасчетШаблона = Ложь) Экспорт
	
	// приводим виды интервалов и дней к массиву
	Если ТипЗнч(ВидыИнтервалов) <> Тип("Массив") И ВидыИнтервалов <> Неопределено Тогда
		ВидыИнтервалов_ = ВидыИнтервалов;
		ВидыИнтервалов = Новый Массив;
		ВидыИнтервалов.Добавить(ВидыИнтервалов_);
	КонецЕсли;
	Если ВидыИнтервалов <> Неопределено Тогда
		ВидыИнтервалов = СтруктураИзМассива(ВидыИнтервалов);
	КонецЕсли;
	
	Если ТипЗнч(ВидыДней) <> Тип("Массив") И ВидыДней<>Неопределено Тогда
		ВидыДней_ = ВидыДней;
		ВидыДней = Новый Массив;
		ВидыДней.Добавить(ВидыДней_);
	КонецЕсли;
	Если ВидыДней <> Неопределено Тогда
		ВидыДней = СтруктураИзМассива(ВидыДней);
	КонецЕсли;
	
	Возврат ГрафикиРаботПовтИсп.ПолучитьГрафик(
		График, НачалоГрафика, ОкончаниеГрафика, ВидыИнтервалов, ВидыДней, РасчетШаблона, ВыходныеДни);
	
КонецФункции //ПолучитьГрафик()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты справочника
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	ОбязательныеРеквизиты.Добавить("Периодичность");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события формирует наименование.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Функция СформироватьНаименованиеПоУмолчанию(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Наименование = "";
	
	Если ЗначениеЗаполнено(Объект.Периодичность) Тогда
		
		Наименование = ?(Объект.Периодичность = Перечисления.Периодичность.Произвольный,
							НСтр("ru = 'По циклам'") + " " + Объект.Смещение.Количество(),
							Строка(Объект.Периодичность));
		
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции //СформироватьНаименованиеПоУмолчанию()

// Обработчик события возникающего при изменении данных реквизита "Смена по умолчанию".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура СменаПоУмолчаниюПриИзменении(Объект, Строка = Неопределено, ПараметрыДействия=Неопределено) Экспорт
	
	// Сформируем временные интервалы
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СменыИнтервалы.НачалоРабочегоВремени КАК НачалоРабочегоВремени,
	               |	СменыИнтервалы.КонецРабочегоВремени КАК КонецРабочегоВремени,
	               |	ВЫБОР
	               |		КОГДА СменыИнтервалы.ВидИнтервала.РабочийИнтервал
	               |			ТОГДА СменыИнтервалы.Продолжительность
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	КОНЕЦ КАК Продолжительность
	               |ИЗ
	               |	Справочник.Смены.Интервалы КАК СменыИнтервалы
	               |ГДЕ
	               |	СменыИнтервалы.Ссылка = &Ссылка
	               |ИТОГИ
	               |	МИНИМУМ(НачалоРабочегоВремени),
	               |	МАКСИМУМ(КонецРабочегоВремени)
	               |ПО
	               |	ОБЩИЕ";
	Запрос.УстановитьПараметр("Ссылка", ?(Строка = Неопределено, Объект.Смена,Строка.Смена));
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если Выборка.Следующий() Тогда
		ВыборкаДетальная = Выборка.Выбрать();
		Продолжительность = 0;
		
		Пока ВыборкаДетальная.Следующий() Цикл
			Продолжительность = Продолжительность + (ВыборкаДетальная.Продолжительность-'00010101');
		КонецЦикла;
		
		Если Строка = Неопределено Тогда
			Объект.НачалоРабочегоВремени = Выборка.НачалоРабочегоВремени;
			Объект.КонецРабочегоВремени = Выборка.КонецРабочегоВремени;
			Объект.Продолжительность = '00010101' + Продолжительность;
		Иначе
			Строка.НачалоРабочегоВремени = Выборка.НачалоРабочегоВремени;
			Строка.КонецРабочегоВремени = Выборка.КонецРабочегоВремени;
			Строка.Продолжительность = '00010101' + Продолжительность
		КонецЕсли;
		
	ИначеЕсли НЕ Строка = Неопределено И Строка.Смена = Справочники.Смены.ПустаяСсылка() Тогда
		
		Строка.НачалоРабочегоВремени = '00010101';
		Строка.КонецРабочегоВремени = '00010101';
		Строка.Продолжительность = '00010101';
		
	КонецЕсли;
	
КонецПроцедуры //СменаПоУмолчаниюПриИзмененииОбъект()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ СМЕЩЕНИЕ

// Рассчитывает продолжительность временного интервала для табличной части.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура РассчитатьПродолжительностьИнтервалаСмешения(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	Если ТипЗнч(ПараметрыДействия) = Тип("Структура") И ПараметрыДействия.РасчетПродолжительности Тогда
		ПродолжительностьМаксимум = 24*3600 - (Строка.НачалоРабочегоВремени - Строка.КонецРабочегоВремени);
		ПродолжительностьНовая = Строка.Продолжительность - '00010101';
		Если ПродолжительностьНовая > ПродолжительностьМаксимум Тогда
			Строка.Продолжительность = '00010101' + ПродолжительностьМаксимум;
		КонецЕсли;
		
		Строка.КонецРабочегоВремени = '00010101' + (Строка.НачалоРабочегоВремени - '00010101')+(Строка.Продолжительность - '00010101');
		
	Иначе
		
		// Установим окончание рабочего времени
		Если Строка.НачалоРабочегоВремени <> '00010101' И Строка.КонецРабочегоВремени = '00010101' Тогда
			Строка.КонецРабочегоВремени = '00010101235959';
			РассчитатьПродолжительностьИнтервалаСмешения(Объект, Строка, ПараметрыДействия);
		КонецЕсли;
		
		// Рассчитаем продолжительность
		Если Строка.НачалоРабочегоВремени > Строка.КонецРабочегоВремени Тогда
			Строка.Продолжительность = '00010101' + (24*3600 - (Строка.НачалоРабочегоВремени - Строка.КонецРабочегоВремени));
		Иначе
			Строка.Продолжительность = '00010101' + (Строка.КонецРабочегоВремени - Строка.НачалоРабочегоВремени);
			Если Строка.КонецРабочегоВремени = '00010101235959' Тогда
				Строка.Продолжительность = Строка.Продолжительность + 1;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры //РассчитатьПродолжительностьИнтервалаСмешения()

// Обработчик события возникающего при изменении данных реквизита "Рабочий".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура СмещениеРабочийПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	Если НЕ Строка.Рабочий И ЗначениеЗаполнено(Строка.Смена) Тогда
		Строка.Смена = Справочники.Смены.ПустаяСсылка();
		СменаПоУмолчаниюПриИзменении(Объект, Строка, ПараметрыДействия);
	КонецЕсли;
	
КонецПроцедуры //СмещениеРабочийПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли