// Модуль менеджера документа "Рецептура"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	ИтогиОперации.Вставить("СуммаДокумента", 0);
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("ВалютаДокумента");
	ОбязательныеРеквизиты.Добавить("КурсДокумента");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	ОбязательныеРеквизиты.Добавить("Продукция");
	ОбязательныеРеквизиты.Добавить("Количество");
	ОбязательныеРеквизиты.Добавить("ЕдиницаИзмерения");
	ОбязательныеРеквизиты.Добавить("Коэффициент");
	
	Если НЕ ПравоПользователя("ПроведениеНезаполненныхДокументов", Объект) Тогда
		ОбязательныеРеквизиты.Добавить("Товары");
	КонецЕсли;
	ОбязательныеРеквизиты.Добавить("Товары.Номенклатура");
	ОбязательныеРеквизиты.Добавить("Товары.Количество");
	ОбязательныеРеквизиты.Добавить("Товары.Коэффициент");
	ОбязательныеРеквизиты.Добавить("Товары.ЕдиницаИзмерения");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;

КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Уникальные поля таблицы товаров
	УникальныеТовары = Новый Массив();
	УникальныеТовары.Добавить("Номенклатура");
	УникальныеТовары.Добавить("ЕдиницаИзмерения");
	
	// Структура уникальных реквизитов табличных частей
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Товары", УникальныеТовары);
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();

	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", Объект.Товары.Количество() > 0);
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Обработка пересчета табличных частей объекта.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);

КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	//ПараметрыДействия.Вставить("ТребуетсяУстановкаДатыНачала", Истина);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Подразделение".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СуммаДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
КонецПроцедуры // СуммаДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Валюта".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВалютаДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ВалютаДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ВалютаДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Курс документа".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КурсДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.КурсДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // КурсДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Продукция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПродукцияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Продукция = Объект.Продукция;
	
	ИспользованиеЕдиницИзмерения = Продукция.ТипНоменклатуры.ИспользованиеЕдиницИзмерения;
	Если ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) Тогда
		Если (ИспользованиеЕдиницИзмерения = 1 И Объект.ЕдиницаИзмерения.Владелец <> Продукция.ТипНоменклатуры)
			ИЛИ (ИспользованиеЕдиницИзмерения = 2 И Объект.ЕдиницаИзмерения.Владелец <> Продукция) Тогда
			Объект.ЕдиницаИзмерения = Продукция.ОсновнаяЕдиницаИзмерения;
		ИначеЕсли ИспользованиеЕдиницИзмерения = 0 Тогда
			Объект.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
		КонецЕсли;
	Иначе
		Объект.ЕдиницаИзмерения = Продукция.ОсновнаяЕдиницаИзмерения;
	КонецЕсли;
	
	Объект.Коэффициент       = Объект.ЕдиницаИзмерения.Коэффициент; 
	Если Объект.Количество = 0 Тогда
		Объект.Количество        = 1;
	КонецЕсли;
	Объект.ОсновнаяРецептура = Ложь;
	
КонецПроцедуры // ПродукцияПриИзменении()

//// Обработчик события возникающего при изменении данных реквизита "Количество".
////
//// Параметры:
////  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
////  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
////
//Процедура КоличествоПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
//	
//КонецПроцедуры // КоличествоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ЕдиницаИзмеренияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Объект.Коэффициент = Объект.ЕдиницаИзмерения.Коэффициент; 
	
КонецПроцедуры // ЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Основная рецептура".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОсновнаяРецептураПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект.Продукция) Тогда
		Объект.ОсновнаяРецептура = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ОсновнаяРецептураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Технология производства".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТехнологияПроизводстваПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
КонецПроцедуры // ТехнологияПроизводстваПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Оценка качества".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОценкаКачестваПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
КонецПроцедуры // ОценкаКачестваПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Вкус".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВкусПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
КонецПроцедуры // ВкусПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Консистенция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КонсистенцияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
КонецПроцедуры // КонсистенцияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Коэффициент".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КоэффициентПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
КонецПроцедуры // КоэффициентПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Номер рецептуры".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура НомерРецептурыПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
КонецПроцедуры // НомерРецептурыПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыНоменклатураПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.НоменклатураПриИзменении(Объект, Строка, ПараметрыДействия);
	
	Если Строка.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Продукция Тогда
		Подразделения = Объект.Подразделения.Выгрузить();
		МассивПодразделений = Подразделения.ВыгрузитьКолонку("ПодразделениеКомпании");
		Если МассивПодразделений.Количество() = 0 Тогда
			МассивПодразделений.Добавить(Объект.ПодразделениеКомпании);
		КонецЕсли;
		Строка.Рецептура = РасчетПроизводства.ПолучитьОсновнуюРецептуру(Строка.Номенклатура, Объект.Дата, Справочники.ХозОперации.Рецептура, МассивПодразделений);
		ТоварыРецептураПриИзменении(Объект, Строка, ПараметрыДействия);
	КонецЕсли;
	
	Если Строка.КоличествоНетто = 0 Тогда
		Строка.КоличествоНетто = Строка.Количество;
	КонецЕсли;
	
	Если Строка.КоэффициентСебестоимости = 0 Тогда
		Строка.КоэффициентСебестоимости = Строка.Количество;
	КонецЕсли;
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыКоличествоПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.КоличествоПриИзменении(Объект, Строка, ПараметрыДействия);
	
	Если Строка.КоличествоНетто = 0 Тогда
		Строка.КоличествоНетто = Строка.Количество;
	КонецЕсли;
	
	Если Строка.КоэффициентСебестоимости = 0 Тогда
		Строка.КоэффициентСебестоимости = Строка.Количество;
	КонецЕсли;
	
КонецПроцедуры // ТоварыКоличествоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество нетто" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыКоличествоНеттоПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
КонецПроцедуры // ТоварыКоличествоНеттоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Коэффициент себестоимости" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыКоэффициентСебестоимостиПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
КонецПроцедуры // ТоварыКоэффициентСебестоимостиПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Разрешить замены" в таблице "Товары".
//
// Параметры:
//  Объект 
//	Строка - строка табличной части
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыРазрешитьЗаменыПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
КонецПроцедуры // ТоварыРазрешитьЗаменыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Разрешить недовложения" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыРазрешитьНедовложенияПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
КонецПроцедуры // ТоварыРазрешитьНедовложенияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Замена" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыЗаменаПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЗаменаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Коэффициент замены" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыКоэффициентЗаменыПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
КонецПроцедуры // ТоварыКоэффициентЗаменыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Рецептура" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыРецептураПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	Строка.ЗапретитьВложенныйВыпуск = Ложь;
	
КонецПроцедуры // ТоварыРецептураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Специя" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСпецияПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСпецияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Запретить вложенный выпуск" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыЗапретитьВложенныйВыпускПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если Строка.ЗапретитьВложенныйВыпуск Тогда
		Строка.Рецептура = Документы.Рецептура.ПустаяСсылка();
	ИначеЕсли Строка.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Продукция Тогда
		Строка.Рецептура = РасчетПроизводства.ПолучитьОсновнуюРецептуру(Строка.Номенклатура, Объект.Дата, Объект.ХозОперация, Объект.ПодразделениеКомпании);
	КонецЕсли;
	
КонецПроцедуры // ТоварыЗапретитьВложенныйВыпускПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.Рецептура",
		"ПФ_MXL_ТехнологическаяКарта",
		НСтр("ru = 'Технологическая карта'"),
		СсылкаНаДокумент);
		
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.Рецептура",
		"ПФ_MXL_ОП1",
		НСтр("ru = 'Калькуляционная карточка'"),
		СсылкаНаДокумент);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик печати документа
//
// Параметры:
//  МассивОбъектов         - Массив           - массив объектов для формирования печатных форм
//  ПараметрыПечати        - Структура        - дополнительные параметры печати
//  КоллекцияПечатныхФорм  - Таблица значений - таблица с идентификаторами печатных форм и макетами печати
//  ОбъектыПечати          - Структура        - список областей печатной формы в разрезе документов
//  ПараметрыВывода        - Структура        - дополнительные параметры вывода формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТехнологическаяКарта") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_ТехнологическаяКарта",
															НСтр("ru = 'Технологическая карта'"),
															ПечатьТехнологическаяКарта(МассивОбъектов, ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ОП1") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_ОП1",
															НСтр("ru = 'Калькуляционная карточка'"),
															ПечатьКалькуляционнаяКарточка(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры // Печать()

Функция ПечатьТехнологическаяКарта(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Рецептура_ПФ_MXL_ТехнологическаяКарта";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	 //Зададим параметры макета
	
	
	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Рецептура.ПФ_MXL_ТехнологическаяКарта");
		
		ОбластьШапкаТаблицы    = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьЗаголовок       = Макет.ПолучитьОбласть("Заголовок");
		ОбластьСтрока          = Макет.ПолучитьОбласть("Строка");
		ОбластьИтого 		   = Макет.ПолучитьОбласть("Итого");
		ОбластьПодвал          = Макет.ПолучитьОбласть("Подвал");
		
				
		//заголовок
		ОбластьЗаголовок.Параметры.Заполнить(Документ);
		
		//Мальцев А.Ю. +++
		//ТекстЗаголовка = УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(Документ, НСтр("ru = 'Рецептура'"));
		ТекстЗаголовка = "Технологическая карта №" + Документ.Номер + " от " + Формат(Документ.Дата, "ДФ=дд.ММ.гггг");
		//Мальцев А.Ю. ---

		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьЗаголовок.Параметры.НаименованиеБлюда = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Документ.Продукция, Документ.Дата);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		// готовим шапку
		НомерСтраницы = 2; НомерСтраницыПред = 2;
		
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы;
		
		ФорматВыводаКоличества = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Документ);
		 // готовим области строки
		 
		 ИтогВесНетто = 0;
		ВыборкаТабличнойЧасти = Документ.Товары;
		Для каждого СтрокаТЧ Из ВыборкаТабличнойЧасти Цикл
			// заполняем данные строки
			ОбластьСтрока.Параметры.Заполнить(СтрокаТЧ);
			ОбластьСтрока.Параметры.НоменклатураНаименование = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(СтрокаТЧ.Номенклатура, Документ.Дата);
			
			Если СтрокаТЧ.Номенклатура.ТипНоменклатуры.Весовой Тогда
				ОбластьСтрока.Параметры.Количество = Формат(СтрокаТЧ.Количество,ФорматВыводаКоличества);
				ОбластьСтрока.Параметры.КоличествоНетто = Формат(СтрокаТЧ.КоличествоНетто,ФорматВыводаКоличества);
				ИтогВесНетто = ИтогВесНетто + СтрокаТЧ.КоличествоНетто;
			Иначе
				ОбластьСтрока.Параметры.Количество = Формат(СтрокаТЧ.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто * СтрокаТЧ.Количество,ФорматВыводаКоличества);
				ОбластьСтрока.Параметры.КоличествоНетто = Формат(СтрокаТЧ.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто * СтрокаТЧ.КоличествоНетто,ФорматВыводаКоличества);
				ИтогВесНетто = ИтогВесНетто + СтрокаТЧ.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто * СтрокаТЧ.КоличествоНетто;				
			КонецЕсли;				
	
			ОбластьСтрока.Параметры.Единица = СтрокаТЧ.ЕдиницаИзмерения;
			
			// доп. области
			мсвДопОбластиПодвала = Неопределено;
			Если ВыборкаТабличнойЧасти.Индекс(СтрокаТЧ) = ВыборкаТабличнойЧасти.Количество()-1 Тогда
				мсвДопОбластиПодвала = Новый Массив;
				мсвДопОбластиПодвала.Добавить(ОбластьИтого);
				мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
			КонецЕсли;
			
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьШапкаТаблицы, ОбластьИтого, НомерСтраницы, , Документ, мсвДопОбластиПодвала);
			
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				НомерСтраницыПред		  = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
			КонецЕсли;
						
		КонецЦикла;
		
		ОбластьИтого.Параметры.КоличествоНетто=ИтогВесНетто;
		ОбластьИтого.Параметры.ЕдиницаИзмерения=Документ.ЕдиницаИзмерения;
		
		УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьИтого, , , НомерСтраницы, ,Документ);
		
		// итоги
		ОбластьПодвал.Параметры.ТехнологияПроизводства = Документ.ТехнологияПроизводства;
		ОбластьПодвал.Параметры.ОценкаКачества = Документ.ОценкаКачества;
		ОбластьПодвал.Параметры.Вкус = Документ.Вкус;
		ОбластьПодвал.Параметры.Консистенция = Документ.Консистенция;
		
		//Мальцев А.Ю. +++
		//Картинка
		СписокФайлов = ПрисоединенныеФайлыСлужебный.ПолучитьВсеПодчиненныеФайлы(Документ.Продукция);
		
		// Сформируем список форматов изображения
		СписокИзображений = Новый Массив;
		Для Каждого Файл Из СписокФайлов Цикл
			//Если (Файл = Объект.ФайлКартинки) ИЛИ (НЕ Файл.ПометкаУдаления И Файл.ИндексКартинки > 41 И Файл.ИндексКартинки < 51) Тогда
				СписокИзображений.Добавить(Файл);
			//КонецЕсли;
		КонецЦикла;
		АдресКартинки = "";
		Если СписокИзображений.Количество() Тогда
			ТекущаяКартинка = СписокИзображений[0];	
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПрисоединенныеФайлы.ХранимыйФайл КАК ХранимыйФайл
				|ИЗ
				|	РегистрСведений.ПрисоединенныеФайлы КАК ПрисоединенныеФайлы
				|ГДЕ
				|	ПрисоединенныеФайлы.ПрисоединенныйФайл = &ПрисоединенныйФайл";
			
			Запрос.УстановитьПараметр("ПрисоединенныйФайл", ТекущаяКартинка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				ДД = ВыборкаДетальныеЗаписи.ХранимыйФайл.Получить();
				АдресКартинки = ПолучитьИмяВременногоФайла("jpg");
				ДД.Записать(АдресКартинки);
			КонецЕсли;
			//АдресКартинки = ПрисоединенныеФайлыПлатформаВызовСервера.НавигационнаяСсылкаКартинки(ТекущаяКартинка, Новый УникальныйИдентификатор)
		КонецЕсли;
		Если Не ПустаяСтрока(АдресКартинки) Тогда
			Картинка = Новый Картинка(АдресКартинки); 
			ОбластьПодвал.Рисунки.КартинкаПродукции.Картинка = Картинка; 
		КонецЕсли;
		//Мальцев А.Ю. ---

		// Выводим представления и расшифровки подписей
		//ОбластьПодвал.Параметры.Автор = Документ.Автор;
		
		УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьПодвал, , , НомерСтраницы, ,Документ);
		
		// отметим конец области документа
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);


	КонецЦикла;
	
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьКалькуляционнаяКарточка(МассивОбъектов, ОбъектыПечати)
	
	ЭтоНормыРазделки =Ложь;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если Документ.ХозОперация=Справочники.ХозОперации.НормыРазделки Тогда
			ЭтоНормыРазделки = Истина;		
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЭтоНормыРазделки Тогда
		//Сообщать, конечно, ничего не нужно, ну да ладно
		Сообщить("Форма ОП-1 не предназначена для печати норм разделки.",СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
		
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Рецептура_КалькуляционнаяКарточка";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;

	
	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		// Новый документ должен быть на отдельной странице.
		Если НЕ ПервыйДокумент Тогда 
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Рецептура.ПФ_MXL_ОП1");
		
		
		ОбластьЗаголовок       = Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапкаТаблицыНачало = Макет.ПолучитьОбласть("ШапкаТаблицы|Начало");
		ОбластьШапкаТаблицыПоказатели = Макет.ПолучитьОбласть("ШапкаТаблицы|Показатели");
		ОбластьСтрокаНачало          = Макет.ПолучитьОбласть("Строка|Начало");
		ОбластьСтрокаПоказатели      = Макет.ПолучитьОбласть("Строка|Показатели");
		ОбластьИтогоНачало = Макет.ПолучитьОбласть("Итого|Начало");
		ОбластьИтогоПоказатели = Макет.ПолучитьОбласть("Итого|Показатели");
		ОбластьПодвалПодписи = Макет.ПолучитьОбласть("ПодвалПодписи");
		
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		ОбластьЗаголовок.Параметры.Заполнить(Документ);
		ОбластьЗаголовок.Параметры.Номер = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(Документ);
		ОбластьЗаголовок.Параметры.Дата = Формат(Документ.Дата,"ДФ = dd.MM.yyyy");
		ОбластьЗаголовок.Параметры.НаименованиеБлюда = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Документ.Продукция, Документ.Дата);
		ОбластьЗаголовок.Параметры.ПредставлениеОрганизации =УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,Документ.Дата,ДополнительныеПараметры); 
		ОбластьЗаголовок.Параметры.ПредставлениеПодразделения = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(Документ.ПодразделениеКомпании,Документ.Дата);	
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ОбластьШапкаТаблицыПоказатели.Параметры.НаименованиеВалюты = СокрЛП(Документ.ВалютаДокумента.Наименование);
		НомКол = 6;//+4 
		НомКол1 = НомКол+1; 
		НомКол2 = НомКол+2;
		НомКол3 = НомКол+3;
		НомКол4 = НомКол+4;
		ОбластьШапкаТаблицыПоказатели.Параметры.Заполнить(Документ);
		ОбластьШапкаТаблицыПоказатели.Параметры.НомКол1 = НомКол1;
		ОбластьШапкаТаблицыПоказатели.Параметры.НомКол2 = НомКол2;
		ОбластьШапкаТаблицыПоказатели.Параметры.НомКол3 = НомКол3;
		ОбластьШапкаТаблицыПоказатели.Параметры.НомКол4 = НомКол4;
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыНачало);
		ТабличныйДокумент.Присоединить(ОбластьШапкаТаблицыПоказатели);
		
		
		ТипЦенЗакупки = ПравоПользователя("ОсновнойТипЦенЗакупки", Документ);
		ТипЦенРеализации = Документ.ПодразделениеКомпании.ТипЦенРеализации;
		
		ФорматВыводаСуммы = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		ФорматВыводаКоличества = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаКоличества(Документ);	
		ИтогоСумма = 0;
		//Цены всегда на конец дня
		//потому что регламент создания установки цен следующий
		//сначала создается рецептура
		//потом создаются установки цен
		//следовательно, на момент рецептуры цены продукции еще могут быть не установлены...
		ДатаЦен=КонецДня(Документ.Дата);
		
		ВыборкаСтрок = Документ.Товары;
		Для каждого СтрокаТовары Из Документ.Товары Цикл
			ОбластьСтрокаНачало.Параметры.Заполнить(СтрокаТовары);
			ОбластьСтрокаНачало.Параметры.НоменклатураНаименование = УправлениеПечатьюПлатформа.ПолучитьНаименованиеСправочника(СтрокаТовары.Номенклатура, Документ.Дата);
			ОбластьСтрокаПоказатели.Параметры.Количество = Формат(СтрокаТовары.Количество,ФорматВыводаКоличества);
			ОбластьСтрокаНачало.Параметры.КодНом = СокрЛП(СтрокаТовары.Номенклатура.Код);
			ОбластьСтрокаНачало.Параметры.КодЕдиницыИзмерения = СокрЛП(СтрокаТовары.ЕдиницаИзмерения.Код);
			// вычислим цену
			Если Не ЗначениеЗаполнено(ТипЦенЗакупки) Тогда
				Цена=0;
				Сумма=0;
			Иначе
				Цена = ЦенообразованиеСервер.ПолучитьЦену(ТипЦенЗакупки,СтрокаТовары.Номенклатура,ДатаЦен,,Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(),1,,Документ.ПодразделениеКомпании)*СтрокаТовары.ЕдиницаИзмерения.Коэффициент;
				Сумма = СтрокаТовары.Количество*Цена;
			КонецЕсли;
			
			ОбластьСтрокаПоказатели.Параметры.Заполнить(СтрокаТовары);
			ОбластьСтрокаПоказатели.Параметры.Цена = Формат(Цена,ФорматВыводаСуммы);
			ОбластьСтрокаПоказатели.Параметры.Сумма = Формат(Сумма,ФорматВыводаСуммы);
			ИтогоСумма = ИтогоСумма+СтрокаТовары.Количество*Цена;
			
			ТабличныйДокумент.Вывести(ОбластьСтрокаНачало);
			ТабличныйДокумент.Присоединить(ОбластьСтрокаПоказатели);
			
		КонецЦикла;
		
		ОбластьИтогоПоказатели.Параметры.Заполнить(Документ);
		ОбластьИтогоПоказатели.Параметры.НаименованиеВалюты = СокрЛП(Документ.ВалютаДокумента.Наименование);
		ОбластьИтогоПоказатели.Параметры.ИтогоСумма = Формат(ИтогоСумма,ФорматВыводаСуммы);
		
		Если Не ЗначениеЗаполнено(ТипЦенРеализации) Тогда
			ЦенаПродажи=0;
		Иначе
			ЦенаПродажи = ЦенообразованиеСервер.ПолучитьЦену(ТипЦенРеализации,Документ.Продукция,ДатаЦен,,Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(),1,,Документ.ПодразделениеКомпании)*Документ.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
		
		ОбластьИтогоПоказатели.Параметры.ЦенаПродажи = ЦенаПродажи;
		
		ИтогоСуммаПорции = ?(Документ.Количество=0,0,ИтогоСумма/Документ.Количество);
		ОбластьИтогоПоказатели.Параметры.ИтогоСуммаПорции = Формат(ИтогоСуммаПорции,ФорматВыводаСуммы);
		
		СуммаНаценки=?(ЦенаПродажи=0,0,ЦенаПродажи-ИтогоСуммаПорции);
		ОбластьИтогоПоказатели.Параметры.СуммаНаценки=Формат(СуммаНаценки,ФорматВыводаСуммы);
		
		Наценка=?(ИтогоСуммаПорции=0,0,СуммаНаценки*100/ИтогоСуммаПорции);
		ОбластьИтогоПоказатели.Параметры.Наценка = Формат(Наценка,ФорматВыводаСуммы);
		
		ТабличныйДокумент.Вывести(ОбластьИтогоНачало);
		ТабличныйДокумент.Присоединить(ОбластьИтогоПоказатели);
		
		
		ТабличныйДокумент.Вывести(ОбластьПодвалПодписи);
		// отметим конец области документа
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьКалькуляционнаяКарточка()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ДоступностьКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ДоступностьКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()

// Обработчик заполнения документа по документу основанию
//
Функция ТоварыЗаполнитьПоОснованию(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Обработка заполнения обрабатывается на форме документа
	
КонецФункции // ТоварыЗаполнитьПоОснованию()

#КонецЕсли
