#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ИмяУпрВалюты  = Константы.ВалютаУправленческогоУчетаКомпании.Получить().Наименование;
		
	СтруктураВалютПоказателей = Новый Структура();
	
	СтруктураВалютПоказателей.Вставить("СуммаЗаказа", ИмяУпрВалюты);
	СтруктураВалютПоказателей.Вставить("ФактическаяСуммаПоступленияРасчет", ИмяУпрВалюты);
	СтруктураВалютПоказателей.Вставить("СуммаУпрЗаказанное", ИмяУпрВалюты);
	СтруктураВалютПоказателей.Вставить("СуммаУпрПоступленияФактическая", ИмяУпрВалюты);
	СтруктураВалютПоказателей.Вставить("УСПа", ИмяУпрВалюты);
	СтруктураВалютПоказателей.Вставить("СтВЗиа", ИмяУпрВалюты);
	СтруктураВалютПоказателей.Вставить("СтВЗца", ИмяУпрВалюты);
	СтруктураВалютПоказателей.Вставить("АСа", ИмяУпрВалюты);

		
	Для Каждого ТекРесурс Из СхемаКомпоновкиДанных.ПоляИтога Цикл
		Для Каждого ТекНабор Из СхемаКомпоновкиДанных.НаборыДанных Цикл
			Для Каждого ТекПоле Из ТекНабор.Поля Цикл
				
				Если НЕ ТипЗнч(ТекПоле) = Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяПоля = СокрЛП(ТекПоле.Поле);
				Если ТекРесурс.ПутьКДанным = ИмяПоля И СтруктураВалютПоказателей.Свойство(ИмяПоля) Тогда
					ТекПоле.Заголовок = ТекПоле.Заголовок + ", " + СтруктураВалютПоказателей[ИмяПоля];
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого ТекПоле Из СхемаКомпоновкиДанных.ВычисляемыеПоля Цикл
			
				
				Если НЕ ТипЗнч(ТекПоле) = Тип("ВычисляемоеПолеСхемыКомпоновкиДанных") Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяПоля = СокрЛП(ТекПоле.ПутьКДанным);
				Если ТекРесурс.ПутьКДанным = ИмяПоля И СтруктураВалютПоказателей.Свойство(ИмяПоля) Тогда
					ТекПоле.Заголовок = ТекПоле.Заголовок + ", " + СтруктураВалютПоказателей[ИмяПоля];
					Прервать;
				КонецЕсли;
				
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыПлатформаСервер.ВывестиОтчет(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецЕсли