
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено ИЛИ ПараметрКоманды.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	// фильтры
	ОтчетОтбор = Новый Структура;
	ОтчетОтбор.Вставить("ПодчиненныйДокумент", ПараметрКоманды);
	
	ПараметрыОтчета  = ПолучитьПараметрыОтчета(ПараметрКоманды);
	
	ОтчетыПлатформаКлиент.ОткрытьОтчет(
		"Отчет.СоставРецептур",
		"Основной",,,,
		ОтчетОтбор,
		,);
	
КонецПроцедуры

// Функция получения параметров отчета
//
&НаСервере
Функция ПолучитьПараметрыОтчета(Документ)
	
	ПараметрыОтчета = Новый Структура;
	
	Возврат ПараметрыОтчета;
	
КонецФункции // ПолучитьПараметрыОтчета()
