
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресРезультатаПроверки = ПолучитьЗначениеПараметраСтруктуры(Параметры, "АдресРезультатаПроверки", Неопределено);
	Если ЭтоАдресВременногоХранилища(АдресРезультатаПроверки) Тогда
		РезультатПроверки = ПолучитьИзВременногоХранилища(АдресРезультатаПроверки);
		Для Каждого ТекущаяСтрока Из РезультатПроверки.ТаблицаМаркиПоТТН Цикл
			НоваяСтрока = МаркиПоТТН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из РезультатПроверки.ТаблицаМаркиПоФакту Цикл
			НоваяСтрока = МаркиПоФакту.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		Для Каждого ТекущаяСтрока Из РезультатПроверки.ТаблицаРасхождения Цикл
			НоваяСтрока = ТаблицаРасхождения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
	МаркиПоТТН.Сортировать("КодМарки");
	МаркиПоФакту.Сортировать("КодМарки");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасхожденияПриАктивизацииСтроки(Элемент)
	
	
	ТекущиеДанные = Элементы.ТаблицаРасхождения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.МаркиПоФакту.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
	Элементы.МаркиПоТТН.ОтборСтрок   = Новый ФиксированнаяСтруктура(Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДа(Команда)
	
	Закрыть(Комментарий);
	
КонецПроцедуры
