// Модуль основной формы документа "Гашение входящих ВСД ВетИС"
&НаКлиенте
перем ШтрихКодДляПоиска;


#Область ВыполнениеЗаявокВЕТИС_API

&НаСервере
Функция ЗапроситьНаСервере(ВидОперации)
	
	ПороговаяДата = ТекущаяДатаСеанса();
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МеркурийЗаявкаВСД.ВСД,
	|	МеркурийЗаявкаВСД.НомерСтроки,
	|	ВЫБОР
	|		КОГДА МеркурийЗаявкаВСД.СрокГодностиПо = ДатаВремя(1,1,1) ТОГДА
	|			МеркурийЗаявкаВСД.СрокГодности
	|		ИНАЧЕ
	|			МеркурийЗаявкаВСД.СрокГодностиПо
	|	КОНЕЦ КАК СрокГодности
	|ИЗ
	|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК МеркурийЗаявкаВСД
	|ГДЕ
	|	МеркурийЗаявкаВСД.Ссылка = &Ссылка И 
	|	МеркурийЗаявкаВСД.ВСД.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВСДВЕТИС.CONFIRMED) И 
	|	ВЫБОР
	|		КОГДА МеркурийЗаявкаВСД.СрокГодностиПо = ДатаВремя(1,1,1) ТОГДА
	|			МеркурийЗаявкаВСД.СрокГодности<&ПороговаяДата
	|		ИНАЧЕ
	|			МеркурийЗаявкаВСД.СрокГодностиПо<&ПороговаяДата
	|	КОНЕЦ
	|";
	
	Запрос.УстановитьПараметр("Ссылка",        Объект.Ссылка);
	Запрос.УстановитьПараметр("ПороговаяДата", НачалоДня(ПороговаяДата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВывестиСообщение(НСтр("ru = 'Строка № %1 ВСД: %2 запрещено гасить. Срок годности продукции до %3'"),,,,, Выборка.НомерСтроки, Строка(Выборка.ВСД), Формат(Выборка.СрокГодности, "ДФ=dd.MM.yyyy"));
	КонецЦикла;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МеркурийЗаявкаВСД.ВСД КАК ВСД,
	|	МИНИМУМ(ВЫБОР
	//|		КОГДА МеркурийЗаявкаВСД.РешениеПринятияПартии = ЗНАЧЕНИЕ(Перечисление.РешенияПринятияПартииВЕТИС.RETURN_ALL) ТОГДА
	//|			МеркурийЗаявкаВСД.НомерСтроки
	|		КОГДА МеркурийЗаявкаВСД.РешениеПринятияПартии = ЗНАЧЕНИЕ(Перечисление.РешенияПринятияПартииВЕТИС.PARTIALLY) ТОГДА
	|			МеркурийЗаявкаВСД.НомерСтроки
	|		ИНАЧЕ
	|			99999
	|	КОНЕЦ) КАК НомерСтроки,
	|	СУММА(ВЫБОР
	|		КОГДА МеркурийЗаявкаВСД.КоэффициентВеса = 0 ТОГДА
	|			МеркурийЗаявкаВСД.КВозврату
	|		ИНАЧЕ
	|			МеркурийЗаявкаВСД.КВозврату*МеркурийЗаявкаВСД.КоэффициентВеса
	|	КОНЕЦ) КАК КВозврату
	//|	СУММА(ВЫБОР
	//|		КОГДА МеркурийЗаявкаВСД.Вес = 0 ТОГДА
	//|			МеркурийЗаявкаВСД.Количество
	//|		ИНАЧЕ
	//|			МеркурийЗаявкаВСД.Вес
	//|	КОНЕЦ) КАК Количество,
	//|	ВЫБОР
	//|		КОГДА МАКСИМУМ(ВЫБОР
	//|			КОГДА МеркурийЗаявкаВСД.РешениеПринятияПартии = ЗНАЧЕНИЕ(Перечисление.РешенияПринятияПартииВЕТИС.RETURN_ALL) ТОГДА 1
	//|			ИНАЧЕ 0
	//|			КОНЕЦ) = 1 ТОГДА
	//|			ЗНАЧЕНИЕ(Перечисление.РешенияПринятияПартииВЕТИС.RETURN_ALL)
	//|		КОГДА МАКСИМУМ(ВЫБОР
	//|			КОГДА МеркурийЗаявкаВСД.РешениеПринятияПартии = ЗНАЧЕНИЕ(Перечисление.РешенияПринятияПартииВЕТИС.PARTIALLY) ТОГДА 1
	//|			ИНАЧЕ 0
	//|			КОНЕЦ) = 1 ТОГДА
	//|			ЗНАЧЕНИЕ(Перечисление.РешенияПринятияПартииВЕТИС.PARTIALLY)
	//|		ИНАЧЕ
	//|			ЗНАЧЕНИЕ(Перечисление.РешенияПринятияПартииВЕТИС.ACCEPT_ALL)
	//|	КОНЕЦ КАК РешениеПринятияПартии
	|ИЗ
	|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК МеркурийЗаявкаВСД
	|ГДЕ
	|	МеркурийЗаявкаВСД.Ссылка = &Ссылка И 
	|	МеркурийЗаявкаВСД.ВСД.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВСДВЕТИС.CONFIRMED)
	|СГРУППИРОВАТЬ ПО
	|	МеркурийЗаявкаВСД.ВСД
	|ИМЕЮЩИЕ
	//|	МАКСИМУМ(ВЫБОР
	//|				КОГДА МеркурийЗаявкаВСД.РешениеПринятияПартии = ЗНАЧЕНИЕ(Перечисление.РешенияПринятияПартииВЕТИС.RETURN_ALL) ТОГДА 1
	//|				ИНАЧЕ 0
	//|			КОНЕЦ) = 1 ИЛИ 
	|	МАКСИМУМ(ВЫБОР
	|				КОГДА МеркурийЗаявкаВСД.РешениеПринятияПартии = ЗНАЧЕНИЕ(Перечисление.РешенияПринятияПартииВЕТИС.PARTIALLY) ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ) = 1 И 
	|	СУММА(ВЫБОР
	|		КОГДА МеркурийЗаявкаВСД.КоэффициентВеса = 0 ТОГДА
	|			МеркурийЗаявкаВСД.КВозврату
	|		ИНАЧЕ
	|			МеркурийЗаявкаВСД.КВозврату*МеркурийЗаявкаВСД.КоэффициентВеса
	|	КОНЕЦ) = 0
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВывестиСообщение(НСтр("ru = 'Строка № %1 ВСД: %2 запрещено гасить. При частичном возврате нужно заполнить поле К возврату'"),,,,, Выборка.НомерСтроки, Строка(Выборка.ВСД));
	КонецЦикла;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МеркурийЗаявкаВСД.ВСД,
	|	МИНИМУМ(МеркурийЗаявкаВСД.ИдентификаторСтроки) КАК ИдентификаторСтроки
	|ИЗ
	|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК МеркурийЗаявкаВСД
	|ГДЕ
	|	МеркурийЗаявкаВСД.Ссылка = &Ссылка И 
	|	МеркурийЗаявкаВСД.ВСД.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВСДВЕТИС.CONFIRMED) И 
	|	ВЫБОР
	|		КОГДА МеркурийЗаявкаВСД.ВСД.СрокГодностиПо = ДатаВремя(1,1,1) ТОГДА
	|			МеркурийЗаявкаВСД.ВСД.СрокГодности>=&ПороговаяДата
	|		ИНАЧЕ
	|			МеркурийЗаявкаВСД.ВСД.СрокГодностиПо>=&ПороговаяДата
	|	КОНЕЦ
	|СГРУППИРОВАТЬ ПО
	|	МеркурийЗаявкаВСД.ВСД
	|";
	
	МассивДанных = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("Объект", Объект.Ссылка);
		НоваяСтрока.Вставить("ИдентификаторСтроки", Выборка.ИдентификаторСтроки);
		МассивДанных.Добавить(НоваяСтрока);
	КонецЦикла;
	
	ДанныеДляВыгрузки = ИнтеграцияВЕТИСКлиентСервер.СтруктураДанныхДляВыгрузки();
	ДанныеДляВыгрузки.ХозяйствующийСубъект = Объект.Получатель;
	ДанныеДляВыгрузки.Предприятие          = Объект.ПредприятиеПолучатель;
	ДанныеДляВыгрузки.ВидОперации          = ВидОперации;
	
	ДанныеДляВыгрузки.Вставить("МассивДанных", МассивДанных);
	
	РезультатОбмена = ИнтеграцияВЕТИСВызовСервера.ПодготовитьЗапрос(Объект.Получатель, Объект.ПредприятиеПолучатель, ВидОперации, ДанныеДляВыгрузки, УникальныйИдентификатор);
	
	ОбновитьСтатусОбработки();
	
	Возврат РезультатОбмена;
	
КонецФункции

&НаКлиенте
Процедура НачатьВыполнениеЗапроса(ВидОперации)
	
	РезультатОбмена = ЗапроситьНаСервере(ВидОперации);
	ОбработатьРезультатОбмена(РезультатОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатОбмена(РезультатОбмена)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияРезультатОбработкиЗаявки", ЭтотОбъект);
	
	ИнтеграцияВЕТИСКлиент.ОбработатьРезультатОбмена(РезультатОбмена, ЭтотОбъект,, ОписаниеОповещения, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьОбменОбработкаОжидания()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияРезультатОбработкиЗаявки", ЭтотОбъект);
	ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ПрогрессВыполненияЗаявки", ЭтотОбъект);
	
	ИнтеграцияВЕТИСКлиент.ПродолжитьВыполнениеОбмена(ЭтотОбъект,, ОписаниеОповещения, Ложь, ОповещениеОПрогрессеВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияРезультатОбработкиЗаявки(Изменения, ДополнительныеПараметры) Экспорт
	
	БезОшибок = Истина;
	Для Каждого ЭлементДанных Из Изменения Цикл
		Если ЭлементДанных.Принято Тогда
			Если ЗначениеЗаполнено(ЭлементДанных.ТекстОшибки) Тогда
				БезОшибок = Ложь;
				ВывестиСообщение(НСтр("ru = 'Операция %1 выполнена с ошибкой: %2'"),,,,, ЭлементДанных.ВидОперации, ЭлементДанных.ТекстОшибки);
			Иначе
				ВывестиСообщение(НСтр("ru = 'Операция %1 выполнена со статусом: %2'"),,,,, ЭлементДанных.ВидОперации, Строка(ЭлементДанных.НовыйСтатус));
			КонецЕсли;
			Прочитать();
			ОбновитьСтатусОбработки();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрогрессВыполненияЗаявки(Изменения, ДополнительныеПараметры) Экспорт
	
	БезОшибок = Истина;
	Для Каждого ЭлементДанных Из Изменения.Сообщения Цикл
		ВывестиСообщение(Изменения.Сообщения[0].Текст);
		//Если ЭлементДанных.Принято Тогда
		//	Если ЗначениеЗаполнено(ЭлементДанных.ТекстОшибки) Тогда
		//		БезОшибок = Ложь;
		//		ВывестиСообщение(НСтр("ru = 'Сообщение %1 выполнено с ошибкой: %2'"),,,,, ЭлементДанных.ИсходящееСообщение, ЭлементДанных.ТекстОшибки);
		//	Иначе
		//		ВывестиСообщение(НСтр("ru = 'Сообщение %1 выполнено со статусом: %2'"),ВладелецФормы.УникальныйИдентификатор,,,, ЭлементДанных.ВидОперации, Строка(ЭлементДанных.НовыйСтатус));
		//	КонецЕсли;
		//КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Статус

&НаСервере
Процедура ОбновитьСтатусОбработки()
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	
	ИмяДокумента    = Объект.Ссылка.Метаданные().Имя;
	СтатусПоУмолчанию = Справочники.СтатусыОбработкиВЕТИС.ПолучитьСтатусОбработкиПоУмолчанию(ИмяДокумента);
	СтатусОбработки    = СтатусПоУмолчанию.СтатусОбработки;
	ДальнейшееДействие = СтатусПоУмолчанию.ДальнейшееДействие;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Статусы.СтатусОбработки КАК СтатусОбработки,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие1 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияВЕТИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие1
		|	КОНЕЦ КАК ДальнейшееДействие1,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие2 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияВЕТИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие2
		|	КОНЕЦ КАК ДальнейшееДействие2,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие3 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияВЕТИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие3
		|	КОНЕЦ КАК ДальнейшееДействие3
		|ИЗ
		|	РегистрСведений.СтатусыДокументовВЕТИС КАК Статусы
		|ГДЕ
		|	Статусы.Документ = &Документ";
		
		Запрос.УстановитьПараметр("Документ",                 Объект.Ссылка);
		Запрос.УстановитьПараметр("МассивДальнейшиеДействия", ИнтеграцияВЕТИС.НеотображаемыеВДокументахДальнейшиеДействия());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СтатусОбработки = Выборка.СтатусОбработки;
			ДальнейшееДействие = Новый Массив;
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие1);
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие2);
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие3);
		КонецЕсли;
		
	КонецЕсли;
	
	ДопустимыеДействия = Новый Массив;
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияВЕТИС.ПередайтеДанные);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияВЕТИС.ОтменитеОперацию);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияВЕТИС.ОтменитеПередачуДанных);
	
	СтатусОбработкиПредставление = ИнтеграцияВЕТИС.ПредставлениеСтатусаОбработки(
		СтатусОбработки,
		ДальнейшееДействие,
		ДопустимыеДействия);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при нажатии на гиперссылку форматированной строки "Статус обработки представление".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НавигационнаяСсылкаФорматированнойСтроки - Строка - Значение гиперссылки форматированной строки.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура СтатусОбработкиПредставлениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	Если Модифицированность ИЛИ (Не ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("СтатусОбработкиОбработкаНавигационнойСсылкиЗавершение", ЭтотОбъект, Новый Структура("НавигационнаяСсылкаФорматированнойСтроки", НавигационнаяСсылкаФорматированнойСтроки));
		ТекстВопроса = НСтр("ru = 'Для продолжения документ необходимо записать. Записать?'");
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки);
	КонецЕсли;
	
КонецПроцедуры // СтатусОбработкиПредставлениеОбработкаНавигационнойСсылки()

&НаКлиенте
Процедура ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПередатьДанные" Тогда
		
		НачатьВыполнениеЗапроса(ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ЗапросНаОформлениеВходящейПартии"));
		
	//ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтменитьОперацию" Тогда
	//	
	//	ИнтеграцияЕГАИСКлиент.ОтменитьПоследнююОперацию(Объект.Ссылка);
	//	
	//ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтменитьПередачу" Тогда
	//	
	//	ИнтеграцияЕГАИСКлиент.ОтменитьПередачу(Объект.Ссылка);
	//	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбработкиОбработкаНавигационнойСсылкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда
		 Возврат;
	КонецЕсли;
	
	Если ПроверитьЗаполнение() Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		РазблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	Если Не Модифицированность Тогда
		ОбработатьНажатиеНавигационнойСсылки(ДополнительныеПараметры.НавигационнаяСсылкаФорматированнойСтроки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ВыборПричиныСоставленияАктаНесоответствияПриЗавершении(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПричинаСоставления = СокрЛП(Результат);
	
	ВСД           = ПолучитьЗначениеПараметраСтруктуры(ДопПараметры, "ВСД", Неопределено);
	ТекущаяСтрока = ПолучитьЗначениеПараметраСтруктуры(ДопПараметры, "ТекущаяСтрока", Неопределено);
	
	Если ЗначениеЗаполнено(ВСД) Тогда
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("ВСД", ВСД));
		Для Каждого ТекущиеДанные Из НайденныеСтроки Цикл
			ТекущиеДанные.ПричинаСоставленияАктаНесоответствия = ПричинаСоставления;
		КонецЦикла;
	Иначе
		ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
		Если Не ТекущиеДанные = Неопределено Тогда
			ТекущиеДанные.ПричинаСоставленияАктаНесоответствия = ПричинаСоставления;
		КонецЕсли;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьРасхождения(Товары, ТекущаяСтрока)
	
	КоличествоПоВСД           = ТекущаяСтрока.ВСДКоличество;
	Количество                = 0;
	Вес                       = 0;
	ТекущаяСтрока.Расхождение = 0;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ВСД) Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("ВСД", ТекущаяСтрока.ВСД));
	НомерПоследнейСтрокиСОдинаковымиВСД = 0;
	Для Каждого ТекСтр Из НайденныеСтроки Цикл
		
		Количество = Количество + ТекСтр.Количество+ТекСтр.КВозврату;
		
		Вес = Вес + ТекСтр.Вес + (ТекСтр.КВозврату * ТекСтр.КоэффициентВеса);
		
		НомерПоследнейСтрокиСОдинаковымиВСД = Товары.Индекс(ТекСтр);
		
	КонецЦикла;
	
	Товары[НомерПоследнейСтрокиСОдинаковымиВСД].Расхождение = Вес-КоличествоПоВСД;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеСлужебныхРеквизитовСтроки(ТекущаяСтрока, ДанныеВСД)
	
	ТекущаяСтрока.ВСДКоличество          = ДанныеВСД.Количество;
	ТекущаяСтрока.ВСДСкоропортящаяся     = ДанныеВСД.Скоропортящаяся;
	ТекущаяСтрока.ВСДНекачественный      = ДанныеВСД.Некачественный;
	ТекущаяСтрока.ВСДСтранаПроисхождения = ДанныеВСД.СтранаПроисхождения;
	Если ЗначениеЗаполнено(ДанныеВСД.ВСД) Тогда
		ТекущаяСтрока.ВСДСтатус          = ДанныеВСД.Статус;
	Иначе
		ТекущаяСтрока.ВСДСтатус          = "ВСД не указан!";
	КонецЕсли;
	ТекущаяСтрока.ВСДВозвратСтатус       = ДанныеВСД.ВозвратСтатус;
	ТекущаяСтрока.ВСДПродукция           = ДанныеВСД.Продукция;
	
	ТекстПредставления = "";
	Если ЗначениеЗаполнено(ДанныеВСД.ДатаВыработки) Тогда
		Если ЗначениеЗаполнено(ДанныеВСД.ДатаВыработкиПо) Тогда
			ТекстПредставления = "с " + Формат(ДанныеВСД.ДатаВыработки, "ДФ=dd.MM.yyyy") + " по " + Формат(ДанныеВСД.ДатаВыработкиПо, "ДФ=dd.MM.yyyy");
		Иначе
			ТекстПредставления = Формат(ДанныеВСД.ДатаВыработки, "ДФ=dd.MM.yyyy");
		КонецЕсли;
	Иначе
		ТекстПредставления = ДанныеВСД.ДатаВыработкиСтрокой;
	КонецЕсли;
	ТекущаяСтрока.ВСДПредставлениеДатаВыработки = ТекстПредставления;
	
	ТекстПредставления = "";
	Если ЗначениеЗаполнено(ДанныеВСД.СрокГодности) Тогда
		Если ЗначениеЗаполнено(ДанныеВСД.СрокГодностиПо) И (НЕ ДанныеВСД.СрокГодности = ДанныеВСД.СрокГодностиПо) Тогда
			ТекстПредставления = "с " + Формат(ДанныеВСД.СрокГодности, "ДФ=dd.MM.yyyy") + " по " + Формат(ДанныеВСД.СрокГодностиПо, "ДФ=dd.MM.yyyy");
		Иначе
			ТекстПредставления = "до " + Формат(ДанныеВСД.СрокГодности, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		//Если ЗначениеЗаполнено(ДанныеВСД.СрокГодностиПо) И ДанныеВСД.СрокГодностиПо<ПороговаяДата Тогда
		//	ТекущееОформление.Ячейки.СрокГодностиСтрокой.ЦветТекста = Красный;
		//ИначеЕсли ДанныеВСД.СрокГодности<ПороговаяДата Тогда
		//	ТекущееОформление.Ячейки.СрокГодностиСтрокой.ЦветТекста = Красный;
		//КонецЕсли;
	Иначе
		ТекстПредставления = ДанныеВСД.СрокГодностиСтрокой;
	КонецЕсли;
	ТекущаяСтрока.ВСДПредставлениеСрокГодности = ТекстПредставления;
	
	ТекстПредставления = "";
	Производители = ДанныеВСД.Производители.Выбрать();
	Пока Производители.Следующий() Цикл
		ТекстПредставления = ТекстПредставления + ?(ТекстПредставления = "", "", ", ") + СокрЛП(Производители.Производитель);
	КонецЦикла;
	
	ТекущаяСтрока.ВСДПредставлениеПроизводители = ТекстПредставления;
	
	ТекстПредставления = "";
	Упаковки = ДанныеВСД.Упаковки.Выбрать();
	Пока Упаковки.Следующий() Цикл
		ТекстПредставления = ТекстПредставления + ?(ТекстПредставления = "", "", ", ") + Строка(Упаковки.КоличествоУпаковок) + " " + Упаковки.Упаковка;
	КонецЦикла;
	ТекущаяСтрока.ВСДПредставлениеУпаковки = ТекстПредставления;
	
	ПересчитатьРасхождения(Объект.Товары, ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьИдентификаторСтроки()
	
	ИдентификаторСтроки = 0;
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Попытка
			ВремИдентификаторСтроки = Число(ТекущаяСтрока.ИдентификаторСтроки);
		Исключение
			ВремИдентификаторСтроки = 0;
		КонецПопытки;
		ИдентификаторСтроки = Макс(ИдентификаторСтроки, ВремИдентификаторСтроки);
	КонецЦикла;
	ИдентификаторСтроки = ИдентификаторСтроки + 1;
	
КонецПроцедуры

// Заполняет служебные реквизиты
&НаСервере
Процедура СформироватьПредставлениеСлужебныхРеквизитов(ТекущаяСтрока = Неопределено)
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТаблицаТоваров = Объект.Товары.Выгрузить(,"ВСД, ВСДВозврат, НомерСтроки")
	Иначе
		ТаблицаТоваров = Объект.Товары.Выгрузить(ТекущаяСтрока,"ВСД, ВСДВозврат, НомерСтроки")
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаТовары.ВСД КАК Документ.ВСДВЕТИС) КАК ВСД,
	|	ВЫРАЗИТЬ(ТаблицаТовары.ВСДВозврат КАК Документ.ВСДВЕТИС) КАК ВСДВозврат,
	|	ТаблицаТовары.НомерСтроки
	|ПОМЕСТИТЬ
	|	ТаблицаТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	//|ГДЕ
	//|	ТаблицаТовары.ВСД = ЗНАЧЕНИЕ(Документ.ВСДВЕТИС.ПустаяСсылка)
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.ВСД,
	|	ТаблицаТовары.НомерСтроки-1 КАК Инд,
	|	ТаблицаТовары.ВСД.Количество КАК Количество,
	|	ТаблицаТовары.ВСД.Скоропортящаяся КАК Скоропортящаяся,
	|	ТаблицаТовары.ВСД.Некачественный КАК Некачественный,
	|	ТаблицаТовары.ВСД.ДатаВыработки КАК ДатаВыработки,
	|	ТаблицаТовары.ВСД.ДатаВыработкиПо КАК ДатаВыработкиПо,
	|	ТаблицаТовары.ВСД.ДатаВыработкиСтрокой КАК ДатаВыработкиСтрокой,
	|	Представление(ТаблицаТовары.ВСД.Статус) КАК Статус,
	|	Представление(ТаблицаТовары.ВСД.СтранаПроисхождения) КАК СтранаПроисхождения,
	|	Представление(ТаблицаТовары.ВСДВозврат.Статус) КАК ВозвратСтатус,
	|	Представление(ТаблицаТовары.ВСД.Продукция) КАК Продукция,
	|	ТаблицаТовары.ВСД.СрокГодности КАК СрокГодности,
	|	ТаблицаТовары.ВСД.СрокГодностиПо КАК СрокГодностиПо,
	|	ТаблицаТовары.ВСД.СрокГодностиСтрокой КАК СрокГодностиСтрокой,
	|	ТаблицаТовары.ВСД.Упаковки.(
	|		Представление(Упаковка) КАК Упаковка,
	|		ИдентификаторСтроки,
	|		КоличествоУпаковок
	|	) КАК Упаковки,
	|	ТаблицаТовары.ВСД.Маркировка.(
	|		Маркировка,
	|		ИдентификаторСтроки
	|	) КАК Маркировка,
	|	ТаблицаТовары.ВСД.Производители.(
	|		Производитель
	|	) КАК Производители
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|";
	
	Запрос.УстановитьПараметр("ТаблицаТовары", ТаблицаТоваров);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекущаяСтрока = Объект.Товары[Выборка.Инд];
		
		ЗаполнитьПредставлениеСлужебныхРеквизитовСтроки(ТекущаяСтрока, Выборка);
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьПредставлениеСлужебныхРеквизитов()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ПослеПодбораУпаковок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = ДополнительныеПараметры.ДанныеСтроки;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ИдентификаторСтроки) Тогда
		ДанныеСтроки.ИдентификаторСтроки = ИдентификаторСтроки;
		ИдентификаторСтроки = ИдентификаторСтроки + 1;
	КонецЕсли;
	
	Упаковки    = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ДанныеСтроки.ИдентификаторСтроки));
	Для Каждого ТекущаяСтрока Из Упаковки Цикл
		Объект.Упаковки.Удалить(ТекущаяСтрока);
	КонецЦикла;
	
	УпаковкиПредставление = "";
	Для Каждого ТекущаяСтрока Из Результат Цикл
		НоваяСтрока = Объект.Упаковки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.ИдентификаторСтроки = ДанныеСтроки.ИдентификаторСтроки;
		УпаковкиПредставление = УпаковкиПредставление + ?(ЗначениеЗаполнено(УпаковкиПредставление),", ", "") + Строка(НоваяСтрока.Упаковка);
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		УпаковкиПредставление = "Упаковки не указаны";
	КонецЕсли;
	
	ДанныеСтроки.Упаковки = УпаковкиПредставление;
	ЭтотОбъект.Модифицированность = Истина;

КонецПроцедуры  // ПослеПодбораУпаковок()

&НаСервере
Процедура ПересчетДанныхПослеПодора()
	
	МассивВСД = Новый Массив;
	Для Каждого ТекущиеДанные Из Объект.Товары Цикл
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ВСД) Тогда
			Продолжить;
		КонецЕсли;
		
		// Вызываем обработчик изменения данных объекта
		Документы.ГашениеВходящихВСДВЕТИС.ТоварыВСДПриИзменении(Объект, ТекущиеДанные);
		
		Если МассивВСД.Найти(ТекущиеДанные.ВСД) = Неопределено Тогда
			ПересчитатьРасхождения(Объект.Товары, ТекущиеДанные);
			МассивВСД.Добавить(ТекущиеДанные.ВСД);
		КонецЕсли;
	КонецЦикла;
	
	СформироватьПредставлениеСлужебныхРеквизитов();
	
КонецПроцедуры

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ПослеПодбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОпределитьИдентификаторСтроки();
	
	КоличествоТоваров = Объект.Товары.Количество();
	
	Для Каждого ТекущиеДанные Из Объект.Товары Цикл
		
		НайденныеСтроки = Результат.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
		КоличествоСтрок = НайденныеСтроки.Количество();
		Если КоличествоСтрок = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущиеДанные.ВСД        = НайденныеСтроки[0].ВСД;
		ТекущиеДанные.Количество = НайденныеСтроки[0].Количество;
		ТекущиеДанные.Вес        = НайденныеСтроки[0].Вес;
		
		ИндСтроки = 1;
		Пока ИндСтроки < КоличествоСтрок Цикл
			НайденнаяСтрока = НайденныеСтроки[ИндСтроки];
			
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
			НоваяСтрока.ВСД        = НайденнаяСтрока.ВСД;
			НоваяСтрока.Количество = НайденнаяСтрока.Количество;
			НоваяСтрока.Вес        = НайденнаяСтрока.Вес;
			НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
			
			ИдентификаторСтроки = ИдентификаторСтроки + 1;
			
			ИндСтроки = ИндСтроки + 1;
		КонецЦикла;
		
	КонецЦикла;
	
	ПересчетДанныхПослеПодора();
	
	Модифицированность = Истина;
	
КонецПроцедуры  // ПослеПодбора()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
	ИнтеграцияВЕТИС.УстановитьПараметрыВыбораПредприятий(Элементы.ПредприятиеОтправитель, Объект.Отправитель);
	ИнтеграцияВЕТИС.УстановитьПараметрыВыбораПредприятий(Элементы.ПредприятиеПолучатель, Объект.Получатель);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект); 
	
	НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("РешениеПринятияПартии", Перечисления.РешенияПринятияПартииВЕТИС.ACCEPT_ALL));
	Элементы.СтраницаТранспортныеДанныеВозврат.Доступность = (НЕ НайденныеСтроки.Количество()=Объект.Товары.Количество());
	
	Элементы.Контрагент.Доступность = (НЕ Объект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровИзФилиалаВЕТИС);
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
	// Сроки годности 
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСрокГодности.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СрокГодности");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = ТекущаяДата();
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	
	// Сроки годности 
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСрокГодностиПо.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СрокГодностиПо");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = ТекущаяДата();
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.СрокГодностиПо");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	
	// Расхождение
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыРасхождение.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Товары.Расхождение");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	
	// ВСД
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыВСД.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВСД");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "ВСД не указан!");
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
// Параметры:
//  ИмяСобытия - Строка - Имя события, при работе которого необходимо проверить блокировку.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события возникающего при выполнении команды "ОбновитьДанныеВозвратов" в контексте сервера.
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаСервере
Процедура ОбновитьДанныеВозвратовНаСервере()
	
	// Вызываем обработчик изменения данных объекта
	Документы.ГашениеВходящихВСДВЕТИС.ОбновитьВозвратНажатие(Объект);
	
КонецПроцедуры // ОбновитьДанныеВозвратовНаСервере()

// Обработчик события возникающего на клиенте при выполнении команды "ОбновитьДанныеВозвратов".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура ОбновитьДанныеВозвратов(Команда)
	
	// Обработаем событие в контексте сервера
	ОбновитьДанныеВозвратовНаСервере()
	
КонецПроцедуры // ОбновитьДанныеВозвратов()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПоступлениеТоваров.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего в контексте сервера при изменении данных реквизита "Количество"
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаСервере
Процедура ТоварыВСДПриИзмененииНаСервере()

	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ГашениеВходящихВСДВЕТИС.ТоварыВСДПриИзменении(Объект, ТекущиеДанные);
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(ТекущиеДанные);
	
	СформироватьПредставлениеСлужебныхРеквизитов(МассивСтрок);
	
	МассивВСД = Новый Массив;
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ВСД) Тогда
			Продолжить;
		КонецЕсли;
		Если МассивВСД.Найти(ТекущаяСтрока.ВСД) = Неопределено Тогда
			ПересчитатьРасхождения(Объект.Товары, ТекущаяСтрока);
			МассивВСД.Добавить(ТекущаяСтрока.ВСД);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ТоварыВСДПриИзмененииНаСервере()

 // Обработчик события возникающего на клиенте при изменении данных реквизита "Количество"
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыВСДПриИзменении(Элемент)

	// Обработаем событие в контексте сервера
	ТоварыВСДПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыВСДПриИзменении()

// Обработчик события возникающего в контексте сервера при изменении данных реквизита "Количество"
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаСервере
Процедура ТоварыРешениеПринятияПартииПриИзмененииНаСервере()
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
	ТекущаяСтрока = Элементы.Товары.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(ТекущаяСтрока);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.РешениеПринятияПартии = ПредопределенноеЗначение("Перечисление.РешенияПринятияПартииВЕТИС.ACCEPT_ALL") Тогда
		
		ТекущиеДанные.Количество = ТекущиеДанные.Количество + ТекущиеДанные.КВозврату;
		ТекущиеДанные.КВозврату  = 0;
		ТекущиеДанные.Вес        = ТекущиеДанные.Количество * ТекущиеДанные.КоэффициентВеса;
		
	ИначеЕсли ТекущиеДанные.КВозврату = 0 И Число(ТекущиеДанные.Расхождение)<0 И ТекущиеДанные.РешениеПринятияПартии = ПредопределенноеЗначение("Перечисление.РешенияПринятияПартииВЕТИС.PARTIALLY") Тогда
		
		Если ТекущиеДанные.КоэффициентВеса = 0 Тогда
			КВозврату = -Число(ТекущиеДанные.Расхождение);
		Иначе
			КВозврату = -Число(ТекущиеДанные.Расхождение)/ТекущиеДанные.КоэффициентВеса;
		КонецЕсли;
		
		ТекущиеДанные.КВозврату   = ТекущиеДанные.КВозврату + КВозврату;
		//ТекущиеДанные.Количество  = ТекущиеДанные.Количество - КВозврату;
		ТекущиеДанные.Расхождение = "0";
		ТекущиеДанные.Вес         = ТекущиеДанные.Количество * ТекущиеДанные.КоэффициентВеса;
		
	ИначеЕсли ТекущиеДанные.РешениеПринятияПартии = ПредопределенноеЗначение("Перечисление.РешенияПринятияПартииВЕТИС.RETURN_ALL") Тогда
		
		ТекущиеДанные.КВозврату  = ТекущиеДанные.КВозврату + ТекущиеДанные.Количество;
		ТекущиеДанные.Количество = 0;
		ТекущиеДанные.Вес        = 0;
		
	КонецЕсли;
	
	ПересчитатьРасхождения(Объект.Товары, ТекущиеДанные);
	
КонецПроцедуры // ТоварыРешениеПринятияПартииПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество"
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыРешениеПринятияПартииПриИзменении(Элемент)
	
	ТоварыРешениеПринятияПартииПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыРешениеПринятияПартииПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество"
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.Вес = ТекущиеДанные.КоэффициентВеса*ТекущиеДанные.Количество;
		ПересчитатьРасхождения(Объект.Товары, ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры // ТоварыКоличествоПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Коэффициент"
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыКоэффициентВесаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.Вес = ТекущиеДанные.КоэффициентВеса*ТекущиеДанные.Количество;
		ПересчитатьРасхождения(Объект.Товары, ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры // ТоварыКоэффициентВесаПриИзменении()

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле - Булево - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	
	Если НЕ Поле.Имя = "ТоварыУпаковки" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Объект.Товары.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ИдентификаторСтроки) Тогда
		ДанныеСтроки.ИдентификаторСтроки = ИдентификаторСтроки;
		ИдентификаторСтроки = ИдентификаторСтроки + 1;
	КонецЕсли;
	
	УпаковкиСтроки = Новый Массив;
	
	НайденныеУпаковки = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ДанныеСтроки.ИдентификаторСтроки));
	Для Каждого ТекущаяСтрока Из НайденныеУпаковки Цикл
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("Упаковка",           ТекущаяСтрока.Упаковка);
		НоваяСтрока.Вставить("УровеньУпаковки", ТекущаяСтрока.УровеньУпаковки);
		НоваяСтрока.Вставить("Маркировка",      ТекущаяСтрока.Маркировка);
		НоваяСтрока.Вставить("ТипМаркировки",      ТекущаяСтрока.ТипМаркировки);
		НоваяСтрока.Вставить("КоличествоУпаковок",      ТекущаяСтрока.КоличествоУпаковок);
		
		УпаковкиСтроки.Добавить(НоваяСтрока);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Упаковки", УпаковкиСтроки);
	ПараметрыФормы.Вставить("ИдентификаторСтроки",  ДанныеСтроки.ИдентификаторСтроки);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДанныеСтроки", ДанныеСтроки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПослеПодбораУпаковок",
			ЭтотОбъект,
			ДополнительныеПараметры);
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ПодборУпаковок", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры //ТоварыВыбор()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСтатусОбработки();
	
	СформироватьПредставлениеСлужебныхРеквизитов();
	ОпределитьИдентификаторСтроки();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторСтроки) Тогда
			Продолжить;
		КонецЕсли;
		ТекущаяСтрока.ИдентификаторСтроки  = ИдентификаторСтроки;
		ИдентификаторСтроки = ИдентификаторСтроки + 1;
	КонецЦикла;
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Настройка кнопок командной панели табличной части
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "Товары");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "ПунктыПерегрузки");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "ПунктыПерегрузкиВозврат");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "УсловияПеремещенияПродукцииВозврат");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "СвязанныеДокументыВозврат");
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	Если Источник="ПодключаемоеОборудование" Тогда
		Возврат;
	КонецЕсли;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьПредставлениеСлужебныхРеквизитов();
	ОпределитьИдентификаторСтроки();
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	ОбновитьСтатусОбработки();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГашениеВходящихВСДВЕТИС.ВСД.Продукция КАК Продукция,
	|	ГашениеВходящихВСДВЕТИС.Номенклатура КАК Номенклатура,
	|	ГашениеВходящихВСДВЕТИС.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК ГашениеВходящихВСДВЕТИС
	|ГДЕ
	|	ГашениеВходящихВСДВЕТИС.Ссылка = &Ссылка И 
	|	(НЕ ГашениеВходящихВСДВЕТИС.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) И 
	|	(НЕ ГашениеВходящихВСДВЕТИС.ВСД.Продукция = ЗНАЧЕНИЕ(Справочник.ПродукцияВЕТИС.ПустаяСсылка))
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГашениеВходящихВСДВЕТИС.ВСД.Продукция КАК Продукция,
	|	ГашениеВходящихВСДВЕТИС.ВСД.СпособХранения КАК СпособХранения
	|ИЗ
	|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК ГашениеВходящихВСДВЕТИС
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ПродукцияВетИС КАК ТабПродукция
	|ПО
	|	ГашениеВходящихВСДВЕТИС.ВСД.Продукция = ТабПродукция.Ссылка
	|ГДЕ
	|	ГашениеВходящихВСДВЕТИС.Ссылка = &Ссылка
	|	И (НЕ ГашениеВходящихВСДВЕТИС.ВСД.Продукция = ЗНАЧЕНИЕ(Справочник.ПродукцияВЕТИС.ПустаяСсылка))
	|	И (НЕ ГашениеВходящихВСДВЕТИС.ВСД.СпособХранения = ЗНАЧЕНИЕ(Перечисление.СпособыХраненияВЕТИС.ПустаяСсылка))
	|	И ТабПродукция.СпособХранения = ЗНАЧЕНИЕ(Перечисление.СпособыХраненияВЕТИС.ПустаяСсылка)
	|";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ВыборкаСоответствиеНоменклатуры = ПакетЗапросов[ПакетЗапросов.Количество()-2].Выбрать();
	ВыборкаСпособХранения           = ПакетЗапросов[ПакетЗапросов.Количество()-1].Выбрать();
	
	Пока ВыборкаСоответствиеНоменклатуры.Следующий() Цикл
		МенеджерЗаписиСоответствиеНоменклатурыыВЕТИС = РегистрыСведений.СоответствиеНоменклатурыВЕТИС.СоздатьМенеджерЗаписи();
		МенеджерЗаписиСоответствиеНоменклатурыыВЕТИС.Номенклатура     = ВыборкаСоответствиеНоменклатуры.Номенклатура;
		МенеджерЗаписиСоответствиеНоменклатурыыВЕТИС.Продукция        = ВыборкаСоответствиеНоменклатуры.Продукция;
		МенеджерЗаписиСоответствиеНоменклатурыыВЕТИС.ЕдиницаИзмерения = ВыборкаСоответствиеНоменклатуры.ЕдиницаИзмерения;
		МенеджерЗаписиСоответствиеНоменклатурыыВЕТИС.Записать();
	КонецЦикла;
	
	Пока ВыборкаСпособХранения.Следующий() Цикл
		ПродукцияОбъект = ВыборкаСпособХранения.Продукция.ПолучитьОбъект();
		ПродукцияОбъект.СпособХранения = ВыборкаСпособХранения.СпособХранения;
		ПродукцияОбъект.Записать();
	КонецЦикла;
	
	ГоловнойКонтрагент = Неопределено;
	Если ЕстьРеквизит(Объект.ДокументОснование, "Контрагент") Тогда
		ГоловнойКонтрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "Контрагент.ГоловнойКонтрагент");
		Контрагент         = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "Контрагент");
	КонецЕсли;
	
	ОтправительОбъект = Неопределено;
	ЗаписатьОтправительОбъект = Ложь;
	Если ЗначениеЗаполнено(ГоловнойКонтрагент) И ЗначениеЗаполнено(Объект.ПредприятиеОтправитель) И ЗначениеЗаполнено(Объект.Отправитель) Тогда
		
		Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Отправитель, "Контрагент") = ГоловнойКонтрагент Тогда
			ОтправительОбъект = Объект.Отправитель.ПолучитьОбъект();
			ОтправительОбъект.Контрагент = ГоловнойКонтрагент;
			ЗаписатьОтправительОбъект = Истина;
		КонецЕсли;
		
		СтрокаПредприятия = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьНастройкиПредприятия(Объект.Отправитель, Объект.ПредприятиеОтправитель);
		
		Если СтрокаПредприятия = Неопределено Тогда
			
			Если ОтправительОбъект = Неопределено Тогда
				ОтправительОбъект = Объект.Отправитель.ПолучитьОбъект();
			КонецЕсли;
			
			НайденнаяСтрока = ОтправительОбъект.Предприятия.Добавить();
			НайденнаяСтрока.Предприятие    = Объект.ПредприятиеОтправитель;
			НайденнаяСтрока.ТорговыйОбъект = Контрагент;
			
			ЗаписатьОтправительОбъект = Истина;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаПредприятия.ТорговыйОбъект) Тогда
			
			Если ОтправительОбъект = Неопределено Тогда
				ОтправительОбъект = Объект.Отправитель.ПолучитьОбъект();
			КонецЕсли;
			
			НайденнаяСтрока = ОтправительОбъект.Предприятия.Найти(Объект.ПредприятиеОтправитель, "Предприятие");
			Если НЕ НайденнаяСтрока = Неопределено Тогда
				НайденнаяСтрока.ТорговыйОбъект = Контрагент;
				ЗаписатьОтправительОбъект = Истина;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		ГрузоОтправитель = Неопределено;
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			Грузоотправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "СкладКомпании");
		ИначеЕсли ЕстьРеквизит(Объект.ДокументОснование, "ГрузоОтправитель") Тогда
			ГрузоОтправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "ГрузоОтправитель");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГрузоОтправитель) И ЗначениеЗаполнено(Объект.ПредприятиеОтправитель) И ЗначениеЗаполнено(Объект.Отправитель) Тогда
			
			СтрокаПредприятия = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьНастройкиПредприятия(Объект.Отправитель, Объект.ПредприятиеОтправитель);
			
			Если СтрокаПредприятия = Неопределено Тогда
				Если ОтправительОбъект = Неопределено Тогда
					ОтправительОбъект = Объект.Отправитель.ПолучитьОбъект();
				КонецЕсли;
				НайденнаяСтрока = ОтправительОбъект.Предприятия.Добавить();
				НайденнаяСтрока.Предприятие = Объект.ПредприятиеОтправитель;
				Если ТипЗнч(ГрузоОтправитель) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
					НайденнаяСтрока.ОсновнойОтдел = ГрузоОтправитель;
				Иначе
					НайденнаяСтрока.ТорговыйОбъект = ГрузоОтправитель;
				КонецЕсли;
				
				ЗаписатьОтправительОбъект = Истина;
				
			ИначеЕсли ТипЗнч(ГрузоОтправитель) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
				Если НЕ ЗначениеЗаполнено(СтрокаПредприятия.ОсновнойОтдел) Тогда
					Если ОтправительОбъект = Неопределено Тогда
						ОтправительОбъект = Объект.Отправитель.ПолучитьОбъект();
					КонецЕсли;
					НайденнаяСтрока = ОтправительОбъект.Предприятия.Найти(Объект.ПредприятиеОтправитель, "Предприятие");
					Если НЕ НайденнаяСтрока = Неопределено Тогда
						НайденнаяСтрока.ОсновнойОтдел = ГрузоОтправитель;
						ЗаписатьОтправительОбъект = Истина;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаПредприятия.ТорговыйОбъект) Тогда
				Если ОтправительОбъект = Неопределено Тогда
					ОтправительОбъект = Объект.Отправитель.ПолучитьОбъект();
				КонецЕсли;
				НайденнаяСтрока = ОтправительОбъект.Предприятия.Найти(Объект.ПредприятиеОтправитель, "Предприятие");
				Если НЕ НайденнаяСтрока = Неопределено Тогда
					НайденнаяСтрока.ТорговыйОбъект = ГрузоОтправитель;
					ЗаписатьОтправительОбъект = Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаписатьОтправительОбъект И (НЕ ОтправительОбъект = Неопределено) Тогда
		Попытка
			ОтправительОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Грузополучатель = Неопределено;
	Попытка
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			Грузополучатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "СкладПолучатель.ПодразделениеКомпании");
		Иначе
			Грузополучатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "СкладКомпании.ПодразделениеКомпании");
		КонецЕсли;
	Исключение
		Грузополучатель = Неопределено;
	КонецПопытки;
	
	Если (НЕ Грузополучатель = Неопределено) И ЗначениеЗаполнено(Объект.Получатель) И ЗначениеЗаполнено(Объект.ПредприятиеПолучатель) Тогда
		
		СтрокаПредприятия = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьНастройкиПредприятия(Объект.Получатель, Объект.ПредприятиеПолучатель);
		Если СтрокаПредприятия = Неопределено Тогда
			ПолучательОбъект = Объект.Получатель.ПолучитьОбъект();
			НоваяСтрока = ПолучательОбъект.Предприятия.Добавить();
			НоваяСтрока.Предприятие = Объект.ПредприятиеПолучатель;
			НоваяСтрока.ОсновнойОтдел  = Грузополучатель;
			Попытка
				ПолучательОбъект.Записать();
			Исключение
			КонецПопытки;
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаПредприятия.ОсновнойОтдел) Тогда
			ПолучательОбъект = Объект.Получатель.ПолучитьОбъект();
			НоваяСтрока = ПолучательОбъект.Предприятия.Найти(Объект.ПредприятиеПолучатель, "Предприятие");
			Если НЕ НоваяСтрока = Неопределено Тогда
				НоваяСтрока.ОсновнойОтдел = Грузополучатель;
				Попытка
					ПолучательОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СтатусыДокументовВЕТИС.Документ КАК ГашениеСсылка
	|ПОМЕСТИТЬ
	|	ТаблицаГашение
	|ИЗ
	|	РегистрСведений.СтатусыДокументовВЕТИС КАК СтатусыДокументовВЕТИС
	|ГДЕ
	|	(НЕ СтатусыДокументовВЕТИС.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.ВидыСтатусовОбработкиВЕТИС.ВСДПогашены)) И 
	|	(НЕ СтатусыДокументовВЕТИС.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.ВидыСтатусовОбработкиВЕТИС.Черновик)) И 
	|	СтатусыДокументовВЕТИС.Документ = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаГашение.ГашениеСсылка КАК ГашениеСсылка,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА (НЕ ГашениеВходящихВСДВЕТИС.ВСД = ЗНАЧЕНИЕ(Документ.ВСДВЕТИС.ПустаяСсылка)) И 
	|			(НЕ ГашениеВходящихВСДВЕТИС.ВСД.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВСДВЕТИС.UTILIZED)) ТОГДА
	|			1
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ) КАК ЕстьНеПогашенные
	|ИЗ
	|	ТаблицаГашение КАК ТаблицаГашение
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК ГашениеВходящихВСДВЕТИС
	|ПО
	|	ТаблицаГашение.ГашениеСсылка = ГашениеВходящихВСДВЕТИС.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаГашение.ГашениеСсылка
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА (НЕ ГашениеВходящихВСДВЕТИС.ВСД = ЗНАЧЕНИЕ(Документ.ВСДВЕТИС.ПустаяСсылка)) И 
	|			(НЕ ГашениеВходящихВСДВЕТИС.ВСД.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВСДВЕТИС.UTILIZED)) ТОГДА
	|			1
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ) = 0
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Попытка
			ПараметрыОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ПараметрыОбновления();
			ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.ВСДПогашены;
			ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.НеТребуется;
			
			НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ОбновитьСтатус(Выборка.ГашениеСсылка, ПараметрыОбновления);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	СформироватьПредставлениеСлужебныхРеквизитов();
	ОпределитьИдентификаторСтроки();
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	ОбновитьСтатусОбработки();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
	РазблокироватьДанныеФормыДляРедактирования();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура ПоискВТаблицеТоварыРезультатОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ШтрихКодДляПоиска = РезультатОповещения;
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ПоискПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКодуОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ДобавлениеНовыхПозицийПоШтрихКоду");
КонецПроцедуры

&НаСервере
Процедура ОтправительПриИзмененииНаСервере()
	
	ИнтеграцияВЕТИС.УстановитьПараметрыВыбораПредприятий(Элементы.ПредприятиеОтправитель, Объект.Отправитель);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительПриИзменении(Элемент)
	ОтправительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучательПриИзмененииНаСервере()
	
	ИнтеграцияВЕТИС.УстановитьПараметрыВыбораПредприятий(Элементы.ПредприятиеПолучатель, Объект.Получатель);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	ПолучательПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТоварыРезультатСоответствияПриИзмененииНаСервере()
	
	//УправлениеДиалогомНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРезультатСоответствияПриИзменении(Элемент)
	
	//ТоварыРезультатСоответствияПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыборкаВСД(Результат, ДопПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры.Свойство("ТекущаяСтрока") Тогда
		ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(ДопПараметры.ТекущаяСтрока);
		Если Не ТекущиеДанные = Неопределено Тогда
			ТекущиеДанные.ВСД = Результат;
			ТоварыВСДПриИзменении(Неопределено);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВСДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборФормы = Новый Структура;
	ОтборФормы.Вставить("Отправитель",            Объект.Отправитель);
	ОтборФормы.Вставить("ПредприятиеОтправитель", Объект.ПредприятиеОтправитель);
	ОтборФормы.Вставить("Получатель",             Объект.Получатель);
	ОтборФормы.Вставить("ПредприятиеПолучатель",  Объект.ПредприятиеПолучатель);
	ОтборФормы.Вставить("НомерТТН",               Объект.НомерТТН);
	ОтборФормы.Вставить("ДатаТТН",                Объект.ДатаТТН);
	ОтборФормы.Вставить("Номенклатура",           Элементы.Товары.ТекущиеДанные.Номенклатура);
	ОтборФормы.Вставить("Статус",    		      ПредопределенноеЗначение("Перечисление.СтатусыВСДВЕТИС.CONFIRMED"));
	
	ПодобранныеВСД = Новый Массив;
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(ТекСтрока.ВСД) И ПодобранныеВСД.Найти(ТекСтрока.ВСД) = Неопределено Тогда
			ПодобранныеВСД.Добавить(ТекСтрока.ВСД);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("РежимВыбора", Истина);
	ПараметрыЗаполнения.Вставить("Отбор", ОтборФормы);
	ПараметрыЗаполнения.Вставить("ПодобранныеВСД", ПодобранныеВСД);
	Если ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.ВСД) Тогда
		ПараметрыЗаполнения.Вставить("ТекущаяСтрока", Элементы.Товары.ТекущиеДанные.ВСД);
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТекущаяСтрока", Элементы.Товары.ТекущаяСтрока);
	ДопПараметры.Вставить("СтарыйВСД",     Элементы.Товары.ТекущиеДанные.ВСД);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыборкаВСД", ЭтотОбъект, ДопПараметры);
	
	//ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ПодборПартий", ПараметрыЗаполнения, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ОткрытьФорму("Документ.ВСДВЕТИС.ФормаВыбора", ПараметрыЗаполнения, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при выполнении команды "Подбор".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура Подбор(Команда)
	
	ТаблицаТоваров = Новый Массив;
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		СтруктураСтроки = Новый Структура(
		"ВСД, Номенклатура, Продукция, Количество, ЕдиницаИзмеренияНоменклатуры, Вес, КоэффициентВеса, Расхождение, ВСДКоличество, ЕдиницаИзмерения, 
		|СрокГодности, СрокГодностиПо, КВозврату, ИдентификаторСтроки, ДатаВыработки, ДатаВыработкиПо");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущаяСтрока);
		ТаблицаТоваров.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Отправитель",            Объект.Отправитель);
	ПараметрыЗаполнения.Вставить("Получатель",             Объект.Получатель);
	ПараметрыЗаполнения.Вставить("ПредприятиеОтправитель", Объект.ПредприятиеОтправитель);
	ПараметрыЗаполнения.Вставить("ПредприятиеПолучатель",  Объект.ПредприятиеПолучатель);
	ПараметрыЗаполнения.Вставить("НомерТТН",               Объект.НомерТТН);
	ПараметрыЗаполнения.Вставить("ДатаТТН",                Объект.ДатаТТН);
	ПараметрыЗаполнения.Вставить("ТаблицаТоваров",         ТаблицаТоваров);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодбора", ЭтотОбъект);
	
	ОткрытьФорму("Документ.ВСДВЕТИС.Форма.ФормаПодбораВСД", ПараметрыЗаполнения, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ФормаПодбораВСД", ПараметрыЗаполнения, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
	//ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	//
	//Если ТекущиеДанные = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//НайденныеСтроки = Объект.Партии.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
	//
	//ПараметрыЗаполнения = Новый Структура;
	//ПараметрыЗаполнения.Вставить("ХозяйствующийСубъект", Объект.Отправитель);
	//ПараметрыЗаполнения.Вставить("Предприятие",          Объект.ПредприятиеОтправитель);
	//ПараметрыЗаполнения.Вставить("Номенклатура",         ТекущиеДанные.Номенклатура);
	//ПараметрыЗаполнения.Вставить("Количество",           ТекущиеДанные.Вес);
	////ПараметрыЗаполнения.Вставить("ВидПродукции",ТекущиеДанные.ВидПродукции);
	////ПараметрыЗаполнения.Вставить("Продукция",             ТекущиеДанные.Продукция);
	////ПараметрыЗаполнения.Вставить("ЭкспертизаРезультат",   ТекущиеДанные.ЭкспертизаРезультат);
	//
	//Партии = Новый Массив;
	//СтруктураПартии = Новый Структура;
	//СтруктураПартии.Вставить("Продукция");
	//СтруктураПартии.Вставить("Количество");
	//СтруктураПартии.Вставить("ЕдиницаИзмерения");
	//СтруктураПартии.Вставить("НомерЗаписи");
	//СтруктураПартии.Вставить("ИдентификаторСтрокиПартий");
	//СтруктураПартии.Вставить("СрокГодности");
	//СтруктураПартии.Вставить("ЭкспертизаРезультат");
	//СтруктураПартии.Вставить("СпособХранения");
	//
	//Упаковки = Новый Массив;
	//СтруктураУпаковки = Новый Структура;
	//СтруктураУпаковки.Вставить("Упаковка");
	//СтруктураУпаковки.Вставить("КоличествоУпаковок");
	//СтруктураУпаковки.Вставить("УровеньУпаковки");
	//СтруктураУпаковки.Вставить("Маркировка");
	//СтруктураУпаковки.Вставить("ТипМаркировки");
	//СтруктураУпаковки.Вставить("ИдентификаторСтроки");
	//
	//Для Каждого СтрокаПартии Из НайденныеСтроки Цикл
	//	ЗаполнитьЗначенияСвойств(СтруктураПартии, СтрокаПартии);
	//	Партии.Добавить(СтруктураПартии);
	//	НайденныеСтрокиУпаковок = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаПартии.ИдентификаторСтрокиПартий));
	//	Для Каждого СтрокаУпаковки Из НайденныеСтрокиУпаковок Цикл
	//		ЗаполнитьЗначенияСвойств(СтруктураУпаковки, СтрокаУпаковки);
	//		Упаковки.Добавить(СтруктураУпаковки);
	//	КонецЦикла;
	//КонецЦикла;
	//ПараметрыЗаполнения.Вставить("Партии",Партии);
	//ПараметрыЗаполнения.Вставить("Упаковки",Упаковки);
	//
	//ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодбора", ЭтотОбъект);
	//
	//ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ПодборПартий", ПараметрыЗаполнения, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // Подбор()

&НаКлиенте
Процедура ЗаполнитьВСД(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("НомерТТН", Объект.НомерТТН);
	ПараметрыОткрытияФормы.Вставить("ДатаТТН",  Объект.ДатаТТН);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияНомераТТН", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ФормаНомераТТН", ПараметрыОткрытияФормы, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ПослеПолученияНомераТТННаСервере(НомерТТН, ДатаТТН)
	
	Документы.ГашениеВходящихВСДВЕТИС.ЗаполнитьВСД(Объект, НомерТТН, ДатаТТН);
	
	СформироватьПредставлениеСлужебныхРеквизитов();
	
	ОпределитьИдентификаторСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияНомераТТН(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	НомерТТН = ПолучитьЗначениеПараметраСтруктуры(Результат, "НомерТТН", "");
	ДатаТТН  = ПолучитьЗначениеПараметраСтруктуры(Результат, "ДатаТТН", Дата(1,1,1));
	
	ПослеПолученияНомераТТННаСервере(НомерТТН, ДатаТТН);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПричинаСоставленияАктаНесоответствияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Товары.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
	ДопПараметры.Вставить("ВСД",           ТекущиеДанные.ВСД);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборПричиныСоставленияАктаНесоответствияПриЗавершении", ЭтотОбъект, ДопПараметры);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.ПричиныСоставленияАктаНесоответствияВЕТИС.ФормаВыбора", ПараметрыОткрытияФормы, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКВозвратуПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		//ТекущиеДанные.Вес = ТекущиеДанные.КоэффициентВеса*ТекущиеДанные.Количество;
		ПересчитатьРасхождения(Объект.Товары, ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекущиеДанные.ИдентификаторСтроки  = ИдентификаторСтроки;
		ИдентификаторСтроки = ИдентификаторСтроки + 1;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.РешениеПринятияПартии) Тогда
			ТекущиеДанные.РешениеПринятияПартии = ПредопределенноеЗначение("Перечисление.РешенияПринятияПартииВЕТИС.ACCEPT_ALL");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.РезультатСоответствия) Тогда
			ТекущиеДанные.РезультатСоответствия = ПредопределенноеЗначение("Перечисление.РезультатыСоответствияВЕТИС.CORRESPONDS");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ЗаключениеВетеринара) Тогда
			ТекущиеДанные.ЗаключениеВетеринара  = ПредопределенноеЗначение("Перечисление.РезультатыСоответствияВЕТИС.UNSUPERVISED");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеЗапросаВСД(Предприятие, МассивВСД)
	
	GuidПредприятия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Предприятие, "Код");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", МассивВСД);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТабВСД.Идентификатор КАК Идентификатор
	|ИЗ
	|	Документ.ВСДВЕТИС КАК ТабВСД
	|ГДЕ
	|	ТабВСД.Ссылка В (&Ссылка)
	|";
	
	ИдентификаторыВСД = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Идентификатор");
	
	Результат = Новый Структура;
	Результат.Вставить("ВСД",             ИдентификаторыВСД);
	Результат.Вставить("GuidПредприятия", GuidПредприятия);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьВСД(Команда)
	
	МассивВСД = Новый Массив;
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Если МассивВСД.Найти(ТекущаяСтрока.ВСД)=Неопределено Тогда
			МассивВСД.Добавить(ТекущаяСтрока.ВСД);
		КонецЕсли;
	КонецЦикла;
	
	Результат = ПолучитьДанныеЗапросаВСД(Объект.ПредприятиеПолучатель, МассивВСД);
	
	ДанныеДляВыгрузки = Новый СписокЗначений;
	Для Каждого ТекИдентификатор Из Результат.ВСД Цикл
		
		СтрокаВыгрузки = Новый Структура;
		СтрокаВыгрузки.Вставить("uuid",            ТекИдентификатор);
		СтрокаВыгрузки.Вставить("guidПредприятия", Результат.guidПредприятия);
		СтрокаВыгрузки.Вставить("Предприятие",     Объект.ПредприятиеПолучатель);
		
		ДанныеДляВыгрузки.Добавить(СтрокаВыгрузки);
		
	КонецЦикла;
	
	Если ДанныеДляВыгрузки.Количество()>0 Тогда
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ДанныеДляВыгрузки",    ДанныеДляВыгрузки);
		ПараметрыОткрытия.Вставить("ХозяйствующийСубъект", Объект.Получатель);
		ПараметрыОткрытия.Вставить("ВидОперации",          ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ЗапросВСД"));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьВСДЗавершение", ЭтотОбъект);
		
		ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ФормированиеЗапроса", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВСДЗавершение(Изменения, ДополнительныеПараметры) Экспорт
	
	Прочитать();
	ОбновитьСтатусОбработки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКоэффициентыЕдиницНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаНоменклатура", Объект.Товары.Выгрузить(,"Номенклатура, КоэффициентВеса"));
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаНоменклатура.Номенклатура,
	|	ТаблицаНоменклатура.КоэффициентВеса
	|ПОМЕСТИТЬ
	|	ТаблицаНоменклатура
	|ИЗ
	|	&ТаблицаНоменклатура КАК ТаблицаНоменклатура
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабНоменклатура.ОсновнаяЕдиницаИзмерения,
	|	ТаблицаНоменклатура.КоэффициентВеса,
	|	ТабНоменклатура.ОсновнаяЕдиницаИзмерения.ВесНетто КАК ВесНетто
	|ИЗ
	|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.Номенклатура КАК ТабНоменклатура
	|ПО
	|	ТаблицаНоменклатура.Номенклатура = ТабНоменклатура.Ссылка
	|ГДЕ
	|	ТабНоменклатура.ОсновнаяЕдиницаИзмерения.ВесНетто = 0
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОсновнаяЕдиницаИзмерения = Выборка.ОсновнаяЕдиницаИзмерения.ПолучитьОбъект();
		ОсновнаяЕдиницаИзмерения.ВесНетто = Выборка.КоэффициентВеса;
		ОсновнаяЕдиницаИзмерения.Записать();
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКоэффициентыЕдиниц(Команда)
	ЗаписатьКоэффициентыЕдиницНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	МассивВСД = Новый Массив;
	Для Каждого ТекущиеДанные Из Объект.Товары Цикл
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ВСД) Тогда
			Продолжить;
		КонецЕсли;
		
		Если МассивВСД.Найти(ТекущиеДанные.ВСД) = Неопределено Тогда
			ПересчитатьРасхождения(Объект.Товары, ТекущиеДанные);
			МассивВСД.Добавить(ТекущиеДанные.ВСД);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
ШтрихКодДляПоиска = "";


