
Функция ОпределитьПромокодПоКлючу(Знач Ключ) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_Промокоды.Ссылка КАК Промокод
		|ИЗ
		|	Справочник.ИТ_Промокоды КАК ИТ_Промокоды
		|ГДЕ
		|	ИТ_Промокоды.Ключ = &Ключ
		|	И НЕ ИТ_Промокоды.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ключ", ОпределитьКлюч(Ключ));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДанных.Следующий() Тогда 
		Возврат ВыборкаДанных.Промокод;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции
	
Функция ОпределитьКлюч(СтрокаКлюча)	Экспорт
	
	Ключ = СтрЗаменить(СтрокаКлюча, " ", "");
	Ключ = СокрЛП(Ключ);
	Ключ = ВРег(Ключ);

	Возврат Ключ;
	
КонецФункции	

