// Модуль менеджера документа "Инкассация"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	ИтогиОперации.Вставить("СуммаДокумента", Объект.Оплаты.Итог("Сумма"));
	
	// Производим установку полученных значений в итоговые показатели объекта
	Если НЕ Расширенные Тогда
		Возврат ИтогиОперации;
	КонецЕсли;
	
	// Формируем перечень расширенной информации об итогах операции
	ИтогиОперации.Вставить("СуммаВозврат",    Объект.Оплаты.Итог("СуммаВозврат"));
		
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

// Возвращает таблицу остатков по КассеККМ
// Параметры:
//	КассаККМ - СправочникСсылка.КассыККМ
//	НаМомент - Момент времени на который получаем остатки.
//
Функция ПолучитьОстатокПоКассеККМ(КассаККМ, НаМомент) Экспорт
	
	Документ = Неопределено;
	Если ТипЗнч(НаМомент) = Тип("Дата") Тогда
		ДатаРасчета = НаМомент;
	ИначеЕсли ТипЗнч(НаМомент) = Тип("МоментВремени") Тогда
		Документ    = НаМомент.Ссылка;
		ДатаРасчета = НаМомент.Дата;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|КассыККМ.СпособОплаты КАК ТипОплаты,
	|СУММА(ВЫБОР
	|	КОГДА КассыККМ.ВидДвижения = &ВидДвижения
	|			И КассыККМ.Сумма > 0
	|		ТОГДА ЕСТЬNULL(КассыККМ.Сумма, 0)
	|	ИНАЧЕ 0
	|КОНЕЦ)
	| - Сумма(ВЫБОР
	|	КОГДА КассыККМ.ВидДвижения = &ВидДвиженияВозврат
	|			И КассыККМ.Сумма > 0
	|		ТОГДА ЕСТЬNULL(КассыККМ.Сумма, 0)
	|	ИНАЧЕ 0
	|КОНЕЦ) КАК Сумма,
	|
	|-1* (СУММА(ВЫБОР
	|	КОГДА КассыККМ.ВидДвижения = &ВидДвижения
	|			И КассыККМ.Сумма < 0
	|		ТОГДА ЕСТЬNULL(КассыККМ.Сумма, 0)
	|	ИНАЧЕ 0
	|КОНЕЦ)
	| - Сумма(ВЫБОР
	|	КОГДА КассыККМ.ВидДвижения = &ВидДвиженияВозврат
	|			И КассыККМ.Сумма < 0
	|		ТОГДА ЕСТЬNULL(КассыККМ.Сумма, 0)
	|	ИНАЧЕ 0
	|КОНЕЦ)) КАК СуммаВозврат
	|
	|ИЗ
	|	РегистрНакопления.КассыККМ КАК КассыККМ
	|ГДЕ
	|	КассыККМ.Период <= &НаМомент
	|	И КассыККМ.КассаККМ = &КассаККМ" + ?(Документ = Неопределено, "", "
	|	И (НЕ КассыККМ.Регистратор = &Ссылка)") + "
	|
	|СГРУППИРОВАТЬ ПО
	|	КассыККМ.СпособОплаты";
	Запрос.УстановитьПараметр("НаМомент",           ДатаРасчета);
	Запрос.УстановитьПараметр("КассаККМ",           КассаККМ);
	Запрос.УстановитьПараметр("Ссылка",             Документ);
	Запрос.УстановитьПараметр("ВидДвижения",        ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияВозврат", ВидДвиженияНакопления.Расход);
	
	тзЗапрос = Новый ТаблицаЗначений;
	тзЗапрос.Колонки.Добавить("ТипОплаты");
	тзЗапрос.Колонки.Добавить("Сумма");
	тзЗапрос.Колонки.Добавить("СуммаВозврат");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Сумма = 0 И Выборка.СуммаВозврат = 0 Тогда 
			Продолжить; 
		ИначеЕсли Выборка.ТипОплаты.ВидОплаты = Перечисления.ВидыОплат.Наличные И Выборка.Сумма = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = тзЗапрос.Добавить();
		НоваяСтрока.ТипОплаты = Выборка.ТипОплаты; 
		НоваяСтрока.Сумма = Выборка.Сумма;
		НоваяСтрока.СуммаВозврат = 0;
		Если Выборка.ТипОплаты.ВидОплаты = Перечисления.ВидыОплат.Наличные Тогда
			НоваяСтрока.Сумма = НоваяСтрока.Сумма-Выборка.СуммаВозврат;
		Иначе
			НоваяСтрока.СуммаВозврат = Выборка.СуммаВозврат;
		КонецЕсли; 
КонецЦикла;
	
	Возврат тзЗапрос;
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("ВалютаДокумента");
	ОбязательныеРеквизиты.Добавить("КурсДокумента");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	
	Если Константы.ИспользоватьПодключаемоеОборудование.Получить() Тогда
		ОбязательныеРеквизиты.Добавить("КассаККМ");
	КонецЕсли;
	
	//Если Объект.ХозОперация=Справочники.ХозОперации.ВнесениеВКассуККМ Тогда
	//	ОбязательныеРеквизиты.Добавить("Инкассатор");
	//	ОбязательныеРеквизиты.Добавить("ДоговорВзаиморасчетовИнкассатор");
	//КонецЕсли;
	//
	//Если Объект.ХозОперация=Справочники.ХозОперации.ИзъятиеИзКассыККМ Тогда
	//	ОбязательныеРеквизиты.Добавить("ПлатежнаяСистема");
	//	ОбязательныеРеквизиты.Добавить("ДоговорВзаиморасчетовПлатежнаяСистема");
	//КонецЕсли;
	
	Если НЕ ПравоПользователя("ПроведениеНезаполненныхДокументов", Объект) Тогда
		ОбязательныеРеквизиты.Добавить("Оплаты");
	КонецЕсли;
	
	//Для Каждого Строка Из Объект.Оплаты Цикл
	//	Если Строка.ТипОплаты.ВидОплаты = Перечисления.ВидыОплат.Наличные И Строка.Сумма > 0 Тогда
	//		ОбязательныеРеквизиты.Добавить("Оплаты.ПлатежнаяСистема");
	//		ОбязательныеРеквизиты.Добавить("Оплаты.ДоговорВзаиморасчетовПлатежнаяСистема");
	//	ИначеЕсли Строка.ТипОплаты.ВидОплаты = Перечисления.ВидыОплат.Безналичные И Строка.Сумма > 0  ИЛИ Строка.СуммаВозврат > 0 Тогда
	//		ОбязательныеРеквизиты.Добавить("Оплаты.ПлатежнаяСистема");
	//		ОбязательныеРеквизиты.Добавить("Оплаты.ДоговорВзаиморасчетовПлатежнаяСистема");
	//	КонецЕсли;
	//КонецЦикла;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Уникальные поля таблицы товаров
	УникальныеТабличныеЧасти=Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеТабличныеЧасти;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();
	КонтролируемыеРеквизиты.Вставить("КассаККМ",                              ЛОЖЬ);
	КонтролируемыеРеквизиты.Вставить("ДоговорВзаиморасчетовИнкассатор",       КонтрольПоПодразделению);
	КонтролируемыеРеквизиты.Вставить("ДоговорВзаиморасчетовПлатежнаяСистема", КонтрольПоПодразделению);
	
	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()

// Возвращает предопределенную структуру действий
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", Объект.Оплаты.Количество() > 0);
	
	Возврат ПараметрыДействия;
	
КонецФункции

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия,"ТребуетсяПересчетЦен", Ложь) Тогда
		
		ПараметрыДействия.ТребуетсяПересчетЦен = Ложь;
		СтарыйКурс = ПараметрыДействия.СтарыйКурс;
		НовыйКурс  = Объект.КурсДокумента;
		
		Если (СтарыйКурс*НовыйКурс)=0 Тогда
			ТекстСообщения = НСтр("ru = 'При пересчете валюты обнаружен нулевой курс валюты.'");
			ВывестиСообщение(ТекстСообщения,Объект,"КассаККМ");
			Возврат;
		КонецЕсли;
		
		Если СтарыйКурс=НовыйКурс Тогда
			Возврат;
		КонецЕсли;
		
		КоэффициентСоотношенияКурсов = СтарыйКурс/НовыйКурс;
		Для Каждого Строка Из Объект.Оплаты Цикл
			Строка.Сумма        = Окр(Строка.Сумма*КоэффициентСоотношенияКурсов, 2);
			Строка.СуммаВозврат = Окр(Строка.СуммаВозврат*КоэффициентСоотношенияКурсов, 2);
		КонецЦикла;
	КонецЕсли;
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
	ТипЦен = Неопределено;
	ПараметрыДействия.Свойство("ТипЦен", ТипЦен);
	
	ХозОперация = Объект.ХозОперация;
	ВидДоговора = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ВидДоговора", Неопределено);
	Если ВидДоговора = Неопределено Тогда
		ВидДоговора = Справочники.ХозОперации.ПолучитьВидДоговора(ХозОперация);
	КонецЕсли;
	
	Если ТипЦен = Неопределено Тогда
		ПараметрыДействия.Вставить("ТипЦен", ?(ЕстьРеквизит(Объект, "ТипЦен"), Объект.ТипЦен, Справочники.ТипыЦен.ПустаяСсылка()));
	КонецЕсли;
	
	Если НЕ (ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетовИнкассатор) И Объект.ДоговорВзаиморасчетовИнкассатор.Владелец=Объект.Инкассатор И Справочники.ХозОперации.ДоговорСоответствуетХозОперации(Объект.ХозОперация,  Объект.ДоговорВзаиморасчетовИнкассатор) И Объект.ДоговорВзаиморасчетовИнкассатор.ПодразделениеКомпании = Объект.ПодразделениеКомпании) Тогда
		Если ЗначениеЗаполнено(Объект.Инкассатор) Тогда
			Объект.ДоговорВзаиморасчетовИнкассатор = ОбработкаРеквизитовДокументаСервер.ПолучитьДоговорВзаиморасчетов(Объект.Инкассатор, ВидДоговора, Объект, ПараметрыДействия);
			ДоговорВзаиморасчетовИнкассаторПриИзменении(Объект, ПараметрыДействия);
			ДоговорВзаиморасчетовПлатежнаяСистемаПриИзменении(Объект, ПараметрыДействия);
		Иначе
			// если контрагент не указан, то очистим договор
			Объект.ДоговорВзаиморасчетовИнкассатор = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
			ДоговорВзаиморасчетовИнкассаторПриИзменении(Объект, ПараметрыДействия);
			ДоговорВзаиморасчетовПлатежнаяСистемаПриИзменении(Объект, ПараметрыДействия);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ (ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетовПлатежнаяСистема) И Объект.ДоговорВзаиморасчетовПлатежнаяСистема.Владелец=Объект.ПлатежнаяСистема И Справочники.ХозОперации.ДоговорСоответствуетХозОперации(Объект.ХозОперация,  Объект.ДоговорВзаиморасчетовПлатежнаяСистема) И Объект.ДоговорВзаиморасчетовПлатежнаяСистема.ПодразделениеКомпании = Объект.ПодразделениеКомпании) Тогда
		Если ЗначениеЗаполнено(Объект.ПлатежнаяСистема) Тогда
			Объект.ДоговорВзаиморасчетовПлатежнаяСистема = ОбработкаРеквизитовДокументаСервер.ПолучитьДоговорВзаиморасчетов(Объект.ПлатежнаяСистема, ВидДоговора, Объект, ПараметрыДействия);
			ДоговорВзаиморасчетовИнкассаторПриИзменении(Объект, ПараметрыДействия);
			ДоговорВзаиморасчетовПлатежнаяСистемаПриИзменении(Объект, ПараметрыДействия);
		Иначе
			// если контрагент не указан, то очистим договор
			Объект.ДоговорВзаиморасчетовПлатежнаяСистема = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
			ДоговорВзаиморасчетовИнкассаторПриИзменении(Объект, ПараметрыДействия);
			ДоговорВзаиморасчетовПлатежнаяСистемаПриИзменении(Объект, ПараметрыДействия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Проект".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПроектПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПроектПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПроектПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если Объект.ХозОперация = Справочники.ХозОперации.ВнесениеВКассуККМ Тогда
		Если ЗначениеЗаполнено(Объект.ПлатежнаяСистема) Тогда
			Объект.ПлатежнаяСистема = Справочники.Контрагенты.ПустаяСсылка();
			ПлатежнаяСистемаПриИзменении(Объект, ПараметрыДействия);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетовПлатежнаяСистема) Тогда
			Объект.ДоговорВзаиморасчетовПлатежнаяСистема = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
			ДоговорВзаиморасчетовПлатежнаяСистемаПриИзменении(Объект, ПараметрыДействия);
		КонецЕсли;
	КонецЕсли;
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Тип цен".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТипЦенПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ТипЦенПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ТипЦенПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Валюта".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВалютаДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ВалютаДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ВалютаДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Курс документа".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КурсДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.КурсДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // КурсДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Инкассатор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ИнкассаторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если ЗначениеЗаполнено(Объект.Инкассатор) Тогда
		// Если договор уже выбран, тогда ничего не делаем
		Если ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетовИнкассатор)
			И Объект.ДоговорВзаиморасчетовИнкассатор.Владелец = Объект.Инкассатор
			И Справочники.ХозОперации.ДоговорСоответствуетХозОперации(Объект.ХозОперация, Объект.ДоговорВзаиморасчетовИнкассатор) Тогда
			Возврат;
		КонецЕсли;
		
		// получим договор
		Объект.ДоговорВзаиморасчетовИнкассатор = ОбработкаРеквизитовДокументаСервер.ПолучитьДоговорВзаиморасчетов(Объект.Инкассатор, Перечисления.ВидыДоговоров.Прочее, Объект, ПараметрыДействия);
	Иначе
		Объект.ДоговорВзаиморасчетовИнкассатор = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	КонецЕсли;
	
	ДоговорВзаиморасчетовИнкассаторПриИзменении(Объект, ПараметрыДействия);

КонецПроцедуры // ИнкассаторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Договор взаиморасчетов (инкассатор)".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДоговорВзаиморасчетовИнкассаторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетовИнкассатор) Тогда
		
		// Проверим договор на соответствие хоз. операции документа
		Если НЕ Справочники.ХозОперации.ДоговорСоответствуетХозОперации(Объект.ХозОперация, Объект.ДоговорВзаиморасчетовИнкассатор) Тогда
			Объект.ДоговорВзаиморасчетовИнкассатор = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
			Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ОтображатьПредупреждение", Истина) Тогда
				ТекстСообщения = НСтр("ru = 'Вид договора инкассатора не соответствует Хоз.операции.'");
				ВывестиСообщение(ТекстСообщения,Объект.Ссылка,"ДоговорВзаиморасчетовИнкассатор");
			КонецЕсли;
			ДоговорВзаиморасчетовИнкассаторПриИзменении(Объект, ПараметрыДействия);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДоговорВзаиморасчетовИнкассаторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Платежная система".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПлатежнаяСистемаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если ЗначениеЗаполнено(Объект.ПлатежнаяСистема) Тогда
		Если ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетовПлатежнаяСистема)
			И Объект.ДоговорВзаиморасчетовПлатежнаяСистема.Владелец = Объект.ПлатежнаяСистема
			И Справочники.ХозОперации.ДоговорСоответствуетХозОперации(Объект.ХозОперация, Объект.ДоговорВзаиморасчетовПлатежнаяСистема) Тогда
			Возврат;
		КонецЕсли;
		
		// получим договор
		Объект.ДоговорВзаиморасчетовПлатежнаяСистема = ОбработкаРеквизитовДокументаСервер.ПолучитьДоговорВзаиморасчетов(Объект.ПлатежнаяСистема, Перечисления.ВидыДоговоров.Прочее, Объект, ПараметрыДействия);
	Иначе
		//	// если контрагент не указан то очистим договор
		Объект.ДоговорВзаиморасчетовПлатежнаяСистема=Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	КонецЕсли;
	
	ДоговорВзаиморасчетовПлатежнаяСистемаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПлатежнаяСистемаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Договор взаиморасчетов (Платежная система)".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДоговорВзаиморасчетовПлатежнаяСистемаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетовПлатежнаяСистема) Тогда
		
		// Проверим договор на соответствие хоз. операции документа
		Если НЕ Справочники.ХозОперации.ДоговорСоответствуетХозОперации(Объект.ХозОперация, Объект.ДоговорВзаиморасчетовПлатежнаяСистема) Тогда
			Объект.ДоговорВзаиморасчетовПлатежнаяСистема = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
			ДоговорВзаиморасчетовПлатежнаяСистемаПриИзменении(Объект, ПараметрыДействия);
			Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ОтображатьПредупреждение", Истина) Тогда
				ТекстСообщения = НСтр("ru = 'Вид договора платежной системы не соответствует Хоз.операции.'");
				ВывестиСообщение(ТекстСообщения,Объект.Ссылка,"ДоговорВзаиморасчетовИнкассатор");
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДоговорВзаиморасчетовПлатежнаяСистемаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "КассаККМ".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КассаККМПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если НЕ ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		Возврат;
	КонецЕсли;
	
	// Установим валюту документа
	Если НЕ Объект.КассаККМ.ВалютаДенежныхСредств = Объект.ВалютаДокумента Тогда
		
		// Определим курс валюты денежных средств
		ПараметрыДействия.Вставить("ТребуетсяПересчетЦен", ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ОбъектЗаполнен", ИСТИНА));
		ПараметрыДействия.Вставить("СтарыйКурс", Объект.КурсДокумента);
		
		Объект.ВалютаДокумента = Объект.КассаККМ.ВалютаДенежныхСредств;
		ВалютаДокументаПриИзменении(Объект, ПараметрыДействия);
	КонецЕсли;
	
	// Проверим договоры на соответствие
	ПараметрыДействия.Вставить("ОтображатьПредупреждение", Ложь);
	ДоговорВзаиморасчетовИнкассаторПриИзменении(Объект, ПараметрыДействия);
	ДоговорВзаиморасчетовПлатежнаяСистемаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры //КассаККМПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ОПЛАТЫ"

// Обработчик события возникающего при изменении данных реквизита "Тип оплаты" в таблице "Оплаты".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ОплатыТипОплатыПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.ХозОперация = Справочники.ХозОперации.ВнесениеВКассуККМ И Строка.ТипОплаты.ВидОплаты <> Перечисления.ВидыОплат.Наличные Тогда
		ТекстСообщения = НСтр("ru = 'В кассу ККМ можно вносить только наличные средства.'");
		ВывестиСообщение(ТекстСообщения,Объект.Ссылка);
		Строка.ТипОплаты = Справочники.ТипыОплат.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзменении(


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.Инкассация",
		"ПФ_MXL_КМ6",
		НСтр("ru = 'КМ6'"),
		СсылкаНаДокумент);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_КМ6") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_КМ6",
															"КМ6",
															ПечатьКМ6(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;	
КонецПроцедуры // Печать()

// Формирует печатную форму "КМ6"
//
Функция ПечатьКМ6(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Инкассация_КМ6";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;

	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ФорматВыводаСуммы = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Инкассация.ПФ_MXL_КМ6");
		
		ОбластьЗаголовок       = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока          = Макет.ПолучитьОбласть("Строка");
		ОбластьПодвал          = Макет.ПолучитьОбласть("Подвал");
		ОбластьОборот          = Макет.ПолучитьОбласть("Оборот");

		// вывод заголовка документа
		ОбластьЗаголовок.Параметры.Заполнить(Документ);
		
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		ОбластьЗаголовок.Параметры.Организация = Документ.Организация;
		ОбластьЗаголовок.Параметры.ОрганизацияПредставление = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,Новый Структура("Наименование,АдресЮридический,ТелефонРабочий"),,,Документ.Дата,ДополнительныеПараметры);
		ОбластьЗаголовок.Параметры.ОКПО = Документ.Организация.КодПоОКПО;
		ОбластьЗаголовок.Параметры.ИНН = Документ.Организация.ИНН;
		ОбластьЗаголовок.Параметры.ОКДП = Документ.Организация.КодПоОКДП;
		ОбластьЗаголовок.Параметры.КассаККМ = Документ.КассаККМ.Наименование;
		ОбластьЗаголовок.Параметры.ИдентификаторПрограммы = Метаданные.Синоним;
		ОбластьЗаголовок.Параметры.ДокументНомер = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(Документ);
		ОбластьЗаголовок.Параметры.ДокументДата = Формат(Документ.Дата, "ДЛФ=D");
		ОбластьЗаголовок.Параметры.ВалютаНаименование = Документ.ВалютаДокумента.Наименование;
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		// Выводим строку
		СуммаНаличных = 0;
		Для Каждого СтрокаОплат Из Документ.Оплаты Цикл
			Если СтрокаОплат.ТипОплаты.ВидОплаты = Перечисления.ВидыОплат.Наличные Тогда
				СуммаНаличных = СуммаНаличных + СтрокаОплат.Сумма;
			КонецЕсли;
		КонецЦикла;
		ОбластьСтрока.Параметры.Сумма = Формат(СуммаНаличных,ФорматВыводаСуммы);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
		// Выводим подвал
		ОбластьПодвал.Параметры.Сумма = Формат(СуммаНаличных,ФорматВыводаСуммы);
		ОбластьПодвал.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаНаличных,Документ.ВалютаДокумента);
		
		УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент,ОбластьПодвал,,,,,Документ);
		
		ОбластьОборот.Параметры.Заполнить(УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"Руководитель","Руководитель"));
		ОбластьОборот.Параметры.Заполнить(УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"Кассир","Кассир"));
		ОбластьОборот.Параметры.Заполнить(УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"КассирОперационист","КассирОперационист"));
		
		ТабличныйДокумент.Вывести(ОбластьОборот);
		
		// отметим конец области документа
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции // ПечатьКМ6()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "КассаККМ", "Справочник.КассыККМ.ФормаСписка",,, ИСТИНА, НСтр("ru = 'Необходимо выбрать кассу ККМ.'"));
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ОплатыЗаполнитьОстаткамиПоКассеККМ",, "Оплаты", НСтр("ru = 'Заполнить остатками по кассе ККМ'"), ПараметрыКоманды,,,,Истина);
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	ПараметрыКоманд.Вставить("ОплатыЗаполнитьОстаткамиПоКассеККМ.Видимость", Истина);
	Если Объект.ХозОперация=Справочники.ХозОперации.ВнесениеВКассуККМ Тогда
		ПараметрыКоманд.Вставить("ОплатыЗаполнитьОстаткамиПоКассеККМ.Доступность", Ложь);
	ИначеЕсли Объект.ХозОперация=Справочники.ХозОперации.ИзъятиеИзКассыККМ Тогда
		ПараметрыКоманд.Вставить("ОплатыЗаполнитьОстаткамиПоКассеККМ.Доступность", Истина);
	КонецЕсли;
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()

// Обработчик заполнения документа остатками по кассе ККМ
//
Функция ОплатыЗаполнитьОстаткамиПоКассеККМ(Объект, ПараметрыЗаполнения, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Произведем корректировку значений реквизитов объекта в соответствии с параметрами заполнения.
	Если НЕ Объект.КассаККМ = ПараметрыЗаполнения.КассаККМ Тогда
		Объект.КассаККМ = ПараметрыЗаполнения.КассаККМ;
		КассаККМПриИзменении(Объект, ПараметрыДействия);
	КонецЕсли;
	
	ТаблицаОстатковКассы = ПолучитьОстатокПоКассеККМ(Объект.КассаККМ, ?(НЕ ЗначениеЗаполнено(Объект.Ссылка),Новый МоментВремени(ТекущаяДатаСеанса()),Новый МоментВремени(Объект.Дата)));
	Объект.Оплаты.Загрузить(ТаблицаОстатковКассы);
	
КонецФункции // ОплатыЗаполнитьОстаткамиПоКассеККМ()

#КонецЕсли