
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.УсловиеАссортимента.СписокВыбора.Очистить();
	
	СписокСимволов1=Новый СписокЗначений;
	СписокСимволов1.Добавить("A");
	СписокСимволов1.Добавить("B");
	СписокСимволов1.Добавить("C");
	
	Для Каждого Обход1 из СписокСимволов1 Цикл
		Для Каждого Обход2 Из СписокСимволов1 Цикл
			Для Каждого Обход3 Из СписокСимволов1 Цикл
				Элементы.УсловиеАссортимента.СписокВыбора.Добавить(СокрЛП(Обход1.Значение)+СокрЛП(Обход2.Значение)+СокрЛП(Обход3.Значение));
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ЕстьНачалоПериода = Истина;
	ЕстьКонецПериода  = Истина;
	
	КонецПериода = ТекущаяДата();
	ВидПериода   = "Месяц";
	ОтчетыПлатформаКлиентСервер.ОбновитьВариантыПериодов(ЭтотОбъект);
	ВидимостьПериода();
	
	ГруппаА = 75;
	ГруппаБ = 20;
	ГруппаС = 5;
	
	УсловиеАссортимента = "AAA";
	
	ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	СхемаКомпоновкиДанных = ТекущийОбъект.ПолучитьМакет("Схема");
	СхемаКомпоновки = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	НастройкиКД.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));
	НастройкиКД.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовУправленияФормы

&НаКлиенте
Процедура УсловиеАссортиментаПриИзменении(Элемент)
	
	УсловиеАссортимента   = СтароеЗначениеУсловия + УсловиеАссортимента;
	СтароеЗначениеУсловия = УсловиеАссортимента+"-";
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаАПриИзменении(Элемент)
	
	ГруппаА = Мин(100, ГруппаА);
	ГруппаБ = Мин(ГруппаБ, 100-ГруппаА);
	ГруппаС = 100 - ГруппаА - ГруппаБ;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаБПриИзменении(Элемент)
	
	ГруппаБ = Мин(100, ГруппаБ);
	ГруппаА = Мин(ГруппаА, 100-ГруппаБ);
	ГруппаС = 100 - ГруппаА - ГруппаБ;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Обработчик события возникающего на клиенте при выполнении команды "Сформировать".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(ПодразделениеКомпании) Тогда
		ПоказатьПредупреждение(, "Обязательно укажите подразделение");
		Возврат;
	КонецЕсли;
	
	Если ТаблицаПродаж.Количество()>0 Тогда
		ОбработчикОповещения = Новый ОписаниеОповещения("ЗаполнениеТаблицыПродажВопрос", ЭтотОбъект);
		ПоказатьВопрос(ОбработчикОповещения, НСтр("ru = 'Внимание. Таблица продаж будет перезаполнена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнениеТаблицыПродаж();
	КонецЕсли;
	
КонецПроцедуры //Сформировать()

// Обработчик события возникающего на клиенте при выполнении команды "Период произвольный".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПериодПроизвольный(Команда)
	
	ВидПериода = "Произвольный";
	
	ОтчетыПлатформаКлиентСервер.УстановитьПометкуНаПериод(ЭтотОбъект, Команда.Имя);
	
	ОтчетыПлатформаКлиентСервер.ОбновитьВариантыПериодов(ЭтотОбъект);
	
	ВидимостьПериода();
	
КонецПроцедуры //ПериодПроизвольный()

// Обработчик события возникающего на клиенте при выполнении команды "Период день".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПериодДень(Команда)
	
	ВидПериода    = "День";
	
	ОтчетыПлатформаКлиентСервер.ОбновитьВариантыПериодов(ЭтотОбъект);
	
	ОтчетыПлатформаКлиентСервер.УстановитьПометкуНаПериод(ЭтотОбъект, Команда.Имя);
	
	ВидимостьПериода();
	
КонецПроцедуры //ПериодДень()

// Обработчик события возникающего на клиенте при выполнении команды "Период неделя".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПериодНеделя(Команда)
	
	ВидПериода    = "Неделя";
	
	ОтчетыПлатформаКлиентСервер.ОбновитьВариантыПериодов(ЭтотОбъект);
	
	ОтчетыПлатформаКлиентСервер.УстановитьПометкуНаПериод(ЭтотОбъект, Команда.Имя);
	
	ВидимостьПериода();
	
КонецПроцедуры //ПериодНеделя()

// Обработчик события возникающего на клиенте при выполнении команды "Период месяц".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПериодМесяц(Команда)
	
	ВидПериода    = "Месяц";
	
	ОтчетыПлатформаКлиентСервер.ОбновитьВариантыПериодов(ЭтотОбъект);
	
	ОтчетыПлатформаКлиентСервер.УстановитьПометкуНаПериод(ЭтотОбъект, Команда.Имя);
	
	ВидимостьПериода();
	
КонецПроцедуры //ПериодМесяц()

// Обработчик события возникающего на клиенте при выполнении команды "Период квартал".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПериодКвартал(Команда)
	
	ВидПериода    = "Квартал";
	
	ОтчетыПлатформаКлиентСервер.ОбновитьВариантыПериодов(ЭтотОбъект);
	
	ОтчетыПлатформаКлиентСервер.УстановитьПометкуНаПериод(ЭтотОбъект, Команда.Имя);
	
	ВидимостьПериода();
	
КонецПроцедуры //ПериодКвартал()

// Обработчик события возникающего на клиенте при выполнении команды "Период год".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПериодГод(Команда)
	
	ВидПериода    = "Год";
	
	ОтчетыПлатформаКлиентСервер.ОбновитьВариантыПериодов(ЭтотОбъект);
	
	ОтчетыПлатформаКлиентСервер.УстановитьПометкуНаПериод(ЭтотОбъект, Команда.Имя);
	
	ВидимостьПериода();
	
КонецПроцедуры //ПериодГод()

// Обработчик события возникающего на клиенте при выполнении команды "Период назад".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПериодНазад(Команда)
	
	Направление = -1;
	ОтчетыПлатформаКлиентСервер.СместитьПериод(ЭтотОбъект, Направление);
	
КонецПроцедуры //ПериодНазад()

// Обработчик события возникающего на клиенте при выполнении команды "Период вперед".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПериодВперед(Команда)
	
	Направление = +1;
	ОтчетыПлатформаКлиентСервер.СместитьПериод(ЭтотОбъект, Направление);
	
КонецПроцедуры //ПериодВперед()

// Обработчик события возникающего на клиенте при выполнении команды "Продажи снять пометки".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПродажиСнятьПометки(Команда)
	
	УстановитьПометки(ТаблицаПродаж, Ложь);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при выполнении команды "Продажи установить пометки".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПродажиУстановитьПометки(Команда)
	
	УстановитьПометки(ТаблицаПродаж, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиПоПравиламГруппыА(Команда)
	
	Для Каждого СтрокаТЧ Из ТаблицаПродаж Цикл
		ТекущийСтатусТовара = ""+СокрЛП(СтрокаТЧ.РангПоКоличеству)+СокрЛП(СтрокаТЧ.РангПоСумме)+СокрЛП(СтрокаТЧ.РангПоНаценке);
		Если Найти(УсловиеАссортимента, ТекущийСтатусТовара)>0 Тогда
			СтрокаТЧ.Актуальность = Истина;
		Иначе
			СтрокаТЧ.Актуальность = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВвод(Команда)
	
	Если ТаблицаПродаж.Количество()<=0 тогда
		ВывестиСообщение(НСтр("ru='Таблица товаров пуста! Возможно не проведен предварительный анализ!
		|Документы сформированы не будут!'"));
		Возврат;
	КонецЕсли;
	
	ИмяКоманды = "";
	СформироватьДокумент("СформироватьВвод", ИмяКоманды);
	ФормаДокумента = ПолучитьФорму("Документ.ИзменениеАссортиментаПодразделения.ФормаОбъекта");
	КопироватьДанныеФормы(ИзменениеАссортимента, ФормаДокумента.Объект);
	ФормаДокумента.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьВывод(Команда)
	
	Если ТаблицаПродаж.Количество()<=0 тогда
		ВывестиСообщение(НСтр("ru='Таблица товаров пуста! Возможно не проведен предварительный анализ!
		|Документы сформированы не будут!'"));
		Возврат;
	КонецЕсли;
	
	ИмяКоманды = "";
	СформироватьДокумент("СформироватьВывод", ИмяКоманды);
	ФормаДокумента = ПолучитьФорму("Документ.ИзменениеАссортиментаПодразделения.ФормаОбъекта");
	КопироватьДанныеФормы(ИзменениеАссортимента, ФормаДокумента.Объект);
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(ФормаДокумента.Объект, ФормаДокумента.Элементы, ИмяКоманды);
	ФормаДокумента.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПредставлениеГруппыАВС(ЗначениеГруппы)
	
	Результат = "C";
	Если ЗначениеГруппы = "1" Тогда
		Результат = "A";
	ИначеЕсли ЗначениеГруппы = "2" Тогда
		Результат = "B";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Обработчик заполнения таблицы продаж на стороне сервера
//
&НаСервере
Процедура ЗаполнениеТаблицыПродажНаСервере()
	
	ТаблицаПродаж.Очистить();
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(СхемаКомпоновки);
	
	НастройкиКД.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", НачалоДня(НачалоПериода));
	НастройкиКД.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", КонецДня(КонецПериода));
	НастройкиКД.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПодразделениеКомпании", ПодразделениеКомпании);
	НастройкиКД.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПараметрыАВС", Строка(ГруппаА) + "," +  Строка(ГруппаА+ГруппаБ));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКД.Настройки, ,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ТаблицаРезультат = РеквизитФормыВЗначение("ТаблицаПродаж");
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	ПроцессорВывода.ЗакончитьВывод();
	
	ТаблицаРезультат.Сортировать("РангПоКоличеству, РангПоСумме, РангПоНаценке");
	
	ЗначениеВРеквизитФормы(ТаблицаРезультат, "ТаблицаПродаж");
	
	Для Каждого СтрокаТЧ Из ТаблицаПродаж Цикл
		
		СтрокаТЧ.РангПоКоличеству = ПолучитьПредставлениеГруппыАВС(СтрокаТЧ.РангПоКоличеству);
		СтрокаТЧ.РангПоСумме      = ПолучитьПредставлениеГруппыАВС(СтрокаТЧ.РангПоСумме);
		СтрокаТЧ.РангПоНаценке    = ПолучитьПредставлениеГруппыАВС(СтрокаТЧ.РангПоНаценке);
		
		ТекущийСтатусТовара = ""+СокрЛП(СтрокаТЧ.РангПоКоличеству)+СокрЛП(СтрокаТЧ.РангПоСумме)+СокрЛП(СтрокаТЧ.РангПоНаценке);
		Если Найти(УсловиеАссортимента, ТекущийСтатусТовара)>0 Тогда
			СтрокаТЧ.Актуальность = Истина;
		Иначе
			СтрокаТЧ.Актуальность = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПродажи;
	
КонецПроцедуры

// Обработчик заполнения таблицы продаж
//
&НаКлиенте
Процедура ЗаполнениеТаблицыПродаж()
	
	ЗаполнениеТаблицыПродажНаСервере();
	
КонецПроцедуры

// Обработчик заполнения таблицы продаж
//
&НаКлиенте
Процедура ЗаполнениеТаблицыПродажВопрос(Результат, ДополнительныеДействия) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнениеТаблицыПродаж();
	
КонецПроцедуры

// Общая процедура, устанавливает/снимает флажок использования в таблице.
//
&НаКлиенте
Процедура УстановитьПометки(ТаблицаЭлементов, Флаг)
	
	Для Каждого ЭлементТаблицы Из ТаблицаЭлементов Цикл
		
		ЭлементТаблицы.Актуальность = Флаг;
		
	КонецЦикла;
	
КонецПроцедуры //УстановитьПометки()

// Настраивает заголовок подменю периода, формат отображения периода и видимость полей периода.
//
&НаСервере
Процедура ВидимостьПериода()
	
	ОтчетыПлатформаСервер.ВидимостьПериода(ЭтотОбъект);
	
КонецПроцедуры //ВидимостьПериода()

&НаСервере
Процедура ЗаполнитьДокумент(НовыйДокумент, ИмяОперациия)
	
	НовыйДокумент.ПодразделениеКомпании = ПодразделениеКомпании;
	НовыйДокумент.Организация           = ПодразделениеКомпании.Организация;
	НовыйДокумент.Дата                  = ТекущаяДата();
	НовыйДокумент.ДатаВводаВАссортимент = ТекущаяДата();
	
	Если ИмяОперациия = "СформироватьВвод" Тогда
		НовыйДокумент.ХозОперация = Справочники.ХозОперации.ВводТоваровВАссортимент
	ИначеЕсли ИмяОперациия = "СформироватьВывод" Тогда
		НовыйДокумент.ХозОперация = Справочники.ХозОперации.ВыводТоваровИзБазовогоАссортимента;
	КонецЕсли;
	//НовыйДокумент.УстановитьНовыйНомер();
	
	ВсегоСтрок = ТаблицаПродаж.Количество();
	//Сч = 0;
	//НовыйДокумент. = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
	//Если обЗначениеНеЗаполнено(ТипЦенПродажи) Тогда
	//	ТипЦенПродажи = обПраво("ОсновнойТипЦенПродажи");
	//КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ТаблицаПродаж Цикл
		
		Если НЕ СтрокаТЧ.Актуальность Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = НовыйДокумент.Товары.Добавить();
		НоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура;
		Документы.ИзменениеАссортиментаПодразделения.ТоварыНоменклатураПриИзменении(НовыйДокумент, НоваяСтрока);
		
		НоваяСтрока.БазовыйАссортимент = СтрокаТЧ.БазовыйАссортимент;
		НоваяСтрока.ВидАссортимента    = СтрокаТЧ.ВидАссортимента;
		
		//НоваяСтрока.ЦенаРозничная = обПолучитьЦену(ТипЦенПродажи, СтрокаТЧ.Номенклатура,,,,);
		//Документы.ИзменениеАссортиментаПодразделения.ТоварыЦенаРозничнаяПриИзменении(НовыйДокумент, НоваяСтрока);
		//Док.ОбработкаРеквизита("Товары.ЦенаРозничная",НоваяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокумент(ИмяОперациия, ИмяКоманды)
	
	НовыйДокумент = Документы.ИзменениеАссортиментаПодразделения.СоздатьДокумент();
	НовыйДокумент.ПодразделениеКомпании = ПодразделениеКомпании;
	НовыйДокумент.Организация           = ПодразделениеКомпании.Организация;
	НовыйДокумент.Заполнить(Неопределено);
	НовыйДокумент.Дата                  = ТекущаяДата();
	НовыйДокумент.ДатаВводаВАссортимент = ТекущаяДата();
	
	Если ИмяОперациия = "СформироватьВвод" Тогда
		НовыйДокумент.ХозОперация = Справочники.ХозОперации.ВводТоваровВАссортимент;
		ИмяКоманды = "ХозОперация" + Строка(Справочники.ХозОперации.ВводТоваровВАссортимент.ИмяПредопределенныхДанных);
	ИначеЕсли ИмяОперациия = "СформироватьВывод" Тогда
		НовыйДокумент.ХозОперация = Справочники.ХозОперации.ВыводТоваровИзАссортимента;
		ИмяКоманды = "ХозОперация" + Строка(Справочники.ХозОперации.ВыводТоваровИзАссортимента.ИмяПредопределенныхДанных);
	КонецЕсли;
	НовыйДокумент.УстановитьНовыйНомер();
	
	ВсегоСтрок = ТаблицаПродаж.Количество();
	//Сч = 0;
	//НовыйДокумент. = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
	//Если обЗначениеНеЗаполнено(ТипЦенПродажи) Тогда
	//	ТипЦенПродажи = обПраво("ОсновнойТипЦенПродажи");
	//КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ТаблицаПродаж Цикл
		
		Если НЕ СтрокаТЧ.Актуальность Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = НовыйДокумент.Товары.Добавить();
		НоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура;
		Документы.ИзменениеАссортиментаПодразделения.ТоварыНоменклатураПриИзменении(НовыйДокумент, НоваяСтрока);
		
		НоваяСтрока.БазовыйАссортимент = СтрокаТЧ.БазовыйАссортимент;
		НоваяСтрока.ВидАссортимента    = СтрокаТЧ.ВидАссортимента;
		
		//НоваяСтрока.ЦенаРозничная = обПолучитьЦену(ТипЦенПродажи, СтрокаТЧ.Номенклатура,,,,);
		//Документы.ИзменениеАссортиментаПодразделения.ТоварыЦенаРозничнаяПриИзменении(НовыйДокумент, НоваяСтрока);
		//Док.ОбработкаРеквизита("Товары.ЦенаРозничная",НоваяСтрока);
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(НовыйДокумент, "ИзменениеАссортимента");
	
КонецПроцедуры

#КонецОбласти

