#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область IkarService

Функция ЗапросНаПолучениеСтран(ХозяйствующийСубъект, Смещение = Неопределено, Шаг = Неопределено) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьIkarService(ХозяйствующийСубъект);
	
	listOptions = ПолучитьListOptions(Прокси.ФабрикаXDTO, Смещение, Шаг);
	
	Попытка
		ОбъектXDTO = Прокси.GetAllCountryList(listOptions);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеСтраны(ХозяйствующийСубъект, GUIDСтраны) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьIkarService(ХозяйствующийСубъект);
	
	Попытка
		
		ОбъектXDTO = Прокси.GetCountryByGuid(GUIDСтраны);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеСтраныПоUuid(ХозяйствующийСубъект, UUIDСтраны) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьIkarService(ХозяйствующийСубъект);
	
	Попытка
		
		ОбъектXDTO = Прокси.GetCountryByUuid(UUIDСтраны);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеРегиона(ХозяйствующийСубъект, GUIDРегиона) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьIkarService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetRegionByGuid(GUIDРегиона);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеРегионаПоUuid(ХозяйствующийСубъект, UUIDРегиона) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьIkarService(ХозяйствующийСубъект);
	Попытка
		ОбъектXDTO = Прокси.GetRegionByUuid(UUIDРегиона);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеЗаболевания(ХозяйствующийСубъект, GUIDЗаболевания) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьIkarService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetDiseaseByGuid(GUIDЗаболевания);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеЗаболеванияПоUuid(ХозяйствующийСубъект, UUIDЗаболевания) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьIkarService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetDiseaseByUuid(UUIDЗаболевания);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеРегионов(ХозяйствующийСубъект, КодСтраны, Смещение = Неопределено, Шаг = Неопределено) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьIkarService(ХозяйствующийСубъект);
	
	listOptions = ПолучитьListOptions(Прокси.ФабрикаXDTO, Смещение, Шаг);
	
	ОбъектXDTO = Прокси.GetRegionListByCountry(listOptions, КодСтраны);
	Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ProductService

Функция ЗапросНаПолучениеПродукции(ХозяйствующийСубъект, GUIDПродукции) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьProductService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetProductByGuid(GUIDПродукции);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеПродукцииПоUuid(ХозяйствующийСубъект, UuidПродукции) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьProductService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetProductByUuid(UuidПродукции);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеВидаПродукции(ХозяйствующийСубъект, GUIDВидаПродукции) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьProductService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetSubProductByGuid(GUIDВидаПродукции);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеВидаПродукцииПоUuid(ХозяйствующийСубъект, UUIDВидаПродукции) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьProductService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetSubProductByUuid(UUIDВидаПродукции);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеНаименованияПродукции(ХозяйствующийСубъект, GUIDНаименованийПродукции) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьProductService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetProductItemByGuid(GUIDНаименованийПродукции);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеНаименованияПродукцииПоUuid(ХозяйствующийСубъект, UUIDНаименованийПродукции) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьProductService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetProductItemByUuid(UUIDНаименованийПродукции);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеСпискаПродукцииПоТипу(ХозяйствующийСубъект, GUIDТипаПродукции, Смещение = Неопределено, Шаг = Неопределено) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьProductService(ХозяйствующийСубъект);
	
	listOptions = ПолучитьListOptions(Прокси.ФабрикаXDTO, Смещение, Шаг);
	
	ТипProductType = Прокси.ФабрикаXDTO.Тип("http://api.vetrf.ru/schema/cdm/dictionary/v2", "ProductType");
	
	productType = Прокси.ФабрикаXDTO.Создать(ТипProductType, СокрЛП(GUIDТипаПродукции));
	
	Попытка
		ОбъектXDTO = Прокси.GetProductByTypeList(listOptions, productType);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеСпискаВидовПродукцииПоПродукту(ХозяйствующийСубъект, ИдентификаторПродукции, Смещение = Неопределено, Шаг = Неопределено) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьProductService(ХозяйствующийСубъект);
	
	listOptions = ПолучитьListOptions(Прокси.ФабрикаXDTO, Смещение, Шаг);
	
	Попытка
		ОбъектXDTO = Прокси.GetSubProductByProductList(listOptions, ИдентификаторПродукции);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеСпискаНаименованийПродукцииПоВидуПродукции(ХозяйствующийСубъект, ИдентификаторВидаПродукции, ИдентификаторПроизводителя, Смещение = Неопределено, Шаг = Неопределено) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьProductService(ХозяйствующийСубъект);
	
	listOptions = ПолучитьListOptions(Прокси.ФабрикаXDTO, Смещение, Шаг);
	
	Попытка
		ОбъектXDTO = Прокси.GetProductItemList(listOptions, ИдентификаторВидаПродукции, ИдентификаторПроизводителя);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеСпискаНаименованийПродукции(ХозяйствующийСубъект, ИдентификаторТипаПродукции, ИдентификаторВидаПродукции = Неопределено, ИдентификаторПодВидаПродукции = Неопределено, ИдентификаторХозСубъекта = Неопределено, ИдентификаторПредприятия = Неопределено, Смещение = Неопределено, Шаг = Неопределено) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьProductService(ХозяйствующийСубъект);
	
	listOptions = ПолучитьListOptions(Прокси.ФабрикаXDTO, Смещение, Шаг);
	
	//ProductType = Прокси.ФабрикаXDTO.Создать("http://api.vetrf.ru/schema/cdm/dictionary/v2", "ProductType");
	Product = Прокси.ФабрикаXDTO.Создать("http://api.vetrf.ru/schema/cdm/dictionary/v2", "Product");
	Если ЗначениеЗаполнено(ИдентификаторВидаПродукции) Тогда
		Product.guid = ИдентификаторВидаПродукции;
	КонецЕсли;
	
	SubProduct = Прокси.ФабрикаXDTO.Создать("http://api.vetrf.ru/schema/cdm/dictionary/v2", "SubProduct");
	Если ЗначениеЗаполнено(ИдентификаторПодВидаПродукции) Тогда
		SubProduct.guid = ИдентификаторПодВидаПродукции;
	КонецЕсли;

	BusinessEntity = Прокси.ФабрикаXDTO.Создать("http://api.vetrf.ru/schema/cdm/dictionary/v2", "BusinessEntity");
	Если ЗначениеЗаполнено(ИдентификаторХозСубъекта) Тогда
		BusinessEntity.guid = ИдентификаторХозСубъекта;
	КонецЕсли;
	
	Enterprise = Прокси.ФабрикаXDTO.Создать("http://api.vetrf.ru/schema/cdm/dictionary/v2", "Enterprise");
	Если ЗначениеЗаполнено(ИдентификаторПредприятия) Тогда
		Enterprise.guid = ИдентификаторПредприятия;
	КонецЕсли;
	
	BusinessMember = Прокси.ФабрикаXDTO.Создать("http://api.vetrf.ru/schema/cdm/dictionary/v2", "BusinessMember");
	
	Попытка
		ОбъектXDTO = Прокси.GetProductItemList(listOptions, ИдентификаторТипаПродукции, Product, SubProduct, BusinessEntity, Enterprise, BusinessMember, "             ");
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции


#КонецОбласти

#Область DictionaryService

Функция ЗапросНаПолучениеЕдиницИзмерения(ХозяйствующийСубъект, Смещение = Неопределено, Шаг = Неопределено) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьDictionaryService(ХозяйствующийСубъект);
	
	listOptions = ПолучитьListOptions(Прокси.ФабрикаXDTO, Смещение, Шаг);
	
	Попытка
		ОбъектXDTO = Прокси.GetUnitList(listOptions);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеЕдиницыИзмеренияПоGUID(ХозяйствующийСубъект, GUIDЕдиницы) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьDictionaryService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetUnitByGuid(GUIDЕдиницы);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеЕдиницыИзмеренияПоUUID(ХозяйствующийСубъект, UUIDЕдиницы) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьDictionaryService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetUnitByUuid(UUIDЕдиницы);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

//Функция ПолучитьЕдиницуИзмеренияПоGUID(ХозяйствующийСубъект, GUIDЕдиницы) Экспорт
//	
//	Результат = Справочники.МеркурийЕдиницыИзмерения.НайтиПоКоду(GUIDЕдиницы);
//	Если ЗначениеЗаполнено(Результат) Тогда
//		Возврат Результат;
//	КонецЕсли;
//	
//	Результат = ЗапросНаПолучениеЕдиницыИзмеренияПоGUID(ХозяйствующийСубъект, GUIDЕдиницы);
//	ЕдиницаИзмерения = СоздатьЕдиницыИзмерения(ХозяйствующийСубъект, Результат);
//	
//	Возврат ЕдиницаИзмерения;
//	
//КонецФункции

Функция ЗапросНаПолучениеЦелей(ХозяйствующийСубъект, Смещение = Неопределено, Шаг = Неопределено) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьDictionaryService(ХозяйствующийСубъект);
	
	listOptions = ПолучитьListOptions(Прокси.ФабрикаXDTO, Смещение, Шаг);
	
	Попытка
		ОбъектXDTO = Прокси.GetPurposeList(listOptions);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеЦели(ХозяйствующийСубъект, GUIDЦели) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьDictionaryService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetPurposeByGuid(GUIDЦели);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеЦелиПоUuid(ХозяйствующийСубъект, UUIDЦели) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьDictionaryService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetPurposeByUuid(UUIDЦели);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеСпискаБолезней(ХозяйствующийСубъект, Смещение = Неопределено, Шаг = Неопределено) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьDictionaryService(ХозяйствующийСубъект);
	
	listOptions = ПолучитьListOptions(Прокси.ФабрикаXDTO, Смещение, Шаг);
	
	ОбъектXDTO = Прокси.GetDiseaseList(listOptions);
	Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область EnterpriseService

Функция ЗапросНаПолучениеСпискаХС(ХозяйствующийСубъект, СтрИНН, Смещение = Неопределено, Шаг = Неопределено) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьEnterpriseService(ХозяйствующийСубъект);
	
	listOptions = ПолучитьListOptions(Прокси.ФабрикаXDTO, Смещение, Шаг);
	
	businessEntity = Прокси.ФабрикаXDTO.Создать("http://api.vetrf.ru/schema/cdm/dictionary/v2", "BusinessEntity");
	
	businessEntity.inn = СтрИНН;
	
	Попытка
		ОбъектXDTO = Прокси.GetBusinessEntityList(listOptions, businessEntity);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеХСПоGUID(ХозяйствующийСубъект, GUIDХС) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьEnterpriseService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetBusinessEntityByGuid(GUIDХС);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		Возврат Результат;
	Исключение
		ВывестиСообщение("Идентификатор хоз. субъекта:" + Строка(GUIDХС));
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеХСПоUUID(ХозяйствующийСубъект, UUIDХС) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьEnterpriseService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetBusinessEntityByUuid(UUIDХС);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеСпискаПлощадок(ХозяйствующийСубъект, Смещение = Неопределено, Шаг = Неопределено) Экспорт
	
	//Результат = ЗапросНаПолучениеХСПоGUID(ХозяйствующийСубъект, ХозяйствующийСубъект.Код);
	//Если Результат = Неопределено Тогда
	//	Возврат Результат;
	//КонецЕсли;
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьEnterpriseService(ХозяйствующийСубъект);
	
	listOptions = ПолучитьListOptions(Прокси.ФабрикаXDTO, Смещение, Шаг);
	
	businessEntity = Прокси.ФабрикаXDTO.Создать("http://api.vetrf.ru/schema/cdm/dictionary/v2", "BusinessEntity");
	businessEntity.guid = ХозяйствующийСубъект.Код;
	
	Попытка
		ОбъектXDTO = Прокси.GetActivityLocationList(listOptions, businessEntity);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеПредприятия(ТранспортныйМодуль, GUIDПредприятия) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьEnterpriseService(ТранспортныйМодуль);
	
	Попытка
		ОбъектXDTO = Прокси.GetEnterpriseByGuid(GUIDПредприятия);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		Возврат Результат;
	Исключение
		ВывестиСообщение("Идентификатор предприятия:" + Строка(GUIDПредприятия));
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеПредприятияПоUUID(ТранспортныйМодуль, UUIDПредприятия) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьEnterpriseService(ТранспортныйМодуль);
	
	Попытка
		ОбъектXDTO = Прокси.GetEnterpriseByUuid(UUIDПредприятия);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область RegionalizationService

Функция ЗапросНаПолучениеУсловияРегионализацииПоUuid(ХозяйствующийСубъект, UUIDУсловияРегионализации) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьRegionalizationService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetR13nConditionByUuid(UUIDУсловияРегионализации);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеУсловияРегионализации(ХозяйствующийСубъект, GUIDУсловияРегионализации) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьRegionalizationService(ХозяйствующийСубъект);
	
	Попытка
		ОбъектXDTO = Прокси.GetR13nConditionByGuid(GUIDУсловияРегионализации);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ЗапросНаПолучениеУсловийРегионализации(ХозяйствующийСубъект, Смещение = Неопределено, Шаг = Неопределено, КодЗаболевания = Неопределено) Экспорт
	
	Прокси = ИнтеграцияВЕТИСПовтИсп.WSПолучитьRegionalizationService(ХозяйствующийСубъект);
	
	listOptions = ПолучитьListOptions(Прокси.ФабрикаXDTO, Смещение, Шаг);
	
	AnimalDisease = Прокси.ФабрикаXDTO.Создать("http://api.vetrf.ru/schema/cdm/dictionary/v2", "AnimalDisease");
	Если ЗначениеЗаполнено(КодЗаболевания) Тогда
		AnimalDisease.guid = КодЗаболевания;
	КонецЕсли;
	
	Попытка
		ОбъектXDTO = Прокси.GetR13nConditionList(listOptions, AnimalDisease);
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		Возврат Результат;
	Исключение
		ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработкаСтатусов

Функция СтатусыЦветТекстаТребуетВнимания() Экспорт
	
	СтатусыЦветТекстаТребуетВнимания = Новый Массив;
	СтатусыЦветТекстаТребуетВнимания.Добавить(Перечисления.ВидыСтатусовОбработкиВЕТИС.ОшибкаПередачи);
	СтатусыЦветТекстаТребуетВнимания.Добавить(Перечисления.ВидыСтатусовОбработкиВЕТИС.ЗапросВозможностиПеремещенияОшибка);
	
	Возврат СтатусыЦветТекстаТребуетВнимания;
	
КонецФункции

Функция НеотображаемыеВДокументахДальнейшиеДействия() Экспорт
	
	Действия = Новый Массив;
	Действия.Добавить(Перечисления.ДальнейшиеДействияВЕТИС.НеТребуется);
	Действия.Добавить(Перечисления.ДальнейшиеДействияВЕТИС.ОжидайтеЗавершенияОбработки);
	
	Возврат Действия;
	
КонецФункции

Функция ПредставлениеСтатусаОбработки(СтатусОбработки, ВходящиеДальнейшееДействие, ДопустимыеДействия, Объект = Неопределено) Экспорт
	
	МассивДопустимыеДействия = Новый Массив;
	
	Если ТипЗнч(ДопустимыеДействия) = Тип("ПеречислениеСсылка.ДальнейшиеДействияВЕТИС") Тогда
		МассивДопустимыеДействия.Добавить(ДопустимыеДействия);
	Иначе
		МассивДопустимыеДействия = ДопустимыеДействия;
	КонецЕсли;
	
	Если ТипЗнч(СтатусОбработки) <> Тип("ФорматированнаяСтрока") Тогда
		
		СтатусыЦветТекстаТребуетВнимания = СтатусыЦветТекстаТребуетВнимания();
		
		Если СтатусыЦветТекстаТребуетВнимания.Найти(СтатусОбработки) <> Неопределено Тогда
			СтатусОбработкиПредставление = Новый ФорматированнаяСтрока(Строка(СтатусОбработки),,ЦветаСтиля.ПоясняющийОшибкуТекст);
		Иначе
			СтатусОбработкиПредставление = Новый ФорматированнаяСтрока(Строка(СтатусОбработки));
		КонецЕсли;
		
	Иначе
		СтатусОбработкиПредставление = СтатусОбработки;
	КонецЕсли;
	
	ДальнейшиеДействия = Новый Массив;
	Если ТипЗнч(ВходящиеДальнейшееДействие) = Тип("ПеречислениеСсылка.ДальнейшиеДействияВЕТИС") И ЗначениеЗаполнено(ВходящиеДальнейшееДействие) Тогда
		ДальнейшиеДействия.Добавить(ВходящиеДальнейшееДействие);
	ИначеЕсли ТипЗнч(ВходящиеДальнейшееДействие) = Тип("Массив") Тогда
		ДальнейшиеДействия = ВходящиеДальнейшееДействие;
	КонецЕсли;
	
	СтрокиДальнейшееДействие = Новый Массив;
	СтрокиДальнейшееДействие.Добавить(СтатусОбработкиПредставление);
	СтрокиДальнейшееДействие.Добавить(", ");
	
	Для Каждого ДальнейшееДействие Из ДальнейшиеДействия Цикл
		
		Если Не ЗначениеЗаполнено(ДальнейшееДействие) Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеДействия = Строка(ДальнейшееДействие);
		ТекстГиперссылки = "";
		Если НЕ МассивДопустимыеДействия.Найти(ДальнейшееДействие) = Неопределено Тогда
			
			Если ДальнейшееДействие = Перечисления.ДальнейшиеДействияВЕТИС.ПередайтеДанные Тогда
				ТекстГиперссылки = "ПередатьДанные";
			ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияВЕТИС.ЗапроситеУсловияПеремещения Тогда
				ТекстГиперссылки = "ЗапроситьУсловияПеремещения";
			ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияВЕТИС.Оформите Тогда
				ТекстГиперссылки = "Оформить";
			ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияВЕТИС.ПодтвердитеУсловияПеремещения Тогда
				ТекстГиперссылки = "ПодтвердитьУсловияПеремещения";
			ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияВЕТИС.ЗаполнитеАктНесоответствия Тогда
				ТекстГиперссылки = "ЗаполнитьАктНесоответствия";
			//ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияВЕТИС.ОформитеПоступление Тогда
			//	ДокументНакладная = НайтиДокументПоступления(Объект.Ссылка, Объект.ХозОперация);
			//	Если ЗначениеЗаполнено(ДокументНакладная) Тогда
			//		ТекстГиперссылки = "ОформитьПоступление";
			//		ОписаниеДействия = НСтр("ru = 'Откройте поступление'")
			//	Иначе
			//		ТекстГиперссылки = "ОформитьПоступление";
			//		ОписаниеДействия = НСтр("ru = 'Создайте поступление'")
			//	КонецЕсли;
			ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияВЕТИС.ОтменитеОперацию Тогда
				ТекстГиперссылки = "ОтменитьОперацию";
			ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияВЕТИС.ОтменитеПередачуДанных Тогда
				ТекстГиперссылки = "ОтменитьПередачу";
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстГиперссылки) Тогда
			
			Если СтрокиДальнейшееДействие.Количество() > 2 Тогда
				СтрокиДальнейшееДействие.Добавить(" " + НСтр("ru = 'или'") + " ");
			КонецЕсли;
			
			СтрокаДальнейшееДействие = Новый ФорматированнаяСтрока(
			НРег(ОписаниеДействия),
			Новый Шрифт(,,,,Истина),
			ЦветаСтиля.ЦветГиперссылкиБЭД,
			,
			ТекстГиперссылки);
			
			СтрокиДальнейшееДействие.Добавить(СтрокаДальнейшееДействие);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СтрокиДальнейшееДействие.Количество() > 2 Тогда
		СтатусОбработкиПредставление = Новый ФорматированнаяСтрока(СтрокиДальнейшееДействие);
	КонецЕсли;
	
	Возврат СтатусОбработкиПредставление;
	
КонецФункции

Процедура ЗаписатьСтатусДокументаПоУмолчанию(ДокументОбъект) Экспорт
	
	Если НЕ ПолучитьЗначениеПараметраСтруктуры(ДокументОбъект.ДополнительныеСвойства, "ЭтоНовый", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаписи = РегистрыСведений.СтатусыДокументовВЕТИС.ЗначенияПоУмолчанию(ДокументОбъект.Ссылка);
	
	РегистрыСведений.СтатусыДокументовВЕТИС.ВыполнитьЗаписьВРегистр(ДанныеЗаписи);
	
КонецПроцедуры

#КонецОбласти

Функция ТекстИсключенияОбработкиСтатуса(Документ, Операция) Экспорт
	
	Возврат СтрШаблон(
		НСтр("ru = 'При изменении статуса документа %1 не обработана операция %2'"),
		Документ,
		Операция);
	
КонецФункции

// Возвращает структуру параметров обновления статуса.
//
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * ОбновлятьДвижения- Булево - Признак необходимости обновления движений документа.
//   * СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийВЕТИС - Статус обработки сообщения.
//   * ДокументОбъект - ДокументОбъект - Документ-объект.
//   * ИдентификаторЗапроса - Строка - Идентификатор запроса.
//   * ФорматОбмена - ПеречислениеСсылка.ФорматыОбменаВЕТИС - Формат обмена.
//   * ЕстьОшибкиСервиса - Булево - Признак наличия ошибок сервиса при обмене.
//
Функция ПараметрыОбновленияСтатуса(ПараметрыОбновленияСтатуса = Неопределено) Экспорт
	
	Если ПараметрыОбновленияСтатуса = Неопределено Тогда
		ПараметрыОбновленияСтатуса = Новый Структура;
	КонецЕсли;
	ПараметрыОбновленияСтатуса.Вставить("ОбновлятьДвижения", Истина);
	ПараметрыОбновленияСтатуса.Вставить("СтатусОбработки");
	ПараметрыОбновленияСтатуса.Вставить("ДокументОбъект");
	ПараметрыОбновленияСтатуса.Вставить("ИдентификаторЗапроса");
	ПараметрыОбновленияСтатуса.Вставить("ФорматОбмена");
	Если Не ПараметрыОбновленияСтатуса.Свойство("ЕстьОшибкиСервиса") Тогда
		ПараметрыОбновленияСтатуса.Вставить("ЕстьОшибкиСервиса", Ложь);
	КонецЕсли;
	Если Не ПараметрыОбновленияСтатуса.Свойство("ЕстьОшибкиВСДДолженБытьВСостоянииОформлен") Тогда
		ПараметрыОбновленияСтатуса.Вставить("ЕстьОшибкиВСДДолженБытьВСостоянииОформлен", Ложь);
	КонецЕсли;
	
	Возврат ПараметрыОбновленияСтатуса;
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

Процедура ЗафиксироватьОшибкуСервиса(ЭлементОчереди, ПараметрыОбмена) Экспорт
	
	ЭлементОчереди.ЕстьОшибкиСервиса               = Истина;
	ЭлементОчереди.ПроверенаКорректностьОформления = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыСкладскихЗаписей(Объект, ТекущаяСтрока, ИмяТабличнойЧасти = "Партии", ПараметрыДействия = Неопределено) Экспорт
	
	Если НЕ ЕстьРеквизит(Объект, "ДатаВыработки", ИмяТабличнойЧасти) Тогда
		Возврат;
	КонецЕсли;
	
	// Получим менеджер объекта.
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = МенеджерОбъекта.ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ХозяйствующийСубъект = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ХозяйствующийСубъект");
	Предприятие          = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Предприятие");
	
	Если ТекущаяСтрока = Неопределено Тогда
		ТаблицаПартий = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТаблицаПартий", Объект[ИмяТабличнойЧасти]);
		ТаблицаПартий = ТаблицаПартий.Выгрузить();
	Иначе
		ТаблицаПартий = Новый ТаблицаЗначений;
		ТаблицаПартий.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
		ТаблицаПартий.Колонки.Добавить("НомерСтроки",   Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,0)));
		
		НоваяСтрока = ТаблицаПартий.Добавить();
		НоваяСтрока.Идентификатор = ТекущаяСтрока.Идентификатор;
		НоваяСтрока.НомерСтроки   = ТекущаяСтрока.НомерСтроки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаПартий",        ТаблицаПартий);
	Запрос.УстановитьПараметр("ХозяйствующийСубъект", ХозяйствующийСубъект);
	Запрос.УстановитьПараметр("Предприятие",          Предприятие);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	&ХозяйствующийСубъект КАК ХозяйствующийСубъект,
	|	&Предприятие КАК Предприятие,
	|	ТаблицаПартий.НомерСтроки КАК НомерСтроки,
	|	ТаблицаПартий.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ
	|	ТаблицаПартий
	|ИЗ
	|	&ТаблицаПартий КАК ТаблицаПартий
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаПартий.НомерСтроки КАК НомерСтроки,
	|	СкладскойЖурналВЕТИС.ДатаВыработки КАК ДатаВыработки
	|ИЗ
	|	ТаблицаПартий КАК ТаблицаПартий
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СкладскойЖурналВЕТИС КАК СкладскойЖурналВЕТИС
	|ПО
	|	ТаблицаПартий.ХозяйствующийСубъект = СкладскойЖурналВЕТИС.ХозяйствующийСубъект И 
	|	ТаблицаПартий.Предприятие = СкладскойЖурналВЕТИС.Предприятие И 
	|	ТаблицаПартий.Идентификатор = СкладскойЖурналВЕТИС.Идентификатор
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТоваров = Объект[ИмяТабличнойЧасти][Выборка.НомерСтроки-1];
		СтрокаТоваров.ДатаВыработки = Выборка.ДатаВыработки;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМаркировкуПроизводитель(СвойстваЗаписей = Неопределено, НомерЗаписи = Неопределено) Экспорт
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Если НомерЗаписи = Неопределено Тогда
		Запрос.УстановитьПараметр("СвойстваЗаписей", СвойстваЗаписей);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	МАКСИМУМ(ТаблицаПроизводители.Производитель.Наименование) КАК Производитель
		|ИЗ
		|	Справочник.СвойстваЗаписейСкладскогоЖурналаВЕТИС.Производители КАК ТаблицаПроизводители
		|ГДЕ
		|	ТаблицаПроизводители.Ссылка = &СвойстваЗаписей И 
		|	(НЕ ТаблицаПроизводители.Производитель = ЗНАЧЕНИЕ(Справочник.ПредприятияВЕТИС.ПустаяСсылка))
		|";
	Иначе
		Запрос.УстановитьПараметр("НомерЗаписи", НомерЗаписи);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	МАКСИМУМ(ТаблицаПроизводители.Производитель.Наименование) КАК Производитель
		|ИЗ
		|	Справочник.СвойстваЗаписейСкладскогоЖурналаВЕТИС.Производители КАК ТаблицаПроизводители
		|ГДЕ
		|	ТаблицаПроизводители.Ссылка.НомерЗаписи = &НомерЗаписи И 
		|	(НЕ ТаблицаПроизводители.Производитель = ЗНАЧЕНИЕ(Справочник.ПредприятияВЕТИС.ПустаяСсылка))
		|";
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = СокрЛП(Выборка.Производитель);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИзмененныеОбъекты(ИзмененныеОбъекты) Экспорт
	
	Если ИзмененныеОбъекты = Неопределено Тогда
		Объект = Неопределено;
	ИначеЕсли ИзмененныеОбъекты.Количество() = 0 Тогда
		Объект = Неопределено;
	ИначеЕсли ИзмененныеОбъекты.Количество() = 1 Тогда
		Объект = ИзмененныеОбъекты[0];
	Иначе
		Объект = ИзмененныеОбъекты;
	КонецЕсли;
	
	Возврат Объект;
	
КонецФункции

Функция УдалитьЛидирующиеСимволы(Значение, УдаляемыйСимвол)
	
	Пока Лев(Значение, 1) = УдаляемыйСимвол Цикл
		Значение = Сред(Значение, 2);
	КонецЦикла;
	
	Возврат Значение;
	
КонецФункции

Функция ПолучитьНомерБезПрефикса(Номер)
	
	Результат = "";
	Цифры     = "1234567890";
	
	ДлинаНомера = СтрДлина(Номер);
	Пока ДлинаНомера>=0 Цикл
		
		ТекущийСимвол = Сред(Номер,ДлинаНомера,1);
		Если ТекущийСимвол = "-" Тогда
			Прервать;
		КонецЕсли;
		
		Если Найти(Цифры, ТекущийСимвол) = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Результат = ТекущийСимвол + Результат;
		
		ДлинаНомера = ДлинаНомера - 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьНомерТТН(Номер, ОчищатьЛидирующиеСимволы, ЗаменятьПрефикс, Префикс)
	
	Результат = Номер;
	НомерБезПрефикса = ПолучитьНомерБезПрефикса(Номер);
	
	Если ОчищатьЛидирующиеСимволы И ЗаменятьПрефикс Тогда
		НомерБезЛидидирующихСимволом = УдалитьЛидирующиеСимволы(НомерБезПрефикса,"0");
		Результат = Префикс + НомерБезЛидидирующихСимволом;
	ИначеЕсли ЗаменятьПрефикс И НЕ ОчищатьЛидирующиеСимволы Тогда
		Результат = Префикс + НомерБезПрефикса;
	ИначеЕсли ОчищатьЛидирующиеСимволы И НЕ ЗаменятьПрефикс Тогда
		ТекущийПрефикс = СтрЗаменить(Номер, НомерБезПрефикса, "");
		ТекущийПрефикс = СтрЗаменить(ТекущийПрефикс, "-", "");
		НомерБезЛидидирующихСимволом = УдалитьЛидирующиеСимволы(НомерБезПрефикса,"0");
		Результат = ТекущийПрефикс + НомерБезЛидидирующихСимволом;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиСсылкуНаОбъект(ИмяСправочника, Код, ИдентификаторЗаписи)
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", Неопределено);
	Результат.Вставить("ИдентификаторЗаписи", ИдентификаторЗаписи);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Код",                 Код);
	Запрос.УстановитьПараметр("ИдентификаторЗаписи", ИдентификаторЗаписи);
	
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИскСправочник.Ссылка КАК Ссылка,
	|	ИскСправочник.ИдентификаторЗаписи
	|ИЗ
	|	Справочник."+ИмяСправочника+" КАК ИскСправочник
	|ГДЕ
	|	
	|	ИскСправочник.Код = &Код
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИскСправочник.Ссылка КАК Ссылка,
	|	ИскСправочник.ИдентификаторЗаписи
	|ИЗ
	|	Справочник."+ИмяСправочника+" КАК ИскСправочник
	|ГДЕ
	|	
	|	ИскСправочник.ИдентификаторЗаписи = &ИдентификаторЗаписи
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Вставить("Ссылка",              Выборка.Ссылка);
		Результат.Вставить("ИдентификаторЗаписи", Выборка.ИдентификаторЗаписи);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДатуИзСтруктуры(ДанныеЗаполнения, СоставДаты = 0, СтрокаДаты = "")
	
	Если ДанныеЗаполнения = Неопределено тогда
		Возврат Дата(1,1,1);
	КонецЕсли;
	
	day   = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "day", 1);
	month = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "month", 1);
	hour  = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "hour", 0);
	
	СтрокаДаты = Строка(ДанныеЗаполнения.year)+",";
	Если ДанныеЗаполнения.month = Неопределено Тогда
		СтрокаДаты = СтрокаДаты + "_,";
	Иначе
		СтрокаДаты = СтрокаДаты + +Формат(ДанныеЗаполнения.month, "ЧН=0; ЧГ=")+",";
	КонецЕсли;
	
	Если ДанныеЗаполнения.day = Неопределено Тогда
		СтрокаДаты = СтрокаДаты + "_,";
	Иначе
		СтрокаДаты = СтрокаДаты + Формат(ДанныеЗаполнения.day, "ЧН=0; ЧГ=")+",";
	КонецЕсли;
	
	Если ДанныеЗаполнения.hour = Неопределено Тогда
		СтрокаДаты = СтрокаДаты + "_,";
	Иначе
		СтрокаДаты = СтрокаДаты + Формат(ДанныеЗаполнения.hour, "ЧН=0; ЧГ=")+",";
	КонецЕсли;
	
	Если ДанныеЗаполнения.month = Неопределено Тогда
		СоставДаты = 1;
	ИначеЕсли ДанныеЗаполнения.day = Неопределено Тогда
		СоставДаты = 2;
	ИначеЕсли ДанныеЗаполнения.hour = Неопределено Тогда
		СоставДаты = 3;
	Иначе
		СоставДаты = 4;
	КонецЕсли;
	
	Возврат Дата(ДанныеЗаполнения.year, month, day, hour, 0, 0);
	
КонецФункции

Процедура ЗаполнитьРеквизитыПартии(НастройкаПодключения, ХозяйствующийСубъект, ВСДОбъект, ДанныеПартии, ЗаписьВЖурнал=Ложь)
	
	ВСДОбъект.Владелец = ЗагрузитьХозяйствующийСубъект(НастройкаПодключения,, ДанныеПартии.owner);
	
	dateOfProduction = ДанныеПартии.dateOfProduction;
	Если НЕ dateOfProduction = Неопределено Тогда
		
		СоставДатыС = 3;
		СоставДатыПо = 3;
		СтрокаДатыС = "";
		СтрокаДатыПо = "";
		ДатаВыработки   = ПолучитьДатуИзСтруктуры(dateOfProduction.firstDate, СоставДатыС, СтрокаДатыС);
		ДатаВыработкиПо = ПолучитьДатуИзСтруктуры(dateOfProduction.secondDate, СоставДатыПо, СтрокаДатыПо);
		
		ВСДОбъект.ДатаВыработки        = ДатаВыработки;
		ВСДОбъект.ДатаВыработкиПо      = ДатаВыработкиПо;
		ВСДОбъект.ДатаВыработкиСтрокой = dateOfProduction.informalDate;
		
		Если НЕ ЗаписьВЖурнал Тогда
			ВСДОбъект.СоставДатыВыработкиС  = СоставДатыС;
			ВСДОбъект.СоставДатыВыработкиПо = СоставДатыПо;
		//ИначеЕсли ПустаяСтрока(ВСДОбъект.ДатаВыработкиСтрокой) И ((НЕ СоставДатыС = 3) ИЛИ (НЕ СоставДатыПо = 3)) Тогда
		//	СтрокаДатыС = "СтрокаДатыС" + СтрокаДатыС + "ПО" + СтрокаДатыПо;
		//	ВСДОбъект.ДатаВыработкиСтрокой = СтрокаДатыС;
		КонецЕсли;
		
	КонецЕсли;
	
	expiryDate = ДанныеПартии.expiryDate;
	Если НЕ expiryDate = Неопределено Тогда
		
		СоставДатыС = 3;
		СоставДатыПо = 3;
		СтрокаДатыС = "";
		СтрокаДатыПо = "";
		СрокГодности   = ПолучитьДатуИзСтруктуры(expiryDate.firstDate, СоставДатыС, СтрокаДатыС);
		СрокГодностиПо = ПолучитьДатуИзСтруктуры(expiryDate.secondDate, СоставДатыПо, СтрокаДатыПо);
		
		ВСДОбъект.СрокГодности        = СрокГодности;
		Если ЗаписьВЖурнал Тогда
			Если ЗначениеЗаполнено(СрокГодностиПо) Тогда
				ВСДОбъект.СрокГодностиПо = СрокГодностиПо;
			Иначе
				ВСДОбъект.СрокГодностиПо = СрокГодности;
			КонецЕсли;
		Иначе
			ВСДОбъект.СрокГодностиПо     = СрокГодностиПо;
		КонецЕсли;
		ВСДОбъект.СрокГодностиСтрокой = expiryDate.informalDate;
		
		Если НЕ ЗаписьВЖурнал Тогда
			ВСДОбъект.СоставСрокаГодностиС  = СоставДатыС;
			ВСДОбъект.СоставСрокаГодностиПо = СоставДатыПо;
		//ИначеЕсли ПустаяСтрока(ВСДОбъект.СрокГодностиСтрокой) И ((НЕ СоставДатыС = 3) ИЛИ (НЕ СоставДатыПо = 3)) Тогда
		//	СтрокаДатыС = "СтрокаДатыС" + СтрокаДатыС + "ПО" + СтрокаДатыПо;
		//	ВСДОбъект.СрокГодностиСтрокой = СтрокаДатыС;
		КонецЕсли;
		
	КонецЕсли;
	
	ВСДОбъект.Скоропортящаяся = ДанныеПартии.perishable;
	ВСДОбъект.Некачественный  = ДанныеПартии.lowGradeCargo;
	
	productType      = ДанныеПартии.productType;
	Если productType = Неопределено Тогда
		ТипПродукции = Неопределено;
	Иначе
		ТипПродукции = Справочники.ПродукцияВЕТИС.НайтиПоКоду(productType, Истина);
	КонецЕсли;
	
	Продукция              = ЗагрузитьПродукцию(НастройкаПодключения,, ДанныеПартии.product, ТипПродукции);
	ВСДОбъект.ВидПродукции = ЗагрузитьВидПродукции(НастройкаПодключения,, ДанныеПартии.subProduct, ТипПродукции, Продукция);
	ВСДОбъект.Продукция    = ЗагрузитьНаименованиеПродукции(НастройкаПодключения,, ДанныеПартии.productItem, ТипПродукции, Продукция, ВСДОбъект.ВидПродукции);
	
	Если ЗаписьВЖурнал Тогда
		ВСДОбъект.НаименованиеПродукции = ДанныеПартии.productItem.name;
	Иначе
		ВСДОбъект.ПродукцияСтрокой      = ДанныеПартии.productItem.name;
	КонецЕсли;
	ВСДОбъект.Количество         = ДанныеПартии.volume;
	ВСДОбъект.ЕдиницаИзмерения   = ЗагрузитьЕдиницуИзмерения(НастройкаПодключения,, ДанныеПартии.unit);
	ВСДОбъект.КоличествоУпаковок = ПолучитьЗначениеПараметраСтруктуры(ДанныеПартии, "packingAmount", 0);
	
	Если НЕ ЗаписьВЖурнал Тогда
		uuidНаименования = ДанныеПартии.productItem.uuid;
		ВСДОбъект.ИдентификаторЗаписиПродукции = uuidНаименования;
	КонецЕсли;
	
	origin = ДанныеПартии.origin; // Сведения о происхождении продукции.
	Если origin = Неопределено Тогда
		countryOfOrigin = ДанныеПартии.countryOfOrigin;
	Иначе
		countryOfOrigin = origin.country;
		
		originProductItem = origin.productItem;
		Если НЕ originProductItem = Неопределено Тогда
			ПродукцияОригинал = ЗагрузитьНаименованиеПродукции(НастройкаПодключения,, originProductItem, ТипПродукции, Продукция, ВСДОбъект.ВидПродукции);
			ВСДОбъект.ПродукцияОригинал = ПродукцияОригинал;
			//Если ЗначениеЗаполнено(ВСДОбъект.ПродукцияОригинал) И (НЕ ЗначениеЗаполнено(ВСДОбъект.Продукция)) Тогда
			//	ВСДОбъект.Продукция = ВСДОбъект.ПродукцияОригинал;
			//КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ countryOfOrigin = Неопределено Тогда
		ВСДОбъект.СтранаПроисхождения = ЗагрузитьСтрану(НастройкаПодключения,, countryOfOrigin);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицыПартии(ПараметрыОбмена, ХозяйствующийСубъект, ВСДОбъект, ДанныеПартии)
	
	ВСДОбъект.Маркировка.Очистить();
	ВСДОбъект.Упаковки.Очистить();
	ВСДОбъект.ПроизводственныеПартии.Очистить();
	ВСДОбъект.Производители.Очистить();
	
	packingList = ПолучитьЗначениеПараметраСтруктуры(ДанныеПартии, "packingList", Неопределено);
	Если НЕ packingList = Неопределено Тогда
		СписокУпаковок = packingList.packingForm;
		Для Каждого ТекущаяУпаковка Из СписокУпаковок Цикл
			НоваяСтрока = ВСДОбъект.Упаковки.Добавить();
			НоваяСтрока.ИдентификаторСтроки = 1;
			НоваяСтрока.УровеньУпаковки     = Перечисления.УровниУпаковокВЕТИС.ДополнительныйУровень;
			НоваяСтрока.КоличествоУпаковок  = ВСДОбъект.КоличествоУпаковок;
			uuidУпаковки = ТекущаяУпаковка.uuid;
			Если uuidУпаковки = Неопределено Тогда
				НоваяСтрока.Упаковка = Справочники.УпаковкиВЕТИС.НайтиПоНаименованию(ТекущаяУпаковка.name, Истина);
			Иначе
				НоваяСтрока.Упаковка = ЗагрузитьТипУпаковки(uuidУпаковки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	packageList = ПолучитьЗначениеПараметраСтруктуры(ДанныеПартии, "packageList", Неопределено);
	Если НЕ packageList = Неопределено Тогда
		СписокУпаковок = packageList.package;
		ИдентификаторСтроки = 1;
		Для Каждого ДанныеУпаковки Из СписокУпаковок Цикл
			НоваяУпаковка = ВСДОбъект.Упаковки.Добавить();
			НоваяУпаковка.ИдентификаторСтроки = ИдентификаторСтроки;
			level = ДанныеУпаковки.level;
			НоваяУпаковка.УровеньУпаковки    = Перечисления.УровниУпаковокВЕТИС.ПолучитьЗначение(ДанныеУпаковки.level);
			НоваяУпаковка.КоличествоУпаковок = ДанныеУпаковки.quantity;
			
			ТекущаяУпаковка = ДанныеУпаковки.packingType;
			uuidУпаковки = ТекущаяУпаковка.guid;
			Если uuidУпаковки = Неопределено Тогда
				uuidУпаковки = ТекущаяУпаковка.uuid;
			КонецЕсли;
			Если uuidУпаковки = Неопределено Тогда
				НоваяУпаковка.Упаковка = Справочники.УпаковкиВЕТИС.НайтиПоНаименованию(ТекущаяУпаковка.name, Истина);
			Иначе
				НоваяУпаковка.Упаковка = ЗагрузитьТипУпаковки(uuidУпаковки);
			КонецЕсли;
			
			СписокМаркировки = ДанныеУпаковки.productMarks;
			Для Каждого ТекущаяМаркировка Из СписокМаркировки Цикл
				ТекстМаркировки = ТекущаяМаркировка.__content;
				Если ПустаяСтрока(ТекстМаркировки) Тогда
					Попытка
						ТекстМаркировки = ТекущаяМаркировка.Последовательность().ПолучитьТекст(0);
					Исключение
						Продолжить;
					КонецПопытки;
				КонецЕсли;
				
				Если ПустаяСтрока(ТекстМаркировки) Тогда
					Продолжить;
				КонецЕсли;
				НоваяМаркировка = ВСДОбъект.Маркировка.Добавить();
				НоваяМаркировка.ТипМаркировки       = Перечисления.ТипыМаркировкиВЕТИС.ПолучитьЗначение(ТекущаяМаркировка.class);
				НоваяМаркировка.Маркировка          = ТекстМаркировки;
				НоваяМаркировка.ИдентификаторСтроки = ИдентификаторСтроки;
			КонецЦикла;
			
			ИдентификаторСтроки = ИдентификаторСтроки + 1;
		КонецЦикла;
	КонецЕсли;
	
	productMarkingList = ПолучитьЗначениеПараметраСтруктуры(ДанныеПартии, "productMarkingList", Неопределено);
	Если НЕ productMarkingList = Неопределено Тогда
		СписокМаркировки = productMarkingList.productMarking;
		Для Каждого ТекущаяМаркировка Из СписокМаркировки Цикл
			Если ТипЗнч(ТекущаяМаркировка) = Тип("Строка") Тогда
				НоваяМаркировка = ВСДОбъект.Маркировка.Добавить();
				НоваяМаркировка.ТипМаркировки       = Перечисления.ТипыМаркировкиВЕТИС.UNDEFINED;
				НоваяМаркировка.Маркировка          = ТекущаяМаркировка;
				НоваяМаркировка.ИдентификаторСтроки = 1;
			Иначе
				ЗначениеМаркировки = ТекущаяМаркировка.__content;
				Если ЗначениеЗаполнено(ЗначениеМаркировки) Тогда
					НоваяМаркировка = ВСДОбъект.Маркировка.Добавить();
					НоваяМаркировка.ТипМаркировки       = Перечисления.ТипыМаркировкиВЕТИС.ПолучитьЗначение(ТекущаяМаркировка.class);
					НоваяМаркировка.Маркировка          = ЗначениеМаркировки;
					НоваяМаркировка.ИдентификаторСтроки = 1;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СписокbatchID = ДанныеПартии.batchID;
	Для Каждого ЭлементbatchID Из СписокbatchID Цикл
		НоваяСтрокаПартии = ВСДОбъект.ПроизводственныеПартии.Добавить();
		НоваяСтрокаПартии.ИдентификаторПартии = ЭлементbatchID;
	КонецЦикла;
	
	origin = ДанныеПартии.origin; // Сведения о происхождении продукции.
	Если origin = Неопределено Тогда
		producerList = ДанныеПартии.producerList;
		СписокПроизводителей = producerList.producer;
	Иначе
		СписокПроизводителей = origin.producer;
	КонецЕсли;
	
	Для Каждого ТекущийПроизводитель Из СписокПроизводителей Цикл
		Попытка
			enterprise = ТекущийПроизводитель.enterprise;
			ТекПредприятие = ЗагрузитьПредприятие(ПараметрыОбмена,, enterprise);
		Исключение
			ТекПредприятие = Неопределено;
		КонецПопытки;
		
		Если НЕ ТекПредприятие = Неопределено Тогда
			НоваяСтрока = ВСДОбъект.Производители.Добавить();
			НоваяСтрока.Производитель     = ТекПредприятие;
			НоваяСтрока.РольПроизводителя = Перечисления.РолиПроизводителяВЕТИС.ПолучитьЗначение(ТекущийПроизводитель.role);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОсновнуюУпаковку(ТаблицаУпаковок)
	
	Результат = Новый Структура;
	Результат.Вставить("Упаковка",           Неопределено);
	Результат.Вставить("КоличествоУпаковок", 0);
	
	МаксимальныйУровень = 0;
	Для Каждого ТекущаяСтрока Из ТаблицаУпаковок Цикл
		УровеньУпаковки = Перечисления.УровниУпаковокВЕТИС.ПолучитьЗначениеВЕТИС(ТекущаяСтрока.УровеньУпаковки);
		Если УровеньУпаковки>МаксимальныйУровень Тогда
			Результат.Вставить("Упаковка",           ТекущаяСтрока.Упаковка);
			Результат.Вставить("КоличествоУпаковок", ТекущаяСтрока.КоличествоУпаковок);
			МаксимальныйУровень = УровеньУпаковки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстОшибкиОбработкиРезультата(ДанныеДокумента, ХозяйствующийСубъект = Неопределено, Предприятие = Неопределено, ВыводитьЗаголовок = Ложь) Экспорт
	
	Ошибки = Новый Массив;
	Если ДанныеДокумента.Ошибки <> Неопределено Тогда
		
		Если ВыводитьЗаголовок Тогда
			
			ПредставлениеХС          = НСтр("ru = '<не указан>'");
			ПредставлениеПредприятия = НСтр("ru = '<не указано>'");
			Если ЗначениеЗаполнено(ХозяйствующийСубъект) Тогда
				
				ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
					ХозяйствующийСубъект, "Наименование, Код");
				ПредставлениеХС = СтрШаблон(
					"%1(%2)",
					ЗначенияРеквизитов.Наименование,
					ЗначенияРеквизитов.Код);
				Если ЗначениеЗаполнено(Предприятие) Тогда
					ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
						Предприятие, "Наименование, Код");
					ПредставлениеПредприятия = СтрШаблон(
						"%1(%2)",
						ЗначенияРеквизитов.Наименование,
						ЗначенияРеквизитов.Код);
				КонецЕсли;
				
			КонецЕсли;
			
			Ошибки.Добавить(
				СтрШаблон(
					НСтр("ru = 'Получен ""%1"" (id=%2)
					           |Хозяйствующий субъект: %3
					           |Предприятие: %4
					           |%5 по причине:'"),
					ДанныеДокумента.ВходящаяОперация,
					ДанныеДокумента.ИдентификаторЗаявки,
					ПредставлениеХС,
					ПредставлениеПредприятия,
					ДанныеДокумента.СтатусОбработки));
			
		КонецЕсли;
		
		Для Каждого Ошибка Из ДанныеДокумента.Ошибки Цикл
			Ошибки.Добавить(СтрШаблон(НСтр("ru = '%1: %2'"), Ошибка.Код, Ошибка.ТекстОшибки));
		КонецЦикла;
		
		//Ошибки.Добавить(НСтр("ru = 'Текст XML см. в протоколе обмена.'"));
		
	КонецЕсли;
	
	Возврат СтрСоединить(Ошибки, Символы.ПС);
	
КонецФункции

Функция ПолучитьListOptions(ВнутренняяФабрикаXDTO, Смещение = Неопределено, Шаг = Неопределено) Экспорт
	
	ListOptions = ВнутренняяФабрикаXDTO.Создать("http://api.vetrf.ru/schema/cdm/base", "ListOptions");
	
	Если Смещение = Неопределено Тогда
		listOptions.offset = 0;
	Иначе
		listOptions.offset = Смещение;
	КонецЕсли;
	
	Если Шаг = Неопределено Тогда
		ListOptions.count = 500;
	Иначе
		listOptions.count = Шаг;
	КонецЕсли;
	
	Возврат(ListOptions);
	
КонецФункции

#Область СозданиеОбъектов

Функция ЗагрузитьТипУпаковки(Идентификатор, Наименование = "", КодУпаковки = "") Экспорт
	
	НайденнаяУпаковка = Справочники.УпаковкиВЕТИС.НайтиПоКоду(Идентификатор);
	Если ЗначениеЗаполнено(НайденнаяУпаковка) Тогда
		Возврат НайденнаяУпаковка;
	Иначе
		
		УникальныйКод = Новый УникальныйИдентификатор(Идентификатор);
		НоваяСсылка = Справочники.УпаковкиВЕТИС.ПолучитьСсылку(УникальныйКод);
		
		Упаковка = Неопределено;
		Если ЗначениеЗаполнено(НоваяСсылка) Тогда
			//Возврат НоваяСсылка;
			Упаковка = НоваяСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		Если Упаковка = Неопределено Тогда
			Упаковка = Справочники.УпаковкиВЕТИС.СоздатьЭлемент();
			Упаковка.УстановитьСсылкуНового(НоваяСсылка);
		ИначеЕсли Упаковка.Код = Идентификатор Тогда
			Возврат НоваяСсылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Наименование = "" Тогда
		ДанныеУпаковки = ПолучитьДанныеУпаковки(Идентификатор);
		Упаковка.Наименование = ДанныеУпаковки.Наименование;
		Упаковка.КодУпаковки  = ДанныеУпаковки.КодУпаковки;
	Иначе
		Упаковка.Наименование = Наименование;
		Упаковка.КодУпаковки  = КодУпаковки;
	КонецЕсли;
	
	Упаковка.Код = Идентификатор;
	Упаковка.Записать();
	
	ВывестиСообщение(НСтр("ru='Загружена упаковка: <%1>, код: <%2>.'"),,,,,Упаковка.Наименование, Упаковка.Код);
	
	Возврат Упаковка.Ссылка;
	
КонецФункции

Функция ЗагрузитьПредприятие(НастройкаПодключения, ПараметрыЗапроса = Неопределено, ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат Справочники.ПредприятияВЕТИС.ПустаяСсылка();
	КонецЕсли;
	
	Если ПараметрыЗапроса = Неопределено Тогда
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
		ПараметрыЗапроса.ИмяСправочника = "ПредприятияВЕТИС";
		ПараметрыЗапроса.АдресРесурса = "platform/services/2.1/EnterpriseService";
		ПараметрыЗапроса.ИмяЭлемента = "Enterprise";
	КонецЕсли;
	
	РезультатПроверки = ПроверкаДанныхЗаполнения(ДанныеЗаполнения, НастройкаПодключения, ПараметрыЗапроса);
	
	Если РезультатПроверки = Неопределено Тогда
		СправочникОбъект = Справочники[ПараметрыЗапроса.ИмяСправочника].СоздатьЭлемент();
		СправочникОбъект.Код                 = ДанныеЗаполнения.guid;
		СправочникОбъект.ИдентификаторЗаписи = ДанныеЗаполнения.uuid;
		СправочникОбъект.Наименование        = ДанныеЗаполнения.guid;
		СправочникОбъект.НаименованиеПолное  = "Возможно, при получении данных предприятия произошла ошибка";
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружено предприятие: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		Возврат СправочникОбъект.Ссылка;
		
	КонецЕсли;
	
	СправочникОбъект = РезультатПроверки.СправочникОбъект;
	Если РезультатПроверки.ЗаполнитьПодДаннымЗаполнения Тогда
	
		СправочникОбъект.Код                    = ДанныеЗаполнения.guid;
		СправочникОбъект.ИдентификаторЗаписи    = ДанныеЗаполнения.uuid;
		Если НЕ ЗначениеЗаполнено(СправочникОбъект.Наименование) Тогда
			СправочникОбъект.Наименование       = ДанныеЗаполнения.name;
		КонецЕсли;
		
		СправочникОбъект.НаименованиеАнглийское = ДанныеЗаполнения.englishName;
		СправочникОбъект.НаименованиеПолное     = ДанныеЗаполнения.name;
		
		Если Не ДанныеЗаполнения.address = Неопределено Тогда
			СправочникОбъект.Адрес = ДанныеЗаполнения.address.addressView;
		КонецЕсли;
		
		Если ДанныеЗаполнения.type = 1 Тогда
			СправочникОбъект.Тип = "Предприятие"
		ИначеЕсли ДанныеЗаполнения.type = 2 Тогда
			СправочникОбъект.Тип = "Рынок"
		ИначеЕсли ДанныеЗаполнения.type = 3 Тогда
			СправочникОбъект.Тип = "СББЖ"
		ИначеЕсли ДанныеЗаполнения.type = 4 Тогда
			СправочникОбъект.Тип = "Судно"
		КонецЕсли;
		
		Если НЕ ДанныеЗаполнения.activityList = Неопределено Тогда
			СправочникОбъект.ВидыДеятельности = ДанныеЗаполнения.activityList.activity[0];
		КонецЕсли;
		
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружено предприятие: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		СправочникОбъект = СправочникОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат СправочникОбъект;
	
КонецФункции // ЗагрузитьПредприятие()

Функция ЗагрузитьХозяйствующийСубъект(НастройкаПодключения, ПараметрыЗапроса = Неопределено, Знач ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат Справочники.ХозяйствующиеСубъектыВЕТИС.ПустаяСсылка();
	КонецЕсли;
	
	Если ПараметрыЗапроса = Неопределено Тогда
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
		ПараметрыЗапроса.ИмяСправочника = "ХозяйствующиеСубъектыВЕТИС";
		ПараметрыЗапроса.АдресРесурса   = "platform/services/2.1/EnterpriseService";
		ПараметрыЗапроса.ИмяЭлемента    = "BusinessEntity";
	КонецЕсли;
	
	РезультатПроверки = ПроверкаДанныхЗаполнения(ДанныеЗаполнения, НастройкаПодключения, ПараметрыЗапроса);
	
	Если РезультатПроверки = Неопределено Тогда
		СправочникОбъект = Справочники.ХозяйствующиеСубъектыВЕТИС.СоздатьЭлемент();
		СправочникОбъект.Код          = ДанныеЗаполнения.guid;
		СправочникОбъект.ИдентификаторЗаписи = ДанныеЗаполнения.uuid;
		СправочникОбъект.Наименование = ДанныеЗаполнения.guid;
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружена страна: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		Возврат СправочникОбъект.Ссылка;
		
	КонецЕсли;
	
	СправочникОбъект = РезультатПроверки.СправочникОбъект;
	Если РезультатПроверки.ЗаполнитьПодДаннымЗаполнения Тогда
		
		СправочникОбъект.Код                 = ДанныеЗаполнения.guid;
		СправочникОбъект.ИдентификаторЗаписи = ДанныеЗаполнения.uuid;
		СправочникОбъект.Тип                 = ТипХозяйствующегоСубъекта(ДанныеЗаполнения.type);
		СправочникОбъект.ОГРН                = ДанныеЗаполнения.ogrn;
		
		Если СправочникОбъект.Тип = Перечисления.ФормыСобственности.ЧастноеЛицо
			ИЛИ СправочникОбъект.Тип = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель Тогда
			СправочникОбъект.Наименование       = ДанныеЗаполнения.fio;
			СправочникОбъект.НаименованиеПолное = ДанныеЗаполнения.fio;
		Иначе
			СправочникОбъект.Наименование       = ДанныеЗаполнения.name;
			СправочникОбъект.НаименованиеПолное = ДанныеЗаполнения.fullName;
		КонецЕсли;
		
		Если ПустаяСтрока(СправочникОбъект.Наименование) И ПустаяСтрока(СправочникОбъект.НаименованиеПолное) Тогда
			СправочникОбъект.Наименование = ДанныеЗаполнения.guid;
		ИначеЕсли ПустаяСтрока(СправочникОбъект.Наименование) Тогда
			СправочникОбъект.Наименование = СправочникОбъект.НаименованиеПолное;
		КонецЕсли;
		
		СправочникОбъект.НомерПаспорта = ДанныеЗаполнения.passport;
		СправочникОбъект.ФИО           = ДанныеЗаполнения.fio;
		СправочникОбъект.ИНН           = ДанныеЗаполнения.inn;
		СправочникОбъект.КПП           = ДанныеЗаполнения.kpp;
		
		Если ДанныеЗаполнения.juridicalAddress <> Неопределено Тогда
			СправочникОбъект.ЮридическийАдрес = ДанныеЗаполнения.juridicalAddress.addressView;
		КонецЕсли;
		
		Предприятия = ЗагрузитьПредприятия(НастройкаПодключения, ДанныеЗаполнения.guid);
		
		// Добавим предприятия
		Для Каждого ТекСтрока Из Предприятия Цикл
			Если СправочникОбъект.Предприятия.Найти(ТекСтрока.Предприятие, "Предприятие") = Неопределено Тогда
				НоваяСтрока = СправочникОбъект.Предприятия.Добавить();
				НоваяСтрока.Предприятие = ТекСтрока.Предприятие;
				НоваяСтрока.GLN         = ТекСтрока.GLN;
			КонецЕсли;
		КонецЦикла;
		
		СправочникОбъект.Записать();
		ВывестиСообщение(НСтр("ru='Загружен хозяйствующий субъект: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		СправочникОбъект = СправочникОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат СправочникОбъект;
	
КонецФункции // ЗагрузитьХозяйствующийСубъект()

Функция ЗагрузитьЕдиницуИзмерения(НастройкаПодключения, ПараметрыЗапроса = Неопределено, ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат Справочники.ЕдиницыИзмеренияВЕТИС.ПустаяСсылка();
	КонецЕсли;
	
	Если ПараметрыЗапроса = Неопределено Тогда
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
		ПараметрыЗапроса.ИмяСправочника = "ЕдиницыИзмеренияВЕТИС";
		ПараметрыЗапроса.АдресРесурса = "platform/services/2.1/DictionaryService";
		ПараметрыЗапроса.ИмяЭлемента = "Unit";
	КонецЕсли;
	
	РезультатПроверки = ПроверкаДанныхЗаполнения(ДанныеЗаполнения, НастройкаПодключения, ПараметрыЗапроса);
	
	Если РезультатПроверки = Неопределено Тогда
		
		СправочникОбъект = Справочники[ПараметрыЗапроса.ИмяСправочника].СоздатьЭлемент();
		СправочникОбъект.Код          = ДанныеЗаполнения.guid;
		СправочникОбъект.ИдентификаторЗаписи = ДанныеЗаполнения.uuid;
		СправочникОбъект.Наименование = ДанныеЗаполнения.guid;
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружена единица: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		Возврат СправочникОбъект.Ссылка;
	КонецЕсли;
	
	СправочникОбъект = РезультатПроверки.СправочникОбъект;
	Если РезультатПроверки.ЗаполнитьПодДаннымЗаполнения Тогда
		
		СправочникОбъект.Код                         = ДанныеЗаполнения.guid;
		СправочникОбъект.ИдентификаторЗаписи         = ДанныеЗаполнения.uuid;
		СправочникОбъект.Наименование                = ДанныеЗаполнения.name;
		СправочникОбъект.НаименованиеПолное          = ДанныеЗаполнения.fullName;
		
		
		ОформитьБазовуюЕдиницу = Ложь;
		Если ДанныеЗаполнения.guid = ДанныеЗаполнения.commonUnitGuid И ЗначениеЗаполнено(СправочникОбъект.Ссылка) Тогда
			СправочникОбъект.БазоваяЕдиницаИзмерения = СправочникОбъект.Ссылка;
		ИначеЕсли ДанныеЗаполнения.guid = ДанныеЗаполнения.commonUnitGuid Тогда
			ОформитьБазовуюЕдиницу = Истина;
		ИначеЕсли ЗначениеЗаполнено(ДанныеЗаполнения.commonUnitGuid) Тогда
			//БазоваяЕдиницаИзмерения = НайтиСоздатьЕдиницуИзмерения(НастройкаПодключения, ДанныеЗаполнения.commonUnitGuid);
			ДанныеЗаполненияБазовойЕдиницы = Новый Структура;
			ДанныеЗаполненияБазовойЕдиницы.Вставить("Guid", ДанныеЗаполнения.commonUnitGuid);
			БазоваяЕдиницаИзмерения = ЗагрузитьЕдиницуИзмерения(НастройкаПодключения,, ДанныеЗаполненияБазовойЕдиницы);
			СправочникОбъект.БазоваяЕдиницаИзмерения = БазоваяЕдиницаИзмерения;
		КонецЕсли;
		
		СправочникОбъект.Коэффициент                 = ДанныеЗаполнения.factor;
		СправочникОбъект.Записать();
		
		Если ОформитьБазовуюЕдиницу Тогда
			СправочникОбъект.БазоваяЕдиницаИзмерения = СправочникОбъект.Ссылка;
			СправочникОбъект.Записать();
		КонецЕсли;
		
		ВывестиСообщение(НСтр("ru='Загружена единица: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
	КонецЕсли;
	
	Возврат СправочникОбъект.Ссылка;
	
КонецФункции // ЗагрузитьЕдиницуИзмерения()

Функция ПолучитьДанныеУпаковки(ИдентификаторУпаковки)
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "");
	Результат.Вставить("КодУпаковки",  "");
	
	МакетПараметров = Обработки.МодульОбменаВЕТИС.ПолучитьМакет("КлассификаторУпаковок");
	
	ВидыОбъектов = МакетПараметров.ПолучитьОбласть("СписокУпаковок");
	Для НомерСтроки=1 По ВидыОбъектов.ВысотаТаблицы Цикл
		
		Идентификатор = СокрЛП(ВидыОбъектов.Область(НомерСтроки,1).Текст);
		Если ИдентификаторУпаковки = Идентификатор Тогда
			
			Результат.Вставить("Наименование", СокрЛП(ВидыОбъектов.Область(НомерСтроки,2).Текст));
			Результат.Вставить("КодУпаковки",  СокрЛП(ВидыОбъектов.Область(НомерСтроки,3).Текст));
			
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ПолучитьДанныеУпаковки()

Функция ЗагрузитьПродукцию(НастройкаПодключения, ПараметрыЗапроса = Неопределено, Знач ДанныеЗаполнения, ТипПродукции) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат Справочники.ПродукцияВЕТИС.ПустаяСсылка();
	КонецЕсли;
	
	Если ПараметрыЗапроса = Неопределено Тогда
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
		ПараметрыЗапроса.ИмяСправочника = "ПродукцияВЕТИС";
		ПараметрыЗапроса.АдресРесурса   = "platform/services/2.1/ProductService";
		ПараметрыЗапроса.ИмяЭлемента    = "Product";
		ПараметрыЗапроса.Вставить("Группа", Истина);
	КонецЕсли;
	
	РезультатПроверки = ПроверкаДанныхЗаполнения(ДанныеЗаполнения, НастройкаПодключения, ПараметрыЗапроса);
	
	Если РезультатПроверки = Неопределено Тогда
		СправочникОбъект = Справочники.ПродукцияВЕТИС.СоздатьГруппу();
		СправочникОбъект.Код          = ДанныеЗаполнения.guid;
		СправочникОбъект.ИдентификаторЗаписи = ДанныеЗаполнения.uuid;
		СправочникОбъект.Наименование = ДанныеЗаполнения.guid;
		СправочникОбъект.Родитель     = ТипПродукции;
		СправочникОбъект.ТипПродукции = ТипПродукции;
		СправочникОбъект.УровеньВложенности = 2;
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружена продукция: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		Возврат СправочникОбъект.Ссылка;
	КонецЕсли;
	
	СправочникОбъект = РезультатПроверки.СправочникОбъект;
	Если РезультатПроверки.ЗаполнитьПодДаннымЗаполнения Тогда
	
		СправочникОбъект.Код                    = ДанныеЗаполнения.guid;
		СправочникОбъект.Наименование           = ДанныеЗаполнения.name;
		СправочникОбъект.НаименованиеПолное     = ДанныеЗаполнения.name;
		СправочникОбъект.Родитель               = ТипПродукции;
		СправочникОбъект.ИдентификаторЗаписи    = ДанныеЗаполнения.uuid;
		СправочникОбъект.КодПоТНВЭД             = ДанныеЗаполнения.code;
		СправочникОбъект.ТипПродукции           = ТипПродукции;
		СправочникОбъект.НаименованиеАнглийское = ДанныеЗаполнения.englishName;
		СправочникОбъект.УровеньВложенности     = 2;
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружена продукция: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		СправочникОбъект = СправочникОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат СправочникОбъект;
	
КонецФункции // ЗагрузитьПродукцию()

Функция ЗагрузитьВидПродукции(НастройкаПодключения, ПараметрыЗапроса = Неопределено, Знач ДанныеЗаполнения, ТипПродукции, Продукция) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат Справочники.ПродукцияВЕТИС.ПустаяСсылка();
	КонецЕсли;
	
	Если ПараметрыЗапроса = Неопределено Тогда
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
		ПараметрыЗапроса.ИмяСправочника = "ПродукцияВЕТИС";
		ПараметрыЗапроса.АдресРесурса   = "platform/services/2.1/ProductService";
		ПараметрыЗапроса.ИмяЭлемента    = "SubProduct";
		ПараметрыЗапроса.Вставить("Группа", Истина);
	КонецЕсли;
	
	РезультатПроверки = ПроверкаДанныхЗаполнения(ДанныеЗаполнения, НастройкаПодключения, ПараметрыЗапроса);
	
	Если РезультатПроверки = Неопределено Тогда
		СправочникОбъект = Справочники.ПродукцияВЕТИС.СоздатьГруппу();
		СправочникОбъект.Код          = ДанныеЗаполнения.guid;
		СправочникОбъект.ИдентификаторЗаписи = ДанныеЗаполнения.uuid;
		СправочникОбъект.Наименование = ДанныеЗаполнения.guid;
		СправочникОбъект.Родитель     = Продукция;
		СправочникОбъект.ТипПродукции = ТипПродукции;
		СправочникОбъект.Продукция    = Продукция;
		СправочникОбъект.УровеньВложенности = 3;
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружен вид продукции: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		Возврат СправочникОбъект.Ссылка;
		
	КонецЕсли;
	
	СправочникОбъект = РезультатПроверки.СправочникОбъект;
	Если РезультатПроверки.ЗаполнитьПодДаннымЗаполнения Тогда
		
		СправочникОбъект.Код                    = ДанныеЗаполнения.guid;
		СправочникОбъект.Наименование           = ДанныеЗаполнения.name;
		СправочникОбъект.НаименованиеПолное     = ДанныеЗаполнения.name;
		СправочникОбъект.ИдентификаторЗаписи    = ДанныеЗаполнения.uuid;
		СправочникОбъект.КодПоТНВЭД             = ДанныеЗаполнения.code;
		СправочникОбъект.ТипПродукции           = ТипПродукции;
		СправочникОбъект.Родитель               = Продукция;
		СправочникОбъект.НаименованиеАнглийское = ДанныеЗаполнения.englishName;
		СправочникОбъект.Продукция              = Продукция;
		СправочникОбъект.УровеньВложенности     = 3;
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружен вид продукции: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		СправочникОбъект = СправочникОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат СправочникОбъект;
	
КонецФункции // ЗагрузитьВидПродукции()

Функция ЗагрузитьНаименованиеПродукции(НастройкаПодключения, ПараметрыЗапроса = Неопределено, Знач ДанныеЗаполнения, ТипПродукции = Неопределено, Продукция = Неопределено, ВидПродукции = Неопределено) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат Справочники.ПродукцияВЕТИС.ПустаяСсылка();
	КонецЕсли;
	
	Если ПараметрыЗапроса = Неопределено Тогда
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
		ПараметрыЗапроса.ИмяСправочника = "ПродукцияВЕТИС";
		ПараметрыЗапроса.АдресРесурса   = "platform/services/2.1/ProductService";
		ПараметрыЗапроса.ИмяЭлемента    = "ProductItem";
	КонецЕсли;
	
	РезультатПроверки = ПроверкаДанныхЗаполнения(ДанныеЗаполнения, НастройкаПодключения, ПараметрыЗапроса);
	
	Если РезультатПроверки = Неопределено И ЗначениеЗаполнено(ДанныеЗаполнения.name) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ПродукцияВЕТИС.Ссылка
		|ИЗ
		|	Справочник.ПродукцияВЕТИС КАК ПродукцияВЕТИС
		|ГДЕ
		|	ПродукцияВЕТИС.ПометкаУдаления = Ложь И 
		|	ПродукцияВЕТИС.НаименованиеПолное = &Наименование И 
		|	ПродукцияВЕТИС.НеЗарегистрирована = Истина И 
		|	ПродукцияВЕТИС.УровеньВложенности = 4" + ?(ВидПродукции = Неопределено, "", " И
		|	ПродукцияВЕТИС.Родитель = &ВидПродукции") + "
		|";
		
		Если СтрДлина(ДанныеЗаполнения.name) > 255 Тогда
			ДанныеЗаполнения.name = СокрЛП(Лев(ДанныеЗаполнения.name, 255));
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Наименование", ДанныеЗаполнения.name);
		Запрос.УстановитьПараметр("ВидПродукции", ВидПродукции);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		ИначеЕсли ВидПродукции = Неопределено Тогда
			Возврат Неопределено;
		Иначе
			
			Если Продукция = Неопределено Тогда
				Продукция = ЗагрузитьПродукцию(НастройкаПодключения,, ДанныеЗаполнения.product, ТипПродукции);
			КонецЕсли;
			
			Если ВидПродукции = Неопределено Тогда
				ВидПродукции = ЗагрузитьВидПродукции(НастройкаПодключения,, ДанныеЗаполнения.subProduct, ТипПродукции, Продукция);
			КонецЕсли;
			
			УникальныйКод = Новый УникальныйИдентификатор();
			СправочникОбъект = Справочники.ПродукцияВЕТИС.СоздатьЭлемент();
			СправочникОбъект.Код                    = УникальныйКод;
			СправочникОбъект.Наименование           = СокрЛП(ДанныеЗаполнения.name);
			СправочникОбъект.НаименованиеПолное     = СокрЛП(ДанныеЗаполнения.name);
			СправочникОбъект.ИдентификаторЗаписи    = УникальныйКод;
			СправочникОбъект.ТипПродукции           = ТипПродукции;
			СправочникОбъект.Продукция              = Продукция;
			СправочникОбъект.Родитель               = ВидПродукции;
			СправочникОбъект.НеЗарегистрирована     = Истина;
			СправочникОбъект.УровеньВложенности     = 4;
			СправочникОбъект.ФасовкаКоличествоЕдиницВУпаковке = 1;
			СправочникОбъект.Записать();
			
			ВывестиСообщение(НСтр("ru='Загружено наименование продукции: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование, СправочникОбъект.Код);
			
			Возврат СправочникОбъект.Ссылка;
			
		КонецЕсли;
		
	ИначеЕсли РезультатПроверки = Неопределено Тогда
		
		Если Продукция = Неопределено Тогда
			Продукция = ЗагрузитьПродукцию(НастройкаПодключения,, ДанныеЗаполнения.product, ТипПродукции);
		КонецЕсли;
		
		Если ВидПродукции = Неопределено Тогда
			ВидПродукции = ЗагрузитьВидПродукции(НастройкаПодключения,, ДанныеЗаполнения.subProduct, ТипПродукции, Продукция);
		КонецЕсли;
		
		СправочникОбъект = Справочники.ПродукцияВЕТИС.СоздатьЭлемент();
		СправочникОбъект.Код          = ДанныеЗаполнения.guid;
		СправочникОбъект.Наименование = ДанныеЗаполнения.guid;
		СправочникОбъект.Родитель     = ВидПродукции;
		СправочникОбъект.ТипПродукции = ТипПродукции;
		СправочникОбъект.Продукция    = Продукция;
		СправочникОбъект.ВидПродукции = ВидПродукции;
		СправочникОбъект.УровеньВложенности = 4;
		СправочникОбъект.ФасовкаКоличествоЕдиницВУпаковке = 1;
		СправочникОбъект.Записать();
		Возврат СправочникОбъект.Ссылка;
	КонецЕсли;
	
	СправочникОбъект = РезультатПроверки.СправочникОбъект;
	Если РезультатПроверки.ЗаполнитьПодДаннымЗаполнения Тогда
		
		Если ТипПродукции = Неопределено Тогда
			ТипПродукции = Справочники.ПродукцияВЕТИС.НайтиПоКоду(ДанныеЗаполнения.productType, Истина);
		КонецЕсли;
		
		Если Продукция = Неопределено Тогда
			Продукция = ЗагрузитьПродукцию(НастройкаПодключения,, ДанныеЗаполнения.product, ТипПродукции);
		КонецЕсли;
		
		Если ВидПродукции = Неопределено Тогда
			ВидПродукции = ЗагрузитьВидПродукции(НастройкаПодключения,, ДанныеЗаполнения.subProduct, ТипПродукции, Продукция);
		КонецЕсли;
		
		СправочникОбъект.Код                    = ДанныеЗаполнения.guid;
		СправочникОбъект.Наименование           = ДанныеЗаполнения.name;
		СправочникОбъект.НаименованиеПолное     = ДанныеЗаполнения.name;
		СправочникОбъект.ИдентификаторЗаписи    = ДанныеЗаполнения.uuid;
		СправочникОбъект.Артикул                = ДанныеЗаполнения.code;
		СправочникОбъект.ТипПродукции           = ТипПродукции;
		СправочникОбъект.Продукция              = Продукция;
		СправочникОбъект.Родитель               = ВидПродукции;
		СправочникОбъект.СоответствуетГОСТу     = ДанныеЗаполнения.correspondsToGost;
		СправочникОбъект.ГОСТ                   = ДанныеЗаполнения.gost;
		СправочникОбъект.УровеньВложенности     = 4;
		
		packaging = ДанныеЗаполнения.packaging;
		Если ЗначениеЗаполнено(packaging) Тогда
			packagingType = packaging.packagingType;
			Если ЗначениеЗаполнено(packagingType) Тогда
				Если ЗначениеЗаполнено(packagingType.guid) Тогда
					СправочникОбъект.ФасовкаУпаковка = ЗагрузитьТипУпаковки(packagingType.guid);
				Иначе
					СправочникОбъект.ФасовкаУпаковка = Справочники.УпаковкиВЕТИС.НайтиПоНаименованию(packagingType.name, Истина);
				КонецЕсли;
			КонецЕсли;
			
			СправочникОбъект.ФасовкаКоличествоУпаковок = packaging.quantity;
			СправочникОбъект.ФасовкаКоличествоЕдиницВУпаковке = packaging.volume;
			unit = packaging.unit;
			Если Не unit = Неопределено Тогда
				СправочникОбъект.ФасовкаЕдиницаИзмерения   = ЗагрузитьЕдиницуИзмерения(НастройкаПодключения,, unit);
			КонецЕсли;
		Иначе
			СправочникОбъект.ФасовкаКоличествоЕдиницВУпаковке = 1;
		КонецЕсли;
		
		Если СправочникОбъект.ФасовкаКоличествоЕдиницВУпаковке = 0 Тогда
			СправочникОбъект.ФасовкаКоличествоЕдиницВУпаковке = 1;
		КонецЕсли;
		
		Площадки = ДанныеЗаполнения.producing;
		Если ЗначениеЗаполнено(Площадки) Тогда
			СправочникОбъект.Площадки.Очистить();
			Для Каждого ТекущаяПлощадка Из Площадки Цикл
				Площадка = ЗагрузитьПредприятие(НастройкаПодключения,, ТекущаяПлощадка.location);
				Если Не ЗначениеЗаполнено(Площадка) Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока = СправочникОбъект.Площадки.Добавить();
				НоваяСтрока.Площадка = Площадка;
			КонецЦикла;
		КонецЕсли;
		
		СправочникОбъект.ХозяйствующийСубъект = ЗагрузитьХозяйствующийСубъект(НастройкаПодключения,,ДанныеЗаполнения.producer);
		СправочникОбъект.ВладелецМарки        = ЗагрузитьХозяйствующийСубъект(НастройкаПодключения,,ДанныеЗаполнения.tmOwner);
		СправочникОбъект.GTIN                 = ДанныеЗаполнения.globalID;
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружено наименование продукции: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		СправочникОбъект = СправочникОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат СправочникОбъект;
	
КонецФункции // ЗагрузитьНаименованиеПродукции()

Функция ЗагрузитьСтрану(НастройкаПодключения, ПараметрыЗапроса = Неопределено, ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат Справочники.СтраныВЕТИС.ПустаяСсылка();
	КонецЕсли;
	
	Если ПараметрыЗапроса = Неопределено Тогда
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
		ПараметрыЗапроса.ИмяСправочника = "СтраныВЕТИС";
		ПараметрыЗапроса.АдресРесурса = "platform/services/2.1/IkarService";
		ПараметрыЗапроса.ИмяЭлемента = "Country";
	КонецЕсли;
	
	РезультатПроверки = ПроверкаДанныхЗаполнения(ДанныеЗаполнения, НастройкаПодключения, ПараметрыЗапроса);
	
	Если РезультатПроверки = Неопределено Тогда
		СправочникОбъект = Справочники[ПараметрыЗапроса.ИмяСправочника].СоздатьЭлемент();
		СправочникОбъект.Код          = ДанныеЗаполнения.guid;
		СправочникОбъект.ИдентификаторЗаписи = ДанныеЗаполнения.uuid;
		СправочникОбъект.Наименование = ДанныеЗаполнения.guid;
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружена страна: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		Возврат СправочникОбъект.Ссылка;
	КонецЕсли;
	
	СправочникОбъект = РезультатПроверки.СправочникОбъект;
	Если РезультатПроверки.ЗаполнитьПодДаннымЗаполнения Тогда
		
		СправочникОбъект.Код                 = ДанныеЗаполнения.guid;
		СправочникОбъект.Наименование        = ДанныеЗаполнения.name;
		СправочникОбъект.НаименованиеПолное  = ?(ПустаяСтрока(ДанныеЗаполнения.fullName), ДанныеЗаполнения.name, ДанныеЗаполнения.fullName);
		СправочникОбъект.ИдентификаторЗаписи = ДанныеЗаполнения.uuid;
		СправочникОбъект.НаименованиеАнглийское = ДанныеЗаполнения.englishName;
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружена страна: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		СправочникОбъект = СправочникОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат СправочникОбъект;
	
КонецФункции

Функция ЗагрузитьРегион(НастройкаПодключения, ПараметрыЗапроса = Неопределено, ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат Справочники.РегионыВЕТИС.ПустаяСсылка();
	КонецЕсли;
	
	Если ПараметрыЗапроса = Неопределено Тогда
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
		ПараметрыЗапроса.ИмяСправочника = "РегионыВЕТИС";
		ПараметрыЗапроса.АдресРесурса = "platform/services/2.1/IkarService";
		ПараметрыЗапроса.ИмяЭлемента = "Region";
	КонецЕсли;
	
	РезультатПроверки = ПроверкаДанныхЗаполнения(ДанныеЗаполнения, НастройкаПодключения, ПараметрыЗапроса);
	
	Если РезультатПроверки = Неопределено Тогда
		СправочникОбъект = Справочники[ПараметрыЗапроса.ИмяСправочника].СоздатьЭлемент();
		СправочникОбъект.Код          = ДанныеЗаполнения.guid;
		СправочникОбъект.ИдентификаторЗаписи = ДанныеЗаполнения.uuid;
		СправочникОбъект.Наименование = ДанныеЗаполнения.guid;
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружен регион: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		Возврат СправочникОбъект.Ссылка;
	КонецЕсли;
	
	СправочникОбъект = РезультатПроверки.СправочникОбъект;
	Если РезультатПроверки.ЗаполнитьПодДаннымЗаполнения Тогда
		
		СправочникОбъект.Код			= ДанныеЗаполнения.guid;
		СправочникОбъект.Страна			= Справочники.СтраныВЕТИС.НайтиПоКоду(ДанныеЗаполнения.countryGuid);
		СправочникОбъект.Наименование	= ДанныеЗаполнения.name;
		СправочникОбъект.НаименованиеПолное	= ДанныеЗаполнения.view;
		СправочникОбъект.НаименованиеАнглийское	= ДанныеЗаполнения.englishName;
		СправочникОбъект.ИдентификаторЗаписи	= ДанныеЗаполнения.uuid;
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружен регион: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		СправочникОбъект = СправочникОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат СправочникОбъект;
	
КонецФункции // ЗагрузитьРегион()

Функция ПолучитьОбъектПоДаннымКлассификатора(ИмяСправочника, ДанныеОбъекта, НайденнаяСсылка = Неопределено, СозданиеНовогоЭлемента = Ложь, ВозвращатьНеИзмененныйОбъект = Ложь)
	
	Идентификатор       = ПолучитьЗначениеПараметраСтруктуры(ДанныеОбъекта, "guid", "");
	ИдентификаторВерсии = ПолучитьЗначениеПараметраСтруктуры(ДанныеОбъекта, "uuid", "");
	
	Результат = Неопределено;
	
	// Выполним поиск по guid.
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		НайденнаяСсылка = Справочники[ИмяСправочника].НайтиПоКоду(Идентификатор);
	КонецЕсли;
	
	// Выполним поиск по uuid.
	Если НЕ ЗначениеЗаполнено(НайденнаяСсылка) И ЗначениеЗаполнено(ИдентификаторВерсии) Тогда
		НайденнаяСсылка = Справочники[ИмяСправочника].НайтиПоРеквизиту("ИдентификаторЗаписи", ИдентификаторВерсии);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Идентификатор) И НЕ ЗначениеЗаполнено(ИдентификаторВерсии) Тогда
		
		// Не пришел guid и uuid не ясно по какому признаку искать.
		Результат = Неопределено;
		НайденнаяСсылка = Неопределено;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		
		Если ПустаяСтрока(Идентификатор) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		УникальныйКод = Новый УникальныйИдентификатор(Идентификатор);
		НоваяСсылка   = Справочники[ИмяСправочника].ПолучитьСсылку(УникальныйКод);
		
		Если ЗначениеЗаполнено(НоваяСсылка) Тогда
			Результат = НоваяСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		Если Результат = Неопределено Тогда
			Результат = Справочники[ИмяСправочника].СоздатьЭлемент();
			Результат.УстановитьСсылкуНового(НоваяСсылка);
			СозданиеНовогоЭлемента = Истина;
		ИначеЕсли Результат.ИдентификаторЗаписи = ИдентификаторВерсии Тогда
			НайденнаяСсылка = НоваяСсылка;
			Если НЕ ВозвращатьНеИзмененныйОбъект Тогда
				Результат = Неопределено;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ИдентификаторВерсии) И НайденнаяСсылка.ИдентификаторЗаписи = ИдентификаторВерсии Тогда
		
		Если ВозвращатьНеИзмененныйОбъект Тогда
			Результат = НайденнаяСсылка.ПолучитьОбъект();
		Иначе
			Результат = Неопределено;
		КонецЕсли;
		
	Иначе
		
		Результат = НайденнаяСсылка.ПолучитьОбъект();
		Если НЕ ВозвращатьНеИзмененныйОбъект Тогда
			НайденнаяСсылка = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьУсловиеРегионализации(НастройкаПодключения, ПараметрыЗапроса = Неопределено, ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат Справочники.УсловияПеремещенияВЕТИС.ПустаяСсылка();
	КонецЕсли;
	
	НайденнаяСсылка = Неопределено;
	СозданиеНовогоЭлемента = Ложь;
	СправочникОбъект = ПолучитьОбъектПоДаннымКлассификатора("УсловияПеремещенияВЕТИС", ДанныеЗаполнения, НайденнаяСсылка,СозданиеНовогоЭлемента);
	Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
		Возврат НайденнаяСсылка;
	ИначеЕсли СправочникОбъект = Неопределено Тогда
		ВывестиСообщение(НСтр("ru='Не удалось загрузить условие перемещения: <%1>.'"),,,,, ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "guid", "неизвестный"));
		Возврат Справочники.УсловияПеремещенияВЕТИС.ПустаяСсылка();
	КонецЕсли; 
	
	Идентификатор       = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "guid", "");
	ИдентификаторЗаписи = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "uuid", "");
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		СправочникОбъект.Код = Идентификатор;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторЗаписи) Тогда
		СправочникОбъект.ИдентификаторЗаписи = ИдентификаторЗаписи;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.text) Тогда
		НаименованиеУсловия = ДанныеЗаполнения.text;
		Если СтрДлина(НаименованиеУсловия) > 50 Тогда
			НаименованиеУсловия = Лев(НаименованиеУсловия, 48) + "..";
		КонецЕсли;
		СправочникОбъект.Наименование        = НаименованиеУсловия;
		СправочникОбъект.ФормулировкаУсловия = ДанныеЗаполнения.text;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.referenceNumber) Тогда
		СправочникОбъект.НомерУсловия = ДанныеЗаполнения.referenceNumber;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.strict) Тогда
		СправочникОбъект.ОбязательноСоблюдение = ДанныеЗаполнения.strict;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.relatedDisease) Тогда
		Для каждого relatedDisease Из ДанныеЗаполнения.relatedDisease Цикл
			НовСтрокаЗаболевание = СправочникОбъект.СписокЗаболеваний.Добавить();
			НовСтрокаЗаболевание.Заболевание = ЗагрузитьЗаболевание(НастройкаПодключения,, relatedDisease);
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		СправочникОбъект.Записать();
		Ссылка = СправочникОбъект.Ссылка;
	Исключение
		Ссылка = Справочники.УсловияПеремещенияВЕТИС.ПустаяСсылка();
	КонецПопытки;
	
	Если СозданиеНовогоЭлемента Тогда
		ВывестиСообщение(НСтр("ru='Загружено условие перемещения: <%1>, код: <%2>.'"),,,,, СправочникОбъект.Наименование, СправочникОбъект.Код);
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции // ЗагрузитьУсловиеРегионализации()

Функция ЗагрузитьЗаболевание(НастройкаПодключения, ПараметрыЗапроса = Неопределено, ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат Справочники.ЗаболеванияВЕТИС.ПустаяСсылка();
	КонецЕсли;
	
	Если ПараметрыЗапроса = Неопределено Тогда
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
		ПараметрыЗапроса.ИмяСправочника = "ЗаболеванияВЕТИС";
		ПараметрыЗапроса.АдресРесурса = "platform/services/2.1/IkarService";
		ПараметрыЗапроса.ИмяЭлемента = "Disease";
	КонецЕсли;
	
	РезультатПроверки = ПроверкаДанныхЗаполнения(ДанныеЗаполнения, НастройкаПодключения, ПараметрыЗапроса);
	
	Если РезультатПроверки = Неопределено Тогда
		СправочникОбъект = Справочники[ПараметрыЗапроса.ИмяСправочника].СоздатьЭлемент();
		СправочникОбъект.Код          = ДанныеЗаполнения.guid;
		СправочникОбъект.ИдентификаторЗаписи = ДанныеЗаполнения.uuid;
		СправочникОбъект.Наименование = ДанныеЗаполнения.guid;
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружено заболевание: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		Возврат СправочникОбъект.Ссылка;
	КонецЕсли;
	
	СправочникОбъект = РезультатПроверки.СправочникОбъект;
	Если РезультатПроверки.ЗаполнитьПодДаннымЗаполнения Тогда
		СправочникОбъект.Код                 = ДанныеЗаполнения.guid;
		СправочникОбъект.Наименование        = ДанныеЗаполнения.name;
		СправочникОбъект.ИдентификаторЗаписи = ДанныеЗаполнения.uuid;
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружено заболевание: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		СправочникОбъект = СправочникОбъект.Ссылка;
	КонецЕсли;
	
	Возврат СправочникОбъект;
	
КонецФункции

Функция ЗагрузитьНазначениеГруза(НастройкаПодключения, ПараметрыЗапроса = Неопределено, ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат Справочники.НазначенияГрузаВЕТИС.ПустаяСсылка();
	КонецЕсли;
	
	Если ПараметрыЗапроса = Неопределено Тогда
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
		ПараметрыЗапроса.ИмяСправочника = "НазначенияГрузаВЕТИС";
		ПараметрыЗапроса.АдресРесурса = "platform/services/2.1/DictionaryService";
		ПараметрыЗапроса.ИмяЭлемента = "Purpose";
	КонецЕсли;
	
	РезультатПроверки = ПроверкаДанныхЗаполнения(ДанныеЗаполнения, НастройкаПодключения, ПараметрыЗапроса);
	
	Если РезультатПроверки = Неопределено Тогда
		СправочникОбъект = Справочники[ПараметрыЗапроса.ИмяСправочника].СоздатьЭлемент();
		СправочникОбъект.Код                 = ДанныеЗаполнения.guid;
		СправочникОбъект.Наименование        = ДанныеЗаполнения.name;
		СправочникОбъект.НаименованиеПолное  = ДанныеЗаполнения.name;
		СправочникОбъект.ИдентификаторЗаписи = ДанныеЗаполнения.uuid;
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружено назначение груза: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		Возврат СправочникОбъект.Ссылка;
	КонецЕсли;
	
	СправочникОбъект = РезультатПроверки.СправочникОбъект;
	Если РезультатПроверки.ЗаполнитьПодДаннымЗаполнения Тогда
		СправочникОбъект.Код                               = ДанныеЗаполнения.guid;
		СправочникОбъект.Наименование                      = ДанныеЗаполнения.name;
		СправочникОбъект.НаименованиеПолное                = ДанныеЗаполнения.name;
		СправочникОбъект.ИдентификаторЗаписи               = ДанныеЗаполнения.uuid;
		СправочникОбъект.НазначениеДляНекачественныхГрузов = ДанныеЗаполнения.forSubstandard;
		СправочникОбъект.Записать();
		
		ВывестиСообщение(НСтр("ru='Загружено назначение груза: <%1>, код: <%2>.'"),,,,,СправочникОбъект.Наименование,СправочникОбъект.Код);
		
		СправочникОбъект = СправочникОбъект.Ссылка;
	КонецЕсли;
	
	Возврат СправочникОбъект;
	
КонецФункции

Функция ЗагрузитьТС(ДанныеТС, Личный) Экспорт
	
	Если ДанныеТС=Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТранспортныеСредства.Ссылка
	|ИЗ
	|	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
	|ГДЕ
	|	ТранспортныеСредства.ТипТС = &ТипТС И 
	|	ТранспортныеСредства.НомерТС = &НомерТС
	|";
	
	НомерныеДанные = ДанныеТС.transportNumber;
	transportType = ДанныеТС.transportType;
	
	ТипТС   = Неопределено;
	НомерТС = Неопределено;
	Если НомерныеДанные = Неопределено Тогда
		Возврат Неопределено;
	ИначеЕсли transportType = Неопределено Тогда
		Возврат Неопределено;
	ИначеЕсли transportType = 1 Тогда
		ТипТС   = Перечисления.ТипыТранспортаВЕТИС.Автомобильный;
		НомерТС = НомерныеДанные.vehicleNumber;
	ИначеЕсли transportType = 2 Тогда
		ТипТС   = Перечисления.ТипыТранспортаВЕТИС.Железнодорожный;
		НомерТС = НомерныеДанные.wagonNumber;
	ИначеЕсли transportType = 3 Тогда
		ТипТС   = Перечисления.ТипыТранспортаВЕТИС.Авиа;
		НомерТС = НомерныеДанные.flightNumber;
	ИначеЕсли transportType = 4 Тогда
		ТипТС   = Перечисления.ТипыТранспортаВЕТИС.МорскойКонтейнернаяПартия;
		НомерТС = НомерныеДанные.shipName;
	ИначеЕсли transportType = 5 Тогда
		ТипТС   = Перечисления.ТипыТранспортаВЕТИС.МорскойТрюмнаяПартия;
		НомерТС = НомерныеДанные.shipName;
	ИначеЕсли transportType = 6 Тогда
		ТипТС   = Перечисления.ТипыТранспортаВЕТИС.Речной;
		НомерТС = НомерныеДанные.shipName;
	ИначеЕсли transportType = 7 Тогда
		ТипТС   = Перечисления.ТипыТранспортаВЕТИС.ПерегонСкота;
		НомерТС = "";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТипТС",   ТипТС);
	Запрос.УстановитьПараметр("НомерТС", НомерТС);
	
	СсылкаНаТС = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СсылкаНаТС = Выборка.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СсылкаНаТС) Тогда
		ОбъектТС = Справочники.ТранспортныеСредства.СоздатьЭлемент();
		ОбъектТС.Наименование = СокрЛП(ТипТС) + " " + СокрЛП(НомерТС);
		ОбъектТС.НомерТС = НомерТС;
		ОбъектТС.ТипТС   = ТипТС;
		ОбъектТС.Личный  = Личный;
		Попытка
			ОбъектТС.Записать();
			ВывестиСообщение(НСтр("ru='Загружено ТС: <%1>.'"),,,,,ОбъектТС.Наименование);
			СсылкаНаТС = ОбъектТС.Ссылка;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	СсылкаНаПрицеп = Неопределено;
	
	trailerNumber = НомерныеДанные.trailerNumber;
	Если ТипЗнч(trailerNumber) = Тип("Строка") И ЗначениеЗаполнено(trailerNumber) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ТранспортныеСредства.Ссылка
		|ИЗ
		|	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
		|ГДЕ
		|	ТранспортныеСредства.ТипТС = ЗНАЧЕНИЕ(Перечисление.ТипыТранспортаВЕТИС.Прицеп) И 
		|	ТранспортныеСредства.НомерТС = &НомерТС
		|";
		
		Запрос.УстановитьПараметр("НомерТС", trailerNumber);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СсылкаНаПрицеп = Выборка.Ссылка;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СсылкаНаПрицеп) Тогда
			ОбъектТС = Справочники.ТранспортныеСредства.СоздатьЭлемент();
			ОбъектТС.Наименование = "Прицеп" + " " + trailerNumber;
			ОбъектТС.НомерТС = trailerNumber;
			ОбъектТС.ТипТС   = Перечисления.ТипыТранспортаВЕТИС.Прицеп;
			ОбъектТС.Личный  = Личный;
			Попытка
				ОбъектТС.Записать();
				ВывестиСообщение(НСтр("ru='Загружен прицеп ТС: <%1>.'"),,,,,ОбъектТС.Наименование);
				СсылкаНаПрицеп = ОбъектТС.Ссылка;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
	containerNumber = НомерныеДанные.containerNumber;
	
	Результат = Новый Структура;
	Результат.Вставить("ТС",              СсылкаНаТС);
	Результат.Вставить("Прицеп",          СсылкаНаПрицеп);
	
	Если ТипЗнч(containerNumber) = Тип("Строка") Тогда
		Результат.Вставить("НомерКонтейнера", НомерныеДанные.containerNumber);
	Иначе
		Результат.Вставить("НомерКонтейнера", Неопределено);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиЗагрузитьВСД(ПараметрыОбмена, ХозяйствующийСубъект, Предприятие, uuidВСД)
	
	ВСДСсылка = Документы.ВСДВЕТИС.НайтиПоРеквизиту("Идентификатор", uuidВСД);
	
	Если ЗначениеЗаполнено(ВСДСсылка) Тогда
		Возврат ВСДСсылка;
	КонецЕсли;
	
	УникальныйКод = Новый УникальныйИдентификатор(uuidВСД);
	НоваяСсылка = Документы.ВСДВЕТИС.ПолучитьСсылку(УникальныйКод);
	
	ВСДОбъект = Неопределено;
	Если ЗначениеЗаполнено(НоваяСсылка) Тогда
		ВСДОбъект = НоваяСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если ВСДОбъект = Неопределено Тогда
		ВСДОбъект = Документы.ВСДВЕТИС.СоздатьДокумент();
		ВСДОбъект.УстановитьСсылкуНового(НоваяСсылка);
		ОрганизацияИПодразделение = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьОрганизациюИПодразделение(ХозяйствующийСубъект, Предприятие);
		ВСДОбъект.Организация           = ОрганизацияИПодразделение.Организация;
		ВСДОбъект.ПодразделениеКомпании = ОрганизацияИПодразделение.Подразделение;
		ВСДОбъект.Заполнить(Неопределено);
		ВСДОбъект.Организация           = ОрганизацияИПодразделение.Организация;
		ВСДОбъект.ПодразделениеКомпании = ОрганизацияИПодразделение.Подразделение;
		ВСДОбъект.Дата = ТекущаяДата();
		Попытка
			ВСДОбъект.Записать();
			ВывестиСообщение(НСтр("ru='Создан новый ВСД: <%1 № %2 от %3>'"),,,,,Строка(ВСДОбъект.ХозОперация), СокрЛП(ВСДОбъект.Номер), Формат(ВСДОбъект.Дата, "ДФ=dd.MM.yyyy"));
			
			ПодготовитьЗапросВСД(ПараметрыОбмена, ХозяйствующийСубъект, Предприятие, uuidВСД, Неопределено, Ложь);
			
			Результат = ВСДОбъект.Ссылка;
			
		Исключение
			ВывестиСообщение(НСтр("ru='Создан новый ВСД: <%1 № %2 от %3>'"),,,,,Строка(ВСДОбъект.ХозОперация), СокрЛП(ВСДОбъект.Номер), Формат(ВСДОбъект.Дата, "ДФ=dd.MM.yyyy"));
			Результат = Неопределено;
		КонецПопытки;
	Иначе
		Результат = ВСДОбъект.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВебНомерВСД(ВСД) Экспорт
	
	НомерВСД = "";
	
	Если ИнтеграцияВЕТИСВызовСервера.РежимТестовогоКонтура() Тогда
		ВебСоединение = Новый HTTPСоединение("t2-mercury.vetrf.ru",,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Иначе
		ВебСоединение = Новый HTTPСоединение("mercury.vetrf.ru",,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	КонецЕсли;
	
	АдресСкрипта = "/pub/operatorui?_language=ru&_action=showVetDocumentFormByUuid&uuid=" + ВСД.Идентификатор;
	
	Попытка
		ВебОтвет = ВебСоединение.Получить(Новый HTTPЗапрос(АдресСкрипта));
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат НомерВСД;
	КонецПопытки;
	
	Если ВебОтвет.КодСостояния <> 200 Тогда
		Возврат НомерВСД;
	Конецесли;
	
	Чтение = Новый ЧтениеHTML;
	Чтение.УстановитьСтроку(ВебОтвет.ПолучитьТелоКакСтроку());
	Построитель = Новый ПостроительDOM;
	Документ = Построитель.Прочитать(Чтение);
	
	СписокЭлементов = Документ.ПолучитьЭлементыПоИмени("div");
	Для Каждого Элемент Из СписокЭлементов Цикл
		АтрибутКласс = Элемент.ПолучитьАтрибут("class");
		Если АтрибутКласс<>Неопределено Тогда
			Если АтрибутКласс="profile-info-name" И Найти(Элемент.ТекстовоеСодержимое, "Номер ВСД") > 0 Тогда
				НомерВСД = Элемент.СледующийСоседний.ТекстовоеСодержимое;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НомерВСД;
	
КонецФункции

Функция ЗагрузитьВСД(НастройкаПодключения, ХозяйствующийСубъект, Предприятие, ДанныеВСД, ВСДСсылка = Неопределено, ИзменятьСтарый = Ложь, Знач ОбновитьГашениеВСД = Истина) Экспорт
	
	ДатаОбновления = ДанныеВСД.lastUpdateDate;
	
	type      = ДанныеВСД.vetDType;
	СтатусВСД = Перечисления.СтатусыВСДВЕТИС.ПолучитьЗначение(ДанныеВСД.vetDStatus);
	
	Если НЕ СтатусВСД = Перечисления.СтатусыВСДВЕТИС.UTILIZED Тогда
		ОбновитьГашениеВСД = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВСДСсылка) Тогда
		ВСДСсылка = Документы.ВСДВЕТИС.НайтиПоРеквизиту("Идентификатор", ДанныеВСД.uuid);
	КонецЕсли;
	
	НовыйВСД = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ВСДСсылка) Тогда
		
		УникальныйКод = Новый УникальныйИдентификатор(ДанныеВСД.uuid);
		НоваяСсылка = Документы.ВСДВЕТИС.ПолучитьСсылку(УникальныйКод);
		
		ВСДОбъект = Неопределено;
		Если ЗначениеЗаполнено(НоваяСсылка) Тогда
			ВСДОбъект = НоваяСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		Если ВСДОбъект = Неопределено Тогда
			ВСДОбъект = Документы.ВСДВЕТИС.СоздатьДокумент();
			ВСДОбъект.УстановитьСсылкуНового(НоваяСсылка);
			ОрганизацияИПодразделение = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьОрганизациюИПодразделение(ХозяйствующийСубъект, Предприятие);
			//ВСДОбъект.Организация           = ОрганизацияИПодразделение.Организация;
			//ВСДОбъект.ПодразделениеКомпании = ОрганизацияИПодразделение.Подразделение;
			ВСДОбъект.Заполнить(Неопределено);
			ВСДОбъект.Организация           = ОрганизацияИПодразделение.Организация;
			ВСДОбъект.ПодразделениеКомпании = ОрганизацияИПодразделение.Подразделение;
			Документы.ВСДВЕТИС.ПодразделениеКомпанииПриИзменении(ВСДОбъект);
			//ВСДОбъект.Дата = ТекущаяДата();
			НовыйВСД = Истина;
			ОбновитьГашениеВСД = Ложь;
		Иначе
			
			Если НЕ ИзменятьСтарый И ВСДОбъект.ДатаОбновления = ДатаОбновления Тогда
				Возврат ВСДОбъект.Ссылка;
			ИначеЕсли НЕ ИзменятьСтарый И ВСДОбъект.Статус = СтатусВСД И (type = "TRANSPORT" ИЛИ type = "RETURNABLE") Тогда
				Возврат ВСДОбъект.Ссылка;
			КонецЕсли;
			
		КонецЕсли;
		
	//ИначеЕсли ВСДСсылка.ДатаОбновления < ДатаОбновления Тогда
	Иначе
		
		Если НЕ ИзменятьСтарый И ВСДСсылка.ДатаОбновления = ДатаОбновления Тогда
			Возврат ВСДСсылка;
		ИначеЕсли НЕ ИзменятьСтарый И ВСДСсылка.Статус = СтатусВСД И (type = "TRANSPORT" ИЛИ type = "RETURNABLE") Тогда
			Возврат ВСДСсылка;
		КонецЕсли;
		
		ВСДОбъект = ВСДСсылка.ПолучитьОбъект();
		
	КонецЕсли;
	
	Если (Не ЗначениеЗаполнено(ВСДОбъект.Организация)) ИЛИ (Не ЗначениеЗаполнено(ВСДОбъект.ПодразделениеКомпании)) Тогда
		ОрганизацияИПодразделение = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьОрганизациюИПодразделение(ХозяйствующийСубъект, Предприятие);
		
		Если Не ЗначениеЗаполнено(ВСДОбъект.Организация) Тогда
			ВСДОбъект.Организация = ОрганизацияИПодразделение.Организация;
			Документы.ВСДВЕТИС.ОрганизацияПриИзменении(ВСДОбъект);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВСДОбъект.ПодразделениеКомпании) Тогда
			ВСДОбъект.ПодразделениеКомпании = ОрганизацияИПодразделение.Подразделение;
			Документы.ВСДВЕТИС.ПодразделениеКомпанииПриИзменении(ВСДОбъект);
		КонецЕсли;
	КонецЕсли;

	ВСДОбъект.Идентификатор  = ДанныеВСД.uuid;
	ВСДОбъект.Тип            = type;
	ВСДОбъект.ХозОперация    = ПолучитьХозОперациюВСД(ВСДОбъект.Тип);
	ВСДОбъект.Статус         = СтатусВСД;
	ВСДОбъект.ДатаОбновления = ДатаОбновления;
	ВСДОбъект.Закрыт         = ДанныеВСД.finalized;
	ВСДОбъект.Форма          = Перечисления.ФормыВСДВЕТИС.ПолучитьЗначение(ДанныеВСД.vetDForm);
	
	// Блок authentication
	r13nClause = Неопределено;
	authentication = ДанныеВСД.authentication;
	
	cargoInspected = authentication.cargoInspected;
	Если Не cargoInspected = Неопределено Тогда
		ВСДОбъект.ВыполненКонтрольГосВетВрачем = cargoInspected;
	КонецЕсли;
	ВСДОбъект.ЭкспертизаРезультат = Перечисления.РезультатыИсследованияВЕТИС.ПолучитьЗначение(authentication.cargoExpertized);
	
	ОсобыеОтметки                          = authentication.specialMarks;
	ВСДОбъект.ОсобыеОтметки                = ОсобыеОтметки;
	purpose               = authentication.purpose;
	БлагополучиеМестности = authentication.locationProsperity;
	//laboratoryResearch = authentication.laboratoryResearch");
	//quarantine = authentication.quarantine");
	//immunization = authentication.immunization");
	r13nClause = authentication.r13nClause;
	
	Если НЕ purpose = Неопределено Тогда
		ВСДОбъект.НазначениеГруза = ЗагрузитьНазначениеГруза(НастройкаПодключения,, purpose);
	КонецЕсли;
	
	БлагополучиеМестностиСсылка = Справочники.БлагополучиеМестностиВЕТИС.НайтиПоНаименованию(БлагополучиеМестности);
	Если Не ЗначениеЗаполнено(БлагополучиеМестностиСсылка) И ЗначениеЗаполнено(БлагополучиеМестности) Тогда
		БлагополучиеМестностиОбъект = Справочники.БлагополучиеМестностиВЕТИС.СоздатьЭлемент();
		БлагополучиеМестностиОбъект.Наименование = БлагополучиеМестности;
		БлагополучиеМестностиОбъект.Записать();
		ВывестиСообщение(НСтр("ru='Создано новое благополучие местности: <%1>'"),,,,, БлагополучиеМестностиОбъект.Наименование);
		БлагополучиеМестностиСсылка = БлагополучиеМестностиОбъект.Ссылка;
	КонецЕсли;
	ВСДОбъект.БлагополучиеМестности  = БлагополучиеМестностиСсылка;
	
	Если НЕ r13nClause = Неопределено Тогда
		ВСДОбъект.УсловияПеремещенияПродукции.Очистить();
		Для Каждого r13nClause Из r13nClause Цикл
			НовСтрокаУсловияПеремещения = ВСДОбъект.УсловияПеремещенияПродукции.Добавить();
			НовСтрокаУсловияПеремещения.УсловиеПеремещения = ЗагрузитьУсловиеРегионализации(НастройкаПодключения,, r13nClause.condition);
		КонецЦикла;
	КонецЕсли;
	
	// Блок certifiedConsignment
	certifiedConsignment = ДанныеВСД.certifiedConsignment;
	Если certifiedConsignment = Неопределено Тогда
		certifiedConsignment = ДанныеВСД.certifiedBatch;
	КонецЕсли;
	
	consignor = ПолучитьЗначениеПараметраСтруктуры(certifiedConsignment, "consignor", Неопределено);
	Если consignor = Неопределено Тогда
		ВСДОбъект.Отправитель            = ХозяйствующийСубъект;
		ВСДОбъект.ПредприятиеОтправитель = Предприятие;
	Иначе
		ВСДОбъект.Отправитель    = ЗагрузитьХозяйствующийСубъект(НастройкаПодключения,, consignor.businessEntity);
		enterprise = certifiedConsignment.consignor.enterprise;
		Если НЕ enterprise = Неопределено Тогда
			ВСДОбъект.ПредприятиеОтправитель = ЗагрузитьПредприятие(НастройкаПодключения,, enterprise);
		КонецЕсли;
	КонецЕсли;
	
	consignee = ПолучитьЗначениеПараметраСтруктуры(certifiedConsignment, "consignee", Неопределено);
	Если НЕ consignee = Неопределено Тогда
		ВСДОбъект.Получатель             = ЗагрузитьХозяйствующийСубъект(НастройкаПодключения,, consignee.businessEntity);
		
		enterprise = consignee.enterprise;
		Если НЕ enterprise = Неопределено Тогда
			ВСДОбъект.ПредприятиеПолучатель = ЗагрузитьПредприятие(НастройкаПодключения,, enterprise);
		КонецЕсли;
	КонецЕсли;
	
	broker = ПолучитьЗначениеПараметраСтруктуры(certifiedConsignment, "broker", Неопределено);
	Если НЕ broker = Неопределено Тогда
		ВСДОбъект.Посредник          = ЗагрузитьХозяйствующийСубъект(НастройкаПодключения,, broker);
	КонецЕсли;
	
	transportInfo = ПолучитьЗначениеПараметраСтруктуры(certifiedConsignment, "transportInfo", Неопределено);
	Если НЕ transportInfo = Неопределено Тогда
		ДанныеПоТС = ЗагрузитьТС(transportInfo, ВСДОбъект.Отправитель.Собственный);
		
		ВСДОбъект.ТранспортноеСредство = ДанныеПоТС.ТС;
		ВСДОбъект.Прицеп               = ДанныеПоТС.Прицеп;
		ВСДОбъект.НомерКонтейнера      = ДанныеПоТС.НомерКонтейнера;
	КонецЕсли;
	
	transportStorageType = ПолучитьЗначениеПараметраСтруктуры(certifiedConsignment, "transportStorageType", Неопределено);
	Если НЕ transportStorageType = Неопределено Тогда
		ВСДОбъект.СпособХранения = Перечисления.СпособыХраненияВЕТИС.ПолучитьЗначение(transportStorageType);
	КонецЕсли;
	
	shipmentRoute = ПолучитьЗначениеПараметраСтруктуры(certifiedConsignment, "shipmentRoute", Неопределено);
	Если shipmentRoute = Неопределено Тогда
		cargoReloadingPointList = ПолучитьЗначениеПараметраСтруктуры(ДанныеВСД, "cargoReloadingPointList", Неопределено);
		Если НЕ cargoReloadingPointList = Неопределено Тогда
			cargoReloadingPoint = cargoReloadingPointList.cargoReloadingPoint;
			
			ВСДОбъект.ПунктыПерегрузки.Очистить();
			Для Каждого ТекСтрока Из cargoReloadingPoint Цикл
				НоваяСтрока = ВСДОбъект.ПунктыПерегрузки.Добавить();
				НоваяСтрока.НазваниеПункта = ТекСтрока.name;
				
				nextTransport = ТекСтрока.nextTransport;
				Если nextTransport = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ДанныеПоТС = ЗагрузитьТС(nextTransport, ВСДОбъект.Отправитель.Собственный);
				
				Если ДанныеПоТС = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока.ТранспортноеСредство = ДанныеПоТС.ТС;
				НоваяСтрока.Прицеп               = ДанныеПоТС.Прицеп;
				НоваяСтрока.НомерКонтейнера      = ДанныеПоТС.НомерКонтейнера;
				
			КонецЦикла;
			
		КонецЕсли;
	Иначе
		routePoint = shipmentRoute.routePoint;
		
		ВСДОбъект.ПунктыПерегрузки.Очистить();
		ПунктыПерегрузки = ВСДОбъект.ПунктыПерегрузки.Выгрузить();
		ПунктыПерегрузки.Колонки.Добавить("sqnId", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
		
		Для Каждого ТочкаМаршрута Из routePoint Цикл
			
			НоваяСтрока = ПунктыПерегрузки.Добавить();
			НоваяСтрока.ИдентификаторСтроки = ТочкаМаршрута.uuid;
			НоваяСтрока.sqnId               = ТочкаМаршрута.sqnId;
			
			location = ТочкаМаршрута.location;
			Если НЕ location = Неопределено Тогда
				Страна = location.address.country;
				Регион = location.address.region;
				НоваяСтрока.Страна = ЗагрузитьСтрану(НастройкаПодключения,, Страна);
				НоваяСтрока.Регион = ЗагрузитьРегион(НастройкаПодключения,, Регион);
				НоваяСтрока.НазваниеПункта = location.name;
			КонецЕсли;
			
			//enterprise
			enterprise = ТочкаМаршрута.enterprise;
			Если enterprise <> Неопределено Тогда
				НоваяСтрока.Предприятие = ЗагрузитьПредприятие(НастройкаПодключения,, enterprise);
			КонецЕсли;
			
			// transshipment
			НоваяСтрока.СПерегрузкой = ТочкаМаршрута.transshipment;
			
			nextTransport = ТочкаМаршрута.nextTransport;
			Если nextTransport = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеПоТС = ЗагрузитьТС(nextTransport, ВСДОбъект.Отправитель.Собственный);
			Если ДанныеПоТС = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока.ТранспортноеСредство = ДанныеПоТС.ТС;
			НоваяСтрока.Прицеп               = ДанныеПоТС.Прицеп;
			НоваяСтрока.НомерКонтейнера      = ДанныеПоТС.НомерКонтейнера;
			
		КонецЦикла;
		
		Если ПунктыПерегрузки.Количество()>0 Тогда
			ПунктыПерегрузки.Сортировать("sqnId");
			ВСДОбъект.ПунктыПерегрузки.Загрузить(ПунктыПерегрузки);
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеПартии = certifiedConsignment.batch;
	
	ОрганизацияПолучатель   = Неопределено;
	ПодразделениеПолучатель = Неопределено;
	ОрганизацияОтправитель   = Неопределено;
	ПодразделениеОтправитель = Неопределено;
	Если ЗначениеЗаполнено(ВСДОбъект.Получатель) Тогда
		ОрганизацияИПодразделение = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьОрганизациюИПодразделение(ВСДОбъект.Получатель, ВСДОбъект.ПредприятиеПолучатель);
		ОрганизацияПолучатель   = ОрганизацияИПодразделение.Организация;
		ПодразделениеПолучатель = ОрганизацияИПодразделение.Подразделение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВСДОбъект.Отправитель) Тогда
		ОрганизацияИПодразделение = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьОрганизациюИПодразделение(ВСДОбъект.Отправитель, ВСДОбъект.ПредприятиеОтправитель);
		ОрганизацияОтправитель   = ОрганизацияИПодразделение.Организация;
		ПодразделениеОтправитель = ОрганизацияИПодразделение.Подразделение;
	КонецЕсли;
	
	Если НЕ ВСДОбъект.Отправитель = ВСДОбъект.Получатель Тогда
		
		Если ВСДОбъект.ПредприятиеПолучатель = Предприятие Тогда
			ВСДОбъект.Контрагент = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьКонтрагента(ВСДОбъект.Отправитель);
		ИначеЕсли ВСДОбъект.ПредприятиеОтправитель = Предприятие Тогда
			ВСДОбъект.Контрагент = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьКонтрагента(ВСДОбъект.Получатель);
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьРеквизитыПартии(НастройкаПодключения, ХозяйствующийСубъект, ВСДОбъект, ДанныеПартии);
	ЗаполнитьТаблицыПартии(НастройкаПодключения, ХозяйствующийСубъект, ВСДОбъект, ДанныеПартии);
	
	ОсновнаяУпаковка = ПолучитьОсновнуюУпаковку(ВСДОбъект.Упаковки);
	ЗаполнитьЗначенияСвойств(ВСДОбъект, ОсновнаяУпаковка);
	
	referencedDocument = ДанныеВСД.referencedDocument;
	
	ВСДОбъект.СвязанныеДокументы.Очистить();
	
	ВСДОбъект.ТипТТН = Неопределено;
	Для Каждого СопрДокумент Из referencedDocument Цикл
		НовыйСопрДокумент = ВСДОбъект.СвязанныеДокументы.Добавить();
		НовыйСопрДокумент.ТипДокумента = Перечисления.ТипыДокументовВЕТИС.ПолучитьЗначение(СопрДокумент.type);
		НовыйСопрДокумент.Серия        = СопрДокумент.issueSeries;
		НовыйСопрДокумент.Номер        = СопрДокумент.issueNumber;
		НовыйСопрДокумент.ТипСвязи     = Перечисления.ТипыСвязейВЕТИС.ПолучитьЗначение(СопрДокумент.relationshipType);
		ДатаВСД = СопрДокумент.issueDate;
		НовыйСопрДокумент.Дата = ДатаВСД;
		
		type = ?(ПустаяСтрока(СопрДокумент.type), 1, Число(СопрДокумент.type));
		Если type >= 1 
			И type <= 5
			И (НЕ ЗначениеЗаполнено(ВСДОбъект.ТипТТН)) Тогда
			// В реквизиты шапки записываем документ наименьшим типом, из первой пятерки типов.
			//МинимальныйКод = type;
			ВСДОбъект.ТипТТН   = Перечисления.ТипыДокументовВЕТИС.ПолучитьЗначение(type);
			ВСДОбъект.СерияТТН = НовыйСопрДокумент.Серия;
			ВСДОбъект.НомерТТН = НовыйСопрДокумент.Номер;
			ВСДОбъект.ДатаТТН  = НовыйСопрДокумент.Дата;
		КонецЕсли;
		
		//type = НовыйСопрДокумент.ТипДокумента;
		//type = ?(ПустаяСтрока(type), 1, Число(type));
		//Если type >= 1 
		//	И type <= 5
		//	И type < МинимальныйКод Тогда
		//	// В реквизиты шапки записываем документ наименьшим типом, из первой пятерки типов.
		//	МинимальныйКод = type;
		//	ВСДОбъект.ТипТТН   = НовыйСопрДокумент.ТипДокумента;
		//	ВСДОбъект.СерияТТН = НовыйСопрДокумент.Серия;
		//	ВСДОбъект.НомерТТН = НовыйСопрДокумент.Номер;
		//	ВСДОбъект.ДатаТТН  = НовыйСопрДокумент.Дата;
		//КонецЕсли;
		
	КонецЦикла;
	
	НайстрокиПредприятия = ВСДОбъект.Отправитель.Предприятия.Найти(ВСДОбъект.ПредприятиеОтправитель, "Предприятие");
	Если НЕ НайстрокиПредприятия = Неопределено Тогда
		Если НайстрокиПредприятия.ЗаменятьПрефикс ИЛИ НайстрокиПредприятия.ОчищатьНули Тогда
			НовыйНомерТТН = СформироватьНомерТТН(ВСДОбъект.НомерТТН, НайстрокиПредприятия.ОчищатьНули, НайстрокиПредприятия.ЗаменятьПрефикс, НайстрокиПредприятия.Префикс);
			Если НЕ НовыйНомерТТН = ВСДОбъект.НомерТТН Тогда
				НовыйСопрДокумент = ВСДОбъект.СвязанныеДокументы.Добавить();
				НовыйСопрДокумент.ТипДокумента = "999";
				НовыйСопрДокумент.Дата  = ВСДОбъект.ДатаТТН;
				НовыйСопрДокумент.Номер = НовыйНомерТТН;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	confirmedBy = Неопределено;
	statusChange = ДанныеВСД.statusChange;
	Если statusChange = Неопределено Тогда
		confirmedBy = ДанныеВСД.confirmedBy;
	Иначе
		Для Каждого ТекущийСтатус Из statusChange Цикл
			confirmedBy = ТекущийСтатус;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ confirmedBy = Неопределено Тогда
		ВСДОбъект.ФИОВетВрачаОтправителя       = confirmedBy.specifiedPerson.fio;
		ВСДОбъект.ДолжностьВетВрачаОтправителя = confirmedBy.specifiedPerson.post;
	КонецЕсли;
	
	//transferPermit = ДанныеВСД.transferPermit;
	//Если НЕ transferPermit = Неопределено Тогда
	//	ДатаРазрешенияНаВывоз = transferPermit.issueDate");;
	//	ВСДОбъект.ДатаРазрешенияНаВывоз  = ПолучитьДатуИзСтроки(ДатаРазрешенияНаВывоз);
	//	ВСДОбъект.НомерРазрешенияНаВывоз = transferPermit.issueNumber");;
	//КонецЕсли;
	
	ВСДОбъект.СерияВСД               = ДанныеВСД.issueSeries;
	ВСДОбъект.НомерВСД               = ДанныеВСД.issueNumber;
	ВСДОбъект.ДатаВСД                = ДанныеВСД.issueDate;
	ВСДОбъект.СведенияВСЭ            = ПолучитьЗначениеПараметраСтруктуры(ДанныеВСД, "expertiseInfo", Неопределено);
	
	Если ПустаяСтрока(ВСДОбъект.НомерВебВСД) Тогда
		ВСДОбъект.НомерВебВСД = ПолучитьВебНомерВСД(ВСДОбъект);
	КонецЕсли;
	
	Если НовыйВСД Тогда
		ВСДОбъект.Записать();
		ВывестиСообщение(НСтр("ru='Создан новый ВСД: <%1 № %2 от %3>'"),,,,,Строка(ВСДОбъект.ХозОперация), СокрЛП(ВСДОбъект.Номер), Формат(ВСДОбъект.Дата, "ДФ=dd.MM.yyyy"));
	Иначе
		ВСДОбъект.ОбменДанными.Загрузка = Истина;
		ВСДОбъект.Записать();
		ВывестиСообщение(НСтр("ru='Перезаписан ВСД: <%1 № %2 от %3>'"),,,,,Строка(ВСДОбъект.ХозОперация), СокрЛП(ВСДОбъект.Номер), Формат(ВСДОбъект.Дата, "ДФ=dd.MM.yyyy"));
		
		Если ОбновитьГашениеВСД Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", ВСДОбъект.Ссылка);
			Запрос.Текст = "
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ГашениеВходящихВСДВЕТИС.Ссылка КАК ГашениеСсылка
			|ПОМЕСТИТЬ
			|	ТаблицаГашение
			|ИЗ
			|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК ГашениеВходящихВСДВЕТИС
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|	РегистрСведений.СтатусыДокументовВЕТИС КАК СтатусыДокументовВЕТИС
			|ПО
			|	ГашениеВходящихВСДВЕТИС.Ссылка = СтатусыДокументовВЕТИС.Документ
			|ГДЕ
			|	ГашениеВходящихВСДВЕТИС.ВСД = &Ссылка И 
			|	(НЕ СтатусыДокументовВЕТИС.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.ВидыСтатусовОбработкиВЕТИС.ВСДПогашены))
			|;
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ТаблицаГашение.ГашениеСсылка КАК ГашениеСсылка,
			|	МАКСИМУМ(ВЫБОР
			|		КОГДА (НЕ ГашениеВходящихВСДВЕТИС.ВСД = ЗНАЧЕНИЕ(Документ.ВСДВЕТИС.ПустаяСсылка)) И 
			|			(НЕ ГашениеВходящихВСДВЕТИС.ВСД.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВСДВЕТИС.UTILIZED)) ТОГДА
			|			1
			|		ИНАЧЕ
			|			0
			|	КОНЕЦ) КАК ЕстьНеПогашенные
			|ИЗ
			|	ТаблицаГашение КАК ТаблицаГашение
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК ГашениеВходящихВСДВЕТИС
			|ПО
			|	ТаблицаГашение.ГашениеСсылка = ГашениеВходящихВСДВЕТИС.Ссылка
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаГашение.ГашениеСсылка
			|";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() И ТипЗнч(Выборка.ГашениеСсылка) = Тип("ДокументСсылка.ГашениеВходящихВСДВЕТИС") И Выборка.ЕстьНеПогашенные=0 Тогда
				Попытка
					//Выборка.ГашениеСсылка.ПолучитьОбъект();
					ПараметрыОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ПараметрыОбновления();
					ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.ВСДПогашены;
					ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.НеТребуется;
					
					НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ОбновитьСтатус(Выборка.ГашениеСсылка, ПараметрыОбновления);
				Исключение
					
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВСДОбъект.Ссылка;
	
КонецФункции

Функция ПроверкаДанныхЗаполнения(ПолученныеДанные, НастройкаПодключения, ПараметрыЗапроса) Экспорт
	
	Если ПолученныеДанные=Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	ИмяСправочника = ПараметрыЗапроса.ИмяСправочника;
	ИмяЭлемента    = ПараметрыЗапроса.ИмяЭлемента;
	Отказ = Ложь;
	
	ДанныеЗаполнения = Неопределено;
	
	guidДанных = ПолучитьЗначениеПараметраСтруктуры(ПолученныеДанные, "guid", Неопределено);
	uuidДанных = ПолучитьЗначениеПараметраСтруктуры(ПолученныеДанные, "uuid", Неопределено);
	Если ЗначениеЗаполнено(guidДанных) ИЛИ ЗначениеЗаполнено(uuidДанных) Тогда
		РезультатПоиска = НайтиСсылкуНаОбъект(ИмяСправочника, guidДанных, uuidДанных);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ОбновлятьСправочники = ПолучитьЗначениеПараметраСтруктуры(НастройкаПодключения, "ОбновлятьСправочники", Истина);
	
	Если НЕ ЗначениеЗаполнено(РезультатПоиска.Ссылка) Тогда
		
		Если guidДанных = Неопределено И ЗначениеЗаполнено(ИмяЭлемента) Тогда
			ПараметрыЗапроса.ИмяМетода = "get"+ ИмяЭлемента+ "ByUuid";
			ПараметрыЗапроса.Параметры.Вставить("uuid", uuidДанных);
			ДанныеЗаполнения = ПолучитьДанныеСправочников(НастройкаПодключения, ПараметрыЗапроса, Отказ);
			
			Если Отказ Тогда
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		УникальныйКод = Новый УникальныйИдентификатор(guidДанных);
		НоваяСсылка = Справочники[ИмяСправочника].ПолучитьСсылку(УникальныйКод);
		
		СправочникОбъект = Неопределено;
		Если ЗначениеЗаполнено(НоваяСсылка) Тогда
			СправочникОбъект = НоваяСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		Если СправочникОбъект = Неопределено Тогда
			Если ПараметрыЗапроса.Свойство("Группа") Тогда 
				СправочникОбъект = Справочники[ИмяСправочника].СоздатьГруппу();
			Иначе
				СправочникОбъект = Справочники[ИмяСправочника].СоздатьЭлемент();
			КонецЕсли;
			СправочникОбъект.УстановитьСсылкуНового(НоваяСсылка);
		ИначеЕсли СправочникОбъект.ИдентификаторЗаписи = uuidДанных Тогда
			Результат.Вставить("СправочникОбъект",СправочникОбъект);
			Результат.Вставить("ЗаполнитьПодДаннымЗаполнения",Ложь);
			Возврат Результат;
		КонецЕсли;
		
	ИначеЕсли uuidДанных = Неопределено ИЛИ РезультатПоиска.ИдентификаторЗаписи = uuidДанных Тогда
		Результат.Вставить("СправочникОбъект",             РезультатПоиска.Ссылка);
		Результат.Вставить("ЗаполнитьПодДаннымЗаполнения", Ложь);
		Возврат Результат;
	ИначеЕсли НЕ ОбновлятьСправочники Тогда
		Результат.Вставить("СправочникОбъект",             РезультатПоиска.Ссылка);
		Результат.Вставить("ЗаполнитьПодДаннымЗаполнения", Ложь);
		Возврат Результат;
	ИначеЕсли НЕ guidДанных = Неопределено И ЗначениеЗаполнено(ИмяЭлемента) Тогда
		
		// если пришла старая запись, а у нас уже последняя
		ПараметрыЗапроса.ИмяМетода = "get" + ИмяЭлемента + "ByGuid";
		ПараметрыЗапроса.Параметры.Вставить("guid", guidДанных);
		ДанныеЗаполнения = ПолучитьДанныеСправочников(НастройкаПодключения, ПараметрыЗапроса, Отказ);
		
		Если Отказ Тогда
			Результат.Вставить("СправочникОбъект",             РезультатПоиска.Ссылка);
			Результат.Вставить("ЗаполнитьПодДаннымЗаполнения", Ложь);
			Возврат Результат;
		КонецЕсли;
		
		Если (НЕ ДанныеЗаполнения = Неопределено) И РезультатПоиска.ИдентификаторЗаписи = ДанныеЗаполнения.uuid Тогда
			Результат.Вставить("СправочникОбъект",             РезультатПоиска.Ссылка);
			Результат.Вставить("ЗаполнитьПодДаннымЗаполнения", Ложь);
			Возврат Результат;
		КонецЕсли;
		
		СправочникОбъект = РезультатПоиска.Ссылка.ПолучитьОбъект();
	Иначе
		СправочникОбъект = РезультатПоиска.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	createDate = ПолучитьЗначениеПараметраСтруктуры(ПолученныеДанные, "createDate", Неопределено);
	
	//Если НЕ ЗначениеЗаполнено(createDate) И ДанныеЗаполнения = Неопределено И ЗначениеЗаполнено(ПолученныеДанные.guid) И ЗначениеЗаполнено(ИмяЭлемента) Тогда
	Если НЕ ЗначениеЗаполнено(createDate) И ДанныеЗаполнения = Неопределено И ЗначениеЗаполнено(guidДанных) И ЗначениеЗаполнено(ИмяЭлемента) Тогда
		ПараметрыЗапроса.ИмяМетода = "get" + ИмяЭлемента + "ByGuid";
		ПараметрыЗапроса.Параметры.Вставить("guid", guidДанных);
		ДанныеЗаполнения = ПолучитьДанныеСправочников(НастройкаПодключения, ПараметрыЗапроса, Отказ);
		
		Если Отказ Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(createDate) И ДанныеЗаполнения = Неопределено И ЗначениеЗаполнено(uuidДанных) И ЗначениеЗаполнено(ИмяЭлемента) Тогда
		ПараметрыЗапроса.ИмяМетода = "get"+ ИмяЭлемента+ "ByUuid";
		ПараметрыЗапроса.Параметры.Вставить("uuid", uuidДанных);
		ДанныеЗаполнения = ПолучитьДанныеСправочников(НастройкаПодключения, ПараметрыЗапроса, Отказ);
		
		Если Отказ Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	ИначеЕсли ДанныеЗаполнения = Неопределено Тогда
		ДанныеЗаполнения = ПолученныеДанные;
	КонецЕсли;
	
	Результат.Вставить("СправочникОбъект",             СправочникОбъект);
	Результат.Вставить("ЗаполнитьПодДаннымЗаполнения", Истина);
	ПолученныеДанные = ДанныеЗаполнения;
	
	Возврат Результат;
	
КонецФункции // ПроверкаДанныхЗаполнения()

#КонецОбласти

#Область СтруктурыОбъектов

Функция ПолучитьСтруктуруПредприятия() Экспорт
	
	Данные = Новый Структура;
	Данные.Вставить("Код");
	Данные.Вставить("ИдентификаторЗаписи");
	Данные.Вставить("КодПоТНВЭД");
	Данные.Вставить("Наименование");
	Данные.Вставить("НаименованиеПолное");
	Данные.Вставить("НаименованиеАнглийское");
	Данные.Вставить("Тип");
	Данные.Вставить("Адрес");
	Данные.Вставить("Ссылка");
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьСтруктуруХозяйствующегоСубъекта() Экспорт
	
	Данные = Новый Структура;
	Данные.Вставить("Код");
	Данные.Вставить("ИдентификаторЗаписи");
	Данные.Вставить("Наименование");
	Данные.Вставить("НаименованиеПолное");
	Данные.Вставить("Тип");
	Данные.Вставить("ОКОПФ");
	Данные.Вставить("ИНН");
	Данные.Вставить("КПП");
	Данные.Вставить("ОГРН");
	Данные.Вставить("ФИО");
	Данные.Вставить("НомерПаспорта");
	Данные.Вставить("ЮридическийАдрес");
	//Данные.Вставить("ТранспортноеСредство");
	//Данные.Вставить("Прицеп");
	//Данные.Вставить("СпособХранения");
	//Данные.Вставить("НазначениеГруза");
	//Данные.Вставить("БлагополучиеМестности");
	//Данные.Вставить("ЗапрещатьГаситьВСДБезВСЭ");
	//Данные.Вставить("ЗапасСрокаГодности");
	//Данные.Вставить("Собственный");
	//Данные.Вставить("Ссылка");
	//Данные.Вставить("Предприятия");
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьСтруктуруПродукции() Экспорт
	
	Данные = Новый Структура;
	//Данные.Вставить("Активность");
	//Данные.Вставить("Актуальность");
	//Данные.Вставить("Идентификатор");
	//Данные.Вставить("ИдентификаторВерсии");
	//Данные.Вставить("Статус");
	//Данные.Вставить("ДатаСоздания");
	//Данные.Вставить("ДатаИзменения");
	//
	//Данные.Вставить("ТипПродукции");
	//Данные.Вставить("Продукция");
	//Данные.Вставить("ВидПродукции");
	//
	//Данные.Вставить("Наименование");
	//Данные.Вставить("КодТНВЭД");
	//Данные.Вставить("Артикул");
	//Данные.Вставить("GTIN");
	//Данные.Вставить("СоответствуетГОСТ");
	//Данные.Вставить("ГОСТ");
	//
	//Данные.Вставить("ФасовкаУпаковка");
	//Данные.Вставить("ФасовкаКоличествоУпаковок");
	//Данные.Вставить("ФасовкаЕдиницаИзмерения");
	//Данные.Вставить("ФасовкаКоличествоЕдиницВУпаковке");
	//
	//Данные.Вставить("ХозяйствующийСубъектПроизводитель");
	//Данные.Вставить("ХозяйствующийСубъектПроизводительИдентификатор");
	//Данные.Вставить("ХозяйствующийСубъектСобственникТорговойМарки");
	//Данные.Вставить("ХозяйствующийСубъектСобственникТорговойМаркиИдентификатор");
	//Данные.Вставить("Производители", Новый Массив);
	//
	//Данные.Вставить("ХешСумма");
	//Данные.Вставить("Ссылка");
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьСтруктуруЗаболевания() Экспорт
	
	Данные = Новый Структура;
	//Данные.Вставить("Активность");
	//Данные.Вставить("Актуальность");
	//Данные.Вставить("Идентификатор");
	//Данные.Вставить("ИдентификаторВерсии");
	//Данные.Вставить("Статус");
	//Данные.Вставить("ДатаСоздания");
	//Данные.Вставить("ДатаИзменения");
	//
	//Данные.Вставить("Наименование");
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьСтруктуруПунктаМаршрута() Экспорт
	
	Данные = Новый Структура;
	
	//Данные.Вставить("Идентификатор");
	//
	//Данные.Вставить("Предприятие");
	//Данные.Вставить("Адрес");
	//Данные.Вставить("АдресПредставление");
	//Данные.Вставить("ДанныеАдреса");
	//Данные.Вставить("СПерегрузкой");
	//
	//Данные.Вставить("ТранспортноеСредство");
	//Данные.Вставить("ТипТранспорта");
	//Данные.Вставить("НомерТранспортногоСредства");
	//Данные.Вставить("НомерАвтомобильногоПрицепа");
	//Данные.Вставить("НомерАвтомобильногоКонтейнера");
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьСтруктуруУпаковкиВЕТИС() Экспорт
	
	Данные = Новый Структура;
	
	//Данные.Вставить("ИдентификаторСтроки");
	//Данные.Вставить("УровеньУпаковки");
	//Данные.Вставить("УпаковкаВЕТИС");
	//Данные.Вставить("КоличествоУпаковокВЕТИС");
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьСтруктуруШтрихкодыУпаковок() Экспорт
	
	Данные = Новый Структура;
	
	//Данные.Вставить("ИдентификаторСтроки");
	//Данные.Вставить("Штрихкод");
	//Данные.Вставить("ТипМаркировки");
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьСтруктуруПроизводители() Экспорт
	
	Данные = Новый Структура;
	
	//Данные.Вставить("Производитель");
	//Данные.Вставить("РольПредприятия");
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьСтруктуруПроизводственныеПартии() Экспорт
	
	Данные = Новый Структура;
	
	//Данные.Вставить("ИдентификаторПартии");
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьСтруктуруЗаписиСкладскогоЖурнала() Экспорт
	
	Данные = Новый Структура;
	
	//Данные.Вставить("ХозяйствующийСубъект");
	//Данные.Вставить("Предприятие");
	//Данные.Вставить("Продукция");
	//Данные.Вставить("СкоропортящаясяПродукция");
	//Данные.Вставить("НизкокачественнаяПродукция");
	//Данные.Вставить("ДатаПроизводстваСтрока");
	//Данные.Вставить("ДатаПроизводстваТочностьЗаполнения");
	//Данные.Вставить("ДатаПроизводстваНачалоПериода");
	//Данные.Вставить("ДатаПроизводстваКонецПериода");
	//Данные.Вставить("СрокГодностиСтрока");
	//Данные.Вставить("СрокГодностиТочностьЗаполнения");
	//Данные.Вставить("СрокГодностиНачалоПериода");
	//Данные.Вставить("СрокГодностиКонецПериода");
	//Данные.Вставить("СтранаПроизводства");
	//Данные.Вставить("Цель");
	//
	//Данные.Вставить("УпаковкиВЕТИС");
	//Данные.Вставить("ШтрихкодыУпаковок");
	//Данные.Вставить("Производители");
	//Данные.Вставить("ПроизводственныеПартии");
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#Область НастройкиЗагрузки

Функция ПолучитьНастройкуПодключения(ХозяйствующийСубъект) Экспорт
	
	АдресСервера = ИнтеграцияВЕТИСВызовСервера.АдресСервера();
	
	НастройкаПодключения = ИнтеграцияВЕТИСКлиентСервер.НоваяНастройкаПодключения();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ХозяйствующийСубъект", ХозяйствующийСубъект);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НастройкиПодключенияВЕТИС.ХозяйствующийСубъект.Код КАК ИдентификаторРСХН,
	|	НастройкиПодключенияВЕТИС.ХозяйствующийСубъект КАК ХозяйствующийСубъект,
	|	НастройкиПодключенияВЕТИС.Администратор.Логин КАК Пользователь,
	|	НастройкиПодключенияВЕТИС.Ключ КАК Ключ,
	|	НастройкиПодключенияВЕТИС.Логин КАК Логин,
	|	НастройкиПодключенияВЕТИС.Пароль КАК Пароль,
	|	НастройкиПодключенияВЕТИС.Таймаут КАК Таймаут,
	|	НастройкиПодключенияВЕТИС.ВремяОжиданияОбработкиЗаявки КАК ВремяОжиданияОбработкиЗаявки,
	|	НастройкиПодключенияВЕТИС.ИнтервалМеждуЗапросамиСинхронизации КАК ИнтервалМеждуЗапросамиСинхронизации,
	|	НастройкиПодключенияВЕТИС.КоличествоПовторныхЗапросов КАК КоличествоПовторныхЗапросов,
	|	НастройкиПодключенияВЕТИС.ОтправлятьЗапросыПовторно КАК ОтправлятьЗапросыПовторно,
	|	НастройкиПодключенияВЕТИС.ИнтервалЗапросаИзмененныхДанных КАК ИнтервалЗапросаИзмененныхДанных
	|ИЗ
	|	РегистрСведений.НастройкиПодключенияВЕТИС КАК НастройкиПодключенияВЕТИС
	|ГДЕ
	|	НастройкиПодключенияВЕТИС.ХозяйствующийСубъект = &ХозяйствующийСубъект
	|";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат НастройкаПодключения;
	КонецЕсли;
	
	НастройкаПодключения.Вставить("Пользователь", Выборка.Пользователь);
	НастройкаПодключения.Вставить("Логин",        Выборка.Логин);
	НастройкаПодключения.Вставить("Пароль",       Выборка.Пароль);
	НастройкаПодключения.Вставить("Ключ",         Выборка.Ключ);
	НастройкаПодключения.Вставить("Таймаут",      Выборка.Таймаут);
	НастройкаПодключения.Вставить("Адрес",        АдресСервера.Адрес);
	НастройкаПодключения.Вставить("Порт",         АдресСервера.Порт);
	НастройкаПодключения.Вставить("ХозяйствующийСубъект", Выборка.ХозяйствующийСубъект);
	
	НастройкаПодключения.Вставить("ИдентификаторРСХН",                   Выборка.ИдентификаторРСХН);
	НастройкаПодключения.Вставить("ВремяОжиданияОбработкиЗаявки",        Выборка.ВремяОжиданияОбработкиЗаявки);
	НастройкаПодключения.Вставить("ИнтервалМеждуЗапросамиСинхронизации", Выборка.ИнтервалМеждуЗапросамиСинхронизации);
	НастройкаПодключения.Вставить("КоличествоПовторныхЗапросов",         Выборка.КоличествоПовторныхЗапросов);
	НастройкаПодключения.Вставить("ОтправлятьЗапросыПовторно",           Выборка.ОтправлятьЗапросыПовторно);
	НастройкаПодключения.Вставить("ИнтервалЗапросаИзмененныхДанных",     Выборка.ИнтервалЗапросаИзмененныхДанных);
	
	Возврат НастройкаПодключения;
	
КонецФункции// ПолучитьНастройкуПодключения()

Функция ПолучитьПараметрыЗапроса() Экспорт
	
	НастройкаЗапроса = Новый Структура;
	НастройкаЗапроса.Вставить("АдресРесурса","platform/services/2.1/EnterpriseService");
	НастройкаЗапроса.Вставить("Идентификатор");
	НастройкаЗапроса.Вставить("ИмяСправочника");
	НастройкаЗапроса.Вставить("ИмяМетода");
	НастройкаЗапроса.Вставить("ПространствоИмен");
	НастройкаЗапроса.Вставить("ИмяЭлемента");
	НастройкаЗапроса.Вставить("Представление", "");
	НастройкаЗапроса.Вставить("Параметры", Новый Структура);
	
	Возврат НастройкаЗапроса;
	
КонецФункции// ПолучитьПараметрыЗапроса()

Процедура ЗагрузитьЗаболевания(НастройкаПодключения) Экспорт
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
	ПараметрыЗапроса.ИмяСправочника = "ЗаболеванияВЕТИС";
	ПараметрыЗапроса.АдресРесурса   = "platform/services/2.1/DictionaryService";
	ПараметрыЗапроса.ИмяМетода      = "getDiseaseList";
	ПараметрыЗапроса.ИмяЭлемента    = "DiseaseList";
	ПараметрыЗапроса.Вставить("ИмяСписка", "listOptions");
	
	ПараметрыЗапросаЗаболевания = ПолучитьПараметрыЗапроса();
	ПараметрыЗапросаЗаболевания.ИмяСправочника = "ЗаболеванияВЕТИС";
	ПараметрыЗапросаЗаболевания.АдресРесурса   = "platform/services/2.1/DictionaryService";
	ПараметрыЗапросаЗаболевания.ИмяЭлемента    = "DiseaseList";
	
	СтруктураДанных = Новый Структура;
	Отказ = Ложь;
	offset = 0;
	count = 500;
	Пока count>0 Цикл
		ПараметрыЗапроса.Вставить("ПараметрыСписка", Новый Структура);
		ПараметрыЗапроса.ПараметрыСписка.Вставить("count",  count);
		ПараметрыЗапроса.ПараметрыСписка.Вставить("offset", offset);
		
		РезультатЗапроса = ПолучитьДанныеСправочников(НастройкаПодключения, ПараметрыЗапроса, Отказ);
		
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
		
		Для Каждого ТекущаяЗапись Из РезультатЗапроса.disease Цикл
			ЗагрузитьЗаболевание(НастройкаПодключения, ПараметрыЗапросаЗаболевания, ТекущаяЗапись);
		КонецЦикла;
		
		offset = offset + count;
		count  = Мин(500, РезультатЗапроса.total-offset);
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьЗаболевания()

Функция ЗагрузитьПредприятия(НастройкаПодключения, GUIDХозяйствующегоСубъекта) Экспорт
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
	ПараметрыЗапроса.ИмяСправочника = "ПредприятияВЕТИС";
	ПараметрыЗапроса.АдресРесурса   = "platform/services/2.1/EnterpriseService";
	ПараметрыЗапроса.ИмяМетода      = "getActivityLocationList";
	ПараметрыЗапроса.ИмяЭлемента    = "ActivityLocationList";
	ПараметрыЗапроса.Вставить("ИмяСписка", "listOptions, businessEntity");
	
	ПараметрыЗапросаПредприятия = ПолучитьПараметрыЗапроса();
	ПараметрыЗапросаПредприятия.ИмяСправочника = "ПредприятияВЕТИС";
	ПараметрыЗапросаПредприятия.АдресРесурса   = "platform/services/2.1/EnterpriseService";
	ПараметрыЗапросаПредприятия.ИмяЭлемента    = "Enterprise";
	
	Предприятия = Новый Массив;
	
	Отказ  = Ложь;
	offset = 0;
	count  = 500;
	Пока count>0 Цикл
		
		ПараметрыЗапроса.Вставить("ПараметрыСписка", Новый Структура);
		ПараметрыЗапроса.ПараметрыСписка.Вставить("count",  count);
		ПараметрыЗапроса.ПараметрыСписка.Вставить("offset", offset);
		ПараметрыЗапроса.ПараметрыСписка.Вставить("guid",   GUIDХозяйствующегоСубъекта);
		
		РезультатЗапроса = ПолучитьДанныеСправочников(НастройкаПодключения, ПараметрыЗапроса, Отказ);
	
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
		
		Для Каждого ТекущаяЗапись Из РезультатЗапроса.Location Цикл
			Предприятие = ЗагрузитьПредприятие(НастройкаПодключения, ПараметрыЗапросаПредприятия, ТекущаяЗапись.enterprise);
			
			НоваяСтрока = Новый Структура;
			НоваяСтрока.Вставить("Предприятие", Предприятие);
			Если ТипЗнч(ТекущаяЗапись.globalID) = Тип("Строка") Тогда
				НоваяСтрока.Вставить("GLN", ТекущаяЗапись.globalID);
			Иначе
				НоваяСтрока.Вставить("GLN", "");
			КонецЕсли;
			
			Предприятия.Добавить(НоваяСтрока);
		КонецЦикла;
		
		offset = offset + count;
		count  = Мин(500, РезультатЗапроса.total-offset);
	КонецЦикла;
	
	Возврат Предприятия;

КонецФункции // ЗагрузитьПредприятия()

//Процедура ЗапроситьНазначения(Форма,ТранспортныйМодуль) Экспорт
//	
//	НастройкаПодключения = ПолучитьНастройкуПодключения(ТранспортныйМодуль);
//	НастройкаПодключения.ИмяСправочника = "НазначенияГрузаВЕТИС";
//	НастройкаПодключения.АдресРесурса = "platform/services/2.1/DictionaryService";
//	НастройкаПодключения.ИмяМетода = "getPurposeList";
//	НастройкаПодключения.ИмяЭлемента = "PurposeList";
//	СтруктураДанных = Новый Структура;

//	Отказ = Ложь;
//	offset = 0;
//	count = 500;
//	Пока count>0 Цикл
//		НастройкаПодключения.ПараметрыЗапроса.Вставить("ИмяСписка", "listOptions");
//		НастройкаПодключения.ПараметрыЗапроса.Вставить("ПараметрыСписка", Новый Структура);
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("count", count);
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("offset", offset);
//		ИнтеграцияВЕТИС.ПолучитьДанныеСправочников(НастройкаПодключения,СтруктураДанных,Отказ);
//	
//		Если Отказ Тогда
//			Прервать;
//		КонецЕсли;
//		
//		Для Каждого ТекущаяЗапись Из СтруктураДанных.Результат.purpose Цикл
//			
//			НайденнаяСсылка = Справочники.НазначенияГрузаВЕТИС.НайтиПоКоду(ТекущаяЗапись.guid);
//			
//			Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
//				ИдентификаторЗаписи = НайденнаяСсылка.ИдентификаторЗаписи;
//				Если Форма.Элементы.СписокЗагрузкиСкрытьЗагруженные.Пометка И ИдентификаторЗаписи = ТекущаяЗапись.uuid Тогда
//					Продолжить;
//				КонецЕсли;
//			Иначе
//				ИдентификаторЗаписи = "";
//			КонецЕсли;
//			
//			НоваяСтрока = Форма.СписокЗагрузки.Добавить();
//			НоваяСтрока.forSubstandard = ТекущаяЗапись.forSubstandard;
//			НоваяСтрока.name          = СокрЛП(ТекущаяЗапись.name);
//			НоваяСтрока.Ссылка              = НайденнаяСсылка;
//			НоваяСтрока.guid       = ТекущаяЗапись.guid;
//			НоваяСтрока.Используется        = Ложь;
//			НоваяСтрока.ИдентификаторЗаписи = ИдентификаторЗаписи;
//			НоваяСтрока.uuid = ТекущаяЗапись.uuid;
//		КонецЦикла;

//		offset = offset + count;
//		count      = Мин(500, СтруктураДанных.Результат.total-offset);
//	КонецЦикла;		

//КонецПроцедуры // ЗагрузитьНазначения()

//Процедура ЗапроситьВидПродукции(ТранспортныйМодуль,СтрокаРодителя,СкрытьЗагруженные) Экспорт
//	
//	УровеньВложенности = СтрокаРодителя.УровеньВложенности + 1;
//	НастройкаПодключения = ПолучитьНастройкуПодключения(ТранспортныйМодуль);
//	НастройкаПодключения.ИмяСправочника = "ПродукцияВЕТИС";
//	НастройкаПодключения.АдресРесурса = "platform/services/2.1/ProductService";
//	НастройкаПодключения.ИмяМетода = "getProductByTypeList";
//	НастройкаПодключения.ИмяЭлемента = "ProductList"; 
//	СтруктураДанных = Новый Структура;

//	Отказ = Ложь;
//	offset = 0;
//	count = 500;
//	Уровень = СтрокаРодителя.ПолучитьЭлементы();
//	Пока count>0 Цикл
//		НастройкаПодключения.ПараметрыЗапроса.Вставить("ИмяСписка", "listOptions");
//		НастройкаПодключения.ПараметрыЗапроса.Вставить("ПараметрыСписка", Новый Структура);
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("count", count);
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("offset", offset);
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("productType", СтрокаРодителя.guid);
//		ИнтеграцияВЕТИС.ПолучитьДанныеСправочников(НастройкаПодключения,СтруктураДанных,Отказ);
//	
//		Если Отказ Тогда
//			Прервать;
//		КонецЕсли;
//		
//		Для Каждого ТекущаяЗапись Из СтруктураДанных.Результат.product Цикл
//			
//			НоваяСтрока = Уровень.Добавить();
//			НоваяСтрока.name           = СокрЛП(ТекущаяЗапись.name);
//			НоваяСтрока.УровеньВложенности  = УровеньВложенности;
//			НоваяСтрока.ПродукцияСсылка     = Справочники.ПродукцияВЕТИС.НайтиПоКоду(ТекущаяЗапись.guid);
//			НоваяСтрока.guid       = ТекущаяЗапись.guid;
//			НоваяСтрока.code       	= ТекущаяЗапись.code;
//			НоваяСтрока.englishName = ТекущаяЗапись.englishName;
//			НоваяСтрока.КартинкаЭлемента    = 6;
//			НоваяСтрока.Используется       = Ложь;
//			НоваяСтрока.ИдентификаторЗаписи = НоваяСтрока.ПродукцияСсылка.ИдентификаторЗаписи;
//			НоваяСтрока.uuid = ТекущаяЗапись.uuid;
//			
//			КоличествоЗаписей = ЗапроситьПодВидПродукции(ТранспортныйМодуль,НоваяСтрока, СкрытьЗагруженные);
//			Если СкрытьЗагруженные И КоличествоЗаписей = 0 Тогда
//				СтрокаРодителя.Строки.Удалить(НоваяСтрока);
//			КонецЕсли;
//			
//		КонецЦикла;

//		offset = offset + count;
//		count      = Мин(500, СтруктураДанных.Результат.total-offset);
//	КонецЦикла;		

//КонецПроцедуры // ЗагрузитьНазначения()

//Функция ЗапроситьПодВидПродукции(ТранспортныйМодуль,СтрокаРодителя,СкрытьЗагруженные) Экспорт
//	
//	КоличествоЗаписей = 0;
//	УровеньВложенности = СтрокаРодителя.УровеньВложенности + 1;
//	
//	НастройкаПодключения = ПолучитьНастройкуПодключения(ТранспортныйМодуль);
//	НастройкаПодключения.ИмяСправочника = "ПродукцияВЕТИС";
//	НастройкаПодключения.АдресРесурса = "platform/services/2.1/ProductService";
//	НастройкаПодключения.ИмяМетода = "getSubProductByProductList";
//	НастройкаПодключения.ИмяЭлемента = "SubProductList";
//	СтруктураДанных = Новый Структура;

//	Отказ = Ложь;
//	offset = 0;
//	count = 500;
//	Уровень = СтрокаРодителя.ПолучитьЭлементы();
//	Пока count>0 Цикл
//		НастройкаПодключения.ПараметрыЗапроса.Вставить("ИмяСписка", "listOptions");
//		НастройкаПодключения.ПараметрыЗапроса.Вставить("ПараметрыСписка", Новый Структура);
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("count", count);
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("offset", offset);
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("productGuid", СтрокаРодителя.guid);
//		ИнтеграцияВЕТИС.ПолучитьДанныеСправочников(НастройкаПодключения,СтруктураДанных,Отказ);
//	
//		Если Отказ Тогда
//			Прервать;
//		КонецЕсли;
//		
//		Для Каждого ТекущаяЗапись Из СтруктураДанных.Результат.SubProduct Цикл
//			
//			ПродукцияСсылка = Справочники.ПродукцияВЕТИС.НайтиПоКоду(ТекущаяЗапись.guid);
//			
//			Если ЗначениеЗаполнено(ПродукцияСсылка) Тогда
//				ИдентификаторЗаписи = ПродукцияСсылка.ИдентификаторЗаписи;
//				Если СкрытьЗагруженные И ИдентификаторЗаписи = ТекущаяЗапись.uuid Тогда
//					Продолжить;
//				КонецЕсли;
//			Иначе
//				ИдентификаторЗаписи = "";
//			КонецЕсли;
//			
//			НоваяСтрока = Уровень.Добавить();
//			НоваяСтрока.Используется       = Ложь;
//			НоваяСтрока.name           = СокрЛП(ТекущаяЗапись.name);
//			НоваяСтрока.УровеньВложенности  = УровеньВложенности;
//			НоваяСтрока.ПродукцияСсылка     = ПродукцияСсылка;
//			НоваяСтрока.guid       = ТекущаяЗапись.guid;
//			НоваяСтрока.КартинкаЭлемента    = 6;
//			НоваяСтрока.ИдентификаторЗаписи = ИдентификаторЗаписи;
//			НоваяСтрока.uuid = ТекущаяЗапись.uuid;
//			НоваяСтрока.code       	= ТекущаяЗапись.code;
//			НоваяСтрока.englishName = ТекущаяЗапись.englishName;
//			
//			КоличествоЗаписей = КоличествоЗаписей + 1;
//			
//		КонецЦикла;

//		offset = offset + count;
//		count      = Мин(500, СтруктураДанных.Результат.total-offset);
//	КонецЦикла;		

//КонецФункции // ЗапроситьПодВидПродукции()

Процедура ОбновитьПродукцию(Объект, ХозяйствующийСубъект) Экспорт
	
	НастройкаПодключения = ПолучитьНастройкуПодключения(ХозяйствующийСубъект);
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
	
	ПараметрыЗапроса.ИмяСправочника = "ПродукцияВЕТИС";
	ПараметрыЗапроса.АдресРесурса   = "platform/services/2.1/ProductService";
	ПараметрыЗапроса.ИмяМетода      = "getProductItemByGuid";
	ПараметрыЗапроса.ИмяЭлемента    = "ProductItem";
	ПараметрыЗапроса.Параметры.Вставить("guid", Объект.Код);
	
	Отказ = Ложь;
	ДанныеЗаполнения = ПолучитьДанныеСправочников(НастройкаПодключения, ПараметрыЗапроса, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТипПродукции = Справочники.ПродукцияВЕТИС.НайтиПоКоду(ДанныеЗаполнения.productType, Истина);
	Продукция    = ЗагрузитьПродукцию(НастройкаПодключения,, ДанныеЗаполнения.product, ТипПродукции);
	ВидПродукции = ЗагрузитьВидПродукции(НастройкаПодключения,, ДанныеЗаполнения.subProduct, ТипПродукции, Продукция);
	
	Объект.Наименование           = ДанныеЗаполнения.name;
	Объект.НаименованиеПолное     = ДанныеЗаполнения.name;
	Объект.ИдентификаторЗаписи    = ДанныеЗаполнения.uuid;
	Объект.Артикул				  = ДанныеЗаполнения.code;
	Объект.ТипПродукции           = ТипПродукции;
	Объект.Продукция              = Продукция;
	Объект.Родитель               = ВидПродукции;
	Объект.СоответствуетГОСТу     = ДанныеЗаполнения.correspondsToGost;
	Объект.ГОСТ                   = ДанныеЗаполнения.gost;
	Объект.УровеньВложенности     = 4;
	
	packaging = ДанныеЗаполнения.packaging;
	Если ЗначениеЗаполнено(packaging) Тогда
		packagingType = packaging.packagingType;
		Если ЗначениеЗаполнено(packagingType) Тогда
			Если ЗначениеЗаполнено(packagingType.guid) Тогда
				Объект.ФасовкаУпаковка = ЗагрузитьТипУпаковки(packagingType.guid);
			Иначе
				Объект.ФасовкаУпаковка = Справочники.УпаковкиВЕТИС.НайтиПоНаименованию(packagingType.name, Истина);
			КонецЕсли;
		КонецЕсли;
		
		Объект.ФасовкаКоличествоУпаковок = packaging.quantity;
		Объект.ФасовкаКоличествоЕдиницВУпаковке = packaging.volume;
		unit = packaging.unit;
		Если Не unit = Неопределено Тогда
			Объект.ФасовкаЕдиницаИзмерения   = ЗагрузитьЕдиницуИзмерения(НастройкаПодключения,, unit);
		КонецЕсли;
	Иначе
		Объект.ФасовкаКоличествоЕдиницВУпаковке = 1;
	КонецЕсли;
	
	Если Объект.ФасовкаКоличествоЕдиницВУпаковке = 0 Тогда
		Объект.ФасовкаКоличествоЕдиницВУпаковке = 1;
	КонецЕсли;
	
	Площадки = ДанныеЗаполнения.producing;
	Если ЗначениеЗаполнено(Площадки) Тогда
		Объект.Площадки.Очистить();
		Для Каждого ТекущаяПлощадка Из Площадки Цикл
			Площадка = ЗагрузитьПредприятие(НастройкаПодключения,, ТекущаяПлощадка.location);
			Если Не ЗначениеЗаполнено(Площадка) Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Объект.Площадки.Добавить();
			НоваяСтрока.Площадка = Площадка;
		КонецЦикла;
	КонецЕсли;
	
	Объект.ХозяйствующийСубъект = ЗагрузитьХозяйствующийСубъект(НастройкаПодключения,,ДанныеЗаполнения.producer);
	Объект.ВладелецМарки        = ЗагрузитьХозяйствующийСубъект(НастройкаПодключения,,ДанныеЗаполнения.tmOwner);
	
	Объект.GTIN                 = ДанныеЗаполнения.globalID;
	
КонецПроцедуры // ЗагрузитьПродукцию()

//Функция НайтиСоздатьЕдиницуИзмерения(НастройкаПодключения, GUIDЕдиницы) Экспорт
//	
//	Результат = Справочники.ЕдиницыИзмеренияВЕТИС.НайтиПоКоду(GUIDЕдиницы);
//	Если ЗначениеЗаполнено(Результат) Тогда
//		Возврат Результат;
//	КонецЕсли;
//	
//	ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
//	ПараметрыЗапроса.ИмяСправочника = "ЕдиницыИзмеренияВЕТИС";
//	ПараметрыЗапроса.АдресРесурса   = "platform/services/2.1/DictionaryService";
//	ПараметрыЗапроса.ИмяМетода   = "getUnitByGuid";
//	ПараметрыЗапроса.ИмяЭлемента = "Unit";
//	ПараметрыЗапроса.Параметры.Вставить("guid", GUIDЕдиницы);
//	//СтруктураДанных = Новый Структура("Ссылка");
//	
//	Отказ = Ложь;
//	ДанныеСправоника = ПолучитьДанныеСправочников(НастройкаПодключения, ПараметрыЗапроса, Отказ);
//	
//	Если Отказ Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	ЕдиницаВетис = ЗагрузитьЕдиницуИзмерения(НастройкаПодключения, ПараметрыЗапроса, ДанныеСправоника);
//	
//	Возврат ЕдиницаВетис;
//	
//КонецФункции

//Функция НайтиСоздатьПредприятие(ТранспортныйМодуль, Идентификатор)
//	
//	Результат = Справочники.ПредприятияВЕТИС.НайтиПоКоду(Идентификатор);
//	Если ЗначениеЗаполнено(Результат) Тогда
//		Возврат Результат;
//	КонецЕсли;
//	
//	// Настройки подключения
//	НастройкаПодключения = ПолучитьНастройкуПодключения(ТранспортныйМодуль);
//	НастройкаПодключения.ИмяСправочника = "ПредприятияВЕТИС";
//	НастройкаПодключения.ИмяМетода = "getEnterpriseByGuid";
//	НастройкаПодключения.ИмяЭлемента = "Enterprise";
//	НастройкаПодключения.ПараметрыЗапроса.Вставить("guid", Идентификатор);
//	
//	Отказ = Ложь;
//	СтруктураДанных = Новый Структура("Ссылка");
//	ПолучитьДанныеСправочников(НастройкаПодключения, СтруктураДанных, Отказ);
//	
//	// Запишем полученные денные
//	Если НЕ Отказ Тогда
//		НачатьТранзакцию();
//		Попытка
//			СтруктураДанных.Ссылка = СоздатьПредприятие(ТранспортныйМодуль,СтруктураДанных.Результат);
//			ЗафиксироватьТранзакцию();
//		Исключение
//			ОтменитьТранзакцию();
//			
//			ВывестиСообщение(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
//			СтруктураДанных.Ссылка = Неопределено;
//			Отказ = Истина;
//		КонецПопытки; 
//	КонецЕсли;
//	
//	Возврат СтруктураДанных.Ссылка;
//	
//КонецФункции

Процедура ЗагрузитьУпаковки() Экспорт
	
	МакетПараметров = Обработки.МодульОбменаВЕТИС.ПолучитьМакет("КлассификаторУпаковок");
	
	ВидыОбъектов = МакетПараметров.ПолучитьОбласть("СписокУпаковок");
	Для НомерСтроки=1 По ВидыОбъектов.ВысотаТаблицы Цикл
		
		Идентификатор = СокрЛП(ВидыОбъектов.Область(НомерСтроки,1).Текст);
		Наименование  = СокрЛП(ВидыОбъектов.Область(НомерСтроки,2).Текст);
		КодУпаковки   = СокрЛП(ВидыОбъектов.Область(НомерСтроки,3).Текст);
		
		ЗагрузитьТипУпаковки(Идентификатор, Наименование, КодУпаковки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьЕдиницыИзмерения(НастройкаПодключения) Экспорт
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
	ПараметрыЗапроса.ИмяСправочника = "ЕдиницыИзмеренияВЕТИС";
	ПараметрыЗапроса.АдресРесурса   = "platform/services/2.1/DictionaryService";
	ПараметрыЗапроса.ИмяМетода      = "getUnitList";
	ПараметрыЗапроса.ИмяЭлемента    = "UnitList";
	ПараметрыЗапроса.Вставить("ИмяСписка", "listOptions");
	
	ПараметрыЗапросаЕдиницы = ПолучитьПараметрыЗапроса();
	ПараметрыЗапросаЕдиницы.ИмяСправочника = "ЕдиницыИзмеренияВЕТИС";
	ПараметрыЗапросаЕдиницы.АдресРесурса   = "platform/services/2.1/DictionaryService";
	ПараметрыЗапросаЕдиницы.ИмяЭлемента    = "Unit";
	
	Отказ  = Ложь;
	offset = 0;
	count  = 500;
	Пока count>0 Цикл
		
		ПараметрыЗапроса.Вставить("ПараметрыСписка", Новый Структура);
		ПараметрыЗапроса.ПараметрыСписка.Вставить("count",  count);
		ПараметрыЗапроса.ПараметрыСписка.Вставить("offset", offset);
		
		РезультатЗапроса = ПолучитьДанныеСправочников(НастройкаПодключения, ПараметрыЗапроса, Отказ);
		
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
		
		Для Каждого ТекущаяЗапись Из РезультатЗапроса.Unit Цикл
			ЗагрузитьЕдиницуИзмерения(НастройкаПодключения, ПараметрыЗапросаЕдиницы, ТекущаяЗапись);
		КонецЦикла;
		
		offset = offset + count;
		count  = Мин(500, РезультатЗапроса.total-offset);
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьЗаболевания()

//Процедура ЗапроситьРегионы(Форма,ТранспортныйМодуль) Экспорт
//	
//	НастройкаПодключения = ПолучитьНастройкуПодключения(ТранспортныйМодуль);
//	НастройкаПодключения.ИмяСправочника = "РегионыВЕТИС";
//	НастройкаПодключения.АдресРесурса = "platform/services/2.1/IkarService";
//	НастройкаПодключения.ИмяМетода = "getRegionListByCountry";
//	НастройкаПодключения.ИмяЭлемента = "RegionList";
//	СтруктураДанных = Новый Структура;

//	Отказ = Ложь;
//	offset = 0;
//	count = 500;
//	Пока count>0 Цикл
//		НастройкаПодключения.ПараметрыЗапроса.Вставить("ИмяСписка", "listOptions");
//		НастройкаПодключения.ПараметрыЗапроса.Вставить("ПараметрыСписка", Новый Структура);
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("count", count);
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("offset", offset);
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("countryGuid", Форма.Страна.Код);
//		ИнтеграцияВЕТИС.ПолучитьДанныеСправочников(НастройкаПодключения,СтруктураДанных,Отказ);
//	
//		Если Отказ Тогда
//			Прервать;
//		КонецЕсли;
//		
//		Для Каждого ТекущаяЗапись Из СтруктураДанных.Результат.region Цикл
//			
//			НайденнаяСсылка = Справочники.РегионыВЕТИС.НайтиПоКоду(ТекущаяЗапись.guid);
//			
//			Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
//				ИдентификаторЗаписи = НайденнаяСсылка.ИдентификаторЗаписи;
//				Если Форма.Элементы.СписокЗагрузкиСкрытьЗагруженные.Пометка И ИдентификаторЗаписи = ТекущаяЗапись.uuid Тогда
//					Продолжить;
//				КонецЕсли;
//			Иначе
//				ИдентификаторЗаписи = "";
//			КонецЕсли;
//			
//			НоваяСтрока = Форма.СписокЗагрузки.Добавить();
//			НоваяСтрока.name	= СокрЛП(ТекущаяЗапись.name);
//			НоваяСтрока.Ссылка	= НайденнаяСсылка;
//			НоваяСтрока.guid	= ТекущаяЗапись.guid;
//			НоваяСтрока.Используется	= Ложь;
//			НоваяСтрока.ИдентификаторЗаписи = ИдентификаторЗаписи;
//			НоваяСтрока.uuid = ТекущаяЗапись.uuid;
//			НоваяСтрока.view     = ?(ПустаяСтрока(ТекущаяЗапись.view), ТекущаяЗапись.name, ТекущаяЗапись.view);
//			НоваяСтрока.englishName = ТекущаяЗапись.englishName;

//		КонецЦикла;

//		offset = offset + count;
//		count      = Мин(500, СтруктураДанных.Результат.total-offset);
//	КонецЦикла;		

//КонецПроцедуры // ЗагрузитьНазначения()

//Процедура ЗапроситьСтраны(Форма,ТранспортныйМодуль) Экспорт
//	
//	НастройкаПодключения = ПолучитьНастройкуПодключения(ТранспортныйМодуль);
//	НастройкаПодключения.ИмяСправочника = "СтраныВЕТИС";
//	НастройкаПодключения.АдресРесурса = "platform/services/2.1/IkarService";
//	НастройкаПодключения.ИмяМетода = "getAllCountryList";
//	НастройкаПодключения.ИмяЭлемента = "CountryList";
//	СтруктураДанных = Новый Структура;

//	Отказ = Ложь;
//	offset = 0;
//	count = 500;
//	Пока count>0 Цикл
//		НастройкаПодключения.ПараметрыЗапроса.Вставить("ИмяСписка", "listOptions");
//		НастройкаПодключения.ПараметрыЗапроса.Вставить("ПараметрыСписка", Новый Структура);
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("count", count);
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("offset", offset);
//		ИнтеграцияВЕТИС.ПолучитьДанныеСправочников(НастройкаПодключения,СтруктураДанных,Отказ);
//	
//		Если Отказ Тогда
//			Прервать;
//		КонецЕсли;
//		
//		Для Каждого ТекущаяЗапись Из СтруктураДанных.Результат.Country Цикл
//			
//			НайденнаяСсылка = Справочники.СтраныВЕТИС.НайтиПоКоду(ТекущаяЗапись.guid);
//			
//			Если ЗначениеЗаполнено(НайденнаяСсылка) Тогда
//				ИдентификаторЗаписи = НайденнаяСсылка.ИдентификаторЗаписи;
//				Если Форма.Элементы.СписокЗагрузкиСкрытьЗагруженные.Пометка И ИдентификаторЗаписи = ТекущаяЗапись.uuid Тогда
//					Продолжить;
//				КонецЕсли;
//			Иначе
//				ИдентификаторЗаписи = "";
//			КонецЕсли;
//			
//			НоваяСтрока = Форма.СписокЗагрузки.Добавить();
//			НоваяСтрока.name	= СокрЛП(ТекущаяЗапись.name);
//			НоваяСтрока.Ссылка	= НайденнаяСсылка;
//			НоваяСтрока.guid	= ТекущаяЗапись.guid;
//			НоваяСтрока.Используется	= Ложь;
//			НоваяСтрока.ИдентификаторЗаписи = ИдентификаторЗаписи;
//			НоваяСтрока.uuid = ТекущаяЗапись.uuid;
//			НоваяСтрока.fullName     = ТекущаяЗапись.fullName;
//			НоваяСтрока.englishName = ТекущаяЗапись.englishName;

//		КонецЦикла;

//		offset = offset + count;
//		count      = Мин(500, СтруктураДанных.Результат.total-offset);
//	КонецЦикла;		

//КонецПроцедуры // ЗагрузитьНазначения()

Процедура ЗагрузитьУсловияРегионализации(НастройкаПодключения, ТранспортныйМодуль,Заболевание = Неопределено) Экспорт
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
	ПараметрыЗапроса.ИмяСправочника = "УсловияПеремещенияВЕТИС";
	ПараметрыЗапроса.АдресРесурса   = "platform/services/2.1/RegionalizationService";
	ПараметрыЗапроса.ИмяМетода      = "getR13nConditionList";
	ПараметрыЗапроса.ИмяЭлемента    = "r13nConditionList";
	ПараметрыЗапроса.Вставить("ИмяСписка", "listOptions, disease");
	
	ПараметрыЗапросаУсловия = ПолучитьПараметрыЗапроса();
	ПараметрыЗапросаУсловия.ИмяСправочника = "УсловияПеремещенияВЕТИС";
	ПараметрыЗапросаУсловия.АдресРесурса   = "platform/services/2.1/RegionalizationService";
	ПараметрыЗапросаУсловия.ИмяЭлемента    = "r13nConditionList";
	
	ЗаболеваниеКод = Неопределено;
	Если ЗначениеЗаполнено(Заболевание) Тогда
		ЗаболеваниеКод = Заболевание.Код;
	КонецЕсли;
	
	//СтруктураДанных = Новый Структура;
	УсловияРегионализации = Новый Массив;
	
	Отказ  = Ложь;
	offset = 0;
	count  = 500;
	Пока count > 0 Цикл
		
		ПараметрыЗапроса.Вставить("ПараметрыСписка", Новый Структура);
		ПараметрыЗапроса.ПараметрыСписка.Вставить("count",  count);
		ПараметрыЗапроса.ПараметрыСписка.Вставить("offset", offset);
		
		Если ЗначениеЗаполнено(ЗаболеваниеКод) Тогда
			ПараметрыЗапроса.ПараметрыСписка.Вставить("guid", ЗаболеваниеКод);
		КонецЕсли;
		
		РезультатЗапроса = ПолучитьДанныеСправочников(НастройкаПодключения, ПараметрыЗапроса, Отказ);
	
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
		
		Для Каждого ТекущаяЗапись Из РезультатЗапроса.condition Цикл
			ЗагрузитьУсловиеРегионализации(НастройкаПодключения, ПараметрыЗапросаУсловия, ТекущаяЗапись);
		КонецЦикла;
		
		offset = offset + count;
		count  = Мин(500, РезультатЗапроса.total-offset);
		
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьУсловияРегионализации()

//Процедура ЗагрузитьПользователей(ТранспортныйМодуль,Логин) Экспорт
//	
//	НастройкаПодключения = ПолучитьНастройкуПодключения(ТранспортныйМодуль);
//	НастройкаПодключения.ИмяСправочника = "ПользоваетлиВЕТИС";
//	НастройкаПодключения.АдресРесурса = "platform/services/2.1/ApplicationManagementService";
//	НастройкаПодключения.ИмяМетода = "getBusinessEntityUserList";
//	НастройкаПодключения.ИмяЭлемента = "BusinessEntityUserList";
//	
//	СтруктураДанных = Новый Структура;
//	Отказ = Ложь;
//	offset = 0;
//	count = 500;
//	Пока count>0 Цикл
//		НастройкаПодключения.ПараметрыЗапроса.Вставить("ИмяСписка", "listOptions,initiator");
//		НастройкаПодключения.ПараметрыЗапроса.Вставить("ПараметрыСписка", Новый Структура);
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("count", count);
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("offset", offset);
//		
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("login", Логин);
//		НастройкаПодключения.ПараметрыЗапроса.ПараметрыСписка.Вставить("localTransactionId", Новый УникальныйИдентификатор);
//		
//		ИнтеграцияВЕТИС.ПолучитьДанныеСправочников(НастройкаПодключения,СтруктураДанных,Отказ);
//	
//		Если Отказ Тогда
//			Прервать;
//		КонецЕсли;
//				
//		//Для Каждого ТекущаяЗапись Из СтруктураДанных.Результат.disease Цикл
//		//	СоздатьЗаболевание(ТранспортныйМодуль,ТекущаяЗапись);
//		//КонецЦикла;
//		//offset = offset + count;
//		count      = Мин(500, СтруктураДанных.Результат.total-offset);
//	КонецЦикла;
//	
//КонецПроцедуры // ЗагрузитьЗаболевания()

#КонецОбласти

#Область ВыгрузкаЗаявок

Функция ПередатьСообщениеВСервисОбработкиЗаявок(ЭлементОчереди, РеквизитыСообщения, НастройкаПодключения, ПараметрыОбмена) Экспорт
	
	ИсходящееСообщение = ЭлементОчереди.Сообщение;
	
	РезультатОбработкиОтвета = Новый Структура;
	РезультатОбработкиОтвета.Вставить("НовыйСтатус");
	РезультатОбработкиОтвета.Вставить("ТекстОшибки");
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса");
	ВозвращаемоеЗначение.Вставить("РезультатОбработкиОтвета", РезультатОбработкиОтвета);
	ВозвращаемоеЗначение.Вставить("ИсходящееСообщение");
	ВозвращаемоеЗначение.Вставить("ВходящееСообщение");
	ВозвращаемоеЗначение.Вставить("Документ");
	ВозвращаемоеЗначение.Вставить("ДокументОснование");
	// Для обработки очереди в фоне
	ВозвращаемоеЗначение.Вставить("ИдентификаторЗапроса");
	ВозвращаемоеЗначение.Вставить("ПараметрыЗапроса");
	ВозвращаемоеЗначение.Вставить("ДатаСоздания");
	ВозвращаемоеЗначение.Вставить("РеквизитыВходящегоСообщения");
	
	ДокументСсылка       = РеквизитыСообщения.Объект;
	//ДокументОснование  = РеквизитыСообщения.ДокументОснование;
	ВидОперации          = РеквизитыСообщения.ВидОперации;
	//ФорматОбмена       = РеквизитыСообщения.ФорматОбмена;
	ХозяйствующийСубъект = РеквизитыСообщения.ХозяйствующийСубъект;
	Предприятие          = РеквизитыСообщения.Предприятие;
	
	ВозвращаемоеЗначение.Документ          = ДокументСсылка;
	//ВозвращаемоеЗначение.ДокументОснование = ДокументОснование;
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
	ПараметрыЗапроса.ИмяМетода        = "submitApplication";
	ПараметрыЗапроса.ПространствоИмен = "http://api.vetrf.ru/schema/cdm/application/ws-definitions";
	//ПараметрыЗапроса.Сервис           = Перечисления.СервисыВЕТИС.ОбработкаЗаявок;
	ПараметрыЗапроса.ИмяЭлемента      = "application";
	ПараметрыЗапроса.АдресРесурса     = "platform/services/2.1/ApplicationManagementService";
	//ПараметрыЗапроса.Представление    = НСтр("ru = 'заявка'");
	
	РеквизитыИсходящегоСообщения = Неопределено;
	Если РеквизитыСообщения.РеквизитыИсходящегоСообщения <> Неопределено Тогда
		РеквизитыИсходящегоСообщения = РеквизитыСообщения.РеквизитыИсходящегоСообщения.Получить();
		ТекстСообщенияXML = РеквизитыИсходящегоСообщения.ТекстСообщенияXML;
	ИначеЕсли ТипЗнч(ИсходящееСообщение) <> Тип("Строка") Тогда
		ТекстСообщенияXML = ИнтеграцияГосИС.ТекстСообщенияXMLИзПротокола(ИсходящееСообщение);
	Иначе
		ВызватьИсключение НСтр("ru = 'Внутренняя ошибка'");
	КонецЕсли;
	
	ТекстОшибки = "";
	РезультатОтправкиЗапроса = ОтправитьЗапрос(ТекстСообщенияXML, ПараметрыЗапроса.ИмяМетода, НастройкаПодключения, ПараметрыЗапроса);
	
	//РезультатОтправкиЗапроса = Неопределено;
	//
	//Если РезультатОтправкиЗапроса = Неопределено Тогда
	//РезультатОтправкиЗапроса = ИнтеграцияВЕТИСВызовСервера.ОтправитьЗапрос(
	//		ТекстСообщенияXML,
	//		ПараметрыЗапроса.Сервис, ПараметрыЗапроса.ИмяМетода, НастройкаПодключения);
	//КонецЕсли;
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.КодСостояния = 408 Тогда
		
		//ТипыОперацийСОшибкойСервиса = Новый Массив;
		//ТипыОперацийСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВЕТИС.ЗапросНаОформлениеВходящейПартии);
		//ТипыОперацийСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВЕТИС.ЗапросПакетногоГашенияВСД);
		//ТипыОперацийСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВЕТИС.ЗапросНаОформлениеПроизводственнойПартии);
		//ТипыОперацийСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВЕТИС.ЗапросНаОформлениеТранспортнойПартии);
		//ТипыОперацийСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВЕТИС.ЗапросНаОформлениеРезультатовИнвентаризации);
		//ТипыОперацийСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВЕТИС.ЗапросНаОбъединениеЗаписейСкладскогоЖурнала);
		//
		//Если ТипыОперацийСОшибкойСервиса.Найти(ВидОперации) <> Неопределено Тогда
		//	
		//	ИнтеграцияВЕТИС.ЗафиксироватьОшибкуСервиса(ЭлементОчереди, ПараметрыОбмена);
		//	
		//	ДополнительныеПараметры = Новый Структура;
		//	ДополнительныеПараметры.Вставить("ЕстьОшибкиСервиса", Истина);
		//	
		//	ПолноеИмя = ДокументСсылка.Метаданные().ПолноеИмя();
		//	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
		//	НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПередачиДанных(
		//		ДокументСсылка,
		//		ВидОперации,
		//		Перечисления.СтатусыОбработкиСообщенийВЕТИС.Ошибка,
		//		ДополнительныеПараметры);
		//	
		//	ИнтеграцияВЕТИС.УдалитьСообщениеИзОчередиПолученияРезультатовОбработкиЗаявокВЕТИС(
		//		ЭлементОчереди.Сообщение,
		//		Истина);
		//	
		//	ТекстОшибки = НСтр("ru = 'При отправке запроса возникла ошибка HTTP 408: Timeout'");
		//	
		//	РеквизитыВходящегоСообщения = Новый Структура;
		//	РеквизитыВходящегоСообщения.Вставить("ТипСообщения",         Перечисления.ВходящееИсходящееСобытие.Входящее);
		//	РеквизитыВходящегоСообщения.Вставить("ВидОперации",           ВидОперации);
		//	РеквизитыВходящегоСообщения.Вставить("Документ",             ДокументСсылка);
		//	РеквизитыВходящегоСообщения.Вставить("СообщениеОснование",   ИсходящееСообщение);
		//	РеквизитыВходящегоСообщения.Вставить("Описание",             ТекстОшибки);
		//	РеквизитыВходящегоСообщения.Вставить("ИдентификаторЗапроса", Неопределено);
		//	//РеквизитыВходящегоСообщения.Вставить("ФорматОбмена",         ФорматОбмена);
		//	РеквизитыВходящегоСообщения.Вставить("ХозяйствующийСубъект",        ХозяйствующийСубъект);
		//	РеквизитыВходящегоСообщения.Вставить("Предприятие",                 Предприятие);
		//	РеквизитыВходящегоСообщения.Вставить("СтатусОбработки",             Перечисления.СтатусыОбработкиСообщенийВЕТИС.ОшибкаОтправки);
		//	РеквизитыВходящегоСообщения.Вставить("ДатаФормированияРезультата",  ТекущаяУниверсальнаяДата());
		//	
		//	РеквизитыВходящегоСообщенияВХранилищеЗначения = Новый ХранилищеЗначения(РеквизитыВходящегоСообщения);
		//	
		//	ВозвращаемоеЗначение.РеквизитыВходящегоСообщения = РеквизитыВходящегоСообщенияВХранилищеЗначения;
		//	
		//	ВходящееСообщение = ИнтеграцияВЕТИС.ДобавитьЗаписьВПротоколОбмена(
		//		ТекстОшибки,
		//		РеквизитыВходящегоСообщения).Ссылка;
		//	
		//	ВозвращаемоеЗначение.ИсходящееСообщение = ИсходящееСообщение;
		//	ВозвращаемоеЗначение.ВходящееСообщение  = ВходящееСообщение;
		//	ВозвращаемоеЗначение.РезультатОбработкиОтвета.НовыйСтатус = НовыйСтатус;
		//	
		//	Возврат ВозвращаемоеЗначение;
		//	
		//КонецЕсли;
		
	КонецЕсли;
	
	Если РезультатОтправкиЗапроса.ТекстСообщенияXMLПолучен Тогда
		
		ТекстВходящегоСообщенияXML = РезультатОтправкиЗапроса.ТекстВходящегоСообщенияSOAP;
		
		ДанныеОбработки = ОбработатьОтветНаПередачуДанных(РезультатОтправкиЗапроса, ПараметрыЗапроса, ВидОперации, ПараметрыОбмена);
		
		Если ЗначениеЗаполнено(ДанныеОбработки.ТекстОшибки) Тогда
			Если ЗначениеЗаполнено(ДокументСсылка) Тогда
				ВозвращаемоеЗначение.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Сообщение по документу %1 не принято ВетИС:
					           |Текст ошибки: %2'"),
					ДокументСсылка,
					ДанныеОбработки.ТекстОшибки);
				Возврат ВозвращаемоеЗначение;
			Иначе
				ВозвращаемоеЗначение.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Сообщение не принято ВетИС:
					           |Текст ошибки: %1'"),
					ДанныеОбработки.ТекстОшибки);
				Возврат ВозвращаемоеЗначение;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеОбработки.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.Ошибка Тогда
			ИдентификаторЗапроса = "";
		Иначе
			ИдентификаторЗапроса = ДанныеОбработки.Результат.applicationId;
		КонецЕсли;
		
		РеквизитыВходящегоСообщения = Новый Структура;
		РеквизитыВходящегоСообщения.Вставить("ТипСообщения",         Перечисления.ВходящееИсходящееСобытие.Входящее);
		РеквизитыВходящегоСообщения.Вставить("ВидОперации",           ВидОперации);
		РеквизитыВходящегоСообщения.Вставить("Документ",             ДокументСсылка);
		РеквизитыВходящегоСообщения.Вставить("СообщениеОснование",   ИсходящееСообщение);
		РеквизитыВходящегоСообщения.Вставить("Описание",             ДанныеОбработки.ТекстОшибки);
		РеквизитыВходящегоСообщения.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса);
		РеквизитыВходящегоСообщения.Вставить("ХозяйствующийСубъект",        ХозяйствующийСубъект);
		РеквизитыВходящегоСообщения.Вставить("Предприятие",                 Предприятие);
		РеквизитыВходящегоСообщения.Вставить("СтатусОбработки",             ДанныеОбработки.СтатусОбработки);
		РеквизитыВходящегоСообщения.Вставить("ДатаФормированияРезультата",  УниверсальноеВремя(ДанныеОбработки.Результат.rcvDate));
		
		РеквизитыВходящегоСообщенияВХранилищеЗначения = Новый ХранилищеЗначения(РеквизитыВходящегоСообщения);
		
		РезультатДобавленияВОчередь = ОбновитьИдентификаторЗаявкиСообщенияОчереди(ХозяйствующийСубъект, Предприятие,
			ИсходящееСообщение,
			ИдентификаторЗапроса, РеквизитыВходящегоСообщенияВХранилищеЗначения, ДанныеОбработки.СтатусОбработки);
		
		ВозвращаемоеЗначение.РеквизитыВходящегоСообщения = РеквизитыВходящегоСообщенияВХранилищеЗначения;
		
		//Если ТипЗнч(ИсходящееСообщение) <> Тип("Строка") Тогда
		//	
		//	УстановитьПривилегированныйРежим(Истина);
		//	
		//	ИсходящееСообщениеОбъект = ИсходящееСообщение.ПолучитьОбъект();
		//	ИсходящееСообщениеОбъект.ИдентификаторЗапроса = ИдентификаторЗапроса;
		//	ИсходящееСообщениеОбъект.Записать();
		//	
		//	УстановитьПривилегированныйРежим(Ложь);
		//	
		//	ВходящееСообщение = ИнтеграцияВЕТИС.ДобавитьЗаписьВПротоколОбмена(
		//		ТекстВходящегоСообщенияXML,
		//		РеквизитыВходящегоСообщения).Ссылка;
		//	
		//КонецЕсли;
		
		// Новый статус возвращается документом если ВидОперации - не попытка восстановления.
		Если ЗначениеЗаполнено(ДокументСсылка)
			И ВидОперации <> Перечисления.ВидыОперацийВЕТИС.ЗапросИзмененныхВСД
			И ВидОперации <> Перечисления.ВидыОперацийВЕТИС.ЗапросИзмененныхЗаписейСкладскогоЖурнала
			И ВидОперации <> Перечисления.ВидыОперацийВЕТИС.ЗапросНаРегистрациюИзменениеПродукции
			И Метаданные.РегистрыСведений.СтатусыДокументовВЕТИС.Измерения.Документ.Тип.СодержитТип(ТипЗнч(ДокументСсылка)) Тогда
			
			ПолноеИмя = ДокументСсылка.Метаданные().ПолноеИмя();
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
			НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПередачиДанных(ДокументСсылка, ВидОперации, ДанныеОбработки.СтатусОбработки);
			НовыйСтатус = ДанныеОбработки.СтатусОбработки;
			
		Иначе
			
			НовыйСтатус = ДанныеОбработки.СтатусОбработки;
			
		КонецЕсли;
		
		//ВозвращаемоеЗначение.ВходящееСообщение                    = ВходящееСообщение;
		ВозвращаемоеЗначение.ИсходящееСообщение                   = ИсходящееСообщение;
		ВозвращаемоеЗначение.РезультатОбработкиОтвета.НовыйСтатус = НовыйСтатус;
		
		ВозвращаемоеЗначение.ИдентификаторЗапроса = ИдентификаторЗапроса;
		ВозвращаемоеЗначение.ДатаСоздания         = РезультатДобавленияВОчередь.ДатаСоздания;
		
	Иначе
		
		Если РеквизитыИсходящегоСообщения <> Неопределено Тогда
			ОписаниеОперации = РеквизитыИсходящегоСообщения.Описание;
		ИначеЕсли ТипЗнч(ИсходящееСообщение) <> Тип("Строка") Тогда
			ОписаниеОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходящееСообщение, "Описание");
		Иначе
			ОписаниеОперации = НСтр("ru = '<нет описания>'");
		КонецЕсли;
		
		ВозвращаемоеЗначение.РезультатОбработкиОтвета.ТекстОшибки = СтрШаблон(
			НСтр("ru='Данные не переданы в ВетИС:
						|%1
						|По причине:
						|%2'"),
			ОписаниеОперации,
			РезультатОтправкиЗапроса.ТекстОшибки);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область ОтправкаДанных

Процедура СинхронизироватьСВетИС()
	
	ДатаНачала    = НачалоДня(ТекущаяДата());
	ДатаОкончания = КонецДня(ТекущаяДата());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",        ДатаНачала);
	Запрос.УстановитьПараметр("ДатаСинхронизации", ТекущаяДата());
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НастройкиПодключенияВЕТИС.ХозяйствующийСубъект,
	|	ХозяйствующиеСубъектыПредприятия.Предприятие,
	|	&ДатаНачала КАК ДатаНачала
	|ПОМЕСТИТЬ
	|	БазовыеДанныеСинхронизации
	|ИЗ
	|	РегистрСведений.НастройкиПодключенияВЕТИС КАК НастройкиПодключенияВЕТИС
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС.Предприятия КАК ХозяйствующиеСубъектыПредприятия
	|ПО
	|	НастройкиПодключенияВЕТИС.ХозяйствующийСубъект = ХозяйствующиеСубъектыПредприятия.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	НастройкиПодключенияВЕТИС.ХозяйствующийСубъект,
	|	ХозяйствующиеСубъектыПредприятия.Предприятие
	|;
	|
	|ВЫБРАТЬ
	|	БазовыеДанныеСинхронизации.ХозяйствующийСубъект,
	|	БазовыеДанныеСинхронизации.Предприятие,
	|	БазовыеДанныеСинхронизации.Предприятие.Код КАК guidПредприятия,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВЕТИС.ЗапросИзмененныхВСД) КАК ВидОперации,
	|	ЕСТЬNULL(ДанныеСинхронизацииВЕТИС.ДатаСинхронизации, БазовыеДанныеСинхронизации.ДатаНачала) КАК ДатаНачала
	|ИЗ
	|	БазовыеДанныеСинхронизации КАК БазовыеДанныеСинхронизации
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ДанныеСинхронизацииВЕТИС КАК ДанныеСинхронизацииВЕТИС
	|ПО
	|	БазовыеДанныеСинхронизации.ХозяйствующийСубъект = ДанныеСинхронизацииВЕТИС.ХозяйствующийСубъект И 
	|	БазовыеДанныеСинхронизации.Предприятие = ДанныеСинхронизацииВЕТИС.Предприятие И 
	|	ДанныеСинхронизацииВЕТИС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВЕТИС.ЗапросИзмененныхВСД)
	|ГДЕ
	|	ДанныеСинхронизацииВЕТИС.ДатаСледующейСинхронизации ЕСТЬ NULL ИЛИ 
	|	ДанныеСинхронизацииВЕТИС.ДатаСледующейСинхронизации <= &ДатаСинхронизации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БазовыеДанныеСинхронизации.ХозяйствующийСубъект,
	|	БазовыеДанныеСинхронизации.Предприятие,
	|	БазовыеДанныеСинхронизации.Предприятие.Код КАК guidПредприятия,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВЕТИС.ЗапросИзмененныхЗаписейСкладскогоЖурнала) КАК ВидОперации,
	|	ЕСТЬNULL(ДанныеСинхронизацииВЕТИС.ДатаСинхронизации, БазовыеДанныеСинхронизации.ДатаНачала) КАК ДатаНачала
	|ИЗ
	|	БазовыеДанныеСинхронизации КАК БазовыеДанныеСинхронизации
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ДанныеСинхронизацииВЕТИС КАК ДанныеСинхронизацииВЕТИС
	|ПО
	|	БазовыеДанныеСинхронизации.ХозяйствующийСубъект = ДанныеСинхронизацииВЕТИС.ХозяйствующийСубъект И 
	|	БазовыеДанныеСинхронизации.Предприятие = ДанныеСинхронизацииВЕТИС.Предприятие И 
	|	ДанныеСинхронизацииВЕТИС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВЕТИС.ЗапросИзмененныхЗаписейСкладскогоЖурнала)
	|ГДЕ
	|	ДанныеСинхронизацииВЕТИС.ДатаСледующейСинхронизации ЕСТЬ NULL ИЛИ 
	|	ДанныеСинхронизацииВЕТИС.ДатаСледующейСинхронизации <= &ДатаСинхронизации
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДанныеДляВыгрузки = Новый Структура;
		ДанныеДляВыгрузки.Вставить("ХозяйствующийСубъект",   Выборка.ХозяйствующийСубъект);
		ДанныеДляВыгрузки.Вставить("Предприятие",            Выборка.Предприятие);
		ДанныеДляВыгрузки.Вставить("guidПредприятия",        Выборка.guidПредприятия);
		ДанныеДляВыгрузки.Вставить("ДатаНачала",             Выборка.ДатаНачала-3600);
		ДанныеДляВыгрузки.Вставить("ДатаОкончания",          ДатаОкончания);
		ДанныеДляВыгрузки.Вставить("ДатаСинхронизации",      ТекущаяДата());
		
		ПараметрыОбмена = ИнтеграцияВЕТИС.ПараметрыОбмена(Выборка.ХозяйствующийСубъект,,, Истина);
		
		РезультатОбмена = ИнтеграцияВЕТИСВызовСервера.ПодготовитьЗапрос(Выборка.ХозяйствующийСубъект, Выборка.Предприятие, Выборка.ВидОперации, ДанныеДляВыгрузки,, ПараметрыОбмена);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 500
	|	ВСДВЕТИС.Отправитель,
	|	ВСДВЕТИС.ПредприятиеОтправитель,
	|	ВСДВЕТИС.ПредприятиеОтправитель.Код КАК guidПредприятия,
	|	ВСДВЕТИС.Идентификатор КАК Идентификатор,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВЕТИС.ЗапросВСД) КАК ВидОперации
	|ИЗ
	|	Документ.ВСДВЕТИС КАК ВСДВЕТИС
	|ГДЕ
	|	ВСДВЕТИС.ПометкаУдаления = ЛОЖЬ И 
	|	ВСДВЕТИС.ДатаОбновления = ДатаВремя(1, 1, 1) И 
	|	(НЕ ВСДВЕТИС.Отправитель = ЗНАЧЕНИЕ(Справочник.ХозяйствующиеСубъектыВетИС.ПустаяСсылка)) И 
	|	ВСДВЕТИС.Отправитель.Собственный = ИСТИНА
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 500
	|	ВСДВЕТИС.Получатель,
	|	ВСДВЕТИС.ПредприятиеПолучатель,
	|	ВСДВЕТИС.ПредприятиеПолучатель.Код КАК guidПредприятия,
	|	ВСДВЕТИС.Идентификатор КАК Идентификатор,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВЕТИС.ЗапросВСД) КАК ВидОперации
	|ИЗ
	|	Документ.ВСДВЕТИС КАК ВСДВЕТИС
	|ГДЕ
	|	ВСДВЕТИС.ПометкаУдаления = ЛОЖЬ И 
	|	ВСДВЕТИС.ДатаОбновления = ДатаВремя(1, 1, 1) И 
	|	(НЕ ВСДВЕТИС.Получатель = ЗНАЧЕНИЕ(Справочник.ХозяйствующиеСубъектыВетИС.ПустаяСсылка)) И 
	|	ВСДВЕТИС.Получатель.Собственный = ИСТИНА
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДанныеДляВыгрузки = Новый Структура;
		ДанныеДляВыгрузки.Вставить("ХозяйствующийСубъект",   Выборка.ХозяйствующийСубъект);
		ДанныеДляВыгрузки.Вставить("Предприятие",            Выборка.Предприятие);
		ДанныеДляВыгрузки.Вставить("guidПредприятия",        Выборка.guidПредприятия);
		ДанныеДляВыгрузки.Вставить("uuid",                   Выборка.Идентификатор);
		
		ПараметрыОбмена = ИнтеграцияВЕТИС.ПараметрыОбмена(Выборка.ХозяйствующийСубъект,,, Истина);
		
		РезультатОбмена = ИнтеграцияВЕТИСВызовСервера.ПодготовитьЗапрос(Выборка.ХозяйствующийСубъект, Выборка.Предприятие, Выборка.ВидОперации, ДанныеДляВыгрузки,, ПараметрыОбмена);
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура УдалитьСообщениеВиртуальнойОчереди(ЭлементОчередиДокумент, ПараметрыОбмена) Экспорт
	
	ЭлементОчереди = Неопределено;
	
	Если ТипЗнч(ЭлементОчередиДокумент) <> Тип("СтрокаТаблицыЗначений") Тогда
		Для Каждого СтрокаТЧ Из ПараметрыОбмена.ОчередьСообщений Цикл
			Если СтрокаТЧ.Объект = ЭлементОчередиДокумент Тогда
				ЭлементОчереди = СтрокаТЧ;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЭлементОчереди = ЭлементОчередиДокумент;
	КонецЕсли;
	
	Если ЭлементОчереди = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Сообщение1", ЭлементОчереди.Сообщение);
	НайденныеСтроки = ПараметрыОбмена.ЗависимостиСообщений.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
		ПараметрыОбмена.ЗависимостиСообщений.Удалить(СтрокаТЧ);
	КонецЦикла;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Сообщение2", ЭлементОчереди.Сообщение);
	НайденныеСтроки = ПараметрыОбмена.ЗависимостиСообщений.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
		ПараметрыОбмена.ЗависимостиСообщений.Удалить(СтрокаТЧ);
	КонецЦикла;
	
	ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
	
КонецПроцедуры

Функция ЭтоЗапросСписка(ВидОперации) Экспорт
	
	Возврат ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросВсехВСД
		Или ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросЗаписейСкладскогоЖурнала
		Или ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросИзмененныхЗаписейСкладскогоЖурнала
		Или ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросИзмененныхВСД;
	
КонецФункции

Функция ИнтервалМеждуЗапросамиСписковВыдержан(ПараметрыОбмена, Операция, Предприятие) Экспорт
	
	Если ЭтоЗапросСписка(Операция) Тогда
		
		ВремяОжиданияСледующегоЗапроса = ВремяОжиданияСледующегоЗапроса(ПараметрыОбмена, Предприятие, Операция);
		
		Если ПараметрыОбмена.ОжидатьНаСервере Тогда
			ИнтеграцияГосИС.Ожидать(ВремяОжиданияСледующегоЗапроса, ПараметрыОбмена);
		КонецЕсли;
		
		Возврат ВремяОжиданияСледующегоЗапроса = 0;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

Функция ОбновитьИдентификаторЗаявкиСообщенияОчереди(ХозяйствующийСубъект, Предприятие, Сообщение, ИдентификаторЗаявки, РеквизитыВходящегоСообщения = Неопределено, СтатусОбработки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ДатаСоздания");
	
	ДатаСоздания = ТекущаяУниверсальнаяДата();
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение",   Метаданные.РегистрыСведений.ЗапросыВЕТИС.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("ХозяйствующийСубъект",  Метаданные.РегистрыСведений.ЗапросыВЕТИС.Измерения.ХозяйствующийСубъект.Тип);
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Предприятие", Метаданные.РегистрыСведений.ЗапросыВЕТИС.Измерения.Предприятие.Тип);
		
		СтрокаБлокировки = ТаблицыБлокируемыхСсылок.Добавить();
		СтрокаБлокировки.Сообщение   = Сообщение;
		СтрокаБлокировки.ХозяйствующийСубъект  = ХозяйствующийСубъект;
		СтрокаБлокировки.Предприятие = Предприятие;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗапросыВЕТИС");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение",   "Сообщение");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХозяйствующийСубъект",  "ХозяйствующийСубъект");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Предприятие", "Предприятие");
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ЗапросыВЕТИС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(Сообщение);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Выбран() Тогда
			Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
				ЗаписьНабора.ИдентификаторЗаявки = ИдентификаторЗаявки;
				Если РеквизитыВходящегоСообщения <> Неопределено Тогда
					ЗаписьНабора.РеквизитыВходящегоСообщения = РеквизитыВходящегоСообщения;
				КонецЕсли;
				ЗаписьНабора.СтатусОбработки = СтатусОбработки;
			КонецЦикла;
		КонецЕсли;
		
		НаборЗаписей.Записать();
		
		ВозвращаемоеЗначение.ДатаСоздания = ДатаСоздания;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = СтрШаблон(
		НСтр("ru = 'При передаче сообщения %1 возникла ошибка:
		|Текст ошибки: %2'"),
		ИдентификаторЗаявки,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ИнтеграцияВЕТИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура УдалитьЗаявкуИзОчереди(ХозяйствующийСубъект, Предприятие, Сообщение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ДатаСоздания");
	
	ДатаСоздания = ТекущаяУниверсальнаяДата();
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение",   Метаданные.РегистрыСведений.ЗапросыВЕТИС.Измерения.Сообщение.Тип);
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("ХозяйствующийСубъект",  Метаданные.РегистрыСведений.ЗапросыВЕТИС.Измерения.ХозяйствующийСубъект.Тип);
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Предприятие", Метаданные.РегистрыСведений.ЗапросыВЕТИС.Измерения.Предприятие.Тип);
		
		СтрокаБлокировки = ТаблицыБлокируемыхСсылок.Добавить();
		СтрокаБлокировки.Сообщение   = Сообщение;
		СтрокаБлокировки.ХозяйствующийСубъект  = ХозяйствующийСубъект;
		СтрокаБлокировки.Предприятие = Предприятие;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗапросыВЕТИС");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХозяйствующийСубъект", "ХозяйствующийСубъект");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Предприятие", "Предприятие");
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ЗапросыВЕТИС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сообщение.Установить(Сообщение);
		НаборЗаписей.Отбор.ХозяйствующийСубъект.Установить(ХозяйствующийСубъект);
		НаборЗаписей.Отбор.Предприятие.Установить(Предприятие);
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = СтрШаблон(
		НСтр("ru = 'При удаления сообщения %1 возникла ошибка:
		|Текст ошибки: %2'"),
		Сообщение,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ИнтеграцияВЕТИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбработатьЭлементОчередиПередачиДанных(ЭлементОчереди, ПараметрыОбмена, ПроверитьИдентификаторЗаявки = Истина) Экспорт
	
	НастройкаПодключения = ПараметрыОбмена.НастройкиПодключения.Получить(ЭлементОчереди.ХозяйствующийСубъект);
	Если НастройкаПодключения <> Неопределено Тогда
		
		ЗначенияРеквизитов = Новый Структура;
		ЗначенияРеквизитов.Вставить("Объект",                       ЭлементОчереди.Объект);
		ЗначенияРеквизитов.Вставить("ВидОперации",                   ЭлементОчереди.ВидОперации);
		ЗначенияРеквизитов.Вставить("ХозяйствующийСубъект",         ЭлементОчереди.ХозяйствующийСубъект);
		ЗначенияРеквизитов.Вставить("Предприятие",                  ЭлементОчереди.Предприятие);
		ЗначенияРеквизитов.Вставить("Сообщение",                    ЭлементОчереди.Сообщение);
		ЗначенияРеквизитов.Вставить("РеквизитыИсходящегоСообщения", ЭлементОчереди.РеквизитыИсходящегоСообщения);
		
		НачатьТранзакцию();
		
		Попытка
			
			УстановитьПривилегированныйРежим(Истина);
			
			Блокировка = Новый БлокировкаДанных;
			
			ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
			ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ЗапросыВЕТИС.Измерения.Сообщение.Тип);
			ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗапросыВЕТИС");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
			
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.ЗапросыВЕТИС.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Выбран() Тогда
				
				Если ПроверитьИдентификаторЗаявки Тогда
					Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
						Если ЗначениеЗаполнено(ЗаписьНабора.ИдентификаторЗаявки) Тогда
							
							ОтменитьТранзакцию();
							
							// Сообщение уже передано в ВетИС, но еще не обработано.
							ЭлементОчереди.ИдентификаторЗаявки = ЗаписьНабора.ИдентификаторЗаявки;
							Возврат;
							
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				РезультатыПередачиСообщения = ПередатьСообщениеВСервисОбработкиЗаявок(
					ЭлементОчереди,
					ЗначенияРеквизитов,
					НастройкаПодключения, ПараметрыОбмена);
				
			Иначе
				
				ОтменитьТранзакцию();
				
				// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
				//УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
				УдалитьЗаявкуИзОчереди(ЭлементОчереди.ХозяйствующийСубъект, ЭлементОчереди.Предприятие, ЭлементОчереди.Сообщение);
				Возврат;
				
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'При передаче сообщения по документу %1 возникла ошибка:
				           |Текст ошибки: %2'"),
				ЭлементОчереди.Объект,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ИнтеграцияВЕТИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
			
			ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
		КонецПопытки;
		
		ТекстОшибки = "";
		Если ЗначениеЗаполнено(РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки) Тогда
			ТекстОшибки = РезультатыПередачиСообщения.РезультатОбработкиОтвета.ТекстОшибки;
		ИначеЕсли ЗначениеЗаполнено(РезультатыПередачиСообщения.РезультатОтправкиЗапроса.ТекстОшибки) Тогда
			ТекстОшибки = РезультатыПередачиСообщения.РезультатОтправкиЗапроса.ТекстОшибки;
		КонецЕсли;
		
		ЭлементОчереди.ТекстОшибки = ТекстОшибки;
		
		Передано = Не ЗначениеЗаполнено(ТекстОшибки);
		
		//Если Не ЭлементОчереди.ЕстьОшибкиСервиса
		//	Или ЭлементОчереди.КоличествоПопытокВосстановления = ПараметрыОбмена.КоличествоПопытокВосстановленияДокументов Тогда
		Если Не ЭлементОчереди.ЕстьОшибкиСервиса Тогда
			
			СтрокаРезультата = ИнтеграцияВЕТИСКлиентСервер.СтруктураИзменения();
			СтрокаРезультата.ХозяйствующийСубъект = ЭлементОчереди.ХозяйствующийСубъект;
			СтрокаРезультата.Предприятие          = ЭлементОчереди.Предприятие;
			СтрокаРезультата.ВидОперации             = ЭлементОчереди.ВидОперации;
			//СтрокаРезультата.ФорматОбмена         = ЭлементОчереди.ФорматОбмена;
			
			СтрокаРезультата.ТекстОшибки           = ТекстОшибки;
			СтрокаРезультата.ПодготовленоКПередаче = Истина;
			СтрокаРезультата.Передано              = Передано;
			СтрокаРезультата.Принято               = Ложь;
			СтрокаРезультата.ЕстьОшибкиСервиса     = ЭлементОчереди.ЕстьОшибкиСервиса;
			
			СтрокаРезультата.ИсходящееСообщение = РезультатыПередачиСообщения.ИсходящееСообщение;
			СтрокаРезультата.ВходящееСообщение  = РезультатыПередачиСообщения.ВходящееСообщение;
			
			СтрокаРезультата.Объект            = РезультатыПередачиСообщения.Документ;
			//СтрокаРезультата.ДокументОснование = РезультатыПередачиСообщения.ДокументОснование;
			СтрокаРезультата.НовыйСтатус       = РезультатыПередачиСообщения.РезультатОбработкиОтвета.НовыйСтатус;
			
			ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
			
		КонецЕсли;
		
		Если Не Передано
			И (ПараметрыОбмена.КоличествоПовторныхЗапросов < 0
			Или ЭлементОчереди.КоличествоИтераций < ПараметрыОбмена.КоличествоПовторныхЗапросов) Тогда
			
			ЭлементОчереди.КоличествоИтераций = ЭлементОчереди.КоличествоИтераций + 1;
			
		Иначе
			
			Если Передано Тогда
				
				НайденнаяСтрока = ПараметрыОбмена.ОчередьСообщений.Найти(СтрокаРезультата.ИсходящееСообщение, "Сообщение");
				НайденнаяСтрока.ИдентификаторЗаявки         = РезультатыПередачиСообщения.ИдентификаторЗапроса;
				НайденнаяСтрока.РеквизитыВходящегоСообщения = РезультатыПередачиСообщения.РеквизитыВходящегоСообщения;
				
				Если ЭтоЗапросСписка(ЭлементОчереди.ВидОперации) Тогда
					//ПараметрыОбмена.ДатыПоследнегоЗапросаСписков.Вставить(ЭлементОчереди.Предприятие, ТекущаяДатаСеанса());
					
					ДатыПоследнегоЗапросаСписков = ПараметрыОбмена.ДатыПоследнегоЗапросаСписков.НайтиСтроки(Новый Структура("Предприятие, ВидОперации", ЭлементОчереди.Предприятие, ЭлементОчереди.ВидОперации));
					Если ДатыПоследнегоЗапросаСписков.Количество() = 0 Тогда
						ДатаПоследнегоЗапросаСписков = ПараметрыОбмена.ДатыПоследнегоЗапросаСписков.Добавить();
						ДатаПоследнегоЗапросаСписков.Предприятие = ЭлементОчереди.Предприятие;
						ДатаПоследнегоЗапросаСписков.ВидОперации = ЭлементОчереди.ВидОперации;
					Иначе
						ДатаПоследнегоЗапросаСписков = ДатыПоследнегоЗапросаСписков[0];
					КонецЕсли;
					ДатаПоследнегоЗапросаСписков.ДатаЗапуска = ТекущаяДатаСеанса();
					
					ПараметрыОбмена.ДатаПоследнегоЗапросаСписка = ТекущаяДатаСеанса();
				КонецЕсли;
				
			Иначе
				
				ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ДобавитьОтложенныйЭлементОчередиВИзменения(ЭлементОчереди, ПараметрыОбмена);
		
	КонецЕсли;
	
КонецПроцедуры

// Добавить сообщение в регистра сведений ОчередьПередачиДанныхВЕТИС.
//
// Параметры:
//  Сообщение - Справочник.ВЕТИСПрисоединенныеФайлы - сообщение, которое добавляется в очередь.
//  Реквизиты - Структура                           - реквизиты очереди сообщений ВетИС.
//
Функция ДобавитьСообщениеВОчередьНаПередачуДанных(Сообщение, Реквизиты)
	
	ТребуетсяРасчетОчереди = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НоваяЗапись = РегистрыСведений.ЗапросыВЕТИС.СоздатьМенеджерЗаписи();
	НоваяЗапись.Сообщение        = Сообщение;
	НоваяЗапись.ДатаСоздания     = ТекущаяУниверсальнаяДата();
	НоваяЗапись.ХозяйствующийСубъект       = Реквизиты.ХозяйствующийСубъект;
	НоваяЗапись.Предприятие      = Реквизиты.Предприятие;
	НоваяЗапись.Объект           = Реквизиты.Объект;
	НоваяЗапись.ВидОперации       = Реквизиты.ВидОперации;
	НоваяЗапись.ПараметрыЗапроса = Новый ХранилищеЗначения(Реквизиты.ПараметрыЗапроса);
	НоваяЗапись.СтатусОбработки  = Перечисления.СтатусыОбработкиСообщенийВЕТИС.КПередаче;
	НоваяЗапись.Приоритет        = ПолучитьЗначениеПараметраСтруктуры(Реквизиты, "Приоритет", 0);
	НоваяЗапись.РеквизитыИсходящегоСообщения = Новый ХранилищеЗначения(Реквизиты.РеквизитыИсходящегоСообщения);
	НоваяЗапись.Записать();
	
	//Если Реквизиты.ЗаписиСкладскогоЖурнала <> Неопределено Тогда
	//	
	//	Для Каждого КлючИЗначение Из Реквизиты.ЗаписиСкладскогоЖурнала Цикл
	//		
	//		ТребуетсяРасчетОчереди = Истина;
	//		
	//		НоваяЗапись = РегистрыСведений.ЗаписиСкладскогоЖурналаКПередачеВЕТИС.СоздатьМенеджерЗаписи();
	//		НоваяЗапись.Сообщение               = Сообщение;
	//		НоваяЗапись.ЗаписьСкладскогоЖурнала = КлючИЗначение.Ключ;
	//		
	//		НоваяЗапись.Записать();
	//		
	//	КонецЦикла
	//	
	//КонецЕсли;
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяРасчетОчереди", ТребуетсяРасчетОчереди);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Добавить запись в протокол обмена.
//
// Параметры:
//  ТекстСообщенияXML - Строка - Текст сообщения XML.
//  Реквизиты - Структура - Значения реквизитов сообщения.
//  ПроверятьХешБезСсылки - Булево - Признак проверки хеша без ссылки.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовоеСообщение - Булево - Это новое сообщение.
//   * Ссылка - СправочникСсылка.ВЕТИСПрисоединенныеФайлы - Ссылка на присоединенный файл.
//
Функция ДобавитьЗаписьВПротоколОбмена(ТекстСообщенияXML, Реквизиты, ПроверятьХешБезСсылки = Ложь) Экспорт
	
	Реквизиты.Вставить("ВладелецФайлов", Реквизиты.ХозяйствующийСубъект);
	Возврат ИнтеграцияГосИС.ДобавитьЗаписьВПротоколОбмена(
		Метаданные.Справочники.ВЕТИСПрисоединенныеФайлы,
		ТекстСообщенияXML,
		Реквизиты,
		ПроверятьХешБезСсылки);
	
КонецФункции

// Подготавливает сообщение к передаче в сервис ВетИС.
//
// Параметры:
//  ТекстСообщенияXML - Строка - Текст исходящего сообщения.
//  Реквизиты - Структура - Реквизиты передаваемого сообщения и свойства очереди, например:
//   * ТипСообщения - ПеречислениеСсылка.ТипыЗапросовИС - Тип сообщения.
//   * Операция - ПеречислениеСсылка.ВидыОперацийВЕТИС - Операция.
//   * Документ - ДокументСсылка - Документ.
//   * СообщениеОснование - СправочникСсылка.ВЕТИСПрисоединенныеФайлы - Сообщение-основание
//   * Описание - Строка - Описание сообщения.
//   * ИдентификаторЗапроса - Строка - Идентификатор запроса.
//   * ФорматОбмена - ПеречислениеСсылка.ФорматыОбменаВЕТИС - Формат обмена.
//   * СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийВЕТИС - Статус обработки сообщения.
//   * Версия - Число - Номер версии.
//  РеквизитыОчереди - Структура - Параметры очереди сообщений ВетИС
//
// Возвращаемое значение:
//  Структура - результат подготовки сообщения к отправке с полями:
//    * НовыйСтатус
//    * ИсходящееСообщение
//    * ТекстОшибки
//    * ТребуетсяРасчетОчереди
//
Функция ПодготовитьСообщениеКПередаче(ТекстСообщенияXML, Реквизиты, РеквизитыОчереди)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("НовыйСтатус",            Неопределено);
	ВозвращаемоеЗначение.Вставить("ИсходящееСообщение",     Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",            "");
	ВозвращаемоеЗначение.Вставить("ТребуетсяРасчетОчереди", Ложь);
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		//Если ЭтоЗапросСписка(Реквизиты.ВидОперации) И Не ЗначениеЗаполнено(Реквизиты.Объект) Тогда
		
		ИсходящееСообщение = Строка(Новый УникальныйИдентификатор);
		
		//Иначе
		//	
		//	ИсходящееСообщение = ДобавитьЗаписьВПротоколОбмена(
		//		ТекстСообщенияXML,
		//		Реквизиты).Ссылка;
		//	
		//КонецЕсли;
		
		ВозвращаемоеЗначение.ИсходящееСообщение = ИсходящееСообщение;
		
		РезультатДобавленияВОчередь = ДобавитьСообщениеВОчередьНаПередачуДанных(ИсходящееСообщение, РеквизитыОчереди);
		//ВозвращаемоеЗначение.ТребуетсяРасчетОчереди = РезультатДобавленияВОчередь.ТребуетсяРасчетОчереди;
		
		Если ЗначениеЗаполнено(Реквизиты.Объект) И 
			(НЕ ТипЗнч(Реквизиты.Объект) = Тип("ДокументСсылка.ВСДВЕТИС")) И 
			(НЕ ТипЗнч(Реквизиты.Объект) = Тип("СправочникСсылка.Номенклатура")) Тогда
			
			ПолноеИмя = Реквизиты.Объект.Метаданные().ПолноеИмя();
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
			НовыйСтатус = МенеджерОбъекта.ОбновитьСтатусПослеПодготовкиКПередачеДанных(Реквизиты.Объект, Реквизиты.ВидОперации);
			//НовыйСтатус = Перечисления.СтатусыОбработкиСообщенийВЕТИС.КПередаче;
			
		Иначе
			НовыйСтатус = Перечисления.СтатусыОбработкиСообщенийВЕТИС.КПередаче;
			//НовыйСтатус = Неопределено;
		КонецЕсли;
		
		ВозвращаемоеЗначение.НовыйСтатус = НовыйСтатус;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'При подготовке к передаче сообщения по документу %1 возникла ошибка:
			           |Текст ошибки: %2'"),
			Реквизиты.Объект,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ИнтеграцияВЕТИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		
		ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ВремяОжиданияСледующегоЗапроса(ПараметрыОбмена, Предприятие = Неопределено, ВидОперации = Неопределено) Экспорт
	Если Предприятие = Неопределено Тогда
		Если ПараметрыОбмена.ОчередьСообщений.Количество() = 0 Тогда
			ДатаПоследнегоЗапросаСписка = ПараметрыОбмена.ДатаПоследнегоЗапросаСписка;
		Иначе
			ЭлементОчереди = ПараметрыОбмена.ОчередьСообщений[0];
			Если ЭтоЗапросСписка(ЭлементОчереди.ВидОперации) Тогда
				//ДатаПоследнегоЗапросаСписка = ПараметрыОбмена.ДатыПоследнегоЗапросаСписков.Получить(ЭлементОчереди.Предприятие);
				ДатыПоследнегоЗапросаСписков = ПараметрыОбмена.ДатыПоследнегоЗапросаСписков.НайтиСтроки(Новый Структура("Предприятие, ВидОперации", ЭлементОчереди.Предприятие, ЭлементОчереди.ВидОперации));
				Если ДатыПоследнегоЗапросаСписков.Количество() = 0 Тогда
					ДатаПоследнегоЗапросаСписка = '00010101000000';
				Иначе
					ДатаПоследнегоЗапросаСписка = ДатыПоследнегоЗапросаСписков[0].ДатаЗапуска;
				КонецЕсли;
			Иначе
				ДатаПоследнегоЗапросаСписка = '00010101000000';
			КонецЕсли;
		КонецЕсли;
	Иначе
		
		Если ЭтоЗапросСписка(ВидОперации) Тогда
			ДатыПоследнегоЗапросаСписков = ПараметрыОбмена.ДатыПоследнегоЗапросаСписков.НайтиСтроки(Новый Структура("Предприятие, ВидОперации", Предприятие, ВидОперации));
			Если ДатыПоследнегоЗапросаСписков.Количество() = 0 Тогда
				ДатаПоследнегоЗапросаСписка = '00010101000000';
			Иначе
				ДатаПоследнегоЗапросаСписка = ДатыПоследнегоЗапросаСписков[0].ДатаЗапуска;
			КонецЕсли;
		Иначе
			ДатаПоследнегоЗапросаСписка = '00010101000000';
		КонецЕсли;
		
	КонецЕсли;
	
	РазрешеннаяДатаСледующегоЗапроса = ДатаПоследнегоЗапросаСписка + ПараметрыОбмена.ИнтервалМеждуЗапросамиСписков;
	ВремяОжиданияСледующегоЗапроса = РазрешеннаяДатаСледующегоЗапроса - ТекущаяДатаСеанса();
	Если ВремяОжиданияСледующегоЗапроса < 0 Тогда
		ВремяОжиданияСледующегоЗапроса = 0;
	КонецЕсли;
	
	Возврат ВремяОжиданияСледующегоЗапроса;
	
КонецФункции

Функция РеквизитыИсходящегоСообщения()
	
	Результат = Новый Структура;
	Результат.Вставить("СтатусОбработки", Перечисления.СтатусыОбработкиСообщенийВЕТИС.КПередаче);
	Результат.Вставить("ТипСообщения");
	Результат.Вставить("ВидОперации");
	Результат.Вставить("Объект");
	Результат.Вставить("СообщениеОснование");
	Результат.Вставить("Описание");
	Результат.Вставить("ИдентификаторЗапроса");
	//Результат.Вставить("ФорматОбмена");
	Результат.Вставить("ХозяйствующийСубъект");
	Результат.Вставить("Предприятие");
	Результат.Вставить("Версия");
	Результат.Вставить("ИдентификаторТранзакции");
	Результат.Вставить("ТекстСообщенияXML");
	Возврат Результат;
	
КонецФункции

Функция НоваяТаблицаОчередьСообщений() Экспорт
	
	ОчередьСообщений = Новый ТаблицаЗначений;
	ОчередьСообщений.Колонки.Добавить("ДатаСоздания");
	ОчередьСообщений.Колонки.Добавить("Сообщение");
	
	ОчередьСообщений.Колонки.Добавить("ХозяйствующийСубъект");
	ОчередьСообщений.Колонки.Добавить("Предприятие");
	ОчередьСообщений.Колонки.Добавить("ВидОперации");
	//ОчередьСообщений.Колонки.Добавить("ФорматОбмена");
	ОчередьСообщений.Колонки.Добавить("ПараметрыЗапроса");
	
	ОчередьСообщений.Колонки.Добавить("РеквизитыИсходящегоСообщения");
	ОчередьСообщений.Колонки.Добавить("РеквизитыВходящегоСообщения");
	
	ОчередьСообщений.Колонки.Добавить("Объект");
	//ОчередьСообщений.Колонки.Добавить("ДокументОснование");
	
	ОчередьСообщений.Колонки.Добавить("Новое");
	ОчередьСообщений.Колонки.Добавить("ИдентификаторЗаявки");
	ОчередьСообщений.Колонки.Добавить("КоличествоИтераций",    Новый ОписаниеТипов("Число"));
	ОчередьСообщений.Колонки.Добавить("ДатаСледующейИтерации", Новый ОписаниеТипов("Дата"));
	
	ОчередьСообщений.Колонки.Добавить("ЕстьОшибкиСервиса",               Новый ОписаниеТипов("Булево"));
	ОчередьСообщений.Колонки.Добавить("КоличествоПопытокВосстановления", Новый ОписаниеТипов("Число"));
	ОчередьСообщений.Колонки.Добавить("ПроверенаКорректностьОформления", Новый ОписаниеТипов("Булево"));
	ОчередьСообщений.Колонки.Добавить("ТекстОшибки",                     Новый ОписаниеТипов("Строка"));
	
	ОчередьСообщений.Индексы.Добавить("Сообщение");
	
	Возврат ОчередьСообщений;
	
КонецФункции

// Подготавливает сообщения к передаче в ВЕТИС.
//
// Параметры:
//  Сообщения       - Массив - содержит структуру сообщений, которые подготавливаются к передаче
//    (см. ИнтеграцияВЕТИСКлиентСервер.СтруктураСообщенияXML).
//  Немедленно      - Булево - Признак немедленной передачи сообщения, без очереди сообщений.
//  ПараметрыОбмена - Структура, Неопределено - см. функцию ПараметрыОбмена().
//  ЗагружатьПосле  - СправочникСсылка.ВЕТИСПрисоединенныеФайлы, Неопределено
//
// Возвращаемое значение:
//  СправочникСсылка.ВЕТИСПрисоединенныеФайлы - Последнее подготовленное сообщение.
//
Функция ПодготовитьСообщенияКПередаче(Сообщения, Немедленно, ПараметрыОбмена, ЗагружатьПосле = Неопределено) Экспорт
	
	ТребуетсяРасчетОчереди  = Ложь;
	ЗаписиСкладскогоЖурнала = Новый Соответствие;
	СообщенияКПередаче      = НоваяТаблицаОчередьСообщений();
	ЕстьЗапросыСписков      = Ложь;
	ПоДокументу             = Ложь;
	ИсходящееСообщение      = Неопределено;
	
	Для Каждого Сообщение Из Сообщения Цикл
		
		РеквизитыИсходящегоСообщения = Неопределено;
		РеквизитыОчереди             = Неопределено;
		
		ЭтоЗапросСписка = ЭтоЗапросСписка(Сообщение.ВидОперации);
		Если ЭтоЗапросСписка Тогда
			ЕстьЗапросыСписков = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(Сообщение.Объект) Тогда
			ПоДокументу = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Сообщение.ТекстОшибки) Тогда
			
			РеквизитыИсходящегоСообщения = РеквизитыИсходящегоСообщения();
			ЗаполнитьЗначенияСвойств(РеквизитыИсходящегоСообщения, Сообщение);
			
			Приоритет = ?(Немедленно, 0, 1);
			
			РеквизитыОчереди = Новый Структура;
			РеквизитыОчереди.Вставить("ВидОперации",                   Сообщение.ВидОперации);
			РеквизитыОчереди.Вставить("Объект",                       Сообщение.Объект);
			РеквизитыОчереди.Вставить("ХозяйствующийСубъект",         Сообщение.ХозяйствующийСубъект);
			РеквизитыОчереди.Вставить("Предприятие",                  Сообщение.Предприятие);
			РеквизитыОчереди.Вставить("ПараметрыЗапроса",             Сообщение.ПараметрыЗапроса);
			РеквизитыОчереди.Вставить("ЗаписиСкладскогоЖурнала",      Сообщение.ЗаписиСкладскогоЖурнала);
			РеквизитыОчереди.Вставить("ЗагружатьПосле",               ЗагружатьПосле);
			//РеквизитыОчереди.Вставить("ДокументОснование",            Сообщение.ДокументОснование);
			РеквизитыОчереди.Вставить("РеквизитыИсходящегоСообщения", РеквизитыИсходящегоСообщения);
			РеквизитыОчереди.Вставить("Приоритет",                    Приоритет);
			
			Попытка
				
				Результат = ПодготовитьСообщениеКПередаче(
					Сообщение.ТекстСообщенияXML,
					РеквизитыИсходящегоСообщения, 
					РеквизитыОчереди);
				
				ТекстОшибки            = Результат.ТекстОшибки;
				ПодготовленоКПередаче  = Не ЗначениеЗаполнено(ТекстОшибки);
				ИсходящееСообщение     = Результат.ИсходящееСообщение;
				
				//Если Результат.ТребуетсяРасчетОчереди Тогда
				//	
				//	ТребуетсяРасчетОчереди = Истина;
				//	
				//	Для Каждого КлючИЗначение Из Сообщение.ЗаписиСкладскогоЖурнала Цикл
				//		ЗаписиСкладскогоЖурнала.Вставить(КлючИЗначение.Ключ, Истина);
				//	КонецЦикла;
				//	
				//КонецЕсли;
				
			Исключение
				
				ТекстОшибки            = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ПодготовленоКПередаче  = Ложь;
				ИсходящееСообщение     = Неопределено;
				
			КонецПопытки;
			
		Иначе
			
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Сообщение ""%1"" не подготовлено к отправке в ВетИС:
				           |%2'"),
				Сообщение.Описание,
				Сообщение.ТекстОшибки);
			ПодготовленоКПередаче  = Ложь;
			ИсходящееСообщение     = Неопределено;
			ТребуетсяРасчетОчереди = Ложь;
			
		КонецЕсли;
		
		Если ПодготовленоКПередаче Тогда
			
			ЭлементОчереди = ПараметрыОбмена.ОчередьСообщений.Добавить();
			ЭлементОчереди.ДатаСоздания = ТекущаяДатаСеанса();
			ЭлементОчереди.Сообщение    = ИсходящееСообщение;
			ЭлементОчереди.ХозяйствующийСубъект         = Сообщение.ХозяйствующийСубъект;
			ЭлементОчереди.Предприятие                  = Сообщение.Предприятие;
			ЭлементОчереди.ВидОперации                     = Сообщение.ВидОперации;
			//ЭлементОчереди.ФорматОбмена                 = Сообщение.ФорматОбмена;
			ЭлементОчереди.ПараметрыЗапроса             = Новый ХранилищеЗначения(Сообщение.ПараметрыЗапроса);
			ЭлементОчереди.РеквизитыИсходящегоСообщения = Новый ХранилищеЗначения(РеквизитыИсходящегоСообщения);
			
			ЭлементОчереди.Объект          = Сообщение.Объект;
			
			Если ЗначениеЗаполнено(ЗагружатьПосле) Тогда
				НоваяЗависимость = ПараметрыОбмена.ЗависимостиСообщений.Добавить();
				НоваяЗависимость.Сообщение1     = ИсходящееСообщение;
				НоваяЗависимость.Сообщение2     = ЗагружатьПосле;
				НоваяЗависимость.Загрузка       = Ложь;
				НоваяЗависимость.Передача       = Ложь;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СообщенияКПередаче.Добавить(), ЭлементОчереди);
			
		Иначе
			
			СтрокаРезультата = ИнтеграцияВЕТИСКлиентСервер.СтруктураИзменения();
			СтрокаРезультата.ХозяйствующийСубъект = Сообщение.ХозяйствующийСубъект;
			СтрокаРезультата.Предприятие          = Сообщение.Предприятие;
			СтрокаРезультата.ВидОперации             = Сообщение.ВидОперации;
			//СтрокаРезультата.ФорматОбмена         = Сообщение.ФорматОбмена;
			
			СтрокаРезультата.ТекстОшибки           = ТекстОшибки;
			СтрокаРезультата.ПодготовленоКПередаче = Ложь;
			СтрокаРезультата.Передано              = Ложь;
			СтрокаРезультата.Принято               = Ложь;
			
			СтрокаРезультата.ИсходящееСообщение = Неопределено;
			СтрокаРезультата.ВходящееСообщение  = Неопределено;
			
			СтрокаРезультата.Объект            = Сообщение.Объект;
			//СтрокаРезультата.ДокументОснование = Сообщение.ДокументОснование;
			СтрокаРезультата.НовыйСтатус       = Неопределено;
			
			ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Немедленно
		И (Не ЕстьЗапросыСписков Или ПоДокументу) Тогда
		
		Если ТребуетсяРасчетОчереди Тогда
			ПостроитьОчередьСообщений(ПараметрыОбмена, ЗаписиСкладскогоЖурнала, СообщенияКПередаче);
		КонецЕсли;
		
		Для Каждого ЭлементОчереди Из ПараметрыОбмена.ОчередьСообщений Цикл
			
			Если Не ЗначениеЗаполнено(ЭлементОчереди.ИдентификаторЗаявки) Тогда
				
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Сообщение1", ЭлементОчереди.Сообщение);
				ПараметрыОтбора.Вставить("Передача",   Ложь);
				НайденныеЗависимости = ПараметрыОбмена.ЗависимостиСообщений.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеЗависимости.Количество() > 0 Тогда
					
					ДобавитьОтложенныйЭлементОчередиВИзменения(ЭлементОчереди, ПараметрыОбмена);
					
					Продолжить;
					
				КонецЕсли;
				
				ОбработатьЭлементОчередиПередачиДанных(ЭлементОчереди, ПараметрыОбмена);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ИсходящееСообщение;
	
КонецФункции

Процедура ДобавитьОтложенныйЭлементОчередиВИзменения(ЭлементОчереди, ПараметрыОбмена)
	
	СтрокаРезультата = ИнтеграцияВЕТИСКлиентСервер.СтруктураИзменения();
	СтрокаРезультата.ХозяйствующийСубъект  = ЭлементОчереди.ХозяйствующийСубъект;
	СтрокаРезультата.Предприятие           = ЭлементОчереди.Предприятие;
	СтрокаРезультата.ВидОперации              = ЭлементОчереди.ВидОперации;
	//СтрокаРезультата.ФорматОбмена          = ЭлементОчереди.ФорматОбмена;
	
	СтрокаРезультата.ТекстОшибки           = "";
	СтрокаРезультата.ПодготовленоКПередаче = Истина;
	СтрокаРезультата.Передано              = Ложь;
	СтрокаРезультата.Принято               = Ложь;
	
	СтрокаРезультата.ИсходящееСообщение    = ЭлементОчереди.Сообщение;
	СтрокаРезультата.ВходящееСообщение     = Неопределено;
	
	СтрокаРезультата.Объект                = ЭлементОчереди.Объект;
	СтрокаРезультата.НовыйСтатус           = Перечисления.СтатусыОбработкиСообщенийВЕТИС.КПередаче;
	
	ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
	
КонецПроцедуры

Функция ПодготовитьКПередачеСОжиданием(СообщенияXML, ПараметрыОбмена, УникальныйИдентификатор = Неопределено, НакапливатьИзменения = Истина) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Изменения",                 Новый Массив);
	ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",        Неопределено);
	ВозвращаемоеЗначение.Вставить("Ожидать",                   Неопределено);
	ВозвращаемоеЗначение.Вставить("АдресВоВременномХранилище", Неопределено);
	
	Если СообщенияXML.Количество() > 0
		И ТипЗнч(СообщенияXML[0]) = Тип("Структура")
		И СообщенияXML[0].Свойство("ПорядокЗависимости") Тогда
		
		МаксимальныйНомерЗависимости = 0;
		Для Каждого СообщениеXML Из СообщенияXML Цикл
			Если СообщениеXML.ПорядокЗависимости > МаксимальныйНомерЗависимости Тогда
				МаксимальныйНомерЗависимости = СообщениеXML.ПорядокЗависимости;
			КонецЕсли;
		КонецЦикла;
		
		ЗагружатьПосле = Неопределено;
		Для ПорядокЗависимости = 1 По МаксимальныйНомерЗависимости Цикл
			
			КПередаче = Новый Массив;
			Для Каждого Строка Из СообщенияXML Цикл
				Если Строка.ПорядокЗависимости = ПорядокЗависимости Тогда
					КПередаче.Добавить(Строка.СообщениеXML);
				КонецЕсли;
			КонецЦикла;
			
			ЗагружатьПосле = ПодготовитьСообщенияКПередаче(КПередаче, Истина, ПараметрыОбмена, ЗагружатьПосле);
		КонецЦикла;
		
	Иначе
		ПодготовитьСообщенияКПередаче(СообщенияXML, Истина, ПараметрыОбмена);
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	Для Каждого ИзмененияЭлементДанных Из ПараметрыОбмена.Изменения Цикл
		Если ЗначениеЗаполнено(ИзмененияЭлементДанных.ТекстОшибки) Тогда
			ЕстьОшибки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ТребуетсяОжидание = (Не ЕстьОшибки)
		И УникальныйИдентификатор <> Неопределено
		И ПараметрыОбмена.ОчередьСообщений.Количество() > 0;
	
	Если ТребуетсяОжидание Тогда
		
		Если Не НакапливатьИзменения Тогда
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
				ВозвращаемоеЗначение.Изменения,
				ПараметрыОбмена.Изменения);
			
			ПараметрыОбмена.Изменения.Очистить();
			
		КонецЕсли;
		
		// Параметры не сериализуются => не могут быть размещены во временном хранилище.
//		ПараметрыОбмена.ПараметрыПреобразования   = Неопределено;
		ПараметрыОбмена.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		ПараметрыОбмена.ФоновоеЗадание            = Неопределено;
		
		ВозвращаемоеЗначение.Ожидать                   = 1;
		ВозвращаемоеЗначение.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ПараметрыОбмена, ПараметрыОбмена.АдресВоВременномХранилище);
		
	Иначе
		ВозвращаемоеЗначение.Изменения = ПараметрыОбмена.Изменения;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ПостроитьОчередьСообщений(ПараметрыОбмена, СоответствиеЗаписиСкладскогоЖурнала = Неопределено, СообщенияКПередаче = Неопределено, ДляСинхронизации = Ложь) Экспорт
	
	ПараметрыОбмена.ОчередьСообщений.Очистить();
	ПараметрыОбмена.ЗависимостиСообщений.Очистить();
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ЗапросыВЕТИС.ДатаСоздания        КАК ДатаСоздания,
	|	ЗапросыВЕТИС.Сообщение           КАК Сообщение,
	|	ЗапросыВЕТИС.ВидОперации          КАК ВидОперации,
	//|	ЕСТЬNULL(ЗапросыВЕТИС.Сообщение.ФорматОбмена, НЕОПРЕДЕЛЕНО) КАК ФорматОбмена,
	//|	ЕСТЬNULL(ЗапросыВЕТИС.Сообщение.Документ, НЕОПРЕДЕЛЕНО)     КАК Документ,
	|	ЗапросыВЕТИС.ХозяйствующийСубъект          КАК ХозяйствующийСубъект,
	|	ЗапросыВЕТИС.Предприятие         КАК Предприятие,
	|	ЗапросыВЕТИС.Объект              КАК Объект,
	|	ЗапросыВЕТИС.ПараметрыЗапроса    КАК ПараметрыЗапроса,
	|	ЗапросыВЕТИС.РеквизитыИсходящегоСообщения КАК РеквизитыИсходящегоСообщения,
	|	ЗапросыВЕТИС.РеквизитыВходящегоСообщения  КАК РеквизитыВходящегоСообщения,
	|	ЗапросыВЕТИС.ИдентификаторЗаявки КАК ИдентификаторЗаявки,
	|	ЗапросыВЕТИС.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗапросыВЕТИС.СтатусОбработки КАК СтатусОбработки,
	|	ЗапросыВЕТИС.Комментарий
	|ИЗ
	|	РегистрСведений.ЗапросыВЕТИС КАК ЗапросыВЕТИС
	|ГДЕ
	|	ЗапросыВЕТИС.ХозяйствующийСубъект В (&ХозяйствующиеСубъекты)
	|	И &УсловиеПоСообщениям
	|	И &ЗапросыСинхронизации
	// + ?(Идентификатор = Неопределено, "", " И 
	//|	Заявки.Идентификатор = &Идентификатор") + " И 
	//|	Заявки.ДатаСоздания >= &ДатаПолученияЗаявок
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	ДатаСоздания");
	
	Запрос.УстановитьПараметр("ХозяйствующиеСубъекты", ПараметрыОбмена.ХозяйствующиеСубъекты);
	
	Если Не СообщенияКПередаче = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСообщениям", "ЗапросыВЕТИС.Сообщение В (&МассивСообщений)");
		
		МассивСообщений = Новый Массив;
		Для Каждого СтрокаСообщение Из СообщенияКПередаче Цикл
			МассивСообщений.Добавить(СтрокаСообщение.Сообщение);
		КонецЦикла;
		Запрос.УстановитьПараметр("МассивСообщений", МассивСообщений);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСообщениям", "ИСТИНА");
	КонецЕсли;
	
	Если ДляСинхронизации = Истина Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЗапросыСинхронизации", "ЗапросыВЕТИС.ВидОперации В (&ЗапросыСинхронизации)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЗапросыСинхронизации", "(НЕ ЗапросыВЕТИС.ВидОперации В (&ЗапросыСинхронизации))");
	КонецЕсли;
	
	ЗапросыСинхронизации = Новый Массив;
	ЗапросыСинхронизации.Добавить(Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененныхВСД);
	ЗапросыСинхронизации.Добавить(Перечисления.ВидыОперацийВЕТИС.ЗапросИзмененныхВСД);
	ЗапросыСинхронизации.Добавить(Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененныхЗаписейСкладскогоЖурнала);
	ЗапросыСинхронизации.Добавить(Перечисления.ВидыОперацийВЕТИС.ЗапросИзмененныхЗаписейСкладскогоЖурнала);
	ЗапросыСинхронизации.Добавить(Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросВсехВСД);
	ЗапросыСинхронизации.Добавить(Перечисления.ВидыОперацийВЕТИС.ЗапросВсехВСД);
	ЗапросыСинхронизации.Добавить(Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросЗаписейСкладскогоЖурнала);
	ЗапросыСинхронизации.Добавить(Перечисления.ВидыОперацийВЕТИС.ЗапросЗаписейСкладскогоЖурнала);
	Запрос.УстановитьПараметр("ЗапросыСинхронизации", ЗапросыСинхронизации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПропущенныеСообщения = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		
		//Если ЗначениеЗаполнено(Выборка.Предприятие)
		//	И ПараметрыОбмена.Предприятия <> Неопределено
		//	И ПараметрыОбмена.Предприятия.Количество() Тогда
		//		
		//	ПредприятияДляОбмена = ПараметрыОбмена.Предприятия.Получить(Выборка.ХозяйствующийСубъект);
		//	Если ПредприятияДляОбмена <> Неопределено
		//		И ПредприятияДляОбмена.Найти(Выборка.Предприятие) = Неопределено Тогда
		//		ПропущенныеСообщения.Вставить(Выборка.Сообщение, Истина);
		//		Продолжить;
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
		РеквизитыИсходящегоСообщения = Выборка.РеквизитыИсходящегоСообщения.Получить();
		
		ЭлементОчереди = ПараметрыОбмена.ОчередьСообщений.Добавить();
		ЭлементОчереди.ДатаСоздания                 = Выборка.ДатаСоздания;
		ЭлементОчереди.Сообщение                    = Выборка.Сообщение;
		ЭлементОчереди.ХозяйствующийСубъект         = Выборка.ХозяйствующийСубъект;
		ЭлементОчереди.Предприятие                  = Выборка.Предприятие;
		ЭлементОчереди.ВидОперации                  = Выборка.ВидОперации;
		ЭлементОчереди.ПараметрыЗапроса             = Выборка.ПараметрыЗапроса;
		ЭлементОчереди.РеквизитыИсходящегоСообщения = Выборка.РеквизитыИсходящегоСообщения;
		ЭлементОчереди.РеквизитыВходящегоСообщения  = Выборка.РеквизитыВходящегоСообщения;
		ЭлементОчереди.ИдентификаторЗаявки          = Выборка.ИдентификаторЗаявки;
		ЭлементОчереди.Объект                       = Выборка.Объект;
		
		//Если ЗначениеЗаполнено(Выборка.ЗагружатьПосле) Тогда
		//	НоваяЗависимость = ПараметрыОбмена.ЗависимостиСообщений.Добавить();
		//	НоваяЗависимость.Сообщение1 = Выборка.Сообщение;
		//	НоваяЗависимость.Сообщение2 = Выборка.ЗагружатьПосле;
		//	НоваяЗависимость.Загрузка   = Ложь;
		//	НоваяЗависимость.Передача   = Ложь;
		//КонецЕсли;
		
	КонецЦикла;
	
	ЗависимостиКУдалению = Новый Соответствие();
	Для Каждого СтрокаТЧ Из ПараметрыОбмена.ЗависимостиСообщений Цикл
		Если ПараметрыОбмена.ОчередьСообщений.Найти(СтрокаТЧ.Сообщение1, "Сообщение") = Неопределено
			Или ПараметрыОбмена.ОчередьСообщений.Найти(СтрокаТЧ.Сообщение2, "Сообщение") = Неопределено Тогда
			ЗависимостиКУдалению.Вставить(СтрокаТЧ, Истина);
		КонецЕсли;
	КонецЦикла;
	Для Каждого КлючИЗначение Из ЗависимостиКУдалению Цикл
		ПараметрыОбмена.ЗависимостиСообщений.Удалить(КлючИЗначение.Ключ);
	КонецЦикла;
	
КонецПроцедуры

// Процедура запуска регламентного задания ОбработкаОбменовДаннымиВЕТИС.
//
Процедура ЗапуститьОбработкуОтветовВЕТИС() Экспорт
	
	РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОбработкаОбменовДаннымиВЕТИС;
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(РегламентноеЗадание);
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяМетода", РегламентноеЗадание.ИмяМетода);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	ФоновыеЗаданияОбновлениеВыгрузки = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если ФоновыеЗаданияОбновлениеВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияВЕТИСВызовСервера.ВыполнитьОбмен(,,, Истина, Ложь);
	
КонецПроцедуры

Процедура ПроверитьСтатусыГашенияВСД()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СтатусыДокументовВЕТИС.Документ КАК ГашениеСсылка
	|ПОМЕСТИТЬ
	|	ТаблицаГашение
	|ИЗ
	|	РегистрСведений.СтатусыДокументовВЕТИС КАК СтатусыДокументовВЕТИС
	|ГДЕ
	|	(НЕ СтатусыДокументовВЕТИС.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.ВидыСтатусовОбработкиВЕТИС.ВСДПогашены)) И 
	|	(НЕ СтатусыДокументовВЕТИС.ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.ВидыСтатусовОбработкиВЕТИС.Черновик)) И 
	|	СтатусыДокументовВЕТИС.Документ ССЫЛКА Документ.ГашениеВходящихВСДВЕТИС И 
	|	СтатусыДокументовВЕТИС.Документ.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаГашение.ГашениеСсылка КАК ГашениеСсылка,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА (НЕ ГашениеВходящихВСДВЕТИС.ВСД = ЗНАЧЕНИЕ(Документ.ВСДВЕТИС.ПустаяСсылка)) И 
	|			(НЕ ГашениеВходящихВСДВЕТИС.ВСД.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВСДВЕТИС.UTILIZED)) ТОГДА
	|			1
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ) КАК ЕстьНеПогашенные
	|ИЗ
	|	ТаблицаГашение КАК ТаблицаГашение
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК ГашениеВходящихВСДВЕТИС
	|ПО
	|	ТаблицаГашение.ГашениеСсылка = ГашениеВходящихВСДВЕТИС.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаГашение.ГашениеСсылка
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА (НЕ ГашениеВходящихВСДВЕТИС.ВСД = ЗНАЧЕНИЕ(Документ.ВСДВЕТИС.ПустаяСсылка)) И 
	|			(НЕ ГашениеВходящихВСДВЕТИС.ВСД.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВСДВЕТИС.UTILIZED)) ТОГДА
	|			1
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ) = 0
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГашениеВходящихВСДВЕТИС.ВСД КАК ВСД,
	|	ГашениеВходящихВСДВЕТИС.ВСД.Идентификатор КАК ИдентификаторВСД,
	|	ГашениеВходящихВСДВЕТИС.ВСД.ПредприятиеПолучатель КАК Предприятие,
	|	ГашениеВходящихВСДВЕТИС.ВСД.Получатель КАК ХозяйствующийСубъект,
	|	ГашениеВходящихВСДВЕТИС.ВСД.ПредприятиеПолучатель.Код КАК guidПредприятия
	|ИЗ
	|	ТаблицаГашение КАК ТаблицаГашение
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК ГашениеВходящихВСДВЕТИС
	|ПО
	|	ТаблицаГашение.ГашениеСсылка = ГашениеВходящихВСДВЕТИС.Ссылка
	|ГДЕ
	|	(НЕ ГашениеВходящихВСДВЕТИС.ВСД = ЗНАЧЕНИЕ(Документ.ВСДВЕТИС.ПустаяСсылка)) И 
	|	(НЕ ГашениеВходящихВСДВЕТИС.ВСД.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВСДВЕТИС.UTILIZED)) И 
	|	(НЕ ГашениеВходящихВСДВЕТИС.ВСД.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВСДВЕТИС.WITHDRAWN))
	|ИТОГИ
	|ПО
	|	ХозяйствующийСубъект,
	|	Предприятие
	|";
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	Выборка = ПакетЗапросов[ПакетЗапросов.Количество()-2].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			
			ПараметрыОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ПараметрыОбновления();
			ПараметрыОбновления.НовыйСтатус         = Перечисления.ВидыСтатусовОбработкиВЕТИС.ВСДПогашены;
			ПараметрыОбновления.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияВЕТИС.НеТребуется;
			
			НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовВЕТИС.ОбновитьСтатус(Выборка.ГашениеСсылка, ПараметрыОбновления);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросВСД;
	
	ВыборкаХозяйствующийСубъект = ПакетЗапросов[ПакетЗапросов.Количество()-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаХозяйствующийСубъект.Следующий() Цикл
		ХозяйствующийСубъект = ВыборкаХозяйствующийСубъект.ХозяйствующийСубъект;
		ПараметрыОбмена = ИнтеграцияВЕТИС.ПараметрыОбмена(ХозяйствующийСубъект,,, Истина);
		ВыборкаПредприятие = ВыборкаХозяйствующийСубъект.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПредприятие.Следующий() Цикл
			
			Предприятие = ВыборкаПредприятие.Предприятие;
			
			ДанныеДляВыгрузки = Новый Массив;
			Выборка = ВыборкаПредприятие.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				СтрокаВыгрузки = Новый Структура;
				СтрокаВыгрузки.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
				СтрокаВыгрузки.Вставить("uuid",                 Выборка.ИдентификаторВСД);
				СтрокаВыгрузки.Вставить("guidПредприятия",      Выборка.guidПредприятия);
				СтрокаВыгрузки.Вставить("Предприятие",          Предприятие);
				СтрокаВыгрузки.Вставить("ВидОперации",          ВидОперации);
				
				ДанныеДляВыгрузки.Добавить(СтрокаВыгрузки);
			КонецЦикла;
			
			Если ДанныеДляВыгрузки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			РезультатОбмена = ИнтеграцияВЕТИСВызовСервера.ПодготовитьЗапрос(ХозяйствующийСубъект, Предприятие, ВидОперации, ДанныеДляВыгрузки,,ПараметрыОбмена);
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Процедура запуска регламентного задания ОбработкаОбменовДаннымиВЕТИС.
//
Процедура ЗапуститьОбработкуСинхронизацииВЕТИС() Экспорт
	
	РегламентноеЗадание = Метаданные.РегламентныеЗадания.СинхронизацияДаннымиВЕТИС;
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(РегламентноеЗадание);
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяМетода", РегламентноеЗадание.ИмяМетода);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	ФоновыеЗаданияОбновлениеВыгрузки = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если ФоновыеЗаданияОбновлениеВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьСтатусыГашенияВСД();
	
	ИнтеграцияВЕТИСВызовСервера.ВыполнитьОбмен(,,, Истина, Истина);
	
	СинхронизироватьСВетИС();
	
КонецПроцедуры

#КонецОбласти


#Область ПолучениеДанных

Функция ПолучитьДанныеСправочников(НастройкаПодключения, ПараметрыЗапроса, Отказ = Ложь) Экспорт
	
	Результат = Неопределено;
	Попытка
		РезультатПолучения = ВыполнитьЗапросКлассификатораИзСервиса(НастройкаПодключения, ПараметрыЗапроса);
		Если РезультатПолучения.Результат = Неопределено Тогда
			РезультатПолучения = ПолучитьДанныеКлассификатора(НастройкаПодключения, ПараметрыЗапроса);
			Если ЗначениеЗаполнено(РезультатПолучения.ТекстОшибки) Тогда
				Отказ = Истина;
				ТекстОшибки = РезультатПолучения.ТекстОшибки;
			Иначе
				Результат = РезультатПолучения.Элемент;
			КонецЕсли;
		Иначе
			Результат = РезультатПолучения.Результат;
		КонецЕсли;
	Исключение
		Отказ = Истина;
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Если Отказ Тогда
		ВывестиСообщение( НСтр("ru='Не удалось получить для справочника: <'") +  ПараметрыЗапроса.ИмяСправочника  + ">"+ Символы.ПС + ТекстОшибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеКлассификатора(НастройкаПодключения, ПараметрыЗапроса)
	
	ПараметрыЗапросаКлассификатора = ПараметрыЗапросаЭлементаКлассификатора();
	ПараметрыЗапросаКлассификатора.ИмяМетода        = ПараметрыЗапроса.ИмяМетода;
	ПараметрыЗапросаКлассификатора.ПространствоИмен = Метаданные.ПакетыXDTO.ВЕТИСКлассификаторы.ПространствоИмен;
	ПараметрыЗапросаКлассификатора.ИмяЭлемента      = ПараметрыЗапроса.ИмяЭлемента;
	
	ИмяПакета = ПараметрыЗапросаКлассификатора.ИмяМетода + "Request";
	
	ПараметрыОбменов = ИнтеграцияВЕТИСПовтИсп.ПолучитьПараметрыОбменов();
	ВнутренняяФабрикаXDTO = ПараметрыОбменов.ФабрикаXDTO;
	
	Запрос = ИнтеграцияГосИС.ОбъектXDTOПоИмениСвойства(ВнутренняяФабрикаXDTO, ПараметрыЗапросаКлассификатора.ПространствоИмен, ИмяПакета);
	
	// Настройка параметров запроса
	Если ПараметрыЗапроса.Свойство("ИмяСписка") Тогда 
		ИменаСписков = СтрРазделить(ПараметрыЗапроса.ИмяСписка,","); 
		
		Для Каждого ИмяСписка Из ИменаСписков Цикл
			Запрос[СокрЛП(ИмяСписка)] = ОбъектXDTOПоИмениТипа(Запрос, СокрЛП(ИмяСписка));
			ЗаполнитьЗначенияСвойств(Запрос[СокрЛП(ИмяСписка)], ПараметрыЗапроса.ПараметрыСписка);
			ЗаполнитьЗначенияСвойств(Запрос, ПараметрыЗапроса.ПараметрыСписка);
		КонецЦикла;
	Иначе
		ЗаполнитьЗначенияСвойств(Запрос, ПараметрыЗапроса.Параметры);
	КонецЕсли;
	
	//ТекстСообщенияXML = ОбъектXDTOВXML(ПараметрыОбменов, ПараметрыЗапроса, Запрос, ПараметрыЗапросаКлассификатора.ПространствоИмен, ИмяПакета);
	ТекстСообщенияXML = ОбъектXDTOВXML(ПараметрыОбменов, Запрос, ПараметрыЗапросаКлассификатора.ПространствоИмен, ИмяПакета);
	ПараметрыЗапросаКлассификатора.ТекстСообщенияXML = ТекстСообщенияXML;
	
	РезультатВыполненияЗапроса = ВыполнитьЗапросКлассификатора(ПараметрыЗапросаКлассификатора, НастройкаПодключения, ПараметрыЗапроса);
	
	Возврат РезультатВыполненияЗапроса;
	
КонецФункции

// Возвращает структуру запроса классификатора.
//
// Параметры:
//  ТекстСообщенияXML - Строка - Текст сообщения XNL.
//  ИмяТипа - Строка - Имя типа.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * ТекстСообщенияXML - Строка - Текст сообщения XML.
//   * ИмяТипа - Строка - Операция.
//
Функция ПараметрыЗапросаЭлементаКлассификатора()
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ИмяМетода",         "");
	ВозвращаемоеЗначение.Вставить("ТекстСообщенияXML", "");
	ВозвращаемоеЗначение.Вставить("ПространствоИмен",  "");
	ВозвращаемоеЗначение.Вставить("ИмяЭлемента",       "");
	ВозвращаемоеЗначение.Вставить("Представление",     "");
	//ВозвращаемоеЗначение.Вставить("ФорматОбмена");
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ВыполнитьЗапросКлассификатора(Запрос, НастройкаПодключения, ПараметрыЗапроса)
	
	РезультатОбработкиОтвета = Новый Структура;
	РезультатОбработкиОтвета.Вставить("Результат");
	РезультатОбработкиОтвета.Вставить("ТекстОшибки");
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Элемент");
	ВозвращаемоеЗначение.Вставить("ТекстОшибки");
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса");
	ВозвращаемоеЗначение.Вставить("РезультатОбработкиОтвета", РезультатОбработкиОтвета);
	
	ТекстОшибки = "";
	РезультатОтправкиЗапроса = ОтправитьЗапрос(Запрос.ТекстСообщенияXML, Запрос.ИмяМетода, НастройкаПодключения, ПараметрыЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ТекстСообщенияXMLПолучен Тогда
		
		ДанныеОбработки = ОбработатьОтветНаЗапрос(РезультатОтправкиЗапроса, Запрос);
		Если ДанныеОбработки.Результат <> Неопределено Тогда
			ВозвращаемоеЗначение.Элемент = ДанныеОбработки.Результат;
		Иначе
			ВозвращаемоеЗначение.РезультатОбработкиОтвета.ТекстОшибки = ДанныеОбработки.ТекстОшибки;
			ТекстОшибки = ДанныеОбработки.ТекстОшибки;
		КонецЕсли;
		
	Иначе
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось получить ответ на %1 по причине %2'"),Запрос.Представление,РезультатОтправкиЗапроса.ТекстОшибки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) И ЗначениеЗаполнено(ВозвращаемоеЗначение.ТекстОшибки) Тогда
		ВозвращаемоеЗначение.ТекстОшибки = ВозвращаемоеЗначение.ТекстОшибки	+ Символы.ПС + ТекстОшибки;
	ИначеЕсли ЗначениеЗаполнено(ТекстОшибки) Тогда
		ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибки;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ВыполнитьЗапросКлассификатораИзСервиса(НастройкаПодключения, ПараметрыЗапроса)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Результат",         Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",       "");
	ВозвращаемоеЗначение.Вставить("ТекстСообщенияXML", "");
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",   Неопределено);
	
	ХозяйствующийСубъект = НастройкаПодключения.ХозяйствующийСубъект;
	
	ТекстОшибки = "";
	Попытка
		Если ПараметрыЗапроса.ИмяМетода = "getCountryByGuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеСтраны(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.guid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getCountryByUuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеСтраныПоUuid(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.uuid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getRegionByGuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеРегиона(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.guid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getRegionByUuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеРегионаПоUuid(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.uuid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getDiseaseByGuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеЗаболевания(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.guid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getDiseaseByUuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеЗаболеванияПоUuid(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.uuid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getProductByGuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеПродукции(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.guid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getProductByUuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеПродукцииПоUuid(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.uuid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getSubProductByGuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеВидаПродукции(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.guid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getSubProductByUuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеВидаПродукцииПоUuid(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.uuid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getProductItemByGuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеНаименованияПродукции(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.guid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getProductItemByUuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеНаименованияПродукцииПоUuid(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.uuid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getUnitByGuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеЕдиницыИзмеренияПоGUID(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.guid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getUnitByUuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеЕдиницыИзмеренияПоUUID(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.uuid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getPurposeByGuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеЦели(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.guid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getPurposeByUuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеЦелиПоUuid(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.uuid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getBusinessEntityByGuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеХСПоGUID(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.guid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getBusinessEntityByUuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеХСПоUUID(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.uuid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getEnterpriseByGuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеПредприятия(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.guid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getEnterpriseByUuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеПредприятияПоUUID(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.uuid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getR13nConditionByGuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеУсловияРегионализации(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.guid);
		ИначеЕсли ПараметрыЗапроса.ИмяМетода = "getR13nConditionByUuid" Тогда
			ОбъектXDTO = ЗапросНаПолучениеУсловияРегионализацииПоUuid(ХозяйствующийСубъект, ПараметрыЗапроса.Параметры.uuid);
		Иначе
			Возврат ВозвращаемоеЗначение;
		КонецЕсли;
		Если ТипЗнч(ОбъектXDTO) = Тип("Структура") Тогда
			Результат = ОбъектXDTO;
		Иначе
			Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO);
		КонецЕсли;
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаВыполнена;
		ВозвращаемоеЗначение.Вставить("Результат", Результат);
	Исключение
		ОбработатьОшибку(
			СтрШаблон(
				НСтр("ru = 'При разборе объекта XDTO ответа на %1 возникла ошибка:
				           |Текст ошибки: %ТекстОшибки%'"),
				ПараметрыЗапроса.ИмяМетода),
			ИнформацияОбОшибке(),
			ВозвращаемоеЗначение);
		ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.Ошибка;
	КонецПопытки;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область ОбработкаРезультата

// Обрабатывает ответ ВЕТИС на запрос списка хозяйствующих субъектов.
//
// Параметры:
//  РезультатОтправкиЗапроса - Структура - см. функцию.
//  Запрос                   - Структура - см. функцию.
//  ОбработатьСписок         - Булево    - обработать список(Ложь по умолчанию)
// 
// Возвращаемое значение:
//  Структура:
//   * Результат         - Структура - см. описание для типа объекта result.success в пакете XDTO "Интеграция ВетИС".
//   * ТекстОшибки       - Строка - текст ошибки, в случае ее возникновения. 
//   * ТекстСообщенияXML - Строка - содержит ответ, полученный на запрос.
//   * СтатусОбработки   - Перечисление.СтатусыОбработкиСообщенийВЕТИС - статус обработки запроса.
//
Функция ОбработатьОтветНаЗапрос(РезультатОтправкиЗапроса, Запрос)
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ВозвращаемоеЗначение.Вставить("Результат",         Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",       "");
	ВозвращаемоеЗначение.Вставить("ТекстСообщенияXML", РезультатОтправкиЗапроса.ТекстВходящегоСообщенияSOAP);
	
	Если РезультатОтправкиЗапроса.КодСостояния <> 200 Тогда
		Возврат ОбработатьСообщениеОбОшибке(
			РезультатОтправкиЗапроса, ВозвращаемоеЗначение);
	КонецЕсли;
	
	ИмяТипа          = Запрос.ИмяМетода + "Response";
	ПространствоИмен = Запрос.ПространствоИмен;
	
	ТекстВходящегоСообщенияXML = ПолучитьЗначениеИзДокументаDOMПоИмениПоля(
		РезультатОтправкиЗапроса.ТекстВходящегоСообщенияSOAP, ИмяТипа);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстВходящегоСообщенияXML);
	
	Попытка
		ПараметрыОбменов = ИнтеграцияВЕТИСПовтИсп.ПолучитьПараметрыОбменов();
		ВнутренняяФабрикаXDTO = ПараметрыОбменов.ФабрикаXDTO;
		
		ОбъектXDTO = ВнутренняяФабрикаXDTO.ПрочитатьXML(ЧтениеXML,
			ИнтеграцияГосИС.ОбъектXDTOПоИмениСвойства(ВнутренняяФабрикаXDTO,ПространствоИмен, ИмяТипа).Тип());
		
	Исключение
		
		ДанныеДляРасшифровкиОшибок = Новый Структура;
		ДанныеДляРасшифровкиОшибок.Вставить("ИмяМакета", Неопределено);
		ДанныеДляРасшифровкиОшибок.Вставить("Глубина",   ЧтениеXML.КонтекстПространствИмен.Глубина);
		ДанныеДляРасшифровкиОшибок.Вставить("Таблица",   Неопределено);
		
		ПредставлениеОшибки = ПредставлениеОшибкиXDTO(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), ЧтениеXML, ДанныеДляРасшифровкиОшибок);
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Попытка
			
			ОбъектXDTO = ПреобразоватьПроизвольныйОбъектXDTOВОбъектXDTO(
				ИнтеграцияГосИС.ПроизвольныйОбъектXDTOПоТекстуСообщенияXML(ВнутренняяФабрикаXDTO,ТекстВходящегоСообщенияXML),
				ИнтеграцияГосИС.ОбъектXDTOПоИмениСвойства(ВнутренняяФабрикаXDTO,ПространствоИмен, ИмяТипа));
			
		Исключение
			
			ОбработатьОшибку(НСтр("ru = 'При разборе XML ответа на %1 возникла ошибка:"),РасширеннаяИнформацияОбОшибке(ПредставлениеОшибки, ПодробноеПредставлениеОшибки),ВозвращаемоеЗначение);
			Возврат ВозвращаемоеЗначение;
			
		КонецПопытки;
		
	КонецПопытки;
	
	Попытка
		
		Если Запрос.Свойство("ИмяСписка") Тогда
			ВозвращаемоеЗначение.Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO[Запрос.ИмяСписка]);
		Иначе
			ВозвращаемоеЗначение.Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO[Запрос.ИмяЭлемента]);
		КонецЕсли;
		
	Исключение
		
		ОбработатьОшибку(НСтр("ru = 'При разборе объекта XDTO ответа на %1 возникла ошибка:"), ИнформацияОбОшибке(),ВозвращаемоеЗначение);
		Возврат ВозвращаемоеЗначение;
		
	КонецПопытки;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ОтправитьЗапрос(ТекстИсходящегоСообщенияSOAP, SOAPAction, НастройкаПодключения, ПараметрыЗапроса)
	
	Если ПараметрыЗапроса.Свойство("АдресРесурса") И ЗначениеЗаполнено(ПараметрыЗапроса.АдресРесурса) Тогда
		АдресРесурса = ПараметрыЗапроса.АдресРесурса;
	Иначе
		АдресРесурса = "platform/services/2.1/EnterpriseService"; 
	КонецЕсли;
	
	РезультатОтправкиHTTPЗапроса = ОтправитьДляОбработки(ТекстИсходящегоСообщенияSOAP,
		АдресРесурса,SOAPAction,НастройкаПодключения);
	
	Возврат ОбработатьРезультатОтправкиHTTPЗапроса(РезультатОтправкиHTTPЗапроса);
	
КонецФункции

Функция ОбработатьРезультатОтправкиHTTPЗапроса(РезультатОтправкиHTTPЗапроса)
	
	КодСостояния = РезультатОтправкиHTTPЗапроса.КодСостояния;
	ТекстОтвета  = РезультатОтправкиHTTPЗапроса.ТекстОтвета;
	
	Если ЗначениеЗаполнено(ТекстОтвета) Тогда
		
		ВозвращаемоеЗначение = Новый Структура;
		ВозвращаемоеЗначение.Вставить("ТекстСообщенияXMLОтправлен",  Истина);
		ВозвращаемоеЗначение.Вставить("ТекстСообщенияXMLПолучен",    Истина);
		ВозвращаемоеЗначение.Вставить("КодСостояния",                КодСостояния);
		ВозвращаемоеЗначение.Вставить("ТекстОшибки",                 "");
		ВозвращаемоеЗначение.Вставить("ТекстВходящегоСообщенияSOAP", ТекстОтвета);
		Возврат ВозвращаемоеЗначение;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(КодСостояния) Тогда
			ТекстСообщенияXMLОтправлен = Ложь;
			ЗаголовокОшибки = НСтр("ru = 'HTTP-запрос не отправлен.'");
		Иначе
			ТекстСообщенияXMLОтправлен = Истина;
			ЗаголовокОшибки = СтрШаблон(НСтр("ru = 'Код состояния HTTP: %1.'"), КодСостояния);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатОтправкиHTTPЗапроса.ТекстОшибки) Тогда
			ТекстОшибки = ЗаголовокОшибки + Символы.ПС + РезультатОтправкиHTTPЗапроса.ТекстОшибки;
		Иначе
			ТекстОшибки = ЗаголовокОшибки;
		КонецЕсли;
		
		ВозвращаемоеЗначение = Новый Структура;
		ВозвращаемоеЗначение.Вставить("ТекстСообщенияXMLОтправлен",  ТекстСообщенияXMLОтправлен);
		ВозвращаемоеЗначение.Вставить("ТекстСообщенияXMLПолучен",    Ложь);
		
		ВозвращаемоеЗначение.Вставить("КодСостояния",                КодСостояния);
		ВозвращаемоеЗначение.Вставить("ТекстОшибки",                 Строка(ТекстОшибки));
		ВозвращаемоеЗначение.Вставить("ТекстВходящегоСообщенияSOAP", "");
		
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
КонецФункции

// Отправляет POST запрос для передачи данных на сервер ВетИС.
//
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * КодСостояния - Число - Код состояния (ответа) HTTP-сервера.
//   * Заголовки - Соответствие - HTTP-заголовки ответа сервера.
//   * ТекстОтвета - Строка - Текст ответа.
//
Функция ОтправитьДляОбработки(ТелоЗапроса, АдресРесурса, SOAPAction, НастройкаПодключения)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("КодСостояния");
	ВозвращаемоеЗначение.Вставить("Заголовки");
	ВозвращаемоеЗначение.Вставить("ТекстОтвета");
	ВозвращаемоеЗначение.Вставить("ТекстОшибки");
	
	ИнтернетПрокси = ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси("HTTP");

	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "text/xml; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("SOAPAction", SOAPAction);
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокHTTP);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	ТекстСообщения = СтрШаблон(НСтр("ru='Ошибка отправки POST-запроса к серверу ВетИС %1'"), НастройкаПодключения.Адрес);
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Новый СертификатыУдостоверяющихЦентровОС());
	
	ТекстОшибки = "";
	Попытка
		
		//Если НастройкаПодключения.Порт = "0" Тогда
		//	Соединение = Новый HTTPСоединение(НастройкаПодключения.Адрес, ,НастройкаПодключения.Логин,
		//			НастройкаПодключения.Пароль,	ИнтернетПрокси, НастройкаПодключения.Таймаут, ЗащищенноеСоединение);
		//Иначе
			Соединение = Новый HTTPСоединение(НастройкаПодключения.Адрес, НастройкаПодключения.Порт,НастройкаПодключения.Логин,
					НастройкаПодключения.Пароль, ИнтернетПрокси, НастройкаПодключения.Таймаут, ЗащищенноеСоединение);
		//КонецЕсли;
		
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Исключение
		
		HTTPОтвет = Неопределено;
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(НСтр("ru='ВетИС'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,ТекстСообщения + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибки;
	Если HTTPОтвет <> Неопределено Тогда
		ВозвращаемоеЗначение.КодСостояния = HTTPОтвет.КодСостояния;
		ВозвращаемоеЗначение.Заголовки    = HTTPОтвет.Заголовки;
		ВозвращаемоеЗначение.ТекстОтвета  = HTTPОтвет.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область РаботаСXDTO

// Преобразует объект XDTO в XML
//
// Параметры:
//  ОбъектXDTO - ОбъектXDTO - Объект XDTO.
//  ПространстваИмен - Строка, Массив - Пространство имен.
//  ИмяТипа - Строка - Имя типа.
// 
// Возвращаемое значение:
//  Строка - Текст сообщения XML
//
Функция ОбъектXDTOВXML(ПараметрыОбменов, ОбъектXDTO, ПространстваИмен = Неопределено, ИмяТипа = Неопределено)
	
	ВнутренняяФабрикаXDTO        = ПараметрыОбменов.ФабрикаXDTO;
	//ПараметрыОбъектов            = ПараметрыОбменов.ПараметрыОбъектов;
	СоответствиеПространстваИмен = ПараметрыОбменов.ПространстваИмен;
	
	Если ИмяТипа = Неопределено Тогда
		ИмяТипа = ОбъектXDTO.Тип().Имя;
	КонецЕсли;
	
	Если ПространстваИмен = Неопределено Тогда
		ПространстваИмен = ОбъектXDTO.Тип().URIПространстваИмен;
	КонецЕсли;
	////
	////// Заявка в единой заявочной системе на выполнение определенной операции
	////SubmitRequestDO = ВнутренняяФабрикаXDTO.Создать("http://api.vetrf.ru/schema/cdm/application/ws-definitions", "submitApplicationRequest");
	////SubmitRequestDO.apiKey      = НастройкаПодключения.Ключ;
	////SubmitRequestDO.application = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, SubmitRequestDO, "application");
	////SubmitRequestDO.application.serviceId = "mercury-g2b.service:2.1";
	////SubmitRequestDO.application.issuerId  = НастройкаПодключения.ИдентификаторРСХН;
	////
	////ХранилищеВременныхДат = Новый Соответствие;
	////
	////ИнтеграцияГосИС.УстановитьДатуСЧасовымПоясом(SubmitRequestDO.application, "issueDate", ТекущаяДатаСеанса(), ХранилищеВременныхДат);
	////
	////SubmitRequestDO.application.data = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, SubmitRequestDO.application, "data");
	////SubmitRequestDO.application.data.Добавить(ФормаXML.Элемент, ПространстваИмен, ПараметрыЗапроса.ИмяОбъекта, ОбъектXDTO);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("soapenv:Envelope");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("soapenv", "http://schemas.xmlsoap.org/soap/envelope/");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xs",  "http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	
	Зависимости = Новый Массив;
	
	Если ТипЗнч(ПространстваИмен) = Тип("Массив") Тогда
		Для Каждого ПространствоИмен Из ПространстваИмен Цикл
			Если Зависимости.Найти(ПространствоИмен) = Неопределено Тогда
				Зависимости.Добавить(ПространствоИмен);
			КонецЕсли;
			ИнтеграцияГосИС.ЗависимыеПространстваИмен(ВнутренняяФабрикаXDTO.Пакеты.Получить(ПространствоИмен).Зависимости, Зависимости);
		КонецЦикла;
	Иначе
		ПространствоИмен = ПространстваИмен;
		Если Зависимости.Найти(ПространствоИмен) = Неопределено Тогда
			Зависимости.Добавить(ПространствоИмен);
		КонецЕсли;
		ИнтеграцияГосИС.ЗависимыеПространстваИмен(ВнутренняяФабрикаXDTO.Пакеты.Получить(ПространствоИмен).Зависимости, Зависимости);
	КонецЕсли;
	
	//ИнтеграцияГосИС.ЗависимыеПространстваИмен(ВнутренняяФабрикаXDTO.Пакеты.Получить(ПараметрыЗапроса.ПространствоИмен).Зависимости, Зависимости);
	
	//Если Зависимости.Найти(ПараметрыЗапроса.ПространствоИмен) = Неопределено Тогда
	//	Зависимости.Добавить(ПараметрыЗапроса.ПространствоИмен);
	//КонецЕсли;
	
	Для Каждого ЗависимоеПространство Из Зависимости Цикл
		Префикс = СоответствиеПространстваИмен.Получить(ЗависимоеПространство);
		Если НЕ ПустаяСтрока(Префикс) Тогда
			ЗаписьXML.ЗаписатьСоответствиеПространстваИмен(Префикс, ЗависимоеПространство);
		КонецЕсли;
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("soapenv:Header");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("soapenv:Body");
	
	////ВнутренняяФабрикаXDTO.ЗаписатьXML(ЗаписьXML, SubmitRequestDO, "submitApplicationRequest");
	ВнутренняяФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO, ИмяТипа);
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // soapenv:Body
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // soapenv:Envelope
	
	ТекстXML = ЗаписьXML.Закрыть();
	
	////Для Каждого КлючИЗначение Из ХранилищеВременныхДат Цикл
	////	ТекстXML = СтрЗаменить(ТекстXML, КлючИЗначение.Ключ, КлючИЗначение.Значение);
	////КонецЦикла;
	
	Возврат ТекстXML;
	
КонецФункции

Функция ПреобразоватьПроизвольныйОбъектXDTOВОбъектXDTO(ОбъектXDTOИсточник, ОбъектXDTOПриемник)
	
	ПараметрыОбменов = ИнтеграцияВЕТИСПовтИсп.ПолучитьПараметрыОбменов();
	ВнутренняяФабрикаXDTO = ПараметрыОбменов.ФабрикаXDTO;
	
	Для Каждого СвойствоИсточника Из ОбъектXDTOИсточник.Свойства() Цикл
		
		ИмяСвойства      = СвойствоИсточника.Имя;
		ЗначениеСвойства = ОбъектXDTOИсточник[ИмяСвойства];
		
		СвойствоПриемника = ОбъектXDTOПриемник.Свойства().Получить(ИмяСвойства);
		Если СвойствоПриемника = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеСвойства = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ЗначениеСвойства) = Тип("ОбъектXDTO") Тогда
			
			Если ТипЗнч(СвойствоПриемника.Тип) = Тип("ТипОбъектаXDTO") Тогда
				
				ЗначениеСвойстваПриемника = ИнтеграцияГосИС.ОбъектXDTOПоИмениСвойства(ВнутренняяФабрикаXDTO,СвойствоПриемника.URIПространстваИмен, ИмяСвойства, ОбъектXDTOПриемник);
				
				Если ТипЗнч(ЗначениеСвойстваПриемника) = Тип("ОбъектXDTO") Тогда
					ПреобразоватьПроизвольныйОбъектXDTOВОбъектXDTO(ЗначениеСвойства, ЗначениеСвойстваПриемника);
					
					Если ТипЗнч(ОбъектXDTOПриемник[ИмяСвойства]) = Тип("СписокXDTO") Тогда
						ОбъектXDTOПриемник[ИмяСвойства].Добавить(ЗначениеСвойстваПриемника);
					Иначе
						ОбъектXDTOПриемник[ИмяСвойства] = ЗначениеСвойстваПриемника;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ЗначениеСвойства) = Тип("СписокXDTO") Тогда
			
			Если ОбъектXDTOПриемник[ИмяСвойства] = Неопределено Тогда
				ОпасныйРежим = Истина;
			Иначе
				ОпасныйРежим = Ложь;
			КонецЕсли;
			
			Для Индекс = 0 По ЗначениеСвойства.Количество() - 1 Цикл
				
				ЭлементСпискаИсточника = ЗначениеСвойства.Получить(Индекс);
				Если ТипЗнч(ЭлементСпискаИсточника) = Тип("ОбъектXDTO") Тогда
					
					Если ТипЗнч(СвойствоПриемника.Тип) = Тип("ТипОбъектаXDTO") Тогда
						
						ЭлементаСпискаПриемника =ИнтеграцияГосИС.ОбъектXDTOПоИмениСвойства(ВнутренняяФабрикаXDTO,СвойствоПриемника.URIПространстваИмен, ИмяСвойства, ОбъектXDTOПриемник);
						
						Если ТипЗнч(ЭлементаСпискаПриемника) = Тип("ОбъектXDTO") Тогда
							
							Если Не ОпасныйРежим Тогда
								
								ПреобразоватьПроизвольныйОбъектXDTOВОбъектXDTO(ЭлементСпискаИсточника, ЭлементаСпискаПриемника);
								
								ОбъектXDTOПриемник[ИмяСвойства].Добавить(ЭлементаСпискаПриемника);
								
							Иначе
								
								Если ОбъектXDTOПриемник[ИмяСвойства] = Неопределено Тогда
									ОбъектXDTOПриемник[ИмяСвойства] = ЭлементаСпискаПриемника;
								КонецЕсли;
								
								ПреобразоватьПроизвольныйОбъектXDTOВОбъектXDTO(ЭлементСпискаИсточника, ОбъектXDTOПриемник[ИмяСвойства]);
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					ОбъектXDTOПриемник[ИмяСвойства].Добавить(ЭлементСпискаИсточника);
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			ЗначениеСвойстваПриведенноеКФасету = ПривестиЗначениеСвойстваКФасетам(ЗначениеСвойства, СвойствоПриемника.Тип.Фасеты);
			Если ЗначениеСвойстваПриведенноеКФасету <> Неопределено Тогда
				
				Попытка
					Если ТипЗнч(ОбъектXDTOПриемник[ИмяСвойства]) = Тип("СписокXDTO") Тогда
						ОбъектXDTOПриемник[ИмяСвойства].Добавить(ЗначениеСвойстваПриведенноеКФасету);
					Иначе
						ОбъектXDTOПриемник[ИмяСвойства] = ЗначениеСвойстваПриведенноеКФасету;
					КонецЕсли;
				Исключение
					// Исключение выводится при загрузке данных из XML, несоответствующего XDTO.
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбъектXDTOПриемник;
	
КонецФункции

Функция ПривестиЗначениеСвойстваКФасетам(Значение, Фасеты)
	
	Если Фасеты = Неопределено Тогда
		Возврат Значение;
	КонецЕсли;
	
	ПриведенноеЗначение  = Значение;
	ПроверкаПеречисления = Ложь;
	ПеречислениеНайдено  = Ложь;
	
	Для Каждого Фасет Из Фасеты Цикл
		Если Фасет.Вид = ВидФасетаXDTO.МаксДлина Тогда
			ПриведенноеЗначение = Лев(Значение, Число(Фасет.Значение));
		ИначеЕсли Фасет.Вид = ВидФасетаXDTO.МинДлина Тогда
			МинимальнаяДлина = Число(Фасет.Значение);
			Пока СтрДлина(ПриведенноеЗначение) < МинимальнаяДлина Цикл
				ПриведенноеЗначение = ПриведенноеЗначение + " ";
			КонецЦикла;
		ИначеЕсли Фасет.Вид = ВидФасетаXDTO.Перечисление Тогда
			ПроверкаПеречисления = Истина;
			Если ВРег(Фасет.Значение) = ВРег(Значение) Тогда
				ПриведенноеЗначение = Фасет.Значение;
				ПеречислениеНайдено = Истина;
				Прервать;
			КонецЕсли;
		ИначеЕсли Фасет.Вид = ВидФасетаXDTO.РазрядовДробнойЧасти Тогда
			ПриведенноеЗначение = Окр(ПриведенноеЗначение, Число(Фасет.Значение));
		КонецЕсли;
	КонецЦикла;
	
	Если ПроверкаПеречисления
		И Не ПеречислениеНайдено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ПриведенноеЗначение;
	КонецЕсли;
	
КонецФункции

Функция НайтиУзелDOM(ДокументDOM, ЛокальноеИмя)
	
	УзлыПоИмени = ДокументDOM.ПолучитьЭлементыПоИмени("*",ЛокальноеИмя);
	Если УзлыПоИмени.Количество() > 0 Тогда
		Возврат УзлыПоИмени[0];
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ОбъектXDTOПоИмениТипа(ОбъектXDTOРодитель, ИмяТипа)
	
	Если ТипЗнч(ОбъектXDTOРодитель) = Тип("СписокXDTO") Тогда
		ТипОбъекта = ОбъектXDTOРодитель.ВладеющееСвойство.Тип.Свойства.Получить(ИмяТипа).Тип;
	Иначе
		ТипОбъекта = ОбъектXDTOРодитель.Тип().Свойства.Получить(ИмяТипа).Тип;
	КонецЕсли;
	
	ПараметрыОбменов = ИнтеграцияВЕТИСПовтИсп.ПолучитьПараметрыОбменов();
	ВнутренняяФабрикаXDTO = ПараметрыОбменов.ФабрикаXDTO;
	
	Возврат ВнутренняяФабрикаXDTO.Создать(ТипОбъекта);
	
КонецФункции

// Возвращает пользовательское представление ошибки
//
// Параметры:
//  ПредставлениеОшибки	 - Строка               - представление ошибки до обработки
//  ЧтениеXML            - ЧтениеXML, Структура - ошибочный узел данных
//  Расшифровки          - Структура            - см. ДанныеДляРасшифровкиОшибок()
// 
// Возвращаемое значение:
//  Строка - представление ошибки после обработки
//
Функция ПредставлениеОшибкиXDTO(ПредставлениеОшибки, ЧтениеXML, Расшифровки)
	
	Если СтрНайти(ПредставлениеОшибки, НСтр("ru = 'Ошибка проверки данных XDTO'")) = 0
		И СтрНайти(ПредставлениеОшибки, НСтр("ru = 'Несоответствие типов XDTO'")) = 0 Тогда
		Возврат ПредставлениеОшибки;
	КонецЕсли;
	
	ЗначениеПоля = ЧтениеXML.Значение;
	Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		ЧтениеXML.Прочитать();
	КонецЕсли;
	
	Если Расшифровки.Таблица = Неопределено Тогда
		Расшифровки.Таблица = ИнтеграцияГосИС.ПредставленияПолей(Расшифровки.ИмяМакета);
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ПространствоИмен", ЧтениеXML.URIПространстваИмен);
	Отбор.Вставить("ЛокальноеИмя",     ЧтениеXML.ЛокальноеИмя);
	
	МассивСтрок = Расшифровки.Таблица.НайтиСтроки(Отбор);
	
	СтрокаТаблицы = Неопределено;
	Если МассивСтрок.Количество() = 1 Тогда
		СтрокаТаблицы = МассивСтрок[0];
	ИначеЕсли МассивСтрок.Количество() > 1 И НЕ Расшифровки.Глубина = Неопределено Тогда
		Отбор.Вставить("Глубина", Расшифровки.Глубина);
		МассивСтрокПоГлубине = Расшифровки.Таблица.НайтиСтроки(Отбор);
		Если МассивСтрокПоГлубине.Количество() > 0 Тогда
			СтрокаТаблицы = МассивСтрокПоГлубине[0];
		Иначе
			СтрокаТаблицы = МассивСтрок[0];
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаТаблицы <> Неопределено Тогда
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Если НЕ ЗначениеЗаполнено(ЗначениеПоля) Тогда
				ПредставлениеОшибки = НСтр("ru = 'Не заполнено значение поля ""%1"" (%2)'");
				ПредставлениеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПредставлениеОшибки, СтрокаТаблицы.Представление, ЧтениеXML.Имя);
			Иначе
				ПредставлениеОшибки = НСтр("ru = 'Некорректное значение ""%1"" поля ""%2"" (%3)'");
				ПредставлениеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПредставлениеОшибки, ЗначениеПоля, СтрокаТаблицы.Представление, ЧтениеXML.Имя);
			КонецЕсли;
		Иначе
			ИндексСтроки = Расшифровки.Таблица.Индекс(СтрокаТаблицы);
			
			Пока ИндексСтроки > 0 Цикл
				ПредыдущееПоле = Расшифровки.Таблица[ИндексСтроки - 1];
				Если ПредыдущееПоле.ПространствоИмен <> СтрокаТаблицы.ПространствоИмен Тогда
					Прервать;
				КонецЕсли;
				Если ПредыдущееПоле.Обязательное Тогда
					ПредставлениеОшибки = НСтр("ru = 'Отсутствует обязательное поле ""%1"" (%2)'");
					ПредставлениеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПредставлениеОшибки, ПредыдущееПоле.Представление, ПредыдущееПоле.ЛокальноеИмя);
					Прервать;
				КонецЕсли;
				ИндексСтроки = ИндексСтроки - 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПредставлениеОшибки;
	
КонецФункции

#КонецОбласти

Функция РасширеннаяИнформацияОбОшибке(КраткоеПредставлениеОшибки, ПодробноеПредставлениеОшибки)
	
	РасширеннаяИнформацияОбОшибке = Новый Структура;
	РасширеннаяИнформацияОбОшибке.Вставить("КраткоеПредставлениеОшибки",  КраткоеПредставлениеОшибки);
	РасширеннаяИнформацияОбОшибке.Вставить("ПодробноеПредставлениеОшибки", ПодробноеПредставлениеОшибки);
	
	Возврат РасширеннаяИнформацияОбОшибке;
	
КонецФункции

Функция СтруктураДанныеПредприятия()
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("active");
	Данные.Колонки.Добавить("last");
	Данные.Колонки.Добавить("guid");
	Данные.Колонки.Добавить("uuid");
	Данные.Колонки.Добавить("status");
	Данные.Колонки.Добавить("registryStatus");
	Данные.Колонки.Добавить("createDate");
	Данные.Колонки.Добавить("updateDate");
	Данные.Колонки.Добавить("name");
	Данные.Колонки.Добавить("type");
	Данные.Колонки.Добавить("address");
	Данные.Колонки.Добавить("owner");
	Данные.Колонки.Добавить("GLN");
	Данные.Колонки.Добавить("globalID");
	Данные.Колонки.Добавить("activityList");
	
	Возврат Данные;
КонецФункции

Функция ТипХозяйствующегоСубъекта(Код)
	
	ТипХозяйствующегоСубъекта = Неопределено;
	
	Если Код = 1 Тогда
		ТипХозяйствующегоСубъекта = Перечисления.ФормыСобственности.ЮридическоеЛицо;
	ИначеЕсли Код = 2 Тогда
		ТипХозяйствующегоСубъекта = Перечисления.ФормыСобственности.ЧастноеЛицо;
	ИначеЕсли Код = 3 Тогда
		ТипХозяйствующегоСубъекта = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель;
	ИначеЕсли Код = Неопределено Тогда
		ТипХозяйствующегоСубъекта = Перечисления.ФормыСобственности.ПустаяСсылка();
	Иначе
		ВызватьИсключение
			СтрШаблон(
				НСтр("ru = 'Неизвестный тип хозяйствующего субъекта с кодом: %1'"),
				Код);
	КонецЕсли;
	
	Возврат ТипХозяйствующегоСубъекта;
	
КонецФункции

Процедура ОбработатьОшибку(ТекстОшибки, ИнформацияОбОшибке, ВозвращаемоеЗначение)
	
	Если ТипЗнч(ИнформацияОбОшибке) = Тип("Структура") Тогда
		КраткоеПредставлениеОшибки   = ИнформацияОбОшибке.КраткоеПредставлениеОшибки;
		ПодробноеПредставлениеОшибки = ИнформацияОбОшибке.ПодробноеПредставлениеОшибки;
	Иначе
		КраткоеПредставлениеОшибки   = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецЕсли;
	
	ТекстОшибки = (СтрЗаменить(ТекстОшибки, "%ТекстОшибки%", ПодробноеПредставлениеОшибки));
	ЗаписьЖурналаРегистрации(НСтр("ru='ВетИС'", ОбщегоНазначения.КодОсновногоЯзыка()),УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
	
	ПодготовленныйТекстОшибки = СтрЗаменить(ТекстОшибки, "%ТекстОшибки%", КраткоеПредставлениеОшибки);
	
	Если Не ЗначениеЗаполнено(ВозвращаемоеЗначение.ТекстОшибки) Тогда
		ВозвращаемоеЗначение.ТекстОшибки = ПодготовленныйТекстОшибки;
	Иначе
		ВозвращаемоеЗначение.ТекстОшибки = ВозвращаемоеЗначение.ТекстОшибки+ Символы.ПС+ ПодготовленныйТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

Функция ОбработатьСообщениеОбОшибке(РезультатОтправкиЗапроса, ВозвращаемоеЗначение)
	
	Если РезультатОтправкиЗапроса.КодСостояния = 500 Тогда
		
		ПараметрыОбменов = ИнтеграцияВЕТИСПовтИсп.ПолучитьПараметрыОбменов();
		ВнутренняяФабрикаXDTO = ПараметрыОбменов.ФабрикаXDTO;
		
		Попытка
			
			ОбъектXDTO = ИнтеграцияГосИС.ПроизвольныйОбъектXDTOПоТекстуСообщенияXML(ВнутренняяФабрикаXDTO,
				РезультатОтправкиЗапроса.ТекстВходящегоСообщенияSOAP);
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектXDTO.Body.Fault.detail, "business") Тогда
				ИнформацияОбОшибке = ОбъектXDTO.Body.Fault.detail.business.detail;
			Иначе
				ИнформацияОбОшибке = ОбъектXDTO.Body.Fault.detail;
			КонецЕсли;
			
			НеизвестнаяОшибка = Ложь;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИнформацияОбОшибке, "internalServiceFault") Тогда
				
				ДанныеОшибки = ИнформацияОбОшибке.internalServiceFault;
				
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИнформацияОбОшибке, "incorrectRequestFault") Тогда
				
				ДанныеОшибки = ИнформацияОбОшибке.incorrectRequestFault;
				
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИнформацияОбОшибке, "offsetOutOfRangeFault") Тогда
				
				ДанныеОшибки = ИнформацияОбОшибке.offsetOutOfRangeFault;
				
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИнформацияОбОшибке, "accessDeniedFault") Тогда
				
				ДанныеОшибки = ИнформацияОбОшибке.accessDeniedFault;
				
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИнформацияОбОшибке, "entityNotFoundFault") Тогда
				
				ДанныеОшибки = ИнформацияОбОшибке.entityNotFoundFault;
				
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИнформацияОбОшибке, "requestRejectedFault") Тогда
				
				ДанныеОшибки = ИнформацияОбОшибке.requestRejectedFault;
				
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИнформацияОбОшибке, "fault") Тогда
				
				НеизвестнаяОшибка = Истина;
				
			КонецЕсли;
			
			Если Не НеизвестнаяОшибка Тогда
				
				ОписаниеОшибки = ДанныеОшибки.message;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеОшибки, "error") Тогда
					
					КодОшибки = ДанныеОшибки.error.code;
					ОписаниеОшибки = ОписаниеОшибки + Символы.ПС;
					
				Иначе
					КодОшибки = НСтр("ru = '<Код отсутствует>'");
				КонецЕсли;
				
			Иначе
				
				ОписаниеОшибки  = ИнформацияОбОшибке.fault.reason;
				КодОшибки       = ИнформацияОбОшибке.fault.errorCode;
			
			КонецЕсли;
			
		Исключение
			
			КодОшибки       = НСтр("ru = 'Неизвестный код'");
			ОписаниеОшибки  = НСтр("ru = 'Неизвестная ошибка'");
			ЗаписьЖурналаРегистрации(НСтр("ru='ВетИС'", ОбщегоНазначения.КодОсновногоЯзыка()),УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		КонецПопытки;
		
		ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Код состояния HTTP: %1. Код ошибки: %2. Текст ошибки: %3.'"),
			РезультатОтправкиЗапроса.КодСостояния,
			КодОшибки,
			ОписаниеОшибки);
		
		Возврат ВозвращаемоеЗначение;
		
	Иначе
		
		Если РезультатОтправкиЗапроса.КодСостояния = 401 Тогда
			ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Код состояния HTTP: %1. Описание ошибки: %2.'"),
				РезультатОтправкиЗапроса.КодСостояния,
				НСтр("ru = 'Нет доступа'"));
		Иначе
			Если ЗначениеЗаполнено(РезультатОтправкиЗапроса.ТекстОшибки) Тогда
				ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Код состояния HTTP: %1. Текст ошибки: %2.'"),
					РезультатОтправкиЗапроса.КодСостояния,
					РезультатОтправкиЗапроса.ТекстОшибки);
			Иначе
				ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Код состояния HTTP: %1. Текст сообщения HTTP: %2.'"),
					РезультатОтправкиЗапроса.КодСостояния,
					РезультатОтправкиЗапроса.ТекстВходящегоСообщенияSOAP);
			КонецЕсли;
		КонецЕсли;
		
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЗначениеИзДокументаDOMПоИмениПоля(ТекстВходящегоСообщенияSOAP, ИмяПоля, ИсходныйXML = Неопределено)
	
	ПостроительDOM = Новый ПостроительDOM;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстВходящегоСообщенияSOAP);
	
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	
	УзелDOM = НайтиУзелDOM(ДокументDOM, ИмяПоля);
	
	Текст = Неопределено;
	Если УзелDOM <> Неопределено Тогда
		
		Текст = ТекстXMLУзлаDOM(УзелDOM);
		
		Если ИсходныйXML <> Неопределено Тогда
			УзелDOM.РодительскийУзел.УдалитьДочерний(УзелDOM);
			ИсходныйXML = ТекстXMLУзлаDOM(ДокументDOM);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ТекстXMLУзлаDOM(УзелDOM)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(УзелDOM, ЗаписьXML);
	
	ТекстXML = ЗаписьXML.Закрыть();
	
	Возврат ТекстXML;
	
КонецФункции

#КонецОбласти

#Область НастройкиОбменов

// Возвращает настройки обмена с ВетИС
//
// Параметры:
//  ТранспортныйМодуль  - Массив, Структура, СправочникСсылка.ХозяйствующиеСубъектыВЕТИС - Организации, предприятия ВетИС для обмена.
//  ЭтоРегламентноеЗадание - Булево - признак регламентного задания (по умолчанию Ложь)
// 
// Возвращаемое значение:
//  Соответствие - Настройки обмена, см. функцию ИнтеграцияЕГАИСКлиентСервер.НоваяНастройкаПодключения()
//
Функция НастройкиПодключения(ХозяйствующийСубъект, ДатыПоследнегоЗапуска = Неопределено, ПоВсемПользователям = Ложь) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ОбменНаСервере", Новый Соответствие);
	//ВозвращаемоеЗначение.Вставить("Предприятия",    Новый Соответствие);
	ХозяйствующиеСубъекты = Новый Массив;
	
	ОбменПоРасписанию = (ДатыПоследнегоЗапуска <> Неопределено);
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Если ПоВсемПользователям Тогда
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиПодключенияВЕТИС.ХозяйствующийСубъект КАК ХозяйствующийСубъект,
		|	НастройкиПодключенияВЕТИС.ХозяйствующийСубъект.Код КАК ИдентификаторРСХН,
		|	НастройкиПодключенияВЕТИС.Администратор.Логин КАК Пользователь,
		|	НастройкиПодключенияВЕТИС.Ключ КАК Ключ,
		|	НастройкиПодключенияВЕТИС.Пароль КАК Пароль,
		|	НастройкиПодключенияВЕТИС.Логин КАК Логин,
		|	НастройкиПодключенияВЕТИС.Таймаут КАК Таймаут,
		|	НастройкиПодключенияВЕТИС.ВремяОжиданияОбработкиЗаявки КАК ВремяОжиданияОбработкиЗаявки,
		|	НастройкиПодключенияВЕТИС.ИнтервалМеждуЗапросамиСинхронизации КАК ИнтервалМеждуЗапросамиСинхронизации,
		|	НастройкиПодключенияВЕТИС.КоличествоПовторныхЗапросов КАК КоличествоПовторныхЗапросов,
		|	НастройкиПодключенияВЕТИС.ОтправлятьЗапросыПовторно КАК ОтправлятьЗапросыПовторно,
		|	НастройкиПодключенияВЕТИС.ИнтервалЗапросаИзмененныхДанных КАК ИнтервалЗапросаИзмененныхДанных
		|ИЗ
		|	РегистрСведений.НастройкиПодключенияВЕТИС КАК НастройкиПодключенияВЕТИС"+?(ЗначениеЗаполнено(ХозяйствующийСубъект), "
		|ГДЕ 
		|	НастройкиПодключенияВЕТИС.ХозяйствующийСубъект В (&ХозяйствующийСубъекты)", "")+"
		|";
		
	Иначе
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиПодключенияВЕТИС.ХозяйствующийСубъект КАК ХозяйствующийСубъект,
		|	НастройкиПодключенияВЕТИС.ХозяйствующийСубъект.Код КАК ИдентификаторРСХН,
		|	ПользователиВЕТИС.Логин КАК Пользователь,
		|	НастройкиПодключенияВЕТИС.Ключ КАК Ключ,
		|	НастройкиПодключенияВЕТИС.Пароль КАК Пароль,
		|	НастройкиПодключенияВЕТИС.Логин КАК Логин,
		|	НастройкиПодключенияВЕТИС.Таймаут КАК Таймаут,
		//|	НастройкиПодключенияВЕТИС.ПоРасписанию КАК ПоРасписанию,
		//|	НастройкиПодключенияВЕТИС.Расписание КАК Расписание,
		|	НастройкиПодключенияВЕТИС.ВремяОжиданияОбработкиЗаявки КАК ВремяОжиданияОбработкиЗаявки,
		|	НастройкиПодключенияВЕТИС.ИнтервалМеждуЗапросамиСинхронизации КАК ИнтервалМеждуЗапросамиСинхронизации,
		|	НастройкиПодключенияВЕТИС.КоличествоПовторныхЗапросов КАК КоличествоПовторныхЗапросов,
		|	НастройкиПодключенияВЕТИС.ОтправлятьЗапросыПовторно КАК ОтправлятьЗапросыПовторно,
		|	НастройкиПодключенияВЕТИС.ИнтервалЗапросаИзмененныхДанных КАК ИнтервалЗапросаИзмененныхДанных
		|ИЗ
		|	РегистрСведений.НастройкиПодключенияВЕТИС КАК НастройкиПодключенияВЕТИС
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.ПользователиВЕТИС КАК ПользователиВЕТИС
		|ПО
		|	ПользователиВЕТИС.Пользователь = &ТекущийПользователь И 
		|	ПользователиВЕТИС.ХозяйствующийСубъект = НастройкиПодключенияВЕТИС.ХозяйствующийСубъект"+?(ЗначениеЗаполнено(ХозяйствующийСубъект), "
		|	И НастройкиПодключенияВЕТИС.ХозяйствующийСубъект В (&ХозяйствующийСубъекты)", "")+"
		|";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("ХозяйствующийСубъекты",  ХозяйствующийСубъект);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	АдресСервера = ИнтеграцияВЕТИСВызовСервера.АдресСервера();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		
		//ВыполнитьОбменПоРасписанию = Ложь;
		//Если ОбменПоРасписанию И Выборка.ПоРасписанию Тогда
		//	Расписание = Выборка.Расписание.Получить();
		//	Если Расписание <> Неопределено Тогда
		//		ДатаПоследнегоЗапуска = ДатыПоследнегоЗапуска.Получить(Выборка.ХозяйствующийСубъект);
		//		Если (НЕ ДатаПоследнегоЗапуска = Неопределено) И 
		//			(НЕ Расписание.ТребуетсяВыполнение(ТекущаяДатаСеанса(), ДатаПоследнегоЗапуска)) Тогда
		//			Продолжить;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		
		НастройкаПодключения = ИнтеграцияВЕТИСКлиентСервер.НоваяНастройкаПодключения();
		НастройкаПодключения.Логин             = Выборка.Логин;
		НастройкаПодключения.ИдентификаторРСХН = Выборка.ИдентификаторРСХН;
		НастройкаПодключения.Таймаут           = Выборка.Таймаут;
		НастройкаПодключения.Пароль            = Выборка.Пароль;
		НастройкаПодключения.Ключ              = Выборка.Ключ;
		НастройкаПодключения.Пользователь      = Выборка.Пользователь;
		НастройкаПодключения.Адрес             = АдресСервера.Адрес;
		НастройкаПодключения.Порт              = АдресСервера.Порт;
		
		НастройкаПодключения.ХозяйствующийСубъект = Выборка.ХозяйствующийСубъект;
		
		НастройкаПодключения.ВремяОжиданияОбработкиЗаявки        = Выборка.ВремяОжиданияОбработкиЗаявки;
		НастройкаПодключения.ИнтервалМеждуЗапросамиСинхронизации = Выборка.ИнтервалМеждуЗапросамиСинхронизации;
		НастройкаПодключения.КоличествоПовторныхЗапросов         = Выборка.КоличествоПовторныхЗапросов;
		//НастройкаПодключения.КоличествоЭлементов                 = Выборка.КоличествоЭлементов;
		НастройкаПодключения.ОтправлятьЗапросыПовторно           = Выборка.ОтправлятьЗапросыПовторно;
		НастройкаПодключения.ИнтервалЗапросаИзмененныхДанных     = Выборка.ИнтервалЗапросаИзмененныхДанных;
		
		//УстановитьПривилегированныйРежим(Истина);
		//БезопасныеСтроки = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Выборка.ХозяйствующийСубъект, "Пароль,КлючAPI");
		//УстановитьПривилегированныйРежим(Ложь);
		
		//НастройкаПодключенияВЕТИС.Пароль  = БезопасныеСтроки.Пароль;
		//НастройкаПодключенияВЕТИС.КлючAPI = БезопасныеСтроки.КлючAPI;
		
		ВозвращаемоеЗначение.ОбменНаСервере.Вставить(Выборка.ХозяйствующийСубъект, НастройкаПодключения);
		
		ХозяйствующиеСубъекты.Добавить(Выборка.ХозяйствующийСубъект);
		
		//Предприятия = Новый Массив;
		//ВыборкаПредприятия = Выборка.Предприятия.Выбрать();
		//Пока ВыборкаПредприятия.Следующий() Цикл
		//	Предприятия.Добавить(ВыборкаПредприятия.Предприятие);
		//КонецЦикла;
		
		//Предприятия.Добавить(Предприятие);
		//
		//ВозвращаемоеЗначение.Предприятия.Вставить(Выборка.ХозяйствующийСубъект, Предприятия);
		
	КонецЦикла;
	
	ВозвращаемоеЗначение.Вставить("ХозяйствующиеСубъекты", ХозяйствующиеСубъекты);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращает структуру параметров обмена.
//
// Возвращаемое значение:
//  ТранспортныйМодуль - 
//  УникальныйИдентификатор - 
//  ЭтоРегламентноеЗадание - Булево, Истина, если вызов выполняется регламентным заданием.
//
Функция ПараметрыОбмена(ХозяйствующийСубъект, УникальныйИдентификатор = Неопределено, ДатыПоследнегоЗапуска = Неопределено, ПоВсемПользователям = Ложь) Экспорт
	
	// Получение настроек обмена ВЕТИС для выполнения обмена на сервере
	НастройкиПодключения             = НастройкиПодключения(ХозяйствующийСубъект, ДатыПоследнегоЗапуска, ПоВсемПользователям);
	//ДоступныеТранспортныеМодули = ИнтеграцияВЕТИСКлиентСервер.ХозяйствующиеСубъекты(НастройкиПодключения.ОбменНаСервере);
	
	//ОписаниеТиповПредприятие         = Новый ОписаниеТипов("СправочникСсылка.ПредприятияВЕТИС");
	
	ДатыПоследнегоЗапросаСписков = Новый ТаблицаЗначений;
	ДатыПоследнегоЗапросаСписков.Колонки.Добавить("Предприятие");
	ДатыПоследнегоЗапросаСписков.Колонки.Добавить("ВидОперации");
	ДатыПоследнегоЗапросаСписков.Колонки.Добавить("ДатаЗапуска");
	
	ПараметрыОбмена = Новый Структура;
	ПараметрыОбмена.Вставить("ХозяйствующиеСубъекты",            НастройкиПодключения.ХозяйствующиеСубъекты);
	ПараметрыОбмена.Вставить("НастройкиПодключения",                  НастройкиПодключения.ОбменНаСервере);
	//ПараметрыОбмена.Вставить("Предприятия",                     НастройкиПодключения.Предприятия);
	ПараметрыОбмена.Вставить("ОжидатьНаСервере",                 Истина);
	ПараметрыОбмена.Вставить("ДатыПоследнегоЗапросаСписков",     ДатыПоследнегоЗапросаСписков);
	ПараметрыОбмена.Вставить("ДатаПоследнегоЗапросаСписка",      '00010101000000');
	ПараметрыОбмена.Вставить("ФоновоеЗадание",                   Неопределено);
	
	ПараметрыОбмена.Вставить("Изменения",        Новый Массив);
	ПараметрыОбмена.Вставить("НомерИтерации",    1);
	
	ПараметрыОбмена.Вставить("ОбработанныеЭлементыОчереди", Новый Массив);
	ПараметрыОбмена.Вставить("ОчередьСообщений",            НоваяТаблицаОчередьСообщений());
	
	ПараметрыОбмена.Вставить("КоличествоПопытокВосстановленияДокументов",    3);
	ПараметрыОбмена.Вставить("РазмерПорции",                                 500);
	
	НастройкаПодключения = ПараметрыОбмена.НастройкиПодключения.Получить(ХозяйствующийСубъект);
	Если НастройкаПодключения = Неопределено Тогда
		ПараметрыОбмена.Вставить("ВремяОжиданияОбработкиЗаявки",      1800);
		ПараметрыОбмена.Вставить("ОтправлятьЗависшиеЗапросыПовторно", Истина);
		ПараметрыОбмена.Вставить("КоличествоПовторныхЗапросов",       15);
		ПараметрыОбмена.Вставить("ИнтервалМеждуЗапросамиСписков",     10);
		ПараметрыОбмена.Вставить("ИнтервалЗапросаИзмененныхДанных",   3600);
	Иначе
		ПараметрыОбмена.Вставить("ВремяОжиданияОбработкиЗаявки",      НастройкаПодключения.ВремяОжиданияОбработкиЗаявки);
		ПараметрыОбмена.Вставить("КоличествоПовторныхЗапросов",       НастройкаПодключения.КоличествоПовторныхЗапросов);
		ПараметрыОбмена.Вставить("ОтправлятьЗависшиеЗапросыПовторно", НастройкаПодключения.ОтправлятьЗапросыПовторно);
		ПараметрыОбмена.Вставить("ИнтервалМеждуЗапросамиСписков",     НастройкаПодключения.ИнтервалМеждуЗапросамиСинхронизации);
		ПараметрыОбмена.Вставить("ИнтервалЗапросаИзмененныхДанных",   НастройкаПодключения.ИнтервалЗапросаИзмененныхДанных);
	КонецЕсли;
	
	ЗависимостиСообщений = Новый ТаблицаЗначений;
	ЗависимостиСообщений.Колонки.Добавить("Сообщение1");
	ЗависимостиСообщений.Колонки.Добавить("Сообщение2");
	ЗависимостиСообщений.Колонки.Добавить("Загрузка");
	ЗависимостиСообщений.Колонки.Добавить("Передача");
	
	ЗависимостиСообщений.Индексы.Добавить("Сообщение1");
	ЗависимостиСообщений.Индексы.Добавить("Сообщение2");
	ЗависимостиСообщений.Индексы.Добавить("Сообщение1, Передача");
	ЗависимостиСообщений.Индексы.Добавить("Сообщение1, Загрузка");
	
	ПараметрыОбмена.Вставить("ЗависимостиСообщений",        ЗависимостиСообщений);
	//ПараметрыОбмена.Вставить("ПараметрыПреобразования",     Неопределено);
	
	ПараметрыОбмена.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	Если УникальныйИдентификатор <> Неопределено Тогда
		ПараметрыОбмена.Вставить("АдресВоВременномХранилище", ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор));
	Иначе
		ПараметрыОбмена.Вставить("АдресВоВременномХранилище", Неопределено);
	КонецЕсли;
	
	//// Документы к загрузке: Дата -> ДокументОбъект
	//ДокументыКЗагрузке = Новый Структура;
	//ДокументыКЗагрузке.Вставить("ВходящаяТранспортнаяОперацияВЕТИС",        Новый Соответствие);
	//ДокументыКЗагрузке.Вставить("ИнвентаризацияПродукцииВЕТИС",             Новый Соответствие);
	//ДокументыКЗагрузке.Вставить("ИсходящаяТранспортнаяОперацияВЕТИС",       Новый Соответствие);
	//ДокументыКЗагрузке.Вставить("ОбъединениеЗаписейСкладскогоЖурналаВЕТИС", Новый Соответствие);
	//ДокументыКЗагрузке.Вставить("ПроизводственнаяОперацияВЕТИС",            Новый Соответствие);
	//ПараметрыОбмена.Вставить("ДокументыКЗагрузке", ДокументыКЗагрузке);
	
	// Данные документов к загрузке: Дата -> Массив записей журнала
	//ТаблицаЭлементовПоДатам = Новый ТаблицаЗначений;
	//ТаблицаЭлементовПоДатам.Колонки.Добавить("Дата");
	//ТаблицаЭлементовПоДатам.Колонки.Добавить("ТаблицаЭлементов");
	//ПараметрыОбмена.Вставить("ТаблицаЭлементовПоДатам", ТаблицаЭлементовПоДатам);
	//
	ПараметрыОбмена.Вставить("ЗагружатьПоСсылкамИзСервиса", Истина);
	ПараметрыОбмена.Вставить("КОтложеннойЗагрузке", Новый Структура);
	//
	//ТаблицаСтопЛист = Новый ТаблицаЗначений;
	//ТаблицаСтопЛист.Колонки.Добавить("ХозяйствующийСубъект", ОписаниеТиповХозяйствующийСубъект);
	//ТаблицаСтопЛист.Колонки.Добавить("Предприятие", ОписаниеТиповПредприятие);
	//
	//ПараметрыОбмена.Вставить("СтопЛист", ТаблицаСтопЛист);
	
	Возврат ПараметрыОбмена;
	
КонецФункции

#КонецОбласти

#Область ФормированиеЗапросовСлужебныеПроцедурыИФункции

Процедура ЗаполнитьПериодXDTO(ВнутренняяФабрикаXDTO, ОбъектXDTO, ДатаНач, ДатаКон, СоставДатыС = 4, СоставДатыПо = 4)
	
	Если ЗначениеЗаполнено(ДатаНач) Тогда
		firstDate = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектXDTO, "firstDate");
		Если СоставДатыС = 4 ИЛИ СоставДатыС = 0 Тогда
			firstDate.year  = Год(ДатаНач);
			firstDate.month = Месяц(ДатаНач);
			firstDate.day   = День(ДатаНач);
			firstDate.hour  = Час(ДатаНач);
		ИначеЕсли СоставДатыС = 3 Тогда
			firstDate.year  = Год(ДатаНач);
			firstDate.month = Месяц(ДатаНач);
			firstDate.day   = День(ДатаНач);
		ИначеЕсли СоставДатыС = 2 Тогда
			firstDate.year  = Год(ДатаНач);
			firstDate.month = Месяц(ДатаНач);
		ИначеЕсли СоставДатыС = 1 Тогда
			firstDate.year  = Год(ДатаНач);
		КонецЕсли;
		
		ОбъектXDTO.firstDate = firstDate;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаКон) Тогда
		secondDate = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектXDTO, "secondDate");
		Если СоставДатыПо = 4 ИЛИ СоставДатыПо = 0 Тогда
			secondDate.year  = Год(ДатаКон);
			secondDate.month = Месяц(ДатаКон);
			secondDate.day   = День(ДатаКон);
			secondDate.hour  = Час(ДатаКон);
		ИначеЕсли СоставДатыС = 3 Тогда
			secondDate.year  = Год(ДатаКон);
			secondDate.month = Месяц(ДатаКон);
			secondDate.day   = День(ДатаКон);
		ИначеЕсли СоставДатыС = 2 Тогда
			secondDate.year  = Год(ДатаКон);
			secondDate.month = Месяц(ДатаКон);
		ИначеЕсли СоставДатыС = 1 Тогда
			secondDate.year  = Год(ДатаКон);
		КонецЕсли;
		
		ОбъектXDTO.secondDate = secondDate;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьХозОперациюВСД(Знач ТипВСД)
	
	Результат = Неопределено;
	
	ТипВСД = ВРег(ТипВСД);
	
	Если ТипВСД = "INCOMING" Тогда
		Результат = Справочники.ХозОперации.ТранспортныйВСДВЕТИС;
	ИначеЕсли ТипВСД = "OUTGOING" Тогда
		Результат = Справочники.ХозОперации.ТранспортныйВСДВЕТИС;
	ИначеЕсли ТипВСД = "PRODUCTIVE" Тогда
		Результат = Справочники.ХозОперации.ПроизводственныйВСДВЕТИС;
	ИначеЕсли ТипВСД = "RETURNABLE" Тогда
		Результат = Справочники.ХозОперации.ВозвратныйВСДВЕТИС;
	ИначеЕсли ТипВСД = "TRANSPORT" Тогда
		Результат = Справочники.ХозОперации.ТранспортныйВСДВЕТИС;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ФормированиеЗапросов

Функция СообщениеНеНайденыНастройкиПодключенияПараметрыОбмена(СообщенияXML, СообщениеXML, ХозяйствующийСубъект, ПараметрыОбмена = Неопределено) Экспорт
	
	//Если ПараметрыОбмена <> Неопределено
	//	И ПараметрыОбмена.ХозяйствующиеСубъектыНедоступные.Найти(ХозяйствующийСубъект) <> Неопределено Тогда
	//	ИнтеграцияИСКлиентСервер.ДобавитьТекстОшибки(СообщениеXML, СтрШаблон(
	//		НСтр("ru = 'Для пользователя %1 не настроен в список пользователей хозяйствующего субъекта %2.'"),
	//		Пользователи.ТекущийПользователь(),
	//		ХозяйствующийСубъект));
	//Иначе
		ИнтеграцияГосИСКлиентСервер.ДобавитьТекстОшибки(
			СообщениеXML,
			НСтр("ru='Не найдена настройка для подключения к ВетИС.'"));
	//КонецЕсли;
	
	СообщенияXML.Добавить(СообщениеXML);
	
	Возврат СообщенияXML;
	
КонецФункции

Функция СтруктураСообщенияXML() Экспорт
	
	СообщениеXML = Новый Структура;
	
	// Параметры запроса
	СообщениеXML.Вставить("ТекстСообщенияXML", "");
	СообщениеXML.Вставить("ТекстОшибки",       "");
	СообщениеXML.Вставить("Ошибки", Новый Соответствие);
	
	// Для отображения в сообщениях пользователям
	СообщениеXML.Вставить("Описание", "");
	СообщениеXML.Вставить("ВидОперации");
	
	// Для сохранения в протоколе обмена
	СообщениеXML.Вставить("ХозяйствующийСубъект");
	СообщениеXML.Вставить("ТипСообщения");
	СообщениеXML.Вставить("Объект");
	СообщениеXML.Вставить("Версия", 0);
	//СообщениеXML.Вставить("ФорматОбмена");
	
	// Для формирования очереди сообщений по записям складского журнала
	СообщениеXML.Вставить("ЗаписиСкладскогоЖурнала");
	// Для формирования очереди сообщений
	СообщениеXML.Вставить("Предприятие");
	СообщениеXML.Вставить("ПараметрыЗапроса");
	
	//localTransactionId
	СообщениеXML.Вставить("ИдентификаторТранзакции", "");
	
	Возврат СообщениеXML;
	
КонецФункции

Функция ЗаявкаXML(ПараметрыОбменов, НастройкаПодключения, ОбъектXDTO, ПараметрыЗапроса) Экспорт
	
	ВнутренняяФабрикаXDTO = ПараметрыОбменов.ФабрикаXDTO;
	ХранилищеВременныхДат = Новый Соответствие;
	
	ИмяТипа          = ОбъектXDTO.Тип().Имя;
	ПространстваИмен = ОбъектXDTO.Тип().URIПространстваИмен;
	
	// Заявка в единой заявочной системе на выполнение определенной операции
	SubmitRequestDO = ВнутренняяФабрикаXDTO.Создать("http://api.vetrf.ru/schema/cdm/application/ws-definitions", "submitApplicationRequest");
	SubmitRequestDO.apiKey      = НастройкаПодключения.Ключ;
	SubmitRequestDO.application = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, SubmitRequestDO, "application");
	SubmitRequestDO.application.serviceId = "mercury-g2b.service:2.1";
	SubmitRequestDO.application.issuerId  = НастройкаПодключения.ИдентификаторРСХН;
	
	ХранилищеВременныхДат = Новый Соответствие;
	
	ИнтеграцияГосИС.УстановитьДатуСЧасовымПоясом(SubmitRequestDO.application, "issueDate", ТекущаяДатаСеанса(), ХранилищеВременныхДат);
	
	SubmitRequestDO.application.data = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, SubmitRequestDO.application, "data");
	SubmitRequestDO.application.data.Добавить(ФормаXML.Элемент, ПространстваИмен, ПараметрыЗапроса.ИмяОбъекта, ОбъектXDTO);
	
	ПространстваИмен = Новый Массив;
	ПространстваИмен.Добавить("http://api.vetrf.ru/schema/cdm/application/ws-definitions");
	ПространстваИмен.Добавить(ОбъектXDTO.Тип().URIПространстваИмен);
	
	ТекстСообщенияXML = ОбъектXDTOВXML(ПараметрыОбменов, SubmitRequestDO);
	
	Для Каждого КлючИЗначение Из ХранилищеВременныхДат Цикл
		ТекстСообщенияXML = СтрЗаменить(ТекстСообщенияXML, КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	Возврат ТекстСообщенияXML;
	
КонецФункции

Функция СформироватьСообщениеXML(ВидОперации, ДанныеДляВыгрузки, НастройкаПодключения, ПараметрыОбмена, ХозяйствующийСубъект, Предприятие)
	
	ПараметрыОбменов      = ИнтеграцияВЕТИСПовтИсп.ПолучитьПараметрыОбменов();
	ВнутренняяФабрикаXDTO = ПараметрыОбменов.ФабрикаXDTO;
	ПараметрыОбъектов     = ПараметрыОбменов.ПараметрыОбъектов;
	
	ПараметрыЗапроса = ПараметрыОбъектов[ВидОперации];
	
	СообщениеXML = СтруктураСообщенияXML();
	СообщениеXML.Описание = ПараметрыЗапроса.Описание;
	
	//ПространствоИмен = ПараметрыЗапроса.ПространствоИмен;
	ИмяТипа          = ПараметрыЗапроса.ИмяТипа;
	ИмяОбъекта       = ПараметрыЗапроса.ИмяОбъекта;
	
	//Если НЕ ЗначениеЗаполнено(ПространствоИмен) Тогда
	//	ИнтеграцияГосИС.ДобавитьТекстОшибки(
	//		СообщениеXML,
	//		СтрШаблон(НСтр("ru = 'Операция не поддерживается.'")));
	//	СообщенияXML.Добавить(СообщениеXML);
	//	Возврат СообщенияXML;
	//КонецЕсли;
	
	ОбъектЗапроса = ПолучитьЗначениеПараметраСтруктуры(ДанныеДляВыгрузки, "Объект", Неопределено);
	
	Если ЗначениеЗаполнено(ОбъектЗапроса) Тогда
		Попытка
			localTransactionId = ОбъектЗапроса.УникальныйИдентификатор();
		Исключение
			localTransactionId = Новый УникальныйИдентификатор;
		КонецПопытки;
	Иначе
		localTransactionId = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	localTransactionId = Строка(localTransactionId);
	
	ПространствоИмен = "http://api.vetrf.ru/schema/cdm/mercury/g2b/applications/v2";
	
	ЗапросXDTO = ИнтеграцияГосИС.ОбъектXDTOПоИмениСвойства(ВнутренняяФабрикаXDTO, ПространствоИмен, ИмяТипа);
	
	ЗаполнитьЗапросXDTO(ВнутренняяФабрикаXDTO, ХозяйствующийСубъект, ЗапросXDTO, ПараметрыОбмена, ПараметрыЗапроса, ДанныеДляВыгрузки, СообщениеXML);
	
	ПользовательXDTO = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ЗапросXDTO, "initiator");
	ПользовательXDTO.login = СокрЛП(НастройкаПодключения.Пользователь);
	
	ЗапросXDTO.localTransactionId = localTransactionId;
	ЗапросXDTO.initiator          = ПользовательXDTO;
	//ЗапросXDTO.uuid               = ПараметрыЗапроса.Идентификатор;
	//ЗапросXDTO.enterpriseGuid     = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЗапроса.Предприятие, "Идентификатор");
	
	ТекстСообщенияXML = ЗаявкаXML(ПараметрыОбменов, НастройкаПодключения, ЗапросXDTO, ПараметрыЗапроса);
	
	СообщениеXML.ТекстСообщенияXML    = ТекстСообщенияXML;
	СообщениеXML.ТипСообщения         = Перечисления.ВходящееИсходящееСобытие.Исходящее;
	СообщениеXML.ХозяйствующийСубъект = ХозяйствующийСубъект;
	СообщениеXML.Предприятие          = Предприятие;
	СообщениеXML.ВидОперации           = ВидОперации;
	СообщениеXML.Объект               = ПолучитьЗначениеПараметраСтруктуры(ДанныеДляВыгрузки, "Объект", Неопределено);
	СообщениеXML.ПараметрыЗапроса     = ДанныеДляВыгрузки;
	
	Возврат СообщениеXML
	
КонецФункции

Функция СформироватьСообщенияXML(ВидОперации, ДанныеДляВыгрузки, ПараметрыОбмена, ХозяйствующийСубъект, Предприятие) Экспорт
	
	СообщенияXML = Новый Массив;
	
	НастройкаПодключения = ПараметрыОбмена.НастройкиПодключения.Получить(ХозяйствующийСубъект);
	Если НастройкаПодключения = Неопределено Тогда
		СообщениеXML = СтруктураСообщенияXML();
		Возврат СообщениеНеНайденыНастройкиПодключенияПараметрыОбмена(СообщенияXML, СообщениеXML, ХозяйствующийСубъект, ПараметрыОбмена);
	КонецЕсли;
	
	Если ДанныеДляВыгрузки.Свойство("МассивДанных") Тогда
		Для Каждого ПоляДанных Из ДанныеДляВыгрузки.МассивДанных Цикл
			
			ПорцияДанныхДляВыгрузки = ИнтеграцияВЕТИСКлиентСервер.СтруктураДанныхДляВыгрузки();
			ПорцияДанныхДляВыгрузки.ХозяйствующийСубъект = ХозяйствующийСубъект;
			ПорцияДанныхДляВыгрузки.Предприятие          = Предприятие;
			ПорцияДанныхДляВыгрузки.ВидОперации          = ВидОперации;
			
			Для Каждого ЗначениеПоля Из ПоляДанных Цикл
				ПорцияДанныхДляВыгрузки.Вставить(ЗначениеПоля.Ключ, ЗначениеПоля.Значение);
			КонецЦикла;
			
			СообщениеXML = СформироватьСообщениеXML(ВидОперации, ПорцияДанныхДляВыгрузки, НастройкаПодключения, ПараметрыОбмена, ХозяйствующийСубъект, Предприятие);
			СообщенияXML.Добавить(СообщениеXML);
		КонецЦикла;
	Иначе
		СообщениеXML = СформироватьСообщениеXML(ВидОперации, ДанныеДляВыгрузки, НастройкаПодключения, ПараметрыОбмена, ХозяйствующийСубъект, Предприятие);
		СообщенияXML.Добавить(СообщениеXML);
	КонецЕсли;
	
	Возврат СообщенияXML;
	
КонецФункции

Процедура ЗаполнитьЗапросXDTO(ВнутренняяФабрикаXDTO, ХозяйствующийСубъект, ОбъектЗапроса, ПараметрыОбмена, ПараметрыЗапроса, ДанныеДляВыгрузки, СообщениеXML)
	
	ВидОперации = ПараметрыЗапроса.ВидОперации;
	
	Если ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросНаАннулированиеВСД Тогда
		
		Если ЗначениеЗаполнено(ДанныеДляВыгрузки.ВСД.Идентификатор) Тогда
			ОбъектЗапроса.vetDocumentId  = ДанныеДляВыгрузки.ВСД.Идентификатор; // Идентификатор ВСД, который аннулируется.
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеДляВыгрузки.ПричинаАннулирования) Тогда
			ОбъектЗапроса.withdrawReason = ДанныеДляВыгрузки.ПричинаАннулирования; // Причина аннулирования ВСД.
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеДляВыгрузки.ДатаАннулирования) Тогда
			ОбъектЗапроса.withdrawDate   = ДанныеДляВыгрузки.ДатаАннулирования; // Дата аннулирования ВСД.
		КонецЕсли;
		
		specifiedPerson = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "specifiedPerson");
		
		МеркурийЛогин = ПолучитьЛогинПользователя(ХозяйствующийСубъект, ДанныеДляВыгрузки.Ответственный);
		Если ЗначениеЗаполнено(МеркурийЛогин) Тогда
			specifiedPerson.login = МеркурийЛогин;
		КонецЕсли;
		ОбъектЗапроса.specifiedPerson      = specifiedPerson; //Ветеринарный врач, ответственный за аннулирование ВСД.
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросПользователейХозяйствующегоСубъекта Тогда
		
		Если ДанныеДляВыгрузки.Свойство("ListOptions") Тогда
			listOptions = ДанныеДляВыгрузки.ListOptions;
		Иначе
			listOptions = ПолучитьListOptions(ВнутренняяФабрикаXDTO);
			Если ДанныеДляВыгрузки.Свойство("КоличествоЭлементов") И ЗначениеЗаполнено(ДанныеДляВыгрузки.КоличествоЭлементов) Тогда
				listOptions.count = ДанныеДляВыгрузки.КоличествоЭлементов;
			КонецЕсли;
			Если ДанныеДляВыгрузки.Свойство("Смещение") И ЗначениеЗаполнено(ДанныеДляВыгрузки.Смещение) Тогда
				listOptions.offset = ДанныеДляВыгрузки.Смещение;
			КонецЕсли;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		
		ОбъектЗапроса.listOptions = listOptions;
		ДополнительныеПараметры.Вставить("offset", listOptions.offset);
		ДополнительныеПараметры.Вставить("count", listOptions.count);
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросВозможностиПеревозки Тогда
		
		ЗаполнитьЗапросВозможностиПеревозки(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросВсехВСД Тогда
		
		Если Не ДанныеДляВыгрузки.Свойство("КоличествоЭлементов") Тогда
			ДанныеДляВыгрузки.Вставить("КоличествоЭлементов",    ПараметрыОбмена.РазмерПорции);
			ДанныеДляВыгрузки.Вставить("Смещение",               0);
			ДанныеДляВыгрузки.Вставить("ПервыйЗапрос",           Истина);
			ДанныеДляВыгрузки.Вставить("ПоследнийЗапрос",        Ложь);
			ДанныеДляВыгрузки.Вставить("СмещениеПервогоЗапроса", 0);
		КонецЕсли;
		
		ЗаполнитьЗапросЗапросВсехВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросВСД Тогда
		
		ЗаполнитьЗапросВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросИзмененныхВСД Тогда
		
		Если Не ДанныеДляВыгрузки.Свойство("КоличествоЭлементов") Тогда
			ДанныеДляВыгрузки.Вставить("КоличествоЭлементов",    ПараметрыОбмена.РазмерПорции);
			ДанныеДляВыгрузки.Вставить("Смещение",               0);
			ДанныеДляВыгрузки.Вставить("ПервыйЗапрос",           Истина);
			ДанныеДляВыгрузки.Вставить("ПоследнийЗапрос",        Ложь);
			ДанныеДляВыгрузки.Вставить("СмещениеПервогоЗапроса", 0);
		КонецЕсли;
		
		ЗаполнитьЗапросИзмененныхВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросИзмененныхЗаписейСкладскогоЖурнала Тогда
		
		Если Не ДанныеДляВыгрузки.Свойство("КоличествоЭлементов") Тогда
			ДанныеДляВыгрузки.Вставить("КоличествоЭлементов",    ПараметрыОбмена.РазмерПорции);
			ДанныеДляВыгрузки.Вставить("Смещение",               0);
			ДанныеДляВыгрузки.Вставить("ПервыйЗапрос",           Истина);
			ДанныеДляВыгрузки.Вставить("ПоследнийЗапрос",        Ложь);
			ДанныеДляВыгрузки.Вставить("СмещениеПервогоЗапроса", 0);
		КонецЕсли;
		
		ЗаполнитьЗапросИзмененныхЗаписейСкладскогоЖурнала(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросЗаписиСкладскогоЖурнала Тогда
		
		ОбъектЗапроса.Guid           = ДанныеДляВыгрузки.ИдентификаторПартии;
		ОбъектЗапроса.enterpriseGuid = ДанныеДляВыгрузки.guidПредприятия;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросНаСозданиеИзменениеСвязиСПлощадкой Тогда
		
		ЗаполнитьЗапросНаСозданиеИзменениеСвязиСПлощадкой(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросНаРегистрациюИзменениеПредприятия Тогда
		
		ЗаполнитьЗапросНаРегистрациюИзменениеПредприятия(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросНаОформлениеРезультатовИнвентаризации Тогда
		
		ДанныеДляВыгрузки.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
		Если ДанныеДляВыгрузки.Объект.ХозОперация = Справочники.ХозОперации.ВводОстатковТоваровВЕТИС Тогда
			ЗаполнитьЗапросВводНачальныхОстатков(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		ИначеЕсли ДанныеДляВыгрузки.Объект.ХозОперация = Справочники.ХозОперации.СписаниеТоваровВЕТИС Тогда
			ЗаполнитьЗапросСписание(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросНаОформлениеТранспортнойПартии Тогда
		
		ЗаполнитьЗапросИсходящийВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросНаОформлениеПроизводственнойПартии Тогда
		
		Если ДанныеДляВыгрузки.ТипОперациии = "Производство" Тогда
			ЗаполнитьЗапросПроизводственныйВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		ИначеЕсли ДанныеДляВыгрузки.ТипОперациии = "СписаниеСырья" Тогда
			ЗаполнитьЗапросСписанияСырья(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		ИначеЕсли ДанныеДляВыгрузки.ТипОперациии = "ВыпускПродукции" Тогда
			ЗаполнитьЗапросВыпускПродукцииВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		ИначеЕсли ДанныеДляВыгрузки.ТипОперациии = "СписаниеПолуфабрикатов" Тогда
			ЗаполнитьЗапросСписанияПолуфабрикатов(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросНаОформлениеВходящейПартии Тогда
		
		ЭтоВозврат = ПолучитьЗначениеПараметраСтруктуры(ДанныеДляВыгрузки, "ЭтоВозврат", Ложь);
		ДанныеДляВыгрузки.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
		Если ЭтоВозврат И ТипЗнч(ДанныеДляВыгрузки.Объект) = Тип("ДокументСсылка.ВСДВЕТИС") Тогда
			ЗаполнитьЗапросВозвратВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		ИначеЕсли ТипЗнч(ДанныеДляВыгрузки.Объект) = Тип("ДокументСсылка.ВСДВЕТИС") Тогда
			ЗаполнитьЗапросУпрощенногоГашенияВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		Иначе
			ЗаполнитьЗапросГашенияВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросПакетногоГашенияВСД Тогда
		
		ДанныеДляВыгрузки.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
		ЗаполнитьЗапросПакетноеГашениеВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросЗаписейСкладскогоЖурнала Тогда
		
		Если Не ДанныеДляВыгрузки.Свойство("КоличествоЭлементов") Тогда
			ДанныеДляВыгрузки.Вставить("КоличествоЭлементов",    ПараметрыОбмена.РазмерПорции);
			ДанныеДляВыгрузки.Вставить("Смещение",               0);
			ДанныеДляВыгрузки.Вставить("ПервыйЗапрос",           Истина);
			ДанныеДляВыгрузки.Вставить("ПоследнийЗапрос",        Ложь);
			ДанныеДляВыгрузки.Вставить("СмещениеПервогоЗапроса", 0);
		КонецЕсли;
	
		ЗаполнитьЗапросЗаписейСкладскогоЖурнала(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросНаРегистрациюИзменениеПродукции Тогда
		
		ЗаполнитьЗапросНаРегистрациюИзменениеПродукции(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки);
		
	//ИначеЕсли ИмяЗаявки = "getStockEntryByUuidRequest" Тогда
	//	
	//	ОбъектЗапроса.uuid           = ДанныеДляВыгрузки.guidЗаявки;
	//	ОбъектЗапроса.enterpriseGuid = ДанныеДляВыгрузки.guidПредприятия;
	//	
	//ИначеЕсли ИмяЗаявки = "checkShipmentRegionalizationRequest" Тогда
	//	
	//	ДанныеДляВыгрузки.Вставить("ИспользуетсяВторойФормат", ВтораяВерсия);
	//	ЗаполнитьЗапросПроверкаУсловийПеревозки(Прокси, ОбъектЗапроса, ДанныеДляВыгрузки);
	//	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗапросВозможностиПеревозки(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(СкладскойЖурналВЕТИС.ВидПродукции.Код, """") КАК ВидПродукции
	|ИЗ
	|	Документ.ТранспортныеОперацииВЕТИС.Партии КАК ТранспортныеОперацииВЕТИС
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СкладскойЖурналВЕТИС КАК СкладскойЖурналВЕТИС
	|ПО
	|	ТранспортныеОперацииВЕТИС.Идентификатор = СкладскойЖурналВЕТИС.Идентификатор
	|ГДЕ
	|	ТранспортныеОперацииВЕТИС.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДляВыгрузки.Объект);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		cargoType = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса.cargoType);
		cargoType.guid = Выборка.ВидПродукции;
		
		ОбъектЗапроса.cargoType.Добавить(cargoType);
	КонецЦикла;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТранспортныеОперацииВЕТИС.НомерСтроки,
	|	ТранспортныеОперацииВЕТИС.НазваниеПункта,
	//|	ТранспортныеОперацииВЕТИС.СПерегрузкой,
	//|	ТранспортныеОперацииВЕТИС.ТранспортноеСредство.ТипТС КАК ТипТС,
	//|	ТранспортныеОперацииВЕТИС.ТранспортноеСредство.НомерТС КАК НомерТС,
	|	ТранспортныеОперацииВЕТИС.Предприятие,
	|	ТранспортныеОперацииВЕТИС.Страна.Код КАК Страна,
	|	ТранспортныеОперацииВЕТИС.Регион.Код КАК Регион
	//|	ТранспортныеОперацииВЕТИС.Прицеп.НомерТС КАК НомерПрицепа,
	//|	ТранспортныеОперацииВЕТИС.НомерКонтейнера
	|ИЗ
	|	Документ.ТранспортныеОперацииВЕТИС.ПунктыПерегрузки КАК ТранспортныеОперацииВЕТИС
	|ГДЕ
	|	ТранспортныеОперацииВЕТИС.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	ТранспортныеОперацииВЕТИС.НомерСтроки
	|";
	
	shipmentRoute = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "shipmentRoute");
	
	// отправитель
	routePoint = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, shipmentRoute.routePoint);
	routePoint.sqnId = 1;
	
	enterprise = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, routePoint, "enterprise");
	enterprise.guid = ДанныеДляВыгрузки.Объект.ПредприятиеОтправитель.Код;
	routePoint.enterprise = enterprise;
	
	
	shipmentRoute.routePoint.Добавить(routePoint);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		cargoReloadingPoint = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, shipmentRoute.routePoint);
		cargoReloadingPoint.sqnId = Выборка.НомерСтроки+1;
		
		Если ЗначениеЗаполнено(Выборка.НазваниеПункта) Тогда
			location = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, cargoReloadingPoint, "location");
			location.name = Выборка.НазваниеПункта;
			
			address = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, location, "address");
			
			Если ЗначениеЗаполнено(Выборка.Страна) Тогда
				country = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, address, "country");
				country.guid = Выборка.Страна;
				address.country=country;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.Регион) Тогда
				region = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, address, "region");
				region.guid = Выборка.Регион;
				address.region=region;
			КонецЕсли;
			
			//addressView = СоздатьСвойствоОбъектаXDTO(address, "addressView");
			//addressView = Выборка.НазваниеПункта;
			//address.addressView = addressView;
			location.address = address;
			
			cargoReloadingPoint.location = location;// Название пункта перегрузки.
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.Предприятие) Тогда
			enterprise = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, cargoReloadingPoint, "enterprise");
			enterprise.guid = ДанныеДляВыгрузки.Объект.ПредприятиеПолучатель.Код;
			cargoReloadingPoint.enterprise = enterprise;
		КонецЕсли;
		
		shipmentRoute.routePoint.Добавить(cargoReloadingPoint);
		
	КонецЦикла;
	
	// получатель
	routePoint = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, shipmentRoute.routePoint);
	routePoint.sqnId = Число(Выборка.Количество() + 2);
	enterprise = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, routePoint, "enterprise");
	enterprise.guid = ДанныеДляВыгрузки.Объект.ПредприятиеПолучатель.Код;
	routePoint.enterprise = enterprise;
	
	shipmentRoute.routePoint.Добавить(routePoint);
	
	ОбъектЗапроса.shipmentRoute = shipmentRoute;
	
КонецПроцедуры

Процедура ЗаполнитьЗапросЗапросВсехВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	listOptions = ПолучитьListOptions(ВнутренняяФабрикаXDTO);
	listOptions.count  = ДанныеДляВыгрузки.КоличествоЭлементов;
	listOptions.offset = ДанныеДляВыгрузки.Смещение;
	
	ОбъектЗапроса.listOptions         = listOptions;
	ОбъектЗапроса.enterpriseGuid      = ДанныеДляВыгрузки.guidПредприятия;
	
	Если ДанныеДляВыгрузки.Свойство("ТипВСД") И ЗначениеЗаполнено(ДанныеДляВыгрузки.ТипВСД) Тогда
		ОбъектЗапроса.vetDocumentType = ДанныеДляВыгрузки.ТипВСД;
	КонецЕсли;
	
	Если ДанныеДляВыгрузки.Свойство("СтатусВСД") И ЗначениеЗаполнено(ДанныеДляВыгрузки.СтатусВСД) Тогда
		ОбъектЗапроса.vetDocumentStatus = Перечисления.СтатусыВСДВЕТИС.ПолучитьЗначениеВЕТИС(ДанныеДляВыгрузки.СтатусВСД);
	КонецЕсли;
	
	Если ДанныеДляВыгрузки.Свойство("ДатаОкончания") И ЗначениеЗаполнено(ДанныеДляВыгрузки.ДатаОкончания) Тогда
		issueDateInterval = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "issueDateInterval");
		issueDateInterval.beginDate = ДанныеДляВыгрузки.ДатаНачала;
		issueDateInterval.endDate   = КонецДня(ДанныеДляВыгрузки.ДатаОкончания);
		ОбъектЗапроса.issueDateInterval = issueDateInterval;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗапросВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	Если ЗначениеЗаполнено(ДанныеДляВыгрузки.guidПредприятия) Тогда
		ОбъектЗапроса.enterpriseGuid = ДанныеДляВыгрузки.guidПредприятия;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляВыгрузки.uuid) Тогда
		ОбъектЗапроса.uuid           = ДанныеДляВыгрузки.uuid;
	КонецЕсли;
	
	Если ДанныеДляВыгрузки.Свойство("Погасить") Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Погасить", ДанныеДляВыгрузки.Погасить);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗапросИзмененныхВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	Если ДанныеДляВыгрузки.Свойство("ListOptions") Тогда
		listOptions = ДанныеДляВыгрузки.ListOptions;
	Иначе
		listOptions = ПолучитьListOptions(ВнутренняяФабрикаXDTO);
		Если ДанныеДляВыгрузки.Свойство("КоличествоЭлементов") И ЗначениеЗаполнено(ДанныеДляВыгрузки.КоличествоЭлементов) Тогда
			listOptions.count = ДанныеДляВыгрузки.КоличествоЭлементов;
		КонецЕсли;
		Если ДанныеДляВыгрузки.Свойство("Смещение") И ЗначениеЗаполнено(ДанныеДляВыгрузки.Смещение) Тогда
			listOptions.offset = ДанныеДляВыгрузки.Смещение;
		КонецЕсли;
	КонецЕсли;
	
	ОбъектЗапроса.listOptions        = listOptions;
	ОбъектЗапроса.enterpriseGuid     = ДанныеДляВыгрузки.guidПредприятия;
	
	ДополнительныеПараметры = Новый Структура;
	
	Если ДанныеДляВыгрузки.Свойство("ТипВСД") И ЗначениеЗаполнено(ДанныеДляВыгрузки.ТипВСД) Тогда
		ОбъектЗапроса.vetDocumentType = ДанныеДляВыгрузки.ТипВСД;
		ДополнительныеПараметры.Вставить("ТипВСД", ДанныеДляВыгрузки.ТипВСД);
	КонецЕсли;
	
	Если ДанныеДляВыгрузки.Свойство("СтатусВСД") И ЗначениеЗаполнено(ДанныеДляВыгрузки.СтатусВСД) Тогда
		ОбъектЗапроса.vetDocumentStatus = Перечисления.СтатусыВСДВЕТИС.ПолучитьЗначениеВЕТИС(ДанныеДляВыгрузки.СтатусВСД);
		ДополнительныеПараметры.Вставить("СтатусВСД", ДанныеДляВыгрузки.СтатусВСД);
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("offset", listOptions.offset);
	ДополнительныеПараметры.Вставить("count",  listOptions.count);
	
	Если ДанныеДляВыгрузки.Свойство("ДатаОкончания") И ЗначениеЗаполнено(ДанныеДляВыгрузки.ДатаОкончания) Тогда
		updateDateInterval = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "updateDateInterval");
		updateDateInterval.beginDate = ДанныеДляВыгрузки.ДатаНачала;
		updateDateInterval.endDate   = КонецДня(ДанныеДляВыгрузки.ДатаОкончания);
		ОбъектЗапроса.updateDateInterval = updateDateInterval;
		//ДополнительныеПараметры.Вставить("ДатаНачала",    ДанныеДляВыгрузки.ДатаНачала);
		//ДополнительныеПараметры.Вставить("ДатаОкончания", ДанныеДляВыгрузки.ДатаОкончания);
	Иначе
		ДатаЗапроса = НачалоДня(ТекущаяДата());
		//ДатаЗапроса = ПолучитьДатуПоследнегоЗапроса(ХозяйствующийСубъект, Предприятие, "ЗапросИзмененныхДокументов");
		updateDateInterval = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "updateDateInterval");
		updateDateInterval.beginDate = ДатаЗапроса;
		updateDateInterval.endDate   = КонецДня(ТекущаяДата());
		ОбъектЗапроса.updateDateInterval = updateDateInterval;
		//ДополнительныеПараметры.Вставить("ДатаНачала",    ДатаЗапроса);
		//ДополнительныеПараметры.Вставить("ДатаОкончания", КонецДня(ТекущаяДата()));
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗапросИзмененныхЗаписейСкладскогоЖурнала(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	Если ДанныеДляВыгрузки.Свойство("ListOptions") Тогда
		listOptions = ДанныеДляВыгрузки.ListOptions;
	Иначе
		listOptions = ПолучитьListOptions(ВнутренняяФабрикаXDTO);
		Если ДанныеДляВыгрузки.Свойство("КоличествоЭлементов") И ЗначениеЗаполнено(ДанныеДляВыгрузки.КоличествоЭлементов) Тогда
			listOptions.count = ДанныеДляВыгрузки.КоличествоЭлементов;
		КонецЕсли;
		Если ДанныеДляВыгрузки.Свойство("Смещение") И ЗначениеЗаполнено(ДанныеДляВыгрузки.Смещение) Тогда
			listOptions.offset = ДанныеДляВыгрузки.Смещение;
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	
	Если ДанныеДляВыгрузки.Свойство("ДатаОкончания") И ЗначениеЗаполнено(ДанныеДляВыгрузки.ДатаОкончания) Тогда
		updateDateInterval = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "updateDateInterval");
		updateDateInterval.beginDate = ДанныеДляВыгрузки.ДатаНачала;
		updateDateInterval.endDate   = КонецДня(ДанныеДляВыгрузки.ДатаОкончания);
		ОбъектЗапроса.updateDateInterval = updateDateInterval;
		//ДополнительныеПараметры.Вставить("ДатаНачала",    ДанныеДляВыгрузки.ДатаНачала);
		//ДополнительныеПараметры.Вставить("ДатаОкончания", ДанныеДляВыгрузки.ДатаОкончания);
	Иначе
		//ДатаЗапроса = ПолучитьДатуПоследнегоЗапроса(ХозяйствующийСубъект, Предприятие, "ЗапросИзмененныхСкладскихЗаписей");
		ДатаЗапроса = НачалоДня(ТекущаяДата());
		updateDateInterval = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "updateDateInterval");
		updateDateInterval.beginDate = ДатаЗапроса;
		updateDateInterval.endDate   = КонецДня(ТекущаяДата());
		ОбъектЗапроса.updateDateInterval = updateDateInterval;
		//ДополнительныеПараметры.Вставить("ДатаНачала",    ДатаЗапроса);
		//ДополнительныеПараметры.Вставить("ДатаОкончания", КонецДня(ТекущаяДата()));
	КонецЕсли;
	
	ОбъектЗапроса.listOptions        = listOptions;
	ОбъектЗапроса.enterpriseGuid     = ДанныеДляВыгрузки.guidПредприятия;
	
	ДополнительныеПараметры.Вставить("offset", listOptions.offset);
	ДополнительныеПараметры.Вставить("count", listOptions.count);
	
КонецПроцедуры

Процедура ЗаполнитьЗапросНаСозданиеИзменениеСвязиСПлощадкой(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	modificationOperation = ВнутренняяФабрикаXDTO.Создать(ВнутренняяФабрикаXDTO.Тип("http://api.vetrf.ru/schema/cdm/cerberus/enterprise", "BEActivityLocationsModificationOperation"));
	
	businessEntity = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, modificationOperation, "businessEntity");
	businessEntity.guid = ДанныеДляВыгрузки.guidХС;
	
	enterpriseList = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, modificationOperation, "enterpriseList");
	
	enterprise = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, enterpriseList.enterprise);
	enterprise.guid = ДанныеДляВыгрузки.guidПредприятия;
	
	enterpriseList.enterprise.Добавить(enterprise);
	enterpriseList.count  = 1;
	enterpriseList.total  = 1;
	enterpriseList.offset = 0;
	
	modificationOperation.businessEntity = businessEntity;
	modificationOperation.enterpriseList = enterpriseList;
	modificationOperation.type           = "CREATE";
	
	ОбъектЗапроса.modificationOperation = modificationOperation;
	
КонецПроцедуры

Процедура ЗаполнитьЗапросНаРегистрациюИзменениеПредприятия(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	modificationOperation = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "modificationOperation");
	
	resultingList = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, modificationOperation, "resultingList");
	
	enterprise = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, resultingList.enterprise);
	
	activityList = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, enterprise, "activityList");
	Для Каждого ТекущаяСтрока Из ДанныеДляВыгрузки.ВидыДеятельности Цикл
		activity = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, activityList.activity);
		activity.name = ТекущаяСтрока.ВидДеятельности;
		Если ЗначениеЗаполнено(ТекущаяСтрока.Идентификатор) Тогда
			activity.uuid = ТекущаяСтрока.Идентификатор;
		КонецЕсли;
		
		activityList.activity.Добавить(activity);
	КонецЦикла;
	
	activityList.count  = ДанныеДляВыгрузки.ВидыДеятельности.Количество();
	activityList.total  = ДанныеДляВыгрузки.ВидыДеятельности.Количество();
	activityList.offset = 0;
	
	address = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, enterprise, "address");
	
	country = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, address, "country");
	Если ЗначениеЗаполнено(ДанныеДляВыгрузки.Страна) Тогда
		country.guid = ДанныеДляВыгрузки.Страна;
	КонецЕсли;
	
	region = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, address, "region");
	Если ЗначениеЗаполнено(ДанныеДляВыгрузки.Регион) Тогда
		region.guid = ДанныеДляВыгрузки.Регион;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляВыгрузки.Район) Тогда
		district = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, address, "district");
		district.guid = ДанныеДляВыгрузки.Район;
		address.district = district;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляВыгрузки.НаселённыйПункт) Тогда
		locality = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, address, "locality");
		locality.guid = ДанныеДляВыгрузки.НаселённыйПункт;
		address.locality = locality;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляВыгрузки.ПодчиненныйНаселённыйПункт) Тогда
		subLocality = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, address, "subLocality");
		subLocality.guid = ДанныеДляВыгрузки.ПодчиненныйНаселённыйПункт;
		address.subLocality = subLocality;
	КонецЕсли;
	
	street = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, address, "street");
	Если ЗначениеЗаполнено(ДанныеДляВыгрузки.Улица) Тогда
		street.guid = ДанныеДляВыгрузки.Улица;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляВыгрузки.Дом) Тогда
		address.house = ДанныеДляВыгрузки.Дом;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляВыгрузки.Строение) Тогда
		address.building = ДанныеДляВыгрузки.Строение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляВыгрузки.Квартира) Тогда
		address.room = ДанныеДляВыгрузки.Квартира;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляВыгрузки.ПочтовыйИндекс) Тогда
		address.postIndex = ДанныеДляВыгрузки.ПочтовыйИндекс;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДляВыгрузки.АбонентскийЯщик) Тогда
		address.postBox = ДанныеДляВыгрузки.АбонентскийЯщик;
	КонецЕсли;
	
	address.country = country;
	address.region  = region;
	address.street = street;
	address.addressView = ДанныеДляВыгрузки.Адрес;
	
	owner      = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, enterprise, "owner");
	owner.guid = ДанныеДляВыгрузки.ХозяйствующийСубъект.Код;
	
	enterprise.activityList = activityList;
	enterprise.address = address;
	enterprise.name = ДанныеДляВыгрузки.Наименование;
	enterprise.owner = owner;
	
	Если ДанныеДляВыгрузки.ТипПредприятия = "Предприятие" Тогда
		enterprise.type = 1;
	ИначеЕсли ДанныеДляВыгрузки.ТипПредприятия = "Рынок" Тогда
		enterprise.type = 2;
	ИначеЕсли ДанныеДляВыгрузки.ТипПредприятия = "СББЖ" Тогда
		enterprise.type = 3;
	ИначеЕсли ДанныеДляВыгрузки.ТипПредприятия = "Судно" Тогда
		enterprise.type = 4;
	КонецЕсли;
	
	Если ДанныеДляВыгрузки.Свойство("uuid") Тогда
		enterprise.uuid      = ДанныеДляВыгрузки.uuid;
	КонецЕсли;
	
	resultingList.enterprise.Добавить(enterprise);
	resultingList.count  = 1;
	resultingList.total  = 1;
	resultingList.offset = 0;
	
	modificationOperation.resultingList = resultingList;
	Если ДанныеДляВыгрузки.Свойство("type") Тогда
		modificationOperation.type      = ДанныеДляВыгрузки.type;
	Иначе
		modificationOperation.type      = "CREATE";
	КонецЕсли;
	modificationOperation.reason        = ДанныеДляВыгрузки.Причина;
	
	ОбъектЗапроса.modificationOperation = modificationOperation;
	
КонецПроцедуры

Процедура ЗаполнитьЗапросВводНачальныхОстатков(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВводНачальныхОстатков.Предприятие.Код КАК Предприятие,
	|	ВводНачальныхОстатков.ХозяйствующийСубъект.Код КАК ХозяйствующийСубъект,
	|	ВводНачальныхОстатков.Дата КАК Дата,
	|	ВводНачальныхОстатков.Автор КАК Ответственный,
	|	ВводНачальныхОстатков.Товары.(
	|		Продукция.Код КАК КодПродукции,
	|		Продукция.Наименование КАК НаименованиеПродукции,
	|		Продукция.ИдентификаторЗаписи КАК ИдентификаторПродукции,
	|		ВидПродукции.Родитель.Код КАК Продукция,
	|		ВидПродукции.ТипПродукции.Код КАК ТипПродукции,
	|		ВидПродукции.Код КАК ВидПродукции,
	|		Количество,
	|		ЕдиницаИзмерения.Код КАК ЕдиницаИзмерения,
	|		ДатаВыработки,
	|		ДатаВыработкиПо,
	|		СрокГодности,
	|		СрокГодностиПо,
	|		СтранаПроисхождения.Код КАК СтранаПроисхождения,
	|		СтранаПроисхождения.Наименование КАК СтранаПроисхожденияНаименование,
	|		Скоропортящаяся,
	|		Некачественный,
	|		ИдентификаторСтроки
	|	),
	|	ВводНачальныхОстатков.Производители.(
	|		Производитель.Код КАК Производитель,
	|		Производитель.Наименование КАК ПроизводительНаименование,
	|		РольПроизводителя,
	|		ИдентификаторСтроки
	|	),
	|	ВводНачальныхОстатков.Упаковки.(
	|		КоличествоУпаковок,
	|		Упаковка.Код КАК Упаковка,
	|		УровеньУпаковки,
	|		Маркировка,
	|		ТипМаркировки,
	|		ИдентификаторСтроки
	|	)
	|ИЗ
	|	Документ.ВводНачальныхОстатковВЕТИС КАК ВводНачальныхОстатков
	|ГДЕ
	|	ВводНачальныхОстатков.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДляВыгрузки.Объект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	//businessEntity = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ОбъектЗапроса, "businessEntity");
	//businessEntity.guid = Выборка.ХозяйствующийСубъект;
	
	enterprise = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "enterprise");
	enterprise.guid = Выборка.Предприятие;
	
	responsible = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "responsible");
	
	МеркурийЛогин = ПолучитьЛогинПользователя(ДанныеДляВыгрузки.ХозяйствующийСубъект, Выборка.Ответственный);
	responsible.login = МеркурийЛогин;
	
	discrepancyReport = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "discrepancyReport");
	
	//ОбъектЗапроса.businessEntity = businessEntity; // Хозяйствующий субъект, на площадке которого осуществляется инвентаризация .
	ОбъектЗапроса.enterprise     = enterprise; // Площадка на которой осуществляется инвентаризация . Указывается из списка мест осуществления деятельности для хозяйствующего субъекта.
	ОбъектЗапроса.inventoryDate  = Выборка.Дата; // Дата проведения инвентаризации.
	ОбъектЗапроса.responsible    = responsible; // Ответственный за инвентаризацию. Указывается пользователь из списка пользователей для хозяйствующего субъекта - заявителя.
	//ОбъектЗапроса.stockDiscrepancy // Сведения о результате инвентаризации (по одному факту расхождения).
	ОбъектЗапроса.discrepancyReport.Добавить(discrepancyReport); // Сведения об акте несоответствия.
	
	Производители = Выборка.Производители.Выгрузить();
	Упаковки = Выборка.Упаковки.Выгрузить();
	
	ВыборкаТоваров = Выборка.Товары.Выбрать();
	
	stockDiscrepancy = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "stockDiscrepancy");
	
	resultingList = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, stockDiscrepancy, "resultingList");
	
	resultingList.count  = ВыборкаТоваров.Количество();
	resultingList.total  = ВыборкаТоваров.Количество();
	resultingList.offset = 0;
	
	Пока ВыборкаТоваров.Следующий() Цикл
		stockEntry = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, resultingList.stockEntry);
		batch = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, stockEntry, "batch");
		
		owner = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "owner");
		owner.guid = Выборка.ХозяйствующийСубъект;
		
		product = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "product");
		product.guid = ВыборкаТоваров.Продукция;
		
		productItem = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "productItem");
		productItem.guid = ВыборкаТоваров.КодПродукции;
		productItem.name = ВыборкаТоваров.НаименованиеПродукции;
		productItem.uuid = ВыборкаТоваров.ИдентификаторПродукции;
		
		subProduct = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "subProduct");
		subProduct.guid = ВыборкаТоваров.ВидПродукции;
		
		unit = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "unit");
		unit.guid = ВыборкаТоваров.ЕдиницаИзмерения;
		
		
		НайденныеПроизводители = Производители.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаТоваров.ИдентификаторСтроки));
		Если НайденныеПроизводители.Количество()>0 Тогда
			// Сведения от производителя.
			origin = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "origin");
			
			// Продукция производителя оригинал.
			Если ЗначениеЗаполнено(ВыборкаТоваров.СтранаПроисхождения) Тогда
				country = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, origin, "country");
				country.guid = ВыборкаТоваров.СтранаПроисхождения;
				country.name = ВыборкаТоваров.СтранаПроисхожденияНаименование;
				origin.country = country;
			КонецЕсли;
			
			Для Каждого СтрокаПроизводителя Из НайденныеПроизводители Цикл
				producer = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, origin, "producer");
				
				// Предприятие-производитель
				Если ЗначениеЗаполнено(СтрокаПроизводителя.Производитель) Тогда
					Enterprise = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, producer, "enterprise");
					Enterprise.guid = СтрокаПроизводителя.Производитель;
					Enterprise.name = СтрокаПроизводителя.ПроизводительНаименование;
					producer.enterprise = Enterprise;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаПроизводителя.РольПроизводителя) Тогда
					producer.role = Перечисления.РолиПроизводителяВЕТИС.ПолучитьЗначениеВЕТИС(СтрокаПроизводителя.РольПроизводителя);
				КонецЕсли;
				
				origin.producer.Добавить(producer);
			КонецЦикла;
			
			batch.origin = origin;
		КонецЕсли;
		
		expiryDate = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "expiryDate");
		
		ЗаполнитьПериодXDTO(ВнутренняяФабрикаXDTO, expiryDate, ВыборкаТоваров.СрокГодности, ВыборкаТоваров.СрокГодностиПо);
		
		dateOfProduction = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "dateOfProduction");
		
		ЗаполнитьПериодXDTO(ВнутренняяФабрикаXDTO, dateOfProduction, ВыборкаТоваров.ДатаВыработки, ВыборкаТоваров.ДатаВыработкиПо);
		
		batch.dateOfProduction = dateOfProduction;
		batch.expiryDate       = expiryDate;
		batch.lowGradeCargo    = ВыборкаТоваров.Некачественный;
		
		УпаковкиПартии = Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаТоваров.ИдентификаторСтроки));
		Если УпаковкиПартии.Количество()>0 Тогда
			batch.packageList = ПолучитьУпаковкиПартииXDTO(ВнутренняяФабрикаXDTO, УпаковкиПартии, batch);
		КонецЕсли;
		
		batch.perishable   = ВыборкаТоваров.Скоропортящаяся;
		//batch.producerList = producerList;
		batch.product      = product;
		batch.productItem  = productItem;
		//batch.productMarkingList = productMarkingList;
		batch.productType  = ВыборкаТоваров.ТипПродукции;
		//productionOperationId
		batch.subProduct   = subProduct;
		batch.unit         = unit;
		batch.volume       = ВыборкаТоваров.Количество;
		batch.owner        = owner;
		
		stockEntry.batch = batch;
		
		resultingList.stockEntry.Добавить(stockEntry);
		
	КонецЦикла;
	
	stockDiscrepancy.resultingList = resultingList;
	
	ОбъектЗапроса.stockDiscrepancy.Добавить(stockDiscrepancy);
	
КонецПроцедуры

Процедура ЗаполнитьЗапросСписание(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МеркурийСписание.Предприятие.Код КАК Предприятие,
	|	МеркурийСписание.ХозяйствующийСубъект.Код КАК ХозяйствующийСубъект,
	|	МеркурийСписание.Дата КАК Дата,
	|	МеркурийСписание.Автор КАК Ответственный
	|ИЗ
	|	Документ.МеркурийСписание КАК МеркурийСписание
	|ГДЕ
	|	МеркурийСписание.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	МеркурийСписание.Количество,
	|	МеркурийСписание.ЕдиницаИзмерения.Код КАК ЕдиницаИзмерения,
	|	МеркурийСписание.ИдентификаторСтрокиПартий,
	|	СкладскойЖурналВЕТИС.ИдентификаторЗаписи,
	//|	СкладскойЖурналВЕТИС.Производитель.Код КАК Производитель,
	//|	СкладскойЖурналВЕТИС.Продукция.Код КАК КодПродукции,
	|	СкладскойЖурналВЕТИС.Продукция.Наименование КАК НаименованиеПродукции,
	//|	СкладскойЖурналВЕТИС.Продукция.ИдентификаторЗаписи КАК ИдентификаторПродукции,
	|	ВЫБОР
	|		КОГДА СкладскойЖурналВЕТИС.Продукция.НеЗарегистрирована ТОГДА
	|			""""
	|		ИНАЧЕ
	|			СкладскойЖурналВЕТИС.Продукция.Код
	|	КОНЕЦ КАК КодПродукции,
	|	ВЫБОР
	|		КОГДА СкладскойЖурналВЕТИС.Продукция.НеЗарегистрирована ТОГДА
	|			""""
	|		ИНАЧЕ
	|			СкладскойЖурналВЕТИС.Продукция.ИдентификаторЗаписи
	|	КОНЕЦ КАК ИдентификаторПродукции,
	|	СкладскойЖурналВЕТИС.НаименованиеПродукции КАК ПродукцияСтрокой,
	|	СкладскойЖурналВЕТИС.ВидПродукции.Родитель.Код КАК Продукция,
	|	СкладскойЖурналВЕТИС.ВидПродукции.ТипПродукции.Код КАК ТипПродукции,
	|	СкладскойЖурналВЕТИС.ВидПродукции.Код КАК ВидПродукции,
	|	СкладскойЖурналВЕТИС.ДатаВыработки,
	|	СкладскойЖурналВЕТИС.ДатаВыработкиПо,
	|	СкладскойЖурналВЕТИС.СрокГодности,
	|	СкладскойЖурналВЕТИС.СрокГодностиПо,
	|	СкладскойЖурналВЕТИС.СтранаПроисхождения.Код КАК СтранаПроисхождения,
	|	СкладскойЖурналВЕТИС.СтранаПроисхождения.Наименование КАК СтранаПроисхожденияНаименование,
	|	СкладскойЖурналВЕТИС.Скоропортящаяся,
	|	СкладскойЖурналВЕТИС.Некачественный,
	|	СкладскойЖурналВЕТИС.ПродукцияОригинал,
	//|	СкладскойЖурналВЕТИС.РольПроизводителя,
	|	СкладскойЖурналВЕТИС.Количество КАК КоличествоНаСкладе,
	//|	СкладскойЖурналВЕТИС.КоличествоУпаковок КАК КоличествоУпаковокНаСкладе
	|	СвойстваЗаписейСкладскогоЖурнала.Производители.(
	|		Производитель.Код КАК Производитель,
	|		Производитель.Наименование КАК ПроизводительНаименование,
	|		РольПроизводителя
	|	),
	|	СвойстваЗаписейСкладскогоЖурнала.ПроизводственныеПартии.(
	|		ИдентификаторПартии
	|	),
	|	СвойстваЗаписейСкладскогоЖурнала.Упаковки.(
	|		УровеньУпаковки,
	|		Упаковка.Код КАК Упаковка,
	|		КоличествоУпаковок
	|	)
	|ИЗ
	|	Документ.МеркурийСписание.Партии КАК МеркурийСписание
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СкладскойЖурналВЕТИС КАК СкладскойЖурналВЕТИС
	|ПО
	|	МеркурийСписание.ИдентификаторПартии = СкладскойЖурналВЕТИС.Идентификатор
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.МеркурийСвойстваЗаписейСкладскогоЖурнала КАК СвойстваЗаписейСкладскогоЖурнала
	|ПО
	|	СкладскойЖурналВЕТИС.Идентификатор = СвойстваЗаписейСкладскогоЖурнала.Код
	|ГДЕ
	|	МеркурийСписание.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	МеркурийСписание.НомерСтроки
	|;
	|
	|ВЫБРАТЬ
	|	Упаковки.ИдентификаторСтроки,
	|	Упаковки.КоличествоУпаковок,
	|	Упаковки.Маркировка,
	|	Упаковки.ТипМаркировки КАК ТипМаркировки,
	|	Упаковки.Упаковка.Код КАК Упаковка,
	|	Упаковки.УровеньУпаковки КАК УровеньУпаковки
	|ИЗ
	|	Документ.МеркурийСписание.Упаковки КАК Упаковки
	|ГДЕ
	|	Упаковки.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДляВыгрузки.Объект);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	Выборка       = ПакетЗапросов[0].Выбрать();
	ВыборкаПартии = ПакетЗапросов[1].Выбрать();
	Упаковки      = ПакетЗапросов[2].Выгрузить();
	
	Выборка.Следующий();
	
	enterprise = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "enterprise");
	enterprise.guid = Выборка.Предприятие;
	
	responsible = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "responsible");
	МеркурийЛогин = ПолучитьЛогинПользователя(ДанныеДляВыгрузки.ХозяйствующийСубъект, Выборка.Ответственный);
	responsible.login = МеркурийЛогин;
	
	discrepancyReport = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "discrepancyReport");
	
	//ОбъектЗапроса.businessEntity = businessEntity; // Хозяйствующий субъект, на площадке которого осуществляется инвентаризация .
	ОбъектЗапроса.enterprise     = enterprise; // Площадка на которой осуществляется инвентаризация . Указывается из списка мест осуществления деятельности для хозяйствующего субъекта.
	ОбъектЗапроса.inventoryDate  = Выборка.Дата; // Дата проведения инвентаризации.
	ОбъектЗапроса.responsible    = responsible; // Ответственный за инвентаризацию. Указывается пользователь из списка пользователей для хозяйствующего субъекта - заявителя.
	//ОбъектЗапроса.stockDiscrepancy // Сведения о результате инвентаризации (по одному факту расхождения).
	ОбъектЗапроса.discrepancyReport.Добавить(discrepancyReport); // Сведения об акте несоответствия.
	
//	Маркировка = Выборка.Маркировка.Выгрузить();
	
	stockDiscrepancy = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "stockDiscrepancy");
	
	resultingList = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, stockDiscrepancy, "resultingList");
	
	resultingList.count  = ВыборкаПартии.Количество();
	resultingList.total  = ВыборкаПартии.Количество();
	resultingList.offset = 0;
	
	Пока ВыборкаПартии.Следующий() Цикл
		
		stockEntry = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, resultingList.stockEntry);
		stockEntry.UUID = ВыборкаПартии.ИдентификаторЗаписи;
		batch = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, stockEntry, "batch");
		
		owner = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "owner");

		owner.guid = Выборка.ХозяйствующийСубъект;
		
		product = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "product");
		product.guid = ВыборкаПартии.Продукция;
		
		productItem = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "productItem");
		Если ЗначениеЗаполнено(ВыборкаПартии.КодПродукции) Тогда
			productItem.guid = ВыборкаПартии.КодПродукции;
			productItem.name = ВыборкаПартии.НаименованиеПродукции;
			productItem.uuid = ВыборкаПартии.ИдентификаторПродукции;
		Иначе
			productItem.name = ВыборкаПартии.ПродукцияСтрокой;
		КонецЕсли;
		
		subProduct = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "subProduct");
		subProduct.guid = ВыборкаПартии.ВидПродукции;
		
		Если ЗначениеЗаполнено(ВыборкаПартии.ЕдиницаИзмерения) Тогда
			unit = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "unit");
			unit.guid = ВыборкаПартии.ЕдиницаИзмерения;
			batch.unit = unit;
		КонецЕсли;
		
		ПроизводственныеПартии = ВыборкаПартии.ПроизводственныеПартии.Выбрать();
		Пока ПроизводственныеПартии.Следующий() Цикл
			batch.batchID.Добавить(ПроизводственныеПартии.ИдентификаторПартии);
		КонецЦикла;
		
		ВыборкаПроизводители = ВыборкаПартии.Производители.Выбрать();
		Если ВыборкаПроизводители.Количество()>0 Тогда
			// Сведения от производителя.
			origin = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "origin");
			
			// Продукция производителя оригинал.
			Если ЗначениеЗаполнено(ВыборкаПартии.ПродукцияОригинал) Тогда
				productItem = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, origin, "productItem");
				productItem.guid = ВыборкаПартии.ПродукцияОригинал;
				origin.productItem = productItem;
			КонецЕсли;
			
			// Продукция производителя оригинал.
			Если ЗначениеЗаполнено(ВыборкаПартии.СтранаПроисхождения) Тогда
				country = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, origin, "country");
				country.guid = ВыборкаПартии.СтранаПроисхождения;
				country.name = ВыборкаПартии.СтранаПроисхожденияНаименование;
				origin.country = country;
			КонецЕсли;
			
			Пока ВыборкаПроизводители.Следующий() Цикл
				producer = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, origin, "producer");
				
				// Предприятие-производитель
				Если ЗначениеЗаполнено(ВыборкаПроизводители.Производитель) Тогда
					Enterprise = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, producer, "enterprise");
					Enterprise.guid = ВыборкаПроизводители.Производитель;
					Enterprise.name = ВыборкаПроизводители.ПроизводительНаименование;
					producer.enterprise = Enterprise;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаПроизводители.РольПроизводителя) Тогда
					producer.role = Перечисления.РолиПроизводителяВЕТИС.ПолучитьЗначениеВЕТИС(ВыборкаПроизводители.РольПроизводителя);
				КонецЕсли;
				
				origin.producer.Добавить(producer);
			КонецЦикла;
			
			batch.origin = origin;
		КонецЕсли;
		
		expiryDate = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "expiryDate");
		
		СрокГодностиПо = ?(ВыборкаПартии.СрокГодности = ВыборкаПартии.СрокГодностиПо, Дата(1,1,1), ВыборкаПартии.СрокГодностиПо);
		
		ЗаполнитьПериодXDTO(ВнутренняяФабрикаXDTO, expiryDate, ВыборкаПартии.СрокГодности, СрокГодностиПо);
		
		dateOfProduction = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "dateOfProduction");
		
		ЗаполнитьПериодXDTO(ВнутренняяФабрикаXDTO, dateOfProduction, ВыборкаПартии.ДатаВыработки, ВыборкаПартии.ДатаВыработкиПо);
		
		batch.dateOfProduction = dateOfProduction;
		batch.expiryDate       = expiryDate;
		batch.lowGradeCargo    = ВыборкаПартии.Некачественный;
		
		УпаковкиПартии = Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаПартии.ИдентификаторПартии));
		Если УпаковкиПартии.Количество()>0 Тогда
			
			УпаковкиПоЖурналу = ВыборкаПартии.Упаковки.Выбрать();
			Пока УпаковкиПоЖурналу.Следующий() Цикл
				
				Для Каждого ТекущаяСтрокаУпаковки Из УпаковкиПартии Цикл
					Если ТекущаяСтрокаУпаковки.УровеньУпаковки = УпаковкиПоЖурналу.УровеньУпаковки И ТекущаяСтрокаУпаковки.Упаковка = УпаковкиПоЖурналу.Упаковка Тогда
						КоличествоУпаковок = Мин(ТекущаяСтрокаУпаковки.КоличествоУпаковок, УпаковкиПоЖурналу.КоличествоУпаковок);
						ТекущаяСтрокаУпаковки.КоличествоУпаковок = УпаковкиПоЖурналу.КоличествоУпаковок-КоличествоУпаковок;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			
			batch.packageList = ПолучитьУпаковкиПартииXDTO(ВнутренняяФабрикаXDTO, УпаковкиПартии, batch);
		КонецЕсли;
		
		Количество = Мин(ВыборкаПартии.Количество, ВыборкаПартии.КоличествоНаСкладе);
		Количество = ВыборкаПартии.КоличествоНаСкладе-Количество;
		
		batch.perishable   = ВыборкаПартии.Скоропортящаяся;
		//batch.producerList = producerList;
		batch.product      = product;
		batch.productItem  = productItem;
		//batch.productMarkingList = productMarkingList;
		batch.productType  = ВыборкаПартии.ТипПродукции;
		//productionOperationId
		batch.subProduct   = subProduct;
		batch.volume       = Количество;
		batch.owner        = owner;
		
		stockEntry.batch = batch;
		
		resultingList.stockEntry.Добавить(stockEntry);
		
	КонецЦикла;
	
	stockDiscrepancy.resultingList = resultingList;
	
	ОбъектЗапроса.stockDiscrepancy.Добавить(stockDiscrepancy);
	
КонецПроцедуры

Процедура ЗаполнитьЗапросГашенияВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МеркурийЗаявкаСОдинаковойВСД.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ
	|	ИдентификаторыСтрок
	|ИЗ
	|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК МеркурийЗаявкаВСД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК МеркурийЗаявкаСОдинаковойВСД
	|ПО
	|	МеркурийЗаявкаСОдинаковойВСД.Ссылка = &Ссылка И 
	|	МеркурийЗаявкаВСД.ВСД = МеркурийЗаявкаСОдинаковойВСД.ВСД
	|ГДЕ
	|	МеркурийЗаявкаВСД.Ссылка = &Ссылка И 
	|	МеркурийЗаявкаВСД.ИдентификаторСтроки = &ИдентификаторСтроки
	|;
	|
	|ВЫБРАТЬ
	|	МеркурийЗаявкаВСД.Ссылка.Отправитель.Код КАК Отправитель,
	|	МеркурийЗаявкаВСД.Ссылка.ПредприятиеОтправитель.Код КАК ПредприятиеОтправитель,
	|	МеркурийЗаявкаВСД.Ссылка.Получатель.Код КАК Получатель,
	|	МеркурийЗаявкаВСД.Ссылка.ПредприятиеПолучатель.Код КАК ПредприятиеПолучатель,
	|	МеркурийЗаявкаВСД.Ссылка.СерияТТН КАК СерияТТН,
	|	МеркурийЗаявкаВСД.Ссылка.НомерТТН КАК НомерТТН,
	|	МеркурийЗаявкаВСД.Ссылка.ДатаТТН КАК ДатаТТН,
	|	МеркурийЗаявкаВСД.Ссылка.ТипТТН КАК ТипТТН,
	|	МеркурийЗаявкаВСД.Ссылка.Посредник.Код КАК Посредник,
	|	МеркурийЗаявкаВСД.Ссылка.ТранспортноеСредство.ТипТС КАК ТипТС,
	|	МеркурийЗаявкаВСД.Ссылка.ТранспортноеСредство.НомерТС КАК НомерТС,
	|	МеркурийЗаявкаВСД.Ссылка.НомерКонтейнера КАК НомерКонтейнера,
	|	МеркурийЗаявкаВСД.Ссылка.Прицеп.НомерТС КАК НомерПрицепа,
	|	МеркурийЗаявкаВСД.ВСД.СпособХранения КАК СпособХранения,
	//|	МеркурийЗаявкаВСД.ВСД.ПродукцияОригинал.Код КАК КодПродукцииОригинал,
	//|	МеркурийЗаявкаВСД.ВСД.Продукция.Код КАК КодПродукции,
	//|	МеркурийЗаявкаВСД.ВСД.Продукция.ИдентификаторЗаписи КАК ИдентификаторПродукции,
	|	ВЫБОР
	|		КОГДА МеркурийЗаявкаВСД.ВСД.Продукция.НеЗарегистрирована ТОГДА
	|			""""
	|		ИНАЧЕ
	|			МеркурийЗаявкаВСД.ВСД.Продукция.Код
	|	КОНЕЦ КАК КодПродукции,
	|	ВЫБОР
	|		КОГДА МеркурийЗаявкаВСД.ВСД.Продукция.НеЗарегистрирована ТОГДА
	|			""""
	|		ИНАЧЕ
	|			МеркурийЗаявкаВСД.ВСД.Продукция.ИдентификаторЗаписи
	|	КОНЕЦ КАК ИдентификаторПродукции,
	|	МеркурийЗаявкаВСД.ВСД.Продукция.Наименование КАК НаименованиеПродукции,
	//|	МеркурийЗаявкаВСД.ВСД.ПродукцияСтрокой КАК НаименованиеПродукции,
	|	МеркурийЗаявкаВСД.ВСД.ВидПродукции.ТипПродукции.Код КАК ТипПродукции,
	|	МеркурийЗаявкаВСД.ВСД.ВидПродукции.Родитель.Код КАК Продукция,
	|	МеркурийЗаявкаВСД.ВСД.ВидПродукции.Код КАК ВидПродукции,
	|	СУММА(ВЫБОР
	|		КОГДА МеркурийЗаявкаВСД.КоэффициентВеса = 0 ТОГДА
	|			МеркурийЗаявкаВСД.КВозврату
	|		ИНАЧЕ
	|			МеркурийЗаявкаВСД.КВозврату*МеркурийЗаявкаВСД.КоэффициентВеса
	|	КОНЕЦ) КАК КВозврату,
	|	СУММА(ВЫБОР
	|		КОГДА МеркурийЗаявкаВСД.Вес = 0 ТОГДА
	|			МеркурийЗаявкаВСД.Количество
	|		ИНАЧЕ
	|			МеркурийЗаявкаВСД.Вес
	|	КОНЕЦ) КАК Количество,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА МеркурийЗаявкаВСД.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмеренияВЕТИС.ПустаяСсылка) ТОГДА
	|			МеркурийЗаявкаВСД.ВСД.ЕдиницаИзмерения.Код
	|		ИНАЧЕ
	|			МеркурийЗаявкаВСД.ЕдиницаИзмерения.Код
	|	КОНЕЦ) КАК ЕдиницаИзмерения,
	//|	МеркурийЗаявкаВСД.ЕдиницаИзмерения.Код КАК ЕдиницаИзмерения,
	|	МеркурийЗаявкаВСД.ВСД.ДатаВыработки КАК ДатаВыработки,
	|	МеркурийЗаявкаВСД.ВСД.ДатаВыработкиПо КАК ДатаВыработкиПо,
	|	МАКСИМУМ(МеркурийЗаявкаВСД.СрокГодности) КАК СрокГодности,
	|	МАКСИМУМ(МеркурийЗаявкаВСД.СрокГодностиПо) КАК СрокГодностиПо,
	|	МеркурийЗаявкаВСД.ВСД.Скоропортящаяся КАК Скоропортящаяся,
	|	МеркурийЗаявкаВСД.ВСД.СтранаПроисхождения.Код КАК СтранаПроисхождения,
	|	МеркурийЗаявкаВСД.ВСД.СтранаПроисхождения.Наименование КАК СтранаПроисхожденияНаименование,
	|	МеркурийЗаявкаВСД.ВСД.Некачественный КАК Некачественный,
	|	МеркурийЗаявкаВСД.ВСД,
	|	МАКСИМУМ(МеркурийЗаявкаВСД.ВСДВозврат) КАК ВСДВозврат,
	|	МАКСИМУМ(МеркурийЗаявкаВСД.НомерАктаНесоответствия) КАК НомерАктаНесоответствия,
	|	МАКСИМУМ(МеркурийЗаявкаВСД.СерияАктаНесоответствия) КАК СерияАктаНесоответствия,
	|	МАКСИМУМ(МеркурийЗаявкаВСД.ДатаАктаНесоответствия) КАК ДатаАктаНесоответствия,
	|	МАКСИМУМ(ВЫРАЗИТЬ(МеркурийЗаявкаВСД.ОписаниеНесоответствия КАК Строка(1000))) КАК ОписаниеНесоответствия,
	|	МАКСИМУМ(МеркурийЗаявкаВСД.ПричинаСоставленияАктаНесоответствия) КАК ПричинаСоставленияАктаНесоответствия,
	|	МАКСИМУМ(МеркурийЗаявкаВСД.ПодтвердилСоответствие) КАК ПодтвердилСоответствие,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ВЫБОР
	|			КОГДА МеркурийЗаявкаВСД.РезультатСоответствия = ЗНАЧЕНИЕ(Перечисление.РезультатыСоответствияВЕТИС.MISMATCH) ТОГДА 1
	|			ИНАЧЕ 0
	|			КОНЕЦ) = 1 ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.РезультатыСоответствияВЕТИС.MISMATCH)
	|		КОГДА МАКСИМУМ(ВЫБОР
	|			КОГДА МеркурийЗаявкаВСД.РезультатСоответствия = ЗНАЧЕНИЕ(Перечисление.РезультатыСоответствияВЕТИС.CORRESPONDS) ТОГДА 1
	|			ИНАЧЕ 0
	|			КОНЕЦ) = 1 ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.РезультатыСоответствияВЕТИС.CORRESPONDS)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.РезультатыСоответствияВЕТИС.UNSUPERVISED)
	|	КОНЕЦ КАК РезультатСоответствия,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ВЫБОР
	|			КОГДА МеркурийЗаявкаВСД.ЗаключениеВетеринара = ЗНАЧЕНИЕ(Перечисление.РезультатыСоответствияВЕТИС.MISMATCH) ТОГДА 1
	|			ИНАЧЕ 0
	|			КОНЕЦ) = 1 ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.РезультатыСоответствияВЕТИС.MISMATCH)
	|		КОГДА МАКСИМУМ(ВЫБОР
	|			КОГДА МеркурийЗаявкаВСД.ЗаключениеВетеринара = ЗНАЧЕНИЕ(Перечисление.РезультатыСоответствияВЕТИС.CORRESPONDS) ТОГДА 1
	|			ИНАЧЕ 0
	|			КОНЕЦ) = 1 ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.РезультатыСоответствияВЕТИС.CORRESPONDS)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.РезультатыСоответствияВЕТИС.UNSUPERVISED)
	|	КОНЕЦ КАК ЗаключениеВетеринара,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ВЫБОР
	|			КОГДА МеркурийЗаявкаВСД.РешениеПринятияПартии = ЗНАЧЕНИЕ(Перечисление.РешенияПринятияПартииВЕТИС.RETURN_ALL) ТОГДА 1
	|			ИНАЧЕ 0
	|			КОНЕЦ) = 1 ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.РешенияПринятияПартииВЕТИС.RETURN_ALL)
	|		КОГДА МАКСИМУМ(ВЫБОР
	|			КОГДА МеркурийЗаявкаВСД.РешениеПринятияПартии = ЗНАЧЕНИЕ(Перечисление.РешенияПринятияПартииВЕТИС.PARTIALLY) ТОГДА 1
	|			ИНАЧЕ 0
	|			КОНЕЦ) = 1 ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.РешенияПринятияПартииВЕТИС.PARTIALLY)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.РешенияПринятияПартииВЕТИС.ACCEPT_ALL)
	|	КОНЕЦ КАК РешениеПринятияПартии,
	|	МАКСИМУМ(МеркурийЗаявкаВСД.ПроверяющийВетеринар) КАК ПроверяющийВетеринар
	|ИЗ
	|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК МеркурийЗаявкаВСД
	|ГДЕ
	|	МеркурийЗаявкаВСД.Ссылка = &Ссылка И 
	|	МеркурийЗаявкаВСД.ИдентификаторСтроки В (ВЫБРАТЬ ИдентификаторСтроки ИЗ ИдентификаторыСтрок)
	|СГРУППИРОВАТЬ ПО
	|	МеркурийЗаявкаВСД.Ссылка,
	|	МеркурийЗаявкаВСД.ВСД.Продукция,
	|	МеркурийЗаявкаВСД.ВСД.ВидПродукции,
	|	МеркурийЗаявкаВСД.ВСД
	|;
	|
	|ВЫБРАТЬ
	|	МеркурийЗаявкаВСД.Упаковка.Код КАК Упаковка,
	|	МеркурийЗаявкаВСД.КоличествоУпаковок,
	|	МеркурийЗаявкаВСД.КВозврату,
	|	МеркурийЗаявкаВСД.УровеньУпаковки,
	|	МеркурийЗаявкаВСД.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	Документ.ГашениеВходящихВСДВЕТИС.Упаковки КАК МеркурийЗаявкаВСД
	|ГДЕ
	|	МеркурийЗаявкаВСД.Ссылка = &Ссылка И 
	|	МеркурийЗаявкаВСД.ИдентификаторСтрокиТовары = &ИдентификаторСтроки
	|;
	|
	|ВЫБРАТЬ
	|	МеркурийЗаявкаВСДМаркировка.Маркировка,
	|	МеркурийЗаявкаВСДМаркировка.ТипМаркировки,
	|	МеркурийЗаявкаВСДМаркировка.ИдентификаторСтроки
	|ИЗ
	|	Документ.ГашениеВходящихВСДВЕТИС.Упаковки КАК МеркурийЗаявкаВСД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ГашениеВходящихВСДВЕТИС.Маркировка КАК МеркурийЗаявкаВСДМаркировка
	|ПО
	|	МеркурийЗаявкаВСД.Ссылка = МеркурийЗаявкаВСДМаркировка.Ссылка И 
	|	МеркурийЗаявкаВСД.ИдентификаторСтроки = МеркурийЗаявкаВСДМаркировка.ИдентификаторСтроки И 
	|	МеркурийЗаявкаВСД.ИдентификаторСтрокиТовары = &ИдентификаторСтроки И 
	|	МеркурийЗаявкаВСДМаркировка.ИдентификаторСтрокиТовары = &ИдентификаторСтроки
	|ГДЕ
	|	МеркурийЗаявкаВСД.Ссылка = &Ссылка И 
	|	МеркурийЗаявкаВСД.ИдентификаторСтрокиТовары = &ИдентификаторСтроки И 
	|	МеркурийЗаявкаВСДМаркировка.ИдентификаторСтрокиТовары = &ИдентификаторСтроки
	|;
	|
	|ВЫБРАТЬ
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.НазваниеПункта,
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.ТранспортноеСредство.ТипТС КАК ТипТС,
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.ТранспортноеСредство.НомерТС КАК НомерТС,
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.Прицеп.НомерТС КАК НомерПрицепа,
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.НомерКонтейнера
	|ИЗ
	|	Документ.ГашениеВходящихВСДВЕТИС.ПунктыПерегрузки КАК ГашениеВходящихВСДВЕТИСПунктыПерегрузки
	|ГДЕ
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.Ссылка = &Ссылка И 
	|	(НЕ ГашениеВходящихВСДВЕТИСПунктыПерегрузки.ТранспортноеСредство = ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка))
	|";
	
	Запрос.УстановитьПараметр("Ссылка",              ДанныеДляВыгрузки.Объект);
	Запрос.УстановитьПараметр("ИдентификаторСтроки", ДанныеДляВыгрузки.ИдентификаторСтроки);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	Выборка          = ПакетЗапросов[1].Выбрать();
	Упаковки         = ПакетЗапросов[2].Выгрузить();
	Маркировка       = ПакетЗапросов[3].Выгрузить();
	ПунктыПерегрузки = ПакетЗапросов[4].Выгрузить();
	
	Выборка.Следующий();
	
	delivery = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "delivery");
	
	accompanyingForms = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "accompanyingForms");
	
	Если ЗначениеЗаполнено(Выборка.ТипТТН) Тогда
		waybill = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, accompanyingForms, "waybill");
		waybill.issueDate   = Выборка.ДатаТТН;
		waybill.issueNumber = Выборка.НомерТТН;
		Если ЗначениеЗаполнено(Выборка.СерияТТН) Тогда
			waybill.issueSeries = Выборка.СерияТТН;
		КонецЕсли;
		waybill.type        = Перечисления.ТипыДокументовВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.ТипТТН);
		
		accompanyingForms.waybill = waybill;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.СпособХранения) Тогда
		delivery.transportStorageType = Перечисления.СпособыХраненияВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.СпособХранения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Посредник) Тогда
		// Получатель
		broker = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "broker");
		broker.guid = Выборка.Посредник;
		delivery.broker = broker;
	КонецЕсли;
	
	АвтомобильПоФакту = Новый Структура;
	АвтомобильПоФакту.Вставить("ТипТС",           Выборка.ТипТС);
	АвтомобильПоФакту.Вставить("НомерТС",         Выборка.НомерТС);
	АвтомобильПоФакту.Вставить("НомерПрицепа",    Выборка.НомерПрицепа);
	АвтомобильПоФакту.Вставить("НомерКонтейнера", Выборка.НомерКонтейнера);
	
	Если ПунктыПерегрузки.Количество() > 0 Тогда
		Для Каждого ТекущийПунктПерегрузки ИЗ ПунктыПерегрузки Цикл
			ЗаполнитьЗначенияСвойств(АвтомобильПоФакту, ТекущийПунктПерегрузки);
		КонецЦикла;
	КонецЕсли;
	
	transportInfo = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "transportInfo");
	
	ЗаполнитьИнформациюПоТранспорту(ВнутренняяФабрикаXDTO, transportInfo, АвтомобильПоФакту);
	delivery.transportInfo = transportInfo;
	
	ЭлектронныйВСД = Ложь;
	КВозврату      = 0;
	
	Если (НЕ Выборка.РешениеПринятияПартии = Перечисления.РешенияПринятияПартииВЕТИС.RETURN_ALL) И Выборка.Количество > 0 Тогда
		consignment = ПолучитьЭлементConsignment(ВнутренняяФабрикаXDTO, Выборка, delivery.consignment, Упаковки, Маркировка);
		delivery.consignment.Добавить(consignment);
	КонецЕсли;
	
	Если Выборка.РешениеПринятияПартии = Перечисления.РешенияПринятияПартииВЕТИС.PARTIALLY Тогда
		КВозврату = Выборка.КВозврату;
	ИначеЕсли Выборка.РешениеПринятияПартии = Перечисления.РешенияПринятияПартииВЕТИС.RETURN_ALL Тогда
		КВозврату = Выборка.Количество+Выборка.КВозврату;
	КонецЕсли;
	
	vetCertificate = ПолучитьВетСертификат(ВнутренняяФабрикаXDTO, Выборка.ВСД, accompanyingForms.vetCertificate);
	accompanyingForms.vetCertificate.Добавить(vetCertificate);
	
	ЭлектронныйВСД = (НЕ ПустаяСтрока(Выборка.ВСД.Идентификатор));
	
	// Получатель
	consignee = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "consignee");
	ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, consignee, Выборка.Получатель, Выборка.ПредприятиеПолучатель);
	
	// Отправитель
	consignor = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "consignor");
	ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, consignor, Выборка.Отправитель, Выборка.ПредприятиеОтправитель);
	
	delivery.accompanyingForms = accompanyingForms;
	delivery.consignee    = consignee;
	delivery.consignor    = consignor;
	delivery.deliveryDate = ТекущаяДата();
	
	ОбъектЗапроса.delivery = delivery;
	
	//Объект содержит обобщенные сведения о результате приема партии продукции или группы животных.
	deliveryFacts = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "deliveryFacts");
	//Принятое решение о приёме входной партии.
	deliveryFacts.decision = Перечисления.РешенияПринятияПартииВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.РешениеПринятияПартии);
	
	// Природа ВСД (электронный или бумажный).
	Если ЭлектронныйВСД Тогда
		deliveryFacts.vetCertificatePresence = "ELECTRONIC";
	Иначе
		deliveryFacts.vetCertificatePresence = "PAPER";
	КонецЕсли;
	
	//Объект содержит сведения о соответствии фактических сведений о партии тем, что указано в ВСД.
	docInspection  = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, deliveryFacts, "docInspection");
	
	docresponsible = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, docInspection, "responsible");
	Если НЕ Выборка.РезультатСоответствия = Перечисления.РезультатыСоответствияВЕТИС.UNSUPERVISED И ЗначениеЗаполнено(Выборка.ПодтвердилСоответствие) Тогда
		docresponsible.login = ПолучитьЛогинПользователя(ДанныеДляВыгрузки.ХозяйствующийСубъект, Выборка.ПодтвердилСоответствие);
		//docresponsible.login = Выборка.ПодтвердилСоответствие.Логин;
	КонецЕсли;
	//ДанныеДляВыгрузки
	docInspection.responsible = docresponsible;
	docInspection.result = Перечисления.РезультатыСоответствияВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.РезультатСоответствия);
	
	deliveryFacts.docInspection = docInspection;
	
	//Объект содержит сведения о ветеринарном контроле входящей партии гос. ветврачом.
	vetInspection = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, deliveryFacts, "vetInspection");
	vetresponsible = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, vetInspection, "responsible");
	Если НЕ Выборка.ЗаключениеВетеринара = Перечисления.РезультатыСоответствияВЕТИС.UNSUPERVISED И ЗначениеЗаполнено(Выборка.ПроверяющийВетеринар) Тогда
		vetresponsible.login = ПолучитьЛогинПользователя(ДанныеДляВыгрузки.ХозяйствующийСубъект, Выборка.ПроверяющийВетеринар);
		//vetresponsible.login = Выборка.ПроверяющийВетеринар.Логин;
	КонецЕсли;
	vetInspection.responsible = vetresponsible;
	vetInspection.result = Перечисления.РезультатыСоответствияВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.ЗаключениеВетеринара);
	
	deliveryFacts.vetInspection = vetInspection;
	
	ОбъектЗапроса.deliveryFacts  = deliveryFacts;
	
	Если Выборка.РезультатСоответствия = Перечисления.РезультатыСоответствияВЕТИС.MISMATCH Тогда
		
		discrepancyReport = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "discrepancyReport");
		
		//Если НЕ Выборка.ЭлектронныйВСД Тогда
		discrepancyReport.issueSeries = Выборка.СерияАктаНесоответствия;
		discrepancyReport.issueNumber = Выборка.НомерАктаНесоответствия;
		//КонецЕсли;
		discrepancyReport.issueDate   = Выборка.ДатаАктаНесоответствия;
		discrepancyReport.description = Выборка.ОписаниеНесоответствия;
		
		reason = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, discrepancyReport, "reason");
		reason.name = Выборка.ПричинаСоставленияАктаНесоответствия;
		discrepancyReport.reason      = reason;
		
		ОбъектЗапроса.discrepancyReport.Добавить(discrepancyReport);
		
	КонецЕсли;
	
	Если КВозврату = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МеркурийЗаявкаСОдинаковойВСД.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ
	|	ИдентификаторыСтрок
	|ИЗ
	|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК МеркурийЗаявкаВСД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК МеркурийЗаявкаСОдинаковойВСД
	|ПО
	|	МеркурийЗаявкаСОдинаковойВСД.Ссылка = &Ссылка И 
	|	МеркурийЗаявкаВСД.ВСД = МеркурийЗаявкаСОдинаковойВСД.ВСД
	|ГДЕ
	|	МеркурийЗаявкаВСД.Ссылка = &Ссылка И 
	|	МеркурийЗаявкаВСД.ИдентификаторСтроки = &ИдентификаторСтроки
	|;
	|
	|ВЫБРАТЬ
	|	МеркурийЗаявкаВСД.Ссылка.Отправитель.Код КАК Получатель,
	|	МеркурийЗаявкаВСД.Ссылка.ПредприятиеОтправитель.Код КАК ПредприятиеПолучатель,
	|	МеркурийЗаявкаВСД.Ссылка.Получатель.Код КАК Отправитель,
	|	МеркурийЗаявкаВСД.Ссылка.ПредприятиеПолучатель.Код КАК ПредприятиеОтправитель,
	|	МеркурийЗаявкаВСД.Ссылка.ТипТТНВозврат КАК ТипТТН,
	|	МеркурийЗаявкаВСД.Ссылка.СерияТТНВозврат КАК СерияТТН,
	|	МеркурийЗаявкаВСД.Ссылка.НомерТТНВозврат КАК НомерТТН,
	|	МеркурийЗаявкаВСД.Ссылка.ДатаТТНВозврат КАК ДатаТТН,
	|	МеркурийЗаявкаВСД.Ссылка.ПосредникВозврат.Код КАК Посредник,
	|	МеркурийЗаявкаВСД.Ссылка.ТранспортноеСредствоВозврат.ТипТС КАК ТипТС,
	|	МеркурийЗаявкаВСД.Ссылка.ТранспортноеСредствоВозврат.НомерТС КАК НомерТС,
	|	МеркурийЗаявкаВСД.Ссылка.НомерКонтейнераВозврат КАК НомерКонтейнера,
	|	МеркурийЗаявкаВСД.Ссылка.ПрицепВозврат.НомерТС КАК НомерПрицепа,
	|	ВЫБОР
	|		КОГДА МеркурийЗаявкаВСД.Ссылка.СпособХраненияВозврат = ЗНАЧЕНИЕ(Перечисление.СпособыХраненияВЕТИС.ПустаяСсылка) ТОГДА
	|			МеркурийЗаявкаВСД.ВСД.СпособХранения
	|		ИНАЧЕ
	|			МеркурийЗаявкаВСД.Ссылка.СпособХраненияВозврат
	|	КОНЕЦ КАК СпособХранения,
	|	ЛОЖЬ КАК ЭлектронныйВСД,
	|	ВЫРАЗИТЬ(МеркурийЗаявкаВСД.ВСД.ОсобыеОтметки КАК Строка(1000)) КАК ОсобыеОтметки,
	|	МеркурийЗаявкаВСД.ВСД.ФИОВетВрачаОтправителя КАК ФИОВетВрачаОтправителя,
	|	МеркурийЗаявкаВСД.ВСД.ДолжностьВетВрачаОтправителя КАК ДолжностьВетВрачаОтправителя,
	//|	МеркурийЗаявкаВСД.ВСД.ПродукцияОригинал.Код КАК КодПродукцииОригинал,
	//|	МеркурийЗаявкаВСД.Продукция.Код КАК КодПродукции,
	//|	МеркурийЗаявкаВСД.Продукция.ИдентификаторЗаписи КАК ИдентификаторПродукции,
	//|	МеркурийЗаявкаВСД.ВСД.Продукция.Код КАК КодПродукции,
	//|	МеркурийЗаявкаВСД.ВСД.Продукция.ИдентификаторЗаписи КАК ИдентификаторПродукции,
	|	ВЫБОР
	|		КОГДА МеркурийЗаявкаВСД.ВСД.Продукция.НеЗарегистрирована ТОГДА
	|			""""
	|		ИНАЧЕ
	|			МеркурийЗаявкаВСД.ВСД.Продукция.Код
	|	КОНЕЦ КАК КодПродукции,
	|	ВЫБОР
	|		КОГДА МеркурийЗаявкаВСД.ВСД.Продукция.НеЗарегистрирована ТОГДА
	|			""""
	|		ИНАЧЕ
	|			МеркурийЗаявкаВСД.ВСД.Продукция.ИдентификаторЗаписи
	|	КОНЕЦ КАК ИдентификаторПродукции,
	|	МеркурийЗаявкаВСД.ВСД.Продукция.Наименование КАК НаименованиеПродукции,
	|	МеркурийЗаявкаВСД.ВСД.ВидПродукции.ТипПродукции.Код КАК ТипПродукции,
	|	МеркурийЗаявкаВСД.ВСД.ВидПродукции.Родитель.Код КАК Продукция,
	|	МеркурийЗаявкаВСД.ВСД.ВидПродукции.Код КАК ВидПродукции,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА МеркурийЗаявкаВСД.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмеренияВЕТИС.ПустаяСсылка) ТОГДА
	|			МеркурийЗаявкаВСД.ВСД.ЕдиницаИзмерения.Код
	|		ИНАЧЕ
	|			МеркурийЗаявкаВСД.ЕдиницаИзмерения.Код
	|	КОНЕЦ) КАК ЕдиницаИзмерения,
	|	МеркурийЗаявкаВСД.ВСД.ДатаВыработки КАК ДатаВыработки,
	|	МеркурийЗаявкаВСД.ВСД.ДатаВыработкиПо КАК ДатаВыработкиПо,
	|	МАКСИМУМ(МеркурийЗаявкаВСД.СрокГодности) КАК СрокГодности,
	|	МАКСИМУМ(МеркурийЗаявкаВСД.СрокГодностиПо) КАК СрокГодностиПо,
	|	МеркурийЗаявкаВСД.ВСД.Скоропортящаяся КАК Скоропортящаяся,
	|	МеркурийЗаявкаВСД.ВСД.СтранаПроисхождения.Код КАК СтранаПроисхождения,
	|	МеркурийЗаявкаВСД.ВСД.СтранаПроисхождения.Наименование КАК СтранаПроисхожденияНаименование,
	|	МеркурийЗаявкаВСД.ВСД.Некачественный КАК Некачественный,
	|	МеркурийЗаявкаВСД.ВСД,
	|	МеркурийЗаявкаВСД.ВСДВозврат
	|ИЗ
	|	Документ.ГашениеВходящихВСДВЕТИС.Товары КАК МеркурийЗаявкаВСД
	|ГДЕ
	|	МеркурийЗаявкаВСД.Ссылка = &Ссылка И 
	|	МеркурийЗаявкаВСД.ИдентификаторСтроки В (ВЫБРАТЬ ИдентификаторСтроки ИЗ ИдентификаторыСтрок)
	|СГРУППИРОВАТЬ ПО
	|	МеркурийЗаявкаВСД.Ссылка,
	|	МеркурийЗаявкаВСД.ВСД.Продукция,
	|	МеркурийЗаявкаВСД.ВСД.ВидПродукции,
	|	МеркурийЗаявкаВСД.ВСД,
	|	МеркурийЗаявкаВСД.ВСДВозврат
	|;
	|
	|ВЫБРАТЬ
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.НомерСтроки,
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.НазваниеПункта,
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.ТранспортноеСредство.ТипТС КАК ТипТС,
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.ТранспортноеСредство.НомерТС КАК НомерТС,
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.Прицеп.НомерТС КАК НомерПрицепа,
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.НомерКонтейнера,
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.Страна.Код КАК Страна,
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.Регион.Код КАК Регион,
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.СПерегрузкой,
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.Предприятие.Код КАК Предприятие
	|ИЗ
	|	Документ.ГашениеВходящихВСДВЕТИС.ПунктыПерегрузкиВозврат КАК ГашениеВходящихВСДВЕТИСПунктыПерегрузки
	|ГДЕ
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	ГашениеВходящихВСДВЕТИСПунктыПерегрузки.НомерСтроки УБЫВ
	|;
	|
	|ВЫБРАТЬ
	|	ГашениеВходящихВСДВЕТИССвязанныеДокументы.НомерСтроки,
	|	ГашениеВходящихВСДВЕТИССвязанныеДокументы.Дата,
	|	ГашениеВходящихВСДВЕТИССвязанныеДокументы.Номер,
	|	ГашениеВходящихВСДВЕТИССвязанныеДокументы.Серия,
	|	ГашениеВходящихВСДВЕТИССвязанныеДокументы.ТипДокумента,
	|	ГашениеВходящихВСДВЕТИССвязанныеДокументы.ТипСвязи
	|ИЗ
	|	Документ.ГашениеВходящихВСДВЕТИС.СвязанныеДокументыВозврат КАК ГашениеВходящихВСДВЕТИССвязанныеДокументы
	|ГДЕ
	|	ГашениеВходящихВСДВЕТИССвязанныеДокументы.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	ГашениеВходящихВСДВЕТИСУсловияПеремещенияПродукции.УсловиеПеремещения.Код КАК УсловиеПеремещения
	|ИЗ
	|	Документ.ГашениеВходящихВСДВЕТИС.УсловияПеремещенияПродукцииВозврат КАК ГашениеВходящихВСДВЕТИСУсловияПеремещенияПродукции
	|ГДЕ
	|	ГашениеВходящихВСДВЕТИСУсловияПеремещенияПродукции.Ссылка = &Ссылка И 
	|	ГашениеВходящихВСДВЕТИСУсловияПеремещенияПродукции.ВыполняетсяУсловие = Истина
	|;
	|
	|ВЫБРАТЬ
	|	МеркурийЗаявкаВСД.Упаковка.Код КАК Упаковка,
	|	МеркурийЗаявкаВСД.КВозврату КАК КоличествоУпаковок,
	|	МеркурийЗаявкаВСД.УровеньУпаковки,
	|	МеркурийЗаявкаВСД.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	Документ.ГашениеВходящихВСДВЕТИС.Упаковки КАК МеркурийЗаявкаВСД
	|ГДЕ
	|	МеркурийЗаявкаВСД.Ссылка = &Ссылка И 
	|	МеркурийЗаявкаВСД.ИдентификаторСтрокиТовары = &ИдентификаторСтроки
	|";
	
	Запрос.УстановитьПараметр("Ссылка",              ДанныеДляВыгрузки.Объект);
	Запрос.УстановитьПараметр("ИдентификаторСтроки", ДанныеДляВыгрузки.ИдентификаторСтроки);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	Выборка            = ПакетЗапросов[1].Выбрать();
	ПунктыПерегрузки   = ПакетЗапросов[2].Выгрузить();
	СвязанныеДокументы = ПакетЗапросов[3].Выгрузить();
	УсловиеПеремещения = ПакетЗапросов[4].Выгрузить();
	Упаковки           = ПакетЗапросов[5].Выгрузить();
	
	Выборка.Следующий();
	
	returnedDelivery = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "returnedDelivery");
	returnedDelivery.deliveryDate = Выборка.ДатаТТН;
	
	// Получатель
	consignee = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, returnedDelivery, "consignee");
	ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, consignee, Выборка.Получатель, Выборка.ПредприятиеПолучатель);
	
	// Отправитель
	consignor = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, returnedDelivery, "consignor");
	ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, consignor, Выборка.Отправитель, Выборка.ПредприятиеОтправитель);
	
	returnedDelivery.consignee    = consignee;
	returnedDelivery.consignor    = consignor;
	returnedDelivery.deliveryDate = ТекущаяДата();
	
	accompanyingForms = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, returnedDelivery, "accompanyingForms");
	
	Для каждого СвязанныйДокумент Из СвязанныеДокументы Цикл
		
		relatedDocument = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, accompanyingForms.relatedDocument);
		Если ЗначениеЗаполнено(СвязанныйДокумент.Серия) Тогда
			relatedDocument.issueSeries  = СвязанныйДокумент.Серия;
		КонецЕсли;
		relatedDocument.issueNumber      = СвязанныйДокумент.Номер;
		relatedDocument.issueDate        = СвязанныйДокумент.Дата;
		relatedDocument.type             = Перечисления.ТипыДокументовВЕТИС.ПолучитьЗначениеВЕТИС(СвязанныйДокумент.ТипДокумента);
		relatedDocument.relationshipType = Перечисления.ТипыСвязейВЕТИС.ПолучитьЗначениеВЕТИС(СвязанныйДокумент.ТипСвязи);
		
		accompanyingForms.relatedDocument.Добавить(relatedDocument);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Выборка.ТипТТН) Тогда
		waybill = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, accompanyingForms, "waybill");
		Если ЗначениеЗаполнено(Выборка.СерияТТН) Тогда
			waybill.issueSeries = Выборка.СерияТТН;
		КонецЕсли;
		waybill.issueDate   = Выборка.ДатаТТН;
		waybill.issueNumber = Выборка.НомерТТН;
		waybill.type        = Перечисления.ТипыДокументовВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.ТипТТН);
		accompanyingForms.waybill = waybill;
	КонецЕсли;

	Если ЗначениеЗаполнено(Выборка.СпособХранения) Тогда
		returnedDelivery.transportStorageType = Перечисления.СпособыХраненияВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.СпособХранения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Посредник) Тогда
		// Получатель
		broker = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, returnedDelivery, "broker");
		broker.guid = Выборка.Посредник;
		
		returnedDelivery.broker = broker;
	КонецЕсли;
	
	Если ПунктыПерегрузки.Количество() > 0 Тогда
		
		cargoReloadingPointList = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, returnedDelivery, "ShipmentRoute");
		НомерПункта = 1;
		ЗаполнитьПунктыПерегрузки = Ложь;
		Для Каждого ТекущийПунктПерегрузки ИЗ ПунктыПерегрузки Цикл
			
			Если НЕ ЗначениеЗаполнено(ТекущийПунктПерегрузки.ТипТС) Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьПунктыПерегрузки = Истина;
			
			cargoReloadingPoint = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, cargoReloadingPointList.routePoint);
			location = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, cargoReloadingPoint, "location");
			ЗаполнитьЛокацию = Ложь;
			Если ЗначениеЗаполнено(ТекущийПунктПерегрузки.НазваниеПункта) Тогда
				location.name = ТекущийПунктПерегрузки.НазваниеПункта;
				ЗаполнитьЛокацию = Истина;
			КонецЕсли;
			address = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, location, "address");
			ЗаполнитьАдрес = Ложь;
			Если ЗначениеЗаполнено(ТекущийПунктПерегрузки.Страна) Тогда
				country = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, address, "country");
				country.guid = ТекущийПунктПерегрузки.Страна;
				address.country=country;
				ЗаполнитьАдрес = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекущийПунктПерегрузки.Регион) Тогда
				region = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, address, "region");
				region.guid = ТекущийПунктПерегрузки.Регион;
				address.region=region;
				ЗаполнитьАдрес = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекущийПунктПерегрузки.НазваниеПункта) тогда
				addressView = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, address, "addressView");
				addressView = ТекущийПунктПерегрузки.НазваниеПункта;
				address.addressView = addressView;
				ЗаполнитьАдрес = Истина;
			КонецЕсли;
			
			Если ЗаполнитьАдрес Тогда
				location.address = address;
				ЗаполнитьЛокацию = Истина;
			КонецЕсли;
			
			Если ЗаполнитьЛокацию Тогда
				cargoReloadingPoint.location = location;// Название пункта перегрузки.
			КонецЕсли;
			
			cargoReloadingPoint.transshipment = ТекущийПунктПерегрузки.СПерегрузкой;
			
			//cargoReloadingPoint.sqnId = ТекущийПунктПерегрузки.НомерСтроки;
			cargoReloadingPoint.sqnId = НомерПункта;
			Если ЗначениеЗаполнено(ТекущийПунктПерегрузки.Предприятие) Тогда
				Enterprise = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, cargoReloadingPoint, "enterprise");
				Enterprise.guid = ТекущийПунктПерегрузки.Предприятие;
				cargoReloadingPoint.enterprise = Enterprise;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекущийПунктПерегрузки.ТипТС) Тогда
				nextTransport = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, cargoReloadingPoint, "nextTransport"); // Сведения о дальнейшем транспорте.
				ЗаполнитьИнформациюПоТранспорту(ВнутренняяФабрикаXDTO, nextTransport, ТекущийПунктПерегрузки);
				
				cargoReloadingPoint.nextTransport = nextTransport;
			КонецЕсли;
			
			cargoReloadingPointList.routePoint.Добавить(cargoReloadingPoint);
			
			НомерПункта = НомерПункта + 1;
			
		КонецЦикла;
		
		Если ЗаполнитьПунктыПерегрузки Тогда
			returnedDelivery.ShipmentRoute = cargoReloadingPointList;
		КонецЕсли;
	КонецЕсли;
	
	transportInfo = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, returnedDelivery, "transportInfo");
	
	ЗаполнитьИнформациюПоТранспорту(ВнутренняяФабрикаXDTO, transportInfo, Выборка);
	
	returnedDelivery.transportInfo = transportInfo;
	
	consignment = ПолучитьЭлементConsignment(ВнутренняяФабрикаXDTO, Выборка, returnedDelivery.consignment, Упаковки, Маркировка, КВозврату);
	returnedDelivery.consignment.Добавить(consignment);
	
	Если ЗначениеЗаполнено(Выборка.ВСДВозврат) Тогда
		vetCertificate = ПолучитьВетСертификат(ВнутренняяФабрикаXDTO, Выборка.ВСДВозврат, accompanyingForms.vetCertificate);
	Иначе
		vetCertificate = ПолучитьВетСертификат(ВнутренняяФабрикаXDTO, Выборка.ВСД, accompanyingForms.vetCertificate,, Истина);
	КонецЕсли;
	
	accompanyingForms.vetCertificate.Добавить(vetCertificate);
	
	returnedDelivery.accompanyingForms = accompanyingForms;
	
	ОбъектЗапроса.returnedDelivery = returnedDelivery;
	
КонецПроцедуры

Процедура ЗаполнитьЗапросИсходящийВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МеркурийЗаявкаВСД.Отправитель.Код КАК Отправитель,
	|	МеркурийЗаявкаВСД.ПредприятиеОтправитель.Код КАК ПредприятиеОтправитель,
	|	МеркурийЗаявкаВСД.Получатель.Код КАК Получатель,
	|	МеркурийЗаявкаВСД.ПредприятиеПолучатель.Код КАК ПредприятиеПолучатель,
	|	МеркурийЗаявкаВСД.СерияТТН,
	|	МеркурийЗаявкаВСД.НомерТТН,
	|	МеркурийЗаявкаВСД.ДатаТТН,
	|	МеркурийЗаявкаВСД.ТипТТН,
	|	МеркурийЗаявкаВСД.Посредник.Код КАК Посредник,
	|	МеркурийЗаявкаВСД.ТранспортноеСредство.ТипТС КАК ТипТС,
	|	МеркурийЗаявкаВСД.ТранспортноеСредство.НомерТС КАК НомерТС,
	|	МеркурийЗаявкаВСД.НомерКонтейнера КАК НомерКонтейнера,
	|	МеркурийЗаявкаВСД.Прицеп.НомерТС КАК НомерПрицепа,
	|	МеркурийЗаявкаВСД.ПунктыПерегрузки.(
	|		НомерСтроки,
	|		НазваниеПункта,
	|		СПерегрузкой,
	|		ТранспортноеСредство.ТипТС КАК ТипТС,
	|		ТранспортноеСредство.НомерТС КАК НомерТС,
	|		Предприятие,
	|		Страна.Код КАК Страна,
	|		Регион.Код КАК Регион,
	|		Прицеп.НомерТС КАК НомерПрицепа,
	|		НомерКонтейнера
	|	),
	|	МеркурийЗаявкаВСД.Упаковки.(
	|		ИдентификаторСтроки,
	|		КоличествоУпаковок,
	|		Маркировка,
	|		ТипМаркировки КАК ТипМаркировки,
	|		Упаковка.Код КАК Упаковка,
	|		УровеньУпаковки КАК УровеньУпаковки
	|	),
	|	МеркурийЗаявкаВСД.СвязанныеДокументы.(
	|		ИдентификаторСтроки,
	|		Дата,
	|		Номер,
	|		Серия,
	|		ТипДокумента,
	|		ТипСвязи
	|	)
	|ИЗ
	|	Документ.ТранспортныеОперацииВЕТИС КАК МеркурийЗаявкаВСД
	|ГДЕ
	|	МеркурийЗаявкаВСД.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	МеркурийЗаявкаВСДПартии.СпособХранения КАК СпособХранения,
	|	МеркурийЗаявкаВСДПартии.Продукция.Родитель КАК ВидПродукции,
	|	МеркурийЗаявкаВСДПартии.ИдентификаторСтроки,
	|	МеркурийЗаявкаВСДПартии.ИдентификаторСтрокиПартий КАК ИдентификаторСтрокиПартий,
	|	МеркурийЗаявкаВСДПартии.Идентификатор КАК ИдентификаторПартии,
	|	МеркурийЗаявкаВСДПартии.Количество,
	|	МеркурийЗаявкаВСДПартии.ЕдиницаИзмерения.Код КАК ЕдиницаИзмерения,
	|	МеркурийЗаявкаВСДПартии.НомерСтроки,
	|	МеркурийЗаявкаВСДТовары.НазначениеГруза.Код КАК НазначениеГруза,
	|	МеркурийЗаявкаВСДТовары.ВыполненКонтрольГосВетВрачем,
	|	МеркурийЗаявкаВСДТовары.БлагополучиеМестности.Наименование КАК БлагополучиеМестности,
	|	МеркурийЗаявкаВСДТовары.ОсобыеОтметки,
	|	МеркурийЗаявкаВСДТовары.НомерБСО,
	|	МеркурийЗаявкаВСДТовары.СерияБСО,
	|	МеркурийЗаявкаВСДПартии.ЭкспертизаРезультат
	|ИЗ
	|	Документ.ТранспортныеОперацииВЕТИС.Партии КАК МеркурийЗаявкаВСДПартии
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ТранспортныеОперацииВЕТИС.Товары КАК МеркурийЗаявкаВСДТовары
	|ПО
	|	МеркурийЗаявкаВСДПартии.Ссылка = МеркурийЗаявкаВСДТовары.Ссылка И 
	|	МеркурийЗаявкаВСДПартии.ИдентификаторСтроки = МеркурийЗаявкаВСДТовары.ИдентификаторСтроки
	|ГДЕ
	|	МеркурийЗаявкаВСДПартии.Ссылка = &Ссылка И 
	|	МеркурийЗаявкаВСДПартии.Списана = Ложь И 
	|	МеркурийЗаявкаВСДПартии.СпособХранения = &СпособХранения
	|УПОРЯДОЧИТЬ ПО
	|	МеркурийЗаявкаВСДПартии.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТранспортныеОперацииВЕТИСУсловияПеремещенияПродукции.ВидПродукции КАК ВидПродукции,
	|	ТранспортныеОперацииВЕТИСУсловияПеремещенияПродукции.УсловиеПеремещения.Код КАК УсловиеПеремещения
	|ИЗ
	|	Документ.ТранспортныеОперацииВЕТИС.УсловияПеремещенияПродукции КАК ТранспортныеОперацииВЕТИСУсловияПеремещенияПродукции
	|ГДЕ
	|	ТранспортныеОперацииВЕТИСУсловияПеремещенияПродукции.Ссылка = &Ссылка И 
	|	ТранспортныеОперацииВЕТИСУсловияПеремещенияПродукции.ВыполняетсяУсловие = Истина
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДляВыгрузки.Объект);
	Запрос.УстановитьПараметр("СпособХранения", ДанныеДляВыгрузки.СпособХранения);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	КоличествоПакетов = ПакетЗапросов.Количество();
	
	Выборка            = ПакетЗапросов[КоличествоПакетов-3].Выбрать();
	ВыборкаПартии      = ПакетЗапросов[КоличествоПакетов-2].Выбрать();
	УсловияПеремещения = ПакетЗапросов[КоличествоПакетов-1].Выгрузить();
	
	Выборка.Следующий();
	
	Упаковки           = Выборка.Упаковки.Выгрузить();
	СвязанныеДокументы = Выборка.СвязанныеДокументы.Выгрузить();
	
	//Пока ВыборкаСпособХранения.Следующий() Цикл
	
	delivery = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "delivery");
	
	accompanyingForms = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "accompanyingForms");
	
	//Сведения о транспортировке партии.
	Если ЗначениеЗаполнено(Выборка.ТипТТН) Тогда
		waybill = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, accompanyingForms, "waybill");
		Если ЗначениеЗаполнено(Выборка.СерияТТН) Тогда
			waybill.issueSeries = Выборка.СерияТТН;
		КонецЕсли;
		waybill.issueDate   = Выборка.ДатаТТН;
		waybill.issueNumber = Выборка.НомерТТН;
		waybill.type        = Перечисления.ТипыДокументовВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.ТипТТН);
		
		accompanyingForms.waybill = waybill;
	КонецЕсли;
	
	Счетчик = 1;
	//ВыборкаТовары = Выборка.Партии.Выбрать();
	//Пока ВыборкаТовары.Следующий() Цикл
	Пока ВыборкаПартии.Следующий() Цикл
		ИдентификаторСтроки = "_" + Формат(Счетчик, "ЧГ=");
		
		УпаковкиПартии           = Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаПартии.ИдентификаторСтрокиПартий));
		УсловияПеремещенияПартии = УсловияПеремещения.НайтиСтроки(Новый Структура("ВидПродукции", ВыборкаПартии.ВидПродукции));
		consignment = ПолучитьЭлементConsignmentОтгрузка(ВнутренняяФабрикаXDTO, ВыборкаПартии, delivery.consignment, УпаковкиПартии);
		consignment.id        = ИдентификаторСтроки;
		delivery.consignment.Добавить(consignment);
		
		vetCertificate = ПолучитьВетСертификатОтгрузка(ВнутренняяФабрикаXDTO, accompanyingForms.vetCertificate, ВыборкаПартии, УсловияПеремещенияПартии);
		vetCertificate.for = ИдентификаторСтроки;
		
		accompanyingForms.vetCertificate.Добавить(vetCertificate);
		
		СвязанныеДокументыПартии = СвязанныеДокументы.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаПартии.ИдентификаторСтроки));
		Для Каждого СвязанныйДокумент Из СвязанныеДокументыПартии Цикл
			
			relatedDocument = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, accompanyingForms.relatedDocument);
			relatedDocument.for              = ИдентификаторСтроки;
			Если ЗначениеЗаполнено(СвязанныйДокумент.Серия) Тогда
				relatedDocument.issueSeries = СвязанныйДокумент.Серия;
			КонецЕсли;
			relatedDocument.issueNumber      = СвязанныйДокумент.Номер;
			relatedDocument.issueDate        = СвязанныйДокумент.Дата;
			relatedDocument.type             = Перечисления.ТипыДокументовВЕТИС.ПолучитьЗначениеВЕТИС(СвязанныйДокумент.ТипДокумента);
			Если ЗначениеЗаполнено(СвязанныйДокумент.ТипСвязи) Тогда
				relatedDocument.relationshipType = Перечисления.ТипыСвязейВЕТИС.ПолучитьЗначениеВЕТИС(СвязанныйДокумент.ТипСвязи);
			КонецЕсли;
			
			accompanyingForms.relatedDocument.Добавить(relatedDocument);
		КонецЦикла;
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	// Получатель
	consignee = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "consignee");
	ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, consignee, Выборка.Получатель, Выборка.ПредприятиеПолучатель);
	
	// Отправитель
	consignor = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "consignor");
	ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, consignor, Выборка.Отправитель, Выборка.ПредприятиеОтправитель);
	
	Если ЗначениеЗаполнено(ДанныеДляВыгрузки.СпособХранения) Тогда
		delivery.transportStorageType = Перечисления.СпособыХраненияВЕТИС.ПолучитьЗначениеВЕТИС(ДанныеДляВыгрузки.СпособХранения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ТипТС) Тогда
		transportInfo = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "transportInfo");
		ЗаполнитьИнформациюПоТранспорту(ВнутренняяФабрикаXDTO, transportInfo, Выборка);
		delivery.transportInfo = transportInfo;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Посредник) Тогда
		broker = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "broker");
		broker.guid = Выборка.Посредник;
		delivery.broker = broker;
	КонецЕсли;
	
	ПунктыПерегрузки = Выборка.ПунктыПерегрузки.Выбрать();
	Если ПунктыПерегрузки.Количество() > 0 Тогда
		
		shipmentRoute = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "shipmentRoute");
		
		Пока ПунктыПерегрузки.Следующий() Цикл
			
			routePoint = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, shipmentRoute.routePoint);
			routePoint.sqnId = ПунктыПерегрузки.НомерСтроки;
			
			Если ЗначениеЗаполнено(ПунктыПерегрузки.НазваниеПункта) Тогда
				location = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, routePoint, "location");
				location.name = ПунктыПерегрузки.НазваниеПункта;
				address = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, location, "address");
				Если ЗначениеЗаполнено(ПунктыПерегрузки.Страна) Тогда
					country = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, address, "country");
					country.guid = ПунктыПерегрузки.Страна;
					address.country=country;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПунктыПерегрузки.Регион) Тогда
					region = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, address, "region");
					region.guid = ПунктыПерегрузки.Регион;
					address.region=region;
				КонецЕсли;
				location.address = address;
				routePoint.location = location;
			ИначеЕсли ЗначениеЗаполнено(ПунктыПерегрузки.Предприятие) Тогда
				Enterprise = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, routePoint, "enterprise");
				Enterprise.guid = ПунктыПерегрузки.Предприятие;
				routePoint.enterprise = Enterprise;
			КонецЕсли;
			
			// Признак того, осуществляется ли в данной точке перегрузка.
			routePoint.transshipment = ПунктыПерегрузки.СПерегрузкой;
			
			Если ЗначениеЗаполнено(ПунктыПерегрузки.ТипТС) Тогда
				nextTransport = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, routePoint, "nextTransport"); // Сведения о дальнейшем транспорте.
				ЗаполнитьИнформациюПоТранспорту(ВнутренняяФабрикаXDTO, nextTransport, ПунктыПерегрузки);
				routePoint.nextTransport = nextTransport;
			КонецЕсли;
			
			shipmentRoute.routePoint.Добавить(routePoint);
			
		КонецЦикла;
		
		delivery.shipmentRoute = shipmentRoute;
	КонецЕсли;
	
	// Дополнительные сведения, необходимые для оформления ВСД
	delivery.accompanyingForms = accompanyingForms;
	// Сведения о получателе продукции
	delivery.consignee    = consignee;
	// Сведения об отправителе (владельце).
	delivery.consignor    = consignor;
	// Дата оформления транспортной партии.
	delivery.deliveryDate = ТекущаяДата();
	//delivery.uuid
	
	ОбъектЗапроса.delivery.Добавить(delivery);
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОСырье(rawBatch)
	
	
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОПроизведённойПродукции(productiveBatch)
	
	
	
КонецПроцедуры

Процедура ЗаполнитьЗапросПроизводственныйВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МеркурийЗаявкаВСД.Предприятие.Код КАК Предприятие,
	|	МеркурийЗаявкаВСД.Номер,
	|	МеркурийЗаявкаВСД.Дата,
	|	МеркурийЗаявкаВСД.ИдентификаторПроизводственнойТранзакции,
	|	МеркурийЗаявкаВСД.ЗавершениеПроизводственнойТранзакции,
	|	МеркурийЗаявкаВСД.ДокументОснование
	|ИЗ
	|	Документ.ПроизводственныеОперацииВЕТИС КАК МеркурийЗаявкаВСД
	|ГДЕ
	|	МеркурийЗаявкаВСД.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	МеркурийСырье.ИдентификаторСтроки,
	|	МеркурийСырье.Количество КАК Количество,
	|	МеркурийСырье.ЕдиницаИзмерения.Код КАК ЕдиницаИзмерения,
	|	МеркурийСырье.ИдентификаторСтрокиПартий,
	|	МеркурийСырье.ИдентификаторСтроки,
	|	СкладскойЖурналВЕТИС.ИдентификаторЗаписи
	|ИЗ
	|	Документ.ПроизводственныеОперацииВЕТИС.Партии КАК МеркурийСырье
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СкладскойЖурналВЕТИС КАК СкладскойЖурналВЕТИС
	|ПО
	|	МеркурийСырье.Идентификатор = СкладскойЖурналВЕТИС.Идентификатор
	|ГДЕ
	|	МеркурийСырье.Ссылка = &Ссылка И 
	|	МеркурийСырье.Израсходована = ЛОЖЬ
	|УПОРЯДОЧИТЬ ПО
	|	МеркурийСырье.НомерСтроки
	|;
	|
	|ВЫБРАТЬ
	|	ПродукцияВЕТИС.ИдентификаторСтроки,
	|	ПродукцияВЕТИС.ВидПродукции.ТипПродукции.Код КАК ТипПродукции,
	|	ПродукцияВЕТИС.ВидПродукции.Родитель.Код КАК Продукция,
	|	ПродукцияВЕТИС.ВидПродукции.Код КАК ВидПродукции,
	|	ПродукцияВЕТИС.Продукция.Код КАК КодПродукции,
	|	ПродукцияВЕТИС.Продукция.Наименование КАК НаименованиеПродукции,
	|	ПродукцияВЕТИС.Продукция.ИдентификаторЗаписи КАК ИдентификаторПродукции,
	|	ВЫБОР
	|		КОГДА ПродукцияВЕТИС.Вес = 0 ТОГДА
	|			ПродукцияВЕТИС.Количество
	|		ИНАЧЕ
	|			ПродукцияВЕТИС.Вес
	|	КОНЕЦ КАК Количество,
	|	ПродукцияВЕТИС.ЕдиницаИзмерения.Код КАК ЕдиницаИзмерения,
	|	ПродукцияВЕТИС.ДатаВыработки,
	|	ПродукцияВЕТИС.ДатаВыработкиПо,
	|	ПродукцияВЕТИС.СрокГодности,
	|	ПродукцияВЕТИС.СрокГодностиПо,
	|	ПродукцияВЕТИС.Скоропортящаяся,
	|	ПродукцияВЕТИС.Некачественный,
	|	ПродукцияВЕТИС.ВыполненКонтрольГосВетВрачем,
	|	ПродукцияВЕТИС.ЭкспертизаРезультат,
	|	ПродукцияВЕТИС.ОсобыеОтметки
	|ИЗ
	|	Документ.ПроизводственныеОперацииВЕТИС.Продукция КАК ПродукцияВЕТИС
	|ГДЕ
	|	ПродукцияВЕТИС.Ссылка = &Ссылка И 
	|	ПродукцияВЕТИС.ВСД = ЗНАЧЕНИЕ(Документ.ВСДВЕТИС.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	ПродукцияВЕТИС.НомерСтроки
	|;
	|
	|ВЫБРАТЬ
	|	УпаковкиВЕТИС.ИдентификаторСтроки,
	|	УпаковкиВЕТИС.КоличествоУпаковок,
	|	УпаковкиВЕТИС.Упаковка.Код КАК Упаковка,
	|	УпаковкиВЕТИС.УровеньУпаковки,
	|	УпаковкиВЕТИС.Маркировка,
	|	УпаковкиВЕТИС.ТипМаркировки
	|ИЗ
	|	Документ.ПроизводственныеОперацииВЕТИС.УпаковкиПродукции КАК УпаковкиВЕТИС
	|ГДЕ
	|	УпаковкиВЕТИС.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	УпаковкиВЕТИС.ИдентификаторСтроки,
	|	УпаковкиВЕТИС.КоличествоУпаковок,
	|	УпаковкиВЕТИС.Упаковка.Код КАК Упаковка,
	|	УпаковкиВЕТИС.УровеньУпаковки,
	|	УпаковкиВЕТИС.Маркировка,
	|	УпаковкиВЕТИС.ТипМаркировки
	|ИЗ
	|	Документ.ПроизводственныеОперацииВЕТИС.Упаковки КАК УпаковкиВЕТИС
	|ГДЕ
	|	УпаковкиВЕТИС.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДляВыгрузки.Объект);
	
	ПакетЗапросов     = Запрос.ВыполнитьПакет();
	Выборка           = ПакетЗапросов[0].Выбрать();
	ВыборкаПартии     = ПакетЗапросов[1].Выбрать();
	ВыборкаПродукции  = ПакетЗапросов[2].Выбрать();
	УпаковкиПродукции = ПакетЗапросов[3].Выгрузить();
	Упаковки          = ПакетЗапросов[4].Выгрузить();
	
	Выборка.Следующий();
	
	enterprise = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "enterprise");
	enterprise.guid = Выборка.Предприятие;
	
	productionOperation = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "productionOperation");
	
	//Флаг, указывающий, завершается ли производственная транзакция
	//finalizeOperation = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, productionOperation, "finalizeOperation");
	
	//Идентификатор производственной транзакции (производственная смена, сутки и т.п.) Используется ТОЛЬКО для операций с незавершённым производством.
	//operationId       = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, productionOperation, "operationId");
	
	//Cведения о сырье, использованном при производстве партии продукции.
	Пока ВыборкаПартии.Следующий() Цикл
		
		batch = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, productionOperation.rawBatch);
		sourceStockEntry = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "sourceStockEntry");
		sourceStockEntry.UUID = ВыборкаПартии.ИдентификаторЗаписи;
		
		batch = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, productionOperation.rawBatch);
		sourceStockEntry = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "sourceStockEntry");
		sourceStockEntry.UUID = ВыборкаПартии.ИдентификаторЗаписи;
		batch.sourceStockEntry = sourceStockEntry;
		
		УпаковкиПартии = Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаПартии.ИдентификаторСтрокиПартий));
		Если УпаковкиПартии.Количество()>0 Тогда
			batch.packageList = ПолучитьУпаковкиПартииXDTO(ВнутренняяФабрикаXDTO, УпаковкиПартии, batch);
		КонецЕсли;
		
		unit = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "unit");
		unit.guid = ВыборкаПартии.ЕдиницаИзмерения;
		
		batch.volume = ВыборкаПартии.Количество;
		batch.unit   = unit;
		
		productionOperation.rawBatch.Добавить(batch);
		
	КонецЦикла;
	
	Счетчик = 1;
	
	НомерПартии = "";
	ДатаПартии  = Дата(1,1,1);
	Если ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда
		НомерПартии = Выборка.ДокументОснование.Номер;
		ДатаПартии  = Выборка.ДокументОснование.Дата;
	Иначе
		НомерПартии = Выборка.Номер;
		ДатаПартии  = Выборка.Дата;
	КонецЕсли;
	
	//Cведения о произведённой продукции.
	Пока ВыборкаПродукции.Следующий() Цикл
		
		batch = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, productionOperation.productiveBatch);
		
		product = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "product");
		product.guid = ВыборкаПродукции.Продукция;
		
		productItem = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "productItem");
		productItem.guid = ВыборкаПродукции.КодПродукции;
		productItem.name = ВыборкаПродукции.НаименованиеПродукции;
		productItem.uuid = ВыборкаПродукции.ИдентификаторПродукции;
		
		subProduct = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "subProduct");
		subProduct.guid = ВыборкаПродукции.ВидПродукции;
		
		unit = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "unit");
		unit.guid = ВыборкаПродукции.ЕдиницаИзмерения;
		
		dateOfProduction = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "dateOfProduction");
		ЗаполнитьПериодXDTO(ВнутренняяФабрикаXDTO, dateOfProduction, ВыборкаПродукции.ДатаВыработки, ВыборкаПродукции.ДатаВыработкиПо);
		
		expiryDate = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "expiryDate");
		ЗаполнитьПериодXDTO(ВнутренняяФабрикаXDTO, expiryDate, ВыборкаПродукции.СрокГодности, ВыборкаПродукции.СрокГодностиПо);
		
		УпаковкиПартии = УпаковкиПродукции.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаПродукции.ИдентификаторСтроки));
		Если УпаковкиПартии.Количество()>0 Тогда
			batch.packageList = ПолучитьУпаковкиПартииXDTO(ВнутренняяФабрикаXDTO, УпаковкиПартии, batch);
		КонецЕсли;
		
		//batch.countryOfOrigin
		batch.productType        = ВыборкаПродукции.ТипПродукции;
		batch.product            = product;
		batch.subProduct         = subProduct;
		batch.productItem        = productItem;
		batch.dateOfProduction   = dateOfProduction;
		batch.expiryDate         = expiryDate;
		batch.lowGradeCargo      = ВыборкаПродукции.Некачественный;
		batch.perishable         = ВыборкаПродукции.Скоропортящаяся;
		batch.unit               = unit;
		batch.volume             = ВыборкаПродукции.Количество;
		batch.batchID.Добавить(Строка(НомерПартии));
		
		//Если ЗначениеЗаполнено(ВыборкаПродукции.Упаковка) И ВыборкаПродукции.КоличествоУпаковок>0 Тогда
		//	packageList = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(batch, "packageList");
		//	packingForm = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(packageList.package);
		//	packingForm.uuid = ВыборкаПродукции.Упаковка;
		//	packingForm.name = ВыборкаПродукции.НаименованиеУпаковки;
		//	packageList.packingForm.Добавить(packingForm);
		//	
		//	batch.packingAmount = ВыборкаПродукции.КоличествоУпаковок; // Количество единиц упаковки для входящей партии.
		//	batch.packageList   = packageList; // Список видов упаковки, которые используются для возвращаемой партии.
		//КонецЕсли;
		
		ИдентификаторСтроки = "id" + Формат(Счетчик, "ЧГ=");
		
		batch.id = ИдентификаторСтроки;
		
		productionOperation.productiveBatch.Добавить(batch);
		
		vetDocument = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса.vetDocument);
		
		// Сведения для создания ВСД.
		vetDocument.issueDate = ДатаПартии;
		
		authentication = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, vetDocument, "authentication");
		authentication.cargoInspected = ВыборкаПродукции.ВыполненКонтрольГосВетВрачем;
		Если ЗначениеЗаполнено(ВыборкаПродукции.ЭкспертизаРезультат) Тогда
			ЭкспертизаРезультат = ВыборкаПродукции.ЭкспертизаРезультат;
		Иначе
			ЭкспертизаРезультат = Перечисления.РезультатыИсследованияВЕТИС.UNFULFILLED;
		КонецЕсли;
		authentication.cargoExpertized = Перечисления.РезультатыИсследованияВЕТИС.ПолучитьЗначениеВЕТИС(ЭкспертизаРезультат);
		authentication.specialMarks = ВыборкаПродукции.ОсобыеОтметки;
		vetDocument.authentication = authentication;
		vetDocument.for = ИдентификаторСтроки;
		
		ОбъектЗапроса.vetDocument.Добавить(vetDocument);
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	ОбъектЗапроса.enterprise          = enterprise;
	ОбъектЗапроса.productionOperation = productionOperation;
	
КонецПроцедуры

Процедура ЗаполнитьЗапросВыпускПродукцииВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МеркурийЗаявкаВСД.Предприятие.Код КАК Предприятие,
	|	МеркурийЗаявкаВСД.Номер,
	|	МеркурийЗаявкаВСД.Дата,
	|	МеркурийЗаявкаВСД.ИдентификаторПроизводственнойТранзакции,
	|	МеркурийЗаявкаВСД.ЗавершениеПроизводственнойТранзакции,
	|	МеркурийЗаявкаВСД.ДокументОснование
	|ИЗ
	|	Документ.ПроизводственныеОперацииВЕТИС КАК МеркурийЗаявкаВСД
	|ГДЕ
	|	МеркурийЗаявкаВСД.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	ПродукцияВЕТИС.ИдентификаторСтроки,
	|	ПродукцияВЕТИС.ВидПродукции.ТипПродукции.Код КАК ТипПродукции,
	|	ПродукцияВЕТИС.ВидПродукции.Родитель.Код КАК Продукция,
	|	ПродукцияВЕТИС.ВидПродукции.Код КАК ВидПродукции,
	|	ПродукцияВЕТИС.Продукция.Код КАК КодПродукции,
	|	ПродукцияВЕТИС.Продукция.Наименование КАК НаименованиеПродукции,
	|	ПродукцияВЕТИС.Продукция.ИдентификаторЗаписи КАК ИдентификаторПродукции,
	|	ВЫБОР
	|		КОГДА ПродукцияВЕТИС.Вес = 0 ТОГДА
	|			ПродукцияВЕТИС.Количество
	|		ИНАЧЕ
	|			ПродукцияВЕТИС.Вес
	|	КОНЕЦ КАК Количество,
	|	ПродукцияВЕТИС.ЕдиницаИзмерения.ИдентификаторЗаписи КАК ЕдиницаИзмерения,
	|	ПродукцияВЕТИС.ДатаВыработки,
	|	ПродукцияВЕТИС.ДатаВыработкиПо,
	|	ПродукцияВЕТИС.СрокГодности,
	|	ПродукцияВЕТИС.СрокГодностиПо,
	|	ПродукцияВЕТИС.Скоропортящаяся,
	|	ПродукцияВЕТИС.Некачественный,
	|	ПродукцияВЕТИС.ВыполненКонтрольГосВетВрачем,
	|	ПродукцияВЕТИС.ЭкспертизаРезультат,
	|	ПродукцияВЕТИС.ОсобыеОтметки
	|ИЗ
	|	Документ.ПроизводственныеОперацииВЕТИС.Продукция КАК ПродукцияВЕТИС
	|ГДЕ
	|	ПродукцияВЕТИС.Ссылка = &Ссылка И 
	|	ПродукцияВЕТИС.ИдентификаторСтроки = &ИдентификаторСтроки
	|УПОРЯДОЧИТЬ ПО
	|	ПродукцияВЕТИС.НомерСтроки
	|;
	|
	|ВЫБРАТЬ
	|	УпаковкиВЕТИС.ИдентификаторСтроки,
	|	УпаковкиВЕТИС.КоличествоУпаковок,
	|	УпаковкиВЕТИС.Упаковка.Код КАК Упаковка,
	|	УпаковкиВЕТИС.УровеньУпаковки,
	|	УпаковкиВЕТИС.Маркировка,
	|	УпаковкиВЕТИС.ТипМаркировки
	|ИЗ
	|	Документ.ПроизводственныеОперацииВЕТИС.УпаковкиПродукции КАК УпаковкиВЕТИС
	|ГДЕ
	|	УпаковкиВЕТИС.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДляВыгрузки.Объект);
	Запрос.УстановитьПараметр("ИдентификаторСтроки", ДанныеДляВыгрузки.ИдентификаторСтроки);
	
	ПакетЗапросов    = Запрос.ВыполнитьПакет();
	Выборка          = ПакетЗапросов[0].Выбрать();
	ВыборкаПродукции = ПакетЗапросов[1].Выбрать();
	ТаблицаУпаковок  = ПакетЗапросов[2].Выгрузить();
	
	Выборка.Следующий();
	
	enterprise = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "enterprise");
	enterprise.guid = Выборка.Предприятие;
	
	productionOperation = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "productionOperation");
	productionOperation.operationId       = Выборка.ИдентификаторПроизводственнойТранзакции;
	//productionOperation.finalizeOperation = Выборка.ЗавершениеПроизводственнойТранзакции;
	
	//Флаг, указывающий, завершается ли производственная транзакция
	//finalizeOperation = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(productionOperation, "finalizeOperation");
	
	//Идентификатор производственной транзакции (производственная смена, сутки и т.п.) Используется ТОЛЬКО для операций с незавершённым производством.
	//operationId       = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(productionOperation, "operationId");
	
	//Cведения о сырье, использованном при производстве партии продукции.
	
	Счетчик = 1;
	
	НомерПартии = "";
	ДатаПартии  = Дата(1,1,1);
	Если ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда
		НомерПартии = Выборка.ДокументОснование.Номер;
		ДатаПартии  = Выборка.ДокументОснование.Дата;
	Иначе
		НомерПартии = Выборка.Номер;
		ДатаПартии  = Выборка.Дата;
	КонецЕсли;
	
	//Cведения о произведённой продукции.
	Пока ВыборкаПродукции.Следующий() Цикл
		
		batch = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, productionOperation.productiveBatch);
		
		product = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "product");
		product.guid = ВыборкаПродукции.Продукция;
		
		productItem = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "productItem");
		productItem.guid = ВыборкаПродукции.КодПродукции;
		productItem.name = ВыборкаПродукции.НаименованиеПродукции;
		productItem.uuid = ВыборкаПродукции.ИдентификаторПродукции;
		
		subProduct = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "subProduct");
		subProduct.guid = ВыборкаПродукции.ВидПродукции;
		
		unit = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "unit");
		unit.uuid = ВыборкаПродукции.ЕдиницаИзмерения;
		
		dateOfProduction = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "dateOfProduction");
		ЗаполнитьПериодXDTO(ВнутренняяФабрикаXDTO, dateOfProduction, ВыборкаПродукции.ДатаВыработки, ВыборкаПродукции.ДатаВыработкиПо);
		
		expiryDate = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "expiryDate");
		ЗаполнитьПериодXDTO(ВнутренняяФабрикаXDTO, expiryDate, ВыборкаПродукции.СрокГодности, ВыборкаПродукции.СрокГодностиПо);
		
		УпаковкиПартии = ТаблицаУпаковок.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаПродукции.ИдентификаторСтроки));
		Если УпаковкиПартии.Количество()>0 Тогда
			batch.packageList = ПолучитьУпаковкиПартииXDTO(ВнутренняяФабрикаXDTO, УпаковкиПартии, batch);
		КонецЕсли;
		
		batch.batchID.Добавить(СокрЛП(НомерПартии));
		
		//batch.countryOfOrigin
		batch.productType           = ВыборкаПродукции.ТипПродукции;
		batch.product               = product;
		batch.subProduct            = subProduct;
		batch.productItem           = productItem;
		//batch.productMarkingList    = productMarkingList;
		batch.dateOfProduction      = dateOfProduction;
		batch.expiryDate            = expiryDate;
		batch.lowGradeCargo         = ВыборкаПродукции.Некачественный;
		batch.perishable            = ВыборкаПродукции.Скоропортящаяся;
		batch.unit                  = unit;
		batch.volume                = ВыборкаПродукции.Количество;
		
		ИдентификаторСтроки = "id" + Формат(Счетчик, "ЧГ=");
		
		batch.id = ИдентификаторСтроки;
		
		productionOperation.productiveBatch.Добавить(batch);
		
		vetDocument = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса.vetDocument);
		
		// Сведения для создания ВСД.
		vetDocument.issueDate = ДатаПартии;
		
		authentication = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, vetDocument, "authentication");
		authentication.cargoInspected = ВыборкаПродукции.ВыполненКонтрольГосВетВрачем;
		Если ЗначениеЗаполнено(ВыборкаПродукции.ЭкспертизаРезультат) Тогда
			ЭкспертизаРезультат = ВыборкаПродукции.ЭкспертизаРезультат;
		Иначе
			ЭкспертизаРезультат = Перечисления.РезультатыИсследованияВЕТИС.UNFULFILLED;
		КонецЕсли;
		authentication.cargoExpertized = Перечисления.РезультатыИсследованияВЕТИС.ПолучитьЗначениеВЕТИС(ЭкспертизаРезультат);
		authentication.specialMarks = ВыборкаПродукции.ОсобыеОтметки;
		vetDocument.authentication = authentication;
		vetDocument.for = ИдентификаторСтроки;
		
		ОбъектЗапроса.vetDocument.Добавить(vetDocument);
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	ОбъектЗапроса.enterprise          = enterprise;
	ОбъектЗапроса.productionOperation = productionOperation;
	
КонецПроцедуры

Процедура ЗаполнитьЗапросСписанияСырья(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МеркурийЗаявкаВСД.Предприятие.Код КАК Предприятие,
	|	МеркурийЗаявкаВСД.ИдентификаторПроизводственнойТранзакции,
	|	МеркурийЗаявкаВСД.ЗавершениеПроизводственнойТранзакции
	|ИЗ
	|	Документ.ПроизводственныеОперацииВЕТИС КАК МеркурийЗаявкаВСД
	|ГДЕ
	|	МеркурийЗаявкаВСД.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	МеркурийСырье.ИдентификаторСтроки,
	|	МеркурийСырье.Количество,
	|	МеркурийСырье.ЕдиницаИзмерения.Код КАК ЕдиницаИзмерения,
	|	МеркурийСырье.ИдентификаторСтрокиПартий,
	//|	МеркурийСырье.Идентификатор КАК ИдентификаторПартии,
	|	СкладскойЖурналВЕТИС.ИдентификаторЗаписи КАК ИдентификаторЗаписи
	|ИЗ
	|	Документ.ПроизводственныеОперацииВЕТИС.Партии КАК МеркурийСырье
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СкладскойЖурналВЕТИС КАК СкладскойЖурналВЕТИС
	|ПО
	|	МеркурийСырье.Идентификатор = СкладскойЖурналВЕТИС.Идентификатор
	|ГДЕ
	|	МеркурийСырье.Ссылка = &Ссылка И 
	|	МеркурийСырье.ИдентификаторСтроки = &ИдентификаторСтроки
	|УПОРЯДОЧИТЬ ПО
	|	МеркурийСырье.НомерСтроки
	|;
	|
	|ВЫБРАТЬ
	|	УпаковкиВЕТИС.ИдентификаторСтроки,
	|	УпаковкиВЕТИС.КоличествоУпаковок,
	|	УпаковкиВЕТИС.Упаковка.Код КАК Упаковка,
	|	УпаковкиВЕТИС.УровеньУпаковки,
	|	УпаковкиВЕТИС.Маркировка,
	|	УпаковкиВЕТИС.ТипМаркировки
	|ИЗ
	|	Документ.ПроизводственныеОперацииВЕТИС.Упаковки КАК УпаковкиВЕТИС
	|ГДЕ
	|	УпаковкиВЕТИС.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДляВыгрузки.Объект);
	Запрос.УстановитьПараметр("ИдентификаторСтроки", ДанныеДляВыгрузки.ИдентификаторСтроки);
	
	ПакетЗапросов     = Запрос.ВыполнитьПакет();
	Выборка           = ПакетЗапросов[0].Выбрать();
	ТаблицаПартий     = ПакетЗапросов[1].Выгрузить();
	ТаблицаУпаковок   = ПакетЗапросов[2].Выгрузить();
	Выборка.Следующий();
	
	enterprise = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "enterprise");
	enterprise.guid = Выборка.Предприятие;
	
	productionOperation = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "productionOperation");
	
	productionOperation.operationId = Выборка.ИдентификаторПроизводственнойТранзакции;
	
	//Cведения о сырье, использованном при производстве партии продукции.
	Для Каждого ВыборкаПартии Из ТаблицаПартий Цикл
		
		batch = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, productionOperation.rawBatch);
		sourceStockEntry = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "sourceStockEntry");
		sourceStockEntry.UUID = ВыборкаПартии.ИдентификаторЗаписи;
		batch.sourceStockEntry = sourceStockEntry;
		
		УпаковкиПартии = ТаблицаУпаковок.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаПартии.ИдентификаторСтрокиПартий));
		Если УпаковкиПартии.Количество()>0 Тогда
			batch.packageList = ПолучитьУпаковкиПартииXDTO(ВнутренняяФабрикаXDTO, УпаковкиПартии, batch);
		КонецЕсли;
		
		unit = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "unit");
		unit.guid = ВыборкаПартии.ЕдиницаИзмерения;
		
		batch.volume = ВыборкаПартии.Количество;
		batch.unit   = unit;
		
		productionOperation.rawBatch.Добавить(batch);
		
	КонецЦикла;
	
	ОбъектЗапроса.enterprise          = enterprise;
	ОбъектЗапроса.productionOperation = productionOperation;
	
КонецПроцедуры

Процедура ЗаполнитьЗапросСписанияПолуфабрикатов(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МеркурийЗаявкаВСД.Предприятие.Код КАК Предприятие,
	//|	МеркурийЗаявкаВСД.Автор.МеркурийЛогин КАК Ответственный,
	|	МеркурийЗаявкаВСД.ИдентификаторПроизводственнойТранзакции,
	|	МеркурийЗаявкаВСД.ЗавершениеПроизводственнойТранзакции
	|ИЗ
	|	Документ.ПроизводственныеОперацииВЕТИС КАК МеркурийЗаявкаВСД
	|ГДЕ
	|	МеркурийЗаявкаВСД.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	ПродукцияВЕТИС.ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ПродукцияВЕТИС.Вес = 0 ТОГДА
	|			ПродукцияВЕТИС.Количество
	|		ИНАЧЕ
	|			ПродукцияВЕТИС.Вес
	|	КОНЕЦ КАК Количество,
	|	ПродукцияВЕТИС.ЕдиницаИзмерения.Код КАК ЕдиницаИзмерения,
	|	СкладскойЖурналВЕТИС.ИдентификаторЗаписи
	|ИЗ
	|	Документ.ПроизводственныеОперацииВЕТИС.Продукция КАК ПродукцияВЕТИС
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СкладскойЖурналВЕТИС КАК СкладскойЖурналВЕТИС
	|ПО
	|	ПродукцияВЕТИС.НомерЗаписи = СкладскойЖурналВЕТИС.НомерЗаписи
	|ГДЕ
	|	ПродукцияВЕТИС.Ссылка = &Ссылка И 
	|	ПродукцияВЕТИС.ИдентификаторСтроки = &ИдентификаторСтроки
	|УПОРЯДОЧИТЬ ПО
	|	ПродукцияВЕТИС.НомерСтроки
	|;
	|
	|ВЫБРАТЬ
	|	УпаковкиВЕТИС.ИдентификаторСтроки,
	|	УпаковкиВЕТИС.КоличествоУпаковок,
	|	УпаковкиВЕТИС.Упаковка.Код КАК Упаковка,
	|	УпаковкиВЕТИС.УровеньУпаковки,
	|	УпаковкиВЕТИС.Маркировка,
	|	УпаковкиВЕТИС.ТипМаркировки
	|ИЗ
	|	Документ.ПроизводственныеОперацииВЕТИС.УпаковкиПродукции КАК УпаковкиВЕТИС
	|ГДЕ
	|	УпаковкиВЕТИС.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДляВыгрузки.Объект);
	Запрос.УстановитьПараметр("ИдентификаторСтроки", ДанныеДляВыгрузки.ИдентификаторСтроки);
	
	ПакетЗапросов   = Запрос.ВыполнитьПакет();
	Выборка         = ПакетЗапросов[0].Выбрать();
	ВыборкаПартии   = ПакетЗапросов[1].Выбрать();
	ТаблицаУпаковок = ПакетЗапросов[2].Выгрузить();
	
	Выборка.Следующий();
	
	enterprise = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "enterprise");
	enterprise.guid = Выборка.Предприятие;
	
	productionOperation = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "productionOperation");
	
	//Флаг, указывающий, завершается ли производственная транзакция
	productionOperation.finalizeOperation = Выборка.ЗавершениеПроизводственнойТранзакции;
	productionOperation.operationId       = Выборка.ИдентификаторПроизводственнойТранзакции;
	
	//Cведения о сырье, использованном при производстве партии продукции.
	Пока ВыборкаПартии.Следующий() Цикл
		
		batch = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, productionOperation.rawBatch);
		sourceStockEntry = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "sourceStockEntry");
		sourceStockEntry.UUID = ВыборкаПартии.ИдентификаторЗаписи;
		
		batch = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, productionOperation.rawBatch);
		sourceStockEntry = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "sourceStockEntry");
		sourceStockEntry.UUID = ВыборкаПартии.ИдентификаторЗаписи;
		batch.sourceStockEntry = sourceStockEntry;
		
		УпаковкиПартии = ТаблицаУпаковок.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ВыборкаПартии.ИдентификаторСтроки));
		Если УпаковкиПартии.Количество()>0 Тогда
			batch.packageList = ПолучитьУпаковкиПартииXDTO(ВнутренняяФабрикаXDTO, УпаковкиПартии, batch);
		КонецЕсли;
		
		unit = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "unit");
		unit.guid = ВыборкаПартии.ЕдиницаИзмерения;
		
		batch.volume = ВыборкаПартии.Количество;
		batch.unit   = unit;
		
		productionOperation.rawBatch.Добавить(batch);
		
	КонецЦикла;
	
	ОбъектЗапроса.enterprise          = enterprise;
	ОбъектЗапроса.productionOperation = productionOperation;
	
КонецПроцедуры

Процедура ЗаполнитьЗапросУпрощенногоГашенияВСД(ВнутренняяФабрикаXDTO, ОбъектЗаявки, ДанныеДляВыгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МеркурийВСД.Отправитель.Код КАК Отправитель,
	|	МеркурийВСД.ПредприятиеОтправитель.Код КАК ПредприятиеОтправитель,
	|	МеркурийВСД.Получатель.Код КАК Получатель,
	|	МеркурийВСД.ПредприятиеПолучатель.Код КАК ПредприятиеПолучатель,
	|	МеркурийВСД.СерияТТН КАК СерияТТН,
	|	МеркурийВСД.НомерТТН КАК НомерТТН,
	|	МеркурийВСД.ДатаТТН КАК ДатаТТН,
	|	МеркурийВСД.ТипТТН КАК ТипТТН,
	|	МеркурийВСД.Посредник.Код КАК Посредник,
	|	МеркурийВСД.ТранспортноеСредство.ТипТС КАК ТипТС,
	|	МеркурийВСД.ТранспортноеСредство.НомерТС КАК НомерТС,
	|	МеркурийВСД.НомерКонтейнера КАК НомерКонтейнера,
	|	МеркурийВСД.Прицеп.НомерТС КАК НомерПрицепа,
	|	МеркурийВСД.СпособХранения КАК СпособХранения,
	|	ВЫБОР
	|		КОГДА МеркурийВСД.Продукция.НеЗарегистрирована ТОГДА
	|			""""
	|		ИНАЧЕ
	|			МеркурийВСД.Продукция.Код
	|	КОНЕЦ КАК КодПродукции,
	//|	МеркурийВСД.Продукция.Код КАК КодПродукции,
	//|	МеркурийВСД.Продукция.ИдентификаторЗаписи КАК ИдентификаторПродукции,
	|	ВЫБОР
	|		КОГДА МеркурийВСД.Продукция.НеЗарегистрирована ТОГДА
	|			""""
	|		ИНАЧЕ
	|			МеркурийВСД.Продукция.ИдентификаторЗаписи
	|	КОНЕЦ КАК ИдентификаторПродукции,
	|	МеркурийВСД.ПродукцияСтрокой КАК НаименованиеПродукции,
	//|	МеркурийВСД.ПродукцияОригинал.Код КАК КодПродукцииОригинал,
	|	МеркурийВСД.ВидПродукции.ТипПродукции.Код КАК ТипПродукции,
	|	МеркурийВСД.ВидПродукции.Родитель.Код КАК Продукция,
	|	МеркурийВСД.ВидПродукции.Код КАК ВидПродукции,
	|	МеркурийВСД.Количество,
	|	МеркурийВСД.ЕдиницаИзмерения.Код КАК ЕдиницаИзмерения,
	|	МеркурийВСД.КоличествоУпаковок,
	|	МеркурийВСД.ДатаВыработки,
	|	МеркурийВСД.ДатаВыработкиПо,
	|	МеркурийВСД.СрокГодности,
	|	МеркурийВСД.СрокГодностиПо,
	|	МеркурийВСД.Скоропортящаяся,
	|	МеркурийВСД.СтранаПроисхождения.Код КАК СтранаПроисхождения,
	|	МеркурийВСД.СтранаПроисхождения.Наименование КАК СтранаПроисхожденияНаименование,
	|	МеркурийВСД.Некачественный,
	|	МеркурийВСД.Ссылка КАК ВСД,
	|	МеркурийВСД.Упаковки.(
	|		Упаковка.Код КАК Упаковка,
	|		КоличествоУпаковок,
	|		УровеньУпаковки,
	|		ИдентификаторСтроки,
	|	) КАК Упаковки,
	//|	МеркурийВСД.Производители.(
	//|		Производитель.Код КАК Производитель,
	//|		РольПроизводителя
	//|	) КАК Производители,
	|	МеркурийВСД.ПунктыПерегрузки.(
	|		НазваниеПункта,
	|		ТранспортноеСредство.ТипТС КАК ТипТС,
	|		ТранспортноеСредство.НомерТС КАК НомерТС,
	|		Прицеп.НомерТС КАК НомерПрицепа,
	|		НомерКонтейнера
	|	) КАК ПунктыПерегрузки,
	|	МеркурийВСД.Маркировка.(
	|		Маркировка,
	|		ТипМаркировки,
	|		ИдентификаторСтроки
	|	) КАК Маркировка,
	|	""ACCEPT_ALL"" КАК РешениеПринятияПартии,
	|	""UNSUPERVISED"" КАК РезультатСоответствия,
	|	""UNSUPERVISED"" ЗаключениеВетеринара
	|ИЗ
	|	Документ.ВСДВЕТИС КАК МеркурийВСД
	|ГДЕ
	|	МеркурийВСД.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДляВыгрузки.Объект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Упаковки   = Выборка.Упаковки.Выгрузить();
	Маркировка = Выборка.Маркировка.Выгрузить();
	
	delivery = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗаявки, "delivery");
	
	accompanyingForms = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "accompanyingForms");
	
	Если ЗначениеЗаполнено(Выборка.ТипТТН) Тогда
		waybill = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, accompanyingForms, "waybill");
		waybill.issueDate   = Выборка.ДатаТТН;
		waybill.issueNumber = Выборка.НомерТТН;
		waybill.issueSeries = Выборка.СерияТТН;
		waybill.type        = Перечисления.ТипыДокументовВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.ТипТТН);
		
		accompanyingForms.waybill = waybill;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.СпособХранения) Тогда
		delivery.transportStorageType = Перечисления.СпособыХраненияВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.СпособХранения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Посредник) Тогда
		// Получатель
		broker = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "broker");
		broker.guid = Выборка.Посредник;
		delivery.broker = broker;
	КонецЕсли;
	
	АвтомобильПоФакту = Новый Структура;
	АвтомобильПоФакту.Вставить("ТипТС",           Выборка.ТипТС);
	АвтомобильПоФакту.Вставить("НомерТС",         Выборка.НомерТС);
	АвтомобильПоФакту.Вставить("НомерПрицепа",    Выборка.НомерПрицепа);
	АвтомобильПоФакту.Вставить("НомерКонтейнера", Выборка.НомерКонтейнера);
	
	ПунктыПерегрузки = Выборка.ПунктыПерегрузки.Выбрать();
	Если ПунктыПерегрузки.Количество() > 0 Тогда
		
	//	cargoReloadingPointList = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(waybill, "cargoReloadingPointList");
		
		Пока ПунктыПерегрузки.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(ПунктыПерегрузки.ТипТС) Тогда
				Продолжить;
			КонецЕсли;
			
	//		cargoReloadingPoint = СоздатьЭлементСпискаXDTO(cargoReloadingPointList.cargoReloadingPoint);
	//		cargoReloadingPoint.name = ПунктыПерегрузки.НазваниеПункта;// Название пункта перегрузки.
	//		
	//		nextTransport = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(cargoReloadingPoint, "nextTransport"); // Сведения о дальнейшем транспорте.
	//		ЗаполнитьИнформациюПоТранспорту(nextTransport, ПунктыПерегрузки);
	//		
	//		cargoReloadingPoint.nextTransport = nextTransport;
	//		
	//		cargoReloadingPointList.cargoReloadingPoint.Добавить(cargoReloadingPoint);
	//		
			ЗаполнитьЗначенияСвойств(АвтомобильПоФакту, ПунктыПерегрузки);
			
		КонецЦикла;
		
	//	waybill.cargoReloadingPointList = cargoReloadingPointList;
	КонецЕсли;
	
	transportInfo = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "transportInfo");
	
	ЗаполнитьИнформациюПоТранспорту(ВнутренняяФабрикаXDTO, transportInfo, АвтомобильПоФакту);
	delivery.transportInfo = transportInfo;
	
	ЭлектронныйВСД = Ложь;
	
	consignment = ПолучитьЭлементConsignment(ВнутренняяФабрикаXDTO, Выборка, delivery.consignment, Упаковки, Маркировка);
	
	delivery.consignment.Добавить(consignment);
	
	vetCertificate = ПолучитьВетСертификат(ВнутренняяФабрикаXDTO, Выборка.ВСД, accompanyingForms.vetCertificate);
	accompanyingForms.vetCertificate.Добавить(vetCertificate);
	
	ЭлектронныйВСД = (НЕ ПустаяСтрока(Выборка.ВСД.Идентификатор));
	
	// Получатель
	consignee = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "consignee");
	ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, consignee, Выборка.Получатель, Выборка.ПредприятиеПолучатель);
	
	// Отправитель
	consignor = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "consignor");
	ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, consignor, Выборка.Отправитель, Выборка.ПредприятиеОтправитель);
	
	delivery.accompanyingForms = accompanyingForms;
	delivery.consignee    = consignee;
	delivery.consignor    = consignor;
	delivery.deliveryDate = ТекущаяДата();
	
	ОбъектЗаявки.delivery = delivery;
	
	//Объект содержит обобщенные сведения о результате приема партии продукции или группы животных.
	deliveryFacts = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗаявки, "deliveryFacts");
	//Принятое решение о приёме входной партии.
	deliveryFacts.decision = Выборка.РешениеПринятияПартии;
	
	// Природа ВСД (электронный или бумажный).
	Если ЭлектронныйВСД Тогда
		deliveryFacts.vetCertificatePresence = "ELECTRONIC";
	Иначе
		deliveryFacts.vetCertificatePresence = "PAPER";
	КонецЕсли;
	
	//Объект содержит сведения о соответствии фактических сведений о партии тем, что указано в ВСД.
	docInspection  = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, deliveryFacts, "docInspection");
	
	docresponsible = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, docInspection, "responsible");
	docInspection.responsible = docresponsible;
	docInspection.result = Выборка.РезультатСоответствия;
	
	deliveryFacts.docInspection = docInspection;
	
	//Объект содержит сведения о ветеринарном контроле входящей партии гос. ветврачом.
	vetInspection = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, deliveryFacts, "vetInspection");
	vetresponsible = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, vetInspection, "responsible");
	vetInspection.responsible = vetresponsible;
	vetInspection.result = Выборка.ЗаключениеВетеринара;
	
	deliveryFacts.vetInspection = vetInspection;
	
	ОбъектЗаявки.deliveryFacts  = deliveryFacts;
	
КонецПроцедуры

Процедура ЗаполнитьЗапросВозвратВСД(ВнутренняяФабрикаXDTO, ОбъектЗаявки, ДанныеДляВыгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МеркурийВСД.Отправитель.Код КАК Получатель,
	|	МеркурийВСД.ПредприятиеОтправитель.Код КАК ПредприятиеПолучатель,
	|	МеркурийВСД.Получатель.Код КАК Отправитель,
	|	МеркурийВСД.ПредприятиеПолучатель.Код КАК ПредприятиеОтправитель,
	|	МеркурийВСД.СерияТТН КАК СерияТТН,
	|	МеркурийВСД.НомерТТН КАК НомерТТН,
	|	МеркурийВСД.ДатаТТН КАК ДатаТТН,
	|	МеркурийВСД.ТипТТН КАК ТипТТН,
	|	МеркурийВСД.Посредник.Код КАК Посредник,
	|	МеркурийВСД.ТранспортноеСредство.ТипТС КАК ТипТС,
	|	МеркурийВСД.ТранспортноеСредство.НомерТС КАК НомерТС,
	|	МеркурийВСД.НомерКонтейнера КАК НомерКонтейнера,
	|	МеркурийВСД.Прицеп.НомерТС КАК НомерПрицепа,
	|	МеркурийВСД.СпособХранения КАК СпособХранения,
	|	ВЫБОР
	|		КОГДА МеркурийВСД.Продукция.НеЗарегистрирована ТОГДА
	|			""""
	|		ИНАЧЕ
	|			МеркурийВСД.Продукция.Код
	|	КОНЕЦ КАК КодПродукции,
	//|	МеркурийВСД.Продукция.Код КАК КодПродукции,
	//|	МеркурийВСД.Продукция.ИдентификаторЗаписи КАК ИдентификаторПродукции,
	|	ВЫБОР
	|		КОГДА МеркурийВСД.Продукция.НеЗарегистрирована ТОГДА
	|			""""
	|		ИНАЧЕ
	|			МеркурийВСД.Продукция.ИдентификаторЗаписи
	|	КОНЕЦ КАК ИдентификаторПродукции,
	|	МеркурийВСД.ПродукцияСтрокой КАК НаименованиеПродукта,
	//|	МеркурийВСД.ПродуктОригинал.Код КАК КодПродукцииОригинал,
	|	МеркурийВСД.ВидПродукции.ТипПродукции.Код КАК ТипПродукции,
	|	МеркурийВСД.ВидПродукции.Родитель.Код КАК Продукция,
	|	МеркурийВСД.ВидПродукции.Код КАК ВидПродукции,
	|	МеркурийВСД.Количество,
	|	МеркурийВСД.ЕдиницаИзмерения.Код КАК ЕдиницаИзмерения,
	|	МеркурийВСД.КоличествоУпаковок,
	|	МеркурийВСД.ДатаВыработки,
	|	МеркурийВСД.ДатаВыработкиПо,
	|	МеркурийВСД.СрокГодности,
	|	МеркурийВСД.СрокГодностиПо,
	|	МеркурийВСД.Скоропортящаяся,
	|	МеркурийВСД.СтранаПроисхождения.Код КАК СтранаПроисхождения,
	|	МеркурийВСД.СтранаПроисхождения.Наименование КАК СтранаПроисхожденияНаименование,
	|	МеркурийВСД.Некачественный,
	|	МеркурийВСД.Ссылка КАК ВСД,
	|	МеркурийВСД.Упаковки.(
	|		Упаковка.Код КАК Упаковка,
	|		КоличествоУпаковок,
	|		УровеньУпаковки,
	|		ИдентификаторСтроки,
	|	) КАК Упаковки,
	//|	МеркурийВСД.Производители.(
	//|		Производитель.Код КАК Производитель,
	//|		РольПроизводителя
	//|	) КАК Производители,
	|	МеркурийВСД.ПунктыПерегрузки.(
	|		НазваниеПункта,
	|		ТранспортноеСредство.ТипТС КАК ТипТС,
	|		ТранспортноеСредство.НомерТС КАК НомерТС,
	|		Прицеп.НомерТС КАК НомерПрицепа,
	|		НомерКонтейнера
	|	) КАК ПунктыПерегрузки,
	|	МеркурийВСД.Маркировка.(
	|		Маркировка,
	|		ТипМаркировки,
	|		ИдентификаторСтроки
	|	) КАК Маркировка,
	|	""RETURN_ALL"" КАК РешениеПринятияПартии,
	|	""UNSUPERVISED"" КАК РезультатСоответствия,
	|	""UNSUPERVISED"" ЗаключениеВетеринара
	|ИЗ
	|	Документ.ВСДВЕТИС КАК МеркурийВСД
	|ГДЕ
	|	МеркурийВСД.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДляВыгрузки.Объект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Упаковки   = Выборка.Упаковки.Выгрузить();
	Маркировка = Выборка.Маркировка.Выгрузить();
	
	returnedDelivery = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗаявки, "returnedDelivery");
	returnedDelivery.deliveryDate = Выборка.ДатаТТН;
	
	// Получатель
	consignee = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, returnedDelivery, "consignee");
	ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, consignee, Выборка.Получатель, Выборка.ПредприятиеПолучатель);
	
	// Отправитель
	consignor = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, returnedDelivery, "consignor");
	ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, consignor, Выборка.Отправитель, Выборка.ПредприятиеОтправитель);
	
	returnedDelivery.consignee    = consignee;
	returnedDelivery.consignor    = consignor;
	returnedDelivery.deliveryDate = ТекущаяДата();
	
	accompanyingForms = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, returnedDelivery, "accompanyingForms");
	
	Если ЗначениеЗаполнено(Выборка.ТипТТН) Тогда
		waybill = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, accompanyingForms, "waybill");
		Если ЗначениеЗаполнено(Выборка.СерияТТН) Тогда
			waybill.issueSeries = Выборка.СерияТТН;
		КонецЕсли;
		waybill.issueDate   = Выборка.ДатаТТН;
		waybill.issueNumber = Выборка.НомерТТН;
		waybill.type        = Перечисления.ТипыДокументовВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.ТипТТН);
		accompanyingForms.waybill = waybill;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.СпособХранения) Тогда
		returnedDelivery.transportStorageType = Перечисления.СпособыХраненияВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.СпособХранения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Посредник) Тогда
		// Получатель
		broker = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, returnedDelivery, "broker");
		broker.guid = Выборка.Посредник;
		
		returnedDelivery.broker = broker;
	КонецЕсли;
	
	ПунктыПерегрузки = Выборка.ПунктыПерегрузки.Выгрузить();
	Если ПунктыПерегрузки.Количество() > 0 Тогда
		
		cargoReloadingPointList = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, returnedDelivery, "ShipmentRoute");
		
		Для Каждого ТекущийПунктПерегрузки ИЗ ПунктыПерегрузки Цикл
			
			cargoReloadingPoint = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, cargoReloadingPointList.routePoint);
			location = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, cargoReloadingPoint, "location");
			location.name = ТекущийПунктПерегрузки.НазваниеПункта;
			address = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, location, "address");
			
			Если ЗначениеЗаполнено(ТекущийПунктПерегрузки.Страна) Тогда
				country = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, address, "country");
				country.guid = ТекущийПунктПерегрузки.Страна;
				address.country=country;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекущийПунктПерегрузки.Регион) Тогда
				region = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, address, "region");
				region.guid = ТекущийПунктПерегрузки.Регион;
				address.region=region;
			КонецЕсли;
			
			addressView = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, address, "addressView");
			addressView = ТекущийПунктПерегрузки.НазваниеПункта;
			address.addressView = addressView;
			location.address = address;
			
			cargoReloadingPoint.location = location;// Название пункта перегрузки.
			
			cargoReloadingPoint.transshipment = ТекущийПунктПерегрузки.СПерегрузкой;
			
			cargoReloadingPoint.sqnId = ТекущийПунктПерегрузки.НомерСтроки;
			Если ЗначениеЗаполнено(ТекущийПунктПерегрузки.Предприятие) Тогда
				Enterprise = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, cargoReloadingPoint, "enterprise");
				Enterprise.guid = ТекущийПунктПерегрузки.Предприятие;
				cargoReloadingPoint.enterprise = Enterprise;
			КонецЕсли;
			
			nextTransport = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, cargoReloadingPoint, "nextTransport"); // Сведения о дальнейшем транспорте.
			ЗаполнитьИнформациюПоТранспорту(ВнутренняяФабрикаXDTO, nextTransport, ТекущийПунктПерегрузки);
			
			cargoReloadingPoint.nextTransport = nextTransport;
			
			cargoReloadingPointList.routePoint.Добавить(cargoReloadingPoint);
			
		КонецЦикла;
		
		returnedDelivery.ShipmentRoute = cargoReloadingPointList;
	КонецЕсли;
	
	transportInfo = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, returnedDelivery, "transportInfo");
	
	ЗаполнитьИнформациюПоТранспорту(ВнутренняяФабрикаXDTO, transportInfo, Выборка);
	
	returnedDelivery.transportInfo = transportInfo;
	
	consignment = ПолучитьЭлементConsignment(ВнутренняяФабрикаXDTO, Выборка, returnedDelivery.consignment, Упаковки, Маркировка);
	returnedDelivery.consignment.Добавить(consignment);
	
	vetCertificate = ПолучитьВетСертификат(ВнутренняяФабрикаXDTO, Выборка.ВСД, accompanyingForms.vetCertificate, , Истина);
	
	accompanyingForms.vetCertificate.Добавить(vetCertificate);
	
	returnedDelivery.accompanyingForms = accompanyingForms;
	
	ОбъектЗаявки.returnedDelivery = returnedDelivery;
	
	delivery = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗаявки, "delivery");
	
	accompanyingForms = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "accompanyingForms");
	
	Если ЗначениеЗаполнено(Выборка.ТипТТН) Тогда
		waybill = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, accompanyingForms, "waybill");
		waybill.issueDate   = Выборка.ДатаТТН;
		waybill.issueNumber = Выборка.НомерТТН;
		waybill.issueSeries = Выборка.СерияТТН;
		waybill.type        = Перечисления.ТипыДокументовВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.ТипТТН);
		
		accompanyingForms.waybill = waybill;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.СпособХранения) Тогда
		delivery.transportStorageType = Перечисления.СпособыХраненияВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.СпособХранения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Посредник) Тогда
		// Получатель
		broker = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "broker");
		broker.guid = Выборка.Посредник;
		delivery.broker = broker;
	КонецЕсли;
	
	АвтомобильПоФакту = Новый Структура;
	АвтомобильПоФакту.Вставить("ТипТС",           Выборка.ТипТС);
	АвтомобильПоФакту.Вставить("НомерТС",         Выборка.НомерТС);
	АвтомобильПоФакту.Вставить("НомерПрицепа",    Выборка.НомерПрицепа);
	АвтомобильПоФакту.Вставить("НомерКонтейнера", Выборка.НомерКонтейнера);
	
	ПунктыПерегрузки = Выборка.ПунктыПерегрузки.Выбрать();
	Если ПунктыПерегрузки.Количество() > 0 Тогда
		
		Пока ПунктыПерегрузки.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(ПунктыПерегрузки.ТипТС) Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(АвтомобильПоФакту, ПунктыПерегрузки);
			
		КонецЦикла;
		
	КонецЕсли;
	
	transportInfo = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "transportInfo");
	
	ЗаполнитьИнформациюПоТранспорту(ВнутренняяФабрикаXDTO, transportInfo, АвтомобильПоФакту);
	delivery.transportInfo = transportInfo;
	
	ЭлектронныйВСД = Ложь;
	
	//consignment = ПолучитьЭлементConsignment(Выборка, delivery.consignment, Упаковки, Маркировка);
	//delivery.consignment.Добавить(consignment);
	
	vetCertificate = ПолучитьВетСертификат(ВнутренняяФабрикаXDTO, Выборка.ВСД, accompanyingForms.vetCertificate);
	accompanyingForms.vetCertificate.Добавить(vetCertificate);
	
	ЭлектронныйВСД = (НЕ ПустаяСтрока(Выборка.ВСД.Идентификатор));
	
	// Получатель
	consignee = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "consignee");
	ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, consignee, Выборка.Получатель, Выборка.ПредприятиеПолучатель);
	
	// Отправитель
	consignor = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "consignor");
	ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, consignor, Выборка.Отправитель, Выборка.ПредприятиеОтправитель);
	
	delivery.accompanyingForms = accompanyingForms;
	delivery.consignee    = consignee;
	delivery.consignor    = consignor;
	delivery.deliveryDate = ТекущаяДата();
	
	ОбъектЗаявки.delivery = delivery;
	//
	//Объект содержит обобщенные сведения о результате приема партии продукции или группы животных.
	deliveryFacts = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗаявки, "deliveryFacts");
	//Принятое решение о приёме входной партии.
	deliveryFacts.decision = Выборка.РешениеПринятияПартии;
	
	ЭлектронныйВСД = (НЕ ПустаяСтрока(Выборка.ВСД.Идентификатор));
	
	// Природа ВСД (электронный или бумажный).
	Если ЭлектронныйВСД Тогда
		deliveryFacts.vetCertificatePresence = "ELECTRONIC";
	Иначе
		deliveryFacts.vetCertificatePresence = "PAPER";
	КонецЕсли;
	
	//Объект содержит сведения о соответствии фактических сведений о партии тем, что указано в ВСД.
	docInspection  = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, deliveryFacts, "docInspection");
	
	docresponsible = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, docInspection, "responsible");
	docInspection.responsible = docresponsible;
	docInspection.result = Выборка.РезультатСоответствия;
	
	deliveryFacts.docInspection = docInspection;
	
	//Объект содержит сведения о ветеринарном контроле входящей партии гос. ветврачом.
	vetInspection = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, deliveryFacts, "vetInspection");
	vetresponsible = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, vetInspection, "responsible");
	vetInspection.responsible = vetresponsible;
	vetInspection.result = Выборка.ЗаключениеВетеринара;
	
	deliveryFacts.vetInspection = vetInspection;
	
	ОбъектЗаявки.deliveryFacts  = deliveryFacts;
	
КонецПроцедуры

Процедура ЗаполнитьЗапросПакетноеГашениеВСД(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МеркурийВСД.Отправитель.Код КАК Отправитель,
	|	МеркурийВСД.ПредприятиеОтправитель.Код КАК ПредприятиеОтправитель,
	|	МеркурийВСД.Получатель.Код КАК Получатель,
	|	МеркурийВСД.ПредприятиеПолучатель.Код КАК ПредприятиеПолучатель,
	|	МеркурийВСД.СерияТТН КАК СерияТТН,
	|	МеркурийВСД.НомерТТН КАК НомерТТН,
	|	МеркурийВСД.ДатаТТН КАК ДатаТТН,
	|	МеркурийВСД.ТипТТН КАК ТипТТН,
	|	МеркурийВСД.Посредник.Код КАК Посредник,
	|	МеркурийВСД.ТранспортноеСредство.ТипТС КАК ТипТС,
	|	МеркурийВСД.ТранспортноеСредство.НомерТС КАК НомерТС,
	|	МеркурийВСД.НомерКонтейнера КАК НомерКонтейнера,
	|	МеркурийВСД.Прицеп.НомерТС КАК НомерПрицепа,
	|	МеркурийВСД.СпособХранения КАК СпособХранения,
	|	ВЫБОР
	|		КОГДА МеркурийВСД.Продукция.НеЗарегистрирована ТОГДА
	|			""""
	|		ИНАЧЕ
	|			МеркурийВСД.Продукция.Код
	|	КОНЕЦ КАК КодПродукции,
	//|	МеркурийВСД.Продукция.Код КАК КодПродукции,
	//|	МеркурийВСД.Продукция.ИдентификаторЗаписи КАК ИдентификаторПродукции,
	|	ВЫБОР
	|		КОГДА МеркурийВСД.Продукция.НеЗарегистрирована ТОГДА
	|			""""
	|		ИНАЧЕ
	|			МеркурийВСД.Продукция.ИдентификаторЗаписи
	|	КОНЕЦ КАК ИдентификаторПродукции,
	|	МеркурийВСД.ПродукцияСтрокой КАК НаименованиеПродукции,
	|	МеркурийВСД.ВидПродукции.ТипПродукции.Код КАК ТипПродукции,
	|	МеркурийВСД.ВидПродукции.Родитель.Код КАК Продукция,
	|	МеркурийВСД.ВидПродукции.Код КАК ВидПродукции,
	|	МеркурийВСД.Количество,
	|	МеркурийВСД.ЕдиницаИзмерения.Код КАК ЕдиницаИзмерения,
	|	МеркурийВСД.КоличествоУпаковок,
	|	МеркурийВСД.ДатаВыработки,
	|	МеркурийВСД.ДатаВыработкиПо,
	|	МеркурийВСД.СрокГодности,
	|	МеркурийВСД.СрокГодностиПо,
	|	МеркурийВСД.Скоропортящаяся,
	|	МеркурийВСД.СтранаПроисхождения.Код КАК СтранаПроисхождения,
	|	МеркурийВСД.СтранаПроисхождения.Наименование КАК СтранаПроисхожденияНаименование,
	|	МеркурийВСД.Некачественный,
	|	МеркурийВСД.Ссылка КАК ВСД,
	|	МеркурийВСД.Упаковки.(
	|		Упаковка.Код КАК Упаковка,
	|		КоличествоУпаковок,
	|		УровеньУпаковки,
	|		ИдентификаторСтроки,
	|	) КАК Упаковки,
	//|	МеркурийВСД.Производители.(
	//|		Производитель.Код КАК Производитель,
	//|		РольПроизводителя
	//|	) КАК Производители,
	|	МеркурийВСД.ПунктыПерегрузки.(
	|		НазваниеПункта,
	|		ТранспортноеСредство.ТипТС КАК ТипТС,
	|		ТранспортноеСредство.НомерТС КАК НомерТС,
	|		Прицеп.НомерТС КАК НомерПрицепа,
	|		НомерКонтейнера
	|	) КАК ПунктыПерегрузки,
	|	МеркурийВСД.Маркировка.(
	|		Маркировка,
	|		ТипМаркировки,
	|		ИдентификаторСтроки
	|	) КАК Маркировка,
	|	""ACCEPT_ALL"" КАК РешениеПринятияПартии,
	|	""UNSUPERVISED"" КАК РезультатСоответствия,
	|	""UNSUPERVISED"" ЗаключениеВетеринара
	|ИЗ
	|	Документ.ВСДВЕТИС КАК МеркурийВСД
	|ГДЕ
	|	МеркурийВСД.Ссылка В (&Ссылка)
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеДляВыгрузки.СписокВСД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Упаковки   = Выборка.Упаковки.Выгрузить();
		Маркировка = Выборка.Маркировка.Выгрузить();
		
		delivery = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "delivery");
		
		accompanyingForms = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "accompanyingForms");
		
		Если ЗначениеЗаполнено(Выборка.ТипТТН) Тогда
			waybill = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, accompanyingForms, "waybill");
			waybill.issueDate   = Выборка.ДатаТТН;
			waybill.issueNumber = Выборка.НомерТТН;
			waybill.issueSeries = Выборка.СерияТТН;
			waybill.type        = Перечисления.ТипыДокументовВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.ТипТТН);
			
			accompanyingForms.waybill = waybill;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.СпособХранения) Тогда
			delivery.transportStorageType = Перечисления.СпособыХраненияВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.СпособХранения);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Посредник) Тогда
			// Получатель
			broker = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "broker");
			broker.guid = Выборка.Посредник;
			delivery.broker = broker;
		КонецЕсли;
		
		АвтомобильПоФакту = Новый Структура;
		АвтомобильПоФакту.Вставить("ТипТС",           Выборка.ТипТС);
		АвтомобильПоФакту.Вставить("НомерТС",         Выборка.НомерТС);
		АвтомобильПоФакту.Вставить("НомерПрицепа",    Выборка.НомерПрицепа);
		АвтомобильПоФакту.Вставить("НомерКонтейнера", Выборка.НомерКонтейнера);
		
		ПунктыПерегрузки = Выборка.ПунктыПерегрузки.Выбрать();
		Если ПунктыПерегрузки.Количество() > 0 Тогда
			
			//	cargoReloadingPointList = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(waybill, "cargoReloadingPointList");
			
			Пока ПунктыПерегрузки.Следующий() Цикл
				
				Если Не ЗначениеЗаполнено(ПунктыПерегрузки.ТипТС) Тогда
					Продолжить;
				КонецЕсли;
				
				//		cargoReloadingPoint = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(cargoReloadingPointList.cargoReloadingPoint);
				//		cargoReloadingPoint.name = ПунктыПерегрузки.НазваниеПункта;// Название пункта перегрузки.
				//		
				//		nextTransport = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(cargoReloadingPoint, "nextTransport"); // Сведения о дальнейшем транспорте.
				//		ЗаполнитьИнформациюПоТранспорту(nextTransport, ПунктыПерегрузки);
				//		
				//		cargoReloadingPoint.nextTransport = nextTransport;
				//		
				//		cargoReloadingPointList.cargoReloadingPoint.Добавить(cargoReloadingPoint);
				//		
				ЗаполнитьЗначенияСвойств(АвтомобильПоФакту, ПунктыПерегрузки);
				
			КонецЦикла;
			
			//	waybill.cargoReloadingPointList = cargoReloadingPointList;
		КонецЕсли;
		
		transportInfo = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "transportInfo");
		
		ЗаполнитьИнформациюПоТранспорту(ВнутренняяФабрикаXDTO, transportInfo, АвтомобильПоФакту);
		delivery.transportInfo = transportInfo;
		
		ЭлектронныйВСД = Ложь;
		
		//consignment = ПолучитьЭлементConsignment(Выборка, delivery.consignment, Упаковки, Маркировка);
		//
		//delivery.consignment.Добавить(consignment);
		
		vetCertificate = ПолучитьВетСертификат(ВнутренняяФабрикаXDTO, Выборка.ВСД, accompanyingForms.vetCertificate);
		accompanyingForms.vetCertificate.Добавить(vetCertificate);
		
		ЭлектронныйВСД = (НЕ ПустаяСтрока(Выборка.ВСД.Идентификатор));
		
		// Получатель
		consignee = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "consignee");
		ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, consignee, Выборка.Получатель, Выборка.ПредприятиеПолучатель);
		
		// Отправитель
		consignor = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, delivery, "consignor");
		ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, consignor, Выборка.Отправитель, Выборка.ПредприятиеОтправитель);
		
		delivery.accompanyingForms = accompanyingForms;
		delivery.consignee    = consignee;
		delivery.consignor    = consignor;
		delivery.deliveryDate = ТекущаяДата();
		
		ОбъектЗапроса.delivery = delivery;
		
		//Объект содержит обобщенные сведения о результате приема партии продукции или группы животных.
		deliveryFacts = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "deliveryFacts");
		//Принятое решение о приёме входной партии.
		deliveryFacts.decision = Выборка.РешениеПринятияПартии;
		
		// Природа ВСД (электронный или бумажный).
		Если ЭлектронныйВСД Тогда
			deliveryFacts.vetCertificatePresence = "ELECTRONIC";
		Иначе
			deliveryFacts.vetCertificatePresence = "PAPER";
		КонецЕсли;
		
		//Объект содержит сведения о соответствии фактических сведений о партии тем, что указано в ВСД.
		docInspection  = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, deliveryFacts, "docInspection");
		
		docresponsible = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, docInspection, "responsible");
		docInspection.responsible = docresponsible;
		//docInspection.result = Выборка.РезультатСоответствия;
		docInspection.result = "CORRESPONDS";
		
		deliveryFacts.docInspection = docInspection;
		
		//Объект содержит сведения о ветеринарном контроле входящей партии гос. ветврачом.
		vetInspection = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, deliveryFacts, "vetInspection");
		vetresponsible = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, vetInspection, "responsible");
		vetInspection.responsible = vetresponsible;
		//vetInspection.result = Выборка.ЗаключениеВетеринара;
		vetInspection.result = "CORRESPONDS";
		
		deliveryFacts.vetInspection = vetInspection;
		
		ОбъектЗапроса.deliveryFacts  = deliveryFacts;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЗапросЗаписейСкладскогоЖурнала(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	listOptions = ПолучитьListOptions(ВнутренняяФабрикаXDTO);
	listOptions.count  = ДанныеДляВыгрузки.КоличествоЭлементов;
	listOptions.offset = ДанныеДляВыгрузки.Смещение;
	
	ОбъектЗапроса.listOptions         = listOptions;
	ОбъектЗапроса.enterpriseGuid      = ДанныеДляВыгрузки.guidПредприятия;
	
	//ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("offset", listOptions.offset);
	//ДополнительныеПараметры.Вставить("count", listOptions.count);
	
	Если ДанныеДляВыгрузки.Свойство("ВсеЗаписи") Тогда
		
		//Если ДанныеДляВыгрузки.ВсеЗаписи = 0 Тогда
		searchPattern = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "searchPattern");
		//searchPattern = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса.searchPattern);
		Если ДанныеДляВыгрузки.ВсеЗаписи = 1 Тогда
			searchPattern.blankFilter = "BLANK";
		ИначеЕсли ДанныеДляВыгрузки.ВсеЗаписи = 2 Тогда
			searchPattern.blankFilter = "NOT_BLANK";
		Иначе
			searchPattern.blankFilter = "ALL";
		КонецЕсли;
		//ОбъектЗапроса.searchPattern.Добавить(searchPattern);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗапросНаРегистрациюИзменениеПродукции(ВнутренняяФабрикаXDTO, ОбъектЗапроса, ДанныеДляВыгрузки)
	
	modificationOperation = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектЗапроса, "modificationOperation");
	
	modificationOperation.type = ДанныеДляВыгрузки.ТипОперации;
	
	Если ДанныеДляВыгрузки.ТипОперации = "DELETE" Тогда
		affectedList = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, modificationOperation, "affectedList");
		
		productItem = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, affectedList.productItem);
		productItem.UUID = ДанныеДляВыгрузки.Продукция;
		productItem.code             = ДанныеДляВыгрузки.Артикул;
		productItem.name             = ДанныеДляВыгрузки.Наименование;
		productItem.correspondsToGost = ДанныеДляВыгрузки.СоответствуетГОСТу;
		productItem.gost             = ДанныеДляВыгрузки.ГОСТ;
		
		productItem.productType = ДанныеДляВыгрузки.ТипПродукции;
		
		product     = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, productItem, "product");
		product.guid = ДанныеДляВыгрузки.Продукция;
		
		subProduct  = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, productItem, "subProduct");
		subProduct.guid = ДанныеДляВыгрузки.ВидПродукции;
		
		productItem.product    = product;
		productItem.subProduct = subProduct;
		
		producing = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, productItem, "producing");
		location = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, producing, "location");
		location.guid = ДанныеДляВыгрузки.guidПредприятия;
		producing.location = location;
		
		productItem.producing.Добавить(producing);
		
		affectedList.productItem.Добавить(productItem);
		
		affectedList.count  = 1;
		affectedList.offset = 0;
		affectedList.total  = 1;
		
		modificationOperation.affectedList = affectedList;
	Иначе
		resultingList = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, modificationOperation, "resultingList");
		
		productItem = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, resultingList.productItem);
		Если НЕ ДанныеДляВыгрузки.ТипОперации = "CREATE" Тогда
			productItem.UUID = ДанныеДляВыгрузки.Продукт;
		КонецЕсли;
		productItem.code             = ДанныеДляВыгрузки.Артикул;
		productItem.name             = ДанныеДляВыгрузки.Наименование;
		productItem.correspondsToGost = ДанныеДляВыгрузки.СоответствуетГОСТу;
		productItem.gost             = ДанныеДляВыгрузки.ГОСТ;
		
		Если ЗначениеЗаполнено(ДанныеДляВыгрузки.GTIN) Тогда
			productItem.globalID         = ДанныеДляВыгрузки.GTIN;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеДляВыгрузки.ВладелецМарки) Тогда
			tmOwner      = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, productItem, "tmOwner");
			tmOwner.guid = ДанныеДляВыгрузки.ВладелецМарки.Код;
			productItem.tmOwner = tmOwner;
		КонецЕсли;
		
		productItem.productType = ДанныеДляВыгрузки.ТипПродукции;
		
		producer      = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, productItem, "producer");
		producer.guid = ДанныеДляВыгрузки.ХозяйствующийСубъект.Код;
		productItem.producer = producer;
		
		product     = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, productItem, "product");
		product.guid = ДанныеДляВыгрузки.Продукция;
		
		subProduct  = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, productItem, "subProduct");
		subProduct.guid = ДанныеДляВыгрузки.ВидПродукции;
		
		productItem.product    = product;
		productItem.subProduct = subProduct;
		
		Для Каждого СтрокаПлощадки ИЗ ДанныеДляВыгрузки.Площадки Цикл
			producing = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, productItem, "producing");
			location = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, producing, "location");
			location.guid = СтрокаПлощадки.Код;
			producing.location = location;
			productItem.producing.Добавить(producing);
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДанныеДляВыгрузки.ФасовкаУпаковка)
			И ЗначениеЗаполнено(ДанныеДляВыгрузки.ФасовкаЕдиницаИзмерения)
			И ЗначениеЗаполнено(ДанныеДляВыгрузки.ФасовкаКоличествоУпаковок)
			И ЗначениеЗаполнено(ДанныеДляВыгрузки.ФасовкаКоличествоЕдиницВУпаковке) Тогда
			packaging  = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, productItem, "packaging");
			packagingType = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, packaging, "packagingType");
			packagingType.guid = ДанныеДляВыгрузки.ФасовкаУпаковка;
			packaging.packagingType = packagingType;
			unit = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, packaging, "unit");
			unit.guid = ДанныеДляВыгрузки.ФасовкаЕдиницаИзмерения;
			packaging.unit = unit;
			packaging.quantity = ДанныеДляВыгрузки.ФасовкаКоличествоУпаковок;
			packaging.volume = ДанныеДляВыгрузки.ФасовкаКоличествоЕдиницВУпаковке;
			
			productItem.packaging = packaging;
		КонецЕсли;
		
		resultingList.productItem.Добавить(productItem);
		
		resultingList.count  = 1;
		resultingList.offset = 0;
		resultingList.total  = 1;
		
		modificationOperation.resultingList = resultingList;
		
	КонецЕсли;
	
	ОбъектЗапроса.modificationOperation = modificationOperation;
	
КонецПроцедуры

Функция ПолучитьВетСертификат(ВнутренняяФабрикаXDTO, СсылкаВСД, СписокОбъект, ТаблицаУсловияПеремещения = Неопределено, Особое = Ложь)
	
	vetCertificate = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, СписокОбъект);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МеркурийВСД.Форма,
	|	МеркурийВСД.Статус,
	|	МеркурийВСД.Посредник.Код КАК Посредник,
	|	МеркурийВСД.ПроведенаЭкспертиза,
	|	МеркурийВСД.ЭкспертизаРезультат,
	|	МеркурийВСД.ВыполненКонтрольГосВетВрачем,
	|	МеркурийВСД.ФИОВетВрачаОтправителя,
	|	МеркурийВСД.ДолжностьВетВрачаОтправителя,
	|	МеркурийВСД.Отправитель.Код КАК Отправитель,
	|	МеркурийВСД.ПредприятиеОтправитель.Код КАК ПредприятиеОтправитель,
	|	МеркурийВСД.Получатель.Код КАК Получатель,
	|	МеркурийВСД.ПредприятиеПолучатель.Код КАК ПредприятиеПолучатель,
	|	МеркурийВСД.СведенияВСЭ,
	|	МеркурийВСД.СерияВСД,
	|	МеркурийВСД.НомерВСД,
	|	МеркурийВСД.ДатаВСД,
	|	ЕСТЬNULL(МеркурийВСД.БлагополучиеМестности.Наименование, """") КАК БлагополучиеМестности,
	|	МеркурийВСД.НазначениеГруза.Код КАК НазначениеГруза,
	|	МеркурийВСД.ОсобыеОтметки,
	|	МеркурийВСД.ТранспортноеСредство.ТипТС КАК ТипТС,
	|	МеркурийВСД.ТранспортноеСредство.НомерТС КАК НомерТС,
	|	МеркурийВСД.НомерКонтейнера КАК НомерКонтейнера,
	|	МеркурийВСД.Прицеп.НомерТС КАК НомерПрицепа,
	|	МеркурийВСД.СпособХранения,
	|	МеркурийВСД.Идентификатор,
	|	МеркурийВСД.СтранаПроисхождения.Код КАК СтранаПроисхождения,
	|	МеркурийВСД.СтранаПроисхождения.Наименование КАК СтранаПроисхожденияНаименование,
	|	МеркурийВСД.ДатаВыработки,
	|	МеркурийВСД.ДатаВыработкиПо,
	|	МеркурийВСД.ДатаВыработкиСтрокой,
	|	МеркурийВСД.СрокГодности,
	|	МеркурийВСД.СрокГодностиПо,
	|	МеркурийВСД.СрокГодностиСтрокой,
	|	МеркурийВСД.Скоропортящаяся,
	|	МеркурийВСД.Некачественный,
	|	МеркурийВСД.Комментарий,
	|	МеркурийВСД.ПродукцияСтрокой КАК ПродукцияСтрокой,
	|	МеркурийВСД.Продукция.Наименование КАК НаименованиеПродукции,
	|	ВЫБОР
	|		КОГДА МеркурийВСД.Продукция.НеЗарегистрирована ТОГДА
	|			""""
	|		ИНАЧЕ
	|			МеркурийВСД.Продукция.Код
	|	КОНЕЦ КАК КодПродукции,
	//|	МеркурийВСД.Продукция.Код КАК КодПродукции,
	//|	МеркурийВСД.Продукция.ИдентификаторЗаписи КАК ИдентификаторПродукции,
	|	ВЫБОР
	|		КОГДА МеркурийВСД.Продукция.НеЗарегистрирована ТОГДА
	|			""""
	|		ИНАЧЕ
	|			МеркурийВСД.Продукция.ИдентификаторЗаписи
	|	КОНЕЦ КАК ИдентификаторПродукции,
	|	МеркурийВСД.ВидПродукции.ТипПродукции.Код КАК ТипПродукции,
	|	МеркурийВСД.ВидПродукции.Родитель.Код КАК Продукция,
	|	МеркурийВСД.ВидПродукции.Код КАК ВидПродукции,
	|	МеркурийВСД.Количество,
	|	МеркурийВСД.ЕдиницаИзмерения.Код КАК ЕдиницаИзмерения,
	|	МеркурийВСД.КоличествоУпаковок,
	|	МеркурийВСД.Маркировка.(
	|		Маркировка,
	|		ТипМаркировки,
	|		ИдентификаторСтроки
	|	),
	|	МеркурийВСД.ПунктыПерегрузки.(
	|		НазваниеПункта,
	|		ТранспортноеСредство.ТипТС КАК ТипТС,
	|		ТранспортноеСредство.НомерТС КАК НомерТС,
	|		Прицеп.НомерТС КАК НомерПрицепа,
	|		НомерКонтейнера,
	|		Страна.Код КАК Страна,
	|		Регион.Код КАК Регион,
	|		Предприятие.Код КАК Предприятие,
	|		СПерегрузкой КАК СПерегрузкой
	|	),
	|	МеркурийВСД.Производители.(
	|		Производитель.Код КАК Производитель,
	|		Производитель.Наименование КАК ПроизводительНаименование,
	|		РольПроизводителя
	|	),
	|	МеркурийВСД.Упаковки.(
	|		Упаковка.Код КАК Упаковка,
	|		УровеньУпаковки,
	|		КоличествоУпаковок,
	|		ИдентификаторСтроки
	|	),
	|	МеркурийВСД.ПроизводственныеПартии.(
	|		ИдентификаторПартии
	|	),
	|	МеркурийВСД.УсловияПеремещенияПродукции.(
	|		УсловиеПеремещения.Код КАК УсловиеПеремещения
	|	),
	|	МеркурийВСД.СвязанныеДокументы.(
	|		ТипДокумента,
	|		Серия,
	|		Номер,
	|		Дата,
	|		ТипСвязи
	|	)
	|ИЗ
	|	Документ.ВСДВЕТИС КАК МеркурийВСД
	|ГДЕ
	|	МеркурийВСД.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаВСД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат vetCertificate;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Идентификатор) И (НЕ Особое) Тогда
		vetCertificate.UUID = Выборка.Идентификатор;
		Возврат vetCertificate;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.СерияВСД) Тогда
		vetCertificate.issueSeries = Выборка.СерияВСД;
	КонецЕсли;
	vetCertificate.issueNumber = Выборка.НомерВСД;
	vetCertificate.issueDate   = Выборка.ДатаВСД;
	Если ЗначениеЗаполнено(Выборка.Форма) Тогда
		vetCertificate.vetDForm    = Перечисления.ФормыВСДВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.Форма);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ПредприятиеОтправитель) Тогда
		
		certifiedConsignment = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, vetCertificate, "certifiedConsignment");
		
		// Получатель
		consignee = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, certifiedConsignment, "consignee");
		ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, consignee, Выборка.Получатель, Выборка.ПредприятиеПолучатель);
		
		// Отправитель
		consignor = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, certifiedConsignment, "consignor");
		ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, consignor, Выборка.Отправитель, Выборка.ПредприятиеОтправитель);
		
		transportInfo = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, certifiedConsignment, "transportInfo");
		
		ЗаполнитьИнформациюПоТранспорту(ВнутренняяФабрикаXDTO, transportInfo, Выборка);
		
		certifiedConsignment.consignor     = consignor;
		certifiedConsignment.consignee     = consignee;
		certifiedConsignment.transportInfo = transportInfo;
		Если ЗначениеЗаполнено(Выборка.СпособХранения) Тогда
			certifiedConsignment.transportStorageType = Перечисления.СпособыХраненияВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.СпособХранения);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Посредник) Тогда
			// Получатель
			broker = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, certifiedConsignment, "broker");
			broker.guid = Выборка.Посредник;
			certifiedConsignment.broker = broker;
		КонецЕсли;
		
		certifiedConsignment.batch = Получитьbatch(ВнутренняяФабрикаXDTO, certifiedConsignment, Выборка);
		
		vetCertificate.certifiedConsignment = certifiedConsignment;
		
	КонецЕсли;
	
	authentication = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, vetCertificate, "authentication");
	
	purpose = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, authentication, "purpose");
	Если ЗначениеЗаполнено(Выборка.НазначениеГруза) Тогда
		purpose.guid = Выборка.НазначениеГруза;
	КонецЕсли;
	authentication.purpose     = purpose;
	
	authentication.cargoInspected  = Выборка.ВыполненКонтрольГосВетВрачем;
	Если ЗначениеЗаполнено(Выборка.ЭкспертизаРезультат) Тогда
		ЭкспертизаРезультат = Выборка.ЭкспертизаРезультат;
	Иначе
		ЭкспертизаРезультат = Перечисления.РезультатыИсследованияВЕТИС.UNFULFILLED;
	КонецЕсли;
	authentication.cargoExpertized = Перечисления.РезультатыИсследованияВЕТИС.ПолучитьЗначениеВЕТИС(ЭкспертизаРезультат);
	Если ЗначениеЗаполнено(Выборка.БлагополучиеМестности) Тогда
		authentication.locationProsperity   = Выборка.БлагополучиеМестности;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.СведенияВСЭ) Тогда
		laboratoryResearch = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, authentication.laboratoryResearch);
		expertiseID = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, laboratoryResearch, "expertiseID");
		expertiseID = Выборка.СведенияВСЭ;
		laboratoryResearch.expertiseID = expertiseID;
		authentication.laboratoryResearch.Добавить(laboratoryResearch);
	КонецЕсли;
	
	//"Местность благополучна";
	Если ЗначениеЗаполнено(Выборка.ОсобыеОтметки) Тогда
		ЧастьОтметки = Лев(Выборка.ОсобыеОтметки, 50);
		Если Найти(Выборка.Комментарий, ЧастьОтметки) = 1 Тогда
			authentication.specialMarks = Выборка.Комментарий;
		Иначе
			authentication.specialMarks = Выборка.ОсобыеОтметки;
		КонецЕсли;
	КонецЕсли;
	
	Если ТаблицаУсловияПеремещения = Неопределено Тогда
		ТаблицаУсловияПеремещения = Выборка.УсловияПеремещенияПродукции.Выгрузить();
	КонецЕсли;
	
	Для каждого НайденноеУсловие Из ТаблицаУсловияПеремещения Цикл
		r13nClause = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, authentication.r13nClause);
		condition = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, r13nClause, "condition");
		condition.guid = НайденноеУсловие.УсловиеПеремещения;
		r13nClause.condition = condition;
		authentication.r13nClause.Добавить(r13nClause);
	КонецЦикла;
	
	vetCertificate.authentication = authentication;
	
	//Если Особое Тогда
	//	Возврат vetCertificate;
	//КонецЕсли;
	
	//vetCertificate.confirmedBy    = confirmedBy;
	//vetCertificate.confirmedDate  = ТекущаяДата();
	
	statusChange = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, vetCertificate.statusChange);
	
	specifiedPerson = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, statusChange, "specifiedPerson");
	specifiedPerson.fio  = Выборка.ФИОВетВрачаОтправителя;
	specifiedPerson.post = Выборка.ДолжностьВетВрачаОтправителя;
	
	statusChange.specifiedPerson = specifiedPerson;
	statusChange.status          = Перечисления.СтатусыВСДВЕТИС.ПолучитьЗначениеВЕТИС(Выборка.Статус);
	statusChange.actualDateTime  = Выборка.ДатаВСД;
	
	vetCertificate.statusChange.Добавить(statusChange);
	
	Возврат vetCertificate;
	
КонецФункции

Функция ПолучитьЭлементConsignment(ВнутренняяФабрикаXDTO, ТоварнаяСтрока, СписокОбъект, Упаковки, Маркировка, Знач Количество = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МеркурийВСД.ДатаВыработкиСтрокой,
	|	МеркурийВСД.СрокГодностиСтрокой,
	|	МеркурийВСД.ПродукцияСтрокой,
	|	МеркурийВСД.ИдентификаторЗаписиПродукции,
	|	МеркурийВСД.СоставДатыВыработкиС,
	|	МеркурийВСД.СоставДатыВыработкиПо,
	|	МеркурийВСД.СоставСрокаГодностиС,
	|	МеркурийВСД.СоставСрокаГодностиПо
	|ИЗ
	|	Документ.ВСДВЕТИС КАК МеркурийВСД
	|ГДЕ
	|	МеркурийВСД.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	МеркурийВСДПроизводители.Производитель.Код КАК Производитель,
	|	МеркурийВСДПроизводители.Производитель.Наименование КАК ПроизводительНаименование,
	|	МеркурийВСДПроизводители.РольПроизводителя
	|ИЗ
	|	Документ.ВСДВЕТИС.Производители КАК МеркурийВСДПроизводители
	|ГДЕ
	|	МеркурийВСДПроизводители.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	ПроизводственныеПартии.ИдентификаторПартии
	|ИЗ
	|	Документ.ВСДВЕТИС.ПроизводственныеПартии КАК ПроизводственныеПартии
	|ГДЕ
	|	ПроизводственныеПартии.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ТоварнаяСтрока.ВСД);
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	Выборка       = ПакетЗапросов[0].Выбрать();
	Производители = ПакетЗапросов[1].Выбрать();
	ПроизводственныеПартии = ПакетЗапросов[2].Выбрать();
	
	Выборка.Следующий();
	
	Если Количество = Неопределено Тогда
		Количество = ТоварнаяСтрока.Количество;
	Иначе
		Количество = Количество;
	КонецЕсли;
	
	consignment = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, СписокОбъект);
	
	product = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, consignment, "product");
	product.guid = ТоварнаяСтрока.Продукция;
	
	productItem = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, consignment, "productItem");
	Если ЗначениеЗаполнено(ТоварнаяСтрока.КодПродукции) Тогда
		//Если ЗначениеЗаполнено(Выборка.ИдентификаторЗаписиПродукции) Тогда
			//productItem.uuid = Выборка.ИдентификаторЗаписиПродукции;
		//Иначе
			productItem.guid = ТоварнаяСтрока.КодПродукции;
			//Если ЗначениеЗаполнено(Выборка.ПродукцияСтрокой) Тогда
			//	productItem.name = Выборка.ПродукцияСтрокой;
			//Иначе
			productItem.name = ТоварнаяСтрока.НаименованиеПродукции;
			//КонецЕсли;
			//productItem.uuid = ТоварнаяСтрока.ИдентификаторПродукции;
		//КонецЕсли;
	Иначе
		productItem.name = Выборка.ПродукцияСтрокой;
	КонецЕсли;
	
	subProduct = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, consignment, "subProduct");
	subProduct.guid = ТоварнаяСтрока.ВидПродукции;
	
	unit = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, consignment, "unit");
	unit.guid = ТоварнаяСтрока.ЕдиницаИзмерения;
	
	dateOfProduction = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, consignment, "dateOfProduction");
	
	Если ЗначениеЗаполнено(ТоварнаяСтрока.ДатаВыработки) Тогда
		ЗаполнитьПериодXDTO(ВнутренняяФабрикаXDTO, dateOfProduction, ТоварнаяСтрока.ДатаВыработки, ТоварнаяСтрока.ДатаВыработкиПо, Выборка.СоставДатыВыработкиС, Выборка.СоставДатыВыработкиПо);
	Иначе
		dateOfProduction.informalDate = Выборка.ДатаВыработкиСтрокой;
	КонецЕсли;
	
	expiryDate = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, consignment, "expiryDate");
	
	Если ЗначениеЗаполнено(ТоварнаяСтрока.СрокГодности) Тогда
		ЗаполнитьПериодXDTO(ВнутренняяФабрикаXDTO, expiryDate, ТоварнаяСтрока.СрокГодности, ТоварнаяСтрока.СрокГодностиПо, Выборка.СоставСрокаГодностиС, Выборка.СоставСрокаГодностиПо);
	Иначе
		expiryDate.informalDate = Выборка.СрокГодностиСтрокой;
	КонецЕсли;
	
	origin = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, consignment, "origin");
	
	countryOfOrigin = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, origin, "country");
	countryOfOrigin.guid = ТоварнаяСтрока.СтранаПроисхождения;
	countryOfOrigin.name = ТоварнаяСтрока.СтранаПроисхожденияНаименование;
	
	origin.country = countryOfOrigin;
	
	Пока Производители.Следующий() Цикл
		producer = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, origin.producer);
		
		producerenterprise = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, producer, "enterprise");
		producerenterprise.guid = Производители.Производитель;
		producerenterprise.name = Производители.ПроизводительНаименование;
		
		producer.enterprise = producerenterprise;
		Если ЗначениеЗаполнено(Производители.РольПроизводителя) Тогда
			producer.role = Перечисления.РолиПроизводителяВЕТИС.ПолучитьЗначениеВЕТИС(Производители.РольПроизводителя);
		КонецЕсли;
		
		origin.producer.Добавить(producer);
	КонецЦикла;
	
	//Если ЗначениеЗаполнено(ТоварнаяСтрока.КодПродукцииОригинал) Тогда
	//	productItemOrigin = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(origin, "productItem");
	//	productItemOrigin.guid = ТоварнаяСтрока.КодПродукцииОригинал;
	//	
	//	origin.productItem = productItemOrigin;
	//КонецЕсли;
	
	consignment.productType = ТоварнаяСтрока.ТипПродукции;
	consignment.product     = product;
	consignment.subProduct  = subProduct;
	consignment.productItem = productItem;
	consignment.volume      = Количество;
	consignment.unit        = unit;
	consignment.dateOfProduction = dateOfProduction;// Дата выработки продукции. Может быть указана двумя способами: датой или диапазоном дат. В случае точной даты выработки указывается только первая компонента - firstDate.
	consignment.expiryDate      = expiryDate;// Дата окончания срока годности продукции. Может быть указана двумя способами: датой или диапазоном дат. В случае точной даты выработки указывается только первая компонента - firstDate.
	
	Пока ПроизводственныеПартии.Следующий() Цикл
		Если ЗначениеЗаполнено(ПроизводственныеПартии.ИдентификаторПартии) Тогда
			consignment.batchID.Добавить(ПроизводственныеПартии.ИдентификаторПартии);
		КонецЕсли;
	КонецЦикла;
	
	consignment.lowGradeCargo   = ?(ТоварнаяСтрока.Некачественный  = Истина, "true", "false"); // Является ли груз некачественным.
	consignment.perishable      = ?(ТоварнаяСтрока.Скоропортящаяся = Истина, "true", "false"); // Описывает, является ли продукция скоропортящейся, true – скоропортящаяся, false – не скоропортящаяся.
	consignment.origin          = origin; // Список производителей продукции.
	
	Если Упаковки.Количество()>0 Тогда
		packageList = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, consignment, "packageList");
		Для Каждого ТекущаяУпаковка Из Упаковки Цикл
			package = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, packageList.package);
			package.level = Перечисления.УровниУпаковокВЕТИС.ПолучитьЗначениеВЕТИС(ТекущаяУпаковка.УровеньУпаковки);
			
			packingType = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, package, "packingType");
			packingType.guid = ТекущаяУпаковка.Упаковка;
			package.packingType = packingType;
			
			Если Количество = 0 Тогда
				package.quantity = 0;
			Иначе
				package.quantity = ТекущаяУпаковка.КоличествоУпаковок;
			КонецЕсли;
			
			СтрокиМаркировки = Маркировка.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяУпаковка.ИдентификаторСтроки));
			//Если СтрокиМаркировки.Количество()>0 Тогда
			//productMarks = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(package, "productMarks");
			Для Каждого СтрокаМаркировки Из СтрокиМаркировки Цикл
				productMarking = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, package.productMarks);
				
				ТипМаркировки = СтрокаМаркировки.ТипМаркировки;
				Если ЗначениеЗаполнено(ТипМаркировки) Тогда
					productMarking.class = Перечисления.ТипыМаркировкиВЕТИС.ПолучитьЗначениеВЕТИС(ТипМаркировки);
				КонецЕсли;
				productMarking.__content = СтрокаМаркировки.Маркировка;
				package.productMarks.Добавить(productMarking);
			КонецЦикла;
			//package.productMarks = productMarks;
			//КонецЕсли;
			
			packageList.package.Добавить(package);
		КонецЦикла;
		
		consignment.packageList     = packageList; // Список видов упаковки, которые используются для возвращаемой партии.
	КонецЕсли;
	
	Возврат consignment;
	
КонецФункции

Функция ПолучитьЛогинПользователя(ХозяйствующийСубъект, Пользователь = Неопределено)
	
	Результат = "";
	
	//Если Пользователь = Неопределено И ЗначениеЗаполнено(ХозяйствующийСубъект.Пользователь) Тогда
	//	Результат = ХозяйствующийСубъект.Пользователь.Логин;
	//Иначе
	Если ЗначениеЗаполнено(Пользователь) И ЗначениеЗаполнено(ХозяйствующийСубъект) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПользователиВЕТИС.Логин КАК Логин
		|ИЗ
		|	Справочник.ПользователиВЕТИС КАК ПользователиВЕТИС
		|ГДЕ
		|	ПользователиВЕТИС.ПометкаУдаления = ЛОЖЬ И 
		|	ПользователиВЕТИС.Пользователь = &Пользователь И 
		|	ПользователиВЕТИС.ХозяйствующийСубъект = &ХозяйствующийСубъект
		|";
		
		Запрос.УстановитьПараметр("ХозяйствующийСубъект",   ХозяйствующийСубъект);
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Логин;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВетСертификатОтгрузка(ВнутренняяФабрикаXDTO, СписокОбъект, ВыборкаТовары, УсловияПеремещения)
	
	vetCertificate = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, СписокОбъект);
	
	// Серия БСО
	vetCertificate.issueSeries = ВыборкаТовары.СерияБСО;
	// Номер БСО
	vetCertificate.issueNumber = ВыборкаТовары.НомерБСО;
	
	authentication = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, vetCertificate, "authentication");
	
	Если ЗначениеЗаполнено(ВыборкаТовары.НазначениеГруза) Тогда
		purpose = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, authentication, "purpose");
		purpose.guid = ВыборкаТовары.НазначениеГруза;
		authentication.purpose     = purpose;
	КонецЕсли;
	
	// Условия перемещения.
	Для Каждого УсловиеПеремещения Из УсловияПеремещения Цикл
		r13nClause = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, authentication.r13nClause);
		condition = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, r13nClause, "condition");
		condition.guid = УсловиеПеремещения.УсловиеПеремещения;
		r13nClause.condition = condition;
		authentication.r13nClause.Добавить(r13nClause);
	КонецЦикла;
	
	// Осуществлен контроль гос.ветврачом на соответствие требованиям.
	authentication.cargoInspected       = ВыборкаТовары.ВыполненКонтрольГосВетВрачем;
	// Осуществлена ветеринарно-санитарная экспертиза продукции.
	Если ЗначениеЗаполнено(ВыборкаТовары.ЭкспертизаРезультат) Тогда
		authentication.cargoExpertized = Перечисления.РезультатыИсследованияВЕТИС.ПолучитьЗначениеВЕТИС(ВыборкаТовары.ЭкспертизаРезультат);
	КонецЕсли;
	// Благополучие местности.
	Если ЗначениеЗаполнено(ВыборкаТовары.БлагополучиеМестности) Тогда
		authentication.locationProsperity = ВыборкаТовары.БлагополучиеМестности;
	КонецЕсли;
	//"Местность благополучна";
	authentication.specialMarks         = ВыборкаТовары.ОсобыеОтметки;
	//"Разрешение №85 от 2020-12-06";
	
	//Сведения о предыдущих ветеринарных сопроводительных документах.
	vetCertificate.authentication = authentication;
	
	Возврат vetCertificate;
	
КонецФункции

Функция ПолучитьЭлементConsignmentОтгрузка(ВнутренняяФабрикаXDTO, СтрокаПартии, СписокОбъект, УпаковкиПартии)
	
	consignment = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, СписокОбъект);
	
	Если ЗначениеЗаполнено(СтрокаПартии.ИдентификаторПартии) Тогда
		sourceStockEntry = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, consignment, "sourceStockEntry");
		sourceStockEntry.guid = СтрокаПартии.ИдентификаторПартии;
		consignment.sourceStockEntry = sourceStockEntry;
	КонецЕсли;
	//consignment.partOf    = ИдентификаторСтроки;
	
	//// Продукция получателя.
	//	Если ЗначениеЗаполнено(ВыборкаТовары.ПродукцияПолучателя) Тогда
	//		productItem = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(Прокси, consignment, "productItem");
	//		productItem.guid = ВыборкаТовары.ПродукцияПолучателя;
	//		consignment.productItem = productItem;
	//	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаПартии.ЕдиницаИзмерения) Тогда
		unit = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, consignment, "unit");
		unit.guid = СтрокаПартии.ЕдиницаИзмерения;
		consignment.unit   = unit;
	КонецЕсли;
	consignment.volume = СтрокаПартии.Количество;
	
	Если УпаковкиПартии.Количество()>0 Тогда
		consignment.packageList = ПолучитьУпаковкиПартииXDTO(ВнутренняяФабрикаXDTO, УпаковкиПартии, consignment);
		//packingList = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(consignment, "packingList");
		//
		//packingForm = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(packingList.packingForm);
		//packingForm.uuid = СтрокаПартии.Упаковка;
		////"fedf56f6-053c-11e1-99b4-d8d385fbc9e8";
		//
		//packingList.packingForm.Добавить(packingForm);
		//
		//consignment.packingAmount = СтрокаПартии.КоличествоУпаковок; // Количество единиц упаковки для входящей партии.
		//consignment.packingList   = packingList; // Список видов упаковки, которые используются для возвращаемой партии.
		
	КонецЕсли;
	
	Возврат consignment;
	
КонецФункции

Функция Получитьbatch(ВнутренняяФабрикаXDTO, ОбъектXDTO, Выборка)
	
	batch = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектXDTO, "batch");
	
	unit = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "unit");
	unit.guid = Выборка.ЕдиницаИзмерения;
	
	product = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "product");
	product.guid = Выборка.Продукция;
	
	productItem = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "productItem");
	Если ЗначениеЗаполнено(Выборка.КодПродукции) Тогда
		productItem.guid = Выборка.КодПродукции;
		productItem.name = Выборка.НаименованиеПродукции;
		//productItem.uuid = Выборка.ИдентификаторПродукции;
	Иначе
		productItem.name = Выборка.ПродукцияСтрокой;
	КонецЕсли;
	
	subProduct = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "subProduct");
	subProduct.guid = Выборка.ВидПродукции;
	
	expiryDate = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "expiryDate");
	
	Если ЗначениеЗаполнено(Выборка.СрокГодности) Тогда
		ЗаполнитьПериодXDTO(ВнутренняяФабрикаXDTO, expiryDate, Выборка.СрокГодности, Выборка.СрокГодностиПо);
	Иначе
		expiryDate.informalDate = Выборка.СрокГодностиСтрокой;
	КонецЕсли;
	
	dateOfProduction = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "dateOfProduction");
	
	Если ЗначениеЗаполнено(Выборка.ДатаВыработки) Тогда
		ЗаполнитьПериодXDTO(ВнутренняяФабрикаXDTO, dateOfProduction, Выборка.ДатаВыработки, Выборка.ДатаВыработкиПо);
	Иначе
		dateOfProduction.informalDate = Выборка.ДатаВыработкиСтрокой;
	КонецЕсли;
	
	origin = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "origin");
	//Если ЗначениеЗаполнено(Выборка.КодПродукции) Тогда
	//	origin = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(batch, "origin");
	//	ОригинальныйproductItem = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(origin, "productItem");
	//	ОригинальныйproductItem.guid = Выборка.КодПродукции;
	//	ОригинальныйproductItem.name = Выборка.НаименованиеПродукции;
	//	ОригинальныйproductItem.uuid = Выборка.ИдентификаторПродукции;
	//	origin.productItem = ОригинальныйproductItem;
	//КонецЕсли;
	
	country = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, origin, "country");
	country.guid = Выборка.СтранаПроисхождения;
	country.name = Выборка.СтранаПроисхожденияНаименование;
	origin.country  = country;
	
	Производители = Выборка.Производители.Выбрать();
	Пока Производители.Следующий() Цикл
		producer = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, origin, "producer");
		
		// Предприятие-производитель
		Если ЗначениеЗаполнено(Производители.Производитель) Тогда
			Enterprise = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, producer, "enterprise");
			Enterprise.guid = Производители.Производитель;
			Enterprise.name = Производители.ПроизводительНаименование;
			producer.enterprise = Enterprise;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Производители.РольПроизводителя) Тогда
			producer.role = Перечисления.РолиПроизводителяВЕТИС.ПолучитьЗначениеВЕТИС(Производители.РольПроизводителя);
		КонецЕсли;
		
		origin.producer.Добавить(producer);
	КонецЦикла;
	
	batch.productType  = Выборка.ТипПродукции;
	batch.product      = product;
	batch.subProduct   = subProduct;
	batch.productItem  = productItem;
	batch.volume       = Выборка.Количество;
	batch.unit         = unit;
	batch.dateOfProduction = dateOfProduction;
	batch.expiryDate       = expiryDate;
	
	ПроизводственныеПартии = Выборка.ПроизводственныеПартии.Выбрать();
	Пока ПроизводственныеПартии.Следующий() Цикл
		Если ЗначениеЗаполнено(ПроизводственныеПартии.ИдентификаторПартии) Тогда
			batch.batchID.Добавить(ПроизводственныеПартии.ИдентификаторПартии);
		КонецЕсли;
	КонецЦикла;
	
	batch.perishable  	   = ?(Выборка.Скоропортящаяся = Истина, "true", "false");
	batch.origin           = origin;
	batch.lowGradeCargo    = ?(Выборка.Некачественный = Истина, "true", "false");
	////owner
	Упаковки = Выборка.Упаковки.Выбрать();
	Если Упаковки.Количество()>0 Тогда
		Маркировка = Выборка.Маркировка.Выгрузить();
		packageList = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, batch, "packageList");
		Пока Упаковки.Следующий() Цикл
			package = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, packageList.package);
			package.level = Перечисления.УровниУпаковокВЕТИС.ПолучитьЗначениеВЕТИС(Упаковки.УровеньУпаковки);
			
			packingType = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, package, "packingType");
			packingType.uuid = Упаковки.Упаковка;
			package.packingType = packingType;
			
			package.quantity = Упаковки.КоличествоУпаковок;
			
			СтрокиМаркировки = Маркировка.НайтиСтроки(Новый Структура("ИдентификаторСтроки", Упаковки.ИдентификаторСтроки));
			//Если СтрокиМаркировки.Количество()>0 Тогда
			//	productMarks = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(package, "productMarks");
			Для Каждого СтрокаМаркировки Из СтрокиМаркировки Цикл
				productMarking = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, package.productMarks);
				
				ТипМаркировки = СтрокаМаркировки.ТипМаркировки;
				Если ЗначениеЗаполнено(ТипМаркировки) Тогда
					productMarking.class = Перечисления.ТипыМаркировкиВЕТИС.ПолучитьЗначениеВЕТИС(ТипМаркировки);
				КонецЕсли;
				productMarking.__content = СтрокаМаркировки.Маркировка;
				package.productMarks.Добавить(productMarking);
			КонецЦикла;
			//package.productMarks = productMarks;
			//КонецЕсли;
			
			packageList.package.Добавить(package);
		КонецЦикла;
		batch.packageList = packageList;
	КонецЕсли;
	
	Возврат batch;
	
КонецФункции

Функция ПолучитьУпаковкиПартииXDTO(ВнутренняяФабрикаXDTO, ТаблицаУпаковок, consignment)
	
	// Список физических упаковок.
	packageList = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, consignment, "packageList");
	
	//Кэщ созданных
	КэшСозданных = Новый ТаблицаЗначений();
	КэшСозданных.Колонки.Добавить("Упаковка");
	КэшСозданных.Колонки.Добавить("УровеньУпаковки");
	КэшСозданных.Колонки.Добавить("КоличествоУпаковок");
	КэшСозданных.Колонки.Добавить("package");
	СтруктураОтбора = Новый Структура("Упаковка, УровеньУпаковки, КоличествоУпаковок");
	
	//// Ищем все упаковки текущей продукции.
	//Если НЕ ИдентификаторСтроки = Неопределено Тогда
	//	// Для документов со списком продукции.
	//	СтруктураПоискаУпаковки = Новый Структура("ИдентификаторСтроки");
	//	СтруктураПоискаУпаковки.ИдентификаторСтроки = ИдентификаторСтроки;
	//	ТекущиеУпаковки = ТаблицаУпаковки.НайтиСтроки(СтруктураПоискаУпаковки);
	//Иначе
	//	// Для документов с одной продукцией - ВСД, ГашениеВСД.
	//	ТекущиеУпаковки = ТаблицаУпаковки;
	//КонецЕсли;
	
	Для каждого ТекУпаковка Из ТаблицаУпаковок Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, ТекУпаковка);
		ТекСтрокиКэш = КэшСозданных.НайтиСтроки(СтруктураОтбора);
		Если ТекСтрокиКэш.Количество()>0 Тогда
			
			ТекСтрокаКэш = ТекСтрокиКэш[0];
			
		ИначеЕсли ЗначениеЗаполнено(ТекУпаковка.Упаковка) Тогда
			
			Если ТекУпаковка.КоличествоУпаковок = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ТекСтрокаКэш                    = КэшСозданных.Добавить();
			ТекСтрокаКэш.Упаковка           = ТекУпаковка.Упаковка;
			ТекСтрокаКэш.УровеньУпаковки    = ТекУпаковка.УровеньУпаковки;
			ТекСтрокаКэш.КоличествоУпаковок = ТекУпаковка.КоличествоУпаковок;
			ТекСтрокаКэш.package            = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, packageList.package);
			
			// Упаковка
			packingType = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ТекСтрокаКэш.package, "packingType");
			packingType.guid = ТекУпаковка.Упаковка;
			
			ТекСтрокаКэш.package.packingType = packingType;
			ТекСтрокаКэш.package.level       = Перечисления.УровниУпаковокВЕТИС.ПолучитьЗначениеВЕТИС(ТекУпаковка.УровеньУпаковки);
			ТекСтрокаКэш.package.quantity    = ТекУпаковка.КоличествоУпаковок;
		Иначе
			Продолжить;
		КонецЕсли;
		
		// Маркировка.
		Если ЗначениеЗаполнено(ТекУпаковка.ТипМаркировки) И ЗначениеЗаполнено(ТекУпаковка.Маркировка) Тогда
			productMarking = ИнтеграцияГосИС.СоздатьЭлементСпискаXDTO(ВнутренняяФабрикаXDTO, ТекСтрокаКэш.package.productMarks);
			productMarking.class     = Перечисления.ТипыМаркировкиВЕТИС.ПолучитьЗначениеВЕТИС(ТекУпаковка.ТипМаркировки);
			productMarking.__content = ТекУпаковка.Маркировка;
			ТекСтрокаКэш.package.productMarks.Добавить(productMarking);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТекСтрокаКэш Из КэшСозданных Цикл
		packageList.package.Добавить(ТекСтрокаКэш.package);
	КонецЦикла;
	
	Возврат packageList;
	
КонецФункции

Процедура ЗаполнитьПроизводственнуюПлощадку(ВнутренняяФабрикаXDTO, ОбъектXDTO, guidХС, guidПредприятия)
	
	BusinessEntity      = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектXDTO, "businessEntity");
	Если ЗначениеЗаполнено(guidХС) Тогда
		BusinessEntity.guid = guidХС;
	КонецЕсли;
	
	Enterprise      = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектXDTO, "enterprise");
	Если ЗначениеЗаполнено(guidПредприятия) Тогда
		Enterprise.guid = guidПредприятия;
	КонецЕсли;
	
	ОбъектXDTO.businessEntity = BusinessEntity;
	ОбъектXDTO.enterprise     = Enterprise;
	
КонецПроцедуры

Процедура ЗаполнитьИнформациюПоТранспорту(ВнутренняяФабрикаXDTO, ОбъектXDTO, ВходныеПараметры)
	
	transportNumber = ИнтеграцияГосИС.СоздатьСвойствоОбъектаXDTO(ВнутренняяФабрикаXDTO, ОбъектXDTO, "transportNumber");
	
	Если ВходныеПараметры.ТипТС = Перечисления.ТипыТранспортаВЕТИС.Автомобильный Тогда
		ОбъектXDTO.transportType = 1;
		transportNumber.vehicleNumber = ВходныеПараметры.НомерТС;   // Номер автомобиля.
		Если ЗначениеЗаполнено(ВходныеПараметры.НомерПрицепа) Тогда
			transportNumber.trailerNumber = ВходныеПараметры.НомерПрицепа; // Номер прицепа (полуприцепа).
		КонецЕсли;
	ИначеЕсли ВходныеПараметры.ТипТС = Перечисления.ТипыТранспортаВЕТИС.Железнодорожный Тогда
		ОбъектXDTO.transportType = 2;
		transportNumber.wagonNumber = ВходныеПараметры.НомерТС; // Номер вагона.
	ИначеЕсли ВходныеПараметры.ТипТС = Перечисления.ТипыТранспортаВЕТИС.Авиа Тогда
		ОбъектXDTO.transportType = 3;
		transportNumber.flightNumber = ВходныеПараметры.НомерТС; // Номер авиарейса.
	ИначеЕсли ВходныеПараметры.ТипТС = Перечисления.ТипыТранспортаВЕТИС.МорскойКонтейнернаяПартия Тогда
		ОбъектXDTO.transportType = 4;
		transportNumber.shipName        = ВходныеПараметры.НомерТС; // Название судна.
	ИначеЕсли ВходныеПараметры.ТипТС = Перечисления.ТипыТранспортаВЕТИС.МорскойТрюмнаяПартия Тогда
		ОбъектXDTO.transportType = 5;
		transportNumber.shipName        = ВходныеПараметры.НомерТС; // Название судна.
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВходныеПараметры.НомерКонтейнера) Тогда
		transportNumber.containerNumber = ВходныеПараметры.НомерКонтейнера;// Номер контейнера.
	КонецЕсли;
	
	ОбъектXDTO.transportNumber = transportNumber;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработкаЗаявок

#Область Загрузка

Функция ПрочитатьОбъект(ВнутренняяФабрикаXDTO, ТекстВходящегоСообщенияXML, ПространствоИмен, ИмяТипа, ПредставлениеЗапроса, ВозвращаемоеЗначение) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстВходящегоСообщенияXML);
	
	Попытка
		
		ОбъектXDTO = ВнутренняяФабрикаXDTO.ПрочитатьXML(
			ЧтениеXML,
			ИнтеграцияГосИС.ОбъектXDTOПоИмениСвойства(ВнутренняяФабрикаXDTO, ПространствоИмен, ИмяТипа).Тип());
		
	Исключение
		
		ПредставлениеОшибки = ПредставлениеОшибкиXDTO(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), ЧтениеXML, ЧтениеXML.КонтекстПространствИмен.Глубина);
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Попытка
			
			ОбъектXDTO = ПреобразоватьПроизвольныйОбъектXDTOВОбъектXDTO(
				ИнтеграцияГосИС.ПроизвольныйОбъектXDTOПоТекстуСообщенияXML(ВнутренняяФабрикаXDTO, ТекстВходящегоСообщенияXML),
				ИнтеграцияГосИС.ОбъектXDTOПоИмениСвойства(ВнутренняяФабрикаXDTO, ПространствоИмен, ИмяТипа));
			
		Исключение
			
			ОбработатьОшибку(
				СтрШаблон(
					НСтр("ru = 'При разборе XML ответа на %1 возникла ошибка:
					           |Текст ошибки: %2'"),
					ПредставлениеЗапроса),
					РасширеннаяИнформацияОбОшибке(ПредставлениеОшибки, ПодробноеПредставлениеОшибки),
				ВозвращаемоеЗначение);
			
			Возврат Неопределено;
			
		КонецПопытки;
		
	КонецПопытки;
	
	Возврат ОбъектXDTO;
	
КонецФункции

// Обрабатывает ответ ВЕТИС на запрос списка хозяйствующих субъектов.
//
// Параметры:
//  РезультатОтправкиЗапроса - Структура - см. функцию.
//  Запрос - Структура - структура со свойствами:
//   * ПространствоИмен
//   * ИмяМетода
//   * ИмяЭлемента
//   * Описание
// 
// Возвращаемое значение:
//  Структура:
//   * Результат         - Структура - см. описание для типа объекта result.success в пакете XDTO "Интеграция ВетИС".
//   * ТекстОшибки       - Строка - текст ошибки, в случае ее возникновения. 
//   * ТекстСообщенияXML - Строка - содержит ответ, полученный на запрос.
//   * СтатусОбработки   - Перечисление.СтатусыОбработкиСообщенийВЕТИС - статус обработки запроса.
//
Функция ОбработатьОтветНаПередачуДанных(РезультатОтправкиЗапроса, Запрос, ВидОперации = Неопределено, ПараметрыОбмена) Экспорт
	
	ПараметрыОбменов = ИнтеграцияВЕТИСПовтИсп.ПолучитьПараметрыОбменов();
	ВнутренняяФабрикаXDTO = ПараметрыОбменов.ФабрикаXDTO;
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Результат",         Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",       "");
	ВозвращаемоеЗначение.Вставить("ТекстСообщенияXML", РезультатОтправкиЗапроса.ТекстВходящегоСообщенияSOAP);
	ВозвращаемоеЗначение.Вставить("СтатусОбработки",   Неопределено);
	
	Если РезультатОтправкиЗапроса.КодСостояния <> 200 Тогда
		Возврат ОбработатьСообщениеОбОшибке(
			РезультатОтправкиЗапроса, ВозвращаемоеЗначение);
	КонецЕсли;
	
	ИмяТипа          = Запрос.ИмяМетода + "Response";
	//ПространствоИмен = Запрос.ПространствоИмен;
	ПространствоИмен = "http://api.vetrf.ru/schema/cdm/application/ws-definitions";
	
	ТекстВходящегоСообщенияXML = ПолучитьЗначениеИзДокументаDOMПоИмениПоля(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияSOAP, ИмяТипа);
	
	//ВложенныйОбъектXDTO   = Неопределено;
	//ПараметрыЗапросаВЕТИС = Неопределено;
	//Если Запрос.Сервис = Перечисления.СервисыВЕТИС.ОбработкаЗаявок
	//	И Операция <> Неопределено Тогда // Получение результата обработки заявки
	
	ПараметрыЗапроса = ПараметрыОбменов.ПараметрыОбъектов.Получить(ВидОперации);
	//ПараметрыОтвета = ПараметрыОбменов.ПараметрыОбъектов.Получить(ПараметрыЗапроса.ОтветНаЗапрос);
	
	//ПараметрыЗапросаВЕТИС = Перечисления.ВидыОперацийВЕТИС.ПараметрыЗапросаВЕТИС(Операция, Запрос.ФорматОбмена);
	
	ТекстВложенногоСообщенияXML = ПолучитьЗначениеИзДокументаDOMПоИмениПоля(
	ТекстВходящегоСообщенияXML, ПараметрыЗапроса.ИмяТипа, ТекстВходящегоСообщенияXML);
	
	//	// В переменной ТекстВходящегоСообщенияXML содержится сокращенный текст XML (только данные Application)
	ОбъектXDTO = ПрочитатьОбъект(ВнутренняяФабрикаXDTO,
	ТекстВходящегоСообщенияXML,
	ПространствоИмен, ИмяТипа, ПараметрыЗапроса.Описание,
	ВозвращаемоеЗначение);
	
	Если ОбъектXDTO = Неопределено Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Если ТекстВложенногоСообщенияXML <> Неопределено Тогда
		
		ВложенныйОбъектXDTO = ПрочитатьОбъект(ВнутренняяФабрикаXDTO,
		ТекстВложенногоСообщенияXML,
		ПараметрыЗапроса.ПространствоИмен,
		ПараметрыЗапроса.ИмяТипа, ПараметрыЗапроса.Описание,
		ВозвращаемоеЗначение);
		Если ВложенныйОбъектXDTO = Неопределено Тогда
			Возврат ВозвращаемоеЗначение;
		КонецЕсли;
	КонецЕсли;
	//	
	////Иначе
	////	
	////	//// В переменной ТекстВходящегоСообщенияXML содержится полный текст XML
	////	//ОбъектXDTO = ПрочитатьОбъект(ВнутренняяФабрикаXDTO,
	////	//	ТекстВходящегоСообщенияXML,
	////	//	ПространствоИмен, ИмяТипа, ПараметрыЗапроса.Описание,
	////	//	ВозвращаемоеЗначение);
	////	//Если ОбъектXDTO = Неопределено Тогда
	////	//	Возврат ВозвращаемоеЗначение;
	////	//КонецЕсли;
	////	
	////КонецЕсли;
	//
	Попытка
		
		Результат = ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ОбъектXDTO[Запрос.ИмяЭлемента]);
		//Если Запрос.Сервис = Перечисления.СервисыВЕТИС.ОбработкаЗаявок Тогда
			
			Если ВидОперации <> Неопределено Тогда // Получение результата обработки заявки
				
				Если ВложенныйОбъектXDTO <> Неопределено Тогда
					
					//// Очистка соответствия идентификаторов от предыдущего поиска
					//Для Каждого КлючИЗначение Из ПараметрыОбмена.ПараметрыПреобразования.Идентификаторы Цикл
					//	КлючИЗначение.Значение.Очистить();
					//КонецЦикла;
					
					Результат.result.Вставить(
						ПараметрыЗапроса.ИмяТипа,
						ИнтеграцияГосИС.ОбъектXDTOВСтруктуру(ВложенныйОбъектXDTO));
					
					//// Поиск ссылок на объекты в ИБ
					//СсылкиПоИдентификаторам(
					//	ПараметрыОбмена.ПараметрыПреобразования.Идентификаторы,
					//	ПараметрыОбмена.ПараметрыПреобразования.НайденныеСсылки);
					//
					//ЗаполнитьБлокируемыеОбъекты(
					//	ПараметрыОбмена.ПараметрыПреобразования.БлокируемыеОбъекты,
					//	ПараметрыОбмена.ПараметрыПреобразования.НайденныеСсылки,
					//	ПараметрыОбмена.ПараметрыПреобразования.Идентификаторы);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Статус = ВРег(Результат.status);
			
			Если Статус = "ACCEPTED" Тогда
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаПринята;
			ИначеЕсли Статус = "IN_PROCESS" Тогда
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОбрабатывается;
			ИначеЕсли Статус = "COMPLETED" Тогда
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаВыполнена;
			ИначеЕсли Статус = "REJECTED" Тогда
				ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОтклонена;
			Иначе
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестный статус обработки заявки: %1'"), Статус);
			КонецЕсли;
			
		//Иначе
		//	
		//	ВозвращаемоеЗначение.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.Принят;
		//	
		//КонецЕсли;
		
		ВозвращаемоеЗначение.Результат = Результат;
		
	Исключение
		
		ОбработатьОшибку(
			СтрШаблон(
				НСтр("ru = 'При разборе объекта XDTO ответа на %1 возникла ошибка:
				           |Текст ошибки: %ТекстОшибки%'"),
				ПараметрыЗапроса.Описание),
			ИнформацияОбОшибке(),
			ВозвращаемоеЗначение);
		
		Возврат ВозвращаемоеЗначение;
		
	КонецПопытки;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЗапросПолученияРезультатаОбработкиЗаявкиXML(ХозяйствующийСубъект, Предприятие, ИдентификаторЗаявки, НастройкаПодключения) Экспорт
	
	ПараметрыОбменов      = ИнтеграцияВЕТИСПовтИсп.ПолучитьПараметрыОбменов();
	ВнутренняяФабрикаXDTO = ПараметрыОбменов.ФабрикаXDTO;
	ПараметрыОбъектов     = ПараметрыОбменов.ПараметрыОбъектов;
	
	ВидОперации = Перечисления.ВидыОперацийВЕТИС.ПолучениеРезультатаЗапроса;
	
	ПараметрыЗапроса = ПараметрыОбъектов[ВидОперации];        // получение рез запроса
	
	//ИмяТипа               = "receiveApplicationResultRequest";
	
	СообщенияXML = Новый Массив;
	
	СообщениеXML = СтруктураСообщенияXML();
	СообщениеXML.ВидОперации = ВидОперации;
	СообщениеXML.Описание   = ПараметрыЗапроса.Описание;
	
	//ПространствоИмен = ПараметрыЗапроса.ПространствоИмен;
	ИмяТипа          = ПараметрыЗапроса.ИмяТипа; // - receiveApplicationResultRequest
	ИмяОбъекта       = ПараметрыЗапроса.ИмяОбъекта;
	ПространствоИмен = "http://api.vetrf.ru/schema/cdm/application/ws-definitions";
	
	Если НастройкаПодключения = Неопределено Тогда
		Возврат ИнтеграцияВЕТИС.СообщениеНеНайденыНастройкиПодключенияПараметрыОбмена(СообщенияXML, ХозяйствующийСубъект);
	КонецЕсли;
	//Если НЕ ПользователиВЕТИС.ОперацияДоступнаПользователю(Операция, , , , НастройкаПодключения.ПраваДоступа) Тогда
	//	Возврат ИнтеграцияВЕТИС.СообщениеОперацияВЕТИСНедоступнаДляПользователя(СообщенияXML, Операция);
	//КонецЕсли;
	
	ЗапросКвитанции = ИнтеграцияГосИС.ОбъектXDTOПоИмениСвойства(ВнутренняяФабрикаXDTO, ПространствоИмен, ИмяТипа);
	ЗапросКвитанции.apiKey        = НастройкаПодключения.Ключ;
	ЗапросКвитанции.issuerId      = НастройкаПодключения.ИдентификаторРСХН;
	ЗапросКвитанции.applicationId = ИдентификаторЗаявки;
	
	ТекстСообщенияXML = ОбъектXDTOВXML(ПараметрыОбменов, ЗапросКвитанции);
	
	//ТекстСообщенияXML = ОбъектXDTOВXML(ПараметрыОбменов, ЗапросКвитанции, ПространствоИмен, ИмяТипа);
	
	СообщениеXML.ТекстСообщенияXML    = ТекстСообщенияXML;
	СообщениеXML.ТипСообщения         = Перечисления.ВходящееИсходящееСобытие.Входящее;
	СообщениеXML.ХозяйствующийСубъект = ХозяйствующийСубъект;
	СообщениеXML.Предприятие          = Предприятие;
	СообщениеXML.ВидОперации           = ВидОперации;
	СообщениеXML.Объект               = Неопределено;
	//СообщениеXML.ДокументОснование    = Неопределено;
	СообщениеXML.ПараметрыЗапроса     = ПараметрыЗапроса;
	//СообщениеXML.ФорматОбмена         = ФорматОбмена;
	
	СообщенияXML.Добавить(СообщениеXML);
	
	Возврат СообщенияXML;
	
КонецФункции

Функция ПолучитьРезультатОбработкиЗаявки(Сообщение, НастройкаПодключения, Операция, ПараметрыОбмена) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатОбработкиОтвета = Новый Структура;
	РезультатОбработкиОтвета.Вставить("Результат");
	РезультатОбработкиОтвета.Вставить("ТекстОшибки");
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Данные");
	ВозвращаемоеЗначение.Вставить("СтатусОбработки");
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса");
	ВозвращаемоеЗначение.Вставить("РезультатОбработкиОтвета", РезультатОбработкиОтвета);
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса();
	ПараметрыЗапроса.ИмяМетода        = "receiveApplicationResult";
	//ПараметрыЗапроса.ИмяМетода        = "submitApplication";
	ПараметрыЗапроса.ПространствоИмен = "http://api.vetrf.ru/schema/cdm/application/ws-definitions";
	//ПараметрыЗапроса.Сервис           = Перечисления.СервисыВЕТИС.ОбработкаЗаявок;
	ПараметрыЗапроса.ИмяЭлемента      = "application";
	ПараметрыЗапроса.Представление    = Сообщение.Описание;
	ПараметрыЗапроса.АдресРесурса     = "platform/services/2.1/ApplicationManagementService";
	//ПараметрыЗапроса.ФорматОбмена     = Перечисления.ФорматыОбменаВЕТИС.V2_1;
	
	//РезультатОтправкиЗапроса = Неопределено;
	//Если РезультатОтправкиЗапроса = Неопределено Тогда
		РезультатОтправкиЗапроса = ОтправитьЗапрос(
			Сообщение.ТекстСообщенияXML, ПараметрыЗапроса.ИмяМетода, НастройкаПодключения, ПараметрыЗапроса);
		//РезультатОтправкиЗапроса = ИнтеграцияВЕТИСВызовСервера.ОтправитьЗапрос(
		//	Сообщение.ТекстСообщенияXML,
		//	ПараметрыЗапроса.Сервис, ПараметрыЗапроса.ИмяМетода, НастройкаПодключения);
	//КонецЕсли;
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если РезультатОтправкиЗапроса.ТекстСообщенияXMLПолучен Тогда
		
		ДанныеОбработки = ОбработатьОтветНаПередачуДанных(РезультатОтправкиЗапроса, ПараметрыЗапроса, Операция, ПараметрыОбмена);
		
		Если ДанныеОбработки.Результат <> Неопределено Тогда
			ВозвращаемоеЗначение.Данные = ДанныеОбработки.Результат.result;
		КонецЕсли;
		
		ВозвращаемоеЗначение.СтатусОбработки                      = ДанныеОбработки.СтатусОбработки;
		ВозвращаемоеЗначение.РезультатОбработкиОтвета.ТекстОшибки = ДанныеОбработки.ТекстОшибки;
		ВозвращаемоеЗначение.РезультатОбработкиОтвета.Результат   = ДанныеОбработки.Результат;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Получить результат заявки.
//
// Параметры:
//  ЭлементОчереди  - (См. ИнтеграцияВЕТИСКлиентСервер.СтруктураОчередиПередачиДанных).
//  ПараметрыОбмена - Соответствие - Настройки обмена с ВЕТИС.
//
Процедура ЗагрузитьРезультатОбработкиЗаявки(ЭлементОчереди, ПараметрыОбмена) Экспорт
	
	ПараметрыОбмена.ЗагружатьПоСсылкамИзСервиса = Ложь;
	
	ПараметрыОбменов      = ИнтеграцияВЕТИСПовтИсп.ПолучитьПараметрыОбменов();
	ВнутренняяФабрикаXDTO = ПараметрыОбменов.ФабрикаXDTO;
	ПараметрыОбъектов     = ПараметрыОбменов.ПараметрыОбъектов;
	
	НастройкаПодключения = ПараметрыОбмена.НастройкиПодключения.Получить(ЭлементОчереди.ХозяйствующийСубъект);
	СообщенияXML = ЗапросПолученияРезультатаОбработкиЗаявкиXML(
		ЭлементОчереди.ХозяйствующийСубъект,
		ЭлементОчереди.Предприятие,
		ЭлементОчереди.ИдентификаторЗаявки,
		НастройкаПодключения);
	
	Для Каждого СообщениеXML Из СообщенияXML Цикл
		
		ДополнительныеПараметры = Новый Структура;
		
		Если Не ЗначениеЗаполнено(СообщениеXML.ТекстОшибки) Тогда
			
			ПараметрыЗапроса = ПараметрыОбъектов[ЭлементОчереди.ВидОперации];
			
			ПараметрыОтветаНаЗапрос = ПараметрыОбъектов[ПараметрыЗапроса.ОтветНаЗапрос];
			ВидОперации = ПараметрыОтветаНаЗапрос.ВидОперации;
			ТипВЕТИС   = ПараметрыОтветаНаЗапрос.ИмяТипа;
			
			РезультатОбработкиЗаявки = ПолучитьРезультатОбработкиЗаявки(СообщениеXML, НастройкаПодключения, ВидОперации, ПараметрыОбмена);
			
			Если (ПараметрыОбмена.КоличествоПовторныхЗапросов < 0
				Или ЭлементОчереди.КоличествоИтераций < ПараметрыОбмена.КоличествоПовторныхЗапросов)
				И (РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.КодСостояния  = 408        // Таймаут
				Или РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.КодСостояния = 429) Тогда // Слишком много запросов
				Продолжить;
			КонецЕсли;
			
			ТекстОшибки = "";
			Если РезультатОбработкиЗаявки.СтатусОбработки <> Перечисления.СтатусыОбработкиСообщенийВЕТИС.ОшибкаПоиска Тогда
				Если ЗначениеЗаполнено(РезультатОбработкиЗаявки.РезультатОбработкиОтвета.ТекстОшибки) Тогда
					ТекстОшибки = РезультатОбработкиЗаявки.РезультатОбработкиОтвета.ТекстОшибки;
				ИначеЕсли ЗначениеЗаполнено(РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстОшибки) Тогда
					ТекстОшибки = РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстОшибки;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			ТекстОшибки = СообщениеXML.ТекстОшибки;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			
			ПредставлениеХС          = НСтр("ru = '<не указан>'");
			ПредставлениеПредприятия = НСтр("ru = '<не указано>'");
			Если ЗначениеЗаполнено(ЭлементОчереди.ХозяйствующийСубъект) Тогда
				
				ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
					ЭлементОчереди.ХозяйствующийСубъект, "Наименование, Код");
				ПредставлениеХС = СтрШаблон(
					"%1(%2)",
					ЗначенияРеквизитов.Наименование,
					ЗначенияРеквизитов.Код);
				Если ЗначениеЗаполнено(ЭлементОчереди.Предприятие) Тогда
					ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
						ЭлементОчереди.Предприятие, "Наименование, Код");
					ПредставлениеПредприятия = СтрШаблон(
						"%1(%2)",
						ЗначенияРеквизитов.Наименование,
						ЗначенияРеквизитов.Код);
				КонецЕсли;
				
			КонецЕсли;
			
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Получен ""%1"" (id=%2)
				           |Хозяйствующий субъект: %3
				           |Предприятие: %4
				           |%5:
				           |%6'"),
				ВидОперации,
				ЭлементОчереди.ИдентификаторЗаявки,
				ПредставлениеХС,
				ПредставлениеПредприятия,
				?(РезультатОбработкиЗаявки <> Неопределено,
				  РезультатОбработкиЗаявки.СтатусОбработки,
				  Перечисления.СтатусыОбработкиСообщенийВЕТИС.Ошибка),
				ТекстОшибки);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
			
			Продолжить;
			
		КонецЕсли;
		
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("Объект");
		ДанныеДокумента.Вставить("Ошибки");
		ДанныеДокумента.Вставить("СтатусОбработки",       РезультатОбработкиЗаявки.СтатусОбработки);
//		ДанныеДокумента.Вставить("ФорматОбмена",          НастройкаПодключения.ФорматОбмена);
		ДанныеДокумента.Вставить("ИдентификаторЗаявки",   ЭлементОчереди.ИдентификаторЗаявки);
		ДанныеДокумента.Вставить("ПараметрыЗапроса",      ЭлементОчереди.ПараметрыЗапроса);
		ДанныеДокумента.Вставить("ИсходящееСообщение",    ЭлементОчереди.Сообщение);
		ДанныеДокумента.Вставить("Документ",              ЭлементОчереди.Объект);
		ДанныеДокумента.Вставить("ВходящаяОперация",      ВидОперации);
		ДанныеДокумента.Вставить("ИсходящаяОперация",     СообщениеXML.ВидОперации);
		ДанныеДокумента.Вставить("ВходящееСообщениеXML",  РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияSOAP);
		ДанныеДокумента.Вставить("ИсходящееСообщениеXML", СообщениеXML.ТекстСообщенияXML);
		
		ДанныеВыполненияЗаявки = РезультатОбработкиЗаявки.РезультатОбработкиОтвета.Результат;
		ДополнительныеПараметры.Вставить("ДанныеВыполненияЗаявки", ДанныеВыполненияЗаявки);
		ДополнительныеПараметры.Вставить("ЕстьОшибкиСервиса",      Ложь);
		ДополнительныеПараметры.Вставить("ЭлементОчереди",         ЭлементОчереди);
		
		Если ДанныеДокумента.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаВыполнена Тогда
			
			Если РезультатОбработкиЗаявки.Данные <> Неопределено
				И РезультатОбработкиЗаявки.Данные.Свойство(ТипВЕТИС) Тогда
				
				ДанныеДокумента.Объект = РезультатОбработкиЗаявки.Данные[ТипВЕТИС];
				
				// В некоторых случаях из Меркурия приходит некорректный ответ на запрос измененных ВСД:
				//<?xml version="1.0" encoding="UTF-8"?>
				//<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
				//<soap:Body>
				//<receiveApplicationResultResponse xmlns="http://api.vetrf.ru/schema/cdm/application/ws-definitions">
				// <application xmlns="http://api.vetrf.ru/schema/cdm/application">
				//  <applicationId>a3044a18-665a-47cb-93a2-d7b0e57d61ea</applicationId>
				//   <status>COMPLETED</status>
				//   <serviceId>mercury-g2b.service</serviceId>
				//   <issuerId>191d7678-a8d0-40ba-9e87-662a1e68a546</issuerId>
				//   <issueDate>2019-09-12T11:25:54+03:00</issueDate>
				//   <rcvDate>2019-09-12T11:39:02+03:00</rcvDate>
				//   <prdcRsltDate>2019-09-12T11:39:37+03:00</prdcRsltDate>
				//   <result>
				//     <ns2:getVetDocumentChangesListResponse xmlns:ns2="http://api.vetrf.ru/schema/cdm/mercury/g2b/applications/v2" xmlns:ns1="http://api.vetrf.ru/schema/cdm/mercury/vet-document/v2"/>
				//   </result>
				// </application>
				//</receiveApplicationResultResponse>
				//</soap:Body>
				//</soap:Envelope>
				Если ЭлементОчереди.ВидОперации = Перечисления.ВидыОперацийВетИС.ЗапросИзмененныхВСД Тогда
					
					//ПараметрыСписка = ДанныеДокумента.Объект.vetDocumentList;
					//Если ПараметрыСписка = Неопределено Тогда
					//	
					//	ЭлементОчереди.ИдентификаторЗаявки = Неопределено; // Старый идентификатор более не актуален
					//	Если ИнтеграцияВЕТИС.ИнтервалМеждуЗапросамиСписковВыдержан(ПараметрыОбмена, ЭлементОчереди.ВидОперации, ЭлементОчереди.Предприятие) Тогда
					//		ИнтеграцияВЕТИС.ОбработатьЭлементОчередиПередачиДанных(ЭлементОчереди, ПараметрыОбмена, Ложь);
					//	КонецЕсли;
					//	
					//	Продолжить;
					//	
					//КонецЕсли;
					
				ИначеЕсли ЭлементОчереди.ВидОперации = Перечисления.ВидыОперацийВетИС.ЗапросИзмененныхЗаписейСкладскогоЖурнала Тогда
					
					ПараметрыСписка = ДанныеДокумента.Объект.stockEntryList;
					Если ПараметрыСписка = Неопределено Тогда
						
						ЭлементОчереди.ИдентификаторЗаявки = Неопределено; // Старый идентификатор более не актуален
						Если ИнтервалМеждуЗапросамиСписковВыдержан(ПараметрыОбмена, ЭлементОчереди.ВидОперации, ЭлементОчереди.Предприятие) Тогда
							ОбработатьЭлементОчередиПередачиДанных(ЭлементОчереди, ПараметрыОбмена, Ложь);
						КонецЕсли;
						
						Продолжить;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				ИнтеграцияВЕТИС.ЗафиксироватьОшибкуСервиса(ЭлементОчереди, ПараметрыОбмена);
				ДополнительныеПараметры.ЕстьОшибкиСервиса = Истина;
			КонецЕсли;
			
		ИначеЕсли ДанныеДокумента.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОтклонена Тогда
			
			ЕстьОшибкиТребующиеПовторногоЗапроса = Ложь;
			
			Ошибки = Новый Массив;
			errors = РезультатОбработкиЗаявки.РезультатОбработкиОтвета.Результат.errors;
			Если errors <> Неопределено Тогда
				Для Каждого СтрокаТЧ Из errors.error Цикл
					
					Ошибка = Новый Структура;
					Ошибка.Вставить("Код",         СтрокаТЧ.code);
					Ошибка.Вставить("ТекстОшибки", СтрокаТЧ.__content);
					
					Ошибки.Добавить(Ошибка);
					
					Если СтрНайти(ВРег(СтрокаТЧ.code), "APLM0012")
						Или СтрНайти(ВРег(СтрокаТЧ.code), "APLM0017") Тогда
						
						ЕстьОшибкиТребующиеПовторногоЗапроса = Истина;
						ДополнительныеПараметры.ЕстьОшибкиСервиса = Истина; // Ошибка регистрируется для документов и для запросов списков!
						
						ОперацииСОшибкойСервиса = Новый Массив;
						ОперацииСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВетИС.ЗапросНаОформлениеВходящейПартии);
						ОперацииСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВетИС.ЗапросНаОформлениеРезультатовИнвентаризации);
						ОперацииСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВетИС.ЗапросНаОформлениеТранспортнойПартии);
						ОперацииСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВетИС.ЗапросНаОбъединениеЗаписейСкладскогоЖурнала);
						ОперацииСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВетИС.ЗапросНаОформлениеПроизводственнойПартии);
						
						Если ОперацииСОшибкойСервиса.Найти(ЭлементОчереди.ВидОперации) <> Неопределено Тогда
							
							ИнтеграцияВЕТИС.ЗафиксироватьОшибкуСервиса(ЭлементОчереди, ПараметрыОбмена);
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
			Если ЕстьОшибкиТребующиеПовторногоЗапроса И Не ЭлементОчереди.ЕстьОшибкиСервиса
				И (
					ПараметрыОбмена.КоличествоПовторныхЗапросов < 0
					Или ЭлементОчереди.КоличествоИтераций < ПараметрыОбмена.КоличествоПовторныхЗапросов) Тогда
				
				ЭлементОчереди.ИдентификаторЗаявки = Неопределено; // Старый идентификатор более не актуален
				Если ИнтеграцияВЕТИС.ИнтервалМеждуЗапросамиСписковВыдержан(ПараметрыОбмена, ЭлементОчереди.ВидОперации, ЭлементОчереди.Предприятие) Тогда
					ИнтеграцияВЕТИС.ОбработатьЭлементОчередиПередачиДанных(ЭлементОчереди, ПараметрыОбмена, Ложь);
				КонецЕсли;
				
				Продолжить;
				
			КонецЕсли;
			
			ДанныеДокумента.Ошибки = Ошибки;
			
		ИначеЕсли ДанныеДокумента.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ОшибкаПоиска Тогда
			
			// Если запрашивать результат по заявке отправленной в ВетИС более чем 3 дня назад - возникает ошибка поиска.
			// Результат по таким документам необходимо восстанавливать по аналогии с ошибками сервиса.
			ОперацииСОшибкойСервиса = Новый Массив;
			ОперацииСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВетИС.ЗапросНаОформлениеВходящейПартии);
			ОперацииСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВетИС.ЗапросНаОформлениеРезультатовИнвентаризации);
			ОперацииСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВетИС.ЗапросНаОформлениеТранспортнойПартии);
			ОперацииСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВетИС.ЗапросНаОбъединениеЗаписейСкладскогоЖурнала);
			ОперацииСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВетИС.ЗапросНаОформлениеПроизводственнойПартии);
			
			Если ОперацииСОшибкойСервиса.Найти(ЭлементОчереди.ВидОперации) <> Неопределено Тогда
				
				ИнтеграцияВЕТИС.ЗафиксироватьОшибкуСервиса(ЭлементОчереди, ПараметрыОбмена);
				ДополнительныеПараметры.ЕстьОшибкиСервиса = Истина;
				
			Иначе
				
				Ошибки = Новый Массив;
				Ошибка = Новый Структура;
				Ошибка.Вставить("Код", "1С-Timeout");
				Ошибка.Вставить("ТекстОшибки", СтрШаблон(
					НСтр("ru = '%2 по заявке %1 не получен, поскольку обмен не выполнялся длительное время (более 3-х дней):
					           |Результат обработки заявки уже удален. Выполните операцию повторно.'"),
					ДанныеДокумента.ИдентификаторЗаявки,
					ДанныеДокумента.ВходящаяОперация));
				Ошибки.Добавить(Ошибка);
				
				ДанныеДокумента.Ошибки          = Ошибки;
				ДанныеДокумента.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОтклонена;
				
			КонецЕсли;
			
		ИначеЕсли ДанныеДокумента.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОбрабатывается Тогда
			
			ДатаФормированияРезультата = ИнтеграцияВЕТИС.ДатаФормированияРезультата(ЭлементОчереди, ПараметрыОбмена, ДанныеВыполненияЗаявки);
			
			ВремяОжидания = ТекущаяУниверсальнаяДата() - ДатаФормированияРезультата;
			Если ПараметрыОбмена.ВремяОжиданияОбработкиЗаявки < 0
				Или ВремяОжидания < ПараметрыОбмена.ВремяОжиданияОбработкиЗаявки Тогда
				
				Продолжить;
				
			Иначе
				
				ОперацииСОшибкойСервиса = Новый Массив;
				ОперацииСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВетИС.ЗапросНаОформлениеВходящейПартии);
				ОперацииСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВетИС.ЗапросНаОформлениеРезультатовИнвентаризации);
				ОперацииСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВетИС.ЗапросНаОформлениеТранспортнойПартии);
				ОперацииСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВетИС.ЗапросНаОбъединениеЗаписейСкладскогоЖурнала);
				ОперацииСОшибкойСервиса.Добавить(Перечисления.ВидыОперацийВетИС.ЗапросНаОформлениеПроизводственнойПартии);
				
				Если ОперацииСОшибкойСервиса.Найти(ЭлементОчереди.ВидОперации) <> Неопределено Тогда
					
					ИнтеграцияВЕТИС.ЗафиксироватьОшибкуСервиса(ЭлементОчереди, ПараметрыОбмена);
					ДополнительныеПараметры.ЕстьОшибкиСервиса = Истина;
					
				ИначеЕсли ПараметрыОбмена.ОтправлятьЗависшиеЗапросыПовторно
					И ИнтеграцияВЕТИС.ИнтервалМеждуЗапросамиСписковВыдержан(ПараметрыОбмена, ЭлементОчереди.ВидОперации, ЭлементОчереди.Предприятие) Тогда
					
					ЭлементОчереди.ИдентификаторЗаявки = Неопределено; // Старый идентификатор более не актуален
					ИнтеграцияВЕТИС.ОбработатьЭлементОчередиПередачиДанных(ЭлементОчереди, ПараметрыОбмена, Ложь);
					Продолжить;
					
				Иначе
					
					Ошибки = Новый Массив;
					Ошибка = Новый Структура;
					Ошибка.Вставить("Код", "1С-Timeout");
					Ошибка.Вставить("ТекстОшибки", СтрШаблон(
						НСтр("ru = '%2 по заявке %1 не получен в течении 30 минут.
						           |С большой долей вероятности результат выполнения заявки - это ошибка APLM0012.
						           |Ожидание результата выполнения заявки прекращено.'"),
						ДанныеДокумента.ИдентификаторЗаявки,
						ДанныеДокумента.ВходящаяОперация));
					Ошибки.Добавить(Ошибка);
					
					ДанныеДокумента.Ошибки          = Ошибки;
					ДанныеДокумента.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОтклонена;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененныхЗаписейСкладскогоЖурнала Тогда
		
			//ВсеВСДЗагружены = Истина;
			//Для каждого СтрокаВСД Из ПараметрыОбмена.ПараметрыПреобразования.Идентификаторы.ВетеринарноСопроводительныйДокументВЕТИС Цикл
			//	Если Не ЗначениеЗаполнено(СтрокаВСД.Значение) Тогда
			//		
			//		ВсеВСДЗагружены = Ложь;
			//		
			//		СообщениеВСД = ЗаявкиВЕТИС.ПодготовитьЗапросВетеринарноСопроводительногоДокументаПоUUID(
			//			ЭлементОчереди.ХозяйствующийСубъект,
			//			ЭлементОчереди.Предприятие,
			//			СтрокаВСД.Ключ,
			//			ПараметрыОбмена);
			//		
			//		НоваяЗависимость = ПараметрыОбмена.ЗависимостиСообщений.Добавить();
			//		НоваяЗависимость.Сообщение1 = ЭлементОчереди.Сообщение;
			//		НоваяЗависимость.Сообщение2 = СообщениеВСД;
			//		НоваяЗависимость.Загрузка   = Ложь;
			//		НоваяЗависимость.Передача   = Ложь;
			//		
			//	КонецЕсли;
			//КонецЦикла;
			//
			//Если Не ВсеВСДЗагружены Тогда
			//	Продолжить;
			//КонецЕсли;
		
		КонецЕсли;
		
		//НайденныеСсылкиПриОткатеТранзакции = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОбмена.ПараметрыПреобразования.НайденныеСсылки, Ложь);
		
		//ТранзакцияЗафиксирована = Неопределено;
		//
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			
			ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
			ТаблицыБлокируемыхСсылок.Колонки.Добавить("Сообщение", Метаданные.РегистрыСведений.ЗапросыВЕТИС.Измерения.Сообщение.Тип);
			ТаблицыБлокируемыхСсылок.Добавить().Сообщение = ЭлементОчереди.Сообщение;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗапросыВЕТИС");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сообщение", "Сообщение");
			
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.ЗапросыВЕТИС.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение);
			НаборЗаписей.Прочитать();
			
			Если Не НаборЗаписей.Выбран() Тогда
				
				ОтменитьТранзакцию();
				
				// Сообщение уже передано, обработано сервисом, результат загружен в ИБ.
				//УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
				УдалитьЗаявкуИзОчереди(ЭлементОчереди.ХозяйствующийСубъект, ЭлементОчереди.Предприятие, ЭлементОчереди.Сообщение);
				
				Продолжить;
				
			КонецЕсли;
		//	
		//	// Первое чтение ссылок произошло вне транзакции для уменьшения количества блокируемых объектов.
		//	// Теперь получаем не существующие объекты, выполняем блокировку по данным ссылкам и выполняем повторное
		//	// ответственное чтение
		//	Если ПараметрыОбмена.ПараметрыПреобразования.БлокируемыеОбъекты.Количество() > 0 Тогда
		//		
		//		Блокировка = Новый БлокировкаДанных;
		//		
		//		ТаблицыБлокируемыхСсылок = Новый Структура;
		//		
		//		Для каждого ИмяОбъектаМетаданныхИОбъекты Из ПараметрыОбмена.ПараметрыПреобразования.БлокируемыеОбъекты Цикл
		//			
		//			ИмяТаблицы = ИмяОбъектаМетаданныхИОбъекты.Ключ;
		//			ИмяПространстваБлокировки = "";
		//			Если Метаданные.Справочники.Найти(ИмяТаблицы) <> Неопределено Тогда
		//				ИмяПространстваБлокировки = "Справочник." + ИмяТаблицы;
		//				ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка." + ИмяТаблицы);
		//				Менеджер = Справочники[ИмяТаблицы];
		//			ИначеЕсли Метаданные.Документы.Найти(ИмяТаблицы) <> Неопределено Тогда
		//				ИмяПространстваБлокировки = "Документ." + ИмяТаблицы;
		//				ОписаниеТипов = Новый ОписаниеТипов("ДокументСсылка." + ИмяТаблицы);
		//				Менеджер = Документы[ИмяТаблицы];
		//			КонецЕсли;
		//			ТаблицыБлокируемыхСсылок.Вставить(ИмяТаблицы, Новый ТаблицаЗначений);
		//			ТаблицыБлокируемыхСсылок[ИмяТаблицы].Колонки.Добавить("Ссылка", ОписаниеТипов);
		//			
		//			Для каждого ИдентификаторИДанныеОбъекта Из ИмяОбъектаМетаданныхИОбъекты.Значение Цикл
		//				СсылкаНаОбъект = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторИДанныеОбъекта.Ключ));
		//				ТаблицыБлокируемыхСсылок[ИмяТаблицы].Добавить().Ссылка = СсылкаНаОбъект;
		//			КонецЦикла;
		//			
		//			ЭлементБлокировки = Блокировка.Добавить(ИмяПространстваБлокировки);
		//			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		//			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
		//			ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок[ИмяТаблицы];
		//			
		//		КонецЦикла;
		//		
		//		Блокировка.Заблокировать();
		//		
		//		// Ответственное чтение для проверки существования ссылок
		//		ИнтеграцияВЕТИС.СсылкиПоИдентификаторам(
		//			ПараметрыОбмена.ПараметрыПреобразования.БлокируемыеОбъекты,
		//			ПараметрыОбмена.ПараметрыПреобразования.НайденныеСсылки);
		//		
		//	КонецЕсли;
			
			ДанныеЗагруженногоДокумента = Неопределено;
			
			Если ЭлементОчереди.Объект = Неопределено И ДанныеДокумента.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОтклонена Тогда
				ДанныеЗагруженногоДокумента = ИнтеграцияВЕТИСКлиентСервер.СтруктураИзменения();
				ДанныеЗагруженногоДокумента.ХозяйствующийСубъект = ЭлементОчереди.ХозяйствующийСубъект;
				ДанныеЗагруженногоДокумента.Предприятие          = ЭлементОчереди.Предприятие;
				ДанныеЗагруженногоДокумента.ВидОперации           = ДанныеДокумента.ВходящаяОперация;
				
				ДанныеЗагруженногоДокумента.ТекстОшибки = ТекстОшибкиОбработкиРезультата(ДанныеДокумента, ЭлементОчереди.ХозяйствующийСубъект, ЭлементОчереди.Предприятие, Истина);
				ДанныеЗагруженногоДокумента.ПодготовленоКПередаче = Ложь;
				ДанныеЗагруженногоДокумента.Передано              = Ложь;
				ДанныеЗагруженногоДокумента.Принято               = Истина;
				ДанныеЗагруженногоДокумента.ЕстьОшибкиСервиса     = ДополнительныеПараметры.ЕстьОшибкиСервиса;
				
				ДанныеЗагруженногоДокумента.ИсходящееСообщение = ДанныеДокумента.ИсходящееСообщение;
				ДанныеЗагруженногоДокумента.ВходящееСообщение  = ДанныеДокумента.ИдентификаторЗаявки;
				
				ДанныеЗагруженногоДокумента.Объект               = ДанныеДокумента.Документ;
				ДанныеЗагруженногоДокумента.НовыйСтатус          = ДанныеДокумента.СтатусОбработки;
				ДанныеЗагруженногоДокумента.ОбъектИзменен        = Ложь;
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросРегистрацииИзмененияПредприятия Тогда
				
				ДанныеЗагруженногоДокумента = ИнтеграцияВЕТИС.ОбработатьРезультатРегистрацииИзмененияПредприятия(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросРегистрацииИзмененияХозяйствующегоСубъекта Тогда
				
				ДанныеЗагруженногоДокумента = ИнтеграцияВЕТИС.ОбработатьРезультатРегистрацииИзмененияХозяйствующегоСубъекта(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросРегистрацииИзмененияПродукции Тогда
				
				ДанныеЗагруженногоДокумента = ОбработатьРезультатРегистрацииИзмененияПродукции(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросСозданияИзмененияСвязиСПлощадкой Тогда
				
				ДанныеЗагруженногоДокумента = ИнтеграцияВЕТИС.ОбработатьРезультатСозданияИзмененияСвязиСПлощадкой(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененныхВСД Тогда
				
				ДанныеЗагруженногоДокумента = ОбработатьРезультатЗапросаИзмененныхВСД(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросВСД Тогда
				
				ДанныеЗагруженногоДокумента = ОбработатьРезультатЗапросаВСД(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
					
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросНаАннулированиеВСД Тогда
				
				ДанныеЗагруженногоДокумента = Документы.ВСДВЕТИС.ОбработатьРезультатЗапросаНаАннулированиеВСД(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросВсехВСД Тогда
				
				ДанныеЗагруженногоДокумента = ОбработатьРезультатЗапросаВсехВСД(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
					
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросЗаписиСкладскогоЖурнала Тогда
				
				ДанныеЗагруженногоДокумента = ОбработатьРезультатЗапросаЗаписиСкладскогоЖурнала(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросЗаписейСкладскогоЖурнала Тогда
				
				ДанныеЗагруженногоДокумента = ОбработатьРезультатЗапросаАктуальныхЗаписейСкладскогоЖурнала(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененныхЗаписейСкладскогоЖурнала Тогда
				
				ДанныеЗагруженногоДокумента = ОбработатьРезультатЗапросаИзмененныхЗаписейСкладскогоЖурнала(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросПользователейХозяйствующегоСубъекта Тогда
				
				//ДанныеЗагруженногоДокумента = ПользователиВЕТИС.ОбработатьРезультатЗапросаПользователейХозяйствующегоСубъекта(
				//	ДанныеДокумента,
				//	ЭлементОчереди.ХозяйствующийСубъект,
				//	ЭлементОчереди.Предприятие,
				//	ПараметрыОбмена,
				//	ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросДоступныхДляНазначенияПрав Тогда
				
				//ДанныеЗагруженногоДокумента = ПользователиВЕТИС.ОбработатьРезультатЗапросаДоступныхДляНазначенияПрав(
				//	ДанныеДокумента,
				//	ЭлементОчереди.ХозяйствующийСубъект,
				//	ЭлементОчереди.Предприятие,
				//	ПараметрыОбмена,
				//	ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросДанныхПользователя Тогда
				
				//ДанныеЗагруженногоДокумента = ПользователиВЕТИС.ОбработатьРезультатЗапросаДанныхПользователя(
				//	ДанныеДокумента,
				//	ЭлементОчереди.ХозяйствующийСубъект,
				//	ЭлементОчереди.Предприятие,
				//	ПараметрыОбмена,
				//	ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененияПравПользователей Тогда
				
				//ДанныеЗагруженногоДокумента = ПользователиВЕТИС.ОбработатьРезультатЗапросаИзмененияПравПользователей(
				//	ДанныеДокумента,
				//	ЭлементОчереди.ХозяйствующийСубъект,
				//	ЭлементОчереди.Предприятие,
				//	ПараметрыОбмена,
				//	ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененияЗонОтветственностиПользователей Тогда
				
				//ДанныеЗагруженногоДокумента = ПользователиВЕТИС.ОбработатьРезультатЗапросаИзмененияЗонОтветственностиПользователей(
				//	ДанныеДокумента,
				//	ЭлементОчереди.ХозяйствующийСубъект,
				//	ЭлементОчереди.Предприятие,
				//	ПараметрыОбмена,
				//	ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросРегистрацииИПривязкиПользователейХозяйствующегоСубъекта Тогда
				
				//ДанныеЗагруженногоДокумента = ПользователиВЕТИС.ОбработатьРезультатЗапросаРегистрацииИПривязкиПользователейХозяйствующегоСубъекта(
				//	ДанныеДокумента,
				//	ЭлементОчереди.ХозяйствующийСубъект,
				//	ЭлементОчереди.Предприятие,
				//	ПараметрыОбмена,
				//	ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросУдаленияСвязиПользователейСХозяйствующимСубъектом Тогда
				
				//ДанныеЗагруженногоДокумента = ПользователиВЕТИС.ОбработатьРезультатЗапросаУдаленияСвязиПользователейСХозяйствующимСубъектом(
				//	ДанныеДокумента,
				//	ЭлементОчереди.ХозяйствующийСубъект,
				//	ЭлементОчереди.Предприятие,
				//	ПараметрыОбмена,
				//	ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросВозможностиПеревозкиПартииВРамкахРегионализации Тогда
				
				ПолноеИмя = ДанныеДокумента.Документ.Метаданные().ПолноеИмя();
				МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
				
				ДанныеЗагруженногоДокумента = МенеджерОбъекта.ОбработатьОтветНаЗапросВозможностиПеревозкиПартииВРамкахРегионализации(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросВнесенияСведенийОВетеринарныхМероприятиях Тогда
				
				ДанныеЗагруженногоДокумента = ИнтеграцияВЕТИС.ОбработатьРезультатЗапросаИзмененныхСведенийОВетеринарныхОперациях(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененияНомеровТранспортныхСредств Тогда
				
				ДанныеЗагруженногоДокумента = Документы.ВходящаяТранспортнаяОперацияВЕТИС.ОбработатьРезультатЗапросаНаВнесениеНомеровТранспортныхСредствВПунктахПерегрузки(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросОформленияРезультатовИнвентаризации Тогда
				
				ДанныеЗагруженногоДокумента = ИнтеграцияВЕТИС.ОбработатьРезультатИнвентаризацияПродукции(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросОформленияПроизводственнойПартии Тогда
				
				ДанныеЗагруженногоДокумента = Документы.ПроизводственныеОперацииВЕТИС.ОбработатьРезультатЗапросаНаОформлениеПроизводственнойПартии(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросОбъединенияЗаписейСкладскогоЖурнала Тогда
				
				ДанныеЗагруженногоДокумента = Документы.ОбъединениеЗаписейСкладскогоЖурналаВЕТИС.ОбработатьРезультатЗапросаНаОбъединениеЗаписейСкладскогоЖурнала(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросОформленияТранспортнойПартии Тогда
				
				ДанныеЗагруженногоДокумента = Документы.ТранспортныеОперацииВЕТИС.ОбработатьРезультатЗапросаНаОформлениеТранспортнойПартии(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				
			ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросОформленияВходящейПартии
				Или ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросПакетногоГашенияВСД Тогда
				
				//Если ДанныеДокумента.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОтклонена Тогда
				//	Для Каждого ТекущаяСтрока Из ДанныеДокумента.Ошибки Цикл
				//		ТекущаяСтрока.Код = "MERC14268"
				//	КонецЦикла;
				//Иначе
					
				МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ДанныеДокумента.Документ);
				ДанныеЗагруженногоДокумента = МенеджерОбъекта.ОбработатьРезультатГашенияВСД(
					ДанныеДокумента,
					ЭлементОчереди.ХозяйствующийСубъект,
					ЭлементОчереди.Предприятие,
					ПараметрыОбмена,
					ДополнительныеПараметры);
				//КонецЕсли;
				
			Иначе
				
				ВызватьИсключение НСтр("ru = 'Неизвестная операция'");
				
			КонецЕсли;
			
			ТранзакцияЗафиксирована = Истина;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТранзакцияЗафиксирована = Ложь;
			
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				ЭлементОчереди.ХозяйствующийСубъект, "Наименование, Код");
			ПредставлениеХС = СтрШаблон(
				"%1(%2)",
				ЗначенияРеквизитов.Наименование,
				ЗначенияРеквизитов.Код);
			Если ЗначениеЗаполнено(ЭлементОчереди.Предприятие) Тогда
				ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
					ЭлементОчереди.Предприятие, "Наименование, Код");
				ПредставлениеПредприятия = СтрШаблон(
					"%1(%2)",
					ЗначенияРеквизитов.Наименование,
					ЗначенияРеквизитов.Код);
			Иначе
				ПредставлениеПредприятия = НСтр("ru = '<не указано>'");
			КонецЕсли;
			
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'При загрузке документа с типом %1 возникла ошибка:
				           |Текст ошибки: %2
				           |Хозяйствующий субъект: %3
				           |Предприятие: %4
				           |Текст XML см. в журнале регистрации.'"),
				ТипВЕТИС,
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
				ПредставлениеХС,
				ПредставлениеПредприятия);
			
			ТекстОшибкиЖурналРегистрации = СтрШаблон(
				НСтр("ru = 'При загрузке документа с типом %1 возникла ошибка:
				           |Текст ошибки: %2
				           |Хозяйствующий субъект: %3
				           |Предприятие: %4
				           |Текст XML:
				           |%5'"),
				ТипВЕТИС,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
				ПредставлениеХС,
				ПредставлениеПредприятия,
				РезультатОбработкиЗаявки.РезультатОтправкиЗапроса.ТекстВходящегоСообщенияSOAP);
				
			ОбъектМетаданных = Неопределено;
			Если ДанныеДокумента.Свойство("Документ") И ЗначениеЗаполнено(ДанныеДокумента.Документ) Тогда
				ОбъектМетаданных = ДанныеДокумента.Документ.Метаданные();
			КонецЕсли;
			
			ИнтеграцияВЕТИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибкиЖурналРегистрации, ОбъектМетаданных, ДанныеДокумента.Документ);
			
			// Для того, чтобы в структуре не было битых ссылок, возвращаем предыдущее значение найденных ссылок
			//ПараметрыОбмена.ПараметрыПреобразования.НайденныеСсылки = НайденныеСсылкиПриОткатеТранзакции;
			
		КонецПопытки;
		
		Если ТранзакцияЗафиксирована
			И (ДанныеДокумента.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаВыполнена
			   Или ДанныеДокумента.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОтклонена
			   Или ДанныеДокумента.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ОшибкаПоиска)
			И Не ЭлементОчереди.ЕстьОшибкиСервиса Тогда
			
			УдалитьСообщениеВиртуальнойОчереди(ЭлементОчереди, ПараметрыОбмена);
			УдалитьЗаявкуИзОчереди(ЭлементОчереди.ХозяйствующийСубъект, ЭлементОчереди.Предприятие, ЭлементОчереди.Сообщение);
			
		ИначеЕсли Не ТранзакцияЗафиксирована Тогда
			
			СтрокаРезультата = ИнтеграцияВЕТИСКлиентСервер.СтруктураИзменения();
			СтрокаРезультата.ХозяйствующийСубъект = ЭлементОчереди.ХозяйствующийСубъект;
			СтрокаРезультата.Предприятие          = ЭлементОчереди.Предприятие;
			СтрокаРезультата.ВидОперации           = ДанныеДокумента.ВходящаяОперация;
//			СтрокаРезультата.ФорматОбмена         = ДанныеДокумента.ФорматОбмена;
			
			СтрокаРезультата.ТекстОшибки           = ТекстОшибки;
			СтрокаРезультата.ПодготовленоКПередаче = Ложь;
			СтрокаРезультата.Передано              = Ложь;
			СтрокаРезультата.Принято               = Истина;
			
			СтрокаРезультата.ИсходящееСообщение = Неопределено;
			СтрокаРезультата.ВходящееСообщение  = Неопределено;
			
			СтрокаРезультата.Объект            = ДанныеДокумента.Документ;
			//СтрокаРезультата.ДокументОснование = ДанныеДокумента.ДокументОснование;
			СтрокаРезультата.НовыйСтатус       = Неопределено;
			СтрокаРезультата.ОбъектИзменен     = Ложь;
			
			ПараметрыОбмена.ОбработанныеЭлементыОчереди.Добавить(ЭлементОчереди);
			ПараметрыОбмена.Изменения.Добавить(СтрокаРезультата);
			
			//СтрокаСтопЛист = ПараметрыОбмена.СтопЛист.Добавить();
			//СтрокаСтопЛист.ХозяйствующийСубъект = ЭлементОчереди.ХозяйствующийСубъект;
			//СтрокаСтопЛист.Предприятие          = ЭлементОчереди.Предприятие;
			
			// Изменение даты обмена в регистре СинхронизацияКлассификаторовВЕТИС.
			//Если ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененныхЗаписейСкладскогоЖурнала
			//	Или ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененныхВСД Тогда
			//	Попытка
			//		УстановитьДатуСинхронизации(ЭлементОчереди.ХозяйствующийСубъект, ЭлементОчереди.Предприятие, ВидОперации, , НастройкаПодключения.ИнтервалМеждуЗапросамиСинхронизации);
			//	Исключение
			//		ИнтеграцияВЕТИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(
			//			ПодробноеПредставлениеОшибки(
			//				ИнформацияОбОшибке())); 
			//	КонецПопытки;
			//КонецЕсли;
			
			Прервать;
			
		КонецЕсли;
		
		Если ДанныеЗагруженногоДокумента <> Неопределено Тогда
			
			Если ТипЗнч(ДанныеЗагруженногоДокумента) = Тип("Массив") Тогда
				Для Каждого Данные Из ДанныеЗагруженногоДокумента Цикл
					ПараметрыОбмена.Изменения.Добавить(Данные);
				КонецЦикла;
			Иначе
				ПараметрыОбмена.Изменения.Добавить(ДанныеЗагруженногоДокумента);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработкаРезультатаЗапроса

Функция ДатаФормированияРезультата(ЭлементОчереди, ПараметрыОбмена, ДанныеВыполненияЗаявки = Неопределено) Экспорт
	
	РеквизитыВходящегоСообщения = Неопределено;
	Если ЭлементОчереди.РеквизитыВходящегоСообщения <> Неопределено Тогда
		РеквизитыВходящегоСообщения = ЭлементОчереди.РеквизитыВходящегоСообщения.Получить();
	КонецЕсли;
	
	Если РеквизитыВходящегоСообщения = Неопределено
		Или Не РеквизитыВходящегоСообщения.Свойство("ДатаФормированияРезультата") Тогда
		
		//Если ТипЗнч(ЭлементОчереди.Сообщение) = Тип("СправочникСсылка.ВЕТИСПрисоединенныеФайлы") Тогда
		//	
		//	Запрос = Новый Запрос(
		//		"ВЫБРАТЬ ПЕРВЫЕ 1
		//		|	ВЕТИСПрисоединенныеФайлыВходящие.Ссылка                       КАК Ссылка,
		//		|	ВЕТИСПрисоединенныеФайлыВходящие.СтатусОбработки              КАК СтатусОбработки,
		//		|	ВЕТИСПрисоединенныеФайлыВходящие.ДатаМодификацииУниверсальная КАК ДатаМодификацииУниверсальная
		//		|ИЗ
		//		|	Справочник.ВЕТИСПрисоединенныеФайлы КАК ВЕТИСПрисоединенныеФайлыВходящие
		//		|ГДЕ
		//		|	ВЕТИСПрисоединенныеФайлыВходящие.СообщениеОснование = &Сообщение
		//		|УПОРЯДОЧИТЬ ПО
		//		|	ВЕТИСПрисоединенныеФайлыВходящие.ДатаМодификацииУниверсальная УБЫВ
		//		|");
		//	Запрос.УстановитьПараметр("Сообщение", ЭлементОчереди.Сообщение);
		//	РеквизитыСообщения = Запрос.Выполнить().Выбрать();
		//	Если РеквизитыСообщения.Следующий() Тогда
		//		
		//		Если РеквизитыСообщения.СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ОшибкаОтправки Тогда
		//			
		//			ДатаФормированияРезультата = РеквизитыСообщения.ДатаМодификацииУниверсальная;
		//			
		//		Иначе
		//			
		//			ТекстСообщенияXML = ИнтеграцияИС.ТекстСообщенияXMLИзПротокола(РеквизитыСообщения.Ссылка);
		//			
		//			РезультатОтправкиЗапроса = Новый Структура;
		//			РезультатОтправкиЗапроса.Вставить("КодСостояния",                200);
		//			РезультатОтправкиЗапроса.Вставить("ТекстВходящегоСообщенияSOAP", ТекстСообщенияXML);
		//			
		//			ПараметрыЗапроса = ИнтеграцияВЕТИСКлиентСервер.ПараметрыЗапросаЭлементаКлассификатора();
		//			ПараметрыЗапроса.ИмяМетода        = "submitApplication";
		//			ПараметрыЗапроса.ПространствоИмен = Метаданные.ПакетыXDTO.ЗаявкиВЕТИС.ПространствоИмен;
		//			ПараметрыЗапроса.Сервис           = Перечисления.СервисыВЕТИС.ОбработкаЗаявок;
		//			ПараметрыЗапроса.ИмяЭлемента      = "application";
		//			ПараметрыЗапроса.Представление    = НСтр("ru = 'заявка'");
		//			
		//			ДанныеОбработки = ИнтеграцияВЕТИС.ОбработатьОтветНаПередачуДанных(РезультатОтправкиЗапроса, ПараметрыЗапроса, Неопределено, ПараметрыОбмена);
		//			
		//			ДатаФормированияРезультата = УниверсальноеВремя(ДанныеОбработки.Результат.rcvDate);
		//			
		//		КонецЕсли;
		//		
		//	Иначе
		//		
		//		// Для обратной совместимости
		//		Если ДанныеВыполненияЗаявки = Неопределено Тогда
		//			ДатаФормированияРезультата = УниверсальноеВремя(ЭлементОчереди.ДатаСоздания);
		//		Иначе
		//			ДатаФормированияРезультата = УниверсальноеВремя(ДанныеВыполненияЗаявки.issueDate);
		//		КонецЕсли;
		//		
		//	КонецЕсли;
		//	
		//Иначе // Для запросов изменений и прочих операций
			
			// Для обратной совместимости
			Если ДанныеВыполненияЗаявки = Неопределено Тогда
				ДатаФормированияРезультата = УниверсальноеВремя(ЭлементОчереди.ДатаСоздания);
			Иначе
				ДатаФормированияРезультата = УниверсальноеВремя(ДанныеВыполненияЗаявки.issueDate);
			КонецЕсли;
			
		//КонецЕсли;
		
	Иначе
		
		ДатаФормированияРезультата = РеквизитыВходящегоСообщения.ДатаФормированияРезультата;
		
	КонецЕсли;
	
	Возврат ДатаФормированияРезультата;
	
КонецФункции

Функция ПолучитьДатуСинхронизации(ХозяйствующийСубъект, Предприятие, Знач ВидОперации) Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененныхВСД Тогда
		ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросИзмененныхВСД;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененныхЗаписейСкладскогоЖурнала Тогда
		ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросИзмененныхЗаписейСкладскогоЖурнала;
	КонецЕсли;
	
	Результат = НачалоДня(ТекущаяУниверсальнаяДата());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",           Результат);
	Запрос.УстановитьПараметр("ДатаСинхронизации",    ТекущаяДата());
	Запрос.УстановитьПараметр("ХозяйствующийСубъект", ХозяйствующийСубъект);
	Запрос.УстановитьПараметр("Предприятие",          Предприятие);
	Запрос.УстановитьПараметр("ВидОперации",          ВидОперации);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ДанныеСинхронизацииВЕТИС.ДатаСинхронизации, &ДатаНачала) КАК ДатаСинхронизации
	|ИЗ
	|	РегистрСведений.ДанныеСинхронизацииВЕТИС КАК ДанныеСинхронизацииВЕТИС
	|ГДЕ
	|	ДанныеСинхронизацииВЕТИС.ВидОперации = &ВидОперации И 
	|	ДанныеСинхронизацииВЕТИС.ХозяйствующийСубъект = &ХозяйствующийСубъект И 
	|	ДанныеСинхронизацииВЕТИС.Предприятие = &Предприятие И 
	|	ДанныеСинхронизацииВЕТИС.ДатаСледующейСинхронизации <= &ДатаСинхронизации
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.ДатаСинхронизации) Тогда
			Результат = Выборка.ДатаСинхронизации;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьДатуСинхронизации(ХозяйствующийСубъект, Предприятие, Знач ВидОперации, ДатаСинхронизации = Неопределено, Смещение = 86400) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененныхВСД Тогда
		ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросИзмененныхВСД;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененныхЗаписейСкладскогоЖурнала Тогда
		ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросИзмененныхЗаписейСкладскогоЖурнала;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ДанныеСинхронизацииВЕТИС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидОперации.Установить(ВидОперации);
	НаборЗаписей.Отбор.ХозяйствующийСубъект.Установить(ХозяйствующийСубъект);
	НаборЗаписей.Отбор.Предприятие.Установить(Предприятие);
	
	Если ДатаСинхронизации = Неопределено Тогда
		ДатаСинхронизации = ТекущаяУниверсальнаяДата();
	КонецЕсли;
	
	ДатаСледующейСинхронизации = ДатаСинхронизации + Смещение;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ВидОперации                = ВидОперации;
		ЗаписьНабора.ХозяйствующийСубъект       = ХозяйствующийСубъект;
		ЗаписьНабора.Предприятие                = Предприятие;
		ЗаписьНабора.ДатаСинхронизации          = ДатаСинхронизации;
		ЗаписьНабора.ДатаСледующейСинхронизации = ДатаСледующейСинхронизации;
	Иначе
		Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
			ЗаписьНабора.ДатаСинхронизации = ДатаСинхронизации;
			ЗаписьНабора.ДатаСледующейСинхронизации = ДатаСледующейСинхронизации;
		КонецЦикла;
	КонецЕсли;
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	НаборЗаписей.ОбменДанными.Получатели.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПодготовитьЗапросЗаписей(КоличествоЭлементов, Смещение, ПараметрыПервогоЗапроса, ПараметрыОбмена, ЗагружатьПосле, ПоследнийЗапрос = Ложь) Экспорт
	
	ПараметрыЗапроса = Новый Структура;
	Для Каждого ЭлементПараметров Из ПараметрыПервогоЗапроса Цикл
		ПараметрыЗапроса.Вставить(ЭлементПараметров.Ключ, ЭлементПараметров.Значение);
	КонецЦикла;
	
	ПараметрыЗапроса.Вставить("КоличествоЭлементов",    КоличествоЭлементов);
	ПараметрыЗапроса.Вставить("Смещение",               Смещение);
	ПараметрыЗапроса.Вставить("ПервыйЗапрос",           Ложь);
	ПараметрыЗапроса.Вставить("ПоследнийЗапрос",        ПоследнийЗапрос);
	
	СообщенияXML = СформироватьСообщенияXML(ПараметрыПервогоЗапроса.ВидОперации, ПараметрыЗапроса, ПараметрыОбмена, ПараметрыПервогоЗапроса.ХозяйствующийСубъект, ПараметрыПервогоЗапроса.Предприятие);
	
	КоличествоДоВыполненияОперации = ПараметрыОбмена.Изменения.Количество();
	ПодготовитьСообщенияКПередаче(СообщенияXML, Истина, ПараметрыОбмена, ЗагружатьПосле);
	КоличествоПослеВыполненияОперации = ПараметрыОбмена.Изменения.Количество();
	
	Индекс = КоличествоДоВыполненияОперации;
	Если Индекс < КоличествоПослеВыполненияОперации Тогда
		Возврат ПараметрыОбмена.Изменения[Индекс];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ПодготовитьЗапросВСД(ПараметрыОбмена, ХозяйствующийСубъект, Предприятие, СтрокаUUID, ЗагружатьПосле, Немедленно = Истина) Экспорт
	
	ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросВСД;
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
	ДанныеДляВыгрузки.Вставить("Предприятие",          Предприятие);
	ДанныеДляВыгрузки.Вставить("ВидОперации",           ВидОперации);
	ДанныеДляВыгрузки.Вставить("uuid",                 СтрокаUUID);
	ДанныеДляВыгрузки.Вставить("guidПредприятия",      Предприятие.Код);
	
	СообщенияXML = СформироватьСообщенияXML(ВидОперации, ДанныеДляВыгрузки, ПараметрыОбмена, ХозяйствующийСубъект, Предприятие);
	
	ПодготовитьСообщенияКПередаче(СообщенияXML, Немедленно, ПараметрыОбмена, ЗагружатьПосле);
	
КонецПроцедуры

Процедура СформироватьЗаписьСкладскогоЖурнала(ПараметрыОбмена, НаборЗаписи, ХозяйствующийСубъект, Предприятие, ТекущаяСтрока, ЗаписьУдалена = Ложь, ЕстьЗапись, ДатаСинхронизации, ИзмененныеОбъекты = Неопределено, ОбновлятьСправочники = Истина) Экспорт
	
	НаборЗаписи.Отбор.Идентификатор.Использование = Истина;
	НаборЗаписи.Отбор.Идентификатор.Значение = ТекущаяСтрока.guid;
	НастройкаПодключения = ПараметрыОбмена.НастройкиПодключения.Получить(ХозяйствующийСубъект);
	НастройкаПодключения.Вставить("ОбновлятьСправочники", ОбновлятьСправочники);
	
	batch = ТекущаяСтрока.batch;
	
	ДатаОбновления = ТекущаяСтрока.UpdateDate;
	
	МенеджерЗаписи = НаборЗаписи.Добавить();
	МенеджерЗаписи.ДатаИзменения        = ДатаОбновления;
	МенеджерЗаписи.Идентификатор        = ТекущаяСтрока.guid;
	МенеджерЗаписи.ХозяйствующийСубъект = ХозяйствующийСубъект;
	МенеджерЗаписи.Предприятие          = Предприятие;
	МенеджерЗаписи.НомерЗаписи          = ТекущаяСтрока.entryNumber;
	МенеджерЗаписи.ИдентификаторЗаписи  = ТекущаяСтрока.uuid;
	МенеджерЗаписи.ДатаСинхронизации    = ДатаСинхронизации;
	
	ЗаполнитьРеквизитыПартии(НастройкаПодключения, ХозяйствующийСубъект, МенеджерЗаписи, batch, Истина);
	
	СсылкаСвойстваЗаписи = Справочники.СвойстваЗаписейСкладскогоЖурналаВЕТИС.НайтиПоКоду(ТекущаяСтрока.guid);
	Если ЗначениеЗаполнено(СсылкаСвойстваЗаписи) Тогда
		ОбъектСвойстваЗаписи = СсылкаСвойстваЗаписи.ПолучитьОбъект();
	Иначе
		УникальныйКод = Новый УникальныйИдентификатор(ТекущаяСтрока.guid);
		НоваяСсылка = Справочники.СвойстваЗаписейСкладскогоЖурналаВЕТИС.ПолучитьСсылку(УникальныйКод);
		
		СсылкаСвойстваЗаписи = Неопределено;
		Если ЗначениеЗаполнено(СсылкаСвойстваЗаписи) Тогда
			ОбъектСвойстваЗаписи = НоваяСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		Если ОбъектСвойстваЗаписи = Неопределено Тогда
			ОбъектСвойстваЗаписи = Справочники.СвойстваЗаписейСкладскогоЖурналаВЕТИС.СоздатьЭлемент();
			ОбъектСвойстваЗаписи.УстановитьСсылкуНового(НоваяСсылка);
			ОбъектСвойстваЗаписи.Код = ТекущаяСтрока.guid;
		КонецЕсли;
	КонецЕсли;
	
	ОбъектСвойстваЗаписи.НомерЗаписи  = ТекущаяСтрока.entryNumber;
	ОбъектСвойстваЗаписи.Наименование = МенеджерЗаписи.НаименованиеПродукции+" № " + ТекущаяСтрока.entryNumber;
	ОбъектСвойстваЗаписи.ХозяйствующийСубъект = ХозяйствующийСубъект;
	ОбъектСвойстваЗаписи.Предприятие          = Предприятие;
	
	ОбъектСвойстваЗаписи.СопроводительныеДокументы.Очистить();
	ЗаполнитьТаблицыПартии(НастройкаПодключения, ХозяйствующийСубъект, ОбъектСвойстваЗаписи, batch);
	
	ОсновнаяУпаковка = ПолучитьОсновнуюУпаковку(ОбъектСвойстваЗаписи.Упаковки);
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ОсновнаяУпаковка);
	МенеджерЗаписи.Статус       = ТекущаяСтрока.status;
	МенеджерЗаписи.ДатаСоздания = ТекущаяСтрока.createDate;
	
	СписокVetDocument = ТекущаяСтрока.vetDocument;
	Для Каждого ТекущийВетДокумент Из СписокVetDocument Цикл
		
		uuidВСД = ТекущийВетДокумент.uuid;
		Если ПустаяСтрока(uuidВСД) Тогда
			Продолжить;
		КонецЕсли;
		
		ВСД = НайтиЗагрузитьВСД(ПараметрыОбмена, ХозяйствующийСубъект, Предприятие, uuidВСД);
		
		Если ВСД = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ИзмененныеОбъекты = Неопределено Тогда
			ИзмененныеОбъекты.Добавить(ВСД);
		КонецЕсли;
		
		НовыйВетДокумент = ОбъектСвойстваЗаписи.СопроводительныеДокументы.Добавить();
		НовыйВетДокумент.ВСД = ВСД;
		
	КонецЦикла;
	
	ОбъектСвойстваЗаписи.Записать();
	МенеджерЗаписи.СвойствоЗаписи    = ОбъектСвойстваЗаписи.Ссылка;
	
	Если НЕ ИзмененныеОбъекты = Неопределено Тогда
		ИзмененныеОбъекты.Добавить(ОбъектСвойстваЗаписи.Ссылка);
	КонецЕсли;
	
	НаборЗаписи.Записать(Истина);
	НаборЗаписи.Очистить();
	
	ЗначениеСтатуса = Перечисления.СтатусыЗаписейСкладскогоЖурналаВЕТИС.ПолучитьЗначение(МенеджерЗаписи.Статус);
	ОписаниеСтатуса = "";
	Если НЕ ЗначениеСтатуса = Неопределено Тогда
		ОписаниеСтатуса = ", Статус: " + Строка(ЗначениеСтатуса.Представление);
	КонецЕсли;
	
	Если ЕстьЗапись Тогда
		ВывестиСообщение(НСтр("ru='Перезаписана складская запись: № %1 %2'"),,,,,Строка(МенеджерЗаписи.НомерЗаписи), ОписаниеСтатуса);
	Иначе
		ВывестиСообщение(НСтр("ru='Создана новая складская запись: № %1 %2'"),,,,,Строка(МенеджерЗаписи.НомерЗаписи), ОписаниеСтатуса);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьСкладскуюЗапись(НаборЗаписей, ХозяйствующийСубъект, Предприятие, Идентификатор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СвойстваЗаписейСкладскогоЖурналаВЕТИС.Ссылка
	|ИЗ
	|	Справочник.СвойстваЗаписейСкладскогоЖурналаВЕТИС КАК СвойстваЗаписейСкладскогоЖурналаВЕТИС
	|ГДЕ
	|	СвойстваЗаписейСкладскогоЖурналаВЕТИС.ХозяйствующийСубъект = &ХозяйствующийСубъект И 
	|	СвойстваЗаписейСкладскогоЖурналаВЕТИС.Предприятие = &Предприятие И 
	|	СвойстваЗаписейСкладскогоЖурналаВЕТИС.Код = &Идентификатор
	|";
	
	Запрос.УстановитьПараметр("ХозяйствующийСубъект", ХозяйствующийСубъект);
	Запрос.УстановитьПараметр("Предприятие",          Предприятие);
	Запрос.УстановитьПараметр("Идентификатор",        Идентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.Удалить();
	КонецЦикла;
	
	НаборЗаписей.Отбор.ХозяйствующийСубъект.Установить(ХозяйствующийСубъект);
	НаборЗаписей.Отбор.Предприятие.Установить(Предприятие);
	НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПолучитьСписокКЗагрузке(НаборЗаписей, ЗаписиЖурнала, ХозяйствующийСубъект, Предприятие, ТолькоАктивные = Ложь, Перезаполнить = Ложь) Экспорт
	
	ТаблицаЗаписей = Новый ТаблицаЗначений;
	ТаблицаЗаписей.Колонки.Добавить("guid",           Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(36)));
	ТаблицаЗаписей.Колонки.Добавить("Удалить",        Новый ОписаниеТипов("Булево"));
	ТаблицаЗаписей.Колонки.Добавить("Последняя",      Новый ОписаниеТипов("Булево"));
	ТаблицаЗаписей.Колонки.Добавить("Количество",     Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)));
	ТаблицаЗаписей.Колонки.Добавить("ДатаОбновления", Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	
	Для Каждого ТекущаяСтрока Из ЗаписиЖурнала Цикл
		
		Если ТолькоАктивные И ТекущаяСтрока.active = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		ДатаОбновления = ТекущаяСтрока.updateDate;
		
		НоваяСтрока = ТаблицаЗаписей.Добавить();
		НоваяСтрока.guid           = ТекущаяСтрока.guid;
		Если ТекущаяСтрока.status = 400 ИЛИ 
			ТекущаяСтрока.status = 410 ИЛИ 
			ТекущаяСтрока.status = 420 ИЛИ 
			ТекущаяСтрока.status = 105 ИЛИ 
			ТекущаяСтрока.status = 430 Тогда
			НоваяСтрока.Удалить = Истина;
		КонецЕсли;
		НоваяСтрока.Последняя      = ТекущаяСтрока.last;
		НоваяСтрока.Количество     = ТекущаяСтрока.batch.volume;
		НоваяСтрока.ДатаОбновления = ДатаОбновления;
	КонецЦикла;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("guid",       Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
	Результат.Колонки.Добавить("ЕстьЗапись", Новый ОписаниеТипов("Булево"));
	Результат.Индексы.Добавить("guid");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаЗаписей.guid КАК guid,
	|	ТаблицаЗаписей.Удалить КАК Удалить,
	|	ТаблицаЗаписей.Количество КАК Количество,
	|	ТаблицаЗаписей.Последняя КАК Последняя,
	|	ТаблицаЗаписей.ДатаОбновления
	|ПОМЕСТИТЬ
	|	ТаблицаЗаписей
	|ИЗ
	|	&ТаблицаЗаписей КАК ТаблицаЗаписей
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЗаписей.guid КАК guid,
	|	ТаблицаЗаписей.Удалить КАК Удалить,
	|	ТаблицаЗаписей.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА СкладскойЖурналВЕТИС.ДатаИзменения ЕСТЬ NULL ТОГДА
	|			ЛОЖЬ
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ КАК ЕстьЗапись
	|ИЗ
	|	ТаблицаЗаписей КАК ТаблицаЗаписей
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СкладскойЖурналВЕТИС КАК СкладскойЖурналВЕТИС
	|ПО
	|	ТаблицаЗаписей.guid = СкладскойЖурналВЕТИС.Идентификатор И 
	|	СкладскойЖурналВЕТИС.ХозяйствующийСубъект = &ХозяйствующийСубъект И 
	|	СкладскойЖурналВЕТИС.Предприятие = &Предприятие
	|ГДЕ
	|	ТаблицаЗаписей.Удалить = ИСТИНА ИЛИ 
	|	(ТаблицаЗаписей.Последняя = ИСТИНА" + ?(Перезаполнить, ")", " И
	|	(СкладскойЖурналВЕТИС.ДатаИзменения ЕСТЬ NULL ИЛИ (НЕ СкладскойЖурналВЕТИС.ДатаИзменения = ТаблицаЗаписей.ДатаОбновления)))") + "
	|";
	
	Запрос.УстановитьПараметр("ТаблицаЗаписей",       ТаблицаЗаписей);
	Запрос.УстановитьПараметр("ХозяйствующийСубъект", ХозяйствующийСубъект);
	Запрос.УстановитьПараметр("Предприятие",          Предприятие);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Количество = 0 ИЛИ Выборка.Удалить Тогда
			Если Выборка.ЕстьЗапись Тогда
				НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.guid);
				
				УдалитьСкладскуюЗапись(НаборЗаписей, ХозяйствующийСубъект, Предприятие, Выборка.guid);
			КонецЕсли;
		Иначе
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.guid       = Выборка.guid;
			НоваяСтрока.ЕстьЗапись = Выборка.ЕстьЗапись;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокКЗагрузкеСинхронизация(НаборЗаписей, ЗаписиЖурнала, ХозяйствующийСубъект, Предприятие, ТолькоАктивные = Ложь, ДатаСинхронизации) Экспорт
	
	ТаблицаЗаписей = Новый ТаблицаЗначений;
	ТаблицаЗаписей.Колонки.Добавить("guid",           Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(36)));
	ТаблицаЗаписей.Колонки.Добавить("Удалить",        Новый ОписаниеТипов("Булево"));
	ТаблицаЗаписей.Колонки.Добавить("Последняя",      Новый ОписаниеТипов("Булево"));
	ТаблицаЗаписей.Колонки.Добавить("Количество",     Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)));
	ТаблицаЗаписей.Колонки.Добавить("ДатаОбновления", Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	
	Для Каждого ТекущаяСтрока Из ЗаписиЖурнала Цикл
		
		Если ТолькоАктивные И ТекущаяСтрока.active = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		ДатаОбновления = ТекущаяСтрока.updateDate;
		
		НоваяСтрока = ТаблицаЗаписей.Добавить();
		НоваяСтрока.guid           = ТекущаяСтрока.guid;
		Если ТекущаяСтрока.status = 400 ИЛИ 
			ТекущаяСтрока.status = 410 ИЛИ 
			ТекущаяСтрока.status = 420 ИЛИ 
			ТекущаяСтрока.status = 105 ИЛИ 
			ТекущаяСтрока.status = 430 Тогда
			НоваяСтрока.Удалить = Истина;
		КонецЕсли;
		НоваяСтрока.Последняя      = ТекущаяСтрока.last;
		НоваяСтрока.Количество     = ТекущаяСтрока.batch.volume;
		НоваяСтрока.ДатаОбновления = ДатаОбновления;
	КонецЦикла;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("guid",       Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
	Результат.Колонки.Добавить("ЕстьЗапись", Новый ОписаниеТипов("Булево"));
	Результат.Индексы.Добавить("guid");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаЗаписей.guid КАК guid,
	|	ТаблицаЗаписей.Удалить КАК Удалить,
	|	ТаблицаЗаписей.Количество КАК Количество,
	|	ТаблицаЗаписей.Последняя КАК Последняя,
	|	ТаблицаЗаписей.ДатаОбновления
	|ПОМЕСТИТЬ
	|	ТаблицаЗаписей
	|ИЗ
	|	&ТаблицаЗаписей КАК ТаблицаЗаписей
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЗаписей.guid КАК guid,
	|	ТаблицаЗаписей.Удалить КАК Удалить,
	|	ТаблицаЗаписей.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА СкладскойЖурналВЕТИС.ДатаИзменения ЕСТЬ NULL ТОГДА
	|			ЛОЖЬ
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ КАК ЕстьЗапись
	|ИЗ
	|	ТаблицаЗаписей КАК ТаблицаЗаписей
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СкладскойЖурналВЕТИС КАК СкладскойЖурналВЕТИС
	|ПО
	|	ТаблицаЗаписей.guid = СкладскойЖурналВЕТИС.Идентификатор И 
	|	СкладскойЖурналВЕТИС.ХозяйствующийСубъект = &ХозяйствующийСубъект И 
	|	СкладскойЖурналВЕТИС.Предприятие = &Предприятие
	|ГДЕ
	|	ТаблицаЗаписей.Удалить = ИСТИНА ИЛИ 
	|	(ТаблицаЗаписей.Последняя = ИСТИНА И
	|	(СкладскойЖурналВЕТИС.ДатаИзменения ЕСТЬ NULL ИЛИ (НЕ СкладскойЖурналВЕТИС.ДатаИзменения = ТаблицаЗаписей.ДатаОбновления)))
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЗаписей.guid КАК guid
	|ИЗ
	|	ТаблицаЗаписей КАК ТаблицаЗаписей
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СкладскойЖурналВЕТИС КАК СкладскойЖурналВЕТИС
	|ПО
	|	ТаблицаЗаписей.guid = СкладскойЖурналВЕТИС.Идентификатор И 
	|	СкладскойЖурналВЕТИС.ХозяйствующийСубъект = &ХозяйствующийСубъект И 
	|	СкладскойЖурналВЕТИС.Предприятие = &Предприятие
	|ГДЕ
	|	ТаблицаЗаписей.Удалить = ЛОЖЬ И 
	|	ТаблицаЗаписей.Количество>0 И 
	|	ТаблицаЗаписей.Последняя = ИСТИНА И 
	|	(НЕ СкладскойЖурналВЕТИС.ДатаИзменения ЕСТЬ NULL) И 
	|	СкладскойЖурналВЕТИС.ДатаИзменения = ТаблицаЗаписей.ДатаОбновления
	|";
	
	Запрос.УстановитьПараметр("ТаблицаЗаписей",       ТаблицаЗаписей);
	Запрос.УстановитьПараметр("ХозяйствующийСубъект", ХозяйствующийСубъект);
	Запрос.УстановитьПараметр("Предприятие",          Предприятие);
	
	ПакетыЗапроса = Запрос.ВыполнитьПакет();
	Выборка           = ПакетыЗапроса[ПакетыЗапроса.Количество()-2].Выбрать();
	ВыборкаАктуальные = ПакетыЗапроса[ПакетыЗапроса.Количество()-1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Количество = 0 ИЛИ Выборка.Удалить Тогда
			Если Выборка.ЕстьЗапись Тогда
				НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.guid);
				УдалитьСкладскуюЗапись(НаборЗаписей, ХозяйствующийСубъект, Предприятие, Выборка.guid);
			КонецЕсли;
		Иначе
			НоваяСтрока = Результат.Добавить();
			НоваяСтрока.guid       = Выборка.guid;
			НоваяСтрока.ЕстьЗапись = Выборка.ЕстьЗапись;
		КонецЕсли;
		
	КонецЦикла;
	
	Пока ВыборкаАктуальные.Следующий() Цикл
		НаборЗаписей.Отбор.ХозяйствующийСубъект.Установить(ХозяйствующийСубъект);
		НаборЗаписей.Отбор.Предприятие.Установить(Предприятие);
		НаборЗаписей.Отбор.Идентификатор.Установить(ВыборкаАктуальные.guid);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Выбран() Тогда
			Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
				ЗаписьНабора.ДатаСинхронизации = ДатаСинхронизации;
			КонецЦикла;
		КонецЕсли;
		НаборЗаписей.Записать();
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Обрабатывает результат запроса актуальных записей складского журнала.
//
Функция ОбработатьРезультатЗапросаАктуальныхЗаписейСкладскогоЖурнала(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, ПараметрыОбмена, ДополнительныеПараметры = Неопределено) Экспорт
	
	НовыйСтатус     = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОбрабатывается;
	ОбъектИзменен   = Ложь;
	РазмерПорции    = ПараметрыОбмена.РазмерПорции;
	НастройкаПодключения = ПараметрыОбмена.НастройкиПодключения.Получить(ХозяйствующийСубъект);
	
	ПараметрыЗапроса = Неопределено;
	Если ДанныеДокумента.ПараметрыЗапроса <> Неопределено Тогда
		Значение = ДанныеДокумента.ПараметрыЗапроса.Получить();
		Если ТипЗнч(Значение) = Тип("Структура") Тогда
			ПараметрыЗапроса = Значение;
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект = Неопределено;
	//Если РезультатДобавленияЗаписей.ВходящееСообщение.НовоеСообщение Тогда
	ИзмененныеОбъекты = Новый Массив;
	
	Если ПараметрыЗапроса.ПервыйЗапрос Тогда
		ПараметрыЗапроса.Вставить("ДатаПервогоЗапроса", НачалоДня(ДополнительныеПараметры.ДанныеВыполненияЗаявки.issueDate));
	КонецЕсли;
	
	Если ДанныеДокумента.Объект <> Неопределено Тогда
		
		ПараметрыСписка = ДанныеДокумента.Объект.stockEntryList;
		ЗаписиЖурнала   = ПараметрыСписка.stockEntry;
		
		УстановитьПривилегированныйРежим(Истина);
		
		КоличествоИтераций = 1;
		ТекущаяИтерация = 1;
		
		// Если в ответ ВЕТИС включены не все актуальные записи,
		// сформируем сообщения для получения оставшихся.
		ОбработаныВсеДанные = Ложь;
		Если ПараметрыЗапроса <> Неопределено
			И (ПараметрыЗапроса.ПервыйЗапрос
			ИЛИ (Не ПараметрыЗапроса.ПервыйЗапрос И Не ПараметрыЗапроса.ПоследнийЗапрос)) Тогда // Для последовательной загрузки
			
			ЗагруженоЭлементов = ПараметрыСписка.offset + ПараметрыСписка.count;
			
			ЗагружатьПосле = Неопределено;
			
			Если НЕ РазмерПорции = 0 Тогда
				КоличествоИтераций = Окр((ПараметрыСписка.total/РазмерПорции)-0.5, 0)+1;
				ТекущаяИтерация    = Цел(ПараметрыСписка.offset/РазмерПорции)+1;
			КонецЕсли;
			
			// Строго последовательная загрузка измененных данных.
			// Параллельная загрузка на текущий момент может приводить к APLM0012.
			// Для включения параллельной загрузки использовать Цикл.
			Если ЗагруженоЭлементов < ПараметрыСписка.total Тогда
				Изменение = ПодготовитьЗапросЗаписей(РазмерПорции, ЗагруженоЭлементов, ПараметрыЗапроса, ПараметрыОбмена, ЗагружатьПосле, ЗагруженоЭлементов + РазмерПорции >= ПараметрыСписка.total);
				
				Если Изменение <> Неопределено Тогда
					ЗагружатьПосле = Изменение.ИсходящееСообщение;
				КонецЕсли;
				
				ЗагруженоЭлементов = ЗагруженоЭлементов + РазмерПорции;
				
			Иначе
				
				ОбработаныВсеДанные = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("ХозяйствующийСубъект", Метаданные.РегистрыСведений.СкладскойЖурналВЕТИС.Измерения.ХозяйствующийСубъект.Тип);
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Предприятие", Метаданные.РегистрыСведений.СкладскойЖурналВЕТИС.Измерения.Предприятие.Тип);
		
		СтрокаБлокировки = ТаблицыБлокируемыхСсылок.Добавить();
		СтрокаБлокировки.ХозяйствующийСубъект = ХозяйствующийСубъект;
		СтрокаБлокировки.Предприятие          = Предприятие;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СкладскойЖурналВЕТИС");
		ЭлементБлокировки.Режим          = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХозяйствующийСубъект", "ХозяйствующийСубъект");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Предприятие", "Предприятие");
		
		Блокировка.Заблокировать();
		
		НаборЗаписи = РегистрыСведений.СкладскойЖурналВЕТИС.СоздатьНаборЗаписей();
		
		СписокКЗагрузке = ПолучитьСписокКЗагрузкеСинхронизация(НаборЗаписи, ЗаписиЖурнала, ХозяйствующийСубъект, Предприятие,, ПараметрыЗапроса.ДатаПервогоЗапроса);
		
		НаборЗаписи = РегистрыСведений.СкладскойЖурналВЕТИС.СоздатьНаборЗаписей();
		
		//СчетчикЗаписей = 1;
		Процент        = 0;
		//РазмерТаблицы  = ЗаписиЖурнала.Количество();
		//РазмерПрогресса = 100/ЗаписиЖурнала.Количество();
		
		Прогресс     = 0;
		Если ЗаписиЖурнала.Количество()=0 Тогда
			ШагПрогресса = 1;
		Иначе
			ШагПрогресса = 100/ЗаписиЖурнала.Количество();
		КонецЕсли;
		
		Для Каждого ТекущаяСтрока Из ЗаписиЖурнала Цикл
			
			Если Прогресс >= Процент Тогда
				Процент = Процент + 1;
				
				//Процент = НомерСтроки/КоличествоСтрок;
				РезультатОбработкиСтроки = Новый Структура;
				РезультатОбработкиСтроки.Вставить("КоличествоИтераций", КоличествоИтераций);
				РезультатОбработкиСтроки.Вставить("ТекущаяИтерация",    ТекущаяИтерация);
				ДлительныеОперации.СообщитьПрогресс(Цел(Прогресс),, РезультатОбработкиСтроки);
				
			КонецЕсли;
			
			Прогресс = Прогресс + ШагПрогресса;
			
			НайденнаяЗапись = СписокКЗагрузке.Найти(ТекущаяСтрока.guid, "guid");
			Если НайденнаяЗапись = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ТекущаяСтрока.last = Ложь Тогда
				Продолжить;
			КонецЕсли;
			СформироватьЗаписьСкладскогоЖурнала(ПараметрыОбмена, НаборЗаписи, ХозяйствующийСубъект, Предприятие, ТекущаяСтрока,,НайденнаяЗапись.ЕстьЗапись, ПараметрыЗапроса.ДатаПервогоЗапроса, ИзмененныеОбъекты, Ложь);
			
		КонецЦикла;
		
		Если ОбработаныВсеДанные
			Или ПараметрыЗапроса.ПоследнийЗапрос Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДатаСинхронизации",    ПараметрыЗапроса.ДатаПервогоЗапроса);
			Запрос.УстановитьПараметр("ХозяйствующийСубъект", ХозяйствующийСубъект);
			Запрос.УстановитьПараметр("Предприятие",          Предприятие);
			
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	СкладскойЖурналВЕТИС.Идентификатор
			|ИЗ
			|	РегистрСведений.СкладскойЖурналВЕТИС КАК СкладскойЖурналВЕТИС
			|ГДЕ
			|	СкладскойЖурналВЕТИС.ДатаСинхронизации < &ДатаСинхронизации И 
			|	СкладскойЖурналВЕТИС.ХозяйствующийСубъект = &ХозяйствующийСубъект И 
			|	СкладскойЖурналВЕТИС.Предприятие = &Предприятие
			|";
			
			НачатьТранзакцию();
			
			Блокировка = Новый БлокировкаДанных;
			
			ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
			ТаблицыБлокируемыхСсылок.Колонки.Добавить("ХозяйствующийСубъект", Метаданные.РегистрыСведений.СкладскойЖурналВЕТИС.Измерения.ХозяйствующийСубъект.Тип);
			ТаблицыБлокируемыхСсылок.Колонки.Добавить("Предприятие", Метаданные.РегистрыСведений.СкладскойЖурналВЕТИС.Измерения.Предприятие.Тип);
			
			СтрокаБлокировки = ТаблицыБлокируемыхСсылок.Добавить();
			СтрокаБлокировки.ХозяйствующийСубъект = ХозяйствующийСубъект;
			СтрокаБлокировки.Предприятие          = Предприятие;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СкладскойЖурналВЕТИС");
			ЭлементБлокировки.Режим          = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХозяйствующийСубъект", "ХозяйствующийСубъект");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Предприятие",          "Предприятие");
			
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.СкладскойЖурналВЕТИС.СоздатьНаборЗаписей();
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				УдалитьСкладскуюЗапись(НаборЗаписей, ХозяйствующийСубъект, Предприятие, Выборка.Идентификатор);
				//НаборЗаписей.Отбор.ХозяйствующийСубъект.Установить(ХозяйствующийСубъект);
				//НаборЗаписей.Отбор.Предприятие.Установить(Предприятие);
				//НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор);
				//НаборЗаписей.Записать();
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		КонецЕсли;
		
		НовыйСтатус = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаВыполнена;
		
	КонецЕсли;
	
	ВозвращаемоеЗначение = ИнтеграцияВЕТИСКлиентСервер.СтруктураИзменения();
	ВозвращаемоеЗначение.ХозяйствующийСубъект = ХозяйствующийСубъект;
	ВозвращаемоеЗначение.Предприятие          = Предприятие;
	ВозвращаемоеЗначение.ВидОперации           = ДанныеДокумента.ВходящаяОперация;
	
	ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиОбработкиРезультата(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, Истина);
	ВозвращаемоеЗначение.ПодготовленоКПередаче = Ложь;
	ВозвращаемоеЗначение.Передано              = Ложь;
	ВозвращаемоеЗначение.Принято               = Истина;
	ВозвращаемоеЗначение.ЕстьОшибкиСервиса     = ДополнительныеПараметры.ЕстьОшибкиСервиса;
	
	ВозвращаемоеЗначение.ИсходящееСообщение = ДанныеДокумента.ИсходящееСообщение;
	ВозвращаемоеЗначение.ВходящееСообщение  = ДанныеДокумента.ИдентификаторЗаявки;
	
	ВозвращаемоеЗначение.Объект            = ДанныеДокумента.Документ;
	ВозвращаемоеЗначение.НовыйСтатус       = НовыйСтатус;
	ВозвращаемоеЗначение.ОбъектИзменен     = ОбъектИзменен;
	ВозвращаемоеЗначение.Объект            = ИзмененныеОбъекты(ИзмененныеОбъекты);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Обрабатывает результат запроса измененных записей складского журнала.
//
Функция ОбработатьРезультатЗапросаИзмененныхЗаписейСкладскогоЖурнала(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, ПараметрыОбмена, ДополнительныеПараметры = Неопределено) Экспорт
	
	НовыйСтатус     = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОбрабатывается;
	ОбъектИзменен   = Ложь;
	РазмерПорции    = ПараметрыОбмена.РазмерПорции;
	НастройкаПодключения = ПараметрыОбмена.НастройкиПодключения.Получить(ХозяйствующийСубъект);
	
	ПараметрыЗапроса = Неопределено;
	Если ДанныеДокумента.ПараметрыЗапроса <> Неопределено Тогда
		Значение = ДанныеДокумента.ПараметрыЗапроса.Получить();
		Если ТипЗнч(Значение) = Тип("Структура") Тогда
			ПараметрыЗапроса = Значение;
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект = Неопределено;
	//Если РезультатДобавленияЗаписей.ВходящееСообщение.НовоеСообщение Тогда
	ИзмененныеОбъекты = Новый Массив;
	
	Если ПараметрыЗапроса.ПервыйЗапрос Тогда
		ПараметрыЗапроса.Вставить("ДатаПервогоЗапроса", ПараметрыЗапроса.ДатаСинхронизации);
	КонецЕсли;
	
	ОбработаныВсеДанные = Ложь;
	Если ДанныеДокумента.Объект <> Неопределено Тогда
		
		ПараметрыСписка = ДанныеДокумента.Объект.stockEntryList;
		ЗаписиЖурнала   = ПараметрыСписка.stockEntry;
		
		УстановитьПривилегированныйРежим(Истина);
		
		КоличествоИтераций = 1;
		ТекущаяИтерация = 1;
		
		// Если в ответ ВЕТИС включены не все актуальные записи,
		// сформируем сообщения для получения оставшихся.
		Если ПараметрыЗапроса <> Неопределено
			И (ПараметрыЗапроса.ПервыйЗапрос
			ИЛИ (Не ПараметрыЗапроса.ПервыйЗапрос И Не ПараметрыЗапроса.ПоследнийЗапрос)) Тогда // Для последовательной загрузки
			
			ЗагруженоЭлементов = ПараметрыСписка.offset + ПараметрыСписка.count;
			
			ЗагружатьПосле = Неопределено;
			
			Если НЕ РазмерПорции = 0 Тогда
				КоличествоИтераций = Окр((ПараметрыСписка.total/РазмерПорции)-0.5, 0)+1;
				ТекущаяИтерация    = ПараметрыСписка.offset/РазмерПорции;
			КонецЕсли;
			
			// Строго последовательная загрузка измененных данных.
			// Параллельная загрузка на текущий момент может приводить к APLM0012.
			// Для включения параллельной загрузки использовать Цикл.
			Если ЗагруженоЭлементов < ПараметрыСписка.total Тогда
				Изменение = ПодготовитьЗапросЗаписей(РазмерПорции, ЗагруженоЭлементов, ПараметрыЗапроса, ПараметрыОбмена, ЗагружатьПосле, ЗагруженоЭлементов + РазмерПорции >= ПараметрыСписка.total);
				
				Если Изменение <> Неопределено Тогда
					ЗагружатьПосле = Изменение.ИсходящееСообщение;
				КонецЕсли;
				
				ЗагруженоЭлементов = ЗагруженоЭлементов + РазмерПорции;
				
			Иначе
				
				ОбработаныВсеДанные = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("ХозяйствующийСубъект", Метаданные.РегистрыСведений.СкладскойЖурналВЕТИС.Измерения.ХозяйствующийСубъект.Тип);
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Предприятие", Метаданные.РегистрыСведений.СкладскойЖурналВЕТИС.Измерения.Предприятие.Тип);
		
		СтрокаБлокировки = ТаблицыБлокируемыхСсылок.Добавить();
		СтрокаБлокировки.ХозяйствующийСубъект = ХозяйствующийСубъект;
		СтрокаБлокировки.Предприятие          = Предприятие;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СкладскойЖурналВЕТИС");
		ЭлементБлокировки.Режим          = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХозяйствующийСубъект", "ХозяйствующийСубъект");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Предприятие", "Предприятие");
		
		Блокировка.Заблокировать();
		
		НаборЗаписи = РегистрыСведений.СкладскойЖурналВЕТИС.СоздатьНаборЗаписей();
		
		СписокКЗагрузке = ПолучитьСписокКЗагрузке(НаборЗаписи, ЗаписиЖурнала, ХозяйствующийСубъект, Предприятие);
		
		//СчетчикЗаписей = 1;
		Процент        = 0;
		//РазмерПроцента = Цел(ЗаписиЖурнала.Количество()/100);
		
		Прогресс     = 0;
		Если ЗаписиЖурнала.Количество()=0 Тогда
			ШагПрогресса = 1;
		Иначе
			ШагПрогресса = 100/ЗаписиЖурнала.Количество();
		КонецЕсли;
		
		Для Каждого ТекущаяСтрока Из ЗаписиЖурнала Цикл
			
			Если Прогресс >= Процент Тогда
				Процент = Процент + 1;
				
				//Процент = НомерСтроки/КоличествоСтрок;
				РезультатОбработкиСтроки = Новый Структура;
				РезультатОбработкиСтроки.Вставить("КоличествоИтераций", КоличествоИтераций);
				РезультатОбработкиСтроки.Вставить("ТекущаяИтерация",    ТекущаяИтерация);
				ДлительныеОперации.СообщитьПрогресс(Цел(Прогресс),, РезультатОбработкиСтроки);
				
			КонецЕсли;
			
			Прогресс = Прогресс + ШагПрогресса;
			
			НайденнаяЗапись = СписокКЗагрузке.Найти(ТекущаяСтрока.guid, "guid");
			Если НайденнаяЗапись = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ТекущаяСтрока.last = Ложь Тогда
				Продолжить;
			КонецЕсли;
			СформироватьЗаписьСкладскогоЖурнала(ПараметрыОбмена, НаборЗаписи, ХозяйствующийСубъект, Предприятие, ТекущаяСтрока,,НайденнаяЗапись.ЕстьЗапись, ДополнительныеПараметры.ДанныеВыполненияЗаявки.prdcRsltDate, ИзмененныеОбъекты);
			
			//Если СчетчикЗаписей%РазмерПроцента = 1 Тогда
			//	Процент = Процент + 1;
			//	
			//	//Процент = НомерСтроки/КоличествоСтрок;
			//	РезультатОбработкиСтроки = Новый Структура;
			//	РезультатОбработкиСтроки.Вставить("КоличествоИтераций", КоличествоИтераций);
			//	РезультатОбработкиСтроки.Вставить("ТекущаяИтерация",    ТекущаяИтерация);
			//	ДлительныеОперации.СообщитьПрогресс(Процент,, РезультатОбработкиСтроки);
			//	
			//КонецЕсли;
			
			//СчетчикЗаписей = СчетчикЗаписей + 1;
			
		КонецЦикла;
		
		НовыйСтатус = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаВыполнена;
		
	КонецЕсли;
	
	ВозвращаемоеЗначение = ИнтеграцияВЕТИСКлиентСервер.СтруктураИзменения();
	ВозвращаемоеЗначение.ХозяйствующийСубъект = ХозяйствующийСубъект;
	ВозвращаемоеЗначение.Предприятие          = Предприятие;
	ВозвращаемоеЗначение.ВидОперации           = ДанныеДокумента.ВходящаяОперация;
	
	ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиОбработкиРезультата(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, Истина);
	ВозвращаемоеЗначение.ПодготовленоКПередаче = Ложь;
	ВозвращаемоеЗначение.Передано              = Ложь;
	ВозвращаемоеЗначение.Принято               = Истина;
	ВозвращаемоеЗначение.ЕстьОшибкиСервиса     = ДополнительныеПараметры.ЕстьОшибкиСервиса;
	
	ВозвращаемоеЗначение.ИсходящееСообщение = ДанныеДокумента.ИсходящееСообщение;
	ВозвращаемоеЗначение.ВходящееСообщение  = ДанныеДокумента.ИдентификаторЗаявки;
	
	ВозвращаемоеЗначение.Объект            = ДанныеДокумента.Документ;
	ВозвращаемоеЗначение.НовыйСтатус       = НовыйСтатус;
	ВозвращаемоеЗначение.ОбъектИзменен     = ОбъектИзменен;
	ВозвращаемоеЗначение.Объект            = ИзмененныеОбъекты(ИзмененныеОбъекты);
	
	Если ОбработаныВсеДанные ИЛИ ПараметрыЗапроса.ПоследнийЗапрос Тогда
		Попытка
			УстановитьДатуСинхронизации(ХозяйствующийСубъект, Предприятие, ДанныеДокумента.ВходящаяОперация, ПараметрыЗапроса.ДатаПервогоЗапроса, НастройкаПодключения.ИнтервалЗапросаИзмененныхДанных);
		Исключение
			ИнтеграцияВЕТИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(
			ПодробноеПредставлениеОшибки(
			ИнформацияОбОшибке())); 
		КонецПопытки;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Обрабатывает результат запроса актуальных записей ВСД.
//
Функция ОбработатьРезультатЗапросаВсехВСД(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, ПараметрыОбмена, ДополнительныеПараметры = Неопределено) Экспорт
	
	НовыйСтатус       = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОбрабатывается;
	ОбъектИзменен     = Ложь;
	РазмерПорции      = ПараметрыОбмена.РазмерПорции;
	НастройкаПодключения   = ПараметрыОбмена.НастройкиПодключения.Получить(ХозяйствующийСубъект);
	ИзмененныеОбъекты = Новый Массив;
	
	НастройкаПодключения.Вставить("ОбновлятьСправочники", Ложь);
	
	ПараметрыЗапроса = Неопределено;
	Если ДанныеДокумента.ПараметрыЗапроса <> Неопределено Тогда
		Значение = ДанныеДокумента.ПараметрыЗапроса.Получить();
		Если ТипЗнч(Значение) = Тип("Структура") Тогда
			ПараметрыЗапроса = Значение;
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект = Неопределено;
	//Если РезультатДобавленияЗаписей.ВходящееСообщение.НовоеСообщение Тогда
	
	Если ДанныеДокумента.Объект <> Неопределено Тогда
		
		ПараметрыСписка = ДанныеДокумента.Объект.vetDocumentList;
		ЗаписиВСД       = ПараметрыСписка.vetDocument;
		
		//Если ПараметрыСписка.count = "0" Тогда
		//	Возврат Истина;
		//КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		КоличествоИтераций = 1;
		ТекущаяИтерация = 1;
		
		// Если в ответ ВЕТИС включены не все актуальные записи,
		// сформируем сообщения для получения оставшихся.
		ОбработаныВсеДанные = Ложь;
		Если ПараметрыЗапроса <> Неопределено
			И (ПараметрыЗапроса.ПервыйЗапрос
			ИЛИ (Не ПараметрыЗапроса.ПервыйЗапрос И Не ПараметрыЗапроса.ПоследнийЗапрос)) Тогда // Для последовательной загрузки
			
			ЗагруженоЭлементов = ПараметрыСписка.offset + ПараметрыСписка.count;
			
			ЗагружатьПосле = Неопределено;
			
			Если НЕ РазмерПорции = 0 Тогда
				КоличествоИтераций = Окр((ПараметрыСписка.total/РазмерПорции)-0.5, 0)+1;
				ТекущаяИтерация    = Цел(ПараметрыСписка.offset/РазмерПорции)+1;
			КонецЕсли;
			
			// Строго последовательная загрузка измененных данных.
			// Параллельная загрузка на текущий момент может приводить к APLM0012.
			// Для включения параллельной загрузки использовать Цикл.
			Если ЗагруженоЭлементов < ПараметрыСписка.total Тогда
				Изменение = ПодготовитьЗапросЗаписей(РазмерПорции, ЗагруженоЭлементов, ПараметрыЗапроса, ПараметрыОбмена, ЗагружатьПосле, ЗагруженоЭлементов + РазмерПорции >= ПараметрыСписка.total);
				
				Если Изменение <> Неопределено Тогда
					ЗагружатьПосле = Изменение.ИсходящееСообщение;
				КонецЕсли;
				
				ЗагруженоЭлементов = ЗагруженоЭлементов + РазмерПорции;
				
			Иначе
				
				ОбработаныВсеДанные = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Процент  = 0;
		Прогресс = 0;
		Если ЗаписиВСД.Количество()=0 Тогда
			ШагПрогресса = 1;
		Иначе
			ШагПрогресса = 100/ЗаписиВСД.Количество();
		КонецЕсли;
		
		Для Каждого ТекущаяСтрока Из ЗаписиВСД Цикл
			
			Если Прогресс >= Процент Тогда
				Процент = Процент + 1;
				
				//Процент = НомерСтроки/КоличествоСтрок;
				РезультатОбработкиСтроки = Новый Структура;
				РезультатОбработкиСтроки.Вставить("КоличествоИтераций", КоличествоИтераций);
				РезультатОбработкиСтроки.Вставить("ТекущаяИтерация",    ТекущаяИтерация);
				ДлительныеОперации.СообщитьПрогресс(Цел(Прогресс),, РезультатОбработкиСтроки);
				
			КонецЕсли;
			
			Прогресс = Прогресс + ШагПрогресса;
			
			//ДатаОформления = ТекущаяСтрока.issueDate;
			
			//Если ЕстьДатаНачала И ОтборДатаНачала > ДатаОформления Тогда
			//	Продолжить;
			//КонецЕсли;
			//
			//Если ЕстьДатаОкончания И ОтборДатаОкончания < ДатаОформления Тогда
			//	Продолжить;
			//КонецЕсли;
			
			СсылкаВСД = ЗагрузитьВСД(НастройкаПодключения, ХозяйствующийСубъект, Предприятие, ТекущаяСтрока);
			ИзмененныеОбъекты.Добавить(СсылкаВСД);
		КонецЦикла;
		
		НовыйСтатус = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаВыполнена;
		
	КонецЕсли;
	
	ВозвращаемоеЗначение = ИнтеграцияВЕТИСКлиентСервер.СтруктураИзменения();
	ВозвращаемоеЗначение.ХозяйствующийСубъект = ХозяйствующийСубъект;
	ВозвращаемоеЗначение.Предприятие          = Предприятие;
	ВозвращаемоеЗначение.ВидОперации           = ДанныеДокумента.ВходящаяОперация;
	
	ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиОбработкиРезультата(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, Истина);
	ВозвращаемоеЗначение.ПодготовленоКПередаче = Ложь;
	ВозвращаемоеЗначение.Передано              = Ложь;
	ВозвращаемоеЗначение.Принято               = Истина;
	ВозвращаемоеЗначение.ЕстьОшибкиСервиса     = ДополнительныеПараметры.ЕстьОшибкиСервиса;
	
	ВозвращаемоеЗначение.ИсходящееСообщение = ДанныеДокумента.ИсходящееСообщение;
	ВозвращаемоеЗначение.ВходящееСообщение  = ДанныеДокумента.ИдентификаторЗаявки;
	
	//ВозвращаемоеЗначение.Объект            = ДанныеДокумента.Документ;
	ВозвращаемоеЗначение.НовыйСтатус       = НовыйСтатус;
	ВозвращаемоеЗначение.ОбъектИзменен     = ОбъектИзменен;
	ВозвращаемоеЗначение.Объект            = ИзмененныеОбъекты(ИзмененныеОбъекты);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Обрабатывает результат запроса измененных записей ВСД.
//
Функция ОбработатьРезультатЗапросаИзмененныхВСД(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, ПараметрыОбмена, ДополнительныеПараметры = Неопределено) Экспорт
	
	НовыйСтатус       = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОбрабатывается;
	ОбъектИзменен     = Ложь;
	РазмерПорции      = ПараметрыОбмена.РазмерПорции;
	НастройкаПодключения   = ПараметрыОбмена.НастройкиПодключения.Получить(ХозяйствующийСубъект);
	ИзмененныеОбъекты = Новый Массив;
	
	ПараметрыЗапроса = Неопределено;
	Если ДанныеДокумента.ПараметрыЗапроса <> Неопределено Тогда
		Значение = ДанныеДокумента.ПараметрыЗапроса.Получить();
		Если ТипЗнч(Значение) = Тип("Структура") Тогда
			ПараметрыЗапроса = Значение;
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект = Неопределено;
	
	Если ПараметрыЗапроса.ПервыйЗапрос Тогда
		ПараметрыЗапроса.Вставить("ДатаПервогоЗапроса", ПараметрыЗапроса.ДатаСинхронизации);
	КонецЕсли;
	
	//Если РезультатДобавленияЗаписей.ВходящееСообщение.НовоеСообщение Тогда
	ОбработаныВсеДанные = Ложь;
	Если ДанныеДокумента.Объект <> Неопределено Тогда
		
		ПараметрыСписка = ДанныеДокумента.Объект.vetDocumentList;
		ЗаписиВСД       = ПараметрыСписка.vetDocument;
		
		//Если ПараметрыСписка.count = "0" Тогда
		//	Возврат Истина;
		//КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		КоличествоИтераций = 1;
		ТекущаяИтерация = 1;
		
		// Если в ответ ВЕТИС включены не все актуальные записи,
		// сформируем сообщения для получения оставшихся.
		Если ПараметрыЗапроса <> Неопределено
			И (ПараметрыЗапроса.ПервыйЗапрос
			ИЛИ (Не ПараметрыЗапроса.ПервыйЗапрос И Не ПараметрыЗапроса.ПоследнийЗапрос)) Тогда // Для последовательной загрузки
			
			ЗагруженоЭлементов = ПараметрыСписка.offset + ПараметрыСписка.count;
			
			ЗагружатьПосле = Неопределено;
			
			Если НЕ РазмерПорции = 0 Тогда
				КоличествоИтераций = Окр((ПараметрыСписка.total/РазмерПорции)-0.5, 0)+1;
				ТекущаяИтерация    = Цел(ПараметрыСписка.offset/РазмерПорции)+1;
			КонецЕсли;
			
			// Строго последовательная загрузка измененных данных.
			// Параллельная загрузка на текущий момент может приводить к APLM0012.
			// Для включения параллельной загрузки использовать Цикл.
			Если ЗагруженоЭлементов < ПараметрыСписка.total Тогда
				Изменение = ПодготовитьЗапросЗаписей(РазмерПорции, ЗагруженоЭлементов, ПараметрыЗапроса, ПараметрыОбмена, ЗагружатьПосле, ЗагруженоЭлементов + РазмерПорции >= ПараметрыСписка.total);
				
				Если Изменение <> Неопределено Тогда
					ЗагружатьПосле = Изменение.ИсходящееСообщение;
				КонецЕсли;
				
				ЗагруженоЭлементов = ЗагруженоЭлементов + РазмерПорции;
				
			Иначе
				
				ОбработаныВсеДанные = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//СчетчикЗаписей = 1;
		Процент        = 0;
		//РазмерТаблицы  = ЗаписиЖурнала.Количество();
		//РазмерПрогресса = 100/ЗаписиЖурнала.Количество();
		
		Прогресс     = 0;
		Если ЗаписиВСД.Количество()=0 Тогда
			ШагПрогресса = 1;
		Иначе
			ШагПрогресса = 100/ЗаписиВСД.Количество();
		КонецЕсли;
		
		Для Каждого ТекущаяСтрока Из ЗаписиВСД Цикл
			
			Если Прогресс >= Процент Тогда
				Процент = Процент + 1;
				
				//Процент = НомерСтроки/КоличествоСтрок;
				РезультатОбработкиСтроки = Новый Структура;
				РезультатОбработкиСтроки.Вставить("КоличествоИтераций", КоличествоИтераций);
				РезультатОбработкиСтроки.Вставить("ТекущаяИтерация",    ТекущаяИтерация);
				ДлительныеОперации.СообщитьПрогресс(Цел(Прогресс),, РезультатОбработкиСтроки);
				
			КонецЕсли;
			
			Прогресс = Прогресс + ШагПрогресса;
			
			//ДатаОформления = ТекущаяСтрока.lastUpdateDate;
			
			//Если ЕстьДатаНачала И ОтборДатаНачала > ДатаОформления Тогда
			//	Продолжить;
			//КонецЕсли;
			//
			//Если ЕстьДатаОкончания И ОтборДатаОкончания < ДатаОформления Тогда
			//	Продолжить;
			//КонецЕсли;
			
			СсылкаВСД = ЗагрузитьВСД(НастройкаПодключения, ХозяйствующийСубъект, Предприятие, ТекущаяСтрока);
			ИзмененныеОбъекты.Добавить(СсылкаВСД);
		КонецЦикла;
		
		НовыйСтатус = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаВыполнена;
		
	КонецЕсли;
	
	ВозвращаемоеЗначение = ИнтеграцияВЕТИСКлиентСервер.СтруктураИзменения();
	ВозвращаемоеЗначение.ХозяйствующийСубъект = ХозяйствующийСубъект;
	ВозвращаемоеЗначение.Предприятие          = Предприятие;
	ВозвращаемоеЗначение.ВидОперации           = ДанныеДокумента.ВходящаяОперация;
	
	ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиОбработкиРезультата(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, Истина);
	ВозвращаемоеЗначение.ПодготовленоКПередаче = Ложь;
	ВозвращаемоеЗначение.Передано              = Ложь;
	ВозвращаемоеЗначение.Принято               = Истина;
	ВозвращаемоеЗначение.ЕстьОшибкиСервиса     = ДополнительныеПараметры.ЕстьОшибкиСервиса;
	
	ВозвращаемоеЗначение.ИсходящееСообщение = ДанныеДокумента.ИсходящееСообщение;
	ВозвращаемоеЗначение.ВходящееСообщение  = ДанныеДокумента.ИдентификаторЗаявки;
	
	//ВозвращаемоеЗначение.Объект            = ДанныеДокумента.Документ;
	ВозвращаемоеЗначение.НовыйСтатус       = НовыйСтатус;
	ВозвращаемоеЗначение.ОбъектИзменен     = ОбъектИзменен;
	ВозвращаемоеЗначение.Объект            = ИзмененныеОбъекты(ИзмененныеОбъекты);
	
	Если ОбработаныВсеДанные ИЛИ ПараметрыЗапроса.ПоследнийЗапрос Тогда
		Попытка
			УстановитьДатуСинхронизации(ХозяйствующийСубъект, Предприятие, ДанныеДокумента.ВходящаяОперация, ПараметрыЗапроса.ДатаПервогоЗапроса, НастройкаПодключения.ИнтервалЗапросаИзмененныхДанных);
		Исключение
			ИнтеграцияВЕТИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(
			ПодробноеПредставлениеОшибки(
			ИнформацияОбОшибке())); 
		КонецПопытки;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Обрабатывает результат запроса измененных записей ВСД.
//
Функция ОбработатьРезультатРегистрацииИзмененияПродукции(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, ПараметрыОбмена, ДополнительныеПараметры = Неопределено) Экспорт
	
	НовыйСтатус       = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОбрабатывается;
	ОбъектИзменен     = Ложь;
	НастройкаПодключения   = ПараметрыОбмена.НастройкиПодключения.Получить(ХозяйствующийСубъект);
	ИзмененныеОбъекты = Новый Массив;
	
	ПараметрыЗапроса = Неопределено;
	Если ДанныеДокумента.ПараметрыЗапроса <> Неопределено Тогда
		Значение = ДанныеДокумента.ПараметрыЗапроса.Получить();
		Если ТипЗнч(Значение) = Тип("Структура") Тогда
			ПараметрыЗапроса = Значение;
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект = Неопределено;
	//Если РезультатДобавленияЗаписей.ВходящееСообщение.НовоеСообщение Тогда
	Если ДанныеДокумента.Объект <> Неопределено Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Для Каждого ТекущаяСтрока Из ДанныеДокумента.Объект.productItemList.productItem Цикл
			//СсылкаВСД = ЗагрузитьВСД(НастройкаПодключения, ХозяйствующийСубъект, Предприятие, ДанныеДокумента.Объект.vetDocument,,Истина);
			
			Если ТекущаяСтрока.status = 400 Тогда
				НайденноеНаименованиеПродукции = Справочники.ПродукцияВЕТИС.НайтиПоКоду(ТекущаяСтрока.guid);
				Если ЗначениеЗаполнено(НайденноеНаименованиеПродукции) Тогда
					СпрОбъект = НайденноеНаименованиеПродукции.ПолучитьОбъект();
					СпрОбъект.УстановитьПометкуУдаления(Истина);
					ИзмененныеОбъекты.Добавить(СпрОбъект.Ссылка);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если НРег(ТекущаяСтрока.active) = "false" Тогда
				Продолжить;
			КонецЕсли;
			
			ТипПродукции = Справочники.ПродукцияВЕТИС.НайтиПоКоду(ТекущаяСтрока.productType, Истина);
			Продукция    = Справочники.ПродукцияВЕТИС.НайтиПоКоду(ТекущаяСтрока.product.guid);
			ВидПродукции = Справочники.ПродукцияВЕТИС.НайтиПоКоду(ТекущаяСтрока.subProduct.guid);
			
			ИзмененнаяПродукция = ЗагрузитьНаименованиеПродукции(НастройкаПодключения, , ТекущаяСтрока, ТипПродукции, Продукция, ВидПродукции);
			Если (НЕ ИзмененнаяПродукция = Неопределено) И ЗначениеЗаполнено(ПараметрыЗапроса.Объект) Тогда
				МенеджерЗаписиСоответствиеНоменклатурыМеркурий = РегистрыСведений.СоответствиеНоменклатурыВЕТИС.СоздатьМенеджерЗаписи();
				МенеджерЗаписиСоответствиеНоменклатурыМеркурий.Номенклатура = ПараметрыЗапроса.Объект;
				МенеджерЗаписиСоответствиеНоменклатурыМеркурий.Продукция    = ИзмененнаяПродукция;
				МенеджерЗаписиСоответствиеНоменклатурыМеркурий.Записать();
			КонецЕсли;
			
			ИзмененныеОбъекты.Добавить(ИзмененнаяПродукция);
			
			НовыйСтатус = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаВыполнена;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ВозвращаемоеЗначение = ИнтеграцияВЕТИСКлиентСервер.СтруктураИзменения();
	ВозвращаемоеЗначение.ХозяйствующийСубъект = ХозяйствующийСубъект;
	ВозвращаемоеЗначение.Предприятие          = Предприятие;
	ВозвращаемоеЗначение.ВидОперации           = ДанныеДокумента.ВходящаяОперация;
	
	ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиОбработкиРезультата(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, Истина);
	ВозвращаемоеЗначение.ПодготовленоКПередаче = Ложь;
	ВозвращаемоеЗначение.Передано              = Ложь;
	ВозвращаемоеЗначение.Принято               = Истина;
	ВозвращаемоеЗначение.ЕстьОшибкиСервиса     = ДополнительныеПараметры.ЕстьОшибкиСервиса;
	
	ВозвращаемоеЗначение.ИсходящееСообщение = ДанныеДокумента.ИсходящееСообщение;
	ВозвращаемоеЗначение.ВходящееСообщение  = ДанныеДокумента.ИдентификаторЗаявки;
	
	//ВозвращаемоеЗначение.Объект            = ДанныеДокумента.Документ;
	ВозвращаемоеЗначение.Объект            = ИзмененныеОбъекты(ИзмененныеОбъекты);
	ВозвращаемоеЗначение.НовыйСтатус       = НовыйСтатус;
	ВозвращаемоеЗначение.ОбъектИзменен     = ОбъектИзменен;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Обрабатывает результат запроса измененных записей ВСД.
//
Функция ОбработатьРезультатЗапросаЗаписиСкладскогоЖурнала(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, ПараметрыОбмена, ДополнительныеПараметры = Неопределено) Экспорт
	
	НовыйСтатус     = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОбрабатывается;
	ОбъектИзменен   = Ложь;
	НастройкаПодключения = ПараметрыОбмена.НастройкиПодключения.Получить(ХозяйствующийСубъект);
	
	ПараметрыЗапроса = Неопределено;
	Если ДанныеДокумента.ПараметрыЗапроса <> Неопределено Тогда
		Значение = ДанныеДокумента.ПараметрыЗапроса.Получить();
		Если ТипЗнч(Значение) = Тип("Структура") Тогда
			ПараметрыЗапроса = Значение;
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект = Неопределено;
	//Если РезультатДобавленияЗаписей.ВходящееСообщение.НовоеСообщение Тогда
	ИзмененныеОбъекты = Новый Массив;
	
	Если ДанныеДокумента.Объект <> Неопределено Тогда
		
		//ПараметрыСписка = ДанныеДокумента.Объект.stockEntryList;
		stockEntry   = ДанныеДокумента.Объект.stockEntry;
		Если ТипЗнч(stockEntry) = Тип("Массив") Тогда
			ЗаписиЖурнала = stockEntry;
		Иначе
			ЗаписиЖурнала = Новый Массив;
			ЗаписиЖурнала.Добавить(stockEntry);
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		Блокировка = Новый БлокировкаДанных;
		
		ТаблицыБлокируемыхСсылок = Новый ТаблицаЗначений;
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("ХозяйствующийСубъект", Метаданные.РегистрыСведений.СкладскойЖурналВЕТИС.Измерения.ХозяйствующийСубъект.Тип);
		ТаблицыБлокируемыхСсылок.Колонки.Добавить("Предприятие", Метаданные.РегистрыСведений.СкладскойЖурналВЕТИС.Измерения.Предприятие.Тип);
		
		СтрокаБлокировки = ТаблицыБлокируемыхСсылок.Добавить();
		СтрокаБлокировки.ХозяйствующийСубъект = ХозяйствующийСубъект;
		СтрокаБлокировки.Предприятие          = Предприятие;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СкладскойЖурналВЕТИС");
		ЭлементБлокировки.Режим          = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = ТаблицыБлокируемыхСсылок;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ХозяйствующийСубъект", "ХозяйствующийСубъект");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Предприятие", "Предприятие");
		
		Блокировка.Заблокировать();
		
		НаборЗаписи = РегистрыСведений.СкладскойЖурналВЕТИС.СоздатьНаборЗаписей();
		
		Перезаполнить = ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗапроса, "Перезаполнить", Ложь);
		
		СписокКЗагрузке = ПолучитьСписокКЗагрузке(НаборЗаписи, ЗаписиЖурнала, ХозяйствующийСубъект, Предприятие,, Перезаполнить);
		Для Каждого ТекущаяСтрока Из ЗаписиЖурнала Цикл
			НайденнаяЗапись = СписокКЗагрузке.Найти(ТекущаяСтрока.guid, "guid");
			Если НайденнаяЗапись = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ТекущаяСтрока.last = Ложь Тогда
				Продолжить;
			КонецЕсли;
			СформироватьЗаписьСкладскогоЖурнала(ПараметрыОбмена, НаборЗаписи, ХозяйствующийСубъект, Предприятие, ТекущаяСтрока,,НайденнаяЗапись.ЕстьЗапись, ДополнительныеПараметры.ДанныеВыполненияЗаявки.prdcRsltDate, ИзмененныеОбъекты);
		КонецЦикла;
		
		НовыйСтатус = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаВыполнена;
		
	КонецЕсли;
	
	ВозвращаемоеЗначение = ИнтеграцияВЕТИСКлиентСервер.СтруктураИзменения();
	ВозвращаемоеЗначение.ХозяйствующийСубъект = ХозяйствующийСубъект;
	ВозвращаемоеЗначение.Предприятие          = Предприятие;
	ВозвращаемоеЗначение.ВидОперации           = ДанныеДокумента.ВходящаяОперация;
	
	ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиОбработкиРезультата(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, Истина);
	ВозвращаемоеЗначение.ПодготовленоКПередаче = Ложь;
	ВозвращаемоеЗначение.Передано              = Ложь;
	ВозвращаемоеЗначение.Принято               = Истина;
	ВозвращаемоеЗначение.ЕстьОшибкиСервиса     = ДополнительныеПараметры.ЕстьОшибкиСервиса;
	
	ВозвращаемоеЗначение.ИсходящееСообщение = ДанныеДокумента.ИсходящееСообщение;
	ВозвращаемоеЗначение.ВходящееСообщение  = ДанныеДокумента.ИдентификаторЗаявки;
	
	ВозвращаемоеЗначение.Объект            = ДанныеДокумента.Документ;
	ВозвращаемоеЗначение.НовыйСтатус       = НовыйСтатус;
	ВозвращаемоеЗначение.ОбъектИзменен     = ОбъектИзменен;
	ВозвращаемоеЗначение.Объект            = ИзмененныеОбъекты(ИзмененныеОбъекты);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ОбработатьРезультатЗапросаВСД(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, ПараметрыОбмена, ДополнительныеПараметры = Неопределено) Экспорт
	
	НовыйСтатус       = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаОбрабатывается;
	ОбъектИзменен     = Ложь;
	НастройкаПодключения   = ПараметрыОбмена.НастройкиПодключения.Получить(ХозяйствующийСубъект);
	ИзмененныеОбъекты = Новый Массив;
	
	ПараметрыЗапроса = Неопределено;
	Если ДанныеДокумента.ПараметрыЗапроса <> Неопределено Тогда
		Значение = ДанныеДокумента.ПараметрыЗапроса.Получить();
		Если ТипЗнч(Значение) = Тип("Структура") Тогда
			ПараметрыЗапроса = Значение;
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект = Неопределено;
	//Если РезультатДобавленияЗаписей.ВходящееСообщение.НовоеСообщение Тогда
	Если ДанныеДокумента.Объект <> Неопределено Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		СсылкаВСД = ЗагрузитьВСД(НастройкаПодключения, ХозяйствующийСубъект, Предприятие, ДанныеДокумента.Объект.vetDocument,,Истина);
		ИзмененныеОбъекты.Добавить(СсылкаВСД);
		
		НовыйСтатус = Перечисления.СтатусыОбработкиСообщенийВЕТИС.ЗаявкаВыполнена;
		
	КонецЕсли;
	
	ВозвращаемоеЗначение = ИнтеграцияВЕТИСКлиентСервер.СтруктураИзменения();
	ВозвращаемоеЗначение.ХозяйствующийСубъект = ХозяйствующийСубъект;
	ВозвращаемоеЗначение.Предприятие          = Предприятие;
	ВозвращаемоеЗначение.ВидОперации           = ДанныеДокумента.ВходящаяОперация;
	
	ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиОбработкиРезультата(ДанныеДокумента, ХозяйствующийСубъект, Предприятие, Истина);
	ВозвращаемоеЗначение.ПодготовленоКПередаче = Ложь;
	ВозвращаемоеЗначение.Передано              = Ложь;
	ВозвращаемоеЗначение.Принято               = Истина;
	ВозвращаемоеЗначение.ЕстьОшибкиСервиса     = ДополнительныеПараметры.ЕстьОшибкиСервиса;
	
	ВозвращаемоеЗначение.ИсходящееСообщение = ДанныеДокумента.ИсходящееСообщение;
	ВозвращаемоеЗначение.ВходящееСообщение  = ДанныеДокумента.ИдентификаторЗаявки;
	
	//ВозвращаемоеЗначение.Объект            = ДанныеДокумента.Документ;
	ВозвращаемоеЗначение.Объект            = ИзмененныеОбъекты(ИзмененныеОбъекты);
	ВозвращаемоеЗначение.НовыйСтатус       = НовыйСтатус;
	ВозвращаемоеЗначение.ОбъектИзменен     = ОбъектИзменен;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область РаботаСФормами

&НаСервере
Процедура УстановитьПараметрыВыбораПредприятий(ЭлементыПредприятие, ХозяйствующийСубъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Предприятия.Предприятие КАК Предприятие
	|ИЗ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС.Предприятия КАК Предприятия
	|ГДЕ
	|	Предприятия.Ссылка = &ХозяйствующийСубъект
	|";
	
	Запрос.УстановитьПараметр("ХозяйствующийСубъект", ХозяйствующийСубъект);
	
	Результат = Запрос.Выполнить().Выгрузить();
	ЗначениеПараметра = Результат.ВыгрузитьКолонку("Предприятие");
	
	Если ЗначениеПараметра.Количество() = 0 Тогда
		УправлениеДиалогомСервер.УдалитьПараметрВыбора(ЭлементыПредприятие.ПараметрыВыбора, "Отбор.Ссылка");
	Иначе
		УправлениеДиалогомСервер.ОбновитьПараметрВыбора(ЭлементыПредприятие.ПараметрыВыбора, "Отбор.Ссылка", ЗначениеПараметра);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ПодобратьПодходящуюПартию(ДокументОбъект, ТоварнаяСтрока, Продукция, КоличествоТовара, ТаблицаЗапасов, ТаблицаУпаковки, ТаблицаОшибок, ВыводитьСообщения = Ложь, ЕстьСпособХранения = Ложь)
	
	НайденныеЗапасы = ТаблицаЗапасов.НайтиСтроки(Новый Структура("Продукция", Продукция));
	Для Каждого СтрокаЗапасов Из НайденныеЗапасы Цикл
		
		Если КоличествоТовара = 0 Тогда
			Прервать;
		КонецЕсли;
		
		НоваяСтрока = ДокументОбъект.Партии.Добавить();
		НоваяСтрока.ИдентификаторСтроки       = ТоварнаяСтрока.ИдентификаторСтроки;
		//НоваяСтрока.ИдентификаторСтрокиПартий = СтрокаЗапасов.Идентификатор;
		НоваяСтрока.ЕдиницаИзмерения          = СтрокаЗапасов.ЕдиницаИзмерения;
		НоваяСтрока.Продукция                 = СтрокаЗапасов.Продукция;
		НоваяСтрока.НомерЗаписи               = СтрокаЗапасов.НомерЗаписи;
		НоваяСтрока.Идентификатор             = СтрокаЗапасов.Идентификатор;
		НоваяСтрока.ИдентификаторСтрокиПартий = Новый УникальныйИдентификатор;
		НоваяСтрока.СрокГодности              = СтрокаЗапасов.СрокГодности;
		КоличествоЗапасов = СтрокаЗапасов.Количество;
		УдалениеЗаписи    = Ложь;
		
		Если КоличествоТовара >= СтрокаЗапасов.Количество Тогда
			НоваяСтрока.Количество = СтрокаЗапасов.Количество;
			УдалениеЗаписи = Истина;
		Иначе
			НоваяСтрока.Количество   = КоличествоТовара;
			СтрокаЗапасов.Количество = СтрокаЗапасов.Количество - КоличествоТовара;
		КонецЕсли;
		
		УпаковкиЗапасов = ТаблицаУпаковки.НайтиСтроки(Новый Структура("Идентификатор", СтрокаЗапасов.Идентификатор));
		ПредставлениеМаркировки = ИнтеграцияВЕТИС.ПолучитьМаркировкуПроизводитель(СтрокаЗапасов.СвойствоЗаписи);
		Если УпаковкиЗапасов.Количество() = 0 Тогда
			ЗапросУпаковок = Новый Запрос;
			ЗапросУпаковок.Текст = "
			|ВЫБРАТЬ
			|	СопроводительныеДокументы.ВСД
			|ПОМЕСТИТЬ
			|	ТаблицаВСД
			|ИЗ
			|	Справочник.СвойстваЗаписейСкладскогоЖурналаВЕТИС.СопроводительныеДокументы КАК СопроводительныеДокументы
			|ГДЕ
			|	СопроводительныеДокументы.Ссылка = &СвойствоЗаписи
			|;
			|
			|ВЫБРАТЬ
			|	ТаблицаВСД.ВСД КАК ВСД,
			|	СвойстваЗаписейУпаковки.УровеньУпаковки,
			|	СвойстваЗаписейУпаковки.Упаковка,
			|	СвойстваЗаписейМаркировка.Маркировка,
			|	СвойстваЗаписейМаркировка.ТипМаркировки
			|ИЗ
			|	ТаблицаВСД КАК ТаблицаВСД
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|	Документ.ВСДВЕТИС.Упаковки КАК СвойстваЗаписейУпаковки
			|ПО
			|	ТаблицаВСД.ВСД = СвойстваЗаписейУпаковки.Ссылка
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	Документ.ВСДВЕТИС.Маркировка КАК СвойстваЗаписейМаркировка
			|ПО
			|	СвойстваЗаписейУпаковки.Ссылка = СвойстваЗаписейМаркировка.Ссылка И 
			|	СвойстваЗаписейУпаковки.ИдентификаторСтроки = СвойстваЗаписейМаркировка.ИдентификаторСтроки
			|ИТОГИ
			|ПО
			|	ВСД
			|";
			
			ЗапросУпаковок.УстановитьПараметр("СвойствоЗаписи", СтрокаЗапасов.СвойствоЗаписи);
			РезультатЗапроса = ЗапросУпаковок.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				НоваяСтрокаУпаковок = ДокументОбъект.Упаковки.Добавить();
				НоваяСтрокаУпаковок.УровеньУпаковки     = "Транспортный (Логистический) уровень";
				НоваяСтрокаУпаковок.Упаковка            = ИнтеграцияВЕТИС.ЗагрузитьТипУпаковки("fedf4328-053c-11e1-99b4-d8d385fbc9e8");
				НоваяСтрокаУпаковок.ИдентификаторСтроки = НоваяСтрока.ИдентификаторСтрокиПартий;
				НоваяСтрокаУпаковок.КоличествоУпаковок  = 1;
				НоваяСтрокаУпаковок.Маркировка          = ПредставлениеМаркировки;
				НоваяСтрокаУпаковок.ТипМаркировки       = "UNDEFINED";
				
			Иначе
				ВыборкаПоВСД = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Если ВыборкаПоВСД.Следующий() Тогда
					Выборка = ВыборкаПоВСД.Выбрать();
					Пока Выборка.Следующий() Цикл
						
						НоваяСтрокаУпаковок = ДокументОбъект.Упаковки.Добавить();
						НоваяСтрокаУпаковок.УровеньУпаковки     = Выборка.УровеньУпаковки;
						НоваяСтрокаУпаковок.Упаковка            = Выборка.Упаковка;
						НоваяСтрокаУпаковок.ИдентификаторСтроки = НоваяСтрока.ИдентификаторСтрокиПартий;
						НоваяСтрокаУпаковок.Маркировка          = Выборка.Маркировка;
						НоваяСтрокаУпаковок.ТипМаркировки       = Выборка.ТипМаркировки;
						Если ПустаяСтрока(НоваяСтрокаУпаковок.Маркировка) И ПустаяСтрока(НоваяСтрокаУпаковок.ТипМаркировки) Тогда
							НоваяСтрокаУпаковок.Маркировка      = ПредставлениеМаркировки;
							НоваяСтрокаУпаковок.ТипМаркировки   = "UNDEFINED";
						КонецЕсли;
						НоваяСтрокаУпаковок.КоличествоУпаковок  = 1;
						
						//ИдентификаторСтрокиПартий = ИдентификаторСтрокиПартий + 1;
						
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		Иначе
			
			Для Каждого ТекущаяУпаковка Из УпаковкиЗапасов Цикл
				
				КоличествоУпаковок = 0;
				Если ТекущаяУпаковка.КоличествоУпаковок>0 Тогда
					Если УдалениеЗаписи Тогда
						КоличествоУпаковок = ТекущаяУпаковка.КоличествоУпаковок;
					Иначе
						Коэффициент = КоличествоЗапасов/ТекущаяУпаковка.КоличествоУпаковок;
						КоличествоУпаковок = Макс(Цел(НоваяСтрока.Количество/Коэффициент), 1);
					КонецЕсли;
				КонецЕсли;
				
				НоваяСтрокаУпаковок = ДокументОбъект.Упаковки.Добавить();
				НоваяСтрокаУпаковок.УровеньУпаковки     = ТекущаяУпаковка.УровеньУпаковки;
				НоваяСтрокаУпаковок.Упаковка            = ТекущаяУпаковка.Упаковка;
				НоваяСтрокаУпаковок.ИдентификаторСтроки = НоваяСтрока.ИдентификаторСтрокиПартий;
				НоваяСтрокаУпаковок.Маркировка          = ТекущаяУпаковка.Маркировка;
				НоваяСтрокаУпаковок.ТипМаркировки       = ТекущаяУпаковка.ТипМаркировки;
				НоваяСтрокаУпаковок.КоличествоУпаковок  = Макс(КоличествоУпаковок, 1);
				
				Если ПустаяСтрока(НоваяСтрокаУпаковок.Маркировка) И ПустаяСтрока(НоваяСтрокаУпаковок.ТипМаркировки) Тогда
					НоваяСтрокаУпаковок.Маркировка      = ПредставлениеМаркировки;
					НоваяСтрокаУпаковок.ТипМаркировки   = "UNDEFINED";
				КонецЕсли;
				
				ТекущаяУпаковка.КоличествоУпаковок = ТекущаяУпаковка.КоличествоУпаковок - КоличествоУпаковок;
				Если УдалениеЗаписи Тогда
					ТаблицаУпаковки.Удалить(ТекущаяУпаковка);
				КонецЕсли;
				
				//ИдентификаторСтрокиПартий = ИдентификаторСтрокиПартий + 1;
				
			КонецЦикла;
		КонецЕсли;
		
		ЗапросЭкспертизы = Новый Запрос;
		ЗапросЭкспертизы.Текст = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	СопроводительныеДокументы.ВСД.СпособХранения КАК СпособХранения,
		|	СопроводительныеДокументы.ВСД.ЭкспертизаРезультат КАК ЭкспертизаРезультат,
		|	ВЫБОР
		|		КОГДА СопроводительныеДокументы.ВСД.ЭкспертизаРезультат = ""VSEFULL"" ТОГДА
		|			0
		|		КОГДА СопроводительныеДокументы.ВСД.ЭкспертизаРезультат = ""VSERAW"" ТОГДА
		|			1
		|		КОГДА СопроводительныеДокументы.ВСД.ЭкспертизаРезультат = ""UNFULFILLED"" ТОГДА
		|			2
		|		ИНАЧЕ
		|			3
		|	КОНЕЦ КАК Приоритет
		|ИЗ
		|	Справочник.СвойстваЗаписейСкладскогоЖурналаВЕТИС.СопроводительныеДокументы КАК СопроводительныеДокументы
		|ГДЕ
		|	СопроводительныеДокументы.Ссылка = &СвойствоЗаписи
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет ВОЗР";
		
		ЗапросЭкспертизы.УстановитьПараметр("СвойствоЗаписи", СтрокаЗапасов.СвойствоЗаписи);
		Выборка = ЗапросЭкспертизы.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			//Если Выборка.ЭкспертизаРезультат = "VSEFULL" Тогда
			//	ВСЭПодвергнутаПродукция = Истина;
			//ИначеЕсли Выборка.ЭкспертизаРезультат = "VSERAW" Тогда
			//	ВСЭПодвергнутоСырьё     = Истина;
			//КонецЕсли;
			
			НоваяСтрока.ЭкспертизаРезультат = Выборка.ЭкспертизаРезультат;
			Если ЕстьСпособХранения Тогда
				НоваяСтрока.СпособХранения = Выборка.СпособХранения;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Выборка.ЭкспертизаРезультат) Тогда
			НоваяСтрока.ЭкспертизаРезультат = Перечисления.РезультатыИсследованияВЕТИС.VSEFULL;
		КонецЕсли;
		
		Если ЕстьСпособХранения И (НЕ ЗначениеЗаполнено(НоваяСтрока.СпособХранения)) И ЗначениеЗаполнено(СтрокаЗапасов.СпособХранения) Тогда
			НоваяСтрока.СпособХранения = СтрокаЗапасов.СпособХранения;
		ИначеЕсли ЕстьСпособХранения И НЕ ЗначениеЗаполнено(НоваяСтрока.СпособХранения) Тогда
			НоваяСтрока.СпособХранения = ДокументОбъект.СпособХранения;
		КонецЕсли;
		
		Если УдалениеЗаписи Тогда
			ТаблицаЗапасов.Удалить(СтрокаЗапасов);
		КонецЕсли;
		КоличествоТовара = КоличествоТовара - НоваяСтрока.Количество;
		
	КонецЦикла;
	
	//ОтборСтрок = Новый Структура;
	//ОтборСтрок.Вставить("ИдентификаторСтроки", ТоварнаяСтрока.ИдентификаторСтроки);
	//
	//НайденныеСтроки = ДокументОбъект.Товары.НайтиСтроки(ОтборСтрок);
	
	//Если НайденныеСтроки.Количество()>0 Тогда
	//	НайденнаяСтрока = НайденныеСтроки[0];
	//	Если ВСЭПодвергнутаПродукция Тогда
	//		НайденнаяСтрока.ЭкспертизаРезультат = "VSEFULL";
	//	ИначеЕсли ВСЭПодвергнутоСырьё Тогда
	//		НайденнаяСтрока.ЭкспертизаРезультат = "VSERAW";
	//	Иначе
	//		НайденнаяСтрока.ЭкспертизаРезультат = "UNFULFILLED";
	//	КонецЕсли;
	//КонецЕсли;
	
	Если КоличествоТовара>0 И ВыводитьСообщения Тогда
		
		ВывестиСообщение(НСтр("ru='Строка № <%1>. Продукция <%2>. Не удалось распределить %3 единиц'"), ДокументОбъект,, ТоварнаяСтрока.НомерСтроки,,Строка(ТоварнаяСтрока.НомерСтроки),Продукция,Формат(КоличествоТовара, "ЧДЦ=3"));
		
		ЕстьОшибки = Истина;
		
		НоваяСтрока = ТаблицаОшибок.Добавить();
		НоваяСтрока.НомерСтроки          = ТоварнаяСтрока.НомерСтроки;
		НоваяСтрока.ИдентификаторСтроки  = ТоварнаяСтрока.ИдентификаторСтроки;
		//НоваяСтрока.ВидПродукции         = ТекущаяСтрока.ВидПродукции;
		НоваяСтрока.Продукция            = Продукция;
		НоваяСтрока.Количество           = ТоварнаяСтрока.Количество;
		НоваяСтрока.ВНаличии             = ТоварнаяСтрока.Количество - КоличествоТовара;
		//НоваяСтрока.ВНаличииНоПросрочено = ТоварнаяСтрока.КоличествоПросрочено;
		
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьСкладскимиЗапасамиИзЖурнала(ДокументОбъект, ХозСубъект, Предприятие, ТаблицаПродукции, ТаблицаОбработанныхДокументов = Неопределено, ЕстьОшибки = Ложь, ТаблицаОшибок = Неопределено) Экспорт
	
	ДокументОбъект.Партии.Очистить();
	ДокументОбъект.Упаковки.Очистить();
	
	ТаблицаОшибок = Новый ТаблицаЗначений;
	ТаблицаОшибок.Колонки.Добавить("НомерСтроки");
	ТаблицаОшибок.Колонки.Добавить("ИдентификаторСтроки");
	ТаблицаОшибок.Колонки.Добавить("ВидПродукции");
	ТаблицаОшибок.Колонки.Добавить("Продукция");
	ТаблицаОшибок.Колонки.Добавить("Количество");
	ТаблицаОшибок.Колонки.Добавить("ВНаличии");
	ТаблицаОшибок.Колонки.Добавить("ВНаличииНоПросрочено");
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса     = "";
	ТекстДляСклада   = "";
	ТекстДляУпаковок = "";
	НомерДокумента   = 0;
	
	Если НЕ ТаблицаОбработанныхДокументов = Неопределено Тогда
		//Для Каждого ТекущаяСтрока Из ТаблицаОбработанныхДокументов Цикл
		//	
		//	ПредставлениеНомера = Формат(НомерДокумента, "ЧН=0; ЧГ=0");
		//	
		//	Запрос.УстановитьПараметр("ТоварыОперации" + ПредставлениеНомера, ТекущаяСтрока.Документ.Товары.Выгрузить());
		//	Запрос.УстановитьПараметр("ПартииОперации" + ПредставлениеНомера, ТекущаяСтрока.Документ.Партии.Выгрузить());
		//	Запрос.УстановитьПараметр("УпаковкиОперации" + ПредставлениеНомера, ТекущаяСтрока.Документ.Упаковки.Выгрузить());
		//	
		//	ТекстЗапроса = ТекстЗапроса + "
		//	|ВЫБРАТЬ
		//	|	ТоварыОперации.ИдентификаторСтроки,
		//	|	ТоварыОперации.ВидПродукции КАК ВидПродукции,
		//	|	ТоварыОперации.Продукция КАК Продукция
		//	|ПОМЕСТИТЬ
		//	|	ТоварыОперации" + ПредставлениеНомера + "
		//	|ИЗ
		//	|	&ТоварыОперации" + ПредставлениеНомера + " КАК ТоварыОперации
		//	|;
		//	|
		//	|ВЫБРАТЬ
		//	|	ПартииОперации.ИдентификаторСтроки,
		//	|	ПартииОперации.Количество,
		//	|	ПартииОперации.ЕдиницаИзмерения,
		//	|	ПартииОперации.НомерЗаписи,
		//	|	ПартииОперации.ИдентификаторПартии КАК Идентификатор,
		//	|	ПартииОперации.ИдентификаторСтрокиПартий
		//	|ПОМЕСТИТЬ
		//	|	ПартииОперации" + ПредставлениеНомера + "
		//	|ИЗ
		//	|	&ПартииОперации" + ПредставлениеНомера + " КАК ПартииОперации
		//	|;
		//	|
		//	|ВЫБРАТЬ
		//	|	УпаковкиОперации.УровеньУпаковки,
		//	|	УпаковкиОперации.Упаковка,
		//	|	УпаковкиОперации.КоличествоУпаковок,
		//	|	УпаковкиОперации.ИдентификаторСтроки КАК ИдентификаторСтрокиПартий,
		//	|	УпаковкиОперации.Маркировка КАК Маркировка,
		//	|	УпаковкиОперации.ТипМаркировки КАК ТипМаркировки
		//	|ПОМЕСТИТЬ
		//	|	УпаковкиОперации" + ПредставлениеНомера + "
		//	|ИЗ
		//	|	&УпаковкиОперации" + ПредставлениеНомера + " КАК УпаковкиОперации
		//	|;
		//	|";
		//	
		//	ТекстДляСклада = ТекстДляСклада + "
		//	|ОБЪЕДИНИТЬ ВСЕ
		//	|
		//	|ВЫБРАТЬ
		//	|	ТоварыОперации.ВидПродукции,
		//	|	ТоварыОперации.Продукция,
		//	|	ПартииОперации.Идентификатор,
		//	|	NULL,
		//	|	-ПартииОперации.Количество,
		//	|	ПартииОперации.ЕдиницаИзмерения,
		//	|	ПартииОперации.НомерЗаписи,
		//	|	ДатаВремя(1,1,1)
		//	|ИЗ
		//	|	ТоварыОперации" + ПредставлениеНомера + " КАК ТоварыОперации
		//	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		//	|	ПартииОперации" + ПредставлениеНомера + " КАК ПартииОперации
		//	|ПО
		//	|	ТоварыОперации.ИдентификаторСтроки = ПартииОперации.ИдентификаторСтроки
		//	|";
		//	
		//	ТекстДляУпаковок = ТекстДляУпаковок + "
		//	|ОБЪЕДИНИТЬ ВСЕ
		//	|
		//	|ВЫБРАТЬ
		//	|	ПартииОперации.Идентификатор,
		//	|	NULL,
		//	|	УпаковкиОперации.УровеньУпаковки,
		//	|	УпаковкиОперации.Упаковка,
		//	|	-УпаковкиОперации.КоличествоУпаковок,
		//	|	УпаковкиОперации.Маркировка КАК Маркировка,
		//	|	УпаковкиОперации.ТипМаркировки КАК ТипМаркировки
		//	|ИЗ
		//	|	ПартииОперации" + ПредставлениеНомера + " КАК ПартииОперации
		//	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		//	|	УпаковкиОперации" + ПредставлениеНомера + " КАК УпаковкиОперации
		//	|ПО
		//	|	ПартииОперации.ИдентификаторСтрокиПартий = УпаковкиОперации.ИдентификаторСтрокиПартий
		//	|";
		//	
		//	НомерДокумента = НомерДокумента + 1;
		//	
		//КонецЦикла;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Товары.Вес = 0 ТОГДА
	|			Товары.Количество
	|		ИНАЧЕ
	|			Товары.Вес
	|	КОНЕЦ КАК Количество
	|ПОМЕСТИТЬ
	|	Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Номенклатура КАК Номенклатура,
	|	СоответствиеНоменклатурыВЕТИС.Продукция КАК Продукция
	|ПОМЕСТИТЬ
	|	СоответствиеНоменклатуры
	|ИЗ
	|	Товары КАК Товары
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СоответствиеНоменклатурыВЕТИС КАК СоответствиеНоменклатурыВЕТИС
	|ПО
	|	Товары.Номенклатура = СоответствиеНоменклатурыВЕТИС.Номенклатура
	|ГДЕ
	|	Товары.Количество>0
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&ХозСубъект КАК ХозяйствующийСубъект,
	|	&Предприятие КАК Предприятие,
	|	СоответствиеНоменклатурыВЕТИС.Продукция КАК Продукция
	|ПОМЕСТИТЬ
	|	ТоварыСрез
	|ИЗ
	|	СоответствиеНоменклатуры КАК Товары
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СоответствиеНоменклатурыВЕТИС КАК СоответствиеНоменклатурыВЕТИС
	|ПО
	|	Товары.Номенклатура = СоответствиеНоменклатурыВЕТИС.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	Товары.Продукция КАК Продукция,
	|	МеркурийСкладскойЖурнал.Идентификатор,
	|	МеркурийСкладскойЖурнал.Количество КАК Количество,
	|	МеркурийСкладскойЖурнал.ЕдиницаИзмерения,
	|	МеркурийСкладскойЖурнал.НомерЗаписи,
	|	МеркурийСкладскойЖурнал.СвойствоЗаписи,
	|	МеркурийСкладскойЖурнал.СрокГодностиПо
	|ПОМЕСТИТЬ
	|	МеркурийСкладскойЖурнал
	|ИЗ
	|	ТоварыСрез КАК Товары
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СкладскойЖурналВЕТИС КАК МеркурийСкладскойЖурнал
	|ПО
	|	Товары.ХозяйствующийСубъект = МеркурийСкладскойЖурнал.ХозяйствующийСубъект И
	|	Товары.Предприятие = МеркурийСкладскойЖурнал.Предприятие И 
	|	Товары.Продукция = МеркурийСкладскойЖурнал.Продукция
	|ГДЕ
	|	МеркурийСкладскойЖурнал.Количество > 0 И 
	|	МеркурийСкладскойЖурнал.СрокГодностиПо >= &ТекущаяДата
	|;
	|
	//|ВЫБРАТЬ
	//|	ИтоговаяВложеннаяТаблица.ВидПродукции КАК ВидПродукции,
	//|	ИтоговаяВложеннаяТаблица.Продукция КАК Продукция,
	//|	ИтоговаяВложеннаяТаблица.Идентификатор КАК Идентификатор,
	//|	ИтоговаяВложеннаяТаблица.Количество КАК Количество,
	//|	ИтоговаяВложеннаяТаблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|	ИтоговаяВложеннаяТаблица.НомерЗаписи КАК НомерЗаписи,
	//|	ИтоговаяВложеннаяТаблица.СрокГодностиПо КАК СрокГодности,
	//|	ИтоговаяВложеннаяТаблица.СвойствоЗаписи КАК СвойствоЗаписи
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ВложеннаяТаблица.ВидПродукции КАК ВидПродукции,
	//|		ВложеннаяТаблица.Продукция КАК Продукция,
	//|		ВложеннаяТаблица.Идентификатор КАК Идентификатор,
	//|		МАКСИМУМ(ВложеннаяТаблица.СвойствоЗаписи) КАК СвойствоЗаписи,
	//|		СУММА(ВложеннаяТаблица.Количество) КАК Количество,
	//|		МАКСИМУМ(ВложеннаяТаблица.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	//|		ВложеннаяТаблица.НомерЗаписи КАК НомерЗаписи,
	//|		МАКСИМУМ(ВложеннаяТаблица.СрокГодностиПо) КАК СрокГодностиПо
	//|	ИЗ
	//|		(ВЫБРАТЬ
	//|			МеркурийСкладскойЖурнал.Номенклатура КАК Номенклатура,
	//|			МеркурийСкладскойЖурнал.Продукция КАК Продукция,
	//|			МеркурийСкладскойЖурнал.Идентификатор КАК Идентификатор,
	//|			МеркурийСкладскойЖурнал.СвойствоЗаписи,
	//|			МеркурийСкладскойЖурнал.Количество КАК Количество,
	//|			МеркурийСкладскойЖурнал.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//|			МеркурийСкладскойЖурнал.НомерЗаписи КАК НомерЗаписи,
	//|			МеркурийСкладскойЖурнал.СрокГодностиПо КАК СрокГодностиПо
	//|		ИЗ
	//|			МеркурийСкладскойЖурнал КАК МеркурийСкладскойЖурнал
	//|		ГДЕ
	//|			МеркурийСкладскойЖурнал.Количество>0) КАК ВложеннаяТаблица
	////"+ТекстДляСклада+"
	//|	СГРУППИРОВАТЬ ПО
	//|		ВложеннаяТаблица.Номенклатура,
	//|		ВложеннаяТаблица.Продукция,
	//|		ВложеннаяТаблица.Идентификатор,
	//|		ВложеннаяТаблица.НомерЗаписи
	//|	ИМЕЮЩИЕ
	//|		СУММА(ВложеннаяТаблица.Количество) > 0) КАК ИтоговаяВложеннаяТаблица
	//|УПОРЯДОЧИТЬ ПО
	//|	ИтоговаяВложеннаяТаблица.ВидПродукции,
	//|	ИтоговаяВложеннаяТаблица.Продукция,
	//|	ИтоговаяВложеннаяТаблица.СрокГодностиПо
	//|;
	//|
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	Товары.Количество КАК Количество
	|ИЗ
	|	Товары КАК Товары
	|;
	|
	|ВЫБРАТЬ
	|	СоответствиеНоменклатуры.Номенклатура КАК Номенклатура,
	|	СоответствиеНоменклатуры.Продукция КАК Продукция
	|ИЗ
	|	СоответствиеНоменклатуры КАК СоответствиеНоменклатуры
	|;
	|
	|ВЫБРАТЬ
	//|	Товары.Номенклатура КАК Номенклатура,
	|	МеркурийСкладскойЖурнал.Продукция КАК Продукция,
	|	МеркурийСкладскойЖурнал.Продукция.СпособХранения КАК СпособХранения,
	|	МеркурийСкладскойЖурнал.Идентификатор,
	|	МеркурийСкладскойЖурнал.Количество КАК Количество,
	|	МеркурийСкладскойЖурнал.ЕдиницаИзмерения,
	|	МеркурийСкладскойЖурнал.НомерЗаписи,
	|	МеркурийСкладскойЖурнал.СвойствоЗаписи,
	|	МеркурийСкладскойЖурнал.СрокГодностиПо КАК СрокГодности
	|ИЗ
	|	МеркурийСкладскойЖурнал КАК МеркурийСкладскойЖурнал
	|;
	|
	//|ВЫБРАТЬ
	//|	ВложеннаяТаблица.Идентификатор,
	//|	МАКСИМУМ(ВложеннаяТаблица.СвойствоЗаписи) КАК СвойствоЗаписи,
	//|	ВложеннаяТаблица.УровеньУпаковки,
	//|	ВложеннаяТаблица.Упаковка,
	//|	СУММА(ВложеннаяТаблица.КоличествоУпаковок) КАК КоличествоУпаковок,
	//|	ВложеннаяТаблица.Маркировка КАК Маркировка,
	//|	ВложеннаяТаблица.ТипМаркировки КАК ТипМаркировки
	//|ИЗ
	//|	(
	|ВЫБРАТЬ
	|		МеркурийСкладскойЖурнал.Идентификатор,
	|		МАКСИМУМ(МеркурийСкладскойЖурнал.СвойствоЗаписи) КАК СвойствоЗаписи,
	|		ТаблицаУпаковки.УровеньУпаковки,
	|		ТаблицаУпаковки.Упаковка,
	|		СУММА(ТаблицаУпаковки.КоличествоУпаковок) КАК КоличествоУпаковок,
	|		ЕСТЬNULL(ТаблицаМаркировка.Маркировка, """") КАК Маркировка,
	|		ЕСТЬNULL(ТаблицаМаркировка.ТипМаркировки, """") КАК ТипМаркировки
	|	ИЗ
	|		МеркурийСкладскойЖурнал КАК МеркурийСкладскойЖурнал
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.СвойстваЗаписейСкладскогоЖурналаВЕТИС.Упаковки КАК ТаблицаУпаковки
	|	ПО
	|		ТаблицаУпаковки.Ссылка = МеркурийСкладскойЖурнал.СвойствоЗаписи
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.СвойстваЗаписейСкладскогоЖурналаВЕТИС.Маркировка КАК ТаблицаМаркировка
	|	ПО
	|		ТаблицаУпаковки.Ссылка = ТаблицаМаркировка.Ссылка И 
	|		ТаблицаУпаковки.ИдентификаторСтроки = ТаблицаМаркировка.ИдентификаторСтроки
	|	СГРУППИРОВАТЬ ПО
	|		МеркурийСкладскойЖурнал.Идентификатор,
	|		ТаблицаУпаковки.УровеньУпаковки,
	|		ТаблицаУпаковки.Упаковка,
	|		ЕСТЬNULL(ТаблицаМаркировка.Маркировка, """"),
	|		ЕСТЬNULL(ТаблицаМаркировка.ТипМаркировки, """")
	//|	"+ТекстДляУпаковок+"
	//|) КАК ВложеннаяТаблица
	//|СГРУППИРОВАТЬ ПО
	//|	ВложеннаяТаблица.Идентификатор,
	//|	ВложеннаяТаблица.УровеньУпаковки,
	//|	ВложеннаяТаблица.Упаковка,
	//|	ВложеннаяТаблица.Маркировка,
	//|	ВложеннаяТаблица.ТипМаркировки
	//|УПОРЯДОЧИТЬ ПО
	//|	ВложеннаяТаблица.Идентификатор,
	//|	ВложеннаяТаблица.УровеньУпаковки,
	//|	ВложеннаяТаблица.Маркировка
	|УПОРЯДОЧИТЬ ПО
	|	Идентификатор,
	|	УровеньУпаковки,
	|	Маркировка
	|";
	
	ЗапасСрокаГодности = ?(ХозСубъект.ЗапасСрокаГодности = 0, 0, ХозСубъект.ЗапасСрокаГодности);
	
	ТекущаяДатаСЗапасом = ТекущаяДата()+86400*ЗапасСрокаГодности;
	
	Запрос.УстановитьПараметр("Товары",      ТаблицаПродукции);
	Запрос.УстановитьПараметр("ХозСубъект",  ХозСубъект);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСЗапасом);
	Запрос.УстановитьПараметр("Предприятие", Предприятие);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	//СмещениеТаблиц = НомерДокумента*3;
	КоличествоПакетов = ПакетЗапросов.Количество();
	
	ТаблицаТоваров      = ПакетЗапросов[КоличествоПакетов-4].Выгрузить();
	ТаблицаСоответствий = ПакетЗапросов[КоличествоПакетов-3].Выгрузить();
	ТаблицаЗапасов      = ПакетЗапросов[КоличествоПакетов-2].Выгрузить();
	ТаблицаУпаковки     = ПакетЗапросов[КоличествоПакетов-1].Выгрузить();
	
	ЕстьСпособХранения = Ложь;
	Если ЕстьРеквизит(ДокументОбъект, "СпособХранения") Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.СпособХранения) Тогда
			ДокументОбъект.СпособХранения = ДокументОбъект.Отправитель.СпособХранения;
		КонецЕсли;
		
		Если ЕстьРеквизит(ДокументОбъект, "СпособХранения", "Партии") Тогда
			ЕстьСпособХранения = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
		
		КоличествоТовара = ТекущаяСтрока.Количество;
		
		//ВСЭПодвергнутоСырьё     = Ложь;
		//ВСЭПодвергнутаПродукция = Ложь;
		
		ОтборПоНоменклатуре = Новый Структура;
		ОтборПоНоменклатуре.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
		
		ПродукцияТоварнойСтроки = ТаблицаСоответствий.НайтиСтроки(ОтборПоНоменклатуре);
		
		Если ПродукцияТоварнойСтроки.Количество() = 0 Тогда
			ВывестиСообщение(НСтр("ru='Строка № <%1>. Номенклатура <%2>. Нет соответствия с продукцией ВетИС'"), ДокументОбъект,, ТекущаяСтрока.НомерСтроки,,Строка(ТекущаяСтрока.НомерСтроки), ТекущаяСтрока.Номенклатура);
		КонецЕсли;
		
		КоличествоСтрок = ПродукцияТоварнойСтроки.Количество();
		Сч = 1;
		Для Каждого ТекущаяПродукция Из ПродукцияТоварнойСтроки Цикл
			Если КоличествоСтрок = Сч Тогда
				ПодобратьПодходящуюПартию(ДокументОбъект, ТекущаяСтрока, ТекущаяПродукция.Продукция, КоличествоТовара, ТаблицаЗапасов, ТаблицаУпаковки, ТаблицаОшибок, Истина, ЕстьСпособХранения);
			Иначе
				ПодобратьПодходящуюПартию(ДокументОбъект, ТекущаяСтрока, ТекущаяПродукция.Продукция, КоличествоТовара, ТаблицаЗапасов, ТаблицаУпаковки, ТаблицаОшибок,, ЕстьСпособХранения);
			КонецЕсли;
			Сч = Сч + 1;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
