
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//УправлениеДиалогомДокументаКлиент.ПоискПоШтрихкоду(ПараметрКоманды,ПараметрыВыполненияКоманды);
	//ТекущийНомерНомерСтроки	 = ПараметрыВыполненияКоманды.Источник.Элементы.Товары.ТекущаяСтрока;
	//ТекущаяНоменклатура		 = ПараметрыВыполненияКоманды.Источник.Элементы.Товары.ТекущиеДанные.Номенклатура;
	//
	//тПоиск = "";
	//ПоказатьВводСтроки(Новый ОписаниеОповещения("УправлениеДиалогомДокументаКлиент.ПоискПоШтрихкодуЗавершение", ПараметрыВыполненияКоманды.Источник),тПоиск,"Введите штрихкод для поиска"); 
	//
КонецПроцедуры