
#Область СлужебныйПрограммныйИнтерфейс

// см. ОбменСКонтрагентамиПереопределяемый.ПриОтраженииВУчетеДокументаТЭДО
Процедура ПриОтраженииВУчетеДокументаТЭДО(ДокументУчета, СпособОбработки, ДанныеТЭДО, ОписаниеОшибки) Экспорт
	
	Если ДанныеТЭДО.ПространствоИмен = ТрансграничныйЭДО.ПространстваИмен().ТоварнаяНакладнаяРБ Тогда
		ПриОтраженииВУчетеТоварнойНакладнойРБ(ДокументУчета, СпособОбработки, ДанныеТЭДО, ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПриОпределенииИспользуемыхТиповЭлектронныхДокументов.
Процедура ПриОпределенииИспользуемыхТиповЭлектронныхДокументов(АктуальныеТипы) Экспорт
	
	ТипыДокументов = ОбменСКонтрагентами.ТипыДокументов();
	
	// Для обмена по форматам ФНС.
	ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.ТоварнаяНакладная);
	ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.АктВыполненныхРабот);
	ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.СчетФактура);
	ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.КорректировочныйСчетФактура);
	ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.СоглашениеОбИзмененииСтоимости);
	//ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.АктНаПередачуПрав);
	ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.УПД);
	ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.УКД);
	ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.АктОРасхождениях);
	
	//ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.СведенияОРеализацииКомиссионером);
	//ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.СведенияОЗакупкеКомиссионером);
	//ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.КорректировкаСведенийОРеализацииКомиссионером);
	//ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.КорректировкаСведенийОЗакупкеКомиссионером);
	
	// Для обмена по форматам CML 2.
	ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.КаталогТоваров);
	ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.ЗаказТовара);
	ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.ОтветНаЗаказ);
	ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.СчетНаОплату);
	
	ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.ПрайсЛист);
	//ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.ОтчетОПродажахКомиссионногоТовара);
	//ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.ОтчетОСписанииКомиссионногоТовара);
	//ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.ЗапросКоммерческихПредложений);
	//ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.КоммерческоеПредложение);
	
	// Для обмена между организациями
	//ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.ПередачаТоваровМеждуОрганизациями);
	//ОбменСКонтрагентами.ДобавитьИспользуемыйТипДокумента(АктуальныеТипы, ТипыДокументов.ВозвратТоваровМеждуОрганизациями);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьПараметрыЭДПоИсточнику.
Процедура ЗаполнитьПараметрыЭДПоИсточнику(Источник, ПараметрыЭлектронногоДокумента) Экспорт
	
	Перем ТипЭД, НаправлениеЭД, Организация, Контрагент, Договор, ХозОперация;
	
	ТипыДокументов        = ОбменСКонтрагентами.ТипыДокументов();
	НаправленияДокументов = ОбменСКонтрагентами.НаправленияДокументов();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	Договор    = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	
	ТипИсточника = ТипЗнч(Источник);
	ЭтоСсылка    = ОбщегоНазначения.ЭтоСсылка(ТипИсточника);
	
	ТипПоступленияТоваров = Новый Массив();
	ТипПоступленияТоваров.Добавить(Тип("ДокументСсылка.ПоступлениеТоваров"));
	ТипПоступленияТоваров.Добавить(Тип("ДокументСсылка.СчетФактураПолученный"));
	ТипПоступленияТоваров.Добавить(Тип("ДокументСсылка.КорректировкаПоступления"));
	ТипПоступленияТоваров.Добавить(Тип("ДокументОбъект.ПоступлениеТоваров"));
	ТипПоступленияТоваров.Добавить(Тип("ДокументОбъект.СчетФактураПолученный"));
	ТипПоступленияТоваров.Добавить(Тип("ДокументОбъект.КорректировкаПоступления"));
	
	ПараметрыЭД = ПараметрыЭлектронногоДокумента.Добавить();
	
	Если ТипИсточника = Тип("ДокументСсылка.РеализацияТоваров")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.РеализацияТоваров") Тогда
		
		Если Источник.ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг Тогда
			ТипЭД = Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот;
		Иначе
			ТипЭД = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
		КонецЕсли;
		
		НаправлениеЭД = Перечисления.НаправленияЭДО.Исходящий;
		
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, Контрагент, ДоговорВзаиморасчетов, ХозОперация, ПодразделениеКомпании, Дата");
			Организация = ЗначенияРеквизитов.Организация;
			Контрагент = ЗначенияРеквизитов.Контрагент;
			Договор = ЗначенияРеквизитов.ДоговорВзаиморасчетов;
			ХозОперация = ЗначенияРеквизитов.ХозОперация;
			ПодразделениеКомпании = ЗначенияРеквизитов.ПодразделениеКомпании;
			ДатаДокумента = ЗначенияРеквизитов.Дата;
		Иначе
			Организация = Источник.Организация;
			Контрагент = Источник.Контрагент;
			Договор = Источник.ДоговорВзаиморасчетов;
			ХозОперация = Источник.ХозОперация;
			ПодразделениеКомпании = Источник.ПодразделениеКомпании;
			ДатаДокумента = Источник.Дата;
		КонецЕсли;
		ОсвобожденОтНДС = ОсвобожденОтУплатыНДС(Организация, ПодразделениеКомпании, ДатаДокумента);
		Если ХозОперация = Справочники.ХозОперации.РеализацияТоваровКомиссия Тогда
			ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
				ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
		ИначеЕсли ХозОперация = Справочники.ХозОперации.РеализацияБезвозмездная Тогда
			ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
				ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
		ИначеЕсли ХозОперация = Справочники.ХозОперации.РеализацияТоваровРозница Тогда
			ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
				ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
		ИначеЕсли ХозОперация = Справочники.ХозОперации.РеализацияТоваровРозницаЧек Тогда
			ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
				ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
		ИначеЕсли ОсвобожденОтНДС Тогда
			ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
				ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
		КонецЕсли;
		
	ИначеЕсли ТипПоступленияТоваров.Найти(ТипИсточника) <> Неопределено Тогда
		
		ТипЭД         = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
		НаправлениеЭД = Перечисления.НаправленияЭДО.Входящий;
		
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, Контрагент, ДоговорВзаиморасчетов");
			Организация = ЗначенияРеквизитов.Организация;
			Контрагент = ЗначенияРеквизитов.Контрагент;
			Договор = ЗначенияРеквизитов.ДоговорВзаиморасчетов;
		Иначе
			Организация = Источник.Организация;
			Контрагент = Источник.Контрагент;
			Договор = Источник.ДоговорВзаиморасчетов;
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.СчетФактураВыданный")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.СчетФактураВыданный") Тогда
		
		НаправлениеЭД = Перечисления.НаправленияЭДО.Исходящий;
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, Контрагент, ДоговорВзаиморасчетов, ХозОперация, ДокументОснование");
			Организация = ЗначенияРеквизитов.Организация;
			Контрагент = ЗначенияРеквизитов.Контрагент;
			Договор = ЗначенияРеквизитов.ДоговорВзаиморасчетов;
			ХозОперация = ЗначенияРеквизитов.ХозОперация;
			ДокументОснование = ЗначенияРеквизитов.ДокументОснование;
		Иначе
			Организация = Источник.Организация;
			Контрагент = Источник.Контрагент;
			Договор = Источник.ДоговорВзаиморасчетов;
			ХозОперация = Источник.ХозОперация;
			ДокументОснование = Источник.ДокументОснование;
		КонецЕсли;
		
		Если ХозОперация = Справочники.ХозОперации.СчетФактураВыданныйКорректировка
			И ДокументОснование.ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон Тогда
			ТипЭД = Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура;
		Иначе
			ТипЭД = Перечисления.ТипыДокументовЭДО.СчетФактура;
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ЗаказПоставщику")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
		
		ТипЭД = Перечисления.ТипыДокументовЭДО.ЗаказТовара;
		НаправлениеЭД = Перечисления.НаправленияЭДО.Исходящий;
		
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, Контрагент, ДоговорВзаиморасчетов");
			Организация = ЗначенияРеквизитов.Организация;
			Контрагент = ЗначенияРеквизитов.Контрагент;
			Договор = ЗначенияРеквизитов.ДоговорВзаиморасчетов;
		Иначе
			Организация = Источник.Организация;
			Контрагент = Источник.Контрагент;
			Договор = Источник.ДоговорВзаиморасчетов;
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ЗаказПокупателя")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
		
		ТипЭД = Перечисления.ТипыДокументовЭДО.ЗаказТовара;
		НаправлениеЭД = Перечисления.НаправленияЭДО.Входящий;
		
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, Контрагент, ДоговорВзаиморасчетов");
			Организация = ЗначенияРеквизитов.Организация;
			Контрагент = ЗначенияРеквизитов.Контрагент;
			Договор = ЗначенияРеквизитов.ДоговорВзаиморасчетов;
		Иначе
			Организация = Источник.Организация;
			Контрагент = Источник.Контрагент;
			Договор = Источник.ДоговорВзаиморасчетов;
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.СчетНаОплату")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.СчетНаОплату") Тогда
		
		ТипЭД = Перечисления.ТипыДокументовЭДО.СчетНаОплату;
		НаправлениеЭД = Перечисления.НаправленияЭДО.Исходящий;
		
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, Контрагент, ДоговорВзаиморасчетов");
			Организация = ЗначенияРеквизитов.Организация;
			Контрагент = ЗначенияРеквизитов.Контрагент;
			Договор = ЗначенияРеквизитов.ДоговорВзаиморасчетов;
		Иначе
			Организация = Источник.Организация;
			Контрагент = Источник.Контрагент;
			Договор = Источник.ДоговорВзаиморасчетов;
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.СчетОтПоставщика")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.СчетОтПоставщика") Тогда
		
		ТипЭД = Перечисления.ТипыДокументовЭДО.СчетНаОплату;
		НаправлениеЭД = Перечисления.НаправленияЭДО.Входящий;
		
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, Контрагент, ДоговорВзаиморасчетов");
			Организация = ЗначенияРеквизитов.Организация;
			Контрагент = ЗначенияРеквизитов.Контрагент;
			Договор = ЗначенияРеквизитов.ДоговорВзаиморасчетов;
		Иначе
			Организация = Источник.Организация;
			Контрагент = Источник.Контрагент;
			Договор = Источник.ДоговорВзаиморасчетов;
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ОтчетКомитенту")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ОтчетКомитенту") Тогда
		
		ТипЭД = Перечисления.ТипыДокументовЭДО.ОтчетОПродажахКомиссионногоТовара;
		НаправлениеЭД = Перечисления.НаправленияЭДО.Исходящий;
		
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, Контрагент, ДоговорВзаиморасчетов");
			Организация = ЗначенияРеквизитов.Организация;
			Контрагент = ЗначенияРеквизитов.Контрагент;
			Договор = ЗначенияРеквизитов.ДоговорВзаиморасчетов;
		Иначе
			Организация = Источник.Организация;
			Контрагент = Источник.Контрагент;
			Договор = Источник.ДоговорВзаиморасчетов;
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ОтчетКомиссионера")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ОтчетКомиссионера") Тогда
		
		ТипЭД = Перечисления.ТипыДокументовЭДО.ОтчетОПродажахКомиссионногоТовара;
		НаправлениеЭД = Перечисления.НаправленияЭДО.Входящий;
		
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, Контрагент, ДоговорВзаиморасчетов");
			Организация = ЗначенияРеквизитов.Организация;
			Контрагент = ЗначенияРеквизитов.Контрагент;
			Договор = ЗначенияРеквизитов.ДоговорВзаиморасчетов;
		Иначе
			Организация = Источник.Организация;
			Контрагент = Источник.Контрагент;
			Договор = Источник.ДоговорВзаиморасчетов;
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.КорректировкаРеализации")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
		
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, 
			"ХозОперация, Организация, Контрагент, ДоговорВзаиморасчетов, ДокументОснование, ПодразделениеКомпании, Дата");
			ХозОперация = ЗначенияРеквизитов.ХозОперация;
			Организация = ЗначенияРеквизитов.Организация;
			Контрагент  = ЗначенияРеквизитов.Контрагент;
			Договор     = ЗначенияРеквизитов.ДоговорВзаиморасчетов;
			ДокументОснование = ЗначенияРеквизитов.ДокументОснование;
			ПодразделениеКомпании = ЗначенияРеквизитов.ПодразделениеКомпании;
			ДатаДокумента = ЗначенияРеквизитов.Дата;
		Иначе
			ХозОперация = Источник.ХозОперация;
			Организация = Источник.Организация;
			Контрагент  = Источник.Контрагент;
			Договор     = Источник.ДоговорВзаиморасчетов;
			ДокументОснование = Источник.ДокументОснование;
			ПодразделениеКомпании = Источник.ПодразделениеКомпании;
			ДатаДокумента = Источник.Дата;
		КонецЕсли;
		
		НаправлениеЭД = Перечисления.НаправленияЭДО.Исходящий;
		
		ОсвобожденОтНДС = ОсвобожденОтУплатыНДС(Организация, ПодразделениеКомпании, ДатаДокумента);
		
		Если ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон Тогда
			ТипЭД = Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости;
		ИначеЕсли ЗначениеЗаполнено(ДокументОснование) Тогда
			
			ХозОперацияОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ХозОперация");
			
			Если ХозОперацияОснования = Справочники.ХозОперации.АктОбОказанииУслуг Тогда
				ТипЭД = Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот;
			Иначе
				ТипЭД = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
			КонецЕсли;
		Иначе
			ТипЭД = Перечисления.ТипыДокументовЭДО.Внутренний;
			НаправлениеЭД = Перечисления.НаправленияЭДО.Внутренний;
		КонецЕсли;
		
		Если ОсвобожденОтНДС Тогда
			ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
				ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ВозвратПоставщику")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ВозвратПоставщику") Тогда
		
		ТипЭД = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
		НаправлениеЭД = Перечисления.НаправленияЭДО.Исходящий;
		
		ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
				ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
		
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, 
			"Организация, Контрагент, ДоговорВзаиморасчетов");
			Организация = ЗначенияРеквизитов.Организация;
			Контрагент  = ЗначенияРеквизитов.Контрагент;
			Договор     = ЗначенияРеквизитов.ДоговорВзаиморасчетов;
		Иначе
			Организация = Источник.Организация;
			Контрагент  = Источник.Контрагент;
			Договор     = Источник.ДоговорВзаиморасчетов;
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.АктОРасхожденияхПоПоставке")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.АктОРасхожденияхПоПоставке") Тогда
		
		ТипЭД         = Перечисления.ТипыДокументовЭДО.АктОРасхождениях;
		НаправлениеЭД = Перечисления.НаправленияЭДО.Исходящий;
		
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, Контрагент, ДоговорВзаиморасчетов");
			Организация = ЗначенияРеквизитов.Организация;
			Контрагент  = ЗначенияРеквизитов.Контрагент;
			Договор     = ЗначенияРеквизитов.ДоговорВзаиморасчетов;
		Иначе
			Организация = Источник.Организация;
			Контрагент = Источник.Контрагент;
			Договор = Источник.ДоговорВзаиморасчетов;
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.АктОРасхожденияхПоОтгрузке")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.АктОРасхожденияхПоОтгрузке") Тогда
		
		ТипЭД         = Перечисления.ТипыДокументовЭДО.АктОРасхождениях;
		НаправлениеЭД = Перечисления.НаправленияЭДО.Входящий;
		
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, Контрагент, ДоговорВзаиморасчетов");
			Организация = ЗначенияРеквизитов.Организация;
			Контрагент  = ЗначенияРеквизитов.Контрагент;
			Договор     = ЗначенияРеквизитов.ДоговорВзаиморасчетов;
		Иначе
			Организация = Источник.Организация;
			Контрагент  = Источник.Контрагент;
			Договор     = Источник.ДоговорВзаиморасчетов;
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.СогласованиеЗакупочныхЦен")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.СогласованиеЗакупочныхЦен") Тогда
		
		ТипЭД         = ТипыДокументов.ПрайсЛист;
		НаправлениеЭД = НаправленияДокументов.Входящий;
		
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, Контрагент");
			Организация = ЗначенияРеквизитов.Организация;
			Контрагент  = ЗначенияРеквизитов.Контрагент;
		Иначе
			Организация = Источник.Организация;
			Контрагент  = Источник.Контрагент;
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ИзменениеЦен")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ИзменениеЦен") Тогда
		
		ТипЭД = ТипыДокументов.ПрайсЛист;
		НаправлениеЭД = НаправленияДокументов.Исходящий;
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, Контрагент");
			Организация = ЗначенияРеквизитов.Организация;
			Контрагент  = ЗначенияРеквизитов.Контрагент;
		Иначе
			Организация = Источник.Организация;
			Контрагент  = Источник.Контрагент;
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ПеремещениеТоваров")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		
		ТипЭД         = Перечисления.ТипыДокументовЭДО.Внутренний;
		НаправлениеЭД = Перечисления.НаправленияЭДО.Внутренний;
		
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, 
			"Организация");
			Организация = ЗначенияРеквизитов.Организация;
		Иначе
			Организация = Источник.Организация;
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ЭлектронныйДокументИсходящийЭДО")
			Или ТипИсточника = Тип("ДокументОбъект.ЭлектронныйДокументИсходящийЭДО") Тогда
		
		Если ЭтоСсылка Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Организация, Контрагент, ВидДокумента");
			Организация  = ЗначенияРеквизитов.Организация;
			Контрагент   = ЗначенияРеквизитов.Контрагент;
			ВидДокумента = ЗначенияРеквизитов.ВидДокумента;
		Иначе
			Организация  = Источник.Организация;
			Контрагент   = Источник.Контрагент;
			ВидДокумента = Источник.ВидДокумента;
		КонецЕсли;
		
		ТипЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДокумента, "ТипДокумента");
		
		Если ТипЭД = ТипыДокументов.УПД Тогда
			ТипЭД = ТипыДокументов.ТоварнаяНакладная;
			ПараметрыЭД.ФормированиеУниверсальногоДокумента = ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Обязательно;
		ИначеЕсли ТипЭД = ТипыДокументов.УКД Тогда
			ТипЭД = ТипыДокументов.КорректировочныйСчетФактура;
			ПараметрыЭД.ФормированиеУниверсальногоДокумента = ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Обязательно;
		КонецЕсли;
		
		НаправлениеЭД = НаправленияДокументов.Исходящий;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыЭД.Тип = ТипЭД;
	ПараметрыЭД.Направление = НаправлениеЭД;
	ПараметрыЭД.Организация = Организация;
	ПараметрыЭД.Контрагент  = Контрагент;
	ПараметрыЭД.ДоговорКонтрагента = Договор;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ОпределитьДокументЯвляетсяСчетомФактурой.
Процедура ОпределитьДокументЯвляетсяСчетомФактурой(ДокументСсылка, Результат) Экспорт
	
	ТипДокумента = ТипЗнч(ДокументСсылка);
	Результат = ТипДокумента = Тип("ДокументСсылка.СчетФактураВыданный")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.СчетФактураПолученный");
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПолучитьСоответствиеПеречислений.
Процедура ПолучитьСоответствиеПеречислений(СоответствиеПеречислений) Экспорт
	
	СоответствиеПеречислений.Вставить("НДС", "СтавкиНДС");
	СоответствиеПеречислений.Вставить("ЮрФизЛицо", "ФормыСобственности");
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьСоответствиеСтавокНДС.
Процедура ЗаполнитьСоответствиеСтавокНДС(Соответствие) Экспорт
	
	Соответствие.Вставить(НСтр("ru = 'без НДС'"), Справочники.СтавкиНДС.БезНДС);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СтавкиНДС.Наименование КАК Наименование,
		|	СтавкиНДС.Ставка КАК Ставка,
		|	СтавкиНДС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	НЕ СтавкиНДС.Ссылка = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС)"
	);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Соответствие.Вставить(СтрЗаменить(Строка(Выборка.Наименование), "%", ""), Выборка.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ДополнительнаяАналитикаКонтрагентовСправочникПартнеры.
Процедура ДополнительнаяАналитикаКонтрагентовСправочникПартнеры(ИспользуетсяСправочникПартнеры) Экспорт
	
	ИспользуетсяСправочникПартнеры = Ложь;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПодготовитьСтруктуруОбъектовКомандЭДО.
Процедура ПодготовитьСтруктуруОбъектовКомандЭДО(СоставКомандЭДО) Экспорт
	
	СоставКомандЭДО.Исходящие.Добавить("Документ.РеализацияТоваров");
	СоставКомандЭДО.Исходящие.Добавить("Документ.КорректировкаРеализации");
	СоставКомандЭДО.Исходящие.Добавить("Документ.СчетФактураВыданный");
	СоставКомандЭДО.Исходящие.Добавить("Документ.ЗаказПоставщику");
	СоставКомандЭДО.Исходящие.Добавить("Документ.СчетНаОплату");
	СоставКомандЭДО.Исходящие.Добавить("Документ.ОтчетКомитенту");
	СоставКомандЭДО.Исходящие.Добавить("Документ.ВозвратПоставщику");
	СоставКомандЭДО.Исходящие.Добавить("Документ.АктОРасхожденияхПоПоставке");
	//СоставКомандЭДО.Исходящие.Добавить("Документ.КоммерческоеПредложениеКлиенту");
	
	СоставКомандЭДО.Входящие.Добавить("Документ.ПоступлениеТоваров");
	СоставКомандЭДО.Входящие.Добавить("Документ.СчетФактураПолученный");
	//СоставКомандЭДО.Входящие.Добавить("ЖурналДокументов.ВходящиеДокументы");
	СоставКомандЭДО.Входящие.Добавить("Документ.ВозвратОтПокупателя");
	СоставКомандЭДО.Входящие.Добавить("Документ.ЗаказПокупателя");
	//СоставКомандЭДО.Входящие.Добавить("Документ.ЗаказПоставщику");
	СоставКомандЭДО.Входящие.Добавить("Документ.СчетОтПоставщика");
	СоставКомандЭДО.Входящие.Добавить("Документ.ОтчетКомиссионера");
	СоставКомандЭДО.Входящие.Добавить("Документ.КорректировкаПоступления");
	СоставКомандЭДО.Входящие.Добавить("Документ.АктОРасхожденияхПоОтгрузке");
	//СоставКомандЭДО.Входящие.Добавить("Документ.КоммерческоеПредложениеПоставщика");
	//СоставКомандЭДО.Входящие.Добавить("Документ.РегистрацияЦенНоменклатурыПоставщика");
	
	СоставКомандЭДО.БезПодписи.Добавить("Документ.СчетНаОплату");
	СоставКомандЭДО.БезПодписи.Добавить("Документ.СчетОтПоставщика");
	СоставКомандЭДО.БезПодписи.Добавить("Документ.ЗаказПокупателя");
	СоставКомандЭДО.БезПодписи.Добавить("Документ.ЗаказПоставщику");
	СоставКомандЭДО.БезПодписи.Добавить("Документ.РеализацияТоваров");
	//СоставКомандЭДО.БезПодписи.Добавить("Документ.КоммерческоеПредложениеКлиенту");
	//СоставКомандЭДО.БезПодписи.Добавить("Документ.КоммерческоеПредложениеПоставщика");
	СоставКомандЭДО.БезПодписи.Добавить("Документ.СчетНаОплату");
	СоставКомандЭДО.БезПодписи.Добавить("Документ.СчетОтПоставщика");
	//СоставКомандЭДО.БезПодписи.Добавить("Документ.ЗаявкаНаРасходованиеДенежныхСредств");
	//СоставКомандЭДО.БезПодписи.Добавить("Документ.РегистрацияЦенНоменклатурыПоставщика");
	СоставКомандЭДО.БезПодписи.Добавить("Документ.ОтчетКомитенту");
	СоставКомандЭДО.БезПодписи.Добавить("Документ.КорректировкаРеализации");
	СоставКомандЭДО.БезПодписи.Добавить("Документ.ПоступлениеТоваров");
	СоставКомандЭДО.БезПодписи.Добавить("Документ.ОтчетКомиссионера");
	СоставКомандЭДО.БезПодписи.Добавить("Документ.КорректировкаПоступления");
	//СоставКомандЭДО.БезПодписи.Добавить("ЖурналДокументов.ИсходящиеДокументы");
	//СоставКомандЭДО.БезПодписи.Добавить("ЖурналДокументов.ВходящиеДокументы");
	СоставКомандЭДО.БезПодписи.Добавить("Документ.СчетФактураВыданный");
	
	СоставКомандЭДО.Внутренние.Добавить("Документ.Инвентаризация");
	//СоставКомандЭДО.Внутренние.Добавить("Документ.ОприходованиеИзлишковТоваров");
	//СоставКомандЭДО.Внутренние.Добавить("Документ.ВнутреннееПотреблениеТоваров");
	//СоставКомандЭДО.Внутренние.Добавить("Документ.ПеремещениеТоваров");
	//СоставКомандЭДО.Внутренние.Добавить("Документ.ПересортицаТоваров");
	//СоставКомандЭДО.Внутренние.Добавить("Документ.СписаниеНедостачТоваров");
	//СоставКомандЭДО.Внутренние.Добавить("Документ.ЛистКассовойКниги");
	СоставКомандЭДО.Внутренние.Добавить("Документ.ПриходныйКассовыйОрдер");
	СоставКомандЭДО.Внутренние.Добавить("Документ.РасходныйКассовыйОрдер");
	//СоставКомандЭДО.Внутренние.Добавить("Документ.АвансовыйОтчет");
	//СоставКомандЭДО.Внутренние.Добавить("Документ.ДоверенностьВыданная");
	//СоставКомандЭДО.Внутренние.Добавить("Документ.ИнвентаризацияНаличныхДенежныхСредств");
	//СоставКомандЭДО.Внутренние.Добавить("Документ.ПоступлениеТоваровНаСклад");
	//СоставКомандЭДО.Внутренние.Добавить("Документ.СборкаТоваров");
	
	СоставКомандЭДО.Контрагенты.Добавить("Справочник.Контрагенты");
	СоставКомандЭДО.Организации.Добавить("Справочник.Организации");
	СоставКомандЭДО.Договоры.Добавить("Справочник.ДоговорыВзаиморасчетов");
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьРегистрационныеДанныеОрганизации
Процедура ЗаполнитьРегистрационныеДанныеОрганизации(Организация, ДанныеОрганизации) Экспорт
	
	СвойстваОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация,
			"НаименованиеПолное, ИНН, КПП, ОГРН, КодИМНС, ФормаСобственности");
	
	ОрганизацияФизЛицо = (СвойстваОрганизации.ФормаСобственности = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель
		ИЛИ СвойстваОрганизации.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо);
	
	ДанныеОрганизации.Вставить("ОрганизацияСсылка", Организация);
	ДанныеОрганизации.Вставить("Наименование" , СвойстваОрганизации.НаименованиеПолное);
	ДанныеОрганизации.Вставить("ИНН"          , СвойстваОрганизации.ИНН);
	ДанныеОрганизации.Вставить("КПП"          , СвойстваОрганизации.КПП);
	ДанныеОрганизации.Вставить("ОГРН"         , СвойстваОрганизации.ОГРН);
	ДанныеОрганизации.Вставить("КодИМНС"      , СвойстваОрганизации.КодИМНС);
	
	Если ОрганизацияФизЛицо Тогда
		ДанныеОрганизации.Вставить("ЮрФизЛицо", "ФизЛицо");
	Иначе
		ДанныеОрганизации.Вставить("ЮрФизЛицо", "ЮрЛицо");
	КонецЕсли;
	
	ЗаполнитьДанныеРуководителя(СвойстваОрганизации, ДанныеОрганизации);
	
	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
	
	ДанныеОрганизации.Вставить("Индекс"         , "");
	ДанныеОрганизации.Вставить("Регион"         , "");
	ДанныеОрганизации.Вставить("КодРегиона"     , "");
	ДанныеОрганизации.Вставить("Район"          , "");
	ДанныеОрганизации.Вставить("Город"          , "");
	ДанныеОрганизации.Вставить("НаселенныйПункт", "");
	ДанныеОрганизации.Вставить("Улица"          , "");
	ДанныеОрганизации.Вставить("Дом"            , "");
	ДанныеОрганизации.Вставить("Корпус"         , "");
	ДанныеОрганизации.Вставить("Квартира"       , "");
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Значение
	|ИЗ
	|	Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Ссылка
	|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Организация);
	Запрос.УстановитьПараметр("Вид",    ВидКонтактнойИнформации);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		АдресСтруктурой = РаботаСАдресами.СведенияОбАдресе(Выборка.Значение);
		Если АдресСтруктурой.Свойство("Индекс") Тогда
			ДанныеОрганизации.Индекс = АдресСтруктурой.Индекс;
		КонецЕсли;
		Если АдресСтруктурой.Свойство("Регион") Тогда
			ДанныеОрганизации.Регион = АдресСтруктурой.Регион;
		КонецЕсли;
		Если АдресСтруктурой.Свойство("КодРегиона") Тогда
			ДанныеОрганизации.КодРегиона = АдресСтруктурой.КодРегиона;
		КонецЕсли;
		Если АдресСтруктурой.Свойство("Район") Тогда
			ДанныеОрганизации.Район = АдресСтруктурой.Район;
		КонецЕсли;
		Если АдресСтруктурой.Свойство("Город") Тогда
			ДанныеОрганизации.Город = АдресСтруктурой.Город;
		КонецЕсли;
		Если АдресСтруктурой.Свойство("НаселенныйПункт") Тогда
			ДанныеОрганизации.НаселенныйПункт = АдресСтруктурой.НаселенныйПункт;
		КонецЕсли;
		Если АдресСтруктурой.Свойство("Улица") Тогда
			ДанныеОрганизации.Улица = АдресСтруктурой.Улица;
		КонецЕсли;
		Если АдресСтруктурой.Свойство("Здание") И ЗначениеЗаполнено(АдресСтруктурой.Здание) Тогда
			ДанныеОрганизации.Дом = АдресСтруктурой.Здание.Номер;
		КонецЕсли;
		Если АдресСтруктурой.Свойство("Корпуса") И ЗначениеЗаполнено(АдресСтруктурой.Корпуса) Тогда
			ДанныеОрганизации.Корпус = АдресСтруктурой.Корпуса[0].Номер;
		КонецЕсли;
		Если АдресСтруктурой.Свойство("Помещения") И ЗначениеЗаполнено(АдресСтруктурой.Помещения) Тогда
			ДанныеОрганизации.Квартира = АдресСтруктурой.Помещения[0].Номер;
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеОрганизации.Вставить("Телефон", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		Организация, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации));
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПоКаталогуТоваровCML.
Процедура ЗаполнитьДанныеПоКаталогуТоваровCML(Организация, ТоварыКаталога, ДеревоДанных, Отказ) Экспорт
	
	Если Не ЗначениеЗаполнено(ТоварыКаталога) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "СодержитТолькоИзменения", Истина);
	
	СведенияОбОрганизации = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Организация, СведенияОбОрганизации);
	ЗаполнитьДанныеУчастника(ДеревоДанных, СведенияОбОрганизации, "Владелец", "Юр");
	
	ТоварыКаталога.Колонки.Добавить("Сопоставление");
	
	ШтрихкодыКомбинаций = Неопределено;
	ШтрихкодыНоменклатуры = Неопределено;
	ШтрихкодыПоТоварам(ТоварыКаталога, ШтрихкодыКомбинаций, ШтрихкодыНоменклатуры);
	
	Для Каждого СтрокаТовара Из ТоварыКаталога Цикл
		
		СтрокаТовара.Сопоставление = СопоставленияНоменклатурыЭД(СтрокаТовара.Номенклатура,
			СтрокаТовара.ХарактеристикаНоменклатуры, СтрокаТовара.ЕдиницаИзмерения);
			
		ЗаполнитьШтрихкодыТоваровВСопоставление(
			СтрокаТовара.Сопоставление,
			ШтрихкодыНоменклатуры,
			ШтрихкодыКомбинаций,
			СтрокаТовара.Номенклатура,
			СтрокаТовара.ХарактеристикаНоменклатуры,
			СтрокаТовара.ЕдиницаИзмерения
		);
		
	КонецЦикла;
	
	ЗаполнитьПараметрыОбработкиОшибокВТаблицеТоваровCML(ТоварыКаталога);
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ТоварыКаталога, "Товары");
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.СсылкаНаОбъектПоИННКПП.
Процедура СсылкаНаОбъектПоИННКПП(ТипОбъекта, ИНН, КПП, Ссылка, ДатаСведений = Неопределено) Экспорт
	
	Ссылка = Неопределено;
	
	Если ВРег(ТипОбъекта) = ВРег("Контрагенты") Тогда
		
		// Для контрагентов приватная обработка из-за особенностей подчиненности
		Ссылка = НайтиКонтрагентаПоИННКПП(ИНН, КПП);
		Возврат;
		
	КонецЕсли;
	
	ИмяМетаданных = ОбщегоНазначенияБЭД.ИмяПрикладногоСправочника(ТипОбъекта);
	
	ТекстЗапроса = СтрШаблон(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Выборка.Ссылка КАК НайденныйОбъект
		|ИЗ
		|	Справочник.%1 КАК Выборка
		|ГДЕ
		|	Выборка.ИНН = &ИНН",
		ИмяМетаданных
	);
	
	Если ЗначениеЗаполнено(КПП) И КПП <> "0" Тогда
		
		ТекстЗапроса = ТекстЗапроса + " И Выборка.КПП = &КПП";
		
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Ссылка = РезультатЗапроса.Выгрузить()[0].НайденныйОбъект;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьРеквизитыКонтрагента.
Процедура ЗаполнитьРеквизитыКонтрагента(СтруктураРеквизитов, КонтрагентСсылка) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Если ЗначениеЗаполнено(СтруктураРеквизитов.Контрагент) Тогда
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.Контрагенты");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СтруктураРеквизитов.Контрагент);
			Блокировка.Заблокировать();
			
			Контрагент = СтруктураРеквизитов.Контрагент.ПолучитьОбъект();
		Иначе
			Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
		КонецЕсли;
		
		Контрагент.Наименование = СтруктураРеквизитов.Наименование;
		ИНН_КПП        = СтруктураРеквизитов.ИНН_КПП;
		Контрагент.ИНН = Сред(ИНН_КПП, 1, СтрНайти(ИНН_КПП, "/") - 1);
		Контрагент.КПП = Сред(ИНН_КПП, СтрНайти(ИНН_КПП, "/") + 1);
		
		Контрагент.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	КонтрагентСсылка = Контрагент.Ссылка;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПолучитьЗначениеПеречисления.
Процедура ПолучитьЗначениеПеречисления(ИмяПеречисления, ПредставлениеПеречисления, НайденноеЗначение) Экспорт
	
	Если Метаданные.Перечисления.Найти(ИмяПеречисления) = Неопределено Тогда
		НайденноеЗначение = ПредставлениеПеречисления;
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлПеречисления Из Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления Цикл
		Если СтрНайти(ВРег(ЭлПеречисления.Синоним), ВРег(ПредставлениеПеречисления)) > 0
			ИЛИ СтрНайти(ВРег(ЭлПеречисления.Имя), ВРег(ПредставлениеПеречисления)) > 0 Тогда
			
			НайденноеЗначение = Перечисления[ИмяПеречисления][ЭлПеречисления.Имя];
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ДанныеСвидетельстваОРегистрацииИП.
Процедура ДанныеСвидетельстваОРегистрацииИП(ИП, Сведения) Экспорт
	
	Если ТипЗнч(ИП) = Тип("СправочникСсылка.Организации") Тогда
		РеквизитыСвидетельства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИП,
			"СвидетельствоДатаВыдачи, СвидетельствоСерияНомер");
		Сведения = СтрШаблон(НСтр("ru = 'Свидетельство о регистрации № %1 от %2'"), 
			РеквизитыСвидетельства.СвидетельствоСерияНомер,
			Формат(РеквизитыСвидетельства.СвидетельствоДатаВыдачи, "ДЛФ=D"));
	Иначе
		Сведения = "";
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.АдресЭлектроннойПочтыКонтрагента.
Процедура АдресЭлектроннойПочтыКонтрагента(Контрагент, АдресЭП) Экспорт
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК АдресЭП
	|ИЗ
	|	&ИмяТаблицыКонтактнаяИнформация КАК КонтактнаяИнформация 
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Владелец
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &ВидEmail";
	
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Организации") Тогда
		ВидEmail = Справочники.ВидыКонтактнойИнформации["EmailОрганизации"].Ссылка;
	ИначеЕсли ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		ВидEmail = Справочники.ВидыКонтактнойИнформации["EmailКонтрагента"].Ссылка;
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицыКонтактнаяИнформация", 
		Контрагент.Метаданные().ПолноеИмя() + ".КонтактнаяИнформация");
	
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Запрос.УстановитьПараметр("Тип",      Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ВидEmail", ВидEmail);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		АдресЭП = Выборка.АдресЭП;
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПолучитьБанковскиеСчета.
Процедура ПолучитьБанковскиеСчета(Организация, Таблица) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БанковскиеСчета.Ссылка КАК БанковскийСчет
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Организация
	|	И &УсловияОтбораПоБанку";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("УсловияОтбораПоБанку", Истина);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПолучитьБанковскиеРеквизиты.
Процедура ПолучитьБанковскиеРеквизиты(МассивСчетов, Таблица) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БанковскиеСчета.Ссылка КАК Ссылка,
	|	БанковскиеСчета.НомерСчета КАК РасчетныйСчет,
	|	ЕСТЬNULL(БанковскиеСчета.Банк.КоррСчет, """") КАК КорреспондентскийСчет,
	|	ЕСТЬNULL(БанковскиеСчета.Банк.Код, """") КАК БИК,
	|	ЕСТЬNULL(БанковскиеСчета.Банк.Наименование, """") КАК Банк,
	|	ЕСТЬNULL(БанковскиеСчета.БанкРасчетов.Наименование, """") КАК БанкДляРасчетов,
	|	ЕСТЬNULL(БанковскиеСчета.БанкРасчетов.Код, """") КАК БанкДляРасчетовБИК,
	|	ЕСТЬNULL(БанковскиеСчета.БанкРасчетов.КоррСчет, """") КАК БанкДляРасчетовКоррСчет
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Ссылка В(&МассивСчетов)";
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПослеВозникновенииСобытияПоЭлектронномуСчетуФактуре.
Процедура ПослеВозникновенииСобытияПоЭлектронномуСчетуФактуре(ДокументыУчета, Событие, СостояниеОбработки) Экспорт
	
	// Выделим счет-фактуру из документов учета
	СчетФактура = Неопределено;
	Для Каждого ДокументУчета Из ДокументыУчета Цикл
		Если ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураВыданный")
			ИЛИ ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			
			СчетФактура = ДокументУчета;
		КонецЕсли;
	КонецЦикла;
	
	Если СчетФактура = Неопределено Тогда
		// Счет-фактура еще не привязан к электронному документу - прерываем обработку.
		Возврат;
	КонецЕсли;
	
	Если Событие = "ПолученПДП" Тогда
		
		// Датой выставления покупателю счета-фактуры в электронном виде по телекоммуникационным
		// каналам связи считается дата поступления файла счета-фактуры Оператору ЭДО от продавца,
		// указанная в подтверждении (ПДПЭСФ) этого Оператора ЭДО.
		// Счет-фактура в электронном виде считается выставленным, если продавцу поступило
		// соответствующее подтверждение (ПДПЭСФ) Оператора ЭДО.
		// Приказ Минфина России от 10.11.2015 N 174н.
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ.СчетФактураВыданный");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", СчетФактура);
		
		НачатьТранзакцию();
		
		Попытка
			Блокировка.Заблокировать();
			
			СчетФактура = СчетФактура.ПолучитьОбъект();
			СчетФактура.ОбменДанными.Загрузка = Истина;
			СчетФактура.ДатаВыставления = СостояниеОбработки.ДатаПоступленияСФОператоруОтПродавца;
			СчетФактура.Выставлен = Истина;
			СчетФактура.Записать();
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	ИначеЕсли Событие = "ПолученПДО" Тогда
		
		// Датой получения покупателем счета-фактуры в электронном виде по телекоммуникационным
		// каналам связи считается дата направления покупателю Оператором ЭДО файла счета-фактуры продавца,
		// указанная в подтверждении (ПДОЭСФ) Оператора ЭДО.
		// Счет-фактура в электронном виде считается полученным покупателем, если ему поступило
		// соответствующее подтверждение (ПДОЭСФ) Оператора ЭДО.
		// Приказ Минфина России от 10.11.2015 N 174н.
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ.СчетФактураПолученный");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", СчетФактура);
		
		НачатьТранзакцию();
		
		Попытка
			Блокировка.Заблокировать();
			
			СчетФактура = СчетФактура.ПолучитьОбъект();
			СчетФактура.ОбменДанными.Загрузка = Истина;
			СчетФактура.ДатаПолучения = СостояниеОбработки.ДатаОтправкиСФПокупателюОператором;
			СчетФактура.Получен = Истина;
			СчетФактура.Записать();
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.СуммаПрописью.
Процедура СуммаПрописью(СуммаЧислом, КодВалюты, Результат) Экспорт
	
	Сумма             = ?(СуммаЧислом < 0, -СуммаЧислом, СуммаЧислом);
	ЦелаяЧасть        = Цел(Сумма);
	ФорматСтрока      = "Л=ru_RU;ДП=Ложь";
	ПараметрыПредмета = Новый Структура("ПараметрыПрописиНаРусском", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	
	Результат = ЧислоПрописью(Сумма, ФорматСтрока, ПараметрыПредмета.ПараметрыПрописиНаРусском);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПолучитьОтветственногоПоЭД.
Процедура ПолучитьОтветственногоПоЭД(Контрагент, Организация, ДоговорКонтрагента, ОтветственныйПоЭД) Экспорт
	
	ОтветственныйПоЭД = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЭтоФизЛицо.
Процедура ЭтоФизЛицо(ДанныеКонтрагента, ПризнакФизЛица) Экспорт
	
	ФормаСобственности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКонтрагента, "ФормаСобственности");
	Если ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо
		ИЛИ ФормаСобственности = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель Тогда
		
		ПризнакФизЛица = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииТипаУчастникаЭДО(ПроверяемоеЛицо, Признаки) Экспорт
	
	Если Не ЗначениеЗаполнено(ПроверяемоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	ФормаСобственности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроверяемоеЛицо, "ФормаСобственности");
	Если ФормаСобственности = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель Тогда
		Признаки.ЭтоИП = Истина;
	ИначеЕсли ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		Признаки.ЭтоФизЛицо = Истина;
	ИначеЕсли ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицоНеРезидент Тогда
		Признаки.ЭтоИностранноеЛицо = Истина;
	ИначеЕсли ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
		Признаки.ЭтоЮрЛицо = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура СведенияФизЛицаПользователя(Пользователь, Организация, ДанныеФизЛица) Экспорт

	ДанныеФизЛица.ИмяПолное = Пользователь.Наименование;
	ДанныеФизЛица.Должность = "";
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.СписокТиповДокументовПоТипуЭлектронногоДокумента.
Процедура СписокТиповДокументовПоТипуЭлектронногоДокумента(ТипДокумента, СписокВозврата) Экспорт
	
	ТипыДокументов = ОбменСКонтрагентами.ТипыДокументов();
	
	Если ТипДокумента = ТипыДокументов.ТоварнаяНакладная
		ИЛИ ТипДокумента = ТипыДокументов.АктВыполненныхРабот
		ИЛИ ТипДокумента = ТипыДокументов.АктНаПередачуПрав Тогда
		
		СписокВозврата.Добавить(Документы.ПоступлениеТоваров.ПустаяСсылка(),
		Метаданные.Документы.ПоступлениеТоваров.Представление());
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СоглашениеОбИзмененииСтоимости Тогда
		
		СписокВозврата.Добавить(Документы.КорректировкаПоступления.ПустаяСсылка(),
		Метаданные.Документы.КорректировкаПоступления.Представление());
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СчетФактура ИЛИ ТипДокумента = ТипыДокументов.КорректировочныйСчетФактура
		Или ТипДокумента = ТипыДокументов.УПД ИЛИ ТипДокумента = ТипыДокументов.УКД Тогда
		
		СписокВозврата.Добавить(Документы.СчетФактураПолученный.ПустаяСсылка(),
		Метаданные.Документы.СчетФактураПолученный.Представление());
		
	ИначеЕсли ТипДокумента = ТипыДокументов.АктВыполненныхРабот Тогда
		
		СписокВозврата.Добавить(Документы.ПоступлениеДопРасходов.ПустаяСсылка(), 
			Метаданные.Документы.ПоступлениеДопРасходов.Представление());
		
	ИначеЕсли ТипДокумента = ТипыДокументов.ОтчетОПродажахКомиссионногоТовара Тогда
		
		СписокВозврата.Добавить(Документы.ОтчетКомиссионера.ПустаяСсылка(), 
			Метаданные.Документы.ОтчетКомиссионера.Представление());
		
	ИначеЕсли ТипДокумента = ТипыДокументов.ОтчетОСписанииКомиссионногоТовара Тогда
		
		СписокВозврата.Добавить(Документы.ОтчетКомиссионера.ПустаяСсылка(), 
			Метаданные.Документы.ОтчетКомиссионера.Представление());
			
	ИначеЕсли ТипДокумента = ТипыДокументов.ПрайсЛист Тогда
		
		СписокВозврата.Добавить(Документы.СогласованиеЗакупочныхЦен.ПустаяСсылка(), 
			 Метаданные.Документы.СогласованиеЗакупочныхЦен.Представление());
			 
	ИначеЕсли ТипДокумента = ТипыДокументов.СчетНаОплату Тогда
		
		СписокВозврата.Добавить(Документы.СчетОтПоставщика.ПустаяСсылка(), 
			Метаданные.Документы.СчетОтПоставщика.Представление());
		
	ИначеЕсли ТипДокумента = ТипыДокументов.ЗаказТовара Тогда
		
		СписокВозврата.Добавить(Документы.ЗаказПокупателя.ПустаяСсылка(),
			Метаданные.Документы.ЗаказПокупателя.Представление());
		
	ИначеЕсли ТипДокумента = ТипыДокументов.ОтветНаЗаказ Тогда
		
		СписокВозврата.Добавить(Документы.ЗаказПоставщику.ПустаяСсылка(),
			Метаданные.Документы.ЗаказПоставщику.Представление());
			
	ИначеЕсли ТипДокумента = ТипыДокументов.АктОРасхождениях Тогда
		
		СписокВозврата.Добавить(Документы.АктОРасхожденияхПоОтгрузке.ПустаяСсылка(),
			Метаданные.Документы.АктОРасхожденияхПоОтгрузке.Представление());
			
	ИначеЕсли ТипДокумента = ТипыДокументов.РеквизитыОрганизации Тогда
		СписокВозврата.Добавить(Справочники.Контрагенты.ПустаяСсылка(),
		Метаданные.Справочники.Контрагенты.Представление());
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПолучитьРеквизитыОрганизацииДляВыгрузкиВФайл.
Процедура ПолучитьРеквизитыОрганизацииДляВыгрузкиВФайл(Организация, СтруктураВозврата) Экспорт
	
	ЗаполнитьЗначенияСвойств(СтруктураВозврата,
		ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "Наименование, ИНН, КПП, ЮрФизЛицо"));
	СтруктураВозврата.НаименованиеПолное = СтруктураВозврата.Наименование;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ИспользоватьОбменЭДМеждуОрганизациями.
Процедура ИспользоватьОбменЭДМеждуОрганизациями(Отказ) Экспорт
	
	Отказ = Истина;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.СпособыОтраженияВУчетеТипаЭлектронногоДокумента.
Процедура СпособыОтраженияВУчетеТипаЭлектронногоДокумента(ТипДокумента, СпособыОтраженияВУчете) Экспорт 
	
	ТипыДокументов = ОбменСКонтрагентами.ТипыДокументов();
	
	Если ТипДокумента = ТипыДокументов.АктВыполненныхРабот Тогда
		
		СпособыОтраженияВУчете.Добавить("ПоступлениеТоваров",
			НСтр("ru = 'Поступление товаров'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.ТоварнаяНакладная Тогда
		
		СпособыОтраженияВУчете.Добавить("ПоступлениеТоваров",
			НСтр("ru = 'Поступление товаров'"), Истина);
		СпособыОтраженияВУчете.Добавить("КорректировкаПоступления",
			НСтр("ru = 'Корректировка поступления'"), Истина);
		СпособыОтраженияВУчете.Добавить("ВозвратТоваровОтПокупателя",
			НСтр("ru = 'Возврат товаров от клиента'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СоглашениеОбИзмененииСтоимости Тогда
		
		СпособыОтраженияВУчете.Добавить("КорректировкаПоступления",
			НСтр("ru = 'Корректировка поступления'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.АктНаПередачуПрав Тогда
		
		СпособыОтраженияВУчете.Добавить("ПоступлениеТоваров",
			НСтр("ru = 'Акт на передачу прав'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.ОтветНаЗаказ Тогда
			
		СпособыОтраженияВУчете.Добавить("ЗаказПоставщику", НСтр("ru = 'Заказ поставщику'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.ЗаказТовара Тогда
		
		СпособыОтраженияВУчете.Добавить("ЗаказПокупателя", НСтр("ru = 'Заказ клиента'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.КорректировочныйСчетФактура Тогда
		
		СпособыОтраженияВУчете.Добавить("СчетФактураПолученный", НСтр("ru = 'Счет-фактура полученный'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СчетФактура Тогда
		
		СпособыОтраженияВУчете.Добавить("СчетФактураПолученный", НСтр("ru = 'Счет-фактура полученный'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СчетНаОплату Тогда
		
		СпособыОтраженияВУчете.Добавить("СчетОтПоставщика",
			НСтр("ru = 'Счет от поставщика'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.ОтчетОПродажахКомиссионногоТовара Тогда
		
		СпособыОтраженияВУчете.Добавить("ОтчетКомиссионера", НСтр("ru = 'Отчет комиссионера (агента) о продажах'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.ОтчетОСписанииКомиссионногоТовара Тогда
		
		СпособыОтраженияВУчете.Добавить("ОтчетКомиссионераОСписании", НСтр("ru = 'Отчет комиссионера о списании'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.АктОРасхождениях Тогда
		
		СпособыОтраженияВУчете.Добавить("АктОРасхожденияхПоОтгрузке", НСтр("ru = 'Акт о расхождениях по отгрузке'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.УПД Тогда
		
		СпособыОтраженияВУчете.Добавить("ПоступлениеТоваров",
			НСтр("ru = 'Поступление товаров'"), Истина);
		СпособыОтраженияВУчете.Добавить("КорректировкаПоступления",
			НСтр("ru = 'Корректировка поступления'"), Истина);
		СпособыОтраженияВУчете.Добавить("ВозвратТоваровОтПокупателя",
			НСтр("ru = 'Возврат товаров от клиента'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.КаталогТоваров Тогда
		
		СпособыОтраженияВУчете.Добавить("НоменклатураКонтрагентов", НСтр("ru = 'Номенклатура поставщиков'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СведенияОРеализацииКомиссионером Тогда
		
		СпособыОтраженияВУчете.Добавить("СведенияОРеализацииКомиссионером", НСтр("ru = 'Поступление товаров'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СведенияОЗакупкеКомиссионером Тогда
		
		СпособыОтраженияВУчете.Добавить("СведенияОЗакупкеКомиссионером", НСтр("ru = 'Поступление товаров'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.КорректировкаСведенийОРеализацииКомиссионером Тогда
		
		СпособыОтраженияВУчете.Добавить("КорректировкаСведенийОРеализацииКомиссионером", НСтр("ru = 'Корректировка поступления'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.КорректировкаСведенийОЗакупкеКомиссионером Тогда
		
		СпособыОтраженияВУчете.Добавить("КорректировкаСведенийОЗакупкеКомиссионером", НСтр("ru = 'Корректировка поступления'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.ДоговорныйДокумент Тогда
	
		СпособыОтраженияВУчете.Добавить("ДоговорыКонтрагентов", НСтр("ru = 'Договор'"), Истина);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.АктСверкиВзаиморасчетов Тогда
		
		СпособыОтраженияВУчете.Добавить("АктСверкиВзаиморасчетов", НСтр("ru = 'Акт сверки взаиморасчетов'"), Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ИмяОбъектаМетаданныхПоСпособуОтраженияВУчете.
Процедура ИмяОбъектаМетаданныхПоСпособуОтраженияВУчете(СпособОбработки, ИмяДокумента) Экспорт 
	
	Если СпособОбработки = "ВозвратТоваровОтПокупателя"
		Или СпособОбработки = "АктВыполненныхРабот"
		Или СпособОбработки = "АктНаПередачуПрав" Тогда
		ИмяДокумента = "ПоступлениеТоваров";
	ИначеЕсли СпособОбработки = "СведенияОРеализацииКомиссионером"
		ИЛИ СпособОбработки = "КорректировкаСведенийОРеализацииКомиссионером" Тогда
		ИмяДокумента = "РеализацияТоваров";
	ИначеЕсли СпособОбработки = "СведенияОЗакупкеКомиссионером"
		ИЛИ СпособОбработки = "КорректировкаСведенийОЗакупкеКомиссионером" Тогда
		ИмяДокумента = "ПоступлениеТоваров";
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.СоответствиеИсходящихТиповЭлектронныхДокументовДокументамИБ.
Процедура СоответствиеИсходящихТиповЭлектронныхДокументовДокументамИБ(СоответствиеТиповЭлектронныхДокументовДокументамИБ) Экспорт 
	
	ТипыДокументов = ОбменСКонтрагентами.ТипыДокументов();
	
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(ТипыДокументов.ТоварнаяНакладная,         НСтр("ru = 'Реализация товаров и услуг'"));
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(ТипыДокументов.АктВыполненныхРабот,         НСтр("ru = 'Акт выполненных работ для клиента'"));
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(ТипыДокументов.АктНаПередачуПрав,      НСтр("ru = 'Акт на передачу прав'"));
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(ТипыДокументов.СчетФактура,            НСтр("ru = 'Счет-фактура выданный'"));
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(ТипыДокументов.СоглашениеОбИзмененииСтоимости,
		НСтр("ru = 'Корректировка реализации'"));
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(ТипыДокументов.КорректировочныйСчетФактура, НСтр("ru = 'Счет-фактура выданный (Корректировка)'"));
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(ТипыДокументов.КаталогТоваров,         НСтр("ru = 'Каталог товаров (Настройка ЭДО)'"));
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(ТипыДокументов.ОтветНаЗаказ,           НСтр("ru = 'Заказ покупателя'"));
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(ТипыДокументов.ЗаказТовара,            НСтр("ru = 'Заказ поставщику'"));
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(ТипыДокументов.СчетНаОплату,           НСтр("ru = 'Счет на оплату клиенту'"));
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(ТипыДокументов.АктОРасхождениях,       НСтр("ru = 'Акт о расхождениях после поступления'"));
	
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(ТипыДокументов.УПД,       НСтр("ru = 'Акты/накладные + счет-фактура'"));
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(ТипыДокументов.УКД,       НСтр("ru = 'Акты/накладные + счет-фактура (Корректировка)'"));
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(ТипыДокументов.ПрайсЛист,              					НСтр("ru = 'Прайс-лист'"));
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(
		ТипыДокументов.СведенияОРеализацииКомиссионером,
		НСтр("ru = 'Сведения о реализации комиссионером'")
	);
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(
		ТипыДокументов.СведенияОЗакупкеКомиссионером,
		НСтр("ru = 'Сведения о закупке комиссионером'")
	);
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(
		ТипыДокументов.КорректировкаСведенийОРеализацииКомиссионером,
		НСтр("ru = 'Сведения о реализации комиссионером (Корректировка)'")
	);
	СоответствиеТиповЭлектронныхДокументовДокументамИБ.Вставить(
		ТипыДокументов.КорректировкаСведенийОЗакупкеКомиссионером,
		НСтр("ru = 'Сведения о закупке комиссионером (Корректировка)'")
	);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПриПолученииОписанияОснованияЭлектронногоДокумента.
Процедура ПриПолученииОписанияОснованияЭлектронногоДокумента(ОснованиеОбъект, Описание, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(ОснованиеОбъект) Тогда
		РеквизитыСсылки = ИнтеграцияЭДО.ЗначенияРеквизитовОбъектаУчета(ОснованиеОбъект, "Дата,Номер,Организация,Контрагент,СуммаДокумента,ХозОперация");
		ЗаполнитьЗначенияСвойств(Описание, РеквизитыСсылки);
		Описание.Вид = СокрЛП(РеквизитыСсылки.ХозОперация);
	Иначе
		Описание.Организация    = РеквизитыСсылки.Организация;
		Описание.Контрагент     = РеквизитыСсылки.Контрагент;
		Описание.Дата           = РеквизитыСсылки.Дата;
		Описание.Номер          = РеквизитыСсылки.Номер;
		Описание.СуммаДокумента = РеквизитыСсылки.СуммаДокумента;
		Описание.Вид            = СокрЛП(РеквизитыСсылки.ХозОперация);
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПолучитьНомерДатаДоговораДокументов
Процедура ПолучитьНомерДатаДоговораДокументов(МассивСсылок, ВозвращаемоеСоответствие) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	РеализацияТоваров.ДоговорВзаиморасчетов.НомерДоговора КАК НомерДоговора,
	|	РеализацияТоваров.ДоговорВзаиморасчетов.ДатаНачала КАК ДатаДоговора,
	|	РеализацияТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураВыданный.ДоговорВзаиморасчетов.НомерДоговора,
	|	СчетФактураВыданный.ДоговорВзаиморасчетов.ДатаНачала,
	|	СчетФактураВыданный.Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваров.ДоговорВзаиморасчетов.НомерДоговора,
	|	ПоступлениеТоваров.ДоговорВзаиморасчетов.ДатаНачала,
	|	ПоступлениеТоваров.Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураПолученный.ДоговорВзаиморасчетов.НомерДоговора,
	|	СчетФактураПолученный.ДоговорВзаиморасчетов.ДатаНачала,
	|	СчетФактураПолученный.Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.Ссылка В(&МассивСсылок)";
	
	Запрос.УстановитьПараметр("МассивСсылок",МассивСсылок); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ВозвращаемоеСоответствие.Вставить(Выборка.Ссылка, Новый Структура("НомерДоговора, ДатаДоговора" ,Выборка.НомерДоговора, Выборка.ДатаДоговора));
		
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// Методы, переопределяющие поведение библиотеки БЭД.

#Область СопоставлениеНоменклатуры

#Область Прочее

// Создает номенклатуру по данным контрагента.
//
// Параметры:
//  НаборНоменклатурыКонтрагентов - Массив - номенклатура контрагентов, по которой нужно создать номенклатуру информационной базы.
//                                           См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураКонтрагента.
//  ЗначенияПоУмолчанию - Структура - значения реквизитов по умолчанию.
//
// Возвращаемое значение:
//  Массив - описания созданной номенклатуры. Элементы представлены структурой:
//   * НоменклатураКонтрагента - Структура - элемент из параметра НаборНоменклатурыКонтрагентов, для которого удалось создать номенклатуру.
//   * НоменклатураИБ - Структура - описание созданной номенклатуры. См. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураИнформационнойБазы.
//
Функция СоздатьНоменклатуруПоДаннымКонтрагента(Знач НаборНоменклатурыКонтрагентов, Знач ЗначенияПоУмолчанию,
	Контекст = Неопределено) Экспорт
	
	Результат = Новый Массив;
	СозданныеНоменклатуры = Новый Соответствие;
	
	Для Каждого НоменклатураКонтрагента Из НаборНоменклатурыКонтрагентов Цикл
		
		НайденнаяНоменклатура = СозданныеНоменклатуры.Получить(НоменклатураКонтрагента.ИдентификаторНоменклатуры);
		Если НайденнаяНоменклатура <> Неопределено Тогда
			НоменклатураИБ = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураИнформационнойБазы(НайденнаяНоменклатура);
		Иначе
			НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
			НоваяНоменклатура.Заполнить(Неопределено);
	
			НоваяНоменклатура.УстановитьНовыйКод();
			//ЗаполнитьЗначенияСвойств(НоваяНоменклатура, ЗначенияПоУмолчанию);
			НоваяНоменклатура.Наименование       = НоменклатураКонтрагента.Наименование;
			НоваяНоменклатура.НаименованиеПолное = НоменклатураКонтрагента.Наименование;
			НоваяНоменклатура.Артикул            = НоменклатураКонтрагента.Артикул;
			
			ГруппаНоменклатуры = ПолучитьЗначениеПараметраСтруктуры(ЗначенияПоУмолчанию, "ГруппаНоменклатуры", Неопределено);
			НоваяНоменклатура.Родитель           = ГруппаНоменклатуры;
			
			Если ЗначениеЗаполнено(НоменклатураКонтрагента.ЕдиницаИзмеренияКод) Тогда
				НоваяНоменклатура.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиСоздатьЭлементКлассификатораПоКоду(НоменклатураКонтрагента.ЕдиницаИзмеренияКод);
			ИначеЕсли ЗначениеЗаполнено(НоменклатураКонтрагента.ЕдиницаИзмерения) Тогда
				НоваяНоменклатура.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиСоздатьЭлементКлассификатора(НоменклатураКонтрагента.ЕдиницаИзмерения);
			КонецЕсли;
			
			ТипНоменклатуры = ПолучитьЗначениеПараметраСтруктуры(ЗначенияПоУмолчанию, "ТипНоменклатуры", Неопределено);
			
			Если ЗначениеЗаполнено(ТипНоменклатуры) Тогда
				НоваяНоменклатура.ТипНоменклатуры = ТипНоменклатуры;
			ИначеЕсли ТорговыйКомплексПовтИсп.ЭтоЕдиницаМассы(НоваяНоменклатура.БазоваяЕдиницаИзмерения) Тогда
				НоваяНоменклатура.ТипНоменклатуры = Справочники.ТипыНоменклатуры.Весовой;
			Иначе
				НоваяНоменклатура.ТипНоменклатуры = Справочники.ТипыНоменклатуры.Штучный;
			КонецЕсли;
			
			ВидНоменклатуры = ПолучитьЗначениеПараметраСтруктуры(ЗначенияПоУмолчанию, "ВидНоменклатуры", Неопределено);
			Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
				НоваяНоменклатура.ВидНоменклатуры = ВидНоменклатуры;
			Иначе
				НоваяНоменклатура.ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяНоменклатура.ТипНоменклатуры, "ВидНоменклатуры");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НоменклатураКонтрагента.СтавкаНДС) Тогда
				СтавкиНДСПоКлючу = Новый Соответствие;
				ОбменСКонтрагентамиПереопределяемый.ЗаполнитьСоответствиеСтавокНДС(СтавкиНДСПоКлючу);
				НоваяНоменклатура.СтавкаНДС = СтавкиНДСПоКлючу.Получить(НоменклатураКонтрагента.СтавкаНДС);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НоменклатураКонтрагента.СтранаПроисхожденияКод) Тогда
				НоваяНоменклатура.СтранаПроисхождения = Справочники.СтраныМира.ДанныеКлассификатораСтранМираПоКоду(СокрЛП(НоменклатураКонтрагента.СтранаПроисхожденияКод));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НоменклатураКонтрагента.КодТНВЭД) Тогда
				НоваяНоменклатура.КодТНВЭД = Справочники.КлассификаторТНВЭД.НайтиСоздатьЭлементКлассификатораПоКоду(СокрЛП(НоменклатураКонтрагента.КодТНВЭД));
			КонецЕсли;
			
			Если НоменклатураКонтрагента.ПрослеживаемыйТовар Тогда
				НоваяНоменклатура.Прослеживаемый = Истина;
			ИначеЕсли ЗначениеЗаполнено(НоваяНоменклатура.КодТНВЭД) Тогда
				НоваяНоменклатура.Прослеживаемый = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяНоменклатура.КодТНВЭД, "ПрослеживаемыйТовар");
			КонецЕсли;
			
			НоваяНоменклатура.Записать();
			
			ЕдиницаИзмерения = НоваяНоменклатура.ОсновнаяЕдиницаИзмерения;
			
			Если ЗначениеЗаполнено(НоменклатураКонтрагента.КоличествоУпаковок) И 
				ЗначениеЗаполнено(НоменклатураКонтрагента.НаименованиеУпаковки) И 
				(НЕ НоменклатураКонтрагента.КоличествоУпаковок = 1) Тогда
				ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПолучитьЕдиницуУпаковки(НоваяНоменклатура.Ссылка, НоваяНоменклатура.БазоваяЕдиницаИзмерения, НоменклатураКонтрагента.НаименованиеУпаковки, НоменклатураКонтрагента.КоличествоУпаковок);
			КонецЕсли;
			
			НоменклатураИБ = СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НоваяНоменклатураИнформационнойБазы(НоваяНоменклатура.Ссылка,,ЕдиницаИзмерения);
			
			СозданныеНоменклатуры.Вставить(НоменклатураКонтрагента.ИдентификаторНоменклатуры, НоменклатураИБ.Номенклатура);
			
		КонецЕсли;
		
		СозданныйЭлемент = Новый Структура;
		СозданныйЭлемент.Вставить("НоменклатураКонтрагента", НоменклатураКонтрагента);
		СозданныйЭлемент.Вставить("НоменклатураИБ", НоменклатураИБ);
		Результат.Добавить(СозданныйЭлемент);
		
	КонецЦикла;
	
	// Удалим сообщения, возникшие при проверке заполнения номенклатуры.
	// Остальные сообщения выводим как есть.
	НаборСообщений = ПолучитьСообщенияПользователю(Истина);
	Для Каждого Сообщение Из НаборСообщений Цикл
		Если Сообщение.КлючДанных <> Справочники.Номенклатура.ПустаяСсылка() Тогда
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ПриОпределенииСвойствУпаковкиЕдиницыИзмеренияНоменклатуры
Процедура ПриОпределенииСвойствУпаковкиЕдиницыИзмеренияНоменклатуры(Знач Упаковка, Знач Номенклатура, СвойстваУпаковки) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Упаковка", Упаковка);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК НаименованиеБазовойЕдиницыИзмерения,
	|	Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодОКЕИБазовойЕдиницыИзмерения,
	|	ЕдиницыИзмерения.Наименование КАК НаименованиеУпаковки,
	|	1 КАК КоличествоБазовойЕдиницыИзмерения,
	|	1 КАК КоличествоУпаковок
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ЕдиницыИзмерения.Ссылка = &Упаковка
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура";

	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СвойстваУпаковки, Выборка);
	КонецЦикла;
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.НайтиНаименованиеЕдиницыИзмеренияПоКодуОКЕИ
Процедура НайтиНаименованиеЕдиницыИзмеренияПоКодуОКЕИ(КодОКЕИЕдиницыИзмерения, НаименованиеЕдиницыИзмерения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕдиницыИзмерения.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.Код = &Код
	|	И НЕ ЕдиницыИзмерения.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Код", КодОКЕИЕдиницыИзмерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		НаименованиеЕдиницыИзмерения = "";
		Возврат;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		НаименованиеЕдиницыИзмерения = Выборка.Наименование;
		
	КонецЕсли;
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.БазоваяЕдиницаИзмеренияНоменклатуры
Процедура БазоваяЕдиницаИзмеренияНоменклатуры(Знач Номенклатура, ЕдиницаИзмерения) Экспорт
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "БазоваяЕдиницаИзмерения");
	Иначе
		ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.СформироватьТаблицуСопоставленияНоменклатурыКонтрагентовВДокументах
Процедура СформироватьТаблицуСопоставленияНоменклатурыКонтрагентовВДокументах(
	Знач НаборДокументов, ТаблицаСопоставления, ОткрыватьФормуДляИзмененияСопоставления) Экспорт
	
	ОткрыватьФормуДляИзмененияСопоставления = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборДокументов", НаборДокументов);
	Запрос.УстановитьПараметр("ПредставлениеНоменклатурыКлиента", НСтр("ru = 'Номенклатура клиента'"));
	Запрос.УстановитьПараметр("ПредставлениеНоменклатурыПоставщика", НСтр("ru = 'Номенклатура поставщика'"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка КАК СсылкаНаДокумент,
	|	ЗаказПокупателяТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяТовары.Характеристика КАК Характеристика,
	|	ЗаказПокупателяТовары.ЕдиницаИзмерения КАК Упаковка,
	|	ЗаказПокупателяТовары.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	|	ЗаказПокупателяТовары.Ссылка.Контрагент КАК Владелец,
	|	""Товары"" КАК ИмяТабличнойЧасти,
	|	""НоменклатурыКонтрагента"" КАК ИмяКолонкиНоменклатурыКонтрагента,
	|	&ПредставлениеНоменклатурыКлиента КАК ПредставлениеНоменклатурыКонтрагента,
	|	ЗаказПокупателяТовары.Номенклатура КАК НоменклатураПоиск,
	|	ЗаказПокупателяТовары.Характеристика КАК ХарактеристикаПоиск,
	|	ЗаказПокупателяТовары.ЕдиницаИзмерения КАК УпаковкаПоиск
	|ПОМЕСТИТЬ ВременнаяТаблица_Товары
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка В (&НаборДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Ссылка,
	|	ЗаказПоставщикуТовары.НомерСтроки,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Характеристика,
	|	ЗаказПоставщикуТовары.ЕдиницаИзмерения,
	|	ЗаказПоставщикуТовары.НоменклатураКонтрагента,
	|	ЗаказПоставщикуТовары.Ссылка.Контрагент,
	|	""Товары"",
	|	""НоменклатурыКонтрагента"",
	|	&ПредставлениеНоменклатурыКлиента,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.Характеристика,
	|	ЗаказПокупателяТовары.ЕдиницаИзмерения
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка В (&НаборДокументов)";
			
	ТаблицаСопоставления = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ТекстЗапросаПоискаНеСопоставленнойНоменклатурыКонтрагентовПоНоменклатуреИБ
Процедура ТекстЗапросаПоискаНеСопоставленнойНоменклатурыКонтрагентовПоНоменклатуреИБ(ТекстЗапроса, ТаблицаТоваровПоУмолчанию) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Товары.НоменклатураКонтрагента КАК НоменклатураКонтрагента,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	Товары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И Товары.НоменклатураПартнера <> ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)";

КонецПроцедуры

// См. СопоставлениеНоменклатурыКонтрагентовПереопределяемый.ЗаполнитьВладельцаНоменклатурыКонтрагентаИзДереваРазбора
Процедура ЗаполнитьВладельцаНоменклатурыКонтрагентаИзДереваРазбора(Знач ДеревоРазбора, Владелец) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область НоменклатураКонтрагентов

// Проверяет корректность сопоставление с номенклатурой поставщика.
//
// Параметры:
//  ТаблицаТоваров                   - ТаблицаЗначений - Сведения о товарах для проверки сопоставления.
//  ДеревоДокумента                  - ДеревоЗначений - Данные файла электронного документа.
//  НеУдалосьСопоставитьНоменклатуру - Булево - Признак сопоставления номенклатуры. Если истина, то номенклатура не сопоставлена.
//
Процедура ПроверитьСопоставлениеСНоменклатуройПоставщика(ТаблицаТоваров, ДеревоДокумента, НеУдалосьСопоставитьНоменклатуру)  Экспорт 
	
	ПроверенныеСтроки = Новый Массив;
	Для Каждого ТекСтрока Из ТаблицаТоваров Цикл
		
		Если Не ПроверенныеСтроки.Найти(ТекСтрока.Номенклатура) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Если в таблице товаров несколько строк с одинаковым НомерСтроки,
		// то сопоставлено более одной номенклатуры поставщика.
		ОшибкаСопоставления = ТаблицаТоваров.НайтиСтроки(Новый Структура("Номенклатура, НомерСтроки",
			ТекСтрока.Номенклатура, ТекСтрока.НомерСтроки)).Количество() > 1;
			
		Если Не ЗначениеЗаполнено(ТекСтрока.ИдентификаторКонтрагента) Или ОшибкаСопоставления Тогда
			
			
			Если Не ЗначениеЗаполнено(ТекСтрока.ИдентификаторКонтрагента) Тогда
				ШаблонСообщения = НСтр("ru = 'Номенклатура ""%1"" не сопоставлена с номенклатурой контрагента.
				|Выполните сопоставление и повторите попытку.'");
				
			Иначе
				ШаблонСообщения = НСтр("ru = 'Установлено неоднозначное сопоставление номенклатуры ""%1"" с номенклатурой контрагента.
				|Проверьте, что выбранной номенклатуре соответствует только одна номенклатура контрагента.'");
				ПроверенныеСтроки.Добавить(ТекСтрока.Номенклатура);
				
			КонецЕсли;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
				Строка(ТекСтрока.Номенклатура) + ?(ЗначениеЗаполнено(ТекСтрока.Характеристика), " (" + ТекСтрока.Характеристика + ")", ""));
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, НеУдалосьСопоставитьНоменклатуру);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет однозначность сопоставления с номенклатурой контрагента.
//
// Параметры:
//  Товары - ТаблицаЗначений - Сведения о товарах для проверки сопоставления.
//  ЕстьОшибки - Булево - Признак ошибки сопоставления.
//
Процедура ПроверитьСопоставлениеСНоменклатуройКонтрагента(Товары, ЕстьОшибки)  Экспорт 
	
	ПроверенныеСтроки = Новый Массив;
	Для Каждого СтрокаТовара Из Товары Цикл
		
		Если Не ПроверенныеСтроки.Найти(СтрокаТовара.Номенклатура) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Если в таблице товаров несколько строк с одинаковым НомерСтроки,
		// то сопоставлено более одной номенклатуры контрагента.
		ОтборСтрок = Новый Структура("Номенклатура, НомерСтроки", СтрокаТовара.Номенклатура, СтрокаТовара.НомерСтроки);
		СтрокиСОднимНомером = Товары.НайтиСтроки(ОтборСтрок);
		ЕстьДублиСтрок = (СтрокиСОднимНомером.Количество() > 1);
			
		Если ЕстьДублиСтрок Тогда
			
			ЕстьОшибки = Истина;
			
			ШаблонСообщения = НСтр("ru = 'Установлено неоднозначное сопоставление номенклатуры ""%1"" с номенклатурой контрагента.
				|Проверьте, что выбранной номенклатуре соответствует только одна номенклатура контрагента.'");
				ПроверенныеСтроки.Добавить(СтрокаТовара.Номенклатура);
				
			ТекстСообщения = СтрШаблон(ШаблонСообщения,
				Строка(СтрокаТовара.Номенклатура)
				+ ?(ЗначениеЗаполнено(СтрокаТовара.Характеристика), " (" + СтрокаТовара.Характеристика + ")", ""));
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеЭлектронныхДокументов

// Подготавливает данные для обработки ошибок заполнения обязательных полей.
//
// Параметры:
//  ТаблицаТоваров   - ТаблицаЗначений - сведения о товарах для формирования электронного документа.
//  СсылкаНаДокумент - ДокументСсылка - Ссылка на основание электронного документа.
//
Процедура ЗаполнитьПараметрыОбработкиОшибокВТаблицеТоваровCML(ТаблицаТоваров, СсылкаНаДокумент = Неопределено) Экспорт

	// Обработка ошибки через механизм сообщений пользователю.
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
		"Артикул", "Номенклатура", "Объект.Артикул");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
		"Наименование", "Номенклатура", "Объект.НаименованиеПолное");
	
	Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		Если ТаблицаТоваров.Колонки.Найти("Количество") <> Неопределено Тогда
			ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
				"Количество", СсылкаНаДокумент, "Объект.Товары.Количество",, "НомерСтроки");
		КонецЕсли;
		
		Если ТаблицаТоваров.Колонки.Найти("Цена") <> Неопределено Тогда
			ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
				"Цена", СсылкаНаДокумент, "Объект.Товары.Количество",, "НомерСтроки");
		КонецЕсли;
		
		Если ТаблицаТоваров.Колонки.Найти("Сумма") <> Неопределено Тогда
			ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
				"Сумма", СсылкаНаДокумент, "Объект.Товары.Сумма",, "НомерСтроки");
		КонецЕсли;
		
		Если ТаблицаТоваров.Колонки.Найти("СуммаСкидки") <> Неопределено Тогда
			ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
				"СуммаСкидки", СсылкаНаДокумент, "Объект.Товары.Сумма",, "НомерСтроки");
		КонецЕсли;
		
		Если ТаблицаТоваров.Колонки.Найти("СуммаСкидки") <> Неопределено Тогда
			ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
				"СуммаСкидки", СсылкаНаДокумент, "Объект.Товары.Сумма",, "НомерСтроки");
		КонецЕсли;
	КонецЕсли;
	
	Если ТаблицаТоваров.Колонки.Найти("ЕдиницаИзмеренияКодПоОКЕИ") <> Неопределено Тогда
		ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
			"ЕдиницаИзмеренияКодПоОКЕИ", "ЕдиницаИзмерения", "Объект.Код");
		
		// Если единица пустая, надо ссылаться на незаполненность самой единицы, а не ее полей.
		СтрокиСПустойЕдиницей = ТаблицаТоваров.НайтиСтроки(Новый Структура("ЕдиницаИзмерения", Справочники.ЕдиницыИзмерения.ПустаяСсылка()));
		Если СтрокиСПустойЕдиницей.Количество() Тогда
			Если СсылкаНаДокумент <> Неопределено Тогда
				// Для документов берем единицу прямо из документа.
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокиСПустойЕдиницей,
					"ЕдиницаИзмеренияКодПоОКЕИ", СсылкаНаДокумент, "Объект.Товары.ЕдиницаИзмерения",, "НомерСтроки");
			Иначе
				// Иначе ссылаемся на незаполненность единицы в самой номенклатуре.
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокиСПустойЕдиницей,
					"ЕдиницаИзмеренияКодПоОКЕИ", "Номенклатура", "Объект.ЕдиницаИзмерения");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТаблицаТоваров.Колонки.Найти("БазоваяЕдиницаСсылка") <> Неопределено Тогда
		ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
		"БазоваяЕдиницаКод", "БазоваяЕдиницаСсылка", "Объект.Код");
		ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
		"БазоваяЕдиницаМеждународноеСокращение", "БазоваяЕдиницаСсылка", "Объект.МеждународноеСокращение");
		ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
		"БазоваяЕдиницаНаименование", "БазоваяЕдиницаСсылка", "Объект.Наименование");
		ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
		"БазоваяЕдиницаНаименованиеПолное", "БазоваяЕдиницаСсылка", "Объект.НаименованиеПолное");
		
		// Если единица пустая, надо ссылаться на незаполненность самой единицы, а не ее полей.
		СтрокиСПустойЕдиницей = ТаблицаТоваров.НайтиСтроки(Новый Структура("БазоваяЕдиницаСсылка", Справочники.ЕдиницыИзмерения.ПустаяСсылка()));
		Если СтрокиСПустойЕдиницей.Количество() Тогда
			Если СсылкаНаДокумент <> Неопределено Тогда
				// Для документов берем единицу прямо из документа.
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокиСПустойЕдиницей,
				"БазоваяЕдиницаКод", СсылкаНаДокумент, "Объект.Товары.ЕдиницаИзмерения",, "НомерСтроки");
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокиСПустойЕдиницей,
				"БазоваяЕдиницаМеждународноеСокращение", СсылкаНаДокумент, "Объект.Товары.ЕдиницаИзмерения",, "НомерСтроки");
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокиСПустойЕдиницей,
				"БазоваяЕдиницаНаименование", СсылкаНаДокумент, "Объект.Товары.ЕдиницаИзмерения",, "НомерСтроки");
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокиСПустойЕдиницей,
				"БазоваяЕдиницаНаименованиеПолное", СсылкаНаДокумент, "Объект.Товары.ЕдиницаИзмерения",, "НомерСтроки");
			Иначе
				// Это каталог товаров - для него единица берется из номенклатуры.
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокиСПустойЕдиницей,
				"БазоваяЕдиницаКод", "Номенклатура", "Объект.ЕдиницаИзмерения");
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокиСПустойЕдиницей,
				"БазоваяЕдиницаМеждународноеСокращение", "Номенклатура", "Объект.ЕдиницаИзмерения");
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокиСПустойЕдиницей,
				"БазоваяЕдиницаНаименование", "Номенклатура", "Объект.ЕдиницаИзмерения");
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокиСПустойЕдиницей,
				"БазоваяЕдиницаНаименованиеПолное", "Номенклатура", "Объект.ЕдиницаИзмерения");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТаблицаТоваров.Колонки.Найти("ВалютаЦены") <> Неопределено Тогда
		ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
			"ВалютаЦены", "Валюта", "Объект.Код");
		
		// Если валюта пустая, надо ссылаться на незаполненность самой валюты, а не ее полей.
		СтрокиСПустойВалютой = ТаблицаТоваров.НайтиСтроки(Новый Структура("Валюта", Справочники.Валюты.ПустаяСсылка()));
		Если СтрокиСПустойВалютой.Количество() И СсылкаНаДокумент <> Неопределено Тогда
			Если СсылкаНаДокумент <> Неопределено Тогда
				// Для документов берем валюту прямо из документа.
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокиСПустойВалютой,
					"ВалютаЦены", СсылкаНаДокумент, "Объект.Валюта");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Заполняет таблицу документов сделки
//
// Параметры:
//  ДеревоДокумента - ДеревоЗначений - Данные для формирования электронного документа.
//  ДанныеШапки     - Структура      - Реквизиты шапки документа.
//
Процедура ЗаполнитьДокументыСделки(ДеревоДокумента, ДанныеШапки) Экспорт
	
	ДоговорНомер = ДанныеШапки.ДоговорНомер;
	ДоговорДата = ДанныеШапки.ДоговорДата;
	
	Если Не ЗначениеЗаполнено(ДоговорНомер) 
		ИЛИ Не ЗначениеЗаполнено(ДоговорДата) Тогда
		Возврат;
	КонецЕсли;
	
	ДоговорНаименование = ДанныеШапки.ДоговорНаименование;
	
	ДокументыСделки = Новый ТаблицаЗначений;
	ДокументыСделки.Колонки.Добавить("ДоговорКонтрагента");
	ДокументыСделки.Колонки.Добавить("Наименование");
	ДокументыСделки.Колонки.Добавить("Номер");
	ДокументыСделки.Колонки.Добавить("Дата");
	ДокументыСделки.Колонки.Добавить("Идентификатор");
	
	НоваяСтрока = ДокументыСделки.Добавить();
	НоваяСтрока.ДоговорКонтрагента = ДанныеШапки.ДоговорКонтрагента;
	НоваяСтрока.Номер = ДоговорНомер;
	НоваяСтрока.Дата = ДоговорДата;
	НоваяСтрока.Наименование = ДоговорНаименование;
	НоваяСтрока.Идентификатор = "договор"; // "договор" - идентификатор договора.
	
	// Дополним таблицу оснований параметрами обработки ошибок.
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ДокументыСделки,
		"Наименование", "ДоговорКонтрагента", "Объект.Наименование");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ДокументыСделки,
		"Номер", "ДоговорКонтрагента", "Объект.НомерДоговора");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ДокументыСделки,
		"Дата", "ДоговорКонтрагента", "Объект.ДатаДоговора");
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДокумента, ДокументыСделки, "ДокументыСделки");
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиФормированияДокумента

// См. ОбменСКонтрагентамиПереопределяемый.ПриОпределенииВариантовЗаполненияПолейЭлектронныхДокументов.
Процедура ПриОпределенииВариантовЗаполненияПолейЭлектронныхДокументов(ВариантыЗаполненияПолей) Экспорт
	
	ВариантКодУПД = ВариантыЗаполненияПолей.УПД_ТоварКод.НайтиПоЗначению("Код");
	ВариантКодУПД.Представление = "Артикул";
	ВариантКодПередачаТоваров = ВариантыЗаполненияПолей.ПередачаТоваров_ТоварКод.НайтиПоЗначению("Код");
	ВариантКодПередачаТоваров.Представление = "Артикул";
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПолучитьЗапросКонструктораДополнительныхПолейШапки.
Процедура ПолучитьЗапросКонструктораДополнительныхПолейШапки(Параметры, ТекстЗапроса) Экспорт
	
	ТипыДокументов = ОбменСКонтрагентами.ТипыДокументов();
	
	Если Параметры.ТипДокумента = ТипыДокументов.УПД
		ИЛИ Параметры.ТипДокумента = ТипыДокументов.УКД Тогда
		
		ТекстЗапроса = ЗапросКонструктораДополнительныхПолейШапкиУПД();
	
	ИначеЕсли Параметры.ТипДокумента = ТипыДокументов.СчетФактура
		ИЛИ Параметры.ТипДокумента = ТипыДокументов.КорректировочныйСчетФактура Тогда
		
		ТекстЗапроса = ЗапросКонструктораДополнительныхПолейШапкиСчетаФактуры();
		
	ИначеЕсли Параметры.ТипДокумента = ТипыДокументов.ТоварнаяНакладная
		ИЛИ Параметры.ТипДокумента = ТипыДокументов.АктНаПередачуПрав Тогда
		
		ТекстЗапроса = ЗапросКонструктораДополнительныхПолейШапкиРеализации();
		
	ИначеЕсли Параметры.ТипДокумента = ТипыДокументов.АктВыполненныхРабот Тогда
		
		ТекстЗапроса = ЗапросКонструктораДополнительныхПолейШапкиАкта();
		
	ИначеЕсли Параметры.ТипДокумента = ТипыДокументов.СоглашениеОбИзмененииСтоимости Тогда
		
		ТекстЗапроса = ЗапросКонструктораДополнительныхПолейШапкиКорректировкиРеализации();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСКонтрагентами

// См. ОбменСКонтрагентамиПереопределяемый.СоздатьКонтрагентаПоРеквизитам.
Процедура СоздатьКонтрагентаПоРеквизитам(РеквизитыКонтрагента, Контрагент, Отказ) Экспорт
	
	//ТорговыйКомплексБизнесСетьЭДО.СоздатьКонтрагентаПоРеквизитам(РеквизитыКонтрагента, Контрагент, Отказ);
	// Проверка прав для создания контрагента.
	Если Не ПравоДоступа("Добавление", Метаданные.Справочники.Контрагенты) Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Недостаточно прав для создания контрагента.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Создание контрагента'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Контрагенты, , ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	РеквизитыКонтрагента.Вставить("НаименованиеПолное", РеквизитыКонтрагента.Наименование);
	
	Попытка
		
		Объект = Справочники.Контрагенты.СоздатьЭлемент();
		Объект.Заполнить(РеквизитыКонтрагента);
		ДлинаИННЮридическогоЛицаРФ = 10;
		ДлинаИННФизическогоЛицаРФ = 12;
		
		Если НЕ ЗначениеЗаполнено(СтрЗаменить(РеквизитыКонтрагента.ИНН, "0", "")) Тогда
			Объект.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицоНеРезидент;
			Объект.GLN = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РеквизитыКонтрагента, "GLN", "");
			Объект.ИНН = "";
			Объект.КПП = "";
		ИначеЕсли СтрДлина(РеквизитыКонтрагента.ИНН) = ДлинаИННЮридическогоЛицаРФ Тогда
			Объект.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
		ИначеЕсли СтрДлина(РеквизитыКонтрагента.ИНН) = ДлинаИННФизическогоЛицаРФ Тогда
			Объект.ФормаСобственности = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель;
		КонецЕсли;
		
		СтруктураНаименования = ТорговыйКомплексЭДОКлиентСервер.РазложитьСтрокуНаименованияОрганизации(
			РеквизитыКонтрагента.НаименованиеПолное, Объект.ФормаСобственности);
		Объект.Наименование = ТорговыйКомплексЭДОКлиентСервер.СформироватьНаименование(СтруктураНаименования);
		Объект.Записать();
		Контрагент = Объект.Ссылка;
		
	Исключение
		
		ТекстСообщения = НСтр("ru = 'Ошибка при записи нового элемента справочника Контрагенты.'")
			+ Символы.ПС + НСтр("ru ='Подробности см. в журнале регистрации.'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Создание контрагента'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Контрагенты, ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСОрганизациями

// Создает организацию по реквизитам
// 
// Параметры:
// РеквизитыОрганизации - см. ОбменСКонтрагентамиКлиентСервер.НовыйДанныеОрганизации
// Организация - СправочникСсылка.Организации
Процедура СоздатьОрганизацию(Знач РеквизитыОрганизации, Организация) Экспорт
	
	ОбъектОрганизация = Справочники.Организации.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(ОбъектОрганизация, РеквизитыОрганизации);
	
	ОбъектОрганизация.ФормаСобственности = ?(СтрДлина(РеквизитыОрганизации.ИНН) = 10,
									Перечисления.ФормыСобственности.ЮридическоеЛицо,
									Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель);
	
	Если ЗначениеЗаполнено(РеквизитыОрганизации.ЮридическийАдрес) Тогда
		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(
			ОбъектОрганизация,
			РеквизитыОрганизации.ЮридическийАдрес,
			Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации,
			ТекущаяДатаСеанса(),
			Истина);
	КонецЕсли;
	
	НаименованиеНеСформировано = РеквизитыОрганизации.Наименование = РеквизитыОрганизации.НаименованиеСокращенное
		И РеквизитыОрганизации.Наименование = РеквизитыОрганизации.НаименованиеПолное;
	Если НаименованиеНеСформировано Тогда
		СтруктураНаименования = ТорговыйКомплексЭДОКлиентСервер.РазложитьСтрокуНаименованияОрганизации(
			ОбъектОрганизация.НаименованиеСокращенное, ОбъектОрганизация.ФормаСобственности);
		
		ОбъектОрганизация.НаименованиеПолное = 
			ТорговыйКомплексЭДОКлиентСервер.СформироватьНаименованиеПолное(ОбъектОрганизация.ФормаСобственности, СтруктураНаименования);
		ОбъектОрганизация.Наименование = ТорговыйКомплексЭДОКлиентСервер.СформироватьНаименование(СтруктураНаименования);
	КонецЕсли;
	
	Попытка
		ОбъектОрганизация.Записать();
		Организация = ОбъектОрганизация.Ссылка;
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Создание новой организации.'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиВОблакеПереопределяемый.ПриСозданииОрганизации
//
// Параметры:
//  Организация - См. ОбменСКонтрагентамиВОблакеПереопределяемый.ПриСозданииОрганизации.Организация
//  Данные - См. ОбменСКонтрагентамиВОблакеПереопределяемый.ПриСозданииОрганизации.Данные
Процедура ПриСозданииОрганизации(Организация, Данные) Экспорт
	
	ОбъектОрганизация = Справочники.Организации.СоздатьЭлемент();
	ОбъектОрганизация.НаименованиеПолное = Данные.НаименованиеПолное;
	ОбъектОрганизация.ИНН = Данные.ИНН;
	ОбъектОрганизация.КПП = Данные.КПП;
	ОбъектОрганизация.ФормаСобственности = ?(СтрДлина(Данные.ИНН) = 10,
									Перечисления.ФормыСобственности.ЮридическоеЛицо,
									Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель);
	ОбъектОрганизация.СвидетельствоСерияНомер = Данные.СвидетельствоСерияНомер;
	ОбъектОрганизация.СвидетельствоДатаВыдачи = Данные.СвидетельствоДатаВыдачи;
	ОбъектОрганизация.ОГРН = Данные.ОГРН;
	
	СтруктураНаименования = ТорговыйКомплексЭДОКлиентСервер.РазложитьСтрокуНаименованияОрганизации(
		Данные.НаименованиеСокращенное, ОбъектОрганизация.ФормаСобственности);
	ОбъектОрганизация.Наименование = ТорговыйКомплексЭДОКлиентСервер.СформироватьНаименование(СтруктураНаименования);
	
	УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектОрганизация, Данные.ЭлектроннаяПочта,
		ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailОрганизации"), ТекущаяДатаСеанса(), Истина);
	
	ЮридическийАдрес = Данные.ЮридическийАдрес;
	Если ЗначениеЗаполнено(Данные.ЮридическийАдресЗначение) Тогда
		ЮридическийАдрес = Данные.ЮридическийАдресЗначение;
	КонецЕсли;
	УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектОрганизация, ЮридическийАдрес,
		ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации"), ТекущаяДатаСеанса(), Истина);
	
	ОбъектОрганизация.Записать();
	
	Организация = ОбъектОрганизация.Ссылка;
	
КонецПроцедуры

#КонецОбласти

// См. ОбменСКонтрагентамиПереопределяемый.ПриПроверкеВозможностиСозданияУчетногоДокумента.
Процедура ПриПроверкеВозможностиСозданияУчетногоДокумента(Знач Параметры, Отказ, Описание) Экспорт
	
	Если Параметры.ЭтоСводныйУПД Тогда
		
		Отказ = Истина;
		Описание = НСтр("ru = 'Отражение в учете сводных счетов-фактур не поддерживается.'");
		
	КонецЕсли;
	
КонецПроцедуры

#Область Диагностика

// См. ОбменСКонтрагентамиПереопределяемый.ПриОпределенииДокументовСПоддержкойДиагностикиОшибок.
Процедура ПриОпределенииДокументовСПоддержкойДиагностикиОшибок(СписокДокументов) Экспорт
	
	СписокДокументов.Добавить(Метаданные.Документы.АктОРасхожденияхПоПоставке);
	//СписокДокументов.Добавить(Метаданные.Документы.АктВыполненныхРабот);
	//СписокДокументов.Добавить(Метаданные.Документы.ВозвратТоваровМеждуОрганизациями);
	СписокДокументов.Добавить(Метаданные.Документы.ВозвратОтПокупателя);
	СписокДокументов.Добавить(Метаданные.Документы.ЗаказПокупателя);
	СписокДокументов.Добавить(Метаданные.Документы.ЗаказПоставщику);
	//СписокДокументов.Добавить(Метаданные.Документы.ЗапросКоммерческогоПредложенияОтКлиента);
	//СписокДокументов.Добавить(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств);
	//СписокДокументов.Добавить(Метаданные.Документы.КоммерческоеПредложениеКлиенту);
	СписокДокументов.Добавить(Метаданные.Документы.КорректировкаПоступления);
	СписокДокументов.Добавить(Метаданные.Документы.КорректировкаРеализации);
	СписокДокументов.Добавить(Метаданные.Документы.ОтчетКомиссионера);
	СписокДокументов.Добавить(Метаданные.Документы.ОтчетКомитенту);
	//СписокДокументов.Добавить(Метаданные.Документы.ПередачаТоваровМеждуОрганизациями);
	СписокДокументов.Добавить(Метаданные.Документы.ПоступлениеТоваров);
	//СписокДокументов.Добавить(Метаданные.Документы.ПриобретениеУслугПрочихАктивов);
	СписокДокументов.Добавить(Метаданные.Документы.РеализацияТоваров);
	//СписокДокументов.Добавить(Метаданные.Документы.РеализацияУслугПрочихАктивов);
	//СписокДокументов.Добавить(Метаданные.Документы.РегистрацияЦенНоменклатурыПоставщика);
	СписокДокументов.Добавить(Метаданные.Документы.СчетНаОплату);
	СписокДокументов.Добавить(Метаданные.Документы.СчетФактураВыданный);
	СписокДокументов.Добавить(Метаданные.Документы.СчетФактураПолученный);
	
КонецПроцедуры

#КонецОбласти

// См. ОбменСКонтрагентамиПереопределяемый.ПриОпределенииПечатныхФормЗапрещенныхДляФормированияДокумента.
Процедура ПриОпределенииПечатныхФормЗапрещенныхДляФормированияДокумента(СписокИдентификаторов) Экспорт
	
	Если Не ТипЗнч(СписокИдентификаторов) = Тип("Массив") Тогда
		СписокИдентификаторов = Новый Массив;
	КонецЕсли;
	
	СписокИдентификаторов.Добавить("Ценники");
	СписокИдентификаторов.Добавить("Этикетки");
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПриПроверкеИспользованияУведомлений.
Процедура ПриПроверкеИспользованияУведомлений(Используется) Экспорт
	
	Используется = Истина
	
КонецПроцедуры

#Область ВнутренниеДокументы

// См. ОбменСКонтрагентамиПереопределяемый.ВключатьФункциональнуюОпциюИспользоватьВнутренниеДокументыЭДО.
Процедура ВключатьФункциональнуюОпциюИспользоватьВнутренниеДокументыЭДО(Включать) Экспорт
	
	Включать = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ДокументПредприятия

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПоДокументуПредприятия.
Процедура ЗаполнитьДанныеПоДокументуПредприятия(СсылкаНаОбъект, КонструкторЭД, Отказ) Экспорт

	//Данные = Справочники.ДоговорыВзаиморасчетов.ПолучитьДанныеДляЭД(СсылкаНаОбъект);
	//Данные.Следующий();
	//
	//КонструкторЭД.ОбработчикОшибок.ПараметрыСвязиПоУмолчанию(СсылкаНаОбъект);
	//
	//ИнформацияДокумента = КонструкторЭД.ИнформацияДокумента(); // см. ОбработкаОбъект.ФорматДокументПредприятия
	//ИнформацияДокумента.ВнешнийИдентификатор = XMLСтрока(СсылкаНаОбъект);
	//ИнформацияДокумента.Дата                 = Данные.ДатаДоговора;
	//ИнформацияДокумента.Номер                = Данные.НомерДоговора;
	//
	//Если Данные.СуммаВключаетНДС Тогда
	//	ИнформацияДокумента.Сумма    = Данные.Сумма;
	//	ИнформацияДокумента.СуммаНДС = Данные.СуммаНДС;
	//Иначе
	//	ИнформацияДокумента.Сумма    = Данные.Сумма + Данные.СуммаНДС;
	//	ИнформацияДокумента.СуммаНДС = Данные.СуммаНДС;
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(Данные.Валюта_Код) Тогда
	//	ИнформацияДокумента.Валюта = КонструкторЭД.НоваяВалюта();
	//	ИнформацияДокумента.Валюта.Код = Данные.Валюта_Код;
	//	ИнформацияДокумента.Валюта.Наименование = Данные.Валюта_Наименование;
	//КонецЕсли;
	//
	//ИнформацияДокумента.Наименование = Данные.Наименование;
	//КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(ИнформацияДокумента, "Наименование", "Объект.Наименование", , СсылкаНаОбъект);
	//
	//ИнформацияДокумента.ДатаНачалаДействия    = Данные.ДатаНачалаДействия;
	//ИнформацияДокумента.ДатаОкончанияДействия = Данные.ДатаОкончанияДействия;
	//ИнформацияДокумента.ЯвляетсяБессрочным    = Не ЗначениеЗаполнено(Данные.ДатаОкончанияДействия) И Данные.НаличиеПролонгации = Ложь;
	//ИнформацияДокумента.ФормаДокумента        = КонструкторЭД.ВидыФормДокумента().Электронная;
	//
	//ИнформацияДокумента.СвойстваВидаДокумента = КонструкторЭД.НовыеСвойстваВидаДокумента();
	//ИнформацияДокумента.СвойстваВидаДокумента.ЯвляетсяДоговором = Истина;
	//ИнформацияДокумента.СвойстваВидаДокумента.Наименование      =
	//	ИнтеграцияЭДОПовтИсп.ВидДоговоровКонтрагентовПеречисление(Данные.ВидДоговора);
	//
	//ИнформацияДокумента.Организация = КонструкторЭД.НовыеСведенияОСторонахДокумента();
	//ЗаполнитьСведенияСтороныДокументаДляДокументаПредприятия(
	//	ИнформацияДокумента.Организация, Данные, КонструкторЭД, Данные.Организация, Данные.Организация_ЮрФизЛицо);
	//
	//ИнформацияДокумента.Организация.Адрес = КонструкторЭД.ЗаполнитьАдресАвтоматически(
	//	Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, Данные.Организация, Данные.ДатаДоговора, КонструкторЭД);
	//	
	//Если ЗначениеЗаполнено(Данные.Организация_БанковскийСчет_НомерСчета) Тогда
	//	ИнформацияДокумента.Организация.БанковскиеРеквизиты = КонструкторЭД.НовыеБанковскиеРеквизиты();
	//	ИнформацияДокумента.Организация.БанковскиеРеквизиты.ИНН                   = Данные.Организация_БанковскийСчет_ИНН;
	//	ИнформацияДокумента.Организация.БанковскиеРеквизиты.НомерСчета            = Данные.Организация_БанковскийСчет_НомерСчета;
	//	ИнформацияДокумента.Организация.БанковскиеРеквизиты.Наименование          = Данные.Организация_БанковскийСчет_НаименованиеБанка;
	//	ИнформацияДокумента.Организация.БанковскиеРеквизиты.БИК                   = Данные.Организация_БанковскийСчет_БИК;
	//	ИнформацияДокумента.Организация.БанковскиеРеквизиты.КорреспондентскийСчет = Данные.Организация_БанковскийСчет_КоррСчет;
	//	
	//	КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(ИнформацияДокумента.Организация.БанковскиеРеквизиты, "НомерСчета",
	//	"Объект.ОсновнойБанковскийСчет.НомерСчета", , Данные.Организация);
	//	КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(ИнформацияДокумента.Организация.БанковскиеРеквизиты, "БИК",
	//	"Объект.ОсновнойБанковскийСчет.Банк.Код", , Данные.Организация);
	//	КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(ИнформацияДокумента.Организация.БанковскиеРеквизиты,
	//	"КорреспондентскийСчет", "Объект.ОсновнойБанковскийСчет.Банк.КоррСчет", , Данные.Организация);
	//КонецЕсли;
	//
	//Контрагент = КонструкторЭД.НовыеСведенияОСторонахДокумента();
	//ЗаполнитьСведенияСтороныДокументаДляДокументаПредприятия(
	//	Контрагент, Данные, КонструкторЭД, Данные.Контрагент, Данные.Контрагент_ЮрФизЛицо);
	//	
	//Если ЗначениеЗаполнено(Данные.Контрагент_БанковскийСчет_НомерСчета) Тогда
	//	Контрагент.БанковскиеРеквизиты = КонструкторЭД.НовыеБанковскиеРеквизиты();
	//	Контрагент.БанковскиеРеквизиты.ИНН                   = Данные.Контрагент_БанковскийСчет_ИНН;
	//	Контрагент.БанковскиеРеквизиты.НомерСчета            = Данные.Контрагент_БанковскийСчет_НомерСчета;
	//	Контрагент.БанковскиеРеквизиты.Наименование          = Данные.Контрагент_БанковскийСчет_НаименованиеБанка;
	//	Контрагент.БанковскиеРеквизиты.БИК                   = Данные.Контрагент_БанковскийСчет_БИК;
	//	Контрагент.БанковскиеРеквизиты.КорреспондентскийСчет = Данные.Контрагент_БанковскийСчет_КоррСчет;
	//	
	//	КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(Контрагент.БанковскиеРеквизиты, "НомерСчета",
	//		"Объект.ОсновнойБанковскийСчет.НомерСчета", , Данные.Контрагент);
	//	КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(Контрагент.БанковскиеРеквизиты, "БИК",
	//		"Объект.ОсновнойБанковскийСчет.Банк.Код", , Данные.Контрагент);
	//	КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(Контрагент.БанковскиеРеквизиты,
	//		"КорреспондентскийСчет", "Объект.ОсновнойБанковскийСчет.Банк.КоррСчет", , Данные.Контрагент);
	//КонецЕсли;
	//
	//Контрагент.Адрес = КонструкторЭД.ЗаполнитьАдресАвтоматически(
	//	Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента, Данные.Контрагент, Данные.ДатаДоговора, КонструкторЭД);

	//ИнформацияДокумента.Контрагент.Добавить(Контрагент);
	//КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(ИнформацияДокумента.Контрагент[0], "Контрагент", "Объект.Владелец");
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПриОтраженииВУчетеДокументаПредприятия.
Процедура ПриОтраженииВУчетеДокументаПредприятия(РезультатОтраженияВУчете, Знач ДанныеЭлектронногоДокумента,
	Знач ПараметрыДляОтраженияВУчете) Экспорт
	
	ИнформацияДокумента = ДанныеЭлектронногоДокумента.ИнформацияДокумента[0];
	
	ОбъектУчета = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
	ОбъектУчета.ДатаНачала    = ИнформацияДокумента.Дата;
	ОбъектУчета.НомерДоговора = ИнформацияДокумента.Номер;
	ОбъектУчета.Наименование  = ИнформацияДокумента.Наименование;
	
	ОбъектУчета.ДатаНачала = ИнформацияДокумента.ДатаНачалаДействия;
	ОбъектУчета.ДатаКонца  = ИнформацияДокумента.ДатаОкончанияДействия;
	
	НаименованиеВидаДокумента = ИнформацияДокумента.СвойстваВидаДокумента.Наименование;
	ВидыДоговоров             = Новый Соответствие;
	ВидыДоговоров.Вставить("Покупка", Перечисления.ВидыДоговоров.Покупка);
	ВидыДоговоров.Вставить("Продажа", Перечисления.ВидыДоговоров.Продажа);
	ВидыДоговоров.Вставить("СКомиссионером", Перечисления.ВидыДоговоров.СКомиссионером);
	ВидыДоговоров.Вставить("СКомитентом", Перечисления.ВидыДоговоров.СКомитентом);
	
	Если ВидыДоговоров[НаименованиеВидаДокумента] = Неопределено Тогда
		ОбъектУчета.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
	Иначе
		ОбъектУчета.ВидДоговора = ВидыДоговоров[НаименованиеВидаДокумента];
	КонецЕсли;
	
	ДанныеОрганизации = ИнформацияДокумента.Контрагент[0].ИдентификационныеСведения;
	ДанныеКонтрагента = ИнформацияДокумента.Организация.ИдентификационныеСведения;
	
	ПараметрыПоискаОрганизации = ПараметрыПоискаПоДаннымДокументаПредприятия(ДанныеОрганизации);
	ПараметрыПоискаКонтрагента = ПараметрыПоискаПоДаннымДокументаПредприятия(ДанныеКонтрагента);
	
	ОбъектУчета.Организация = ОрганизацияПоРеквизитам(ПараметрыПоискаОрганизации);
	ОбъектУчета.Владелец = КонтрагентПоРеквизитам(ПараметрыПоискаКонтрагента);
	
	КПП = ПолучитьЗначениеПараметраСтруктуры(ПараметрыПоискаОрганизации, "КПП", "");
	
	ОбъектУчета.ПодразделениеКомпании = НайтиПодразделениеОрганизации(ОбъектУчета.Организация, КПП, ОбъектУчета.Владелец);
	
	Если ЗначениеЗаполнено(ИнформацияДокумента.Валюта) Тогда
		ОбъектУчета.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду(ИнформацияДокумента.Валюта.Код);
		Если Не ЗначениеЗаполнено(ОбъектУчета.ВалютаВзаиморасчетов) Тогда
			ОбъектУчета.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		КонецЕсли;
	КонецЕсли;
	
	ОбъектУчета.ОбменДанными.Загрузка = Истина;
	ОбъектУчета.Записать();
	
	РезультатОтраженияВУчете.ДокументыУчета = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектУчета.Ссылка);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПриОпределенииОбработчикаПриОтраженииЭлектронногоДокумента
Процедура ПриОпределенииОбработчикаПриОтраженииЭлектронногоДокумента(ОбработчикиОтражения) Экспорт
	
	ОбработчикиОтражения.ПриОтраженииВУчетеУниверсальногоКорректировочногоДокумента_2020 = Истина;
	ОбработчикиОтражения.ПриОтраженииВУчетеУниверсальногоКорректировочногоДокумента_2016 = Истина;
	ОбработчикиОтражения.ПриОтраженииВУчетеУниверсальногоПередаточногоДокумента_2019 = Истина;
	ОбработчикиОтражения.ПриОтраженииВУчетеУниверсальногоПередаточногоДокумента_2016 = Истина;
	ОбработчикиОтражения.ПриОтраженииВУчетеУниверсальногоПередаточногоДокумента_5_03 = Истина;
	ОбработчикиОтражения.ПриОтраженииВУчетеУниверсальногоПередаточногоДокумента_5_02 = Истина;
	ОбработчикиОтражения.ПриОтраженииВУчетеДокументаCML = Истина;
	ОбработчикиОтражения.ПриОтраженииВУчетеДокументаПредприятия = Истина;
	ОбработчикиОтражения.ПриОтраженииВУчетеДокументаПередачаРезультатовРабот = Истина;
	ОбработчикиОтражения.ПриОтраженииВУчетеДокументаПередачаТоваров = Истина;
	ОбработчикиОтражения.ПриОтраженииВУчетеДокументаСчетНаОплату101 = Истина;
	ОбработчикиОтражения.ПриОтраженииВУчетеДокументаСчетНаОплату_5_01 = Истина;
	ОбработчикиОтражения.ПриОтраженииВУчетеДоговорногоДокумента101 = Истина;
	ОбработчикиОтражения.ПриОтраженииВУчетеДокументаАктОРасхождениях_ФНС_2019 = Истина;
	ОбработчикиОтражения.ПриОтраженииВУчетеДокументаАктСверкиВзаиморасчетов = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеИОтражениеВУчетеДокументов

#Область УКД2020

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУКД2020_ИнформацияПродавца
Процедура ЗаполнитьДанныеУКД2020_ИнформацияПродавца(Знач Основание, Знач Настройки, Данные, Описание, Отказ) Экспорт
	
	ТипыДокументов = ОбменСКонтрагентами.ТипыДокументов();
	ТипДокумента = Настройки.ТипДокумента;
	
	Если ТипДокумента = ТипыДокументов.УКД Тогда
		
		Настройки.Вставить("Функция", "КСЧФДИС");
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СоглашениеОбИзмененииСтоимости Тогда
		
		Настройки.Вставить("Функция", "ДИС");
		
	Иначе
		
		Настройки.Вставить("Функция", "КСЧФ");
		
	КонецЕсли;
	
	ДокументСсылкаКСЧФ = Основание;
	
	Если ТипЗнч(Основание) <> Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		ДокументСсылкаКСЧФ = Документы.СчетФактураВыданный.СчетФактураДокумента(Основание);
		
		Если ТипДокумента = ТипыДокументов.УКД Тогда
			
			Описание.Основания.Добавить(ДокументСсылкаКСЧФ);
			
		КонецЕсли;
		
	Иначе
		
		Если ТипДокумента = ТипыДокументов.УКД Тогда
			
			Описание.Основания.Добавить(Основание.ДокументОснование);
			
		КонецЕсли;
		
		Основание = Основание.ДокументОснование

	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументСсылкаКСЧФ) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Для формирования УКД счет-фактура должна быть заполнена.'"));
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	ДанныеДляФормированияЭД = ДайДанныеСчетаФактурыДляУКД_2020(ДокументСсылкаКСЧФ);
	
	//ДокументыОснования = Новый Массив;
	//ДокументыОснования.Добавить(Основание);
	//ДанныеДляФормированияЭД.Вставить("ДокументыОснования", ДокументыОснования);
	
	ДеревоДанных = ЗаполнитьДанныеПервичногоДокументаУКД_2020(ДанныеДляФормированияЭД, Настройки, Данные);
	ДеревоДанных = ЗаполнитьДеревоДанныхУКД_2020(ДанныеДляФормированияЭД, Настройки, ДеревоДанных);
	ДеревоДанных = ЗаполнитьИнформациюОТоварахТоваровУКД_2020(ДанныеДляФормированияЭД, Настройки, ДеревоДанных);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУКД2020_ИнформацияПокупателя
Процедура ЗаполнитьДанныеУКД2020_ИнформацияПокупателя(Знач Основания, Данные, Отказ) Экспорт
	
	ДанныеВходящегоЭлектронногоДокумента = ИнформацияПокупателяУКД(Основания);
	СохранитьРеквизитВДереве(
		Данные,
		"СоставительДокументаНаименование",
		ДанныеВходящегоЭлектронногоДокумента.ОрганизацияНаименованиеПолное
	);
	СохранитьРеквизитВДереве(
		Данные,
		"ДатаСогласования",
		ДанныеВходящегоЭлектронногоДокумента.ДатаСогласования
	);
	СохранитьРеквизитВДереве(
		Данные,
		"СодержаниеОперации",
		ДанныеВходящегоЭлектронногоДокумента.СодержаниеОперации
	);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПриОтраженииВУчетеУниверсальногоКорректировочногоДокумента_2020.
Процедура ПриОтраженииВУчетеУниверсальногоКорректировочногоДокумента_2020(РезультатОтраженияВУчете, Знач ДанныеЭлектронногоДокумента,
	Знач ПараметрыДляОтраженияВУчете) Экспорт
	
	СпособОбработки = ПараметрыДляОтраженияВУчете.ПараметрыСпособаОбмена.СпособОбмена;
	
	ФункцияУКД = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента, "Функция");
	ДокументыУчета = Новый Массив;
	ПервичныйДокумент = Неопределено;
	СчетФактура = Неопределено;
	
	ПервичныйДокументИСчетФактура = РазделитьПервичныйДокументИСчетФактуру(РезультатОтраженияВУчете.ДокументыУчета);
	ПервичныйДокумент = ПервичныйДокументИСчетФактура.ПервичныйДокумент;
	СчетФактура = ПервичныйДокументИСчетФактура.СчетФактура;
	
	НачатьТранзакцию();
	
	Попытка
	
		Если ФункцияУКД = "КСЧФДИС" Тогда
			
			СпособОбработкиПервичногоДокумента = Неопределено;
			СпособОбработкиСчетаФактуры = Неопределено;
			
			Если ТипЗнч(СпособОбработки) = Тип("Структура") Тогда
				СпособОбработки.Свойство("ПервичныйДокумент", СпособОбработкиПервичногоДокумента);
				СпособОбработки.Свойство("СчетФактура", СпособОбработкиСчетаФактуры);
			КонецЕсли;
			
			НайтиСоздатьУКДДокументКорректировки_2020(ДанныеЭлектронногоДокумента, ПервичныйДокумент,
				СпособОбработкиПервичногоДокумента, РезультатОтраженияВУчете.ОписаниеОшибки);
			ДокументыУчета.Добавить(ПервичныйДокумент);
			
			// Заполним основание в СФ.
			ДокументыОснованияСчетаФактуры = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
				ДанныеЭлектронногоДокумента, "ДокументыОснованияСчетаФактуры");
			Если Не ЗначениеЗаполнено(ДокументыОснованияСчетаФактуры) Тогда
				ДокументыОснованияСчетаФактуры = Новый Массив;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПервичныйДокумент) Тогда
				ДокументыОснованияСчетаФактуры.Добавить(ПервичныйДокумент);
			КонецЕсли;
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента,
				"ДокументыОснованияСчетаФактуры", ДокументыОснованияСчетаФактуры);
			
			НайтиСоздатьУКДКорректировочныйСчетФактуру_2020(ДанныеЭлектронногоДокумента, СчетФактура,
				СпособОбработкиСчетаФактуры, РезультатОтраженияВУчете.ОписаниеОшибки);
			ДокументыУчета.Добавить(СчетФактура);
			
		ИначеЕсли ФункцияУКД = "ДИС" Или ФункцияУКД = "СвИСЗК" Тогда
			НайтиСоздатьУКДДокументКорректировки_2020(ДанныеЭлектронногоДокумента, ПервичныйДокумент, СпособОбработки,
				РезультатОтраженияВУчете.ОписаниеОшибки);
			ДокументыУчета.Добавить(ПервичныйДокумент);
		ИначеЕсли ФункцияУКД = "СвИСРК" Тогда
			//НайтиСоздатьДокументУКД0Реализация_2020(ДанныеЭлектронногоДокумента, ПервичныйДокумент, СпособОбработки);
			//ДокументыУчета.Добавить(ПервичныйДокумент);
		ИначеЕсли ФункцияУКД = "КСЧФ" Тогда
			НайтиСоздатьУКДКорректировочныйСчетФактуру_2020(ДанныеЭлектронногоДокумента, СчетФактура, СпособОбработки,
				РезультатОтраженияВУчете.ОписаниеОшибки);
			ДокументыУчета.Добавить(СчетФактура);
		КонецЕсли;
		
		РезультатОтраженияВУчете.ДокументыУчета = ДокументыУчета;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		РезультатОтраженияВУчете.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ЭлектронноеВзаимодействие.ОбработатьОшибку(
			НСтр("ru = 'Создание УКД в формате 2020 года''"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке),
			РезультатОтраженияВУчете.ОписаниеОшибки
		);
		
	КонецПопытки;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.НайтиСоздатьУКД_2020
Процедура НайтиСоздатьУКД_2020(ДеревоДанных,
                               СсылкиНаВладельцев = Неопределено,
                               СпособОбработки  = Неопределено,
                               ОписаниеОшибки = "") Экспорт
	
	ПервичныйДокументИСчетФактура = РазделитьПервичныйДокументИСчетФактуру(СсылкиНаВладельцев);
	ПервичныйДокумент = ПервичныйДокументИСчетФактура.ПервичныйДокумент;
	СчетФактура = ПервичныйДокументИСчетФактура.СчетФактура;
	
	ДокументыУчета = Новый Массив;
	ФункцияУКД = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, "Функция");
	
	НачатьТранзакцию();
	
	Попытка
		
		Если ФункцияУКД = "ДИС" Или ФункцияУКД = "КСЧФДИС" Тогда
			
			НайтиСоздатьУКДДокументКорректировки_2020(ДеревоДанных, ПервичныйДокумент, СпособОбработки, ОписаниеОшибки);
			ДокументыУчета.Добавить(ПервичныйДокумент);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПервичныйДокумент) Тогда
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных,
				"ДокументыОснованияСчетаФактуры",
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПервичныйДокумент)
			);
			
		КонецЕсли;
		
		Если ФункцияУКД = "КСЧФ" Или ФункцияУКД = "КСЧФДИС" Тогда
			
			НайтиСоздатьУКДКорректировочныйСчетФактуру_2020(
				ДеревоДанных,
				СчетФактура,
				СпособОбработки,
				ОписаниеОшибки
			);
			
			Если ЗначениеЗаполнено(СчетФактура) Тогда
				
				ДокументыУчета.Добавить(СчетФактура);
				
			КонецЕсли;
			
		КонецЕсли;
		
		СсылкиНаВладельцев = ДокументыУчета;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ЭлектронноеВзаимодействие.ОбработатьОшибку(
			НСтр("ru = 'Создание УКД в формате 2020 года''"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке),
			ОписаниеОшибки
		);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область УПД_5_02
// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУПД2019_ИнформацияПродавца.
Процедура ЗаполнитьДанныеУПД_5_02_ИнформацияПродавца(Знач Основание, Знач СтруктураЭД, Данные, Описание, Отказ) Экспорт
	
	ТипыДокументов = ОбменСКонтрагентами.ТипыДокументов();
	ТипДокумента = СтруктураЭД.ТипДокумента;
	
	ТипДокументаОснования = ТипЗнч(Основание);
	Если ТипДокументаОснования = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		СчетФактура  = Основание;
		ДокОснование = ОснованиеСчетаФактуры(Основание);
	Иначе
		СчетФактура  = Документы.СчетФактураВыданный.СчетФактураДокумента(Основание);
		ДокОснование = Основание;
	КонецЕсли;
	
	Если ТипДокумента = ТипыДокументов.УПД Тогда
		
		СтруктураЭД.Вставить("Функция", "СЧФДОП");
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
			СтруктураЭД.Функция = "ДОП";
			ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_5_02(Основание, СтруктураЭД, Данные, Отказ);
		ИначеЕсли ЗначениеЗаполнено(СчетФактура) Тогда
			ЗаполнитьДанныеДляУПДИнформацияПродавцаФНС_5_02(СчетФактура, СтруктураЭД, Данные, Отказ)
		Иначе
			ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_5_02(Основание, СтруктураЭД, Данные, Отказ);
			Если УПДБезНДС(Данные, "ТаблицаСчетаФактуры.СведенияОбОтгруженныхПозициях") Тогда
				СтруктураЭД.Функция = "ДОП";
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СчетФактура Тогда
		
		СтруктураЭД.Вставить("Функция", "СЧФ");
		ЗаполнитьДанныеДляСЧФИнформацияПродавцаФНС_5_02(Основание, СтруктураЭД, Данные, Отказ);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СведенияОРеализацииКомиссионером Тогда

		СтруктураЭД.Вставить("Функция", "СвРК");
		Если ЗначениеЗаполнено(СчетФактура) Тогда
			ЗаполнитьДанныеДляСЧФИнформацияПродавцаФНС_5_02(СчетФактура, СтруктураЭД, Данные, Отказ);
		Иначе
			ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_5_02(Основание, СтруктураЭД, Данные, Отказ);
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СведенияОЗакупкеКомиссионером Тогда

		СтруктураЭД.Вставить("Функция", "СвЗК");
		ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_5_02(Основание, СтруктураЭД, Данные, Отказ);
		
	Иначе
		
		СтруктураЭД.Вставить("Функция", "ДОП");
		ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_5_02(Основание, СтруктураЭД, Данные, Отказ);
	
	КонецЕсли;
	
	ФункцияУПД = СтруктураЭД.Функция;
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(Данные, "Функция", ФункцияУПД);
	
	Если ФункцияУПД = "СЧФДОП" Тогда
		
		Если Основание = СчетФактура Тогда
			ПередаточныеДокументы = Новый Массив;
			ПередаточныеДокументы.Добавить(ДокОснование);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Описание.Основания, ПередаточныеДокументы);
		Иначе
			Описание.Основания.Добавить(СчетФактура);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУПД_5_02_ИнформацияПокупателя
Процедура ЗаполнитьДанныеУПД_5_02_ИнформацияПокупателя(Знач Основания, Данные, Отказ) Экспорт
	
	ПоступлениеТоваров = Документы.ПоступлениеТоваров.ПустаяСсылка();
	СчетФактура        = Документы.СчетФактураПолученный.ПустаяСсылка();
	
	Для Каждого Основание Из Основания Цикл
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			СчетФактура = Основание;
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаПоступления")
			И ЗначениеЗаполнено(Основание) Тогда
			ПоступлениеТоваров = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ДокументОснование");
		Иначе
			ПоступлениеТоваров = Основание;
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(ПоступлениеТоваров) = Тип("ДокументСсылка.ПеремещениеМеждуМОДИСМП") Тогда
		Документы.ПеремещениеМеждуМОДИСМП.ЗаполнитьДанныеУПД_5_03_ИнформацияПокупателя(ПоступлениеТоваров, Данные, Отказ);
		Возврат;
	КонецЕсли;
	
	ИнформацияПокупателяУПД = ИнформацияПокупателяУПД_5_02(ПоступлениеТоваров, СчетФактура, Отказ);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		Данные,
		"СоставительДокументаНаименование",
		ИнформацияПокупателяУПД.ОрганизацияНаименованиеПолное
	);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		Данные,
		"СодержаниеФХЖ.СведенияОПринятииТоваров.ДатаПолученияТоваров",
		ИнформацияПокупателяУПД.ДатаПолученияТоваров
	);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		Данные,
		"СодержаниеФХЖ.СведенияОПринятииТоваров.СодержаниеОперации",
		ИнформацияПокупателяУПД.СодержаниеОперации
	);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		Данные,
		"СодержаниеФХЖ.СведенияОПринятииТоваров.КодИтога",
		ИнформацияПокупателяУПД.КодИтога
	);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПриОтраженииВУчетеУниверсальногоПередаточногоДокумента_5_03.
Процедура ПриОтраженииВУчетеУниверсальногоПередаточногоДокумента_5_02(РезультатОтраженияВУчете, Знач ДанныеЭлектронногоДокумента,
	Знач ПараметрыДляОтраженияВУчете) Экспорт
	
	СпособОбработки = ПараметрыДляОтраженияВУчете.ПараметрыПоФорматуДокумента.СпособОбработки;
	
	ПервичныйДокумент = Неопределено;
	СчетФактура = Неопределено;
	
	СпособОбработкиПервичногоДокумента = "";
	СпособОбработкиСчетаФактуры = "";
	
	Если ЗначениеЗаполнено(СпособОбработки) И ТипЗнч(СпособОбработки) = Тип("Структура") Тогда
		
		Если СпособОбработки.Свойство("ПервичныйДокумент") Тогда
			СпособОбработкиПервичногоДокумента = СпособОбработки.ПервичныйДокумент;
		КонецЕсли;
		
		Если СпособОбработки.Свойство("СчетФактура") Тогда
			СпособОбработкиСчетаФактуры = СпособОбработки.СчетФактура;
		КонецЕсли;
	Иначе
		СпособОбработкиПервичногоДокумента = СпособОбработки;
		СпособОбработкиСчетаФактуры = СпособОбработки;
	КонецЕсли;
	
	ПервичныйДокументИСчетФактура = РазделитьПервичныйДокументИСчетФактуру(РезультатОтраженияВУчете.ДокументыУчета);
	ПервичныйДокумент = ПервичныйДокументИСчетФактура.ПервичныйДокумент;
	СчетФактура = ПервичныйДокументИСчетФактура.СчетФактура;
	
	ФункцияУПД = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента, "Функция");
	ДокументыУчета = Новый Массив;
	
	НачатьТранзакцию();
	
	Попытка
		
		Если ФункцияУПД = "ДОП" Или ФункцияУПД = "СЧФДОП" Тогда
			НайтиСоздатьУПДДокументОПередаче_5_02(ДанныеЭлектронногоДокумента, ПервичныйДокумент, Истина,
				СпособОбработкиПервичногоДокумента, РезультатОтраженияВУчете.ОписаниеОшибки);
			ДокументыУчета.Добавить(ПервичныйДокумент);
			ЗаписатьПрисоединенныеФайлыКДокументуЧерезСервисShare(ПервичныйДокумент, ПараметрыДляОтраженияВУчете);
		ИначеЕсли ФункцияУПД = "СвРК" Или ФункцияУПД = "СвИСРК" Тогда
			//НайтиСоздатьУПД0Реализация_5_02(ДанныеЭлектронногоДокумента, ПервичныйДокумент, Истина,
			//	СпособОбработкиПервичногоДокумента, РезультатОтраженияВУчете.ОписаниеОшибки);
			//ДокументыУчета.Добавить(ПервичныйДокумент);
		ИначеЕсли ФункцияУПД = "СвЗК" Или ФункцияУПД = "СвИСЗК" Тогда
			//НайтиСоздатьУПД0Закупка_5_02(ДанныеЭлектронногоДокумента, ПервичныйДокумент, Истина,
			//	СпособОбработкиПервичногоДокумента, РезультатОтраженияВУчете.ОписаниеОшибки);
			//ДокументыУчета.Добавить(ПервичныйДокумент);
		КонецЕсли;
		
		// Заполним основание в СФ.
		ДокументыОснованияСчетаФактуры = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента,
			"ДокументыОснованияСчетаФактуры");
		Если Не ЗначениеЗаполнено(ДокументыОснованияСчетаФактуры) Тогда
			ДокументыОснованияСчетаФактуры = Новый Массив;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПервичныйДокумент) Тогда
			ДокументыОснованияСчетаФактуры.Добавить(ПервичныйДокумент);
		КонецЕсли;
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента,
			"ДокументыОснованияСчетаФактуры", ДокументыОснованияСчетаФактуры);
		
		Если ФункцияУПД = "СЧФ" Или ФункцияУПД = "СЧФДОП" Тогда
			НайтиСоздатьУПДСчетФактуру_5_02(ДанныеЭлектронногоДокумента, СчетФактура, СпособОбработкиСчетаФактуры,
				РезультатОтраженияВУчете.ОписаниеОшибки);
			ДокументыУчета.Добавить(СчетФактура);
		КонецЕсли;
		
		РезультатОтраженияВУчете.ДокументыУчета = ДокументыУчета;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		РезультатОтраженияВУчете.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ЭлектронноеВзаимодействие.ОбработатьОшибку(
			НСтр("ru = 'Создание УПД в формате _5_02 года''"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке),
			РезультатОтраженияВУчете.ОписаниеОшибки
		);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область УПД_5_03
// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУПД2019_ИнформацияПродавца.
Процедура ЗаполнитьДанныеУПД_5_03_ИнформацияПродавца(Знач Основание, Знач СтруктураЭД, Данные, Описание, Отказ) Экспорт
	
	ТипыДокументов = ОбменСКонтрагентами.ТипыДокументов();
	ТипДокумента = СтруктураЭД.ТипДокумента;
	
	ТипДокументаОснования = ТипЗнч(Основание);
	Если ТипДокументаОснования = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		СчетФактура  = Основание;
		ДокОснование = ОснованиеСчетаФактуры(Основание);
	Иначе
		СчетФактура  = Документы.СчетФактураВыданный.СчетФактураДокумента(Основание);
		ДокОснование = Основание;
	КонецЕсли;
	
	Если ТипДокумента = ТипыДокументов.УПД Тогда
		
		СтруктураЭД.Вставить("Функция", "СЧФДОП");
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
			СтруктураЭД.Функция = "ДОП";
			ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_5_02(Основание, СтруктураЭД, Данные, Отказ);
		ИначеЕсли ЗначениеЗаполнено(СчетФактура) Тогда
			ЗаполнитьДанныеДляУПДИнформацияПродавцаФНС_5_02(СчетФактура, СтруктураЭД, Данные, Отказ)
		Иначе
			ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_5_02(Основание, СтруктураЭД, Данные, Отказ);
			Если УПДБезНДС(Данные, "ТаблицаСчетаФактуры.СведенияОбОтгруженныхПозициях") Тогда
				СтруктураЭД.Функция = "ДОП";
			Иначе
				ТекстСообщения = НСтр("ru = 'Для формирования универсального передаточного документа счет-фактура должна быть заполнена.'");
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СчетФактура Тогда
		
		СтруктураЭД.Вставить("Функция", "СЧФ");
		ЗаполнитьДанныеДляСЧФИнформацияПродавцаФНС_5_02(Основание, СтруктураЭД, Данные, Отказ);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СведенияОРеализацииКомиссионером Тогда
		
		СтруктураЭД.Вставить("Функция", "СвРК");
		Если ЗначениеЗаполнено(СчетФактура) Тогда
			ЗаполнитьДанныеДляСЧФИнформацияПродавцаФНС_5_02(СчетФактура, СтруктураЭД, Данные, Отказ);
		Иначе
			ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_5_02(Основание, СтруктураЭД, Данные, Отказ);
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СведенияОЗакупкеКомиссионером Тогда
		
		СтруктураЭД.Вставить("Функция", "СвЗК");
		ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_5_02(Основание, СтруктураЭД, Данные, Отказ);
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПеремещениеМеждуМОДИСМП") Тогда
		
		СтруктураЭД.Вставить("Функция", "ДОП");
		Документы.ПеремещениеМеждуМОДИСМП.ЗаполнитьДанныеУПД_5_03_ИнформацияПродавца(Основание, СтруктураЭД, Данные, Описание, Отказ);
		
	Иначе
		
		СтруктураЭД.Вставить("Функция", "ДОП");
		ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_5_02(Основание, СтруктураЭД, Данные, Отказ);
		
	КонецЕсли;
	
	ФункцияУПД = СтруктураЭД.Функция;
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(Данные, "Функция", ФункцияУПД);
	
	Если ФункцияУПД = "СЧФДОП" Тогда
		
		Если Основание = СчетФактура Тогда
			ПередаточныеДокументы = Новый Массив;
			ПередаточныеДокументы.Добавить(ДокОснование);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Описание.Основания, ПередаточныеДокументы);
		Иначе
			Описание.Основания.Добавить(СчетФактура);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУПД_5_03_ИнформацияПокупателя
Процедура ЗаполнитьДанныеУПД_5_03_ИнформацияПокупателя(Знач Основания, Данные, Отказ) Экспорт
	
	ЗаполнитьДанныеУПД_5_02_ИнформацияПокупателя(Основания, Данные, Отказ);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПриОтраженииВУчетеУниверсальногоПередаточногоДокумента_5_03.
Процедура ПриОтраженииВУчетеУниверсальногоПередаточногоДокумента_5_03(РезультатОтраженияВУчете, Знач ДанныеЭлектронногоДокумента,
	Знач ПараметрыДляОтраженияВУчете) Экспорт
	
	СпособОбработки = ПараметрыДляОтраженияВУчете.ПараметрыПоФорматуДокумента.СпособОбработки;
	
	ПервичныйДокумент = Неопределено;
	СчетФактура = Неопределено;
	
	СпособОбработкиПервичногоДокумента = "";
	СпособОбработкиСчетаФактуры = "";
	
	Если ЗначениеЗаполнено(СпособОбработки) И ТипЗнч(СпособОбработки) = Тип("Структура") Тогда
		
		Если СпособОбработки.Свойство("ПервичныйДокумент") Тогда
			СпособОбработкиПервичногоДокумента = СпособОбработки.ПервичныйДокумент;
		КонецЕсли;
		
		Если СпособОбработки.Свойство("СчетФактура") Тогда
			СпособОбработкиСчетаФактуры = СпособОбработки.СчетФактура;
		КонецЕсли;
	Иначе
		СпособОбработкиПервичногоДокумента = СпособОбработки;
		СпособОбработкиСчетаФактуры = СпособОбработки;
	КонецЕсли;
	
	ПервичныйДокументИСчетФактура = РазделитьПервичныйДокументИСчетФактуру(РезультатОтраженияВУчете.ДокументыУчета);
	ПервичныйДокумент = ПервичныйДокументИСчетФактура.ПервичныйДокумент;
	СчетФактура = ПервичныйДокументИСчетФактура.СчетФактура;
	
	ФункцияУПД = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента, "Функция");
	ДокументыУчета = Новый Массив;
	
	НачатьТранзакцию();
	
	Попытка
		
		Если ФункцияУПД = "ДОП" Или ФункцияУПД = "СЧФДОП" Тогда
			НайтиСоздатьУПДДокументОПередаче_5_02(ДанныеЭлектронногоДокумента, ПервичныйДокумент, Истина,
				СпособОбработкиПервичногоДокумента, РезультатОтраженияВУчете.ОписаниеОшибки);
			ДокументыУчета.Добавить(ПервичныйДокумент);
			ЗаписатьПрисоединенныеФайлыКДокументуЧерезСервисShare(ПервичныйДокумент, ПараметрыДляОтраженияВУчете);
		ИначеЕсли ФункцияУПД = "СвРК" Или ФункцияУПД = "СвИСРК" Тогда
			//НайтиСоздатьУПД0Реализация_5_02(ДанныеЭлектронногоДокумента, ПервичныйДокумент, Истина,
			//	СпособОбработкиПервичногоДокумента, РезультатОтраженияВУчете.ОписаниеОшибки);
			//ДокументыУчета.Добавить(ПервичныйДокумент);
		ИначеЕсли ФункцияУПД = "СвЗК" Или ФункцияУПД = "СвИСЗК" Тогда
			//НайтиСоздатьУПД0Закупка_5_02(ДанныеЭлектронногоДокумента, ПервичныйДокумент, Истина,
			//	СпособОбработкиПервичногоДокумента, РезультатОтраженияВУчете.ОписаниеОшибки);
			//ДокументыУчета.Добавить(ПервичныйДокумент);
		КонецЕсли;
		
		// Заполним основание в СФ.
		ДокументыОснованияСчетаФактуры = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента,
			"ДокументыОснованияСчетаФактуры");
		Если Не ЗначениеЗаполнено(ДокументыОснованияСчетаФактуры) Тогда
			ДокументыОснованияСчетаФактуры = Новый Массив;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПервичныйДокумент) Тогда
			ДокументыОснованияСчетаФактуры.Добавить(ПервичныйДокумент);
		КонецЕсли;
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента,
			"ДокументыОснованияСчетаФактуры", ДокументыОснованияСчетаФактуры);
		
		Если ФункцияУПД = "СЧФ" Или ФункцияУПД = "СЧФДОП" Тогда
			НайтиСоздатьУПДСчетФактуру_5_02(ДанныеЭлектронногоДокумента, СчетФактура, СпособОбработкиСчетаФактуры,
				РезультатОтраженияВУчете.ОписаниеОшибки);
			ДокументыУчета.Добавить(СчетФактура);
		КонецЕсли;
		
		РезультатОтраженияВУчете.ДокументыУчета = ДокументыУчета;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		РезультатОтраженияВУчете.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ЭлектронноеВзаимодействие.ОбработатьОшибку(
			НСтр("ru = 'Создание УПД в формате _5_03 года''"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке),
			РезультатОтраженияВУчете.ОписаниеОшибки
		);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область УПД_2019

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУПД2019_ИнформацияПродавца.
Процедура ЗаполнитьДанныеУПД2019_ИнформацияПродавца(Знач Основание, Знач СтруктураЭД, Данные, Описание, Отказ) Экспорт
	
	ТипыДокументов = ОбменСКонтрагентами.ТипыДокументов();
	ТипДокумента = СтруктураЭД.ТипДокумента;
	
	ТипДокументаОснования = ТипЗнч(Основание);
	Если ТипДокументаОснования = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		СчетФактура  = Основание;
		ДокОснование = ОснованиеСчетаФактуры(Основание);
	Иначе
		СчетФактура  = Документы.СчетФактураВыданный.СчетФактураДокумента(Основание);
		ДокОснование = Основание;
	КонецЕсли;
	
	Если ТипДокумента = ТипыДокументов.УПД Тогда
		
		СтруктураЭД.Вставить("Функция", "СЧФДОП");
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
			СтруктураЭД.Функция = "ДОП";
			ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_2019(Основание, СтруктураЭД, Данные, Отказ);
		ИначеЕсли ЗначениеЗаполнено(СчетФактура) Тогда
			ЗаполнитьДанныеДляУПДИнформацияПродавцаФНС_2019(СчетФактура, СтруктураЭД, Данные, Отказ)
		Иначе
			ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_2019(Основание, СтруктураЭД, Данные, Отказ);
			Если УПДБезНДС(Данные) Тогда
				СтруктураЭД.Функция = "ДОП";
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СчетФактура Тогда
		
		СтруктураЭД.Вставить("Функция", "СЧФ");
		ЗаполнитьДанныеДляСЧФИнформацияПродавцаФНС_2019(Основание, СтруктураЭД, Данные, Отказ);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СведенияОРеализацииКомиссионером Тогда

		СтруктураЭД.Вставить("Функция", "СвРК");
		Если ЗначениеЗаполнено(СчетФактура) Тогда
			ЗаполнитьДанныеДляСЧФИнформацияПродавцаФНС_2019(СчетФактура, СтруктураЭД, Данные, Отказ);
		Иначе
			ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_2019(Основание, СтруктураЭД, Данные, Отказ);
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СведенияОЗакупкеКомиссионером Тогда

		СтруктураЭД.Вставить("Функция", "СвЗК");
		ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_2019(Основание, СтруктураЭД, Данные, Отказ);
		
	Иначе
		
		СтруктураЭД.Вставить("Функция", "ДОП");
		ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_2019(Основание, СтруктураЭД, Данные, Отказ);
	
	КонецЕсли;
	
	ФункцияУПД = СтруктураЭД.Функция;
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(Данные, "Функция", ФункцияУПД);
	
	Если ФункцияУПД = "СЧФДОП" Тогда
		
		Если Основание = СчетФактура Тогда
			ПередаточныеДокументы = Новый Массив;
			ПередаточныеДокументы.Добавить(ДокОснование);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Описание.Основания, ПередаточныеДокументы);
		Иначе
			Описание.Основания.Добавить(СчетФактура);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУПД2019_ИнформацияПокупателя
Процедура ЗаполнитьДанныеУПД2019_ИнформацияПокупателя(Знач Основания, Данные, Отказ) Экспорт
	
	ИнформацияПокупателяУПД = ИнформацияПокупателяУПД(Основания);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		Данные,
		"СоставительДокументаНаименование",
		ИнформацияПокупателяУПД.ОрганизацияНаименованиеПолное
	);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		Данные,
		"СведенияОПринятииТоваров.ДатаПолученияТоваров",
		ИнформацияПокупателяУПД.ДатаПолученияТоваров
	);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		Данные,
		"СведенияОПринятииТоваров.СодержаниеОперации",
		ИнформацияПокупателяУПД.СодержаниеОперации
	);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		Данные,
		"СведенияОПринятииТоваров.КодИтога",
		ИнформацияПокупателяУПД.КодИтога
	);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПриОтраженииВУчетеУниверсальногоПередаточногоДокумента_2019.
Процедура ПриОтраженииВУчетеУниверсальногоПередаточногоДокумента_2019(РезультатОтраженияВУчете, Знач ДанныеЭлектронногоДокумента,
	Знач ПараметрыДляОтраженияВУчете) Экспорт
	
	СпособОбработки = ПараметрыДляОтраженияВУчете.ПараметрыПоФорматуДокумента.СпособОбработки;
	
	ПервичныйДокумент = Неопределено;
	СчетФактура = Неопределено;
	
	СпособОбработкиПервичногоДокумента = "";
	СпособОбработкиСчетаФактуры = "";
	
	Если ЗначениеЗаполнено(СпособОбработки) И ТипЗнч(СпособОбработки) = Тип("Структура") Тогда
		
		Если СпособОбработки.Свойство("ПервичныйДокумент") Тогда
			СпособОбработкиПервичногоДокумента = СпособОбработки.ПервичныйДокумент;
		КонецЕсли;
		
		Если СпособОбработки.Свойство("СчетФактура") Тогда
			СпособОбработкиСчетаФактуры = СпособОбработки.СчетФактура;
		КонецЕсли;
	Иначе
		СпособОбработкиПервичногоДокумента = СпособОбработки;
		СпособОбработкиСчетаФактуры = СпособОбработки;
	КонецЕсли;
	
	ПервичныйДокументИСчетФактура = РазделитьПервичныйДокументИСчетФактуру(РезультатОтраженияВУчете.ДокументыУчета);
	ПервичныйДокумент = ПервичныйДокументИСчетФактура.ПервичныйДокумент;
	СчетФактура = ПервичныйДокументИСчетФактура.СчетФактура;
	
	ФункцияУПД = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента, "Функция");
	ДокументыУчета = Новый Массив;
	
	НачатьТранзакцию();
	
	Попытка
	
		Если ФункцияУПД = "ДОП" Или ФункцияУПД = "СЧФДОП" Тогда
			НайтиСоздатьУПДДокументОПередаче_2019(ДанныеЭлектронногоДокумента, ПервичныйДокумент, Истина,
				СпособОбработкиПервичногоДокумента, РезультатОтраженияВУчете.ОписаниеОшибки);
			ДокументыУчета.Добавить(ПервичныйДокумент);
			
			ЗаписатьПрисоединенныеФайлыКДокументуЧерезСервисShare(ПервичныйДокумент, ПараметрыДляОтраженияВУчете);
		//ИначеЕсли ФункцияУПД = "СвРК" Или ФункцияУПД = "СвИСРК" Тогда
		//	НайтиСоздатьУПД0Реализация_2019(ДанныеЭлектронногоДокумента, ПервичныйДокумент, Истина, СпособОбработкиПервичногоДокумента,
		//		РезультатОтраженияВУчете.ОписаниеОшибки);
		//	ДокументыУчета.Добавить(ПервичныйДокумент);
		//ИначеЕсли ФункцияУПД = "СвЗК" Или ФункцияУПД = "СвИСЗК" Тогда
		//	НайтиСоздатьУПД0Закупка_2019(ДанныеЭлектронногоДокумента, ПервичныйДокумент, Истина, СпособОбработкиПервичногоДокумента,
		//		РезультатОтраженияВУчете.ОписаниеОшибки);
		//	ДокументыУчета.Добавить(ПервичныйДокумент);
		КонецЕсли;
		
		// Заполним основание в СФ.
		ДокументыОснованияСчетаФактуры = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента,
			"ДокументыОснованияСчетаФактуры");
		Если Не ЗначениеЗаполнено(ДокументыОснованияСчетаФактуры) Тогда
			ДокументыОснованияСчетаФактуры = Новый Массив;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПервичныйДокумент) Тогда
			ДокументыОснованияСчетаФактуры.Добавить(ПервичныйДокумент);
		КонецЕсли;
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента,
			"ДокументыОснованияСчетаФактуры", ДокументыОснованияСчетаФактуры);
		
		Если ФункцияУПД = "СЧФ" Или ФункцияУПД = "СЧФДОП" Тогда
			НайтиСоздатьУПДСчетФактуру_2019(ДанныеЭлектронногоДокумента, СчетФактура, СпособОбработкиСчетаФактуры,
				РезультатОтраженияВУчете.ОписаниеОшибки, ПараметрыДляОтраженияВУчете);
			ДокументыУчета.Добавить(СчетФактура);
		КонецЕсли;
		
		РезультатОтраженияВУчете.ДокументыУчета = ДокументыУчета;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		РезультатОтраженияВУчете.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ЭлектронноеВзаимодействие.ОбработатьОшибку(
			НСтр("ru = 'Создание УПД в формате 2019 года''"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке),
			РезультатОтраженияВУчете.ОписаниеОшибки
		);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область УПД

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУПД_ИнформацияПокупателя
Процедура ЗаполнитьДанныеУПД_ИнформацияПокупателя(Знач Основания, Данные, Отказ) Экспорт
	
	ИнформацияПокупателяУПД = ИнформацияПокупателяУПД(Основания);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		Данные,
		"СоставительДокументаНаименование",
		ИнформацияПокупателяУПД.ОрганизацияНаименованиеПолное
	);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		Данные,
		"ДатаПолученияТоваров",
		ИнформацияПокупателяУПД.ДатаПолученияТоваров
	);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		Данные,
		"СодержаниеОперации",
		ИнформацияПокупателяУПД.СодержаниеОперации
	);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПриОтраженииВУчетеУниверсальногоПередаточногоДокумента_2016.
Процедура ПриОтраженииВУчетеУниверсальногоПередаточногоДокумента_2016(РезультатОтраженияВУчете, Знач ДанныеЭлектронногоДокумента,
	Знач ПараметрыДляОтраженияВУчете) Экспорт
	
	СпособОбработки = ПараметрыДляОтраженияВУчете.ПараметрыПоФорматуДокумента.СпособОбработки;
	
	ПервичныйДокумент = Неопределено;
	СчетФактура = Неопределено;
	
	СпособОбработкиПервичногоДокумента = "";
	СпособОбработкиСчетаФактуры = "";
	
	Если ЗначениеЗаполнено(СпособОбработки) И ТипЗнч(СпособОбработки) = Тип("Структура") Тогда
		
		Если СпособОбработки.Свойство("ПервичныйДокумент") Тогда
			СпособОбработкиПервичногоДокумента = СпособОбработки.ПервичныйДокумент;
		КонецЕсли;
		
		Если СпособОбработки.Свойство("СчетФактура") Тогда
			СпособОбработкиСчетаФактуры = СпособОбработки.СчетФактура;
		КонецЕсли;
		
	Иначе
		СпособОбработкиПервичногоДокумента = СпособОбработки;
		СпособОбработкиСчетаФактуры = СпособОбработки;
	КонецЕсли;
	
	ПервичныйДокументИСчетФактура = РазделитьПервичныйДокументИСчетФактуру(РезультатОтраженияВУчете.ДокументыУчета);
	ПервичныйДокумент = ПервичныйДокументИСчетФактура.ПервичныйДокумент;
	СчетФактура = ПервичныйДокументИСчетФактура.СчетФактура;
	
	ФункцияУПД = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента, "Функция");
	
	ДокументыУчета = Новый Массив;
	
	НачатьТранзакцию();
	
	Попытка
		
		Если ФункцияУПД = "ДОП" Или ФункцияУПД = "СЧФДОП" Тогда
			НайтиСоздатьУПДДокументОПередаче(ДанныеЭлектронногоДокумента, ПервичныйДокумент, СпособОбработкиПервичногоДокумента,
				РезультатОтраженияВУчете.ОписаниеОшибки);
			ДокументыУчета.Добавить(ПервичныйДокумент);
			ЗаписатьПрисоединенныеФайлыКДокументуЧерезСервисShare(ПервичныйДокумент, ПараметрыДляОтраженияВУчете);
		КонецЕсли;
		
		// Заполним основание в СФ.
		ДокументыОснованияСчетаФактуры = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента,
			"ДокументыОснованияСчетаФактуры");
		Если Не ЗначениеЗаполнено(ДокументыОснованияСчетаФактуры) Тогда
			ДокументыОснованияСчетаФактуры = Новый Массив;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПервичныйДокумент) Тогда
			ДокументыОснованияСчетаФактуры.Добавить(ПервичныйДокумент);
		КонецЕсли;
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента, "ДокументыОснованияСчетаФактуры",
			ДокументыОснованияСчетаФактуры);
		
		Если ФункцияУПД = "СЧФ" Или ФункцияУПД = "СЧФДОП" Тогда
			НайтиСоздатьУПДСчетФактуру(ДанныеЭлектронногоДокумента, СчетФактура, СпособОбработкиСчетаФактуры,
				РезультатОтраженияВУчете.ОписаниеОшибки);
		КонецЕсли;
		ДокументыУчета.Добавить(СчетФактура);
		
		РезультатОтраженияВУчете.ДокументыУчета = ДокументыУчета;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		РезультатОтраженияВУчете.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ЭлектронноеВзаимодействие.ОбработатьОшибку(
			НСтр("ru = 'Создание УПД''"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке),
			РезультатОтраженияВУчете.ОписаниеОшибки
		);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область УКД

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУКД_ИнформацияПродавца
Процедура ЗаполнитьДанныеУКД_ИнформацияПродавца(Знач Основание, Знач Настройки, Данные, Описание, Отказ) Экспорт 
	
	ТипыДокументов = ОбменСКонтрагентами.ТипыДокументов();
	ТипДокумента = Настройки.ТипДокумента;
	
	Если ТипДокумента = ТипыДокументов.УКД Тогда
		
		Настройки.Вставить("Функция", "КСЧФДИС");
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СоглашениеОбИзмененииСтоимости Тогда
		
		Настройки.Вставить("Функция", "ДИС");
		
	Иначе
		
		Настройки.Вставить("Функция", "КСЧФ");
		
	КонецЕсли;
	
	ДокументСсылкаКСЧФ = Основание;
	
	Если ТипЗнч(Основание) <> Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		ДокументСсылкаКСЧФ = Документы.СчетФактураВыданный.СчетФактураДокумента(Основание);
		
		Если ТипДокумента = ТипыДокументов.УКД Тогда
			
			Описание.Основания.Добавить(ДокументСсылкаКСЧФ);
			
		КонецЕсли;
		
	Иначе
		
		Если ТипДокумента = ТипыДокументов.УКД Тогда
			
			Описание.Основания.Добавить(Основание.ДокументОснование);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументСсылкаКСЧФ) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Для формирования УКД счет-фактура должна быть заполнена.'"));
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	ДанныеДляФормированияЭД = ДайДанныеСчетаФактурыДляУКД(ДокументСсылкаКСЧФ);
	ДеревоДанных = ЗаполнитьДанныеПервичногоДокументаУКД_2020(ДанныеДляФормированияЭД, Настройки, Данные);
	ДеревоДанных = ЗаполнитьДеревоДанныхУКД(ДанныеДляФормированияЭД, Настройки, ДеревоДанных);
	ДеревоДанных = ЗаполнитьИнформациюОТоварахТоваровУКД_2020(ДанныеДляФормированияЭД, Настройки, ДеревоДанных);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеУКД_ИнформацияПокупателя
Процедура ЗаполнитьДанныеУКД_ИнформацияПокупателя(Знач Основания, Данные, Отказ) Экспорт
	
	ДанныеВходящегоЭлектронногоДокумента = ИнформацияПокупателяУКД(Основания);
	СохранитьРеквизитВДереве(
		Данные,
		"СоставительДокументаНаименование",
		ДанныеВходящегоЭлектронногоДокумента.ОрганизацияНаименованиеПолное
	);
	СохранитьРеквизитВДереве(
		Данные,
		"ДатаСогласования",
		ДанныеВходящегоЭлектронногоДокумента.ДатаСогласования
	);
	СохранитьРеквизитВДереве(
		Данные,
		"СодержаниеОперации",
		ДанныеВходящегоЭлектронногоДокумента.СодержаниеОперации
	);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПриОтраженииВУчетеУниверсальногоКорректировочногоДокумента_2016.
Процедура ПриОтраженииВУчетеУниверсальногоКорректировочногоДокумента_2016(РезультатОтраженияВУчете, Знач ДанныеЭлектронногоДокумента,
	Знач ПараметрыДляОтраженияВУчете) Экспорт
	
	СпособОбработки = ПараметрыДляОтраженияВУчете.ПараметрыПоФорматуДокумента.СпособОбработки;
	
	ПервичныйДокумент = Неопределено;
	СчетФактура = Неопределено;
	
	СпособОбработкиПервичногоДокумента = "";
	СпособОбработкиСчетаФактуры = "";
	
	Если ЗначениеЗаполнено(СпособОбработки) И ТипЗнч(СпособОбработки) = Тип("Структура") Тогда
		
		Если СпособОбработки.Свойство("ПервичныйДокумент") Тогда
			СпособОбработкиПервичногоДокумента = СпособОбработки.ПервичныйДокумент;
		КонецЕсли;
		
		Если СпособОбработки.Свойство("СчетФактура") Тогда
			СпособОбработкиСчетаФактуры = СпособОбработки.СчетФактура;
		КонецЕсли;
	Иначе
		СпособОбработкиПервичногоДокумента = СпособОбработки;
		СпособОбработкиСчетаФактуры = СпособОбработки;
	КонецЕсли;
	
	ПервичныйДокументИСчетФактура = РазделитьПервичныйДокументИСчетФактуру(РезультатОтраженияВУчете.ДокументыУчета);
	ПервичныйДокумент = ПервичныйДокументИСчетФактура.ПервичныйДокумент;
	СчетФактура = ПервичныйДокументИСчетФактура.СчетФактура;
	
	ДокументыУчета = Новый Массив;
	ФункцияУКД = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента, "Функция");
	
	НачатьТранзакцию();
	
	Попытка
	
		Если ФункцияУКД = "ДИС" Или ФункцияУКД = "КСЧФДИС" Тогда
			НайтиСоздатьУКДДокументКорректировки(ДанныеЭлектронногоДокумента, ПервичныйДокумент,
				РезультатОтраженияВУчете.ОписаниеОшибки, СпособОбработкиПервичногоДокумента);
			ДокументыУчета.Добавить(ПервичныйДокумент);
		КонецЕсли;
		
		// Заполним основание в СФ
		ДокументыОснованияСчетаФактуры = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента,
			"ДокументыОснованияСчетаФактуры");
		Если Не ЗначениеЗаполнено(ДокументыОснованияСчетаФактуры) Тогда
			ДокументыОснованияСчетаФактуры = Новый Массив;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПервичныйДокумент) Тогда
			ДокументыОснованияСчетаФактуры.Добавить(ПервичныйДокумент);
		КонецЕсли;
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДанныеЭлектронногоДокумента,
			"ДокументыОснованияСчетаФактуры", ДокументыОснованияСчетаФактуры);
		
		Если ФункцияУКД = "КСЧФ" Или ФункцияУКД = "КСЧФДИС" Тогда
			НайтиСоздатьУКДКорректировочныйСчетФактуру(ДанныеЭлектронногоДокумента, СчетФактура, СпособОбработкиСчетаФактуры,
				РезультатОтраженияВУчете.ОписаниеОшибки);
			ДокументыУчета.Добавить(СчетФактура);
		КонецЕсли;
		
		РезультатОтраженияВУчете.ДокументыУчета = ДокументыУчета;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		РезультатОтраженияВУчете.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ЭлектронноеВзаимодействие.ОбработатьОшибку(
			НСтр("ru = 'Создание УКД в формате 2016 года''"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке),
			РезультатОтраженияВУчете.ОписаниеОшибки
		);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ПередачаТоваров

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПередачаТоваров_ИнформацияПродавца
Процедура ЗаполнитьДанныеПередачаТоваров_ИнформацияПродавца(Знач Основание, Знач Настройки, Данные, Описание, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеДляПечати = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Основание).ПолучитьДанныеДляПечатиТОРГ12(Основание);
	
	СохранитьРеквизитВДереве(Данные, "НомерТоварнойНакладной",
		УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(Основание));
	СохранитьРеквизитВДереве(Данные, "ДатаТоварнойНакладной", ДанныеДляПечати.Дата);
		
	Если ЗначениеЗаполнено(ДанныеДляПечати.ДокументОснование) Тогда
		
		ДокументыОснования = Новый ТаблицаЗначений;
		ДокументыОснования.Колонки.Добавить("ДокОснование");
		ДокументыОснования.Колонки.Добавить("ДокОснованиеНаименование");
		ДокументыОснования.Колонки.Добавить("ДокОснованиеНомер");
		ДокументыОснования.Колонки.Добавить("ДокОснованиеДата");
		
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ДанныеДляПечати.ДокументОснование, "Наименование,ДатаНачала");

		СтрокаДокументыОснования = ДокументыОснования.Добавить();
		СтрокаДокументыОснования.ДокОснование             = ДанныеДляПечати.ДокументОснование;
		СтрокаДокументыОснования.ДокОснованиеНомер        = ДанныеДляПечати.ОснованиеНомер;
		СтрокаДокументыОснования.ДокОснованиеДата         = РеквизитыОснования.ДатаНачала;
		СтрокаДокументыОснования.ДокОснованиеНаименование = РеквизитыОснования.Наименование;
		
		ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(
		СтрокаДокументыОснования,
		"ДокОснованиеДата",
		"ДокОснование",
		"Объект.ДатаНачала");
		
		ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(Данные, ДокументыОснования, "Основание");
		
	КонецЕсли;
	
	// Выводим общие реквизиты шапки
	СведенияОПоставщике = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ДанныеДляПечати.Организация, СведенияОПоставщике);
		
	ЗаполнитьДанныеУчастника(Данные, СведенияОПоставщике, "Поставщик",  "Юр", , ДанныеДляПечати.Дата);
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.КПП) Тогда
		
		НаименованиеСоставителяДокумента = СведенияОПоставщике.ПолноеНаименование
			+ СтрШаблон(НСтр("ru = ', ИНН/КПП %1/%2'"), СведенияОПоставщике.ИНН, СведенияОПоставщике.КПП);
		
	Иначе
		
		НаименованиеСоставителяДокумента = СведенияОПоставщике.ПолноеНаименование
			+ СтрШаблон(НСтр("ru = ', ИНН %1'"), СведенияОПоставщике.ИНН);
		
	КонецЕсли;

	ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки(
		ДанныеДляПечати.Организация, "Объект.Организация");
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		Данные,
		"НаименованиеСоставителяДокумента",
		НаименованиеСоставителяДокумента,
		ПараметрыОбработкиОшибок
	);
	
	СведенияОПокупателе = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ДанныеДляПечати.Плательщик, СведенияОПокупателе);
	ЗаполнитьДанныеУчастника(Данные, СведенияОПокупателе, "Плательщик", "Юр", , ДанныеДляПечати.Дата);
	
	Если ЗначениеЗаполнено(ДанныеДляПечати.Грузополучатель) Тогда
		СведенияОГрузополучателе = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
		ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ДанныеДляПечати.Грузополучатель,
			СведенияОГрузополучателе);
		ЗаполнитьДанныеУчастника(Данные, СведенияОГрузополучателе, "Грузополучатель", "Факт", , ДанныеДляПечати.Дата);
	КонецЕсли;
	
	ВалютаКод = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДляПечати.ВалютаДокумента, "Код");
	СохранитьРеквизитВДереве(Данные, "ВалютаКод", ВалютаКод);
	
	ВалютаНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДляПечати.ВалютаДокумента, "Наименование");
	СохранитьРеквизитВДереве(Данные, "ВалютаНаименование", ВалютаНаименование);
	
	ИтоговыеСуммы = Новый Структура;
	ИтоговыеСуммы.Вставить("КоличествоМест", 0);
	ИтоговыеСуммы.Вставить("МассаНетто", 0);
	ИтоговыеСуммы.Вставить("Количество", 0);
	ИтоговыеСуммы.Вставить("СуммаБезНДС", 0);
	ИтоговыеСуммы.Вставить("СуммаНДС", 0);
	ИтоговыеСуммы.Вставить("СуммаСНДС", 0);
	ИтоговыеСуммы.Вставить("КоличествоПорядковыхНомеровЗаписей", 0);
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВремТаб
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТаб.Номенклатура.Код КАК НоменклатураКод,
	|	ВремТаб.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	ВремТаб.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ВремТаб.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК Код,
	|	ВремТаб.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование КАК Наименование,
	|	ВремТаб.НомерСтроки КАК НомерСтроки,
	|	ВремТаб.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	ВремТаб КАК ВремТаб"; 
	
	Если ТипЗнч(ДанныеДляПечати.ВыборкаТабличнойЧасти) = Тип("ТаблицаЗначений") Тогда
		ТаблицаТоваров = ДанныеДляПечати.ВыборкаТабличнойЧасти;
	Иначе
		ТаблицаТоваров = ДанныеДляПечати.ВыборкаТабличнойЧасти.Выгрузить();
	КонецЕсли;
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	ВыборкаЕдиницИзмерения = Запрос.Выполнить().Выгрузить();
	
	// Добавим данные о товарах
	ТаблицаТоваров.Колонки.Добавить("НаименованиеНоменклатуры");
	ТаблицаТоваров.Колонки.Добавить("НаименованиеХарактеристики");
	ТаблицаТоваров.Колонки.Добавить("Артикул");
	ТаблицаТоваров.Колонки.Добавить("КодТовара");	
	Если ТаблицаТоваров.Колонки.Найти("КоличествоМест") = Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("КоличествоМест");
	КонецЕсли;
	Если ТаблицаТоваров.Колонки.Найти("СуммаБезНДС") = Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("СуммаБезНДС");
	КонецЕсли;
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмеренияНаименование");
	ТаблицаТоваров.Колонки.Добавить("КоличествоВОдномМесте");
	ТаблицаТоваров.Колонки.Добавить("МассаБрутто");
	ТаблицаТоваров.Колонки.Добавить("МассаНетто");
	ТаблицаТоваров.Колонки.Добавить("БазоваяЕдиницаКод");
	ТаблицаТоваров.Колонки.Добавить("СуммаСНДС");	
	ТаблицаТоваров.Колонки.Добавить("ДопДанныеПодписанные");
	ТаблицаТоваров.Колонки.Добавить("ДопДанныеНеПодписанные");
	ТаблицаТоваров.Колонки.Добавить("Сопоставление");
	ТочностьДляМассы = 3;
	
	ШтрихкодыКомбинаций = Неопределено;
	ШтрихкодыНоменклатуры = Неопределено;
	ШтрихкодыПоТоварам(ТаблицаТоваров, ШтрихкодыКомбинаций, ШтрихкодыНоменклатуры);
	
	Для Каждого СтрокаТовары Из ТаблицаТоваров Цикл
		
		ДанныеСтрокиСтроки = УправлениеПечатьюПлатформа.ЗаполнитьПредставлениеДанныхТоварнойСтроки(
			СтрокаТовары,
			Основание,
			ПолучитьЗначениеПараметраСтруктуры(Основание, "ИмяТабличнойЧасти", "Товары")
		);
		СтрокаТовары.МассаНетто = Окр(СтрокаТовары.Количество, ТочностьДляМассы);
		СтрокаТовары.КоличествоМест = СтрокаТовары.Количество;
		СтрокаТовары.КоличествоВОдномМесте = СтрокаТовары.Коэффициент;
		
		Если ЗначениеЗаполнено(СтрокаТовары.КоличествоМест) Тогда
			
			Если СтрокаТовары.КоличествоМест <> Цел(СтрокаТовары.КоличествоМест) Тогда
				
				СтрокаТовары.КоличествоМест = Цел(СтрокаТовары.КоличествоМест) + 1;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТовары.КоличествоВОдномМесте) Тогда
			
			Если СтрокаТовары.КоличествоВОдномМесте <> Цел(СтрокаТовары.КоличествоВОдномМесте) Тогда
				
				СтрокаТовары.КоличествоВОдномМесте = Цел(СтрокаТовары.КоличествоВОдномМесте) + 1;
				
			КонецЕсли;
			
		КонецЕсли;
		
		БазоваяЕдИзм = ВыборкаЕдиницИзмерения.Найти(СтрокаТовары.НомерСтроки, "НомерСтроки");
		
		СтрокаТовары.Артикул                  = СокрЛП(БазоваяЕдИзм.НоменклатураАртикул);
		СтрокаТовары.КодТовара                = СокрЛП(БазоваяЕдИзм.НоменклатураКод);
		СтрокаТовары.НаименованиеНоменклатуры = СокрЛП(БазоваяЕдИзм.НоменклатураНаименование);
		
		СтрокаТовары.ЕдиницаИзмеренияНаименование = СокрЛП(БазоваяЕдИзм.Наименование);
		СтрокаТовары.БазоваяЕдиницаКод = СокрЛП(БазоваяЕдИзм.Код);
		СтрокаТовары.СуммаСНДС = СтрокаТовары.СуммаВсего;
		
		СтрокаТовары.СуммаБезНДС = СтрокаТовары.СуммаВсего - СтрокаТовары.СуммаНДС;
		РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТовары);
		
		СтрокаТовары.Сопоставление = СопоставленияНоменклатурыЭД(СтрокаТовары.Номенклатура,
			СтрокаТовары.ХарактеристикаНоменклатуры, СтрокаТовары.ЕдиницаИзмерения);
			
		ЗаполнитьШтрихкодыТоваровВСопоставление(
			СтрокаТовары.Сопоставление,
			ШтрихкодыНоменклатуры,
			ШтрихкодыКомбинаций,
			СтрокаТовары.Номенклатура,
			СтрокаТовары.ХарактеристикаНоменклатуры,
			СтрокаТовары.ЕдиницаИзмерения
		);
		
		Если Настройки.ВариантыЗаполненияПолей.ТоварКод = "Артикул" Тогда
				
			СтрокаТовары.ТоварКод = СокрЛП(СтрокаТовары.Артикул);
			
		ИначеЕсли
			Настройки.ВариантыЗаполненияПолей.ТоварКод = "Штрихкод"
			И СтрокаТовары.Сопоставление.Свойство("ШтрихкодКомбинации")
		Тогда
		
			СтрокаТовары.ТоварКод = СтрокаТовары.Сопоставление.ШтрихкодКомбинации;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "ЕдиницаИзмеренияНаименование";
	ОписаниеОшибкиДляТаблицы.ТекстОшибки = НСтр("ru = 'Не заполнена наименование единицы измерения в справочнике ""Номенклатура"".'");
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "БазоваяЕдиницаКод";
	ОписаниеОшибкиДляТаблицы.ТекстОшибки = НСтр("ru = 'Не заполнен код единицы измерения в справочнике ""Номенклатура"".'");
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров, ОписаниеОшибкиДляТаблицы);
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(Данные, ТаблицаТоваров, "ТаблицаТоваров");
	
	СохранитьРеквизитВДереве(Данные, "СведенияПоОтпускуГруза.ДатаОтпуска", ДанныеДляПечати.Дата);

	СохранитьРеквизитВДереве(Данные, "ОбщиеСведенияОТоварнойНакладной.КоличествоПорядковыхНомеровЗаписей",
		ИтоговыеСуммы.КоличествоПорядковыхНомеровЗаписей);
	СохранитьРеквизитВДереве(Данные, "ОбщиеСведенияОТоварнойНакладной.КоличествоПорядковыхНомеровЗаписейПрописью",
		ЧислоПрописью(ИтоговыеСуммы.КоличествоПорядковыхНомеровЗаписей, , ",,,,,,,,0"));
	СохранитьРеквизитВДереве(Данные, "ОбщиеСведенияОТоварнойНакладной.ВсегоМест", ИтоговыеСуммы.КоличествоМест);
	СохранитьРеквизитВДереве(Данные, "ОбщиеСведенияОТоварнойНакладной.МассаГрузаНетто", ИтоговыеСуммы.МассаНетто);

	Если ИтоговыеСуммы.КоличествоМест > 0 Тогда
		
		СохранитьРеквизитВДереве(Данные, "ОбщиеСведенияОТоварнойНакладной.ВсегоМестПрописью",
			ЧислоПрописью(ИтоговыеСуммы.КоличествоМест, , ",,,,,,,,0"));
		
	КонецЕсли;
	
	СохранитьРеквизитВДереве(Данные, "ВсегоПоНакладной.КоличествоМест", ИтоговыеСуммы.КоличествоМест);
	СохранитьРеквизитВДереве(Данные, "ВсегоПоНакладной.МассаНетто", ИтоговыеСуммы.МассаНетто);
	СохранитьРеквизитВДереве(Данные, "ВсегоПоНакладной.СуммаБезНДС", ИтоговыеСуммы.СуммаБезНДС);
	СохранитьРеквизитВДереве(Данные, "ВсегоПоНакладной.СуммаНДС", ИтоговыеСуммы.СуммаНДС);
	СохранитьРеквизитВДереве(Данные, "ВсегоПоНакладной.СуммаСНДС", ИтоговыеСуммы.СуммаСНДС);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПередачаТоваров_ИнформацияПокупателя
Процедура ЗаполнитьДанныеПередачаТоваров_ИнформацияПокупателя(Знач Основания, Данные, Отказ) Экспорт
	
	СохранитьРеквизитВДереве(Данные, "ДатаПолученияГруза", ИнформацияПокупателяУПД(Основания).ДатаПолученияТоваров);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПриОтраженииВУчетеДокументаПередачаТоваров.
Процедура ПриОтраженииВУчетеДокументаПередачаТоваров(РезультатОтраженияВУчете, Знач ДанныеЭлектронногоДокумента,
	Знач ПараметрыДляОтраженияВУчете) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СпособОбработки = ПараметрыДляОтраженияВУчете.ПараметрыПоФорматуДокумента.СпособОбработки;
	
	СсылкаНаВладельца = Неопределено;
	Если ЗначениеЗаполнено(РезультатОтраженияВУчете.ДокументыУчета) Тогда
		СсылкаНаВладельца = РезультатОтраженияВУчете.ДокументыУчета[0];
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура("ЗаполнятьПоСтуктуре", Истина);
	ДополнитьДанныеЗаполненияВалютой(ДанныеЭлектронногоДокумента, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияВходящимДокументом("ТоварнойНакладной", ДанныеЭлектронногоДокумента, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияКонтрагентомИсточникГруппа(ДанныеЭлектронногоДокумента, ДанныеЗаполнения, "Поставщик");
	ДополнитьДанныеЗаполненияОрганизациейИсточникГруппа(ДанныеЭлектронногоДокумента, ДанныеЗаполнения, "Плательщик");
	ДополнитьДанныеЗаполненияПодразделениемКомпанииИсточникГруппа(ДанныеЭлектронногоДокумента, ДанныеЗаполнения, "Плательщик");
	ДополнитьДанныеЗаполненияДоговорВзаиморасчетов(ДанныеЭлектронногоДокумента, ДанныеЗаполнения);
		
	Если СпособОбработки = "ВозвратТоваровОтКлиента" ИЛИ 
		СпособОбработки = "ВозвратТоваровОтПокупателя" Тогда
		
		ЗаполнитьДокументВозвратТоваровОтПокупателя(ДанныеЗаполнения, СсылкаНаВладельца, Истина, РезультатОтраженияВУчете.ОписаниеОшибки);
		
	Иначе
		ДополнитьДанныеЗаполненияТоварамиТОРГ12(ДанныеЭлектронногоДокумента, ДанныеЗаполнения);
		
		ЗаполнитьДокументПоступленияТоваров(ДанныеЗаполнения, СсылкаНаВладельца, Истина, РезультатОтраженияВУчете.ОписаниеОшибки);
		
	КонецЕсли;
	
	РезультатОтраженияВУчете.ДокументыУчета = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СсылкаНаВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ПередачаРезультатовРабот

// Подготавливает данные для электронного документа Передачи результатов работ (информация продавца)
// по приказу ФНС № ММВ-7-10/552@.
//
// Параметры:
//  СсылкаНаОбъект - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - основание для электронного документа.
//  Настройки - ФиксированнаяСтруктура - настройки заполнения данных:
//   * ТипДокумента - Произвольный - ожидаемый тип документа. Доступные значения представлены следующими свойствами
//                                   результата функции см. ОбменСКонтрагентами.ТипыДокументов:
//                                    - АктВыполненныхРабот.
//  ДеревоДанных - ДеревоЗначений - данные для заполнения электронного документа. Строится по макету 
//                            см. Обработка.ОбменСКонтрагентами.Макет.Акт501_Исполнитель. Выходной параметр.
//  Описание - Структура - дополнительная информация о документе. Выходной параметр.
//   * Основания - Массив из ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - ссылки на дополнительные объекты-основания
//                 электронного документа помимо указанного в параметре "Основание".
//  Отказ - Булево - признак отказа от дальнейшего формирования электронного документа.
//                   Информационное сообщение пользователю необходимо формировать самостоятельно.
//
Процедура ЗаполнитьДанныеПередачаУслуг_ИнформацияПродавца(Знач СсылкаНаОбъект, Знач Настройки, ДеревоДанных, Описание, Отказ) Экспорт
	
	ДанныеДляПечати = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СсылкаНаОбъект)
		.ПолучитьДанныеДляПечатиТОРГ12(СсылкаНаОбъект);        
		
	Если ДанныеДляПечати.ВыборкаТабличнойЧасти <> Неопределено 
		И ТипЗнч(ДанныеДляПечати.ВыборкаТабличнойЧасти) <> Тип("ТаблицаЗначений") Тогда
		ВыборкаТабличнойЧасти = ДанныеДляПечати.ВыборкаТабличнойЧасти.Выгрузить();   
	Иначе
		ВыборкаТабличнойЧасти = ДанныеДляПечати.ВыборкаТабличнойЧасти;
	КонецЕсли;
	
	СохранитьРеквизитВДереве(ДеревоДанных, "НомерАкта",
		УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(СсылкаНаОбъект));
	СохранитьРеквизитВДереве(ДеревоДанных, "ДатаАкта", ДанныеДляПечати.Дата);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияПоВыполнениюУслуг.ДатаИсполнения",
		ДанныеДляПечати.Дата);
			
	ТекстЗаголовка = Нстр("ru = 'Мы, нижеподписавшиеся, представитель ИСПОЛНИТЕЛЯ, с одной стороны и представитель ЗАКАЗЧИКА с другой стороны,
									|составили настоящий акт в том, что ИСПОЛНИТЕЛЬ выполнил, а ЗАКАЗЧИК принял следующие работы (услуги).'");
	СохранитьРеквизитВДереве(ДеревоДанных, "Заголовок", ТекстЗаголовка);
	
	СведенияОПоставщике = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ДанныеДляПечати.Организация, СведенияОПоставщике);
	ЗаполнитьДанныеУчастника(ДеревоДанных, СведенияОПоставщике, "Исполнитель", "Юр", , ДанныеДляПечати.Дата);
	
	Если ЗначениеЗаполнено(СведенияОПоставщике.КПП) Тогда
		
		НаименованиеСоставителяДокумента = СведенияОПоставщике.ПолноеНаименование
			+ СтрШаблон(НСтр("ru = ', ИНН/КПП %1/%2'"), СведенияОПоставщике.ИНН, СведенияОПоставщике.КПП);
		
	Иначе
		
		НаименованиеСоставителяДокумента = СведенияОПоставщике.ПолноеНаименование
			+ СтрШаблон(НСтр("ru = ', ИНН %1'"), СведенияОПоставщике.ИНН);
		
	КонецЕсли;

	ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки(
		ДанныеДляПечати.Организация, "Объект.Организация");
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"НаименованиеСоставителяДокумента",
		НаименованиеСоставителяДокумента,
		ПараметрыОбработкиОшибок
	);
	
	СведенияОПокупателе = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ДанныеДляПечати.Плательщик, СведенияОПокупателе);
	ЗаполнитьДанныеУчастника(ДеревоДанных, СведенияОПокупателе, "Заказчик", "Юр", , ДанныеДляПечати.Дата);
	
	ВалютаКод = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДляПечати.ВалютаДокумента, "Код");
	СохранитьРеквизитВДереве(ДеревоДанных, "ВалютаКод", ВалютаКод);
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВремТаб
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТаб.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК Код,
	|	ВремТаб.НомерСтроки КАК НомерСтроки,
	|	ВремТаб.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	ВремТаб КАК ВремТаб";
	Запрос.УстановитьПараметр("ТаблицаТоваров", ВыборкаТабличнойЧасти);
	ВыборкаЕдиницИзмерения = Запрос.Выполнить().Выгрузить();
	
	ТаблицаУслуг = Новый ТаблицаЗначений();
	ТаблицаУслуг.Колонки.Добавить("ИдТовараУКонтрагента");
	ТаблицаУслуг.Колонки.Добавить("НаименованиеНоменклатуры");
	ТаблицаУслуг.Колонки.Добавить("ЕдиницаИзмеренияНаименование");
	ТаблицаУслуг.Колонки.Добавить("ЕдиницаИзмеренияКод");
	ТаблицаУслуг.Колонки.Добавить("Количество");
	ТаблицаУслуг.Колонки.Добавить("Цена");
	ТаблицаУслуг.Колонки.Добавить("СуммаБезНДС");
	ТаблицаУслуг.Колонки.Добавить("СтавкаНДС");
	ТаблицаУслуг.Колонки.Добавить("СуммаНДС");
	ТаблицаУслуг.Колонки.Добавить("СуммаСНДС");
	ТаблицаУслуг.Колонки.Добавить("Описание");
	ТаблицаУслуг.Колонки.Добавить("ДокументОснование");
	ТаблицаУслуг.Колонки.Добавить("Номенклатура");
	ТаблицаУслуг.Колонки.Добавить("ДопДанныеПодписанные");
	ТаблицаУслуг.Колонки.Добавить("ДопДанныеНеПодписанные");
	ТаблицаУслуг.Колонки.Добавить("Сопоставление");
	
	Для Каждого СтрокаТаблицы Из ВыборкаТабличнойЧасти Цикл
		
		НоваяСтрока = ТаблицаУслуг.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
		НоваяСтрока.НаименованиеНоменклатуры = СтрокаТаблицы.Номенклатура.Наименование;
		НоваяСтрока.Описание = 	НоваяСтрока.НаименованиеНоменклатуры + ?(
			ЗначениеЗаполнено(СтрокаТаблицы.ХарактеристикаНоменклатуры),
			" (" + СтрокаТаблицы.ХарактеристикаНоменклатуры + ")",
			""
		);
		
		НоваяСтрока.СуммаБезНДС = СтрокаТаблицы.СуммаВсего - СтрокаТаблицы.СуммаНДС;
		НоваяСтрока.СуммаСНДС   = СтрокаТаблицы.СуммаВсего;
		БазоваяЕдИзм = ВыборкаЕдиницИзмерения.Найти(СтрокаТаблицы.НомерСтроки, "НомерСтроки");
		
		КодЕдИзмерения = ?(СокрЛП(БазоваяЕдИзм.Код) <> "001", СокрЛП(БазоваяЕдИзм.Код), "0000"); 
		НоваяСтрока.ЕдиницаИзмеренияКод = КодЕдИзмерения;
		
		НоваяСтрока.Сопоставление = СопоставленияНоменклатурыЭД(СтрокаТаблицы.Номенклатура,
			СтрокаТаблицы.ХарактеристикаНоменклатуры, СтрокаТаблицы.ЕдиницаИзмерения);
		
		Если Настройки.ВариантыЗаполненияПолей.ТоварКод = "Артикул" Тогда
				
			НоваяСтрока.ТоварКод = СокрЛП(НоваяСтрока.Артикул);
						
		КонецЕсли;
		
	КонецЦикла;
			
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "ЕдиницаИзмеренияНаименование";
	ОписаниеОшибкиДляТаблицы.ТекстОшибки = НСтр("ru = 'Не заполнена наименование единицы измерения в справочнике ""Номенклатура"".'");
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаУслуг, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "ЕдиницаИзмеренияКод";
	ОписаниеОшибкиДляТаблицы.ТекстОшибки = НСтр("ru = 'Не заполнен код единицы измерения в справочнике ""Номенклатура"".'");
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаУслуг, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "Количество";
	ОписаниеОшибкиДляТаблицы.ТекстОшибки = НСтр("ru = 'Не заполнено количество в табличной части документа.'");
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаУслуг, ОписаниеОшибкиДляТаблицы);
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ТаблицаУслуг, "ТаблицаУслуг");
	
	СохранитьРеквизитВДереве(ДеревоДанных, "ОписаниеУслуги.НачалоРабот", ДанныеДляПечати.Дата);
	СохранитьРеквизитВДереве(ДеревоДанных, "ОписаниеУслуги.КонецРабот",  ДанныеДляПечати.Дата);
	СохранитьРеквизитВДереве(ДеревоДанных, "ОписаниеУслуги.СуммаБезНДСИтого",
		ТаблицаУслуг.Итог("СуммаБезНДС"));
	СохранитьРеквизитВДереве(ДеревоДанных, "ОписаниеУслуги.СуммаНДСИтого",
		ТаблицаУслуг.Итог("СуммаНДС"));
	СохранитьРеквизитВДереве(ДеревоДанных, "ОписаниеУслуги.СуммаСНДСИтого",
		ТаблицаУслуг.Итог("СуммаСНДС"));
	
	СохранитьРеквизитВДереве(ДеревоДанных, "СведенияПоВыполнениюУслуг.ДатаИсполнения",
		ДанныеДляПечати.Дата);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПередачаУслуг_ИнформацияПокупателя
Процедура ЗаполнитьДанныеПередачаУслуг_ИнформацияПокупателя(Знач Основания, Данные, Отказ) Экспорт
	
	Если ЗначениеЗаполнено(Основания) Тогда
		
		СохранитьРеквизитВДереве(Данные, "СведенияПоВыполнениюУслуг.ДатаЗаказа",
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основания[0], "Дата"));
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПриОтраженииВУчетеДокументаПередачаРезультатовРабот.
Процедура ПриОтраженииВУчетеДокументаПередачаРезультатовРабот(РезультатОтраженияВУчете, Знач ДанныеЭлектронногоДокумента,
	Знач ПараметрыДляОтраженияВУчете) Экспорт
	
	СсылкаНаВладельца = Неопределено;
	Если ЗначениеЗаполнено(РезультатОтраженияВУчете.ДокументыУчета) Тогда
		СсылкаНаВладельца = РезультатОтраженияВУчете.ДокументыУчета[0];
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеЗаполнения = Новый Структура("ЗаполнятьПоСтуктуре", Истина);
	ДанныеЗаполнения.Вставить("ХозОперация", Справочники.ХозОперации.УслугиСтороннихОрганизаций);
	ДополнитьДанныеЗаполненияВалютой(ДанныеЭлектронногоДокумента, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияВходящимДокументом("Акта", ДанныеЭлектронногоДокумента, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияКонтрагентомИсточникГруппа(ДанныеЭлектронногоДокумента, ДанныеЗаполнения, "Заказчик");
	ДополнитьДанныеЗаполненияОрганизациейИсточникГруппа(ДанныеЭлектронногоДокумента, ДанныеЗаполнения, "Исполнитель");
	ДополнитьДанныеЗаполненияПодразделениемКомпанииИсточникГруппа(ДанныеЭлектронногоДокумента, ДанныеЗаполнения, "Исполнитель");
	ДополнитьДанныеЗаполненияДоговорВзаиморасчетов(ДанныеЭлектронногоДокумента, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияТоварамиАкт501(ДанныеЭлектронногоДокумента, ДанныеЗаполнения);
	
	ЗаполнитьДокументПоступленияТоваров(ДанныеЗаполнения, СсылкаНаВладельца, Истина, РезультатОтраженияВУчете.ОписаниеОшибки);
	
	РезультатОтраженияВУчете.ДокументыУчета = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СсылкаНаВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область CML_Форматы

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеРеквизитыОрганизации
Процедура ЗаполнитьДанныеРеквизитыОрганизации(СсылкаНаОбъект, Данные, Отказ) Экспорт
	
	СведенияОбОрганизации = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица(); 
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(СсылкаНаОбъект, СведенияОбОрганизации);
	ЗаполнитьДанныеУчастника(Данные, СведенияОбОрганизации, "Организация", "Юр",, ТекущаяДатаСеанса());	
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(Данные, "ДатаФормирования", ТекущаяДатаСеанса());
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(Данные, "Наименование", "Реквизиты "+СсылкаНаОбъект.Наименование);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПоСчету
Процедура ЗаполнитьДанныеПоСчету(СсылкаНаОбъект, ДеревоДокумента, Отказ) Экспорт
	
	ДанныеПоСчета = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СсылкаНаОбъект).ВыгрузитьДанныеДляЭД(СсылкаНаОбъект);
	РеквизитыШапки = ДанныеПоСчета.Шапка;

	СохранитьРеквизитВДереве(ДеревоДокумента, "Номер", РеквизитыШапки.Номер);
	СохранитьРеквизитВДереве(ДеревоДокумента, "Дата", РеквизитыШапки.Дата);
	
	СохранитьРеквизитВДереве(ДеревоДокумента, "Валюта", РеквизитыШапки.ВалютаКод);
	СохранитьРеквизитВДереве(ДеревоДокумента, "Комментарий", РеквизитыШапки.Комментарий);
	СохранитьРеквизитВДереве(ДеревоДокумента, "Курс",
		РаботаСКурсамиВалют.ПолучитьКурсВалюты(РеквизитыШапки.Валюта, РеквизитыШапки.Дата).Курс);
	СохранитьРеквизитВДереве(ДеревоДокумента, "Сумма", РеквизитыШапки.СуммаДокумента);
	
	Если ЗначениеЗаполнено(РеквизитыШапки.ДокументОснование) Тогда
		
		СохранитьРеквизитВДереве(ДеревоДокумента, "ДокументОснования.НомерДокументаОснования",
			РеквизитыШапки.ДокументОснование.Номер);
		СохранитьРеквизитВДереве(ДеревоДокумента, "ДокументОснования.ДатаДокументаОснования",
			XMLСтрока(РеквизитыШапки.ДокументОснование.Дата));
		СохранитьРеквизитВДереве(ДеревоДокумента, "ДокументОснования.НаименованиеДокументаОснования",
			Строка(РеквизитыШапки.ДокументОснование));
		
	КонецЕсли;
	
	СведенияОПоставщике = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(РеквизитыШапки.Организация, СведенияОПоставщике);
	ЗаполнитьДанныеУчастника(ДеревоДокумента, СведенияОПоставщике, "Продавец", "Юр", , РеквизитыШапки.Дата);
	
	СведенияОПокупателе = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(РеквизитыШапки.Контрагент, СведенияОПокупателе);
	ЗаполнитьДанныеУчастника(ДеревоДокумента, СведенияОПокупателе, "Покупатель", "Юр", , РеквизитыШапки.Дата);
	
	СохранитьРеквизитВДереве(ДеревоДокумента, "СрокПлатежа", РеквизитыШапки.ДействителенДо);
	СохранитьРеквизитВДереве(ДеревоДокумента, "ДокументыОснования", РеквизитыШапки.ДокументОснование);
	
	ТаблицаТоваров = ДанныеПоСчета.Товары;
	
	ТаблицаТоваров.Колонки.Добавить("Сопоставление");
	
	Для Каждого Товар Из ТаблицаТоваров Цикл
			
		Товар.Сопоставление = СопоставленияНоменклатурыЭД(Товар.Номенклатура,
			Товар.ХарактеристикаНоменклатуры, Товар.ЕдиницаИзмерения);
		
	КонецЦикла;
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДокумента, ТаблицаТоваров, "Товары");
	
	СохранитьРеквизитВДереве(ДеревоДокумента, "ИтогоПоДокументу.Сумма", ТаблицаТоваров.Итог("Сумма"));
	СохранитьРеквизитВДереве(ДеревоДокумента, "ИтогоПоДокументу.СуммаНДС", ТаблицаТоваров.Итог("СуммаНДС"));
	СохранитьРеквизитВДереве(ДеревоДокумента, "ИтогоПоДокументу.ЦенаВключаетНДС", РеквизитыШапки.ЦенаВключаетНДС);
	
	СуммаБезСкидки = ТаблицаТоваров.Итог("Сумма");
	СуммаСкидки = 0;
	
	Если ТаблицаТоваров.Колонки.Найти("СуммаСкидки") <> Неопределено Тогда
		
		СуммаСкидки = ТаблицаТоваров.Итог("СуммаСкидки");
		
	КонецЕсли;
	
	СуммаБезСкидки = СуммаБезСкидки + СуммаСкидки;
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДокумента,
		"ИтогоПоДокументу.СуммаСкидки",
		СуммаСкидки
	);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДокумента,
		"ИтогоПоДокументу.СуммаБезСкидки",
		СуммаБезСкидки
	);
	
	Если ЗначениеЗаполнено(РеквизитыШапки.БанковскийСчет) Тогда
		
		МассивСчетов = Новый Массив;
		МассивСчетов.Добавить(РеквизитыШапки.БанковскийСчет);
		БанковскиеРеквизиты = Неопределено;
		ПолучитьБанковскиеРеквизиты(МассивСчетов, БанковскиеРеквизиты);
		БанковскиеРеквизиты = БанковскиеРеквизиты[0];
		
		СохранитьРеквизитВДереве(ДеревоДокумента, "РасчетныйСчет.НомерСчета", БанковскиеРеквизиты.РасчетныйСчет);
		СохранитьРеквизитВДереве(ДеревоДокумента, "РасчетныйСчет.Банк.Наименование", БанковскиеРеквизиты.Банк);
		СохранитьРеквизитВДереве(ДеревоДокумента, "РасчетныйСчет.Банк.БИК", БанковскиеРеквизиты.БИК);
		СохранитьРеквизитВДереве(ДеревоДокумента, "РасчетныйСчет.Банк.СчетКорреспондентский",
			БанковскиеРеквизиты.КорреспондентскийСчет);
		
		Если ЗначениеЗаполнено(БанковскиеРеквизиты.Ссылка.БанкДляРасчетов) Тогда
			
			СохранитьРеквизитВДереве(ДеревоДокумента, "РасчетныйСчет.БанкКорреспондент.Наименование",
				БанковскиеРеквизиты.БанкДляРасчетов);
			СохранитьРеквизитВДереве(ДеревоДокумента, "РасчетныйСчет.БанкКорреспондент.СчетКорреспондентский",
				БанковскиеРеквизиты.БанкДляРасчетовКоррСчет);
			СохранитьРеквизитВДереве(ДеревоДокумента, "РасчетныйСчет.БанкКорреспондент.БИК",
				БанковскиеРеквизиты.БанкДляРасчетовБИК);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ИтоговаяСтрока = НСтр("ru='Всего наименований %Количество%, на сумму %Сумма%'");
	ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Количество%", ТаблицаТоваров.Количество());
	ИтоговаяСтрока = СтрЗаменить(
		ИтоговаяСтрока,
		"%Сумма%",
		ФорматСуммСВалютой(РеквизитыШапки.СуммаДокумента, РеквизитыШапки.Валюта)
	);
	ИтоговаяСтрока = ИтоговаяСтрока
		+ Символы.ПС
		+ РаботаСКурсамиВалют.СформироватьСуммуПрописью(РеквизитыШапки.СуммаДокумента, РеквизитыШапки.Валюта);
	СохранитьРеквизитВДереве(ДеревоДокумента, "ИтогиПрописью", ИтоговаяСтрока);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПриОтраженииВУчетеДокументаCML.
Процедура ПриОтраженииВУчетеДокументаCML(РезультатОтраженияВУчете, Знач ДанныеЭлектронногоДокумента,
	Знач ПараметрыДляОтраженияВУчете) Экспорт
	
	ТипыДокументов = ОбменСКонтрагентами.ТипыДокументов();
	ТипДокумента = ПараметрыДляОтраженияВУчете.ПараметрыЭлектронногоДокумента.ТипДокумента;
	
	ПараметрыПоФорматуДокумента = ПараметрыДляОтраженияВУчете.ПараметрыПоФорматуДокумента;
	ДеревоРазбора = ПараметрыПоФорматуДокумента.ДеревоСсылокНаОбъекты;
	
	СсылкаНаВладельца = Неопределено;
	Если ЗначениеЗаполнено(РезультатОтраженияВУчете.ДокументыУчета) Тогда
		СсылкаНаВладельца = РезультатОтраженияВУчете.ДокументыУчета[0];
	КонецЕсли;
	
	НайденныйОбъект = Неопределено;
	//Если ТипДокумента = ТипыДокументов.ТоварнаяНакладная
	//	ИЛИ ТипДокумента = ТипыДокументов.АктВыполненныхРабот
	//	ИЛИ ТипДокумента = ТипыДокументов.АктНаПередачуПрав
	//	ИЛИ ТипДокумента = ТипыДокументов.СоглашениеОбИзмененииСтоимости Тогда
	//	
	//	НайденныйОбъект = НайтиСоздатьПоступлениеТоваровУслуг(ДанныеЭлектронногоДокумента, ДеревоРазбора,
	//		СсылкаНаВладельца, ПараметрыПоФорматуДокумента.СпособОбработки, ПараметрыДляОтраженияВУчете);
	//	
	//ИначеЕсли (ТипДокумента = ТипыДокументов.СчетФактура
	//	ИЛИ ТипДокумента = ТипыДокументов.КорректировочныйСчетФактура) Тогда
	//	
	//	НайденныйОбъект = НайтиСоздатьСчетФактуру(ДанныеЭлектронногоДокумента, ДеревоРазбора, СсылкаНаВладельца);
	//	
	//Иначе
	Если ТипДокумента = ТипыДокументов.КаталогТоваров Тогда
		
		//СохранитьДанныеКаталогаТоваров(ДанныеЭлектронногоДокумента, ДеревоРазбора);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.РеквизитыОрганизации Тогда
		
		//НайденныйОбъект = НовыйКонтрагент(ДанныеЭлектронногоДокумента, ДеревоРазбора, СсылкаНаВладельца)
		
	ИначеЕсли ТипДокумента = ТипыДокументов.ЗаказТовара Тогда
		
		НайденныйОбъект = НайтиСоздатьЗаказПокупателя(ДанныеЭлектронногоДокумента, ДеревоРазбора, СсылкаНаВладельца,
			ПараметрыДляОтраженияВУчете);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.ОтветНаЗаказ Тогда
		
		НайденныйОбъект = НайтиСоздатьЗаказПоставщику(ДанныеЭлектронногоДокумента, ДеревоРазбора, СсылкаНаВладельца,
			ПараметрыДляОтраженияВУчете);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СчетНаОплату Тогда
		
		НайденныйОбъект = НайтиСоздатьСчетОтПоставщика(ДанныеЭлектронногоДокумента, ДеревоРазбора, СсылкаНаВладельца,
			ПараметрыДляОтраженияВУчете);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.ПрайсЛист Тогда
		
		//НайденныйОбъект = ПрайсЛист(ДанныеЭлектронногоДокумента, ДеревоРазбора, СсылкаНаВладельца);
		
	ИначеЕсли ТипДокумента = ТипыДокументов.ОтчетОСписанииКомиссионногоТовара Тогда
	//	
	//	НайденныйОбъект = ОтчетОСписанииКомиссионногоТовара(ДанныеЭлектронногоДокумента, ДеревоРазбора, СсылкаНаВладельца);
	//	
	ИначеЕсли ТипДокумента = ТипыДокументов.ОтчетОПродажахКомиссионногоТовара
		Или ТипДокумента = ТипыДокументов.ОтчетОСписанииКомиссионногоТовара Тогда 
	//	
	//	НайденныйОбъект = НайтиСоздатьОтчетОПродажахКомиссионногоТовара(ДанныеЭлектронногоДокумента, ДеревоРазбора,
	//		СсылкаНаВладельца);
	//	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденныйОбъект) Тогда
		РезультатОтраженияВУчете.ДокументыУчета = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НайденныйОбъект);
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПоЗаказуТоваров
Процедура ЗаполнитьДанныеПоЗаказуТоваров(СсылкаНаОбъект, ДеревоДокумента, Отказ) Экспорт
	
	ЗаказПоставщику = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СсылкаНаОбъект).ВыгрузитьДанныеДляЭД(СсылкаНаОбъект);
	СохранитьРеквизитВДереве(ДеревоДокумента, "Валюта", ЗаказПоставщику.Шапка.ВалютаКод);
	СохранитьРеквизитВДереве(ДеревоДокумента, "Курс",
		РаботаСКурсамиВалют.ПолучитьКурсВалюты(ЗаказПоставщику.Шапка.Валюта, ЗаказПоставщику.Шапка.Дата).Курс);	
	СохранитьРеквизитВДереве(ДеревоДокумента, "Сумма", ЗаказПоставщику.Шапка.СуммаДокумента);
	СохранитьРеквизитВДереве(ДеревоДокумента, "Комментарий", ЗаказПоставщику.Шапка.Комментарий);
	СохранитьРеквизитВДереве(ДеревоДокумента, "ДокументыОснования", ЗаказПоставщику.Шапка.ДокументОснование);
	
	СведенияОПоставщике = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ЗаказПоставщику.Шапка.Контрагент,
		СведенияОПоставщике);
	ЗаполнитьДанныеУчастника(
		ДеревоДокумента,
		СведенияОПоставщике,
		"Продавец",
		"Юр",
		,
		ЗаказПоставщику.Шапка.Дата
	);
	
	СведенияОПокупателе = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ЗаказПоставщику.Шапка.Организация,
		СведенияОПокупателе);
	ЗаполнитьДанныеУчастника(
		ДеревоДокумента,
		СведенияОПокупателе,
		"Получатель",
		"Юр",
		,
		ЗаказПоставщику.Шапка.Дата
	);
	ЗаполнитьДанныеУчастника(
		ДеревоДокумента,
		СведенияОПокупателе,
		"Покупатель",
		"Юр",
		,
		ЗаказПоставщику.Шапка.Дата
	);
	ЗаполнитьДоговор(ДеревоДокумента, ЗаказПоставщику.Шапка);
	
	ТоварыВЗаказеПоставщику = НовыеТоварыВЗаказеПоставщику();
	
	ШтрихкодыКомбинаций = Неопределено;
	ШтрихкодыНоменклатуры = Неопределено;
	ШтрихкодыПоТоварам(ЗаказПоставщику.Товары, ШтрихкодыКомбинаций, ШтрихкодыНоменклатуры);
	
	Для Каждого СтрокаТаблицы Из ЗаказПоставщику.Товары Цикл
		
		НоваяСтрока = ТоварыВЗаказеПоставщику.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
		НоваяСтрока.Сопоставление = СопоставленияНоменклатурыЭД(СтрокаТаблицы.Номенклатура,
			СтрокаТаблицы.ХарактеристикаНоменклатуры, СтрокаТаблицы.ЕдиницаИзмерения);
			
		ЗаполнитьШтрихкодыТоваровВСопоставление(
			НоваяСтрока.Сопоставление,
			ШтрихкодыНоменклатуры,
			ШтрихкодыКомбинаций,
			СтрокаТаблицы.Номенклатура,
			СтрокаТаблицы.ХарактеристикаНоменклатуры,
			СтрокаТаблицы.ЕдиницаИзмерения
		);
		
	КонецЦикла;
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДокумента, ТоварыВЗаказеПоставщику, "Товары");
	
	СохранитьРеквизитВДереве(ДеревоДокумента, "ИтогоПоДокументу.СуммаИтог", ТоварыВЗаказеПоставщику.Итог("Сумма"));
	СохранитьРеквизитВДереве(ДеревоДокумента, "ИтогоПоДокументу.СуммаНалогаИтог",
		ТоварыВЗаказеПоставщику.Итог("СуммаНДС"));
	СохранитьРеквизитВДереве(ДеревоДокумента, "ИтогоПоДокументу.ЦенаВключаетНДС", ЗаказПоставщику.Шапка.ЦенаВключаетНДС);
	ИтоговаяСтрока = СтрШаблон(
		НСтр("ru='Всего наименований %1, на сумму %2'"),
		ТоварыВЗаказеПоставщику.Количество(), 
		ФорматСуммСВалютой(ЗаказПоставщику.Шапка.СуммаДокумента, ЗаказПоставщику.Шапка.Валюта)
	);
	
	СуммаПрописью  = РаботаСКурсамиВалют.СформироватьСуммуПрописью(
		ЗаказПоставщику.Шапка.СуммаДокумента,
		ЗаказПоставщику.Шапка.Валюта
	);
	ИтоговаяСтрока = ИтоговаяСтрока + Символы.ПС + СуммаПрописью;
	СохранитьРеквизитВДереве(ДеревоДокумента, "ИтогиПрописью", ИтоговаяСтрока);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеПоОтветуНаЗаказ
Процедура ЗаполнитьДанныеПоОтветуНаЗаказ(СсылкаНаОбъект, ДеревоДокумента, Отказ) Экспорт
	
	ЗаказПокупателя = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СсылкаНаОбъект).ВыгрузитьДанныеДляЭД(СсылкаНаОбъект);
	СохранитьРеквизитВДереве(ДеревоДокумента, "Валюта", ЗаказПокупателя.Шапка.ВалютаКод);
	СохранитьРеквизитВДереве(ДеревоДокумента, "Курс",
		РаботаСКурсамиВалют.ПолучитьКурсВалюты(ЗаказПокупателя.Шапка.Валюта, ЗаказПокупателя.Шапка.Дата).Курс);	
	СохранитьРеквизитВДереве(ДеревоДокумента, "Сумма", ЗаказПокупателя.Шапка.СуммаДокумента);
	СохранитьРеквизитВДереве(ДеревоДокумента, "Комментарий", ЗаказПокупателя.Шапка.Комментарий);
	СохранитьРеквизитВДереве(ДеревоДокумента, "ДокументыОснования", ЗаказПокупателя.Шапка.ДокументОснование);
	
	СведенияОПоставщике = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ЗаказПокупателя.Шапка.Организация,
		СведенияОПоставщике);
	ЗаполнитьДанныеУчастника(
		ДеревоДокумента,
		СведенияОПоставщике,
		"Продавец",
		"Юр",
		,
		ЗаказПокупателя.Шапка.Дата
	);

	Получатель = УправлениеСвойствами.ЗначениеСвойства(СсылкаНаОбъект, 
		ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ЗаказчикКонтрагент);
	Если Не ЗначениеЗаполнено(Получатель) Тогда
		Получатель = ЗаказПокупателя.Шапка.Контрагент;
	КонецЕсли;
	
	СведенияОПолучателе = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Получатель,
		СведенияОПолучателе);
	ЗаполнитьДанныеУчастника(
		ДеревоДокумента,
		СведенияОПолучателе,
		"Получатель",
		"Юр",
		,
		ЗаказПокупателя.Шапка.Дата
	);
	
	СведенияОПокупателе = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ЗаказПокупателя.Шапка.Контрагент, 
		СведенияОПокупателе);
	ЗаполнитьДанныеУчастника(
		ДеревоДокумента, 
		СведенияОПокупателе, 
		"Покупатель", 
		"Юр", 
		, 
		ЗаказПокупателя.Шапка.Дата);

	ЗаполнитьДоговор(ДеревоДокумента, ЗаказПокупателя.Шапка);
	
	ТоварыВЗаказеПокупателя = НовыеТоварыВЗаказеПоставщику();
	
	ШтрихкодыКомбинаций = Неопределено;
	ШтрихкодыНоменклатуры = Неопределено;
	ШтрихкодыПоТоварам(ЗаказПокупателя.Товары, ШтрихкодыКомбинаций, ШтрихкодыНоменклатуры);
	
	Для Каждого СтрокаТаблицы Из ЗаказПокупателя.Товары Цикл
		
		НоваяСтрока = ТоварыВЗаказеПокупателя.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
		НоваяСтрока.Сопоставление = СопоставленияНоменклатурыЭД(СтрокаТаблицы.Номенклатура,
			СтрокаТаблицы.ХарактеристикаНоменклатуры, СтрокаТаблицы.ЕдиницаИзмерения);
			
		ЗаполнитьШтрихкодыТоваровВСопоставление(
			НоваяСтрока.Сопоставление,
			ШтрихкодыНоменклатуры,
			ШтрихкодыКомбинаций,
			СтрокаТаблицы.Номенклатура,
			СтрокаТаблицы.ХарактеристикаНоменклатуры,
			СтрокаТаблицы.ЕдиницаИзмерения
		);
		
	КонецЦикла;
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДокумента, ТоварыВЗаказеПокупателя, "Товары");
	
	СохранитьРеквизитВДереве(ДеревоДокумента, "ИтогоПоДокументу.СуммаИтог", ТоварыВЗаказеПокупателя.Итог("Сумма"));
	СохранитьРеквизитВДереве(ДеревоДокумента, "ИтогоПоДокументу.СуммаНалогаИтог",
		ТоварыВЗаказеПокупателя.Итог("СуммаНДС"));
	СохранитьРеквизитВДереве(ДеревоДокумента, "ИтогоПоДокументу.ЦенаВключаетНДС", ЗаказПокупателя.Шапка.ЦенаВключаетНДС);
	ИтоговаяСтрока = СтрШаблон(
		НСтр("ru='Всего наименований %1, на сумму %2'"),
		ТоварыВЗаказеПокупателя.Количество(), 
		ФорматСуммСВалютой(ЗаказПокупателя.Шапка.СуммаДокумента, ЗаказПокупателя.Шапка.Валюта)
	);
	
	СуммаПрописью  = РаботаСКурсамиВалют.СформироватьСуммуПрописью(
		ЗаказПокупателя.Шапка.СуммаДокумента,
		ЗаказПокупателя.Шапка.Валюта
	);
	ИтоговаяСтрока = ИтоговаяСтрока + Символы.ПС + СуммаПрописью;
	СохранитьРеквизитВДереве(ДеревоДокумента, "ИтогиПрописью", ИтоговаяСтрока);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.СоздатьОбъектВБД
Процедура СоздатьОбъектВБД(СтрокаОбъекта, ДеревоРазбора, НовыйЭлемент) Экспорт
	
	Если СтрокаОбъекта.ОписаниеТипа = "СправочникСсылка.Организации" Тогда
		
		НовыйЭлемент = ИнтеграцияЭДО.СсылкаНаОбъектПоИННКПП(
			"Организации", 
			ПолучитьЗначениеРеквизитаДерева(СтрокаОбъекта, "ИНН", Истина, ДеревоРазбора), 
			ПолучитьЗначениеРеквизитаДерева(СтрокаОбъекта, "КПП", Истина, ДеревоРазбора)
		);
		
	ИначеЕсли СтрокаОбъекта.ОписаниеТипа = "СправочникСсылка.Контрагенты" Тогда
		
		НовыйЭлемент = ИнтеграцияЭДО.СсылкаНаОбъектПоИННКПП(
			"Контрагенты",
			ПолучитьЗначениеРеквизитаДерева(СтрокаОбъекта, "ИНН", Истина, ДеревоРазбора), 
			ПолучитьЗначениеРеквизитаДерева(СтрокаОбъекта, "КПП", Истина, ДеревоРазбора)
		);
		
	ИначеЕсли СтрокаОбъекта.ОписаниеТипа = "СправочникСсылка.БанковскиеСчета" Тогда
		
		НовыйЭлемент = СоздатьБанковскийСчет(СтрокаОбъекта, "Банковские счета", ДеревоРазбора);
		
	ИначеЕсли СтрокаОбъекта.ОписаниеТипа = "СправочникСсылка.НоменклатураКонтрагентов" Тогда
		
		НовыйЭлемент = СоздатьПерезаполнитьНоменклатуруКонтрагентов(СтрокаОбъекта, ДеревоРазбора);
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьТаблицуПорядкаСозданияТиповОбъектов
Процедура ЗаполнитьТаблицуПорядкаСозданияТиповОбъектов(Таблица) Экспорт
	
	НовСтрока = Таблица.Добавить();
	НовСтрока.ТипОбъекта 	= "Организации";
	НовСтрока.Порядок 		= 1;
	
	НовСтрока = Таблица.Добавить();
	НовСтрока.ТипОбъекта 	= "Контрагенты";
	НовСтрока.Порядок 		= 2;
	
	НовСтрока = Таблица.Добавить();
	НовСтрока.ТипОбъекта 	= "Валюты";
	НовСтрока.Порядок 		= 3;
	
	НовСтрока = Таблица.Добавить();
	НовСтрока.ТипОбъекта 	= "БанковскиеСчетаКонтрагентов";
	НовСтрока.Порядок 		= 4;
	
КонецПроцедуры

#КонецОбласти

#Область АктОРасхождениях_2019

// См. ОбменСКонтрагентамиПереопределяемый.ПриОтраженииВУчетеДокументаАктОРасхождениях_ФНС_2019.
Процедура ПриОтраженииВУчетеДокументаАктОРасхождениях_ФНС_2019(РезультатОтраженияВУчете, Знач ДанныеЭлектронногоДокумента,
	Знач ПараметрыДляОтраженияВУчете) Экспорт
	
	СсылкаНаВладельца = Неопределено;
	Если ЗначениеЗаполнено(РезультатОтраженияВУчете.ДокументыУчета) Тогда
		СсылкаНаВладельца = РезультатОтраженияВУчете.ДокументыУчета[0];
	КонецЕсли;
	
	СпособОбработки = ПараметрыДляОтраженияВУчете.ПараметрыПоФорматуДокумента.СпособОбработки;
	
	НачатьТранзакцию();
	
	Попытка
		
		НайтиСоздатьАктОРасхождениях_2019(
			ДанныеЭлектронногоДокумента,
			СсылкаНаВладельца,
			СпособОбработки,
			РезультатОтраженияВУчете.ОписаниеОшибки
		);
		
		ЗафиксироватьТранзакцию();
	Исключение
		
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		РезультатОтраженияВУчете.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		ЭлектронноеВзаимодействие.ОбработатьОшибку(
			НСтр("ru = 'Создание Акта о расхождениях в формате 2019 года''"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке),
			РезультатОтраженияВУчете.ОписаниеОшибки
		);
		
	КонецПопытки;
	
	РезультатОтраженияВУчете.ДокументыУчета = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СсылкаНаВладельца);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// См. РаботаСКонтрагентамиПереопределяемый.ЗаполнитьИдентификаторКонфигурации.
Процедура ЗаполнитьИдентификаторКонфигурации(ИдентификаторКонфигурации) Экспорт
	
	ИдентификаторКонфигурации = "TKPS";
	
КонецПроцедуры

// См. ОбменСКонтрагентамиПереопределяемый.ПриОпределенииПараметровПомощникаПодключенияЭДО
Процедура ПриОпределенииПараметровПомощникаПодключенияЭДО(ПараметрыПомощника) Экспорт
	
	//Если ТорговыйКомплексЭДО.ИспользуетсяЛегкийКлиентЭДО() Тогда
	//	ПараметрыПомощника.ЗаполнятьРеквизитыПоИНН = Истина;
	//КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьПерезаполнитьНоменклатуруКонтрагентов(СтрокаОбъекта, ДеревоРазбора) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(СтрокаОбъекта.СсылкаНаОбъект) Тогда
		СправочникОбъект = СтрокаОбъекта.СсылкаНаОбъект.ПолучитьОбъект();
		Попытка
			СправочникОбъект.Заблокировать();
		Исключение
			ТекстИсключенияЗаписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось изменить данные номенклатуры контрагента ""%1"".
			|Возможно, номенклатура контрагента редактируется другим пользователем'"),
			СправочникОбъект.Наименование);
			ВызватьИсключение ТекстИсключенияЗаписи;
		КонецПопытки;
		СсылкаНаОбъектНоменклатура = СтрокаОбъекта.СсылкаНаОбъект.Номенклатура;
	Иначе
		СправочникОбъект = Справочники.НоменклатураКонтрагентов.СоздатьЭлемент();
		СсылкаНаОбъектНоменклатура = Неопределено;
	КонецЕсли;
	
	ЗаполненнаяСтрока = Новый Структура;
	Для Каждого ТекущаяСтрока Из СтрокаОбъекта.Строки Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ЗначениеРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.СсылкаНаОбъект) Тогда
			ЗаполненнаяСтрока.Вставить(ТекущаяСтрока.Реквизит, ТекущаяСтрока.СсылкаНаОбъект);
		Иначе
			ЗаполненнаяСтрока.Вставить(ТекущаяСтрока.Реквизит, ТекущаяСтрока.ЗначениеРеквизита);
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СправочникОбъект, ЗаполненнаяСтрока);
	
	// если нет ссылки на номенклатуру, то будем создавать ее
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъектНоменклатура) Тогда 
		НайденнаяСтрока = СтрокаОбъекта.Строки.Найти("Номенклатура", "Реквизит", Истина);
		Если НайденнаяСтрока <> Неопределено Тогда
			Если ЗначениеЗаполнено(НайденнаяСтрока.СсылкаНаОбъект) Тогда // Найдена ссылка
				СсылкаНаОбъектНоменклатура = НайденнаяСтрока.СсылкаНаОбъект;
			Иначе // будем искать по индексу
				ИндексИскомойСтроки = НайденнаяСтрока.ЗначениеРеквизита;
				НайденнаяСтрока = ДеревоРазбора.Строки.Найти(ИндексИскомойСтроки, "ИндексСтроки", Истина); // строка с объектом
				Если НайденнаяСтрока <> Неопределено Тогда
					Если ЗначениеЗаполнено(НайденнаяСтрока.СсылкаНаОбъект) Тогда // есть ссылка на объект БД
						СсылкаНаОбъектНоменклатура = НайденнаяСтрока.СсылкаНаОбъект;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		СправочникОбъект.Номенклатура = СсылкаНаОбъектНоменклатура;
		// Заполняем идентификатор номенклатуры поставщика, если он получен в реквизите Ид
		СтрокаИд = СтрокаОбъекта.Строки.Найти("Ид", "Реквизит", Истина);
		Если НЕ ЗначениеЗаполнено(СправочникОбъект.Идентификатор) И ЗначениеЗаполнено(СтрокаИд) Тогда
			СправочникОбъект.Идентификатор = СтрокаИд.ЗначениеРеквизита;
		КонецЕсли;
		// Заполнение найденного поставщика (владельца, тип Справочник.Партнеры)
		СтрокиПартнеры = ДеревоРазбора.Строки.Найти("Партнеры", "ТипОбъекта", Истина);
		Если СтрокиПартнеры <> Неопределено и СтрокиПартнеры.Строки.Количество() = 1 Тогда
			СправочникОбъект.Владелец = СтрокиПартнеры.Строки[0].СсылкаНаОбъект;
		Иначе
			СтрокиКонтрагент = ДеревоРазбора.Строки.Найти("Контрагенты", "ТипОбъекта", Истина);
			Если СтрокиКонтрагент <> Неопределено И СтрокиКонтрагент.Строки.Количество() = 1 Тогда
				СправочникОбъект.Владелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокиКонтрагент.Строки[0].СсылкаНаОбъект, "Партнер");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СправочникОбъект.Код) Тогда
		СправочникОбъект.УстановитьНовыйКод();
	КонецЕсли;
	//
	СправочникОбъект.ОбменДанными.Загрузка = Истина;
	Попытка
		СправочникОбъект.Записать();
		СправочникОбъект.Разблокировать();
	Исключение
		Текст = НСтр("ru = 'Создание элемента справочника ""Номенклатура поставщиков"".'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	СсылкаНаОбъект = СправочникОбъект.Ссылка;
	
	Возврат СсылкаНаОбъект;
	
КонецФункции

#Область ТЭДО

#Область Беларусь

// см. ОбменСКонтрагентамиПереопределяемый.ПриОтраженииВУчетеДокументаТЭДО
Процедура ПриОтраженииВУчетеТоварнойНакладнойРБ(ДокументУчета, СпособОбработки, ДанныеТЭДО, ОписаниеОшибки)
	
	Если СпособОбработки = "ПоступлениеТоваровУслуг" Тогда
		
		DeliveryNote = ДанныеТЭДО.ОбъектXDTO;
		Если ЗначениеЗаполнено(ДокументУчета) Тогда
			ДокументОбъект = ДокументУчета.ПолучитьОбъект();
		Иначе
			ДокументОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
			ДокументОбъект.Заполнить();
			ДокументОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.Автор = Пользователи.ТекущийПользователь();
		
		ДокументОбъект.ВхДокНомер = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(DeliveryNote, "DeliveryNoteID");
		DeliveryNoteDate = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(DeliveryNote, "DeliveryNoteDate");
		ДокументОбъект.ВхДокДата = Дата(Формат(DeliveryNoteDate, "ЧГ=;"));
		//ВхСФНомер
		Currency = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(DeliveryNote, "Currency");
		Валюты = РаботаСКурсамиВалют.ДобавитьВалютыПоКоду(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Currency));
		Если ЗначениеЗаполнено(Валюты) Тогда
			ДокументОбъект.ВалютаДокумента = Валюты[0];
		КонецЕсли;
		
		ShipperName = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(DeliveryNote, "Shipper.Name");
		ShipperGLN = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(DeliveryNote, "Shipper.GLN");
		
		ДанныеПоиска = Новый Структура("ИНН, КПП", "", "");
		ДанныеПоиска.Вставить("Наименование", ShipperName);
		ДанныеПоиска.Вставить("GLN", ShipperGLN);
		
		ДокументОбъект.Контрагент = КонтрагентПоРеквизитам(ДанныеПоиска);
		
		ReceiverName = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(DeliveryNote, "Receiver.Name");
		ReceiverVATRegistrationNumber =
			РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(DeliveryNote, "Receiver.VATRegistrationNumber");
		ДанныеПоиска = Новый Структура("ИНН, Наименование", ReceiverVATRegistrationNumber, ReceiverName);
		ДокументОбъект.Организация = ОрганизацияПоРеквизитам(ДанныеПоиска);
		
		ДокументОбъект.Грузоотправитель = ДокументОбъект.Контрагент;
		
		ДокументОбъект.Товары.Очистить();
		ДокументОбъект.Марки.Очистить();
		
		LineItems = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(DeliveryNote, "DespatchAdviceLogisticUnitLineItem.LineItem");
		
		ПараметрыДействия = Документы.ПоступлениеТоваров.ПолучитьПараметрыДействия(ДокументОбъект);
		
		Для Каждого LineItem Из LineItems Цикл
			
			НоваяСтрока = ДокументОбъект.Товары.Добавить();
			
			Номенклатура = ДанныеТЭДО.Номенклатура.Получить(НоваяСтрока.НомерСтроки);
			Если Номенклатура <> Неопределено Тогда
				НоваяСтрока.Номенклатура = Номенклатура.Номенклатура;
				НоваяСтрока.ЕдиницаИзмерения = Номенклатура.Упаковка;
				НоваяСтрока.ХарактеристикаНоменклатуры = Номенклатура.Характеристика;
				Документы.ПоступлениеТоваров.ТоварыНоменклатураПриИзменении(ДокументОбъект, НоваяСтрока, ПараметрыДействия);
			КонецЕсли;
			
			//НоваяСтрока.НаименованиеПоставщика = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(LineItem, "LineItemName");
			НоваяСтрока.Количество = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(LineItem, "QuantityDespatched");
			//НоваяСтрока.КодТНВЭД = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(LineItem, "LineItemItemCustomCode");
			НоваяСтрока.СуммаВсего = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(LineItem, "LineItemAmount");
			Документы.ПоступлениеТоваров.ТоварыСуммаВсегоПриИзменении(ДокументОбъект, НоваяСтрока, ПараметрыДействия);
			//НоваяСтрока.Сумма = НоваяСтрока.СуммаСНДС;
			//НоваяСтрока.Цена = НоваяСтрока.Сумма / НоваяСтрока.КоличествоУпаковок;
			
		КонецЦикла;
		
		ДокументОбъект.Записать();
		Если НЕ ЗначениеЗаполнено(ДокументУчета) Тогда
			ДокументУчета = ДокументОбъект.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область УКД2020

#Область Отправка

Функция ДайДанныеСчетаФактурыДляУКД_2020(СчетФактура)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураВыданный.Ссылка КАК СчетФактура,
		|	СчетФактураВыданный.ДокументОснование КАК ДокументКорректировки,
		|	СчетФактураВыданный.Номер КАК Номер,
		|	СчетФактураВыданный.Дата КАК Дата,
		|	СчетФактураВыданный.ДоговорВзаиморасчетов КАК Договор,
		|	СчетФактураВыданный.ДоговорВзаиморасчетов.ДатаНачала КАК ДоговорДата,
		|	СчетФактураВыданный.ДоговорВзаиморасчетов.НомерДоговора КАК ДоговорНомер,
		|	СчетФактураВыданный.Исправление КАК Исправление,
		|	СчетФактураВыданный.НомерИсправления КАК НомерИсправления,
		|	СчетФактураВыданный.Дата КАК ДатаИсправления,
		|	СчетФактураВыданный.ЕстьКорректировка КАК ЕстьКорректировка,
		|	СчетФактураВыданный.НомерИсправляемогоКорректировочногоДокумента КАК НомерИсправляемогоКорректировочногоДокумента,
		|	СчетФактураВыданный.ДатаИсправляемогоКорректировочногоДокумента КАК ДатаИсправляемогоКорректировочногоДокумента,
		|	СчетФактураВыданный.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
		|	СчетФактураВыданный.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
		|	СчетФактураВыданный.УчитыватьИсправлениеИсходногоДокумента КАК УчитыватьИсправлениеИсходногоДокумента,
		|	СчетФактураВыданный.НомерИсправленияИсходногоДокумента КАК НомерИсправленияИсходногоДокумента,
		|	СчетФактураВыданный.ДатаИсправленияИсходногоДокумента КАК ДатаИсправленияИсходногоДокумента,
		|	СчетФактураВыданный.Организация КАК Организация,
		|	СчетФактураВыданный.Организация КАК ЮрФизЛицо,
		|	СчетФактураВыданный.Организация КАК Поставщик,
		|	ВЫБОР
		|		КОГДА СчетФактураВыданный.Контрагент.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			СчетФактураВыданный.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ
		|			СчетФактураВыданный.Контрагент
		|	КОНЕЦ КАК Покупатель,
		|	ВЫБОР
		|		КОГДА СчетФактураВыданный.Контрагент.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			СчетФактураВыданный.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ
		|			СчетФактураВыданный.Контрагент
		|	КОНЕЦ КАК Плательщик,
		|	ВЫБОР
		|		КОГДА СчетФактураВыданный.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			СчетФактураВыданный.Грузоотправитель
		|		КОГДА (НЕ ВЫРАЗИТЬ(СчетФактураВыданный.ПодразделениеКомпании.КПП КАК Строка(2)) = """") И 
		|			(НЕ СчетФактураВыданный.ПодразделениеКомпании.КПП = СчетФактураВыданный.Организация.КПП) ТОГДА
		|			СчетФактураВыданный.ПодразделениеКомпании
		|		ИНАЧЕ
		|			СчетФактураВыданный.Организация
		|	КОНЕЦ КАК Грузоотправитель,
		|	ВЫБОР
		|		КОГДА СчетФактураВыданный.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			СчетФактураВыданный.Грузополучатель
		|		ИНАЧЕ
		|			СчетФактураВыданный.Контрагент
		|	КОНЕЦ КАК Грузополучатель,
		|	СчетФактураВыданный.ПодразделениеКомпании.Наименование КАК ПодразделениеНаименование,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(СчетФактураВыданный.ПодразделениеКомпании.КПП КАК Строка(2)) = """" ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|	КОНЕЦ КАК ЭтоСтруктурноеПодразделение,
		|	NULL КАК Сделка,
		|	СчетФактураВыданный.ДокументОснование.Менеджер КАК Менеджер,
		|	СчетФактураВыданный.ДоговорВзаиморасчетов.Наименование КАК ДокументОснованиеНаименование,
		|	СчетФактураВыданный.ДокументОснование.Номер КАК ДокументОснованиеНомер,
		|	СчетФактураВыданный.ДокументОснование.Дата КАК ДокументОснованиеДата,
		|	СчетФактураВыданный.ПодразделениеКомпании КАК Подразделение,
		|	СчетФактураВыданный.ВалютаДокумента КАК ВалютаДокумента,
		|	СчетФактураВыданный.КурсДокумента КАК Курс,
		|	СчетФактураВыданный.ТипЦен.ЦенаВключаетНДС КАК СуммаВключаетНДС,
		|	СчетФактураВыданный.ДокументОснование.Менеджер КАК ОтпускПроизвел,
		|	СчетФактураВыданный.Организация.ИНН КАК ИННпоставщика,
		|	СчетФактураВыданный.Организация.КПП КАК КППпоставщика,
		|	СчетФактураВыданный.Контрагент.ИНН КАК ИННпокупателя,
		|	СчетФактураВыданный.Контрагент.КПП КАК КППпокупателя,
		|	СчетФактураВыданный.ХозОперация КАК ХозОперация,
		|	СчетФактураВыданный.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияТоваровКомиссия) КАК ЭтоКомиссия,
		|	СчетФактураВыданный.Ссылка КАК Ссылка,
		|	СчетФактураВыданный.ВалютаДокумента.Код КАК КодВалюты,
		|	СчетФактураВыданный.ВалютаДокумента.Наименование КАК НаименованиеВалюты,
		|	СчетФактураВыданный.ВалютаДокумента.НаименованиеПолное КАК НаименованиеПолноеВалюты,
		|	СчетФактураВыданный.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
		|	СчетФактураВыданный.ДоговорВзаиморасчетов.ДатаНачала КАК ДатаДоговора,
		|	СчетФактураВыданный.ДоговорВзаиморасчетов.НомерДоговора КАК НомерДоговора,
		|	СчетФактураВыданный.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосударственногоКонтракта,
		|	СчетФактураВыданный.ДокументОснование КАК ДокументОснование,
		|	СчетФактураВыданный.ДокументОснование КАК ДокументСМаркировкамиПосле,
		|	СчетФактураВыданный.ДокументОснование.ДокументОснование КАК ДокументСМаркировкамиДо
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Ссылка = &СчетФактура
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураВыданныйДокументыОснования.ДокументОснование КАК ДокументОснование,
		|	СчетФактураВыданныйДокументыОснования.ДокументОснование.ДокументОснование КАК ДокументОснованиеКорректировки
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|ГДЕ
		|	СчетФактураВыданныйДокументыОснования.Ссылка = &СчетФактура
		|");
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	
	РезультатПакетаЗапросов = Запрос.ВыполнитьПакет();
	Шапка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатПакетаЗапросов[0].Выгрузить()[0]);
	
	ОснованияКорректировок = РезультатПакетаЗапросов[1].Выгрузить();
	ДокументыОснования = ОснованияКорректировок.ВыгрузитьКолонку("ДокументОснование");
	Если ЗначениеЗаполнено(Шапка.ДокументОснование) И ДокументыОснования.Найти(Шапка.ДокументОснование) = Неопределено Тогда
		ДокументыОснования.Вставить(0, Шапка.ДокументОснование);
		НоваяСтрока = ОснованияКорректировок.Добавить();
		НоваяСтрока.ДокументОснование              = Шапка.ДокументОснование;
		НоваяСтрока.ДокументОснованиеКорректировки = Шапка.ДокументСМаркировкамиДо;
	КонецЕсли;
	
	ТоварыИзСчетФактуры = Документы.СчетФактураВыданный.ТоварыИзСчетФактуры(СчетФактура);
	
	Результат = Новый Структура();
	Результат.Вставить("ТоварыИзСчетФактуры",    ТоварыИзСчетФактуры);
	Результат.Вставить("ДокументыОснования",     ДокументыОснования);
	Результат.Вставить("ОснованияКорректировок", ОснованияКорректировок);
	Результат.Вставить("Шапка",                  Шапка);
	
	Если ТоварыИзСчетФактуры Тогда
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИСТИНА КАК Товар,
			|	КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
			|	КорректировкаРеализацииТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
			|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ВЫБОР
			|		КОГДА КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|			ТОГДА КорректировкаРеализацииТовары.Номенклатура.Наименование + "" "" + КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры.Наименование
			|		ИНАЧЕ КорректировкаРеализацииТовары.Номенклатура.Наименование
			|	КОНЕЦ КАК ТоварНаименование,
			|	КорректировкаРеализацииТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
			|	КорректировкаРеализацииТовары.Номенклатура.Код КАК НоменклатураКод,
			|	КорректировкаРеализацииТовары.Количество КАК Количество,
			|	КорректировкаРеализацииТовары.КоличествоПоДокументуРеализации КАК КоличествоДоКорректировки,
			|	КорректировкаРеализацииТовары.КоличествоРазница КАК КоличествоРазница,
			|	КорректировкаРеализацииТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	КорректировкаРеализацииТовары.ЕдиницаИзмеренияПоДокументуРеализации КАК ЕдиницаИзмеренияПоДокументуРеализации,
			|	КорректировкаРеализацииТовары.Коэффициент КАК Коэффициент,
			|	КорректировкаРеализацииТовары.КоэффициентПоДокументуРеализации КАК КоэффициентПоДокументуРеализации,
			|	КорректировкаРеализацииТовары.Цена КАК Цена,
			|	КорректировкаРеализацииТовары.Сумма КАК Сумма,
			|	КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
			|	КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС,
			|	КорректировкаРеализацииТовары.СуммаНДСПоДокументуРеализации КАК СуммаНДСПоДокументуРеализации,
			|	КорректировкаРеализацииТовары.СуммаНДСРазница КАК СуммаНДСРазница,
			|	КорректировкаРеализацииТовары.СуммаВсего КАК СуммаВсего,
			|	КорректировкаРеализацииТовары.СуммаВсегоПоДокументуРеализации КАК СуммаВсегоПоДокументуРеализации,
			|	КорректировкаРеализацииТовары.СуммаВсегоРазница КАК СуммаВсегоРазница,
			|	КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения КАК БазоваяЕдиница,
			|	КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК БазоваяЕдиницаКод,
			|	КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК БазоваяЕдиницаНаименование,
			|	КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК БазоваяЕдиницаНаименованиеПолное,
			|	КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.МеждународноеСокращение КАК БазоваяЕдиницаМеждународноеСокращение,
			|	КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
			|	КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование КАК ЕдиницаИзмеренияНаименование,
			|	КорректировкаРеализацииТовары.ЕдиницаИзмеренияПоДокументуРеализации.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКодДоКорректировки,
			|	КорректировкаРеализацииТовары.ЕдиницаИзмеренияПоДокументуРеализации.ЕдиницаПоКлассификатору.Наименование КАК ЕдиницаИзмеренияНаименованиеДоКорректировки,
			|	КорректировкаРеализацииТовары.Номенклатура.КодТНВЭД КАК КодТНВЭД,
			|	КорректировкаРеализацииТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	КорректировкаРеализацииТовары.GTIN КАК GTIN,
			|	КорректировкаРеализацииТовары.GTINПоДокументуРеализации КАК GTINПоДокументу,
			|	КорректировкаРеализацииТовары.КоличествоМест КАК КоличествоУпаковок,
			|	КорректировкаРеализацииТовары.КоличествоМестПоДокументуРеализации КАК КоличествоУпаковокПоДокументу
			|ИЗ
			|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
			|ГДЕ
			|	КорректировкаРеализацииТовары.Ссылка = &ДокументКорректировки
			|	И (КорректировкаРеализацииТовары.КоличествоРазница <> 0
			|			ИЛИ КорректировкаРеализацииТовары.СуммаВсегоРазница <> 0)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетФактураВыданныйТовары.Номенклатура КАК Номенклатура,
			|	СчетФактураВыданныйТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	СчетФактураВыданныйТовары.ГТД КАК ГТД,
			|	СУММА(СчетФактураВыданныйТовары.Количество) КАК Количество,
			|	СчетФактураВыданныйТовары.ГТД.Страна.Код КАК СтранаПроисхожденияКод,
			|	СчетФактураВыданныйТовары.ГТД.Наименование КАК ТаможеннаяДекларацияНомер
			|ИЗ
			|	Документ.СчетФактураВыданный.Товары КАК СчетФактураВыданныйТовары
			|ГДЕ
			|	СчетФактураВыданныйТовары.Ссылка = &СчетФактура
			|	И НЕ СчетФактураВыданныйТовары.ГТД.РНПТ
			|	И СчетФактураВыданныйТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	СчетФактураВыданныйТовары.Номенклатура,
			|	СчетФактураВыданныйТовары.ХарактеристикаНоменклатуры,
			|	СчетФактураВыданныйТовары.ГТД,
			|	СчетФактураВыданныйТовары.ГТД.Страна.Код,
			|	СчетФактураВыданныйТовары.ГТД.Наименование"
		);
		Запрос.УстановитьПараметр("ДокументКорректировки", Шапка.ДокументКорректировки);
		
		Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
		ПакетЗапроса = Запрос.ВыполнитьПакет();
		Товары = ОбщегоНазначения.ТаблицаЗначенийВМассив(ПакетЗапроса[0].Выгрузить());
		ГТДТоваров = ПакетЗапроса[1].Выгрузить();
		Результат.Вставить("Товары",              Товары);
		Результат.Вставить("ГТДТоваров",          ГТДТоваров);
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КорректировкаРеализацииТовары.НомерСтроки КАК НомерСтроки,
		|	КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
		|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	КорректировкаРеализацииТовары.Количество * КорректировкаРеализацииТовары.Коэффициент КАК Количество,
		|	КорректировкаРеализацииТовары.КоличествоПоДокументуРеализации * КорректировкаРеализацииТовары.Коэффициент КАК КоличествоДоКорректировки,
		|	КорректировкаРеализацииТовары.КоличествоРазница * КорректировкаРеализацииТовары.Коэффициент КАК КоличествоРазница,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмеренияПоДокументуРеализации КАК ЕдиницаИзмеренияПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.Коэффициент КАК Коэффициент,
		|	КорректировкаРеализацииТовары.КоэффициентПоДокументуРеализации КАК КоэффициентПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.Цена КАК Цена,
		|	КорректировкаРеализацииТовары.Сумма КАК Сумма,
		|	КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
		|	КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС,
		|	КорректировкаРеализацииТовары.СуммаНДСПоДокументуРеализации КАК СуммаНДСПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.СуммаНДСРазница КАК СуммаНДСРазница,
		|	КорректировкаРеализацииТовары.СуммаВсего КАК СуммаВсего,
		|	КорректировкаРеализацииТовары.СуммаВсегоПоДокументуРеализации КАК СуммаВсегоПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.СуммаВсегоРазница КАК СуммаВсегоРазница,
		|	КорректировкаРеализацииТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	КорректировкаРеализацииТовары.GTIN КАК GTIN,
		|	КорректировкаРеализацииТовары.GTINПоДокументуРеализации КАК GTINПоДокументу,
		|	КорректировкаРеализацииТовары.КоличествоМест КАК КоличествоУпаковок,
		|	КорректировкаРеализацииТовары.КоличествоМестПоДокументуРеализации КАК КоличествоУпаковокПоДокументу,
		|	КорректировкаРеализацииТовары.Ссылка КАК ДокументОснование,
		|	КорректировкаРеализацииТовары.Ссылка.Дата КАК ДокументОснованиеДата,
		|	КорректировкаРеализацииТовары.Ссылка.Номер КАК ДокументОснованиеНомер,
		|	КорректировкаРеализацииТовары.ГТД КАК ГТД,
		|	КорректировкаРеализацииТовары.Партия КАК Партия
		|ПОМЕСТИТЬ
		|	тТовары
		|ИЗ
		|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
		|ГДЕ
		|	КорректировкаРеализацииТовары.Ссылка В (&ДокументыОснования)
		|	И (КорректировкаРеализацииТовары.КоличествоРазница <> 0
		|			ИЛИ КорректировкаРеализацииТовары.СуммаВсегоРазница <> 0)
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КорректировкаРеализацииТовары.НомерСтроки КАК НомерСтроки,
		|	КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
		|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	КорректировкаРеализацииТовары.Количество КАК Количество,
		|	КорректировкаРеализацииТовары.Коэффициент КАК Коэффициент,
		|	КорректировкаРеализацииТовары.Количество КАК КоличествоОсталось,
		|	КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС,
		|	КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДСОсталось,
		|	КорректировкаРеализацииТовары.СуммаВсего КАК СуммаВсего,
		|	КорректировкаРеализацииТовары.СуммаВсего КАК СуммаОсталось,
		|	КорректировкаРеализацииТовары.ДокументОснование КАК ДокументОснование,
		|	КорректировкаРеализацииТовары.ДокументОснованиеДата КАК ДокументОснованиеДата,
		|	КорректировкаРеализацииТовары.ДокументОснованиеНомер КАК ДокументОснованиеНомер,
		|	КорректировкаРеализацииТовары.ГТД КАК ГТД,
		|	КорректировкаРеализацииТовары.Партия КАК Партия
		|ИЗ
		|	тТовары КАК КорректировкаРеализацииТовары
		|УПОРЯДОЧИТЬ ПО
		|	ДокументОснованиеДата,
		|	ДокументОснованиеНомер,
		|	ДокументОснование,
		|	НомерСтроки
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК Товар,
		|	КорректировкаРеализацииТовары.НомерСтроки КАК НомерСтроки,
		|	КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
		|	КорректировкаРеализацииТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВЫБОР
		|		КОГДА КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА КорректировкаРеализацииТовары.Номенклатура.Наименование + "" "" + КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры.Наименование
		|		ИНАЧЕ КорректировкаРеализацииТовары.Номенклатура.Наименование
		|	КОНЕЦ КАК ТоварНаименование,
		|	КорректировкаРеализацииТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
		|	КорректировкаРеализацииТовары.Номенклатура.Код КАК НоменклатураКод,
		|	КорректировкаРеализацииТовары.Количество КАК Количество,
		|	КорректировкаРеализацииТовары.КоличествоДоКорректировки КАК КоличествоДоКорректировки,
		|	КорректировкаРеализацииТовары.КоличествоРазница КАК КоличествоРазница,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмеренияПоДокументуРеализации КАК ЕдиницаИзмеренияПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.Коэффициент КАК Коэффициент,
		|	КорректировкаРеализацииТовары.КоэффициентПоДокументуРеализации КАК КоэффициентПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.Цена КАК Цена,
		|	КорректировкаРеализацииТовары.Сумма КАК Сумма,
		|	КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
		|	КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС,
		|	КорректировкаРеализацииТовары.СуммаНДСПоДокументуРеализации КАК СуммаНДСПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.СуммаНДСРазница КАК СуммаНДСРазница,
		|	КорректировкаРеализацииТовары.СуммаВсего КАК СуммаВсего,
		|	КорректировкаРеализацииТовары.СуммаВсегоПоДокументуРеализации КАК СуммаВсегоПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.СуммаВсегоРазница КАК СуммаВсегоРазница,
		|	КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения КАК БазоваяЕдиница,
		|	КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК БазоваяЕдиницаКод,
		|	КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК БазоваяЕдиницаНаименование,
		|	КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК БазоваяЕдиницаНаименованиеПолное,
		|	КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.МеждународноеСокращение КАК БазоваяЕдиницаМеждународноеСокращение,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование КАК ЕдиницаИзмеренияНаименование,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмеренияПоДокументуРеализации.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКодДоКорректировки,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмеренияПоДокументуРеализации.ЕдиницаПоКлассификатору.Наименование КАК ЕдиницаИзмеренияНаименованиеДоКорректировки,
		|	КорректировкаРеализацииТовары.Номенклатура.КодТНВЭД КАК КодТНВЭД,
		|	КорректировкаРеализацииТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	КорректировкаРеализацииТовары.GTIN КАК GTIN,
		|	КорректировкаРеализацииТовары.GTINПоДокументу КАК GTINПоДокументу,
		|	КорректировкаРеализацииТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	КорректировкаРеализацииТовары.КоличествоУпаковокПоДокументу КАК КоличествоУпаковокПоДокументу,
		|	КорректировкаРеализацииТовары.ДокументОснование КАК ДокументОснование,
		|	КорректировкаРеализацииТовары.ДокументОснованиеДата КАК ДокументОснованиеДата,
		|	КорректировкаРеализацииТовары.ДокументОснованиеНомер КАК ДокументОснованиеНомер,
		|	КорректировкаРеализацииТовары.ГТД КАК ГТД,
		|	КорректировкаРеализацииТовары.ГТД.Страна.Код КАК СтранаПроисхожденияКод,
		|	КорректировкаРеализацииТовары.ГТД.Наименование КАК ТаможеннаяДекларацияНомер,
		|	КорректировкаРеализацииТовары.Партия КАК Партия
		|ИЗ
		|	тТовары КАК КорректировкаРеализацииТовары
		|УПОРЯДОЧИТЬ ПО
		|	ДокументОснованиеДата,
		|	ДокументОснованиеНомер,
		|	ДокументОснование,
		|	НомерСтроки
		|");
		
		//|	СчетФактураВыданныйТовары.ГТД КАК ГТД,
		//	|	СУММА(СчетФактураВыданныйТовары.Количество) КАК Количество,
		//	|	СчетФактураВыданныйТовары.ГТД.Страна.Код КАК СтранаПроисхожденияКод,
		//	|	СчетФактураВыданныйТовары.ГТД.Наименование КАК ТаможеннаяДекларацияНомер
		//	|ИЗ
		//	|	Документ.СчетФактураВыданный.Товары КАК СчетФактураВыданныйТовары
		//	|ГДЕ
		//	|	СчетФактураВыданныйТовары.Ссылка = &СчетФактура
		//	|	И НЕ СчетФактураВыданныйТовары.ГТД.РНПТ
		//	|	И СчетФактураВыданныйТовары.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
		//	|
		
		Запрос.УстановитьПараметр("ДокументыОснования", ДокументыОснования);
		Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
		
		РезультатПакетов = Запрос.ВыполнитьПакет();
		ТабТоваровСГТД = РезультатПакетов[РезультатПакетов.Количество()-2].Выгрузить();
		ТабТоваров     = РезультатПакетов[РезультатПакетов.Количество()-1].Выгрузить();
		
		ТабГТД = Документы.КорректировкаРеализации.ДвиженияПоГТД(ДокументыОснования);
		
		ВременнаяТоварыСГТД = ТабТоваров.СкопироватьКолонки();
		ГТДТоваров          = ТабТоваров.СкопироватьКолонки("НомерСтроки, Номенклатура, ХарактеристикаНоменклатуры, Количество, ДокументОснование, ГТД");
		ГТДТоваров.Колонки.Добавить("СтранаПроисхожденияКод", Метаданные.Справочники.СтраныМира.СтандартныеРеквизиты.Код.Тип);
		ГТДТоваров.Колонки.Добавить("ТаможеннаяДекларацияНомер", Метаданные.Справочники.ГТД.СтандартныеРеквизиты.Наименование.Тип);
		
		Документы.СчетФактураВыданный.ДозаполнитьТаблицуТоваровПоДвижениямОснования(Шапка.СуммаВключаетНДС, ВременнаяТоварыСГТД, Истина, Истина, ТабТоваровСГТД, ТабГТД);
		
		Для Каждого ТекущаяСтрока Из ВременнаяТоварыСГТД Цикл
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ГТД) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекущаяСтрока.ГТД.РНПТ = Истина Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ГТДТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.СтранаПроисхожденияКод    = ТекущаяСтрока.ГТД.Страна.Код;
			НоваяСтрока.ТаможеннаяДекларацияНомер = ТекущаяСтрока.ГТД.Наименование;
			
		КонецЦикла;
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК Товар,
		|	ТоварыДокумента.НомерСтроки КАК НомерСтроки,
		|	ВЫРАЗИТЬ(ТоварыДокумента.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ТоварыДокумента.ХарактеристикаНоменклатуры КАК Справочник.ХарактеристикиНоменклатуры) КАК ХарактеристикаНоменклатуры,
		|	ТоварыДокумента.Количество КАК Количество,
		|	ТоварыДокумента.КоличествоДоКорректировки КАК КоличествоДоКорректировки,
		|	ТоварыДокумента.КоличествоРазница КАК КоличествоРазница,
		|	ВЫРАЗИТЬ(ТоварыДокумента.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения) КАК ЕдиницаИзмерения,
		|	ВЫРАЗИТЬ(ТоварыДокумента.ЕдиницаИзмеренияПоДокументуРеализации КАК Справочник.ЕдиницыИзмерения) КАК ЕдиницаИзмеренияПоДокументуРеализации,
		|	ТоварыДокумента.Коэффициент КАК Коэффициент,
		|	ТоварыДокумента.КоэффициентПоДокументуРеализации КАК КоэффициентПоДокументуРеализации,
		|	ТоварыДокумента.Цена КАК Цена,
		|	ТоварыДокумента.Сумма КАК Сумма,
		|	ТоварыДокумента.СтавкаНДС КАК СтавкаНДС,
		|	ТоварыДокумента.СуммаНДС КАК СуммаНДС,
		|	ТоварыДокумента.СуммаНДСПоДокументуРеализации КАК СуммаНДСПоДокументуРеализации,
		|	ТоварыДокумента.СуммаНДСРазница КАК СуммаНДСРазница,
		|	ТоварыДокумента.СуммаВсего КАК СуммаВсего,
		|	ТоварыДокумента.СуммаВсегоПоДокументуРеализации КАК СуммаВсегоПоДокументуРеализации,
		|	ТоварыДокумента.СуммаВсегоРазница КАК СуммаВсегоРазница,
		|	ТоварыДокумента.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТоварыДокумента.GTIN КАК GTIN,
		|	ТоварыДокумента.GTINПоДокументу КАК GTINПоДокументу,
		|	ТоварыДокумента.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТоварыДокумента.КоличествоУпаковокПоДокументу КАК КоличествоУпаковокПоДокументу,
		|	ТоварыДокумента.ДокументОснование КАК ДокументОснование,
		|	ТоварыДокумента.ДокументОснованиеДата КАК ДокументОснованиеДата,
		|	ТоварыДокумента.ДокументОснованиеНомер КАК ДокументОснованиеНомер,
		|	ВЫРАЗИТЬ(ТоварыДокумента.ГТД КАК Справочник.ГТД) КАК ГТД,
		|	ТоварыДокумента.Партия КАК Партия
		|ПОМЕСТИТЬ
		|	СчетФактураВыданныйТовары
		|ИЗ
		|	&ТоварыДокумента КАК ТоварыДокумента
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК Товар,
		|	КорректировкаРеализацииТовары.НомерСтроки КАК НомерСтроки,
		|	КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
		|	КорректировкаРеализацииТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВЫБОР
		|		КОГДА КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА КорректировкаРеализацииТовары.Номенклатура.Наименование + "" "" + КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры.Наименование
		|		ИНАЧЕ КорректировкаРеализацииТовары.Номенклатура.Наименование
		|	КОНЕЦ КАК ТоварНаименование,
		|	КорректировкаРеализацииТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
		|	КорректировкаРеализацииТовары.Номенклатура.Код КАК НоменклатураКод,
		|	КорректировкаРеализацииТовары.Количество КАК Количество,
		|	КорректировкаРеализацииТовары.КоличествоДоКорректировки КАК КоличествоДоКорректировки,
		|	КорректировкаРеализацииТовары.КоличествоРазница КАК КоличествоРазница,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмеренияПоДокументуРеализации КАК ЕдиницаИзмеренияПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.Коэффициент КАК Коэффициент,
		|	КорректировкаРеализацииТовары.КоэффициентПоДокументуРеализации КАК КоэффициентПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.Цена КАК Цена,
		|	КорректировкаРеализацииТовары.Сумма КАК Сумма,
		|	КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
		|	КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДС,
		|	КорректировкаРеализацииТовары.СуммаНДСПоДокументуРеализации КАК СуммаНДСПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.СуммаНДСРазница КАК СуммаНДСРазница,
		|	КорректировкаРеализацииТовары.СуммаВсего КАК СуммаВсего,
		|	КорректировкаРеализацииТовары.СуммаВсегоПоДокументуРеализации КАК СуммаВсегоПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.СуммаВсегоРазница КАК СуммаВсегоРазница,
		|	КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения КАК БазоваяЕдиница,
		|	КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК БазоваяЕдиницаКод,
		|	КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК БазоваяЕдиницаНаименование,
		|	КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК БазоваяЕдиницаНаименованиеПолное,
		|	КорректировкаРеализацииТовары.Номенклатура.БазоваяЕдиницаИзмерения.МеждународноеСокращение КАК БазоваяЕдиницаМеждународноеСокращение,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование КАК ЕдиницаИзмеренияНаименование,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмеренияПоДокументуРеализации.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКодДоКорректировки,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмеренияПоДокументуРеализации.ЕдиницаПоКлассификатору.Наименование КАК ЕдиницаИзмеренияНаименованиеДоКорректировки,
		|	КорректировкаРеализацииТовары.Номенклатура.КодТНВЭД КАК КодТНВЭД,
		|	КорректировкаРеализацииТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	КорректировкаРеализацииТовары.GTIN КАК GTIN,
		|	КорректировкаРеализацииТовары.GTINПоДокументу КАК GTINПоДокументу,
		|	КорректировкаРеализацииТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	КорректировкаРеализацииТовары.КоличествоУпаковокПоДокументу КАК КоличествоУпаковокПоДокументу,
		|	КорректировкаРеализацииТовары.ДокументОснование КАК ДокументОснование,
		|	КорректировкаРеализацииТовары.ДокументОснованиеДата КАК ДокументОснованиеДата,
		|	КорректировкаРеализацииТовары.ДокументОснованиеНомер КАК ДокументОснованиеНомер,
		|	КорректировкаРеализацииТовары.ГТД КАК ГТД,
		|	КорректировкаРеализацииТовары.ГТД.Страна.Код КАК СтранаПроисхожденияКод,
		|	КорректировкаРеализацииТовары.ГТД.Наименование КАК ТаможеннаяДекларацияНомер,
		|	КорректировкаРеализацииТовары.Партия КАК Партия
		|ИЗ
		|	СчетФактураВыданныйТовары КАК КорректировкаРеализацииТовары
		|УПОРЯДОЧИТЬ ПО
		|	ДокументОснованиеДата,
		|	ДокументОснованиеНомер,
		|	ДокументОснование,
		|	НомерСтроки
		|";
		
		Товары = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТабТоваров);
		Результат.Вставить("Товары",     Товары);
		Результат.Вставить("ГТДТоваров", ГТДТоваров);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьДанныеПервичногоДокументаУКД_2020(ДанныеДляФормированияЭД, Настройки, ДеревоДанных)
	
	Шапка = ДанныеДляФормированияЭД.Шапка;
	СохранитьРеквизитВДереве(ДеревоДанных, "ДатаНаправленияНаСогласование", Шапка.Дата);
	
	Если
		ЗначениеЗаполнено(Шапка.Договор)
		И ЗначениеЗаполнено(Шапка.ДоговорНомер)
		И ЗначениеЗаполнено(Шапка.ДатаДоговора)
	Тогда
		
		ОснованиеКорректировки = Новый ТаблицаЗначений;
		ОснованиеКорректировки.Колонки.Добавить("ДоговорКонтрагента");
		ОснованиеКорректировки.Колонки.Добавить("ДокументНаименование");
		ОснованиеКорректировки.Колонки.Добавить("ДокументНомер");
		ОснованиеКорректировки.Колонки.Добавить("ДокументДата");
		ОснованиеКорректировки.Колонки.Добавить("ДокументДопСведения");
		
		НоваяСтрока = ОснованиеКорректировки.Добавить();
		НоваяСтрока.ДоговорКонтрагента   = Шапка.Договор;
		НоваяСтрока.ДокументНаименование = НСтр("ru = 'Договор'");
		НоваяСтрока.ДокументНомер = Шапка.ДоговорНомер;
		НоваяСтрока.ДокументДата = НачалоДня(Шапка.ДатаДоговора);
		
		ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ОснованиеКорректировки, "ОснованиеКорректировки");
		
	КонецЕсли;
		
	ПередаточныйДокумент = Новый ТаблицаЗначений;
	ПередаточныйДокумент.Колонки.Добавить("ДокументНаименование");
	ПередаточныйДокумент.Колонки.Добавить("ДокументНомер");
	ПередаточныйДокумент.Колонки.Добавить("ДокументДата");
	
	Если
		ЗначениеЗаполнено(ДанныеДляФормированияЭД.Шапка.НомерИсходногоДокумента)
		И ЗначениеЗаполнено(ДанныеДляФормированияЭД.Шапка.ДатаИсходногоДокумента)
	Тогда
	
		ОписаниеОснования = СтрШаблон(
			НСтр("ru = 'Универсальный передаточный документ № %1 от %2'"),
			ДанныеДляФормированияЭД.Шапка.НомерИсходногоДокумента,
			Формат(ДанныеДляФормированияЭД.Шапка.ДатаИсходногоДокумента, "ДЛФ=D")
		);
				
		Если
			ЗначениеЗаполнено(ДанныеДляФормированияЭД.Шапка.НомерИсправленияИсходногоДокумента)
			И ЗначениеЗаполнено(ДанныеДляФормированияЭД.Шапка.ДатаИсправленияИсходногоДокумента)
		Тогда
			
			ОписаниеОснования = ОписаниеОснования + ", " + СтрШаблон(
				НСтр("ru = 'с учетом исправления № %1 от %2'"),
				ДанныеДляФормированияЭД.Шапка.НомерИсправленияИсходногоДокумента,
				Формат(ДанныеДляФормированияЭД.Шапка.ДатаИсправленияИсходногоДокумента, "ДЛФ=D")
			);
				
		КонецЕсли;
		
		НоваяСтрока = ПередаточныйДокумент.Добавить();
		НоваяСтрока.ДокументНаименование = ОписаниеОснования;
		НоваяСтрока.ДокументНомер        = ДанныеДляФормированияЭД.Шапка.НомерИсходногоДокумента;
		НоваяСтрока.ДокументДата         = ДанныеДляФормированияЭД.Шапка.ДатаИсходногоДокумента;
		ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ПередаточныйДокумент, "ПередаточныйДокумент");
	
	КонецЕсли;
	
	Возврат ДеревоДанных;
	
КонецФункции

Функция ЗаполнитьДеревоДанныхУКД_2020(ДанныеДляФормированияЭД, Настройки, ДеревоДанных)	
	
	Шапка = ДанныеДляФормированияЭД.Шапка;
	
	СохранитьРеквизитВДереве(ДеревоДанных, "СсылкаКорректировочногоСчетаФактуры", Шапка.СчетФактура);
	СохранитьРеквизитВДереве(ДеревоДанных, "ВидДокумента", "Корректировка");
	
	НомерДокумента = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(Шапка); 
	Если Настройки.Функция = "КСЧФ" ИЛИ Настройки.Функция = "КСЧФДИС" Тогда
		НомерДокумента = УправлениеПечатьюПлатформа.ДополнитьНомерСчетФактурыИндексомОбособленногоПодразделения(НомерДокумента, Шапка.Ссылка);
	КонецЕсли;
	
	СохранитьРеквизитВДереве(ДеревоДанных, "НомерДокумента", НомерДокумента);
	СохранитьРеквизитВДереве(ДеревоДанных, "ДатаДокумента",  Шапка.Дата);
	
	Если Шапка.Исправление Тогда
		
		СохранитьРеквизитВДереве(ДеревоДанных, "НомерИсправления", Шапка.НомерИсправления);
		СохранитьРеквизитВДереве(ДеревоДанных, "ДатаИсправления", Шапка.ДатаИсправления);
		
	КонецЕсли;
	
	ЗаполнитьДанныеИсходныхДокументов(ДеревоДанных, ДанныеДляФормированияЭД, Настройки);
	
	СведенияОПокупателе = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Шапка.Покупатель, СведенияОПокупателе);
	ЗаполнитьДанныеУчастникаУПД(ДеревоДанных, СведенияОПокупателе, "СведенияОПокупателе", "Юр");
	
	СведенияОПродавце = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Шапка.Поставщик, СведенияОПродавце);
	ЗаполнитьДанныеУчастникаУПД(ДеревоДанных, СведенияОПродавце, "СведенияОПродавце", "Юр");
	
	СохранитьРеквизитВДереве(ДеревоДанных, "СоставительДокументаНаименование", СведенияОПродавце.ПолноеНаименование);
	
	СохранитьРеквизитВДереве(ДеревоДанных, "ВалютаКод", Шапка.КодВалюты);
	СохранитьРеквизитВДереве(ДеревоДанных, "ДополнительныеСведенияОбУчастниках.ВалютаНаименование",
		Шапка.НаименованиеПолноеВалюты);
	СохранитьРеквизитВДереве(ДеревоДанных, "ДополнительныеСведенияОбУчастниках.ВалютаКурс", Шапка.Курс);
	
	ДокументыОснования = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ДанныеДляФормированияЭД.ДокументыОснования);
	СохранитьРеквизитВДереве(ДеревоДанных, "ДокументыОснованияСчетаФактуры", ДокументыОснования);
	
	СохранитьРеквизитВДереве(ДеревоДанных, "ДополнительныеСведенияОбУчастниках.ИдентификаторГосКонтракта",
		Шапка.ИдентификаторГосударственногоКонтракта);	
	СохранитьРеквизитВДереве(ДеревоДанных, "СодержаниеОперации", НСтр("ru = 'Предлагаю изменить стоимость'"));
	
	Возврат ДеревоДанных;
	
КонецФункции

Процедура ЗаполнитьДанныеУчастникаУПД(ДеревоДанных,
                                      СведенияОбУчастнике,
                                      ВидУчастника,
                                      ВидАдреса = "Юр",
                                      КорневойЭлементДерева = "",
                                      ДатаКИ = Неопределено)
	
	Если ЗначениеЗаполнено(СведенияОбУчастнике.ЮрФизЛицо) Тогда
		
		Если СведенияОбУчастнике.ЮрФизЛицо = Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
			
			СохранитьРеквизитВДереве(
				ДеревоДанных,
				ВидУчастника + ".ТипУчастника.ЮЛ.НаименованиеОрганизации",
				СведенияОбУчастнике.ПолноеНаименование,
				КорневойЭлементДерева
			);
			СохранитьРеквизитВДереве(
				ДеревоДанных,
				ВидУчастника + ".ТипУчастника.ЮЛ.ИНН",
				СведенияОбУчастнике.ИНН,
				КорневойЭлементДерева
			);
			СохранитьРеквизитВДереве(
				ДеревоДанных,
				ВидУчастника + ".ТипУчастника.ЮЛ.КПП",
				СведенияОбУчастнике.КПП,
				КорневойЭлементДерева
			);
			
		ИначеЕсли СведенияОбУчастнике.ЮрФизЛицо = Перечисления.ФормыСобственности.ЮридическоеЛицоНеРезидент Тогда
			СохранитьРеквизитВДереве(
				ДеревоДанных,
				ВидУчастника + ".ТипУчастника.ИЛ.НаименованиеОрганизации",
				СведенияОбУчастнике.ПолноеНаименование,
				КорневойЭлементДерева);
		
			СохранитьРеквизитВДереве(
				ДеревоДанных,
				ВидУчастника + ".ТипУчастника.ИЛ.Идентификатор",
				СведенияОбУчастнике.ИдентификаторЮридическогоЛица,
				КорневойЭлементДерева);
			
		Иначе
			
			СохранитьРеквизитВДереве(
				ДеревоДанных,
				ВидУчастника + ".ТипУчастника.ИП.ИНН",
				СведенияОбУчастнике.ИНН,
				КорневойЭлементДерева
			);
			СохранитьРеквизитВДереве(
				ДеревоДанных,
				ВидУчастника + ".ТипУчастника.ИП.Фамилия",
				СведенияОбУчастнике.Фамилия,
				КорневойЭлементДерева
			);
			СохранитьРеквизитВДереве(
				ДеревоДанных,
				ВидУчастника + ".ТипУчастника.ИП.Имя",
				СведенияОбУчастнике.Имя,
				КорневойЭлементДерева
			);
			СохранитьРеквизитВДереве(
				ДеревоДанных,
				ВидУчастника + ".ТипУчастника.ИП.Отчество",
				СведенияОбУчастнике.Отчество,
				КорневойЭлементДерева
			);
			
			Если ТипЗнч(СведенияОбУчастнике.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
				
				Если ДействуютПравилаЗаполненияПоПроектуПостановления1137() И ВидУчастника = "СведенияОПродавце" Тогда
					
					СтрокаДереваИП = ЭлектронноеВзаимодействие.СтрокаДерева(
						ДеревоДанных, ВидУчастника + ".ТипУчастника.ИП", Истина);
					
					НайденнаяСтрока = СтрокаДереваИП.Строки.Найти("СведенияОПродавце.ТипУчастника.ИП.ДатаОГРН", "ПолныйПуть");
					Если НайденнаяСтрока <> Неопределено Тогда
						СохранитьРеквизитВДереве(
							ДеревоДанных,
							ВидУчастника + ".ТипУчастника.ИП.ДатаОГРН",
							СведенияОбУчастнике.ДатаОГРН,
							КорневойЭлементДерева
						);
					КонецЕсли;
					
					НайденнаяСтрока = СтрокаДереваИП.Строки.Найти("СведенияОПродавце.ТипУчастника.ИП.ОГРН", "ПолныйПуть");
					Если НайденнаяСтрока <> Неопределено Тогда
						СохранитьРеквизитВДереве(
							ДеревоДанных,
							ВидУчастника + ".ТипУчастника.ИП.ОГРН",
							СведенияОбУчастнике.ОГРН,
							КорневойЭлементДерева
						);
					КонецЕсли;
					
				КонецЕсли;
				
				Если СведенияОбУчастнике.Свойство("Свидетельство") Тогда
					Свидетельство = СведенияОбУчастнике.Свидетельство;
				Иначе
					Свидетельство = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Свидетельство №%1 от %2'"),
						СведенияОбУчастнике.СвидетельствоСерияНомер,
						Формат(СведенияОбУчастнике.СвидетельствоДатаВыдачи, "ДЛФ=D"));
				КонецЕсли;
				СохранитьРеквизитВДереве(
					ДеревоДанных,
					ВидУчастника + ".ТипУчастника.ИП.СвидетельствоОГосРегистрации",
					Свидетельство,
					КорневойЭлементДерева);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	СведенияОбУчастнике.Вставить("ДатаКИ", ДатаКИ);
	АдресУчастника = Новый Структура;
	ПолучитьАдресСтруктурой(АдресУчастника, СведенияОбУчастнике, "Ссылка", ВидАдреса);
	
	Если АдресУчастника.Свойство("АдресРФ") Тогда
		
		АдресСтруктурированныйСуществует = ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(
			ДеревоДанных,
			ВидУчастника + ".Адрес.Структурированный"
		);

		Если АдресСтруктурированныйСуществует Тогда
			
			ТипАдреса = ?(АдресУчастника.АдресРФ, "Структурированный", "АдресИнформация");
			
		ИначеЕсли ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ВидУчастника + ".Адрес.АдресРФ") Тогда
			
			ТипАдреса = ?(АдресУчастника.АдресРФ, "АдресРФ", "АдресИнформация");
			
		Иначе
			
			ТипАдреса = "АдресИнформация";
			
		КонецЕсли;
		
		ЗаполнитьАдресВДереве(ДеревоДанных, АдресУчастника, ТипАдреса, ВидУчастника, КорневойЭлементДерева);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбУчастнике.Телефоны) Тогда
		
		СохранитьРеквизитВДереве(
			ДеревоДанных,
			ВидУчастника + ".КонтактныеСведения.Телефон",
			СведенияОбУчастнике.Телефоны,
			КорневойЭлементДерева
		);
		
	КонецЕсли;
	
	НомерСчета = "";
	
	Если СведенияОбУчастнике.Свойство("НомерСчета", НомерСчета) И ЗначениеЗаполнено(НомерСчета) Тогда
		
		СохранитьРеквизитВДереве(
			ДеревоДанных,
			ВидУчастника + ".БанковскиеРеквизиты.НомерСчета",
			НомерСчета,
			КорневойЭлементДерева
		);
		Банк = "";
		БИК = "";
		КоррСчет = "";
		
		Если СведенияОбУчастнике.Свойство("Банк", Банк) И ЗначениеЗаполнено(Банк) Тогда
			
			Если ТипЗнч(Банк) = Тип("Строка") Тогда
				
				БанкНаименование = Банк;
				
			Иначе
				
				БанкНаименование = Банк.Наименование;
				
			КонецЕсли;
			
			СохранитьРеквизитВДереве(
				ДеревоДанных,
				ВидУчастника + ".БанковскиеРеквизиты.НаименованиеБанка",
				БанкНаименование,
				КорневойЭлементДерева
			);
			
		КонецЕсли;
		
		Если СведенияОбУчастнике.Свойство("БИК", БИК) И ЗначениеЗаполнено(БИК) Тогда
			
			СохранитьРеквизитВДереве(
				ДеревоДанных,
				ВидУчастника + ".БанковскиеРеквизиты.БИКБанка",
				БИК,
				КорневойЭлементДерева
			);
			
		КонецЕсли;
		
		Если СведенияОбУчастнике.Свойство("КоррСчет", КоррСчет) И ЗначениеЗаполнено(КоррСчет) Тогда
			
			СохранитьРеквизитВДереве(
				ДеревоДанных,
				ВидУчастника + ".БанковскиеРеквизиты.КорреспондентскийСчетБанка",
				КоррСчет,
				КорневойЭлементДерева
			);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОбУчастнике.КодПоОКПО) Тогда
		
		СохранитьРеквизитВДереве(
			ДеревоДанных,
			ВидУчастника + ".КодОКПО",
			СведенияОбУчастнике.КодПоОКПО,
			КорневойЭлементДерева
		);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПолучитьАдресСтруктурой(
	СтруктураАдреса,
	СтруктураПараметров,
	ВидКонтрагента = "Контрагент",
	ВидАдреса = "Юр",
	ТекстОшибки = "") Экспорт
	
	Адрес = ПолучитьКонтактнуюИнформацию(СтруктураПараметров[ВидКонтрагента], , ВидАдреса, СтруктураПараметров.ДатаКИ);
	Параметр1 = СтруктураПараметров[ВидКонтрагента];
	Параметр2 = ?(ВидАдреса = "Юр", НСтр("ru = 'юридический'"), НСтр("ru = 'фактический'"));
	
	Если НЕ ЗначениеЗаполнено(Адрес.Представление) Тогда
		
		Ошибка = НСтр("ru = 'Для %1 необходимо указать %2 адрес.'");
		ТекстОшибки = ТекстОшибки
			+ Символы.ПС
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Ошибка, Параметр1, Параметр2);
		Возврат;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Адрес.ЗначенияПолей) Тогда
		
		Ошибка =  НСтр("ru = 'Для %1 необходимо заполнить %2 адрес по классификатору.'");
		ТекстОшибки = ТекстОшибки
			+ Символы.ПС
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Ошибка, Параметр1, Параметр2); 
		Возврат;
	
	Иначе
		
		ТекстОшибки = "";
	
	КонецЕсли;
	
	СтруктураРезультата = Новый Структура(
		"КодСтраны,
		|Индекс,
		|Регион,
		|КодРегиона,
		|Район,
		|Город,
		|НаселенныйПункт,
		|Улица,
		|Дом,
		|Корпус,
		|Квартира"
	);
	ЗаполнитьЗначенияСвойств(СтруктураРезультата, РаботаСАдресами.СведенияОбАдресе(Адрес.ЗначенияПолей));
	РезультатПроверки = РаботаСАдресами.ПроверитьАдрес(Адрес.ЗначенияПолей, Адрес.Вид);	
	
	АдресРФ = РезультатПроверки.Результат <> "СодержитОшибки"
		И СтрСравнить(СтруктураРезультата.КодСтраны, Справочники.СтраныМира.Россия.Код) = 0
		И ЗначениеЗаполнено(СтруктураРезультата.КодРегиона);	
	СтруктураАдреса.Вставить("АдресРФ",     АдресРФ);
	СтруктураАдреса.Вставить("Индекс",      СтруктураРезультата.Индекс);
	СтруктураАдреса.Вставить("КодРегион",   СтруктураРезультата.КодРегиона);
	СтруктураАдреса.Вставить("КодРегиона",  СтруктураРезультата.КодРегиона);
	СтруктураАдреса.Вставить("Район",       СтруктураРезультата.Район);
	СтруктураАдреса.Вставить("Город",       СтруктураРезультата.Город);
	СтруктураАдреса.Вставить("НаселПункт",  СтруктураРезультата.НаселенныйПункт);
	СтруктураАдреса.Вставить("Улица",       СтруктураРезультата.Улица);
	СтруктураАдреса.Вставить("Дом",         СтруктураРезультата.Дом);
	СтруктураАдреса.Вставить("Корпус",      СтруктураРезультата.Корпус);
	СтруктураАдреса.Вставить("Кварт",       СтруктураРезультата.Квартира);
	СтруктураАдреса.Вставить("КодГАР", 		"");
	
	Если НЕ АдресРФ Тогда
		
		СтруктураАдреса.Вставить("КодСтр",   СтруктураРезультата.КодСтраны);
		СтруктураАдреса.Вставить("КодСтраны",   СтруктураРезультата.КодСтраны);
		СтруктураАдреса.Вставить("АдрТекст", Адрес.Представление);
		СтруктураАдреса.Вставить("АдресТекст", Адрес.Представление);
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ЗаполнитьАдресВДереве(ДеревоДанных, АдресУчастника, ТипАдреса, ВидУчастника, КорневойЭлементДерева = "")
	
	Если ТипАдреса = "Произвольный" Тогда

		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных,
			ВидУчастника + ".Адрес.Произвольный",
			АдресУчастника.АдрТекст,
			КорневойЭлементДерева
		);

	ИначеЕсли ТипАдреса = "Структурированный" ИЛИ ТипАдреса = "Иностранный" Тогда

		Если АдресУчастника.АдресРФ Тогда

			АдресУчастника.Удалить("АдресРФ");
			АдресУчастника.Удалить("КодСтр");
			АдресУчастника.Удалить("КодСтраны");
			АдресУчастника.Удалить("КодРегиона");
			АдресУчастника.Удалить("НаселенныйПункт");
			АдресУчастника.Удалить("Квартира");
			АдресУчастника.Удалить("АдрТекст");
			АдресУчастника.Удалить("АдресТекст");
			АдресУчастника.Удалить("КодГАР");

		Иначе

			АдресУчастника.Удалить("АдресРФ");
			АдресУчастника.Удалить("ПочтовыйИндекс");
			АдресУчастника.Удалить("Индекс");
			АдресУчастника.Удалить("Регион");
			АдресУчастника.Удалить("КодРегиона");
			АдресУчастника.Удалить("КодРегион");
			АдресУчастника.Удалить("Район");
			АдресУчастника.Удалить("Город");
			АдресУчастника.Удалить("НаселенныйПункт");
			АдресУчастника.Удалить("НаселПункт");
			АдресУчастника.Удалить("Улица");
			АдресУчастника.Удалить("Дом");
			АдресУчастника.Удалить("Корпус");
			АдресУчастника.Удалить("Квартира");
			АдресУчастника.Удалить("Кварт");
			АдресУчастника.Удалить("КодГАР");

		КонецЕсли;

		Для Каждого Элемент Из АдресУчастника Цикл

			СохранитьРеквизитВДереве(
				ДеревоДанных,
				ВидУчастника + ".Адрес." + ТипАдреса + "." + Элемент.Ключ,
				Элемент.Значение, КорневойЭлементДерева
			);

		КонецЦикла;

	ИначеЕсли ТипАдреса = "АдресРФ" Тогда

		АдресУчастника.Удалить("АдресРФ");
		АдресУчастника.Удалить("КодСтр");
		АдресУчастника.Удалить("КодСтраны");
		АдресУчастника.Удалить("АдрТекст");
		АдресУчастника.Удалить("АдресТекст");
		АдресУчастника.Удалить("Регион");
		АдресУчастника.Удалить("КодРегион");
		АдресУчастника.Удалить("НаселПункт");
		АдресУчастника.Удалить("Кварт");
		АдресУчастника.Удалить("КодГАР");
		
		Для Каждого Элемент Из АдресУчастника Цикл
			
			СохранитьРеквизитВДереве(
				ДеревоДанных,
				ВидУчастника + ".Адрес." + ТипАдреса + "." + Элемент.Ключ,
				Элемент.Значение,
				КорневойЭлементДерева
			);

		КонецЦикла;
		
	ИначеЕсли ТипАдреса = "АдресИнформация" Тогда
		
			АдресУчастника.Удалить("АдресРФ");
			АдресУчастника.Удалить("ПочтовыйИндекс");
			АдресУчастника.Удалить("Индекс");
			АдресУчастника.Удалить("Регион");
			АдресУчастника.Удалить("КодРегиона");
			АдресУчастника.Удалить("КодРегион");
			АдресУчастника.Удалить("Район");
			АдресУчастника.Удалить("Город");
			АдресУчастника.Удалить("НаселенныйПункт");
			АдресУчастника.Удалить("НаселПункт");
			АдресУчастника.Удалить("Улица");
			АдресУчастника.Удалить("Дом");
			АдресУчастника.Удалить("Корпус");
			АдресУчастника.Удалить("Квартира");
			АдресУчастника.Удалить("Кварт");
			АдресУчастника.Удалить("КодСтр");
			АдресУчастника.Удалить("АдрТекст");
			АдресУчастника.Удалить("КодГАР");
	
		Для Каждого Элемент Из АдресУчастника Цикл
				
			СохранитьРеквизитВДереве(
				ДеревоДанных,
				ВидУчастника + ".Адрес." + ТипАдреса + "." + Элемент.Ключ,
				Элемент.Значение, КорневойЭлементДерева
			);
			
		КонецЦикла;
								
	ИначеЕсли ТипАдреса = "КодГАР" Тогда
		
		СохранитьРеквизитВДереве(
			ДеревоДанных,
			ВидУчастника + ".Адрес.КодГАР",
			Элемент.Значение, КорневойЭлементДерева
		);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьИнформациюОТоварахТоваровУКД_2020(ДанныеДляФормированияЭД, Настройки, ДеревоДанных)
	
	Товары = НоваяТаблицаТоваровУКД_2020();
	ТолькоУслуги = Истина;
	НомерСтроки = 1;
	
	КодыУпаковокМаркируемойПродукцииДо = Новый Соответствие;
	РНПТДо    = Новый Соответствие;
	РНПТПосле = Новый Соответствие;
	
	Если ДанныеДляФормированияЭД.Свойство("ОснованияКорректировок") Тогда
		Для Каждого ТекущаяСтрока Из ДанныеДляФормированияЭД.ОснованияКорректировок Цикл
			Если КодыУпаковокМаркируемойПродукцииДо.Получить(ТекущаяСтрока.ДокументОснование) = Неопределено Тогда
				КодыУпаковокМаркируемойПродукцииДо.Вставить(ТекущаяСтрока.ДокументОснование, ОбщегоНазначения
					.МенеджерОбъектаПоСсылке(ТекущаяСтрока.ДокументОснованиеКорректировки)
					.ПолучитьКодыМаркируемойПродукции(ТекущаяСтрока.ДокументОснованиеКорректировки));
			КонецЕсли;
			Если РНПТДо.Получить(ТекущаяСтрока.ДокументОснование) = Неопределено Тогда
				ТоварыСРНПТДо = УчетПрослеживаемыхТоваровСервер.РНПТВДокументе(ДанныеДляФормированияЭД.Шапка.ДокументСМаркировкамиДо);
				ТоварыСРНПТДо.Свернуть(
				"Номенклатура,ХарактеристикаНоменклатуры,ГТД,НомерТовара,ЕдиницаПрослеживаемости,КодЕдиницыПрослеживаемости",
				"Количество");
				РНПТДо.Вставить(ТекущаяСтрока.ДокументОснование, ТоварыСРНПТДо);
			КонецЕсли;
			Если РНПТПосле.Получить(ТекущаяСтрока.ДокументОснование) = Неопределено Тогда
				ТоварыСРНПТПосле = УчетПрослеживаемыхТоваровСервер.РНПТВДокументе(ДанныеДляФормированияЭД.Шапка.ДокументСМаркировкамиПосле);
				ТоварыСРНПТПосле.Свернуть(
				"Номенклатура,ХарактеристикаНоменклатуры,ГТД,НомерТовара,ЕдиницаПрослеживаемости,КодЕдиницыПрослеживаемости",
				"Количество");
				РНПТПосле.Вставить(ТекущаяСтрока.ДокументОснование, ТоварыСРНПТПосле);
			КонецЕсли;
		КонецЦикла;
	Иначе
		КодыУпаковокМаркируемойПродукцииДо.Вставить(ДанныеДляФормированияЭД.Шапка.ДокументСМаркировкамиПосле, ОбщегоНазначения
			.МенеджерОбъектаПоСсылке(ДанныеДляФормированияЭД.Шапка.ДокументСМаркировкамиДо)
			.ПолучитьКодыМаркируемойПродукции(ДанныеДляФормированияЭД.Шапка.ДокументСМаркировкамиДо));
		
		ТоварыСРНПТДо    = УчетПрослеживаемыхТоваровСервер.РНПТВДокументе(ДанныеДляФормированияЭД.Шапка.ДокументСМаркировкамиДо);
		ТоварыСРНПТПосле = УчетПрослеживаемыхТоваровСервер.РНПТВДокументе(ДанныеДляФормированияЭД.Шапка.ДокументСМаркировкамиПосле);
		ТоварыСРНПТДо.Свернуть(
			"Номенклатура,ХарактеристикаНоменклатуры,ГТД,НомерТовара,ЕдиницаПрослеживаемости,КодЕдиницыПрослеживаемости",
			"Количество");
		ТоварыСРНПТПосле.Свернуть(
			"Номенклатура,ХарактеристикаНоменклатуры,ГТД,НомерТовара,ЕдиницаПрослеживаемости,КодЕдиницыПрослеживаемости",
			"Количество");
		РНПТДо.Вставить(ДанныеДляФормированияЭД.Шапка.ДокументСМаркировкамиПосле, ТоварыСРНПТДо);
		РНПТПосле.Вставить(ДанныеДляФормированияЭД.Шапка.ДокументСМаркировкамиПосле, ТоварыСРНПТПосле);
	КонецЕсли;
	КодыУпаковокМаркируемойПродукцииПосле = ОбщегоНазначения
		.МенеджерОбъектаПоСсылке(ДанныеДляФормированияЭД.Шапка.ДокументСМаркировкамиПосле)
		.ПолучитьКодыМаркируемойПродукции(ДанныеДляФормированияЭД.ДокументыОснования);
		
	ПоискГТДПоСтроке = Ложь;
	Если ЕстьРеквизит(ДанныеДляФормированияЭД, "ГТДТоваров") И 
		(НЕ ДанныеДляФормированияЭД.ГТДТоваров.Колонки.Найти("НомерСтроки") = Неопределено) Тогда
		ПоискГТДПоСтроке = Истина;
	КонецЕсли;
	
	Для Каждого Товар Из ДанныеДляФормированияЭД.Товары Цикл
		
		Товар.Вставить("Характеристика", Товар.ХарактеристикаНоменклатуры);
		
	КонецЦикла;
	
	ШтрихкодыКомбинаций = Неопределено;
	ШтрихкодыНоменклатуры = Неопределено;
	ШтрихкодыПоТоварам(ДанныеДляФормированияЭД.Товары, ШтрихкодыКомбинаций, ШтрихкодыНоменклатуры);
	
	Для Каждого ЭлементТоваров Из ДанныеДляФормированияЭД.Товары Цикл
		
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.ИдентификаторСтроки           = ЭлементТоваров.ИдентификаторСтроки;
		НоваяСтрока.НомерСтроки                   = НомерСтроки;
		НоваяСтрока.НомерСтрокиИсходногоДокумента = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
		
		НоваяСтрока.ТоварНаименование = ЭлементТоваров.ТоварНаименование;
		
		Если НеобходимоУказатьЕдиницуИзмерения(ЭлементТоваров) Тогда
			
			НоваяСтрока.ЕдиницаИзмеренияКод = ПолучитьКодЕдиницыИзмерения(ЭлементТоваров);
			НоваяСтрока.ЕдиницаИзмеренияКодДоКорректировки = НоваяСтрока.ЕдиницаИзмеренияКод;
			НоваяСтрока.НаименованиеЕдиницыИзмеренияДоКорректировки = ЭлементТоваров.ЕдиницаИзмеренияНаименование;
			НоваяСтрока.НаименованиеЕдиницыИзмеренияПослеКорректировки = ЭлементТоваров.ЕдиницаИзмеренияНаименование;
			
		КонецЕсли;
		
		НоваяСтрока.КоличествоДоКорректировки          = ЭлементТоваров.КоличествоДоКорректировки;
		НоваяСтрока.Количество                         = ЭлементТоваров.Количество;
		
		СуммаБезНДСДоКорректировки = ЭлементТоваров.СуммаВсегоПоДокументуРеализации
			- ЭлементТоваров.СуммаНДСПоДокументуРеализации;
		СуммаБезНДС = ЭлементТоваров.СуммаВсего - ЭлементТоваров.СуммаНДС;
		
		Если ЭлементТоваров.КоличествоДоКорректировки <> 0 Тогда
		
			НоваяСтрока.ЦенаЗаЕдиницуИзмеренияДоКорректировки = СуммаБезНДСДоКорректировки
				/ ЭлементТоваров.КоличествоДоКорректировки;
			
		Иначе
			
			НоваяСтрока.ЦенаЗаЕдиницуИзмеренияДоКорректировки = 0;
			
		КонецЕсли;
		
		Если ЭлементТоваров.Количество <> 0 Тогда
			
			НоваяСтрока.ЦенаЗаЕдиницуИзмерения = СуммаБезНДС / ЭлементТоваров.Количество;
			
		Иначе
			
			НоваяСтрока.ЦенаЗаЕдиницуИзмерения = 0;
			
		КонецЕсли;
		
		НоваяСтрока.СтоимостьТоваровБезНалогаДоКорректировки = СуммаБезНДСДоКорректировки;
		НоваяСтрока.СтоимостьТоваровБезНалога                = СуммаБезНДС;
		НоваяСтрока.СтоимостьТоваровБезНалогаУвеличение      = Макс(СуммаБезНДС - СуммаБезНДСДоКорректировки, 0);
		НоваяСтрока.СтоимостьТоваровБезНалогаУменьшение      = Макс(СуммаБезНДСДоКорректировки - СуммаБезНДС, 0);
		НоваяСтрока.НалоговаяСтавкаДоКорректировки           = ЭлементТоваров.СтавкаНДС;
		НоваяСтрока.НалоговаяСтавка                          = ЭлементТоваров.СтавкаНДС;
		НоваяСтрока.СуммаНалогаДоКорректировки               = ЭлементТоваров.СуммаНДСПоДокументуРеализации;
		НоваяСтрока.СуммаНалога                              = ЭлементТоваров.СуммаНДС;
		
		СуммаНалогаУвеличение = Макс(ЭлементТоваров.СуммаНДС - ЭлементТоваров.СуммаНДСПоДокументуРеализации, 0);
		СуммаНалогаУменьшение = Макс(ЭлементТоваров.СуммаНДСПоДокументуРеализации - ЭлементТоваров.СуммаНДС, 0);
		
		НоваяСтрока.СуммаНалогаУвеличение = СуммаНалогаУвеличение;
		НоваяСтрока.СуммаНалогаУменьшение = СуммаНалогаУменьшение;		
		НоваяСтрока.СтоимостьТоваровСНалогомДоКорректировки = ЭлементТоваров.СуммаВсегоПоДокументуРеализации;
		НоваяСтрока.СтоимостьТоваровСНалогом                = ЭлементТоваров.Суммавсего;
		НоваяСтрока.СтоимостьТоваровСНалогомУвеличение      = Макс(
			ЭлементТоваров.СуммаВсего - ЭлементТоваров.СуммаВсегоПоДокументуРеализации, 0);
		НоваяСтрока.СтоимостьТоваровСНалогомУменьшение      = Макс(
			ЭлементТоваров.СуммаВсегоПоДокументуРеализации - ЭлементТоваров.СуммаВсего, 0);
		
		ТолькоУслуги = ТолькоУслуги И ЭтоУслуга(ЭлементТоваров.Номенклатура);
		
		НоваяСтрока.Номенклатура     = ЭлементТоваров.Номенклатура;
		НоваяСтрока.ЕдиницаИзмерения = ЭлементТоваров.ЕдиницаИзмерения;
		НоваяСтрока.ТоварНаименованиеНавигационнаяСсылка = ПолучитьНавигационнуюСсылку(
			ЭлементТоваров.Номенклатура, "Наименование");
		
		Если ЗначениеЗаполнено(ЭлементТоваров.ХарактеристикаНоменклатуры) Тогда
				
			НоваяСтрока.ХарактеристикаОписаниеТовара = Строка(ЭлементТоваров.ХарактеристикаНоменклатуры);
			
		КонецЕсли;
			
		НоваяСтрока.СортТовара                                     = "";
		НоваяСтрока.АртикулТовара                                  = ЭлементТоваров.НоменклатураАртикул;
		НоваяСтрока.КодТовара                                      = ЭлементТоваров.НоменклатураКод;
		НоваяСтрока.НаименованиеЕдиницыИзмеренияДоКорректировки    = ЭлементТоваров.ЕдиницаИзмеренияНаименование;
		НоваяСтрока.НаименованиеЕдиницыИзмеренияПослеКорректировки = ЭлементТоваров.ЕдиницаИзмеренияНаименование;
		
		НоваяСтрока.Сопоставление = СопоставленияНоменклатурыЭД(ЭлементТоваров.Номенклатура,
			ЭлементТоваров.ХарактеристикаНоменклатуры, ЭлементТоваров.ЕдиницаИзмерения);
			
		ЗаполнитьШтрихкодыТоваровВСопоставление(
			НоваяСтрока.Сопоставление,
			ШтрихкодыНоменклатуры,
			ШтрихкодыКомбинаций,
			ЭлементТоваров.Номенклатура,
			ЭлементТоваров.ХарактеристикаНоменклатуры,
			ЭлементТоваров.ЕдиницаИзмерения
		);
		
		Если Настройки.ВариантыЗаполненияПолей.ТоварКод = "Артикул" Тогда
				
			НоваяСтрока.ТоварКод = СокрЛП(ЭлементТоваров.Артикул);
			
		ИначеЕсли
			Настройки.ВариантыЗаполненияПолей.ТоварКод = "Штрихкод"
			И НоваяСтрока.Сопоставление.Свойство("ШтрихкодКомбинации")
		Тогда
		
			НоваяСтрока.ТоварКод = НоваяСтрока.Сопоставление.ШтрихкодКомбинации;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭлементТоваров.КодТНВЭД) Тогда
			
			НоваяСтрока.КодВидаТовара = ЭлементТоваров.КодТНВЭД;
			
		КонецЕсли;
		
		// Заполним ГТД товаров
		Если ЕстьРеквизит(ДанныеДляФормированияЭД, "ГТДТоваров") Тогда
			НоваяСтрока.СведенияОТаможеннойДекларации = СведенияОТаможеннойДекларации(ЭлементТоваров,
			ДанныеДляФормированияЭД.ГТДТоваров, ПоискГТДПоСтроке);
		КонецЕсли;
		
		Если КодыУпаковокМаркируемойПродукцииДо.Количество() = 1 Тогда
			НоваяСтрока.СведенияОМаркировкеДо = СведенияОКодахУпаковокМаркируемойПродукции(ЭлементТоваров, Неопределено, 
			КодыУпаковокМаркируемойПродукцииДо[ДанныеДляФормированияЭД.Шапка.ДокументСМаркировкамиПосле], Истина);
		Иначе
			НоваяСтрока.СведенияОМаркировкеДо = СведенияОКодахУпаковокМаркируемойПродукции(ЭлементТоваров, Неопределено, 
			КодыУпаковокМаркируемойПродукцииДо[ЭлементТоваров.ДокументОснование], Истина);
		КонецЕсли;
		
		НоваяСтрока.СведенияОМаркировкеПосле = СведенияОКодахУпаковокМаркируемойПродукции(ЭлементТоваров, Неопределено, 
			КодыУпаковокМаркируемойПродукцииПосле);
		
		// Заполним РНПТ до и после
		Если РНПТДо.Количество() = 1 И РНПТПосле.Количество() = 1 Тогда
			СведенияОПрослеживаемости = СведенияОПрослеживаемостиКорректировки(НоваяСтрока,
				РНПТДо[ДанныеДляФормированияЭД.Шапка.ДокументСМаркировкамиПосле], РНПТПосле[ДанныеДляФормированияЭД.Шапка.ДокументСМаркировкамиПосле]);
		Иначе
			СведенияОПрослеживаемости = СведенияОПрослеживаемостиКорректировки(НоваяСтрока,
				РНПТДо[ЭлементТоваров.ДокументОснование], РНПТПосле[ЭлементТоваров.ДокументОснование]);
		КонецЕсли;
		
		Если СведенияОПрослеживаемости <> Неопределено Тогда
			
			НоваяСтрока.СведенияОПрослеживаемости = СведенияОПрослеживаемости.ТаблицаРНПТ;
			
			Если НоваяСтрока.СведенияОТаможеннойДекларации = Неопределено Тогда
				
				НоваяСтрока.СведенияОТаможеннойДекларации = СведенияОПрослеживаемости.СписокГТД;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	ТекстОшибки = НСтр("ru = 'Не удалось заполнить итоговые стоимостные показатели. Возможные причины:
		|	- не заполнена табличная часть ""Товары""
		|	- значения колонок ""Сумма"", ""НДС"", ""Количество"" до и после корректировки не отличаются'");
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"ВсегоИзмененияСтоимости.ВсегоСтоимостьТоваровБезНалогаУвеличение",
		Товары.Итог("СтоимостьТоваровБезНалогаУвеличение"),
		ТекстОшибки
	);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"ВсегоИзмененияСтоимости.ВсегоСтоимостьТоваровСНалогомУвеличение",
		Товары.Итог("СтоимостьТоваровСНалогомУвеличение"),
		ТекстОшибки
	);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"ВсегоИзмененияСтоимости.ВсегоСуммаНалогаУвеличение",
		Товары.Итог("СуммаНалогаУвеличение"),
		ТекстОшибки
	);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"ВсегоИзмененияСтоимости.ВсегоСтоимостьТоваровБезНалогаУменьшение",
		Товары.Итог("СтоимостьТоваровБезНалогаУменьшение"),
		ТекстОшибки
	);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"ВсегоИзмененияСтоимости.ВсегоСтоимостьТоваровСНалогомУменьшение",
		Товары.Итог("СтоимостьТоваровСНалогомУменьшение"),
		ТекстОшибки
	);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"ВсегоИзмененияСтоимости.ВсегоСуммаНалогаУменьшение",
		Товары.Итог("СуммаНалогаУменьшение"),
		ТекстОшибки
	);	
	
	// Обработка ошибки через механизм сообщений пользователю.
	Если ДанныеДляФормированияЭД.Шапка.Свойство("Ссылка") Тогда
		
		СсылкаНаДокумент = ДанныеДляФормированияЭД.Шапка.Ссылка;
		
	Иначе
		
		СсылкаНаДокумент = ДанныеДляФормированияЭД.Ссылка;
		
	КонецЕсли;
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "ЕдиницаИзмеренияНаименование";
	ОписаниеОшибкиДляТаблицы.ТекстОшибки = НСтр("ru = 'Не заполнена наименование единицы измерения в справочнике ""Номенклатура"".'");
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "ЕдиницаИзмеренияКод";
	ОписаниеОшибкиДляТаблицы.ТекстОшибки = НСтр("ru = 'Не заполнен код единицы измерения в справочнике ""Номенклатура"".'");
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "Количество";
	ОписаниеОшибкиДляТаблицы.ТекстОшибки = НСтр("ru = 'Не указано количество товара в табличной части'");
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "ТоварКод";
	ОписаниеОшибкиДляТаблицы.КлючДанных  = "Номенклатура";
	ОписаниеОшибкиДляТаблицы.ПутьКДанным = "Объект.Код";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "ТоварНаименование";
	ОписаниеОшибкиДляТаблицы.КлючДанных  = "Номенклатура";
	ОписаниеОшибкиДляТаблицы.ПутьКДанным = "Объект.НаименованиеПолное";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "Количество";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = СсылкаНаДокумент;
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Товары.Количество";
	ОписаниеОшибкиДляТаблицы.ПолеНомераСтроки = "НомерСтроки";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "КоличествоДоКорректировки";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = СсылкаНаДокумент;
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Товары.КоличествоДоКорректировки";
	ОписаниеОшибкиДляТаблицы.ПолеНомераСтроки = "НомерСтроки";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "ЦенаЗаЕдиницуИзмерения";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = СсылкаНаДокумент;
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Товары.Цена";
	ОписаниеОшибкиДляТаблицы.ПолеНомераСтроки = "НомерСтроки";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "ЦенаЗаЕдиницуИзмеренияДоКорректировки";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = СсылкаНаДокумент;
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Товары.ЦенаДоКорректировки";
	ОписаниеОшибкиДляТаблицы.ПолеНомераСтроки = "НомерСтроки";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "СтоимостьТоваровБезНалога";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = СсылкаНаДокумент;
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Товары.Сумма";
	ОписаниеОшибкиДляТаблицы.ПолеНомераСтроки = "НомерСтроки";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "СтоимостьТоваровБезНалогаДоКорректировки";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = СсылкаНаДокумент;
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Товары.СуммаДоКорректировки";
	ОписаниеОшибкиДляТаблицы.ПолеНомераСтроки = "НомерСтроки";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "СуммаНалога";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = СсылкаНаДокумент;
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Товары.СуммаНДС";
	ОписаниеОшибкиДляТаблицы.ПолеНомераСтроки = "НомерСтроки";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "СуммаНалогаДоКорректировки";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = СсылкаНаДокумент;
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Товары.СуммаНДСДоКорректировки";
	ОписаниеОшибкиДляТаблицы.ПолеНомераСтроки = "НомерСтроки";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "ЕдиницаИзмеренияНаименование";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = "ЕдиницаИзмерения";
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Наименование";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "ЕдиницаИзмеренияКод";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = "ЕдиницаИзмерения";
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Код";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "ЕдиницаИзмеренияКодДоКорректировки";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = "ЕдиницаИзмерения";
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Код";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "Признак";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = "Номенклатура";
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.ТипНоменклатуры";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ТекстОшибки = НСтр("ru = 'для формирования электронного документа необходимо указать налоговую ставку'");
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "НалоговаяСтавка";
	ОписаниеОшибкиДляТаблицы.ТекстОшибки = ТекстОшибки;
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "НалоговаяСтавка";
	ОписаниеОшибкиДляТаблицы.ТекстОшибки = ТекстОшибки;
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(Товары, ОписаниеОшибкиДляТаблицы);
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, Товары, "СведенияОТоварах");
	СохранитьРеквизитВДереве(ДеревоДанных, "ТолькоУслуги", ТолькоУслуги);
	Возврат ДеревоДанных;
	
КонецФункции

Функция НоваяТаблицаТоваровУКД_2020()
	
	Число_26_11 = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(26,11));
	Число_19_2  = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19,2));
	Строка_10   = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10));
	Строка_50   = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50));
	Строка_100  = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100));
	Строка_255  = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(255));
	Строка_1000 = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(1000));
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(6)));
	Результат.Колонки.Добавить("НомерСтрокиИсходногоДокумента");
	Результат.Колонки.Добавить("ТоварНаименование");
	Результат.Колонки.Добавить("ЕдиницаИзмеренияКодДоКорректировки");
	Результат.Колонки.Добавить("ЕдиницаИзмеренияКод");
	Результат.Колонки.Добавить("Количество", Число_26_11);
	Результат.Колонки.Добавить("КоличествоДоКорректировки", Число_26_11);
	Результат.Колонки.Добавить("ЦенаЗаЕдиницуИзмеренияДоКорректировки", Число_26_11);
	Результат.Колонки.Добавить("ЦенаЗаЕдиницуИзмерения", Число_26_11);
	Результат.Колонки.Добавить("СтоимостьТоваровБезНалогаДоКорректировки", Число_19_2);
	Результат.Колонки.Добавить("СтоимостьТоваровБезНалога", Число_19_2);
	Результат.Колонки.Добавить("СтоимостьТоваровБезНалогаУвеличение", Число_19_2);
	Результат.Колонки.Добавить("СтоимостьТоваровБезНалогаУменьшение", Число_19_2);
	Результат.Колонки.Добавить("НалоговаяСтавкаДоКорректировки");
	Результат.Колонки.Добавить("НалоговаяСтавка");
	Результат.Колонки.Добавить("СуммаНалогаДоКорректировки", Число_19_2);
	Результат.Колонки.Добавить("СуммаНалога", Число_19_2);
	Результат.Колонки.Добавить("СуммаНалогаУвеличение");
	Результат.Колонки.Добавить("СуммаНалогаУменьшение");
	Результат.Колонки.Добавить("СуммаАкцизаДоКорректировки", Число_19_2);
	Результат.Колонки.Добавить("СуммаАкциза", Число_19_2);
	Результат.Колонки.Добавить("СуммаАкцизаУвеличение");
	Результат.Колонки.Добавить("СуммаАкцизаУменьшение");
	Результат.Колонки.Добавить("СтоимостьТоваровСНалогомДоКорректировки", Число_19_2);
	Результат.Колонки.Добавить("СтоимостьТоваровСНалогом", Число_19_2);
	Результат.Колонки.Добавить("СтоимостьТоваровСНалогомУвеличение", Число_19_2);
	Результат.Колонки.Добавить("СтоимостьТоваровСНалогомУменьшение", Число_19_2);
	Результат.Колонки.Добавить("ХарактеристикаОписаниеТовара", Строка_1000);
	Результат.Колонки.Добавить("АртикулТовара", Строка_50);
	Результат.Колонки.Добавить("КодТовара", Строка_100);
	Результат.Колонки.Добавить("НаименованиеЕдиницыИзмеренияДоКорректировки", Строка_255);
	Результат.Колонки.Добавить("НаименованиеЕдиницыИзмеренияПослеКорректировки", Строка_255);
	Результат.Колонки.Добавить("КодВидаТовара", Строка_10);
	Результат.Колонки.Добавить("СортТовара", Строка_10);
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("ЕдиницаИзмерения");
	Результат.Колонки.Добавить("ТоварНаименованиеНавигационнаяСсылка");
	Результат.Колонки.Добавить("Сопоставление");
	Результат.Колонки.Добавить("ИдентификаторСтроки");
	Результат.Колонки.Добавить("СведенияОМаркировкеДо");
	Результат.Колонки.Добавить("СведенияОМаркировкеПосле");
	Результат.Колонки.Добавить("СведенияОПрослеживаемости");
	Результат.Колонки.Добавить("СведенияОТаможеннойДекларации");
	Возврат Результат;
	
КонецФункции

Функция СведенияОТаможеннойДекларации(СтрокаДокумента, ТаблицаГТД, ПоискГТДПоСтроке)
	
	// Найдем данные для вывода в ЭД
	Если ПоискГТДПоСтроке Тогда
		СтруктураПоиска = Новый Структура("НомерСтроки, ДокументОснование");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаДокумента);
	Иначе
		СтруктураПоиска = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаДокумента);
		Если СтруктураПоиска.ХарактеристикаНоменклатуры = Неопределено Тогда
			СтруктураПоиска.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	НайденныеСтроки = ТаблицаГТД.НайтиСтроки(СтруктураПоиска);
	
	// Не нашли по ГТД
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СписокГТД = Новый ТаблицаЗначений;
	СписокГТД.Колонки.Добавить("ТаможеннаяДекларацияНомер", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(29)));
	СписокГТД.Колонки.Добавить("СтранаПроисхожденияКод", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(3)));
	
	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
		
		НоваяСтрока = СписокГТД.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
	КонецЦикла;
	
	Возврат СписокГТД;
	
КонецФункции

Функция СведенияОПрослеживаемостиКорректировки(СтрокаДокумента, ТаблицаРНПТДо, ТаблицаРНПТПосле)
	
	// Найдем данные для вывода в ЭД
	СтруктураПоиска = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры");
	
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаДокумента);
	Если СтруктураПоиска.ХарактеристикаНоменклатуры = Неопределено Тогда
		СтруктураПоиска.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	НайденныеСтрокиДо = ТаблицаРНПТДо.НайтиСтроки(СтруктураПоиска);
	НайденныеСтрокиПосле = ТаблицаРНПТПосле.НайтиСтроки(СтруктураПоиска);
	
	// Не нашли по ГТД прослеживаемого товара
	Если НайденныеСтрокиДо.Количество() = 0
		И НайденныеСтрокиПосле.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ТаблицаГТД = Новый ТаблицаЗначений;
	ТаблицаГТД.Колонки.Добавить("НомерТовара", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(29)));
	ТаблицаГТД.Колонки.Добавить("ЕдиницаИзмеренияКод", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(4)));
	ТаблицаГТД.Колонки.Добавить("КоличествоТовараДоИзменения", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(26, 11)));
	ТаблицаГТД.Колонки.Добавить("КоличествоТовараПослеИзменения", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(26, 11)));
	ТаблицаГТД.Колонки.Добавить("КоличествоТовараУвеличение", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(26, 11)));
	ТаблицаГТД.Колонки.Добавить("КоличествоТовараУменьшение", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(26, 11)));
	ТаблицаГТД.Колонки.Добавить("КоличествоТовараУчетноеДоИзменения", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(26, 11)));
	ТаблицаГТД.Колонки.Добавить("КоличествоТовараУчетноеПослеИзменения", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(26, 11)));
	ТаблицаГТД.Колонки.Добавить("КоличествоТовараУчетноеУвеличение", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(26, 11)));
	ТаблицаГТД.Колонки.Добавить("КоличествоТовараУчетноеУменьшение", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(26, 11)));
	
	// Пройдемся по РНПТ до
	СтруктураПоискаГТД = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,НомерТовара");
	ЗаполнитьЗначенияСвойств(СтруктураПоискаГТД, СтруктураПоиска);
	Для Каждого СтрокаРНПТДо Из НайденныеСтрокиДо Цикл
		
		НоваяСтрока = ТаблицаГТД.Добавить();
		НоваяСтрока.НомерТовара = СокрЛП(СтрокаРНПТДо.НомерТовара);
		НоваяСтрока.ЕдиницаИзмеренияКод = СокрЛП(СтрокаРНПТДо.КодЕдиницыПрослеживаемости);
		НоваяСтрока.КоличествоТовараДоИзменения = СтрокаРНПТДо.Количество
			* ?(СтрокаРНПТДо.Количество < 0, -1, 1);
		
		// Найдем что осталось после
		СтруктураПоискаГТД.НомерТовара = СтрокаРНПТДо.НомерТовара;
		НайденныеСтроки = ТаблицаРНПТПосле.НайтиСтроки(СтруктураПоискаГТД);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			НоваяСтрока.КоличествоТовараПослеИзменения = НайденныеСтроки[0].Количество;
			
		Иначе
			
			НоваяСтрока.КоличествоТовараПослеИзменения = 0;
			
		КонецЕсли;
		
		Разница = НоваяСтрока.КоличествоТовараПослеИзменения - НоваяСтрока.КоличествоТовараДоИзменения;
		
		Если Разница >= 0 Тогда
			
			// Увеличилось количество
			НоваяСтрока.КоличествоТовараУвеличение = Разница;
			НоваяСтрока.КоличествоТовараУменьшение = 0;
			
		Иначе
			
			// Уменьшилось количество
			НоваяСтрока.КоличествоТовараУвеличение = 0;
			НоваяСтрока.КоличествоТовараУменьшение = - Разница;
			
		КонецЕсли;
		
		НоваяСтрока.КоличествоТовараУчетноеДоИзменения = НоваяСтрока.КоличествоТовараДоИзменения;
		НоваяСтрока.КоличествоТовараУчетноеПослеИзменения = НоваяСтрока.КоличествоТовараПослеИзменения;
		НоваяСтрока.КоличествоТовараУчетноеУвеличение = НоваяСтрока.КоличествоТовараУвеличение;
		НоваяСтрока.КоличествоТовараУчетноеУменьшение = НоваяСтрока.КоличествоТовараУменьшение;
		
	КонецЦикла;
	
	// Добавим новые РНПТ
	СтруктураПоискаГТД = Новый Структура("НомерТовара");
	Для Каждого СтрокаРНППосле Из НайденныеСтрокиПосле Цикл
		
		// Исключим ранее заполненные строки
		НомерТовара = СокрЛП(СтрокаРНППосле.НомерТовара);
		СтруктураПоискаГТД.НомерТовара = НомерТовара;
		
		Если ТаблицаГТД.НайтиСтроки(СтруктураПоискаГТД).Количество() > 0 Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = ТаблицаГТД.Добавить();
		НоваяСтрока.НомерТовара = НомерТовара;
		НоваяСтрока.ЕдиницаИзмеренияКод = СокрЛП(СтрокаРНППосле.КодЕдиницыПрослеживаемости);
		НоваяСтрока.КоличествоТовараДоИзменения = 0;
		НоваяСтрока.КоличествоТовараПослеИзменения = СтрокаРНППосле.Количество
			* ?(СтрокаРНППосле.Количество < 0, -1, 1);
		НоваяСтрока.КоличествоТовараУвеличение = НоваяСтрока.КоличествоТовараПослеИзменения;
		НоваяСтрока.КоличествоТовараУменьшение = 0;
		НоваяСтрока.КоличествоТовараУчетноеДоИзменения = НоваяСтрока.КоличествоТовараДоИзменения;
		НоваяСтрока.КоличествоТовараУчетноеПослеИзменения = НоваяСтрока.КоличествоТовараПослеИзменения;
		НоваяСтрока.КоличествоТовараУчетноеУвеличение = НоваяСтрока.КоличествоТовараУвеличение;
		НоваяСтрока.КоличествоТовараУчетноеУменьшение = НоваяСтрока.КоличествоТовараУменьшение;
		
	КонецЦикла;
	
	// Получим страну
	СписокГТД = Новый ТаблицаЗначений;
	СписокГТД.Колонки.Добавить("ТаможеннаяДекларацияНомер", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(29)));
	СписокГТД.Колонки.Добавить("СтранаПроисхожденияКод", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(3)));
	
	Если НайденныеСтрокиПосле.Количество() > 0 Тогда
		
		ГТД = НайденныеСтрокиПосле[0].ГТД;
		
	Иначе
		
		ГТД = НайденныеСтрокиДо[0].ГТД;
		
	КонецЕсли;
	
	НоваяСтрока = СписокГТД.Добавить();
	НоваяСтрока.ТаможеннаяДекларацияНомер = "-";
	НоваяСтрока.СтранаПроисхожденияКод = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГТД, "Страна.Код");
	
	Результат = Новый Структура;
	Результат.Вставить("ТаблицаРНПТ", ТаблицаГТД);
	Результат.Вставить("СписокГТД", СписокГТД);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоУслуга(Товар)
	
	Возврат Товар.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга
	
КонецФункции

Процедура ЗаполнитьДанныеИсходныхДокументов(ДеревоДанных, ДанныеДляФормированияЭД, Настройки)
	
	Шапка = ДанныеДляФормированияЭД.Шапка;
	
	Если Не ЗначениеЗаполнено(Шапка.НомерИсходногоДокумента) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИсходныеДокументы = Новый ТаблицаЗначений;
	ИсходныеДокументы.Колонки.Добавить("НомерИсходногоДокумента");
	ИсходныеДокументы.Колонки.Добавить("ДатаИсходногоДокумента");
	ИсходныеДокументы.Колонки.Добавить("ИсправленияИсходногоДокумента");
	
	НомерДокумента = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(
		Новый Структура("Номер", Шапка.НомерИсходногоДокумента));
	
	СтрокаИсходныеДокументы = ИсходныеДокументы.Добавить();
	СтрокаИсходныеДокументы.НомерИсходногоДокумента = НомерДокумента;
	СтрокаИсходныеДокументы.ДатаИсходногоДокумента  = Шапка.ДатаИсходногоДокумента;
		
	Если Шапка.УчитыватьИсправлениеИсходногоДокумента Тогда
		
		ИсправленияИсходногоДокумента = Новый ТаблицаЗначений;
		ИсправленияИсходногоДокумента.Колонки.Добавить("НомерИсправленияИсходногоДокумента");
		ИсправленияИсходногоДокумента.Колонки.Добавить("ДатаИсправленияИсходногоДокумента");
		
		СтрокаИсправленияИсходногоДокумента = ИсправленияИсходногоДокумента.Добавить();
		СтрокаИсправленияИсходногоДокумента.НомерИсправленияИсходногоДокумента = Шапка.НомерИсправленияИсходногоДокумента;
		СтрокаИсправленияИсходногоДокумента.ДатаИсправленияИсходногоДокумента = Шапка.ДатаИсправленияИсходногоДокумента;
		СтрокаИсходныеДокументы.ИсправленияИсходногоДокумента = ИсправленияИсходногоДокумента;
		
	КонецЕсли;
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ИсходныеДокументы, "ИсходныеДокументы");
	
КонецПроцедуры

Процедура РазделитьСтрокуТовараКСФ(Товары, СтрокаКРазделению, ТоварыКорректируемогоСФ)
	
	ИсключатьСвойства = "ГТД, Количество, Сумма, СуммаВсего, СуммаНДС, СведенияОПрослеживаемости";
	ОбщееКоличество = СтрокаКРазделению.Количество;
	
	Для Каждого СтрокаСведенияОПрослеживаемости Из СтрокаКРазделению.СведенияОПрослеживаемости Цикл
		
		ЭтоНовыйТовар = СтрокаСведенияОПрослеживаемости.КоличествоТовараДоИзменения = 0;
		СписалиПолностью = СтрокаСведенияОПрослеживаемости.КоличествоТовараПослеИзменения = 0;
		ИзменилосьКоличество = НЕ ЭтоНовыйТовар И НЕ СписалиПолностью;
		
		Если ЭтоНовыйТовар ИЛИ ИзменилосьКоличество Тогда
			
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКРазделению,, ИсключатьСвойства);
			
			НоваяСтрока.ГТД        = СтрокаСведенияОПрослеживаемости.РНПТ;
			НоваяСтрока.Количество = СтрокаСведенияОПрослеживаемости.КоличествоТовараПослеИзменения;
			НоваяСтрока.Сумма      = НоваяСтрока.Количество * СтрокаКРазделению.Цена;
			
			Если ОбщееКоличество <> 0 
				И НоваяСтрока.Количество <> 0 Тогда
				
				СуммаНДС = СтрокаКРазделению.СуммаНДС / ОбщееКоличество * НоваяСтрока.Количество;
				
			Иначе
				
				СуммаНДС = 0;
				
			КонецЕсли;
			
			НоваяСтрока.СуммаНДС   = СуммаНДС;
			НоваяСтрока.СуммаВсего = НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС;
			
		КонецЕсли;
		
		// Удаляем строки из данных предыдущего СФ
		Если СписалиПолностью ИЛИ ИзменилосьКоличество Тогда
			
			ТоварыСФкУдалениюОтбор = Новый Структура();
			ТоварыСФкУдалениюОтбор.Вставить("Номенклатура"              , СтрокаКРазделению.Номенклатура);
			ТоварыСФкУдалениюОтбор.Вставить("ХарактеристикаНоменклатуры", СтрокаКРазделению.ХарактеристикаНоменклатуры);
			ТоварыСФкУдалениюОтбор.Вставить("ГТД"                       , СтрокаСведенияОПрослеживаемости.РНПТ);
			ТоварыСФкУдалениюОтбор.Вставить("Цена"                      , СтрокаКРазделению.Цена);
			ТоварыСФкУдалениюОтбор.Вставить("Количество"                , СтрокаСведенияОПрослеживаемости.КоличествоТовараДоИзменения);
			
			ТоварыСФкУдалению = ТоварыКорректируемогоСФ.НайтиСтроки(ТоварыСФкУдалениюОтбор);
			
			Для Каждого СтрокаКУдалению Из ТоварыСФкУдалению Цикл
				
				ТоварыКорректируемогоСФ.Удалить(СтрокаКУдалению);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры                                           

Процедура ЗаполнитьСписокНоменклатурыКСФ(СписокНоменклатуры, ТоварыЭД, ТоварыСФПоОснованию)
	
	Для Каждого СтрокаТовара Из ТоварыЭД Цикл
		
		// Обработаем товары, у которых изменилось количество.
		Если ЗначениеЗаполнено(СтрокаТовара.СведенияОИзмененииКоличества) Тогда
			
			ОбработатьТоварСИзмененнымКоличеством(СписокНоменклатуры, СтрокаТовара, ТоварыСФПоОснованию);
			
		Иначе
			
			НоваяСтрока = СписокНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовара);
			
		КонецЕсли;
		
	КонецЦикла; 
	
	// Добавим оставшиеся товары, которые не менялись из предыдущего СФ.
	Если ТоварыСФПоОснованию <> Неопределено Тогда
		Для Каждого Товар Из ТоварыСФПоОснованию Цикл
			
			НоваяСтрока = СписокНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар); 
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ТоварыУКДПоДокументуПоступления(ДокументПоступления)
	
	ДокументОбъект = Документы.КорректировкаПоступления.СоздатьДокумент();
	СтароеЗначениеПрава = ПравоПользователя("ВводНаОснованииПроведенныхДокументов", ДокументОбъект);
	ОбновитьПравоВКэше("ВводНаОснованииПроведенныхДокументов", Ложь, ДокументОбъект);
	ДокументОбъект.Заполнить(ДокументПоступления);
	ОбновитьПравоВКэше("ВводНаОснованииПроведенныхДокументов", СтароеЗначениеПрава, ДокументОбъект);
	
	Возврат ДокументОбъект.Товары.Выгрузить();
	
КонецФункции

Процедура ОбработатьТоварСИзмененнымКоличеством(СписокНоменклатуры, СтрокаТовара, ТоварыСФПоОснованию)
	
	ИсключатьСвойства = "Цена, Количество, Сумма, СуммаВсего, СуммаНДС";
	
	СведенияОИзменении = СтрокаТовара.СведенияОИзмененииКоличества;
	СписалиПолностью = СведенияОИзменении.Количество = 0;
	
	Если НЕ СписалиПолностью Тогда
		
		НоваяСтрока = СписокНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовара,, ИсключатьСвойства);
		
		НоваяСтрока.Количество = СведенияОИзменении.Количество;
		НоваяСтрока.Цена       = СведенияОИзменении.ЦенаЗаЕдиницуИзмерения;
		НоваяСтрока.Сумма      = СведенияОИзменении.СтоимостьТоваровБезНалога;
		НоваяСтрока.СуммаНДС   = СведенияОИзменении.СуммаНалога;
		НоваяСтрока.СуммаВсего = НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС;
		
	КонецЕсли;	
	
	Если ТоварыСФПоОснованию <> Неопределено Тогда
		
		ТоварИзмКоличествоОтбор = Новый Структура();
		ТоварИзмКоличествоОтбор.Вставить("Номенклатура", СтрокаТовара.Номенклатура);
		ТоварИзмКоличествоОтбор.Вставить("ГТД"         , СтрокаТовара.ГТД);
		ТоварИзмКоличествоОтбор.Вставить("Цена"        , СведенияОИзменении.ЦенаЗаЕдиницуИзмеренияДоКорректировки);
		ТоварИзмКоличествоОтбор.Вставить("Количество"  , СведенияОИзменении.КоличествоДоКорректировки);
		
		ТоварыКСФкУдалению = ТоварыСФПоОснованию.НайтиСтроки(ТоварИзмКоличествоОтбор);
		
		Для Каждого СтрокаКУдалению Из ТоварыКСФкУдалению Цикл
			
			ТоварыСФПоОснованию.Удалить(СтрокаКУдалению);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Разделяет строки товаров, если у товара присутствуют сведения о прослеживаемости.
//
// Параметры:
// 	Товары - ТаблицаЗначений - таблица с товарами для разделения.
// 	СпособРазделения - Строка – параметр, указывающий метод разделения строки:
//	    * УКД - применяется для универсального корретировочного документа.
//	    * УПД - применяется для универсального передаточного документа.
//	    * КСФ - применяется для корректировочного счета-фактуры.
//	ТоварыКорректируемогоСФ - ТаблицаЗначений - товары корректируемого счета-фактуры.
//                                          Передается только если СпособРазделения принимает значение "КСФ".
//
Процедура РазделитьТоварыПоДаннымСведенийОПрослеживаемости(Товары, СпособРазделения, ТоварыКорректируемогоСФ = Неопределено)
	
	Если НЕ КолонкаСуществует(Товары, "СведенияОПрослеживаемости") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтрокиКУдалению = Новый Массив();
	
	Для Каждого СтрокаТовара Из Товары Цикл
		
		Если ЗначениеЗаполнено(СтрокаТовара.СведенияОПрослеживаемости) Тогда
			
			Если СпособРазделения = "УКД" Тогда
				
				РазделитьСтрокуТовараУКД(Товары, СтрокаТовара);	
				
			ИначеЕсли СпособРазделения = "УПД" Тогда
				
				РазделитьСтрокуТовараУПД(Товары, СтрокаТовара);
				
			ИначеЕсли СпособРазделения = "КСФ"
				И ТоварыКорректируемогоСФ <> Неопределено Тогда
				
				РазделитьСтрокуТовараКСФ(Товары, СтрокаТовара, ТоварыКорректируемогоСФ); 
				
			Иначе
				
				Продолжить;
				
			КонецЕсли;
			
			СтрокиКУдалению.Добавить(СтрокаТовара);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТоварКУдалению Из СтрокиКУдалению Цикл
		
		Товары.Удалить(ТоварКУдалению);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаСведенияОпрослеживаемостиУКД_2020()
	
	Число26_11 = ОбщегоНазначения.ОписаниеТипаЧисло(26, 11);
	Число19_2  = ОбщегоНазначения.ОписаниеТипаЧисло(19, 2);
	
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("НомерТовара"                          , ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Результат.Колонки.Добавить("ЕдиницаИзмеренияКод"                  , ОбщегоНазначения.ОписаниеТипаСтрока(4));
	Результат.Колонки.Добавить("КоличествоТовараДоИзменения"          , Число26_11);
	Результат.Колонки.Добавить("КоличествоТовараПослеИзменения"       , Число26_11);
	Результат.Колонки.Добавить("КоличествоТовараУвеличение"           , Число26_11);
	Результат.Колонки.Добавить("КоличествоТовараУменьшение"           , Число26_11);
	Результат.Колонки.Добавить("КоличествоТовараУчетноеДоИзменения"   , Число26_11);
	Результат.Колонки.Добавить("КоличествоТовараУчетноеПослеИзменения", Число26_11);
	Результат.Колонки.Добавить("КоличествоТовараУчетноеУвеличение"    , Число26_11);
	Результат.Колонки.Добавить("КоличествоТовараУчетноеУменьшение"    , Число26_11);
	Результат.Колонки.Добавить("СтоимостьБезНДСДоИзменения",            Число19_2);
	Результат.Колонки.Добавить("СтоимостьБезНДСПослеИзменения",         Число19_2);
	Результат.Колонки.Добавить("СтоимостьБезНДСУвеличение",             Число19_2);
	Результат.Колонки.Добавить("СтоимостьБезНДСУменьшение",             Число19_2);
	
	Возврат Результат; 
	
КонецФункции

#КонецОбласти

#Область Получение

Процедура НайтиСоздатьУКДДокументКорректировки_2020(ДеревоДанных, СсылкаНаВладельца, СпособОбработки, ОписаниеОшибки)
	
	ДанныеЗаполнения = Новый Структура(
		"ЗаполнятьПоСтуктуре,ХозОперация,СсылкаНаВладельца",
		Истина,
		Справочники.ХозОперации.КорректировкаПоступленияКорректировкаПоСогласованиюСторон,
		СсылкаНаВладельца
	);
	ДополнитьДанныеЗаполненияВалютой(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияИсправлением(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияВходящимДокументом("Документа", ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияИсходнымДокументом(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияКонтрагентомИсточникГруппа(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОрганизациейИсточникГруппа(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияПодразделениемКомпанииИсточникГруппа(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОснованиемСчетаФактуры(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияДоговорВзаиморасчетов(ДеревоДанных, ДанныеЗаполнения);
	
	Если ДанныеЗаполнения.Исправление Тогда
		
		ДанныеЗаполнения.ХозОперация =  Справочники.ХозОперации.КорректировкаПоступленияИсправлениеВПервичныхДокументах;
		
	КонецЕсли;
	
	ДополнитьДанныеЗаполненияТоварамиУКД(ДеревоДанных, ДанныеЗаполнения, "КорректировкаПоступления");
	
	ЗаполнитьДокументКорректировкиПоступления(ДанныеЗаполнения, СсылкаНаВладельца, ОписаниеОшибки);
	
КонецПроцедуры

Процедура НайтиСоздатьУКДКорректировочныйСчетФактуру_2020(ДеревоДанных, СсылкаНаВладельца, СпособОбработки, ОписаниеОшибки)
	
	ДанныеЗаполнения = Новый Структура(
		"ЗаполнятьПоСтуктуре,ХозОперация",
		Истина,
		Справочники.ХозОперации.СчетФактураПолученныйКорректировка
	);
	ДополнитьДанныеЗаполненияВалютой(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияИсправлением(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияВходящимДокументом("Документа", ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияИсходнымДокументом(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияКонтрагентомИсточникГруппа(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОрганизациейИсточникГруппа(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияПодразделениемКомпанииИсточникГруппа(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияДоговорВзаиморасчетов(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОснованиемДляСчетаФактуры(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияТоварамиУКД(ДеревоДанных, ДанныеЗаполнения, "СчетФактураПолученный");
	
	ЗаполнитьДокументСчетФактурыПолученогоУКД(ДанныеЗаполнения, СсылкаНаВладельца, ОписаниеОшибки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область УПД_5_02

#Область Отправка

Процедура ЗаполнитьДанныеДляУПДИнформацияПродавцаФНС_5_02(Основание, СтруктураЭД, Данные, Отказ)
	
	ДокументСсылкаСЧФ = Основание;
	
	Если Не ЗначениеЗаполнено(ДокументСсылкаСЧФ) Тогда
		
		ТекстСообщения = НСтр("ru = 'Для формирования универсального передаточного документа счет-фактура должна быть заполнена.'");
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
	ДанныеДляФормированияЭД = Документы.СчетФактураВыданный.ДанныеДляУПДЭД(ДокументСсылкаСЧФ);
	ЗаполнитьДанныеПервичногоДокументаУПД_5_02(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	ЗаполнитьДеревоДанныхУПД_5_02(ДанныеДляФормированияЭД, СтруктураЭД, Данные, Отказ);
	ЗаполнитьДанныеПлатежныхДокументов(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	ЗаполнитьДанныеАвансовыхСчетовФактур(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	ЗаполнитьИнформациюОТоварах_5_02(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеДляСЧФИнформацияПродавцаФНС_5_02(Основание, СтруктураЭД, Данные, Отказ)
	
	ДанныеДляФормированияЭД = Документы.СчетФактураВыданный.ДанныеДляУПДЭД(Основание);
	ЗаполнитьДеревоДанныхУПД_5_02(ДанныеДляФормированияЭД, СтруктураЭД, Данные, Отказ);
	ЗаполнитьДанныеПлатежныхДокументов(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	ЗаполнитьДанныеАвансовыхСчетовФактур(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	ЗаполнитьИнформациюОТоварах_5_02(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_5_02(Основание, СтруктураЭД, Данные, Отказ) Экспорт
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
		
		ДанныеДляФормированияЭД = ДайДанныеВозвратПоставщикуДляУПД(Основание);
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда 
		
		ДанныеДляФормированияЭД = ДайДанныеКорректировкиРеализацииИУслугДляУПД(Основание);
		
	Иначе
		
		ДанныеДляФормированияЭД = ДайДанныеРеализацииТоваровИУслугДляУПД(Основание);
		
	КонецЕсли;
	
	ДокументыОснования = Новый Массив;
	ДокументыОснования.Добавить(Основание);
	ДанныеДляФормированияЭД.Вставить("ДокументыОснования", ДокументыОснования);
	
	ЗаполнитьДанныеПервичногоДокументаУПД_5_02(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	ЗаполнитьДеревоДанныхУПД_5_02(ДанныеДляФормированияЭД, СтруктураЭД, Данные, Отказ);
	ЗаполнитьДанныеПлатежныхДокументов(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	ЗаполнитьИнформациюОТоварах_5_02(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПервичногоДокументаУПД_5_02(ДанныеДляФормированияЭД, СтруктураЭД, ДеревоДанных)
	
	Шапка         = ДанныеДляФормированияЭД.Шапка;
	ВидОперацииЭД = ВидОперацииЭД(Шапка);
	//СохранитьРеквизитВДереве(ДеревоДанных, "ВидОперации", ВидОперацииЭД);
	
	//СодержаниеОперации = СодержаниеОперации(ДанныеДляФормированияЭД.Товары);
	//СохранитьРеквизитВДереве(ДеревоДанных, "СодержаниеОперации", СодержаниеОперации);
	//
	//СохранитьРеквизитВДереве(ДеревоДанных, "ДатаОтгрузкиТоваров", Шапка.Дата);
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОПередаче.Операция.ДатаОтгрузки",
		Шапка.Дата);
	
	Если ЗначениеЗаполнено(Шапка.ДокументОснование) Тогда
		
		Если ТипЗнч(Шапка.Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			
			Если ДанныеДляФормированияЭД.Свойство("ДокументыОснования") Тогда
				СохранитьРеквизитВДереве(ДеревоДанных, "ДокументыОснованияДокументаОтгрузки", ДанныеДляФормированияЭД.ДокументыОснования);
			Иначе
				ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шапка.ДокументОснование, "ДокументОснование");
				Если ЗначениеЗаполнено(ДокументОснование) Тогда
					ДокументыОснованияДокументаОтгрузки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументОснование);
					СохранитьРеквизитВДереве(ДеревоДанных, "ДокументыОснованияДокументаОтгрузки", ДокументыОснованияДокументаОтгрузки);
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			ДокументыОснованияДокументаОтгрузки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Шапка.ДокументОснование);
			СохранитьРеквизитВДереве(ДеревоДанных, "ДокументыОснованияДокументаОтгрузки", ДокументыОснованияДокументаОтгрузки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьОснованиеОтгрузкиТоваров_5_02(Шапка, ДеревоДанных);
	
	//ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ТранспортнаяНакладная(), "ТранспортнаяНакладная");
	
КонецПроцедуры

Функция ЗаполнитьДеревоДанныхУПД_5_02(ДанныеДляФормированияЭД, СтруктураЭД, ДеревоДанных, Отказ)
	
	Шапка = ДанныеДляФормированияЭД.Шапка;
	
	ОбщийПуть = "СведенияОСчетеФактуре.";
	
	ПоддерживаемыеФорматы = ФорматыЭДО_ФНС.ПоддерживаемыеФорматы();
	ФорматУПД = ПоддерживаемыеФорматы.УПД_5_02.ИнформацияПродавца;
	
	СохранитьРеквизитВДереве(ДеревоДанных, "ВидСчетаФактуры", "Реализация");
	
	// Сейчас пока всегда выставляем в значение 1. Так как остальные операции еще не реализованы
	// Для Функция = СЧФ:
	//  1 - счет-фактура, выставляемый при реализации товаров (работ, услуг), передаче имущественных прав;
	//  2 - счет-фактура, выставляемый при получении оплаты, частичной оплаты в счет предстоящих поставок
	//      товаров (выполнения работ, оказания услуг), передачи имущественных прав;
	//  3 - счет-фактура, применяемый в случае реализации комиссионером (агентом, экспедитором,
	//      застройщиком или заказчиком, выполняющим функции застройщика) двум и более покупателям
	//      (приобретения у двух и более продавцов) товаров (работ, услуг), имущественных прав от своего имени.
	//
	// Для Функция = СЧФДОП или Функция = ДОП:
	//  4 - Товары переданы от Комитента (Принципала) Комиссионеру (Агенту, действующему от собственного имени) для дальнейшей реализации;
	//  5 - Товары переданы от Комиссионера (Агента, действующего от собственного имени) Комитенту (Принципалу) при возврате товаров;
	//  6 - Товары переданы от Комиссионера (Агента, действующего от собственного имени) Комитенту (Принципалу) при закупке товара;
	//  7 - Товары переданы от Комитента (Принципала) Комиссионеру (Агенту, действующему от собственного имени) при возврате товаров;
	//  8 - Возврат товара от Покупателя Продавцу.
	Если СтруктураЭД.Функция = "СЧФ" Тогда
		СохранитьРеквизитВДереве(
			ДеревоДанных,
			ОбщийПуть + "ДополнительныеСведенияОбУчастниках.ОбстоятельстваФормированияСФ",
			ОбстоятельстваФормированияСФ(Шапка));
	КонецЕсли;
	
	ВнестиСведенияОВыбытииМаркированныхТоваровВДеревоУПДУКД(ДеревоДанных, Шапка);
	
	СохранитьРеквизитВДереве(ДеревоДанных, "СсылкаСчетаФактуры", Шапка.Ссылка);
	
	НомерДокумента = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(Шапка);
	Если СтруктураЭД.Функция = "СЧФ" ИЛИ СтруктураЭД.Функция = "СЧФДОП" Тогда
		НомерДокумента = УправлениеПечатьюПлатформа.ДополнитьНомерСчетФактурыИндексомОбособленногоПодразделения(НомерДокумента, Шапка.Ссылка);
	КонецЕсли;
	
	СохранитьРеквизитВДереве(ДеревоДанных, ОбщийПуть + "НомерДокумента", НомерДокумента);
	СохранитьРеквизитВДереве(ДеревоДанных, ОбщийПуть + "ДатаДокумента",  Шапка.Дата);
	
	Если Шапка.Исправление Тогда
		
		СохранитьРеквизитВДереве(ДеревоДанных, ОбщийПуть + "Исправление.НомерИсправления", Шапка.НомерИсправления);
		СохранитьРеквизитВДереве(ДеревоДанных, ОбщийПуть + "Исправление.ДатаИсправления", Шапка.ДатаИсправления);
		
	КонецЕсли;
	
	Комитент = Неопределено;
	ДоговорСКомитентом = Неопределено;
	Если СтруктураЭД.Функция = "СвРК" Или СтруктураЭД.Функция = "СвЗК" Тогда
		Комитент = СтруктураЭД.Получатель;
		ДоговорСКомитентом = СтруктураЭД.Договор;
	КонецЕсли;
	
	// Продавец
	СведенияОПродавце = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Шапка.Поставщик, СведенияОПродавце);
	
	ПутьТаблицы = "СведенияОСчетеФактуре.СведенияОПродавцах";
	ИмяУчастника = "Продавец";
	ТаблицаПродавцов = ПолучитьТаблицуУчастниковУПД_5_02(ДеревоДанных, ПутьТаблицы);
	
	ДанныеПродавца = ПодготовитьДанныеУчастникаУПД(СведенияОПродавце,, Шапка.Подразделение,, ФорматУПД);
	СтрокаПродавца = ДобавитьУчастникаУПД_5_02(ДеревоДанных, ТаблицаПродавцов, ДанныеПродавца, ПутьТаблицы, ИмяУчастника);
	
	Если (Не Шапка.ЭтоКомиссия) И Шапка.ЭтоСтруктурноеПодразделение Тогда
		СтрокаПродавца.Продавец.СтруктурноеПодразделение = Шапка.ПодразделениеНаименование;
	КонецЕсли;
	
	ДобавитьОбработкуОшибокВТаблицуУчастниковУПД(ТаблицаПродавцов, ИмяУчастника, ФорматУПД);
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ТаблицаПродавцов, ПутьТаблицы);
	
	СоставительДокументаНаименование = СведенияОПродавце.ПолноеНаименование
				+ ?(ЗначениеЗаполнено(СведенияОПродавце.КПП),
					СтрШаблон(НСтр("ru = ', ИНН/КПП %1/%2'"), СведенияОПродавце.ИНН, СведенияОПродавце.КПП),
					СтрШаблон(НСтр("ru = ', ИНН %1'"), СведенияОПродавце.ИНН));
	
	ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки(Шапка.Ссылка, 
			"Объект.Организация");
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
			"СоставительДокументаНаименование", СоставительДокументаНаименование, ПараметрыОбработкиОшибок);
	
	// Покупатель
	СведенияОПокупателе = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Шапка.Покупатель, СведенияОПокупателе);
	
	ДокументОснованияАктУслуг = (
	(ЗначениеЗаполнено(ДанныеДляФормированияЭД.Шапка.ДокументОснование) 
			И ДанныеДляФормированияЭД.Шапка.ДокументОснование.ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг)
	);
	
	ПутьТаблицы = "СведенияОСчетеФактуре.СведенияОПокупателях";
	ИмяУчастника = "Покупатель";
	ТаблицаПокупателей = ПолучитьТаблицуУчастниковУПД_5_02(ДеревоДанных, ПутьТаблицы);
	ДанныеПокупателя = ПодготовитьДанныеУчастникаУПД(СведенияОПокупателе,,,, ФорматУПД);
	ДобавитьУчастникаУПД_5_02(ДеревоДанных, ТаблицаПокупателей, ДанныеПокупателя, ПутьТаблицы, ИмяУчастника);
	
	ДобавитьОбработкуОшибокВТаблицуУчастниковУПД(ТаблицаПокупателей, ИмяУчастника, ФорматУПД);
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ТаблицаПокупателей, ПутьТаблицы);
	
	// Обработка ошибки с указанием расширенного текста сообщения вместо параметров обработки ошибки.
	
	СохранитьРеквизитВДереве(ДеревоДанных, "СведенияОСчетеФактуре.Валюта.Код", Шапка.КодВалюты);
	СохранитьРеквизитВДереве(ДеревоДанных, "СведенияОСчетеФактуре.Валюта.Наименование",
		Шапка.НаименованиеПолноеВалюты);
	СохранитьРеквизитВДереве(ДеревоДанных, "СведенияОСчетеФактуре.Валюта.Курс", Шапка.Курс);
	
	Если СтруктураЭД.ТипДокумента <> Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот
		И НЕ ДокументОснованияАктУслуг Тогда
		
		ПутьТаблицы = "СведенияОСчетеФактуре.СведенияОГрузоотправителях";
		ИмяУчастника = "Грузоотправитель";
		ТаблицаГрузоотправителей = ПолучитьТаблицуУчастниковУПД_5_02(ДеревоДанных, ПутьТаблицы);
		
		ПриоритетыВидовКИГрузоотправителя = Новый Массив;
		ПриоритетыВидовКИГрузоотправителя.Добавить("ФактическийАдрес");
		ПриоритетыВидовКИГрузоотправителя.Добавить("ЮридическийАдрес");
		
		Если Шапка.Свойство("Грузоотправитель")
			И ЗначениеЗаполнено(Шапка.Грузоотправитель)
			И (Не Шапка.Грузоотправитель = Шапка.Поставщик) Тогда
			СведенияОГрузоотправителе = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
			ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Шапка.Грузоотправитель, СведенияОГрузоотправителе);
			
			ДанныеГрузоотправителя = ПодготовитьДанныеУчастникаУПД(СведенияОГрузоотправителе,,,, ФорматУПД, ПриоритетыВидовКИГрузоотправителя);
			ДобавитьУчастникаУПД_5_02(ДеревоДанных, ТаблицаГрузоотправителей, ДанныеГрузоотправителя, ПутьТаблицы, ИмяУчастника);
		Иначе
			
			СтрокаГрузоотправителя = ТаблицаГрузоотправителей.Добавить();
			СтрокаГрузоотправителя.ОнЖе = Истина;
		КонецЕсли;
		ДобавитьОбработкуОшибокВТаблицуУчастниковУПД(ТаблицаГрузоотправителей, ИмяУчастника, ФорматУПД);
		ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ТаблицаГрузоотправителей, ПутьТаблицы);
		
		ПутьТаблицы = "СведенияОСчетеФактуре.СведенияОГрузополучателях";
		ИмяУчастника = "Грузополучатель";
		ТаблицаГрузополучателей = ПолучитьТаблицуУчастниковУПД_5_02(ДеревоДанных, ПутьТаблицы);
		
		//	СведенияОГрузополучателе = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
		//	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Шапка.Грузополучатель, СведенияОГрузополучателе);
		Если Шапка.Свойство("Грузополучатель") И ЗначениеЗаполнено(Шапка.Грузополучатель) И
			(НЕ Шапка.Покупатель = Шапка.Грузополучатель) Тогда
			
			СведенияОГрузополучателе = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
			ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Шапка.Грузополучатель, СведенияОГрузополучателе);
			
		Иначе
			СведенияОГрузополучателе = СведенияОПокупателе;
		КонецЕсли;
		
		ПриоритетыВидовКИГрузополучателя = Новый Массив;
		ПриоритетыВидовКИГрузополучателя.Добавить("ПочтовыйАдрес");
		ПриоритетыВидовКИГрузополучателя.Добавить("ФактическийАдрес");
		
		//Если Шапка.Свойство("Грузополучатель") И ЗначениеЗаполнено(Шапка.Грузополучатель) Тогда
		
		Если Шапка.Свойство("АдресДоставкиЗначенияПолей") И ЗначениеЗаполнено(Шапка.АдресДоставкиЗначенияПолей) Тогда
			СведенияОГрузополучателе.Вставить("ПроизвольныйАдрес", Шапка.АдресДоставкиЗначенияПолей);
		КонецЕсли;
		ДанныеГрузополучателя = ПодготовитьДанныеУчастникаУПД(СведенияОГрузополучателе,,,, ФорматУПД, ПриоритетыВидовКИГрузополучателя);
		ДобавитьУчастникаУПД_5_02(ДеревоДанных, ТаблицаГрузополучателей, ДанныеГрузополучателя, ПутьТаблицы, ИмяУчастника);
		//Иначе
		//	Если Шапка.Свойство("АдресДоставкиЗначенияПолей") И ЗначениеЗаполнено(Шапка.АдресДоставкиЗначенияПолей) Тогда
		//		СведенияОПокупателе.Вставить("ПроизвольныйАдрес", Шапка.АдресДоставкиЗначенияПолей);
		//	КонецЕсли;
		//	ДанныеГрузополучателя = ПодготовитьДанныеУчастникаУПД(СведенияОПокупателе,,,, ФорматУПД, ПриоритетыВидовКИГрузополучателя);
		//	ДобавитьУчастникаУПД_5_02(ДеревоДанных, ТаблицаГрузополучателей, ДанныеГрузополучателя, ПутьТаблицы, ИмяУчастника);
		//КонецЕсли;
		
		ДобавитьОбработкуОшибокВТаблицуУчастниковУПД(ТаблицаГрузополучателей, ИмяУчастника, ФорматУПД);
		ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ТаблицаГрузополучателей, ПутьТаблицы);
		
		Если Шапка.Свойство("ИныеСведенияОбОтгрузке") И ЗначениеЗаполнено(Шапка.ИныеСведенияОбОтгрузке) Тогда
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
			"ИныеСведенияОбОтгрузке", Шапка.ИныеСведенияОбОтгрузке);
		КонецЕсли;
		
	КонецЕсли;
	
	ДокументыОснования = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ДанныеДляФормированияЭД.ДокументыОснования);
	СохранитьРеквизитВДереве(ДеревоДанных, "ДокументыОснованияСчетаФактуры", ДокументыОснования);
	
	СохранитьРеквизитВДереве(ДеревоДанных, ОбщийПуть + "ДополнительныеСведенияОбУчастниках.ИдентификаторГосКонтракта",
		Шапка.ИдентификаторГосударственногоКонтракта);
	
	ДокументыПодтвержденияОтгрузки = ДайДокументыПодтвержденияОтгрузки_5_02(Шапка, ДеревоДанных, СтруктураЭД);
	
	Путь = "СведенияОСчетеФактуре.ДокументыОбОтгрузке";
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ДокументыПодтвержденияОтгрузки, Путь);
	
	ПредставлениеСтроки5а = "";
	Если СтруктураЭД.Функция = "СЧФ" Тогда
		Если Шапка.Свойство("ДокументОбОтгрузке")
			И ЗначениеЗаполнено(Шапка.ДокументОбОтгрузке) Тогда
			
			ПредставлениеСтроки5а = Шапка.ДокументОбОтгрузке;
			
		КонецЕсли;
	Иначе
		
		ПредставлениеСтроки5а = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Универсальный передаточный документ № %1 от %2'"),
					НомерДокумента,
					Формат(Шапка.Дата, "ДЛФ=ДД"));
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредставлениеСтроки5а) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ДокументОбОтгрузке", ПредставлениеСтроки5а);
	КонецЕсли;
	
	ОсобенностиУчета    = ДанныеДляФормированияЭД.ОсобенностиУчета;
	ОсобенностиУчетаМОД = Справочники.ОсобенностиУчетаНоменклатуры.ПолучитьОсобенностиУчетаДляПрослеживаемостиПоМОД();
	
	ЕстьТоварыМОД = Ложь;
	Для Каждого ОсобенностьУчета Из ОсобенностиУчетаМОД Цикл
		Если Не ОсобенностиУчета.Найти(ОсобенностьУчета) = Неопределено Тогда
			ЕстьТоварыМОД = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьТоварыМОД Тогда
		
		ПутьТаблицы = "СведенияОСчетеФактуре.ИнформационноеПолеФХЖ.ТекстоваяИнформация";
		
		ТаблицаТекстоваяИнформация = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(
			ДеревоДанных, ПутьТаблицы);
		
		СтрокаТекстоваяИнформация = ТаблицаТекстоваяИнформация.Добавить();
		СтрокаТекстоваяИнформация.Идентификатор = "НомерПеревозДок";
		СтрокаТекстоваяИнформация.Значение      = Шапка.Номер;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(ДеревоДанных, СтрокаТекстоваяИнформация, ПутьТаблицы);
		
		СтрокаТекстоваяИнформация = ТаблицаТекстоваяИнформация.Добавить();
		СтрокаТекстоваяИнформация.Идентификатор = "ДатаПеревозДок";
		СтрокаТекстоваяИнформация.Значение      = Формат(Шапка.Дата, "ДФ=dd.MM.yyyy");
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(ДеревоДанных, СтрокаТекстоваяИнформация, ПутьТаблицы);
		
		//Если ЗначениеЗаполнено(Шапка.НомерТС) Тогда
		Если ЗначениеЗаполнено(Шапка.НомерТС) Тогда
			НомерТС = Шапка.НомерТС;
		Иначе
			НомерТС = "-";
		КонецЕсли;
		
		СтрокаТекстоваяИнформация = ТаблицаТекстоваяИнформация.Добавить();
		СтрокаТекстоваяИнформация.Идентификатор = "РегНомер";
		СтрокаТекстоваяИнформация.Значение      = НомерТС;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(ДеревоДанных, СтрокаТекстоваяИнформация, ПутьТаблицы);
		//Иначе
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен номер транспортного средства.'"), Шапка.ДокументОснование,,, Отказ);
		//КонецЕсли;
		
		ДобавитьСведенияОУчастникахОбмена_5_02_ИСМП(Шапка, СтруктураЭД, ДеревоДанных, Шапка.Дата, Отказ);
		
	КонецЕсли;
	
	Возврат ДеревоДанных;
	
КонецФункции

Процедура ДобавитьКодФИАСВТаблицуДляВывода(Участник, ТаблицаКодовФИАС, ИдентификаторАдресногоОбъекта) Экспорт
	
	ПутьФИАСКод = "";
	
	Участники = Новый Соответствие;
	Участники.Вставить("СведенияОСчетеФактуре.СведенияОПродавцах", "Продавец_ФиасИД");
	Участники.Вставить("СведенияОСчетеФактуре.СведенияОПокупателях", "Покупатель_ФиасИД");
	Участники.Вставить("СведенияОСчетеФактуре.СведенияОГрузоотправителях", "Продавец_ФиасИД");
	Участники.Вставить("СведенияОСчетеФактуре.СведенияОГрузополучателях", "Покупатель_ФиасИД");
	
	Для Каждого ДанныеУчастника Из Участники Цикл
		
		Если СтрНачинаетсяС(Участник, ДанныеУчастника.Ключ) Тогда
			ПутьФИАСКод = ДанныеУчастника.Значение;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ПутьФИАСКод) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("Идентификатор", ПутьФИАСКод);
	СтрокиТекстовойИнформации = ТаблицаКодовФИАС.НайтиСтроки(СтруктураОтбора);
	
	Если СтрокиТекстовойИнформации.Количество() Тогда
		НоваяСтрока = СтрокиТекстовойИнформации[0];
	Иначе
		НоваяСтрока = ТаблицаКодовФИАС.Добавить();
	КонецЕсли;
	
	НоваяСтрока.Идентификатор = ПутьФИАСКод;
	НоваяСтрока.Значение      = Строка(ИдентификаторАдресногоОбъекта);
	
КонецПроцедуры

Функция ПроверитьЗаполнениеИдентификатораГАР(ДеревоДанных, Участник, АдресЗначение, ТаблицаКодовФИАС, ТолькоЧтение = Ложь) Экспорт
	
	ИдентификаторГАР_ФИАС = "";
	
	ОтборДляПолученияАдресаПоПриказуМинфина = Новый Структура("КодыАдреса", Истина);
	АдресПоПриказуМинфина = РаботаСАдресами.СведенияОбАдресеПриказМинфинаРФ171н(АдресЗначение,
		ОтборДляПолученияАдресаПоПриказуМинфина);
		
	Если АдресПоПриказуМинфина.КодСтраны = "643" Тогда // Россия
		
		АдресСоответствуетСтруктурированномуФорматуФНС = ИнтеграцияЭДО.АдресСоответствуетСтруктурированномуФорматуФНС(
			АдресПоПриказуМинфина);
		
		Если АдресСоответствуетСтруктурированномуФорматуФНС Тогда
			
			Если ЗначениеЗаполнено(АдресПоПриказуМинфина.ИдентификаторДома) Тогда
				ИдентификаторГАР_ФИАС = АдресПоПриказуМинфина.ИдентификаторДома;
			ИначеЕсли ЗначениеЗаполнено(АдресПоПриказуМинфина.ИдентификаторАдресногоОбъекта) Тогда
				ИдентификаторГАР_ФИАС = АдресПоПриказуМинфина.ИдентификаторАдресногоОбъекта;
			Иначе
				ИдентификаторГАР_ФИАС = "";
			КонецЕсли;
			
			//ВыполнитьУточнениеКодаФИАСПоМОДам(ИдентификаторГАР_ФИАС, АдресПоПриказуМинфина.Представление);
			
			Если Не ТолькоЧтение Тогда
				ДобавитьКодФИАСВТаблицуДляВывода(Участник, ТаблицаКодовФИАС, ИдентификаторГАР_ФИАС);
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(АдресПоПриказуМинфина.ИдентификаторДома) Тогда
				ИдентификаторГАР_ФИАС = АдресПоПриказуМинфина.ИдентификаторДома;
			ИначеЕсли ЗначениеЗаполнено(АдресПоПриказуМинфина.ИдентификаторАдресногоОбъекта) Тогда
				ИдентификаторГАР_ФИАС = АдресПоПриказуМинфина.ИдентификаторАдресногоОбъекта;
			Иначе
				ИдентификаторГАР_ФИАС = "";
			КонецЕсли;
			
			//ВыполнитьУточнениеКодаФИАСПоМОДам(ИдентификаторГАР_ФИАС, АдресПоПриказуМинфина.Представление);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИдентификаторГАР_ФИАС;
	
КонецФункции

Процедура ОчиститьДанныеПоАдресуГАРПередЗагрузкойВДерево_ИСМП(ДанныеАдресаВДереве, ОчищатьПринудительно = Ложь)
	
	Если Не ТипЗнч(ДанныеАдресаВДереве) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеАдресаВДереве.Адрес.Свойство("ТипАдреса")
		Или Не ДанныеАдресаВДереве.Адрес.ТипАдреса.Свойство("АдресГАР") Тогда
		Возврат;
	КонецЕсли;
	
	АдресГАР = ДанныеАдресаВДереве.Адрес.ТипАдреса.АдресГАР;
	
	Если Не ЗначениеЗаполнено(АдресГАР.РайонОкругТерритория.Вид)
		И Не ЗначениеЗаполнено(АдресГАР.РайонОкругТерритория.Наименование)
			Или ОчищатьПринудительно Тогда
		АдресГАР.РайонОкругТерритория = Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресГАР.ГородСелоПоселение.Вид)
		И Не ЗначениеЗаполнено(АдресГАР.ГородСелоПоселение.Наименование)
			Или ОчищатьПринудительно Тогда
		АдресГАР.ГородСелоПоселение = Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресГАР.НаселенныйПункт.Вид)
		И Не ЗначениеЗаполнено(АдресГАР.НаселенныйПункт.Наименование)
			Или ОчищатьПринудительно Тогда
		АдресГАР.НаселенныйПункт = Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресГАР.ЭлементПланировочнойСтруктуры.Тип)
		И Не ЗначениеЗаполнено(АдресГАР.ЭлементПланировочнойСтруктуры.Наименование)
			Или ОчищатьПринудительно Тогда
		АдресГАР.ЭлементПланировочнойСтруктуры = Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресГАР.ЭлементУличноДорожнойСети.Тип)
		И Не ЗначениеЗаполнено(АдресГАР.ЭлементУличноДорожнойСети.Наименование)
			Или ОчищатьПринудительно Тогда
		АдресГАР.ЭлементУличноДорожнойСети = Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресГАР.ПомещениеЗдания.Тип)
		И Не ЗначениеЗаполнено(АдресГАР.ПомещениеЗдания.Номер)
			Или ОчищатьПринудительно Тогда
		АдресГАР.ПомещениеЗдания = Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресГАР.ПомещениеКвартиры.Тип)
		И Не ЗначениеЗаполнено(АдресГАР.ПомещениеКвартиры.Номер)
			Или ОчищатьПринудительно Тогда
		АдресГАР.ПомещениеКвартиры = Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АдресГАР.Здание)
		Или ОчищатьПринудительно Тогда
		АдресГАР.Здание = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияУчастникаОбмена_ИСМП(Шапка, ДеревоДанных, ТаблицаКодовФИАС, ИмяУчастника, ПутьКДаннымУчастника, ВидУчастника, АдресУчастникаОбмена, ДатаСведений, Отказ)
	
	ПутьКДаннымОрганизацияПродавец           = "СведенияОСчетеФактуре.СведенияОПродавцах.НомерСтроки.Продавец";
	ПутьКДаннымАдресаОбъект                  = ".Адрес.ТипАдреса.АвтоматическиЗаполняемый.ОбъектКонтактнойИнформации";
	ПутьКДаннымАдресаВидКонтактнойИнформации = ".Адрес.ТипАдреса.АвтоматическиЗаполняемый.ВидКонтактнойИнформации";
	ПутьКДаннымГрузоотправительОнЖе          = "СведенияОСчетеФактуре.СведенияОГрузоотправителях.НомерСтроки.ОнЖе";
	
	АдресСтороныЗаполнен    = Ложь;
	
	УчастникОбмена = ?(ЗначениеЗаполнено(АдресУчастникаОбмена.УполномоченноеЛицоЗаПоставкуГруза),
		АдресУчастникаОбмена.УполномоченноеЛицоЗаПоставкуГруза,
		АдресУчастникаОбмена.УчастникОбмена);
		
	Если Не ЗначениеЗаполнено(УчастникОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(УчастникОбмена) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		РеквизитыУчастникОбмена = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчастникОбмена, "Организация.ИНН, КПП, Организация.ФормаСобственности");
		РеквизитыУчастникОбмена.Вставить("ИНН", РеквизитыУчастникОбмена.ОрганизацияИНН);
		РеквизитыУчастникОбмена.Вставить("ФормаСобственности", РеквизитыУчастникОбмена.ОрганизацияФормаСобственности);
	Иначе
		РеквизитыУчастникОбмена = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчастникОбмена, "ИНН, КПП, ФормаСобственности");
	КонецЕсли;
	
	Если НЕ РеквизитыУчастникОбмена.ФормаСобственности = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель Тогда
		Возврат;
	КонецЕсли;
	
	//Если Не ОбщегоНазначенияИСВызовСервера.ПартнерОрганизацияЭтоИндивидуальныйПредприниматель(УчастникОбмена) Тогда
	//	АдресСтороныЗаполнен = Истина;
	//	Продолжить;
	//КонецЕсли;
	
	ШаблонОшибкиЗаполненияПоАдресу = НСтр("ru = 'Не удалось корректно заполнить адрес по %1. Возможно, адрес указан в свободной форме.
		|Смените тип адреса (команды ""Административно-территориальное"" или ""Муниципальное деление"" меню ""Еще"" формы редактирования адреса.'");
		
	ШаблонОшибкиПустогоАдреса = НСтр("ru = 'Не указан адрес %1. %2 - значение не заполнено.'");
	
	ТекстОшибки = "";
	
	ПутьКДаннымСтроки              = ПутьКДаннымУчастника + ".НомерСтроки." + ВидУчастника;
	ПутьКДаннымУполномоченногоЛица = ПутьКДаннымУчастника + ".НомерСтроки." + ВидУчастника;
	
	ГрузоотправительОнЖе = Ложь;
	
	Если ИмяУчастника = "Продавец" Тогда
		
		ТекущееЗначениеУполномоченногоЛица = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(ДеревоДанных, ПутьКДаннымГрузоотправительОнЖе);
		
		Если ТекущееЗначениеУполномоченногоЛица = Истина Тогда
			
			ГрузоотправительОнЖе = Истина;
			
			ТекущееЗначениеАдреса = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(ДеревоДанных, ПутьКДаннымОрганизацияПродавец);
			// данные адреса организации-отправителя
			
			Если ТекущееЗначениеАдреса.Адрес.ТипАдреса.Свойство("АвтоматическиЗаполняемый") Тогда
				
				ВладелецКонтактнойИнформации = ТекущееЗначениеАдреса.Адрес.ТипАдреса.АвтоматическиЗаполняемый.ОбъектКонтактнойИнформации;
				ВидКонтактнойИнформации      = ТекущееЗначениеАдреса.Адрес.ТипАдреса.АвтоматическиЗаполняемый.ВидКонтактнойИнформации;
				
				Если ЗначениеЗаполнено(ВладелецКонтактнойИнформации) И ЗначениеЗаполнено(ВидКонтактнойИнформации) Тогда
					
					КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
						ВладелецКонтактнойИнформации, ВидКонтактнойИнформации, ДатаСведений, Ложь);
					
					Если ЗначениеЗаполнено(КонтактнаяИнформация) Тогда
						
						АдресЗначениеПродавца        = КонтактнаяИнформация[0].Значение;
						АдресПредставлениеПродавца   = КонтактнаяИнформация[0].Представление;
						
						КодФИАСАдресаОрганизацииПродавца = ПроверитьЗаполнениеИдентификатораГАР(ДеревоДанных, ПутьКДаннымСтроки, АдресЗначениеПродавца, ТаблицаКодовФИАС, Истина);
						
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ТекущееЗначениеАдреса.Адрес.ТипАдреса.Свойство("АдресГАР") Тогда
				
				АдресПоПриказуМинфина = ТекущееЗначениеАдреса.Адрес.ТипАдреса.АдресГАР;
				
				Если ЗначениеЗаполнено(АдресПоПриказуМинфина.ИдентификаторДома) Тогда
					КодФИАСАдресаОрганизацииПродавца = АдресПоПриказуМинфина.ИдентификаторДома;
				ИначеЕсли ЗначениеЗаполнено(АдресПоПриказуМинфина.ИдентификаторАдресногоОбъекта) Тогда
					КодФИАСАдресаОрганизацииПродавца = АдресПоПриказуМинфина.ИдентификаторАдресногоОбъекта;
				Иначе
					КодФИАСАдресаОрганизацииПродавца = "";
				КонецЕсли;
			
			ИначеЕсли ТекущееЗначениеАдреса.Адрес.ТипАдреса.Свойство("АдресРФ") Тогда
				
				КодФИАСАдресаОрганизацииПродавца = ПроверитьЗаполнениеИдентификатораГАР(ДеревоДанных, ПутьКДаннымСтроки, ТекущееЗначениеАдреса.Адрес.ТипАдреса.АдресРФ, ТаблицаКодовФИАС);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	АдресЗначение = "";
	
	Если АдресУчастникаОбмена.АвтоматическоеЗаполнение Тогда
	
		ВладелецКонтактнойИнформации = АдресУчастникаОбмена.ВладелецКонтактнойИнформации;
		ВидКонтактнойИнформации      = АдресУчастникаОбмена.ВидКонтактнойИнформации;
		
		Если ЗначениеЗаполнено(ВладелецКонтактнойИнформации) И ЗначениеЗаполнено(ВидКонтактнойИнформации) Тогда
			
			КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
				ВладелецКонтактнойИнформации, ВидКонтактнойИнформации, ДатаСведений, Ложь);
				
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, ПутьКДаннымСтроки + ПутьКДаннымАдресаОбъект, Неопределено);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, ПутьКДаннымСтроки + ПутьКДаннымАдресаВидКонтактнойИнформации, Неопределено);
			
			Если ЗначениеЗаполнено(КонтактнаяИнформация) Тогда
				
				АдресЗначение      = КонтактнаяИнформация[0].Значение;
				АдресПредставление = КонтактнаяИнформация[0].Представление;
				
				РезультатЗаполненияГАР_ФИАС = ЗаполнитьАдресУчастникаУПД_5_02_ИСМП(ДеревоДанных, АдресЗначение, АдресПредставление, ПутьКДаннымСтроки, ТаблицаКодовФИАС);
				
				ИдентификаторГАР_ФИАС = РезультатЗаполненияГАР_ФИАС.ИдентификаторГАР_ФИАС;
				АдресСтороныЗаполнен  = РезультатЗаполненияГАР_ФИАС.АдресЗаполнен;
				
				ТекстОшибки = СтрШаблон(ШаблонОшибкиЗаполненияПоАдресу, АдресПредставление);
				
			Иначе
				
				ПутьКАдресу = ПутьКДаннымСтроки + ".Адрес";
				ТекстОшибки = СтрШаблон(ШаблонОшибкиПустогоАдреса, ВладелецКонтактнойИнформации, ПутьКАдресу);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(АдресУчастникаОбмена.АдресЗначениеJSON) Тогда
		
		АдресЗначение = АдресУчастникаОбмена.АдресЗначениеJSON;
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, ПутьКДаннымСтроки + ПутьКДаннымАдресаОбъект, Неопределено);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, ПутьКДаннымСтроки + ПутьКДаннымАдресаВидКонтактнойИнформации, Неопределено);
		
		РезультатЗаполненияГАР_ФИАС = ЗаполнитьАдресУчастникаУПД_5_02_ИСМП(ДеревоДанных, АдресЗначение, АдресУчастникаОбмена.АдресСтрокой, ПутьКДаннымСтроки, ТаблицаКодовФИАС);
		
		ИдентификаторГАР_ФИАС = РезультатЗаполненияГАР_ФИАС.ИдентификаторГАР_ФИАС;
		АдресСтороныЗаполнен  = РезультатЗаполненияГАР_ФИАС.АдресЗаполнен;
		
		ТекстОшибки = СтрШаблон(ШаблонОшибкиЗаполненияПоАдресу, АдресУчастникаОбмена.АдресСтрокой);
		
	Иначе
		
		Если ИмяУчастника = "Покупатель" Тогда
			ПутьКДаннымСтроки = ПутьКДаннымУполномоченногоЛица;
		Иначе
			ТекущееЗначениеУполномоченногоЛица = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(ДеревоДанных, ПутьКДаннымГрузоотправительОнЖе);
		КонецЕсли;
		
		ТекущееЗначениеАдреса = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(ДеревоДанных, ПутьКДаннымСтроки);
		Если ТекущееЗначениеАдреса.Адрес.ТипАдреса.Свойство("АвтоматическиЗаполняемый") Тогда
			
			ВладелецКонтактнойИнформации = ТекущееЗначениеАдреса.Адрес.ТипАдреса.АвтоматическиЗаполняемый.ОбъектКонтактнойИнформации;
			ВидКонтактнойИнформации      = ТекущееЗначениеАдреса.Адрес.ТипАдреса.АвтоматическиЗаполняемый.ВидКонтактнойИнформации;
			
			Если ЗначениеЗаполнено(ВладелецКонтактнойИнформации) И ЗначениеЗаполнено(ВидКонтактнойИнформации) Тогда
				
				КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
					ВладелецКонтактнойИнформации, ВидКонтактнойИнформации, ДатаСведений, Ложь);
				
				Если ЗначениеЗаполнено(КонтактнаяИнформация) Тогда
					
					АдресЗначение        = КонтактнаяИнформация[0].Значение;
					АдресПредставление   = КонтактнаяИнформация[0].Представление;
					
					ИдентификаторГАР_ФИАС = ПроверитьЗаполнениеИдентификатораГАР(ДеревоДанных, ПутьКДаннымСтроки, АдресЗначение, ТаблицаКодовФИАС);
					АдресСтороныЗаполнен  = ЗначениеЗаполнено(ИдентификаторГАР_ФИАС);
					
					ТекстОшибки = СтрШаблон(ШаблонОшибкиЗаполненияПоАдресу, АдресПредставление);
					
				Иначе
					
					ПутьКАдресу = ПутьКДаннымСтроки + ".Адрес";
					ТекстОшибки = СтрШаблон(ШаблонОшибкиПустогоАдреса, ВладелецКонтактнойИнформации, ПутьКАдресу);
					
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТекущееЗначениеАдреса.Адрес.ТипАдреса.Свойство("АдресГАР") Тогда
			
			АдресПоПриказуМинфина = ТекущееЗначениеАдреса.Адрес.ТипАдреса.АдресГАР;
			Если ЗначениеЗаполнено(АдресПоПриказуМинфина.ИдентификаторДома) Тогда
				ИдентификаторГАР_ФИАС = АдресПоПриказуМинфина.ИдентификаторДома;
			ИначеЕсли ЗначениеЗаполнено(АдресПоПриказуМинфина.ИдентификаторАдресногоОбъекта) Тогда
				ИдентификаторГАР_ФИАС = АдресПоПриказуМинфина.ИдентификаторАдресногоОбъекта;
			Иначе
				ИдентификаторГАР_ФИАС = "";
			КонецЕсли;
			
			АдресСтороныЗаполнен  = ЗначениеЗаполнено(ИдентификаторГАР_ФИАС);
			
		ИначеЕсли ТекущееЗначениеАдреса.Адрес.ТипАдреса.Свойство("АдресРФ") Тогда
			
			ИдентификаторГАР_ФИАС = ПроверитьЗаполнениеИдентификатораГАР(ДеревоДанных, ПутьКДаннымСтроки, ТекущееЗначениеАдреса.Адрес.ТипАдреса.АдресРФ, ТаблицаКодовФИАС);
			АдресСтороныЗаполнен  = ЗначениеЗаполнено(ИдентификаторГАР_ФИАС);
			
		Иначе
			
			АдресСтороныЗаполнен = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяУчастника = "Продавец"
		И ГрузоотправительОнЖе
		И КодФИАСАдресаОрганизацииПродавца <> ИдентификаторГАР_ФИАС Тогда
		
		ТаблицаУчастниковГрузоотправителей = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(ДеревоДанных, ПутьКДаннымУчастника);
		// если Грузоотправитель = ОнЖе, но адреса не совпадают - необходимо добавить непосредственно грузоотправителя
		ДанныеПродавца = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(ДеревоДанных, ПутьКДаннымОрганизацияПродавец);
		
		Если ТаблицаУчастниковГрузоотправителей.Количество() Тогда
			НоваяСтрокаГрузополучателя = ТаблицаУчастниковГрузоотправителей[0];
		Иначе
			НоваяСтрокаГрузополучателя = ТаблицаУчастниковГрузоотправителей.Добавить();
		КонецЕсли;
		
		НоваяСтрокаГрузополучателя[ИмяУчастника] = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(
			ДеревоДанных, ПутьКДаннымУполномоченногоЛица);
		ЗаполнитьЗначенияСвойств(НоваяСтрокаГрузополучателя[ИмяУчастника], ДанныеПродавца,, "Адрес");
		НоваяСтрокаГрузополучателя.ОнЖе = Ложь;
		
		ОчиститьДанныеПоАдресуГАРПередЗагрузкойВДерево_ИСМП(НоваяСтрокаГрузополучателя[ИмяУчастника]);
		
		ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ТаблицаУчастниковГрузоотправителей, ПутьКДаннымУчастника);
		
	ИначеЕсли ИмяУчастника = "Продавец"
		И ГрузоотправительОнЖе
		И ЗначениеЗаполнено(АдресЗначениеПродавца) Тогда
		// если Грузоотправитель - ОнЖе и адрес совпадает, то надо переопределить адрес организации корректным адресом
		// с идентификатором до дома, а не до адресного объекта
		
		ЗаполнитьАдресУчастникаУПД_5_02_ИСМП(ДеревоДанных, АдресЗначениеПродавца, АдресПредставлениеПродавца, ПутьКДаннымОрганизацияПродавец, ТаблицаКодовФИАС);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресУчастникаОбмена.КодФИАС)
		И АдресУчастникаОбмена.КодФИАС <> ИдентификаторГАР_ФИАС
		И ЗначениеЗаполнено(АдресЗначение) Тогда
		
		РезультатЗаполненияАдреса = ЗаполнитьАдресУчастникаУПД_5_02_ИСМП(ДеревоДанных, АдресЗначение, АдресУчастникаОбмена.АдресСтрокой, ПутьКДаннымСтроки, ТаблицаКодовФИАС, АдресУчастникаОбмена.КодФИАС);
		
		АдресСтороныЗаполнен  = РезультатЗаполненияАдреса.АдресЗаполнен;
		ИдентификаторГАР_ФИАС = РезультатЗаполненияАдреса.ИдентификаторГАР_ФИАС;
		
		ШаблонТекстСообщения = НСтр("ru = 'Не удалось корректно заполнить адрес %1. Возможно, адрес указан в свободной форме.
		|Смените тип адреса (команды ""Административно-территориальное"" или ""Муниципальное деление"" меню ""Еще"" формы редактирования адреса.'");
		
		ТекстОшибки = СтрШаблон(ШаблонТекстСообщения, АдресУчастникаОбмена.АдресСтрокой);
		
	КонецЕсли;
	
	Если Не АдресСтороныЗаполнен Тогда
		
		ПутьКАдресу = ПутьКДаннымСтроки + ".Адрес";
		ШаблонТекстСообщения = НСтр("ru = 'Не удалось корректно заполнить адрес %1. Возможно, адрес указан в свободной форме.
		|Смените тип адреса (команды ""Административно-территориальное"" или ""Муниципальное деление"" меню ""Еще"" формы редактирования адреса.'");
		
		Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
			ТекстОшибки = СтрШаблон(ШаблонТекстСообщения, ПутьКАдресу);
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДеревоДанных.ДокументОснование,,, Отказ);
		
	КонецЕсли;
	//	
	//КонецЦикла;
	
	//КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСведенияОУчастникахОбмена_5_02_ИСМП(Шапка, СтруктураЭД, ДеревоДанных, ДатаСведений, Отказ)
	
	Если (Не ТипЗнч(Шапка.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваров"))
		И (Не ТипЗнч(Шапка.ДокументОснование) = Тип("ДокументСсылка.ВозвратПоставщику")) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаАдресаПродавца = НоваяСтрокаАдресаМОД();
	СтрокаАдресаПродавца.УчастникОбмена = Шапка.Организация;
	СтрокаАдресаПродавца.АвтоматическоеЗаполнение     = Истина;
	СтрокаАдресаПродавца.ВладелецКонтактнойИнформации = Шапка.Подразделение;
	СтрокаАдресаПродавца.ВидКонтактнойИнформации      = Справочники.ВидыКонтактнойИнформации.ФактАдресПодразделенияКомпании;
	
	Если Шапка.Свойство("Грузоотправитель")
		И ЗначениеЗаполнено(Шапка.Грузоотправитель) 
		И Шапка.Грузоотправитель <> Шапка.Организация Тогда
		
		СтрокаАдресаПродавца.УполномоченноеЛицоЗаПоставкуГруза = Шапка.Грузоотправитель;
		
	КонецЕсли;
	
	СтрокаАдресаПокупателя = НоваяСтрокаАдресаМОД();
	СтрокаАдресаПокупателя.УчастникОбмена = Шапка.Покупатель;
	
	Если Шапка.Свойство("Грузополучатель") 
		И ЗначениеЗаполнено(Шапка.Грузополучатель) Тогда
		
		Покупатель = Шапка.Грузополучатель;
		СтрокаАдресаПокупателя.УполномоченноеЛицоЗаПоставкуГруза = Шапка.Грузополучатель;
		
	Иначе
		Покупатель = Шапка.Покупатель;
	КонецЕсли;
	
	//Если Шапка.Свойство("АдресДоставкиЗначенияПолей") И ЗначениеЗаполнено(Шапка.АдресДоставкиЗначенияПолей) Тогда
	//	СтрокаАдресаПокупателя.АвтоматическоеЗаполнение = Ложь;
	//	СтрокаАдресаПокупателя.АдресЗначенияПолей       = Шапка.АдресДоставкиЗначенияПолей;
	//Иначе
	
	СтрокаАдресаПокупателя.АвтоматическоеЗаполнение     = Истина;
	СтрокаАдресаПокупателя.ВладелецКонтактнойИнформации = Покупатель;
	СтрокаАдресаПокупателя.ВидКонтактнойИнформации      = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
	
	Путь = "СведенияОСчетеФактуре.ИнформационноеПолеФХЖ.ТекстоваяИнформация";
	
	ТаблицаКодовФИАС = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(ДеревоДанных, Путь);
	ТаблицаКодовФИАС.Очистить();
	
	ЗаполнитьСведенияУчастникаОбмена_ИСМП(Шапка, ДеревоДанных, ТаблицаКодовФИАС, "Продавец", "СведенияОСчетеФактуре.СведенияОГрузоотправителях", "Грузоотправитель",
		СтрокаАдресаПродавца, ДатаСведений, Отказ);
	
	ЗаполнитьСведенияУчастникаОбмена_ИСМП(Шапка, ДеревоДанных, ТаблицаКодовФИАС, "Покупатель", "СведенияОСчетеФактуре.СведенияОГрузополучателях", "Грузополучатель",
		СтрокаАдресаПокупателя, ДатаСведений, Отказ);
	
	Путь = "СведенияОСчетеФактуре.ИнформационноеПолеФХЖ.ТекстоваяИнформация";
	Для Каждого ТекущаяСтрока Из ТаблицаКодовФИАС Цикл
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(ДеревоДанных, ТекущаяСтрока, Путь);
	КонецЦикла;
	
КонецПроцедуры

Функция ПредставлениеАдресногоЭлемента(ПервыйЭлемент = "", ВторойЭлемент = "", ТретийЭлемент = "") Экспорт

	МассивСоставляющих = Новый Массив;
	Если ЗначениеЗаполнено(ПервыйЭлемент) Тогда
		МассивСоставляющих.Добавить(ПервыйЭлемент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВторойЭлемент) Тогда
		МассивСоставляющих.Добавить(ВторойЭлемент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТретийЭлемент) Тогда
		МассивСоставляющих.Добавить(ТретийЭлемент);
	КонецЕсли;
	
	Возврат СтрСоединить(МассивСоставляющих, " ");

КонецФункции

// Проверяет адрес на соответствие структурированному формату государственного адресного реестра (ГАР).
// 
// Параметры:
//  Адрес - см. РаботаСАдресами.СведенияОбАдресе
//
// Возвращаемое значение:
//  Булево - Истина, если адрес соответствует структурированному формату ГАР.
//
Функция АдресСоответствуетФорматуГАР(Адрес) Экспорт
	
	Если Адрес.ТипАдреса <> "Муниципальный"
		Или Не ЗначениеЗаполнено(Адрес.ИдентификаторАдресногоОбъекта)
		Или Не ЗначениеЗаполнено(Адрес.КодРегиона)
		Или Не ЗначениеЗаполнено(Адрес.Регион) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьАдресУчастникаУПД_5_02_ИСМП(ДеревоДанных, АдресЗначение, АдресПредставление, Участник, ТаблицаКодовФИАСДляТегаТекстовойИнформации, УточненныйКодФИАС = "") Экспорт
	
	СтруктураВозврата = Новый Структура("АдресЗаполнен, ИдентификаторГАР_ФИАС", Ложь, "");
	
	ПутьККорнюАдреса = ".Адрес.ТипАдреса";
	ПутьКСтруктурированномуАдресу = ПутьККорнюАдреса + ".АдресРФ";
	ПутьКАдресуГАР = ПутьККорнюАдреса + ".АдресГАР";
	
	// Корневой элемент группы "АвтоматическиЗаполняемый" может содержать в себе
	// параметры обработки ошибки, которые могут быть добавлены в переопределяемой части.
	
	ПутьКАдресу = Участник + ПутьККорнюАдреса;
	
	ОтборДляПолученияАдресаПоПриказуМинфина = Новый Структура("КодыАдреса, БезПредставлений", Истина, Истина);
	АдресПоПриказуМинфина = РаботаСАдресами.СведенияОбАдресеПриказМинфинаРФ171н(АдресЗначение,
		ОтборДляПолученияАдресаПоПриказуМинфина);
	
	ИдентификаторГАР_ФИАС = "";
	
	Если АдресПоПриказуМинфина.КодСтраны = "643" Тогда // Россия
		
		АдресСоответствуетСтруктурированномуФорматуФНС = ИнтеграцияЭДО.АдресСоответствуетСтруктурированномуФорматуФНС(
			АдресПоПриказуМинфина);
		
		Если АдресСоответствуетСтруктурированномуФорматуФНС Тогда
			
			// Заполняем структурированный адрес.
			
			ПутьКАдресу = Участник + ПутьКСтруктурированномуАдресу;
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, ПутьКАдресу + ".Индекс", АдресПоПриказуМинфина.Индекс);
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, ПутьКАдресу + ".КодРегиона", АдресПоПриказуМинфина.КодРегиона);
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, ПутьКАдресу + ".НаименованиеРегиона", АдресПоПриказуМинфина.КодРегиона);
			
			ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(АдресПоПриказуМинфина.Район,
				АдресПоПриказуМинфина.РайонСокращение);
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, ПутьКАдресу + ".Район", ПредставлениеЭлемента);
			
			ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(АдресПоПриказуМинфина.Город,
				АдресПоПриказуМинфина.ГородСокращение);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, ПутьКАдресу + ".Город", ПредставлениеЭлемента);
			
			ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
				АдресПоПриказуМинфина.НаселенныйПункт, АдресПоПриказуМинфина.НаселенныйПунктСокращение);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, ПутьКАдресу + ".НаселенныйПункт", ПредставлениеЭлемента);
			
			ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
				АдресПоПриказуМинфина.Улица, АдресПоПриказуМинфина.УлицаСокращение);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, ПутьКАдресу + ".Улица", ПредставлениеЭлемента);
			
			ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
				НРег(АдресПоПриказуМинфина.Здание.ТипЗдания), "№", АдресПоПриказуМинфина.Здание.Номер);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, ПутьКАдресу + ".Дом", ПредставлениеЭлемента);
			
			Если АдресПоПриказуМинфина.Корпуса.Количество() Тогда
				ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
					НРег(АдресПоПриказуМинфина.Корпуса[0].ТипКорпуса), АдресПоПриказуМинфина.Корпуса[0].Номер);
			Иначе
				ПредставлениеЭлемента = "";
			КонецЕсли;
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, ПутьКАдресу + ".Корпус", ПредставлениеЭлемента);
			
			Если АдресПоПриказуМинфина.Помещения.Количество() Тогда
				ПредставлениеЭлемента = ПредставлениеАдресногоЭлемента(
					НРег(АдресПоПриказуМинфина.Помещения[0].ТипПомещения),
					АдресПоПриказуМинфина.Помещения[0].Номер);
			Иначе
				ПредставлениеЭлемента = "";
			КонецЕсли;
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, ПутьКАдресу + ".Квартира", ПредставлениеЭлемента);
			
			Если ЗначениеЗаполнено(УточненныйКодФИАС) Тогда
				ИдентификаторГАР_ФИАС = УточненныйКодФИАС;
			ИначеЕсли ЗначениеЗаполнено(АдресПоПриказуМинфина.ИдентификаторДома) Тогда
				ИдентификаторГАР_ФИАС = АдресПоПриказуМинфина.ИдентификаторДома;
			ИначеЕсли ЗначениеЗаполнено(АдресПоПриказуМинфина.ИдентификаторАдресногоОбъекта) Тогда
				ИдентификаторГАР_ФИАС = АдресПоПриказуМинфина.ИдентификаторАдресногоОбъекта;
			Иначе
				ИдентификаторГАР_ФИАС = "";
			КонецЕсли;
			
			//ВыполнитьУточнениеКодаФИАСПоМОДам(ИдентификаторГАР_ФИАС, АдресПредставление);
			
			ДобавитьКодФИАСВТаблицуДляВывода(Участник, ТаблицаКодовФИАСДляТегаТекстовойИнформации, ИдентификаторГАР_ФИАС);
			
			СтруктураВозврата.АдресЗаполнен         = ЗначениеЗаполнено(ИдентификаторГАР_ФИАС);
			СтруктураВозврата.ИдентификаторГАР_ФИАС = ИдентификаторГАР_ФИАС;
			
		ИначеЕсли АдресСоответствуетФорматуГАР(АдресПоПриказуМинфина) Тогда
			
			// Заполняем адрес в формате государственного адресного реестра.
			
			ПутьКАдресу = Участник + ПутьКАдресуГАР;
			
			Если ЗначениеЗаполнено(УточненныйКодФИАС) Тогда
				ИдентификаторГАР_ФИАС = УточненныйКодФИАС;
			ИначеЕсли ЗначениеЗаполнено(АдресПоПриказуМинфина.ИдентификаторДома) Тогда
				ИдентификаторГАР_ФИАС = АдресПоПриказуМинфина.ИдентификаторДома;
			ИначеЕсли ЗначениеЗаполнено(АдресПоПриказуМинфина.ИдентификаторАдресногоОбъекта) Тогда
				ИдентификаторГАР_ФИАС = АдресПоПриказуМинфина.ИдентификаторАдресногоОбъекта;
			Иначе
				ИдентификаторГАР_ФИАС = "";
			КонецЕсли;
			
			//ВыполнитьУточнениеКодаФИАСПоМОДам(ИдентификаторГАР_ФИАС, АдресПредставление);
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
				ПутьКАдресу + ".УникальныйНомерАдреса",
				Строка(ИдентификаторГАР_ФИАС));
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
				ПутьКАдресу + ".ПочтовыйИндекс",
				АдресПоПриказуМинфина.Индекс);
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
				ПутьКАдресу + ".КодРегиона",
				АдресПоПриказуМинфина.КодРегиона);
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
				ПутьКАдресу + ".НаименованиеРегиона",
				АдресПоПриказуМинфина.Регион);
			
			// Район, округ, территория.
			Если ЗначениеЗаполнено(АдресПоПриказуМинфина.МуниципальныйРайон) Тогда
				Виды = Новый Структура();
				Виды.Вставить("МуниципальныйРайон", "1");
				Виды.Вставить("ГородскойОкруг", "2");
				Виды.Вставить("ВнутригородскаяТерритория", "3");
				Виды.Вставить("МуниципальныйОкруг", "4");
				Виды.Вставить("ФедеральнаяТерритория", "5");
				
				Если ВРег(АдресПоПриказуМинфина.МуниципальныйРайонТипПолный) = "МУНИЦИПАЛЬНЫЙ РАЙОН" Тогда
					Вид = Виды.МуниципальныйРайон;
				ИначеЕсли ВРег(АдресПоПриказуМинфина.МуниципальныйРайонТипПолный) = "ГОРОДСКОЙ ОКРУГ" Тогда
					Вид = Виды.ГородскойОкруг;
				ИначеЕсли ВРег(АдресПоПриказуМинфина.МуниципальныйРайонТипПолный) = "ВНУТРИГОРОДСКАЯ ТЕРРИТОРИЯ" Тогда
					Вид = Виды.ВнутригородскаяТерритория;
				ИначеЕсли ВРег(АдресПоПриказуМинфина.МуниципальныйРайонТипПолный) = "МУНИЦИПАЛЬНЫЙ ОКРУГ" Тогда
					Вид = Виды.МуниципальныйОкруг;
				Иначе
					Вид = Виды.ФедеральнаяТерритория;
				КонецЕсли;
				
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
					ПутьКАдресу + ".РайонОкругТерритория.Вид",
					Вид);
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
					ПутьКАдресу + ".РайонОкругТерритория.Наименование",
					АдресПоПриказуМинфина.МуниципальныйРайон);
			КонецЕсли;
			
			// Город, село, поселение.
			Если ЗначениеЗаполнено(АдресПоПриказуМинфина.Поселение) Тогда
				
				Виды = Новый Структура();
				Виды.Вставить("ГородскоеПоселение", "1");
				Виды.Вставить("СельскоеПоселение", "2");
				Виды.Вставить("МежселеннаяТерритория", "3");
				Виды.Вставить("ВнутригородскойРайон", "4");
				
				Если ВРег(АдресПоПриказуМинфина.ПоселениеТипПолный) = "ГОРОДСКОЕ ПОСЕЛЕНИЕ" Тогда
					Вид = Виды.ГородскоеПоселение;
				ИначеЕсли ВРег(АдресПоПриказуМинфина.ПоселениеТипПолный) = "СЕЛЬСКОЕ ПОСЕЛЕНИЕ" Тогда	
					Вид = Виды.СельскоеПоселение;
				ИначеЕсли ВРег(АдресПоПриказуМинфина.ПоселениеТипПолный) = "МЕЖСЕЛЕННАЯ ТЕРРИТОРИЯ" Тогда	
					Вид = Виды.МежселеннаяТерритория;
				ИначеЕсли ВРег(АдресПоПриказуМинфина.ПоселениеТипПолный) = "ВНУТРИГОРОДСКОЙ РАЙОН" Тогда	
					Вид = Виды.ВнутригородскойРайон;
				КонецЕсли;
				
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
					ПутьКАдресу + ".ГородСелоПоселение.Вид",
					Вид);
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
					ПутьКАдресу + ".ГородСелоПоселение.Наименование",
					АдресПоПриказуМинфина.Поселение);
			КонецЕсли;
			
			// Населенный пункт.
			Если ЗначениеЗаполнено(АдресПоПриказуМинфина.НаселенныйПункт) Тогда
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
					ПутьКАдресу + ".НаселенныйПункт.Вид",
					НРег(АдресПоПриказуМинфина.НаселенныйПунктТипКраткий));
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
					ПутьКАдресу + ".НаселенныйПункт.Наименование",
					АдресПоПриказуМинфина.НаселенныйПункт);
			КонецЕсли;
			
			// Элемент планировочной структуры.
			Если ЗначениеЗаполнено(АдресПоПриказуМинфина.Территория) Тогда	
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
					ПутьКАдресу + ".ЭлементПланировочнойСтруктуры.Тип",
					НРег(АдресПоПриказуМинфина.ТерриторияТипКраткий));
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
					ПутьКАдресу + ".ЭлементПланировочнойСтруктуры.Наименование",
					АдресПоПриказуМинфина.Территория);
			КонецЕсли;
			
			// Элемент улично-дорожной сети.
			Если ЗначениеЗаполнено(АдресПоПриказуМинфина.Улица) Тогда
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
					ПутьКАдресу + ".ЭлементУличноДорожнойСети.Тип",
					НРег(АдресПоПриказуМинфина.УлицаТипКраткий));
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
					ПутьКАдресу + ".ЭлементУличноДорожнойСети.Наименование",
					АдресПоПриказуМинфина.Улица);
			КонецЕсли;
			
			// Здание.
			Если ЗначениеЗаполнено(АдресПоПриказуМинфина.Здание.Номер) Тогда
				Здания = Новый ТаблицаЗначений;
				Здания.Колонки.Добавить("Тип");
				Здания.Колонки.Добавить("Номер");
				
				НоваяСтрока = Здания.Добавить();
				НоваяСтрока.Тип = НРег(АдресПоПриказуМинфина.Здание.ТипЗдания);
				НоваяСтрока.Номер = АдресПоПриказуМинфина.Здание.Номер;
				
				// В модуле ИнтеграцияЭДО идет добавление записи в таблицу.
				// При заполнении указывается лишь одна строка, необходимо перезаполнение зданий.
				ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, Здания, ПутьКАдресу + ".Здание");
			КонецЕсли;
			
			// Корпуса.
			Если ЗначениеЗаполнено(АдресПоПриказуМинфина.Корпуса) Тогда
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
					ПутьКАдресу + ".ПомещениеЗдания.Тип",
					НРег(АдресПоПриказуМинфина.Корпуса[0].ТипКорпуса));
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
					ПутьКАдресу + ".ПомещениеЗдания.Номер",
					АдресПоПриказуМинфина.Корпуса[0].Номер);
			КонецЕсли;
			
			// Помещения.
			Если ЗначениеЗаполнено(АдресПоПриказуМинфина.Помещения) Тогда
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
					ПутьКАдресу + ".ПомещениеКвартиры.Тип",
					НРег(АдресПоПриказуМинфина.Помещения[0].ТипПомещения));
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
					ПутьКАдресу + ".ПомещениеКвартиры.Номер",
					АдресПоПриказуМинфина.Помещения[0].Номер);
			КонецЕсли;
			
			// Земельный участок.
			Если ЗначениеЗаполнено(АдресПоПриказуМинфина.НомерЗемельногоУчастка) Тогда
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
					ПутьКАдресу + ".ЗемельныйУчасток",
					АдресПоПриказуМинфина.НомерЗемельногоУчастка);
			КонецЕсли;
			
			СтруктураВозврата.АдресЗаполнен         = ЗначениеЗаполнено(ИдентификаторГАР_ФИАС);
			СтруктураВозврата.ИдентификаторГАР_ФИАС = ИдентификаторГАР_ФИАС;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Возвращает таблицу участников.
// 
// Параметры:
//  ДеревоДанных - ДеревоЗначений
//  Путь - Строка
// 
// Возвращаемое значение:
//  см. ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента
//
Функция ПолучитьТаблицуУчастниковУПД_5_02(ДеревоДанных, Путь) Экспорт
	
	ТаблицаУчастников = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(ДеревоДанных, Путь);
	ТаблицаУчастников.Колонки.Добавить("СведенияОбУчастнике");
	
	Возврат ТаблицаУчастников;
	
КонецФункции

Функция ДайДокументыПодтвержденияОтгрузки_5_02(Шапка, ДеревоДанных, СтруктураЭД)
	
	Путь = "СведенияОСчетеФактуре.ДокументыОбОтгрузке";
	ДокументыПодтвержденияОтгрузки = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(
		ДеревоДанных, Путь);
	
	Если СтруктураЭД.Функция = "СЧФ" Тогда
		СтрокаДокументыПодтвержденияОтгрузки = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(
			ДеревоДанных, Путь + ".НомерСтроки.ДокументОбОтгрузке");
		
		Если Шапка.ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг Тогда
			ПредставлениеДокумента = НСтр("ru = 'Акт'");
		Иначе
			ПредставлениеДокумента = НСтр("ru = 'Товарная накладная'");
		КонецЕсли;
		
		СтрокаДокументыПодтвержденияОтгрузки.НаименованиеДокумента = ПредставлениеДокумента;
		СтрокаДокументыПодтвержденияОтгрузки.НомерДокумента        = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(Шапка.ДокументОснование);
		СтрокаДокументыПодтвержденияОтгрузки.ДатаДокумента         = Шапка.ДокументОснованиеДата;
	Иначе
		СтрокаДокументыПодтвержденияОтгрузки = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(
			ДеревоДанных, Путь + ".НомерСтроки.ДокументОбОтгрузке");
		СтрокаДокументыПодтвержденияОтгрузки.НаименованиеДокумента = НСтр("ru = 'Универсальный передаточный документ'");
		СтрокаДокументыПодтвержденияОтгрузки.НомерДокумента = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(Шапка);
		СтрокаДокументыПодтвержденияОтгрузки.ДатаДокумента  = Шапка.Дата;
	КонецЕсли;
	
	НоваяСтрока = ДокументыПодтвержденияОтгрузки.Добавить();
	НоваяСтрока.ДокументОбОтгрузке = СтрокаДокументыПодтвержденияОтгрузки;
	
	Возврат ДокументыПодтвержденияОтгрузки;
	
КонецФункции

// Добавляет данные участника в таблицу участников.
// 
// Параметры:
//  ДеревоДанных - ДеревоЗначений
//  ТаблицаУчастников - ТаблицаЗначений - см. ПолучитьТаблицуУчастниковУПД_5_02
//  ДанныеУчастника - Структура - см. ПолучитьДанныеУчастникаУПД
//  ПутьТаблицы - Строка
//  ИмяУчастника - Строка
//
Функция ДобавитьУчастникаУПД_5_02(ДеревоДанных, ТаблицаУчастников, ДанныеУчастника, ПутьТаблицы, ИмяУчастника) Экспорт

	СтрокаУчастника = ТаблицаУчастников.Добавить();
	СтрокаУчастника[ИмяУчастника] = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(
		ДеревоДанных, ПутьТаблицы + ".НомерСтроки." + ИмяУчастника);
	ЗаполнитьЗначенияСвойств(СтрокаУчастника[ИмяУчастника], ДанныеУчастника);
	СтрокаУчастника.СведенияОбУчастнике = ДанныеУчастника.СведенияОбУчастнике;
	
	Возврат СтрокаУчастника;
	
КонецФункции

Функция ЗаполнитьИнформациюОТоварах_5_02(ДанныеДляФормированияЭД, СтруктураЭД, ДеревоДанных)
	
	ТолькоУслуги = Истина;
	ТоварыКОтправке = НоваяТаблицаТоваровУПД_5_02();
	
	Путь = "СведенияОПередаче.Операция.";
	
	ПоддерживаемыеФорматы = ФорматыЭДО_ФНС.ПоддерживаемыеФорматы();
	ФорматУПД = ПоддерживаемыеФорматы.УПД_5_02.ИнформацияПродавца;
	
	ПризнакиТоваров = Новый Структура;
	ПризнакиТоваров.Вставить("Имущество", "1");
	ПризнакиТоваров.Вставить("Работа", "2");
	ПризнакиТоваров.Вставить("Услуга", "3");
	ПризнакиТоваров.Вставить("Право", "4");
	ПризнакиТоваров.Вставить("Иное", "5");
	
	ЕстьУслуги = Ложь;
	ЕстьТовары = Ложь;
	
	ВидыНоменклатурыТовар = ВидыНоменклатурыТовар();
	
	ЕстьПрослеживаемыйТовар = ЕстьРеквизит(ДанныеДляФормированияЭД, "ПрослеживаемыеТовары")
		И ДанныеДляФормированияЭД.ПрослеживаемыеТовары.Количество() > 0;
		
	ШтрихкодыКомбинаций = Неопределено;
	ШтрихкодыНоменклатуры = Неопределено;
	ШтрихкодыПоТоварам(ДанныеДляФормированияЭД.Товары, ШтрихкодыКомбинаций, ШтрихкодыНоменклатуры);
	
	СуммаНалога = Новый Структура("Сумма, БезНДС", 0, Истина);
	
	КодРФ = "643";
	
	Для Каждого Товар Из ДанныеДляФормированияЭД.Товары Цикл
		
		НоваяСтрока = ТоварыКОтправке.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар,, "ЕдиницаИзмеренияКод,ЕдиницаИзмеренияНаименование");
		
		НоваяСтрока.Код = Товар.КодНоменклатуры;
		
		Если НеобходимоУказатьЕдиницуИзмерения(Товар) Тогда
			
			НоваяСтрока.ЕдиницаИзмеренияКод = ПолучитьКодЕдиницыИзмерения(Товар);
			НоваяСтрока.ЕдиницаИзмеренияНаименование = Товар.ЕдиницаИзмеренияНаименование;
			
		КонецЕсли;
		
		Если Не ПустаяСтрока(Товар.НаименованиеХарактеристики) Тогда
			
			НоваяСтрока.Наименование = СтрШаблон(
				"%1 (%2)",
				Товар.НаименованиеНоменклатуры,
				Товар.НаименованиеХарактеристики
			);
			
		Иначе
			
			НоваяСтрока.Наименование = Товар.НаименованиеНоменклатуры;
			
		КонецЕсли;
		
		НоваяСтрока.СуммаАкциза = Новый Структура("Сумма, БезАкциза", Неопределено, Истина);
		НоваяСтрока.СуммаНалога = Новый Структура("Сумма, БезНДС", 0, Истина);
		
		НоваяСтрока.Цена    = ?(
			Товар.Количество = 0,
			0,
			Окр(Товар.СуммаБезНДС / Товар.Количество, 2, РежимОкругления.Окр15как20)
		);
		НоваяСтрока.СтоимостьБезНалога        = Товар.СуммаБезНДС;
		НоваяСтрока.НалоговаяСтавка           = Товар.СтавкаНДС;
		Если Товар.СтавкаНДС <> Справочники.СтавкиНДС.БезНДС Тогда
			НоваяСтрока.СуммаНалога.Сумма  = Товар.СуммаНДС;
			НоваяСтрока.СуммаНалога.БезНДС = Ложь;
			
			СуммаНалога.Сумма = СуммаНалога.Сумма + Товар.СуммаНДС;
			СуммаНалога.БезНДС = Ложь;
		КонецЕсли;
		
		НоваяСтрока.СтоимостьСНалогом = Товар.СуммаСНДС;
		
		Если НоваяСтрока.СуммаНалога.БезНДС Тогда
			НоваяСтрока.СуммаНалога.Сумма = Неопределено;
		Иначе
			НоваяСтрока.СуммаНалога.БезНДС = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Товар.КодТНВЭД) Тогда
			НоваяСтрока.КодВидаТовара = Товар.КодТНВЭД;
		КонецЕсли;
		
		НоваяСтрока.НаименованиеНавигационнаяСсылка = ПолучитьНавигационнуюСсылку(
				Товар.Номенклатура, "Наименование");
		
		Если ЗначениеЗаполнено(Товар.НомерТаможеннойДекларации) ИЛИ 
				ЗначениеЗаполнено(Товар.КодСтраныПроисхождения) И 
				(НЕ Товар.КодСтраныПроисхождения = КодРФ) Тогда
			
			Если ЕстьПрослеживаемыйТовар Тогда
				
				НоваяСтрока.СведенияОПрослеживаемости = СведенияОПрослеживаемыхТоваров(
					Товар, ДанныеДляФормированияЭД.ПрослеживаемыеТовары, ФорматУПД);
				
			КонецЕсли;
			
			СведенияОТаможеннойДекларации = Новый ТаблицаЗначений;
			СведенияОТаможеннойДекларации.Колонки.Добавить("КодСтраны", ОбщегоНазначения.ОписаниеТипаСтрока(3));
			СведенияОТаможеннойДекларации.Колонки.Добавить("НомерДекларации", ОбщегоНазначения.ОписаниеТипаСтрока(29));
			
			Декларация = СведенияОТаможеннойДекларации.Добавить();
			
			Если ЗначениеЗаполнено(Товар.НомерТаможеннойДекларации) Тогда
				Декларация.НомерДекларации = Товар.НомерТаможеннойДекларации;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Товар.КодСтраныПроисхождения) Тогда
				Декларация.КодСтраны = Товар.КодСтраныПроисхождения;
			КонецЕсли;
			
			НоваяСтрока.СведенияОДекларации = СведенияОТаможеннойДекларации;
			НоваяСтрока.СтранаПроисхождения = Товар.НаименованиеСтраныПроисхождения;
			
			СтраныПроисхождения = Новый ТаблицаЗначений;
			СтраныПроисхождения.Колонки.Добавить("СтранаПроисхождения", ОбщегоНазначения.ОписаниеТипаСтрока(255));
			
			Если ЗначениеЗаполнено(Товар.НаименованиеСтраныПроисхождения) Тогда
				НоваяСтрокаСтраны = СтраныПроисхождения.Добавить();
				НоваяСтрокаСтраны.СтранаПроисхождения = Товар.НаименованиеСтраныПроисхождения;
			КонецЕсли;
			
			НоваяСтрока.СтраныПроисхождения = СтраныПроисхождения;
			
		КонецЕсли;
		
		Если НЕ ТипЗнч(Товар.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			НоваяСтрока.Признак = ПризнакиТоваров.Иное;
		ИначеЕсли НЕ ВидыНоменклатурыТовар.Найти(Товар.ВидНоменклатуры) = Неопределено Тогда
			НоваяСтрока.Признак = ПризнакиТоваров.Имущество;
			ЕстьТовары = Истина;
		Иначе
			НоваяСтрока.Признак = ПризнакиТоваров.Услуга;
			ЕстьУслуги = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Товар.Артикул) Тогда
			НоваяСтрока.Код = СокрЛП(Товар.Артикул);
		КонецЕсли;
		
		//НоваяСтрока.ТоварИдентификатор = Товар.Номенклатура.УникальныйИдентификатор();
		ТолькоУслуги = ТолькоУслуги И (Товар.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга);
		
		Если ПроверитьGTINСтроки(Товар.GTIN) Тогда
			НоваяСтрока.ГТИН = Товар.GTIN;
		КонецЕсли;
		
		НоваяСтрока.СведенияОМаркировке = СведенияОКодахУпаковокМаркируемойПродукции_5_02(
			Товар, ДанныеДляФормированияЭД.КодыУпаковокТовараБезИдентификатора, ДанныеДляФормированияЭД.КодыУпаковокМаркируемойПродукции);
		
		НоваяСтрока.Сопоставление = СопоставленияНоменклатурыЭД(Товар.Номенклатура,
			Товар.Характеристика, Товар.ЕдиницаИзмерения);
			
		НоваяСтрока.Сопоставление.Вставить("Наименование", Товар.НаименованиеНоменклатуры);
		
		Если ЗначениеЗаполнено(Товар.НаименованиеХарактеристики) Тогда
			
			НоваяСтрока.Сопоставление.Вставить("Характеристика", Товар.НаименованиеХарактеристики);
			
		КонецЕсли;
		
		НоваяСтрока.Сопоставление.Вставить("ЕдиницаИзмерения"   , Товар.ЕдиницаИзмеренияНаименование);
		НоваяСтрока.Сопоставление.Вставить("ЕдиницаИзмеренияКод", Товар.ЕдиницаИзмеренияКод);
		НоваяСтрока.Сопоставление.Вставить("СтавкаНДС", Товар.СтавкаНДС);
		НоваяСтрока.Сопоставление.Вставить("Артикул"  , Товар.Артикул);
		
		ЗаполнитьШтрихкодыТоваровВСопоставление(
			НоваяСтрока.Сопоставление,
			ШтрихкодыНоменклатуры,
			ШтрихкодыКомбинаций,
			Товар.Номенклатура,
			Товар.Характеристика,
			Товар.ЕдиницаИзмерения
		);
		
		Если СтруктураЭД.ВариантыЗаполненияПолей.ТоварКод = "Артикул" Тогда
				
			НоваяСтрока.Код = СокрЛП(Товар.Артикул);
			
		ИначеЕсли
			СтруктураЭД.ВариантыЗаполненияПолей.ТоварКод = "Штрихкод"
			И НоваяСтрока.Сопоставление.Свойство("ШтрихкодКомбинации")
		Тогда
		
			НоваяСтрока.Код = НоваяСтрока.Сопоставление.ШтрихкодКомбинации;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СуммаНалога.БезНДС = Истина Тогда
		СуммаНалога.Сумма = Неопределено;
	Иначе
		СуммаНалога.БезНДС = Неопределено;
	КонецЕсли;
	
	ТекстОшибки = НСтр("ru = 'Не удалось заполнить итоговые стоимостные показатели. Возможные причины:
	|	- не заполнена табличная часть ""Товары""
	|	- не заполнены колонки ""Сумма"", ""НДС"", ""Количество""'");
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
	"ТаблицаСчетаФактуры.ВсегоКОплате.СтоимостьБезНалога", ТоварыКОтправке.Итог("СтоимостьБезНалога"), ТекстОшибки);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
	"ТаблицаСчетаФактуры.ВсегоКОплате.СтоимостьСНалогом", ТоварыКОтправке.Итог("СтоимостьСНалогом"), ТекстОшибки);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
	"ТаблицаСчетаФактуры.ВсегоКОплате.Количество", ТоварыКОтправке.Итог("Количество"), ТекстОшибки);
	
	ЭлектронноеВзаимодействие.ЗагрузитьСтруктуруВГруппуДерева(ДеревоДанных, СуммаНалога, "ТаблицаСчетаФактуры.ВсегоКОплате.СуммаНалога");
	ЭлектронноеВзаимодействие.ДобавитьВРеквизитОбработкуОшибки(ДеревоДанных, "ТаблицаСчетаФактуры.ВсегоКОплате.СуммаНалога", ТекстОшибки);
	
	СсылкаНаДокумент = ДанныеДляФормированияЭД.Шапка.Ссылка;
	
	// Обработка ошибки с открытием формы по навигационной ссылке.
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезНавигационнуюСсылку(ТоварыКОтправке,
		"Наименование", "НаименованиеНавигационнаяСсылка");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезОткрытиеФормы(ТоварыКОтправке,
		"Наименование", "Справочник.Номенклатура.ФормаОбъекта",, Новый Структура("Ключ", "Номенклатура"));
	
	// Обработка ошибки через механизм сообщений пользователю.
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке,
		"Код", "Номенклатура", "Объект.Код");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке,
		"Наименование", "Номенклатура", "Объект.НаименованиеПолное");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке,
		"Количество", СсылкаНаДокумент, "Объект.Товары.Количество",, "НомерСтрокиИсходногоДокумента");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке,
		"Цена", СсылкаНаДокумент, "Объект.Товары.Цена",, "НомерСтрокиИсходногоДокумента");
	
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке,
		"СтоимостьБезНалога", СсылкаНаДокумент, "Объект.Товары.Сумма",, "НомерСтрокиИсходногоДокумента");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке,
		"ЕдиницаИзмеренияНаименование", "ЕдиницаИзмерения", "Объект.Наименование");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке,
		"ЕдиницаИзмеренияКод", "ЕдиницаИзмерения", "Объект.Код");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке,
		"Признак", "Номенклатура", "Объект.ВидНоменклатуры");
	
	// Обработка ошибки через упрощенный механизм
	ТекстОшибки = НСтр("ru = 'для формирования электронного документа необходимо указать налоговую ставку'");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке,
		"НалоговаяСтавка",,, ТекстОшибки);
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ТоварыКОтправке, "ТаблицаСчетаФактуры.СведенияОбОтгруженныхПозициях");
	
	ТекстОшибки = НСтр("ru = 'Возникла ошибка при заполнении страны происхождения в сведениях по ГТД. Возможные причины:
	|	- не заполнена колонка ""Страна происхождения""
	|	- указанной страны нет в классификаторе стран мира'");
	ЭлектронноеВзаимодействие.ДобавитьВРеквизитОбработкуОшибки(ДеревоДанных,
		"ТаблицаСчетаФактуры.СведенияОбОтгруженныхПозициях.НомерСтроки.СведенияОДекларации.НомерСтроки.КодСтраны", ТекстОшибки);
	
	СодержаниеОперации = "-";
	Если СтруктураЭД.Функция <> "СЧФ" Тогда
		
		Если ТипЗнч(ДанныеДляФормированияЭД.Шапка.Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			ХозОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДляФормированияЭД.Шапка.ДокументОснование, "ХозОперация");
		Иначе
			ХозОперация = ДанныеДляФормированияЭД.Шапка.ХозОперация;
		КонецЕсли;
		
		СоставСодержания = Новый Массив;
		Если ЕстьТовары Или (НЕ ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг) Тогда
			СоставСодержания.Добавить(НСтр("ru = 'Товары переданы.'"));
		КонецЕсли;
		
		Если ЕстьУслуги Или ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг Тогда
			СоставСодержания.Добавить(НСтр("ru = 'Услуги оказаны в полном объеме.'"));
		КонецЕсли;
		СодержаниеОперации = СтрСоединить(СоставСодержания, " ");
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ТолькоУслуги", ТолькоУслуги);
	КонецЕсли;
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, Путь + "СодержаниеОперации", СодержаниеОперации);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, Путь + "ДатаОтгрузки",       ДанныеДляФормированияЭД.Шапка.Дата);
	
	Возврат ДеревоДанных;
	
КонецФункции

Функция НоваяТаблицаТоваровУПД_5_02() Экспорт
	
	Число_26_11 = ОбщегоНазначения.ОписаниеТипаЧисло(26, 11);
	Число_19_2 = ОбщегоНазначения.ОписаниеТипаЧисло(19, 2);
	Строка_255 = ОбщегоНазначения.ОписаниеТипаСтрока(255);
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("НомерСтроки");
	ТаблицаТоваров.Колонки.Добавить("НомерСтрокиИсходногоДокумента");
	ТаблицаТоваров.Колонки.Добавить("ИдентификаторСтроки");
	ТаблицаТоваров.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(2000));
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмеренияКод", ОбщегоНазначения.ОписаниеТипаСтрока(4));
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмеренияНаименование", Строка_255);
	ТаблицаТоваров.Колонки.Добавить("Количество", Число_26_11);
	ТаблицаТоваров.Колонки.Добавить("Цена");
	ТаблицаТоваров.Колонки.Добавить("СтоимостьБезНалога", Число_19_2);
	ТаблицаТоваров.Колонки.Добавить("СтоимостьСНалогом", Число_19_2);
	ТаблицаТоваров.Колонки.Добавить("СуммаНалога");
	ТаблицаТоваров.Колонки.Добавить("НалоговаяСтавка");
	ТаблицаТоваров.Колонки.Добавить("СуммаАкциза");
	ТаблицаТоваров.Колонки.Добавить("СведенияОДекларации");
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаТоваров.Колонки.Добавить("НаименованиеНавигационнаяСсылка");
	ТаблицаТоваров.Колонки.Добавить("ОснованиеОсвобожденияОтНДС");
	ТаблицаТоваров.Колонки.Добавить("Сопоставление");
	ТаблицаТоваров.Колонки.Добавить("Признак", ОбщегоНазначения.ОписаниеТипаСтрока(1));
	ТаблицаТоваров.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаТоваров.Колонки.Добавить("КодВидаТовара", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	ТаблицаТоваров.Колонки.Добавить("СтранаПроисхождения", Строка_255);
	ТаблицаТоваров.Колонки.Добавить("СтраныПроисхождения");
	ТаблицаТоваров.Колонки.Добавить("СведенияОМаркировке");
	ТаблицаТоваров.Колонки.Добавить("СведенияОПрослеживаемости");
	ТаблицаТоваров.Колонки.Добавить("ДанныеДляРасчетаАмортизации");
	ТаблицаТоваров.Колонки.Добавить("ГТИН", ОбщегоНазначения.ОписаниеТипаСтрока(14));
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция СведенияОКодахУпаковокМаркируемойПродукции_5_02(СтрокаДокумента, КодыУпаковокТовараБезИдентификатора, КодыДокумента, ПоДокументу = Ложь) Экспорт
	
	СведенияОМаркировке = Новый ТаблицаЗначений;
	СведенияОМаркировке.Колонки.Добавить("ИдентификаторУпаковки", ОбщегоНазначения.ОписаниеТипаСтрока(255));
	СведенияОМаркировке.Колонки.Добавить("Количество",            ОбщегоНазначения.ОписаниеТипаЧисло(20, 0));
	СведенияОМаркировке.Колонки.Добавить("Партия",                ОбщегоНазначения.ОписаниеТипаСтрока(255));
	
	ОсобенностьУчета = Справочники.Номенклатура.ПолучитьОсобенностьУчета(СтрокаДокумента.Номенклатура);
	
	Если ЗначениеЗаполнено(ОсобенностьУчета) Тогда
		ОСУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсобенностьУчета, "ОСУ");
	Иначе
		ОСУ = Ложь;
	КонецЕсли;
	
	Если ОСУ Тогда
		
		Если ПоДокументу Тогда
			GTINВСтроке = СтрокаДокумента.GTINПоДокументу;
		Иначе
			GTINВСтроке = СтрокаДокумента.GTIN;
		КонецЕсли;
		
		GTIN = "";
		Если ПроверитьGTINСтроки(GTINВСтроке) Тогда
			GTIN = GTINВСтроке;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(GTIN) Тогда
			
			Если ПоДокументу Тогда
				КоличествоУпаковокВСтроке = СтрокаДокумента.КоличествоУпаковокПоДокументу;
			Иначе
				КоличествоУпаковокВСтроке = СтрокаДокумента.КоличествоУпаковок;
			КонецЕсли;
			
			Весовой = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДокумента.Номенклатура, "ТипНоменклатуры.Весовой");
			
			Если ЗначениеЗаполнено(КоличествоУпаковокВСтроке) Тогда
				Количество = КоличествоУпаковокВСтроке;
			ИначеЕсли НЕ Весовой Тогда
				Количество = Цел(СтрокаДокумента.Количество);
			КонецЕсли;
			
			НоваяСтрока = СведенияОМаркировке.Добавить();
			НоваяСтрока.Количество = Количество;
			
		КонецЕсли;
		
		Возврат СведенияОМаркировке;
		
	КонецЕсли;
	
	ВидПродукции          = Справочники.ОсобенностиУчетаНоменклатуры.ПолучитьВидПродукции(ОсобенностьУчета);
	ЛогистическаяУпаковка = Перечисления.ВидыУпаковокМаркировки.Логистическая;
	
	// Если у документа есть таблица марок связанная с товарами по идентификатору
	Если КодыУпаковокТовараБезИдентификатора = Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(КодыДокумента) Тогда
			// Передадим пустые коды маркировок
			Возврат СведенияОМаркировке;
		КонецЕсли;
		
		Если КодыДокумента.Колонки.Найти("ДокументОснование") = Неопределено ИЛИ (НЕ СтрокаДокумента.Свойство("ДокументОснование")) Тогда
			НайденнаяСтрока = КодыДокумента.Строки.Найти(СтрокаДокумента.ИдентификаторСтроки, "ИдентификаторСтроки");
		Иначе
			КодыМаркировкиОснования = КодыДокумента.Строки.Найти(СтрокаДокумента.ДокументОснование, "ДокументОснование");
			Если КодыМаркировкиОснования = Неопределено Тогда
				Возврат СведенияОМаркировке;
			КонецЕсли;
			
			НайденнаяСтрока = КодыМаркировкиОснования.Строки.Найти(СтрокаДокумента.ИдентификаторСтроки, "ИдентификаторСтроки");
		КонецЕсли;
		
		Если НайденнаяСтрока = Неопределено Тогда
			Возврат СведенияОМаркировке;
		КонецЕсли;
		
		ЗаполненныеСтроки = Новый Массив;
		
		ИндексМарки = НайденнаяСтрока.Строки.Количество()-1;
		
		Пока ИндексМарки>=0 Цикл
			
			ТекущаяМаркировка = НайденнаяСтрока.Строки[ИндексМарки];
			
			// Найдем номенклатуру по GTIM
			СтруктураМаркировки = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ТекущаяМаркировка.КодМарки);
			
			Если ЭтоНеКодТовараВФорматеDataMatrixGS1(СтруктураМаркировки.ТипИдентификатораТовара) Тогда
				ИндексМарки = ИндексМарки - 1;
				Продолжить;
			КонецЕсли;
			
			КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ТекущаяМаркировка.КодМарки, "", Ложь);
			
			НоваяСтрока = СведенияОМаркировке.Добавить();
			НоваяСтрока.ИдентификаторУпаковки = КодМаркировки;
			
			// Уберем указанные коды маркировки с рассмотрения
			НайденнаяСтрока.Строки.Удалить(ТекущаяМаркировка);
			
			ИндексМарки = ИндексМарки - 1;
			
		КонецЦикла;
		
	Иначе
		// Если нет связи товаров и марок по идентификатору
		
		КоличествоБазовое = СтрокаДокумента.КоличествоБазовое;
		
		ТаблицаКодовСтроки = Новый Массив;
		
		КомбинацииПоиска = ТорговыйКомплексКлиентСервер.ПолучитьКомбинацииПоиска(СтрокаДокумента, "Номенклатура", "Характеристика, Партия, ГТД");
		
		ПропущеннаяСтрокаМарки  = Неопределено;
		Для Каждого ПараметрыПоиска Из КомбинацииПоиска Цикл
			
			Если КоличествоБазовое = 0 Тогда
				Прервать;
			КонецЕсли;
			
			НайденныеСтроки = КодыУпаковокТовараБезИдентификатора.НайтиСтроки(ПараметрыПоиска);
			Для Каждого ТекущаяМаркировка Из НайденныеСтроки Цикл
				
				Если КоличествоБазовое = 0 Тогда
					Прервать;
				КонецЕсли;
				
				Если ТекущаяМаркировка.КоличествоБазовое = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если КоличествоБазовое<ТекущаяМаркировка.КоличествоБазовое Тогда
					Если ПропущеннаяСтрокаМарки = Неопределено Тогда
						ПропущеннаяСтрокаМарки = ТекущаяМаркировка;
					ИначеЕсли ПропущеннаяСтрокаМарки.КоличествоБазовое>ТекущаяМаркировка.КоличествоБазовое Тогда
						ПропущеннаяСтрокаМарки = ТекущаяМаркировка;
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				
				СтруктураМаркировки = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ТекущаяМаркировка.КодМарки);
				
				Если ЭтоНеКодТовараВФорматеDataMatrixGS1(СтруктураМаркировки.ТипИдентификатораТовара) Тогда
					КодыУпаковокТовараБезИдентификатора.Удалить(ТекущаяМаркировка);
					Продолжить;
				КонецЕсли;
				
				КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ТекущаяМаркировка.КодМарки, "", Ложь);
				
				НоваяСтрока = СведенияОМаркировке.Добавить();
				НоваяСтрока.ИдентификаторУпаковки = КодМаркировки;
				
				КоличествоБазовое = КоличествоБазовое-ТекущаяМаркировка.КоличествоБазовое;
				
				// Уберем указанные коды маркировки с рассмотрения
				КодыУпаковокТовараБезИдентификатора.Удалить(ТекущаяМаркировка);
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если КоличествоБазовое>0 И (НЕ ПропущеннаяСтрокаМарки = Неопределено) Тогда
			СтруктураМаркировки = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ПропущеннаяСтрокаМарки.КодМарки);
			Если НЕ ЭтоНеКодТовараВФорматеDataMatrixGS1(СтруктураМаркировки.ТипИдентификатораТовара) Тогда
				
				КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ПропущеннаяСтрокаМарки.КодМарки, "", Ложь);
				
				НоваяСтрока = СведенияОМаркировке.Добавить();
				НоваяСтрока.ИдентификаторУпаковки = КодМаркировки;
				
			КонецЕсли;
			
			КодыУпаковокТовараБезИдентификатора.Удалить(ПропущеннаяСтрокаМарки);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СведенияОМаркировке;
	
КонецФункции

#КонецОбласти

#Область Получение

Процедура НайтиСоздатьУПДДокументОПередаче_5_02(ДеревоДанных, СсылкаНаВладельца, Записывать, СпособОбработки, ОписаниеОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеЗаполнения = Новый Структура("ЗаполнятьПоСтуктуре", Истина);
	ДополнитьДанныеЗаполненияВалютой(ДеревоДанных, ДанныеЗаполнения, "СведенияОСчетеФактуре.Валюта.Код");
	ДополнитьДанныеЗаполненияВходящимДокументом("Документа", ДеревоДанных, ДанныеЗаполнения, "СведенияОСчетеФактуре.");
	ДополнитьДанныеЗаполненияИсправлением(ДеревоДанных, ДанныеЗаполнения, "СведенияОСчетеФактуре.Исправление.");
	ДополнитьДанныеЗаполненияКонтрагентомИсточникТаблица(ДеревоДанных, ДанныеЗаполнения, 
		"СведенияОСчетеФактуре.СведенияОПродавцах", "СведенияОСчетеФактуре.СведенияОПродавцах.НомерСтроки.Продавец", Истина);
	ДополнитьДанныеЗаполненияОрганизациейИсточникТаблица(ДеревоДанных, ДанныеЗаполнения, 
		"СведенияОСчетеФактуре.СведенияОПокупателях", "СведенияОСчетеФактуре.СведенияОПокупателях.НомерСтроки.Покупатель", Истина);
	ДополнитьДанныеЗаполненияГрузотправителемИсточникТаблица(ДеревоДанных, ДанныеЗаполнения,
		"СведенияОСчетеФактуре.СведенияОГрузоотправителях", Истина);
	ДополнитьДанныеЗаполненияГрузополучателемИсточникТаблица(ДеревоДанных, ДанныеЗаполнения,
		"СведенияОСчетеФактуре.СведенияОГрузополучателях", "СведенияОСчетеФактуре.СведенияОГрузополучателях.НомерСтроки.Грузополучатель", Истина);
	ДополнитьДанныеЗаполненияПодразделениемКомпании(ДеревоДанных, ДанныеЗаполнения,
		"СведенияОСчетеФактуре.СведенияОПокупателях", "СведенияОСчетеФактуре.СведенияОПокупателях.НомерСтроки.Покупатель", Истина);
	ДополнитьДанныеЗаполненияДоговорВзаиморасчетов(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОснованиемДокументаОтгрузки(ДеревоДанных, ДанныеЗаполнения);
	
	Если СпособОбработки = "ВозвратТоваровОтПокупателя" Тогда
		
		ДополнитьДанныеЗаполненияТоварами_5_02(ДеревоДанных, ДанныеЗаполнения, "ВозвратОтПокупателя");
		
		Если ЭтоУПДОтКоммитента(ДеревоДанных, "СведенияОСчетеФактуре.") Тогда
			
			ДанныеЗаполнения.Вставить("ХозОперация", Справочники.ХозОперации.ВозвратТоваровОтПокупателяКомиссия);
			
		Иначе
			
			ДанныеЗаполнения.Вставить("ХозОперация", Справочники.ХозОперации.ВозвратТоваровОтПокупателя);
			
		КонецЕсли;
		
		ЗаполнитьДокументВозвратТоваровОтПокупателя(ДанныеЗаполнения, СсылкаНаВладельца, Записывать, ОписаниеОшибки);
		
	Иначе
		
		Основание = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "Основание", Неопределено);
		
		Если ДанныеЗаполнения.Исправление И ЗначениеЗаполнено(Основание) Тогда
			
			ДополнитьДанныеЗаполненияТоварами_5_02(ДеревоДанных, ДанныеЗаполнения);
			ЗаполнитьДокументКорректировкиПоступления(ДанныеЗаполнения, СсылкаНаВладельца, ОписаниеОшибки);
			
		Иначе
			
			Если ЭтоУПДОтКоммитента(ДеревоДанных, "СведенияОСчетеФактуре.") Тогда
				
				ДанныеЗаполнения.Вставить("ХозОперация", Справочники.ХозОперации.ПоступлениеТоваровКомиссия);
				
			Иначе
				
				ДанныеЗаполнения.Вставить("ХозОперация", Справочники.ХозОперации.ПоступлениеТоваров);
				
			КонецЕсли;
			
			ДополнитьДанныеЗаполненияТоварами_5_02(ДеревоДанных, ДанныеЗаполнения);
			ЗаполнитьДокументПоступленияТоваров(ДанныеЗаполнения, СсылкаНаВладельца, Записывать, ОписаниеОшибки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	//// Поиск и заполнение договора контрагента.
	//Путь = "СведенияОПередаче.Операция.ОснованиеОтгрузкиПередачи.ДокументыОснования";
	//ОснованияОтгрузки = ДеревоДанных.Строки.Найти(Путь, "ПолныйПуть", Истина);
	//Если ОснованияОтгрузки <> Неопределено Тогда
	//	Для Каждого СтрокаОснованиеОтгрузки Из ОснованияОтгрузки.Строки Цикл
	//		ДоговорНомер = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СтрокаОснованиеОтгрузки,
	//			Путь + ".НомерСтроки.ДокументОснование.НомерДокумента");
	//		ДоговорДата = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СтрокаОснованиеОтгрузки,
	//			Путь + ".НомерСтроки.ДокументОснование.ДатаДокумента");
	//		Если ЗначениеЗаполнено(ДоговорНомер) Тогда
	//			
	//			СвойстваДоговора = Новый Структура;
	//			СвойстваДоговора.Вставить("НомерДоговора", ДоговорНомер);
	//			СвойстваДоговора.Вставить("ДатаДоговора", ДоговорДата);
	//			СвойстваДоговора.Вставить("Организация", ДокументОбъект.Организация);
	//			СвойстваДоговора.Вставить("Владелец", ДокументОбъект.Контрагент);
	//			
	//			ДоговорКонтрагента = ЭлектронноеВзаимодействие.НайтиСсылку("ДоговорыКонтрагентов",, СвойстваДоговора);
	//			ДокументОбъект.ДоговорКонтрагента = ДоговорКонтрагента;
	//			
	//		КонецЕсли;
	//		Прервать;
	//	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры

Процедура НайтиСоздатьУПДСчетФактуру_5_02(ДеревоДанных, СсылкаНаВладельца = Неопределено, СпособОбработки = "", ОписаниеОшибки = "")
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеЗаполнения = Новый Структура("ЗаполнятьПоСтуктуре", Истина);
	ДополнитьДанныеЗаполненияВалютой(ДеревоДанных, ДанныеЗаполнения, "СведенияОСчетеФактуре.Валюта.Код");
	ДополнитьДанныеЗаполненияИсправлением(ДеревоДанных, ДанныеЗаполнения, "СведенияОСчетеФактуре.Исправление.");
	ДополнитьДанныеЗаполненияВходящимДокументом("Документа", ДеревоДанных, ДанныеЗаполнения, "СведенияОСчетеФактуре.");
	ДополнитьДанныеЗаполненияКонтрагентомИсточникТаблица(ДеревоДанных, ДанныеЗаполнения, 
		"СведенияОСчетеФактуре.СведенияОПродавцах", "СведенияОСчетеФактуре.СведенияОПродавцах.НомерСтроки.Продавец", Истина);
	ДополнитьДанныеЗаполненияОрганизациейИсточникТаблица(ДеревоДанных, ДанныеЗаполнения, 
		"СведенияОСчетеФактуре.СведенияОПокупателях", "СведенияОСчетеФактуре.СведенияОПокупателях.НомерСтроки.Покупатель", Истина);
	ДополнитьДанныеЗаполненияГрузотправителемИсточникТаблица(ДеревоДанных, ДанныеЗаполнения,
		"СведенияОСчетеФактуре.СведенияОГрузоотправителях", Истина);
	ДополнитьДанныеЗаполненияГрузополучателемИсточникТаблица(ДеревоДанных, ДанныеЗаполнения,
		"СведенияОСчетеФактуре.СведенияОГрузополучателях", "СведенияОСчетеФактуре.СведенияОГрузополучателях.НомерСтроки.Грузополучатель", Истина);
	ДополнитьДанныеЗаполненияПодразделениемКомпании(ДеревоДанных, ДанныеЗаполнения,
		"СведенияОСчетеФактуре.СведенияОПокупателях", "СведенияОСчетеФактуре.СведенияОПокупателях.НомерСтроки.Покупатель", Истина);
	ДополнитьДанныеЗаполненияДоговорВзаиморасчетов(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияВидомСчетаФактуры(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОснованиемДляСчетаФактуры(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияТоварами_5_02(ДеревоДанных, ДанныеЗаполнения, "СчетФактураПолученный");
	
	ЗаполнитьДокументСчетФактурыПолученого(ДанныеЗаполнения, СсылкаНаВладельца, ОписаниеОшибки);
	
КонецПроцедуры

#Область ПодготовкаДанныхДокументовКЗагрузке_5_02

Процедура ДополнитьДанныеЗаполненияТоварами_5_02(ДеревоДанных, ДанныеЗаполнения, ТипДокумента = "ПоступлениеТоваров") Экспорт
	
	Товары = НоваяТаблицаТоваров(ТипДокумента);
	
	ДокументХранитКодыМаркировки = ДокументХранитКодыМаркировки(ТипДокумента);
	
	Если ДокументХранитКодыМаркировки Тогда
		
		КодыМаркировки = НоваяТаблицаКодовМаркировки();
		
	КонецЕсли;
	
	Если Товары.Колонки.Найти("СведенияОПрослеживаемости") = Неопределено Тогда
		
		Товары.Колонки.Добавить("СведенияОПрослеживаемости");
		
	КонецЕсли;
	
	Если Товары.Колонки.Найти("НоменклатураПоставщика") = Неопределено Тогда
		
		Товары.Колонки.Добавить("НоменклатураПоставщика");
		
	КонецЕсли;
	
	Контрагент = Неопределено;
	ДанныеЗаполнения.Свойство("Контрагент", Контрагент);
	
	Путь = "ТаблицаСчетаФактуры.СведенияОбОтгруженныхПозициях";
	СведенияОТоварах = ДеревоДанных.Строки.Найти(Путь, "ПолныйПуть", Истина);
	
	Для Каждого СведенияОТоваре Из СведенияОТоварах.Строки Цикл
		
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьСлужебныеРеквизитыПозицииТовара(НоваяСтрока);
		ЗаполнитьТоварыСопоставленнымиДанными(СведенияОТоваре, НоваяСтрока, Контрагент, Путь);
		ЗаполнитьТоварыСуммами_5_02(СведенияОТоваре, НоваяСтрока, Путь);
		
		Если ДокументХранитКодыМаркировки Тогда
			
			GTIN = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
						"ТаблицаСчетаФактуры.СведенияОбОтгруженныхПозициях.НомерСтроки.ГТИН");
			НоваяСтрока.GTIN = GTIN;
			
			СведенияОМаркировке = СведенияОМаркировкеИзСтрокиТоваровУПД_5_02(СведенияОТоваре, Путь);
			Если СведенияОМаркировке.ОСУ.Количество()>0 Тогда
				НоваяСтрока.КоличествоМест = СведенияОМаркировке.ОСУ[0];
			Иначе
				ДополнитьКодыМаркировки(КодыМаркировки, НоваяСтрока, СведенияОТоваре, СведенияОМаркировке);
			КонецЕсли;
			НоваяСтрока.КоличествоМестДок = НоваяСтрока.КоличествоМест;
		КонецЕсли;
		
		ДополнитьСведениямиОТаможеннойДекларации_5_02(СведенияОТоваре, НоваяСтрока, Путь);
		ДополнитьСведениямиОПрослеживаемости(СведенияОТоваре, НоваяСтрока, "ТаблицаСчетаФактуры.СведенияОбОтгруженныхПозициях");
		
	КонецЦикла;
	
	ДанныеЗаполнения.Вставить("Товары", Товары);
	ДанныеЗаполнения.Вставить("КодыМаркировки", КодыМаркировки);
	
КонецПроцедуры

Процедура ЗаполнитьТоварыСуммами_5_02(СведенияОТоваре, ПозицияТовара, Путь)
	
	ПозицияТовара.Количество = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		Путь+".НомерСтроки.Количество");
	ПозицияТовара.Цена = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		Путь+".НомерСтроки.Цена");
	ПозицияТовара.Сумма = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		Путь+".НомерСтроки.СтоимостьБезНалога");
	
	СтавкаНДС = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		Путь+".НомерСтроки.НалоговаяСтавка");
		
	Если СтавкаНДС = "НДС исчисляется налоговым агентом" Тогда
		ПозицияТовара.СуммаВсего = ПозицияТовара.Сумма;
	Иначе
		ПозицияТовара.СуммаВсего = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
			Путь+".НомерСтроки.СтоимостьСНалогом");
		ПозицияТовара.СтавкаНДС  = СтавкаНДС;
		ПозицияТовара.СуммаНДС   = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
			Путь+".НомерСтроки.СуммаНалога.Сумма");
	КонецЕсли;
	
	Если ПозицияТовара.Количество = 0 Тогда
		ПозицияТовара.Количество = 1;
	КонецЕсли;
	
	Если ПозицияТовара.Цена = 0 Тогда
		ПозицияТовара.Цена = Окр(ПозицияТовара.Сумма/ПозицияТовара.Количество,2);
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияТовара, "КоличествоБазовое") Тогда
		
		ПозицияТовара.КоличествоБазовое = ПозицияТовара.Количество * ПозицияТовара.Коэффициент;
		
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияТовара, "КоличествоПоНакладной") Тогда
		
		ПозицияТовара.КоличествоПоНакладной = ПозицияТовара.Количество;
		
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияТовара, "КоличествоДок") Тогда
		
		ПозицияТовара.КоличествоДок     = ПозицияТовара.Количество;
		ПозицияТовара.ЦенаДок           = ПозицияТовара.Цена;
		ПозицияТовара.СуммаДок          = ПозицияТовара.СуммаВсего;
		//ПозицияТовара.КоличествоМестДок = ПозицияТовара.КоличествоМест;
		
	КонецЕсли;
	
КонецПроцедуры

//// Возвращает коды маркировки для строки товара из дерева электронного документа ЭДО.
////
//// Параметры:
////	СведенияОТоваре - СтрокаДереваЗначений - строка товаров дерева электронного документа ЭДО.
////
//// Пример использования:
////	СведенияОТоварах = ДеревоДанных.Строки.Найти("СведенияОТоварах", "ПолныйПуть");
////	Для Каждого СведенияОТоваре Из СведенияОТоварах.Строки Цикл
////		ШтрихкодыУпаковок = ЭлектронноеВзаимодействиеИСМП.ШтрихкодыУпаковокИзСтрокиДереваЭДО(СведенияОТоваре);
////	КонецЦикла;.
////
//Функция ШтрихкодыУпаковокИзСтрокиДереваЭДО_2024(СведенияОМаркировке, Знач ПутьКСведениямОМаркировке = "")
//	
//	ШтрихкодыУпаковок = Новый Массив;
//	
//	Для Каждого СтрокаМаркировки Из СведенияОМаркировке Цикл
//		Номера = "";
//		Если СтрокаМаркировки.Идентификатор.Свойство("КонтрольныеЗнаки") Тогда
//			Для каждого КонтрольныйЗнак Из СтрокаМаркировки.Идентификатор.КонтрольныеЗнаки Цикл
//				НоваяСтрока = Новый Структура;
//				НоваяСтрока.Вставить("КодМарки",    КонтрольныйЗнак.КонтрольныйЗнак);
//				НоваяСтрока.Вставить("ВидУпаковки", Перечисления.ВидыУпаковокИС.Потребительская);
//				ШтрихкодыУпаковок.Добавить(НоваяСтрока)
//			КонецЦикла;
//		ИначеЕсли СтрокаМаркировки.Идентификатор.Свойство("ИдентификаторыУпаковок") Тогда
//			Для каждого КонтрольныйЗнак Из СтрокаМаркировки.Идентификатор.ИдентификаторыУпаковок Цикл
//				НоваяСтрока = Новый Структура;
//				НоваяСтрока.Вставить("КодМарки",    КонтрольныйЗнак.ИдентификаторУпаковки);
//				НоваяСтрока.Вставить("ВидУпаковки", Перечисления.ВидыУпаковокИС.Логистическая);
//				ШтрихкодыУпаковок.Добавить(НоваяСтрока)
//			КонецЦикла;
//		Иначе
//			НоваяСтрока = Новый Структура;
//			НоваяСтрока.Вставить("КодМарки",    СтрокаМаркировки.ИдентификаторУпаковки);
//			НоваяСтрока.Вставить("ВидУпаковки", Перечисления.ВидыУпаковокИС.Потребительская);
//			НоваяСтрока.Вставить("Количество",  СтрокаМаркировки.Количество);
//			НоваяСтрока.Вставить("ОСУ",         Истина);
//			ШтрихкодыУпаковок.Добавить(НоваяСтрока)
//		КонецЕсли;
//	КонецЦикла;
//	
//	Возврат ШтрихкодыУпаковок;
//	
//КонецФункции

Функция СведенияОМаркировкеИзСтрокиТоваровУПД_5_02(СведенияОТоваре, Путь)
	
	Результат = Новый Структура("ИндивидуальныеУпаковки, ТранспортныеУпаковки, ОСУ");
	
	Результат.ИндивидуальныеУпаковки = Новый Массив;
	Результат.ТранспортныеУпаковки   = Новый Массив;
	Результат.ОСУ                    = Новый Массив;
	
	ПутьСведенияОМаркировке = Путь + ".НомерСтроки.СведенияОМаркировке";
	
	ГруппыУпаковок = СведенияОТоваре.Строки.Найти(ПутьСведенияОМаркировке, "ПолныйПуть", Истина);
	
	Если ГруппыУпаковок <> Неопределено И ЗначениеЗаполнено(ГруппыУпаковок.Значение) Тогда
		
		Для Каждого ГруппаУпаковок Из ГруппыУпаковок.Строки Цикл
			
			ШтрихкодУпаковки = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ГруппаУпаковок, ПутьСведенияОМаркировке+".НомерСтроки.ИдентификаторУпаковки");
			КоличествоПоОСУ  = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ГруппаУпаковок, ПутьСведенияОМаркировке+".НомерСтроки.Количество");
			
			Если ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда 
				Результат.ИндивидуальныеУпаковки.Добавить(ШтрихкодУпаковки);
			ИначеЕсли ЗначениеЗаполнено(КоличествоПоОСУ) Тогда
				Результат.ОСУ.Добавить(КоличествоПоОСУ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПутьИдентификаторыУпаковок = ПутьСведенияОМаркировке + ".НомерСтроки.Идентификатор.ИдентификаторыУпаковок";
	
	ИдентификаторыУпаковок = СведенияОТоваре.Строки.Найти(ПутьИдентификаторыУпаковок, "ПолныйПуть", Истина);
	Если ИдентификаторыУпаковок <> Неопределено И ЗначениеЗаполнено(ИдентификаторыУпаковок.Значение) Тогда
		
		Для Каждого ГруппаУпаковок Из ИдентификаторыУпаковок.Строки Цикл
			
			ШтрихкодУпаковки = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ГруппаУпаковок, ПутьИдентификаторыУпаковок + ".НомерСтроки.ИдентификаторУпаковки");
			
			Если ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда 
				Результат.ИндивидуальныеУпаковки.Добавить(ШтрихкодУпаковки);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПутьКонтрольныеЗнаки = ПутьСведенияОМаркировке + ".НомерСтроки.Идентификатор.КонтрольныеЗнаки";
	
	КонтрольныеЗнаки = СведенияОТоваре.Строки.Найти(ПутьКонтрольныеЗнаки, "ПолныйПуть", Истина);
	Если КонтрольныеЗнаки <> Неопределено И ЗначениеЗаполнено(КонтрольныеЗнаки.Значение) Тогда
		
		Для Каждого ГруппаУпаковок Из КонтрольныеЗнаки.Строки Цикл
			
			ШтрихкодУпаковки = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ГруппаУпаковок, ПутьКонтрольныеЗнаки + ".НомерСтроки.ИдентификаторУпаковки");
			
			Если ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда 
				Результат.ИндивидуальныеУпаковки.Добавить(ШтрихкодУпаковки);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьСведениямиОТаможеннойДекларации_5_02(СведенияОТоваре, ПозицияТовара, Путь)
	
	Если
		Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияТовара, "ГТД")
		Или Не ЗначениеЗаполнено(ПозицияТовара.Номенклатура)
	Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Признак = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре, Путь + ".НомерСтроки.Признак");
	
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПозицияТовара.Номенклатура, "ВидНоменклатуры");
	
	Если ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга 
		Или (ЗначениеЗаполнено(Признак) И Признак <> "1") Тогда
		
		Возврат;
		
	КонецЕсли;

	ЭтоРНПТ = Ложь;
	СведенияОПрослеживаемости = СведенияОТоваре.Строки.Найти(
		Путь + ".НомерСтроки.СведенияОПрослеживаемости", "ПолныйПуть", Истина);
	
	Если СведенияОПрослеживаемости <> Неопределено
		И СведенияОПрослеживаемости.Строки.Количество() > 0
		И ЗначениеЗаполнено(СведенияОПрослеживаемости.Значение) Тогда
		
		ЭтоРНПТ = Истина;
		
	КонецЕсли; 
	
	СведенияОТаможеннойДекларации = СведенияОТоваре.Строки.Найти(
		Путь + ".НомерСтроки.СведенияОДекларации", "ПолныйПуть", Истина);
	
	Если СведенияОТаможеннойДекларации <> Неопределено И СведенияОТаможеннойДекларации.Строки.Количество() > 0 Тогда
		
		НомерТаможеннойДекларации = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТаможеннойДекларации.Строки[0],
			Путь + ".НомерСтроки.СведенияОДекларации.НомерСтроки.НомерДекларации");
		
		КодСтраныПроисхождения = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТаможеннойДекларации.Строки[0],
			Путь + ".НомерСтроки.СведенияОДекларации.НомерСтроки.КодСтраны");
		
		Если ЗначениеЗаполнено(НомерТаможеннойДекларации) 
			И НомерТаможеннойДекларации <> "-" Тогда
			
			СтранаПроисхождения = Неопределено;
			ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект("СтраныМира", СтранаПроисхождения, КодСтраныПроисхождения);
			ПозицияТовара.ГТД = НайтиСоздатьГТДТовара(НомерТаможеннойДекларации, СтранаПроисхождения, ЭтоРНПТ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


// Возвращаемое значение:
//  Булево - Истина, если действуют правила заполнения с копейками
Функция ДействуютПравилаЗаполненияПоПроектуПостановления1137()
	
	Возврат ТекущаяУниверсальнаяДата() >= Дата(2025, 12, 31, 21, 0, 0);
	
КонецФункции

#КонецОбласти

#Область УПД_2019

#Область Отправка

Процедура ЗаполнитьДанныеДляУПДИнформацияПродавцаФНС_2019(Основание, СтруктураЭД, Данные, Отказ)
	
	ДокументСсылкаСЧФ = Основание;
	
	Если Не ЗначениеЗаполнено(ДокументСсылкаСЧФ) Тогда
		
		ТекстСообщения = НСтр("ru = 'Для формирования универсального передаточного документа счет-фактура должна быть заполнена.'");
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
	ДанныеДляФормированияЭД = Документы.СчетФактураВыданный.ДанныеДляУПДЭД(ДокументСсылкаСЧФ);
	ЗаполнитьДанныеПервичногоДокументаУПД_2019(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	ЗаполнитьДеревоДанныхУПД_2019(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	ЗаполнитьДанныеПлатежныхДокументов(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	ЗаполнитьИнформациюОТоварахТоваров_2019(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеДляСЧФИнформацияПродавцаФНС_2019(Основание, СтруктураЭД, Данные, Отказ)
	
	ДанныеДляФормированияЭД = Документы.СчетФактураВыданный.ДанныеДляУПДЭД(Основание);
	ЗаполнитьДеревоДанныхУПД_2019(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	ЗаполнитьДанныеПлатежныхДокументов(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	ЗаполнитьИнформациюОТоварахТоваров_2019(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_2019(Основание, СтруктураЭД, Данные, Отказ) Экспорт
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
		
		ДанныеДляФормированияЭД = ДайДанныеВозвратПоставщикуДляУПД(Основание);
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда 
		
		ДанныеДляФормированияЭД = ДайДанныеКорректировкиРеализацииИУслугДляУПД(Основание);
		
	Иначе
		
		ДанныеДляФормированияЭД = ДайДанныеРеализацииТоваровИУслугДляУПД(Основание);
		
	КонецЕсли;
	
	ДокументыОснования = Новый Массив;
	ДокументыОснования.Добавить(Основание);
	ДанныеДляФормированияЭД.Вставить("ДокументыОснования", ДокументыОснования);
	
	ЗаполнитьДанныеПервичногоДокументаУПД_2019(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	ЗаполнитьДеревоДанныхУПД_2019(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	ЗаполнитьДанныеПлатежныхДокументов(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	ЗаполнитьИнформациюОТоварахТоваров_2019(ДанныеДляФормированияЭД, СтруктураЭД, Данные);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПервичногоДокументаУПД_2019(ДанныеДляФормированияЭД, СтруктураЭД, ДеревоДанных)
	
	Шапка         = ДанныеДляФормированияЭД.Шапка;
	ВидОперацииЭД = ВидОперацииЭД(Шапка);
	СохранитьРеквизитВДереве(ДеревоДанных, "ВидОперации", ВидОперацииЭД);
	
	СодержаниеОперации = СодержаниеОперации(ДанныеДляФормированияЭД.Товары);
	СохранитьРеквизитВДереве(ДеревоДанных, "СодержаниеОперации", СодержаниеОперации);
	
	СохранитьРеквизитВДереве(ДеревоДанных, "ДатаОтгрузкиТоваров", Шапка.Дата);
	
	Если ЗначениеЗаполнено(Шапка.ДокументОснование) Тогда
		
		Если ТипЗнч(Шапка.Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			
			Если ДанныеДляФормированияЭД.Свойство("ДокументыОснования") Тогда
				СохранитьРеквизитВДереве(ДеревоДанных, "ДокументыОснованияДокументаОтгрузки", ДанныеДляФормированияЭД.ДокументыОснования);
			Иначе
				ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шапка.ДокументОснование, "ДокументОснование");
				Если ЗначениеЗаполнено(ДокументОснование) Тогда
					ДокументыОснованияДокументаОтгрузки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументОснование);
					СохранитьРеквизитВДереве(ДеревоДанных, "ДокументыОснованияДокументаОтгрузки", ДокументыОснованияДокументаОтгрузки);
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			ДокументыОснованияДокументаОтгрузки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Шапка.ДокументОснование);
			СохранитьРеквизитВДереве(ДеревоДанных, "ДокументыОснованияДокументаОтгрузки", ДокументыОснованияДокументаОтгрузки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ОснованиеОтгрузкиТоваров(Шапка),
		"ОснованиеОтгрузкиТоваров");
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ТранспортнаяНакладная(), "ТранспортнаяНакладная");
	
КонецПроцедуры

Функция ВидОперацииЭД(Шапка)
	
	Если Шапка.Исправление Тогда
		
		Возврат Перечисления.ВидыОперацийЭД.Исправление;
			
	КонецЕсли;
	
	Возврат Перечисления.ВидыОперацийЭД.ПродажаКомиссия;
	
КонецФункции

Функция СодержаниеОперации(Товары)
	
	ЕстьТовары = Ложь;
	ЕстьУслуги = Ложь;
	
	Для Каждого СтрокаТаблицы Из Товары Цикл
		
		Если СтрокаТаблицы.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
			
			ЕстьУслуги = Истина;
			
		Иначе
			
			ЕстьТовары = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СоставСодержания = Новый Массив;
	
	Если ЕстьТовары Тогда
		
		СоставСодержания.Добавить(НСтр("ru = 'Товары переданы.'"));
		
	КонецЕсли;
	
	Если ЕстьУслуги Тогда
		
		СоставСодержания.Добавить(НСтр("ru = 'Услуги оказаны в полном объеме.'"));
		
	КонецЕсли;
	
	Возврат СтрСоединить(СоставСодержания, " ");
	
КонецФункции

Функция ОснованиеОтгрузкиТоваров(Шапка)
	
	ОснованиеОтгрузкиТоваров = Новый ТаблицаЗначений;
	ОснованиеОтгрузкиТоваров.Колонки.Добавить("ДоговорКонтрагента");
	ОснованиеОтгрузкиТоваров.Колонки.Добавить("ДокументНаименование");
	ОснованиеОтгрузкиТоваров.Колонки.Добавить("ДокументНомер");
	ОснованиеОтгрузкиТоваров.Колонки.Добавить("ДокументДата");
	ОснованиеОтгрузкиТоваров.Колонки.Добавить("ДокументДопСведения");
	
	Если ЗначениеЗаполнено(Шапка.ДатаДоговора) Тогда
		НоваяСтрока = ОснованиеОтгрузкиТоваров.Добавить();
		НоваяСтрока.ДоговорКонтрагента   = Шапка.ДоговорКонтрагента;
		НоваяСтрока.ДокументНаименование = НСтр("ru = 'Договор'");
		НоваяСтрока.ДокументНомер        = Шапка.НомерДоговора;
		НоваяСтрока.ДокументДата         = НачалоДня(Шапка.ДатаДоговора);
		
		ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(НоваяСтрока, "ДокументДата",,,
				НСтр("ru = 'Необходимо указать дату договора.'"));
		//ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(
		//	НоваяСтрока,
		//	"ДокументДата",
		//	"ДоговорКонтрагента",
		//	"Объект.ДатаДоговора"
		//);
	КонецЕсли;
	
	Если ТипЗнч(Шапка.ДокументОснование) = Тип("ДокументСсылка.ВозвратПоставщику") И 
			ЗначениеЗаполнено(Шапка.ВхДокДата) И 
			ЗначениеЗаполнено(Шапка.ВхДокНомер) Тогда
		
		НоваяСтрока = ОснованиеОтгрузкиТоваров.Добавить();
		НоваяСтрока.ДокументНаименование = НСтр("ru = 'Входящий электронный документ'");
		НоваяСтрока.ДокументНомер = Шапка.ВхДокНомер;
		НоваяСтрока.ДокументДата  = НачалоДня(Шапка.ВхДокДата);
		
		ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(НоваяСтрока, "ДокументДата",,,
				НСтр("ru = 'Необходимо указать дату документа поступления.'"));
	КонецЕсли;
	
	Возврат ОснованиеОтгрузкиТоваров;
	
КонецФункции

Процедура ЗаполнитьОснованиеОтгрузкиТоваров_5_02(Шапка, ДеревоДанных)
	
	Путь = "СведенияОПередаче.Операция.ОснованиеОтгрузкиПередачи.";
	
	ТаблицаДокументовОснований = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(
		ДеревоДанных, Путь + "ДокументыОснования");
	ТаблицаДокументовОснований.Колонки.Добавить("ДоговорКонтрагента");
	
	Если ЗначениеЗаполнено(Шапка.ДатаДоговора) Тогда
		ДокументОснование = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(
		ДеревоДанных, Путь + "ДокументыОснования.НомерСтроки.ДокументОснование");
		ДокументОснование.НаименованиеДокумента = НСтр("ru = 'Договор'");
		ДокументОснование.НомерДокумента = Шапка.НомерДоговора;
		ДокументОснование.ДатаДокумента = НачалоДня(Шапка.ДатаДоговора);
		
		СтрокаДокументаОснования = ТаблицаДокументовОснований.Добавить();
		СтрокаДокументаОснования.ДокументОснование = ДокументОснование;
		СтрокаДокументаОснования.ДоговорКонтрагента = Шапка.ДоговорКонтрагента;
		
		// Дополним таблицу оснований параметрами обработки ошибок.
		ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаДокументаОснования, 
		"ДокументОснование.ДатаДокумента", Шапка.ДоговорКонтрагента,, НСтр("ru = 'Необходимо указать дату договора.'"));
		
		ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаДокументаОснования, 
		"ДокументОснование.НомерДокумента", Шапка.ДоговорКонтрагента,, НСтр("ru = 'Необходимо указать номер договора.'"));
		
	КонецЕсли;
	
	Если ТипЗнч(Шапка.ДокументОснование) = Тип("ДокументСсылка.ВозвратПоставщику") И 
			ЗначениеЗаполнено(Шапка.ВхДокДата) И 
			ЗначениеЗаполнено(Шапка.ВхДокНомер) Тогда
		
		ДокументОснование = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(
		ДеревоДанных, Путь + "ДокументыОснования.НомерСтроки.ДокументОснование");
		ДокументОснование.НаименованиеДокумента = НСтр("ru = 'Входящий электронный документ'");
		ДокументОснование.НомерДокумента = Шапка.ВхДокНомер;
		ДокументОснование.ДатаДокумента = НачалоДня(Шапка.ВхДокДата);
		
		СтрокаДокументаОснования = ТаблицаДокументовОснований.Добавить();
		СтрокаДокументаОснования.ДокументОснование = ДокументОснование;
		СтрокаДокументаОснования.ДоговорКонтрагента = Шапка.ДоговорКонтрагента;
		
		ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаДокументаОснования, 
		"ДокументОснование.ДатаДокумента",,, НСтр("ru = 'В возврате поставщику необходимо указать входящую дату документа поступления.'"));
		
		ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаДокументаОснования, 
		"ДокументОснование.НомерДокумента",,, НСтр("ru = 'В возврате поставщику необходимо указать входящий номер документа поступления.'"));
		
	КонецЕсли;
	
	Если ТаблицаДокументовОснований.Количество() = 0 Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
		Путь + "БезДокументаОснования", Истина);
	Иначе
		ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ТаблицаДокументовОснований,
		Путь + "ДокументыОснования");
	КонецЕсли;
	
КонецПроцедуры

Функция ТранспортнаяНакладная()
	
	ТранспортнаяНакладная = Новый ТаблицаЗначений;
	ТранспортнаяНакладная.Колонки.Добавить("ТранспортнаяНакладнаяНомер");
	ТранспортнаяНакладная.Колонки.Добавить("ТранспортнаяНакладнаяДата");
	Возврат ТранспортнаяНакладная;
	
КонецФункции

Функция ЗаполнитьДеревоДанныхУПД_2019(ДанныеДляФормированияЭД, СтруктураЭД, ДеревоДанных)
	
	Шапка = ДанныеДляФормированияЭД.Шапка;
	
	СохранитьРеквизитВДереве(ДеревоДанных, "ВидСчетаФактуры", "Реализация");
	
	// Сейчас пока всегда выставляем в значение 1. Так как остальные операции еще не реализованы
	// Для Функция = СЧФ:
	//  1 - счет-фактура, выставляемый при реализации товаров (работ, услуг), передаче имущественных прав;
	//  2 - счет-фактура, выставляемый при получении оплаты, частичной оплаты в счет предстоящих поставок
	//      товаров (выполнения работ, оказания услуг), передачи имущественных прав;
	//  3 - счет-фактура, применяемый в случае реализации комиссионером (агентом, экспедитором,
	//      застройщиком или заказчиком, выполняющим функции застройщика) двум и более покупателям
	//      (приобретения у двух и более продавцов) товаров (работ, услуг), имущественных прав от своего имени.
	//
	// Для Функция = СЧФДОП или Функция = ДОП:
	//  4 - Товары переданы от Комитента (Принципала) Комиссионеру (Агенту, действующему от собственного имени) для дальнейшей реализации;
	//  5 - Товары переданы от Комиссионера (Агента, действующего от собственного имени) Комитенту (Принципалу) при возврате товаров;
	//  6 - Товары переданы от Комиссионера (Агента, действующего от собственного имени) Комитенту (Принципалу) при закупке товара;
	//  7 - Товары переданы от Комитента (Принципала) Комиссионеру (Агенту, действующему от собственного имени) при возврате товаров;
	//  8 - Возврат товара от Покупателя Продавцу.
	СохранитьРеквизитВДереве(
		ДеревоДанных,
		"ДополнительныеСведенияОбУчастниках.ОбстоятельстваФормированияСФ",
		ОбстоятельстваФормированияСФ(Шапка));
	
	ВнестиСведенияОВыбытииМаркированныхТоваровВДеревоУПДУКД(ДеревоДанных, Шапка);
	
	СохранитьРеквизитВДереве(ДеревоДанных, "СсылкаСчетаФактуры", Шапка.Ссылка);
	
	Комитент = Неопределено;
	ДоговорСКомитентом = Неопределено;
	Если СтруктураЭД.Функция = "СвРК" ИЛИ СтруктураЭД.Функция = "СвЗК" Тогда
		Комитент = СтруктураЭД.Получатель;
		ДоговорСКомитентом = СтруктураЭД.Договор;
	КонецЕсли;
	
	НомерДокумента = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(Шапка);
	Если СтруктураЭД.Функция = "СЧФ" ИЛИ СтруктураЭД.Функция = "СЧФДОП" Тогда
		НомерДокумента = УправлениеПечатьюПлатформа.ДополнитьНомерСчетФактурыИндексомОбособленногоПодразделения(НомерДокумента, Шапка.Ссылка);
	КонецЕсли;
	
	СохранитьРеквизитВДереве(ДеревоДанных, "НомерДокумента", НомерДокумента);
	СохранитьРеквизитВДереве(ДеревоДанных, "ДатаДокумента",  Шапка.Дата);
	
	Если Шапка.Исправление Тогда
		
		СохранитьРеквизитВДереве(ДеревоДанных, "НомерИсправления", Шапка.НомерИсправления);
		СохранитьРеквизитВДереве(ДеревоДанных, "ДатаИсправления", Шапка.ДатаИсправления);
		
	КонецЕсли;
	
	СведенияОПродавце = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Шапка.Поставщик, СведенияОПродавце);
	
	ДанныеПродавца = ПодготовитьДанныеУчастникаУПД(СведенияОПродавце,, Шапка.Подразделение);
	
	СведенияОПродавцах = ДеревоЭлектронногоДокументаБЭД.ДанныеДерева(ДеревоДанных, "СведенияОПродавце");
	СведенияОПродавцах.Очистить();
	СведенияОПродавцах.Колонки.Добавить("СведенияОбУчастнике");
	ЗаполнитьЗначенияСвойств(СведенияОПродавцах.Добавить(), ДанныеПродавца);
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, СведенияОПродавцах, "СведенияОПродавце");
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"СоставительДокументаНаименование",
		СведенияОПродавце.ПолноеНаименование
	);
	
	СведенияОПокупателе = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Шапка.Покупатель, СведенияОПокупателе);
	ДанныеПокупателя = ПодготовитьДанныеУчастникаУПД(СведенияОПокупателе);
	
	СведенияОПокупателях = ДеревоЭлектронногоДокументаБЭД.ДанныеДерева(ДеревоДанных, "СведенияОПокупателе");
	СведенияОПокупателях.Очистить();
	СведенияОПокупателях.Колонки.Добавить("СведенияОбУчастнике");
	ЗаполнитьЗначенияСвойств(СведенияОПокупателях.Добавить(), ДанныеПокупателя);
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, СведенияОПокупателях, "СведенияОПокупателе");
	
	СведенияОГрузоотправителях = ДеревоЭлектронногоДокументаБЭД.ДанныеДерева(ДеревоДанных, "СведенияОГрузоотправителе");
	СведенияОГрузоотправителях.Очистить();
	СведенияОГрузоотправителях.Колонки.Добавить("СведенияОбУчастнике");
	
	ДокументОснованияАктУслуг = (
	(ЗначениеЗаполнено(ДанныеДляФормированияЭД.Шапка.ДокументОснование) 
			И ДанныеДляФормированияЭД.Шапка.ДокументОснование.ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг)
	);
				
	Если СтруктураЭД.ТипДокумента <> Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот
		И НЕ ДокументОснованияАктУслуг Тогда
		
		Если Шапка.Свойство("Грузоотправитель") И ЗначениеЗаполнено(Шапка.Грузоотправитель) Тогда
			
			СведенияОГрузоотправителе = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();;
			ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Шапка.Грузоотправитель, СведенияОГрузоотправителе);
			ДанныеГрузотправителя = ПодготовитьДанныеУчастникаУПД(СведенияОГрузоотправителе, "Факт");
			СтрокаГрузоотправителя = СведенияОГрузоотправителях.Добавить();
			СтрокаГрузоотправителя.Грузоотправитель = ДанныеГрузотправителя;
			СтрокаГрузоотправителя.СведенияОбУчастнике = СведенияОГрузоотправителе;
			
		Иначе
			
			СведенияОГрузоотправителях.Добавить().ОнЖе = Истина;
			
		КонецЕсли;
		
		ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, СведенияОГрузоотправителях,
			"СведенияОГрузоотправителе");
		
		СведенияОГрузополучателях = ДеревоЭлектронногоДокументаБЭД.ДанныеДерева(ДеревоДанных, "СведенияОГрузополучателе");
		СведенияОГрузополучателях.Очистить();
		СведенияОГрузополучателях.Колонки.Добавить("СведенияОбУчастнике");
		
		СведенияОГрузополучателе = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
		
		Если Шапка.Свойство("Грузополучатель") И ЗначениеЗаполнено(Шапка.Грузополучатель) Тогда
			
			
			ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Шапка.Грузополучатель, СведенияОГрузополучателе);
			
		Иначе
			
			ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Шапка.Покупатель, СведенияОГрузополучателе);
			
		КонецЕсли;
		
		ДанныеГрузополучателя = ПодготовитьДанныеУчастникаУПД(СведенияОГрузополучателе, "Факт");
		ЗаполнитьЗначенияСвойств(СведенияОГрузополучателях.Добавить(), ДанныеГрузополучателя);
		ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, СведенияОГрузополучателях,
			"СведенияОГрузополучателе");
		
	КонецЕсли;

	СохранитьРеквизитВДереве(ДеревоДанных, "ВалютаКод", Шапка.КодВалюты);
	СохранитьРеквизитВДереве(ДеревоДанных, "ДополнительныеСведенияОбУчастниках.ВалютаНаименование",
		Шапка.НаименованиеПолноеВалюты);
	СохранитьРеквизитВДереве(ДеревоДанных, "ДополнительныеСведенияОбУчастниках.ВалютаКурс", Шапка.Курс);
	
	ДокументыОснования = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ДанныеДляФормированияЭД.ДокументыОснования);
	СохранитьРеквизитВДереве(ДеревоДанных, "ДокументыОснованияСчетаФактуры", ДокументыОснования);
	
	СохранитьРеквизитВДереве(ДеревоДанных, "ДополнительныеСведенияОбУчастниках.ИдентификаторГосКонтракта",
		Шапка.ИдентификаторГосударственногоКонтракта);	
	
	ДокументыПодтвержденияОтгрузки = ДайДокументыПодтвержденияОтгрузки(Шапка, СтруктураЭД);
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ДокументыПодтвержденияОтгрузки,
		"ДокументыПодтвержденияОтгрузки");
	
	// Сделать обновление на новую версию БЭД
	Если ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, "ДокументОбОтгрузке") Тогда
		
		ПредставлениеСтроки5а = "";
		Если СтруктураЭД.Функция = "СЧФ" Тогда
			Если Шапка.Свойство("ДокументОбОтгрузке")
				И ЗначениеЗаполнено(Шапка.ДокументОбОтгрузке) Тогда
				
				ПредставлениеСтроки5а = Шапка.ДокументОбОтгрузке;
				
			КонецЕсли;
		Иначе
			
			ПредставлениеСтроки5а = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Универсальный передаточный документ № %1 от %2'"),
			НомерДокумента,
			Формат(Шапка.Дата, "ДЛФ=ДД"));
			
		КонецЕсли;
		
		СохранитьРеквизитВДереве(ДеревоДанных, "ДокументОбОтгрузке", ПредставлениеСтроки5а);
		
	КонецЕсли;
	
	Возврат ДеревоДанных;
	
КонецФункции

Процедура ВнестиСведенияОВыбытииМаркированныхТоваровВДеревоУПДУКД(ДеревоДанных, Шапка)
	
	ВариантВыбытияМаркируемойПродукции = ПолучитьЗначениеПараметраСтруктуры(Шапка, "ПричинаОтгрузкиМаркируемойПродукции", Неопределено);
	
	Если НЕ ЗначениеЗаполнено(ВариантВыбытияМаркируемойПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВариантВыбытияМаркируемойПродукции = Перечисления.ПричиныОтгрузкиТоваров.ИспользованиеДляСобственныхНуждПокупателем Тогда
		СведенияОВыбытииМаркированныхТоваров = "1";
	ИначеЕсли ВариантВыбытияМаркируемойПродукции = Перечисления.ПричиныОтгрузкиТоваров.БезВозмезднаяПередача Тогда
		СведенияОВыбытииМаркированныхТоваров = "2";
	ИначеЕсли ВариантВыбытияМаркируемойПродукции = Перечисления.ПричиныОтгрузкиТоваров.ИспользованиеДляПроизводственныхЦелей Тогда
		СведенияОВыбытииМаркированныхТоваров = "3";
	ИначеЕсли ВариантВыбытияМаркируемойПродукции = Перечисления.ПричиныОтгрузкиТоваров.ПриобретениеГосПредприятием Тогда
		СведенияОВыбытииМаркированныхТоваров = "4";
	Иначе
		Возврат;
	КонецЕсли;
	
	ОписаниеПоляСведенийОВыбытииМТ = ФорматыЭДО_ФНС.ОписаниеПоляСведенийОВыбытииМаркированныхТоваров();
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных,
		ОписаниеПоляСведенийОВыбытииМТ.ИмяРеквизита,
		СведенияОВыбытииМаркированныхТоваров
	);
	
КонецПроцедуры

Функция ПодготовитьДанныеУчастникаУПД(Знач СведенияОбУчастнике, ВидАдреса = "Юр", Подразделение = Неопределено,
	ЭтоЭлектронноеАктированиеЕИС = Ложь, ВерсияФормата = "", ПриоритетыВидовКонтактнойИнформации = Неопределено) Экспорт
	
	КлючДанных = Неопределено;
	СведенияОбУчастнике.Свойство("Ссылка", КлючДанных);
	
	Данные = Новый Структура("СведенияОбУчастнике", СведенияОбУчастнике);
	
	Данные.Вставить("ТипУчастника", Новый Структура);
	
	ПоддерживаемыеФорматы = ФорматыЭДО_ФНС.ПоддерживаемыеФорматы();
	
	Если
		СведенияОбУчастнике.ЮрФизЛицо = Перечисления.ФормыСобственности.ЮридическоеЛицо
	Тогда
		
		Данные.ТипУчастника.Вставить("ЮЛ", Новый Структура);
		Данные.ТипУчастника.ЮЛ.Вставить("НаименованиеОрганизации", СведенияОбУчастнике.ПолноеНаименование);
		Данные.ТипУчастника.ЮЛ.Вставить("ИНН", СведенияОбУчастнике.ИНН);
		Данные.ТипУчастника.ЮЛ.Вставить("КПП", СведенияОбУчастнике.КПП);
		
	ИначеЕсли СведенияОбУчастнике.ЮрФизЛицо = Перечисления.ФормыСобственности.ЮридическоеЛицоНеРезидент Тогда
		
		Данные.ТипУчастника.Вставить("ИЛ", Новый Структура);
		Данные.ТипУчастника.ИЛ.Вставить("НаименованиеОрганизации", СведенияОбУчастнике.ПолноеНаименование);
		
		Если ВерсияФормата = ПоддерживаемыеФорматы.УПД_5_02.ИнформацияПродавца Тогда
			Статусы = Новый Структура;
			Статусы.Вставить("Организация", "ИО");
			Статусы.Вставить("Гражданин", "ИГ");
			Данные.ТипУчастника.ИЛ.Вставить("Статус", Статусы.Организация);
			
			Если ЗначениеЗаполнено(СведенияОбУчастнике.ЮридическийАдресXML) Тогда
				СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(СведенияОбУчастнике.ЮридическийАдресXML);
				Данные.ТипУчастника.ИЛ.Вставить("КодСтраны", СведенияОбАдресе.КодСтран);
				Данные.ТипУчастника.ИЛ.Вставить("НаименованиеСтраны", СведенияОбАдресе.Страна);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли СведенияОбУчастнике.ЮрФизЛицо = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
	
		Данные.ТипУчастника.Вставить("ФЛ", Новый Структура);
		Данные.ТипУчастника.ФЛ.Вставить("ИНН", СведенияОбУчастнике.ИНН);
		Данные.ТипУчастника.ФЛ.Вставить("Фамилия", СведенияОбУчастнике.Фамилия);
		Данные.ТипУчастника.ФЛ.Вставить("Имя", СведенияОбУчастнике.Имя);
		Данные.ТипУчастника.ФЛ.Вставить("Отчество", СведенияОбУчастнике.Отчество);
		
		Если ВерсияФормата = ПоддерживаемыеФорматы.УПД_5_02.ИнформацияПродавца Тогда
			Данные.ТипУчастника.ФЛ.Вставить("ФИО", Новый Структура("Фамилия, Имя, Отчество"));
			ЗаполнитьЗначенияСвойств(Данные.ТипУчастника.ФЛ.ФИО, Данные.ТипУчастника.ФЛ);
		КонецЕсли;
		
	Иначе
		
		Данные.ТипУчастника.Вставить("ИП", Новый Структура);
		Данные.ТипУчастника.ИП.Вставить("ИНН", СведенияОбУчастнике.ИНН);
		Данные.ТипУчастника.ИП.Вставить("Фамилия", СведенияОбУчастнике.Фамилия);
		Данные.ТипУчастника.ИП.Вставить("Имя", СведенияОбУчастнике.Имя);
		Данные.ТипУчастника.ИП.Вставить("Отчество", СведенияОбУчастнике.Отчество);
		
		Если ТипЗнч(СведенияОбУчастнике.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
			
			Свидетельство = СтрШаблон(НСтр("ru = 'Свидетельство №%1 от %2'"),
				СведенияОбУчастнике.СвидетельствоСерияНомер,
				Формат(СведенияОбУчастнике.СвидетельствоДатаВыдачи, "ДЛФ=D"));
				
			Данные.ТипУчастника.ИП.Вставить("СвидетельствоОГосРегистрации", Свидетельство);
			Данные.ТипУчастника.ИП.Вставить("Отчество", СведенияОбУчастнике.Отчество);
			
			Данные.ТипУчастника.ИП.Вставить("ОГРН", СведенияОбУчастнике.ОГРН);
			Данные.ТипУчастника.ИП.Вставить("ДатаОГРН", СведенияОбУчастнике.ДатаОГРН);
			
		КонецЕсли;
		
		Если ВерсияФормата = ПоддерживаемыеФорматы.УПД_5_02.ИнформацияПродавца Тогда
			Данные.ТипУчастника.ИП.Вставить("ФИО", Новый Структура("Фамилия, Имя, Отчество"));
			ЗаполнитьЗначенияСвойств(Данные.ТипУчастника.ИП.ФИО, Данные.ТипУчастника.ИП);
		КонецЕсли;
		
	КонецЕсли;
	
	//Данные.Вставить("Адрес", Новый Структура);
	//СведенияОбУчастнике.Вставить("ДатаКИ", Неопределено);
	//Если Подразделение <> Неопределено Тогда
	//	СведенияОбУчастнике.Вставить("Подразделение", Подразделение);
	//	ПолучитьАдресСтруктурой_2019(Данные.Адрес, СведенияОбУчастнике, "Подразделение", ВидАдреса,, ВерсияФормата);
	//	СведенияОбУчастнике.Удалить("Подразделение");
	//Иначе
	//	ПолучитьАдресСтруктурой_2019(Данные.Адрес, СведенияОбУчастнике, "Ссылка", ВидАдреса,, ВерсияФормата);
	//КонецЕсли;
	//СведенияОбУчастнике.Удалить("ДатаКИ");
	
	ЭтоСведенияОбОрганизации = (НЕ ТипЗнч(КлючДанных) = Тип("СправочникСсылка.Контрагенты"));
	
	ДанныеАдреса = ДанныеАдресаУчастникаУПД(СведенияОбУчастнике, ПриоритетыВидовКонтактнойИнформации,
		ЭтоСведенияОбОрганизации, ВерсияФормата);
	Если ЗначениеЗаполнено(ДанныеАдреса) Тогда
		Данные.Вставить("Адрес", ДанныеАдреса);
	КонецЕсли;
	
	Данные.Вставить("КонтактныеСведения", Новый Структура);
	
	Телефон = "";
	Если СведенияОбУчастнике.Свойство("Телефоны", Телефон) И ЗначениеЗаполнено(Телефон) Тогда
		
		Данные.КонтактныеСведения.Вставить("Телефон", Телефон);
		
		Если ВерсияФормата = ПоддерживаемыеФорматы.УПД_5_02.ИнформацияПродавца Тогда
			Телефоны = Новый ТаблицаЗначений;
			Телефоны.Колонки.Добавить("Телефон");
			НоваяСтрока = Телефоны.Добавить();
			НоваяСтрока.Телефон = Телефон;
			Данные.КонтактныеСведения.Вставить("Телефоны", Телефоны);
		КонецЕсли;
		
	КонецЕсли;
	
	ЭлектроннаяПочта = "";
	Если СведенияОбУчастнике.Свойство("ЭлектроннаяПочта", ЭлектроннаяПочта) И ЗначениеЗаполнено(ЭлектроннаяПочта) Тогда
		
		Данные.КонтактныеСведения.Вставить("ЭлектроннаяПочта", ЭлектроннаяПочта);
		
		Если ВерсияФормата = ПоддерживаемыеФорматы.УПД_5_02.ИнформацияПродавца Тогда
			ЭлектронныеПочты = Новый ТаблицаЗначений;
			ЭлектронныеПочты.Колонки.Добавить("ЭлектроннаяПочта");
			НоваяСтрока = ЭлектронныеПочты.Добавить();
			НоваяСтрока.ЭлектроннаяПочта = ЭлектроннаяПочта;
			Данные.КонтактныеСведения.Вставить("ЭлектронныеПочты", ЭлектронныеПочты);
		КонецЕсли;
		
	КонецЕсли;
	
	Данные.Вставить("БанковскиеРеквизиты", Новый Структура);
	
	НомерСчета = "";
	Если СведенияОбУчастнике.Свойство("НомерСчета", НомерСчета) И ЗначениеЗаполнено(НомерСчета) Тогда
		
		Данные.БанковскиеРеквизиты.Вставить("НомерСчета", НомерСчета);
		
		Банк = "";
		БИК = "";
		КоррСчет = "";
		
		Если СведенияОбУчастнике.Свойство("Банк", Банк) И ЗначениеЗаполнено(Банк) Тогда
			
			Данные.БанковскиеРеквизиты.Вставить("НаименованиеБанка", Банк);
			
		КонецЕсли;
		Если СведенияОбУчастнике.Свойство("БИК", БИК) И ЗначениеЗаполнено(БИК) Тогда
			
			Данные.БанковскиеРеквизиты.Вставить("БИКБанка", БИК);
			
		КонецЕсли;
		Если СведенияОбУчастнике.Свойство("КоррСчет", КоррСчет) И ЗначениеЗаполнено(КоррСчет) Тогда
			
			Данные.БанковскиеРеквизиты.Вставить("КорреспондентскийСчетБанка", КоррСчет);
			
		КонецЕсли;
	КонецЕсли;
	
	КодПоОКПО = "";
	Если СведенияОбУчастнике.Свойство("КодПоОКПО", КодПоОКПО) И ЗначениеЗаполнено(КодПоОКПО) Тогда
		
		Данные.Вставить("КодОКПО", КодПоОКПО);
		
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Процедура ПолучитьАдресСтруктурой_2019(СтруктураАдреса,
                                       СтруктураПараметров,
                                       ВидКонтрагента = "Контрагент",
                                       ВидАдреса = "Юр",
                                       ТекстОшибки = "",
                                       ВерсияФормата = "")
	
	ПоддерживаемыеФорматы = ФорматыЭДО_ФНС.ПоддерживаемыеФорматы();
	
	Если СтруктураПараметров.Свойство("ПроизвольныйАдрес") Тогда
		СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(СтруктураПараметров.ПроизвольныйАдрес);
		
		Если ВерсияФормата = ПоддерживаемыеФорматы.УПД_5_02.ИнформацияПродавца Тогда
			АдресИнформация = Новый Структура();
			АдресИнформация.Вставить("КодСтраны", СведенияОбАдресе.КодСтраны);
			АдресИнформация.Вставить("НаименованиеСтраны", СведенияОбАдресе.Страна);
			АдресИнформация.Вставить("АдресТекст", СведенияОбАдресе.Представление);
			СтруктураАдреса.Вставить("ТипАдреса", Новый Структура("АдресИнформация", АдресИнформация));
		Иначе
			СтруктураАдреса.Вставить("АдресИнформация", Новый Структура);
			СтруктураАдреса.АдресИнформация.Вставить("КодСтраны", СведенияОбАдресе.КодСтраны);
			СтруктураАдреса.АдресИнформация.Вставить("АдресТекст", СведенияОбАдресе.Представление);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	Адрес = ПолучитьКонтактнуюИнформацию(СтруктураПараметров[ВидКонтрагента], , ВидАдреса, СтруктураПараметров.ДатаКИ);
	Параметр1 = СтруктураПараметров[ВидКонтрагента];
	Параметр2 = ?(ВидАдреса = "Юр", НСтр("ru = 'юридический'"), НСтр("ru = 'фактический'"));
	
	Если НЕ ЗначениеЗаполнено(Адрес.Представление) Тогда
		
		Ошибка = НСтр("ru = 'Для %1 необходимо указать %2 адрес.'");
		ТекстОшибки = ТекстОшибки
			+ Символы.ПС
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Ошибка, Параметр1, Параметр2);
		Возврат;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Адрес.ЗначенияПолей) Тогда
		
		Ошибка = НСтр("ru = 'Для %1 необходимо заполнить %2 адрес по классификатору.'");
		ТекстОшибки = ТекстОшибки
			+ Символы.ПС
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Ошибка, Параметр1, Параметр2); 
		Возврат;
	
	Иначе
		
		ТекстОшибки = "";
	
	КонецЕсли;
	
	СтруктураРезультата = Новый Структура(
		"КодСтраны,
		|Страна,
		|Индекс,
		|Регион,
		|КодРегиона,
		|Район,
		|Город,
		|НаселенныйПункт,
		|Улица,
		|Дом,
		|Корпус,
		|Квартира"
	);
	ДанныеАдреса = РаботаСАдресами.СведенияОбАдресе(Адрес.ЗначенияПолей);
	ЗаполнитьЗначенияСвойств(СтруктураРезультата, ДанныеАдреса);
	
	// Дополним адрес
	Если ДанныеАдреса.Свойство("Здание")
		И ДанныеАдреса.Здание.Свойство("Номер") Тогда
		
		СтруктураРезультата.Дом = ДанныеАдреса.Здание.Номер;
		
	КонецЕсли;
	
	// Корпус
	Если ДанныеАдреса.Свойство("Корпуса")
		И ДанныеАдреса.Корпуса.Количество() > 0 Тогда
		
		СтруктураРезультата.Корпус = ДанныеАдреса.Корпуса[0].Номер;
		
	КонецЕсли;
	
	// Помещения
	Если ДанныеАдреса.Свойство("Помещения")
		И ДанныеАдреса.Помещения.Количество() > 0 Тогда
		
		СтруктураРезультата.Квартира = ДанныеАдреса.Помещения[0].Номер;
		
	КонецЕсли;
	
	РезультатПроверки = РаботаСАдресами.ПроверитьАдрес(Адрес.ЗначенияПолей, Адрес.Вид);
	
	АдресРФ = РезультатПроверки.Результат <> "СодержитОшибки"
		И СтрСравнить(СтруктураРезультата.КодСтраны, Справочники.СтраныМира.Россия.Код) = 0
		И ЗначениеЗаполнено(СтруктураРезультата.КодРегиона);
	
	Если АдресРФ Тогда
		
		АдресРФПоля = Новый Структура;
		АдресРФПоля.Вставить("Индекс");
		АдресРФПоля.Вставить("КодРегиона");
		АдресРФПоля.Вставить("Район");
		АдресРФПоля.Вставить("Город");
		АдресРФПоля.Вставить("НаселенныйПункт");
		АдресРФПоля.Вставить("Улица");
		АдресРФПоля.Вставить("Дом");
		АдресРФПоля.Вставить("Корпус");
		АдресРФПоля.Вставить("Квартира");
		ЗаполнитьЗначенияСвойств(АдресРФПоля, СтруктураРезультата);
		СтруктураАдреса.Вставить("АдресРФ", АдресРФПоля);
		
	Иначе
		
		Если ВерсияФормата = ПоддерживаемыеФорматы.УПД_5_02.ИнформацияПродавца Тогда
			АдресИнформацияПоля = Новый Структура();
			АдресИнформацияПоля.Вставить("КодСтраны", СтруктураРезультата.КодСтраны);
			АдресИнформацияПоля.Вставить("НаименованиеСтраны", СтруктураРезультата.Страна);
			АдресИнформацияПоля.Вставить("АдресТекст", Адрес.Представление);
			ДанныеАдреса.Вставить("ТипАдреса", Новый Структура("АдресИнформация", АдресИнформация));
		Иначе
			АдресИнформацияПоля = Новый Структура();
			АдресИнформацияПоля.Вставить("КодСтраны", СтруктураРезультата.КодСтраны);
			АдресИнформацияПоля.Вставить("АдресТекст", Адрес.Представление);
			СтруктураАдреса.Вставить("АдресИнформация", АдресИнформацияПоля);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеАдресаУчастникаУПД(СведенияОбУчастнике, ПриоритетыВидовКонтактнойИнформации, ЭтоСведенияОбОрганизации, ВерсияФормата = "")
	
	ДанныеАдреса = Новый Структура;
	ПоддерживаемыеФорматы = ФорматыЭДО_ФНС.ПоддерживаемыеФорматы();
	
	Если СведенияОбУчастнике.Свойство("ПроизвольныйАдрес") Тогда
		СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(СведенияОбУчастнике.ПроизвольныйАдрес);
		
		Если ВерсияФормата = ПоддерживаемыеФорматы.УПД_5_02.ИнформацияПродавца Тогда
			АдресИнформация = Новый Структура();
			АдресИнформация.Вставить("КодСтраны", СведенияОбАдресе.КодСтраны);
			АдресИнформация.Вставить("НаименованиеСтраны", СведенияОбАдресе.Страна);
			АдресИнформация.Вставить("АдресТекст", СведенияОбАдресе.Представление);
			ДанныеАдреса.Вставить("ТипАдреса", Новый Структура("АдресИнформация", АдресИнформация));
		Иначе
			ДанныеАдреса.Вставить("АдресИнформация", Новый Структура);
			ДанныеАдреса.АдресИнформация.Вставить("КодСтраны", СведенияОбАдресе.КодСтраны);
			ДанныеАдреса.АдресИнформация.Вставить("АдресТекст", СведенияОбАдресе.Представление);
		КонецЕсли;
		
		Возврат ДанныеАдреса;
	КонецЕсли;
	
	Если ТипЗнч(СведенияОбУчастнике.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
	ИначеЕсли ТипЗнч(СведенияОбУчастнике.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
	ИначеЕсли ТипЗнч(СведенияОбУчастнике.Ссылка) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактАдресПодразделенияКомпании;
	Иначе
		ВидКонтактнойИнформации = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПриоритетыВидовКонтактнойИнформации) Тогда
		
		Для Каждого ВикКИ Из ПриоритетыВидовКонтактнойИнформации Цикл
			
			Если ЗначениеЗаполнено(СведенияОбУчастнике[ВикКИ]) И ВикКИ = "ПочтовыйАдрес" Тогда
				
				Если ТипЗнч(СведенияОбУчастнике.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
					ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации;
				ИначеЕсли ТипЗнч(СведенияОбУчастнике.Ссылка) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
					ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресПодразделенияКомпании;
				Иначе
					ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента;
				КонецЕсли;
				
				Прервать;
				
			ИначеЕсли ЗначениеЗаполнено(СведенияОбУчастнике[ВикКИ]) И ВикКИ = "ФактическийАдрес" Тогда
				
				Если ТипЗнч(СведенияОбУчастнике.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
					ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
				ИначеЕсли ТипЗнч(СведенияОбУчастнике.Ссылка) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
					ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактАдресПодразделенияКомпании;
				Иначе
					ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
				КонецЕсли;
				
				Прервать;
				
			ИначеЕсли ЗначениеЗаполнено(СведенияОбУчастнике[ВикКИ]) И ВикКИ = "ЮридическийАдрес" Тогда
				
				Если ТипЗнч(СведенияОбУчастнике.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
					ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
				ИначеЕсли ТипЗнч(СведенияОбУчастнике.Ссылка) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
					ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ЮрАдресПодразделенияКомпании;
				Иначе
					ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
				КонецЕсли;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 
	
	КлючДанных = Неопределено;
	СведенияОбУчастнике.Свойство("Ссылка", КлючДанных);
	ДанныеАдреса.Вставить("АвтоматическиЗаполняемый", Новый Структура);
	ДанныеАдреса.АвтоматическиЗаполняемый.Вставить("ОбъектКонтактнойИнформации", КлючДанных);
	ДанныеАдреса.АвтоматическиЗаполняемый.Вставить("ВидКонтактнойИнформации", ВидКонтактнойИнформации);
	
	Если ВерсияФормата = ПоддерживаемыеФорматы.УПД_5_02.ИнформацияПродавца Тогда
		ДанныеАдреса.Вставить("ТипАдреса", Новый Структура);
		ДанныеАдреса.ТипАдреса.Вставить("АвтоматическиЗаполняемый", ДанныеАдреса.АвтоматическиЗаполняемый);
	КонецЕсли;
	
	Возврат ДанныеАдреса;
	
КонецФункции

Функция ПолучитьКонтактнуюИнформацию(Владелец, ТипКИ = "Адрес", ТипАдреса = "Юр", ДатаКИ = Неопределено)
	
	Если ДатаКИ = Неопределено Тогда
		ДатаКИ = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Владелец = Неопределено Тогда
		КонтактнаяИнформация = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация();
		Результат = Новый Структура;
		Для Каждого Колонка Из КонтактнаяИнформация.Колонки Цикл
			Результат.Вставить(Колонка.Имя);
		КонецЦикла;
		
		Возврат Результат;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.МенеджерОбъектаПоСсылке(Владелец)
		.КонтактнаяИнформацияДляЭДО(Владелец, ТипКИ, ТипАдреса, ДатаКИ);
	
КонецФункции

Функция ДайДокументыПодтвержденияОтгрузки(Шапка, СтруктураЭД)
	
	ДокументыПодтвержденияОтгрузки = Новый ТаблицаЗначений;
	ДокументыПодтвержденияОтгрузки.Колонки.Добавить("Наименование");
	ДокументыПодтвержденияОтгрузки.Колонки.Добавить("Номер");
	ДокументыПодтвержденияОтгрузки.Колонки.Добавить("Дата");
	
	Если НЕ (Шапка.Свойство("ДокументОбОтгрузке") И ЗначениеЗаполнено(Шапка.ДокументОбОтгрузке)) Тогда
		
		Возврат ДокументыПодтвержденияОтгрузки;
		
	КонецЕсли;
	
	Если СтруктураЭД.Функция = "СЧФ" Тогда
		СтрокаДокументыПодтвержденияОтгрузки = ДокументыПодтвержденияОтгрузки.Добавить();
		СтрокаДокументыПодтвержденияОтгрузки.Номер        = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(Шапка.ДокументОснование);
		СтрокаДокументыПодтвержденияОтгрузки.Дата         = Шапка.ДокументОснованиеДата;
		СтрокаДокументыПодтвержденияОтгрузки.Наименование = Шапка.ДокументОбОтгрузке;
	Иначе
		СтрокаДокументыПодтвержденияОтгрузки = ДокументыПодтвержденияОтгрузки.Добавить();
		СтрокаДокументыПодтвержденияОтгрузки.Номер        = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(Шапка);
		СтрокаДокументыПодтвержденияОтгрузки.Дата         = Шапка.Дата;
		СтрокаДокументыПодтвержденияОтгрузки.Наименование = НСтр("ru = 'Универсальный передаточный документ'");
	КонецЕсли;
	
	Возврат ДокументыПодтвержденияОтгрузки;
	
КонецФункции

Процедура ЗаполнитьДанныеПлатежныхДокументов(ДанныеДляФормированияЭД, Настройки, ДеревоДанных)
	
	Если
		Не ДанныеДляФормированияЭД.Свойство("ПлатежныеДокументы")
		Или ДанныеДляФормированияЭД.ПлатежныеДокументы.Количество() = 0
	Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПРДКОтправке = Новый ТаблицаЗначений;
	ПРДКОтправке.Колонки.Добавить("НомерСтроки");
	ПРДКОтправке.Колонки.Добавить("Номер");
	ПРДКОтправке.Колонки.Добавить("Дата");
	ПРДКОтправке.Колонки.Добавить("Сумма");
	
	Для Каждого ТекущаяСтрока Из ДанныеДляФормированияЭД.ПлатежныеДокументы Цикл
		НоваяСтрока = ПРДКОтправке.Добавить();
		НоваяСтрока.НомерСтроки = ТекущаяСтрока.НомерСтроки;
		НоваяСтрока.Номер = ТекущаяСтрока.НомерПРД;
		НоваяСтрока.Дата  = ТекущаяСтрока.ДатаПРД;
		НоваяСтрока.Сумма = 0;
	КонецЦикла;
	
	// Дополним таблицу платежных документов параметрами обработки ошибок.
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ПРДКОтправке,
		"Номер", ДанныеДляФормированияЭД.Шапка.Ссылка, "Объект.ПлатежноРасчетныеДокументы.Номер",, "НомерСтроки");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ПРДКОтправке,
		"Дата", ДанныеДляФормированияЭД.Шапка.Ссылка, "Объект.ПлатежноРасчетныеДокументы.Дата",, "НомерСтроки");
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ПРДКОтправке, "СведенияОСчетеФактуре.СведенияОПлатежноРасчетныхДокументах");
	
КонецПроцедуры

Процедура ЗаполнитьДанныеАвансовыхСчетовФактур(ДанныеДляФормированияЭД, Настройки, ДеревоДанных)
	
	Если
		Не ДанныеДляФормированияЭД.Свойство("АвансовыеСчетаФактуры")
		Или ДанныеДляФормированияЭД.АвансовыеСчетаФактуры.Количество() = 0
	Тогда
		
		Возврат;
		
	КонецЕсли;
	
	АвансовыеСчетаФактуры = Новый ТаблицаЗначений();
	АвансовыеСчетаФактуры.Колонки.Добавить("НомерСтроки");
	АвансовыеСчетаФактуры.Колонки.Добавить("НомерДокумента");
	АвансовыеСчетаФактуры.Колонки.Добавить("ДатаДокумента");
	АвансовыеСчетаФактуры.Колонки.Добавить("НомерИсправительногоДокумента");
	АвансовыеСчетаФактуры.Колонки.Добавить("ДатаИсправительногоДокумента");
	
	Для Каждого ТекущаяСтрока Из ДанныеДляФормированияЭД.АвансовыеСчетаФактуры Цикл
		НоваяСтрока = АвансовыеСчетаФактуры.Добавить();
		НоваяСтрока.НомерСтроки = ТекущаяСтрока.НомерСтроки;
		НоваяСтрока.НомерДокумента = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(Новый Структура("Номер", ТекущаяСтрока.Номер));
		НоваяСтрока.ДатаДокумента = ТекущаяСтрока.Дата;
		НоваяСтрока.НомерИсправительногоДокумента = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(Новый Структура("Номер", ТекущаяСтрока.НомерИсправления));
		НоваяСтрока.ДатаИсправительногоДокумента = ТекущаяСтрока.ДатаИсправления;
	КонецЦикла;
	
	// Дополним таблицу авансовых счетов-фактур параметрами обработки ошибок.
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(АвансовыеСчетаФактуры,
		"Номер", ДанныеДляФормированияЭД.Шапка.Ссылка, "Объект.СведенияОВыданныхСчетахФактурахНаАванс.НомерАвансовойСчетФактуры",,
		"НомерСтроки");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(АвансовыеСчетаФактуры,
		"Дата", ДанныеДляФормированияЭД.Шапка.Ссылка, "Объект.СведенияОВыданныхСчетахФактурахНаАванс.ДатаАвансовойСчетФактуры",,
		"НомерСтроки");
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, АвансовыеСчетаФактуры, 
		"СведенияОСчетеФактуре.ДополнительныеСведенияОбУчастниках.АвансовыеСчетаФактуры");
	
КонецПроцедуры

Функция ТаблицаПлатежныеДокументы()
	
	Строка_30 = ОбщегоНазначения.ОписаниеТипаСтрока(30);
	ТипДата = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
	
	ТаблицаПРД = Новый ТаблицаЗначений;
	ТаблицаПРД.Колонки.Добавить("НомерПРД", Строка_30);
	ТаблицаПРД.Колонки.Добавить("ДатаПРД", ТипДата);
	
	Возврат ТаблицаПРД;
	
КонецФункции

Функция ЗаполнитьИнформациюОТоварахТоваров_2019(ДанныеДляФормированияЭД, СтруктураЭД, ДеревоДанных)
	
	ТолькоУслуги = Истина;
	ТоварыКОтправке = НоваяТаблицаТоваровУПД();
	
	ЕстьПрослеживаемыйТовар = ЕстьРеквизит(ДанныеДляФормированияЭД, "ПрослеживаемыеТовары")
		И ДанныеДляФормированияЭД.ПрослеживаемыеТовары.Количество() > 0;
		
	ШтрихкодыКомбинаций = Неопределено;
	ШтрихкодыНоменклатуры = Неопределено;
	ШтрихкодыПоТоварам(ДанныеДляФормированияЭД.Товары, ШтрихкодыКомбинаций, ШтрихкодыНоменклатуры);
	
	Для Каждого Товар Из ДанныеДляФормированияЭД.Товары Цикл
		
		НоваяСтрока = ТоварыКОтправке.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар,, "ЕдиницаИзмеренияКод,ЕдиницаИзмеренияНаименование");
		
		Если НеобходимоУказатьЕдиницуИзмерения(Товар) Тогда
			
			НоваяСтрока.ЕдиницаИзмеренияКод = ПолучитьКодЕдиницыИзмерения(Товар);
			НоваяСтрока.ЕдиницаИзмеренияНаименование = Товар.ЕдиницаИзмеренияНаименование;
			
		КонецЕсли;
		
		Если Не ПустаяСтрока(Товар.НаименованиеХарактеристики) Тогда
			
			НоваяСтрока.ТоварНаименование = СтрШаблон(
				"%1 (%2)",
				Товар.НаименованиеНоменклатуры,
				Товар.НаименованиеХарактеристики
			);
			
		Иначе
			
			НоваяСтрока.ТоварНаименование = Товар.НаименованиеНоменклатуры;
			
		КонецЕсли;
		
		НоваяСтрока.ЦенаЗаЕдиницуИзмерения    = ?(
			Товар.Количество = 0,
			0,
			Окр(Товар.СуммаБезНДС / Товар.Количество, 2, РежимОкругления.Окр15как20)
		);
		НоваяСтрока.СтоимостьТоваровБезНалога = Товар.СуммаБезНДС;
		НоваяСтрока.НалоговаяСтавка           = Товар.СтавкаНДС;
		НоваяСтрока.СуммаНалога               = Товар.СуммаНДС;
		НоваяСтрока.СтоимостьТоваровСНалогом  = Товар.СуммаСНДС;
		
		Если ЗначениеЗаполнено(Товар.НомерТаможеннойДекларации) Тогда
			
			Если ЕстьПрослеживаемыйТовар Тогда
				
				НоваяСтрока.СведенияОПрослеживаемости = СведенияОПрослеживаемыхТоваров(
					Товар, ДанныеДляФормированияЭД.ПрослеживаемыеТовары);
				
			КонецЕсли;
			
			СведенияОТаможеннойДекларации = Новый ТаблицаЗначений;
			СведенияОТаможеннойДекларации.Колонки.Добавить("СтранаПроисхожденияКод");
			СведенияОТаможеннойДекларации.Колонки.Добавить("ТаможеннаяДекларацияНомер");
			
			НоваяСтрока.СведенияОТаможеннойДекларации = СведенияОТаможеннойДекларации;
			Декларация = НоваяСтрока.СведенияОТаможеннойДекларации.Добавить();
			Декларация.СтранаПроисхожденияКод = Товар.КодСтраныПроисхождения;
			Декларация.ТаможеннаяДекларацияНомер = ?(
				ЗначениеЗаполнено(Товар.НомерТаможеннойДекларации),
				СокрЛП(Товар.НомерТаможеннойДекларации),
				""
			);
			НоваяСтрока.СтранаПроисхожденияНаименование = Товар.НаименованиеСтраныПроисхождения;
			
		КонецЕсли;
		
		НоваяСтрока.Признак = ПризнакТовара(Товар);
		НоваяСтрока.ТоварКод = СокрЛП(Товар.Артикул);
		НоваяСтрока.ТоварИдентификатор = Товар.Номенклатура.УникальныйИдентификатор();
		ТолькоУслуги = ТолькоУслуги И (Товар.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга);
		
		НоваяСтрока.СведенияОМаркировке = СведенияОКодахУпаковокМаркируемойПродукции(
			Товар, ДанныеДляФормированияЭД.КодыУпаковокТовараБезИдентификатора, ДанныеДляФормированияЭД.КодыУпаковокМаркируемойПродукции);
		
		НоваяСтрока.Сопоставление = СопоставленияНоменклатурыЭД(Товар.Номенклатура,
			Товар.Характеристика, Товар.ЕдиницаИзмерения);
			
		НоваяСтрока.Сопоставление.Вставить("Наименование", Товар.НаименованиеНоменклатуры);
		
		Если ЗначениеЗаполнено(Товар.НаименованиеХарактеристики) Тогда
			
			НоваяСтрока.Сопоставление.Вставить("Характеристика", Товар.НаименованиеХарактеристики);
			
		КонецЕсли;
		
		НоваяСтрока.Сопоставление.Вставить("ЕдиницаИзмерения"   , Товар.ЕдиницаИзмеренияНаименование);
		НоваяСтрока.Сопоставление.Вставить("ЕдиницаИзмеренияКод", Товар.ЕдиницаИзмеренияКод);
		НоваяСтрока.Сопоставление.Вставить("СтавкаНДС", Товар.СтавкаНДС);
		НоваяСтрока.Сопоставление.Вставить("Артикул"  , Товар.Артикул);
		
		ЗаполнитьШтрихкодыТоваровВСопоставление(
			НоваяСтрока.Сопоставление,
			ШтрихкодыНоменклатуры,
			ШтрихкодыКомбинаций,
			Товар.Номенклатура,
			Товар.Характеристика,
			Товар.ЕдиницаИзмерения
		);
		
		Если СтруктураЭД.ВариантыЗаполненияПолей.ТоварКод = "Артикул" Тогда
				
			НоваяСтрока.ТоварКод = СокрЛП(Товар.Артикул);
			
		ИначеЕсли
			СтруктураЭД.ВариантыЗаполненияПолей.ТоварКод = "Штрихкод"
			И НоваяСтрока.Сопоставление.Свойство("ШтрихкодКомбинации")
		Тогда
		
			НоваяСтрока.ТоварКод = НоваяСтрока.Сопоставление.ШтрихкодКомбинации;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СохранитьРеквизитВДереве(ДеревоДанных, "ТолькоУслуги", ТолькоУслуги);
	СохранитьРеквизитВДереве(ДеревоДанных, "ВсегоКОплате.ВсегоСтоимостьТоваровБезНалога",
		ТоварыКОтправке.Итог("СтоимостьТоваровБезНалога"));
	СохранитьРеквизитВДереве(ДеревоДанных, "ВсегоКОплате.ВсегоСтоимостьТоваровСНалогом",
		ТоварыКОтправке.Итог("СтоимостьТоваровСНалогом"));
	СохранитьРеквизитВДереве(ДеревоДанных, "ВсегоКОплате.ВсегоСуммаНалога", ТоварыКОтправке.Итог("СуммаНалога"));
	СохранитьРеквизитВДереве(ДеревоДанных, "ВсегоКОплате.ВсегоКоличество", ТоварыКОтправке.Итог("Количество"));
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ТоварыКОтправке, "СведенияОТоварах");
		
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "ЕдиницаИзмеренияНаименование";
	ОписаниеОшибкиДляТаблицы.ТекстОшибки = НСтр("ru = 'Не заполнена наименование единицы измерения в справочнике ""Номенклатура"".'");
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "ЕдиницаИзмеренияКод";
	ОписаниеОшибкиДляТаблицы.ТекстОшибки = НСтр("ru = 'Не заполнен код единицы измерения в справочнике ""Номенклатура"".'");
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "Количество";
	ОписаниеОшибкиДляТаблицы.ТекстОшибки = НСтр("ru = 'Не указано количество товара в табличной части'");
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "ТоварКод";
	ОписаниеОшибкиДляТаблицы.КлючДанных  = "Номенклатура";
	ОписаниеОшибкиДляТаблицы.ПутьКДанным = "Объект.Код";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке, ОписаниеОшибкиДляТаблицы);
	
	СсылкаНаДокумент = ДанныеДляФормированияЭД.Шапка.Ссылка;
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы = "ТоварНаименование";
	ОписаниеОшибкиДляТаблицы.КлючДанных  = "Номенклатура";
	ОписаниеОшибкиДляТаблицы.ПутьКДанным = "Объект.НаименованиеПолное";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "Количество";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = СсылкаНаДокумент;
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Товары.Количество";
	ОписаниеОшибкиДляТаблицы.ПолеНомераСтроки = "НомерСтрокиИсходногоДокумента";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "ЦенаЗаЕдиницуИзмерения";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = СсылкаНаДокумент;
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Товары.Цена";
	ОписаниеОшибкиДляТаблицы.ПолеНомераСтроки = "НомерСтрокиИсходногоДокумента";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "СтоимостьТоваровБезНалога";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = СсылкаНаДокумент;
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Товары.Сумма";
	ОписаниеОшибкиДляТаблицы.ПолеНомераСтроки = "НомерСтрокиИсходногоДокумента";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "СуммаНалога";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = СсылкаНаДокумент;
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Товары.СуммаНДС";
	ОписаниеОшибкиДляТаблицы.ПолеНомераСтроки = "НомерСтрокиИсходногоДокумента";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "ЕдиницаИзмеренияНаименование";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = "ЕдиницаИзмерения";
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Наименование";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "ЕдиницаИзмеренияКод";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = "ЕдиницаИзмерения";
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.Код";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке, ОписаниеОшибкиДляТаблицы);
	
	ОписаниеОшибкиДляТаблицы = НовоеОписаниеОшибкиДляТаблицы();
	ОписаниеОшибкиДляТаблицы.ПолеТаблицы      = "Признак";
	ОписаниеОшибкиДляТаблицы.КлючДанных       = "Номенклатура";
	ОписаниеОшибкиДляТаблицы.ПутьКДанным      = "Объект.ТипНоменклатуры";
	ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТоварыКОтправке, ОписаниеОшибкиДляТаблицы);
	
	Возврат ДеревоДанных;
	
КонецФункции

Функция НоваяТаблицаТоваровУПД()
	
	Число_26_11 = ОбщегоНазначения.ОписаниеТипаЧисло(26, 11);
	Число_19_2 = ОбщегоНазначения.ОписаниеТипаЧисло(19, 2);
	Строка_255 = ОбщегоНазначения.ОписаниеТипаСтрока(255);
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("НомерСтроки");
	ТаблицаТоваров.Колонки.Добавить("НомерСтрокиИсходногоДокумента");
	ТаблицаТоваров.Колонки.Добавить("ТоварНаименование");
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмеренияКод");
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмеренияНаименование");
	ТаблицаТоваров.Колонки.Добавить("Количество", Число_26_11);
	ТаблицаТоваров.Колонки.Добавить("ЦенаЗаЕдиницуИзмерения", Число_26_11);
	ТаблицаТоваров.Колонки.Добавить("СтоимостьТоваровБезНалога", Число_19_2);
	ТаблицаТоваров.Колонки.Добавить("НалоговаяСтавка");
	ТаблицаТоваров.Колонки.Добавить("СтоимостьТоваровСНалогом", Число_19_2);
	ТаблицаТоваров.Колонки.Добавить("СуммаАкциза", Число_19_2);
	ТаблицаТоваров.Колонки.Добавить("СуммаНалога", Число_19_2);
	ТаблицаТоваров.Колонки.Добавить("СведенияОТаможеннойДекларации", Новый ОписаниеТипов("ТаблицаЗначений"));
	ТаблицаТоваров.Колонки.Добавить("СтранаПроисхожденияНаименование", Строка_255);
	ТаблицаТоваров.Колонки.Добавить("Признак", ОбщегоНазначения.ОписаниеТипаСтрока(1));
	ТаблицаТоваров.Колонки.Добавить("ТоварКод", Строка_255);
	ТаблицаТоваров.Колонки.Добавить("ТоварИдентификатор", Строка_255);
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаТоваров.Колонки.Добавить("Содержание");
	ТаблицаТоваров.Колонки.Добавить("СведенияОМаркировке");
	ТаблицаТоваров.Колонки.Добавить("СведенияОПрослеживаемости");
	ТаблицаТоваров.Колонки.Добавить("КодВидаТовара", Строка_255);
	ТаблицаТоваров.Колонки.Добавить("Сопоставление");
	ТаблицаТоваров.Колонки.Добавить("ИдентификаторСтроки");
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция СведенияОПрослеживаемыхТоваров(СтрокаДокумента, ТаблицаРНПТ, ФорматУПД = "")
	
	// Проверим наличие ГТД у строки товара
	Если НЕ ЕстьРеквизит(СтрокаДокумента, "ГТД") ИЛИ НЕ ЗначениеЗаполнено(СтрокаДокумента.ГТД) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	// Найдем данные для вывода в ЭД
	СтруктураПоиска = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ГТД");
	
	Если ЕстьРеквизит(СтрокаДокумента, "Партия")
		И ЗначениеЗаполнено(СтрокаДокумента.Партия)
		И ЕстьРеквизит(ТаблицаРНПТ, "Партия") Тогда
		СтруктураПоиска.Вставить("Партия");
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаДокумента);
	Если СтруктураПоиска.ХарактеристикаНоменклатуры = Неопределено Тогда
		СтруктураПоиска.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	НайденныеСтроки = ТаблицаРНПТ.НайтиСтроки(СтруктураПоиска);
	
	// Не нашли по ГТД прослеживаемого товара
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ТаблицаПрослеживаемости = ТаблицаСведенияОпрослеживаемостиУПД(ФорматУПД);
	
	СтрокаПрослеживаемости = НайденныеСтроки[0];
	
	КоличествоПрослеживаемости = 0;
	
	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
		
		КоличествоПрослеживаемости = КоличествоПрослеживаемости + ТекущаяСтрока.Количество;
		
	КонецЦикла;
	
	НоваяСтрока = ТаблицаПрослеживаемости.Добавить();
	НоваяСтрока.НомерТовара = СокрЛП(СтрокаПрослеживаемости.НомерТовара);
	НоваяСтрока.ЕдиницаИзмеренияКод = СокрЛП(СтрокаПрослеживаемости.КодЕдиницыПрослеживаемости);
	НоваяСтрока.ЕдиницаИзмеренияНаименование = СокрЛП(СтрокаПрослеживаемости.ЕдиницаПрослеживаемости);
	НоваяСтрока.Количество = КоличествоПрослеживаемости * ?(КоличествоПрослеживаемости < 0, -1, 1);
	Если НоваяСтрока.Количество = СтрокаДокумента.Количество Тогда
		НоваяСтрока.СтоимостьБезНДС = СтрокаДокумента.СуммаБезНДС;
	ИначеЕсли НЕ НоваяСтрока.Количество = 0 Тогда
		Если ДействуютПравилаЗаполненияПоПроектуПостановления1137() Тогда
			НоваяСтрока.СтоимостьБезНДС = (СтрокаДокумента.СуммаБезНДС/СтрокаДокумента.Количество)*НоваяСтрока.Количество;
		Иначе
			НоваяСтрока.СтоимостьБезНДС = Окр((СтрокаДокумента.СуммаБезНДС/СтрокаДокумента.Количество)*НоваяСтрока.Количество);
		КонецЕсли;
	КонецЕсли;
	НоваяСтрока.КоличествоУчетное = СтрокаДокумента.Количество;
	
	Возврат ТаблицаПрослеживаемости;
	
КонецФункции

Функция ПризнакТовара(Товар)
	
	// Доступны значения: 1 | 2 | 3 | 4 | 5, где:
	// * 1 - имущество;
	// * 2 - работа;
	// * 3 - услуга;
	// * 4 - имущественные права;
	// * 5 - иное.
	
	Если ТипЗнч(Товар.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		Если
			ЗначениеЗаполнено(Товар.Номенклатура)
			И ВидыНоменклатурыТовар().Найти(Товар.ВидНоменклатуры) <> Неопределено
		Тогда
		
			Возврат "1";
		
		КонецЕсли;
		
		Возврат "3";
		
	КонецЕсли;
	
	Возврат "5";
	
КонецФункции

Функция ВидыНоменклатурыТовар()
	
	Результат = Новый Массив();
	Результат.Добавить(Перечисления.ВидыНоменклатуры.Товар);
	Результат.Добавить(Перечисления.ВидыНоменклатуры.Тара);
	Результат.Добавить(Перечисления.ВидыНоменклатуры.Комплект);
	Результат.Добавить(Перечисления.ВидыНоменклатуры.Продукция);
	Результат.Добавить(Перечисления.ВидыНоменклатуры.Материалы);
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьGTINСтроки(GTIN) Экспорт
	
	Если НЕ СтрДлина(GTIN) = 14 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(GTIN) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ Лев(GTIN, 1) = "0" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ШтрихкодированиеМПКлиентСервер.РассчитатьКонтрольныйСимволGTIN14(GTIN) = Прав(GTIN, 1) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина
	
КонецФункции

Функция СведенияОКодахУпаковокМаркируемойПродукции(СтрокаДокумента, КодыУпаковокТовараБезИдентификатора, КодыДокумента, ПоДокументу = Ложь)
	
	ТаблицаКодов = Новый ТаблицаЗначений;
	ТаблицаКодов.Колонки.Добавить("Код");
	
	ТаблицаУпаковок = Новый ТаблицаЗначений;
	ТаблицаУпаковок.Колонки.Добавить("Код");
	
	ТаблицаКИЗ = Новый ТаблицаЗначений;
	ТаблицаКИЗ.Колонки.Добавить("Код");
	
	СведенияОМаркировке = Новый Структура;
	СведенияОМаркировке.Вставить("ИндивидуальныеУпаковки",            ТаблицаКодов);
	СведенияОМаркировке.Вставить("ТранспортныеУпаковки",              ТаблицаУпаковок);
	СведенияОМаркировке.Вставить("КонтрольныеИдентификационныеЗнаки", ТаблицаКИЗ);
	
	ОсобенностьУчета = Справочники.Номенклатура.ПолучитьОсобенностьУчета(СтрокаДокумента.Номенклатура);
	
	Если ЗначениеЗаполнено(ОсобенностьУчета) Тогда
		ОСУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсобенностьУчета, "ОСУ");
	Иначе
		ОСУ = Ложь;
	КонецЕсли;
	
	Если ОСУ Тогда
		
		Если ПоДокументу Тогда
			GTINВСтроке = СтрокаДокумента.GTINПоДокументу;
		Иначе
			GTINВСтроке = СтрокаДокумента.GTIN;
		КонецЕсли;
		
		GTIN = "";
		Если ПроверитьGTINСтроки(GTINВСтроке) Тогда
			GTIN = GTINВСтроке;
		//Иначе
		//	
		//	КодыМаркировкиСтроки = ДанныеМаркируемойПродукции.Строки.Найти(СтрокаДокумента.ИдентификаторСтроки, "ИдентификаторСтроки");
		//	
		//	Если КодыМаркировкиСтроки = Неопределено Тогда
		//		Возврат;
		//	КонецЕсли;
		//	
		//	ВидПродукции = Справочники.ОсобенностиУчетаНоменклатуры.ПолучитьВидПродукции(ОсобенностьУчета);
		//	Для Каждого ТекущаяМаркировка Из КодыМаркировкиСтроки.Строки Цикл
		//		
		//		ДанныеРазбора = ШтрихкодированиеИСВызовСервера.РазобратьКодМаркировки(ТекущаяМаркировка.КодМарки, ВидПродукции);
		//		
		//		Если ДанныеРазбора = Неопределено Тогда
		//			Продолжить;
		//		КонецЕсли;
		//		
		//		GTIN = ПолучитьЗначениеПараметраСтруктуры(ДанныеРазбора.СоставКодаМаркировки, "GTIN", "");
		//		Если НЕ ПустаяСтрока(GTIN) Тогда
		//			Прервать;
		//		КонецЕсли;
		//		
		//	КонецЦикла;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(GTIN) Тогда
			
			СоставОСУ = Новый Массив;
			СоставОСУ.Добавить("02");
			СоставОСУ.Добавить(GTIN);
			
			Если ПоДокументу Тогда
				КоличествоУпаковокВСтроке = СтрокаДокумента.КоличествоУпаковокПоДокументу;
			//ИначеЕсли ЭтоРасхождения И ИмяСведений = "Недостача" Тогда
			//	КоличествоУпаковокВСтроке = СтрокаДокумента.КоличествоУпаковокПоДокументу;
			Иначе
				КоличествоУпаковокВСтроке = СтрокаДокумента.КоличествоУпаковок;
			КонецЕсли;
			
			Весовой = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДокумента.Номенклатура, "ТипНоменклатуры.Весовой");
			
			Если ЗначениеЗаполнено(КоличествоУпаковокВСтроке) Тогда
				СоставОСУ.Добавить("37");
				СоставОСУ.Добавить(Формат(КоличествоУпаковокВСтроке, "ЧГ=0"));
			ИначеЕсли НЕ Весовой Тогда
				СоставОСУ.Добавить("37");
				СоставОСУ.Добавить(Формат(Цел(СтрокаДокумента.Количество), "ЧГ=0"));
			КонецЕсли;
			
			КодОСУ = СтрСоединить(СоставОСУ);
			
			НоваяСтрока = ТаблицаКодов.Добавить();
			НоваяСтрока.Код = КодОСУ;
			
		КонецЕсли;
		
		Возврат СведенияОМаркировке;
	КонецЕсли;
	
	ВидПродукции          = Справочники.ОсобенностиУчетаНоменклатуры.ПолучитьВидПродукции(ОсобенностьУчета);
	ЛогистическаяУпаковка = Перечисления.ВидыУпаковокМаркировки.Логистическая;
	
	// Если у документа есть таблица марок связанная с товарами по идентификатору
	Если КодыУпаковокТовараБезИдентификатора = Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(КодыДокумента) Тогда
			// Передадим пустые коды маркировок
			Возврат СведенияОМаркировке;
		КонецЕсли;
		
		Если КодыДокумента.Колонки.Найти("ДокументОснование") = Неопределено ИЛИ (НЕ СтрокаДокумента.Свойство("ДокументОснование")) Тогда
			НайденнаяСтрока = КодыДокумента.Строки.Найти(СтрокаДокумента.ИдентификаторСтроки, "ИдентификаторСтроки");
		Иначе
			КодыМаркировкиОснования = КодыДокумента.Строки.Найти(СтрокаДокумента.ДокументОснование, "ДокументОснование");
			Если КодыМаркировкиОснования = Неопределено Тогда
				Возврат СведенияОМаркировке;
			КонецЕсли;
			
			НайденнаяСтрока = КодыМаркировкиОснования.Строки.Найти(СтрокаДокумента.ИдентификаторСтроки, "ИдентификаторСтроки");
		КонецЕсли;
		
		Если НайденнаяСтрока = Неопределено Тогда
			Возврат СведенияОМаркировке;
		КонецЕсли;
		
		ЗаполненныеСтроки = Новый Массив;
		
		ИндексМарки = НайденнаяСтрока.Строки.Количество()-1;
		
		Пока ИндексМарки>=0 Цикл
			
			ТекущаяМаркировка = НайденнаяСтрока.Строки[ИндексМарки];
			
			// Найдем номенклатуру по GTIM
			СтруктураМаркировки = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ТекущаяМаркировка.КодМарки);
			
			Если ЭтоНеКодТовараВФорматеDataMatrixGS1(СтруктураМаркировки.ТипИдентификатораТовара) Тогда
				ИндексМарки = ИндексМарки - 1;
				Продолжить;
			КонецЕсли;
			
			ДанныеРазбора = ШтрихкодированиеМПСервер.РазобратьКодМаркировки(ТекущаяМаркировка.КодМарки, ВидПродукции);
			
			КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ТекущаяМаркировка.КодМарки, "", Ложь);
			
			Если ДанныеРазбора.ВидУпаковки = ЛогистическаяУпаковка Тогда
				НоваяСтрока = ТаблицаУпаковок.Добавить();
				НоваяСтрока.Код = КодМаркировки;
			Иначе
				НоваяСтрока = ТаблицаКодов.Добавить();
				НоваяСтрока.Код = КодМаркировки;
			КонецЕсли;
			
			// Уберем указанные коды маркировки с рассмотрения
			НайденнаяСтрока.Строки.Удалить(ТекущаяМаркировка);
			
			ИндексМарки = ИндексМарки - 1;
			
		КонецЦикла;
		
	Иначе
		// Если нет связи товаров и марок по идентификатору
		
		КоличествоБазовое = СтрокаДокумента.КоличествоБазовое;
		
		ТаблицаКодовСтроки = Новый Массив;
		
		КомбинацииПоиска = ТорговыйКомплексКлиентСервер.ПолучитьКомбинацииПоиска(СтрокаДокумента, "Номенклатура", "Характеристика,Партия,ГТД");
		
		ПропущеннаяСтрокаМарки  = Неопределено;
		Для Каждого ПараметрыПоиска Из КомбинацииПоиска Цикл
			
			Если КоличествоБазовое = 0 Тогда
				Прервать;
			КонецЕсли;
			
			НайденныеСтроки = КодыУпаковокТовараБезИдентификатора.НайтиСтроки(ПараметрыПоиска);
			Для Каждого ТекущаяМаркировка Из НайденныеСтроки Цикл
				
				Если КоличествоБазовое = 0 Тогда
					Прервать;
				КонецЕсли;
				
				Если ТекущаяМаркировка.КоличествоБазовое = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если КоличествоБазовое<ТекущаяМаркировка.КоличествоБазовое Тогда
					Если ПропущеннаяСтрокаМарки = Неопределено Тогда
						ПропущеннаяСтрокаМарки = ТекущаяМаркировка;
					ИначеЕсли ПропущеннаяСтрокаМарки.КоличествоБазовое>ТекущаяМаркировка.КоличествоБазовое Тогда
						ПропущеннаяСтрокаМарки = ТекущаяМаркировка;
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				
				СтруктураМаркировки = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ТекущаяМаркировка.КодМарки);
				
				Если ЭтоНеКодТовараВФорматеDataMatrixGS1(СтруктураМаркировки.ТипИдентификатораТовара) Тогда
					КодыУпаковокТовараБезИдентификатора.Удалить(ТекущаяМаркировка);
					Продолжить;
				КонецЕсли;
				
				ДанныеРазбора = ШтрихкодированиеМПСервер.РазобратьКодМаркировки(ТекущаяМаркировка.КодМарки, ВидПродукции);
				
				КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ТекущаяМаркировка.КодМарки, "", Ложь);
				
				Если ДанныеРазбора.ВидУпаковки = ЛогистическаяУпаковка Тогда
					НоваяСтрока = ТаблицаУпаковок.Добавить();
					НоваяСтрока.Код = КодМаркировки;
				Иначе
					НоваяСтрока = ТаблицаКодов.Добавить();
					НоваяСтрока.Код = КодМаркировки;
				КонецЕсли;
				
				КоличествоБазовое = КоличествоБазовое-ТекущаяМаркировка.КоличествоБазовое;
				
				// Уберем указанные коды маркировки с рассмотрения
				КодыУпаковокТовараБезИдентификатора.Удалить(ТекущаяМаркировка);
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если КоличествоБазовое>0 И (НЕ ПропущеннаяСтрокаМарки = Неопределено) Тогда
			СтруктураМаркировки = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ПропущеннаяСтрокаМарки.КодМарки);
			Если НЕ ЭтоНеКодТовараВФорматеDataMatrixGS1(СтруктураМаркировки.ТипИдентификатораТовара) Тогда
				
				ДанныеРазбора = ШтрихкодированиеМПСервер.РазобратьКодМаркировки(ПропущеннаяСтрокаМарки.КодМарки, ВидПродукции);
				
				КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ПропущеннаяСтрокаМарки.КодМарки, "", Ложь);
				
				Если ДанныеРазбора.ВидУпаковки = ЛогистическаяУпаковка Тогда
					НоваяСтрока = ТаблицаУпаковок.Добавить();
					НоваяСтрока.Код = КодМаркировки;
				Иначе
					НоваяСтрока = ТаблицаКодов.Добавить();
					НоваяСтрока.Код = КодМаркировки;
				КонецЕсли;
				
			КонецЕсли;
			
			КодыУпаковокТовараБезИдентификатора.Удалить(ПропущеннаяСтрокаМарки);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СведенияОМаркировке;
	
КонецФункции

Функция ЭтоНеКодТовараВФорматеDataMatrixGS1(ТипИдентификатораТовара)
	
	Возврат ТипИдентификатораТовара <> Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеDataMatrixGS1;
	
КонецФункции

Функция СопоставленияНоменклатурыЭД(Номенклатура, Характеристика = Неопределено, Упаковка = Неопределено) Экспорт

	Результат = СопоставлениеНоменклатуры();
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.Вставить("НоменклатураИБ", Номенклатура);
	
	Реквизиты = "Наименование, Артикул, БазоваяЕдиницаИзмерения, БазоваяЕдиницаИзмерения.Наименование, БазоваяЕдиницаИзмерения.Код, СтавкаНДС";
	
	ЗначенияРеквизитовНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, Реквизиты);
	
	Результат.Вставить("Наименование", ЗначенияРеквизитовНоменклатуры.Наименование);
	Результат.Вставить("Артикул",      ЗначенияРеквизитовНоменклатуры.Артикул);
	Результат.Вставить("СтавкаНДС",    ЗначенияРеквизитовНоменклатуры.СтавкаНДС);
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		
		Результат.Вставить("ХарактеристикаИБ", Характеристика);
		Результат.Вставить("Характеристика", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Характеристика, "Наименование"));
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Упаковка) Тогда
		
		Результат.Вставить("УпаковкаИБ", Упаковка);
		Результат.Вставить("ЕдиницаИзмерения", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Упаковка, "Наименование"));
		
		Если ТипЗнч(Упаковка) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
			
			ЕдиницаИзмеренияКод = Упаковка.ЕдиницаПоКлассификатору.Код;
			
			Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияКод) Или ЕдиницаИзмеренияКод = "001" Тогда
				
				ЕдиницаИзмеренияКод = "0000";
				
			КонецЕсли;
			
		Иначе
			
			ЕдиницаИзмеренияКод = Упаковка.Код;
			
		КонецЕсли;
		
		Результат.Вставить("ЕдиницаИзмеренияКод", ЕдиницаИзмеренияКод);
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Процедура ШтрихкодыПоТоварам(НаборТоваров, ШтрихкодыКомбинаций, ШтрихкодыНоменклатуры) Экспорт
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Товары.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Товары.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	
	Для Каждого Товар Из НаборТоваров Цикл
		
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), Товар);
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК ХарактеристикаНоменклатуры,
		|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК Товары
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	ЕдиницаИзмерения"
	);
	Запрос.УстановитьПараметр("Товары", Товары);
	
	ИнициализацияТекстаЗапросаПоискаШтрихкодовПоВременнойТаблицеТоваров(Запрос.Текст);
	
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	
	СтруктураДанных = Новый Структура;
	ШтрихкодыКомбинаций = ПакетыЗапросов[3].Выгрузить();
	ШтрихкодыКомбинаций.Индексы.Добавить("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения");

	ШтрихкодыНоменклатуры = ПакетыЗапросов[4].Выгрузить();
	ШтрихкодыНоменклатуры.Индексы.Добавить("Номенклатура");
	
КонецПроцедуры

Процедура ИнициализацияТекстаЗапросаПоискаШтрихкодовПоВременнойТаблицеТоваров(ТекстЗапроса)
		
	ПакетыЗапросов = Новый Массив;
	ПакетыЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Штрихкоды.Штрихкод                   КАК Штрихкод,
	|	Штрихкоды.Объект                     КАК Номенклатура,
	|	Штрихкоды.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Штрихкоды.ЕдиницаИзмерения           КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ШтрихкодыПоКомбинации
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Товары КАК ВТ_Товары
	|		ПО (ВТ_Товары.Номенклатура = Штрихкоды.Объект)
	|			И (ВТ_Товары.ХарактеристикаНоменклатуры = Штрихкоды.ХарактеристикаНоменклатуры)
	|			И (ТИПЗНАЧЕНИЯ(ВТ_Товары.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения) 
	|				ИЛИ ВТ_Товары.ЕдиницаИзмерения = Штрихкоды.ЕдиницаИзмерения)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Штрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ШтрихкодыПоКомбинации.Штрихкод) КАК КоличествоШтрихкодов,
	|	ШтрихкодыПоКомбинации.Номенклатура КАК Номенклатура,
	|	ШтрихкодыПоКомбинации.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ШтрихкодыПоКомбинации.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ПоискРазличныхКомбинаций
	|ИЗ
	|	ШтрихкодыПоКомбинации КАК ШтрихкодыПоКомбинации
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодыПоКомбинации.Номенклатура,
	|	ШтрихкодыПоКомбинации.ХарактеристикаНоменклатуры,
	|	ШтрихкодыПоКомбинации.ЕдиницаИзмерения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КоличествоШтрихкодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтрихкодыПоКомбинации.Штрихкод КАК Штрихкод,
	|	ШтрихкодыПоКомбинации.Номенклатура КАК Номенклатура,
	|	ШтрихкодыПоКомбинации.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ШтрихкодыПоКомбинации.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	ШтрихкодыПоКомбинации КАК ШтрихкодыПоКомбинации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоискРазличныхКомбинаций КАК ПоискРазличныхКомбинаций
	|		ПО ШтрихкодыПоКомбинации.Номенклатура = ПоискРазличныхКомбинаций.Номенклатура
	|			И ШтрихкодыПоКомбинации.ХарактеристикаНоменклатуры = ПоискРазличныхКомбинаций.ХарактеристикаНоменклатуры
	|			И ШтрихкодыПоКомбинации.ЕдиницаИзмерения = ПоискРазличныхКомбинаций.ЕдиницаИзмерения
	|ГДЕ
	|	ПоискРазличныхКомбинаций.КоличествоШтрихкодов = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	Штрихкоды.Объект КАК Номенклатура
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ПО ВТ_Товары.Номенклатура = Штрихкоды.Объект";
	
	ПакетыЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = СтрСоединить(ПакетыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
КонецПроцедуры

Процедура ЗаполнитьШтрихкодыТоваровВСопоставление(Сопоставление,
                                                  ШтрихкодыНоменклатуры,
                                                  ШтрихкодыКомбинаций,
                                                  НоменклатураИБ,
                                                  ХарактеристикаИБ,
                                                  ЕдиницаИзмеренияИБ) Экспорт
	
	ШтрихкодыТовара = Новый Массив;
	
	ОтборШтрихкодов = Новый Структура;
	ОтборШтрихкодов.Вставить("Номенклатура", НоменклатураИБ);
	
	НайденныеСтрокиШтрихкодов = ШтрихкодыНоменклатуры.НайтиСтроки(ОтборШтрихкодов);
	
	Для Каждого СтрокаШтрихкода Из НайденныеСтрокиШтрихкодов Цикл
		
		ШтрихкодыТовара.Добавить(СтрокаШтрихкода.Штрихкод);
		
	КонецЦикла;
	
	Сопоставление.Вставить("ШтрихкодыНоменклатуры", ШтрихкодыТовара);
	
	ОтборШтрихкодов = Новый Структура;
	ОтборШтрихкодов.Вставить("Номенклатура"    , НоменклатураИБ);
	ОтборШтрихкодов.Вставить("ХарактеристикаНоменклатуры", ХарактеристикаИБ);
	ОтборШтрихкодов.Вставить("ЕдиницаИзмерения", ЕдиницаИзмеренияИБ);
	
	СтрокаПоиска = ШтрихкодыКомбинаций.НайтиСтроки(ОтборШтрихкодов);
	
	Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
		
		Сопоставление.Вставить("ШтрихкодКомбинации", СтрокаПоиска[0].Штрихкод);
		
	ИначеЕсли ТипЗнч(ЕдиницаИзмеренияИБ) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		
		ОтборШтрихкодов.Удалить("ЕдиницаИзмерения");
		СтрокаПоиска = ШтрихкодыКомбинаций.НайтиСтроки(ОтборШтрихкодов);
		
		Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
			
			Сопоставление.Вставить("ШтрихкодКомбинации", СтрокаПоиска[0].Штрихкод);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДайДанныеВозвратПоставщикуДляУПД(СсылкаНаОбъект)
	
	Если СсылкаНаОбъект.Пустая() Тогда
		
		ВызватьИсключение НСтр("ru = 'Не указан документ для выгрузки в ЭДО'");
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВозвратПоставщику.Номер КАК Номер,
		|	ВозвратПоставщику.Номер КАК НомерПоДаннымКлиента,
		|	ВозвратПоставщику.Дата КАК ДатаДокумента,
		|	ВозвратПоставщику.Дата КАК ДатаПоДаннымКлиента,
		|	ВозвратПоставщику.Организация КАК Организация,
		|	ВозвратПоставщику.Организация КАК ЮрФизЛицо,
		|	ВозвратПоставщику.Организация КАК Поставщик,
		|	ВозвратПоставщику.Контрагент КАК Покупатель,
		|	ВозвратПоставщику.Контрагент КАК Плательщик,
		|	NULL КАК Сделка,
		|	ВозвратПоставщику.Менеджер КАК Менеджер,
		|	ВозвратПоставщику.ДоговорВзаиморасчетов.Наименование КАК ДоговорВзаиморасчетовНаименование,
		|	ВозвратПоставщику.ДокументОснование КАК ДокументОснование,
		|	ВозвратПоставщику.ДокументОснование.Номер КАК ДокументОснованиеНомер,
		|	ВозвратПоставщику.ДокументОснование.Дата КАК ДокументОснованиеДата,
		|	ВозвратПоставщику.ДокументОснование.ВхДокНомер КАК ВхДокНомер,
		|	ВозвратПоставщику.ДокументОснование.ВхДокДата КАК ВхДокДата,
		|	ВозвратПоставщику.ПодразделениеКомпании КАК Подразделение,
		|	ВозвратПоставщику.ВалютаДокумента КАК ВалютаДокумента,
		|	ВозвратПоставщику.КурсДокумента КАК Курс,
		|	ВозвратПоставщику.ТипЦен.ЦенаВключаетНДС КАК СуммаВключаетНДС,
		|	ВозвратПоставщику.СкладКомпании.МОЛ КАК ОтпускПроизвел,
		|	ВозвратПоставщику.Организация.ИНН КАК ИННпоставщика,
		|	ВозвратПоставщику.Организация.КПП КАК КППпоставщика,
		|	ВозвратПоставщику.Контрагент.ИНН КАК ИННпокупателя,
		|	ВозвратПоставщику.Контрагент.КПП КАК КППпокупателя,
		|	ВозвратПоставщику.ХозОперация КАК ХозОперация,
		|	ВозвратПоставщику.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ВозвратТоваровПоставщикуКомиссия) КАК ЭтоКомиссия,
		|	ЛОЖЬ КАК Исправление,
		|	ВозвратПоставщику.Ссылка КАК Ссылка,
		|	ВозвратПоставщику.Дата КАК Дата,
		|	ВозвратПоставщику.ВалютаДокумента.Код КАК КодВалюты,
		|	ВозвратПоставщику.ВалютаДокумента.Наименование КАК НаименованиеВалюты,
		|	ВозвратПоставщику.ВалютаДокумента.НаименованиеПолное КАК НаименованиеПолноеВалюты,
		|	ВозвратПоставщику.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
		|	ВозвратПоставщику.ДоговорВзаиморасчетов.ДатаНачала КАК ДатаДоговора,
		|	ВозвратПоставщику.ДоговорВзаиморасчетов.НомерДоговора КАК НомерДоговора,
		|	ВозвратПоставщику.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосударственногоКонтракта,
		|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
		|	ВозвратПоставщику.Грузополучатель КАК Грузополучатель,
		|	ВозвратПоставщику.ТранспортноеСредство.НомерТС КАК НомерТС
		|ИЗ
		|	Документ.ВозвратПоставщику КАК ВозвратПоставщику
		|ГДЕ
		|	ВозвратПоставщику.Ссылка = &ТекущийДокумент"
	);
	
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	Шапка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);
	Шапка = ДополнитьДополнительнымиРеквизитамиИСведениями(Шапка, СсылкаНаОбъект);
	
	ТаблицаТоваровСчетФактуры = ТоварыИзСчетаФактуры(СсылкаНаОбъект);
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.Количество * ТаблицаТоваров.Коэффициент КАК КоличествоБазовое,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения) КАК ЕдиницаИзмерения,
	|	ТаблицаТоваров.Коэффициент КАК Коэффициент,
	|	ТаблицаТоваров.Цена КАК Цена,
	|	ТаблицаТоваров.Сумма КАК Сумма,
	|	ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаТоваров.СуммаНДС КАК СуммаНДС,
	|	ТаблицаТоваров.СуммаВсего КАК СуммаВсего,
	|	ТаблицаТоваров.Партия КАК Партия,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.ГТД КАК Справочник.ГТД) КАК ГТД,
	|	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	0 КАК НомерСтроки
	|ПОМЕСТИТЬ ДанныеОТоварах
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровТовары.Номенклатура.ТипНоменклатуры.Весовой КАК ВесовойТовар,
	|	РеализацияТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	МАКСИМУМ(РеализацияТоваровТовары.GTIN) КАК GTIN,
	|	СУММА(РеализацияТоваровТовары.КоличествоМест) КАК КоличествоУпаковок,
	|	РеализацияТоваровТовары.Партия КАК Партия,
	|	РеализацияТоваровТовары.ГТД КАК ГТД,
	|	СУММА(РеализацияТоваровТовары.Количество * РеализацияТоваровТовары.Коэффициент) КАК КоличествоБазовое
	|ИЗ
	|	Документ.ВозвратПоставщику.Товары КАК РеализацияТоваровТовары
	|ГДЕ
	|	РеализацияТоваровТовары.Ссылка = &ТекущийДокумент
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровТовары.Номенклатура,
	|	РеализацияТоваровТовары.ХарактеристикаНоменклатуры,
	|	РеализацияТоваровТовары.Партия,
	|	РеализацияТоваровТовары.ГТД
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры УБЫВ,
	|	Партия УБЫВ,
	|	ГТД УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратПоставщикуТовары.НомерСтроки КАК НомерСтроки,
	|	ВозвратПоставщикуТовары.НомерСтроки КАК НомерСтрокиИсходногоДокумента,
	|	ВозвратПоставщикуТовары.Номенклатура.Код КАК КодТовара,
	|	ВозвратПоставщикуТовары.Номенклатура.Артикул КАК Артикул,
	|	ВозвратПоставщикуТовары.Номенклатура.НаименованиеПолное КАК НаименованиеНоменклатуры,
	|	ВозвратПоставщикуТовары.Номенклатура.ОсобенностьУчета КАК ОсобенностьУчета,
	|	ВозвратПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ВозвратПоставщикуТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ВозвратПоставщикуТовары.Номенклатура.Код КАК КодНоменклатуры,
	|	ВозвратПоставщикуТовары.Номенклатура.КодТНВЭД КАК КодТНВЭД,
	|	ВозвратПоставщикуТовары.Количество КАК Количество,
	|	ВозвратПоставщикуТовары.КоличествоБазовое КАК КоличествоБазовое,
	|	ВозвратПоставщикуТовары.КоличествоБазовое КАК КоличествоНеРаспределено,
	|	ВозвратПоставщикуТовары.Цена * &Курс / &Кратность КАК Цена,
	|	ВозвратПоставщикуТовары.Сумма * &Курс / &Кратность КАК Сумма,
	|	ВозвратПоставщикуТовары.СуммаВсего * &Курс / &Кратность - ВозвратПоставщикуТовары.СуммаНДС * &Курс / &Кратность КАК СуммаБезНДС,
	|	ВозвратПоставщикуТовары.СуммаНДС * &Курс / &Кратность КАК СуммаНДС,
	|	ВозвратПоставщикуТовары.СуммаВсего * &Курс / &Кратность КАК СуммаСНДС,
	|	ВозвратПоставщикуТовары.СтавкаНДС КАК СтавкаНДС,
	|	ПРЕДСТАВЛЕНИЕ(ВозвратПоставщикуТовары.ХарактеристикаНоменклатуры) КАК НаименованиеХарактеристики,
	|	ВозвратПоставщикуТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ВозвратПоставщикуТовары.Номенклатура.БазоваяЕдиницаИзмерения КАК БазоваяЕдиница,
	|	ВозвратПоставщикуТовары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК БазоваяЕдиницаКод,
	|	ВозвратПоставщикуТовары.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК БазоваяЕдиницаНаименование,
	|	ВозвратПоставщикуТовары.Номенклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК БазоваяЕдиницаНаименованиеПолное,
	|	ВозвратПоставщикуТовары.Номенклатура.БазоваяЕдиницаИзмерения.МеждународноеСокращение КАК БазоваяЕдиницаМеждународноеСокращение,
	|	ВозвратПоставщикуТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВозвратПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	ВозвратПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	ВозвратПоставщикуТовары.ЕдиницаИзмерения КАК Упаковка,
	|	ВозвратПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК УпаковкаКод,
	|	ВозвратПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование КАК УпаковкаНаименование,
	|	&ТекущийДокумент КАК Ссылка,
	|	"""" КАК ВидУпаковки,
	|	0 КАК СуммаСкидки,
	|	1 КАК Коэффициент,
	|	0 КАК КоличествоМест,
	|	0 КАК КоличествоВОдномМесте,
	|	ВЫБОР
	|		КОГДА ВозвратПоставщикуТовары.ГТД = ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ""643""
	|		ИНАЧЕ ВозвратПоставщикуТовары.ГТД.Страна.Код
	|	КОНЕЦ КАК КодСтраныПроисхождения,
	|	ВозвратПоставщикуТовары.ГТД.Страна.Наименование КАК НаименованиеСтраныПроисхождения,
	|	ВозвратПоставщикуТовары.ГТД.Наименование КАК НомерТаможеннойДекларации,
	|	ВозвратПоставщикуТовары.ГТД КАК ГТД,
	|	ВозвратПоставщикуТовары.Партия КАК Партия,
	|	ВЫРАЗИТЬ("""" КАК Строка(14)) КАК GTIN,
	|	0 КАК КоличествоУпаковок
	|ИЗ
	|	ДанныеОТоварах КАК ВозвратПоставщикуТовары
	|";
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, Шапка.Дата);
	Запрос.УстановитьПараметр("Курс", КурсВалюты.Курс);
	Запрос.УстановитьПараметр("Кратность", КурсВалюты.Кратность);
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваровСчетФактуры);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ТаблицаРеализации = ПакетЗапросов[ПакетЗапросов.Количество()-2].Выгрузить();
	ТаблицаТоваров    = ПакетЗапросов[ПакетЗапросов.Количество()-1].Выгрузить();
	
	Для Каждого ТекущаяСтрока Из ТаблицаРеализации Цикл
		
		Если ТекущаяСтрока.КоличествоУпаковок>0 Тогда
		ИначеЕсли ТекущаяСтрока.ВесовойТовар Тогда
		Иначе
			ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.КоличествоБазовое;
		КонецЕсли;
		
		КомбинацииПоиска = ТорговыйКомплексКлиентСервер.ПолучитьКомбинацииПоиска(ТекущаяСтрока, "Номенклатура", "ХарактеристикаНоменклатуры,Партия,ГТД");
		
		КоличествоБазовое  = ТекущаяСтрока.КоличествоБазовое;
		КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок;
		ПоследняяСтрока    = Неопределено;
		Для Каждого ПараметрыПоиска Из КомбинацииПоиска Цикл
			
			Если КоличествоБазовое = 0 Тогда
				Прервать;
			КонецЕсли;
			
			НайденныеСтроки = ТаблицаТоваров.НайтиСтроки(ПараметрыПоиска);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				Если КоличествоБазовое = 0 Тогда
					Прервать;
				КонецЕсли;
				
				Если НайденнаяСтрока.КоличествоБазовое = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если НайденнаяСтрока.КоличествоНеРаспределено = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ПоследняяСтрока = НайденнаяСтрока;
				НайденнаяСтрока.GTIN = ТекущаяСтрока.GTIN;
				Если НайденнаяСтрока.КоличествоНеРаспределено >= КоличествоБазовое Тогда
					
					НайденнаяСтрока.КоличествоУпаковок       = НайденнаяСтрока.КоличествоУпаковок + КоличествоУпаковок;
					НайденнаяСтрока.КоличествоНеРаспределено = НайденнаяСтрока.КоличествоНеРаспределено - КоличествоБазовое;
					
					КоличествоБазовое  = 0;
					КоличествоУпаковок = 0;
					
					Прервать;
				Иначе
					
					КоличествоУпаковокСтроки = Макс(1, Цел(КоличествоУпаковок*НайденнаяСтрока.КоличествоНеРаспределено/КоличествоБазовое));
					НайденнаяСтрока.КоличествоУпаковок       = НайденнаяСтрока.КоличествоУпаковок + КоличествоУпаковокСтроки;
					НайденнаяСтрока.КоличествоНеРаспределено = 0;
					
					КоличествоБазовое  = КоличествоБазовое - НайденнаяСтрока.КоличествоНеРаспределено;
					КоличествоУпаковок = КоличествоУпаковок - КоличествоУпаковокСтроки;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		Если КоличествоБазовое=0 И КоличествоУпаковок>0 И (НЕ ПоследняяСтрока = Неопределено) Тогда
			ПоследняяСтрока.КоличествоУпаковок = ПоследняяСтрока.КоличествоУпаковок + КоличествоУпаковок;
		КонецЕсли;
		
	КонецЦикла;
	
	Товары = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТоваров);
	
	КодыУпаковокМаркируемойПродукции = Документы
		.ВозвратПоставщику
		.ПолучитьКодыМаркируемойПродукции(СсылкаНаОбъект);
	
	КодыУпаковокТовараБезИдентификатора = Документы
		.ВозвратПоставщику
		.ПолучитьКодыМаркировкиТовараБезИдентификатора(СсылкаНаОбъект);
	
	ПрослеживаемыеТовары = УправлениеДиалогомДокументаСервер.РНПТПрослеживаемыхТоваров(Шапка.Ссылка);
	Шапка = ДополнитьДанныеДокументаОтгрузки(Шапка, Товары, СсылкаНаОбъект);
	
	ОсобенностиУчета = Документы.СчетФактураВыданный.ПолучитьОсобенностиУчетаТоваров(ТаблицаТоваров);
	
	Результат = Новый Структура();
	Результат.Вставить("Шапка",  Шапка);
	Результат.Вставить("Товары", Товары);
	Результат.Вставить("ОсобенностиУчета", ОсобенностиУчета);
	Результат.Вставить("КодыУпаковокМаркируемойПродукции",    КодыУпаковокМаркируемойПродукции);
	Результат.Вставить("КодыУпаковокТовараБезИдентификатора", КодыУпаковокТовараБезИдентификатора);
	Результат.Вставить("ПрослеживаемыеТовары",                ПрослеживаемыеТовары);
	
	Возврат Результат;
	
КонецФункции

Функция ДополнитьДополнительнымиРеквизитамиИСведениями(Шапка, СсылкаНаОбъект)
	
	СвойстваНеобходимыеПриВыгрузке = Новый Массив(2);
	СвойстваНеобходимыеПриВыгрузке[0] = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Доверенность;
	СвойстваНеобходимыеПриВыгрузке[1] = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ДатаОтгрузки;
	ЗначенияСвойств = УправлениеСвойствами.ПолучитьЗначенияСвойств(
		СсылкаНаОбъект,
		Истина,
		Истина,
		СвойстваНеобходимыеПриВыгрузке
	);
	
	ДатаОтгрузки = УправлениеСвойствамиПлатформа.ПолучитьЗначениеСвойства("ДатаОтгрузки", ЗначенияСвойств);
	Шапка.Вставить("ДатаОтгрузки", ДатаОтгрузки);
	
	Доверенность = УправлениеСвойствамиПлатформа.ПолучитьЗначениеСвойства("Доверенность", ЗначенияСвойств);
	
	Если ЗначениеЗаполнено(Доверенность) Тогда
		
		Шапка.Вставить("Доверенность", Доверенность);
		
	КонецЕсли;
	
	Шапка.Вставить(
		"ГлавныйБухгалтер",
		УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(СсылкаНаОбъект, "ГлавныйБухгалтер")
	);
	Шапка.Вставить("Руководитель", УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(СсылкаНаОбъект, "Руководитель"));
	Шапка.Вставить("Отпустил", УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(СсылкаНаОбъект, "Отпустил"));
	Шапка.Вставить(
		"Получил",
		УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(СсылкаНаОбъект, "ПолучилКонтрагент", "Получил")
	);
	Возврат Шапка;
	
КонецФункции

Функция ТоварыИзСчетаФактуры(СсылкаНаОбъект)
	
	СчетФактура = Документы.СчетФактураВыданный.СчетФактураДокумента(СсылкаНаОбъект);
	Если НЕ ЗначениеЗаполнено(СчетФактура) Тогда
		
		СчетФактура = Документы.СчетФактураВыданный.СоздатьДокумент();
		СчетФактура.ДополнительныеСвойства.Вставить("ПропуститьПроверкуОснованияСчетаФактуры", Истина);
		СчетФактура.Заполнить(СсылкаНаОбъект);
		
		ТаблицаТоваров = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СсылкаНаОбъект).ТоварыДокумента(СчетФактура);
	Иначе
		СчетФактура = СчетФактура.ПолучитьОбъект();
		ТаблицаТоваров = Документы.СчетФактураВыданный.ТоварыДокумента(СчетФактура);
	КонецЕсли;
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция ДополнитьДанныеДокументаОтгрузки(Шапка, Товары, СсылкаНаОбъект)
	
	ПредставлениеДанныхОбОтгрузке = "";
	
	НомерДокумента = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(Шапка.Ссылка);
	ДатаДокумента  = Шапка.ДатаДокумента;
	
	Если Шапка.Дата>'20241001' Тогда
		Если Шапка.ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг Тогда
			ПредставлениеДокумента = НСтр("ru = 'Акт'");
		Иначе
			ПредставлениеДокумента = НСтр("ru = 'Товарная накладная'");
		КонецЕсли;
		
		ПредставлениеДанныхОбОтгрузке = СтрШаблон(
			НСтр("ru = '%1, № %2 от %3'"),
			ПредставлениеДокумента,
			НомерДокумента,
			Формат(ДатаДокумента, "ДЛФ=D"));
		
	Иначе
		КоличествоТоваров = Товары.Количество();
		
		КоличествоТовара = "";
		Если КоличествоТоваров = 1 Тогда
			КоличествоТовара = "1";
		ИначеЕсли КоличествоТоваров > 1 Тогда
			КоличествоТовара = СтрШаблон("1-%1", Строка(КоличествоТоваров));
		КонецЕсли;
		
		ПредставлениеДанныхОбОтгрузке = СтрШаблон(
			НСтр("ru = '№ п/п %1 № %2 от %3'"),
			КоличествоТовара,
			НомерДокумента,
			Формат(ДатаДокумента, "ДЛФ=D"));
	КонецЕсли;
	
	Шапка.Вставить("ДокументОбОтгрузке", ПредставлениеДанныхОбОтгрузке);
	
	Возврат Шапка;
	
КонецФункции

Функция ДайДанныеКорректировкиРеализацииИУслугДляУПД(СсылкаНаОбъект)
	
	Если СсылкаНаОбъект.Пустая() Тогда
		
		ВызватьИсключение НСтр("ru = 'Не указан документ для выгрузки в ЭДО'");
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеализацияТоваров.Номер КАК Номер,
		|	РеализацияТоваров.Номер КАК НомерПоДаннымКлиента,
		|	РеализацияТоваров.Дата КАК ДатаДокумента,
		|	РеализацияТоваров.Дата КАК ДатаПоДаннымКлиента,
		|	РеализацияТоваров.Организация КАК Организация,
		|	РеализацияТоваров.Организация КАК ЮрФизЛицо,
		|	РеализацияТоваров.Организация КАК Поставщик,
		|	РеализацияТоваров.Контрагент КАК Покупатель,
		|	РеализацияТоваров.Контрагент КАК Плательщик,
		|	NULL КАК Сделка,
		|	РеализацияТоваров.Менеджер КАК Менеджер,
		|	РеализацияТоваров.ДоговорВзаиморасчетов.Наименование КАК ДокументОснованиеНаименование,
		|	РеализацияТоваров.ДокументОснование КАК ДокументОснование,
		|	РеализацияТоваров.ДокументОснование.Номер КАК ДокументОснованиеНомер,
		|	РеализацияТоваров.ДокументОснование.Дата КАК ДокументОснованиеДата,
		|	РеализацияТоваров.ПодразделениеКомпании КАК Подразделение,
		|	РеализацияТоваров.ВалютаДокумента КАК ВалютаДокумента,
		|	РеализацияТоваров.КурсДокумента КАК Курс,
		|	РеализацияТоваров.ТипЦен.ЦенаВключаетНДС КАК СуммаВключаетНДС,
		|	РеализацияТоваров.СкладКомпании.МОЛ КАК ОтпускПроизвел,
		|	РеализацияТоваров.Организация.ИНН КАК ИННпоставщика,
		|	РеализацияТоваров.Организация.КПП КАК КППпоставщика,
		|	РеализацияТоваров.Контрагент.ИНН КАК ИННпокупателя,
		|	РеализацияТоваров.Контрагент.КПП КАК КППпокупателя,
		|	РеализацияТоваров.ХозОперация КАК ХозОперация,
		|	РеализацияТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияТоваровКомиссия) КАК ЭтоКомиссия,
		|	ИСТИНА КАК Исправление,
		|	РеализацияТоваров.Ссылка КАК Ссылка,
		|	РеализацияТоваров.Дата КАК Дата,
		|	РеализацияТоваров.ВалютаДокумента.Код КАК КодВалюты,
		|	РеализацияТоваров.ВалютаДокумента.Наименование КАК НаименованиеВалюты,
		|	РеализацияТоваров.ВалютаДокумента.НаименованиеПолное КАК НаименованиеПолноеВалюты,
		|	РеализацияТоваров.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
		|	РеализацияТоваров.ДоговорВзаиморасчетов.ДатаНачала КАК ДатаДоговора,
		|	РеализацияТоваров.ДоговорВзаиморасчетов.НомерДоговора КАК НомерДоговора,
		|	РеализацияТоваров.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосударственногоКонтракта,
		|	РеализацияТоваров.НомерИсправления КАК НомерИсправления,
		|	РеализацияТоваров.Дата КАК ДатаИсправления,
		|	РеализацияТоваров.ДокументОснование.Грузоотправитель КАК Грузоотправитель,
		|	РеализацияТоваров.ДокументОснование.Грузополучатель КАК Грузополучатель,
		|	РеализацияТоваров.ДокументОснование.ТранспортноеСредство.НомерТС КАК НомерТС
		|ИЗ
		|	Документ.КорректировкаРеализации КАК РеализацияТоваров
		|ГДЕ
		|	РеализацияТоваров.Ссылка = &ТекущийДокумент"
	);
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	Шапка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);
	Шапка = ДополнитьДополнительнымиРеквизитамиИСведениями(Шапка, СсылкаНаОбъект);
	
	ТаблицаТоваровСчетФактуры = ТоварыИзСчетаФактуры(СсылкаНаОбъект);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.Количество * ТаблицаТоваров.Коэффициент КАК КоличествоБазовое,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения) КАК ЕдиницаИзмерения,
	|	ТаблицаТоваров.Коэффициент КАК Коэффициент,
	|	ТаблицаТоваров.Цена КАК Цена,
	|	ТаблицаТоваров.Сумма КАК Сумма,
	|	ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаТоваров.СуммаНДС КАК СуммаНДС,
	|	ТаблицаТоваров.СуммаВсего КАК СуммаВсего,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.ГТД КАК Справочник.ГТД) КАК ГТД,
	|	ТаблицаТоваров.Партия КАК Партия,
	|	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	0 КАК НомерСтроки
	|ПОМЕСТИТЬ ДанныеОТоварах
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровТовары.Номенклатура.ТипНоменклатуры.Весовой КАК ВесовойТовар,
	|	РеализацияТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	МАКСИМУМ(РеализацияТоваровТовары.GTIN) КАК GTIN,
	|	СУММА(РеализацияТоваровТовары.КоличествоМест) КАК КоличествоУпаковок,
	|	РеализацияТоваровТовары.Партия КАК Партия,
	|	РеализацияТоваровТовары.ГТД КАК ГТД,
	|	СУММА(РеализацияТоваровТовары.Количество * РеализацияТоваровТовары.Коэффициент) КАК КоличествоБазовое
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК РеализацияТоваровТовары
	|ГДЕ
	|	РеализацияТоваровТовары.Ссылка = &ТекущийДокумент
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровТовары.Номенклатура,
	|	РеализацияТоваровТовары.ХарактеристикаНоменклатуры,
	|	РеализацияТоваровТовары.Партия,
	|	РеализацияТоваровТовары.ГТД
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры УБЫВ,
	|	Партия УБЫВ,
	|	ГТД УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровТовары.НомерСтроки КАК НомерСтрокиИсходногоДокумента,
	|	РеализацияТоваровТовары.Номенклатура.Код КАК КодТовара,
	|	РеализацияТоваровТовары.Номенклатура.Артикул КАК Артикул,
	|	РеализацияТоваровТовары.Номенклатура.НаименованиеПолное КАК НаименованиеНоменклатуры,
	|	РеализацияТоваровТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	РеализацияТоваровТовары.Номенклатура.Код КАК КодНоменклатуры,
	|	РеализацияТоваровТовары.Номенклатура.КодТНВЭД КАК КодТНВЭД,
	|	РеализацияТоваровТовары.Количество КАК Количество,
	|	РеализацияТоваровТовары.КоличествоБазовое КАК КоличествоБазовое,
	|	РеализацияТоваровТовары.КоличествоБазовое КАК КоличествоНеРаспределено,
	|	РеализацияТоваровТовары.Цена * &Курс / &Кратность КАК Цена,
	|	РеализацияТоваровТовары.Сумма * &Курс / &Кратность КАК Сумма,
	|	РеализацияТоваровТовары.СуммаВсего * &Курс / &Кратность - РеализацияТоваровТовары.СуммаНДС * &Курс / &Кратность КАК СуммаБезНДС,
	|	РеализацияТоваровТовары.СуммаНДС * &Курс / &Кратность КАК СуммаНДС,
	|	РеализацияТоваровТовары.СуммаВсего * &Курс / &Кратность КАК СуммаСНДС,
	|	РеализацияТоваровТовары.СтавкаНДС КАК СтавкаНДС,
	|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровТовары.ХарактеристикаНоменклатуры) КАК НаименованиеХарактеристики,
	|	РеализацияТоваровТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	РеализацияТоваровТовары.Номенклатура.БазоваяЕдиницаИзмерения КАК БазоваяЕдиница,
	|	РеализацияТоваровТовары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК БазоваяЕдиницаКод,
	|	РеализацияТоваровТовары.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК БазоваяЕдиницаНаименование,
	|	РеализацияТоваровТовары.Номенклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК БазоваяЕдиницаНаименованиеПолное,
	|	РеализацияТоваровТовары.Номенклатура.БазоваяЕдиницаИзмерения.МеждународноеСокращение КАК БазоваяЕдиницаМеждународноеСокращение,
	|	РеализацияТоваровТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	РеализацияТоваровТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	РеализацияТоваровТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	РеализацияТоваровТовары.ЕдиницаИзмерения КАК Упаковка,
	|	РеализацияТоваровТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК УпаковкаКод,
	|	РеализацияТоваровТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование КАК УпаковкаНаименование,
	|	&ТекущийДокумент КАК Ссылка,
	|	"""" КАК ВидУпаковки,
	|	0 КАК СуммаСкидки,
	|	1 КАК Коэффициент,
	|	0 КАК КоличествоМест,
	|	0 КАК КоличествоВОдномМесте,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровТовары.ГТД = ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ""643""
	|		ИНАЧЕ РеализацияТоваровТовары.ГТД.Страна.Код
	|	КОНЕЦ КАК КодСтраныПроисхождения,
	|	РеализацияТоваровТовары.ГТД.Страна.Наименование КАК НаименованиеСтраныПроисхождения,
	|	РеализацияТоваровТовары.ГТД.Наименование КАК НомерТаможеннойДекларации,
	|	РеализацияТоваровТовары.ГТД КАК ГТД,
	|	РеализацияТоваровТовары.Партия КАК Партия,
	|	ВЫРАЗИТЬ("""" КАК Строка(14)) КАК GTIN,
	|	0 КАК КоличествоУпаковок
	|ИЗ
	|	ДанныеОТоварах КАК РеализацияТоваровТовары
	|ГДЕ
	|	РеализацияТоваровТовары.Номенклатура Ссылка Справочник.Номенклатура
	|";
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, Шапка.Дата);
	Запрос.УстановитьПараметр("Курс", КурсВалюты.Курс);
	Запрос.УстановитьПараметр("Кратность", КурсВалюты.Кратность);
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваровСчетФактуры);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ТаблицаРеализации = ПакетЗапросов[ПакетЗапросов.Количество()-2].Выгрузить();
	ТаблицаТоваров    = ПакетЗапросов[ПакетЗапросов.Количество()-1].Выгрузить();
	
	Для Каждого ТекущаяСтрока Из ТаблицаРеализации Цикл
		
		Если ТекущаяСтрока.КоличествоУпаковок>0 Тогда
		ИначеЕсли ТекущаяСтрока.ВесовойТовар Тогда
		Иначе
			ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.КоличествоБазовое;
		КонецЕсли;
		
		КомбинацииПоиска = ТорговыйКомплексКлиентСервер.ПолучитьКомбинацииПоиска(ТекущаяСтрока, "Номенклатура", "ХарактеристикаНоменклатуры,Партия,ГТД");
		
		КоличествоБазовое  = ТекущаяСтрока.КоличествоБазовое;
		КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок;
		ПоследняяСтрока    = Неопределено;
		Для Каждого ПараметрыПоиска Из КомбинацииПоиска Цикл
			
			Если КоличествоБазовое = 0 Тогда
				Прервать;
			КонецЕсли;
			
			НайденныеСтроки = ТаблицаТоваров.НайтиСтроки(ПараметрыПоиска);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				Если КоличествоБазовое = 0 Тогда
					Прервать;
				КонецЕсли;
				
				Если НайденнаяСтрока.КоличествоБазовое = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если НайденнаяСтрока.КоличествоНеРаспределено = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ПоследняяСтрока = НайденнаяСтрока;
				НайденнаяСтрока.GTIN = ТекущаяСтрока.GTIN;
				Если НайденнаяСтрока.КоличествоНеРаспределено >= КоличествоБазовое Тогда
					
					НайденнаяСтрока.КоличествоУпаковок       = НайденнаяСтрока.КоличествоУпаковок + КоличествоУпаковок;
					НайденнаяСтрока.КоличествоНеРаспределено = НайденнаяСтрока.КоличествоНеРаспределено - КоличествоБазовое;
					
					КоличествоБазовое  = 0;
					КоличествоУпаковок = 0;
					
					Прервать;
				Иначе
					
					КоличествоУпаковокСтроки = Макс(1, Цел(КоличествоУпаковок*НайденнаяСтрока.КоличествоНеРаспределено/КоличествоБазовое));
					НайденнаяСтрока.КоличествоУпаковок       = НайденнаяСтрока.КоличествоУпаковок + КоличествоУпаковокСтроки;
					НайденнаяСтрока.КоличествоНеРаспределено = 0;
					
					КоличествоБазовое  = КоличествоБазовое - НайденнаяСтрока.КоличествоНеРаспределено;
					КоличествоУпаковок = КоличествоУпаковок - КоличествоУпаковокСтроки;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		Если КоличествоБазовое=0 И КоличествоУпаковок>0 И (НЕ ПоследняяСтрока = Неопределено) Тогда
			ПоследняяСтрока.КоличествоУпаковок = ПоследняяСтрока.КоличествоУпаковок + КоличествоУпаковок;
		КонецЕсли;
		
	КонецЦикла;
	
	Товары = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТоваров);
	
	КодыУпаковокМаркируемойПродукции = Документы
		.КорректировкаРеализации
		.ПолучитьКодыМаркируемойПродукции(СсылкаНаОбъект);
	
	КодыУпаковокТовараБезИдентификатора = Документы
		.КорректировкаРеализации
		.ПолучитьКодыМаркировкиТовараБезИдентификатора(СсылкаНаОбъект);
	
	ПрослеживаемыеТовары = УправлениеДиалогомДокументаСервер.РНПТПрослеживаемыхТоваров(Шапка.Ссылка);
	Шапка = ДополнитьДанныеДокументаОтгрузки(Шапка, Товары, СсылкаНаОбъект);
	
	ОсобенностиУчета = Документы.СчетФактураВыданный.ПолучитьОсобенностиУчетаТоваров(ТаблицаТоваров);
	
	Результат = Новый Структура();
	Результат.Вставить("Шапка",  Шапка);
	Результат.Вставить("Товары", Товары);
	Результат.Вставить("ОсобенностиУчета", ОсобенностиУчета);
	Результат.Вставить("КодыУпаковокМаркируемойПродукции",    КодыУпаковокМаркируемойПродукции);
	Результат.Вставить("КодыУпаковокТовараБезИдентификатора", КодыУпаковокТовараБезИдентификатора);
	Результат.Вставить("ПрослеживаемыеТовары",                ПрослеживаемыеТовары);
	
	Возврат Результат;
	
КонецФункции

Функция ДайДанныеРеализацииТоваровИУслугДляУПД(СсылкаНаОбъект)
	
	Если СсылкаНаОбъект.Пустая() Тогда
		
		ВызватьИсключение НСтр("ru = 'Не указан документ для выгрузки в ЭДО'");
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеализацияТоваров.Номер КАК Номер,
		|	РеализацияТоваров.Номер КАК НомерПоДаннымКлиента,
		|	РеализацияТоваров.Дата КАК ДатаДокумента,
		|	РеализацияТоваров.Дата КАК ДатаПоДаннымКлиента,
		|	РеализацияТоваров.Организация КАК Организация,
		|	РеализацияТоваров.Организация КАК ЮрФизЛицо,
		|	РеализацияТоваров.Организация КАК Поставщик,
		|	РеализацияТоваров.Контрагент КАК Покупатель,
		|	РеализацияТоваров.Контрагент КАК Плательщик,
		|	NULL КАК Сделка,
		|	РеализацияТоваров.Менеджер КАК Менеджер,
		|	РеализацияТоваров.ДоговорВзаиморасчетов.Наименование КАК ДокументОснованиеНаименование,
		|	РеализацияТоваров.ДокументОснование КАК ДокументОснование,
		|	РеализацияТоваров.ДокументОснование.Номер КАК ДокументОснованиеНомер,
		|	РеализацияТоваров.ДокументОснование.Дата КАК ДокументОснованиеДата,
		|	РеализацияТоваров.ПодразделениеКомпании КАК Подразделение,
		|	РеализацияТоваров.ВалютаДокумента КАК ВалютаДокумента,
		|	РеализацияТоваров.КурсДокумента КАК Курс,
		|	РеализацияТоваров.ТипЦен.ЦенаВключаетНДС КАК СуммаВключаетНДС,
		|	РеализацияТоваров.СкладКомпании.МОЛ КАК ОтпускПроизвел,
		|	РеализацияТоваров.Организация.ИНН КАК ИННпоставщика,
		|	РеализацияТоваров.Организация.КПП КАК КППпоставщика,
		|	РеализацияТоваров.Контрагент.ИНН КАК ИННпокупателя,
		|	РеализацияТоваров.Контрагент.КПП КАК КППпокупателя,
		|	РеализацияТоваров.ХозОперация КАК ХозОперация,
		|	РеализацияТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияТоваровКомиссия) КАК ЭтоКомиссия,
		|	ЛОЖЬ КАК Исправление,
		|	РеализацияТоваров.Ссылка КАК Ссылка,
		|	РеализацияТоваров.Дата КАК Дата,
		|	РеализацияТоваров.ВалютаДокумента.Код КАК КодВалюты,
		|	РеализацияТоваров.ВалютаДокумента.Наименование КАК НаименованиеВалюты,
		|	РеализацияТоваров.ВалютаДокумента.НаименованиеПолное КАК НаименованиеПолноеВалюты,
		|	РеализацияТоваров.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
		|	РеализацияТоваров.ДоговорВзаиморасчетов.ДатаНачала КАК ДатаДоговора,
		|	РеализацияТоваров.ДоговорВзаиморасчетов.НомерДоговора КАК НомерДоговора,
		|	РеализацияТоваров.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосударственногоКонтракта,
		|	РеализацияТоваров.Грузоотправитель КАК Грузоотправитель,
		|	РеализацияТоваров.Грузополучатель КАК Грузополучатель,
		|	РеализацияТоваров.ТранспортноеСредство.НомерТС КАК НомерТС
		|ИЗ
		|	Документ.РеализацияТоваров КАК РеализацияТоваров
		|ГДЕ
		|	РеализацияТоваров.Ссылка = &ТекущийДокумент"
	);
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);
	Шапка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);
	Шапка = ДополнитьДополнительнымиРеквизитамиИСведениями(Шапка, СсылкаНаОбъект);
	
	ТаблицаТоваровСчетФактуры = ТоварыИзСчетаФактуры(СсылкаНаОбъект);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.Количество * ТаблицаТоваров.Коэффициент КАК КоличествоБазовое,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения) КАК ЕдиницаИзмерения,
	|	ТаблицаТоваров.Коэффициент КАК Коэффициент,
	|	ТаблицаТоваров.Цена КАК Цена,
	|	ТаблицаТоваров.Сумма КАК Сумма,
	|	ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаТоваров.СуммаНДС КАК СуммаНДС,
	|	ТаблицаТоваров.СуммаВсего КАК СуммаВсего,
	|	ТаблицаТоваров.Партия КАК Партия,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.ГТД КАК Справочник.ГТД) КАК ГТД,
	|	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ДанныеОТоварах
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровТовары.Номенклатура.ТипНоменклатуры.Весовой КАК ВесовойТовар,
	|	РеализацияТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	МАКСИМУМ(РеализацияТоваровТовары.GTIN) КАК GTIN,
	|	СУММА(РеализацияТоваровТовары.КоличествоМест) КАК КоличествоУпаковок,
	|	РеализацияТоваровТовары.Партия КАК Партия,
	|	РеализацияТоваровТовары.ГТД КАК ГТД,
	|	СУММА(РеализацияТоваровТовары.Количество * РеализацияТоваровТовары.Коэффициент) КАК КоличествоБазовое
	|ИЗ
	|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	|ГДЕ
	|	РеализацияТоваровТовары.Ссылка = &ТекущийДокумент
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровТовары.Номенклатура,
	|	РеализацияТоваровТовары.ХарактеристикаНоменклатуры,
	|	РеализацияТоваровТовары.Партия,
	|	РеализацияТоваровТовары.ГТД
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры УБЫВ,
	|	Партия УБЫВ,
	|	ГТД УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровТовары.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровТовары.НомерСтроки КАК НомерСтрокиИсходногоДокумента,
	|	РеализацияТоваровТовары.Номенклатура.Код КАК КодТовара,
	|	РеализацияТоваровТовары.Номенклатура.Артикул КАК Артикул,
	|	РеализацияТоваровТовары.Номенклатура.НаименованиеПолное КАК НаименованиеНоменклатуры,
	|	РеализацияТоваровТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровТовары.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	РеализацияТоваровТовары.Номенклатура.Код КАК КодНоменклатуры,
	|	РеализацияТоваровТовары.Номенклатура.КодТНВЭД КАК КодТНВЭД,
	|	РеализацияТоваровТовары.Количество КАК Количество,
	|	РеализацияТоваровТовары.КоличествоБазовое КАК КоличествоБазовое,
	|	РеализацияТоваровТовары.КоличествоБазовое КАК КоличествоНеРаспределено,
	|	РеализацияТоваровТовары.Цена * &Курс / &Кратность КАК Цена,
	|	РеализацияТоваровТовары.Сумма * &Курс / &Кратность КАК Сумма,
	|	РеализацияТоваровТовары.СуммаВсего * &Курс / &Кратность - РеализацияТоваровТовары.СуммаНДС * &Курс / &Кратность КАК СуммаБезНДС,
	|	РеализацияТоваровТовары.СуммаНДС * &Курс / &Кратность КАК СуммаНДС,
	|	РеализацияТоваровТовары.СуммаВсего * &Курс / &Кратность КАК СуммаСНДС,
	|	РеализацияТоваровТовары.СтавкаНДС КАК СтавкаНДС,
	|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровТовары.ХарактеристикаНоменклатуры) КАК НаименованиеХарактеристики,
	|	РеализацияТоваровТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	РеализацияТоваровТовары.Номенклатура.БазоваяЕдиницаИзмерения КАК БазоваяЕдиница,
	|	РеализацияТоваровТовары.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК БазоваяЕдиницаКод,
	|	РеализацияТоваровТовары.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК БазоваяЕдиницаНаименование,
	|	РеализацияТоваровТовары.Номенклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК БазоваяЕдиницаНаименованиеПолное,
	|	РеализацияТоваровТовары.Номенклатура.БазоваяЕдиницаИзмерения.МеждународноеСокращение КАК БазоваяЕдиницаМеждународноеСокращение,
	|	РеализацияТоваровТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	РеализацияТоваровТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	РеализацияТоваровТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование КАК ЕдиницаИзмеренияНаименование,
	|	РеализацияТоваровТовары.ЕдиницаИзмерения КАК Упаковка,
	|	РеализацияТоваровТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК УпаковкаКод,
	|	РеализацияТоваровТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование КАК УпаковкаНаименование,
	|	&ТекущийДокумент КАК Ссылка,
	|	"""" КАК ВидУпаковки,
	|	0 КАК СуммаСкидки,
	|	1 КАК Коэффициент,
	|	0 КАК КоличествоМест,
	|	0 КАК КоличествоВОдномМесте,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровТовары.ГТД = ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	|			ТОГДА ""643""
	|		ИНАЧЕ РеализацияТоваровТовары.ГТД.Страна.Код
	|	КОНЕЦ КАК КодСтраныПроисхождения,
	|	РеализацияТоваровТовары.ГТД.Страна.Наименование КАК НаименованиеСтраныПроисхождения,
	|	РеализацияТоваровТовары.ГТД.Наименование КАК НомерТаможеннойДекларации,
	|	РеализацияТоваровТовары.ГТД КАК ГТД,
	|	РеализацияТоваровТовары.Партия КАК Партия,
	|	ВЫРАЗИТЬ("""" КАК Строка(14)) КАК GTIN,
	|	0 КАК КоличествоУпаковок
	|ИЗ
	|	ДанныеОТоварах КАК РеализацияТоваровТовары
	|";
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, Шапка.Дата);
	Запрос.УстановитьПараметр("Курс", КурсВалюты.Курс);
	Запрос.УстановитьПараметр("Кратность", КурсВалюты.Кратность);
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваровСчетФактуры);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ТаблицаРеализации = ПакетЗапросов[ПакетЗапросов.Количество()-2].Выгрузить();
	ТаблицаТоваров    = ПакетЗапросов[ПакетЗапросов.Количество()-1].Выгрузить();
	
	Для Каждого ТекущаяСтрока Из ТаблицаРеализации Цикл
		
		Если ТекущаяСтрока.КоличествоУпаковок>0 Тогда
		ИначеЕсли ТекущаяСтрока.ВесовойТовар Тогда
		Иначе
			ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.КоличествоБазовое;
		КонецЕсли;
		
		КомбинацииПоиска = ТорговыйКомплексКлиентСервер.ПолучитьКомбинацииПоиска(ТекущаяСтрока, "Номенклатура", "ХарактеристикаНоменклатуры,Партия,ГТД");
		
		КоличествоБазовое  = ТекущаяСтрока.КоличествоБазовое;
		КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок;
		ПоследняяСтрока    = Неопределено;
		Для Каждого ПараметрыПоиска Из КомбинацииПоиска Цикл
			
			Если КоличествоБазовое = 0 Тогда
				Прервать;
			КонецЕсли;
			
			НайденныеСтроки = ТаблицаТоваров.НайтиСтроки(ПараметрыПоиска);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				Если КоличествоБазовое = 0 Тогда
					Прервать;
				КонецЕсли;
				
				Если НайденнаяСтрока.КоличествоБазовое = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если НайденнаяСтрока.КоличествоНеРаспределено = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ПоследняяСтрока = НайденнаяСтрока;
				НайденнаяСтрока.GTIN = ТекущаяСтрока.GTIN;
				Если НайденнаяСтрока.КоличествоНеРаспределено >= КоличествоБазовое Тогда
					
					НайденнаяСтрока.КоличествоУпаковок       = НайденнаяСтрока.КоличествоУпаковок + КоличествоУпаковок;
					НайденнаяСтрока.КоличествоНеРаспределено = НайденнаяСтрока.КоличествоНеРаспределено - КоличествоБазовое;
					
					КоличествоБазовое  = 0;
					КоличествоУпаковок = 0;
					
					Прервать;
				Иначе
					
					КоличествоУпаковокСтроки = Макс(1, Цел(КоличествоУпаковок*НайденнаяСтрока.КоличествоНеРаспределено/КоличествоБазовое));
					НайденнаяСтрока.КоличествоУпаковок       = НайденнаяСтрока.КоличествоУпаковок + КоличествоУпаковокСтроки;
					НайденнаяСтрока.КоличествоНеРаспределено = 0;
					
					КоличествоБазовое  = КоличествоБазовое - НайденнаяСтрока.КоличествоНеРаспределено;
					КоличествоУпаковок = КоличествоУпаковок - КоличествоУпаковокСтроки;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		Если КоличествоБазовое=0 И КоличествоУпаковок>0 И (НЕ ПоследняяСтрока = Неопределено) Тогда
			ПоследняяСтрока.КоличествоУпаковок = ПоследняяСтрока.КоличествоУпаковок + КоличествоУпаковок;
		КонецЕсли;
		
	КонецЦикла;
	
	Товары = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТоваров);
	
	КодыУпаковокМаркируемойПродукции = Документы
		.РеализацияТоваров
		.ПолучитьКодыМаркируемойПродукции(СсылкаНаОбъект);
	
	КодыУпаковокТовараБезИдентификатора = Документы
		.РеализацияТоваров
		.ПолучитьКодыМаркировкиТовараБезИдентификатора(СсылкаНаОбъект);
	
	ПрослеживаемыеТовары = УправлениеДиалогомДокументаСервер.РНПТПрослеживаемыхТоваров(Шапка.Ссылка);
	Шапка = ДополнитьДанныеДокументаОтгрузки(Шапка, Товары, СсылкаНаОбъект);
	
	ОсобенностиУчета = Документы.СчетФактураВыданный.ПолучитьОсобенностиУчетаТоваров(ТаблицаТоваров);
	
	Результат = Новый Структура();
	Результат.Вставить("Шапка",  Шапка);
	Результат.Вставить("Товары", Товары);
	Результат.Вставить("ОсобенностиУчета", ОсобенностиУчета);
	Результат.Вставить("КодыУпаковокМаркируемойПродукции",    КодыУпаковокМаркируемойПродукции);
	Результат.Вставить("КодыУпаковокТовараБезИдентификатора", КодыУпаковокТовараБезИдентификатора);
	Результат.Вставить("ПрослеживаемыеТовары",                ПрослеживаемыеТовары);
	
	Возврат Результат;
	
КонецФункции

Процедура РазделитьСтрокуТовараУПД(Товары, СтрокаКРазделению)
	
	ИсключатьСвойства = "Количество, Сумма, СуммаВсего, СуммаНДС, СведенияОПрослеживаемости";
	
	ЕстьКоличествоПоНакладной = КолонкаСуществует(Товары, "КоличествоПоНакладной");
	ЕстьКоличествоБазовое = КолонкаСуществует(Товары, "КоличествоБазовое");
	
	Если ЕстьКоличествоПоНакладной Тогда
		
		ИсключатьСвойства = ИсключатьСвойства + ", КоличествоПоНакладной";
		
	КонецЕсли;
	
	Если ЕстьКоличествоБазовое Тогда
	
		ИсключатьСвойства = ИсключатьСвойства + ", КоличествоБазовое";
	
	КонецЕсли;
	
	
	ОбщееКоличество = СтрокаКРазделению.Количество;
	ЭтоПерваяСтрока = Истина;
	
	Для Каждого СтрокаРНПТ Из СтрокаКРазделению.СведенияОПрослеживаемости Цикл
		
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКРазделению,, ИсключатьСвойства);
		НоваяСтрока.Количество = СтрокаРНПТ.Количество;
		
		Если ЕстьКоличествоПоНакладной Тогда
			
			НоваяСтрока.КоличествоПоНакладной = НоваяСтрока.Количество;
			
		КонецЕсли;
		
		Если ЕстьКоличествоБазовое Тогда
		
			НоваяСтрока.КоличествоБазовое = НоваяСтрока.Количество;
		
		КонецЕсли;
		
		НоваяСтрока.Сумма = НоваяСтрока.Количество * СтрокаКРазделению.Цена;
		НоваяСтрока.ГТД = СтрокаРНПТ.РНПТ;
		
		Если ОбщееКоличество > 0 И НоваяСтрока.Количество > 0 Тогда
			
			СуммаНДС = СтрокаКРазделению.СуммаНДС / ОбщееКоличество * НоваяСтрока.Количество;
			
		Иначе
			
			СуммаНДС = 0;
			
		КонецЕсли;
		
		НоваяСтрока.СуммаНДС = СуммаНДС;
		НоваяСтрока.СуммаВсего = НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС; 
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОбстоятельстваФормированияСФ(Документ)
	
	ОбстоятельстваФормирования = "1";
	
	Если ЕстьРеквизит(Документ, "ЭтоКомиссия")
		И Документ.ЭтоКомиссия Тогда
		
		Если (ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный")
			И ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.ВозвратПоставщику"))
			ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
			ОбстоятельстваФормирования = "5";
		ИначеЕсли (ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный")
			И ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваров"))
			ИЛИ ТипЗнч(Документ.Ссылка) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
			ОбстоятельстваФормирования = "4";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОбстоятельстваФормирования;
	
КонецФункции

#КонецОбласти

#Область Получение

Процедура НайтиСоздатьУПДДокументОПередаче_2019(ДеревоДанных, СсылкаНаВладельца, Записывать, СпособОбработки, ОписаниеОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеЗаполнения = Новый Структура("ЗаполнятьПоСтуктуре", Истина);
	ДополнитьДанныеЗаполненияВалютой(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияВходящимДокументом("Документа", ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияИсправлением(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияКонтрагентомИсточникТаблица(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОрганизациейИсточникТаблица(ДеревоДанных, ДанныеЗаполнения); 
	ДополнитьДанныеЗаполненияГрузотправителемИсточникТаблица(ДеревоДанных, ДанныеЗаполнения); 
	ДополнитьДанныеЗаполненияГрузополучателемИсточникТаблица(ДеревоДанных, ДанныеЗаполнения); 
	ДополнитьДанныеЗаполненияПодразделениемКомпании(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияДоговорВзаиморасчетов(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОснованиемДокументаОтгрузки(ДеревоДанных, ДанныеЗаполнения);
	
	Если СпособОбработки = "ВозвратТоваровОтПокупателя" Тогда
		
		ДополнитьДанныеЗаполненияТоварами(ДеревоДанных, ДанныеЗаполнения, "ВозвратОтПокупателя");
		
		Если ЭтоУПДОтКоммитента(ДеревоДанных) Тогда
			
			ДанныеЗаполнения.Вставить("ХозОперация", Справочники.ХозОперации.ВозвратТоваровОтПокупателяКомиссия);
			
		Иначе
			
			ДанныеЗаполнения.Вставить("ХозОперация", Справочники.ХозОперации.ВозвратТоваровОтПокупателя);
			
		КонецЕсли;
		
		ЗаполнитьДокументВозвратТоваровОтПокупателя(ДанныеЗаполнения, СсылкаНаВладельца, Записывать, ОписаниеОшибки);
		
	Иначе
		
		Если ДанныеЗаполнения.Исправление Тогда
			
			ДополнитьДанныеЗаполненияТоварами(ДеревоДанных, ДанныеЗаполнения);
			ЗаполнитьДокументКорректировкиПоступления(ДанныеЗаполнения, СсылкаНаВладельца, ОписаниеОшибки);
			
		Иначе
			
			Если ЭтоУПДОтКоммитента(ДеревоДанных) Тогда
				
				ДанныеЗаполнения.Вставить("ХозОперация", Справочники.ХозОперации.ПоступлениеТоваровКомиссия);
				
			Иначе
				
				ДанныеЗаполнения.Вставить("ХозОперация", Справочники.ХозОперации.ПоступлениеТоваров);
				
			КонецЕсли;
			
			ДополнитьДанныеЗаполненияТоварами(ДеревоДанных, ДанныеЗаполнения);
			ЗаполнитьДокументПоступленияТоваров(ДанныеЗаполнения, СсылкаНаВладельца, Записывать, ОписаниеОшибки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	//// Поиск и заполнение договора контрагента.
	//ОснованияОтгрузки = ДеревоДанных.Строки.Найти("ОснованиеОтгрузкиТоваров", "ПолныйПуть");
	//Если ОснованияОтгрузки <> Неопределено Тогда
	//	Для Каждого СтрокаОснованиеОтгрузки Из ОснованияОтгрузки.Строки Цикл
	//		ДоговорНомер = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СтрокаОснованиеОтгрузки, "ОснованиеОтгрузкиТоваров.НомерСтроки.ДокументНомер");
	//		Если ЗначениеЗаполнено(ДоговорНомер) Тогда
	//			
	//			ДоговорДата = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
	//				СтрокаОснованиеОтгрузки, "ОснованиеОтгрузкиТоваров.НомерСтроки.ДокументДата");
	//			
	//			СвойстваДоговора = Новый Структура;
	//			СвойстваДоговора.Вставить("НомерДоговора", ДоговорНомер);
	//			СвойстваДоговора.Вставить("ДатаДоговора", ДоговорДата);
	//			СвойстваДоговора.Вставить("Организация", ДокументОбъект.Организация);
	//			СвойстваДоговора.Вставить("Владелец", ДокументОбъект.Контрагент);
	//			
	//			ДоговорКонтрагента = ЭлектронноеВзаимодействие.НайтиСсылку("ДоговорыКонтрагентов",, СвойстваДоговора);
	//			ДокументОбъект.ДоговорКонтрагента = ДоговорКонтрагента;
	//			
	//		КонецЕсли;
	//		Прервать;
	//	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры

Процедура НайтиСоздатьУПДСчетФактуру_2019(ДеревоДанных, СсылкаНаВладельца, СпособОбработки, ОписаниеОшибки, ПараметрыДляОтраженияВУчете)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеЗаполнения = Новый Структура("ЗаполнятьПоСтуктуре", Истина);
	ДополнитьДанныеЗаполненияВалютой(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияИсправлением(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияВходящимДокументом("Документа", ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияКонтрагентомИсточникТаблица(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОрганизациейИсточникТаблица(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияГрузотправителемИсточникТаблица(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияГрузополучателемИсточникТаблица(ДеревоДанных, ДанныеЗаполнения); 
	ДополнитьДанныеЗаполненияПодразделениемКомпании(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияДоговорВзаиморасчетов(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияВидомСчетаФактуры(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОснованиемДляСчетаФактуры(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияТоварами(ДеревоДанных, ДанныеЗаполнения, "СчетФактураПолученный");
	
	ЗаполнитьДокументСчетФактурыПолученого(ДанныеЗаполнения, СсылкаНаВладельца, ОписаниеОшибки);
	
КонецПроцедуры

#Область ПодготовкаДанныхДокументовКЗагрузке

Процедура ДополнитьДанныеЗаполненияВалютой(ДеревоДанных, ДанныеЗаполнения, Путь = "ВалютаКод") Экспорт
	
	КодВалюты = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь);
	Валюта = Неопределено;
	ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект("Валюты", Валюта, КодВалюты);
	ДанныеЗаполнения.Вставить("ВалютаДокумента", Валюта);
	
	Если ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОСчетеФактуре.Валюта") = Истина Тогда
		Курс = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных,
			"СведенияОСчетеФактуре.Валюта.Курс", Ложь);
	Иначе
		Курс = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных,
			"ДополнительныеСведенияОбУчастниках.ВалютаКурс", Ложь);
	КонецЕсли;
	ДанныеЗаполнения.Вставить("Курс", ?(ЗначениеЗаполнено(Курс), Курс, 1));
	ДанныеЗаполнения.Вставить("Кратность", 1);
	
КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияВходящимДокументом(ПостфиксПутиКДанным, ДеревоДанных, ДанныеЗаполнения, ПрефиксПутиКДанным = "") Экспорт
	
	НомерВходящегоДокумента = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
		ДеревоДанных,
		ПрефиксПутиКДанным+"Номер" + ПостфиксПутиКДанным
	);
	ДатаВходящегоДокумента = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
		ДеревоДанных,
		ПрефиксПутиКДанным+"Дата" + ПостфиксПутиКДанным
	);
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Исправление", Ложь) Тогда
		
		НомерИсправления = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "НомерИсправления", 1);
		ДанныеЗаполнения.Вставить("ВхДокНомер",
			СтрШаблон("%1 (испр. %2)", НомерВходящегоДокумента, НомерИсправления));
		ДанныеЗаполнения.Вставить("ВхСФНомер",
			СтрШаблон("%1 (испр. %2)", НомерВходящегоДокумента, НомерИсправления));
		
	Иначе
	
		ДанныеЗаполнения.Вставить("ВхДокНомер", НомерВходящегоДокумента);
		ДанныеЗаполнения.Вставить("ВхСФНомер",  НомерВходящегоДокумента);
		
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("ВхДокДата", ДатаВходящегоДокумента);
	ДанныеЗаполнения.Вставить("ВхСФДата",  ДатаВходящегоДокумента);
	
КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияИсправлением(ДеревоДанных, ДанныеЗаполнения, ПрефиксПутиКДанным = "") Экспорт
	
	ДанныеЗаполнения.Вставить("Исправление", Ложь);
	
	НомерИсправления = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
		ДеревоДанных,
		ПрефиксПутиКДанным+"НомерИсправления"
	);
	
	Если ЗначениеЗаполнено(НомерИсправления) Тогда
		
		ДанныеЗаполнения.Исправление = Истина;
		ДанныеЗаполнения.Вставить("НомерИсправления", НомерИсправления);
		ДатаИсправления = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			ДеревоДанных,
			ПрефиксПутиКДанным+"ДатаИсправления"
		);
		ДанныеЗаполнения.Вставить("ДатаИсправления", ДатаИсправления);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияИсходнымДокументом(ДеревоДанных, ДанныеЗаполнения)
	
	ДанныеЗаполнения.Вставить("Корректировочный", Ложь);
	ДанныеЗаполнения.Вставить("УчитыватьИсправлениеИсходногоДокумента", Ложь);
	
	ИсходныеДокументы = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(ДеревоДанных, "ИсходныеДокументы");
	
	Если ЗначениеЗаполнено(ИсходныеДокументы) Тогда
		
		ДанныеЗаполнения.Вставить("Корректировочный", Истина);
		ДанныеЗаполнения.Вставить("НомерИсходногоДокумента", ИсходныеДокументы[0].НомерИсходногоДокумента);
		ДанныеЗаполнения.Вставить("ДатаИсходногоДокумента", ИсходныеДокументы[0].ДатаИсходногоДокумента);
		
		Если ЗначениеЗаполнено(ИсходныеДокументы[0].ИсправленияИсходногоДокумента) Тогда
			
			ДанныеЗаполнения.Вставить("УчитыватьИсправлениеИсходногоДокумента", Истина);
			ДанныеЗаполнения.Вставить(
				"НомерИсправленияИсходногоДокумента",
				ИсходныеДокументы[0].ИсправленияИсходногоДокумента[0].НомерИсправленияИсходногоДокумента
			);
			ДанныеЗаполнения.Вставить(
				"ДатаИсправленияИсходногоДокумента",
				ИсходныеДокументы[0].ИсправленияИсходногоДокумента[0].ДатаИсправленияИсходногоДокумента
			);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияКонтрагентомИсточникТаблица(ДеревоДанных, ДанныеЗаполнения, Путь = "СведенияОПродавце",
	ПутьКСтроке = "СведенияОПродавце.НомерСтроки", ПоискВложенных = Ложь) Экспорт
	
	СведенияОПродавцах = ДеревоДанных.Строки.Найти(Путь, "ПолныйПуть", ПоискВложенных);
	
	Если СведенияОПродавцах.Строки.Количество() > 1 Тогда
		
		ТекстИсключения = СтрШаблон(
			НСтр("ru = 'Ошибка загрузки электронной товарной накладной %1 от %2.
			|Загрузка сводных накладных не поддерживается.'"), 
			ДанныеЗаполнения.ВхДокНомер,
			Формат(ДанныеЗаполнения.ВхДокДата, "ДЛФ=D")
		);
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
	СведенияОПродавце = СведенияОПродавцах.Строки[0];
	
	ИНН = "";
	КПП = "";
	
	ТипУчастника = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
		СведенияОПродавце,
		ПутьКСтроке + ".ТипУчастника"
	);
	
	Если ТипУчастника = "ЮЛ" Тогда
		
		ИНН = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОПродавце,
			ПутьКСтроке + ".ТипУчастника.ЮЛ.ИНН"
		);
		КПП = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОПродавце,
			ПутьКСтроке + ".ТипУчастника.ЮЛ.КПП"
		);
		
	ИначеЕсли ТипУчастника = "ИП" Тогда
		
		ИНН = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОПродавце,
			ПутьКСтроке + ".ТипУчастника.ИП.ИНН"
		);
		
	ИначеЕсли ТипУчастника = "ФЛ" Тогда
		
		ИНН = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОПродавце,
			ПутьКСтроке + ".ТипУчастника.ФЛ.ИНН"
		);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("Контрагент_ИНН", ИНН);
	ДанныеЗаполнения.Вставить("Контрагент_КПП", КПП);
	ДанныеЗаполнения.Вставить("Контрагент", ИнтеграцияЭДО.СсылкаНаОбъектПоИННКПП("Контрагенты", ИНН, КПП));
	
КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияКонтрагентомИсточникГруппа(ДеревоДанных,
                                                              ДанныеЗаполнения,
                                                              Префикс = "СведенияОПродавце")
	
	ИНН = "";
	КПП = "";
	ТипУчастника = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, Префикс + ".ТипУчастника");
	
	Если ТипУчастника = "ЮЛ" Тогда
		
		ИНН = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, Префикс + ".ТипУчастника.ЮЛ.ИНН");
		КПП = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, Префикс + ".ТипУчастника.ЮЛ.КПП");
		
	ИначеЕсли ТипУчастника = "ИП" Тогда
		
		ИНН = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, Префикс + ".ТипУчастника.ИП.ИНН");
		
	ИначеЕсли ТипУчастника = "ФЛ" Тогда
		
		ИНН = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, Префикс + ".ТипУчастника.ФЛ.ИНН");
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("Контрагент_ИНН", ИНН);
	ДанныеЗаполнения.Вставить("Контрагент_КПП", КПП);
	ДанныеЗаполнения.Вставить("Контрагент", ИнтеграцияЭДО.СсылкаНаОбъектПоИННКПП("Контрагенты", ИНН, КПП));
	
КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияГрузотправителемИсточникТаблица(ДеревоДанных, ДанныеЗаполнения, Путь = "СведенияОГрузоотправителе",
	ПоискВложенных = Ложь) Экспорт
	
	СведенияОГрузоотправителях = ДеревоДанных.Строки.Найти(Путь, "ПолныйПуть", ПоискВложенных);
	
	Если СведенияОГрузоотправителях.Строки.Количество() > 1 Тогда
		
		ТекстИсключения = СтрШаблон(
			НСтр("ru = 'Ошибка загрузки электронной товарной накладной %1 от %2.
			|Загрузка сводных накладных не поддерживается.'"), 
			ДанныеЗаполнения.ВхДокНомер,
			Формат(ДанныеЗаполнения.ВхДокДата, "ДЛФ=D")
		);
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
	СведенияОГрузоотправителе = СведенияОГрузоотправителях.Строки[0];
	
	ИНН = "";
	КПП = "";
	
	ТипУчастника = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
		СведенияОГрузоотправителе,
		Путь + ".НомерСтроки.Грузоотправитель.ТипУчастника"
	);
	
	Если ТипУчастника = "ЮЛ" Тогда
		
		ИНН = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОГрузоотправителе,
			Путь + ".НомерСтроки.Грузоотправитель.ТипУчастника.ЮЛ.ИНН"
		);
		КПП = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОГрузоотправителе,
			Путь + ".НомерСтроки.Грузоотправитель.ТипУчастника.ЮЛ.КПП"
		);
		
	ИначеЕсли ТипУчастника = "ИП" Тогда
		
		ИНН = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОГрузоотправителе,
			Путь + ".НомерСтроки.Грузоотправитель.ТипУчастника.ИП.ИНН"
		);
		
	ИначеЕсли ТипУчастника = "ФЛ" Тогда
		
		ИНН = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОГрузоотправителе,
			Путь + ".НомерСтроки.Грузоотправитель.ТипУчастника.ФЛ.ИНН"
		);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("Грузоотправитель_ИНН", ИНН);
	ДанныеЗаполнения.Вставить("Грузоотправитель_КПП", КПП);
	ДанныеЗаполнения.Вставить("Грузоотправитель", ИнтеграцияЭДО.СсылкаНаОбъектПоИННКПП("Контрагенты", ИНН, КПП));
	
КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияГрузополучателемИсточникТаблица(ДеревоДанных, ДанныеЗаполнения, Путь = "СведенияОГрузополучателе",
	ПутьКСтроке = "СведенияОГрузополучателе.НомерСтроки", ПоискВложенных = Ложь) Экспорт
	
	СведенияОГрузополучателях = ДеревоДанных.Строки.Найти(Путь, "ПолныйПуть", ПоискВложенных);
	
	Если СведенияОГрузополучателях.Признак = "Таблица" И СведенияОГрузополучателях.Строки.Количество() > 1 Тогда
		
		ТекстИсключения = СтрШаблон(
			НСтр("ru = 'Ошибка загрузки электронной товарной накладной %1 от %2.
			|Загрузка сводных накладных не поддерживается.'"), 
			ДанныеЗаполнения.ВхДокНомер,
			Формат(ДанныеЗаполнения.ВхДокДата, "ДЛФ=D")
		);
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
	СведенияОГрузополучателе = СведенияОГрузополучателях.Строки[0];
	
	ИНН = "";
	КПП = "";
		
	ТипУчастника = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
		СведенияОГрузополучателе,
		ПутьКСтроке + ".ТипУчастника"
		);
		
	Если ТипУчастника = "ЮЛ" Тогда
			
		ИНН = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОГрузополучателе,
			ПутьКСтроке + ".ТипУчастника.ЮЛ.ИНН"
		);
		КПП = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОГрузополучателе,
			ПутьКСтроке + ".ТипУчастника.ЮЛ.КПП"
		);
		
	ИначеЕсли ТипУчастника = "ИП" Тогда
		
		ИНН = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОГрузополучателе,
			ПутьКСтроке + ".ТипУчастника.ИП.ИНН"
		);
		
	ИначеЕсли ТипУчастника = "ФЛ" Тогда
		
		ИНН = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОГрузополучателе,
			ПутьКСтроке + ".ТипУчастника.ФЛ.ИНН"
		);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("Грузополучатель_ИНН", ИНН);
	ДанныеЗаполнения.Вставить("Грузополучатель_КПП", КПП);
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Организация"); 
	Контрагент  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Контрагент");
	Грузополучатель = Неопределено;
	
	Если ЗначениеЗаполнено(Организация) И Организация.ИНН = ИНН Тогда
		Грузополучатель = НайтиПодразделениеОрганизации(Организация, КПП, Контрагент);
	КонецЕсли;
	
	Если Грузополучатель = Неопределено Тогда 
		Грузополучатель =  НайтиКонтрагентаПоИННКПП(ИНН, КПП);
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("Грузополучатель", Грузополучатель);
	
КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияОрганизациейИсточникТаблица(ДеревоДанных, ДанныеЗаполнения, Путь = "СведенияОПокупателе",
	ПутьКСтроке = "СведенияОПокупателе.НомерСтроки", ПоискВложенных = Ложь) Экспорт
	
	СведенияОПокупателях = ДеревоДанных.Строки.Найти(Путь, "ПолныйПуть", ПоискВложенных);
	
	Если СведенияОПокупателях.Признак = "Таблица" И СведенияОПокупателях.Строки.Количество() > 1 Тогда
		
		ТекстИсключения = СтрШаблон(
			НСтр("ru = 'Ошибка загрузки электронной товарной накладной %1 от %2.
			|Загрузка сводных накладных не поддерживается.'"), 
			ДанныеЗаполнения.ВхДокНомер,
			Формат(ДанныеЗаполнения.ВхДокДата, "ДЛФ=D")
		);
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
	СведенияОПокупателе = СведенияОПокупателях.Строки[0];
	ИНН = ИННОрганизацииВДереве(СведенияОПокупателе, ПутьКСтроке);
	КПП = КППОрганизацииВДереве(СведенияОПокупателе, ПутьКСтроке);
	
	ДанныеЗаполнения.Вставить("Организация_ИНН", ИНН);
	ДанныеЗаполнения.Вставить("Организация_КПП", КПП);
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("Организация", ИнтеграцияЭДО.СсылкаНаОбъектПоИННКПП("Организации", ИНН, КПП));
	
КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияОрганизациейИсточникГруппа(ДеревоДанных, ДанныеЗаполнения, Префикс = "СведенияОПокупателе")
	
	ИНН = ""; КПП = "";
	ТипУчастника = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, Префикс + ".ТипУчастника");
	
	Если ТипУчастника = "ЮЛ" Тогда
		
		ИНН = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, Префикс + ".ТипУчастника.ЮЛ.ИНН");
		КПП = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, Префикс + ".ТипУчастника.ЮЛ.КПП");
		
	ИначеЕсли ТипУчастника = "ИП" Тогда
		
		ИНН = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, Префикс + ".ТипУчастника.ИП.ИНН");
		
	ИначеЕсли ТипУчастника = "ФЛ" Тогда
		
		ИНН = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, Префикс + ".ТипУчастника.ФЛ.ИНН");
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("Организация", ИнтеграцияЭДО.СсылкаНаОбъектПоИННКПП("Организации", ИНН, КПП));
	
КонецПроцедуры

Функция ИННОрганизацииВДереве(СведенияОПокупателе, ПутьКСтроке = "СведенияОПокупателе.НомерСтроки")
	
	ТипУчастника = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
		СведенияОПокупателе,
		ПутьКСтроке + ".ТипУчастника"
	);
	
	Если ТипУчастника = "ЮЛ" Тогда
		
		Возврат ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОПокупателе,
			ПутьКСтроке + ".ТипУчастника.ЮЛ.ИНН"
		);
		
	ИначеЕсли ТипУчастника = "ИП" Тогда
		
		Возврат ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОПокупателе,
			ПутьКСтроке + ".ТипУчастника.ИП.ИНН"
		);
		
	ИначеЕсли ТипУчастника = "ФЛ" Тогда
		
		Возврат ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОПокупателе,
			ПутьКСтроке + ".ТипУчастника.ФЛ.ИНН"
		);
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Функция КППОрганизацииВДереве(СведенияОПокупателе, ПутьКСтроке = "СведенияОПокупателе.НомерСтроки")
	
	ТипУчастника = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
		СведенияОПокупателе,
		ПутьКСтроке + ".ТипУчастника"
	);
	
	Если ТипУчастника = "ЮЛ" Тогда
		
		Возврат ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОПокупателе,
			ПутьКСтроке + ".ТипУчастника.ЮЛ.КПП"
		);
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Процедура ДополнитьДанныеЗаполненияПодразделениемКомпании(ДеревоДанных, ДанныеЗаполнения, Путь = "СведенияОПокупателе",
	ПутьКСтроке = "СведенияОПокупателе.НомерСтроки", ПоискВложенных = Ложь) Экспорт
	
	Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Организация");
	Контрагент  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Контрагент");
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КПП = КППОрганизацииВДереве(ДеревоДанных.Строки.Найти(Путь, "ПолныйПуть", ПоискВложенных).Строки[0], ПутьКСтроке);
	ДанныеЗаполнения.Вставить("ПодразделениеКомпании", НайтиПодразделениеОрганизации(Организация, КПП, Контрагент));
	
КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияПодразделениемКомпанииИсточникГруппа(ДеревоДанных,
                                                                        ДанныеЗаполнения,
                                                                        Префикс = "СведенияОПокупателе")
	
	Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Организация");
	Контрагент  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Контрагент");
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	КПП = "";
	
	Если ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, Префикс + ".ТипУчастника") = "ЮЛ" Тогда
		
		КПП = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, Префикс + ".ТипУчастника.ЮЛ.КПП");
		
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("ПодразделениеКомпании", НайтиПодразделениеОрганизации(Организация, КПП, Контрагент));
	
КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияДоговорВзаиморасчетов(ДеревоДанных, ДанныеЗаполнения) Экспорт
	
	Основание = Неопределено;
	ДанныеЗаполнения.Свойство("Основание", Основание);
	
	Если ЗначениеЗаполнено(Основание) Тогда
		
		ДоговорВзаиморасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ДоговорВзаиморасчетов");
		
		Если ЗначениеЗаполнено(ДоговорВзаиморасчетов) Тогда
		
			ДанныеЗаполнения.Вставить("ДоговорВзаиморасчетов", ДоговорВзаиморасчетов);
		
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияОснованиемДокументаОтгрузки(ДеревоДанных, ДанныеЗаполнения)
		
	ДокументыОснованияДокументаОтгрузки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"ДокументыОснованияДокументаОтгрузки"
	);
	
	Если ЗначениеЗаполнено(ДокументыОснованияДокументаОтгрузки) Тогда
		
		Если ТипЗнч(ДокументыОснованияДокументаОтгрузки) = Тип("Массив") Тогда
			
			ДокументОснованияДокументаОтгрузки = ДокументыОснованияДокументаОтгрузки[0];
			
		Иначе
			
			ДокументОснованияДокументаОтгрузки = ДокументыОснованияДокументаОтгрузки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОснованияДокументаОтгрузки) И ДанныеЗаполнения.Исправление Тогда
		
		ВхДокНомер  = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "ВхДокНомер",  "");
		ВхДокДата   = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "ВхДокДата",   Дата(1, 1, 1));
		Контрагент  = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "Контрагент",  Неопределено);
		Организация = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "Организация", Неопределено);
		
		ДокументОснованияДокументаОтгрузки = ДокументОснованиеПоНомеруИДате(
					ВхДокНомер,
					ВхДокДата,
					Организация,
					Контрагент
				);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснованияДокументаОтгрузки) Тогда
		
		ДанныеЗаполнения.Вставить("Основание", ДокументОснованияДокументаОтгрузки);
		
	КонецЕсли;

КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияОснованиемСчетаФактуры(ДеревоДанных, ДанныеЗаполнения)
	
	ОснованиеСчетаФактуры = Неопределено;
	ДокументОснованиеСчетаФактуры = Неопределено;
	ДокументыОснованияСчетаФактуры = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"ДокументыОснованияСчетаФактуры"
	);
	
	ФункцияУКД = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, "Функция");
	
	СсылкаНаВладельца = Неопределено;
	ДанныеЗаполнения.Свойство("СсылкаНаВладельца", СсылкаНаВладельца);
	
	Если ЗначениеЗаполнено(ДокументыОснованияСчетаФактуры) Тогда
		
		Если ТипЗнч(ДокументыОснованияСчетаФактуры) <> Тип("Массив") Тогда
			
			ОснованиеСчетаФактуры = ДокументыОснованияСчетаФактуры;
			
		Иначе
			
			Для Каждого ДокументОснование Из ДокументыОснованияСчетаФактуры Цикл
				
				Если ДокументОснование = СсылкаНаВладельца Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Если
					ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетФактураПолученный")
					Или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваров")
					Или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратОтПокупателя")
					Или ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаПоступления")
					Тогда
					
					ОснованиеСчетаФактуры = ДокументОснование;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОснованиеСчетаФактуры) Тогда
		
		ИсходныеДокументы = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(ДеревоДанных, "ИсходныеДокументы");
		
		Если ЗначениеЗаполнено(ИсходныеДокументы) Тогда
			
			НомерИсходногоДокумента = ИсходныеДокументы[0].НомерИсходногоДокумента;
			ДатаИсходногоДокумента  = ИсходныеДокументы[0].ДатаИсходногоДокумента;
			Контрагент              = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "Контрагент", Неопределено);
			Организация             = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "Организация", Неопределено);
			
			Если ФункцияУКД = "ДИС" Тогда
				ОснованиеСчетаФактуры = ДокументОснованиеПоНомеруИДате(
					ИсходныеДокументы[0].НомерИсходногоДокумента,
					ИсходныеДокументы[0].ДатаИсходногоДокумента,
					Организация,
					Контрагент
				);
			Иначе
				ОснованиеСчетаФактуры = СчетФактураПоНомеруИДате(
					ИсходныеДокументы[0].НомерИсходногоДокумента,
					ИсходныеДокументы[0].ДатаИсходногоДокумента,
					Организация,
					Контрагент
				);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОснованиеСчетаФактуры) Тогда
		
		Если ТипЗнч(ОснованиеСчетаФактуры) = Тип("ДокументСсылка.СчетФактураПолученный")Тогда
			
			ДокументОснованиеСчетаФактуры = ДокументОснованиеСчетаФактурыПолученного(ОснованиеСчетаФактуры);
			
		Иначе
			
			ДокументОснованиеСчетаФактуры = ОснованиеСчетаФактуры;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтоКомплект = ФункцияУКД = "КСЧФДИС"
		Или ФункцияУКД = "СЧФДОП";
	
	Если (ЗначениеЗаполнено(ДокументОснованиеСчетаФактуры) И ДокументОснованиеСчетаФактуры.Проведен) Или ЭтоКомплект Тогда
		
		ДанныеЗаполнения.Вставить("Основание", ДокументОснованиеСчетаФактуры);
		
	Иначе
		
		ШаблонСообщения = НСтр("ru='Документ-основание %1 не проведен. Документ будет создан на основании данных электронного документа.'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ДокументОснованиеСчетаФактуры);
		ВывестиСообщение(ТекстСообщения);
		
	КонецЕсли;

КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияОснованиемДляСчетаФактуры(ДеревоДанных, ДанныеЗаполнения)
	
	ОснованияСчетаФактуры = Новый Массив;
	СчетФактураОснование  = Неопределено;
	ДокументыОснованияСчетаФактуры = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"ДокументыОснованияСчетаФактуры"
	);
	
	СсылкаНаВладельца = Неопределено;
	ДанныеЗаполнения.Свойство("СсылкаНаВладельца", СсылкаНаВладельца);
	
	Если ЗначениеЗаполнено(ДокументыОснованияСчетаФактуры) Тогда
		
		Если ТипЗнч(ДокументыОснованияСчетаФактуры) <> Тип("Массив") Тогда
			
			Если ТипЗнч(ДокументыОснованияСчетаФактуры) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
				СчетФактураОснование = ДокументыОснованияСчетаФактуры;
			Иначе
				ОснованияСчетаФактуры.Добавить(ДокументыОснованияСчетаФактуры);
			КонецЕсли;
			
		Иначе
			
			Для Каждого ДокументОснование Из ДокументыОснованияСчетаФактуры Цикл
				
				Если ДокументОснование = СсылкаНаВладельца Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
					СчетФактураОснование = ДокументОснование;
				Иначе
					ОснованияСчетаФактуры.Добавить(ДокументОснование);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("Основания",            ОснованияСчетаФактуры);
	ДанныеЗаполнения.Вставить("СчетФактураОснование", СчетФактураОснование);
	
КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияВидомСчетаФактуры(ДеревоДанных, ДанныеЗаполнения)
	
	ДанныеЗаполнения.Вставить(
		"ВидСчетаФактуры",
		ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, "ВидСчетаФактуры")
	);
	
КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияТоварами(ДеревоДанных, ДанныеЗаполнения, ТипДокумента = "ПоступлениеТоваров")
	
	Товары = НоваяТаблицаТоваров(ТипДокумента);
	
	ДокументХранитКодыМаркировки = ДокументХранитКодыМаркировки(ТипДокумента);
	
	Если ДокументХранитКодыМаркировки Тогда
		
		КодыМаркировки = НоваяТаблицаКодовМаркировки();
		
	КонецЕсли;
	
	Если Товары.Колонки.Найти("СведенияОПрослеживаемости") = Неопределено Тогда
		
		Товары.Колонки.Добавить("СведенияОПрослеживаемости");
		
	КонецЕсли;
	
	Если Товары.Колонки.Найти("НоменклатураПоставщика") = Неопределено Тогда
		
		Товары.Колонки.Добавить("НоменклатураПоставщика");
		
	КонецЕсли;
	
	Контрагент = Неопределено;
	ДанныеЗаполнения.Свойство("Контрагент", Контрагент);
	
	СведенияОТоварах = ДеревоДанных.Строки.Найти("СведенияОТоварах", "ПолныйПуть");
	
	Для Каждого СведенияОТоваре Из СведенияОТоварах.Строки Цикл
		
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьСлужебныеРеквизитыПозицииТовара(НоваяСтрока);
		ЗаполнитьТоварыСопоставленнымиДанными(СведенияОТоваре, НоваяСтрока, Контрагент);
		ЗаполнитьТоварыСуммами(СведенияОТоваре, НоваяСтрока);
		
		Если ДокументХранитКодыМаркировки Тогда
			
			ДополнитьКодыМаркировки(КодыМаркировки, НоваяСтрока, СведенияОТоваре);
			НоваяСтрока.КоличествоМестДок = НоваяСтрока.КоличествоМест;
			
		КонецЕсли;
		
		ДополнитьСведениямиОТаможеннойДекларации(СведенияОТоваре, НоваяСтрока);
		ДополнитьСведениямиОПрослеживаемости(СведенияОТоваре, НоваяСтрока); 
		
	КонецЦикла;
	
	ДанныеЗаполнения.Вставить("Товары", Товары);
	ДанныеЗаполнения.Вставить("КодыМаркировки", КодыМаркировки);
	
КонецПроцедуры

Процедура ДополнитьДанныеЗаполненияТоварамиУКД(ДеревоДанных, ДанныеЗаполнения, ТипДокумента)
	
	Товары = НоваяТаблицаТоваров(ТипДокумента);
	
	Если Товары.Колонки.Найти("СведенияОПрослеживаемости") = Неопределено Тогда
		
		Товары.Колонки.Добавить("СведенияОПрослеживаемости");
		
	КонецЕсли;
	
	Если Товары.Колонки.Найти("СведенияОИзмененииКоличества") = Неопределено Тогда
		
		Товары.Колонки.Добавить("СведенияОИзмененииКоличества");
		
	КонецЕсли;
	
	Если Товары.Колонки.Найти("НоменклатураПоставщика") = Неопределено Тогда
		
		Товары.Колонки.Добавить("НоменклатураПоставщика");
		
	КонецЕсли;
	
	ДокументХранитКодыМаркировки = ДокументХранитКодыМаркировки(ТипДокумента);
	
	Если ДокументХранитКодыМаркировки Тогда
		
		КодыМаркировки = НоваяТаблицаКодовМаркировки();
		
	КонецЕсли;
	
	Контрагент = Неопределено;
	ДанныеЗаполнения.Свойство("Контрагент", Контрагент);
	
	СведенияОТоварах = ДеревоДанных.Строки.Найти("СведенияОТоварах", "ПолныйПуть");
	
	Для Каждого СведенияОТоваре Из СведенияОТоварах.Строки Цикл
		
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьСлужебныеРеквизитыПозицииТовара(НоваяСтрока);
		ЗаполнитьТоварыСопоставленнымиДанными(СведенияОТоваре, НоваяСтрока, Контрагент);
		ЗаполнитьТоварыСуммами(СведенияОТоваре, НоваяСтрока);
		ДополнитьСведениямиОТаможеннойДекларацииУКД(СведенияОТоваре, НоваяСтрока);
		ДополнитьСведениямиОПрослеживаемостиУКД(СведенияОТоваре, НоваяСтрока);
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.СведенияОПрослеживаемости) Тогда
			
			ДобавитьСведенияОИзмененииКоличества(СведенияОТоваре, НоваяСтрока);
			
		КонецЕсли;
		
		Если ДокументХранитКодыМаркировки Тогда
			
			СведенияОМаркировке = СведенияОМаркировкеИзСтрокиТоваровУКД(СведенияОТоваре);
			ДополнитьКодыМаркировки(КодыМаркировки, НоваяСтрока, СведенияОТоваре, СведенияОМаркировке, Ложь);
			//НоваяСтрока.КоличествоМестДоКорректировки = ПозицияТовара.КоличествоМест;
			//ДополнитьКодыМаркировкиУКД(КодыМаркировки, НоваяСтрока, СведенияОТоваре);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеЗаполнения.Вставить("Товары", Товары);
	ДанныеЗаполнения.Вставить("КодыМаркировки", КодыМаркировки);
	
КонецПроцедуры  

Функция НоваяТаблицаТоваров(ТипДокумента)
	
	Возврат Документы[ТипДокумента].ПустаяСсылка().Товары.Выгрузить();
	
КонецФункции

Функция НоваяТаблицаКодовМаркировки()
	
	Возврат Документы.ПоступлениеТоваров.ПустаяСсылка().Марки.ВыгрузитьКолонки();
	
КонецФункции

Функция ДокументХранитКодыМаркировки(ТипДокумента)
	
	Результат = (ЕстьРеквизит(Документы[ТипДокумента],, "КодыМаркировки") ИЛИ ЕстьРеквизит(Документы[ТипДокумента],, "Марки"));
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСлужебныеРеквизитыПозицииТовара(ПозицияТовара)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияТовара, "ИдентификаторСтроки") Тогда
	
		ПозицияТовара.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		
	КонецЕсли;
		

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияТовара, "НеПересчитыватьСтроку") Тогда
	
		ПозицияТовара.НеПересчитыватьСтроку = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТоварыСопоставленнымиДанными(СведенияОТоваре, ПозицияТовара, Контрагент, Путь = "СведенияОТоварах")
	
	Сопоставление = СведенияОТоваре.Строки.Найти(
		Путь + ".НомерСтроки.Сопоставление",
		"ПолныйПуть",
		Истина
	);
	
	Если Сопоставление <> Неопределено Тогда
		
		Идентификатор = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(Сопоставление,
			Путь + ".НомерСтроки.Сопоставление.Идентификатор");
		Если ЗначениеЗаполнено(Идентификатор) И ЗначениеЗаполнено(Контрагент) Тогда
			НоменклатураПоставщика = Неопределено;
			
			Наименование = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(Сопоставление,
			Путь + ".НомерСтроки.Сопоставление.Наименование");
			
			Характеристика = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(Сопоставление,
			Путь + ".НомерСтроки.Сопоставление.Характеристика");
			
			НаименованиеУпаковки = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(Сопоставление,
			Путь + ".НомерСтроки.Сопоставление.ЕдиницаИзмерения");
			
			ДополнительныеРеквизиты = Новый Структура;
			ДополнительныеРеквизиты.Вставить("Владелец",             Контрагент);
			ДополнительныеРеквизиты.Вставить("Идентификатор",        Идентификатор);
			ДополнительныеРеквизиты.Вставить("Наименование",         Наименование);
			ДополнительныеРеквизиты.Вставить("Характеристика",       Характеристика);
			ДополнительныеРеквизиты.Вставить("НаименованиеУпаковки", НаименованиеУпаковки);
			
			ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект(
					"НоменклатураКонтрагентов",
					НоменклатураПоставщика,,
					ДополнительныеРеквизиты
				);
			
			Если ЗначениеЗаполнено(НоменклатураПоставщика) Тогда
				
				ПозицияТовара.НоменклатураПоставщика = НоменклатураПоставщика; 
				
			КонецЕсли;
			
		КонецЕсли;
		
		Номенклатура = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(Сопоставление,
			Путь + ".НомерСтроки.Сопоставление.НоменклатураИБ");
			
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			
			ПозицияТовара.Номенклатура = Номенклатура; 
			
		КонецЕсли;
		
		Характеристика = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(Сопоставление,
			Путь + ".НомерСтроки.Сопоставление.ХарактеристикаИБ");
			
		Если ЗначениеЗаполнено(Характеристика) Тогда
			
			ПозицияТовара.ХарактеристикаНоменклатуры = Характеристика;
			
		КонецЕсли;
		
		Упаковка = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(Сопоставление,
			Путь + ".НомерСтроки.Сопоставление.УпаковкаИБ");
	
		Если ЗначениеЗаполнено(Упаковка) И ТипЗнч(Упаковка) <> Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
			
			// Заполнение Единицы измерения с типом "СправочникСсылка.ЕдиницаИзмерения".
			КодЕдиницыИзмерения = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(Сопоставление,
				Путь + ".НомерСтроки.Сопоставление.ЕдиницаИзмеренияКод"); 
			
			Если ТипЗнч(ПозицияТовара.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения")
				И ЗначениеЗаполнено(Номенклатура)
				И ЗначениеЗаполнено(КодЕдиницыИзмерения) Тогда
			
				ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ТипНоменклатуры");
				
				РеквизитыНоменклатуры = Новый Структура("Номенклатура, ТипНоменклатуры", Номенклатура, ТипНоменклатуры); 
				
				ЕдиницаИзмерения = Неопределено;
				
				ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект(
					"ЕдиницыИзмерения",
					ЕдиницаИзмерения,
					КодЕдиницыИзмерения,
					РеквизитыНоменклатуры
				);
					
				ПозицияТовара.ЕдиницаИзмерения = ЕдиницаИзмерения; 
				
			Иначе
				
				ПозицияТовара.ЕдиницаИзмерения = Упаковка;
				
			КонецЕсли;
			
			Если ТипЗнч(Упаковка) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
				
				ПозицияТовара.Коэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Упаковка, "Коэффициент");
				
			Иначе
				
				ПозицияТовара.Коэффициент = 1;
				
			КонецЕсли;
			
		Иначе
			
			ПозицияТовара.ЕдиницаИзмерения = Упаковка;
			
			Если ЗначениеЗаполнено(Упаковка) Тогда
				
				ПозицияТовара.Коэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Упаковка, "Коэффициент");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТоварыСуммами(СведенияОТоваре, ПозицияТовара)
	
	ПозицияТовара.Количество = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"СведенияОТоварах.НомерСтроки.Количество");
	ПозицияТовара.Цена = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"СведенияОТоварах.НомерСтроки.ЦенаЗаЕдиницуИзмерения");
	ПозицияТовара.Сумма = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"СведенияОТоварах.НомерСтроки.СтоимостьТоваровБезНалога");	
	ПозицияТовара.СуммаВсего = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"СведенияОТоварах.НомерСтроки.СтоимостьТоваровСНалогом");	
	ПозицияТовара.СтавкаНДС = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"СведенияОТоварах.НомерСтроки.НалоговаяСтавка");	
	ПозицияТовара.СуммаНДС = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"СведенияОТоварах.НомерСтроки.СуммаНалога");
	
	Если ПозицияТовара.Количество = 0 Тогда
		
		ПозицияТовара.Количество = 1;
		
	КонецЕсли;
	
	Если ПозицияТовара.Цена = 0 Тогда
		
		ПозицияТовара.Цена = ПозицияТовара.Сумма;
		
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияТовара, "КоличествоБазовое") Тогда
		
		ПозицияТовара.КоличествоБазовое = ПозицияТовара.Количество * ПозицияТовара.Коэффициент;
		
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияТовара, "КоличествоПоНакладной") Тогда
		
		ПозицияТовара.КоличествоПоНакладной = ПозицияТовара.Количество;
		
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияТовара, "КоличествоДок") Тогда
		
		ПозицияТовара.КоличествоДок     = ПозицияТовара.Количество;
		ПозицияТовара.ЦенаДок           = ПозицияТовара.Цена;
		ПозицияТовара.СуммаДок          = ПозицияТовара.СуммаВсего;
		//ПозицияТовара.КоличествоМестДок = ПозицияТовара.КоличествоМест;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьКодыМаркировки(КодыМаркировки, ПозицияТовара, СведенияОТоваре, СведенияОМаркировке = Неопределено, Регистрировать = Истина, ПоДокументу = Ложь)
	
	Если СведенияОМаркировке = Неопределено Тогда
		СведенияОМаркировке = СведенияОМаркировкеИзСтрокиТоваровУПД(СведенияОТоваре);
	КонецЕсли;
	
	//НоменклатураПоGTIN   = Неопределено;
	КоличествоУпаковок   = 0;
	НеПроверялась        = Перечисления.СтатусыПроверкиМаркированнойПродукции.НеПроверялась;
	НаборКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
	ОжидаетДоставки      = Перечисления.СостоянияКодовМаркировки.ОжидаетДоставки;
	СоответствиеШК       = Новый Соответствие;
	ГрупповаяУпаковка    = Перечисления.ВидыУпаковокМаркировки.Групповая;
	
	Для Каждого СтрокаУпаковки Из СведенияОМаркировке.ИндивидуальныеУпаковки Цикл
		
		СтруктураМаркировки = Неопределено;
		
		Если ТипЗнч(СтрокаУпаковки) = Тип("СтрокаТаблицыЗначений") Тогда
			ЗначениеШтрихкода = СтрокаУпаковки.Код;
		Иначе
			ЗначениеШтрихкода = СтрокаУпаковки;
		КонецЕсли;
		
		КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ЗначениеШтрихкода, "", Ложь, СтруктураМаркировки);
		
		Если Не ПроверитьДанныеРазбораМаркиЭДО(КодМаркировки, ПозицияТовара, ПоДокументу) Тогда
			Прервать;
		КонецЕсли;
		
		НоваяСтрока = КодыМаркировки.Добавить();
		НоваяСтрока.КодМарки            = КодМаркировки;
		НоваяСтрока.ИдентификаторСтроки = ПозицияТовара.ИдентификаторСтроки;
		НоваяСтрока.СтатусПроверки      = НеПроверялась;
		НоваяСтрока.Количество          = 1;
		
		Если Регистрировать Тогда
			НаборКодовМаркировки.Отбор.КодМаркировки.Установить(КодМаркировки);
			НаборКодовМаркировки.Прочитать();
			Если НаборКодовМаркировки.Количество() = 0 Тогда
				
				НоваяЗапись = НаборКодовМаркировки.Добавить();
				НоваяЗапись.ВидУпаковки         = СтруктураМаркировки.ВидУпаковки;
				НоваяЗапись.КодМаркировки       = КодМаркировки;
				НоваяЗапись.КодМаркировкиПолный = ЗначениеШтрихкода;
				//НоваяЗапись.Организация         = ПараметрыКоманды.Организация;
				НоваяЗапись.Состояние           = ОжидаетДоставки;
				НоваяЗапись.GTIN                = СтруктураМаркировки.GTIN;
				НоваяЗапись.СерийныйНомер       = СтруктураМаркировки.СерийныйНомер;
				НоваяЗапись.Номенклатура        = ПозицияТовара.Номенклатура;
				НоваяЗапись.ЕдиницаИзмерения    = ПозицияТовара.ЕдиницаИзмерения;
				НоваяЗапись.СтатусПроверки      = НеПроверялась;
				НоваяЗапись.ЕстьКриптохвост     = Истина;
				НоваяЗапись.ХарактеристикаНоменклатуры = ПозицияТовара.ХарактеристикаНоменклатуры;
				//НоваяЗапись.ЭлектронныйДокумент
				НоваяЗапись.Количество            = 1;
				
				Если СтруктураМаркировки.ВидУпаковки = ГрупповаяУпаковка Тогда
					Вложенность = 1;
					ВложенностьШК = СоответствиеШК.Получить(СтруктураМаркировки.GTIN);
					Если ВложенностьШК = Неопределено Тогда
						Вложенность = ВложенностьШК;
					Иначе
						Штрихкод = ШтрихкодированиеМПКлиентСервер.ШтрихкодEANИзGTIN(СтруктураМаркировки.GTIN);
						Запрос = Новый Запрос;
						Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
						Запрос.Текст = "
						|ВЫБРАТЬ ПЕРВЫЕ 1
						|	ТабШтрихкоды.ЕдиницаИзмерения.Коэффициент КАК КоэффициентПоШК,
						|	ТабШтрихкоды.Объект.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Коэффициент
						|ИЗ
						|	РегистрСведений.Штрихкоды КАК ТабШтрихкоды
						|ГДЕ
						|	ТабШтрихкоды.Штрихкод = &Штрихкод И 
						|	ТабШтрихкоды.Запрет = ЛОЖЬ
						|";
						Выборка = Запрос.Выполнить().Выбрать();
						Если Выборка.Следующий() Тогда
							Если Не Выборка.КоэффициентПоШК = Null Тогда
								Вложенность = Выборка.КоэффициентПоШК;
							ИначеЕсли Не Выборка.Коэффициент = Null Тогда
								Вложенность = Выборка.Коэффициент;
							КонецЕсли;
						КонецЕсли;
						СоответствиеШК.Вставить(СтруктураМаркировки.GTIN, Вложенность);
					КонецЕсли;
					НоваяЗапись.Количество = Вложенность;
					НоваяСтрока.Количество = Вложенность;
				КонецЕсли;
				
				КоличествоУпаковок = КоличествоУпаковок + НоваяЗапись.Количество;
				
				НаборКодовМаркировки.Записать();
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если СведенияОМаркировке.ТранспортныеУпаковки.Количество()>0 Тогда
		
		Вложенность = Макс((ПозицияТовара.Количество-КоличествоУпаковок)/СведенияОМаркировке.ТранспортныеУпаковки.Количество(), 1);
		
		Для Каждого СтрокаУпаковки Из СведенияОМаркировке.ТранспортныеУпаковки Цикл
			
			СтруктураМаркировки = Неопределено;
			
			Если ТипЗнч(СтрокаУпаковки) = Тип("СтрокаТаблицыЗначений") Тогда
				ЗначениеШтрихкода = СтрокаУпаковки.Код;
			Иначе
				ЗначениеШтрихкода = СтрокаУпаковки;
			КонецЕсли;
			
			КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ЗначениеШтрихкода, "", Ложь, СтруктураМаркировки);
			
			НоваяСтрока = КодыМаркировки.Добавить();
			НоваяСтрока.КодМарки            = КодМаркировки;
			НоваяСтрока.ИдентификаторСтроки = ПозицияТовара.ИдентификаторСтроки;
			НоваяСтрока.СтатусПроверки      = НеПроверялась;
			НоваяСтрока.Количество          = Вложенность;
			
			Если Регистрировать Тогда
				НаборКодовМаркировки.Отбор.КодМаркировки.Установить(КодМаркировки);
				НаборКодовМаркировки.Прочитать();
				Если НаборКодовМаркировки.Количество() = 0 Тогда
					
					НоваяЗапись = НаборКодовМаркировки.Добавить();
					НоваяЗапись.ВидУпаковки           = СтруктураМаркировки.ВидУпаковки;
					НоваяЗапись.КодМаркировки         = КодМаркировки;
					НоваяЗапись.КодМаркировкиПолный   = ЗначениеШтрихкода;
					//НоваяЗапись.Организация           = ПараметрыКоманды.Организация;
					НоваяЗапись.Состояние             = ОжидаетДоставки;
					НоваяЗапись.GTIN                  = СтруктураМаркировки.GTIN;
					НоваяЗапись.СерийныйНомер         = СтруктураМаркировки.СерийныйНомер;
					НоваяЗапись.Номенклатура          = ПозицияТовара.Номенклатура;
					НоваяЗапись.СтатусПроверки        = НеПроверялась;
					НоваяЗапись.ЕстьКриптохвост       = Истина;
					НоваяЗапись.ХарактеристикаНоменклатуры = ПозицияТовара.ХарактеристикаНоменклатуры;
					//НоваяЗапись.ЭлектронныйДокумент
					НоваяЗапись.Количество            = Вложенность;
					
					НаборКодовМаркировки.Записать();
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьДанныеРазбораМаркиЭДО(КодМаркировки, ПозицияТовара, ПоДокументу)
	
	Результат = Истина;
	
	//Если НЕ СтруктураМаркировки = Неопределено Тогда
	//	Возврат Результат;
	//КонецЕсли;
	
	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(КодМаркировки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Проверяется контрольная сумма по правилам формирования кода GTIN
	Если Лев(КодМаркировки, 1) = "0" И (СтрДлина(КодМаркировки) = 14 ИЛИ СтрДлина(КодМаркировки) = 16) Тогда
		
		Если СтрДлина(КодМаркировки) = 16 Тогда
			КодМаркировки = Сред(КодМаркировки, 3, 14);
		КонецЕсли;
		
		Если ШтрихкодированиеМПКлиентСервер.РассчитатьКонтрольныйСимволGTIN14(КодМаркировки) = Прав(КодМаркировки, 1) Тогда
			
			Если ПоДокументу Тогда
				ПозицияТовара.GTINПоДокументуРеализации           = КодМаркировки;
				ПозицияТовара.КоличествоМестПоДокументуРеализации = 0;
			Иначе
				ПозицияТовара.GTIN           = КодМаркировки;
				ПозицияТовара.КоличествоМест = 0;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПозицияТовара.Номенклатура) Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Штрихкод = ШтрихкодированиеМПКлиентСервер.ШтрихкодEANИзGTIN(КодМаркировки);
			
			НайденныеОбъекты = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(Штрихкод);
			
			Если НайденныеОбъекты.Количество()>0 Тогда
				ПозицияТовара.Номенклатура = НайденныеОбъекты[0].Объект;
			КонецЕсли;
			
			Возврат Ложь;
			
		КонецЕсли;
		
	ИначеЕсли Лев(КодМаркировки, 1) = "0" И СтрДлина(КодМаркировки) < 24 Тогда
		
		ИдентификаторGTIN = Лев(КодМаркировки, 2);
		GTIN              = Сред(КодМаркировки, 3, 14);
		Если СтрДлина(КодМаркировки) > 18 Тогда
			ИдентификаторКоличества = Сред(КодМаркировки, 17, 2);
			СтрокаКоличество = Сред(КодМаркировки, 19);
		Иначе
			ИдентификаторКоличества = "";
			СтрокаКоличество = "";
		КонецЕсли;
		
		Если ПоДокументу Тогда
			ПозицияТовара.GTINПоДокументуРеализации = GTIN;
		Иначе
			ПозицияТовара.GTIN = GTIN;
		КонецЕсли;
		
		Если ШтрихкодированиеМПКлиентСервер.РассчитатьКонтрольныйСимволGTIN14(GTIN) = Прав(GTIN, 1) Тогда
			
			Если ИдентификаторGTIN = "01" И ИдентификаторКоличества = "30" Тогда
				Если ПоДокументу Тогда
					ПозицияТовара.КоличествоМестПоДокументуРеализации = Число(СтрокаКоличество);
				Иначе
					ПозицияТовара.КоличествоМест = Число(СтрокаКоличество);
				КонецЕсли;
			ИначеЕсли ИдентификаторGTIN = "02" И ИдентификаторКоличества = "37" Тогда
				Если ПоДокументу Тогда
					ПозицияТовара.КоличествоМестПоДокументуРеализации = Число(СтрокаКоличество);
				Иначе
					ПозицияТовара.КоличествоМест = Число(СтрокаКоличество);
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПозицияТовара.Номенклатура) Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Штрихкод = ШтрихкодированиеМПКлиентСервер.ШтрихкодEANИзGTIN(GTIN);
			
			НайденныеОбъекты = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(Штрихкод);
			
			Если НайденныеОбъекты.Количество()>0 Тогда
				ПозицияТовара.Номенклатура = НайденныеОбъекты[0].Объект;
			КонецЕсли;
			
			Возврат Ложь;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СведенияОМаркировкеИзСтрокиТоваровУПД(СведенияОТоваре)
	
	Результат = Новый Структура("ИндивидуальныеУпаковки, ТранспортныеУпаковки");
	
	Результат.ИндивидуальныеУпаковки = Новый Массив;
	Результат.ТранспортныеУпаковки   = Новый Массив;
	
	КодыУпаковок = СведенияОТоваре.Строки.Найти(
		"СведенияОТоварах.НомерСтроки.СведенияОМаркировке", "ПолныйПуть", Истина);
	
	Если КодыУпаковок <> Неопределено И ЗначениеЗаполнено(КодыУпаковок.Значение) Тогда
		
		КонтрольныеИдентификационныеЗнаки = КодыУпаковок.Строки.Найти(
			"СведенияОТоварах.НомерСтроки.СведенияОМаркировке.КонтрольныеИдентификационныеЗнаки", "ПолныйПуть", Истина);
		
		Для Каждого СтрокаКодаУпаковки Из КонтрольныеИдентификационныеЗнаки.Строки Цикл
			
			ШтрихкодУпаковки = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СтрокаКодаУпаковки,
				"СведенияОТоварах.НомерСтроки.СведенияОМаркировке.КонтрольныеИдентификационныеЗнаки.НомерСтроки.Код");
			
			Если ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда 
				
				Результат.ИндивидуальныеУпаковки.Добавить(ШтрихкодУпаковки);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ИндивидуальныеУпаковки = КодыУпаковок.Строки.Найти(
			"СведенияОТоварах.НомерСтроки.СведенияОМаркировке.ИндивидуальныеУпаковки", "ПолныйПуть", Истина);
		
		Для Каждого СтрокаКодаУпаковки Из ИндивидуальныеУпаковки.Строки Цикл
			
			ШтрихкодУпаковки = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СтрокаКодаУпаковки,
				"СведенияОТоварах.НомерСтроки.СведенияОМаркировке.ИндивидуальныеУпаковки.НомерСтроки.Код");
			
			Если ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда 
				
				Результат.ИндивидуальныеУпаковки.Добавить(ШтрихкодУпаковки);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТранспортныеУпаковки = КодыУпаковок.Строки.Найти(
			"СведенияОТоварах.НомерСтроки.СведенияОМаркировке.ТранспортныеУпаковки", "ПолныйПуть", Истина);
		
		Для Каждого СтрокаКодаУпаковки Из ТранспортныеУпаковки.Строки Цикл
			
			ШтрихкодУпаковки = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СтрокаКодаУпаковки,
				"СведенияОТоварах.НомерСтроки.СведенияОМаркировке.ТранспортныеУпаковки.НомерСтроки.Код");
			
			Если ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда 
				
				Результат.ТранспортныеУпаковки.Добавить(ШтрихкодУпаковки);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьКодыМаркировкиУКД(КодыМаркировки, ПозицияТовара, СведенияОТоваре)
	
	СведенияОМаркировке = СведенияОМаркировкеИзСтрокиТоваровУКД(СведенияОТоваре);
	
	Для Каждого СведениеОМаркировке Из СведенияОМаркировке Цикл
		
		НоваяСтрока = КодыМаркировки.Добавить();
		НоваяСтрока.ИдентификаторСтроки = ПозицияТовара.ИдентификаторСтроки;
		НоваяСтрока.КодМарки            = СведениеОМаркировке;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СведенияОМаркировкеИзСтрокиТоваровУКД(СведенияОТоваре)
	
	Результат = Новый Структура("ИндивидуальныеУпаковки, ТранспортныеУпаковки");
	
	Результат.ИндивидуальныеУпаковки = Новый Массив;
	Результат.ТранспортныеУпаковки   = Новый Массив;
	
	КодыУпаковок = СведенияОТоваре.Строки.Найти(
		"СведенияОТоварах.НомерСтроки.СведенияОМаркировкеПосле", "ПолныйПуть", Истина);
	
	Если КодыУпаковок <> Неопределено И ЗначениеЗаполнено(КодыУпаковок.Значение) Тогда
		
		КонтрольныеИдентификационныеЗнаки = КодыУпаковок.Строки.Найти(
			"СведенияОТоварах.НомерСтроки.СведенияОМаркировкеПосле.КонтрольныеИдентификационныеЗнаки", "ПолныйПуть", Истина);
		
		Для Каждого СтрокаКодаУпаковки Из КонтрольныеИдентификационныеЗнаки.Строки Цикл
			
			ШтрихкодУпаковки = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СтрокаКодаУпаковки,
				"СведенияОТоварах.НомерСтроки.СведенияОМаркировкеПосле.КонтрольныеИдентификационныеЗнаки.НомерСтроки.Код");
			
			Если ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда
				
				Результат.ИндивидуальныеУпаковки.Добавить(ШтрихкодУпаковки);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ИндивидуальныеУпаковки = КодыУпаковок.Строки.Найти(
			"СведенияОТоварах.НомерСтроки.СведенияОМаркировкеПосле.ИндивидуальныеУпаковки", "ПолныйПуть", Истина);
		
		Для Каждого СтрокаКодаУпаковки Из ИндивидуальныеУпаковки.Строки Цикл
			
			ШтрихкодУпаковки = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СтрокаКодаУпаковки,
				"СведенияОТоварах.НомерСтроки.СведенияОМаркировкеПосле.ИндивидуальныеУпаковки.НомерСтроки.Код");
			
			Если ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда 
				
				Результат.ИндивидуальныеУпаковки.Добавить(ШтрихкодУпаковки);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТранспортныеУпаковки = КодыУпаковок.Строки.Найти(
			"СведенияОТоварах.НомерСтроки.СведенияОМаркировкеПосле.ТранспортныеУпаковки", "ПолныйПуть", Истина);
		
		Для Каждого СтрокаКодаУпаковки Из ТранспортныеУпаковки.Строки Цикл
			
			ШтрихкодУпаковки = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СтрокаКодаУпаковки,
				"СведенияОТоварах.НомерСтроки.СведенияОМаркировкеПосле.ТранспортныеУпаковки.НомерСтроки.Код");
			
			Если ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда 
				
				Результат.ТранспортныеУпаковки.Добавить(ШтрихкодУпаковки);
				
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДополнитьСведениямиОТаможеннойДекларации(СведенияОТоваре, ПозицияТовара)
	
	Если
		Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияТовара, "ГТД")
		Или Не ЗначениеЗаполнено(ПозицияТовара.Номенклатура)
	Тогда
		
		Возврат;
		
	КонецЕсли;

	Признак = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.Признак");
	
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПозицияТовара.Номенклатура, "ВидНоменклатуры");
	
	Если ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга 
		Или (ЗначениеЗаполнено(Признак) И Признак <> "1") Тогда
		
		Возврат;
		
	КонецЕсли;

	ЭтоРНПТ = Ложь;
	СведенияОПрослеживаемости = СведенияОТоваре.Строки.Найти(
		"СведенияОТоварах.НомерСтроки.СведенияОПрослеживаемости", "ПолныйПуть", Истина);
	
	Если СведенияОПрослеживаемости <> Неопределено
		И СведенияОПрослеживаемости.Строки.Количество() > 0
		И ЗначениеЗаполнено(СведенияОПрослеживаемости.Значение) Тогда
		
		ЭтоРНПТ = Истина;
		
	КонецЕсли; 
	
	СведенияОТаможеннойДекларации = СведенияОТоваре.Строки.Найти(
		"СведенияОТоварах.НомерСтроки.СведенияОТаможеннойДекларации", "ПолныйПуть", Истина);
	
	Если СведенияОТаможеннойДекларации <> Неопределено И СведенияОТаможеннойДекларации.Строки.Количество() > 0 Тогда
		
		НомерТаможеннойДекларации = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТаможеннойДекларации.Строки[0],
			"СведенияОТоварах.НомерСтроки.СведенияОТаможеннойДекларации.НомерСтроки.ТаможеннаяДекларацияНомер");
		
		КодСтраныПроисхождения = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТаможеннойДекларации.Строки[0],
			"СведенияОТоварах.НомерСтроки.СведенияОТаможеннойДекларации.НомерСтроки.СтранаПроисхожденияКод");
		
		Если ЗначениеЗаполнено(НомерТаможеннойДекларации) 
			И НомерТаможеннойДекларации <> "-" Тогда
			
			СтранаПроисхождения = Неопределено;
			ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект("СтраныМира", СтранаПроисхождения, КодСтраныПроисхождения);
			ПозицияТовара.ГТД = НайтиСоздатьГТДТовара(НомерТаможеннойДекларации, СтранаПроисхождения, ЭтоРНПТ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьГТДТовара(НомерТД, Страна, ПрослеживаемыйТовар = Ложь)
	
	ТаможеннаяДекларацияОбъект = Справочники.ГТД.СоздатьЭлемент();
	ТаможеннаяДекларацияОбъект.УстановитьНовыйКод();
	ТаможеннаяДекларацияОбъект.Наименование = НомерТД;
	ТаможеннаяДекларацияОбъект.Страна = Страна;
	ТаможеннаяДекларацияОбъект.РНПТ = ПрослеживаемыйТовар;
	ТаможеннаяДекларацияОбъект.ОбменДанными.Загрузка = Истина;
	ТаможеннаяДекларацияОбъект.Записать();
	Возврат ТаможеннаяДекларацияОбъект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьСписокНоменклатурыУКД(СписокНоменклатуры, ТоварыЭД, 
	ТоварыКорректировкиПоОснованию, ЭтоУКД = Истина, ТоварыОснования = Неопределено)
	
	СтрокиКУдалению = Новый Массив;
	ТоварИзмКоличествоОтбор = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ГТД");
	РеквизитыКЗаполнениюТоваровПоОснованию = "ЕдиницаИзмеренияПоДокументуПоступления,
		|КоэффициентПоДокументуПоступления,
		|СуммаВсегоПоДокументуПоступления,
		|СтавкаНДСПоДокументуПоступления,
		|СуммаНДСПоДокументуПоступления";
	
	Если ЭтоУКД Тогда
	
		Для Каждого СтрокаТовара Из ТоварыЭД Цикл
			
			Если ЗначениеЗаполнено(СтрокаТовара.СведенияОИзмененииКоличества) Тогда
				
				СведенияОИзменении = СтрокаТовара.СведенияОИзмененииКоличества;
				ЭтоНовыйТовар = НЕ ЗначениеЗаполнено(СведенияОИзменении.КоличествоДоКорректировки);
				
				Если ЭтоНовыйТовар Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				СтрокаТовара.Количество                       = СведенияОИзменении.Количество;
				СтрокаТовара.КоличествоПоДокументуПоступления = СведенияОИзменении.КоличествоДоКорректировки;
				СтрокаТовара.ГТД                              = СтрокаТовара.ГТД;
				
				ЗаполнитьЗначенияСвойств(ТоварИзмКоличествоОтбор, СтрокаТовара);
				Если ТоварыОснования = Неопределено Тогда
					ТоварИзмКоличествоОтбор.Вставить("Цена", СведенияОИзменении.ЦенаЗаЕдиницуИзмеренияДоКорректировки);
					ТоварыКорректировкиКУдалению = ТоварыКорректировкиПоОснованию.НайтиСтроки(ТоварИзмКоличествоОтбор);
				Иначе
					ТоварыКорректировкиКУдалению = Новый Массив;
					СтоимостьТоваровСНДСДоКорректировки = СведенияОИзменении.СтоимостьТоваровБезНалогаДоКорректировки + СведенияОИзменении.СуммаНалогаДоКорректировки;
					ТоварИзмКоличествоОтбор.Вставить("СуммаДок", СтоимостьТоваровСНДСДоКорректировки);
					НайденныеТовары = ТоварыОснования.НайтиСтроки(ТоварИзмКоличествоОтбор);
					Для Каждого СтрокаТоваров Из НайденныеТовары Цикл
						НайденнаяСтрока = ТоварыКорректировкиПоОснованию.Найти(СтрокаТоваров.ИдентификаторСтроки, "ИдентификаторСтроки");
						Если НЕ НайденнаяСтрока = Неопределено Тогда
							ТоварыКорректировкиКУдалению.Добавить(НайденнаяСтрока);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если ТоварыКорректировкиКУдалению.Количество() = 1 Тогда
					
					ТоварПоОснованию = ТоварыКорректировкиКУдалению[0];
					ЗаполнитьЗначенияСвойств(СтрокаТовара, ТоварПоОснованию, РеквизитыКЗаполнениюТоваровПоОснованию);
					
				Иначе
					
					СтрокаТовара.ЕдиницаИзмеренияПоДокументуПоступления = СтрокаТовара.ЕдиницаИзмерения;
					СтрокаТовара.КоэффициентПоДокументуПоступления = СтрокаТовара.Коэффициент;
					
					СтоимостьТоваровБезНалогаДоКорректировки = ?(
						СведенияОИзменении.СтоимостьТоваровБезНалогаДоКорректировки = Неопределено,
						0,
						СведенияОИзменении.СтоимостьТоваровБезНалогаДоКорректировки
					);
					
					СуммаНалогаДоКорректировки = ?(
						СведенияОИзменении.СуммаНалогаДоКорректировки = Неопределено,
						0,
						СведенияОИзменении.СуммаНалогаДоКорректировки
					);
					СтрокаТовара.СуммаВсегоПоДокументуПоступления = СтоимостьТоваровБезНалогаДоКорректировки
						+ СуммаНалогаДоКорректировки;
					
					СтрокаТовара.СтавкаНДСПоДокументуПоступления = СтрокаТовара.СтавкаНДС;
					СтрокаТовара.СуммаНДСПоДокументуПоступления = СуммаНалогаДоКорректировки;
					
				КонецЕсли;
				
				Для Каждого СтрокаКУдалению Из ТоварыКорректировкиКУдалению Цикл
				
					ТоварыКорректировкиПоОснованию.Удалить(СтрокаКУдалению);
				
				КонецЦикла;
				
				НоваяСтрока = СписокНоменклатуры.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовара);
				НоваяСтрока.ПоДокументуПоступления = Истина;
				НоваяСтрока.Подтверждение = Истина;
				СтрокиКУдалению.Добавить(СтрокаТовара);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого УдаляемаяСтрока Из СтрокиКУдалению Цикл
			
			ТоварыЭД.Удалить(УдаляемаяСтрока);
			
		КонецЦикла;
		
		// Найдем новые товары из таблицы ТоварыЭД. Это товары, у которых КоличествоПоДокументуПоступления = 0
		НовыеТовары = ТоварыЭД.НайтиСтроки(Новый Структура("КоличествоПоДокументуПоступления", 0));
		
		Для Каждого НовыйТовар Из НовыеТовары Цикл
			
			НоваяСтрока = СписокНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйТовар);
			НоваяСтрока.Подтверждение = Истина;
			ТоварыЭД.Удалить(НовыйТовар);
			
		КонецЦикла;
	
	КонецЕсли;
	
	// Найдем совпадающие строки в ТоварахЭД и в Товарах документа основания.
	Для Каждого ТоварЭД Из ТоварыЭД Цикл
	
		ОтборНоменклатуры = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ГТД");
		ЗаполнитьЗначенияСвойств(ОтборНоменклатуры, ТоварЭД);
		
		Если ЭтоУКД Тогда
			
			ОтборНоменклатуры.Вставить("Количество", ТоварЭД.КоличествоПоДокументуПоступления);
			
		КонецЕсли;
		
		ТоварыКорректировки = ТоварыКорректировкиПоОснованию.НайтиСтроки(ОтборНоменклатуры);
		
		Если Не ЗначениеЗаполнено(ТоварыКорректировки) И Не ЭтоУКД Тогда
			
			НоваяСтрока = СписокНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТоварЭД);
			НоваяСтрока.Подтверждение = Истина;
			
		КонецЕсли;
		
		Для Каждого ТоварКорректировки Из ТоварыКорректировки Цикл
		
			НоваяСтрока            = СписокНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТоварКорректировки);
			НоваяСтрока.ИдентификаторСтроки = ТоварЭД.ИдентификаторСтроки;
			НоваяСтрока.Количество = ТоварЭД.Количество;
			НоваяСтрока.Сумма      = ТоварЭД.Сумма;
			НоваяСтрока.СуммаВсего = ТоварЭД.СуммаВсего;
			НоваяСтрока.СуммаНДС   = ТоварЭД.СуммаНДС;
			
			ТоварыКорректировкиПоОснованию.Удалить(ТоварКорректировки);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрокаКорректировки  Из ТоварыКорректировкиПоОснованию Цикл
		
		НоваяСтрока = СписокНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКорректировки);
		НоваяСтрока.Подтверждение = ЭтоУКД;
		
	КонецЦикла;

КонецПроцедуры

Процедура РазделитьСтрокуТовараУКД(Товары, СтрокаКРазделению)
	
	ИсключатьСвойства = "ГТД, Количество, КоличествоПоДокументуПоступления, Сумма, "
		+ "СуммаВсего, СуммаВсегоДоКорректировки, СуммаВсегоПоДокументуПоступления, СуммаНДС, "
		+ "СуммаНДСДоКорректировки, СуммаНДСПоДокументуПоступления, СведенияОПрослеживаемости";
	
	ОбщееКоличество = СтрокаКРазделению.Количество;
	
	Для Каждого СтрокаСведенияОПрослеживаемости Из СтрокаКРазделению.СведенияОПрослеживаемости Цикл
		
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКРазделению,, ИсключатьСвойства);
		ЭтоНовыйТовар = СтрокаСведенияОПрослеживаемости.КоличествоТовараДоИзменения = 0;
		
		НоваяСтрока.ГТД        = СтрокаСведенияОПрослеживаемости.РНПТ;
		НоваяСтрока.Количество = СтрокаСведенияОПрослеживаемости.КоличествоТовараПослеИзменения;
		НоваяСтрока.Сумма      = НоваяСтрока.Количество * СтрокаКРазделению.Цена;
		СуммаПоДокументуПоступления = СтрокаСведенияОПрослеживаемости.КоличествоТовараДоИзменения * СтрокаКРазделению.Цена;
		
		Если НЕ ОбщееКоличество = 0
			И НЕ НоваяСтрока.Количество = 0 Тогда
			
			СуммаНДС = СтрокаКРазделению.СуммаНДС / ОбщееКоличество * НоваяСтрока.Количество;
			
		Иначе
			
			СуммаНДС = 0;
			
		КонецЕсли;
		
		Если НЕ СтрокаКРазделению.КоличествоПоДокументуПоступления = 0
			И НЕ СтрокаСведенияОПрослеживаемости.КоличествоТовараДоИзменения = 0 Тогда
			
			СуммаНДСПоДокументуПоступления = СтрокаКРазделению.СуммаНДСПоДокументуПоступления
				/ СтрокаКРазделению.КоличествоПоДокументуПоступления
				* СтрокаСведенияОПрослеживаемости.КоличествоТовараДоИзменения;
			
		Иначе
			
			СуммаНДСПоДокументуПоступления = 0;
			
		КонецЕсли;
		
		НоваяСтрока.СуммаНДС                         = СуммаНДС;
		НоваяСтрока.СуммаНДСПоДокументуПоступления   = СуммаНДСПоДокументуПоступления;
		НоваяСтрока.СуммаВсего                       = НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС;
		НоваяСтрока.СуммаВсегоПоДокументуПоступления = СуммаПоДокументуПоступления + НоваяСтрока.СуммаНДСПоДокументуПоступления;
		
		Если НЕ ЭтоНовыйТовар Тогда
			
			НоваяСтрока.КоличествоПоДокументуПоступления = СтрокаСведенияОПрослеживаемости.КоличествоТовараДоИзменения;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьСведениямиОПрослеживаемости(СведенияОТоваре, ПозицияТовара, Путь = "СведенияОТоварах")

	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияТовара, "ГТД")
		ИЛИ НЕ ЗначениеЗаполнено(ПозицияТовара.Номенклатура) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Признак = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре, Путь + ".НомерСтроки.Признак");
	
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПозицияТовара.Номенклатура, "ВидНоменклатуры");
	
	Если ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга ИЛИ Признак <> "1" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СведенияОПрослеживаемости = СведенияОТоваре.Строки.Найти(
		Путь + ".НомерСтроки.СведенияОПрослеживаемости", "ПолныйПуть", Истина);
	
	Если СведенияОПрослеживаемости = Неопределено 
		ИЛИ СведенияОПрослеживаемости.Строки.Количество() = 0
		ИЛИ НЕ ЗначениеЗаполнено(СведенияОПрослеживаемости.Значение) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТаблицаПрослеживаемости = ТаблицаСведенияОпрослеживаемостиУПД();
	ТаблицаПрослеживаемости.Колонки.Добавить("РНПТ", Новый ОписаниеТипов("СправочникСсылка.ГТД"));	

	// Найдем страну
	СтранаПроисхождения = Неопределено;
	СведенияОТаможеннойДекларации = СведенияОТоваре.Строки.Найти(
		Путь + ".НомерСтроки.СведенияОТаможеннойДекларации", "ПолныйПуть", Истина);
	
	Если СведенияОТаможеннойДекларации <> Неопределено И СведенияОТаможеннойДекларации.Строки.Количество() > 0 Тогда
		
		КодСтраныПроисхождения = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОТаможеннойДекларации.Строки[0],
			Путь + ".НомерСтроки.СведенияОТаможеннойДекларации.НомерСтроки.СтранаПроисхожденияКод"
		);
		
		ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект("СтраныМира", СтранаПроисхождения, КодСтраныПроисхождения);
		
	КонецЕсли;
	
	Для Каждого ПрослеживаемыйТовар Из СведенияОПрослеживаемости.Строки Цикл
	
		НомерТовара = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ПрослеживаемыйТовар,
			Путь + ".НомерСтроки.СведенияОПрослеживаемости.НомерСтроки.НомерТовара");
		
		Если НЕ ЗначениеЗаполнено(НомерТовара) Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		НоваяСтрокаПрослеживаемости = ТаблицаПрослеживаемости.Добавить();
		
		НоваяСтрокаПрослеживаемости.НомерТовара = НомерТовара;
		НоваяСтрокаПрослеживаемости.ЕдиницаИзмеренияКод = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ПрослеживаемыйТовар,
			Путь + ".НомерСтроки.СведенияОПрослеживаемости.НомерСтроки.ЕдиницаИзмеренияКод");
		НоваяСтрокаПрослеживаемости.ЕдиницаИзмеренияНаименование = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ПрослеживаемыйТовар,
			Путь + ".НомерСтроки.СведенияОПрослеживаемости.НомерСтроки.ЕдиницаИзмеренияНаименование");
		НоваяСтрокаПрослеживаемости.Количество = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ПрослеживаемыйТовар,
			Путь + ".НомерСтроки.СведенияОПрослеживаемости.НомерСтроки.Количество");
		НоваяСтрокаПрослеживаемости.КоличествоУчетное = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ПрослеживаемыйТовар,
			Путь + ".НомерСтроки.СведенияОПрослеживаемости.НомерСтроки.КоличествоУчетное");
		
		НоваяСтрокаПрослеживаемости.РНПТ = НайтиСоздатьГТДТовара(НомерТовара, СтранаПроисхождения, Истина);
		
	КонецЦикла;
	
	ПозицияТовара.СведенияОПрослеживаемости = ТаблицаПрослеживаемости;

КонецПроцедуры

Процедура ДополнитьСведениямиОТаможеннойДекларацииУКД(СведенияОТоваре, ПозицияТовара)
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияТовара, "ГТД")
		ИЛИ НЕ ЗначениеЗаполнено(ПозицияТовара.Номенклатура) Тогда
		
		Возврат;
		
	КонецЕсли;

	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПозицияТовара.Номенклатура, "ВидНоменклатуры");
	
	Если ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
		
		Возврат;
		
	КонецЕсли;

	ЭтоРНПТ = Ложь;
	СведенияОПрослеживаемости = СведенияОТоваре.Строки.Найти(
		"СведенияОТоварах.НомерСтроки.СведенияОПрослеживаемости", "ПолныйПуть", Истина);
	
	Если СведенияОПрослеживаемости <> Неопределено
		И СведенияОПрослеживаемости.Строки.Количество() > 0
		И ЗначениеЗаполнено(СведенияОПрослеживаемости.Значение) Тогда

		ЭтоРНПТ = Истина;	
		
	КонецЕсли; 
	
	СведенияОТаможеннойДекларации = СведенияОТоваре.Строки.Найти(
		"СведенияОТоварах.НомерСтроки.СведенияОТаможеннойДекларации", "ПолныйПуть", Истина);
	
	Если СведенияОТаможеннойДекларации <> Неопределено И СведенияОТаможеннойДекларации.Строки.Количество() > 0 Тогда
		
		НомерТаможеннойДекларации = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТаможеннойДекларации.Строки[0],
			"СведенияОТоварах.НомерСтроки.СведенияОТаможеннойДекларации.НомерСтроки.ТаможеннаяДекларацияНомер");
		
		КодСтраныПроисхождения = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТаможеннойДекларации.Строки[0],
			"СведенияОТоварах.НомерСтроки.СведенияОТаможеннойДекларации.НомерСтроки.СтранаПроисхожденияКод");
		
		Если ЗначениеЗаполнено(НомерТаможеннойДекларации)
			И НомерТаможеннойДекларации <> "-" Тогда
			
			СтранаПроисхождения = Неопределено;
			ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект("СтраныМира", СтранаПроисхождения, КодСтраныПроисхождения);
			ПозицияТовара.ГТД = НайтиСоздатьГТДТовара(НомерТаможеннойДекларации, СтранаПроисхождения, ЭтоРНПТ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьСведениямиОПрослеживаемостиУКД(СведенияОТоваре, ПозицияТовара)

	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияТовара, "ГТД")
		ИЛИ НЕ ЗначениеЗаполнено(ПозицияТовара.Номенклатура) Тогда
		
		Возврат;
		
	КонецЕсли;

	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПозицияТовара.Номенклатура, "ВидНоменклатуры");
	
	Если ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
		
		Возврат;
		
	КонецЕсли;

	СведенияОПрослеживаемости = СведенияОТоваре.Строки.Найти(
		"СведенияОТоварах.НомерСтроки.СведенияОПрослеживаемости", "ПолныйПуть", Истина);
	
	Если СведенияОПрослеживаемости = Неопределено
		ИЛИ СведенияОПрослеживаемости.Строки.Количество() = 0
		ИЛИ НЕ ЗначениеЗаполнено(СведенияОПрослеживаемости.Значение) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТаблицаПрослеживаемости = ТаблицаСведенияОпрослеживаемостиУКД_2020();	
	ТаблицаПрослеживаемости.Колонки.Добавить("РНПТ", Новый ОписаниеТипов("СправочникСсылка.ГТД"));	

	// Найдем страну
	СтранаПроисхождения = Неопределено;
	СведенияОТаможеннойДекларации = СведенияОТоваре.Строки.Найти(
		"СведенияОТоварах.НомерСтроки.СведенияОТаможеннойДекларации", "ПолныйПуть", Истина);
	
	Если СведенияОТаможеннойДекларации <> Неопределено И СведенияОТаможеннойДекларации.Строки.Количество() > 0 Тогда
		
		КодСтраныПроисхождения = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОТаможеннойДекларации.Строки[0],
			"СведенияОТоварах.НомерСтроки.СведенияОТаможеннойДекларации.НомерСтроки.СтранаПроисхожденияКод"
		);
		
		ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект("СтраныМира", СтранаПроисхождения, КодСтраныПроисхождения);
		
	КонецЕсли;
	
	Для Каждого ПрослеживаемыйТовар Из СведенияОПрослеживаемости.Строки Цикл
	
		НоваяСтрокаПрослеживаемости = ТаблицаПрослеживаемости.Добавить();
		
		Для Каждого КолонкаТаблицы Из ТаблицаПрослеживаемости.Колонки Цикл
			
			ИмяРеквизита = КолонкаТаблицы.Имя;
			
			Если ИмяРеквизита = "РНПТ" Тогда
			
				 Продолжить;
			
			КонецЕсли;
				
			НоваяСтрокаПрослеживаемости[ИмяРеквизита] = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
				ПрослеживаемыйТовар,
				"СведенияОТоварах.НомерСтроки.СведенияОПрослеживаемости.НомерСтроки." + ИмяРеквизита
			); 
			
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрокаПрослеживаемости.НомерТовара)
			ИЛИ НоваяСтрокаПрослеживаемости.НомерТовара = "-" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрокаПрослеживаемости.РНПТ = НайтиСоздатьГТДТовара(НоваяСтрокаПрослеживаемости.НомерТовара, СтранаПроисхождения, Истина);
		
	КонецЦикла;
	
	ПозицияТовара.СведенияОПрослеживаемости = ТаблицаПрослеживаемости;

КонецПроцедуры

Процедура ДобавитьСведенияОИзмененииКоличества(СведенияОТоваре, НоваяСтрока)

	СведенияОИзмененииКоличества = Новый Структура();
	
	СведенияОИзмененииКоличества.Вставить("КоличествоДоКорректировки",
		ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОТоваре,
			"СведенияОТоварах.НомерСтроки.КоличествоДоКорректировки")
	);
	
	СведенияОИзмененииКоличества.Вставить("Количество",
		ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОТоваре,
			"СведенияОТоварах.НомерСтроки.Количество")
	);
	
	СведенияОИзмененииКоличества.Вставить("ЦенаЗаЕдиницуИзмеренияДоКорректировки",
		ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОТоваре,
			"СведенияОТоварах.НомерСтроки.ЦенаЗаЕдиницуИзмеренияДоКорректировки")
	); 
	
	СведенияОИзмененииКоличества.Вставить("ЦенаЗаЕдиницуИзмерения",
		ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОТоваре,
			"СведенияОТоварах.НомерСтроки.ЦенаЗаЕдиницуИзмерения")
	);
	
	СведенияОИзмененииКоличества.Вставить("СтоимостьТоваровБезНалогаДоКорректировки",
		ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОТоваре,
			"СведенияОТоварах.НомерСтроки.СтоимостьТоваровБезНалогаДоКорректировки")
	);
	
	СведенияОИзмененииКоличества.Вставить("СтоимостьТоваровБезНалога",
		ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОТоваре,
			"СведенияОТоварах.НомерСтроки.СтоимостьТоваровБезНалога")
	);
	
	СведенияОИзмененииКоличества.Вставить("СуммаНалогаДоКорректировки",
		ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОТоваре,
			"СведенияОТоварах.НомерСтроки.СуммаНалогаДоКорректировки")
	);
	
	СведенияОИзмененииКоличества.Вставить("СуммаНалога",
		ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(
			СведенияОТоваре,
			"СведенияОТоварах.НомерСтроки.СуммаНалога")
	);
	
	НоваяСтрока.СведенияОИзмененииКоличества = СведенияОИзмененииКоличества;
	
КонецПроцедуры

Функция НайтиСоздатьГТДТовара(НомерГТД, СтранаПроисхождения, ПрослеживаемыйТовар = Ложь)
	
	ГТД = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(НомерГТД) Тогда
		
		Возврат ГТД;
		
	КонецЕсли;
	
	ДополнительныеРеквизиты = Новый Структура();
	ДополнительныеРеквизиты.Вставить("РНПТ", ПрослеживаемыйТовар);
	
	Если ЗначениеЗаполнено(СтранаПроисхождения) Тогда
		
		ДополнительныеРеквизиты.Вставить("Страна", СтранаПроисхождения);
		
	КонецЕсли;
	
	ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект("ГТД", ГТД, НомерГТД, ДополнительныеРеквизиты);
	
	Если НЕ ЗначениеЗаполнено(ГТД) Тогда
		
		ГТД = СоздатьГТДТовара(НомерГТД, СтранаПроисхождения, ПрослеживаемыйТовар);
		
	КонецЕсли;
	
	Возврат ГТД;
	
КонецФункции

Функция ТаблицаСведенияОпрослеживаемостиУПД(ФорматУПД = "")
	
	ПоддерживаемыеФорматы = ФорматыЭДО_ФНС.ПоддерживаемыеФорматы();
	
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("НомерТовара"                 , ОбщегоНазначения.ОписаниеТипаСтрока(29));
	Результат.Колонки.Добавить("ЕдиницаИзмеренияКод"         , ОбщегоНазначения.ОписаниеТипаСтрока(4));
	Результат.Колонки.Добавить("ЕдиницаИзмеренияНаименование", ОбщегоНазначения.ОписаниеТипаСтрока(255));
	Результат.Колонки.Добавить("Количество"                  , ОбщегоНазначения.ОписаниеТипаЧисло(26, 11));
	Результат.Колонки.Добавить("КоличествоУчетное"           , ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	Если ФорматУПД = ПоддерживаемыеФорматы.УПД_5_02.ИнформацияПродавца ИЛИ 
		ФорматУПД = ПоддерживаемыеФорматы.УПД_5_03.ИнформацияПродавца Тогда
		Результат.Колонки.Добавить("СтоимостьБезНДС", ОбщегоНазначения.ОписаниеТипаЧисло(19, 0));
		Результат.Колонки.Добавить("ДополнительнаяИнформация", ОбщегоНазначения.ОписаниеТипаСтрока(255));
	Иначе
		Результат.Колонки.Добавить("СтоимостьБезНДС", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

#КонецОбласти

#Область Служебные

Функция ЭтоУПДОтКоммитента(ДеревоДанных, Путь = "")
	
	ОбстоятельстваФормированияСФ =ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных,
		Путь+"ДополнительныеСведенияОбУчастниках.ОбстоятельстваФормированияСФ");
	Возврат ОбстоятельстваФормированияКоммитента().Найти(ОбстоятельстваФормированияСФ) <> Неопределено;
	
КонецФункции

Функция ОбстоятельстваФормированияКоммитента()
	
	Возврат СтрРазделить("4 8", " ");
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область УПД

#Область Получение

Процедура НайтиСоздатьУПДДокументОПередаче(ДеревоДанных, СсылкаНаВладельца, СпособОбработки, ОписаниеОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеЗаполнения = Новый Структура("ЗаполнятьПоСтуктуре", Истина);
	ДополнитьДанныеЗаполненияВалютой(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияВходящимДокументом("Документа", ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияИсправлением(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияКонтрагентомИсточникГруппа(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОрганизациейИсточникГруппа(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияПодразделениемКомпании(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОснованиемДокументаОтгрузки(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияДоговорВзаиморасчетов(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияТоварами(ДеревоДанных, ДанныеЗаполнения);
	
	Если СпособОбработки = "ВозвратТоваровОтПокупателя" Тогда
		
		ЗаполнитьДокументВозвратТоваровОтПокупателя(ДанныеЗаполнения, СсылкаНаВладельца, Истина, ОписаниеОшибки);
		
	Иначе
		
		Если ДанныеЗаполнения.Исправление Тогда
			
			ЗаполнитьДокументКорректировкиПоступления(ДанныеЗаполнения, СсылкаНаВладельца, ОписаниеОшибки);
			
		Иначе
			
			ЗаполнитьДокументПоступленияТоваров(ДанныеЗаполнения, СсылкаНаВладельца, Истина, ОписаниеОшибки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НайтиСоздатьУПДСчетФактуру(ДеревоДанных, СсылкаНаВладельца, СпособОбработки, ОписаниеОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеЗаполнения = Новый Структура("ЗаполнятьПоСтуктуре", Истина);
	ДополнитьДанныеЗаполненияВалютой(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияИсправлением(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияВходящимДокументом("Документа", ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияКонтрагентомИсточникГруппа(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОрганизациейИсточникГруппа(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияПодразделениемКомпании(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияДоговорВзаиморасчетов(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияВидомСчетаФактуры(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОснованиемДляСчетаФактуры(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияТоварами(ДеревоДанных, ДанныеЗаполнения);
	
	ЗаполнитьДокументСчетФактурыПолученого(ДанныеЗаполнения, СсылкаНаВладельца, ОписаниеОшибки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область УКД

#Область Отправка

Функция ДайДанныеСчетаФактурыДляУКД(СчетФактура)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураВыданный.Ссылка КАК СчетФактура,
		|	СчетФактураВыданный.ДокументОснование КАК ДокументКорректировки,
		|	СчетФактураВыданный.Номер КАК Номер,
		|	СчетФактураВыданный.Дата КАК Дата,
		|	СчетФактураВыданный.ДоговорВзаиморасчетов КАК Договор,
		|	СчетФактураВыданный.ДоговорВзаиморасчетов.ДатаНачала КАК ДоговорДата,
		|	СчетФактураВыданный.ДоговорВзаиморасчетов.НомерДоговора КАК ДоговорНомер,
		|	СчетФактураВыданный.Исправление КАК Исправление,
		|	СчетФактураВыданный.НомерИсправления КАК НомерИсправления,
		|	СчетФактураВыданный.Дата КАК ДатаИсправления,
		|	СчетФактураВыданный.ЕстьКорректировка КАК ЕстьКорректировка,
		|	СчетФактураВыданный.НомерИсправляемогоКорректировочногоДокумента КАК НомерИсправляемогоКорректировочногоДокумента,
		|	СчетФактураВыданный.ДатаИсправляемогоКорректировочногоДокумента КАК ДатаИсправляемогоКорректировочногоДокумента,
		|	СчетФактураВыданный.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
		|	СчетФактураВыданный.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
		|	СчетФактураВыданный.УчитыватьИсправлениеИсходногоДокумента КАК УчитыватьИсправлениеИсходногоДокумента,
		|	СчетФактураВыданный.НомерИсправленияИсходногоДокумента КАК НомерИсправленияИсходногоДокумента,
		|	СчетФактураВыданный.ДатаИсправленияИсходногоДокумента КАК ДатаИсправленияИсходногоДокумента,
		|	СчетФактураВыданный.Организация КАК Организация,
		|	СчетФактураВыданный.Организация КАК ЮрФизЛицо,
		|	СчетФактураВыданный.Организация КАК Поставщик,
		|	ВЫБОР
		|		КОГДА СчетФактураВыданный.Контрагент.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			СчетФактураВыданный.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ
		|			СчетФактураВыданный.Контрагент
		|	КОНЕЦ КАК Покупатель,
		|	ВЫБОР
		|		КОГДА СчетФактураВыданный.Контрагент.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			СчетФактураВыданный.Контрагент.ГоловнойКонтрагент
		|		ИНАЧЕ
		|			СчетФактураВыданный.Контрагент
		|	КОНЕЦ КАК Плательщик,
		|	ВЫБОР
		|		КОГДА СчетФактураВыданный.Грузоотправитель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			СчетФактураВыданный.Грузоотправитель
		|		КОГДА (НЕ ВЫРАЗИТЬ(СчетФактураВыданный.ПодразделениеКомпании.КПП КАК Строка(2)) = """") И 
		|			(НЕ СчетФактураВыданный.ПодразделениеКомпании.КПП = СчетФактураВыданный.Организация.КПП) ТОГДА
		|			СчетФактураВыданный.ПодразделениеКомпании
		|		ИНАЧЕ
		|			СчетФактураВыданный.Организация
		|	КОНЕЦ КАК Грузоотправитель,
		|	ВЫБОР
		|		КОГДА СчетФактураВыданный.Грузополучатель <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			СчетФактураВыданный.Грузополучатель
		|		ИНАЧЕ
		|			СчетФактураВыданный.Контрагент
		|	КОНЕЦ КАК Грузополучатель,
		|	СчетФактураВыданный.ПодразделениеКомпании.Наименование КАК ПодразделениеНаименование,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(СчетФактураВыданный.ПодразделениеКомпании.КПП КАК Строка(2)) = """" ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|	КОНЕЦ КАК ЭтоСтруктурноеПодразделение,
		|	NULL КАК Сделка,
		|	СчетФактураВыданный.ДокументОснование.Менеджер КАК Менеджер,
		|	СчетФактураВыданный.ДоговорВзаиморасчетов.Наименование КАК ДокументОснованиеНаименование,
		|	СчетФактураВыданный.ДокументОснование.Номер КАК ДокументОснованиеНомер,
		|	СчетФактураВыданный.ДокументОснование.Дата КАК ДокументОснованиеДата,
		|	СчетФактураВыданный.ПодразделениеКомпании КАК Подразделение,
		|	СчетФактураВыданный.ВалютаДокумента КАК ВалютаДокумента,
		|	СчетФактураВыданный.КурсДокумента КАК Курс,
		|	СчетФактураВыданный.ТипЦен.ЦенаВключаетНДС КАК СуммаВключаетНДС,
		|	СчетФактураВыданный.ДокументОснование.Менеджер КАК ОтпускПроизвел,
		|	СчетФактураВыданный.Организация.ИНН КАК ИННпоставщика,
		|	СчетФактураВыданный.Организация.КПП КАК КППпоставщика,
		|	СчетФактураВыданный.Контрагент.ИНН КАК ИННпокупателя,
		|	СчетФактураВыданный.Контрагент.КПП КАК КППпокупателя,
		|	СчетФактураВыданный.ХозОперация КАК ХозОперация,
		|	СчетФактураВыданный.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияТоваровКомиссия) КАК ЭтоКомиссия,
		|	СчетФактураВыданный.Ссылка КАК Ссылка,
		|	СчетФактураВыданный.ВалютаДокумента.Код КАК КодВалюты,
		|	СчетФактураВыданный.ВалютаДокумента.Наименование КАК НаименованиеВалюты,
		|	СчетФактураВыданный.ВалютаДокумента.НаименованиеПолное КАК НаименованиеПолноеВалюты,
		|	СчетФактураВыданный.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
		|	СчетФактураВыданный.ДоговорВзаиморасчетов.ДатаНачала КАК ДатаДоговора,
		|	СчетФактураВыданный.ДоговорВзаиморасчетов.НомерДоговора КАК НомерДоговора,
		|	СчетФактураВыданный.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосударственногоКонтракта,
		|	СчетФактураВыданный.ДокументОснование КАК ДокументОснование,
		|	СчетФактураВыданный.ДокументОснование КАК ДокументСМаркировкамиПосле,
		|	СчетФактураВыданный.ДокументОснование.ДокументОснование КАК ДокументСМаркировкамиДо
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Ссылка = &СчетФактура"
	);
	Запрос.УстановитьПараметр("СчетФактура", СчетФактура);
	Шапка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК Товар,
		|	КорректировкаРеализацииТовары.Номенклатура,
		|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры,
		| ВЫБОР
		|		КОГДА КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|		ТОГДА КорректировкаРеализацииТовары.Номенклатура.Наименование + "" "" + КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры.Наименование
		|		ИНАЧЕ КорректировкаРеализацииТовары.Номенклатура.Наименование
		|	КОНЕЦ КАК ТоварНаименование,
		|	КорректировкаРеализацииТовары.Количество КАК Количество,
		|	КорректировкаРеализацииТовары.КоличествоПоДокументуРеализации КАК КоличествоДоКорректировки,
		|	КорректировкаРеализацииТовары.КоличествоРазница,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмерения,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмеренияПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.Коэффициент,
		|	КорректировкаРеализацииТовары.КоэффициентПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.Цена,
		|	КорректировкаРеализацииТовары.Сумма,
		|	КорректировкаРеализацииТовары.СтавкаНДС,
		|	КорректировкаРеализацииТовары.СуммаНДС,
		|	КорректировкаРеализацииТовары.СуммаНДСПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.СуммаНДСРазница,
		|	КорректировкаРеализацииТовары.СуммаВсего,
		|	КорректировкаРеализацииТовары.СуммаВсегоПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.СуммаВсегоРазница,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Наименование КАК ЕдиницаИзмеренияНаименование,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмеренияПоДокументуРеализации.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКодДоКорректировки,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмеренияПоДокументуРеализации.ЕдиницаПоКлассификатору.Наименование КАК ЕдиницаИзмеренияНаименованиеДоКорректировки,
		|	КорректировкаРеализацииТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ИЗ
		|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
		|ГДЕ
		|	КорректировкаРеализацииТовары.Ссылка = &ДокументКорректировки
		|	И (КорректировкаРеализацииТовары.КоличествоРазница <> 0
		|	ИЛИ КорректировкаРеализацииТовары.СуммаВсегоРазница <> 0)
		|"
	);
	Запрос.УстановитьПараметр("ДокументКорректировки", Шапка.ДокументКорректировки);
	Товары = ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
	Возврат Новый Структура("Шапка,Товары", Шапка, Товары);
	
КонецФункции

Функция ЗаполнитьДеревоДанныхУКД(ДанныеДляФормированияЭД, СтруктураЭД, ДеревоДанных)
	
	Шапка = ДанныеДляФормированияЭД.Шапка;
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"СсылкаКорректировочногоСчетаФактуры",
		Шапка.СчетФактура
	);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"СодержаниеОперации",
		"Предлагаю изменить стоимость"
	);
	
	НомерДокумента = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(Шапка);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "НомерДокумента", НомерДокумента);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаДокумента",  Шапка.Дата);
	
	Если Шапка.Исправление Тогда
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных,
			"НомерИсправления",
			Шапка.НомерИсправления
		);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных,
			"ДатаИсправления",
			Шапка.ДатаИсправления
		);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Шапка.НомерИсходногоДокумента) Тогда
		
		НомерДокумента = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(
			Новый Структура("Номер", Шапка.НомерИсходногоДокумента));
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "НомерИсходногоДокумента", НомерДокумента);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных,
			"ДатаИсходногоДокумента",
			Шапка.ДатаИсходногоДокумента
		);
		
		Если Шапка.УчитыватьИсправлениеИсходногоДокумента Тогда
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных,
				"НомерИсправленияИсходногоДокумента",
				Шапка.НомерИсправленияИсходногоДокумента
			);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных,
				"ДатаИсправленияИсходногоДокумента",
				Шапка.ДатаИсправленияИсходногоДокумента
			);
			
		КонецЕсли;
			
	КонецЕсли;
	
	СведенияОПокупателе = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	СведенияОПоставщике = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Шапка.Покупатель, СведенияОПокупателе);
	ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(Шапка.Поставщик, СведенияОПоставщике);
	СведенияОПокупателе.ИНН = Шапка.ИННпокупателя;
	СведенияОПокупателе.КПП = Шапка.КППпокупателя;
	СведенияОПоставщике.ИНН = Шапка.ИННпоставщика;
	СведенияОПоставщике.КПП = Шапка.КППпоставщика;
	
	ЗаполнитьДанныеУчастникаУПД(ДеревоДанных, СведенияОПоставщике, "СведенияОПродавце", "Юр");
	ЗаполнитьДанныеУчастникаУПД(ДеревоДанных, СведенияОПокупателе, "СведенияОПокупателе", "Юр");
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"СоставительДокументаНаименование",
		СведенияОПоставщике.ПолноеНаименование
	);
	
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ВалютаКод", Шапка.КодВалюты);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"ДополнительныеСведенияОбУчастниках.ВалютаНаименование",
		Шапка.НаименованиеПолноеВалюты
	);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"ДополнительныеСведенияОбУчастниках.ВалютаКурс",
		Шапка.Курс
	);
	
	ДокументыОснования = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Шапка.ДокументКорректировки);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных,
		"ДокументыОснованияСчетаФактуры",
		ДокументыОснования
	);
	
	Возврат ДеревоДанных;
	
КонецФункции

#КонецОбласти

#Область Получение

Функция НайтиСоздатьУКДДокументКорректировки(ДеревоДанных, СсылкаНаВладельца, СпособОбработки, ОписаниеОшибки)
	
	ДанныеЗаполнения = Новый Структура(
		"ЗаполнятьПоСтуктуре,ХозОперация,СсылкаНаВладельца",
		Истина,
		Справочники.ХозОперации.КорректировкаПоступленияКорректировкаПоСогласованиюСторон,
		СсылкаНаВладельца
	);
	ДополнитьДанныеЗаполненияВалютой(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияИсправлением(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияВходящимДокументом("Документа", ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияИсходнымДокументом(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияКонтрагентомИсточникГруппа(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОрганизациейИсточникГруппа(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияПодразделениемКомпанииИсточникГруппа(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияДоговорВзаиморасчетов(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОснованиемСчетаФактуры(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияТоварамиУКД(ДеревоДанных, ДанныеЗаполнения, "КорректировкаПоступления");
	
	Если ДанныеЗаполнения.Исправление Тогда
		
		ДанныеЗаполнения.ХозОперация =  Справочники.ХозОперации.КорректировкаПоступленияИсправлениеВПервичныхДокументах;
		
	КонецЕсли;
	
	ЗаполнитьДокументКорректировкиПоступления(ДанныеЗаполнения, СсылкаНаВладельца, ОписаниеОшибки);
	
КонецФункции

Функция НайтиСоздатьУКДКорректировочныйСчетФактуру(ДеревоДанных, СсылкаНаВладельца, СпособОбработки, ОписаниеОшибки)
	
	ДанныеЗаполнения = Новый Структура(
		"ЗаполнятьПоСтуктуре,ХозОперация",
		Истина,
		Справочники.ХозОперации.СчетФактураПолученныйКорректировка
	);
	ДополнитьДанныеЗаполненияВалютой(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияИсправлением(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияВходящимДокументом("Документа", ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияИсходнымДокументом(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияКонтрагентомИсточникГруппа(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОрганизациейИсточникГруппа(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияПодразделениемКомпанииИсточникГруппа(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияДоговорВзаиморасчетов(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияОснованиемДляСчетаФактуры(ДеревоДанных, ДанныеЗаполнения);
	ДополнитьДанныеЗаполненияТоварамиУКД(ДеревоДанных, ДанныеЗаполнения, "СчетФактураПолученный");
	
	ЗаполнитьДокументСчетФактурыПолученогоУКД(ДанныеЗаполнения, СсылкаНаВладельца, ОписаниеОшибки);

КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПередачаТоваров

#Область Отправка

Процедура ЗаполнитьДанныеУчастника(ДеревоДанных,
                                   СведенияОбУчастнике,
                                   ВидУчастника,
                                   ВидАдреса = "Юр",
                                   КорневойЭлементДерева = "",
                                   ДатаКИ = Неопределено) Экспорт
	
	Если СведенияОбУчастнике.ЮрФизЛицо = Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
		
		СохранитьРеквизитВДереве(ДеревоДанных, ВидУчастника + ".ТипУчастника.ЮЛ.ИНН", СведенияОбУчастнике.ИНН);
		СохранитьРеквизитВДереве(ДеревоДанных, ВидУчастника + ".ТипУчастника.ЮЛ.КПП", СведенияОбУчастнике.КПП);
			
		СохранитьРеквизитВДереве(ДеревоДанных, ВидУчастника + ".ТипУчастника.ЮЛ.НаименованиеОрганизации",
			СведенияОбУчастнике.ПолноеНаименование);
	
	Иначе
			
		ПутьКРеквизитуДерева = ВидУчастника + ".ТипУчастника";	
		
		Если ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ПутьКРеквизитуДерева + ".ИП") Тогда
			
			ПутьКРеквизитуДерева = ПутьКРеквизитуДерева + ".ИП";
			
		Иначе
			
			ПутьКРеквизитуДерева = ПутьКРеквизитуДерева + ".ФЛ";
			
		КонецЕсли;
		
		СуществуетРеквизитПолноеНаименование = ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных,
			ПутьКРеквизитуДерева + ".ПолноеНаименование");
		
		Если СуществуетРеквизитПолноеНаименование Тогда
			
			СохранитьРеквизитВДереве(ДеревоДанных, ПутьКРеквизитуДерева + ".ПолноеНаименование",
				СведенияОбУчастнике.ПолноеНаименование);
				
		КонецЕсли;
		
		СохранитьРеквизитВДереве(ДеревоДанных, ПутьКРеквизитуДерева + ".ИНН", СведенияОбУчастнике.ИНН);
		СохранитьРеквизитВДереве(ДеревоДанных, ПутьКРеквизитуДерева + ".Фамилия", СведенияОбУчастнике.Фамилия);
		СохранитьРеквизитВДереве(ДеревоДанных, ПутьКРеквизитуДерева + ".Имя", СведенияОбУчастнике.Имя);
		СохранитьРеквизитВДереве(ДеревоДанных, ПутьКРеквизитуДерева + ".Отчество", СведенияОбУчастнике.Отчество);
		
	КонецЕсли;
	
	СведенияОбУчастнике.Вставить("ДатаКИ", ДатаКИ);
	АдресУчастника = Новый Структура;
	ПолучитьАдресСтруктурой(АдресУчастника, СведенияОбУчастнике, "Ссылка", ВидАдреса);
	
	Если АдресУчастника.Свойство("АдресРФ") Тогда
		
		ПолныйПуть = ВидУчастника + ".Адрес.Структурированный";
		
		Если ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ПолныйПуть) Тогда
			ТипАдреса = ?(АдресУчастника.АдресРФ, "Структурированный", "Произвольный");
		Иначе
			ТипАдреса = "Произвольный";
		КонецЕсли;
		
		ЗаполнитьАдресВДереве(ДеревоДанных, АдресУчастника, ТипАдреса, ВидУчастника, КорневойЭлементДерева);
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(СведенияОбУчастнике.Телефоны) Тогда
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных,
			ВидУчастника + ".Контакт.Телефон",
			СведенияОбУчастнике.Телефоны,
			КорневойЭлементДерева
		);
		
	КонецЕсли;	
	
	НомерСчета = "";
	
	Если СведенияОбУчастнике.Свойство("НомерСчета", НомерСчета)
		И ЗначениеЗаполнено(НомерСчета)
		И ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ВидУчастника + ".БанковскийСчет") Тогда
		
		Банк = "";
		БИК = "";
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных,
			ВидУчастника + ".БанковскийСчет.НомерСчета",
			НомерСчета,
			КорневойЭлементДерева
		);
		
		Если СведенияОбУчастнике.Свойство("Банк", Банк) И ЗначениеЗаполнено(Банк) Тогда
			
			Если ТипЗнч(Банк) = Тип("Строка") Тогда
				
				БанкНаименование = Банк;
				
			Иначе
				
				БанкНаименование = Банк.Наименование;
				
			КонецЕсли;
				
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных,
				ВидУчастника + ".БанковскийСчет.НаимБанк",
				БанкНаименование,
				КорневойЭлементДерева
			);
			
		КонецЕсли;
		
		Если СведенияОбУчастнике.Свойство("БИК", БИК) И ЗначениеЗаполнено(БИК) Тогда
			
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных,
				ВидУчастника + ".БанковскийСчет.БИК",
				БИК,
				КорневойЭлементДерева
			);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Значение = "";
	ПолныйПуть = ВидУчастника + ".Руководитель";
	
	Если ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ПолныйПуть)
		И СведенияОбУчастнике.Свойство("Комментарий", Значение) Тогда
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных,
			ПолныйПуть + ".Фамилия",
			Значение.Фамилия,
			КорневойЭлементДерева
		);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных,
			ПолныйПуть + ".Имя",
			Значение.Имя,
			КорневойЭлементДерева
		);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных,
			ПолныйПуть + ".Отчество",
			Значение.Отчество,
			КорневойЭлементДерева
		);
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных,
			ПолныйПуть + ".Должность",
			Значение.Должность,
			КорневойЭлементДерева
		);
		
	КонецЕсли;
	
	ПолныйПуть = ВидУчастника + ".Комментарий";
	Значение = "";
	
	Если ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ПолныйПуть)
		И СведенияОбУчастнике.Свойство("Комментарий", Значение) Тогда
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных,
			ПолныйПуть,
			Значение,
			КорневойЭлементДерева
		);
		
	КонецЕсли;
	
	ПолныйПуть = ВидУчастника + ".КодОКПО";
	Значение = "";
	
	Если ЭлектронноеВзаимодействие.СуществуетРеквизитВДереве(ДеревоДанных, ПолныйПуть)
		И СведенияОбУчастнике.Свойство("КодПоОКПО", Значение) Тогда
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных,
			ПолныйПуть,
			Значение,
			КорневойЭлементДерева
		);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьИтоговыеСуммы(ИтоговыеСуммы, ДанныеСтроки)
	
	Если ЗначениеЗаполнено(ДанныеСтроки.КоличествоМест) Тогда
		
		КоличествоМест = ДанныеСтроки.КоличествоМест;
		
		Если КоличествоМест <> Цел(КоличествоМест) Тогда
			
			КоличествоМест = Цел(КоличествоМест) + 1;
			
		КонецЕсли;
		
	Иначе
		
		КоличествоМест = 0;
		
	КонецЕсли;
	
	ИтоговыеСуммы.КоличествоМест = ИтоговыеСуммы.КоличествоМест + КоличествоМест;
	ИтоговыеСуммы.СуммаБезНДС    = ИтоговыеСуммы.СуммаБезНДС + ДанныеСтроки.СуммаБезНДС;
	ИтоговыеСуммы.СуммаНДС       = ИтоговыеСуммы.СуммаНДС + ДанныеСтроки.СуммаНДС;
	ИтоговыеСуммы.СуммаСНДС      = ИтоговыеСуммы.СуммаСНДС + ДанныеСтроки.СуммаВсего;
	ИтоговыеСуммы.МассаНетто     = ИтоговыеСуммы.МассаНетто + ДанныеСтроки.МассаНетто;
	ИтоговыеСуммы.КоличествоПорядковыхНомеровЗаписей = ИтоговыеСуммы.КоличествоПорядковыхНомеровЗаписей + 1;
			
КонецПроцедуры

#КонецОбласти

#Область Получение

Процедура ДополнитьДанныеЗаполненияТоварамиТОРГ12(ДеревоДанных, ДанныеЗаполнения)
	
	Товары = НоваяТаблицаТоваров("ПоступлениеТоваров");
	
	СведенияОТоварах = ДеревоДанных.Строки.Найти("ТаблицаТоваров", "ПолныйПуть");
	
	Для Каждого СведенияОТоваре Из СведенияОТоварах.Строки Цикл
		
		НоваяСтрока = Товары.Добавить();		
		ЗаполнитьСлужебныеРеквизитыПозицииТовара(НоваяСтрока);
		ЗаполнитьТоварыСопоставленнымиДаннымиТОРГ12(СведенияОТоваре, НоваяСтрока);
		ЗаполнитьТоварыСуммамиТОРГ12(СведенияОТоваре, НоваяСтрока);
		
	КонецЦикла;
	
	ДанныеЗаполнения.Вставить("Товары", Товары);
	
КонецПроцедуры

Процедура ЗаполнитьТоварыСопоставленнымиДаннымиТОРГ12(СведенияОТоваре, ПозицияТовара)
	
	Сопоставление = СведенияОТоваре.Строки.Найти(
		"ТаблицаТоваров.НомерСтроки.Сопоставление",
		"ПолныйПуть",
		Истина
	);
	
	Если Сопоставление <> Неопределено Тогда
		
		Номенклатура = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
			"ТаблицаТоваров.НомерСтроки.Сопоставление.НоменклатураИБ");
	
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			
			ПозицияТовара.Номенклатура = Номенклатура;
			
		КонецЕсли;
		
		Характеристика = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
			"ТаблицаТоваров.НомерСтроки.Сопоставление.ХарактеристикаИБ");
	
		Если ЗначениеЗаполнено(Характеристика) Тогда
			
			ПозицияТовара.ХарактеристикаНоменклатуры = Характеристика;
			
		КонецЕсли;
		
		Упаковка = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
			"ТаблицаТоваров.НомерСтроки.Сопоставление.УпаковкаИБ");
	
		Если ЗначениеЗаполнено(Упаковка) Тогда
			
			ПозицияТовара.ЕдиницаИзмерения = Упаковка;
			
			Если ТипЗнч(Упаковка) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
				
				ПозицияТовара.Коэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Упаковка, "Коэффициент");
				
			Иначе
				
				ПозицияТовара.Коэффициент = 1;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗаполнитьТоварыСуммамиТОРГ12(СведенияОТоваре, ПозицияТовара)
	
	ПозицияТовара.Количество = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"ТаблицаТоваров.НомерСтроки.КоличествоМест");
	ПозицияТовара.Цена = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"ТаблицаТоваров.НомерСтроки.Цена");
	ПозицияТовара.Сумма = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"ТаблицаТоваров.НомерСтроки.СуммаБезНДС");
	ПозицияТовара.СуммаВсего = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"ТаблицаТоваров.НомерСтроки.СуммаСНДС");
	ПозицияТовара.СтавкаНДС = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"ТаблицаТоваров.НомерСтроки.СтавкаНДС");
	ПозицияТовара.СуммаНДС = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"ТаблицаТоваров.НомерСтроки.СуммаНДС");
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияТовара, "КоличествоБазовое") Тогда
		
		ПозицияТовара.КоличествоБазовое = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
			"ТаблицаТоваров.НомерСтроки.КоличествоВОдномМесте");
		
	КонецЕсли;
	
	Если ПозицияТовара.Количество = 0 Тогда
		
		ПозицияТовара.Количество = 1;
		
	КонецЕсли;
	
	Если ПозицияТовара.Цена = 0 Тогда
		
		ПозицияТовара.Цена = ПозицияТовара.Сумма;
		
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияТовара, "КоличествоПоНакладной") Тогда
		
		ПозицияТовара.КоличествоПоНакладной = ПозицияТовара.Количество;
		
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПозицияТовара, "КоличествоДок") Тогда
		
		ПозицияТовара.КоличествоДок     = ПозицияТовара.Количество;
		ПозицияТовара.ЦенаДок           = ПозицияТовара.Цена;
		ПозицияТовара.СуммаДок          = ПозицияТовара.СуммаВсего;
		//ПозицияТовара.КоличествоМестДок = ПозицияТовара.КоличествоМест;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПередачаРезультатовРабот

#Область Получение

Процедура ДополнитьДанныеЗаполненияТоварамиАкт501(ДеревоДанных, ДанныеЗаполнения)
	
	Товары = НоваяТаблицаТоваров("ПоступлениеТоваров");
	
	СведенияОТоварах = ДеревоДанных.Строки.Найти("ТаблицаУслуг", "ПолныйПуть");
	
	Для Каждого СведенияОТоваре Из СведенияОТоварах.Строки Цикл
		
		НоваяСтрока = Товары.Добавить();		
		ЗаполнитьСлужебныеРеквизитыПозицииТовара(НоваяСтрока);
		ЗаполнитьТоварыСопоставленнымиДаннымиАкт501(СведенияОТоваре, НоваяСтрока);
		ЗаполнитьТоварыСуммамиАкт501(СведенияОТоваре, НоваяСтрока);
		
	КонецЦикла;
	
	ДанныеЗаполнения.Вставить("Товары", Товары);
	
КонецПроцедуры

Процедура ЗаполнитьТоварыСопоставленнымиДаннымиАкт501(СведенияОТоваре, ПозицияТовара)
	
	Сопоставление = СведенияОТоваре.Строки.Найти(
		"ТаблицаУслуг.НомерСтроки.Сопоставление",
		"ПолныйПуть",
		Истина
	);
	
	Если Сопоставление <> Неопределено Тогда
		
		Номенклатура = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
			"ТаблицаУслуг.НомерСтроки.Сопоставление.НоменклатураИБ");
	
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			
			ПозицияТовара.Номенклатура = Номенклатура;
			
		КонецЕсли;
		
		Характеристика = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
			"ТаблицаУслуг.НомерСтроки.Сопоставление.ХарактеристикаИБ");
	
		Если ЗначениеЗаполнено(Характеристика) Тогда
			
			ПозицияТовара.ХарактеристикаНоменклатуры = Характеристика;
			
		КонецЕсли;
		
		Упаковка = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
			"ТаблицаУслуг.НомерСтроки.Сопоставление.УпаковкаИБ");
	
		Если ЗначениеЗаполнено(Упаковка) Тогда
			
			ПозицияТовара.ЕдиницаИзмерения = Упаковка;
			
			Если ТипЗнч(Упаковка) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
				
				ПозицияТовара.Коэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Упаковка, "Коэффициент");
				
			Иначе
				
				ПозицияТовара.Коэффициент = 1;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗаполнитьТоварыСуммамиАкт501(СведенияОТоваре, ПозицияТовара)
	
	ПозицияТовара.Количество = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"ТаблицаУслуг.НомерСтроки.Количество");
	ПозицияТовара.Цена = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"ТаблицаУслуг.НомерСтроки.Цена");
	ПозицияТовара.Сумма = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"ТаблицаУслуг.НомерСтроки.СуммаБезНДС");
	ПозицияТовара.СуммаВсего = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"ТаблицаУслуг.НомерСтроки.СуммаСНДС");
	ПозицияТовара.СтавкаНДС = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"ТаблицаУслуг.НомерСтроки.СуммаНДС");
	ПозицияТовара.СуммаНДС = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"ТаблицаУслуг.НомерСтроки.СуммаНДС");
	ПозицияТовара.КоличествоБазовое = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре,
		"ТаблицаУслуг.НомерСтроки.Количество");
	
	Если ПозицияТовара.Количество = 0 Тогда
		
		ПозицияТовара.Количество = 1;
		
	КонецЕсли;
	
	Если ПозицияТовара.Цена = 0 Тогда
		
		ПозицияТовара.Цена = ПозицияТовара.Сумма;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ЧтениеДанныхИзБазы

Функция ИнформацияПокупателяУПД(Основания)
	
	ПоступлениеТоваров = Документы.ПоступлениеТоваров.ПустаяСсылка();
	СчетФактура        = Документы.СчетФактураПолученный.ПустаяСсылка();
	
	Для Каждого Основание Из Основания Цикл
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
			ПоступлениеТоваров = Основание;
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			СчетФактура = Основание;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПоступлениеТоваров) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПоступлениеТоваров.Дата КАК ДатаПолученияТоваров,
		|	ПоступлениеТоваров.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ПоступлениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.УслугиСтороннихОрганизаций) КАК ЭтоАкт
		|ИЗ
		|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
		|ГДЕ
		|	ПоступлениеТоваров.Ссылка = &Основание
		|");
		Запрос.УстановитьПараметр("Основание", ПоступлениеТоваров);
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатыЗапроса = Запрос.Выполнить();
		
		Результат = Новый Структура(
		"СодержаниеОперации,ДатаПолученияТоваров,ОрганизацияНаименованиеПолное,КодИтога",
		"-",
		ТекущаяДатаСеанса(),
		"-",
		"1"
		);
		
		Если Не РезультатыЗапроса.Пустой() Тогда
			
			Выборка = РезультатыЗапроса.Выбрать();
			Выборка.Следующий();
			
			Если Выборка.ЭтоАкт Тогда
				Результат.СодержаниеОперации = НСтр("ru = 'Услуги получены, претензий нет.'");
			Иначе
				Результат.СодержаниеОперации = НСтр("ru = 'Товары и услуги принял без претензий.'");
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
			
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(СчетФактура) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СчетФактураПолученный.Дата КАК ДатаПолученияТоваров,
		|	СчетФактураПолученный.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	СчетФактураПолученный.ДокументОснование.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.УслугиСтороннихОрганизаций) КАК ЭтоАкт
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	СчетФактураПолученный.Ссылка = &Основание"
		);
		Запрос.УстановитьПараметр("Основание", СчетФактура);
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатыЗапроса = Запрос.Выполнить();
		
		Результат = Новый Структура(
		"СодержаниеОперации,ДатаПолученияТоваров,ОрганизацияНаименованиеПолное,КодИтога",
		"-",
		ТекущаяДатаСеанса(),
		"-",
		"1"
		);
		
		Если Не РезультатыЗапроса.Пустой() Тогда
			
			Выборка = РезультатыЗапроса.Выбрать();
			Выборка.Следующий();
			
			Если Выборка.ЭтоАкт Тогда
				Результат.СодержаниеОперации = НСтр("ru = 'Услуги получены, претензий нет.'");
			Иначе
				Результат.СодержаниеОперации = НСтр("ru = 'Товары и услуги принял без претензий.'");
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИнформацияПокупателяУКД(Основания)
	
	ДокументОснование = Документы.СчетФактураПолученный.ПустаяСсылка();
	
	Для Каждого Основание Из Основания Цикл
		
		ДокументОснование = Основание;
		Прервать;
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПоступлениеТоваров.Дата КАК ДатаСогласования,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ПоступлениеТоваров.Организация.НаименованиеПолное КАК Строка(2)) = """" ТОГДА
		|			ПоступлениеТоваров.Организация.Наименование
		|		ИНАЧЕ
		|			ПоступлениеТоваров.Организация.НаименованиеПолное
		|	КОНЕЦ КАК ОрганизацияНаименованиеПолное
		|ИЗ
		|	Документ.КорректировкаПоступления КАК ПоступлениеТоваров
		|ГДЕ
		|	ПоступлениеТоваров.Ссылка = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетФактураПолученный.Дата КАК ДатаСогласования,
		|	СчетФактураПолученный.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	СчетФактураПолученный.Ссылка = &Основание"
	);
	Запрос.УстановитьПараметр("Основание", ДокументОснование);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура(
		"СодержаниеОперации,ДатаСогласования,ОрганизацияНаименованиеПолное",
		"-",
		ТекущаяДатаСеанса(),
		НСтр("ru = 'С изменением стоимости согласен.'")
	);
	
	Если НЕ РезультатыЗапроса[0].Пустой() Тогда
		
		КорректировкаПоступления = РезультатыЗапроса[0].Выбрать();
		КорректировкаПоступления.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, КорректировкаПоступления);
		
	ИначеЕсли НЕ РезультатыЗапроса[1].Пустой() Тогда
		
		СчетФактура = РезультатыЗапроса[1].Выбрать();
		СчетФактура.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, СчетФактура);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИнформацияПокупателяУПД_5_02(ПоступлениеТоваров, СчетФактура, Отказ)
	
	Если ЗначениеЗаполнено(ПоступлениеТоваров) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПоступлениеТоваров.Дата КАК ДатаПолученияТоваров,
		|	ПоступлениеТоваров.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ПоступлениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.УслугиСтороннихОрганизаций) КАК ЭтоАкт
		|ИЗ
		|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
		|ГДЕ
		|	ПоступлениеТоваров.Ссылка = &Основание
		|");
		Запрос.УстановитьПараметр("Основание", ПоступлениеТоваров);
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатыЗапроса = Запрос.Выполнить();
		
		Результат = Новый Структура(
		"СодержаниеОперации,ДатаПолученияТоваров,ОрганизацияНаименованиеПолное,КодИтога",
		"-",
		ТекущаяДатаСеанса(),
		"-",
		"1"
		);
		
		Если Не РезультатыЗапроса.Пустой() Тогда
			
			Выборка = РезультатыЗапроса.Выбрать();
			Выборка.Следующий();
			
			Если Выборка.ЭтоАкт Тогда
				Результат.СодержаниеОперации = НСтр("ru = 'Услуги получены, претензий нет.'");
			Иначе
				Результат.СодержаниеОперации = НСтр("ru = 'Товары и услуги принял без претензий.'");
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
			
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(СчетФактура) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СчетФактураПолученный.Дата КАК ДатаПолученияТоваров,
		|	СчетФактураПолученный.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	СчетФактураПолученный.ДокументОснование.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.УслугиСтороннихОрганизаций) КАК ЭтоАкт
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	СчетФактураПолученный.Ссылка = &Основание"
		);
		Запрос.УстановитьПараметр("Основание", СчетФактура);
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатыЗапроса = Запрос.Выполнить();
		
		Результат = Новый Структура(
		"СодержаниеОперации,ДатаПолученияТоваров,ОрганизацияНаименованиеПолное,КодИтога",
		"-",
		ТекущаяДатаСеанса(),
		"-",
		"1"
		);
		
		Если Не РезультатыЗапроса.Пустой() Тогда
			
			Выборка = РезультатыЗапроса.Выбрать();
			Выборка.Следующий();
			
			Если Выборка.ЭтоАкт Тогда
				Результат.СодержаниеОперации = НСтр("ru = 'Услуги получены, претензий нет.'");
			Иначе
				Результат.СодержаниеОперации = НСтр("ru = 'Товары и услуги принял без претензий.'");
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РаботаСДокументаВБазе

Процедура ЗаполнитьДокументПоступленияТоваров(ДанныеЗаполнения, СсылкаНаВладельца, Записывать, ОписаниеОшибки)
	
	// Разделим строки товаров, если пристутствуют сведения о прослеживаемости.
	Товары = ДанныеЗаполнения.Товары;
	
	СтрокиКУдалению = Новый Массив();
	РазделитьТоварыПоДаннымСведенийОПрослеживаемости(Товары, "УПД");
	
	Если ЗначениеЗаполнено(СсылкаНаВладельца) Тогда
		
		ДокументОбъект = ДайОбъектИзБазыДляРедактирования(СсылкаНаВладельца);
		
	Иначе
		
		ДокументОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
		ДокументОбъект.Заполнить(ДанныеЗаполнения);
		ДокументОбъект.УстановитьНовыйНомер();
		
	КонецЕсли;
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	Если ЕстьРеквизит(ДокументОбъект,, "Марки") И ДанныеЗаполнения.Свойство("КодыМаркировки") Тогда
		
		ДокументОбъект.Марки.Загрузить(ДанныеЗаполнения.КодыМаркировки);
		
	КонецЕсли;
	
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаТаблицы Из ДанныеЗаполнения.Товары Цикл
		
		НовСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТаблицы); 
		Документы.ПоступлениеТоваров.ТоварыСуммаВсегоПриИзменении(ДокументОбъект, НовСтрока);
		НовСтрока.ЦенаДок  = НовСтрока.Цена;
		НовСтрока.СуммаДок = НовСтрока.СуммаВсего;
		
		Если Не ЗначениеЗаполнено(НовСтрока.ИдентификаторСтроки) Тогда
			
			НовСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
			
		КонецЕсли;
		
	КонецЦикла;

	ДокументОбъект.СуммаДокумента = ДокументОбъект.Товары.Итог("Сумма");
	
	Если Записывать Тогда
		ЗаписатьДокумент(ДокументОбъект, СсылкаНаВладельца);
	Иначе // если функция вызвана из формы "Обработки.ИнтерфейсДокументовЭДО.ЗагрузкаПросмотрЭлектронногоДокумента"
		СсылкаНаВладельца = ДокументОбъект;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументКорректировкиПоступления(ДанныеЗаполнения, СсылкаНаВладельца, ОписаниеОшибки)
	
	Если ЗначениеЗаполнено(СсылкаНаВладельца) Тогда
		
		ДокументОбъект = ДайОбъектИзБазыДляРедактирования(СсылкаНаВладельца);
		
	Иначе
		
		ДокументОбъект = Документы.КорректировкаПоступления.СоздатьДокумент();
		
	КонецЕсли;
	
	Основание = Неопределено;
	ДанныеЗаполнения.Свойство("Основание", Основание);
	
	Если Не ЗначениеЗаполнено(Основание) Тогда
		Если Не ДокументОбъект.ДокументОснование = Неопределено Тогда
			Если Не ДокументОбъект.ДокументОснование.Проведен Тогда
				
				ШаблонСообщения = НСтр("ru='Документ-основание %1 не проведен. Документ будет создан на основании данных электронного документа.'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, ДокументОбъект.ДокументОснование);
				ВывестиСообщение(ТекстСообщения);
				
			Иначе
				
				ДанныеЗаполнения.Вставить("Основание", ДокументОбъект.ДокументОснование);
				Основание = ДокументОбъект.ДокументОснование;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	Если ДанныеЗаполнения.Свойство("ХозОперация") Тогда
		
		ДокументОбъект.ХозОперация = ДанныеЗаполнения.ХозОперация;
		
	КонецЕсли;
	
	ТоварыОснования = Неопределено;
	Если ЗначениеЗаполнено(Основание) И ЕстьРеквизит(Основание, "СуммаДок", "Товары") Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Основание);
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ТабТовары.Номенклатура КАК Номенклатура,
		|	ТабТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТабТовары.ГТД КАК ГТД,
		|	ТабТовары.СуммаДок КАК СуммаДок,
		|	ТабТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ИЗ
		|	Документ.ПоступлениеТоваров.Товары КАК ТабТовары
		|ГДЕ
		|	ТабТовары.Ссылка = &Ссылка
		|";
		ПолноеИмяОснование = Основание.Метаданные().ПолноеИмя();
		Если НЕ ПолноеИмяОснование = "Документ.ПоступлениеТоваров" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ПоступлениеТоваров", ПолноеИмяОснование);
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;
		ТоварыОснования = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	ДокументОбъект.Заполнить(Основание);
	
	Если ЕстьРеквизит(ДокументОбъект,, "КодыМаркировки") Тогда
		
		ДокументОбъект.КодыМаркировки.Загрузить(ДанныеЗаполнения.КодыМаркировки);
		
	КонецЕсли;
	
	ТоварыЭД = ДанныеЗаполнения.Товары.Скопировать();
	РазделитьТоварыПоДаннымСведенийОПрослеживаемости(ТоварыЭД, "УКД");
	
	ТоварыКорректировкиПоОснованию = ТоварыУКДПоДокументуПоступления(Основание);
	Товары = НоваяТаблицаТоваров("КорректировкаПоступления");
		
	ЗаполнитьСписокНоменклатурыУКД(
		Товары,
		ТоварыЭД,
		ТоварыКорректировкиПоОснованию,
		ЕстьРеквизит(ТоварыЭД, "СведенияОИзмененииКоличества"),
		ТоварыОснования
	);
	
	ДокументОбъект.Товары.Очистить();
	
	Для Каждого СтрокаТаблицы Из Товары Цикл
		
		Приемник = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Приемник, СтрокаТаблицы);
		ПараметрыДействия = Документы.КорректировкаПоступления.ПолучитьПараметрыДействия(ДокументОбъект);
		Документы.КорректировкаПоступления.РасчетРазницы(ДокументОбъект, Приемник, ПараметрыДействия);
		
	КонецЦикла;
	
	ДокументОбъект.СуммаДокумента = ДокументОбъект.Товары.Итог("Сумма");
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
		
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.Номер) Тогда
		
		ДокументОбъект.УстановитьНовыйНомер();
		
	КонецЕсли;
	
	ЗаписатьДокумент(ДокументОбъект, СсылкаНаВладельца);
	
КонецПроцедуры

Процедура ЗаполнитьДокументВозвратТоваровОтПокупателя(ДанныеЗаполнения, СсылкаНаВладельца, Записывать, ОписаниеОшибки)
	
	// Разделим строки товаров, если пристутствуют сведения о прослеживаемости.
	Товары = ДанныеЗаполнения.Товары;
	
	СтрокиКУдалению = Новый Массив();
	РазделитьТоварыПоДаннымСведенийОПрослеживаемости(Товары, "УПД");
	
	Если ЗначениеЗаполнено(СсылкаНаВладельца) Тогда
		
		ДокументОбъект = ДайОбъектИзБазыДляРедактирования(СсылкаНаВладельца);
		
	Иначе
		
		ДокументОбъект = Документы.ВозвратОтПокупателя.СоздатьДокумент();
		ДокументОбъект.Заполнить(ДанныеЗаполнения);
		ДокументОбъект.УстановитьНовыйНомер();
		
	КонецЕсли;
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	Если ЕстьРеквизит(ДокументОбъект,, "Марки") И ДанныеЗаполнения.Свойство("КодыМаркировки") Тогда
		
		ДокументОбъект.Марки.Загрузить(ДанныеЗаполнения.КодыМаркировки);
		
	КонецЕсли;
	
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаТаблицы Из ДанныеЗаполнения.Товары Цикл
		
		НовСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТаблицы); 
		Документы.ВозвратОтПокупателя.ТоварыСуммаВсегоПриИзменении(ДокументОбъект, НовСтрока);
		НовСтрока.ЦенаДок  = НовСтрока.Цена;
		НовСтрока.СуммаДок = НовСтрока.СуммаВсего;
		
		Если Не ЗначениеЗаполнено(НовСтрока.ИдентификаторСтроки) Тогда
			
			НовСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
			
		КонецЕсли;
		
	КонецЦикла;

	ДокументОбъект.СуммаДокумента = ДокументОбъект.Товары.Итог("Сумма");
	
	Если Записывать Тогда
		ЗаписатьДокумент(ДокументОбъект, СсылкаНаВладельца);
	Иначе // если функция вызвана из формы "Обработки.ИнтерфейсДокументовЭДО.ЗагрузкаПросмотрЭлектронногоДокумента"
		СсылкаНаВладельца = ДокументОбъект;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументСчетФактурыПолученого(ДанныеЗаполнения, СсылкаНаВладельца, ОписаниеОшибки)
	
	Если ЗначениеЗаполнено(СсылкаНаВладельца) Тогда
		
		ДокументОбъект = ДайОбъектИзБазыДляРедактирования(СсылкаНаВладельца);
		
	Иначе
		
		ДокументОбъект = Документы.СчетФактураПолученный.СоздатьДокумент();
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.Автор = Пользователи.ТекущийПользователь();
		Основания = Неопределено;
		ДанныеЗаполнения.Свойство("Основания", Основания);
		СтароеЗначениеПрава = ПравоПользователя("ВводНаОснованииПроведенныхДокументов", ДокументОбъект);
		ОбновитьПравоВКэше("ВводНаОснованииПроведенныхДокументов", Ложь, ДокументОбъект);
		ДокументОбъект.ДополнительныеСвойства.Вставить("ВыполнятьПроверкуВозможностиВВода", Ложь);
		Если Основания.Количество()>0 Тогда
			ДокументОбъект.Заполнить(Основания[0]);
		КонецЕсли;
		ОбновитьПравоВКэше("ВводНаОснованииПроведенныхДокументов", СтароеЗначениеПрава, ДокументОбъект);
		
		Если Не УправлениеДиалогомСервер.ПроверитьВозможностьОткрытияФормыОбъекта(Неопределено) Тогда
			
			ЭлектронноеВзаимодействие.ОбработатьОшибку(
				НСтр("ru = 'Ошибка при заполнении счета-фактуры'"),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
				,
				СсылкаНаВладельца
			);
			Возврат;
			
		КонецЕсли;
		
		ДокументОбъект.УстановитьНовыйНомер();
		
	КонецЕсли;
	
	// Разделим строку товара, если присутсвуют сведения о прослеживаемости.
	Товары = ДанныеЗаполнения.Товары;
	РазделитьТоварыПоДаннымСведенийОПрослеживаемости(Товары, "УПД");
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	Если ДанныеЗаполнения.Свойство("ХозОперация") Тогда
		
		ДокументОбъект.ХозОперация = ДанныеЗаполнения.ХозОперация;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
		
		ДокументОбъект.Грузоотправитель = ДокументОбъект.Контрагент;
		
	КонецЕсли;
	
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаТаблицы Из Товары Цикл
		НовСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТаблицы); 
		Документы.СчетФактураПолученный.ТоварыСуммаВсегоПриИзменении(ДокументОбъект, НовСтрока); 
	КонецЦикла;
	
	ДокументОбъект.СуммаДокумента = Товары.Итог("СуммаВсего");
	ДокументОбъект.СуммаНДСДокумента = Товары.Итог("СуммаНДС");
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	
	Попытка
		ЗаписатьДокумент(ДокументОбъект, СсылкаНаВладельца);
		ДокументОбъект.Разблокировать();
	Исключение
		ЭлектронноеВзаимодействие.ОбработатьОшибку(
			НСтр("ru = 'Создание счет-фактуры в формате 2019 года''"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			,
			СсылкаНаВладельца
		);
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьДокументСчетФактурыПолученогоУКД(ДанныеЗаполнения, СсылкаНаВладельца, ОписаниеОшибки)
	
	Если ЗначениеЗаполнено(СсылкаНаВладельца) Тогда
		
		ДокументОбъект = ДайОбъектИзБазыДляРедактирования(СсылкаНаВладельца);
		
	Иначе
		
		ДокументОбъект = Документы.СчетФактураПолученный.СоздатьДокумент();
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.Автор = Пользователи.ТекущийПользователь();
		Основание = Неопределено;
		ДанныеЗаполнения.Свойство("Основание", Основание);
		СтароеЗначениеПрава = ПравоПользователя("ВводНаОснованииПроведенныхДокументов", ДокументОбъект);
		ОбновитьПравоВКэше("ВводНаОснованииПроведенныхДокументов", Ложь, ДокументОбъект);
		ДокументОбъект.ДополнительныеСвойства.Вставить("ВыполнятьПроверкуВозможностиВВода", Ложь); 
		
		Если Основание = Неопределено Тогда
			ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);	
		КонецЕсли;
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ДокументыОснования", ДанныеЗаполнения.Основания);
		Если ДанныеЗаполнения.Основания.Количество()= 0 Тогда
			ПараметрыЗаполнения.Вставить("Основание", Неопределено);
		Иначе
			ПараметрыЗаполнения.Вставить("Основание", ДанныеЗаполнения.Основания);
		КонецЕсли;
		//ДанныеЗаполнения.Вставить("Основания",            ОснованияСчетаФактуры);
		//ДанныеЗаполнения.Вставить("СчетФактураОснование", СчетФактураОснование);
		ДокументОбъект.Заполнить(Основание); 
		
		ОбновитьПравоВКэше("ВводНаОснованииПроведенныхДокументов", СтароеЗначениеПрава, ДокументОбъект);
		
		Если Не УправлениеДиалогомСервер.ПроверитьВозможностьОткрытияФормыОбъекта(Неопределено) Тогда
			
			ВызватьИсключение НСтр(
				"ru = 'Ошибка при заполнении счета-фактуры'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()
			);
			
		КонецЕсли;
		
		ДокументОбъект.УстановитьНовыйНомер();
		
	КонецЕсли;
	
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
	
	Если ДанныеЗаполнения.Свойство("ХозОперация") Тогда
		
		ДокументОбъект.ХозОперация = ДанныеЗаполнения.ХозОперация;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
		
		ДокументОбъект.Грузоотправитель = ДокументОбъект.Контрагент;
		
	КонецЕсли;
	
	// Полечение товаров КСФ.
	Основание = Неопределено;
	ДанныеЗаполнения.Свойство("Основание", Основание); 
	
	Если Основание = Неопределено Тогда
		ОснованиеОснования = Документы.КорректировкаПоступления.ПустаяСсылка();
	Иначе
		ОснованиеОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ДокументОснование");
	КонецЕсли;
	
	Товары              = НоваяТаблицаТоваров("СчетФактураПолученный");
	ТоварыЭД            = ДанныеЗаполнения.Товары.Скопировать();
	ТоварыСФПоОснованию = ТоварыСФПоДокументуКорректировки(ОснованиеОснования);
	
	РазделитьТоварыПоДаннымСведенийОПрослеживаемости(ТоварыЭД, "КСФ", ТоварыСФПоОснованию);
	ЗаполнитьСписокНоменклатурыКСФ(Товары, ТоварыЭД, ТоварыСФПоОснованию);
	
	ДокументОбъект.Товары.Загрузить(Товары);
	ДокументОбъект.СуммаДокумента = Товары.Итог("Сумма");
	ДокументОбъект.СуммаНДСДокумента = Товары.Итог("СуммаНДС");
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	
	Попытка
		
		ДокументОбъект.Записать();
		ДокументОбъект.Разблокировать();
		СсылкаНаВладельца = ДокументОбъект.Ссылка;
		
	Исключение
		
		ЭлектронноеВзаимодействие.ОбработатьОшибку(
			НСтр("ru = 'Создание корректировочного счет-фактуры''"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			,
			СсылкаНаВладельца
		);
		
		ВызватьИсключение;
		
	КонецПопытки;

КонецПроцедуры

Функция ДайОбъектИзБазыДляРедактирования(СсылкаНаВладельца)
	
	ДокументОбъект = СсылкаНаВладельца.ПолучитьОбъект();
	
	Попытка
		
		ДокументОбъект.Заблокировать();
		
	Исключение
		
		ШаблонСообщения = НСтр("ru = 'Не удалось изменить данные документа ""%1"".
			|Возможно, документ редактируется другим пользователем'");
		ВызватьИсключение СтрШаблон(ШаблонСообщения, Строка(ДокументОбъект.Ссылка));
		
	КонецПопытки;
	
	Возврат ДокументОбъект;
	
КонецФункции

Процедура ЗаписатьДокумент(ДокументОбъект, СсылкаНаВладельца)
	
	Попытка
		
		// Установим дату создания документа
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Ссылка)
			И ЕстьРеквизит(ДокументОбъект, "ДатаСоздания") И Не ЗначениеЗаполнено(ДокументОбъект.ДатаСоздания) Тогда
			
			ДокументОбъект.ДатаСоздания = ТекущаяДатаСеанса();
			
		КонецЕсли;
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		ДокументОбъект.Разблокировать();
		СсылкаНаВладельца = ДокументОбъект.Ссылка;
		
	Исключение
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Заполнение документа на основе ЭД.%1'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			СсылкаНаВладельца
		);
		ЗаписьЖурналаРегистрации(
			Текст,
			УровеньЖурналаРегистрации.Ошибка,
			ДокументОбъект.Метаданные(),
			СсылкаНаВладельца, 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ПерезаполнениеЗначенийРеквизитовШапки(ТекущийОбъект, ДанныеЗаполнения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтрокаТаблицы Из ДанныеЗаполнения Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Ключ)
			И ЕстьРеквизит(ТекущийОбъект, СтрокаТаблицы.Ключ) Тогда
			
			Если ТекущийОбъект[СтрокаТаблицы.Ключ] <> СтрокаТаблицы.Значение Тогда
				ТекущийОбъект[СтрокаТаблицы.Ключ] = СтрокаТаблицы.Значение;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТоварыСФПоДокументуКорректировки(ДокументКорректировки)
		
	ТоварыСФ = Неопределено;

	Если НЕ ЗначениеЗаполнено(ДокументКорректировки)
		ИЛИ (ТипЗнч(ДокументКорректировки) <> Тип("ДокументСсылка.КорректировкаПоступления")
		И ТипЗнч(ДокументКорректировки) <> Тип("ДокументСсылка.ПоступлениеТоваров")) Тогда
	
		Возврат ТоварыСФ;	
	
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СчетФактураПолученный.Ссылка КАК СчетФактура
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	СчетФактураПолученный.ДокументОснование = &Документ
		|	И СчетФактураПолученный.ПометкаУдаления = ЛОЖЬ"
	);	 
	Запрос.УстановитьПараметр("Документ", ДокументКорректировки);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат ТоварыСФ;
		
	Иначе
		
		СчетФактура = РезультатЗапроса.Выгрузить()[0].СчетФактура;
		
	КонецЕсли;
	
	Возврат СчетФактура.Товары.Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СобытияЭлектронныхДокументов


// Событие возникает при формировании электронных документов. Данные электронных документов сформированы, но не записаны.
// На данном этапе можно отказаться от записи электронных документов.
// Событие может выполняться в фоновом задании, в связи с этим не следует помещать данные во временное хранилище.
//
// Параметры:
//  ДанныеДляПроверки - ТаблицаЗначений - сформированные данные электронных документов.
//    * Ключ - Число - ключ связи с данными для проверки. Используется для отказа от записи электронного документа
//                     при произвольной обработке результатов проверок.
//    * ТипДокумента - см. ОбменСКонтрагентами.ТипыДокументов()
//    * ОписаниеФайла - Структура:
//      ** ДвоичныеДанные - ДвоичныеДанные - данные xml.
//      ** ИмяФайла - Строка - имя файла с расширением.
//      ** Формат - см. ОбменСКонтрагентами.ФорматыДокументов()
//    * ОбъектыУчета - Массив Из ОпределяемыйТип.ОснованияЭлектронныхДокументов
//    * Отказ - Булево - признак отказа от записи электронного документа при обработке результата по умолчанию.
//    * ПричинаОтказа - Строка - описание причины отказа для отображения пользователю при обработке результата по умолчанию.
//  СтандартнаяОбработка - Булево - признак обработки результата проверки по умолчанию.
//  РезультатыПроверок - Структура - результаты проверок для произвольной обработки.
//     Используется при нестандартной обработке (см. ПриОбработкеРезультатовПроверокФормированияДокументовЭДО).
//
Процедура ПриПроверкеФормированияДокументовЭДО(ДанныеДляПроверки, СтандартнаяОбработка, РезультатыПроверок) Экспорт
	
КонецПроцедуры

// Событие возникает при нестандартной обработке результатов проверок данных электронных документов при формировании.
// Т.е. в процедуре см. ПриПроверкеФормированияДокументовЭДО флаг СтандартнаяОбработка установлен в Ложь.
//
// Параметры:
//  РезультатыПроверок - Структура - результаты проверок для произвольной обработки.
//  ПараметрыОбработкиНаКлиенте - Структура - параметры для передачи на клиент. Значения свойств должны сериализоваться.
//      См. ОбменСКонтрагентамиКлиентПереопределяемый.ПриОбработкеРезультатовПроверокФормированияДокументовЭДО
//
Процедура ПриОбработкеРезультатовПроверокФормированияДокументовЭДО(РезультатыПроверок, ПараметрыОбработкиНаКлиенте) Экспорт
	
КонецПроцедуры

// Событие возникает при формировании ответов по электронным документам. Данные ответов по электронным документам сформированы, но не записаны.
// На данном этапе можно отказаться от записи ответов по электронным документам.
// Событие может выполняться в фоновом задании, в связи с этим не следует помещать данные во временное хранилище.
//
// Параметры:
//  ДанныеДляПроверки - ТаблицаЗначений - сформированные данные электронных документов.
//    * Ключ - Число - ключ связи с данными для проверки. Используется для отказа от записи электронного документа
//                     при произвольной обработке результатов проверок.
//    * ТипДокумента - см. ОбменСКонтрагентами.ТипыДокументов()
//    * ОписаниеФайлаИнформацииОтправителя - Структура:
//      ** ДвоичныеДанные - ДвоичныеДанные - данные xml.
//      ** ИмяФайла - Строка - имя файла с расширением.
//      ** Формат - см. ОбменСКонтрагентами.ФорматыДокументов()
//    * ОписаниеФайлаИнформацииПолучателя - Структура:
//      ** ДвоичныеДанные - ДвоичныеДанные - данные xml.
//      ** ИмяФайла - Строка - имя файла с расширением.
//      ** Формат - см. ОбменСКонтрагентами.ФорматыДокументов()
//    * ОбъектыУчета - Массив Из ОпределяемыйТип.ОснованияЭлектронныхДокументов
//    * Отказ - Булево - признак отказа от записи электронного документа при обработке результата по умолчанию.
//    * ПричинаОтказа - Строка - описание причины отказа для отображения пользователю при обработке результата по умолчанию.
//  СтандартнаяОбработка - Булево - признак обработки проверки по умолчанию.
//  РезультатыПроверок - Структура - результаты проверок для произвольной обработки.
//     Используется при нестандартной обработке (см. ПриОбработкеРезультатовПроверокФормированияДокументовЭДО).
//
Процедура ПриПроверкеФормированияОтветовПоДокументамЭДО(ДанныеДляПроверки, СтандартнаяОбработка, РезультатыПроверок) Экспорт
	
КонецПроцедуры

// Событие возникает при нестандартной обработке результатов проверок данных сформированных ответов по электронным документам.
// Т.е. в процедуре см. ПриПроверкеФормированияОтветовПоДокументамЭДО флаг СтандартнаяОбработка установлен в Ложь.
//
// Параметры:
//  РезультатыПроверок - Структура - результаты проверок для произвольной обработки.
//  ПараметрыОбработкиНаКлиенте - Структура - параметры для передачи на клиент. Значения свойств должны сериализоваться.
//      См. ОбменСКонтрагентамиКлиентПереопределяемый.ПриОбработкеРезультатовПроверокФормированияОтветовПоДокументамЭДО
//
Процедура ПриОбработкеРезультатовПроверокФормированияОтветовПоДокументамЭДО(РезультатыПроверок, ПараметрыОбработкиНаКлиенте) Экспорт
	
КонецПроцедуры

// Событие возникает после формирования электронного документа.
//
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ссылка на электронный документ.
//
Процедура ПослеФормированияЭлектронногоДокумента(ЭлектронныйДокумент) Экспорт
	
	МаркировкаТоваровСервер.ПослеФормированияЭлектронногоДокумента(ЭлектронныйДокумент);
	
КонецПроцедуры

// Событие возникает после загрузки нового электронного документа.
//
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ссылка на электронный документ.
//
Процедура ПослеЗагрузкиНовогоЭлектронногоДокумента(ЭлектронныйДокумент) Экспорт
	
	МаркировкаТоваровСервер.ПослеЗагрузкиНовогоЭлектронногоДокумента(ЭлектронныйДокумент);
	
КонецПроцедуры

// Событие возникает после утверждения электронного документа.
//
// Параметры:
//  ЭлектронныйДокумент	 - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ссылка на электронный документ.
//                       - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ссылка на электронный документ.
//
Процедура ПослеУтвержденияЭлектронногоДокумента(ЭлектронныйДокумент) Экспорт
	
	МаркировкаТоваровСервер.ПослеУтвержденияЭлектронногоДокумента(ЭлектронныйДокумент);
	
КонецПроцедуры

// Событие возникает после полного подписания электронного документа.
// Для документов, отправляемых контрагентам, событие возникает после полного подписания на стороне отправителя.
// Для документов, получаемых от контрагентов, событие возникает после полного подписания на стороне получателя.
//
// Параметры:
//  ЭлектронныйДокумент	 - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ссылка на электронный документ.
//                       - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ссылка на электронный документ.
//
Процедура ПослеПодписанияЭлектронногоДокумента(ЭлектронныйДокумент) Экспорт
	
	МаркировкаТоваровСервер.ПослеПодписанияЭлектронногоДокумента(ЭлектронныйДокумент);
	
КонецПроцедуры

// Событие возникает после успешного получения ответа (утверждение или отклонение) по электронному документу.
// 
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ссылка на электронный документ
//  ДокументУтвержден - Булево - Истина, если контрагент утвердил документ, Ложь - если отклонил.
Процедура ПослеПолученияОтветаОтКонтрагентаПоДокументу(ЭлектронныйДокумент, ДокументУтвержден) Экспорт
	
КонецПроцедуры

// Событие возникает после успешного завершения электронного документооборота.
//
// Параметры:
//  ЭлектронныйДокумент	 - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ссылка на электронный документ.
//                       - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ссылка на электронный документ.
//
Процедура ПослеЗавершенияОбменаЭлектроннымДокументом(ЭлектронныйДокумент) Экспорт
	
	МаркировкаТоваровСервер.ПослеЗавершенияОбменаЭлектроннымДокументом(ЭлектронныйДокумент);
	
КонецПроцедуры

// Событие возникает после после аннулирования электронного документа.
// 
// Параметры:
//  ЭлектронныйДокумент	 - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ссылка на электронный документ.
//                       - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ссылка на электронный документ.
Процедура ПослеАннулированияЭлектронногоДокумента(ЭлектронныйДокумент) Экспорт
	
	МаркировкаТоваровСервер.ПослеАннулированияЭлектронногоДокумента(ЭлектронныйДокумент);
	
КонецПроцедуры

// Событие возникает после изменения списка объектов учета, привязанных к электронному документу (при отражении в учете,
// подборе объекта учета, разрыве связи с объектом учета и т.д.).
// 
// Параметры:
// 	ЭлектронныйДокумент     - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - ссылка на электронный документ.
//                          - ДокументСсылка.ЭлектронныйДокументВходящийЭДО - ссылка на электронный документ.
// 	ДобавленныеОбъектыУчета - Массив Из ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - набор объектов учета, добавленных
// 	                            в список связанных с электронным документом.
// 	УдаленныеОбъектыУчета   - Массив Из ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - набор объектов учета, удаленных
// 	                            из списка связанных с электронным документом.
Процедура ПослеИзмененияОтраженияВУчете(ЭлектронныйДокумент, ДобавленныеОбъектыУчета, УдаленныеОбъектыУчета) Экспорт
	
	МаркировкаТоваровСервер.ПослеИзмененияОтраженияВУчете(ЭлектронныйДокумент, ДобавленныеОбъектыУчета, УдаленныеОбъектыУчета);
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеПрикладныхДанных

Функция НайтиКонтрагентаПоИННКПП(ИНН, КПП)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК НайденныйОбъект
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	|";
	
	Если ЗначениеЗаполнено(КПП) И КПП <> "0" Тогда

		ТекстЗапроса = ТекстЗапроса + " И Контрагенты.КПП = &КПП";

	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;

	Возврат РезультатЗапроса.Выгрузить()[0].НайденныйОбъект;
	
КонецФункции

Функция НайтиПодразделениеОрганизации(Организация, КПП, Контрагент, ДоговорВзаиморасчетов = Неопределено)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.Приоритет КАК Приоритет
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ПодразделенияКомпании.Ссылка КАК Подразделение,
	|		ВЫБОР
	|			КОГДА ПодразделенияКомпании.КПП = &КПП
	|				ТОГДА 0
	|			ИНАЧЕ 3
	|		КОНЕЦ КАК Приоритет
	|	ИЗ
	|		Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|	ГДЕ
	|		ПодразделенияКомпании.Организация = &Организация
	|		И НЕ ПодразделенияКомпании.ПометкаУдаления
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		СоответствияНастроекЭДОИПодразделенийОрганизации.Подразделение,
	|		1
	|	ИЗ
	|		РегистрСведений.СоответствияНастроекЭДОИПодразделенийОрганизации КАК СоответствияНастроекЭДОИПодразделенийОрганизации
	|	ГДЕ
	|		СоответствияНастроекЭДОИПодразделенийОрганизации.Отправитель = &Организация
	|		И СоответствияНастроекЭДОИПодразделенийОрганизации.Получатель = &Контрагент
	|		И СоответствияНастроекЭДОИПодразделенийОрганизации.Договор = &ДоговорВзаиморасчетов
	|		И НЕ СоответствияНастроекЭДОИПодразделенийОрганизации.Подразделение.ПометкаУдаления
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ ПЕРВЫЕ 1
	|		СоответствияНастроекЭДОИПодразделенийОрганизации.Подразделение,
	|		2
	|	ИЗ
	|		РегистрСведений.СоответствияНастроекЭДОИПодразделенийОрганизации КАК СоответствияНастроекЭДОИПодразделенийОрганизации
	|	ГДЕ
	|		СоответствияНастроекЭДОИПодразделенийОрганизации.Отправитель = &Контрагент
	|		И СоответствияНастроекЭДОИПодразделенийОрганизации.Получатель = &Организация
	|		И СоответствияНастроекЭДОИПодразделенийОрганизации.Договор = &ДоговорВзаиморасчетов
	|		И НЕ СоответствияНастроекЭДОИПодразделенийОрганизации.Подразделение.ПометкаУдаления) КАК ВложенныйЗапрос
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КПП", КПП); 
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Если ДоговорВзаиморасчетов = Неопределено Тогда
		ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	КонецЕсли;
	Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", ДоговорВзаиморасчетов);  
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить()[0].Подразделение;
	
КонецФункции

Функция СчетФактураПоНомеруИДате(Номер, Дата, Организация, Контрагент)
	
	ДопОтборы = Новый Массив;
	Если ЗначениеЗаполнено(Организация) Тогда
		ДопОтборы.Добавить("	И СчетФактураПолученный.Организация = &Организация");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ДопОтборы.Добавить("	И СчетФактураПолученный.Контрагент = &Контрагент");
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		СчетФактураПолученный.Ссылка КАК Ссылка,
	|		СчетФактураПолученный.Дата КАК Дата
	|	ИЗ
	|		Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|	ГДЕ
	|		СчетФактураПолученный.ВхДокНомер = &Номер
	|		И СчетФактураПолученный.ВхДокДата = &Дата
	|		И НЕ СчетФактураПолученный.ПометкаУдаления
	|	//ДопОтборы
	|	УПОРЯДОЧИТЬ ПО 
	|		Дата УБЫВ) КАК ВложенныйЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		СчетФактураПолученный.Ссылка,
	|		СчетФактураПолученный.Дата КАК Дата
	|	ИЗ
	|		Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|	ГДЕ
	|		СчетФактураПолученный.ВхДокНомер = &Номер
	|		И НЕ СчетФактураПолученный.ПометкаУдаления
	|	//ДопОтборы
	|	УПОРЯДОЧИТЬ ПО 
	|		Дата УБЫВ) КАК ВложенныйЗапрос
	|";
	
	Если ДопОтборы.Количество()>0 Тогда
		ТекстОтборов = СтрСоединить(ДопОтборы, Символы.ПС);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДопОтборы", ТекстОтборов);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Номер",       Номер);
	Запрос.УстановитьПараметр("Дата",        Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент",  Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	СчетаФактуры = РезультатЗапроса.Выбрать();
	СчетаФактуры.Следующий();
	Возврат СчетаФактуры.Ссылка;
	
КонецФункции

Функция ДокументОснованиеПоНомеруИДате(Номер, Дата, Организация, Контрагент)
	
	ДопОтборы = Новый Массив;
	Если ЗначениеЗаполнено(Организация) Тогда
		ДопОтборы.Добавить("	И ПоступлениеТоваров.Организация = &Организация");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ДопОтборы.Добавить("	И ПоступлениеТоваров.Контрагент = &Контрагент");
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ПоступлениеТоваров.Ссылка КАК Ссылка,
	|		ПоступлениеТоваров.Дата КАК Дата
	|	ИЗ
	|		Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|	ГДЕ
	|		ПоступлениеТоваров.ВхДокНомер = &Номер
	|		И ПоступлениеТоваров.ВхДокДата = &Дата
	|		И НЕ ПоступлениеТоваров.ПометкаУдаления
	|	//ДопОтборы
	|	УПОРЯДОЧИТЬ ПО 
	|		Дата УБЫВ) КАК ВложенныйЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ПоступлениеТоваров.Ссылка КАК Ссылка,
	|		ПоступлениеТоваров.Дата КАК Дата
	|	ИЗ
	|		Документ.ВозвратОтПокупателя КАК ПоступлениеТоваров
	|	ГДЕ
	|		ПоступлениеТоваров.ВхДокНомер = &Номер
	|		И ПоступлениеТоваров.ВхДокДата = &Дата
	|		И НЕ ПоступлениеТоваров.ПометкаУдаления
	|	//ДопОтборы
	|	УПОРЯДОЧИТЬ ПО 
	|		Дата УБЫВ) КАК ВложенныйЗапрос
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ПоступлениеТоваров.Ссылка КАК Ссылка,
	|		ПоступлениеТоваров.Дата КАК Дата
	|	ИЗ
	|		Документ.КорректировкаПоступления КАК ПоступлениеТоваров
	|	ГДЕ
	|		ПоступлениеТоваров.ВхДокНомер = &Номер
	|		И ПоступлениеТоваров.ВхДокДата = &Дата
	|		И НЕ ПоступлениеТоваров.ПометкаУдаления
	|	//ДопОтборы
	|	УПОРЯДОЧИТЬ ПО 
	|		Дата УБЫВ) КАК ВложенныйЗапрос
	|";
	
	Если ДопОтборы.Количество()>0 Тогда
		ТекстОтборов = СтрСоединить(ДопОтборы, Символы.ПС);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДопОтборы", ТекстОтборов);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Номер",       Номер);
	Запрос.УстановитьПараметр("Дата",        Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент",  Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	СчетаФактуры = РезультатЗапроса.Выбрать();
	СчетаФактуры.Следующий();
	Возврат СчетаФактуры.Ссылка;
	
КонецФункции

Функция ДокументОснованиеСчетаФактурыПолученного(СчетФактура)
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("СчетФактура", СчетФактура);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ДокументыОснованияСФ.ДокументОснование КАК ДокументОснование
	|	ИЗ
	|		Документ.СчетФактураПолученный.ДокументыОснования КАК ДокументыОснованияСФ
	|	ГДЕ
	|		ДокументыОснованияСФ.Ссылка = &СчетФактура
	|	УПОРЯДОЧИТЬ ПО
	|		ДокументыОснованияСФ.НомерСтроки ВОЗР) КАК ВложенныйЗапрос
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	СчетФактураПолученный.ДокументОснование
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.Ссылка = &СчетФактура
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДокументОснование;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область CML_Форматы

#Область СчетаОтПоставщика

Функция НайтиСоздатьСчетОтПоставщика(СтрокаДляЗагрузки,
                                     ДеревоРазбора,
                                     СсылкаНаВладельца = Неопределено,
                                     Записывать = Истина)
	
	ДанныеДляЗагрузки = ПодготовитьСтруктуруСчетОтПоставщика(СтрокаДляЗагрузки, ДеревоРазбора);
	
	Если ДанныеДляЗагрузки.Свойство("Шапка") Тогда
		ДанныеЗаполнения = ДанныеДляЗагрузки.Шапка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаВладельца) Тогда
		
		ДокументОбъект = ДайОбъектИзБазыДляРедактирования(СсылкаНаВладельца);
		
	Иначе
		
		ДокументОбъект = Документы.СчетОтПоставщика.СоздатьДокумент();
		ДокументОбъект.УстановитьНовыйНомер();
		
	КонецЕсли;

	ДокументОбъект.Заполнить(ДанныеДляЗагрузки.Шапка);
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);

	ДокументОбъект.ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	Документы.СчетОтПоставщика.ВалютаДокументаПриИзменении(ДокументОбъект);
	
	ДокументОбъект.КурсДокумента = ДанныеЗаполнения.КурсДокумента;
	Документы.СчетОтПоставщика.КурсДокументаПриИзменении(ДокументОбъект);
		
	ДокументОбъект.Организация = ДанныеЗаполнения.Организация;
	Документы.СчетОтПоставщика.ОрганизацияПриИзменении(ДокументОбъект);

	ДокументОбъект.ПодразделениеКомпании = ДанныеЗаполнения.ПодразделениеКомпании;
	Документы.СчетОтПоставщика.ПодразделениеКомпанииПриИзменении(ДокументОбъект);
	
	ДокументОбъект.Контрагент = ДанныеЗаполнения.Контрагент;
	Документы.СчетОтПоставщика.КонтрагентПриИзменении(ДокументОбъект);
	
	ДокументОбъект.РасчетныйСчетКонтрагента = ДанныеЗаполнения.БанковскийСчетКонтрагента;
	
	ДокументОбъект.Товары.Загрузить(ДанныеДляЗагрузки.Товары);
	
	ЗаписатьДокумент(ДокументОбъект, СсылкаНаВладельца);
	Возврат СсылкаНаВладельца;
	
КонецФункции

Функция ПодготовитьСтруктуруСчетОтПоставщика(СтрокаДляЗагрузки, ДеревоРазбора)
	
	ДанныеДляОбъекта = Новый Структура;
	ДанныеЗаполненияШапки = Новый Структура;
	Товары = Документы.СчетОтПоставщика.ПустаяСсылка().Товары.ВыгрузитьКолонки();
	
	Для Каждого СтрокаРеквизита Из СтрокаДляЗагрузки.Строки Цикл
		
		Если СтрокаРеквизита.Строки.Количество() = 0 Тогда // примитивный тип
			
			Реквизит = ПолучитьЗначениеРеквизитаДерева(СтрокаРеквизита, СтрокаРеквизита.Реквизит, Истина, ДеревоРазбора);
			
			Если СтрокаРеквизита.Реквизит = "Валюта" Тогда
				
				ИмяРеквизита = "ВалютаДокумента";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "Курс" Тогда
				
				ИмяРеквизита = "КурсДокумента";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "Номер" Тогда
				
				ИмяРеквизита = "ВхДокНомер";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "Дата" Тогда
				
				ИмяРеквизита = "ВхДокДата";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "СуммаИтог" Тогда
				
				ИмяРеквизита = "СуммаДокумента";
				
			Иначе
				
				ИмяРеквизита = СтрокаРеквизита.Реквизит;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Реквизит) Тогда
				
				ДанныеЗаполненияШапки.Вставить(ИмяРеквизита, Реквизит);
				
			КонецЕсли;
			
		ИначеЕсли СтрокаРеквизита.Реквизит = "СтрокаТЧ" Тогда
			
			ЗаполнитьСтрокуТЧ(Товары, СтрокаРеквизита.Строки, ДеревоРазбора, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДанныеЗаполненияШапки.Свойство("Организация") И ЗначениеЗаполнено(ДанныеЗаполненияШапки.Организация) Тогда
		
		ДанныеЗаполненияШапки.Вставить("ПодразделениеКомпании",
			НайтиПодразделениеОрганизации(ДанныеЗаполненияШапки.Организация, "", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполненияШапки, "Контрагент")));
		
	КонецЕсли;
		
	ДанныеДляОбъекта.Вставить("Шапка", ДанныеЗаполненияШапки);
	ДанныеДляОбъекта.Вставить("Товары", Товары);
	
	Возврат ДанныеДляОбъекта;
	
КонецФункции

#КонецОбласти

#Область ЗаказПокупателя

Функция НайтиСоздатьЗаказПокупателя(СтрокаДляЗагрузки,
                                    ДеревоРазбора,
                                    СсылкаНаВладельца = Неопределено,
                                    ДополнительныеДанные = Неопределено,
                                    Записывать = Истина)
	
	ДанныеДляЗагрузки = ПодготовитьСтруктуруЗаказПокупателя(СтрокаДляЗагрузки, ДеревоРазбора);
	
	Если ДанныеДляЗагрузки.Свойство("Шапка") Тогда
		ДанныеЗаполнения = ДанныеДляЗагрузки.Шапка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаВладельца) Тогда
		
		ДокументОбъект = ДайОбъектИзБазыДляРедактирования(СсылкаНаВладельца);
		
	Иначе
		
		ДокументОбъект = Документы.ЗаказПокупателя.СоздатьДокумент();
		ДокументОбъект.УстановитьНовыйНомер();
		
	КонецЕсли;

	ДокументОбъект.Заполнить(ДанныеДляЗагрузки.Шапка);
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);

	ДокументОбъект.ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	Документы.ЗаказПокупателя.ВалютаДокументаПриИзменении(ДокументОбъект);
	
	ДокументОбъект.КурсДокумента = ДанныеЗаполнения.КурсДокумента;
	Документы.ЗаказПокупателя.КурсДокументаПриИзменении(ДокументОбъект);
		
	ДокументОбъект.Организация = ДанныеЗаполнения.Организация;
	Документы.ЗаказПокупателя.ОрганизацияПриИзменении(ДокументОбъект);

	ДокументОбъект.ПодразделениеКомпании = ДанныеЗаполнения.ПодразделениеКомпании;
	Документы.ЗаказПокупателя.ПодразделениеКомпанииПриИзменении(ДокументОбъект);
	
	ДокументОбъект.Контрагент = ДанныеЗаполнения.Контрагент;
	Документы.ЗаказПокупателя.КонтрагентПриИзменении(ДокументОбъект);
	
	ДокументОбъект.Товары.Загрузить(ДанныеДляЗагрузки.Товары);
	
	ЗаписатьДокумент(ДокументОбъект, СсылкаНаВладельца);
	Возврат СсылкаНаВладельца;
		
КонецФункции

Функция ПодготовитьСтруктуруЗаказПокупателя(СтрокаДляЗагрузки, ДеревоРазбора)
		
	ДанныеДляОбъекта = Новый Структура;
	ДанныеЗаполненияШапки = Новый Структура;
	Товары = Документы.СчетОтПоставщика.ПустаяСсылка().Товары.ВыгрузитьКолонки();
	
	Для Каждого СтрокаРеквизита Из СтрокаДляЗагрузки.Строки Цикл
		
		Если СтрокаРеквизита.Строки.Количество() = 0 Тогда // примитивный тип
			
			Реквизит = ПолучитьЗначениеРеквизитаДерева(СтрокаРеквизита, СтрокаРеквизита.Реквизит, Истина, ДеревоРазбора);
			
			Если СтрокаРеквизита.Реквизит = "Валюта" Тогда
				
				ИмяРеквизита = "ВалютаДокумента";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "Курс" Тогда
				
				ИмяРеквизита = "КурсДокумента";
				Реквизит = ПолучитьЗначениеРеквизитаДерева(СтрокаРеквизита, СтрокаРеквизита.Реквизит);
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "СуммаИтог" Тогда
				
				ИмяРеквизита = "СуммаДокумента";
				
			Иначе
				
				ИмяРеквизита = СтрокаРеквизита.Реквизит;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Реквизит) Тогда
				
				ДанныеЗаполненияШапки.Вставить(ИмяРеквизита, Реквизит);
				
			КонецЕсли;
			
		ИначеЕсли СтрокаРеквизита.Реквизит = "СтрокаТЧ" Тогда
			
			ЗаполнитьСтрокуТЧ(Товары, СтрокаРеквизита.Строки, ДеревоРазбора, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДанныеЗаполненияШапки.Свойство("Организация") И ЗначениеЗаполнено(ДанныеЗаполненияШапки.Организация) Тогда
		
		ДанныеЗаполненияШапки.Вставить("ПодразделениеКомпании",
			НайтиПодразделениеОрганизации(ДанныеЗаполненияШапки.Организация, "", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполненияШапки, "Контрагент")));
		
	КонецЕсли;
	
	ДанныеДляОбъекта.Вставить("Шапка", ДанныеЗаполненияШапки);
	ДанныеДляОбъекта.Вставить("Товары", Товары);
	Возврат ДанныеДляОбъекта;
	
КонецФункции

#КонецОбласти

#Область ЗаказПоставщику

Функция НайтиСоздатьЗаказПоставщику(СтрокаДляЗагрузки,
                                    ДеревоРазбора,
                                    СсылкаНаВладельца = Неопределено,
                                    Записывать = Истина)

	ДанныеДляЗагрузки = ПодготовитьСтруктуруЗаказПоставщику(СтрокаДляЗагрузки, ДеревоРазбора);
	
	Если ДанныеДляЗагрузки.Свойство("Шапка") Тогда
		ДанныеЗаполнения = ДанныеДляЗагрузки.Шапка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаВладельца) Тогда
		
		ДокументОбъект = ДайОбъектИзБазыДляРедактирования(СсылкаНаВладельца);
		
	Иначе
		
		ДокументОбъект = Документы.ЗаказПоставщику.СоздатьДокумент();
		ДокументОбъект.УстановитьНовыйНомер();
		
	КонецЕсли;

	ДокументОбъект.Заполнить(ДанныеДляЗагрузки.Шапка);
	ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);

	ДокументОбъект.ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	Документы.ЗаказПоставщику.ВалютаДокументаПриИзменении(ДокументОбъект);
	
	ДокументОбъект.КурсДокумента = ДанныеЗаполнения.КурсДокумента;
	Документы.ЗаказПоставщику.КурсДокументаПриИзменении(ДокументОбъект);
		
	ДокументОбъект.Организация = ДанныеЗаполнения.Организация;
	Документы.ЗаказПоставщику.ОрганизацияПриИзменении(ДокументОбъект);

	ДокументОбъект.ПодразделениеКомпании = ДанныеЗаполнения.ПодразделениеКомпании;
	Документы.ЗаказПоставщику.ПодразделениеКомпанииПриИзменении(ДокументОбъект);
	
	ДокументОбъект.Контрагент = ДанныеЗаполнения.Контрагент;
	Документы.ЗаказПоставщику.КонтрагентПриИзменении(ДокументОбъект);
	
	ДокументОбъект.Товары.Загрузить(ДанныеДляЗагрузки.Товары);
	
	ЗаписатьДокумент(ДокументОбъект, СсылкаНаВладельца);
	Возврат СсылкаНаВладельца;
	
КонецФункции

Функция ПодготовитьСтруктуруЗаказПоставщику(СтрокаДляЗагрузки, ДеревоРазбора)
		
	ДанныеДляОбъекта = Новый Структура;
	ДанныеЗаполненияШапки = Новый Структура;
	Товары = Документы.ЗаказПоставщику.ПустаяСсылка().Товары.ВыгрузитьКолонки();
	
	Для Каждого СтрокаРеквизита Из СтрокаДляЗагрузки.Строки Цикл
		
		Если СтрокаРеквизита.Строки.Количество() = 0 Тогда // примитивный тип
			
			Реквизит = ПолучитьЗначениеРеквизитаДерева(СтрокаРеквизита, СтрокаРеквизита.Реквизит, Истина, ДеревоРазбора);
			
			Если СтрокаРеквизита.Реквизит = "Валюта" Тогда
				
				ИмяРеквизита = "ВалютаДокумента";
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "Курс" Тогда
				
				ИмяРеквизита = "КурсДокумента";
				Реквизит = ПолучитьЗначениеРеквизитаДерева(СтрокаРеквизита, СтрокаРеквизита.Реквизит);
				
			ИначеЕсли СтрокаРеквизита.Реквизит = "СуммаИтог" Тогда
				
				ИмяРеквизита = "СуммаДокумента";
				
			Иначе
				
				ИмяРеквизита = СтрокаРеквизита.Реквизит;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Реквизит) Тогда
				
				ДанныеЗаполненияШапки.Вставить(ИмяРеквизита, Реквизит);
				
			КонецЕсли;
			
		ИначеЕсли СтрокаРеквизита.Реквизит = "СтрокаТЧ" Тогда
			
			ЗаполнитьСтрокуТЧ(Товары, СтрокаРеквизита.Строки, ДеревоРазбора, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДанныеЗаполненияШапки.Свойство("Организация") И ЗначениеЗаполнено(ДанныеЗаполненияШапки.Организация) Тогда
		
		ДанныеЗаполненияШапки.Вставить("ПодразделениеКомпании",
			НайтиПодразделениеОрганизации(ДанныеЗаполненияШапки.Организация, "", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполненияШапки, "Контрагент")));
		
	КонецЕсли;
	
	ДанныеДляОбъекта.Вставить("Шапка", ДанныеЗаполненияШапки);
	ДанныеДляОбъекта.Вставить("Товары", Товары);
	Возврат ДанныеДляОбъекта;
	
КонецФункции

Функция НовыеТоварыВЗаказеПоставщику()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("НоменклатураПоставщика");
	Результат.Колонки.Добавить("ИдентификаторПоставщика");
	Результат.Колонки.Добавить("Артикул");
	Результат.Колонки.Добавить("Наименование");
	Результат.Колонки.Добавить("Описание");
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("Характеристика");
	Результат.Колонки.Добавить("НаименованиеХарактеристики");
	Результат.Колонки.Добавить("БазоваяЕдиницаКод");
	Результат.Колонки.Добавить("БазоваяЕдиницаНаименование");
	Результат.Колонки.Добавить("БазоваяЕдиницаНаименованиеПолное");
	Результат.Колонки.Добавить("БазоваяЕдиницаМеждународноеСокращение");
	Результат.Колонки.Добавить("Упаковка");
	Результат.Колонки.Добавить("ЕдиницаИзмерения");
	Результат.Колонки.Добавить("ЕдиницаИзмеренияКодПоОКЕИ");
	Результат.Колонки.Добавить("ЕдиницаИзмеренияНаименование");
	Результат.Колонки.Добавить("ЕдиницаИзмеренияКоэффициент");
	Результат.Колонки.Добавить("Количество");
	Результат.Колонки.Добавить("Цена");
	Результат.Колонки.Добавить("Сумма");
	Результат.Колонки.Добавить("СтавкаНДС");
	Результат.Колонки.Добавить("СуммаНДС");
	Результат.Колонки.Добавить("СуммаСНДС");
	Результат.Колонки.Добавить("НДСУчтеноВСумме");
	Результат.Колонки.Добавить("СуммаСкидки");
	Результат.Колонки.Добавить("ПроцентСкидки");
	Результат.Колонки.Добавить("Сопоставление");
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбщиеМетоды

Функция ПолучитьЗначениеРеквизитаДерева(СтрокаДерева, ИмяРеквизита, ВключатьПодчиненные = Ложь, ДеревоРазбора = Неопределено)
	
	Результат = Неопределено;
	
	Если СтрокаДерева.Строки.Количество() > 0 Тогда 
		НайденнаяСтрока = СтрокаДерева.Строки.Найти(ИмяРеквизита, "Реквизит", ВключатьПодчиненные);
	Иначе // Передали строку с реквизитом
		НайденнаяСтрока = СтрокаДерева;
	КонецЕсли;
	
	Если НайденнаяСтрока <> Неопределено Тогда
		
		Результат = НайденнаяСтрока.ЗначениеРеквизита;
		
		// Если реквизит ссылочного типа (передали реквизит ДеревоРазбора),
		// тогда нашли всего лишь индекс строки
		Если ЗначениеЗаполнено(ДеревоРазбора) Тогда
			
			НайденнаяСтрока = ДеревоРазбора.Строки.Найти(Результат, "ИндексСтроки", Истина);
			
			Если НайденнаяСтрока <> Неопределено Тогда
				
				Результат = НайденнаяСтрока.СсылкаНаОбъект;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСтрокуТЧ(ТЗ, ДанныеЗаполнения, ДеревоРазбора, ЭтоЗаказ = Ложь)
	
	НовСтрока = ТЗ.Добавить();
	Для Каждого ТекСтрока Из ДанныеЗаполнения Цикл
		ИмяРеквизитаВБД = ТекСтрока.Реквизит;
		
		Если ИмяРеквизитаВБД = "Описание" Тогда
			ИмяРеквизитаВБД = "Содержание";
		ИначеЕсли ИмяРеквизитаВБД = "СумНДС" Тогда
			ИмяРеквизитаВБД = "СуммаНДС";
		ИначеЕсли ИмяРеквизитаВБД = "СтТовУчНал" Тогда
			ИмяРеквизитаВБД = "Сумма";
		ИначеЕсли ИмяРеквизитаВБД = "НалСтВел" Тогда
			ИмяРеквизитаВБД = "СтавкаНДС";
		КонецЕсли;
		
		Если ИмяРеквизитаВБД = "СуммаСНДС" Тогда
			НовСтрока.СуммаВсего = ПолучитьЗначениеРеквизитаДерева(ТекСтрока, ИмяРеквизитаВБД, Истина, ДеревоРазбора);
		КонецЕсли;
		
		Если ИмяРеквизитаВБД = "Сопоставление" Тогда
			Сопоставление = ПолучитьЗначениеРеквизитаДерева(ТекСтрока, ТекСтрока.Реквизит, Истина, ДеревоРазбора);
			Если ТипЗнч(Сопоставление) <> Тип("Структура") Тогда
				Продолжить;
			КонецЕсли;
			Если КолонкаСуществует(ТЗ, "Номенклатура")
				И Сопоставление.Свойство("НоменклатураИБ") Тогда
				Если ЗначениеЗаполнено(Сопоставление.НоменклатураИБ) Тогда
					НовСтрока.Номенклатура = Сопоставление.НоменклатураИБ;
				КонецЕсли;
			КонецЕсли;
			Если КолонкаСуществует(ТЗ, "Характеристика")
				И Сопоставление.Свойство("ХарактеристикаИБ") Тогда
				Если ЗначениеЗаполнено(Сопоставление.ХарактеристикаИБ) Тогда
					НовСтрока.Характеристика = Сопоставление.ХарактеристикаИБ;
				КонецЕсли;
			КонецЕсли;
			Если КолонкаСуществует(ТЗ, "ЕдиницаИзмерения")
				И Сопоставление.Свойство("УпаковкаИБ") Тогда
				Если ЗначениеЗаполнено(Сопоставление.УпаковкаИБ) Тогда
					НовСтрока.ЕдиницаИзмерения = Сопоставление.УпаковкаИБ;
				КонецЕсли;
			КонецЕсли;
			Если КолонкаСуществует(ТЗ, "Упаковка")
				И Сопоставление.Свойство("УпаковкаИБ") Тогда
				Если ЗначениеЗаполнено(Сопоставление.УпаковкаИБ) Тогда
					НовСтрока.Упаковка = Сопоставление.УпаковкаИБ;
				КонецЕсли;
			КонецЕсли;			
		КонецЕсли;
		
		// Заполнение характеристики номенклатуры и упаковки.
		Если ИмяРеквизитаВБД = "НоменклатураПартнера" Тогда
			Если КолонкаСуществует(ТЗ, "Характеристика") Тогда
				НайденноеЗначение = ПолучитьЗначениеРеквизитаДерева(ТекСтрока, ТекСтрока.Реквизит, Истина, ДеревоРазбора);
				Если ЗначениеЗаполнено(НайденноеЗначение) Тогда
					НовСтрока.Характеристика = НайденноеЗначение.Характеристика;	
				КонецЕсли;
			КонецЕсли;
			Если КолонкаСуществует(ТЗ, "Упаковка") Тогда
				НайденноеЗначение = ПолучитьЗначениеРеквизитаДерева(ТекСтрока, ТекСтрока.Реквизит, Истина, ДеревоРазбора);
				Если ЗначениеЗаполнено(НайденноеЗначение) Тогда
					НовСтрока.Упаковка = НайденноеЗначение.Упаковка;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Не КолонкаСуществует(ТЗ, ИмяРеквизитаВБД) Тогда
			Продолжить;
		КонецЕсли;
		
		НайденноеЗначение = ПолучитьЗначениеРеквизитаДерева(ТекСтрока, ТекСтрока.Реквизит, Истина, ДеревоРазбора);
		
		НовСтрока[ИмяРеквизитаВБД] = НайденноеЗначение;
		Если ТекСтрока.Реквизит = "Номенклатура" Тогда
			СтрокаНоменклатура = ДеревоРазбора.Строки.Найти(ТекСтрока.ЗначениеРеквизита, "ИндексСтроки", Истина);
			НайденноеЗначение = ПолучитьЗначениеРеквизитаДерева(СтрокаНоменклатура, "ЕдиницаИзмерения", Истина, ДеревоРазбора);
			Если ЗначениеЗаполнено(НайденноеЗначение) Тогда
				НовСтрока.ЕдиницаИзмерения = НайденноеЗначение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция КолонкаСуществует(Таблица, ИмяКолонки)
	
	Результат = Не (Таблица.Колонки.Найти(ИмяКолонки) = Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция РазделитьПервичныйДокументИСчетФактуру(СсылкиНаВладельцев)
	
	Результат = Новый Структура("СчетФактура,ПервичныйДокумент");
	
	Если СсылкиНаВладельцев = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из СсылкиНаВладельцев Цикл
		
		Если ТипЗнч(СтрокаТаблицы) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			
			Результат.СчетФактура = СтрокаТаблицы;
			
		Иначе
			
			Результат.ПервичныйДокумент = СтрокаТаблицы;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура СохранитьРеквизитВДереве(Дерево, Реквизит, Значение, ПараметрыОбработкиОшибок = Неопределено)
	
	СтрокаДерева = Дерево.Строки.Найти(Реквизит, "ПолныйПуть", Истина);
	
	Если
		СтрокаДерева <> Неопределено
		И СтрокаДерева.ПараметрыОбработкиОбязательны = "Да"
	Тогда
		
		ПараметрыОбработкиОшибок = СтрШаблон(
			НСтр("ru = 'Не заполнен обязательный реквизит для формирования электронного документа %1.'"),
			Реквизит
		);
		
	КонецЕсли;
	
	Попытка
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(Дерево, Реквизит, Значение, ПараметрыОбработкиОшибок);
		
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры

Функция НовоеОписаниеОшибкиДляТаблицы()
	
	Результат = Новый Структура;
	Результат.Вставить("ПолеТаблицы");
	Результат.Вставить("КлючДанных", "");
	Результат.Вставить("ПутьКДанным", "");
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ПолеНомераСтроки");
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокиТаблицы, ОписаниеОшибки)
	
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(
		СтрокиТаблицы,
		ОписаниеОшибки.ПолеТаблицы,
		ОписаниеОшибки.КлючДанных,
		ОписаниеОшибки.ПутьКДанным,
		ОписаниеОшибки.ТекстОшибки,
		ОписаниеОшибки.ПолеНомераСтроки
	);
	
КонецПроцедуры

Процедура ЗаполнитьДоговор(ДеревоДокумента, Шапка)
	
	Если Не (ЗначениеЗаполнено(Шапка.ДоговорНомер) И ЗначениеЗаполнено(Шапка.ДоговорДата)) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеДоговоров = Новый ТаблицаЗначений;
	ОписаниеДоговоров.Колонки.Добавить("Идентификатор");
	ОписаниеДоговоров.Колонки.Добавить("Наименование");
	ОписаниеДоговоров.Колонки.Добавить("Номер");
	ОписаниеДоговоров.Колонки.Добавить("Дата");
	
	Договор = ОписаниеДоговоров.Добавить();
	Договор.Идентификатор = НСтр("ru = 'Договор'");
	Договор.Наименование = НСтр("ru = 'Договор'");
	Договор.Номер = Шапка.ДоговорНомер;
	Договор.Дата = Шапка.ДоговорДата;
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(
		ДеревоДокумента,
		ОписаниеДоговоров,
		"ДокументыСделки"
	);
	
КонецПроцедуры

Функция ФорматСуммСВалютой(Сумма, Знач Валюта)
	
	ФорматСуммы = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Неопределено);
	Результат = СокрЛ(Формат(Сумма, ФорматСуммы));

	Если ТипЗнч(Валюта) = Тип("Строка") Тогда
	
		Валюта = ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект("Валюты", Валюта);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Валюта) Тогда
		
		Результат = Формат(Сумма, ФорматСуммы) + " " + СокрП(Валюта);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область АктОРасхождениях_2019

#Область Отправка
// См. ОбменСКонтрагентамиПереопределяемый.ЗаполнитьДанныеАктОРасхождениях_ИнформацияПокупателя.
Процедура ЗаполнитьДанныеАктОРасхождениях_ИнформацияПокупателя(Знач Основание, Знач Настройки, Данные, Описание, Отказ) Экспорт
	
	СтруктураЭД = ОбщегоНазначения.СкопироватьРекурсивно(Настройки, Ложь);
	
	ЗаполнитьДанныеДляАктОРасхождениях(Основание, СтруктураЭД, Данные, Отказ);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеДляАктОРасхождениях(Знач СсылкаНаОбъект, Знач СтруктураЭД, ДеревоДанных, Отказ)
	
	СтруктураДанных = Документы.АктОРасхожденияхПоПоставке.ПолучитьДанныеДляЭД(СсылкаНаОбъект);
	
	ВыборкаШапка                      = СтруктураДанных.ВыборкаШапка;
	ВыборкаРеквизитыСФ                = СтруктураДанных.ВыборкаРеквизитыСФ;
	ТаблицаТоваров                    = СтруктураДанных.ТаблицаТоваров;
	ТаблицаКодовМаркировкиПоФакту     = СтруктураДанных.ТаблицаКодовМаркировкиПоФакту;
	ТаблицаКодовМаркировкиПоДокументу = СтруктураДанных.ТаблицаКодовМаркировкиПоДокументу;
	ТаблицаКодовМаркировкиИзлишки     = СтруктураДанных.ТаблицаКодовМаркировкиИзлишки;
	ТаблицаКодовМаркировкиНедостача   = СтруктураДанных.ТаблицаКодовМаркировкиНедостача;
	
	ПроверитьСопоставлениеСНоменклатуройКонтрагента(ТаблицаТоваров, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормы = "Документ.АктОРасхожденияхПоПоставке.ФормаОбъекта";
	
	// Наименование документа
	НаименованиеДокумента = НСтр("ru = 'Акт об установленном расхождении по количеству и качеству при приемке товарно-материальных ценностей'");
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "НаименованиеДокумента", НаименованиеДокумента);
	
	// Обстоятельства составления.
	ОбстоятельстваСоставления = "1";
	Если ВыборкаШапка.ОбстоятельстваСоставления = Перечисления.ОбстоятельстваСоставленияАктаОРасхождениях.ПослеПриемки Тогда
		ОбстоятельстваСоставления = "2";
	КонецЕсли;
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных, "ОбстоятельстваСоставленияДокумента", ОбстоятельстваСоставления);
	
	// Обстоятельства использования.
	ОбстоятельстваИспользования = "";
	Если ВыборкаШапка.ОбстоятельстваИспользования = Перечисления.ОбстоятельстваИспользованияАктаОРасхождениях.ПриемкаБезДокументов Тогда
		ОбстоятельстваИспользования = "1000";
	ИначеЕсли ВыборкаШапка.ОбстоятельстваИспользования = Перечисления.ОбстоятельстваИспользованияАктаОРасхождениях.ПриемкаСРасхождениями Тогда
		ОбстоятельстваИспользования = "2000";
	ИначеЕсли ВыборкаШапка.ОбстоятельстваИспользования = Перечисления.ОбстоятельстваИспользованияАктаОРасхождениях.Расхождения Тогда
		ОбстоятельстваИспользования = "3000";
	КонецЕсли;
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных, "ОбстоятельстваИспользованияДокумента", ОбстоятельстваИспользования);
	
	// Номер документа.
	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(СсылкаНаОбъект, "НомерЭД");
	ПараметрыФормы = Новый Структура("Ключ", СсылкаНаОбъект);
	ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки(
		СсылкаНаОбъект, "Объект.Номер", НавигационнаяСсылка, ИмяФормы, ПараметрыФормы);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных, "НомерДокумента", ВыборкаШапка.НомерДокумента, ПараметрыОбработкиОшибок);
	
	// Дата документа.
	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(СсылкаНаОбъект, "ДатаЭД");
	ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки(
		СсылкаНаОбъект, "Объект.Дата", НавигационнаяСсылка, ИмяФормы, ПараметрыФормы);
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных, "ДатаДокумента", ВыборкаШапка.ДатаДокумента, ПараметрыОбработкиОшибок);
	
	//// Исправление.
	//Если ЗначениеЗаполнено(ВыборкаШапка.НомерИсправления) Тогда
	//	// Номер исправления.
	//	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(СсылкаНаОбъект, "НомерИсправления");
	//	ПараметрыФормы = Новый Структура("Ключ", СсылкаНаОбъект);
	//	ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки(
	//		СсылкаНаОбъект, "Объект.НомерИсправления", НавигационнаяСсылка, ИмяФормы, ПараметрыФормы);
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, "НомерИсправления", ВыборкаШапка.НомерИсправления, ПараметрыОбработкиОшибок);
	//	// Дата исправления.
	//	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(СсылкаНаОбъект, "Дата");
	//	ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки(
	//		СсылкаНаОбъект, "Объект.Дата", НавигационнаяСсылка, ИмяФормы, ПараметрыФормы);
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, "ДатаИсправления", ВыборкаШапка.Дата, ПараметрыОбработкиОшибок);
	//	// Исправляемый документ.
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, "ИсправляемыйДокумент", ВыборкаШапка.ИсправляемыйДокумент);
	//КонецЕсли;
	
	// Идентификатор гос. контракта.
	Если ЗначениеЗаполнено(ВыборкаШапка.ИдентификаторГосударственногоКонтракта) Тогда
		ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки(
			СсылкаНаОбъект, "Объект.ИдентификаторГосударственногоКонтракта");
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных, "ИдентификаторГосКонтракта", ВыборкаШапка.ИдентификаторГосударственногоКонтракта, ПараметрыОбработкиОшибок);
	КонецЕсли;
	
	// Покупатель / Составитель.
	Покупатель = Неопределено; 
	Если ЗначениеЗаполнено(ВыборкаШапка.Организация) Тогда
		
		Покупатель = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
		ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ВыборкаШапка.Организация, Покупатель);
		// Покупатель.
		ЗаполнитьДанныеУчастникаУПД(ДеревоДанных, Покупатель, "Покупатель");
		// Составитель.
		СоставительДокументаНаименование = Покупатель.ПолноеНаименование
			+ ?(ЗначениеЗаполнено(Покупатель.КПП),
			СтрШаблон(НСтр("ru = ', ИНН/КПП %1/%2'"), Покупатель.ИНН, Покупатель.КПП),
			СтрШаблон(НСтр("ru = ', ИНН %1'"), Покупатель.ИНН));
				
		ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки(
			ВыборкаШапка.Ссылка, "Объект.Организация");
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных, "СоставительДокументаНаименование", СоставительДокументаНаименование, ПараметрыОбработкиОшибок);
	Иначе
		// Покупатель.
		ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки(
			ВыборкаШапка.Ссылка, "Объект.Организация");
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных, "Покупатель", Покупатель, ПараметрыОбработкиОшибок);
	КонецЕсли;
	
	// Продавец.
	Продавец = Неопределено;
	Если ЗначениеЗаполнено(ВыборкаШапка.Поставщик) Тогда
		Продавец = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
		ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ВыборкаШапка.Поставщик, Продавец);
		ЗаполнитьДанныеУчастникаУПД(ДеревоДанных, Продавец, "Продавец");
	Иначе
		ПараметрыОбработкиОшибок = ЭлектронноеВзаимодействиеКлиентСервер.НовыеПараметрыОбработкиОшибки(
			ВыборкаШапка.Ссылка, "Объект.Контрагент");
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных, "Продавец", Продавец, ПараметрыОбработкиОшибок);
	КонецЕсли;
	
	// Грузоотправитель.
	Грузоотправитель = Неопределено;
	Если ЗначениеЗаполнено(ВыборкаШапка.Грузоотправитель) Тогда
		Грузоотправитель = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
		ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ВыборкаШапка.Грузоотправитель, Грузоотправитель);
		ЗаполнитьДанныеУчастникаУПД(ДеревоДанных, Грузоотправитель, "Грузоотправитель");
	КонецЕсли;
	
	// Грузополучатель.
	Грузополучатель = Неопределено;
	Если ЗначениеЗаполнено(ВыборкаШапка.Грузополучатель) Тогда
		Грузополучатель = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
		ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ВыборкаШапка.Грузополучатель, Грузополучатель);
		ЗаполнитьДанныеУчастникаУПД(ДеревоДанных, Грузополучатель, "Грузополучатель");
	КонецЕсли;
	
	// Страховая компания.
	СтраховаяКомпания = Неопределено;
	Если ЗначениеЗаполнено(ВыборкаШапка.СтраховаяКомпания) Тогда
		СтраховаяКомпания = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
		ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеЮрФизЛица(ВыборкаШапка.СтраховаяКомпания, СтраховаяКомпания);
		ЗаполнитьДанныеУчастникаУПД(ДеревоДанных, СтраховаяКомпания, "СтраховаяКомпания");
	КонецЕсли;
	
	
	
	//// Номер приказа.
	//Если ЗначениеЗаполнено(ВыборкаШапка.НомерПриказа) Тогда
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, "НомерПриказа", ВыборкаШапка.НомерПриказа);
	//КонецЕсли;
	//
	//// Дата приказа.
	//Если ЗначениеЗаполнено(ВыборкаШапка.ДатаПриказа) Тогда
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, "ДатаПриказа", ВыборкаШапка.ДатаПриказа);
	//КонецЕсли;
	
	// Сведения об осмотре груза.
	//ОбщийПуть = "СведенияОбОсмотреГруза.";
	//Если ЗначениеЗаполнено(ВыборкаШапка.ДатаОсмотраГруза) Тогда
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, ОбщийПуть + "ДатаОсмотра", ВыборкаШапка.ДатаОсмотраГруза);
	//КонецЕсли;
	//Если ЗначениеЗаполнено(ВыборкаШапка.МестоСоставления) Тогда
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, ОбщийПуть + "МестоСоставленияДокумента", ВыборкаШапка.МестоСоставления);
	//КонецЕсли;
	//Если ЗначениеЗаполнено(ВыборкаШапка.ВремяНачалаПриемки) Тогда
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, ОбщийПуть + "ВремяПриемкиНачало", ВыборкаШапка.ВремяНачалаПриемки);
	//КонецЕсли;
	//Если ЗначениеЗаполнено(ВыборкаШапка.ВремяОкончанияПриемки) Тогда
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, ОбщийПуть + "ВремяПриемкиОкончание", ВыборкаШапка.ВремяОкончанияПриемки);
	//КонецЕсли;
	//Если ЗначениеЗаполнено(ВыборкаШапка.ДатаОтправленияТоваров) Тогда
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, ОбщийПуть + "ДатаОтправки", ВыборкаШапка.ДатаОтправленияТоваров);
	//КонецЕсли;
	////  СертификатыСоответствия.
	//ВыборкаСертификатыСоответствия = СтруктураДанных.ВыборкаСертификатыСоответствия;
	//НаборСертификатов = Новый Массив;
	//Пока ВыборкаСертификатыСоответствия.Следующий() Цикл
	//	НаборСертификатов.Добавить(ВыборкаСертификатыСоответствия.Номер);
	//КонецЦикла;
	//Если ЗначениеЗаполнено(НаборСертификатов) Тогда
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, ОбщийПуть + "СертификатыСоответствия", НаборСертификатов);
	//КонецЕсли;
	//  Сопроводительный документ.
	//СопроводительныйДокументНаименование = ?(ЗначениеЗаполнено(ВыборкаШапка.СопроводительныйДокументНаименование),
	//	ВыборкаШапка.СопроводительныйДокументНаименование, "БСД");
	//СопроводительныйДокументНомер = ?(ЗначениеЗаполнено(ВыборкаШапка.СопроводительныйДокументНомер),
	//	ВыборкаШапка.СопроводительныйДокументНомер, "б/н");
	//СопроводительныйДокументДата = ?(ЗначениеЗаполнено(ВыборкаШапка.СопроводительныйДокументДата),
	//	ВыборкаШапка.СопроводительныйДокументДата, "");
	//Если ЗначениеЗаполнено(СопроводительныйДокументНаименование) Тогда
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, ОбщийПуть + "СопроводительныйДокумент.Наименование", СопроводительныйДокументНаименование);
	//КонецЕсли;
	//Если ЗначениеЗаполнено(СопроводительныйДокументНомер) Тогда
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, ОбщийПуть + "СопроводительныйДокумент.Номер", СопроводительныйДокументНомер);
	//КонецЕсли;
	//Если ЗначениеЗаполнено(СопроводительныйДокументДата) Тогда
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, ОбщийПуть + "СопроводительныйДокумент.Дата", СопроводительныйДокументДата);
	//КонецЕсли;
	
	//// Сведения по транспортным документам.
	//СведенияПоТранспортнымДокументам = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(
	//	ДеревоДанных, "СведенияПоТранспортнымДокументам");
	//ВыборкаСведенияОГрузе = СтруктураДанных.ВыборкаСведенияОГрузе;
	//Пока ВыборкаСведенияОГрузе.Следующий() Цикл
	//	НоваяСтрока = СведенияПоТранспортнымДокументам.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСведенияОГрузе);
	//	Если ЗначениеЗаполнено(ВыборкаСведенияОГрузе.ОтметкиОтправителя) Тогда
	//		НоваяСтрока.ДополнительныеДанные = Новый Соответствие;
	//		НоваяСтрока.ДополнительныеДанные.Вставить(НСтр("ru = 'Особые отметки отправителя'"), ВыборкаСведенияОГрузе.ОтметкиОтправителя);
	//	КонецЕсли;
	//КонецЦикла;
	//ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, СведенияПоТранспортнымДокументам, "СведенияПоТранспортнымДокументам");
	
	СведенияПоТранспортнымДокументам = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(
		ДеревоДанных, "СведенияПоТранспортнымДокументам");
	
	НоменклатураПоОСУ = Новый Массив;
	Для Каждого ТоварнаяСтрока Из ТаблицаТоваров Цикл
		
		ОсобенностьУчета = Справочники.Номенклатура.ПолучитьОсобенностьУчета(ТоварнаяСтрока.Номенклатура);
		Если ОсобенностьУчета.ОСУ Тогда
			НоменклатураПоОСУ.Добавить(ТоварнаяСтрока.Номенклатура);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТоварнаяСтрока.КоличествоПоДокументу) Тогда
			Продолжить;
		КонецЕсли;
		Если ТоварнаяСтрока.ТолькоОСУ И НоменклатураПоОСУ.Найти(ТоварнаяСтрока.Номенклатура) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = СведенияПоТранспортнымДокументам.Добавить();
		НоваяСтрока.ВидУпаковки         = ТоварнаяСтрока.ВидУпаковки;
		НоваяСтрока.НаименованиеГруза   = ТоварнаяСтрока.Наименование;
		НоваяСтрока.ЕдиницаИзмеренияКод = ТоварнаяСтрока.УпаковкаКод;
		НоваяСтрока.ЕдиницаИзмеренияНаименование = ТоварнаяСтрока.УпаковкаНаименование;
	КонецЦикла;
	
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, СведенияПоТранспортнымДокументам, "СведенияПоТранспортнымДокументам");
	
	ДокументОснование = ВыборкаШапка.ДокументОснование;
	
	// Сопроводительный документ.
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
			Если ЗначениеЗаполнено(ВыборкаШапка.ВхДокНомер) И ЗначениеЗаполнено(ВыборкаШапка.ВхДокДата) Тогда 
				СопроводительныйДокументНаименование = "Счет-фактура";
			Иначе
				СопроводительныйДокументНаименование = "БСД";
			КонецЕсли;
		Иначе
			СопроводительныйДокументНаименование = "БСД";
		КонецЕсли;
		СопроводительныйДокументНомер = ?(ЗначениеЗаполнено(ВыборкаШапка.ВхДокНомер),
			ВыборкаШапка.ВхДокНомер, "б/н");
		СопроводительныйДокументДата = ?(ЗначениеЗаполнено(ВыборкаШапка.ВхДокДата),
			ВыборкаШапка.ВхДокДата, "");
		Если ЗначениеЗаполнено(СопроводительныйДокументНаименование) Тогда
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, "СведенияОбОсмотреГруза.СопроводительныйДокумент.Наименование", СопроводительныйДокументНаименование);
		КонецЕсли;
		Если ЗначениеЗаполнено(СопроводительныйДокументНомер) Тогда
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, "СведенияОбОсмотреГруза.СопроводительныйДокумент.Номер", СопроводительныйДокументНомер);
		КонецЕсли;
		Если ЗначениеЗаполнено(СопроводительныйДокументДата) Тогда
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, "СведенияОбОсмотреГруза.СопроводительныйДокумент.Дата", СопроводительныйДокументДата);
		КонецЕсли;
	КонецЕсли;
	
	// Сведения о времени приемки.
	//ОбщийПуть = "СведенияОВремениПриемки.";
	//Если ЗначениеЗаполнено(ВыборкаШапка.ДатаПрибытияВПунктНазначения) Тогда
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, ОбщийПуть + "ДатаПрибытияВПунктНазначения", ВыборкаШапка.ДатаПрибытияВПунктНазначения);
	//КонецЕсли;
	//Если ЗначениеЗаполнено(ВыборкаШапка.ДатаПрибытияВПунктНазначения) Тогда
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, ОбщийПуть + "ДатаВыдачиОрганизациейТранспорта", ВыборкаШапка.ДатаВыдачиОрганизациейТранспорта);
	//КонецЕсли;
	//Если ЗначениеЗаполнено(ВыборкаШапка.ДатаПрибытияВПунктНазначения) Тогда
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, ОбщийПуть + "ДатаВскрытияТранспортныхСредств", ВыборкаШапка.ДатаВскрытияТранспортныхСредств);
	//КонецЕсли;
	//Если ЗначениеЗаполнено(ВыборкаШапка.ДатаПрибытияВПунктНазначения) Тогда
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, ОбщийПуть + "ДатаДоставкиНаСкладПолучателя", ВыборкаШапка.ДатаДоставкиНаСкладПолучателя);
	//КонецЕсли;
	
	// Обстоятельства приемки.
	ОбщийПуть = "ОбстоятельстваПриемки.";
	Если ЗначениеЗаполнено(ВыборкаШапка.УсловияХраненияТовараДоВскрытия) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных, ОбщийПуть + "УсловияХраненияТоваровНаСкладеПолучателя", ВыборкаШапка.УсловияХраненияТовараДоВскрытия);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыборкаШапка.СостояниеТарыИУпаковки) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных, ОбщийПуть + "СостояниеТарыУпаковки", ВыборкаШапка.СостояниеТарыИУпаковки);
	КонецЕсли;
		
	//Если ЗначениеЗаполнено(ВыборкаШапка.СпособОпределенияКоличества) Тогда
	//	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
	//		ДеревоДанных, ОбщийПуть + "ТипОпределенияКоличества", ВыборкаШапка.СпособОпределенияКоличества);
	//КонецЕсли;
	Если ЗначениеЗаполнено(ВыборкаШапка.ДополнительнаяИнформация) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных, ОбщийПуть + "ДополнительныеСведения", ВыборкаШапка.ДополнительнаяИнформация);
	КонецЕсли;
	
	// Транспортный документ.
	Если ЗначениеЗаполнено(ВыборкаШапка.НомерТранспортнойНакладной) И ЗначениеЗаполнено(ВыборкаШапка.ДатаТранспортнойНакладной) Тогда
		ТранспортныйДокументНаименование = НСтр("ru = 'Транспортная накладная'");
		ТранспортныйДокументНомер = ВыборкаШапка.НомерТранспортнойНакладной;
		ТранспортныйДокументДата  = ВыборкаШапка.ДатаТранспортнойНакладной;
	Иначе
		ТранспортныйДокументНаименование =  НСтр("ru = 'БСД'");
		ТранспортныйДокументНомер =  НСтр("ru = 'б/н'");
		ТранспортныйДокументДата  = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТранспортныйДокументНаименование) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных, ОбщийПуть + "ТранспортныйДокумент.Наименование", ТранспортныйДокументНаименование);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТранспортныйДокументНомер) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных, ОбщийПуть + "ТранспортныйДокумент.Номер", ТранспортныйДокументНомер);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТранспортныйДокументДата) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных, ОбщийПуть + "ТранспортныйДокумент.Дата", ТранспортныйДокументДата);
	КонецЕсли;
	
	// Сведения о лице, принявшем товар.
	ОбщийПуть = "СведенияОЛицеПринявшемТовар.РаботникОрганизацииПокупателя.";
	Если ЗначениеЗаполнено(ВыборкаШапка.МенеджерПринявшийТовар) Тогда
		
		МенеджерПринявшийТовар = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаШапка.МенеджерПринявшийТовар, "Фамилия, Имя, Отчество, Должность");
		
		Если ЗначениеЗаполнено(МенеджерПринявшийТовар.Фамилия) Тогда
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, ОбщийПуть + "Фамилия", МенеджерПринявшийТовар.Фамилия);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, ОбщийПуть + "Имя", МенеджерПринявшийТовар.Имя);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, ОбщийПуть + "Отчество", МенеджерПринявшийТовар.Отчество);
		Иначе
			ФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(ВыборкаШапка.МенеджерПринявшийТовар);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, ОбщийПуть + "Фамилия", ФИО.Фамилия);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, ОбщийПуть + "Имя", ФИО.Имя);
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
				ДеревоДанных, ОбщийПуть + "Отчество", ФИО.Отчество);
		КонецЕсли;
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных, ОбщийПуть + "ОснованиеПолномочий", НСтр("ru = 'Должностные обязанности'"));
		
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных, ОбщийПуть + "Должность", СокрЛП(МенеджерПринявшийТовар.Должность));
	КонецЕсли;
	
	// Краткое описание события.
	ОписаниеСобытия = НСтр("ru = 'При приемке указанных в документе ценностей (результатов работ) установлены расхождения с сопроводительными документами.'");
	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
		ДеревоДанных, "КраткоеОписаниеСобытия", ОписаниеСобытия);
	
	// Заключение комиссии.
	Если ЗначениеЗаполнено(ВыборкаШапка.ЗаключениеКомиссии) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(
			ДеревоДанных, "ЗаключениеКомиссии", ВыборкаШапка.ЗаключениеКомиссии);
	КонецЕсли;
	
	// Результаты приемки.
	РезультатыПриемки = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(
		ДеревоДанных, "РезультатыПриемки");
	
	//ВыборкаТовары = СтруктураДанных.ВыборкаТовары;
	//
	//ШтрихкодыКомбинаций   = Неопределено;
	//ШтрихкодыНоменклатуры = Неопределено;
	//Если НЕ СтруктураДанных.Свойство("ШтрихкодыНоменклатуры", ШтрихкодыНоменклатуры)
	//	ИЛИ НЕ СтруктураДанных.Свойство("ШтрихкодыКомбинаций", ШтрихкодыКомбинаций) Тогда
	//	ШтрихкодыПоТоварам(ВыборкаТовары, ШтрихкодыКомбинаций, ШтрихкодыНоменклатуры);
	//КонецЕсли;
	
	РезультатыПриемки.Колонки.Добавить("ИдентификаторСтроки");
	РезультатыПриемки.Колонки.Добавить("Номенклатура");
	РезультатыПриемки.Колонки.Добавить("GTIN");
	РезультатыПриемки.Колонки.Добавить("GTINПоДокументу");
	РезультатыПриемки.Колонки.Добавить("КоличествоУпаковок");
	РезультатыПриемки.Колонки.Добавить("КоличествоУпаковокПоДокументу");
	
	Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		
		УчетПоОСУ = (НЕ НоменклатураПоОСУ.Найти(СтрокаТаблицы.Номенклатура) = Неопределено);
		
		Если СтрокаТаблицы.ТолькоОСУ И (НЕ УчетПоОСУ) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = РезультатыПриемки.Добавить();
		НоваяСтрока.ЕдиницаИзмеренияНаименование  = СтрокаТаблицы.УпаковкаНаименование;
		НоваяСтрока.ЕдиницаИзмеренияКод           = СтрокаТаблицы.УпаковкаКод;
		НоваяСтрока.ИнформацияОРасхождениях       = СтрокаТаблицы.ИнформацияОРасхождениях;
		НоваяСтрока.ИдентификаторСтроки           = СтрокаТаблицы.ИдентификаторСтроки;
		НоваяСтрока.Номенклатура                  = СтрокаТаблицы.Номенклатура;
		НоваяСтрока.GTIN                          = СтрокаТаблицы.GTIN;
		НоваяСтрока.GTINПоДокументу               = СтрокаТаблицы.GTINПоДокументу;
		НоваяСтрока.КоличествоУпаковок            = СтрокаТаблицы.КоличествоУпаковок;
		НоваяСтрока.КоличествоУпаковокПоДокументу = СтрокаТаблицы.КоличествоУпаковокПоДокументу;
		
		НоваяСтрока.Товар = Новый Структура;
		НоваяСтрока.Товар.Вставить("Наименование",   Лев(СокрЛП(СтрокаТаблицы.НаименованиеНоменклатуры),1000));
		НоваяСтрока.Товар.Вставить("Характеристика", Лев(СокрЛП(СтрокаТаблицы.НаименованиеХарактеристики),1000));
		НоваяСтрока.Товар.Вставить("Артикул",        СтрокаТаблицы.ТоварАртикул);
		НоваяСтрока.Товар.Вставить("Код",            СтрокаТаблицы.ТоварКод);
		НоваяСтрока.Товар.Вставить("Паспорт",        "");
		НоваяСтрока.Товар.Вставить("НомерСтрокиСопроводительногоДокумента", СтрокаТаблицы.НомерСтрокиРеализации);
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.КоличествоПоДокументу) Тогда
			
			СуммаСНДСПоДокументу   = Окр(СтрокаТаблицы.СуммаПоДокументу, 2);
			СуммаНДСПоДокументу    = Окр(СтрокаТаблицы.СуммаНДСПоДокументу, 2);
			СуммаБезНДСПоДокументу = СуммаСНДСПоДокументу - СуммаНДСПоДокументу;
			
			Если ВыборкаШапка.СуммаВключаетНДС Тогда
				ЦенаПоДокументу = ?(СтрокаТаблицы.КоличествоПоДокументу = 0, 
				0, Окр(СуммаСНДСПоДокументу / СтрокаТаблицы.КоличествоПоДокументу, 2));
			Иначе
				ЦенаПоДокументу = ?(СтрокаТаблицы.КоличествоПоДокументу = 0, 
				0, Окр(СуммаБезНДСПоДокументу / СтрокаТаблицы.КоличествоПоДокументу, 2));
			КонецЕсли;
			
			СведенияОМаркировке = СведенияОКодахУпаковокМаркируемойПродукции(СтрокаТаблицы, Неопределено, ТаблицаКодовМаркировкиПоДокументу, Истина);
			
			НоваяСтрока.ПоДокументу = Новый Структура;
			НоваяСтрока.ПоДокументу.Вставить("Количество", СтрокаТаблицы.КоличествоПоДокументу);
			НоваяСтрока.ПоДокументу.Вставить("Цена",       ЦенаПоДокументу);
			НоваяСтрока.ПоДокументу.Вставить("СтавкаНДС",  СтрокаТаблицы.СтавкаНДСПоДокументу);
			НоваяСтрока.ПоДокументу.Вставить("СуммаНДС",   СуммаНДСПоДокументу);
			НоваяСтрока.ПоДокументу.Вставить("СуммаСНДС",  СуммаСНДСПоДокументу);
			НоваяСтрока.ПоДокументу.Вставить("Маркировка", СведенияОМаркировке);
			//ЗаполнитьСведенияОМаркировке_2019(НоваяСтрока, ТаблицаКодовМаркировкиПоДокументу, "ПоДокументу", Истина);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.КоличествоПоФакту) Тогда
			
			СуммаСНДСПоФакту   = Окр(СтрокаТаблицы.СуммаПоФакту, 2);
			СуммаНДСПоФакту    = Окр(СтрокаТаблицы.СуммаНДСПоФакту, 2);
			СуммаБезНДСПоФакту = СуммаСНДСПоФакту - СуммаНДСПоФакту;
			
			Если ВыборкаШапка.СуммаВключаетНДС Тогда
				ЦенаПоФакту = ?(СтрокаТаблицы.КоличествоПоФакту = 0, 0, Окр(СуммаСНДСПоФакту / СтрокаТаблицы.КоличествоПоФакту, 2));
			Иначе
				ЦенаПоФакту = ?(СтрокаТаблицы.КоличествоПоФакту = 0, 0, Окр(СуммаБезНДСПоФакту / СтрокаТаблицы.КоличествоПоФакту, 2));
			КонецЕсли;
			
			СведенияОМаркировке = СведенияОКодахУпаковокМаркируемойПродукции(СтрокаТаблицы, Неопределено, ТаблицаКодовМаркировкиПоФакту);
			
			НоваяСтрока.ПоФакту = Новый Структура;
			НоваяСтрока.ПоФакту.Вставить("Количество", СтрокаТаблицы.КоличествоПоФакту);
			НоваяСтрока.ПоФакту.Вставить("Цена",       ЦенаПоФакту);
			НоваяСтрока.ПоФакту.Вставить("СтавкаНДС", СтрокаТаблицы.СтавкаНДСПоФакту);
			НоваяСтрока.ПоФакту.Вставить("СуммаНДС",  СуммаНДСПоФакту);
			НоваяСтрока.ПоФакту.Вставить("СуммаСНДС", СуммаСНДСПоФакту);
			НоваяСтрока.ПоФакту.Вставить("Маркировка", СведенияОМаркировке);
			//ЗаполнитьСведенияОМаркировке_2019(НоваяСтрока, ТаблицаКодовМаркировкиПоФакту, "ПоФакту", Истина);
			
		КонецЕсли;
		
		НоваяСтрока.Излишки   = Новый Структура;
		НоваяСтрока.Недостача = Новый Структура;
		//НоваяСтрока.Брак      = Новый Структура;
		
		Если СтрокаТаблицы.КоличествоИзлишек > 0 Тогда
			НоваяСтрока.Излишки.Вставить("Количество", СтрокаТаблицы.КоличествоИзлишек);
		ИначеЕсли СтрокаТаблицы.КоличествоНедостача > 0 Тогда
			НоваяСтрока.Недостача.Вставить("Количество", СтрокаТаблицы.КоличествоНедостача);
		КонецЕсли;
		
		Если СтрокаТаблицы.СуммаИзлишек > 0 Тогда
			НоваяСтрока.Излишки.Вставить("СуммаСНДС", Окр(СтрокаТаблицы.СуммаИзлишек, 2));
		ИначеЕсли СтрокаТаблицы.СуммаНедостача > 0 Тогда
			НоваяСтрока.Недостача.Вставить("СуммаСНДС", Окр(СтрокаТаблицы.СуммаНедостача, 2));
		КонецЕсли;
		
		Если СтрокаТаблицы.СуммаНДСИзлишек > 0 Тогда
			НоваяСтрока.Излишки.Вставить("СуммаНДС", Окр(СтрокаТаблицы.СуммаНДСИзлишек, 2));
		ИначеЕсли СтрокаТаблицы.СуммаНДСНедостача > 0 Тогда
			НоваяСтрока.Недостача.Вставить("СуммаНДС", Окр(СтрокаТаблицы.СуммаНДСНедостача, 2));
		КонецЕсли;
		
		Если УчетПоОСУ Тогда
			Если (НЕ СтрокаТаблицы.GTIN=СтрокаТаблицы.GTINПоДокументу) ИЛИ 
				(НЕ СтрокаТаблицы.КоличествоУпаковок=СтрокаТаблицы.КоличествоУпаковокПоДокументу) Тогда
				СведенияОМаркировке = СведенияОКодахУпаковокМаркируемойПродукции(СтрокаТаблицы, Неопределено, ТаблицаКодовМаркировкиИзлишки);
				НоваяСтрока.Излишки.Вставить("Маркировка", СведенияОМаркировке);
				
				СведенияОМаркировке = СведенияОКодахУпаковокМаркируемойПродукции(СтрокаТаблицы, Неопределено, ТаблицаКодовМаркировкиНедостача, Истина);
				НоваяСтрока.Недостача.Вставить("Маркировка", СведенияОМаркировке);
				//ЗаполнитьСведенияОМаркировке_2019(НоваяСтрока, ТаблицаКодовМаркировкиИзлишки, "Излишки", Истина);
				//ЗаполнитьСведенияОМаркировке_2019(НоваяСтрока, ТаблицаКодовМаркировкиНедостача, "Недостача", Истина);
			КонецЕсли;
		Иначе
			СведенияОМаркировке = СведенияОКодахУпаковокМаркируемойПродукции(СтрокаТаблицы, Неопределено, ТаблицаКодовМаркировкиИзлишки);
			НоваяСтрока.Излишки.Вставить("Маркировка", СведенияОМаркировке);
			
			СведенияОМаркировке = СведенияОКодахУпаковокМаркируемойПродукции(СтрокаТаблицы, Неопределено, ТаблицаКодовМаркировкиНедостача, Истина);
			НоваяСтрока.Недостача.Вставить("Маркировка", СведенияОМаркировке);
			//ЗаполнитьСведенияОМаркировке_2019(НоваяСтрока, ТаблицаКодовМаркировкиИзлишки, "Излишки", Истина);
			//ЗаполнитьСведенияОМаркировке_2019(НоваяСтрока, ТаблицаКодовМаркировкиНедостача, "Недостача", Истина);
		КонецЕсли;
		
		ИДТовара = СтрокаТаблицы.Номенклатура.УникальныйИдентификатор();
		ИДХарактеристики = ?(ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), СтрокаТаблицы.Характеристика.УникальныйИдентификатор(), "");
		ИДУпаковки = "";
		
		ИдТовараУКонтрагента = Строка(ИДТовара)+"#"+Строка(ИДХарактеристики)+"#"+Строка(ИДУпаковки);
		
		Сопоставление = СопоставлениеНоменклатуры();
		Сопоставление.Идентификатор       = ИдТовараУКонтрагента;
		Сопоставление.Наименование        = Лев(СокрЛП(СтрокаТаблицы.НаименованиеНоменклатуры),1000);
		Сопоставление.Характеристика      = Лев(СокрЛП(СтрокаТаблицы.НаименованиеХарактеристики),1000);
		Сопоставление.ЕдиницаИзмерения    = СтрокаТаблицы.УпаковкаНаименование;
		Сопоставление.ЕдиницаИзмеренияКод = СтрокаТаблицы.УпаковкаКод;
		Сопоставление.Артикул             = СтрокаТаблицы.ТоварАртикул;
		Сопоставление.СтавкаНДС           = СтрокаТаблицы.СтавкаНДСПоФакту;
		Сопоставление.НоменклатураИБ      = СтрокаТаблицы.Номенклатура;
		Сопоставление.ХарактеристикаИБ    = СтрокаТаблицы.Характеристика;
		Сопоставление.УпаковкаИБ          = СтрокаТаблицы.Упаковка;
		
		НоваяСтрока.Сопоставление = Сопоставление;
		
	КонецЦикла;
	
	//Пока ВыборкаТовары.Следующий() Цикл
	//	
	//	НоваяСтрока = РезультатыПриемки.Добавить();
	//	НоваяСтрока.ЕдиницаИзмеренияНаименование = ВыборкаТовары.ЕдиницаИзмеренияНаименование;
	//	НоваяСтрока.ЕдиницаИзмеренияКод = ВыборкаТовары.ЕдиницаИзмеренияКод;
	//	НоваяСтрока.ИнформацияОРасхождениях = ВыборкаТовары.Пояснение;
	//	
	//	НоваяСтрока.Товар = Новый Структура;
	//	НоваяСтрока.Товар.Вставить("Наименование", ВыборкаТовары.Наименование);
	//	НоваяСтрока.Товар.Вставить("Характеристика", ВыборкаТовары.ХарактеристикаНаименование);
	//	НоваяСтрока.Товар.Вставить("Артикул", ВыборкаТовары.НоменклатураАртикул);
	//	НоваяСтрока.Товар.Вставить("Код", ВыборкаТовары.НоменклатураКод);
	//	НоваяСтрока.Товар.Вставить("Паспорт", ВыборкаТовары.НомерПаспорта);
	//	
	//	Если ЗначениеЗаполнено(ВыборкаТовары.КоличествоПоДокументу) Тогда
	//		НоваяСтрока.ПоДокументу = Новый Структура;
	//		НоваяСтрока.ПоДокументу.Вставить("Количество", ВыборкаТовары.КоличествоПоДокументу);
	//		НоваяСтрока.ПоДокументу.Вставить("Цена", ВыборкаТовары.ЦенаПоДокументу);
	//		НоваяСтрока.ПоДокументу.Вставить("СтавкаНДС", ВыборкаТовары.СтавкаНДСПоДокументу);
	//		НоваяСтрока.ПоДокументу.Вставить("СуммаНДС", ВыборкаТовары.СуммаНДСПоДокументу);
	//		НоваяСтрока.ПоДокументу.Вставить("СуммаСНДС", ВыборкаТовары.СуммаСНДСПоДокументу);
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(ВыборкаТовары.Количество) Тогда
	//		НоваяСтрока.ПоФакту = Новый Структура;
	//		НоваяСтрока.ПоФакту.Вставить("Количество", ВыборкаТовары.Количество);
	//		НоваяСтрока.ПоФакту.Вставить("Цена", ВыборкаТовары.Цена);
	//		НоваяСтрока.ПоФакту.Вставить("СтавкаНДС", ВыборкаТовары.СтавкаНДС);
	//		НоваяСтрока.ПоФакту.Вставить("СуммаНДС", ВыборкаТовары.СуммаНДС);
	//		НоваяСтрока.ПоФакту.Вставить("СуммаСНДС", ВыборкаТовары.СуммаСНДС);
	//	КонецЕсли;
	//	КоэффициентСтавкиНДС = ТорговыйКомплексЭДОКлиентСервер.ПолучитьСтавкуНДСЧислом(ВыборкаТовары.СтавкаНДСПоДокументу);
	//	Если ЗначениеЗаполнено(ВыборкаТовары.КоличествоБрак) Тогда
	//		Сумма = Окр(ВыборкаТовары.КоличествоБрак * ВыборкаТовары.ЦенаПоДокументу, 2);
	//		СуммаНДС = Окр(Сумма * КоэффициентСтавкиНДС, 2);
	//		СуммаСНДС = Сумма + СуммаНДС;
	//		НоваяСтрока.Брак = Новый Структура;
	//		НоваяСтрока.Брак.Вставить("Количество", ВыборкаТовары.КоличествоБрак);
	//		НоваяСтрока.Брак.Вставить("СуммаНДС", СуммаНДС);
	//		НоваяСтрока.Брак.Вставить("СуммаСНДС", СуммаСНДС);
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(ВыборкаТовары.КоличествоБой) Тогда
	//		Сумма = Окр(ВыборкаТовары.КоличествоБой * ВыборкаТовары.ЦенаПоДокументу, 2);
	//		СуммаНДС = Окр(Сумма * КоэффициентСтавкиНДС, 2);
	//		СуммаСНДС = Сумма + СуммаНДС;
	//		НоваяСтрока.Бой = Новый Структура;
	//		НоваяСтрока.Бой.Вставить("Количество", ВыборкаТовары.КоличествоБой);
	//		НоваяСтрока.Бой.Вставить("СуммаНДС", СуммаНДС);
	//		НоваяСтрока.Бой.Вставить("СуммаСНДС", СуммаСНДС);
	//	КонецЕсли;
	//	НоваяСтрока.Излишки = Новый Структура;
	//	НоваяСтрока.Недостача = Новый Структура;
	//	Если ВыборкаТовары.Количество > ВыборкаТовары.КоличествоПоДокументу Тогда
	//		НоваяСтрока.Излишки.Вставить("Количество", ВыборкаТовары.Количество - ВыборкаТовары.КоличествоПоДокументу);
	//	ИначеЕсли ВыборкаТовары.Количество < ВыборкаТовары.КоличествоПоДокументу Тогда
	//		НоваяСтрока.Недостача.Вставить("Количество", ВыборкаТовары.КоличествоПоДокументу - ВыборкаТовары.Количество);
	//	КонецЕсли;
	//	Если ВыборкаТовары.СуммаНДС > ВыборкаТовары.СуммаНДСПоДокументу Тогда
	//		НоваяСтрока.Излишки.Вставить("СуммаНДС", ВыборкаТовары.СуммаНДС - ВыборкаТовары.СуммаНДСПоДокументу);
	//	ИначеЕсли ВыборкаТовары.СуммаНДС < ВыборкаТовары.СуммаНДСПоДокументу Тогда
	//		НоваяСтрока.Недостача.Вставить("СуммаНДС", ВыборкаТовары.СуммаНДСПоДокументу - ВыборкаТовары.СуммаНДС);
	//	КонецЕсли;
	//	Если ВыборкаТовары.СуммаСНДС > ВыборкаТовары.СуммаСНДСПоДокументу Тогда
	//		НоваяСтрока.Излишки.Вставить("СуммаСНДС", ВыборкаТовары.СуммаСНДС - ВыборкаТовары.СуммаСНДСПоДокументу);
	//	ИначеЕсли ВыборкаТовары.СуммаСНДС < ВыборкаТовары.СуммаСНДСПоДокументу Тогда
	//		НоваяСтрока.Недостача.Вставить("СуммаСНДС", ВыборкаТовары.СуммаСНДСПоДокументу - ВыборкаТовары.СуммаСНДС);
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(ВыборкаТовары.ЦенаПоДоговору)
	//		ИЛИ ЗначениеЗаполнено(ВыборкаТовары.СуммаНДСПоДоговору)
	//		ИЛИ ЗначениеЗаполнено(ВыборкаТовары.СуммаСНДСПоДоговору) Тогда
	//		НоваяСтрока.ЦеновыеОтклонения = Новый Структура;
	//		НоваяСтрока.ЦеновыеОтклонения.Вставить("Цена", ВыборкаТовары.ЦенаПоДокументу - ВыборкаТовары.ЦенаПоДоговору);
	//		НоваяСтрока.ЦеновыеОтклонения.Вставить("СуммаНДС", ВыборкаТовары.СуммаНДСПоДокументу - ВыборкаТовары.СуммаНДСПоДоговору);
	//		НоваяСтрока.ЦеновыеОтклонения.Вставить("СуммаСНДС", ВыборкаТовары.СуммаСНДСПоДокументу - ВыборкаТовары.СуммаСНДСПоДоговору);
	//	КонецЕсли;
	//	
	//	// Сопоставление.
	//	Сопоставление = Новый Структура;
	//	Если ЗначениеЗаполнено(ВыборкаТовары.ИдентификаторКонтрагента) Тогда
	//		Сопоставление.Вставить("Идентификатор", ВыборкаТовары.ИдентификаторКонтрагента);
	//	КонецЕсли;
	//	Сопоставление.Вставить("НоменклатураИБ", ВыборкаТовары.Номенклатура);
	//	Сопоставление.Вставить("ХарактеристикаИБ", ВыборкаТовары.Характеристика);
	//	Сопоставление.Вставить("УпаковкаИБ", ВыборкаТовары.ЕдиницаИзмерения);
	//	
	//	Сопоставление.Вставить("Наименование", ВыборкаТовары.НаименованиеПолное);
	//	Сопоставление.Вставить("Характеристика", ВыборкаТовары.ХарактеристикаНаименование);
	//	Сопоставление.Вставить("ЕдиницаИзмерения", ВыборкаТовары.ЕдиницаИзмеренияНаименование);
	//	Сопоставление.Вставить("ЕдиницаИзмеренияКод", ВыборкаТовары.ЕдиницаИзмеренияКод);
	//	Сопоставление.Вставить("Артикул", ВыборкаТовары.НоменклатураАртикул);
	//	Сопоставление.Вставить("СтавкаНДС", ВыборкаТовары.СтавкаНДСПоДокументу);
	//	
	//	ЗаполнитьШтрихкодыТоваровВСопоставление(Сопоставление, ШтрихкодыНоменклатуры, ШтрихкодыКомбинаций,
	//		ВыборкаТовары.Номенклатура, ВыборкаТовары.Характеристика, ВыборкаТовары.ЕдиницаИзмерения);
	//	
	//	НоваяСтрока.Сопоставление = Сопоставление;
	//	
	//	// Маркировка
	//	ИменаПолейИТаблиц = ТорговыйКомплексЭДОКлиентСервер.ИменаПолейДереваДанныхИТаблицМаркировкиАктаОРасхождениях();
	//	Для Каждого ПараИмен Из ИменаПолейИТаблиц Цикл
	//		ТекущаяГрафа = НоваяСтрока[ПараИмен.Ключ];
	//		Если ТекущаяГрафа = Неопределено Тогда
	//			НоваяСтрока[ПараИмен.Ключ] = Новый Структура;
	//			ТекущаяГрафа = НоваяСтрока[ПараИмен.Ключ];
	//			ТекущаяГрафа.Вставить("Маркировка");
	//		ИначеЕсли Не ТекущаяГрафа.Свойство("Маркировка") Тогда
	//			ТекущаяГрафа.Вставить("Маркировка");
	//		КонецЕсли;
	//		
	//		ЗаполнитьСведенияОМаркировкеВДеревеДанныхАктаОРасхождениях(ТекущаяГрафа, СтруктураДанных[ПараИмен.Значение],
	//			"Маркировка", ВыборкаТовары.ИдентификаторСтроки);
	//	КонецЦикла;
	//КонецЦикла;
	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, РезультатыПриемки, "РезультатыПриемки");
	
	//// Прилагаемые документы.
	//ПрилагаемыеДокументы = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(
	//	ДеревоДанных, "ПрилагаемыеДокументы");
	//ВыборкаПрилагаемыеДокументы = СтруктураДанных.ВыборкаПрилагаемыеДокументы;
	//Пока ВыборкаПрилагаемыеДокументы.Следующий() Цикл
	//	НоваяСтрока = ПрилагаемыеДокументы.Добавить();
	//	НоваяСтрока.Наименование = ВыборкаПрилагаемыеДокументы.Наименование;
	//	НоваяСтрока.Номер = ВыборкаПрилагаемыеДокументы.Номер;
	//	НоваяСтрока.Дата = ВыборкаПрилагаемыеДокументы.Дата;
	//КонецЦикла;
	//ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ПрилагаемыеДокументы, "ПрилагаемыеДокументы");
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОМаркировкеВДеревеДанныхАктаОРасхождениях(СтрокаТовара, ТаблицаКодовДокумента,
	ИмяТаблицыМаркировки, ИдентификаторСтроки = "")

	ТаблицаКодов = Новый ТаблицаЗначений;
	ТаблицаКодов.Колонки.Добавить("Код");
	
	СведенияОМаркировке = Новый Структура;
	СведенияОМаркировке.Вставить("ИндивидуальныеУпаковки", ТаблицаКодов.Скопировать());
	СтрокаТовара[ИмяТаблицыМаркировки] = СведенияОМаркировке;
	
	ПараметрыПоиска = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	
	СтрокиУпаковок = ТаблицаКодовДокумента.НайтиСтроки(ПараметрыПоиска);
	Для Каждого СтрокаУпаковки Из СтрокиУпаковок Цикл
		НоваяСтрока = СведенияОМаркировке.ИндивидуальныеУпаковки.Добавить();
		НоваяСтрока.Код = СтрокаУпаковки.НомерУпаковки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Получение

Процедура НайтиСоздатьАктОРасхождениях_2019(ДеревоДанных, ДокументУчета = Неопределено, СпособОбработки = "", ОписаниеОшибки = "")
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ОснованиеДляСоставленияАкта", "Входящий электронный документ");
	//ДанныеЗаполнения.Вставить("ХозОперация", Справочники.ХозОперации.АктОРасхожденияхПоОтгрузке);
	//ДанныеЗаполнения.Вставить("Статус", Перечисления.СтатусыАктаОРасхождениях.НеСогласовано);
	//ДополнитьДанныеЗаполненияВалютой(ДеревоДанных, ДанныеЗаполнения);
	//ПрочитатьДанныеУчастника_АктаОРасхождениях(ДеревоДанных, ДанныеЗаполнения, "Продавец", "Организация", "Организации");
	//ПрочитатьДанныеУчастника_АктаОРасхождениях(ДеревоДанных, ДанныеЗаполнения, "Покупатель", "Контрагент", "Контрагенты");
	//ПрочитатьДанныеУчастника_АктаОРасхождениях(ДеревоДанных, ДанныеЗаполнения, "Грузополучатель", "Грузополучатель", "Контрагенты");
	//ПрочитатьДанныеУчастника_АктаОРасхождениях(ДеревоДанных, ДанныеЗаполнения, "Грузоотправитель", "Грузоотправитель", "ПодразделенияКомпании");
	//ПрочитатьДанныеУчастника_АктаОРасхождениях(ДеревоДанных, ДанныеЗаполнения, "Грузоотправитель", "Грузоотправитель", "ПодразделенияКомпании");
	//ПрочитатьДанныеУчастника_АктаОРасхождениях(ДеревоДанных, ДанныеЗаполнения, "СтраховаяКомпания", "СтраховаяКомпания", "Контрагенты");
	
	Для Каждого СтрокаДерева Из ДеревоДанных.Строки Цикл
		Путь = СтрокаДерева.ПолныйПуть;
		ДанныеСтроки = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(ДеревоДанных, Путь);
		ДанныеЗаполнения.Вставить(Путь, ДанныеСтроки);
	КонецЦикла;
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	Если ЗначениеЗаполнено(ДокументУчета) Тогда
		ДокументОбъект = ДокументУчета.ПолучитьОбъект();
	Иначе
		ДокументОбъект = Документы.АктОРасхожденияхПоОтгрузке.СоздатьДокумент();
		ДокументОбъект.Заполнить(Неопределено);
		ДокументОбъект.Дата = ТекущаяДатаСеанса;
		ДокументОбъект.УстановитьНовыйНомер();
	КонецЕсли;
	
	// Шапка.
	ДокументОбъект.Организация       = ОрганизацияПоРеквизитам(РеквизитыУчастникаАктаОРасхождениях(ДанныеЗаполнения.Продавец));
	ДокументОбъект.Контрагент        = КонтрагентПоРеквизитам(РеквизитыУчастникаАктаОРасхождениях(ДанныеЗаполнения.Покупатель));
	ДокументОбъект.Грузоотправитель  = КонтрагентПоРеквизитам(РеквизитыУчастникаАктаОРасхождениях(ДанныеЗаполнения.Грузоотправитель));
	ДокументОбъект.Грузополучатель   = КонтрагентПоРеквизитам(РеквизитыУчастникаАктаОРасхождениях(ДанныеЗаполнения.Грузополучатель));
	ДокументОбъект.СтраховаяКомпания = КонтрагентПоРеквизитам(РеквизитыУчастникаАктаОРасхождениях(ДанныеЗаполнения.СтраховаяКомпания));
	
	ДокументРеализация = Неопределено;
	СопроводительныйДокумент = ДанныеЗаполнения.СведенияОбОсмотреГруза.СопроводительныйДокумент;
	Если ЗначениеЗаполнено(СопроводительныйДокумент.Номер) Тогда
		ДокументРеализация = НайтиРеализациюТоваровУслуг(ДокументОбъект.Организация, СопроводительныйДокумент.Номер, СопроводительныйДокумент.Дата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументРеализация) Тогда
		ДокументОбъект.ДокументОснование = ДокументРеализация;
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРеализация, "ВалютаДокумента,ДоговорВзаиморасчетов, СкладКомпании", Истина);
		ДокументОбъект.ВалютаДокумента = РеквизитыОснования.ВалютаДокумента;
		ДокументОбъект.ДоговорВзаиморасчетов = РеквизитыОснования.ДоговорВзаиморасчетов;
		Документы.АктОРасхожденияхПоОтгрузке.ВалютаДокументаПриИзменении(ДокументОбъект);
		ДокументОбъект.СкладКомпании         = РеквизитыОснования.СкладКомпании;
	Иначе
		ДокументОбъект.ДокументОснование = Документы.РеализацияТоваров.ПустаяСсылка();
	КонецЕсли;
	
	ДокументОбъект.ВхДокНомер        = ДанныеЗаполнения.НомерДокумента;
	ДокументОбъект.ВхДокДата         = ДанныеЗаполнения.ДатаДокумента;
	ДокументОбъект.НомерИсправления  = ДанныеЗаполнения.НомерИсправления;
	
	//Если ЗначениеЗаполнено(ДанныеЗаполнения.НомерИсправления) Тогда
	//	ИсправляемыйДокумент = НайтиАктОРасхожденияхПоОтгрузке(
	//		ДокументОбъект.НомерЭД, ДокументОбъект.ДатаЭД, ДокументОбъект.НомерИсправления - 1,
	//		ДокументОбъект.Организация, ДокументОбъект.Контрагент);
	//	Если ЗначениеЗаполнено(ИсправляемыйДокумент) Тогда
	//		ДокументОбъект.ИсправляемыйДокумент = ИсправляемыйДокумент;
	//	КонецЕсли;
	//КонецЕсли;
	
	ДокументОбъект.ИдентификаторГосударственногоКонтракта = ДанныеЗаполнения.ИдентификаторГосКонтракта;
	ДокументОбъект.МестоПриемкиТовара  = ДанныеЗаполнения.СведенияОбОсмотреГруза.МестоСоставленияДокумента;
	ДокументОбъект.ДатаДоставкиТоваров = ДанныеЗаполнения.СведенияОбОсмотреГруза.ДатаОсмотра;
	//ДокументОбъект.ВремяНачалаПриемки = ДанныеЗаполнения.СведенияОбОсмотреГруза.ВремяПриемкиНачало;
	//ДокументОбъект.ВремяОкончанияПриемки = ДанныеЗаполнения.СведенияОбОсмотреГруза.ВремяПриемкиОкончание;
	//ДокументОбъект.ДатаОтправленияТоваров = ДанныеЗаполнения.СведенияОбОсмотреГруза.ДатаОтправки;
	
	//ДокументОбъект.ДатаПрибытияВПунктНазначения = ДанныеЗаполнения.СведенияОВремениПриемки.ДатаПрибытияВПунктНазначения;
	//ДокументОбъект.ДатаВыдачиОрганизациейТранспорта = ДанныеЗаполнения.СведенияОВремениПриемки.ДатаВыдачиОрганизациейТранспорта;
	//ДокументОбъект.ДатаВскрытияТранспортныхСредств = ДанныеЗаполнения.СведенияОВремениПриемки.ДатаВскрытияТранспортныхСредств;
	//ДокументОбъект.ДатаДоставкиНаСкладПолучателя = ДанныеЗаполнения.СведенияОВремениПриемки.ДатаДоставкиНаСкладПолучателя;
	
	ДокументОбъект.УсловияХраненияТовараДоВскрытия = ДанныеЗаполнения.ОбстоятельстваПриемки.УсловияХраненияТоваровНаСкладеПолучателя;
	ДокументОбъект.СостояниеТарыИУпаковки = ДанныеЗаполнения.ОбстоятельстваПриемки.СостояниеТарыУпаковки;
	//ДокументОбъект.СпособОпределенияКоличества = ДанныеЗаполнения.ОбстоятельстваПриемки.ТипОпределенияКоличества;
	ДокументОбъект.ДополнительнаяИнформация = ДанныеЗаполнения.ОбстоятельстваПриемки.ДополнительныеСведения;
	//ДокументОбъект.Перевозчик = КонтрагентПоРеквизитам(РеквизитыУчастникаАктаОРасхождениях(ДанныеЗаполнения.ОбстоятельстваПриемки.Перевозчик));
	
	Приемщик = РеквизитыПриемщикаАктаОРасхождениях(ДанныеЗаполнения.СведенияОЛицеПринявшемТовар);
	ДокументОбъект.Кладовщик = Приемщик.ФИО.Представление;
	
	//ДокументОбъект.НомерПриказа = ДанныеЗаполнения.НомерПриказа;
	//ДокументОбъект.ДатаПриказа = ДанныеЗаполнения.ДатаПриказа;
	ДокументОбъект.ЗаключениеКомиссии = ДанныеЗаполнения.ЗаключениеКомиссии;
	
	//ДокументОбъект.СопроводительныйДокументНаименование = СопроводительныйДокумент.Наименование;
	//ДокументОбъект.СопроводительныйДокументНомер = СопроводительныйДокумент.Номер;
	//ДокументОбъект.СопроводительныйДокументДата = СопроводительныйДокумент.Дата;
	
	//ТранспортныйДокумент = ДанныеЗаполнения.ОбстоятельстваПриемки.ТранспортныйДокумент;
	//ДокументОбъект.ТранспортныйДокументНаименование = ТранспортныйДокумент.Наименование;
	//ДокументОбъект.ТранспортныйДокументНомер = ТранспортныйДокумент.Номер;
	//ДокументОбъект.ТранспортныйДокументДата = ТранспортныйДокумент.Дата;
	
	Если ДанныеЗаполнения.ОбстоятельстваСоставленияДокумента = "1" Тогда
		ДокументОбъект.ОбстоятельстваСоставления = Перечисления.ОбстоятельстваСоставленияАктаОРасхождениях.ПриПриемке;
	ИначеЕсли ДанныеЗаполнения.ОбстоятельстваСоставленияДокумента = "2" Тогда
		ДокументОбъект.ОбстоятельстваСоставления = Перечисления.ОбстоятельстваСоставленияАктаОРасхождениях.ПослеПриемки;
	КонецЕсли;
	
	Если Лев(ДанныеЗаполнения.ОбстоятельстваИспользованияДокумента, 1) = "1" Тогда
		ДокументОбъект.ОбстоятельстваИспользования = Перечисления.ОбстоятельстваИспользованияАктаОРасхождениях.ПриемкаБезДокументов;
	ИначеЕсли Лев(ДанныеЗаполнения.ОбстоятельстваИспользованияДокумента, 1) = "2" Тогда
		ДокументОбъект.ОбстоятельстваИспользования = Перечисления.ОбстоятельстваИспользованияАктаОРасхождениях.ПриемкаСРасхождениями;
	ИначеЕсли Лев(ДанныеЗаполнения.ОбстоятельстваИспользованияДокумента, 1) = "3" Тогда
		ДокументОбъект.ОбстоятельстваИспользования = Перечисления.ОбстоятельстваИспользованияАктаОРасхождениях.Расхождения;
	КонецЕсли;
	
	//// Сведения по транспортным документам.
	//ДокументОбъект.СведенияОГрузе.Очистить();
	//Для каждого СтрокаДокумента Из ДанныеЗаполнения.СведенияПоТранспортнымДокументам Цикл
	//	
	//	НоваяСтрока = ДокументОбъект.СведенияОГрузе.Добавить();
	//	НоваяСтрока.Номенклатура = СтрокаДокумента.НаименованиеГруза;
	//	НоваяСтрока.ВидУпаковки = СтрокаДокумента.ВидУпаковки;
	//	НоваяСтрока.ОтметкаОбОпломбировании = СтрокаДокумента.ОтметкаОбОпломбировании;
	//	НоваяСтрока.КоличествоУпаковок = СтрокаДокумента.Количество;
	//	НоваяСтрока.МассаБруттоПоДокументу = СтрокаДокумента.МассаОтправленияБрутто;
	//	НоваяСтрока.МассаБрутто = СтрокаДокумента.МассаПрибытияБрутто;
	//	НоваяСтрока.МассаНеттоПоДокументу = СтрокаДокумента.МассаОтправленияНетто;
	//	НоваяСтрока.МассаНетто = СтрокаДокумента.МассаПрибытияНетто;
	//	НоваяСтрока.ЕдиницаИзмерения = ЭлектронноеВзаимодействие.НайтиСсылку("ЕдиницыИзмерения",
	//		СтрокаДокумента.ЕдиницаИзмеренияКод);
	//	ОтметкиОтправителя = Новый Массив;
	//	Если ТипЗнч(СтрокаДокумента.ДополнительныеДанные) = Тип("Соответствие") Тогда
	//		Для каждого КлючЗначение Из СтрокаДокумента.ДополнительныеДанные Цикл
	//			ОтметкиОтправителя.Добавить(КлючЗначение.Значение);
	//		КонецЦикла;
	//	КонецЕсли;
	//	НоваяСтрока.ОтметкиОтправителя = СтрСоединить(ОтметкиОтправителя, "; ");
	//	
	//КонецЦикла;
	
	//// Сертификаты соответствия.
	//ДокументОбъект.СертификатыСоответствия.Очистить();
	//Сертификаты = ДанныеЗаполнения.СведенияОбОсмотреГруза.СертификатыСоответствия;
	//Если ТипЗнч(Сертификаты) = Тип("Массив") Тогда
	//	Для каждого Номер Из Сертификаты Цикл
	//		ДокументОбъект.СертификатыСоответствия.Добавить().Номер = Номер;
	//	КонецЦикла;
	//КонецЕсли;
	
	//// Прилагаемые документы.
	//ДокументОбъект.ПрилагаемыеДокументы.Очистить();
	//Для каждого СтрокаДокумента Из ДанныеЗаполнения.ПрилагаемыеДокументы Цикл
	//	НоваяСтрока = ДокументОбъект.ПрилагаемыеДокументы.Добавить();
	//	НоваяСтрока.Наименование = СтрокаДокумента.Наименование;
	//	НоваяСтрока.Номер = СтрокаДокумента.Номер;
	//	НоваяСтрока.Дата = СтрокаДокумента.Дата;
	//КонецЦикла;
	
	// Маркировка.
	//ИменаПолейИТаблиц = ТорговыйКомплексЭДОКлиентСервер.ИменаПолейДереваДанныхИТаблицМаркировкиАктаОРасхождениях();
	//Для Каждого ПараИмен Из ИменаПолейИТаблиц Цикл
	//	ДокументОбъект[ПараИмен.Значение].Очистить();
	//КонецЦикла;
	
	КодыМаркировкиПоДокументу = НоваяТаблицаКодовМаркировки();
	КодыМаркировкиФакт        = НоваяТаблицаКодовМаркировки();
	
	// Товары.
	ОблагаетсяНДСУПокупателя = Ложь;
	ДокументОбъект.Товары.Очистить();
	ДокументОбъект.Марки.Очистить();
	Для каждого СтрокаПриемки Из ДанныеЗаполнения.РезультатыПриемки Цикл
		
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьСлужебныеРеквизитыПозицииТовара(НоваяСтрока);
		
		Если ЗначениеЗаполнено(СтрокаПриемки.Сопоставление.НоменклатураИБ) Тогда
			НоваяСтрока.Номенклатура = СтрокаПриемки.Сопоставление.НоменклатураИБ;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаПриемки.Сопоставление.ХарактеристикаИБ) Тогда
			НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаПриемки.Сопоставление.ХарактеристикаИБ;
		КонецЕсли;
		
		УпаковкаИБ          = СтрокаПриемки.Сопоставление.УпаковкаИБ;
		КодЕдиницыИзмерения = СтрокаПриемки.ЕдиницаИзмеренияКод;
		Если ЗначениеЗаполнено(УпаковкаИБ) И ТипЗнч(УпаковкаИБ) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
			НоваяСтрока.ЕдиницаИзмерения = СтрокаПриемки.Сопоставление.УпаковкаИБ;
			НоваяСтрока.Коэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УпаковкаИБ, "Коэффициент");
		ИначеЕсли ЗначениеЗаполнено(КодЕдиницыИзмерения) И ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
			ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "ТипНоменклатуры");
			
			РеквизитыНоменклатуры = Новый Структура("Номенклатура, ТипНоменклатуры", НоваяСтрока.Номенклатура, ТипНоменклатуры); 
			
			ЕдиницаИзмерения = Неопределено;
			ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект(
				"ЕдиницыИзмерения",
				ЕдиницаИзмерения,
				КодЕдиницыИзмерения,
				РеквизитыНоменклатуры
			);
			
			НоваяСтрока.ЕдиницаИзмерения = ЕдиницаИзмерения;
			Если ЗначениеЗаполнено(НоваяСтрока.ЕдиницаИзмерения) Тогда
				НоваяСтрока.Коэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.ЕдиницаИзмерения, "Коэффициент");
			КонецЕсли;
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(СтрокаПриемки.Сопоставление.Наименование) Тогда
		//	НоваяСтрока.НоменклатураПоставщика = СтрокаПриемки.Сопоставление.Наименование;
		//КонецЕсли;
		
		Если НоваяСтрока.Коэффициент = 0 Тогда
			НоваяСтрока.Коэффициент = 1;
		КонецЕсли;
		
		//ЗаполнитьСлужебныеРеквизитыПозицииТовара(НоваяСтрока);
		НоваяСтрока.НомерСтрокиРеализации = СтрокаПриемки.Товар.НомерСтрокиСопроводительногоДокумента;
		
		НоваяСтрока.КоличествоПоДокументуРеализации = СтрокаПриемки.ПоДокументу.Количество;
		НоваяСтрока.ЦенаПоДокументуРеализации = СтрокаПриемки.ПоДокументу.Цена;
		НоваяСтрока.СуммаПоДокументуРеализации = Окр(НоваяСтрока.ЦенаПоДокументуРеализации*НоваяСтрока.КоличествоПоДокументуРеализации, 2);
		Если ВРег(СтрокаПриемки.ПоДокументу.СтавкаНДС) = ВРег("НДС исчисляется налоговым агентом") Тогда
			НоваяСтрока.СтавкаНДСПоДокументуРеализации = Справочники.СтавкиНДС.БезНДС;
			ОблагаетсяНДСУПокупателя = Истина;
		Иначе
			НоваяСтрока.СтавкаНДСПоДокументуРеализации = СтрокаПриемки.ПоДокументу.СтавкаНДС;
		КонецЕсли;
		НоваяСтрока.СуммаНДСПоДокументуРеализации   = СтрокаПриемки.ПоДокументу.СуммаНДС;
		НоваяСтрока.СуммаВсегоПоДокументуРеализации = СтрокаПриемки.ПоДокументу.СуммаСНДС;
		НоваяСтрока.КомментарийПоставщика = СтрокаПриемки.ИнформацияОРасхождениях;
		
		НоваяСтрока.Количество = СтрокаПриемки.ПоФакту.Количество;
		НоваяСтрока.Цена       = СтрокаПриемки.ПоФакту.Цена;
		НоваяСтрока.Сумма      = Окр(НоваяСтрока.Цена*НоваяСтрока.Количество, 2);
		
		Если ВРег(СтрокаПриемки.ПоФакту.СтавкаНДС) = ВРег("НДС исчисляется налоговым агентом") Тогда
			НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
			ОблагаетсяНДСУПокупателя = Истина;
		Иначе
			НоваяСтрока.СтавкаНДС = СтрокаПриемки.ПоФакту.СтавкаНДС;
		КонецЕсли;
		НоваяСтрока.СуммаНДС   = СтрокаПриемки.ПоФакту.СуммаНДС;
		НоваяСтрока.СуммаВсего = СтрокаПриемки.ПоФакту.СуммаСНДС;
		
		//Если ЗначениеЗаполнено(СтрокаПриемки.ЦеновыеОтклонения.Цена) Тогда
		//	НоваяСтрока.ЦенаПоДоговору = СтрокаПриемки.ПоДокументу.Цена - СтрокаПриемки.ЦеновыеОтклонения.Цена;
		//КонецЕсли;
		//Если ЗначениеЗаполнено(СтрокаПриемки.ЦеновыеОтклонения.СуммаНДС) Тогда
		//	НоваяСтрока.СуммаНДСПоДоговору = СтрокаПриемки.ПоДокументу.СуммаНДС - СтрокаПриемки.ЦеновыеОтклонения.СуммаНДС;
		//КонецЕсли;
		//Если ЗначениеЗаполнено(СтрокаПриемки.ЦеновыеОтклонения.СуммаСНДС) Тогда
		//	НоваяСтрока.СуммаСНДСПоДоговору = СтрокаПриемки.ПоДокументу.СуммаСНДС - СтрокаПриемки.ЦеновыеОтклонения.СуммаСНДС;
		//КонецЕсли;
		
		НоваяСтрока.КоличествоБой = СтрокаПриемки.Бой.Количество;
		НоваяСтрока.КоличествоБрак = СтрокаПриемки.Брак.Количество;
		
		ДополнитьКодыМаркировки(КодыМаркировкиФакт, НоваяСтрока, СтрокаПриемки, СтрокаПриемки.ПоФакту.Маркировка, Ложь,);
		ДополнитьКодыМаркировки(КодыМаркировкиПоДокументу, НоваяСтрока, СтрокаПриемки, СтрокаПриемки.ПоДокументу.Маркировка, Ложь, Истина);
		
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из КодыМаркировкиФакт Цикл
		НоваяСтрока = ДокументОбъект.Марки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.ПоФакту = Истина;
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из КодыМаркировкиПоДокументу Цикл
		НоваяСтрока = ДокументОбъект.Марки.Найти(ТекущаяСтрока.КодМарки, "КодМарки");
		Если НоваяСтрока = Неопределено Тогда
			НоваяСтрока = ДокументОбъект.Марки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЕсли;
		НоваяСтрока.ПоДокументу = Истина;
	КонецЦикла;
	
	ЗаписатьДокумент(ДокументОбъект, ДокументУчета);
	
КонецПроцедуры

Функция ПоддержанЭлектронныйАктОРасхождениях() Экспорт
	
	ТипыДокументов = ОбменСКонтрагентами.ТипыДокументов();
	
	АктуальныеВидыЭД = Новый Соответствие;
	ПриОпределенииИспользуемыхТиповЭлектронныхДокументов(АктуальныеВидыЭД);
	
	Возврат (АктуальныеВидыЭД[ТипыДокументов.АктОРасхождениях] <> Неопределено);
	
КонецФункции

Функция НайтиАктОРасхожденияхПоОтгрузке(Знач НомерДокумента, Знач ДатаДокумента, Знач НомерИсправления, Знач Организация, Знач Контрагент)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	АктОРасхожденияхПоОтгрузке.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.АктОРасхожденияхПоОтгрузке КАК АктОРасхожденияхПоОтгрузке
	|ГДЕ
	|	АктОРасхожденияхПоОтгрузке.НомерЭД = &НомерДокумента
	|	И АктОРасхожденияхПоОтгрузке.ДатаЭД = &ДатаДокумента
	|	И АктОРасхожденияхПоОтгрузке.НомерИсправления <= &НомерИсправления
	|	И АктОРасхожденияхПоОтгрузке.Организация = &Организация
	|	И АктОРасхожденияхПоОтгрузке.Контрагент = &Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	АктОРасхожденияхПоОтгрузке.НомерИсправления УБЫВ";
	Запрос.УстановитьПараметр("НомерДокумента", НомерДокумента);
	Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(ДатаДокумента));
	Запрос.УстановитьПараметр("НомерИсправления", НомерИсправления);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РеквизитыУчастникаАктаОРасхождениях(Знач Участник)
	
	Реквизиты = Новый Структура("ИНН,КПП,Наименование");
	
	Если Участник.ТипУчастника.Свойство("ЮЛ") Тогда
		
		Реквизиты.ИНН = Участник.ТипУчастника.ЮЛ.ИНН;
		Реквизиты.КПП = Участник.ТипУчастника.ЮЛ.КПП;
		Реквизиты.Наименование = Участник.ТипУчастника.ЮЛ.НаименованиеОрганизации;
		
	ИначеЕсли Участник.ТипУчастника.Свойство("ИЛ") Тогда
		
		Реквизиты.Наименование = Участник.ТипУчастника.ИЛ.НаименованиеОрганизации;
		
	ИначеЕсли Участник.ТипУчастника.Свойство("ИП") Тогда
		
		Реквизиты.ИНН = Участник.ТипУчастника.ИП.ИНН;
		ЧастиФИО = Новый Массив;
		Если ЗначениеЗаполнено(Участник.ТипУчастника.ИП.Фамилия) Тогда
			ЧастиФИО.Добавить(Участник.ТипУчастника.ИП.Фамилия);
		КонецЕсли;
		Если ЗначениеЗаполнено(Участник.ТипУчастника.ИП.Имя) Тогда
			ЧастиФИО.Добавить(Участник.ТипУчастника.ИП.Имя);
		КонецЕсли;
		Если ЗначениеЗаполнено(Участник.ТипУчастника.ИП.Отчество) Тогда
			ЧастиФИО.Добавить(Участник.ТипУчастника.ИП.Отчество);
		КонецЕсли;
		Реквизиты.Наименование = СтрСоединить(ЧастиФИО, " ");
		
	ИначеЕсли Участник.ТипУчастника.Свойство("ФЛ") Тогда
		
		Реквизиты.ИНН = Участник.ТипУчастника.ФЛ.ИНН;
		ЧастиФИО = Новый Массив;
		Если ЗначениеЗаполнено(Участник.ТипУчастника.ФЛ.Фамилия) Тогда
			ЧастиФИО.Добавить(Участник.ТипУчастника.ФЛ.Фамилия);
		КонецЕсли;
		Если ЗначениеЗаполнено(Участник.ТипУчастника.ФЛ.Имя) Тогда
			ЧастиФИО.Добавить(Участник.ТипУчастника.ФЛ.Имя);
		КонецЕсли;
		Если ЗначениеЗаполнено(Участник.ТипУчастника.ФЛ.Отчество) Тогда
			ЧастиФИО.Добавить(Участник.ТипУчастника.ФЛ.Отчество);
		КонецЕсли;
		Реквизиты.Наименование = СтрСоединить(ЧастиФИО, " ");
		
	КонецЕсли;
	
	Возврат Реквизиты;
	
КонецФункции

Функция РеквизитыПриемщикаАктаОРасхождениях(Знач Приемщик)
	
	Реквизиты = Новый Структура("ФИО,Должность");
	Реквизиты.ФИО = Новый Структура("Фамилия,Имя,Отчество,Представление");
	
	Если Приемщик.Свойство("РаботникОрганизацииПокупателя") Тогда
		
		Работник = Приемщик.РаботникОрганизацииПокупателя;
		Реквизиты.ФИО.Фамилия = Работник.Фамилия;
		Реквизиты.ФИО.Имя = Работник.Имя;
		Реквизиты.ФИО.Отчество = Работник.Отчество;
		Реквизиты.ФИО.Представление = ПредставлениеФИО(Реквизиты.ФИО);
		Реквизиты.Должность = Работник.Должность;
		
	ИначеЕсли Приемщик.Свойство("ИноеЛицо") Тогда
		
		Если Приемщик.ИноеЛицо.Свойство("ПредставительОрганизации") Тогда
			
			Представитель = Приемщик.ИноеЛицо.ПредставительОрганизации;
			Реквизиты.ФИО.Фамилия = Представитель.Фамилия;
			Реквизиты.ФИО.Имя = Представитель.Имя;
			Реквизиты.ФИО.Отчество = Представитель.Отчество;
			Реквизиты.ФИО.Представление = ПредставлениеФИО(Реквизиты.ФИО);
			Реквизиты.Должность = Представитель.Должность;
			
		ИначеЕсли Приемщик.ИноеЛицо.Свойство("ФизическоеЛицо") Тогда
			
			ФизическоеЛицо = Приемщик.ИноеЛицо.ФизическоеЛицо;
			Реквизиты.ФИО.Фамилия = ФизическоеЛицо.Фамилия;
			Реквизиты.ФИО.Имя = ФизическоеЛицо.Имя;
			Реквизиты.ФИО.Отчество = ФизическоеЛицо.Отчество;
			Реквизиты.ФИО.Представление = ПредставлениеФИО(Реквизиты.ФИО);
			Реквизиты.Должность = ФизическоеЛицо.ОснованиеПолномочий;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Реквизиты;
	
КонецФункции

Функция НайтиАктОРасхожденияхПоОснованию(Знач ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	АктОРасхожденияхПоПоставке.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.АктОРасхожденияхПоПоставке КАК АктОРасхожденияхПоПоставке
	|ГДЕ
	|	АктОРасхожденияхПоПоставке.ДокументОснование = &ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	АктОРасхожденияхПоПоставке.НомерИсправления УБЫВ";
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Результат = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиРеализациюТоваровУслуг(Знач Организация, Знач НомерДокумента, Знач ДатаДокумента)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетФактураВыданный.ДокументОснование КАК Документ
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.Организация = &Организация
	|	И СчетФактураВыданный.Номер В (&НомерДокумента)
	|	И НАЧАЛОПЕРИОДА(СчетФактураВыданный.Дата, ДЕНЬ) = &ДатаДокумента
	|	И СчетФактураВыданный.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СчетФактураВыданный)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализацияТоваров.Ссылка КАК Документ
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Организация = &Организация
	|	И РеализацияТоваров.Номер В (&НомерДокумента)
	|	И НАЧАЛОПЕРИОДА(РеализацияТоваров.Дата, ДЕНЬ) = &ДатаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВозвратПоставщику.Ссылка КАК Документ
	|ИЗ
	|	Документ.ВозвратПоставщику КАК ВозвратПоставщику
	|ГДЕ
	|	ВозвратПоставщику.Организация = &Организация
	|	И ВозвратПоставщику.Номер В (&НомерДокумента)
	|	И НАЧАЛОПЕРИОДА(ВозвратПоставщику.Дата, ДЕНЬ) = &ДатаДокумента
	|";
	
	Запрос.УстановитьПараметр("Организация",    Организация);
	Запрос.УстановитьПараметр("ДатаДокумента",  НачалоДня(ДатаДокумента));
	Запрос.УстановитьПараметр("НомерДокумента", НомерДокумента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Документ;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

Процедура ДополнитьДанныеОбОрганизацииАдресом(Организация, ВидАдреса, ДанныеОрганизации)
	
	Адрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		Организация,
		ВидАдреса,
		ТекущаяДатаСеанса(),
		Ложь
	);
	
	Если ЗначениеЗаполнено(Адрес) Тогда
		
		Адрес = Адрес[0];
	
		Если ЗначениеЗаполнено(Адрес.ЗначенияПолей) Тогда
			
			АдресСтруктурой = РаботаСАдресами.СведенияОбАдресе(Адрес.ЗначенияПолей);
			
			Если АдресСтруктурой.Свойство("Индекс") Тогда
				ДанныеОрганизации.Индекс = АдресСтруктурой.Индекс;
			КонецЕсли;
			
			Если АдресСтруктурой.Свойство("Регион") Тогда
				ДанныеОрганизации.Регион = АдресСтруктурой.Регион;
			КонецЕсли;
			
			Если АдресСтруктурой.Свойство("КодРегиона") Тогда
				ДанныеОрганизации.КодРегиона = АдресСтруктурой.КодРегиона;
			КонецЕсли;
			
			Если АдресСтруктурой.Свойство("Район") Тогда
				ДанныеОрганизации.Район = АдресСтруктурой.Район;
			КонецЕсли;
			
			Если АдресСтруктурой.Свойство("Город") Тогда
				ДанныеОрганизации.Город = АдресСтруктурой.Город;
			КонецЕсли;
			
			Если АдресСтруктурой.Свойство("НаселенныйПункт") Тогда
				ДанныеОрганизации.НаселенныйПункт = АдресСтруктурой.НаселенныйПункт;
			КонецЕсли;
			
			Если АдресСтруктурой.Свойство("Улица") Тогда
				ДанныеОрганизации.Улица = АдресСтруктурой.Улица;
			КонецЕсли;
			
			Если АдресСтруктурой.Свойство("Здание") И ЗначениеЗаполнено(АдресСтруктурой.Здание) Тогда
				ДанныеОрганизации.Дом = АдресСтруктурой.Здание.Номер;
			КонецЕсли;
			
			Если АдресСтруктурой.Свойство("Корпуса") И ЗначениеЗаполнено(АдресСтруктурой.Корпуса) Тогда
				ДанныеОрганизации.Корпус = АдресСтруктурой.Корпуса[0].Номер;
			КонецЕсли;
			
			Если АдресСтруктурой.Свойство("Помещения") И ЗначениеЗаполнено(АдресСтруктурой.Помещения) Тогда
				ДанныеОрганизации.Квартира = АдресСтруктурой.Помещения[0].Номер;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НеобходимоУказатьЕдиницуИзмерения(Строка)
	
	Возврат Строка.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга;
	
КонецФункции

Функция ПолучитьКодЕдиницыИзмерения(Строка)
	
	Если СокрЛП(Строка.ЕдиницаИзмеренияКод) = "001" Тогда
		
		// Для услуг нужно указать пустой код, если у них есть количество
		Возврат "";
		
	Иначе
		
		// Без удаления не читаемых символов не прводиться к типу в XDTOОбъекте
		Возврат СокрЛП(Строка.ЕдиницаИзмеренияКод);
		
	КонецЕсли;
	
КонецФункции

Функция СоздатьБанковскийСчет(СтрокаОбъекта, ИмяОбъекта, ДеревоРазбора, ВладелецСчета = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СсылкаНаОбъект = Неопределено;
	НайденнаяСтрока = СтрокаОбъекта;
	
	БанковскийСчет = Справочники.БанковскиеСчета.СоздатьЭлемент();
	Если (НЕ ДеревоРазбора.Строки.Найти("Контрагенты")=Неопределено) 
		И ДеревоРазбора.Строки.Найти("Контрагенты").Строки.Количество()>0 Тогда
		СсылкаНаВладельца = ДеревоРазбора.Строки.Найти("Контрагенты").Строки[0].СсылкаНаОбъект;
	КонецЕсли;
	
	БанковскийСчет.НомерСчета 	= ПолучитьЗначениеРеквизитаДерева(НайденнаяСтрока, "НомерСчета");
		
	БанковскийСчет.ВалютаДенежныхСредств = ВалютаПоНомеруСчета(БанковскийСчет.НомерСчета);
	//
	ИндексИскомойСтроки = ПолучитьЗначениеРеквизитаДерева(НайденнаяСтрока, "Банк");
	Если ЗначениеЗаполнено(ИндексИскомойСтроки) Тогда
		БанковскийСчет.Банк 			= НайтиОбъектВДереве(ДеревоРазбора, ИндексИскомойСтроки);
	КонецЕсли;
	//
	ИндексИскомойСтроки 	= ПолучитьЗначениеРеквизитаДерева(НайденнаяСтрока, "БанкКорреспондент");
	Если ЗначениеЗаполнено(ИндексИскомойСтроки) Тогда
		БанковскийСчет.БанкДляРасчетов 	= НайтиОбъектВДереве(ДеревоРазбора, ИндексИскомойСтроки);
	КонецЕсли;
	//
	Если НЕ ЗначениеЗаполнено(СсылкаНаВладельца) Тогда
		СсылкаНаВладельца = ПолучитьЗначениеРеквизитаДерева(НайденнаяСтрока, "Владелец");	
	КонецЕсли;
	БанковскийСчет.Владелец 		= СсылкаНаВладельца;
	БанковскийСчет.ВидСчета = НСтр("ru = 'Расчетный'");
	НаименованиеСчета = Справочники.БанковскиеСчета.СформироватьНаименованиеПоУмолчанию(БанковскийСчет);
	Если ПустаяСтрока(НаименованиеСчета) Тогда
		НаименованиеСчета = "р/с "
			+ СокрЛП(БанковскийСчет.НомерСчета)
			+ " ("
			+ СокрЛП(БанковскийСчет.ВалютаДенежныхСредств.Наименование)
			+ ") в "
			+ СокрЛП(БанковскийСчет.Банк.Наименование)
			+", БИК:"
			+ СокрЛП(БанковскийСчет.Банк.Код);
	КонецЕсли;
	БанковскийСчет.Наименование 	= НаименованиеСчета;
	БанковскийСчет.ОбменДанными.Загрузка = Истина;
	Попытка
		БанковскийСчет.Записать();
	Исключение
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Создание элемента справочника %1.'", ОбщегоНазначения.КодОсновногоЯзыка()),
					ИмяОбъекта); 
		ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));		
		ВызватьИсключение;
	КонецПопытки;
	
	СсылкаНаОбъект = БанковскийСчет.Ссылка;
	НайденнаяСтрока.СсылкаНаОбъект = СсылкаНаОбъект; // запишем в дерево
	
	Возврат СсылкаНаОбъект;
	
КонецФункции

Функция НайтиОбъектВДереве(ДеревоРазбора, ИндексИскомойСтроки)
	
	СсылкаНаОбъект = Неопределено;
	
	Если ЗначениеЗаполнено(ИндексИскомойСтроки) Тогда
		НайденнаяСтрока = ДеревоРазбора.Строки.Найти(ИндексИскомойСтроки, "ИндексСтроки", Истина); // строка с объектом
	КонецЕсли;
	
	Если НайденнаяСтрока <> Неопределено Тогда
		Если ЗначениеЗаполнено(НайденнаяСтрока.СсылкаНаОбъект) Тогда // есть ссылка на объект БД
			СсылкаНаОбъект = НайденнаяСтрока.СсылкаНаОбъект;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СсылкаНаОбъект;
	
КонецФункции

Функция ВалютаПоНомеруСчета(НомерСчета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	КодВалюты = Сред(НомерСчета, 6, 3);
	Если КодВалюты = "810" Тогда
		КодВалюты = "643";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Валюты.Ссылка КАК Валюта
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Код = &КодВалюты
	|";
	Запрос.УстановитьПараметр("КодВалюты", КодВалюты);
	
	Валюта = Справочники.Валюты.ПустаяСсылка();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Валюта = Выборка.Валюта;
	КонецЕсли;
	
	Возврат Валюта;
	
КонецФункции // ПолучитьВалютуПоНомеруСчета()

// Дополняет сведения об организации данными её руководителя
// 
// Параметры:
//  СвойстваОрганизации - Структура:
//   * НаименованиеПолное - Строка
//   * ИНН - Строка
//   * КПП - Строка
//   * ОГРН - Строка
//   * ЮрФизЛицо - ПеречислениеСсылка.ЮрФизЛицо
//   * Руководитель - СправочникСсылка.ФизическиеЛица
//   * ОрганизацияСсылка - СправочникСсылка.Организации
//  ДанныеОрганизации - см. ИнтеграцияЭДО.НоваяСтруктураДанныхОрганизации
//
Процедура ЗаполнитьДанныеРуководителя(СвойстваОрганизации, ДанныеОрганизации)
	
	Если СвойстваОрганизации.ФормаСобственности = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель Тогда

		СтруктураНаименования = ТорговыйКомплексЭДОКлиентСервер.РазложитьСтрокуНаименованияОрганизации(
			СвойстваОрганизации.НаименованиеПолное, СвойстваОрганизации.ФормаСобственности);
		
		Наименование = СтрЗаменить(СтруктураНаименования.Наименование, """", "");
		
		ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(Наименование);
		
		ДанныеОрганизации.Вставить("Фамилия",  ЧастиИмени.Фамилия);
		ДанныеОрганизации.Вставить("Имя",      ЧастиИмени.Имя);
		ДанныеОрганизации.Вставить("Отчество", ЧастиИмени.Отчество);
		
		ДанныеОрганизации.Вставить("Должность", НСтр("ru = 'Индивидуальный предприниматель'"));
		
	Иначе
		
		СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(ТекущаяДатаСеанса(), Новый Структура("Организация, Объект", ДанныеОрганизации.ОрганизацияСсылка, Перечисления.ВидыОбъектовСведений.Руководитель));
		Руководитель = СтруктураСведений.Значение;
		
		Если ЗначениеЗаполнено(Руководитель) Тогда
			
			ДанныеРуководителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				Руководитель,
				"Наименование, ИНН, Должность, ДатаРождения, Фамилия, Имя, Отчество, СтраховойНомерПФР");
				
			Если ЗначениеЗаполнено(ДанныеРуководителя.Фамилия) Тогда
				ДанныеОрганизации.Вставить("Фамилия",  ДанныеРуководителя.Фамилия);
				ДанныеОрганизации.Вставить("Имя",      ДанныеРуководителя.Имя);
				ДанныеОрганизации.Вставить("Отчество", ДанныеРуководителя.Отчество);
			Иначе
				ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(ДанныеРуководителя.Наименование);
				
				ДанныеОрганизации.Вставить("Фамилия",  ЧастиИмени.Фамилия);
				ДанныеОрганизации.Вставить("Имя",      ЧастиИмени.Имя);
				ДанныеОрганизации.Вставить("Отчество", ЧастиИмени.Отчество);
			КонецЕсли;
			
			ДанныеОрганизации.Вставить("РуководительИНН", ДанныеРуководителя.ИНН);
			ДанныеОрганизации.Вставить("СНИЛС", ДанныеРуководителя.СтраховойНомерПФР); 
			//ДанныеОрганизации.Вставить("Гражданство", ДанныеРуководителя.Гражданство);
			ДанныеОрганизации.Вставить("ДатаРождения", ДанныеРуководителя.ДатаРождения);
			ДанныеОрганизации.Вставить("РуководительФизлицо", Руководитель);

			//Руководители = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Руководитель);
			//ОснованияПолномочий = ТорговыйКомплексЭДО.ОснованияПолномочийФизическихЛиц(
			//	ДанныеОрганизации.ОрганизацияСсылка, Руководители);
			
				//Основание = ОснованияПолномочий.Получить(Руководитель);
			//Если Основание <> Неопределено Тогда
			//	ДанныеОрганизации.Вставить("РуководительОснованиеПолномочий", Основание.ОснованиеПолномочий);
			ДанныеОрганизации.Вставить("Должность", СокрЛП(ДанныеРуководителя.Должность));
			//КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

// Возвращает признак того, что сведения о товарах содержат только строки со ставкой НДС "Без НДС".
// 
// Параметры:
//  ДеревоДанных - ДеревоЗначений
//  Путь - Строка
// 
// Возвращаемое значение:
//  Булево
//
Функция УПДБезНДС(ДеревоДанных, Путь = "СведенияОТоварах")
	
	СведенияОТоварах = ДеревоДанных.Строки.Найти(Путь, "ПолныйПуть", Истина);
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ПолныйПуть", Путь + ".НомерСтроки.НалоговаяСтавка");
	ПараметрыОтбора.Вставить("Значение", Справочники.СтавкиНДС.БезНДС);
	Возврат СведенияОТоварах.Строки.Количество() =
		СведенияОТоварах.Строки.НайтиСтроки(ПараметрыОтбора, Истина).Количество();
	
КонецФункции

Функция ОрганизацияПоРеквизитам(Реквизиты)
	
	РеквизитыПоиска = Новый Структура("ИНН,КПП,Наименование");
	ЗаполнитьЗначенияСвойств(РеквизитыПоиска, Реквизиты);
	
	Организация = Неопределено;
	
	Если ЗначениеЗаполнено(РеквизитыПоиска.ИНН) Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ИНН = &ИНН
		|	И &УсловиеПоКПП
		|	И НЕ Организации.ПометкаУдаления";
		Запрос.УстановитьПараметр("ИНН", РеквизитыПоиска.ИНН);
		УсловиеПоКПП = "ИСТИНА";
		Если ЗначениеЗаполнено(РеквизитыПоиска.КПП) Тогда
			Запрос.УстановитьПараметр("КПП", РеквизитыПоиска.КПП);
			УсловиеПоКПП = "Организации.КПП = &КПП";
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКПП", УсловиеПоКПП);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Организация = Выборка.Ссылка;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(РеквизитыПоиска.Наименование) Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.НаименованиеПолное = &НаименованиеПолное
		|	И НЕ Организации.ПометкаУдаления";
		Запрос.УстановитьПараметр("НаименованиеПолное", РеквизитыПоиска.Наименование);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Организация = Выборка.Ссылка;
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат Организация;
	
КонецФункции

Функция КонтрагентПоРеквизитам(Реквизиты)
	
	РеквизитыПоиска = Новый Структура("ИНН,КПП,Наименование,GLN");
	ЗаполнитьЗначенияСвойств(РеквизитыПоиска, Реквизиты);
	
	Контрагент = Неопределено;
	
	Если ЗначениеЗаполнено(РеквизитыПоиска.ИНН) Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИНН
		|	И &УсловиеПоКПП
		|	И НЕ Контрагенты.ПометкаУдаления";
		Запрос.УстановитьПараметр("ИНН", РеквизитыПоиска.ИНН);
		УсловиеПоКПП = "ИСТИНА";
		Если ЗначениеЗаполнено(РеквизитыПоиска.КПП) Тогда
			Запрос.УстановитьПараметр("КПП", РеквизитыПоиска.КПП);
			УсловиеПоКПП = "Контрагенты.КПП = &КПП";
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКПП", УсловиеПоКПП);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Контрагент = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Если (НЕ ЗначениеЗаполнено(Контрагент)) И ЗначениеЗаполнено(РеквизитыПоиска.GLN) Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.GLN = &GLN
		|	И НЕ Контрагенты.ПометкаУдаления";
		Запрос.УстановитьПараметр("GLN", РеквизитыПоиска.GLN);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Контрагент = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Если (НЕ ЗначениеЗаполнено(Контрагент)) И ЗначениеЗаполнено(РеквизитыПоиска.Наименование) Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК Строка(1000)) = &НаименованиеПолное
		|	И НЕ Контрагенты.ПометкаУдаления";
		Запрос.УстановитьПараметр("НаименованиеПолное", РеквизитыПоиска.Наименование);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Контрагент = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Контрагент;
	
КонецФункции

Функция НоваяСтрокаАдресаМОД() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("УчастникОбмена",                    Неопределено);
	Результат.Вставить("АвтоматическоеЗаполнение",          Ложь);
	Результат.Вставить("ВладелецКонтактнойИнформации",      Неопределено);
	Результат.Вставить("ВидКонтактнойИнформации",           Неопределено);
	Результат.Вставить("АдресСтрокой",                      "");
	Результат.Вставить("АдресЗначенияПолей",                "");
	Результат.Вставить("АдресЗначениеJSON",                 "");
	Результат.Вставить("КодФИАС",                           "");
	Результат.Вставить("УполномоченноеЛицоЗаПоставкуГруза", Неопределено);
	Результат.Вставить("КПП",                               "");
	
	Возврат Результат;
	
КонецФункции

// Добавляет обработку ошибок в таблицу участников УПД.
//
// Параметры:
//  ТаблицаУчастников - ТаблицаЗначений - см. ПолучитьТаблицуУчастниковУПД_5_02
//  ПутьКУчастнику - Строка
//  ВерсияФормата - Строка
//
Процедура ДобавитьОбработкуОшибокВТаблицуУчастниковУПД(ТаблицаУчастников, ПутьКУчастнику = "", ВерсияФормата = "") Экспорт
	
	ПутьКПолю = ?(ЗначениеЗаполнено(ПутьКУчастнику), ПутьКУчастнику + ".", "");
	ПоддерживаемыеФорматы = ФорматыЭДО_ФНС.ПоддерживаемыеФорматы();
	
	Для каждого СтрокаТаблицы Из ТаблицаУчастников Цикл
		
		Сведения = СтрокаТаблицы.СведенияОбУчастнике;
		Если Не ЗначениеЗаполнено(Сведения) Тогда
			Продолжить;
		КонецЕсли;
		
		Участник = ?(ЗначениеЗаполнено(ПутьКУчастнику), СтрокаТаблицы[ПутьКУчастнику], СтрокаТаблицы);
		
		Если Участник.ТипУчастника.Свойство("ЮЛ") Тогда
			
			ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
				ПутьКПолю + "ТипУчастника.ЮЛ.НаименованиеОрганизации", Сведения.Ссылка, "Объект.НаименованиеПолное");
				
			ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
				ПутьКПолю + "ТипУчастника.ЮЛ.ИНН", Сведения.Ссылка, "Объект.ИНН");
				
			ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
				ПутьКПолю + "ТипУчастника.ЮЛ.КПП", Сведения.Ссылка, "Объект.КПП");
				
		ИначеЕсли Участник.ТипУчастника.Свойство("ИЛ") Тогда
			
			ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
				ПутьКПолю + "ТипУчастника.ИЛ.НаименованиеОрганизации", Сведения.Ссылка, "Объект.НаименованиеПолное");
				
		ИначеЕсли Участник.ТипУчастника.Свойство("ИП") Тогда
			
			ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
				ПутьКПолю + "ТипУчастника.ИП.ИНН", Сведения.Ссылка, "Объект.ИНН");
			
			Если ВерсияФормата = ПоддерживаемыеФорматы.УПД_5_02.ИнформацияПродавца Тогда
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
					ПутьКПолю + "ТипУчастника.ИП.ФИО.Фамилия", Сведения.Ссылка, "Объект.НаименованиеПолное");
				
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
					ПутьКПолю + "ТипУчастника.ИП.ФИО.Имя", Сведения.Ссылка, "Объект.НаименованиеПолное");
					
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
					ПутьКПолю + "ТипУчастника.ИП.ФИО.Отчество", Сведения.Ссылка, "Объект.НаименованиеПолное");	
			Иначе	
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
					ПутьКПолю + "ТипУчастника.ИП.Фамилия", Сведения.Ссылка, "Объект.НаименованиеПолное");
					
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
					ПутьКПолю + "ТипУчастника.ИП.Имя", Сведения.Ссылка, "Объект.НаименованиеПолное");
					
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
					ПутьКПолю + "ТипУчастника.ИП.Отчество", Сведения.Ссылка, "Объект.НаименованиеПолное");
			КонецЕсли;
			
			Если ТипЗнч(Сведения.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
				
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
					ПутьКПолю + "ТипУчастника.ИП.СвидетельствоОГосРегистрации", Сведения.Ссылка, "Объект.СвидетельствоСерияНомер");
				
			КонецЕсли;
			
		ИначеЕсли Участник.ТипУчастника.Свойство("ФЛ") Тогда
			
			ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
				ПутьКПолю + "ТипУчастника.ФЛ.ИНН", Сведения.Ссылка, "Объект.ИНН");
			
			Если ВерсияФормата = ПоддерживаемыеФорматы.УПД_5_02.ИнформацияПродавца Тогда
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
					ПутьКПолю + "ТипУчастника.ФЛ.ФИО.Фамилия", Сведения.Ссылка, "Объект.НаименованиеПолное");
				
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
					ПутьКПолю + "ТипУчастника.ФЛ.ФИО.Имя", Сведения.Ссылка, "Объект.НаименованиеПолное");
					
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
					ПутьКПолю + "ТипУчастника.ФЛ.ФИО.Отчество", Сведения.Ссылка, "Объект.НаименованиеПолное");	
			Иначе	
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
					ПутьКПолю + "ТипУчастника.ФЛ.Фамилия", Сведения.Ссылка, "Объект.НаименованиеПолное");
					
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
					ПутьКПолю + "ТипУчастника.ФЛ.Имя", Сведения.Ссылка, "Объект.НаименованиеПолное");
					
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
					ПутьКПолю + "ТипУчастника.ФЛ.Отчество", Сведения.Ссылка, "Объект.НаименованиеПолное");
			КонецЕсли;
			
			Если ТипЗнч(Сведения.Ссылка) = Тип("СправочникСсылка.Организации") Тогда
				
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
					ПутьКПолю + "ТипУчастника.ФЛ.СвидетельствоОГосРегистрации", Сведения.Ссылка, "Объект.СвидетельствоСерияНомер");
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПостфиксПоляАдрес = ?(ТипЗнч(Сведения.Ссылка) = Тип("СправочникСсылка.Контрагенты"), "Контрагента", "Организации");
		
		ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
			ПутьКПолю + "Адрес.АвтоматическиЗаполняемый", Сведения.Ссылка, "КонтактнаяИнформацияПолеЮрАдрес" + ПостфиксПоляАдрес);
			
		ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
			ПутьКПолю + "КонтактныеСведения.Телефон", Сведения.Ссылка);
			
		ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
			ПутьКПолю + "КонтактныеСведения.ЭлектроннаяПочта", Сведения.Ссылка);
			
		НомерСчета = "";
		Если Сведения.Свойство("НомерСчета", НомерСчета) И ЗначениеЗаполнено(НомерСчета) Тогда
			
			Если Сведения.Свойство("БанковскийСчетСсылка") Тогда
				ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
					ПутьКПолю + "БанковскиеРеквизиты.НомерСчета", Сведения.БанковскийСчетСсылка, "Объект.НомерСчета");
			КонецЕсли;
				
			Банк = ""; БИК = ""; КоррСчет = "";
			Если Сведения.Свойство("Банк", Банк) И ЗначениеЗаполнено(Банк) Тогда
				Если Сведения.Свойство("БанкСсылка") Тогда
					ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
						ПутьКПолю + "БанковскиеРеквизиты.НаименованиеБанка", Сведения.БанкСсылка, "Объект.Наименование");
				КонецЕсли;
			КонецЕсли;
			Если Сведения.Свойство("БИК", БИК) И ЗначениеЗаполнено(БИК) Тогда
				Если Сведения.Свойство("БанкСсылка") Тогда
					ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
						ПутьКПолю + "БанковскиеРеквизиты.БИКБанка", Сведения.БанкСсылка, "Объект.Код");
				КонецЕсли;
			КонецЕсли;
			Если Сведения.Свойство("КоррСчет", КоррСчет) И ЗначениеЗаполнено(КоррСчет) Тогда
				Если Сведения.Свойство("БанкСсылка") Тогда
					ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
						ПутьКПолю + "БанковскиеРеквизиты.КорреспондентскийСчетБанка", Сведения.БанкСсылка, "Объект.КоррСчет");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		КодПоОКПО = "";
		Если Сведения.Свойство("КодПоОКПО", КодПоОКПО) И ЗначениеЗаполнено(КодПоОКПО) Тогда
			ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(СтрокаТаблицы,
				ПутьКПолю + "КодОКПО", Сведения.Ссылка, "Объект.КодПоОКПО");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПредставлениеФИО(Знач ФИО)
	
	ДанныеФИО = Новый Структура("Фамилия,Имя,Отчество");
	ЗаполнитьЗначенияСвойств(ДанныеФИО, ФИО);
	
	ЧастиФИО = Новый Массив;
	Если ЗначениеЗаполнено(ДанныеФИО.Фамилия) Тогда
		ЧастиФИО.Добавить(ДанныеФИО.Фамилия);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеФИО.Имя) Тогда
		ЧастиФИО.Добавить(ДанныеФИО.Имя);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеФИО.Отчество) Тогда
		ЧастиФИО.Добавить(ДанныеФИО.Отчество);
	КонецЕсли;
	
	Представление = СтрСоединить(ЧастиФИО, " ");
	
	Возврат Представление;
	
КонецФункции

Функция СопоставлениеНоменклатуры()
	
	Сопоставление = Новый Структура;
	Сопоставление.Вставить("Идентификатор");
	Сопоставление.Вставить("Наименование");
	Сопоставление.Вставить("Характеристика");
	Сопоставление.Вставить("ЕдиницаИзмерения");
	Сопоставление.Вставить("ЕдиницаИзмеренияКод");
	Сопоставление.Вставить("Артикул");
	Сопоставление.Вставить("СтавкаНДС");
	Сопоставление.Вставить("Штрихкод");
	Сопоставление.Вставить("НоменклатураИБ");
	Сопоставление.Вставить("ХарактеристикаИБ");
	Сопоставление.Вставить("УпаковкаИБ");
	
	Возврат Сопоставление;
	
КонецФункции

Функция ОснованиеСчетаФактуры(Знач СчетФактура)
	
	Основание = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОснованияСФ.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.СчетФактураВыданный КАК ОснованияСФ
	|ГДЕ
	|	ОснованияСФ.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОснованияСФ.ДокументОснование
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК ОснованияСФ
	|ГДЕ
	|	ОснованияСФ.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", СчетФактура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ДокументОснование) Тогда
			Основание = Выборка.ДокументОснование;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Основание;
	
КонецФункции

#Область НастройкиФормированияДокумента

Функция ЗапросКонструктораДополнительныхПолейШапкиУПД()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СчетФактураВыданный.Ссылка КАК Ссылка,
	|	СчетФактураВыданный.Номер КАК Номер,
	|	СчетФактураВыданный.Дата КАК Дата,
	|	СчетФактураВыданный.Организация КАК Организация,
	|	СчетФактураВыданный.Контрагент КАК Контрагент,
	|	СчетФактураВыданный.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	СчетФактураВыданный.Исправление КАК Исправление,
	|	СчетФактураВыданный.НомерИсправления КАК НомерИсправления,
	|	СчетФактураВыданный.ВалютаДокумента КАК Валюта,
	|	СчетФактураВыданный.Организация.ИНН КАК ИННпоставщика,
	|	СчетФактураВыданный.Организация.КПП КАК КППпоставщика,
	|	СчетФактураВыданный.Контрагент.ИНН КАК ИННпокупателя,
	|	СчетФактураВыданный.Контрагент.КПП КАК КППпокупателя,
	|	СчетФактураВыданный.Грузоотправитель КАК Грузоотправитель,
	|	СчетФактураВыданный.Грузополучатель КАК Грузополучатель,
	|	СчетФактураВыданный.ХозОперация КАК ХозОперация,
	|	СчетФактураВыданный.Выставлен КАК Выставлен,
	|	СчетФактураВыданный.ДатаВыставления КАК ДатаВыставления,
	|	СчетФактураВыданный.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	СчетФактураВыданный.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	СчетФактураВыданный.НомерИсправленияИсходногоДокумента КАК НомерИсправленияИсходногоДокумента,
	|	СчетФактураВыданный.ДатаИсправленияИсходногоДокумента КАК ДатаИсправленияИсходногоДокумента,
	|	СчетФактураВыданный.НомерИсправляемогоКорректировочногоДокумента КАК НомерИсправляемогоКорректировочногоДокумента,
	|	СчетФактураВыданный.ДатаИсправляемогоКорректировочногоДокумента КАК ДатаИсправляемогоКорректировочногоДокумента,
	|	СчетФактураВыданный.ПодразделениеКомпании КАК Подразделение,
	|	СчетФактураВыданный.Автор КАК Ответственный,
	|	СчетФактураВыданный.ДокументОснование.Менеджер КАК Менеджер,
	|	СчетФактураВыданный.КодСпособаВыставления КАК КодСпособаВыставления,
	|	СчетФактураВыданный.Комментарий КАК Комментарий,
	|	СчетФактураВыданный.СуммаДокумента КАК СуммаДокумента,
	|	СчетФактураВыданный.ТипЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	СчетФактураВыданный.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосударственногоКонтракта,
	|	СчетФактураВыданный.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЗапросКонструктораДополнительныхПолейШапкиСчетаФактуры()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураВыданный.Ссылка,
		|	СчетФактураВыданный.Номер,
		|	СчетФактураВыданный.Дата,
		|	СчетФактураВыданный.Организация КАК Организация,
		|	СчетФактураВыданный.ПодразделениеКомпании КАК Подразделение,
		|	СчетФактураВыданный.Грузоотправитель КАК Грузоотправитель,
		|	СчетФактураВыданный.Грузополучатель КАК Грузополучатель,
		|	СчетФактураВыданный.Контрагент,
		|	СчетФактураВыданный.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
		|	СчетФактураВыданный.ВалютаДокумента КАК Валюта,
		|	СчетФактураВыданный.ДокументОснование КАК ДокументОснование,
		|	СчетФактураВыданный.ХозОперация КАК ХозОперация,
		|	СчетФактураВыданный.Исправление КАК Исправление,
		|	СчетФактураВыданный.Выставлен,
		|	СчетФактураВыданный.ДатаВыставления,
		|	СчетФактураВыданный.ДатаИсправленияИсходногоДокумента,
		|	СчетФактураВыданный.ДатаИсправляемогоКорректировочногоДокумента,
		|	СчетФактураВыданный.ДатаИсходногоДокумента,
		|	СчетФактураВыданный.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосударственногоКонтракта,
		|	СчетФактураВыданный.Комментарий,
		|	СчетФактураВыданный.НомерИсправления,
		|	СчетФактураВыданный.НомерИсправленияИсходногоДокумента,
		|	СчетФактураВыданный.НомерИсправляемогоКорректировочногоДокумента,
		|	СчетФактураВыданный.НомерИсходногоДокумента,
		|	СчетФактураВыданный.СуммаДокумента,
		|	СчетФактураВыданный.КодСпособаВыставления КАК КодСпособаВыставления,
		|	СчетФактураВыданный.ТипЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		|	СчетФактураВыданный.Автор КАК Ответственный
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЗапросКонструктораДополнительныхПолейШапкиРеализации()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваров.Ссылка КАК Ссылка,
	|	РеализацияТоваров.Номер КАК Номер,
	|	РеализацияТоваров.Дата КАК Дата,
	|	РеализацияТоваров.АдресДоставки КАК АдресДоставки,
	//|	РеализацияТоваров.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	//|	РеализацияТоваров.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	//|	РеализацияТоваров.БанковскийСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
	//|	РеализацияТоваров.БанковскийСчетГрузополучателя КАК БанковскийСчетГрузополучателя,
	|	РеализацияТоваров.ВалютаДокумента КАК Валюта,
	|	РеализацияТоваров.КурсДокумента КАК Курс,
	|	РеализацияТоваров.Грузоотправитель КАК Грузоотправитель,
	|	РеализацияТоваров.Грузополучатель КАК Грузополучатель,
	|	РеализацияТоваров.Дата КАК ДатаРаспоряжения,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя,
	|	РеализацияТоваров.Организация КАК Организация,
	|	РеализацияТоваров.Контрагент КАК Контрагент,
	|	РеализацияТоваров.Менеджер КАК Менеджер,
	|	РеализацияТоваров.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваров.ПодразделениеКомпании КАК Подразделение,
	|	NULL КАК Сделка,
	|	РеализацияТоваров.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	РеализацияТоваров.ДоговорВзаиморасчетов.ДатаНачала КАК ДатаДоговора,
	|	РеализацияТоваров.ДоговорВзаиморасчетов.НомерДоговора КАК НомерДоговора,
	|	РеализацияТоваров.СкладКомпании КАК СкладКомпании,
	|	РеализацияТоваров.ХозОперация КАК ХозОперация,
	|	РеализацияТоваров.ТипЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	//|	РеализацияТоваров.Отпустил КАК Отпустил,
	//|	РеализацияТоваров.ОтпустилДолжность КАК ОтпустилДолжность,
	//|	РеализацияТоваров.Основание КАК Основание,
	|	РеализацияТоваров.ДокументОснование КАК ДокументОснование,
	|	РеализацияТоваров.ДокументОснование.Номер КАК ДокументОснованиеНомер,
	|	РеализацияТоваров.ДокументОснование.Дата КАК ДокументОснованиеДата,
	|	РеализацияТоваров.Автор КАК Автор,
	//|	РеализацияТоваров.КонтактноеЛицо КАК КонтактноеЛицо,
	//|	РеализацияТоваров.Руководитель КАК Руководитель,
	//|	РеализацияТоваров.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	//|	РеализацияТоваров.ОснованиеДата КАК ОснованиеДата,
	//|	РеализацияТоваров.ОснованиеНомер КАК ОснованиеНомер,
	|	РеализацияТоваров.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосударственногоКонтракта
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка КАК Ссылка,
	|	КорректировкаРеализации.Номер КАК Номер,
	|	КорректировкаРеализации.Дата КАК Дата,
	|	КорректировкаРеализации.ДокументОснование.АдресДоставки КАК АдресДоставки,
	|	КорректировкаРеализации.ВалютаДокумента КАК Валюта,
	|	КорректировкаРеализации.КурсДокумента КАК Курс,
	|	КорректировкаРеализации.ДокументОснование.Грузоотправитель КАК Грузоотправитель,
	|	КорректировкаРеализации.ДокументОснование.Грузополучатель КАК Грузополучатель,
	|	КорректировкаРеализации.Дата КАК ДатаРаспоряжения,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя,
	|	КорректировкаРеализации.Организация КАК Организация,
	|	КорректировкаРеализации.Контрагент КАК Контрагент,
	|	КорректировкаРеализации.Менеджер КАК Менеджер,
	|	КорректировкаРеализации.СуммаДокумента КАК СуммаДокумента,
	|	КорректировкаРеализации.ПодразделениеКомпании КАК Подразделение,
	|	NULL КАК Сделка,
	|	КорректировкаРеализации.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	КорректировкаРеализации.ДоговорВзаиморасчетов.ДатаНачала КАК ДатаДоговора,
	|	КорректировкаРеализации.ДоговорВзаиморасчетов.НомерДоговора КАК НомерДоговора,
	|	КорректировкаРеализации.СкладКомпании КАК СкладКомпании,
	|	КорректировкаРеализации.ХозОперация КАК ХозОперация,
	|	КорректировкаРеализации.ТипЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	КорректировкаРеализации.ДокументОснование КАК ДокументОснование,
	|	КорректировкаРеализации.ДокументОснование.Номер КАК ДокументОснованиеНомер,
	|	КорректировкаРеализации.ДокументОснование.Дата КАК ДокументОснованиеДата,
	|	КорректировкаРеализации.Автор КАК Автор,
	|	КорректировкаРеализации.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосударственногоКонтракта
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|	КорректировкаРеализации.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЗапросКонструктораДополнительныхПолейШапкиАкта()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АктВыполненныхРабот.Ссылка КАК Ссылка,
		|	АктВыполненныхРабот.Номер КАК Номер,
		|	АктВыполненныхРабот.Дата КАК Дата,
		|	АктВыполненныхРабот.АктПоЗаказам КАК АктПоЗаказам,
		|	АктВыполненныхРабот.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
		|	АктВыполненныхРабот.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
		|	АктВыполненныхРабот.Валюта КАК Валюта,
		|	АктВыполненныхРабот.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	АктВыполненныхРабот.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		|	АктВыполненныхРабот.ДополнительнаяИнформацияШапки КАК ДополнительнаяИнформацияШапки,
		|	АктВыполненныхРабот.ЗаказКлиента КАК ЗаказКлиента,
		|	АктВыполненныхРабот.Касса КАК Касса,
		|	АктВыполненныхРабот.Комментарий КАК Комментарий,
		|	АктВыполненныхРабот.Контрагент КАК Контрагент,
		|	АктВыполненныхРабот.Менеджер КАК Менеджер,
		|	АктВыполненныхРабот.НалогообложениеНДС КАК НалогообложениеНДС,
		|	АктВыполненныхРабот.Организация КАК Организация,
		|	АктВыполненныхРабот.Партнер КАК Партнер,
		|	АктВыполненныхРабот.Подразделение КАК Подразделение,
		|	АктВыполненныхРабот.Сделка КАК Сделка,
		|	АктВыполненныхРабот.СкидкиРассчитаны КАК СкидкиРассчитаны,
		|	АктВыполненныхРабот.Согласован КАК Согласован,
		|	АктВыполненныхРабот.Соглашение КАК Соглашение,
		|	АктВыполненныхРабот.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
		|	АктВыполненныхРабот.СуммаДокумента КАК СуммаДокумента,
		|	АктВыполненныхРабот.ФормаОплаты КАК ФормаОплаты,
		|	АктВыполненныхРабот.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		|	АктВыполненныхРабот.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
		|	АктВыполненныхРабот.КартаЛояльности КАК КартаЛояльности,
		|	АктВыполненныхРабот.Договор КАК Договор,
		|	АктВыполненныхРабот.Автор КАК Автор,
		|	АктВыполненныхРабот.КонтактноеЛицо КАК КонтактноеЛицо,
		|	АктВыполненныхРабот.Руководитель КАК Руководитель,
		|	АктВыполненныхРабот.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
		|	АктВыполненныхРабот.ПорядокРасчетов КАК ПорядокРасчетов,
		|	АктВыполненныхРабот.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
		|	АктВыполненныхРабот.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	АктВыполненныхРабот.КурсЧислитель КАК КурсЧислитель,
		|	АктВыполненныхРабот.КурсЗнаменатель КАК КурсЗнаменатель,
		|	АктВыполненныхРабот.ОплатаВВалюте КАК ОплатаВВалюте,
		|	АктВыполненныхРабот.Основание КАК Основание,
		|	АктВыполненныхРабот.ОснованиеДата КАК ОснованиеДата,
		|	АктВыполненныхРабот.ОснованиеНомер КАК ОснованиеНомер
		|ИЗ
		|	Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
		|ГДЕ
		|	АктВыполненныхРабот.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	КорректировкаРеализации.Ссылка,
		|	КорректировкаРеализации.Номер,
		|	КорректировкаРеализации.Дата,
		|	КорректировкаРеализации.ПродажаПоЗаказам,
		|	КорректировкаРеализации.БанковскийСчетОрганизации,
		|	КорректировкаРеализации.БанковскийСчетКонтрагента,
		|	КорректировкаРеализации.Валюта,
		|	КорректировкаРеализации.ВалютаВзаиморасчетов,
		|	NULL,
		|	NULL,		
		|	NULL,		
		|	NULL,		
		|	КорректировкаРеализации.Комментарий,
		|	КорректировкаРеализации.Контрагент,
		|	КорректировкаРеализации.Менеджер,
		|	КорректировкаРеализации.НалогообложениеНДС,
		|	КорректировкаРеализации.Организация,
		|	КорректировкаРеализации.Партнер,
		|	КорректировкаРеализации.Подразделение,
		|	КорректировкаРеализации.Сделка,
		|	NULL,
		|	КорректировкаРеализации.Согласован,
		|	КорректировкаРеализации.Соглашение,
		|	КорректировкаРеализации.СуммаВзаиморасчетов,
		|	КорректировкаРеализации.СуммаДокумента,	
		|	КорректировкаРеализации.ФормаОплаты,
		|	КорректировкаРеализации.ЦенаВключаетНДС,
		|	NULL,
		|	NULL,
		|	КорректировкаРеализации.Договор,
		|	NULL,
		|	NULL,
		|	КорректировкаРеализации.Руководитель,
		|	КорректировкаРеализации.ГлавныйБухгалтер,
		|	КорректировкаРеализации.ПорядокРасчетов,
		|	NULL,
		|	КорректировкаРеализации.НаправлениеДеятельности,
		|	КорректировкаРеализации.КурсЧислитель,
		|	КорректировкаРеализации.КурсЗнаменатель,
		|	NULL,
		|	КорректировкаРеализации.Основание,
		|	КорректировкаРеализации.ОснованиеДата,
		|	КорректировкаРеализации.ОснованиеНомер	
		|ИЗ
		|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
		|ГДЕ
		|	КорректировкаРеализации.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЗапросКонструктораДополнительныхПолейШапкиКорректировкиРеализации()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КорректировкаРеализации.Ссылка КАК Ссылка,
	|	КорректировкаРеализации.Номер КАК Номер,
	|	КорректировкаРеализации.Дата КАК Дата,
	|	КорректировкаРеализации.ДокументОснование.АдресДоставки КАК АдресДоставки,
	//|	КорректировкаРеализации.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	//|	КорректировкаРеализации.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	//|	КорректировкаРеализации.БанковскийСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
	//|	КорректировкаРеализации.БанковскийСчетГрузополучателя КАК БанковскийСчетГрузополучателя,
	|	КорректировкаРеализации.ВалютаДокумента КАК Валюта,
	|	КорректировкаРеализации.КурсДокумента КАК Курс,
	|	КорректировкаРеализации.ДокументОснование.Грузоотправитель КАК Грузоотправитель,
	|	КорректировкаРеализации.ДокументОснование.Грузополучатель КАК Грузополучатель,
	|	КорректировкаРеализации.НомерИсправления КАК НомерИсправления,
	|	КорректировкаРеализации.Дата КАК ДатаРаспоряжения,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя,
	|	КорректировкаРеализации.Организация КАК Организация,
	|	КорректировкаРеализации.Контрагент КАК Контрагент,
	|	КорректировкаРеализации.Менеджер КАК Менеджер,
	|	КорректировкаРеализации.СуммаДокумента КАК СуммаДокумента,
	|	КорректировкаРеализации.ПодразделениеКомпании КАК Подразделение,
	|	NULL КАК Сделка,
	|	КорректировкаРеализации.ДоговорВзаиморасчетов КАК ДоговорКонтрагента,
	|	КорректировкаРеализации.ДоговорВзаиморасчетов.ДатаНачала КАК ДатаДоговора,
	|	КорректировкаРеализации.ДоговорВзаиморасчетов.НомерДоговора КАК НомерДоговора,
	|	КорректировкаРеализации.СкладКомпании КАК СкладКомпании,
	|	КорректировкаРеализации.ХозОперация КАК ХозОперация,
	|	КорректировкаРеализации.ТипЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	//|	КорректировкаРеализации.Отпустил КАК Отпустил,
	//|	КорректировкаРеализации.ОтпустилДолжность КАК ОтпустилДолжность,
	//|	КорректировкаРеализации.Основание КАК Основание,
	|	КорректировкаРеализации.ДокументОснование КАК ДокументОснование,
	|	КорректировкаРеализации.ДокументОснование.Номер КАК ДокументОснованиеНомер,
	|	КорректировкаРеализации.ДокументОснование.Дата КАК ДокументОснованиеДата,
	|	КорректировкаРеализации.Автор КАК Автор,
	//|	КорректировкаРеализации.КонтактноеЛицо КАК КонтактноеЛицо,
	//|	КорректировкаРеализации.Руководитель КАК Руководитель,
	//|	КорректировкаРеализации.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	//|	КорректировкаРеализации.ОснованиеДата КАК ОснованиеДата,
	//|	КорректировкаРеализации.ОснованиеНомер КАК ОснованиеНомер,
	|	КорректировкаРеализации.ИдентификаторГосударственногоКонтракта КАК ИдентификаторГосударственногоКонтракта
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|	КорректировкаРеализации.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СервисShare

// Заполняет присоединенные файлы к загруженному учетному документу через сервис 1С:Share.
// Возможна загрузка исходного файла электронного документа и его дополнительных файлов.
//
// Параметры:
//  СсылкаНаДокумент - ОпределяемыйТип.ОснованияЭлектронныхДокументовЭДО - ссылка на объект учета.
//  ДополнительныеДанные - Структура - данные для заполнения электронного документа:
//    * ПараметрыЭлектронногоДокумента - см. ОтражениеВУчетеЭДО.НовыеПараметрыЭлектронногоДокумента
//    * ПараметрыСпособаОбмена - см. ОтражениеВУчетеЭДО.НовыеПараметрыСпособаОбмена
//
Процедура ЗаписатьПрисоединенныеФайлыКДокументуЧерезСервисShare(СсылкаНаДокумент, Знач ДополнительныеДанные)
	
	ПараметрыСпособаОбмена = ДополнительныеДанные.ПараметрыСпособаОбмена;
	
	Если ПараметрыСпособаОбмена.СпособОбмена <> ИнтеграцияShare.СпособОбмена() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЭлектронногоДокумента = ДополнительныеДанные.ПараметрыЭлектронногоДокумента;
	
	ДанныеОсновногоФайла = Неопределено;
	Если Не ПараметрыЭлектронногоДокумента.Свойство("ДанныеОсновногоФайла", ДанныеОсновногоФайла) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Добавление", Метаданные.Справочники.Файлы)
		Или (УправлениеДоступом.ОграничиватьДоступНаУровнеЗаписей() 
		И Не УправлениеДоступом.ИзменениеРазрешено(Справочники.ПапкиФайлов.Шаблоны)) Тогда
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Недостаточно прав доступа для добавления файлов. Не удалось добавить файлы к документу %1'",
			ОбщегоНазначения.КодОсновногоЯзыка()), СсылкаНаДокумент);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Добавление присоединенных файлов.'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Предупреждение, СсылкаНаДокумент.Метаданные(), , ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеОсновногоФайла.ДвоичныеДанные) = Тип("ДвоичныеДанные")
		И ЗначениеЗаполнено(ДанныеОсновногоФайла.ИмяФайла) Тогда
		
		ДвоичныеДанныеФайла = ДанныеОсновногоФайла.ДвоичныеДанные;
		ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
		ПараметрыФайла.ВладелецФайлов              = СсылкаНаДокумент;
		ПараметрыФайла.ВремяИзмененияУниверсальное = ТекущаяУниверсальнаяДата();
		ПараметрыФайла.Автор                       = Пользователи.АвторизованныйПользователь();
		
		ДанныеФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ДанныеОсновногоФайла.ИмяФайла);
		ПараметрыФайла.ИмяБезРасширения   = ДанныеФайла.ИмяБезРасширения;
		ПараметрыФайла.РасширениеБезТочки = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(
			ДанныеФайла.Расширение);

		АдресДанныхДокумента = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла);
		РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресДанныхДокумента);
		
	КонецЕсли;
	
	Если ПараметрыСпособаОбмена.ДанныеСпособаОбмена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСпособаОбмена = ПараметрыСпособаОбмена.ДанныеСпособаОбмена;
	
	Для Каждого СтрокаФайл Из ДанныеСпособаОбмена.ДополнительныеФайлыДокумента Цикл
		ДобавитьФайлКДокументу(СсылкаНаДокумент, СтрокаФайл.ДвоичныеДанныеФайла, СтрокаФайл.ИмяБезРасширения,
			СтрокаФайл.РасширениеБезТочки);
	КонецЦикла;

	Для Каждого СтрокаФайл Из ДанныеСпособаОбмена.ФайлыВизуализации Цикл
		ДобавитьФайлКДокументу(СсылкаНаДокумент, СтрокаФайл.ДвоичныеДанныеФайла, СтрокаФайл.ИмяБезРасширения,
			СтрокаФайл.Расширение);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  СсылкаНаДокумент - ОпределяемыйТип.ВладелецПрисоединенныхФайлов
//  ДвоичныеДанныеФайла - ДвоичныеДанные
//  ИмяБезРасширения - Строка
//  РасширениеБезТочки - Строка
Процедура ДобавитьФайлКДокументу(Знач СсылкаНаДокумент, Знач ДвоичныеДанныеФайла, Знач ИмяБезРасширения, Знач РасширениеБезТочки)
	
	ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыФайла.ВладелецФайлов              = СсылкаНаДокумент;
	ПараметрыФайла.ВремяИзмененияУниверсальное = ТекущаяУниверсальнаяДата();
	ПараметрыФайла.Автор                       = Пользователи.АвторизованныйПользователь();
	ПараметрыФайла.ИмяБезРасширения            = ИмяБезРасширения;
	ПараметрыФайла.РасширениеБезТочки          = РасширениеБезТочки;

	АдресДанныхДокумента = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла);
	РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресДанныхДокумента);
	
КонецПроцедуры

#КонецОбласти

#Область ДокументПредприятия

Процедура ЗаполнитьСведенияСтороныДокументаДляДокументаПредприятия(ДанныеСтороны, Знач Данные, Знач КонструкторЭД,
	Знач СсылкаНаСторону, Знач ТипСтороны)
	
	//СведенияСтороны = Неопределено;
	//Если ТипСтороны = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
	//	СведенияСтороны = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	//	ЭлектронноеВзаимодействиеКЭДО.ПолучитьДанныеЮрФизЛица(СсылкаНаСторону, СведенияСтороны);
	//	
	//	ДанныеСтороны.ИдентификационныеСведения = КонструкторЭД.НовыеИдентификационныеСведенияИП();
	//	ДанныеСтороны.ИдентификационныеСведения.Наименование = СведенияСтороны.ПолноеНаименование;
	//	ДанныеСтороны.ИдентификационныеСведения.ИНН          = СведенияСтороны.ИНН;
	//	
	//	КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(ДанныеСтороны.ИдентификационныеСведения.ИНН, "ИНН", "Объект.ИНН", ,
	//		СсылкаНаСторону);
	//	
	//ИначеЕсли ТипСтороны = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
	//	СведенияСтороны = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	//	ЭлектронноеВзаимодействиеКЭДО.ПолучитьДанныеЮрФизЛица(СсылкаНаСторону, СведенияСтороны);
	//
	//	ДанныеСтороны.ИдентификационныеСведения = КонструкторЭД.НовыеИдентификационныеСведенияЮрЛица();
	//	ДанныеСтороны.ИдентификационныеСведения.Наименование = СведенияСтороны.ПолноеНаименование;
	//	ДанныеСтороны.ИдентификационныеСведения.ИНН          = СведенияСтороны.ИНН;
	//	ДанныеСтороны.ИдентификационныеСведения.КПП          = СведенияСтороны.КПП;
	//	
	//	КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(ДанныеСтороны.ИдентификационныеСведения, "Наименование",
	//		"Объект.НаименованиеПолное", , СсылкаНаСторону);
	//	КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(ДанныеСтороны.ИдентификационныеСведения, "ИНН",
	//		"Объект.ИНН", , СсылкаНаСторону);
	//	КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(ДанныеСтороны.ИдентификационныеСведения, "КПП",
	//		"Объект.КПП", , СсылкаНаСторону);
	//	
	//ИначеЕсли ТипСтороны = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
	//	
	//	СведенияСтороны = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	//	ЭлектронноеВзаимодействиеКЭДО.ПолучитьДанныеФизЛица(СсылкаНаСторону, СведенияСтороны);
	//	
	//	ДанныеСтороны.ИдентификационныеСведения = КонструкторЭД.ИдентификационныеСведенияФизЛица();
	//	ДанныеСтороны.ИдентификационныеСведения.Наименование          = СведенияСтороны.ПолноеНаименование;
	//	ДанныеСтороны.ИдентификационныеСведения.СНИЛС                 = СведенияСтороны.СтраховойНомерПФР;
	//	ДанныеСтороны.ИдентификационныеСведения.ИНН                   = СведенияСтороны.ИНН;
	//	ДанныеСтороны.ИдентификационныеСведения.Фамилия               = СведенияСтороны.Фамилия;
	//	ДанныеСтороны.ИдентификационныеСведения.Имя                   = СведенияСтороны.Имя;
	//	ДанныеСтороны.ИдентификационныеСведения.Отчество              = СведенияСтороны.Отчество;
	//	ДанныеСтороны.ИдентификационныеСведения.Телефон               = СведенияСтороны.Телефоны;
	//	ДанныеСтороны.ИдентификационныеСведения.АдресЭлектроннойПочты = СведенияСтороны.ЭлектроннаяПочта;

	//	КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(ДанныеСтороны.ИдентификационныеСведения, "Наименование",
	//		"Объект.НаименованиеПолное", , СсылкаНаСторону);
	//	
	//	КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(ДанныеСтороны.ИдентификационныеСведения, "ИНН",
	//		"Объект.ИНН", , СсылкаНаСторону);
	//	
	//ИначеЕсли ТипСтороны = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
	//	
	//	Реквизиты = "НаименованиеПолное, ИдентификаторЮридическогоЛица";
	//
	//	СведенияСтороны = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаСторону, Реквизиты);
	//	
	//	ДанныеСтороны.ИдентификационныеСведения = КонструкторЭД.НовыеИдентификационныеСведенияИностранногоЛица();
	//	ДанныеСтороны.ИдентификационныеСведения.Наименование = СведенияСтороны.НаименованиеПолное;
	//	ДанныеСтороны.ИдентификационныеСведения.TIN          = СведенияСтороны.ИдентификаторЮридическогоЛица;
	//	ДанныеСтороны.ИдентификационныеСведения.КодСтраны    = КонструкторЭД.ЗаполнитьКодСтраныИностранногоАдреса(
	//		Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента, СсылкаНаСторону, Данные.ДатаДоговора);
	//	
	//	КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(ДанныеСтороны.ИдентификационныеСведения, "TIN",
	//		"Объект.ИдентификаторЮридическогоЛица", , СсылкаНаСторону);
	//	КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(ДанныеСтороны.ИдентификационныеСведения, "КодСтраны", , ,
	//		Данные.Контрагент);
	//	КонструкторЭД.ОбработчикОшибок.УстановитьСвязь(ДанныеСтороны.ИдентификационныеСведения, "НаименованиеПолное",
	//		"Объект.НаименованиеПолное", , СсылкаНаСторону);

	//КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыПоискаПоДаннымДокументаПредприятия(Данные)
	
	ПараметрыПоиска = Новый Структура("ИНН,КПП,Наименование");
	
	ТипыСторон = Обработки.ФорматДокументПредприятия.ТипыСторонДоговора();
	
	Если ТипЗнч(Данные) = ТипыСторон.Предприниматель Тогда
		ПараметрыПоиска.ИНН          = Данные.ИНН;
	ИначеЕсли ТипЗнч(Данные) = ТипыСторон.Организация Тогда
		ПараметрыПоиска.ИНН          = Данные.ИНН;
		ПараметрыПоиска.КПП          = Данные.КПП;
	ИначеЕсли ТипЗнч(Данные) = ТипыСторон.ФизическоеЛицо Тогда
		ПараметрыПоиска.ИНН          = Данные.ИНН;
		ПараметрыПоиска.Наименование = СтрШаблон("%1 %2%3", Данные.Фамилия, Данные.Имя,
			?(ПустаяСтрока(Данные.Отчество), "", СтрШаблон(" %1", Данные.Отчество)));
	ИначеЕсли ТипЗнч(Данные) = ТипыСторон.ИностранноеЛицо Тогда
		ПараметрыПоиска.ИНН          = Данные.TIN;
		ПараметрыПоиска.Наименование = Данные.Наименование;
		ПараметрыПоиска.КПП          = Данные.КПП;
	КонецЕсли;
	
	Возврат ПараметрыПоиска;
	
КонецФункции

#КонецОбласти

#КонецОбласти