// Модуль формы записи регистра "Сведения о сотрудниках"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Объединяет группы аналогов, если создается аналог, который уже входит в другую группу.
//
// Параметры:
//  ГлавнаяГруппа        - Строка - Идентификатор главной группы.
//  ПрисоединяемаяГруппа - Строка - Идентификатор присоединяемой группы.
//
&НаСервере
Процедура ОбъединитьГруппы(ГлавнаяГруппа, ПрисоединяемаяГруппа) Экспорт
	
	// Получим элементы основной группы
	НаборЗаписейГлавнойГруппы=РегистрыСведений.ГруппыАналогов.СоздатьНаборЗаписей();
	НаборЗаписейГлавнойГруппы.Отбор.ИдентификаторГруппы.Значение=ГлавнаяГруппа;
	НаборЗаписейГлавнойГруппы.Отбор.ИдентификаторГруппы.Использование=Истина;
	НаборЗаписейГлавнойГруппы.Прочитать();
	ТаблицаНаборЗаписейГлавнойГруппы = НаборЗаписейГлавнойГруппы.Выгрузить();
	
	Приоритет = 0;
	Для Каждого ТекущаяСтрока Из ТаблицаНаборЗаписейГлавнойГруппы Цикл
		Если ТекущаяСтрока.Приоритет > Приоритет Тогда
			Приоритет = ТекущаяСтрока.Приоритет;
		КонецЕсли;
	КонецЦикла;
	
	Приоритет = Приоритет + 1;
	
	// Создадим набор записей присоединяемой
	НаборЗаписейПрисоединяемойГруппы=РегистрыСведений.ГруппыАналогов.СоздатьНаборЗаписей();
	НаборЗаписейПрисоединяемойГруппы.Отбор.ИдентификаторГруппы.Значение=ПрисоединяемаяГруппа;
	НаборЗаписейПрисоединяемойГруппы.Отбор.ИдентификаторГруппы.Использование=Истина;
	НаборЗаписейПрисоединяемойГруппы.Прочитать();
	
	// Будем просматривать присоединяемую группу и переливать ее в главную
	Пока НаборЗаписейПрисоединяемойГруппы.Количество()>0 Цикл
		
		СтрокаПрисоединяемойГруппы = НаборЗаписейПрисоединяемойГруппы[0];
		
		Если ТаблицаНаборЗаписейГлавнойГруппы.Найти(СтрокаПрисоединяемойГруппы.Номенклатура,"Номенклатура")=Неопределено И НЕ Запись.Номенклатура = СтрокаПрисоединяемойГруппы.Номенклатура Тогда
			НоваяЗапись=НаборЗаписейГлавнойГруппы.Добавить();
			НоваяЗапись.ИдентификаторГруппы = ГлавнаяГруппа;
			НоваяЗапись.Номенклатура        = СтрокаПрисоединяемойГруппы.Номенклатура;
			НоваяЗапись.Приоритет           = СтрокаПрисоединяемойГруппы.Приоритет + Приоритет;
			НоваяЗапись.Коэффициент         = СтрокаПрисоединяемойГруппы.Коэффициент;
		КонецЕсли;
		
		НаборЗаписейПрисоединяемойГруппы.Удалить(НаборЗаписейПрисоединяемойГруппы[0]);
	КонецЦикла;
	
	// Запишем наборы записей групп
	НаборЗаписейПрисоединяемойГруппы.Записать();
	НаборЗаписейГлавнойГруппы.Записать();
	
КонецПроцедуры // ОбъединитьГруппы()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаОповещенияОбъединитьГруппы(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Обработка ответа пользователя на вопрос объединения групп
	Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
		
		// Выберем группы, где находится записываемый аналог
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ГруппыАналогов.ИдентификаторГруппы
		|ИЗ
		|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
		|ГДЕ
		|	ГруппыАналогов.ИдентификаторГруппы <> &ИдентификаторГруппы
		|	И ГруппыАналогов.Номенклатура = &Номенклатура";
		
		ПараметрыЗапроса = Новый Структура;
		ПараметрыЗапроса.Вставить("Номенклатура",        Запись.Номенклатура);
		ПараметрыЗапроса.Вставить("ИдентификаторГруппы", Запись.ИдентификаторГруппы);
		
		РезультатЗапроса = УправлениеДиалогомВызовСервера.ВыполнитьПроизвольныйЗапрос(ТекстЗапроса,, ПараметрыЗапроса);
		
		// Объединяем каждую группу с текущей группой
		Для Каждого ПрисоединяемаяГруппа Из РезультатЗапроса Цикл
		
			ОбъединитьГруппы(Запись.ИдентификаторГруппы, ПрисоединяемаяГруппа.ИдентификаторГруппы);
		
		КонецЦикла;
		
		// Запишем объект вручную с дополнительными параметром для обработки исключительной ситуации
		// в стандартной процедуре ПередЗаписью.
		Записать(Новый Структура("ЗаписатьОбъединенныйАналог",Истина));
		Закрыть();
		
	Иначе
		
		// Закроем форму редактирования элемента без учета изменений
		Модифицированность = Ложь;
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияОбъединитьГруппы()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомРегистраСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомРегистраСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов,Истина);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомРегистраСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Подключаемый обработчик, вызывающий общую процедуру для обработки команды панели действий.
// 
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомРегистраКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Запись, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомРегистраСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомРегистраКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомРегистраКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомРегистраСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Дальнейшие операции выполняются только для новых объектов
	Если НЕ Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		Если Запись.Приоритет = 0 Тогда
			Элементы.Приоритет.Доступность = Ложь;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Запись.Приоритет = 1;
	Если ЗначениеЗаполнено(Запись.ИдентификаторГруппы) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИдентификаторГруппы", Запись.ИдентификаторГруппы);
		Запрос.Текст = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ГруппыАналогов.Приоритет КАК Приоритет
		|ИЗ
		|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
		|ГДЕ
		|	ГруппыАналогов.ИдентификаторГруппы = &ИдентификаторГруппы
		|УПОРЯДОЧИТЬ ПО
		|	ГруппыАналогов.Приоритет УБЫВ";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Запись.Приоритет = Выборка.Приоритет + 1;
		КонецЕсли;
	Иначе
		Запись.ИдентификаторГруппы = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Запись.Коэффициент           = 1;
	Запись.КоличествоЗаменяемого = 1;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомРегистраКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомРегистраКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомРегистраКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомРегистраСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();

КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомРегистраКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);

КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия,  ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомРегистраСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомРегистраКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - СправочникОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомРегистраСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего перед записью объекта.
//
// Параметры:
//  Отказ           - Булево    - Признак отказа от создания формы.
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Проверим находится ли номенклатура в другой группе
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ГруппыАналогов.ИдентификаторГруппы
	|ИЗ
	|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	|ГДЕ
	|	ГруппыАналогов.ИдентификаторГруппы <> &ИдентификаторГруппы
	|	И ГруппыАналогов.Номенклатура = &Номенклатура";
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Номенклатура",        Запись.Номенклатура);
	ПараметрыЗапроса.Вставить("ИдентификаторГруппы", Запись.ИдентификаторГруппы);
	
	РезультатЗапроса = УправлениеДиалогомВызовСервера.ВыполнитьПроизвольныйЗапрос(ТекстЗапроса,, ПараметрыЗапроса);
	
	// Если номенклатура находится в другой группе, зададим вопрос пользователю об объединении групп.
	Если РезультатЗапроса.Количество() > 0 И (НЕ ПараметрыЗаписи.Свойство("ЗаписатьОбъединенныйАналог") ИЛИ ПараметрыЗаписи.Свойство("ЗаписатьОбъединенныйАналог") И НЕ ПараметрыЗаписи.ЗаписатьОбъединенныйАналог) Тогда
		
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияОбъединитьГруппы", ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещенияВопрос, НСтр("ru = 'Номенклатура '") + " " + Запись.Номенклатура 
			+ " " + НСтр("ru = 'состоит в другой группе.'") + Символы.ПС 
			+ " " + НСтр("ru = 'Группы будут объединены. Продолжить?'"), РежимДиалогаВопрос.ДаНет,,, НСтр("ru = 'Объединение групп'"));
		
		// Отказ от проведения, так как управление передается в обработчик оповещения.
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево           - Признак отказа от создания формы.
//  ТекущийОбъект   - СправочникОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура        - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомРегистраСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - СправочникОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура        - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомРегистраСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	//// Проверим аналог на значения ГлавныйПоГруппе и ГлавныйПоПроизводителю
	//Если Запись.ГлавныйПоГруппе ИЛИ Запись.ГлавныйПоПроизводителю Тогда
	//	
	//	// Выберем аналоги из группы с установленными значениями ГлавныйПоГруппе и ГлавныйПоПроизводителю.
	//	ТекстЗапроса = 
	//	"ВЫБРАТЬ
	//	|	ГруппыАналогов.ГлавныйПоГруппе,
	//	|	ГруппыАналогов.ГлавныйПоПроизводителю,
	//	|	ГруппыАналогов.ИдентификаторГруппы,
	//	|	ГруппыАналогов.Артикул,
	//	|	ГруппыАналогов.Производитель
	//	|ИЗ
	//	|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	//	|ГДЕ
	//	|	ГруппыАналогов.ИдентификаторГруппы = &ИдентификаторГруппы
	//	|	И ГруппыАналогов.Артикул <> &Артикул
	//	|	И (ГруппыАналогов.ГлавныйПоГруппе = ИСТИНА
	//	|			ИЛИ ГруппыАналогов.ГлавныйПоПроизводителю = ИСТИНА)";
	//	
	//	Запрос = Новый Запрос(ТекстЗапроса);
	//	Запрос.УстановитьПараметр("Артикул", Запись.Артикул);
	//	Запрос.УстановитьПараметр("ИдентификаторГруппы", Запись.ИдентификаторГруппы);
	//	ВыборкаВсехАналоговГруппы = Запрос.Выполнить().Выбрать();
	//	
	//	Пока ВыборкаВсехАналоговГруппы.Следующий() Цикл
	//		
	//		// Прочитаем аналог из группы
	//		Аналог = РегистрыСведений.ГруппыАналогов.СоздатьМенеджерЗаписи();
	//		Аналог.Артикул = ВыборкаВсехАналоговГруппы.Артикул;
	//		Аналог.ИдентификаторГруппы = ВыборкаВсехАналоговГруппы.ИдентификаторГруппы;
	//		Аналог.Производитель = ВыборкаВсехАналоговГруппы.Производитель;
	//		Аналог.Прочитать();
	//		
	//		// Переопределяем значение аналога
	//		Если Аналог.ГлавныйПоГруппе И Запись.ГлавныйПоГруппе Тогда
	//			
	//			Аналог.ГлавныйПоГруппе = Ложь;
	//			
	//		КонецЕсли;
	//		
	//		// Переопределяем значение аналога
	//		Если Аналог.ГлавныйПоПроизводителю И Запись.ГлавныйПоПроизводителю Тогда
	//			
	//			Аналог.ГлавныйПоПроизводителю = Ложь;
	//			
	//		КонецЕсли;
	//		
	//		// Записываем аналог
	//		Аналог.Записать();
	//		
	//	КонецЦикла;
	//КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомРегистраКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомРегистраСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомРегистраСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура КоличествоЗаменяемогоПриИзменении(Элемент)
	
	Если Запись.КоличествоЗаменяемого = 0 Тогда
		Запись.Коэффициент = 0;
	Иначе
		Запись.Коэффициент = 1/Запись.КоличествоЗаменяемого;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентПриИзменении(Элемент)
	
	Если Запись.Коэффициент = 0 Тогда
		Запись.КоличествоЗаменяемого = 0;
	Иначе
		Запись.КоличествоЗаменяемого = 1/Запись.Коэффициент;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИдентификаторГруппыПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Запись.ИдентификаторГруппы) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИдентификаторГруппы", Запись.ИдентификаторГруппы);
		Запрос.Текст = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ГруппыАналогов.Приоритет КАК Приоритет
		|ИЗ
		|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
		|ГДЕ
		|	ГруппыАналогов.ИдентификаторГруппы = &ИдентификаторГруппы
		|УПОРЯДОЧИТЬ ПО
		|	ГруппыАналогов.Приоритет УБЫВ";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Запись.Приоритет = Выборка.Приоритет + 1;
		Иначе
			Запись.Приоритет = 1;
		КонецЕсли;
	Иначе
		Запись.Приоритет = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторГруппыПриИзменении(Элемент)
	ИдентификаторГруппыПриИзмененииНаСервере();
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
