
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура НачатьДобавлениеНоменклатуры()
	
	Элементы.ДлительнаяОперацияПояснение.Заголовок = "Создание номенклатуры на сервере...";
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения     = Истина;
	ПараметрыОжидания.ВыводитьОкноОжидания           = Ложь;
	ПараметрыОжидания.ВыводитьСообщения              = Истина;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ОбработатьПрогресс", ЭтотОбъект);
	
	Задание = ЗаданиеПередатьЗаписиВФайлНаСервере();
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
	Задание,
	Новый ОписаниеОповещения("ОбработатьЗавершениеЗадания", ЭтотОбъект),
	ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуОтборов()
	
	Если ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		ТаблицаОтборов = ПолучитьИзВременногоХранилища(АдресХранилища);
	Иначе
		Запрос = Новый Запрос;
		ОтборыСКД   = НастройкиСписка.ПолучитьНастройки().Отбор;
		ТекстОтбора = ОтчетыПлатформаСервер.КомпоновщикПолучитьТекстОтбора(ОтборыСКД.Элементы, ОтборыСКД.ДоступныеПоляОтбора, "ПрайсЛистыКонтрагентов", Запрос.Параметры);
		
		Запрос.УстановитьПараметр("ПрайсЛистКонтрагента", ПрайсЛистКонтрагента);
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрайсЛистыКонтрагентов.ПрайсЛист,
		|	ПрайсЛистыКонтрагентов.Артикул,
		|	ПрайсЛистыКонтрагентов.Производитель,
		|	ПрайсЛистыКонтрагентов.Штрихкод
		|ИЗ
		|	РегистрСведений.ПрайсЛистыКонтрагентов КАК ПрайсЛистыКонтрагентов
		|ГДЕ
		|	ПрайсЛистыКонтрагентов.ПрайсЛист = &ПрайсЛистКонтрагента
		|	" + ?(ЗначениеЗаполнено(ТекстОтбора), " И 
		|	" + ТекстОтбора, "") + "
		|";
		
		НомерСтроки = 1;
		ТаблицаОтборов = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Возврат ТаблицаОтборов;
	
КонецФункции

&НаСервере
Функция ЗаданиеПередатьЗаписиВФайлНаСервере()
	
	Элементы.СтраницыСтатусФоновогоЗадания.Видимость = Истина;
	Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеВыполняется;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("ГруппаНоменклатуры",      ГруппаНоменклатуры);
	ПараметрыДанных.Вставить("ТипНоменклатуры",         ТипНоменклатуры);
	ПараметрыДанных.Вставить("ВидНоменклатуры",         ВидНоменклатуры);
	ПараметрыДанных.Вставить("СтранаПроизводитель",     СтранаПроизводитель);
	ПараметрыДанных.Вставить("ЗаполнятьСтавкуНДС",      ЗаполнятьСтавкуНДС);
	ПараметрыДанных.Вставить("СтавкаНДС",               СтавкаНДС);
	ПараметрыДанных.Вставить("БазоваяЕдиницаИзмерения", БазоваяЕдиницаИзмерения);
	ПараметрыДанных.Вставить("ВалютаУчета",             ВалютаУчета);
	ПараметрыДанных.Вставить("ПроцентНаценки",          ПроцентНаценки);
	ПараметрыДанных.Вставить("ОчищатьСсылки",           ОчищатьСсылки);
	ПараметрыДанных.Вставить("СоздаватьНовые",          СоздаватьНовые);
	ПараметрыДанных.Вставить("ПерезаписыватьРеквизиты", ПерезаписыватьРеквизиты);
	ПараметрыДанных.Вставить("НеЗаполнятьАртикул",      НеЗаполнятьАртикул);
	ПараметрыДанных.Вставить("ГенерироватьШтрихкоды",   ГенерироватьШтрихкоды);
	
	ВходныеПараметры = Новый Структура;
	ВходныеПараметры.Вставить("ПрайсЛистКонтрагента",  ПрайсЛистКонтрагента);
	ВходныеПараметры.Вставить("ТаблицаОтборов",        ПолучитьТаблицуОтборов());
	ВходныеПараметры.Вставить("ПараметрыДанных",       ПараметрыДанных);
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(
	"РегистрыСведений.ПрайсЛистыКонтрагентов.ДобавитьНоменклатуруНаСервере",
	ВходныеПараметры,
	ПараметрыВыполнения);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьПрогресс(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат.Прогресс) = Тип("Структура") Тогда
		Элементы.ДлительнаяОперацияПояснение.Заголовок = "Создание номенклатуры на сервере..." + Формат(Цел(Результат.Прогресс.Процент), "ЧН=0") + "%";
		//ОтобразитьРезультатыОтправки(Результат.Прогресс.ДополнительныеПараметры);
	КонецЕсли;
	
	Если ТипЗнч(Результат.Сообщения) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Сообщение Из Результат.Сообщения Цикл
			Если Сообщение.Текст = "" Тогда
				Продолжить;
			КонецЕсли;
			ВывестиСообщение(Сообщение.Текст);
		КонецЦикла;
		Результат.Сообщения = Новый ФиксированныйМассив(Новый Массив);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗавершениеЗадания(Результат, Параметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		
		//РезультатыОтправки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		//РезультатыОтправки.Записать(ИмяФайла);
		//ОтобразитьРезультатыОтправки(РезультатыОтправки);
		Элементы.СтраницыСтатусФоновогоЗадания.Видимость = Ложь;
		ПоказатьОповещениеПользователя(НСтр("ru = 'Создание номенклатуры завершено'"));
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеЗавершеноСОшибкой;
		Элементы.ПодробноеПредставлениеОшибки.Заголовок = Результат.ПодробноеПредставлениеОшибки;
		
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	
	Если СоздаватьНовые Тогда
		// Проверим корректность заполнения формы
		Если (НЕ ПроверитьЗаполнение()) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	НачатьДобавлениеНоменклатуры();
	
	//Закрыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ


// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Получим и установим перечень обязательный к заполнению реквизитов
	Если ПроверяемыеРеквизиты.Найти("ТипНоменклатуры")= Неопределено Тогда
		ПроверяемыеРеквизиты.Добавить("ТипНоменклатуры");
	КонецЕсли;
	
	Если ПроверяемыеРеквизиты.Найти("ВидНоменклатуры")= Неопределено Тогда
		ПроверяемыеРеквизиты.Добавить("ВидНоменклатуры");
	КонецЕсли;
	
	Если ПроверяемыеРеквизиты.Найти("БазоваяЕдиницаИзмерения")= Неопределено Тогда
		ПроверяемыеРеквизиты.Добавить("БазоваяЕдиницаИзмерения");
	КонецЕсли;
	
	Если ПроверяемыеРеквизиты.Найти("СтранаПроисхождения")= Неопределено Тогда
		ПроверяемыеРеквизиты.Добавить("СтранаПроисхождения");
	КонецЕсли;
	
	Если ЗаполнятьСтавкуНДС Тогда
		Если ПроверяемыеРеквизиты.Найти("СтавкаНДС")= Неопределено Тогда
			ПроверяемыеРеквизиты.Добавить("СтавкаНДС");
		КонецЕсли;
	Иначе
		ИндексЭлемента = ПроверяемыеРеквизиты.Найти("СтавкаНДС");
		Если НЕ ИндексЭлемента = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АдресХранилища",       АдресХранилища);
	Параметры.Свойство("ПрайсЛистКонтрагента", ПрайсЛистКонтрагента);
	
	Если ТипЗнч(Параметры.НастройкиСписка) = Тип("НастройкиКомпоновкиДанных") Тогда
		НастройкиСписка.ЗагрузитьНастройки(Параметры.НастройкиСписка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПрайсЛистКонтрагента) Тогда
		Если ЗначениеЗаполнено(ПрайсЛистКонтрагента.НоменклатурнаяГруппа) Тогда
			ГруппаНоменклатуры = ПрайсЛистКонтрагента.НоменклатурнаяГруппа;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПрайсЛистКонтрагента.ПроцентНаценки) Тогда
			ГруппаНоменклатуры = ПрайсЛистКонтрагента.ПроцентНаценки;
		КонецЕсли;
	КонецЕсли;
	
	ВалютаУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеВыполняется;
	Элементы.СтраницыСтатусФоновогоЗадания.Видимость       = Ложь;
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
