// Модуль менеджера документа "Отгрузка товаров".

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект		 - ДанныеФормыСтруктура	 - Объект, для которого выполняется обработка события.
//  Расширенные	 - Булево				 - Признак получения расширенных сведений об итогах операци.
// 
// Возвращаемое значение:
//  Структура - Данные с итогами показателей
//
Функция РассчитатьИтогиОперации(Объект, Расширенные = Ложь) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	
	// Производим установку полученных значений в итоговые показатели объекта
	Если НЕ Расширенные Тогда
		Возврат ИтогиОперации;
	КонецЕсли;
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

#Область ПараметрыОбработкиРеквизитовОбъекта

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ВидТоварооборота");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("Статус");
	ОбязательныеРеквизиты.Добавить("ДатаПервичногоДокумента");
	ОбязательныеРеквизиты.Добавить("НомерПервичногоДокумента");
	ОбязательныеРеквизиты.Добавить("Контрагент");
	ОбязательныеРеквизиты.Добавить("ДатаОтгрузкиТоваров");
	ОбязательныеРеквизиты.Добавить("ОсобенностьУчета");
	
	Если Объект.ВыводИзОборота Тогда
		ОбязательныеРеквизиты.Добавить("ДатаВыводаИзОборота");
		ОбязательныеРеквизиты.Добавить("ПричинаВыводаИзОборота");
	КонецЕсли;
	
	Если Объект.ПричинаВыводаИзОборота = Перечисления.ПричиныОтгрузкиТоваров.ПриобретениеГосПредприятием Тогда
		ОбязательныеРеквизиты.Добавить("ИдентификаторГосКонтракта");
	КонецЕсли;
	
	ОбязательныеРеквизиты.Добавить("Товары.Номенклатура");
	ОбязательныеРеквизиты.Добавить("Товары.Количество");
	ОбязательныеРеквизиты.Добавить("Товары.ЕдиницаИзмерения");
	ОбязательныеРеквизиты.Добавить("Товары.Коэффициент");
	
	ОбязательныеРеквизиты.Добавить("КодыМаркировки.КодМаркировки");
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов.
//  Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеРеквизиты = Новый Структура();
	
	УникальныеТовары = Новый Массив();
	УникальныеТовары.Добавить("Номенклатура");
	УникальныеТовары.Добавить("ЕдиницаИзмерения");
	УникальныеТовары.Добавить("ХарактеристикаНоменклатуры");
	
	УникальныеРеквизиты.Вставить("Товары", УникальныеТовары);
	
	УникальныеКодыМаркировки = Новый Массив;
	УникальныеКодыМаркировки.Добавить("КодМаркировки");
	УникальныеРеквизиты.Вставить("КодыМаркировки", УникальныеКодыМаркировки);
	
	Возврат УникальныеРеквизиты;
	
КонецФункции

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	КонтролируемыеРеквизиты = Новый Структура();
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиИзмененияДанныхОбъекта

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
// 
// Возвращаемое значение:
//  Структура - Параметры действия.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	ПараметрыДействия.Вставить("ТребуетсяУстановкаЦен", Ложь);
	
	Возврат ПараметрыДействия;
	
КонецФункции

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Контрагент".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КонтрагентПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.КонтрагентПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // КонтрагентПриИзменении()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыНоменклатураПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Проверим а не набор ли у нас...
	Если Строка.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор Тогда
		ОбработкаТабличнойЧастиТовары.РазложитьНаборНаСтроки(Объект, Строка, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Производим корректировку и заполнение связанных аналитик в строке
	ОбработкаТабличнойЧастиТовары.ОбработатьИзменениеНоменклатура(Объект, Строка, ПараметрыДействия);
	
	// Заполняем служебные реквизиты строки
	ОбработкаТабличнойЧастиТовары.ЗаполнитьСлужебныйРеквизитКодыМаркировки(Объект, Строка, ПараметрыДействия);
	
	Если ПустаяСтрока(Строка.ИдентификаторТовара) Тогда
		Строка.ИдентификаторТовара = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Характеристика номенклатуры" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Производим корректировку и заполнение связанных аналитик в строке
	ОбработкаТабличнойЧастиТовары.ОбработатьИзменениеХарактеристикаНоменклатуры(Объект, Строка, ПараметрыДействия);
	
	// Обновим индикацию кодов маркировки
	ОбработкаТабличнойЧастиТовары.ЗаполнитьСлужебныйРеквизитКодыМаркировки(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Количество" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыКоличествоПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	Строка.Сумма = Строка.Цена * Строка.Количество;
	Строка.СуммаНДС = Окр(Строка.Сумма * Строка.СтавкаНДС.Ставка / 100, 2);
	
	// Обновим индикацию кодов маркировки
	ОбработкаТабличнойЧастиТовары.ЗаполнитьСлужебныйРеквизитКодыМаркировки(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Цена" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыЦенаПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Вызываем общий обработчик события
	Строка.Сумма = Строка.Цена * Строка.Количество;
	Строка.СуммаНДС = Окр(Строка.Сумма * Строка.СтавкаНДС.Ставка / (100 + Строка.СтавкаНДС.Ставка), 2);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Сумма" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСуммаПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Вызываем общий обработчик события
	Строка.Цена = Окр(Строка.Сумма / ?(Строка.Количество = 0, 1, Строка.Количество), 2);
	Строка.СуммаНДС = Окр(Строка.Сумма * Строка.СтавкаНДС.Ставка / (100 + Строка.СтавкаНДС.Ставка), 2);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСтавкаНДСПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Вызываем общий обработчик события
	Строка.СуммаНДС = Окр(Строка.Сумма * Строка.СтавкаНДС.Ставка / (100 + Строка.СтавкаНДС.Ставка), 2);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Сумма НДС" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСуммаНДСПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЗаполненияОбъекта

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	// Стандартная обработка
	
КонецПроцедуры

// Производит формирование структуры с доступностью команд заполнения объекта
//
// Параметры:
//  Объект	 - ДанныеФормыСтруктура	 - Объект, для которого выполняется обработка события.
// 
// Возвращаемое значение:
//  Соответствие - Настройка доступности и видимости команд заполнения
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	ДоступностьКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ДоступностьКоманд;
	
КонецФункции

#КонецОбласти

#Область Печать

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Стандартная обработка
	
КонецПроцедуры

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект	 - ДанныеФормыСтруктура	 - Объект, для которого выполняется обработка события.
// 
// Возвращаемое значение:
//  Соответствие - сформированные параметры доступности команд печати.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	ПараметрыКоманд = Новый Соответствие;
	Возврат ПараметрыКоманд;
	
КонецФункции

// Обработчик события формирования печатной формы.
//
// Параметры:
//  МассивОбъектов - Массив - список объектов, для которых была выполнена процедура Печать;
//  ПараметрыПечати - Структура - произвольные параметры, переданные при вызове команды печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - содержит табличные документы и дополнительную информацию;
//  ОбъектыПечати - СписокЗначений - соответствие между объектами и именами областей в табличных документах, где
//                                   значение - Объект, представление - имя области с объектом в табличных документах;
//  ПараметрыВывода - Структура - параметры, связанные с выводом табличных документов:
//   * ПараметрыОтправки - Структура - информация для заполнения письма при отправке печатной формы электронной почтой.
//                                     Содержит следующие поля:
//    ** Получатель;
//    ** Тема,
//    ** Текст.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

// Возвращает все документы, в которых присутствуют коды маркировки.
//
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - выборка результата запроса, содержащая требуемые документы.
//
Функция ДокументыСКодамиМаркировки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтгрузкаТоваровКодовМаркировкиКодыМаркировки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтгрузкаТоваровКодовМаркировки.КодыМаркировки КАК ОтгрузкаТоваровКодовМаркировкиКодыМаркировки
	|ГДЕ
	|	ОтгрузкаТоваровКодовМаркировкиКодыМаркировки.КодМаркировки <> """"";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Процедура зачистки криптохвостов кодов маркировки.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект.ОтгрузкаТоваровКодовМаркировки - документ, для которого выполняется действие.
//
Процедура ОтрезатьКриптохвосты(ДокументОбъект) Экспорт
	
	Для Каждого СтрокаТоваров Из ДокументОбъект.КодыМаркировки Цикл
		СтрокаТоваров.КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(СтрокаТоваров.КодМаркировки);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция АннулироватьОтгрузкуТоваров(Объект, Сообщение)
	
	ТекстСообщения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ОтгрузкаТоваровКодовМаркировки.Организация.ИНН КАК ОрганизацияИНН,
	               |	ОтгрузкаТоваровКодовМаркировки.ИдентификаторДокумента КАК ИдентификаторДокумента
	               |ИЗ
	               |	Документ.ОтгрузкаТоваровКодовМаркировки КАК ОтгрузкаТоваровКодовМаркировки
	               |ГДЕ
	               |	ОтгрузкаТоваровКодовМаркировки.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Если НЕ ЗначениеЗаполнено(Выборка.ОрганизацияИНН) Тогда
		Сообщение = НСтр("ru = 'У организации не указан ИНН'");
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Выборка.ИдентификаторДокумента) Тогда
		Сообщение = НСтр("ru = 'Нет информации в документе о номере документа в Честном знаке'");
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстСообщения.Вставить("participant_inn", СокрЛП(Выборка.ОрганизацияИНН));
	ТекстСообщения.Вставить("shipment_number", Выборка.ИдентификаторДокумента);
	
	Возврат ТекстСообщения;
	
КонецФункции

// Получение данных документа для отгрузки кодов маркировки
//
// Параметры:
//  Объект		 - ДокументСсылка.СписаниеКодовМаркировки - Документ, для которого получаем данные
// 
// Возвращаемое значение:
//  Структура - Данные документа в формате для отправки запроса
//
Функция ДанныеОтгрузки(Объект, Сообщение) Экспорт
	
	ТекстСообщения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтгрузкаТоваровКодовМаркировки.Организация.ИНН КАК ОрганизацияИНН,
	|	ОтгрузкаТоваровКодовМаркировки.ДатаОтгрузкиТоваров КАК ДатаОтгрузкиТоваров,
	|	ОтгрузкаТоваровКодовМаркировки.ВидТоварооборота КАК ВидТоварооборота,
	|	ПРЕДСТАВЛЕНИЕ(ОтгрузкаТоваровКодовМаркировки.Контрагент) КАК ПредставлениеКонтрагента,
	|	ОтгрузкаТоваровКодовМаркировки.Контрагент.ИНН КАК КонтрагентИНН,
	|	ОтгрузкаТоваровКодовМаркировки.ОтгрузкаНеучастнику КАК ОтгрузкаНеучастнику,
	|	ОтгрузкаТоваровКодовМаркировки.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта,
	|	ОтгрузкаТоваровКодовМаркировки.ДатаВыводаИзОборота КАК ДатаВыводаИзОборота,
	|	ОтгрузкаТоваровКодовМаркировки.ПричинаВыводаИзОборота КАК ПричинаВыводаИзОборота,
	|	ОтгрузкаТоваровКодовМаркировки.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	ОтгрузкаТоваровКодовМаркировки.НомерПервичногоДокумента КАК НомерПервичногоДокумента
	|ИЗ
	|	Документ.ОтгрузкаТоваровКодовМаркировки КАК ОтгрузкаТоваровКодовМаркировки
	|ГДЕ
	|	ОтгрузкаТоваровКодовМаркировки.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтгрузкаТоваровКодовМаркировкиТовары.ИдентификаторТовара КАК ИдентификаторТовара,
	|	ОтгрузкаТоваровКодовМаркировкиТовары.Цена КАК Цена,
	|	ОтгрузкаТоваровКодовМаркировкиТовары.СуммаНДС КАК СуммаНДС,
	|	ОтгрузкаТоваровКодовМаркировкиТовары.Номенклатура КАК Номенклатура,
	|	ОтгрузкаТоваровКодовМаркировкиТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ОтгрузкаТоваровКодовМаркировкиТовары.Количество КАК Количество
	|ПОМЕСТИТЬ
	|	ТЧПервичныеДокументы
	|ИЗ
	|	Документ.ОтгрузкаТоваровКодовМаркировки.Товары КАК ОтгрузкаТоваровКодовМаркировкиТовары
	|ГДЕ
	|	ОтгрузкаТоваровКодовМаркировкиТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтгрузкаТоваровКодовМаркировкиКодыМаркировки.ИдентификаторТовара КАК ИдентификаторТовара,
	|	ОтгрузкаТоваровКодовМаркировкиКодыМаркировки.КодМаркировки КАК КодМаркировки,
	|	ОтгрузкаТоваровКодовМаркировкиКодыМаркировки.Количество КАК КоличествоПозицийВМарке
	|ПОМЕСТИТЬ ТаблицаКодовМаркировок
	|ИЗ
	|	Документ.ОтгрузкаТоваровКодовМаркировки.КодыМаркировки КАК ОтгрузкаТоваровКодовМаркировкиКодыМаркировки
	|ГДЕ
	|	ОтгрузкаТоваровКодовМаркировкиКодыМаркировки.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКодовМаркировок.КодМаркировки КАК КодМаркировки,
	|	ТаблицаКодовМаркировок.КоличествоПозицийВМарке КАК КоличествоПозицийВМарке,
	|	ТЧПервичныеДокументы.Цена КАК Цена,
	|	ТЧПервичныеДокументы.СуммаНДС КАК СуммаНДС,
	|	ТЧПервичныеДокументы.Номенклатура КАК Номенклатура,
	|	ТЧПервичныеДокументы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТЧПервичныеДокументы.Количество КАК Количество
	|ИЗ
	|	ТЧПервичныеДокументы КАК ТЧПервичныеДокументы
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаКодовМаркировок КАК ТаблицаКодовМаркировок
	|ПО
	|	ТЧПервичныеДокументы.ИдентификаторТовара = ТаблицаКодовМаркировок.ИдентификаторТовара";
	
	Запрос.УстановитьПараметр("Ссылка", Объект);
	
	ПакетЗапроса = Запрос.ВыполнитьПакет();
	ШапкаДокумента = ПакетЗапроса[0].Выбрать();
	ШапкаДокумента.Следующий();
	
	СтрокаТоваров = ПакетЗапроса[3].Выбрать();
	
	Если НЕ ЗначениеЗаполнено(ШапкаДокумента.КонтрагентИНН) Тогда
		Сообщение = НСтр("ru = 'У контрагента не указан ИНН'");
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстСообщения.Вставить("sender_inn", СокрЛП(ШапкаДокумента.ОрганизацияИНН));
	ТекстСообщения.Вставить("document_date", Формат(ШапкаДокумента.ДатаПервичногоДокумента, "ДФ=dd.MM.yyyy"));
	ТекстСообщения.Вставить("document_num", СокрЛП(ШапкаДокумента.НомерПервичногоДокумента));
	ТекстСообщения.Вставить("receiver", ШапкаДокумента.ПредставлениеКонтрагента);
	ТекстСообщения.Вставить("receiver_inn", СокрЛП(ШапкаДокумента.КонтрагентИНН));
	ТекстСообщения.Вставить("to_not_participant", ШапкаДокумента.ОтгрузкаНеучастнику);
	ТекстСообщения.Вставить("request_type", "SHIPMENT");
	ТекстСообщения.Вставить("transfer_date", Формат(ШапкаДокумента.ДатаОтгрузкиТоваров, "ДФ=dd.MM.yyyy"));
	ТекстСообщения.Вставить("turnover_type",
		ОбменССистемойМаркировкиСервер.ВидТоварооборота(ШапкаДокумента.ВидТоварооборота));
	
	ВидОперации = "";
	Если ЗначениеЗаполнено(ШапкаДокумента.ДатаВыводаИзОборота) Тогда
		ВидОперации = ОбменССистемойМаркировкиСервер.ПричинаОтгрузкиТовара(ШапкаДокумента.ПричинаВыводаИзОборота);
	КонецЕсли;
	
	ТекстСообщения.Вставить("withdrawal_date", Формат(ШапкаДокумента.ДатаВыводаИзОборота, "ДФ=dd.MM.yyyy"));
	ТекстСообщения.Вставить("withdrawal_type", ВидОперации);
	ТекстСообщения.Вставить("st_contract_id", 
		?(ШапкаДокумента.ПричинаВыводаИзОборота = Перечисления.ПричиныОтгрузкиТоваров.ПриобретениеГосПредприятием,
			ШапкаДокумента.ИдентификаторГосКонтракта,
			""));
	
	ТекстСообщения.Вставить("products", Новый Массив);
	
	// Заполним табличную часть
	Пока СтрокаТоваров.Следующий() Цикл
		
		СтруктураМаркировки = Неопределено;
		
		ТекстОшибки = "";
		КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(
			СтрокаТоваров.КодМаркировки,
			ТекстОшибки,
			Ложь, СтруктураМаркировки);
		
		// Проверим, что это КМ
		Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаКМ = Новый Структура;
		Если СтруктураМаркировки.ВидУпаковки = Перечисления.ВидыУпаковокМаркировки.Логистическая Тогда
			СтрокаКМ.Вставить("uitu_code", КодМаркировки);
		Иначе
			СтрокаКМ.Вставить("uit_code", КодМаркировки);
		КонецЕсли;
		
		КоличествоПозицийВМарке = Макс(СтрокаТоваров.КоличествоПозицийВМарке, 1);
		
		// Представление товара
		ПредставлениеТовара = Новый Массив;
		ПредставлениеТовара.Добавить(СокрЛП(СтрокаТоваров.Номенклатура));
		
		Если ЗначениеЗаполнено(СтрокаТоваров.ХарактеристикаНоменклатуры) Тогда
			ПредставлениеТовара.Добавить(СокрЛП(СтрокаТоваров.ХарактеристикаНоменклатуры));
		КонецЕсли;
		
		СтрокаКМ.Вставить("product_description", СтрСоединить(ПредставлениеТовара, ", "));
		СтрокаКМ.Вставить("product_cost",        СтрЗаменить(Строка(СтрокаТоваров.Цена * КоличествоПозицийВМарке * 100), Символы.НПП, ""));
		СтрокаКМ.Вставить("product_tax",
			СтрЗаменить(Строка(Окр(СтрокаТоваров.СуммаНДС / СтрокаТоваров.Количество, 2) * КоличествоПозицийВМарке * 100), Символы.НПП, ""));
		
		ТекстСообщения.products.Добавить(СтрокаКМ);
		
	КонецЦикла;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ЗапросДокумента(Объект, ПараметрыОбмена, Сообщение) Экспорт
	
	ИмяДействия = ПолучитьЗначениеПараметраСтруктуры(ПараметрыОбмена, "Действие", "");
	
	Если ИмяДействия = "АннулироватьОтгрузкуТоваров" Тогда
		СтруктураСообщения = АннулироватьОтгрузкуТоваров(Объект, Сообщение);
	Иначе
		СтруктураСообщения = ДанныеОтгрузки(Объект, Сообщение);
	КонецЕсли;
	
	Возврат СтруктураСообщения;
	
КонецФункции

Процедура ОбработатьРезультатОтвета(ДокументСсылка, ПараметрыКоманды) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОтгрузкаТоваровКодовМаркировки.ХозОперация КАК ХозОперация,
	|	ОтгрузкаТоваровКодовМаркировки.Организация КАК Организация,
	|	ОтгрузкаТоваровКодовМаркировки.ПричинаВыводаИзОборота КАК ПричинаВыводаИзОборота,
	|	ОтгрузкаТоваровКодовМаркировки.ДатаВыводаИзОборота КАК ДатаВыводаИзОборота,
	|	ОтгрузкаТоваровКодовМаркировки.Статус КАК Статус
	|ИЗ
	|	Документ.ОтгрузкаТоваровКодовМаркировки КАК ОтгрузкаТоваровКодовМаркировки
	|ГДЕ
	|	ОтгрузкаТоваровКодовМаркировки.Ссылка = &Ссылка
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ХозОперация = Выборка.ХозОперация;
	Организация = Выборка.Организация;
	Статус      = Выборка.Статус;
	ПричинаВыводаИзОборота = Выборка.ПричинаВыводаИзОборота;
	ДатаВыводаИзОборота    = Выборка.ДатаВыводаИзОборота;
	
	КодТовараВФорматеDataMatrixGS1 = Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеDataMatrixGS1;
	
	АннулированаОтгрузка = (Статус = Перечисления.СтатусыДокументовМаркировки.АннулированаОтгрузка);
	Если (Статус = Перечисления.СтатусыДокументовМаркировки.Выполнен
		ИЛИ АннулированаОтгрузка) Тогда
		
		ТаблицаМаркировки = РегистрыСведений.СостоянияКодовМаркировки.ТаблицаКодовМаркировки(ДокументСсылка);
		ТаблицаМаркировки.Колонки.Добавить("GTIN", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
		ТаблицаМаркировки.Колонки.Добавить("СерийныйНомер", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
		
		// Разберем маркировку на состовляющие для поиска
		Для Каждого ТекущийКодМаркировки Из ТаблицаМаркировки Цикл
			
			Если НЕ ЗначениеЗаполнено(ТекущийКодМаркировки.КодМаркировки) Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураМаркировки =
				МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ТекущийКодМаркировки.КодМаркировки);
			
			Если СтруктураМаркировки.ТипИдентификатораТовара <> КодТовараВФорматеDataMatrixGS1 Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущийКодМаркировки.GTIN = СтруктураМаркировки.GTIN;
			ТекущийКодМаркировки.СерийныйНомер = СтруктураМаркировки.СерийныйНомер;
			
		КонецЦикла;
		
		ТекущиеСтатусыМаркировки =
			РегистрыСведений.СостоянияКодовМаркировки.ТекущиеСтатусыКодовМаркировки(ТаблицаМаркировки);
		
		ВыведенныеТовары = Новый Массив;
		СостоянияВОбороте = Перечисления.СостоянияКодовМаркировки.СостоянияВводаВОборотМаркировки();
		
		Для Каждого ТекущаяСтрока Из ТекущиеСтатусыМаркировки Цикл
			Если (НЕ АннулированаОтгрузка И СостоянияВОбороте.Найти(ТекущаяСтрока.Состояние) = Неопределено)
				ИЛИ (АннулированаОтгрузка И СостоянияВОбороте.Найти(ТекущаяСтрока.Состояние) <> Неопределено) Тогда
				ВыведенныеТовары.Добавить(ТекущаяСтрока);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекущаяСтрока Из ВыведенныеТовары Цикл
			ТекущиеСтатусыМаркировки.Удалить(ТекущаяСтрока);
		КонецЦикла;
		
		СостояниеКодаМаркировки = Неопределено;
		
		Если Статус = Перечисления.СтатусыДокументовМаркировки.АннулированаОтгрузка Тогда
			СостояниеКодаМаркировки = Перечисления.СостоянияКодовМаркировки.ВведенВОборот;
		ИначеЕсли ПричинаВыводаИзОборота = Перечисления.ВидыОтгрузкиТоваров.Продажа
			И ЗначениеЗаполнено(ДатаВыводаИзОборота) Тогда
			СостояниеКодаМаркировки = Перечисления.СостоянияКодовМаркировки.ВыведенИзОборота;
		Иначе
			СостояниеКодаМаркировки = Перечисления.СостоянияКодовМаркировки.ПередачаДругомуСобственнику;
		КонецЕсли;
		
		// Изменим состояние маркировки, которые ранее не были выведены
		РегистрыСведений.СостоянияКодовМаркировки.СостояниеКодовМаркировки(ДокументСсылка, Организация, СостояниеКодаМаркировки, ТекущиеСтатусыМаркировки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
