// Модуль объекта документа "Отгрузка товаров"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовПлатформа.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыДокументовМаркировки.Новый;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОтгрузкиТоваров) Тогда
		ДатаОтгрузкиТоваров = Дата;
	КонецЕсли;
	
	ТипЦен = ПравоПользователя("ОсновнойТипЦенПродажи");
	Если (НЕ ДанныеЗаполнения = Неопределено) И (НЕ ТипЗнч(ДанныеЗаполнения) = Тип("Структура")) Тогда
		ТипЦен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ТипЦен");
	КонецЕсли;
	
	Для Каждого СтрокаТовар Из Товары Цикл
		
		// Заполним доп. поля для товарной строки
		Если ПустаяСтрока(СтрокаТовар.ИдентификаторТовара) Тогда
			СтрокаТовар.ИдентификаторТовара = Новый УникальныйИдентификатор;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ОсобенностьУчета) Тогда
		ОсобенностьУчета = МаркировкаТоваровСервер.ОсобенностьУчетаНоменклатуры(Товары.ВыгрузитьКолонку("Номенклатура"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	Статус = Перечисления.СтатусыДокументовМаркировки.Новый;
	КодыМаркировки.Очистить();
	ИдентификаторДокумента = "";
	ОписаниеОшибки = "";
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МаркировкаТоваровСервер.ПроверкаКодовМаркировкиПередЗаписью(ЭтотОбъект);
	
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаВыводаИзОборота)
		И ДатаВыводаИзОборота < ДатаПервичногоДокумента Тогда
		ВывестиСообщение(
			НСтр("ru = 'Дата вывода из оборота не может быть меньше даты первичного документа'"),
			ЭтотОбъект,,,
			Отказ);
	КонецЕсли;
	
	МаркировкаТоваровСервер.ПроверитьЗаполнениеКодовМаркировки(ЭтотОбъект, Отказ, , , Истина);
	МаркировкаТоваровСервер.НоменклатураСоответствуетОсобенностиУчета(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	//Если НЕ Отказ Тогда
	//	РегистрыСведений.ЖурналСостояний.ЗаписьВЖурналСостояний(Ссылка, Статус);
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	//// Удалим введенные в оборот коды маркировки
	//НаборЗаписейСостоянияКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
	//НаборЗаписейСостоянияКодовМаркировки.ДокументОбъект = ЭтотОбъект;
	//НаборЗаписейСостоянияКодовМаркировки.ОтменаПроведения();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЗаполненияОбъекта

Функция ОбработкаЗаполнения_РеализацияТоваров(ДанныеЗаполнения,
	ТекстЗаполнения,
	СтандартнаяОбработка = Истина) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка,
		"Товары"
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат ОбработкаЗаполненияНаОсновании(ДанныеЗаполнения, ТекстЗаполнения);
	
КонецФункции

Функция ОбработкаЗаполненияНаОсновании(ДанныеЗаполнения, ТекстЗаполнения)
	
	ДатаОтгрузкиТоваров = ДанныеЗаполнения.Дата;
	ДатаПервичногоДокумента = ДанныеЗаполнения.Дата;
	НомерПервичногоДокумента = ДанныеЗаполнения.Номер;
	
	// Загрузим все коды маркировоки
	КодыМаркировки.Очистить();
	Для Каждого ТекущаяСтрока Из ДанныеЗаполнения.Марки Цикл
		НоваяСтрока = КодыМаркировки.Добавить();
		НоваяСтрока.ИдентификаторТовара = ТекущаяСтрока.ИдентификаторСтроки;
		НоваяСтрока.КодМаркировки       = ТекущаяСтрока.КодМарки;
		НоваяСтрока.Количество          = ТекущаяСтрока.Количество;
	КонецЦикла;
	
	// Пройдемся по ТЧ
	СтруктураПоиска = Новый Структура("ИдентификаторТовара");
	
	ЕстьИдентификаторСтроки = ЕстьРеквизит(ДанныеЗаполнения, "ИдентификаторСтроки", "Товары");
	
	Для Каждого ТекущаяСтрока Из ДанныеЗаполнения.Товары Цикл
		
		Если ЕстьИдентификаторСтроки Тогда
			ИдентификаторТовара = ТекущаяСтрока.ИдентификаторСтроки;
		КонецЕсли;
		
		СтруктураПоиска.ИдентификаторТовара = ИдентификаторТовара;
		НайденныеСтроки = КодыМаркировки.НайтиСтроки(СтруктураПоиска);
		КоличествоКодов = 0;
		Для Каждого СтрокаМарки Из НайденныеСтроки Цикл
			КоличествоКодов = КоличествоКодов + Макс(СтрокаМарки.Количество, 1);
		КонецЦикла;
		
		// У данной номенклатуры нет кодов маркировки
		// не будем ее выгружать
		Если КоличествоКодов = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.ИдентификаторТовара = ИдентификаторТовара;
		
		Документы.ОтгрузкаТоваровКодовМаркировки.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока);
		НоваяСтрока.Сумма = ТекущаяСтрока.СуммаВсего;
		Коэффициент = ?(НоваяСтрока.Коэффициент = 0, 1, НоваяСтрока.Коэффициент);
		Если КоличествоКодов <> НоваяСтрока.Количество * Коэффициент Тогда
			НоваяСтрока.Количество = Окр(КоличествоКодов / Коэффициент, 3);
		КонецЕсли;
		НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / ?(НоваяСтрока.Количество = 0, 1, НоваяСтрока.Количество), 2);
		НоваяСтрока.СуммаНДС = ТекущаяСтрока.СуммаНДС;
		НоваяСтрока.СтавкаНДС = ТекущаяСтрока.СтавкаНДС;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
