// Модуль менеджера справочника "Карточки"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	КарточкиДисконтнаяКарта = Справочники.Карточки.ДисконтнаяКарта.ПолучитьОбъект();
	КарточкиДисконтнаяКарта.ВидКарточки = Перечисления.ВидыКарточек.ДисконтнаяКарта;
	
	// Сохранение справочника
	НовыйЭлемент = КарточкиДисконтнаяКарта.ЭтоНовый();
	Если КарточкиДисконтнаяКарта.Модифицированность() Тогда
		Попытка
			КарточкиДисконтнаяКарта.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Карточки"". ""%1"" элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(КарточкиДисконтнаяКарта.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Карточки""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
		КонецПопытки;
	КонецЕсли;
	
	КарточкиНеНайденнаяКарта = Справочники.Карточки.НеНайденнаяКарта.ПолучитьОбъект();
	КарточкиНеНайденнаяКарта.ВидКарточки = Перечисления.ВидыКарточек.ДисконтнаяКарта;
	
	// Сохранение справочника
	НовыйЭлемент = КарточкиНеНайденнаяКарта.ЭтоНовый();
	Если КарточкиНеНайденнаяКарта.Модифицированность() Тогда
		Попытка
			КарточкиНеНайденнаяКарта.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Карточки"". ""%1"" элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(КарточкиНеНайденнаяКарта.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Карточки""'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	КарточкиКарточкаПользователя = Справочники.Карточки.КарточкаПользователя.ПолучитьОбъект();
	КарточкиКарточкаПользователя.ВидКарточки = Перечисления.ВидыКарточек.КарточкаПользователя;
	
	// Сохранение справочника
	НовыйЭлемент = КарточкиКарточкаПользователя.ЭтоНовый();
	Если КарточкиКарточкаПользователя.Модифицированность() Тогда
		Попытка
			КарточкиКарточкаПользователя.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Карточки"". ""%1"" элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(КарточкиКарточкаПользователя.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Карточки""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	КарточкиСлужебнаяОперация = Справочники.Карточки.СлужебнаяОперация.ПолучитьОбъект();
	КарточкиСлужебнаяОперация.ВидКарточки = Перечисления.ВидыКарточек.СлужебнаяОперация;
	
	// Сохранение справочника
	НовыйЭлемент = КарточкиСлужебнаяОперация.ЭтоНовый();
	Если КарточкиСлужебнаяОперация.Модифицированность() Тогда
		Попытка
			КарточкиСлужебнаяОперация.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Карточки"". ""%1"" элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(КарточкиСлужебнаяОперация.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Карточки""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	КарточкиЧистая = Справочники.Карточки.Чистая.ПолучитьОбъект();
	КарточкиЧистая.ВидКарточки = Перечисления.ВидыКарточек.Чистая;
	
	// Сохранение справочника
	НовыйЭлемент = КарточкиЧистая.ЭтоНовый();
	Если КарточкиЧистая.Модифицированность() Тогда
		Попытка
			КарточкиЧистая.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Карточки"". ""%1"" элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(КарточкиЧистая.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Карточки""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	КарточкиКлубнаяКарта = Справочники.Карточки.КлубнаяКарта.ПолучитьОбъект();
	КарточкиКлубнаяКарта.ВидКарточки = Перечисления.ВидыКарточек.КлубнаяКарта;
	
	// Сохранение справочника
	НовыйЭлемент = КарточкиКлубнаяКарта.ЭтоНовый();
	Если КарточкиКлубнаяКарта.Модифицированность() Тогда
		Попытка
			КарточкиКлубнаяКарта.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Карточки"". ""%1"" элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(КарточкиКлубнаяКарта.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Карточки""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	КарточкиТалон = Справочники.Карточки.Талон.ПолучитьОбъект();
	КарточкиТалон.ВидКарточки = Перечисления.ВидыКарточек.Талон;
	
	// Сохранение справочника
	НовыйЭлемент = КарточкиТалон.ЭтоНовый();
	Если КарточкиТалон.Модифицированность() Тогда
		Попытка
			КарточкиТалон.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Карточки"". ""%1"" элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(КарточкиТалон.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Карточки""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	КарточкиПрофилиСкидок = Справочники.Карточки.ПрофилиСкидок.ПолучитьОбъект();
	КарточкиПрофилиСкидок.ВидКарточки = Перечисления.ВидыКарточек.ПрофильСкидки;
	
	// Сохранение справочника
	НовыйЭлемент = КарточкиПрофилиСкидок.ЭтоНовый();
	Если КарточкиПрофилиСкидок.Модифицированность() Тогда
		Попытка
			КарточкиПрофилиСкидок.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Карточки"". ""%1"" элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(КарточкиПрофилиСкидок.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Карточки""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

// Функция получения родителя самого верхнего уровня.
//
// Параметры:
//  Родитель          - СправочникСсылка - Элемент справочника.
//
// Возвращаемое значение:
//   СправочникСсылка - Вид карточки.
//
Функция ПолучитьВидКарточки(Родитель) Экспорт
	
	Если Родитель.Родитель.Пустая() Тогда
		Возврат Родитель;
	Иначе
		Возврат ПолучитьВидКарточки(Родитель.Родитель);
	КонецЕсли;
	
КонецФункции // ПолучитьВидКарточки()

// Процедура заполнения карточки в соответствии с группой
//
Процедура ЗаполнитьВидКарточки(Карточка, Родитель) Экспорт
	
	Объект = Карточка.ПолучитьОбъект();
	Если Объект.Родитель <> Родитель Тогда
		ВидКарточки = ПолучитьВидКарточки(Родитель);
		Если (ВидКарточки <> Неопределено) И (ВидКарточки <> Объект.ВидКарточки) Тогда
			Объект.ВидКарточки = ВидКарточки.ВидКарточки;
			Если НЕ ЗначениеЗаполнено(Объект.ВидКарточки) Тогда
				Если ВидКарточки = Справочники.Карточки.ПрофилиСкидок Тогда
					Объект.ВидКарточки = Перечисления.ВидыКарточек.ПрофильСкидки;
				ИначеЕсли ВидКарточки = Справочники.Карточки.КарточкаПользователя Тогда
					Объект.ВидКарточки = Перечисления.ВидыКарточек.КарточкаПользователя;
				КонецЕсли;
			КонецЕсли;
			Объект.Родитель = Родитель;
			СформироватьПолноеНаименование(Объект, Новый Структура("Родитель", Родитель));
			Объект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьВидКарточки()

// Процедура для получения родителя по виду карточки
//
Процедура ПолучитьРодителя(Объект) Экспорт 
	
	Если Объект.ВидКарточки = Перечисления.ВидыКарточек.ДисконтнаяКарта Тогда
		Объект.Родитель = Справочники.Карточки.ДисконтнаяКарта;
	ИначеЕсли Объект.ВидКарточки = Перечисления.ВидыКарточек.КарточкаПользователя Тогда
		Объект.Родитель = Справочники.Карточки.КарточкаПользователя;
	ИначеЕсли Объект.ВидКарточки = Перечисления.ВидыКарточек.СлужебнаяОперация Тогда
		Объект.Родитель = Справочники.Карточки.СлужебнаяОперация;
	ИначеЕсли Объект.ВидКарточки = Перечисления.ВидыКарточек.Чистая Тогда
		Объект.Родитель = Справочники.Карточки.Чистая;
	ИначеЕсли Объект.ВидКарточки = Перечисления.ВидыКарточек.КлубнаяКарта Тогда
		Объект.Родитель = Справочники.Карточки.КлубнаяКарта;
	ИначеЕсли Объект.ВидКарточки = Перечисления.ВидыКарточек.Талон Тогда
		Объект.Родитель = Справочники.Карточки.Талон;
	ИначеЕсли Объект.ВидКарточки = Перечисления.ВидыКарточек.ПрофильСкидки Тогда
		Объект.Родитель = Справочники.Карточки.ПрофилиСкидок;
	КонецЕсли;
	
КонецПроцедуры // ПолучитьРодителя()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	ОбязательныеРеквизиты.Добавить("ВидКарточки");
	
	Если НЕ Объект.ЭтоГруппа И (Объект.ВидКарточки=Перечисления.ВидыКарточек.Талон ИЛИ Объект.ВидКарточки=Перечисления.ВидыКарточек.КлубнаяКарта) Тогда
		ОбязательныеРеквизиты.Добавить("Объект");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Формирует стандартное наименование карточки.
//
// Параметры:
//  Объект   - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ШтрихКод - Строка               - Строка штрих-кода.
//
Функция СформироватьНаименованиеПоУмолчанию(Объект, Штрихкод = Неопределено) Экспорт
	
	Наименование = "";
	
	Если ЗначениеЗаполнено(Штрихкод) Тогда
		Наименование = ШтрихКод;
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции // СформироватьНаименованиеПоУмолчанию()

// Формирует текстовые поля карточки указанного вида.
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура СформироватьПолноеНаименование(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Родитель = Неопределено;
	Если ТипЗнч(ПараметрыДействия) = Тип("Структура") Тогда
		Родитель = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Родитель", Неопределено);
	КонецЕсли;
	
	Если Родитель = Неопределено Тогда
		врВидКарточки = ПолучитьВидКарточки(Объект.Родитель);
	Иначе
		врВидКарточки = ПолучитьВидКарточки(Родитель);
	КонецЕсли;
	
	Объект.ПолноеНаименование = СокрЛП(врВидКарточки.Наименование) + " : ";
	
	Если врВидКарточки = Справочники.Карточки.ДисконтнаяКарта Тогда
		Если ТипЗнч(Объект.Объект) <> Тип("СправочникСсылка.Контрагенты") Тогда
			Возврат;
		КонецЕсли;
		Объект.ПолноеНаименование = Объект.ПолноеНаименование + Объект.Объект;
		Объект.Комментарий   = НСтр("ru = 'Размер скидки определяется магазином'");
		
	ИначеЕсли врВидКарточки = Справочники.Карточки.КарточкаПользователя Тогда
		Если ТипЗнч(Объект.Объект) <> Тип("СправочникСсылка.Пользователи") Тогда
			Возврат;
		КонецЕсли;
		Объект.ПолноеНаименование = Объект.ПолноеНаименование + Объект.Объект;
		
	ИначеЕсли врВидКарточки = Справочники.Карточки.СлужебнаяОперация Тогда
		Если ТипЗнч(Объект.Объект) <> Тип("Строка") Тогда
			Возврат;
		КонецЕсли;
		Объект.ПолноеНаименование = Объект.ПолноеНаименование + Объект.Объект;
		
	ИначеЕсли врВидКарточки = Справочники.Карточки.Чистая Тогда
		Объект.ПолноеНаименование = НСтр("ru = 'Не используется'");
		
	ИначеЕсли врВидКарточки = Справочники.Карточки.КлубнаяКарта Тогда
		Если ТипЗнч(Объект.Объект) <> Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Тогда
			Возврат;
		КонецЕсли;
		Объект.ПолноеНаименование = Объект.ПолноеНаименование + Объект.Объект.Владелец.Наименование;
		
	ИначеЕсли врВидКарточки = Справочники.Карточки.Талон Тогда
		Если ТипЗнч(Объект.Объект) <> Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Тогда
			Возврат;
		КонецЕсли;
		ВладелецНаименование = СокрЛП(Объект.Объект.Владелец.Наименование);
		Если НЕ ПустаяСтрока(ВладелецНаименование) Тогда
			ВладелецНаименование = ВладелецНаименование+" ";
		КонецЕсли;
		Объект.ПолноеНаименование = Объект.ПолноеНаименование+ВладелецНаименование+?(ЗначениеЗаполнено(Объект.Номинал),Объект.Номинал,"0.00")+" руб.";
	ИначеЕсли врВидКарточки = Справочники.Карточки.ПрофилиСкидок Тогда
		
		Объект.ПолноеНаименование = НСтр("ru = 'Профиль скидки:'") + Объект.Наименование;
		
	КонецЕсли;
	
КонецПроцедуры // СформироватьПолноеНаименование()

// Обработчик события возникающего при изменении данных реквизита "Вид карточки".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура ВидКарточкиПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	ПолучитьРодителя(Объект);
	
	Если НЕ Объект.ЭтоГруппа Тогда
		Справочники.Карточки.СформироватьПолноеНаименование(Объект,ПараметрыДействия);
		Объект.Объект = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры // ВидКарточкиПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Родитель".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура РодительПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Объект.Родитель) Тогда
		Объект.ВидКарточки = Объект.Родитель.ВидКарточки;
	КонецЕсли;
	
	Если НЕ Объект.ЭтоГруппа Тогда
		Справочники.Карточки.СформироватьПолноеНаименование(Объект,ПараметрыДействия);
	КонецЕсли;
	
КонецПроцедуры // ВидКарточкиПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Справочник.Карточки",
		"ПФ_MXL_Карточка",
		НСтр("ru = 'Карточка'"),
		СсылкаНаДокумент);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Карточка") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_Карточка",
															"Карточка",
															ПечатьКарточка(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры // Печать()

// функция печати элементов спр Карточки 
//
Функция ПечатьКарточка(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Карточки_Карточка";
	
	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Карточки.ПФ_MXL_Карточка");
	
	// Создадим список карточек для печати
	МассивКарточек = Новый Массив;
	Для Каждого ЭлементМассиваОбъектов Из МассивОбъектов Цикл
		Если ЭлементМассиваОбъектов.ЭтоГруппа Тогда
			Выборка = Справочники.Карточки.ВыбратьИерархически(ЭлементМассиваОбъектов);
			Пока Выборка.Следующий() Цикл
				Если НЕ Выборка.ЭтоГруппа Тогда
					МассивКарточек.Добавить(Выборка.Ссылка);
				КонецЕсли;
			КонецЦикла;
		Иначе // печатаем текущую карточку
			МассивКарточек.Добавить(ЭлементМассиваОбъектов);
		КонецЕсли;
	КонецЦикла;
	
	// Проверим, есть ли карточки для печати
	Если МассивКарточек.Количество()=0 Тогда
		ВывестиСообщение(НСтр("ru = 'Нет объектов для печати'"));
		Возврат ТабличныйДокумент;
	КонецЕсли;
	
	НомСтроки=1;
	НомКолонки=1;
	
	Попытка
		ВСтроке=Число(Макет.Области.ВСтроке.Текст);
		ВСтолбце=Число(Макет.Области.ВСтолбце.Текст);
	Исключение
		ВывестиСообщение(НСтр("ru = 'Неверное количество экземпляров на листе'"));
		Возврат ТабличныйДокумент;
	КонецПопытки;
	
	// Проверка корректности числа этикеток на странице
	Если ВСтроке<=0 ИЛИ ВСтолбце<=0 Тогда
		ВывестиСообщение(НСтр("ru = 'Неверное количество экземпляров на листе'"));
		Возврат ТабличныйДокумент;
	КонецЕсли; 
	
	// Воздадим временный документ, где будем собирать карточку и ШК
	ВременныйТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Напечатаем все карточки
	Для Каждого Карточка Из МассивКарточек Цикл
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если НомСтроки>ВСтолбце Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			НомСтроки=1;
		КонецЕсли;
		
		Если НомКолонки>ВСтроке Тогда
			НомКолонки=1;
		КонецЕсли;
		
		ОбластьКарточка=Макет.ПолучитьОбласть("Карточка|Карта");
		ОбластьКарточка.Параметры.ВидКарточки=Карточка.ВидКарточки;
		ОбластьКарточка.Параметры.Представление=Карточка.ПолноеНаименование;
		ОбластьКарточка.Параметры.Комментарий=Карточка.Комментарий;
		
		// получим штрихкод
		ТекстЗапроса="
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ШтрихКоды.ШтрихКод КАК ШтрихКод
		|ИЗ
		|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ГДЕ ШтрихКоды.Объект=&Карточка";
		Запрос=Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Карточка",Карточка);
		Выборка=Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ШК=Выборка.ШтрихКод;
			Если ЗначениеЗаполнено(ШК) Тогда
				ОбластьШтрихКод=Макет.ПолучитьОбласть("Карточка|ШтрихКод");
				ПараметрыШтрихкода = Новый Структура;
				ПараметрыШтрихкода.Вставить("Ширина",          Окр(ОбластьШтрихКод.Рисунки.ШК.Ширина/ КоличествоМиллиметровВПикселе));
				ПараметрыШтрихкода.Вставить("Высота",          Окр(ОбластьШтрихКод.Рисунки.ШК.Высота / КоличествоМиллиметровВПикселе));
				ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(ШК));
				ПараметрыШтрихкода.Вставить("ТипКода",         99);
				ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
				ПараметрыШтрихкода.Вставить("РазмерШрифта",    12);
				ОбластьШтрихКод.Рисунки.ШК.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
			КонецЕсли;
		Иначе
			ОбластьШтрихКодОшибка=Макет.ПолучитьОбласть("Карточка|ШтрихКодНеНайден");
		КонецЕсли;
		
		ВременныйТабличныйДокумент.Очистить();
		ВременныйТабличныйДокумент.Вывести(ОбластьКарточка);
		Если ЗначениеЗаполнено(ШК) Тогда
			ВременныйТабличныйДокумент.Вывести(ОбластьШтрихКод);
		Иначе
			ВременныйТабличныйДокумент.Вывести(ОбластьШтрихКодОшибка);
		КонецЕсли;
		ОбластьДляВывода = ВременныйТабличныйДокумент.ПолучитьОбласть("R1C1:R"+ВременныйТабличныйДокумент.ВысотаТаблицы+"C"+ВременныйТабличныйДокумент.ШиринаТаблицы);
		Если НомКолонки = 1 Тогда
			ТабличныйДокумент.Вывести(ОбластьДляВывода);
		Иначе
			ТабличныйДокумент.Присоединить(ОбластьДляВывода);
		КонецЕсли;
		
		НомСтроки = НомСтроки + 1;
		НомКолонки = НомКолонки + 1;
		ШК = Неопределено;
		
		// блок области
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Карточка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Обработчик события возникающего при изменении данных реквизита "ПодразделениеКомпании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Вызываем общий обработчик события
	ОбработкаСобытийСправочникаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

#КонецЕсли