// Модуль основной формы документа "Изменение ассортимента форматов"
&НаКлиенте
перем ШтрихКодДляПоиска;

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ




////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
		
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	Элементы.ГруппаТовары.Видимость = ОтобразитьПанельТоваров;
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	Если ЛЕВ(ДополнительныеПараметры, 17)="КомандаЗаполнения" Тогда
		
		Если Тип(РезультатОповещения) = Тип("Структура")
			И РезультатОповещения.Свойство("ПараметрыЗаполнения")
			И РезультатОповещения.ПараметрыЗаполнения.Свойство("ОчиститьТабличнуюЧасть")
			И РезультатОповещения.ПараметрыЗаполнения.ОчиститьТабличнуюЧасть Тогда
			
			Шахматка.Очистить();
			
		КонецЕсли;
		
		ТаблицаТоваров = Неопределено;
		
		//Если ДополнительныеПараметры = "КомандаЗаполненияТоварыЗаполнитьПоДокументу" Тогда
		//	ДокументЗаполнения = РезультатОповещения.ПараметрыЗаполнения.ЗаполнитьПоДокументуВыборСсылки;
		//	Если ЕстьРеквизит(ДокументЗаполнения,, "Товары") Тогда
		//		ТаблицаТоваров = ДокументЗаполнения.Товары.Выгрузить();
		//	КонецЕсли;
		//КонецЕсли;
		//
		//ЗаполнитьТаблицуТоварами(ТаблицаТоваров);
			
	Иначе
		// Вызываем общий обработчик события
		Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
			
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	Если ДополнительныеПараметры="ПараметрыДокумента" Тогда
		
		Если ЗначениеЗаполнено(Объект.ДатаНачалаДействия) И Объект.ДатаНачалаДействия<НачалоДня(Объект.Дата) Тогда
			Объект.ДатаНачалаДействия = Объект.Дата;
			ДатаНачалаДействияПриИзменении(Неопределено);
		КонецЕсли;
		
	КонецЕсли;
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события нажатия кнопки "Подбор номенклатуры".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомКлиент.ОткрытьПодборНоменклатуры(ЭтотОбъект);
	
КонецПроцедуры // ПодборНоменклатуры()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ИзменениеСодержаниягруппАссортимента.ДатаПриИзменении(Объект, ПараметрыДействия);
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.ДатаНачалаДействия) И Объект.ДатаНачалаДействия<НачалоДня(Объект.Дата) Тогда
		Объект.ДатаНачалаДействия = Объект.Дата;
		ДатаНачалаДействияПриИзменении(Неопределено);
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ИзменениеСодержанияГруппАссортимента.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);

	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата начала действия" в контексте сервера.
//
&НаСервере
Процедура ДатаНачалаДействияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	ТоварыПолучитьОбновитьТекущиеЗначенияНаСервере();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаНачалаДействияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата начала действия".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаНачалаДействияПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.ДатаНачалаДействия) И Объект.ДатаНачалаДействия<НачалоДня(Объект.Дата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Дата начала действия, не может быть меньше даты документа.'"));
		Объект.ДатаНачалаДействия = Объект.Дата;
	КонецЕсли;
	
	Если Не ПроверитьПравильностьЗаполненияДаты() Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата начала действия должна быть не позже даты окончания",,"ДатаОкончанияДействия","Объект.ДатаНачалаДействия");
		Возврат
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ДатаНачалаДействияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры //ДатаНачалаДействияПриИзменении()

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ИзменениеСодержанияГруппАссортимента.ТоварыНоменклатураПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	// Вызываем общий обработчик изменения реквизитов формы
	УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(ЭтотОбъект, ТекущиеДанные, ПараметрыДействия);

КонецПроцедуры // ТоварыНоменклатураПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыНоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры // ТоварыПередНачаломДобавления()

// Обработчик события возникающего на клиенте перед началом интерактивного изменения строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередНачаломИзменения()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередУдалением(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередУдалением()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Зарезервировано
	Зарезервировано	= Истина;
	
КонецПроцедуры // ТоварыПриОкончанииРедактирования()

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыПослеУдаленияНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ТоварыПослеУдаления(ЭтотОбъект, Элементы.Товары);
	
КонецПроцедуры // ТоварыПослеУдаленияНаСервере()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыПослеУдаленияНаСервере();
	
КонецПроцедуры // ТоварыПослеУдаления()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                        - Строка таблицы, над которой находится курсор.
//  Поле                          - Элемент управляемой формы, с которым связана данная колонка таблицы.
//
&НаКлиенте
Процедура ТоварыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // ТоварыПроверкаПеретаскивания()



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	//Почистим сохраненные настройки формы и задаим новый ключ. Актуально для документов с динамической табличной частью создаваемой кодом. skud/22-04-2020
	МассивУдалить = Новый Массив;
	//Выборка = ХранилищеСистемныхНастроек.Выбрать(Новый Структура("Пользователь", ИмяПользователя()));
	//Пока Выборка.Следующий() Цикл
	//    Если СтрНайти(Выборка.КлючОбъекта, ИмяФормы) > 0 Тогда
	//        МассивУдалить.Добавить(Выборка.КлючОбъекта)
	//    КонецЕсли;
	//КонецЦикла;
	Для Каждого КлючОбъекта Из МассивУдалить Цикл
	    ХранилищеСистемныхНастроек.Удалить(КлючОбъекта,,ИмяПользователя()); 
	КонецЦикла;
	КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор;
	
		
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	//Заполним дату начала действия
	Если Объект.ДатаНачалаДействия = '00010101' Тогда
		Объект.ДатаНачалаДействия = НачалоДня(ТекущаяДата()+ 86400);
	КонецЕсли;
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
		
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	//ЗаполняемШахматку
	ШахматкаОбновитьНаСервере();
	ДеревоФорматовОбновитьНаСервере();
	ДеревоФоматовРазвернутьВсеУровни(Элементы.ДеревоФорматов,ДеревоФорматов.ПолучитьЭлементы());

	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	 	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя="СтраницаШахматка" Тогда
		ТоварыПолучитьОбновитьТекущиеЗначенияНаСервере();
	КонецЕсли;	
		
КонецПроцедуры //СтраницыПриСменеСтраницы()

&НаКлиенте
Процедура ШахматкаОбновить(Команда)
	
	ТоварыПолучитьОбновитьТекущиеЗначенияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТоварыПолучитьОбновитьТекущиеЗначенияНаСервере()
	
	//НовыеЗначения = Объект.Товары.Выгрузить("Номенклатура,Формат,Состояние,МинимальноеКоличество");
	СписокНоменклатуры = Объект.Товары.Выгрузить(,"Номенклатура");
	СписокНоменклатуры.Свернуть("Номенклатура");
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТоварыВСпискеНоменклатуры",Истина);
	СтруктураПараметров.Вставить("СохранитьНовыеЗначения",Истина);
	СтруктураПараметров.Вставить("СписокНоменклатуры",СписокНоменклатуры.ВыгрузитьКолонку("Номенклатура"));
	ШахматкаЗаполнитьИзАссортиментаФорматовНаСервере(СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ШахматкаОбновитьНаСервере() Экспорт
	
	ИмяТаблицы = "Шахматка";
	Таблица = РеквизитФормыВЗначение(ИмяТаблицы);
	ЭлементШахматкаГруппаКолонокФорматов = Элементы.ШахматкаГруппаКолонокФорматов;

	// Удалим реквизиты таблицы значений перед обновлением
	МассивРеквизитов = Новый Массив;
	Для Каждого Колонка Из Таблица.Колонки Цикл 
		Если Колонка.Имя = "Номенклатура" 
		 Или Колонка.Имя = "НоменклатураКод"
		 ИЛИ Колонка.Имя = "Категория"
		 Или Колонка.Имя = "ПустаяКолонка" Тогда
			Продолжить;
		КонецЕсли;
		МассивРеквизитов.Добавить(ИмяТаблицы + "." + Колонка.Имя);
	КонецЦикла;
	ИзменитьРеквизиты(,МассивРеквизитов);
	МассивРеквизитов.Очистить();
	
	// Удаляем колонки с формы
	МассивУдаляемыхКолонокФорматов = Новый Массив;
	Для Каждого Колонка Из ЭлементШахматкаГруппаКолонокФорматов.ПодчиненныеЭлементы Цикл
		МассивУдаляемыхКолонокФорматов.Добавить(Колонка.Имя);
	КонецЦикла;
	Для Каждого КолонкаИмя Из МассивУдаляемыхКолонокФорматов Цикл
		Колонка = Элементы.Найти(КолонкаИмя);
		Элементы.Удалить(Колонка);
	КонецЦикла;
	МассивУдаляемыхКолонокФорматов.Очистить();
	
	// Создаем реквизиты таблицы значений и выводим их на форму
	Для Каждого Строка Из Объект.Форматы Цикл
		Если Не ЗначениеЗаполнено(Строка.Формат) Тогда 
			Продолжить;
		КонецЕсли;
		ШахматкаДобавитьФорматНаСервере(Строка.Формат,Строка.ФорматКод,,Строка.НеУчаствуетВДвижениях);
	КонецЦикла;
	
	ШахматкаЗаполнитьИзТЧТовары();
	
	//рассчет итогов по колонкам
	тзШахматка = Шахматка.Выгрузить();
	Для Каждого текРекв Из ЭтотОбъект.ПолучитьРеквизиты("Шахматка") Цикл
		Если СтрНайти(текРекв.Имя,"ТекущееЗначение")>0 Тогда
			Элементы["Шахматка"+текРекв.Имя].ТекстПодвала = Формат(тзШахматка.Итог(текРекв.Имя), "ЧН=");
		ИначеЕсли СтрНайти(текРекв.Имя,"Формат")>0 И СтрДлина(текРекв.Имя)<15 Тогда
			Элементы["Шахматка"+текРекв.Имя].ТекстПодвала = Формат(тзШахматка.Итог(текРекв.Имя), "ЧН=");
		КонецЕсли;
	КонецЦикла;
	
	Шахматка.Сортировать("Категория Возр, Номенклатура Возр");
	
КонецПроцедуры //ШахматкаОбновитьНаСервере()

&НаСервере
Процедура ШахматкаЗаполнитьИзТЧТовары()
	
	Запрос = Новый Запрос;
	МассивСтрокиЗапроса = Новый Массив;
	МассивСтрокиЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ТоварыИФорматы.Номенклатура КАК Номенклатура,
		|	ТоварыИФорматы.Состояние КАК Состояние,
		|	ТоварыИФорматы.ФорматКод КАК ФорматКод,
		|	ТоварыИФорматы.ТекущееЗначение КАК ТекущееЗначение,
		|	ТоварыИФорматы.МинимальноеКоличество КАК МинимальноеКоличество,
		|	ТоварыИФорматы.НоменклатураКод КАК НоменклатураКод
		|ПОМЕСТИТЬ ТоварыИФорматы
		|ИЗ
		|	&ТоварыИФорматы КАК ТоварыИФорматы
		|;
		|
		|/////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ");
	
	Для Каждого Строка Из Объект.Форматы Цикл 
		Если Строка.НеУчаствуетВДвижениях Тогда
			Продолжить
		КонецЕсли;
		МассивСтрокиЗапроса.Добавить(
			"	МАКСИМУМ(ВЫБОР
			|		КОГДА ТоварыИФорматы.ФорматКод = """ + Строка.ФорматКод + """
			|			ТОГДА ТоварыИФорматы.ТекущееЗначение
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ) КАК Формат" + Строка.ФорматКод + "ТекущееЗначение,
			|	МАКСИМУМ(ВЫБОР
			|		КОГДА ТоварыИФорматы.ФорматКод = """ + Строка.ФорматКод + """
			|			ТОГДА ТоварыИФорматы.МинимальноеКоличество
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ) КАК Формат" + Строка.ФорматКод + "МинимальноеКоличество,
			|	МАКСИМУМ(ВЫБОР
			|		КОГДА ТоварыИФорматы.ФорматКод = """ + Строка.ФорматКод + """
			|			ТОГДА ТоварыИФорматы.Состояние
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ) КАК Формат" + Строка.ФорматКод + ",");
	КонецЦикла;
	
	УровеньКатегории = ПолучитьЗначениеУчетнойПолитики("УровеньКатегорииНоменклатуры",, Объект.Дата);
	Если УровеньКатегории<>0 Тогда
		УровеньКатегории = УровеньКатегории - 1;
	КонецЕсли;
	
	МассивСтрокиЗапроса.Добавить(
		"	ТоварыИФорматы.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЕСТЬNULL(Рег.Группа, ТоварыИФорматы.Номенклатура.Родитель)) КАК Категория,
		|	МАКСИМУМ(ТоварыИФорматы.НоменклатураКод) КАК НоменклатураКод
		|ИЗ
		|	ТоварыИФорматы КАК ТоварыИФорматы
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураИерархииНоменклатуры КАК Рег
		|	ПО Рег.Номенклатура=ТоварыИФорматы.Номенклатура.Родитель И Рег.Уровень=&УровеньКатегории
		|СГРУППИРОВАТЬ ПО
		|	ТоварыИФорматы.Номенклатура");
	Запрос.Текст = СтрСоединить(МассивСтрокиЗапроса,Символы.ПС);
	Запрос.УстановитьПараметр("ТоварыИФорматы", Объект.Товары.Выгрузить(,"Номенклатура,НоменклатураКод,Состояние,ФорматКод,ТекущееЗначение,МинимальноеКоличество"));
	Запрос.УстановитьПараметр("УровеньКатегории", УровеньКатегории);
	Таблица = Запрос.Выполнить().Выгрузить();
//	Таблица.Колонки.Добавить("НоменклатураКод",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(11)));
	Таблица.Колонки.Добавить("ПустаяКолонка", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1)));
	ЗначениеВРеквизитФормы(Таблица, "Шахматка");
	
КонецПроцедуры

&НаСервере
Процедура ШахматкаДобавитьФорматНаСервере(Формат,ФорматКод = Неопределено,ТекСтрока = Неопределено,НеУчаствуетВДвижениях=Ложь)
	
	Если НеУчаствуетВДвижениях Тогда 
		Возврат
	КонецЕсли;
	
	Если Не ТекСтрока = Неопределено Тогда 
		СтрокаТЧ = Объект.Форматы.НайтиПоИдентификатору(ТекСтрока);
		Если Не СтрокаТЧ.ФорматКод = "" Тогда 
			ШахматкаУдалитьФорматНаСервере(СтрокаТЧ.ФорматКод);
		КонецЕсли;
		ФорматКод = Формат.Код; 
		СтрокаТЧ.ФорматКод = ФорматКод;
		СтрокаТЧ.НеУчаствуетВДвижениях = НеУчаствуетВДвижениях;
	КонецЕсли;
	
	ТаблицаИмя = "Шахматка";
	КолонкаИмя = "Формат" + ФорматКод;
	КолонкаЗаголовок = Формат.КраткоеНаименование;//Наименование;
	ЭлементШахматкаГруппаКолонокФорматов = Элементы.ШахматкаГруппаКолонокФорматов;
	Колонка = ЭлементШахматкаГруппаКолонокФорматов.ПодчиненныеЭлементы.Найти(ТаблицаИмя + КолонкаИмя);
	
	Если Колонка = Неопределено Тогда 
		
		МассивРеквизитов = Новый Массив;
		
		// Добавляем основную колонку формата
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Булево"));
		НоваяКолонка = Новый РеквизитФормы(КолонкаИмя,	Новый ОписаниеТипов(МассивТипов), ТаблицаИмя, КолонкаЗаголовок, Истина);
		МассивРеквизитов.Добавить(НоваяКолонка);
		
		// Добавляем колонку с текущим значением формата
		НоваяКолонка = Новый РеквизитФормы(КолонкаИмя+"ТекущееЗначение",
			Новый ОписаниеТипов(МассивТипов), ТаблицаИмя, КолонкаЗаголовок+" ТекущееЗначение", Истина);
		МассивРеквизитов.Добавить(НоваяКолонка);
		
		// Добавляем колонку с минимальным количеством для формата
		МассивТипов.Очистить();
		МассивТипов.Добавить(Тип("Число"));
		НоваяКолонка = Новый РеквизитФормы(КолонкаИмя+"МинимальноеКоличество",
			Новый ОписаниеТипов(МассивТипов,,,Новый КвалификаторыЧисла(4, 1, ДопустимыйЗнак.Неотрицательный)), ТаблицаИмя, КолонкаЗаголовок+" МинимальноеКоличество", Истина);
		МассивРеквизитов.Добавить(НоваяКолонка);
		
		ИзменитьРеквизиты(МассивРеквизитов);
		
		// Добавляем Группу колонок для текущего формата
		ГруппаКолонокТекущегоФормата = Элементы.Добавить(ТаблицаИмя + "Группа"+ КолонкаИмя,
			Тип("ГруппаФормы"), ЭлементШахматкаГруппаКолонокФорматов);
		ГруппаКолонокТекущегоФормата.Вид = ВидГруппыФормы.ГруппаКолонок;
		ГруппаКолонокТекущегоФормата.Заголовок = КолонкаЗаголовок;
		ГруппаКолонокТекущегоФормата.ОтображатьВШапке = Истина;
		ГруппаКолонокТекущегоФормата.Группировка = ГруппировкаКолонок.Горизонтальная;
		Ширина = СтрДлина(КолонкаЗаголовок);
		ГруппаКолонокТекущегоФормата.Ширина = Ширина;
		ГруппаКолонокТекущегоФормата.РастягиватьПоГоризонтали = Ложь;
		
		
		//Выводим основную колонку на форму 
		НовыйЭлементФормы = Элементы.Добавить(ТаблицаИмя + КолонкаИмя,
			Тип("ПолеФормы"), ГруппаКолонокТекущегоФормата);
		НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлементФормы.ПутьКДанным = ТаблицаИмя + "." + КолонкаИмя;
		НовыйЭлементФормы.УстановитьДействие("ПриИзменении", "ШахматкаПриИзмененииЗначенияФлага");
		НовыйЭлементФормы.Заголовок = "НЗ";
		//НовыйЭлементФормы.МаксимальнаяШирина = 5;
		ГруппаКолонокТекущегоФормата.РастягиватьПоГоризонтали = Ложь;
		
		//Выводим колонку с текущим значением формата
		НовыйЭлементФормы = Элементы.Добавить(ТаблицаИмя + КолонкаИмя + "ТекущееЗначение",
			Тип("ПолеФормы"), ГруппаКолонокТекущегоФормата);
		НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлементФормы.ПутьКДанным = ТаблицаИмя + "." + КолонкаИмя+"ТекущееЗначение";
		НовыйЭлементФормы.ТолькоПросмотр = Истина;
		НовыйЭлементФормы.Видимость = ПоказыватьТекущиеЗначения;
		НовыйЭлементФормы.Заголовок = "ТЗ";
//		НовыйЭлементФормы.МаксимальнаяШирина = 5;
		ГруппаКолонокТекущегоФормата.РастягиватьПоГоризонтали = Ложь;
		
		
		//Выводим колонку с минимальным количеством
		НовыйЭлементФормы = Элементы.Добавить(ТаблицаИмя + КолонкаИмя+"МинимальноеКоличество",
			Тип("ПолеФормы"), ГруппаКолонокТекущегоФормата);
		НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлементФормы.ПутьКДанным = ТаблицаИмя + "." + КолонкаИмя+"МинимальноеКоличество";
		НовыйЭлементФормы.Видимость = ПоказыватьМинимальноеКоличество;
		НовыйЭлементФормы.УстановитьДействие("ПриИзменении", "ШахматкаПриИзмененииМинимальногоКоличества");
		НовыйЭлементФормы.Заголовок = "МК";
//		НовыйЭлементФормы.МаксимальнаяШирина = 7;
		ГруппаКолонокТекущегоФормата.РастягиватьПоГоризонтали = Ложь;

		ШахматкаУстановитьУсловноеОформление(ФорматКод);
		
		//Актуализируем текущее значение по формату, для вновь добавленной колонки
		Для Каждого СтрокаШахматки ИЗ Шахматка Цикл
			СтрокаШахматки[КолонкаИмя+"ТекущееЗначение"] = ПолучитьТекущееЗначение(СтрокаШахматки.Номенклатура, Формат);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьТекущееЗначение(Номенклатура, Формат)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Истина КАК ТекущееЗначение
	|ИЗ
	|	РегистрСведений.АссортиментФорматов.СрезПоследних(&Дата,
	|			(НЕ ДатаОкончанияДействия < &Дата ИЛИ ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
	|			И Формат=&Формат И Номенклатура=&Номенклатура) КАК АссортиментФорматовСрезПоследних
	|ГДЕ
	|	АссортиментФорматовСрезПоследних.Состояние=ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
	|");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Формат", Формат);
	Запрос.УстановитьПараметр("Дата", Объект.ДатаНачалаДействия - 1);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ТекущееЗначение;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ПолучитьТекущееЗначение()

&Насервере
Процедура ШахматкаУстановитьУсловноеОформление(ФорматКод);
	ТаблицаИмя = "Шахматка";
	КолонкаИмя = "Формат" + ФорматКод;
	
	//Кораловый цвет при выводе из асортимента 
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаИмя+"." +КолонкаИмя );
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	ЭлементОтбора.Использование = Истина;
		
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаИмя+"." +КолонкаИмя + "ТекущееЗначение" );
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона",WebЦвета.Оранжевый);
	
	Для каждого ПолеОформления Из Элементы[ТаблицаИмя + "Группа"+ КолонкаИмя].ПодчиненныеЭлементы Цикл
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ПолеОформления.Имя);
	КонецЦикла;
	
	//БледноЗеленый цвет при выводе из асортимента 
	Элемент = УсловноеОформление.Элементы.Добавить();
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаИмя+"." +КолонкаИмя );
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТаблицаИмя+"." +КолонкаИмя + "ТекущееЗначение" );
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	ЭлементОтбора.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона",WebЦвета.БледноЗеленый);
	
	Для каждого ПолеОформления Из Элементы[ТаблицаИмя + "Группа"+ КолонкаИмя].ПодчиненныеЭлементы Цикл
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ПолеОформления.Имя);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ШахматкаПриИзмененииЗначенияФлага()
	
	ТекКолонка = Элементы.Шахматка.ТекущийЭлемент;
	ТекДанные = Элементы.Шахматка.ТекущиеДанные;
	КолонкаИмя = Сред(ТекКолонка.Имя,9);
	
	Если Элементы.Шахматка.ВыделенныеСтроки.Количество()>1 Тогда
		
		МассивЗначений = Новый Массив;
	
		НовоеЗначение = ТекДанные[КолонкаИмя];
		
		Для Каждого ВыделеннаяСтрока Из Элементы.Шахматка.ВыделенныеСтроки Цикл
			
			ТекДанные = Элементы.Шахматка.ДанныеСтроки(ВыделеннаяСтрока);
			ТекДанные[КолонкаИмя] = НовоеЗначение;
			
			Структура = Новый Структура;
			Структура.Вставить("Операция",				0);
			Структура.Вставить("Номенклатура",			ТекДанные.Номенклатура);
			Структура.Вставить("НоменклатураКод",		ТекДанные.НоменклатураКод);
			Структура.Вставить("ФорматКод",				Сред(КолонкаИмя,7));
			Структура.Вставить("НовоеЗначение",			ТекДанные[КолонкаИмя]);
			Структура.Вставить("ТекущееЗначение",		ТекДанные[КолонкаИмя+"ТекущееЗначение"]);
			Структура.Вставить("МинимальноеКоличество",	ТекДанные[КолонкаИмя+"МинимальноеКоличество"]);
			
			//ШахматкаПриИзмененииЗначенияНаСервере(Структура);
			МассивЗначений.Добавить(Структура);
			
		КонецЦикла;
		
		//для ускорения, обработаем одним разом на сервере
		Если МассивЗначений.Количество()>0 Тогда
			ГрупповаяОбработкаИзмененияЗначенийШахматкиНаСервере(МассивЗначений);
		КонецЕсли;
		
	Иначе
		Структура = Новый Структура;
		Структура.Вставить("Операция",				0);
		Структура.Вставить("Номенклатура",			ТекДанные.Номенклатура);
		Структура.Вставить("НоменклатураКод",		ТекДанные.НоменклатураКод);
		Структура.Вставить("ФорматКод",				Сред(КолонкаИмя,7));
		Структура.Вставить("НовоеЗначение",			ТекДанные[КолонкаИмя]);
		Структура.Вставить("ТекущееЗначение",		ТекДанные[КолонкаИмя+"ТекущееЗначение"]);
		Структура.Вставить("МинимальноеКоличество",	ТекДанные[КолонкаИмя+"МинимальноеКоличество"]);
		
		ШахматкаПриИзмененииЗначенияНаСервере(Структура);
	
	КонецЕсли;
	
КонецПроцедуры //ШахматкаПриИзмененииЗначенияФлага()

&НаКлиенте
Процедура ШахматкаПриИзмененииМинимальногоКоличества()
	ТекКолонка = Элементы.Шахматка.ТекущийЭлемент;
	ТекДанные = Элементы.Шахматка.ТекущиеДанные;
	КолонкаИмя = Сред(ТекКолонка.Имя,9);
	ОсновнаяКолонкаИмя = Лев(КолонкаИмя,СтрНайти(КолонкаИмя,"МинимальноеКоличество")-1);
	ФорматКод = Сред(ОсновнаяКолонкаИмя,7);
	Структура = Новый Структура;
	Структура.Вставить("Операция",1);
	Структура.Вставить("Номенклатура",ТекДанные.Номенклатура);
	Структура.Вставить("ФорматКод",ФорматКод);
	Структура.Вставить("НоменклатураКод",ТекДанные.НоменклатураКод);
	Структура.Вставить("НовоеЗначение",ТекДанные[ОсновнаяКолонкаИмя]);
	Структура.Вставить("ТекущееЗначение",ТекДанные[ОсновнаяКолонкаИмя+"ТекущееЗначение"]);
	Структура.Вставить("МинимальноеКоличество",ТекДанные[КолонкаИмя]);
	ШахматкаПриИзмененииЗначенияНаСервере(Структура);
КонецПроцедуры

&НаСервере
Процедура ШахматкаПриИзмененииЗначенияНаСервере(Структура)
	
	СтруктураОтбора = Новый Структура("Номенклатура,ФорматКод",Структура.Номенклатура,Структура.ФорматКод);
	СтрокиТЧТовары = Объект.Товары.НайтиСтроки(СтруктураОтбора);
	
	ДобавитьСтроку = Ложь;
	МассивУдаляемыхСтрок = Новый СписокЗначений;
	
	Если СтрокиТЧТовары.Количество() = 0 Тогда 
		ДобавитьСтроку = Истина;
		
	ИначеЕсли СтрокиТЧТовары.Количество() = 1 И Структура.Операция = 0 Тогда 
		СтрокиТЧТовары[0].Состояние = Структура.НовоеЗначение;//ШахматкаПолучитьНовоеСостояниеФормата(Структура);
		
	ИначеЕсли СтрокиТЧТовары.Количество() = 1 И Структура.Операция = 1 Тогда 
		СтрокиТЧТовары[0].МинимальноеКоличество = Структура.МинимальноеКоличество;
		
	ИначеЕсли СтрокиТЧТовары.Количество() > 1 Тогда 
		Для Каждого СтрокаТЧТовары Из СтрокиТЧТовары Цикл
			МассивУдаляемыхСтрок.Добавить(СтрокаТЧТовары.НомерСтроки - 1);
		КонецЦикла;
		МассивУдаляемыхСтрок.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
		Для Каждого УдаляемаяСтрока Из МассивУдаляемыхСтрок Цикл
			Объект.Товары.Удалить(УдаляемаяСтрока.Значение);
		КонецЦикла;
		ДобавитьСтроку = Истина;
	КонецЕсли;
	
	Если ДобавитьСтроку Тогда 
		СтруктураОтбора = Новый Структура("ФорматКод",Структура.ФорматКод);
		СтрокаФорматы = Объект.Форматы.НайтиСтроки(СтруктураОтбора);
		НоваяСтрокаТовары = Объект.Товары.Добавить();
		НоваяСтрокаТовары.Номенклатура = Структура.Номенклатура;
		НоваяСтрокаТовары.НоменклатураКод = Структура.НоменклатураКод;
		НоваяСтрокаТовары.Формат = СтрокаФорматы[0].Формат;
		НоваяСтрокаТовары.ФорматКод = Структура.ФорматКод;
		НоваяСтрокаТовары.ТекущееЗначение = Структура.ТекущееЗначение;
		НоваяСтрокаТовары.Состояние = Структура.НовоеЗначение; //ШахматкаПолучитьНовоеСостояниеФормата(Структура);
		НоваяСтрокаТовары.МинимальноеКоличество = Структура.МинимальноеКоличество;
	КонецЕсли;
	
	//пересчет итога по колонке
	тзШахматка = Шахматка.Выгрузить(,"Формат"+Структура.ФорматКод);
	Элементы["ШахматкаФормат"+Структура.ФорматКод].ТекстПодвала = Формат(тзШахматка.Итог("Формат"+Структура.ФорматКод), "ЧН=");
	
КонецПроцедуры

&НаСервере
Функция ШахматкаПолучитьНовоеСостояниеФормата(Структура)
	
	Если Структура.НовоеЗначение = Структура.ТекущееЗначение Тогда
		Состояние = 0;
	ИначеЕсли Структура.НовоеЗначение > Структура.ТекущееЗначение Тогда 
		Состояние = 1;
	ИначеЕсли Структура.НовоеЗначение < Структура.ТекущееЗначение Тогда 
		Состояние = -1;
	КонецЕсли;
	
	Возврат Состояние;
	
КонецФункции

&НаСервере
Процедура ШахматкаУдалитьФорматНаСервере(ФорматКод)
	
	ТаблицаИмя = "Шахматка";
	МассивИменКолонок = Новый Массив;
	ГруппаКолонокФормата = Элементы.ШахматкаГруппаКолонокФорматов.ПодчиненныеЭлементы.Найти(ТаблицаИмя + "ГруппаФормат" + ФорматКод);
	Если ГруппаКолонокФормата = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	МассивРеквизитов = Новый Массив;
	Для Каждого Колонка Из ГруппаКолонокФормата.ПодчиненныеЭлементы Цикл
		МассивРеквизитов.Добавить(ТаблицаИмя +"."+ Сред(Колонка.Имя,9));
	КонецЦикла;
	ИзменитьРеквизиты(,МассивРеквизитов);
	Элементы.Удалить(ГруппаКолонокФормата);
	
	ТоварыУдалитьНаСервере("ФорматКод",ФорматКод);

КонецПроцедуры

&НаКлиенте
Процедура ШахматкаПоказатьТекущиеЗначения(Команда)
	ПоказыватьТекущиеЗначения = Не ПоказыватьТекущиеЗначения;
	Для Каждого ГруппаКолонокФормата Из Элементы.ШахматкаГруппаКолонокФорматов.ПодчиненныеЭлементы Цикл
		Для Каждого Колонка Из ГруппаКолонокФормата.ПодчиненныеЭлементы Цикл
			Если СтрНайти(Колонка.Имя,"ТекущееЗначение") > 15 Тогда
				Колонка.Видимость = ПоказыватьТекущиеЗначения;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ШахматкаПоказатьМинимальноеКоличество(Команда)
	ПоказыватьМинимальноеКоличество = Не ПоказыватьМинимальноеКоличество;
	Для Каждого ГруппаКолонокФормата Из Элементы.ШахматкаГруппаКолонокФорматов.ПодчиненныеЭлементы Цикл
		Для Каждого Колонка Из ГруппаКолонокФормата.ПодчиненныеЭлементы Цикл
			Если СтрНайти(Колонка.Имя,"МинимальноеКоличество") > 15 Тогда
				Колонка.Видимость = ПоказыватьМинимальноеКоличество;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ШахматкаЗаполнитьПоГруппеТоваров(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВсеТоварыВГруппеНоменклатуры",Истина);
	ВызовЗавершения =  Новый ОписаниеОповещения("ШахматкаЗаполнитьПоГруппеТоваровЗавершение",ЭтаФорма,СтруктураПараметров);
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",Новый Структура("РежимВыбора",Истина),ЭтаФорма,,,,
		ВызовЗавершения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ШахматкаЗаполнитьПоГруппеТоваровВАссортиментеУказанныхФорматов(Команда)
	
	СтруктураПараметров = Новый Структура("ТоварыВАсортиментеФорматов",Истина);
	ВызовЗавершения =  Новый ОписаниеОповещения("ШахматкаЗаполнитьПоГруппеТоваровЗавершение",ЭтаФорма,СтруктураПараметров);
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбораГруппы",Новый Структура("РежимВыбора",Истина),ЭтаФорма,,,,
		ВызовЗавершения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ШахматкаЗаполнитьПоГруппеТоваровЗавершение(ГруппаНоменклатуры,СтруктураПараметров) Экспорт
	
	Если ГруппаНоменклатуры = Неопределено Тогда 
		Возврат
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ГруппаНоменклатуры",ГруппаНоменклатуры);
	ШахматкаЗаполнитьИзАссортиментаФорматовНаСервере(СтруктураПараметров);
	
КонецПроцедуры


&НаКлиенте
Процедура ШахматкаЗаполнитьПоВсемТоварамВАссортиментеУказанныхФорматов(Команда)
	
	СтруктураПараметров = Новый Структура("ТоварыВАсортиментеФорматов",Истина);
	ШахматкаЗаполнитьИзАссортиментаФорматовНаСервере(СтруктураПараметров);
	
КонецПроцедуры


&НаКлиенте
Процедура ШахматкаПодборНоменклатуры(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТоварыВСпискеНоменклатуры",Истина);
	СтруктураПараметров.Вставить("ДобавитьСтрки",Истина);

	ВызовЗавершения =  Новый ОписаниеОповещения("ШахматкаЗаполнитьТоварыВСпискеНоменклатурыЗавершение",ЭтаФорма,СтруктураПараметров);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",Новый Структура("РежимВыбора,ПараметрыПодбора",Истина,Новый Структура()),ЭтаФорма,,,,
		ВызовЗавершения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаСервере
Процедура ШахматкаЗаполнитьТоварыВСпискеНоменклатурыЗавершение(РезультатПодбора,СтруктураПараметров) Экспорт
	
	Если РезультатПодбора = Неопределено Тогда 
		Возврат
	КонецЕсли;
//	СписокНоменклатуры = Новый ТаблицаЗначений;
	СписокНоменклатуры = ПолучитьИзВременногоХранилища(РезультатПодбора.Корзина);
	
	СтруктураПараметров.Вставить("СписокНоменклатуры",СписокНоменклатуры.ВыгрузитьКолонку("Номенклатура"));
	ШахматкаЗаполнитьИзАссортиментаФорматовНаСервере(СтруктураПараметров);
	
КонецПроцедуры


//Процедура для заполнения Товаров из произвольного списка значений,
//из группы, либо всеми товарами в ассортименте форматов, с загрузкой текущих значений 
// с сохранением измененных состояний и измененного минимального количества
//	СтруктураПараметров = Новый Структура;
//	СтруктураПараметров.Вставить("ТоварыВАсортиментеФорматов",Булево);
//	СтруктураПараметров.Вставить("ВсеТоварыВГруппеНоменклатуры",Булево);
//	СтруктураПараметров.Вставить("ТоварыВСпискеНоменклатуры" Булево);
//	СтруктураПараметров.Вставить("ГруппаНоменклатуры",СправочникСсылка.Номенклатура);
//	СтруктураПараметров.Вставить("СписокНоменклатуры",СписокЗначений ИЛИ Массив);
//	СтруктураПараметров.Вставить("ДобавитьСтрки",Булево);
//	СтруктураПараметров.Вставить("СохранитьНовыеЗначения",Булево);

&НаСервере
Процедура ШахматкаЗаполнитьИзАссортиментаФорматовНаСервере(СтруктураПараметров)
	
	РежимОтладки = Ложь;
	
	//Тест+
	//РежимОтладки = Истина;
	//Тест-
	
	Если Не ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
		
	Если Не СтруктураПараметров.Свойство("ДобавитьСтрки") Тогда 
		СтруктураПараметров.Вставить("ДобавитьСтрки",Ложь);
	КонецЕсли;

	Если Не СтруктураПараметров.Свойство("ТоварыВАсортиментеФорматов") Тогда 
		СтруктураПараметров.Вставить("ТоварыВАсортиментеФорматов",Ложь);
	КонецЕсли;
	
	Если Не СтруктураПараметров.Свойство("ВсеТоварыВГруппеНоменклатуры") Тогда 
		Если Не СтруктураПараметров.Свойство("ТоварыВСпискеНоменклатуры") Тогда 
			СтруктураПараметров.Вставить("ВсеТоварыВГруппеНоменклатуры",Ложь);
		Иначе 
			СтруктураПараметров.Вставить("ВсеТоварыВГруппеНоменклатуры",СтруктураПараметров.ТоварыВСпискеНоменклатуры);
		КонецЕсли;
	КонецЕсли;
	
	Если Не СтруктураПараметров.Свойство("СохранитьНовыеЗначения") Тогда 
		СтруктураПараметров.Вставить("СохранитьНовыеЗначения",Ложь);
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("ГруппаНоменклатуры") Тогда 
		Номенклатура = СтруктураПараметров.ГруппаНоменклатуры;
	ИначеЕсли СтруктураПараметров.Свойство("СписокНоменклатуры") Тогда 
		Номенклатура = СтруктураПараметров.СписокНоменклатуры;
	Иначе
		Номенклатура = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Форматы.Формат КАК Формат,
		|	Форматы.ФорматКод КАК ФорматКод
		|ПОМЕСТИТЬ ТЧФорматы0
		|ИЗ
		|	&ТЧФорматы КАК Форматы
		|ГДЕ
		|	НЕ Форматы.НеУчаствуетВДвижениях
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Форматы.Формат КАК Формат,
		|	Форматы.ФорматКод КАК ФорматКод
		|ПОМЕСТИТЬ ТЧФорматы
		|ИЗ
		|	ТЧФорматы0 КАК Форматы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.ФорматыКатегорий.ПустаяСсылка),
		|	""""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АссортиментФорматовСрезПоследних.Формат КАК Формат,
		|	АссортиментФорматовСрезПоследних.Номенклатура КАК Номенклатура,
		|	АссортиментФорматовСрезПоследних.МинимальноеКоличество КАК МинимальноеКоличество,
		|	ИСТИНА КАК ТекущееЗначение
		|ПОМЕСТИТЬ АссортиментФорматовСрезПоследних
		|ИЗ
		|	РегистрСведений.АссортиментФорматов.СрезПоследних(
		|			&Дата,
		|			(НЕ ДатаОкончанияДействия < &Дата
		|				ИЛИ ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
		//|				И Состояние = &ПеречисленияСостоянияВведен
		|				И Формат В (&СписокФорматов)
		|				И Номенклатура В ИЕРАРХИИ (&Номенклатура)) КАК АссортиментФорматовСрезПоследних
		|ГДЕ
		|	АссортиментФорматовСрезПоследних.Состояние=ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АссортиментФорматовСрезПоследних.Номенклатура КАК Номенклатура,
		|	СправочникНоменклатура.Код КАК НоменклатураКод
		|ПОМЕСТИТЬ СписокНоменклатуры
		|ИЗ
		|	АссортиментФорматовСрезПоследних КАК АссортиментФорматовСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО АссортиментФорматовСрезПоследних.Номенклатура = СправочникНоменклатура.Ссылка
		|ГДЕ
		|	&ТоварыВАсортиментеФорматов
		|
		|СГРУППИРОВАТЬ ПО
		|	АссортиментФорматовСрезПоследних.Номенклатура,
		|	СправочникНоменклатура.Код
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СправочникНоменклатура.Ссылка,
		|	СправочникНоменклатура.Код
		|ИЗ
		|	Справочник.Номенклатура КАК СправочникНоменклатура
		|ГДЕ
		|	&ТоварыВГруппеНоменклатуры
		|	И СправочникНоменклатура.Ссылка В ИЕРАРХИИ(&Номенклатура)
		|	И СправочникНоменклатура.ЭтоГруппа = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧФорматы.Формат КАК Формат,
		|	ТЧФорматы.ФорматКод КАК ФорматКод,
		|	СписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СписокНоменклатуры.НоменклатураКод КАК НоменклатураКод
		|ПОМЕСТИТЬ ВсеФорматыИНоменклатура
		|ИЗ
		|	ТЧФорматы КАК ТЧФорматы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокНоменклатуры КАК СписокНоменклатуры
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
	
		
	
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		
	ИначеЕсли ТипЗнч(Номенклатура) = Тип("СписокЗначений")
				Или ТипЗнч(Номенклатура) = Тип("Массив") Тогда
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"В ИЕРАРХИИ (&Номенклатура)","В (&Номенклатура)");
	Иначе
		Запрос.УстановитьПараметр("Номенклатура",Справочники.Номенклатура.ПустаяСсылка());
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Номенклатура В ИЕРАРХИИ (&Номенклатура)","");
	КонецЕсли;
	
	Если СтруктураПараметров.СохранитьНовыеЗначения Тогда 
		
		Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ
		|	НовыеЗначения.МинимальноеКоличество КАК МинимальноеКоличество,
		|	НовыеЗначения.Состояние КАК Состояние,
		|	НовыеЗначения.Формат КАК Формат,
		|	НовыеЗначения.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ НовыеЗначения
		|ИЗ
		|	&НовыеЗначения КАК НовыеЗначения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеФорматыИНоменклатура.Формат КАК Формат,
		|	МАКСИМУМ(ВсеФорматыИНоменклатура.ФорматКод) КАК ФорматКод,
		|	ВсеФорматыИНоменклатура.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВсеФорматыИНоменклатура.НоменклатураКод) КАК НоменклатураКод,
		|	МАКСИМУМ(ЕСТЬNULL(НовыеЗначения.МинимальноеКоличество, ЕСТЬNULL(АссортиментФорматовСрезПоследних.МинимальноеКоличество, 0))) КАК МинимальноеКоличество,
		|	МАКСИМУМ(ЕСТЬNULL(НовыеЗначения.Состояние, ЕСТЬNULL(АссортиментФорматовСрезПоследних.ТекущееЗначение, ЛОЖЬ))) КАК Состояние,
		|	МАКСИМУМ(ЕСТЬNULL(АссортиментФорматовСрезПоследних.ТекущееЗначение, ЛОЖЬ)) КАК ТекущееЗначение
		|ИЗ
		|	ВсеФорматыИНоменклатура КАК ВсеФорматыИНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ АссортиментФорматовСрезПоследних КАК АссортиментФорматовСрезПоследних
		|		ПО ВсеФорматыИНоменклатура.Формат = АссортиментФорматовСрезПоследних.Формат
		|			И ВсеФорматыИНоменклатура.Номенклатура = АссортиментФорматовСрезПоследних.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ НовыеЗначения КАК НовыеЗначения
		|		ПО ВсеФорматыИНоменклатура.Формат = НовыеЗначения.Формат
		|			И ВсеФорматыИНоменклатура.Номенклатура = НовыеЗначения.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеФорматыИНоменклатура.Формат,
		|	ВсеФорматыИНоменклатура.Номенклатура";
		
		Запрос.УстановитьПараметр("НовыеЗначения",Объект.Товары.Выгрузить(,"Номенклатура, Формат, Состояние, МинимальноеКоличество"));
		
		
	Иначе Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ
		|	ВсеФорматыИНоменклатура.Формат КАК Формат,
		|	МАКСИМУМ(ВсеФорматыИНоменклатура.ФорматКод) КАК ФорматКод,
		|	ВсеФорматыИНоменклатура.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВсеФорматыИНоменклатура.НоменклатураКод) КАК НоменклатураКод,
		|	МАКСИМУМ(ЕСТЬNULL(АссортиментФорматовСрезПоследних.МинимальноеКоличество, 0)) КАК МинимальноеКоличество,
		|	МАКСИМУМ(ЕСТЬNULL(АссортиментФорматовСрезПоследних.ТекущееЗначение, ЛОЖЬ)) КАК Состояние,
		|	МАКСИМУМ(ЕСТЬNULL(АссортиментФорматовСрезПоследних.ТекущееЗначение, ЛОЖЬ)) КАК ТекущееЗначение
		|ИЗ
		|	ВсеФорматыИНоменклатура КАК ВсеФорматыИНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ АссортиментФорматовСрезПоследних КАК АссортиментФорматовСрезПоследних
		|		ПО ВсеФорматыИНоменклатура.Формат = АссортиментФорматовСрезПоследних.Формат
		|			И ВсеФорматыИНоменклатура.Номенклатура = АссортиментФорматовСрезПоследних.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеФорматыИНоменклатура.Формат,
		|	ВсеФорматыИНоменклатура.Номенклатура";
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ТоварыВГруппеНоменклатуры",СтруктураПараметров.ВсеТоварыВГруппеНоменклатуры);
	Запрос.УстановитьПараметр("ТоварыВАсортиментеФорматов",СтруктураПараметров.ТоварыВАсортиментеФорматов);
	
	ТЗФорматы = Объект.Форматы.Выгрузить(,"Формат,ФорматКод,НеУчаствуетВДвижениях");
	Запрос.УстановитьПараметр("ТЧФорматы", ТЗФорматы);
	Запрос.УстановитьПараметр("СписокФорматов", ТЗФорматы.ВыгрузитьКолонку("Формат"));
	
	Запрос.УстановитьПараметр("Дата",Объект.ДатаНачалаДействия-1);
	Запрос.УстановитьПараметр("ПеречисленияСостоянияВведен", Перечисления.СостоянияТовараВАссортименте.Введен);
	
	Если РежимОтладки Тогда 
		МВТШахматка = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МВТШахматка;
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		СодержимоеМВТ = МВТ(МВТШахматка);
	Иначе
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
		
	Если СтруктураПараметров.ДобавитьСтрки Тогда
		Для Каждого СтрокаРезультатаЗапроса Из РезультатЗапроса Цикл
			НоваяСтрокаТовары = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары,СтрокаРезультатаЗапроса);
		КонецЦикла;
	Иначе
		Объект.Товары.Очистить();
		Объект.Товары.Загрузить(РезультатЗапроса);
	КонецЕсли;
	
	ШахматкаОбновитьНаСервере();
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////

// Получает одну временную таблицу с данными из МенеджерВременныхТаблиц или из запроса.
//
// МенеджерВТ - МенеджерВременныхТаблиц или запрос, из которого берем МенеджерВременныхТаблиц.
// ИмяВнутреннейТаблицы - имя временной таблицы.
//
Функция ВТ(МенеджерВТ, ИмяВнутреннейТаблицы) 
	
	ЗапросТМП = Новый Запрос;
	Если ТипЗнч(МенеджерВТ) = Тип("МенеджерВременныхТаблиц") Тогда
		ЗапросТМП.МенеджерВременныхТаблиц = МенеджерВТ;
	ИначеЕсли ТипЗнч(МенеджерВТ) = Тип("Запрос") Тогда
		ЗапросТМП.МенеджерВременныхТаблиц = МенеджерВТ.МенеджерВременныхТаблиц; // Копируем ссылку на временные таблицы
	Иначе
		Возврат "Не определил менеджер временных таблиц";
	КонецЕсли;
	
	ЗапросТМП.Текст="
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	"+ИмяВнутреннейТаблицы+" КАК Таблица";
	
	Возврат ЗапросТМП.Выполнить().Выгрузить();
	
КонецФункции


//////////////////////////////////////////////////////////////////////////
// Не работает на платформе ниже 8.3.8 !

// Получает список всех временных таблиц с данными из МенеджерВременныхТаблиц или из запроса.
// 
// МенеджерВТ - МенеджерВременныхТаблиц или запрос, из которого берем МенеджерВременныхТаблиц.
//
Функция МВТ(МенеджерВТ) 
	
	Если ТипЗнч(МенеджерВТ) = Тип("МенеджерВременныхТаблиц") Тогда
		МенеджерТаблиц = МенеджерВТ;
	ИначеЕсли ТипЗнч(МенеджерВТ) = Тип("Запрос") Тогда
		МенеджерТаблиц = МенеджерВТ.МенеджерВременныхТаблиц; // Копируем ссылку на временные таблицы
	Иначе
		Возврат "Не определил менеджер временных таблиц";
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Для Каждого ВрмТаблица Из МенеджерТаблиц.Таблицы Цикл
		ИмяВрмТаблица = ВрмТаблица.ПолноеИмя;
		Результат.Вставить(ИмяВрмТаблица, ВТ(МенеджерТаблиц, ИмяВрмТаблица));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////


&НаКлиенте
Процедура ШахматкаНоменклатураПриИзменении(Элемент)
	
	ТекДанные = Элементы.Шахматка.ТекущиеДанные;
	ТекЗначения = ШахматкаНоменклатураПриИзмененииНаСервере(ТекДанные.Номенклатура);
	ИндексТекСтроки = Элементы.Шахматка.ТекущаяСтрока;
	ТекСтрока = Шахматка.НайтиПоИдентификатору(ИндексТекСтроки);
	ЗаполнитьЗначенияСвойств(ТекСтрока,ТекЗначения);
	
КонецПроцедуры //ШахматкаНоменклатураПриИзменении()

&НаСервере
Функция ШахматкаНоменклатураПриИзмененииНаСервере(Номенклатура)
	
	//----Отображение категории----
	
	//УровеньКатегории = ПолучитьЗначениеУчетнойПолитики("УровеньКатегорииНоменклатуры",, Объект.Дата);
	//Если УровеньКатегории<>0 Тогда
	//	ТекущиеДанные = Шахматка.НайтиПоИдентификатору(Элементы.Шахматка.ТекущаяСтрока);

	//	Запрос = Новый Запрос("
	//	|ВЫБРАТЬ
	//	|	Группа
	//	|ИЗ
	//	|	РегистрСведений.СтруктураИерархииНоменклатуры
	//	|ГДЕ
	//	|	Номенклатура=&Родитель
	//	|	И Уровень=&УровеньКатегории");
	//	Запрос.УстановитьПараметр("Номенклатура", Номенклатура.Родитель);
	//	Запрос.УстановитьПараметр("УровеньКатегории", УровеньКатегории - 1);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		ТекущиеДанные.Категория = Выборка.Группа;
	//	КонецЕсли;
	//КонецЕсли;
	
	//-----------------------------
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АссортиментФорматовСрезПоследних.Формат КАК Формат,
		|	АссортиментФорматовСрезПоследних.Номенклатура КАК Номенклатура,
		|	АссортиментФорматовСрезПоследних.МинимальноеКоличество КАК МинимальноеКоличество,
		|	ВЫБОР
		|		КОГДА АссортиментФорматовСрезПоследних.Состояние = &ПеречисленияСостоянияВведен
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТекущееЗначение,
		|	ФорматыКатегорий.Код КАК ФорматКод,
		|	0 КАК Состояние
		|ИЗ
		|	РегистрСведений.АссортиментФорматов.СрезПоследних(&Дата, Номенклатура = &Номенклатура И Формат В (&Форматы)) КАК АссортиментФорматовСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФорматыКатегорий КАК ФорматыКатегорий
		|		ПО АссортиментФорматовСрезПоследних.Формат = ФорматыКатегорий.Ссылка";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Форматы", Объект.Форматы.Выгрузить(,"Формат").ВыгрузитьКолонку("Формат"));
	Запрос.УстановитьПараметр("ПеречисленияСостоянияВведен", Перечисления.СостоянияТовараВАссортименте.Введен);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Номенклатура", Номенклатура);
	Пока Выборка.Следующий() Цикл 
		НоваяСтрокаТовары = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Выборка,НоваяСтрокаТовары);
		СтруктураВозврата.Вставить("Формат"+Выборка.ФорматКод,Выборка.ТекущееЗначение);
		СтруктураВозврата.Вставить("Формат"+Выборка.ФорматКод+"ТекущееЗначение",Выборка.ТекущееЗначение);
		СтруктураВозврата.Вставить("Формат"+Выборка.ФорматКод+"МинимальноеКоличество",Выборка.МинимальноеКоличество);
	КонецЦикла;
	
	Возврат СтруктураВозврата
	
КонецФункции

&НаКлиенте
Процедура ФорматыПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.Форматы.ТекущиеДанные;
	ШахматкаУдалитьФорматНаСервере(ТекДанные.ФорматКод);
	ДеревоФоматовИзменитьПометкуФормата(ТекДанные.Формат,Ложь,Ложь);
	ДеревоФоматовРазвернутьВсеУровни(Элементы.ДеревоФорматов,ДеревоФорматов.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура ФорматыФорматПриИзменении(Элемент)
//	ТекСтрока = Элементы.Форматы.ТекущаяСтрока;
	ТекДанные = Элементы.Форматы.ТекущиеДанные;
//	Если ЗначениеЗаполнено(ТекДанные.Формат) Тогда
////		ШахматкаДобавитьФорматНаСервере(ТекДанные.Формат,,ТекДанные.НомерСтроки-1);
//	КонецЕсли;
	ФорматыДобавитьФорматНаСервере(ТекДанные.НомерСтроки-1);
	ШахматкаОбновитьНаСервере();
	ДеревоФорматовОбновитьНаСервере();
	ДеревоФоматовРазвернутьВсеУровни(Элементы.ДеревоФорматов,ДеревоФорматов.ПолучитьЭлементы());

КонецПроцедуры

&НаСервере
Процедура ФорматыДобавитьФорматНаСервере(Индекс)

	СтрокаТЧ = Объект.Форматы.НайтиПоИдентификатору(Индекс);
	
	Если (НЕ СтрокаТЧ = Неопределено) Тогда 
		Если ЗначениеЗаполнено(СтрокаТЧ.Формат) Тогда 
			СтрокаТЧ.ФорматКод = СтрокаТЧ.Формат.Код;
			СтрокаТЧ.НеУчаствуетВДвижениях = СтрокаТЧ.Формат.НеУчаствуетВДвижениях;
		Иначе
			СтрокаТЧ.ФорматКод = ""
		КонецЕсли;;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДеревоФоматовИзменитьПометкуФормата(Формат,НовоеЗначение,ФорматНайден)
	ЗначениеДереваФорматов = РеквизитФормыВЗначение("ДеревоФорматов");
	ДеревоФоматовИзменитьПометкуФорматаВРекурсии(ЗначениеДереваФорматов,Формат,НовоеЗначение,ФорматНайден);
	ЗначениеВРеквизитФормы(ЗначениеДереваФорматов,"ДеревоФорматов");
КонецПроцедуры

&НаСервере
Процедура ДеревоФоматовИзменитьПометкуФорматаВРекурсии(ВеткаДерева=Неопределено,Формат,НовоеЗначение,ФорматНайден)
	Если ВеткаДерева=Неопределено Тогда 
		ВеткаДерева = РеквизитФормыВЗначение("ДеревоФорматов");
	КонецЕсли;
	Для Каждого Строка Из ВеткаДерева.Строки Цикл
		Если ФорматНайден Тогда Возврат КонецЕсли;
		Если Строка.Формат = Формат Тогда 
			Строка.Пометка = НовоеЗначение;
			ФорматНайден = Истина;
		Иначе
			ДеревоФоматовИзменитьПометкуФорматаВРекурсии(Строка,Формат,НовоеЗначение,ФорматНайден);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФоматовРазвернутьВсеУровни(ЭлементФормыДерево, ВеткаДерева) 
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		ЭлементФормыДерево.Развернуть(ТекущаяСтрока.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФорматовСвернутьВсеУровни(ЭлементФормыДерево, ВеткаДерева) 
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		ВложенныеСтроки = ТекущаяСтрока.ПолучитьЭлементы();
		Если ВложенныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		ДеревоФорматовСвернутьВсеУровни(ЭлементФормыДерево, ВложенныеСтроки);
		ЭлементФормыДерево.Свернуть(ТекущаяСтрока.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ДеревоФоматовРазвернутьПомеченныеСтроки(ЭлементФормыДерево, ВеткаДерева) 
	
	Результат = Ложь;
	
	Для Каждого ТекущаяСтрока Из ВеткаДерева Цикл
		Если ТекущаяСтрока.Пометка Тогда
			Результат = Истина;
		КонецЕсли;
		ВложенныеСтроки = ТекущаяСтрока.ПолучитьЭлементы();
		Если ВложенныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ДеревоФоматовРазвернутьПомеченныеСтроки(ЭлементФормыДерево, ВложенныеСтроки) Тогда
			ЭлементФормыДерево.Развернуть(ТекущаяСтрока.ПолучитьИдентификатор(), Ложь);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДеревоФорматовПометкаПриИзменении(Элемент)
	ТекДанные = Элементы.ДеревоФорматов.ТекущиеДанные;
	Если ТекДанные.НеУчаствуетВДвижениях Тогда 
		ДеревоФорматовПометкаГруппыПриИзмененииНаСервере(ТекДанные.Формат,ТекДанные.Пометка);
	КонецЕсли;
	ДеревоФорматовПометкаПриИзмененииНаСервере(ТекДанные.Формат,ТекДанные.Пометка,ТекДанные.ФорматКод,ТекДанные.НеУчаствуетВДвижениях);
	ДеревоФоматовРазвернутьВсеУровни(Элементы.ДеревоФорматов,ДеревоФорматов.ПолучитьЭлементы());
КонецПроцедуры

&НаСервере
Процедура ДеревоФорматовПометкаГруппыПриИзмененииНаСервере(Формат,Пометка)
	ЗначениеДереваФорматов = РеквизитФормыВЗначение("ДеревоФорматов",Тип("ДеревоЗначений"));
	СтрокаФормата = ЗначениеДереваФорматов.Строки.Найти(Формат,"Формат",Истина);
	ДеревоФорматовИзменитьВсеФлажкиНаСервереВРекурсии(СтрокаФормата,Пометка);
	СтрокаФормата.Пометка = Пометка;
	ЗначениеВРеквизитФормы(ЗначениеДереваФорматов,"ДеревоФорматов");
КонецПроцедуры

&НаСервере
Процедура ДеревоФорматовПометкаПриИзмененииНаСервере(Формат,Пометка,ФорматКод,НеУчаствуетВДвижениях = Ложь)
	//Если НеУчаствуетВДвижениях Тогда 
	//	Возврат
	//КонецЕсли;
	СтрокиФормата = Объект.Форматы.НайтиСтроки(Новый Структура("Формат",Формат));
	Если Пометка Тогда 
		Если СтрокиФормата.Количество() = 0 Тогда
			НоваяСтрока = Объект.Форматы.Добавить();
			НоваяСтрока.Формат = Формат;
			НоваяСтрока.ФорматКод = ФорматКод;
			НоваяСтрока.НеУчаствуетВДвижениях = НеУчаствуетВДвижениях;
			ШахматкаДобавитьФорматНаСервере(Формат,ФорматКод,,НеУчаствуетВДвижениях);
		КонецЕсли;
	Иначе
		Если СтрокиФормата.Количество() > 0 Тогда
			ФорматУдален = Ложь;
			Для Каждого СтрокаФормата Из Объект.Форматы Цикл
				Если СтрокаФормата.Формат = Формат Тогда 
					Если Не ФорматУдален Тогда
						ШахматкаУдалитьФорматНаСервере(СтрокаФормата.ФорматКод);
						ФорматУдален = Истина;
					КонецЕсли;
					Объект.Форматы.Удалить(СтрокаФормата.НомерСтроки - 1);
					Возврат;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДеревоФорматовОбновитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектФорматы.Формат КАК Формат
	|ПОМЕСТИТЬ ОбъектФорматы
	|ИЗ
	|	&ОбъектФорматы КАК ОбъектФорматы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФорматыКатегорий.Ссылка КАК Формат,
	|	ФорматыКатегорий.Код КАК ФорматКод,
	|	ФорматыКатегорий.НеУчаствуетВДвижениях КАК НеУчаствуетВДвижениях,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОбъектФорматы.Формат ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК Пометка
	|ИЗ
	|	Справочник.ФорматыКатегорий КАК ФорматыКатегорий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъектФорматы КАК ОбъектФорматы
	|		ПО ФорматыКатегорий.Ссылка = ОбъектФорматы.Формат
	|ГДЕ
	|	НЕ ФорматыКатегорий.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ФорматыКатегорий.Ссылка,
	|	ФорматыКатегорий.Код
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФорматыКатегорий.Порядок ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ОбъектФорматы",Объект.Форматы.Выгрузить(,"Формат"));
	Дерево=Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(Дерево,"ДеревоФорматов");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФорматовУстановитьВсеФлажки(Команда)
	ДеревоФорматовИзменитьВсеФлажкиНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФорматовСнятьВсеФлажки(Команда)
	ДеревоФорматовИзменитьВсеФлажкиНаСервере(Ложь);
КонецПроцедуры

&НаСервере
Процедура ДеревоФорматовИзменитьВсеФлажкиНаСервере(Пометка)
	ЗначениеДереваФорматов = РеквизитФормыВЗначение("ДеревоФорматов");
	ДеревоФорматовИзменитьВсеФлажкиНаСервереВРекурсии(ЗначениеДереваФорматов,Пометка);
	ЗначениеВРеквизитФормы(ЗначениеДереваФорматов,"ДеревоФорматов");
КонецПроцедуры

&НаСервере
Процедура ДеревоФорматовИзменитьВсеФлажкиНаСервереВРекурсии(ВеткаДерева,Пометка)
	Для Каждого ТекущаяСтрока Из ВеткаДерева.Строки Цикл
		Если (Не ТекущаяСтрока.Пометка = Пометка) Тогда
			ТекущаяСтрока.Пометка = Пометка;
			ДеревоФорматовИзменитьВсеФлажкиНаСервереВРекурсии(ТекущаяСтрока,Пометка);
			ДеревоФорматовПометкаПриИзмененииНаСервере(ТекущаяСтрока.Формат,Пометка,ТекущаяСтрока.ФорматКод,ТекущаяСтрока.НеУчаствуетВДвижениях);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФорматовРазвернутьВсеСтроки(Команда)
	ДеревоФоматовРазвернутьВсеУровни(Элементы.ДеревоФорматов,ДеревоФорматов.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФорматовСвернутьВсеСтроки(Команда)
	ДеревоФорматовСвернутьВсеУровни(Элементы.ДеревоФорматов, ДеревоФорматов.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияДействияПриИзменении(Элемент)
	Если Не ПроверитьПравильностьЗаполненияДаты() Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата окончания должна быть не раньше даты начала действия и даты документа",,"ДатаОкончанияДействия","Объект.ДатаОкончанияДействия");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПроверитьПравильностьЗаполненияДаты(Отказ=Ложь)
	Если (Не Объект.ДатаОкончанияДействия = '00010101')
		И (Объект.ДатаОкончанияДействия < Объект.ДатаНачалаДействия
			Или Объект.ДатаОкончанияДействия < Объект.Дата) Тогда 
		Отказ = Истина;
	КонецЕсли;
	Возврат Не Отказ;
КонецФункции

&НаКлиенте
Процедура ФорматыПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматыПереместитьВниз(Команда)
	ТекДанные = Элементы.Форматы.ТекущиеДанные;
	ФорматыПереместитьВнизНаСервере(ТекДанные.НомерСтроки-1);
	Элементы.Форматы.Обновить();
КонецПроцедуры

&НаСервере
Процедура ФорматыПереместитьВнизНаСервере(ТекСтрока)
	Если ТекСтрока < Объект.Форматы.Количество()-1 Тогда
		Объект.Форматы.Сдвинуть(ТекСтрока,1);
		ШахматкаОбновитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФорматыПереместитьВверх(Команда)
	ТекДанные = Элементы.Форматы.ТекущиеДанные;
	ФорматыПереместитьВверхНаСервере(ТекДанные.НомерСтроки-1);
	Элементы.Форматы.Обновить();
КонецПроцедуры

&НаСервере
Процедура ФорматыПереместитьВверхНаСервере(ТекСтрока)
	Если ТекСтрока > 0 Тогда
		Объект.Форматы.Сдвинуть(ТекСтрока,-1);
		ШахматкаОбновитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ТоварыУдалитьНаСервере(Колонка,Значение)
	СтруктураОтбора = Новый Структура(Колонка,Значение);
	СтрокиПоОтбору = Объект.Товары.НайтиСтроки(СтруктураОтбора);
	Если (НЕ СтрокиПоОтбору.Количество() > 0) Тогда 
		Возврат
	КонецЕсли;
	СписокИндексов = Новый СписокЗначений;
	Для Каждого УдаляемаяСтрока Из СтрокиПоОтбору Цикл 
		СписокИндексов.Добавить(УдаляемаяСтрока.НомерСтроки - 1)
	КонецЦикла;
	СписокИндексов.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	Для Каждого ИндексУдаляемойСтроки Из СписокИндексов Цикл
		Объект.Товары.Удалить(ИндексУдаляемойСтроки.Значение);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ШахматкаПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.Шахматка.ТекущиеДанные;
	ТоварыУдалитьНаСервере("Номенклатура",ТекДанные.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоФорматовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ШахматкаПоказатьПанельТоваров(Команда)
	
	ОтобразитьПанельТоваров = НЕ ОтобразитьПанельТоваров;
	Элементы.ШахматкаКнопкаПоказатьПанельТоваров.Пометка = ОтобразитьПанельТоваров;
		
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры //ШахматкаПоказатьПанельТоваров()

&НаСервере
Процедура ГрупповаяОбработкаИзмененияЗначенийШахматкиНаСервере(МассивЗначений)
	
	Для Каждого Структура Из МассивЗначений Цикл
		ШахматкаПриИзмененииЗначенияНаСервере(Структура);
	КонецЦикла;
	
КонецПроцедуры //ГрупповаяОбработкаИзмененияЗначенийШахматкиНаСервере()

&НаКлиенте
Процедура ШахматкаУстановитьСнятьФлажки(Команда)
	
	МассивЗначений = Новый Массив;
	
	Для Каждого текФормат Из Объект.Форматы Цикл
		
		Если текФормат.НеУчаствуетВДвижениях Тогда Продолжить; КонецЕсли;
		
		КолонкаИмя = "Формат" + текФормат.ФорматКод;
		НовоеЗначение = СтрНайти(Команда.Имя,"Снять")=0;
		
		Для Каждого ВыделеннаяСтрока Из Элементы.Шахматка.ВыделенныеСтроки Цикл
			
			ТекДанные = Элементы.Шахматка.ДанныеСтроки(ВыделеннаяСтрока);
			ТекДанные[КолонкаИмя] = НовоеЗначение;
			
			Структура = Новый Структура;
			Структура.Вставить("Операция",				0);
			Структура.Вставить("Номенклатура",			ТекДанные.Номенклатура);
			Структура.Вставить("НоменклатураКод",		ТекДанные.НоменклатураКод);
			Структура.Вставить("ФорматКод",				Сред(КолонкаИмя,7));
			Структура.Вставить("НовоеЗначение",			ТекДанные[КолонкаИмя]);
			Структура.Вставить("ТекущееЗначение",		ТекДанные[КолонкаИмя+"ТекущееЗначение"]);
			Структура.Вставить("МинимальноеКоличество",	ТекДанные[КолонкаИмя+"МинимальноеКоличество"]);
			
			//ШахматкаПриИзмененииЗначенияНаСервере(Структура);
			МассивЗначений.Добавить(Структура);
			
		КонецЦикла;
	КонецЦикла;
	
	//для ускорения, обработаем одним разом на сервере
	Если МассивЗначений.Количество()>0 Тогда
		ГрупповаяОбработкаИзмененияЗначенийШахматкиНаСервере(МассивЗначений);
	КонецЕсли;
	
КонецПроцедуры //ШахматкаУстановитьСнятьФлажки()

&НаКлиенте
Процедура ПоискВТаблицеТовары(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПоискВТаблицеТоварыРезультатОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ПоискВТаблицеТоварыРезультатОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ШтрихКодДляПоиска = РезультатОповещения;
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ПоискПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКоду(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ДобавлениеНовыхПозицийПоШтрихКодуОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКодуОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ДобавлениеНовыхПозицийПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтборВТаблицеТовары(Команда)
	Элементы.Товары.ОтборСтрок = Неопределено;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ШтрихКодДляПоиска = "";
