// @strict-types


#Область СлужебныйПрограммныйИнтерфейс

#Область Черновик

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения - результат: см. ЗаписатьЧерновикВЦентрЭДОЗавершение
//  Доверенность - СправочникСсылка.МЧД003
//  АдресДанныхФайлаМЧД - Строка
//  ФормаВладелец - Неопределено,ФормаКлиентскогоПриложения
Процедура ЗаписатьЧерновикВЦентрЭДО(ОповещениеОЗавершении, Доверенность, АдресДанныхФайлаМЧД, ФормаВладелец = Неопределено) Экспорт
	
	КонтекстЗаписи = НовыйКонтекстЗаписиЧерновикаВЦентрЭДО();
	КонтекстЗаписи.ОповещениеОЗавершении = ОповещениеОЗавершении;
	
	ИдентификаторФормы = Неопределено;
	Если ФормаВладелец <> Неопределено Тогда
		ИдентификаторФормы = ФормаВладелец.УникальныйИдентификатор;
	КонецЕсли;
	
	ДлительнаяОперация = МашиночитаемыеДоверенностиИнтеграцияЦентраЭДОВызовСервера.ЗаписатьЧерновикВЦентрЭДОВФоне(
		Доверенность, АдресДанныхФайлаМЧД, ИдентификаторФормы);
	
	Оповещение = Новый ОписаниеОповещения("ЗаписатьЧерновикВЦентрЭДОЗавершение", ЭтотОбъект, КонтекстЗаписи);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ФормаВладелец);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузитьВЦентрЭДО

// Параметры:
//  ОповещениеОЗавершении - ОписаниеОповещения - результат: см. ВыгрузитьВЦентрЭДОЗавершение
//  Доверенности - Массив из ОпределяемыйТип.МашиночитаемаяДоверенность
//  ФормаВладелец - Неопределено,ФормаКлиентскогоПриложения
Процедура ВыгрузитьВЦентрЭДО(ОповещениеОЗавершении, Доверенности, ФормаВладелец = Неопределено) Экспорт
	
	Если Не НастройкиЭДОВызовСервера.ИспользоватьИнтеграциюЦентраЭДО() Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстВыгрузки = НовыйКонтекстВыгрузкиВЦентрЭДО();
	КонтекстВыгрузки.ОповещениеОЗавершении = ОповещениеОЗавершении;
	КонтекстВыгрузки.Доверенности = Доверенности;
	
	Если ТипЗнч(ФормаВладелец) = Тип("ФормаКлиентскогоПриложения") Тогда
		КонтекстВыгрузки.ФормаВладелец = ФормаВладелец;
		КонтекстВыгрузки.ИдентификаторФормы = ФормаВладелец.УникальныйИдентификатор;
	КонецЕсли;
	
	ДлительнаяОперация =
		МашиночитаемыеДоверенностиИнтеграцияЦентраЭДОВызовСервера.ВыгрузитьВФонеДляЕдинственнойУчетнойЗаписиЦентраЭДО(
			КонтекстВыгрузки.Доверенности, КонтекстВыгрузки.ИдентификаторФормы);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("ВыгрузитьПослеВыбораУчетныхЗаписейЦентровЭДО",
			ЭтотОбъект, КонтекстВыгрузки);
		ЗаголовокФормы = НСтр("ru = 'Выбор учетных записей для выгрузки доверенности.'");
		ИнтеграцияЦентраЭДОКлиент.ОткрытьВыборУчетныхЗаписейЦентровЭДО(Оповещение,
			КонтекстВыгрузки.ФормаВладелец, ЗаголовокФормы);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ВыгрузитьВЦентрЭДОЗавершение", ЭтотОбъект, КонтекстВыгрузки);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(КонтекстВыгрузки.ФормаВладелец);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Черновик

// Возвращаемое значение:
//  Структура:
//  * ОповещениеОЗавершении - см. ВыгрузитьВЦентрЭДО.ОповещениеОЗавершении
Функция НовыйКонтекстЗаписиЧерновикаВЦентрЭДО()
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОЗавершении", Новый ОписаниеОповещения);
	Возврат Контекст;
	
КонецФункции

// Параметры:
//  ДлительнаяОперация - Неопределено
//                     - см. ДлительныеОперации.ВыполнитьФункцию
//  КонтекстЗаписи - см. НовыйКонтекстЗаписиЧерновикаВЦентрЭДО
// 
// Возвращаемое значение:
//  См. МашиночитаемыеДоверенностиИнтеграцияЦентраЭДО.ЗаписатьЧерновикВЦентрЭДО
Функция ЗаписатьЧерновикВЦентрЭДОЗавершение(ДлительнаяОперация, КонтекстЗаписи) Экспорт
	
	ВидОперации = МашиночитаемыеДоверенностиИнтеграцияЦентраЭДОКлиентСервер.ВидОперацииЗаписьЧерновикаВЦентрЭДО();
	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	
	РезультатЗаписи = ОбщегоНазначенияБЭДКлиент.РезультатВыполненияФоновогоЗадания(
		ВидОперации, ДлительнаяОперация, КонтекстДиагностики); // См. МашиночитаемыеДоверенностиИнтеграцияЦентраЭДО.ЗаписатьЧерновикВЦентрЭДО
	
	Если РезультатЗаписи = Неопределено Тогда
		РезультатЗаписи = Новый Структура("Успех, КонтекстДиагностики", Ложь, КонтекстДиагностики);
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(КонтекстЗаписи.ОповещениеОЗавершении, РезультатЗаписи);
	
	Возврат РезультатЗаписи;
	
КонецФункции

#КонецОбласти

#Область ВыгрузитьВЦентрЭДО

// Возвращаемое значение:
//  Структура:
//  * ОповещениеОЗавершении - см. ВыгрузитьВЦентрЭДО.ОповещениеОЗавершении
//  * Доверенности - см. ВыгрузитьВЦентрЭДО.Доверенности
//  * ФормаВладелец - см. ВыгрузитьВЦентрЭДО.ФормаВладелец
//  * ИдентификаторФормы - Неопределено,УникальныйИдентификатор
Функция НовыйКонтекстВыгрузкиВЦентрЭДО()
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОЗавершении", Новый ОписаниеОповещения);
	Контекст.Вставить("Доверенности", Новый Массив);
	Контекст.Вставить("ФормаВладелец", Неопределено);
	Контекст.Вставить("ИдентификаторФормы", Неопределено);
	Возврат Контекст;
	
КонецФункции

// Параметры:
//  УчетныеЗаписиЦентровЭДО - Неопределено,Массив из СправочникСсылка.УчетныеЗаписиЦентровЭДО
//  КонтекстВыгрузки - см. НовыйКонтекстВыгрузкиВЦентрЭДО
Процедура ВыгрузитьПослеВыбораУчетныхЗаписейЦентровЭДО(УчетныеЗаписиЦентровЭДО, КонтекстВыгрузки) Экспорт
	
	Если Не ЗначениеЗаполнено(УчетныеЗаписиЦентровЭДО) Тогда
		ВыгрузитьВЦентрЭДОЗавершение(Неопределено, КонтекстВыгрузки);
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = МашиночитаемыеДоверенностиИнтеграцияЦентраЭДОВызовСервера.ВыгрузитьВФоне(
		УчетныеЗаписиЦентровЭДО, КонтекстВыгрузки.Доверенности, КонтекстВыгрузки.ИдентификаторФормы);
	
	Оповещение = Новый ОписаниеОповещения("ВыгрузитьВЦентрЭДОЗавершение", ЭтотОбъект, КонтекстВыгрузки);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(КонтекстВыгрузки.ФормаВладелец);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

// Параметры:
//  ДлительнаяОперация - Неопределено
//                     - см. ДлительныеОперации.ВыполнитьФункцию
//  КонтекстВыгрузки - см. НовыйКонтекстВыгрузкиВЦентрЭДО
// 
// Возвращаемое значение:
//  См. МашиночитаемыеДоверенностиИнтеграцияЦентраЭДОКлиентСервер.НовыйРезультатВыгрузкиВЦентрЭДО
Функция ВыгрузитьВЦентрЭДОЗавершение(ДлительнаяОперация, КонтекстВыгрузки) Экспорт
	
	ВидОперации = МашиночитаемыеДоверенностиИнтеграцияЦентраЭДОКлиентСервер.ВидОперацииВыгрузкаВЦентрЭДО();
	КонтекстДиагностики = ОбработкаНеисправностейБЭДКлиент.НовыйКонтекстДиагностики();
	
	РезультатВыгрузки = ОбщегоНазначенияБЭДКлиент.РезультатДлительнойОперации(
		ДлительнаяОперация, КонтекстДиагностики, ВидОперации,
		ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ИнтеграцияЦентраЭДО); // См. МашиночитаемыеДоверенностиИнтеграцияЦентраЭДО.ВыгрузитьВЦентрЭДО
	
	Если РезультатВыгрузки = Неопределено Тогда
		РезультатВыгрузки = МашиночитаемыеДоверенностиИнтеграцияЦентраЭДОКлиентСервер.НовыйРезультатВыгрузкиВЦентрЭДО(
			КонтекстДиагностики);
	ИначеЕсли РезультатВыгрузки.ВыгрузкаПоДоверенностям.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось выгрузить доверенность в Центр ЭДО.
													|Смотрите подробности в журнале регистрации'"));
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Доверенность успешно выгружена в Центр ЭДО'"));
	КонецЕсли;
	
	ОбработкаНеисправностейБЭДКлиент.ОбработатьОшибки(РезультатВыгрузки.КонтекстДиагностики);
	
	ВыполнитьОбработкуОповещения(КонтекстВыгрузки.ОповещениеОЗавершении, РезультатВыгрузки);
	
	Возврат РезультатВыгрузки;
	
КонецФункции

#КонецОбласти

#КонецОбласти
