

#Область ПрограммныйИнтерфейс

// Процедура для формирования предупреждения при запуске программы с 28.12.2108 о повышении ставки НДС.
//
Функция ПроверкаОбИзмененииСтавкиНДС(Параметры, ДополнительныеПараметры) Экспорт
	
	// Получим текущую дату и признак обновления базы на новую ставку НДС.
	ПараметрыСтавкиНДС = РаботаСоСтавкамиНДСВызовСервера.ПараметрыПроверкиСтавкиНДС();
	
	Если ПараметрыСтавкиНДС = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ ПараметрыСтавкиНДС.ЭтоАдминистраторСистемы
		И НЕ ПараметрыСтавкиНДС.СтавкиНДСОбновлены Тогда
		
		Если ПараметрыСтавкиНДС.ТекущаяДата >= Дата("20190101") Тогда
			
			// Зашел обычный пользователь, но в базе остались ставки НДС 18% с 01 января 2019.
			// Запрещена работа пользователя до обновления данных.
			ОбработкаОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаПерезаполнения", ЭтотОбъект, Параметры);
			
			ТекстВопроса = НСтр("ru = 'В связи с Федеральным законом от 3 августа 2018 г. № 303-ФЗ ""О внесении изменений в отдельные законодательные акты Российской Федерации о налогах и сборах""
					| повышена ставка НДС с 18% до 20%. Администратору системы необходимо обновить данные. Продолжить работу?'");
			
			ПоказатьВопрос(ОбработкаОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
			
		ИначеЕсли ПараметрыСтавкиНДС.ТекущаяДата >= Дата("20181228") Тогда
			
			// В период с 28.12.2018 - 31.12.2018 23:59:59 выводим только предупреждение при запуске.
			ОбработкаОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаПредупреждения", ЭтотОбъект, Параметры);
			
			ПоказатьПредупреждение(ОбработкаОповещения,НСтр("ru = 'В связи с Федеральным законом от 3 августа 2018 г. № 303-ФЗ ""О внесении изменений в отдельные законодательные акты Российской Федерации о налогах и сборах""
					| повышена ставка НДС с 18% до 20%. Если до 01.01.2019 г. не будет запущена обработка ""Обновление ставки НДС"", то работа пользователей в программе будет прекращена.
					| С 01.01.2019 г. при запуске программы данная обработка будет запущена автоматически для обновления данных.'"),, НСтр("ru = 'Переход на ставку НДС 20%'"));
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыСтавкиНДС.ЭтоАдминистраторСистемы
		И НЕ ПараметрыСтавкиНДС.СтавкиНДСОбновлены Тогда
		
		Если ПараметрыСтавкиНДС.ТекущаяДата < Дата("20190101")
			И ПараметрыСтавкиНДС.ТекущаяДата >= Дата("20181228") Тогда
			
			// В период с 28.12.2018 - 31.12.2018 23:59:59 для администратора выводим только предупреждение при запуске.
			ОбработкаОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаПредупреждения", ЭтотОбъект, Параметры);
			
			ПоказатьПредупреждение(ОбработкаОповещения, НСтр("ru = 'В связи с Федеральным законом от 3 августа 2018 г. № 303-ФЗ ""О внесении изменений в отдельные законодательные акты Российской Федерации о налогах и сборах""
					| повышена ставка НДС с 18% до 20%. Если до 01.01.2019 г. не будет запущена обработка ""Обновление ставки НДС"", то работа пользователей в программе будет прекращена.
					| С 01.01.2019 г. при запуске программы данная обработка будет запущена автоматически для обновления данных.'"),, НСтр("ru = 'Переход на ставку НДС 20%'"));
			
		ИначеЕсли ПараметрыСтавкиНДС.ТекущаяДата >= Дата("20190101") Тогда
			
			ОбработкаОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаПерезаполнения", ЭтотОбъект, Параметры);
			
			// Запуск обработки обновления ставки НДС принудительно!
			ОткрытьФорму("Обработка.ОбновлениеСтавкиНДС.Форма",,,,,, ОбработкаОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ПолучитьПредупреждениеОбИзмененииСтавкиНДС()

// Процедура для проверки ответа на вопрос о продолжении работы с программой.
//
Процедура Подключаемый_ОбработкаРезультатаПерезаполнения(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ПрекратитьРаботуСистемы();
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Параметры.ОбработкаПродолжения);
	
КонецПроцедуры // ПоказатьПредупреждениеПоПереходуСтавкиНДС()

// Процедура для обработки дальнейшего продолжения работы.
//
Процедура Подключаемый_ОбработкаРезультатаПредупреждения(Параметры) Экспорт
	
	ВыполнитьОбработкуОповещения(Параметры.ОбработкаПродолжения);
	
КонецПроцедуры // ПоказатьПредупреждениеПоПереходуСтавкиНДС()

#КонецОбласти
