


#Область ПрограммныйИнтерфейс

// Получает мобильные номера телефонов контактных лиц, контрагента.
// Рекомендуется передавать номера мобильных телефонов контактного лица и контрагента, где они заполнены.
// Мобильный телефон используется для отправки сообщения через whatsapp на конкретный номер.
//
// Параметры:
//  Контрагент           - ОпределяемыйТип.КонтрагентБЭД - ссылка на элемент справочника контрагенты.
//  КонтактнаяИнформация - Массив из см. ИнтеграцияShareКлиентСервер.НовыйКонтактнаяИнформация - контактная информация.
//
Процедура КонтактныеЛицаСНомеромТелефона(Знач Контрагент, КонтактнаяИнформация) Экспорт
	
КонецПроцедуры

// Определяет состав команд для использования сервиса 1С:Share.
//
// Параметры:
//  СоставКоманд - См. ИнтеграцияShare.НовыйСоставКомандShare
//
Процедура ПриОпределенииСоставаКомандShare(СоставКоманд) Экспорт
	
КонецПроцедуры

// Переопределяет гиперссылку на инструкцию по работе с сервисом 1С:Share для прикладной базы.
// Например, url-страница сайта ИТС с описанием сервиса как в нем делиться документом и загружать.
//
// Параметры:
//  НавигационнаяСсылка - Строка - гиперссылка на инструкцию по работе с сервисом 1С:Share для прикладной базы.
//
Процедура ПриОпределенииГиперссылкиНаИнструкциюПоРаботеССервисом(НавигационнаяСсылка) Экспорт
	
КонецПроцедуры

// Переопределяет файлы документа для выбора к публикации в сервис 1С:Share.
// При стандартной обработке файлы заполняются из присоединенных файлов к документу и не помеченные на удаление,
// используется метод БСП РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту и метод интеграция с 1С:Документооборотом
// ИнтеграцияС1СДокументооборотБазоваяФункциональность.ДанныеФайловОбъектаИС.
//
// Параметры:
//  ДанныеФайлов - Массив из см. ИнтеграцияShare.НовыеДанныеПрисоединенногоФайла - данные файлов для выбора к публикации.
//                                                                                 Выходной параметр.
//  СсылкаНаДокумент - ДокументСсылка, СправочникСсылка - ссылка на публикуемый документ.
//  СтандартнаяОбработка - Булево - признак стандартной обработки. По умолчанию Истина.
//
Процедура ПриОпределенииФайловДокументаДляВыбораКПубликации(ДанныеФайлов, Знач СсылкаНаДокумент, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Переопределяет данные публикуемого документа в сервис 1С:Share.
//
// Параметры:
//  ДанныеТранспортногоКонтейнера - ДеревоЗначений из см. ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента -
//                                  данные для заполнения транспортного контейнера. Строится по макету. 
//                                 см. Обработка.СервисShare.Макет.ТранспортныйКонтейнер. Выходной параметр.
//  СсылкаНаДокумент - ДокументСсылка, СправочникСсылка - электронный документ к публикации.
//
Процедура ПриОпределенииДанныхПубликуемогоДокумента(ДанныеТранспортногоКонтейнера, Знач СсылкаНаДокумент) Экспорт
	
КонецПроцедуры

// Переопределяет представление публикуемого документа.
// При необходимости можно переопределить параметры из свойства
// "ПараметрыПубликуемогоДокументаДляВизуализации.СвойстваПредставления" при использовании стандартной обработки.
//
// Параметры:
//  ОписаниеПредставленияДокумента - Структура из См. РаботаСФайламиБЭД.НовоеОписаниеФайла - представление документа
//      в поддерживаемом формате визуализации. См. ИнтеграцияShareКлиентСервер.ДоступныеРасширенияФайловВизуализации
//      Имя файла используется в качестве имени отправляемого документа, которое отображается пользователю при просмотре
//      файла визуализации. Выходной параметр.
//  ПараметрыПубликуемогоДокументаДляВизуализации - См. ИнтеграцияShare.НовыеПараметрыПубликуемогоДокументаДляВизуализации -
//                            параметры публикуемого документа.
//  СтандартнаяОбработка    - Булево - признак стандартной обработки. По умолчанию Истина.
//
Процедура ПриОпределенииВизуализацииПубликуемогоДокумента(ОписаниеПредставленияДокумента,
	Знач ПараметрыПубликуемогоДокументаДляВизуализации, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Заполняет настройки формирования электронного документа.
// Если документ может формироваться разными видами отражения в учете, в этом случае для документов которым недоступно
// формирование через сервис 1С:Share должно выводиться сообщению пользователю.
//
// Параметры:
//  СсылкаНаДокумент      - СправочникСсылка, ДокументСсылка, - документ или справочник объекта учета.
//  НастройкиФормирования - Структура - настройки источника для формирования обмена электронными документами.
//                                      Выходной параметр:
//    * ТипДокумента       - Произвольный - значение элемента структуры возвращаемой
//                           см. ОбменСКонтрагентами.ТипыДокументов.
//    * Формат             - Строка - формат значения элемента структуры возвращаемой см. ОбменСКонтрагентами.ФорматыДокументов().
//    * Направление        - Произвольный - значение элемента структуры возвращаемой.
//                           см. ОбменСКонтрагентами.НаправленияДокументов.
//    * Организация        - ОпределяемыйТип.Организация - организация документа.
//    * Контрагент         - ОпределяемыйТип.КонтрагентБЭД - контрагент документа.
//    * ДоговорКонтрагента - ОпределяемыйТип.ДоговорСКонтрагентомЭДО - договор контрагента.
//    * ЭтоФорматФНС       - Булево - признак формализованного электронного документа в формате ФНС.
//
// Пример:
// 
//  Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
//  	
//  	Реквизиты = "ВидДокумента, Организация, Контрагент, ДоговорКонтрагента";
//  	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДокумент, Реквизиты);
//  	
//  	НастройкиФормирования.Направление        = ОбменСКонтрагентами.НаправленияДокументов().Исходящий;
//  	НастройкиФормирования.Организация        = ЗначенияРеквизитов.Организация;
//  	НастройкиФормирования.Контрагент         = ЗначенияРеквизитов.Контрагент;
//  	НастройкиФормирования.ДоговорКонтрагента = ЗначенияРеквизитов.ДоговорКонтрагента;
//  	НастройкиФормирования.ЭтоФорматФНС       = Истина;
//  	
//  	Если ЗначенияРеквизитов.ВидДокумента = "Корректировка" Тогда
//  		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
//  				НСтр("ru = 'Не поддержана возможность делиться документом по ссылке с видом документа ""%1"".'"),
//  				ЗначенияРеквизитов.ВидДокумента));
//  	КонецЕсли
//  КонецЕсли; .
//
Процедура ЗаполнитьНастройкиФормированияДокумента(СсылкаНаДокумент, НастройкиФормирования) Экспорт
	
КонецПроцедуры

// Переопределяет настройки загрузки документа из сервиса 1С:Share.
//
// По умолчанию заполняются настройки документа в зависимости от состояния документа и указанных типов объектов из 
// метода ИнтеграцияЭДО.ТипыОбъектовУчетаПоТипуЭлектронногоДокумента. При отличии способов отражения учета от этого
// метода можно переопределить способы отражения и их отображения для пользователя.
// Так же в методе можно выполнять проверки на наличие доступа к учетным документам или данным у пользователя,
// и любые другие проверки перед загрузкой документа. В случае наличия ошибок необходимо установить Отказ = Истина,
// заполнить ТекстОшибки.
//
// 1)Пример для открытия документа, когда документ уже ранее был загружен:
//
//	ПараметрОтраженияВУчете = ПараметрыОтраженияВУчете.Добавить();
//	ПараметрОтраженияВУчете.СсылкаНаОбъектУчетаВБазе      = СсылкаНаОбъектУчета;
//	ПараметрОтраженияВУчете.ПредставлениеДокумента        = Строка(СсылкаНаОбъектУчета);
//	ПараметрОтраженияВУчете.ПредставлениеРезультатаПоиска = СтрШаблон(НСтр("ru = 'Открыть %1'"),
//		ПараметрыОтраженияВУчете.ПредставлениеДокумента);
//	ПараметрОтраженияВУчете.КартинкаРезультатаПоиска      = БиблиотекаКартинок.ПерейтиПоНавигационнойСсылке;
// 
// 2)Пример для загрузки документа, когда документ можно загрузить только как один тип объекта:
//
//	ПараметрОтраженияВУчете = ПараметрыОтраженияВУчете.Добавить();
//	ПараметрОтраженияВУчете.СсылкаНаОбъектУчетаВБазе = Документы.ЗаказПоставщику.ПустаяСсылка();
//	ПараметрОтраженияВУчете.СпособОтраженияВУчете    = "ЗаказПоставщику";
//	ПараметрОтраженияВУчете.ПредставлениеДокумента   = СтрШаблон(НСтр("ru = '%1 от %2'"),
//		ОписаниеЭлектронногоДокумента.ПредставлениеДокументаОтправителя,
//		ОписаниеЭлектронногоДокумента.НаименованиеОтправителя);
//	ПараметрОтраженияВУчете.ПредставлениеРезультатаПоиска = СтрШаблон(НСтр("ru = 'Загрузить %1'"), ПредставлениеДокумента);
//	ПараметрОтраженияВУчете.КартинкаРезультатаПоиска      = БиблиотекаКартинок.ЗагрузитьShare;
//
// 3)Пример для загрузки документа, когда документ можно загрузить разными типами объекта:
//
//	ПараметрОтраженияВУчете = ПараметрыОтраженияВУчете.Добавить();
//	ПараметрОтраженияВУчете.СсылкаНаОбъектУчетаВБазе = Документы.ЗаказПоставщику.ПустаяСсылка();
//	ПараметрОтраженияВУчете.СпособОтраженияВУчете    = "ЗаказПоставщику";
//	ПараметрОтраженияВУчете.ПредставлениеДокумента   = НСтр("ru = 'Заказ поставщику'");
//	ПараметрОтраженияВУчете.КартинкаРезультатаПоиска = БиблиотекаКартинок.ЗагрузитьShare;
//	ПараметрОтраженияВУчете.ПредставлениеВПодменюЗагрузить = СтрШаблон(НСтр("ru = 'Как %1'"), ПредставлениеДокумента);
//	ПараметрОтраженияВУчете.ПредставлениеРезультатаПоиска = СтрШаблон(НСтр("ru = 'Загрузить как %1'"), ПредставлениеДокумента).
//
// Параметры:
//  НастройкиЗагрузки - Структура Из см. ИнтеграцияShare.НовыеНастройкиЗагрузкиДокумента
//  ОписаниеЭлектронногоДокумента - см. ИнтеграцияShare.НовоеКраткоеОписаниеЭлектронногоДокумента.
//  Отказ - Булево - признак наличия ошибки или закрытия доступа к загрузке документа, например, при отсутствие прав.
//  ТекстОшибки - Строка - текст сообщения для отображения пользователю.
Процедура ПриОпределенииНастроекЗагрузкиДокумента(НастройкиЗагрузки, Знач ОписаниеЭлектронногоДокумента,
	Отказ = Ложь, ТекстОшибки = "") Экспорт

КонецПроцедуры

// Переопределяет описание подсказки на форме обработки СервисShare.ПоделитьсяДокументом.
//
// Параметры:
//  ОписаниеДокумента - см. ИнтеграцияShareКлиентСервер.НовыеДанныеОпубликованногоДокумента
//  СведенияОПодсказке - Структура - описание подсказок на форме:
//   * ЗаголовокПоясненияСсылки - Строка - заголовок пояснения сформированной ссылки.
//   * ТекстПоясненияСсылки - Строка, ФорматированнаяСтрока - текст пояснения сформированной ссылки.
//   * ТекстРекомендацииПоСсылке - Строка, ФорматированнаяСтрока - текст с рекомендациями по ссылке.
//         Можно передавать текст с навигационной ссылкой на внешний адрес или открытия дополнительной формы.
//   * ОтображатьТекстРекомендацииПоСсылке - Булево - признак отображения текста рекомендации по ссылке.
//         По умолчанию текст выводиться только для электронных документов в формате ФНС.
//
// Пример:
//  1) СведенияОПодсказке.ЗаголовокПоясненияСсылки = НСтр("ru='Этот документ не юридически значимый'");
//     СведенияОПодсказке.ТекстПоясненияСсылки = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
//       СтрШаблон(НСтр("ru='- Используется для предварительного согласования данных.
//                      |- Не подписывается квалифицированной электронной подписью. <a href = ""%1"">Что это?</a>'"),
//         "https://v8.1c.ru/metod/article/chto-takoe-kep-i-zachem-ona-nuzhna.htm");
//     СведенияОПодсказке.ТекстРекомендацииПоСсылке = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
//       НСтр("ru='Для обмена юридически значимыми документами <a href = ""ПодключитьЭДО"">подключитесь к сервису 1С-ЭДО</a>'"));
//     Для переопределения навигационных ссылок следует использовать метод
//     см. ИнтеграцияShareКлиентПереопределяемый.ПриОпределенииОбработкиНавигационнойСсылкиНаФорме
//
//  2) СведенияОПодсказке.ЗаголовокПоясненияСсылки = "";
//     СведенияОПодсказке.ТекстПоясненияСсылки = ""
//     СведенияОПодсказке.ТекстРекомендацииПоСсылке = НСтр("ru='Переданная ссылка доступна всем у кого она есть.
//      |Рекомендуем не размещать ссылку в публичных пространствах'");
//     СведенияОПодсказке.ОтображатьТекстРекомендацииПоСсылке = Истина;.
//
Процедура ПриОпределенииСведенийОПодсказкеНаФормеПоделиться(Знач ОписаниеДокумента, СведенияОПодсказке) Экспорт
	
КонецПроцедуры

#КонецОбласти

