
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//{Режим открытия окна
	#Если ВебКлиент Тогда
		ЭтоВебКлиент=Истина;
	#Иначе
		ЭтоВебКлиент=Ложь;
	#КонецЕсли
	//НайденныйРежимОткрытияОкна=аДООбщееСерверПС.ПолучитьРежимОткрытияФормы(ЭтаФорма.ИмяФормы, ЭтаФорма.Параметры.РежимВыбора, ЭтоВебКлиент);
	//Если НайденныйРежимОткрытияОкна<>Неопределено Тогда
	//	ЭтаФорма.РежимОткрытияОкна=НайденныйРежимОткрытияОкна;
	//КонецЕсли;
	//}
	
	Элементы.Список.РежимВыбора=ЭтаФорма.Параметры.РежимВыбора;
	
	Элементы.Наименование.Видимость=Ложь;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПроверитьСоединениеСБазойДанных(Команда)
//	СтрокаТЧ=Элементы.Список.ТекущиеДанные;
//	
//	Если СтрокаТЧ=Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если аДОРаботаСВнешнимиБазами.ИнициализироватьСоединениеСБазойДанных(ПолучитьСсылкуНаИнфБазуСервером(СтрокаТЧ.Ссылка)) Тогда
//		ПоказатьПредупреждение(Неопределено, НСтр("en='Connection is successful.';ru='Соединение успешно установлено.'"), 60, аОбщееКлиентПС.ЗаголовокДиалога());
//		
//	Иначе
//		ПоказатьПредупреждение(Неопределено, НСтр("en='Error establishing a connection with ""';ru='Ошибка установки соединения с ""'")+СокрЛП(СтрокаТЧ.Ссылка)+""".", 60, аОбщееКлиентПС.ЗаголовокДиалога());
//		
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаИнфБазуСервером(СсылкаНаБазу)
	Возврат СсылкаНаБазу.Ссылка;
КонецФункции
