&НаКлиенте
Перем COMОбъектSQL;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастрокаПодключенияTPI = Справочники.ЕРПНастрокиПодключенияTPI.TPI;
	
	ПризнакПоследниеNЗаписей = ИСТИНА;
	ПоследниеNЗаписей = 100;
	
	ПризнакБаза = ИСТИНА;
	База = ЕРПЗагрузкаНСИПерсональный.ПолучитьИмяБазыДанных();
	
	ПризнакАктуальность = ИСТИНА;
	Актуальность = "ТолькоАктуальные";
	
	ПризнакЗагружено = ИСТИНА;
	Загружено = "ТолькоНеЗагруженные";
	
	ПризнакНеУдовлетворяетУсловиямОтбора = ИСТИНА;
	НеУдовлетворяетУсловиямОтбора = "Удовлетворяет";
	
	ПризнакПериодВставки = ИСТИНА;
	ДатаНачалаВставки = НачалоДня(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ПризнакПоследниеПриИзменении(Элемент)
	ОбновитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТолькоПросмотр(Элемент, ПризнакЗначение)
	Элемент.ТолькоПросмотр = НЕ ПризнакЗначение;
	
	Если Элемент.ТолькоПросмотр Тогда
		Элемент.ЦветФона = Новый Цвет(192,192,192);
	Иначе	
		Элемент.ЦветФона = Новый Цвет();
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьДоступностьЭлементов()
	УстановитьТолькоПросмотр(Элементы.ПоследниеNЗаписей, ПризнакПоследниеNЗаписей);
	УстановитьТолькоПросмотр(Элементы.База, ПризнакБаза);
	УстановитьТолькоПросмотр(Элементы.Актуальность, ПризнакАктуальность);
	УстановитьТолькоПросмотр(Элементы.Загружено, ПризнакЗагружено);
	УстановитьТолькоПросмотр(Элементы.ДатаНачалаВставки, ПризнакПериодВставки);
	УстановитьТолькоПросмотр(Элементы.ДатаОкончанияВставки, ПризнакПериодВставки);
	УстановитьТолькоПросмотр(Элементы.Счетчик, ПризнакСчетчик);
	УстановитьТолькоПросмотр(Элементы.НеУдовлетворяетУсловиямОтбора, ПризнакНеУдовлетворяетУсловиямОтбора);
	УстановитьТолькоПросмотр(Элементы.МастерКлюч, ПризнакМастерКлюч);
КонецПроцедуры	

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаКлиенте();
	ПоказатьЗаписьВTPI();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаКлиенте()
	Command = Новый COMОбъект("ADODB.Command"); 
	Command.ActiveConnection = COMОбъектSQL;
	
	ТекстЗапроса = "SELECT * FROM (SELECT LINESWITCH, BD, MANUAL, IDMANUAL, LINESWITCHMANUAL, LOADED, ERRORTEXT, DATEINSERT, ACTUAL, DateNotActual, DATETRANSACTION, ROW_NUMBER() OVER (ORDER BY DATEINSERT DESC) 'RowRankDESC'  FROM dbo.LogTime WHERE 1=1 #BD# #LOADED# #MANUAL# #ACTUAL# #ACCEPT# #LINESWITCHMANUAL# #IDMANUAL# #PERIODSTART# #PERIODEND#) SUB WHERE 1=1 #WHERERowRankDESC# ORDER BY DATEINSERT DESC";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#WHERERowRankDESC#", ?(ПризнакПоследниеNЗаписей, " AND RowRankDESC <= " + Формат(ПоследниеNЗаписей, "ЧГ="), ""));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#BD#", ?(ПризнакБаза, " AND BD = ?", ""));
	Если ПризнакБаза Тогда
		Param1 = Command.CreateParameter("BD", КонстантаАДО("advarchar"), 1, 100);
		Command.Parameters.Append(Param1);
		Param1.Value = База;
	КонецЕсли;	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#MANUAL#", ?(ПризнакНастройкаМаппинга, " AND MANUAL = ?", ""));
	Если ПризнакНастройкаМаппинга Тогда
		Param2 = Command.CreateParameter("MANUAL", КонстантаАДО("advarchar"), 1, 150);
		Command.Parameters.Append(Param2);
		Param2.Value = НастрокаМаппинга.НаименованиеТаблицыTPI;
	КонецЕсли;	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#LOADED#", ?(ПризнакЗагружено, " AND LOADED = ?", ""));
	Если ПризнакЗагружено Тогда
		Param3 = Command.CreateParameter("LOADED", КонстантаАДО("adboolean"), 1);
		Command.Parameters.Append(Param3);
		Param3.Value = ?(Загружено = "ТолькоЗагруженные", 1, 0);
	КонецЕсли;	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ACTUAL#", ?(ПризнакАктуальность, " AND ACTUAL = ?", ""));
	Если ПризнакАктуальность Тогда
		Param4 = Command.CreateParameter("ACTUAL", КонстантаАДО("adboolean"), 1);
		Command.Parameters.Append(Param4);
		Param4.Value = ?(Актуальность = "ТолькоАктуальные", 1, 0);;
	КонецЕсли;	
	Если ПризнакНеУдовлетворяетУсловиямОтбора Тогда
		Если НеУдовлетворяетУсловиямОтбора = "Удовлетворяет" ТОГДА
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ACCEPT#", ?(ПризнакНеУдовлетворяетУсловиямОтбора, " AND ERRORTEXT <> ?", ""));
		Иначе	
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ACCEPT#", ?(ПризнакНеУдовлетворяетУсловиямОтбора, " AND ERRORTEXT = ?", ""));
		КонецЕсли;	
		Param5 = Command.CreateParameter("ACCEPT", КонстантаАДО("advarchar"), 1, 150);
		Command.Parameters.Append(Param5);
		Param5.Value = "Не удолетворяет условиям отбора";
	Иначе	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ACCEPT#", "");
	КонецЕсли;	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#LINESWITCHMANUAL#", ?(ПризнакСчетчик, " AND LINESWITCHMANUAL = ?", ""));
	Если ПризнакСчетчик Тогда
		Param6 = Command.CreateParameter("LINESWITCHMANUAL", КонстантаАДО("adbigint"), 1);
		Command.Parameters.Append(Param6);
		Param6.Value = Счетчик;
	КонецЕсли;	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#IDMANUAL#", ?(ПризнакМастерКлюч, " AND IDMANUAL = ?", ""));
	Если ПризнакМастерКлюч Тогда
		Param7 = Command.CreateParameter("IDMANUAL", КонстантаАДО("advarchar"), 1, 15);
		Command.Parameters.Append(Param7);
		Param7.Value = МастерКлюч;
	КонецЕсли;	
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#PERIODSTART#", ?(ПризнакПериодВставки И ДатаНачалаВставки <> Дата("00010101"), " AND DATEINSERT >= ?", ""));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#PERIODEND#", ?(ПризнакПериодВставки И ДатаОкончанияВставки <> Дата("00010101"), " AND DATEINSERT <= ?", ""));
	Если ПризнакПериодВставки Тогда
		Если ДатаНачалаВставки <> Дата("00010101") Тогда
			Param8 = Command.CreateParameter("PERIODSTART", КонстантаАДО("addbtimestamp"), 1);
			Command.Parameters.Append(Param8);
			Param8.Value = ДатаНачалаВставки;
		КонецЕсли;	
		Если ДатаОкончанияВставки <> Дата("00010101") Тогда
			Param9 = Command.CreateParameter("PERIODEND", КонстантаАДО("addbtimestamp"), 1);
			Command.Parameters.Append(Param9);
			Param9.Value = ДатаОкончанияВставки;
		КонецЕсли;	
	КонецЕсли;	
	
	
	Command.CommandText = ТекстЗапроса;
	
	RecordSet = Новый COMОбъект("ADODB.Recordset"); 
	RecordSet = Command.Execute();
	
	ТаблицаЛогирования.Очистить();
	Пока НЕ RecordSet.EOF Цикл
		НоваяСтрока = ТаблицаЛогирования.Добавить();
		НоваяСтрока.LineSwitch = RecordSet.Fields("LineSwitch").Value;
		НоваяСтрока.BD = RecordSet.Fields("BD").Value;
		НоваяСтрока.Manual = RecordSet.Fields("Manual").Value;
		НоваяСтрока.IDManual = RecordSet.Fields("IDManual").Value;
		НоваяСтрока.LineSwitchManual = RecordSet.Fields("LineSwitchManual").Value;
		НоваяСтрока.Loaded = RecordSet.Fields("Loaded").Value;
		НоваяСтрока.ErrorText = RecordSet.Fields("ErrorText").Value;
		НоваяСтрока.DateInsert = RecordSet.Fields("DateInsert").Value;
		НоваяСтрока.Actual = RecordSet.Fields("Actual").Value;
		НоваяСтрока.DateNotActual = RecordSet.Fields("DateNotActual").Value;
		НоваяСтрока.DateTransaction = RecordSet.Fields("DateTransaction").Value;
		RecordSet.MoveNext();
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Функция КонстантаАДО(Конст)
  АдоКонст = НРег(Конст);
  Если АдоКонст = "adEmpty" Тогда Возврат(0);
  ИначеЕсли АдоКонст = "adtinyint" Тогда Возврат(16);
  ИначеЕсли АдоКонст = "adsmallint" Тогда Возврат(2);
  ИначеЕсли АдоКонст = "adinteger" Тогда Возврат(3);
  ИначеЕсли АдоКонст = "adbigint" Тогда Возврат(20);
  ИначеЕсли АдоКонст = "adunsignedtinyint" Тогда Возврат(17);
  ИначеЕсли АдоКонст = "adunsignedsmallint" Тогда Возврат(18);
  ИначеЕсли АдоКонст = "adunsignedint" Тогда Возврат(19);
  ИначеЕсли АдоКонст = "adunsignedbigint" Тогда Возврат(21);
  ИначеЕсли АдоКонст = "adsingle" Тогда Возврат(4);
  ИначеЕсли АдоКонст = "addouble" Тогда Возврат(5);
  ИначеЕсли АдоКонст = "adcurrency" Тогда Возврат(6);
  ИначеЕсли АдоКонст = "addecimal" Тогда Возврат(14);
  ИначеЕсли АдоКонст = "adnumeric" Тогда Возврат(131);
  ИначеЕсли АдоКонст = "adboolean" Тогда Возврат(11);
  ИначеЕсли АдоКонст = "aderror" Тогда Возврат(10);
  ИначеЕсли АдоКонст = "aduserdefined" Тогда Возврат(132);
  ИначеЕсли АдоКонст = "advariant" Тогда Возврат(12);
  ИначеЕсли АдоКонст = "adidispatch" Тогда Возврат(9);
  ИначеЕсли АдоКонст = "adiunknown" Тогда Возврат(13);
  ИначеЕсли АдоКонст = "adguid" Тогда Возврат(72);
  ИначеЕсли АдоКонст = "addate" Тогда Возврат(7);
  ИначеЕсли АдоКонст = "addbdate" Тогда Возврат(133);
  ИначеЕсли АдоКонст = "addbtime" Тогда Возврат(134);
  ИначеЕсли АдоКонст = "addbtimestamp" Тогда Возврат(135);
  ИначеЕсли АдоКонст = "adbstr" Тогда Возврат(8);
  ИначеЕсли АдоКонст = "adchar" Тогда Возврат(129);
  ИначеЕсли АдоКонст = "advarchar" Тогда Возврат(200);
  ИначеЕсли АдоКонст = "adlongvarchar" Тогда Возврат(201);
  ИначеЕсли АдоКонст = "adwchar" Тогда Возврат(130);
  ИначеЕсли АдоКонст = "advarwchar" Тогда Возврат(202);
  ИначеЕсли АдоКонст = "adlongvarwchar" Тогда Возврат(203);
  ИначеЕсли АдоКонст = "adbinary" Тогда Возврат(128);
  ИначеЕсли АдоКонст = "advarbinary" Тогда Возврат(204);
  ИначеЕсли АдоКонст = "adlongvarbinary" Тогда Возврат(205);
  Иначе Возврат(0);
  КонецЕсли;
КонецФункции

&НаКлиенте
Функция ПодключитьсяКTPI(НастройкаПодключенияTPI)
	COMОбъектSQL = Неопределено;
	Попытка
		COMОбъектSQL = Новый COMОбъект("ADODB.Connection");
		
		COMОбъектSQL.ConnectionTimeOut = 20; // по умолчанию
		COMОбъектSQL.CommandTimeOut = 0; 
		COMОбъектSQL.ConnectionString = "Provider=SQLOLEDB; SERVER=" + НастройкаПодключенияTPI.Сервер
			+ "; Database="+ НастройкаПодключенияTPI.БазаДанных
			+ "; UID=" + СокрЛП(НастройкаПодключенияTPI.Пользователь) 
			+ "; PWD=" + СокрЛП(НастройкаПодключенияTPI.Пароль) + ";";  
		COMОбъектSQL.Open();   
		Если COMОбъектSQL.State() = 0 Тогда 
			COMОбъектSQL = Неопределено;
			ТекстСообщения = НСтр("ru = 'Не удалось подключиться к SQL.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	Исключение
		COMОбъектSQL = Неопределено;
		ТекстСообщения = НСтр("ru = 'Не удалось подключиться к SQL.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	Возврат(COMОбъектSQL);
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	COMОбъектSQL = ПодключитьсяКTPI(НастрокаПодключенияTPI);
	ОбновитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	COMОбъектSQL.Close(); 
	COMОбъектSQL = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗаписьВTPI()
	ТекущиеДанные = Элементы.ТаблицаЛогирования.ТекущиеДанные;
	Если ТекущиеДанные <> неопределено Тогда
		
		Command = Новый COMОбъект("ADODB.Command"); 
		Command.ActiveConnection = COMОбъектSQL;
		
		ТекстЗапроса = "SELECT * FROM #ИмяТаблицы# WHERE LINESWITCH = ?";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИмяТаблицы#", ТекущиеДанные.Manual);
		
		Элементы.ДекорацияИмяТаблицы.Заголовок = ТекущиеДанные.Manual;
		
		Command.CommandText = ТекстЗапроса;
		
		Param1 = Command.CreateParameter("LINESWITCH", КонстантаАДО("adbigint"), 1);
		Command.Parameters.Append(Param1);
		Param1.Value = ТекущиеДанные.LineSwitchManual;
		
		ТаблицаТПИ.Очистить();
	    Попытка
			RecordSet = Новый COMОбъект("ADODB.Recordset"); 
			RecordSet = Command.Execute();
		
			Пока НЕ RecordSet.EOF Цикл
				сч = 0;
				Пока сч <> RecordSet.Fields.Count - 1 Цикл
				
					НоваяСтрока = ТаблицаТПИ.Добавить();
					НоваяСтрока.КолонкаTPI = RecordSet.Fields(сч).Name;
					НоваяСтрока.ЗначениеTPI = RecordSet.Fields(сч).Value;
					
					сч = сч + 1;
				КонецЦикла;	
				RecordSet.MoveNext();
			КонецЦикла;	
		Исключение
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЛогированияПриАктивизацииСтроки(Элемент)
	ПоказатьЗаписьВTPI();
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ТекущиеДанные = Элементы.ТаблицаЛогирования.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("НаименованиеТаблицыTPI", ТекущиеДанные.Manual);
		СтруктураПараметров.Вставить("Счетчик", ТекущиеДанные.LineSwitchManual);
		СтруктураПараметров.Вставить("НастрокаПодключенияTPI", НастрокаПодключенияTPI);
		ЕРПЗагрузкаНСИ.ЗагрузитьПозициюНСИизTPI(СтруктураПараметров);
	КонецЕсли;	
КонецПроцедуры



