
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("Статус");	
	Поля.Добавить("ВидПлана");
	Поля.Добавить("ПериодПлана");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("%1 план продаж № %2 от %3 на месяц: %4 (%5)",
					Данные.ВидПлана,
					Данные.Номер,
	                Формат(Данные.Дата, "ДЛФ=D"),
					Формат(Данные.ПериодПлана, "ДФ='ММММ гггг ''г.'''"),
					НРег(Данные.Статус));
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ключ")
		И ЗначениеЗаполнено(Параметры.Ключ)
		И ТипЗнч(Параметры.Ключ) = Тип("ДокументСсылка.ИТ_УстановкаПланаПродаж_Месяц")  
		И Параметры.Ключ.ВидПлана = Перечисления.ИТ_ВидыПлановПродаж.Окончательный Тогда 
		
		СтандартнаяОбработка	= Ложь;
		ВыбраннаяФорма			= "ФормаДокумента_ОкончательныйПлан";
	КонецЕсли;	
	
КонецПроцедуры

