
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПланПродаж() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(&ПериодПланирования, МЕСЯЦ) КАК Период,
		|	ИТ_ПланПродаж_День.ТорговаяТочка,
		|	СУММА(ИТ_ПланПродаж_День.Сумма) КАК Сумма
		|ПОМЕСТИТЬ СуммыПоТорговымТочкам
		|ИЗ
		|	РегистрСведений.ИТ_ПланПродаж_День КАК ИТ_ПланПродаж_День
		|ГДЕ
		|	ИТ_ПланПродаж_День.Период >= НАЧАЛОПЕРИОДА(&ПериодПланирования, МЕСЯЦ)
		|	И ИТ_ПланПродаж_День.Период <= КОНЕЦПЕРИОДА(&ПериодПланирования, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИТ_ПланПродаж_День.ТорговаяТочка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ИТ_ПланПродаж_Месяц.ТорговаяТочка, СуммыПоТорговымТочкам.ТорговаяТочка) КАК ТорговаяТочка,
		|	СУММА(ЕСТЬNULL(СуммыПоТорговымТочкам.Сумма, 0)) КАК Сумма,
		|	СУММА(ВЫБОР
		|			КОГДА ИТ_ПланПродаж_Месяц.Цена <> 0
		|				ТОГДА ЕСТЬNULL(СуммыПоТорговымТочкам.Сумма, 0) / ИТ_ПланПродаж_Месяц.Цена
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Количество,
		|	СРЕДНЕЕ(ЕСТЬNULL(ИТ_ПланПродаж_Месяц.Цена, 0)) КАК ЦенаКон,
		|	СУММА(ЕСТЬNULL(ИТ_ПланПродаж_Месяц.Количество, 0)) КАК ПредварительноеКоличество,
		|	СУММА(ЕСТЬNULL(ИТ_ПланПродаж_Месяц.Сумма, 0)) КАК ПредварительнаяСумма
		|ПОМЕСТИТЬ ПоказателиПлановПродаж
		|ИЗ
		|	РегистрСведений.ИТ_ПланПродаж_Месяц КАК ИТ_ПланПродаж_Месяц
		|		ПОЛНОЕ СОЕДИНЕНИЕ СуммыПоТорговымТочкам КАК СуммыПоТорговымТочкам
		|		ПО (СуммыПоТорговымТочкам.Период = ИТ_ПланПродаж_Месяц.Период)
		|			И (СуммыПоТорговымТочкам.ТорговаяТочка = ИТ_ПланПродаж_Месяц.ТорговаяТочка)
		|ГДЕ
		|	ИТ_ПланПродаж_Месяц.ВидПлана = ЗНАЧЕНИЕ(Перечисление.ИТ_ВидыПлановПродаж.Предварительный)
		|	И ИТ_ПланПродаж_Месяц.Период >= НАЧАЛОПЕРИОДА(&ПериодПланирования, МЕСЯЦ)
		|	И ИТ_ПланПродаж_Месяц.Период <= КОНЕЦПЕРИОДА(&ПериодПланирования, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ИТ_ПланПродаж_Месяц.ТорговаяТочка, СуммыПоТорговымТочкам.ТорговаяТочка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиПлановПродаж.ТорговаяТочка,
		|	ПоказателиПлановПродаж.Сумма,
		|	ПоказателиПлановПродаж.Количество,
		|	ПоказателиПлановПродаж.ЦенаКон,
		|	ПоказателиПлановПродаж.ПредварительноеКоличество,
		|	ПоказателиПлановПродаж.ПредварительнаяСумма,
		|	ПоказателиПлановПродаж.Количество - ПоказателиПлановПродаж.ПредварительноеКоличество КАК ОтклонениеКоличество,
		|	ПоказателиПлановПродаж.Сумма - ПоказателиПлановПродаж.ПредварительнаяСумма КАК ОтклонениеСумма
		|ИЗ
		|	ПоказателиПлановПродаж КАК ПоказателиПлановПродаж";
	
	Запрос.УстановитьПараметр("ПериодПланирования", ПериодПлана);
	
	РезультатЗапроса	= Запрос.Выполнить();
	ТаблицаДанных		= РезультатЗапроса.Выгрузить();
	
	ПланПродаж.Загрузить(ТаблицаДанных);

КонецПроцедуры	
	
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ИТ_ПланыПродаж.ОбработатьУдалениеДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.ИТ_СтатусыПлановПродаж.Согласован Тогда 
		Движения.ИТ_ПланПродаж_Месяц.Записывать = Истина;
		
		Для Каждого СтрокаПланПродаж Из ПланПродаж Цикл
			
			Движение = Движения.ИТ_ПланПродаж_Месяц.Добавить();
			Движение.Период = ПериодПлана;
			Движение.ТорговаяТочка		= СтрокаПланПродаж.ТорговаяТочка;
			Движение.ВидПлана			= ВидПлана;
			Движение.Количество			= СтрокаПланПродаж.Количество;
			Движение.Сумма				= СтрокаПланПродаж.Сумма;
			Движение.Цена				= СтрокаПланПродаж.ЦенаКон;
			
		КонецЦикла;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти







