// Модуль документа "Производственные операции ВетИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Отчет производства за смену"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ОтчетПроизводстваЗаСмену(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Продукция.Очистить();
	Ингредиенты.Очистить();
	Партии.Очистить();
	ВСД.Очистить();
	ТаблицаРезультат.Очистить();
	Упаковки.Очистить();
	УпаковкиПродукции.Очистить();
	
	ХозОперация = Справочники.ХозОперации.ПроизводственныеОперацииВЕТИС;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтчетПроизводстваЗаСмену.Дата КАК ДатаВыработки,
	|	ОтчетПроизводстваЗаСмену.СкладКомпании.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ОтчетПроизводстваЗаСмену.Организация,
	|	ОтчетПроизводстваЗаСмену.Организация.ИНН КАК ОрганизацияИНН,
	|	ОтчетПроизводстваЗаСмену.Организация.КПП КАК ОрганизацияКПП
	|ИЗ
	|	Документ.ОтчетПроизводстваЗаСмену КАК ОтчетПроизводстваЗаСмену
	|ГДЕ
	|	ОтчетПроизводстваЗаСмену.Ссылка = &Ссылка
	|";
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать();
	Если НЕ ВыборкаШапка.Следующий() Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ХозяйствующийСубъект = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьХозСубъектПоКонтрагенту(ВыборкаШапка.Организация, ВыборкаШапка.ОрганизацияИНН, ВыборкаШапка.ОрганизацияКПП);
	Если ЗначениеЗаполнено(ХозяйствующийСубъект) Тогда
		СтрокаПредприятие = ХозяйствующийСубъект.Предприятия.Найти(ВыборкаШапка.ПодразделениеКомпании, "ОсновнойОтдел");
		Если НЕ СтрокаПредприятие = Неопределено И ЗначениеЗаполнено(СтрокаПредприятие.Предприятие) Тогда
			Предприятие = СтрокаПредприятие.Предприятие;
		КонецЕсли;
	КонецЕсли;
	
	ДатаВыработки = ВыборкаШапка.ДатаВыработки;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВложеннаяТаблица.Продукция КАК Номенклатура,
	|	ВложеннаяТаблица.ЭтоПолуфабрикат,
	|	ВложеннаяТаблица.КоэффициентВеса КАК КоэффициентВеса,
	|	МАКСИМУМ(ВложеннаяТаблица.СрокХраненияТовара) КАК СрокХраненияТовара,
	|	МАКСИМУМ(ВложеннаяТаблица.ЕдиницаИзмеренияСрокаХранения) КАК ЕдиницаИзмеренияСрокаХранения,
	|	СУММА(ВложеннаяТаблица.КоличествоПродукции) КАК КоличествоПродукции,
	|	СУММА(ВложеннаяТаблица.КоличествоПродукции*ВложеннаяТаблица.КоэффициентВеса) КАК Вес
	|ПОМЕСТИТЬ
	|	ТаблицаПродукции
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПроизводствоАвтоВыпуск.Продукция КАК Продукция,
	|		ВЫБОР
	|			КОГДА ПроизводствоАвтоВыпуск.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ВложенныйВыпускПолуфабрикатов) ТОГДА
	|				ИСТИНА
	|			ИНАЧЕ
	|				ЛОЖЬ
	|		КОНЕЦ КАК ЭтоПолуфабрикат,
	|		ПроизводствоАвтоВыпуск.Продукция.СрокХраненияТовара КАК СрокХраненияТовара,
	|		ПроизводствоАвтоВыпуск.Продукция.ЕдиницаИзмеренияСрокаХранения КАК ЕдиницаИзмеренияСрокаХранения,
	|		ВЫБОР
	|			КОГДА ПроизводствоАвтоВыпуск.Продукция.ОсновнаяЕдиницаИзмерения.ВесНетто ЕСТЬ NULL ТОГДА
	|				1
	|			КОГДА НЕ ПроизводствоАвтоВыпуск.Продукция.ОсновнаяЕдиницаИзмерения.ВесНетто = 0 ТОГДА
	|				ПроизводствоАвтоВыпуск.Продукция.ОсновнаяЕдиницаИзмерения.ВесНетто
	|			КОГДА НЕ ПроизводствоАвтоВыпуск.Продукция.ОсновнаяЕдиницаИзмерения.Вес = 0 ТОГДА
	|				ПроизводствоАвтоВыпуск.Продукция.ОсновнаяЕдиницаИзмерения.Вес
	|			ИНАЧЕ
	|				1
	|		КОНЕЦ КАК КоэффициентВеса,
	|		МАКСИМУМ(ПроизводствоАвтоВыпуск.КоличествоПродукции) КАК КоличествоПродукции,
	|		ПроизводствоАвтоВыпуск.НомерСтрокиПродукции
	|	ИЗ
	|		РегистрНакопления.ПроизводствоАвтоВыпуск КАК ПроизводствоАвтоВыпуск
	|	ГДЕ
	|		ПроизводствоАвтоВыпуск.Регистратор = &Ссылка
	|	СГРУППИРОВАТЬ ПО
	|		ПроизводствоАвтоВыпуск.Продукция,
	|		ВЫБОР
	|			КОГДА ПроизводствоАвтоВыпуск.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ВложенныйВыпускПолуфабрикатов) ТОГДА
	|				ИСТИНА
	|			ИНАЧЕ
	|				ЛОЖЬ
	|		КОНЕЦ,
	|		ПроизводствоАвтоВыпуск.НомерСтрокиПродукции) КАК ВложеннаяТаблица
	|СГРУППИРОВАТЬ ПО
	|	ВложеннаяТаблица.Продукция,
	|	ВложеннаяТаблица.ЭтоПолуфабрикат,
	|	ВложеннаяТаблица.КоэффициентВеса
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаПродукции.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(СоответствиеНоменклатурыВЕТИС.Продукция) КАК Продукция,
	|	МАКСИМУМ(СоответствиеНоменклатурыВЕТИС.Продукция.Родитель) КАК ВидПродукции,
	|	МАКСИМУМ(СоответствиеНоменклатурыВЕТИС.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	ТаблицаПродукции.ЭтоПолуфабрикат КАК ЭтоПолуфабрикат,
	|	ТаблицаПродукции.КоэффициентВеса КАК КоэффициентВеса,
	|	МАКСИМУМ(ТаблицаПродукции.СрокХраненияТовара) КАК СрокХраненияТовара,
	|	МАКСИМУМ(ТаблицаПродукции.ЕдиницаИзмеренияСрокаХранения) КАК ЕдиницаИзмеренияСрокаХранения,
	|	МАКСИМУМ(ТаблицаПродукции.КоличествоПродукции) КАК КоличествоПродукции,
	|	МАКСИМУМ(ТаблицаПродукции.Вес) КАК Вес
	|ИЗ
	|	ТаблицаПродукции КАК ТаблицаПродукции
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СоответствиеНоменклатурыВЕТИС КАК СоответствиеНоменклатурыВЕТИС
	|ПО
	|	ТаблицаПродукции.Номенклатура = СоответствиеНоменклатурыВЕТИС.Номенклатура
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродукции.Номенклатура,
	|	ТаблицаПродукции.ЭтоПолуфабрикат,
	|	ТаблицаПродукции.КоэффициентВеса
	|";
	
	ИдентификаторСтроки = 1;
	ВыборкаПродукция = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПродукция.Следующий() Цикл
		
		СтрокаПродукция = Продукция.Добавить();
		СтрокаПродукция.Номенклатура        = ВыборкаПродукция.Номенклатура;
		СтрокаПродукция.ВидПродукции        = ВыборкаПродукция.ВидПродукции;
		СтрокаПродукция.Продукция           = ВыборкаПродукция.Продукция;
		СтрокаПродукция.ЕдиницаИзмерения    = ВыборкаПродукция.ЕдиницаИзмерения;
		СтрокаПродукция.ИдентификаторСтроки = ИдентификаторСтроки;
		СтрокаПродукция.Количество          = ВыборкаПродукция.КоличествоПродукции;
		СтрокаПродукция.ДатаВыработки       = ДатаВыработки;
		СтрокаПродукция.ЭтоПолуфабрикат     = ВыборкаПродукция.ЭтоПолуфабрикат;
		СтрокаПродукция.КоэффициентВеса     = ВыборкаПродукция.КоэффициентВеса;
		СтрокаПродукция.Вес                 = ВыборкаПродукция.КоличествоПродукции*ВыборкаПродукция.КоэффициентВеса;
		
		Если ЗначениеЗаполнено(ВыборкаПродукция.СрокХраненияТовара) Тогда
			СтрокаПродукция.СрокГодности = СтрокаПродукция.ДатаВыработки + Перечисления.ЕдиницыИзмеренияВремени.ПолучитьСрокХраненияВСекундах(ВыборкаПродукция.СрокХраненияТовара, ВыборкаПродукция.ЕдиницаИзмеренияСрокаХранения);
		КонецЕсли;
		
		ИдентификаторСтроки = ИдентификаторСтроки + 1;
	КонецЦикла;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПроизводствоАвтоВыпуск.Ингредиент КАК Номенклатура,
	|	СУММА(ПроизводствоАвтоВыпуск.КоличествоИнгредиентаФакт) КАК КоличествоИнгредиентаФакт,
	|	ВЫБОР
	|		КОГДА ПроизводствоАвтоВыпуск.Ингредиент.ОсновнаяЕдиницаИзмерения.ВесНетто ЕСТЬ NULL ТОГДА
	|			1
	|		КОГДА НЕ ПроизводствоАвтоВыпуск.Ингредиент.ОсновнаяЕдиницаИзмерения.ВесНетто = 0 ТОГДА
	|			ПроизводствоАвтоВыпуск.Ингредиент.ОсновнаяЕдиницаИзмерения.ВесНетто
	|		КОГДА НЕ ПроизводствоАвтоВыпуск.Ингредиент.ОсновнаяЕдиницаИзмерения.Вес = 0 ТОГДА
	|			ПроизводствоАвтоВыпуск.Ингредиент.ОсновнаяЕдиницаИзмерения.Вес
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ КАК КоэффициентВеса
	|ИЗ
	|	РегистрНакопления.ПроизводствоАвтоВыпуск КАК ПроизводствоАвтоВыпуск
	|ГДЕ
	|	ПроизводствоАвтоВыпуск.Регистратор = &Ссылка
	|	И ПроизводствоАвтоВыпуск.КоличествоИнгредиентаФакт > 0
	|СГРУППИРОВАТЬ ПО
	|	ПроизводствоАвтоВыпуск.Ингредиент,
	|	ВЫБОР
	|		КОГДА ПроизводствоАвтоВыпуск.Ингредиент.ОсновнаяЕдиницаИзмерения.Вес ЕСТЬ NULL
	|				ИЛИ ПроизводствоАвтоВыпуск.Ингредиент.ОсновнаяЕдиницаИзмерения.Вес = 0
	|			ТОГДА 1
	|		ИНАЧЕ ПроизводствоАвтоВыпуск.Ингредиент.ОсновнаяЕдиницаИзмерения.Вес
	|	КОНЕЦ";
	
	ИдентификаторСтроки = 1;
	ВыборкаПродукция = Запрос.Выполнить().Выбрать();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяИнгредиент = Ингредиенты.Добавить();
		НоваяИнгредиент.Номенклатура        = Выборка.Номенклатура;
		НоваяИнгредиент.ИдентификаторСтроки = ИдентификаторСтроки;
		НоваяИнгредиент.Количество          = Выборка.КоличествоИнгредиентаФакт;
		НоваяИнгредиент.КоэффициентВеса     = Выборка.КоэффициентВеса;
		НоваяИнгредиент.Вес                 = Выборка.КоличествоИнгредиентаФакт*Выборка.КоэффициентВеса;
		
		ИдентификаторСтроки = ИдентификаторСтроки + 1;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПроизводственныеОперацииВЕТИС.Ссылка
	|ИЗ
	|	Документ.ПроизводственныеОперацииВЕТИС КАК ПроизводственныеОперацииВЕТИС
	|ГДЕ
	|	ПроизводственныеОперацииВЕТИС.ДокументОснование = &ДокументОснование
	|	И (НЕ ПроизводственныеОперацииВЕТИС.Ссылка = &Ссылка)";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВывестиСообщение(НСтр("ru = 'На основании документа <%1> уже введена производственная операция <%2>. У текущего документа связь с отчетом производства за смену будет убрана.'"),,,,,Строка(ДанныеЗаполнения),Строка(Выборка.Ссылка));
		ДокументОснование = Неопределено;
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ОтчетПроизводстваЗаСмену()

// Производит заполнение объекта на основании документа "Разделка"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Разделка(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Продукция.Очистить();
	Ингредиенты.Очистить();
	Партии.Очистить();
	ВСД.Очистить();
	ТаблицаРезультат.Очистить();
	Упаковки.Очистить();
	УпаковкиПродукции.Очистить();
	
	ХозОперация = Справочники.ХозОперации.ПроизводственныеОперацииВЕТИС;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Разделка.Дата КАК ДатаВыработки,
	|	Разделка.СкладКомпании.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	Разделка.Организация,
	|	Разделка.Организация.ИНН КАК ОрганизацияИНН,
	|	Разделка.Организация.КПП КАК ОрганизацияКПП
	|ИЗ
	|	Документ.Разделка КАК Разделка
	|ГДЕ
	|	Разделка.Ссылка = &Ссылка
	|";
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать();
	Если НЕ ВыборкаШапка.Следующий() Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ХозяйствующийСубъект = Справочники.ХозяйствующиеСубъектыВЕТИС.ПолучитьХозСубъектПоКонтрагенту(ВыборкаШапка.Организация, ВыборкаШапка.ОрганизацияИНН, ВыборкаШапка.ОрганизацияКПП);
	Если ЗначениеЗаполнено(ХозяйствующийСубъект) Тогда
		СтрокаПредприятие = ХозяйствующийСубъект.Предприятия.Найти(ВыборкаШапка.ПодразделениеКомпании, "ОсновнойОтдел");
		Если НЕ СтрокаПредприятие = Неопределено И ЗначениеЗаполнено(СтрокаПредприятие.Предприятие) Тогда
			Предприятие = СтрокаПредприятие.Предприятие;
		КонецЕсли;
	КонецЕсли;
	
	ДатаВыработки = ВыборкаШапка.ДатаВыработки;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПартииТоваровКомпании.Номенклатура КАК Номенклатура,
	|	ПартииТоваровКомпании.Номенклатура.СрокХраненияТовара КАК СрокХраненияТовара,
	|	ПартииТоваровКомпании.Номенклатура.ЕдиницаИзмеренияСрокаХранения КАК ЕдиницаИзмеренияСрокаХранения,
	|	ВЫБОР
	|		КОГДА ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто ЕСТЬ NULL ТОГДА
	|			1
	|		КОГДА НЕ ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто = 0 ТОГДА
	|			ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто
	|		КОГДА НЕ ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес = 0 ТОГДА
	|			ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ КАК КоэффициентВеса,
	|	СУММА(ПартииТоваровКомпании.Количество) КАК КоличествоПродукции
	|ПОМЕСТИТЬ
	|	ТаблицаПродукции
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.Регистратор = &Ссылка
	|	И ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровКомпании.Номенклатура,
	|	ВЫБОР
	|		КОГДА ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто ЕСТЬ NULL ТОГДА
	|			1
	|		КОГДА НЕ ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто = 0 ТОГДА
	|			ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто
	|		КОГДА НЕ ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес = 0 ТОГДА
	|			ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ
	|ИМЕЮЩИЕ
	|	СУММА(ПартииТоваровКомпании.Количество) > 0
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаПродукции.Номенклатура КАК Номенклатура,
	|	ТаблицаПродукции.КоэффициентВеса КАК КоэффициентВеса,
	|	МАКСИМУМ(ТаблицаПродукции.СрокХраненияТовара) КАК СрокХраненияТовара,
	|	МАКСИМУМ(ТаблицаПродукции.ЕдиницаИзмеренияСрокаХранения) КАК ЕдиницаИзмеренияСрокаХранения,
	|	МАКСИМУМ(ТаблицаПродукции.КоличествоПродукции) КАК КоличествоПродукции,
	|	МАКСИМУМ(ТаблицаПродукции.КоличествоПродукции)*ТаблицаПродукции.КоэффициентВеса КАК Вес,
	|	МАКСИМУМ(СоответствиеНоменклатурыВЕТИС.Продукция) КАК Продукция,
	|	МАКСИМУМ(СоответствиеНоменклатурыВЕТИС.Продукция.Родитель) КАК ВидПродукции,
	|	МАКСИМУМ(СоответствиеНоменклатурыВЕТИС.ЕдиницаИзмерения) КАК ЕдиницаИзмерения
	|ИЗ
	|	ТаблицаПродукции КАК ТаблицаПродукции
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СоответствиеНоменклатурыВЕТИС КАК СоответствиеНоменклатурыВЕТИС
	|ПО
	|	ТаблицаПродукции.Номенклатура = СоответствиеНоменклатурыВЕТИС.Номенклатура
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПродукции.Номенклатура,
	|	ТаблицаПродукции.КоэффициентВеса
	|";
	
	ИдентификаторСтроки = 1;
	ВыборкаПродукция = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПродукция.Следующий() Цикл
		
		СтрокаПродукция = Продукция.Добавить();
		СтрокаПродукция.Номенклатура        = ВыборкаПродукция.Номенклатура;
		СтрокаПродукция.ВидПродукции        = ВыборкаПродукция.ВидПродукции;
		СтрокаПродукция.Продукция           = ВыборкаПродукция.Продукция;
		СтрокаПродукция.ЕдиницаИзмерения    = ВыборкаПродукция.ЕдиницаИзмерения;
		СтрокаПродукция.ИдентификаторСтроки = ИдентификаторСтроки;
		СтрокаПродукция.Количество          = ВыборкаПродукция.КоличествоПродукции;
		СтрокаПродукция.ДатаВыработки       = ДатаВыработки;
		СтрокаПродукция.ЭтоПолуфабрикат     = Ложь;
		СтрокаПродукция.КоэффициентВеса     = ВыборкаПродукция.КоэффициентВеса;
		СтрокаПродукция.Вес                 = ВыборкаПродукция.Вес;
		
		Если ЗначениеЗаполнено(ВыборкаПродукция.СрокХраненияТовара) Тогда
			СтрокаПродукция.СрокГодности = СтрокаПродукция.ДатаВыработки + Перечисления.ЕдиницыИзмеренияВремени.ПолучитьСрокХраненияВСекундах(ВыборкаПродукция.СрокХраненияТовара, ВыборкаПродукция.ЕдиницаИзмеренияСрокаХранения);
		КонецЕсли;
		
		ИдентификаторСтроки = ИдентификаторСтроки + 1;
		
	КонецЦикла;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПартииТоваровКомпании.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто ЕСТЬ NULL ТОГДА
	|			1
	|		КОГДА НЕ ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто = 0 ТОГДА
	|			ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто
	|		КОГДА НЕ ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес = 0 ТОГДА
	|			ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ КАК КоэффициентВеса,
	|	СУММА(ПартииТоваровКомпании.Количество) КАК КоличествоИнгредиентаФакт
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.Регистратор = &Ссылка
	|	И ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровКомпании.Номенклатура,
	|	ВЫБОР
	|		КОГДА ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто ЕСТЬ NULL ТОГДА
	|			1
	|		КОГДА НЕ ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто = 0 ТОГДА
	|			ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.ВесНетто
	|		КОГДА НЕ ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес = 0 ТОГДА
	|			ПартииТоваровКомпании.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ
	|ИМЕЮЩИЕ
	|	СУММА(ПартииТоваровКомпании.Количество) > 0";
	
	ИдентификаторСтроки = 1;
	ВыборкаПродукция = Запрос.Выполнить().Выбрать();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяИнгредиент = Ингредиенты.Добавить();
		НоваяИнгредиент.Номенклатура        = Выборка.Номенклатура;
		НоваяИнгредиент.ИдентификаторСтроки = ИдентификаторСтроки;
		НоваяИнгредиент.Количество          = Выборка.КоличествоИнгредиентаФакт;
		НоваяИнгредиент.КоэффициентВеса     = Выборка.КоэффициентВеса;
		НоваяИнгредиент.Вес                 = Выборка.КоличествоИнгредиентаФакт*Выборка.КоэффициентВеса;
		
		ИдентификаторСтроки = ИдентификаторСтроки + 1;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПроизводственныеОперацииВЕТИС.Ссылка
	|ИЗ
	|	Документ.ПроизводственныеОперацииВЕТИС КАК ПроизводственныеОперацииВЕТИС
	|ГДЕ
	|	ПроизводственныеОперацииВЕТИС.ДокументОснование = &ДокументОснование
	|	И (НЕ ПроизводственныеОперацииВЕТИС.Ссылка = &Ссылка)";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВывестиСообщение(НСтр("ru = 'На основании документа <%1> уже введена производственная операция <%2>. У текущего документа связь с отчетом производства за смену будет убрана.'"),,,,,Строка(ДанныеЗаполнения),Строка(Выборка.Ссылка));
		ДокументОснование = Неопределено;
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Разделка()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "ВхДокНомер,ВхДокДатаВрем") Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	ВСД.Очистить();
	ТаблицаРезультат.Очистить();
	История = "";
	ИдентификаторПроизводственнойТранзакции = "";
	ЗавершениеПроизводственнойТранзакции = Ложь;
	
	Для Каждого ТекущаяСтрока Из Продукция Цикл
		ТекущаяСтрока.ВСД         = Неопределено;
		ТекущаяСтрока.НомерЗаписи = "";
	КонецЦикла;

	Для Каждого ТекущаяСтрока Из Партии Цикл
		ТекущаяСтрока.Израсходована = Ложь;
	КонецЦикла;

КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	ВыпущенныхПолуфабрикатов = 0 ;
	Полуфабрикатов = 0 ;
	Для Каждого ТекщаяСтрока Из Продукция Цикл
		Если ТекщаяСтрока.ЭтоПолуфабрикат Тогда
			Полуфабрикатов = Полуфабрикатов + 1;
			Если ЗначениеЗаполнено(ТекщаяСтрока.НомерЗаписи) Тогда
				ВыпущенныхПолуфабрикатов = ВыпущенныхПолуфабрикатов + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Полуфабрикатов > 0 И НЕ ЗначениеЗаполнено(ИдентификаторПроизводственнойТранзакции) Тогда
		ИдентификаторПроизводственнойТранзакции = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если ВыпущенныхПолуфабрикатов = Полуфабрикатов Тогда
		ЗавершениеПроизводственнойТранзакции = Истина;
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияВЕТИС.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

#КонецЕсли
