// Модуль менеджера справочника "Типы скидок"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	СкидкаОграничение = Справочники.ТипыСкидок.Ограничение.ПолучитьОбъект();
	
	// перезаполняем реквизиты
	Если НЕ ЗначениеЗаполнено(СкидкаОграничение.СпособВычисления) Тогда
		СкидкаОграничение.СпособВычисления = Перечисления.СкидкиСпособВычисления.Относительная;
	КонецЕсли;
	
	СкидкаОграничение.ИспользоватьДляФронтОфиса = Истина;
	СкидкаОграничение.ОбменДанными.Загрузка = Истина;	
	
	// Сохранение справочника
	Если СкидкаОграничение.Модифицированность() Тогда
		Попытка
			СкидкаОграничение.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""типы скидок"". Модифицирован элемент ""%1""'"),,,,,СокрЛП(СкидкаОграничение.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Типы скидок""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	СкидкаНеНайдена = Справочники.ТипыСкидок.НеНайдена.ПолучитьОбъект();
	
	// перезаполняем реквизиты
	Если НЕ ЗначениеЗаполнено(СкидкаНеНайдена.СпособВычисления) Тогда
		СкидкаНеНайдена.СпособВычисления = Перечисления.СкидкиСпособВычисления.Относительная;
	КонецЕсли;
	
	СкидкаНеНайдена.ИспользоватьДляФронтОфиса = Истина;
	СкидкаНеНайдена.ОбменДанными.Загрузка = Истина;
	
	// Сохранение справочника
	Если СкидкаНеНайдена.Модифицированность() Тогда
		Попытка
			СкидкаНеНайдена.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""типы скидок"". Модифицирован элемент ""%1""'"),,,,,СокрЛП(СкидкаНеНайдена.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Типы скидок""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
	Макет = ПолучитьМакет("НастройкиПоУмолчанию");
	Если Макет = Неопределено Тогда
		ВывестиСообщение(НСтр("ru='Не обнаружен макет начальных настроек.'"));
		Возврат;
	КонецЕсли;
	
	// Заполняем типы скидок для терминалов
	РеквизитыСпр=Макет.ПолучитьОбласть("ОбязательныеРеквизитыСправочника");
	Объект=Неопределено;
	Для НомерСтроки = 1 По РеквизитыСпр.ВысотаТаблицы Цикл
		Если РеквизитыСпр.Область(НомерСтроки,1).АвтоОтступ=0
			И Объект<>Неопределено И Объект.Модифицированность() Тогда
			НовыйЭлемент = Объект.ЭтоНовый();
			// Сохранение справочника
			Попытка
				Объект.Записать();
				ВывестиСообщение(НСтр("ru='Справочник ""ТипыСкидок"". ""%1"" элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Модифицирован"), СокрЛП(Объект.Наименование));
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Типы скидок""'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),УровеньЖурналаРегистрации.Ошибка,,,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
		Если РеквизитыСпр.Область(НомерСтроки,1).АвтоОтступ=0 Тогда
			Объект=Справочники.ТипыСкидок[РеквизитыСпр.Область(НомерСтроки,1).Текст].ПолучитьОбъект();
		Иначе
			Объект[РеквизитыСпр.Область(НомерСтроки,1).Текст]=Вычислить(РеквизитыСпр.Область(НомерСтроки,2).Текст);
		КонецЕсли;
		Если НомерСтроки=РеквизитыСпр.ВысотаТаблицы 
			И Объект<>Неопределено И Объект.Модифицированность() Тогда
			НовыйЭлемент = Объект.ЭтоНовый();
			// Сохранение справочника
			Попытка
				Объект.Записать();
				ВывестиСообщение(НСтр("ru='Справочник ""ТипыСкидок"". ""%1"" элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Модифицирован"), СокрЛП(Объект.Наименование));
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Типы скидок""'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),УровеньЖурналаРегистрации.Ошибка,,,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ВыполнитьНачальноеЗаполнение()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	// Обработаем в зависимости от вида элемента
	Если НЕ Объект.ЭтоГруппа Тогда
		ОбязательныеРеквизиты.Добавить("СпособВычисления");
		ОбязательныеРеквизиты.Добавить("ВидСкидки");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ФлагВытеснения");
	Возврат Результат;

КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Функция формирования наименования.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Функция СформироватьНаименованиеПоУмолчанию(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.Предопределенный Тогда
		Возврат Объект.Наименование;
	КонецЕсли;
	
	НовоеНаименование = "";
	
	Если ЗначениеЗаполнено(Объект.СпособВычисления) И ЗначениеЗаполнено(Объект.РучнаяСкидка) Тогда
		
		НовоеНаименование = ?(Объект.СпособВычисления=Перечисления.СкидкиСпособВычисления.Относительная, "Относительная", "Абсолютная");
		НовоеНаименование = НовоеНаименование + ?(Объект.РучнаяСкидка, " ручная"," автоматическая");
		НовоеНаименование = НовоеНаименование + ?(Объект.ФлагВытеснения, " вытесняющая", "");
		НовоеНаименование = НовоеНаименование + " скидка";
		
	КонецЕсли;
	
	Возврат НовоеНаименование;
	
КонецФункции // СформироватьНаименованиеПоУмолчанию()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли