// Модуль менеджера справочника "СтатьиДоходовИРасходов"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	Макет = ПолучитьМакет("НастройкиПоУмолчанию");
	Если Макет = Неопределено Тогда
		ВывестиСообщение(НСтр("ru='Не обнаружен макет начальных настроек.'"));
		Возврат;
	КонецЕсли;
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		
		// Считаем из макета Имя, Код, Наименование, ВидДоходаИРасхода, КоррСчет, ВидСтатьи, СтатьяРаспределения.
		СтрИмя = СокрЛП(Макет.Область(НомерСтроки,1).Текст);
		СтрКод = СокрЛП(Макет.Область(НомерСтроки,2).Текст);
		СтрНаименование = СокрЛП(Макет.Область(НомерСтроки,3).Текст);
		СтрВидДоходаИРасхода = СокрЛП(Макет.Область(НомерСтроки,4).Текст);
		СтрКоррСчет = СокрЛП(Макет.Область(НомерСтроки,5).Текст);
		СтрВидСтатьи = СокрЛП(Макет.Область(НомерСтроки,6).Текст);
		СтрСтатьяРаспределения = СокрЛП(Макет.Область(НомерСтроки,7).Текст);
		
		// берем предопределенный элемент
		ПредопределеннаяСтатья = Справочники.СтатьиДоходовИРасходов[СтрИмя];
		Если ПредопределеннаяСтатья.Пустая() Тогда
			ВывестиСообщение(НСтр("ru='Ошибка при заполнении справочника: ""%1"". Указан отсутствующий элемент справочника Статьи доходов и расходов.'"),,,,, СтрНаименование);
			Продолжить;
		КонецЕсли;
		ПредопределеннаяСтатьяОбъект = ПредопределеннаяСтатья.ПолучитьОбъект();
		
		// перезаполняем реквизиты
		ПредопределеннаяСтатьяОбъект.Наименование = СтрНаименование;
		
		// Заполняем Вид дохода и расхода
		Если ЗначениеЗаполнено(СтрВидДоходаИРасхода) Тогда
			СсылкаВидДоходаРасхода = Перечисления.ВидыДоходовИРасходов[СтрВидДоходаИРасхода];
			Если СсылкаВидДоходаРасхода.Пустая() Тогда
				ВывестиСообщение(НСтр("ru='Ошибка при заполнении статьи доходов и расходов: ""%1"". Виды доходов и расходов: ""%2"" не найден'"),,,,, СтрНаименование, СтрВидДоходаИРасхода);
			Иначе
				Если НЕ ЗначениеЗаполнено(ПредопределеннаяСтатьяОбъект.ВидДоходаИРасхода) Тогда
					ПредопределеннаяСтатьяОбъект.ВидДоходаИРасхода = СсылкаВидДоходаРасхода;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Заполняем Корр. счет
		Если ЗначениеЗаполнено(СтрКоррСчет) Тогда
			СсылкаКоррСчет = ПланыСчетов.Регламентированный.НайтиПоКоду(СтрКоррСчет);
			Если СсылкаКоррСчет.Пустая() Тогда
				ВывестиСообщение(НСтр("ru='Ошибка при заполнении статьи доходов и расходов: ""%1"". Корреспондирующий счет: ""%2"" не найден'"),,,,, СтрНаименование, СтрКоррСчет);
			Иначе
				Если НЕ ЗначениеЗаполнено(ПредопределеннаяСтатьяОбъект.КоррСчет) Тогда
					ПредопределеннаяСтатьяОбъект.КоррСчет = СсылкаКоррСчет;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Заполняем Статья распределения
		Если ЗначениеЗаполнено(СтрВидСтатьи) Тогда
			СсылкаВидСтатьиДоходаРасхода = Перечисления.ВидыСтатейДоходовИРасходов[СтрВидСтатьи];
			Если СсылкаВидСтатьиДоходаРасхода .Пустая() Тогда
				ВывестиСообщение(НСтр("ru='Ошибка при заполнении статьи доходов и расходов: ""%1"". Вид статьи дохода расхода: ""%2"" не найдена'"),,,,, СтрНаименование, СтрВидСтатьи);
			Иначе
				Если НЕ ЗначениеЗаполнено(ПредопределеннаяСтатьяОбъект.ВидСтатьи) Тогда
					ПредопределеннаяСтатьяОбъект.ВидСтатьи = СсылкаВидСтатьиДоходаРасхода;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Заполняем табличную часть Статьи распределения
		Если ЗначениеЗаполнено(СтрСтатьяРаспределения) Тогда
			СсылкаСтатьяРаспределения = Справочники.СтатьиДоходовИРасходов[СтрСтатьяРаспределения];
			Если СсылкаСтатьяРаспределения.Пустая() Тогда
				ВывестиСообщение(НСтр("ru='Ошибка при заполнении статьи доходов и расходов: ""%1"". Статья распределения: ""%2"" не найдена'"),,,,, СтрНаименование, СтрСтатьяРаспределения);
			Иначе
				Если ПредопределеннаяСтатьяОбъект.СтатьиРаспределения.Найти(СсылкаСтатьяРаспределения, "СтатьяРаспределения") = Неопределено Тогда
					СтрокаСтатьяРаспределения = ПредопределеннаяСтатьяОбъект.СтатьиРаспределения.Добавить();
					СтрокаСтатьяРаспределения.СтатьяРаспределения = СсылкаСтатьяРаспределения;
				КонецЕсли;
			КонецЕсли
		КонецЕсли;
		
		// Сохранение справочника
		НовыйЭлемент = ПредопределеннаяСтатьяОбъект.ЭтоНовый();
		Если ПредопределеннаяСтатьяОбъект.Модифицированность() Тогда
			Попытка
				ПредопределеннаяСтатьяОбъект.Записать();
				ВывестиСообщение(НСтр("ru='Справочник ""Статьи доходов и расходов"". ""%1"" элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(ПредопределеннаяСтатьяОбъект.Наименование));
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Статьи доходов и расходов""'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	// Обработаем в зависимости от вида элемента
	Если НЕ Объект.ЭтоГруппа Тогда
		ОбязательныеРеквизиты.Добавить("ВидДоходаИРасхода");
		ОбязательныеРеквизиты.Добавить("КоррСчет");
		ОбязательныеРеквизиты.Добавить("СтатьиРаспределения.СтатьяРаспределения");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли