// Модуль объекта справочника "Статьи доходов и расходов"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для формирования наименования/кода нового элемента.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - СправочникОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи объекта.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	// В табличной части "Статьи распределения" статья и статья для распределения не могут совпадать.
	// Иначе произойдет зацикливание.
	ТекстСообщения = "";
	Для Каждого Строка Из СтатьиРаспределения Цикл
		Если Строка.СтатьяРаспределения=Ссылка Тогда
			ВывестиСообщение(НСтр("ru='В качестве статьи для распределения нельзя указывать текущую статью. Номер строки: ""%1""'"), ЭтотОбъект,,, Отказ,Строка.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередЗаписью(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПередЗаписью(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	//Мальцев А.Ю. +++
	Если ЗначениеЗаполнено(итПричинаВозврата) Тогда
		СтатьяСПричинойВозврата = ПроверитьНаличеСтатьиСПричинойВозврата();
		Если Не ПустаяСтрока(СтатьяСПричинойВозврата) Тогда
			ВывестиСообщение(НСтр("ru='Указанная причина возврата уже исполььзуются в статье: ""%1""'"), ЭтотОбъект,,, Отказ, СтатьяСПричинойВозврата);
		КонецЕсли;	
	КонецЕсли;
	//Мальцев А.Ю. ---

КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

//Мальцев А.Ю. +++
Функция ПроверитьНаличеСтатьиСПричинойВозврата()
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатьиДоходовИРасходов.Наименование КАК Наименование
	|ИЗ
	|	Справочник.СтатьиДоходовИРасходов КАК СтатьиДоходовИРасходов
	|ГДЕ
	|	СтатьиДоходовИРасходов.ПометкаУдаления = ЛОЖЬ
	|	И СтатьиДоходовИРасходов.итПричинаВозврата = &ПричинаВозврата
	|	И СтатьиДоходовИРасходов.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ПричинаВозврата", итПричинаВозврата);
	Запрос.УстановитьПараметр("Ссылка", 		 Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = ВыборкаДетальныеЗаписи.Наименование;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Мальцев А.Ю. ---


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли