
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

&НаСервере
Процедура ЗапроситьВидПродукции(СтрокаРодителя, СкрытьЗагруженные)
	
	УровеньВложенности = СтрокаРодителя.УровеньВложенности + 1;
	
	СтрокиРодителя = СтрокаРодителя.ПолучитьЭлементы();
	
	//ТекущийПроцент = 0;
	Смещение = 0;
	Шаг      = 500;
	Пока Шаг>0 Цикл
		Результат = ИнтеграцияВЕТИС.ЗапросНаПолучениеСпискаПродукцииПоТипу(ХозяйствующийСубъект, СтрокаРодителя.Код, Смещение, Шаг);
		Если Результат = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ПроцентИнкремент = 500 / Результат.total;
		Для Каждого ТекущаяЗапись Из Результат.product Цикл
			НоваяСтрока = СтрокиРодителя.Добавить();
			НоваяСтрока.Продукция           = СокрЛП(ТекущаяЗапись.name);
			НоваяСтрока.УровеньВложенности  = УровеньВложенности;
			НоваяСтрока.Продукция           = Справочники.ПродукцияВЕТИС.НайтиПоКоду(ТекущаяЗапись.guid);
			НоваяСтрока.Код                 = ТекущаяЗапись.guid;
			НоваяСтрока.Наименование        = ТекущаяЗапись.name;
			НоваяСтрока.КартинкаЭлемента    = 6;
			НоваяСтрока.Пометка             = Ложь;
			//НоваяСтрока.Пометка        = ЗначениеЗаполнено(НоваяСтрока.Продукция);
			НоваяСтрока.ИдентификаторЗаписи = НоваяСтрока.Продукция.ИдентификаторЗаписи;
			НоваяСтрока.НовыйИдентификаторЗаписи = ТекущаяЗапись.uuid;
			
			//ОбъектXDTO = Новый Структура;
			//
			//СвойстваОбъекта = ТекущаяЗапись.Свойства();
			//Для Каждого ТекущееСвойство Из СвойстваОбъекта Цикл
			//	ОбъектXDTO.Вставить(ТекущееСвойство.Имя, ТекущаяЗапись[ТекущееСвойство.Имя]);
			//КонецЦикла;
			
			НоваяСтрока.ОбъектXDTO = ТекущаяЗапись;
			
			КоличествоЗаписей = ЗапроситьПодВидПродукции(НоваяСтрока, СкрытьЗагруженные);
			Если СкрытьЗагруженные И КоличествоЗаписей = 0 Тогда
				СтрокиРодителя.Удалить(НоваяСтрока);
			КонецЕсли;
			
			//ТекущийПроцент = ТекущийПроцент + ПроцентИнкремент;
			
			//#Если НЕ МобильныйКлиент Тогда
			//	Состояние(НСтр("ru='Загрузка иерархии продукции'"), ТекущийПроцент);
			//#КонецЕсли
			
		КонецЦикла;
		
		Смещение = Смещение + Шаг;
		Шаг      = Мин(500, Результат.total-Смещение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗапроситьПодВидПродукции(СтрокаРодителя, СкрытьЗагруженные)
	
	КоличествоЗаписей = 0;
	
	УровеньВложенности = СтрокаРодителя.УровеньВложенности + 1;
	
	СтрокиРодителя = СтрокаРодителя.ПолучитьЭлементы();
	
	Смещение = 0;
	Шаг      = 500;
	Пока Шаг>0 Цикл
		Результат = ИнтеграцияВЕТИС.ЗапросНаПолучениеСпискаВидовПродукцииПоПродукту(ХозяйствующийСубъект, СтрокаРодителя.Код, Смещение, Шаг);
		Если Результат = Неопределено Тогда
			Возврат 0;
		КонецЕсли;
		Для Каждого ТекущаяЗапись Из Результат.SubProduct Цикл
			
			Продукция = Справочники.ПродукцияВЕТИС.НайтиПоКоду(ТекущаяЗапись.guid);
			
			Если ЗначениеЗаполнено(Продукция) Тогда
				ИдентификаторЗаписи = Продукция.ИдентификаторЗаписи;
				Если СкрытьЗагруженные И ИдентификаторЗаписи = ТекущаяЗапись.uuid Тогда
					Продолжить;
				КонецЕсли;
			Иначе
				ИдентификаторЗаписи = "";
			КонецЕсли;
			
			НоваяСтрока = СтрокиРодителя.Добавить();
			НоваяСтрока.Пометка             = Ложь;
			НоваяСтрока.Продукция           = СокрЛП(ТекущаяЗапись.name);
			НоваяСтрока.УровеньВложенности  = УровеньВложенности;
			НоваяСтрока.Продукция           = Продукция;
			НоваяСтрока.Код                 = ТекущаяЗапись.guid;
			НоваяСтрока.Наименование        = ТекущаяЗапись.name;
			НоваяСтрока.КартинкаЭлемента    = 6;
			НоваяСтрока.Пометка             = Ложь;
			//НоваяСтрока.Использование       = ЗначениеЗаполнено(НоваяСтрока.Продукция);
			НоваяСтрока.ИдентификаторЗаписи = ИдентификаторЗаписи;
			НоваяСтрока.НовыйИдентификаторЗаписи = ТекущаяЗапись.uuid;
			
			//ОбъектXDTO = Новый Структура;
			//
			//СвойстваОбъекта = ТекущаяЗапись.Свойства();
			//Для Каждого ТекущееСвойство Из СвойстваОбъекта Цикл
			//	ОбъектXDTO.Вставить(ТекущееСвойство.Имя, ТекущаяЗапись[ТекущееСвойство.Имя]);
			//КонецЦикла;
			
			НоваяСтрока.ОбъектXDTO          = ТекущаяЗапись;
			
			КоличествоЗаписей = КоличествоЗаписей + 1;
			
		КонецЦикла;
		
		Смещение = Смещение + Шаг;
		Шаг      = Мин(500, Результат.total-Смещение);
	КонецЦикла;
	
	Возврат КоличествоЗаписей;
	
КонецФункции

// Загружает данные с сервера ВЕТИС
&НаСервере
Процедура ЗапроситьПродукцию()
	
	СкрытьЗагруженные = Элементы.ДеревоПродукцииСкрытьЗагруженные.Пометка;
	ДеревоПродукции.ПолучитьЭлементы().Очистить();
	
	Если НЕ ЗначениеЗаполнено(ХозяйствующийСубъект) Тогда
		ВывестиСообщение(НСтр("ru='Не заполнен Хозяйствующий субъект'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипПродукции) Тогда
		ВывестиСообщение(НСтр("ru='Не заполнен тип продукции'"));
		Возврат;
	КонецЕсли;
	
	МассивРодителей = Новый Массив;
	МассивРодителей.Добавить(ТипПродукции);
	
	ТекРодитель = ТипПродукции.Родитель;
	Пока ЗначениеЗаполнено(ТекРодитель) Цикл
		МассивРодителей.Добавить(ТекРодитель);
		ТекРодитель = ТекРодитель.Родитель;
	КонецЦикла;
	
	НоваяСтрока = Неопределено;
	
	ТекГраница = МассивРодителей.ВГраница();
	УровеньДерева = ДеревоПродукции.ПолучитьЭлементы();
	УровеньВложенности = 1;
	КартинкаЭлемента = 10;
	Пока ТекГраница>=0 Цикл
		
		ТекРодитель = МассивРодителей[ТекГраница];
		НоваяСтрока = УровеньДерева.Добавить();
		НоваяСтрока.Используется       = Истина;
		НоваяСтрока.Наименование       = СокрЛП(ТекРодитель);
		НоваяСтрока.УровеньВложенности = УровеньВложенности;
		НоваяСтрока.Продукция          = ТекРодитель;
		НоваяСтрока.Код                = ТекРодитель.Код;
		НоваяСтрока.КартинкаЭлемента   = КартинкаЭлемента;
		
		УровеньДерева = НоваяСтрока.ПолучитьЭлементы();
		УровеньВложенности = 2;
	
		КартинкаЭлемента = 6;
		
		ТекГраница = ТекГраница - 1;
	КонецЦикла;
	
	Если НоваяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока.УровеньВложенности = 1 Тогда
		ЗапроситьВидПродукции(НоваяСтрока, СкрытьЗагруженные);
	ИначеЕсли НоваяСтрока.УровеньВложенности = 2 Тогда
		ЗапроситьПодВидПродукции(НоваяСтрока, СкрытьЗагруженные);
	КонецЕсли;
	
КонецПроцедуры // ЗапроситьПродукцию()

// Устанавливает/Снимает пометку
&НаКлиенте
Процедура УстановитьИспользование(СтрокиДерева, Использование)
	
	Для Каждого ТекущаяСтрока Из СтрокиДерева Цикл
		ТекущаяСтрока.Пометка = Использование;
		УстановитьИспользование(ТекущаяСтрока.ПолучитьЭлементы(), Использование);
	КонецЦикла;
	
КонецПроцедуры // УстановитьИспользование()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события возникающего при выполнении команды "Загрузить продукцию" в контексте сервера.
//
&НаСервере
Процедура ЗагрузитьПродукциюНаСервере()
	
	НастройкаПодключения = ИнтеграцияВЕТИС.ПолучитьНастройкуПодключения(ХозяйствующийСубъект);
	
	Для Каждого ТекТипПродукции Из ДеревоПродукции.ПолучитьЭлементы() Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекТипПродукции.Продукция) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ВидПродукции Из ТекТипПродукции.ПолучитьЭлементы() Цикл
			
			Если НЕ ВидПродукции.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Если (Не ЗначениеЗаполнено(ВидПродукции.Продукция)) ИЛИ 
				(НЕ ВидПродукции.ИдентификаторЗаписи = ВидПродукции.ИдентификаторЗаписи) Тогда
				ВидПродукции.Продукция = ИнтеграцияВЕТИС.ЗагрузитьПродукцию(НастройкаПодключения,, ВидПродукции.ОбъектXDTO, ТекТипПродукции.Продукция);
			КонецЕсли;
			
			Для Каждого ПодВидПродукции Из ВидПродукции.ПолучитьЭлементы() Цикл
				
				Если НЕ ПодВидПродукции.Пометка Тогда
					Продолжить;
				КонецЕсли;
				
				Если (Не ЗначениеЗаполнено(ПодВидПродукции.Продукция)) ИЛИ 
					(НЕ ПодВидПродукции.ИдентификаторЗаписи = ПодВидПродукции.ИдентификаторЗаписи) Тогда
					ПодВидПродукции.Продукция           = ИнтеграцияВЕТИС.ЗагрузитьВидПродукции(НастройкаПодключения,, ПодВидПродукции.ОбъектXDTO, ТекТипПродукции.Продукция, ВидПродукции.Продукция);
					ПодВидПродукции.ИдентификаторЗаписи = ПодВидПродукции.Продукция.ИдентификаторЗаписи;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры // ЗагрузитьПродукциюНаСервере()

// Обработчик события возникающего на клиенте при выполнении команды "Загрузить продукцию".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура ЗагрузитьПродукцию(Команда)
	ЗагрузитьПродукциюНаСервере();
	ОповеститьОбИзменении(Тип("СправочникСсылка.ПродукцияВЕТИС"));
	Закрыть();
КонецПроцедуры // ЗагрузитьПродукцию()

// Обработчик события возникающего на клиенте при выполнении команды "Скрыть загруженные".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура СкрытьЗагруженные(Команда)
	
	Элементы.ДеревоПродукцииСкрытьЗагруженные.Пометка = НЕ Элементы.ДеревоПродукцииСкрытьЗагруженные.Пометка;
	ЗапроситьПродукцию();
	
КонецПроцедуры //СкрытьЗагруженные()

// Обработчик события возникающего на клиенте при выполнении команды "Установить/Снять все".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура УстановитьСнятьВсе(Команда)
	
	УстановитьИспользование(ДеревоПродукции.ПолучитьЭлементы(),СтрНайти(Команда.Имя, "Установить") > 0);
	
КонецПроцедуры //УстановитьСнятьВсе()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Свернуть все".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	Для Каждого ТекущаяСтрока Из ДеревоПродукции.ПолучитьЭлементы() Цикл
		Для Каждого ТекущаяПодСтрока Из ТекущаяСтрока.ПолучитьЭлементы() Цикл
			Элементы.ДеревоПродукции.Свернуть(ТекущаяПодСтрока.ПолучитьИдентификатор());
		КонецЦикла;
		Элементы.ДеревоПродукции.Свернуть(ТекущаяСтрока.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры // СвернутьВсе()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Развернуть".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Развернуть(Команда)
	
	Для Каждого ТекущаяСтрока Из ДеревоПродукции.ПолучитьЭлементы() Цикл
		Элементы.ДеревоПродукции.Развернуть(ТекущаяСтрока.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры // Развернуть()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Транспортный модуль".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ХозяйствующийСубъектПриИзменении(Элемент)
	ЗапроситьПродукцию();
КонецПроцедуры //ХозяйствующийСубъектПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Тип продукции".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТипПродукцииПриИзменении(Элемент)
	ЗапроситьПродукцию();
КонецПроцедуры //ТипПродукцииПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Пометка".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДеревоПродукцииПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоПродукции.ТекущиеДанные;
	
	Если ТекущиеДанные.УровеньВложенности = 2 Тогда
		Для Каждого ТекСтрока Из ТекущиеДанные.ПолучитьЭлементы() Цикл
			ТекСтрока.Пометка = ТекущиеДанные.Пометка;
		КонецЦикла;
		Элементы.ДеревоПродукции.Развернуть(ТекущиеДанные.ПолучитьИдентификатор(), Истина);
	КонецЕсли;
	
	Если Не ТекущиеДанные.Пометка Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийРодитель = ТекущиеДанные.ПолучитьРодителя();
	
	Пока НЕ ТекущийРодитель = Неопределено Цикл
		ТекущийРодитель.Пометка = Истина;
		ТекущийРодитель = ТекущийРодитель.ПолучитьРодителя();
	КонецЦикла;
	
КонецПроцедуры // ДеревоПродукцииПометкаПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НачальноеЗначениеВыбора") Тогда
		ХозяйствующийСубъект = Параметры.НачальноеЗначениеВыбора.ХозяйствующийСубъект;
		ТипПродукции = Параметры.НачальноеЗначениеВыбора.ТипПродукции;
	КонецЕсли;
	
	ЗапроситьПродукцию();

КонецПроцедуры // ПриСозданииНаСервере()


