
#Область ПрограммныйИнтерфейс

// Функция формирует таблицу где каждой ссылке справочника соответствует его идентификатор.
// Способна вернуть таблицу значений и/или поместить таблицу в менеджер временных таблиц.
//
// Параметры:
//	ИмяСправочника			- Строка					- Имя правочника как он задан в дереве конфигурации. 
//	ИмяДанных				- Строка					- Используется при формировании имен полей и таблицы помещения.
//	МенеджерВременныхТаблиц	- МенеджерВременныхТаблиц	- Если передан менеджер временных таблиц, то результат будет 
//															помещен в таблицу "УникальныеИдентификаторы_" + ИмяДанных.
//	ВернутьТаблицу			- Булево					- Если установлено значение истина, функция вернет таблицу значений
//															содержащую идентификаторы ссылок элементов справочника.
// Возвращаемое значение:
//	Если параметр "ВернутьТаблицу" равен ЛОЖЬ	- Возвращает ИСТИНА.
//	Если параметр "ВернутьТаблицу" равен ИСТИНА	- Возвращает таблицу значений с полями:
//													- ИмяДанных - Ссылка на элементы справочника,
//													- ИмяДанных + "_УникальныйИдентификатор" - Уникальный идентификатор элемента справочника.
//
Функция ПолучитьУникальныеИдентификаторыСправочника(ИмяСправочника, ИмяДанных, МенеджерВременныхТаблиц = Неопределено, ВернутьТаблицу = Ложь) Экспорт 
	
	ИмяПоляИдентификатора = СтрШаблон("%1_УникальныйИдентификатор", ИмяДанных);
	Запрос = SSL_IT_СхемыЗапросов.ПолучитьЗапрос(
		СтрШаблон(
			"ВЫБРАТЬ
			|	%1.Ссылка КАК %2,
			|	""00000000-0000-0000-0000-000000000000"" КАК %3
			|ИЗ
			|	Справочник.%1 КАК %1",
			ИмяСправочника,
			ИмяДанных,
			ИмяПоляИдентификатора),
		МенеджерВременныхТаблиц);	
		
	РезультатЗапроса	= Запрос.Выполнить();
	ТаблицаДанных		= РезультатЗапроса.Выгрузить();	
	
	// Заполнение идентификаторов
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл 
		СтрокаДанных[ИмяПоляИдентификатора] = Строка(СтрокаДанных[ИмяДанных].УникальныйИдентификатор());	
	КонецЦикла;	
	
	// Помещение результата
	Запрос.Текст = 
		СтрШаблон(
			"ВЫБРАТЬ
			|	ТаблицаДанных.%1 КАК %1,
			|	ТаблицаДанных.%2 КАК %2
			|ПОМЕСТИТЬ УникальныеИдентификаторы_%1
			|ИЗ
			|	&ТаблицаДанных КАК ТаблицаДанных",
			ИмяДанных,
			ИмяПоляИдентификатора);
			
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	
	Если ВернутьТаблицу Тогда 
		РезультатЗапроса = Запрос.Выполнить();
		Возврат РезультатЗапроса.Выгрузить();
	Иначе
		Запрос.Выполнить();
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьТаблицуРеквизитовОбъектов(МассивСсылок, ИменаРеквизитов) Экспорт 

	Если ТипЗнч(МассивСсылок) <> Тип("Массив")
		И МассивСсылок.Количество() = 0 Тогда 
		Возврат Неопределено;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка, " + ИменаРеквизитов + "
		|ИЗ
		|	" + МассивСсылок[0].Метаданные().ПолноеИмя() + " КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ТабицаРеквизитов = Запрос.Выполнить().Выгрузить(); 
	
	Возврат ТабицаРеквизитов;
	
КонецФункции

Функция ПолучитьМассивЗначенийРеквизитаОбъектов(МассивСсылок, ИмяРеквизита) Экспорт 
	
	Если СтрНайти(ИмяРеквизита, ",") > 0 Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ТабицаРеквизитов = ПолучитьТаблицуРеквизитовОбъектов(МассивСсылок, ИмяРеквизита);
	
	Если ТабицаРеквизитов = Неопределено Тогда 
		Возврат Неопределено;
	Иначе 
		Возврат SSL_IT_ОбработкаДанных.ПолучитьУникальныеЗначенияКолонкиТаблицыЗначений(ТабицаРеквизитов, ИмяРеквизита);
	КонецЕсли;	
	
КонецФункции

Функция СформироватьСтруктуруИдентификаторовОбъектовМетаданных(ИменаОбъектовМетаданных, ИмяТипаОбъектовМетаданных, СтруктураИдентификаторов = Неопределено) Экспорт 

	МассивИменОбъектовМетаданных			= SSL_IT_ОбработкаДанных.ПолучитьКоллекциюКакМассив(ИменаОбъектовМетаданных);
	ПустойИдентификаторОбъектаМетаданных	= Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();
	
	Для Каждого ИмяОбъектаметаМетаданных Из МассивИменОбъектовМетаданных Цикл 
		ПолноеИмяОбъектаМетаданных		= ИмяТипаОбъектовМетаданных + "." + ИмяОбъектаметаМетаданных;
		ИдентификаторОбъектаМетаданных	= Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", ПолноеИмяОбъектаМетаданных);
		SSL_IT_ОбработкаДанных.ДобавитьСвойствоСтруктуры(СтруктураИдентификаторов, ИмяОбъектаметаМетаданных, ИдентификаторОбъектаМетаданных, ПустойИдентификаторОбъектаМетаданных);
	КонецЦикла;	
	
	Возврат СтруктураИдентификаторов;
	
КонецФункции	

Функция ПолучитьТаблицуПериодов(НачалоПериода, КонецПериода, Периодичность) Экспорт 
	
	Если ТипЗнч(Периодичность) = Тип("ПеречислениеСсылка.Периодичность") Тогда 
		ТаблицаПеречисления	= ПолучитьТаблицуПеречисления("Периодичность");
		СтрокаПеречисления	= ТаблицаПеречисления.Найти(Периодичность, "Значение");
		
		Если СтрокаПеречисления <> Неопределено Тогда 
			ПериодичностьСтрока = ВРег(Строка(СтрокаПеречисления.Ключ));	
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
	Иначе	
		Возврат Неопределено;
	КонецЕсли;	
	
	// Построение запроса	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	0 КАК Цифра
		|ПОМЕСТИТЬ Единицы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	4
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	5
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	6
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	7
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	8
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	9
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Десятки.Цифра * 10 КАК Цифра
		|ПОМЕСТИТЬ Десятки
		|ИЗ
		|	Единицы КАК Десятки
		|ГДЕ
		|	Десятки.Цифра * 10 <= РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, " + ПериодичностьСтрока + ")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотни.Цифра * 10 КАК Цифра
		|ПОМЕСТИТЬ Сотни
		|ИЗ
		|	Десятки КАК Сотни
		|ГДЕ
		|	Сотни.Цифра * 10 <= РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, " + ПериодичностьСтрока + ")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Тысячи.Цифра * 10 КАК Цифра
		|ПОМЕСТИТЬ Тысячи
		|ИЗ
		|	Сотни КАК Тысячи
		|ГДЕ
		|	Тысячи.Цифра * 10 <= РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, " + ПериодичностьСтрока + ")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДесяткиТысяч.Цифра * 10 КАК Цифра
		|ПОМЕСТИТЬ ДесяткиТысяч
		|ИЗ
		|	Тысячи КАК ДесяткиТысяч
		|ГДЕ
		|	ДесяткиТысяч.Цифра * 10 <= РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, " + ПериодичностьСтрока + ")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотниТысяч.Цифра * 10 КАК Цифра
		|ПОМЕСТИТЬ СотниТысяч
		|ИЗ
		|	ДесяткиТысяч КАК СотниТысяч
		|ГДЕ
		|	СотниТысяч.Цифра * 10 <= РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, " + ПериодичностьСтрока + ")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДОБАВИТЬКДАТЕ(&НачалоПериода, " + ПериодичностьСтрока + ", СотниТысяч.Цифра + ДесяткиТысяч.Цифра + Тысячи.Цифра + Сотни.Цифра + Десятки.Цифра + Единицы.Цифра) КАК ДатаПериода
		|ПОМЕСТИТЬ Календарь
		|ИЗ
		|	СотниТысяч КАК СотниТысяч,
		|	ДесяткиТысяч КАК ДесяткиТысяч,
		|	Тысячи КАК Тысячи,
		|	Сотни КАК Сотни,
		|	Десятки КАК Десятки,
		|	Единицы КАК Единицы
		|ГДЕ
		|	СотниТысяч.Цифра + ДесяткиТысяч.Цифра + Тысячи.Цифра + Сотни.Цифра + Десятки.Цифра + Единицы.Цифра <= РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, " + ПериодичностьСтрока + ")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Календарь.ДатаПериода, " + ПериодичностьСтрока + ") КАК Период
		|ИЗ
		|	Календарь КАК Календарь
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);

	Результат		= Запрос.Выполнить();
	ТаблицаПериодов	= Результат.Выгрузить();
	
	Возврат ТаблицаПериодов;
	
КонецФункции	

Функция ПолучитьТаблицуПеречисления(ИмяПеречисления) Экспорт 
	
	ЗначенияПеречисления	= Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления;
	ТаблицаПеречисления		= Новый ТаблицаЗначений();
	
	ТаблицаПеречисления.Колонки.Добавить("Значение",	Новый ОписаниеТипов("ПеречислениеСсылка." + ИмяПеречисления));
	ТаблицаПеречисления.Колонки.Добавить("Ключ",		Новый ОписаниеТипов("Строка"));	
	ТаблицаПеречисления.Колонки.Добавить("Синоним",		Новый ОписаниеТипов("Строка"));
	
	Для Каждого ЗначениеПеречисления ИЗ ЗначенияПеречисления Цикл
		НоваяСтрока 			= ТаблицаПеречисления.Добавить();
		НоваяСтрока.Ключ		= Строка(ЗначениеПеречисления.Имя);
		НоваяСтрока.Значение	= Перечисления[ИмяПеречисления][НоваяСтрока.Ключ];
		НоваяСтрока.Синоним		= Строка(ЗначениеПеречисления);
	КонецЦикла;
	
	Возврат ТаблицаПеречисления;
	
КонецФункции	

#КонецОбласти