// Общий модуль "Обработка событий документа (клиент)"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ПолучитьРазрешенияДляПересчета(Форма, ПараметрыДействия, КоллекцияОпераций=Неопределено, ОбработчикСобытия=Неопределено, Объект = Неопределено) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	// Получаем статус заполнения объекта из параметров действия.
	ОбъектЗаполнен = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ОбъектЗаполнен", ИСТИНА);
	
	// Получаем признаки необходимости произвести пересчет.
	ВозможенПересчетСуммы = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ПересчетСуммы",         ИСТИНА);
	ТребуетсяИзменитьКурс = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТребуетсяИзменитьКурс", ЛОЖЬ);
	ТребуетсяИзменитьКурсУпр = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТребуетсяИзменитьКурсУпр", ЛОЖЬ);
	ТребуетсяИзменитьКурсВзаиморасчетов = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТребуетсяИзменитьКурсВзаиморасчетов", ЛОЖЬ);
	ТребуетсяУстановкаЦен = ОбъектЗаполнен И ВозможенПересчетСуммы 
								И ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТребуетсяУстановкаЦен", ЛОЖЬ);
	ТребуетсяПересчетЦен  = ОбъектЗаполнен И ВозможенПересчетСуммы 
								И ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТребуетсяПересчетЦен",  ЛОЖЬ);
	ТребуетсяЗаполнитьНаОсновании = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТребуетсяЗаполнитьНаОсновании", ЛОЖЬ);
	
	// Инициализируем коллекцию вопросов/
	Если КоллекцияОпераций=Неопределено Тогда
		КоллекцияОпераций = Новый Структура();
	КонецЕсли;
	
	// Формируем комплект параметров, который будет передаваться между формами.
	ПараметрыВопросов = Новый Структура();
	
	// Добавляем вопрос перезаполнение документа по основанию.
	Если ТребуетсяЗаполнитьНаОсновании Тогда
		ТребуетсяЗаполнитьНаОсновании = 
			Новый ОписаниеОповещения("ОбработкаРезультатаОтветаНаВопросТребуетсяЗаполнитьНаОсновании", 
				ОбработкаРеквизитовДокументаКлиент, ПараметрыВопросов);
		ПоследовательныеОперации.ДобавитьВопросДаНет(КоллекцияОпераций, "ТребуетсяЗаполнитьНаОсновании", 
			НСтр("ru='Был изменен документ основание.'")+Символы.ПС+НСтр("ru = 'Выполнить перезаполнение?'"),,,
			ТребуетсяЗаполнитьНаОсновании);
	КонецЕсли;
	
	// Добавляем вопрос о перезаполнении цен.
	Если ТребуетсяИзменитьКурс Тогда
		// Получим новые значения курсов валют.
		КурсВалютыДокумента = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "НовыйКурс", 0);
		
		Если КурсВалютыДокумента>0 Тогда
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Валюта документа <%1> на дату %2 имеет курс %3, отличный от курса в документе %4.'"), 
				Объект.ВалютаДокумента, Формат(Объект.Дата,"ДЛФ=D"), Формат(КурсВалютыДокумента,"ЧЦ=10; ЧДЦ=4"), Формат(Объект.КурсДокумента,            "ЧЦ=10; ЧДЦ=4")) + Символы.ПС;
			ТекстОбъекта = НСтр("ru='Изменить курс'") + ?(ПустаяСтрока(ТекстОбъекта), "", ",") + " "+ НСтр("ru='документа'");
		
			// Производим добавление вопроса в очередь
			ПоследовательныеОперации.ДобавитьВопросДаНет(КоллекцияОпераций, "ТребуетсяИзменитьКурс", ТекстВопроса + ТекстОбъекта + "?");
			
			Если НЕ Форма.РазрешитьРедактированиеЦенИСумм Тогда
				КоллекцияОпераций.ТребуетсяИзменитьКурс.Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТребуетсяИзменитьКурсУпр Тогда
		// Получим новые значения курсов валют.
		КурсУправленческий  = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "НовыйКурсУпр", 0);
		
		Если КурсУправленческий>0 Тогда
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Курс валюты управленческого учета на дату %1 имеет курс %2, отличный от курса в документе %3.'"),
				Формат(Объект.Дата,"ДЛФ=D"), Формат(КурсУправленческий, "ЧЦ=10; ЧДЦ=4"), Формат(Объект.КурсВалютыУпр, "ЧЦ=10; ЧДЦ=4")) + Символы.ПС;
			ТекстОбъекта = НСтр("ru='Изменить курс'") + ?(ПустаяСтрока(ТекстОбъекта), "", ",") + " " + НСтр("ru='валюты управленческого учета'");
		
			// Производим добавление вопроса в очередь
			ПоследовательныеОперации.ДобавитьВопросДаНет(КоллекцияОпераций, "ТребуетсяИзменитьКурсУпр", ТекстВопроса + ТекстОбъекта + "?");
			Если НЕ Форма.РазрешитьРедактированиеЦенИСумм Тогда
				КоллекцияОпераций.ТребуетсяИзменитьКурсУпр.Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТребуетсяИзменитьКурсВзаиморасчетов Тогда
		// Получим новые значения курсов валют.
		КурсВзаиморасчетов  = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "НовыйКурсВзаиморасчетов", 0);
		
		Если КурсВзаиморасчетов>0 Тогда
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Курс валюты взаиморасчетов на дату %1 имеет курс %2, отличный от курса в документе %3.'"),
				Формат(Объект.Дата,"ДЛФ=D"), Формат(КурсВзаиморасчетов, "ЧЦ=10; ЧДЦ=4"), Формат(Объект.КурсВалютыВзаиморасчетов, "ЧЦ=10; ЧДЦ=4")) + Символы.ПС;
			ТекстОбъекта = НСтр("ru='Изменить курс'") + ?(ПустаяСтрока(ТекстОбъекта), "", ",") + " " + НСтр("ru='валюты взаиморасчетов'");
			// Производим добавление вопроса в очередь
			ПоследовательныеОперации.ДобавитьВопросДаНет(КоллекцияОпераций, "ТребуетсяИзменитьКурсВзаиморасчетов", ТекстВопроса + ТекстОбъекта + "?");
			
			Если НЕ Форма.РазрешитьРедактированиеЦенИСумм Тогда
				КоллекцияОпераций.ТребуетсяИзменитьКурсВзаиморасчетов.Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Добавляем вопрос о перезаполнении цен
	Если ТребуетсяУстановкаЦен Тогда
		ОбработчикТребуетсяУстановкаЦен = Новый ОписаниеОповещения("ОбработкаРезультатаОтветаНаВопросТребуетсяУстановкаЦен", ОбработкаРеквизитовДокументаКлиент, ПараметрыВопросов);
		ПоследовательныеОперации.ДобавитьВопросДаНет(КоллекцияОпераций, "ТребуетсяУстановкаЦен", 
			НСтр("ru='Были изменены данные, влияющие на цены номенклатуры.'") + Символы.ПС+НСтр("ru = 'Перезаполнить цены?'"),,,
			ОбработчикТребуетсяУстановкаЦен);
		
		Если НЕ Форма.РазрешитьРедактированиеЦенИСумм Тогда
			КоллекцияОпераций.ТребуетсяУстановкаЦен.Результат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	// Добавляем вопрос пересчета суммовых показателей
	Если ТребуетсяПересчетЦен Тогда
		ПоследовательныеОперации.ДобавитьВопросДаНет(КоллекцияОпераций, "ТребуетсяПересчетЦен", 
			НСтр("ru='Были изменены данные, влияющие на суммовые показатели документа.'") + Символы.ПС
			+ НСтр("ru = 'Выполнить пересчет?'"));
		
		Если НЕ Форма.РазрешитьРедактированиеЦенИСумм Тогда
			КоллекцияОпераций.ТребуетсяПересчетЦен.Результат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	// Производим финальную проверку целесообразности дальнейших действий
	Если КоллекцияОпераций.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализируем обработчик результата всех опросов
	Если ОбработчикСобытия=Неопределено Тогда
		ОбработчикСобытия = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", Форма, "РазрешенияДляПересчета");
	КонецЕсли;
	
	// Набиваем коллекцию параметров значениями
	ПараметрыВопросов.Вставить("КоллекцияОпераций", КоллекцияОпераций);
	ПараметрыВопросов.Вставить("ПараметрыДействия", ПараметрыДействия);
	ПараметрыВопросов.Вставить("ТребуетсяПересчет", ЛОЖЬ);
	ПараметрыВопросов.Вставить("ОбработчикСобытия", ОбработчикСобытия);
	
	// Вызываем служебную процедуру для организации последовательного опроса пользователя.
	ПоследовательныеОперацииКлиент.ВыполнитьПоследовательно(ПараметрыВопросов);
	
КонецПроцедуры // ПолучитьРазрешенияДляПересчета()

Функция ОбработкаПолученияРазрешенийДляПересчета(Форма, ПараметрыВопросов) Экспорт
	
	// Получим исходные параметры действия
	ПараметрыДействия = ПараметрыВопросов.ПараметрыДействия;
	
	// Произведем перемещение всех накопленных ответов в коллекцию параметров действия
	Для каждого Операция Из ПараметрыВопросов.КоллекцияОпераций Цикл
		ПараметрыДействия[Операция.Ключ]    = Операция.Значение;
		ПараметрыВопросов.ТребуетсяПересчет = ПараметрыВопросов.ТребуетсяПересчет ИЛИ Операция.Значение;
	КонецЦикла;
	
	// По ответам пользователя уточним значения признаков необходимости пересчета объекта.
	Если ПараметрыВопросов.КоллекцияОпераций.Свойство("ТребуетсяЗаполнитьНаОсновании") Тогда
		ПараметрыВопросов.ТребуетсяПересчет     = ПараметрыВопросов.ТребуетсяПересчет ИЛИ ПараметрыДействия.ТребуетсяЗаполнитьНаОсновании ИЛИ ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТребуетсяПересчетЦен", ЛОЖЬ) ИЛИ ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТребуетсяИзменитьКурс", ЛОЖЬ) ИЛИ ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ТребуетсяУстановкаЦен", ЛОЖЬ);
	КонецЕсли;
	Если ПараметрыВопросов.КоллекцияОпераций.Свойство("ТребуетсяИзменитьКурс") Тогда
		ПараметрыВопросов.ТребуетсяПересчет     = ПараметрыВопросов.ТребуетсяПересчет ИЛИ ПараметрыДействия.ТребуетсяИзменитьКурс;
	КонецЕсли;
	Если ПараметрыВопросов.КоллекцияОпераций.Свойство("ТребуетсяУстановкаЦен") Тогда
		ПараметрыВопросов.ТребуетсяПересчет     = ПараметрыВопросов.ТребуетсяПересчет ИЛИ ПараметрыДействия.ТребуетсяУстановкаЦен;
	КонецЕсли;
	Если ПараметрыВопросов.КоллекцияОпераций.Свойство("ТребуетсяПересчетЦен") Тогда
		ПараметрыВопросов.ТребуетсяПересчет     = ПараметрыВопросов.ТребуетсяПересчет ИЛИ ПараметрыДействия.ТребуетсяПересчетЦен;
	КонецЕсли;
	
	// Если пересчет объекта не требуется, прекращаем всю цепочку обработки события
	Если НЕ ПараметрыВопросов.ТребуетсяПересчет Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// Восстанавливаем параметры исходного действия. Параметры опроса более не нужны
	ПараметрыВопросов = ПараметрыДействия;
	
	// Возвращаем признак того что действие не обработано и его следует обработать в контексте сервера.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаПолученияРазрешенийДляПересчета()

// Служебная процедура. Используется для перехвата ответа пользователя на вопрос о установке новых цен.
//
// Параметры:
//  КодОтвета         - КодВозвратаДиалога - Ответ, который дал пользователь на очередной вопрос
//  ПараметрыВопросов - Структура          - Коллекция содержащая набор вопросов и прочие параметры обработки.
//
Процедура ОбработкаРезультатаОтветаНаВопросТребуетсяУстановкаЦен(КодОтветаДа, ПараметрыВопросов) Экспорт
	
	// В случае если пользователь хочет полностью переустановить цены на все позиции, пересчет сумм не требуется.
	Если КодОтветаДа И ПараметрыВопросов.КоллекцияОпераций.Свойство("ТребуетсяПересчетЦен") Тогда
		ПараметрыВопросов.КоллекцияОпераций["ТребуетсяПересчетЦен"].Результат = ЛОЖЬ;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОтветаНаВопросТребуетсяУстановкаЦен()

// Служебная процедура. Используется для перехвата ответа пользователя на вопрос о установке новых цен.
//
// Параметры:
//  КодОтвета         - КодВозвратаДиалога - Ответ, который дал пользователь на очередной вопрос
//  ПараметрыВопросов - Структура          - Коллекция содержащая набор вопросов и прочие параметры обработки.
//
Процедура ОбработкаРезультатаОтветаНаВопросТребуетсяЗаполнитьНаОсновании(КодОтветаДа, ПараметрыВопросов) Экспорт
	
	// В случае если пользователь хочет полностью перезаполнить документ, то другие изменения будут не актуальны.
	Если КодОтветаДа И ПараметрыВопросов.КоллекцияОпераций.Свойство("ТребуетсяЗаполнитьНаОсновании") Тогда
		Если ПараметрыВопросов.КоллекцияОпераций.Свойство("ТребуетсяИзменитьКурс") Тогда
			ПараметрыВопросов.КоллекцияОпераций.ТребуетсяИзменитьКурс.Результат = ЛОЖЬ;
		КонецЕсли;
		Если ПараметрыВопросов.КоллекцияОпераций.Свойство("ТребуетсяПересчетЦен") Тогда
			ПараметрыВопросов.КоллекцияОпераций.ТребуетсяПересчетЦен.Результат = ЛОЖЬ;
		КонецЕсли;
		Если ПараметрыВопросов.КоллекцияОпераций.Свойство("ТребуетсяУстановкаЦен") Тогда
			ПараметрыВопросов.КоллекцияОпераций.ТребуетсяУстановкаЦен.Результат = ЛОЖЬ;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОтветаНаВопросТребуетсяЗаполнитьНаОсновании()

