&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Обработки.ОбработкаСкидок.ЗаполнитьПодразделения(Объект);
	//Элементы.Подразделения.Заголовок = Объект.Подразделения;
	Объект.Дата = ТекущаяДатаСеанса();
	Обработки.ОбработкаСкидок.ЗаполнениеТаблицы(Объект);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСкидкиНаСервере()
	Обработки.ОбработкаСкидок.ВыполнитьОбработку(Ложь, Объект);
	Обработки.ОбработкаСкидок.ЗаполнениеТаблицы(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСкидки(Команда)
	ЗагрузитьСкидкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСкидки(Команда)
	ОбновитьСкидкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСкидкиНаСервере()
	Обработки.ОбработкаСкидок.ЗаполнениеТаблицы(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияПриИзменении(Элемент)
	ОбновитьСкидкиНаСервере();
КонецПроцедуры
