#Область ПрограммныйИнтерфейс

// См. РаботаСКонтрагентамиКлиентСерверПереопределяемый.ОпределитьВидДокумента.
Процедура ОпределитьВидДокумента(Форма, Результат) Экспорт
	
	ТипСсылки = ТипЗнч(Форма.Объект.Ссылка);
	
	Если ТипСсылки = Тип("ДокументСсылка.РеализацияТоваров")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		
		Результат.Вставить("КонтрагентНаходитсяВШапке", Истина);
		Результат.Вставить("КонтрагентНаходитсяВТабличнойЧасти", Ложь);
		Результат.Вставить("СчетФактураНаходитсяВПодвале", Ложь);
		
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.СчетФактураВыданный")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		
		Результат.Вставить("ЯвляетсяСчетомФактурой", Истина);
		
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.СчетНаОплату")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.СчетОтПоставщика") Тогда
		
		Результат.Вставить("КонтрагентНаходитсяВШапке", Истина);
		Результат.Вставить("КонтрагентНаходитсяВТабличнойЧасти", Ложь);
		Результат.Вставить("СчетФактураНаходитсяВПодвале", Ложь);
		Результат.Вставить("ЯвляетсяСчетомФактурой", Ложь);
		
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ЗаказПокупателя")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Результат.Вставить("КонтрагентНаходитсяВШапке", Истина);
		Результат.Вставить("КонтрагентНаходитсяВТабличнойЧасти", Ложь);
		Результат.Вставить("СчетФактураНаходитсяВПодвале", Ложь);
		
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.АктОРасхожденияхПоПоставке") Тогда
		
		Результат.Вставить("КонтрагентНаходитсяВШапке", Истина);
		Результат.Вставить("КонтрагентНаходитсяВТабличнойЧасти", Ложь);
		Результат.Вставить("СчетФактураНаходитсяВПодвале", Ложь);
		Результат.Вставить("ЯвляетсяСчетомФактурой", Ложь);
		
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.АктОРасхожденияхПоОтгрузке") Тогда
		
		Результат.Вставить("КонтрагентНаходитсяВШапке", Истина);
		Результат.Вставить("КонтрагентНаходитсяВТабличнойЧасти", Ложь);
		Результат.Вставить("СчетФактураНаходитсяВПодвале", Ложь);
		Результат.Вставить("ЯвляетсяСчетомФактурой", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСКонтрагентамиКлиентСерверПереопределяемый.ПолучитьСчетФактуру.
Процедура ПолучитьСчетФактуру(Форма, СчетФактура) Экспорт
	
	ТипСсылки = ТипЗнч(Форма.Объект.Ссылка);
	
	Если ТипСсылки = Тип("ДокументСсылка.РеализацияТоваров")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		СчетФактура = Форма.СчетФактура;
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаСКонтрагентамиКлиентСерверПереопределяемый.ОтобразитьРезультатПроверкиКонтрагентаВСправочнике.
Процедура ОтобразитьРезультатПроверкиКонтрагентаВСправочнике(Форма, ПредставлениеРезультатаПроверки) Экспорт
	
	Форма.РезультатПроверкиКонтрагента = ПредставлениеРезультатаПроверки;
	
КонецПроцедуры

// См. РаботаСКонтрагентамиКлиентСерверПереопределяемый.ПриОпределенииОбъектаИСсылкиПоФорме.
Процедура ПриОпределенииОбъектаИСсылкиПоФорме(Форма, Результат) Экспорт
	
	ИсточникОбъект = Форма.Объект;
	ИсточникСсылка = ИсточникОбъект.Ссылка;
	
	Результат.Вставить("Объект", ИсточникОбъект);
	Результат.Вставить("Ссылка", ИсточникСсылка);
	
КонецПроцедуры

#КонецОбласти
