
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипЗначенияРеквизита = Перечисления.НСИТипыЗначений.Перечисление Или ТипЗначенияРеквизита = Перечисления.НСИТипыЗначений.Справочник Тогда
		ПроверяемыеРеквизиты.Добавить("ТипСсылочногоОбъекта");
	КонецЕсли;
	
	Если Не ТипОбъектаСведений = Перечисления.НСИТипыРеквизитовОбъектов.Простой Тогда
		ПроверяемыеРеквизиты.Добавить("НаименованиеОбъектаСведений");
	КонецЕсли;

	
	НайденныеСтроки = СоставКлючаПоиска.НайтиСтроки(Новый Структура("ОбъектДляКонтроля", Истина));
	Если НайденныеСтроки.Количество() >= 2 Тогда
		Сообщить("В табличной части ""Состав ключа поиска"" должен быть выбран только 1 объект для контроля");
		Отказ = Истина;
	ИначеЕсли ТипОбъектаСведений = Перечисления.НСИТипыРеквизитовОбъектов.Сведения И НайденныеСтроки.Количество() = 1 Тогда
		Если НайденныеСтроки[0].ТипСсылочногоОбъекта <> Владелец Тогда
			Сообщить("Тип ссылочного объекта сведений должен совпадать с владельцем");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
