
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает таблицу слов исключений меньше 3 букв
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Слово - Строка - слово исключение.
//
Функция СловаИсключенияМеньшеТрехБукв() Экспорт
	
	ТаблицаСлов = Новый ТаблицаЗначений();
	ТаблицаСлов.Колонки.Добавить("Слово", ОбщегоНазначения.ОписаниеТипаСтрока(2));
	
	ЗаполнитьТаблицуСловПоМакету(ТаблицаСлов, "СписокИсключенийСловМеньше3Букв");
	
	Возврат ТаблицаСлов;
	
КонецФункции

// Возвращает таблицу незначимых слов исключений
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Слово - Строка - слово исключение.
//
Функция СловаИсключенияНезначимые() Экспорт
	
	ТаблицаСлов = Новый ТаблицаЗначений();
	ТаблицаСлов.Колонки.Добавить("Слово", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	
	ЗаполнитьТаблицуСловПоМакету(ТаблицаСлов, "СписокИсключенийНезначимыхСлов");
	
	Возврат ТаблицаСлов;
	
КонецФункции

// Возвращает используемые типы данных определяемого НоменклатураБЭД с учетом функциональных опций.
// Тип удаляется из массива типов, если есть хотя бы 1 ФО, включающая тип и нет ни одной активной ФО.
// 
// Возвращаемое значение:
//  Массив из Тип
//
Функция ИспользуемыеТипыНоменклатурыБЭД() Экспорт
	
	ИспользуемыеТипы = Метаданные.ОпределяемыеТипы.НоменклатураБЭД.Тип.Типы();
	ВсегоТипов       = ИспользуемыеТипы.Количество();
	
	Если ВсегоТипов > 1 Тогда
		Для ОбратныйИндекс = 1 По ВсегоТипов Цикл
			ТекущийТип     = ИспользуемыеТипы[ВсегоТипов - ОбратныйИндекс];
			МетаданныеТипа = Метаданные.НайтиПоТипу(ТекущийТип);
			ЕстьФО         = Ложь;
			ЕстьАктивнаяФО = Ложь;
			Для Каждого ФункциональнаяОпция Из Метаданные.ФункциональныеОпции Цикл
				Если ФункциональнаяОпция.Состав.Найти(МетаданныеТипа) <> Неопределено Тогда
					ЕстьФО         = Истина;
					ЕстьАктивнаяФО = (ПолучитьФункциональнуюОпцию(ФункциональнаяОпция.Имя) = Истина);
					Если ЕстьАктивнаяФО Тогда
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если ЕстьФО И Не ЕстьАктивнаяФО Тогда
				ИспользуемыеТипы.Удалить(ВсегоТипов - ОбратныйИндекс);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ИспользуемыеТипы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТаблицуСловПоМакету(ТаблицаСлов, ИмяМакета)
	
	Макет = Обработки.СопоставлениеНоменклатурыБЭД.ПолучитьМакет(ИмяМакета);
	
	НомерСтроки = 1;
	Пока Истина Цикл
		Адрес = "R" + Формат(НомерСтроки, "ЧГ=") + "C1";
		Значение = Макет.Область(Адрес).Текст;
		Если ПустаяСтрока(Значение) Тогда
			Прервать;
		КонецЕсли;
		
		ТаблицаСлов.Добавить().Слово = СокрЛП(Значение);
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
