
Процедура ПередЗаписью(Отказ)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕРПНастрокиПодключенияTPI.Ссылка
	               |ИЗ
	               |	Справочник.ЕРПНастрокиПодключенияTPI КАК ЕРПНастрокиПодключенияTPI
	               |ГДЕ
	               |	ЕРПНастрокиПодключенияTPI.ОсновноеПодключение
	               |	И ЕРПНастрокиПодключенияTPI.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);			   
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЭлементОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЭлементОбъект.ОсновноеПодключение = ЛОЖЬ;
			ЭлементОбъект.Записать();
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры
