// Модуль объекта справочника "Ячейки хранения"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для формирования наименования/кода нового элемента.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		ШиринаЯчейки = Владелец.ШиринаЯчейкиПоУмолчанию;
		ДлинаЯчейки  = Владелец.ДлинаЯчейкиПоУмолчанию;
		НеДоступна   = ЛОЖЬ;
	
		Справочники.ЯчейкиХранения.СформироватьКодПоУмолчанию(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - СправочникОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи объекта.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим чтобы ячейка не вышла за размеры склада
	Если НЕ ЭтоГруппа И (Владелец.ВидСклада = Перечисления.ВидыСкладов.Ячеистый ИЛИ Владелец.ВидСклада = Перечисления.ВидыСкладов.ОрдерныйЯчеистый) Тогда
		СтрокаПустыхПараметров = "";
		СтрокаПустыхПараметров  = СтрокаПустыхПараметров + ?(ДлинаЯчейки  + КоординатаX  > Владелец.ДлинаСклада,  Символы.ПС + Символы.Таб + НСтр("ru='- Параметры ячейки превышают длину склада,'"), "");
		СтрокаПустыхПараметров  = СтрокаПустыхПараметров + ?(ШиринаЯчейки + КоординатаY > Владелец.ШиринаСклада, Символы.ПС + Символы.Таб + НСтр("ru='- Параметры ячейки превышают ширину склада,'"), "");
		СтрокаПустыхПараметров  = СтрокаПустыхПараметров + ?(Уровень > Владелец.ЧислоУровней - 1, Символы.ПС + Символы.Таб + НСтр("ru='- Уровень ячейки превышает число уровней склада (нумерация уровней начинается с нуля),'"), "");
		Если СтрокаПустыхПараметров <> "" Тогда
			ВывестиСообщение(НСтр("ru='При записи элемента обнаружены ошибки: %1'"),ЭтотОбъект,,,Отказ, Лев(СтрокаПустыхПараметров, СтрДлина(СтрокаПустыхПараметров)-1));
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Код"));
		Если НЕ ЗначениеЗаполнено(Код) Тогда
			ВывестиСообщение(НСтр("ru='Поле ""Наименование"" не заполнено'"),ЭтотОбъект,"Код",,Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередЗаписью(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПередЗаписью(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;

	Отказ = Отказ ИЛИ Справочники.ЯчейкиХранения.ОчиститьМакетСклада(ЭтотОбъект);
	
	// свойство Недоступна должно меняться при смене пометки удаления
	Если НЕ Отказ И НЕ ЭтоГруппа И НЕ (ПометкаУдаления = ЭтотОбъект.Ссылка.ПометкаУдаления) Тогда
		Недоступна = ПометкаУдаления;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийСправочникаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Почистим регистры сведений от удаляемого объекта
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЯчейкиХраненияПоУмолчанию.СкладКомпании КАК СкладКомпании,
	               |	ЯчейкиХраненияПоУмолчанию.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ЯчейкиХраненияПоУмолчанию КАК ЯчейкиХраненияПоУмолчанию
	               |ГДЕ
	               |	ЯчейкиХраненияПоУмолчанию.ЯчейкаХранения = &ЯчейкаХранения";
	Запрос.УстановитьПараметр("ЯчейкаХранения", Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ЯчейкиХраненияПоУмолчанию.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.Удалить();
	КонецЦикла;
	
КонецПроцедуры // ПередУдалением()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли