
// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Подобранные ВСД
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Ссылка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = ПодобранныеВСД;
	
	Элемент.Представление = "ПодобранныеВСД";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0, 150, 0));
	
	// Расхождения
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыРасхождение.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Товары.Расхождение");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Представление = "ПодобранныеВСД";
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(255, 0, 0));
	
КонецПроцедуры // УстановитьУсловноеОформление()

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьРасхождения(Товары, ТекущаяСтрока)
	
	КоличествоПоВСД           = ТекущаяСтрока.ВСДКоличество;
	Количество                = 0;
	Вес                       = 0;
	ТекущаяСтрока.Расхождение = 0;
	ТекущаяСтрока.Обработана  = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ВСД) Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("ВСД", ТекущаяСтрока.ВСД));
	НомерПоследнейСтрокиСОдинаковымиВСД = 0;
	Для Каждого ТекСтр Из НайденныеСтроки Цикл
		
		Количество = Количество + ТекСтр.Количество+ТекСтр.КВозврату;
		
		Вес = Вес + ТекСтр.Вес + (ТекСтр.КВозврату * ТекСтр.КоэффициентВеса);
		
		НомерПоследнейСтрокиСОдинаковымиВСД = Товары.Индекс(ТекСтр);
		
	КонецЦикла;
	
	Товары[НомерПоследнейСтрокиСОдинаковымиВСД].Расхождение = Вес-КоличествоПоВСД;
	Товары[НомерПоследнейСтрокиСОдинаковымиВСД].Обработана = ЗначениеЗаполнено(Товары[НомерПоследнейСтрокиСОдинаковымиВСД].ВСД) И (Товары[НомерПоследнейСтрокиСОдинаковымиВСД].Расхождение=0);
	
КонецПроцедуры

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.КомандаСкрыватьОбработанные.Пометка = Истина;
	СкрыватьОбработанные = Истина;
	
	Отправитель            = Неопределено;
	ПредприятиеОтправитель = Неопределено;
	Получатель             = Неопределено;
	ПредприятиеПолучатель  = Неопределено;
	//Номенклатура           = Неопределено;
	НомерТТН               = Неопределено;
	ДатаТТН                = Неопределено;
	
	Если Параметры.Свойство("Отправитель") Тогда
		Отправитель = Параметры.Отправитель;
	КонецЕсли;
	
	Если Параметры.Свойство("ПредприятиеОтправитель") Тогда
		ПредприятиеОтправитель = Параметры.ПредприятиеОтправитель;
	КонецЕсли;
	
	Если Параметры.Свойство("Получатель") Тогда
		Получатель = Параметры.Получатель;
	КонецЕсли;
	
	Если Параметры.Свойство("ПредприятиеПолучатель") Тогда
		ПредприятиеПолучатель = Параметры.ПредприятиеПолучатель;
	КонецЕсли;
	
	//Если Параметры.Свойство("Номенклатура") Тогда
	//	Номенклатура = Параметры.Номенклатура;
	//КонецЕсли;
	
	Если Параметры.Свойство("НомерТТН") Тогда
		НомерТТН = Параметры.НомерТТН;
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаТТН") Тогда
		ДатаТТН = Параметры.ДатаТТН;
	КонецЕсли;
	
	Товары.Очистить();
	ПодобранныеВСД.Очистить();
	Если Параметры.Свойство("ТаблицаТоваров") Тогда
		Для Каждого ТекущаяСтрока Из Параметры.ТаблицаТоваров Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
			Если ЗначениеЗаполнено(ТекущаяСтрока.ВСД) И ПодобранныеВСД.НайтиПоЗначению(ТекущаяСтрока.ВСД) = Неопределено Тогда
				ПодобранныеВСД.Добавить(ТекущаяСтрока.ВСД);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекущаяСтрока.ВСД) Тогда
				НоваяСтрока.Статус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.ВСД, "Статус");
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНаЗначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Отправитель", Отправитель, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Отправитель),РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	ОбщегоНаЗначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПредприятиеОтправитель", ПредприятиеОтправитель, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ПредприятиеОтправитель),РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	ОбщегоНаЗначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Получатель", Получатель, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Получатель),РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	ОбщегоНаЗначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПредприятиеПолучатель", ПредприятиеПолучатель, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ПредприятиеПолучатель),РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	ОбщегоНаЗначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "НомерТТН", НомерТТН, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(НомерТТН), РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	ОбщегоНаЗначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДатаТТН", ДатаТТН, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ДатаТТН),РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
	УстановитьУсловноеОформление();
	
	ОбщегоНаЗначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", ПодобранныеВСД, ВидСравненияКомпоновкиДанных.НеВСписке,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	ЗначенияОтбора = Новый Структура("Обработана", Ложь);
	Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура(ЗначенияОтбора);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура КомандаСкрыватьОбработанные(Команда)
	
	Элементы.КомандаСкрыватьОбработанные.Пометка = (НЕ Элементы.КомандаСкрыватьОбработанные.Пометка);
	СкрыватьОбработанные = Элементы.КомандаСкрыватьОбработанные.Пометка;
	ОбщегоНаЗначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", ПодобранныеВСД, ВидСравненияКомпоновкиДанных.НеВСписке,, СкрыватьОбработанные, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	Если СкрыватьОбработанные Тогда
		ЗначенияОтбора = Новый Структура("Обработана", Ложь);
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура(ЗначенияОтбора);
	Иначе
		Элементы.Товары.ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("ВСД", ТекущиеДанные.Ссылка));
	Если НайденныеСтроки.Количество()>0 Тогда
		Элементы.Товары.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Структура = Новый Структура;
	Структура.Вставить("ВСД",           ТекущиеДанные.ВСД);
	Структура.Вставить("ТекущаяСтрока", Элементы.Товары.ТекущаяСтрока);
	Структура.Вставить("Товары",        Истина);
	
	ПараметрыПеретаскивания.Значение = Структура;
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Копирование;
	
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ПараметрыПеретаскивания.Значение = Неопределено Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	ИначеЕсли ПараметрыПеретаскивания.Значение.Товары = Ложь Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	Иначе 
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	КонецЕсли;
	
	Если Элемент.Имя = "Товары" Тогда
		ТекущиеДанные = Товары.НайтиПоИдентификатору(Строка);
		Если ТекущиеДанные = Неопределено Тогда
			ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		КонецЕсли;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если ПараметрыПеретаскивания.Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаИсточник = ПараметрыПеретаскивания.Значение;
	
	ПодобранноеКоличество = 0;
	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("ВСД", СтрокаИсточник.ВСД));
	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
		ПодобранноеКоличество = ПодобранноеКоличество + ТекущаяСтрока.Вес+ТекущаяСтрока.КВозврату;
	КонецЦикла;
	
	КоличествоПоВСД      = СтрокаИсточник.Количество;
	ДопустимоеКоличество = КоличествоПоВСД - Мин(КоличествоПоВСД, ПодобранноеКоличество);
	Если ДопустимоеКоличество = 0 Тогда
		ВывестиСообщение(НСтр("ru = 'ВСД уже распределено'"));
		//ВывестиСообщение(НСтр("ru = 'Строка № %1 ВСД: %2 запрещено гасить. Срок годности продукции до %3'"),,,,, Выборка.НомерСтроки, Строка(Выборка.ВСД), Формат(Выборка.СрокГодности, "ДФ=dd.MM.yyyy"));
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Товары.НайтиПоИдентификатору(Строка);
	
	ИзмененСоставПодобранныхВСД = Ложь;
	СтрокаТоваров = ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ВСД) Тогда
		Если ТекущиеДанные.ВСДКоличество<ТекущиеДанные.Вес Тогда
			Если Товары.Индекс(ТекущиеДанные) = Товары.Количество()-1 Тогда
				СтрокаТоваров = Товары.Добавить();
			Иначе
				СтрокаТоваров = Товары.Вставить(Товары.Индекс(ТекущиеДанные)+1);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтрокаТоваров, ТекущиеДанные);
			
			Если ЗначениеЗаполнено(ТекущиеДанные.КоэффициентВеса) Тогда
				ТекущиеДанные.Количество = ТекущиеДанные.ВСДКоличество/ТекущиеДанные.КоэффициентВеса;
			Иначе
				ТекущиеДанные.Количество = ТекущиеДанные.ВСДКоличество;
			КонецЕсли;
			ТекущиеДанные.Вес        = ТекущиеДанные.ВСДКоличество;
			СтрокаТоваров.Количество = СтрокаТоваров.Количество - ТекущиеДанные.Количество;
			СтрокаТоваров.Вес        = СтрокаТоваров.Вес - ТекущиеДанные.Вес;
			
		ИначеЕсли Товары.НайтиСтроки(Новый Структура("ВСД", ТекущиеДанные.ВСД)).Количество() = 1 Тогда
			
			НайденноеВСД = ПодобранныеВСД.НайтиПоЗначению(ТекущиеДанные.ВСД);
			Если НЕ НайденноеВСД = Неопределено Тогда
				ПодобранныеВСД.Удалить(НайденноеВСД);
				ИзмененСоставПодобранныхВСД = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаТоваров.ВСД              = СтрокаИсточник.ВСД;
	СтрокаТоваров.ВСДКоличество    = СтрокаИсточник.Количество;
	СтрокаТоваров.Статус           = СтрокаИсточник.Статус;
	СтрокаТоваров.Продукция        = СтрокаИсточник.Продукция;
	СтрокаТоваров.ЕдиницаИзмерения = СтрокаИсточник.ЕдиницаИзмерения;
	СтрокаТоваров.СрокГодности     = СтрокаИсточник.СрокГодности;
	СтрокаТоваров.СрокГодностиПо   = СтрокаИсточник.СрокГодностиПо;
	СтрокаТоваров.ДатаВыработки    = СтрокаИсточник.ДатаВыработки;
	СтрокаТоваров.ДатаВыработкиПо  = СтрокаИсточник.ДатаВыработкиПо;
	
	НайденноеВСД = ПодобранныеВСД.НайтиПоЗначению(СтрокаТоваров.ВСД);
	Если НайденноеВСД = Неопределено Тогда
		ПодобранныеВСД.Добавить(СтрокаТоваров.ВСД);
		ИзмененСоставПодобранныхВСД = Истина;
	КонецЕсли;
	
	Если ДопустимоеКоличество<=СтрокаТоваров.Вес Тогда
		ПодобранныеВСД.Добавить(СтрокаИсточник.ВСД);
		ИзмененСоставПодобранныхВСД = Истина;
	КонецЕсли;
	
	ПересчитатьРасхождения(Товары, ТекущиеДанные);
	ПересчитатьРасхождения(Товары, СтрокаТоваров);
	
	Если СкрыватьОбработанные И ИзмененСоставПодобранныхВСД Тогда
		Элементы.Список.Обновить();
	//	ОбновитьОтборПоВСД();
	КонецЕсли;
	
	Если ИзмененСоставПодобранныхВСД Тогда
		УстановитьУсловноеОформление();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Структура = Новый Структура;
	Структура.Вставить("ВСД",              ТекущиеДанные.Ссылка);
	Структура.Вставить("Статус",           ТекущиеДанные.Статус);
	Структура.Вставить("Продукция",        ТекущиеДанные.Продукция);
	Структура.Вставить("ЕдиницаИзмерения", ТекущиеДанные.ЕдиницаИзмерения);
	Структура.Вставить("СрокГодности",     ТекущиеДанные.СрокГодности);
	Структура.Вставить("СрокГодностиПо",   ТекущиеДанные.СрокГодностиПо);
	Структура.Вставить("ДатаВыработки",    ТекущиеДанные.ДатаВыработки);
	Структура.Вставить("ДатаВыработкиПо",  ТекущиеДанные.ДатаВыработкиПо);
	Структура.Вставить("Количество",       ТекущиеДанные.Количество);
	Структура.Вставить("ТекущаяСтрока",    Элементы.Список.ТекущаяСтрока);
	Структура.Вставить("Товары",           Ложь);
	
	ПараметрыПеретаскивания.Значение           = Структура;
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Копирование;
	ПараметрыПеретаскивания.Действие           = ДействиеПеретаскивания.Копирование;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если ПараметрыПеретаскивания.Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененСоставПодобранныхВСД = Ложь;
	
	СтрокаИсточник = ПараметрыПеретаскивания.Значение;
	ТекущиеДанные = Товары.НайтиПоИдентификатору(СтрокаИсточник.ТекущаяСтрока);
	
	ВСД = СтрокаИсточник.ВСД;
	ТекущиеДанные.ВСД              = Неопределено;
	ТекущиеДанные.Статус           = Неопределено;
	ТекущиеДанные.Продукция        = Неопределено;
	ТекущиеДанные.ЕдиницаИзмерения = Неопределено;
	ТекущиеДанные.СрокГодности     = Неопределено;
	ТекущиеДанные.СрокГодностиПо   = Неопределено;
	ТекущиеДанные.ДатаВыработки    = Неопределено;
	ТекущиеДанные.ДатаВыработкиПо  = Неопределено;
	ТекущиеДанные.ВСДКоличество    = 0;
	
	Если Товары.НайтиСтроки(Новый Структура("ВСД", ВСД)).Количество() = 0 Тогда
		НайденноеВСД = ПодобранныеВСД.НайтиПоЗначению(ВСД);
		Если НЕ НайденноеВСД = Неопределено Тогда
			ПодобранныеВСД.Удалить(НайденноеВСД);
			ИзмененСоставПодобранныхВСД = Истина;
		КонецЕсли;
	КонецЕсли;
	
	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
	ИндСтроки = НайденныеСтроки.Количество()-1;
	Пока ИндСтроки>=0 Цикл
		СтрокаПоиска = НайденныеСтроки[ИндСтроки];
		Если НЕ СтрокаПоиска = ТекущиеДанные Тогда
			СтрокаПоиска.Количество = СтрокаПоиска.Количество + ТекущиеДанные.Количество;
			СтрокаПоиска.Вес        = СтрокаПоиска.Вес + ТекущиеДанные.Вес;
			Товары.Удалить(ТекущиеДанные);
			Прервать;
		КонецЕсли;
		
		ИндСтроки = ИндСтроки - 1;
		
	КонецЦикла;
	
	ПересчитатьРасхождения(Товары, ТекущиеДанные);
	
	Если СкрыватьОбработанные И ИзмененСоставПодобранныхВСД Тогда
		Элементы.Список.Обновить();
		//ОбновитьОтборПоВСД();
	КонецЕсли;
	
	Если ИзмененСоставПодобранныхВСД Тогда
		УстановитьУсловноеОформление();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ПараметрыПеретаскивания.Значение = Неопределено Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	ИначеЕсли ПараметрыПеретаскивания.Значение.Товары = Истина Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	Иначе
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при выполнении команды "ОК".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура ОК(Команда)
	
	//Результат = Новый Структура;
	//Результат.Вставить("Товары", Товары);
	
	Закрыть(Товары);
	
КонецПроцедуры //ОК()
