
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьИмяФайлаОборудования(КаталогАрхива, Оборудование, Событие)
	
	Если ПустаяСтрока(КаталогАрхива) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Оборудование) Тогда
		
		НаименованиеОборудования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Оборудование, "Наименование");
		ПолныйПуть = КаталогАрхива + "\" + НаименованиеОборудования+"\";
		
	Иначе
		
		ПолныйПуть = КаталогАрхива + "\Общий\";
		
	КонецЕсли;
	
	Файл = Новый Файл(ПолныйПуть);
	Если НЕ Файл.Существует() Тогда
		СоздатьКаталог(ПолныйПуть);
	КонецЕсли;
	
	Результат = ПолныйПуть+Формат(ТекущаяДатаСеанса(), "ДФ=yyyy_MM_dd_hh_mm_ss")+"_"+Строка(Событие);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗафиксироватьСобытие(ГруппаТоваров, Оборудование, Событие, Комментарий, ДанныеСобытия) Экспорт
	
	ДанныеГруппыТоваров = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ГруппаТоваров, "ФиксироватьСобытия, КаталогАрхива");
	
	Если НЕ ДанныеГруппыТоваров.ФиксироватьСобытия Тогда
		Возврат;
	КонецЕсли;
	
	СобытиеСсылка = ОценкаПроизводительностиПовтИсп.ПолучитьКлючевуюОперациюПоИмени(Событие);
	
	ИмяФайлаСобытия = ПолучитьИмяФайлаОборудования(ДанныеГруппыТоваров.КаталогАрхива, Оборудование, Событие);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ДанныеСобытия, НазначениеТипаXML.Явное);
	ТекстЛога = ЗаписьJSON.Закрыть();
	
	Если Не ПустаяСтрока(ИмяФайлаСобытия) Тогда
		ФайлЛога = Новый ТекстовыйДокумент();
		ФайлЛога.УстановитьТекст(ТекстЛога);
		Попытка
			ФайлЛога.Записать(ИмяФайлаСобытия+".txt", КодировкаТекста.UTF8);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Запись = РегистрыСведений.ЖурналСобытийОборудования.СоздатьМенеджерЗаписи();
	Запись.ГруппаТоваров = ГруппаТоваров;
	Запись.Оборудование  = Оборудование;
	Запись.Событие       = СобытиеСсылка;
	Запись.ИмяФайла      = ИмяФайлаСобытия;
	Запись.Комментарий   = Комментарий;
	Запись.ДатаСобытия   = ТекущаяДатаСеанса();
	Запись.НомерСеанса   = НомерСеансаИнформационнойБазы();
	Запись.Пользователь  = ПользователиИнформационнойБазы.ТекущийПользователь();
	Запись.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецЕсли