// Модуль менеджера справочника "Характеристики номенклатуры"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	// получим ограничения
	Ограничение=НЕОПРЕДЕЛЕНО; ТипНоменклатуры=НЕОПРЕДЕЛЕНО;
	Если ТипЗнч(Объект.Владелец)=Тип("СправочникСсылка.Номенклатура") Тогда
		ТипНоменклатуры=Объект.Владелец.ТипНоменклатуры;
	ИначеЕсли ТипЗнч(Объект.Владелец)=Тип("СправочникСсылка.ТипыНоменклатуры") Тогда
		ТипНоменклатуры=Объект.Владелец;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипНоменклатуры) Тогда
		Ограничение=ТипНоменклатуры.ОграничениеДанныхХарактеристик;
		Если ТипНоменклатуры.УникальностьСерийногоНомера Тогда
			УникальностьСерНомера=3;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ограничение) Тогда
		Ограничение=Перечисления.ОграниченияДанныхХарактеристики.Все;
	КонецЕсли;
	
	Если УникальностьСерНомера <> 3 И Ограничение=Перечисления.ОграниченияДанныхХарактеристики.СерийныйНомер_Свойства Тогда
		УникальностьСерНомера = 1;
	КонецЕсли;
	
	// в зависимости от вида ограничения расставляем обязательные реквизиты
	Если(Ограничение=Перечисления.ОграниченияДанныхХарактеристики.Все) Тогда
		Если ЗначениеЗаполнено(УникальностьСерНомера) Тогда 
			ОбязательныеРеквизиты.Добавить("СерийныйНомер");
		КонецЕсли;
	ИначеЕсли (Ограничение=Перечисления.ОграниченияДанныхХарактеристики.Качество) Тогда
		ОбязательныеРеквизиты.Добавить("Качество");
	ИначеЕсли (Ограничение=Перечисления.ОграниченияДанныхХарактеристики.СерийныйНомер_Свойства) Тогда
		ОбязательныеРеквизиты.Добавить("СерийныйНомер");
	ИначеЕсли (Ограничение=Перечисления.ОграниченияДанныхХарактеристики.Сроки_Сертификаты) Тогда
		ОбязательныеРеквизиты.Добавить("СрокГодности");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Процедура формирует наименование объекта.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Функция СформироватьНаименованиеПоУмолчанию(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Формируем наименование в зависимости от заполненных реквизитов.
	Наименование = "";
		
	// Серийный номер
	Если НЕ ПустаяСтрока(СокрЛП(Объект.СерийныйНомер)) Тогда
		Наименование = Наименование + " с/н " + СокрЛП(Объект.СерийныйНомер);
	КонецЕсли;
	
	// Качество
	Если ЗначениеЗаполнено(Объект.Качество) Тогда
		Наименование = Наименование + " " + СокрЛП(Объект.Качество);
	КонецЕсли;
	
	// Сертификат
	Если ЗначениеЗаполнено(Объект.Сертификат) Тогда
		Наименование = Наименование + " " + СокрЛП(Объект.Сертификат);
	ИначеЕсли НЕ ПараметрыДействия = Неопределено 
		И ТипЗнч(ПараметрыДействия) = Тип("Структура") 
		И ПараметрыДействия.Свойство("СертификатНаименование") 
		И НЕ ПараметрыДействия.СертификатНаименование = НСтр("ru = 'Сертификат  №  до'") + " " Тогда 
		Наименование = Наименование + " " + СокрЛП(ПараметрыДействия.СертификатНаименование);
	КонецЕсли;
	
	// Срок годности
	Если ЗначениеЗаполнено(Объект.СрокГодности) Тогда
		Наименование = Наименование + " " + НСтр("ru = 'годен до'") + " " + Формат(Объект.СрокГодности,"ДФ=dd.MM.yy");
	КонецЕсли;
	
	// Доп.пробел перед прочими свойствами.
	Если НЕ ПустаяСтрока(Объект.Наименование) Тогда
		Наименование = Наименование + " ";
	КонецЕсли;
	
	// Свойства
	Если НЕ ПараметрыДействия=Неопределено И ПараметрыДействия.Свойство("Форма") Тогда
		Если ПараметрыДействия.Форма.ПолучитьФункциональнуюОпциюФормы("ИспользоватьДополнительныеРеквизитыИСведения") Тогда
			НомерСвойства = 0;
			Для Каждого ДополнительноеСвойство Из ПараметрыДействия.Форма.Свойства_ОписаниеДополнительныхРеквизитов Цикл
				ЗначениеСвойства = ПараметрыДействия.Форма[ДополнительноеСвойство.ИмяРеквизитаЗначение];
				Если ЗначениеЗаполнено(ДополнительноеСвойство.ИмяРеквизитаЗначение) Тогда
					НаименованиеСвойства = ПараметрыДействия.Форма[ДополнительноеСвойство.ИмяРеквизитаЗначение];
				Иначе
					НаименованиеСвойства = Строка(ДополнительноеСвойство.Свойство);
				КонецЕсли;
			
				Если ЗначениеЗаполнено(ЗначениеСвойства) Тогда
					НомерСвойства = НомерСвойства + 1;
					Наименование = Наименование + ?(НомерСвойства = 1,"", ", ") + НаименованиеСвойства +": "+ ЗначениеСвойства;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Обрежем лишние пробелы
	Наименование = СокрЛП(Наименование);
	
	Возврат Наименование;
	
КонецФункции // СформироватьНаименованиеПоУмолчанию()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли