
#Область ПрограммныйИнтерфейс

// Возвращает результат установки штампов в документ.
//
// Параметры:
//   ПараметрыУстановкиШтампов - см. Интеграция1СШтампКлиентСервер.НовыеПараметрыУстановкиШтамповВДокумент.
//   ПользовательскийСценарий - Строка - Строковое описание без пробелов (максимум 250 символов), информирующее о месте
//     использования механики 1С:Штамп внутри конфигурации. Рекомендуется указывать условный путь к ключевому интерфейсу
//     или механизму, который использует механики 1С:Штамп с описанием события использования.
//     
//     Примеры:
//      - "БЭД.ИнтерфейсДокументовЭДО.ТекущиеДелаПоЭДО.ПредпросмотрПриАктивизацииСтроки"
//      - "БЭД.ДемоШтампированиеФайлов.ВизуализацияПроштампированногоЭлектронногоДокумента"
//      - "Документ.СчетНаОплату.ПечатьСчетаНаОплатуКонтрагенту"
//      - "РегламентноеЗадание.ВыгрузкаЭлектронныхДокументов"
//
//   Таймаут - Число, Неопределено - Максимальное время ожидания получения результата выполнения задания из сервиса
//     (не больше 600 сек). По умолчанию - 600 сек.
//
// Возвращаемое значение:
//   Структура: 
//    * ЕстьОшибки          - Булево - Признак наличия ошибок.
//    * ИнформацияОбОшибках - Структура - Информация об ошибках выполнения запроса:
//       ** КодСостояния - Число      - Код состояния http ответа.
//       ** Данные       - Структура  - Данные ответа сервиса.
//       ** URLРедиректа - Строка     - URL адрес для повторного обращения.
//       ** Интервал     - Число      - Интервал (в секундах) для повторного обращения к сервису.
//       ** ТекстОшибки  - Строка     - Текст ошибки на стороне сервиса.
//    * ЕстьРезультат      - Булево         - Признак успешного выполнения запроса.
//    * ДвоичныеДанные     - ДвоичныеДанные - Двоичные данные результата (PDF документа).
//
// Пример:
//
// ПараметрыУстановкиШтамповВДокумент = Интеграция1СШтампКлиентСервер.НовыеПараметрыУстановкиШтамповВДокумент();
//
// ПараметрыУстановкиШтамповВДокумент.ПараметрыДокумента.ДвоичныеДанные     = ДвоичныеДанныеДокумента;
// ПараметрыУстановкиШтамповВДокумент.ПараметрыДокумента.Расширение         = "docx";
//
// ПараметрыУстановкиШтампа = Интеграция1СШтампКлиентСервер.НовыеПараметрыШтампа();
//
// ПараметрыУстановкиШтампа.ПараметрыФайла.ДвоичныеДанные     = ДвоичныеДанныеКартинки;
// ПараметрыУстановкиШтампа.ПараметрыФайла.Расширение         = "png";
//
// ПараметрыУстановкиШтампаПоПозиции = Интеграция1СШтампКлиентСервер.НовыеПараметрыУстановкиШтампаПоПозиции();
//
// ПараметрыУстановкиШтампаПоПозиции.НаСтранице.Расположение    = Интеграция1СШтампКлиентСервер.СпособРазмещенияВверхуСлева();
// ПараметрыУстановкиШтампаПоПозиции.НаСтранице.Координаты.Верх = 0;
// ПараметрыУстановкиШтампаПоПозиции.НаСтранице.Координаты.Лево = 0;
// ПараметрыУстановкиШтампаПоПозиции.НаСтранице.ОтступОтГраниц  = 10;
// ПараметрыУстановкиШтампаПоПозиции.НаСтраницах.Расположение   = Интеграция1СШтампКлиентСервер.СпособРасположенияНаПервойСтранице();
//
// ПараметрыУстановкиШтампа.ПараметрыУстановки.ПоПозиционированию.Позиции.Добавить(ПараметрыУстановкиШтампаПоПозиции);
//
// ПараметрыТега = Интеграция1СШтампКлиентСервер.НовыеПараметрыТега();
//
// ПараметрыТега.ЗначениеТега          = "ВставитьЭП";
// ПараметрыТега.ЗамещатьЗначениеТега  = Истина;
// ПараметрыТега.СпособУстановкиШтампа = Интеграция1СШтампКлиентСервер.СпособУстановкиШтампаРаздвигаяТекст();
//
// ПараметрыУстановкиШтампа.ПараметрыУстановки.ПоТегам.Теги.Добавить(ПараметрыТега);
//
// ПараметрыАльтернативнойУстановкиШтампа = Интеграция1СШтампКлиентСервер.НовыеПараметрыУстановкиШтампа();
//
// ПараметрыАльтернативнойУстановкиШтампаПоПозиции = Интеграция1СШтампКлиентСервер.НовыеПараметрыУстановкиШтампаПоПозиции();
//
// ПараметрыАльтернативнойУстановкиШтампаПоПозиции.НаСтранице.Расположение    = Интеграция1СШтампКлиентСервер.СпособРазмещенияВверхуСлева();
// ПараметрыАльтернативнойУстановкиШтампаПоПозиции.НаСтранице.Координаты.Верх = 0;
// ПараметрыАльтернативнойУстановкиШтампаПоПозиции.НаСтранице.Координаты.Лево = 0;
// ПараметрыАльтернативнойУстановкиШтампаПоПозиции.НаСтранице.ОтступОтГраниц  = 10;
// ПараметрыАльтернативнойУстановкиШтампаПоПозиции.НаСтраницах.Расположение   = Интеграция1СШтампКлиентСервер.СпособРасположенияНаПервойСтранице();
//
// ПараметрыАльтернативнойУстановкиШтампа.ПоПозиционированию.Позиции.Добавить(ПараметрыАльтернативнойУстановкиШтампаПоПозиции);
//
// ПараметрыУстановкиШтампа.ПараметрыУстановки.ПоТегам.АльтернативныйСпособУстановки = ПараметрыАльтернативнойУстановкиШтампа;
//
// ПараметрыУстановкиШтампа.Настройки.КоэффициентИзмененияРазмера = 1;
// ПараметрыУстановкиШтампа.Настройки.УровеньПрозрачности         = 128;
//
// ПараметрыУстановкиШтамповВДокумент.ПараметрыШтампов.Добавить(ПараметрыУстановкиШтампа);
//
// СтратегияРазмещения = Интеграция1СШтампКлиентСервер.НоваяСтратегияРазмещенияШтампов();
// СтратегияРазмещения.Размещение.НаСтраницах.СпособРасположения = Интеграция1СШтампКлиентСервер.СпособРасположенияНаПервойСтранице();
// СтратегияРазмещения.Размещение.НаСтранице                     = Интеграция1СШтампКлиентСервер.СпособРазмещенияВверхуСлева();
// СтратегияРазмещения.Статегия.Направление                      = Интеграция1СШтампКлиентСервер.СтратегияРазмещенияВертикально();
// СтратегияРазмещения.Статегия.СмещениеПоГоризонтали            = Интеграция1СШтампКлиентСервер.СмещениеПоГоризонталиАвто();
//
// ПараметрыУстановкиШтамповВДокумент.СтратегииРазмещения.Добавить(СтратегияРазмещения);
//
// ПараметрыУстановкиШтамповВДокумент.ПараметрыРезультата.ФорматРезультата = "pdf";
//
// Сценарий = "БЭД.ДемоШтампированиеФайлов.ВизуализацияПроштампированногоЭлектронногоДокумента";
//
// Интеграция1СШтампКлиент.УстановитьШтампыВДокумент(
//   ПараметрыУстановкиШтамповВДокумент,
//   Сценарий,
//   600);
//
// Параметр Размещение в СтратегияРазмещения является ключом поиска в ПараметрыУстановкиШтампаПоПозиции. Если указана стратегия размещения, то будут анализироваться
// параметры установки штампов по позиции с аналогичным размещением. Если передано несколько картинок штампов с одинаковым размещением и такое же размещение указано в стратегии размещения
// то в таком случае будет применяться эта стратегия размещения. Если передано несколько картинок штампов с одинаковым размещением, но не указана стратегия для такого размещения,
// то картинки штампов будут размещены в указанной позиции друг поверх друга, то есть будут перекрывать друг друга. Стратегия размещения позволяет размещать картинки штампов оптимально рядом
// друг с другом по указанным правилам размещениям (стратегии).
//
// Если требуется получить результат в формате PDF/A, то в свойстве "ПараметрыУстановкиШтамповВДокумент.ПараметрыРезультата.ФорматРезультата"
// необходимо указать одну из поддерживаемых версий PDF формата: pdf_a_1, pdf_a_2, pdf_a_3.
//
// Пример:
//
// ПараметрыУстановкиШтамповВДокумент = Интеграция1СШтампКлиентСервер.НовыеПараметрыУстановкиШтамповВДокумент();
//
// ПараметрыУстановкиШтамповВДокумент.ПараметрыДокумента.ДвоичныеДанные    = ДвоичныеДанныеДокумента
// ПараметрыУстановкиШтамповВДокумент.ПараметрыДокумента.Расширение        = "pdf";
// ПараметрыУстановкиШтамповВДокумент.ПараметрыШтампов                     = ПараметрыШтампов();
// ПараметрыУстановкиШтамповВДокумент.ПараметрыРезультата.ФорматРезультата = "pdf_a_1";
//
// Сценарий = "БЭД.ИнтерфейсДокументовЭДО.ТекущиеДелаПоЭДО.ПредпросмотрПриАктивизацииСтроки";
//
// Интеграция1СШтампКлиент.УстановитьШтампыВДокумент(
//   ПараметрыУстановкиШтамповВДокумент,
//   Сценарий,
//   600);
//
Функция РезультатУстановкиШтамповВДокумент(Знач ПараметрыУстановкиШтампов, Знач ПользовательскийСценарий, Знач Таймаут = Неопределено) Экспорт
	
	Возврат Интеграция1СШтампСлужебный.РезультатУстановкиШтамповВДокумент(
		ПараметрыУстановкиШтампов,
		ПользовательскийСценарий,
		Таймаут);
	
КонецФункции

#КонецОбласти