
#Область ПрограммныйИнтерфейс

#Область ПодготовкаИЗаписьДвиженийДокумента

// Процедура инициализирует общие структуры, используемые при проведении документов.
//  Вызывается из модуля документов при проведении.
//
// Параметры:
//  ДокументСсылка			 - ДокументСсылка - ссылка на документ
//  ДополнительныеСвойства	 - Структура - дополнительные свойства документа-объекта
//  РежимПроведения			 - РежимПроведенияДокумента - режим проведения
//
Процедура ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, ДополнительныеСвойства, РежимПроведения = Неопределено) Экспорт

	// В структуре "ДополнительныеСвойства" создаются свойства с ключами "ТаблицыДляДвижений", "ДляПроведения".

	// "ТаблицыДляДвижений" - структура, которая будет содержать таблицы значений с данными для выполнения движений.
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", Новый Структура);

	// "ДляПроведения" - структура, содержащая свойства и реквизиты документа, необходимые для проведения.
	ДополнительныеСвойства.Вставить("ДляПроведения", Новый Структура);
	
	// Структура, содержащая ключ с именем "МенеджерВременныхТаблиц", в значении которого хранится менеджер временных таблиц.
	// Содержит для каждой временной таблицы ключ (имя временной таблицы) и значение (признак наличия записей во временной таблице).
	ДополнительныеСвойства.ДляПроведения.Вставить("СтруктураВременныеТаблицы", Новый Структура("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц));
	ДополнительныеСвойства.ДляПроведения.Вставить("РежимПроведения",           РежимПроведения);
	ДополнительныеСвойства.ДляПроведения.Вставить("МетаданныеДокумента",       ДокументСсылка.Метаданные());
	ДополнительныеСвойства.ДляПроведения.Вставить("Ссылка",                    ДокументСсылка);
	
КонецПроцедуры

// Выполняет закрытие менеджера временных таблиц в структуре дополнительных свойств документа, используемых 
// при проведении.
//
// Параметры:
//	ДополнительныеСвойства - Структура - структура с дополнительными свойствами документа, используемыми
//		при проведении.
//
Процедура ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства) Экспорт
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Функция формирует массив имен регистров, по которым документ имеет движения.
//  Вызывается при подготовке записей к регистрации движений.
//
// Параметры:
//  Регистратор					 - ДокументСсылка	 - ссылка на документ, для которого формируется список регистров
//  Движения					 - КоллекцияДвижений - движения документа
//  МассивИсключаемыхРегистров	 - Массив			 - исключаемые регистры
// 
// Возвращаемое значение:
//  Массив - массивимен регистров, по которым документ имеет движения.
//
Функция ПолучитьМассивИспользуемыхРегистров(Регистратор, Движения, МассивИсключаемыхРегистров = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);

	Результат = Новый Массив;
	МаксимумТаблицВЗапросе = 256;

	СчетчикТаблиц   = 0;
	СчетчикДвижений = 0;

	ВсегоДвижений = Движения.Количество();
	ТекстЗапроса  = "";
	Для Каждого Движение Из Движения Цикл

		СчетчикДвижений = СчетчикДвижений + 1;

		ПропуститьРегистр = МассивИсключаемыхРегистров <> Неопределено
							И МассивИсключаемыхРегистров.Найти(Движение.Имя) <> Неопределено;

		Если Не ПропуститьРегистр Тогда

			Если СчетчикТаблиц > 0 Тогда

				ТекстЗапроса = ТекстЗапроса + "
				|ОБЪЕДИНИТЬ ВСЕ
				|";

			КонецЕсли;

			СчетчикТаблиц = СчетчикТаблиц + 1;

			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|""" + Движение.Имя + """ КАК ИмяРегистра
			|
			|ИЗ " + Движение.ПолноеИмя() + "
			|
			|ГДЕ Регистратор = &Регистратор
			|";

		КонецЕсли;

		Если СчетчикТаблиц = МаксимумТаблицВЗапросе Или СчетчикДвижений = ВсегоДвижений Тогда

			Запрос.Текст  = ТекстЗапроса;
			ТекстЗапроса  = "";
			СчетчикТаблиц = 0;

			Если Результат.Количество() = 0 Тогда

				Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяРегистра");

			Иначе

				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					Результат.Добавить(Выборка.ИмяРегистра);
				КонецЦикла;

			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Процедура выполняет пордготовку наборов записей документа к записи движений.
//  1. Очищает наборы записей от "старых записей" (ситуация возможна только в толстом клиенте)
//  2. Взводит флаг записи у наборов, по которым документ имеет движения
//  Вызывается из модуля документов при проведении.
//
// Параметры:
//  Объект	 - ДокументОбъект - наборы записей которого нудно подготовить
//  ЭтоНовый - Булево - признак нового документа
//
Процедура ПодготовитьНаборыЗаписейКРегистрацииДвижений(Объект, ЭтоНовый = Ложь) Экспорт
	Перем ЭтоНовыйДокумент, МетаданныеДвижения;
	
	Для Каждого НаборЗаписей Из Объект.Движения Цикл
		
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ Объект.ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовыйДокумент) Тогда
		ЭтоНовыйДокумент = ЭтоНовый;
	КонецЕсли;
	
	Если НЕ ЭтоНовыйДокумент Тогда
		
		// Регистры, движения по которым формируются не из модуля менеджера документа.
		ИсключаемыеРегистры = Новый Массив;
		
		Если Объект.ДополнительныеСвойства.Свойство("ДляПроведения")
			И Объект.ДополнительныеСвойства.ДляПроведения.Свойство("МетаданныеДокумента") Тогда
			МетаданныеДвижения = Объект.ДополнительныеСвойства.ДляПроведения.МетаданныеДокумента.Движения;
		Иначе
			МетаданныеДвижения = Объект.Метаданные().Движения;
		КонецЕсли;
		
		МассивИменРегистров = ПолучитьМассивИспользуемыхРегистров(
		Объект.Ссылка,
		МетаданныеДвижения,
		ИсключаемыеРегистры);
		
		Для Каждого ИмяРегистра Из МассивИменРегистров Цикл
			Объект.Движения[ИмяРегистра].Записывать = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура записывает движения документа. Дополнительно происходит копирование параметров
//  в модули наборов записей для выполнения регистрации изменений в движениях.
//  Процедура вызывается из модуля документов при проведении.
//
// Параметры:
//  Объект	 - ДокументОбъект - объект, для которого нужно записать движения
//
Процедура ЗаписатьНаборыЗаписей(Объект) Экспорт
	Перем РегистрыДляКонтроля, РассчитыватьИзменения, ПараметрыКонтроля;
	
	// Заполним общие дополнительные свойства всех движений
	
	Для Каждого Движение Из Объект.Движения Цикл
		
		Движение.ДополнительныеСвойства.Вставить("ЭтоНовый", Объект.ДополнительныеСвойства.ЭтоНовый);
		Движение.ДополнительныеСвойства.Вставить("РежимЗаписи", Объект.ДополнительныеСвойства.РежимЗаписи);
		Движение.ДополнительныеСвойства.Вставить("ДатаРегистратора", Объект.Дата);
		Движение.ДополнительныеСвойства.Вставить("СтруктураОтраженияРеглПроводок", Новый Структура);
		
		Движение.ДополнительныеСвойства.Вставить("ДляПроведения", 
			Новый Структура("СтруктураВременныеТаблицы",
				// Структура для передачи данных в модули наборов записей.
				Объект.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы));
		
	КонецЦикла;
	
	// Регистры, для которых будут рассчитаны таблицы изменений движений.
	Если Объект.ДополнительныеСвойства.ДляПроведения.Свойство("РегистрыДляКонтроля", РегистрыДляКонтроля) Тогда
		
		// Установка флага регистрации изменений в наборе записей.
		Если НЕ Объект.ДополнительныеСвойства.Свойство("РассчитыватьИзменения", РассчитыватьИзменения) Тогда
			РассчитыватьИзменения = Истина;
		КонецЕсли;
		
		Для Каждого НаборЗаписей Из РегистрыДляКонтроля Цикл
			Если НаборЗаписей.Записывать Тогда
				
				НаборЗаписей.ДополнительныеСвойства.Вставить("РассчитыватьИзменения", РассчитыватьИзменения);
				
				// Необходимость контроля обеспечения устанавливается при выполнении рекомендаций в "Состояние обеспечения заказов".
				КонтролироватьОбеспечение = Неопределено;
				Если Объект.ДополнительныеСвойства.Свойство("КонтролироватьОбеспечение", КонтролироватьОбеспечение) Тогда
					НаборЗаписей.ДополнительныеСвойства.Вставить("КонтролироватьОбеспечение", КонтролироватьОбеспечение);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;
	
	//Для отработки случаев, когда документ перестает делать движения по регистру (при изменении вида операции). Очистим оффлайновые регистры.
	Если Объект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение И Не Объект.ДополнительныеСвойства.ЭтоНовый Тогда
		Если Объект.Движения.Найти("РасчетыСКлиентами") <> Неопределено Тогда
			
			СтатусОплачивается = Неопределено;
			
			Если Объект.Движения.РасчетыСКлиентами.Записывать
					И (Объект.Движения.РасчетыСКлиентами.Количество() = 0
					ИЛИ (Объект.ДополнительныеСвойства.Свойство("СтатусОплачивается", СтатусОплачивается) И СтатусОплачивается)) Тогда
				Объект.Движения.РасчетыСКлиентамиПоДокументам.Записывать = Истина;
			КонецЕсли;

		КонецЕсли;

		Если Объект.Движения.Найти("РасчетыСПоставщиками") <> Неопределено Тогда

			СтатусОплачивается = Неопределено;
			
			Если Объект.Движения.РасчетыСПоставщиками.Записывать
					И (Объект.Движения.РасчетыСПоставщиками.Количество() = 0
					ИЛИ (Объект.ДополнительныеСвойства.Свойство("СтатусОплачивается", СтатусОплачивается) И СтатусОплачивается)) Тогда
				Объект.Движения.РасчетыСПоставщикамиПоДокументам.Записывать = Истина;
			КонецЕсли;

		КонецЕсли;
		
		Если Объект.Движения.Найти("МатериалыИРаботыВПроизводстве") <> Неопределено И Объект.Движения.Найти("ПартииПроизводственныхЗатрат") <> Неопределено Тогда
			Если Объект.Движения.МатериалыИРаботыВПроизводстве.Количество() = 0 И Объект.Движения.МатериалыИРаботыВПроизводстве.Записывать Тогда
				Объект.Движения.ПартииПроизводственныхЗатрат.Записывать = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Объект.Движения.Записать();
	
КонецПроцедуры

// Процедура переписывает строки таблицы в указанные движения документа
//
// Параметры:
//	Таблица  - ТаблицаЗначений   - Таблица, строки которой должны быть помещены в движения документа,
//	Движения - КоллекцияДвижений - Элемент коллекции движений документа, набор записей регистра,
//	Отказ    - Булево            - Признак отказа выполнения транзакции.
//
Процедура ОтразитьДвижения(Таблица, Движения, Отказ) Экспорт
	
	Если Отказ Или Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.Записывать = Истина;
	Движения.Загрузить(Таблица);
	
КонецПроцедуры

// Загружает ТаблицыДляДвижений в наборы записей регистров движений документа.
//
// Параметры:
//	ДополнительныеСвойства - Структура - структура с дополнительными свойствами документа, используемыми при проведении.
//		в структуре обязательно должен быть ключ "ТаблицыДляДвижений" содержащий массив таблиц значений 
//		предназначеные для загрузки в наборы записей;
//	Движения - КоллекцияДвижений - коллекция движений документа.
//
Процедура ЗагрузитьТаблицыДвижений(ДополнительныеСвойства, Движения) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицыДляДвижений") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	Для Каждого Таблица Из ТаблицыДляДвижений Цикл
		
		ИмяРегистра = Таблица.Ключ;
		Если ВРег(Лев(ИмяРегистра,7))= "ТАБЛИЦА" Тогда
			ИмяРегистра = Прав(ИмяРегистра, СтрДлина(ИмяРегистра)-7);
		КонецЕсли;
		
		
		Если Таблица.Значение.Количество() > 0 И Движения.Найти(ИмяРегистра) <> Неопределено Тогда
			Движения[ИмяРегистра].Записывать = Истина;
			Движения[ИмяРегистра].Загрузить(Таблица.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура очищает и записывает пустые движения по указанным регистрам
//
// Параметры:
// 		Движения - КоллекцияДвижений - Коллекция наборов записей регистров документа
// 		Регистры - Строка - Строка с именами регистров для очистки, перечисленными через запятую
//
Процедура ОчиститьЗаписатьДвижения(Движения, Регистры) Экспорт
	
	СтруктураРегистров = Новый Структура(Регистры);
	Для Каждого КлючИЗначение Из СтруктураРегистров Цикл
		Движения[КлючИЗначение.Ключ].Очистить();
		Движения[КлючИЗначение.Ключ].Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

// Процедура компонует текст запроса, выполняет запрос и выгружает результаты запроса в таблицы.
//
// Параметры:
//  Запрос					 - Запрос	 - запрос, параметры которого предварительно установлены.
//  ТекстыЗапроса			 - СписокЗначений	 - в списке перечислены тексты запросов и их имена.
//  Таблицы					 - Структура		 - структура в которую будут помещены полученные таблицы для движений.
//  ДобавитьРазделитель		 - Булево			 - Истина, если нужно добавить разделитель ";" между запросами.
//  ДобавлятьСловоТаблица	 - Булево			 - Истина, если к имени таблицы движений нужно вначало добавить слово "Таблица".
//  ТолькоОтмеченные		 - Булево			 - признак пропуска инициализации таблицы движения.
//
Процедура ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, Таблицы, ДобавитьРазделитель = Ложь, ДобавлятьСловоТаблица = Истина, ТолькоОтмеченные = Ложь) Экспорт
	
	ТаблицыЗапроса = ВыгрузитьРезультатыЗапроса(Запрос, ТекстыЗапроса,, ДобавитьРазделитель);
	
	// Помещение результатов запроса в таблицы
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл

		ИмяТаблицы = ТекстЗапроса.Представление;

		Если Не ПустаяСтрока(ИмяТаблицы) И (Не ТолькоОтмеченные Или ТекстЗапроса.Пометка) Тогда

			Если ДобавлятьСловоТаблица Тогда
				// Таблицы для проведения должны начинаться с "Таблица"
				Если НЕ СтрНачинаетсяС(ИмяТаблицы, "Таблица") Тогда
					ИмяТаблицы = "Таблица" + ИмяТаблицы;
				КонецЕсли;
			КонецЕсли;
			
			Таблицы.Вставить(ИмяТаблицы, ТаблицыЗапроса[ТекстЗапроса.Представление]);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Проверяет наличие текста запроса для формирования указанной таблицы
//
// Параметры:
//  ИмяТаблицы		 - Строка		 - имя таблицы
//  ТекстыЗапроса	 - СписокЗначений	 - список значений, значениями которого являются блоки запроса,
//  	синонимами - имена таблиц в которые необходимо поместить
//  	результат выполнения каждого отдельного блока запроса.
// 
// Возвращаемое значение:
//  Булево - Истина, если текст запроса есть.
//
Функция ЕстьТаблицаЗапроса(ИмяТаблицы, ТекстыЗапроса) Экспорт

	Если ТекстыЗапроса = Неопределено Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Для каждого ТекстЗапроса Из ТекстыЗапроса Цикл
		Если НРег(ТекстЗапроса.Представление) = НРег(ИмяТаблицы) Тогда
			Возврат Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Ложь;

КонецФункции

// Определяет необходимость подготовить таблицу для формирования движений
//
// Параметры:
//  ИмяРегистра	- Строка - имя регистра. Например "ТоварыНаСкладах"
//  Регистры	- Строка, Структура, Неопределено - список регистров, разделенных запятой, или структура, в ключах которой - имена регистров
//													Если неопределено - то всегда возвращается ИСТИНА
// 
// Возвращаемое значение:
//   - Булево - Истина, если требуется инициализировать указанную таблицу
//
Функция ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Экспорт

	Если ЗначениеЗаполнено(Регистры) Тогда
		
		Если ТипЗнч(Регистры) = Тип("Строка") Тогда
			МассивРегистров = Новый Структура(Регистры);
		Иначе
			МассивРегистров = Регистры;
		КонецЕсли;
		
		Если НЕ МассивРегистров.Свойство(ИмяРегистра) Тогда
			Возврат Ложь;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Истина;

КонецФункции

// Процедура формирует текст исключения и вызывает исключение
//  используется для прерывания проведения в документах для которых запрещено выборочное проведение по регистрам
//
// Параметры:
//  ЗапретныйДокумент	 - ДокументСсылка, ДокументОбъект	 - документ для которого необходимо сформировать и вызвать исключения
//
Процедура ЗапретВыборочногоПроведенияПоРегистрам(ЗапретныйДокумент) Экспорт
	
	ТекстИсключения = СтрШаблон(НСтр("ru = 'Для документа ""%1"" запрещено выборочное проведение по регистрам.'"),
								ЗапретныйДокумент.Метаданные().Синоним);
	ВызватьИсключение ТекстИсключения;
	
КонецПроцедуры

// Формирует пакет запросов и возвращает результат каждого запроса
//
// Параметры:
//	Запрос			- Запрос - запрос, параметры которого предварительно установлены.
//	ТекстыЗапроса	- СписокЗначений - в списке перечислены тексты запросов и их имена.
//	ОбходРезультата - ОбходРезультатаЗапроса - вариант обхода результата запроса.
//	ДобавитьРазделитель - Булево - добавлять разделитель между запросами из ТекстыЗапроса
//	УничтожитьСозданныеВременныеТаблицы - Булево - добавить уничножение временных таблиц, создаваемых в ТекстыЗапроса
//										Для уничтожения таблице должно быть присвоено имя в ТекстыЗапроса
//
// Возвращаемое значение:
//   Структура   - структура в которую помещены полученные таблицы
//
Функция ВыгрузитьРезультатыЗапроса(Запрос,
								 	ТекстыЗапроса,
									ОбходРезультата = Неопределено,
									ДобавитьРазделитель = Ложь,
									УничтожитьСозданныеВременныеТаблицы = Ложь) Экспорт

	Таблицы = Новый Структура;
	
	// Инициализация варианта обхода результата запроса.
	Если ОбходРезультата = Неопределено Тогда
		ОбходРезультата = ОбходРезультатаЗапроса.Прямой;
	КонецЕсли;
	
	ТекстУничтоженияВременныхТаблиц = "";
	
	ТекстИтоговогоЗапроса = "";
	
	// Формирование текст запроса.
	Для Каждого ТекстЗапроса Из ТекстыЗапроса Цикл
		Если ЗначениеЗаполнено(ТекстЗапроса.Представление) Тогда
			ТекстИтоговогоЗапроса = ТекстИтоговогоЗапроса 
							+ ?(ТекстИтоговогоЗапроса <> "", Символы.ПС, "")
							+ "// " + ТекстЗапроса.Представление + Символы.ПС;
		КонецЕсли; 
		ТекстИтоговогоЗапроса = ТекстИтоговогоЗапроса + ТекстЗапроса.Значение;
		
		Если ДобавитьРазделитель Тогда
			ТекстИтоговогоЗапроса = ТекстИтоговогоЗапроса + РазделительЗапросовВПакете();
		КонецЕсли;
		
		Если УничтожитьСозданныеВременныеТаблицы
			И ЗначениеЗаполнено(ТекстЗапроса.Представление) Тогда
			Если СтрНайти(ВРег(ТекстЗапроса.Значение), "ПОМЕСТИТЬ") <> 0 Тогда
		    	ТекстУничтоженияВременныхТаблиц = ТекстУничтоженияВременныхТаблиц + "
				|УНИЧТОЖИТЬ " + ТекстЗапроса.Представление;
				ТекстУничтоженияВременныхТаблиц = ТекстУничтоженияВременныхТаблиц + РазделительЗапросовВПакете();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	// Выполнение запроса.
	
	Если ЗначениеЗаполнено(ТекстУничтоженияВременныхТаблиц) Тогда
		ТекстИтоговогоЗапроса = ТекстИтоговогоЗапроса + ТекстУничтоженияВременныхТаблиц;
	КонецЕсли;
	
	Если ТекстИтоговогоЗапроса = "" Тогда
		Возврат Таблицы;
	КонецЕсли;
	
	Запрос.Текст = ТекстИтоговогоЗапроса;
	Результат = Запрос.ВыполнитьПакет();

	// Помещение результатов запроса в таблицы
	Для Каждого ТекстЗапроса Из ТекстыЗапроса Цикл

		ИмяТаблицы = ТекстЗапроса.Представление;

		Если Не ПустаяСтрока(ИмяТаблицы) Тогда

			Индекс = ТекстыЗапроса.Индекс(ТекстЗапроса);
			Таблицы.Вставить(ИмяТаблицы, Результат[Индекс].Выгрузить(ОбходРезультата));

		КонецЕсли;

	КонецЦикла;

	Возврат Таблицы;
	
КонецФункции

// Возвращает строку для вставки между запросами, объединяемыми в пакет
// 
// Возвращаемое значение:
//  Строка 
//
Функция РазделительЗапросовВПакете() Экспорт
	
	Возврат "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
КонецФункции

#КонецОбласти

#Область ПодготовкаИЗаписьПодчиненныхДанныхПослеПроведенияДокумента

// Проверяет наличие дополнительного свойства, отвечающего за параметры записи подчиненных данных, осуществляемой
//  после записи документа и его движений.
//
// Параметры:
//  ДополнительныеСвойства	 - Структура - дополнительные свойства регистра
//  ТипПодчиненныхДанных	 - Строка	 - описание типа подчиненных данных
// 
// Возвращаемое значение:
//   - Булево - Истина, если требуется записать.
//
Функция ЗаписыватьПодчиненныеДанные(ДополнительныеСвойства, ТипПодчиненныхДанных) Экспорт
	
	Если Не ДополнительныеСвойства.Свойство("ДляЗаписиПодчиненныхДанных") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипПодчиненныхДанных = "СостоянияЗаказов" Тогда
		Возврат ДополнительныеСвойства.ДляЗаписиПодчиненныхДанных.Свойство("СтруктураДляРасчетаСостояний");
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Добавляет в структуру дополнительных свойств регистра накопления параметры записи подчиненных данных, осуществляемой
//  после записи документа и его движений.
//
// Параметры:
//  ДополнительныеСвойства	 - Структура - дополнительные свойства регистра
//  ТипПодчиненныхДанных	 - Строка - описание типа подчиненных данных
//
Процедура ДобавитьСтруктуруЗаписиПодчиненныхДанных(ДополнительныеСвойства, ТипПодчиненныхДанных) Экспорт
	
	Если Не ДополнительныеСвойства.Свойство("ДляЗаписиПодчиненныхДанных") Тогда
		ДополнительныеСвойства.Вставить("ДляЗаписиПодчиненныхДанных", Новый Структура());
	КонецЕсли;
		
	Если ТипПодчиненныхДанных = "СостоянияЗаказов" Тогда
		
		СтруктураДляРасчетаСостояний = Новый Структура("МассивЗаказов", Новый Массив());
		ДополнительныеСвойства.ДляЗаписиПодчиненныхДанных.Вставить("СтруктураДляРасчетаСостояний", СтруктураДляРасчетаСостояний);
		
	КонецЕсли;
	
КонецПроцедуры

// Добавляет в структуру дополнительных свойств объекта параметры записи подчиненных данных, осуществляемой
//  после записи документа и его движений.
//
// Параметры:
//  ДополнительныеСвойства	 - Структура - дополнительные свойства объекта.
//  Ссылка					 - ДокументСсылка - ссылка на заказ
//
Процедура ДобавитьЗаказДляРасчетаСостояний(ДополнительныеСвойства, Ссылка) Экспорт
	
	СтруктураДляРасчетаСостояний = Новый Структура("МассивЗаказов", Новый Массив());
	СтруктураДляРасчетаСостояний.МассивЗаказов.Добавить(Ссылка);
	ДополнительныеСвойства.Вставить("ДляЗаписиПодчиненныхДанных", Новый Структура("СтруктураДляРасчетаСостояний", СтруктураДляРасчетаСостояний));
	
КонецПроцедуры

// Осуществляеет запись подчиненных данных после записи документа и его движений.
//
// Параметры:
//  Объект	 - ДокументОбъект	 - документ для контроля
//  Отказ	 - булево			 - признак отказа от записи
//
Процедура ЗаписатьПодчиненныеНаборамЗаписейДанные(Объект, Отказ) Экспорт
	
	МассивЗаказов = Новый Массив();
	Для Каждого Набор Из Объект.Движения Цикл
		
		Если Не Набор.ДополнительныеСвойства.Свойство("ДляЗаписиПодчиненныхДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураСвойств = Набор.ДополнительныеСвойства.ДляЗаписиПодчиненныхДанных;
		
		Если СтруктураСвойств.Свойство("СтруктураДляРасчетаСостояний") Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивЗаказов, СтруктураСвойств.СтруктураДляРасчетаСостояний.МассивЗаказов);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Объект.ДополнительныеСвойства.Свойство("ДляЗаписиПодчиненныхДанных") Тогда
		
		СтруктураСвойств = Объект.ДополнительныеСвойства.ДляЗаписиПодчиненныхДанных;
		Если СтруктураСвойств.Свойство("СтруктураДляРасчетаСостояний") Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивЗаказов, СтруктураСвойств.СтруктураДляРасчетаСостояний.МассивЗаказов);
		КонецЕсли;
		
	КонецЕсли;
	
	РегистрыСведений.СостоянияВнутреннихЗаказов.ОтразитьСостояниеЗаказа(МассивЗаказов, Отказ);
	
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыКонтроляДвиженийДокументовПоРегистрам

// Процедура выполняет контроль результатов проведения.
//  Процедура вызывается из модуля документов при проведении.
//
// Параметры:
//  Объект	 - ДокументОбъект - документ для контроля
//  Отказ	 - булево - признак отказа от записи
//
Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт

	Если ЗначениеЗаполнено(ПараметрыСеанса.ПараметрыОбработчикаОбновления.РежимВыполнения) 
		Или Объект.ДополнительныеСвойства.ДляПроведения.РегистрыДляКонтроля.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ДанныеТаблиц    = Объект.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	ПакетЗапросов   = Новый Запрос;
	МассивКонтролей = Новый Массив;
	ТекстЗапроса    = "";
	
	// Контроль отрицательных остатков ЗаказыКлиентов.
	Если ЕстьИзмененияВТаблице(ДанныеТаблиц,"ДвиженияЗаказыКлиентовИзменение") Тогда

		ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров =
			Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить();
		
		МассивКонтролей.Добавить(Врег("ЗаказыКлиентов"));
		
		Если ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров = 0 Тогда
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ТаблицаОстатков.ЗаказКлиента                   КАК Заказ,
			|	ТаблицаОстатков.Номенклатура                   КАК Номенклатура,
			|	ТаблицаОстатков.Номенклатура.ЕдиницаИзмерения  КАК ЕдиницаИзмерения,
			|	ТаблицаОстатков.Характеристика                 КАК Характеристика,
			|	ТаблицаОстатков.Серия                          КАК Серия,
			|	ТаблицаОстатков.Склад                          КАК Склад,
			|	ТаблицаОстатков.КОформлениюОстаток             КАК Количество
			|ИЗ
			|	РегистрНакопления.ЗаказыКлиентов.Остатки(,
			|			(ЗаказКлиента, Номенклатура, Характеристика, Серия, Склад) В
			|				(ВЫБРАТЬ
			|					Таблица.ЗаказКлиента,
			|					Таблица.Номенклатура,
			|					Таблица.Характеристика,
			|					Таблица.Серия,
			|					Таблица.Склад
			|				ИЗ
			|					ДвиженияЗаказыКлиентовИзменение КАК Таблица)
			|	) КАК ТаблицаОстатков
			|ГДЕ
			|	ТаблицаОстатков.КОформлениюОстаток < 0";
			
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ
			|	ЗаказыОстатки.ЗаказКлиента                   КАК Заказ,
			|	ЗаказыОстатки.Номенклатура                   КАК Номенклатура,
			|	ЗаказыОстатки.Номенклатура.ЕдиницаИзмерения  КАК ЕдиницаИзмерения,
			|	ЗаказыОстатки.Характеристика                 КАК Характеристика,
			|	ЗаказыОстатки.Серия                          КАК Серия,
			|	ЗаказыОстатки.Склад                          КАК Склад,
			|	ЗаказыОстатки.КОформлениюОстаток             КАК Количество
			|ИЗ
			|	ВТЗаказыКлиентовОстатки КАК ЗаказыОстатки
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|		ВТДопустимыеОтклоненияЗаказыКлиентов КАК ДопустимыеОтклонения
			|		ПО
			|			ЗаказыОстатки.ЗаказКлиента     = ДопустимыеОтклонения.ЗаказКлиента
			|			И ЗаказыОстатки.Номенклатура   = ДопустимыеОтклонения.Номенклатура
			|			И ЗаказыОстатки.Характеристика = ДопустимыеОтклонения.Характеристика
			|			И ЗаказыОстатки.Склад          = ДопустимыеОтклонения.Склад
			|			И ЗаказыОстатки.Серия          = ДопустимыеОтклонения.Серия
			|ГДЕ
			|	ЗаказыОстатки.КОформлениюОстаток + ЕСТЬNULL(ДопустимыеОтклонения.ДопустимоеОтклонение,0) < 0";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + 
		";
		|///////////////////////////////////////////////////////////////////
		|";
		
	КонецЕсли;
	
	Если МассивКонтролей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПакетЗапросов.Текст = ТекстЗапроса;
	ПакетЗапросов.МенеджерВременныхТаблиц = ДанныеТаблиц.МенеджерВременныхТаблиц;
	МассивРезультатов = ПакетЗапросов.ВыполнитьПакет();

	Итератор = -1;
	Для Каждого Результат Из МассивРезультатов Цикл

		Итератор = Итератор + 1;
		Если Результат.Пустой() Тогда
			Продолжить;
		КонецЕсли;

		ИмяКонтроля = МассивКонтролей[Итератор];

		Если ИмяКонтроля = Врег("ДвиженияТоварыКОтгрузкеСводно") Тогда

			СообщитьОбОшибкахПроведенияПоРегиструСерии(Объект, Отказ, Результат);
			
		Иначе

			ВызватьИсключение НСтр("ru = 'Ошибка контроля проведения!'");

		КонецЕсли;
	КонецЦикла;

	Если Отказ Тогда

		Если Объект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ТекстСообщения = НСтр("ru = 'Проведение не выполнено %ПредставлениеОбъекта%'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Отмена проведения не выполнена %ПредставлениеОбъекта%'");
		КонецЕсли;

		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеОбъекта%", Строка(Объект));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект);

	КонецЕсли;

КонецПроцедуры


// Функция вызывается из модулей наборов записей для проверки необходимости
//  контроля изменений движений в регистре.
//
// Параметры:
//  ДополнительныеСвойстваНабораЗаписей	 - Структура - дополнительные свойства набора записей.
// 
// Возвращаемое значение:
//  Булево, Истина - признак необходимости выполнения контроля изменений движений в регистре.
//
Функция РассчитыватьИзменения(ДополнительныеСвойстваНабораЗаписей) Экспорт
	Перем РассчитыватьИзменения;

	Возврат Не ЗначениеЗаполнено(ПараметрыСеанса.ПараметрыОбработчикаОбновления.РежимВыполнения) 
		И ДополнительныеСвойстваНабораЗаписей.Свойство("РассчитыватьИзменения", РассчитыватьИзменения)
		И РассчитыватьИзменения;

КонецФункции

// Функция вызывается из модулей наборов записей для проверки необходимости
//  контроля изменений движений в регистрах "Свободные остатки" и "Движение товаров".
//
// Параметры:
//  ДополнительныеСвойстваНабораЗаписей	 - Структура - дополнительные свойства набора.
// 
// Возвращаемое значение:
//  Булево, Истина - признак необходимости выполнения контроля изменений движений в регистре
//  "Свободные остатки" и "Движение товаров".
//
Функция КонтролироватьОбеспечение(ДополнительныеСвойстваНабораЗаписей) Экспорт
	Перем КонтролироватьОбеспечение;

	Возврат Не ДополнительныеСвойстваНабораЗаписей.Свойство("КонтролироватьОбеспечение", КонтролироватьОбеспечение)
		Или КонтролироватьОбеспечение;

КонецФункции

// Заполняет значение режима проведения документа.
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъект			 - экземпляр объекта определенного документа.
//  РежимЗаписи		 - РежимЗаписиДокумента		 - значение режима, в котором осуществляется запись документа.
//  РежимПроведения	 - РежимПроведенияДокумента	 - значение режима, в котором осуществляется проведение документа.
//
Процедура УстановитьРежимПроведения(ДокументОбъект, РежимЗаписи, РежимПроведения) Экспорт

	Если ДокументОбъект.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли;

КонецПроцедуры

// Процедура выполняет подготовку наборов записей документа к проведению документа.
//  1. Очищает наборы записей от "старых записей" (ситуация возможна только в толстом клиенте)
//  2. Взводит флаг записи у наборов, по которым документ имел движения при прошлом проведении
//  3. Устанавливает активность наборам записей документов с установленным флагом ручной корректировки
//  4. Записывает пустые наборы, если дата ранее проведенного документа была сдвинута вперед
//  Вызывается из модуля документа при проведении.
//
// Параметры:
//  Объект					 - ДокументОбъект - документ-объект, для которого происходит подготовка
//  ВыборочноОчищатьРегистры - Булево - признак выборочной очистки регистров
//
Процедура ПодготовитьНаборыЗаписейКПроведению(Объект, ВыборочноОчищатьРегистры = Истина) Экспорт
	
	Для каждого НаборЗаписей Из Объект.Движения Цикл
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;
	КонецЦикла;

	Если Объект.ДополнительныеСвойства.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	// Регистры, требующие принудительной очистки:
	МассивИменРегистровПринудительнойОчистки = Новый Массив;
	МассивИменРегистровПринудительнойОчистки.Добавить("РасходыПриУСН");
	МассивДвиженийДляПринудительнойОчистки = Новый Массив;
	
	МассивИменРегистров = ПолучитьМассивИспользуемыхРегистров(
		Объект.Ссылка, 
		МетаданныеОбъекта.Движения);

	Для каждого ИмяРегистра Из МассивИменРегистров Цикл
		Объект.Движения[ИмяРегистра].Записывать = Истина;
		Если МассивИменРегистровПринудительнойОчистки.Найти(ИмяРегистра) <> Неопределено
			ИЛИ НЕ ВыборочноОчищатьРегистры Тогда
			МассивДвиженийДляПринудительнойОчистки.Добавить(Объект.Движения[ИмяРегистра]);
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция проверяет наличие изменений в таблице регистра.
//
Функция ЕстьИзмененияВТаблице(СтруктураДанных, Ключ)
	Перем ЕстьИзменения;

	Возврат СтруктураДанных.Свойство(Ключ, ЕстьИзменения) И ЕстьИзменения;

КонецФункции

#Область ПроцедурыВыдачиСообщенийОбОшибкахПроведения

Процедура СообщитьОбОшибкахПроведенияПоРегиструСерии(Объект, Отказ, РезультатЗапроса)

		
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

		ШаблонСообщения = НСтр("ru = 'Товар %Товар% 
				|Недостаточно для отгрузки %Количество% %Единица%.'");

		ПредставлениеТовара = "";
		//НоменклатураКлиентСервер.ПредставлениеНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика,, Выборка.Серия);
		
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Количество%", Строка(-Выборка.Количество));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Товар%", ПредставлениеТовара );
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Единица%", Строка(Выборка.ЕдиницаИзмерения));

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,Объект,,,Отказ);

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти
