// Модуль менеджреа справочника "Сегменты номенклатуры"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьНастройкиКомпоновки(СегментСсылка) Экспорт
	
	РеквизитыСКДСегмента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СегментСсылка, "СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных");
	
	НастройкиСегмента = РеквизитыСКДСегмента.НастройкиКомпоновкиДанных.Получить();
	СхемаКомпоновки   = РеквизитыСКДСегмента.СхемаКомпоновкиДанных.Получить();
	
	НастройкиКомпоновки = Новый Структура("СхемаКомпоновки, НастройкиКомпоновки", СхемаКомпоновки, НастройкиСегмента);
	
	Возврат НастройкиКомпоновки;
	
КонецФункции

Функция ПолучитьНоменклатуруСегмента(ОбъектСсылка) Экспорт
	
	Результат = Новый Массив;
	
	Если ОбъектСсылка.РежимФормирования = Перечисления.РежимыФормированияСегментов.Динамический Тогда
		
		НастройкиКомпоновки = ПолучитьНастройкиКомпоновки(ОбъектСсылка);
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(
		НастройкиКомпоновки.СхемаКомпоновки, НастройкиКомпоновки.НастройкиКомпоновки,,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,,Истина);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ТаблицаНоменклатуры = Новый ТаблицаЗначений;
		
		ПроцессорВывода.УстановитьОбъект(ТаблицаНоменклатуры);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		Для Каждого ТекущаяСтрока Из ТаблицаНоменклатуры Цикл
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			Результат.Добавить(ТекущаяСтрока.Номенклатура);
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сегменты.Номенклатура
		|ИЗ
		|	РегистрСведений.НоменклатураСегмента КАК Сегменты
		|ГДЕ
		|	Сегменты.Сегмент = &СегментНоменклатуры
		|";
		
		Запрос.УстановитьПараметр("СегментНоменклатуры", ОбъектСсылка);
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Код");
	ОбязательныеРеквизиты.Добавить("Наименование");
	ОбязательныеРеквизиты.Добавить("РежимФормирования");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
