
#Область ПрограммныйИнтерфейс

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьСоответствиеСправочников.
Процедура ПолучитьСоответствиеСправочников(СоответствиеСправочников) Экспорт
	
	// ЭлектронноеВзаимодействие
	СоответствиеСправочников.Вставить("Организации", "Организации");
	СоответствиеСправочников.Вставить("Валюты",      "Валюты");
	// Конец ЭлектронноеВзаимодействие
	
	// ЭлектронноеВзаимодействие.ОбменСБанками
	СоответствиеСправочников.Вставить("Банки","КлассификаторБанков");
	СоответствиеСправочников.Вставить("БанковскиеСчетаОрганизаций",  "БанковскиеСчета");
	СоответствиеСправочников.Вставить("БанковскиеСчетаКонтрагентов", "БанковскиеСчета");
	// Конец ЭлектронноеВзаимодействие.ОбменСБанками
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	СоответствиеСправочников.Вставить("Контрагенты",                "Контрагенты");
	СоответствиеСправочников.Вставить("ДоговорыКонтрагентов",       "ДоговорыВзаиморасчетов");
	СоответствиеСправочников.Вставить("Номенклатура",               "Номенклатура");
	СоответствиеСправочников.Вставить("ХарактеристикиНоменклатуры", "ХарактеристикиНоменклатуры");
	СоответствиеСправочников.Вставить("НоменклатураПоставщиков",    "НоменклатураПоставщиков");
	СоответствиеСправочников.Вставить("УпаковкиНоменклатуры",       "ЕдиницыИзмерения");
	СоответствиеСправочников.Вставить("ЕдиницыИзмерения",           "КлассификаторЕдиницИзмерения");
	СоответствиеСправочников.Вставить("ФизическиеЛица",             "Пользователи");
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьСоответствиеНаименованийОбъектовМДИРеквизитов.
Процедура ПолучитьСоответствиеНаименованийОбъектовМДИРеквизитов(СоответствиеРеквизитовОбъекта) Экспорт
	
	// Обмен с контрагентами начало
	СоответствиеРеквизитовОбъекта.Вставить("РеализацияТоваровУслугВМетаданных",    "РеализацияТоваров");
	СоответствиеРеквизитовОбъекта.Вставить("ПоступлениеТоваровУслугВМетаданных",   "ПоступлениеТоваров");
	СоответствиеРеквизитовОбъекта.Вставить("ДатаВыставленияВСчетеФактуреВыданном", "ДатаВыставления");
	СоответствиеРеквизитовОбъекта.Вставить("ДатаПолученияВСчетеФактуреПолученном", "Дата");
	
	СоответствиеРеквизитовОбъекта.Вставить("НомерСчета", "НомерСчета");
	СоответствиеРеквизитовОбъекта.Вставить("ИННКонтрагента",                       "ИНН");
	СоответствиеРеквизитовОбъекта.Вставить("КППКонтрагента",                       "КПП");
	СоответствиеРеквизитовОбъекта.Вставить("НаименованиеКонтрагента",              "НаименованиеПолное");
	СоответствиеРеквизитовОбъекта.Вставить("НаименованиеКонтрагентаДляСообщенияПользователю", "Наименование");
	СоответствиеРеквизитовОбъекта.Вставить("ВнешнийКодКонтрагента",                "ИНН");
	СоответствиеРеквизитовОбъекта.Вставить("ПартнерКонтрагента",                   "Партнер");
	
	СоответствиеРеквизитовОбъекта.Вставить("ИННОрганизации",                       "ИНН");
	СоответствиеРеквизитовОбъекта.Вставить("КППОрганизации",                       "КПП");
	СоответствиеРеквизитовОбъекта.Вставить("ОГРНОрганизации",                      "ОГРН");
	СоответствиеРеквизитовОбъекта.Вставить("НаименованиеОрганизации",              "НаименованиеПолное");
	СоответствиеРеквизитовОбъекта.Вставить("ВнешнийКодОрганизации",                "ИНН");	
	СоответствиеРеквизитовОбъекта.Вставить("СокращенноеНаименованиеОрганизации",   "Наименование");
	
	СоответствиеРеквизитовОбъекта.Вставить("НомерДоговораКонтрагента",             "НомерДоговора");
	СоответствиеРеквизитовОбъекта.Вставить("ДатаДоговораКонтрагента",              "ДатаНачала");
	СоответствиеРеквизитовОбъекта.Вставить("ВладелецДоговораКонтрагента",          "Владелец");
	// Обмен с контрагентами конец.
	
	СоответствиеРеквизитовОбъекта.Вставить("СчетФактураВыданныйВМетаданных",       	"СчетФактураВыданный");
	СоответствиеРеквизитовОбъекта.Вставить("СчетФактураПолученныйВМетаданных",     	"СчетФактураПолученный");
	СоответствиеРеквизитовОбъекта.Вставить("КодПоОКПО",                             "КодПоОКПО");
	
	СоответствиеРеквизитовОбъекта.Вставить("ЮридическоеФизическоеЛицо",             "ФормаСобственности");
	
	// Обмен с банками начало
	СоответствиеРеквизитовОбъекта.Вставить("ПлатежноеПоручениеВМетаданных", 		"ПлатежноеПоручение");
	СоответствиеРеквизитовОбъекта.Вставить("ПлатежноеТребованиеВМетаданных",        "ПлатежноеПоручение");
	СоответствиеРеквизитовОбъекта.Вставить("ПлатежноеПоручение.СчетОрганизации",    "СчетОрганизации");
	СоответствиеРеквизитовОбъекта.Вставить("ПлатежноеПоручение.Организация",        "Организация");
	
	СоответствиеРеквизитовОбъекта.Вставить("БанковскийСчетОрганизации.Банк",		"Банк");
	СоответствиеРеквизитовОбъекта.Вставить("БанковскийСчетОрганизации.Организация",	"Владелец");
	СоответствиеРеквизитовОбъекта.Вставить("БанковскийСчетОрганизации.НомерСчета",  "НомерСчета");
	
	СоответствиеРеквизитовОбъекта.Вставить("Банк.БИК",                              "Код");
	СоответствиеРеквизитовОбъекта.Вставить("Банк.Наименование",                     "Наименование");
	СоответствиеРеквизитовОбъекта.Вставить("Банк.Город",                            "Город");
	// Обмен с банками конец
	
	// Обмен с сайтами начало
	//СоответствиеРеквизитовОбъекта.Вставить("ИННОрганизации",                       "ИНН");
	//СоответствиеРеквизитовОбъекта.Вставить("КППОрганизации",                       "КПП");
	СоответствиеРеквизитовОбъекта.Вставить("ПолноеНаименованиеОрганизации",        "Наименование");
	//СоответствиеРеквизитовОбъекта.Вставить("ЮридическоеФизическоеЛицо",            "ЮрФизЛицо");
	// Обмен с сайтами конец
	
КонецПроцедуры

// См. ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект.
Процедура НайтиСсылкуНаОбъект(ТипОбъекта, Результат, ИдОбъекта = "", ДополнительныеРеквизиты = Неопределено, ИДЭД = Неопределено) Экспорт
	
	Если ДополнительныеРеквизиты = Неопределено Тогда
		ДополнительныеРеквизиты = Новый Структура;
	КонецЕсли;
	
	// Обмен с контрагентами
	Если ТипОбъекта = "Валюты" Тогда
		ИмяПрикладногоСправочника = ТорговыйКомплексЭлектронноеВзаимодействиеЭДОПовтИсп.ИмяПрикладногоСправочника(ТипОбъекта);
		Результат = Неопределено; 
		ТорговыйКомплексЭДО.НайтиСсылкуНаОбъектПоРеквизиту(ИмяПрикладногоСправочника, "Код", ИдОбъекта, Результат);
		
	ИначеЕсли ТипОбъекта = "ЕдиницыИзмерения" Тогда
		ИмяПрикладногоСправочника = ТорговыйКомплексЭлектронноеВзаимодействиеЭДОПовтИсп.ИмяПрикладногоСправочника(ТипОбъекта);
		Результат     = Неопределено;
		Классификатор = Неопределено;
		ТорговыйКомплексЭДО.НайтиСсылкуНаОбъектПоРеквизиту(ИмяПрикладногоСправочника, "Код", ИдОбъекта, Классификатор);
		
		Если Классификатор = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
			Результат = Классификатор;
			Возврат;
		КонецЕсли;
		
		Если ДополнительныеРеквизиты.Свойство("Номенклатура") Тогда
			ТорговыйКомплексЭДО.НайтиСсылкуНаОбъектПоРеквизиту("ЕдиницыИзмерения", "ЕдиницаПоКлассификатору", Классификатор, Результат, ДополнительныеРеквизиты.Номенклатура);
		КонецЕсли;
		
		Если Результат = Неопределено И ДополнительныеРеквизиты.Свойство("ТипНоменклатуры") Тогда
			ТорговыйКомплексЭДО.НайтиСсылкуНаОбъектПоРеквизиту("ЕдиницыИзмерения", "ЕдиницаПоКлассификатору", Классификатор, Результат, ДополнительныеРеквизиты.ТипНоменклатуры);
		КонецЕсли;
		
		Если Результат = Неопределено Тогда
			Результат = Классификатор;
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = "ХарактеристикиНоменклатуры" Тогда
		ИмяПрикладногоСправочника = ТорговыйКомплексЭлектронноеВзаимодействиеЭДОПовтИсп.ИмяПрикладногоСправочника(ТипОбъекта);
		Результат = Неопределено; 
		ТорговыйКомплексЭДО.НайтиСсылкуНаОбъектПоРеквизиту(ИмяПрикладногоСправочника, "Код", ИдОбъекта, Результат);
		
	ИначеЕсли (ТипОбъекта = "Контрагенты" ИЛИ ТипОбъекта = "Организации") И ЗначениеЗаполнено(ДополнительныеРеквизиты) Тогда
		ПараметрПоиска = "";
		ИНН = "";
		КПП = "";
		
		Если ДополнительныеРеквизиты.Свойство("ИНН") Тогда
			ИНН = ДополнительныеРеквизиты.ИНН;
		КонецЕсли;
		
		Если ДополнительныеРеквизиты.Свойство("КПП") Тогда
			КПП = ДополнительныеРеквизиты.КПП;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИНН) Тогда
			ТорговыйКомплексОбменСКонтрагентамиЭДО.СсылкаНаОбъектПоИННКПП(ТипОбъекта, ИНН, КПП, Результат);
		КонецЕсли;
		
		ИмяМетаданных = ТорговыйКомплексЭлектронноеВзаимодействиеЭДОПовтИсп.ИмяПрикладногоСправочника(ТипОбъекта);
		
		Если НЕ ЗначениеЗаполнено(Результат) И ДополнительныеРеквизиты.Свойство("Наименование", ПараметрПоиска) Тогда
			Результат = Неопределено;
			ТорговыйКомплексЭДО.НайтиСсылкуНаОбъектПоРеквизиту(ИмяМетаданных, "Наименование", ПараметрПоиска, Результат);
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = "НоменклатураКонтрагентов" И ЗначениеЗаполнено(ДополнительныеРеквизиты) Тогда
		
		Владелец = "";
		ДополнительныеРеквизиты.Свойство("Владелец", Владелец);
		Идентификатор = "";
		ДополнительныеРеквизиты.Свойство("Идентификатор", Идентификатор);
		Наименование = "";
		ДополнительныеРеквизиты.Свойство("Наименование", Наименование);
		Характеристика = "";
		ДополнительныеРеквизиты.Свойство("Характеристика", Характеристика);
		НаименованиеУпаковки = "";
		ДополнительныеРеквизиты.Свойство("НаименованиеУпаковки", НаименованиеУпаковки);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВладелецНоменклатуры"      , Владелец);
		Запрос.УстановитьПараметр("Идентификатор"             , Идентификатор);
		Запрос.УстановитьПараметр("НаименованиеНоменклатуры"  , Наименование);
		Запрос.УстановитьПараметр("НаименованиеХарактеристики", Характеристика);
		Запрос.УстановитьПараметр("НаименованиеУпаковки"      , НаименованиеУпаковки);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НоменклатураКонтрагентов.Ссылка КАК Ссылка,
		|	1 КАК Приоритет
		|ИЗ
		|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|ГДЕ
		|	НоменклатураКонтрагентов.ВладелецНоменклатуры = &ВладелецНоменклатуры
		|	И НоменклатураКонтрагентов.Идентификатор = &Идентификатор
		|	И НЕ НоменклатураКонтрагентов.Недействителен
		|	И НЕ НоменклатураКонтрагентов.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НоменклатураКонтрагентов.Ссылка,
		|	2
		|ИЗ
		|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|ГДЕ
		|	НоменклатураКонтрагентов.НаименованиеНоменклатуры = &НаименованиеНоменклатуры
		|	И НоменклатураКонтрагентов.НаименованиеХарактеристики = &НаименованиеХарактеристики
		|	И НоменклатураКонтрагентов.НаименованиеУпаковки = &НаименованиеУпаковки
		|	И НоменклатураКонтрагентов.ВладелецНоменклатуры = &ВладелецНоменклатуры
		|	И НЕ НоменклатураКонтрагентов.Недействителен
		|	И НЕ НоменклатураКонтрагентов.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Ссылка;
		Иначе
			Результат = Справочники.НоменклатураКонтрагентов.ПустаяСсылка();
		КонецЕсли;
		
	ИначеЕсли ТипОбъекта = "НоменклатураПоставщиков" И ЗначениеЗаполнено(ДополнительныеРеквизиты) Тогда
		
		Владелец = "";
		ДополнительныеРеквизиты.Свойство("Владелец", Владелец);
		ПараметрПоиска = "";
		Если ДополнительныеРеквизиты.Свойство("Идентификатор", ПараметрПоиска) И ЗначениеЗаполнено(ПараметрПоиска) Тогда
			Результат = Неопределено; 
			ТорговыйКомплексЭДО.НайтиСсылкуНаОбъектПоРеквизиту(ТипОбъекта, "Идентификатор", ПараметрПоиска, Результат,  Владелец, Истина);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Результат) И ДополнительныеРеквизиты.Свойство("Наименование", ПараметрПоиска)
			И ЗначениеЗаполнено(ПараметрПоиска) Тогда // по наименованию
			Результат = Неопределено; 
			ТорговыйКомплексЭДО.НайтиСсылкуНаОбъектПоРеквизиту(ТипОбъекта, "Наименование", ПараметрПоиска, Результат, Владелец, Истина);
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Результат) И ДополнительныеРеквизиты.Свойство("Артикул", ПараметрПоиска)
			И ЗначениеЗаполнено(ПараметрПоиска) Тогда // по артикулу
			Результат = Неопределено; 
			ТорговыйКомплексЭДО.НайтиСсылкуНаОбъектПоРеквизиту(ТипОбъекта, "Артикул", ПараметрПоиска, Результат, Владелец, Истина);
		КонецЕсли;
	ИначеЕсли ТипОбъекта = "Номенклатура" И ЗначениеЗаполнено(ДополнительныеРеквизиты) Тогда
		
		ПараметрПоиска = "";
		Если ДополнительныеРеквизиты.Свойство("Идентификатор", ПараметрПоиска) И ЗначениеЗаполнено(ПараметрПоиска) Тогда
			Результат = НайтиСсылкуНаНоменклатуруПоИдентификаторуНоменклатурыПоставщика(ПараметрПоиска);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Результат) И ДополнительныеРеквизиты.Свойство("Артикул", ПараметрПоиска)
			И ЗначениеЗаполнено(ПараметрПоиска) Тогда
			
			ИмяПрикладногоСправочника = ТорговыйКомплексЭлектронноеВзаимодействиеЭДОПовтИсп.ИмяПрикладногоСправочника(ТипОбъекта);
			Результат = Неопределено; 
			ТорговыйКомплексЭДО.НайтиСсылкуНаОбъектПоРеквизиту(ИмяПрикладногоСправочника, "Код", ПараметрПоиска, Результат);
		КонецЕсли;
	
	ИначеЕсли ТипОбъекта = "БанковскиеСчетаОрганизаций" Или ТипОбъекта = "БанковскиеСчетаКонтрагентов" Тогда
		
		Владелец = "";
		Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") И ДополнительныеРеквизиты.Свойство("Владелец") Тогда
			Владелец = ДополнительныеРеквизиты.Владелец;
		КонецЕсли;
		
		ИмяПрикладногоСправочника = ТорговыйКомплексЭлектронноеВзаимодействиеЭДОПовтИсп.ИмяПрикладногоСправочника(ТипОбъекта);
		
		Результат = Неопределено; 
		ТорговыйКомплексЭДО.НайтиСсылкуНаОбъектПоРеквизиту(ИмяПрикладногоСправочника, "НомерСчета", ИдОбъекта, Результат, Владелец);
		
	ИначеЕсли ТипОбъекта = "Банки" И ЗначениеЗаполнено(ДополнительныеРеквизиты) Тогда
		
		Владелец = "";
		ПараметрПоиска = Неопределено;
		
		Если ДополнительныеРеквизиты.Свойство("Код", ПараметрПоиска) И ЗначениеЗаполнено(ПараметрПоиска) Тогда
			ИмяПрикладногоСправочника = ТорговыйКомплексЭлектронноеВзаимодействиеЭДОПовтИсп.ИмяПрикладногоСправочника(ТипОбъекта);
			Результат = Неопределено; 
			ТорговыйКомплексЭДО.НайтиСсылкуНаОбъектПоРеквизиту(
				ИмяПрикладногоСправочника, "Код", ПараметрПоиска, Результат, Владелец, Истина);
		КонецЕсли;
			
	ИначеЕсли ВРег(ТипОбъекта) = ВРег("ДоговорыКонтрагентов") Тогда
		
		Результат = ДоговорКонтрагентаПоРеквизитам(ДополнительныеРеквизиты);
		
	ИначеЕсли ТипОбъекта = "ВидыКонтактнойИнформации" Тогда
		
		ИДОбъектаВидКИ = Новый Структура;
		ИДОбъектаВидКИ.Вставить("EmailКонтрагента",   Справочники.ВидыКонтактнойИнформации.EmailКонтрагента);
		ИДОбъектаВидКИ.Вставить("ТелефонКонтрагента", Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
		ИДОбъектаВидКИ.Вставить("ФаксКонтрагента",    Справочники.ВидыКонтактнойИнформации.ФаксКонтрагента);
		ИДОбъектаВидКИ.Вставить("EmailОрганизации",   Справочники.ВидыКонтактнойИнформации.EmailОрганизации);
		ИДОбъектаВидКИ.Вставить("ТелефонОрганизации", Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
		ИДОбъектаВидКИ.Вставить("ФаксОрганизации",    Справочники.ВидыКонтактнойИнформации.ФаксОрганизации);
		
		ИДОбъектаВидКИ.Свойство(ИдОбъекта, Результат);
		
	ИначеЕсли ТипОбъекта = "СтраныМира" Тогда
		
		Результат = УправлениеКонтактнойИнформацией.СтранаМираПоКодуИлиНаименованию(ИдОбъекта);
		
	ИначеЕсли ТипОбъекта = "ГТД" Тогда
		
		Страна = Неопределено;
		ДополнительныеРеквизиты.Свойство("Страна", Страна);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Страна",       Страна);
		Запрос.УстановитьПараметр("Наименование", ИдОбъекта);
		
		Если ЗначениеЗаполнено(Страна) Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ТаблицаГТД.Ссылка КАК Ссылка,
			|	ТаблицаГТД.Код КАК Код
			|ИЗ
			|	Справочник.ГТД КАК ТаблицаГТД
			|ГДЕ
			|	ТаблицаГТД.Наименование = &Наименование
			|	И ТаблицаГТД.Страна = &Страна
			|	И НЕ ТаблицаГТД.ПометкаУдаления
			|УПОРЯДОЧИТЬ ПО
			|	Код";
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ТаблицаГТД.Ссылка КАК Ссылка,
			|	ТаблицаГТД.Код КАК Код
			|ИЗ
			|	Справочник.ГТД КАК ТаблицаГТД
			|ГДЕ
			|	ТаблицаГТД.Наименование = &Наименование
			|	И НЕ ТаблицаГТД.ПометкаУдаления
			|УПОРЯДОЧИТЬ ПО
			|	Код";
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Ссылка;
		Иначе
			Результат = Справочники.ГТД.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьПечатныйНомерДокумента.
Процедура ПолучитьПечатныйНомерДокумента(СсылкаНаОбъект, Результат) Экспорт
	
	Результат = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СсылкаНаОбъект.Номер, Истина);
	//Результат = УправлениеПечатьюПлатформа.ПолучитьНомерДляПечати(СсылкаНаОбъект);
	
КонецПроцедуры

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПроверитьГотовностьИсточников.
Процедура ПроверитьГотовностьИсточников(ДокументыМассив, БезЭлектроннойПодписи) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияТипаИзМассива(ДокументыМассив, Тип("СтрокаГруппировкиДинамическогоСписка"));
	
	МассивПроводныхДокументов = ОбщегоНазначенияБЭД.МассивПроводимыхДокументов(ДокументыМассив);

	МассивНепроведенныхДокументов = ОбщегоНазначения.ПроверитьПроведенностьДокументов(МассивПроводныхДокументов);
	Если МассивНепроведенныхДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонСообщения = НСтр("ru = 'Документ %1 не проведен. Электронный документ не сформирован.'");
	ШаблонОшибкиПроверки = НСтр("ru = 'Документ не проведен.'");
	Для Каждого НеПроведенныйДокумент Из МассивНепроведенныхДокументов Цикл
		
		ЭтоЗаказ = ТипЗнч(НеПроведенныйДокумент) = Тип("ДокументСсылка.ЗаказПоставщику") 
		Или ТипЗнч(НеПроведенныйДокумент) = Тип("ДокументСсылка.ЗаказПокупателя");
		
		// Не проверяем проведение документов заказ поставщику при отправке через 1С:Бизнес-сеть
		Если БезЭлектроннойПодписи И ЭтоЗаказ Тогда
			Продолжить;
		КонецЕсли;
		
		Найденный = ДокументыМассив.Найти(НеПроведенныйДокумент.Ссылка);
		Если Найденный <> Неопределено Тогда
			
			ДокументыМассив.Удалить(Найденный);
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
			Строка(НеПроведенныйДокумент.Ссылка));
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьДанныеЮрФизЛица(ЮрФизЛицо, Сведения) Экспорт
	
	Если Сведения = Неопределено Тогда
		Сведения = ЭлектронноеВзаимодействие.СтруктураДанныхЮрФизЛица();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЮрФизЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	ОрганизацияКИ = ЮрФизЛицо;
	ВладелецСчета = ЮрФизЛицо;
	
	Сведения.Ссылка = ЮрФизЛицо;
	
	Реквизиты = "ФормаСобственности, НаименованиеПолное, Наименование, ИНН, КПП, КодПоОКПО, ОГРН";
	
	Если Не ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
		Реквизиты = Реквизиты + ", СвидетельствоСерияНомер,
		| СвидетельствоДатаВыдачи, ОсновнойБанковскийСчет, ДатаОГРН";
	КонецЕсли;
	
	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		
		СтруктураДанных = Новый Структура(Реквизиты);
		
		Реквизиты = "НаименованиеПолное, Наименование, КПП, ОсновнойБанковскийСчет, Организация,
		|Организация.ФормаСобственности, Организация.НаименованиеПолное, Организация.Наименование,
		|Организация.ИНН, Организация.КПП, Организация.КодПоОКПО, Организация.ОГРН, Организация.ДатаОГРН,
		|Организация.СвидетельствоСерияНомер, Организация.СвидетельствоДатаВыдачи, Организация.ОсновнойБанковскийСчет";
		
		РеквизитыПодразделения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЮрФизЛицо, Реквизиты);
		Если НЕ ЗначениеЗаполнено(РеквизитыПодразделения.Организация) Тогда
			Возврат;
		КонецЕсли;
		
		ВладелецСчета = РеквизитыПодразделения.Организация;
		
		СтруктураДанных.ФормаСобственности      = РеквизитыПодразделения.ОрганизацияФормаСобственности;
		СтруктураДанных.НаименованиеПолное      = РеквизитыПодразделения.ОрганизацияНаименованиеПолное;
		СтруктураДанных.Наименование            = РеквизитыПодразделения.ОрганизацияНаименование;
		СтруктураДанных.ИНН                     = РеквизитыПодразделения.ОрганизацияИНН;
		СтруктураДанных.КПП                     = РеквизитыПодразделения.ОрганизацияКПП;
		СтруктураДанных.КодПоОКПО               = РеквизитыПодразделения.ОрганизацияКодПоОКПО;
		СтруктураДанных.ОГРН                    = РеквизитыПодразделения.ОрганизацияОГРН;
		СтруктураДанных.ДатаОГРН                = РеквизитыПодразделения.ОрганизацияДатаОГРН;
		СтруктураДанных.СвидетельствоСерияНомер = РеквизитыПодразделения.ОрганизацияСвидетельствоСерияНомер;
		СтруктураДанных.СвидетельствоДатаВыдачи = РеквизитыПодразделения.ОрганизацияСвидетельствоДатаВыдачи;
		СтруктураДанных.ОсновнойБанковскийСчет  = РеквизитыПодразделения.ОрганизацияОсновнойБанковскийСчет;
		
		Если ЗначениеЗаполнено(РеквизитыПодразделения.КПП) 
			И (Не СтруктураДанных.КПП = РеквизитыПодразделения.КПП) Тогда
			СтруктураДанных.КПП                    = РеквизитыПодразделения.КПП;
			СтруктураДанных.Наименование           = РеквизитыПодразделения.Наименование;
			СтруктураДанных.НаименованиеПолное     = РеквизитыПодразделения.НаименованиеПолное;
			Если ЗначениеЗаполнено(РеквизитыПодразделения.ОсновнойБанковскийСчет) Тогда
				СтруктураДанных.ОсновнойБанковскийСчет = РеквизитыПодразделения.ОсновнойБанковскийСчет;
				ВладелецСчета = ЮрФизЛицо;
			КонецЕсли;
			Если ПустаяСтрока(СтруктураДанных.НаименованиеПолное) Тогда
				СтруктураДанных.НаименованиеПолное = СтруктураДанных.Наименование;
			КонецЕсли;
		Иначе
			ОрганизацияКИ = РеквизитыПодразделения.Организация;
		КонецЕсли;
	Иначе
		
		СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЮрФизЛицо, Реквизиты);
		
	КонецЕсли;
	
	СтруктураДанных.Свойство("ФормаСобственности",      Сведения.ЮрФизЛицо);
	СтруктураДанных.Свойство("Наименование",            Сведения.СокращенноеНаименование);
	СтруктураДанных.Свойство("НаименованиеПолное",      Сведения.ОфициальноеНаименование);
	СтруктураДанных.Свойство("НаименованиеПолное",      Сведения.ПолноеНаименование);
	СтруктураДанных.Свойство("Наименование",            Сведения.Наименование);
	СтруктураДанных.Свойство("ИНН",                     Сведения.ИНН);
	СтруктураДанных.Свойство("КПП",                     Сведения.КПП);
	СтруктураДанных.Свойство("КодПоОКПО",               Сведения.КодПоОКПО);
	СтруктураДанных.Свойство("ОГРН",                    Сведения.ОГРН);
	СтруктураДанных.Свойство("ДатаОГРН",                Сведения.ДатаОГРН);
	СтруктураДанных.Свойство("СвидетельствоСерияНомер", Сведения.СвидетельствоСерияНомер);
	СтруктураДанных.Свойство("СвидетельствоДатаВыдачи", Сведения.СвидетельствоДатаВыдачи);
	
	Если Не СтруктураДанных.Свойство("НаименованиеПолное", Сведения.ПолноеНаименование) Тогда
		СтруктураДанных.Свойство("Наименование", Сведения.ОфициальноеНаименование);
		СтруктураДанных.Свойство("Наименование", Сведения.ПолноеНаименование);
	КонецЕсли;
	
	Если Сведения.ЮрФизЛицо = Перечисления.ФормыСобственности.ИндивидуальныйПредприниматель
		ИЛИ Сведения.ЮрФизЛицо = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		
		СтруктураНаименования = ТорговыйКомплексЭДОКлиентСервер.РазложитьСтрокуНаименованияОрганизации(
			Сведения.ПолноеНаименование, СтруктураДанных.ФормаСобственности);
		
		ФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(СтруктураНаименования.Наименование);
		Сведения.Вставить("Фамилия",  ФИО.Фамилия);
		Сведения.Вставить("Имя",      ФИО.Имя);
		Сведения.Вставить("Отчество", ФИО.Отчество);
		
	КонецЕсли;
	
	ТаблицаКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОрганизацияКИ,,,Ложь);
	
	Для Каждого СтрокаТаблицыКИ Из ТаблицаКИ Цикл
		
		Если СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации
			ИЛИ СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента
			ИЛИ СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресПодразделенияКомпании Тогда
			
			Сведения.ЮридическийАдресXML = СтрокаТаблицыКИ.ЗначенияПолей;
			Сведения.ЮридическийАдрес = СтрокаТаблицыКИ.Представление;
			
		ИначеЕсли СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации
			ИЛИ СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента
			ИЛИ СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресПодразделенияКомпании Тогда
			
			Сведения.ФактическийАдресXML = СтрокаТаблицыКИ.ЗначенияПолей;
			Сведения.ФактическийАдрес = СтрокаТаблицыКИ.Представление;
			
		ИначеЕсли СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации
			ИЛИ СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента
			ИЛИ СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресПодразделенияКомпании Тогда
			
			Сведения.ПочтовыйАдресXML = СтрокаТаблицыКИ.ЗначенияПолей;
			Сведения.ПочтовыйАдрес = СтрокаТаблицыКИ.Представление;
			
		ИначеЕсли СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации
			ИЛИ СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента
			ИЛИ СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПодразделенияКомпании Тогда
			
			Сведения.ТелефоныXML = СтрокаТаблицыКИ.ЗначенияПолей;
			Сведения.Телефоны = СтрокаТаблицыКИ.Представление;
			
		ИначеЕсли СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.EmailОрганизации
			ИЛИ СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента
			ИЛИ СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.EmailПодразделенияКомпании Тогда
			
			Сведения.ЭлектроннаяПочта = СтрокаТаблицыКИ.Представление;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОсновнойБанковскийСчет = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураДанных, "ОсновнойБанковскийСчет");
	Если ЗначениеЗаполнено(ОсновнойБанковскийСчет) Тогда
		ЗаполнитьРеквизитыБанковскогоСчета(ВладелецСчета, ОсновнойБанковскийСчет, Сведения);
	КонецЕсли;
	
КонецПроцедуры

// Устарела. Следует использовать МашиночитаемыеДоверенностиКЭДО.ПриИзмененииДанныеФизЛица.
// См. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДанныеФизЛица.
Процедура ПолучитьДанныеФизЛица(ФизЛицо, Сведения) Экспорт

	Если НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат
	КонецЕсли;
	
	Если ТипЗнч(Сведения) = Тип("Структура") И Сведения.Свойство("Ссылка") Тогда
		Сведения.Ссылка = ФизЛицо;
	КонецЕсли;
	
	СтруктураДанных = ТорговыйКомплексЭДО.ДанныеФизическогоЛица(Физлицо);
	
	Если СтруктураДанных = Неопределено Тогда
		Реквизиты = "ДатаРождения, ИНН, СтраховойНомерПФР, Фамилия, Имя, Отчество, Пол";
		
		СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФизЛицо, Реквизиты);
		Сведения.Гражданство = Справочники.СтраныМира.Россия;
	Иначе
		
		СтруктураДанных.Свойство("Гражданство",      Сведения.Гражданство);
		СтруктураДанных.Свойство("ДатаВыдачи",       Сведения.ДатаВыдачи);
		СтруктураДанных.Свойство("КемВыдан",         Сведения.КемВыдан);
		СтруктураДанных.Свойство("КодПодразделения", Сведения.КодПодразделения);
		//СтруктураДанных.Свойство("КодФНС",           Сведения.КодПодразделения);
		СтруктураДанных.Свойство("МестоРождения",    Сведения.МестоРождения);
		СтруктураДанных.Свойство("Номер",            Сведения.Номер);
		СтруктураДанных.Свойство("Серия",            Сведения.Серия);
		
	КонецЕсли;
	
	СтруктураДанных.Свойство("ДатаРождения",      Сведения.ДатаРождения);
	СтруктураДанных.Свойство("ИНН",               Сведения.ИНН);
	СтруктураДанных.Свойство("СтраховойНомерПФР", Сведения.СтраховойНомерПФР);
	СтруктураДанных.Свойство("Фамилия",           Сведения.Фамилия);
	СтруктураДанных.Свойство("Имя",               Сведения.Имя);
	СтруктураДанных.Свойство("Отчество",          Сведения.Отчество);
	СтруктураДанных.Свойство("Пол",               Сведения.Пол);
	
	ТаблицаКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ФизЛицо,,,Ложь);
	
	Для Каждого СтрокаТаблицыКИ Из ТаблицаКИ Цикл
		Если СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресСотрудника Тогда
			Сведения.Вставить("АдресМестаПроживанияXML", СтрокаТаблицыКИ.ЗначенияПолей);
			Сведения.Вставить("АдресМестаПроживания", СтрокаТаблицыКИ.Представление);
		ИначеЕсли СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресСотрудника Тогда
			Сведения.Вставить("АдресПоПропискеXML", СтрокаТаблицыКИ.ЗначенияПолей);
			Сведения.Вставить("АдресПоПрописке", СтрокаТаблицыКИ.Представление);
		ИначеЕсли СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника Тогда
			Сведения.Вставить("ТелефоныXML", СтрокаТаблицыКИ.ЗначенияПолей);
			Сведения.Вставить("Телефоны", СтрокаТаблицыКИ.Представление);
		ИначеЕсли СтрокаТаблицыКИ.Вид = Справочники.ВидыКонтактнойИнформации.EmailСотрудника Тогда
			Сведения.Вставить("ЭлектроннаяПочта", СтрокаТаблицыКИ.Представление);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьФизЛицоМЧД.
Функция ПолучитьФизЛицоМЧД(СведенияФизЛица) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФизическиеЛица.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.ИНН = &ИНН";

	Запрос.УстановитьПараметр("ИНН", СведенияФизЛица.ИНН);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

// Устарела. Следует использовать МашиночитаемыеДоверенностиКЭДО.ПриИзмененииДанныеФизЛица.
// См. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьДокументыФизЛица.
Функция ПолучитьДокументыФизЛица(ФизЛицо, Сведения) Экспорт
	
	МенеджерЗаписи = Неопределено;
	//МенеджерЗаписи = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
	//
	//// Ищем последнюю запись
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	РегистрСведений.Период,
	//|	РегистрСведений.Физлицо,
	//|	РегистрСведений.ВидДокумента
	//|ИЗ
	//|	РегистрСведений.ПодтверждающиеДокументы КАК РегистрСведений
	//|ГДЕ
	//|	РегистрСведений.Физлицо = &ВедущийОбъект
	//|	И РегистрСведений.ЯвляетсяДокументомУдостоверяющимЛичность
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	РегистрСведений.Период УБЫВ";
	//Запрос.УстановитьПараметр("ВедущийОбъект", ФизЛицо);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
	//	МенеджерЗаписи.Прочитать();
	//	
	//КонецЕсли;
	
	Возврат МенеджерЗаписи;

КонецФункции

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьТипыОрганизацииПредставителяМЧД.
Процедура ПолучитьТипыОрганизацииПредставителяМЧД(Типы) Экспорт

	Типы.Добавить(Тип("СправочникСсылка.Контрагенты"));
	Типы.Добавить(Тип("СправочникСсылка.Организации"));

КонецПроцедуры

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьОрганизациюМЧД.
Функция ПолучитьОрганизациюМЧД(СведенияЮрЛица) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Организация,
	|	NULL КАК Контрагент
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ИНН = &ИНН
	|	И Организации.КПП = &КПП
	|	И Организации.ОГРН = &ОГРН
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	NULL,
	|	Контрагенты.Ссылка КАК ССЫЛКА
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	|	И Контрагенты.КПП = &КПП
	|	И Контрагенты.ОГРН = &ОГРН";

	Запрос.УстановитьПараметр("ИНН", 	СведенияЮрЛица.ИНН);
	Запрос.УстановитьПараметр("КПП", 	СведенияЮрЛица.КПП);
	Запрос.УстановитьПараметр("ОГРН", 	СведенияЮрЛица.ОГРН);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Контрагент) Тогда
			Возврат Выборка.Контрагент;	
		Иначе
			Возврат Выборка.Организация;	
		КонецЕсли;	
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

// См. ЭлектронноеВзаимодействиеПереопределяемый.ЕстьПравоОткрытияЖурналаРегистрации.
Процедура ЕстьПравоОткрытияЖурналаРегистрации(Результат) Экспорт
	
	Результат = Пользователи.ЭтоПолноправныйПользователь(, , Ложь);
	
КонецПроцедуры

// См. ЭлектронноеВзаимодействиеПереопределяемый.ОписаниеОрганизации.
Процедура ОписаниеОрганизации(СведенияОрганизации, Результат, Список = "") Экспорт
	
	Результат = ТорговыйКомплексЭДО.ОписаниеОрганизации(СведенияОрганизации, Список);
	
КонецПроцедуры

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПередЗаписьюВладельцаЭлектронногоДокумента.
Процедура ПередЗаписьюВладельцаЭлектронногоДокумента(Объект, ИзменилисьКлючевыеРеквизиты, Знач СостояниеЭлектронногоДокумента, ПодлежитОбменуЭД, ТребуетсяКонтрольАктуальности, Отказ) Экспорт
	
	Если Объект.ДополнительныеСвойства.Свойство("ИзменилисьКлючевыеРеквизиты")
		И Объект.ДополнительныеСвойства.ИзменилисьКлючевыеРеквизиты Тогда
		ИзменилисьКлючевыеРеквизиты = Истина;
		Возврат;
	КонецЕсли;
	
	Если ИзмененыКлючевыеРеквизитыОбъекта(Объект) Тогда
		ИзменилисьКлючевыеРеквизиты = Истина;
	КонецЕсли;
	
	Объект.ДополнительныеСвойства.Вставить("ИзменилисьКлючевыеРеквизиты", ИзменилисьКлючевыеРеквизиты);
	
	ДокументПроведен = Неопределено;
	Если Объект.ДополнительныеСвойства.Свойство("ДокументПроведен", ДокументПроведен) Тогда
		Если Не ДокументПроведен 
			И (СостояниеЭлектронногоДокумента = Перечисления.СостоянияДокументовЭДО.НеСформирован
			ИЛИ Не ЗначениеЗаполнено(СостояниеЭлектронногоДокумента)) Тогда
			ПодлежитОбменуЭД = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Сравнивает значения ключевых реквизитов объекта с данными информационной базы.
//
// Параметры:
//  Объект - ДокументОбъект - владелец электронного документа.
//
// Возвращаемое значение:
//  Булево - Истина, если значения реквизитов различаются.
//
Функция ИзмененыКлючевыеРеквизитыОбъекта(Объект) Экспорт
	
	МетаданныеОбъекта = Объект.Метаданные();
	ИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
	
	КлючевыеРеквизиты = Новый Структура;
	
	Если ИмяОбъекта = "Документ.РеализацияТоваровУслуг" Тогда
		// Реквизиты объекта.
		СтрокаРеквизитовОбъекта = "Дата, Номер, Организация, Контрагент, ВалютаДокумента, ДоговорВзаиморасчетов,
			|Грузоотправитель, Грузополучатель, АдресДоставки,
			|ИдентификаторГосударственногоКонтракта";
		КлючевыеРеквизиты.Вставить("Шапка", СтрокаРеквизитовОбъекта);
		
		// Табличная часть "Товары".
		СтрокаРеквизитовОбъекта = "Номенклатура, Количество, Цена, Сумма, СуммаНДС, СуммаВсего, ИдентификаторСтроки";
		КлючевыеРеквизиты.Вставить("Товары", СтрокаРеквизитовОбъекта);
		
		// Табличная часть "КодыУпаковокМаркируемойПродукции".
		СтрокаРеквизитовОбъекта = "КодМарки, ИдентификаторСтроки";
		КлючевыеРеквизиты.Вставить("Марки", СтрокаРеквизитовОбъекта);
		
		//// Табличная часть "СведенияПрослеживаемости".
		//СтрокаРеквизитовОбъекта = "РНПТ, КоличествоУпаковок, КоличествоПрослеживаемости, ЕдиницаИзмеренияПрослеживаемости";
		//КлючевыеРеквизиты.Вставить("СведенияПрослеживаемости", СтрокаРеквизитовОбъекта);
		
	ИначеЕсли ИмяОбъекта = "Документ.СчетФактураВыданный" Тогда
		// Реквизиты объекта.
		СтрокаРеквизитовОбъекта = "Дата, Номер, НомерИсправления, Организация, Контрагент, ВалютаДокумента,
			|ДоговорВзаиморасчетов, ИдентификаторГосударственногоКонтракта, ДокументОснование";
		КлючевыеРеквизиты.Вставить("Шапка", СтрокаРеквизитовОбъекта);
		
		// Табличная часть "Товары".
		СтрокаРеквизитовОбъекта = "Номенклатура, Количество, Цена, Сумма, СуммаНДС, СуммаВсего";
		КлючевыеРеквизиты.Вставить("Товары", СтрокаРеквизитовОбъекта);
		
		//// Табличная часть "КодыУпаковокМаркируемойПродукции".
		//СтрокаРеквизитовОбъекта = "НомерУпаковки, ИдентификаторСтроки";
		//КлючевыеРеквизиты.Вставить("КодыУпаковокМаркируемойПродукции", СтрокаРеквизитовОбъекта);
		
		// Табличная часть "ПлатежноРасчетныеДокументы".
		СтрокаРеквизитовОбъекта = "Номер, Дата";
		КлючевыеРеквизиты.Вставить("ПлатежноРасчетныеДокументы", СтрокаРеквизитовОбъекта);
		
		//// Табличная часть "ДокументыОснования".
		//СтрокаРеквизитовОбъекта = "ДокументОснование";
		//КлючевыеРеквизиты.Вставить("ДокументыОснования", СтрокаРеквизитовОбъекта);
		
		//// Табличная часть "СведенияПрослеживаемости".
		//СтрокаРеквизитовОбъекта = "РНПТ, КоличествоУпаковок, КоличествоПрослеживаемости, ЕдиницаИзмеренияПрослеживаемости";
		//КлючевыеРеквизиты.Вставить("СведенияПрослеживаемости", СтрокаРеквизитовОбъекта);
		
	ИначеЕсли ИмяОбъекта = "Документ.ЗаказПокупателя" Тогда
		// Реквизиты объекта.
		СтрокаРеквизитовОбъекта = "Дата, Номер, Организация, Контрагент, ВалютаДокумента, ДоговорВзаиморасчетов,
			| ТипЦен";
		КлючевыеРеквизиты.Вставить("Шапка", СтрокаРеквизитовОбъекта);
		
		// Табличная часть "Товары".
		СтрокаРеквизитовОбъекта = "Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Количество, Цена, Сумма, СуммаНДС, СуммаВсего";
		КлючевыеРеквизиты.Вставить("Товары", СтрокаРеквизитовОбъекта);
		
	ИначеЕсли ИмяОбъекта = "Документ.ЗаказПоставщику" Тогда
		// Реквизиты объекта.
		СтрокаРеквизитовОбъекта = "Дата, Номер, Организация, Контрагент, ВалютаДокумента, ДоговорВзаиморасчетов";
		КлючевыеРеквизиты.Вставить("Шапка", СтрокаРеквизитовОбъекта);
		
		// Табличная часть "Товары".
		СтрокаРеквизитовОбъекта = "Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Количество, Цена, Сумма, СуммаНДС, СуммаВсего";
		КлючевыеРеквизиты.Вставить("Товары", СтрокаРеквизитовОбъекта);
	//ИначеЕсли ИмяОбъекта = "Документ.СчетНаОплату" Тогда
	//	// Реквизиты объекта.
	//	СтрокаРеквизитовОбъекта = "Дата, Номер, Организация, Контрагент, ВалютаДокумента, ДоговорВзаиморасчетов,
	//		|РасчетныйСчетОрганизации";
	//	КлючевыеРеквизиты.Вставить("Шапка", СтрокаРеквизитовОбъекта);
	//	
	//	// Табличная часть "Товары".
	//	СтрокаРеквизитовОбъекта = "Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Количество, Цена, Сумма, СуммаНДС, СуммаВсего";
	//	КлючевыеРеквизиты.Вставить("Товары", СтрокаРеквизитовОбъекта);
	//	
	//ИначеЕсли ИмяОбъекта = "Документ.СчетОтПоставщика" Тогда
	//	// Реквизиты объекта.
	//	СтрокаРеквизитовОбъекта = "Дата, Номер, Организация, Контрагент, ВалютаДокумента, ДоговорВзаиморасчетов,
	//		|РасчетныйСчетКонтрагента";
	//	КлючевыеРеквизиты.Вставить("Шапка", СтрокаРеквизитовОбъекта);
	//	
	//	// Табличная часть "Товары".
	//	СтрокаРеквизитовОбъекта = "Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Количество, Цена, Сумма, СуммаНДС, СуммаВсего";
	//	КлючевыеРеквизиты.Вставить("Товары", СтрокаРеквизитовОбъекта);
	//	
	ИначеЕсли ИмяОбъекта = "Документ.АктОРасхожденияхПоПоставке" Тогда
		// Реквизиты объекта.
		СтрокаРеквизитовОбъекта = "Дата, Номер, НомерИсправления, Организация, Контрагент, ДоговорВзаиморасчетов,
			|ИдентификаторГосударственногоКонтракта, Грузоотправитель, Грузополучатель, СтраховаяКомпания, 
			|УсловияХраненияТовараДоВскрытия, СостояниеТарыИУпаковки, 
			|ОбстоятельстваСоставления, ОбстоятельстваИспользования";
		КлючевыеРеквизиты.Вставить("Шапка", СтрокаРеквизитовОбъекта);
		
		// Табличная часть "Товары".
		СтрокаРеквизитовОбъекта = "Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения,
			|КоличествоПоДокументу, ЦенаПоДокументу,
			|СуммаПоДокументу, СтавкаНДС, СуммаНДСПоДокументу, СуммаВсегоПоДокументу,
			|КомментарийМенеджера, Количество, Сумма, СуммаНДС, СуммаВсего, Цена,
			|КоличествоБой, КоличествоБрак";
		КлючевыеРеквизиты.Вставить("Товары", СтрокаРеквизитовОбъекта);
		
		//// Табличная часть "СведенияОГрузе".
		//СтрокаРеквизитовОбъекта = "ЕдиницаИзмерения, ВидУпаковки, КоличествоУпаковок, ОтметкаОбОпломбировании, ОтметкиОтправителя,
		//	|МассаБруттоПоДокументу, МассаНеттоПоДокументу, МассаБрутто, МассаНетто";
		//КлючевыеРеквизиты.Вставить("СведенияОГрузе", СтрокаРеквизитовОбъекта);
		
		//// Табличная часть "СертификатыСоответствия".
		//СтрокаРеквизитовОбъекта = "Номер";
		//КлючевыеРеквизиты.Вставить("СертификатыСоответствия", СтрокаРеквизитовОбъекта);
		
		//// Табличная часть "ПрилагаемыеДокументы".
		//СтрокаРеквизитовОбъекта = "Наименование, Номер, Дата";
		//КлючевыеРеквизиты.Вставить("ПрилагаемыеДокументы", СтрокаРеквизитовОбъекта);
		
	КонецЕсли;
	
	Возврат ИзмененыРеквизитыОбъекта(Объект, КлючевыеРеквизиты);
	
КонецФункции

// Заполняет дополнительные свойства объекта для анализа в событиях подсистемы ЭлектронноеВзаимодействие.
// Вызывать только из события ПередЗаписью модуля объекта (не из подписок).
//
// Параметры:
//  Источник - ДокументОбъект, СправочникОбъект - записываемый объект.
//  Отказ - булево - признак отказа от записи.
//  РежимЗаписи - РежимЗаписиДокумента - текущий режим записи документа (для документов).
//              - Неопределено - если Источник не является документом.
//  РежимПроведения - РежимПроведенияДокумента  - текущий режим проведения (для документов).
//                  - Неопределено - если Источник не является документом.
//
Процедура ПередЗаписьюОснованияЭлектронногоДокумента(Источник, Отказ, РежимЗаписи = Неопределено, РежимПроведения = Неопределено) Экспорт
	
	МетаданныеОбъекта = Источник.Метаданные();
	
	Если ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта) Тогда
		
		Если МетаданныеОбъекта.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
			
			ДокументПроведен = (РежимЗаписи = РежимЗаписиДокумента.Проведение)
				ИЛИ (РежимЗаписи = РежимЗаписиДокумента.Запись И Источник.Проведен);
				
			Источник.ДополнительныеСвойства.Вставить("ДокументПроведен", ДокументПроведен);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Определяет соответствие функциональных опций библиотеки и прикладного решения,
// в случае различий в наименовании.
//
// Параметры:
//  СоответствиеФО - Соответствие - список функциональных опций.
//
Процедура ПолучитьСоответствиеФункциональныхОпций(СоответствиеФО) Экспорт
	
	// Электронные документы
	СоответствиеФО.Вставить("ИспользоватьОбменЭДМеждуОрганизациями",  "ИспользоватьОбменЭДМеждуОрганизациями");
	СоответствиеФО.Вставить("ИспользоватьОбменЭД",                    "ИспользоватьОбменЭД");
	СоответствиеФО.Вставить("ИспользоватьЭлектронныеПодписи", 		  "ИспользоватьЭлектронныеПодписи");
	СоответствиеФО.Вставить("ИспользоватьОбменСБанками",              "ИспользоватьОбменСБанками");
	СоответствиеФО.Вставить("ИспользоватьИнтеграциюСЯндексКассой",    "ИспользоватьИнтеграциюСЯндексКассой");
	// Конец электронные документы
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДоговорКонтрагентаПоРеквизитам(РеквизитыДоговора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДоговорыВзаиморасчетов.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|ГДЕ
	|	ДоговорыВзаиморасчетов.НомерДоговора = &НомерДоговора
	|	И ДоговорыВзаиморасчетов.ДатаНачала = &ДатаДоговора
	|	И ДоговорыВзаиморасчетов.Организация = &Организация
	|	И ДоговорыВзаиморасчетов.Владелец = &Владелец";
	Запрос.УстановитьПараметр("НомерДоговора", РеквизитыДоговора.НомерДоговора);
	Запрос.УстановитьПараметр("ДатаДоговора", РеквизитыДоговора.ДатаДоговора);
	Запрос.УстановитьПараметр("Организация", РеквизитыДоговора.Организация);
	Запрос.УстановитьПараметр("Владелец", РеквизитыДоговора.Владелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Договор;
	
КонецФункции

Функция НайтиСсылкуНаНоменклатуруПоИдентификаторуНоменклатурыПоставщика(Идентификатор)
	
	Результат = Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ИзмененыРеквизитыОбъекта(Знач Объект, Знач Реквизиты)
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	ТаблицаРеквизитов = ТаблицаРеквизитовОбъектов();
	
	ТекущийПорядок = -50;
	Для Каждого Реквизит Из Реквизиты Цикл
		
		СтрокаРеквизитов = ТаблицаРеквизитов.Добавить();
		СтрокаРеквизитов.Порядок  = ТекущийПорядок;
		СтрокаРеквизитов.ИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
		СтрокаРеквизитов.ИмяТабличнойЧасти = ?(Реквизит.Ключ = "Шапка", "", Реквизит.Ключ);
		СтрокаРеквизитов.РеквизитыОбъекта = Реквизит.Значение;
		СтрокаРеквизитов.СтруктураРеквизитовОбъекта = Новый Структура(Реквизит.Значение);
		ТекущийПорядок = ТекущийПорядок + 100;
		
	КонецЦикла;
	
	ТаблицаРеквизитов.Сортировать("Порядок Возр");
	
	Для Каждого СтрокаРеквизитов Из ТаблицаРеквизитов Цикл
		
		ЕстьИзмененияВерсийОбъектов = ОпределитьИзмененияВерсийОбъекта(Объект, СтрокаРеквизитов);
		
		Если ЕстьИзмененияВерсийОбъектов Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ТаблицаРеквизитовОбъектов()
	
	ТаблицаРеквизитов = Новый ТаблицаЗначений;
	
	Колонки = ТаблицаРеквизитов.Колонки;
	Колонки.Добавить("Порядок",                    Новый ОписаниеТипов("Число"));
	Колонки.Добавить("ИмяОбъекта",                 Новый ОписаниеТипов("Строка"));
	Колонки.Добавить("ИмяТабличнойЧасти",          Новый ОписаниеТипов("Строка"));
	Колонки.Добавить("РеквизитыОбъекта",           Новый ОписаниеТипов("Строка"));
	Колонки.Добавить("СтруктураРеквизитовОбъекта", Новый ОписаниеТипов("Структура"));
	
	ТаблицаРеквизитов.Индексы.Добавить("ИмяОбъекта");
	
	Возврат ТаблицаРеквизитов;
	
КонецФункции

Функция ОпределитьИзмененияВерсийОбъекта(Объект, СтрокаТаблицыРеквизитовРегистрации)
	
	Если ПустаяСтрока(СтрокаТаблицыРеквизитовРегистрации.ИмяТабличнойЧасти) Тогда
		
		ТаблицаРеквизитовРегистрацииВерсияОбъектаДоИзменения = РеквизитыРегистрацииШапкиДоИзменения(Объект,
			СтрокаТаблицыРеквизитовРегистрации);
		ТаблицаРеквизитовРегистрацииВерсияОбъектаПослеИзменения = РеквизитыРегистрацииШапкиПослеИзменения(
			Объект, СтрокаТаблицыРеквизитовРегистрации);
	Иначе
		
		ТаблицаРеквизитовРегистрацииВерсияОбъектаДоИзменения = РеквизитыРегистрацииТабличнойЧастиДоИзменения(
			Объект, СтрокаТаблицыРеквизитовРегистрации);
		ТаблицаРеквизитовРегистрацииВерсияОбъектаПослеИзменения = РеквизитыРегистрацииТабличнойЧастиПослеИзменения(
			Объект, СтрокаТаблицыРеквизитовРегистрации);
	КонецЕсли;
	
	Возврат НЕ ТаблицыРеквизитовОбъектовОдинаковые(ТаблицаРеквизитовРегистрацииВерсияОбъектаДоИзменения,
												   ТаблицаРеквизитовРегистрацииВерсияОбъектаПослеИзменения,
												   СтрокаТаблицыРеквизитовРегистрации.РеквизитыОбъекта);
	
КонецФункции

// Проверяет переданные таблицы реквизитов на совпадения.
//
// Параметры:
//  Таблица1 - ТаблицаЗначений - первая таблица проверки, реквизиты, которые надо проверить на совпадение.
//  Таблица2 - ТаблицаЗначений - вторая таблица проверки.
//  РеквизитыОбъекта - Строка - реквизиты, перечисленные через запятую.
//  ДопПараметры - Структура - структура дополнительных параметров, по которым надо проводить сравнение.
//
Функция ТаблицыРеквизитовОбъектовОдинаковые(Таблица1, Таблица2, РеквизитыОбъекта, ДопПараметры = Неопределено)
	
	ДобавитьИтераторТаблице(Таблица1, +1);
	ДобавитьИтераторТаблице(Таблица2, -1);
	
	ТаблицаРезультат = Таблица1.Скопировать();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Таблица2, ТаблицаРезультат);
	
	ТаблицаРезультат.Свернуть(РеквизитыОбъекта, "ИтераторТаблицыРеквизитовОбъекта");
	
	КоличествоОдинаковыхСтрок = ТаблицаРезультат.НайтиСтроки(Новый Структура("ИтераторТаблицыРеквизитовОбъекта", 0)).Количество();
	
	КоличествоСтрокТаблицы = ТаблицаРезультат.Количество();
	ПризнакСовпадения = КоличествоОдинаковыхСтрок = КоличествоСтрокТаблицы;
	
	Если НЕ ПризнакСовпадения И ЗначениеЗаполнено(ДопПараметры) Тогда
		Если ДопПараметры.Свойство("ИмяТабличнойЧасти") Тогда
			ИмяТабличнойЧасти = ДопПараметры.ИмяТабличнойЧасти;
		КонецЕсли;
		Если ДопПараметры.Свойство("СтрокаДереваСравнения") Тогда
			СтрокаДереваСравнения = ДопПараметры.СтрокаДереваСравнения;
		КонецЕсли;
		
		Если ИмяТабличнойЧасти = "Шапка" Тогда
			
			НовСтрокаДереваМесто = СтрокаДереваСравнения.Строки.Добавить();
			НовСтрокаДереваМесто.Место = НСтр("ru ='Реквизиты шапки'");
			Для Каждого ТекСтрокаТаб1 Из Таблица1 Цикл
				Для Каждого ТекКолонка Из Таблица1.Колонки Цикл
					ИмяКолонки = ТекКолонка.Имя;
					Если ИмяКолонки = "ИтераторТаблицыРеквизитовОбъекта" Тогда
						Продолжить;
					КонецЕсли;
					НайденнаяСтрокаТаб2 = Таблица2.Найти( - ТекСтрокаТаб1.ИтераторТаблицыРеквизитовОбъекта,
						"ИтераторТаблицыРеквизитовОбъекта");
					Если НЕ ЗначениеЗаполнено(НайденнаяСтрокаТаб2) 
						ИЛИ	НайденнаяСтрокаТаб2[ИмяКолонки] = ТекСтрокаТаб1[ИмяКолонки] Тогда
						Продолжить;
					КонецЕсли;
					НовСтрокаДереваРеквизита = НовСтрокаДереваМесто.Строки.Добавить();
					НовСтрокаДереваРеквизита.Реквизит  = ИмяКолонки;
					НовСтрокаДереваЗнч            = НовСтрокаДереваРеквизита.Строки.Добавить();
					НовСтрокаДереваЗнч.ЗначениеБД = ТекСтрокаТаб1[ИмяКолонки];
					НовСтрокаДереваЗнч.ЗначениеЭД = НайденнаяСтрокаТаб2[ИмяКолонки];
					
				КонецЦикла;
			КонецЦикла;
		Иначе
			НовСтрокаДереваМесто = СтрокаДереваСравнения.Строки.Добавить();
			НовСтрокаДереваМесто.Место = СтрШаблон(НСтр("ru ='Табличная часть <%1>'"), ИмяТабличнойЧасти);
			НовСтрокаДереваРеквизита = НовСтрокаДереваМесто.Строки.Добавить();
			НовСтрокаДереваРеквизита.Реквизит = "<Изменена>";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПризнакСовпадения;
	
КонецФункции

Процедура ДобавитьИтераторТаблице(Таблица, ЗначениеИтератора)
	
	Таблица.Колонки.Добавить("ИтераторТаблицыРеквизитовОбъекта");
	Таблица.ЗаполнитьЗначения(ЗначениеИтератора, "ИтераторТаблицыРеквизитовОбъекта");
	
КонецПроцедуры

Функция РеквизитыРегистрацииТабличнойЧастиПослеИзменения(Объект, СтрокаТаблицыРеквизитовРегистрации)
	
	ТаблицаРеквизитовРегистрации = Объект[СтрокаТаблицыРеквизитовРегистрации.ИмяТабличнойЧасти].Выгрузить(,
		СтрокаТаблицыРеквизитовРегистрации.РеквизитыОбъекта);
		
	Возврат ТаблицаРеквизитовРегистрации;
	
КонецФункции

Функция РеквизитыРегистрацииТабличнойЧастиДоИзменения(Объект, СтрокаТаблицыРеквизитовРегистрации)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ "+ СтрокаТаблицыРеквизитовРегистрации.РеквизитыОбъекта + " ИЗ "
	+ СтрокаТаблицыРеквизитовРегистрации.ИмяОбъекта + "." + СтрокаТаблицыРеквизитовРегистрации.ИмяТабличнойЧасти
	+ " КАК ТекущийОбъектИмяТабличнойЧасти
	|ГДЕ
	|	ТекущийОбъектИмяТабличнойЧасти.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

Функция РеквизитыРегистрацииШапкиПослеИзменения(Объект, СтрокаТаблицыРеквизитовРегистрации)
	
	ТаблицаРеквизитовРегистрации = Новый ТаблицаЗначений;
	
	СтруктураРеквизитовРегистрации = СтрокаТаблицыРеквизитовРегистрации.СтруктураРеквизитовОбъекта;
	Для Каждого РеквизитРегистрации Из СтруктураРеквизитовРегистрации Цикл
		ТаблицаРеквизитовРегистрации.Колонки.Добавить(РеквизитРегистрации.Ключ);
	КонецЦикла;
	
	СтрокаТаблицы = ТаблицаРеквизитовРегистрации.Добавить();
	Для Каждого РеквизитРегистрации Из СтруктураРеквизитовРегистрации Цикл
		
		СтрокаТаблицы[РеквизитРегистрации.Ключ] = Объект[РеквизитРегистрации.Ключ];
	КонецЦикла;
	
	Возврат ТаблицаРеквизитовРегистрации;
	
КонецФункции

Функция РеквизитыРегистрацииШапкиДоИзменения(Объект, СтрокаТаблицыРеквизитовРегистрации)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ " + СтрокаТаблицыРеквизитовРегистрации.РеквизитыОбъекта + " ИЗ "
	+ СтрокаТаблицыРеквизитовРегистрации.ИмяОбъекта + " КАК ТекущийОбъект
	|ГДЕ
	|	ТекущийОбъект.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

Процедура ЗаполнитьРеквизитыБанковскогоСчета(Владелец, БанковскийСчет, Реквизиты)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Ссылка",   БанковскийСчет);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БанковскиеСчета.НомерСчета КАК НомерСчета,
	|	ЕСТЬNULL(БанковскиеСчета.БанкДляРасчетов.Наименование, ЕСТЬNULL(БанковскиеСчета.Банк.Наименование, """")) КАК Банк,
	|	ЕСТЬNULL(БанковскиеСчета.БанкДляРасчетов.Код, ЕСТЬNULL(БанковскиеСчета.Банк.Код, """")) КАК БИК,
	|	ЕСТЬNULL(БанковскиеСчета.БанкДляРасчетов.КоррСчет, ЕСТЬNULL(БанковскиеСчета.Банк.КоррСчет, """")) КАК КоррСчет,
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.Ссылка = &Ссылка ТОГДА
	|			0
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Владелец
	|	И НЕ БанковскиеСчета.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА БанковскиеСчета.Ссылка = &Ссылка ТОГДА
	|			0
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ";
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти