
&НаКлиенте
Процедура Подключение(Команда)
	ПодключениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодключениеНаСервере()
	ДЛ = Новый COMОбъект("DataLinks");
	КН = Новый COMОбъект("ADODB.Connection");
	КН.ConnectionString = Константы.АдресВнешнейБазыСИсториейОбъектов.Получить();
	
	// настроим строку подключения  
	ДЛ.PromptEdit(КН);
	АдресХранилищаВнешнейБД = КН.ConnectionString;
	Константы.АдресВнешнейБазыСИсториейОбъектов.Установить(АдресХранилищаВнешнейБД);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресХранилищаВнешнейБД = Константы.АдресВнешнейБазыСИсториейОбъектов.Получить();
	ХранитьИсториюВоВнешнейБД = Константы.ХранитьИсториюВоВнешнейБД.Получить();
	КоличествоЗагружаемыхОбъектов = Константы.КоличествоЗагружаемыхОбъектовВоВнешнююБД.Получить()
	
КонецПроцедуры

&НаКлиенте
Процедура АдресХранилищаВнешнейБДПриИзменении(Элемент)
	УстановитьАдресХранилищаНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьАдресХранилищаНаСервере()
	Константы.АдресВнешнейБазыСИсториейОбъектов.Установить(АдресХранилищаВнешнейБД);
КонецПроцедуры

&НаКлиенте
Процедура ХранитьИсториюВоВнешнейБДПриИзменении(Элемент)
	ХранитьИсториюВоВнешнейБДПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ХранитьИсториюВоВнешнейБДПриИзмененииНаСервере()
	Константы.ХранитьИсториюВоВнешнейБД.Установить(ХранитьИсториюВоВнешнейБД);
КонецПроцедуры


&НаКлиенте
Процедура КоличествоЕдиновременноЗагружаемыхЗаписейПриИзменении(Элемент)
	КоличествоЕдиновременноЗагружаемыхЗаписейПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура КоличествоЕдиновременноЗагружаемыхЗаписейПриИзмененииНаСервере()
	Константы.КоличествоЗагружаемыхОбъектовВоВнешнююБД.Установить(КоличествоЗагружаемыхОбъектов);
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеВыгрузкиВерсий(Команда)
	// Создадим диалог расписания
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(ПолучитьРасписание());
	ДополнительныеПараметры = Новый Структура("Диалог", Диалог);
	// Откроем диалог
	Диалог.Показать(Новый ОписаниеОповещения("ПоказатьОповещениеОЗакрытии", ЭтотОбъект, ДополнительныеПараметры));
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОповещениеОЗакрытии(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Расписание = ДополнительныеПараметры.Диалог.Расписание;
		УстановитьРасписание(Расписание);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьРасписание()
	Возврат РегламентныеЗадания.НайтиПредопределенное("ВыгрузкаВерсийОбъектов").Расписание;
КонецФункции

&НаСервере
Процедура УстановитьРасписание(Расписание)
	РегламентныеЗадания.НайтиПредопределенное("ВыгрузкаВерсийОбъектов").Расписание = Расписание;
КонецПроцедуры







