Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("Статус");	
	Поля.Добавить("ЛинейныйМенеджер");
	Поля.Добавить("ПериодПлана");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("План продаж линейного менеджера %1 № %2 от %3 на месяц: %4 (%5)",
					Данные.ЛинейныйМенеджер,
					Данные.Номер,
	                Формат(Данные.Дата, "ДЛФ=D"),
					Формат(Данные.ПериодПлана, "ДФ='ММММ гггг ''г.'''"),
					НРег(Данные.Статус));
	
КонецПроцедуры

