// Общий модуль "Присоединенные файлы платформа (клиент)"

#Область ПрограммныйИнтерфейс

// Обработчик события возникающего на клиенте при выполнении команды "Добавить изображение".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
Процедура ДобавитьИзображение(Форма, Объект, Команда) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыЗаписиНового = ЗащищенныеФункцииКлиент.СоздатьПараметрыЗаписиНовогоОбъектаНаКлиенте();
		ПараметрыЗаписиНового.ОбновитьИзмененный = Истина;
		ПараметрыЗаписиНового.РезультатСобытия   = Команда;
		
		// Общие команды списка и объекта могут быть обработаны только в случае существования ссылки в базе на объект.
		Если ЗащищенныеФункцииКлиент.ЗаписатьНовыйОбъектНаКлиенте(Форма, ПараметрыЗаписиНового) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("ВладелецФайла", Объект.Ссылка);
	Параметры.Вставить("ИдентификаторФормы", Форма.УникальныйИдентификатор);
	Параметры.Вставить("Фильтр", "");
	Параметры.Вставить("ТипОперации", "ДобавлениеКартинки");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьФайлыРасширениеПредложено", ПрисоединенныеФайлыСлужебныйКлиент, Параметры);
	ФайловыеФункцииСлужебныйКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при выполнении команды "Просмотреть изображение".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
Процедура ПросмотретьИзображение(Форма, Объект = Неопределено) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	Если ЗначениеЗаполнено(Объект.ФайлКартинки) ИЛИ ЗначениеЗаполнено(Форма.ТекущаяКартинка) Тогда
		
		КартинкаДляПросмотра = Объект.ФайлКартинки;
		
		Если (ЗначениеЗаполнено(КартинкаДляПросмотра) И ЗначениеЗаполнено(Форма.ТекущаяКартинка)
			И НЕ Форма.ТекущаяКартинка = КартинкаДляПросмотра) ИЛИ НЕ ЗначениеЗаполнено(КартинкаДляПросмотра) Тогда
			КартинкаДляПросмотра = Форма.ТекущаяКартинка;
		КонецЕсли;
		
		ПрисоединенныеФайлыКлиент.ОткрытьФайл(
			ПрисоединенныеФайлыСлужебныйВызовСервера.ПолучитьДанныеФайла(
				КартинкаДляПросмотра,
				Форма.УникальныйИдентификатор));
	Иначе
		ВывестиСообщение(НСтр("ru='Отсутствует изображение для просмотра'"), ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при нажатии реквизита "АдресКартинки".
//
Процедура АдресКартинкиНажатие(Форма, Объект = Неопределено, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	Если НЕ ЗначениеЗаполнено(Объект.ФайлКартинки) И НЕ ЗначениеЗаполнено(Форма.ТекущаяКартинка) Тогда
		ДобавитьИзображение(Форма, Объект, Форма.Команды.Найти("ДобавитьИзображение"));
	Иначе
		ПросмотретьИзображение(Форма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
