
// Обработчик события нажатия кнопки "Наличие на складах".
//
// Параметры:
//  ПараметрКоманды - Произвольный - В параметр передается значение от источника, в котором реализована команда
//  ПараметрыВыполненияКоманды - ПараметрыВыполненияКоманды - В обработчике команды можно изменить значение свойств
//                                                            параметра Окно и Уникальность.
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено ИЛИ ПараметрКоманды.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтчета  = ПолучитьПараметрыОтчета(ПараметрКоманды);
	
	// фильтры
	ОтчетОтбор = Новый Структура;
	ОтчетОтбор.Вставить("Контрагент", ПараметрыОтчета.Контрагент);
	ОтчетОтбор.Вставить("Заказ", ПараметрКоманды);
	
	ОтчетыПлатформаКлиент.ОткрытьОтчет(
		"Отчет.СостояниеЗаказовПокупателей",
		"ДляЗаказа",,,,
		ОтчетОтбор,
		НачалоМесяца(ПараметрыОтчета.Дата),
		Дата(1,1,1));
	
КонецПроцедуры

// Функция получения параметров отчета
//
&НаСервере
Функция ПолучитьПараметрыОтчета(Документ)
	
	ИмяРеквизитаКонтрагент = ?(ЕстьРеквизит(Документ, "Контрагент"), "Контрагент", "ПодразделениеПолучатель");
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Дата", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Дата"));
	ПараметрыОтчета.Вставить("Контрагент", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, ИмяРеквизитаКонтрагент));
	
	Возврат ПараметрыОтчета;
	
КонецФункции // ПолучитьПараметрыОтчета()

