// Модуль набора записей регистра "Состояния кодов маркировки."

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ДокументОбъект Экспорт; // документ, выполняющий изменение состояния
Перем Организация Экспорт; // СправочникСсылка.Организации
Перем Состояние Экспорт; // Перечисления.СостоянияКодовМаркировки
Перем РезультатЗапросаПоКодамМаркировки Экспорт; // Список кодов маркировки к изменению статуса

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// Преобразуем код маркировки
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(Запись.КодМаркировки,, Ложь);
	КонецЦикла;
	
	Если НЕ ОбработкаСобытийРегистраСервер.ПередЗаписью(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбработкаСобытийРегистраСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		 Возврат;
	КонецЕсли;	
	
	тбСостоянияКодов = ЭтотОбъект.Выгрузить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СостоянияКодовМаркировки.КодМаркировки КАК КодМаркировки,
	                      |	СостоянияКодовМаркировки.GTIN КАК GTIN,
	                      |	СостоянияКодовМаркировки.СерийныйНомер КАК СерийныйНомер,
	                      |	ВЫРАЗИТЬ(СостоянияКодовМаркировки.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	СостоянияКодовМаркировки.ДатаПроверки КАК ДатаПроверки,
	                      |	СостоянияКодовМаркировки.ДатаОкончанияСрокаГодности КАК ДатаОкончанияСрокаГодности,
	                      |	СостоянияКодовМаркировки.Состояние КАК Состояние
	                      |ПОМЕСТИТЬ вткодыМаркировки
	                      |ИЗ
	                      |	&втСостоянияКодов КАК СостоянияКодовМаркировки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СостоянияКодовМаркировки.GTIN КАК GTIN,
	                      |	СостоянияКодовМаркировки.СерийныйНомер КАК КодМарки,
	                      |	СостоянияКодовМаркировки.ДатаОкончанияСрокаГодности КАК ДатаИстеченияСрокаГодности,
	                      |	СостоянияКодовМаркировки.Номенклатура КАК Номенклатура
	                      |ИЗ
	                      |	вткодыМаркировки КАК СостоянияКодовМаркировки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МаркиВОборудовании КАК МаркиВОборудовании
	                      |		ПО СостоянияКодовМаркировки.GTIN = МаркиВОборудовании.GTIN
	                      |			И СостоянияКодовМаркировки.СерийныйНомер = МаркиВОборудовании.КодМарки
	                      |ГДЕ
	                      |	СостоянияКодовМаркировки.Номенклатура.ОсобенностьУчета.итРегистрироватьСостоянияКодовМаркировкиПриПриемке
	                      |	И СостоянияКодовМаркировки.Номенклатура.ОсобенностьУчета.Маркируется
	                      |	И НЕ СостоянияКодовМаркировки.ДатаПроверки = ДАТАВРЕМЯ(1, 1, 1)
	                      |	И НЕ СостоянияКодовМаркировки.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияКодовМаркировки.Неопределен)
	                      |	И МаркиВОборудовании.GTIN ЕСТЬ NULL");
	
	Запрос.УстановитьПараметр("втСостоянияКодов",тбСостоянияКодов);
	ЗапросВыборка = Запрос.Выполнить().Выбрать();
	
	Пока ЗапросВыборка.Следующий() Цикл
		
		рсМаркиВОборудовании = РегистрыСведений.МаркиВОборудовании.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(рсМаркиВОборудовании,ЗапросВыборка);
		рсМаркиВОборудовании.МоментИзменения = ТекущаяДата();
		рсМаркиВОборудовании.Записать();
		
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

ДокументОбъект          = Неопределено;
РезультатЗапросаПоКодамМаркировки = Неопределено;

#КонецОбласти

#КонецЕсли
