
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьКоманд();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКоманд()
	итКонтрольПоставкиПослеПриемкиНаТСД   = ПравоПользователя("итКонтрольПоставкиПослеПриемкиНаТСД");
	
	Если ТипЗнч(Запись.СсылкаНаОбъект) = Тип("ДокументСсылка.ПоступлениеТоваров") И Запись.Состояния = Перечисления.итСостоянияЭДО.ЕстьОшибки И Не Запись.УведомлениеОбУточнении И итКонтрольПоставкиПослеПриемкиНаТСД Тогда
		
		Элементы.ФормаОшибкиИсправлены.Доступность = Истина;
		Элементы.ФормаОтправитьУведомлениеОбУточнении.Доступность = Истина;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиИсправлены(Команда)
	Запись.Состояния = ПредопределенноеЗначение("Перечисление.итСостоянияЭДО.ПолученУПД");
	Записать();
	УстановитьДоступностьКоманд();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьУведомлениеОбУточнении(Команда)
	ОткрытьФорму("РегистрСведений.итСостоянияДокументовЭДО_LeraData.Форма.ФормаУточнения", Новый Структура("Описание", Запись.Описание));
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗаполненТекстУточнения" Тогда
		Запись.УведомлениеОбУточнении = Истина;
		Запись.ТекстУведомления       = Параметр;
		Запись.Состояния = ПредопределенноеЗначение("Перечисление.итСостоянияЭДО.ПолученУПД");
		Записать();
		УстановитьДоступностьКоманд();
	КонецЕсли;	
КонецПроцедуры
