// Модуль документа Возврат в оборот кодов маркировки

// Модуль документа Списание кодов маркировки

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовПлатформа.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыДокументовМаркировки.Новый;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОсобенностьУчета) Тогда
		ОсобенностьУчета = МаркировкаТоваровСервер.ОсобенностьУчетаНоменклатуры(Товары.ВыгрузитьКолонку("Номенклатура"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	Статус = Перечисления.СтатусыДокументовМаркировки.Новый;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		
		Если ТекущаяСтрока.ВидПервичногоДокумента = Перечисления.ВидыПервичныхДокументов.Прочее
			И НЕ ЗначениеЗаполнено(ТекущаяСтрока.НаименованиеПервичногоДокумента) Тогда
			
			ВывестиСообщение(
				НСтр("ru = 'Товары. Строка %1: Необходимо заполнить наименование первичного документа.'"),
				ЭтотОбъект,
				"Товары[#].НаименованиеПервичногоДокумента",
				ТекущаяСтрока.НомерСтроки,
				Отказ,
				ТекущаяСтрока.НомерСтроки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	МаркировкаТоваровСервер.НоменклатураСоответствуетОсобенностиУчета(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Переведем вид кода маркировки
	Для Каждого ТекущаяСтрока Из Товары Цикл
		
		ТекущаяСтрока.КодМаркировки = 
			МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(
				ТекущаяСтрока.КодМаркировки,,
				СтрНачинаетсяС(ТекущаяСтрока.КодМаркировки, "("));
		
	КонецЦикла;
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	//Если НЕ Отказ Тогда
	//	РегистрыСведений.ЖурналСостояний.ЗаписьВЖурналСостояний(Ссылка, Статус);
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЗаполненияОбъекта

Функция ОбработкаЗаполнения_Чек(ДанныеЗаполнения,
	ТекстЗаполнения,
	СтандартнаяОбработка = Истина) Экспорт
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка,
		"Товары"
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Хозоперация <> Справочники.ХозОперации.ЧекНаВозврат Тогда
		ТекстСообщения = НСтр("ru = 'Возврат в оборот доступен только при вводе на основании чека возврата.'");
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ДанныеЗаполнения, ТекстСообщения);
	КонецЕсли;
	
	ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриРозничнойРеализации;
	
	ЗаполнитьТабличнуюЧастьТоваровПоОснованию(
		ДанныеЗаполнения,
		Перечисления.ВидыПервичныхДокументов.КассовыйЧек,
		НСтр("ru = 'Чек на возврат'"));
	
	Возврат Истина;
	
КонецФункции

Функция ОбработкаЗаполнения_ВозвратОтПокупателя(ДанныеЗаполнения,
	ТекстЗаполнения,
	СтандартнаяОбработка = Истина) Экспорт
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка,
		"Товары"
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат Истина;
	КонецЕсли;
	
	ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриРозничнойРеализации;
	
	ЗаполнитьТабличнуюЧастьТоваровПоОснованию(
		ДанныеЗаполнения,
		Перечисления.ВидыПервичныхДокументов.Прочее,
		НСтр("ru = 'Возврат от покупателя'"));
	
	Возврат Истина;
	
КонецФункции

Функция ОбработкаЗаполнения_КорректировкаРеализации(ДанныеЗаполнения,
	ТекстЗаполнения,
	СтандартнаяОбработка = Истина) Экспорт
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка,
		"Товары"
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат Истина;
	КонецЕсли;
	
	ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриРозничнойРеализации;
	
	Товары.Очистить();
	
	ВидПервичногоДокумента = Перечисления.ВидыПервичныхДокументов.Прочее;
	НомерПервичногоДокумента = ДанныеЗаполнения.Номер;
	ДатаПервичногоДокумента = ДанныеЗаполнения.Дата;
	НаименованиеПервичногоДокумента = НСтр("ru = 'Корректировка реализации'");
	
	// Заполним ТЧ Товары только теми товарами, которые на уменьшение и не указаны коды
	СтруктураПоиска = Новый Структура("ИдентификаторТовара");
	СтруктураПоиска.Вставить("Возврат", Истина);
	Для Каждого ТекущаяСтрока Из ДанныеЗаполнения.Товары Цикл
		
		// Проверим, что количество возвратов совпадает с количеством разницы
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
		НайденныеСтроки = ДанныеЗаполнения.КодыМаркировки.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого ТекущаяСтрокаМаркировки Из НайденныеСтроки Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.КодМаркировки = ТекущаяСтрокаМаркировки.КодМаркировки;
			НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
			Документы.ВозвратВОборотКодовМаркировки.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока);
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
			
			НоваяСтрока.ВидПервичногоДокумента = ВидПервичногоДокумента;
			НоваяСтрока.НомерПервичногоДокумента = НомерПервичногоДокумента;
			НоваяСтрока.ДатаПервичногоДокумента = ДатаПервичногоДокумента;
			НоваяСтрока.НаименованиеПервичногоДокумента = НаименованиеПервичногоДокумента;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТабличнуюЧастьТоваровПоОснованию(Основание, ВидОснования, НаименованиеДокумента)
	
	Товары.Очистить();
	
	ВидПервичногоДокумента = ВидОснования;
	НомерПервичногоДокумента = Основание.Номер;
	ДатаПервичногоДокумента = Основание.Дата;
	НаименованиеПервичногоДокумента = НаименованиеДокумента;
	
	СтруктураПоиска = Новый Структура("ИдентификаторТовара");
	
	// Найдем ноенклатуру, у которой не отсканировали код
	Для Каждого ТекущаяСтрока Из Основание.Товары Цикл
		
		//Если НЕ ТекущаяСтрока.Номенклатура.ТипНоменклатуры.ВедетсяМаркировка Тогда
		//	Продолжить;
		//КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
		
		НайденныеСтроки = Основание.КодыМаркировки.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого ТекущаяМаркировка Из НайденныеСтроки Цикл
			
			НоваяСтрока = Товары.Добавить();
			
			НоваяСтрока.КодМаркировки = ТекущаяМаркировка.КодМаркировки;
			НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
			Документы.ВозвратВОборотКодовМаркировки.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока);
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
			
			НоваяСтрока.ВидПервичногоДокумента = ВидПервичногоДокумента;
			НоваяСтрока.НомерПервичногоДокумента = НомерПервичногоДокумента;
			НоваяСтрока.ДатаПервичногоДокумента = ДатаПервичногоДокумента;
			НоваяСтрока.НаименованиеПервичногоДокумента = НаименованиеПервичногоДокумента;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
