#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		ТаймаутЗапускаКлиента = 60;
		ТаймаутОпросаКлиента = 60;
		ТаймаутЗагрузкиСценарияКлиентом = 60;
		ТаймаутПодготовки = 180;
		ТаймаутИнициализации = 300;
		ТаймаутВыполнения = 900;
		ТаймаутЗаписиРезультатов = 300;
		ТаймаутУдаленияДанных = 300;
		
		МаксимальноеКоличествоИтераций = 5;
		ЦелевойAPDEX = 0.85;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли