Функция ЛращнРШГпрмЛМщоМ(Ключ) 
	Попытка
		WshShell = Новый COMОбъект("WScript.Shell");
		WshSysEnv = WshShell.Environment("PROCESS");
		Возврат WshSysEnv.Item(Ключ);
	Исключение
		Возврат "";
	КонецПопытки;
КонецФункции 
            
Функция ЛОлропоррпгнацву()
	Попытка
		Попытка
			олилорм6ПНМЕена = Новый СистемнаяИнформация;
			Возврат ЛращнРШГпрмЛМщоМ("COMPUTERNAME")+":"+ЛращнРШГпрмЛМщоМ("USERNAME")+":"+ЛращнРШГпрмЛМщоМ("SESSIONNAME")+":"+ЛращнРШГпрмЛМщоМ("CLIENTNAME")+":"+олилорм6ПНМЕена.ИдентификаторКлиента;
		Исключение
			олилорм6ПНМЕена = Новый СистемнаяИнформация;
			Возврат олилорм6ПНМЕена.ИдентификаторКлиента
		КонецПопытки;
	Исключение
		Возврат "UNDEF";
	КонецПопытки;
КонецФункции

Функция РириРмщрщЩ(С)
	ХЗ = "";
	Для Ш=0 По 127 Цикл
		ХЗ = ХЗ + Строка(С[Ш])+",";
	КонецЦикла;
	Возврат ХЗ;	
КонецФункции

Функция ИнформацияОКлиенте(Ключ) Экспорт
	С = ЛОлропоррпгнацву();
	отжПРМпмГП = Новый Массив(8);
	Для Ш = 0 По 7 Цикл
		отжПРМпмГП[Ш] = 0;
	КонецЦикла;
	К = 0;
	Цр = 0;
	Для Ш = 1 По СтрДлина(Ключ) Цикл
		Если К>7 Тогда
			К = 0;
		КонецЕсли;	
  	    Ч = КодСимвола(Сред(Ключ, Ш, 1));
  	  	Цр = Цр + Ч;
		отжПРМпмГП[К] = отжПРМпмГП[К]+Ч;
		К = К+1;
	КонецЦикла;
	Цр = Цр % СтрДлина(Ключ);
	Для Ш = 0 По 7 Цикл
		отжПРМпмГП[Ш] = отжПРМпмГП[Ш]+Цр;
	КонецЦикла;
	отжПРМпмГП[0] = отжПРМпмГП[0] + 23;
	отжПРМпмГП[1] = отжПРМпмГП[1] + 4;
	отжПРМпмГП[2] = отжПРМпмГП[2] + 3;
	отжПРМпмГП[3] = отжПРМпмГП[3] + 17;
	отжПРМпмГП[4] = отжПРМпмГП[4] + 32;
	отжПРМпмГП[5] = отжПРМпмГП[5] + 2;
	отжПРМпмГП[6] = отжПРМпмГП[6] + 7;
	отжПРМпмГП[7] = отжПРМпмГП[7] + 12;
	тиРИромМщгп = Новый Массив(128);
	Для Ш = 0 По 127 Цикл
		тиРИромМщгп[Ш] = 40+Ш;
	КонецЦикла;
	тиРИромМщгп[0] = 123;
	тиРИромМщгп[1] = СтрДлина(С);
    Для Ш=1 По СтрДлина(С) Цикл
  	    Ч = КодСимвола(Сред(С, Ш, 1));
   	    тиРИромМщгп[Ш+1] = Ч;
	КонецЦикла; 
	К = 0;
	Для Ш = 0 По 127 Цикл
		Если К>7 Тогда
			К = 0;
		КонецЕсли;	
   	    тиРИромМщгп[Ш] = тиРИромМщгп[Ш]*отжПРМпмГП[К];
   	 	К = К + 1;
	КонецЦикла;
	Возврат РириРмщрщЩ(тиРИромМщгп);
КонецФункции	

Функция ВыполнитьПривязкуКлиента(КлючПродукта, ОписаниеОшибки) Экспорт
	
	ОписаниеОшибки = "";
	КодОшибки = 0;
	
	КлиентскаяСсылка = ЛицензированиеСервер.ПолучитьКлючКлиентскойСсылки(КлючПродукта, ОписаниеОшибки);
	Если КлиентскаяСсылка=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Ссылка = ИнформацияОКлиенте(КлиентскаяСсылка);
	Если ЛицензированиеСервер.УстановитьКлиентскуюСсылку(КлючПродукта, Ссылка, ОписаниеОшибки) Тогда
		Возврат Истина;	
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
