#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда 
		Возврат;
	КонецЕсли;
	Если Параметры.Свойство("ПараметрыОткрытияФормыОтчета", ПараметрыОткрытияФормыОтчета) Тогда
		Возврат;
	КонецЕсли;
	
	// +РАРУС
	//Доступен = ?(Объект.ТолькоДляАвтора, "1", "2");
	// -РАРУС
	
	// +РАРУС
	СписокВыбора = Элементы.ВидПериода.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.Добавить("Произвольный",    "Произвольный");
	СписокВыбора.Добавить("День",    "День");
	СписокВыбора.Добавить("Неделя",  "Неделя");
	СписокВыбора.Добавить("Месяц",   "Месяц");
	СписокВыбора.Добавить("Квартал", "Квартал");
	СписокВыбора.Добавить("Год",     "Год");
	
	Произвольный = (Объект.ВидПериода = "Произвольный");
	Элементы.НачалоПериода.Доступность =  Произвольный;
	Элементы.КонецПериода.Доступность =  Произвольный;
	// -РАРУС
	
	// Чтение свойств предопределенного;
	// Заполнение реквизитов, связанных с предопределенным объектом при открытии.
	ПрочитатьСвойстваПредопределенного(Истина);
	
	ПолныеПраваНаВарианты = ВариантыОтчетов.ПолныеПраваНаВарианты();
	// +РАРУС
	ПравоНаЭтотВариант = ПолныеПраваНаВарианты Или Объект.ОбъектДоступа = Пользователи.АвторизованныйПользователь();
	// -РАРУС
	Если Не ПравоНаЭтотВариант Тогда
		ТолькоПросмотр = Истина;
		Элементы.ДеревоПодсистем.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Объект.ПометкаУдаления Тогда
		Элементы.ДеревоПодсистем.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	// +РАРУС
	Если Объект.Пользовательский Тогда
		Элементы.ТипДоступа.ТолькоПросмотр    = Не ПолныеПраваНаВарианты;
		Элементы.ОбъектДоступа.Доступность    = ПолныеПраваНаВарианты;
		Элементы.ОбъектДоступа.АвтоОтметкаНезаполненного = ПолныеПраваНаВарианты;
	Иначе
		Элементы.Наименование.ТолькоПросмотр = Истина;
		Элементы.ОбъектДоступа.Доступность    = Ложь;
		Элементы.ОбъектДоступа.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;
	Если Объект.ВидПериода = "Произвольный" Тогда
		НачалоПериода = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала[Объект.НачалоПериода]);
		КонецПериода  = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала[Объект.КонецПериода]);
	КонецЕсли;
	// -РАРУС
	
	ЭтоВнешний = (Объект.ТипОтчета = Перечисления.ТипыОтчетов.Внешний);
	Если ЭтоВнешний Тогда
		Элементы.ДеревоПодсистем.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	// +РАРУС
	//Элементы.Доступен.ТолькоПросмотр = Не ПолныеПраваНаВарианты;
	//Элементы.Автор.ТолькоПросмотр = Не ПолныеПраваНаВарианты;
	// -РАРУС
	Элементы.ВидимостьПоУмолчанию.ТолькоПросмотр = Не ПолныеПраваНаВарианты;
	Элементы.ТехническаяИнформация.Видимость = ПолныеПраваНаВарианты;
	
	// Заполнение имени отчета для команды "Просмотр".
	Если Объект.ТипОтчета = Перечисления.ТипыОтчетов.Внутренний
		Или Объект.ТипОтчета = Перечисления.ТипыОтчетов.Расширение Тогда
		ИмяОтчета = Объект.Отчет.Имя;
	ИначеЕсли Объект.ТипОтчета = Перечисления.ТипыОтчетов.Дополнительный Тогда
		ИмяОтчета = Объект.Отчет.ИмяОбъекта;
	Иначе
		ИмяОтчета = Объект.Отчет;
	КонецЕсли;
	
	ПерезаполнитьДерево(Ложь);
	
	ВариантыОтчетов.ДеревоПодсистемДобавитьУсловноеОформление(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПараметрыОткрытияФормыОтчета <> Неопределено Тогда
		Отказ = Истина;
		ВариантыОтчетовКлиент.ОткрытьФормуОтчета(Неопределено, ПараметрыОткрытияФормыОтчета);
	КонецЕсли;
	
	// +РАРУС
	НастроитьОбъектДоступа();
	// -РАРУС
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// +РАРУС
	Если ИмяСобытия = ВариантыОтчетовКлиентСервер.ИмяСобытияИзменениеВарианта() ИЛИ ИмяСобытия = "Запись_НаборКонстант" Тогда
		Если Источник <> ЭтотОбъект Тогда
			ПерезаполнитьДерево(Истина);
		КонецЕсли;
	// +РАРУС
		Элементы.ДеревоПодсистем.Развернуть(ДеревоПодсистем.ПолучитьЭлементы()[0].ПолучитьИдентификатор(), Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Запись свойств, связанных с предопределенным вариантом отчета.
	Если ТипЗнч(СвойстваПредопределенного) = Тип("ФиксированнаяСтруктура") Тогда
		ТекущийОбъект.ВидимостьПоУмолчаниюПереопределена = 
			Объект.ВидимостьПоУмолчанию <> СвойстваПредопределенного.ВидимостьПоУмолчанию;
		
		Если Не ПустаяСтрока(Объект.Описание) И НРег(СокрЛП(Объект.Описание)) = НРег(СокрЛП(СвойстваПредопределенного.Описание)) Тогда
			ТекущийОбъект.Описание = "";
		КонецЕсли;
	КонецЕсли;
	
	// Запись дерева подсистем.
	ВариантыОтчетов.ДеревоПодсистемЗаписать(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПерезаполнитьДерево(Ложь);
	ПрочитатьСвойстваПредопределенного(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПараметрОповещения = Новый Структура("Ссылка, Наименование, Автор, Описание");
	ЗаполнитьЗначенияСвойств(ПараметрОповещения, Объект);
	Оповестить(ВариантыОтчетовКлиентСервер.ИмяСобытияИзменениеВарианта(), ПараметрОповещения, ЭтотОбъект);
	СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтотОбъект, "ДеревоПодсистем", "*", Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВариантыОтчетовКлиент.РедактироватьМногострочныйТекст(ЭтотОбъект, Элемент.ТекстРедактирования, Объект, "Описание", НСтр("ru = 'Описание'"));
КонецПроцедуры

// +РАРУС
&НаКлиенте
Процедура ТипДоступаПриИзменении(Элемент)
	
	НастроитьОбъектДоступа();
	
КонецПроцедуры // -РАРУС

// +РАРУС
&НаКлиенте
Процедура ТипДоступаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДоступаКВариантуОтчета.БезОграничения"));
	
КонецПроцедуры // -РАРУС

// +РАРУС
&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	Произвольный = (Объект.ВидПериода = "Произвольный");
	Элементы.НачалоПериода.Доступность =  Произвольный;
	Элементы.КонецПериода.Доступность =  Произвольный;
	
КонецПроцедуры 

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	// Заменим название периода
	Если Объект.ВидПериода = "Произвольный" Тогда
		Объект.НачалоПериода = ОтчетыПлатформаКлиентСервер.СоответствиеСтандартнойДатыНачала(НачалоПериода);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	// Заменим название периода
	Если Объект.ВидПериода = "Произвольный" Тогда
		Объект.КонецПериода = ОтчетыПлатформаКлиентСервер.СоответствиеСтандартнойДатыНачала(КонецПериода);
	КонецЕсли;
	
КонецПроцедуры// -РАРУС

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоПодсистем

&НаКлиенте
Процедура ДеревоПодсистемИспользованиеПриИзменении(Элемент)
	ВариантыОтчетовКлиент.ДеревоПодсистемИспользованиеПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодсистемВажностьПриИзменении(Элемент)
	ВариантыОтчетовКлиент.ДеревоПодсистемВажностьПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// +РАРУС
&НаКлиенте
Процедура НастроитьОбъектДоступа()
	
	Если НЕ Элементы.ТипДоступа.ТолькоПросмотр Тогда
		Элементы.ОбъектДоступа.Доступность        = (НЕ Объект.ТипДоступа = ПредопределенноеЗначение("Перечисление.ТипыДоступаКВариантуОтчета.БезОграничения"));
	КонецЕсли;
	
	Если Объект.ТипДоступа = ПредопределенноеЗначение("Перечисление.ТипыДоступаКВариантуОтчета.ПоПользователю") Тогда
		Элементы.ОбъектДоступа.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
	ИначеЕсли Объект.ТипДоступа = ПредопределенноеЗначение("Перечисление.ТипыДоступаКВариантуОтчета.ПоГруппеПользователей") Тогда
		Элементы.ОбъектДоступа.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ГруппыПользователей");
	ИначеЕсли Объект.ТипДоступа = ПредопределенноеЗначение("Перечисление.ТипыДоступаКВариантуОтчета.ПоПодразделениюКомпании") Тогда
		Элементы.ОбъектДоступа.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании");
	КонецЕсли;
	
КонецПроцедуры // -РАРУС

&НаСервере
Функция ПерезаполнитьДерево(Прочитать)
	ВыделенныеСтроки = ОтчетыСервер.ЗапомнитьВыделенныеСтроки(ЭтотОбъект, "ДеревоПодсистем", "Ссылка");
	Если Прочитать Тогда
		ЭтотОбъект.Прочитать();
	КонецЕсли;
	ДеревоПриемник = ВариантыОтчетов.ДеревоПодсистемСформировать(ЭтотОбъект, Объект);
	ЗначениеВРеквизитФормы(ДеревоПриемник, "ДеревоПодсистем");
	ОтчетыСервер.ВосстановитьВыделенныеСтроки(ЭтотОбъект, "ДеревоПодсистем", ВыделенныеСтроки);
	Возврат Истина;
КонецФункции

&НаСервере
Процедура ПрочитатьСвойстваПредопределенного(ПервоеЧтение)
	Если ПервоеЧтение Тогда
		Если Не Объект.Пользовательский
			И (Объект.ТипОтчета = Перечисления.ТипыОтчетов.Внутренний
				Или Объект.ТипОтчета = Перечисления.ТипыОтчетов.Расширение)
			И ЗначениеЗаполнено(Объект.ПредопределенныйВариант) Тогда // Чтение настроек предопределенного.
			Сведения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ПредопределенныйВариант, "ВидимостьПоУмолчанию, Описание");
			СвойстваПредопределенного = Новый ФиксированнаяСтруктура(Сведения);
		Иначе
			Возврат; // Не предопределенный.
		КонецЕсли;
	Иначе
		Если ТипЗнч(СвойстваПредопределенного) <> Тип("ФиксированнаяСтруктура") Тогда
			Возврат; // Не предопределенный.
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидимостьПоУмолчаниюПереопределена = Ложь Тогда
		Объект.ВидимостьПоУмолчанию = СвойстваПредопределенного.ВидимостьПоУмолчанию;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.Описание) Тогда
		Объект.Описание = СвойстваПредопределенного.Описание;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
