
#Область СлужебныеПроцедурыИФункции

Функция МодульЧисла(Н)
	Возврат ?(Н>0,Н,-Н);
КонецФункции 

Функция УдалитьЧек(Смена, Транзакция, ТекстОшибки)
	
	Результат = Истина;
	
	ТекущийЧек = ПолучитьЧек(Смена, Транзакция.НомерЧека);
	
	Если ТекущийЧек<>Неопределено Тогда
		Смена.Чеки.Удалить(Смена.Чеки.Найти(ТекущийЧек));
	Иначе
		ТекстОшибки = НСтр("ru='Операция прервана. Ошибка при загрузке транзакции №%1%.'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1%", Транзакция.Номер);
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЧек(Смена, НомерЧека)
	
	НайденныеЧеки = НайтиСтроки(Смена.Чеки, Новый Структура("НомерЧека", НомерЧека));
	
	Если НайденныеЧеки.Количество()>0 Тогда
		Возврат Смена.Чеки[НайденныеЧеки[0].ИндексВМассиве];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Возвращает массив элементов, найденных в массиве структур по параметрам отбора.
// Параметры отбора являют собой структуру.
// Действует аналогично методу НайтиСтроки таблицы значений.
//
Функция НайтиСтроки(Знач МассивПоиска, ПараметрыОтбора)
	
	Результат = Новый Массив;
	Для ВремИндекс = 0 По МассивПоиска.Количество()-1 Цикл
		
		ЭлементМассива = МассивПоиска[ВремИндекс];
		ПолноеСовпадение = Истина;
		
		Для каждого ЭлементОтбора Из ПараметрыОтбора Цикл
			
			Если ЭлементМассива.Свойство(ЭлементОтбора.Ключ) 
				И НЕ ЭлементОтбора.Значение = ЭлементМассива[ЭлементОтбора.Ключ] Тогда
				ПолноеСовпадение = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПолноеСовпадение Тогда
			ЭлементМассива.Вставить("ИндексВМассиве", ВремИндекс);
			Результат.Добавить(ЭлементМассива);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьНеподдерживаемыеОперации(Чеки)
	
	КодОперацииПриход = 14;
	ОперацияПриход = ТипОперацииККМ(КодОперацииПриход);
	
	Индекс = Чеки.Количество() - 1;
	
	Пока Индекс > 0 Цикл
		
		Чек = Чеки[Индекс];
		
		Если Чек.ТипОперацииККМ = ОперацияПриход Тогда
			Чеки.Удалить(Индекс);
		КонецЕсли;
		
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры

Функция ТипОперацииККМ(КодТипаОперации)
	
	Если КодТипаОперации = 0 Тогда
		Возврат "Продажа";
		
	ИначеЕсли КодТипаОперации = 1 Тогда
		Возврат "Возврат";
		
	ИначеЕсли КодТипаОперации = 2 Тогда
		Возврат "Аннулирование";
		
	ИначеЕсли КодТипаОперации = 3 Тогда
		Возврат "Обмен";
		
	ИначеЕсли КодТипаОперации = 4 Тогда
		Возврат "Внесение";
		
	ИначеЕсли КодТипаОперации = 5 Тогда
		Возврат "Выплата";
		
	ИначеЕсли КодТипаОперации = 6 Тогда
		Возврат "Пользовательская";
		
	ИначеЕсли КодТипаОперации = 8 Тогда
		Возврат "ОткрытиеСмены";
		
	ИначеЕсли КодТипаОперации = 9 Тогда
		Возврат "ОперацияВККМ";
		
	ИначеЕсли КодТипаОперации = 10 Тогда
		Возврат "ЗакрытиеСмены";
		
	ИначеЕсли КодТипаОперации = 11 Тогда
		Возврат "ЗакрСменыПлатСистем";
		
	ИначеЕсли КодТипаОперации = 12 Тогда
		Возврат "РедСпискаСотрудников";
		
	ИначеЕсли КодТипаОперации = 13 Тогда
		Возврат "СлужебнаяОперация";
		
	ИначеЕсли КодТипаОперации = 14 Тогда
		Возврат "Приход";
		
	ИначеЕсли КодТипаОперации = 15 Тогда
		Возврат "Расход";
		
	ИначеЕсли КодТипаОперации = 16 Тогда
		Возврат "Инвентаризация";
		
	ИначеЕсли КодТипаОперации = 17 Тогда
		Возврат "Переоценка";
		
	ИначеЕсли КодТипаОперации = 18 Тогда
		Возврат "ВскрытиеТары";
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ЗакрытьСмену(Смена, Смены, Транзакция, ОфлайнОборудование)
	
	// Если смена не открыта/закрыта, открываем ее.
	Если Смена=Неопределено ИЛИ ЗначениеЗаполнено(Смена.ДатаЗакрытия) Тогда
		ОткрытьСмену(Смена, Смены, Транзакция, ОфлайнОборудование);
	КонецЕсли;
	
	Смена.ДатаЗакрытия = Транзакция.ДатаИВремя;
	Смены.Добавить(Смена);
	
	СоздатьЗакрытиеСмены(Смена, ОфлайнОборудование);
	
КонецПроцедуры

Процедура ОткрытьСмену(Смена, Смены, Транзакция, ОфлайнОборудование)
	
	// Если предыдущая смена не закрыта, закрываем ее.
	Если Смена<>Неопределено И НЕ ЗначениеЗаполнено(Смена.ДатаЗакрытия) Тогда
		ЗакрытьСмену(Смена, Смены, Транзакция, ОфлайнОборудование);
	КонецЕсли;
	
	Смена = Новый Структура;
	
	Смена.Вставить("НомерКассы",	Транзакция.НомерКассы);
	Смена.Вставить("НомерСмены",	Число(Транзакция.Поле14));
	Смена.Вставить("ДатаОткрытия",	Транзакция.ДатаИВремя);
	Смена.Вставить("ДатаЗакрытия"	);
	Смена.Вставить("Чеки",			Новый Массив);
	
КонецПроцедуры

Функция ПолучитьКарточку(НомерКартКлиента)
	
	Результат = Справочники.Карточки.ПустаяСсылка();
	
	
	НомерКартыКлиента = Лев(НомерКартКлиента,Найти(НомерКартКлиента,"|")-1); //??? Пока берем только первую...
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Карточки.Ссылка КАК Карточка
	|ИЗ
	|	Справочник.Карточки КАК Карточки
	|ГДЕ
	|	Карточки.Код = &НомерКартыКлиента И 
	|	Карточки.ВидКарточки = ЗНАЧЕНИЕ(Перечисление.ВидыКарточек.ДисконтнаяКарта)
	|";
	Запрос.УстановитьПараметр("НомерКартыКлиента", НомерКартыКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Карточка;
	КонецЕсли;
	
	Возврат Результат;   //??? А если карты нет, то все, инфа потеряна?
	
КонецФункции

Функция СоздатьЗакрытиеСмены(ПараметрыСмены, Оборудование) //КассаККМ, Автор, 
	
	КассаККМ = Справочники.КассыККМ.ПолучитьКассуККМОборудования(Оборудование, ПараметрыСмены.НомерКассы);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗакрытиеСмены.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	               |ГДЕ
	               |	ЗакрытиеСмены.НомерСмены = &НомерСмены
	               |	И ЗакрытиеСмены.КассаККМ = &КассаККМ
	               |	И ЗакрытиеСмены.Дата = &ДатаДокумента
	               |	И ЗакрытиеСмены.СкладКомпании = &СкладКомпании
	               |	И ЗакрытиеСмены.ПометкаУдаления = Ложь";
	
	Запрос.УстановитьПараметр("НомерСмены",     ПараметрыСмены.НомерСмены);
	Запрос.УстановитьПараметр("ДатаДокумента",  ПараметрыСмены.ДатаЗакрытия);
	Запрос.УстановитьПараметр("КассаККМ",       КассаККМ);
	Запрос.УстановитьПараметр("СкладКомпании",  Оборудование.ОсновнойОтдел);
	//Запрос.УстановитьПараметр("НомерДокумента", ПараметрыСмены.НомерСмены);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КассоваяСмена = Выборка.Ссылка.ПолучитьОбъект();
		//КассоваяСмена.Товары.Очистить();
		//КассоваяСмена.Оплаты.Очистить();
		//КассоваяСмена.Скидки.Очистить();
		//КассоваяСмена.Контрагенты.Очистить();
		//КассоваяСмена.Возвраты.Очистить();
		//КассоваяСмена.ВозвратОплаты.Очистить();
		////Возврат КассоваяСмена;
	Иначе
		КассоваяСмена = Документы.ЗакрытиеСмены.СоздатьДокумент();
		КассоваяСмена.НомерСмены     = ПараметрыСмены.НомерСмены;
		КассоваяСмена.КассаККМ       = КассаККМ;
		КассоваяСмена.Дата           = ПараметрыСмены.ДатаЗакрытия;
	КонецЕсли;
	
	КассоваяСмена.ДатаПоследнегоДокумента = ПараметрыСмены.ДатаЗакрытия;
	КассоваяСмена.ДатаОткрытияСмены       = ПараметрыСмены.ДатаОткрытия;

	
	КассоваяСмена.НомерДокумента = ПараметрыСмены.НомерСмены;
	//КассоваяСмена.Автор          = Автор;
	КассоваяСмена.ХозОперация    = Справочники.ХозОперации.ЗакрытиеСмены;
	КассоваяСмена.БлокироватьПерерасчетСкидок = Истина;
	КассоваяСмена.Заполнить(Неопределено);
	
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = Документы.ЗакрытиеСмены.ПолучитьПараметрыДействия(КассоваяСмена);
	ПараметрыДействия.Вставить("ЗапретИзмененияЦен", Истина);
	
	ОсновнойОтдел = Оборудование.ОсновнойОтдел;
	Если ЗначениеЗаполнено(Оборудование.Организация) Тогда
		КассоваяСмена.Организация = Оборудование.Организация;
	Иначе
		КассоваяСмена.Организация = ОсновнойОтдел.Организация;
	КонецЕсли;
	
	Документы.ЗакрытиеСмены.ОрганизацияПриИзменении(КассоваяСмена, ПараметрыДействия);
	
	Если НЕ КассоваяСмена.ПодразделениеКомпании = ОсновнойОтдел.ПодразделениеКомпании Тогда
		КассоваяСмена.ПодразделениеКомпании = ОсновнойОтдел.ПодразделениеКомпании;
		Документы.ЗакрытиеСмены.ПодразделениеКомпанииПриИзменении(КассоваяСмена, ПараметрыДействия);
	КонецЕсли;
	
	КассоваяСмена.СкладКомпании = ОсновнойОтдел;
	Документы.ЗакрытиеСмены.СкладКомпанииПриИзменении(КассоваяСмена, ПараметрыДействия);
	
	КассоваяСмена.ТипЦен = ОсновнойОтдел.ТипЦенРозничнойТорговли;
	Документы.ЗакрытиеСмены.ТипЦенПриИзменении(КассоваяСмена, ПараметрыДействия);
	
	Если ЗначениеЗаполнено(КассоваяСмена.ТипЦен.ВалютаЦены) И (КассоваяСмена.ТипЦен.ВалютаЦены <> КассоваяСмена.ВалютаДокумента) Тогда
		КассоваяСмена.ВалютаДокумента = КассоваяСмена.ТипЦен.ВалютаЦены;
		Документы.ЗакрытиеСмены.ВалютаДокументаПриИзменении(КассоваяСмена, ПараметрыДействия);
	КонецЕсли;
	
	КассоваяСмена.Товары.Очистить();
	КассоваяСмена.Оплаты.Очистить();
	КассоваяСмена.Скидки.Очистить();
	КассоваяСмена.Контрагенты.Очистить();
	КассоваяСмена.Возвраты.Очистить();
	КассоваяСмена.ВозвратОплаты.Очистить();
	КассоваяСмена.Марки.Очистить();
	КассоваяСмена.СуммаДокумента = 0;
	
	//Будем собирать смену по загруженным чекам...
	ЗапросТовары = Новый Запрос("ВЫБРАТЬ
	                            |	ЧекТовары.Номенклатура КАК Номенклатура,
	                            |	СУММА(ВЫБОР КОГДА ЧекТовары.Ссылка.ХозОперация = &ХОпродажа ТОГДА ЧекТовары.Количество * ЧекТовары.Коэффициент ИНАЧЕ 0 КОНЕЦ) КАК КоличествоПродано,
								|	СУММА(ВЫБОР КОГДА ЧекТовары.Ссылка.ХозОперация = &ХОвозврат ТОГДА ЧекТовары.Количество * ЧекТовары.Коэффициент ИНАЧЕ 0 КОНЕЦ) КАК КоличествоВозврат,
								|	СУММА(ВЫБОР КОГДА ЧекТовары.Ссылка.ХозОперация = &ХОвозврат ТОГДА ЧекТовары.Сумма ИНАЧЕ 0 КОНЕЦ) КАК СуммаВозврат,
								|	СУММА(ВЫБОР КОГДА ЧекТовары.Ссылка.ХозОперация = &ХОвозврат ТОГДА ЧекТовары.СуммаНДС ИНАЧЕ 0 КОНЕЦ) КАК СуммаНДСВозврат,
								|	СУММА(ВЫБОР КОГДА ЧекТовары.Ссылка.ХозОперация = &ХОвозврат ТОГДА ЧекТовары.СуммаСкидки ИНАЧЕ 0 КОНЕЦ) КАК СуммаСкидкиВозврат,
								|	СУММА(ВЫБОР КОГДА ЧекТовары.Ссылка.ХозОперация = &ХОвозврат ТОГДА ЧекТовары.СуммаВсего ИНАЧЕ 0 КОНЕЦ) КАК СуммаВсегоВозврат,
								|	ЧекТовары.Цена КАК Цена,
	                            |	СУММА(ВЫБОР КОГДА ЧекТовары.Ссылка.ХозОперация = &ХОвозврат ТОГДА -1 ИНАЧЕ 1 КОНЕЦ * ЧекТовары.Сумма) КАК Сумма,
	                            |	СУММА(ВЫБОР КОГДА ЧекТовары.Ссылка.ХозОперация = &ХОвозврат ТОГДА -1 ИНАЧЕ 1 КОНЕЦ * ЧекТовары.СуммаНДС) КАК СуммаНДС,
	                            |	СУММА(ВЫБОР КОГДА ЧекТовары.Ссылка.ХозОперация = &ХОвозврат ТОГДА -1 ИНАЧЕ 1 КОНЕЦ * ЧекТовары.СуммаСкидки) КАК СуммаСкидки,
	                            |	СУММА(ВЫБОР КОГДА ЧекТовары.Ссылка.ХозОперация = &ХОвозврат ТОГДА -1 ИНАЧЕ 1 КОНЕЦ * ЧекТовары.СуммаВсего) КАК СуммаВсего,
								|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР КОГДА ЧекТовары.Ссылка.ХозОперация = &ХОвозврат ТОГДА ЧекТовары.Ссылка ИНАЧЕ NULL КОНЕЦ) КАК КоличествоЧековВозврат,
	                            |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР КОГДА ЧекТовары.Ссылка.ХозОперация = &ХОпродажа ТОГДА ЧекТовары.Ссылка ИНАЧЕ NULL КОНЕЦ) КАК КоличествоЧековПродажа,
	                            |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЧекТовары.Ссылка) КАК КоличествоЧеков
								|ИЗ
	                            |	Документ.Чек.Товары КАК ЧекТовары
	                            |ГДЕ
	                            |	ЧекТовары.Ссылка.Проведен = ИСТИНА
	                            |	И ЧекТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	                            |	И ЧекТовары.Ссылка.КассаККМ = &КассаККМ
	                            |	И ЧекТовары.Ссылка.НомерСмены = &НомерСмены
	                            |	И ЧекТовары.Ссылка.СкладКомпании = &СкладКомпании
	                            |
	                            |СГРУППИРОВАТЬ ПО
	                            |	ЧекТовары.Номенклатура,
	                            |	ЧекТовары.Цена
	                            |
	                            |УПОРЯДОЧИТЬ ПО
	                            |	ЧекТовары.Номенклатура.Наименование");
	ЗапросТовары.УстановитьПараметр("НомерСмены",     ПараметрыСмены.НомерСмены);
	ЗапросТовары.УстановитьПараметр("КассаККМ",       КассаККМ);
	ЗапросТовары.УстановитьПараметр("СкладКомпании",  Оборудование.ОсновнойОтдел);
	ЗапросТовары.УстановитьПараметр("ХОпродажа",      Справочники.ХозОперации.Чек);
	ЗапросТовары.УстановитьПараметр("ХОвозврат",      Справочники.ХозОперации.ЧекНаВозврат);
	РезультатТовары = ЗапросТовары.Выполнить().Выгрузить();
	
	Для Каждого ТекущаяСтрока Из РезультатТовары Цикл
		
		НоваяСтрока = КассоваяСмена.Товары.Добавить();
			
		НоваяСтрока.МестоРазмещения     = КассоваяСмена.СкладКомпании;
		НоваяСтрока.Номенклатура        = ТекущаяСтрока.Номенклатура;
		//НоваяСтрока.ИдентификаторСтроки = ТекущаяСтрока.ИДСтроки;
		// Производим корректировку и заполнение связанных аналитик в строке
		ОбработкаТабличнойЧастиТовары.ОбработатьИзменениеНоменклатура(КассоваяСмена, НоваяСтрока, ПараметрыДействия);
		
		//Если ТекущаяСтрока.Единица = "" Тогда
			Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения) Тогда
				НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
			Иначе
				НоваяСтрока.ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(НоваяСтрока.Номенклатура);
			КонецЕсли;
		//Иначе
		//	СтрокаЕдиницы = ТаблицаЕдиниц.Найти(ТекущаяСтрока.Единица, "Наименование");
		//	Если СтрокаЕдиницы = Неопределено Тогда
		//		Единица = ПолучитьЕдиницу(ТекущаяСтрока.Единица);
		//		СтрокаЕдиницы = ТаблицаЕдиниц.Добавить();
		//		СтрокаЕдиницы.Наименование = ТекущаяСтрока.Единица;
		//		СтрокаЕдиницы.Единица      = Единица;
		//	КонецЕсли;
		//	
		//	НоваяСтрока.ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(Номенклатура, СтрокаЕдиницы.Единица, СтрокаЕдиницы.Наименование);
		//КонецЕсли;
		НоваяСтрока.Коэффициент       = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
		НоваяСтрока.КоличествоВозврат = ТекущаяСтрока.КоличествоВозврат / НоваяСтрока.Коэффициент;
		НоваяСтрока.КоличествоПродано = ТекущаяСтрока.КоличествоПродано/НоваяСтрока.Коэффициент;
		НоваяСтрока.Количество        = НоваяСтрока.КоличествоПродано - НоваяСтрока.КоличествоВозврат;
		Документы.ЗакрытиеСмены.ТоварыКоличествоПриИзменении(КассоваяСмена, НоваяСтрока);
		
		НоваяСтрока.Цена       = ТекущаяСтрока.Цена;
		Документы.ЗакрытиеСмены.ТоварыЦенаПриИзменении(КассоваяСмена, НоваяСтрока);
		//НоваяСтрока.СтавкаНДС = ПолучитьСтавкуНДС(ТаблицаСтавокНДС, ТекущаяСтрока.СтавкаНДС);
		//Документы.ЗакрытиеСмены.ТоварыСтавкаНДСПриИзменении(КассоваяСмена, НоваяСтрока);
		НоваяСтрока.Сумма       = ТекущаяСтрока.Сумма;
		НоваяСтрока.СуммаНДС    = ТекущаяСтрока.СуммаНДС;
		НоваяСтрока.СуммаСкидки = ТекущаяСтрока.СуммаСкидки;
		НоваяСтрока.СуммаВсего  = ТекущаяСтрока.СуммаВсего;
		
		Если НоваяСтрока.СуммаСкидки>0 Тогда
			СуммаБезСкидки = СкидкиНаценкиСервер.ПолучитьСуммуСтрокиБезСкидок(КассоваяСмена, НоваяСтрока, "Товары");
			НоваяСтрока.ПроцентСкидки = ?(СуммаБезСкидки = 0, 0, НоваяСтрока.СуммаСкидки*100/СуммаБезСкидки);
		КонецЕсли;
		НоваяСтрока.КоличествоЧеков = ТекущаяСтрока.КоличествоЧековПродажа;
		
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.КоличествоЧековВозврат) И ТекущаяСтрока.КоличествоЧековВозврат > 0 Тогда
			НоваяСтрока = КассоваяСмена.Возвраты.Добавить();
			НоваяСтрока.МестоРазмещения     = КассоваяСмена.СкладКомпании;
			НоваяСтрока.Номенклатура        = ТекущаяСтрока.Номенклатура;
			//НоваяСтрока.ИдентификаторСтроки = ТекущаяСтрока.ИДСтроки;
			//Производим корректировку и заполнение связанных аналитик в строке
			ОбработкаТабличнойЧастиТовары.ОбработатьИзменениеНоменклатура(КассоваяСмена, НоваяСтрока, ПараметрыДействия);
			
			Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения) Тогда
				НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
			Иначе
				НоваяСтрока.ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(НоваяСтрока.Номенклатура);
			КонецЕсли;
			НоваяСтрока.Коэффициент       = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
			НоваяСтрока.Количество        = ТекущаяСтрока.КоличествоВозврат;
			Документы.ЗакрытиеСмены.ВозвратыКоличествоПриИзменении(КассоваяСмена, НоваяСтрока);
			
			НоваяСтрока.Цена       = ТекущаяСтрока.Цена;
			Документы.ЗакрытиеСмены.ВозвратыЦенаПриИзменении(КассоваяСмена, НоваяСтрока);
			//НоваяСтрока.СтавкаНДС = ПолучитьСтавкуНДС(ТаблицаСтавокНДС, ТекущаяСтрока.СтавкаНДС);
			//Документы.ЗакрытиеСмены.ТоварыСтавкаНДСПриИзменении(КассоваяСмена, НоваяСтрока);
			НоваяСтрока.Сумма       = ТекущаяСтрока.СуммаВозврат;
			НоваяСтрока.СуммаНДС    = ТекущаяСтрока.СуммаНДСВозврат;
			НоваяСтрока.СуммаСкидки = ТекущаяСтрока.СуммаСкидкиВозврат;
			НоваяСтрока.СуммаВсего  = ТекущаяСтрока.СуммаВсегоВозврат;
			
			Если НоваяСтрока.СуммаСкидки>0 Тогда
				СуммаБезСкидки = СкидкиНаценкиСервер.ПолучитьСуммуСтрокиБезСкидок(КассоваяСмена, НоваяСтрока, "Возвраты");
				НоваяСтрока.ПроцентСкидки = ?(СуммаБезСкидки = 0, 0, НоваяСтрока.СуммаСкидки*100/СуммаБезСкидки);
			КонецЕсли;
			НоваяСтрока.КоличествоЧеков = ТекущаяСтрока.КоличествоЧековВозврат;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗапросОплаты = Новый Запрос("ВЫБРАТЬ
	                            |	ЧекОплаты.ТипОплаты КАК ТипОплаты,
	                            |	ЧекОплаты.ТипПлатежнойКарты КАК ТипПлатежнойКарты,
	                            |	ЧекОплаты.Карточка КАК Карточка,
	                            |	ЧекОплаты.Контрагент КАК Контрагент,
	                            |	ЧекОплаты.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	                            |	СУММА(ВЫБОР
	                            |			КОГДА ЧекОплаты.Ссылка.ХозОперация = &ХОпродажа
	                            |				ТОГДА ЧекОплаты.Сумма
	                            |			ИНАЧЕ 0
	                            |		КОНЕЦ) КАК СуммаОплата,
	                            |	СУММА(ВЫБОР
	                            |			КОГДА ЧекОплаты.Ссылка.ХозОперация = &ХОвозврат
	                            |				ТОГДА ЧекОплаты.Сумма
	                            |			ИНАЧЕ 0
	                            |		КОНЕЦ) КАК СуммаВозврат,
	                            |	СУММА(ВЫБОР
	                            |			КОГДА ЧекОплаты.Ссылка.ХозОперация = &ХОвозврат
	                            |				ТОГДА -1
	                            |			ИНАЧЕ 1
	                            |		КОНЕЦ * ЧекОплаты.Сумма) КАК Сумма,
	                            |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	                            |			КОГДА ЧекОплаты.Ссылка.ХозОперация = &ХОвозврат
	                            |				ТОГДА ЧекОплаты.Ссылка
	                            |			ИНАЧЕ NULL
	                            |		КОНЕЦ) КАК КоличествоЧековВозврат,
	                            |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	                            |			КОГДА ЧекОплаты.Ссылка.ХозОперация = &ХОпродажа
	                            |				ТОГДА ЧекОплаты.Ссылка
	                            |			ИНАЧЕ NULL
	                            |		КОНЕЦ) КАК КоличествоЧековПродажа,
	                            |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЧекОплаты.Ссылка) КАК КоличествоЧеков
	                            |ИЗ
	                            |	Документ.Чек.Оплаты КАК ЧекОплаты
	                            |ГДЕ
	                            |	ЧекОплаты.Ссылка.Проведен = ИСТИНА
	                            |	И ЧекОплаты.Ссылка.ПометкаУдаления = ЛОЖЬ
	                            |	И ЧекОплаты.Ссылка.КассаККМ = &КассаККМ
	                            |	И ЧекОплаты.Ссылка.СкладКомпании = &СкладКомпании
	                            |	И ЧекОплаты.Ссылка.НомерСмены = &НомерСмены
	                            |
	                            |СГРУППИРОВАТЬ ПО
	                            |	ЧекОплаты.ТипОплаты,
	                            |	ЧекОплаты.ТипПлатежнойКарты,
	                            |	ЧекОплаты.Карточка,
	                            |	ЧекОплаты.Контрагент,
	                            |	ЧекОплаты.ДоговорВзаиморасчетов");
	ЗапросОплаты.УстановитьПараметр("НомерСмены",     ПараметрыСмены.НомерСмены);
	ЗапросОплаты.УстановитьПараметр("КассаККМ",       КассаККМ);
	ЗапросОплаты.УстановитьПараметр("СкладКомпании",  Оборудование.ОсновнойОтдел);
	ЗапросОплаты.УстановитьПараметр("ХОпродажа",      Справочники.ХозОперации.Чек);
	ЗапросОплаты.УстановитьПараметр("ХОвозврат",      Справочники.ХозОперации.ЧекНаВозврат);
	РезультатОплаты = ЗапросОплаты.Выполнить().Выгрузить();
	
	Для Каждого СтрокаОплаты Из РезультатОплаты Цикл
		
		НоваяСтрока = КассоваяСмена.Оплаты.Добавить();
			
		//Если ЗначениеЗаполнено(СтрокаОплаты.НомерКарты) Тогда
		//	//НоваяСтрока.ТипПлатежнойКарты = Справочники.ТипыПлатежныхКарт.Безналичные;
		//	НоваяСтрока.ТипОплаты = Справочники.ТипыОплат.Безналичные;
		//	Карточка = ПолучитьКарточку(СтрокаОплаты.НомерКарты);
		//	Если ЗначениеЗаполнено(Карточка) Тогда
		//		НоваяСтрока.Карточка   = Карточка;
		//		Если ТипЗнч(Карточка.Объект) = Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Тогда
		//			НоваяСтрока.ДоговорВзаиморасчетов = Карточка.Объект;
		//			НоваяСтрока.Контрагент            = Карточка.Объект.Владелец;
		//		ИначеЕсли ТипЗнч(Карточка.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		//			НоваяСтрока.Контрагент = Карточка.Объект;
		//		КонецЕсли;
		//	КонецЕсли;
		//Иначе
		//	НоваяСтрока.ТипОплаты = Справочники.ТипыОплат.Наличные;
		//КонецЕсли;
		
		НоваяСтрока.ТипОплаты		= СтрокаОплаты.ТипОплаты;
		
		НоваяСтрока.СуммаВозврат    = СтрокаОплаты.СуммаВозврат;
		НоваяСтрока.СуммаОплата     = СтрокаОплаты.СуммаОплата;
		НоваяСтрока.Сумма           = НоваяСтрока.СуммаОплата-НоваяСтрока.СуммаВозврат;// ???
		НоваяСтрока.Касса           = КассоваяСмена.КассаККМ;
		НоваяСтрока.КоличествоЧеков = СтрокаОплаты.КоличествоЧеков;
		НоваяСтрока.КоличествоЧековОплата = СтрокаОплаты.КоличествоЧековПродажа;
		
		Если ЗначениеЗаполнено(СтрокаОплаты.КоличествоЧековВозврат) И СтрокаОплаты.КоличествоЧековВозврат > 0 Тогда
			НоваяСтрока = КассоваяСмена.ВозвратОплаты.Добавить();
			НоваяСтрока.ТипОплаты		= СтрокаОплаты.ТипОплаты;
			НоваяСтрока.Сумма    		= СтрокаОплаты.СуммаВозврат;
			НоваяСтрока.СуммаОплата     = СтрокаОплаты.СуммаОплата - НоваяСтрока.Сумма; //???
			НоваяСтрока.Касса           = КассоваяСмена.КассаККМ;
			НоваяСтрока.КоличествоЧеков = СтрокаОплаты.КоличествоЧековВозврат;
			НоваяСтрока.КоличествоЧековОплата = СтрокаОплаты.КоличествоЧековПродажа;
		КонецЕсли;
		
	КонецЦикла;
	
	//СуммаДокумента = КассоваяСмена.Товары.Итог("СуммаВсего")+КассоваяСмена.Оплаты.Итог("СуммаОплата") - КассоваяСмена.Оплаты.Итог("СуммаВозвратОплата") - КассоваяСмена.Возвраты.Итог("СуммаВсего")-КассоваяСмена.ВозвратОплаты.Итог("СуммаОплата"));
	//СуммаПриход  = КассоваяСмена.Оплаты.Итог("Сумма") + КассоваяСмена.Оплаты.Итог("СуммаОплата");
	//СуммаВозврат = КассоваяСмена.Оплаты.Итог("СуммаВозврат") + КассоваяСмена.Оплаты.Итог("СуммаВозвратОплата");
	
	ЗапросМарки = Новый Запрос("
	|ВЫБРАТЬ
	|	ЧекТовары.Номенклатура КАК Номенклатура,
	|	ЧекТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ЧекТовары.КодМарки КАК КодМарки,
	|	ВЫБОР КОГДА ЧекТовары.Ссылка.ХозОперация = &ХОвозврат ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЭтоВозврат
	|ИЗ
	|	Документ.Чек.Марки КАК ЧекТовары
	|ГДЕ
	|	ЧекТовары.Ссылка.Проведен = ИСТИНА
	|	И ЧекТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ЧекТовары.Ссылка.КассаККМ = &КассаККМ
	|	И ЧекТовары.Ссылка.НомерСмены = &НомерСмены
	|	И ЧекТовары.Ссылка.СкладКомпании = &СкладКомпании
	|УПОРЯДОЧИТЬ ПО
	|	ЧекТовары.Номенклатура.Наименование,
	|	ЧекТовары.АлкогольнаяПродукция.Наименование");
	ЗапросМарки.УстановитьПараметр("НомерСмены",     ПараметрыСмены.НомерСмены);
	ЗапросМарки.УстановитьПараметр("КассаККМ",       КассаККМ);
	ЗапросМарки.УстановитьПараметр("СкладКомпании",  Оборудование.ОсновнойОтдел);
	ЗапросМарки.УстановитьПараметр("ХОпродажа",      Справочники.ХозОперации.Чек);
	ЗапросМарки.УстановитьПараметр("ХОвозврат",      Справочники.ХозОперации.ЧекНаВозврат);
	ВыборкаМарки = ЗапросМарки.Выполнить().Выбрать();
	
	Пока ВыборкаМарки.Следующий() Цикл
		НоваяСтрока = КассоваяСмена.Марки.Добавить();
		НоваяСтрока.Номенклатура         = ВыборкаМарки.Номенклатура;
		НоваяСтрока.АлкогольнаяПродукция = ВыборкаМарки.АлкогольнаяПродукция;
		НоваяСтрока.КодМарки             = ВыборкаМарки.КодМарки;
		НоваяСтрока.ЭтоВозврат           = ВыборкаМарки.ЭтоВозврат;
	КонецЦикла;
	
	НачатьТранзакцию();
	
	
	ЗапросЧеки = Новый Запрос("ВЫБРАТЬ
	                            |	Чек.Ссылка КАК Чек
	                            |ИЗ
	                            |	Документ.Чек КАК Чек
	                            |ГДЕ
	                            |	Чек.Проведен = Истина
	                            |	И Чек.ПометкаУдаления = Ложь
	                            |	И Чек.КассаККМ = &КассаККМ
	                            |	И Чек.НомерСмены = &НомерСмены");
	ЗапросЧеки.УстановитьПараметр("НомерСмены",     ПараметрыСмены.НомерСмены);
	ЗапросЧеки.УстановитьПараметр("КассаККМ",       КассаККМ);
	ЗапросЧеки.УстановитьПараметр("СкладКомпании",  Оборудование.ОсновнойОтдел);
	РезультатЧеки = ЗапросЧеки.Выполнить().Выгрузить();
	
	Для Каждого СтрокаЧек Из РезультатЧеки Цикл
		Чек = СтрокаЧек.Чек.ПолучитьОбъект();
		Чек.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
	
	Попытка
		КассоваяСмена.Записать();
		Попытка
			КассоваяСмена.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			ЗаписьЖурналаРегистрации("Успешно проведен документ закрытия смены при приеме из Фронтол", УровеньЖурналаРегистрации.Информация,Документы.ЗакрытиеСмены, КассоваяСмена);
		Исключение
			Ош = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("Ошибка проведения закрытия смены при приеме из Фронтол", УровеньЖурналаРегистрации.Ошибка,Документы.ЗакрытиеСмены, КассоваяСмена, Ош);
			Возврат Ложь;	
		КонецПопытки;
	Исключение
		Ош = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Ошибка записи закрытия смены при приеме из Фронтол", УровеньЖурналаРегистрации.Ошибка,Документы.ЗакрытиеСмены, ПараметрыСмены,Ош);
		Возврат Ложь;	
	КонецПопытки;

	ЗафиксироватьТранзакцию();
	
	
	//Возврат КассоваяСмена;
	
КонецФункции

Функция СоздатьЧек(ПараметрыЧека,Оборудование)
	          
	К = 1;
	Если ПараметрыЧека.ТипОперацииККМ = "Продажа" Тогда
		ХозОперация = Справочники.ХозОперации.Чек;
	ИначеЕсли ПараметрыЧека.ТипОперацииККМ = "Возврат" Тогда
		ХозОперация = Справочники.ХозОперации.ЧекНаВозврат;
		К = -1;
	Иначе
		Возврат Неопределено; //???
	КонецЕсли;
	
	КассаККМ = Справочники.КассыККМ.ПолучитьКассуККМОборудования(Оборудование, ПараметрыЧека.НомерКассы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Чек.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Чек КАК Чек
	               |ГДЕ
	               |	Чек.НомерСмены = &НомерСмены
	               |	И Чек.НомерЧека = &НомерЧека
	               |	И Чек.ДатаФР = &ДатаФР
	               |	И Чек.КассаККМ = &КассаККМ
	               |	И Чек.СкладКомпании = &СкладКомпании";
	Запрос.УстановитьПараметр("НомерСмены",     ПараметрыЧека.НомерСмены);
	Запрос.УстановитьПараметр("НомерЧека",      ПараметрыЧека.НомерЧека);
	//Запрос.УстановитьПараметр("НомерДокумента", ПараметрыЧека.НомерДокумента);
	Запрос.УстановитьПараметр("ДатаФР",         ПараметрыЧека.ДатаЧека);
	Запрос.УстановитьПараметр("КассаККМ",       КассаККМ);   //ссылка
	Запрос.УстановитьПараметр("СкладКомпании",  Оборудование.ОсновнойОтдел);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЧекОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		//Возврат ЧекОбъект;
	Иначе	
		ЧекОбъект = Документы.Чек.СоздатьДокумент();
		ЧекОбъект.НомерСмены     = ПараметрыЧека.НомерСмены;
		ЧекОбъект.НомерЧека      = ПараметрыЧека.НомерЧека;
		ЧекОбъект.ДатаФР         = ПараметрыЧека.ДатаЧека;
		ЧекОбъект.Дата           = ПараметрыЧека.ДатаЧека;
		//ЧекОбъект.НомерДокумента = ПараметрыЧека.НомерДокумента; ???
		//ЧекОбъект.Автор          = Кассир; ???
		ЧекОбъект.БлокироватьПерерасчетСкидок = Истина;
		ЧекОбъект.УстановитьНовыйНомер();
	КонецЕсли;
	
	ЧекОбъект.ХозОперация = ХозОперация;
	ЧекОбъект.ПометкаУдаления = Ложь;
	ЧекОбъект.Заполнить(Неопределено);
	ЧекОбъект.Товары.Очистить();
	ЧекОбъект.Оплаты.Очистить();
	ЧекОбъект.Скидки.Очистить();
	ЧекОбъект.Марки.Очистить();
	
	ОсновнойОтдел = Оборудование.ОсновнойОтдел;
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = Документы.Чек.ПолучитьПараметрыДействия(ЧекОбъект);
	ПараметрыДействия.Вставить("ЗапретИзмененияЦен", Истина);
	
	Если ЗначениеЗаполнено(Оборудование.Организация) Тогда
		ЧекОбъект.Организация = Оборудование.Организация;
	Иначе
		ЧекОбъект.Организация = ОсновнойОтдел.Организация;
	КонецЕсли;
	
	Документы.Чек.ОрганизацияПриИзменении(ЧекОбъект, ПараметрыДействия);
	
	Если НЕ ЧекОбъект.ПодразделениеКомпании = ОсновнойОтдел.ПодразделениеКомпании Тогда
		ЧекОбъект.ПодразделениеКомпании = ОсновнойОтдел.ПодразделениеКомпании;
		Документы.Чек.ПодразделениеКомпанииПриИзменении(ЧекОбъект, ПараметрыДействия);
	КонецЕсли;
	
	ЧекОбъект.СкладКомпании = ОсновнойОтдел;
	Документы.Чек.СкладКомпанииПриИзменении(ЧекОбъект, ПараметрыДействия);
	
	ЧекОбъект.ТипЦен = ОсновнойОтдел.ТипЦенРозничнойТорговли;
	Документы.Чек.ТипЦенПриИзменении(ЧекОбъект, ПараметрыДействия);
	
	Если ЗначениеЗаполнено(ЧекОбъект.ТипЦен.ВалютаЦены) И (ЧекОбъект.ТипЦен.ВалютаЦены <> ЧекОбъект.ВалютаДокумента) Тогда
		ЧекОбъект.ВалютаДокумента = ЧекОбъект.ТипЦен.ВалютаЦены;
		Документы.Чек.ВалютаДокументаПриИзменении(ЧекОбъект, ПараметрыДействия);
	КонецЕсли;
	
	Карточка = ПолучитьКарточку(ПараметрыЧека.КартыКлиента);
	Если ЗначениеЗаполнено(Карточка) Тогда
		ЧекОбъект.Карточка = Карточка;
		Документы.Чек.КарточкаПриИзменении(ЧекОбъект, ПараметрыДействия);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КассаККМ) Тогда
		ЧекОбъект.КассаККМ = КассаККМ;
		Документы.Чек.КассаККМПриИзменении(ЧекОбъект, ПараметрыДействия);
	КонецЕсли;
	
	ЭтоВозврат = (ПараметрыЧека.ТипОперацииККМ = "Возврат");
	
	//ЧекОбъект.ФР = Оборудование;
	СлужебныйТовар = Константы.СлужебныйТовар.Получить();
	Для Каждого СтрокаЧека Из ПараметрыЧека.Товары Цикл
		
		НоваяСтрока = ЧекОбъект.Товары.Добавить();
		
		НоваяСтрока.ИдентификаторТовара = СтрокаЧека.Код;
		
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду(СтрокаЧека.Код);
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			Номенклатура = СлужебныйТовар;
		КонецЕсли;	
		
		НоваяСтрока.МестоРазмещения     = ЧекОбъект.СкладКомпании;
		НоваяСтрока.Номенклатура        = Номенклатура;
		НоваяСтрока.ИдентификаторСтроки = СтрокаЧека.НомерТранзакции;
		
		// Производим корректировку и заполнение связанных аналитик в строке
		ОбработкаТабличнойЧастиТовары.ОбработатьИзменениеНоменклатура(ЧекОбъект, НоваяСтрока, ПараметрыДействия);
		
		//Если СтрокаЧека.Штрихкод = "" Тогда
		Если ЗначениеЗаполнено(Номенклатура.ОсновнаяЕдиницаИзмерения) Тогда
			НоваяСтрока.ЕдиницаИзмерения = Номенклатура.ОсновнаяЕдиницаИзмерения;
		Иначе
			НоваяСтрока.ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(Номенклатура);
		КонецЕсли;
		//Иначе
		//	СтрокаЕдиницы = ТаблицаЕдиниц.Найти(СтрокаЧека.Единица, "Наименование");
		//	Если СтрокаЕдиницы = Неопределено Тогда
		//		Единица = ПолучитьЕдиницу(СтрокаЧека.Единица);
		//		СтрокаЕдиницы = ТаблицаЕдиниц.Добавить();
		//		СтрокаЕдиницы.Наименование = СтрокаЧека.Единица;
		//		СтрокаЕдиницы.Единица      = Единица;
		//	КонецЕсли;
		//	
		//	НоваяСтрока.ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(Номенклатура, СтрокаЕдиницы.Единица, СтрокаЕдиницы.Наименование);
		//КонецЕсли;
		НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
		НоваяСтрока.Количество  = МодульЧисла(СтрокаЧека.Количество);
		Документы.Чек.ТоварыКоличествоПриИзменении(ЧекОбъект, НоваяСтрока);   //??? модуль
		НоваяСтрока.Цена       = СтрокаЧека.Цена;
		Документы.Чек.ТоварыЦенаПриИзменении(ЧекОбъект, НоваяСтрока);
		//НоваяСтрока.СтавкаНДС = ПолучитьСтавкуНДС(ТаблицаСтавокНДС, СтрокаЧека.СтавкаНДС);
		//Документы.Чек.ТоварыСтавкаНДСПриИзменении(ЧекОбъект, НоваяСтрока);
		НоваяСтрока.СуммаСкидки = МодульЧисла(СтрокаЧека.СуммаСкидки);
		НоваяСтрока.СуммаВсего       = МодульЧисла(СтрокаЧека.Сумма);
		
		Если ЗначениеЗаполнено(СтрокаЧека.ШтрихкодАлкогольнойПродукции) Тогда
			НоваяСтрока = ЧекОбъект.Марки.Добавить();
			НоваяСтрока.Номенклатура = Номенклатура;
			//НоваяСтрока.АлкогольнаяПродукция = ВыборкаМарки.АлкогольнаяПродукция;
			НоваяСтрока.КодМарки     = СтрокаЧека.ШтрихкодАлкогольнойПродукции;
			НоваяСтрока.ЭтоВозврат   = ЭтоВозврат;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаОплаты Из ПараметрыЧека.Оплаты Цикл
		
		//В поле ТипОплаты записывается код операции для вида оплаты: 0 – оплата наличными; 1 – оплата банковской картой; 3 – оплата внутренней предоплатой; 6 – оплата внутренней подарочной картой; 7 – пользовательская; 8 – оплата внешней подарочной картой.
		//В поле КодВидаОплаты записывается код вида оплаты из Фронтола
		//Сдача записывается в Сумма с отрицательным значением.
		ТипОплатыФронтол = Число(СтрокаОплаты.ТипОплаты);
		Если ТипОплатыФронтол=0 Тогда ТипОплаты=Справочники.ТипыОплат.Наличные
		ИначеЕсли ТипОплатыФронтол=1 Тогда ТипОплаты=Справочники.ТипыОплат.Безналичные
		//ИначеЕсли ТипОплатыФронтол=3 Тогда ТипОплаты=Справочники.ТипыОплат.ЗачетАванса
		//ИначеЕсли ТипОплатыФронтол=6 Тогда ТипОплаты=Справочники.ТипыОплат.КлубнаяКарта
		ИначеЕсли ТипОплатыФронтол=7 Тогда ТипОплаты=Справочники.ТипыОплат.Безналичные
		//ИначеЕсли ТипОплатыФронтол=8 Тогда ТипОплаты=Справочники.ТипыОплат.Наличные
		Иначе ТипОплаты=Справочники.ТипыОплат.Наличные КонецЕсли;
		
		Сумма = СтрокаОплаты.Сумма * К;
		
		Если Сумма<0 Тогда //Если сдача, то пишем в предыдущую строку
			//НоваяСтрока = 	ЧекОбъект.Оплаты.Найти(ТипОплаты,"ТипОплаты");
		Иначе	
			НоваяСтрока = ЧекОбъект.Оплаты.Добавить();	
		КонецЕсли;
		
		НоваяСтрока.Контрагент = Справочники.Контрагенты.ОсновнойПокупатель;
		НоваяСтрока.АвтоЗакрытиеСделок = Истина;
		НоваяСтрока.ТипОплаты = ТипОплаты;
		Если Сумма<0 Тогда
			НоваяСтрока.Сдача = Сумма;
			НоваяСтрока.Сумма = НоваяСтрока.Сумма + НоваяСтрока.Сдача;
		Иначе
			НоваяСтрока.Сумма = Сумма;
		КонецЕсли;
		Документы.Чек.ОплатыСуммаПриИзменении(ЧекОбъект, НоваяСтрока);
		
	КонецЦикла;
	
	Попытка
		ЧекОбъект.Записать();
		Попытка
			ЧекОбъект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		Исключение
			Ош = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("Ошибка проведения чека при приеме из Фронтол", УровеньЖурналаРегистрации.Ошибка,Документы.Чек, ЧекОбъект, Ош);
			Возврат Ложь;	
		КонецПопытки;
			
		
	Исключение
		Ош = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Ошибка записи чека при приеме из Фронтол", УровеньЖурналаРегистрации.Ошибка,Документы.Чек, ПараметрыЧека,Ош);
		Возврат Ложь;	
	КонецПопытки;
	
	
	
	Возврат Истина;
	
КонецФункции


Функция ЗакрытьЧек(Смена, Транзакция, ТекстОшибки, ОфлайнОборудование)
	
	ТекущийЧек = ПолучитьЧек(Смена, Транзакция.НомерЧека);
	
	Если ТекущийЧек = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Неверный формат файла. Невозможно найти чек №%1%");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1%", Транзакция.НомерЧека);
		Результат = Ложь;
	Иначе
		ТекущийЧек.Закрыт = Истина;
		ТекущийЧек.ДатаЧека = Транзакция.ДатаИВремя;
		Результат = Истина;
	КонецЕсли;
	
	СоздатьЧек(ТекущийЧек, ОфлайнОборудование);
	
	Возврат Результат;
	
КонецФункции

Процедура ОткрытьЧек(Смена, Смены, Транзакция, ОфлайнОборудование)
	
	// Проверяем инициализированность текущей смены.
	Если Смена = Неопределено ИЛИ Смена.НомерСмены <> Число(Транзакция.Поле14) ИЛИ ЗначениеЗаполнено(Смена.ДатаЗакрытия) Тогда
		ОткрытьСмену(Смена, Смены, Транзакция, ОфлайнОборудование);
	КонецЕсли;
	
	Чек = Новый Структура;
	
	
	Чек.Вставить("НомерКассы", Транзакция.НомерКассы);
	Чек.Вставить("НомерСмены", Число(Транзакция.Поле14));
	Чек.Вставить("КодКассира", Транзакция.КодКассира);
	Чек.Вставить("КартыКлиента", Транзакция.Поле8);
	Чек.Вставить("Закрыт", Ложь);
	Чек.Вставить("ДатаЧека", Неопределено); // устанавливается при закрытии
	Чек.Вставить("НомерЧека", Транзакция.НомерЧека);
	Чек.Вставить("Товары", Новый Массив);
	Чек.Вставить("Оплаты", Новый Массив);
	Чек.Вставить("ТипОперацииККМ", ТипОперацииККМ(Транзакция.Поле13));
	Чек.Вставить("КодОперацииККМ", Транзакция.Поле13);
	Чек.Вставить("ТипЧека", Транзакция.Тип);
	
	Смена.Чеки.Добавить(Чек);
	
КонецПроцедуры

Процедура ДобавитьТранзакциюВЧек(Смена, Смены, Транзакция, ФорматОбмена, Оплата = Ложь, ОфлайнОборудование)
	
	Если Смена = Неопределено ИЛИ ЗначениеЗаполнено(Смена.ДатаЗакрытия) Тогда
		ОткрытьСмену(Смена, Смены, Транзакция, ОфлайнОборудование);
	КонецЕсли;
	
	ТекущийЧек = ПолучитьЧек(Смена, Транзакция.НомерЧека);
	
	Если ТекущийЧек = Неопределено Тогда
		ОткрытьЧек(Смена, Смены, Транзакция, ОфлайнОборудование);
	КонецЕсли;
	
	Если Оплата Тогда
		
		ОплатыЧека = Смена.Чеки[Смена.Чеки.Количество()-1].Оплаты;
		
		НайденныеОплаты = НайтиСтроки(ОплатыЧека, Новый Структура("КодВидаОплаты, ТипЧека", Транзакция.Поле9, Транзакция.Поле13));
		
		Если НайденныеОплаты.Количество()>0 Тогда
			
			Оплата = ОплатыЧека[НайденныеОплаты[0].ИндексВМассиве];
			Оплата.Сумма = Оплата.Сумма + Транзакция.Поле12;
			
		Иначе
			
			НоваяОплата = Новый Структура;
			
			//3. В поле №10 записывается код операции для вида оплаты: 0 – оплата наличными; 1 – оплата банковской картой; 3 – оплата внутренней предоплатой; 6 – оплата внутренней подарочной картой; 7 – пользовательская; 8 – оплата внешней подарочной картой.
			//4. Сдача записывается в поле №11 и поле №12 с отрицательным значением.
			
			//НоваяОплата.Вставить("ТипОплаты",		?(Транзакция.Поле9 = "0" ИЛИ ПустаяСтрока(Транзакция.Поле9), "0", "1")); // 0 - предопределенный тип оплаты "наличные".
			НоваяОплата.Вставить("ТипОплаты",		Транзакция.Поле10); 
			НоваяОплата.Вставить("КодВидаОплаты",	Транзакция.Поле9);
			НоваяОплата.Вставить("Сумма",			Транзакция.Поле12);
			НоваяОплата.Вставить("ТипЧека",			Транзакция.Поле13);
			
			ОплатыЧека.Добавить(НоваяОплата);
			
		КонецЕсли;
		
	Иначе
		
		Если Транзакция.Поле13 = 18 Тогда
			
			НовоеВскрытие = Новый Структура;
			
			НовоеВскрытие.Вставить("Дата",			НачалоДня(Транзакция.ДатаИВремя));
			НовоеВскрытие.Вставить("Код",			Транзакция.Поле8);
			НовоеВскрытие.Вставить("Количество",	Транзакция.Поле11);
			НовоеВскрытие.Вставить("ВскрытиеТары",	Истина);
			
			Если ФорматОбмена = 1 ИЛИ ФорматОбмена = 2 Тогда
				ШтрихкодМарки = Транзакция.Поле34;
			Иначе
				ШтрихкодМарки = "";
			КонецЕсли;
			
			НовоеВскрытие.Вставить("ШтрихкодАлкогольнойПродукции",	ШтрихкодМарки);
			
			Смена.Чеки[Смена.Чеки.Количество()-1].Товары.Добавить(НовоеВскрытие);
			
		Иначе
				
			НовыйТовар = Новый Структура;
			
			НовыйТовар.Вставить("Код",					Транзакция.Поле8);
			НовыйТовар.Вставить("Количество",			Транзакция.Поле11);
			НовыйТовар.Вставить("Цена",					Транзакция.Поле15);
			НовыйТовар.Вставить("Сумма",				Транзакция.Поле16);
			НовыйТовар.Вставить("СуммаСкидки",			Транзакция.Поле12-Транзакция.Поле16);
			НовыйТовар.Вставить("ШтрихКод",				Транзакция.Поле19);
			НовыйТовар.Вставить("НомерТранзакции",		Транзакция.Номер);
			НовыйТовар.Вставить("ДатаИВремяТранзакции",	Транзакция.ДатаИВремя);
			НовыйТовар.Вставить("ВскрытиеТары",			Ложь);
			
			Если ФорматОбмена = 1 ИЛИ ФорматОбмена = 2 Тогда
				ШтрихкодМарки = Транзакция.Поле34;
			Иначе
				ШтрихкодМарки = "";
			КонецЕсли;
			
			НовыйТовар.Вставить("ШтрихкодАлкогольнойПродукции", ШтрихкодМарки);
			
			Смена.Чеки[Смена.Чеки.Количество()-1].Товары.Добавить(НовыйТовар);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УдалитьТранзакциюИзЧека(Смена, Транзакция, ТекстОшибки)
	
	Результат = Истина;
	
	ТекущийЧек = ПолучитьЧек(Смена, Транзакция.НомерЧека);
	
	Если ТекущийЧек = Неопределено ИЛИ ТекущийЧек.Товары.Количество() = 0 Тогда
		Результат = Ложь;
	Иначе
		
		СторнируемаяТранзакция = Неопределено;
		
		Для Каждого ТекТовар Из ТекущийЧек.Товары Цикл
			
			Если ТекТовар.Код = Транзакция.Поле8 И ТекТовар.Количество = -1*Транзакция.Поле11 И ТекТовар.Цена = Транзакция.Поле15 Тогда
				СторнируемаяТранзакция = ТекТовар;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ СторнируемаяТранзакция = Неопределено Тогда
			ТекущийЧек.Товары.Удалить(ТекущийЧек.Товары.Найти(СторнируемаяТранзакция));
		Иначе
			Результат = Ложь;
		КонецЕсли;
		
		Если НЕ Результат Тогда
			ТекстОшибки = НСтр("ru='Операция прервана. Ошибка при загрузке транзакции №%1%.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1%", Транзакция.Номер);
		КонецЕсли;
		
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции

Функция ЗаполнитьТранзакцию(Строка, Транзакция, ФорматОбмена, ТекстОшибки)
	
	Результат = Истина;
	
	Попытка
		
		ПолеОшибки = НСтр("ru='Номер транзакции (1)'");
		
		// Номер транзакции.
		Транзакция.Вставить("Номер", Число(СтрПолучитьСтроку(Строка, 1)));
		
		ПолеОшибки = НСтр("ru='Дата и время транзакции (2,3)'");
		
		ДатаТранзакции = СтрЗаменить(СтрПолучитьСтроку(Строка, 2), ".", Символы.ПС);
		ВремяТранзакции = СтрЗаменить(СтрПолучитьСтроку(Строка, 3), ":", Символы.ПС);
		
		// Дата и время транзакции.
		Транзакция.Вставить("ДатаИВремя", Дата(Число(СтрПолучитьСтроку(ДатаТранзакции, 3)), Число(СтрПолучитьСтроку(ДатаТранзакции, 2)), Число(СтрПолучитьСтроку(ДатаТранзакции, 1)), Число(СтрПолучитьСтроку(ВремяТранзакции, 1)), Число(СтрПолучитьСтроку(ВремяТранзакции, 2)), Число(СтрПолучитьСтроку(ВремяТранзакции, 3))));
		
		ПолеОшибки = НСтр("ru='Тип транзакции (4)'");
		
		// Номер кассы.
		Транзакция.Вставить("НомерКассы", Число(СтрПолучитьСтроку(Строка, 5)));
		
		// Тип транзакции.
		Транзакция.Вставить("Тип", Число(СтрПолучитьСтроку(Строка, 4)));
		
		ПолеОшибки = НСтр("ru='Номер чека (6)'");
		
		// Номер чека транзакции.
		Транзакция.Вставить("НомерЧека", Число(СтрПолучитьСтроку(Строка, 6)));
		
		// Код кассира.
		Транзакция.Вставить("КодКассира", Число(СтрПолучитьСтроку(Строка, 7)));
		
		
		Если ФорматОбмена = 1 ИЛИ ФорматОбмена = 2 Тогда
			КоличествоПолей = 34;
		Иначе
			КоличествоПолей = 26
		КонецЕсли;
		
		// При загрузке обрабатываются только первые 26 полей.
		Для Индекс = 8 По КоличествоПолей Цикл
			
			ИндексСтрокой = Формат(Индекс, "ЧГ=0");
			
			ПолеОшибки = НСтр("ru='Поле №%1% (%1%)'");
			ПолеОшибки = СтрЗаменить(ПолеОшибки, "%1%", ИндексСтрокой);
			
			Значение = СтрПолучитьСтроку(Строка, Индекс);
			
			ИндексВхождения = СтрНайти(Значение, "|");
			
			Если ИндексВхождения > 0 Тогда
				Значение = Лев(Значение, ИндексВхождения-1);
			КонецЕсли;
			
			// Преобразуем значение числовых полей в число.
			Если (Индекс>=10 И Индекс<=13) ИЛИ Индекс=16 Тогда
				Транзакция.Вставить("Поле" + ИндексСтрокой, ?(ЗначениеЗаполнено(Значение), Число(Значение), Неопределено));
			Иначе
				Транзакция.Вставить("Поле" + ИндексСтрокой, Значение);
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		
		// Если в процессе разбора транзакции произошла ошибка.
		ТекстОшибки = НСтр("ru='Неверный формат файла. Невозможно распознать поле: %1%");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1%", ПолеОшибки);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ОбработатьЗагружаемыеДанныеИзККМ(ТекстовыйДокумент, ФорматОбмена, ВыходныеПараметры,ОфлайнОборудование) Экспорт
	
	
	Результат = Истина;
	
	ВсегоСтрок = ТекстовыйДокумент.КоличествоСтрок();
	
	ЗагружаемыеДанныеИзККМ = МенеджерОфлайнОборудования.ПолучитьЗагружаемыеДанныеИзККМ();
	
	ПродолжатьЧтениеФайла = Ложь;
	ТекстОшибки = "";
	Строка = ТекстовыйДокумент.ПолучитьСтроку(1);
	
	// Проверяем обработанность файла.
	Если Строка = "#" Тогда
		Индекс = 4;
		ПродолжатьЧтениеФайла = Истина;
	ИначеЕсли Строка = "@" Тогда
		ТекстОшибки = НСтр("ru='Файл загрузки был обработан ранее.'");
		Результат = Ложь;
	Иначе
		ТекстОшибки = НСтр("ru='Загрузка невозможна. Неизвестный формат отчета.'");
		Результат = Ложь;
	КонецЕсли;
	
	Смены = Новый Массив;
	ТекущаяСмена = Неопределено;
	
	// В цикле читаем транзакции.
	Пока ПродолжатьЧтениеФайла Цикл
		
		// Получаем строку с очередной транзакцией.
		Строка = ТекстовыйДокумент.ПолучитьСтроку(Индекс);
		
		// Если транзакция существует.
		Если ПустаяСтрока(Строка) Тогда
			
			Если Индекс <= ВсегоСтрок Тогда
				Индекс = Индекс + 1;
				Продолжить;
			КонецЕсли;
			
			ПродолжатьЧтениеФайла = Ложь;
			
		Иначе
			
			Транзакция = Новый Структура;
			
			// Раскладываем транзакцию на поля.
			Если ЗаполнитьТранзакцию(СтрЗаменить(Строка, ";", Символы.ПС), Транзакция, ФорматОбмена, ТекстОшибки) Тогда
				
				Если Транзакция.Тип = 2 ИЛИ Транзакция.Тип = 12 Тогда
					
					// Сторно продажи/возврата товара.
					Если НЕ УдалитьТранзакциюИзЧека(ТекущаяСмена, Транзакция, ТекстОшибки) Тогда
						ПродолжатьЧтениеФайла = Ложь;
						Результат = Ложь;
					КонецЕсли;
					
				ИначеЕсли Транзакция.Тип = 1 ИЛИ Транзакция.Тип = 11 Тогда
					
					// Продажа/возврат товара.
					ДобавитьТранзакциюВЧек(ТекущаяСмена, Смены, Транзакция, ФорматОбмена,, ОфлайнОборудование);
					
				ИначеЕсли Транзакция.Тип = 40 ИЛИ Транзакция.Тип = 41 Тогда
					
					// Оплата.
					ДобавитьТранзакциюВЧек(ТекущаяСмена, Смены, Транзакция, ФорматОбмена, Истина, ОфлайнОборудование);
					
				ИначеЕсли Транзакция.Тип = 42 Тогда
					
					// Открытие чека.
					ОткрытьЧек(ТекущаяСмена, Смены, Транзакция, ОфлайнОборудование);
					
				ИначеЕсли Транзакция.Тип = 55 Тогда
					
					// Закрытие чека.
					Если НЕ ЗакрытьЧек(ТекущаяСмена, Транзакция, ТекстОшибки, ОфлайнОборудование) Тогда
						ПродолжатьЧтениеФайла = Ложь;
						Результат = Ложь;
					КонецЕсли;
					
				ИначеЕсли Транзакция.Тип = 56 Тогда
					
					// Отмена чека.
					УдалитьЧек(ТекущаяСмена, Транзакция, ТекстОшибки);
					
				ИначеЕсли Транзакция.Тип = 61 Тогда
					
					// Закрытие смены.
					ЗакрытьСмену(ТекущаяСмена, Смены, Транзакция, ОфлайнОборудование);
					
				ИначеЕсли Транзакция.Тип = 62 Тогда
					
					// Открытие смены.
					ОткрытьСмену(ТекущаяСмена, Смены, Транзакция, ОфлайнОборудование);
					
				КонецЕсли;
				
			Иначе
				Результат = Ложь;
				ПродолжатьЧтениеФайла = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	
	//Если Результат Тогда
	//	
	//	// Перебираем смены.
	//	Для Каждого Смена Из Смены Цикл
	//		
	//		// Формируем описание смены.
	//		
	//		ОтчетОПродажахККМ = МенеджерОфлайнОборудования.ПолучитьОтчетОПродажахККМ();
	//		
	//		ОтчетОПродажахККМ.НомерСмены = Смена.НомерСмены;
	//		ОтчетОПродажахККМ.ДатаОткрытияСмены = Смена.ДатаОткрытия;
	//		ОтчетОПродажахККМ.ДатаЗакрытияСмены = Смена.ДатаЗакрытия;
	//		
	//		УдалитьНеподдерживаемыеОперации(Смена.Чеки);
	//		
	//		// Перебираем все чеки смены.
	//		Для Каждого Чек Из Смена.Чеки Цикл
	//			
	//			// Если чек закрыт.
	//			Если Чек.Закрыт Тогда
	//				
	//				Если Чек.ТипОперацииККМ = "Продажа" ИЛИ Чек.ТипОперацииККМ = "Возврат" Тогда
	//					
	//					ЧекККМ = МенеджерОфлайнОборудования.ПолучитьЧекККМ();
	//					
	//					ЧекККМ.ДатаЧека = Чек.ДатаЧека;
	//					ЧекККМ.НомерЧека = Чек.НомерЧека;
	//					ЧекККМ.ТипРасчета = ?(Чек.ТипОперацииККМ = "Продажа",
	//						Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств,
	//						Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств
	//					);
	//					
	//					
	//					Для Каждого Товар Из Чек.Товары Цикл
	//						
	//						ТоварЧекаККМ = МенеджерОфлайнОборудования.ПолучитьТоварЧекаККМ();
	//						
	//						ТоварЧекаККМ.Код 		= Товар.Код;
	//						ТоварЧекаККМ.Цена 		= ?(Товар.Цена > 0,  Товар.Цена,  -Товар.Цена);
	//						ТоварЧекаККМ.Сумма 		= ?(Товар.Сумма > 0, Товар.Сумма, -Товар.Сумма);
	//						ТоварЧекаККМ.Количество = ?(Товар.Количество > 0, Товар.Количество, -Товар.Количество);
	//						//ТоварЧекаККМ.ШтрихкодАлкогольнойПродукции = Товар.ШтрихкодАлкогольнойПродукции;
	//						//ТоварЧекаККМ.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	//						
	//						ЧекККМ.Товары.Добавить(ТоварЧекаККМ);
	//						
	//					КонецЦикла;
	//					
	//					Для Каждого Оплата Из Чек.Оплаты Цикл
	//						
	//						ОплатаЧекаККМ = МенеджерОфлайнОборудования.ПолучитьОплатуЧекаККМ();
	//						
	//						Если Оплата.ТипОплаты = 0 Тогда
	//							ОплатаЧекаККМ.СуммаНаличнойОплаты = ?(Оплата.Сумма > 0, Оплата.Сумма, -Оплата.Сумма);
	//						Иначе
	//							ОплатаЧекаККМ.СуммаЭлектроннойОплаты   = ?(Оплата.Сумма > 0, Оплата.Сумма, -Оплата.Сумма);
	//							ОплатаЧекаККМ.КодВидаЭлектроннойОплаты = Оплата.КодВидаОплаты;
	//						КонецЕсли;
	//							
	//						ЧекККМ.Оплаты.Добавить(ОплатаЧекаККМ);
	//						
	//					КонецЦикла;
	//					
	//					ОтчетОПродажахККМ.Чеки.Добавить(ЧекККМ);
	//					
	//				ИначеЕсли Чек.ТипОперацииККМ = "ВскрытиеТары" Тогда
	//					
	//					ВскрытиеТарыККМ = МенеджерОфлайнОборудования.ПолучитьВскрытиеТарыККМ();
	//					
	//					ВскрытиеТарыККМ.Дата  = Чек.ДатаЧека;
	//					ВскрытиеТарыККМ.Номер = Чек.НомерЧека;
	//					
	//					Для Каждого Товар Из Чек.Товары Цикл
	//						
	//						ТоварВскрытияККМ = МенеджерОфлайнОборудования.ПолучитьТоварВскрытияТарыККМ();
	//						
	//						ТоварВскрытияККМ.Код 		= Товар.Код;
	//						ТоварВскрытияККМ.Количество = Товар.Количество;
	//						ТоварВскрытияККМ.ШтрихкодАлкогольнойПродукции = Товар.ШтрихкодАлкогольнойПродукции;
	//						
	//						ВскрытиеТарыККМ.Товары.Добавить(ТоварЧекаККМ);
	//						
	//					КонецЦикла;
	//					
	//					ЗагружаемыеДанныеИзККМ.ВскрытияАлкогольнойТары.Добавить(ВскрытиеТарыККМ);
	//					
	//				ИначеЕсли Чек.ТипОперацииККМ = "Внесение" ИЛИ Чек.ТипОперацииККМ = "Выплата" Тогда
	//					
	//				КонецЕсли;
	//				
	//			КонецЕсли;
	//			
	//		КонецЦикла;
	//		
	//		ЗагружаемыеДанныеИзККМ.ОтчетыОПродажах.Добавить(ОтчетОПродажахККМ);
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	Если Результат Тогда
		ВыходныеПараметры.Добавить(ЗагружаемыеДанныеИзККМ);
	Иначе
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ТекстОшибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
