#Область ОписаниеПеременных

&НаКлиенте
Перем мТаймаутПодключения;     // Время отведенное на подключение Агента
&НаКлиенте
Перем мНачалоПодключения;      // Время начала подключения
&НаКлиенте
Перем мАктивныйАгент;          // Ссылка на Агент, активность которого проверяется
&НаКлиенте
Перем мСсылка;                 // Ссылка на Агента
&НаКлиенте
Перем мЗапускОтменен;          // Состояние запуска
&НаКлиенте
Перем мАдресАгента;            // Адрес Агента для локальных сообщений
&НаКлиенте
Перем мПортАгента;             // Порт Агента для локальных сообщений
&НаКлиенте
Перем мЛокальныеСообщения;     // Очередь локальных сообщений
&НаКлиенте
Перем мНачалоОперации;         // Время начала текущей операции
&НаКлиенте
Перем мДлительностьВыполнения; // Длительность выполнения сценария
&НаКлиенте
Перем мТаймаутОбработкиВРМ;    // Максимальное время выполнения операции
&НаКлиенте
Перем мСостояние;              // Текущее состояние тестирования
&НаКлиенте
Перем мСостояниеЗадания;       // Текущее состояние задания, возможные значения: кОжиданиеОтветаВРМ, Неопределено
&НаКлиенте
Перем мИмяСостояния;           // Текущее состояние тестирования в виде строки
&НаКлиенте
Перем мОперацияВРМ;            // Текущее состояние тестирования в виде строки
&НаКлиенте
Перем мСостоянияВРМ;           // Список ВРМ, которые ответили, что активны
&НаКлиенте
Перем мПредставленияВРМ;       // Соответствие, ключ - ссылка на ВРМ, значение - представление ВРМ
&НаКлиенте
Перем мТест;                   // Текущий тест
&НаКлиенте
Перем мСтарыйТест;             // Хранит предыдущий тест
&НаКлиенте
Перем мСценарий;               // Сценарий текущего теста
&НаКлиенте
Перем мЭтоДинамическийТест;    // Флаг, означающий, что текущий тест — динамический (ВРМ "старых" итераций не прекращают работу, когда ВРМ новой итерации подключаются к выполнению сценария)
&НаКлиенте
Перем мПродолжающиеРаботуВРМ;  // Массив ссылок на ВРМ, которые продолжают работу с предыдущих итераций
&НаКлиенте					   
Перем мВРМТаймаут;	 		   // Массив ВРМ, состоящий из ссылок на ВРМ, которые не успели ответить
&НаКлиенте
Перем мНомерИтерации;          // Номер текущей итерации теста
&НаКлиенте
Перем мКоэффициентИнтенсивности;
&НаКлиенте
Перем мНомераВРМ;
&НаКлиенте
Перем мВРМСценария;
&НаКлиенте
Перем мВРМСценарияБезРезерва;
&НаКлиенте
Перем мВРМСценарияБезПродолжающихРаботу;
&НаКлиенте
Перем мЗапущенныеВРМ;
&НаКлиенте
Перем кСтруктураВыполнения;
&НаКлиенте
Перем кПроверкаАктивности;
&НаКлиенте
Перем кПодготовка;
&НаКлиенте
Перем кИнициализация;
&НаКлиенте
Перем кВыполнение;
&НаКлиенте
Перем кЗаписьРезультатов;
&НаКлиенте
Перем кУдалениеДанных;
&НаКлиенте
Перем кЗапуститьВРМ;
&НаКлиенте
Перем кВРМЗапущены;
&НаКлиенте
Перем кГотовКРаботе;
&НаКлиенте
Перем кЗавершитьРаботу;
&НаКлиенте
Перем кОжиданиеОтветаВРМ;
&НаКлиенте
Перем кОтключениеНерабочихВРМ;
&НаКлиенте
Перем кВыполнить;
&НаКлиенте
Перем кОтменить;
&НаКлиенте
Перем кВыполненоУспешно;
&НаКлиенте
Перем кВыполненоСОшибкой;
&НаКлиенте
Перем кВключен;
&НаКлиенте
Перем мПредыдущаяФорма;
&НаКлиенте
Перем мПредыдущаяФормаОткрыта;
&НаКлиенте
Перем мПопыткаЗапуска;
&НаКлиенте
Перем мИсходныйЗаголовокКлиента;

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаКлиенте
// Обработчик открытия формы агента Тест-центра
//
Процедура ПриОткрытии(Отказ)
	
	Попытка
		мИсходныйЗаголовокКлиента = ПолучитьЗаголовокПриложения();
		ИмяЗапуститьВРМ = "Перечисление.ТЦСообщение.ЗапуститьВРМ";
		кЗапуститьВРМ = ПредопределенноеЗначение(ИмяЗапуститьВРМ);
		ИмяВРМЗапущены = "Перечисление.ТЦСообщение.ВРМЗапущены";
		кВРМЗапущены = ПредопределенноеЗначение(ИмяВРМЗапущены);
		ИмяПроверкаАктивности = "Перечисление.ТЦСообщение.ПроверкаАктивности";
		кПроверкаАктивности = ПредопределенноеЗначение(ИмяПроверкаАктивности);
		ИмяГотовКРаботе = "Перечисление.ТЦСообщение.ГотовКРаботе";
		кГотовКРаботе = ПредопределенноеЗначение(ИмяГотовКРаботе);
		ИмяЗавершитьРаботу = "Перечисление.ТЦСообщение.ЗавершитьРаботу";
		кЗавершитьРаботу = ПредопределенноеЗначение(ИмяЗавершитьРаботу);
		
		ИмяВыполнить = "Перечисление.ТЦСообщение.Выполнить";
		кВыполнить = ПредопределенноеЗначение(ИмяВыполнить);
		ИмяОтменить = "Перечисление.ТЦСообщение.Отменить";
		кОтменить = ПредопределенноеЗначение(ИмяОтменить);
		ИмяВыполненоУспешно = "Перечисление.ТЦСообщение.ВыполненоУспешно";
		кВыполненоУспешно = ПредопределенноеЗначение(ИмяВыполненоУспешно);
		ИмяВыполненоСОшибкой = "Перечисление.ТЦСообщение.ВыполненоСОшибкой";
		кВыполненоСОшибкой = ПредопределенноеЗначение(ИмяВыполненоСОшибкой);
		
		ИмяПодготовка = "Перечисление.ТЦСостояние.Подготовка";
		кПодготовка = ПредопределенноеЗначение(ИмяПодготовка);
		ИмяИнициализация = "Перечисление.ТЦСостояние.Инициализация";
		кИнициализация = ПредопределенноеЗначение(ИмяИнициализация);
		ИмяВыполнение = "Перечисление.ТЦСостояние.Выполнение";
		кВыполнение = ПредопределенноеЗначение(ИмяВыполнение);
		ИмяЗаписьРезультатов = "Перечисление.ТЦСостояние.ЗаписьРезультатов";
		кЗаписьРезультатов = ПредопределенноеЗначение(ИмяЗаписьРезультатов);
		ИмяУдалениеДанных = "Перечисление.ТЦСостояние.УдалениеДанных";
		кУдалениеДанных = ПредопределенноеЗначение(ИмяУдалениеДанных);
		мПредыдущаяФорма = Параметры.ПредыдущаяФорма;
		мПредыдущаяФормаОткрыта = Ложь;
		
		кОжиданиеОтветаВРМ = 1;
		
		Начало = ТекущаяДата();
		кВключен = Ложь;
		ВключитьРежимАгента();
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		ТЦОбщий.ЗаписатьВЖурнал(Ошибка, "Агент");
		ТЦКлиент.СообщитьОбОшибке(Ошибка, Начало, ТекущаяДата());
		
		Если Не ПустаяСтрока(мИсходныйЗаголовокКлиента)Тогда
			УстановитьЗаголовокПриложения(мИсходныйЗаголовокКлиента);
		КонецЕсли;
		
		ЗакрытьФормуАгента();
	КонецПопытки;
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
// Закрыть форму Агента
//
// Параметры:
//  Команда - необязательный
//
Процедура ЗакрытьФормуАгента(Команда = Неопределено)
	
	Попытка
		Закрыть();
		Форма = ОткрытьФорму(мПредыдущаяФорма,,,, ТЦКлиент.ОсновноеОкно());
		Форма.ОбновитьОтображениеДанных();
	Исключение
		ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "Агент", ПредопределенноеЗначение("Перечисление.ТЦСтатусСообщения.Предупреждение"));
	КонецПопытки;
	
КонецПроцедуры // ЗакрытьФормуАгента()

&НаКлиенте
// Проверить необходимость закрытия формы Агента
//
// Возвращаемое значение:
//  Булево - Истина, закрывать агента, ложь - не закрывать.
//
Функция ЗакрыватьАгента()
	
	Если кВключен Тогда
		//Текст = "Выполнение этой команды приведет к отключению режима Агента," +
		//		" завершению работы ВРМ Агента и завершению тестирования, в котором участвует Агент.
		//		|
		//		|Продолжить?";
		//
		//РезультатВопроса = Вопрос(
		//	Текст,
		//	РежимДиалогаВопрос.ДаНет,,
		//	КодВозвратаДиалога.Нет,
		//	"Тест-центр");
			
		////Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если Истина Тогда
			Попытка
				ЗакрытьАгента();
			Исключение
				ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "Агент");
			КонецПопытки;
			
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции // ЗакрыватьАгента()

&НаКлиенте
// Обработчик перед закрытием формы
//
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если кВключен Тогда
		Отказ = Не ЗакрыватьАгента();
	Иначе
		ОчиститьТипКлиентскогоПриложения();
	КонецЕсли;
	
	Если Не Отказ И Не ПустаяСтрока(мИсходныйЗаголовокКлиента)Тогда
		УстановитьЗаголовокПриложения(мИсходныйЗаголовокКлиента);
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

&НаКлиенте
// Обработка сообщений, адресуемых Агенту от фонового задания управления тестом
// Обработка выполняется каждую секунду
//
Процедура ОбработкаСообщений()
	
	Попытка
		Пока Истина Цикл
			Пакет = ТЦСервер.ПолучитьСообщение(Объект.Ссылка);
			
			Если Пакет = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			Сообщение = Пакет.Сообщение;
			
			Если Сообщение = кВыполнить Тогда
				мСостояние = Пакет.Параметры.Состояние;
				мИмяСостояния = ТЦСервер.ИмяПеречисления(мСостояние);
				РезультатВычисления = Вычислить(мИмяСостояния + "Выполнить(Пакет.Параметры)");
			ИначеЕсли Сообщение = кОтменить Тогда
				Если ЗначениеЗаполнено(мИмяСостояния) Тогда
					ЗавершитьРаботуВРМ();
					РезультатВычисления = Вычислить(мИмяСостояния + "Отменить(Пакет.Параметры)");
					ТЦСервер.УстановитьСтатусВыполненияТеста(Ложь);
				КонецЕсли;
			ИначеЕсли Сообщение = кЗавершитьРаботу Тогда
				ЗавершитьРаботу(Пакет.Параметры);
			КонецЕсли;
		КонецЦикла;
	Исключение
		ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "Агент");
		ТЦСервер.УстановитьСтатусВыполненияТеста(Ложь);
		ТЦСервер.ОтправитьСообщение(мТест, Объект.Ссылка, кВыполненоСОшибкой, "Агенту не удалось обработать сообщение от Тест-центра");
	КонецПопытки;
	
КонецПроцедуры // ОбработкаСообщений()

&НаКлиенте
// Обработчик приема локальных сообщений
//
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Попытка
		Пакет = ТЦСервер.РаспаковатьЛокальноеСообщение(Данные);
		Сообщение = Пакет.Сообщение;
		
		Если Сообщение = кГотовКРаботе Или Сообщение = кВыполненоУспешно Тогда
			
			// Игнорируем сообщения, относящиеся к отличным состояниям ВРМ
			Если мСостояние <> Пакет.Параметры.Состояние И Сообщение <> кГотовКРаботе Тогда
				Возврат;
			КонецЕсли;
			
			ВРМ = Пакет.Параметры.ВРМ;
			
			// Выгружаем ВРМ, которое ответило о готовности, но после таймаута (считаем такие ВРМ неработоспособными).
			Если Сообщение = кГотовКРаботе Тогда
				Индекс = мВРМТаймаут.Найти(ВРМ);
				Если Индекс <> Неопределено Тогда
					ЗавершаемоеВРМ = Новый Массив;
					ЗавершаемоеВРМ.Добавить(мВРМТаймаут[Индекс]);
					ЗавершитьРаботу(ЗавершаемоеВРМ);
					
					ОписаниеВРМ = мСостоянияВРМ[ВРМ];
					Если ОписаниеВРМ <> Неопределено Тогда
						мСостоянияВРМ.Удалить(ВРМ);
					КонецЕсли;
					
					Возврат;					
				КонецЕсли;				
			КонецЕсли;
			
			// Обрабатываем ответ ВРМ
			Если мСостояниеЗадания = кОжиданиеОтветаВРМ Тогда
				ОписаниеВРМ = мСостоянияВРМ[ВРМ];
				
				Если ОписаниеВРМ <> Неопределено Тогда
					Если Сообщение = кГотовКРаботе Тогда
						мЗапущенныеВРМ.Вставить(ВРМ);
						
						Если ОписаниеВРМ.Свойство("Запуск") Тогда
							ТЦСервер.ОтметитьЗапускВыполнен(ОписаниеВРМ.Запуск);
						КонецЕсли;
					КонецЕсли;
					
					ОписаниеВРМ.Выполнено = Истина;
					ОписаниеВРМ.Результат = Пакет.Параметры.Результат;
					
					// Добавим ВРМ в список продолжающих работу
					Если мСостояние = кВыполнение И мЭтоДинамическийТест Тогда
						
						Индекс = мПродолжающиеРаботуВРМ.Найти(ВРМ);
						Если Индекс = Неопределено Тогда
							мПродолжающиеРаботуВРМ.Добавить(ВРМ);
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Сообщение = кВыполненоСОшибкой Тогда
			
			// Отправляем данные об ошибке 
			ТЦСервер.ОтправитьСообщение(мТест, Объект.Ссылка, кВыполненоСОшибкой, Пакет.Параметры);
			
			// Отметим что ВРМ уже выполнил задание (несмотря на ошибку — успешность теста будет определять фоновое задание теста).
			Если мСостоянияВРМ[Пакет.Параметры.ВРМ] <> Неопределено Тогда
				мСостоянияВРМ[Пакет.Параметры.ВРМ].Выполнено = Истина;				
			КонецЕсли;
			
		КонецЕсли;
	Исключение
		ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "Агент");
		ТекстОшибки = "Агенту не удалось обработать локальное сообщение ВРМ." + Символы.ПС + "Подробности: " + Символы.ПС + ТЦОбщий.ИнформациюОбОшибкеВСтроку(ИнформацияОбОшибке());
		ТЦСервер.ОтправитьСообщение(мТест, Объект.Ссылка, кВыполненоСОшибкой, ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры // ВнешнееСобытие()

&НаКлиенте
// Обработка завершения ожидания проверки работоспособности Агента
// Обработка выполняется каждую секунду
//
Процедура ОжиданиеОтветаАктивногоАгента()
	
	ПроизошлаОшибка = Ложь;
	
	Попытка
		Сообщение = ТЦСервер.ПолучитьСообщение(мАктивныйАгент, мСсылка, Ложь);
		
		Если Сообщение = Неопределено Тогда
			ОтключитьОбработчикОжидания("ОжиданиеОтветаАктивногоАгента");
			Состояние = "Агент уже запущен. Запуск отменен.";
			Элементы.Завершено.Видимость = Ложь;
			мЗапускОтменен = Истина;
		Иначе
			Если ТекущаяДата() - мНачалоПодключения > мТаймаутПодключения Тогда
				ОтключитьОбработчикОжидания("ОжиданиеОтветаАктивногоАгента");
				ТЦСервер.ПолучитьСообщение(мАктивныйАгент, мСсылка);
				ДеактивироватьАгента(мАктивныйАгент);
				кВключен = Ложь;
				ВключитьРежимАгента();
			Иначе
				Завершено = Завершено + 1;
			КонецЕсли;
		КонецЕсли;
	Исключение
		ПроизошлаОшибка = Истина;
		ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "Агент");
		ОтключитьОбработчикОжидания("ОжиданиеОтветаАктивногоАгента");
		ТЦСервер.ОтправитьСообщение(мТест, Объект.Ссылка, кВыполненоСОшибкой, "Агенту не удалось инициализироваться");
	КонецПопытки;
	
	Если мЗапускОтменен ИЛИ ПроизошлаОшибка Тогда
		УстановитьЗаголовокПриложения(мИсходныйЗаголовокКлиента);
	КонецЕсли;
	
КонецПроцедуры // ОжиданиеОтветаАктивногоАгента()


///////////////////////////////////////////////////////////////////////////////
// РАБОТА С АГЕНТОМ

&НаКлиенте
// Закрыть Агента
//
// Параметры:
//  
//
Процедура ЗакрытьАгента() Экспорт
	
	Если Не мЗапускОтменен Тогда
		ЗавершитьРаботу(ТЦОбщий.СоответствиеВМассив(мЗапущенныеВРМ));
		ОтключитьРежимАгента();
		ТЦКлиент.ПереключитьРежимОпроса(Ложь);
		ТЦКлиент.ОтключитьЛокальныеСообщения(мЛокальныеСообщения);
		кВключен = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ЗакрытьАгента()

&НаСервере
// Инициализировать Агента
//
// Параметры:
//  ИмяКомпьютера - Строка, имя компьютера на котором запускается Агент
//
// Возвращаемое значение:
//  СправочникСсылка.ТЦАгенты - ссылка на создаваемый агент
//
Функция Инициализировать(ИмяКомпьютера, НомерСессии)
	
	ТекущийОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.ТЦАгенты"));
	ТекущийОбъект.Наименование = ИмяКомпьютера + "." + Формат(НомерСессии, "ЧГ=0");
	ТекущийОбъект.Компьютер = ТЦСервер.НайтиКомпьютер(ИмяКомпьютера);
	ТекущийОбъект.НомерСессии = НомерСессии;
	Ссылка = Справочники.ТЦАгенты.ПолучитьСсылку(Новый УникальныйИдентификатор);
	ТекущийОбъект.УстановитьСсылкуНового(Ссылка);
	ЗначениеВДанныеФормы(ТекущийОбъект, Объект);
	Возврат Ссылка;
	
КонецФункции // Инициализировать()
&НаКлиенте
// Зарегистрировать Агента в информационной базе
//
Процедура ЗарегистрироватьАгента(НомерСессии)
	
	Записать();
	ПодключитьОбработчикОжидания("ОбработкаСообщений", 3);
	Состояние = "Подключен";
	Элементы.Завершено.Видимость = Ложь;
	Завершено = 0;
	АдресПодключения = ТЦКлиент.АдресЛокальногоПодключения();
	мАдресАгента = ТЦКлиент.ЛокальныйАдресАгента(АдресПодключения);
	мПортАгента = ТЦКлиент.ПодключитьЛокальныеСообщения(мЛокальныеСообщения, мПортАгента);
	ТЦСервер.ЗаписатьПортАгента(Объект.Ссылка, мПортАгента);
	Объект.Порт = мПортАгента;
	мЗапущенныеВРМ = Новый Соответствие;
	кВключен = Истина;
	
	// Зарегистрировать агента в справочнике ТЦУправлениеТестом
	ТЦКлиент.ПереключитьРежимОпроса(Истина);
	ТЦСервер.УстановитьТипКлиентскогоПриложения(ПредопределенноеЗначение("Перечисление.ТЦТипКлиентскогоПриложения.АгентТЦ"));
	ТЦСервер.УстановитьСтатусВыполненияТеста(Ложь);
	
	// Установить заголовок
	УстановитьЗаголовокПриложения("Агент");	
	
КонецПроцедуры // ЗарегистрироватьАгента()

&НаСервере
// Удалить регистрацию Агента из справочника
//
// Параметры:
//  СправочникСсылка.ТЦАгенты - ссылка на удаляемого Агента
//
Процедура ДеактивироватьАгента(Агент)
	
	ТекущийОбъект = Агент.ПолучитьОбъект();
	
	Если ТекущийОбъект <> Неопределено Тогда
		ТЦСервер.УдалитьСообщенияАдресата(ТекущийОбъект.Ссылка);
		ТекущийОбъект.ОбменДанными.Загрузка = Истина;
		ТекущийОбъект.Удалить();
		
		// При завершении агента сбросить тип приложения в справочнике ТЦУправлениеТестированием.
		ОчиститьТипКлиентскогоПриложения();
	КонецЕсли;
	
КонецПроцедуры // ДеактивироватьАгента()

&НаКлиенте
// Включить режим агента в текущем клиенте
//
Процедура ВключитьРежимАгента()
	
	мТаймаутПодключения = 5;
	мЗапускОтменен = Ложь;
	Элементы.Завершено.МаксимальноеЗначение = мТаймаутПодключения;
	Элементы.Завершено.Видимость = Истина;
	Завершено = 0;
	Состояние = "Подключение...";
	
	Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
	ИмяКомпьютера = КипВнешнийКомпонент.ИмяЭтогоКомпьютера(Инструменты);
	НомерСессии = КипВнешнийКомпонент.НомерСессии(Инструменты);
	мСсылка = Инициализировать(ИмяКомпьютера, НомерСессии);
	мНачалоПодключения = ТекущаяДата();
	
	мАктивныйАгент = ТЦСервер.АгентЗапущен(ИмяКомпьютера, НомерСессии);
	
	Если мАктивныйАгент <> Неопределено Тогда
		ИмяЗначения = "Перечисление.ТЦСообщение.ПроверкаАктивности";
		Сообщение = ПредопределенноеЗначение(ИмяЗначения);
		ТЦСервер.ОтправитьСообщение(мАктивныйАгент, мСсылка, Сообщение);
		ПодключитьОбработчикОжидания("ОжиданиеОтветаАктивногоАгента", 3);
	Иначе
		ЗарегистрироватьАгента(НомерСессии);
	КонецЕсли;
	
КонецПроцедуры // ВключитьРежимАгента()



&НаСервере
// Отключить режим агента в текущем клиенте
//
Процедура ОтключитьРежимАгента()
	
	ДеактивироватьАгента(Объект.Ссылка);
	
КонецПроцедуры // ОтключитьРежимАгента()

&НаСервереБезКонтекста
// Сбросить тип клиентского приложения и очистить признак выполнения теста
Процедура ОчиститьТипКлиентскогоПриложения()
	
	ТЦСервер.УстановитьТипКлиентскогоПриложения(Перечисления.ТЦТипКлиентскогоПриложения.ПустаяСсылка());
	ТЦСервер.УстановитьСтатусВыполненияТеста(Ложь);
	
КонецПроцедуры



///////////////////////////////////////////////////////////////////////////////
// РАБОТА С ВРМ

&НаКлиенте
// Завершить работу ВРМ или Агента
//
// Параметры:
//  СписокВРМ
//
Процедура ЗавершитьРаботу(СписокВРМ)
	
	Если СписокВРМ = Неопределено Тогда
		// Завершить работу Агента
		ЗакрытьАгента();
		ЗавершитьРаботуСистемы(Ложь);
	Иначе
		// Завершить работу ВРМ
		АдресПодключения = ТЦКлиент.АдресЛокальногоПодключения();
		Пакет = ТЦСервер.ЗапаковатьЛокальноеСообщение(мАдресАгента, кЗавершитьРаботу);
		
		Для каждого ВРМ Из СписокВРМ Цикл
			Адрес = ТЦКлиент.ЛокальныйАдресВРМ(АдресПодключения, ВРМ);
			Порт = ТЦСервер.ЛокальныйПортВРМ(ВРМ);
			
			Попытка
				Если ТЦСервер.ВыгрузитьВРМ(ВРМ) Тогда
					КипВнешнийКомпонент.ОтправитьСообщение(мЛокальныеСообщения, Адрес, Порт, Пакет);
					мЗапущенныеВРМ.Удалить(ВРМ);
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ЗавершитьРаботу()

&НаКлиенте
// Выполнить подготовку ВРМ
//
// Параметры:
//  Параметры - Структура
//
Функция ПодготовкаВыполнить(ПараметрыСообщения)
	
	мСценарий	= ПараметрыСообщения.Сценарий;
	мТест		= ПараметрыСообщения.Тест;
	мПопыткаЗапуска = 1;
	мЭтоДинамическийТест	= ПараметрыСообщения.ЭтоДинамическийТест;
	мНомерИтерации			= ПараметрыСообщения.НомерИтерации;
	мКоэффициентИнтенсивности = ПараметрыСообщения.КоэффициентИнтенсивности;
	
	Если мСтарыйТест <> мТест Тогда
		мСтарыйТест = мТест;
		мВРМТаймаут = Новый Массив;
		Если мПредставленияВРМ = Неопределено Тогда
			мПредставленияВРМ = Новый Соответствие;
		КонецЕсли;
		
		// Инициализируем массив ВРМ, продолжающих работу
		Если мЭтоДинамическийТест Тогда
			мПродолжающиеРаботуВРМ = Новый Массив;
		КонецЕсли;
	КонецЕсли;
	
	мДлительностьВыполнения = ДлительностьВыполнения(мТест);
	
	мНомераВРМ		= Новый Соответствие;
	Инструменты		= КипВнешнийКомпонент.ПолучитьИнструменты();
	ИмяКомпьютера	= КипВнешнийКомпонент.ИмяЭтогоКомпьютера(Инструменты);
	НомерСессии		= КипВнешнийКомпонент.НомерСессии(Инструменты);
	
	// Получить список неподходящих ВРМ и выгрузить их
	ВыгружаемыеВРМ = ТЦСервер.ВРМВнеСценария(ИмяКомпьютера, НомерСессии);
	ЗавершитьРаботу(ВыгружаемыеВРМ);
	ЗапущенныеВРМ	= ТЦСервер.ЗапущенныеВРМ(ИмяКомпьютера, НомерСессии, мВРМТаймаут);
	
	ТЦСервер.УстановитьСтатусВыполненияТеста(Истина);
	ОбработатьВРМ(ЗапущенныеВРМ, "ОпросВРМ",, ТаймаутОпросаКлиента(мТест));
	
КонецФункции // ПодготовкаВыполнить()

&НаКлиенте
// Отменить подготовку ВРМ
//
// Параметры:
//  Параметры - Структура
//
Функция ПодготовкаОтменить(ПараметрыСообщения)
	
	

КонецФункции // ПодготовкаОтменить()

&НаКлиенте
// Отправить сообщение ВРМ с параметрами
//
// Параметры:
//  ВРМ - СправочникСсылка.ТЦВП
//  Сообщение - ПеречислениеСсылка.ТЦСообщение
//
Процедура ОтправитьСообщениеВРМ(ВРМ, Сообщение, Параметры = Неопределено)
	
	АдресПодключения = ТЦКлиент.АдресЛокальногоПодключения();
	Пакет = ТЦСервер.ЗапаковатьЛокальноеСообщение(мАдресАгента, Сообщение, Параметры);
	Адрес = ТЦКлиент.ЛокальныйАдресВРМ(АдресПодключения, ВРМ);
	Порт = ТЦСервер.ЛокальныйПортВРМ(ВРМ);
	
	Попытка 
		КипВнешнийКомпонент.ОтправитьСообщение(мЛокальныеСообщения, Адрес, Порт, Пакет);
	Исключение
		ТЦОбщий.ЗаписатьВЖурнал("Описание ошибки: " + ОписаниеОшибки() + Символы.ПС +
		                        "Локальный адрес агента: " + мАдресАгента + Символы.ПС +
		                        "Адрес получателя: " + Адрес + Символы.ПС
								, "ИсключениеПриОтправкеСообщенияАгентом");
	КонецПопытки;
	
КонецПроцедуры // ОтправитьСообщениеВРМ()

&НаКлиенте
// Выполнить опрос ВРМ
//
// Параметры:
//  ПараметрыОпроса - Структура
//    ВРМ - СправочникСсылка.ТЦВП
//    Параметры - Произвольный
//
Функция ОпросВРМ(ПараметрыОпроса)
	
	ОтправитьСообщениеВРМ(ПараметрыОпроса.ВРМ, кПроверкаАктивности);
	
КонецФункции // ОпросВРМ()

&НаКлиенте
// Обработчик выполнения опроса ВРМ
//
Функция ОпросВРМВыполнено()
	
	ПодготовитьКлиентыВРМ();
	ЗапуститьКлиентыВРМ();
	
КонецФункции // ОпросВРМВыполнено()

&НаКлиенте
// Обработчик выполнения опроса ВРМ
//
Функция ОпросВРМТаймаут(ВРМНеЗавершившиеОперацию = Неопределено)
	
	Для каждого ВРМ Из мСостоянияВРМ Цикл
		Если Не ВРМ.Значение.Выполнено Тогда
			ТЦСервер.УдалитьВРМ(ВРМ.Ключ);
			
			// Удаляем не ответивший ВРМ из списка ВРМ, продолжающих выполнение в динамическом тесте.
			Если мЭтоДинамическийТест Тогда
				Индекс = мПродолжающиеРаботуВРМ.Найти(ВРМ.Ключ);
				Если Индекс <> Неопределено Тогда
					мПродолжающиеРаботуВРМ.Удалить(Индекс);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПодготовитьКлиентыВРМ();
	ЗапуститьКлиентыВРМ();
	
КонецФункции // ОпросВРМТаймаут()

&НаКлиенте
// Запустить ВРМ
//
// Параметры:
//  ПараметрыОпроса - Структура
//    ВРМ - СправочникСсылка.ТЦВП
//    Параметры - Произвольный
//
Функция ЗапускВРМ(ПараметрыЗапуска)
	
	ВРМ = ПараметрыЗапуска.ВРМ;
	Ид = Строка(ВРМ.УникальныйИдентификатор());
	ПараметрыВРМ = ПараметрыЗапуска.Параметры[ВРМ];
	
	ТЦКлиент.ЗапуститьКлиента(ПараметрыВРМ.Клиент, ПараметрыВРМ.ПользовательЗапуска, Ид);
	
КонецФункции // ЗапускВРМ()

&НаКлиенте
// Запустить ВРМ
//
// Параметры:
//  ПараметрыОпроса - Структура
//    ВРМ - СправочникСсылка.ТЦВП
//    Параметры - Произвольный
//
Функция ЗапускВРМВыполнено()
	
	Для каждого СостояниеВРМ Из мСостоянияВРМ Цикл
		ТЦСервер.АктивироватьВРМ(СостояниеВРМ.Ключ);
	КонецЦикла;
	
	ЗапуститьКлиентыВРМ();
	
КонецФункции // ЗапускВРМВыполнено()

&НаСервереБезКонтекста
// Формирование описания таймаута ВРМ
//
// Параметры:
//  СостоянияВРМ - Соответствие
//  Тест - ДокументСсылка.ТЦТест
//  мПредставленияВРМ - Соответствие
//  Сообщение - Строка
//  ИмяКомпьютераАгента - Строка
//  ВРМНеЗавершившиеРаботу - Массив - в него будут записаны ссылки на ВРМ,
//									  которым не удалось закончить операцию за отведенное время
//
// Возвращаемое значение:
//  Строка - описание таймаута и списка ВРМ
//
Функция ОписаниеТаймаутаВРМ(СостоянияВРМ, мПредставленияВРМ, Тест, Знач Сообщение, ИмяКомпьютераАгента, ВРМНеЗавершившиеОперацию)
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ВРМ", Новый ОписаниеТипов("СправочникСсылка.ТЦВП"));
	
	Для каждого СостояниеВРМ Из СостоянияВРМ Цикл
		СтрокаТаблицы = Таблица.Добавить();
		СтрокаТаблицы.ВРМ = СостояниеВРМ.Ключ;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаВРМ", Таблица);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаСсылокВРМ.ВРМ КАК ВРМ
	               |ПОМЕСТИТЬ ТаблицаВРМ
	               |ИЗ
	               |	&ТаблицаВРМ КАК ТаблицаСсылокВРМ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаВРМ.ВРМ КАК ВРМ,
	               |	ПРЕДСТАВЛЕНИЕ(ТаблицаВРМ.ВРМ) КАК ПредставлениеВРМ,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТЦВП.Ссылка, ИСТИНА) = ИСТИНА
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК НеНайден
	               |ИЗ
	               |	ТаблицаВРМ КАК ТаблицаВРМ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТЦВП КАК ТЦВП
	               |		ПО ТаблицаВРМ.ВРМ = ТЦВП.Ссылка";
				   
	ВРМНеЗавершившиеОперацию = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	ВесОшибки = 0;
	Пока Выборка.Следующий() Цикл
		ВРМ = СостоянияВРМ[Выборка.ВРМ];
		Если Не ВРМ.Выполнено Тогда
			ВРМНеЗавершившиеОперацию.Добавить(Выборка.ВРМ);
			ВесОшибки = ВесОшибки + 1;
			
			ПредставлениеВРМ = мПредставленияВРМ.Получить(Выборка.ВРМ);
			Если Выборка.НеНайден = Ложь ИЛИ ПредставлениеВРМ = Неопределено Тогда
				ПредставлениеВРМ = Выборка.ПредставлениеВРМ;
			Иначе
				ПредставлениеВРМ = ПредставлениеВРМ + " (ВРМ не найден, представление взято из кэша)";
			КонецЕсли;
			
			Сообщение = Сообщение + "
				| - " + ПредставлениеВРМ;
		КонецЕсли;
	КонецЦикла;
	
	ОписаниеОшибки = Новый Структура;
	ОписаниеОшибки.Вставить("Результат", Сообщение);
	ОписаниеОшибки.Вставить("ВесОшибки", ВесОшибки);
	
	Возврат ОписаниеОшибки;
	
КонецФункции // ОписаниеТаймаутаВРМ()

&НаКлиенте
// Запустить ВРМ
//
// Параметры:
//  ПараметрыОпроса - Структура
//    ВРМ - СправочникСсылка.ТЦВП
//    Параметры - Произвольный
//
Функция ЗапускВРМТаймаут(ВРМНеЗавершившиеОперацию)
	
	// Добавим не ответившие ВРМ в массив
	Для Каждого ЭлементСостояния Из мСостоянияВРМ Цикл
		Если ЭлементСостояния.Значение.Выполнено = Ложь Тогда
			мВРМТаймаут.Добавить(ЭлементСостояния.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Если мПопыткаЗапуска < ПопытокЗапускаКлиентов(мТест) Тогда
		ЗапуститьКлиентыВРМ();
		мПопыткаЗапуска = мПопыткаЗапуска + 1;
	Иначе
		Сообщение = "Следующие ВРМ не удалось запустить до истечения таймаута запуска клиента (" + ТаймаутЗапускаКлиента(мТест) + " с):";
		Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
		ИмяКомпьютера = КипВнешнийКомпонент.ИмяЭтогоКомпьютера(Инструменты);
		
		ПараметрыСообщения  = ПараметрыСообщенияОТаймауте();
		ЗаполнитьЗначенияСвойств(ПараметрыСообщения, ОписаниеТаймаутаВРМ(мСостоянияВРМ, мПредставленияВРМ, мТест, Сообщение, ИмяКомпьютера, ВРМНеЗавершившиеОперацию));
		Возврат ПараметрыСообщения;
	КонецЕсли;
	
КонецФункции // ЗапускВРМТаймаут()

&НаКлиенте
// Загрузить сценарий для ВРМ
//
// Параметры:
//  
//
Функция ЗагрузкаВРМ(ПараметрыЗагрузки)
	
	ПараметрыВРМ = Новый Структура;
	ПараметрыВРМ.Вставить("НомерВРМ", мНомераВРМ[ПараметрыЗагрузки.ВРМ]);
	ПараметрыВРМ.Вставить("Сценарий", мСценарий);
	ПараметрыВРМ.Вставить("КоэффициентИнтенсивности", мКоэффициентИнтенсивности);
	ПараметрыСообщения = ПараметрыСообщенияДляВРМ(кПодготовка, ПараметрыВРМ);
	ОтправитьСообщениеВРМ(ПараметрыЗагрузки.ВРМ, кВыполнить, ПараметрыСообщения);
	
КонецФункции // ЗагрузкаВРМ()

&НаКлиенте
// 
//
// Параметры:
//  
//
Функция ЗагрузкаВРМВыполнено()
	
	Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
	ИмяКомпьютера = КипВнешнийКомпонент.ИмяЭтогоКомпьютера(Инструменты);
	НомерСессии = КипВнешнийКомпонент.НомерСессии(Инструменты);
	
	мВРМСценарияБезРезерва = ТЦСервер.ЗапущенныеВРМБезРезерва(ИмяКомпьютера, НомерСессии, мВРМТаймаут, ТЦОбщий.СоответствиеВМассив(мЗапущенныеВРМ));
	ТЦСервер.ОбновитьПредставленияВРМ(мПредставленияВРМ, ИмяКомпьютера, НомерСессии);
	ТЦСервер.ОтправитьСообщение(мТест, Объект.Ссылка, кВыполненоУспешно);
	
КонецФункции // ЗагрузкаВРМВыполнено()

&НаКлиенте
// 
//
// Параметры:
//  
//
Функция ЗагрузкаВРМТаймаут(ВРМНеЗавершившиеОперацию)
	
	Сообщение = "Следующие ВРМ не удалось настроить до истечения таймаута загрузки сценария клиентом (" + ТаймаутЗагрузкиСценарияКлиентом(мТест) + " с):";
	Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
	ИмяКомпьютера = КипВнешнийКомпонент.ИмяЭтогоКомпьютера(Инструменты);
	
	ПараметрыСообщения  = ПараметрыСообщенияОТаймауте();
	ЗаполнитьЗначенияСвойств(ПараметрыСообщения, ОписаниеТаймаутаВРМ(мСостоянияВРМ, мПредставленияВРМ, мТест, Сообщение, ИмяКомпьютера, ВРМНеЗавершившиеОперацию));
	Возврат ПараметрыСообщения;
	
КонецФункции // ЗагрузкаВРМТаймаут()

&НаКлиенте
// Выполнить инициализацию ВП
//
// Параметры:
//  Параметры - Структура
//
Функция ИнициализацияВыполнить(ПараметрыСообщения)
	
	Если Не мЭтоДинамическийТест Тогда
		ОбработатьВРМ(мВРМСценария, "ИнициализироватьВРМ",, ТаймаутИнициализации(мТест));
	Иначе
		
		// Если текущий тест — динамический, то команду инициализации дадим только новым ВРМ.
		мВРМСценарияБезПродолжающихРаботу = Новый Массив;
		
		Для Каждого ТекущийВРМ Из мВРМСценария Цикл
			
			Индекс = мПродолжающиеРаботуВРМ.Найти(ТекущийВРМ);
			Если Индекс = Неопределено Тогда
				мВРМСценарияБезПродолжающихРаботу.Добавить(ТекущийВРМ);
			КонецЕсли;
			
		КонецЦикла;
		
		ОбработатьВРМ(мВРМСценарияБезПродолжающихРаботу, "ИнициализироватьВРМ",, ТаймаутИнициализации(мТест));
		
	КонецЕсли;
	
КонецФункции // ВыполнитьИнициализацию()

&НаКлиенте
// 
//
// Параметры:
//  
//
Функция ИнициализироватьВРМ(ПараметрыИнициализации)
	
	ПараметрыВРМ = ПараметрыСообщенияДляВРМ(кИнициализация);
	ОтправитьСообщениеВРМ(ПараметрыИнициализации.ВРМ, кВыполнить, ПараметрыВРМ);
	
КонецФункции // ИнициализироватьВРМ()

&НаКлиенте
// 
//
// Параметры:
//  
//
Функция ИнициализироватьВРМВыполнено()
	
	ТЦСервер.ОтправитьСообщение(мТест, Объект.Ссылка, кВыполненоУспешно);
	
КонецФункции // ИнициализироватьВРМ()

&НаКлиенте
// 
//
// Параметры:
//  
//
Функция ИнициализироватьВРМТаймаут(ВРМНеЗавершившиеОперацию)
	
	Сообщение = "Следующие ВРМ не удалось инициализировать до истечения таймаута инициализации (" + ТаймаутИнициализации(мТест) + " с):";
	Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
	ИмяКомпьютера = КипВнешнийКомпонент.ИмяЭтогоКомпьютера(Инструменты);
	
	ПараметрыСообщения  = ПараметрыСообщенияОТаймауте();
	ЗаполнитьЗначенияСвойств(ПараметрыСообщения, ОписаниеТаймаутаВРМ(мСостоянияВРМ, мПредставленияВРМ, мТест, Сообщение, ИмяКомпьютера, ВРМНеЗавершившиеОперацию));
	Возврат ПараметрыСообщения;
	
КонецФункции // ИнициализироватьВРМТаймаут()

&НаКлиенте
// Отменить инициализацию ВП
//
// Параметры:
//  Параметры - Структура
//
Функция ИнициализацияОтменить(ПараметрыСообщения)
	
	
	
КонецФункции // ИнициализацияОтменить()

&НаКлиенте
// Выполнить процесс тестирования
//
// Параметры:
//  Параметры - Структура
//
Функция ВыполнениеВыполнить(ПараметрыВыполнения)
	
	ОбработатьВРМ(мВРМСценарияБезРезерва, "ВыполнитьВРМ",, ТаймаутВыполнения(мТест));
	
КонецФункции // ВыполнениеВыполнить()

&НаКлиенте
// 
//
// Параметры:
//  
//
Функция ВыполнитьВРМ(ПараметрыВыполнения)
	
	ПараметрыВРМ = ПараметрыСообщенияДляВРМ(кВыполнение);
	ОтправитьСообщениеВРМ(ПараметрыВыполнения.ВРМ, кВыполнить, ПараметрыВРМ);
	
КонецФункции // ВыполнитьВРМ()

&НаКлиенте
// 
//
// Параметры:
//  
//
Функция ВыполнитьВРМВыполнено()
	
	ТЦСервер.ОтправитьСообщение(мТест, Объект.Ссылка, кВыполненоУспешно);
	
КонецФункции // ВыполнитьВРМВыполнено()

&НаКлиенте
// 
//
// Параметры:
//  
//
Функция ВыполнитьВРМТаймаут(ВРМНеЗавершившиеОперацию)
	
	Сообщение = "Следующим ВРМ не удалось выполнить действия до истечения таймаута выполнения (" + ТаймаутВыполнения(мТест) + " с):";
	Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
	ИмяКомпьютера = КипВнешнийКомпонент.ИмяЭтогоКомпьютера(Инструменты);
	
	ПараметрыСообщения  = ПараметрыСообщенияОТаймауте();
	ЗаполнитьЗначенияСвойств(ПараметрыСообщения, ОписаниеТаймаутаВРМ(мСостоянияВРМ, мПредставленияВРМ, мТест, Сообщение, ИмяКомпьютера, ВРМНеЗавершившиеОперацию));
	Возврат ПараметрыСообщения;
	
КонецФункции // ВыполнитьВРМТаймаут()

&НаКлиенте
// Отменить процесс тестирования
//
// Параметры:
//  Параметры - Структура
//
Функция ВыполнениеОтменить(ПараметрыСообщения)
	
	
	
КонецФункции // ВыполнениеОтменить()

&НаКлиенте
// Выполнить запись результатов
//
// Параметры:
//  Параметры - Структура
//
Функция ЗаписьРезультатовВыполнить(ПараметрыСообщения)
	
	ОбработатьВРМ(мВРМСценария, "ЗаписатьВРМ",, ТаймаутЗаписиРезультатов(мТест));
	
КонецФункции // ЗаписьРезультатовВыполнить()

&НаКлиенте
// 
//
// Параметры:
//  
//
Функция ЗаписатьВРМ(ПараметрыЗаписи)
	
	ПараметрыВРМ = ПараметрыСообщенияДляВРМ(кЗаписьРезультатов);
	ОтправитьСообщениеВРМ(ПараметрыЗаписи.ВРМ, кВыполнить, ПараметрыВРМ);
	
КонецФункции // ЗаписатьВРМ()

&НаКлиенте
// 
//
// Параметры:
//  
//
Функция ЗаписатьВРМВыполнено()
	
	ТЦСервер.ОтправитьСообщение(мТест, Объект.Ссылка, кВыполненоУспешно, мСостоянияВРМ);
	
КонецФункции // ЗаписатьВРМВыполнено()

&НаКлиенте
// 
//
// Параметры:
//  
//
Функция ЗаписатьВРМТаймаут(ВРМНеЗавершившиеОперацию)
	
	Сообщение = "Следующим ВРМ не удалось записать результаты до истечения таймаута записи результатов (" + ТаймаутЗаписиРезультатов(мТест) + " с):";
	Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
	ИмяКомпьютера = КипВнешнийКомпонент.ИмяЭтогоКомпьютера(Инструменты);
	
	ПараметрыСообщения  = ПараметрыСообщенияОТаймауте();
	ЗаполнитьЗначенияСвойств(ПараметрыСообщения, ОписаниеТаймаутаВРМ(мСостоянияВРМ, мПредставленияВРМ, мТест, Сообщение, ИмяКомпьютера, ВРМНеЗавершившиеОперацию));
	Возврат ПараметрыСообщения;
	
КонецФункции // ЗаписатьВРМТаймаут()

&НаКлиенте
// Отменить запись  результатов
//
// Параметры:
//  Параметры - Структура
//
Функция ЗаписьРезультатовОтменить(ПараметрыСообщения)
	
	
	
КонецФункции // ЗаписьРезультатовОтменить()

&НаКлиенте
// Выполнить удаление ранее созданных данных
//
// Параметры:
//  Параметры - Структура
//
Функция УдалениеДанныхВыполнить(ПараметрыСообщения)
	
	ОбработатьВРМ(мВРМСценария, "УдалитьДанные",, ТаймаутУдаленияДанных(мТест));
	
КонецФункции // УдалениеДанныхВыполнить()

&НаКлиенте
// 
//
// Параметры:
//  
//
Функция УдалитьДанные(ПараметрыУдаления)
	
	ПараметрыВРМ = ПараметрыСообщенияДляВРМ(кУдалениеДанных);
	ОтправитьСообщениеВРМ(ПараметрыУдаления.ВРМ, кВыполнить, ПараметрыВРМ);
	
КонецФункции // УдалитьДанные()

&НаКлиенте
// 
//
// Параметры:
//  
//
Функция УдалитьДанныеВыполнено()
	
	УдалитьДанныеВыполненоНаСервере(мТест, Объект.Ссылка, кВыполненоУспешно);
	
КонецФункции // УдалитьДанныеВыполнено()

&НаСервереБезКонтекста
Функция УдалитьДанныеВыполненоНаСервере(Получатель, Отправитель, Сообщение)
	
	ТЦСервер.ОтправитьСообщение(Получатель, Отправитель, Сообщение);
	ТЦСервер.УстановитьСтатусВыполненияТеста(Ложь);
	
КонецФункции

&НаКлиенте
// 
//
// Параметры:
//  
//
Функция УдалитьДанныеТаймаут(ВРМНеЗавершившиеОперацию)
	
	Сообщение = "Следующим ВРМ не удалось удалить данные до истечения таймаута удаления данных (" + ТаймаутУдаленияДанных(мТест) + " с):";
	Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
	ИмяКомпьютера = КипВнешнийКомпонент.ИмяЭтогоКомпьютера(Инструменты);
	
	ПараметрыСообщения  = ПараметрыСообщенияОТаймауте();
	ЗаполнитьЗначенияСвойств(ПараметрыСообщения, ОписаниеТаймаутаВРМ(мСостоянияВРМ, мПредставленияВРМ, мТест, Сообщение, ИмяКомпьютера, ВРМНеЗавершившиеОперацию));
	Возврат ПараметрыСообщения;
	
КонецФункции // УдалитьДанныеТаймаут()

&НаКлиенте
// Отменить удаление ранее созданных данных
//
// Параметры:
//  Параметры - Структура
//
Функция УдалениеДанныхОтменить(ПараметрыСообщения)
	
	
	
КонецФункции // УдалениеДанныхОтменить()

&НаСервереБезКонтекста
// Получить длительность выполнения сценария
//
// Параметры:
//  Тест
//
// Возвращаемое значение:
//  Число - длительность выполнения сценария
//
Функция ДлительностьВыполнения(Тест)
	
	НачатьТранзакцию();
	Значение = Тест.ДлительностьВыполнения;
	ЗафиксироватьТранзакцию();
	Возврат Значение;
	
КонецФункции // ДлительностьВыполнения()

&НаСервереБезКонтекста
// Получить максимальное число попыток запуска клиентов из настроек теста
//
// Параметры:
//  Тест
//
// Возвращаемое значение:
//  Число - число попыток
//
Функция ПопытокЗапускаКлиентов(Тест)
	
	НачатьТранзакцию();
	Значение = Тест.ПопытокЗапускаКлиентов;
	ЗафиксироватьТранзакцию();
	Возврат Значение;
	
КонецФункции // ПопытокЗапускаКлиентов

&НаСервереБезКонтекста
// Получить таймаут подготовки из настроек теста
//
// Параметры:
//  Тест
//
// Возвращаемое значение:
//  Число - таймаут подготовки
//
Функция ТаймаутЗапускаКлиента(Тест)
	
	НачатьТранзакцию();
	Значение = Тест.ТаймаутЗапускаКлиента;
	ЗафиксироватьТранзакцию();
	Возврат Значение;
	
КонецФункции // ТаймаутЗапускаКлиента()

&НаСервереБезКонтекста
// Получить таймаут опроса клиента
//
// Параметры:
//  Тест
//
// Возвращаемое значение:
//  Число - таймаут опроса
//
Функция ТаймаутОпросаКлиента(Тест)
	
	НачатьТранзакцию();
	Значение = Тест.ТаймаутОпросаКлиента;
	ЗафиксироватьТранзакцию();
	Возврат Значение;
	
КонецФункции // ТаймаутОпросаКлиента()

&НаСервереБезКонтекста
// Получить таймаут загрузки сценария клиентом
//
// Параметры:
//  Тест
//
// Возвращаемое значение:
//  Число - таймаут загрузки сценария
//
Функция ТаймаутЗагрузкиСценарияКлиентом(Тест)
	
	НачатьТранзакцию();
	Значение = Тест.ТаймаутЗагрузкиСценарияКлиентом;
	ЗафиксироватьТранзакцию();
	Возврат Значение;
	
КонецФункции // ТаймаутЗагрузкиСценарияКлиентом()

&НаСервереБезКонтекста
// Получить таймаут инициализации
//
// Параметры:
//  Тест
//
// Возвращаемое значение:
//  Число - таймаут загрузки сценария
//
Функция ТаймаутИнициализации(Тест)
	
	НачатьТранзакцию();
	Значение = Тест.ТаймаутИнициализации;
	ЗафиксироватьТранзакцию();
	Возврат Значение;
	
КонецФункции // ТаймаутИнициализации()

&НаСервереБезКонтекста
// Получить таймаут выполнения
//
// Параметры:
//  Тест
//
// Возвращаемое значение:
//  Число - таймаут загрузки сценария
//
Функция ТаймаутВыполнения(Тест)
	
	НачатьТранзакцию();
	Значение = Тест.ТаймаутВыполнения;
	ЗафиксироватьТранзакцию();
	Возврат Значение;
	
КонецФункции // ТаймаутВыполнения()

&НаСервереБезКонтекста
// Получить таймаут записи результатов
//
// Параметры:
//  Тест
//
// Возвращаемое значение:
//  Число - таймаут загрузки сценария
//
Функция ТаймаутЗаписиРезультатов(Тест)
	
	НачатьТранзакцию();
	Значение = Тест.ТаймаутЗаписиРезультатов;
	ЗафиксироватьТранзакцию();
	Возврат Значение;
	
КонецФункции // ТаймаутЗаписиРезультатов()

&НаСервереБезКонтекста
// Получить таймаут удаления данных
//
// Параметры:
//  Тест
//
// Возвращаемое значение:
//  Число - таймаут загрузки сценария
//
Функция ТаймаутУдаленияДанных(Тест)
	
	НачатьТранзакцию();
	Значение = Тест.ТаймаутУдаленияДанных;
	ЗафиксироватьТранзакцию();
	Возврат Значение;
	
КонецФункции // ТаймаутУдаленияДанных()

&НаКлиенте
// Подготовить виртуальных пользователей к запуску
//
Процедура ПодготовитьКлиентыВРМ()
	
	Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
	Компьютер = КипВнешнийКомпонент.ИмяЭтогоКомпьютера(Инструменты);
	НомерСессии = КипВнешнийКомпонент.НомерСессии(Инструменты);
	
	// Получить список подходящих ВРМ и отметить, как уже запущенные
	мНомераВРМ = ТЦСервер.ПереиспользоватьВРМ(Компьютер, НомерСессии);
	
КонецПроцедуры // ПодготовитьКлиентыВРМ()

&НаКлиенте
// Запустить клиентские приложения ВРМ
//
// Параметры:
//  
//
Процедура ЗапуститьКлиентыВРМ()
	
	Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
	ИмяЭтогоКомпьютера = КипВнешнийКомпонент.ИмяЭтогоКомпьютера(Инструменты);
	НомерСессии = КипВнешнийКомпонент.НомерСессии(Инструменты);
	НеобходимыеВРМ = ТЦСервер.НеЗапущенныеВРМ(ИмяЭтогоКомпьютера, НомерСессии, 10);
	
	// Если все ВРМ запущены и отвечают
	Если НеобходимыеВРМ.Количество() = 0 Тогда
		ТЦСервер.ОбновитьПредставленияВРМ(мПредставленияВРМ, ИмяЭтогоКомпьютера, НомерСессии);
		ЗагрузитьВРМ();
		Возврат;
	КонецЕсли;
	
	СписокВРМ = Новый Массив;
	ПараметрыЗапуска = Новый Соответствие;
	
	Для каждого ВРМ Из НеобходимыеВРМ Цикл
		Ид = Строка(Новый УникальныйИдентификатор);
		Ссылка = ТЦСервер.СсылкаПоИдентификатору(Ид, "Справочники", "ТЦВП");
		СписокВРМ.Добавить(Ссылка);
		мНомераВРМ[Ссылка] = ВРМ.Номер;
		
		ОписаниеПараметров = Новый Структура;
		ОписаниеПараметров.Вставить("Клиент", ВРМ.Клиент);
		ОписаниеПараметров.Вставить("Пользователь", ВРМ.Пользователь);
		ОписаниеПараметров.Вставить("ПользовательЗапуска", ВРМ.Клон);
		ОписаниеПараметров.Вставить("Запуск", ВРМ.Запуск);
		ПараметрыЗапуска.Вставить(Ссылка, ОписаниеПараметров);
	КонецЦикла;
	
	ОбработатьВРМ(СписокВРМ, "ЗапускВРМ", ПараметрыЗапуска, ТаймаутЗапускаКлиента(мТест));
	
КонецПроцедуры // ЗапуститьКлиентыВРМ()

&НаКлиенте
// Загрузить ВРМ сценария
//
Процедура ЗагрузитьВРМ()
	
	Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
	ИмяКомпьютера = КипВнешнийКомпонент.ИмяЭтогоКомпьютера(Инструменты);
	НомерСессии = КипВнешнийКомпонент.НомерСессии(Инструменты);
	МассивЗапущенныхВРМ = ТЦОбщий.СоответствиеВМассив(мЗапущенныеВРМ);	
	
	мВРМСценария = ТЦСервер.ЗапущенныеВРМ(ИмяКомпьютера, НомерСессии, мВРМТаймаут, МассивЗапущенныхВРМ);
	ТЦСервер.ЗагрузитьВРМ(ИмяКомпьютера, НомерСессии, МассивЗапущенныхВРМ);
	
	ОбработатьВРМ(мВРМСценария, "ЗагрузкаВРМ",, ТаймаутЗагрузкиСценарияКлиентом(мТест));
	
КонецПроцедуры // ЗагрузитьВРМ()

&НаКлиенте
// Для каждого ВРМ выполнить указанную операцию
//
// Параметры:
//  СписокВРМ - Массив (СправочникСсылка.ТЦВП)
//  ОперацияВРМ - Строка, наименование операции
//  ПараметрыОперацииВРМ - Произвольный
//  ТаймаутОбработкиВРМ - Число, максимальное время ожидания ответа
//
Процедура ОбработатьВРМ(СписокВРМ,
                        ОперацияВРМ,
                        ПараметрыОперацииВРМ = Неопределено,
                        ТаймаутОбработкиВРМ)
						
	мСостоянияВРМ = Новый Соответствие;
	
	Для каждого ВРМ Из СписокВРМ Цикл

		ПараметрыВызова = Новый Структура;
		ПараметрыВызова.Вставить("ВРМ", ВРМ);
		ПараметрыВызова.Вставить("Параметры", ПараметрыОперацииВРМ);
		
		РезультатВычисления = Вычислить(ОперацияВРМ + "(ПараметрыВызова)");
		
		СостояниеВРМ = Новый Структура;
		СостояниеВРМ.Вставить("Выполнено", Ложь);
		СостояниеВРМ.Вставить("Результат");
		СостояниеВРМ.Вставить("НомерВРМ", мНомераВРМ[ВРМ]);
		
		Если ОперацияВРМ = "ЗапускВРМ" Тогда
			СостояниеВРМ.Вставить("Пользователь", ПараметрыОперацииВРМ[ВРМ].Пользователь);
			СостояниеВРМ.Вставить("Запуск", ПараметрыОперацииВРМ[ВРМ].Запуск);
		КонецЕсли;
		
		мСостоянияВРМ.Вставить(ВРМ, СостояниеВРМ);
		
	КонецЦикла;
	
	мНачалоОперации = ТекущаяДата();
	мТаймаутОбработкиВРМ = ТаймаутОбработкиВРМ;
	мОперацияВРМ = ОперацияВРМ;
	мСостояниеЗадания = кОжиданиеОтветаВРМ;
	ПодключитьОбработчикОжидания("ОжиданиеОтветаВРМ", 1);
	
КонецПроцедуры // ОбработатьВРМ()

&НаКлиенте
// Сообщить всем ВРМ о необходимости завершить работу
//
Процедура ЗавершитьРаботуВРМ()
	
	Инструменты = КипВнешнийКомпонент.ПолучитьИнструменты();
	
	Если мВРМСценария <> Неопределено Тогда
		Для каждого ВРМ Из мВРМСценария Цикл
			Порт = ТЦСервер.ЛокальныйПортВРМ(ВРМ);
			Попытка
				КипВнешнийКомпонент.ЗавершитьВыполнение(Инструменты, Порт);
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ЗавершитьРаботуВРМ()

&НаКлиенте
// Удаляет ссылки на не ответившие ВРМ из различных массивов ВРМ
Процедура УдалитьВРМИзМассивов(ВРМНеЗавершившиеОперацию)
	
	НаборМассивов = Новый Массив;
	НаборМассивов.Добавить(мВРМСценария);
	НаборМассивов.Добавить(мВРМСценарияБезРезерва);
	НаборМассивов.Добавить(мВРМСценарияБезПродолжающихРаботу);
	НаборМассивов.Добавить(мПродолжающиеРаботуВРМ);
	
	Для Каждого ТекущийМассив Из НаборМассивов Цикл
		
		Если ТекущийМассив = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого НеОтветившийВРМ Из ВРМНеЗавершившиеОперацию Цикл
			Индекс = ТекущийМассив.Найти(НеОтветившийВРМ);
			Если Индекс <> Неопределено Тогда
				ТекущийМассив.Удалить(Индекс);
			КонецЕсли;			
		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
// Ожидать ответа от ВРМ на посланное ранее сообщение
//
Процедура ОжиданиеОтветаВРМ()
	
	ПараметрыСообщенияОТаймауте = Неопределено;
	ВРМНеЗавершившиеОперацию	= Новый Массив;
	
	Попытка
		Если ВсеВРМОтветили(мСостоянияВРМ) Тогда
			ОтключитьОбработчикОжидания("ОжиданиеОтветаВРМ");
			мСостояниеЗадания = Неопределено;
			РезультатВычисления = Вычислить(мОперацияВРМ + "Выполнено()");
		Иначе
			Если мДлительностьВыполнения > 0 Тогда
				Если ТекущаяДата() - мНачалоОперации > мДлительностьВыполнения Тогда
					ЗавершитьРаботуВРМ();
					мДлительностьВыполнения = 0;
				КонецЕсли;
			КонецЕсли;
			
			Если ТекущаяДата() - мНачалоОперации > мТаймаутОбработкиВРМ Тогда
				мСостояниеЗадания = Неопределено;
				ПараметрыСообщенияОТаймауте = Вычислить(мОперацияВРМ + "Таймаут(ВРМНеЗавершившиеОперацию)");
			КонецЕсли;
		КонецЕсли;
	Исключение
		ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "Агент");
		ТекстОшибки = "Агент не смог получить или обработать ответ ВРМ:" + Символы.ПС + ТЦОбщий.ИнформациюОбОшибкеВСтроку(ИнформацияОбОшибке());
		ТЦСервер.ОтправитьСообщение(мТест, Объект.Ссылка, кВыполненоСОшибкой, ТекстОшибки);
		Возврат;
	КонецПопытки;
	
	Если ПараметрыСообщенияОТаймауте <> Неопределено Тогда
		ОтключитьОбработчикОжидания("ОжиданиеОтветаВРМ");
		ТЦСервер.ОтправитьСообщение(мТест, Объект.Ссылка, кВыполненоСОшибкой, ПараметрыСообщенияОТаймауте);
		
		// Попытаемся выгрузить ВРМ, которым не удалось завершить операцию
		ЗавершитьРаботу(ВРМНеЗавершившиеОперацию);
		Для Каждого ТекущийВРМ Из ВРМНеЗавершившиеОперацию Цикл
			ОписаниеВРМ = мСостоянияВРМ[ТекущийВРМ];
			Если ОписаниеВРМ <> Неопределено Тогда
				мСостоянияВРМ.Удалить(ТекущийВРМ);
			КонецЕсли;
			
		КонецЦикла;
		
		УдалитьВРМИзМассивов(ВРМНеЗавершившиеОперацию);
		
	КонецЕсли;
	
КонецПроцедуры // ОжиданиеОтветаВРМ()

&НаКлиенте
// Определить, все ли ВРМ ответили на сообщение
//
// Параметры:
//  СписокВРМ - Массив, список результатов ответов ВРМ
//
// Возвращаемое значение:
//  Булево - Истина, если все ВРМ ответили
//
Функция ВсеВРМОтветили(СписокВРМ)
	
	Для каждого ВРМ Из СписокВРМ Цикл
		Если ВРМ.Значение.Выполнено = Ложь Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ВсеВРМОтветили()

&НаКлиенте
// Получить параметры сообщения для ВРМ
//
// Параметры:
//  	Состояние - ПеречислениеСсылка.ТЦСостояние
//      ПараметрыВРМ - Произвольный
//
// Возвращаемое значение:
//  	ПараметрыСообщения - Структура
//      	Состояние - ПеречислениеСсылка.ТЦСостояние
//          Параметры - Произвольный
//
Функция ПараметрыСообщенияДляВРМ(Состояние, ПараметрыВРМ = Неопределено)
	
	ПараметрыСообщения = Новый Структура;
	ПараметрыСообщения.Вставить("Состояние", Состояние);
	ПараметрыСообщения.Вставить("Параметры", ПараметрыВРМ);
	
	Возврат ПараметрыСообщения;
	
КонецФункции // ПараметрыСообщенияДляВРМ()

&НаКлиенте
// Получить параметры сообщения для описания таймаута
//
// Параметры:
//  	Сообщение - Строка
//      ИмяКомпьютера - Строка
//
// Возвращаемое значение:
//  	ПараметрыСообщенияОбОшибке - Структура
//      	Результат - Произвольный
//          Состояние - ПеречислениеСсылка.ТЦСостояние
//			ВесОшибки - Число
//
Функция ПараметрыСообщенияОТаймауте()
	
	ПараметрыСообщенияОТаймауте = ТЦКлиент.ПараметрыСообщенияАгентаОбОшибке(мСостояние);
	ПараметрыСообщенияОТаймауте.Вставить("ЭтоТаймаут", Истина);
	Возврат ПараметрыСообщенияОТаймауте;
	
КонецФункции