// @strict-types

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаРезультатаВыполненияДействийЭДО

#Область ОжиданиеВыполненияДействийЭДО

// Параметры:
//  АдресаРезультатов - см. ИнтеграцияЦентраЭДОКлиент.АдресаРезультатовАсинхронныхОпераций
// 
// Возвращаемое значение:
//  См. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.НовыеРезультатыДействийПоУчетнымЗаписямЦентровЭДО
Функция РезультатыДействийЭДОАсинхронно(Знач АдресаРезультатов) Экспорт
	
	РезультатыДействийЭДО = ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.НовыеРезультатыДействийПоУчетнымЗаписямЦентровЭДО();
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	Для Каждого АдресРезультата Из АдресаРезультатов Цикл
		УчетнаяЗаписьЦентраЭДО = АдресРезультата.Ключ;
		АдресВоВременномХранилище = АдресРезультата.Значение;
		
		РезультатыМетодовОперации = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище); // См. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ОбработатьРезультатыПакетаМетодовПоДействиямЭДО.РезультатыМетодовОперации
		УдалитьИзВременногоХранилища(АдресВоВременномХранилище);
		
		РезультатДействийПоУчетнойЗаписи = ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.НовыйРезультатДействийЭДО();
		
		ПакетМетодовПовторно = ИнтеграцияЦентраЭДО.НовыйПакетМетодовСервиса();
		ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ОбработатьРезультатыПакетаМетодовПоДействиямЭДО(
			РезультатыМетодовОперации, РезультатДействийПоУчетнойЗаписи, КонтекстДиагностики, ПакетМетодовПовторно,
			УчетнаяЗаписьЦентраЭДО);
		
		РезультатыДействийЭДО.Вставить(УчетнаяЗаписьЦентраЭДО, РезультатДействийПоУчетнойЗаписи);
	КонецЦикла;
	
	Возврат РезультатыДействийЭДО;
		
КонецФункции

#КонецОбласти

#Область ЗаполнениеДанныхДляПодписанияПоВыбраннымСертификатам

// Параметры:
//  ДанныеДляЗаполненияПоУчетнымЗаписям - см. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатам.ДанныеДляЗаполненияПоУчетнымЗаписям
//  
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
//
Функция ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатамВФоне(Знач ДанныеДляЗаполненияПоУчетнымЗаписям) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(Новый УникальныйИдентификатор);
	
	// См. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатам
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатам",
		ДанныеДляЗаполненияПоУчетнымЗаписям);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

// Параметры:
//  АдресаРезультатов - см. ИнтеграцияЦентраЭДОКлиент.АдресаРезультатовАсинхронныхОпераций
// 
// Возвращаемое значение:
//  Структура:
//  * ЗаполненныеДанныеПоУчетнымЗаписям - Соответствие из КлючИЗначение:
//  ** Ключ - Строка - идентификатор учетной записи центра ЭДО.
//  ** Значение - см. ОбработатьРезультатЗаполненияДанныхДляПодписанияПоВыбраннымСертификатам
//  * КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
Функция РезультатЗаполненияДанныхДляПодписанияПоВыбраннымСертификатамАсинхронно(Знач АдресаРезультатов) Экспорт
	
	ЗаполненныеДанныеПоУчетнымЗаписям = Новый Соответствие;
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	РезультатЗаполнения = Новый Структура;
	РезультатЗаполнения.Вставить("ЗаполненныеДанныеПоУчетнымЗаписям", ЗаполненныеДанныеПоУчетнымЗаписям);
	РезультатЗаполнения.Вставить("КонтекстДиагностики", КонтекстДиагностики);
	
	Для Каждого АдресРезультата Из АдресаРезультатов Цикл
		ИдентификаторУчетныйЗаписи = АдресРезультата.Ключ;
		АдресВоВременномХранилище = АдресРезультата.Значение;
		
		РезультатЗаполненияДанных = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище); // См. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ОбработатьРезультатЗаполненияДанныхДляПодписанияПоВыбраннымСертификатам.РезультатЗаполненияДанных
		УдалитьИзВременногоХранилища(АдресВоВременномХранилище);
		
		ЗаполненныеДанные = ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ОбработатьРезультатЗаполненияДанныхДляПодписанияПоВыбраннымСертификатам(
			РезультатЗаполненияДанных, КонтекстДиагностики);
		
		ЗаполненныеДанныеПоУчетнымЗаписям.Вставить(ИдентификаторУчетныйЗаписи, ЗаполненныеДанные);
		
	КонецЦикла;
	
	Возврат РезультатЗаполнения;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ВходящиеДокументы

// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО
//  ИдентификаторФормы - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ИзменитьДанныеВходящегоДокументаВЦентреЭДОВФоне(Знач ЭлектронныйДокумент, Знач ИдентификаторФормы) Экспорт
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	
	// См. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ИзменитьДанныеВходящегоДокументаВЦентреЭДО
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ИзменитьДанныеВходящегоДокументаВЦентреЭДО",
		ЭлектронныйДокумент);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти // ВходящиеДокументы

// Возвращаемое значение:
//  Булево
Функция ИспользоватьИнтеграциюЦентраЭДО() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюЦентраЭДО");
КонецФункции

#Область ВыгрузкаВЦентрЭДО

// Параметры:
//  ЭлектронныеДокументы - Массив из ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//  ИдентификаторФормы - Неопределено,УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ВыгрузитьНаборДокументовВЦентрЭДОВФоне(Знач ЭлектронныеДокументы, Знач ИдентификаторФормы = Неопределено) Экспорт
	
	Если ИдентификаторФормы = Неопределено Тогда
		ИдентификаторФормы = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	
	// См. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ВыгрузитьНаборДокументовВЦентрЭДО
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияВФоне,
		"ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ВыгрузитьНаборДокументовВЦентрЭДО",
		ЭлектронныеДокументы);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  См. РегистрыСведений.СостоянияВыгрузкиВЦентрЭДО.СостояниеПоИдентификаторуЭДО
Функция СостояниеВыгрузкиВЦентрЭДО(Знач ИдентификаторЭДО) Экспорт
	
	Возврат РегистрыСведений.СостоянияВыгрузкиВЦентрЭДО.СостояниеПоИдентификаторуЭДО(ИдентификаторЭДО);
	
КонецФункции

// Параметры:
//  ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  См. ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ЗапуститьВыгрузкуВЦентрЭДО
Функция ЗапуститьВыгрузкуВЦентрЭДО(Знач ИдентификаторЭДО) Экспорт
	
	Возврат ЭлектронныеДокументыЭДОИнтеграцияЦентраЭДО.ЗапуститьВыгрузкуВЦентрЭДО(ИдентификаторЭДО);
	
КонецФункции

#КонецОбласти

#КонецОбласти
