

&НаКлиенте
Процедура УстановитьПометкуИзменения()
	
	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Изменить = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияФасовкаУпаковкаПриИзменении(Элемент)
	
	УстановитьПометкуИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияФасовкаКоличествоУпаковокПриИзменении(Элемент)
	
	УстановитьПометкуИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияФасовкаЕдиницаИзмеренияПриИзменении(Элемент)
	
	УстановитьПометкуИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияФасовкаКоличествоЕдиницВУпаковкеПриИзменении(Элемент)
	
	УстановитьПометкуИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияАртикулПриИзменении(Элемент)
	
	УстановитьПометкуИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияGTINПриИзменении(Элемент)
	
	УстановитьПометкуИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияНаименованиеПриИзменении(Элемент)
	
	УстановитьПометкуИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияСоответствуетГОСТуПриИзменении(Элемент)
	
	УстановитьПометкуИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияГОСТПриИзменении(Элемент)
	
	УстановитьПометкуИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияВладелецМаркиПриИзменении(Элемент)
	
	УстановитьПометкуИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияКодПриИзменении(Элемент)
	
	УстановитьПометкуИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияТипПродукцииПриИзменении(Элемент)
	
	УстановитьПометкуИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииПриИзменении(Элемент)
	
	УстановитьПометкуИзменения();
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьНоменклатуру(Продукт)
	
	Если НЕ ЗначениеЗаполнено(Продукт) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СоответствиеНоменклатурыВЕТИС.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатурыВЕТИС КАК СоответствиеНоменклатурыВЕТИС
	|ГДЕ
	|	СоответствиеНоменклатурыВЕТИС.Продукция = &Продукт
	|";
	
	Запрос.УстановитьПараметр("Продукт", Продукт);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 И Выборка.Следующий() Тогда
		Возврат Выборка.Номенклатура;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ПродукцияПродуктПриИзмененииНаСервере()
	
	ТекущаяСтрока = Элементы.Продукция.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Продукция.НайтиПоИдентификатору(ТекущаяСтрока);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Продукт) Тогда
		Возврат;
	КонецЕсли;
	
	//ЗаполнитьЗначенияСвойств(ТекущиеДанные, ТекущиеДанные.Продукт);
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПродукцияВЕТИС.Наименование,
	|	ПродукцияВЕТИС.Артикул,
	|	ПродукцияВЕТИС.Родитель КАК ПодВидПродукции,
	|	ПродукцияВЕТИС.СоответствуетГОСТу,
	|	ПродукцияВЕТИС.ГОСТ,
	|	ПродукцияВЕТИС.ФасовкаУпаковка,
	|	ПродукцияВЕТИС.ФасовкаКоличествоУпаковок,
	|	ПродукцияВЕТИС.ФасовкаЕдиницаИзмерения,
	|	ПродукцияВЕТИС.ФасовкаКоличествоЕдиницВУпаковке,
	|	ПродукцияВЕТИС.Код,
	|	ПродукцияВЕТИС.НаименованиеАнглийское,
	|	ПродукцияВЕТИС.КодПоТНВЭД,
	|	ПродукцияВЕТИС.ТипПродукции,
	|	ПродукцияВЕТИС.Продукция КАК ВидПродукции,
	|	ПродукцияВЕТИС.GTIN,
	|	ПродукцияВЕТИС.ВладелецМарки,
	|	ПродукцияВЕТИС.ХозяйствующийСубъект,
	|	ПродукцияВЕТИС.Площадки.(
	|		Площадка
	|	)
	|ИЗ
	|	Справочник.ПродукцияВЕТИС КАК ПродукцияВЕТИС
	|ГДЕ
	|	ПродукцияВЕТИС.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущиеДанные.Продукт);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, Выборка,, "Площадки");
		
		ВыборкаПлощадки = Выборка.Площадки.Выбрать();
		Пока ВыборкаПлощадки.Следующий() Цикл
			СтрокаПлощадки = ТекущиеДанные.Площадки.Добавить();
			СтрокаПлощадки.Площадка = ВыборкаПлощадки.Площадка;
		КонецЦикла;
		
	КонецЕсли;
	
	ТекущиеДанные.Номенклатура = ПолучитьНоменклатуру(ТекущиеДанные.Продукт);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПродуктПриИзменении(Элемент)
	
	ПродукцияПродуктПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияВыбратьВсе(Команда)
	
	Для Каждого ТекСтрока Из Продукция Цикл
		ТекСтрока.Изменить = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияОтключитьВсе(Команда)
	
	Для Каждого ТекСтрока Из Продукция Цикл
		ТекСтрока.Изменить = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	
	Если НЕ ЗначениеЗаполнено(ХозяйствующийСубъект) Тогда
		ВывестиСообщение(НСтр("ru='Не заполнен Хозяйствующий субъект'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Предприятие) Тогда
		ВывестиСообщение(НСтр("ru='Не указано Предприятие'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОтборТипПродукции) Тогда
		ВывестиСообщение(НСтр("ru='Не указан Тип продукции'"));
		Возврат;
	КонецЕсли;
	
	НастройкаПодключения = ИнтеграцияВЕТИС.ПолучитьНастройкуПодключения(ХозяйствующийСубъект);
	
	Продукция.Очистить();
	
	Смещение = 0;
	Шаг      = 100;
	Пока Шаг>0 Цикл
		Результат = ИнтеграцияВЕТИС.ЗапросНаПолучениеСпискаНаименованийПродукции(ХозяйствующийСубъект, ОтборТипПродукции.Код, , , ХозяйствующийСубъект.Код, Предприятие.Код, Смещение, Шаг);
		Для Каждого ТекущаяЗапись Из Результат.productItem Цикл
			НаименованиеПродукции = ИнтеграцияВЕТИС.ЗагрузитьНаименованиеПродукции(НастройкаПодключения,, ТекущаяЗапись, ОтборТипПродукции);
			
			НоваяСтрока = Продукция.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НаименованиеПродукции,,"Площадки");
			
			НоваяСтрока.ТипПродукции    = НаименованиеПродукции.ТипПродукции;
			НоваяСтрока.ВидПродукции    = НаименованиеПродукции.Продукция;
			НоваяСтрока.ПодВидПродукции = НаименованиеПродукции.Родитель;
			НоваяСтрока.Продукт         = НаименованиеПродукции;
			НоваяСтрока.Номенклатура    = ПолучитьНоменклатуру(НоваяСтрока.Продукт);
			НоваяСтрока.Изменить        = Ложь;
			
			Для Каждого СтрокаПлощадки ИЗ НаименованиеПродукции.Площадки Цикл
				НоваяСтрокаПлощадки = НоваяСтрока.Площадки.Добавить();
				НоваяСтрокаПлощадки.Площадка = СтрокаПлощадки.Площадка;
			КонецЦикла;
			
		КонецЦикла;
		
		Смещение = Смещение + Шаг;
		Шаг      = Мин(100, Результат.total-Смещение);
	КонецЦикла;
	
	Если Продукция.Количество()>0 Тогда
		Элементы.Продукция.ТекущаяСтрока = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ЗагрузитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ХозяйствующийСубъектПриИзмененииНаСервере()
	
	ИнтеграцияВЕТИС.УстановитьПараметрыВыбораПредприятий(Элементы.Предприятие, ХозяйствующийСубъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ХозяйствующийСубъектПриИзменении(Элемент)
	ХозяйствующийСубъектПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнтеграцияВЕТИС.УстановитьПараметрыВыбораПредприятий(Элементы.Предприятие, ХозяйствующийСубъект);
	ИнтеграцияВЕТИС.УстановитьПараметрыВыбораПредприятий(Элементы.ПродукцияПлощадкиПлощадка, ХозяйствующийСубъект);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляВыгрузки()
	
	ДанныеДляВыгрузки = Новый СписокЗначений;
	
	Для Каждого ТекущаяСтрока Из Продукция Цикл
		
		Если НЕ ТекущаяСтрока.Изменить Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаВыгрузки = Новый Структура;
		
		НомерСтроки = Продукция.Индекс(ТекущаяСтрока)+1;
		
		Если ТекущаяСтрока.Удалить Тогда
			
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Продукт) Тогда
				ВывестиСообщение(НСтр("ru = 'Не заполнен продукт. Строка №#'"), ЭтотОбъект,, НомерСтроки);
				Продолжить;
			КонецЕсли;
			
			СтрокаВыгрузки.Вставить("ТипОперации", "DELETE");
			
		ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Продукт) Тогда
			СтрокаВыгрузки.Вставить("ТипОперации", "UPDATE");
		ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.Наименование) Тогда
			СтрокаВыгрузки.Вставить("ТипОперации", "CREATE");
		Иначе
			ВывестиСообщение(НСтр("ru = 'Не заполнено наименование продукции. Строка №#'"), ЭтотОбъект,, НомерСтроки);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ТипПродукции) Тогда
			ВывестиСообщение(НСтр("ru = 'Не заполнен тип продукции. Строка №#'"), ЭтотОбъект,, НомерСтроки);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ВидПродукции) Тогда
			ВывестиСообщение(НСтр("ru = 'Не заполнен вид продукции. Строка №#'"), ЭтотОбъект,, НомерСтроки);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ПодВидПродукции) Тогда
			ВывестиСообщение(НСтр("ru = 'Не заполнен подвид продукции. Строка №#'"), ЭтотОбъект,, НомерСтроки);
			Продолжить;
		КонецЕсли;
		
		Если НЕ ТекущаяСтрока.ТипПродукции = ТекущаяСтрока.ВидПродукции.ТипПродукции Тогда
			ВывестиСообщение(НСтр("ru = 'Вид продукции не соответствует типу продукции. Строка №#'"), ЭтотОбъект,, НомерСтроки);
			Продолжить;
		КонецЕсли;
		
		Если НЕ ТекущаяСтрока.ВидПродукции = ТекущаяСтрока.ПодВидПродукции.Продукция Тогда
			ВывестиСообщение(НСтр("ru = 'Подвид продукции не соответствует виду продукции. Строка №#'"), ЭтотОбъект,, НомерСтроки);
			Продолжить;
		КонецЕсли;
		
		СтрокаВыгрузки.Вставить("guidПредприятия",    Предприятие.Код);
		
		СтрокаВыгрузки.Вставить("Объект",             ТекущаяСтрока.Номенклатура);
		СтрокаВыгрузки.Вставить("Продукт",            ТекущаяСтрока.Продукт.ИдентификаторЗаписи);
		
		СтрокаВыгрузки.Вставить("Наименование",       ТекущаяСтрока.Наименование);
		СтрокаВыгрузки.Вставить("Артикул",            ТекущаяСтрока.Артикул);
		СтрокаВыгрузки.Вставить("СоответствуетГОСТу", ТекущаяСтрока.СоответствуетГОСТу);
		СтрокаВыгрузки.Вставить("ГОСТ",               ТекущаяСтрока.ГОСТ);
		СтрокаВыгрузки.Вставить("ТипПродукции",       ТекущаяСтрока.ТипПродукции.Код);
		СтрокаВыгрузки.Вставить("Продукция",          ТекущаяСтрока.ВидПродукции.Код);
		СтрокаВыгрузки.Вставить("ВидПродукции",       ТекущаяСтрока.ПодВидПродукции.Код);
		СтрокаВыгрузки.Вставить("GTIN",               ТекущаяСтрока.GTIN);
		СтрокаВыгрузки.Вставить("ВладелецМарки",      ТекущаяСтрока.ВладелецМарки);
		СтрокаВыгрузки.Вставить("ФасовкаУпаковка",       			ТекущаяСтрока.ФасовкаУпаковка.Код);
		СтрокаВыгрузки.Вставить("ФасовкаКоличествоУпаковок",			ТекущаяСтрока.ФасовкаКоличествоУпаковок);
		СтрокаВыгрузки.Вставить("ФасовкаЕдиницаИзмерения",			ТекущаяСтрока.ФасовкаЕдиницаИзмерения.Код);
		СтрокаВыгрузки.Вставить("ФасовкаКоличествоЕдиницВУпаковке",	ТекущаяСтрока.ФасовкаКоличествоЕдиницВУпаковке);
		СтрокаВыгрузки.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
		
		Площадки = ТекущаяСтрока.Площадки.Выгрузить().ВыгрузитьКолонку("Площадка");
		
		СтрокаВыгрузки.Вставить("Площадки", Площадки);
		
		//ИнтеграцияВЕТИС
		//ОтправитьЗаявку(ТранспортныйМодуль, ПараметрыЗаявок.modifyProducerStockListRequest, ДанныеДляВыгрузки,,, Предприятие);
		
		ДанныеДляВыгрузки.Добавить(СтрокаВыгрузки);
		
	КонецЦикла;
	
	Возврат ДанныеДляВыгрузки;
	
КонецФункции

&НаКлиенте
Процедура ПрименитьИзменения(Команда)
	
	Если НЕ ЗначениеЗаполнено(ХозяйствующийСубъект) Тогда
		ВывестиСообщение(НСтр("ru='Не заполнен Хозяйствующий субъект'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Предприятие) Тогда
		ВывестиСообщение(НСтр("ru='Не указано Предприятие'"));
		Возврат;
	КонецЕсли;
	
	ДанныеДляВыгрузки = ПолучитьДанныеДляВыгрузки();
	
	Если ДанныеДляВыгрузки.Количество() = 0 Тогда
		ВывестиСообщение(НСтр("ru='Нет данных для запроса'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДанныеДляВыгрузки",    ДанныеДляВыгрузки);
	ПараметрыОткрытия.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
	ПараметрыОткрытия.Вставить("Предприятие",          Предприятие);
	ПараметрыОткрытия.Вставить("ВидОперации",          ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ЗапросНаРегистрациюИзменениеПродукции"));
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ФормированиеЗапроса", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПродукцияНоменклатураПриИзмененииНаСервере()
	
	ТекущаяСтрока = Элементы.Продукция.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Продукция.НайтиПоИдентификатору(ТекущаяСтрока);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекущиеДанные.Наименование) Тогда
		ТекущиеДанные.Наименование = ТекущиеДанные.Номенклатура.Наименование;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекущиеДанные.Артикул) Тогда
		ТекущиеДанные.Артикул = ТекущиеДанные.Номенклатура.Артикул;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияНоменклатураПриИзменении(Элемент)
	
	ПродукцияНоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
	
	Если (НЕ ОтменаРедактирования) И (НЕ ТекущиеДанные = Неопределено) И (НЕ ЗначениеЗаполнено(ТекущиеДанные.ТипПродукции)) Тогда
		ТекущиеДанные.ТипПродукции = ОтборТипПродукции;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекущиеДанные.Изменить = Истина;
		
		Если ЗначениеЗаполнено(Предприятие) Тогда
			СтрокаПлощадки = ТекущиеДанные.Площадки.Добавить();
			СтрокаПлощадки.Площадка = Предприятие;
		КонецЕсли;
		
		ТекущиеДанные.ТипПродукции = ОтборТипПродукции;
		
		Если Копирование Тогда
			ТекущиеДанные.Код = "";
			ТекущиеДанные.GTIN = "";
			ТекущиеДанные.Артикул = "";
			ТекущиеДанные.Наименование = "";
			ТекущиеДанные.Номенклатура = Неопределено;
			ТекущиеДанные.Продукт = Неопределено;
			Элементы.Продукция.ЗакончитьРедактированиеСтроки(Ложь);
			ТекущийЭлемент = Элементы.ПродукцияНоменклатура;
		Иначе
			Элементы.Продукция.ЗакончитьРедактированиеСтроки(Ложь);
			ТекущийЭлемент = Элементы.Продукция;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
