/////////////////////////////////////////////////////////////////////////////////////////////////////
// ЗАЩИЩЕННЫЕ ФУНКЦИИ КЛИЕНТСКОГО КОНТЕКСТА
/////////////////////////////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////////
// ЗАЩИЩЕННЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Производит настройку основной командной панели объекта.
//
Процедура НастроитьКоманднуюПанельФормы(Форма,ФормаСписка=Ложь,ПрефиксКнопок = "Форма", ИмяКоманднойПанели= "ФормаКоманднаяПанель") Экспорт
	
	ЛицензированиеКлиентПовтИсп.ПолучитьОтладочныйЗащищенныйМодуль().НастроитьКоманднуюПанельФормы(Форма,ФормаСписка,ПрефиксКнопок, ИмяКоманднойПанели);
	//ЛицензированиеКлиентПовтИсп.ПолучитьЗащищенныйМодуль().НастроитьКоманднуюПанельФормы(Форма,ФормаСписка,ПрефиксКнопок, ИмяКоманднойПанели);
	
КонецПроцедуры // НастроитьКоманднуюПанельФормы()

// Производит настройку основного динамического списка формы выбора.
//
Процедура НастроитьОсновнойДинамическийСписокФормы(Форма) Экспорт
	
	Если НЕ ТипЗнч(Форма.ВладелецФормы)=Тип("ПолеФормы") ИЛИ Форма.Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеПоляОтбора = Новый Массив;
	
	Для каждого ПараметрВыбора Из Форма.ВладелецФормы.СвязиПараметровВыбора Цикл
		Если ПараметрВыбора.ИзменениеЗначения=РежимИзмененияСвязанногоЗначения.НеИзменять Тогда
			ДоступныеПоляОтбора.Добавить(СтрПолучитьСтроку(СтрЗаменить(ПараметрВыбора.Имя, ".", Символы.ПС), 2));
		КонецЕсли;
	КонецЦикла;
	
	Если ДоступныеПоляОтбора.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ЭлементОтбора Из Форма.Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.РежимОтображения=РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный И ДоступныеПоляОтбора.Найти(Строка(ЭлементОтбора.ЛевоеЗначение))<>Неопределено Тогда
			ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
			ЭлементОтбора.ИдентификаторПользовательскойНастройки = Строка(ЭлементОтбора.ЛевоеЗначение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // НастроитьОсновнойДинамическийСписокФормы()

// Производит настройку связанного динамического списка, расположенного на форме основного объекта.
//
Процедура НастроитьЭлементФормыДинамическогоСписка(Форма, ИмяСписка, Префикс = Неопределено) Экспорт
	
	ЛицензированиеКлиентПовтИсп.ПолучитьЗащищенныйМодуль().НастроитьЭлементФормыДинамическогоСписка(Форма, ИмяСписка, Префикс);
	
КонецПроцедуры // НастроитьЭлементФормыДинамическогоСписка()

// Производит настройку табличной части, расположенного на форме основного объекта.
//
Процедура НастроитьЭлементФормыТабличнойЧасти(Форма, ИмяТабличнойЧасти, Префикс = Неопределено) Экспорт
	
	ЛицензированиеКлиентПовтИсп.ПолучитьЗащищенныйМодуль().НастроитьЭлементФормыТабличнойЧасти(Форма, ИмяТабличнойЧасти, Префикс);
	
КонецПроцедуры // НастроитьЭлементФормыТабличнойЧасти()

// Возвращает параметры по умолчанию для функции ЗаписатьНовыйОбъектНаКлиенте()
//
// Возвращаемое значение
//  - Структура - Структура параметров по умолчанию.
//
Функция СоздатьПараметрыЗаписиНовогоОбъектаНаКлиенте() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ПредставлениеДействия", Неопределено);
	Параметры.Вставить("ОбновитьИзмененный",    Истина);
	Параметры.Вставить("ПровестиДокумент",      Ложь);
	Параметры.Вставить("ОбработчикСобытия",     Неопределено);
	Параметры.Вставить("РезультатСобытия",      Неопределено);
	Параметры.Вставить("ПараметрыСобытия",      Неопределено);
	
	Возврат Параметры;
	
КонецФункции

// Функция используется для организации стандартизованной записи нового и модифицированного объекта в форме.
//
Функция ЗаписатьНовыйОбъектНаКлиенте(Форма, ПараметрыЗаписиНового, ПараметрыЗаписи=Неопределено) Экспорт
	
	Возврат ЛицензированиеКлиентПовтИсп.ПолучитьЗащищенныйМодуль().ЗаписатьНовыйОбъектНаКлиенте(Форма, ПараметрыЗаписиНового, ПараметрыЗаписи);
	
КонецФункции // ЗаписатьНовыйОбъектНаКлиенте()

// Функция используется для организации стандартизованной записи нового и модифицированного объекта в форме.
//
Функция ПровестиДокументНаКлиенте(Форма, ТекущаяСтрока, РезультатСобытия, ПредставлениеДействия=Неопределено, ОбработчикСобытия=Неопределено, ПараметрыСобытия=Неопределено) Экспорт
	
	Возврат ЛицензированиеКлиентПовтИсп.ПолучитьЗащищенныйМодуль().ПровестиДокументНаКлиенте(Форма, ТекущаяСтрока, ПредставлениеДействия, ОбработчикСобытия, РезультатСобытия, ПараметрыСобытия);
	
КонецФункции // ПровестиДокументНаКлиенте()

// Общий обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Форма         - УправляемаяФорма          - Форма, в которой возникло событие.
//  Команда       - КомандаФормы              - Команда, в которой возникло данное событие.
//  ТекущиеДанные - ДокументСсылка            - Ссылка, для которой выполняется обработка события.
//  Окно          - ОкноКлиентскогоПриложения - Содержит окно, в котором требуется открыть форму.
//
Процедура ОбработкаКомандыГруппировкиПоКолонке(Форма,Команда, ТекущиеДанные) Экспорт
	
	ЛицензированиеКлиентПовтИсп.ПолучитьЗащищенныйМодуль().ОбработкаКомандыГруппировкиПоКолонке(Форма,Команда, ТекущиеДанные);
	
КонецПроцедуры // ОбработкаКомандыГруппировкиПоКолонке()
