
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура();
	Если ТипЗнч(ПараметрКоманды)=Тип("СправочникСсылка.СкладыКомпании") Тогда
		ПараметрыФормы.Вставить("Отбор", Новый Структура("СкладКомпании", ПараметрКоманды));
	Иначе
		ПараметрыФормы.Вставить("Отбор", Новый Структура("ЯчейкаХранения", ПараметрКоманды));
	КонецЕсли;
	
	ОткрытьФорму(
		"РегистрСведений.ЯчейкиХраненияПоУмолчанию.ФормаСписка",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
