
#Область ПрограммныйИнтерфейс

Функция ПроверитьПинг(IP, ServicesSet = Неопределено)
	
	Попытка
		Если ServicesSet = Неопределено Тогда
			ServicesSet = ПолучитьCOMОбъект("winmgmts:{impersonationLevel=impersonate}");
		КонецЕсли;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Попытка
		Элементы = ServicesSet.ExecQuery("Select StatusCode From Win32_PingStatus Where Address = '" + IP + "' AND Timeout=100");
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Результат = Ложь;
	
	Для Каждого Элемент Из Элементы Цикл
		Если Элемент.StatusCode = 0 Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет подключение устройства.
//
Функция ПодключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	НовыйСтандарт = Ложь;
	
	ИДУстройства = "";
	//Если Параметры.P_CommunicationMethod=0 Тогда
		СтрIP = Параметры.P_IP;
		Если СтрНайти(СтрIP, ".", НаправлениеПоиска.СКонца)>0 Тогда
			ИДУстройства = "S0"+ Сред(СтрIP, СтрНайти(СтрIP, ".", НаправлениеПоиска.СКонца)+1);
		КонецЕсли;
	//Иначе
	//	ИДУстройства = Параметры.P_IP;
	//КонецЕсли;
	//
	ВыходныеПараметры = Новый Массив();
	ПараметрыПодключения.Вставить("ИДУстройства", ИДУстройства);
	
	ТипОборудованияИспользуемый= "";
	
	Если ПараметрыПодключения.Свойство("ТипОборудования") Тогда
		ТипОборудованияИспользуемый = ПараметрыПодключения.ТипОборудования;
		// Предопределенный параметр с указанием типа драйвера.
		Попытка
			ОбъектДрайвера.УстановитьПараметр("EquipmentType", ТипОборудованияИспользуемый) 
		Исключение
			Результат = Ложь;
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(НСтр("ru='Ошибка обращения к драйверу.'"));
			Возврат Результат;
		КонецПопытки;
	КонецЕсли;
	
	НаименованиеДрайвера      = "";
	ОписаниеДрайвера          = "";
	ТипОборудования           = "";
	ИнтеграционныйКомпонент   = Ложь;
	ОсновнойДрайверУстановлен = Ложь;
	#Если Клиент Тогда
	РевизияИнтерфейса         = МенеджерОборудованияКлиентПовтИсп.РевизияИнтерфейсаДрайверов();
	#Иначе
	РевизияИнтерфейса         = 2005;
	#КонецЕсли
	URLЗагрузкиДрайвера       = "";
	ПараметрыДрайвера         = "";
	ДополнительныеДействия    = "";
	
	Попытка
		// Получаем ревизию интерфейса драйвера.
		РевизияИнтерфейса = ОбъектДрайвера.ПолучитьРевизиюИнтерфейса();
		НовыйСтандарт = Истина;
		// Получаем описание драйвера.
		ОписаниеДрайвера = "";
		ОбъектДрайвера.ПолучитьОписание(ОписаниеДрайвера);
		
		ОписаниеДрайвераПараметры = МенеджерОборудованияВызовСервера.ПолучитьОписаниеДрайвера(ОписаниеДрайвера);
		НаименованиеДрайвера      = ОписаниеДрайвераПараметры.НаименованиеДрайвера;
		ОписаниеДрайвера          = ОписаниеДрайвераПараметры.ОписаниеДрайвера;
		ТипОборудования           = ОписаниеДрайвераПараметры.ТипОборудования;
		ИнтеграционныйКомпонент   = ОписаниеДрайвераПараметры.ИнтеграционныйКомпонент;
		ОсновнойДрайверУстановлен = ОписаниеДрайвераПараметры.ОсновнойДрайверУстановлен;
		URLЗагрузкиДрайвера       = ОписаниеДрайвераПараметры.URLЗагрузкиДрайвера;
	Исключение
		// Используется стандарт драйверов ниже 2.0
		НовыйСтандарт = Ложь;
	КонецПопытки;
	
	Если Не НовыйСтандарт Тогда
		Попытка
			// Получаем описание драйвера
			ОбъектДрайвера.ПолучитьОписание(НаименованиеДрайвера, ОписаниеДрайвера, ТипОборудования, РевизияИнтерфейса, 
											ИнтеграционныйКомпонент, ОсновнойДрайверУстановлен, URLЗагрузкиДрайвера);
		Исключение
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ПолучитьОписание>.'") + Символы.ПС + ОписаниеОшибки());
			Возврат Результат;
		КонецПопытки;
	КонецЕсли;
	
	ПараметрыПодключения.Вставить("РевизияИнтерфейса", РевизияИнтерфейса);
	
	Для Каждого Параметр Из Параметры Цикл
		Если Лев(Параметр.Ключ, 2) = "P_" Тогда
			ЗначениеПараметра = Параметр.Значение;
			ИмяПараметра = Сред(Параметр.Ключ, 3);
			Попытка
				ОбъектДрайвера.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра) 
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ЕстьПодключение = ПроверитьПинг(СтрIP);
	
	////Если wss = Неопределено Тогда 
	//wss = Новый COMОбъект("WScript.Shell");
	////КонецЕсли;
	//ЕстьПодключение = Не wss.Run("ping -w 1500 -n 1 "+СтрIP,0,Истина);
	Если НЕ ЕстьПодключение Тогда
		Результат = Ложь;
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ВыходныеПараметры.Добавить("С весами "+СтрIP + " не установлено соединение");
	КонецЕсли;
	
	Попытка
		Ответ = ОбъектДрайвера.Подключить(ПараметрыПодключения.ИДУстройства);
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.Подключить>.'") + Символы.ПС + ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
	
	Если НЕ Ответ Тогда
		Результат = Ложь;
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить("");
		ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1])
	КонецЕсли;
	
	//ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры
	//МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(ГруппаТоваровОборудования, Устройство, СобытиеЖурнала, Комментарий, ДанныеСобытия)
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет отключение устройства.
//
Функция ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = Истина;
	
	ВыходныеПараметры = Новый Массив();
	
	ОбъектДрайвера.Отключить(ПараметрыПодключения.ИДУстройства);
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает возможность работы модуля в асинхронном режиме.
// Стандартные команды модуля:
// - ПодключитьУстройство
// - ОтключитьУстройство
// - ВыполнитьКоманду
// Команды модуля для работы асинхронном режиме (должны быть определены):
// - НачатьПодключениеУстройства
// - НачатьОтключениеУстройства
// - НачатьВыполнениеКоманды.
//
Функция ПоддержкаАсинхронногоРежима() Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Функция получает, обрабатывает и перенаправляет на исполнение команду к драйверу.
//
Функция ВыполнитьКоманду(Команда, ВходныеПараметры = Неопределено, ВыходныеПараметры = Неопределено, ОбъектДрайвера, Параметры, ПараметрыПодключения) Экспорт
	
	Результат = Истина;
	ВыходныеПараметры = Новый Массив();
	
	// Выгрузка товаров в весы с печатью этикеток.
	Если Команда = "UploadGoods" ИЛИ Команда = "ВыгрузитьТовары" Тогда
		Товары         = ВходныеПараметры[0];
		ПолнаяВыгрузка = (ВходныеПараметры[1] = ЛОЖЬ);
		Результат = ВыгрузитьТовары(ОбъектДрайвера, Параметры, ПараметрыПодключения, Товары, ПолнаяВыгрузка, ВыходныеПараметры);
		
		// Очистить базу весов с печатью этикеток.
	ИначеЕсли Команда = "ClearBase" ИЛИ Команда = "ОчиститьБазу" Тогда
		Результат = ОчиститьТоварыВВесах(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
		// Тестирование устройства
	ИначеЕсли Команда = "ТестУстройства" ИЛИ Команда = "CheckHealth" Тогда
		Результат = ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	ИначеЕсли Команда = "ВыполнитьДополнительноеДействие" ИЛИ Команда = "DoAdditionalAction" Тогда
		ИмяДействия = ВходныеПараметры[0];
		Результат = ВыполнитьДополнительноеДействие(ОбъектДрайвера, Параметры, ПараметрыПодключения, ИмяДействия, ВыходныеПараметры);
		
		// Получение версии драйвера
	ИначеЕсли Команда = "ПолучитьВерсиюДрайвера" ИЛИ Команда = "GetVersion" Тогда
		Результат = ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
		// Получение описание драйвера.
	ИначеЕсли Команда = "ПолучитьОписаниеДрайвера" ИЛИ Команда = "GetDescription" Тогда
		Результат = ПолучитьОписаниеДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	// Выгрузить шаблоны в весы с печатью этикеток.
	ИначеЕсли Команда = "ВыгрузитьШаблоны" Тогда
		Результат = ВыгрузитьШаблоныВВесы(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
		
	// Указанная команда не поддерживается данным драйвером.
	Иначе
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Команда ""%Команда%"" не поддерживается данным драйвером.'"));
		ВыходныеПараметры[1] = СтрЗаменить(ВыходныеПараметры[1], "%Команда%", Команда);
		
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВыгрузкаТоваров

// Функция осуществляет выгрузку таблицы товаров в весы с печатью этикеток.
//
// Параметры:
//  ОбъектДрайвера                 - <*>
//                                 - Объект драйвера торгового оборудования.
//
//  Товары                         - <ТаблицаЗначений>
//                                 - Таблица товаров, подлежащих выгрузке в весы.
//                                   Таблица имеет следующие колонки:
//                                     PLU                        - <Число>
//                                                                - Идентификатор товара в весах.
//									   Штрихкод 				  - <Строка>
//                                                                - Штрихкод товара на кассе.
//                                     Наименование               - <Строка>
//																  - Наименование товара сокращенное (для печати на этикетке).
//                                     НаименованиеПолное         - <Строка>
//																  - Наименование товара полное (для отображения на табло).
//                                     Цена                       - <Число>
//                                                                - Цена номенклатуры.
//
//  ЧастичнаяВыгрузка               - <Булево>
//                                  - Признак частичной выгрузки товара.
//
Функция ВыгрузитьТовары(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаВыгрузки, ПолнаяВыгрузка, ВыходныеПараметры) 
	
	Результат = Истина;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Нет данных для выгрузки.'"));
		Возврат Ложь;
	КонецЕсли;
	
	РазмерПакета     = РазмерПакетаПоУмолчанию();
	ТекущийПакет     = 1;
	ЗаписьВПакете    = 0;
	ЗаписейВыгружено = 0;
	ЗаписейВсего     = ТаблицаВыгрузки.Количество();
	
	ТекущийПроцент = 0;
	#Если Клиент Тогда
	МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Инициализация выгрузки...'"), Окр(ТекущийПроцент));
	#КонецЕсли
	ПроцентИнкремент = 100 / (ЗаписейВсего / РазмерПакета);
	
	МассивТоваров   = Новый Массив;
	МассивСообщений = Новый Массив;
	
	ДлинаПервойСтрокиНаименования = 25;
	ДлинаВторойСтрокиНаименования = 40;
	ДлинаСтрокиИнгредиента        = 50;
	КоличествоСтрокИнгредиентов   = 5;
	
	//Попытка
	//	ServicesSet = ПолучитьCOMОбъект("winmgmts:{impersonationLevel=impersonate}");
	//Исключение
	//	ServicesSet = Неопределено;
	//КонецПопытки;
	
	Если Параметры.Свойство("МоментВыгрузкиДанных") Тогда
		МоментВыгрузкиДанных = Параметры.МоментВыгрузкиДанных;
	Иначе
		МоментВыгрузкиДанных = ТекущаяДата();
	КонецЕсли;
	
	ЗаписатьМоментВыгрузки = Ложь;
	Для Каждого Позиция Из ТаблицаВыгрузки  Цикл
		
		Если ЗаписьВПакете = 0 Тогда
			МассивТоваров.Очистить();
			МассивСообщений.Очистить();
		КонецЕсли;
		
		СпецСообщение = Позиция.Производитель;
		//ОписаниеТовара = Позиция.ОписаниеТовара;
		//Если НЕ ПустаяСтрока(Позиция.НомерСтандарта) Тогда
		//	ОписаниеТовара = ОписаниеТовара + Символы.ПС + Позиция.ВидСтандарта + " " + Позиция.НомерСтандарта;
		//КонецЕсли;
		//Если НЕ ПустаяСтрока(Позиция.УсловияХранения) Тогда
		//	ОписаниеТовара = ОписаниеТовара + Символы.ПС + Позиция.УсловияХранения;
		//КонецЕсли;
		//
		//Если НЕ ПустаяСтрока(Позиция.ЭнергетическаяЦенность) Тогда
		//	ОписаниеТовара = ОписаниеТовара + Символы.ПС + Позиция.ЭнергетическаяЦенность;
		//КонецЕсли;
		
		//ОписаниеТовара = Позиция.ОписаниеТовара;
		
		Если Позиция.Удален Тогда
			СтрокаМассиваТоваров = Новый СписокЗначений; 
			СтрокаМассиваТоваров.Добавить(Число(Позиция.PLU));
			Попытка
				СтрокаМассиваТоваров.Добавить(Число(Позиция.Код));
			Исключение
				
				Результат = Ложь;
				ВыходныеПараметры.Очистить();
				ВыходныеПараметры.Добавить(999);
				ВыходныеПараметры.Добавить("Не корректный штрих код: <"+Позиция.Код+">. ПЛУ: "+Позиция.PLU+"; Номенклатура: "+СокрЛП(Позиция.Наименование));
				
				ДанныеСобытия = Новый Структура;
				ДанныеСобытия.Вставить("Устройство",        Параметры.Идентификатор);
				ДанныеСобытия.Вставить("Параметры",         Параметры);
				ДанныеСобытия.Вставить("Данные",            Неопределено);
				#Если Клиент Тогда
					ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДата());
				#Иначе
					ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
				#КонецЕсли
				
				Комментарий = "Прогрес: "+Формат(ТекущийПроцент, "ЧН=0; ЧГ=")+"; в пакете: " + Формат(ЗаписьВПакете, "ЧН=0; ЧГ=")+"; выгружено: " + Формат(ЗаписейВыгружено, "ЧН=0; ЧГ=");
				Комментарий = Комментарий + "
				|	Ошибка: " + ВыходныеПараметры[1];
				
				МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(Параметры.ГруппаТоваровОборудования, Параметры.Идентификатор, "Выгрузка данных в весы с ошибкой", Комментарий, ДанныеСобытия);
				
				Возврат Результат;
			КонецПопытки;
			
			СтрокаМассиваТоваров.Добавить("");
			СтрокаМассиваТоваров.Добавить("");
			СтрокаМассиваТоваров.Добавить(0);
			СтрокаМассиваТоваров.Добавить(Параметры.P_LabelNumber);
			СтрокаМассиваТоваров.Добавить("");
			СтрокаМассиваТоваров.Добавить(0);
			СтрокаМассиваТоваров.Добавить("");
			СтрокаМассиваТоваров.Добавить(0);
			СтрокаМассиваТоваров.Добавить(0);
			СтрокаМассиваТоваров.Добавить(0);
			СтрокаМассиваТоваров.Добавить("");
		Иначе
			Если НачалоДня(Позиция.ДатаИзготовления) = Позиция.ДатаИзготовления Тогда
				ДатаИзготовления = Формат(Позиция.ДатаИзготовления,"ДФ=dd/MM/yy");
			Иначе
				ДатаИзготовления = Формат(Позиция.ДатаИзготовления,"ДФ='dd/MM/yy hh:mm'");
			КонецЕсли;
			ОписаниеТовара = "";
			ОписаниеТовара = ОписаниеТовара + Позиция.ВидСтандарта + " " + Позиция.НомерСтандарта;
			ОписаниеТовара = ОписаниеТовара + " Пищевая и энергетическая ценность в 100 гр продукта: " + СокрЛП(Позиция.ЭнергетическаяЦенность)+" ккал/" + СокрЛП(Позиция.ЭнергетическаяЦенностьКДж) + " кДж";
			ОписаниеТовара = ОписаниеТовара + " Хранить при температуре: " + Позиция.УсловияХранения;
			ОписаниеТовара = ОписаниеТовара + " Дата изготовления: " + ДатаИзготовления;
			ОписаниеТовара = ОписаниеТовара + "
			|Состав:
			|" + СокрЛП(Позиция.ОписаниеТовара);
			
			Ингридиенты = ВыполнитьПереносСтрок(ОписаниеТовара, 50, 24,"|");
			
			Н1 = Позиция.Наименование;
			НаименованиеТовара1 = ВыполнитьПереносСтрок(Н1, ДлинаПервойСтрокиНаименования, 1, "");
			Если ПустаяСтрока(НаименованиеТовара1) Тогда
				НаименованиеТовара1 = " ";
				НаименованиеТовара2 = " ";
			Иначе
				Н2 = СтрЗаменить(Позиция.Наименование, СокрЛП(НаименованиеТовара1), "");
				НаименованиеТовара2 = ВыполнитьПереносСтрок(Н2, ДлинаВторойСтрокиНаименования, 1, "");
				Если ПустаяСтрока(НаименованиеТовара2) Тогда
					НаименованиеТовара2 = " ";
				КонецЕсли;
			КонецЕсли;
			
			СтрокаМассиваТоваров = Новый СписокЗначений; 
			СтрокаМассиваТоваров.Добавить(Число(Позиция.PLU));
			Попытка
				СтрокаМассиваТоваров.Добавить(Число(Позиция.Код));
			Исключение
				
				Результат = Ложь;
				ВыходныеПараметры.Очистить();
				ВыходныеПараметры.Добавить(999);
				ВыходныеПараметры.Добавить("Не корректный штрих код: <"+Позиция.Код+">. ПЛУ: "+Позиция.PLU+"; Номенклатура: "+СокрЛП(Позиция.Наименование));
				
				ДанныеСобытия = Новый Структура;
				ДанныеСобытия.Вставить("Устройство",        Параметры.Идентификатор);
				ДанныеСобытия.Вставить("Параметры",         Параметры);
				ДанныеСобытия.Вставить("Данные",            Неопределено);
				#Если Клиент Тогда
					ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДата());
				#Иначе
					ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
				#КонецЕсли
				
				Комментарий = "Прогрес: "+Формат(ТекущийПроцент, "ЧН=0; ЧГ=")+"; в пакете: " + Формат(ЗаписьВПакете, "ЧН=0; ЧГ=")+"; выгружено: " + Формат(ЗаписейВыгружено, "ЧН=0; ЧГ=");
				Комментарий = Комментарий + "
				|	Ошибка: " + ВыходныеПараметры[1];
				
				МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(Параметры.ГруппаТоваровОборудования, Параметры.Идентификатор, "Выгрузка данных в весы с ошибкой", Комментарий, ДанныеСобытия);
				
				Возврат Результат;
			КонецПопытки;
			СтрокаМассиваТоваров.Добавить(НаименованиеТовара1);
			СтрокаМассиваТоваров.Добавить(НаименованиеТовара2);
			СтрокаМассиваТоваров.Добавить(Позиция.Цена);
			СтрокаМассиваТоваров.Добавить(Параметры.P_LabelNumber);
			СтрокаМассиваТоваров.Добавить("");
			СтрокаМассиваТоваров.Добавить(Позиция.ВесТары);
			СтрокаМассиваТоваров.Добавить(Ингридиенты);
			СтрокаМассиваТоваров.Добавить(Позиция.БазаЦены);
			СтрокаМассиваТоваров.Добавить(Позиция.СрокХранения);
			СтрокаМассиваТоваров.Добавить(Позиция.Весовой);
			СтрокаМассиваТоваров.Добавить(СпецСообщение);
			
			// + Лог выгрузки
			#Если НЕ Клиент Тогда			
				ЛогВыгркузки = РегистрыСведений.итВыгрузкаВВесыЛог.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(ЛогВыгркузки,Позиция);
				ЛогВыгркузки.Период = ТекущаяДата();
				ЛогВыгркузки.СпецСообщение = СпецСообщение;
				ЛогВыгркузки.НаименованиеОборудования = Параметры.Идентификатор.Наименование;
				ЛогВыгркузки.Склад = Параметры.Идентификатор.ОсновнойОтдел;
				ЛогВыгркузки.Записать();
			#КонецЕсли
			// - Лог выгрузки	
			
		КонецЕсли;
		
		МассивТоваров.Добавить(СтрокаМассиваТоваров);
		
		ЗаписейВыгружено  = ЗаписейВыгружено + 1;
		ЗаписьВПакете = ЗаписьВПакете + 1;
		
		Если (ЗаписьВПакете = РазмерПакета) ИЛИ (ЗаписейВыгружено = ЗаписейВсего) Тогда  
			
			ДанныеДляВыгрузки = СформироватьТаблицуТоваров(МассивТоваров);
			
			//Если НЕ ServicesSet = Неопределено Тогда
			//	ЕстьПодключение = ПроверитьПинг(Параметры.P_IP, ServicesSet);
			//	Если НЕ ЕстьПодключение Тогда
			//		ВыходныеПараметры.Очистить();
			//		ВыходныеПараметры.Добавить(999);
			//		ВыходныеПараметры.Добавить("С весами "+Параметры.P_IP + " не установлено соединение");
			//		Возврат Ложь;
			//	КонецЕсли;
			//КонецЕсли;
			
			Ответ = ОбъектДрайвера.ВыгрузитьТоварыDIGI(ПараметрыПодключения.ИДУстройства, ДанныеДляВыгрузки);
			Если Ответ=Истина Тогда
				ДанныеСобытия = Новый Структура;
				ДанныеСобытия.Вставить("Устройство",        Параметры.Идентификатор);
				ДанныеСобытия.Вставить("Параметры",         Параметры);
				ДанныеСобытия.Вставить("Данные",            ДанныеДляВыгрузки);
				#Если Клиент Тогда
					ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДата());
				#Иначе
					ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
				#КонецЕсли
				
				Комментарий = "Прогрес: "+Формат(ТекущийПроцент, "ЧН=0; ЧГ=")+"; в пакете: " + Формат(ЗаписьВПакете, "ЧН=0; ЧГ=")+"; выгружено: " + Формат(ЗаписейВыгружено, "ЧН=0; ЧГ=");
				
				МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(Параметры.ГруппаТоваровОборудования, Параметры.Идентификатор, "Выгрузка данных в весы", Комментарий, ДанныеСобытия);
				ЗаписатьМоментВыгрузки = Истина;
			Иначе
				Результат = Ложь;
				ВыходныеПараметры.Очистить();
				ВыходныеПараметры.Добавить(999);
				ВыходныеПараметры.Добавить("");
				ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
				
				ДанныеСобытия = Новый Структура;
				ДанныеСобытия.Вставить("Устройство",        Параметры.Идентификатор);
				ДанныеСобытия.Вставить("Параметры",         Параметры);
				ДанныеСобытия.Вставить("Данные",            ДанныеДляВыгрузки);
				#Если Клиент Тогда
					ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДата());
				#Иначе
					ДанныеСобытия.Вставить("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
				#КонецЕсли
				
				Комментарий = "Прогрес: "+Формат(ТекущийПроцент, "ЧН=0; ЧГ=")+"; в пакете: " + Формат(ЗаписьВПакете, "ЧН=0; ЧГ=")+"; выгружено: " + Формат(ЗаписейВыгружено, "ЧН=0; ЧГ=");
				Комментарий = Комментарий + "
				|	Ошибка: " + ВыходныеПараметры[1];
				
				МенеджерОборудованияРарусСервер.ЗаписатьСобытиеЖурналаОборудования(Параметры.ГруппаТоваровОборудования, Параметры.Идентификатор, "Выгрузка данных в весы с ошибкой", Комментарий, ДанныеСобытия);
				
				Возврат Результат;
			КонецЕсли;
			
			ЗаписьВПакете = 0;
			ТекущийПакет = ТекущийПакет + 1;
			
			ТекущийПроцент = ТекущийПроцент + ПроцентИнкремент;
			
			#Если Клиент Тогда
			МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Выгрузка данных...'"), Окр(ТекущийПроцент));
			#КонецЕсли
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗаписатьМоментВыгрузки Тогда
		МенеджерОборудованияРарусСервер.УстановитьМоментЗагрузки(Параметры.Идентификатор, "Товары", 0, МоментВыгрузкиДанных);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет выгрузку таблицы товаров в весы с печатью этикеток.
//
// Параметры:
//  ОбъектДрайвера                 - <*>
//                                 - Объект драйвера торгового оборудования.
//
//  Товары                         - <ТаблицаЗначений>
//                                 - Таблица товаров, подлежащих выгрузке в весы.
//                                   Таблица имеет следующие колонки:
//                                     PLU                        - <Число>
//                                                                - Идентификатор товара в весах.
//									   Штрихкод 				  - <Строка>
//                                                                - Штрихкод товара на кассе.
//                                     Наименование               - <Строка>
//																  - Наименование товара сокращенное (для печати на этикетке).
//                                     НаименованиеПолное         - <Строка>
//																  - Наименование товара полное (для отображения на табло).
//                                     Цена                       - <Число>
//                                                                - Цена номенклатуры.
//
//  ЧастичнаяВыгрузка               - <Булево>
//                                  - Признак частичной выгрузки товара.
//
Функция ВыгрузитьСообщения(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаВыгрузки, ПолнаяВыгрузка, ВыходныеПараметры) 
	
	Результат = Истина;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Нет данных для выгрузки.'"));
		Возврат Ложь;
	КонецЕсли;
	
	РазмерПакета     = РазмерПакетаПоУмолчанию();
	ТекущийПакет     = 1;
	ЗаписьВПакете    = 0;
	ЗаписейВыгружено = 0;
	ЗаписейВсего     = ТаблицаВыгрузки.Количество();
	//СтатусПакета     = "first";
	
	ТекущийПроцент = 0;
	
	#Если Клиент Тогда
		МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Инициализация выгрузки...'"), Окр(ТекущийПроцент));
	#КонецЕсли
	ПроцентИнкремент = 100 / (ЗаписейВсего / РазмерПакета);
	
	МассивТоваров = Новый Массив;
	
	Для Каждого Позиция Из ТаблицаВыгрузки  Цикл
		
		Если ЗаписьВПакете = 0 Тогда
			МассивТоваров.Очистить();
		КонецЕсли;
		
		СтрокаМассиваТоваров = Новый СписокЗначений; 
		СтрокаМассиваТоваров.Добавить(Число(Позиция.PLU));
		СтрокаМассиваТоваров.Добавить(Число(Позиция.Код));
		СтрокаМассиваТоваров.Добавить(Позиция.Наименование);
		СтрокаМассиваТоваров.Добавить(Позиция.Цена);
		СтрокаМассиваТоваров.Добавить(Позиция.ОписаниеТовара);
		СтрокаМассиваТоваров.Добавить(Позиция.СрокХранения);
		СтрокаМассиваТоваров.Добавить(Позиция.Весовой);
		МассивТоваров.Добавить(СтрокаМассиваТоваров);
		
		ЗаписейВыгружено = ЗаписейВыгружено + 1;
		ЗаписьВПакете = ЗаписьВПакете + 1;
		
		Если (ЗаписьВПакете = РазмерПакета) ИЛИ (ЗаписейВыгружено = ЗаписейВсего) Тогда  
			
			ДанныеДляВыгрузки = МенеджерОборудованияВызовСервера.СформироватьТаблицуСообщенийТоваров(МассивТоваров);
			
			//Если (ЗаписейВыгружено = ЗаписейВсего) Тогда
			//	СтатусПакета = "last";
			//ИначеЕсли (ТекущийПакет > 1) Тогда
			//	СтатусПакета = "regular";
			//КонецЕсли;
			
			Ответ = ОбъектДрайвера.ВыгрузитьТовары(ПараметрыПодключения.ИДУстройства, ДанныеДляВыгрузки);
			Если НЕ Ответ Тогда
				Результат = Ложь;
				ВыходныеПараметры.Очистить();
				ВыходныеПараметры.Добавить(999);
				ВыходныеПараметры.Добавить("");
				ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1]);
				Возврат Результат;
			КонецЕсли;
			
			ЗаписьВПакете = 0;
			ТекущийПакет = ТекущийПакет + 1;
			
			ТекущийПроцент = ТекущийПроцент + ПроцентИнкремент;
			#Если Клиент Тогда
			МенеджерОборудованияКлиент.СостояниеПроцесса(НСтр("ru='Выгрузка данных...'"), Окр(ТекущийПроцент));
			#КонецЕсли
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Размер пакета в элементах передаваемой информации в драйвер.
//
Функция РазмерПакетаПоУмолчанию() Экспорт
	
	РазмерПакета = 2;
	Возврат РазмерПакета;
	
КонецФункции

// Функция осуществляет очистку таблицы товаров в весы с печатью этикеток.
//
Функция ОчиститьТоварыВВесах(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) 

	Результат = Истина;
	
	Попытка
		Ответ = ОбъектДрайвера.ОчиститьТовары(ПараметрыПодключения.ИДУстройства);
		Если НЕ Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1])
		Иначе
			ВыходныеПараметры.Очистить();
		КонецЕсли;
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ОчиститьТовары>.'") +  ОписаниеОшибки());
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Функция осуществляет выгрузку шаблонов в весы с печатью этикеток.
//
Функция ВыгрузитьШаблоныВВесы(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) 

	Результат = Истина;
	
	КаталогШаблонов = ПолучитьЗначениеПараметраСтруктуры(Параметры, "КаталогШаблонов", "");
	
	Если НЕ ЗначениеЗаполнено(КаталогШаблонов) Тогда
		Возврат Результат;
	КонецЕсли;
	
	МассивИменШаблонов = НайтиФайлы(КаталогШаблонов,"*.DAT");
	Для Каждого ТекущийШаблон Из МассивИменШаблонов Цикл
		
		ТД = Новый ТекстовыйДокумент;
		ТД.Прочитать(ТекущийШаблон.ПолноеИмя);
		ДанныеФайла = ТД.ПолучитьТекст();
		
		Попытка
			Ответ = ОбъектДрайвера.ВыгрузитьДанныеDIGI(ПараметрыПодключения.ИДУстройства, ТекущийШаблон.Имя, ДанныеФайла);
			Если НЕ Ответ Тогда
				Результат = Ложь;
				ВыходныеПараметры.Очистить();
				ВыходныеПараметры.Добавить(999);
				ВыходныеПараметры.Добавить("");
				ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1])
			Иначе
				ВыходныеПараметры.Очистить();
			КонецЕсли;
		Исключение
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ВыгрузитьДанные>.'") +  ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет тестирование устройства.
//
Функция ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат            = Истина;
	РезультатТеста       = "";
	АктивированДемоРежим = "";
	
	Для Каждого Параметр Из Параметры Цикл
		Если Лев(Параметр.Ключ, 2) = "P_" Тогда
			ЗначениеПараметра = Параметр.Значение;
			ИмяПараметра = Сред(Параметр.Ключ, 3);
			Ответ = ОбъектДрайвера.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра) 
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		Ответ = ОбъектДрайвера.ТестУстройства(РезультатТеста, АктивированДемоРежим);
	
		Если Ответ Тогда
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(0);
		Иначе
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
		КонецЕсли;
		ВыходныеПараметры.Добавить(РезультатТеста);
		ВыходныеПараметры.Добавить(АктивированДемоРежим);
	
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ТестУстройства>.'") + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

// Функция осуществляет выполнение дополнительного действия для устройства.
//
Функция ВыполнитьДополнительноеДействие(ОбъектДрайвера, Параметры, ПараметрыПодключения, ИмяДействия, ВыходныеПараметры)
	
	Результат  = Истина;
	
	Для Каждого Параметр Из Параметры Цикл
		Если Лев(Параметр.Ключ, 2) = "P_" Тогда
			ЗначениеПараметра = Параметр.Значение;
			ИмяПараметра = Сред(Параметр.Ключ, 3);
			Ответ = ОбъектДрайвера.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра) 
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		Ответ = ОбъектДрайвера.ВыполнитьДополнительноеДействие(ИмяДействия);
		Если НЕ Ответ Тогда
			Результат = Ложь;
			ВыходныеПараметры.Очистить();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить("");
			ОбъектДрайвера.ПолучитьОшибку(ВыходныеПараметры[1])
		Иначе
			ВыходныеПараметры.Очистить();  
		КонецЕсли;
	Исключение
		Результат = Ложь;
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Ошибка вызова метода <ОбъектДрайвера.ВыполнитьДополнительноеДействие>.'") + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает версию установленного драйвера.
//
Функция ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	
	ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
	ВыходныеПараметры.Добавить(НСтр("ru='Не определена'"));
	
	Попытка
		ВерсияДрайвера = ОбъектДрайвера.ПолучитьНомерВерсии();
	Исключение
		
		Попытка
			// Получаем описание драйвера.
			ОписаниеДрайвера = "";
			ОбъектДрайвера.ПолучитьОписание(ОписаниеДрайвера);
			ОписаниеДрайвераПараметры = МенеджерОборудованияВызовСервера.ПолучитьОписаниеДрайвера(ОписаниеДрайвера);
			ВерсияДрайвера = ОписаниеДрайвераПараметры.ВерсияДрайвера;
		Исключение
			Результат = Истина;
		КонецПопытки;
	КонецПопытки;
	
	ВыходныеПараметры[1] = ВерсияДрайвера;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает описание установленного драйвера.
//
Функция ПолучитьОписаниеДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)
	
	Результат = Истина;
	//#Если Клиент Тогда
	ВыходныеПараметры.Очистить();
	ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
	ВыходныеПараметры.Добавить(НСтр("ru='Не определена'"));
	
	ВыходныеПараметры.Добавить(НСтр("ru='Не определено'"));
	ВыходныеПараметры.Добавить(НСтр("ru='Не определено'"));
	ВыходныеПараметры.Добавить(НСтр("ru='Не определено'"));
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить(Неопределено);
	
	НаименованиеДрайвера      = "";
	ОписаниеДрайвера          = "";
	ТипОборудования           = "";
	ИнтеграционныйКомпонент   = Ложь;
	ОсновнойДрайверУстановлен = Ложь;
	#Если Клиент Тогда
	РевизияИнтерфейса         = МенеджерОборудованияКлиентПовтИсп.РевизияИнтерфейсаДрайверов();
	#Иначе
	РевизияИнтерфейса         = 2005;
	#КонецЕсли
	URLЗагрузкиДрайвера       = "";
	ПараметрыДрайвера         = "";
	ДополнительныеДействия    = "";
	
	Если ПараметрыПодключения.Свойство("ТипОборудования") Тогда
		ТипОборудования = ПараметрыПодключения.ТипОборудования;
		// Предопределенный параметр с указанием типа драйвера.
		ОбъектДрайвера.УстановитьПараметр("EquipmentType", ТипОборудования) 
	КонецЕсли;
		
	Попытка
		// Получаем версию драйвера
		ВерсияДрайвера = ОбъектДрайвера.ПолучитьНомерВерсии();
			// Получаем описание драйвера
		ОбъектДрайвера.ПолучитьОписание(НаименованиеДрайвера, ОписаниеДрайвера, ТипОборудования, РевизияИнтерфейса, ИнтеграционныйКомпонент, 
			ОсновнойДрайверУстановлен, URLЗагрузкиДрайвера);
	Исключение
		Попытка
			ОписаниеДрайвера = "";
			ОбъектДрайвера.ПолучитьОписание(ОписаниеДрайвера);
			ОписаниеДрайвераПараметры = МенеджерОборудованияВызовСервера.ПолучитьОписаниеДрайвера(ОписаниеДрайвера);
			ВерсияДрайвера            = ОписаниеДрайвераПараметры.ВерсияДрайвера;
			НаименованиеДрайвера      = ОписаниеДрайвераПараметры.НаименованиеДрайвера;
			ОписаниеДрайвера          = ОписаниеДрайвераПараметры.ОписаниеДрайвера;
			ТипОборудования           = ОписаниеДрайвераПараметры.ТипОборудования;
			ИнтеграционныйКомпонент   = ОписаниеДрайвераПараметры.ИнтеграционныйКомпонент;
			ОсновнойДрайверУстановлен = ОписаниеДрайвераПараметры.ОсновнойДрайверУстановлен;
			URLЗагрузкиДрайвера       = ОписаниеДрайвераПараметры.URLЗагрузкиДрайвера;
			// Получаем ревизию интерфейса драйвера.
			РевизияИнтерфейса = ОбъектДрайвера.ПолучитьРевизиюИнтерфейса();
		Исключение
			ИсключениеРезультат = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка получения описания драйвера'") + Символы.ПС + ОписаниеОшибки());
		КонецПопытки
	КонецПопытки;
	
	Если Результат Тогда
		ВыходныеПараметры[1] = ВерсияДрайвера;
		ВыходныеПараметры[2] = НаименованиеДрайвера;
		ВыходныеПараметры[3] = ОписаниеДрайвера;
		ВыходныеПараметры[4] = ТипОборудования;
		ВыходныеПараметры[5] = РевизияИнтерфейса;
		ВыходныеПараметры[6] = ИнтеграционныйКомпонент;
		ВыходныеПараметры[7] = ОсновнойДрайверУстановлен;
		ВыходныеПараметры[8] = URLЗагрузкиДрайвера;
		
		// Получаем описание драйвера
		ОбъектДрайвера.ПолучитьПараметры(ПараметрыДрайвера);
		ВыходныеПараметры[9] = ПараметрыДрайвера;
		// Получаем дополнительные действия.
		ОбъектДрайвера.ПолучитьДополнительныеДействия(ДополнительныеДействия);
		ВыходныеПараметры[10] = ДополнительныеДействия;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сформировать таблицу товаров в XML структуре для весов с печатью этикеток.
//
Функция СформироватьТаблицуТоваров(ДанныеЗагрузки) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Table");
	Для Каждого Позиция Из ДанныеЗагрузки  Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Record");
		ЗаписьXML.ЗаписатьАтрибут("PLU",           XMLСтрока(Позиция[0].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Code",          XMLСтрока(Позиция[1].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Name1",         XMLСтрока(Позиция[2].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Name2",         XMLСтрока(Позиция[3].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Price",         XMLСтрока(Позиция[4].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Label",         XMLСтрока(Позиция[5].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Message",       XMLСтрока(Позиция[6].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Tare",          XMLСтрока(Позиция[7].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Ingr",          XMLСтрока(Позиция[8].Значение));
		ЗаписьXML.ЗаписатьАтрибут("BP",            XMLСтрока(Позиция[9].Значение));
		ЗаписьXML.ЗаписатьАтрибут("ShelfLife",     XMLСтрока(Позиция[10].Значение));
		ЗаписьXML.ЗаписатьАтрибут("IsWeightGoods", XMLСтрока(Позиция[11].Значение));
		ЗаписьXML.ЗаписатьАтрибут("MessageText",   XMLСтрока(Позиция[12].Значение));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

// Сформировать таблицу товаров в XML структуре для весов с печатью этикеток.
//
Функция СформироватьТаблицуСообщенийТоваров(ДанныеЗагрузки) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Table");
	Для Каждого Позиция Из ДанныеЗагрузки Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Record");
		ЗаписьXML.ЗаписатьАтрибут("Number",   XMLСтрока(Позиция[0].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Message1", XMLСтрока(Позиция[1].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Message2", XMLСтрока(Позиция[2].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Message3", XMLСтрока(Позиция[3].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Message4", XMLСтрока(Позиция[4].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Message5", XMLСтрока(Позиция[5].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Message6", XMLСтрока(Позиция[6].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Message7", XMLСтрока(Позиция[7].Значение));
		ЗаписьXML.ЗаписатьАтрибут("Message8", XMLСтрока(Позиция[8].Значение));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

//Функция разбивает исходную строку на указанное количество строк заданной длины,
//При этом производится перенос только целых слов ...
//за исключением последнего слова, если его длина превышает максимальную длину строки
Функция ВыполнитьПереносСтрок(ИсходнаяСтрокаВходящая,ДлинаСтроки,КоличествоСтрок,РазделительСтрок=" ") Экспорт
	
	ИсходнаяСтрока = ИсходнаяСтрокаВходящая;
	ИсходнаяСтрока = СокрЛП(ИсходнаяСтрока);
	Если ПустаяСтрока(ИсходнаяСтрока) Тогда
		Возврат ИсходнаяСтрока;
	КонецЕсли;
	ИсходнаяСтрока=СтрЗаменить(ИсходнаяСтрока,Символы.ПС," ");
	ИсходнаяСтрока=СтрЗаменить(ИсходнаяСтрока,"|"," ");
	//Нужно ли добавлять пробелы к ",.:-"?
	//Может вообще MS-Office подключить для расстановки переносов?...
	ИсходнаяСтрока=СтрЗаменить(ИсходнаяСтрока,":",": ");
	//А вот эти символы пока не заменяем
	//ИсходнаяСтрока=СтрЗаменить(ИсходнаяСтрока,",",", ");
	//ИсходнаяСтрока=СтрЗаменить(ИсходнаяСтрока,".",". ");
	//ИсходнаяСтрока=СтрЗаменить(ИсходнаяСтрока,"-"," - ");
	//Убираем лишние пробелы
	ИсходнаяСтрока=СтрЗаменить(ИсходнаяСтрока,"  "," ");
	//ПромежуточнаяСтрока="";
	//ПромежуточнаяСтрока2="";
	ИтоговаяСтрока="";
	ПредыдущееСлово="";
	Слово="";
	ДобавилиСтрок=0;
	Пока Истина Цикл
		Рез=Найти(ИсходнаяСтрока," ");
		Если Рез=0 Тогда
			//осталось одно слово без пробелов.
			
			//Но могли забыть предыдущее слово
			Если НЕ ПустаяСтрока(ПредыдущееСлово) Тогда
				Если СтрДлина(СокрЛП(ПредыдущееСлово+" "+ИсходнаяСтрока))>ДлинаСтроки Тогда
					//ИтоговаяСтрока=ИтоговаяСтрока+Слово+"|";
					ИтоговаяСтрока=ИтоговаяСтрока+ПредыдущееСлово+РазделительСтрок;
					ДобавилиСтрок=ДобавилиСтрок+1;
				Иначе
					//Нужно добавить последнее слово к строке
					ИсходнаяСтрока=ПредыдущееСлово+" "+ИсходнаяСтрока;
				КонецЕсли;
			КонецЕсли;
			Если ДобавилиСтрок>=КоличествоСтрок Тогда
				Прервать;
			КонецЕсли;
			//теперь нужно разбить последнее слово
			
			Пока СтрДлина(ИсходнаяСтрока)>ДлинаСтроки Цикл
				ИтоговаяСтрока=ИтоговаяСтрока+Лев(ИсходнаяСтрока,ДлинаСтроки)+РазделительСтрок;
				ДлинаИсходной=СтрДлина(ИсходнаяСтрока);
				ИсходнаяСтрока=СокрЛП(Прав(ИсходнаяСтрока,ДлинаИсходной-ДлинаСтроки));
				ДобавилиСтрок=ДобавилиСтрок+1;
				Если ДобавилиСтрок>=КоличествоСтрок Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ДобавилиСтрок>=КоличествоСтрок Тогда
				Прервать;
			КонецЕсли;
			Если НЕ ПустаяСтрока(ИсходнаяСтрока) Тогда
				ИтоговаяСтрока=ИтоговаяСтрока+ИсходнаяСтрока;
				ДобавилиСтрок=ДобавилиСтрок+1;
			КонецЕсли;
			Прервать;
		Иначе
			Слово=СокрЛП(Лев(ИсходнаяСтрока,Рез));
			//Выделили слово
			ДлинаИсходной=СтрДлина(ИсходнаяСтрока);
			ИсходнаяСтрока=СокрЛП(Прав(ИсходнаяСтрока,ДлинаИсходной-Рез));
			//Уменьшим исходную строку
			Если СтрДлина(Слово)>=ДлинаСтроки Тогда
				//Выведем слово в итоговую строку
				//НО сначала выведем предыдущее слово, если оно есть
				//не важно, какой оно длины.
				Если НЕ ПустаяСтрока(ПредыдущееСлово) Тогда
					ИтоговаяСтрока=ИтоговаяСтрока+ПредыдущееСлово+РазделительСтрок;
					ПредыдущееСлово="";
					ДобавилиСтрок=ДобавилиСтрок+1;
				КонецЕсли;
				Если ДобавилиСтрок>=КоличествоСтрок Тогда
					Прервать;
				КонецЕсли;
				//Теперь частями выведем строку
				Пока СтрДлина(Слово)>ДлинаСтроки Цикл
					ИтоговаяСтрока=ИтоговаяСтрока+Лев(Слово,ДлинаСтроки)+РазделительСтрок;
					ДлинаСлова=СтрДлина(Слово);
					Слово=СокрЛП(Прав(Слово,ДлинаСлова-ДлинаСтроки));
					ДобавилиСтрок=ДобавилиСтрок+1;
					Если ДобавилиСтрок>=КоличествоСтрок Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
				//Все, что осталось от слова добавим к предыдущему слову
				//т.к. предыдущее мы только что вывели, то
				ПредыдущееСлово=Слово;
				Если ДобавилиСтрок>=КоличествоСтрок Тогда
					Прервать;
				КонецЕсли;
			Иначе
				//Увеличим предыдущее слово
				//но сначала проверим - вместится ли строка
				Если СтрДлина(СокрЛП(ПредыдущееСлово+" "+Слово))>ДлинаСтроки Тогда
					//Выведем предыдущее слово.
					ИтоговаяСтрока=ИтоговаяСтрока+ПредыдущееСлово+РазделительСтрок;
					ПредыдущееСлово="";
					ДобавилиСтрок=ДобавилиСтрок+1;
				КонецЕсли;
				ПредыдущееСлово=СокрЛП(ПредыдущееСлово+" "+Слово);
				Если ДобавилиСтрок>=КоличествоСтрок Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СокрЛП(ИтоговаяСтрока);
	
КонецФункции

#КонецОбласти