// @strict-types

#Область СлужебныйПрограммныйИнтерфейс
// @strict-types


#Область СлужебныеПроцедурыИФункции

#Область КлючДоступаКСервисуЭДО

// См. АвтоматическоеПолучениеЭДО.ИспользоватьПолучениеПоКлючуДоступа
Функция ИспользоватьПолучениеПоКлючуДоступа() Экспорт
	
	Возврат АвтоматическоеПолучениеЭДО.ИспользоватьПолучениеПоКлючуДоступа();
	
КонецФункции

#КонецОбласти

#Область ТокеныДоступаКСервисуЭДО

// См. АвтоматическоеПолучениеЭДО.ИспользоватьПолучениеПоТокенамДоступа
Функция ИспользоватьПолучениеПоТокенамДоступа() Экспорт
	
	Возврат АвтоматическоеПолучениеЭДО.ИспользоватьПолучениеПоТокенамДоступа();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти
