// Модуль менеджера документа "Транспортная накладная ЕГАИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	ИтогиОперации.Вставить("СуммаДокумента", 0);
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

Функция ТранспортнаяНакладнаяXML(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДокументТранспортнаяНакладнаяЕГАИС.ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ОрганизацияЕГАИС.Код КАК ИдентификаторФСРАР,
	|	ДокументТранспортнаяНакладнаяЕГАИС.Идентификатор КАК Идентификатор,
	|	ДокументТранспортнаяНакладнаяЕГАИС.Номер                        КАК Номер,
	|	ДокументТранспортнаяНакладнаяЕГАИС.Дата                         КАК Дата,
	|	ВЫРАЗИТЬ(ДокументТранспортнаяНакладнаяЕГАИС.Комментарий КАК Строка(500)) КАК Комментарий,
	|	ДокументТранспортнаяНакладнаяЕГАИС.Перевозчик КАК Перевозчик,
	|	ДокументТранспортнаяНакладнаяЕГАИС.Прицеп КАК Прицеп,
	|	ДокументТранспортнаяНакладнаяЕГАИС.Заказчик КАК Заказчик,
	|	ДокументТранспортнаяНакладнаяЕГАИС.Водитель КАК Водитель,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ПунктПогрузки КАК ПунктПогрузки,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ПунктРазгрузки КАК ПунктРазгрузки,
	|	ДокументТранспортнаяНакладнаяЕГАИС.Перенаправление КАК Перенаправление,
	|	ДокументТранспортнаяНакладнаяЕГАИС.Экспедитор КАК Экспедитор,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ИзменениеПраваСобственности КАК ИзменениеПраваСобственности,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ТранспортноеСредство.ТипТС КАК ТипТС,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ТранспортноеСредство.НомерТС КАК НомерТС,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ДокументОснование                                 КАК ДокументОснование,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ТоварноТранспортнаяНакладная                      КАК ТТН,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ТоварноТранспортнаяНакладная.РегистрационныйНомер КАК ИдентификаторТТН,
	|	ДокументТранспортнаяНакладнаяЕГАИС.НомерТН    КАК НомерТН,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ДатаТН     КАК ДатаТН,
	|	ДокументТранспортнаяНакладнаяЕГАИС.Количество КАК Количество,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ФорматОбмена КАК ФорматОбмена,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ТранспортныеНакладные.(
	|		ДокументОснование,
	|		ДокументОснование.РегистрационныйНомер КАК ИдентификаторТТН
	|	) КАК ТранспортныеНакладные
	|ИЗ
	|	Документ.ТранспортнаяНакладнаяЕГАИС КАК ДокументТранспортнаяНакладнаяЕГАИС
	|ГДЕ
	|	ДокументТранспортнаяНакладнаяЕГАИС.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		
		ПараметрыЗапроса = ПараметрыОбъектов[Перечисления.ВидыОбъектовЕГАИС.ТранспортнаяНакладная];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТранспортнаяНакладная;
	ФорматОбмена = 4;
	
	ТранспортныеНакладные = Выборка.ТранспортныеНакладные.Выгрузить();
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ИдентификаторФСРАР",    Выборка.ИдентификаторФСРАР);
	ДанныеДляВыгрузки.Вставить("Объект",                ДокументСсылка);
	ДанныеДляВыгрузки.Вставить("ШапкаДокумента",        Выборка);
	ДанныеДляВыгрузки.Вставить("ТранспортныеНакладные", ТранспортныеНакладные);
	
	СообщенияXML = ИнтеграцияЕГАИС.СформироватьСообщенияXML(ВидСообщения, ДанныеДляВыгрузки, ФорматОбмена);
	
	Возврат СообщенияXML;
	
КонецФункции

Функция ЗапросНаОтменуПроведенияXML(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДокументТранспортнаяНакладнаяЕГАИС.ХозОперация КАК ХозОперация,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ОрганизацияЕГАИС.Код КАК ИдентификаторФСРАР,
	|	ДокументТранспортнаяНакладнаяЕГАИС.Номер КАК Номер,
	|	ДокументТранспортнаяНакладнаяЕГАИС.Дата КАК Дата,
	|	ДокументТранспортнаяНакладнаяЕГАИС.НомерТН КАК НомерТН,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ДатаТН КАК ДатаТН,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ФорматОбмена КАК ФорматОбмена,
	|	ДокументТранспортнаяНакладнаяЕГАИС.РегистрационныйНомер КАК РегистрационныйНомер
	|ИЗ
	|	Документ.ТранспортнаяНакладнаяЕГАИС КАК ДокументТранспортнаяНакладнаяЕГАИС
	|ГДЕ
	|	ДокументТранспортнаяНакладнаяЕГАИС.Ссылка = &Ссылка И 
	|	ДокументТранспортнаяНакладнаяЕГАИС.ПометкаУдаления = ЛОЖЬ
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		
		ПараметрыЗапроса = ПараметрыОбъектов[Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТранспортнойНакладной];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТранспортнойНакладной;
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ИдентификаторФСРАР", Выборка.ИдентификаторФСРАР);
	ДанныеДляВыгрузки.Вставить("Объект",             ДокументСсылка);
	ДанныеДляВыгрузки.Вставить("ШапкаДокумента",     Выборка);
	
	СообщенияXML = ИнтеграцияЕГАИС.СформироватьСообщенияXML(ВидСообщения, ДанныеДляВыгрузки, 2);
	
	Возврат СообщенияXML;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("НомерТТН");
	ОбязательныеРеквизиты.Добавить("ДатаТТН");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	//ОбязательныеРеквизиты.Добавить("РегистрационныйНомер");
	ОбязательныеРеквизиты.Добавить("НомерТН");
	ОбязательныеРеквизиты.Добавить("ДатаТН");
	ОбязательныеРеквизиты.Добавить("ОрганизацияЕГАИС");
	ОбязательныеРеквизиты.Добавить("ТранспортноеСредство");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов табличных частей
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПараметрыДействия=Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОрганизацияЕГАИС", Объект.ОрганизацияЕГАИС);
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДокументОснованиеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Прописать проверку соответствия реквизитов объекта выбранной хоз.операции
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Грузоотправитель".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияЕГАИСПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
КонецПроцедуры // ГрузоотправительПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОВЕДЕНИЕ 


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью команд заполнения объекта
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть не доступны в зависимости от параметров объекта
	ДоступностьКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ДоступностьКоманд;
	
КонецФункции // ПолучитьДоступностьКомандЗаполнения()

#Область ДействияПриОбменеЕГАИС

// Статус после подготовки к передаче данных.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Ссылка на документ.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - ВидСообщения ЕГАИС.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения) Экспорт
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТранспортнаяНакладная Тогда
		ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.КПередаче;
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТранспортнойНакладной Тогда
		ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияКПередаче;
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыКПередаче(ДокументСсылка, ВидСтатуса);
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Статус после передачи данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * СтатусОбработки - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки) Экспорт
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТранспортнаяНакладная Тогда
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		
		ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПереданВУТМ;
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПолученЕГАИС);
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПроведенЕГАИС);
		
		ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи;
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусовБазовыйПроцесс);
		
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТранспортнойНакладной Тогда
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		
		ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПереданВУТМ;
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПолученЕГАИС);
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПроведенЕГАИС);
		
		ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОшибка;
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения);
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусовБазовыйПроцесс);
		
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Статус после получения данных из ЕГАИС.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Документ, для которого требуется обновить статус.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения обмена с ЕГАИС.
//  ДополнительныеПараметры - Неопределено, Структура со свойствами:
//   * СтатусОбработки - Перечисление.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения.
//   * ВидСообщенияКвитанции - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения, на которую получена квитанция.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
	ВидыСтатусовБазовыйПроцесс.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПроведенЕГАИС;
	ВидыСтатусовБазовыйПроцесс.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОбрабатываетсяЕГАИС;
	ВидыСтатусовБазовыйПроцесс.ОшибкаПроведения = Неопределено;
	ВидыСтатусовБазовыйПроцесс.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи;
	ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные);
	ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется);
	ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения);
	ВидыСтатусовБазовыйПроцесс.УведомлениеОРегистрацииДвижения = Ложь;
	
	ВидыСтатусовЗапросНаОтменуПроведения = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
	ВидыСтатусовЗапросНаОтменуПроведения.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен;
	ВидыСтатусовЗапросНаОтменуПроведения.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОбрабатываетсяЕГАИС;
	ВидыСтатусовЗапросНаОтменуПроведения.ОтменаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен;
	ВидыСтатусовЗапросНаОтменуПроведения.ОшибкаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОшибка;
	ВидыСтатусовЗапросНаОтменуПроведения.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОшибка;
	ВидыСтатусовЗапросНаОтменуПроведения.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения);
	ВидыСтатусовЗапросНаОтменуПроведения.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
	ВидыСтатусовЗапросНаОтменуПроведения.УведомлениеОРегистрацииДвижения = Ложь;
	
	ВыполнитьРасчетТекущегоСостояния = Истина;
	Если ДополнительныеПараметры <> Неопределено
		И ДополнительныеПараметры.Свойство("ТекущееСостояние")
		И ДополнительныеПараметры.ТекущееСостояние <> Неопределено Тогда
		ВыполнитьРасчетТекущегоСостояния = ДополнительныеПараметры.ТекущееСостояние;
	КонецЕсли;
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияДоставлена Тогда
		
		ВидыСтатусов = Неопределено;
		Если ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ТранспортнаяНакладная Тогда
			
			ВидыСтатусов = ВидыСтатусовБазовыйПроцесс;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТранспортнойНакладной Тогда
			
			ВидыСтатусов = ВидыСтатусовЗапросНаОтменуПроведения;
			
		Иначе
			ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
		КонецЕсли;
		
		Если ВидыСтатусов <> Неопределено Тогда
			ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыПриПолученииКвитанции(
				ДокументСсылка,
				"КвитанцияДоставлена", ДополнительныеПараметры.СтатусОбработки,
				ВидыСтатусов, ВыполнитьРасчетТекущегоСостояния);
		КонецЕсли;
		
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияВыполнена Тогда
		
		ВидыСтатусов = Неопределено;
		Если ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ТранспортнаяНакладная Тогда
			
			ВидыСтатусов = ВидыСтатусовБазовыйПроцесс;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТранспортнойНакладной Тогда
			
			ВидыСтатусов = ВидыСтатусовЗапросНаОтменуПроведения;
			
		Иначе
			ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
		КонецЕсли;
		
		Если ВидыСтатусов <> Неопределено Тогда
			ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыПриПолученииКвитанции(
				ДокументСсылка,
				"КвитанцияВыполнена", ДополнительныеПараметры.СтатусОбработки,
				ВидыСтатусов, ВыполнитьРасчетТекущегоСостояния);
		КонецЕсли;
		
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Обновить статус после подготовки к передаче данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обновить статус после передачи данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обновить статус после получения данных из ЕГАИС.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Документ, для которого требуется обновить статус.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения обмена с ЕГАИС.
//  ДополнительныеПараметры - Неопределено, Структура со свойствами:
//   * СтатусОбработки - Перечисление.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения.
//   * ВидСообщенияКвитанции - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения, на которую получена квитанция.
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Получить последовательность операций в течении жизненного цикла документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Документ, для которого требуется обновить статус.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. функцию ИнтеграцияЕГАИС.ПустаяТаблицаПоследовательностьОпераций().
//
Функция ПоследовательностьОпераций(ДокументСсылка) Экспорт
	
	Таблица = ИнтеграцияЕГАИС.ПустаяТаблицаПоследовательностьОпераций();
	
	Исходящее = Перечисления.ВходящееИсходящееСобытие.Исходящее;
	Входящее  = Перечисления.ВходящееИсходящееСобытие.Входящее;
	
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0, Исходящее, Перечисления.ВидыОбъектовЕГАИС.ТранспортнаяНакладная,                 ДокументСсылка);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0, Исходящее, Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТранспортнойНакладной, ДокументСсылка);
	
	Возврат Таблица;
	
КонецФункции

// Обработчик изменения статуса документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Документ.
//  ПредыдущийСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиЕГАИС - Предыдущий статус.
//  НовыйСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиЕГАИС - Предыдущий статус.
//  ПараметрыОбновленияСтатуса - Структура - см. функцию ИнтеграцияЕГАИС.ПараметрыОбновленияСтатуса().
//
Процедура ПриИзмененииСтатусаДокумента(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус, ПараметрыОбновленияСтатуса) Экспорт
	
	ВидыСтатусовДвижений = ВидыСтатусовДвижений();
	
	ДобавитьДвижения = ИнтеграцияЕГАИС.СтатусТребуетДобавленияДвижений(ВидыСтатусовДвижений, ПредыдущийСтатус, НовыйСтатус);
	УдалитьДвижения = ИнтеграцияЕГАИС.СтатусТребуетУдаленияДвижений(ВидыСтатусовДвижений, ПредыдущийСтатус, НовыйСтатус);
	
	Если ПараметрыОбновленияСтатуса.ОбновлятьДвижения
		И (ДобавитьДвижения Или УдалитьДвижения) Тогда
		
	КонецЕсли;
	
	//РассчитатьСтатусОформления(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус);
	
КонецПроцедуры

#КонецОбласти

#Область Статусы

// Возвращает статусы ошибок.
//
// Возвращаемое значение:
//  Массив - Статусы ошибок.
//
Функция ВидыСтатусовОшибки() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПроведенияЕГАИС);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОшибка);
	
	Возврат ВидыСтатусов;
	
КонецФункции

// Возвращает конечные статусы.
//
// Возвращаемое значение:
//  Массив - Конечные статусы.
//
Функция КонечныеВидыСтатусов() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПроведенияЕГАИС);
	
	Возврат ВидыСтатусов;
	
КонецФункции

// Возвращает запрос для получения статуса оформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Документ основание.
// 
// Возвращаемое значение:
//  Запрос - Запрос для получения статуса оформления.
//
Функция ЗапросСтатусаОформления(ДокументОснование) Экспорт
	
	Запрос = ИнтеграцияЕГАИС.ЗапросСтатусаОформленияДействияНеОпределены();
	Запрос.УстановитьПараметр("КонечныеВидыСтатусовТранспортнойНакладнойЕГАИС", КонечныеВидыСтатусов());
	
	Возврат Запрос;
	
КонецФункции

// Возвращает статусы движений.
//
// Возвращаемое значение:
//  Массив - Статусы.
//
Функция ВидыСтатусовДвижений() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ПроведенЕГАИС);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен);
	
	Возврат ВидыСтатусов;
	
КонецФункции

#КонецОбласти

Функция СообщениеКПередачеXML(ДокументСсылка, ДальнейшееДействие, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные Тогда
		
		Возврат ТранспортнаяНакладнаяXML(ДокументСсылка);
		
	ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения Тогда
		
		Возврат ЗапросНаОтменуПроведенияXML(ДокументСсылка);
		
	КонецЕсли;
	
КонецФункции

#КонецЕсли