// Модуль объекта документа "Транспортная накладная ЕГАИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Товарно-nранспортная накладная исходящая"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА, ОграниченияЗаполнения = Неопределено) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДокументТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Грузоотправитель            КАК ОрганизацияЕГАИС,
	|	ДокументТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Перевозчик                  КАК Перевозчик,
	|	ДокументТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ТранспортноеСредство        КАК ТранспортноеСредство,
	|	ДокументТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ИзменениеПраваСобственности КАК ИзменениеПраваСобственности,
	|	ДокументТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Прицеп                      КАК Прицеп,
	|	ДокументТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Заказчик                    КАК Заказчик,
	|	ДокументТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Водитель                    КАК Водитель,
	|	ДокументТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ПунктПогрузки               КАК ПунктПогрузки,
	|	ДокументТоварноТранспортнаяНакладнаяВходящаяЕГАИС.ПунктРазгрузки              КАК ПунктРазгрузки,
	|	ДокументТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Перенаправление             КАК Перенаправление,
	|	ДокументТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Экспедитор                  КАК Экспедитор,
	|	СтатусыДокументовЕГАИС.ВидСтатуса                                              КАК ВидСтатуса
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС КАК ДокументТоварноТранспортнаяНакладнаяВходящаяЕГАИС
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|ПО
	|	СтатусыДокументовЕГАИС.Документ = ДокументТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Ссылка
	|ГДЕ
	|	ДокументТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	СУММА(ТоварноТранспортнаяНакладнаяВходящаяЕГАИСТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Товары КАК ТоварноТранспортнаяНакладнаяВходящаяЕГАИСТовары
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяВходящаяЕГАИСТовары.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	ДокументТранспортнаяНакладнаяЕГАИС.Ссылка                      КАК Ссылка,
	|	ДокументТранспортнаяНакладнаяЕГАИС.НомерТН                     КАК НомерТН,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ДатаТН                      КАК ДатаТН,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ИзменениеПраваСобственности КАК ИзменениеПраваСобственности,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ПунктРазгрузки              КАК ПунктРазгрузки,
	|	ДокументТранспортнаяНакладнаяЕГАИС.Количество                  КАК Количество,
	|	СтатусыДокументовЕГАИС.ВидСтатуса                              КАК ВидСтатуса
	|ИЗ
	|	Документ.ТранспортнаяНакладнаяЕГАИС КАК ДокументТранспортнаяНакладнаяЕГАИС
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|ПО
	|	СтатусыДокументовЕГАИС.Документ = ДокументТранспортнаяНакладнаяЕГАИС.Ссылка
	|ГДЕ
	|	ДокументТранспортнаяНакладнаяЕГАИС.ТоварноТранспортнаяНакладная = &Ссылка
	|	И НЕ СтатусыДокументовЕГАИС.ВидСтатуса В (&КонечныеВидыСтатусов)
	|	И НЕ ДокументТранспортнаяНакладнаяЕГАИС.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументТранспортнаяНакладнаяЕГАИС.ДатаТН ВОЗР,
	|	ДокументТранспортнаяНакладнаяЕГАИС.Дата ВОЗР
	|";
	
	Запрос.УстановитьПараметр("Ссылка",               ДанныеЗаполнения);
	Запрос.УстановитьПараметр("КонечныеВидыСтатусов", Документы.ТранспортнаяНакладнаяЕГАИС.КонечныеВидыСтатусов());
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаШапка      = ПакетЗапросов[ПакетЗапросов.Количество()-3].Выбрать();
	ВыборкаКоличество = ПакетЗапросов[ПакетЗапросов.Количество()-2].Выбрать();
	ВыборкаТН         = ПакетЗапросов[ПакетЗапросов.Количество()-1].Выбрать();
	
	Если НЕ ВыборкаШапка.Следующий() Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ВыборкаШапка.ИзменениеПраваСобственности Тогда
		ВызватьИсключение НСтр("ru = 'Не требуется, транспортную накладную оформляет грузополучатель'");
	Иначе
		
		ПоследняяТН = Новый Структура;
		ПоследняяТН.Вставить("Ссылка",         Неопределено);
		ПоследняяТН.Вставить("ПунктРазгрузки", Неопределено);
		ПоследняяТН.Вставить("Количество",     Неопределено);
		
		ИзменениеПраваСобственности = Ложь;
		Пока ВыборкаТН.Следующий() Цикл
			Если ВыборкаТН.ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПроведенЕГАИС
				И ВыборкаТН.ИзменениеПраваСобственности Тогда
				ИзменениеПраваСобственности = Истина;
				Прервать;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ПоследняяТН, ВыборкаТН);
		КонецЦикла;
		
		Если ИзменениеПраваСобственности Тогда
			ВызватьИсключение НСтр("ru = 'Не требуется, транспортную накладную оформляет грузополучатель'");
		КонецЕсли;
		
		ОрганизацияЕГАИС             = ВыборкаШапка.ОрганизацияЕГАИС;
		ТоварноТранспортнаяНакладная = ДанныеЗаполнения;
		Заказчик                     = ВыборкаШапка.Заказчик;
		
		Если ПоследняяТН.Ссылка = Неопределено Тогда
			
			ВыборкаКоличество.Следующий();
			
			ПунктПогрузки              = ВыборкаШапка.ПунктРазгрузки;
			ПунктРазгрузки             = Неопределено;
			Перевозчик                 = Неопределено;
			Перенаправление            = Неопределено;
			ТипТранспорта              = Неопределено;
			НомерТранспортногоСредства = Неопределено;
			Прицеп                     = Неопределено;
			Водитель                   = Неопределено;
			Экспедитор                 = Неопределено;
			Количество                 = ВыборкаКоличество.Количество;
			
		Иначе
			
			ПунктПогрузки              = ПоследняяТН.ПунктРазгрузки;
			ПунктРазгрузки             = Неопределено;
			Перевозчик                 = Неопределено;
			Перенаправление            = Неопределено;
			ТипТранспорта              = Неопределено;
			НомерТранспортногоСредства = Неопределено;
			Прицеп                     = Неопределено;
			Водитель                   = Неопределено;
			Экспедитор                 = Неопределено;
			Количество                 = ПоследняяТН.Количество;
			
			НоваяСтрока = ТранспортныеНакладные.Добавить();
			НоваяСтрока.ДокументОснование = ПоследняяТН.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС()

// Производит заполнение объекта на основании документа "Товарно-nранспортная накладная входящая"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ТоварноТранспортнаяНакладнаяВходящаяЕГАИС(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДокументТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Грузоотправитель            КАК ОрганизацияЕГАИС,
	|	ДокументТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Перевозчик                  КАК Перевозчик,
	|	ДокументТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ТранспортноеСредство        КАК ТранспортноеСредство,
	|	ДокументТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ИзменениеПраваСобственности КАК ИзменениеПраваСобственности,
	|	ДокументТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Прицеп                      КАК Прицеп,
	|	ДокументТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Заказчик                    КАК Заказчик,
	|	ДокументТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Водитель                    КАК Водитель,
	|	ДокументТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ПунктПогрузки               КАК ПунктПогрузки,
	|	ДокументТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ПунктРазгрузки              КАК ПунктРазгрузки,
	|	ДокументТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Перенаправление             КАК Перенаправление,
	|	ДокументТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Экспедитор                  КАК Экспедитор,
	|	СтатусыДокументовЕГАИС.ВидСтатуса                                              КАК ВидСтатуса
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС КАК ДокументТоварноТранспортнаяНакладнаяИсходящаяЕГАИС
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|ПО
	|	СтатусыДокументовЕГАИС.Документ = ДокументТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Ссылка
	|ГДЕ
	|	ДокументТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	СУММА(ТоварноТранспортнаяНакладнаяИсходящаяЕГАИСТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Товары КАК ТоварноТранспортнаяНакладнаяИсходящаяЕГАИСТовары
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИСТовары.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	ДокументТранспортнаяНакладнаяЕГАИС.Ссылка                      КАК Ссылка,
	|	ДокументТранспортнаяНакладнаяЕГАИС.НомерТН                     КАК НомерТН,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ДатаТН                      КАК ДатаТН,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ИзменениеПраваСобственности КАК ИзменениеПраваСобственности,
	|	ДокументТранспортнаяНакладнаяЕГАИС.ПунктРазгрузки              КАК ПунктРазгрузки,
	|	ДокументТранспортнаяНакладнаяЕГАИС.Количество                  КАК Количество,
	|	СтатусыДокументовЕГАИС.ВидСтатуса                              КАК ВидСтатуса
	|ИЗ
	|	Документ.ТранспортнаяНакладнаяЕГАИС КАК ДокументТранспортнаяНакладнаяЕГАИС
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|ПО
	|	СтатусыДокументовЕГАИС.Документ = ДокументТранспортнаяНакладнаяЕГАИС.Ссылка
	|ГДЕ
	|	ДокументТранспортнаяНакладнаяЕГАИС.ТоварноТранспортнаяНакладная = &Ссылка
	|	И НЕ СтатусыДокументовЕГАИС.ВидСтатуса В (&КонечныеВидыСтатусов)
	|	И НЕ ДокументТранспортнаяНакладнаяЕГАИС.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументТранспортнаяНакладнаяЕГАИС.ДатаТН ВОЗР,
	|	ДокументТранспортнаяНакладнаяЕГАИС.Дата ВОЗР
	|";
	
	Запрос.УстановитьПараметр("Ссылка",               ДанныеЗаполнения);
	Запрос.УстановитьПараметр("КонечныеВидыСтатусов", Документы.ТранспортнаяНакладнаяЕГАИС.КонечныеВидыСтатусов());
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаШапка      = ПакетЗапросов[ПакетЗапросов.Количество()-3].Выбрать();
	ВыборкаКоличество = ПакетЗапросов[ПакетЗапросов.Количество()-2].Выбрать();
	ВыборкаТН         = ПакетЗапросов[ПакетЗапросов.Количество()-1].Выбрать();
	
	Если НЕ ВыборкаШапка.Следующий() Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ВыборкаШапка.ИзменениеПраваСобственности Тогда
		ВызватьИсключение НСтр("ru = 'Не требуется, транспортную накладную оформляет грузополучатель'");
	Иначе
		
		ПоследняяТН = Новый Структура;
		ПоследняяТН.Вставить("Ссылка",         Неопределено);
		ПоследняяТН.Вставить("ПунктРазгрузки", Неопределено);
		ПоследняяТН.Вставить("Количество",     Неопределено);
		
		ИзменениеПраваСобственности = Ложь;
		Пока ВыборкаТН.Следующий() Цикл
			Если ВыборкаТН.ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПроведенЕГАИС
				И ВыборкаТН.ИзменениеПраваСобственности Тогда
				ИзменениеПраваСобственности = Истина;
				Прервать;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ПоследняяТН, ВыборкаТН);
		КонецЦикла;
		
		Если ИзменениеПраваСобственности Тогда
			ВызватьИсключение НСтр("ru = 'Не требуется, транспортную накладную оформляет грузополучатель'");
		КонецЕсли;
		
		ОрганизацияЕГАИС             = ВыборкаШапка.ОрганизацияЕГАИС;
		ТоварноТранспортнаяНакладная = ДанныеЗаполнения;
		Заказчик                     = ВыборкаШапка.Заказчик;
		
		Если ПоследняяТН.Ссылка = Неопределено Тогда
			
			ВыборкаКоличество.Следующий();
			
			ПунктПогрузки              = ВыборкаШапка.ПунктРазгрузки;
			ПунктРазгрузки             = Неопределено;
			Перевозчик                 = Неопределено;
			Перенаправление            = Неопределено;
			ТипТранспорта              = Неопределено;
			НомерТранспортногоСредства = Неопределено;
			Прицеп                     = Неопределено;
			Водитель                   = Неопределено;
			Экспедитор                 = Неопределено;
			Количество                 = ВыборкаКоличество.Количество;
			
		Иначе
			
			ПунктПогрузки              = ПоследняяТН.ПунктРазгрузки;
			ПунктРазгрузки             = Неопределено;
			Перевозчик                 = Неопределено;
			Перенаправление            = Неопределено;
			ТипТранспорта              = Неопределено;
			НомерТранспортногоСредства = Неопределено;
			Прицеп                     = Неопределено;
			Водитель                   = Неопределено;
			Экспедитор                 = Неопределено;
			Количество                 = ПоследняяТН.Количество;
			
			НоваяСтрока = ТранспортныеНакладные.Добавить();
			НоваяСтрока.ДокументОснование = ПоследняяТН.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПеремещениеТоваров()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	//Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
	//	Если ДанныеЗаполнения.Свойство("ДокументЗаполнения") И ТипЗнч(ДанныеЗаполнения.ДокументЗаполнения) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
	//		ОграниченияЗаполнения = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "ОграниченияЗаполнения", Неопределено);
	//		ОбработкаЗаполнения_ВозвратПоставщику(ДанныеЗаполнения.ДокументЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, ОграниченияЗаполнения);
	//	КонецЕсли;
	//КонецЕсли;
	
	ИнтеграцияЕГАИС.ОбработкаЗаполненияПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = "";
	ИдентификаторЗапроса = "";
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		РеквизитыТС = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТранспортноеСредство, "ТипТС, НомерТС");
		Если Не ЗначениеЗаполнено(РеквизитыТС.ТипТС) Тогда
			ВывестиСообщение(НСтр("ru='У транспортного средства ""%1"". не заполнен тип транспортного средства'"),,,, Отказ, СокрЛП(ТранспортноеСредство));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(РеквизитыТС.НомерТС) Тогда
			ВывестиСообщение(НСтр("ru='У транспортного средства ""%1"". не заполнен номер транспортного средства'"),,,, Отказ, СокрЛП(ТранспортноеСредство));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Идентификатор) Тогда
		Идентификатор = СокрЛП(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	ФорматОбмена = 4;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ЗаписатьСтатусДокументаЕГАИСПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()


#КонецЕсли
