// Модуль основной формы документа "Платежное поручение"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция для получения списка видов документа на основании ПВХ Типы сделок
//
&НаСервере
Функция ПолучитьСписокВидовДокументов()
	
	МассивВидов = ПланыВидовХарактеристик.ТипыСделок.ПолучитьРазрешенныеТипыСделок(Ложь, Истина);
	СписокТиповСделок = Новый СписокЗначений;
	
	Для Счетчик = 0 По МассивВидов.ВГраница() Цикл
		
		ПустоеЗначение = Новый (МассивВидов[Счетчик]);
		Если СписокТиповСделок.НайтиПоЗначению(ПустоеЗначение.Метаданные().Имя) = Неопределено Тогда
			СписокТиповСделок.Добавить(ПустоеЗначение.Метаданные().Имя, ПустоеЗначение.Метаданные().Синоним);
		КонецЕсли;
		
	КонецЦикла;
	
	СписокТиповСделок.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	Возврат СписокТиповСделок;
	
КонецФункции // ПолучитьСписокВидовДокументов()

// Обработчик для выбора документа в соответствии с типом
//
&НаКлиенте
Процедура ВыбратьДокументПоВиду(ВидДокумента, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВидДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Установим отбор на формы списка выбора документа
	Отбор = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Отбор.Вставить("Контрагент", Объект.Контрагент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) Тогда
		Отбор.Вставить("ДоговорВзаиморасчетов", Объект.ДоговорВзаиморасчетов);
	КонецЕсли;
	
	// Инициализируем параметры
	ПараметрыФормы = Новый Структура("РежимВыбора, Отбор", Истина, Отбор);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ФормированиеНачисленияПлатежаПоДокументу", ЭтотОбъект, Новый Структура("ВидДокумента", ВидДокумента.Значение));
	
	// Откроем форму выбора
	ОткрытьФорму("Документ."+ВидДокумента.Значение+".ФормаСписка", ПараметрыФормы, ЭтотОбъект,,,, ОбработчикОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ВыбратьДокумент()

// Процедура для формирования текста реквизита "Начисление платежа" по выбранному объекту.
//
&НаКлиенте
Процедура ФормированиеНачисленияПлатежаПоДокументу(Документ, ДополнительныеПараметры) Экспорт
	
	Если Документ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФормированиеНачисленияПлатежаПоДокументуНаСервере(Документ, ДополнительныеПараметры.ВидДокумента);
	
КонецПроцедуры // ФормированиеНачисленияПлатежаПоДокументу()

// Процедура для формирования текста реквизита "Начисление платежа" по выбранному документу на сервере.
//
&НаСервере
Процедура ФормированиеНачисленияПлатежаПоДокументуНаСервере(Документ, ВидДокумента)
	
	// Определяем строку с НДС - ставки НДС и суммы НДС
	СтрокаНДС = "";
	
	Если ЕстьРеквизит(Документ, , "Товары") И ЕстьРеквизит(Документ, "СтавкаНДС", "Товары") И ЕстьРеквизит(Документ, "СуммаНДС", "Товары") Тогда
		
		Запрос=Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
		Запрос.Текст="
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ДокументТовары.СтавкаНДС.Ставка,0) КАК СтавкаНДС,
		|	СУММА(ДокументТовары.СуммаНДС)  КАК СуммаНДС
		|ИЗ
		|	Документ."+СокрЛП(ВидДокумента)+".Товары КАК ДокументТовары
		|ГДЕ
		|	ДокументТовары.Ссылка = &Ссылка
		|   И СуммаНДС <> 0
		|СГРУППИРОВАТЬ ПО
		|   ЕСТЬNULL(ДокументТовары.СтавкаНДС.Ставка,0)";
		
		Выборка=Запрос.Выполнить().Выбрать();
		Выборка.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сумма  = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(Выборка.СуммаНДС, Документ.ВалютаДокумента, Документ.КурсДокумента, Объект.ВалютаДокумента, Объект.КурсДокумента);
			СтрокаНДС = СтрокаНДС + " НДС("+СокрЛП(Выборка.СтавкаНДС)+"%) "+Формат(Выборка.СуммаНДС,"ЧЦ=10; ЧДЦ=2")+" "+СокрЛП(Объект.ВалютаДокумента);
		КонецЦикла;
		
	КонецЕсли;
	
	Объект.НазначениеПлатежа = Объект.НазначениеПлатежа
						+ Символы.ПС+СокрЛП(Документ.Метаданные().Синоним) 
						+ " №"+СокрЛП(Документ.Номер)
						+ " от "+Формат(Документ.Дата, "ДФ=дд")+"."
						+ Формат(Документ.Дата, "ДФ=ММ")+"."
						+ Формат(Документ.Дата, "ДФ=гггг")
						+ СтрокаНДС;
	
КонецПроцедуры // ФормированиеНачисленияПлатежаПоДокументуНаСервере()

&НаКлиенте
Процедура СформироватьСпискиВыбора()
	
	Элементы.ПоказательТипа.СписокВыбора.Очистить();
	Элементы.ПоказательТипа.СписокВыбора.Добавить("НС", НСтр("ru = 'НС - уплата налога или сбора'"));
	Элементы.ПоказательТипа.СписокВыбора.Добавить("ПЛ", НСтр("ru = 'ПЛ - уплата платежа'"));
	Элементы.ПоказательТипа.СписокВыбора.Добавить("ГП", НСтр("ru = 'ГП - уплата пошлины'"));
	Элементы.ПоказательТипа.СписокВыбора.Добавить("ВЗ", НСтр("ru = 'ВЗ - уплата взноса'"));
	Элементы.ПоказательТипа.СписокВыбора.Добавить("АВ", НСтр("ru = 'АВ - уплата аванса или предоплата (в том числе декадные платежи)'"));
	Элементы.ПоказательТипа.СписокВыбора.Добавить("ПЕ", НСтр("ru = 'ПЕ - уплата пени'"));
	Элементы.ПоказательТипа.СписокВыбора.Добавить("ПЦ", НСтр("ru = 'ПЦ - уплата процентов'"));
	Элементы.ПоказательТипа.СписокВыбора.Добавить("СА", НСтр("ru = 'СА - налоговые санкции, установленные Налоговым кодексом РФ'"));
	Элементы.ПоказательТипа.СписокВыбора.Добавить("АШ", НСтр("ru = 'АШ - административные штрафы'"));
	Элементы.ПоказательТипа.СписокВыбора.Добавить("ИШ", НСтр("ru = 'ИШ - иные штрафы, установленные соответствующими нормативными актами'"));
	Элементы.ПоказательТипа.СписокВыбора.Добавить("0",  НСтр("ru = '0 - Конкретное значение указать невозможно'"));
	
	Элементы.ПоказательОснования.СписокВыбора.Очистить();
	Элементы.ПоказательОснования.СписокВыбора.Добавить("ТП", НСтр("ru = 'ТП - платежи текущего года'"));
	Элементы.ПоказательОснования.СписокВыбора.Добавить("ЗД", НСтр("ru = 'ЗД - добровольное погашение задолженности по истекшим налоговым периодам'"));
	Элементы.ПоказательОснования.СписокВыбора.Добавить("БФ", НСтр("ru = 'БФ - текущие платежи физических лиц - клиентов банка (владельцев счета), уплачиваемые со своего банковского счета'"));
	Элементы.ПоказательОснования.СписокВыбора.Добавить("ТР", НСтр("ru = 'ТР - погашение задолженности по требованию об уплате налогов (сборов) от налогового органа'"));
	Элементы.ПоказательОснования.СписокВыбора.Добавить("РС", НСтр("ru = 'РС - погашение рассроченной задолженности'"));
	Элементы.ПоказательОснования.СписокВыбора.Добавить("ОТ", НСтр("ru = 'ОТ - погашение отсроченной задолженности'"));
	Элементы.ПоказательОснования.СписокВыбора.Добавить("РТ", НСтр("ru = 'РТ - погашение реструктурируемой задолженности'"));
	Элементы.ПоказательОснования.СписокВыбора.Добавить("ВУ", НСтр("ru = 'ВУ - погашение отсроченной задолженности в связи с введением внешнего управления'"));
	Элементы.ПоказательОснования.СписокВыбора.Добавить("ПР", НСтр("ru = 'ПР - погашение задолженности, приостановленной к взысканию'"));
	Элементы.ПоказательОснования.СписокВыбора.Добавить("АП", НСтр("ru = 'АП - погашение задолженности по акту проверки'"));
	Элементы.ПоказательОснования.СписокВыбора.Добавить("АР", НСтр("ru = 'АР - погашение задолженности по исполнительному документу'"));
	Элементы.ПоказательОснования.СписокВыбора.Добавить("0",  НСтр("ru = '0 - Невозможно указать конкретное значение показателя'"));
	
	Элементы.СтатусСоставителя.СписокВыбора.Очистить();
	Элементы.СтатусСоставителя.СписокВыбора.Добавить("01", НСтр("ru = '01 - налогоплательщик (плательщик сборов) - юридическое лицо'"));
	Элементы.СтатусСоставителя.СписокВыбора.Добавить("02", НСтр("ru = '02 - налоговый агент'"));
	Элементы.СтатусСоставителя.СписокВыбора.Добавить("03", НСтр("ru = '03 - сборщик налогов и сборов'"));
	Элементы.СтатусСоставителя.СписокВыбора.Добавить("04", НСтр("ru = '04 - налоговый орган'"));
	Элементы.СтатусСоставителя.СписокВыбора.Добавить("05", НСтр("ru = '05 - территориальные органы Федеральной службы судебных приставов'"));
	Элементы.СтатусСоставителя.СписокВыбора.Добавить("06", НСтр("ru = '06 - участник внешнеэкономической деятельности'"));
	Элементы.СтатусСоставителя.СписокВыбора.Добавить("07", НСтр("ru = '07 - таможенный орган'"));
	Элементы.СтатусСоставителя.СписокВыбора.Добавить("08", НСтр("ru = '08 - плательщик иных платежей, осуществляющий перечисление платежей в бюджетную систему Российской Федерации (кроме платежей, администрируемых налоговыми органами)'"));
	Элементы.СтатусСоставителя.СписокВыбора.Добавить("09", НСтр("ru = '09 - налогоплательщик (плательщик сборов) - индивидуальный предприниматель'"));
	Элементы.СтатусСоставителя.СписокВыбора.Добавить("10", НСтр("ru = '10 - налогоплательщик (плательщик сборов) - частный нотариус'"));
	Элементы.СтатусСоставителя.СписокВыбора.Добавить("11", НСтр("ru = '11 - налогоплательщик (плательщик сборов) - адвокат, учредивший адвокатский кабинет'"));
	Элементы.СтатусСоставителя.СписокВыбора.Добавить("12", НСтр("ru = '12 - налогоплательщик (плательщик сборов) - глава крестьянского (фермерского) хозяйства'"));
	Элементы.СтатусСоставителя.СписокВыбора.Добавить("13", НСтр("ru = '13 - налогоплательщик (плательщик сборов) - иное физическое лицо - клиент банка (владелец счета)'"));
	Элементы.СтатусСоставителя.СписокВыбора.Добавить("14", НСтр("ru = '14 - налогоплательщик, производящий выплаты физическим лицам (п.п. 1 п.1 ст. 235 Налогового кодекса Российской Федерации)'"));
	Элементы.СтатусСоставителя.СписокВыбора.Добавить("15", НСтр("ru = '15 - кредитная организация, оформившая расчетный документ на общую сумму на перечисление налогов, сборов и иных платежей в бюджетную систему Российской Федерации, уплачиваемых физическими лицами без открытия банковского счета'"));
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Установим отбор по валюте для договоров взаиморасчетов
	Если Не Элементы.Найти("ДоговорВзаиморасчетов")=Неопределено Тогда
		Если ЗначениеЗаполнено(Объект.СчетОрганизации) Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.ДоговорВзаиморасчетов.ПараметрыВыбора, "Отбор.ВалютаВзаиморасчетов", Объект.СчетОрганизации.ВалютаДенежныхСредств);
		Иначе
			УправлениеДиалогомСервер.УдалитьПараметрВыбора(Элементы.ДоговорВзаиморасчетов.ПараметрыВыбора, "Отбор.ВалютаВзаиморасчетов");
		КонецЕсли;
	КонецЕсли;
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	Элементы.СтраницаПеречислениеНалога.Видимость = Объект.ПеречислениеНалога;
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик действия команды "ВыбратьДокумент"
//
&НаКлиенте
Процедура ВыбратьДокумент(Команда)
	
	СписокВидов = ПолучитьСписокВидовДокументов();
	
	// выбираем вид
	ВыбранныйВидДокумента = Неопределено;
	Если СписокВидов.Количество() > 1 Тогда
		ОбработчикОповещения = Новый ОписаниеОповещения("ВыбратьДокументПоВиду", ЭтотОбъект);
		ПоказатьВыборИзСписка(ОбработчикОповещения, СписокВидов, Команда);
	ИначеЕсли СписокВидов.Количество() = 1 Тогда
		ВыбратьДокументПоВиду(СписокВидов[0]);
	КонецЕсли;
	
КонецПроцедуры // ВыбратьДокумент()

// Обработчик действия команды "ЗаполнитьПеречислениеНалога"
//
&НаКлиенте
Процедура ЗаполнитьПеречислениеНалога(Команда)
	
	ОткрытьФорму("Документ.ПлатежноеПоручение.Форма.ПеречислениеНалога", Новый Структура("ТипДокумента", "ПлатежноеПоручение"), ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ЗаполнитьПеречислениеНалога()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПлатежноеПоручение.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПлатежноеПоручение.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Счет организации" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СчетОрганизацииПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПлатежноеПоручение.СчетОрганизацииПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение формы
	УправлениеДиалогомНаСервере();
	
	НастроитьПараметрыВыбораЭлементовФормы();
	
КонецПроцедуры // СчетОрганизацииПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Счет организации".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура СчетОрганизацииПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	СчетОрганизацииПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // СчетОрганизацииПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Перечисление налога" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ПеречислениеНалогаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПлатежноеПоручение.ПеречислениеНалогаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПеречислениеНалогаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Перечисление налога".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПеречислениеНалогаПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	ПеречислениеНалогаПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры  // ПеречислениеНалогаПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ СТРАНИЦЫ "ОСНОВНАЯ"

// Обработчик события возникающего на клиенте при изменении данных реквизита "Контрагент" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура КонтрагентПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПлатежноеПоручение.КонтрагентПриИзменении(Объект, ПараметрыДействия);
	
	// настроим параметры выбора
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // КонтрагентПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Контрагент".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	КонтрагентПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // КонтрагентПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ДоговорВзаиморасчетов" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДоговорВзаиморасчетовПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПлатежноеПоручение.ДоговорВзаиморасчетовПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДоговорВзаиморасчетовПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ДоговорВзаиморасчетов".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДоговорВзаиморасчетовПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	ДоговорВзаиморасчетовПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДоговорВзаиморасчетовПриИзменении()


// Обработчик события возникающего  при изменении данных реквизита "Сумма документа" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СуммаДокументаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПлатежноеПоручение.СуммаДокументаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // СуммаДокументаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма документа".
//
// Параметры:
//  Элемент - ПолеФормы - элемент формы, в котором возникло данное событие.
//
&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СуммаДокументаПриИзмененииНаСервере();
	
КонецПроцедуры // СуммаДокументаПриИзменении()

// Обработчик события возникающего  при изменении данных реквизита "Ставка НДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СтавкаНДСПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПлатежноеПоручение.СтавкаНДСПриИзменении(Объект, ПараметрыДействия);
		
КонецПроцедуры // СтавкаНДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Ставка НДС".
//
// Параметры:
//  Элемент - ПолеФормы - элемент формы, в котором возникло данное событие.
//
&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СтавкаНДСПриИзмененииНаСервере();
	
КонецПроцедуры // СтавкаНДСПриИзменении()

// Обработчик события возникающего  при изменении данных реквизита "Сумма НДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СуммаНДСПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ПлатежноеПоручение.СуммаНДСПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // СуммаНДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма НДС".
//
// Параметры:
//  Элемент - ПолеФормы - элемент формы, в котором возникло данное событие.
//
&НаКлиенте
Процедура СуммаНДСПриИзменении(Элемент)

	// Обработаем событие в контексте сервера
	СуммаНДСПриИзмененииНаСервере();

КонецПроцедуры // СуммаНДСПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()

// Обработчик события возникающего на клиенте при нажатии на надпись "Сумма документа".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьСуммаДокументаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.ПоказатьРасширенныеИтогиОперации(ЭтотОбъект, Элемент);
	
КонецПроцедуры // НадписьСуммаДокументаНажатие()

// Обработчик события возникающего на клиенте при нажатии на надпись "Взаиморасчеты".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьВзаиморасчетыНажатие(Элемент)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.НадписьВзаиморасчетыНажатие(ЭтотОбъект);
	
КонецПроцедуры // НадписьВзаиморасчетыНажатие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Дальнейшие операции выполняются только для новых документов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Создать списки выбора
	СформироватьСпискиВыбора();
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	Если ИсточникВыбора.ИмяФормы = "Документ.ПлатежноеПоручение.Форма.ВводПериода" Тогда
		Объект.ПоказательПериода = ВыбранноеЗначение;
	КонецЕсли;
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура ПоказательПериодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыПодбора = Новый Структура("ПоказательПериода, ПоказательОснования",
	Объект.ПоказательПериода,
	Объект.ПоказательОснования);
	ОткрытьФорму("Документ.ПлатежноеПоручение.Форма.ВводПериода", ПараметрыПодбора,ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

