// Модуль объекта документа "Блокировка ассортимента"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	МассивПодразделений = Подразделения.ВыгрузитьКолонку("ПодразделениеКомпании");
	Если МассивПодразделений.Количество()=0 Тогда
	//	МассивПодразделений.Добавить(ПодразделениеКомпании);
		МассивПодразделений.Добавить(Справочники.ПодразделенияКомпании.ПустаяСсылка());
	КонецЕсли;
	
	//Формируем выборку по таб. части документа
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	МИНИМУМ(БлокировкаАссортимента.НомерСтроки) КАК НомерСтроки,
	|	БлокировкаАссортимента.Контрагент КАК Контрагент,
	|	БлокировкаАссортимента.Номенклатура КАК Номенклатура,
	|	БлокировкаАссортимента.СрокДействия КАК СрокДействия
	|ИЗ
	|	Документ.БлокировкаАссортимента.Товары КАК БлокировкаАссортимента
	|ГДЕ
	|	БлокировкаАссортимента.Ссылка = &ДокументСсылка
	|СГРУППИРОВАТЬ ПО
	|	БлокировкаАссортимента.Контрагент,
	|	БлокировкаАссортимента.Номенклатура,
	|	БлокировкаАссортимента.СрокДействия");
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ОперацияБлокировки = Ложь;
	Если ХозОперация=Справочники.ХозОперации.БлокировкаАссортиментаКЗаказу ИЛИ ХозОперация=Справочники.ХозОперации.БлокировкаПриемки Тогда
		
		текХозОперация = ХозОперация;
		ОперацияБлокировки = Истина;
		
	ИначеЕсли ХозОперация=Справочники.ХозОперации.СнятиеБлокировкиАссортиментаКЗаказу Тогда
		
		текХозОперация = Справочники.ХозОперации.БлокировкаАссортиментаКЗаказу;
		
	ИначеЕсли ХозОперация=Справочники.ХозОперации.СнятиеБлокировкиПриемки Тогда
		
		текХозОперация = Справочники.ХозОперации.БлокировкаПриемки;
		
	КонецЕсли;
	
	Для Каждого ТекущееПодразделение Из МассивПодразделений Цикл
		
		НаборЗаписейБлокировкаАссортимента = Движения.БлокировкаАссортимента;
		НаборЗаписейБлокировкаАссортимента.ДокументОбъект            = ЭтотОбъект;
		НаборЗаписейБлокировкаАссортимента.ХозОперация				 = текХозОперация;
		НаборЗаписейБлокировкаАссортимента.ПодразделениеКомпании     = ТекущееПодразделение;
		НаборЗаписейБлокировкаАссортимента.ОперацияБлокировки        = ОперацияБлокировки;
		НаборЗаписейБлокировкаАссортимента.ДатаБлокировки            = Дата;
		НаборЗаписейБлокировкаАссортимента.РезультатЗапросаПоТоварам = РезультатЗапроса;
		
		Отказ = НЕ НаборЗаписейБлокировкаАссортимента.УстановитьБлокировку();
		
	КонецЦикла;
	
КонецПроцедуры // ОбработкаПроведения()

#КонецЕсли
