// Модуль отчета

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем ТекстЗапроса Экспорт;                            // хранит текст запроса отчета
Перем ПараметрыИспользованияПолейИПоказателей Экспорт; // хранит параметры использования полей и показателей
Перем ДеревоДоступныхПолей Экспорт;                    // хранит дерево доступных полей отчета
Перем СтруктураСвязиСвойств Экспорт;                   // хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                  // хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;         // хранит структуру не связанных показателей
Перем ДополнительныеПоляОтчета Экспорт;                // хранит дополнительные поля отчета

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА


// проверка на использование группировки
Функция ИспользуетсяГруппировка(ИмяГруппировки) Экспорт
	Если ИзмеренияСтроки.Найти(ИмяГруппировки)<>Неопределено Тогда
		Возврат ИзмеренияСтроки.Найти(ИмяГруппировки).Использование;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Стандартная процедура настройки построителя отчета 
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета, ИмяМакетаПараметров="Параметры") Экспорт
	// Заполним структуру параметров
	СтруктураПараметрыЗаполнения = Новый Структура();
	СтруктураПараметрыЗаполнения.Вставить("ОтчетОбъект",            ЭтотОбъект);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаТекстаЗапроса", ИмяМакета);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаПараметров",    ИмяМакетаПараметров);
	
	ПостроительОтчета.УсловноеОформление.Очистить();
	
	ЭлементОформления = ПостроительОтчета.УсловноеОформление.Добавить("Код");
	
	ОбластьОформления = ЭлементОформления.Область.Добавить("Дата");
	ОбластьОформления = ЭлементОформления.Область.Добавить("Пользователь");
	ОбластьОформления = ЭлементОформления.Область.Добавить("Оборудование");
	ОбластьОформления = ЭлементОформления.Область.Добавить("Источник");
	ОбластьОформления = ЭлементОформления.Область.Добавить("Объект");
	ОбластьОформления = ЭлементОформления.Область.Добавить("GUID");
	ОбластьОформления = ЭлементОформления.Область.Добавить("Действие");
	ОбластьОформления = ЭлементОформления.Область.Добавить("Код");
	ОбластьОформления = ЭлементОформления.Область.Добавить("Описание");
	ОбластьОформления = ЭлементОформления.Область.Добавить("Тип");
	
	ОтборОформления = ЭлементОформления.Отбор.Добавить("Тип");
	ОтборОформления.ВидСравнения = ВидСравнения.Равно;
	ОтборОформления.Значение = Истина;
	ОтборОформления.Использование = Истина;
	
	ЭлементОформления.Оформление.ЦветТекста.Значение = WebЦвета.Красный;
	ЭлементОформления.Оформление.ЦветТекста.Использование = Истина;     
	ЭлементОформления.Использование = Истина;
	
	ВыводитьДетальныеЗаписи = Истина;
	
КонецПроцедуры	//	ЗаполнитьНачальныеНастройки()

// Функция возвращает структуру форматирования полей
Функция СтруктураФорматированияПолей() Экспорт

	СтруктураФорматаПолей = Новый Структура;
	
	Возврат СтруктураФорматаПолей;

КонецФункции	//	СтруктураФорматированияПолей()

// Устанавливает флаг использование у измерений.
Функция УстановитьИспользованиеИзмерений(ТекПостроитель) Экспорт
	
	ТекПостроитель.ВыбранныеПоля.Очистить();
	ТекПостроитель.Порядок.Очистить();

	Для Каждого ТекСтрока Из ДеревоДоступныхПолей.Строки Цикл
		ИмяПоля = СтрЗаменить(ТекСтрока.ПутьКДанным, ".", "");
		Если ТекПостроитель.ВыбранныеПоля.Найти(ИмяПоля) = Неопределено Тогда
			ТекПостроитель.ВыбранныеПоля.Добавить(ТекСтрока.ПутьКДанным, ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	
	ТекПостроитель.Порядок.Добавить("Дата", "Дата", "Дата", НаправлениеСортировки.Возр);
	
	Возврат Истина;
	
КонецФункции

// Возвращает макет построителя отчета.
Функция ПолучитьМакетПостроителя(ТекПостроитель, МакетОтчета, ПараметрыОформления) Экспорт
	
	ГраницаМакета = ПараметрыОформления.ГраницаМакета;
	ГраницаМакета.Вставить("ГраницаКолонок", ГраницаМакета.ДопПоля);
	ГраницаМакета.Вставить("ГраницаКолонокСтрока", ГраницаМакета.ДопПоляСтрока);
	ГраницаМакета.Вставить("ГраницаТаблицы", Новый Структура("ГраницаСлева, ГраницаСверху, ГраницаСправа", ГраницаМакета.Измерения.ГраницаСлева, ГраницаМакета.Измерения.ГраницаСверху, ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева));
	ГраницаМакета.Вставить("ГраницаТаблицыСтрока", Новый Структура("ГраницаСлева, ГраницаСправа", ГраницаМакета.ИзмерениеСтрока.ГраницаСлева, ГраницаМакета.ИзмеренияПоГоризонталиСтрока.ГраницаСправа));
	
	ОбластьЗаголовок = МакетОтчета.Область(1, 2);
	ОбластьЗаголовок.Текст = НСтр("ru = 'Лог фронта кассира'");
	ОбластьЗаголовок.Шрифт = Новый Шрифт(ОбластьЗаголовок.Шрифт,, 12, Истина);
	
	ОбластьЗаголовок = МакетОтчета.Область(2, 2);
	ОбластьЗаголовок.Текст = "Отбор: " + ПолучитьТекстОтбора();
	ОбластьЗаголовок.Шрифт = Новый Шрифт(ОбластьЗаголовок.Шрифт,, 10, Истина);
	ОбластьЗаголовок.ЦветТекста = ЦветаСтиля.ЦветФонаВыделенияПоля;
	
	ОбластьЗаголовок = МакетОтчета.Область(3, 2);
	
	ТаблицаКолонок = Новый ТаблицаЗначений;
	ТаблицаКолонок.Колонки.Добавить("Представление");
	ТаблицаКолонок.Колонки.Добавить("Имя");
	ТаблицаКолонок.Колонки.Добавить("ШиринаКолонки");
	ТаблицаКолонок.Колонки.Добавить("Формат");
	
	Для Каждого ТекПоле Из ТекПостроитель.ВыбранныеПоля Цикл
		НоваяСтрока = ТаблицаКолонок.Добавить();
		НоваяСтрока.Имя = ТекПоле.Имя;
	КонецЦикла; 
	
	Возврат Истина;
	
КонецФункции 

// Возвращает текст отбора.
Функция ПолучитьТекстОтбора()
	// Текст отборов
	Если ПостроительОтчета.Отбор.Количество() = 0 Тогда
		Отбор = НСтр("ru = 'Без отбора'");
	Иначе
		Отбор = "";
		Для Каждого ТекОтбор Из ПостроительОтчета.Отбор Цикл
			Если ТекОтбор.Использование И НЕ ТекОтбор.Имя = "Периодичность" Тогда
				ЗначОтбора="";
				Если ТипЗнч(ТекОтбор.Значение)=Тип("СписокЗначений") Тогда
					Для Каждого ТекЗначОтбор Из ТекОтбор.Значение Цикл
						ЗначОтбора = ЗначОтбора + ?(ЗначОтбора = "", "", "; ") + ТекЗначОтбор.Значение;
					КонецЦикла;
				ИначеЕсли ТекОтбор.Имя = "Дата" Тогда
					ВидСравненияВСтроку = Строка(ТекОтбор.ВидСравнения);
					ЗначОтбора = ВидСравненияВСтроку + " " + ?(СтрНайти(ВидСравненияВСтроку, "Интервал") = 0, ТекОтбор.Значение, Строка(ТекОтбор.ЗначениеС) + " - " + Строка(ТекОтбор.ЗначениеПо));
				Иначе
					ЗначОтбора=ТекОтбор.Значение;
				КонецЕсли;
				Отбор = Отбор + ТекОтбор.Представление + ": " + ЗначОтбора + "," + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
			
		Если Отбор = "" Тогда Отбор = "Все"; КонецЕсли; 
	КонецЕсли; 
	Возврат Отбор;
КонецФункции


#Область Инициализация

//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ПромежуточныеЗначенияПостроителя = Новый Структура();
СтруктураНеСвязанныхПоказателей = Новый Структура();

#КонецОбласти

#КонецЕсли