// Модуль документа "Заказ поставщику"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Заказ внутренний"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ЗаказВнутренний(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Контрагент = ПравоПользователя("ОсновнойПоставщик", ЭтотОбъект);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Документы.ЗаказПоставщику.КонтрагентПриИзменении(ЭтотОбъект,ДополнительныеСвойства.ПараметрыДействия);
	КонецЕсли;
	
	// Для документов покупки
	ТипЦен = ПравоПользователя("ОсновнойТипЦенЗакупки", ЭтотОбъект);
	
	Товары.Очистить();
	РаспределениеЗаказа.Очистить();
	
	Запрос 			= Новый Запрос;
	Запрос.Текст	= "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПокупателейОстатки.Заказ КАК Заказ,
	|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПокупателейОстатки.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	(ЗаказыПокупателейОстатки.ЗаказаноОстаток
	|	 - ЗаказыПокупателейОстатки.РезервОстаток
	|	 - ЕСТЬNULL(ЗаказыРаспределениеОстатки.КоличествоОстаток, 0)) КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(&КонецПериода, Заказ = &Заказ) КАК ЗаказыПокупателейОстатки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ЗаказыРаспределение.Остатки(&КонецПериода, ЗаказПокупателя = &Заказ) КАК ЗаказыРаспределениеОстатки
	|ПО
	|	ЗаказыПокупателейОстатки.Номенклатура               = ЗаказыРаспределениеОстатки.Номенклатура
	|	И ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры = ЗаказыРаспределениеОстатки.ХарактеристикаНоменклатуры
	|ГДЕ
	|	(ЗаказыПокупателейОстатки.ЗаказаноОстаток
	|	 - ЗаказыПокупателейОстатки.РезервОстаток
	|	 - ЕСТЬNULL(ЗаказыРаспределениеОстатки.КоличествоОстаток, 0))>0
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры";
	
	Запрос.УстановитьПараметр("Заказ",        ДанныеЗаполнения);
	Запрос.УстановитьПараметр("КонецПериода", ?(Ссылка.Пустая(), ТекущаяДатаСеанса(), Ссылка.Дата));
	Выборка		= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрокаРаспределения 							= РаспределениеЗаказа.Добавить();
		НоваяСтрокаРаспределения.Номенклатура               = Выборка.Номенклатура;
		НоваяСтрокаРаспределения.Количество                 = Выборка.Количество;
		НоваяСтрокаРаспределения.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		НоваяСтрокаРаспределения.ЗаказПокупателя            = Выборка.Заказ;
		НоваяСтрокаРаспределения.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
		
		Документы.ЗаказПоставщику.РаспределениеЗаказаЕдиницаИзмеренияПриИзменении(ЭтотОбъект, НоваяСтрокаРаспределения,ДополнительныеСвойства.ПараметрыДействия);
		
		Если НЕ НоваяСтрокаРаспределения.Коэффициент = 0 Тогда
			НоваяСтрокаРаспределения.Количество = НоваяСтрокаРаспределения.Количество/НоваяСтрокаРаспределения.Коэффициент
		КонецЕсли;
		
		Документы.ЗаказПоставщику.РаспределениеЗаказаНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрокаРаспределения, ДополнительныеСвойства.ПараметрыДействия);
	КонецЦикла;
	Документы.ЗаказПоставщику.ПерерасчетРаспределения(ЭтотОбъект);
	ДополнительныеСвойства.ПараметрыДействия.ТипЦен = ТипЦен;
	Для Каждого СтрокаТоваров Из Товары Цикл
		Документы.ЗаказПоставщику.ТоварыНоменклатураПриИзменении(ЭтотОбъект, СтрокаТоваров,ДополнительныеСвойства.ПараметрыДействия);
	КонецЦикла; 
	СуммаДокумента = Товары.Итог("СуммаВсего");
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ЗаказВнутренний()

// Производит заполнение объекта на основании документа "Заказ покупателя"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ЗаказПокупателя(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Возвращаем заполнение по внутреннему заказу
	Возврат ОбработкаЗаполнения_ЗаказВнутренний(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецФункции // ОбработкаЗаполнения_ЗаказПокупателя()

// Производит заполнение объекта на основании документа "Бюджет закупок"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_БюджетЗакупок(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Товары.Очистить();
	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.БюджетЗакупокПоНоменклатуре Тогда
		ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		Для Каждого ТекСтрока Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока 				= Товары.Добавить();
			НоваяСтрока.Номенклатура 	= ТекСтрока.Номенклатура;
			Документы.ЗаказПоставщику.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока,ДополнительныеСвойства.ПараметрыДействия);
			Если НоваяСтрока.Коэффициент = 0 Тогда
				НоваяСтрока.Количество 	= ТекСтрока.Количество;
			Иначе
				НоваяСтрока.Количество 	= ТекСтрока.Количество/НоваяСтрока.Коэффициент
			КонецЕсли;
			НоваяСтрока.Цена 			= РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ТекСтрока.Цена, ВалютаУпр, КурсВалютыУпр, ВалютаДокумента, КурсДокумента);
			Документы.ЗаказПоставщику.ТоварыЦенаПриИзменении(ЭтотОбъект, НоваяСтрока,ДополнительныеСвойства.ПараметрыДействия);
			
		КонецЦикла;
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_БюджетЗакупок()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА)
		
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// для документа поступления исключим нулевые строки
	Если ТипЗнч(ДанныеЗаполнения) = ТиП("ДокументСсылка.ПоступлениеТоваров") Тогда
		Сч = 0;
		Пока Сч < Товары.Количество() Цикл
			Если Товары[Сч].Количество = 0 Тогда
				Товары.Удалить(Сч);
			Иначе
				Сч = Сч + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) И ит_ИсточникЗаказа <> Перечисления.ит_ИсточникиЗаказовПоставщику.Многозадачник Тогда
		// - заполним срок поставки по графикам
		Если ЗначениеЗаполнено(ит_ВидЗаявки) Тогда
			обрЗаказов = Обработки.ФормированиеЗаказовПоставщику.Создать();
			обрЗаказов.Дата = Дата;	
			
			ВидЗаявкиВНоменклатуре = Неопределено;
			Если Товары.Количество() > 0 Тогда
				ВидЗаявкиВНоменклатуре = Товары.Получить(0).Номенклатура.ит_ВидЗаявки;
			КонецЕсли;
			
			СрокПоставки = обрЗаказов.ПолучитьБлижайшуюДатуОтгрузкиПоВидуЗаказа(ПодразделениеКомпании, Контрагент, ит_ВидЗаявки, ДоговорВзаиморасчетов,ВидЗаявкиВНоменклатуре);
		Иначе			
			Если ЗначениеЗаполнено(ДоговорВзаиморасчетов) И ДоговорВзаиморасчетов.СрокПоставки > 0 Тогда
				СрокПоставкиДней = ДоговорВзаиморасчетов.СрокПоставки;
			Иначе
				СрокПоставкиДней = Контрагент.СрокПоставки;
			КонецЕсли;
			
			СрокПоставки  = НачалоДня(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()))+СрокПоставкиДней*60*60*24;
		КонецЕсли;

	КонецЕсли;
	
	//Мальцев А.Ю. +++  т.к. в результате могут попасть позиции которых нет в Ассортименте
	Товары.Очистить();	
	Возврат;
	//Мальцев А.Ю. ---
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	//Мальцев А.Ю. +++ Обработка заполенния не выполняется ни при каких условиях, т.к. в результате могут попасть позиции которых нет в Ассортименте
	Товары.Очистить();
	Возврат;
	//Мальцев А.Ю. ---
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	Если Товары.Количество() = 0 Тогда
		// заполним по копируемому документу
		Товары.Загрузить(ОбъектКопирования.Товары.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	КонтролироватьАссортимент = ПравоПользователя("КонтролироватьАссортиментПодразделенияВЗаказах", ЭтотОбъект);
	КонтролироватьАссортиментПоСрокуПоставки = ПравоПользователя("итКонтролироватьАссртиментПоступленияПоСрокуПоставкиЗаказа", ЭтотОбъект);
	
	Если КонтролироватьАссортиментПоСрокуПоставки Тогда
		ДатаКонтроля = СрокПоставки;
	Иначе
		ДатаКонтроля = Дата;		
	КонецЕсли;
	
	РегистрыСведений.ОграничениеАссортиментаПодразделения.ПроверитьАссортиментПодразделения(ЭтотОбъект, ДатаКонтроля, КонтролироватьАссортимент, Отказ);
	
	//проверка блокировки заказа
	ЗапросБлокировки = Новый Запрос("
	|ВЫБРАТЬ
	|	ПодразделениеКомпании,
	|	Контрагент,
	|	Номенклатура
	|ИЗ
	|	РегистрСведений.БлокировкаАссортимента.СрезПоследних(&НаМомент, ХозОперация=ЗНАЧЕНИЕ(Справочник.ХозОперации.БлокировкаАссортиментаКЗаказу) И ПодразделениеКомпании В(&Подразделение) И Контрагент В(&Контрагент) И Номенклатура В(&Номенклатура))
	|ГДЕ
	|	Заблокировано И (СрокДействия >= &НаДату ИЛИ СрокДействия=ДАТАВРЕМЯ(1,1,1))");
	
	МассивПодразделений = Новый Массив;
	МассивПодразделений.Добавить(ПодразделениеКомпании);
	МассивПодразделений.Добавить(Справочники.ПодразделенияКомпании.ПустаяСсылка());
	МассивКонтрагентов = Новый Массив;
	МассивКонтрагентов.Добавить(Контрагент);
	МассивКонтрагентов.Добавить(Справочники.Контрагенты.ПустаяСсылка());
	МассивНоменклатуры = Товары.ВыгрузитьКолонку("Номенклатура");
	МассивНоменклатуры.Добавить(Справочники.Номенклатура.ПустаяСсылка());
	
	НаМомент = ?(НЕ ЗначениеЗаполнено(Ссылка), КонецДня(ТекущаяДатаСеанса()), Новый Граница(Новый МоментВремени(Дата, Ссылка), ВидГраницы.Исключая));
	ЗапросБлокировки.УстановитьПараметр("НаМомент", НаМомент);
	ЗапросБлокировки.УстановитьПараметр("НаДату", ДатаКонтроля);
	ЗапросБлокировки.УстановитьПараметр("Подразделение", МассивПодразделений);
	ЗапросБлокировки.УстановитьПараметр("Контрагент", МассивКонтрагентов);
	ЗапросБлокировки.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	
	тзБлокировок = ЗапросБлокировки.Выполнить().Выгрузить();
	
	БлокПодразделения = тзБлокировок.НайтиСтроки(Новый Структура("ПодразделениеКомпании,Контрагент,Номенклатура",ПодразделениеКомпании, Справочники.Контрагенты.ПустаяСсылка(), Справочники.Номенклатура.ПустаяСсылка()));
	БлокКонтрагента = тзБлокировок.НайтиСтроки(Новый Структура("Контрагент,Номенклатура",Контрагент, Справочники.Номенклатура.ПустаяСсылка()));
	Если БлокПодразделения.Количество()>0 Тогда
		ВывестиСообщение(НСтр("ru='Подразделение ""%1"" заблокировано для заказа.'"), ЭтотОбъект,,, Отказ, ПодразделениеКомпании);
	ИначеЕсли БлокКонтрагента.Количество()>0 Тогда
		ВывестиСообщение(НСтр("ru='Контрагент ""%1"" заблокирован для заказа.'"), ЭтотОбъект,,, Отказ, Контрагент);
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Товары Цикл
		БлокНоменклатуры = тзБлокировок.НайтиСтроки(Новый Структура("Номенклатура", ТекСтрока.Номенклатура));
		Если БлокНоменклатуры.Количество()>0 Тогда
			ВывестиСообщение(НСтр("ru = 'Номенклатура ""%1"" заблокирована для заказа. Строка №#'"), ЭтотОбъект,, ТекСтрока.НомерСтроки, Отказ, ТекСтрока.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	//--------------------------
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	//++ ситников Задача № 319345
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ТекДата = ТекущаяДата();
		ТекущееВремя = Дата(1,1,1,0,0,0) + (ТекДата - НачалоДня(ТекДата));
		ВремяОграниченияЗаписи = Документы.ЗаказПоставщику.ВремяОграниченияЗаписиЗаказаПоставщику(ТекДата, ЭтотОбъект.ит_ВидЗаявки, ЭтотОбъект.Контрагент, ЭтотОбъект.ПодразделениеКомпании);
		Если ВремяОграниченияЗаписи > Дата(1,1,1,0,0,0) И ТекущееВремя > ВремяОграниченияЗаписи Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Время записи нового документа %1 превышает максимально допустимое время заказа %2", Формат(ТекДата, "ДФ=HH:mm"), Формат(ВремяОграниченияЗаписи, "ДФ=HH:mm")),,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	//--
	
	//Мальцев А.Ю. +++
	//Если ит_ИсточникЗаказа = Перечисления.ит_ИсточникиЗаказовПоставщику.Многозадачник  И Не ДополнительныеСвойства.Свойство("ПроведениеИзФормы") Тогда
	//	Возврат;
	//КонецЕсли;
	
	//++ ситников задача 318632
	//ПринудительноДобавленноеКоличество = Новый Соответствие; //Задача № 320932 Малышев Иван 28.08.2025
	//--
	Если НЕ Отказ И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//++ ситников задача 318632
		Если Не ДополнительныеСвойства.Свойство("ПропуститьКорректировку") Тогда
		//--
		
		ТоварыПринудительнойОтгрузки = ИТ_СпециальныйМодульСервер.ПолучитьТоварыПринудительнойОтгрузки(ПодразделениеКомпании, Дата, Контрагент, Ссылка, ит_ВидЗаявки, Товары.Выгрузить());
		Для Каждого стр ИЗ ТоварыПринудительнойОтгрузки Цикл
			
			//++ ситников задача 330103
			Если стр.БезУсловийГрафиковЗапретов Тогда
				Продолжить;
			КонецЕсли;
			//--
			
			НайденнаяСтрока = Товары.Найти(стр.Номенклатура, "Номенклатура");
			
			Если НайденнаяСтрока = НЕОПРЕДЕЛЕНО Тогда
			
				НовСтр = Товары.Добавить();
				НовСтр.Номенклатура = стр.Номенклатура;
				НовСтр.Количество   = стр.Количество;
				НовСтр.итПринудительнаяОтгрузка = Истина;
				
				//++ ситников задача 318632
				//ПринудительноДобавленноеКоличество.Вставить(стр.Номенклатура, стр.Количество); //Задача № 320932 Малышев Иван 28.08.2025
				НовСтр.итКоличествоПринудительное = стр.Количество;
				НовСтр.итПравилоКорректировки = стр.Правило;
				//--
				
				Документы.ЗаказПоставщику.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НовСтр);
				Документы.ЗаказПоставщику.ТоварыКоличествоПриИзменении(ЭтотОбъект, НовСтр);
				
			Иначе
				
				НайденнаяСтрока.Количество   			 = НайденнаяСтрока.Количество + стр.Количество;
				НайденнаяСтрока.итПринудительнаяОтгрузка = Истина;
				
				//++ ситников задача 318632
				//ПринудительноДобавленноеКоличество.Вставить(стр.Номенклатура, стр.Количество); //Задача № 320932 Малышев Иван 28.08.2025
				НайденнаяСтрока.итКоличествоПринудительное = НайденнаяСтрока.итКоличествоПринудительное + стр.Количество;
				НайденнаяСтрока.итПравилоКорректировки = стр.Правило;
				//--
				
				Документы.ЗаказПоставщику.ТоварыКоличествоПриИзменении(ЭтотОбъект, НайденнаяСтрока);
				
			КонецЕсли;
		КонецЦикла;
		
		//++ ситников задача 318632
		КонецЕсли;
		//--
		
		РазрешитьПревышениеМаксимальногоКоличестваДляЗаказа   = ПравоПользователя("итРазрешитьПревышениеМаксимальногоКоличестваДляЗаказа");
		Если РазрешитьПревышениеМаксимальногоКоличестваДляЗаказа = Ложь Тогда
			ТоварыПревышеноМаксимальноеКоличествоДляЗаказа =  ИТ_СпециальныйМодульСервер.ВыполнитьКонтрольМаксимальногоКоличестваПоЗаказу(ПодразделениеКомпании, Дата, Ссылка, Товары.Выгрузить());
			Если ТоварыПревышеноМаксимальноеКоличествоДляЗаказа.Количество() > 0 Тогда
				Отказ = Истина;
				Для Каждого стр Из ТоварыПревышеноМаксимальноеКоличествоДляЗаказа Цикл
					Если стр.ЗаполненПоНормам = Истина Тогда
						ТекстСоощение = "Для номенклатуры: " + Строка(стр.Номенклатура) + " превышено максимальное количество для заказа: " + Строка(стр.МаксКоличество) + ", по норме: " + Строка(стр.Норма) + ", заказано за день: " + Строка(стр.ЗаказыЗаДень) + ", в текущем заказе: " + Строка(стр.КоличествоЗаказа);
					 	Сообщить(ТекстСоощение);
					Иначе
						ТекстСоощение = "Для номенклатуры: " + Строка(стр.Номенклатура) + " превышено максимальное количество для заказа: продажа за " + Строка(стр.ДнейПродаж) + " дней " + Строка(стр.Продажи) + ", остаток " + Строка(стр.Остаток) + ", максимальный заказ " + Строка(стр.МаксКоличество);
					 	Сообщить(ТекстСоощение);						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	//Мальцев А.Ю. ---
	
	//++ ситников задача 318632
	////+++ Задача № 320932 Малышев Иван 28.08.2025
	//Если НЕ Отказ Тогда
	//	Для Каждого Строка Из Товары Цикл
	//		Если ПринудительноДобавленноеКоличество[Строка.Номенклатура] <> Неопределено Тогда
	//			Строка.итКоличествоПринудительное = ПринудительноДобавленноеКоличество[Строка.Номенклатура];	
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	////--- Задача № 320932 Малышев Иван 28.08.2025
	//--
	
	Если НЕ Отказ И РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ ДополнительныеСвойства.Свойство("ЭтоВосстановлениеПоследовательностей") Тогда
		
		ТаблицаЗаказов = РаспределениеЗаказа.Выгрузить(, "ЗаказПокупателя");
		ТаблицаЗаказов.Свернуть("ЗаказПокупателя");
		ТаблицаДолгов = ЗаказыСервер.ДолгиПоПредоплате(ЭтотОбъект, ТаблицаЗаказов.ВыгрузитьКолонку("ЗаказПокупателя"));
		
		Если ТаблицаДолгов.Количество()>0 Тогда
			Для Каждого ТекСтрока Из РаспределениеЗаказа Цикл
				СтрокаПоиска = ТаблицаДолгов.Найти(ТекСтрока.ЗаказПокупателя, "Заказ");
				Если НЕ СтрокаПоиска = Неопределено Тогда
					ТекстСообщения	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Распределение заказа. Строка: <%1>, заказ: <%2> нельзя распределить. Долг по предоплате составляет: <%3> <%4>'"),ТекСтрока.НомерСтроки,СокрЛП(ТекСтрока.ЗаказПокупателя),Формат(СтрокаПоиска.Долг,"ЧЦ=15; ЧДЦ=2"),СокрЛП(СтрокаПоиска.Валюта));
					ВывестиСообщение(ТекстСообщения, ЭтотОбъект,,,Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорВзаиморасчетов, "НеКонтролироватьСогласованныеЦены");
		НеКонтролироватьСогласованныеЦены = РеквизитыДоговора.НеКонтролироватьСогласованныеЦены;
		
		// Проверим соответствие цен в документе с протоколом согласования цен
		ПравоКонтролироватьИзмененияЦенПоставщиков = ПравоПользователя("КонтролироватьИзмененияЦенПоставщиков", ЭтотОбъект);
		Если (НЕ ПравоКонтролироватьИзмененияЦенПоставщиков = Перечисления.ВидыКонтроля.НеКонтролировать) И (НЕ НеКонтролироватьСогласованныеЦены) Тогда
			
			Если ЗначениеЗаполнено(СрокПоставки) Тогда
				ДатаЦен = СрокПоставки;
			Иначе
				ДатаЦен = Дата;
			КонецЕсли;
			
			ТаблицаЦен = ЦенообразованиеСервер.ПолучитьСогласованныеЦены(ДатаЦен, Контрагент, ПодразделениеКомпании, Товары.ВыгрузитьКолонку("Номенклатура"));
			
			ДопустимоеОтклонениеЦеныОтСогласованной    = ПолучитьЗначениеУчетнойПолитики("ДопустимоеОтклонениеЦеныОтСогласованной", ПодразделениеКомпании, Дата)/100;
			ПравоКонтролироватьТолькоСогласованныеЦены = ПравоПользователя("КонтролироватьТолькоСогласованныеЦены", ЭтотОбъект);
			
			ЦенаВключаетНДС = ТипЦен.ЦенаВключаетНДС;
			
			Для Каждого СтрокаТовары Из Товары Цикл
				
				ТекСогласованнаяЦена = ТаблицаЦен.Найти(СтрокаТовары.Номенклатура, "Номенклатура");
				Если ТекСогласованнаяЦена = Неопределено Тогда
					Если НЕ ПравоКонтролироватьТолькоСогласованныеЦены Тогда//не контролируем цены если есть такое право
						ВывестиСообщение(НСтр("ru = 'На товар'") + Символы.НПП + "["+СокрЛП(СтрокаТовары.Номенклатура.Код)+"] "+СокрЛП(СтрокаТовары.Номенклатура) 
						+ НСтр("ru = ' нет согласованных цен.'"),
						ЭтотОбъект, "Товары[#].Номенклатура");
						
						Отказ = Отказ ИЛИ (ПравоКонтролироватьИзмененияЦенПоставщиков=Перечисления.ВидыКонтроля.Запрещать);
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				
				Если ТекСогласованнаяЦена.Цена = 0 Тогда
					Если НЕ ПравоКонтролироватьТолькоСогласованныеЦены Тогда//не контролируем цены если есть такое право
						ВывестиСообщение(НСтр("ru = 'На товар'") + Символы.НПП + "["+СокрЛП(СтрокаТовары.Номенклатура.Код)+"] "+СокрЛП(СтрокаТовары.Номенклатура) 
						+ НСтр("ru = ' нет согласованных цен.'"),
						ЭтотОбъект, "Товары[#].Номенклатура");
						
						Отказ = Отказ ИЛИ (ПравоКонтролироватьИзмененияЦенПоставщиков=Перечисления.ВидыКонтроля.Запрещать);
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				
				ЦенаПротокола = ?(ЦенаВключаетНДС, ТекСогласованнаяЦена.Цена, ТекСогласованнаяЦена.ЦенаБезНДС);
				Если ЦенаПротокола<>СтрокаТовары.Цена Тогда
					РазницаЦен = СтрокаТовары.Цена - ЦенаПротокола;
					Если ЦенаПротокола <> 0 И Окр(100*(РазницаЦен-ДопустимоеОтклонениеЦеныОтСогласованной)/ЦенаПротокола,2)>ТекСогласованнаяЦена.ПроцентОтклонения Тогда
						Если ПравоКонтролироватьИзмененияЦенПоставщиков=Перечисления.ВидыКонтроля.Запрещать Тогда
							ВывестиСообщение(НСтр("ru = 'На товар'") + Символы.НПП + "["+СокрЛП(СтрокаТовары.Номенклатура.Код)+"] "+СокрЛП(СтрокаТовары.Номенклатура) 
							+ НСтр("ru = ' цена в документе ('") + СокрЛП(СтрокаТовары.Цена)+НСтр("ru = ' ) не соответствует согласованной цене ("+СокрЛП(ЦенаПротокола)+").'"),
							ЭтотОбъект, "Товары[#].Номенклатура");
							
							Отказ = Истина;
						Иначе
							ВывестиСообщение(НСтр("ru = 'На товар'") + Символы.НПП + "["+СокрЛП(СтрокаТовары.Номенклатура.Код)+"] "+СокрЛП(СтрокаТовары.Номенклатура) 
							+ НСтр("ru = ' цена в документе ('") + СокрЛП(СтрокаТовары.Цена)+НСтр("ru = ' ) не соответствует согласованной цене ("+СокрЛП(ЦенаПротокола)+").'"),
							ЭтотОбъект);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоЗаказамПередПроведением(Ссылка, ДополнительныеСвойства);
		
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	//++ ситников задача 318632
	Если НачалоДня(ТекущаяДата()) = НачалоДня(Дата) Тогда
		УстановитьПривилегированныйРежим(ИСТИНА);
		Попытка
			ИТ_СпециальныйМодульСервер.ПередатьДанныеЗаказаВТаблицуЗаказовПоставщикамTPI(Ссылка);
		Исключение
			ЗаписьЖурналаРегистрации("не удалось записать в ТПИ документ: " + Строка(Ссылка), УровеньЖурналаРегистрации.Ошибка);
		КонецПопытки;
		УстановитьПривилегированныйРежим(ЛОЖЬ);
		//МассивПараметров = Новый Массив;
		//МассивПараметров.Добавить(Ссылка); 
		//ФоновыеЗадания.Выполнить("ИТ_СпециальныйМодульСервер.ПередатьДанныеЗаказаВТаблицуЗаказовПоставщикамTPI", МассивПараметров, Строка(Новый УникальныйИдентификатор), "запись данных заказа в TPI");
	КонецЕсли;
	//--
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	//Мальцев А.Ю. +++
	Если Контрагент = Справочники.Контрагенты.ВнешнийПоставщик Тогда
		Отказ = Истина;
		Сообщить("Проведение документа недоступно для данного типа клиента.");
	КонецЕсли;		
	//Мальцев А.Ю. ---
	
	// Формирование заказа поставщику
	НаборЗаписейЗаказыПоставщикам=Движения.ЗаказыПоставщикам;
	НаборЗаписейЗаказыПоставщикам.РежимПроведения=РежимПроведения;
	НаборЗаписейЗаказыПоставщикам.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейЗаказыПоставщикам.РезультатЗапросаПоТоварам=Неопределено;
	НаборЗаписейЗаказыПоставщикам.ЗаказПоставщику=Ссылка;
	НаборЗаписейЗаказыПоставщикам.Контрагент=Контрагент;
	Отказ=НЕ НаборЗаписейЗаказыПоставщикам.Приход() ИЛИ Отказ;
	Если НЕ Отказ Тогда
		НаборЗаписейЗаказыПоставщикам.Записать();
	КонецЕсли; 
	
	// зафиксируем распределение заказов покупателей на заказе поставщику
	НаборЗаписейЗаказыРаспределение=Движения.ЗаказыРаспределение;
	НаборЗаписейЗаказыРаспределение.РежимПроведения=РежимПроведения;
	НаборЗаписейЗаказыРаспределение.ДокументОбъект=ЭтотОбъект;
	Запрос=Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументТовары.Номенклатура КАК Номенклатура,
		|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ДокументТовары.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ДокументТовары.Количество*ДокументТовары.Коэффициент КАК Количество
		|ИЗ
		|	Документ.ЗаказПоставщику.РаспределениеЗаказа КАК ДокументТовары
		|ГДЕ
		|	ДокументТовары.Ссылка = &Ссылка
		|");
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	НаборЗаписейЗаказыРаспределение.РезультатЗапросаПоТоварам=Запрос.Выполнить();
	НаборЗаписейЗаказыРаспределение.ЗаказПокупателя=Неопределено; //Заказ находится в табличной части
	НаборЗаписейЗаказыРаспределение.ЗаказПоставщика=Ссылка;
	Отказ=НЕ НаборЗаписейЗаказыРаспределение.Приход() ИЛИ Отказ;
	
	// двигаем границу последовательности заказов
	Если ит_ИсточникЗаказа <> Перечисления.ит_ИсточникиЗаказовПоставщику.Многозадачник  Тогда	
		РаботаСГраницами.СдвинутьГраницуЗаказов(Ссылка,  ДополнительныеСвойства, Движения);
	КонецЕсли;
	//Мальцев А.Ю. +++ {Пометка 
	//документа для рассылки ПФ Заказ поставщику
	ПометитьДокументДляРассылки(Отказ);
	//Мальцев А.Ю. --- 
	
КонецПроцедуры // ОбработкаПроведения()

//Мальцев А.Ю. +++ 
Процедура ПометитьДокументДляРассылки(Отказ)
	
	Если Не Отказ И Контрагент.итРассылкаПФ_ЗаказПоставщику Тогда
				
		МЗрассылка = РегистрыСведений.итРассылкаЗаказПоставщику.СоздатьМенеджерЗаписи();
		МЗрассылка.ЗаказПоставщику = Ссылка;
		МЗрассылка.Прочитать(); 
		Если Не МЗрассылка.Выбран() Тогда
			МЗрассылка.ЗаказПоставщику = Ссылка;
			МЗрассылка.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
//Мальцев А.Ю. --- 

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли