#Область ОписаниеПеременных

&НаКлиенте
Перем мКонтекст;
&НаКлиенте
Перем РезультатВыполнения Экспорт;
&НаКлиенте
Перем ВозниклоИсключение Экспорт;
&НаКлиенте
Перем ТекстОшибкиОбработки Экспорт;

#КонецОбласти


&НаКлиенте
// Ожидать завершение выполнения работы ВП (обработчик ожидания)
//
Процедура ОжидатьЗавершениеВыполнения()
	
	Если ТЦКлиент.ОбработатьОжиданиеВРМ(мКонтекст, ЭтаФорма) Тогда
		ОбновитьВРМ();
	КонецЕсли;
	
КонецПроцедуры // ОжидатьЗавершениеВыполнения()

&НаКлиенте
// Обработчик открытия формы
//
Процедура ПриОткрытии(Отказ)
	Попытка
		мКонтекст = ТЦКлиент.СоздатьКонтекстВРМ(
			Параметры.Клиент,
			Параметры.Пользователь,
			Параметры.ВП,
			Параметры.ЛокальныйАдрес,
			ЭтаФорма);
		УстановитьСсылкуВРМ(Параметры.ВП);
		
		// Зарегистрировать ВРМ в справочнике ТЦУправлениеТестом
		ТЦСервер.УстановитьТипКлиентскогоПриложения(ПредопределенноеЗначение("Перечисление.ТЦТипКлиентскогоПриложения.ВРМ"));
		
	Исключение
		ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "ВРМ");
	КонецПопытки;
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
// Обработчик закрытия формы
//
Процедура ПриЗакрытии()
	
	Попытка
		ТЦКлиент.УдалитьКонтекстВРМ(мКонтекст);
	Исключение
		ТЦОбщий.ЗаписатьВЖурнал(ИнформацияОбОшибке(), "ВРМ");
	КонецПопытки;
	
КонецПроцедуры // ПриЗакрытии()

&НаКлиенте
// Обработчик приема локальных сообщений
//
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ТЦКлиент.ОбработатьСообщениеВРМ(мКонтекст, Данные) Тогда
		ОбновитьВРМ();
		УстановитьЗаголовокПриложения("ВРМ " + Строка(Объект.Номер) + " (" + Объект.Роль + ")");
	КонецЕсли;
	
КонецПроцедуры // ВнешнееСобытие()

&НаСервере
// 
//
// Параметры:
//  
//
Процедура УстановитьСсылкуВРМ(Ссылка)
	
	ТекущийОбъект = Ссылка.ПолучитьОбъект();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	
КонецПроцедуры // УстановитьСсылкуВРМ()

&НаСервере
// 
//
// Параметры:
//  
//
Процедура ОбновитьВРМ()
	
	НачатьТранзакцию();
	Прочитать();
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // ОбновитьВРМ()

&НаКлиенте
Процедура ЗакрытьВРМ(Команда)
	
	ЗавершитьРаботуСистемы();
	
КонецПроцедуры
