// Модуль менеджера перечисления "Алгоритм получения цены"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Получим значения функциональных опций
	ИспользоватьХарактеристики   = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики");
	ИспользоватьЕдиницыИзмерения = ПолучитьФункциональнуюОпцию("ИспользоватьЕдиницыИзмерения");
	ИспользоватьКоэффициент      = ПолучитьФункциональнуюОпцию("ИспользоватьКоэффициентЕдиницИзмерения");
	
	// Ограничения на список не накладываются
	Если ИспользоватьХарактеристики Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = ЛОЖЬ;
	ДанныеВыбора         = Новый СписокЗначений();
	
	Для каждого Значение Из Метаданные.Перечисления.АлгоритмПолученияЦены.ЗначенияПеречисления Цикл
		
		Если Значение.Имя = "ПоХарактеристике" И НЕ ИспользоватьХарактеристики Тогда
			Продолжить;
		КонецЕсли;
		
		Если Значение.Имя = "ПоЕдиницеИзмерения" И НЕ ИспользоватьЕдиницыИзмерения И НЕ ИспользоватьКоэффициент Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеВыбора.Добавить(Перечисления.АлгоритмПолученияЦены[Значение.Имя], Значение.Синоним);
		
	КонецЦикла;
	
КонецПроцедуры
