// @strict-types

#Область СлужебныеПроцедурыИФункции

#Область Черновик

// Возвращаемое значение:
//  Строка
Функция ВидОперацииЗаписьЧерновикаВЦентрЭДО() Экспорт
	
	Возврат НСтр("ru = 'Запись черновика МЧД в центр ЭДО'");
	
КонецФункции

#КонецОбласти

#Область ВыгрузитьВЦентрЭДО

// Возвращаемое значение:
//  Строка
Функция ВидОперацииВыгрузкаВЦентрЭДО() Экспорт
	
	Возврат НСтр("ru = 'Выгрузка МЧД в центр ЭДО'");
	
КонецФункции

// Параметры:
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//
// Возвращаемое значение:
//  Структура:
//  * ВыгрузкаПоДоверенностям - Соответствие из КлючИЗначение:
//    ** Ключ - ОпределяемыйТип.МашиночитаемаяДоверенность
//    ** Значение - Булево
//  * КонтекстДиагностики - Неопределено
//                        - см. ОбработкаНеисправностейБЭДКлиентСервер.НовыйКонтекстДиагностики
Функция НовыйРезультатВыгрузкиВЦентрЭДО(КонтекстДиагностики = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ВыгрузкаПоДоверенностям", Новый Соответствие);
	Результат.Вставить("КонтекстДиагностики", КонтекстДиагностики);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
