// Общий модуль "Технологическая платформа (служебный)"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//	Описание - Структура - сведения о библиотеке:
//
//		Имя					- Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//		Версия					- Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//		ТребуемыеПодсистемы	- Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//									Обработчики обновления таких библиотек должны быть вызваны ранее обработчиков обновления данной библиотеки.
//									При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//									порядок вызова обработчиков обновления определяется порядком добавления модулей
//									в процедуре ПриДобавленииПодсистем общего модуля ПодсистемыКонфигурацииПереопределяемый.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя                                  = "ТорговыйКомплекс";
	Описание.Версия                               = Метаданные.Версия;
	//Описание.ДобавлятьСлужебныеСобытия            = ИСТИНА;
	//Описание.ДобавлятьОбработчикиСлужебныхСобытий = ИСТИНА;
	//Описание.ДобавлятьОбработчикиСобытий          = ИСТИНА;
	//Описание.ДобавлятьСобытия                     = ИСТИНА;
	Описание.ТребуемыеПодсистемы.Добавить("УправлениеЛицензированием");
	
КонецПроцедуры // ПриДобавленииПодсистемы()

// Доопределяет обработчики служебных событий, объявленных через процедуру ПриДобавленииСлужебныхСобытий.
//
// Параметры:
//  КлиентскиеОбработчики - Соответствие, где
//                            Ключ     - Строка - полное имя события,
//                            Значение - Массив - массив имен клиентских общих модулей обработчиков.
//
//  СерверныеОбработчики  - Соответствие, где
//                            Ключ     - Строка - полное имя события,
//                            Значение - Массив - массив имен серверных общих модулей обработчиков.
//
// Для упрощения поддержки, рекомендуется делать вызов такой же процедуры в общем модуле библиотеки.
//
Процедура ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики) Экспорт
	
	// События возникающие в контексте Клиента
	//КлиентскиеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПриНачалеРаботыСистемы"]       .Добавить("ТорговыйКомплексКлиент");
	//КлиентскиеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПередНачаломРаботыСистемы"]    .Добавить("ТехнологическаяПлатформаКлиент");
	//КлиентскиеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПриНачалеРаботыСистемы"]       .Добавить("ТехнологическаяПлатформаКлиент");
	//КлиентскиеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПередЗавершениемРаботыСистемы"].Добавить("ТехнологическаяПлатформаКлиент");
	//КлиентскиеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПриЗавершенииРаботыСистемы"]   .Добавить("ТехнологическаяПлатформаКлиент");
	//КлиентскиеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ОбработкаВнешнегоСобытия"]     .Добавить("ТехнологическаяПлатформаКлиент");
	//
	//// События возникающие в контексте Сервера
	//СерверныеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииПараметровРаботыКлиентаПриЗапуске"].Добавить("ТехнологическаяПлатформаВызовСервера");
	//СерверныеОбработчики["СтандартныеПодсистемы.Печать\ПриОпределенииОбъектовСКомандамиПечати"].Добавить("УправлениеПечатьюПлатформа");
	
КонецПроцедуры // ПриДобавленииОбработчиковСлужебныхСобытий()

// Доопределяет события, к которым можно будет добавить обработчики через процедуру
// ПриДобавленииОбработчиковСлужебныхСобытий.
//
// Параметры:
//  КлиентскиеСобытия - Массив, где значения типа Строка - полное имя события.
//  СерверныеСобытия  - Массив, где значения типа Строка - полное имя события.
//
// Для упрощения поддержки, рекомендуется делать вызов такой же процедуры в общем модуле библиотеки.
//
Процедура ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия) Экспорт
	
	// Регистрируем новое клиентское событие системы
	//КлиентскиеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПриЗавершенииРаботыСистемы");
	//КлиентскиеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ОбработкаВнешнегоСобытия");
	
КонецПроцедуры // ПриДобавленииСлужебныхСобытий()

// Возвращает соответствие имен параметров сеанса и обработчиков для их инициализации.
//
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	
	//Обработчики.Вставить("ПодразделениеКомпании", "ТехнологическаяПлатформаВызовСервера.УстановкаПараметровСеанса");
	//Обработчики.Вставить("Организация",           "ТехнологическаяПлатформаВызовСервера.УстановкаПараметровСеанса");
	//Обработчики.Вставить("ОбщиеЗначения",         "ТехнологическаяПлатформаВызовСервера.УстановкаПараметровСеанса");
	//
	//// Подключаемое оборудование
	//Обработчики.Вставить("РабочееМестоКлиента", "МенеджерОборудованияВызовСервера.УстановитьПараметрыСеансаПодключаемогоОборудования");
	//// Подключаемое оборудование

КонецПроцедуры // ПриДобавленииОбработчиковУстановкиПараметровСеанса()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОБНОВЛЕНИЯ ПОДСИСТЕМЫ

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры // ПриОпределенииРежимаОбновленияДанных()

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//	Обработчики - ТаблицаЗначений 	- с колонками:
//		* ПредыдущееИмяКонфигурации	- Строка - имя конфигурации, с которой выполняется переход;
//		* Процедура					- Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации.
//										Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику".
//
// Обязательно должна быть экспортной.
//
// Пример добавления процедуры-обработчика в список:
//	Обработчик = Обработчики.Добавить();
//	Обработчик.ПредыдущееИмяКонфигурации	= "УправлениеТорговлей";
//	Обработчик.Процедура					= "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры // ПриДобавленииОбработчиковПереходаСДругойПрограммы()

// Вызывается после выполнения обработчиков перехода с другой программы
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(ПредыдущееИмяКонфигурации, ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры // ПриЗавершенииПереходаСДругойПрограммы()

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.МонопольныйРежим    = Ложь;
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	// Обновим объекты конфигурации, заполняющиеся на основании поставляемых с конфигурацией данных.
	ОбработчикиОбновленияПоставляемыхДанных(Обработчики);
	
	// Обработчики начального заполнения параметров ведения учета
	ОбработчикиНачальногоЗаполненияПараметрыУчета(Обработчики);
	
	// Обработчики инициализации предопределенных элементов системы
	ОбработчикиНачальногоЗаполненияКлассификаторы(Обработчики);
	
	// Обработчики инициализации нормативно-справочной информации
	ОбработчикиНачальногоЗаполненияНСИ(Обработчики);
	
	// Обработчики инициализации отраслевых объектов системы
	ОбработчикиНачальногоЗаполненияОтраслевыеОбъекты(Обработчики);
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.110";
	Обработчик.Процедура                    = "ТорговыйКомплекс.ВыполнитьЗаполнениеСуммыРегл";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.143";
	Обработчик.Процедура                    = "ТорговыйКомплекс.ВыполнитьЗаполнениеСпособаПолученияЦены";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	
КонецПроцедуры // ПриДобавленииОбработчиковОбновления()


// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры // ПередОбновлениемИнформационнойБазы()

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - (возвращаемое значение) если установить Истина,
//                                то будет выведена форма с описанием обновлений. По умолчанию, Истина.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
// Пример обхода выполненных обработчиков обновления:
//
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия, Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры // ПослеОбновленияИнформационнойБазы()

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры // ПриПодготовкеМакетаОписанияОбновлений()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ СИСТЕМЫ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОбработчикиОбновленияПоставляемыхДанных(Обработчики)
	
	// Инициализация системы прав и настроек...
	//Обработчик = Обработчики.Добавить();
	//Обработчик.Версия                       = "*";
	//Обработчик.Приоритет                    = 98;
	//Обработчик.Процедура                    = "ПланыВидовХарактеристик.ПраваИНастройки.ВыполнитьНачальноеЗаполнение";
	//Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	//Обработчик.НачальноеЗаполнение          = Истина;
	
КонецПроцедуры // ОбработчикиОбновленияПоставляемыхДанных()

Процедура ОбработчикиНачальногоЗаполненияПараметрыУчета(Обработчики)
	
	// Инициализируем параметры ведения учета
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.74";
	Обработчик.Процедура                    = "Справочники.СтавкиНДС.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.91";
	Обработчик.Процедура                    = "Справочники.ТипыСкидок.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.155";
	Обработчик.Процедура                    = "Справочники.СтатусыОбработкиЕГАИС.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
КонецПроцедуры // ОбработчикиНачальногоЗаполнения()

Процедура ОбработчикиНачальногоЗаполненияКлассификаторы(Обработчики)
	
	// Дополнительные реквизиты и сведения
	//Обработчик = Обработчики.Добавить();
	//Обработчик.Версия                       = "3.0.01.79";
	//Обработчик.Процедура                    = "ТехнологическаяПлатформаВызовСервера.ОбновитьПредопределенныеДопРеквизитыИСвойства";
	//Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	//Обработчик.НачальноеЗаполнение          = Истина;
	
КонецПроцедуры // ОбработчикиНачальногоЗаполненияКлассификаторы()

Процедура ОбработчикиНачальногоЗаполненияНСИ(Обработчики)
	
	//Обработчик = Обработчики.Добавить();
	//Обработчик.Версия                       = "3.0.01.33";
	//Обработчик.Процедура                    = "Справочники.Организации.ВыполнитьНачальноеЗаполнение";
	//Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	//Обработчик.НачальноеЗаполнение          = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия                       = "3.0.02.140";
	Обработчик.Процедура                    = "Справочники.ЦеновыеСегменты.ВыполнитьНачальноеЗаполнение";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение          = Истина;
	
	// Обработчики обновления иерархических данных.
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.МонопольныйРежим = Истина;
	Обработчик.Процедура = "ТорговыйКомплексСлужебный.ОбновитьСтруктурыИерархии";
	
КонецПроцедуры // ОбработчикиНачальногоЗаполненияНСИ()

Процедура ОбработчикиНачальногоЗаполненияОтраслевыеОбъекты(Обработчики)
	
	
	
КонецПроцедуры // ОбработчикиНачальногоЗаполненияОтраслевыеОбъекты()

//Процедура НачальноеЗаполнениеФункциональнойОпции_НастраиватьДоступНаУровнеЗаписей()   Экспорт

//	// +Рарус
//	Если Константы.ОграничиватьДоступНаУровнеЗаписей.Получить() Тогда
//		Константы.НастраиватьДоступНаУровнеЗаписей.Установить(Истина);
//	КонецЕсли;
//	// -Рарус


//КонецПроцедуры

// Обновляет вспомогательные данные, которые зависят от конфигурации частично.
//
// Обновляется при наличии изменений конфигурации, записанных в параметры
// ограничения доступа при обновлении базы данных на текущую версию конфигурации.
//
Процедура ОбновитьСтруктурыИерархии(Параметры = Неопределено) Экспорт
	
	Если Параметры <> Неопределено
	   И НЕ Параметры.МонопольныйРежим Тогда
		
		Параметры.МонопольныйРежим = Истина;
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СтруктураИерархииПодразделений");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СтруктураИерархииНоменклатуры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		РегистрыСведений.СтруктураИерархииПодразделений.ОбновитьСтруктуруИерархииПодразделений();
		РегистрыСведений.СтруктураИерархииНоменклатуры.ОбновитьСтруктуруИерархииНоменклатуры();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

