// @strict-types

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Обработчик события загрузки сообщения, для которого не найден электронный документ.
//
// Параметры:
//  ДанныеОбъекта - СтрокаТаблицыЗначений: см. СинхронизацияЭДО.НовыеДанныеОбъектов
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//  СтандартнаяОбработка - Булево
Процедура ПриЗагрузкеСообщенияБезДокумента(ДанныеОбъекта, КонтекстДиагностики, СтандартнаяОбработка) Экспорт
	
	Если Не УчетныеЗаписиЭДОПовтИсп.ИспользоватьРежимПереходаВЦентрЭДО(ДанныеОбъекта.ИдентификаторПолучателя) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеОбъекта.Отказ = Истина;
	
	СтатусИзменен = СинхронизацияЭДО.ИзменитьСтатусТранспортногоКонтейнера(ДанныеОбъекта.ТранспортныйКонтейнер,
		Перечисления.СтатусыТранспортныхСообщенийБЭД.РаспакованДокументыНеОбработаны, КонтекстДиагностики);
	
	Если Не СтатусИзменен Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторОбъекта = Строка(ДанныеОбъекта.ТранспортныйКонтейнер.УникальныйИдентификатор());
	
	МеткиВремениДанныхЭДО.Зафиксировать(ДанныеОбъекта.ИдентификаторПолучателя,
		Перечисления.ТипыСинхронизацииСЦентромЭДО.ТранспортныеКонтейнерыЭДО, ИдентификаторОбъекта);
	
КонецПроцедуры

#КонецОбласти // ДляВызоваИзДругихПодсистем

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  МеткиВремениПоИдентификаторамЭДО - Массив из Структура:
//  * МеткаВремени - Число
//  * ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * ЭтоПоследний - Булево
//  * НаборДанных - Массив из См. НовоеОписаниеВходящегоТранспортногоКонтейнераЭДО
Функция ПорцияМетокВремениТранспортныхКонтейнеровВРежимеПерехода(МеткиВремениПоИдентификаторамЭДО) Экспорт
	
	ПорцияДанных = Новый Структура;;
	ПорцияДанных.Вставить("ЭтоПоследний", Истина);
	ПорцияДанных.Вставить("НаборДанных", Новый Массив);
	
	Если Не ЗначениеЗаполнено(МеткиВремениПоИдентификаторамЭДО) Тогда
		Возврат ПорцияДанных;
	КонецЕсли;
	
	Порция = 1000;
	ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ТранспортныеКонтейнерыЭДО;
	
	ВыборкаМетокВремени = МеткиВремениДанныхЭДО.ВыборкаИдентификаторовДанныхПоМеткамВремени(ТипДанных,
		МеткиВремениПоИдентификаторамЭДО, Порция);
	
	ТранспортныеКонтейнеры = Новый Массив; // Массив из ДокументСсылка.ТранспортныйКонтейнерЭДО
	МеткиВремениТранспортныхКонтейнеровЭДО = Новый Соответствие;
	
	Пока ВыборкаМетокВремени.Следующий() Цикл
		УникальныйИдентификатор = Новый УникальныйИдентификатор(ВыборкаМетокВремени.ИдентификаторОбъекта);
		ТранспортныйКонтейнер = Документы.ТранспортныйКонтейнерЭДО.ПолучитьСсылку(УникальныйИдентификатор);
		ТранспортныеКонтейнеры.Добавить(ТранспортныйКонтейнер);
		
		МеткаВремениТранспортногоКонтейнера = НоваяМеткаВремениТранспортногоКонтейнераЭДО();
		МеткаВремениТранспортногоКонтейнера.ИдентификаторОбъекта = ВыборкаМетокВремени.ИдентификаторОбъекта;
		МеткаВремениТранспортногоКонтейнера.ИдентификаторЭДО = ВыборкаМетокВремени.ИдентификаторЭДО;
		МеткаВремениТранспортногоКонтейнера.МеткаВремени = ВыборкаМетокВремени.МеткаВремени;
		МеткиВремениТранспортныхКонтейнеровЭДО.Вставить(ТранспортныйКонтейнер, МеткаВремениТранспортногоКонтейнера);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ТранспортныеКонтейнеры) Тогда
		Возврат ПорцияДанных;
	КонецЕсли;
	
	Выборка = ВыборкаСвойствТранспортныхКонтейнеровЭДО(ТранспортныеКонтейнеры);
	
	НаборДанных = ПорцияДанных.НаборДанных; // Массив из Структура
	Пока Выборка.Следующий() Цикл
		
		МеткаВремениКонтейнера = МеткиВремениТранспортныхКонтейнеровЭДО[Выборка.Ссылка]; // См. НоваяМеткаВремениТранспортногоКонтейнераЭДО
		Если МеткаВремениКонтейнера = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МеткаВремениКонтейнера.ВнешнийИдентификатор = Выборка.ВнешнийУИД;
		НаборДанных.Добавить(МеткаВремениКонтейнера);
		
	КонецЦикла;
	
	ПорцияДанных.ЭтоПоследний = НаборДанных.Количество() < Порция;
	
	Возврат ПорцияДанных;
	
КонецФункции

// Параметры:
//  ИдентификаторТранспортногоКонтейнераЭДО - Строка
// 
// Возвращаемое значение:
//  - Неопределено
//  - См. НовыеДанныеТранспортногоКонтейнераВРежимеПерехода
Функция ДанныеТранспортногоКонтейнераВРежимеПерехода(ИдентификаторТранспортногоКонтейнераЭДО) Экспорт
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор(ИдентификаторТранспортногоКонтейнераЭДО);
	ТранспортныйКонтейнер = Документы.ТранспортныйКонтейнерЭДО.ПолучитьСсылку(УникальныйИдентификатор);
	Выборка = ВыборкаСвойствФайлаТранспортногоКонтейнераЭДО(ТранспортныйКонтейнер);
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Ссылка);
	Если ДвоичныеДанныеФайла = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	ТранспортныеКонтейнеры = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТранспортныйКонтейнер);
	ДанныеКонтейнеров = ТранспортныеКонтейнерыЭДО.ДанныеКонтейнеров(ТранспортныеКонтейнеры, КонтекстДиагностики);
	Если Не ЗначениеЗаполнено(ДанныеКонтейнеров) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеКонтейнера = ДанныеКонтейнеров[0];
	
	ДанныеКонтейнераВФорматеСервиса = НовыеДанныеТранспортногоКонтейнераВРежимеПерехода();
	ДанныеКонтейнераВФорматеСервиса.Контейнер = Base64Строка(ДвоичныеДанныеФайла);
	ДанныеКонтейнераВФорматеСервиса.ВнешнийИдентификатор = ДанныеКонтейнера.ИдентификаторКонтейнера;
	ДанныеКонтейнераВФорматеСервиса.ИдентификаторПакета = ДанныеКонтейнера.ИдентификаторПакета;
	ДанныеКонтейнераВФорматеСервиса.ИдентификаторДокументооборота = ДанныеКонтейнера.ИдентификаторДокументооборота;
	ДанныеКонтейнераВФорматеСервиса.ИдентификаторУчетнойЗаписи = ДанныеКонтейнера.ИдентификаторПолучателя;
	ДанныеКонтейнераВФорматеСервиса.СпособОбмена = ОбщегоНазначения.ИмяЗначенияПеречисления(
		ДанныеКонтейнера.СпособОбмена);
	ВидСервисаЭДО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТранспортныйКонтейнер, "ВидСервисаЭДО");
	Если ЗначениеЗаполнено(ВидСервисаЭДО) Тогда
		ДанныеКонтейнераВФорматеСервиса.ВидСервисаЭДО = ОбщегоНазначения.ИмяЗначенияПеречисления(ВидСервисаЭДО);
	КонецЕсли;
	
	ПроверенныеПодписиКонтейнеров = ЭлектронныеДокументыЭДО.ПроверитьПодписиПоДаннымКонтейнеров(
		ДанныеКонтейнеров, КонтекстДиагностики);
	Если Не ЗначениеЗаполнено(ПроверенныеПодписиКонтейнеров) Тогда
		Возврат ДанныеКонтейнераВФорматеСервиса;
	КонецЕсли;
	
	СвойстваПодписей = ДанныеКонтейнераВФорматеСервиса.СвойстваПодписей;
	
	Для Каждого ПроверенныеПодписиКонтейнера Из ПроверенныеПодписиКонтейнеров Цикл
		
		ПроверенныеПодписи = ПроверенныеПодписиКонтейнера.Значение;
		
		СвойстваПодписейОсновныхДанных = СвойстваПроверенныхПодписейВФорматеСервиса(
			ПроверенныеПодписи.ПодписиОсновныхДанных);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СвойстваПодписей, СвойстваПодписейОсновныхДанных);
		
		СвойстваПодписейДополнительныхДанных = СвойстваПроверенныхПодписейВФорматеСервиса(
			ПроверенныеПодписи.ПодписиДополнительныхДанных);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СвойстваПодписей, СвойстваПодписейДополнительныхДанных);
		
	КонецЦикла;
	
	Возврат ДанныеКонтейнераВФорматеСервиса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращаемое значение:
//  Структура:
//  * ВнешнийИдентификатор - Строка 
//  * ИдентификаторОбъекта - Строка 
//  * ИдентификаторЭДО - Строка 
//  * МеткаВремени - Число
Функция НоваяМеткаВремениТранспортногоКонтейнераЭДО()
	Свойства = Новый Структура;
	Свойства.Вставить("ВнешнийИдентификатор", "");
	Свойства.Вставить("ИдентификаторОбъекта", "");
	Свойства.Вставить("ИдентификаторЭДО", "");
	Свойства.Вставить("МеткаВремени", 0);
	Возврат Свойства;
КонецФункции

// Параметры:
//  ТранспортныеКонтейнеры - Массив из ДокументСсылка.ТранспортныйКонтейнерЭДО
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  * Ссылка - ДокументСсылка.ТранспортныйКонтейнерЭДО
//  * ВнешнийУИД - Строка
Функция ВыборкаСвойствТранспортныхКонтейнеровЭДО(ТранспортныеКонтейнеры)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТранспортныйКонтейнерЭДО.Ссылка КАК Ссылка,
		|	ТранспортныйКонтейнерЭДО.ВнешнийУИД КАК ВнешнийУИД
		|ИЗ
		|	Документ.ТранспортныйКонтейнерЭДО КАК ТранспортныйКонтейнерЭДО
		|ГДЕ
		|	ТранспортныйКонтейнерЭДО.Ссылка В (&ТранспортныеКонтейнеры)";
	
	Запрос.УстановитьПараметр("ТранспортныеКонтейнеры", ТранспортныеКонтейнеры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

// Параметры:
//  ТранспортныйКонтейнер - ДокументСсылка.ТранспортныйКонтейнерЭДО
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  * Ссылка - СправочникСсылка.ТранспортныйКонтейнерЭДОПрисоединенныеФайлы
Функция ВыборкаСвойствФайлаТранспортногоКонтейнераЭДО(ТранспортныйКонтейнер)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТранспортныйКонтейнерЭДОПрисоединенныеФайлы КАК ТранспортныйКонтейнерЭДОПрисоединенныеФайлы
		|ГДЕ
		|	ТранспортныйКонтейнерЭДОПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", ТранспортныйКонтейнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ВнешнийИдентификатор - Строка
//  * ИдентификаторПакета - Строка
//  * ИдентификаторДокументооборота - Строка
//  * ИдентификаторУчетнойЗаписи - Строка
//  * СпособОбмена - Строка
//  * ВидСервисаЭДО - Строка
//  * Контейнер - Строка - двоичные данные в формате base64.
//  * СвойстваПодписей - Массив из см. НовыеСвойстваПровереннойПодписиВФорматеСервиса
Функция НовыеДанныеТранспортногоКонтейнераВРежимеПерехода()
	
	ДанныеКонтейнера = Новый Структура;
	ДанныеКонтейнера.Вставить("ВнешнийИдентификатор", "");
	ДанныеКонтейнера.Вставить("ИдентификаторПакета", "");
	ДанныеКонтейнера.Вставить("ИдентификаторДокументооборота", "");
	ДанныеКонтейнера.Вставить("ИдентификаторУчетнойЗаписи", "");
	ДанныеКонтейнера.Вставить("СпособОбмена", "");
	ДанныеКонтейнера.Вставить("ВидСервисаЭДО", "");
	ДанныеКонтейнера.Вставить("Контейнер", "");
	ДанныеКонтейнера.Вставить("СвойстваПодписей", Новый Массив);
	Возврат ДанныеКонтейнера;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ХешПодписи - Строка
//  * Сертификат - Строка - двоичные данные в формате base64.
//  * ДатаПодписи - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ПодписьВерна - Булево
//  * ДатаПроверкиПодписи - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ТипПодписи - Строка
//  * СрокДействияПоследнейМеткиВремени - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ДатаПодписиИзМетки - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
Функция НовыеСвойстваПровереннойПодписиВФорматеСервиса()
	
	Свойства = Новый Структура;
	Свойства.Вставить("ХешПодписи", "");
	Свойства.Вставить("Сертификат", "");
	Свойства.Вставить("ДатаПодписи", "");
	Свойства.Вставить("ПодписьВерна", Ложь);
	Свойства.Вставить("ДатаПроверкиПодписи", "");
	Свойства.Вставить("ТипПодписи", "");
	Свойства.Вставить("СрокДействияПоследнейМеткиВремени", "");
	Свойства.Вставить("ДатаПодписиИзМетки", "");
	Возврат Свойства;
	
КонецФункции

// Параметры:
//  СвойстваПодписей - Массив из см. КриптографияБЭДКлиентСервер.НовыеСвойстваПодписи
// 
// Возвращаемое значение:
//  Массив из см. НовыеСвойстваПровереннойПодписиВФорматеСервиса
Функция СвойстваПроверенныхПодписейВФорматеСервиса(СвойстваПодписей)
	
	СвойстваПодписейВФорматеСервиса = Новый Массив; // См. СвойстваПроверенныхПодписейВФорматеСервиса
	
	Для Каждого СвойстваПодписи Из СвойстваПодписей Цикл
		
		СвойстваПодписиВФорматеСервиса = НовыеСвойстваПровереннойПодписиВФорматеСервиса();
		СвойстваПодписиВФорматеСервиса.ХешПодписи = КриптографияБЭД.ХешПодписи(СвойстваПодписи.Подпись);
		СвойстваПодписиВФорматеСервиса.ПодписьВерна = СвойстваПодписи.ПодписьВерна;
		Если СвойстваПодписи.Сертификат <> Неопределено Тогда
			СвойстваПодписиВФорматеСервиса.Сертификат = Base64Строка(СвойстваПодписи.Сертификат);
		КонецЕсли;
		Если ЗначениеЗаполнено(СвойстваПодписи.ДатаПодписи) Тогда
			СвойстваПодписиВФорматеСервиса.ДатаПодписи = ОбщегоНазначенияБЭД.ДатаВФорматеISO(СвойстваПодписи.ДатаПодписи);
		КонецЕсли;
		Если ЗначениеЗаполнено(СвойстваПодписи.ДатаПроверкиПодписи) Тогда
			СвойстваПодписиВФорматеСервиса.ДатаПроверкиПодписи = ОбщегоНазначенияБЭД.ДатаВФорматеISO(
				СвойстваПодписи.ДатаПроверкиПодписи);
		КонецЕсли;
		Если ЗначениеЗаполнено(СвойстваПодписи.ТипПодписи) Тогда
			СвойстваПодписиВФорматеСервиса.ТипПодписи = ОбщегоНазначения.ИмяЗначенияПеречисления(
				СвойстваПодписи.ТипПодписи);
		КонецЕсли;
		Если ЗначениеЗаполнено(СвойстваПодписи.СрокДействияПоследнейМеткиВремени) Тогда
			СвойстваПодписиВФорматеСервиса.СрокДействияПоследнейМеткиВремени = ОбщегоНазначенияБЭД.ДатаВФорматеISO(
				СвойстваПодписи.СрокДействияПоследнейМеткиВремени);
		КонецЕсли;
		Если ЗначениеЗаполнено(СвойстваПодписи.ДатаПодписиИзМетки) Тогда
			СвойстваПодписиВФорматеСервиса.ДатаПодписиИзМетки = ОбщегоНазначенияБЭД.ДатаВФорматеISO(
				СвойстваПодписи.ДатаПодписиИзМетки);
		КонецЕсли;
		
		СвойстваПодписейВФорматеСервиса.Добавить(СвойстваПодписиВФорматеСервиса);
		
	КонецЦикла;
	
	Возврат СвойстваПодписейВФорматеСервиса;
	
КонецФункции

#КонецОбласти
