
Функция URIПространстваИменПакетаXDTO() Экспорт
	
	Возврат "http://www.rarus.ru/TC/MobileInternalOrders";
	
КонецФункции

Функция ДесериализоватьСсылкуНаСправочник(СсылкаСериализованная, ИмяОбъекта)
	
	Если СсылкаСериализованная = "" Тогда
		Ссылка = Справочники[ИмяОбъекта].ПустаяСсылка();
	Иначе
		Идентификатор = Новый УникальныйИдентификатор(СсылкаСериализованная);
		Ссылка = Справочники[ИмяОбъекта].ПолучитьСсылку(Идентификатор);
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

Функция ДесериализоватьСсылкуНаДокумент(СсылкаСериализованная, ИмяОбъекта)
	
	Если СсылкаСериализованная = "" Тогда
		Ссылка = Документы[ИмяОбъекта].ПустаяСсылка();
	Иначе
		Идентификатор = Новый УникальныйИдентификатор(СсылкаСериализованная);
		Ссылка = Документы[ИмяОбъекта].ПолучитьСсылку(Идентификатор);
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

Функция СериализоватьСсылку(Ссылка)
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СсылкаСериализованная = Строка(Ссылка.УникальныйИдентификатор());
	Иначе
		СсылкаСериализованная = "";
	КонецЕсли;
	
	Возврат СсылкаСериализованная;
	
КонецФункции


//Записывает в базу документ ЗаказПоставщику, принимая его данные в виде объекта XDTO
Процедура ЗаписатьЗаказПоставщику(ОбъектXDTO, УзелОбмена, РегистрироватьПриИзменении = Истина, НомерБП = "", НовыйСчетФактура = Ложь) Экспорт
	
	НовыйОбъект = Ложь;
	
	Ссылка = ДесериализоватьСсылкуНаДокумент(ОбъектXDTO.Ссылка, "ЗаказПоставщику");
	Объект = Ссылка.ПолучитьОбъект();
	//Если Объект = Неопределено Тогда
	//	Объект = Документы.ЗаказПоставщику.СоздатьДокумент();
	//	Объект.УстановитьСсылкуНового(Ссылка);
	//	НовыйОбъект = Истина;
	//КонецЕсли;
	
	ПерезаписатьДокумент = Ложь;
	Для Каждого ЗагружаемаяСтрокаТЧ Из ОбъектXDTO.Товары Цикл
		
		Если ЗначениеЗаполнено(ЗагружаемаяСтрокаТЧ.Номенклатура) Тогда
			Номенклатура = ДесериализоватьСсылкуНаСправочник(ЗагружаемаяСтрокаТЧ.Номенклатура, "Номенклатура");
		КонецЕсли;
		
		Если ЗагружаемаяСтрокаТЧ.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОбъекта = Объект.Товары.Найти(Номенклатура, "Номенклатура");
		Если СтрокаОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОбъекта.Количество = ЗагружаемаяСтрокаТЧ.Количество;
		
		ПерезаписатьДокумент = Истина;
		
	КонецЦикла;
	
	Объект.ОбменДанными.Загрузка	= Истина;
	Объект.ОбменДанными.Отправитель = УзелОбмена;
	Объект.Записать();
	
	Если ОбъектXDTO.Проведен Тогда
		Попытка
			Объект.ОбменДанными.Загрузка = Ложь;
			Объект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Объект.Проведен = Ложь;
			Объект.ОбменДанными.Загрузка	= Истина;
			Объект.ОбменДанными.Отправитель = УзелОбмена;
			Объект.Записать();
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьСостоянияВыполненияЗаказовПоставщикам(ОбъектXDTO, УзелОбмена) Экспорт
	
	Заказ = ДесериализоватьСсылкуНаДокумент(ОбъектXDTO.Заказ, "ЗаказПоставщику");
	Состояние = ОбъектXDTO.Состояние;
	Если Состояние = "Согласование" Тогда
		Состояние = Перечисления.СостоянияВыполненияЗаказовПоставщикам.Согласование;
	ИначеЕсли Состояние = "Согласован" Тогда
		Состояние = Перечисления.СостоянияВыполненияЗаказовПоставщикам.Согласован;
	КонецЕсли;
	
	СостоянияЗаказовНаборЗаписей = РегистрыСведений.СостоянияВыполненияЗаказовПоставщикам.СоздатьНаборЗаписей();
	СостоянияЗаказовНаборЗаписей.Отбор.Заказ.Установить(Заказ);
	
	НоваяЗапись = СостоянияЗаказовНаборЗаписей.Добавить();
	НоваяЗапись.Заказ     = Заказ;
	НоваяЗапись.Состояние = Состояние;
	
	СостоянияЗаказовНаборЗаписей.ОбменДанными.Загрузка = Истина;
	СостоянияЗаказовНаборЗаписей.ОбменДанными.Отправитель = УзелОбмена;
	
	СостоянияЗаказовНаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ЗаписатьНастройкиУведомлений(НастройкиУведомлений, УзелОбмена) Экспорт
	
	Если НастройкиУведомлений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	УзелОбъект = УзелОбмена.ПолучитьОбъект();
	УзелОбъект.ПолучаетPushУведомления = НастройкиУведомлений.ПолучаетPushУведомления;
	УзелОбъект.ИдентификаторПодписчикаУведомлений = Новый ХранилищеЗначения(
		НастройкиУведомлений.ИдентификаторПодписчикаУведомлений, 
		Новый СжатиеДанных(9));
	УзелОбъект.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

//Производит прием сообщения обмена, полученного от МП, в параметрах указывается строка с сообщением и узел-отправитель МП, последний нужен для
// указания в свойстве ОбменДанными.Отправитель, чтобы при записи не регистрировались изменения для узла, из кот. они только что пришли
Процедура ПрочитатьСообщениеОбменаИЗаписатьДанныеМобильногоПриложения(УзелОбмена, СообщениеОбменаСтрокаXML) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СообщениеОбменаСтрокаXML);
	
	ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	ЧтениеСообщения.НачатьЧтение(ЧтениеXML);
	
	URIПространстваИмен = URIПространстваИменПакетаXDTO();
	
	НастройкиУведомлений = Неопределено;
	
	Пока ЧтениеXML.URIПространстваИмен = URIПространстваИмен Цикл
		
		ТипОбъектаXDTO	= ФабрикаXDTO.Тип(URIПространстваИмен, ЧтениеXML.Имя);
		ОбъектXDTO		= ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
		
		Если ОбъектXDTO.Тип().Имя = "ЗаказПоставщику" Тогда
			ЗаписатьЗаказПоставщику(ОбъектXDTO, УзелОбмена);
		ИначеЕсли ОбъектXDTO.Тип().Имя = "СостоянияВыполненияЗаказовПоставщикам" Тогда
			ЗаписатьСостоянияВыполненияЗаказовПоставщикам(ОбъектXDTO, УзелОбмена);
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеСообщения.ЗакончитьЧтение();
	ЧтениеXML.Закрыть();
	
	ЗаписатьНастройкиУведомлений(НастройкиУведомлений, УзелОбмена);
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияОбъектовДляПервичногоОбмена(УзелОбмена) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СостоянияВыполненияЗаказовПоставщикам.Заказ КАК Заказ
	|ИЗ
	|	РегистрСведений.СостоянияВыполненияЗаказовПоставщикам КАК СостоянияВыполненияЗаказовПоставщикам
	|ГДЕ
	|	СостоянияВыполненияЗаказовПоставщикам.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВыполненияЗаказовПоставщикам.Согласование) И 
	|	СостоянияВыполненияЗаказовПоставщикам.Заказ.ПодразделениеКомпании = &ПодразделениеКомпании
	|";
	
	Запрос.УстановитьПараметр("ПодразделениеКомпании", УзелОбмена.ПодразделениеКомпании);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Выборка.Заказ);
	КонецЦикла;
	
КонецПроцедуры // ЗарегистрироватьИзмененияДанных()

Процедура ИнициализироватьПервичныйОбмен(УзелОбмена, ИдентификаторУстройства, ВерсияКонфигурации, ШтрихКодПользователя) Экспорт
	
	ЦентральныйУзел = ПланыОбмена.ПланОбменаВнешниеЗаказы.ЭтотУзел();
	Если НЕ ЗначениеЗаполнено(ЦентральныйУзел.Код) Тогда
		УзелОбъект = ЦентральныйУзел.ПолучитьОбъект();
		УзелОбъект.ОбменДанными.Загрузка = Истина;
		УзелОбъект.Код = "001";
		УзелОбъект.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		УзелОбъект.Наименование = "Центральный";
		УзелОбъект.Записать();
	КонецЕсли;
	
	Если УзелОбмена.Пустая() Тогда
		
		ПодразделениеКомпании = Неопределено;
		Организация           = Неопределено;
		Если ЗначениеЗаполнено(ШтрихКодПользователя) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи).ПодразделениеКомпании КАК ПодразделениеКомпании,
			|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи).Организация КАК Организация
			|ИЗ
			|	РегистрСведений.Штрихкоды КАК Штрихкоды
			|ГДЕ
			|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
			|	Штрихкоды.Штрихкод = &Штрихкод
			|";
			Запрос.УстановитьПараметр("Штрихкод", ШтрихКодПользователя);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				ПодразделениеКомпании = Выборка.ПодразделениеКомпании;
				Организация           = Выборка.Организация;
			КонецЕсли;
		КонецЕсли;
		
		НовыйУзел = ПланыОбмена.ПланОбменаВнешниеЗаказы.СоздатьУзел();
		НовыйУзел.Код						= ИдентификаторУстройства;
		НовыйУзел.Наименование				= "Мобильное приложение " + ИдентификаторУстройства;
		
		НовыйУзел.ПодразделениеКомпании = ПодразделениеКомпании;
		НовыйУзел.Организация           = Организация;
		
		НовыйУзел.ВерсияКонфигурации		= ВерсияКонфигурации;
		НовыйУзел.ПолучаетPushУведомления	= Истина;
		НовыйУзел.Записать();
		УзелОбмена = НовыйУзел.Ссылка;
	Иначе
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена);
		УзелОбъект = УзелОбмена.ПолучитьОбъект();
		УзелОбъект.НомерОтправленного			= 0;
		УзелОбъект.НомерПринятого				= 0;
		УзелОбъект.ВерсияКонфигурации			= ВерсияКонфигурации;
		УзелОбъект.ПолучаетPushУведомления	    = Истина;
		УзелОбъект.Записать();
	КонецЕсли;
	
	ЗарегистрироватьИзмененияОбъектовДляПервичногоОбмена(УзелОбмена);
	
КонецПроцедуры

//Предназначена для приема данных из МП, в К-С варианте запускает ФЗ подготовки данных для отправки в МП
Функция НачатьСинхронизацию(ДанныеМобильногоПриложения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Разберем структуру входных параметров
	ПараметрыСтруктура = ДанныеМобильногоПриложения.Получить();
	
	ИдентификаторУстройства				= ПараметрыСтруктура.ИдентификаторУстройства;
	НомерУспешноПринятогоИзЦБСообщения	= ПараметрыСтруктура.НомерУспешноПринятогоИзЦБСообщения;
	//ДатаНачалаХраненияДанных			= ПараметрыСтруктура.ДатаНачалаХраненияДанных;
	ПервичныйОбмен						= ПараметрыСтруктура.ПервичныйОбмен;
	СообщениеОбменаСтрокаXML			= ПараметрыСтруктура.СообщениеОбменаСтрокаXML;
	ВерсияКонфигурации					= ПараметрыСтруктура.ВерсияКонфигурации;
	ШтрихКодПользователя				= ПараметрыСтруктура.ШтрихКод;
	
	//Подготовим структуру - шаблон ответа операции
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ОбменНевозможен",				Ложь);
	ОтветСтруктура.Вставить("ПричинаОтказаВОбмене",			"");
	ОтветСтруктура.Вставить("ИдентификаторЗадания",			"");
	ОтветСтруктура.Вставить("ИмяВременногоФайлаОбмена",		"");
	
	УзелОбмена = ПланыОбмена.ПланОбменаВнешниеЗаказы.НайтиПоКоду(ИдентификаторУстройства);
	
	//Если поступил запрос на первичный обмен, настроим узел и зарегистрируем нужные объекты к отправке
	Если ПервичныйОбмен Тогда
		ИнициализироватьПервичныйОбмен(УзелОбмена, ИдентификаторУстройства, ВерсияКонфигурации, ШтрихКодПользователя);
	КонецЕсли;
	
	Если УзелОбмена.Пустая() Тогда
		
		ОтветСтруктура.ОбменНевозможен = Истина;
		ОтветСтруктура.ПричинаОтказаВОбмене = НСтр("ru='Ошибка настройки синхронизации: не найден узел обмена данными'");
		
	Иначе
		
		//Если из мобильного приложения пришло сообщение обмена, прочитаем его и запишем данные
		Если СообщениеОбменаСтрокаXML <> Неопределено Тогда
			ПрочитатьСообщениеОбменаИЗаписатьДанныеМобильногоПриложения(УзелОбмена, СообщениеОбменаСтрокаXML)
		КонецЕсли;
		
		//Если изменилась ДатаНачалаХраненияДанных в мобильном приложении, сохраним новое значение и,
		//если дата изменилась на более раннюю, зарегистрируем соответствующие объекты к отправке
		//ПроверитьОбработатьИзменениеДатыНачалаХраненияДанных(УзелОбмена, ДатаНачалаХраненияДанных);
		
		//Если изменилась версия в мобильном приложении, сохраним новое значение и,
		//если надо, зарегистрируем новые объекты 
		Если ВерсияКонфигурации <> УзелОбмена.ВерсияКонфигурации Тогда
			
			//ВыполнитьОбработкуОбновленияВерсииМобильногоПриложения(УзелОбмена, ВерсияКонфигурации);
			//
			//УзелОбъект = УзелОбмена.ПолучитьОбъект();
			//УзелОбъект.ВерсияКонфигурации = ВерсияКонфигурации;
			//УзелОбъект.Записать();
			
		КонецЕсли;
		
		//Подготовим данные для отправки в мобильное приложение в фоновом задании
		ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
		ОтветСтруктура.ИмяВременногоФайлаОбмена = ИмяВременногоФайлаОбмена;
		
		ПараметрыЭкспортнойПроцедуры = Новый Массив;
		ПараметрыЭкспортнойПроцедуры.Добавить(УзелОбмена);
		ПараметрыЭкспортнойПроцедуры.Добавить(НомерУспешноПринятогоИзЦБСообщения);
		ПараметрыЭкспортнойПроцедуры.Добавить(ИмяВременногоФайлаОбмена);
		
		ИмяФоновогоЗадания = НСтр("ru='Синхронизация данных с мобильным устройством'");
		
		ФоновоеЗадание = ФоновыеЗадания.Выполнить(
			"ПланОбменаВнешниеЗаказы.ПодготовитьДанныеОбменаВФоне",
			ПараметрыЭкспортнойПроцедуры, 
			,
			ИмяФоновогоЗадания);
			
		ОтветСтруктура.ИдентификаторЗадания = Строка(ФоновоеЗадание.УникальныйИдентификатор);
		
	КонецЕсли;
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

//Предназначена для отправки данных в МП, в файловом варианте непосредственно готовит эти данные перед ответом
Функция ПолучитьПодготовленныеДанныеОбмена(ДанныеМобильногоПриложения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Разберем структуру входных параметров
	ПараметрыСтруктура = ДанныеМобильногоПриложения.Получить();
	
	ИдентификаторУстройства					= ПараметрыСтруктура.ИдентификаторУстройства;
	ИдентификаторЗадания					= ПараметрыСтруктура.ИдентификаторЗадания;
	ИмяВременногоФайлаОбмена				= ПараметрыСтруктура.ИмяВременногоФайлаОбмена;
	НомерУспешноПринятогоИзЦБСообщения		= ПараметрыСтруктура.НомерУспешноПринятогоИзЦБСообщения;
	
	//Подготовим структуру - шаблон ответа
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена",				Неопределено);
	ОтветСтруктура.Вставить("ЗаданиеЕщеВыполняется",	Истина);
	ОтветСтруктура.Вставить("СообщениеОбОшибке",		"");
	ОтветСтруктура.Вставить("ИдентификаторЗадания",		ИдентификаторЗадания);
	
	УзелОбмена = ПланыОбмена.ПланОбменаВнешниеЗаказы.НайтиПоКоду(ИдентификаторУстройства);
	
	//Если задание обмена выполнено, получим (вернем мобильному приложению) закэшированный результат
	УникальныйИдентификаторЗадания = Новый УникальныйИдентификатор(ИдентификаторЗадания);
	ФоновоеЗаданиеОбмена = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(УникальныйИдентификаторЗадания);
	Если ФоновоеЗаданиеОбмена = Неопределено Тогда
		ОтветСтруктура.ЗаданиеЕщеВыполняется	= Ложь;
		ОтветСтруктура.СообщениеОбОшибке		= НСтр("ru='Не найдено задание обмена'");
	ИначеЕсли ФоновоеЗаданиеОбмена.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
		ОтветСтруктура.ЗаданиеЕщеВыполняется	= Ложь;
		ОтветСтруктура.ДанныеОбмена				= Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	ИначеЕсли ФоновоеЗаданиеОбмена.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		ОтветСтруктура.ЗаданиеЕщеВыполняется	= Ложь;
		ОтветСтруктура.СообщениеОбОшибке		= НСтр("ru='Синхронизация завершена аварийно'");
	ИначеЕсли ФоновоеЗаданиеОбмена.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
		ОтветСтруктура.ЗаданиеЕщеВыполняется	= Ложь;
		ОтветСтруктура.СообщениеОбОшибке		= НСтр("ru='Задание обмена отменено администратором'");
	КонецЕсли;
	Если НЕ ОтветСтруктура.ЗаданиеЕщеВыполняется Тогда
		УдалитьФайлы(ИмяВременногоФайлаОбмена);
	КонецЕсли;
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьОбъектXDTO(ТипОбъекта)
	
	Возврат ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(Метаданные.ПакетыXDTO.MobileInternalOrders.ПространствоИмен, ТипОбъекта));
	
КонецФункции

Процедура ЗаписатьРеквизитXML(ЗаписьXML, ИмяРеквизита, ЗначениеРеквизита)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Реквизиты");
	
	// Имя реквизита
	ЗаписьXML.ЗаписатьАтрибут("Имя",      ИмяРеквизита);
	ЗаписьXML.ЗаписатьАтрибут("Значение", XMLСтрока(ЗначениеРеквизита));
	//// Тип реквизита
	//ЗаписьXML.ЗаписатьАтрибут("Тип", ТипРеквизита(ЗначениеРеквизита));
	// ЗаписьXML реквизита
	//ЗаписьXML.ЗаписатьТекст(XMLСтрока(ЗначениеРеквизита));
	
	// Конец секции "Реквизит"
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ЗаписатьСсылкуВОбъектXML(ЗаписьXML, Данные)
	
	Если ТипЗнч(Данные) = Тип("СправочникОбъект.ПодразделенияКомпании") Тогда
		ЗаписьXML.ЗаписатьАтрибут("Тип", "ПодразделенияКомпании");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Данные.Ссылка));
		ЗаписьXML.ЗаписатьАтрибут("Код", Данные.Код);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", Данные.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("Префикс", Данные.Префикс);
		ЗаписьXML.ЗаписатьАтрибут("КПП", Данные.КПП);
		ЗаписьXML.ЗаписатьАтрибут("GLN", Данные.GLN);
		ЗаписьXML.ЗаписатьАтрибут("НаименованиеПолное", Данные.НаименованиеПолное);
		//ЗаписьXML.ЗаписатьАтрибут("ПометкаУдаления", Данные.ПометкаУдаления);
		
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		
		ЗначенияСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Данные, "Ссылка, Наименование, Код, ПометкаУдаления, НаименованиеПолное, КПП, GLN, Префикс");
		
		ЗаписьXML.ЗаписатьАтрибут("Тип", "ПодразделенияКомпании");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ЗначенияСсылки.Ссылка));
		ЗаписьXML.ЗаписатьАтрибут("Код", ЗначенияСсылки.Код);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", ЗначенияСсылки.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("Префикс", ЗначенияСсылки.Префикс);
		ЗаписьXML.ЗаписатьАтрибут("КПП", ЗначенияСсылки.КПП);
		ЗаписьXML.ЗаписатьАтрибут("GLN", ЗначенияСсылки.GLN);
		ЗаписьXML.ЗаписатьАтрибут("НаименованиеПолное", ЗначенияСсылки.НаименованиеПолное);
		//ЗаписьXML.ЗаписатьАтрибут("ПометкаУдаления", ЗначенияСсылки.ПометкаУдаления);
		
	//ИначеЕсли ТипЗнч(Данные) = Тип("СправочникОбъект.МобильныеУстройства") Тогда
	//	
	//	ЗаписьXML.ЗаписатьАтрибут("Тип", "МобильныеУстройства");
	//	ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Данные.Ссылка));
	//	
	//	ЗаписьXML.ЗаписатьАтрибут("Код", Данные.Код);
	//	ЗаписьXML.ЗаписатьАтрибут("Наименование", Данные.Наименование);
	//	ЗаписьXML.ЗаписатьАтрибут("ИдентификаторУстройства", Данные.ИдентификаторУстройства);
	//	//ЗаписьXML.ЗаписатьАтрибут("ПометкаУдаления", Данные.ПометкаУдаления);
	//	
	//	ЗаписьXML.ЗаписатьНачалоЭлемента("ПодразделениеКомпании");
	//	ЗаписатьСсылкуВОбъектXML(ЗаписьXML, Данные.ПодразделениеКомпании);
	//	ЗаписьXML.ЗаписатьКонецЭлемента();
	//	
	//ИначеЕсли ТипЗнч(Данные) = Тип("СправочникСсылка.МобильныеУстройства") Тогда
	//	
	//	ЗначенияСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Данные, "Ссылка, Наименование, Код, ПометкаУдаления, ИдентификаторУстройства, ПодразделениеКомпании");
	//	
	//	ЗаписьXML.ЗаписатьАтрибут("Тип", "МобильныеУстройства");
	//	ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ЗначенияСсылки.Ссылка));
	//	
	//	ЗаписьXML.ЗаписатьАтрибут("Код", ЗначенияСсылки.Код);
	//	ЗаписьXML.ЗаписатьАтрибут("Наименование", ЗначенияСсылки.Наименование);
	//	ЗаписьXML.ЗаписатьАтрибут("ИдентификаторУстройства", ЗначенияСсылки.ИдентификаторУстройства);
	//	//ЗаписьXML.ЗаписатьАтрибут("ПометкаУдаления", Формат(ЗначенияСсылки.ПометкаУдаления));
	//	
	//	ЗаписьXML.ЗаписатьНачалоЭлемента("ПодразделениеКомпании");
	//	ЗаписатьСсылкуВОбъектXML(ЗаписьXML, ЗначенияСсылки.ПодразделениеКомпании);
	//	ЗаписьXML.ЗаписатьКонецЭлемента();
	//	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокИзXDTO(СписокЭлементов) Экспорт
	
	Если СписокЭлементов = Неопределено Тогда
		Результат = Новый Массив;
		Возврат Результат;
	КонецЕсли;
	
	Результат = Неопределено;
	Если ТипЗнч(СписокЭлементов) = Тип("СписокXDTO") Тогда
		Результат = СписокЭлементов;
	Иначе
		Результат = Новый Массив;
		Результат.Добавить(СписокЭлементов);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//Процедура ЗаписатьОбъектXML(ЗаписьXML, Данные)
//	
//	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
//	
//	ЗаписатьСсылкуВОбъектXML(ЗаписьXML, Данные);
//	
//	ЗаписьXML.ЗаписатьКонецЭлемента();
//	
//КонецПроцедуры

Функция СформироватьДанныеПередачи(Данные)
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	//ЗаписатьОбъектXML(ЗаписьXML, Данные);
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
	
	ЗаписатьСсылкуВОбъектXML(ЗаписьXML, Данные);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеОбмена(ДанныеОбмена) Экспорт
	
	Если ДанныеОбмена = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	ДанныеОбмена.Записать(ИмяВременногоФайлаОбмена);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	
	ДоступныеДанные = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	Возврат ДоступныеДанные;
	
КонецФункции

Функция Авторизация(ШтрихКод, ИдентификаторКлиента, ТекстСообщения)
	
	ТекстСообщения = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).ПодразделениеКомпании КАК ПодразделениеКомпании,
	               |	ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).ПодразделениеКомпании.Организация КАК Организация
	               |ИЗ
	               |	РегистрСведений.Штрихкоды КАК Штрихкоды
	               |ГДЕ
	               |	Штрихкоды.Объект ССЫЛКА Справочник.Карточки
	               |	И Штрихкоды.Штрихкод = &Штрихкод";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		ОтветСтруктура = Новый Структура;
		ОтветСтруктура.Вставить("ДанныеОбмена", Неопределено);
		
		ТекстСообщения = "По штрих-коду <"+ШтрихКод+"> подразделение не найдено";
		
		Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
		Возврат Результат;
	КонецЕсли;
	
	ПодразделениеКомпании = Выборка.ПодразделениеКомпании;
	
	ТекстСообщения = "Авторизовано подразделение: <"+ПодразделениеКомпании+">";
	
	Результат = СформироватьДанныеПередачи(ПодразделениеКомпании);
	
	Возврат Результат;
	
КонецФункции

Функция ПроверкаОбновленияВерсии(ВерсияПриложения)
	
	МинимальнаяВерсия = Константы.ВерсияМобильногоПриложения.Получить();
	Если ПустаяСтрока(МинимальнаяВерсия) Тогда
		МинимальнаяВерсия = "3.0.01.03";
	КонецЕсли;
	Результат = Ложь;
	Если ВерсияПриложения<МинимальнаяВерсия Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ЗаказыПоставщикам

Функция ПолучитьЗаказыПоставщикам(СсылкаПодразделениеКомпании, ВидЗаказа)
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ВидЗаказаСсылка = НЕОПРЕДЕЛЕНО;
	Если ЗначениеЗаполнено(ВидЗаказа) Тогда		
		Попытка 
			ВидЗаказаСсылка = Перечисления.рздВидыЗаказовЕРП[ВидЗаказа];
		Исключение
		КонецПопытки;		
	КонецЕсли;
	
	НачалоПериода = НачалоДня(ТекущаяДатаСеанса())-8*86400;
	КонецПериода  = КонецДня(ТекущаяДатаСеанса())-86400;
	
	// Обновляем заказы поставщикам по плановомуассортименту
	ЗапросЗаказыНаСогласовании = Новый Запрос("ВЫБРАТЬ
	|	СостоянияВыполненияЗаказовПоставщикам.Заказ КАК Заказ
	|ИЗ
	|	РегистрСведений.СостоянияВыполненияЗаказовПоставщикам КАК СостоянияВыполненияЗаказовПоставщикам
	|ГДЕ
	|	СостоянияВыполненияЗаказовПоставщикам.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВыполненияЗаказовПоставщикам.Согласование)
	|	И СостоянияВыполненияЗаказовПоставщикам.Заказ.ПодразделениеКомпании = &ПодразделениеКомпании
	|	И СостоянияВыполненияЗаказовПоставщикам.Заказ.ПометкаУдаления = ЛОЖЬ
	|	И НАЧАЛОПЕРИОДА(СостоянияВыполненияЗаказовПоставщикам.Заказ.Дата, ДЕНЬ) = &Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	СостоянияВыполненияЗаказовПоставщикам.Заказ");
	
	ЗапросЗаказыНаСогласовании.УстановитьПараметр("ПодразделениеКомпании",ПодразделениеКомпании);
	ЗапросЗаказыНаСогласовании.УстановитьПараметр("Дата", НачалоДня(ТекущаяДатаСеанса()));
	ЗапросЗаказыНаСогласованииВыборка = ЗапросЗаказыНаСогласовании.Выполнить().Выбрать();
	
	Пока ЗапросЗаказыНаСогласованииВыборка.Следующий() Цикл
		ДокументОбъект = ЗапросЗаказыНаСогласованииВыборка.Заказ.ПолучитьОбъект();
		ОбновитьПланЗаказаТекОстатками(ПодразделениеКомпании, ДокументОбъект.ит_ВидЗаявки, ДокументОбъект); 	
	КонецЦикла;
	// Обновляем заказы поставщикам по плановомуассортименту		
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ВидЗаказа", ВидЗаказаСсылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостоянияВыполненияЗаказовПоставщикам.Заказ КАК Заказ
	               |ПОМЕСТИТЬ ТаблицаЗаказов
	               |ИЗ
	               |	РегистрСведений.СостоянияВыполненияЗаказовПоставщикам КАК СостоянияВыполненияЗаказовПоставщикам
	               |ГДЕ
	               |	СостоянияВыполненияЗаказовПоставщикам.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВыполненияЗаказовПоставщикам.Согласование)
	               |	И СостоянияВыполненияЗаказовПоставщикам.Заказ.ПодразделениеКомпании = &ПодразделениеКомпании
	               |	И СостоянияВыполненияЗаказовПоставщикам.Заказ.ПометкаУдаления = ЛОЖЬ
	               |	И НАЧАЛОПЕРИОДА(СостоянияВыполненияЗаказовПоставщикам.Заказ.Дата, ДЕНЬ) = &Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЗаказов.Заказ КАК Заказ,
	               |	ТаблицаЗаказов.Заказ.СкладКомпании КАК СкладКомпании,
	               |	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ЗаказПоставщикуТовары.Количество * ЗаказПоставщикуТовары.Коэффициент) КАК Количество
	               |ПОМЕСТИТЬ ТаблицаТовары
	               |ИЗ
	               |	ТаблицаЗаказов КАК ТаблицаЗаказов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.ПланЗаказа КАК ЗаказПоставщикуТовары
	               |		ПО ТаблицаЗаказов.Заказ = ЗаказПоставщикуТовары.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаЗаказов.Заказ,
	               |	ЗаказПоставщикуТовары.Номенклатура,
	               |	ТаблицаЗаказов.Заказ.СкладКомпании
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТабПродажи.Номенклатура КАК Номенклатура,
	               |	СУММА(ТабПродажи.Количество) / 7 КАК СредняяПродажа
	               |ПОМЕСТИТЬ СредниеПродажи
	               |ИЗ
	               |	РегистрНакопления.Продажи КАК ТабПродажи
	               |ГДЕ
	               |	ТабПродажи.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И (ТабПродажи.СкладКомпании, ТабПродажи.Номенклатура) В
	               |			(ВЫБРАТЬ
	               |				ТаблицаТовары.СкладКомпании,
	               |				ТаблицаТовары.Номенклатура
	               |			ИЗ
	               |				ТаблицаТовары)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТабПродажи.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ТаблицаТовары.КоличествоОстаток КАК Запас
	               |ПОМЕСТИТЬ ТаблицаЗапасы
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	               |			,
	               |			(СкладКомпании, Номенклатура) В
	               |				(ВЫБРАТЬ
	               |					ТаблицаТовары.СкладКомпании,
	               |					ТаблицаТовары.Номенклатура
	               |				ИЗ
	               |					ТаблицаТовары)) КАК ТаблицаТовары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(СогласованныеЦены.Цена, 0) КАК Цена,
	               |	ЕСТЬNULL(СогласованныеЦены.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК Период
	               |ПОМЕСТИТЬ втЦены
	               |ИЗ
	               |	ТаблицаТовары КАК ТаблицаТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
	               |		ПО ТаблицаТовары.Номенклатура = СогласованныеЦены.Номенклатура
	               |			И ТаблицаТовары.Номенклатура.ит_ОсновнойПоставщик = СогласованныеЦены.Контрагент
	               |			И (СогласованныеЦены.ПодразделениеКомпании = &ПодразделениеКомпании)
	               |			И (СогласованныеЦены.Период <= &Дата)
	               |			И (СогласованныеЦены.СрокДействия >= &Дата)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втЦены.Номенклатура КАК Номенклатура,
	               |	МАКСИМУМ(втЦены.Период) КАК Период
	               |ПОМЕСТИТЬ втЦеныМаксПериод
	               |ИЗ
	               |	втЦены КАК втЦены
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втЦены.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втЦены.Номенклатура КАК Номенклатура,
	               |	втЦены.Цена КАК Цена,
	               |	втЦены.Период КАК Период
	               |ПОМЕСТИТЬ втЦеныИтог
	               |ИЗ
	               |	втЦены КАК втЦены
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЦеныМаксПериод КАК втЦеныМаксПериод
	               |		ПО втЦены.Номенклатура = втЦеныМаксПериод.Номенклатура
	               |			И втЦены.Период = втЦеныМаксПериод.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	итМаксимальноеКоличествоДляЗаказа.Номенклатура КАК Номенклатура,
	               |	итМаксимальноеКоличествоДляЗаказа.Количество КАК Количество
	               |ПОМЕСТИТЬ втМаксДляЗаказа1
	               |ИЗ
	               |	РегистрСведений.итМаксимальноеКоличествоДляЗаказа КАК итМаксимальноеКоличествоДляЗаказа
	               |ГДЕ
	               |	итМаксимальноеКоличествоДляЗаказа.Подразделение = &ПодразделениеКомпании
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество,
	               |	ЗаказПоставщикуТовары.Ссылка.ПодразделениеКомпании КАК ПодразделениеКомпании
	               |ПОМЕСТИТЬ втЗаказы
	               |ИЗ
	               |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	               |ГДЕ
	               |	ЗаказПоставщикуТовары.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	               |	И ЗаказПоставщикуТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И ЗаказПоставщикуТовары.Ссылка.Проведен = ИСТИНА
	               |	И ЗаказПоставщикуТовары.Ссылка.ПодразделениеКомпании = &ПодразделениеКомпании
	               |	И ЗаказПоставщикуТовары.Номенклатура В
	               |			(ВЫБРАТЬ
	               |				втМаксДляЗаказа1.Номенклатура КАК Номенклатура
	               |			ИЗ
	               |				втМаксДляЗаказа1 КАК втМаксДляЗаказа1)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказПоставщикуТовары.Ссылка.ПодразделениеКомпании,
	               |	ЗаказПоставщикуТовары.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втНормы.Номенклатура КАК Номенклатура,
	               |	втНормы.Количество КАК Количество
	               |ПОМЕСТИТЬ втМаксДляЗаказа2
	               |ИЗ
	               |	втМаксДляЗаказа1 КАК втНормы
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	втЗаказы.Номенклатура,
	               |	втЗаказы.Количество * -1
	               |ИЗ
	               |	втЗаказы КАК втЗаказы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втМаксДляЗаказа2.Номенклатура КАК Номенклатура,
	               |	СУММА(втМаксДляЗаказа2.Количество) КАК Количество
	               |ПОМЕСТИТЬ втМаксДляЗаказа
	               |ИЗ
	               |	втМаксДляЗаказа2 КАК втМаксДляЗаказа2
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втМаксДляЗаказа2.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ШтрихКоды.ЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
	               |	ШтрихКоды.Штрихкод КАК Штрихкод
	               |ИЗ
	               |	ТаблицаТовары КАК ТаблицаТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихКоды
	               |		ПО ТаблицаТовары.Номенклатура = ШтрихКоды.Объект
	               |			И (ШтрихКоды.Запрет = ЛОЖЬ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Заказ КАК Заказ,
	               |	ТаблицаТовары.Заказ.Номер КАК Номер,
	               |	ТаблицаТовары.Заказ.Дата КАК Дата,
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ТаблицаТовары.Номенклатура.Код КАК НоменклатураКод,
	               |	ТаблицаТовары.Номенклатура.ТипНоменклатуры.Весовой КАК Весовой,
	               |	ТаблицаТовары.Номенклатура.КратностьПоставок КАК КратностьПоставок,
	               |	ТаблицаТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	               |	ТаблицаТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
	               |	ТаблицаТовары.Номенклатура.ИерархияАльтернативная КАК Родитель,
	               |	ТаблицаТовары.Номенклатура.ИерархияАльтернативная.Код КАК РодительКод,
	               |	ТаблицаТовары.Номенклатура.ИерархияАльтернативная.Наименование КАК РодительНаименование,
	               |	ТаблицаТовары.Количество КАК Количество,
	               |	ЕСТЬNULL(ТаблицаЗапасы.Запас, 0) КАК Запас,
	               |	ЕСТЬNULL(СредниеПродажи.СредняяПродажа, 0) КАК СредняяПродажа,
	               |	ТаблицаТовары.Номенклатура.ит_ОсновнойПоставщик.Наименование КАК ОсновнойПоставщикНаименование,
	               |	ТаблицаТовары.Номенклатура.ит_ОсновнойПоставщик.ИНН КАК ОсновнойПоставщикИНН,
	               |	ТаблицаТовары.Номенклатура.ит_ОсновнойПоставщик.КПП КАК ОсновнойПоставщикКПП,
	               |	ТаблицаТовары.Номенклатура.ит_ОсновнойПоставщик.GLN КАК ОсновнойПоставщикGLN,
	               |	ТаблицаТовары.Номенклатура.ит_ОсновнойПоставщик.МинимальнаяСуммаЗаказа КАК ОсновнойПоставщикМинимальнаяСуммаЗаказа,
	               |	ТаблицаТовары.Номенклатура.ит_ОсновнойПоставщик КАК ОсновнойПоставщик,
	               |	ТаблицаТовары.Номенклатура.ит_ОсновнойПоставщик.Код КАК ОсновнойПоставщикКод,
	               |	ТаблицаТовары.Номенклатура.ит_ОсновнойПоставщик.НаименованиеПолное КАК ОсновнойПоставщикНаименованиеПолное,
	               |	втЦеныИтог.Цена КАК ЦенаЗакупки,
	               |	ЕСТЬNULL(втМаксДляЗаказа.Количество, 0) КАК МаксДляЗаказа,
	               |	ВЫБОР
	               |		КОГДА втМаксДляЗаказа.Количество ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК КонтрольМаксДляЗаказа
	               |ИЗ
	               |	ТаблицаТовары КАК ТаблицаТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗапасы КАК ТаблицаЗапасы
	               |		ПО ТаблицаТовары.Номенклатура = ТаблицаЗапасы.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СредниеПродажи КАК СредниеПродажи
	               |		ПО ТаблицаТовары.Номенклатура = СредниеПродажи.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втЦеныИтог КАК втЦеныИтог
	               |		ПО ТаблицаТовары.Номенклатура = втЦеныИтог.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втМаксДляЗаказа КАК втМаксДляЗаказа
	               |		ПО ТаблицаТовары.Номенклатура = втМаксДляЗаказа.Номенклатура
	               |ГДЕ
	               |	ТаблицаТовары.Заказ.ит_ВидЗаявки = &ВидЗаказа
	               |ИТОГИ ПО
	               |	Заказ";
	
	
	Если Не ЗначениеЗаполнено(ВидЗаказаСсылка) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаТовары.Заказ.ит_ВидЗаявки = &ВидЗаказа", "1=1");	
	КонецЕсли;
	
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	РезультатЗапроса = ПакетыЗапросов[ПакетыЗапросов.Количество()-1];
	Если РезультатЗапроса.Пустой() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ВыборкаШтрихкоды = ПакетыЗапросов[ПакетыЗапросов.Количество()-2].Выбрать();
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	//ЗаписатьОбъектXML(ЗаписьXML, Данные);
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
	ВыборкаЗаказ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаказ.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Заказы"); // Заказ
		ЗаписьXML.ЗаписатьАтрибут("Тип", "ЗаказПоставщику");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаЗаказ.Заказ));
		ЗаписьXML.ЗаписатьАтрибут("Номер", ВыборкаЗаказ.Номер);
		//ЗаписьXML.ЗаписатьАтрибут("Дата",  Формат(ВыборкаЗаказ.Дата, ));
		ЗаписьXML.ЗаписатьАтрибут("Дата",  Строка(ВыборкаЗаказ.Дата));
		ЗаписьXML.ЗаписатьАтрибут("ВидЗаказа",  ?(ВыборкаЗаказ.Заказ.ит_ВидЗаявки.Пустая(),"",Строка(ВыборкаЗаказ.Заказ.ит_ВидЗаявки.метаданные().ЗначенияПеречисления.Получить(Перечисления.рздВидыЗаказовЕРП.Индекс(ВыборкаЗаказ.Заказ.ит_ВидЗаявки)).Имя)));
		//ЗаписьXML.ЗаписатьНачалоЭлемента("Товары"); // Товары
		Выборка = ВыборкаЗаказ.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("Товары"); // ТоварнаяСтрока
			ЗаписьXML.ЗаписатьАтрибут("Количество", Формат(Выборка.Количество, "ЧРД=.; ЧН=0; ЧГ="));
			ЗаписьXML.ЗаписатьАтрибут("Запас", Формат(Выборка.Запас, "ЧРД=.; ЧН=0; ЧГ="));
			ЗаписьXML.ЗаписатьАтрибут("СредняяПродажа", Формат(Выборка.СредняяПродажа, "ЧРД=.; ЧН=0; ЧГ="));
			ЗаписьXML.ЗаписатьАтрибут("МаксДляЗаказа", Формат(Выборка.МаксДляЗаказа, "ЧРД=.; ЧН=0; ЧГ="));		
			ЗаписьXML.ЗаписатьАтрибут("КонтрольМаксДляЗаказа", ?(Выборка.КонтрольМаксДляЗаказа,"Истина","Ложь"));
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
			ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Номенклатура));
			ЗаписьXML.ЗаписатьАтрибут("Код", Выборка.НоменклатураКод);
			ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.НоменклатураНаименование);
			ЗаписьXML.ЗаписатьАтрибут("Артикул", Выборка.НоменклатураАртикул);
			ЗаписьXML.ЗаписатьАтрибут("КратностьПоставок", Формат(Выборка.КратностьПоставок, "ЧРД=.; ЧН=0; ЧГ="));
			ЗаписьXML.ЗаписатьАтрибут("Весовой", ?(Выборка.Весовой,"Истина","Ложь"));
			ЗаписьXML.ЗаписатьАтрибут("ЦенаЗакупки", Формат(Выборка.ЦенаЗакупки, "ЧРД=.; ЧН=0; ЧГ="));
			
			ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Ложь");
			Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель"); // Родитель
				ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
				ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Родитель));
				ЗаписьXML.ЗаписатьАтрибут("Код", Выборка.РодительКод);
				ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.РодительНаименование);
				ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Истина");
				ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
			Иначе
				ЗаписьXML.ЗаписатьАтрибут("Родитель", "");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ОсновнойПоставщик) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Поставщик"); // Родитель
				ЗаписьXML.ЗаписатьАтрибут("Тип",          		   "Контрагенты");
				ЗаписьXML.ЗаписатьАтрибут("Ссылка",       		   СериализоватьСсылку(Выборка.ОсновнойПоставщик));
				ЗаписьXML.ЗаписатьАтрибут("Код",          		   Выборка.ОсновнойПоставщикКод);
				ЗаписьXML.ЗаписатьАтрибут("Наименование", 		   Выборка.ОсновнойПоставщикНаименование);      
				ЗаписьXML.ЗаписатьАтрибут("ИНН",          		   Выборка.ОсновнойПоставщикИНН);
				ЗаписьXML.ЗаписатьАтрибут("КПП",          		   Выборка.ОсновнойПоставщикКПП);
				ЗаписьXML.ЗаписатьАтрибут("GLN",          		   Выборка.ОсновнойПоставщикGLN);
				ЗаписьXML.ЗаписатьАтрибут("МинимальнаяСуммаЗаказа",Формат(Выборка.ОсновнойПоставщикМинимальнаяСуммаЗаказа, "ЧРД=.; ЧН=0; ЧГ="));
				ЗаписьXML.ЗаписатьАтрибут("НаименованиеПолное",    Выборка.ОсновнойПоставщикНаименованиеПолное);
				
				ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
			Иначе
				ЗаписьXML.ЗаписатьАтрибут("ТоварноеСоседство", "");
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
			ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
		КонецЦикла;
		//ЗаписьXML.ЗаписатьКонецЭлемента(); // Товары
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Заказ
	КонецЦикла;
	
	Пока ВыборкаШтрихкоды.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ШтрихКоды"); // ТоварнаяСтрока
		
		ЗаписьXML.ЗаписатьАтрибут("Штрихкод", ВыборкаШтрихкоды.Штрихкод);
		ЗаписьXML.ЗаписатьАтрибут("Коэффициент", Формат(ВыборкаШтрихкоды.Коэффициент, "ЧРД=.; ЧН=0; ЧГ="));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
		ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаШтрихкоды.Номенклатура));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Заказы
	
	ЗаписьXML.Закрыть();
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции


//Мальцев А.Ю.+++
//Обновление Заказов поставщику

Процедура ОбновитьПланЗаказаТекОстатками(ПодразделениеКомпании, ВидЗаказа, ОбЗаказ)
	
	//ЗапросОбн = Новый Запрос("ВЫБРАТЬ
	//|	БлокировкаАссортиментаСрезПоследних.Номенклатура КАК Номенклатура,
	//|	БлокировкаАссортиментаСрезПоследних.Заблокировано КАК Заблокировано
	//|ПОМЕСТИТЬ втЗаблокированныйАссортимент
	//|ИЗ
	//|	РегистрСведений.БлокировкаАссортимента.СрезПоследних КАК БлокировкаАссортиментаСрезПоследних
	//|ГДЕ
	//|	БлокировкаАссортиментаСрезПоследних.ПодразделениеКомпании = &ВыбПодразделение
	//|	И БлокировкаАссортиментаСрезПоследних.Контрагент = &КонтрагентМПЗ
	//|	И БлокировкаАссортиментаСрезПоследних.СрокДействия >= &НаДату
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	БлокировкаАссортиментаСрезПоследних.Номенклатура,
	//|	БлокировкаАссортиментаСрезПоследних.Заблокировано
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура КАК Ключ,
	//|	0 КАК Количество,
	//|	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа КАК Значение,
	//|	ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние КАК Состояние,
	//|	МАКСИМУМ(СогласованныеЦеныСрезПоследних.Период) КАК Период,
	//|	СогласованныеЦеныСрезПоследних.Контрагент КАК Контрагент,
	//|	СогласованныеЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	//|	СогласованныеЦеныСрезПоследних.ПодразделениеКомпании КАК ПодразделениеКомпании
	//|ПОМЕСТИТЬ втАссортиментМаксимальныйПериод
	//|ИЗ
	//|	РегистрСведений.ОграничениеАссортиментаПодразделения.СрезПоследних(&НаДату, ) КАК ОграничениеАссортиментаПодразделенияСрезПоследних
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры КАК ит_СоответствиеВидаЗаявкиВидуНоменклатуры
	//|		ПО ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ит_ВидЗаявки = ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказаНоменклатура
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СогласованныеЦены.СрезПоследних(&НаДату, ) КАК СогласованныеЦеныСрезПоследних
	//|		ПО ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура = СогласованныеЦеныСрезПоследних.Номенклатура
	//|			И (СогласованныеЦеныСрезПоследних.Контрагент = &КонтрагентМПЗ)
	//|			И ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании = СогласованныеЦеныСрезПоследних.ПодразделениеКомпании
	//|ГДЕ
	//|	ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании = &ВыбПодразделение
	//|	И ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа = &ВидЗаказа
	//|	И ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
	//|	И СогласованныеЦеныСрезПоследних.СрокДействия >= &НаДату
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура,
	//|	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа,
	//|	ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние,
	//|	СогласованныеЦеныСрезПоследних.Контрагент,
	//|	СогласованныеЦеныСрезПоследних.Номенклатура,
	//|	СогласованныеЦеныСрезПоследних.ПодразделениеКомпании
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	втАссортиментМаксимальныйПериод.Ключ КАК Ключ,
	//|	втАссортиментМаксимальныйПериод.Количество КАК Количество,
	//|	втАссортиментМаксимальныйПериод.Значение КАК Значение,
	//|	втАссортиментМаксимальныйПериод.Состояние КАК Состояние,
	//|	МАКСИМУМ(СогласованныеЦены.Цена) КАК Цена
	//|ИЗ
	//|	втАссортиментМаксимальныйПериод КАК втАссортиментМаксимальныйПериод
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
	//|		ПО втАссортиментМаксимальныйПериод.Период = СогласованныеЦены.Период
	//|			И втАссортиментМаксимальныйПериод.Контрагент = СогласованныеЦены.Контрагент
	//|			И втАссортиментМаксимальныйПериод.Номенклатура = СогласованныеЦены.Номенклатура
	//|			И втАссортиментМаксимальныйПериод.ПодразделениеКомпании = СогласованныеЦены.ПодразделениеКомпании
	//|		ЛЕВОЕ СОЕДИНЕНИЕ втЗаблокированныйАссортимент КАК втЗаблокированныйАссортимент
	//|		ПО втАссортиментМаксимальныйПериод.Номенклатура = втЗаблокированныйАссортимент.Номенклатура
	//|			И (втЗаблокированныйАссортимент.Заблокировано)
	//|ГДЕ
	//|	СогласованныеЦены.Цена <> 0
	//|	И втЗаблокированныйАссортимент.Номенклатура ЕСТЬ NULL
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	втАссортиментМаксимальныйПериод.Ключ,
	//|	втАссортиментМаксимальныйПериод.Количество,
	//|	втАссортиментМаксимальныйПериод.Значение,
	//|	втАссортиментМаксимальныйПериод.Состояние");
	//
	//ЗапросОбн.УстановитьПараметр("ВыбПодразделение", ПодразделениеКомпании);
	//ЗапросОбн.УстановитьПараметр("НаДату", ТекущаяДата());	 
	//ЗапросОбн.УстановитьПараметр("ВидЗаказа", ВидЗаказа);
	//КонтрагентМПЗ = Справочники.Контрагенты.НайтиПоРеквизиту("ЕРПМастерКлюч","00000019376").Ссылка;
	//ЗапросОбн.УстановитьПараметр("КонтрагентМПЗ", КонтрагентМПЗ);
	//
	//тбРезультат = ЗапросОбн.Выполнить().Выгрузить();
	
	КонтрагентМПЗ = Справочники.Контрагенты.НайтиПоРеквизиту("ЕРПМастерКлюч","00000019376").Ссылка;
	
	тбРезультат = ПолучитьТоварыДляЗаказа(ВидЗаказа,ПодразделениеКомпании,КонтрагентМПЗ);
	
	ОбЗаказ.ПланЗаказа.Очистить();
	Для Каждого Строка Из тбРезультат Цикл
		НоваяСтрока = ОбЗаказ.ПланЗаказа.Добавить();			
		НоваяСтрока.Номенклатура = Строка.Ключ;
		Документы.ЗаказПоставщику.ПланЗаказаНоменклатураПриИзменении(ОбЗаказ, НоваяСтрока);			
		НоваяСтрока.Количество   = Строка.Значение;
	КонецЦикла;
		
	ОбЗаказ.ОбменДанными.Загрузка = Истина;
	ОбЗаказ.Записать();
	
КонецПроцедуры

Функция ОбновитьЗаказПоставщику(СсылкаПодразделениеКомпании, ПараметрыОбмена, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	ТекстОшибки = "";
		
	ДанныеОбмена = ПараметрыОбмена.Получить().ДанныеОбмена;
	
	ТаблицаЗаказов = ПолучитьДанныеОбмена(ДанныеОбмена);
	
	Если ТаблицаЗаказов.Свойства().Получить("Заказы") = Неопределено Тогда
		ТекстОшибки =  "Не найден заказ";
		Возврат Ложь;
	КонецЕсли;
	
	СписокЗаказов = ПолучитьСписокИзXDTO(ТаблицаЗаказов.Заказы);
	
	Для Каждого ТекущийЗаказ Из СписокЗаказов Цикл
		
		СсылкаСериализованная = ТекущийЗаказ.Ссылка;
		
		Идентификатор = Новый УникальныйИдентификатор(СсылкаСериализованная);
		НоваяСсылка = Документы.ЗаказПоставщику.ПолучитьСсылку(Идентификатор);
		
		ДокументОбъект = Неопределено;
		Если ЗначениеЗаполнено(НоваяСсылка) Тогда
			ДокументОбъект = НоваяСсылка.ПолучитьОбъект();
		Иначе
			ТекстОшибки = ТекстОшибки + "
			|Не найден заказ <"+Идентификатор+">";
			Возврат Ложь;
		КонецЕсли;
		
		Если ДокументОбъект = Неопределено Тогда
			ТекстОшибки = ТекстОшибки + "
			|Не найден заказ <"+Идентификатор+">";
			Возврат Ложь;
		КонецЕсли;
		
		ОбновитьПланЗаказаТекОстатками(ПодразделениеКомпании, ДокументОбъект.ит_ВидЗаявки, ДокументОбъект); 

		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;

КонецФункции

//Мальцев А.Ю.---

Функция СогласоватьЗаказыПоставщикам(СсылкаПодразделениеКомпании, ШтрихКод, ПараметрыОбмена, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи).ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
			ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеОбмена = ПараметрыОбмена.Получить().ДанныеОбмена;
	
	ТаблицаЗаказов = ПолучитьДанныеОбмена(ДанныеОбмена);
	
	Если ТаблицаЗаказов.Свойства().Получить("Заказы") = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	СписокЗаказов = ПолучитьСписокИзXDTO(ТаблицаЗаказов.Заказы);
	
	Для Каждого ТекущийЗаказ Из СписокЗаказов Цикл
		
		СсылкаСериализованная = ТекущийЗаказ.Ссылка;
		
		Идентификатор = Новый УникальныйИдентификатор(СсылкаСериализованная);
		НоваяСсылка = Документы.ЗаказПоставщику.ПолучитьСсылку(Идентификатор);
		
		ДокументОбъект = Неопределено;
		Если ЗначениеЗаполнено(НоваяСсылка) Тогда
			ДокументОбъект = НоваяСсылка.ПолучитьОбъект();
		Иначе
			ТекстОшибки = ТекстОшибки + "
			|Не найден заказ <"+Идентификатор+">";
			Продолжить;
		КонецЕсли;
		
		Если ДокументОбъект = Неопределено Тогда
			ТекстОшибки = ТекстОшибки + "
			|Не найден заказ <"+Идентификатор+">";
			Продолжить;
		КонецЕсли;
		
		СписокТоваров = ПолучитьСписокИзXDTO(ТекущийЗаказ.Товары);
		Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
			Если Число(ТекущаяСтрока.Количество) = 0 Тогда Продолжить; КонецЕсли;
			
			Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Номенклатура.Ссылка);
			Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
			
			ТоварнаяСтрока = ДокументОбъект.Товары.Найти(Номенклатура, "Номенклатура");
			Если ТоварнаяСтрока = Неопределено Тогда
				ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
				ТоварнаяСтрока.Номенклатура = Номенклатура;
				Документы.ЗаказПоставщику.ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока);
				
				ТоварнаяСтрока.Количество   = Число(ТекущаяСтрока.Количество);
				Документы.ЗаказПоставщику.ТоварыКоличествоПриИзменении(ДокументОбъект, ТоварнаяСтрока);
			Иначе
				ТоварнаяСтрока.Номенклатура = Номенклатура;
				ТоварнаяСтрока.Количество   = Число(ТекущаяСтрока.Количество);
				Документы.ЗаказПоставщику.ТоварыКоличествоПриИзменении(ДокументОбъект, ТоварнаяСтрока);
			КонецЕсли;
			
		КонецЦикла;
				
		обрЗаказов = Обработки.ФормированиеЗаказовПоставщику.Создать();
		обрЗаказов.Дата = ДокументОбъект.Дата;	
		
		ВидЗаявкиВНоменклатуре = Неопределено;
		Если ДокументОбъект.Товары.Количество() > 0 Тогда
			 ВидЗаявкиВНоменклатуре = ДокументОбъект.Товары.Получить(0).Номенклатура.ит_ВидЗаявки;
		КонецЕсли;
		
		ДокументОбъект.СрокПоставки = обрЗаказов.ПолучитьБлижайшуюДатуОтгрузкиПоВидуЗаказа(ДокументОбъект.ПодразделениеКомпании, ДокументОбъект.Контрагент, ДокументОбъект.ит_ВидЗаявки, ДокументОбъект.ДоговорВзаиморасчетов,ВидЗаявкиВНоменклатуре);	
		
		//Контроль максимального количества
		ТоварыПревышеноМаксимальноеКоличествоДляЗаказа =  ИТ_СпециальныйМодульСервер.ВыполнитьКонтрольМаксимальногоКоличестваПоЗаказу(ПодразделениеКомпании, ДокументОбъект.Дата, ДокументОбъект.Ссылка, ДокументОбъект.Товары.Выгрузить());
		Если ТоварыПревышеноМаксимальноеКоличествоДляЗаказа.Количество() > 0 Тогда
			
			Для Каждого стр Из ТоварыПревышеноМаксимальноеКоличествоДляЗаказа Цикл
				 	ТекстОшибки = ТекстОшибки + "
							|Для номенклатуры: " + Строка(стр.Номенклатура) + " превышено максимальное количество для заказа";
			КонецЦикла;
			Продолжить;
			
		КонецЕсли;

		ДокументОбъект.ит_ИсточникЗаказа = Перечисления.ит_ИсточникиЗаказовПоставщику.ТСД;

		
		Попытка
			НаборЗаписей = РегистрыСведений.СостоянияВыполненияЗаказовПоставщикам.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Заказ.Установить(ДокументОбъект.Ссылка);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() = 0 Тогда
				Запись = НаборЗаписей.Добавить();
			Иначе
				Запись = НаборЗаписей[0];
			КонецЕсли;
			
			Запись.Заказ     = ДокументОбъект.Ссылка;
			Запись.Состояние = Перечисления.СостоянияВыполненияЗаказовПоставщикам.Согласован;
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			
			НаборЗаписей.Записать(ИСТИНА);
			
			Если НЕ ЗначениеЗаполнено(ДокументОбъект.СрокПоставки) Тогда
				ДокументОбъект.СрокПоставки = ДокументОбъект.Ссылка.СрокПоставки;
			КонецЕсли;
		
			Если ДокументОбъект.ит_ВидЗаявки <> Перечисления.рздВидыЗаказовЕРП.ЗаказВнешнийПоставщик Тогда			
				Если ДокументОбъект.Товары.Количество() > 0 Тогда
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);				
				КонецЕсли;
			Иначе
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
				
				РаспределитьПоПоставщикамНаСервере(ДокументОбъект.Ссылка);				
				
				ЗаписьДляОбработки = РегистрыСведений.итРезультатОбработкиЗаказВнешнийПоставщик.СоздатьМенеджерЗаписи();
				ЗаписьДляОбработки.ЗаказПоставщику = ДокументОбъект.Ссылка;
				ЗаписьДляОбработки.Обработан = Истина;
				ЗаписьДляОбработки.Записать();
				
			КонецЕсли;
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Документ <"+Строка(ДокументОбъект.Ссылка)+"> не проведен!
			|"+ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

Процедура РаспределитьПоПоставщикамНаСервере(ЗаказПоставщику)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	                      |	ЗаказПоставщикуТовары.Количество КАК Количество,
	                      |	ЗаказПоставщикуТовары.Номенклатура.ит_ОсновнойПоставщик КАК Поставщик
	                      |ПОМЕСТИТЬ втТоварыПоставщиков
	                      |ИЗ
	                      |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	                      |ГДЕ
	                      |	ЗаказПоставщикуТовары.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗаказПоставщикуТовары.Номенклатура,
	                      |	ЗаказПоставщикуТовары.Количество,
	                      |	ЗаказПоставщикуТовары.Номенклатура.ит_ОсновнойПоставщик
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЗаказПоставщику.Ссылка КАК Ссылка,
	                      |	ЗаказПоставщику.Контрагент КАК Поставщик,
	                      |	ЛОЖЬ КАК Обработан
	                      |ИЗ
	                      |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	                      |ГДЕ
	                      |	ЗаказПоставщику.ДокументОснование = &Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	втТоварыПоставщиков.Поставщик КАК Поставщик
	                      |ПОМЕСТИТЬ втПоставщики
	                      |ИЗ
	                      |	втТоварыПоставщиков КАК втТоварыПоставщиков
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	втТоварыПоставщиков.Поставщик");
	
	Запрос.УстановитьПараметр("Ссылка",ЗаказПоставщику);
	
	 Результат = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		
 
	тбТоварыПоставщиков = Результат[0].Выгрузить();
	тбЗаказы = Результат[1].Выгрузить();
	тбПоставщики = Результат[2].Выгрузить();
	
		обрЗаказов = Обработки.ФормированиеЗаказовПоставщику.Создать();
	
	Для каждого стртбПоставщики из тбПоставщики Цикл
		ТекПоставщик = стртбПоставщики.Поставщик;
		мтбЗаказы = тбЗаказы.НайтиСтроки(Новый Структура("Поставщик",ТекПоставщик));
		
		Если мтбЗаказы.Количество() = 0 Тогда 
			 ТекЗаказ = Документы.ЗаказПоставщику.СоздатьДокумент();
		Иначе
			 ТекЗаказ = мтбЗаказы.Получить(0).Ссылка.ПолучитьОбъект();
			 мтбЗаказы.Получить(0).Обработан = Истина;
		КонецЕсли;	
		 
		ЗаполнитьЗначенияСвойств(ТекЗаказ,ЗаказПоставщику,,"Номер");
		
		Если ТекЗаказ.Ссылка.Пустая() Тогда
			ТекЗаказ.УстановитьНовыйНомер();
		КонецЕсли;	
		
		ТекЗаказ.Контрагент = ТекПоставщик;
		Документы.ЗаказПоставщику.КонтрагентПриИзменении(ТекЗаказ);
		
		ТекЗаказ.ит_ИсточникЗаказа = Перечисления.ит_ИсточникиЗаказовПоставщику.ТСД;
		ТекЗаказ.Товары.Очистить();
		
		мтбТоварыПоставщиков = тбТоварыПоставщиков.НайтиСтроки(Новый Структура("Поставщик",ТекПоставщик));
		
		Для каждого стрмтбТоварыПоставщиков из мтбТоварыПоставщиков Цикл
			стрТовары = ТекЗаказ.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(стрТовары,стрмтбТоварыПоставщиков);
			Документы.ЗаказПоставщику.ТоварыНоменклатураПриИзменении(ТекЗаказ, стрТовары);
		КонецЦикла;	
		
		обрЗаказов.Дата = ТекущаяДата() + 24*3600;	
		
		ВидЗаявкиВНоменклатуре = Неопределено;
		//Если ТекЗаказ.Товары.Количество() > 0 Тогда
		//	 ВидЗаявкиВНоменклатуре = ТекЗаказ.Товары.Получить(0).Номенклатура.ит_ВидЗаявки;
		//КонецЕсли;
		
		ТекЗаказ.СрокПоставки = обрЗаказов.ПолучитьБлижайшуюДатуОтгрузкиПоВидуЗаказа(ТекЗаказ.ПодразделениеКомпании, ТекЗаказ.Контрагент, ТекЗаказ.ит_ВидЗаявки, ТекЗаказ.ДоговорВзаиморасчетов,ВидЗаявкиВНоменклатуре);	
		ТекЗаказ.ДокументОснование = ЗаказПоставщику;
		ТекЗаказ.ПометкаУдаления = Ложь;
		ТекЗаказ.Записать();
		ТекЗаказ.Записать(РежимЗаписиДокумента.Проведение);
		
		НаборЗаписей = РегистрыСведений.СостоянияВыполненияЗаказовПоставщикам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заказ.Установить(ТекЗаказ.Ссылка);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		
		Запись.Заказ     = ТекЗаказ.Ссылка;
		Запись.Состояние = Перечисления.СостоянияВыполненияЗаказовПоставщикам.Согласован;
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать(ИСТИНА);
		
	КонецЦикла;
	
	мтбЗаказы = тбЗаказы.НайтиСтроки(Новый Структура("Обработан",Ложь));
	
	Для каждого стрмтбЗаказы из мтбЗаказы Цикл 
		ТекЗаказ = стрмтбЗаказы.Ссылка.ПолучитьОбъект();
		Если ТекЗаказ.Проведен Тогда 
			ТекЗаказ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли; 
		
		ТекЗаказ.ПометкаУдаления = Истина;
		ТекЗаказ.Записать();		  
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьДопустимоеОтклонениеКоличестваВесовогоТовараПроцентов(Подразделение, ДатаСреза = Неопределено) Экспорт
	
	// Пробуем получить значение для подразделения, если нет - для организации,
	// если нет - для компании, если нет - по умолчанию.
	ЗначениеУчетнойПолитики = ПолучитьЗначениеУчетнойПолитики("ДопустимоеОтклонениеКоличестваВесовогоТовараПроцентов", Подразделение, ДатаСреза, Ложь);
	
	Если НЕ ЗначениеЗаполнено(ЗначениеУчетнойПолитики) Тогда
		ЗначениеУчетнойПолитики = ПолучитьЗначениеУчетнойПолитики("ДопустимоеОтклонениеКоличестваВесовогоТовараПроцентов",Неопределено, ДатаСреза);
	КонецЕсли;
	
	Возврат ЗначениеУчетнойПолитики;
	
КонецФункции //ПолучитьДопустимоеОтклонениеКоличестваВесовогоТовараПроцентов()

Функция ПолучитьДопустимоеОтклонениеКоличестваВесовогоТовараГрамм(Подразделение, ДатаСреза = Неопределено) Экспорт
	
	// Пробуем получить значение для подразделения, если нет - для организации,
	// если нет - для компании, если нет - по умолчанию.
	ЗначениеУчетнойПолитики = ПолучитьЗначениеУчетнойПолитики("ДопустимоеОтклонениеКоличестваВесовогоТовараГрамм", Подразделение, ДатаСреза, Ложь);
	
	Если НЕ ЗначениеЗаполнено(ЗначениеУчетнойПолитики) Тогда
		ЗначениеУчетнойПолитики = ПолучитьЗначениеУчетнойПолитики("ДопустимоеОтклонениеКоличестваВесовогоТовараГрамм",Неопределено, ДатаСреза);
	КонецЕсли;
	
	Возврат ЗначениеУчетнойПолитики;
	
КонецФункции //ПолучитьДопустимоеОтклонениеКоличестваВесовогоТовараГрамм()


Функция ПолучитьПредварительныеПоступленияСтараяВерсия(СсылкаПодразделениеКомпании, ТекстОшибки)
	
	ТекстОшибки = "";
	
	Попытка
		Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	Исключение
		ТекстОшибки = "Авторизация не выполнена";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецПопытки;
	
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостоянияДокументовТСД.Поступление КАК ПоступлениеТоваров
	               |ПОМЕСТИТЬ ТаблицаПоступлений
	               |ИЗ
	               |	РегистрСведений.итСостоянияВыполненияПоступленийТоваров КАК СостоянияДокументовТСД
	               |ГДЕ
	               |	СостоянияДокументовТСД.Состояние = ЗНАЧЕНИЕ(Перечисление.итСостоянияВыполненияПоступленийТоваров.КПриемке)
	               |	И СостоянияДокументовТСД.Поступление.ПометкаУдаления = ЛОЖЬ
	               |	И СостоянияДокументовТСД.Поступление.ПодразделениеКомпании = &ПодразделениеКомпании
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПоступлений.ПоступлениеТоваров КАК ПоступлениеТоваров,
	               |	ЕСТЬNULL(ПредварительныеПоступления.Ссылка, ЗНАЧЕНИЕ(Документ.ПредварительноеПоступлениеТоваров.ПустаяСсылка)) КАК ПредварительноеПоступление,
	               |	ЗаказыПоставщику.Ссылка КАК ЗаказПоставщику,
	               |	ЗаказыПоставщику.Контрагент КАК Контрагент
	               |ПОМЕСТИТЬ ТаблицаЗаказов
	               |ИЗ
	               |	ТаблицаПоступлений КАК ТаблицаПоступлений
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК ТабПоступлениеТоваров
	               |		ПО ТаблицаПоступлений.ПоступлениеТоваров = ТабПоступлениеТоваров.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПредварительноеПоступлениеТоваров КАК ПредварительныеПоступления
	               |		ПО (ТабПоступлениеТоваров.ДокументОснование = ПредварительныеПоступления.Ссылка)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказыПоставщику
	               |		ПО (ПредварительныеПоступления.ДокументОснование = ЗаказыПоставщику.Ссылка
	               |				ИЛИ ТабПоступлениеТоваров.ДокументОснование = ЗаказыПоставщику.Ссылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказыПоставщикам.Контрагент КАК Контрагент,
	               |	ЗаказыПоставщикам.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	ЗаказыПоставщикам.Номенклатура КАК Номенклатура,
	               |	ЗаказыПоставщикам.ЗаказаноОстаток КАК Заказано
	               |ПОМЕСТИТЬ ЗаказыПоставщикамОстатки
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	               |			,
	               |			ЗаказПоставщику В
	               |				(ВЫБРАТЬ
	               |					ТаблицаЗаказов.ЗаказПоставщику
	               |				ИЗ
	               |					ТаблицаЗаказов)) КАК ЗаказыПоставщикам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредварительныеПоступления.Контрагент КАК Контрагент,
	               |	ПредварительныеПоступления.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	ПредварительныеПоступления.Поступление КАК Поступление,
	               |	ПредварительныеПоступления.Номенклатура КАК Номенклатура,
	               |	СУММА(ПредварительныеПоступления.Заказано) КАК Заказано,
	               |	СУММА(ПредварительныеПоступления.ДолжноПоступить) КАК ДолжноПоступить,
	               |	СУММА(ПредварительныеПоступления.Поступило) КАК Поступило
	               |ПОМЕСТИТЬ ИтоговаяТаблица
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЗаказыПоставщикам.Контрагент КАК Контрагент,
	               |		ЗаказыПоставщикам.ЗаказПоставщику КАК ЗаказПоставщику,
	               |		МАКСИМУМ(ПредварительныеПоступления.ПоступлениеТоваров) КАК Поступление,
	               |		ЗаказыПоставщикам.Номенклатура КАК Номенклатура,
	               |		МАКСИМУМ(ЗаказыПоставщикам.Заказано) КАК Заказано,
	               |		0 КАК ДолжноПоступить,
	               |		0 КАК Поступило
	               |	ИЗ
	               |		ЗаказыПоставщикамОстатки КАК ЗаказыПоставщикам
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаЗаказов КАК ПредварительныеПоступления
	               |			ПО (ПредварительныеПоступления.ЗаказПоставщику = ЗаказыПоставщикам.ЗаказПоставщику)
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ЗаказыПоставщикам.Контрагент,
	               |		ЗаказыПоставщикам.ЗаказПоставщику,
	               |		ЗаказыПоставщикам.Номенклатура
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПредварительныеПоступления.Контрагент,
	               |		ПредварительныеПоступления.ЗаказПоставщику,
	               |		ПредварительныеПоступления.ПоступлениеТоваров,
	               |		ПредварительноеПоступлениеТоваров.Номенклатура,
	               |		0,
	               |		ЕСТЬNULL(ПредварительноеПоступлениеТоваров.Количество, 0) * ЕСТЬNULL(ПредварительноеПоступлениеТоваров.Коэффициент, 0),
	               |		ЕСТЬNULL(ПредварительноеПоступлениеТоваров.Количество, 0) * ЕСТЬNULL(ПредварительноеПоступлениеТоваров.Коэффициент, 0)
	               |	ИЗ
	               |		ТаблицаЗаказов КАК ПредварительныеПоступления
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПредварительноеПоступлениеТоваров.Товары КАК ПредварительноеПоступлениеТоваров
	               |			ПО ПредварительныеПоступления.ПредварительноеПоступление = ПредварительноеПоступлениеТоваров.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПредварительныеПоступления.Контрагент,
	               |		ПредварительныеПоступления.ЗаказПоставщику,
	               |		ПредварительныеПоступления.ПоступлениеТоваров,
	               |		ТабПоступлениеТоваров.Номенклатура,
	               |		0,
	               |		0,
	               |		0
	               |	ИЗ
	               |		ТаблицаЗаказов КАК ПредварительныеПоступления
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров.Товары КАК ТабПоступлениеТоваров
	               |			ПО ПредварительныеПоступления.ПоступлениеТоваров = ТабПоступлениеТоваров.Ссылка
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ПредварительныеПоступления.Контрагент,
	               |		ПредварительныеПоступления.ЗаказПоставщику,
	               |		ПредварительныеПоступления.ПоступлениеТоваров,
	               |		ТабПоступлениеТоваров.Номенклатура) КАК ПредварительныеПоступления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПредварительныеПоступления.Контрагент,
	               |	ПредварительныеПоступления.ЗаказПоставщику,
	               |	ПредварительныеПоступления.Поступление,
	               |	ПредварительныеПоступления.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредварительныеПоступления.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА НЕ ШтрихКоды.Короб
	               |			ТОГДА ЕСТЬNULL(ШтрихКоды.ЕдиницаИзмерения.Коэффициент, 1)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ШтрихКоды.Объект.КратностьПоставок > 0
	               |					ТОГДА ШтрихКоды.Объект.КратностьПоставок
	               |				ИНАЧЕ ЕСТЬNULL(ШтрихКоды.ЕдиницаИзмерения.Коэффициент, 1)
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Коэффициент,
	               |	ШтрихКоды.Штрихкод КАК Штрихкод
	               |ИЗ
	               |	ИтоговаяТаблица КАК ПредварительныеПоступления
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихКоды
	               |		ПО ПредварительныеПоступления.Номенклатура = ШтрихКоды.Объект
	               |			И (ШтрихКоды.Запрет = ЛОЖЬ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредварительныеПоступления.Контрагент КАК Контрагент,
	               |	ПредварительныеПоступления.Контрагент.Код КАК КонтрагентКод,
	               |	ПредварительныеПоступления.Контрагент.Наименование КАК КонтрагентНаименование,
	               |	ПредварительныеПоступления.Контрагент.ИНН КАК КонтрагентИНН,
	               |	ПредварительныеПоступления.Контрагент.КПП КАК КонтрагентКПП,
	               |	ВЫРАЗИТЬ(ПредварительныеПоступления.Контрагент.НаименованиеПолное КАК СТРОКА(500)) КАК КонтрагентНаименованиеПолное,
	               |	ПредварительныеПоступления.Контрагент.GLN КАК КонтрагентGLN,
	               |	ПредварительныеПоступления.Контрагент.Родитель КАК КонтрагентРодитель,
	               |	ПредварительныеПоступления.Контрагент.Родитель.Код КАК КонтрагентРодительКод,
	               |	ПредварительныеПоступления.Контрагент.Родитель.Наименование КАК КонтрагентРодительНаименование,
	               |	ПредварительныеПоступления.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	ПредварительныеПоступления.ЗаказПоставщику.Номер КАК ЗаказПоставщикуНомер,
	               |	ПредварительныеПоступления.ЗаказПоставщику.Дата КАК ЗаказПоставщикуДата,
	               |	ПредварительныеПоступления.Поступление КАК Поступление,
	               |	ПредварительныеПоступления.Поступление.ВхДокНомер КАК ПоступлениеНомер,
	               |	ПредварительныеПоступления.Поступление.ВхДокДата КАК ПоступлениеДата,
	               |	ЕСТЬNULL(итОграниченияПриемкиНаТСД.БезОграничений, ЛОЖЬ) КАК ОгрТСДБезОграничений,
	               |	ЕСТЬNULL(итОграниченияПриемкиНаТСД.ПревышениеЗаказанногоПроцент, 0) КАК ОгрТСДПревышениеЗаказанногоПроцент
	               |ИЗ
	               |	ИтоговаяТаблица КАК ПредварительныеПоступления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.итОграниченияПриемкиНаТСД КАК итОграниченияПриемкиНаТСД
	               |		ПО ПредварительныеПоступления.Контрагент = итОграниченияПриемкиНаТСД.Конгтрагент
	               |			И (итОграниченияПриемкиНаТСД.Подразеделение = &ПодразделениеКомпании)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПредварительныеПоступления.Контрагент,
	               |	ПредварительныеПоступления.ЗаказПоставщику,
	               |	ПредварительныеПоступления.Поступление,
	               |	ПредварительныеПоступления.Контрагент.Код,
	               |	ПредварительныеПоступления.Контрагент.Наименование,
	               |	ПредварительныеПоступления.Контрагент.ИНН,
	               |	ПредварительныеПоступления.Контрагент.КПП,
	               |	ПредварительныеПоступления.Контрагент.GLN,
	               |	ПредварительныеПоступления.Контрагент.Родитель,
	               |	ПредварительныеПоступления.Контрагент.Родитель.Код,
	               |	ПредварительныеПоступления.Контрагент.Родитель.Наименование,
	               |	ПредварительныеПоступления.ЗаказПоставщику.Номер,
	               |	ПредварительныеПоступления.ЗаказПоставщику.Дата,
	               |	ПредварительныеПоступления.Поступление.ВхДокНомер,
	               |	ПредварительныеПоступления.Поступление.ВхДокДата,
	               |	ВЫРАЗИТЬ(ПредварительныеПоступления.Контрагент.НаименованиеПолное КАК СТРОКА(500)),
	               |	ЕСТЬNULL(итОграниченияПриемкиНаТСД.БезОграничений, ЛОЖЬ),
	               |	ЕСТЬNULL(итОграниченияПриемкиНаТСД.ПревышениеЗаказанногоПроцент, 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредварительныеПоступления.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	ПредварительныеПоступления.Поступление КАК Поступление,
	               |	ПредварительныеПоступления.Поступление.ВхДокНомер КАК ПоступлениеНомер,
	               |	ПредварительныеПоступления.Поступление.ВхДокДата КАК ПоступлениеДата,
	               |	ПредварительныеПоступления.Номенклатура КАК Номенклатура,
	               |	ПредварительныеПоступления.Номенклатура.Код КАК НоменклатураКод,
	               |	ПредварительныеПоступления.Номенклатура.ТипНоменклатуры.Весовой КАК Весовой,
	               |	ПредварительныеПоступления.Номенклатура.КратностьПоставок КАК КратностьПоставок,
	               |	ПредварительныеПоступления.Номенклатура.Наименование КАК НоменклатураНаименование,
	               |	ПредварительныеПоступления.Номенклатура.Артикул КАК НоменклатураАртикул,
	               |	ПредварительныеПоступления.Номенклатура.ИерархияАльтернативная КАК Родитель,
	               |	ПредварительныеПоступления.Номенклатура.ИерархияАльтернативная.Код КАК РодительКод,
	               |	ПредварительныеПоступления.Номенклатура.ИерархияАльтернативная.Наименование КАК РодительНаименование,
	               |	ПредварительныеПоступления.Заказано КАК Заказано,
	               |	ВЫБОР
	               |		КОГДА ПредварительныеПоступления.ДолжноПоступить = 0
	               |			ТОГДА ПредварительныеПоступления.Заказано
	               |		ИНАЧЕ ПредварительныеПоступления.ДолжноПоступить
	               |	КОНЕЦ КАК ДолжноПоступить,
	               |	ПредварительныеПоступления.Поступило КАК Поступило
	               |ИЗ
	               |	ИтоговаяТаблица КАК ПредварительныеПоступления";
	//|ВЫБРАТЬ
	//|	ВЫРАЗИТЬ(СостоянияДокументовЭДО.СсылкаНаОбъект КАК Документ.ЗаказПоставщику) КАК ЗаказПоставщику
	//|ПОМЕСТИТЬ
	//|	ТаблицаЗаказов
	//|ИЗ
	//|	РегистрСведений.итСостоянияДокументовЭДО_LeraData КАК СостоянияДокументовЭДО
	//|ГДЕ
	//|	СостоянияДокументовЭДО.Состояния = ЗНАЧЕНИЕ(Перечисление.итСостоянияЭДО.ПолученоУведомлениеОбОтгрузкеОтПоставщика) И 
	//|	СостоянияДокументовЭДО.СсылкаНаОбъект ССЫЛКА Документ.ЗаказПоставщику
	//|;
	//|
	//|ВЫБРАТЬ
	//|	ЗаказыПоставщикам.Контрагент,
	//|	ЗаказыПоставщикам.ЗаказПоставщику
	//|ПОМЕСТИТЬ
	//|	ЗаказыПоставщикам
	//|ИЗ
	//|	РегистрНакопления.ЗаказыПоставщикам.Остатки(,ЗаказПоставщику В (ВЫБРАТЬ ЗаказПоставщику ИЗ ТаблицаЗаказов)) КАК ЗаказыПоставщикам
	//|ГДЕ
	//|	ЗаказыПоставщикам.ЗаказаноОстаток>0 И 
	//|	ЗаказыПоставщикам.ЗаказПоставщику.ПодразделениеКомпании=&ПодразделениеКомпании
	//|;
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ЗаказыПоставщикам.Контрагент,
	//|	ЗаказыПоставщикам.ЗаказПоставщику,
	//|	ПредварительноеПоступлениеТоваров.Ссылка КАК Поступление
	//|ПОМЕСТИТЬ
	//|	ПредварительныеПоступления
	//|ИЗ
	//|	ЗаказыПоставщикам КАК ЗаказыПоставщикам
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	//|	Документ.ПредварительноеПоступлениеТоваров.Заказы КАК ПредварительноеПоступлениеТоваров
	//|ПО
	//|	ЗаказыПоставщикам.ЗаказПоставщику = ПредварительноеПоступлениеТоваров.ЗаказПоставщику
	//|
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ
	//|	ЗаказыПоставщикам.Контрагент,
	//|	ЗаказыПоставщикам.ЗаказПоставщику,
	//|	ПредварительноеПоступлениеТоваров.Ссылка КАК Поступление
	//|ИЗ
	//|	ЗаказыПоставщикам КАК ЗаказыПоставщикам
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	//|	Документ.ПредварительноеПоступлениеТоваров КАК ПредварительноеПоступлениеТоваров
	//|ПО
	//|	ЗаказыПоставщикам.ЗаказПоставщику = ПредварительноеПоступлениеТоваров.ДокументОснование
	//|;
	//|
	//|ВЫБРАТЬ
	//|	ЗаказыПоставщикам.Контрагент КАК Контрагент,
	//|	ЗаказыПоставщикам.ЗаказПоставщику КАК ЗаказПоставщику,
	//|	ЗаказыПоставщикам.Номенклатура КАК Номенклатура,
	//|	ЗаказыПоставщикам.ЗаказаноОстаток КАК Заказано
	//|ПОМЕСТИТЬ
	//|	ЗаказыПоставщикамОстатки
	//|ИЗ
	//|	РегистрНакопления.ЗаказыПоставщикам.Остатки(, ЗаказПоставщику В (ВЫБРАТЬ ЗаказПоставщику ИЗ ПредварительныеПоступления)) КАК ЗаказыПоставщикам
	//|;
	//|
	//|ВЫБРАТЬ
	//|	ПредварительныеПоступления.Контрагент КАК Контрагент,
	//|	ПредварительныеПоступления.ЗаказПоставщику КАК ЗаказПоставщику,
	//|	ПредварительныеПоступления.Поступление КАК Поступление,
	//|	ПредварительныеПоступления.Номенклатура КАК Номенклатура,
	//|	СУММА(ПредварительныеПоступления.Заказано) КАК Заказано,
	//|	СУММА(ПредварительныеПоступления.ДолжноПоступить) КАК ДолжноПоступить,
	//|	СУММА(ПредварительныеПоступления.Поступило) КАК Поступило,
	//|	МАКСИМУМ(ПредварительныеПоступления.Состояние) КАК Состояние
	//|ПОМЕСТИТЬ
	//|	ИтоговаяТаблица
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ЗаказыПоставщикам.Контрагент КАК Контрагент,
	//|		ЗаказыПоставщикам.ЗаказПоставщику КАК ЗаказПоставщику,
	//|		МАКСИМУМ(ПредварительныеПоступления.Поступление) КАК Поступление,
	//|		ЗаказыПоставщикам.Номенклатура КАК Номенклатура,
	//|		МАКСИМУМ(ЗаказыПоставщикам.Заказано) КАК Заказано,
	//|		0 КАК ДолжноПоступить,
	//|		0 КАК Поступило,
	//|		NULL КАК Состояние
	//|	ИЗ
	//|		ЗаказыПоставщикамОстатки КАК ЗаказыПоставщикам
	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	//|		ПредварительныеПоступления КАК ПредварительныеПоступления
	//|	ПО
	//|		ПредварительныеПоступления.ЗаказПоставщику = ЗаказыПоставщикам.ЗаказПоставщику
	//|	СГРУППИРОВАТЬ ПО
	//|		ЗаказыПоставщикам.Контрагент,
	//|		ЗаказыПоставщикам.ЗаказПоставщику,
	//|		ЗаказыПоставщикам.Номенклатура
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ПредварительныеПоступления.Контрагент,
	//|		ПредварительныеПоступления.ЗаказПоставщику,
	//|		ПредварительныеПоступления.Поступление,
	//|		ПредварительноеПоступлениеТоваров.Номенклатура,
	//|		0,
	//|		ПредварительноеПоступлениеТоваров.Количество*ПредварительноеПоступлениеТоваров.Коэффициент,
	//|		ПредварительноеПоступлениеТоваров.Количество*ПредварительноеПоступлениеТоваров.Коэффициент,
	//|		NULL
	//|	ИЗ
	//|		ПредварительныеПоступления КАК ПредварительныеПоступления
	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	//|		Документ.ПредварительноеПоступлениеТоваров.Товары КАК ПредварительноеПоступлениеТоваров
	//|	ПО
	//|		ПредварительныеПоступления.Поступление = ПредварительноеПоступлениеТоваров.Ссылка
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ПредварительныеПоступления.Контрагент,
	//|		ПредварительныеПоступления.ЗаказПоставщику,
	//|		ПредварительныеПоступления.Поступление,
	//|		ПоступлениеТоваров.Номенклатура,
	//|		0,
	//|		0,
	//|		0,
	////|		СУММА(ПоступлениеТоваров.Количество*ПоступлениеТоваров.Коэффициент),
	//|		МАКСИМУМ(ЕСТЬNULL(СостоянияДокументовЭДО.Состояния, ЗНАЧЕНИЕ(Перечисление.итСостоянияЭДО.ПустаяСсылка)))
	//|	ИЗ
	//|		ПредварительныеПоступления КАК ПредварительныеПоступления
	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	//|		Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваров
	//|	ПО
	//|		ПредварительныеПоступления.Поступление = ПоступлениеТоваров.Ссылка.ДокументОснование
	//|	ЛЕВОЕ СОЕДИНЕНИЕ
	//|		РегистрСведений.итСостоянияДокументовЭДО_LeraData КАК СостоянияДокументовЭДО
	//|	ПО
	//|		ПоступлениеТоваров.Ссылка = СостоянияДокументовЭДО.СсылкаНаОбъект
	//|	СГРУППИРОВАТЬ ПО
	//|		ПредварительныеПоступления.Контрагент,
	//|		ПредварительныеПоступления.ЗаказПоставщику,
	//|		ПредварительныеПоступления.Поступление,
	//|		ПоступлениеТоваров.Номенклатура) КАК ПредварительныеПоступления
	//|СГРУППИРОВАТЬ ПО
	//|	ПредварительныеПоступления.Контрагент,
	//|	ПредварительныеПоступления.ЗаказПоставщику,
	//|	ПредварительныеПоступления.Поступление,
	//|	ПредварительныеПоступления.Номенклатура
	//|ИМЕЮЩИЕ
	//|	МАКСИМУМ(ПредварительныеПоступления.Состояние) = ЗНАЧЕНИЕ(Перечисление.итСостоянияЭДО.ОжидаетПоступленияОтПоставщика) ИЛИ 
	//|	МАКСИМУМ(ПредварительныеПоступления.Состояние) = ЗНАЧЕНИЕ(Перечисление.итСостоянияЭДО.ПустаяСсылка)
	//|;
	//|
	//|ВЫБРАТЬ
	//|	ПредварительныеПоступления.Номенклатура КАК Номенклатура,
	//|	ЕСТЬNULL(ШтрихКоды.ЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
	//|	ШтрихКоды.Штрихкод КАК Штрихкод
	//|ИЗ
	//|	ИтоговаяТаблица КАК ПредварительныеПоступления
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	//|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
	//|ПО
	//|	ПредварительныеПоступления.Номенклатура = ШтрихКоды.Объект И 
	//|	ШтрихКоды.Запрет = ЛОЖЬ
	//|;
	//|
	//|ВЫБРАТЬ
	//|	ПредварительныеПоступления.Контрагент КАК Контрагент,
	//|	ПредварительныеПоступления.Контрагент.Код КАК КонтрагентКод,
	//|	ПредварительныеПоступления.Контрагент.Наименование КАК КонтрагентНаименование,
	//|	ПредварительныеПоступления.Контрагент.ИНН КАК КонтрагентИНН,
	//|	ПредварительныеПоступления.Контрагент.КПП КАК КонтрагентКПП,
	//|	ВЫРАЗИТЬ(ПредварительныеПоступления.Контрагент.НаименованиеПолное КАК Строка(500)) КАК КонтрагентНаименованиеПолное,
	//|	ПредварительныеПоступления.Контрагент.GLN КАК КонтрагентGLN,
	//|	ПредварительныеПоступления.Контрагент.Родитель КАК КонтрагентРодитель,
	//|	ПредварительныеПоступления.Контрагент.Родитель.Код КАК КонтрагентРодительКод,
	//|	ПредварительныеПоступления.Контрагент.Родитель.Наименование КАК КонтрагентРодительНаименование,
	//|	ПредварительныеПоступления.ЗаказПоставщику КАК ЗаказПоставщику,
	//|	ПредварительныеПоступления.ЗаказПоставщику.Номер КАК ЗаказПоставщикуНомер,
	//|	ПредварительныеПоступления.ЗаказПоставщику.Дата КАК ЗаказПоставщикуДата,
	//|	ПредварительныеПоступления.Поступление КАК Поступление,
	//|	ПредварительныеПоступления.Поступление.Номер КАК ПоступлениеНомер,
	//|	ПредварительныеПоступления.Поступление.Дата КАК ПоступлениеДата
	//|ИЗ
	//|	ИтоговаяТаблица КАК ПредварительныеПоступления
	//|СГРУППИРОВАТЬ ПО
	//|	ПредварительныеПоступления.Контрагент,
	//|	ПредварительныеПоступления.ЗаказПоставщику,
	//|	ПредварительныеПоступления.Поступление
	//|;
	//|
	//|ВЫБРАТЬ
	//|	ПредварительныеПоступления.ЗаказПоставщику КАК ЗаказПоставщику,
	////|	ПредварительныеПоступления.ЗаказПоставщику.Номер КАК ЗаказПоставщикуНомер,
	////|	ПредварительныеПоступления.ЗаказПоставщику.Дата КАК ЗаказПоставщикуДата,
	//|	ПредварительныеПоступления.Поступление КАК Поступление,
	//|	ПредварительныеПоступления.Поступление.Номер КАК ПоступлениеНомер,
	//|	ПредварительныеПоступления.Поступление.Дата КАК ПоступлениеДата,
	//|	ПредварительныеПоступления.Номенклатура КАК Номенклатура,
	//|	ПредварительныеПоступления.Номенклатура.Код КАК НоменклатураКод,
	//|	ПредварительныеПоступления.Номенклатура.Наименование КАК НоменклатураНаименование,
	//|	ПредварительныеПоступления.Номенклатура.Артикул КАК НоменклатураАртикул,
	//|	ПредварительныеПоступления.Номенклатура.ИерархияАльтернативная КАК Родитель,
	//|	ПредварительныеПоступления.Номенклатура.ИерархияАльтернативная.Код КАК РодительКод,
	//|	ПредварительныеПоступления.Номенклатура.ИерархияАльтернативная.Наименование КАК РодительНаименование,
	//|	ПредварительныеПоступления.Заказано КАК Заказано,
	//|	ПредварительныеПоступления.ДолжноПоступить КАК ДолжноПоступить,
	//|	ПредварительныеПоступления.Поступило КАК Поступило
	//|ИЗ
	//|	ИтоговаяТаблица КАК ПредварительныеПоступления
	//|";
	
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	
	ВыборкаШтрихкоды = ПакетыЗапросов[ПакетыЗапросов.Количество()-3].Выбрать();
	РезультатШапка   = ПакетыЗапросов[ПакетыЗапросов.Количество()-2];
	РезультатТовары  = ПакетыЗапросов[ПакетыЗапросов.Количество()-1];
	
	Если РезультатШапка.Пустой() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	//ЗаписатьОбъектXML(ЗаписьXML, Данные);
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
	ВыборкаЗаказ = РезультатШапка.Выбрать();
	Пока ВыборкаЗаказ.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Заказы"); // Заказы
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЗаказПоставщику"); // Заказ
		ЗаписьXML.ЗаписатьАтрибут("Тип",    "ЗаказПоставщику");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаЗаказ.ЗаказПоставщику));
		ЗаписьXML.ЗаписатьАтрибут("Номер",  ВыборкаЗаказ.ЗаказПоставщикуНомер);
		ЗаписьXML.ЗаписатьАтрибут("Дата",   Строка(ВыборкаЗаказ.ЗаказПоставщикуДата));
		//ЗаписьXML.ЗаписатьАтрибут("Представление", "Заказ № " + ВыборкаЗаказ.ЗаказПоставщикуНомер + " от " + Формат(ВыборкаЗаказ.ЗаказПоставщикуДата, "ДФ=dd.MM.yyyy"));
		ЗаписьXML.ЗаписатьАтрибут("Представление", "З. № " + ВыборкаЗаказ.ЗаказПоставщикуНомер + " от " + Формат(ВыборкаЗаказ.ЗаказПоставщикуДата, "ДФ=dd.MM.yyyy"));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ЗаказПоставщику
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПоступлениеТоваров"); // ПоступлениеТоваров
		ЗаписьXML.ЗаписатьАтрибут("Тип",    "ПоступлениеТоваров");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаЗаказ.Поступление));
		ЗаписьXML.ЗаписатьАтрибут("Номер",  ВыборкаЗаказ.ПоступлениеНомер);
		ЗаписьXML.ЗаписатьАтрибут("Дата",   Строка(ВыборкаЗаказ.ПоступлениеДата));
		ЗаписьXML.ЗаписатьАтрибут("Представление", "П. № " + ВыборкаЗаказ.ПоступлениеНомер + " от " + Формат(ВыборкаЗаказ.ПоступлениеДата, "ДФ=dd.MM.yyyy"));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ПоступлениеТоваров
		
		ОтклонениеГраммКомпания = ПолучитьДопустимоеОтклонениеКоличестваВесовогоТовараГрамм(ПодразделениеКомпании, ТекущаяДата());
		Если ТипЗнч(ОтклонениеГраммКомпания)<>Тип("Число") Тогда
			ОтклонениеГраммКомпания = 0;
		Иначе
			ОтклонениеГраммКомпания = ОтклонениеГраммКомпания / 1000;
		КонецЕсли;			
			
		ОтклонениеПроцентКомпания = ПолучитьДопустимоеОтклонениеКоличестваВесовогоТовараПроцентов(ПодразделениеКомпании, ТекущаяДата());
		Если ТипЗнч(ОтклонениеПроцентКомпания)<>Тип("Число") Тогда
			ОтклонениеПроцентКомпания = 0;
		Иначе
			ОтклонениеПроцентКомпания = ОтклонениеПроцентКомпания / 100;
		КонецЕсли;
		
		Если ВыборкаЗаказ.Контрагент.ПревышениеЗаказанногоНаПриемкеПроцент > 0 Тогда
			ОтклонениеПроцентКомпания = ВыборкаЗаказ.Контрагент.ПревышениеЗаказанногоНаПриемкеПроцент / 100;
		КонецЕсли;	
		
		//Мальцев А.Ю. 22.07.21+++  Если для контрагента не должно действовать ограничение, тогда передаем 200
		Если ВыборкаЗаказ.ОгрТСДБезОграничений Тогда
			ОтклонениеПроцентКомпания = 200;
		КонецЕсли;			
		//Мальцев А.Ю. 22.07.21---
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопустимоеОтклонение"); // ДопустимоеОтклонение
		ЗаписьXML.ЗаписатьАтрибут("ОтклонениеГрамм",   XMLСтрока(ОтклонениеГраммКомпания));
		ЗаписьXML.ЗаписатьАтрибут("ОтклонениеПроцент", XMLСтрока(ОтклонениеПроцентКомпания));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ДопустимоеОтклонение
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Контрагент"); // Контрагент
		ЗаписьXML.ЗаписатьАтрибут("Тип", "Контрагенты");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаЗаказ.Контрагент));
		ЗаписьXML.ЗаписатьАтрибут("Код", ВыборкаЗаказ.КонтрагентКод);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", ВыборкаЗаказ.КонтрагентНаименование);
		ЗаписьXML.ЗаписатьАтрибут("ИНН", ВыборкаЗаказ.КонтрагентИНН);
		ЗаписьXML.ЗаписатьАтрибут("КПП", ВыборкаЗаказ.КонтрагентКПП);
		ЗаписьXML.ЗаписатьАтрибут("НаименованиеПолное", ВыборкаЗаказ.КонтрагентНаименованиеПолное);
		ЗаписьXML.ЗаписатьАтрибут("GLN", ВыборкаЗаказ.КонтрагентGLN);
		ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Ложь");
		Если ЗначениеЗаполнено(ВыборкаЗаказ.КонтрагентРодитель) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель"); // Родитель
			ЗаписьXML.ЗаписатьАтрибут("Тип", "Контрагенты");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(ВыборкаЗаказ.КонтрагентРодитель));
			ЗаписьXML.ЗаписатьАтрибут("Код",          ВыборкаЗаказ.КонтрагентРодительКод);
			ЗаписьXML.ЗаписатьАтрибут("Наименование", ВыборкаЗаказ.КонтрагентРодительНаименование);
			ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Истина");
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
		Иначе
			ЗаписьXML.ЗаписатьАтрибут("Родитель", "");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Контрагент
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Заказы
		
	КонецЦикла;
	
	Выборка = РезультатТовары.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Товары"); // Товары
		
		ЗаписьXML.ЗаписатьАтрибут("Заказано", Формат(Выборка.Заказано, "ЧРД=.; ЧН=0; ЧГ="));
		ЗаписьXML.ЗаписатьАтрибут("ДолжноПоступить", Формат(Выборка.ДолжноПоступить, "ЧРД=.; ЧН=0; ЧГ="));
		ЗаписьXML.ЗаписатьАтрибут("Поступило", Формат(Выборка.Поступило, "ЧРД=.; ЧН=0; ЧГ="));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЗаказПоставщику"); // Заказ
		ЗаписьXML.ЗаписатьАтрибут("Тип",    "ЗаказПоставщику");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.ЗаказПоставщику));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ЗаказПоставщику
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПоступлениеТоваров"); // ПоступлениеТоваров
		ЗаписьXML.ЗаписатьАтрибут("Тип",    "ПоступлениеТоваров");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Поступление));
		ЗаписьXML.ЗаписатьАтрибут("Представление", "Поступление № " + Выборка.ПоступлениеНомер + " от " + Формат(Выборка.ПоступлениеДата, "ДФ=dd.MM.yyyy"));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ПоступлениеТоваров
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
		ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Номенклатура));
		ЗаписьXML.ЗаписатьАтрибут("Код", Выборка.НоменклатураКод);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.НоменклатураНаименование);
		ЗаписьXML.ЗаписатьАтрибут("Артикул", Выборка.НоменклатураАртикул);
		ЗаписьXML.ЗаписатьАтрибут("КратностьПоставок", Формат(Выборка.КратностьПоставок, "ЧРД=.; ЧН=0; ЧГ="));
		ЗаписьXML.ЗаписатьАтрибут("Весовой", ?(Выборка.Весовой,"Истина","Ложь"));
		ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Ложь");
		Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель"); // Родитель
			ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Родитель));
			ЗаписьXML.ЗаписатьАтрибут("Код", Выборка.РодительКод);
			ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.РодительНаименование);
			ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Истина");
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
		Иначе
			ЗаписьXML.ЗаписатьАтрибут("Родитель", "");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
		
		//ЗаписьXML.ЗаписатьАтрибут("Заказано", Формат(Выборка.Заказано, "ЧРД=.; ЧН=0; ЧГ="));
		//ЗаписьXML.ЗаписатьАтрибут("ДолжноПоступить", Формат(Выборка.ДолжноПоступить, "ЧРД=.; ЧН=0; ЧГ="));
		//ЗаписьXML.ЗаписатьАтрибут("Поступило", Формат(Выборка.Поступило, "ЧРД=.; ЧН=0; ЧГ="));
		//ЗаписьXML.ЗаписатьАтрибут("Штрихкод", Выборка.Штрихкод);
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
	КонецЦикла;
	
	Пока ВыборкаШтрихкоды.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ШтрихКоды"); // ТоварнаяСтрока
		
		ЗаписьXML.ЗаписатьАтрибут("Штрихкод", ВыборкаШтрихкоды.Штрихкод);
		ЗаписьXML.ЗаписатьАтрибут("Коэффициент", Формат(ВыборкаШтрихкоды.Коэффициент, "ЧРД=.; ЧН=0; ЧГ="));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
		ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаШтрихкоды.Номенклатура));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
	
	ЗаписьXML.Закрыть();
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПредварительныеПоступления(СсылкаПодразделениеКомпании, ТекстОшибки)
	
	ТекстОшибки = "";
	
	Попытка
		Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	Исключение
		ТекстОшибки = "Авторизация не выполнена";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецПопытки;
	
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	массМаркируемыеПозиции = Новый Массив;
	массМаркируемыеПозиции.Добавить(Справочники.ОсобенностиУчетаНоменклатуры.ТабакМаркированный);
	массМаркируемыеПозиции.Добавить(Справочники.ОсобенностиУчетаНоменклатуры.ТабакНеМаркированный);		
	массМаркируемыеПозиции.Добавить(Справочники.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияВГотовомВидеМаркированная);		
	массМаркируемыеПозиции.Добавить(Справочники.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияДляПродажиВНарезкуМаркированная);		
	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("АлкогольМаркируемый",   Справочники.ОсобенностиУчетаНоменклатуры.АлкогольМаркированный);	
	Запрос.УстановитьПараметр("МаркируемыеПозиции",    массМаркируемыеПозиции);	
	Запрос.УстановитьПараметр("ДатаНачала",    ТекущаяДата() - 7*3600*24);	

	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостоянияДокументовТСД.Поступление КАК ПоступлениеТоваров
	               |ПОМЕСТИТЬ ТаблицаПоступлений
	               |ИЗ
	               |	РегистрСведений.итСостоянияВыполненияПоступленийТоваров КАК СостоянияДокументовТСД
	               |ГДЕ
	               |	СостоянияДокументовТСД.Состояние = ЗНАЧЕНИЕ(Перечисление.итСостоянияВыполненияПоступленийТоваров.КПриемке)
	               |	И СостоянияДокументовТСД.Поступление.ПометкаУдаления = ЛОЖЬ
	               |	И СостоянияДокументовТСД.Поступление.ПодразделениеКомпании = &ПодразделениеКомпании
	               |	И СостоянияДокументовТСД.Поступление.Дата >= &ДатаНачала
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПоступлений.ПоступлениеТоваров КАК ПоступлениеТоваров,
	               |	ЕСТЬNULL(ПредварительныеПоступления.Ссылка, ЗНАЧЕНИЕ(Документ.ПредварительноеПоступлениеТоваров.ПустаяСсылка)) КАК ПредварительноеПоступление,
	               |	ЗаказыПоставщику.Ссылка КАК ЗаказПоставщику,
	               |	ЗаказыПоставщику.Контрагент КАК Контрагент,
	               |	ПоступлениеТоваровТовары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ТаблицаЗаказов
	               |ИЗ
	               |	ТаблицаПоступлений КАК ТаблицаПоступлений
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК ТабПоступлениеТоваров
	               |		ПО ТаблицаПоступлений.ПоступлениеТоваров = ТабПоступлениеТоваров.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПредварительноеПоступлениеТоваров КАК ПредварительныеПоступления
	               |		ПО (ТабПоступлениеТоваров.ДокументОснование = ПредварительныеПоступления.Ссылка)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказыПоставщику
	               |		ПО (ПредварительныеПоступления.ДокументОснование = ЗаказыПоставщику.Ссылка
	               |				ИЛИ ТабПоступлениеТоваров.ДокументОснование = ЗаказыПоставщику.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	               |		ПО ТаблицаПоступлений.ПоступлениеТоваров.Ссылка = ПоступлениеТоваровТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЗаказов.ПоступлениеТоваров КАК ПоступлениеТоваров,
	               |	ТаблицаЗаказов.ПредварительноеПоступление КАК ПредварительноеПоступление,
	               |	ТаблицаЗаказов.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	ТаблицаЗаказов.Контрагент КАК Контрагент
	               |ПОМЕСТИТЬ втЗаказыБезНоменклатуры
	               |ИЗ
	               |	ТаблицаЗаказов КАК ТаблицаЗаказов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаЗаказов.Контрагент,
	               |	ТаблицаЗаказов.ПоступлениеТоваров,
	               |	ТаблицаЗаказов.ПредварительноеПоступление,
	               |	ТаблицаЗаказов.ЗаказПоставщику
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказыПоставщикам.Контрагент КАК Контрагент,
	               |	ЗаказыПоставщикам.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	ЗаказыПоставщикам.Номенклатура КАК Номенклатура,
	               |	ЗаказыПоставщикам.ЗаказаноОстаток КАК ЗаказаноОстаток
	               |ПОМЕСТИТЬ ЗаказыПоставщикамОстатки
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	               |			,
	               |			ЗаказПоставщику В
	               |				(ВЫБРАТЬ
	               |					ТаблицаЗаказов.ЗаказПоставщику
	               |				ИЗ
	               |					втЗаказыБезНоменклатуры КАК ТаблицаЗаказов)) КАК ЗаказыПоставщикам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказыПоставщикам.Контрагент КАК Контрагент,
	               |	ЗаказыПоставщикам.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	ЗаказыПоставщикам.Номенклатура КАК Номенклатура,
	               |	ЗаказыПоставщикам.Заказано КАК Заказано
	               |ПОМЕСТИТЬ ЗаказыПоставщикамДанные1
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПоставщикам КАК ЗаказыПоставщикам
	               |ГДЕ
	               |	ЗаказыПоставщикам.ЗаказПоставщику В
	               |			(ВЫБРАТЬ
	               |				ТаблицаЗаказов.ЗаказПоставщику
	               |			ИЗ
	               |				втЗаказыБезНоменклатуры КАК ТаблицаЗаказов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГруппыАналогов.ИдентификаторГруппы КАК ИдентификаторГруппы,
	               |	ГруппыАналогов.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ втИдентификаторыАналогов
	               |ИЗ
	               |	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	               |ГДЕ
	               |	ГруппыАналогов.Номенклатура В
	               |			(ВЫБРАТЬ
	               |				ЗаказыПоставщикамДанные1.Номенклатура КАК Номенклатура
	               |			ИЗ
	               |				ЗаказыПоставщикамДанные1)
	               |	И ГруппыАналогов.Приоритет = 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказыПоставщикамДанные1.Контрагент КАК Контрагент,
	               |	ЗаказыПоставщикамДанные1.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	ВЫБОР
	               |		КОГДА ЗаказыПоставщикамДанные1.Номенклатура <> ГруппыАналогов.Номенклатура
	               |			ТОГДА ГруппыАналогов.Номенклатура
	               |		ИНАЧЕ ЗаказыПоставщикамДанные1.Номенклатура
	               |	КОНЕЦ КАК Номенклатура,
	               |	ЗаказыПоставщикамДанные1.Заказано КАК Заказано
	               |ПОМЕСТИТЬ ЗаказыПоставщикамДанные
	               |ИЗ
	               |	ЗаказыПоставщикамДанные1 КАК ЗаказыПоставщикамДанные1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втИдентификаторыАналогов КАК втИдентификаторыАналогов
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	               |			ПО втИдентификаторыАналогов.ИдентификаторГруппы = ГруппыАналогов.ИдентификаторГруппы
	               |		ПО ЗаказыПоставщикамДанные1.Номенклатура = втИдентификаторыАналогов.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредварительныеПоступления.Контрагент КАК Контрагент,
	               |	ПредварительныеПоступления.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	ПредварительныеПоступления.Поступление КАК Поступление,
	               |	ПредварительныеПоступления.Номенклатура КАК Номенклатура,
	               |	СУММА(ПредварительныеПоступления.Заказано) КАК Заказано,
	               |	СУММА(ПредварительныеПоступления.ДолжноПоступить) КАК ДолжноПоступить,
	               |	СУММА(ПредварительныеПоступления.Поступило) КАК Поступило,
	               |	ПредварительныеПоступления.Поступление.ТоварноТранспортнаяНакладнаяЕГАИС КАК ПоступлениеТоварноТранспортнаяНакладнаяЕГАИС,
	               |	МАКСИМУМ(ПредварительныеПоступления.ЗаказаноОстаток) КАК ЗаказаноОстаток
	               |ПОМЕСТИТЬ ИтоговаяТаблица1
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЗаказыПоставщикам.Контрагент КАК Контрагент,
	               |		ЗаказыПоставщикам.ЗаказПоставщику КАК ЗаказПоставщику,
	               |		ПредварительныеПоступления.ПоступлениеТоваров КАК Поступление,
	               |		ЗаказыПоставщикам.Номенклатура КАК Номенклатура,
	               |		МАКСИМУМ(ЗаказыПоставщикам.Заказано) КАК Заказано,
	               |		0 КАК ДолжноПоступить,
	               |		0 КАК Поступило,
	               |		МАКСИМУМ(ЕСТЬNULL(ЗаказыПоставщикамОстатки.ЗаказаноОстаток, 0)) КАК ЗаказаноОстаток
	               |	ИЗ
	               |		ЗаказыПоставщикамДанные КАК ЗаказыПоставщикам
	               |			ЛЕВОЕ СОЕДИНЕНИЕ втЗаказыБезНоменклатуры КАК ПредварительныеПоступления
	               |			ПО (ПредварительныеПоступления.ЗаказПоставщику = ЗаказыПоставщикам.ЗаказПоставщику)
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыПоставщикамОстатки КАК ЗаказыПоставщикамОстатки
	               |			ПО ЗаказыПоставщикам.ЗаказПоставщику = ЗаказыПоставщикамОстатки.ЗаказПоставщику
	               |				И ЗаказыПоставщикам.Номенклатура = ЗаказыПоставщикамОстатки.Номенклатура
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ЗаказыПоставщикам.Контрагент,
	               |		ЗаказыПоставщикам.ЗаказПоставщику,
	               |		ЗаказыПоставщикам.Номенклатура,
	               |		ПредварительныеПоступления.ПоступлениеТоваров
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПредварительныеПоступления.Контрагент,
	               |		ПредварительныеПоступления.ЗаказПоставщику,
	               |		ПредварительныеПоступления.ПоступлениеТоваров,
	               |		ПредварительноеПоступлениеТоваров.Номенклатура,
	               |		0,
	               |		ЕСТЬNULL(ПредварительноеПоступлениеТоваров.Количество, 0) * ЕСТЬNULL(ПредварительноеПоступлениеТоваров.Коэффициент, 0),
	               |		ЕСТЬNULL(ПредварительноеПоступлениеТоваров.Количество, 0) * ЕСТЬNULL(ПредварительноеПоступлениеТоваров.Коэффициент, 0),
	               |		0
	               |	ИЗ
	               |		втЗаказыБезНоменклатуры КАК ПредварительныеПоступления
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПредварительноеПоступлениеТоваров.Товары КАК ПредварительноеПоступлениеТоваров
	               |			ПО ПредварительныеПоступления.ПредварительноеПоступление = ПредварительноеПоступлениеТоваров.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПредварительныеПоступления.Контрагент,
	               |		ПредварительныеПоступления.ЗаказПоставщику,
	               |		ПредварительныеПоступления.ПоступлениеТоваров,
	               |		ТабПоступлениеТоваров.Номенклатура,
	               |		0,
	               |		0,
	               |		0,
	               |		0
	               |	ИЗ
	               |		втЗаказыБезНоменклатуры КАК ПредварительныеПоступления
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров.Товары КАК ТабПоступлениеТоваров
	               |			ПО ПредварительныеПоступления.ПоступлениеТоваров = ТабПоступлениеТоваров.Ссылка
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ПредварительныеПоступления.Контрагент,
	               |		ПредварительныеПоступления.ЗаказПоставщику,
	               |		ПредварительныеПоступления.ПоступлениеТоваров,
	               |		ТабПоступлениеТоваров.Номенклатура) КАК ПредварительныеПоступления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПредварительныеПоступления.Контрагент,
	               |	ПредварительныеПоступления.ЗаказПоставщику,
	               |	ПредварительныеПоступления.Поступление,
	               |	ПредварительныеПоступления.Номенклатура,
	               |	ПредварительныеПоступления.Поступление.ТоварноТранспортнаяНакладнаяЕГАИС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИтоговаяТаблица.Контрагент КАК Контрагент,
	               |	ИтоговаяТаблица.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	ИтоговаяТаблица.Поступление КАК Поступление,
	               |	ЕСТЬNULL(ГруппыАналогов.Номенклатура, ИтоговаяТаблица.Номенклатура) КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ГруппыАналогов.Номенклатура, ИтоговаяТаблица.Номенклатура) <> ИтоговаяТаблица.Номенклатура
	               |			ТОГДА ИтоговаяТаблица.Заказано / ЕСТЬNULL(ГруппыАналогов.Коэффициент, 1)
	               |		ИНАЧЕ ИтоговаяТаблица.Заказано
	               |	КОНЕЦ КАК Заказано,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ГруппыАналогов.Номенклатура, ИтоговаяТаблица.Номенклатура) <> ИтоговаяТаблица.Номенклатура
	               |			ТОГДА 0
	               |		ИНАЧЕ ИтоговаяТаблица.ДолжноПоступить
	               |	КОНЕЦ КАК ДолжноПоступить,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ГруппыАналогов.Номенклатура, ИтоговаяТаблица.Номенклатура) <> ИтоговаяТаблица.Номенклатура
	               |			ТОГДА 0
	               |		ИНАЧЕ ИтоговаяТаблица.Поступило
	               |	КОНЕЦ КАК Поступило,
	               |	ИтоговаяТаблица.ПоступлениеТоварноТранспортнаяНакладнаяЕГАИС КАК ПоступлениеТоварноТранспортнаяНакладнаяЕГАИС,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ГруппыАналогов.Номенклатура, ИтоговаяТаблица.Номенклатура) <> ИтоговаяТаблица.Номенклатура
	               |			ТОГДА ИтоговаяТаблица.ЗаказаноОстаток / ЕСТЬNULL(ГруппыАналогов.Коэффициент, 1)
	               |		ИНАЧЕ ИтоговаяТаблица.ЗаказаноОстаток
	               |	КОНЕЦ КАК ЗаказаноОстаток
	               |ПОМЕСТИТЬ ИтоговаяТаблица
	               |ИЗ
	               |	ИтоговаяТаблица1 КАК ИтоговаяТаблица
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втИдентификаторыАналогов КАК втИдентификаторыАналогов
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
	               |			ПО втИдентификаторыАналогов.ИдентификаторГруппы = ГруппыАналогов.ИдентификаторГруппы
	               |		ПО ИтоговаяТаблица.Номенклатура = втИдентификаторыАналогов.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТоварноТранспортнаяНакладнаяВходящаяЕГАИСМарки.Ссылка КАК ТТН,
	               |	ЕСТЬNULL(ТоварноТранспортнаяНакладнаяВходящаяЕГАИСМарки.КодМарки, """") КАК КодМарки,
	               |	ТоварноТранспортнаяНакладнаяВходящаяЕГАИСМарки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ТоварноТранспортнаяНакладнаяВходящаяЕГАИСМарки.МаркировкаУпаковки КАК МаркировкаУпаковки,
	               |	ТоварноТранспортнаяНакладнаяВходящаяЕГАИСТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	               |	СоответствиеНоменклатурыЕГАИС.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ МаркиТТН
	               |ИЗ
	               |	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Марки КАК ТоварноТранспортнаяНакладнаяВходящаяЕГАИСМарки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Товары КАК ТоварноТранспортнаяНакладнаяВходящаяЕГАИСТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	               |			ПО ТоварноТранспортнаяНакладнаяВходящаяЕГАИСТовары.АлкогольнаяПродукция = СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция
	               |		ПО ТоварноТранспортнаяНакладнаяВходящаяЕГАИСМарки.Ссылка = ТоварноТранспортнаяНакладнаяВходящаяЕГАИСТовары.Ссылка
	               |			И ТоварноТранспортнаяНакладнаяВходящаяЕГАИСМарки.ИдентификаторСтроки = ТоварноТранспортнаяНакладнаяВходящаяЕГАИСТовары.ИдентификаторСтроки
	               |ГДЕ
	               |	ТоварноТранспортнаяНакладнаяВходящаяЕГАИСМарки.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ИтоговаяТаблица.ПоступлениеТоварноТранспортнаяНакладнаяЕГАИС КАК ПоступлениеТоварноТранспортнаяНакладнаяЕГАИС
	               |			ИЗ
	               |				ИтоговаяТаблица КАК ИтоговаяТаблица)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИтоговаяТаблица.Поступление КАК Поступление,
	               |	ИтоговаяТаблица.Номенклатура КАК Номенклатура,
	               |	ИтоговаяТаблица.ПоступлениеТоварноТранспортнаяНакладнаяЕГАИС КАК ПоступлениеТоварноТранспортнаяНакладнаяЕГАИС,
	               |	ЕСТЬNULL(МаркиТТН.КодМарки, """") КАК КодМарки,
	               |	МаркиТТН.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	               |	ЕСТЬNULL(МаркиТТН.МаркировкаУпаковки, """") КАК МаркировкаУпаковки,
	               |	ИтоговаяТаблица.ЗаказПоставщику КАК ЗаказПоставщику
	               |ИЗ
	               |	ИтоговаяТаблица КАК ИтоговаяТаблица
	               |		ЛЕВОЕ СОЕДИНЕНИЕ МаркиТТН КАК МаркиТТН
	               |		ПО ИтоговаяТаблица.ПоступлениеТоварноТранспортнаяНакладнаяЕГАИС = МаркиТТН.ТТН
	               |			И ИтоговаяТаблица.Номенклатура = МаркиТТН.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредварительныеПоступления.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ШтрихКоды.ЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
	               |	ШтрихКоды.Штрихкод КАК Штрихкод
	               |ИЗ
	               |	ИтоговаяТаблица КАК ПредварительныеПоступления
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихКоды
	               |		ПО ПредварительныеПоступления.Номенклатура = ШтрихКоды.Объект
	               |			И (ШтрихКоды.Запрет = ЛОЖЬ)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ИтоговаяТаблица.Номенклатура,
	               |	ЕСТЬNULL(ИтоговаяТаблица.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент, 1),
	               |	ИтоговаяТаблица.Номенклатура.GTIN
	               |ИЗ
	               |	ИтоговаяТаблица КАК ИтоговаяТаблица
	               |ГДЕ
	               |	ИтоговаяТаблица.Номенклатура.GTIN <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредварительныеПоступления.Контрагент КАК Контрагент,
	               |	ПредварительныеПоступления.Контрагент.Код КАК КонтрагентКод,
	               |	ПредварительныеПоступления.Контрагент.Наименование КАК КонтрагентНаименование,
	               |	ПредварительныеПоступления.Контрагент.ИНН КАК КонтрагентИНН,
	               |	ПредварительныеПоступления.Контрагент.КПП КАК КонтрагентКПП,
	               |	ВЫРАЗИТЬ(ПредварительныеПоступления.Контрагент.НаименованиеПолное КАК СТРОКА(500)) КАК КонтрагентНаименованиеПолное,
	               |	ПредварительныеПоступления.Контрагент.GLN КАК КонтрагентGLN,
	               |	ПредварительныеПоступления.Контрагент.Родитель КАК КонтрагентРодитель,
	               |	ПредварительныеПоступления.Контрагент.Родитель.Код КАК КонтрагентРодительКод,
	               |	ПредварительныеПоступления.Контрагент.Родитель.Наименование КАК КонтрагентРодительНаименование,
	               |	ПредварительныеПоступления.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	ПредварительныеПоступления.ЗаказПоставщику.Номер КАК ЗаказПоставщикуНомер,
	               |	ПредварительныеПоступления.ЗаказПоставщику.Дата КАК ЗаказПоставщикуДата,
	               |	ПредварительныеПоступления.Поступление КАК Поступление,
	               |	ПредварительныеПоступления.Поступление.ВхДокНомер КАК ПоступлениеНомер,
	               |	ПредварительныеПоступления.Поступление.ВхДокДата КАК ПоступлениеДата,
	               |	ЕСТЬNULL(итОграниченияПриемкиНаТСД.БезОграничений, ЛОЖЬ) КАК ОгрТСДБезОграничений,
	               |	ЕСТЬNULL(итОграниченияПриемкиНаТСД.ПревышениеЗаказанногоПроцент, 0) КАК ОгрТСДПревышениеЗаказанногоПроцент
	               |ИЗ
	               |	ИтоговаяТаблица КАК ПредварительныеПоступления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.итОграниченияПриемкиНаТСД КАК итОграниченияПриемкиНаТСД
	               |		ПО ПредварительныеПоступления.Контрагент = итОграниченияПриемкиНаТСД.Конгтрагент
	               |			И (итОграниченияПриемкиНаТСД.Подразеделение = &ПодразделениеКомпании)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПредварительныеПоступления.Контрагент,
	               |	ПредварительныеПоступления.ЗаказПоставщику,
	               |	ПредварительныеПоступления.Поступление,
	               |	ПредварительныеПоступления.Контрагент.Код,
	               |	ПредварительныеПоступления.Контрагент.Наименование,
	               |	ПредварительныеПоступления.Контрагент.ИНН,
	               |	ПредварительныеПоступления.Контрагент.КПП,
	               |	ПредварительныеПоступления.Контрагент.GLN,
	               |	ПредварительныеПоступления.Контрагент.Родитель,
	               |	ПредварительныеПоступления.Контрагент.Родитель.Код,
	               |	ПредварительныеПоступления.Контрагент.Родитель.Наименование,
	               |	ПредварительныеПоступления.ЗаказПоставщику.Номер,
	               |	ПредварительныеПоступления.ЗаказПоставщику.Дата,
	               |	ПредварительныеПоступления.Поступление.ВхДокНомер,
	               |	ПредварительныеПоступления.Поступление.ВхДокДата,
	               |	ВЫРАЗИТЬ(ПредварительныеПоступления.Контрагент.НаименованиеПолное КАК СТРОКА(500)),
	               |	ЕСТЬNULL(итОграниченияПриемкиНаТСД.БезОграничений, ЛОЖЬ),
	               |	ЕСТЬNULL(итОграниченияПриемкиНаТСД.ПревышениеЗаказанногоПроцент, 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредварительныеПоступления.ЗаказПоставщику КАК ЗаказПоставщику,
	               |	ПредварительныеПоступления.Поступление КАК Поступление,
	               |	ПредварительныеПоступления.Поступление.ВхДокНомер КАК ПоступлениеНомер,
	               |	ПредварительныеПоступления.Поступление.ВхДокДата КАК ПоступлениеДата,
	               |	ПредварительныеПоступления.Номенклатура КАК Номенклатура,
	               |	ПредварительныеПоступления.Номенклатура.Код КАК НоменклатураКод,
	               |	ПредварительныеПоступления.Номенклатура.ТипНоменклатуры.Весовой КАК Весовой,
	               |	ПредварительныеПоступления.Номенклатура.КратностьПоставок КАК КратностьПоставок,
	               |	ПредварительныеПоступления.Номенклатура.Наименование КАК НоменклатураНаименование,
	               |	ПредварительныеПоступления.Номенклатура.Артикул КАК НоменклатураАртикул,
	               |	ПредварительныеПоступления.Номенклатура.ИерархияАльтернативная КАК Родитель,
	               |	ПредварительныеПоступления.Номенклатура.ИерархияАльтернативная.Код КАК РодительКод,
	               |	ПредварительныеПоступления.Номенклатура.ИерархияАльтернативная.Наименование КАК РодительНаименование,
	               |	ПредварительныеПоступления.Заказано КАК Заказано,
	               |	ВЫБОР
	               |		КОГДА ПредварительныеПоступления.ДолжноПоступить = 0
	               |			ТОГДА ПредварительныеПоступления.Заказано
	               |		ИНАЧЕ ПредварительныеПоступления.ДолжноПоступить
	               |	КОНЕЦ КАК ДолжноПоступить,
	               |	ПредварительныеПоступления.Поступило КАК ПоступилоНеПередаем,
	               |	0 КАК Поступило,
	               |	ВЫБОР
	               |		КОГДА ПредварительныеПоступления.Номенклатура.ОсобенностьУчета = &АлкогольМаркируемый
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК АлкогольМаркируемый,
	               |	ВЫБОР
	               |		КОГДА ВЫБОР
	               |					КОГДА ПредварительныеПоступления.Номенклатура.итОсобенностьУчета.Маркируется
	               |						ТОГДА ИСТИНА
	               |					КОГДА ПредварительныеПоступления.Номенклатура.ОсобенностьУчета.Маркируется
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ЛОЖЬ
	               |				КОНЕЦ = ИСТИНА
	               |				И (ПредварительныеПоступления.Номенклатура.ОсобенностьУчета.ТипМаркировки = 3
	               |					ИЛИ ПредварительныеПоступления.Номенклатура.ТипНоменклатуры.Весовой)
	               |			ТОГДА ИСТИНА
	               |		КОГДА ВЫБОР
	               |					КОГДА ПредварительныеПоступления.Номенклатура.итОсобенностьУчета.Маркируется
	               |						ТОГДА ИСТИНА
	               |					КОГДА ПредварительныеПоступления.Номенклатура.ОсобенностьУчета.Маркируется
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ЛОЖЬ
	               |				КОНЕЦ = ИСТИНА
	               |				И ПредварительныеПоступления.Поступление.ПодразделениеКомпании.итОбязательнаяМаркировкаЧЗВключена
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК МаркируемаяПозиция,
	               |	ПредварительныеПоступления.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК КоэффициентЕдИзм,
	               |	ПредварительныеПоступления.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК НаименованиеЕдИзм,
	               |	ПредварительныеПоступления.ЗаказаноОстаток КАК ЗаказаноОстаток
	               |ИЗ
	               |	ИтоговаяТаблица КАК ПредварительныеПоступления";
	
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	
	//Мальцев А.Ю. +++
	ВыборкаМарки     = ПакетыЗапросов[ПакетыЗапросов.Количество()-4].Выбрать();
	//Мальцев А.Ю. ---

	ВыборкаШтрихкоды = ПакетыЗапросов[ПакетыЗапросов.Количество()-3].Выбрать();
	РезультатШапка   = ПакетыЗапросов[ПакетыЗапросов.Количество()-2];
	РезультатТовары  = ПакетыЗапросов[ПакетыЗапросов.Количество()-1];
	
	Если РезультатШапка.Пустой() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	//ЗаписатьОбъектXML(ЗаписьXML, Данные);
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
	ВыборкаЗаказ = РезультатШапка.Выбрать();
	Пока ВыборкаЗаказ.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Заказы"); // Заказы
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЗаказПоставщику"); // Заказ
		ЗаписьXML.ЗаписатьАтрибут("Тип",    "ЗаказПоставщику");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаЗаказ.ЗаказПоставщику));
		ЗаписьXML.ЗаписатьАтрибут("Номер",  ВыборкаЗаказ.ЗаказПоставщикуНомер);
		ЗаписьXML.ЗаписатьАтрибут("Дата",   Строка(ВыборкаЗаказ.ЗаказПоставщикуДата));
		//ЗаписьXML.ЗаписатьАтрибут("Представление", "Заказ № " + ВыборкаЗаказ.ЗаказПоставщикуНомер + " от " + Формат(ВыборкаЗаказ.ЗаказПоставщикуДата, "ДФ=dd.MM.yyyy"));
		ЗаписьXML.ЗаписатьАтрибут("Представление", "З. № " + ВыборкаЗаказ.ЗаказПоставщикуНомер + " от " + Формат(ВыборкаЗаказ.ЗаказПоставщикуДата, "ДФ=dd.MM.yyyy"));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ЗаказПоставщику
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПоступлениеТоваров"); // ПоступлениеТоваров
		ЗаписьXML.ЗаписатьАтрибут("Тип",    "ПоступлениеТоваров");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаЗаказ.Поступление));
		ЗаписьXML.ЗаписатьАтрибут("Номер",  ВыборкаЗаказ.ПоступлениеНомер);
		ЗаписьXML.ЗаписатьАтрибут("Дата",   Строка(ВыборкаЗаказ.ПоступлениеДата));
		ЗаписьXML.ЗаписатьАтрибут("Представление", "П. № " + ВыборкаЗаказ.ПоступлениеНомер + " от " + Формат(ВыборкаЗаказ.ПоступлениеДата, "ДФ=dd.MM.yyyy"));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ПоступлениеТоваров
		
		ОтклонениеГраммКомпания = ПолучитьДопустимоеОтклонениеКоличестваВесовогоТовараГрамм(ПодразделениеКомпании, ТекущаяДата());
		Если ТипЗнч(ОтклонениеГраммКомпания)<>Тип("Число") Тогда
			ОтклонениеГраммКомпания = 0;
		Иначе
			ОтклонениеГраммКомпания = ОтклонениеГраммКомпания / 1000;
		КонецЕсли;			
			
		ОтклонениеПроцентКомпания = ПолучитьДопустимоеОтклонениеКоличестваВесовогоТовараПроцентов(ПодразделениеКомпании, ТекущаяДата());
		Если ТипЗнч(ОтклонениеПроцентКомпания)<>Тип("Число") Тогда
			ОтклонениеПроцентКомпания = 0;
		Иначе
			ОтклонениеПроцентКомпания = ОтклонениеПроцентКомпания / 100;
		КонецЕсли;
		
		Если ВыборкаЗаказ.Контрагент.ПревышениеЗаказанногоНаПриемкеПроцент > 0 Тогда
			ОтклонениеПроцентКомпания = ВыборкаЗаказ.Контрагент.ПревышениеЗаказанногоНаПриемкеПроцент / 100;
		КонецЕсли;	
		
		//Мальцев А.Ю. 22.07.21+++  Если для контрагента не должно действовать ограничение, тогда передаем 200
		Если ВыборкаЗаказ.ОгрТСДБезОграничений Тогда
			ОтклонениеПроцентКомпания = 200;
		КонецЕсли;			
		//Мальцев А.Ю. 22.07.21---
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДопустимоеОтклонение"); // ДопустимоеОтклонение
		ЗаписьXML.ЗаписатьАтрибут("ОтклонениеГрамм",   XMLСтрока(ОтклонениеГраммКомпания));
		ЗаписьXML.ЗаписатьАтрибут("ОтклонениеПроцент", XMLСтрока(ОтклонениеПроцентКомпания));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ДопустимоеОтклонение
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Контрагент"); // Контрагент
		ЗаписьXML.ЗаписатьАтрибут("Тип", "Контрагенты");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаЗаказ.Контрагент));
		ЗаписьXML.ЗаписатьАтрибут("Код", ВыборкаЗаказ.КонтрагентКод);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", ВыборкаЗаказ.КонтрагентНаименование);
		ЗаписьXML.ЗаписатьАтрибут("ИНН", ВыборкаЗаказ.КонтрагентИНН);
		ЗаписьXML.ЗаписатьАтрибут("КПП", ВыборкаЗаказ.КонтрагентКПП);
		ЗаписьXML.ЗаписатьАтрибут("НаименованиеПолное", ВыборкаЗаказ.КонтрагентНаименованиеПолное);
		ЗаписьXML.ЗаписатьАтрибут("GLN", ВыборкаЗаказ.КонтрагентGLN);
		ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Ложь");
		Если ЗначениеЗаполнено(ВыборкаЗаказ.КонтрагентРодитель) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель"); // Родитель
			ЗаписьXML.ЗаписатьАтрибут("Тип", "Контрагенты");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(ВыборкаЗаказ.КонтрагентРодитель));
			ЗаписьXML.ЗаписатьАтрибут("Код",          ВыборкаЗаказ.КонтрагентРодительКод);
			ЗаписьXML.ЗаписатьАтрибут("Наименование", ВыборкаЗаказ.КонтрагентРодительНаименование);
			ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Истина");
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
		Иначе
			ЗаписьXML.ЗаписатьАтрибут("Родитель", "");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Контрагент
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Заказы
		
	КонецЦикла;
	
	Выборка = РезультатТовары.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Товары"); // Товары
		
		ЗаписьXML.ЗаписатьАтрибут("Заказано", Формат(Выборка.Заказано, "ЧРД=.; ЧН=0; ЧГ="));
		ЗаписьXML.ЗаписатьАтрибут("ДолжноПоступить", Формат(Выборка.ДолжноПоступить, "ЧРД=.; ЧН=0; ЧГ="));
		ЗаписьXML.ЗаписатьАтрибут("Поступило", Формат(Выборка.Поступило, "ЧРД=.; ЧН=0; ЧГ="));
		ЗаписьXML.ЗаписатьАтрибут("ЗаказаноОстаток", Формат(Выборка.ЗаказаноОстаток, "ЧРД=.; ЧН=0; ЧГ="));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЗаказПоставщику"); // Заказ
		ЗаписьXML.ЗаписатьАтрибут("Тип",    "ЗаказПоставщику");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.ЗаказПоставщику));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ЗаказПоставщику
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПоступлениеТоваров"); // ПоступлениеТоваров
		ЗаписьXML.ЗаписатьАтрибут("Тип",    "ПоступлениеТоваров");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Поступление));
		ЗаписьXML.ЗаписатьАтрибут("Представление", "Поступление № " + Выборка.ПоступлениеНомер + " от " + Формат(Выборка.ПоступлениеДата, "ДФ=dd.MM.yyyy"));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ПоступлениеТоваров
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
		ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Номенклатура));
		ЗаписьXML.ЗаписатьАтрибут("Код", Выборка.НоменклатураКод);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.НоменклатураНаименование);
		ЗаписьXML.ЗаписатьАтрибут("Артикул", Выборка.НоменклатураАртикул);
		ЗаписьXML.ЗаписатьАтрибут("КратностьПоставок", Формат(Выборка.КратностьПоставок, "ЧРД=.; ЧН=0; ЧГ="));
		ЗаписьXML.ЗаписатьАтрибут("Весовой", ?(Выборка.Весовой,"Истина","Ложь"));
		
		//Мальцев А.Ю. 22.07.21 +++
		ЗаписьXML.ЗаписатьАтрибут("АлкогольМаркируемый", 	 ?(Выборка.АлкогольМаркируемый,"Истина","Ложь"));
		
		ЗаписьXML.ЗаписатьАтрибут("МаркируемаяПозиция", 	 ?(Выборка.МаркируемаяПозиция,"Истина","Ложь"));
		
		ЗаписьXML.ЗаписатьАтрибут("КоэффициентЕдИзм", 		 Формат(Выборка.КоэффициентЕдИзм, "ЧРД=.; ЧН=0; ЧГ="));
		
		Если Не ЗначениеЗаполнено(Выборка.НаименованиеЕдИзм) Тогда
			ТекстОшибки = "Не заполнена ед. измерения для " + Строка(Выборка.НоменклатураНаименование);
			Результат = СформироватьДанныеПередачи(Неопределено);
			Возврат Результат;
		КонецЕсли;
		ЗаписьXML.ЗаписатьАтрибут("НаименованиеЕдИзм", 		 Выборка.НаименованиеЕдИзм);
		
		//Мальцев А.Ю. 22.07.21 ---

		ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Ложь");
		Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель"); // Родитель
			ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Родитель));
			ЗаписьXML.ЗаписатьАтрибут("Код", Выборка.РодительКод);
			ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.РодительНаименование);
			ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Истина");
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
		Иначе
			ЗаписьXML.ЗаписатьАтрибут("Родитель", "");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
		
		//ЗаписьXML.ЗаписатьАтрибут("Заказано", Формат(Выборка.Заказано, "ЧРД=.; ЧН=0; ЧГ="));
		//ЗаписьXML.ЗаписатьАтрибут("ДолжноПоступить", Формат(Выборка.ДолжноПоступить, "ЧРД=.; ЧН=0; ЧГ="));
		//ЗаписьXML.ЗаписатьАтрибут("Поступило", Формат(Выборка.Поступило, "ЧРД=.; ЧН=0; ЧГ="));
		//ЗаписьXML.ЗаписатьАтрибут("Штрихкод", Выборка.Штрихкод);
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
	КонецЦикла;
	
	Пока ВыборкаШтрихкоды.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ШтрихКоды"); // ТоварнаяСтрока
		
		ЗаписьXML.ЗаписатьАтрибут("Штрихкод", ВыборкаШтрихкоды.Штрихкод);
		ЗаписьXML.ЗаписатьАтрибут("Коэффициент", Формат(ВыборкаШтрихкоды.Коэффициент, "ЧРД=.; ЧН=0; ЧГ="));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
		ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаШтрихкоды.Номенклатура));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
		
	КонецЦикла;
	
	//Мальцев А.Ю. 22.07.21 +++	
	//Марки
	Пока ВыборкаМарки.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Марки"); // ТоварнаяСтрока
		
		ЗаписьXML.ЗаписатьАтрибут("КодМарки", 			ВыборкаМарки.КодМарки);	
		ЗаписьXML.ЗаписатьАтрибут("МаркировкаУпаковки", ВыборкаМарки.МаркировкаУпаковки);	
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЗаказПоставщику"); // Заказ
		ЗаписьXML.ЗаписатьАтрибут("Тип",    "ЗаказПоставщику");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаМарки.ЗаказПоставщику));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ЗаказПоставщику
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПоступлениеТоваров"); // ПоступлениеТоваров
		ЗаписьXML.ЗаписатьАтрибут("Тип",    "ПоступлениеТоваров");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаМарки.Поступление));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ПоступлениеТоваров
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
		ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаМарки.Номенклатура));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
		
	КонецЦикла;
	//Мальцев А.Ю. 22.07.21 ---
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
	
	ЗаписьXML.Закрыть();
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьПоступленияТоваровСтараяВерсия(СсылкаПодразделениеКомпании, ШтрихКод, ПараметрыОбмена, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	Исключение
		ТекстОшибки = "Авторизация не выполнена";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецПопытки;
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи).ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	Пользователь = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
			ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
		Возврат Ложь;
	КонецЕсли;
	
	РезультатОбработки = ПараметрыОбмена.Получить();
	ДанныеОбмена = РезультатОбработки.ДанныеОбмена;
	
	Фото = ПолучитьЗначениеПараметраСтруктуры(РезультатОбработки, "Фото", Неопределено);
	
	ТаблицаЗаказов = ПолучитьДанныеОбмена(ДанныеОбмена);
	
	Попытка
		
		НачатьТранзакцию();
		
		СсылкаСериализованная = ТаблицаЗаказов.Поступление.Ссылка;
		
		Идентификатор = Новый УникальныйИдентификатор(СсылкаСериализованная);
		ПредварительноеПоступление = Документы.ПоступлениеТоваров.ПолучитьСсылку(Идентификатор);
		
		ДокументОбъект = Неопределено;
		Если НЕ ЗначениеЗаполнено(ПредварительноеПоступление) Тогда
			//	ДокументОбъект = НоваяСсылка.ПолучитьОбъект();
			//Иначе
			ТекстОшибки = ТекстОшибки + "
			|Не найдено предварительное поступление <"+Идентификатор+">";
			Возврат Ложь;
		КонецЕсли;
		
		//Если ДокументОбъект = Неопределено Тогда
		//	ТекстОшибки = ТекстОшибки + "
		//	|Не найдено предварительное поступление <"+Идентификатор+">";
		//	Продолжить;
		//КонецЕсли;
		
		ТаблицаТоваров = Новый ТаблицаЗначений;
		ТаблицаТоваров.Колонки.Добавить("Номенклатура");
		ТаблицаТоваров.Колонки.Добавить("Количество");
		ТаблицаТоваров.Индексы.Добавить("Номенклатура");
		
		СписокТоваров = ПолучитьСписокИзXDTO(ТаблицаЗаказов.Товары);
		Если СписокТоваров.Количество()=0 Тогда
			Возврат Истина;
		КонецЕсли;
		
		Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
			
			Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Номенклатура.Ссылка);
			Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
			
			НоваяСтрока = ТаблицаТоваров.Добавить();
			НоваяСтрока.Номенклатура = Номенклатура;
			НоваяСтрока.Количество   = Число(ТекущаяСтрока.Количество);
			
		КонецЦикла;
		
		ЗапросПоступлений = Новый Запрос;
		ЗапросПоступлений.УстановитьПараметр("ДокументОснование", ПредварительноеПоступление);
		ЗапросПоступлений.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		                          |	ПоступлениеТоваров.Ссылка КАК Ссылка,
		                          |	ЕСТЬNULL(СостоянияДокументовТСД.Состояние, ЗНАЧЕНИЕ(Перечисление.итСостоянияВыполненияПоступленийТоваров.ПустаяСсылка)) КАК Состояние
		                          |ИЗ
		                          |	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
		                          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.итСостоянияВыполненияПоступленийТоваров КАК СостоянияДокументовТСД
		                          |		ПО ПоступлениеТоваров.Ссылка = СостоянияДокументовТСД.Поступление
		                          |ГДЕ
		                          |	ПоступлениеТоваров.Ссылка = &ДокументОснование
		                          |	И ПоступлениеТоваров.ПометкаУдаления = ЛОЖЬ
		                          |
		                          |УПОРЯДОЧИТЬ ПО
		                          |	ПоступлениеТоваров.Дата УБЫВ";
		ВыборкаПоступлений = ЗапросПоступлений.Выполнить().Выбрать();
		Если ВыборкаПоступлений.Следующий() Тогда
			
			Если НЕ ВыборкаПоступлений.Состояние = Перечисления.итСостоянияВыполненияПоступленийТоваров.КПриемке Тогда
				ТекстОшибки = "Документ: <"+Строка(ВыборкаПоступлений.Ссылка)+"> должен быть в состоянии <Ожидает поступления от поставщика>";
				Результат = СформироватьДанныеПередачи(Неопределено);
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецЕсли;
			
			ПоступлениеТоваров = ВыборкаПоступлений.Ссылка.ПолучитьОбъект();
			ПоступлениеТоваров.Заблокировать();
		Иначе
			ПоступлениеТоваров = Документы.ПоступлениеТоваров.СоздатьДокумент();
			ПоступлениеТоваров.Заполнить(ПредварительноеПоступление);
		КонецЕсли;
		ПоступлениеТоваров.ЗакрытиеЗаказовПоставщикам = 2;
		ПоступлениеТоваров.Автор = Пользователь;
		ПоступлениеТоваров.ДатаЗавершенияПриемки = ПоступлениеТоваров.Дата;
		
		КоличествоПозиций = ПоступлениеТоваров.Товары.Количество()-1;
		мСтрокиДляУдаления = Новый Массив;
		
		ЦеныПоставщикаВПриемке = ПоступлениеТоваров.Контрагент.итЦеныПоставщикаВПриемкеНаТСД;
		Для каждого ТоварнаяСтрока из ПоступлениеТоваров.Товары Цикл
			НайденнаяСтрока = ТаблицаТоваров.Найти(ТоварнаяСтрока.Номенклатура, "Номенклатура");
			Если НайденнаяСтрока = Неопределено Тогда
				//ПоступлениеТоваров.Товары.Удалить(КоличествоПозиций);
				//ТоварнаяСтрока.Количество = 0;
				//Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(ПоступлениеТоваров, ТоварнаяСтрока);
				мСтрокиДляУдаления.Добавить(ТоварнаяСтрока); 
			Иначе
				
				Если ЦеныПоставщикаВПриемке Тогда
					
					Если ТоварнаяСтрока.Коэффициент = 0 Тогда
						ТоварнаяСтрока.Коэффициент = 1;
					КонецЕсли;
					
					Если ТоварнаяСтрока.СуммаВсего > 0 Тогда
						Если ТоварнаяСтрока.Количество = 0 Тогда
							ЦенаСНДС = ТоварнаяСтрока.Цена;
						Иначе
							ЦенаСНДС = ТоварнаяСтрока.СуммаВсего/ТоварнаяСтрока.Количество;
						КонецЕсли;
						
						ТоварнаяСтрока.Цена = ЦенаСНДС;
						
						ТекКоличество = НайденнаяСтрока.Количество/ТоварнаяСтрока.Коэффициент;
						СуммаВсего = ЦенаСНДС * ТекКоличество;
						
						ТоварнаяСтрока.Количество = ТекКоличество;
						Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(ПоступлениеТоваров, ТоварнаяСтрока);						
						ТоварнаяСтрока.СуммаВсего = СуммаВсего;
						
						Документы.ПоступлениеТоваров.ТоварыСуммаВсегоПриИзменении(ПоступлениеТоваров,ТоварнаяСтрока);
					Иначе
						ТоварнаяСтрока.Количество = НайденнаяСтрока.Количество/ТоварнаяСтрока.Коэффициент;
						Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(ПоступлениеТоваров, ТоварнаяСтрока);
					КонецЕсли;
				Иначе
					Документы.ПоступлениеТоваров.ТоварыНоменклатураПриИзменении(ПоступлениеТоваров, ТоварнаяСтрока);
					
					Если ТоварнаяСтрока.Коэффициент = 0 Тогда
						ТоварнаяСтрока.Коэффициент = 1;
					КонецЕсли;
					
					ТоварнаяСтрока.Количество = НайденнаяСтрока.Количество/ТоварнаяСтрока.Коэффициент;
					
					Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(ПоступлениеТоваров, ТоварнаяСтрока);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого стрмСтрокиДляУдаления из мСтрокиДляУдаления Цикл
			  ПоступлениеТоваров.Товары.Удалить(стрмСтрокиДляУдаления);
		КонецЦикла;	
		
		ПоступлениеТоваров.Записать(РежимЗаписиДокумента.Проведение);
		
		НаборЗаписей = РегистрыСведений.итСостоянияДокументовЭДО_LeraData.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(ПоступлениеТоваров.Ссылка);
		НаборЗаписей.Прочитать();
		
		Если НЕ НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей[0];
			Если Запись.Состояния      =  Перечисления.итСостоянияЭДО.ОжидаетПоступленияОтПоставщика Тогда
				Запись.СсылкаНаОбъект = ПоступлениеТоваров.Ссылка;
				Запись.Состояния      = Перечисления.итСостоянияЭДО.НаКонтроле;
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(ИСТИНА);
			КонецЕсли;
		КонецЕсли;
		
		
		МенеджерЗаписи = РегистрыСведений.итСостоянияВыполненияПоступленийТоваров.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Поступление = ПоступлениеТоваров.Ссылка;
		МенеджерЗаписи.Состояние = Перечисления.итСостоянияВыполненияПоступленийТоваров.НаКонтроле;
		МенеджерЗаписи.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.Записать();
		
		//	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		//ТекстовыйДокумент = Новый ТекстовыйДокумент;
		//ТекстовыйДокумент.УстановитьТекст(ТекстСообщенияXML);
		//ТекстовыйДокумент.Записать(ИмяВременногоФайла, КодировкаТекста.UTF8, "");
		Если ТипЗнч(Фото) = Тип("Массив") Тогда
			
			Счетчик = 1;
			Для Каждого ТекущееФото Из Фото Цикл
				//ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
				АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ТекущееФото);
				//
				//Попытка
				//	УдалитьФайлы(ИмяВременногоФайла);
				//Исключение
				//	ИнтеграцияГосИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				//КонецПопытки;
				
				ПараметрыФайла = Новый Структура();
				ПараметрыФайла.Вставить("Автор",              Пользователь);
				ПараметрыФайла.Вставить("ВладелецФайлов",     ПоступлениеТоваров.Ссылка);
				//ПараметрыФайла.Вставить("ВладелецФайлов",     ПредварительноеПоступление.ДокументОснование);
				ПараметрыФайла.Вставить("ИмяБезРасширения",   "Скан № "+СокрЛП(Счетчик)+" документ " + СокрЛП(ПоступлениеТоваров.Ссылка));
				ПараметрыФайла.Вставить("РасширениеБезТочки", "png");
				ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное");
				
				ПрисоединенныйФайл = ПрисоединенныеФайлы.ДобавитьПрисоединенныйФайл(
				ПараметрыФайла, АдресФайлаВоВременномХранилище, , , Справочники.ЭДПрисоединенныеФайлы.ПолучитьСсылку());
				
				Счетчик = Счетчик + 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат = СформироватьДанныеПередачи(Неопределено);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

Функция СоздатьПоступленияТоваров(СсылкаПодразделениеКомпании, ШтрихКод, ПараметрыОбмена, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	Исключение
		ТекстОшибки = "Авторизация не выполнена";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецПопытки;
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи).ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	Пользователь = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
			ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
		Возврат Ложь;
	КонецЕсли;
	
	РезультатОбработки = ПараметрыОбмена.Получить();
	ДанныеОбмена = РезультатОбработки.ДанныеОбмена;
	
	ОтказОтПриемки = Ложь;
	Если РезультатОбработки.Свойство("ОтказОтПриемки") Тогда
		ОтказОтПриемки = РезультатОбработки.ОтказОтПриемки;
	КонецЕсли;
		
	Фото = ПолучитьЗначениеПараметраСтруктуры(РезультатОбработки, "Фото", Неопределено);
	
	ТаблицаЗаказов = ПолучитьДанныеОбмена(ДанныеОбмена);
	
	Попытка
		
		НачатьТранзакцию();
		
		СсылкаСериализованная = ТаблицаЗаказов.Поступление.Ссылка;
		
		Идентификатор = Новый УникальныйИдентификатор(СсылкаСериализованная);
		ПредварительноеПоступление = Документы.ПоступлениеТоваров.ПолучитьСсылку(Идентификатор);
		
		ДокументОбъект = Неопределено;
		Если НЕ ЗначениеЗаполнено(ПредварительноеПоступление) Тогда
			//	ДокументОбъект = НоваяСсылка.ПолучитьОбъект();
			//Иначе
			ТекстОшибки = ТекстОшибки + "
			|Не найдено предварительное поступление <"+Идентификатор+">";
			Возврат Ложь;
		КонецЕсли;
		
		//Если ДокументОбъект = Неопределено Тогда
		//	ТекстОшибки = ТекстОшибки + "
		//	|Не найдено предварительное поступление <"+Идентификатор+">";
		//	Продолжить;
		//КонецЕсли;
		
		ТаблицаТоваров = Новый ТаблицаЗначений;
		ТаблицаТоваров.Колонки.Добавить("Номенклатура");
		ТаблицаТоваров.Колонки.Добавить("Количество");
		ТаблицаТоваров.Индексы.Добавить("Номенклатура");
		
		тзШтрихкодыШтучной = Новый ТаблицаЗначений;
		тзШтрихкодыШтучной.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		тзШтрихкодыШтучной.Колонки.Добавить("Штрихкод", ОбщегоНазначения.ОписаниеТипаСтрока(200));
		
		СписокТоваров = ПолучитьСписокИзXDTO(ТаблицаЗаказов.Товары);
		Если СписокТоваров.Количество()=0 Тогда
			Возврат Истина;
		КонецЕсли;
		
		
		Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
			
			Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Номенклатура.Ссылка);
			Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
			
			НоваяСтрока = ТаблицаТоваров.Добавить();
			НоваяСтрока.Номенклатура = Номенклатура;
			НоваяСтрока.Количество   = Число(ТекущаяСтрока.Количество);
			
			НоваяСтрокаШК = тзШтрихкодыШтучной.Добавить();
			НоваяСтрокаШК.Номенклатура = Номенклатура;
			НоваяСтрокаШК.Штрихкод     = ТекущаяСтрока.ШтрихкодШтучной;
			
		КонецЦикла;
		
	
		ЗапросПоступлений = Новый Запрос;
		ЗапросПоступлений.УстановитьПараметр("ДокументОснование", ПредварительноеПоступление);
		ЗапросПоступлений.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		                          |	ПоступлениеТоваров.Ссылка КАК Ссылка,
		                          |	ЕСТЬNULL(СостоянияДокументовТСД.Состояние, ЗНАЧЕНИЕ(Перечисление.итСостоянияВыполненияПоступленийТоваров.ПустаяСсылка)) КАК Состояние
		                          |ИЗ
		                          |	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
		                          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.итСостоянияВыполненияПоступленийТоваров КАК СостоянияДокументовТСД
		                          |		ПО ПоступлениеТоваров.Ссылка = СостоянияДокументовТСД.Поступление
		                          |ГДЕ
		                          |	ПоступлениеТоваров.Ссылка = &ДокументОснование
		                          |	И ПоступлениеТоваров.ПометкаУдаления = ЛОЖЬ
		                          |
		                          |УПОРЯДОЧИТЬ ПО
		                          |	ПоступлениеТоваров.Дата УБЫВ";
		ВыборкаПоступлений = ЗапросПоступлений.Выполнить().Выбрать();
		Если ВыборкаПоступлений.Следующий() Тогда
			
			Если НЕ ВыборкаПоступлений.Состояние = Перечисления.итСостоянияВыполненияПоступленийТоваров.КПриемке Тогда
				ТекстОшибки = "Документ: <"+Строка(ВыборкаПоступлений.Ссылка)+"> должен быть в состоянии <Ожидает поступления от поставщика>";
				Результат = СформироватьДанныеПередачи(Неопределено);
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецЕсли;
			
			ПоступлениеТоваров = ВыборкаПоступлений.Ссылка.ПолучитьОбъект();
			ПоступлениеТоваров.Заблокировать();
		Иначе
			ПоступлениеТоваров = Документы.ПоступлениеТоваров.СоздатьДокумент();
			ПоступлениеТоваров.Заполнить(ПредварительноеПоступление);
		КонецЕсли;
		ПоступлениеТоваров.ЗакрытиеЗаказовПоставщикам = 2;
		
		ПоступлениеТоваров.Автор = Пользователь;
		ПоступлениеТоваров.ДатаЗавершенияПриемки = ПоступлениеТоваров.Дата;
		ПоступлениеТоваров.итДатаПриемкиТСД = ТекущаяДата();
		
		КоличествоПозиций = ПоступлениеТоваров.Товары.Количество()-1;
		мСтрокиДляУдаления = Новый Массив;
		
		ЦеныПоставщикаВПриемке = ПоступлениеТоваров.Контрагент.итЦеныПоставщикаВПриемкеНаТСД;
		
		ЕстьРасхождение = Ложь;
		
		Для каждого ТоварнаяСтрока из ПоступлениеТоваров.Товары Цикл
			НайденнаяСтрока = ТаблицаТоваров.Найти(ТоварнаяСтрока.Номенклатура, "Номенклатура");
			Если НайденнаяСтрока = Неопределено Тогда
				//ПоступлениеТоваров.Товары.Удалить(КоличествоПозиций);
				//ТоварнаяСтрока.Количество = 0;
				//Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(ПоступлениеТоваров, ТоварнаяСтрока);
				
				//мСтрокиДляУдаления.Добавить(ТоварнаяСтрока); 
				
				Если ПоступлениеТоваров.Контрагент.итДоверительнаяПриемка = Ложь Тогда
					мСтрокиДляУдаления.Добавить(ТоварнаяСтрока); 
				Иначе					
					ЕстьРасхождение = Истина;
				КонецЕсли;
				
			Иначе
				
				Если ПоступлениеТоваров.Контрагент.итДоверительнаяПриемка = Ложь  И ОтказОтПриемки = Ложь Тогда
					Если ЦеныПоставщикаВПриемке Тогда
						
						Если ТоварнаяСтрока.Коэффициент = 0 Тогда
							ТоварнаяСтрока.Коэффициент = 1;
						КонецЕсли;
						
						Если ТоварнаяСтрока.СуммаВсего > 0 Тогда
							Если ТоварнаяСтрока.Количество = 0 Тогда
								ЦенаСНДС = ТоварнаяСтрока.Цена;
							Иначе
								ЦенаСНДС = ТоварнаяСтрока.СуммаВсего/ТоварнаяСтрока.Количество;
							КонецЕсли;
							
							ТоварнаяСтрока.Цена = ЦенаСНДС;
							
							ТекКоличество = НайденнаяСтрока.Количество/ТоварнаяСтрока.Коэффициент;
							СуммаВсего = ЦенаСНДС * ТекКоличество;
							
							ТоварнаяСтрока.Количество = ТекКоличество;
							Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(ПоступлениеТоваров, ТоварнаяСтрока);						
							ТоварнаяСтрока.СуммаВсего = СуммаВсего;
							
							Документы.ПоступлениеТоваров.ТоварыСуммаВсегоПриИзменении(ПоступлениеТоваров,ТоварнаяСтрока);
						Иначе
							ТоварнаяСтрока.Количество = НайденнаяСтрока.Количество/ТоварнаяСтрока.Коэффициент;
							Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(ПоступлениеТоваров, ТоварнаяСтрока);
						КонецЕсли;
					Иначе
						Документы.ПоступлениеТоваров.ТоварыНоменклатураПриИзменении(ПоступлениеТоваров, ТоварнаяСтрока);
						
						Если ТоварнаяСтрока.Коэффициент = 0 Тогда
							ТоварнаяСтрока.Коэффициент = 1;
						КонецЕсли;
						
						ТоварнаяСтрока.Количество = НайденнаяСтрока.Количество/ТоварнаяСтрока.Коэффициент;
						
						Документы.ПоступлениеТоваров.ТоварыКоличествоПриИзменении(ПоступлениеТоваров, ТоварнаяСтрока);
					КонецЕсли;
					
					ДанныеТСД = ПоступлениеТоваров.ДанныеПриемкиНаТСД.Добавить();
					ДанныеТСД.Номенклатура = НайденнаяСтрока.Номенклатура;
					ДанныеТСД.Количество   = НайденнаяСтрока.Количество/ТоварнаяСтрока.Коэффициент;
					
				Иначе
					
					
					ДанныеТСД = ПоступлениеТоваров.ДанныеПриемкиНаТСД.Добавить();
					ДанныеТСД.Номенклатура = НайденнаяСтрока.Номенклатура;
					ДанныеТСД.Количество   = НайденнаяСтрока.Количество/ТоварнаяСтрока.Коэффициент;
					
					Если ТоварнаяСтрока.Количество <> ДанныеТСД.Количество Тогда
						ЕстьРасхождение = Истина;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого стрмСтрокиДляУдаления из мСтрокиДляУдаления Цикл
			  ПоступлениеТоваров.Товары.Удалить(стрмСтрокиДляУдаления);
		КонецЦикла;	
		
		////Контроль остатков по заказу	
		//тзТоварыПоступления = ПоступлениеТоваров.Товары.Выгрузить(,"Номенклатура, Количество");
		//ТекстОшибкиОстатков = ВыполнитьКонтрольОстаткаПоЗаказу(ПоступлениеТоваров, тзТоварыПоступления);	
		//Если Не ПустаяСтрока(ТекстОшибки) Тогда
		//	ТекстОшибки = ТекстОшибкиОстатков;
		//	Результат = СформироватьДанныеПередачи(Неопределено);
		//	ОтменитьТранзакцию();
		//	Возврат Ложь;
		//КонецЕсли;
		
		//Мальцев А.Ю. +++ Консервация
		//ОбработатьЗаданияШтихкодШтучной(тзШтрихкодыШтучной, ПодразделениеКомпании, Пользователь);
		//Мальцев А.Ю. ---
		
		//Марки
		Попытка
			//Если ТаблицаЗаказов.Свойство("Марки") Тогда
				СписокМарки = ПолучитьСписокИзXDTO(ТаблицаЗаказов.Марки);
				
				Для Каждого ТекущаяСтрока Из СписокМарки Цикл
					
					Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Номенклатура.Ссылка);
					Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
					
					ИдентификаторНоменклатуры = ПоступлениеТоваров.Товары.Найти(Номенклатура, "Номенклатура");
					Если ИдентификаторНоменклатуры <> НЕОПРЕДЕЛЕНО Тогда
						
						//КодМарки   = ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(ТекущаяСтрока.КодМарки), "UTF-8");
						//ТекстМарки = КодМарки;
						КодМарки   = ТекущаяСтрока.КодМарки;
						ТекстМарки = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(КодМарки); 
						ПроверкаМарки =  ПоступлениеТоваров.Марки.Найти(ТекстМарки, "КодМарки");
						Если ПроверкаМарки = НЕОПРЕДЕЛЕНО Тогда
							НоваяСтрока = ПоступлениеТоваров.Марки.Добавить();
							НоваяСтрока.ИдентификаторСтроки = ИдентификаторНоменклатуры.ИдентификаторСтроки;
							НоваяСтрока.КодМарки   	= ТекстМарки;
							//НоваяСтрока.Количество  = ТекущаяСтрока.Количество;

						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
			//КонецЕсли;
		Исключение
		КонецПопытки;
		
		ПоступлениеТоваров.Записать(РежимЗаписиДокумента.Проведение);
		
		НаборЗаписей = РегистрыСведений.итСостоянияДокументовЭДО_LeraData.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(ПоступлениеТоваров.Ссылка);
		НаборЗаписей.Прочитать();
		
		Если НЕ НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей[0];
			Если Запись.Состояния      =  Перечисления.итСостоянияЭДО.ОжидаетПоступленияОтПоставщика Тогда
				Запись.СсылкаНаОбъект = ПоступлениеТоваров.Ссылка;
				Запись.Состояния      = Перечисления.итСостоянияЭДО.НаКонтроле;
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(ИСТИНА);
			КонецЕсли;
		КонецЕсли;
		
		
		МенеджерЗаписи = РегистрыСведений.итСостоянияВыполненияПоступленийТоваров.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Поступление = ПоступлениеТоваров.Ссылка;
		Если ЕстьРасхождение = Ложь Тогда
			МенеджерЗаписи.Состояние = Перечисления.итСостоянияВыполненияПоступленийТоваров.НаКонтроле;
		Иначе
			МенеджерЗаписи.Состояние = Перечисления.итСостоянияВыполненияПоступленийТоваров.ЕстьРасхождения;		
		КонецЕсли;
		МенеджерЗаписи.Сотрудник = ПараметрыСеанса.ТекущийПользователь;
		МенеджерЗаписи.Записать();
		
		
		//Заявка на расхождение
		
		Если ОтказОтПриемки Тогда
			
			ЗаявкаНаРасхожение = СоздатьДокументЗаявкаНаРасхождение(ПоступлениеТоваров.Ссылка, ПоступлениеТоваров.ДанныеПриемкиНаТСД);
			Если Не ЗначениеЗаполнено(ЗаявкаНаРасхожение) Тогда
				
			КонецЕсли;
			
			
		КонецЕсли;
		
		
		
		//	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		//ТекстовыйДокумент = Новый ТекстовыйДокумент;
		//ТекстовыйДокумент.УстановитьТекст(ТекстСообщенияXML);
		//ТекстовыйДокумент.Записать(ИмяВременногоФайла, КодировкаТекста.UTF8, "");
		Если ТипЗнч(Фото) = Тип("Массив") Тогда
			
			Счетчик = 1;
			Для Каждого ТекущееФото Из Фото Цикл
				//ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
				АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ТекущееФото);
				//
				//Попытка
				//	УдалитьФайлы(ИмяВременногоФайла);
				//Исключение
				//	ИнтеграцияГосИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				//КонецПопытки;
				
				ПараметрыФайла = Новый Структура();
				ПараметрыФайла.Вставить("Автор",              Пользователь);
				ПараметрыФайла.Вставить("ВладелецФайлов",     ПоступлениеТоваров.Ссылка);
				//ПараметрыФайла.Вставить("ВладелецФайлов",     ПредварительноеПоступление.ДокументОснование);
				ПараметрыФайла.Вставить("ИмяБезРасширения",   "Скан № "+СокрЛП(Счетчик)+" документ " + СокрЛП(ПоступлениеТоваров.Ссылка));
				ПараметрыФайла.Вставить("РасширениеБезТочки", "png");
				ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное");
				
				ПрисоединенныйФайл = ПрисоединенныеФайлы.ДобавитьПрисоединенныйФайл(
				ПараметрыФайла, АдресФайлаВоВременномХранилище, , , Справочники.ЭДПрисоединенныеФайлы.ПолучитьСсылку());
				
				Счетчик = Счетчик + 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат = СформироватьДанныеПередачи(Неопределено);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СоздатьДокументЗаявкаНаРасхождение(Приемка, ДанныеПриемки) 
	
	Документ = Документы.итЗаявкаНаРасхождение.СоздатьДокумент();
	
	Документ.Дата 					= ТекущаяДата();
	Документ.Организация 			= Приемка.Организация;
	Документ.ПодразделениеКомпании 	= Приемка.ПодразделениеКомпании;
	Документ.Автор 					= ПараметрыСеанса.ТекущийПользователь;
	Документ.ВалютаДокумента 		= Приемка.ВалютаДокумента;
	Документ.КурсДокумента 			= Приемка.КурсДокумента;
	Документ.Статус 				= Перечисления.итСтатусыЗаявокНаВозврат.КОтправке;
	Документ.ХозОперация 			= Справочники.ХозОперации.ЗаявкаНаРасхождение;
	Документ.ДокументОснование 		= Приемка;
	Документ.Контрагент 			= Приемка.Контрагент;
	Документ.ДоговорВзаиморасчетов 	= Приемка.ДоговорВзаиморасчетов;
	Документ.ТипЦен 				= Приемка.ТипЦен;
	Документ.ДатаЗаявки 			= ТекущаяДата();
	Документ.СкладКомпании 			= Приемка.СкладКомпании;
	
	Для Каждого стр Из ДанныеПриемки Цикл
		
		НовСтр = Документ.Товары.Добавить();
		НовСтр.Номенклатура 	= стр.Номенклатура;
		НовСтр.Количество		= стр.Количество;
		НовСтр.ЕдиницаИзмерения	= стр.Номенклатура.ОсновнаяЕдиницаИзмерения;
		НовСтр.Коэффициент		= стр.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент;
		
	КонецЦикла;
	
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		
		ТекУзел = ПланыОбмена.рздВыгрузкаВЕРП.НайтиПоКоду("ЕРП");
		ПланыОбмена.ЗарегистрироватьИзменения(ТекУзел, Документ.Ссылка);

	Исключение
		Документ = НЕОПРЕДЕЛЕНО;
		ТекстОшибки = ОписаниеОшибки();
		Сообщить(ТекстОшибки);
	КонецПопытки;
	
	
	Возврат Документ.Ссылка;
	
КонецФункции

Процедура ОбработатьЗаданияШтихкодШтучной(тзШтрихкодыШтучной, Подразделение, Автор)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("тзШтрихкоды", тзШтрихкодыШтучной);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тзШтрихкоды.Номенклатура КАК Номенклатура,
	|	тзШтрихкоды.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ втШтрихкод
	|ИЗ
	|	&тзШтрихкоды КАК тзШтрихкоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втШтрихкод.Номенклатура КАК Номенклатура,
	|	втШтрихкод.Штрихкод КАК Штрихкод,
	|	Штрихкоды.Объект КАК Объект
	|ИЗ
	|	втШтрихкод КАК втШтрихкод
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ПО втШтрихкод.Номенклатура = Штрихкоды.Объект
	|			И втШтрихкод.Штрихкод = Штрихкоды.Штрихкод
	|ГДЕ
	|	Штрихкоды.Штрихкод ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Задание = Документы.итЗаданиеНаДобавлениеНовыхШК.СоздатьДокумент();
		Задание.Организация = Подразделение.Организация;
		Задание.Дата = ТекущаяДата();
		Задание.ДатаСоздания = ТекущаяДата();
		Задание.ПодразделениеКомпании = Подразделение;
		Задание.Автор = Автор;
		Задание.УстановитьНовыйНомер();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НовСтр = Задание.НовыеШтрихкоды.Добавить();
			НовСтр.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			НовСтр.Штрихкод = ВыборкаДетальныеЗаписи.Штрихкод;		
		КонецЦикла;
		
		Задание.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ВыполнитьКонтрольОстаткаПоЗаказу(ПоступлениеТоваров, тзТоварыПоступления)
	
	ТекстОшибкиОстатков = "";

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыПоступления.Номенклатура КАК Номенклатура,
	|	ТоварыПоступления.Количество КАК Количество
	|ПОМЕСТИТЬ втТоварыПоступления
	|ИЗ
	|	&ТоварыПоступления КАК ТоварыПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток КАК ЗаказаноОстаток
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(, ЗаказПоставщику = &ЗаказПоставщику) КАК ЗаказыПоставщикамОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТоварыПоступления.Номенклатура КАК Номенклатура,
	|	втТоварыПоступления.Количество КАК Количество,
	|	ЕСТЬNULL(втОстатки.ЗаказаноОстаток, 0) КАК Остаток
	|ПОМЕСТИТЬ втВременнаяТаблица
	|ИЗ
	|	втТоварыПоступления КАК втТоварыПоступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстатки КАК втОстатки
	|		ПО втТоварыПоступления.Номенклатура = втОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВременнаяТаблица.Номенклатура КАК Номенклатура,
	|	втВременнаяТаблица.Количество КАК Количество,
	|	втВременнаяТаблица.Остаток КАК Остаток
	|ИЗ
	|	втВременнаяТаблица КАК втВременнаяТаблица
	|ГДЕ
	|	втВременнаяТаблица.Количество > втВременнаяТаблица.Остаток";
	
	Запрос.УстановитьПараметр("ЗаказПоставщику",   ПоступлениеТоваров.ДокументОснование);
	Запрос.УстановитьПараметр("ТоварыПоступления", тзТоварыПоступления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТекстОшибкиОстатков <> "" Тогда
			ТекстОшибкиОстатков = ТекстОшибкиОстатков + "
									|";
		КонецЕсли;	
		ТекстОшибкиОстатков = ТекстОшибкиОстатков + "По номенклатуре <" + Строка(ВыборкаДетальныеЗаписи.Номенклатура) + "> осталось принять по заказу <" + Строка(ВыборкаДетальныеЗаписи.Остаток) + "> меньше чем на ТСД <" +  Строка(ВыборкаДетальныеЗаписи.Количество) + ">";
	КонецЦикла;
	
	Возврат ТекстОшибкиОстатков;
			
КонецФункции

#КонецОбласти

#Область ЗаказыПокупателей

Функция ПолучитьТоварыДляСборки(СсылкаПодразделениеКомпании, ТекстОшибки)
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	ТекстОшибки = "";
	Если ПодразделениеКомпании.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	СкладПикинга = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.СкладПикинга, ПодразделениеКомпании);
	
	Если НЕ ЗначениеЗаполнено(СкладПикинга) Тогда
		ТекстОшибки = "Для подразделения <"+ПодразделениеКомпании+"> не настроен склад пикинга";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("СкладПикинга", СкладПикинга);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СостоянияВыполненияЗаказовПокупателей.Заказ КАК Заказ
	|ПОМЕСТИТЬ
	|	ТаблицаЗаказов
	|ИЗ
	|	РегистрСведений.СостоянияВыполненияЗаказовПокупателей КАК СостоянияВыполненияЗаказовПокупателей
	|ГДЕ
	|	СостоянияВыполненияЗаказовПокупателей.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВыполненияЗаказовПокупателей.Согласован) ИЛИ 
	|	СостоянияВыполненияЗаказовПокупателей.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВыполненияЗаказовПокупателей.СборкаЗаказа)
	//|	СостоянияВыполненияЗаказовПокупателей.Заказ.ПодразделениеКомпании = &ПодразделениеКомпании
	//|	НачалоПериода(СостоянияВыполненияЗаказовПоставщикам.Заказ.Дата, День) = &Дата
	|;
	|
	|ВЫБРАТЬ
	|	ЗаказыПокупателей.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказыПокупателей.Количество) КАК Количество
	|ПОМЕСТИТЬ
	|	ТаблицаТовары
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыПокупателейОстатки.ЗаказаноОстаток-ЗаказыПокупателейОстатки.РезервОстаток КАК Количество
	|	ИЗ
	|		ТаблицаЗаказов КАК ТаблицаЗаказов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ЗаказыПокупателей.Остатки(, Заказ В (ВЫБРАТЬ Заказ ИЗ ТаблицаЗаказов)) КАК ЗаказыПокупателейОстатки
	|	ПО
	|		ТаблицаЗаказов.Заказ = ЗаказыПокупателейОстатки.Заказ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиТоваровКомпании.Номенклатура КАК Номенклатура,
	|		-(ОстаткиТоваровКомпании.КоличествоОстаток-ОстаткиТоваровКомпании.РезервОстаток) КАК Количество
	|	ИЗ
	|		РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, СкладКомпании = &СкладПикинга) КАК ОстаткиТоваровКомпании
	|ГДЕ
	|	(ОстаткиТоваровКомпании.КоличествоОстаток-ОстаткиТоваровКомпании.РезервОстаток)>0) КАК ЗаказыПокупателей
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПокупателей.Номенклатура
	|ИМЕЮЩИЕ
	|	СУММА(ЗаказыПокупателей.Количество)>0
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ШтрихКоды.ЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
	|	ШтрихКоды.Штрихкод КАК Штрихкод
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
	|ПО
	|	ТаблицаТовары.Номенклатура = ШтрихКоды.Объект И 
	|	ШтрихКоды.Запрет = ЛОЖЬ
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Номенклатура.Код КАК НоменклатураКод,
	|	ТаблицаТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ТаблицаТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	ТаблицаТовары.Номенклатура.ИерархияАльтернативная КАК Родитель,
	|	ТаблицаТовары.Номенклатура.ИерархияАльтернативная.Код КАК РодительКод,
	|	ТаблицаТовары.Номенклатура.ИерархияАльтернативная.Наименование КАК РодительНаименование,
	|	ТаблицаТовары.Количество КАК Количество
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|";
	
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	РезультатЗапроса = ПакетыЗапросов[ПакетыЗапросов.Количество()-1];
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ВыборкаШтрихкоды = ПакетыЗапросов[ПакетыЗапросов.Количество()-2].Выбрать();
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	//ЗаписатьОбъектXML(ЗаписьXML, Данные);
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Товары"); // ТоварнаяСтрока
		ЗаписьXML.ЗаписатьАтрибут("Количество", Формат(Выборка.Количество, "ЧРД=.; ЧН=0; ЧГ="));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
		ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Номенклатура));
		ЗаписьXML.ЗаписатьАтрибут("Код", Выборка.НоменклатураКод);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.НоменклатураНаименование);
		ЗаписьXML.ЗаписатьАтрибут("Артикул", Выборка.НоменклатураАртикул);
		ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Ложь");
		Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель"); // Родитель
			ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Родитель));
			ЗаписьXML.ЗаписатьАтрибут("Код", Выборка.РодительКод);
			ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.РодительНаименование);
			ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Истина");
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
		Иначе
			ЗаписьXML.ЗаписатьАтрибут("Родитель", "");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
	КонецЦикла;
	
	Пока ВыборкаШтрихкоды.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ШтрихКоды"); // ТоварнаяСтрока
		
		ЗаписьXML.ЗаписатьАтрибут("Штрихкод", ВыборкаШтрихкоды.Штрихкод);
		ЗаписьXML.ЗаписатьАтрибут("Коэффициент", Формат(ВыборкаШтрихкоды.Коэффициент, "ЧРД=.; ЧН=0; ЧГ="));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
		ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаШтрихкоды.Номенклатура));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
	
	ЗаписьXML.Закрыть();
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция ПеремещениеВСкладСборки(СсылкаПодразделениеКомпании, ШтрихКод, ПараметрыОбмена, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи).ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	Пользователь = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
			ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
		Возврат Ложь;
	КонецЕсли;
	
	СкладПикинга        = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.СкладПикинга, ПодразделениеКомпании);
	СкладПодбораТоваров = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.СкладПодбораТоваров, ПодразделениеКомпании);
	
	Если Не ЗначениеЗаполнено(СкладПодбораТоваров) Тогда
		ТекстОшибки = "Для подразделения <"+ПодразделениеКомпании+"> не задан склад подбора товаров. Настройте учетную политику";
		Возврат Ложь
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СкладПикинга) Тогда
		ТекстОшибки = "Для подразделения <"+ПодразделениеКомпании+"> не задан склад пикинга. Настройте учетную политику";
		Возврат Ложь
	КонецЕсли;
	
	ДанныеОбмена = ПараметрыОбмена.Получить().ДанныеОбмена;
	
	ТаблицаТоваров = ПолучитьДанныеОбмена(ДанныеОбмена);
	СписокТоваров = ПолучитьСписокИзXDTO(ТаблицаТоваров.Товары);
	Если СписокТоваров.Количество()=0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДокументОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ДокументОбъект.Заполнить(Неопределено);
	ДокументОбъект.Автор = Пользователь;
	ДокументОбъект.ХозОперация           = Справочники.ХозОперации.ПеремещениеТоваров;
	ДокументОбъект.ПодразделениеКомпании = ПодразделениеКомпании;
	
	Документы.ПеремещениеТоваров.ПодразделениеКомпанииПриИзменении(ДокументОбъект);
	ДокументОбъект.СкладКомпании   = СкладПодбораТоваров;
	Документы.ПеремещениеТоваров.СкладКомпанииПриИзменении(ДокументОбъект);
	ДокументОбъект.СкладПолучатель = СкладПикинга;
	Документы.ПеремещениеТоваров.СкладПолучательПриИзменении(ДокументОбъект);
	
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		
		Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Номенклатура.Ссылка);
		Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
		
		ТоварнаяСтрока = ДокументОбъект.Товары.Найти(Номенклатура, "Номенклатура");
		Если ТоварнаяСтрока = Неопределено Тогда
			ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
			ТоварнаяСтрока.Номенклатура = Номенклатура;
			ТоварнаяСтрока.Количество   = Число(ТекущаяСтрока.Количество);
			Документы.ПеремещениеТоваров.ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока);
		Иначе
			ТоварнаяСтрока.Количество   = ТоварнаяСтрока.Количество + Число(ТекущаяСтрока.Количество);
			Документы.ПеремещениеТоваров.ТоварыКоличествоПриИзменении(ДокументОбъект, ТоварнаяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	ДокументОбъект.УстановитьНовыйНомер();
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	ДокументОбъект.ОбменДанными.Загрузка = Ложь;
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Документ <"+Строка(ДокументОбъект.Ссылка)+"> не проведен!
		|"+ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	//НаборЗаписей = РегистрыСведений.СостоянияВыполненияЗаказовПоставщикам.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Заказ.Установить(ДокументОбъект.Ссылка);
	//НаборЗаписей.Прочитать();
	//
	//Если НаборЗаписей.Количество() = 0 Тогда
	//	Запись = НаборЗаписей.Добавить();
	//Иначе
	//	Запись = НаборЗаписей[0];
	//КонецЕсли;
	//
	//Запись.Заказ     = ДокументОбъект.Ссылка;
	//Запись.Состояние = Перечисления.СостоянияВыполненияЗаказовПоставщикам.Согласован;
	//НаборЗаписей.ОбменДанными.Загрузка = Истина;
	//
	//НаборЗаписей.Записать(ИСТИНА);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

Функция СоздатьЗаданиеНаСборку(СсылкаПодразделениеКомпании, Штрихкод, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи).ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	Пользователь = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
			Результат = СформироватьДанныеПередачи(Неопределено);
			Возврат Результат;
		КонецЕсли;
		Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
			ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
			Результат = СформироватьДанныеПередачи(Неопределено);
			Возврат Результат;
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	Оператор = Пользователь.Сотрудник;
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		ТекстОшибки = "У пользователя <"+Пользователь+"> не указан сотрудник";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	СкладПикинга = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.СкладПикинга, ПодразделениеКомпании);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("СкладПикинга", СкладПикинга);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СостоянияВыполненияЗаказовПокупателей.Заказ КАК Заказ
	|ПОМЕСТИТЬ
	|	ТаблицаЗаказов
	|ИЗ
	|	РегистрСведений.СостоянияВыполненияЗаказовПокупателей КАК СостоянияВыполненияЗаказовПокупателей
	|ГДЕ
	|	СостоянияВыполненияЗаказовПокупателей.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВыполненияЗаказовПокупателей.Согласован)
	|;
	|
	|ВЫБРАТЬ
	|	ЗаказыПокупателейОстатки.Заказ,
	|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗаказыПокупателейОстатки.ЗаказаноОстаток-ЗаказыПокупателейОстатки.РезервОстаток КАК Количество
	|ПОМЕСТИТЬ
	|	ТаблицаТоварыЗаказов
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(, Заказ В (ВЫБРАТЬ Заказ ИЗ ТаблицаЗаказов)) КАК ЗаказыПокупателейОстатки
	|ГДЕ
	|	ЗаказыПокупателейОстатки.ЗаказаноОстаток-ЗаказыПокупателейОстатки.РезервОстаток > 0
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&СкладПикинга КАК СкладКомпании,
	|	ТаблицаТоварыЗаказов.Номенклатура КАК Номенклатура,
	|	ТаблицаТоварыЗаказов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ
	|	ТаблицаТовары
	|ИЗ
	|	ТаблицаТоварыЗаказов КАК ТаблицаТоварыЗаказов
	|;
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	|ПОМЕСТИТЬ
	|	ОстаткиТоваровКомпании
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиТоваровКомпании.Номенклатура КАК Номенклатура,
	|		ОстаткиТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ОстаткиТоваровКомпании.КоличествоОстаток-ОстаткиТоваровКомпании.РезервОстаток КАК Количество
	|	ИЗ
	|		РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, (СкладКомпании, Номенклатура, ХарактеристикаНоменклатуры) В (ВЫБРАТЬ СкладКомпании, Номенклатура, ХарактеристикаНоменклатуры ИЗ ТаблицаТовары)) КАК ОстаткиТоваровКомпании
	|	ГДЕ
	|		(ОстаткиТоваровКомпании.КоличествоОстаток-ОстаткиТоваровКомпании.РезервОстаток)>0
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		СборкаЗаказовПокупателей.Номенклатура КАК Номенклатура,
	//|		СборкаЗаказовПокупателей.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//|		-(СборкаЗаказовПокупателей.ЗаказаноОстаток-СборкаЗаказовПокупателей.УпакованоОстаток)
	//|	ИЗ
	//|		РегистрНакопления.СборкаЗаказовПокупателей.Остатки(, (СкладКомпании, Номенклатура, ХарактеристикаНоменклатуры) В (ВЫБРАТЬ СкладКомпании, Номенклатура, ХарактеристикаНоменклатуры ИЗ ТаблицаТовары)) КАК СборкаЗаказовПокупателей
	//|) КАК ВложенныйЗапрос
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СборкаЗаказаПокупателя.Номенклатура КАК Номенклатура,
	|		СборкаЗаказаПокупателя.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		-СУММА(СборкаЗаказаПокупателя.Количество) КАК Количество
	|	ИЗ
	|		РегистрСведений.СборкаЗаказаПокупателя КАК СборкаЗаказаПокупателя
	|	ГДЕ
	|		(СборкаЗаказаПокупателя.СкладКомпании, СборкаЗаказаПокупателя.Номенклатура, СборкаЗаказаПокупателя.ХарактеристикаНоменклатуры) В (ВЫБРАТЬ СкладКомпании, Номенклатура, ХарактеристикаНоменклатуры ИЗ ТаблицаТовары)
	|	СГРУППИРОВАТЬ ПО
	|		СборкаЗаказаПокупателя.Номенклатура,
	|		СборкаЗаказаПокупателя.ХарактеристикаНоменклатуры) КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.Количество)>0
	|;
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаТоварыЗаказов.Заказ КАК Заказ,
	|	МАКСИМУМ(ТаблицаТоварыЗаказов.КоличествоЗаказа) КАК КоличествоЗаказа,
	|	МАКСИМУМ(ТаблицаТоварыЗаказов.Количество) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаТоварыЗаказов.Заказ КАК Заказ,
	|		ТаблицаТоварыЗаказов.Номенклатура КАК Номенклатура,
	|		ТаблицаТоварыЗаказов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		СУММА(ТаблицаТоварыЗаказов.Количество) КАК КоличествоЗаказа,
	|		СУММА(ТаблицаТоварыЗаказов.Количество-ЕСТЬNULL(ОстаткиТоваровКомпании.Количество, 0)) КАК Количество
	|	ИЗ
	|		ТаблицаТоварыЗаказов КАК ТаблицаТоварыЗаказов
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
	|	ПО
	|		ТаблицаТоварыЗаказов.Номенклатура = ОстаткиТоваровКомпании.Номенклатура И 
	|		ТаблицаТоварыЗаказов.ХарактеристикаНоменклатуры = ОстаткиТоваровКомпании.ХарактеристикаНоменклатуры
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаТоварыЗаказов.Заказ,
	|		ТаблицаТоварыЗаказов.Номенклатура,
	|		ТаблицаТоварыЗаказов.ХарактеристикаНоменклатуры) КАК ТаблицаТоварыЗаказов
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоварыЗаказов.Заказ,
	|	ТаблицаТоварыЗаказов.Номенклатура
	//|ИМЕЮЩИЕ
	//|	МАКСИМУМ(ТаблицаТоварыЗаказов.Количество)<=0
	|УПОРЯДОЧИТЬ ПО
	|	Количество,
	|	КоличествоЗаказа УБЫВ
	|";
	
	Заказ = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Заказ = Выборка.Заказ;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Заказ) Тогда
		ТекстОшибки = "Для нет свободных заказов";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		
		НачатьТранзакцию();
		
		СборкаЗаказаПокупателя = Документы.СборкаЗаказаПокупателя.СоздатьДокумент();
		СборкаЗаказаПокупателя.Заполнить(Заказ);
		СборкаЗаказаПокупателя.ПодразделениеКомпании    = ПодразделениеКомпании;
		Документы.СборкаЗаказаПокупателя.ПодразделениеКомпанииПриИзменении(СборкаЗаказаПокупателя);
		СборкаЗаказаПокупателя.ПодразделениеОтправитель = ПодразделениеКомпании;
		СборкаЗаказаПокупателя.СкладКомпании            = СкладПикинга;
		СборкаЗаказаПокупателя.Оператор                 = Оператор;
		Документы.СборкаЗаказаПокупателя.СкладКомпанииПриИзменении(СборкаЗаказаПокупателя);
		СборкаЗаказаПокупателя.Автор = Пользователь;
		
		СборкаЗаказаПокупателя.Записать(РежимЗаписиДокумента.Проведение);
		
		НаборЗаписей = РегистрыСведений.СостоянияВыполненияЗаказовПокупателей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заказ.Установить(Заказ);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		
		Запись.Заказ     = Заказ;
		Запись.Состояние = Перечисления.СостоянияВыполненияЗаказовПокупателей.СборкаЗаказа;
		НаборЗаписей.Записать(Истина);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Регистратор", СборкаЗаказаПокупателя.Ссылка);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	СборкаЗаказаПокупателя.Регистратор КАК СборкаЗаказа,
		|	СборкаЗаказаПокупателя.ЗаказПокупателя КАК Заказ,
		|	СборкаЗаказаПокупателя.Номенклатура КАК Номенклатура,
		|	СборкаЗаказаПокупателя.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(СборкаЗаказаПокупателя.Доступно) КАК Доступно,
		|	СУММА(СборкаЗаказаПокупателя.Количество) КАК Количество
		|ПОМЕСТИТЬ
		|	ТаблицаТоварыЗаказов
		|ИЗ
		|	РегистрСведений.СборкаЗаказаПокупателя КАК СборкаЗаказаПокупателя
		|ГДЕ
		|	СборкаЗаказаПокупателя.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	СборкаЗаказаПокупателя.Номенклатура,
		|	СборкаЗаказаПокупателя.ХарактеристикаНоменклатуры,
		|	СборкаЗаказаПокупателя.Регистратор,
		|	СборкаЗаказаПокупателя.ЗаказПокупателя
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ШтрихКоды.ЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
		|	ШтрихКоды.Штрихкод КАК Штрихкод
		|ИЗ
		|	ТаблицаТоварыЗаказов КАК ТаблицаТовары
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ПО
		|	ТаблицаТовары.Номенклатура = ШтрихКоды.Объект И 
		|	ШтрихКоды.Запрет = ЛОЖЬ
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаТовары.СборкаЗаказа КАК СборкаЗаказа,
		|	ТаблицаТовары.СборкаЗаказа.Номер КАК СборкаЗаказаНомер,
		|	ТаблицаТовары.СборкаЗаказа.Дата КАК СборкаЗаказаДата,
		|	ТаблицаТовары.СборкаЗаказа.КоличествоПакетов КАК СборкаЗаказаПакет,
		|	ТаблицаТовары.Заказ КАК Заказ,
		|	ТаблицаТовары.Заказ.Номер КАК ЗаказНомер,
		|	ТаблицаТовары.Заказ.Дата КАК ЗаказДата,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.Номенклатура.Код КАК НоменклатураКод,
		|	ТаблицаТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	ТаблицаТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
		|	ТаблицаТовары.Номенклатура.ИерархияАльтернативная КАК Родитель,
		|	ТаблицаТовары.Номенклатура.ИерархияАльтернативная.Код КАК РодительКод,
		|	ТаблицаТовары.Номенклатура.ИерархияАльтернативная.Наименование КАК РодительНаименование,
		|	ТаблицаТовары.Номенклатура.ТоварноеСоседство КАК ТоварноеСоседство,
		|	ТаблицаТовары.Номенклатура.ТоварноеСоседство.Код КАК ТоварноеСоседствоКод,
		|	ТаблицаТовары.Номенклатура.ТоварноеСоседство.Наименование КАК ТоварноеСоседствоНаименование,
		|	ТаблицаТовары.Доступно КАК Доступно,
		|	ТаблицаТовары.Количество КАК Количество
		|ИЗ
		|	ТаблицаТоварыЗаказов КАК ТаблицаТовары
		|ИТОГИ
		|	МАКСИМУМ(Заказ),
		|	МАКСИМУМ(ЗаказНомер),
		|	МАКСИМУМ(ЗаказДата)
		|ПО
		|	СборкаЗаказа
		|";
		
		ПакетыЗапросов = Запрос.ВыполнитьПакет();
		РезультатЗапроса = ПакетыЗапросов[ПакетыЗапросов.Количество()-1];
		Если РезультатЗапроса.Пустой() Тогда
			ТекстОшибки = "Под заказ не подобран товар";
			Результат = СформироватьДанныеПередачи(Неопределено);
			ОтменитьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		ВыборкаШтрихкоды = ПакетыЗапросов[ПакетыЗапросов.Количество()-2].Выбрать();
		
		ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
		
		ВыборкаЗаказ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаЗаказ.Следующий() Тогда
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Заказ"); // Заказ
			ЗаписьXML.ЗаписатьАтрибут("Тип", "ЗаказПокупателя");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаЗаказ.Заказ));
			ЗаписьXML.ЗаписатьАтрибут("Номер", ВыборкаЗаказ.ЗаказНомер);
			ЗаписьXML.ЗаписатьАтрибут("Дата",  Строка(ВыборкаЗаказ.ЗаказДата));
			//ЗаписьXML.ЗаписатьАтрибут("Представление", "Заказ № " + ВыборкаЗаказ.ЗаказНомер + " от " + Формат(ВыборкаЗаказ.ЗаказДата, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьАтрибут("Представление", "№ " + ВыборкаЗаказ.ЗаказНомер + " от " + Формат(ВыборкаЗаказ.ЗаказДата, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Заказ
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("СборкаЗаказа"); // Сборка
			ЗаписьXML.ЗаписатьАтрибут("Тип", "СборкаЗаказаПокупателя");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаЗаказ.СборкаЗаказа));
			ЗаписьXML.ЗаписатьАтрибут("Номер",  ВыборкаЗаказ.СборкаЗаказаНомер);
			ЗаписьXML.ЗаписатьАтрибут("Дата",   Строка(ВыборкаЗаказ.СборкаЗаказаДата));
			ЗаписьXML.ЗаписатьАтрибут("Пакет",  Формат(ВыборкаЗаказ.СборкаЗаказаПакет, "ЧГ=0"));
			//ЗаписьXML.ЗаписатьАтрибут("Представление", "Сборка заказа № " + ВыборкаЗаказ.СборкаЗаказаНомер + " от " + Формат(ВыборкаЗаказ.СборкаЗаказаДата, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьАтрибут("Представление", "№ " + ВыборкаЗаказ.СборкаЗаказаНомер + " от " + Формат(ВыборкаЗаказ.СборкаЗаказаДата, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Сборка
			
			Выборка = ВыборкаЗаказ.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("Товары"); // ТоварнаяСтрока
				ЗаписьXML.ЗаписатьАтрибут("Количество", Формат(Выборка.Количество, "ЧРД=.; ЧН=0; ЧГ="));
				ЗаписьXML.ЗаписатьАтрибут("Доступно",   Формат(Выборка.Доступно, "ЧРД=.; ЧН=0; ЧГ="));
				ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
				ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
				ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.Номенклатура));
				ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.НоменклатураКод);
				ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.НоменклатураНаименование);
				ЗаписьXML.ЗаписатьАтрибут("Артикул",      Выборка.НоменклатураАртикул);
				ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа",    "Ложь");
				Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель"); // Родитель
					ЗаписьXML.ЗаписатьАтрибут("Тип",          "Номенклатура");
					ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.Родитель));
					ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.РодительКод);
					ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.РодительНаименование);
					ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа",    "Истина");
					ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
				Иначе
					ЗаписьXML.ЗаписатьАтрибут("Родитель", "");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.ТоварноеСоседство) Тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("ТоварноеСоседство"); // Родитель
					ЗаписьXML.ЗаписатьАтрибут("Тип",          "ТоварноеСоседство");
					ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.ТоварноеСоседство));
					ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.ТоварноеСоседствоКод);
					ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.ТоварноеСоседствоНаименование);
					ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
				Иначе
					ЗаписьXML.ЗаписатьАтрибут("ТоварноеСоседство", "");
				КонецЕсли;
				
				ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
				ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
			КонецЦикла;
			//ЗаписьXML.ЗаписатьКонецЭлемента(); // Товары
			
		КонецЕсли;
		
		Пока ВыборкаШтрихкоды.Следующий() Цикл
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ШтрихКоды"); // ТоварнаяСтрока
			
			ЗаписьXML.ЗаписатьАтрибут("Штрихкод", ВыборкаШтрихкоды.Штрихкод);
			ЗаписьXML.ЗаписатьАтрибут("Коэффициент", Формат(ВыборкаШтрихкоды.Коэффициент, "ЧРД=.; ЧН=0; ЧГ="));
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
			ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаШтрихкоды.Номенклатура));
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
			
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
		
		ЗаписьXML.Закрыть();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат = СформироватьДанныеПередачи(Неопределено);
		ОтменитьТранзакцию();
		Возврат Результат;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеСборки(СсылкаПодразделениеКомпании, СсылкаСборку, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаСборку);
	СборкаЗаказаПокупателя = Документы.СборкаЗаказаПокупателя.ПолучитьСсылку(Идентификатор);
	
	Если СборкаЗаказаПокупателя.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	//СкладПикинга = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.СкладПикинга, ПодразделениеКомпании);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор",  СборкаЗаказаПокупателя);
	Запрос.УстановитьПараметр("Заказ",        СборкаЗаказаПокупателя.ДокументОснование);
	//Запрос.УстановитьПараметр("СкладПикинга", СкладПикинга);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СборкаЗаказаПокупателя.Номенклатура КАК Номенклатура,
	|	СборкаЗаказаПокупателя.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(СборкаЗаказаПокупателя.Количество) КАК Количество,
	|	СУММА(СборкаЗаказаПокупателя.Доступно) КАК Доступно
	|ПОМЕСТИТЬ
	|	СборкаЗаказаПокупателя
	|ИЗ
	|	РегистрСведений.СборкаЗаказаПокупателя КАК СборкаЗаказаПокупателя
	|ГДЕ
	|	СборкаЗаказаПокупателя.Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО
	|	СборкаЗаказаПокупателя.Номенклатура,
	|	СборкаЗаказаПокупателя.ХарактеристикаНоменклатуры
	|;
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	//,
	//|	СУММА(ВложенныйЗапрос.Доступно) КАК Доступно
	|ИЗ
	|	(ВЫБРАТЬ
	|		СборкаЗаказаПокупателя.Номенклатура КАК Номенклатура,
	|		СборкаЗаказаПокупателя.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		-СборкаЗаказаПокупателя.Количество КАК Количество
	|	ИЗ
	|		СборкаЗаказаПокупателя КАК СборкаЗаказаПокупателя
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ЗаказыПокупателейОстатки.ЗаказаноОстаток-ЗаказыПокупателейОстатки.РезервОстаток
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей.Остатки(, Заказ=&Заказ) КАК ЗаказыПокупателейОстатки
	|	ГДЕ
	|		ЗаказыПокупателейОстатки.ЗаказаноОстаток-ЗаказыПокупателейОстатки.РезервОстаток > 0
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		ОстаткиТоваровКомпании.Номенклатура КАК Номенклатура,
	//|		ОстаткиТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//|		0,
	//|		ОстаткиТоваровКомпании.КоличествоОстаток-ОстаткиТоваровКомпании.РезервОстаток
	//|	ИЗ
	//|		РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, (СкладКомпании, Номенклатура, ХарактеристикаНоменклатуры) В (ВЫБРАТЬ СкладКомпании, Номенклатура, ХарактеристикаНоменклатуры ИЗ СборкаЗаказаПокупателя)) КАК ОстаткиТоваровКомпании
	//|	ГДЕ
	//|		(ОстаткиТоваровКомпании.КоличествоОстаток-ОстаткиТоваровКомпании.РезервОстаток)>0
	|) КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры
	|ИМЕЮЩИЕ
	|	(НЕ СУММА(ВложенныйЗапрос.Количество)=0)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Попытка
		
		НачатьТранзакцию();
		
		ОбъектСборкаЗаказа = СборкаЗаказаПокупателя.ПолучитьОбъект();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Количество > 0 Тогда
				НайденныеСтроки = ОбъектСборкаЗаказа.Товары.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Пакет", Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры, 0));
				Если НайденныеСтроки.Количество() = 0 Тогда
					НоваяСтрока = ОбъектСборкаЗаказа.Товары.Добавить();
					НоваяСтрока.Номенклатура = Выборка.Номенклатура;
					Документы.СборкаЗаказаПокупателя.ТоварыНоменклатураПриИзменении(ОбъектСборкаЗаказа, НоваяСтрока);
					НоваяСтрока.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
					Документы.СборкаЗаказаПокупателя.ТоварыХарактеристикаНоменклатурыПриИзменении(ОбъектСборкаЗаказа, НоваяСтрока);
					НоваяСтрока.Количество = Выборка.Количество;
				Иначе
					НайденныеСтроки[0].Количество = НайденныеСтроки[0].Количество+Выборка.Количество;
				КонецЕсли;
			Иначе
				КоличествоКУдалению = -Выборка.Количество;
				
				НайденныеСтроки = ОбъектСборкаЗаказа.Товары.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Пакет", Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры, 0));
				
				Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
					
					КоличествоВСтроке = ТекущаяСтрока.Количество*ТекущаяСтрока.Коэффициент;
					
					Если КоличествоВСтроке <= КоличествоКУдалению Тогда
						ОбъектСборкаЗаказа.Товары.Удалить(ТекущаяСтрока);
						КоличествоКУдалению = КоличествоКУдалению - КоличествоВСтроке;
					Иначе
						ТекущаяСтрока.Количество = ТекущаяСтрока.Количество - КоличествоКУдалению/ТекущаяСтрока.Коэффициент;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
		ОбъектСборкаЗаказа.Записать(РежимЗаписиДокумента.Проведение);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Регистратор", СборкаЗаказаПокупателя.Ссылка);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	СборкаЗаказаПокупателя.Регистратор КАК СборкаЗаказа,
		|	СборкаЗаказаПокупателя.ЗаказПокупателя КАК Заказ,
		|	СборкаЗаказаПокупателя.Номенклатура КАК Номенклатура,
		|	СборкаЗаказаПокупателя.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(СборкаЗаказаПокупателя.Доступно) КАК Доступно,
		|	СУММА(СборкаЗаказаПокупателя.Количество) КАК Количество
		|ПОМЕСТИТЬ
		|	ТаблицаТоварыЗаказов
		|ИЗ
		|	РегистрСведений.СборкаЗаказаПокупателя КАК СборкаЗаказаПокупателя
		|ГДЕ
		|	СборкаЗаказаПокупателя.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	СборкаЗаказаПокупателя.Номенклатура,
		|	СборкаЗаказаПокупателя.ХарактеристикаНоменклатуры,
		|	СборкаЗаказаПокупателя.Регистратор,
		|	СборкаЗаказаПокупателя.ЗаказПокупателя
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ШтрихКоды.ЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
		|	ШтрихКоды.Штрихкод КАК Штрихкод
		|ИЗ
		|	ТаблицаТоварыЗаказов КАК ТаблицаТовары
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ПО
		|	ТаблицаТовары.Номенклатура = ШтрихКоды.Объект И 
		|	ШтрихКоды.Запрет = ЛОЖЬ
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаТовары.СборкаЗаказа КАК СборкаЗаказа,
		|	ТаблицаТовары.СборкаЗаказа.Номер КАК СборкаЗаказаНомер,
		|	ТаблицаТовары.СборкаЗаказа.Дата КАК СборкаЗаказаДата,
		|	ТаблицаТовары.СборкаЗаказа.КоличествоПакетов КАК СборкаЗаказаПакет,
		|	ТаблицаТовары.Заказ КАК Заказ,
		|	ТаблицаТовары.Заказ.Номер КАК ЗаказНомер,
		|	ТаблицаТовары.Заказ.Дата КАК ЗаказДата,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.Номенклатура.Код КАК НоменклатураКод,
		|	ТаблицаТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	ТаблицаТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
		|	ТаблицаТовары.Номенклатура.ИерархияАльтернативная КАК Родитель,
		|	ТаблицаТовары.Номенклатура.ИерархияАльтернативная.Код КАК РодительКод,
		|	ТаблицаТовары.Номенклатура.ИерархияАльтернативная.Наименование КАК РодительНаименование,
		|	ТаблицаТовары.Номенклатура.ТоварноеСоседство КАК ТоварноеСоседство,
		|	ТаблицаТовары.Номенклатура.ТоварноеСоседство.Код КАК ТоварноеСоседствоКод,
		|	ТаблицаТовары.Номенклатура.ТоварноеСоседство.Наименование КАК ТоварноеСоседствоНаименование,
		|	ТаблицаТовары.Доступно КАК Доступно,
		|	ТаблицаТовары.Количество КАК Количество
		|ИЗ
		|	ТаблицаТоварыЗаказов КАК ТаблицаТовары
		|ИТОГИ
		|	МАКСИМУМ(Заказ),
		|	МАКСИМУМ(ЗаказНомер),
		|	МАКСИМУМ(ЗаказДата)
		|ПО
		|	СборкаЗаказа
		|";
		
		ПакетыЗапросов = Запрос.ВыполнитьПакет();
		РезультатЗапроса = ПакетыЗапросов[ПакетыЗапросов.Количество()-1];
		Если РезультатЗапроса.Пустой() Тогда
			ТекстОшибки = "Под заказ не подобран товар";
			Результат = СформироватьДанныеПередачи(Неопределено);
			ОтменитьТранзакцию();
			Возврат Результат;
		КонецЕсли;
		
		ВыборкаШтрихкоды = ПакетыЗапросов[ПакетыЗапросов.Количество()-2].Выбрать();
		
		ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
		
		ВыборкаЗаказ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаЗаказ.Следующий() Тогда
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Заказ"); // Заказ
			ЗаписьXML.ЗаписатьАтрибут("Тип", "ЗаказПокупателя");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаЗаказ.Заказ));
			ЗаписьXML.ЗаписатьАтрибут("Номер", ВыборкаЗаказ.ЗаказНомер);
			ЗаписьXML.ЗаписатьАтрибут("Дата",  Строка(ВыборкаЗаказ.ЗаказДата));
			//ЗаписьXML.ЗаписатьАтрибут("Представление", "Заказ № " + ВыборкаЗаказ.ЗаказНомер + " от " + Формат(ВыборкаЗаказ.ЗаказДата, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьАтрибут("Представление", "№ " + ВыборкаЗаказ.ЗаказНомер + " от " + Формат(ВыборкаЗаказ.ЗаказДата, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Заказ
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("СборкаЗаказа"); // Сборка
			ЗаписьXML.ЗаписатьАтрибут("Тип", "СборкаЗаказаПокупателя");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаЗаказ.СборкаЗаказа));
			ЗаписьXML.ЗаписатьАтрибут("Номер",  ВыборкаЗаказ.СборкаЗаказаНомер);
			ЗаписьXML.ЗаписатьАтрибут("Дата",   Строка(ВыборкаЗаказ.СборкаЗаказаДата));
			ЗаписьXML.ЗаписатьАтрибут("Пакет",  Формат(ВыборкаЗаказ.СборкаЗаказаПакет, "ЧГ=0"));
			//ЗаписьXML.ЗаписатьАтрибут("Представление", "Сборка заказа № " + ВыборкаЗаказ.СборкаЗаказаНомер + " от " + Формат(ВыборкаЗаказ.СборкаЗаказаДата, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьАтрибут("Представление", "№ " + ВыборкаЗаказ.СборкаЗаказаНомер + " от " + Формат(ВыборкаЗаказ.СборкаЗаказаДата, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Сборка
			
			Выборка = ВыборкаЗаказ.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("Товары"); // ТоварнаяСтрока
				ЗаписьXML.ЗаписатьАтрибут("Количество", Формат(Выборка.Количество, "ЧРД=.; ЧН=0; ЧГ="));
				ЗаписьXML.ЗаписатьАтрибут("Доступно",   Формат(Выборка.Доступно, "ЧРД=.; ЧН=0; ЧГ="));
				ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
				ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
				ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.Номенклатура));
				ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.НоменклатураКод);
				ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.НоменклатураНаименование);
				ЗаписьXML.ЗаписатьАтрибут("Артикул",      Выборка.НоменклатураАртикул);
				ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа",    "Ложь");
				Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель"); // Родитель
					ЗаписьXML.ЗаписатьАтрибут("Тип",          "Номенклатура");
					ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.Родитель));
					ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.РодительКод);
					ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.РодительНаименование);
					ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа",    "Истина");
					ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
				Иначе
					ЗаписьXML.ЗаписатьАтрибут("Родитель", "");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.ТоварноеСоседство) Тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("ТоварноеСоседство"); // Родитель
					ЗаписьXML.ЗаписатьАтрибут("Тип",          "ТоварноеСоседство");
					ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.ТоварноеСоседство));
					ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.ТоварноеСоседствоКод);
					ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.ТоварноеСоседствоНаименование);
					ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
				Иначе
					ЗаписьXML.ЗаписатьАтрибут("ТоварноеСоседство", "");
				КонецЕсли;
				
				ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
				ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
			КонецЦикла;
			//ЗаписьXML.ЗаписатьКонецЭлемента(); // Товары
			
		КонецЕсли;
		
		Пока ВыборкаШтрихкоды.Следующий() Цикл
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ШтрихКоды"); // ТоварнаяСтрока
			
			ЗаписьXML.ЗаписатьАтрибут("Штрихкод", ВыборкаШтрихкоды.Штрихкод);
			ЗаписьXML.ЗаписатьАтрибут("Коэффициент", Формат(ВыборкаШтрихкоды.Коэффициент, "ЧРД=.; ЧН=0; ЧГ="));
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
			ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаШтрихкоды.Номенклатура));
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
			
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
		
		ЗаписьXML.Закрыть();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат = СформироватьДанныеПередачи(Неопределено);
		ОтменитьТранзакцию();
		Возврат Результат;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция ЗавершитьУпаковкуПакета(СсылкаПодразделениеКомпании, СсылкаСборку, СсылкаТоварноеСоседство, СтрокаПакет, ПараметрыОбмена, ТекстОшибки)
	
	ТекстОшибки = "";
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаСборку);
	СборкаЗаказаПокупателя = Документы.СборкаЗаказаПокупателя.ПолучитьСсылку(Идентификатор);
	
	Если СборкаЗаказаПокупателя.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаТоварноеСоседство);
	ТоварноеСоседство = Справочники.ТоварноеСоседство.ПолучитьСсылку(Идентификатор);
	
	Если ТоварноеСоседство.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	Пакет = Число(СтрокаПакет);
	Если Не ЗначениеЗаполнено(Пакет) Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ДанныеОбмена = ПараметрыОбмена.Получить().ДанныеОбмена;
	ТаблицаПакета = ПолучитьДанныеОбмена(ДанныеОбмена);
	
	Если ТаблицаПакета.Свойства().Получить("Товары") = Неопределено Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		
		НачатьТранзакцию();
		
		ОбъектСборкаЗаказа = СборкаЗаказаПокупателя.ПолучитьОбъект();
		
		Если ТипЗнч(ТаблицаПакета.Товары) = Тип("ОбъектXDTO") Тогда
			ПолученныеТовары = Новый Массив;
			ПолученныеТовары.Добавить(ТаблицаПакета.Товары);
		Иначе
			ПолученныеТовары = ТаблицаПакета.Товары;
		КонецЕсли;
		
		Для Каждого ТекущаяСтрока Из ПолученныеТовары Цикл
			
			Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Номенклатура.Ссылка);
			Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
			
			УпакованноеКоличество = Число(ТекущаяСтрока.Количество);
			СтрокиДляРаспределения = ОбъектСборкаЗаказа.Товары.НайтиСтроки(Новый Структура("Номенклатура, Пакет", Номенклатура, 0));
			Для Каждого СтрокаСборки Из СтрокиДляРаспределения Цикл
				
				Если УпакованноеКоличество = 0 Тогда
					Прервать;
				КонецЕсли;
				
				КоличествоВСтроке = СтрокаСборки.Количество*СтрокаСборки.Коэффициент;
				
				Если КоличествоВСтроке = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если УпакованноеКоличество<КоличествоВСтроке Тогда
					НоваяСтрока = ОбъектСборкаЗаказа.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСборки);
					
					НоваяСтрока.Количество = (КоличествоВСтроке-УпакованноеКоличество)/СтрокаСборки.Коэффициент;
					СтрокаСборки.Количество = СтрокаСборки.Количество - НоваяСтрока.Количество;
					СтрокаСборки.Пакет = Пакет;
					Прервать;
				Иначе
					СтрокаСборки.Пакет = Пакет;
					УпакованноеКоличество = УпакованноеКоличество - КоличествоВСтроке;
				КонецЕсли;
				
			КонецЦикла;
			
			Если УпакованноеКоличество>0 И СтрокиДляРаспределения.Количество()> 0 Тогда
				СтрокиДляРаспределения[0].Количество = СтрокиДляРаспределения[0].Количество+(УпакованноеКоличество/СтрокиДляРаспределения[0].Коэффициент);
				СтрокиДляРаспределения[0].Пакет = Пакет;
			КонецЕсли;
			
		КонецЦикла;
		
		СтрокаПакет = ОбъектСборкаЗаказа.Пакеты.Найти(Пакет, "Пакет");
		Если СтрокаПакет = Неопределено Тогда
			СтрокаПакет = ОбъектСборкаЗаказа.Пакеты.Добавить();
			СтрокаПакет.Пакет = Пакет;
			СтрокаПакет.ТоварноеСоседство = ТоварноеСоседство;
			СтрокаПакет.ШтрихКод = СсылкаСборку+"-"+Прав("000" + Формат(Пакет, "ЧН=0"), 3);
			СтрокаПакет.ДатаУпаковки = ТекущаяДатаСеанса();
		КонецЕсли;
		
		ОбъектСборкаЗаказа.Записать(РежимЗаписиДокумента.Проведение);
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ОбъектСборкаЗаказа);
		
		ПечатнаяФорма = ПечатьПакета(МассивОбъектов);
		
		ИмяВременногоФайлаПакета = ПолучитьИмяВременногоФайла("MXL");
		
		//ПечатнаяФорма.Записать(ИмяВременногоФайлаПакета, ТипФайлаТабличногоДокумента.PDF);
		ПечатнаяФорма.Записать(ИмяВременногоФайлаПакета, ТипФайлаТабличногоДокумента.MXL);
		
		//Если СразуНаПринтер Тогда
		//	Shell = Новый COMОбъект("Shell.Application");
		//	Shell.ShellExecute(ПутьФайла, "", "", "print", 0);
		//Иначе
		//	ЗапуститьПриложение(ИмяВременногоФайлаПакета);
		//КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Регистратор", СборкаЗаказаПокупателя.Ссылка);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	СборкаЗаказаПокупателя.Регистратор КАК СборкаЗаказа,
		|	СборкаЗаказаПокупателя.ЗаказПокупателя КАК Заказ,
		|	СборкаЗаказаПокупателя.Номенклатура КАК Номенклатура,
		|	СборкаЗаказаПокупателя.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(СборкаЗаказаПокупателя.Доступно) КАК Доступно,
		|	СУММА(СборкаЗаказаПокупателя.Количество) КАК Количество
		|ПОМЕСТИТЬ
		|	ТаблицаТоварыЗаказов
		|ИЗ
		|	РегистрСведений.СборкаЗаказаПокупателя КАК СборкаЗаказаПокупателя
		|ГДЕ
		|	СборкаЗаказаПокупателя.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	СборкаЗаказаПокупателя.Номенклатура,
		|	СборкаЗаказаПокупателя.ХарактеристикаНоменклатуры,
		|	СборкаЗаказаПокупателя.Регистратор,
		|	СборкаЗаказаПокупателя.ЗаказПокупателя
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ШтрихКоды.ЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
		|	ШтрихКоды.Штрихкод КАК Штрихкод
		|ИЗ
		|	ТаблицаТоварыЗаказов КАК ТаблицаТовары
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ПО
		|	ТаблицаТовары.Номенклатура = ШтрихКоды.Объект И 
		|	ШтрихКоды.Запрет = ЛОЖЬ
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаТовары.СборкаЗаказа КАК СборкаЗаказа,
		|	ТаблицаТовары.СборкаЗаказа.Номер КАК СборкаЗаказаНомер,
		|	ТаблицаТовары.СборкаЗаказа.Дата КАК СборкаЗаказаДата,
		|	ТаблицаТовары.СборкаЗаказа.КоличествоПакетов КАК СборкаЗаказаПакет,
		|	ТаблицаТовары.Заказ КАК Заказ,
		|	ТаблицаТовары.Заказ.Номер КАК ЗаказНомер,
		|	ТаблицаТовары.Заказ.Дата КАК ЗаказДата,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.Номенклатура.Код КАК НоменклатураКод,
		|	ТаблицаТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	ТаблицаТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
		|	ТаблицаТовары.Номенклатура.ИерархияАльтернативная КАК Родитель,
		|	ТаблицаТовары.Номенклатура.ИерархияАльтернативная.Код КАК РодительКод,
		|	ТаблицаТовары.Номенклатура.ИерархияАльтернативная.Наименование КАК РодительНаименование,
		|	ТаблицаТовары.Номенклатура.ТоварноеСоседство КАК ТоварноеСоседство,
		|	ТаблицаТовары.Номенклатура.ТоварноеСоседство.Код КАК ТоварноеСоседствоКод,
		|	ТаблицаТовары.Номенклатура.ТоварноеСоседство.Наименование КАК ТоварноеСоседствоНаименование,
		|	ТаблицаТовары.Доступно КАК Доступно,
		|	ТаблицаТовары.Количество КАК Количество
		|ИЗ
		|	ТаблицаТоварыЗаказов КАК ТаблицаТовары
		|ИТОГИ 
		|	МАКСИМУМ(Заказ),
		|	МАКСИМУМ(ЗаказНомер),
		|	МАКСИМУМ(ЗаказДата)
		|ПО
		|	СборкаЗаказа
		|";
		
		ПакетыЗапросов = Запрос.ВыполнитьПакет();
		РезультатЗапроса = ПакетыЗапросов[ПакетыЗапросов.Количество()-1];
		
		ВыборкаШтрихкоды = ПакетыЗапросов[ПакетыЗапросов.Количество()-2].Выбрать();
		
		ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
		
		ВыборкаЗаказ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаЗаказ.Следующий() Тогда
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Заказ"); // Заказ
			ЗаписьXML.ЗаписатьАтрибут("Тип", "ЗаказПокупателя");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаЗаказ.Заказ));
			ЗаписьXML.ЗаписатьАтрибут("Номер", ВыборкаЗаказ.ЗаказНомер);
			ЗаписьXML.ЗаписатьАтрибут("Дата",  Строка(ВыборкаЗаказ.ЗаказДата));
			//ЗаписьXML.ЗаписатьАтрибут("Представление", "Заказ № " + ВыборкаЗаказ.ЗаказНомер + " от " + Формат(ВыборкаЗаказ.ЗаказДата, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьАтрибут("Представление", "№ " + ВыборкаЗаказ.ЗаказНомер + " от " + Формат(ВыборкаЗаказ.ЗаказДата, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Заказ
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("СборкаЗаказа"); // Сборка
			ЗаписьXML.ЗаписатьАтрибут("Тип", "СборкаЗаказаПокупателя");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаЗаказ.СборкаЗаказа));
			ЗаписьXML.ЗаписатьАтрибут("Номер",  ВыборкаЗаказ.СборкаЗаказаНомер);
			ЗаписьXML.ЗаписатьАтрибут("Дата",   Строка(ВыборкаЗаказ.СборкаЗаказаДата));
			ЗаписьXML.ЗаписатьАтрибут("Пакет",  Формат(ВыборкаЗаказ.СборкаЗаказаПакет, "ЧГ=0"));
			//ЗаписьXML.ЗаписатьАтрибут("Представление", "Сборка заказа № " + ВыборкаЗаказ.СборкаЗаказаНомер + " от " + Формат(ВыборкаЗаказ.СборкаЗаказаДата, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьАтрибут("Представление", "№ " + ВыборкаЗаказ.СборкаЗаказаНомер + " от " + Формат(ВыборкаЗаказ.СборкаЗаказаДата, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Сборка
			
			Выборка = ВыборкаЗаказ.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("Товары"); // ТоварнаяСтрока
				ЗаписьXML.ЗаписатьАтрибут("Количество", Формат(Выборка.Количество, "ЧРД=.; ЧН=0; ЧГ="));
				ЗаписьXML.ЗаписатьАтрибут("Доступно",   Формат(Выборка.Доступно, "ЧРД=.; ЧН=0; ЧГ="));
				ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
				ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
				ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.Номенклатура));
				ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.НоменклатураКод);
				ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.НоменклатураНаименование);
				ЗаписьXML.ЗаписатьАтрибут("Артикул",      Выборка.НоменклатураАртикул);
				ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа",    "Ложь");
				Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель"); // Родитель
					ЗаписьXML.ЗаписатьАтрибут("Тип",          "Номенклатура");
					ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.Родитель));
					ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.РодительКод);
					ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.РодительНаименование);
					ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа",    "Истина");
					ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
				Иначе
					ЗаписьXML.ЗаписатьАтрибут("Родитель", "");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.ТоварноеСоседство) Тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("ТоварноеСоседство"); // Родитель
					ЗаписьXML.ЗаписатьАтрибут("Тип",          "ТоварноеСоседство");
					ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.ТоварноеСоседство));
					ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.ТоварноеСоседствоКод);
					ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.ТоварноеСоседствоНаименование);
					ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
				Иначе
					ЗаписьXML.ЗаписатьАтрибут("ТоварноеСоседство", "");
				КонецЕсли;
				
				ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
				ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
			КонецЦикла;
			//ЗаписьXML.ЗаписатьКонецЭлемента(); // Товары
		Иначе
			
			ПоляЗаказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектСборкаЗаказа.ДокументОснование, "Ссылка, Номер, Дата");
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Заказ"); // Заказ
			ЗаписьXML.ЗаписатьАтрибут("Тип", "ЗаказПокупателя");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ПоляЗаказа.Ссылка));
			ЗаписьXML.ЗаписатьАтрибут("Номер", ПоляЗаказа.Номер);
			ЗаписьXML.ЗаписатьАтрибут("Дата",  Строка(ПоляЗаказа.Дата));
			//ЗаписьXML.ЗаписатьАтрибут("Представление", "Заказ № " + ПоляЗаказа.Номер + " от " + Формат(ПоляЗаказа.Дата, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьАтрибут("Представление", "№ " + ПоляЗаказа.Номер + " от " + Формат(ПоляЗаказа.Дата, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Заказ
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("СборкаЗаказа"); // Сборка
			ЗаписьXML.ЗаписатьАтрибут("Тип", "СборкаЗаказаПокупателя");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ОбъектСборкаЗаказа.Ссылка));
			ЗаписьXML.ЗаписатьАтрибут("Номер",  ОбъектСборкаЗаказа.Номер);
			ЗаписьXML.ЗаписатьАтрибут("Дата",   Строка(ОбъектСборкаЗаказа.Дата));
			ЗаписьXML.ЗаписатьАтрибут("Пакет",  Формат(ОбъектСборкаЗаказа.КоличествоПакетов, "ЧГ=0"));
			//ЗаписьXML.ЗаписатьАтрибут("Представление", "Сборка заказа № " + ОбъектСборкаЗаказа.Номер + " от " + Формат(ОбъектСборкаЗаказа.Дата, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьАтрибут("Представление", "№ " + ОбъектСборкаЗаказа.Номер + " от " + Формат(ОбъектСборкаЗаказа.Дата, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Сборка
			
		КонецЕсли;
		
		Пока ВыборкаШтрихкоды.Следующий() Цикл
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ШтрихКоды"); // ТоварнаяСтрока
			
			ЗаписьXML.ЗаписатьАтрибут("Штрихкод", ВыборкаШтрихкоды.Штрихкод);
			ЗаписьXML.ЗаписатьАтрибут("Коэффициент", Формат(ВыборкаШтрихкоды.Коэффициент, "ЧРД=.; ЧН=0; ЧГ="));
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
			ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаШтрихкоды.Номенклатура));
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
			
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
		
		ЗаписьXML.Закрыть();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат = СформироватьДанныеПередачи(Неопределено);
		ОтменитьТранзакцию();
		Возврат Результат;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	ДанныеЭтикетки = Новый ДвоичныеДанные(ИмяВременногоФайлаПакета);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена",   ДанныеОбмена);
	ОтветСтруктура.Вставить("ДанныеЭтикетки", ДанныеЭтикетки);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция ЗавершитьСборкуЗаказа(СсылкаПодразделениеКомпании, СсылкаСборку, Штрихкод, Этикетка, ТекстОшибки)
	
	ТекстОшибки = "";
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи).ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	Пользователь = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
			ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
		Возврат Ложь;
	КонецЕсли;
	
	Оператор = Пользователь.Сотрудник;
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		ТекстОшибки = "У пользователя <"+Пользователь+"> не указан сотрудник";
		Возврат Ложь;
	КонецЕсли;
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаСборку);
	СборкаЗаказаПокупателя = Документы.СборкаЗаказаПокупателя.ПолучитьСсылку(Идентификатор);
	
	Если СборкаЗаказаПокупателя.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		
		НачатьТранзакцию();
		
		ОбъектСборкаЗаказа = СборкаЗаказаПокупателя.ПолучитьОбъект();
		ОбъектСборкаЗаказа.Укомплектован = Истина;
		ОбъектСборкаЗаказа.ОбменДанными.Загрузка = Истина;
		ОбъектСборкаЗаказа.Записать();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Заказ", ОбъектСборкаЗаказа.ДокументОснование);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ЗаказыПокупателейОстатки.Номенклатура,
		|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры,
		|	ЗаказыПокупателейОстатки.ЗаказаноОстаток КАК Заказано,
		|	ЗаказыПокупателейОстатки.РезервОстаток КАК Резерв,
		|	ЗаказыПокупателейОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.Остатки(,Заказ = &Заказ) КАК ЗаказыПокупателейОстатки
		|ГДЕ
		|	(НЕ ЗаказыПокупателейОстатки.ЗаказаноОстаток=ЗаказыПокупателейОстатки.РезервОстаток)
		|";
		
		ТаблицаКорректировки = Запрос.Выполнить().Выгрузить();
		Если ТаблицаКорректировки.Количество()>0 Тогда
			КорректирокаЗаказа = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
			КорректирокаЗаказа.Заполнить(ОбъектСборкаЗаказа.ДокументОснование);
			
			КорректирокаЗаказа.ПодразделениеКомпании    = ПодразделениеКомпании;
			Документы.КорректировкаЗаказаПокупателя.ПодразделениеКомпанииПриИзменении(СборкаЗаказаПокупателя);
			КорректирокаЗаказа.Автор = Пользователь;
			ЗаписатьКорректировку = Ложь;
			Для Каждого ТекущаяСтрока Из ТаблицаКорректировки Цикл
				
				КоличествоКорректироки = ТекущаяСтрока.Резерв-ТекущаяСтрока.Заказано;
				
				НайденныеСтроки = КорректирокаЗаказа.Товары.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ХарактеристикаНоменклатуры));
				Для Каждого СтрокаКорректировки Из НайденныеСтроки Цикл
					Если КоличествоКорректироки = 0 Тогда
						Прервать;
					КонецЕсли;
					
					Коэффициент = ?(СтрокаКорректировки.Коэффициент=0, 1, СтрокаКорректировки.Коэффициент);
					
					КоличествоСтроки     = СтрокаКорректировки.Количество*СтрокаКорректировки.Коэффициент;
					ОстатокКорректировки = КоличествоСтроки-КоличествоКорректироки;
					
					Если ОстатокКорректировки>=0 Тогда
						СтрокаКорректировки.Количество = СтрокаКорректировки.Количество + КоличествоКорректироки/Коэффициент;
						Документы.КорректировкаЗаказаПокупателя.ТоварыКоличествоПриИзменении(КорректирокаЗаказа, СтрокаКорректировки);
						ЗаписатьКорректировку = Истина;
						Прервать;
					Иначе
						СтрокаКорректировки.Количество = 0;
						КоличествоКорректироки = ОстатокКорректировки;
						Документы.КорректировкаЗаказаПокупателя.ТоварыКоличествоПриИзменении(КорректирокаЗаказа, СтрокаКорректировки);
					КонецЕсли;
					
					ЗаписатьКорректировку = Истина;
					
				КонецЦикла;
				
			КонецЦикла;
			
			Если ЗаписатьКорректировку Тогда
				КорректирокаЗаказа.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
		КонецЕсли;
		
		СчетНаОплату = Документы.СчетНаОплату.СоздатьДокумент();
		СчетНаОплату.Заполнить(ОбъектСборкаЗаказа.ДокументОснование);
		СчетНаОплату.ПодразделениеКомпании    = ПодразделениеКомпании;
		Документы.СчетНаОплату.ПодразделениеКомпанииПриИзменении(СчетНаОплату);
		СчетНаОплату.Автор = Пользователь;
		СчетНаОплату.Записать(РежимЗаписиДокумента.Запись);
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(СчетНаОплату);
		
		ПечатнаяФорма = ПечатьСчета(МассивОбъектов);
		
		ИмяВременногоФайлаСчета = ПолучитьИмяВременногоФайла("MXL");
		
		ПечатнаяФорма.Записать(ИмяВременногоФайлаСчета, ТипФайлаТабличногоДокумента.MXL);
		
		ДанныеЭтикетки = Новый ДвоичныеДанные(ИмяВременногоФайлаСчета);
		
		Этикетка = Новый ХранилищеЗначения(ДанныеЭтикетки, Новый СжатиеДанных(9));
		
		НаборЗаписей = РегистрыСведений.СостоянияВыполненияЗаказовПокупателей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заказ.Установить(ОбъектСборкаЗаказа.ДокументОснование);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		
		Запись.Заказ     = ОбъектСборкаЗаказа.ДокументОснование;
		Запись.Состояние = Перечисления.СостоянияВыполненияЗаказовПокупателей.ЗаказСобран;
		НаборЗаписей.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат = СформироватьДанныеПередачи(Неопределено);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьДанныеДляПеремещенияИзСборки(СсылкаПодразделениеКомпании, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	СкладПикинга = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.СкладПикинга, ПодразделениеКомпании);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СкладПикинга", СкладПикинга);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	               |ПОМЕСТИТЬ ОстаткиТоваровКомпании
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ОстаткиТоваровКомпании.Номенклатура КАК Номенклатура,
	               |		ОстаткиТоваровКомпании.КоличествоОстаток - ОстаткиТоваровКомпании.РезервОстаток КАК Количество
	               |	ИЗ
	               |		РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, СкладКомпании = &СкладПикинга) КАК ОстаткиТоваровКомпании
	               |	ГДЕ
	               |		ОстаткиТоваровКомпании.КоличествоОстаток - ОстаткиТоваровКомпании.РезервОстаток > 0
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		СборкаЗаказаПокупателя.Номенклатура,
	               |		-СУММА(СборкаЗаказаПокупателя.Количество)
	               |	ИЗ
	               |		РегистрСведений.СборкаЗаказаПокупателя КАК СборкаЗаказаПокупателя
	               |	ГДЕ
	               |		СборкаЗаказаПокупателя.СкладКомпании = &СкладПикинга
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		СборкаЗаказаПокупателя.Номенклатура) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Номенклатура
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(ВложенныйЗапрос.Количество) > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ШтрихКоды.ЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
	               |	ШтрихКоды.Штрихкод КАК Штрихкод
	               |ИЗ
	               |	ОстаткиТоваровКомпании КАК ТаблицаТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихКоды
	               |		ПО ТаблицаТовары.Номенклатура = ШтрихКоды.Объект
	               |			И (ШтрихКоды.Запрет = ЛОЖЬ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ТаблицаТовары.Номенклатура.Код КАК НоменклатураКод,
	               |	ТаблицаТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	               |	ТаблицаТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
	               |	ТаблицаТовары.Номенклатура.ИерархияАльтернативная КАК Родитель,
	               |	ТаблицаТовары.Номенклатура.ИерархияАльтернативная.Код КАК РодительКод,
	               |	ТаблицаТовары.Номенклатура.ИерархияАльтернативная.Наименование КАК РодительНаименование,
	               |	ТаблицаТовары.Номенклатура.ТоварноеСоседство КАК ТоварноеСоседство,
	               |	ТаблицаТовары.Номенклатура.ТоварноеСоседство.Код КАК ТоварноеСоседствоКод,
	               |	ТаблицаТовары.Номенклатура.ТоварноеСоседство.Наименование КАК ТоварноеСоседствоНаименование,
	               |	ТаблицаТовары.Количество КАК Количество,
	               |	ТаблицаТовары.Номенклатура.КратностьПоставок КАК КратностьПоставок,
	               |	ТаблицаТовары.Номенклатура.ТипНоменклатуры.Весовой КАК Весовой
	               |ИЗ
	               |	ОстаткиТоваровКомпании КАК ТаблицаТовары";
	
	ПакетыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШтрихкоды = ПакетыЗапроса[ПакетыЗапроса.Количество()-2].Выбрать();
	Выборка          = ПакетыЗапроса[ПакетыЗапроса.Количество()-1].Выбрать();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ТекстОшибки = "Товары для перемещения не подобраны";
		Результат = СформироватьДанныеПередачи(Неопределено);
		ОтменитьТранзакцию();
		Возврат Результат;
	КонецЕсли;
		
	Попытка
		
		НачатьТранзакцию();
		
		ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
		
		Пока Выборка.Следующий() Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("Товары"); // ТоварнаяСтрока
			ЗаписьXML.ЗаписатьАтрибут("Количество", Формат(Выборка.Количество, "ЧРД=.; ЧН=0; ЧГ="));
			ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
			ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.Номенклатура));
			ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.НоменклатураКод);
			ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.НоменклатураНаименование);
			ЗаписьXML.ЗаписатьАтрибут("Артикул",      Выборка.НоменклатураАртикул);
			ЗаписьXML.ЗаписатьАтрибут("КратностьПоставок", Формат(Выборка.КратностьПоставок, "ЧРД=.; ЧН=0; ЧГ="));
			ЗаписьXML.ЗаписатьАтрибут("Весовой", ?(Выборка.Весовой,"Истина","Ложь"));
			ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа",    "Ложь");
			Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель"); // Родитель
				ЗаписьXML.ЗаписатьАтрибут("Тип",          "Номенклатура");
				ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.Родитель));
				ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.РодительКод);
				ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.РодительНаименование);
				ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа",    "Истина");
				ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
			Иначе
				ЗаписьXML.ЗаписатьАтрибут("Родитель", "");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ТоварноеСоседство) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("ТоварноеСоседство"); // Родитель
				ЗаписьXML.ЗаписатьАтрибут("Тип",          "ТоварноеСоседство");
				ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.ТоварноеСоседство));
				ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.ТоварноеСоседствоКод);
				ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.ТоварноеСоседствоНаименование);
				ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
			Иначе
				ЗаписьXML.ЗаписатьАтрибут("ТоварноеСоседство", "");
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
			ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
		КонецЦикла;
		
		Пока ВыборкаШтрихкоды.Следующий() Цикл
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ШтрихКоды"); // ТоварнаяСтрока
			
			ЗаписьXML.ЗаписатьАтрибут("Штрихкод", ВыборкаШтрихкоды.Штрихкод);
			ЗаписьXML.ЗаписатьАтрибут("Коэффициент", Формат(ВыборкаШтрихкоды.Коэффициент, "ЧРД=.; ЧН=0; ЧГ="));
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
			ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаШтрихкоды.Номенклатура));
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
			
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
		
		ЗаписьXML.Закрыть();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат = СформироватьДанныеПередачи(Неопределено);
		ОтменитьТранзакцию();
		Возврат Результат;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция ПеремещениеИзСкладаСборки(СсылкаПодразделениеКомпании, ШтрихКод, ПараметрыОбмена, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи).ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	Пользователь = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
			ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
		Возврат Ложь;
	КонецЕсли;
	
	СкладПикинга        = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.СкладПикинга, ПодразделениеКомпании);
	СкладПодбораТоваров = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.СкладПодбораТоваров, ПодразделениеКомпании);
	
	Если Не ЗначениеЗаполнено(СкладПодбораТоваров) Тогда
		ТекстОшибки = "Для подразделения <"+ПодразделениеКомпании+"> не задан склад подбора товаров. Настройте учетную политику";
		Возврат Ложь
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СкладПикинга) Тогда
		ТекстОшибки = "Для подразделения <"+ПодразделениеКомпании+"> не задан склад пикинга. Настройте учетную политику";
		Возврат Ложь
	КонецЕсли;
	
	ДанныеОбмена = ПараметрыОбмена.Получить().ДанныеОбмена;
	
	ТаблицаТоваров = ПолучитьДанныеОбмена(ДанныеОбмена);
	СписокТоваров = ПолучитьСписокИзXDTO(ТаблицаТоваров.Товары);
	Если СписокТоваров.Количество()=0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДокументОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ДокументОбъект.Заполнить(Неопределено);
	ДокументОбъект.Автор = Пользователь;
	ДокументОбъект.ХозОперация           = Справочники.ХозОперации.ПеремещениеТоваров;
	ДокументОбъект.ПодразделениеКомпании = ПодразделениеКомпании;
	
	Документы.ПеремещениеТоваров.ПодразделениеКомпанииПриИзменении(ДокументОбъект);
	ДокументОбъект.СкладКомпании   = СкладПикинга;
	Документы.ПеремещениеТоваров.СкладКомпанииПриИзменении(ДокументОбъект);
	ДокументОбъект.СкладПолучатель = СкладПодбораТоваров;
	Документы.ПеремещениеТоваров.СкладПолучательПриИзменении(ДокументОбъект);
	
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		
		Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Номенклатура.Ссылка);
		Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
		
		ТоварнаяСтрока = ДокументОбъект.Товары.Найти(Номенклатура, "Номенклатура");
		Если ТоварнаяСтрока = Неопределено Тогда
			ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
			ТоварнаяСтрока.Номенклатура = Номенклатура;
			ТоварнаяСтрока.Количество   = Число(ТекущаяСтрока.Количество);
			Документы.ПеремещениеТоваров.ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока);
		Иначе
			ТоварнаяСтрока.Количество   = ТоварнаяСтрока.Количество + Число(ТекущаяСтрока.Количество);
			Документы.ПеремещениеТоваров.ТоварыКоличествоПриИзменении(ДокументОбъект, ТоварнаяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	ДокументОбъект.УстановитьНовыйНомер();
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	ДокументОбъект.ОбменДанными.Загрузка = Ложь;
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстОшибки = ТекстОшибки + "
		|Документ <"+Строка(ДокументОбъект.Ссылка)+"> не проведен!
		|"+ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

//Функция ПечатьПакета(МассивОбъектов, ОбъектыПечати)
Функция ПечатьПакета(МассивОбъектов) Экспорт
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СборкаЗаказаПокупателя.ПФ_MXL_Пакет");

	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СборкаЗаказаПокупателя_Печать_Пакета";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	
	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СборкаЗаказаПокупателя.ДокументОснование.Номер КАК НомерЗаказа,
		|	СборкаЗаказаПокупателя.ДокументОснование.Дата КАК ДатаЗаказа,
		|	ЕСТЬNULL(СборкаЗаказаПокупателя.ДокументОснование.Телефон, """") КАК Телефон,
		|	СборкаЗаказаПокупателяПакеты.Пакет КАК Пакет,
		|	СборкаЗаказаПокупателяПакеты.ШтрихКод КАК ШтрихКод,
		|	Представление(СборкаЗаказаПокупателяПакеты.ТоварноеСоседство) КАК ТоварноеСоседство,
		|	Представление(СборкаЗаказаПокупателя.Оператор) КАК Оператор
		|ИЗ
		|	Документ.СборкаЗаказаПокупателя КАК СборкаЗаказаПокупателя
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Документ.СборкаЗаказаПокупателя.Пакеты КАК СборкаЗаказаПокупателяПакеты
		|ПО
		|	СборкаЗаказаПокупателя.Ссылка = СборкаЗаказаПокупателяПакеты.Ссылка И 
		|	СборкаЗаказаПокупателя.КоличествоПакетов = СборкаЗаказаПокупателяПакеты.Пакет
		|ГДЕ
		|	СборкаЗаказаПокупателя.Ссылка = &Ссылка";
	
		Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("Этикетка");

		НомерВСтроке = 1;
		Пока Выборка.Следующий() Цикл
			
			ДатаУпаковки = Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
			
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ОбластьМакета.Параметры.НомерЗаказа       = Выборка.НомерЗаказа;
			ОбластьМакета.Параметры.ДатаЗаказа        = Формат(Выборка.ДатаЗаказа, "ДЛФ=DT");
			ОбластьМакета.Параметры.Пакет             = Выборка.Пакет;
			ОбластьМакета.Параметры.ТоварноеСоседство = Выборка.ТоварноеСоседство;
			ОбластьМакета.Параметры.Оператор          = Выборка.Оператор;
			ОбластьМакета.Параметры.ДатаУпаковки      = ДатаУпаковки;
			
			ТекстОшибки = "";
			
			ЗаписьXML = Новый ЗаписьXML; 
			ЗаписьXML.УстановитьСтроку("UTF-8");
			ЗаписьXML.ЗаписатьОбъявлениеXML();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Package");
			ЗаписьXML.ЗаписатьАтрибут("OrderNumber",   XMLСтрока(Выборка.НомерЗаказа));
			ЗаписьXML.ЗаписатьАтрибут("OrderDate",     XMLСтрока(Формат(Выборка.ДатаЗаказа, "ДЛФ=DT")));
			ЗаписьXML.ЗаписатьАтрибут("PackageNumber", XMLСтрока(Формат(Выборка.Пакет, "ЧН=0")));
			ЗаписьXML.ЗаписатьАтрибут("Group",         XMLСтрока(Выборка.ТоварноеСоседство));
			ЗаписьXML.ЗаписатьАтрибут("Operator",      XMLСтрока(Выборка.Оператор));
			ЗаписьXML.ЗаписатьАтрибут("PackingDate",   XMLСтрока(ДатаУпаковки));
			ЗаписьXML.ЗаписатьАтрибут("Barcode",       XMLСтрока(Выборка.ШтрихКод));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ТекстQRКода = ЗаписьXML.Закрыть();
			
			ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(ТекстQRКода, 0, 190);
			Если Не ПустаяСтрока(ТекстОшибки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
			
			КартинкаQRКода = Новый Картинка(ДанныеQRКода);
			ОбластьМакета.Рисунки.Штрихкод.Картинка = КартинкаQRКода;
			
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьМакета, , , НомерСтраницы, , Документ, );
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьПакета()

Функция ПечатьСчета(МассивОбъектов) Экспорт
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СборкаЗаказаПокупателя.ПФ_MXL_Счет");

	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СборкаЗаказаПокупателя_Печать_Счета";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	
	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплату.ДокументОснование.Номер КАК НомерЗаказа,
		|	СчетНаОплату.ДокументОснование.Дата КАК ДатаЗаказа,
		|	СчетНаОплату.Номер КАК НомерСчета,
		|	СчетНаОплату.Дата КАК ДатаСчета,
		|	СчетНаОплату.ДокументОснование.Телефон КАК Телефон,
		|	СчетНаОплату.СуммаДокумента КАК СуммаДокумента,
		|	СчетНаОплату.ВалютаДокумента КАК ВалютаДокумента
		|ИЗ
		|	Документ.СчетНаОплату КАК СчетНаОплату
		|ГДЕ
		|	СчетНаОплату.Ссылка = &Ссылка";
	
		Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("Этикетка");

		НомерВСтроке = 1;
		Пока Выборка.Следующий() Цикл
			
			ДатаУпаковки = Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
			
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ОбластьМакета.Параметры.НомерЗаказа    = Выборка.НомерЗаказа;
			ОбластьМакета.Параметры.ДатаЗаказа     = Формат(Выборка.ДатаЗаказа, "ДЛФ=DT");
			ОбластьМакета.Параметры.НомерСчета     = Выборка.НомерСчета;
			ОбластьМакета.Параметры.ДатаСчета      = Формат(Выборка.ДатаСчета, "ДЛФ=DT");
			ОбластьМакета.Параметры.СуммаДокумента = Формат(Выборка.СуммаДокумента, "ЧЦ=15; ЧДЦ=2");	
			
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьМакета, , , НомерСтраницы, , Документ, );
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьСчета()

#Область Логистика

Функция ПолучитьТочкиДоставки(СсылкаПодразделениеКомпании, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СостоянияВыполненияЗаказовПокупателей.Заказ КАК Заказ
	|ПОМЕСТИТЬ
	|	ТаблицаЗаказов
	|ИЗ
	|	РегистрСведений.СостоянияВыполненияЗаказовПокупателей КАК СостоянияВыполненияЗаказовПокупателей
	|ГДЕ
	|	СостоянияВыполненияЗаказовПокупателей.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВыполненияЗаказовПокупателей.ЗаказСобран)
	|;
	|
	|ВЫБРАТЬ
	|	СборкаЗаказаПокупателя.ПодразделениеПолучатель КАК ТорговаяТочка,
	|	СборкаЗаказаПокупателя.ПодразделениеПолучатель.Код КАК ТорговаяТочкаКод,
	|	СборкаЗаказаПокупателя.ПодразделениеПолучатель.Наименование КАК ТорговаяТочкаНаименование,
	|	СборкаЗаказаПокупателя.ПодразделениеПолучатель.НаименованиеПолное КАК ТорговаяТочкаНаименованиеПолное,
	|	СУММА(СборкаЗаказаПокупателя.КоличествоПакетов) КАК КоличествоПакетов,
	|	КОЛИЧЕСТВО(ТаблицаЗаказов.Заказ) КАК КоличествоЗаказов
	|ИЗ
	|	ТаблицаЗаказов КАК ТаблицаЗаказов
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.СборкаЗаказаПокупателя КАК СборкаЗаказаПокупателя
	|ПО
	|	ТаблицаЗаказов.Заказ = СборкаЗаказаПокупателя.ДокументОснование И 
	|	СборкаЗаказаПокупателя.ПодразделениеОтправитель = &ПодразделениеКомпании
	|ГДЕ
	|	СборкаЗаказаПокупателя.ПодразделениеОтправитель = &ПодразделениеКомпании
	|СГРУППИРОВАТЬ ПО
	|	СборкаЗаказаПокупателя.ПодразделениеПолучатель
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ТекстОшибки = "Нет собранных заказов";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТорговыеТочки"); // Сборка
		
		ЗаписьXML.ЗаписатьАтрибут("КоличествоПакетов", XMLСтрока(Выборка.КоличествоПакетов));
		ЗаписьXML.ЗаписатьАтрибут("КоличествоЗаказов", XMLСтрока(Выборка.КоличествоЗаказов));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТорговаяТочка"); // Сборка
		ЗаписьXML.ЗаписатьАтрибут("Тип", "ПодразделенияКомпании");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.ТорговаяТочка));
		ЗаписьXML.ЗаписатьАтрибут("Код",  Выборка.ТорговаяТочкаКод);
		ЗаписьXML.ЗаписатьАтрибут("Наименование",  Выборка.ТорговаяТочкаНаименование);
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Сборка
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Сборка
		
	КонецЦикла;;
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
	
	ЗаписьXML.Закрыть();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеПогрузки(СсылкаПодразделениеКомпании, ПараметрыОбмена, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	ДанныеОбмена = ПараметрыОбмена.Получить().ДанныеОбмена;
	ТаблицаПакета = ПолучитьДанныеОбмена(ДанныеОбмена);
	
	Если ТаблицаПакета.Свойства().Получить("ТорговыеТочки") = Неопределено Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ТорговыеТочки = Новый Массив;
	XDTOТорговыеТочки = ПолучитьСписокИзXDTO(ТаблицаПакета.ТорговыеТочки);
	Для Каждого ТекущаяСтрока Из XDTOТорговыеТочки Цикл
		
		Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Ссылка);
		ТорговаяТочка = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
		
		Если ТорговаяТочка.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		ТорговыеТочки.Добавить(ТорговаяТочка);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ТорговыеТочки", ТорговыеТочки);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СостоянияВыполненияЗаказовПокупателей.Заказ КАК Заказ
	|ПОМЕСТИТЬ
	|	ТаблицаЗаказов
	|ИЗ
	|	РегистрСведений.СостоянияВыполненияЗаказовПокупателей КАК СостоянияВыполненияЗаказовПокупателей
	|ГДЕ
	|	СостоянияВыполненияЗаказовПокупателей.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВыполненияЗаказовПокупателей.ЗаказСобран)
	|;
	|
	|ВЫБРАТЬ
	|	СборкаЗаказаПокупателя.ПодразделениеПолучатель КАК ТорговаяТочка,
	|	СборкаЗаказаПокупателя.Ссылка КАК СборкаЗаказа,
	//|	СборкаЗаказаПокупателя.ПодразделениеПолучатель.Код КАК ТорговаяТочкаКод,
	//|	СборкаЗаказаПокупателя.ПодразделениеПолучатель.Наименование КАК ТорговаяТочкаНаименование,
	//|	СборкаЗаказаПокупателя.ПодразделениеПолучатель.НаименованиеПолное КАК ТорговаяТочкаНаименованиеПолное,
	|	ТаблицаЗаказов.Заказ КАК Заказ,
	|	СборкаЗаказаПокупателя.КоличествоПакетов КАК КоличествоПакетов
	|ПОМЕСТИТЬ
	|	ТаблицаСборок
	|ИЗ
	|	ТаблицаЗаказов КАК ТаблицаЗаказов
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.СборкаЗаказаПокупателя КАК СборкаЗаказаПокупателя
	|ПО
	|	ТаблицаЗаказов.Заказ = СборкаЗаказаПокупателя.ДокументОснование И 
	|	СборкаЗаказаПокупателя.ПодразделениеОтправитель = &ПодразделениеКомпании
	|ГДЕ
	|	СборкаЗаказаПокупателя.Проведен И 
	|	СборкаЗаказаПокупателя.ПодразделениеОтправитель = &ПодразделениеКомпании И 
	|	СборкаЗаказаПокупателя.ПодразделениеПолучатель В (&ТорговыеТочки)
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаСборок.ТорговаяТочка КАК ТорговаяТочка,
	|	ТаблицаСборок.ТорговаяТочка.Код КАК ТорговаяТочкаКод,
	|	ТаблицаСборок.ТорговаяТочка.Наименование КАК ТорговаяТочкаНаименование,
	|	ТаблицаСборок.ТорговаяТочка.НаименованиеПолное КАК ТорговаяТочкаНаименованиеПолное,
	|	ТаблицаСборок.КоличествоПакетов КАК КоличествоПакетов,
	|	ТаблицаСборок.Заказ КАК Заказ,
	|	ТаблицаСборок.Заказ.Номер КАК НомерЗаказа,
	|	ТаблицаСборок.Заказ.Дата КАК ДатаЗаказа
	|ИЗ
	|	ТаблицаСборок КАК ТаблицаСборок
	|;
	|
	|ВЫБРАТЬ
	|	СборкаЗаказаПокупателяПакеты.ШтрихКод,
	|	СборкаЗаказаПокупателяПакеты.Пакет,
	|	СборкаЗаказаПокупателяПакеты.ТоварноеСоседство,
	|	СборкаЗаказаПокупателяПакеты.ТоварноеСоседство.Код КАК ТоварноеСоседствоКод,
	|	СборкаЗаказаПокупателяПакеты.ТоварноеСоседство.Наименование КАК ТоварноеСоседствоНаименование,
	|	ТаблицаСборок.ТорговаяТочка КАК ТорговаяТочка,
	|	ТаблицаСборок.ТорговаяТочка.Код КАК ТорговаяТочкаКод,
	|	ТаблицаСборок.ТорговаяТочка.Наименование КАК ТорговаяТочкаНаименование,
	|	ТаблицаСборок.ТорговаяТочка.НаименованиеПолное КАК ТорговаяТочкаНаименованиеПолное,
	|	ТаблицаСборок.СборкаЗаказа КАК СборкаЗаказа,
	|	ТаблицаСборок.Заказ КАК Заказ
	|ИЗ
	|	ТаблицаСборок КАК ТаблицаСборок
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.СборкаЗаказаПокупателя.Пакеты КАК СборкаЗаказаПокупателяПакеты
	|ПО
	|	ТаблицаСборок.СборкаЗаказа = СборкаЗаказаПокупателяПакеты.Ссылка
	|";
	
	ПакетыЗапроса = Запрос.ВыполнитьПакет();
	
	ЗаказыСборки = ПакетыЗапроса[ПакетыЗапроса.Количество()-2];
	ПакетыСборки = ПакетыЗапроса[ПакетыЗапроса.Количество()-1];
	
	Если ЗаказыСборки.Пустой() Тогда
		ТекстОшибки = "Нет собранных заказов";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
	
	Выборка = ЗаказыСборки.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Заказы"); // Заказы
		
		ЗаписьXML.ЗаписатьАтрибут("КоличествоПакетов", XMLСтрока(Выборка.КоличествоПакетов));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Заказ"); // Заказ
		ЗаписьXML.ЗаписатьАтрибут("Тип", "ЗаказПокупателя");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Заказ));
		ЗаписьXML.ЗаписатьАтрибут("Номер", Выборка.НомерЗаказа);
		ЗаписьXML.ЗаписатьАтрибут("Дата",  Строка(Выборка.ДатаЗаказа));
		//ЗаписьXML.ЗаписатьАтрибут("Представление", "Заказ № " + Выборка.НомерЗаказа + " от " + Формат(Выборка.ДатаЗаказа, "ДФ=dd.MM.yyyy"));
		ЗаписьXML.ЗаписатьАтрибут("Представление", "№ " + Выборка.НомерЗаказа + " от " + Формат(Выборка.ДатаЗаказа, "ДФ=dd.MM.yyyy"));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Заказ
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТорговаяТочка"); // Сборка
		ЗаписьXML.ЗаписатьАтрибут("Тип", "ПодразделенияКомпании");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.ТорговаяТочка));
		ЗаписьXML.ЗаписатьАтрибут("Код",  Выборка.ТорговаяТочкаКод);
		ЗаписьXML.ЗаписатьАтрибут("Наименование",  Выборка.ТорговаяТочкаНаименование);
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Сборка
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Заказы
		
	КонецЦикла;
	
	Выборка = ПакетыСборки.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Пакеты"); // Пакеты
		
		ЗаписьXML.ЗаписатьАтрибут("ШтрихКод", XMLСтрока(Выборка.ШтрихКод));
		ЗаписьXML.ЗаписатьАтрибут("Пакет", XMLСтрока(Выборка.Пакет));
		ЗаписьXML.ЗаписатьАтрибут("СборкаЗаказа",  XMLСтрока(Выборка.СборкаЗаказа));
		ЗаписьXML.ЗаписатьАтрибут("Заказ",         XMLСтрока(Выборка.Заказ));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТорговаяТочка"); // Сборка
		ЗаписьXML.ЗаписатьАтрибут("Тип",           "ПодразделенияКомпании");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка",        СериализоватьСсылку(Выборка.ТорговаяТочка));
		ЗаписьXML.ЗаписатьАтрибут("Код",           Выборка.ТорговаяТочкаКод);
		ЗаписьXML.ЗаписатьАтрибут("Наименование",  Выборка.ТорговаяТочкаНаименование);
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Сборка
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТоварноеСоседство"); // Родитель
		ЗаписьXML.ЗаписатьАтрибут("Тип",          "ТоварноеСоседство");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.ТоварноеСоседство));
		ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.ТоварноеСоседствоКод);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.ТоварноеСоседствоНаименование);
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Пакеты
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
	
	ЗаписьXML.Закрыть();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция ЗавершитьПогрузку(СсылкаПодразделениеКомпании, ПараметрыОбмена, Штрихкод, ТекстОшибки)
	
	ТекстОшибки = "";
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи).ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	Пользователь = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
			ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
		Возврат Ложь;
	КонецЕсли;
	
	Оператор = Пользователь.Сотрудник;
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		ТекстОшибки = "У пользователя <"+Пользователь+"> не указан сотрудник";
		Возврат Ложь;
	КонецЕсли;
	
	СкладПикинга = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.СкладПикинга, ПодразделениеКомпании);
	
	ДанныеОбмена = ПараметрыОбмена.Получить().ДанныеОбмена;
	ТаблицаПакета = ПолучитьДанныеОбмена(ДанныеОбмена);
	
	Если ТаблицаПакета.Свойства().Получить("СборкиЗаказов") = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	СборкиЗаказов = Новый Массив;
	XDTOТорговыеТочки = ПолучитьСписокИзXDTO(ТаблицаПакета.СборкиЗаказов);
	Для Каждого ТекущаяСтрока Из XDTOТорговыеТочки Цикл
		
		Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Ссылка);
		СборкаЗаказа = Документы.СборкаЗаказаПокупателя.ПолучитьСсылку(Идентификатор);
		
		Если СборкаЗаказа.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		СборкиЗаказов.Добавить(СборкаЗаказа);
		
	КонецЦикла;
	
	ШтрихКоды = Новый Массив;
	XDTOШтрихКоды = ПолучитьСписокИзXDTO(ТаблицаПакета.ШтрихКоды);
	Для Каждого СтрокаШтрихКод Из XDTOШтрихКоды Цикл
		ШтрихКоды.Добавить(СтрокаШтрихКод.ШтрихКод);
	КонецЦикла;
	
	Если СборкиЗаказов.Количество()=0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКоды",     ШтрихКоды);
	Запрос.УстановитьПараметр("СборкиЗаказов", СборкиЗаказов);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СборкаЗаказаПокупателя.Ссылка КАК СборкаЗаказов,
	|	СборкаЗаказаПокупателя.ПодразделениеОтправитель,
	|	СборкаЗаказаПокупателя.ПодразделениеПолучатель,
	|	СборкаЗаказаПокупателя.ДокументОснование КАК ЗаказПокупателя,
	|	СборкаЗаказаПокупателяПакеты.Пакет КАК Пакет,
	|	СборкаЗаказаПокупателяПакеты.ШтрихКод КАК ШтрихКод,
	|	СборкаЗаказаПокупателяПакеты.ТоварноеСоседство КАК ТоварноеСоседство,
	|	СборкаЗаказаПокупателяТовары.Номенклатура,
	|	СборкаЗаказаПокупателяТовары.Количество,
	|	СборкаЗаказаПокупателяТовары.ЕдиницаИзмерения,
	|	СборкаЗаказаПокупателяТовары.Коэффициент,
	|	СборкаЗаказаПокупателяТовары.ХарактеристикаНоменклатуры
	|ИЗ
	|	Документ.СборкаЗаказаПокупателя КАК СборкаЗаказаПокупателя
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.СборкаЗаказаПокупателя.Пакеты КАК СборкаЗаказаПокупателяПакеты
	|ПО
	|	СборкаЗаказаПокупателя.Ссылка = СборкаЗаказаПокупателяПакеты.Ссылка
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.СборкаЗаказаПокупателя.Товары КАК СборкаЗаказаПокупателяТовары
	|ПО
	|	СборкаЗаказаПокупателяПакеты.Ссылка = СборкаЗаказаПокупателяТовары.Ссылка И 
	|	СборкаЗаказаПокупателяПакеты.Пакет = СборкаЗаказаПокупателяТовары.Пакет
	|ГДЕ
	|	СборкаЗаказаПокупателя.Ссылка В (&СборкиЗаказов) И 
	|	СборкаЗаказаПокупателяПакеты.ШтрихКод В (&ШтрихКоды)
	|ИТОГИ
	|	МАКСИМУМ(ШтрихКод),
	|	МАКСИМУМ(СборкаЗаказов),
	|	МАКСИМУМ(ТоварноеСоседство)
	|ПО
	|	ПодразделениеОтправитель,
	|	ПодразделениеПолучатель,
	|	ЗаказПокупателя,
	|	Пакет
	|";
	
	Попытка
		
		НачатьТранзакцию();
		ВыборкаОтправитель = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОтправитель.Следующий() Цикл
			ВыборкаПолучатель = ВыборкаОтправитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПолучатель.Следующий() Цикл
				
				ДокументОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
				ДокументОбъект.Заполнить(Неопределено);
				ДокументОбъект.Автор = Пользователь;
				ДокументОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал;
				Документы.ПеремещениеТоваров.ХозОперацияПриИзменении(ДокументОбъект);
				
				ДокументОбъект.ПодразделениеКомпании = ВыборкаОтправитель.ПодразделениеОтправитель;
				Документы.ПеремещениеТоваров.ПодразделениеКомпанииПриИзменении(ДокументОбъект);
				
				ДокументОбъект.СкладКомпании   = СкладПикинга;
				Документы.ПеремещениеТоваров.СкладКомпанииПриИзменении(ДокументОбъект);
				
				ДокументОбъект.СкладПолучатель = ВыборкаПолучатель.ПодразделениеПолучатель;
				Документы.ПеремещениеТоваров.СкладПолучательПриИзменении(ДокументОбъект);
				
				ВыборкаЗаказПокупателя = ВыборкаПолучатель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаЗаказПокупателя.Следующий() Цикл
					ВыборкаПакет = ВыборкаЗаказПокупателя.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПакет.Следующий() Цикл
						
						НовыйПакет = ДокументОбъект.Пакеты.Добавить();
						НовыйПакет.ИдентификаторУпаковки = ВыборкаПакет.ШтрихКод;
						НовыйПакет.Пакет                 = ВыборкаПакет.Пакет;
						НовыйПакет.ТоварноеСоседство     = ВыборкаПакет.ТоварноеСоседство;
						
						Выборка = ВыборкаПакет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока Выборка.Следующий() Цикл
							НоваяСтрока = ДокументОбъект.Товары.Добавить();
							НоваяСтрока.Номенклатура     = Выборка.Номенклатура;
							НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
							НоваяСтрока.Коэффициент      = Выборка.Коэффициент;
							НоваяСтрока.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
							НоваяСтрока.ИдентификаторУпаковки = ВыборкаПакет.ШтрихКод;
							Документы.ПеремещениеТоваров.ТоварыНоменклатураПриИзменении(ДокументОбъект, НоваяСтрока);
							
							НоваяСтрока.Количество = Выборка.Количество;
							Документы.ПеремещениеТоваров.ТоварыКоличествоПриИзменении(ДокументОбъект, НоваяСтрока);
							
							НоваяСтрока.ЗаказПокупателя = Выборка.ЗаказПокупателя;
							
						КонецЦикла;
					КонецЦикла;
					
					НаборЗаписей = РегистрыСведений.СостоянияВыполненияЗаказовПокупателей.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Заказ.Установить(ВыборкаЗаказПокупателя.ЗаказПокупателя);
					НаборЗаписей.Прочитать();
					
					Если НаборЗаписей.Количество() = 0 Тогда
						Запись = НаборЗаписей.Добавить();
					Иначе
						Запись = НаборЗаписей[0];
					КонецЕсли;
					
					Запись.Заказ     = ВыборкаЗаказПокупателя.ЗаказПокупателя;
					Запись.Состояние = Перечисления.СостоянияВыполненияЗаказовПокупателей.ЗаказВПути;
					НаборЗаписей.Записать(Истина);
					
				КонецЦикла;
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЦикла;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат = СформироватьДанныеПередачи(Неопределено);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьДанныеПоЗаказам(СсылкаПодразделениеКомпании, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СостоянияВыполненияЗаказовПокупателей.Заказ.ПодразделениеКомпании КАК ТорговаяТочка,
	|	СостоянияВыполненияЗаказовПокупателей.Заказ КАК Заказ,
	|	СостоянияВыполненияЗаказовПокупателей.Состояние
	|ПОМЕСТИТЬ
	|	ТаблицаЗаказов
	|ИЗ
	|	РегистрСведений.СостоянияВыполненияЗаказовПокупателей КАК СостоянияВыполненияЗаказовПокупателей
	|ГДЕ
	|	СостоянияВыполненияЗаказовПокупателей.Заказ.ПодразделениеКомпании = &ПодразделениеКомпании И 
	|	(НЕ СостоянияВыполненияЗаказовПокупателей.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВыполненияЗаказовПокупателей.ЗаказДоставленВТочку)) И 
	|	(НЕ СостоянияВыполненияЗаказовПокупателей.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВыполненияЗаказовПокупателей.Выполнен))
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЗаказов.Заказ КАК Заказ
	|ПОМЕСТИТЬ
	|	ЗаказыВПути
	|ИЗ
	|	ТаблицаЗаказов КАК ТаблицаЗаказов
	|ГДЕ
	|	ТаблицаЗаказов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВыполненияЗаказовПокупателей.ЗаказВПути)
	|;
	|
	|ВЫБРАТЬ
	|	СборкаЗаказаПокупателя.ПодразделениеПолучатель КАК ТорговаяТочка,
	|	СборкаЗаказаПокупателя.Ссылка КАК СборкаЗаказа,
	|	ТаблицаЗаказов.Заказ КАК Заказ,
	|	СборкаЗаказаПокупателя.КоличествоПакетов КАК КоличествоПакетов
	|ПОМЕСТИТЬ
	|	ТаблицаСборок
	|ИЗ
	|	ЗаказыВПути КАК ТаблицаЗаказов
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.СборкаЗаказаПокупателя КАК СборкаЗаказаПокупателя
	|ПО
	|	ТаблицаЗаказов.Заказ = СборкаЗаказаПокупателя.ДокументОснование И 
	|	СборкаЗаказаПокупателя.ПодразделениеПолучатель = &ПодразделениеКомпании
	|ГДЕ
	|	СборкаЗаказаПокупателя.ПодразделениеПолучатель = &ПодразделениеКомпании И 
	|	СборкаЗаказаПокупателя.Проведен
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЗаказов.ТорговаяТочка КАК ТорговаяТочка,
	|	ТаблицаЗаказов.ТорговаяТочка.Код КАК ТорговаяТочкаКод,
	|	ТаблицаЗаказов.ТорговаяТочка.Наименование КАК ТорговаяТочкаНаименование,
	|	ТаблицаЗаказов.ТорговаяТочка.НаименованиеПолное КАК ТорговаяТочкаНаименованиеПолное,
	|	ТаблицаЗаказов.Заказ КАК Заказ,
	|	ТаблицаЗаказов.Заказ.Номер КАК НомерЗаказа,
	|	ТаблицаЗаказов.Заказ.Дата КАК ДатаЗаказа,
	|	ТаблицаЗаказов.Состояние,
	|	ЕСТЬNULL(ТаблицаСборок.КоличествоПакетов, 0) КАК КоличествоПакетов
	|ИЗ
	|	ТаблицаЗаказов КАК ТаблицаЗаказов
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТаблицаСборок КАК ТаблицаСборок
	|ПО
	|	ТаблицаЗаказов.Заказ = ТаблицаСборок.Заказ
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПеремещениеТоваровТовары.ИдентификаторУпаковки КАК ШтрихКод,
	|	ПеремещениеТоваровПакеты.Пакет,
	|	ПеремещениеТоваровПакеты.ТоварноеСоседство,
	|	ПеремещениеТоваровПакеты.ТоварноеСоседство.Код КАК ТоварноеСоседствоКод,
	|	ПеремещениеТоваровПакеты.ТоварноеСоседство.Наименование КАК ТоварноеСоседствоНаименование,
	|	ТаблицаСборок.СборкаЗаказа КАК СборкаЗаказа,
	|	ТаблицаСборок.Заказ КАК Заказ
	|ИЗ
	|	ТаблицаСборок КАК ТаблицаСборок
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ПО
	|	ТаблицаСборок.Заказ = ПеремещениеТоваровТовары.ЗаказПокупателя
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ПеремещениеТоваров.Пакеты КАК ПеремещениеТоваровПакеты
	//|	Документ.СборкаЗаказаПокупателя.Пакеты КАК СборкаЗаказаПокупателяПакеты
	|ПО
	//|	ТаблицаСборок.СборкаЗаказа = СборкаЗаказаПокупателяПакеты.Ссылка
	|	ПеремещениеТоваровТовары.Ссылка = ПеремещениеТоваровПакеты.Ссылка И 
	|	ПеремещениеТоваровТовары.ИдентификаторУпаковки = ПеремещениеТоваровПакеты.ИдентификаторУпаковки
	|ГДЕ
	|	ПеремещениеТоваровПакеты.Ссылка.Проведен И 
	|	ПеремещениеТоваровПакеты.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровВФилиал)
	//|ВЫБРАТЬ
	//|	СборкаЗаказаПокупателя.ПодразделениеПолучатель КАК ТорговаяТочка,
	//|	СборкаЗаказаПокупателя.Ссылка КАК СборкаЗаказа,
	//|	ТаблицаЗаказов.Заказ КАК Заказ,
	//|	СборкаЗаказаПокупателя.КоличествоПакетов КАК КоличествоПакетов
	//|ПОМЕСТИТЬ
	//|	ТаблицаСборок
	//|ИЗ
	//|	ЗаказыВПути КАК ТаблицаЗаказов
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	//|	Документ.СборкаЗаказаПокупателя КАК СборкаЗаказаПокупателя
	//|ПО
	//|	ТаблицаЗаказов.Заказ = СборкаЗаказаПокупателя.ДокументОснование И 
	//|	СборкаЗаказаПокупателя.ПодразделениеПолучатель = &ПодразделениеКомпании
	//|ГДЕ
	//|	СборкаЗаказаПокупателя.ПодразделениеПолучатель = &ПодразделениеКомпании
	//|;
	//|
	//|ВЫБРАТЬ
	//|	ТаблицаЗаказов.ТорговаяТочка КАК ТорговаяТочка,
	//|	ТаблицаЗаказов.ТорговаяТочка.Код КАК ТорговаяТочкаКод,
	//|	ТаблицаЗаказов.ТорговаяТочка.Наименование КАК ТорговаяТочкаНаименование,
	//|	ТаблицаЗаказов.ТорговаяТочка.НаименованиеПолное КАК ТорговаяТочкаНаименованиеПолное,
	//|	ТаблицаЗаказов.Заказ КАК Заказ,
	//|	ТаблицаЗаказов.Заказ.Номер КАК НомерЗаказа,
	//|	ТаблицаЗаказов.Заказ.Дата КАК ДатаЗаказа,
	//|	ТаблицаЗаказов.Состояние,
	//|	ЕСТЬNULL(ТаблицаСборок.КоличествоПакетов, 0) КАК КоличествоПакетов
	//|ИЗ
	//|	ТаблицаЗаказов КАК ТаблицаЗаказов
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	ТаблицаСборок КАК ТаблицаСборок
	//|ПО
	//|	ТаблицаЗаказов.Заказ = ТаблицаСборок.Заказ
	//|;
	//|
	//|ВЫБРАТЬ
	//|	СборкаЗаказаПокупателяПакеты.ШтрихКод,
	//|	СборкаЗаказаПокупателяПакеты.Пакет,
	//|	СборкаЗаказаПокупателяПакеты.ТоварноеСоседство,
	//|	СборкаЗаказаПокупателяПакеты.ТоварноеСоседство.Код КАК ТоварноеСоседствоКод,
	//|	СборкаЗаказаПокупателяПакеты.ТоварноеСоседство.Наименование КАК ТоварноеСоседствоНаименование,
	//|	ТаблицаСборок.СборкаЗаказа КАК СборкаЗаказа,
	//|	ТаблицаСборок.Заказ КАК Заказ
	//|ИЗ
	//|	ТаблицаСборок КАК ТаблицаСборок
	//|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	//|	Документ.СборкаЗаказаПокупателя.Пакеты КАК СборкаЗаказаПокупателяПакеты
	//|ПО
	//|	ТаблицаСборок.СборкаЗаказа = СборкаЗаказаПокупателяПакеты.Ссылка
	|";
	
	ПакетыЗапроса = Запрос.ВыполнитьПакет();
	
	ЗаказыСборки = ПакетыЗапроса[ПакетыЗапроса.Количество()-2];
	ПакетыСборки = ПакетыЗапроса[ПакетыЗапроса.Количество()-1];
	
	Если ЗаказыСборки.Пустой() Тогда
		ТекстОшибки = "Нет данных по заказам";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
	
	Выборка = ЗаказыСборки.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Заказы"); // Заказы
		
		ЗаписьXML.ЗаписатьАтрибут("КоличествоПакетов", XMLСтрока(Выборка.КоличествоПакетов));
		ЗаписьXML.ЗаписатьАтрибут("Состояние",         XMLСтрока(Выборка.Состояние));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Заказ"); // Заказ
		ЗаписьXML.ЗаписатьАтрибут("Тип",    "ЗаказПокупателя");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Заказ));
		ЗаписьXML.ЗаписатьАтрибут("Номер",  Выборка.НомерЗаказа);
		ЗаписьXML.ЗаписатьАтрибут("Дата",   Строка(Выборка.ДатаЗаказа));
		//ЗаписьXML.ЗаписатьАтрибут("Представление", "Заказ № " + Выборка.НомерЗаказа + " от " + Формат(Выборка.ДатаЗаказа, "ДФ=dd.MM.yyyy"));
		ЗаписьXML.ЗаписатьАтрибут("Представление", "№ " + Выборка.НомерЗаказа + " от " + Формат(Выборка.ДатаЗаказа, "ДФ=dd.MM.yyyy"));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Заказ
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТорговаяТочка"); // Сборка
		ЗаписьXML.ЗаписатьАтрибут("Тип",          "ПодразделенияКомпании");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.ТорговаяТочка));
		ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.ТорговаяТочкаКод);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.ТорговаяТочкаНаименование);
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Сборка
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Заказы
		
	КонецЦикла;
	
	Выборка = ПакетыСборки.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Пакеты"); // Пакеты
		
		ЗаписьXML.ЗаписатьАтрибут("ШтрихКод",     XMLСтрока(Выборка.ШтрихКод));
		ЗаписьXML.ЗаписатьАтрибут("Пакет",        XMLСтрока(Выборка.Пакет));
		ЗаписьXML.ЗаписатьАтрибут("Заказ",        XMLСтрока(Выборка.Заказ));
		ЗаписьXML.ЗаписатьАтрибут("СборкаЗаказа", XMLСтрока(Выборка.СборкаЗаказа));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТоварноеСоседство"); // Родитель
		ЗаписьXML.ЗаписатьАтрибут("Тип",          "ТоварноеСоседство");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.ТоварноеСоседство));
		ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.ТоварноеСоседствоКод);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.ТоварноеСоседствоНаименование);
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Пакеты
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
	
	ЗаписьXML.Закрыть();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция ЗавершитьРазгрузку(СсылкаПодразделениеКомпании, ПараметрыОбмена, Штрихкод, ТекстОшибки)
	
	ТекстОшибки = "";
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи).ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	Пользователь = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
			ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
		Возврат Ложь;
	КонецЕсли;
	
	Оператор = Пользователь.Сотрудник;
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		ТекстОшибки = "У пользователя <"+Пользователь+"> не указан сотрудник";
		Возврат Ложь;
	КонецЕсли;
	
	//СкладПикинга = ПолучитьЗначениеУчетнойПолитики(ПланыВидовХарактеристик.УчетныеПолитики.СкладПикинга, ПодразделениеКомпании);
	
	ДанныеОбмена = ПараметрыОбмена.Получить().ДанныеОбмена;
	ТаблицаПакета = ПолучитьДанныеОбмена(ДанныеОбмена);
	
	Если ТаблицаПакета.Свойства().Получить("СборкиЗаказов") = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	СборкиЗаказов = Новый Массив;
	XDTOТорговыеТочки = ПолучитьСписокИзXDTO(ТаблицаПакета.СборкиЗаказов);
	Для Каждого ТекущаяСтрока Из XDTOТорговыеТочки Цикл
		
		Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Ссылка);
		СборкаЗаказа = Документы.СборкаЗаказаПокупателя.ПолучитьСсылку(Идентификатор);
		
		Если СборкаЗаказа.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		СборкиЗаказов.Добавить(СборкаЗаказа);
		
	КонецЦикла;
	
	ШтрихКоды = Новый Массив;
	XDTOШтрихКоды = ПолучитьСписокИзXDTO(ТаблицаПакета.ШтрихКоды);
	Для Каждого СтрокаШтрихКод Из XDTOШтрихКоды Цикл
		ШтрихКоды.Добавить(СтрокаШтрихКод.ШтрихКод);
	КонецЦикла;
	
	Если СборкиЗаказов.Количество()=0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКоды",     ШтрихКоды);
	Запрос.УстановитьПараметр("СборкиЗаказов", СборкиЗаказов);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СборкаЗаказаПокупателя.Ссылка КАК СборкаЗаказов,
	|	СборкаЗаказаПокупателя.ПодразделениеОтправитель,
	|	СборкаЗаказаПокупателя.ПодразделениеПолучатель,
	|	СборкаЗаказаПокупателя.ДокументОснование КАК ЗаказПокупателя,
	|	СборкаЗаказаПокупателя.ДокументОснование.СкладКомпании КАК СкладКомпании,
	|	СборкаЗаказаПокупателяПакеты.Пакет КАК Пакет,
	|	СборкаЗаказаПокупателяПакеты.ШтрихКод КАК ШтрихКод,
	|	СборкаЗаказаПокупателяПакеты.ТоварноеСоседство КАК ТоварноеСоседство,
	|	СборкаЗаказаПокупателяТовары.Номенклатура,
	|	СборкаЗаказаПокупателяТовары.Количество,
	|	СборкаЗаказаПокупателяТовары.ЕдиницаИзмерения,
	|	СборкаЗаказаПокупателяТовары.Коэффициент,
	|	СборкаЗаказаПокупателяТовары.ХарактеристикаНоменклатуры
	|ИЗ
	|	Документ.СборкаЗаказаПокупателя КАК СборкаЗаказаПокупателя
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.СборкаЗаказаПокупателя.Пакеты КАК СборкаЗаказаПокупателяПакеты
	|ПО
	|	СборкаЗаказаПокупателя.Ссылка = СборкаЗаказаПокупателяПакеты.Ссылка
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.СборкаЗаказаПокупателя.Товары КАК СборкаЗаказаПокупателяТовары
	|ПО
	|	СборкаЗаказаПокупателяПакеты.Ссылка = СборкаЗаказаПокупателяТовары.Ссылка И 
	|	СборкаЗаказаПокупателяПакеты.Пакет = СборкаЗаказаПокупателяТовары.Пакет
	|ГДЕ
	|	СборкаЗаказаПокупателя.Ссылка В (&СборкиЗаказов) И 
	|	СборкаЗаказаПокупателяПакеты.ШтрихКод В (&ШтрихКоды)
	|ИТОГИ
	|	МАКСИМУМ(ШтрихКод),
	|	МАКСИМУМ(СборкаЗаказов),
	|	МАКСИМУМ(ТоварноеСоседство)
	|ПО
	|	ПодразделениеОтправитель,
	|	ПодразделениеПолучатель,
	|	СкладКомпании,
	|	ЗаказПокупателя,
	|	Пакет
	|";
	
	Попытка
		
		НачатьТранзакцию();
		ВыборкаОтправитель = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОтправитель.Следующий() Цикл
			ВыборкаПолучатель = ВыборкаОтправитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПолучатель.Следующий() Цикл
				
				ВыборкаСкладКомпании = ВыборкаПолучатель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаСкладКомпании.Следующий() Цикл
					
					ДокументОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
					ДокументОбъект.Заполнить(Неопределено);
					ДокументОбъект.Автор = Пользователь;
					ДокументОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровИзФилиала;
					Документы.ПеремещениеТоваров.ХозОперацияПриИзменении(ДокументОбъект);
					
					ДокументОбъект.ПодразделениеКомпании = ВыборкаСкладКомпании.ПодразделениеПолучатель;
					Документы.ПеремещениеТоваров.ПодразделениеКомпанииПриИзменении(ДокументОбъект);
					
					ДокументОбъект.СкладКомпании   = ВыборкаСкладКомпании.ПодразделениеОтправитель;
					Документы.ПеремещениеТоваров.СкладКомпанииПриИзменении(ДокументОбъект);
					
					ДокументОбъект.СкладПолучатель = ВыборкаСкладКомпании.СкладКомпании;
					Документы.ПеремещениеТоваров.СкладПолучательПриИзменении(ДокументОбъект);
					
					ВыборкаЗаказПокупателя = ВыборкаСкладКомпании.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаЗаказПокупателя.Следующий() Цикл
						ВыборкаПакет = ВыборкаЗаказПокупателя.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаПакет.Следующий() Цикл
							
							НовыйПакет = ДокументОбъект.Пакеты.Добавить();
							НовыйПакет.ИдентификаторУпаковки = ВыборкаПакет.ШтрихКод;
							НовыйПакет.Пакет                 = ВыборкаПакет.Пакет;
							НовыйПакет.ТоварноеСоседство     = ВыборкаПакет.ТоварноеСоседство;
							
							Выборка = ВыборкаПакет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока Выборка.Следующий() Цикл
								НоваяСтрока = ДокументОбъект.Товары.Добавить();
								НоваяСтрока.Номенклатура               = Выборка.Номенклатура;
								НоваяСтрока.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
								НоваяСтрока.Коэффициент                = Выборка.Коэффициент;
								НоваяСтрока.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
								НоваяСтрока.ИдентификаторУпаковки      = Выборка.ШтрихКод;
								Документы.ПеремещениеТоваров.ТоварыНоменклатураПриИзменении(ДокументОбъект, НоваяСтрока);
								
								НоваяСтрока.Количество = Выборка.Количество;
								Документы.ПеремещениеТоваров.ТоварыКоличествоПриИзменении(ДокументОбъект, НоваяСтрока);
								
								НоваяСтрока.ЗаказПокупателя = Выборка.ЗаказПокупателя;
								
							КонецЦикла;
						КонецЦикла;
						
						НаборЗаписей = РегистрыСведений.СостоянияВыполненияЗаказовПокупателей.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.Заказ.Установить(ВыборкаЗаказПокупателя.ЗаказПокупателя);
						НаборЗаписей.Прочитать();
						
						Если НаборЗаписей.Количество() = 0 Тогда
							Запись = НаборЗаписей.Добавить();
						Иначе
							Запись = НаборЗаписей[0];
						КонецЕсли;
						
						Запись.Заказ     = ВыборкаЗаказПокупателя.ЗаказПокупателя;
						Запись.Состояние = Перечисления.СостоянияВыполненияЗаказовПокупателей.ЗаказДоставленВТочку;
						НаборЗаписей.Записать(Истина);
						
					КонецЦикла;
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат = СформироватьДанныеПередачи(Неопределено);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьЗаказыНаТочке(СсылкаПодразделениеКомпании, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СостоянияВыполненияЗаказовПокупателей.Заказ.ПодразделениеКомпании КАК ТорговаяТочка,
	|	СостоянияВыполненияЗаказовПокупателей.Заказ КАК Заказ,
	|	СостоянияВыполненияЗаказовПокупателей.Состояние
	|ПОМЕСТИТЬ
	|	ТаблицаЗаказов
	|ИЗ
	|	РегистрСведений.СостоянияВыполненияЗаказовПокупателей КАК СостоянияВыполненияЗаказовПокупателей
	|ГДЕ
	|	СостоянияВыполненияЗаказовПокупателей.Заказ.ПодразделениеКомпании = &ПодразделениеКомпании И 
	|	СостоянияВыполненияЗаказовПокупателей.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВыполненияЗаказовПокупателей.ЗаказДоставленВТочку)
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЗаказов.Заказ КАК Заказ
	|ПОМЕСТИТЬ
	|	ЗаказыВПути
	|ИЗ
	|	ТаблицаЗаказов КАК ТаблицаЗаказов
	|;
	|
	|ВЫБРАТЬ
	|	СборкаЗаказаПокупателя.ПодразделениеПолучатель КАК ТорговаяТочка,
	|	СборкаЗаказаПокупателя.Ссылка КАК СборкаЗаказа,
	|	ТаблицаЗаказов.Заказ КАК Заказ,
	|	СборкаЗаказаПокупателя.КоличествоПакетов КАК КоличествоПакетов
	|ПОМЕСТИТЬ
	|	ТаблицаСборок
	|ИЗ
	|	ЗаказыВПути КАК ТаблицаЗаказов
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.СборкаЗаказаПокупателя КАК СборкаЗаказаПокупателя
	|ПО
	|	ТаблицаЗаказов.Заказ = СборкаЗаказаПокупателя.ДокументОснование И 
	|	СборкаЗаказаПокупателя.ПодразделениеПолучатель = &ПодразделениеКомпании
	|ГДЕ
	|	СборкаЗаказаПокупателя.ПодразделениеПолучатель = &ПодразделениеКомпании И 
	|	СборкаЗаказаПокупателя.Проведен
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЗаказов.ТорговаяТочка КАК ТорговаяТочка,
	|	ТаблицаЗаказов.ТорговаяТочка.Код КАК ТорговаяТочкаКод,
	|	ТаблицаЗаказов.ТорговаяТочка.Наименование КАК ТорговаяТочкаНаименование,
	|	ТаблицаЗаказов.ТорговаяТочка.НаименованиеПолное КАК ТорговаяТочкаНаименованиеПолное,
	|	ТаблицаЗаказов.Заказ КАК Заказ,
	|	ТаблицаЗаказов.Заказ.Номер КАК НомерЗаказа,
	|	ТаблицаЗаказов.Заказ.Дата КАК ДатаЗаказа,
	|	ТаблицаЗаказов.Состояние,
	|	ЕСТЬNULL(ТаблицаСборок.КоличествоПакетов, 0) КАК КоличествоПакетов
	|ИЗ
	|	ТаблицаЗаказов КАК ТаблицаЗаказов
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТаблицаСборок КАК ТаблицаСборок
	|ПО
	|	ТаблицаЗаказов.Заказ = ТаблицаСборок.Заказ
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПеремещениеТоваровТовары.ИдентификаторУпаковки КАК ШтрихКод,
	|	ПеремещениеТоваровПакеты.Пакет,
	|	ПеремещениеТоваровПакеты.ТоварноеСоседство,
	|	ПеремещениеТоваровПакеты.ТоварноеСоседство.Код КАК ТоварноеСоседствоКод,
	|	ПеремещениеТоваровПакеты.ТоварноеСоседство.Наименование КАК ТоварноеСоседствоНаименование,
	|	ТаблицаСборок.СборкаЗаказа КАК СборкаЗаказа,
	|	ТаблицаСборок.Заказ КАК Заказ
	|ИЗ
	|	ТаблицаСборок КАК ТаблицаСборок
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ПО
	|	ТаблицаСборок.Заказ = ПеремещениеТоваровТовары.ЗаказПокупателя
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ПеремещениеТоваров.Пакеты КАК ПеремещениеТоваровПакеты
	//|	Документ.СборкаЗаказаПокупателя.Пакеты КАК СборкаЗаказаПокупателяПакеты
	|ПО
	//|	ТаблицаСборок.СборкаЗаказа = СборкаЗаказаПокупателяПакеты.Ссылка
	|	ПеремещениеТоваровТовары.Ссылка = ПеремещениеТоваровПакеты.Ссылка И 
	|	ПеремещениеТоваровТовары.ИдентификаторУпаковки = ПеремещениеТоваровПакеты.ИдентификаторУпаковки
	|ГДЕ
	|	ПеремещениеТоваровПакеты.Ссылка.Проведен И 
	|	ПеремещениеТоваровПакеты.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПеремещениеТоваровИзФилиала)
	|";
	
	ПакетыЗапроса = Запрос.ВыполнитьПакет();
	
	ЗаказыСборки = ПакетыЗапроса[ПакетыЗапроса.Количество()-2];
	ПакетыСборки = ПакетыЗапроса[ПакетыЗапроса.Количество()-1];
	
	Если ЗаказыСборки.Пустой() Тогда
		ТекстОшибки = "Нет данных по заказам";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
	
	Выборка = ЗаказыСборки.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Заказы"); // Заказы
		
		ЗаписьXML.ЗаписатьАтрибут("КоличествоПакетов", XMLСтрока(Выборка.КоличествоПакетов));
		ЗаписьXML.ЗаписатьАтрибут("Состояние",         XMLСтрока(Выборка.Состояние));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Заказ"); // Заказ
		ЗаписьXML.ЗаписатьАтрибут("Тип",    "ЗаказПокупателя");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Заказ));
		ЗаписьXML.ЗаписатьАтрибут("Номер",  Выборка.НомерЗаказа);
		ЗаписьXML.ЗаписатьАтрибут("Дата",   Строка(Выборка.ДатаЗаказа));
		//ЗаписьXML.ЗаписатьАтрибут("Представление", "Заказ № " + Выборка.НомерЗаказа + " от " + Формат(Выборка.ДатаЗаказа, "ДФ=dd.MM.yyyy"));
		ЗаписьXML.ЗаписатьАтрибут("Представление", "№ " + Выборка.НомерЗаказа + " от " + Формат(Выборка.ДатаЗаказа, "ДФ=dd.MM.yyyy"));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Заказ
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТорговаяТочка"); // Сборка
		ЗаписьXML.ЗаписатьАтрибут("Тип",          "ПодразделенияКомпании");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.ТорговаяТочка));
		ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.ТорговаяТочкаКод);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.ТорговаяТочкаНаименование);
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Сборка
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Заказы
		
	КонецЦикла;
	
	Выборка = ПакетыСборки.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Пакеты"); // Пакеты
		
		ЗаписьXML.ЗаписатьАтрибут("ШтрихКод",     XMLСтрока(Выборка.ШтрихКод));
		ЗаписьXML.ЗаписатьАтрибут("Пакет",        XMLСтрока(Выборка.Пакет));
		ЗаписьXML.ЗаписатьАтрибут("Заказ",        XMLСтрока(Выборка.Заказ));
		ЗаписьXML.ЗаписатьАтрибут("СборкаЗаказа", XMLСтрока(Выборка.СборкаЗаказа));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ТоварноеСоседство"); // Родитель
		ЗаписьXML.ЗаписатьАтрибут("Тип",          "ТоварноеСоседство");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка",       СериализоватьСсылку(Выборка.ТоварноеСоседство));
		ЗаписьXML.ЗаписатьАтрибут("Код",          Выборка.ТоварноеСоседствоКод);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.ТоварноеСоседствоНаименование);
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Пакеты
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
	
	ЗаписьXML.Закрыть();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьРеализациюТоваров(СсылкаПодразделениеКомпании, ПараметрыОбмена, Штрихкод, ТекстОшибки)
	
	ТекстОшибки = "";
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи).ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	Пользователь = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
			ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
		Возврат Ложь;
	КонецЕсли;
	
	Оператор = Пользователь.Сотрудник;
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		ТекстОшибки = "У пользователя <"+Пользователь+"> не указан сотрудник";
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеОбмена = ПараметрыОбмена.Получить().ДанныеОбмена;
	ТаблицаПакета = ПолучитьДанныеОбмена(ДанныеОбмена);
	
	Если ТаблицаПакета.Свойства().Получить("Заказ") = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Идентификатор = Новый УникальныйИдентификатор(ТаблицаПакета.Заказ.Ссылка);
	ЗаказПокупателя = Документы.ЗаказПокупателя.ПолучитьСсылку(Идентификатор);
	
	Если ЗаказПокупателя.Пустая() Тогда
		ТекстОшибки = ТекстОшибки + "
		|Не найден заказ
		|";
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		НачатьТранзакцию();
		
		РеквизитыЗаказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗаказПокупателя, "СкладКомпании");
		
		ДокументОбъект = Документы.РеализацияТоваров.СоздатьДокумент();
		ДокументОбъект.Заполнить(ЗаказПокупателя);
		
		ДокументОбъект.ХозОперация = Справочники.ХозОперации.РеализацияТоваров;
		Документы.РеализацияТоваров.ХозОперацияПриИзменении(ДокументОбъект);
		
		ДокументОбъект.ПодразделениеКомпании = ПодразделениеКомпании;
		Документы.РеализацияТоваров.ПодразделениеКомпанииПриИзменении(ДокументОбъект);
		
		ДокументОбъект.Автор = Пользователь;
		
		Если Не ДокументОбъект.СкладКомпании = РеквизитыЗаказа.СкладКомпании Тогда
			ДокументОбъект.СкладКомпании = РеквизитыЗаказа.СкладКомпании;
			Документы.РеализацияТоваров.СкладКомпанииПриИзменении(ДокументОбъект);
		КонецЕсли;
		
		Организация = ДокументОбъект.СкладКомпании.Организация;
		Если НЕ Организация = ДокументОбъект.Организация Тогда
			ДокументОбъект.Организация = Организация;
			Документы.РеализацияТоваров.ОрганизацияПриИзменении(ДокументОбъект);
		КонецЕсли;
		
		ДокументОбъект.УстановитьНовыйНомер();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ТекстОшибки = ТекстОшибки + "
			|Документ <"+Строка(ДокументОбъект.Ссылка)+"> не проведен!
			|"+ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		НаборЗаписей = РегистрыСведений.СостоянияВыполненияЗаказовПокупателей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Заказ.Установить(ЗаказПокупателя);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		
		Запись.Заказ     = ЗаказПокупателя;
		Запись.Состояние = Перечисления.СостоянияВыполненияЗаказовПокупателей.Выполнен;
		НаборЗаписей.Записать(Истина);
		
		ТекстОшибки = "Заказ реализован";
		
		ЗафиксироватьТранзакцию();
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат = СформироватьДанныеПередачи(Неопределено);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область Отчеты

Функция ОтчетСостояниеЗаказовПоставщикам(СсылкаПодразделениеКомпании, КонецПериода, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстОшибки = "";
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		ТекстОшибки = "Не указано подразделение";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	НаДату = Дата(КонецПериода);
	Если НЕ ЗначениеЗаполнено(НаДату) Тогда
		НаДату = ТекущаяДата();
	КонецЕсли;
	
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить(); 
	ИсточникДанных.Имя                = "ИсточникДанных";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Ложь;
	НаборДанных.Имя            = "НаборДанных";
	НаборДанных.ИсточникДанных = "ИсточникДанных";
	НаборДанных.Запрос = "ВЫБРАТЬ
	                     |	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	                     |	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	                     |	ЗаказыПоставщикамОстатки.ЗаказаноПриход КАК Заказано,
	                     |	ВЫБОР
	                     |		КОГДА НЕ итСостоянияДокументовЭДО_LeraData.Состояния ЕСТЬ NULL
	                     |			ТОГДА ВЫБОР
	                     |					КОГДА итСостоянияДокументовЭДО_LeraData.Состояния = ЗНАЧЕНИЕ(Перечисление.итСостоянияЭДО.ПолученоПодтверждениеОтПоставщика)
	                     |							ИЛИ итСостоянияДокументовЭДО_LeraData.Состояния = ЗНАЧЕНИЕ(Перечисление.итСостоянияЭДО.ПолученоУведомлениеОбОтгрузкеОтПоставщика)
	                     //|							ИЛИ итСостоянияДокументовЭДО_LeraData.Состояния = ЗНАЧЕНИЕ(Перечисление.итСостоянияЭДО.ОтправленПоставщику)
	                     |						ТОГДА ""Да""
	                     |					ИНАЧЕ ""Нет""
	                     |				КОНЕЦ
	                     |		КОГДА ПОДСТРОКА(ЗаказыПоставщикамОстатки.ЗаказПоставщику.Комментарий, 0, 15) ПОДОБНО ""%Загружен в ЕРП%""
	                     |			ТОГДА ""Да""
	                     |		КОГДА НЕ итРассылкаЗаказПоставщику.ЭлектронноеПисьмо ЕСТЬ NULL
	                     |			ТОГДА ""Да""
	                     |		ИНАЧЕ ""Нет""
	                     |	КОНЕЦ КАК УПоставщика,
	                     |	ЗаказыПоставщикамОстатки.Контрагент КАК Поставщик
	                     |ПОМЕСТИТЬ ТаблицаЗаказов
	                     |ИЗ
	                     |	РегистрНакопления.ЗаказыПоставщикам.Обороты({(&НаДатуНачало)}, {(&НаДатуКонец)}, , ЗаказПоставщику.ПодразделениеКомпании = &ПодразделениеКомпании) КАК ЗаказыПоставщикамОстатки
	                     |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.итСостоянияДокументовЭДО_LeraData КАК итСостоянияДокументовЭДО_LeraData
	                     |		ПО ЗаказыПоставщикамОстатки.ЗаказПоставщику = итСостоянияДокументовЭДО_LeraData.СсылкаНаОбъект
	                     |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.итРассылкаЗаказПоставщику КАК итРассылкаЗаказПоставщику
	                     |		ПО ЗаказыПоставщикамОстатки.ЗаказПоставщику = итРассылкаЗаказПоставщику.ЗаказПоставщику
	                     |			И (итРассылкаЗаказПоставщику.Обработано)
	                     |			И ((ВЫРАЗИТЬ(итРассылкаЗаказПоставщику.ТекстОшибки КАК СТРОКА(10))) = """")
	                     |ГДЕ
	                     |	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ВнешнийПоставщик)
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |ВЫБРАТЬ
	                     |	ТаблицаЗаказов.Номенклатура КАК Номенклатура,
	                     |	ТаблицаЗаказов.Заказано КАК Заказано,
	                     |	ТаблицаЗаказов.УПоставщика КАК УПоставщика,
	                     |	ТаблицаЗаказов.Поставщик КАК Поставщик,
	                     |	ПОДСТРОКА(""0123456789"", ДЕНЬ(ТаблицаЗаказов.ЗаказПоставщику.СрокПоставки) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ДЕНЬ(ТаблицаЗаказов.ЗаказПоставщику.СрокПоставки))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", МЕСЯЦ(ТаблицаЗаказов.ЗаказПоставщику.СрокПоставки) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МЕСЯЦ(ТаблицаЗаказов.ЗаказПоставщику.СрокПоставки))) / 6 + 1, 1) + ""/"" + ПОДСТРОКА(""0123456789"", ГОД(ТаблицаЗаказов.ЗаказПоставщику.СрокПоставки) / 1000 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ТаблицаЗаказов.ЗаказПоставщику.СрокПоставки) * 0.06)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ТаблицаЗаказов.ЗаказПоставщику.СрокПоставки) * 0.6)) / 6 + 1, 1) + ПОДСТРОКА(""0123456789"", СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, ГОД(ТаблицаЗаказов.ЗаказПоставщику.СрокПоставки) * 6)) / 6 + 1, 1) КАК СрокПоставки
	                     |{ВЫБРАТЬ
	                     |	Номенклатура КАК Номенклатура,
	                     |	Заказано КАК Заказано,
	                     |	УПоставщика КАК УПоставщика,
	                     |	Поставщик,
	                     |	СрокПоставки}
	                     |ИЗ
	                     |	ТаблицаЗаказов КАК ТаблицаЗаказов
	                     |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВыполненияЗаказовПоставщикам КАК СостоянияВыполненияЗаказовПоставщикам
	                     |		ПО ТаблицаЗаказов.ЗаказПоставщику = СостоянияВыполненияЗаказовПоставщикам.Заказ
	                     |ГДЕ
	                     |	СостоянияВыполненияЗаказовПоставщикам.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВыполненияЗаказовПоставщикам.Согласован)";
	
	НовыйПараметр = СхемаКомпоновкиДанных.Параметры.Добавить();
	НовыйПараметр.Имя = "НаДатуНачало";
	НовыйПараметр.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	НовыйПараметр.ОграничениеИспользования = Истина;
	
	НовыйПараметр = СхемаКомпоновкиДанных.Параметры.Добавить();
	НовыйПараметр.Имя = "НаДатуКонец";
	НовыйПараметр.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	НовыйПараметр.ОграничениеИспользования = Истина;	
	
	НовыйПараметр = СхемаКомпоновкиДанных.Параметры.Добавить();
	НовыйПараметр.Имя = "ПодразделениеКомпании";
	НовыйПараметр.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	НовыйПараметр.ОграничениеИспользования = Истина;
	
	КомпоновщикСКД = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикСКД.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикСКД.Восстановить();
	
	ВыбранноеПоле = КомпоновщикСКД.Настройки.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	
	СтруктураВУ = КомпоновщикСКД.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	СтруктураВУ.Использование = Истина;
	
	//ВыбранноеПоле = КомпоновщикСКД.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	//ВыбранноеПоле.Использование = Истина;
	//ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Номенклатура");
	//
	//ВыбранноеПоле = КомпоновщикСКД.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	//ВыбранноеПоле.Использование = Истина;
	//ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Заказано");
	
	//Структура = КомпоновщикСКД.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	//Структура.Использование = Истина;
	//
	ПолеГруппировки = СтруктураВУ.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Поставщик");
	ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
	
	ВыбранноеПоле = СтруктураВУ.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Поставщик");
	
	Структура = СтруктураВУ.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Структура.Использование = Истина;
	
	
	//
	ВыбранноеПоле = Структура.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Номенклатура");
	
	ГруппаПолей = Структура.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	 // Установим шапку группы полей.
	ГруппаПолей.Заголовок = "";
	 // Укажем размещение.
	ГруппаПолей.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
	
	// 
	ВыбранноеПоле = ГруппаПолей.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Заказано");
	//
	ВыбранноеПоле = ГруппаПолей.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("УПоставщика");
	//
	ВыбранноеПоле = ГруппаПолей.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("СрокПоставки");
	
	
	// 
	//ВыбранноеПоле = Структура.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	//ВыбранноеПоле.Использование = Истина;
	//ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Заказано");
	//
	//ВыбранноеПоле = Структура.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	//ВыбранноеПоле.Использование = Истина;
	//ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("УПоставщика");
	//
	//ВыбранноеПоле = Структура.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	//ВыбранноеПоле.Использование = Истина;
	//ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("СрокПоставки");
	
	
	УсловноеОформление = КомпоновщикСКД.Настройки.УсловноеОформление.Элементы.Добавить();
	УсловноеОформление.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных = УсловноеОформление.Поля.Элементы.Добавить();
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Номенклатура");
	
	ВыбранноеПолеКомпоновкиДанных = УсловноеОформление.Поля.Элементы.Добавить();
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Заказано");

	ВыбранноеПолеКомпоновкиДанных = УсловноеОформление.Поля.Элементы.Добавить();
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("УПоставщика");

	ВыбранноеПолеКомпоновкиДанных = УсловноеОформление.Поля.Элементы.Добавить();
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Поставщик");
	
	КомпоновщикСКД.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПодразделениеКомпании", ПодразделениеКомпании);
	КомпоновщикСКД.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаДатуНачало", НачалоДня(НаДату));
	КомпоновщикСКД.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НаДатуКонец", КонецДня(НаДату));
	
	
	КомпоновщикСКД.Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ВыводитьЗаголовок", Ложь);
	КомпоновщикСКД.Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ВыводитьПараметрыДанных", Ложь);
	КомпоновщикСКД.Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ВыводитьОтбор", Ложь);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикСКД.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанных"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	РезультатОтчета = Новый ТабличныйДокумент;
	
	ПроцессорВыводаРезультатаКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаРезультатаКД.УстановитьДокумент(РезультатОтчета);
	ПроцессорВыводаРезультатаКД.Вывести(ПроцессорКомпоновкиДанных);
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	//ЗаписьXML.УстановитьСтроку();
	
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, РезультатОтчета);
	ТекстЗапроса = ЗаписьXML.Закрыть();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТоварыДляЗаказа(ВидЗаказаСсылка,ПодразделениеКомпании,КонтрагентМПЗ)
		
		Если ВидЗаказаСсылка <> Перечисления.рздВидыЗаказовЕРП.ЗаказВнешнийПоставщик Тогда
					
			Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	БлокировкаАссортиментаСрезПоследних.Номенклатура КАК Номенклатура,
		                      |	БлокировкаАссортиментаСрезПоследних.Заблокировано КАК Заблокировано
		                      |ПОМЕСТИТЬ втЗаблокированныйАссортимент
		                      |ИЗ
		                      |	РегистрСведений.БлокировкаАссортимента.СрезПоследних КАК БлокировкаАссортиментаСрезПоследних
		                      |ГДЕ
		                      |	БлокировкаАссортиментаСрезПоследних.ПодразделениеКомпании = &ВыбПодразделение
		                      |	И БлокировкаАссортиментаСрезПоследних.Контрагент = &КонтрагентМПЗ
		                      |	И БлокировкаАссортиментаСрезПоследних.СрокДействия >= &НаДату
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	БлокировкаАссортиментаСрезПоследних.Номенклатура,
		                      |	БлокировкаАссортиментаСрезПоследних.Заблокировано
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура КАК Ключ,
		                      |	0 КАК Количество,
		                      |	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа КАК Значение,
		                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние КАК Состояние,
		                      |	МАКСИМУМ(СогласованныеЦеныСрезПоследних.Период) КАК Период,
		                      |	СогласованныеЦеныСрезПоследних.Контрагент КАК Контрагент,
		                      |	СогласованныеЦеныСрезПоследних.Номенклатура КАК Номенклатура,
		                      |	СогласованныеЦеныСрезПоследних.ПодразделениеКомпании КАК ПодразделениеКомпании
		                      |ПОМЕСТИТЬ втАссортиментМаксимальныйПериод
		                      |ИЗ
		                      |	РегистрСведений.ОграничениеАссортиментаПодразделения.СрезПоследних(&НаДату, ) КАК ОграничениеАссортиментаПодразделенияСрезПоследних
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры КАК ит_СоответствиеВидаЗаявкиВидуНоменклатуры
		                      |		ПО ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ит_ВидЗаявки = ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказаНоменклатура
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СогласованныеЦены.СрезПоследних(&НаДату, ) КАК СогласованныеЦеныСрезПоследних
		                      |		ПО ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура = СогласованныеЦеныСрезПоследних.Номенклатура
		                      |			И (СогласованныеЦеныСрезПоследних.Контрагент = &КонтрагентМПЗ)
		                      |			И ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании = СогласованныеЦеныСрезПоследних.ПодразделениеКомпании
		                      |ГДЕ
		                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании = &ВыбПодразделение
		                      |	И ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа = &ВидЗаказа
		                      |	И ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
		                      |	И СогласованныеЦеныСрезПоследних.СрокДействия >= &НаДату
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура,
		                      |	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа,
		                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние,
		                      |	СогласованныеЦеныСрезПоследних.Контрагент,
		                      |	СогласованныеЦеныСрезПоследних.Номенклатура,
		                      |	СогласованныеЦеныСрезПоследних.ПодразделениеКомпании
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	игГруппыНоменклатурыПродажиМПЗ.Группа КАК Группа
		                      |ПОМЕСТИТЬ втГруппыПродажиМПЗ
		                      |ИЗ
		                      |	РегистрСведений.игГруппыНоменклатурыПродажиМПЗ КАК игГруппыНоменклатурыПродажиМПЗ
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	втАссортиментМаксимальныйПериод.Ключ КАК Ключ,
		                      |	втАссортиментМаксимальныйПериод.Количество КАК Количество,
		                      |	втАссортиментМаксимальныйПериод.Значение КАК Значение,
		                      |	втАссортиментМаксимальныйПериод.Состояние КАК Состояние,
		                      |	МАКСИМУМ(СогласованныеЦены.Цена) КАК Цена
		                      |ИЗ
		                      |	втАссортиментМаксимальныйПериод КАК втАссортиментМаксимальныйПериод
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
		                      |		ПО втАссортиментМаксимальныйПериод.Период = СогласованныеЦены.Период
		                      |			И втАссортиментМаксимальныйПериод.Контрагент = СогласованныеЦены.Контрагент
		                      |			И втАссортиментМаксимальныйПериод.Номенклатура = СогласованныеЦены.Номенклатура
		                      |			И втАссортиментМаксимальныйПериод.ПодразделениеКомпании = СогласованныеЦены.ПодразделениеКомпании
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ втЗаблокированныйАссортимент КАК втЗаблокированныйАссортимент
		                      |		ПО втАссортиментМаксимальныйПериод.Номенклатура = втЗаблокированныйАссортимент.Номенклатура
		                      |			И (втЗаблокированныйАссортимент.Заблокировано)
		                      |ГДЕ
		                      |	СогласованныеЦены.Цена <> 0
		                      |	И втЗаблокированныйАссортимент.Номенклатура ЕСТЬ NULL
		                      |	И втАссортиментМаксимальныйПериод.Ключ В ИЕРАРХИИ
		                      |			(ВЫБРАТЬ
		                      |				втГруппыПродажиМПЗ.Группа КАК Группа
		                      |			ИЗ
		                      |				втГруппыПродажиМПЗ КАК втГруппыПродажиМПЗ)
		                      |	И втАссортиментМаксимальныйПериод.Ключ.ОсновнаяЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	втАссортиментМаксимальныйПериод.Ключ,
		                      |	втАссортиментМаксимальныйПериод.Количество,
		                      |	втАссортиментМаксимальныйПериод.Значение,
		                      |	втАссортиментМаксимальныйПериод.Состояние");
		 
	 
	 Иначе
					
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	БлокировкаАссортиментаСрезПоследних.Номенклатура КАК Номенклатура,
		                      |	БлокировкаАссортиментаСрезПоследних.Заблокировано КАК Заблокировано
		                      |ПОМЕСТИТЬ втЗаблокированныйАссортимент
		                      |ИЗ
		                      |	РегистрСведений.БлокировкаАссортимента.СрезПоследних КАК БлокировкаАссортиментаСрезПоследних
		                      |ГДЕ
		                      |	БлокировкаАссортиментаСрезПоследних.ПодразделениеКомпании = &ВыбПодразделение
		                      |	И БлокировкаАссортиментаСрезПоследних.Контрагент <> &КонтрагентМПЗ
		                      |	И БлокировкаАссортиментаСрезПоследних.СрокДействия >= &НаДату
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	БлокировкаАссортиментаСрезПоследних.Номенклатура,
		                      |	БлокировкаАссортиментаСрезПоследних.Заблокировано
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура КАК Ключ,
		                      |	0 КАК Количество,
		                      |	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа КАК Значение,
		                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние КАК Состояние,
		                      |	МАКСИМУМ(СогласованныеЦеныСрезПоследних.Период) КАК Период,
		                      |	СогласованныеЦеныСрезПоследних.Контрагент КАК Контрагент,
		                      |	СогласованныеЦеныСрезПоследних.Номенклатура КАК Номенклатура,
		                      |	СогласованныеЦеныСрезПоследних.ПодразделениеКомпании КАК ПодразделениеКомпании
		                      |ПОМЕСТИТЬ втАссортиментМаксимальныйПериод
		                      |ИЗ
		                      |	РегистрСведений.ОграничениеАссортиментаПодразделения.СрезПоследних(&НаДату, ) КАК ОграничениеАссортиментаПодразделенияСрезПоследних
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры КАК ит_СоответствиеВидаЗаявкиВидуНоменклатуры
		                      |		ПО ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ит_ВидЗаявки = ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказаНоменклатура
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СогласованныеЦены.СрезПоследних(&НаДату, ) КАК СогласованныеЦеныСрезПоследних
		                      |		ПО ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура = СогласованныеЦеныСрезПоследних.Номенклатура
		                      |			И (СогласованныеЦеныСрезПоследних.Контрагент <> &КонтрагентМПЗ)
		                      |			И ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании = СогласованныеЦеныСрезПоследних.ПодразделениеКомпании
		                      |ГДЕ
		                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании = &ВыбПодразделение
		                      |	И ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа = &ВидЗаказа
		                      |	И ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
		                      |	И СогласованныеЦеныСрезПоследних.СрокДействия >= &НаДату
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура,
		                      |	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа,
		                      |	ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние,
		                      |	СогласованныеЦеныСрезПоследних.Контрагент,
		                      |	СогласованныеЦеныСрезПоследних.Номенклатура,
		                      |	СогласованныеЦеныСрезПоследних.ПодразделениеКомпании
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	игГруппыНоменклатурыПродажиМПЗ.Группа КАК Группа
		                      |ПОМЕСТИТЬ втГруппыПродажиМПЗ
		                      |ИЗ
		                      |	РегистрСведений.игГруппыНоменклатурыПродажиМПЗ КАК игГруппыНоменклатурыПродажиМПЗ
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	втАссортиментМаксимальныйПериод.Ключ КАК Ключ,
		                      |	втАссортиментМаксимальныйПериод.Количество КАК Количество,
		                      |	втАссортиментМаксимальныйПериод.Значение КАК Значение,
		                      |	втАссортиментМаксимальныйПериод.Состояние КАК Состояние,
		                      |	МАКСИМУМ(СогласованныеЦены.Цена) КАК Цена
		                      |ИЗ
		                      |	втАссортиментМаксимальныйПериод КАК втАссортиментМаксимальныйПериод
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
		                      |		ПО втАссортиментМаксимальныйПериод.Период = СогласованныеЦены.Период
		                      |			И втАссортиментМаксимальныйПериод.Контрагент = СогласованныеЦены.Контрагент
		                      |			И втАссортиментМаксимальныйПериод.Номенклатура = СогласованныеЦены.Номенклатура
		                      |			И втАссортиментМаксимальныйПериод.ПодразделениеКомпании = СогласованныеЦены.ПодразделениеКомпании
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ втЗаблокированныйАссортимент КАК втЗаблокированныйАссортимент
		                      |		ПО втАссортиментМаксимальныйПериод.Номенклатура = втЗаблокированныйАссортимент.Номенклатура
		                      |			И (втЗаблокированныйАссортимент.Заблокировано)
		                      |ГДЕ
		                      |	СогласованныеЦены.Цена <> 0
		                      |	И втЗаблокированныйАссортимент.Номенклатура ЕСТЬ NULL
		                      |	И втАссортиментМаксимальныйПериод.Ключ.ит_ОсновнойПоставщик <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		                      |	И втАссортиментМаксимальныйПериод.Ключ.ит_ОсновнойПоставщик <> &КонтрагентМПЗ
		                      |	И НЕ втАссортиментМаксимальныйПериод.Ключ В ИЕРАРХИИ
		                      |				(ВЫБРАТЬ
		                      |					втГруппыПродажиМПЗ.Группа КАК Группа
		                      |				ИЗ
		                      |					втГруппыПродажиМПЗ КАК втГруппыПродажиМПЗ)
		                      |	И втАссортиментМаксимальныйПериод.Ключ.ОсновнаяЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	втАссортиментМаксимальныйПериод.Ключ,
		                      |	втАссортиментМаксимальныйПериод.Количество,
		                      |	втАссортиментМаксимальныйПериод.Значение,
		                      |	втАссортиментМаксимальныйПериод.Состояние");
		 
		 
	 КонецЕсли;	 
	 
	 Запрос.УстановитьПараметр("ВыбПодразделение", ПодразделениеКомпании);
	 Запрос.УстановитьПараметр("НаДату", ТекущаяДата());	 
	 Запрос.УстановитьПараметр("ВидЗаказа", ВидЗаказаСсылка);
	 Запрос.УстановитьПараметр("КонтрагентМПЗ", КонтрагентМПЗ);
	 
	 тбРезультат = Запрос.Выполнить().Выгрузить();
Возврат тбРезультат;
КонецФункции	

Функция СоздатьДопЗаказПоставщику(СсылкаПодразделениеКомпании, ВидЗаказа)
		
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	ОтветСтруктура = Новый Структура();
	Если НЕ ЗначениеЗаполнено(ВидЗаказа) Тогда
		ОтветСтруктура.Вставить("КодОтвета", 0);				
		ОтветСтруктура.Вставить("Ошибка", "Пустой вид заказа");
		Возврат Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	КонецЕсли;
	
	
	Попытка 
		ВидЗаказаСсылка = Перечисления.рздВидыЗаказовЕРП[ВидЗаказа];
	Исключение
		ОтветСтруктура.Вставить("КодОтвета", 0);		
		ОтветСтруктура.Вставить("Ошибка", "Не верный вид заказа");
		Возврат Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	КонецПопытки;	
	
	КонтрагентМПЗ = Справочники.Контрагенты.НайтиПоРеквизиту("ЕРПМастерКлюч","00000019376").Ссылка;

	тбРезультат = ПолучитьТоварыДляЗаказа(ВидЗаказаСсылка,ПодразделениеКомпании,КонтрагентМПЗ);
	 
	 // ищем уже существующий заказ
	 ЗапросЗаказы = Новый Запрос("ВЫБРАТЬ
	                             |	ЗаказПоставщику.Ссылка КАК Ссылка
	                             |ИЗ
	                             |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВыполненияЗаказовПоставщикам КАК СостоянияВыполненияЗаказовПоставщикам
	                             |		ПО (СостоянияВыполненияЗаказовПоставщикам.Заказ = ЗаказПоставщику.Ссылка)
	                             |ГДЕ
	                             |	НАЧАЛОПЕРИОДА(ЗаказПоставщику.Дата, ДЕНЬ) = &Дата
	                             |	И НЕ ЗаказПоставщику.Проведен
	                             |	И ЗаказПоставщику.ПодразделениеКомпании = &ПодразделениеКомпании
	                             |	И ЗаказПоставщику.ит_ВидЗаявки = &ит_ВидЗаявки
	                             |	И СостоянияВыполненияЗаказовПоставщикам.Состояние = &Состояние");
	 
	 ЗапросЗаказы.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
	 ЗапросЗаказы.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	 ЗапросЗаказы.УстановитьПараметр("ит_ВидЗаявки", ВидЗаказаСсылка);
	 ЗапросЗаказы.УстановитьПараметр("Состояние", Перечисления.СостоянияВыполненияЗаказовПоставщикам.Согласование);
	 
	 ЗапросЗаказыВыборка = ЗапросЗаказы.Выполнить().Выбрать();
	 НайденныйЗаказ = Неопределено;
	 Если ЗапросЗаказыВыборка.Следующий() Тогда
		 НайденныйЗаказ =  ЗапросЗаказыВыборка.Ссылка;
	 КонецЕсли;	 
	 // ищем уже существующий заказ
	 
	 
	 ИмяОбработки = "Обработка: Формирование заказов";
	 спрВнОбработки = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(ИмяОбработки);	
	 
	 спрВнОбработкиОбъект = спрВнОбработки.ПолучитьОбъект();
	 ВнешняяОбработка = ИТ_РегламентныеПроцедуры.ПолучитьВнешнююОбработку(спрВнОбработкиОбъект);
	 
	 ДанныеЗаполнения = Новый Структура();
	 
	 //Мальцев А.Ю. +++
	 //БЫЛО:ДанныеЗаполнения.Вставить("Контрагент", КонтрагентМПЗ);
	 //СТАЛО:
	 Если ВидЗаказаСсылка <> Перечисления.рздВидыЗаказовЕРП.ЗаказВнешнийПоставщик Тогда
		 ДанныеЗаполнения.Вставить("Контрагент", КонтрагентМПЗ);
	 Иначе
		 ДанныеЗаполнения.Вставить("Контрагент", Справочники.Контрагенты.ВнешнийПоставщик);	
	 КонецЕсли;
	 //Мальцев А.Ю. ---

	 ДанныеЗаполнения.Вставить("Подразделение", ПодразделениеКомпании);
	 
	 // если заказ уже есть,- работаем с ним, новых не создаем
	 ДанныеЗаполнения.Вставить("СоздатьДокумент", НайденныйЗаказ = Неопределено);
	 ДанныеЗаполнения.Вставить("ОбъектДокумента", ?(НайденныйЗаказ = Неопределено, НайденныйЗаказ,НайденныйЗаказ.ПолучитьОбъект()));
	 // если заказ уже есть,- работаем с ним, новых не создаем

	 ДанныеЗаполнения.Вставить("Организация", ПодразделениеКомпании.Организация);
	 ДанныеЗаполнения.Вставить("ВидЗаказа", ВидЗаказаСсылка);
	 ДанныеЗаполнения.Вставить("ВыбранныеТовары", тбРезультат);
	 ДанныеЗаполнения.Вставить("Проводить", Ложь);
	 ДанныеЗаполнения.Вставить("ДатаПоставки", КонецДня(ТекущаяДата()) + 1);
	 
	 
	 ТекОбъект = Новый Структура();
	 ТекОбъект.Вставить("Дата", ТекущаяДата());
     ТекОбъект.Вставить("ДатаПоставки", КонецДня(ТекущаяДата()) + 1);	 
	 
	 СегментНоменклатуры = Справочники.СегментыНоменклатуры.ПустаяСсылка();
	 
	 Если ВидЗаказаСсылка <> Перечисления.рздВидыЗаказовЕРП.ЗаказВнешнийПоставщик Тогда 
		 ЗапросСегмента = Новый Запрос("ВЫБРАТЬ
		                               |	МАКСИМУМ(ит_СоответствиеВидаЗаявкиВидуНоменклатуры.СегментНоменклатуры) КАК СегментНоменклатуры
		                               |ПОМЕСТИТЬ втСегменты
		                               |ИЗ
		                               |	РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры КАК ит_СоответствиеВидаЗаявкиВидуНоменклатуры
		                               |ГДЕ
		                               |	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа = &ВидЗаказа
		                               |	И НЕ ит_СоответствиеВидаЗаявкиВидуНоменклатуры.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
		                               |;
		                               |
		                               |////////////////////////////////////////////////////////////////////////////////
		                               |ВЫБРАТЬ
		                               |	втСегменты.СегментНоменклатуры КАК СегментНоменклатуры
		                               |ИЗ
		                               |	втСегменты КАК втСегменты
		                               |ГДЕ
		                               |	НЕ втСегменты.СегментНоменклатуры ЕСТЬ NULL");
		 
		 ЗапросСегмента.УстановитьПараметр("ВидЗаказа", ВидЗаказаСсылка);
		 ВыборкаЗапросСегмента = ЗапросСегмента.Выполнить().Выбрать();
		 Если ВыборкаЗапросСегмента.Следующий() Тогда
			 
			 СегментНоменклатуры = ВыборкаЗапросСегмента.СегментНоменклатуры;

		 КонецЕсли;
	КонецЕсли;	 
		 
	мТовары = Новый Массив;
	мПодразделения = Новый Массив;
	мПодразделения.Добавить(ПодразделениеКомпании);
	 
	ПараметрыГрафиков = Новый Структура("ПолучитьВесьГрафик,ГрафикиЦОИМагазинов,СтраховойЗапасВДнях,МассивПодразделений, МассивНоменклатуры", Ложь, Ложь, 1, мПодразделения, мТовары);
	 
	ОбрОбъект = Обработки.ФормированиеЗаказовПоставщику.Создать();
	ОбрОбъект.Дата = ТекущаяДата();
	ОбрОбъект.Поставщик = КонтрагентМПЗ;
	
	ОбрОбъект.СегментНоменклатуры = СегментНоменклатуры;
	ОбрОбъект.ВариантФормирования = 1;
	тзГрафик = ОбрОбъект.ПолучитьГрафики(ПараметрыГрафиков);
	Если тзГрафик.Количество() >0 Тогда
	 стртзГрафик = тзГрафик.Получить(0);
	 
	 ДопДень = 0;
	 ВремяЗаказа = стртзГрафик.ДатаЗаказа - НачалоДня(стртзГрафик.ДатаЗаказа);
	 ВремяПринятия = стртзГрафик.ВремяПринятияЗаказа - НачалоДня(стртзГрафик.ВремяПринятияЗаказа);
	 Если ВремяЗаказа > ВремяПринятия Тогда
		 ДопДень = 1;
	 КонецЕсли;
	 
	 СрокПоставкиПоГрафику = НачалоДня(стртзГрафик.ДатаЗаказа) + стртзГрафик.СрокПоставки*3600*24 + ДопДень;
	 Если СрокПоставкиПоГрафику > КонецДня(ТекущаяДата()) Тогда
		 ТекОбъект.Вставить("ДатаПоставки", СрокПоставкиПоГрафику);	 
	 КонецЕсли;	 
	КонецЕсли;	
	
	СкладКомпании = Справочники.СкладыКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч",ПодразделениеКомпании.ЕРПМастерКлючСклада).Ссылка;
	ТекОбъект.Вставить("СкладКомпании", СкладКомпании);
	ТекОбъект.Вставить("ТипЦен", СкладКомпании.ТипЦенСебестоимости);
	ТекОбъект.Вставить("Товары",тбРезультат);
	
	
	ДанныеЗаполнения.Вставить("Объект", ТекОбъект);
	
	ВнешняяОбработка.ВыполнитьКоманду("ФормированиеЗаказовПоставщику", ДанныеЗаполнения);
	
	ОтветСтруктура.Вставить("КодОтвета", 1);
	Возврат Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));

КонецФункции

#КонецОбласти

#Область Инвентаризация

Функция ПолучитьДанныеИнвентаризации(СсылкаПодразделениеКомпании)
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
//ВЫБРАТЬ
//	ФорматыАссортиментаПодразделенийСрезПоследних.ПодразделениеКомпании,
//	ФорматыАссортиментаПодразделенийСрезПоследних.Номенклатура КАК Группа,
//	ФорматыАссортиментаПодразделенийСрезПоследних.Формат
//ПОМЕСТИТЬ
//	ФорматыАссортимента
//ИЗ
//	РегистрСведений.ФорматыАссортиментаПодразделений.СрезПоследних(, ) КАК ФорматыАссортиментаПодразделенийСрезПоследних
//;

//ВЫБРАТЬ
//	ФорматыАссортимента.ПодразделениеКомпании КАК ПодразделениеКомпании,
//	ФорматыАссортимента.Группа КАК ГруппаНоменклатуры,
//	ФорматыАссортимента.Формат КАК Формат
//ИЗ
//	ФорматыАссортимента КАК ФорматыАссортимента
//	
//ОБЪЕДИНИТЬ ВСЕ

//ВЫБРАТЬ
//	ФорматыАссортимента.ПодразделениеКомпании,
//	СтруктураИерархииНоменклатуры.Номенклатура,
//	ФорматыАссортимента.Формат
//ИЗ
//	ФорматыАссортимента КАК ФорматыАссортимента
//ВНУТРЕННЕЕ СОЕДИНЕНИЕ
//	РегистрСведений.СтруктураИерархииНоменклатуры КАК СтруктураИерархииНоменклатуры
//ПО
//	ФорматыАссортимента.Группа = СтруктураИерархииНоменклатуры.Группа


	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	СУММА(ВложенныйЗапрос.Запас) КАК Запас
	               |ПОМЕСТИТЬ ТаблицаТовары
	               |ИЗ
	               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура КАК Номенклатура,
	               |		0 КАК Запас
	               |	ИЗ
	               |		РегистрСведений.ОграничениеАссортиментаПодразделения.СрезПоследних(, ПодразделениеКомпании = &ПодразделениеКомпании) КАК ОграничениеАссортиментаПодразделенияСрезПоследних
	               |	ГДЕ
	               |		ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ОстаткиТоваровКомпании.Номенклатура,
	               |		ОстаткиТоваровКомпании.КоличествоОстаток
	               |	ИЗ
	               |		РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, СкладКомпании.ПодразделениеКомпании = &ПодразделениеКомпании) КАК ОстаткиТоваровКомпании) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ШтрихКоды.ЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
	               |	ШтрихКоды.Штрихкод КАК Штрихкод
	               |ИЗ
	               |	ТаблицаТовары КАК ТаблицаТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихКоды
	               |		ПО ТаблицаТовары.Номенклатура = ШтрихКоды.Объект
	               |			И (ШтрихКоды.Запрет = ЛОЖЬ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Номенклатура КАК Номенклатура,
	               |	ТаблицаТовары.Номенклатура.Код КАК НоменклатураКод,
	               |	ТаблицаТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	               |	ТаблицаТовары.Номенклатура.Артикул КАК НоменклатураАртикул,
	               |	ТаблицаТовары.Номенклатура.ИерархияАльтернативная КАК Родитель,
	               |	ТаблицаТовары.Номенклатура.ИерархияАльтернативная.Код КАК РодительКод,
	               |	ТаблицаТовары.Номенклатура.ИерархияАльтернативная.Наименование КАК РодительНаименование,
	               |	ТаблицаТовары.Запас КАК Запас,
	               |	ТаблицаТовары.Номенклатура.КратностьПоставок КАК КратностьПоставок,
	               |	ТаблицаТовары.Номенклатура.ТипНоменклатуры.Весовой КАК Весовой
	               |ИЗ
	               |	ТаблицаТовары КАК ТаблицаТовары";
	
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	РезультатЗапроса = ПакетыЗапросов[ПакетыЗапросов.Количество()-1];
	Если РезультатЗапроса.Пустой() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ВыборкаШтрихкоды = ПакетыЗапросов[ПакетыЗапросов.Количество()-2].Выбрать();
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	//ЗаписатьОбъектXML(ЗаписьXML, Данные);
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Товары"); // ТоварнаяСтрока
		ЗаписьXML.ЗаписатьАтрибут("Запас", Формат(Выборка.Запас, "ЧРД=.; ЧН=0; ЧГ="));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
		ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Номенклатура));
		ЗаписьXML.ЗаписатьАтрибут("Код", Выборка.НоменклатураКод);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.НоменклатураНаименование);
		ЗаписьXML.ЗаписатьАтрибут("Артикул", Выборка.НоменклатураАртикул);
			ЗаписьXML.ЗаписатьАтрибут("КратностьПоставок", Формат(Выборка.КратностьПоставок, "ЧРД=.; ЧН=0; ЧГ="));
			ЗаписьXML.ЗаписатьАтрибут("Весовой", ?(Выборка.Весовой,"Истина","Ложь"));
		ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Ложь");
		Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель"); // Родитель
			ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Родитель));
			ЗаписьXML.ЗаписатьАтрибут("Код", Выборка.РодительКод);
			ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.РодительНаименование);
			ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Истина");
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
		Иначе
			ЗаписьXML.ЗаписатьАтрибут("Родитель", "");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
	КонецЦикла;
	
	Пока ВыборкаШтрихкоды.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ШтрихКоды"); // ТоварнаяСтрока
		
		ЗаписьXML.ЗаписатьАтрибут("Штрихкод", ВыборкаШтрихкоды.Штрихкод);
		ЗаписьXML.ЗаписатьАтрибут("Коэффициент", Формат(ВыборкаШтрихкоды.Коэффициент, "ЧРД=.; ЧН=0; ЧГ="));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
		ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаШтрихкоды.Номенклатура));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Заказы
	
	ЗаписьXML.Закрыть();
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьИнвентаризацию(СсылкаПодразделениеКомпании, ШтрихКод, ПараметрыОбмена, Локальная, ИнвентаризацияТоваров, ДатаИнвентаризации, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	ТекстОшибки = "";
	
	//Локальная = (ВРег(Локальная) = "ИСТИНА");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).ПодразделениеКомпании КАК ПодразделениеКомпании
	//|	ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).СкладКомпании КАК СкладКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	//СкладКомпании = Справочники.СкладыКомпании.ПустаяСсылка();
	Пользователь = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		//СкладКомпании = Выборка.СкладКомпании;
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
			ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКод+"> не найден пользователь";
		Возврат Ложь;
	КонецЕсли;
	
	СкладКомпании = Справочники.СкладыКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч",ПодразделениеКомпании.ЕРПМастерКлючСклада).Ссылка;
	
	ДанныеОбмена = ПараметрыОбмена.Получить().ДанныеОбмена;
	//
	//ДокументОбъект = Документы.Инвентаризация.СоздатьДокумент();
	//ДокументОбъект.Заполнить(Неопределено);
	//
	//ДокументОбъект.УстановитьНовыйНомер();
	//
	//Если Локальная Тогда
	//	ДокументОбъект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваров;
	//Иначе
	//	ДокументОбъект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваровПредварительная;
	//КонецЕсли;
	//
	//Документы.Инвентаризация.ХозОперацияПриИзменении(ДокументОбъект);
	//
	//ДокументОбъект.Организация = ПодразделениеКомпании.Организация;
	//ДокументОбъект.ПодразделениеКомпании = ПодразделениеКомпании;
	//
	//Документы.Инвентаризация.ПодразделениеКомпанииПриИзменении(ДокументОбъект);
	//
	//Если ЗначениеЗаполнено(СкладКомпании) Тогда
	//	ДокументОбъект.СкладКомпании = СкладКомпании;
	//	Документы.Инвентаризация.СкладКомпанииПриИзменении(ДокументОбъект);
	//КонецЕсли;
	
	ДокументОбъект = СоздатьИнвентаризацию(Локальная, ПодразделениеКомпании, СкладКомпании, Пользователь, ИнвентаризацияТоваров, ДатаИнвентаризации);
	ДокументОбъект.итЛокальнаяИнвентаризация = Локальная;
	ДокументОбъект.СпособПолученияЦены = Перечисления.СпособыПолученияЗакупочнойЦены.ПоТипуЦен;
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("НеЗаполнятьКоличествоФакт", Истина);
	
	ДокументОбъект.Товары.Очистить();
	//Если Локальная Тогда
	//	ПараметрыЗаполнения = Новый Структура;
	//	ПараметрыЗаполнения.Вставить("СкладКомпании", СкладКомпании);
	//	
	//	Документы.Инвентаризация.ТоварыЗаполнитьСкладскимиОстатками(ДокументОбъект, ПараметрыЗаполнения, ПараметрыДействия);
	//КонецЕсли;
	
	ПараметрыДействия.Вставить("НеЗаполнятьКоличествоФакт", Истина);
	
	ТаблицаДанных = ПолучитьДанныеОбмена(ДанныеОбмена);
	
	Если ТаблицаДанных.Свойства().Получить("Товары") = Неопределено Тогда
		//Если Локальная Тогда
		//ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		//Иначе
		//	
		//	Попытка
		//		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//	Исключение
		//		ТекстОшибки = ТекстОшибки + "
		//		|Документ <"+Строка(ДокументОбъект.Ссылка)+"> не проведен!
		//		|"+ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//		
		//		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		//		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		//	КонецПопытки;

		//КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
	СписокТоваров = ПолучитьСписокИзXDTO(ТаблицаДанных.Товары);
	Если СписокТоваров.Количество()=0 Тогда
		//Если Локальная Тогда
		//	ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		//	
		//	Попытка
		//		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//	Исключение
		//		ТекстОшибки = ТекстОшибки + "
		//		|Документ <"+Строка(ДокументОбъект.Ссылка)+"> не проведен!
		//		|"+ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//		
		//		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		//		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		//	КонецПопытки;
		//Иначе
		//	Попытка
		//		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//	Исключение
		//		ТекстОшибки = ТекстОшибки + "
		//		|Документ <"+Строка(ДокументОбъект.Ссылка)+"> не проведен!
		//		|"+ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//		
		//		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		//		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		//	КонецПопытки;
		//КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
	СлужебныйТовар = Константы.СлужебныйТовар.Получить();
	
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		
		Если ПустаяСтрока(ТекущаяСтрока.Номенклатура.Ссылка) Тогда
			СписокШтрихкодов = ПолучитьСписокИзXDTO(ТекущаяСтрока.Штрихкоды);
			Штрихкоды = Новый Массив;
			Для Каждого СтрокаШтрихКод Из СписокШтрихкодов Цикл
				Если ПустаяСтрока(СтрокаШтрихКод.Штрихкод) Тогда
					Продолжить;
				КонецЕсли;
				Штрихкоды.Добавить(СтрокаШтрихКод.Штрихкод);
			КонецЦикла;
			
			ТаблицаШтрихКодов = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(Штрихкоды);
			ТаблицаШтрихКодов.Индексы.Добавить("Штрихкод");
			
			Для Каждого СтрокаШтрихКод Из СписокШтрихкодов Цикл
				Если ПустаяСтрока(СтрокаШтрихКод.Штрихкод) Тогда
					Продолжить;
				КонецЕсли;
				
				ТаблицаШтрихКодов.Найти(СтрокаШтрихКод.Штрихкод, "Штрихкод");
				
				НайденныйШтрихКод = ТаблицаШтрихКодов.Найти(СтрокаШтрихКод.Штрихкод, "Штрихкод");
				Если НайденныйШтрихКод = Неопределено Тогда
					
					ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
					ТоварнаяСтрока.Номенклатура = СлужебныйТовар;
					ТоварнаяСтрока.ИдентификаторСтроки = СтрокаШтрихКод.Штрихкод;
					Документы.Инвентаризация.ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока, ПараметрыДействия);
					ТоварнаяСтрока.КоличествоФакт = Число(СтрокаШтрихКод.Количество);
					Документы.Инвентаризация.ТоварыКоличествоФактПриИзменении(ДокументОбъект, ТоварнаяСтрока, ПараметрыДействия);
				Иначе
					
					ТоварнаяСтрока = ДокументОбъект.Товары.Найти(НайденныйШтрихКод.Объект, "Номенклатура");
					Если ТоварнаяСтрока = Неопределено Тогда
						ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
						ТоварнаяСтрока.Номенклатура               = НайденныйШтрихКод.Объект;
						ТоварнаяСтрока.ЕдиницаИзмерения           = НайденныйШтрихКод.ЕдиницаИзмерения;
						ТоварнаяСтрока.ХарактеристикаНоменклатуры = НайденныйШтрихКод.ХарактеристикаНоменклатуры;
						Документы.Инвентаризация.ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока, ПараметрыДействия);
					КонецЕсли;
					
					ТоварнаяСтрока.КоличествоФакт = Число(СтрокаШтрихКод.Количество);
					Документы.Инвентаризация.ТоварыКоличествоФактПриИзменении(ДокументОбъект, ТоварнаяСтрока, ПараметрыДействия);
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Номенклатура.Ссылка);
			Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
			
			ТоварнаяСтрока = ДокументОбъект.Товары.Найти(Номенклатура, "Номенклатура");
			Если ТоварнаяСтрока = Неопределено Тогда
				ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
				ТоварнаяСтрока.Номенклатура = Номенклатура;
				Документы.Инвентаризация.ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока, ПараметрыДействия);
			КонецЕсли;
			
			ТоварнаяСтрока.КоличествоФакт = Число(ТекущаяСтрока.Количество);
			Документы.Инвентаризация.ТоварыКоличествоФактПриИзменении(ДокументОбъект, ТоварнаяСтрока, ПараметрыДействия);
			
		КонецЕсли;
		
	КонецЦикла;
	
	//Если Локальная Тогда
	//	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	    ДокументОбъект.ДатаЗаписиНаТСД = ТекущаяДата();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);

	//Иначе
	//	
	//	Попытка
	//		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//	Исключение
	//		ТекстОшибки = ТекстОшибки + "
	//		|Документ <"+Строка(ДокументОбъект.Ссылка)+"> не проведен!
	//		|"+ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	//		
	//		ДокументОбъект.ОбменДанными.Загрузка = Истина;
	//		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	//	КонецПопытки;
	//	
	//КонецЕсли;
	
	Попытка
		СписокТоваровДетализация = ПолучитьСписокИзXDTO(ТаблицаДанных.ТоварыДетализация);
		Для Каждого ТекущаяСтрока Из СписокТоваровДетализация Цикл
			
			ЗаписьСтрокиИнв = РегистрыСведений.итСтрокиИнвентаризации.СоздатьМенеджерЗаписи();
			ЗаписьСтрокиИнв.ИнвентаризацияТоваров = ДокументОбъект.Ссылка;
			
			Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Номенклатура.Ссылка);
			Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
			ЗаписьСтрокиИнв.Номенклатура   		  = Номенклатура;
			ЗаписьСтрокиИнв.ЕдиницаИзмерения   	  = ЗаписьСтрокиИнв.Номенклатура.ОсновнаяЕдиницаИзмерения;
			ЗаписьСтрокиИнв.КлючСтроки            = Новый УникальныйИдентификатор(ТекущаяСтрока.ИдентификатоСтроки);
			ЗаписьСтрокиИнв.Количество   		  = ТекущаяСтрока.Количество;
			ЗаписьСтрокиИнв.ДатаВремяОперации   	   = ТекущаяСтрока.ДатаОперации;
			ЗаписьСтрокиИнв.ДатаВремяОтменыОперации    = ТекущаяСтрока.ДатаОтменыОперации;
			ЗаписьСтрокиИнв.ТСД                        = ПараметрыСеанса.ТекущийПользователь;
			ЗаписьСтрокиИнв.Оператор                   = Пользователь;
			ЗаписьСтрокиИнв.ШК                         = ТекущаяСтрока.ШтрихКод;
			ЗаписьСтрокиИнв.Записать(Истина);
			
		КонецЦикла;
	Исключение
	КонецПопытки;	
	
	ИнвентаризацияТоваров = СериализоватьСсылку(ДокументОбъект.Ссылка);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

Функция СоздатьИнвентаризацию(Локальная, ПодразделениеКомпании, СкладКомпании, Автор, ИнвентаризацияТоваров, Знач ДатаИнвентаризации)
	
	Если ЗначениеЗаполнено(ДатаИнвентаризации) Тогда
		Если Локальная Тогда
			Если ДатаИнвентаризации = НачалоДня(ТекущаяДатаСеанса()) Тогда
				ДатаИнвентаризации = ТекущаяДатаСеанса();
			Иначе
				ДатаИнвентаризации = КонецДня(ДатаИнвентаризации);
			КонецЕсли;
		Иначе
			ДатаИнвентаризации = КонецДня(ДатаИнвентаризации);
		КонецЕсли;
	Иначе
		Если Локальная Тогда
			ДатаИнвентаризации = ТекущаяДатаСеанса();
		Иначе
			ДатаИнвентаризации = КонецДня(ТекущаяДатаСеанса());
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнвентаризацияТоваров) Тогда
		Идентификатор = Новый УникальныйИдентификатор(ИнвентаризацияТоваров);
		ИнвентаризацияСсылка = Документы.Инвентаризация.ПолучитьСсылку(Идентификатор);
	Иначе
		ИнвентаризацияСсылка = Неопределено;
	КонецЕсли;
	
	//Если Локальная Тогда
	ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваровПредварительная;
	//Иначе	
	//	ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваров;
	//КонецЕсли;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	Инвентаризация.Ссылка КАК Ссылка
	//|ИЗ
	//|	Документ.Инвентаризация КАК Инвентаризация
	//|ГДЕ
	//|	Инвентаризация.Автор = &Автор
	//|	И Инвентаризация.ХозОперация = &ХозОперация
	//|	И Инвентаризация.СкладКомпании = &СкладКомпании
	//|	И Инвентаризация.ПодразделениеКомпании = &ПодразделениеКомпании
	//|	И НАЧАЛОПЕРИОДА(Инвентаризация.Дата, ДЕНЬ) = &ТекущийДень
	//|";
	//
	//Запрос.УстановитьПараметр("Автор",                 Автор);
	//Запрос.УстановитьПараметр("СкладКомпании",         СкладКомпании);
	//Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	//Запрос.УстановитьПараметр("ТекущийДень",           НачалоДня(ТекущаяДатаСеанса()));
	//Запрос.УстановитьПараметр("ХозОперация",           ХозОперация);
	
	//Выборка = Запрос.Выполнить().Выбрать();
	ДокументОбъект = Неопределено;
	Если ЗначениеЗаполнено(ИнвентаризацияСсылка) Тогда
		ДокументОбъект = ИнвентаризацияСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если ДокументОбъект = Неопределено Тогда
		
		ДокументОбъект = Документы.Инвентаризация.СоздатьДокумент();
		Если Не ЗначениеЗаполнено(ИнвентаризацияСсылка) Тогда
			ИнвентаризацияСсылка = Документы.Инвентаризация.ПолучитьСсылку();
		КонецЕсли;
		ДокументОбъект.УстановитьСсылкуНового(ИнвентаризацияСсылка);
		ДокументОбъект.Заполнить(Неопределено);
		
		ДокументОбъект.Дата = ДатаИнвентаризации;
		Документы.Инвентаризация.ДатаПриИзменении(ДокументОбъект);
		
		ДокументОбъект.УстановитьНовыйНомер();
		
		ДокументОбъект.ХозОперация = ХозОперация;
		
		Документы.Инвентаризация.ХозОперацияПриИзменении(ДокументОбъект);
		
		ДокументОбъект.Организация           = ПодразделениеКомпании.Организация;
		ДокументОбъект.ПодразделениеКомпании = ПодразделениеКомпании;
		
		Документы.Инвентаризация.ПодразделениеКомпанииПриИзменении(ДокументОбъект);
		
		Если ЗначениеЗаполнено(СкладКомпании) Тогда
			ДокументОбъект.СкладКомпании = СкладКомпании;
			Документы.Инвентаризация.СкладКомпанииПриИзменении(ДокументОбъект);
		КонецЕсли;
		
		ДокументОбъект.Автор = Автор;
		Документы.Инвентаризация.АвторПриИзменении(ДокументОбъект);
		
	КонецЕсли;
	
	Возврат ДокументОбъект;
	
КонецФункции

#КонецОбласти

Функция СервисНайтиОбъектыПоШтрихкоду(ШтрихкодПараметр, ЕстьПрефикс = Истина, ПроверкаЗапрета = Ложь, Вес = 0)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// формирование массива штрихкодов на основе переданных параметров
	МассивШтрихкоды = Новый Массив;
	Если ТипЗнч(ШтрихкодПараметр) = Тип("Массив") Тогда
		МассивШтрихкоды = ШтрихкодПараметр;
	Иначе
		МассивШтрихкоды.Добавить(ШтрихкодПараметр);
	КонецЕсли;
	
	Вес = 0;
	
	// поиск объектов по штрихкоду
	Если ЕстьПрефикс Тогда
		
		ПрефиксВесовогоШК = Константы.ПрефиксВесовогоШК.Получить();
		
		ТаблицаШтрихкоды = Новый ТаблицаЗначений;
		ТаблицаШтрихкоды.Колонки.Добавить("Штрихкод",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(200)));
		ТаблицаШтрихкоды.Колонки.Добавить("Префикс",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(200)));
		
		// для весовых товаров уникальность проверяется по первым 7 символам
		Для Каждого Штрихкод Из МассивШтрихкоды Цикл
			НоваяСтрока = ТаблицаШтрихкоды.Добавить();
			НоваяСтрока.Штрихкод = Штрихкод;                                       
			Если Лев(Штрихкод,2) = Строка(ПрефиксВесовогоШК) Тогда
				НоваяСтрока.Префикс = Формат(Лев(Штрихкод,7),"ЧГ=0");
				
				// Вытащим вес
				Вес = Сред(Штрихкод, 8, СтрДлина(Штрихкод)-8);
				Если ЗначениеЗаполнено(Вес) Тогда
					Вес = Число(Вес)/1000;
				Иначе
					Вес = 0;
				КонецЕсли;
				
			Иначе
				НоваяСтрока.Префикс = Штрихкод;
			КонецЕсли; 
		КонецЦикла;
		
		Запрос = Новый Запрос();
	    Запрос.УстановитьПараметр("ТаблицаШтрихкоды", ТаблицаШтрихкоды);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаШтрихкоды.Штрихкод КАК Штрихкод,
		               |	ТаблицаШтрихкоды.Префикс КАК Префикс
		               |ПОМЕСТИТЬ ТаблицаШтрихкодыВТ
		               |ИЗ
		               |	&ТаблицаШтрихкоды КАК ТаблицаШтрихкоды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ТаблицаШтрихкодыВТ.Штрихкод КАК Штрихкод,
		               |	ТаблицаШтрихкодыВТ.Префикс КАК Префикс,
		               |	ШтрихКоды.Штрихкод КАК ШтрихкодОбъекта,
		               |	ШтрихКоды.Объект КАК Объект,
		               |	ШтрихКоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |	ШтрихКоды.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |	ШтрихКоды.Запрет КАК Запрет
		               |ИЗ
		               |	ТаблицаШтрихкодыВТ КАК ТаблицаШтрихкодыВТ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихКоды
		               |		ПО (ШтрихКоды.Штрихкод ПОДОБНО ТаблицаШтрихкодыВТ.Префикс + ""%""
		               |				И ШтрихКоды.Объект ССЫЛКА Справочник.Номенклатура)
		               |ГДЕ
		               |	ШтрихКоды.Объект ЕСТЬ НЕ NULL ";
		НайденныеОбъекты = Запрос.Выполнить().Выгрузить();
		
		Если НайденныеОбъекты.Количество() = 0 Тогда
			Запрос = Новый Запрос();
			Запрос.Текст = "ВЫБРАТЬ
			               |	ТаблицаШтрихкоды.Штрихкод КАК Штрихкод,
			               |	ТаблицаШтрихкоды.Префикс КАК Префикс
			               |ПОМЕСТИТЬ ТаблицаШтрихкодыВТ
			               |ИЗ
			               |	&ТаблицаШтрихкоды КАК ТаблицаШтрихкоды
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ТаблицаШтрихкодыВТ.Штрихкод КАК Штрихкод,
			               |	ТаблицаШтрихкодыВТ.Префикс КАК Префикс,
			               |	ШтрихКоды.Штрихкод КАК ШтрихкодОбъекта,
			               |	ШтрихКоды.Объект КАК Объект,
			               |	ШтрихКоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			               |	ШтрихКоды.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			               |	ШтрихКоды.Запрет КАК Запрет
			               |ИЗ
			               |	ТаблицаШтрихкодыВТ КАК ТаблицаШтрихкодыВТ
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихКоды
			               |		ПО (ШтрихКоды.Штрихкод ПОДОБНО ТаблицаШтрихкодыВТ.Префикс + ""%"")
			               |			И (ШтрихКоды.Объект ССЫЛКА Справочник.Номенклатура)
			               |ГДЕ
			               |	ШтрихКоды.Объект ЕСТЬ НЕ NULL 
			               |	И ШтрихКоды.Объект.ТипНоменклатуры.Весовой = ИСТИНА";
			ТаблицаШтрихкоды.Очистить();
			Для Каждого Штрихкод Из МассивШтрихкоды Цикл
				НоваяСтрока = ТаблицаШтрихкоды.Добавить();
				НоваяСтрока.Штрихкод = Штрихкод;                                       
				НоваяСтрока.Префикс = ЛЕВ(Штрихкод,7);
			КонецЦикла;
			
			Запрос.УстановитьПараметр("ТаблицаШтрихкоды", ТаблицаШтрихкоды);
			НайденныеОбъекты = Запрос.Выполнить().Выгрузить();
		КонецЕсли;	
		
	Иначе
		
		Запрос = Новый Запрос();
	    Запрос.УстановитьПараметр("МассивШтрихкоды", МассивШтрихкоды);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ШтрихКоды.Штрихкод КАК Префикс,
		               |	ШтрихКоды.Объект КАК Объект,
		               |	ШтрихКоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |	ШтрихКоды.Штрихкод КАК Штрихкод,
		               |	ШтрихКоды.Запрет КАК Запрет
		               |ИЗ
		               |	РегистрСведений.Штрихкоды КАК ШтрихКоды
		               |ГДЕ
		               |	ШтрихКоды.Штрихкод В(&МассивШтрихкоды)
		               |	И ШтрихКоды.Объект ССЫЛКА Справочник.Номенклатура";
		НайденныеОбъекты = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат НайденныеОбъекты;
	
КонецФункции // НайтиОбъектыПоШтрихкоду()


Функция НайтиНоменклатуруПоШК(ШтрихКод, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстОшибки = "";
	
	Если ПустаяСтрока(ШтрихКод) Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС+"Штрих-код не заполнен";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
		
	ТаблицаШтрихКодов = СервисНайтиОбъектыПоШтрихкоду(ШтрихКод);
	
	Если ТаблицаШтрихКодов.Количество() = 0 Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС+"По штрих-коду <"+ШтрихКод+"> не найдена номенклатура";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	НайденныйШтрихКод = ТаблицаШтрихКодов[0];
	
	ПоляНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НайденныйШтрихКод.Объект, "Ссылка, Код, Наименование, Артикул, ИерархияАльтернативная");
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	//ЗаписатьОбъектXML(ЗаписьXML, Данные);
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
	ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
	ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ПоляНоменклатуры.Ссылка));
	ЗаписьXML.ЗаписатьАтрибут("Код", ПоляНоменклатуры.Код);
	ЗаписьXML.ЗаписатьАтрибут("Наименование", ПоляНоменклатуры.Наименование);
	ЗаписьXML.ЗаписатьАтрибут("Артикул", ПоляНоменклатуры.Артикул);
	ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Ложь");
	Если ЗначениеЗаполнено(ПоляНоменклатуры.ИерархияАльтернативная) Тогда
		ПоляРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПоляНоменклатуры.ИерархияАльтернативная, "Ссылка, Код, Наименование");
		ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель"); // Родитель
		ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ПоляРодителя.Ссылка));
		ЗаписьXML.ЗаписатьАтрибут("Код", ПоляРодителя.Код);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", ПоляРодителя.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Истина");
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("Родитель", "");
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
		
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
	
	ЗаписьXML.Закрыть();
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция НайтиНоменклатуруПоАртикулу(Артикул, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстОшибки = "";
	
	Если ПустаяСтрока(Артикул) Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС+"Штрих-код не заполнен";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Артикул = &Артикул
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Код = &Артикул
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Артикул", Артикул);
	
	Номенклатура = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Номенклатура = Выборка.Ссылка;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС+"По артикулу <"+Артикул+"> не найдена номенклатура";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ПоляНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "Ссылка, Код, Наименование, Артикул, ИерархияАльтернативная");
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	//ЗаписатьОбъектXML(ЗаписьXML, Данные);
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
	ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
	ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ПоляНоменклатуры.Ссылка));
	ЗаписьXML.ЗаписатьАтрибут("Код", ПоляНоменклатуры.Код);
	ЗаписьXML.ЗаписатьАтрибут("Наименование", ПоляНоменклатуры.Наименование);
	ЗаписьXML.ЗаписатьАтрибут("Артикул", ПоляНоменклатуры.Артикул);
	ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Ложь");
	Если ЗначениеЗаполнено(ПоляНоменклатуры.ИерархияАльтернативная) Тогда
		ПоляРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПоляНоменклатуры.ИерархияАльтернативная, "Ссылка, Код, Наименование");
		ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель"); // Родитель
		ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ПоляРодителя.Ссылка));
		ЗаписьXML.ЗаписатьАтрибут("Код", ПоляРодителя.Код);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", ПоляРодителя.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Истина");
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
	Иначе
		ЗаписьXML.ЗаписатьАтрибут("Родитель", "");
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ШтрихКоды.ЕдиницаИзмерения.Коэффициент, 1) КАК Коэффициент,
	|	ШтрихКоды.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Объект = &Номенклатура И 
	|	ШтрихКоды.Запрет = ЛОЖЬ
	|";
	
	ВыборкаШтрихкоды = Запрос.Выполнить().Выбрать();
	Пока ВыборкаШтрихкоды.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ШтрихКоды"); // ТоварнаяСтрока
		
		ЗаписьXML.ЗаписатьАтрибут("Штрихкод",    ВыборкаШтрихкоды.Штрихкод);
		ЗаписьXML.ЗаписатьАтрибут("Коэффициент", Формат(ВыборкаШтрихкоды.Коэффициент, "ЧРД=.; ЧН=0; ЧГ="));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
		ЗаписьXML.ЗаписатьАтрибут("Тип",    "Номенклатура");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Номенклатура));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
		
	КонецЦикла;

	ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
	
	ЗаписьXML.Закрыть();
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

#Область Перемещения

Функция ПолучитьПодразделения()
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияКомпании.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|	ПодразделенияКомпании.ПометкаУдаления = ЛОЖЬ
	|	И ПодразделенияКомпании.Ссылка В ИЕРАРХИИ(&РабочиеПодразделения)";
	
	МастерКлючГруппыРабПодразделения = "000003458";
	РабочиеПодразделение 			 = Справочники.ПодразделенияКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч", МастерКлючГруппыРабПодразделения);
	Запрос.УстановитьПараметр("РабочиеПодразделения",       РабочиеПодразделение);	
			
	РезультатЗапроса       = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Ссылка = РабочиеПодразделение Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Подразделения");
		
		ЗначенияСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаДетальныеЗаписи.Ссылка, "Ссылка, Наименование, Код, ПометкаУдаления, НаименованиеПолное, КПП, GLN, Префикс");
		
		ЗаписьXML.ЗаписатьАтрибут("Тип", "ПодразделенияКомпании");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ЗначенияСсылки.Ссылка));
		ЗаписьXML.ЗаписатьАтрибут("Код", ЗначенияСсылки.Код);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", ЗначенияСсылки.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("Префикс", ЗначенияСсылки.Префикс);
		ЗаписьXML.ЗаписатьАтрибут("КПП", ЗначенияСсылки.КПП);
		ЗаписьXML.ЗаписатьАтрибут("GLN", ЗначенияСсылки.GLN);
		ЗаписьXML.ЗаписатьАтрибут("НаименованиеПолное", ЗначенияСсылки.НаименованиеПолное);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();

	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();

	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;

КонецФункции

Функция ЗагрузитьПеремещение(СсылкаПодразделениеКомпании, СсылкаПодразделениеПолучатель, ШтрихКодПользователя, ПараметрыОбмена, Перемещение, ДатаПеремещения, ТекстОшибки, Отправка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторПК 		= Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании   = Справочники.ПодразделенияКомпании.ПолучитьСсылку(ИдентификаторПК);
	ИдентификаторПП         = Новый УникальныйИдентификатор(СсылкаПодразделениеПолучатель);
	ПодразделениеПолучатель = Справочники.ПодразделенияКомпании.ПолучитьСсылку(ИдентификаторПП);

	ТекстОшибки = "";
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКодПользователя);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	Пользователь = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКодПользователя+"> не найден пользователь";
			Возврат "";
		КонецЕсли;
		Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
			ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
			Возврат "";
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКодПользователя+"> не найден пользователь";
		Возврат "";
	КонецЕсли;
	
	СкладКомпании   = Справочники.СкладыКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч",ПодразделениеКомпании.ЕРПМастерКлючСклада).Ссылка;
	СкладПолучатель = Справочники.СкладыКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч",ПодразделениеПолучатель.ЕРПМастерКлючСклада).Ссылка;
	
	ДанныеОбмена = ПараметрыОбмена.Получить().ДанныеОбмена;
	
	стДанных = Новый Структура;
	стДанных.Вставить("ПодразделениеКомпании",  ПодразделениеКомпании);
	стДанных.Вставить("СкладКомпании",		    СкладКомпании);
	стДанных.Вставить("ПодразделениеПолучатель",ПодразделениеПолучатель);
	стДанных.Вставить("СкладПолучатель",        СкладПолучатель);
	стДанных.Вставить("ДатаПеремещения",        ДатаПеремещения);
	стДанных.Вставить("Автор",                  Пользователь);
	стДанных.Вставить("Перемещение",            Перемещение);
	
	ДокументОбъект = СоздатьПеремещение(стДанных);
	
	ТаблицаДанных = ПолучитьДанныеОбмена(ДанныеОбмена);
	
	Если ТаблицаДанных.Свойства().Получить("Товары") = Неопределено Тогда
		ТекстОшибки = "Нет данных для создания перемещения.";
		Возврат "";
	КонецЕсли;
	
	СписокТоваров = ПолучитьСписокИзXDTO(ТаблицаДанных.Товары);
	Если СписокТоваров.Количество()=0 Тогда
		ТекстОшибки = "Нет данных для создания перемещения.";
		Возврат "";
	КонецЕсли;
	
	СлужебныйТовар = Константы.СлужебныйТовар.Получить();
	
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		
		Если ПустаяСтрока(ТекущаяСтрока.Номенклатура.Ссылка) Тогда
			СписокШтрихкодов = ПолучитьСписокИзXDTO(ТекущаяСтрока.Штрихкоды);
			Штрихкоды = Новый Массив;
			Для Каждого СтрокаШтрихКод Из СписокШтрихкодов Цикл
				Если ПустаяСтрока(СтрокаШтрихКод.Штрихкод) Тогда
					Продолжить;
				КонецЕсли;
				Штрихкоды.Добавить(СтрокаШтрихКод.Штрихкод);
			КонецЦикла;
			
			ТаблицаШтрихКодов = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(Штрихкоды);
			ТаблицаШтрихКодов.Индексы.Добавить("Штрихкод");
			
			Для Каждого СтрокаШтрихКод Из СписокШтрихкодов Цикл
				Если ПустаяСтрока(СтрокаШтрихКод.Штрихкод) Тогда
					Продолжить;
				КонецЕсли;
				
				ТаблицаШтрихКодов.Найти(СтрокаШтрихКод.Штрихкод, "Штрихкод");
				
				НайденныйШтрихКод = ТаблицаШтрихКодов.Найти(СтрокаШтрихКод.Штрихкод, "Штрихкод");
				Если НайденныйШтрихКод = Неопределено Тогда
					
					ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
					ТоварнаяСтрока.Номенклатура = СлужебныйТовар;
					ТоварнаяСтрока.ИдентификаторСтроки = СтрокаШтрихКод.Штрихкод;
					Документы.ПеремещениеТоваров.ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока);
					ТоварнаяСтрока.Количество = Число(ТекущаяСтрока.Количество);
					Документы.ПеремещениеТоваров.ТоварыКоличествоПриИзменении(ДокументОбъект, ТоварнаяСтрока);
					
					ТоварнаяСтрока.КоличествоДок = Число(ТекущаяСтрока.Количество);
					Документы.ПеремещениеТоваров.ТоварыКоличествоДокПриИзменении(ДокументОбъект, ТоварнаяСтрока);
					
				Иначе
					
					ТоварнаяСтрока = ДокументОбъект.Товары.Найти(НайденныйШтрихКод.Объект, "Номенклатура");
					Если ТоварнаяСтрока = Неопределено Тогда
						ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
						ТоварнаяСтрока.Номенклатура               = НайденныйШтрихКод.Объект;
						ТоварнаяСтрока.ЕдиницаИзмерения           = НайденныйШтрихКод.ЕдиницаИзмерения;
						ТоварнаяСтрока.ХарактеристикаНоменклатуры = НайденныйШтрихКод.ХарактеристикаНоменклатуры;
						Документы.ПеремещениеТоваров.ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока);
					КонецЕсли;
					
					ТоварнаяСтрока.Количество = Число(СтрокаШтрихКод.Количество);
					Документы.ПеремещениеТоваров.ТоварыКоличествоПриИзменении(ДокументОбъект, ТоварнаяСтрока);
					ТоварнаяСтрока.КоличествоДок = Число(ТекущаяСтрока.Количество);
					Документы.ПеремещениеТоваров.ТоварыКоличествоДокПриИзменении(ДокументОбъект, ТоварнаяСтрока);
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Номенклатура.Ссылка);
			Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
			
			ТоварнаяСтрока = ДокументОбъект.Товары.Найти(Номенклатура, "Номенклатура");
			Если ТоварнаяСтрока = Неопределено Тогда
				ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
				ТоварнаяСтрока.Номенклатура = Номенклатура;
				Документы.ПеремещениеТоваров.ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока);
			КонецЕсли;
			
			ТоварнаяСтрока.Количество = Число(ТекущаяСтрока.Количество);
			Документы.ПеремещениеТоваров.ТоварыКоличествоПриИзменении(ДокументОбъект, ТоварнаяСтрока);
			
			ТоварнаяСтрока.КоличествоДок = Число(ТекущаяСтрока.Количество);
			Документы.ПеремещениеТоваров.ТоварыКоличествоДокПриИзменении(ДокументОбъект, ТоварнаяСтрока);

		КонецЕсли;
		ТоварнаяСтрока.Сумма 	  =  ТоварнаяСтрока.СуммаРозничная;
		ТоварнаяСтрока.СуммаВсего =  ТоварнаяСтрока.СуммаРозничная;
		ТоварнаяСтрока.СуммаДок   =  ТоварнаяСтрока.СуммаРозничная;
		
	КонецЦикла;
	
	ДокументОбъект.СуммаДокумента = ДокументОбъект.Товары.Итог("СуммаВсего");
	
	ПеремещениеТоваров = СериализоватьСсылку(ДокументОбъект.Ссылка);
	
	Если Отправка Тогда
		
		ДокументОбъект.итСостояние = Перечисления.итСостоянияВыполненияПеремещенийТоваров.КПриемке;
		Попытка 
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;	

		
		Состояния = РегистрыСведений.итСостоянияВыполненияПеремещенийТоваров.СоздатьМенеджерЗаписи();
		Состояния.Период 	  = ТекущаяДата();
		Состояния.Перемещение = ДокументОбъект.Ссылка;
		Состояния.Состояние   = Перечисления.итСостоянияВыполненияПеремещенийТоваров.КПриемке;
		Состояния.Сотрудник   = Пользователь;
		Состояния.Записать();
		
	Иначе
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СериализоватьСсылку(ДокументОбъект.Ссылка);

КонецФункции

Функция СоздатьПеремещение(ДанныеДокумента)
	
	ДатаПеремещения = ДанныеДокумента.ДатаПеремещения;
	Если Не ЗначениеЗаполнено(ДанныеДокумента.ДатаПеремещения) Тогда
		ДатаПеремещения = КонецДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДокумента.Перемещение) Тогда
		Идентификатор = Новый УникальныйИдентификатор(ДанныеДокумента.Перемещение);
		ПеремещениеСсылка = Документы.ПеремещениеТоваров.ПолучитьСсылку(Идентификатор);
	Иначе
		ПеремещениеСсылка = Неопределено;
	КонецЕсли;
	ХозОперация = Справочники.ХозОперации.ПеремещениеТоваров;

	
	ДокументОбъект = Неопределено;
	Если ЗначениеЗаполнено(ПеремещениеСсылка) Тогда
		ДокументОбъект = ПеремещениеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если ДокументОбъект = Неопределено Тогда
		
		ДокументОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
		ДокументОбъект.Заполнить(Неопределено);
		
		ДокументОбъект.Дата = ДатаПеремещения;
		Документы.ПеремещениеТоваров.ДатаПриИзменении(ДокументОбъект);
		
		ДокументОбъект.УстановитьНовыйНомер();
		
		ДокументОбъект.ХозОперация = ХозОперация;
		
		Документы.ПеремещениеТоваров.ХозОперацияПриИзменении(ДокументОбъект);
		
		ДокументОбъект.Организация           = ДанныеДокумента.ПодразделениеКомпании.Организация;
		ДокументОбъект.ПодразделениеКомпании = ДанныеДокумента.ПодразделениеКомпании;
		
		Документы.ПеремещениеТоваров.ПодразделениеКомпанииПриИзменении(ДокументОбъект);
		
		ДокументОбъект.СкладКомпании   = ДанныеДокумента.СкладКомпании;
		
		Документы.ПеремещениеТоваров.СкладКомпанииПриИзменении(ДокументОбъект);
		
		ДокументОбъект.СкладПолучатель = ДанныеДокумента.СкладПолучатель;
		
		Документы.ПеремещениеТоваров.СкладПолучательПриИзменении(ДокументОбъект);
		
		ДокументОбъект.Автор = ДанныеДокумента.Автор;
		Документы.ПеремещениеТоваров.АвторПриИзменении(ДокументОбъект);
		
	КонецЕсли;
	
	Возврат ДокументОбъект;
	
КонецФункции

Функция ПолучитьПеремещенияТоваровКПриемке(СсылкаПодразделениеПолучатель)
	
	ТекстОшибки = "";
	
	Попытка
		Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеПолучатель);
	Исключение
		ТекстОшибки = "Авторизация не выполнена";
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецПопытки;
	
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	Если ПодразделениеКомпании.Пустая() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	итСостоянияВыполненияПеремещенийТоваровСрезПоследних.Перемещение КАК Перемещение,
	                |	итСостоянияВыполненияПеремещенийТоваровСрезПоследних.Состояние КАК Состояние
	                |ПОМЕСТИТЬ втПоследниеСостояния
	                |ИЗ
	                |	РегистрСведений.итСостоянияВыполненияПеремещенийТоваров.СрезПоследних(, Перемещение.СкладПолучатель.ПодразделениеКомпании = &ПодразделениеКомпании) КАК итСостоянияВыполненияПеремещенийТоваровСрезПоследних
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	втПоследниеСостояния.Перемещение КАК Перемещение,
	                |	втПоследниеСостояния.Состояние КАК Состояние,
	                |	втПоследниеСостояния.Перемещение.Номер КАК ПеремещениеНомер,
	                |	втПоследниеСостояния.Перемещение.Дата КАК ПеремещениеДата,
	                |	втПоследниеСостояния.Перемещение.Представление КАК ПеремещениеПредставление,
	                |	втПоследниеСостояния.Перемещение.ПодразделениеКомпании КАК ПеремещениеПодразделениеКомпании
	                |ПОМЕСТИТЬ втПеремещенияКПриемке
	                |ИЗ
	                |	втПоследниеСостояния КАК втПоследниеСостояния
	                |ГДЕ
	                |	втПоследниеСостояния.Состояние = ЗНАЧЕНИЕ(Перечисление.итСостоянияВыполненияПеремещенийТоваров.КПриемке)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	                |	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество,
	                |	ПеремещениеТоваровТовары.Ссылка КАК Ссылка
	                |ПОМЕСТИТЬ втТовары
	                |ИЗ
	                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	                |ГДЕ
	                |	ПеремещениеТоваровТовары.Ссылка В
	                |			(ВЫБРАТЬ
	                |				втПеремещенияКПриемке.Перемещение КАК Перемещение
	                |			ИЗ
	                |				втПеремещенияКПриемке КАК втПеремещенияКПриемке)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ПеремещениеТоваровТовары.Ссылка,
	                |	ПеремещениеТоваровТовары.Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВЫБОР
	                |		КОГДА НЕ ШтрихКоды.Короб
	                |			ТОГДА ЕСТЬNULL(ШтрихКоды.ЕдиницаИзмерения.Коэффициент, 1)
	                |		ИНАЧЕ ВЫБОР
	                |				КОГДА ШтрихКоды.Объект.КратностьПоставок > 0
	                |					ТОГДА ШтрихКоды.Объект.КратностьПоставок
	                |				ИНАЧЕ ЕСТЬNULL(ШтрихКоды.ЕдиницаИзмерения.Коэффициент, 1)
	                |			КОНЕЦ
	                |	КОНЕЦ КАК Коэффициент,
	                |	ШтрихКоды.Штрихкод КАК Штрихкод,
	                |	втТовары.Номенклатура КАК Номенклатура
	                |ИЗ
	                |	втТовары КАК втТовары
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихКоды
	                |		ПО втТовары.Номенклатура = ШтрихКоды.Объект
	                |			И (ШтрихКоды.Запрет = ЛОЖЬ)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	втПеремещенияКПриемке.Перемещение КАК Перемещение,
	                |	втПеремещенияКПриемке.ПеремещениеДата КАК ПеремещениеДата,
	                |	втПеремещенияКПриемке.ПеремещениеНомер КАК ПеремещениеНомер,
	                |	втПеремещенияКПриемке.ПеремещениеПредставление КАК ПеремещениеПредставление,
	                |	втПеремещенияКПриемке.Состояние КАК Состояние,
	                |	втПеремещенияКПриемке.ПеремещениеПодразделениеКомпании КАК Отправитель
	                |ИЗ
	                |	втПеремещенияКПриемке КАК втПеремещенияКПриемке
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	втТовары.Количество КАК Количество,
	                |	втТовары.Номенклатура КАК Номенклатура,
	                |	втТовары.Ссылка КАК Ссылка,
	                |	втТовары.Номенклатура.Родитель КАК Родитель,
	                |	втТовары.Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	                |	втТовары.Номенклатура.Артикул КАК Артикул,
	                |	втТовары.Номенклатура.Наименование КАК Наименование,
	                |	втТовары.Номенклатура.Код КАК Код,
	                |	втТовары.Номенклатура.Родитель.Код КАК РодительКод,
	                |	втТовары.Номенклатура.Родитель.Наименование КАК РодительНаименование
	                |ИЗ
	                |	втТовары КАК втТовары";
	
	
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	
	ВыборкаШтрихкоды = ПакетыЗапросов[ПакетыЗапросов.Количество()-3].Выбрать();
	РезультатШапка   = ПакетыЗапросов[ПакетыЗапросов.Количество()-2];
	РезультатТовары  = ПакетыЗапросов[ПакетыЗапросов.Количество()-1];
	
	Если РезультатШапка.Пустой() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	//ЗаписатьОбъектXML(ЗаписьXML, Данные);
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
	ВыборкаП = РезультатШапка.Выбрать();
	Пока ВыборкаП.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Перемещения"); // Перемещения
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПеремещениеТоваров"); // Перемещения
		ЗаписьXML.ЗаписатьАтрибут("Тип",    "ПеремещениеТоваров");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаП.Перемещение));
		ЗаписьXML.ЗаписатьАтрибут("Номер",  ВыборкаП.ПеремещениеНомер);
		ЗаписьXML.ЗаписатьАтрибут("Дата",   Строка(ВыборкаП.ПеремещениеДата));
		ЗаписьXML.ЗаписатьАтрибут("Представление", "№ " + ВыборкаП.ПеремещениеНомер + " от " + Формат(ВыборкаП.ПеремещениеДата, "ДФ=dd.MM.yyyy"));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Перемещения
						
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Отправитель"); // Контрагент
		ЗаписьXML.ЗаписатьАтрибут("Тип", "ПодразделенияКомпании");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаП.Отправитель));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Контрагент
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Перемещения
		
	КонецЦикла;
	
	Выборка = РезультатТовары.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Товары"); // Товары
		
		ЗаписьXML.ЗаписатьАтрибут("ДолжноПоступить", Формат(Выборка.Количество, "ЧРД=.; ЧН=0; ЧГ="));
		ЗаписьXML.ЗаписатьАтрибут("Поступило", Формат(0, "ЧРД=.; ЧН=0; ЧГ="));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПеремещениеТоваров"); // Заказ
		ЗаписьXML.ЗаписатьАтрибут("Тип",    "ПеремещениеТоваров");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Ссылка));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ЗаказПоставщику
				
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
		ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Номенклатура));
		ЗаписьXML.ЗаписатьАтрибут("Код", Выборка.Код);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("Артикул", Выборка.Артикул);
		ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Ложь");
		Если ЗначениеЗаполнено(Выборка.Родитель) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Родитель"); // Родитель
			ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
			ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(Выборка.Родитель));
			ЗаписьXML.ЗаписатьАтрибут("Код", Выборка.РодительКод);
			ЗаписьXML.ЗаписатьАтрибут("Наименование", Выборка.РодительНаименование);
			ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Истина");
			ЗаписьXML.ЗаписатьКонецЭлемента(); // Родитель
		Иначе
			ЗаписьXML.ЗаписатьАтрибут("Родитель", "");
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
	КонецЦикла;
	
	Пока ВыборкаШтрихкоды.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ШтрихКоды"); // ТоварнаяСтрока
		
		ЗаписьXML.ЗаписатьАтрибут("Штрихкод", ВыборкаШтрихкоды.Штрихкод);
		ЗаписьXML.ЗаписатьАтрибут("Коэффициент", Формат(ВыборкаШтрихкоды.Коэффициент, "ЧРД=.; ЧН=0; ЧГ="));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Номенклатура"); // Номенклатура
		ЗаписьXML.ЗаписатьАтрибут("Тип", "Номенклатура");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаШтрихкоды.Номенклатура));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
	
	ЗаписьXML.Закрыть();
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;

КонецФункции

Функция ПеремещенияТоваровПриемка(ШтрихКодПользователя, ДанныеОтправки, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстОшибки = "";
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКодПользователя);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	Пользователь = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКодПользователя+"> не найден пользователь";
			Возврат "";
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКодПользователя+"> не найден пользователь";
		Возврат "";
	КонецЕсли;
	
	ДанныеОбмена = ДанныеОтправки.Получить().ДанныеОбмена;
	фДанныеОбмена = ПолучитьДанныеОбмена(ДанныеОбмена);
	
	Если ЗначениеЗаполнено(фДанныеОбмена.Перемещение.Ссылка) Тогда
		Идентификатор = Новый УникальныйИдентификатор(фДанныеОбмена.Перемещение.Ссылка);
		ПеремещениеСсылка = Документы.ПеремещениеТоваров.ПолучитьСсылку(Идентификатор);
	Иначе
		ТекстОшибки = "Не найдено перемещение в базе ЕСУР";
	КонецЕсли;
	
	ДокументОбъект = ПеремещениеСсылка.ПолучитьОбъект();
		
	Если фДанныеОбмена.Свойства().Получить("Товары") = Неопределено Тогда
		ТекстОшибки = "Нет данных для создания перемещения.";
		Возврат "";
	КонецЕсли;
	
	СписокТоваров = ПолучитьСписокИзXDTO(фДанныеОбмена.Товары);
	Если СписокТоваров.Количество()=0 Тогда
		ТекстОшибки = "Нет данных для создания перемещения.";
		Возврат "";
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
		
		Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Номенклатура.Ссылка);
		Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
		
		ТоварнаяСтрока = ДокументОбъект.Товары.Найти(Номенклатура, "Номенклатура");
		Если ТоварнаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТоварнаяСтрока.итКоличествоПринято 				  = Число(ТекущаяСтрока.Количество);
		
	КонецЦикла;
	
	ЕстьРасхождения = Ложь;
	Для Каждого стрТовар Из ДокументОбъект.Товары Цикл
		Если стрТовар.итКоличествоПринято <>  стрТовар.Количество Тогда
			ЕстьРасхождения = Истина;
		КонецЕсли;
		
	КонецЦикла;	
	
	Если Не ЕстьРасхождения Тогда
		
		ДокументОбъект.итСостояние = Перечисления.итСостоянияВыполненияПеремещенийТоваров.Принят;

		ОшибкаПроведения = Ложь;
		Попытка		
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ДокументОбъект.итСостояние = Перечисления.итСостоянияВыполненияПеремещенийТоваров.НаКонтроле;
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			тОшибка = ОписаниеОшибки();
			ОшибкаПроведения = Истина;
			
			
		КонецПопытки;	
		Состояния = РегистрыСведений.итСостоянияВыполненияПеремещенийТоваров.СоздатьМенеджерЗаписи();
		Состояния.Период 	  = ТекущаяДата();
		Состояния.Перемещение = ДокументОбъект.Ссылка;
		Если Не ОшибкаПроведения Тогда
			Состояния.Состояние   = Перечисления.итСостоянияВыполненияПеремещенийТоваров.Принят;
		Иначе
			Состояния.Состояние   = Перечисления.итСостоянияВыполненияПеремещенийТоваров.НаКонтроле;
		КонецЕсли;
		Состояния.Сотрудник   = Пользователь;
		Состояния.Записать();
	Иначе
		
		ДокументОбъект.итСостояние = Перечисления.итСостоянияВыполненияПеремещенийТоваров.НаКонтроле;		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);		
		
		Состояния = РегистрыСведений.итСостоянияВыполненияПеремещенийТоваров.СоздатьМенеджерЗаписи();
		Состояния.Период 	  = ТекущаяДата();
		Состояния.Перемещение = ДокументОбъект.Ссылка;
		Состояния.Состояние   = Перечисления.итСостоянияВыполненияПеремещенийТоваров.НаКонтроле;
		Состояния.Сотрудник   = Пользователь;
		Состояния.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СериализоватьСсылку(ДокументОбъект.Ссылка);

КонецФункции

Функция ФунуциональностьТСД(СсылкаПодразделениеКомпании, ТекстОшибки)
	ТекстОшибки = "";
	
	Попытка
		Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	Исключение
		//ТекстОшибки = "Авторизация не выполнена";
		//Результат = СформироватьДанныеПередачи(Неопределено);
		//Возврат Результат;
	КонецПопытки;
	
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);
	
	//Если ПодразделениеКомпании.Пустая() Тогда
	//	Результат = СформироватьДанныеПередачи(Неопределено);
	//	Возврат Результат;
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ПодразделениеКомпанииРодитель", ПодразделениеКомпании.Родитель);	
	Запрос.Текст =  "ВЫБРАТЬ
	                |	итФункциональностьТСД.ИнвентаризацияТоваров КАК ИнвентаризацияТоваров,
	                |	итФункциональностьТСД.ЛокальнаяИнвентаризация КАК ЛокальнаяИнвентаризация,
	                |	итФункциональностьТСД.ОтгрузкаПакетов КАК ОтгрузкаПакетов,
	                |	итФункциональностьТСД.ПеремещениеТоваров КАК ПеремещениеТоваров,
	                |	итФункциональностьТСД.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                |	итФункциональностьТСД.ПриемкаПакетов КАК ПриемкаПакетов,
	                |	итФункциональностьТСД.СогласованиеЗаказов КАК СогласованиеЗаказов,
	                |	итФункциональностьТСД.СогласованиеПоставок КАК СогласованиеПоставок,
	                |	итФункциональностьТСД.СостояниеЗаказов КАК СостояниеЗаказов,
	                |	итФункциональностьТСД.СписаниеТоваров КАК СписаниеТоваров,
	                |	ВЫБОР
	                |		КОГДА итФункциональностьТСД.ПодразделениеКомпании = &ПодразделениеКомпании
	                |			ТОГДА 1
	                |		ИНАЧЕ 2
	                |	КОНЕЦ КАК Приоритет,
	                |	итФункциональностьТСД.КонтрольАктуальныхЦен КАК КонтрольАктуальныхЦен,
	                |	итФункциональностьТСД.СопоставлениеНоменклатурыЕГАИС КАК СопоставлениеНоменклатурыЕГАИС,
	                |	итФункциональностьТСД.СписаниеКодовМаркировки КАК СписаниеКодовМаркировки,
					|	итФункциональностьТСД.ОприходованиеКодовМаркировки КАК ОприходованиеКодовМаркировки
	                |ИЗ
	                |	РегистрСведений.итФункциональностьТСД КАК итФункциональностьТСД
	                |ГДЕ
	                |	(итФункциональностьТСД.ПодразделениеКомпании = &ПодразделениеКомпании
	                |			ИЛИ итФункциональностьТСД.ПодразделениеКомпании = &ПодразделениеКомпанииРодитель)
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Приоритет";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Если РезультатЗапроса.Пустой() Тогда
	//	Результат = СформироватьДанныеПередачи(Неопределено);
	//	Возврат Результат;
	//КонецЕсли;
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	//ЗаписатьОбъектXML(ЗаписьXML, Данные);
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
	ВыборкаП = РезультатЗапроса.Выбрать();
	Если  ВыборкаП.Следующий() Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Функциональность"); // Перемещения		
		ЗаписьXML.ЗаписатьАтрибут("ИнвентаризацияТоваров",      Строка(ВыборкаП.ИнвентаризацияТоваров));
		ЗаписьXML.ЗаписатьАтрибут("ЛокальнаяИнвентаризация",    Строка(ВыборкаП.ЛокальнаяИнвентаризация));
		ЗаписьXML.ЗаписатьАтрибут("ОтгрузкаПакетов",    		Строка(ВыборкаП.ОтгрузкаПакетов));
		ЗаписьXML.ЗаписатьАтрибут("ПеремещениеТоваров",    		Строка(ВыборкаП.ПеремещениеТоваров));
		ЗаписьXML.ЗаписатьАтрибут("ПриемкаПакетов",    			Строка(ВыборкаП.ПриемкаПакетов));
		ЗаписьXML.ЗаписатьАтрибут("СогласованиеЗаказов",    	Строка(ВыборкаП.СогласованиеЗаказов));
		ЗаписьXML.ЗаписатьАтрибут("СогласованиеПоставок",    	Строка(ВыборкаП.СогласованиеПоставок));
		ЗаписьXML.ЗаписатьАтрибут("СостояниеЗаказов",    		Строка(ВыборкаП.СостояниеЗаказов));
		ЗаписьXML.ЗаписатьАтрибут("СписаниеТоваров",    		Строка(ВыборкаП.СписаниеТоваров));
		ЗаписьXML.ЗаписатьАтрибут("КонтрольАктуальныхЦен",    	Строка(ВыборкаП.КонтрольАктуальныхЦен));
		ЗаписьXML.ЗаписатьАтрибут("СопоставлениеЕГАИС",    		Строка(ВыборкаП.СопоставлениеНоменклатурыЕГАИС));
		ЗаписьXML.ЗаписатьАтрибут("СписаниеКодовМаркировки",    Строка(ВыборкаП.СписаниеКодовМаркировки));
		ЗаписьXML.ЗаписатьАтрибут("ОприходованиеКодовМаркировки",    Строка(ВыборкаП.ОприходованиеКодовМаркировки));
		

		ЗаписьXML.ЗаписатьКонецЭлемента(); // Перемещения
		
	КонецЕсли;
	
	
	//ПараметрыПодключаемогоОборудования
	
	ЗапросПараметры = Новый Запрос;
	ЗапросПараметры.Текст = 
	"ВЫБРАТЬ
	|	итПараметрыПодключаемогоОборудованияПараметры.Ссылка КАК ПараметрыПодключаемогоОборудования,
	|	итПараметрыПодключаемогоОборудованияПараметры.Ссылка.Наименование КАК Наименование,
	|	итПараметрыПодключаемогоОборудованияПараметры.Ссылка.Код КАК Код,
	|	итПараметрыПодключаемогоОборудованияПараметры.Имя КАК Имя,
	|	итПараметрыПодключаемогоОборудованияПараметры.Значение КАК Значение
	|ИЗ
	|	Справочник.итПараметрыПодключаемогоОборудования.Параметры КАК итПараметрыПодключаемогоОборудованияПараметры
	|ГДЕ
	|	итПараметрыПодключаемогоОборудованияПараметры.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = ЗапросПараметры.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПараметрыОборудования"); // ПараметрыОборудования
		
		ЗаписьXML.ЗаписатьАтрибут("Имя", ВыборкаДетальныеЗаписи.Имя);
		ЗаписьXML.ЗаписатьАтрибут("Значение", ВыборкаДетальныеЗаписи.Значение);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПараметрыПодключаемогоОборудования"); // ПараметрыПодключаемогоОборудования
		ЗаписьXML.ЗаписатьАтрибут("Тип", "ПараметрыПодключаемогоОборудования");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаДетальныеЗаписи.ПараметрыПодключаемогоОборудования));
		ЗаписьXML.ЗаписатьАтрибут("Код", ВыборкаДетальныеЗаписи.Код);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", ВыборкаДетальныеЗаписи.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Ложь");
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ПараметрыПодключаемогоОборудования
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ПараметрыОборудования
	КонецЦикла;	
		
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
	
	ЗаписьXML.Закрыть();
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;

КонецФункции

Функция ПолучитьПараметрыПодключаемогоОборудования(ТекстОшибки)
	ТекстОшибки = "";
		
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
	
	//ПараметрыПодключаемогоОборудования
	
	ЗапросПараметры = Новый Запрос;
	ЗапросПараметры.Текст = 
	"ВЫБРАТЬ
	|	итПараметрыПодключаемогоОборудованияПараметры.Ссылка КАК ПараметрыПодключаемогоОборудования,
	|	итПараметрыПодключаемогоОборудованияПараметры.Ссылка.Наименование КАК Наименование,
	|	итПараметрыПодключаемогоОборудованияПараметры.Ссылка.Код КАК Код,
	|	итПараметрыПодключаемогоОборудованияПараметры.Имя КАК Имя,
	|	итПараметрыПодключаемогоОборудованияПараметры.Значение КАК Значение
	|ИЗ
	|	Справочник.итПараметрыПодключаемогоОборудования.Параметры КАК итПараметрыПодключаемогоОборудованияПараметры
	|ГДЕ
	|	итПараметрыПодключаемогоОборудованияПараметры.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = ЗапросПараметры.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПараметрыОборудования"); // ПараметрыОборудования
		
		ЗаписьXML.ЗаписатьАтрибут("Имя", ВыборкаДетальныеЗаписи.Имя);
		ЗаписьXML.ЗаписатьАтрибут("Значение", ВыборкаДетальныеЗаписи.Значение);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ПараметрыПодключаемогоОборудования"); // ПараметрыПодключаемогоОборудования
		ЗаписьXML.ЗаписатьАтрибут("Тип", "ПараметрыПодключаемогоОборудования");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаДетальныеЗаписи.ПараметрыПодключаемогоОборудования));
		ЗаписьXML.ЗаписатьАтрибут("Код", ВыборкаДетальныеЗаписи.Код);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", ВыборкаДетальныеЗаписи.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("ЭтоГруппа", "Ложь");
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ПараметрыПодключаемогоОборудования
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ПараметрыОборудования
	КонецЦикла;	
		
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
	
	ЗаписьXML.Закрыть();
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции	
#КонецОбласти

#Область Перемещения

Функция ЗагрузитьСписания(СсылкаПодразделениеКомпании, ШтрихКодПользователя, ПараметрыОбмена, Списание, ДатаСписания, ТекстОшибки, Отправка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторПК 		= Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании   = Справочники.ПодразделенияКомпании.ПолучитьСсылку(ИдентификаторПК);

	ТекстОшибки = "";
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКодПользователя);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	Пользователь = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКодПользователя+"> не найден пользователь";
			Возврат "";
		КонецЕсли;
		Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
			ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
			Возврат "";
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКодПользователя+"> не найден пользователь";
		Возврат "";
	КонецЕсли;
	
	СкладКомпании   = Справочники.СкладыКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч",ПодразделениеКомпании.ЕРПМастерКлючСклада).Ссылка;
	
	стОбмена		= ПараметрыОбмена.Получить();
	ДанныеОбмена 	= стОбмена.ДанныеОбмена;
	ПричинаВозврата = стОбмена.ПричинаВозврата;
	
	стДанных = Новый Структура;
	стДанных.Вставить("ПодразделениеКомпании",  ПодразделениеКомпании);
	стДанных.Вставить("СкладКомпании",		    СкладКомпании);
	стДанных.Вставить("ДатаСписания",        	ДатаСписания);
	стДанных.Вставить("Автор",                  Пользователь);
	стДанных.Вставить("Списание",            	Списание);
	стДанных.Вставить("ПричинаВозврата",        ПричинаВозврата);
	
	Попытка
	
		НачатьТранзакцию();

		ДокументОбъект = СоздатьСписание(стДанных);
		
		ТаблицаДанных = ПолучитьДанныеОбмена(ДанныеОбмена);
		
		Если ТаблицаДанных.Свойства().Получить("Товары") = Неопределено Тогда
			ТекстОшибки = "Нет данных для создания списания.";
			Возврат "";
		КонецЕсли;
		
		СписокТоваров = ПолучитьСписокИзXDTO(ТаблицаДанных.Товары);
		Если СписокТоваров.Количество()=0 Тогда
			ТекстОшибки = "Нет данных для создания списания.";
			Возврат "";
		КонецЕсли;
		
		СлужебныйТовар = Константы.СлужебныйТовар.Получить();
		
		Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
			
			Если ПустаяСтрока(ТекущаяСтрока.Номенклатура.Ссылка) Тогда
				СписокШтрихкодов = ПолучитьСписокИзXDTO(ТекущаяСтрока.Штрихкоды);
				Штрихкоды = Новый Массив;
				Для Каждого СтрокаШтрихКод Из СписокШтрихкодов Цикл
					Если ПустаяСтрока(СтрокаШтрихКод.Штрихкод) Тогда
						Продолжить;
					КонецЕсли;
					Штрихкоды.Добавить(СтрокаШтрихКод.Штрихкод);
				КонецЦикла;
				
				ТаблицаШтрихКодов = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(Штрихкоды);
				ТаблицаШтрихКодов.Индексы.Добавить("Штрихкод");
				
				Для Каждого СтрокаШтрихКод Из СписокШтрихкодов Цикл
					Если ПустаяСтрока(СтрокаШтрихКод.Штрихкод) Тогда
						Продолжить;
					КонецЕсли;
					
					ТаблицаШтрихКодов.Найти(СтрокаШтрихКод.Штрихкод, "Штрихкод");
					
					НайденныйШтрихКод = ТаблицаШтрихКодов.Найти(СтрокаШтрихКод.Штрихкод, "Штрихкод");
					Если НайденныйШтрихКод = Неопределено Тогда
						
						ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
						ТоварнаяСтрока.Номенклатура = СлужебныйТовар;
						//ТоварнаяСтрока.ИдентификаторСтроки = СтрокаШтрихКод.Штрихкод;
						Документы.итЗаявкаНаВозврат.ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока);
						ТоварнаяСтрока.Количество = Число(ТекущаяСтрока.Количество);
						Документы.итЗаявкаНаВозврат.ТоварыКоличествоПриИзменении(ДокументОбъект, ТоварнаяСтрока);
						
					Иначе
						
						ТоварнаяСтрока = ДокументОбъект.Товары.Найти(НайденныйШтрихКод.Объект, "Номенклатура");
						Если ТоварнаяСтрока = Неопределено Тогда
							ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
							ТоварнаяСтрока.Номенклатура               = НайденныйШтрихКод.Объект;
							ТоварнаяСтрока.ЕдиницаИзмерения           = НайденныйШтрихКод.ЕдиницаИзмерения;
							ТоварнаяСтрока.ХарактеристикаНоменклатуры = НайденныйШтрихКод.ХарактеристикаНоменклатуры;
							Документы.итЗаявкаНаВозврат.ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока);
						КонецЕсли;
						
						ТоварнаяСтрока.Количество = Число(СтрокаШтрихКод.Количество);
						Документы.итЗаявкаНаВозврат.ТоварыКоличествоПриИзменении(ДокументОбъект, ТоварнаяСтрока);
						
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				
				Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Номенклатура.Ссылка);
				Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
				
				ТоварнаяСтрока = ДокументОбъект.Товары.Найти(Номенклатура, "Номенклатура");
				Если ТоварнаяСтрока = Неопределено Тогда
					ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
					ТоварнаяСтрока.Номенклатура = Номенклатура;
					Документы.итЗаявкаНаВозврат.ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока);
				КонецЕсли;
				
				ТоварнаяСтрока.Количество = Число(ТекущаяСтрока.Количество);
				Документы.итЗаявкаНаВозврат.ТоварыКоличествоПриИзменении(ДокументОбъект, ТоварнаяСтрока);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ДокументОбъект.СуммаДокумента = ДокументОбъект.Товары.Итог("СуммаРозничная");
					
		ДокументОбъект.итСостояние = Перечисления.итСостоянияВыполненияПеремещенийТоваров.НаКонтроле;
		Попытка 
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ТекУзел = ПланыОбмена.рздВыгрузкаВЕРП.НайтиПоКоду("ЕРП");
			ПланыОбмена.ЗарегистрироватьИзменения(ТекУзел, ДокументОбъект.Ссылка);
				
		Исключение
				
			ДокументОбъект.Статус = Перечисления.итСтатусыЗаявокНаВозврат.Сформирован;

			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;	
		
		Фото = стОбмена.Фото;
		Если ТипЗнч(Фото) = Тип("Массив") Тогда
				
				Счетчик = 1;
				Для Каждого ТекущееФото Из Фото Цикл
					АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ТекущееФото);
					
					ПараметрыФайла = Новый Структура();
					ПараметрыФайла.Вставить("Автор",              Пользователь);
					ПараметрыФайла.Вставить("ВладелецФайлов",     ДокументОбъект.Ссылка);
					ПараметрыФайла.Вставить("ИмяБезРасширения",   "Скан № "+СокрЛП(Счетчик)+" документ " + СокрЛП(ДокументОбъект.Ссылка));
					ПараметрыФайла.Вставить("РасширениеБезТочки", "png");
					ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное");
					
					ПрисоединенныйФайл = ПрисоединенныеФайлы.ДобавитьПрисоединенныйФайл(
					ПараметрыФайла, АдресФайлаВоВременномХранилище, , , Справочники.ЭДПрисоединенныеФайлы.ПолучитьСсылку());
					
					Счетчик = Счетчик + 1;
					
				КонецЦикла;
				
			КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат = СформироватьДанныеПередачи(Неопределено);
		ОтменитьТранзакцию();
		Возврат "";
	КонецПопытки;
		
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СериализоватьСсылку(ДокументОбъект.Ссылка);

КонецФункции

Функция СоздатьСписание(ДанныеДокумента)
	
	ДатаСписания = ДанныеДокумента.ДатаСписания;
	Если Не ЗначениеЗаполнено(ДанныеДокумента.ДатаСписания) Тогда
		ДатаСписания = КонецДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДокумента.Списание) Тогда
		Идентификатор = Новый УникальныйИдентификатор(ДанныеДокумента.Списание);
		СписаниеСсылка = Документы.итЗаявкаНаВозврат.ПолучитьСсылку(Идентификатор);
	Иначе
		СписаниеСсылка = Неопределено;
	КонецЕсли;
	ХозОперация = Справочники.ХозОперации.СписаниеТоваров;

	
	ДокументОбъект = Неопределено;
	Если ЗначениеЗаполнено(СписаниеСсылка) Тогда
		ДокументОбъект = СписаниеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если ДокументОбъект = Неопределено Тогда
		
		ДокументОбъект = Документы.итЗаявкаНаВозврат.СоздатьДокумент();
		ДокументОбъект.Заполнить(Неопределено);
		
		ПричинаВозврата = Перечисления.ит_ПричиныВозвратаПродукции[ДанныеДокумента.ПричинаВозврата];
		ДокументОбъект.ПричинаВозврата   = ПричинаВозврата;
		ДокументОбъект.СтатьяСписанияТМЦ = Справочники.СтатьиДоходовИРасходов.НайтиПоРеквизиту("итПричинаВозврата", ПричинаВозврата);
			
		ДокументОбъект.Дата = ДатаСписания;
		ДокументОбъект.ДатаЗаявки = КонецДня(ДатаСписания) + 1;

		Документы.итЗаявкаНаВозврат.ДатаПриИзменении(ДокументОбъект);
		
		ДокументОбъект.УстановитьНовыйНомер();
		
		ДокументОбъект.ХозОперация = ХозОперация;
		
		
		Классификация = Перечисления.итКлассификацияПаспортовНаВозврат.КоричневыйПаспорт;
		спрПричинаВозврата = Справочники.mr_ПричиныВозвратов.НайтиПоРеквизиту("Классификация", Классификация);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	mr_ПричиныВозвратов.Классификация КАК Классификация,
		|	mr_ПричиныВозвратов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.mr_ПричиныВозвратов КАК mr_ПричиныВозвратов
		|ГДЕ
		|	mr_ПричиныВозвратов.СтатьяСписания = &СтатьяСписанияТМЦ";
		
		Запрос.УстановитьПараметр("СтатьяСписанияТМЦ", ДокументОбъект.СтатьяСписанияТМЦ);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Классификация) Тогда
				Классификация = ВыборкаДетальныеЗаписи.Классификация;		
				спрПричинаВозврата = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЕсли;
		КонецЕсли;
			
		ДокументОбъект.Классификация = Классификация;
		ДокументОбъект.ПричинаВозврата   = спрПричинаВозврата;
		
		
		Документы.итЗаявкаНаВозврат.ХозОперацияПриИзменении(ДокументОбъект);
		
		ДокументОбъект.Организация           = ДанныеДокумента.ПодразделениеКомпании.Организация;
		ДокументОбъект.ПодразделениеЗатрат	 = ДанныеДокумента.ПодразделениеКомпании;
		ДокументОбъект.ПодразделениеКомпании = ДанныеДокумента.ПодразделениеКомпании;
		
		Документы.итЗаявкаНаВозврат.ПодразделениеКомпанииПриИзменении(ДокументОбъект);
		
		ДокументОбъект.СкладКомпании   = ДанныеДокумента.СкладКомпании;
		
		Документы.итЗаявкаНаВозврат.СкладКомпанииПриИзменении(ДокументОбъект);
				
		ДокументОбъект.Автор = ДанныеДокумента.Автор;
		Документы.итЗаявкаНаВозврат.АвторПриИзменении(ДокументОбъект);
		ДокументОбъект.Статус = Перечисления.итСтатусыЗаявокНаВозврат.КОтправке;
		
	КонецЕсли;
	
	Возврат ДокументОбъект;
	
КонецФункции

Функция ЗагрузитьСписания_Устарела(СсылкаПодразделениеКомпании, ШтрихКодПользователя, ПараметрыОбмена, Списание, ДатаСписания, ТекстОшибки, Отправка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторПК 		= Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании   = Справочники.ПодразделенияКомпании.ПолучитьСсылку(ИдентификаторПК);

	ТекстОшибки = "";
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКодПользователя);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	Пользователь = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКодПользователя+"> не найден пользователь";
			Возврат "";
		КонецЕсли;
		Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
			ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
			Возврат "";
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКодПользователя+"> не найден пользователь";
		Возврат "";
	КонецЕсли;
	
	СкладКомпании   = Справочники.СкладыКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч",ПодразделениеКомпании.ЕРПМастерКлючСклада).Ссылка;
	
	стОбмена		= ПараметрыОбмена.Получить();
	ДанныеОбмена 	= стОбмена.ДанныеОбмена;
	ПричинаВозврата = стОбмена.ПричинаВозврата;
	
	стДанных = Новый Структура;
	стДанных.Вставить("ПодразделениеКомпании",  ПодразделениеКомпании);
	стДанных.Вставить("СкладКомпании",		    СкладКомпании);
	стДанных.Вставить("ДатаСписания",        	ДатаСписания);
	стДанных.Вставить("Автор",                  Пользователь);
	стДанных.Вставить("Списание",            	Списание);
	стДанных.Вставить("ПричинаВозврата",        ПричинаВозврата);
	
	Попытка
	
		НачатьТранзакцию();

		ДокументОбъект = СоздатьСписание(стДанных);
		
		ТаблицаДанных = ПолучитьДанныеОбмена(ДанныеОбмена);
		
		Если ТаблицаДанных.Свойства().Получить("Товары") = Неопределено Тогда
			ТекстОшибки = "Нет данных для создания списания.";
			Возврат "";
		КонецЕсли;
		
		СписокТоваров = ПолучитьСписокИзXDTO(ТаблицаДанных.Товары);
		Если СписокТоваров.Количество()=0 Тогда
			ТекстОшибки = "Нет данных для создания списания.";
			Возврат "";
		КонецЕсли;
		
		СлужебныйТовар = Константы.СлужебныйТовар.Получить();
		
		Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
			
			Если ПустаяСтрока(ТекущаяСтрока.Номенклатура.Ссылка) Тогда
				СписокШтрихкодов = ПолучитьСписокИзXDTO(ТекущаяСтрока.Штрихкоды);
				Штрихкоды = Новый Массив;
				Для Каждого СтрокаШтрихКод Из СписокШтрихкодов Цикл
					Если ПустаяСтрока(СтрокаШтрихКод.Штрихкод) Тогда
						Продолжить;
					КонецЕсли;
					Штрихкоды.Добавить(СтрокаШтрихКод.Штрихкод);
				КонецЦикла;
				
				ТаблицаШтрихКодов = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(Штрихкоды);
				ТаблицаШтрихКодов.Индексы.Добавить("Штрихкод");
				
				Для Каждого СтрокаШтрихКод Из СписокШтрихкодов Цикл
					Если ПустаяСтрока(СтрокаШтрихКод.Штрихкод) Тогда
						Продолжить;
					КонецЕсли;
					
					ТаблицаШтрихКодов.Найти(СтрокаШтрихКод.Штрихкод, "Штрихкод");
					
					НайденныйШтрихКод = ТаблицаШтрихКодов.Найти(СтрокаШтрихКод.Штрихкод, "Штрихкод");
					Если НайденныйШтрихКод = Неопределено Тогда
						
						ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
						ТоварнаяСтрока.Номенклатура = СлужебныйТовар;
						//ТоварнаяСтрока.ИдентификаторСтроки = СтрокаШтрихКод.Штрихкод;
						Документы.СписаниеТоваров.ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока);
						ТоварнаяСтрока.Количество = Число(ТекущаяСтрока.Количество);
						Документы.СписаниеТоваров.ТоварыКоличествоПриИзменении(ДокументОбъект, ТоварнаяСтрока);
						
					Иначе
						
						ТоварнаяСтрока = ДокументОбъект.Товары.Найти(НайденныйШтрихКод.Объект, "Номенклатура");
						Если ТоварнаяСтрока = Неопределено Тогда
							ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
							ТоварнаяСтрока.Номенклатура               = НайденныйШтрихКод.Объект;
							ТоварнаяСтрока.ЕдиницаИзмерения           = НайденныйШтрихКод.ЕдиницаИзмерения;
							ТоварнаяСтрока.ХарактеристикаНоменклатуры = НайденныйШтрихКод.ХарактеристикаНоменклатуры;
							Документы.СписаниеТоваров.ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока);
						КонецЕсли;
						
						ТоварнаяСтрока.Количество = Число(СтрокаШтрихКод.Количество);
						Документы.СписаниеТоваров.ТоварыКоличествоПриИзменении(ДокументОбъект, ТоварнаяСтрока);
						
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				
				Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Номенклатура.Ссылка);
				Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
				
				ТоварнаяСтрока = ДокументОбъект.Товары.Найти(Номенклатура, "Номенклатура");
				Если ТоварнаяСтрока = Неопределено Тогда
					ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
					ТоварнаяСтрока.Номенклатура = Номенклатура;
					Документы.СписаниеТоваров.ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока);
				КонецЕсли;
				
				ТоварнаяСтрока.Количество = Число(ТекущаяСтрока.Количество);
				Документы.СписаниеТоваров.ТоварыКоличествоПриИзменении(ДокументОбъект, ТоварнаяСтрока);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ДокументОбъект.СуммаДокумента = ДокументОбъект.Товары.Итог("СуммаРозничная");
			
		Если Отправка Тогда
			
			ДокументОбъект.итСостояние = Перечисления.итСостоянияВыполненияПеремещенийТоваров.НаКонтроле;
			Попытка 
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ДокументОбъект.ОбменДанными.Загрузка = Истина;
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки;	

			
			Состояния = РегистрыСведений.итСостоянияВыполненияСписанийТоваров.СоздатьМенеджерЗаписи();
			Состояния.Период 	  = ТекущаяДата();
			Состояния.Списание 	  = ДокументОбъект.Ссылка;
			Состояния.Состояние   = Перечисления.итСостоянияВыполненияПеремещенийТоваров.НаКонтроле;
			Состояния.Сотрудник   = Пользователь;
			Состояния.Записать();
			
		Иначе
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		КонецЕсли;
		
		Фото = стОбмена.Фото;
		Если ТипЗнч(Фото) = Тип("Массив") Тогда
				
				Счетчик = 1;
				Для Каждого ТекущееФото Из Фото Цикл
					АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ТекущееФото);
					
					ПараметрыФайла = Новый Структура();
					ПараметрыФайла.Вставить("Автор",              Пользователь);
					ПараметрыФайла.Вставить("ВладелецФайлов",     ДокументОбъект.Ссылка);
					ПараметрыФайла.Вставить("ИмяБезРасширения",   "Скан № "+СокрЛП(Счетчик)+" документ " + СокрЛП(ДокументОбъект.Ссылка));
					ПараметрыФайла.Вставить("РасширениеБезТочки", "png");
					ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное");
					
					ПрисоединенныйФайл = ПрисоединенныеФайлы.ДобавитьПрисоединенныйФайл(
					ПараметрыФайла, АдресФайлаВоВременномХранилище, , , Справочники.ЭДПрисоединенныеФайлы.ПолучитьСсылку());
					
					Счетчик = Счетчик + 1;
					
				КонецЦикла;
				
			КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат = СформироватьДанныеПередачи(Неопределено);
		ОтменитьТранзакцию();
		Возврат "";
	КонецПопытки;
		
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СериализоватьСсылку(ДокументОбъект.Ссылка);

КонецФункции

Функция СоздатьСписание_Устарела(ДанныеДокумента)
	
	ДатаСписания = ДанныеДокумента.ДатаСписания;
	Если Не ЗначениеЗаполнено(ДанныеДокумента.ДатаСписания) Тогда
		ДатаСписания = КонецДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДокумента.Списание) Тогда
		Идентификатор = Новый УникальныйИдентификатор(ДанныеДокумента.Списание);
		СписаниеСсылка = Документы.СписаниеТоваров.ПолучитьСсылку(Идентификатор);
	Иначе
		СписаниеСсылка = Неопределено;
	КонецЕсли;
	ХозОперация = Справочники.ХозОперации.СписаниеТоваров;

	
	ДокументОбъект = Неопределено;
	Если ЗначениеЗаполнено(СписаниеСсылка) Тогда
		ДокументОбъект = СписаниеСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если ДокументОбъект = Неопределено Тогда
		
		ДокументОбъект = Документы.СписаниеТоваров.СоздатьДокумент();
		ДокументОбъект.Заполнить(Неопределено);
		
		ПричинаВозврата = Перечисления.ит_ПричиныВозвратаПродукции[ДанныеДокумента.ПричинаВозврата];
		ДокументОбъект.ПричинаВозврата   = ПричинаВозврата;
		ДокументОбъект.СтатьяСписанияТМЦ = Справочники.СтатьиДоходовИРасходов.НайтиПоРеквизиту("итПричинаВозврата", ПричинаВозврата);
			
		ДокументОбъект.Дата = ДатаСписания;
		Документы.СписаниеТоваров.ДатаПриИзменении(ДокументОбъект);
		
		ДокументОбъект.УстановитьНовыйНомер();
		
		ДокументОбъект.ХозОперация = ХозОперация;
		
		Документы.СписаниеТоваров.ХозОперацияПриИзменении(ДокументОбъект);
		
		ДокументОбъект.Организация           = ДанныеДокумента.ПодразделениеКомпании.Организация;
		ДокументОбъект.ПодразделениеЗатрат	 = ДанныеДокумента.ПодразделениеКомпании;
		ДокументОбъект.ПодразделениеКомпании = ДанныеДокумента.ПодразделениеКомпании;
		
		Документы.СписаниеТоваров.ПодразделениеКомпанииПриИзменении(ДокументОбъект);
		
		ДокументОбъект.СкладКомпании   = ДанныеДокумента.СкладКомпании;
		
		Документы.СписаниеТоваров.СкладКомпанииПриИзменении(ДокументОбъект);
				
		ДокументОбъект.Автор = ДанныеДокумента.Автор;
		Документы.СписаниеТоваров.АвторПриИзменении(ДокументОбъект);
		
	КонецЕсли;
	
	Возврат ДокументОбъект;
	
КонецФункции


Функция ЗагрузитьСписанияКМ(СсылкаПодразделениеКомпании, ШтрихКодПользователя, ПараметрыОбмена, ТекстОшибки, Отправка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторПК 		= Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании   = Справочники.ПодразделенияКомпании.ПолучитьСсылку(ИдентификаторПК);

	ТекстОшибки = "";
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКодПользователя);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	Пользователь = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКодПользователя+"> не найден пользователь";
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
			ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКодПользователя+"> не найден пользователь";
		Возврат Ложь;
	КонецЕсли;
	
	СкладКомпании   = Справочники.СкладыКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч",ПодразделениеКомпании.ЕРПМастерКлючСклада).Ссылка;
	
	стОбмена		= ПараметрыОбмена.Получить();
	ДанныеОбмена 	= стОбмена.ДанныеОбмена;

	
	
	Попытка
		
		
		ТаблицаДанных = ПолучитьДанныеОбмена(ДанныеОбмена);
		
		Если ТаблицаДанных.Свойства().Получить("Товары") = Неопределено Тогда
			ТекстОшибки = "Нет данных для создания списания.";
			Возврат Ложь;
		КонецЕсли;
		
		СписокТоваров = ПолучитьСписокИзXDTO(ТаблицаДанных.Товары);
		Если СписокТоваров.Количество()=0 Тогда
			ТекстОшибки = "Нет данных для создания списания.";
			Возврат Ложь;
		КонецЕсли;

		ТаблицаТоваров = Новый ТаблицаЗначений;
		ТаблицаТоваров.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаТоваров.Колонки.Добавить("КодМаркировки",ОбщегоНазначения.ОписаниеТипаСтрока(200));
		ТаблицаТоваров.Колонки.Добавить("ОсобенностьУчета",Новый ОписаниеТипов("СправочникСсылка.ОсобенностиУчетаНоменклатуры"));
		
		Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
			
			Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Номенклатура.Ссылка);
			Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
			
			НовСтр = ТаблицаТоваров.Добавить();
			НовСтр.Номенклатура 	=  Номенклатура;
			Если Номенклатура.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияДляПродажиВНарезкуМаркированная Тогда
				НовСтр.КодМаркировки 	   = Лев(ТекущаяСтрока.КодМарки, 24);
			Иначе
				НовСтр.КодМаркировки 	   = ТекущаяСтрока.КодМарки;				
			КонецЕсли;

			НовСтр.ОсобенностьУчета =  Номенклатура.ОсобенностьУчета;
			
		КонецЦикла;
		
		
		НачатьТранзакцию();
			
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Подразделение",ПодразделениеКомпании);
		Запрос.УстановитьПараметр("ТаблицаТоваров",ТаблицаТоваров);		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.КодМаркировки КАК КодМаркировки,
		|	ТаблицаТоваров.ОсобенностьУчета КАК ОсобенностьУчета
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	&ТаблицаТоваров КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.Номенклатура КАК Номенклатура,
		|	втТовары.КодМаркировки КАК КодМаркировки,
		|	втТовары.ОсобенностьУчета КАК ОсобенностьУчета,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) > 0
		|			ТОГДА ОстаткиТоваровКомпанииОстатки.СуммаРознОстаток / ОстаткиТоваровКомпанииОстатки.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Цена,
		|	втТовары.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	втТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Коэффициент
		|ИЗ
		|	втТовары КАК втТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, СкладКомпании.ПодразделениеКомпании = &Подразделение) КАК ОстаткиТоваровКомпанииОстатки
		|		ПО втТовары.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура
		|ИТОГИ ПО
		|	ОсобенностьУчета";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаОсобенностьУчета = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаОсобенностьУчета.Следующий() Цикл
			// Вставить обработку выборки ВыборкаОсобенностьУчета
			
			
			
			ОбДокумент = Документы.ВыводИзОборотаКодовМаркировки.СоздатьДокумент();
			ОбДокумент.Дата 				  			= ТекущаяДата();
			
			ОбДокумент.УстановитьНовыйНомер();
		    ОбДокумент.ХозОперация 						= Справочники.ХозОперации.ВыводИзОборотаКодовМаркировки;
			ОбДокумент.Организация                      = ПодразделениеКомпании.Организация;
			ОбДокумент.ПодразделениеКомпании            = ПодразделениеКомпании;
			ОбДокумент.Автор                            = ПараметрыСеанса.ТекущийПользователь;
			ОбДокумент.Дата 				  			= ТекущаяДата();
			ОбДокумент.ВидПервичногоДокумента 			= Перечисления.ВидыПервичныхДокументов.Прочее;
			ОбДокумент.Статус                 			= Перечисления.СтатусыДокументовМаркировки.Новый;
			ОбДокумент.ТипЦен                 			= Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
			ОбДокумент.ПричинаВывода          			= Перечисления.ПричиныВыводаИзОборота.РозничнаяПродажа;
			ОбДокумент.НомерПервичногоДокумента 		= ОбДокумент.Номер;
			ОбДокумент.ДатаПервичногоДокумента  		= ОбДокумент.Дата;
			ОбДокумент.НаименованиеПервичногоДокумента  = "Прочее";
			ОбДокумент.ДатаВыводаИзОборота 	  			= ТекущаяДата();
			ОбДокумент.ИдентификаторДокумента 			= Новый УникальныйИдентификатор;
			ОбДокумент.ОсобенностьУчета 				= ВыборкаОсобенностьУчета.ОсобенностьУчета;
			ОбДокумент.СписаниеКодовМаркировкиНаТСД 	= Истина;
			
			ВыборкаДетальныеЗаписи = ВыборкаОсобенностьУчета.Выбрать();
	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ИдентификаторСтроки = Новый УникальныйИдентификатор;
			
				НовСтр = ОбДокумент.Товары.Добавить();
				НовСтр.Номенклатура 	   				= ВыборкаДетальныеЗаписи.Номенклатура;
				НовСтр.ИдентификаторТовара 				= ИдентификаторСтроки;
				НовСтр.Количество 						= 1;
				НовСтр.ЕдиницаИзмерения 				= ВыборкаДетальныеЗаписи.ЕдиницаИзмерения;
				НовСтр.Коэффициент 						= ВыборкаДетальныеЗаписи.Коэффициент;
				НовСтр.ДатаПервичногоДокумента 			= ОбДокумент.Дата;
				НовСтр.НомерПервичногоДокумента 		= ОбДокумент.Номер;
				НовСтр.ВидПервичногоДокумента 			= Перечисления.ВидыПервичныхДокументов.Прочее;
				НовСтр.НаименованиеПервичногоДокумента  = "Прочее";
				НовСтр.Цена 							= ВыборкаДетальныеЗаписи.Цена;
				
				НовСтр1 = ОбДокумент.КодыМаркировки.Добавить();
				НовСтр1.КодМаркировки 	   = ВыборкаДетальныеЗаписи.КодМаркировки;
				НовСтр1.ИдентификаторТовара = ИдентификаторСтроки;
				
			КонецЦикла;
			
			
			
		//	ДокументОбъект = Документы.СписаниеКодовМаркировки.СоздатьДокумент();
		//	ДокументОбъект.Заполнить(Неопределено);
		//	
		//	ДокументОбъект.Дата = ТекущаяДата();
		//	ДокументОбъект.УстановитьНовыйНомер();
		//	
		//	ДокументОбъект.ХозОперация = Справочники.ХозОперации.СписаниеКодовМаркировки;		
		//	Документы.СписаниеКодовМаркировки.ХозОперацияПриИзменении(ДокументОбъект);
		//	
		//	ДокументОбъект.Организация           = ПодразделениеКомпании.Организация;
		//	ДокументОбъект.ПодразделениеКомпании = ПодразделениеКомпании;
		//	
		//	Документы.СписаниеКодовМаркировки.ПодразделениеКомпанииПриИзменении(ДокументОбъект);
		//	
		//			
		//	ДокументОбъект.Автор = Пользователь;
		//	ДокументОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.Новый;
		//	ДокументОбъект.ПричинаСписания = Перечисления.ПричиныСписанияКодовМаркировки.Уничтожен;
		//	ДокументОбъект.ОсобенностьУчета = ВыборкаОсобенностьУчета.ОсобенностьУчета;
		//
		//	ВыборкаДетальныеЗаписи = ВыборкаОсобенностьУчета.Выбрать();
		//
		//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//		НовСтр = ДокументОбъект.Товары.Добавить();
		//		НовСтр.Номенклатура 	=  ВыборкаДетальныеЗаписи.Номенклатура;
		//		НовСтр.КодМаркировки 	=  ВыборкаДетальныеЗаписи.КодМаркировки;
		//		НовСтр.ПричинаСписания	=  Перечисления.ПричиныСписанияКодовМаркировки.Уничтожен;

		//	КонецЦикла;
			
			Попытка 
				ОбДокумент.Записать(РежимЗаписиДокумента.Проведение);
					
			Исключение
					
				ОбДокумент.ОбменДанными.Загрузка = Истина;
				ОбДокумент.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки;	

		КонецЦикла;
	
		
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат = СформироватьДанныеПередачи(Неопределено);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
		
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат "Успешно";

КонецФункции

Функция ЗагрузитьОприходованияКМ(СсылкаПодразделениеКомпании, ШтрихКодПользователя, ПараметрыОбмена, ТекстОшибки, Отправка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторПК 		= Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании   = Справочники.ПодразделенияКомпании.ПолучитьСсылку(ИдентификаторПК);

	ТекстОшибки = "";
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКодПользователя);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	|	ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	|	Штрихкоды.Штрихкод = &Штрихкод
	|";
	
	Пользователь = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Пользователь;
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "По штрих-коду <"+ШтрихКодПользователя+"> не найден пользователь";
			Возврат Ложь;
		КонецЕсли;
		Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
			ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ТекстОшибки = "По штрих-коду <"+ШтрихКодПользователя+"> не найден пользователь";
		Возврат Ложь;
	КонецЕсли;
	
	СкладКомпании   = Справочники.СкладыКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч",ПодразделениеКомпании.ЕРПМастерКлючСклада).Ссылка;
	
	стОбмена		= ПараметрыОбмена.Получить();
	ДанныеОбмена 	= стОбмена.ДанныеОбмена;

	
	
	Попытка
				
		ТаблицаДанных = ПолучитьДанныеОбмена(ДанныеОбмена);
		
		Если ТаблицаДанных.Свойства().Получить("Товары") = Неопределено Тогда
			ТекстОшибки = "Нет данных для создания оприходования КМ.";
			Возврат Ложь;
		КонецЕсли;
		
		СписокТоваров = ПолучитьСписокИзXDTO(ТаблицаДанных.Товары);
		Если СписокТоваров.Количество()=0 Тогда
			ТекстОшибки = "Нет данных для создания Оприходования КМ.";
			Возврат Ложь;
		КонецЕсли;

		ТаблицаТоваров = Новый ТаблицаЗначений;
		ТаблицаТоваров.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаТоваров.Колонки.Добавить("КодМаркировки",ОбщегоНазначения.ОписаниеТипаСтрока(200));
		ТаблицаТоваров.Колонки.Добавить("ОсобенностьУчета",Новый ОписаниеТипов("СправочникСсылка.ОсобенностиУчетаНоменклатуры"));
		
		Для Каждого ТекущаяСтрока Из СписокТоваров Цикл
			
			Идентификатор = Новый УникальныйИдентификатор(ТекущаяСтрока.Номенклатура.Ссылка);
			Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Идентификатор);
			
			НовСтр = ТаблицаТоваров.Добавить();
			НовСтр.Номенклатура 	=  Номенклатура;			
			Если Номенклатура.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.МолочнаяПродукцияДляПродажиВНарезкуМаркированная Тогда
				НовСтр.КодМаркировки 	   = Лев(ТекущаяСтрока.КодМарки, 24);
			Иначе
				НовСтр.КодМаркировки 	   = ТекущаяСтрока.КодМарки;				
			КонецЕсли;

			Если Лев(Прав(НовСтр.КодМаркировки,6),2)="93" Тогда
				НовСтр.КодМаркировки = стрЗаменить(НовСтр.КодМаркировки,Прав(НовСтр.КодМаркировки,6),"");
			КонецЕсли;
			
			НовСтр.ОсобенностьУчета =  Номенклатура.ОсобенностьУчета;
			
		КонецЦикла;
		
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаТоваров",ТаблицаТоваров);		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ТаблицаТоваров.КодМаркировки КАК КодМаркировки,
		|	ТаблицаТоваров.ОсобенностьУчета КАК ОсобенностьУчета
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	&ТаблицаТоваров КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.Номенклатура КАК Номенклатура,
		|	втТовары.КодМаркировки КАК КодМаркировки,
		|	ВЫБОР
		|		КОГДА СостоянияКодовМаркировки.КодМаркировки ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ПовторнаяРегистрация,
		|   СостоянияКодовМаркировки.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	втТовары КАК втТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияКодовМаркировки КАК СостоянияКодовМаркировки
		|		ПО втТовары.КодМаркировки = СостоянияКодовМаркировки.КодМаркировки
		|ГДЕ
		|	СостоянияКодовМаркировки.КодМаркировки ЕСТЬ NULL";
		
		РезультатЗапросаВыборка = Запрос.Выполнить().Выбрать();
		
		Пока РезультатЗапросаВыборка.Следующий() Цикл
			Если НЕ РезультатЗапросаВыборка.ПовторнаяРегистрация Тогда 
				регСостоянияКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьМенеджерЗаписи();	
				ЗаполнитьЗначенияСвойств(регСостоянияКодовМаркировки,РезультатЗапросаВыборка);
				Если Лев(Прав(регСостоянияКодовМаркировки.КодМаркировки,6),2)="93" Тогда
					регСостоянияКодовМаркировки.КодМаркировки = стрЗаменить(регСостоянияКодовМаркировки.КодМаркировки,Прав(регСостоянияКодовМаркировки.КодМаркировки,6),"");
				КонецЕсли;
				регСостоянияКодовМаркировки.Состояние = Перечисления.СостоянияКодовМаркировки.Неопределен;
				регСостоянияКодовМаркировки.Записать(Истина);
			Иначе 
				регСостоянияКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
				регСостоянияКодовМаркировки.Отбор.ДокументОснование.Установить(РезультатЗапросаВыборка.ДокументОснование);
				регСостоянияКодовМаркировки.Отбор.КодМаркировки.Установить(РезультатЗапросаВыборка.КодМаркировки);
				регСостоянияКодовМаркировки.Прочитать();
				
				Для каждого стррегСостоянияКодовМаркировки из регСостоянияКодовМаркировки Цикл
					стррегСостоянияКодовМаркировки.Состояние = Перечисления.СостоянияКодовМаркировки.Неопределен;
					стррегСостоянияКодовМаркировки.ДатаПроверки = "";
				КонецЦикла;
				
				регСостоянияКодовМаркировки.Записать();
			КонецЕсли;
		КонецЦикла;	

		
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат = СформироватьДанныеПередачи(Неопределено);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат "Успешно";

КонецФункции

#КонецОбласти

#Область ЦеныНоменклатуры

Функция ВернутьЦеныНоменклатуры(ШтрихКод, СсылкаПодразделениеКомпании, СсылкаАлкоПродукции)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстОшибки = "";
	
	Если ПустаяСтрока(ШтрихКод) Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС+"Штрих-код не заполнен";
	КонецЕсли;
		
	ТаблицаШтрихКодов = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(ШтрихКод);
	
	НайденныйШтрихКод = НЕОПРЕДЕЛЕНО;
	ПоляНоменклатуры  = НЕОПРЕДЕЛЕНО;
	
	Если ТаблицаШтрихКодов.Количество() = 0 Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул = &Артикул
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Код = &Артикул
		|";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Артикул", ШтрихКод);
		
		Номенклатура = Неопределено;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			НайденныйШтрихКод = Новый Структура;
			НайденныйШтрихКод.Вставить("Объект",Выборка.Ссылка);
			
			ПоляНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НайденныйШтрихКод.Объект, "Ссылка, Код, Наименование, Артикул, ИерархияАльтернативная, ТипНоменклатуры, СрокХраненияТовара, КратностьПоставок, Объем, Крепость");

		КонецЕсли;
		
	Иначе	
		
		НайденныйШтрихКод = ТаблицаШтрихКодов[0];	
			
		ПоляНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НайденныйШтрихКод.Объект, "Ссылка, Код, Наименование, Артикул, ИерархияАльтернативная, ТипНоменклатуры, СрокХраненияТовара, КратностьПоставок, Объем, Крепость");
		
	КонецЕсли;
	
	Если НайденныйШтрихКод = НЕОПРЕДЕЛЕНО Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС+"По штрих-коду/артикулу <"+ШтрихКод+"> не найдена номенклатура";
		ПоляНоменклатуры = Новый Структура;
		ПоляНоменклатуры.Вставить("Ссылка",  	  	   Справочники.Номенклатура.ПустаяСсылка());
		ПоляНоменклатуры.Вставить("Наименование", 	   "");
		ПоляНоменклатуры.Вставить("ТипНоменклатуры",   Справочники.ТипыНоменклатуры.ПустаяСсылка());
		ПоляНоменклатуры.Вставить("СрокХраненияТовара",0);
		ПоляНоменклатуры.Вставить("КратностьПоставок", 0);	
		ПоляНоменклатуры.Вставить("Объем", 			   0);	
		ПоляНоменклатуры.Вставить("Крепость", 		   0);	
		
	КонецЕсли;
		
	ИдентификаторПК 		= Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании   = Справочники.ПодразделенияКомпании.ПолучитьСсылку(ИдентификаторПК);
	
	Если Не ЗначениеЗаполнено(ПодразделениеКомпании) Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС+"Нет данных подразделения";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаАлкоПродукции) И  НайденныйШтрихКод <> НЕОПРЕДЕЛЕНО Тогда
		
		ИдентификаторПК 		= Новый УникальныйИдентификатор(СсылкаАлкоПродукции);
		АлкогольнаяПродукция    = Справочники.КлассификаторАлкогольнойПродукцииЕГАИС.ПолучитьСсылку(ИдентификаторПК);
	   	Номенклатура            = ПоляНоменклатуры.Ссылка;
		
		Если ПустаяСтрока(ТекстОшибки) Тогда
			 ОшибкаКонтроля = Ложь;
			//Нужно вставить в сервис, чтобы не давал установить неправильное соответствие	
			Если ЗначениеЗаполнено(Номенклатура.ВидАлкогольнойПродукции) и 
				НЕ Номенклатура.ВидАлкогольнойПродукции = АлкогольнаяПродукция.ВидПродукции Тогда
				ТекстОшибки = ТекстОшибки + Символы.ПС+"Для Номенклатуры - " + Номенклатура.Наименование + " - <<Вид алкогольной продукции>> в номенклатуре не равен виду продукции в классификаторе продукции ЕГАИС, запись не возможна!";
				ОшибкаКонтроля = Истина;
			КонецЕсли;

			Если НЕ Номенклатура.Крепость = АлкогольнаяПродукция.Крепость ТОгда
				ТекстОшибки = ТекстОшибки + Символы.ПС+"Для Номенклатуры - " + Номенклатура.Наименование + " - <<Крепость>> не совпадает с крепостью Алко. продукции ЕГАИС, запись не возможна!";
				ОшибкаКонтроля = Истина;
			КонецЕсли;	

			Если НЕ Номенклатура.Объем = АлкогольнаяПродукция.Объем ТОгда
				ТекстОшибки = ТекстОшибки + Символы.ПС+"Для Номенклатуры - " + Номенклатура.Наименование + " - <<Объем>> не совпадает с объемом Алко. продукции ЕГАИС, запись не возможна!";		
				ОшибкаКонтроля = Истина;
			КонецЕсли;
			
			Если ОшибкаКонтроля Тогда
				ПоляНоменклатуры = Новый Структура;
				ПоляНоменклатуры.Вставить("Ссылка",  	  	   Справочники.Номенклатура.ПустаяСсылка());
				ПоляНоменклатуры.Вставить("Наименование", 	   "");
				ПоляНоменклатуры.Вставить("ТипНоменклатуры",   Справочники.ТипыНоменклатуры.ПустаяСсылка());
				ПоляНоменклатуры.Вставить("СрокХраненияТовара",0);
				ПоляНоменклатуры.Вставить("КратностьПоставок", 0);	
				ПоляНоменклатуры.Вставить("Объем", 			   0);	
				ПоляНоменклатуры.Вставить("Крепость", 		   0);	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеЦен = ИТ_СпециальныйМодульСервер.ПолучитьДанныеТекущихЦен(ПоляНоменклатуры.Ссылка, ПодразделениеКомпании);		
	ДанныеЦен.Вставить("Наименование", 		ПоляНоменклатуры.Наименование);
	ДанныеЦен.Вставить("ТипХранения", 		?(ПоляНоменклатуры.ТипНоменклатуры.Весовой, "Весовой", "Штучный"));
	ДанныеЦен.Вставить("СрокХранения", 		ПоляНоменклатуры.СрокХраненияТовара);
	ДанныеЦен.Вставить("Объем", 			ПоляНоменклатуры.Объем);
	ДанныеЦен.Вставить("Крепость",	 		ПоляНоменклатуры.Крепость);	
	ДанныеЦен.Вставить("КратностьПоставки", ПоляНоменклатуры.КратностьПоставок);	
	ДанныеЦен.Вставить("Остаток", 			ПолучитьТекущийОстатокНоменклатуры(ПоляНоменклатуры.Ссылка, ПодразделениеКомпании));		
	ДанныеЦен.Вставить("ТекстОшибки",  		ТекстОшибки);
		
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Результат = Новый ХранилищеЗначения(ДанныеЦен, Новый СжатиеДанных(9));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТекущийОстатокНоменклатуры(Номенклатура, ПодразделениеКомпании)
	
	Остаток = 0;
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Остаток;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПодразделениеКомпании) Тогда
		Возврат Остаток;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|			&ПериодОстатка,
	|			Номенклатура = &Номенклатура
	|				И СкладКомпании.ПодразделениеКомпании = &ПодразделениеКомпании) КАК ОстаткиТоваровКомпанииОстатки";
	
	Запрос.УстановитьПараметр("Номенклатура", 		   Номенклатура);
	Запрос.УстановитьПараметр("ПериодОстатка", 		   ТекущаяДата());
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Остаток = ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;

	
	Возврат Остаток;
	
КонецФункции

Функция КонтрольАктуальныхЦен(СсылкаПодразделениеКомпании)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстОшибки = ""; 
	ПодразделениеКомпании = НЕОПРЕДЕЛЕНО;
	Попытка
		ИдентификаторПК 		= Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
		ПодразделениеКомпании   = Справочники.ПодразделенияКомпании.ПолучитьСсылку(ИдентификаторПК);
	Исключение
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ПодразделениеКомпании) Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС+"Нет данных подразделения";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итАктуализацияЭтикетокИЦениковСостав.Номенклатура КАК НоменклатураСсылка,
	|	итАктуализацияЭтикетокИЦениковСостав.ЦенаДо КАК ЦенаДо,
	|	итАктуализацияЭтикетокИЦениковСостав.ЦенаТекущая КАК ЦенаТекущая
	|ИЗ
	|	Документ.итАктуализацияЭтикетокИЦеников.Состав КАК итАктуализацияЭтикетокИЦениковСостав
	|ГДЕ
	|	итАктуализацияЭтикетокИЦениковСостав.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И итАктуализацияЭтикетокИЦениковСостав.Ссылка.Завершен = ЛОЖЬ
	|	И итАктуализацияЭтикетокИЦениковСостав.Ссылка.ПодразделениеКомпании = &Подразделение
	|	И итАктуализацияЭтикетокИЦениковСостав.Ссылка.СозданВТСД = ЛОЖЬ
	|	И итАктуализацияЭтикетокИЦениковСостав.Ссылка.Дата >= &ДатаНачала
	|
	|СГРУППИРОВАТЬ ПО
	|	итАктуализацияЭтикетокИЦениковСостав.Номенклатура,
	|	итАктуализацияЭтикетокИЦениковСостав.ЦенаДо,
	|	итАктуализацияЭтикетокИЦениковСостав.ЦенаТекущая";
	
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ДатаНачала", ТекущаяДата() - 7*3600*24);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаДанных    = РезультатЗапроса.Выгрузить();	
	ТаблицаДанных.Колонки.Добавить("Номенклатура", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	Для Каждого стр Из ТаблицаДанных Цикл
   		стр.Номенклатура = СериализоватьСсылку(стр.НоменклатураСсылка);
	КонецЦикла;
	ТаблицаДанных.Колонки.Удалить("НоменклатураСсылка");
		
	КонтрольЦен = Новый Структура;		
	КонтрольЦен.Вставить("ТаблицаДанных", 	    ТаблицаДанных);	
	КонтрольЦен.Вставить("ТекстОшибки",  		ТекстОшибки);
		
	УстановитьПривилегированныйРежим(Ложь);
	
	Результат = Новый ХранилищеЗначения(КонтрольЦен, Новый СжатиеДанных(9));
	
	Возврат Результат;

КонецФункции

Функция ПолучитьПредельноеВремяЗаказов(СсылкаПодразделениеКомпании, ВидЗаказа)
	
	ПредельноеВремя = 0;
	
	Идентификатор = Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьСсылку(Идентификатор);

	Если НЕ ЗначениеЗаполнено(ПодразделениеКомпании) Тогда
		Возврат ПредельноеВремя;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидЗаказа) Тогда	
		Возврат ПредельноеВремя;
	КонецЕсли;
		
	Попытка 
		ВидЗаказаСсылка = Перечисления.рздВидыЗаказовЕРП[ВидЗаказа];
	Исключение		
		Возврат ПредельноеВремя;
	КонецПопытки;	
	
	//++ ситников 20251117 Задача № 319345
	// удаляем старый метод, он нерабочий
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	//Запрос.УстановитьПараметр("ПодразделениеКомпанииРодитель", ПодразделениеКомпании.Родитель);	
	//Запрос.УстановитьПараметр("ВидЗаказа", ВидЗаказаСсылка);	
	//Запрос.Текст =  "ВЫБРАТЬ
	//|	итПредельноеВремяСозданияЗаказов.Подразделение КАК Подразделение,
	//|	итПредельноеВремяСозданияЗаказов.ВидЗаказа КАК ВидЗаказа,
	//|	итПредельноеВремяСозданияЗаказов.ПредельноеВремя КАК ПредельноеВремя,
	//|	РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), итПредельноеВремяСозданияЗаказов.ПредельноеВремя, СЕКУНДА) КАК СекундПредельноеВремя,
	//|	ВЫБОР
	//|		КОГДА итПредельноеВремяСозданияЗаказов.Подразделение = &ПодразделениеКомпании
	//|			ТОГДА 1
	//|		ИНАЧЕ 2
	//|	КОНЕЦ КАК Приоритет
	//|ИЗ
	//|	РегистрСведений.итПредельноеВремяСозданияЗаказов КАК итПредельноеВремяСозданияЗаказов
	//|ГДЕ
	//|	итПредельноеВремяСозданияЗаказов.ВидЗаказа = &ВидЗаказа
	//|	И (итПредельноеВремяСозданияЗаказов.Подразделение = &ПодразделениеКомпании
	//|			ИЛИ итПредельноеВремяСозданияЗаказов.Подразделение = &ПодразделениеКомпанииРодитель)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Приоритет";
	//
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если РезультатЗапроса.Пустой() Тогда
	//	Возврат ПредельноеВремя;
	//КонецЕсли;
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//Если Выборка.Следующий() Тогда
	//    ПредельноеВремя = Выборка.СекундПредельноеВремя;
	//КонецЕсли;
	
	//добавляем новый метод
	КонтрагентМПЗ = Справочники.Контрагенты.НайтиПоРеквизиту("ЕРПМастерКлюч","00000019376"); // скопировал из создания заказа
	Если ЗначениеЗаполнено(КонтрагентМПЗ) Тогда
		ПредельноеВремя = Документы.ЗаказПоставщику.КоличествоСекундОграниченияЗаписиЗаказаПоставщику(ТекущаяДата(), ВидЗаказаСсылка, КонтрагентМПЗ, ПодразделениеКомпании);
	КонецЕсли;
	//--
	
	Возврат ПредельноеВремя;

КонецФункции

Функция СоздатьЗадачуАктуализацииЦеников(СсылкаПодразделениеКомпании, Штрихкод)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстОшибки = "";
	
	//Определение подразделения
	ИдентификаторПК 		= Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
	ПодразделениеКомпании   = Справочники.ПодразделенияКомпании.ПолучитьСсылку(ИдентификаторПК);	
	Если Не ЗначениеЗаполнено(ПодразделениеКомпании) Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС+"Нет данных подразделения";
	КонецЕсли;
	
	//Определение пользователя
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ШтрихКод", ШтрихКодПользователя);
	//Запрос.Текст = "
	//|ВЫБРАТЬ
	//|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).Объект КАК Справочник.Пользователи) КАК Пользователь,
	//|	ВЫРАЗИТЬ(Штрихкоды.Объект КАК Справочник.Карточки).ПодразделениеКомпании КАК ПодразделениеКомпании
	//|ИЗ
	//|	РегистрСведений.Штрихкоды КАК Штрихкоды
	//|ГДЕ
	//|	Штрихкоды.Объект ССЫЛКА Справочник.Карточки И 
	//|	Штрихкоды.Штрихкод = &Штрихкод
	//|";
	//
	//Пользователь = Неопределено;
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Пользователь = Выборка.Пользователь;
	//	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
	//		ТекстОшибки = "По штрих-коду <"+ШтрихКодПользователя+"> не найден пользователь";
	//	КонецЕсли;
	//	Если НЕ ПодразделениеКомпании = Выборка.ПодразделениеКомпании Тогда
	//		ТекстОшибки = "Пользователь <"+Выборка.Пользователь+"> не принадлежит подразделению <"+СокрЛП(ПодразделениеКомпании)+">";
	//	КонецЕсли;
	//Иначе
	//	ТекстОшибки = "По штрих-коду <"+ШтрихКодПользователя+"> не найден пользователь";
	//КонецЕсли;
	
	//Определение номенклатуры
	Если ПустаяСтрока(ШтрихКод) Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС+"Штрих-код номенклатуры не заполнен";
	КонецЕсли;
		
	ТаблицаШтрихКодов = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(ШтрихКод);
	
	Номенклатура = Неопределено;

	Если ТаблицаШтрихКодов.Количество() = 0 Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул = &Артикул
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Код = &Артикул
		|";
	
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Артикул", ШтрихКод);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Номенклатура = Выборка.Ссылка;

		КонецЕсли;
	Иначе
		Номенклатура = ТаблицаШтрихКодов[0].Объект;
	КонецЕсли;

	Если Номенклатура = НЕОПРЕДЕЛЕНО Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС+"По штрих-коду/артикулу <"+ШтрихКод+"> не найдена номенклатура";	
	КонецЕсли;
	
	
	Если ПустаяСтрока(ТекстОшибки) Тогда
		СоздатьАктуализироватьЗадачуПечатиЦеников(ПодразделениеКомпании, Номенклатура);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат ТекстОшибки;
	
КонецФункции

Процедура СоздатьАктуализироватьЗадачуПечатиЦеников(ПодразделениеКомпании, Номенклатура)
	
	ДанныеЦен = ИТ_СпециальныйМодульСервер.ПолучитьДанныеТекущихЦен(Номенклатура, ПодразделениеКомпании);		
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итАктуализацияЭтикетокИЦеников.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.итАктуализацияЭтикетокИЦеников КАК итАктуализацияЭтикетокИЦеников
	|ГДЕ
	|	итАктуализацияЭтикетокИЦеников.ПодразделениеКомпании = &ПодразделениеКомпании
	|	И итАктуализацияЭтикетокИЦеников.Дата >= &НачалоТекДня
	|	И итАктуализацияЭтикетокИЦеников.СозданВТСД
	|	И итАктуализацияЭтикетокИЦеников.Завершен = ЛОЖЬ
	|	И итАктуализацияЭтикетокИЦеников.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("НачалоТекДня", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ДокументСсылка = НЕОПРЕДЕЛЕНО;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокументСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если ДокументСсылка = НЕОПРЕДЕЛЕНО Тогда
		Документ = Документы.итАктуализацияЭтикетокИЦеников.СоздатьДокумент();
		Документ.Дата 		= ТекущаяДата();
		Документ.СозданВТСД = Истина;
		Документ.Организация		   = ПодразделениеКомпании.Организация;
		Документ.ПодразделениеКомпании = ПодразделениеКомпании;
		Документ.Ответственный         = ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Документ = ДокументСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	СтрокиСНоменклатурой = Документ.Состав.Найти(Номенклатура, "Номенклатура");
	Если СтрокиСНоменклатурой = НЕОПРЕДЕЛЕНО Тогда
		НовСтр = Документ.Состав.Добавить();
		НовСтр.Номенклатура = Номенклатура;
		НовСтр.ЦенаТекущая  = ДанныеЦен.ЦенаТекущая;		
	    Документ.Записать();
	КонецЕсли;				
	
	
КонецПроцедуры

Функция ОбновитьДанныеСопоставленияЕГАИС(СсылкаПодразделениеКомпании)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстОшибки = ""; 
	ПодразделениеКомпании = НЕОПРЕДЕЛЕНО;
	Попытка
		ИдентификаторПК 		= Новый УникальныйИдентификатор(СсылкаПодразделениеКомпании);
		ПодразделениеКомпании   = Справочники.ПодразделенияКомпании.ПолучитьСсылку(ИдентификаторПК);
	Исключение
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ПодразделениеКомпании) Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС+"Нет данных подразделения";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итУстановкаСоответствияЕГАИССостав.НоменклатураЕГАИС КАК НоменклатураЕГАИС,
	|	ЕСТЬNULL(итУстановкаСоответствияЕГАИСМарки.КодМарки, """") КАК КодМарки
	|ПОМЕСТИТЬ втАлкоПлюсМарки
	|ИЗ
	|	Документ.итУстановкаСоответствияЕГАИС.Состав КАК итУстановкаСоответствияЕГАИССостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.итУстановкаСоответствияЕГАИС.Марки КАК итУстановкаСоответствияЕГАИСМарки
	|		ПО итУстановкаСоответствияЕГАИССостав.ИдентификаторСтроки = итУстановкаСоответствияЕГАИСМарки.ИдентификаторСтроки
	|ГДЕ
	|	итУстановкаСоответствияЕГАИССостав.Обработан = ЛОЖЬ
	|	И итУстановкаСоответствияЕГАИССостав.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И итУстановкаСоответствияЕГАИССостав.Ссылка.Завершен = ЛОЖЬ
	|	И итУстановкаСоответствияЕГАИССостав.Ссылка.ПодразделениеКомпании = &Подразделение
	|	И итУстановкаСоответствияЕГАИССостав.Ссылка.Дата >= &ДатаНачала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втАлкоПлюсМарки.НоменклатураЕГАИС КАК НоменклатураЕГАИС
	|ИЗ
	|	втАлкоПлюсМарки КАК втАлкоПлюсМарки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втАлкоПлюсМарки.НоменклатураЕГАИС КАК НоменклатураЕГАИС,
	|	втАлкоПлюсМарки.КодМарки КАК КодМарки
	|ИЗ
	|	втАлкоПлюсМарки КАК втАлкоПлюсМарки
	|ГДЕ
	|	втАлкоПлюсМарки.КодМарки <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	втАлкоПлюсМарки.НоменклатураЕГАИС,
	|	втАлкоПлюсМарки.КодМарки";
	
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ДатаНачала", ТекущаяДата() - 7*3600*24);
		
		
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	
	РезультатАлко   = ПакетыЗапросов[ПакетыЗапросов.Количество()-2];
	РезультатМарки  = ПакетыЗапросов[ПакетыЗапросов.Количество()-1];
	
	Если РезультатМарки.Пустой() Тогда
		Результат = СформироватьДанныеПередачи(Неопределено);
		Возврат Результат;
	КонецЕсли;
	
	ИмяВременногоФайлаОбмена = ПолучитьИмяВременногоФайла("xml");
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайлаОбмена);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Объект");
	
	ВыборкаП = РезультатАлко.Выбрать();
	Пока ВыборкаП.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("Состав"); // Товары
						
		ЗаписьXML.ЗаписатьНачалоЭлемента("АлкогольнаяПродукция"); // Номенклатура
		ЗаписьXML.ЗаписатьАтрибут("Тип", "АлкогольнаяПродукция");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаП.НоменклатураЕГАИС));
		ЗаписьXML.ЗаписатьАтрибут("Код", ВыборкаП.НоменклатураЕГАИС.Код);
		ЗаписьXML.ЗаписатьАтрибут("Наименование", ВыборкаП.НоменклатураЕГАИС.Наименование);
		ЗаписьXML.ЗаписатьАтрибут("НаименованиеПолное", ВыборкаП.НоменклатураЕГАИС.НаименованиеПолное);
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
	КонецЦикла;
	
	ВыборкаМарки = РезультатМарки.Выбрать();	
	Пока ВыборкаМарки.Следующий() Цикл
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Марки"); // ТоварнаяСтрока
		
		ЗаписьXML.ЗаписатьАтрибут("КодМарки", ВыборкаМарки.КодМарки);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("АлкогольнаяПродукция"); // Номенклатура
		ЗаписьXML.ЗаписатьАтрибут("Тип", "АлкогольнаяПродукция");
		ЗаписьXML.ЗаписатьАтрибут("Ссылка", СериализоватьСсылку(ВыборкаМарки.НоменклатураЕГАИС));
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Номенклатура
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // ТоварнаяСтрока
		
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Объект
	
	ЗаписьXML.Закрыть();
	
	ДанныеОбмена = Новый ДвоичныеДанные(ИмяВременногоФайлаОбмена);
	
	ОтветСтруктура = Новый Структура;
	ОтветСтруктура.Вставить("ДанныеОбмена", ДанныеОбмена);
	
	Результат = Новый ХранилищеЗначения(ОтветСтруктура, Новый СжатиеДанных(9));
	
	Возврат Результат;	

КонецФункции

Функция УстановитьСоответствиеЕГАИС(Штрихкод, СсылкаАлкогольнойПродукции)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстОшибки = "";
	
	Если ПустаяСтрока(ШтрихКод) Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС+"Штрих-код не заполнен";
	КонецЕсли;
		
	ТаблицаШтрихКодов = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(ШтрихКод);
	
	Номенклатура = НЕОПРЕДЕЛЕНО;
	ПоляНоменклатуры  = НЕОПРЕДЕЛЕНО;
	
	Если ТаблицаШтрихКодов.Количество() = 0 Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул = &Артикул
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Код = &Артикул
		|";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Артикул", ШтрихКод);
		
		Номенклатура = Неопределено;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Номенклатура = Выборка.Ссылка;

		КонецЕсли;
		
	Иначе	
		
		Номенклатура = ТаблицаШтрихКодов[0].Объект;	
			
		
	КонецЕсли;
	
	Если Номенклатура = НЕОПРЕДЕЛЕНО Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС+"По штрих-коду/артикулу <"+ШтрихКод+"> не найдена номенклатура";	
	КонецЕсли;
		
	ИдентификаторПК 		= Новый УникальныйИдентификатор(СсылкаАлкогольнойПродукции);
	АлкогольнаяПродукция    = Справочники.КлассификаторАлкогольнойПродукцииЕГАИС.ПолучитьСсылку(ИдентификаторПК);
	
	Если Не ЗначениеЗаполнено(АлкогольнаяПродукция) Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС+"Нет данных подразделения";
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстОшибки) Тогда
		//Нужно вставить в сервис, чтобы не давал установить неправильное соответствие	
		Если ЗначениеЗаполнено(Номенклатура.ВидАлкогольнойПродукции) и 
			НЕ Номенклатура.ВидАлкогольнойПродукции = АлкогольнаяПродукция.ВидПродукции Тогда
			ТекстОшибки = "Для Номенклатуры - " + Номенклатура.Наименование + " - <<Вид алкогольной продукции>> в номенклатуре не равен виду продукции в классификаторе продукции ЕГАИС, запись не возможна!";
		КонецЕсли;

		КонтролироватьКрепость = НЕ Номенклатура.ВидАлкогольнойПродукции.итОтключитьКонтрольКрепости;
	
		Если НЕ Номенклатура.Крепость = АлкогольнаяПродукция.Крепость И КонтролироватьКрепость ТОгда
			ТекстОшибки = "Для Номенклатуры - " + Номенклатура.Наименование + " - <<Крепость>> не совпадает с крепостью Алко. продукции ЕГАИС, запись не возможна!";
		КонецЕсли;	

		Если НЕ Номенклатура.Объем = АлкогольнаяПродукция.Объем ТОгда
			ТекстОшибки = "Для Номенклатуры - " + Номенклатура.Наименование + " - <<Объем>> не совпадает с объемом Алко. продукции ЕГАИС, запись не возможна!";		
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстОшибки) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	итУстановкаСоответствияЕГАИССостав.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.итУстановкаСоответствияЕГАИС.Состав КАК итУстановкаСоответствияЕГАИССостав
		|ГДЕ
		|	итУстановкаСоответствияЕГАИССостав.НоменклатураЕГАИС = &АлкогольнаяПродукция
		|	И итУстановкаСоответствияЕГАИССостав.Обработан = ЛОЖЬ
		|	И итУстановкаСоответствияЕГАИССостав.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И итУстановкаСоответствияЕГАИССостав.Ссылка.Завершен = Ложь";
		
		Запрос.УстановитьПараметр("АлкогольнаяПродукция", АлкогольнаяПродукция);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ТекстОшибки = "Не найдено задание на установку соответствия ЕГАИС";
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
				
			Док = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Для Каждого стр Из Док.Состав Цикл
				
				Если стр.НоменклатураЕГАИС = АлкогольнаяПродукция Тогда
					стр.Номенклатура = Номенклатура;
					стр.Обработан    = Истина;
				КонецЕсли;
				
			КонецЦикла;
			Попытка
				Док.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ТекстОшибки = "Не удалось установить соответствие ЕГАИС:" + ОписаниеОшибки();
			КонецПопытки;
		КонецЦикла;
			
	КонецЕсли;
	
	ДанныеСоответствия = Новый Структура;		
	ДанныеСоответствия.Вставить("ТекстОшибки",  		ТекстОшибки);
		
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Результат = Новый ХранилищеЗначения(ДанныеСоответствия, Новый СжатиеДанных(9));
	
	Возврат Результат;

КонецФункции


#КонецОбласти

