&НаСервере
// Установить наименование виртуального пользователя
//
Процедура УстановитьНаименование()
	
	// Определить пользователя
	ЕстьПользователь = ЗначениеЗаполнено(Объект.Пользователь);
	Есть = " от имени " + Объект.Пользователь;
	Нет = " с авторизацией ОС";
	Пользователь = ?(ЕстьПользователь, Есть, Нет);
	
	// Изменить наименование
	ТекущийОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.ТЦГруппаВП"));
	Имя = Строка(Объект.Роль) + " на " + Объект.Компьютер + Пользователь;
	ТекущийОбъект.Наименование = Имя;
	ЗначениеВДанныеФормы(ТекущийОбъект, Объект);
	
КонецПроцедуры // УстановитьНаименование()

&НаКлиенте
// Обработчик изменения виртуального пользователя
//
Процедура ПриИзменении(Элемент)
	
	Попытка
		ДатаНачала = ТекущаяДата();
		УстановитьНаименование();
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТЦОбщий.ЗаписатьВЖурнал(Ошибка);
		ТЦКлиент.СообщитьОбОшибке(Ошибка, ДатаНачала, ТекущаяДата());
	КонецПопытки;
	
КонецПроцедуры // ПриИзменении()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Попытка
		ДатаНачала = ТекущаяДата();
		ТолькоПросмотр = Не ЭтоНовый();
		Элементы.Роль.ТолькоПросмотр = ТолькоПросмотр;
		Элементы.Пользователь.ТолькоПросмотр = ТолькоПросмотр;
		Элементы.Клиент.ТолькоПросмотр = ТолькоПросмотр;
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТЦОбщий.ЗаписатьВЖурнал(Ошибка);
		ТЦКлиент.СообщитьОбОшибке(Ошибка, ДатаНачала, ТекущаяДата());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
// 
//
// Параметры:
//  
//
// Возвращаемое значение:
//  
//
Функция ЭтоНовый()
	
	Возврат РеквизитФормыВЗначение("Объект").ЭтоНовый();
	
КонецФункции // ЭтоНовый()