// Модуль менеджера обработки "Календарь пользователя"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Получение таблицы значимых событий
Процедура ПолучитьТаблицуРасписаний(Объект,ДеревоСобытий,ТекстДляПоиска) Экспорт
	
	Запрос = Новый Запрос;
	
	// Формирование текста запроса по отображаемым документам
	Если Объект.СписокОтображаемыхДокументов.Количество()=0 Тогда
		ЗаполнитьСписокОтображаемыхДокументовИзМакета(Объект);
	КонецЕсли;
	
	ТекстЗапросаПоОтображаемымДокументам = "";
	Для Каждого Документ Из Объект.СписокОтображаемыхДокументов Цикл
		
		// Пропустим напоминания
		Если Документ.Значение = "Напоминание" Тогда
			Продолжить;
		КонецЕсли;
		
		Документ = Документ.Значение;
		ТекстЗапросаПоОтображаемымДокументам = ТекстЗапросаПоОтображаемымДокументам + ПолучитьТекстЗапросаОбъединить(Объект,Документ,ТекстДляПоиска);
		
	КонецЦикла;
	
	УсловиеГде =  ?(ТекстДляПоиска="","И Напоминания.СрокНапоминания МЕЖДУ &ДатаНачала И &ДатаОкончания","И Напоминания.Описание ПОДОБНО &Описание");
	
	// Сформируем текст запроса по напоминаниям и объединим с запросом по документам
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(Напоминания.СрокНапоминания, ДЕНЬ) КАК ДатаСобытия,
	|	ИСТИНА КАК Напоминание,
	|	Напоминания.ВремяСобытия КАК НачалоСобытияДата,
	|	Напоминания.СрокНапоминания КАК НачалоСобытия,
	|	Напоминания.СрокНапоминания КАК ОкончаниеСобытия,
	|	""Напоминание"" КАК ВидДокумента,
	|	""Напоминание"" КАК Событие,
	|	Напоминания.Описание КАК Тема,
	|	Напоминания.Пользователь КАК Пользователь,
	|	Напоминания.Автор КАК Автор,
	|	Напоминания.Источник КАК Объект
	|ИЗ
	|	РегистрСведений.НапоминанияПользователя КАК Напоминания
	|ГДЕ
	|	Напоминания.Пользователь = &Пользователь
	|    " + УсловиеГде + ТекстЗапросаПоОтображаемымДокументам
	+ " УПОРЯДОЧИТЬ ПО
	|	ДатаСобытия,
	|	НачалоСобытия
	|ИТОГИ ПО
	|	НачалоСобытияДата";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Пользователь", Объект.ПользовательКалендаря);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Объект.ДатаКалендаря));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Объект.ДатаКалендаря));
	Запрос.УстановитьПараметр("Описание", "%" + ТекстДляПоиска + "%");
	
	// Выгружаем данные
	Корень = ДеревоСобытий.ПолучитьЭлементы();
	Корень.Очистить();
	Объект.РасписаниеСобытий.Очистить();
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		НоваяСтрокаПервыйУровень = Корень.Добавить();
		НоваяСтрокаПервыйУровень.НачалоСобытияДата = Выборка.НачалоСобытияДата;
		СтрокаПервогоУровня = НоваяСтрокаПервыйУровень.ПолучитьЭлементы();
		ДетальнаяВыборка = Выборка.Выбрать();
		
		Пока ДетальнаяВыборка.Следующий() Цикл
			
			НоваяСтрокаВторойУровень = СтрокаПервогоУровня.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаВторойУровень, ДетальнаяВыборка);
			
			НоваяСтрока = Объект.РасписаниеСобытий.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДетальнаяВыборка);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ПолучитьТаблицуРасписаний()

// Получить текст запроса объединить
Функция ПолучитьТекстЗапросаОбъединить(Объект, Документ, ТекстДляПоиска)
	
	// Документ будет выведен, если этому не помешают настройки принадлежности пользователю.
	ВыводитьДокумент = Истина;
	
	Если Документ = "Событие" Тогда 
		ПолеНачалоСобытия = Документ+".ДатаНачала";
		ПолеОкончаниеСобытия = Документ+".ДатаОкончания"; 
	Иначе
		ПолеНачалоСобытия = Документ+".Дата";
		ПолеОкончаниеСобытия = Документ+".Дата";
	КонецЕсли;
	
	// у событий есть тема, у других документов ее нет
	Если Документ = "Событие" ИЛИ Документ = "Рассылка" ИЛИ Документ = "СообщениеSMS"  ИЛИ Документ = "ЭлектронноеПисьмоВходящее" ИЛИ Документ = "ЭлектронноеПисьмоИсходящее" Тогда
		ПолеТема = Документ+".Тема";
		УсловиеГде =  ?(ТекстДляПоиска="",Документ + ".Дата МЕЖДУ &ДатаНачала И &ДатаОкончания",ПолеТема + " ПОДОБНО &Описание");
	Иначе
		ПолеТема = Документ+".Представление";
		УсловиеГде =  ?(ТекстДляПоиска="",Документ + ".Дата МЕЖДУ &ДатаНачала И &ДатаОкончания",""""+Документ+""" ПОДОБНО &Описание");
	КонецЕсли;
	
	ТекстЗапросаГдеДляДокумента = "Где " + Документ +".ПометкаУдаления = ЛОЖЬ И " + УсловиеГде;
	
	// собираем текст запроса по документам
	Если ВыводитьДокумент Тогда
		ТекстЗапросаПоОтображаемымДокументам = " 
		|ОБЪЕДИНИТЬ ВСЕ 
		|	ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА("+СтрЗаменить(Документ,".","")+".Дата, ДЕНЬ),
		|	ЛОЖЬ,
		|	НАЧАЛОПЕРИОДА("+ПолеНачалоСобытия+", ДЕНЬ),
		|	"+ПолеНачалоСобытия+",
		|	"+ПолеОкончаниеСобытия+",
		|	"""+Документ + """,
		|	"+Документ+".Ссылка,
		|	"+ПолеТема+",
		|	NULL,
		|	"+Документ+".Автор,
		|	NULL
		|ИЗ
		|	Документ."+Документ+" КАК "+Документ+" " + ТекстЗапросаГдеДляДокумента +  "";
	КонецЕсли;
	
	Возврат ТекстЗапросаПоОтображаемымДокументам;
	
КонецФункции // ПолучитьТекстЗапросаОбъединить()

// Заполнение списка отображаемых документов из макета
Процедура ЗаполнитьСписокОтображаемыхДокументовИзМакета(Объект)
	
	Объект.СписокОтображаемыхДокументов.Очистить();
	МакетДокументов = ПолучитьМакет("МакетДокументов");
	ОбластьДокументовПросмотра = МакетДокументов.ПолучитьОбласть("ДокументыПросмотр");
	Для ПеременнаяЦикла = 1 По ОбластьДокументовПросмотра.ВысотаТаблицы Цикл
		ИмяДокумента = ОбластьДокументовПросмотра.Область(ПеременнаяЦикла, 1).Текст;
		ПредставлениеДокумента = ОбластьДокументовПросмотра.Область(ПеременнаяЦикла, 2).Текст;
		Если ИмяДокумента <> "" Тогда 
			Если Объект.СписокОтображаемыхДокументов.НайтиПоЗначению(ИмяДокумента) = Неопределено Тогда
				Объект.СписокОтображаемыхДокументов.Добавить(ИмяДокумента,ПредставлениеДокумента);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьСписокОтображаемыхДокументовИзМакета()

#КонецЕсли