
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Загружает данные с сервера ВЕТИС
&НаСервере
Процедура ЗапроситьНазначения()
	
	СписокЗагрузки.Очистить();
	
	Если НЕ ЗначениеЗаполнено(ХозяйствующийСубъект) Тогда
		ВывестиСообщение(НСтр("ru='Не заполнен Хозяйствующий субъект'"));
		Возврат;
	КонецЕсли;
	
	СкрытьЗагруженные = Элементы.СписокЗагрузкиСкрытьЗагруженные.Пометка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НазначенияГрузаВЕТИС.Ссылка,
	|	НазначенияГрузаВЕТИС.ИдентификаторЗаписи
	|ИЗ
	|	Справочник.НазначенияГрузаВЕТИС КАК НазначенияГрузаВЕТИС
	|ГДЕ
	|	НазначенияГрузаВЕТИС.Код = &guid
	|";
	
	Смещение = 0;
	Шаг      = 500;
	Пока Шаг>0 Цикл
		
		Результат = ИнтеграцияВЕТИС.ЗапросНаПолучениеЦелей(ХозяйствующийСубъект, Смещение, Шаг);
		
		Если Результат = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ПроцентИнкремент = 500 / Результат.total;
		Для Каждого ТекущаяЗапись Из Результат.purpose Цикл
			
			Запрос.УстановитьПараметр("guid", ТекущаяЗапись.guid);
			
			НазначенияГрузаСсылка = Неопределено;
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				НазначенияГрузаСсылка = Выборка.Ссылка;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НазначенияГрузаСсылка) Тогда
				ИдентификаторЗаписи = Выборка.ИдентификаторЗаписи;
				Если СкрытьЗагруженные И ИдентификаторЗаписи = ТекущаяЗапись.uuid Тогда
					Продолжить;
				КонецЕсли;
			Иначе
				ИдентификаторЗаписи = "";
			КонецЕсли;
			
			НоваяСтрока = СписокЗагрузки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяЗапись);
			
			НоваяСтрока.Ссылка = НазначенияГрузаСсылка;
			НоваяСтрока.ИдентификаторЗаписи = ИдентификаторЗаписи;
			НоваяСтрока.Пометка   = Ложь;
			
		КонецЦикла;
		
		Смещение = Смещение + Шаг;
		Шаг      = Мин(500, Результат.total-Смещение);
		
	КонецЦикла;
	
КонецПроцедуры //ЗапроситьНазначения()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события возникающего при выполнении команды "Загрузить назначения" в контексте сервера.
//
&НаСервере
Процедура ЗагрузитьНазначенияНаСервере()
	
	НастройкаПодключения = ИнтеграцияВЕТИС.ПолучитьНастройкуПодключения(ХозяйствующийСубъект);
	
	Для Каждого ТекущаяСтрока Из СписокЗагрузки Цикл
		
		Если НЕ ТекущаяСтрока.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Если (Не ЗначениеЗаполнено(ТекущаяСтрока.Ссылка)) ИЛИ 
			(НЕ ТекущаяСтрока.ИдентификаторЗаписи = ТекущаяСтрока.uuid) Тогда
			ТекущаяСтрока.Ссылка = ИнтеграцияВЕТИС.ЗагрузитьНазначениеГруза(НастройкаПодключения,, ТекущаяСтрока);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ЗагрузитьНазначенияНаСервере()

// Обработчик события возникающего на клиенте при выполнении команды "Загрузить назначения".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура ЗагрузитьНазначения(Команда)
	
	ЗагрузитьНазначенияНаСервере();
	ОповеститьОбИзменении(Тип("СправочникСсылка.НазначенияГрузаВЕТИС"));
	Закрыть();
	
КонецПроцедуры // ЗагрузитьНазначения()

// Обработчик события возникающего на клиенте при выполнении команды "Скрыть загруженные".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура СкрытьЗагруженные(Команда)
	
	Элементы.СписокЗагрузкиСкрытьЗагруженные.Пометка = НЕ Элементы.СписокЗагрузкиСкрытьЗагруженные.Пометка;
	ЗапроситьНазначения();
	
КонецПроцедуры // СкрытьЗагруженные()

// Обработчик события возникающего на клиенте при выполнении команды "Установить/Снять все".
//
// Параметры:
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//
&НаКлиенте
Процедура УстановитьСнятьВсе(Команда)
	
	Для каждого ТекСтрока Из СписокЗагрузки Цикл
		ТекСтрока.Пометка = СтрНайти(Команда.Имя, "Установить") > 0;
	КонецЦикла;
	
КонецПроцедуры // УстановитьСнятьВсе()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ


// Обработчик события возникающего на клиенте при изменении данных реквизита "Транспортный модуль".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТранспортныйМодульПриИзменении(Элемент)
	
	ЗапроситьНазначения();
	
КонецПроцедуры // ТранспортныйМодульПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НачальноеЗначениеВыбора") Тогда
		ХозяйствующийСубъект = Параметры.НачальноеЗначениеВыбора.ХозяйствующийСубъект;
	КонецЕсли;
	
	ЗапроситьНазначения();

КонецПроцедуры // ПриСозданииНаСервере()

