// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  МаркерыАвторизации - Массив из Структура:
//  * ИдентификаторУчетнойЗаписиЭДО - Строка
//  * ОтпечатокСертификата - Строка
//  * Данные - Строка - двоичные данные в формате base64.
// 
// Возвращаемое значение:
//  См. СинхронизацияЭДОКлиентСервер.НовыеКлючиСинхронизации
Функция КлючиСинхронизацииИзМаркеровАвторизации(МаркерыАвторизации) Экспорт
	
	КлючиСинхронизации = СинхронизацияЭДОКлиентСервер.НовыеКлючиСинхронизации();
	
	Если Не ЗначениеЗаполнено(МаркерыАвторизации) Тогда
		Возврат КлючиСинхронизации;
	КонецЕсли;
	
	ИдентификаторыЭДО = ОбщегоНазначения.ВыгрузитьКолонку(МаркерыАвторизации, "ИдентификаторУчетнойЗаписиЭДО");
	СпособыОбменаУчетныхЗаписей = УчетныеЗаписиЭДО.СпособыОбменаУчетныхЗаписей(ИдентификаторыЭДО);
	
	Для Каждого МаркерАвторизации Из МаркерыАвторизации Цикл
		КлючСинхронизации = КлючСинхронизацииИзМаркераАвторизации(МаркерАвторизации, СпособыОбменаУчетныхЗаписей);
		КлючиСинхронизации.Вставить(МаркерАвторизации.ИдентификаторУчетнойЗаписиЭДО, КлючСинхронизации);
	КонецЦикла;
	
	Возврат КлючиСинхронизации;
	
КонецФункции

// Параметры:
//  МаркерАвторизации - Структура:
//  * ИдентификаторУчетнойЗаписиЭДО - Строка
//  * ОтпечатокСертификата - Строка
//  * Данные - Строка - двоичные данные в формате base64.
//  СпособыОбменаУчетныхЗаписей - Неопределено
//                              - см. УчетныеЗаписиЭДО.СпособыОбменаУчетныхЗаписей
// 
// Возвращаемое значение:
//  См. СинхронизацияЭДОКлиентСервер.НовыйКлючСинхронизации
Функция КлючСинхронизацииИзМаркераАвторизации(МаркерАвторизации, СпособыОбменаУчетныхЗаписей = Неопределено) Экспорт
	
	Если СпособыОбменаУчетныхЗаписей = Неопределено Тогда
		ИдентификаторыЭДО = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(МаркерАвторизации.ИдентификаторУчетнойЗаписиЭДО);
		СпособыОбменаУчетныхЗаписей = УчетныеЗаписиЭДО.СпособыОбменаУчетныхЗаписей(ИдентификаторыЭДО);
	КонецЕсли;
	
	КлючСинхронизации = СинхронизацияЭДОКлиентСервер.НовыйКлючСинхронизации();
	КлючСинхронизации.ИдентификаторУчетнойЗаписи = МаркерАвторизации.ИдентификаторУчетнойЗаписиЭДО;
	КлючСинхронизации.СпособОбмена = СпособыОбменаУчетныхЗаписей[МаркерАвторизации.ИдентификаторУчетнойЗаписиЭДО];
	Сертификат = ЭлектроннаяПодпись.СсылкаНаСертификат(МаркерАвторизации.ОтпечатокСертификата);
	КлючСинхронизации.ВыбранныйСертификат = Сертификат;
	КлючСинхронизации.МаркерРасшифрованный = Base64Значение(МаркерАвторизации.Данные);
	
	Возврат КлючСинхронизации;
	
КонецФункции

#КонецОбласти
