#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьЗначениеВЕТИС(СпособХранения) Экспорт
	
	ИндексЗначения = Перечисления.СпособыХраненияВЕТИС.Индекс(СпособХранения);
	
	Результат = Метаданные.Перечисления.СпособыХраненияВЕТИС.ЗначенияПеречисления[ИндексЗначения].Имя;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначение(СпособХранения) Экспорт
	
	Результат = Неопределено;
	
	ЗначениеПеречисления = Метаданные.Перечисления.СпособыХраненияВЕТИС.ЗначенияПеречисления.Найти(СпособХранения);
	Если Не ЗначениеПеречисления = Неопределено Тогда
		ИндексЗначения = Метаданные.Перечисления.СпособыХраненияВЕТИС.ЗначенияПеречисления.Индекс(ЗначениеПеречисления);
		Результат = Перечисления.СпособыХраненияВЕТИС[ИндексЗначения];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли