
// Определяет необходимость показа рабочего места кассира
// РМК показывается в случае наличия профиля РабочееМестоКассира у пользователя
Процедура ПараметрыРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
#Если ВнешнееСоединение Тогда
	Параметры.Вставить(
		"ЕстьПрофильОператораТСД",
		Ложь);
#Иначе
	Параметры.Вставить(
		"ЕстьПрофильОператораТСД",
		ПараметрыСеанса.ТекущийПользователь.ИнтерфейсТСД);
	//Параметры.Вставить(
	//	"ЕстьПрофильРМК",
	//	УправлениеНебольшойФирмойУправлениеДоступомПовтИсп.ЕстьПрофильРабочееМестоКассира());
#КонецЕсли
	
КонецПроцедуры

// Процедура заполнения новых ресурсов по уже проведенным документам.
//
Процедура ВыполнитьЗаполнениеСуммыРегл() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоходыИРасходы.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрНакопления.ДоходыИРасходы КАК ДоходыИРасходы
	               |ИТОГИ ПО
	               |	Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НаличныеРасчеты.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрНакопления.НаличныеРасчеты КАК НаличныеРасчеты
	               |ИТОГИ ПО
	               |	Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КассыККМ.Регистратор КАК Регистратор,
	               |	""КассыККМ"" КАК ИмяРегистра
	               |ИЗ
	               |	РегистрНакопления.КассыККМ КАК КассыККМ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДенежныеСредстваКомпании.Регистратор,
	               |	""ДенежныеСредстваКомпании""
	               |ИЗ
	               |	РегистрНакопления.ДенежныеСредстваКомпании КАК ДенежныеСредстваКомпании
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗаказыПокупателей.Регистратор,
	               |	""ЗаказыПокупателей""
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗаказыПоставщикам.Регистратор,
	               |	""ЗаказыПоставщикам""
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПоставщикам КАК ЗаказыПоставщикам
	               |ИТОГИ ПО
	               |	Регистратор,
	               |	ИмяРегистра
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗакупкиПоЗаказам.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрНакопления.ЗакупкиПоЗаказам КАК ЗакупкиПоЗаказам
	               |ИТОГИ ПО
	               |	Регистратор";
	РезультатПакета = Запрос.ВыполнитьПакет();
	ДоходыИРасходы = РезультатПакета[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ДоходыИРасходы.Следующий() Цикл
		НаборЗаписей = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДоходыИРасходы.Регистратор);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Коэффициент = ПланированиеСервер.ПолучитьКоэффициентПересчетаВалют(Запись.Период);
			Запись.ДоходРег =  Запись.ДоходУпр * Коэффициент;
			Запись.РасходРег =  Запись.РасходУпр * Коэффициент;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;
	
	НаличныеРасчеты = РезультатПакета[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока НаличныеРасчеты.Следующий() Цикл
		НаборЗаписей = РегистрыНакопления.НаличныеРасчеты.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(НаличныеРасчеты.Регистратор);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			
			ВалютаДоговора	= Запись.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
			СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДоговора, Запись.Период);
			КурсДоговора = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
			
			ВалютаБаз      = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаБаз, Запись.Период);
			КурсБаз        = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
			Запись.СуммаРег = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(Запись.Сумма,ВалютаДоговора,КурсДоговора,ВалютаБаз,КурсБаз,РежимОкругления.Окр15как20);
			
		КонецЦикла;
		НаборЗаписей.Записать();	
	КонецЦикла;
	
	Выборка = РезультатПакета[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		ВыборкаДетально = Выборка.Выбрать();
		ВыборкаДетально.Следующий();
		НаборЗаписей = РегистрыНакопления[ВыборкаДетально.ИмяРегистра].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетально.Регистратор);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Коэффициент = ПланированиеСервер.ПолучитьКоэффициентПересчетаВалют(Запись.Период);
			Запись.СуммаРег =  Запись.СуммаУпр * Коэффициент;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;

	ЗакупкиПоЗаказам = РезультатПакета[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ЗакупкиПоЗаказам.Следующий() Цикл
		НаборЗаписей = РегистрыНакопления.ЗакупкиПоЗаказам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЗакупкиПоЗаказам.Регистратор);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			
			// Найдем коэффициент пересчета из управленческой валюты в валюту регл.учета		
			Коэффициент = ПланированиеСервер.ПолучитьКоэффициентПересчетаВалют(Запись.Период);
			Запись.СуммаРег =  Запись.СуммаУпр * Коэффициент;
			Запись.СуммаЗаказаРег =  Запись.СуммаЗаказаУпр * Коэффициент;
			Запись.НедопоставленоСуммаРег =  Запись.НедопоставленоСуммаУпр * Коэффициент;
			Запись.ПерепоставленоСуммаРег =  Запись.ПерепоставленоСуммаУпр * Коэффициент;
			Запись.ПовышениеСтоимостиРег =  Запись.ПовышениеСтоимостиУпр * Коэффициент;
			Запись.ПонижениеСтоимостиРег =  Запись.ПонижениеСтоимостиУпр * Коэффициент;
			
		КонецЦикла;
		НаборЗаписей.Записать();	
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьЗаполнениеСуммыРегл()

Процедура ВыполнитьЗаполнениеСпособаПолученияЦены() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДокИнвентаризация.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Инвентаризация КАК ДокИнвентаризация
	|ГДЕ
	|	ДокИнвентаризация.СпособПолученияЦены = ЗНАЧЕНИЕ(Перечисление.СпособыПолученияЗакупочнойЦены.ПустаяСсылка)
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если ДокументОбъект.РежимПолученияЦеныПоСебестоимости = Истина Тогда
			ДокументОбъект.СпособПолученияЦены = Перечисления.СпособыПолученияЗакупочнойЦены.ПоСебестоимости;
		Иначе
			ДокументОбъект.СпособПолученияЦены = Перечисления.СпособыПолученияЗакупочнойЦены.ПоТипуЦен;
		КонецЕсли;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект, Ложь, Ложь);
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьЗаполнениеСпособаПолученияЦены()

Процедура ВыравниваниеОстатков() Экспорт
	
	//Инвентаризация = Документы.Инвентаризация.СоздатьДокумент();
	//Инвентаризация.Заполнить(Неопределено);
	//Инвентаризация.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваровВыравниваниеОстатков;
	
КонецПроцедуры

////записывает двоичные данные в реквизит ДополнительныеДанные
//Процедура ЗаписатьДополнительныеДанные(Объект, ДвоичныеДанные, Наименование="", ТипДанных="") Экспорт
//	
//	СтруктураДанных = Новый Структура("ДвоичныеДанные,Наименование,ТипДанных");
//	СтруктураДанных.Наименование	= Наименование;
//	СтруктураДанных.ТипДанных		= ТипДанных;
//	СтруктураДанных.ДвоичныеДанные	= ДвоичныеДанные;
//	
//	Объект.ДополнительныеДанные = Новый ХранилищеЗначения(СтруктураДанных, Новый СжатиеДанных(9))
//	
//КонецПроцедуры //ЗаписатьДополнительныеДанные()

////возвращает двоичные данные из реквизита ДополнительныеДанные
//Функция ПрочитатьДополнительныеДанные(Объект, Наименование="", ТипДанных="") Экспорт
//	
//	СтруктураДанных = Объект.ДополнительныеДанные.Получить();
//	
//	Если ТипЗнч(СтруктураДанных)=Тип("Структура") Тогда
//		ДвоичныеДанные = Неопределено;
//		СтруктураДанных.Свойство("ДвоичныеДанные", ДвоичныеДанные);
//		СтруктураДанных.Свойство("Наименование", Наименование);
//		СтруктураДанных.Свойство("ТипДанных", ТипДанных);
//		
//		Возврат ДвоичныеДанные;
//	Иначе
//		Возврат Неопределено;
//	КонецЕсли;
//	
//КонецФункции //ПрочитатьДополнительныеДанные()