// Модуль формы списка регистра "Складской журнал ВетИС"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьДеревоПодразделений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ХозяйствующиеСубъектыВЕТИС.Ссылка КАК ХозяйствующийСубъект,
	|	ПредприятияХозСубъекта.Предприятие
	|ИЗ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС КАК ХозяйствующиеСубъектыВЕТИС
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС.Предприятия КАК ПредприятияХозСубъекта
	|ПО
	|	ХозяйствующиеСубъектыВЕТИС.Ссылка = ПредприятияХозСубъекта.Ссылка
	|ГДЕ
	|	ХозяйствующиеСубъектыВЕТИС.Собственный И 
	|	ХозяйствующиеСубъектыВЕТИС.ПометкаУдаления = ЛОЖЬ
	|ИТОГИ ПО
	|	ХозяйствующийСубъект
	|";
	
	СтрокиХозСубъектов = ДеревоПредприятий.ПолучитьЭлементы();
	ВыборкаХозСубъект = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаХозСубъект.Следующий() Цикл
		СтрокаХозСубъект = СтрокиХозСубъектов.Добавить();
		СтрокаХозСубъект.Предприятие = ВыборкаХозСубъект.ХозяйствующийСубъект;
		СтрокаХозСубъект.КартинкаПредприятия = 0;
		СтрокиПредприятий = СтрокаХозСубъект.ПолучитьЭлементы();
		Выборка = ВыборкаХозСубъект.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаПредприятия = СтрокиПредприятий.Добавить();
			СтрокаПредприятия.Предприятие = Выборка.Предприятие;
			СтрокаПредприятия.КартинкаПредприятия = 1;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Элементы.Список.ТекущиеДанные, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеСпискомРегистраКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеСпискомРегистраКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДИНАМИЧЕСКОГО СПИСКА ФОРМЫ

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии Enter) в ячейке таблицы "Список".
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока      - Ссылка       - Значение выбранной строки.
//  Поле                 - ПолеФормы    - Активное поле.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраКлиент.СписокВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры // СписокВыбор()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при активизации строки списка выполняемый с задержкой.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_СписокПриАктивизацииСтроки()
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элементы.Список, ИСТИНА);
	
КонецПроцедуры // Подключаемый_СписокПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраКлиент.СписокПриАктивизацииЯчейки(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриАктивизацииЯчейки()

// Обработчик события возникающего на клиенте перед добавления строки в таблицу "Список".
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от действия.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраКлиент.СписокПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры // СписокПередНачаломДобавления

// Обработчик события возникающего на клиенте перед началом изменения списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от действия.
//
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраКлиент.СписокПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // СписокПередНачаломИзменения()

// Обработчик события возникающего на клиенте после удаления строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраКлиент.СписокПослеУдаления(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПослеУдаления()

// Обработчик события возникающего при сохранении пользовательских настроек в контексте сервера.
// 
// Параметры:
//  Элемент   - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Сохраняемые настройки. 
//
&НаСервере
Процедура СписокПриСохраненииПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраСервер.СписокПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // СписокПриСохраненииПользовательскихНастроекНаСервере()

// Обработчик события возникающего при восстановлении пользовательских настроек в контексте сервера.
// 
// Параметры:
//  Элемент   - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Восстанавливаемые настройки. 
//
&НаСервере
Процедура СписокПриЗагрузкеПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраСервер.СписокПриЗагрузкеПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // СписокПриЗагрузкеПользовательскихНастроекНаСервере()

// Обработчик события возникающего на сервере при обновлении пользовательских настроек списка.
//
// Параметры:
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраСервер.СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры // СписокПриОбновленииСоставаПользовательскихНастроекНаСервере()

// Обработчик события вызывается на сервере после получения данных динамическим списком.
//
// Параметры:
//  ИмяЭлемента - Строка - Содержит имя таблицы формы, из которой вызван обработчик события.
//  Настройки   - НастройкиКомпоновкиДанных - Содержит копию полных настроек динамического списка.
//  Строки      - СтрокиДинамическогоСписка - Данные и оформление всех строк, получаемых в списке.
//
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраСервер.СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры // СписокПриПолученииДанныхНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДеревоПодразделений();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеСпискомРегистраКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на клиенте при вызове метода ОповеститьОбАктивизации из формы-владельца.
//
// Параметры:
//  АктивныйОбъект - Произвольный     - Активный объект.
//  Источник       - УправляемаяФорма - Форма, источник сообщения.
//
&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраКлиент.ОбработкаАктивизации(ЭтотОбъект, АктивныйОбъект, Источник) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаАктивизации()

// Обработчик события возникающего на клиенте при записи объекта в одной из подчиненных форм.
//
// Параметры:
//  НовыйОбъект          - Произвольный     - Добавленный в подчиненной форме объект.
//  Источник             - УправляемаяФорма - Форма, источник сообщения.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомРегистраКлиент.ОбработкаЗаписиНового(ЭтотОбъект, НовыйОбъект, Источник, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаписиНового()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомРегистраСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура ТаблицаУпаковкиПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ТаблицаУпаковки.ТекущиеДанные = Неопределено Тогда
		Элементы.ТаблицаМаркировка.ОтборСтрок = Неопределено;
		Возврат;
	КонецЕсли;
	
	ОтборСтрок = Новый Структура("ИдентификаторСтроки", Элементы.ТаблицаУпаковки.ТекущиеДанные.ИдентификаторСтроки);
	
	Элементы.ТаблицаМаркировка.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьGuidПредприятия(Предприятие)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Предприятие, "Код");
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыЗапроса(Результат, ДополнительныеРеквизиты) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьСкладскиеЗапасы(Команда)
	
	ТекущиеДанные = Элементы.ДеревоПредприятий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Предприятие) = Тип("СправочникСсылка.ХозяйствующиеСубъектыВЕТИС") Тогда
		//ХозяйствующийСубъект = ТекущиеДанные.Предприятие;
		Возврат;
	КонецЕсли;
	
	ХозяйствующийСубъект  = ТекущиеДанные.ПолучитьРодителя().Предприятие;
	Предприятие = ТекущиеДанные.Предприятие;
	
	//ДанныеДляВыгрузки = Новый Массив;
	
	//Для Каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
	guidПредприятия = ПолучитьGuidПредприятия(Предприятие);
	
	СтрокаВыгрузки = Новый Структура;
	//СтрокаВыгрузки.Вставить("uuid",            ТекущаяСтрока.Идентификатор);
	СтрокаВыгрузки.Вставить("ХозяйствующийСубъект",   ХозяйствующийСубъект);
	СтрокаВыгрузки.Вставить("Предприятие",            Предприятие);
	СтрокаВыгрузки.Вставить("guidПредприятия",        guidПредприятия);
	//СтрокаВыгрузки.Вставить("КоличествоЭлементов",    ПараметрыОбмена.РазмерПорции);
	
	//ДанныеДляВыгрузки.Добавить(СтрокаВыгрузки);
	
	//КонецЦикла;
	
	ОповещениеЗакрытияФормыЗапроса = Новый ОписаниеОповещения("ПриЗакрытииФормыЗапроса", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДанныеДляВыгрузки",    СтрокаВыгрузки);
	ПараметрыОткрытия.Вставить("ВидОперации",          ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ЗапросЗаписейСкладскогоЖурнала"));
	ПараметрыОткрытия.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
	ПараметрыОткрытия.Вставить("Предприятие",          Предприятие);
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ФормированиеЗапроса", ПараметрыОткрытия, ЭтотОбъект,,,, ОповещениеЗакрытияФормыЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияДеревоПредприятийПриАктивизацииСтроки()
	
	ТекущиеДанные = Элементы.ДеревоПредприятий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Предприятие");
	ОтборПредприятие = Неопределено;
	Для Каждого ТекущийОтбор Из Список.Отбор.Элементы Цикл
		Если ТекущийОтбор.ЛевоеЗначение = ЛевоеЗначение Тогда
			ОтборПредприятие = ТекущийОтбор;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ОтборПредприятие = Неопределено Тогда
		ОтборПредприятие = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПредприятие.ЛевоеЗначение = ЛевоеЗначение;
	КонецЕсли;
	
	ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ХозяйствующийСубъект");
	ОтборХозСубъект = Неопределено;
	Для Каждого ТекущийОтбор Из Список.Отбор.Элементы Цикл
		Если ТекущийОтбор.ЛевоеЗначение = ЛевоеЗначение Тогда
			ОтборХозСубъект = ТекущийОтбор;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ОтборХозСубъект = Неопределено Тогда
		ОтборХозСубъект = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборХозСубъект.ЛевоеЗначение = ЛевоеЗначение;
	КонецЕсли;
	
	ОтборПредприятие.Использование = Ложь;
	ОтборХозСубъект.Использование  = Ложь;
	
	Если ТипЗнч(ТекущиеДанные.Предприятие) = Тип("СправочникСсылка.ПредприятияВЕТИС") Тогда
		ОтборПредприятие.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборПредприятие.ПравоеЗначение = ТекущиеДанные.Предприятие;
		ОтборПредприятие.Использование  = Истина;
		
		Элементы.ФормаЗапроситьСкладскиеЗапасы.Доступность = Истина;
		
	Иначе
		ОтборХозСубъект.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборХозСубъект.ПравоеЗначение = ТекущиеДанные.Предприятие;
		ОтборХозСубъект.Использование  = Истина;
		
		Элементы.ФормаЗапроситьСкладскиеЗапасы.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПредприятийПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияДеревоПредприятийПриАктивизацииСтроки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьИзмененныеСкладскиеЗапасы(Команда)
	
	ТекущиеДанные = Элементы.ДеревоПредприятий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ВывестиСообщение(НСтр("ru = 'Выберите предпритие хоз. субъекта!'"));
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Предприятие) = Тип("СправочникСсылка.ХозяйствующиеСубъектыВЕТИС") Тогда
		ВывестиСообщение(НСтр("ru = 'Выберите предпритие хоз. субъекта!'"));
		Возврат;
	КонецЕсли;
	
	ХозяйствующийСубъект  = ТекущиеДанные.ПолучитьРодителя().Предприятие;
	Предприятие = ТекущиеДанные.Предприятие;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДатаНачала",           НачалоДня(ТекущаяДата()));
	ПараметрыОткрытия.Вставить("ДатаОкончания",        ТекущаяДата());
	ПараметрыОткрытия.Вставить("ПолучатьИзменения",    Истина);
	ПараметрыОткрытия.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
	ПараметрыОткрытия.Вставить("Предприятие",          Предприятие);
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ФормаПолученияСкладскихЗаписей", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Перезапросить(Команда)
	
	ТекущиеДанные = Элементы.ДеревоПредприятий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Предприятие) = Тип("СправочникСсылка.ХозяйствующиеСубъектыВЕТИС") Тогда
		ХозяйствующийСубъект = ТекущиеДанные.Предприятие;
	Иначе
		ХозяйствующийСубъект = ТекущиеДанные.ПолучитьРодителя().Предприятие;
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый СписокЗначений;
	
	Для Каждого ТекущаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		
		ТекущаяЗапись = Элементы.Список.ДанныеСтроки(ТекущаяСтрока);
		
		Предприятие = ТекущаяЗапись.Предприятие;
		
		guidПредприятия = ПолучитьGuidПредприятия(Предприятие);
		
		СтрокаВыгрузки = Новый Структура;
		СтрокаВыгрузки.Вставить("ИдентификаторПартии", ТекущаяЗапись.Идентификатор);
		СтрокаВыгрузки.Вставить("guidПредприятия",     guidПредприятия);
		СтрокаВыгрузки.Вставить("Предприятие",         Предприятие);
		СтрокаВыгрузки.Вставить("Перезаполнить",       Истина);
		
		ДанныеДляВыгрузки.Добавить(СтрокаВыгрузки);
		
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДанныеДляВыгрузки",    ДанныеДляВыгрузки);
	ПараметрыОткрытия.Вставить("ХозяйствующийСубъект", ХозяйствующийСубъект);
	ПараметрыОткрытия.Вставить("ВидОперации",          ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ЗапросЗаписиСкладскогоЖурнала"));
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.ФормированиеЗапроса", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

