
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ЗавершитьРаботуСистемы(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимВозврат(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ВидДокумента", "ВозвратПоставщику");
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТСД.Форма.ВыборДокумента", ПараметрыОткрытияФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимИнвентаризация(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ВидДокумента", "Инвентаризация");
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТСД.Форма.ВыборДокумента", ПараметрыОткрытияФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПеремещение(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ВидДокумента", "ПеремещениеТоваров");
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТСД.Форма.ВыборДокумента", ПараметрыОткрытияФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПоступление(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ВидДокумента", "ПоступлениеТоваров");
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТСД.Форма.ВыборДокумента", ПараметрыОткрытияФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимСписание(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ВидДокумента", "СписаниеТоваров");
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТСД.Форма.ВыборДокумента", ПараметрыОткрытияФормы);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстСообщения     = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ТекстСообщения", "");
	ДокументЗаполнения = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДокументЗаполнения", Неопределено);
	Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

