
&НаСервере
Процедура ЗаписатьНормыСписанияНаСервере(Группа)
	
	ОбНормы = РеквизитФормыВЗначение("итНормыСписания", Тип("РегистрСведенийНаборЗаписей.итНормыСписания"));
	Для Каждого стрНабора Из ОбНормы Цикл
		стрНабора.Группа = Группа.Ссылка;	
	КонецЦикла;	
	ОбНормы.Записать();	
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНормыСписанияНаСервере()
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ОбНормы = РеквизитФормыВЗначение("итНормыСписания", Тип("РегистрСведенийНаборЗаписей.итНормыСписания"));
		ОбНормы.Отбор.Группа.Установить(Объект.Ссылка);	
		ОбНормы.Прочитать();
		ЗначениеВРеквизитФормы(ОбНормы, "итНормыСписания");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НормыСписанияПриИзменении(Элемент)
	
	ТекСтрока = Элементы.итНормыСписания.ТекущиеДанные;
	Если ТекСтрока <> НЕОПРЕДЕЛЕНО И Не ЗначениеЗаполнено(ТекСтрока.Период) Тогда		
		ТекСтрока.Период = ТекущаяДата();
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьНормыСписанияНаСервере(ТекущийОбъект);

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьНормыСписанияНаСервере();

КонецПроцедуры

