// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

#Область ДействияСДокументамиЭДО

// Возвращает сведения по созданным документам ЭДО.
//
// Параметры:
//  ДанныеДокументовЭДО - Массив из Структура:
//  * Идентификатор - Строка
//  * Отправитель - Структура:
//    ** ИНН - Строка
//    ** КПП - Строка
//  * Получатель - Структура:
//    ** ИНН - Строка
//    ** КПП - Строка
//  * ВидДокумента - Структура:
//    ** Наименование - Строка
//    ** ТипДокумента - Строка
//  * ИдентификаторОтправителя - Строка
//  * ИдентификаторПолучателя - Строка
//  * ТребуетсяОтветнаяПодпись - Булево
//  * ТребуетсяИзвещениеОПолучении - Булево
//  * Формат - Строка - формат, в который конвертируются учетные данные.
//  * УчетныеДанные - Неопределено,Структура:
//    ** Данные - См. ДеревоУчетныхДанныхИзСтруктуры.СтруктураДанных
//    ** Формат - Строка - формат учетных данных.
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * ОписанияДокументовЭДО - См. ОписанияИсходящихДокументов
Функция СформироватьДокументыЭДО(ДанныеДокументовЭДО) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибки", Неопределено);
	Результат.Вставить("ОписанияДокументовЭДО", Новый Массив);
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	ВидОперации = НСтр("ru = 'Формирование документов ЭДО.'");
	
	НастройкиОбмена = НастройкиОбменаМеждуУчастникамиЭДО(ДанныеДокументовЭДО);
	
	КлючиНастроекПоРеквизитам = КлючиНастроекПоРеквизитам(ДанныеДокументовЭДО);
	
	ФорматыЭлектронныхДокументов = ФорматыЭДО.ФорматыЭлектронныхДокументов();
	
	НовыеДокументыЭДО = Новый Массив; // Массив из ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
	
	Для Каждого ДанныеДокументаЭДО Из ДанныеДокументовЭДО Цикл
		
		ЕстьОшибкаИдентификатора = ЕстьОшибкаНекорректныйИдентификаторДокумента(
			ДанныеДокументаЭДО.Идентификатор, КонтекстДиагностики, ВидОперации);
		Если ЕстьОшибкаИдентификатора Тогда
			Продолжить;
		КонецЕсли;
		
		НастройкаОбмена = НастройкаОбменаПоДаннымДокументаЭДО(НастройкиОбмена, ДанныеДокументаЭДО);
		
		ЕстьОшибкаНастройкиОбмена = ЕстьОшибкаНастройкиОбменаПоДаннымДокументаЭДО(
			НастройкаОбмена, ДанныеДокументаЭДО, КонтекстДиагностики, ВидОперации);
		Если ЕстьОшибкаНастройкиОбмена Тогда
			Продолжить;
		КонецЕсли;
		
		КлючНастройки = КлючиНастроекПоРеквизитам[ДанныеДокументаЭДО.Идентификатор];
		ЕстьОшибкаКлючаНастройки = ЕстьОшибкаКлючаНастройкиОтправкиПоДаннымДокументаЭДО(
			КлючНастройки, ДанныеДокументаЭДО, КонтекстДиагностики, ВидОперации);
		Если ЕстьОшибкаКлючаНастройки Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибкаНастройкиРегламента = ЕстьОшибкаНастройкиРегламентаПоДаннымДокументаЭДО(
			ДанныеДокументаЭДО, КонтекстДиагностики, ВидОперации);
		Если ЕстьОшибкаНастройкиРегламента Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибкаФормата = ЕстьОшибкаФорматаПоДаннымДокументаЭДО(ФорматыЭлектронныхДокументов,
			ДанныеДокументаЭДО, КлючНастройки.ВидДокумента, КонтекстДиагностики, ВидОперации);
		Если ЕстьОшибкаФормата Тогда
			Продолжить;
		КонецЕсли;
		
		НастройкиДокумента = ЭлектронныеДокументыЭДО.НовыеНастройкиОтправкиДокумента();
		НастройкиДокумента.Организация = КлючНастройки.Отправитель;
		НастройкиДокумента.Контрагент = КлючНастройки.Получатель;
		НастройкиДокумента.ДоговорКонтрагента = КлючНастройки.Договор;
		НастройкиДокумента.ИдентификаторОрганизации = ДанныеДокументаЭДО.ИдентификаторОтправителя;
		НастройкиДокумента.ИдентификаторКонтрагента = ДанныеДокументаЭДО.ИдентификаторПолучателя;
		НастройкиДокумента.СпособОбмена = НастройкаОбмена.СпособОбмена;
		НастройкиДокумента.МаршрутПодписания = Справочники.МаршрутыПодписания.ОднойДоступнойПодписью;
		НастройкиДокумента.ТребуетсяИзвещение = ДанныеДокументаЭДО.ТребуетсяИзвещениеОПолучении;
		НастройкиДокумента.ТребуетсяПодтверждение = ДанныеДокументаЭДО.ТребуетсяОтветнаяПодпись;
		НастройкиДокумента.ИдентификаторДокумента = ДанныеДокументаЭДО.Идентификатор;
		НастройкиДокумента.Формат = ДанныеДокументаЭДО.Формат;
		
		ФайлыДокументаЭДО = СформироватьФайлыДокументаПоУчетнымДанным(
			ДанныеДокументаЭДО.УчетныеДанные, НастройкиДокумента);
		
		Если ЗначениеЗаполнено(ФайлыДокументаЭДО.Ошибки) Тогда
			Продолжить;
		КонецЕсли;
		
		Содержание = ЭлектронныеДокументыЭДО.СодержаниеСообщения(ФайлыДокументаЭДО.Документ);
		
		Если Не ЗначениеЗаполнено(Содержание) Тогда
			Продолжить;
		КонецЕсли;
	
		ОписаниеСообщения = ЭлектронныеДокументыЭДО.НовоеОписаниеСообщения();
		ОписаниеСообщения.ТипЭлементаРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя;
		ОписаниеСообщения.ВидСообщения = КлючНастройки.ВидДокумента;
		ОписаниеСообщения.Направление = Перечисления.НаправленияЭДО.Исходящий;
		ОписаниеСообщения.Данные.Содержание = Содержание;
		ОписаниеСообщения.Данные.Документ = ФайлыДокументаЭДО.Документ;
		ОписаниеСообщения.Данные.ДополнительныйДокумент = ФайлыДокументаЭДО.ДополнительныйДокумент;
		
		ОписаниеСообщений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОписаниеСообщения);
		
		Попытка
			ДокументОбъект = ЭлектронныеДокументыЭДО.СоздатьДокументПоОписаниюСообщений(
				НастройкиДокумента, ОписаниеСообщений, КонтекстДиагностики);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ИмяСобытия = ЦентрЭДО.ПредставлениеПодсистемы();
			Уровень = УровеньЖурналаРегистрации.Ошибка;
			ОбъектМетаданных = ДокументОбъект.Метаданные();
			Данные = ДанныеДокументаЭДО.Идентификатор;
			Комментарий = НСтр("ru = 'Не удалось сформировать электронный документ по причине:'")
				+ Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных, Данные, Комментарий);
			
			Если ИнформацияОбОшибке.Код = КодИсключенияДокументУжеСуществует() Тогда
				ДокументЭДО = ДокументПоИдентификатору(ДанныеДокументаЭДО.Идентификатор);
				Если ЗначениеЗаполнено(ДокументЭДО) Тогда
					НовыеДокументыЭДО.Добавить(ДокументЭДО);
				КонецЕсли;
			КонецЕсли;
			
			Продолжить;
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда
			НовыеДокументыЭДО.Добавить(ДокументОбъект.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.ОписанияДокументовЭДО = ОписанияИсходящихДокументов(НовыеДокументыЭДО);
	
	Возврат Результат;
	
КонецФункции

// Возвращает сформированные файлы документа ЭДО.
//
// Параметры:
//  ДанныеДокументовЭДО - Массив из Структура:
//  * Идентификатор     - Строка
//  * Отправитель       - Структура:
//  ** ИНН              - Строка
//  ** КПП              - Строка
//  * Получатель        - Структура:
//  ** ИНН              - Строка
//  ** КПП              - Строка
//  * ВидДокумента      - Структура:
//  ** Наименование     - Строка
//  ** ТипДокумента     - Строка
//  * ИдентификаторОтправителя - Строка
//  * ИдентификаторПолучателя - Строка
//  * Формат            - Строка - формат, в который конвертируются учетные данные.
//  * УчетныеДанные     - Структура:
//  ** Данные           - См. ДеревоУчетныхДанныхИзСтруктуры.СтруктураДанных
//  ** Формат           - Строка - формат учетных данных.
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * Ошибки - Неопределено - при формировании без ошибок.
//           - Массив из Строка
//  * ОсновнойФайл - Неопределено - при наличии ошибок.
//                 - Структура:
//  ** ИмяФайла - Строка
//  ** Данные - Строка - двоичные данные в формате base64.
//  * ДополнительныйФайл - Неопределено - при наличии ошибок или отсутствии соответствующих учетных данных.
//                       - Структура:
//  ** ИмяФайла - Строка
//  ** Данные - Строка - двоичные данные в формате base64.
//
Функция СформироватьФайлыДокументовЭДО(ДанныеДокументовЭДО) Экспорт
	
	НаборРезультатов = Новый Массив; // См. СформироватьФайлыДокументовЭДО
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	ВидОперации = НСтр("ru = 'Формирование файлов документов ЭДО.'");
	
	НастройкиОбмена = НастройкиОбменаМеждуУчастникамиЭДО(ДанныеДокументовЭДО);
	
	КлючиНастроекПоРеквизитам = КлючиНастроекПоРеквизитам(ДанныеДокументовЭДО);
	
	ВидыДокументов = ВыгрузитьУникальныеЗначенияСвойстваКлючейНастроек(КлючиНастроекПоРеквизитам, "ВидДокумента");
	
	ОборФорматов = ФорматыЭДО.НовыйОтборФорматовЭлектронныхДокументов();
	ОборФорматов.ВидыДокументов = ВидыДокументов;
	ФорматыЭлектронныхДокументов = ФорматыЭДО.ФорматыЭлектронныхДокументов();

	Для Каждого ДанныеДокументаЭДО Из ДанныеДокументовЭДО Цикл
		
		РезультатФормирования = Новый Структура;
		РезультатФормирования.Вставить("Идентификатор", ДанныеДокументаЭДО.Идентификатор);
		РезультатФормирования.Вставить("Ошибки", Неопределено);
		РезультатФормирования.Вставить("ОсновнойФайл", Неопределено);
		РезультатФормирования.Вставить("ДополнительныйФайл", Неопределено);
		
		НаборРезультатов.Добавить(РезультатФормирования);
		
		ЕстьОшибкаИдентификатора = ЕстьОшибкаНекорректныйИдентификаторДокумента(
			ДанныеДокументаЭДО.Идентификатор, КонтекстДиагностики, ВидОперации);
		Если ЕстьОшибкаИдентификатора Тогда
			РезультатФормирования.Ошибки = 
				ОбработкаНеисправностейБЭДКлиентСервер.ПодробныеПредставленияОшибок(КонтекстДиагностики);
			Продолжить;
		КонецЕсли;
		
		НастройкаОбмена = НастройкаОбменаПоДаннымДокументаЭДО(НастройкиОбмена, ДанныеДокументаЭДО);
		
		ЕстьОшибкаНастройкиОбмена = ЕстьОшибкаНастройкиОбменаПоДаннымДокументаЭДО(
			НастройкаОбмена, ДанныеДокументаЭДО, КонтекстДиагностики, ВидОперации);
		Если ЕстьОшибкаНастройкиОбмена Тогда
			РезультатФормирования.Ошибки = 
				ОбработкаНеисправностейБЭДКлиентСервер.ПодробныеПредставленияОшибок(КонтекстДиагностики);
			Продолжить;
		КонецЕсли;
		
		КлючНастройки = КлючиНастроекПоРеквизитам[ДанныеДокументаЭДО.Идентификатор];
		ЕстьОшибкаКлючаНастройки = ЕстьОшибкаКлючаНастройкиОтправкиПоДаннымДокументаЭДО(
			КлючНастройки, ДанныеДокументаЭДО, КонтекстДиагностики, ВидОперации);
		Если ЕстьОшибкаКлючаНастройки Тогда
			РезультатФормирования.Ошибки = 
				ОбработкаНеисправностейБЭДКлиентСервер.ПодробныеПредставленияОшибок(КонтекстДиагностики);
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибкаФормата = ЕстьОшибкаФорматаПоДаннымДокументаЭДО(ФорматыЭлектронныхДокументов,
			ДанныеДокументаЭДО, КлючНастройки.ВидДокумента, КонтекстДиагностики, ВидОперации);
		Если ЕстьОшибкаФормата Тогда
			РезультатФормирования.Ошибки = 
				ОбработкаНеисправностейБЭДКлиентСервер.ПодробныеПредставленияОшибок(КонтекстДиагностики);
			Продолжить;
		КонецЕсли;

		КлючНастройки = КлючиНастроекПоРеквизитам[ДанныеДокументаЭДО.Идентификатор];
		
		НастройкиДокумента = ЭлектронныеДокументыЭДО.НовыеНастройкиОтправкиДокумента();
		НастройкиДокумента.Организация = КлючНастройки.Отправитель;
		НастройкиДокумента.Контрагент = КлючНастройки.Получатель;
		НастройкиДокумента.ДоговорКонтрагента = КлючНастройки.Договор;
		НастройкиДокумента.ИдентификаторОрганизации = ДанныеДокументаЭДО.ИдентификаторОтправителя;
		НастройкиДокумента.ИдентификаторКонтрагента = ДанныеДокументаЭДО.ИдентификаторПолучателя;
		НастройкиДокумента.СпособОбмена = НастройкаОбмена.СпособОбмена;
		НастройкиДокумента.МаршрутПодписания = Справочники.МаршрутыПодписания.ОднойДоступнойПодписью;
		НастройкиДокумента.ИдентификаторДокумента = ДанныеДокументаЭДО.Идентификатор;
		Если ЗначениеЗаполнено(ДанныеДокументаЭДО.Формат) Тогда
			НастройкиДокумента.Формат = ДанныеДокументаЭДО.Формат;
		КонецЕсли;
		
		ФайлыДокументаЭДО = СформироватьФайлыДокументаПоУчетнымДанным(
			ДанныеДокументаЭДО.УчетныеДанные, НастройкиДокумента);
		
		Если ЗначениеЗаполнено(ФайлыДокументаЭДО.Ошибки) Тогда
			РезультатФормирования.Ошибки = ФайлыДокументаЭДО.Ошибки;
		КонецЕсли;
		
		Если ФайлыДокументаЭДО.Документ.ДвоичныеДанные <> Неопределено Тогда
			ОсновнойФайл = НовыйФайлДокументаЭДОВФорматеСервиса();
			ОсновнойФайл.ИмяФайла = ФайлыДокументаЭДО.Документ.ИмяФайла;
			ОсновнойФайл.Данные = Base64Строка(ФайлыДокументаЭДО.Документ.ДвоичныеДанные);
			РезультатФормирования.ОсновнойФайл = ОсновнойФайл;
		КонецЕсли;
		
		Если ФайлыДокументаЭДО.ДополнительныйДокумент.ДвоичныеДанные <> Неопределено Тогда
			ДополнительныйФайл = НовыйФайлДокументаЭДОВФорматеСервиса();
			ДополнительныйФайл.ИмяФайла = ФайлыДокументаЭДО.ДополнительныйДокумент.ИмяФайла;
			ДополнительныйФайл.Данные = Base64Строка(ФайлыДокументаЭДО.ДополнительныйДокумент.ДвоичныеДанные);
			РезультатФормирования.ДополнительныйФайл = ДополнительныйФайл;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НаборРезультатов;
	
КонецФункции

// Возвращает сведения по созданным документам ЭДО на основании файлов.
//
// Параметры:
//  ДанныеДокументовЭДО - Массив из Структура:
//  * Идентификатор     - Строка
//  * Отправитель       - Структура:
//  ** ИНН              - Строка
//  ** КПП              - Строка
//  * Получатель        - Структура:
//  ** ИНН              - Строка
//  ** КПП              - Строка
//  * ВидДокумента      - Структура:
//  ** Наименование     - Строка
//  ** ТипДокумента     - Строка
//  * ИдентификаторОтправителя - Строка
//  * ИдентификаторПолучателя - Строка
//  * ТребуетсяОтветнаяПодпись - Булево
//  * ТребуетсяИзвещениеОПолучении - Булево
//  * Номер                   - Строка
//  * Дата                    - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * Сумма                   - Число
//  * СопроводительнаяЗаписка - Строка
//  * ФайлыТитулов      - Массив Из Структура:
//  ** Основной - Структура:
//  *** ИмяФайла - Строка
//  *** Данные - Строка - двоичные данные в формате base64.
//  ** Дополнительный - Структура:
//  *** ИмяФайла - Строка
//  *** Данные - Строка - двоичные данные в формате base64.
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * ОписанияДокументовЭДО - См. ОписанияИсходящихДокументов
//
Функция СформироватьДокументыЭДОПоФайлам(ДанныеДокументовЭДО) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибки", Неопределено);
	Результат.Вставить("ОписанияДокументовЭДО", Новый Массив);
	
	КлючиНастроекПоРеквизитам = КлючиНастроекПоРеквизитам(ДанныеДокументовЭДО);
	
	НовыеДокументыЭДО = Новый Массив; // Массив из ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
	Ошибки = Новый Массив; // Массив из Строка
	
	Для Каждого ДанныеДокументаЭДО Из ДанныеДокументовЭДО Цикл
		
		КлючНастройки = КлючиНастроекПоРеквизитам[ДанныеДокументаЭДО.Идентификатор];
		Если Не ЗначениеЗаполнено(КлючНастройки) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыСоздания = ИнтерфейсДокументовЭДОКлиентСервер.НовыеПараметрыСозданияДокументаПоФайлу();
		ПараметрыСоздания.ИдентификаторДокумента = ДанныеДокументаЭДО.Идентификатор;
		ПараметрыСоздания.ВидДокумента = КлючНастройки.ВидДокумента;
		ПараметрыСоздания.Организация = КлючНастройки.Отправитель;
		ПараметрыСоздания.Контрагент = КлючНастройки.Получатель;
		ПараметрыСоздания.Договор = КлючНастройки.Договор;
		ПараметрыСоздания.НомерДокумента = ДанныеДокументаЭДО.Номер;
		ПараметрыСоздания.ДатаДокумента = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(ДанныеДокументаЭДО.Дата);
		ПараметрыСоздания.СуммаДокумента = ДанныеДокументаЭДО.Сумма;
		ПараметрыСоздания.СопроводительнаяЗаписка = ДанныеДокументаЭДО.СопроводительнаяЗаписка;
		
		ПараметрыОбменаЭДО = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыОбменаЭДОДляСозданияДокументаПоФайлу();
		Если ДанныеДокументаЭДО.Свойство("ИдентификаторОтправителя", ПараметрыОбменаЭДО.ИдентификаторОтправителя)
			И ДанныеДокументаЭДО.Свойство("ИдентификаторПолучателя", ПараметрыОбменаЭДО.ИдентификаторПолучателя)
			И ДанныеДокументаЭДО.Свойство("ТребуетсяИзвещениеОПолучении", ПараметрыОбменаЭДО.ТребуетсяИзвещениеОПолучении)
			И ДанныеДокументаЭДО.Свойство("ТребуетсяОтветнаяПодпись", ПараметрыОбменаЭДО.ТребуетсяОтветнаяПодпись) Тогда
			ПараметрыСоздания.ПараметрыОбмена = ПараметрыОбменаЭДО;
		КонецЕсли;
		
		ОписаниеФайла = РаботаСФайламиБЭД.НовоеОписаниеФайла();
		Для Каждого ФайлТитула Из ДанныеДокументаЭДО.ФайлыТитулов Цикл
			Если Не ЗначениеЗаполнено(ФайлТитула.Основной) Тогда
				Продолжить;
			КонецЕсли;
			
			ОписаниеФайла.ИмяФайла = ФайлТитула.Основной.ИмяФайла;
			ОписаниеФайла.ДвоичныеДанные = Base64Значение(ФайлТитула.Основной.Данные);
		КонецЦикла;
		
		РезультатСоздания = ЭлектронныеДокументыЭДО.СоздатьДокументПоФайлу(ПараметрыСоздания, ОписаниеФайла);
		Если РезультатСоздания.Успех Тогда
			НовыеДокументыЭДО.Добавить(РезультатСоздания.ЭлектронныйДокумент);
		ИначеЕсли ЗначениеЗаполнено(РезультатСоздания.Ошибки) Тогда
			Для Каждого Ошибка Из РезультатСоздания.Ошибки Цикл
				Если Не ЗначениеЗаполнено(Ошибка.ОшибкиСозданияПоФайлу) Тогда
					Продолжить;
				КонецЕсли;
				Для Каждого ОшибкаСозданияПоФайлу Из Ошибка.ОшибкиСозданияПоФайлу Цикл
					Ошибки.Добавить(ОшибкаСозданияПоФайлу.ТекстОшибки);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		Результат.Ошибки = Ошибки;
	КонецЕсли;
	
	Результат.ОписанияДокументовЭДО = ОписанияИсходящихДокументов(НовыеДокументыЭДО);
	
	Возврат Результат;
	
КонецФункции

// Возвращает сведения по переформированным документам ЭДО на основании файлов.
//
// Параметры:
//  ДанныеДокументовЭДО - Массив из Структура:
//  * Идентификатор     - Строка
//  * Отправитель       - Структура:
//  ** ИНН              - Строка
//  ** КПП              - Строка
//  * Получатель        - Структура:
//  ** ИНН              - Строка
//  ** КПП              - Строка
//  * ВидДокумента      - Структура:
//  ** Наименование     - Строка
//  ** ТипДокумента     - Строка
//  * ИдентификаторОтправителя - Строка
//  * ИдентификаторПолучателя - Строка
//  * ТребуетсяОтветнаяПодпись - Булево
//  * ТребуетсяИзвещениеОПолучении - Булево
//  * Номер                   - Строка
//  * Дата                    - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * Сумма                   - Число
//  * СопроводительнаяЗаписка - Строка
//  * ФайлыТитулов      - Массив Из Структура:
//  ** Основной - Структура:
//  *** ИмяФайла - Строка
//  *** Данные - Строка - двоичные данные в формате base64.
//  ** Дополнительный - Структура:
//  *** ИмяФайла - Строка
//  *** Данные - Строка - двоичные данные в формате base64.
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Массив из Строка
//  * ОписанияДокументовЭДО - См. ОписанияИсходящихДокументов
//
Функция ПереформироватьДокументыЭДОПоФайлам(ДанныеДокументовЭДО) Экспорт
	
	Ошибки = Новый Массив; // Массив из Строка
	Результат = Новый Структура;
	Результат.Вставить("Ошибки", Ошибки);
	Результат.Вставить("ОписанияДокументовЭДО", Новый Массив);
	
	ПереформированныеДокументы = Новый Массив; // Массив из ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
	
	ИдентификаторыДокументов = Новый Массив; // Массив из Строка
	Для Каждого ДанныеДокументаЭДО Из ДанныеДокументовЭДО Цикл
		ИдентификаторыДокументов.Добавить(ДанныеДокументаЭДО.Идентификатор);
	КонецЦикла;
	ДокументыПоИдентификаторам = ДокументыПоИдентификаторам(ИдентификаторыДокументов);
	
	КлючиНастроекПоРеквизитам = КлючиНастроекПоРеквизитам(ДанныеДокументовЭДО);
	
	Для Каждого ДанныеДокументаЭДО Из ДанныеДокументовЭДО Цикл
		
		ЭлектронныйДокумент = ДокументыПоИдентификаторам[ДанныеДокументаЭДО.Идентификатор];
	
		Если Не ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
			ТекстОшибки = ТекстОшибкиНеУдалосьНайтиЭлектронныйДокументПоИдентификатору(
				ДанныеДокументаЭДО.Идентификатор);
			Результат.Ошибки.Добавить(ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		КлючНастройки = КлючиНастроекПоРеквизитам[ДанныеДокументаЭДО.Идентификатор];
		Если Не ЗначениеЗаполнено(КлючНастройки) Тогда
			Продолжить;
		КонецЕсли;
		
		НастройкиДокумента = НастройкиЭДО.НастройкиОтправки(КлючНастройки);
		Если Не ЗначениеЗаполнено(НастройкиДокумента) Тогда
			Продолжить;
		КонецЕсли;

		ПараметрыПереформирования = ЭлектронныеДокументыЭДО.НовыеПараметрыПереформированияДокументаПоФайлу();
		ПараметрыПереформирования.Организация = КлючНастройки.Отправитель;
		ПараметрыПереформирования.Контрагент = КлючНастройки.Получатель;
		ПараметрыПереформирования.Договор = КлючНастройки.Договор;
		ПараметрыПереформирования.ВидДокумента = КлючНастройки.ВидДокумента;
		ПараметрыПереформирования.НомерДокумента = ДанныеДокументаЭДО.Номер;
		ПараметрыПереформирования.ДатаДокумента = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(ДанныеДокументаЭДО.Дата);
		ПараметрыПереформирования.СуммаДокумента = ДанныеДокументаЭДО.Сумма;
		ПараметрыПереформирования.СопроводительнаяЗаписка = ДанныеДокументаЭДО.СопроводительнаяЗаписка;
		
		ОписаниеФайла = Неопределено;
		Для Каждого ФайлТитула Из ДанныеДокументаЭДО.ФайлыТитулов Цикл
			Если Не ЗначениеЗаполнено(ФайлТитула.Основной) Тогда
				Продолжить;
			КонецЕсли;
			
			ОписаниеФайла = РаботаСФайламиБЭД.НовоеОписаниеФайла();
			ОписаниеФайла.ИмяФайла = ФайлТитула.Основной.ИмяФайла;
			ОписаниеФайла.ДвоичныеДанные = Base64Значение(ФайлТитула.Основной.Данные);
		КонецЦикла;
		
		РезультатПереформирования = ЭлектронныеДокументыЭДО.ПереформироватьДокументПоФайлу(ЭлектронныйДокумент,
			ПараметрыПереформирования, ОписаниеФайла);
			
		Если РезультатПереформирования.Успех Тогда
			ПереформированныеДокументы.Добавить(ЭлектронныйДокумент);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.ОписанияДокументовЭДО = ОписанияИсходящихДокументов(ПереформированныеДокументы);
	
	Возврат Результат;
	
КонецФункции

// Возвращает данные для подписания документов ЭДО.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  ОтпечаткиСертификатов - Массив из Строка
// 
// Возвращаемое значение:
//  См. ПодготовитьДанныеДляПодписания
Функция ПодготовитьДанныеДляПодписанияДокументовЭДО(ИдентификаторыДокументовЭДО, ОтпечаткиСертификатов) Экспорт
	
	Возврат ПодготовитьДанныеДляПодписания(ИдентификаторыДокументовЭДО, ОтпечаткиСертификатов);
	
КонецФункции

// Возвращает данные файлов электронных документов с заполненными подписантами и доверенностями.
//
// Параметры:
//  ДанныеДляЗаполненияПоСертификатам - Массив из Структура:
//  * ИдентификаторыДанных - Массив из Строка
//  * ОтпечатокСертификата - Строка
//  * НомерДоверенности - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * НаборДанных - Массив из Структура:
//  ** ИдентификаторДанных - Строка - идентификатор данных электронного документа в сервисе.
//  ** Данные - Строка - двоичные данные в формате base64.
//
Функция ЗаполнитьДанныеДляПодписанияПоВыбраннымСертификатам(ДанныеДляЗаполненияПоСертификатам) Экспорт
	
	ИдентификаторыДанных = Новый Массив;
	ОтпечаткиСертификатов = Новый Массив; // Массив из Строка
	НомераДоверенностей = Новый Массив; // Массив из Строка
	
	Для Каждого ОписаниеНабораДанных Из ДанныеДляЗаполненияПоСертификатам Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИдентификаторыДанных, ОписаниеНабораДанных.ИдентификаторыДанных);
		ОтпечаткиСертификатов.Добавить(ОписаниеНабораДанных.ОтпечатокСертификата);
		НомераДоверенностей.Добавить(ОписаниеНабораДанных.НомерДоверенности);
	КонецЦикла;
	
	ФайлыПоИдентификаторам = ФайлыПоИдентификаторам(ИдентификаторыДанных);
	ФайлыДокументовЭДО = ОбщегоНазначения.ВыгрузитьКолонку(ФайлыПоИдентификаторам, "Значение"); // Массив из СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
	СостоянияДокументовЭДОПоФайлам = СостоянияДокументовЭДОПоФайлам(ФайлыДокументовЭДО);
	
	СертификатыПоОтпечаткам = КриптографияБЭД.СертификатыПоОтпечаткам(ОтпечаткиСертификатов);
	ДоверенностиПоНомерам = МашиночитаемыеДоверенности.ПолучитьДоверенностиИзЖурналаПоНомерам(НомераДоверенностей);
	
	РезультатыПоФайлам = Новый Соответствие; // См. ЗаполнитьПодписантовИДоверенностиПоСертификату
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	Для Каждого ОписаниеНабораДанных Из ДанныеДляЗаполненияПоСертификатам Цикл
		
		Сертификат = СертификатыПоОтпечаткам[ОписаниеНабораДанных.ОтпечатокСертификата];
		Доверенность = ДоверенностиПоНомерам[ОписаниеНабораДанных.НомерДоверенности];
		
		ФайлыДокументовЭДОПоСертификату = ФайлыДокументовЭДОДляЗаполненияПоСертификату(
			ОписаниеНабораДанных.ИдентификаторыДанных, ФайлыПоИдентификаторам, СостоянияДокументовЭДОПоФайлам,
			Сертификат, КонтекстДиагностики);
		
		Если Не ЗначениеЗаполнено(ФайлыДокументовЭДОПоСертификату) Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатыПоФайламНабора = ЗаполнитьПодписантовИДоверенностиПоСертификату(
			ФайлыДокументовЭДОПоСертификату, Сертификат, Доверенность, КонтекстДиагностики);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(РезультатыПоФайлам, РезультатыПоФайламНабора);
		
	КонецЦикла;
	
	НаборДанныхВФорматеСервиса = Новый Массив; // Массив из Структура
	
	Для Каждого РезультатПоФайлу Из РезультатыПоФайлам Цикл
		
		Если РезультатПоФайлу.Значение.Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		ПрисоединенныйФайл = РезультатПоФайлу.Ключ;
		ДанныеДляПодписания = РезультатПоФайлу.Значение.ДанныеДляПодписания;
		
		АдресДанныхДляОбновления = ПоместитьВоВременноеХранилище(ДанныеДляПодписания);
		ИнформацияОФайле = Новый Структура;
		ИнформацияОФайле.Вставить("АдресФайлаВоВременномХранилище", АдресДанныхДляОбновления);
		ИнформацияОФайле.Вставить("АдресВременногоХранилищаТекста", "");
		РаботаСФайлами.ОбновитьФайл(ПрисоединенныйФайл, ИнформацияОФайле);
		
		ЗаполненныеДанные = Новый Структура;
		ЗаполненныеДанные.Вставить("ИдентификаторФайла", ИдентификаторСсылки(ПрисоединенныйФайл));
		ЗаполненныеДанные.Вставить("Данные", Base64Строка(ДанныеДляПодписания));
		НаборДанныхВФорматеСервиса.Добавить(ЗаполненныеДанные);
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибки", Неопределено);
	Результат.Вставить("НаборДанных", НаборДанныхВФорматеСервиса);
	
	Возврат Результат;
	
КонецФункции

// Возвращает результат добавления подписей к файлам электронных документов.
// 
// Параметры:
//  ПодписиФайлов - Массив из Структура:
//  * ИдентификаторДанных - Строка - идентификатор файла электронного документа.
//  * Подпись - Строка - данные подписи в формате base64.
//  * НомерДоверенности - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из См. НовоеСостояниеДокументаЭДОВФорматеСервиса
//  
Функция ДобавитьПодписиФайловДокументовЭДО(ПодписиФайлов) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибки", Неопределено);
	Результат.Вставить("СостоянияДокументовЭДО", Новый Массив);
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	ПодписанныеСообщения = ПодписанныеСообщенияПоФайлам(ПодписиФайлов, КонтекстДиагностики);
	
	РезультатДействий = ЭлектронныеДокументыЭДО.ДобавитьПодписиДокументовЭДО(ПодписанныеСообщения, КонтекстДиагностики);
	
	ДокументыЭДО = ОбщегоНазначения.ВыгрузитьКолонку(РезультатДействий.Итог.ОбработанныеДокументы, "Ключ");
	
	Результат.СостоянияДокументовЭДО = СостоянияДокументовЭДОВФорматеСервиса(ДокументыЭДО);
	
	Возврат Результат;
	
КонецФункции

// Возвращает результат отправки электронных документов по ЭДО.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  МаркерыАвторизации - Массив из См. УчетныеЗаписиЭДОЦентрЭДО.НовыйМаркерАвторизацииПоУчетнойЗаписиЭДО
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из См. УчетныеЗаписиЭДОЦентрЭДО.НовоеСостояниеДокументаЭДОВФорматеСервиса
//  * ЗашифрованныеМаркеры - Неопределено
//                         - Массив из См. УчетныеЗаписиЭДОЦентрЭДО.НовыйМаркерАвторизацииПоУчетнойЗаписиЭДО
Функция ОтправитьДокументыЭДО(ИдентификаторыДокументовЭДО, МаркерыАвторизации = Неопределено) Экспорт
	
	Возврат ОправитьСообщенияПоДокументамЭДО(ИдентификаторыДокументовЭДО, МаркерыАвторизации);
	
КонецФункции

// Возвращает результат утверждения электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция УтвердитьДокументыЭДО(ИдентификаторыДокументовЭДО) Экспорт
	
	Действие = Перечисления.ДействияПоЭДО.Утвердить;
	Результат = ВыполнитьДействиеЭДОПоШаблону(Действие, ИдентификаторыДокументовЭДО);
	Возврат Результат;
	
КонецФункции

// Возвращает результат формирования ответных титулов по электронным документам.
// 
// Параметры:
//  ДанныеОтветныхТитулов - Массив из Структура:
//  * ИдентификаторДокумента - Строка
//  * УчетныеДанные - Структура - данные прикладного решения:
//  ** Данные - Структура - учетные данные для конвертации.
//  ** Формат - Строка - формат учетных данных.
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
Функция СформироватьОтветныеТитулыДокументовЭДО(ДанныеОтветныхТитулов) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибки", Неопределено);
	Результат.Вставить("СостоянияДокументовЭДО", Новый Массив);
	
	Если Не ЗначениеЗаполнено(ДанныеОтветныхТитулов) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИдентификаторыДокументов = Новый Массив; // Массив из Строка
	ДанныеПоИдентификаторамДокументов = Новый Соответствие;
	
	Для Каждого ДанныеОтветногоТитула Из ДанныеОтветныхТитулов Цикл
		ИдентификаторыДокументов.Добавить(ДанныеОтветногоТитула.ИдентификаторДокумента);
		Если Не ЗначениеЗаполнено(ДанныеОтветногоТитула.УчетныеДанные.Формат) Тогда
			Продолжить;
		КонецЕсли;
		УчетныеДанные = УчетныеДанныеОтветногоТитулаИзФорматаСервиса(ДанныеОтветногоТитула.УчетныеДанные);
		ДанныеПоИдентификаторамДокументов.Вставить(ДанныеОтветногоТитула.ИдентификаторДокумента, УчетныеДанные);
	КонецЦикла;
	
	РеквизитыДокументов = РеквизитыДокументовПоИдентификаторам(ИдентификаторыДокументов);
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	РезультатДействийПоЭДО = ЭлектронныеДокументыЭДО.НовыйРезультатДействийПоЭДО(КонтекстДиагностики);
	
	ОбъектыДействий = ЭлектронныеДокументыЭДОКлиентСервер.НовыеОбъектыДействийПоЭДО();
	ОбъектыДействий.ЭлектронныеДокументы = РеквизитыДокументов.ВыгрузитьКолонку("Ссылка");
	Выборка = ЭлектронныеДокументыЭДО.ВыборкаДокументовДляФормированияОтвета(ОбъектыДействий);
	
	Пока Выборка.Следующий() Цикл
		РеквизитыДокумента = РеквизитыДокументов.Найти(Выборка.ЭлектронныйДокумент, "Ссылка");
		УчетныеДанные = ДанныеПоИдентификаторамДокументов[РеквизитыДокумента.ИдентификаторДокумента];
		ЭлектронныеДокументыЭДО.СформироватьОтветПоДокументу(Выборка.ЭлектронныйДокумент, РезультатДействийПоЭДО, УчетныеДанные);
	КонецЦикла;
	
	ДокументыЭДО = ОбщегоНазначения.ВыгрузитьКолонку(РезультатДействийПоЭДО.Итог.ОбработанныеДокументы, "Ключ");
	
	Результат.СостоянияДокументовЭДО = СостоянияДокументовЭДОВФорматеСервиса(ДокументыЭДО);
	
	Возврат Результат;
	
КонецФункции

// Возвращает описания отправленных документов.
// 
// Параметры:
//  МаркерыАвторизации - Массив из см. УчетныеЗаписиЭДОЦентрЭДО.НовыйМаркерАвторизацииПоУчетнойЗаписиЭДО
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * Отправлено - Число
//  
Функция ОтправитьКонтейнерыЭДО(МаркерыАвторизации) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибки", Неопределено);
	Результат.Вставить("Отправлено", 0);
	
	ИдентификаторыУчетныхЗаписей = ОбщегоНазначения.ВыгрузитьКолонку(МаркерыАвторизации, "ИдентификаторУчетнойЗаписиЭДО");
	
	ПараметрыВыполнения = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполнения.ОбъектыДействий.ИдентификаторыОрганизаций = ИдентификаторыУчетныхЗаписей;
	ЭлектронныеДокументыЭДО.ДобавитьДействие(ПараметрыВыполнения.НаборДействий, Перечисления.ДействияПоЭДО.Отправить);
	ПараметрыВыполнения.РасшифрованныеМаркеры = РасшифрованныеМаркерыИзМаркеровАвторизации(МаркерыАвторизации);
	
	РезультатДействийПоЭДО = ЭлектронныеДокументыЭДОСлужебный.ВыполнитьДействияЭДО(ПараметрыВыполнения);
	
	Отправлено = РезультатДействийПоЭДО.Итог.ОбработаноПоДействиям[Перечисления.ДействияПоЭДО.Отправить];
	Если ЗначениеЗаполнено(Отправлено) Тогда
		Результат.Отправлено = Отправлено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает результат отклонения подписания электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  Комментарий - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция ОтклонитьПодписаниеДокументовЭДО(ИдентификаторыДокументовЭДО, Комментарий) Экспорт
	
	Действие = Перечисления.ДействияПоЭДО.ОтклонитьПодписание;
	Результат = ВыполнитьДействиеЭДОПоШаблону(Действие, ИдентификаторыДокументовЭДО, Комментарий);
	Возврат Результат;
	
КонецФункции

// Возвращает результат отклонения электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  Комментарий - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция ОтклонитьДокументыЭДО(ИдентификаторыДокументовЭДО, Комментарий) Экспорт
	
	Действие = Перечисления.ДействияПоЭДО.Отклонить;
	Результат = ВыполнитьДействиеЭДОПоШаблону(Действие, ИдентификаторыДокументовЭДО, Комментарий);
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  Комментарий - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция ЗапроситьУточненияДокументовЭДО(ИдентификаторыДокументовЭДО, Комментарий) Экспорт
	
	Действие = Перечисления.ДействияПоЭДО.ЗапроситьУточнение;
	Результат = ВыполнитьДействиеЭДОПоШаблону(Действие, ИдентификаторыДокументовЭДО, Комментарий);
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  Комментарий - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция СформироватьДополнительнуюИнформациюДокументовЭДО(ИдентификаторыДокументовЭДО, Комментарий) Экспорт
	
	Действие = Перечисления.ДействияПоЭДО.СформироватьДополнительнуюИнформацию;
	Результат = ВыполнитьДействиеЭДОПоШаблону(Действие, ИдентификаторыДокументовЭДО, Комментарий);
	Возврат Результат;
	
КонецФункции

// Возвращает результат аннулирования электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  Комментарий - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция АннулироватьДокументыЭДО(ИдентификаторыДокументовЭДО, Комментарий) Экспорт
	
	Действие = Перечисления.ДействияПоЭДО.Аннулировать;
	Результат = ВыполнитьДействиеЭДОПоШаблону(Действие, ИдентификаторыДокументовЭДО, Комментарий);
	Возврат Результат;
	
КонецФункции

// Возвращает результат принятия аннулирования электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция ПринятьАннулированиеДокументовЭДО(ИдентификаторыДокументовЭДО) Экспорт
	
	Действие = Перечисления.ДействияПоЭДО.ПринятьАннулирование;
	Результат = ВыполнитьДействиеЭДОПоШаблону(Действие, ИдентификаторыДокументовЭДО);
	Возврат Результат;
	
КонецФункции

// Возвращает результат отклонения аннулирования электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  Комментарий - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция ОтклонитьАннулированиеДокументовЭДО(ИдентификаторыДокументовЭДО, Комментарий = "") Экспорт
	
	Действие = Перечисления.ДействияПоЭДО.ОтклонитьАннулирование;
	Результат = ВыполнитьДействиеЭДОПоШаблону(Действие, ИдентификаторыДокументовЭДО, Комментарий);
	Возврат Результат;
	
КонецФункции

// Возвращает результат принудительного закрытия электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  Комментарий - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция ЗакрытьДокументыЭДО(ИдентификаторыДокументовЭДО, Комментарий = "") Экспорт
	
	Действие = Перечисления.ДействияПоЭДО.ЗакрытьПринудительно;
	Результат = ВыполнитьДействиеЭДОПоШаблону(Действие, ИдентификаторыДокументовЭДО, Комментарий);
	Возврат Результат;
	
КонецФункции

// Возвращает результат возврата в работу электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция ВернутьВРаботуДокументыЭДО(ИдентификаторыДокументовЭДО) Экспорт
	
	Действие = Перечисления.ДействияПоЭДО.ВернутьВРаботу;
	Результат = ВыполнитьДействиеЭДОПоШаблону(Действие, ИдентификаторыДокументовЭДО);
	Возврат Результат;
	
КонецФункции

// Возвращает результат отправки в архив электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
//  
Функция ОтправитьВАрхивДокументыЭДО(ИдентификаторыДокументовЭДО) Экспорт
	
	Действие = Перечисления.ДействияПоЭДО.ОтправитьВАрхив;
	Результат = ВыполнитьДействиеЭДОПоШаблону(Действие, ИдентификаторыДокументовЭДО);
	Возврат Результат;
	
КонецФункции

// Возвращает результат формирования извещений электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из Структура:
//  ** ИдентификаторДокумента - Строка
//  ** ИмяСостояния - Строка
//  ** СостояниеДополнение - Строка
//  ** ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  ** Комментарий - Строка
Функция СформироватьИзвещенияДокументовЭДО(ИдентификаторыДокументовЭДО) Экспорт
	
	Действие = Перечисления.ДействияПоЭДО.СформироватьИзвещение;
	Результат = ВыполнитьДействиеЭДОПоШаблону(Действие, ИдентификаторыДокументовЭДО);
	Возврат Результат;
	
КонецФункции

// Возвращает данные для подписания извещений электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  ОтпечаткиСертификатов - Массив из Строка
// 
// Возвращаемое значение:
//  См. ПодготовитьДанныеДляПодписания
Функция ПодготовитьДанныеДляПодписанияИзвещенийДокументовЭДО(ИдентификаторыДокументовЭДО, ОтпечаткиСертификатов) Экспорт
	
	Возврат ПодготовитьДанныеДляПодписания(ИдентификаторыДокументовЭДО, ОтпечаткиСертификатов, Истина);
	
КонецФункции

// Возвращает результат отправки извещений электронных документов по ЭДО.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  МаркерыАвторизации - Массив из См. НовыйМаркерАвторизацииПоУчетнойЗаписиЭДО
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из См. НовоеСостояниеДокументаЭДОВФорматеСервиса
//  * ЗашифрованныеМаркеры - Неопределено
//                         - Массив из См. НовыйМаркерАвторизацииПоУчетнойЗаписиЭДО
//
Функция ОтправитьИзвещенияДокументовЭДО(ИдентификаторыДокументовЭДО, МаркерыАвторизации = Неопределено) Экспорт
	
	Возврат ОправитьСообщенияПоДокументамЭДО(ИдентификаторыДокументовЭДО, МаркерыАвторизации, Истина);
	
КонецФункции

// Возвращает результат изменения данных входящего документа. 
// Изменение реквизитов входящих документов допустимо только для неформализованных документов,
// у которых нельзя получить данные из файла автоматически.
// Изменение реквизитов входящих формализованных документов недопустимо.
// 
// Параметры:
//  ИдентификаторДокумента - Строка
//  ДанныеДокумента - Структура:
//  * ВидДокумента - Неопределено - если изменение не требуется.
//                 - Структура:
//                   ** Наименование - Строка
//                   ** ТипДокумента - Строка
//  * НомерДокумента - Неопределено - если изменение не требуется.
//                   - Строка
//  * ДатаДокумента - Неопределено - если изменение не требуется.
//                  - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * СуммаДокумента - Неопределено - если изменение не требуется.
//                   - Число
//
// Возвращаемое значение:
//  Структура:
//  * Успех - Булево
//  * Ошибка - Строка
//
Функция ИзменитьДанныеВходящегоДокумента(ИдентификаторДокумента, ДанныеДокумента) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("Ошибка", "");
	
	ЭлектронныйДокумент = ДокументПоИдентификатору(ИдентификаторДокумента);

	Если Не ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
		ТекстОшибки = ТекстОшибкиНеУдалосьНайтиЭлектронныйДокументПоИдентификатору(ИдентификаторДокумента);
		Результат.Ошибка = ТекстОшибки;
		Возврат Результат;
	КонецЕсли;
	
	ДанныеДляИзменения = ЭлектронныеДокументыЭДОСлужебный.НовыеДанныеВходящегоДокументаДляИзменения();
	Если ДанныеДокумента.ВидДокумента <> Неопределено Тогда
		ДанныеДляИзменения.ВидДокумента = ВидДокументаИзФорматаСервиса(ДанныеДокумента.ВидДокумента);
	КонецЕсли;
	Если ДанныеДокумента.НомерДокумента <> Неопределено Тогда
		ДанныеДляИзменения.НомерДокумента = ДанныеДокумента.НомерДокумента;
	КонецЕсли;
	Если ДанныеДокумента.ДатаДокумента <> Неопределено Тогда
		ДанныеДляИзменения.ДатаДокумента = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(ДанныеДокумента.ДатаДокумента);
	КонецЕсли;
	Если ДанныеДокумента.СуммаДокумента <> Неопределено Тогда
		ДанныеДляИзменения.СуммаДокумента = ДанныеДокумента.СуммаДокумента;
	КонецЕсли;
	
	РезультатИзменения = ЭлектронныеДокументыЭДОСлужебный.ИзменитьДанныеВходящегоДокумента(ЭлектронныйДокумент,
		ДанныеДляИзменения);
		
	Если РезультатИзменения.Успех Тогда
		Результат.Успех = Истина;
	Иначе
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось изменить данные документа с идентификатором ""%1"": %2'"),
			ИдентификаторДокумента, РезультатИзменения.Ошибка);
		Результат.Ошибка = ТекстОшибки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти // ДействияСДокументамиЭДО

#Область ДанныеДокументовЭДО

// Возвращает учетные данные основных титулов электронного документа.
// 
// Параметры:
//  ИдентификаторДокумента - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * ДанныеОтправителя - Неопределено,Структура:
//    ** Данные - См. ДеревоУчетныхДанныхВСтруктуру
//    ** Формат - Строка - формат учетных данных.
//  * ДанныеПолучателя - Неопределено,Структура:
//    ** Данные - См. ДеревоУчетныхДанныхВСтруктуру
//    ** Формат - Строка - формат учетных данных.
Функция УчетныеДанныеДокумента(ИдентификаторДокумента) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеОтправителя", Неопределено);
	Результат.Вставить("ДанныеПолучателя", Неопределено);
	
	ЭлектронныйДокумент = ДокументПоИдентификатору(ИдентификаторДокумента);
	
	ДанныеДокумента = ЭлектронныеДокументыЭДО.ДанныеЭлектронногоДокумента(ЭлектронныйДокумент);
	
	ДанныеОтправителя = ДанныеДокумента.ДанныеОтправителя;
	Если ЗначениеЗаполнено(ДанныеОтправителя) Тогда
		УчетныеДанные = ДеревоУчетныхДанныхВСтруктуру(ДанныеОтправителя.Содержание);
		РезультатДанныеОтправителя = Новый Структура;
		РезультатДанныеОтправителя.Вставить("Данные", УчетныеДанные);
		РезультатДанныеОтправителя.Вставить("ФорматРазбора",
			СтрЗаменить(ДанныеОтправителя.ФорматРазбора, "ОбменСКонтрагентами.", ""));
		РезультатДанныеОтправителя.Вставить("ФорматТитула", ДанныеОтправителя.Формат);
		Результат.ДанныеОтправителя = РезультатДанныеОтправителя;
	КонецЕсли;
	
	ДанныеПолучателя = ДанныеДокумента.ДанныеПолучателя;
	Если ЗначениеЗаполнено(ДанныеДокумента.ДанныеПолучателя) Тогда
		УчетныеДанные = ДеревоУчетныхДанныхВСтруктуру(ДанныеПолучателя.Содержание);
		РезультатДанныеПолучателя = Новый Структура;
		РезультатДанныеПолучателя.Вставить("Данные", УчетныеДанные);
		РезультатДанныеПолучателя.Вставить("ФорматРазбора",
			СтрЗаменить(ДанныеПолучателя.ФорматРазбора, "ОбменСКонтрагентами.", ""));
		РезультатДанныеПолучателя.Вставить("ФорматТитула", ДанныеПолучателя.Формат);
		Результат.ДанныеПолучателя = РезультатДанныеПолучателя;
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции

// Возвращает информацию о номенклатуре из файлов основных титулов электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументов - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ИдентификаторДокумента - Строка
//  * СведенияОНоменклатуре - Массив из Структура:
//  ** ИД - Строка
//  ** Штрихкод - Строка
//  ** Наименование - Строка
//  ** НаименованиеХарактеристики - Строка
//  ** КодТовара - Строка
//  ** Артикул - Строка
//  ** БазоваяЕдиницаКод - Строка
//  ** БазоваяЕдиницаНаименование - Строка
//  ** БазоваяЕдиницаНаименованиеПолное - Строка
//  ** БазоваяЕдиницаМеждународноеСокращение - Строка
//  ** БазоваяЕдиницаНаименованиеКраткое - Строка
//  ** СтавкаНДС - Строка
//  ** Описание - Строка
//  ** ИсторияИдентификаторов - Массив из см. СопоставлениеНоменклатурыКонтрагентов.ИдентификаторТовараПоДаннымНоменклатуры
//  ** ТипНоменклатурыФНС - Строка
//  ** КодПоКТРУ - Строка
//  ** КодТНВЭД - Строка
//  ** СтранаПроисхожденияКод - Строка
//  ** ПрослеживаемыйТовар - Булево
//  ** МаркируемыйТовар - Булево
//
Функция СведенияНоменклатурыДокументовЭДО(ИдентификаторыДокументов) Экспорт
	
	СведенияНоменклатурыДокументов = Новый Массив; // См. СведенияНоменклатурыДокументовЭДО
	
	ПараметрыПолученияДанныхДокументов = ПараметрыПолученияДанныхДокументовЭДО(ИдентификаторыДокументов);
	
	Для Каждого ПараметрыПолученияДанныхДокумента Из ПараметрыПолученияДанныхДокументов Цикл
		
		СведенияНоменклатурыДокумента = НовыеСведенияНоменклатурыДокумента();
		СведенияНоменклатурыДокумента.ИдентификаторДокумента = ПараметрыПолученияДанныхДокумента.Ключ;
		СведенияНоменклатуры = СведенияНоменклатурыДокумента.СведенияНоменклатуры;
		
		ИнформацияОТовареИзФайла = ФорматыЭДО.ИнформацияОТовареИзФайла(ПараметрыПолученияДанныхДокумента.Значение);
		
		Для Каждого СтрокаТовара Из ИнформацияОТовареИзФайла Цикл
			
			СведенияНоменклатурнойПозиции = НовыеСведенияНоменклатурнойПозиции();
			ЗаполнитьЗначенияСвойств(СведенияНоменклатурнойПозиции, СтрокаТовара);
			СведенияНоменклатурнойПозиции.ИмяТипаНоменклатурыФНС = ОбщегоНазначения.ИмяЗначенияПеречисления(
				СтрокаТовара.ТипНоменклатурыФНС);
			СведенияНоменклатуры.Добавить(СведенияНоменклатурнойПозиции);
			
		КонецЦикла;
		
		СведенияНоменклатурыДокументов.Добавить(СведенияНоменклатурыДокумента);
		
	КонецЦикла;
	
	Возврат СведенияНоменклатурыДокументов;
	
КонецФункции

// Возвращает учетные данные из файлов основных титулов электронных документов.
// 
// Параметры:
//  ИдентификаторыДокументов - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ИдентификаторДокумента - Строка
//  * УчетныеДанные - Структура - данные прикладного решения:
//  ** Данные - См. ДеревоУчетныхДанныхВСтруктуру
//  ** Формат - Строка - формат учетных данных.
//
Функция УчетныеДанныеОтправителейДокументовЭДО(ИдентификаторыДокументов) Экспорт
	
	НаборДанныхОтражения = Новый Массив; // См. УчетныеДанныеОтправителейДокументовЭДО
	
	ПараметрыПолученияДанныхДокументов = ПараметрыПолученияДанныхДокументовЭДО(ИдентификаторыДокументов);
	
	Для Каждого ПараметрыПолученияДанныхДокумента Из ПараметрыПолученияДанныхДокументов Цикл
		
		ДанныеДокумента = ФорматыЭДО.ДанныеЭлектронногоДокумента(ПараметрыПолученияДанныхДокумента.Значение);
		ДеревоУчетныхДанных = ДанныеДокумента.НовыйЭД.ЗначениеРеквизита;
		
		ДанныеДляОтражения = НовыеУчетныеДанныеДляОтраженияДокумента();
		ДанныеДляОтражения.ИдентификаторДокумента = ПараметрыПолученияДанныхДокумента.Ключ;
		ДанныеДляОтражения.УчетныеДанные.Формат = ИмяМакетаДереваИзПути(ДанныеДокумента.НовыйЭД.ФорматРазбора);
		ДанныеДляОтражения.УчетныеДанные.Данные = ДеревоУчетныхДанныхВСтруктуру(ДеревоУчетныхДанных);
		НаборДанныхОтражения.Добавить(ДанныеДляОтражения);
		
	КонецЦикла;
	
	Возврат НаборДанныхОтражения;
	
КонецФункции

// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  См. ДанныеСинхронизацииДокументовЭДОПоИдентификаторам
Функция ДанныеСинхронизацииДокументовЭДО(ИдентификаторыДокументовЭДО) Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторыДокументовЭДО) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ЦентрЭДО.АвторизованСлужебныйПользователь() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ДанныеСинхронизации = ДанныеСинхронизацииДокументовЭДОПоИдентификаторам(ИдентификаторыДокументовЭДО);
	
	Возврат ДанныеСинхронизации;
	
КонецФункции

// Возвращает порцию сведений по документам ЭДО.
// 
// Параметры:
//  МеткиВремениПоИдентификаторамЭДО - Массив из Структура:
//  * МеткаВремени - Число
//  * ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * ЭтоПоследний - Булево
//  * НаборДанных - см. ДанныеСинхронизацииДокументовЭДО
Функция ПорцияДанныхСинхронизацииДокументовЭДОПоМеткамВремени(МеткиВремениПоИдентификаторамЭДО) Экспорт
	
	ПорцияДанных = Новый Структура;
	ПорцияДанных.Вставить("ЭтоПоследний", Истина);
	ПорцияДанных.Вставить("НаборДанных", Новый Массив);
	
	Если Не ЗначениеЗаполнено(МеткиВремениПоИдентификаторамЭДО) Тогда
		Возврат ПорцияДанных;
	КонецЕсли;
	
	Если ЦентрЭДО.АвторизованСлужебныйПользователь() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Порция = 1000;
	
	НаборДанных = ДанныеСинхронизацииДокументовЭДОПоМеткамВремени(МеткиВремениПоИдентификаторамЭДО, Порция);
	
	ПорцияДанных.ЭтоПоследний = НаборДанных.Количество() < Порция;
	ПорцияДанных.НаборДанных = НаборДанных;
	
	Возврат ПорцияДанных;
	
КонецФункции

// Параметры:
//  МеткиВремениПоИдентификаторамЭДО - Массив из Структура:
//  * МеткаВремени - Число
//  * ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.ПорцияМетокВремениПолныхДанныхДокументовЭДО
Функция ПорцияМетокВремениПолныхДанныхДокументовЭДО(МеткиВремениПоИдентификаторамЭДО) Экспорт
	
	ПорцияДанных = Новый Структура;;
	ПорцияДанных.Вставить("ЭтоПоследний", Истина);
	ПорцияДанных.Вставить("НаборДанных", Новый Массив);
	
	Если Не ЗначениеЗаполнено(МеткиВремениПоИдентификаторамЭДО) Тогда
		Возврат ПорцияДанных;
	КонецЕсли;
	
	Если ЦентрЭДО.АвторизованСлужебныйПользователь() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Порция = 1000;
	ТипДанных = Перечисления.ТипыСинхронизацииСЦентромЭДО.ДанныеДокументовЭДО;
	
	Выборка = МеткиВремениДанныхЭДО.ВыборкаИдентификаторовДанныхПоМеткамВремени(ТипДанных,
		МеткиВремениПоИдентификаторамЭДО, Порция);
	
	НаборДанных = ПорцияДанных.НаборДанных; // Массив из Структура
	Пока Выборка.Следующий() Цикл
		МеткаВремениДокумента = Новый Структура;
		МеткаВремениДокумента.Вставить("ИдентификаторОбъекта", Выборка.ИдентификаторОбъекта);
		МеткаВремениДокумента.Вставить("ИдентификаторЭДО", Выборка.ИдентификаторЭДО);
		МеткаВремениДокумента.Вставить("МеткаВремени", Выборка.МеткаВремени);
		НаборДанных.Добавить(МеткаВремениДокумента);
	КонецЦикла;
	
	ПорцияДанных.ЭтоПоследний = НаборДанных.Количество() < Порция;
	
	Возврат ПорцияДанных;
	
КонецФункции

// Возвращает сведения по документам ЭДО.
//
// Параметры:
//  ИдентификаторДокументаЭДО - Строка
//  МеткаВремени - Число
// 
// Возвращаемое значение:
//  См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.ДанныеПолнойСинхронизацииДокументаЭДО
Функция ДанныеПолнойСинхронизацииДокументаЭДО(ИдентификаторДокументаЭДО, МеткаВремени = 0) Экспорт
	
	Если ЦентрЭДО.АвторизованСлужебныйПользователь() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ДанныеСинхронизации = НовыеДанныеПолнойСинхронизацииДокументаЭДО();
	
	ДанныеСинхронизации.МеткаВремени = МеткиВремениДанныхЭДО.МеткаВремениДанныхДокументаЭДО(ИдентификаторДокументаЭДО);
	
	КлючиДанныхПоТипам = МеткиВремениДанныхЭДО.КлючиДанныхДокументаПоТипам(
		ИдентификаторДокументаЭДО, МеткаВремени);
	
	Если ЗначениеЗаполнено(КлючиДанныхПоТипам.Сообщения) Тогда
		ДанныеСинхронизации.Сообщения = ДанныеСообщенийПолнойСинхронизацииДокумента(КлючиДанныхПоТипам.Сообщения,
			ИдентификаторДокументаЭДО);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючиДанныхПоТипам.ФайлыСообщений) Тогда
		ДанныеСинхронизации.ФайлыСообщений = ДанныеФайловСообщенийПолнойСинхронизацииДокумента(
			КлючиДанныхПоТипам.ФайлыСообщений);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючиДанныхПоТипам.ПодписиФайлов) Тогда
		ДанныеСинхронизации.ПодписиФайлов = ДанныеПодписейФайловПолнойСинхронизацииДокумента(
			КлючиДанныхПоТипам.ПодписиФайлов);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючиДанныхПоТипам.ПроверкиПодписейПоМЧД) Тогда
		ДанныеСинхронизации.ПроверкиПодписейПоМЧД = ДанныеПроверокПодписейПолнойСинхронизацииДокумента(
			КлючиДанныхПоТипам.ПроверкиПодписейПоМЧД);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючиДанныхПоТипам.События) Тогда
		ДанныеСинхронизации.События = СобытияПолнойСинхронизацииДокумента(КлючиДанныхПоТипам.События,
			ИдентификаторДокументаЭДО);
	КонецЕсли;
	
	Возврат ДанныеСинхронизации;
	
КонецФункции

// Возвращает метки времени изменения документов по идентификаторам.
//
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ИдентификаторДокументаЭДО - Строка
//  * МеткаВремени - Число
Функция МеткиВремениДокументовЭДО(ИдентификаторыДокументовЭДО) Экспорт
	
	Возврат МеткиВремениДокументовЭДОПоТипуСинхронизации(ИдентификаторыДокументовЭДО,
		Перечисления.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО);
	
КонецФункции

// Возвращает метки времени изменения полных данных документов по идентификаторам.
//
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ИдентификаторДокументаЭДО - Строка
//  * МеткаВремени - Неопределено,Число
Функция МеткиВремениПолныхДанныхДокументовЭДО(ИдентификаторыДокументовЭДО) Экспорт
	
	Возврат МеткиВремениДокументовЭДОПоТипуСинхронизации(ИдентификаторыДокументовЭДО,
		Перечисления.ТипыСинхронизацииСЦентромЭДО.ДанныеДокументовЭДО);
	
КонецФункции

// Возвращает метки времени последних изменений документов по идентификаторам ЭДО.
//
// Параметры:
//  ИдентификаторыЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ИдентификаторЭДО - Строка
//  * МеткаВремени - Неопределено,Число
Функция ПоследниеМеткиВремениДокументовЭДО(ИдентификаторыЭДО) Экспорт
	
	Возврат МеткиВремениДанныхЭДО.ПоследниеМеткиВремениОбъектов(ИдентификаторыЭДО,
		Перечисления.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО);
	
КонецФункции

// Возвращает метки времени последних изменений полных данных документов по идентификаторам ЭДО.
//
// Параметры:
//  ИдентификаторыЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ИдентификаторЭДО - Строка
//  * МеткаВремени - Неопределено,Число
Функция ПоследниеМеткиВремениПолныхДанныхДокументовЭДО(ИдентификаторыЭДО) Экспорт
	
	Возврат МеткиВремениДанныхЭДО.ПоследниеМеткиВремениОбъектов(ИдентификаторыЭДО,
		Перечисления.ТипыСинхронизацииСЦентромЭДО.ДанныеДокументовЭДО);
	
КонецФункции

// Параметры:
//  ИдентификаторДокументаЭДО - Строка
//  МеткаВремени - Число
// 
// Возвращаемое значение:
//  См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.ДанныеПолнойСинхронизацииДокументаЭДО
Функция ДанныеПолнойСинхронизацииДокументаЭДОВерсия3(ИдентификаторДокументаЭДО, МеткаВремени = 0) Экспорт
		
	Если ЦентрЭДО.АвторизованСлужебныйПользователь() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ДанныеСинхронизации = НовыеДанныеПолнойСинхронизацииДокументаЭДОВерсия3();
	
	ДанныеСинхронизации.МеткаВремени = МеткиВремениДанныхЭДО.МеткаВремениДанныхДокументаЭДО(ИдентификаторДокументаЭДО);
	
	КлючиДанныхПоТипам = МеткиВремениДанныхЭДО.КлючиДанныхДокументаПоТипам(
		ИдентификаторДокументаЭДО, МеткаВремени);
	
	Если ЗначениеЗаполнено(КлючиДанныхПоТипам.Сообщения) Тогда
		ДанныеСинхронизации.Сообщения = ДанныеСообщенийПолнойСинхронизацииДокумента(КлючиДанныхПоТипам.Сообщения,
			ИдентификаторДокументаЭДО);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючиДанныхПоТипам.ФайлыСообщений) Тогда
		ДанныеСинхронизации.ФайлыСообщений = ДанныеФайловСообщенийПолнойСинхронизацииДокумента(
			КлючиДанныхПоТипам.ФайлыСообщений);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючиДанныхПоТипам.ПодписиФайлов) Тогда
		ДанныеСинхронизации.ПодписиФайлов = ДанныеПодписейФайловПолнойСинхронизацииДокумента(
			КлючиДанныхПоТипам.ПодписиФайлов);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючиДанныхПоТипам.ПроверкиПодписейПоМЧД) Тогда
		ДанныеСинхронизации.ПроверкиПодписейПоМЧД = ДанныеПроверокПодписейПолнойСинхронизацииДокументаВерсия3(
			КлючиДанныхПоТипам.ПроверкиПодписейПоМЧД);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючиДанныхПоТипам.События) Тогда
		ДанныеСинхронизации.События = СобытияПолнойСинхронизацииДокумента(КлючиДанныхПоТипам.События,
			ИдентификаторДокументаЭДО);
	КонецЕсли;
	
	Возврат ДанныеСинхронизации;
	
КонецФункции

#КонецОбласти // ДанныеДокументовЭДО

#Область ПроверкаПодписей

// Возвращает результат проверок подписей документов ЭДО.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ИдентификаторДокумента - Строка
//  * Ошибка - Неопределено,Строка
Функция ПроверитьПодписиДокументовЭДО(ИдентификаторыДокументовЭДО) Экспорт
	
	РезультатПоДокументам = Новый Массив; // См. ПроверитьПодписиДокументовЭДО
	
	ДокументыПоИдентификаторам = ДокументыПоИдентификаторам(ИдентификаторыДокументовЭДО);
	
	Для Каждого ДокументПоИдентификатору Из ДокументыПоИдентификаторам Цикл
		
		ИдентификаторДокумента = ДокументПоИдентификатору.Ключ;
		ЭлектронныйДокумент = ДокументПоИдентификатору.Значение;
		
		КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
		РезультатПроверки = ЭлектронныеДокументыЭДО.ПроверитьПодписиДокумента(ЭлектронныйДокумент, КонтекстДиагностики);
		
		Ошибка = Неопределено;
		Если Не РезультатПроверки.Успех Тогда
			
			ТекстОшибок = ОбработкаНеисправностейБЭД.ТекстОшибокКонтекстаДиагностики(КонтекстДиагностики);
			Если ЗначениеЗаполнено(ТекстОшибок) Тогда
				Ошибка = ТекстОшибок;
			Иначе
				Ошибка = НСтр("ru = 'Неизвестная ошибка'");
			КонецЕсли;
			
		КонецЕсли;
		
		РезультатПроверкиВФорматеСервиса = Новый Структура("ИдентификаторДокумента, Ошибка",
			ИдентификаторДокумента, Ошибка);
		
		РезультатПоДокументам.Добавить(РезультатПроверкиВФорматеСервиса);
		
	КонецЦикла;
	
	Возврат РезультатПоДокументам;
	
КонецФункции

#КонецОбласти // ПроверкаПодписей

#Область ПереходВЦентрЭДО

// См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.ЗагрузитьПолныеДанныеДокументаЭДО
Функция ЗагрузитьПолныеДанныеДокументаЭДО(ПолныеДанные) Экспорт
	
	Если ЦентрЭДО.АвторизованСлужебныйПользователь() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ЦентрЭДО.УстановитьПараметрыСеансаРежимЗагрузки(Истина);
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", Неопределено);
	Результат.Вставить("Сопоставление", Неопределено);
	
	Блокировка = Новый БлокировкаДанных;
	ЭтоВходящийЭДО = ПолныеДанные.Описание.ЭтоВходящийЭДО;
	ИмяТаблицыДокумента = ЭлектронныеДокументыЭДО.ИмяТаблицыДокументаЭДО(ЭтоВходящийЭДО);
	ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицыДокумента);
	ИдентификаторДокументооборота = ПолныеДанные.Описание.ИдентификаторДокументооборота;
	ЭлементБлокировки.УстановитьЗначение("ИдентификаторДокументооборота", ИдентификаторДокументооборота);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		Результат.Сопоставление = ЗагрузитьСопоставитьДокументИзПолныхДанных(ПолныеДанные);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ШаблонСообщения = СтрШаблон(НСтр("ru = 'Не удалось загрузить данные электронного документа
			|с идентификатором документооборота %1 по причине:'"), ИдентификаторДокументооборота);
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Кратко = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		Подробно = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		
		Результат.Ошибка = ШаблонСообщения + Символы.ПС + Кратко;
		
		ОбщегоНазначенияБЭД.ЗаписатьВЖурналРегистрации(ШаблонСообщения + Символы.ПС + Подробно,
			ЦентрЭДО.ИмяПодсистемы(), УровеньЖурналаРегистрации.Ошибка);
	КонецПопытки;
	
	ЦентрЭДО.УстановитьПараметрыСеансаРежимЗагрузки(Ложь);
	
	Возврат Результат;
	
КонецФункции

// См. ПрограммныйИнтерфейсЦентраЭДОВерсия3.ЗагрузитьПолныеДанныеПакетаДокументовЭДО
Функция ЗагрузитьПолныеДанныеПакетаДокументовЭДО(ПолныеДанныеПакета) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", Неопределено);
	Результат.Вставить("Сопоставление", Неопределено);
	
	Если Не ЗначениеЗаполнено(ПолныеДанныеПакета) Тогда
		Результат.Ошибка = НСтр("ru = 'Отсутствуют полные данные пакета документов ЭДО для загрузки.'");
		Возврат Результат;
	КонецЕсли;
	
	Если ЦентрЭДО.АвторизованСлужебныйПользователь() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ЦентрЭДО.УстановитьПараметрыСеансаРежимЗагрузки(Истина);
	
	Блокировка = Новый БлокировкаДанных;
	
	Для Каждого ПолныеДанные Из ПолныеДанныеПакета Цикл
		ЭтоВходящийЭДО = ПолныеДанные.Описание.ЭтоВходящийЭДО;
		ИмяТаблицыДокумента = ЭлектронныеДокументыЭДО.ИмяТаблицыДокументаЭДО(ЭтоВходящийЭДО);
		ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицыДокумента);
		ИдентификаторДокументооборота = ПолныеДанные.Описание.ИдентификаторДокументооборота;
		ЭлементБлокировки.УстановитьЗначение("ИдентификаторДокументооборота", ИдентификаторДокументооборота);
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		Сопоставление = Новый Массив; // Массив из см. ЗагрузитьСопоставитьДокументИзПолныхДанных
		ИдентификаторыДокументов = Новый Массив; // Массив из Строка
		
		Для Каждого ПолныеДанные Из ПолныеДанныеПакета Цикл
			
			СопоставлениеПоДокументу = ЗагрузитьСопоставитьДокументИзПолныхДанных(ПолныеДанные);
			Сопоставление.Добавить(СопоставлениеПоДокументу);
			
			ИдентификаторыДокументов.Добавить(СопоставлениеПоДокументу.Документ.Идентификатор);
			
		КонецЦикла;
		
		Результат.Сопоставление = Сопоставление;
		
		ИдентификаторПакета = Новый УникальныйИдентификатор(ПолныеДанныеПакета[0].Описание.ИдентификаторПакета);
		ДокументыПоИдентификаторам = ДокументыПоИдентификаторам(ИдентификаторыДокументов);
		Блокировка = Новый БлокировкаДанных;
		Для Каждого ДокументПоИдентификатору Из ДокументыПоИдентификаторам Цикл
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СоставПакетовДокументовЭДО");
			ЭлементБлокировки.УстановитьЗначение("ЭлектронныйДокумент", ДокументПоИдентификатору.Значение);
		КонецЦикла;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПакетыДокументовЭДО");
		ЭлементБлокировки.УстановитьЗначение("ИдентификаторПакета", ИдентификаторПакета);
		Блокировка.Заблокировать();
		
		ОбъединитьДокументыВПакет(ИдентификаторПакета,
			ОбщегоНазначения.ВыгрузитьКолонку(ДокументыПоИдентификаторам, "Значение"));
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ШаблонСообщения = СтрШаблон(НСтр("ru = 'Не удалось загрузить пакет электронных документов
			|с идентификатором %1 по причине:'"), Строка(ИдентификаторПакета));
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Кратко = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		Подробно = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		
		Результат.Ошибка = ШаблонСообщения + Символы.ПС + Кратко;
		
		ОбщегоНазначенияБЭД.ЗаписатьВЖурналРегистрации(ШаблонСообщения + Символы.ПС + Подробно,
			ЦентрЭДО.ИмяПодсистемы(), УровеньЖурналаРегистрации.Ошибка);
	КонецПопытки;
	
	ЦентрЭДО.УстановитьПараметрыСеансаРежимЗагрузки(Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаСобытий

Процедура ПроверитьУникальностьИдентификатораДокументаЭДОПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Источник.ЭтоНовый() Или ПустаяСтрока(Источник.ИдентификаторДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ИмяТаблицыДокумента = ЭлектронныеДокументыЭДО.ИмяТаблицыДокументаЭДО(Ложь);
	ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицыДокумента);
	ЭлементБлокировки.УстановитьЗначение("ИдентификаторДокумента", Источник.ИдентификаторДокумента);
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭлектронныйДокументИсходящийЭДО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента = &ИдентификаторДокумента";
	
	Запрос.УстановитьПараметр("ИдентификаторДокумента", Источник.ИдентификаторДокумента);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Электронный документ с идентификатором %1 уже существует'"),
			Источник.ИдентификаторДокумента);
		ВызватьИсключение(ТекстОшибки,
			КатегорияОшибки.ИсключениеВызванноеИзВстроенногоЯзыка,
			КодИсключенияДокументУжеСуществует());
	КонецЕсли;
	
КонецПроцедуры

// Возвращаемое значение:
//  Строка
Функция КодИсключенияДокументУжеСуществует()
	Возврат ЦентрЭДО.ИмяПодсистемы() + ".ДокументУжеСуществует";
КонецФункции

#КонецОбласти

#Область ОбщегоНазначения

// Параметры:
//  ИдентификаторыДокументов - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Функция ДокументыЭДО(ИдентификаторыДокументов) Экспорт
	
	ДокументыЭДО = Новый Массив; // См. ДокументыЭДО
	
	Если Не ЗначениеЗаполнено(ИдентификаторыДокументов) Тогда
		Возврат ДокументыЭДО;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлектронныйДокументВходящийЭДО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента В(&ИдентификаторыДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлектронныйДокументИсходящийЭДО.Ссылка
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента В(&ИдентификаторыДокументов)";
	
	Запрос.УстановитьПараметр("ИдентификаторыДокументов", ИдентификаторыДокументов);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		ДокументыЭДО.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ДокументыЭДО;
	
КонецФункции

// Параметры:
//  ИдентификаторДокумента - Строка
// 
// Возвращаемое значение:
//  Неопределено,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО,ДокументСсылка.ЭлектронныйДокументВходящийЭДО
Функция ДокументПоИдентификатору(ИдентификаторДокумента) Экспорт
	
	ДокументЭДО = Неопределено;
	Если Не ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
		Возврат ДокументЭДО;
	КонецЕсли;
	
	ДокументыПоИдентификаторам = ДокументыПоИдентификаторам(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторДокумента));
	
	Возврат ДокументыПоИдентификаторам[ИдентификаторДокумента];
	
КонецФункции

// Параметры:
//  ИдентификаторыДокументов - Массив из Строка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка - идентификатор документа ЭДО.
//  * Значение - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Функция ДокументыПоИдентификаторам(ИдентификаторыДокументов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭлектронныйДокументВходящийЭДО.Ссылка КАК Ссылка,
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента КАК ИдентификаторДокумента
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента В (&ИдентификаторыДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлектронныйДокументИсходящийЭДО.Ссылка КАК Ссылка,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента КАК ИдентификаторДокумента
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента В (&ИдентификаторыДокументов)";
	
	Запрос.УстановитьПараметр("ИдентификаторыДокументов", ИдентификаторыДокументов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДокументыПоИдентификаторам = Новый Соответствие;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ДокументыПоИдентификаторам;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументыПоИдентификаторам.Вставить(Выборка.ИдентификаторДокумента, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ДокументыПоИдентификаторам;
	
КонецФункции

// Параметры:
//  ДокументыЭДО - Массив из ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
// 
// Возвращаемое значение:
//  Массив из См. НовоеСостояниеДокументаЭДОВФорматеСервиса
Функция СостоянияДокументовЭДОВФорматеСервиса(ДокументыЭДО)
	
	СостоянияДокументовЭДО = Новый Массив; // См. СостоянияДокументовЭДОВФорматеСервиса
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостоянияДокументовЭДО.ЭлектронныйДокумент.ИдентификаторДокумента КАК ИдентификаторДокумента,
		|	СостоянияДокументовЭДО.Состояние КАК Состояние,
		|	СостоянияДокументовЭДО.СостояниеДополнение КАК СостояниеДополнение,
		|	СостоянияДокументовЭДО.ДатаИзменения КАК ДатаИзменения,
		|	СостоянияДокументовЭДО.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|ГДЕ
		|	СостоянияДокументовЭДО.ЭлектронныйДокумент В (&ЭлектронныеДокументы)";
	
	Запрос.УстановитьПараметр("ЭлектронныеДокументы", ДокументыЭДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СостоянияДокументовЭДО;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СостояниеДокументаЭДО = НовоеСостояниеДокументаЭДОВФорматеСервиса();
		СостояниеДокументаЭДО.ИдентификаторДокумента = Выборка.ИдентификаторДокумента;
		СостояниеДокументаЭДО.ИмяСостояния = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.Состояние);
		СостояниеДокументаЭДО.СостояниеДополнение = Выборка.СостояниеДополнение;
		СостояниеДокументаЭДО.ДатаИзменения = ОбщегоНазначенияБЭД.ДатаВФорматеISO(Выборка.ДатаИзменения);
		СостояниеДокументаЭДО.Комментарий = Выборка.Комментарий;
		СостоянияДокументовЭДО.Добавить(СостояниеДокументаЭДО);
	КонецЦикла;
	
	Возврат СостоянияДокументовЭДО
	
КонецФункции

// Параметры:
//  РеквизитыКлючейНастроек - Массив из Структура:
//  * Идентификатор - Строка
//  * Отправитель - Структура:
//    ** ИНН - Строка
//    ** КПП - Строка
//  * Получатель - Структура:
//    ** ИНН - Строка
//    ** КПП - Строка
//  * ВидДокумента - Структура:
//    ** Наименование - Строка
//    ** ТипДокумента - Строка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка - идентификатор ключа настройки.
//  * Значение - См. НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки
Функция КлючиНастроекПоРеквизитам(РеквизитыКлючейНастроек)
	
	КлючиНастроек = Новый Соответствие;
	
	РеквизитыОрганизаций = Новый Массив; // Массив из см. ИнтеграцияЭДО.НовыеКлючевыеРеквизитыУчастникаЭДО
	РеквизитыКонтрагентов = Новый Массив; // Массив из см. ИнтеграцияЭДО.НовыеКлючевыеРеквизитыУчастникаЭДО
	ВидыДокументовВФорматеСервиса = Новый Массив; // См. ВидыДокументовИзФорматаСервиса.ВидыДокументовВФорматеСервиса
	
	Для Каждого РеквизитыКлючаНастройки Из РеквизитыКлючейНастроек Цикл
		ОбщегоНазначенияБЭД.ДобавитьЗаполненноеЗначение(РеквизитыОрганизаций, РеквизитыКлючаНастройки.Отправитель);
		ОбщегоНазначенияБЭД.ДобавитьЗаполненноеЗначение(РеквизитыКонтрагентов, РеквизитыКлючаНастройки.Получатель);
		ОбщегоНазначенияБЭД.ДобавитьЗаполненноеЗначение(ВидыДокументовВФорматеСервиса, РеквизитыКлючаНастройки.ВидДокумента);
	КонецЦикла;
	
	ОрганизацииПоРеквизитам = ИнтеграцияЭДО.ОрганизацииПоКлючевымРеквизитам(РеквизитыОрганизаций);
	КонтрагентыПоРеквизитам = ИнтеграцияЭДО.КонтрагентыПоКлючевымРеквизитам(РеквизитыКонтрагентов);
	ВидыДокументовИзФорматаСервиса = ВидыДокументовИзФорматаСервиса(ВидыДокументовВФорматеСервиса);
	
	Для Каждого РеквизитыКлючаНастройки Из РеквизитыКлючейНастроек Цикл
		КлючНастройки = НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки();
		КлючНастройки.Отправитель = ИнтеграцияЭДО.ОрганизацияИзОтбораПоКлючевымРеквизитам(
			ОрганизацииПоРеквизитам, РеквизитыКлючаНастройки.Отправитель);
		КлючНастройки.Получатель = ИнтеграцияЭДО.КонтрагентИзОтбораПоКлючевымРеквизитам(
			КонтрагентыПоРеквизитам, РеквизитыКлючаНастройки.Получатель);
		КлючНастройки.ВидДокумента = ВидДокументаИзОтбораПоФорматуСервиса(ВидыДокументовИзФорматаСервиса,
			РеквизитыКлючаНастройки.ВидДокумента);
		КлючиНастроек.Вставить(РеквизитыКлючаНастройки.Идентификатор, КлючНастройки);
	КонецЦикла;
	
	Возврат КлючиНастроек;
	
КонецФункции

// Параметры:
//  ВидыДокументовВФорматеСервиса - Массив из Структура:
//  * Наименование - Строка
//  * ТипДокумента - Строка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка
//  * Значение - СправочникСсылка.ВидыДокументовЭДО
Функция ВидыДокументовИзФорматаСервиса(ВидыДокументовВФорматеСервиса) Экспорт
	
	ИменаТиповДокументов = Новый Массив; // Массив из Строка
	Для Каждого ВидДокументаВФорматеСервиса Из ВидыДокументовВФорматеСервиса Цикл
		ИменаТиповДокументов.Добавить(ВидДокументаВФорматеСервиса.ТипДокумента);
	КонецЦикла;
	Возврат ЭлектронныеДокументыЭДО.ВидыДокументовПоИменамСтандартныхТипов(ИменаТиповДокументов);
	
КонецФункции

// Параметры:
//  ВидыДокументовИзФорматаСервиса - См. ВидыДокументовИзФорматаСервиса
//  ВидДокументаВФорматеСервиса - Структура:
//  * Наименование - Строка
//  * ТипДокумента - Строка
// 
// Возвращаемое значение:
//  Неопределено,СправочникСсылка.ВидыДокументовЭДО
Функция ВидДокументаИзОтбораПоФорматуСервиса(ВидыДокументовИзФорматаСервиса, ВидДокументаВФорматеСервиса)
	Возврат ВидыДокументовИзФорматаСервиса[ВидДокументаВФорматеСервиса.ТипДокумента];
КонецФункции

// Параметры:
//  ТипДокументаВФорматеСервиса - Строка
//  МетаданныеПеречисления - Неопределено,ОбъектМетаданныхПеречисление
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыДокументовЭДО
Функция ТипДокументаИзФорматаСервиса(ТипДокументаВФорматеСервиса, МетаданныеПеречисления = Неопределено) Экспорт
	Если МетаданныеПеречисления = Неопределено Тогда
		МетаданныеПеречисления = Метаданные.Перечисления.ТипыДокументовЭДО;
	КонецЕсли;
	Возврат ОбщегоНазначенияБЭД.ЗначениеПеречисленияПоИмени(ТипДокументаВФорматеСервиса, МетаданныеПеречисления);
КонецФункции

// Параметры:
//  ВидДокументаВФорматеСервиса - Структура:
//  * Наименование - Строка
//  * ТипДокумента - Строка
// 
// Возвращаемое значение:
//  	СправочникСсылка.ВидыДокументовЭДО
Функция ВидДокументаИзФорматаСервиса(ВидДокументаВФорматеСервиса)
	
	ТипДокумента = ТипДокументаИзФорматаСервиса(ВидДокументаВФорматеСервиса.ТипДокумента);
	Возврат ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(ТипДокумента);
	
КонецФункции

// Параметры:
//  ТипРегламентаВФорматеСервиса - Строка
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыРегламентовЭДО
Функция ТипРегламентаИзФорматаСервиса(ТипРегламентаВФорматеСервиса)
	
	Возврат ОбщегоНазначенияБЭД.ЗначениеПеречисленияПоИмени(
		ТипРегламентаВФорматеСервиса, Метаданные.Перечисления.ТипыРегламентовЭДО);
	
КонецФункции

// Параметры:
//  СпособОбменаВФорматеСервиса - Строка
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СпособыОбменаЭД
Функция СпособОбменаИзФорматаСервиса(СпособОбменаВФорматеСервиса)
	
	Возврат ОбщегоНазначенияБЭД.ЗначениеПеречисленияПоИмени(
		СпособОбменаВФорматеСервиса, Метаданные.Перечисления.СпособыОбменаЭД);
	
КонецФункции

// Параметры:
//  СостояниеВФорматеСервиса - Строка
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СостоянияДокументовЭДО
Функция СостояниеДокументаИзФорматаСервиса(СостояниеВФорматеСервиса)
	
	Возврат ОбщегоНазначенияБЭД.ЗначениеПеречисленияПоИмени(
		СостояниеВФорматеСервиса, Метаданные.Перечисления.СостоянияДокументовЭДО);
	
КонецФункции

// Параметры:
//  НаправлениеВФорматеСервиса - Строка
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.НаправленияЭДО
Функция НаправлениеИзФорматаСервиса(НаправлениеВФорматеСервиса)
	
	Возврат ОбщегоНазначенияБЭД.ЗначениеПеречисленияПоИмени(
		НаправлениеВФорматеСервиса, Метаданные.Перечисления.НаправленияЭДО);
	
КонецФункции

// Параметры:
//  ТипЭлементаРегламентаВФорматаСервиса - Строка
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыЭлементовРегламентаЭДО
Функция ТипЭлементаРегламентаИзФорматаСервиса(ТипЭлементаРегламентаВФорматаСервиса)
	
	Возврат ОбщегоНазначенияБЭД.ЗначениеПеречисленияПоИмени(
		ТипЭлементаРегламентаВФорматаСервиса, Метаданные.Перечисления.ТипыЭлементовРегламентаЭДО);
	
КонецФункции

// Параметры:
//  СтатусВФорматеСервиса - Строка
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыСообщенийЭДО
Функция СтатусСообщенияИзФорматаСервиса(СтатусВФорматеСервиса)
	
	Возврат ОбщегоНазначенияБЭД.ЗначениеПеречисленияПоИмени(
		СтатусВФорматеСервиса, Метаданные.Перечисления.СтатусыСообщенийЭДО);
	
КонецФункции

// Параметры:
//  СостояниеВФорматеСервиса - Строка
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СостоянияСообщенийЭДО
Функция СостояниеСообщенияИзФорматаСервиса(СостояниеВФорматеСервиса)
	
	Возврат ОбщегоНазначенияБЭД.ЗначениеПеречисленияПоИмени(
		СостояниеВФорматеСервиса, Метаданные.Перечисления.СостоянияСообщенийЭДО);
	
КонецФункции

// Параметры:
//  ТипПодписиВФорматеСервиса - Строка
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыПодписиКриптографии
Функция ТипПодписиИзФорматаСервиса(ТипПодписиВФорматеСервиса)
	
	Возврат ОбщегоНазначенияБЭД.ЗначениеПеречисленияПоИмени(
		ТипПодписиВФорматеСервиса, Метаданные.Перечисления.ТипыПодписиКриптографии);
	
КонецФункции

// Параметры:
//  КлючиНастроек - см. КлючиНастроекПоРеквизитам
//  ИмяСвойства - Строка
// 
// Возвращаемое значение:
//  Массив из Произвольный
Функция ВыгрузитьУникальныеЗначенияСвойстваКлючейНастроек(КлючиНастроек, ИмяСвойства)
	
	ЗначенияСвойства = Новый Массив; // Массив из Произвольный
	
	Для Каждого КлючНастройкиПоИдентификатору Из КлючиНастроек Цикл
		КлючНастройки = КлючНастройкиПоИдентификатору.Значение;
		Значение = КлючНастройки[ИмяСвойства]; // Произвольный
		Если ЗначенияСвойства.Найти(Значение) = Неопределено Тогда
			ЗначенияСвойства.Добавить(Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначенияСвойства;
	
КонецФункции

// Параметры:
//  ИдентификаторыДокументов - Массив из Строка
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * Ссылка - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//  * ИдентификаторДокумента - Строка
Функция РеквизитыДокументовПоИдентификаторам(ИдентификаторыДокументов)
	
	Если Не ЗначениеЗаполнено(ИдентификаторыДокументов) Тогда
		Возврат Новый ТаблицаЗначений();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлектронныйДокументЭДО.Ссылка КАК Ссылка,
		|	ЭлектронныйДокументЭДО.ИдентификаторДокумента КАК ИдентификаторДокумента
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументЭДО
		|ГДЕ
		|	ЭлектронныйДокументЭДО.ИдентификаторДокумента В (&ИдентификаторыДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлектронныйДокументЭДО.Ссылка,
		|	ЭлектронныйДокументЭДО.ИдентификаторДокумента
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументЭДО
		|ГДЕ
		|	ЭлектронныйДокументЭДО.ИдентификаторДокумента В (&ИдентификаторыДокументов)";
	
	Запрос.УстановитьПараметр("ИдентификаторыДокументов", ИдентификаторыДокументов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Параметры:
//  ИдентификаторыФайлов - Массив из Строка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка
//  * Значение - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
Функция ФайлыПоИдентификаторам(ИдентификаторыФайлов)
	ИдентификаторыПоТипам = Новый Соответствие;
	ИдентификаторыПоТипам.Вставить(Тип("СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы"), ИдентификаторыФайлов);
	Возврат СсылкиПоИдентификаторам(ИдентификаторыПоТипам);
КонецФункции

// Параметры:
//  ИдентификаторыПоТипам - Соответствие из КлючИЗначение:
//  * Ключ - Тип
//  * Значение - Массив из Строка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка
//  * Значение - ЛюбаяСсылка
//
Функция СсылкиПоИдентификаторам(ИдентификаторыПоТипам)
	
	ШаблонЗапроса = 
		"ВЫБРАТЬ
		|	Таблица.Ссылка
		|ИЗ
		|	&ИмяТаблицы КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка В (&МассивСсылок)";
	
	ТекстыЗапросов = Новый Массив; // Массив из Строка
	
	Запрос = Новый Запрос;
	
	Счетчик = 0;
	Для Каждого ИдентификаторыПоТипу Из ИдентификаторыПоТипам Цикл
		Счетчик = Счетчик + 1;
		
		Тип = ИдентификаторыПоТипу.Ключ;
		Ссылка = Новый(Тип); // ЛюбаяСсылка
		ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(Ссылка);
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяТаблицы);
		
		МассивСсылок = Новый Массив; // Массив из ЛюбаяСсылка
		Для Каждого Идентификатор Из ИдентификаторыПоТипу.Значение Цикл
			УникальныйИдентификаторСсылки = Новый УникальныйИдентификатор(Идентификатор);
			Ссылка = МенеджерОбъекта.ПолучитьСсылку(УникальныйИдентификаторСсылки);
			МассивСсылок.Добавить(Ссылка);
		КонецЦикла;
		
		ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "&ИмяТаблицы", ИмяТаблицы);
		ИмяПараметра = "МассивСсылок" + Счетчик;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "МассивСсылок", ИмяПараметра);
		ТекстыЗапросов.Добавить(ТекстЗапроса);
		Запрос.УстановитьПараметр(ИмяПараметра, МассивСсылок);
	КонецЦикла;
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Результат = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Строка(Выборка.Ссылка.УникальныйИдентификатор()), Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Ссылка - ЛюбаяСсылка
// 
// Возвращаемое значение:
//  Строка
Функция ИдентификаторСсылки(Ссылка)
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Строка(Ссылка.УникальныйИдентификатор());
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

// Подписанные сообщения по файлам.
// 
// Параметры:
//  ПодписиФайлов - См. ДобавитьПодписиФайловДокументовЭДО.ПодписиФайлов
//  КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// 
// Возвращаемое значение:
//  Массив из см. НовоеОписаниеПодписанногоСообщения
Функция ПодписанныеСообщенияПоФайлам(ПодписиФайлов, КонтекстДиагностики)
	
	ПодписанныеСообщения = Новый Массив; // Массив из см. НовоеОписаниеПодписанногоСообщения
	
	ИдентификаторыФайлов = ОбщегоНазначения.ВыгрузитьКолонку(ПодписиФайлов, "ИдентификаторДанных");
	
	ФайлыПоИдентификаторам = ФайлыПоИдентификаторам(ИдентификаторыФайлов);
	
	ФайлыДокументовЭДО = ОбщегоНазначения.ВыгрузитьКолонку(ФайлыПоИдентификаторам, "Значение"); // Массив из см. СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
	
	СообщенияПоФайлам = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ФайлыДокументовЭДО, "ВладелецФайла");
	
	ДвоичныеДанныеФайлов = РаботаСФайлами.ДвоичныеДанныеФайлов(ФайлыДокументовЭДО);
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		ПрограммаКриптографии = Справочники.ПрограммыЭлектроннойПодписиИШифрования.НайтиПоРеквизиту("ТипПрограммы", 80);	
		МенеджерКриптографии = КриптографияБЭД.МенеджерКриптографии(,,ПрограммаКриптографии);
	Иначе
		МенеджерКриптографии = Неопределено;
	КонецЕсли;
	
	Для Каждого ПодписьФайла Из ПодписиФайлов Цикл
		
		Файл = ФайлыПоИдентификаторам[ПодписьФайла.ИдентификаторДанных];
		Если Файл = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Сообщение = СообщенияПоФайлам[Файл];
		Если Сообщение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Данные  = ДвоичныеДанныеФайлов[Файл];
		Подпись = Base64Значение(ПодписьФайла.Подпись);
		
		РезультатПроверки = КриптографияБЭД.ПроверитьПодпись(МенеджерКриптографии, Данные, Подпись, КонтекстДиагностики);
		
		Если Не ЗначениеЗаполнено(РезультатПроверки.СвойстваПодписи.Сертификат) Тогда
			МенеджерКриптографии = ЭлектроннаяПодпись.МенеджерКриптографии("ПолучениеСертификатов", Ложь);
			Если МенеджерКриптографии <> Неопределено Тогда
				Сертификаты = МенеджерКриптографии.ПолучитьСертификатыИзПодписи(Подпись);
				КриптографияБЭД.ЗаполнитьСвойстваПоСертификатамИзПодписи(РезультатПроверки.СвойстваПодписи, Сертификаты);
			КонецЕсли;
		КонецЕсли;
		
		СвойстваПодписи = РезультатПроверки.СвойстваПодписи;
		СвойстваПодписи.Подпись = Подпись;
		СвойстваПодписи.ДатаПодписи = ЭлектроннаяПодпись.ДатаПодписания(Подпись);
		СвойстваПодписи.Комментарий = РезультатПроверки.ОписаниеОшибки;
		
		ВыбранныйСертификат = ЭлектроннаяПодпись.СсылкаНаСертификат(СвойстваПодписи.Сертификат);
		
		ПодписанноеСообщение = НовоеОписаниеПодписанногоСообщения();
		ПодписанноеСообщение.Ссылка = Сообщение;
		ПодписанноеСообщение.ПрисоединенныйФайл = Файл;
		ПодписанноеСообщение.СвойстваПодписи = СвойстваПодписи;
		ПодписанноеСообщение.ВыбранныйСертификат = ВыбранныйСертификат;
		ПодписанноеСообщение.Данные = Данные;
		
		Если ЗначениеЗаполнено(ПодписьФайла.НомерДоверенности) Тогда
			ПодписанноеСообщение.ВыбраннаяМЧД = МашиночитаемыеДоверенности.ПолучитьДоверенностьИзЖурналаПоНомеру(
				ПодписьФайла.НомерДоверенности);
		КонецЕсли;
		
		ПодписанныеСообщения.Добавить(ПодписанноеСообщение);
		
	КонецЦикла;
	
	Возврат ПодписанныеСообщения;
	
КонецФункции

// Возвращает пустое описание подписанного сообщения.
// 
// Возвращаемое значение:
//  Структура - Описание:
//  * Ссылка - ДокументСсылка.СообщениеЭДО
//  		 - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  * ПрисоединенныйФайл - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
// 						 - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  * СвойстваПодписи - Неопределено
//                    - См. КриптографияБЭДКлиентСервер.НовыеСвойстваПодписи
//  * ВыбранныйСертификат - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  * Данные - Неопределено
//           - ДвоичныеДанные
//  * ОбновитьДанные - Булево
//  * ВыбраннаяМЧД   - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций 
//                   - Неопределено
//  * ТребуетсяМЧД   - Булево
//
Функция НовоеОписаниеПодписанногоСообщения()
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("Ссылка", Документы.СообщениеЭДО.ПустаяСсылка());
	ОписаниеДанных.Вставить("ПрисоединенныйФайл", Справочники.СообщениеЭДОПрисоединенныеФайлы.ПустаяСсылка());
	ОписаниеДанных.Вставить("СвойстваПодписи", Неопределено);
	ОписаниеДанных.Вставить("ВыбранныйСертификат", Справочники.СертификатыКлючейЭлектроннойПодписиИШифрования.ПустаяСсылка());
	ОписаниеДанных.Вставить("Данные", Неопределено);
	ОписаниеДанных.Вставить("ОбновитьДанные", Ложь);
	ОписаниеДанных.Вставить("ВыбраннаяМЧД", Неопределено);
	ОписаниеДанных.Вставить("ТребуетсяМЧД", Ложь);
	Возврат ОписаниеДанных;
КонецФункции

// Параметры:
//  МаркерыАвторизации - Массив из см. УчетныеЗаписиЭДОЦентрЭДО.НовыйМаркерАвторизацииПоУчетнойЗаписиЭДО
// 
// Возвращаемое значение:
//  См. КриптографияБЭДКлиентСервер.НовыйНаборРасшифрованныхДанных
Функция РасшифрованныеМаркерыИзМаркеровАвторизации(МаркерыАвторизации) Экспорт
	
	Результат = КриптографияБЭДКлиентСервер.НовыйНаборРасшифрованныхДанных();
	
	Если Не ЗначениеЗаполнено(МаркерыАвторизации) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого МаркерАвторизации Из МаркерыАвторизации Цикл
		
		Сертификат = ЭлектроннаяПодпись.СсылкаНаСертификат(МаркерАвторизации.ОтпечатокСертификата);
		ПараметрыМаркера = Новый Структура("Сертификат, Данные", Сертификат, Base64Значение(МаркерАвторизации.Данные));
		Результат.Вставить(МаркерАвторизации.ИдентификаторУчетнойЗаписиЭДО, ПараметрыМаркера);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ОтпечаткиСертификатов - Массив из Строка
// 
// Возвращаемое значение:
//  См. КриптографияБЭДКлиентСервер.НовыеРезультатыПолученияОтпечатков
Функция РезультатыПолученияОтпечатков(ОтпечаткиСертификатов)
	
	РезультатПолученияОтпечатков = КриптографияБЭДКлиентСервер.НовыйРезультатПолученияОтпечатков();
	РезультатПолученияОтпечатков.Доступность = Истина;
	РезультатПолученияОтпечатков.Отпечатки = ОтпечаткиСертификатов;
	
	РезультатыПолученияОтпечатков = КриптографияБЭДКлиентСервер.НовыеРезультатыПолученияОтпечатков();
	РезультатыПолученияОтпечатков.Клиент = РезультатПолученияОтпечатков;
	РезультатыПолученияОтпечатков.Сервер = КриптографияБЭДКлиентСервер.НовыйРезультатПолученияОтпечатков();
	РезультатыПолученияОтпечатков.Облако = КриптографияБЭДКлиентСервер.НовыйРезультатПолученияОтпечатков();
	
	Возврат РезультатыПолученияОтпечатков;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ИдентификаторДокумента - Строка
//  * ИмяСостояния - Строка
//  * СостояниеДополнение - Строка
//  * ДатаИзменения - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * Комментарий - Строка
Функция НовоеСостояниеДокументаЭДОВФорматеСервиса()
	СостояниеДокументаЭДО = Новый Структура;
	СостояниеДокументаЭДО.Вставить("ИдентификаторДокумента", "");
	СостояниеДокументаЭДО.Вставить("ИмяСостояния", "");
	СостояниеДокументаЭДО.Вставить("СостояниеДополнение", "");
	СостояниеДокументаЭДО.Вставить("ДатаИзменения", "");
	СостояниеДокументаЭДО.Вставить("Комментарий", "");
	Возврат СостояниеДокументаЭДО;
КонецФункции

// Параметры:
//  ДокументыЭДО - Массив из ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
// 
// Возвращаемое значение:
//  Массив из Строка
Функция ИдентификаторыДокументовЭДО(ДокументыЭДО) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументВходящийЭДО.Ссылка В (&ДокументыЭДО)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументИсходящийЭДО.Ссылка В (&ДокументыЭДО)";
	
	Запрос.УстановитьПараметр("ДокументыЭДО",ДокументыЭДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ИдентификаторДокумента");
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ОтпечаткиСертификатов - Массив из Строка
//  * НаборДанных - Массив из См. НовыеДанныеДляПодписанияДокументаЦентраЭДО
//  * ИспользоватьБазовыйТипПодписи - Булево - определяет необходимость использования базового типа подписи (CAdES-BES)
//                                             независимо от пользовательской настройки.
Функция НовоеОписаниеНабораДанныхДляПодписанияВЦентреЭДО()
	Описание = Новый Структура;
	Описание.Вставить("ОтпечаткиСертификатов", Новый Массив);
	Описание.Вставить("НаборДанных", Новый Массив);
	Описание.Вставить("ИспользоватьБазовыйТипПодписи", Ложь);
	Возврат Описание;
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ИдентификаторДокумента - Строка
//  * Данные - Строка - ДвоичныеДанные в формате base64.
//  * ИдентификаторДанных - Строка
//  * ТребуетсяЗаполнитьПодписанта - Булево
//  * ДоверенностиПоСертификатам - Массив из Структура:
//  ** ОтпечатокСертификата - Строка
//  ** НомерДоверенности - Строка
//  * СертификатыТребующиеДоверенность - Массив из Строка
//
Функция НовыеДанныеДляПодписанияДокументаЦентраЭДО()
	ДанныеДляПодписания = Новый Структура;
	ДанныеДляПодписания.Вставить("ИдентификаторДокумента", "");
	ДанныеДляПодписания.Вставить("Данные", "");
	ДанныеДляПодписания.Вставить("ИдентификаторДанных", "");
	ДанныеДляПодписания.Вставить("ТребуетсяЗаполнитьПодписанта", Ложь);
	ДанныеДляПодписания.Вставить("ДоверенностиПоСертификатам", Новый Массив);
	ДанныеДляПодписания.Вставить("СертификатыТребующиеДоверенность", Новый Массив);
	Возврат ДанныеДляПодписания;
КонецФункции

// Параметры:
//  ДоверенностиПоСертификатам - Соответствие из КлючИЗначение:
//  * Ключ - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  * Значение - Массив из СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций,СправочникСсылка.МЧД003
//  ОтпечаткиПоСертификатам - см. ОтпечаткиПоСертификатамУчетныхЗаписейДокументовЭДО
//  НомераДоверенностей - см. МашиночитаемыеДоверенности.ПолучитьНомераДоверенностей
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ОтпечатокСертификата - Строка 
//  * НомерДоверенности - Строка
Функция ДоверенностиДанныхДляПодписанияВФорматеСервиса(ДоверенностиПоСертификатам, ОтпечаткиПоСертификатам,
	НомераДоверенностей)
	
	Результат = Новый Массив; // См. ДоверенностиДанныхДляПодписанияВФорматеСервиса
	
	Для Каждого ДоверенностиПоСертификату Из ДоверенностиПоСертификатам Цикл
		
		Сертификат = ДоверенностиПоСертификату.Ключ;
		Доверенности = ДоверенностиПоСертификату.Значение;
		
		ОтпечатокПоСертификату = ОтпечаткиПоСертификатам.Найти(Сертификат, "Сертификат");
		Если ОтпечатокПоСертификату = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Доверенность Из Доверенности Цикл
		
			НомерДоверенности = НомераДоверенностей[Доверенность];
			Если НомерДоверенности = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДоверенностьПоСертификатуВФорматеСервиса = Новый Структура("ОтпечатокСертификата, НомерДоверенности",
				ОтпечатокПоСертификату.Отпечаток, НомерДоверенности);
			
			Результат.Добавить(ДоверенностьПоСертификатуВФорматеСервиса);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ДокументыЭДО - Массив из ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * Сертификат - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  * Отпечаток - Строка
Функция ОтпечаткиПоСертификатамУчетныхЗаписейДокументовЭДО(ДокументыЭДО)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации КАК ИдентификаторЭДО
		|ПОМЕСТИТЬ УчетныеЗаписиДокументовЭДО
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументВходящийЭДО.Ссылка В (&ДокументыЭДО)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации КАК ИдентификаторЭДО
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|ГДЕ
		|	ЭлектронныйДокументИсходящийЭДО.Ссылка В (&ДокументыЭДО)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СертификатыУчетныхЗаписейЭДО.Сертификат КАК Сертификат,
		|	СертификатыУчетныхЗаписейЭДО.Сертификат.Отпечаток КАК Отпечаток
		|ИЗ
		|	РегистрСведений.СертификатыУчетныхЗаписейЭДО КАК СертификатыУчетныхЗаписейЭДО
		|ГДЕ
		|	СертификатыУчетныхЗаписейЭДО.ИдентификаторЭДО В
		|		(ВЫБРАТЬ
		|			ИдентификаторЭДО
		|		ИЗ
		|			УчетныеЗаписиДокументовЭДО)";
	
	Запрос.УстановитьПараметр("ДокументыЭДО", ДокументыЭДО);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * Наименование - Строка
//  * ТипДокумента - Строка
Функция НовоеОписаниеВидаДокумента()
	Описание = Новый Структура;
	Описание.Вставить("Наименование", "");
	Описание.Вставить("ТипДокумента", "");
	Возврат Описание;
КонецФункции

// Возвращаемое значение:
//  Структура:
// * ИНН - Строка
// * КПП - Строка
Функция НовоеОписаниеОрганизации()
	Описание = Новый Структура;
	Описание.Вставить("ИНН", "");
	Описание.Вставить("КПП", "");
	Возврат Описание;
КонецФункции

// Параметры:
//  ПутьКМакету - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ИмяМакетаДереваИзПути(ПутьКМакету)
	
	ИмяМакета = "";
	
	Если Не ЗначениеЗаполнено(ПутьКМакету) Тогда
		Возврат ИмяМакета;
	КонецЕсли;
	
	Позиция = СтрНайти(ПутьКМакету, ".", НаправлениеПоиска.СКонца);
	Если Позиция > 0 Тогда
		Позиция = Позиция + 1;
	КонецЕсли;
	
	ИмяМакета = Сред(ПутьКМакету, Позиция);
	
	Возврат ИмяМакета;
	
КонецФункции

#КонецОбласти // КонвертацияДанных

#Область КонвертацияДереваДанных

#Область ДеревоДанныхВСтруктуру

// Параметры:
//  ДеревоУчетныхДанных - ДеревоЗначений
// 
// Возвращаемое значение:
//  Структура
//@skip-check function-return-types
Функция ДеревоУчетныхДанныхВСтруктуру(ДеревоУчетныхДанных) Экспорт
	
	СтруктураУчетныхДанных = Новый Структура;
	
	Если Не ЗначениеЗаполнено(ДеревоУчетныхДанных.Строки) Тогда
		Возврат СтруктураУчетныхДанных;
	КонецЕсли;
	
	ДобавитьСвойстваПоВложеннымСтрокамДерева(СтруктураУчетныхДанных, ДеревоУчетныхДанных);
	
	Возврат СтруктураУчетныхДанных;
	
КонецФункции

// Параметры:
//  Свойства - Структура,Массив из Структура
//  СтрокаДереваРодитель - ДеревоЗначений,СтрокаДереваЗначений
Процедура ДобавитьСвойстваПоВложеннымСтрокамДерева(Свойства, СтрокаДереваРодитель)
	
	НаборСтрокРодителя = СтрокаДереваРодитель.Строки;
	
	Если НаборСтрокРодителя.Количество() Тогда
		
		Для Каждого СтрокаДерева Из НаборСтрокРодителя Цикл
			
			ДобавитьСвойстваПоСтрокеДерева(Свойства, СтрокаДерева);
			
		КонецЦикла;
		
	Иначе
		
		ДобавитьСвойствоВСтруктуруУчетныхДанных(Свойства, СтрокаДереваРодитель);
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Свойства - Структура
//  СтрокаДерева - СтрокаДереваЗначений:
//  * ПолныйПуть - Строка
//  * Признак - Строка
Процедура ДобавитьСвойстваПоСтрокеДерева(Свойства, СтрокаДерева)
	
	ЭтоНомерСтрокиТаблицы = СтрЗаканчиваетсяНа(СтрокаДерева.ПолныйПуть, "НомерСтроки");
	
	Если ЭтоНомерСтрокиТаблицы
		ИЛИ СтрокаДерева.Признак = "Группа"
		ИЛИ СтрокаДерева.Признак = "Выбор" Тогда
		
		ДобавитьГруппуСвойствПоВложеннымСтрокамДерева(Свойства, СтрокаДерева, ЭтоНомерСтрокиТаблицы);
		
	ИначеЕсли СтрокаДерева.Признак = "Таблица" Тогда
		
		ДобавитьНаборГруппПоВложеннымСтрокамДерева(Свойства, СтрокаДерева);
		
	Иначе
		
		ДобавитьСвойстваПоВложеннымСтрокамДерева(Свойства, СтрокаДерева);
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Свойства - Структура,Массив из Структура
//  СтрокаДерева - СтрокаДереваЗначений:
//  * ПолныйПуть - Строка
//  * Признак - Строка
//  ЭтоНомерСтрокиТаблицы - Булево
Процедура ДобавитьГруппуСвойствПоВложеннымСтрокамДерева(Свойства, СтрокаДерева, ЭтоНомерСтрокиТаблицы)
	
	ГруппаСвойств = Новый Структура;
	
	ДобавитьСвойстваПоВложеннымСтрокамДерева(ГруппаСвойств, СтрокаДерева);
	
	Если Не ЗначениеЗаполнено(ГруппаСвойств) Тогда
		Возврат;
	ИначеЕсли ЭтоНомерСтрокиТаблицы Тогда
		НаборСвойств = Свойства; // Массив
		НаборСвойств.Добавить(ГруппаСвойств);
	Иначе
		ГруппаСвойствВладелец = Свойства; // Структура
		ИмяСвойства = ИмяСвойстваПоПолномуПути(СтрокаДерева.ПолныйПуть);
		ГруппаСвойствВладелец.Вставить(ИмяСвойства, ГруппаСвойств);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Свойства - Структура
//  СтрокаДерева - СтрокаДереваЗначений:
//  * ПолныйПуть - Строка
//  * Признак - Строка
Процедура ДобавитьНаборГруппПоВложеннымСтрокамДерева(Свойства, СтрокаДерева)
	
	НаборГрупп = Новый Массив;
	
	ДобавитьСвойстваПоВложеннымСтрокамДерева(НаборГрупп, СтрокаДерева);
	
	Если ЗначениеЗаполнено(НаборГрупп) Тогда
		ГруппаСвойств = Свойства; // Структура
		ИмяСвойства = ИмяСвойстваПоПолномуПути(СтрокаДерева.ПолныйПуть);
		ГруппаСвойств.Вставить(ИмяСвойства, НаборГрупп);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Свойства - Структура
//  СтрокаДерева - ДеревоЗначений,СтрокаДереваЗначений:
//  * Типы - Строка
//  * Значение - Строка,Число,ПеречислениеСсылка
Процедура ДобавитьСвойствоВСтруктуруУчетныхДанных(Свойства, СтрокаДерева)
	
	Если Не ЗначениеЗаполнено(СтрокаДерева.Значение)
		И СтрокаДерева.Значение <> 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипыЗначения = СтрокаДерева.Типы;
	
	Если   ТипыЗначения = "Строка"
		ИЛИ ТипыЗначения = "Число"
		ИЛИ ТипыЗначения = "Булево"
		ИЛИ ТипыЗначения = "Дата" Тогда
		ЗначениеСвойства = СтрокаДерева.Значение;
	ИначеЕсли СтрНачинаетсяС(ТипыЗначения, "ПеречислениеСсылка") Тогда
		ЗначениеСвойства = ОбщегоНазначения.ИмяЗначенияПеречисления(СтрокаДерева.Значение);
	Иначе
		ТипЗначения = ТипЗнч(СтрокаДерева.Значение);
		Если   ТипЗначения = Тип("Строка")
			Или ТипЗначения = Тип("Число")
			Или ТипЗначения = Тип("Булево")
			Или ТипЗначения = Тип("Дата") Тогда
			ЗначениеСвойства = СтрокаДерева.Значение;
		Иначе
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	
	Если ЗначениеСвойства <> Неопределено Тогда
		ГруппаСвойств = Свойства; // Структура
		ИмяСвойства = ИмяСвойстваПоПолномуПути(СтрокаДерева.ПолныйПуть);
		ГруппаСвойств.Вставить(ИмяСвойства, ЗначениеСвойства);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ПолныйПуть - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ИмяСвойстваПоПолномуПути(ПолныйПуть)
	Позиция = СтрНайти(ПолныйПуть, ".", НаправлениеПоиска.СКонца);
	Если Позиция > 0 Тогда
		Позиция = Позиция + 1;
	КонецЕсли;
	Возврат Сред(ПолныйПуть, Позиция);
КонецФункции

#КонецОбласти

#Область ДеревоДанныхИзСтруктуры

// Параметры:
//  СтруктураДанных - Структура
//  ФорматДерева - Строка
// 
// Возвращаемое значение:
//  См. ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента
Функция ДеревоУчетныхДанныхИзСтруктуры(СтруктураДанных, ФорматДерева)
	
	ПутьКМакету = "ОбменСКонтрагентами." + ФорматДерева;
	ДеревоДанных = ДеревоЭлектронногоДокументаБЭД.ДеревоЭлектронногоДокумента(ПутьКМакету);
	ЗагрузитьСтруктуруДанныхВСтрокуДерева(ДеревоДанных, СтруктураДанных);
	ДополнитьДеревоСлужебнымиДанными(ДеревоДанных, СтруктураДанных);
	
	Возврат ДеревоДанных;
	
КонецФункции

// Параметры:
//  ДеревоДанных - ДеревоЗначений
//  СтруктураДанных - Структура:
//  *_Операция - Строка
//  *Дата - Строка
//  *Номер - Строка
//  *Ид - Строка
Процедура ДополнитьДеревоСлужебнымиДанными(ДеревоДанных, СтруктураДанных)
	Операция = "";
	Если СтруктураДанных.Свойство("_Операция", Операция) Тогда
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗначениеВДерево(ДеревоДанных, "_Операция", Операция);
	КонецЕсли;
	Дата = "";
	Если СтруктураДанных.Свойство("Дата", Дата) И ЗначениеЗаполнено(Дата) Тогда
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗначениеВДерево(ДеревоДанных, "Дата", 
			ОбщегоНазначенияБЭД.ДатаИзФорматаISO(Дата));
	КонецЕсли;
	Номер = "";
	Если СтруктураДанных.Свойство("Номер", Номер) Тогда
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗначениеВДерево(ДеревоДанных, "Номер", Номер);
	КонецЕсли;
	Идентификатор = "";
	Если СтруктураДанных.Свойство("Ид", Идентификатор) Тогда
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗначениеВДерево(ДеревоДанных, "Ид", Идентификатор);
	КонецЕсли;
КонецПроцедуры

// Параметры:
//  СтрокаДерева - ДеревоЗначений,СтрокаДереваЗначений:
//  * Строки - КоллекцияСтрокДереваЗначений
//  * ПолныйПуть - Строка
//  * Признак - Строка
//  * Значение - Строка,Число,Булево,Структура,Массив из Структура
//  СтруктураДанных - Структура
Процедура ЗагрузитьСтруктуруДанныхВСтрокуДерева(СтрокаДерева, СтруктураДанных)
	
	ВложенныеСтроки = СтрокаДерева.Строки;
	Если Не ЗначениеЗаполнено(ВложенныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийПуть = "";
	Признак = "";
	Если ВложенныеСтроки[0].Родитель <> Неопределено Тогда
		ТекущийПуть = СтрокаДерева.ПолныйПуть + ".";
		Признак = СтрокаДерева.Признак;
	КонецЕсли;
	
	Если Признак = "Группа" Тогда
		СтрокаДерева.Значение = Истина;
	КонецЕсли;
	
	Для Каждого ЭлементСтруктуры Из СтруктураДанных Цикл
		
		ПолныйПуть = ТекущийПуть + ЭлементСтруктуры.Ключ;
		ТекущаяСтрока = ВложенныеСтроки.Найти(ПолныйПуть, "ПолныйПуть");
		Если ТекущаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Признак = "Выбор" Тогда
			СтрокаДерева.Значение = ЭлементСтруктуры.Ключ;
		КонецЕсли;
		
		Данные = ЭлементСтруктуры.Значение; // Строка,Число,Булево,Структура,Массив из Структура
		ТипДанных = ТипЗнч(Данные);
		
		Если ТипДанных = Тип("Структура") Тогда
			
			ЗагрузитьСтруктуруДанныхВСтрокуДерева(ТекущаяСтрока, Данные);
			
		ИначеЕсли ТипДанных = Тип("Массив") Тогда
			
			ЗагрузитьНаборДанныхВСтрокуДерева(ТекущаяСтрока, Данные);
			
		Иначе
			
			ЗагрузитьДанныеВСтрокуДерева(ТекущаяСтрока, Данные);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  СтрокаДерева - См. ЗагрузитьДанныеВСтрокуДерева.СтрокаДерева
//  НаборДанных - Массив из Структура
Процедура ЗагрузитьНаборДанныхВСтрокуДерева(СтрокаДерева, НаборДанных)
	
	Если СтрокаДерева.Признак <> "Таблица" Тогда
		СтрокаДерева.Значение = НаборДанных;
		Возврат;
	КонецЕсли;
	
	ВложенныеСтроки = СтрокаДерева.Строки;
	ПерваяСтрока = ВложенныеСтроки[0];
	
	НомерСтроки = 0;
	Для Каждого СтруктураДанных Из НаборДанных Цикл
		НомерСтроки = НомерСтроки + 1;
		
		Если НомерСтроки = 1 Тогда
			ТекущаяСтрока = ПерваяСтрока;
		Иначе
			ТекущаяСтрока = ВложенныеСтроки.Добавить();
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ПерваяСтрока);
			ДеревоЭлектронногоДокументаБЭДСлужебный.СкопироватьСтрокиДереваДляТаблицыРекурсивно(ТекущаяСтрока, ПерваяСтрока);
		КонецЕсли;
		
		ТекущаяСтрока.Значение = НомерСтроки;
		
		ЗагрузитьСтруктуруДанныхВСтрокуДерева(ТекущаяСтрока, СтруктураДанных);
		
	КонецЦикла;
	
	СтрокаДерева.Значение = НомерСтроки;
	
КонецПроцедуры

// Параметры:
//  СтрокаДерева - СтрокаДереваЗначений:
//  * Строки - КоллекцияСтрокДереваЗначений
//  * Типы - Строка
//  * Признак - Строка
//  * Значение - Строка,Число,Булево,Дата,Структура,Массив из Структура
//  * ПараметрыОбработкиОбязательны - Строка
//  Данные - Строка,Число,Булево
Процедура ЗагрузитьДанныеВСтрокуДерева(СтрокаДерева, Данные)
	
	Если ЗначениеЗаполнено(СтрокаДерева.Признак) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаДерева.Типы = "Дата" Тогда
		СтрокаДерева.Значение = ?(ЗначениеЗаполнено(Данные),
			ПрочитатьДатуJSON(Данные, ФорматДатыJSON.ISO), '00010101');
	Иначе
		СтрокаДерева.Значение = Данные;
	КонецЕсли;
	
	СтрокаДерева.ПараметрыОбработкиОбязательны = "Нет";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти // КонвертацияДереваДанных

#Область СформироватьДокументыЭДО

// Параметры:
//  Идентификатор - Строка
//  КонтекстДиагностики - См. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//  ВидОперации - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ЕстьОшибкаНекорректныйИдентификаторДокумента(Идентификатор, КонтекстДиагностики, ВидОперации)
	
	Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Идентификатор) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстОшибки = НСтр("ru = 'Некорректный идентификатор документа центра ЭДО.'");
	КраткоеПредставление = СтрШаблон(НСтр("ru = 'Не удалось сформировать электронный документ %1.'"),
		Идентификатор) + Символы.ПС + ТекстОшибки;
	
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
		ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
		"", КраткоеПредставление);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	
	Возврат Истина;
	
КонецФункции

// Параметры:
//  ДанныеДокументовЭДО - Массив из Структура:
//  * ИдентификаторОтправителя - Строка
//  * ИдентификаторПолучателя - Строка
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * ИдентификаторОтправителя - Строка
//  * ИдентификаторПолучателя - Строка
//  * СпособОбмена - ПеречислениеСсылка.СпособыОбменаЭД
//  * СтатусПриглашения - ПеречислениеСсылка.СтатусыПриглашений
//
Функция НастройкиОбменаМеждуУчастникамиЭДО(ДанныеДокументовЭДО)
	
	ОписаниеТипаСтрока50 = ОбщегоНазначения.ОписаниеТипаСтрока(50);
	
	ИдентификаторыУчастниковЭДО = Новый ТаблицаЗначений;
	ИдентификаторыУчастниковЭДО.Колонки.Добавить("ИдентификаторОтправителя", ОписаниеТипаСтрока50);
	ИдентификаторыУчастниковЭДО.Колонки.Добавить("ИдентификаторПолучателя", ОписаниеТипаСтрока50);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеДокументовЭДО, ИдентификаторыУчастниковЭДО);
	
	ИдентификаторыУчастниковЭДО.Свернуть("ИдентификаторОтправителя, ИдентификаторПолучателя");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИдентификаторыУчастниковЭДО.ИдентификаторОтправителя,
		|	ИдентификаторыУчастниковЭДО.ИдентификаторПолучателя
		|ПОМЕСТИТЬ ИдентификаторыУчастниковЭДО
		|ИЗ
		|	&ИдентификаторыУчастниковЭДО КАК ИдентификаторыУчастниковЭДО
		|;
		|ВЫБРАТЬ
		|	ИдентификаторыУчастниковЭДО.ИдентификаторОтправителя,
		|	ИдентификаторыУчастниковЭДО.ИдентификаторПолучателя,
		|	ЕСТЬNULL(УчетныеЗаписиЭДО.СпособОбменаЭД, ЗНАЧЕНИЕ(Перечисление.СпособыОбменаЭД.ПустаяСсылка)) КАК СпособОбмена,
		|	ЕСТЬNULL(ПриглашенияЭДО.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыПриглашений.ПустаяСсылка)) КАК СтатусПриглашения
		|ИЗ
		|	ИдентификаторыУчастниковЭДО КАК ИдентификаторыУчастниковЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетныеЗаписиЭДО КАК УчетныеЗаписиЭДО
		|		ПО ИдентификаторыУчастниковЭДО.ИдентификаторОтправителя = УчетныеЗаписиЭДО.ИдентификаторЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами КАК ПриглашенияЭДО
		|		ПО ИдентификаторыУчастниковЭДО.ИдентификаторОтправителя = ПриглашенияЭДО.ИдентификаторОрганизации
		|		И ИдентификаторыУчастниковЭДО.ИдентификаторПолучателя = ПриглашенияЭДО.ИдентификаторКонтрагента";
	
	Запрос.УстановитьПараметр("ИдентификаторыУчастниковЭДО", ИдентификаторыУчастниковЭДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НастройкиОбмена = РезультатЗапроса.Выгрузить(); // ТаблицаЗначений
	
	Возврат НастройкиОбмена;
	
КонецФункции

// Параметры:
//  НастройкиОбмена - см. НастройкиОбменаМеждуУчастникамиЭДО
//  ДанныеДокументаЭДО - Структура:
//  * ИдентификаторОтправителя - Строка
//  * ИдентификаторПолучателя - Строка
// 
// Возвращаемое значение:
//  Неопределено,СтрокаТаблицыЗначений: см. НастройкиОбменаМеждуУчастникамиЭДО
Функция НастройкаОбменаПоДаннымДокументаЭДО(НастройкиОбмена, ДанныеДокументаЭДО)
	
	ОтборНастройкиОбмена = Новый Структура("ИдентификаторОтправителя, ИдентификаторПолучателя",
		ДанныеДокументаЭДО.ИдентификаторОтправителя, ДанныеДокументаЭДО.ИдентификаторПолучателя);
	
	НастройкиОбменаПоДокументуЭДО = НастройкиОбмена.НайтиСтроки(ОтборНастройкиОбмена);
	
	Если ЗначениеЗаполнено(НастройкиОбменаПоДокументуЭДО) Тогда
		Возврат НастройкиОбменаПоДокументуЭДО[0];
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Параметры:
//  НастройкаОбмена - см. НастройкаОбменаПоДаннымДокументаЭДО
//  ДанныеДокументаЭДО - Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОтправителя - Строка
//  * ИдентификаторПолучателя - Строка
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//  ВидОперации - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ЕстьОшибкаНастройкиОбменаПоДаннымДокументаЭДО(НастройкаОбмена, ДанныеДокументаЭДО, КонтекстДиагностики, ВидОперации)
	
	БлокирующаяОшибка = Ложь;
	Если НастройкаОбмена = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Не настроен обмен между участниками ЭДО.'");
		БлокирующаяОшибка = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(НастройкаОбмена.СпособОбмена) Тогда
		ТекстОшибки = НСтр("ru = 'Не найдена учетная запись ЭДО организации.'");
		БлокирующаяОшибка = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(НастройкаОбмена.СтатусПриглашения) Тогда
		ТекстОшибки = НСтр("ru = 'Не найдено приглашение к обмену электронными документами.'");
		БлокирующаяОшибка = Истина;
	ИначеЕсли НастройкаОбмена.СтатусПриглашения <> Перечисления.СтатусыПриглашений.Принято Тогда
		ТекстОшибки = НСтр("ru = 'Приглашение к обмену электронными документами не принято.'");
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	КраткоеПредставление = СтрШаблон(НСтр("ru = 'Не удалось сформировать электронный документ %1.'"),
		ДанныеДокументаЭДО.Идентификатор) + Символы.ПС + ТекстОшибки;
	ПодробноеПредставление = КраткоеПредставление + Символы.ПС
		+ СтрШаблон(НСтр("ru = 'Статус приглашения: %1.'"),
			?(НастройкаОбмена = Неопределено Или Не ЗначениеЗаполнено(НастройкаОбмена.СтатусПриглашения),
			НСтр("ru = '<отсутствует>'"), НастройкаОбмена.СтатусПриглашения));
	
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
		ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
		ПодробноеПредставление, КраткоеПредставление);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	
	Возврат БлокирующаяОшибка;
	
КонецФункции

// Параметры:
//  КлючНастройки - см. НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки
//  ДанныеДокументаЭДО - Структура:
//  * Идентификатор - Строка
//  * Отправитель - Структура:
//  ** ИНН - Строка
//  ** КПП - Строка
//  * Получатель - Структура:
//  ** ИНН - Строка
//  ** КПП - Строка
//  * Договор - Структура:
//  ** Наименование - Строка
//  ** Номер - Строка
//  ** Дата - Дата
//  ** Сторона1 - Структура:
//  *** ИНН - Строка
//  *** КПП - Строка
//  ** Сторона2 - Структура:
//  *** ИНН - Строка
//  *** КПП - Строка
//  * ВидДокумента - Структура:
//  ** Наименование - Строка
//  ** ТипДокумента - Строка
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//  ВидОперации - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ЕстьОшибкаКлючаНастройкиОтправкиПоДаннымДокументаЭДО(КлючНастройки, ДанныеДокументаЭДО, КонтекстДиагностики, ВидОперации)
	
	Если КлючНастройки = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Ошибка заполнения значений по реквизитам.'");
	ИначеЕсли Не ЗначениеЗаполнено(КлючНастройки.Отправитель)
		И ЗначениеЗаполнено(ДанныеДокументаЭДО.Отправитель) Тогда
		ИНН = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокументаЭДО.Отправитель, "ИНН", "");
		КПП = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокументаЭДО.Отправитель, "КПП", "");
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось найти отправителя по ИНН/КПП %1/%2'"), ИНН, КПП);
	ИначеЕсли Не ЗначениеЗаполнено(КлючНастройки.Получатель) 
		И ЗначениеЗаполнено(ДанныеДокументаЭДО.Получатель) Тогда
		ИНН = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокументаЭДО.Получатель, "ИНН", "");
		КПП = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокументаЭДО.Получатель, "КПП", "");
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось найти отправителя по ИНН/КПП %1/%2'"), ИНН, КПП);
	ИначеЕсли Не ЗначениеЗаполнено(КлючНастройки.ВидДокумента)
		И ЗначениеЗаполнено(ДанныеДокументаЭДО.ВидДокумента) Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не найден вид документа ""%1"" по типу ""%2"".'"),
			ДанныеДокументаЭДО.ВидДокумента.Наименование, ДанныеДокументаЭДО.ВидДокумента.ТипДокумента);
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
	КраткоеПредставление = СтрШаблон(НСтр("ru = 'Не удалось сформировать электронный документ %1.'"),
		ДанныеДокументаЭДО.Идентификатор) + Символы.ПС + ТекстОшибки;
	
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
		ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
		"", КраткоеПредставление);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	
	Возврат Истина;
	
КонецФункции

// Параметры:
//  ДанныеДокументаЭДО - Структура:
//  * Идентификатор - Строка
//  * Формат - Строка
//  * ВидДокумента - Структура:
//    ** Наименование - Строка
//    ** ТипДокумента - Строка
//  * ТребуетсяОтветнаяПодпись - Булево
//  * ТребуетсяИзвещениеОПолучении - Булево
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//  ВидОперации - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ЕстьОшибкаНастройкиРегламентаПоДаннымДокументаЭДО(ДанныеДокументаЭДО, КонтекстДиагностики, ВидОперации)
	
	ТипДокумента = ТипДокументаИзФорматаСервиса(ДанныеДокументаЭДО.ВидДокумента.ТипДокумента);
	
	ОписаниеВидаДокумента = Новый Структура;
	ОписаниеВидаДокумента.Вставить("ТипДокумента", ТипДокумента);
	ОписаниеВидаДокумента.Вставить("ПрикладнойТипДокумента", Неопределено);
	ОписаниеВидаДокумента.Вставить("ИдентификаторКомандыПечати", "");
	ОписаниеВидаДокумента.Вставить("ИдентификаторОбъектаУчета", "");
	
	НастройкиРегламента = ЭлектронныеДокументыЭДО.НастройкиРегламента(ОписаниеВидаДокумента, ДанныеДокументаЭДО.Формат);
	
	ТекстОшибки = "";
	
	Если НастройкиРегламента.ТребуетсяИзвещениеОПолучении <> ДанныеДокументаЭДО.ТребуетсяИзвещениеОПолучении
		И Не НастройкиРегламента.РедактироватьИзвещение Тогда
		ТекстОшибки = НСтр("ru = 'Изменение требования извещения о получении недоступно'");
	КонецЕсли;
	
	Если НастройкиРегламента.ТребуетсяОтветнаяПодпись <> ДанныеДокументаЭДО.ТребуетсяОтветнаяПодпись
		И Не НастройкиРегламента.РедактироватьОтветнуюПодпись Тогда
		ТекстОшибки = НСтр("ru = 'Изменение требования ответной подписи недоступно'");
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстОшибки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КраткоеПредставление = СтрШаблон(НСтр("ru = 'Не удалось сформировать электронный документ %1.'"),
		ДанныеДокументаЭДО.Идентификатор) + Символы.ПС + ТекстОшибки;
	
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
		ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
		"", КраткоеПредставление);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	
	Возврат Истина;
	
КонецФункции

// Параметры:
//  ФорматыЭлектронныхДокументов - см. ФорматыЭДО.ФорматыЭлектронныхДокументов
//  ДанныеДокументаЭДО - Структура:
//  * Идентификатор - Строка
//  * Формат - Строка
//  ВидДокумента - СправочникСсылка.ВидыДокументовЭДО
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//  ВидОперации - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ЕстьОшибкаФорматаПоДаннымДокументаЭДО(ФорматыЭлектронныхДокументов, ДанныеДокументаЭДО, ВидДокумента, КонтекстДиагностики, ВидОперации)
	
	ОтборФормата = Новый Структура("ВидДокумента, ИдентификаторФормата", ВидДокумента, ДанныеДокументаЭДО.Формат);
	
	НайденныеФорматы = ФорматыЭлектронныхДокументов.НайтиСтроки(ОтборФормата);
	
	Если ЗначениеЗаполнено(НайденныеФорматы) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстОшибки = СтрШаблон(НСтр("ru = 'Формат %1 не поддерживается для вида документа %2.'"),
		ДанныеДокументаЭДО.Формат, ВидДокумента);
	
	КраткоеПредставление = СтрШаблон(НСтр("ru = 'Не удалось сформировать электронный документ %1.'"),
		ДанныеДокументаЭДО.Идентификатор) + Символы.ПС + ТекстОшибки;
	
	Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
		ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
		"", КраткоеПредставление);
	ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
	ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
	
	Возврат Истина;
	
КонецФункции

// Возвращаемое значение:
//  Структура - данные для заполнения:
//   * ВерсияПрограммы - Строка - версия программы, с помощью которой сформирован файл. По умолчанию "1С:Предприятие 8".
//   * УникальныйИдентификатор - Строка- 36 символьный глобально уникальный идентификатор.
//   * Участники - Структура - участники ЭДО:
//    ** ИдентификаторОтправителя - Строка - идентификатор отправителя.
//    ** ИдентификаторПолучателя - Строка - идентификатор получателя.
//    ** Оператор - Структура - информация об операторе ЭДО отправителя:
//     *** Наименование - Строка - наименование оператора.
//     *** ИНН - Строка - ИНН оператора.
//     *** Идентификатор - Строка - идентификатор отправителя.
//
Функция НовыеДанныеДляФормированияОсновногоТитула()
	Данные = Новый Структура;
	Данные.Вставить("ВерсияПрограммы", "1С:Предприятие 8");
	Данные.Вставить("УникальныйИдентификатор", "");
	Данные.Вставить("Участники", Новый Структура);
	Данные.Участники.Вставить("ИдентификаторОтправителя", "");
	Данные.Участники.Вставить("ИдентификаторПолучателя", "");
	Данные.Участники.Вставить("Оператор", Новый Структура);
	Данные.Участники.Оператор.Вставить("Наименование", "");
	Данные.Участники.Оператор.Вставить("ИНН", "");
	Данные.Участники.Оператор.Вставить("Идентификатор", "");
	Возврат Данные;
КонецФункции

// Параметры:
//  Данные - ДеревоЗначений
//  ДополнительныеДанные - Структура
Процедура ДополнитьДеревоУчетныхДанных(Данные, ДополнительныеДанные)
	
	Для Каждого КлючЗначение Из ДополнительныеДанные Цикл
		Путь = КлючЗначение.Ключ;
		Значение = КлючЗначение.Значение;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗначениеВДерево(Данные, Путь, Значение);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  УчетныеДанные - Структура:
//  * Данные - Структура
//  * Формат - Строка
//  НастройкиДокумента - См. ЭлектронныеДокументыЭДО.НовыеНастройкиОтправкиДокумента
// 
// Возвращаемое значение:
//  См. ФорматыЭДО.СформироватьДокумент
Функция СформироватьФайлыДокументаПоУчетнымДанным(УчетныеДанные, НастройкиДокумента)
	
	ДеревоУчетныхДанных = ДеревоУчетныхДанныхИзСтруктуры(УчетныеДанные.Данные, УчетныеДанные.Формат);
	
	ДанныеДляФормирования = НовыеДанныеДляФормированияОсновногоТитула();
	ДанныеДляФормирования.УникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
	ДанныеДляФормирования.Участники.ИдентификаторОтправителя = НастройкиДокумента.ИдентификаторОрганизации;
	ДанныеДляФормирования.Участники.ИдентификаторПолучателя = НастройкиДокумента.ИдентификаторКонтрагента;
	
	СведенияОбОператоре = СинхронизацияЭДО.СведенияОбОператоре(НастройкиДокумента.ИдентификаторОрганизации);
	ДанныеДляФормирования.Участники.Оператор.Наименование = СведенияОбОператоре.Наименование;
	ДанныеДляФормирования.Участники.Оператор.ИНН = СведенияОбОператоре.ИНН;
	ДанныеДляФормирования.Участники.Оператор.Идентификатор = СведенияОбОператоре.Идентификатор;
	
	ДополнитьДеревоУчетныхДанных(ДеревоУчетныхДанных, ДанныеДляФормирования);
	
	ФайлыДокументаЭДО = ФорматыЭДО.СформироватьДокумент(НастройкиДокумента.Формат, ДеревоУчетныхДанных);
	
	Возврат ФайлыДокументаЭДО;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ИмяФайла - Строка
//  * Данные - Строка - двоичные данные в формате base64.
Функция НовыйФайлДокументаЭДОВФорматеСервиса()
	Файл = Новый Структура;
	Файл.Вставить("ИмяФайла", "");
	Файл.Вставить("Данные", "");
	Возврат Файл;
КонецФункции

// Параметры:
//  ЭлектронныеДокументы - Массив из ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
// 
// Возвращаемое значение:
//  Массив из см. НовоеОписаниеДокументаЭДО
Функция ОписанияИсходящихДокументов(ЭлектронныеДокументы)
	
	Выборка = ВыбратьИсходящиеДокументыДляОписания(ЭлектронныеДокументы);
	ОписанияДокументовЭДО = Новый Массив; // Массив из см. НовоеОписаниеДокументаЭДО
	Пока Выборка.Следующий() Цикл
		ОписаниеДокументаЭДО = ОписаниеДокументаЭДОПоВыборкеДанных(Выборка);
		ОписанияДокументовЭДО.Добавить(ОписаниеДокументаЭДО);
	КонецЦикла;
	Возврат ОписанияДокументовЭДО;
	
КонецФункции

// Параметры:
//  ЭлектронныеДокументы - Массив из ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  * ЭтоВходящийЭДО - Булево
//  * ИдентификаторДокумента - Строка
//  * ФорматОсновногоТитула - Строка
//  * ВидДокумента - СправочникСсылка.ВидыДокументовЭДО
//  * ВидДокументаНаименование - Строка
//  * ВидДокументаТипДокумента - ПеречислениеСсылка.ТипыДокументовЭДО
//  * Организация - СправочникСсылка.Организации
//  * ОрганизацияИНН - Строка
//  * ОрганизацияКПП - Строка
//  * Контрагент - СправочникСсылка.Организации
//  * КонтрагентИНН - Строка
//  * КонтрагентКПП - Строка
//  * Договор - СправочникСсылка.ДоговорыКонтрагентов
//  * ДоговорНаименование - Строка
//  * ДоговорНомер - Строка
//  * ДоговорДата - Дата
//  * НомерДокумента - Строка
//  * ДатаДокумента - Дата
//  * ДатаАннулирования - Дата
//  * ДатаОтправкиПолучения - Дата
//  * ДатаПодписания - Дата
//  * СуммаДокумента - Число
//  * СпособОбмена - ПеречислениеСсылка.СпособыОбменаЭД
//  * ТипРегламента - ПеречислениеСсылка.ТипыРегламентовЭДО
//  * ТребуетсяИзвещение - Булево
//  * ТребуетсяПодтверждение - Булево
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторКонтрагента - Строка
//  * ИдентификаторДокументооборота - Строка
//  * Состояние - ПеречислениеСсылка.СостоянияДокументовЭДО
//  * СостояниеДополнение - Строка
//  * ДатаИзмененияСостояния - Дата
//  * КомментарийСостояния - Строка
//  * ИдентификаторПакета - УникальныйИдентификатор
//
Функция ВыбратьИсходящиеДокументыДляОписания(ЭлектронныеДокументы)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК ЭтоВходящийЭДО,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента КАК ИдентификаторДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.ФорматОсновногоТитула КАК ФорматОсновногоТитула,
		|	ЭлектронныйДокументИсходящийЭДО.ВидДокумента КАК ВидДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.ВидДокумента.Наименование КАК ВидДокументаНаименование,
		|	ЭлектронныйДокументИсходящийЭДО.ВидДокумента.ТипДокумента КАК ВидДокументаТипДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.Организация КАК Организация,
		|	ЭлектронныйДокументИсходящийЭДО.Организация.ИНН КАК ОрганизацияИНН,
		|	ЭлектронныйДокументИсходящийЭДО.Организация.КПП КАК ОрганизацияКПП,
		|	ЭлектронныйДокументИсходящийЭДО.Контрагент КАК Контрагент,
		|	ЭлектронныйДокументИсходящийЭДО.Контрагент.ИНН КАК КонтрагентИНН,
		|	ЭлектронныйДокументИсходящийЭДО.Контрагент.КПП КАК КонтрагентКПП,
		|	ЭлектронныйДокументИсходящийЭДО.НомерДокумента КАК НомерДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.ДатаДокумента КАК ДатаДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.ДатаАннулирования КАК ДатаАннулирования,
		|	ЭлектронныйДокументИсходящийЭДО.ДатаОтправки КАК ДатаОтправкиПолучения,
		|	ЭлектронныйДокументИсходящийЭДО.ДатаПодписания КАК ДатаПодписания,
		|	ЭлектронныйДокументИсходящийЭДО.СуммаДокумента КАК СуммаДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.СпособОбмена КАК СпособОбмена,
		|	ЭлектронныйДокументИсходящийЭДО.ТипРегламента КАК ТипРегламента,
		|	ЭлектронныйДокументИсходящийЭДО.ТребуетсяИзвещение КАК ТребуетсяИзвещение,
		|	ЭлектронныйДокументИсходящийЭДО.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторКонтрагента КАК ИдентификаторКонтрагента,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокументооборота КАК ИдентификаторДокументооборота,
		|	СостоянияДокументовЭДО.Состояние КАК Состояние,
		|	СостоянияДокументовЭДО.СостояниеДополнение КАК СостояниеДополнение,
		|	СостоянияДокументовЭДО.ДатаИзменения КАК ДатаИзмененияСостояния,
		|	СостоянияДокументовЭДО.Комментарий КАК КомментарийСостояния,
		|	ЕСТЬNULL(СоставПакетовДокументовЭДО.ИдентификаторПакета, """") КАК ИдентификаторПакета
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|		ПО ЭлектронныйДокументИсходящийЭДО.Ссылка = СостоянияДокументовЭДО.ЭлектронныйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставПакетовДокументовЭДО КАК СоставПакетовДокументовЭДО
		|		ПО ЭлектронныйДокументИсходящийЭДО.Ссылка = СоставПакетовДокументовЭДО.ЭлектронныйДокумент
		|ГДЕ
		|	ЭлектронныйДокументИсходящийЭДО.Ссылка В (&ЭлектронныеДокументы)";
	
	Запрос.УстановитьПараметр("ЭлектронныеДокументы", ЭлектронныеДокументы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции

#КонецОбласти

#Область СформироватьОтветныйТитул

// Параметры:
//  УчетныеДанныеВФорматеСервиса - Структура - данные прикладного решения:
//  * Данные - Структура - учетные данные для конвертации.
//  * Формат - Строка - формат учетных данных.
// 
// Возвращаемое значение:
//  См. ЭлектронныеДокументыЭДО.СформироватьОтветПоДокументу.ДанныеОбъектаУчета
Функция УчетныеДанныеОтветногоТитулаИзФорматаСервиса(УчетныеДанныеВФорматеСервиса)
	
	Возврат ДеревоУчетныхДанныхИзСтруктуры(
		УчетныеДанныеВФорматеСервиса.Данные, УчетныеДанныеВФорматеСервиса.Формат); // См. УчетныеДанныеОтветногоТитулаИзФорматаСервиса
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеДанныхДляПодписанияПоВыбраннымСертификатам

// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  ОтпечаткиСертификатов - Массив из Строка
//  ОбработатьТолькоИзвещения - Булево
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из см. ЦентрЭДО.НоваяОшибкаВФорматеСервиса
//  * ДанныеДляПодписания - Массив из См. НовоеОписаниеНабораДанныхДляПодписанияВЦентреЭДО
Функция ПодготовитьДанныеДляПодписания(ИдентификаторыДокументовЭДО, ОтпечаткиСертификатов, ОбработатьТолькоИзвещения = Ложь)
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибки", Неопределено);
	Результат.Вставить("ДанныеДляПодписания", Новый Массив);
	
	РеквизитыДокументовЭДО = РеквизитыДокументовПоИдентификаторам(ИдентификаторыДокументовЭДО);
	ДокументыЭДО = РеквизитыДокументовЭДО.ВыгрузитьКолонку("Ссылка");
	
	ОтпечаткиПоСертификатам = ОтпечаткиПоСертификатамУчетныхЗаписейДокументовЭДО(ДокументыЭДО);
	ОтпечаткиДляДокументовЭДО = ОтпечаткиПоСертификатам.ВыгрузитьКолонку("Отпечаток");
	
	ОтпечаткиДляПодписания = ОбщегоНазначенияБЭД.ПересечениеМассивов(ОтпечаткиДляДокументовЭДО, ОтпечаткиСертификатов);
	
	РезультатыПолученияОтпечатков = РезультатыПолученияОтпечатков(ОтпечаткиДляПодписания);
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	ДанныеДляПодписанияПоТипам = ЭлектронныеДокументыЭДО.ДанныеДляПодписанияСообщенийПоДокументамЭДО(ДокументыЭДО,
		РезультатыПолученияОтпечатков, КонтекстДиагностики, ОбработатьТолькоИзвещения);
	
	Если Не ЗначениеЗаполнено(ДанныеДляПодписанияПоТипам.ДанныеДляИнтерактивногоПодписания) Тогда
		Ошибки = ЦентрЭДО.ВыгрузитьОшибкиВФорматеСервиса(КонтекстДиагностики);
		Если ЗначениеЗаполнено(Ошибки) Тогда
			Результат.Ошибки = Ошибки;
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	
	ДанныеДляПодписания = Результат.ДанныеДляПодписания; // Массив из см. НовоеОписаниеНабораДанныхДляПодписанияВЦентреЭДО
	
	СообщенияДокументовЭДО = Новый Массив; // Массив из ДокументСсылка.СообщениеЭДО
	ДоверенностиПоСертификатам = Новый Соответствие;
	Для Каждого ОписаниеНабораДанных Из ДанныеДляПодписанияПоТипам.ДанныеДляИнтерактивногоПодписания Цикл
		Для Каждого ДанныеНабора Из ОписаниеНабораДанных.НаборДанных Цикл
			СообщенияДокументовЭДО.Добавить(ДанныеНабора.Представление.Значение);
			ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ДоверенностиПоСертификатам, ДанныеНабора.Доверенности, Истина);
		КонецЦикла;
	КонецЦикла;
	
	ЗначенияРеквизитовПоСообщениям = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		СообщенияДокументовЭДО, "ЭлектронныйДокумент");
	
	Доверенности = Новый Массив; // Массив из СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций,СправочникСсылка.МЧД003
	Для Каждого ДоверенностиПоСертификату Из ДоверенностиПоСертификатам Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Доверенности, ДоверенностиПоСертификату.Значение);
	КонецЦикла;
	НомераДоверенностей = МашиночитаемыеДоверенности.ПолучитьНомераДоверенностей(Доверенности);
	
	Для Каждого ОписаниеНабораДанных Из ДанныеДляПодписанияПоТипам.ДанныеДляИнтерактивногоПодписания Цикл
		
		ОписаниеНабораДанныхЦентраЭДО = НовоеОписаниеНабораДанныхДляПодписанияВЦентреЭДО();
		
		ОтпечаткиСертификатов = ОписаниеНабораДанныхЦентраЭДО.ОтпечаткиСертификатов;
		
		Для Каждого Сертификат Из ОписаниеНабораДанных.Сертификаты Цикл
			ОтпечатокПоСертификату = ОтпечаткиПоСертификатам.Найти(Сертификат, "Сертификат");
			Если ОтпечатокПоСертификату <> Неопределено Тогда
				ОтпечаткиСертификатов.Добавить(ОтпечатокПоСертификату.Отпечаток);
			КонецЕсли;
		КонецЦикла;
		
		СертификатыТребующиеДоверенность = Новый Массив; // Массив из Строка
		Для Каждого Элемент Из ОписаниеНабораДанных.СертификатыТребующиеДоверенность Цикл
			Сертификат = Элемент.Ключ;
			ОтпечатокПоСертификату = ОтпечаткиПоСертификатам.Найти(Сертификат, "Сертификат");
			Если ОтпечатокПоСертификату <> Неопределено Тогда
				СертификатыТребующиеДоверенность.Добавить(ОтпечатокПоСертификату.Отпечаток);
			КонецЕсли;
		КонецЦикла;
		
		НаборДанныхЦентраЭДО = ОписаниеНабораДанныхЦентраЭДО.НаборДанных;
		
		Для Каждого ДанныеНабора Из ОписаниеНабораДанных.НаборДанных Цикл
			
			РеквизитыСообщения = ЗначенияРеквизитовПоСообщениям[ДанныеНабора.Представление.Значение];
			РеквизитыДокумента = РеквизитыДокументовЭДО.Найти(РеквизитыСообщения.ЭлектронныйДокумент, "Ссылка");
			ИдентификаторДокумента = ?(РеквизитыДокумента <> Неопределено, РеквизитыДокумента.ИдентификаторДокумента, "");
			
			ДанныеНабораЦентраЭДО = НовыеДанныеДляПодписанияДокументаЦентраЭДО();
			ДанныеНабораЦентраЭДО.ИдентификаторДокумента = ИдентификаторДокумента;
			ДанныеНабораЦентраЭДО.ИдентификаторДанных = ИдентификаторСсылки(ДанныеНабора.ПрисоединенныйФайл);
			ДанныеНабораЦентраЭДО.ТребуетсяЗаполнитьПодписанта = ДанныеНабора.ТребуетсяЗаполнитьПодписанта;
			ДанныеНабораЦентраЭДО.СертификатыТребующиеДоверенность = СертификатыТребующиеДоверенность;
			
			Если Не ДанныеНабора.ТребуетсяЗаполнитьПодписанта Тогда
				ДанныеНабораЦентраЭДО.Данные = Base64Строка(ДанныеНабора.ИсходныеДвоичныеДанные);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеНабора.Доверенности) Тогда
				ДанныеНабораЦентраЭДО.ДоверенностиПоСертификатам = ДоверенностиДанныхДляПодписанияВФорматеСервиса(
					ДанныеНабора.Доверенности, ОтпечаткиПоСертификатам, НомераДоверенностей);
			КонецЕсли;
			
			НаборДанныхЦентраЭДО.Добавить(ДанныеНабораЦентраЭДО);
			
		КонецЦикла;
		
		ОписаниеНабораДанныхЦентраЭДО.ИспользоватьБазовыйТипПодписи =
			ОписаниеНабораДанных.ИспользоватьБазовыйТипПодписи;
		
		ДанныеДляПодписания.Добавить(ОписаниеНабораДанныхЦентраЭДО);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ФайлыДокументовЭДО - Массив из СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * ФайлДокументаЭДО - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  * ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
//  * Состояние - ПеречислениеСсылка.СостоянияДокументовЭДО
Функция СостоянияДокументовЭДОПоФайлам(ФайлыДокументовЭДО)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СообщениеЭДОПрисоединенныеФайлы.Ссылка КАК ФайлДокументаЭДО,
		|	СообщениеЭДО.ЭлектронныйДокумент,
		|	СостоянияДокументовЭДО.Состояние
		|ИЗ
		|	Справочник.СообщениеЭДОПрисоединенныеФайлы КАК СообщениеЭДОПрисоединенныеФайлы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО СообщениеЭДОПрисоединенныеФайлы.ВладелецФайла = СообщениеЭДО.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|		ПО СообщениеЭДО.ЭлектронныйДокумент = СостоянияДокументовЭДО.ЭлектронныйДокумент
		|ГДЕ
		|	СообщениеЭДОПрисоединенныеФайлы.Ссылка В (&ФайлыДокументовЭДО)";
	
	Запрос.УстановитьПараметр("ФайлыДокументовЭДО", ФайлыДокументовЭДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Файлы документов ЭДОДля заполнения по сертификату.
// 
// Параметры:
//  ИдентификаторыДанных - Массив из Строка
//  ФайлыПоИдентификаторам - см. ФайлыПоИдентификаторам
//  СостоянияДокументовЭДОПоФайлам - см. СостоянияДокументовЭДОПоФайлам
//  Сертификат - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
Функция ФайлыДокументовЭДОДляЗаполненияПоСертификату(ИдентификаторыДанных, ФайлыПоИдентификаторам, СостоянияДокументовЭДОПоФайлам, Сертификат, КонтекстДиагностики)
	
	ФайлыДокументовЭДО = Новый Массив; // Массив из СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
	
	ВидОперации = НСтр("ru = 'Заполнение подписанта по сертификату'");
	
	Для Каждого ИдентификаторДанных Из ИдентификаторыДанных Цикл
		
		ФайлДокументаЭДО = ФайлыПоИдентификаторам[ИдентификаторДанных];
		Если Не ЗначениеЗаполнено(ФайлДокументаЭДО) Тогда
			КраткоеПредставление = СтрШаблон(НСтр("ru = 'Не найдены данные электронного документа по идентификатору %1'"),
				ИдентификаторДанных);
			ПодробноеПредставление = СтрШаблон(НСтр("ru = 'Не удалось заполнить подписанта по сертификату ""%1""'"),
				Сертификат) + Символы.ПС + КраткоеПредставление;
			Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
				ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
				ПодробноеПредставление, КраткоеПредставление);
			ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
			ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
			Продолжить;
		КонецЕсли;
		
		СостояниеДокументаЭДО = СостоянияДокументовЭДОПоФайлам.Найти(ФайлДокументаЭДО, "ФайлДокументаЭДО");
		Если СостояниеДокументаЭДО = Неопределено
			И СостояниеДокументаЭДО.Состояние <> Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещения
			И СостояниеДокументаЭДО.Состояние <> Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеИзвещенияПоОтклонению
			И СостояниеДокументаЭДО.Состояние <> Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеОтклонения
			И СостояниеДокументаЭДО.Состояние <> Перечисления.СостоянияДокументовЭДО.ТребуетсяПодписаниеАннулирования Тогда
			КраткоеПредставление = СтрШаблон(
				НСтр("ru = 'Изменение данных электронного документа по идентификатору %1 недоступно'"),
				ИдентификаторДанных);
			ПодробноеПредставление = СтрШаблон(НСтр("ru = 'Не удалось заполнить подписанта по сертификату ""%1""'"),
				Сертификат) + Символы.ПС + КраткоеПредставление;
			Ошибка = ОбработкаНеисправностейБЭД.НоваяОшибка(ВидОперации,
				ОбработкаНеисправностейБЭДКлиентСервер.ВидОшибкиНеизвестнаяОшибка(),
				ПодробноеПредставление, КраткоеПредставление);
			ПодсистемыБЭД = ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД();
			ОбработкаНеисправностейБЭД.ДобавитьОшибку(КонтекстДиагностики, Ошибка, ПодсистемыБЭД.ОбменСКонтрагентами);
			Продолжить;
		КонецЕсли;
		
		ФайлыДокументовЭДО.Добавить(ФайлДокументаЭДО);
		
	КонецЦикла;
	
	Возврат ФайлыДокументовЭДО;
	
КонецФункции

// Параметры:
//  ФайлыДокументовЭДО - Массив из СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  Сертификат - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования
//  Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//  КонтекстДиагностики - см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
// 
// Возвращаемое значение:
//  См. ЭлектронныеДокументыЭДОСлужебный.ЗаполнитьПодписантовИДоверенностиПоСертификату
Функция ЗаполнитьПодписантовИДоверенностиПоСертификату(ФайлыДокументовЭДО, Сертификат, Доверенность, КонтекстДиагностики)
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ТребуетсяЗаполнитьПодписанта", Истина);
	ПараметрыЗаполнения.Вставить("ТребуетсяДоверенность", Ложь);
	ПараметрыЗаполнения.Вставить("НаборМЧД",  Новый Массив);
	ПараметрыЗаполнения.Вставить("Данные",  Неопределено);
	
	НаборМЧД = ПараметрыЗаполнения.НаборМЧД; // Массив из см. ЗаполнитьПодписантовИДоверенностиПоСертификату.Доверенность
	
	Если ЗначениеЗаполнено(Доверенность) Тогда
		ПараметрыЗаполнения.ТребуетсяДоверенность = Истина;
		НаборМЧД.Добавить(Доверенность);
	КонецЕсли;
	
	ДанныеДляЗаполнения = Новый Соответствие;
	
	Для Каждого ФайлДокументаЭДО Из ФайлыДокументовЭДО Цикл
		
		ДанныеДляЗаполнения.Вставить(ФайлДокументаЭДО, ПараметрыЗаполнения);
		
	КонецЦикла;
	
	РезультатыПоФайлам = ЭлектронныеДокументыЭДОСлужебный.ЗаполнитьПодписантовИДоверенностиПоСертификату(
		ДанныеДляЗаполнения, Сертификат, КонтекстДиагностики, Доверенность);
	
	Возврат РезультатыПоФайлам;
	
КонецФункции

#КонецОбласти

#Область ОтправитьДокументыЭДО

// Возвращает результат отправки электронных документов по ЭДО.
// 
// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  МаркерыАвторизации - Массив из См. НовыйМаркерАвторизацииПоУчетнойЗаписиЭДО
//  ОбработатьТолькоИзвещения - Булево
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из См. НовоеСостояниеДокументаЭДОВФорматеСервиса
//  * ЗашифрованныеМаркеры - Неопределено
//                         - Массив из См. НовыйМаркерАвторизацииПоУчетнойЗаписиЭДО
Функция ОправитьСообщенияПоДокументамЭДО(ИдентификаторыДокументовЭДО, МаркерыАвторизации = Неопределено,
	ОбработатьТолькоИзвещения = Ложь)
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибки", Неопределено);
	Результат.Вставить("СостоянияДокументовЭДО", Новый Массив);
	Результат.Вставить("ЗашифрованныеМаркеры", Неопределено);
	
	ПараметрыВыполнения = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполнения.ОбъектыДействий.ЭлектронныеДокументы = ДокументыЭДО(ИдентификаторыДокументовЭДО);
	ЭлектронныеДокументыЭДО.ДобавитьДействие(ПараметрыВыполнения.НаборДействий,
		Перечисления.ДействияПоЭДО.ПодготовитьКОтправке);
	ЭлектронныеДокументыЭДО.ДобавитьДействие(ПараметрыВыполнения.НаборДействий,
		Перечисления.ДействияПоЭДО.Отправить);
	ПараметрыВыполнения.РасшифрованныеМаркеры = РасшифрованныеМаркерыИзМаркеровАвторизации(МаркерыАвторизации);
	ПараметрыВыполнения.ОбработатьТолькоИзвещения = ОбработатьТолькоИзвещения;
	
	РезультатДействийПоЭДО = ВыполнитьДействиеЭДО(ПараметрыВыполнения);
	
	ДокументыЭДО = ОбщегоНазначения.ВыгрузитьКолонку(РезультатДействийПоЭДО.Итог.ОбработанныеДокументы, "Ключ");
	
	Результат.СостоянияДокументовЭДО = СостоянияДокументовЭДОВФорматеСервиса(ДокументыЭДО);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПолучитьДокументыЭДО

// Параметры:
//  МеткиВремениПоИдентификаторамЭДО - см. ПорцияДанныхСинхронизацииДокументовЭДОПоМеткамВремени.МеткиВремениПоИдентификаторамЭДО
//  Порция - Число
// 
// Возвращаемое значение:
//  Массив из см. НовоеОписаниеДокументаЭДО
Функция ДанныеСинхронизацииДокументовЭДОПоМеткамВремени(МеткиВремениПоИдентификаторамЭДО, Порция)
	
	ОписаниеЗапроса = Новый Структура("Параметры, Тексты", Новый Структура, Новый Массив);
	
	МеткиВремениДанныхЭДО.ДобавитьТекстЗапросаИдентификаторовДанныхПоМеткамВремени(
		ОписаниеЗапроса, Перечисления.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО,
		МеткиВремениПоИдентификаторамЭДО, Порция);
	
	ДобавитьТекстЗапросаДанныхДокументовИзВременнойТаблицыМетокВремени(ОписаниеЗапроса);
	
	ДобавитьТекстЗапросаЗаписейБезДокументовИзВременнойТаблицыМетокВремени(ОписаниеЗапроса);
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ОписаниеЗапроса.Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	Для Каждого Параметр Из ОписаниеЗапроса.Параметры Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	НаборДанных = Новый Массив;
	
	ДополнитьДаннымиСинхронизацииПоВыборкеДокументов(НаборДанных, РезультатыЗапроса[1].Выбрать());
	
	ДополнитьДаннымиСинхронизацииПоВыборкеБезДокументов(НаборДанных, РезультатыЗапроса[2].Выбрать());
	
	Возврат НаборДанных;
	
КонецФункции

// Параметры:
//  ОписаниеЗапроса - Структура:
//  * Параметры - Структура
//  * Тексты - Массив из Строка
Процедура ДобавитьТекстЗапросаДанныхДокументовИзВременнойТаблицыМетокВремени(ОписаниеЗапроса)
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	МеткиВремени.ИдентификаторЭДО КАК ИдентификаторЭДО,
		|	МеткиВремени.МеткаВремени КАК МеткаВремени,
		|	ИСТИНА КАК ЭтоВходящийЭДО,
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента КАК ИдентификаторДокумента,
		|	ЭлектронныйДокументВходящийЭДО.ФорматОсновногоТитула КАК ФорматОсновногоТитула,
		|	ЭлектронныйДокументВходящийЭДО.ВидДокумента КАК ВидДокумента,
		|	ЭлектронныйДокументВходящийЭДО.ВидДокумента.Наименование КАК ВидДокументаНаименование,
		|	ЭлектронныйДокументВходящийЭДО.ВидДокумента.ТипДокумента КАК ВидДокументаТипДокумента,
		|	ЭлектронныйДокументВходящийЭДО.Организация КАК Организация,
		|	ЭлектронныйДокументВходящийЭДО.Организация.ИНН КАК ОрганизацияИНН,
		|	ЭлектронныйДокументВходящийЭДО.Организация.КПП КАК ОрганизацияКПП,
		|	ЭлектронныйДокументВходящийЭДО.Контрагент КАК Контрагент,
		|	ЭлектронныйДокументВходящийЭДО.Контрагент.ИНН КАК КонтрагентИНН,
		|	ЭлектронныйДокументВходящийЭДО.Контрагент.КПП КАК КонтрагентКПП,
		|	ЭлектронныйДокументВходящийЭДО.НомерДокумента КАК НомерДокумента,
		|	ЭлектронныйДокументВходящийЭДО.ДатаДокумента КАК ДатаДокумента,
		|	ЭлектронныйДокументВходящийЭДО.ДатаАннулирования КАК ДатаАннулирования,
		|	ЭлектронныйДокументВходящийЭДО.ДатаПодписания КАК ДатаПодписания,
		|	ЭлектронныйДокументВходящийЭДО.ДатаПолучения КАК ДатаОтправкиПолучения,
		|	ЭлектронныйДокументВходящийЭДО.СуммаДокумента КАК СуммаДокумента,
		|	ЭлектронныйДокументВходящийЭДО.СпособОбмена КАК СпособОбмена,
		|	ЭлектронныйДокументВходящийЭДО.ТипРегламента КАК ТипРегламента,
		|	ЭлектронныйДокументВходящийЭДО.ТребуетсяИзвещение КАК ТребуетсяИзвещение,
		|	ЭлектронныйДокументВходящийЭДО.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторКонтрагента КАК ИдентификаторКонтрагента,
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокументооборота КАК ИдентификаторДокументооборота,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.ПустаяСсылка)) КАК Состояние,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.СостояниеДополнение, """") КАК СостояниеДополнение,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.ДатаИзменения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаИзмененияСостояния,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.Комментарий, """") КАК КомментарийСостояния,
		|	ЕСТЬNULL(СоставПакетовДокументовЭДО.ИдентификаторПакета, """") КАК ИдентификаторПакета
		|ИЗ
		|	ИдентификаторыДанныхПоМеткамВремени КАК МеткиВремени
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|		ПО МеткиВремени.ИдентификаторОбъекта = ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|		ПО ЭлектронныйДокументВходящийЭДО.Ссылка = СостоянияДокументовЭДО.ЭлектронныйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставПакетовДокументовЭДО КАК СоставПакетовДокументовЭДО
		|		ПО ЭлектронныйДокументВходящийЭДО.Ссылка = СоставПакетовДокументовЭДО.ЭлектронныйДокумент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МеткиВремени.ИдентификаторЭДО КАК ИдентификаторЭДО,
		|	МеткиВремени.МеткаВремени КАК МеткаВремени,
		|	ЛОЖЬ КАК ЭтоВходящийЭДО,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента КАК ИдентификаторДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.ФорматОсновногоТитула КАК ФорматОсновногоТитула,
		|	ЭлектронныйДокументИсходящийЭДО.ВидДокумента КАК ВидДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.ВидДокумента.Наименование КАК ВидДокументаНаименование,
		|	ЭлектронныйДокументИсходящийЭДО.ВидДокумента.ТипДокумента КАК ВидДокументаТипДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.Организация КАК Организация,
		|	ЭлектронныйДокументИсходящийЭДО.Организация.ИНН КАК ОрганизацияИНН,
		|	ЭлектронныйДокументИсходящийЭДО.Организация.КПП КАК ОрганизацияКПП,
		|	ЭлектронныйДокументИсходящийЭДО.Контрагент КАК Контрагент,
		|	ЭлектронныйДокументИсходящийЭДО.Контрагент.ИНН КАК КонтрагентИНН,
		|	ЭлектронныйДокументИсходящийЭДО.Контрагент.КПП КАК КонтрагентКПП,
		|	ЭлектронныйДокументИсходящийЭДО.НомерДокумента КАК НомерДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.ДатаДокумента КАК ДатаДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.ДатаАннулирования КАК ДатаАннулирования,
		|	ЭлектронныйДокументИсходящийЭДО.ДатаПодписания КАК ДатаПодписания,
		|	ЭлектронныйДокументИсходящийЭДО.ДатаОтправки КАК ДатаОтправкиПолучения,
		|	ЭлектронныйДокументИсходящийЭДО.СуммаДокумента КАК СуммаДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.СпособОбмена КАК СпособОбмена,
		|	ЭлектронныйДокументИсходящийЭДО.ТипРегламента КАК ТипРегламента,
		|	ЭлектронныйДокументИсходящийЭДО.ТребуетсяИзвещение КАК ТребуетсяИзвещение,
		|	ЭлектронныйДокументИсходящийЭДО.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторКонтрагента КАК ИдентификаторКонтрагента,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокументооборота КАК ИдентификаторДокументооборота,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.ПустаяСсылка)) КАК Состояние,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.СостояниеДополнение, """") КАК СостояниеДополнение,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.ДатаИзменения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаИзмененияСостояния,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.Комментарий, """") КАК КомментарийСостояния,
		|	ЕСТЬNULL(СоставПакетовДокументовЭДО.ИдентификаторПакета, """") КАК ИдентификаторПакета
		|ИЗ
		|	ИдентификаторыДанныхПоМеткамВремени КАК МеткиВремени
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|		ПО МеткиВремени.ИдентификаторОбъекта = ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|		ПО ЭлектронныйДокументИсходящийЭДО.Ссылка = СостоянияДокументовЭДО.ЭлектронныйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставПакетовДокументовЭДО КАК СоставПакетовДокументовЭДО
		|		ПО ЭлектронныйДокументИсходящийЭДО.Ссылка = СоставПакетовДокументовЭДО.ЭлектронныйДокумент";
	
	ОписаниеЗапроса.Тексты.Добавить(ТекстЗапроса);
	
КонецПроцедуры

// Параметры:
//  ОписаниеЗапроса - Структура:
//  * Параметры - Структура
//  * Тексты - Массив из Строка
Процедура ДобавитьТекстЗапросаЗаписейБезДокументовИзВременнойТаблицыМетокВремени(ОписаниеЗапроса)
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	МеткиВремени.ИдентификаторЭДО КАК ИдентификаторЭДО,
		|	МеткиВремени.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
		|	МеткиВремени.МеткаВремени КАК МеткаВремени
		|ИЗ
		|	ИдентификаторыДанныхПоМеткамВремени КАК МеткиВремени
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|		ПО МеткиВремени.ИдентификаторОбъекта = ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|		ПО МеткиВремени.ИдентификаторОбъекта = ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента
		|ГДЕ
		|	ЭлектронныйДокументВходящийЭДО.Ссылка ЕСТЬ NULL
		|	И ЭлектронныйДокументИсходящийЭДО.Ссылка ЕСТЬ NULL";
	
	ОписаниеЗапроса.Тексты.Добавить(ТекстЗапроса);
	
КонецПроцедуры

// Параметры:
//  НаборДанных - Массив из см. НовыеДанныеСинхронизацииДокументаЭДО
//  Выборка - см. ДанныеСинхронизацииПоВыборкеДокументов.Выборка
Процедура ДополнитьДаннымиСинхронизацииПоВыборкеДокументов(НаборДанных, Выборка)
	
	Пока Выборка.Следующий() Цикл
		ОписаниеДокументаЭДО = ДанныеСинхронизацииПоВыборкеДокументов(Выборка);
		НаборДанных.Добавить(ОписаниеДокументаЭДО);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  НаборДанных - Массив из см. НовыеДанныеСинхронизацииДокументаЭДО
//  Выборка - ВыборкаИзРезультатаЗапроса:
//  * ИдентификаторЭДО - Строка
//  * ИдентификаторОбъекта - Строка
//  * МеткаВремени - Число
Процедура ДополнитьДаннымиСинхронизацииПоВыборкеБезДокументов(НаборДанных, Выборка)
	
	Пока Выборка.Следующий() Цикл
		
		СостояниеСинхронизации = НовоеСостояниеСинхронизацииДокументаЭДО();
		СостояниеСинхронизации.ИдентификаторЭДО = Выборка.ИдентификаторЭДО;
		СостояниеСинхронизации.МеткаВремени = Выборка.МеткаВремени;
		СостояниеСинхронизации.Удаление = Истина;
		
		ДанныеСинхронизации = НовыеДанныеСинхронизацииДокументаЭДО();
		ДанныеСинхронизации.Идентификатор = Выборка.ИдентификаторОбъекта;
		ДанныеСинхронизации.Состояние = СостояниеСинхронизации;
		
		НаборДанных.Добавить(ДанныеСинхронизации);
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращаемое значение:
//  Структура - Новые данные синхронизации документа ЭДО:
// * Идентификатор - Строка
// * Состояние - Неопределено
//             - см. НовоеСостояниеСинхронизацииДокументаЭДО
// * Описание - Неопределено,
//            - см. НовоеОписаниеДокументаЭДО
Функция НовыеДанныеСинхронизацииДокументаЭДО()
	Данные = Новый Структура;
	Данные.Вставить("Идентификатор", "");
	Данные.Вставить("Состояние", Неопределено);
	Данные.Вставить("Описание", Неопределено);
	Возврат Данные;
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ИдентификаторЭДО - Строка 
//  * МеткаВремени - Число
//  * Удаление - Булево
Функция НовоеСостояниеСинхронизацииДокументаЭДО()
	Состояние = Новый Структура;
	Состояние.Вставить("ИдентификаторЭДО", "");
	Состояние.Вставить("МеткаВремени", 0);
	Состояние.Вставить("Удаление", Ложь);
	Возврат Состояние;
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ЭтоВходящийЭДО                - Булево
//  * Идентификатор                 - Строка
//  * Формат                        - Строка
//  * ВидДокумента                  - Структура:
//  ** Наименование                 - Строка
//  ** ТипДокумента                 - Строка
//  * Организация                   - Структура:
//  ** ИНН                          - Строка
//  ** КПП                          - Строка
//  * Контрагент                    - Структура:
//  ** ИНН                          - Строка
//  ** КПП                          - Строка
//  * Договор                       - Неопределено,Структура:
//  ** Наименование                 - Строка
//  ** Номер                        - Строка
//  ** Дата                         - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * Дата                          - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ДатаАннулирования             - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ДатаПодписания                - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ДатаОтправкиПолучения         - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * Номер                         - Строка
//  * Сумма                         - Число
//  * СпособОбмена                  - Строка
//  * ТипРегламента                 - Строка
//  * ТребуетсяИзвещение            - Булево
//  * ТребуетсяПодтверждение        - Булево
//  * ИдентификаторОрганизации      - Строка
//  * ИдентификаторКонтрагента      - Строка
//  * ИдентификаторДокументооборота - Строка
//  * ИмяСостояния                  - Строка
//  * СостояниеДополнение           - Строка
//  * ДатаИзмененияСостояния        - Строка
//  * КомментарийСостояния          - Строка
//  * ИдентификаторПакета           - Строка
Функция НовоеОписаниеДокументаЭДО()
	Описание = Новый Структура;
	Описание.Вставить("ЭтоВходящийЭДО", Ложь);
	Описание.Вставить("Идентификатор", "");
	Описание.Вставить("Формат", "");
	Описание.Вставить("ВидДокумента", НовоеОписаниеВидаДокумента());
	Описание.Вставить("Организация", НовоеОписаниеОрганизации());
	Описание.Вставить("Контрагент", НовоеОписаниеОрганизации());
	Описание.Вставить("Договор", Неопределено);
	Описание.Вставить("Дата", "");
	Описание.Вставить("ДатаАннулирования", "");
	Описание.Вставить("ДатаПодписания", "");
	Описание.Вставить("ДатаОтправкиПолучения", "");
	Описание.Вставить("Номер", "");
	Описание.Вставить("Сумма", 0);
	Описание.Вставить("СпособОбмена", "");
	Описание.Вставить("ТипРегламента", "");
	Описание.Вставить("ТребуетсяИзвещение", Ложь);
	Описание.Вставить("ТребуетсяПодтверждение", Ложь);
	Описание.Вставить("ИдентификаторОрганизации", "");
	Описание.Вставить("ИдентификаторКонтрагента", "");
	Описание.Вставить("ИдентификаторДокументооборота", "");
	Описание.Вставить("ИмяСостояния", "");
	Описание.Вставить("СостояниеДополнение", "");
	Описание.Вставить("ДатаИзмененияСостояния", "");
	Описание.Вставить("КомментарийСостояния", "");
	Описание.Вставить("ИдентификаторПакета", "");
	Возврат Описание;
КонецФункции

// Параметры:
//  Выборка - ВыборкаИзРезультатаЗапроса:
//  * ИдентификаторЭДО - Строка
//  * ИдентификаторОбъекта - Строка
//  * МеткаВремени - Число
//  * ЭтоВходящийЭДО - Булево
//  * ИдентификаторДокумента - Строка
//  * ФорматОсновногоТитула - Строка
//  * ВидДокумента - СправочникСсылка.ВидыДокументовЭДО
//  * ВидДокументаНаименование - Строка
//  * ВидДокументаТипДокумента - ПеречислениеСсылка.ТипыДокументовЭДО
//  * Организация - СправочникСсылка.Организации
//  * ОрганизацияИНН - Строка
//  * ОрганизацияКПП - Строка
//  * Контрагент - СправочникСсылка.Организации
//  * КонтрагентИНН - Строка
//  * КонтрагентКПП - Строка
//  * Договор - СправочникСсылка.ДоговорыКонтрагентов
//  * ДоговорНаименование - Строка
//  * ДоговорНомер - Строка
//  * ДоговорДата - Дата
//  * НомерДокумента - Строка
//  * ДатаДокумента - Дата
//  * ДатаАннулирования - Дата
//  * ДатаПодписания - Дата
//  * ДатаОтправкиПолучения - Дата
//  * СуммаДокумента - Число
//  * СпособОбмена - ПеречислениеСсылка.СпособыОбменаЭД
//  * ТипРегламента - ПеречислениеСсылка.ТипыРегламентовЭДО
//  * ТребуетсяИзвещение - Булево
//  * ТребуетсяПодтверждение - Булево
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторКонтрагента - Строка
//  * ИдентификаторДокументооборота - Строка
//  * Состояние - ПеречислениеСсылка.СостоянияДокументовЭДО
//  * СостояниеДополнение - Строка
//  * ДатаИзмененияСостояния - Дата
//  * КомментарийСостояния - Строка
//  * ИдентификаторПакета - УникальныйИдентификатор
//  
// Возвращаемое значение:
//  См. НовыеДанныеСинхронизацииДокументаЭДО
Функция ДанныеСинхронизацииПоВыборкеДокументов(Выборка)
	
	СостояниеСинхронизации = НовоеСостояниеСинхронизацииДокументаЭДО();
	СостояниеСинхронизации.ИдентификаторЭДО = Выборка.ИдентификаторЭДО;
	СостояниеСинхронизации.МеткаВремени = Выборка.МеткаВремени;
	
	ДанныеСинхронизации = НовыеДанныеСинхронизацииДокументаЭДО();
	ДанныеСинхронизации.Идентификатор = Выборка.ИдентификаторДокумента;
	ДанныеСинхронизации.Состояние = СостояниеСинхронизации;
	ДанныеСинхронизации.Описание = ОписаниеДокументаЭДОПоВыборкеДанных(Выборка);
	
	Возврат ДанныеСинхронизации;
	
КонецФункции

// Параметры:
//  Выборка - ВыборкаИзРезультатаЗапроса:
//  * ЭтоВходящийЭДО - Булево
//  * ИдентификаторДокумента - Строка
//  * ФорматОсновногоТитула - Строка
//  * ВидДокумента - СправочникСсылка.ВидыДокументовЭДО
//  * ВидДокументаНаименование - Строка
//  * ВидДокументаТипДокумента - ПеречислениеСсылка.ТипыДокументовЭДО
//  * Организация - СправочникСсылка.Организации
//  * ОрганизацияИНН - Строка
//  * ОрганизацияКПП - Строка
//  * Контрагент - СправочникСсылка.Организации
//  * КонтрагентИНН - Строка
//  * КонтрагентКПП - Строка
//  * Договор - СправочникСсылка.ДоговорыКонтрагентов
//  * ДоговорНаименование - Строка
//  * ДоговорНомер - Строка
//  * ДоговорДата - Дата
//  * НомерДокумента - Строка
//  * ДатаДокумента - Дата
//  * ДатаАннулирования - Дата
//  * ДатаОтправкиПолучения - Дата
//  * ДатаПодписания - Дата
//  * СуммаДокумента - Число
//  * СпособОбмена - ПеречислениеСсылка.СпособыОбменаЭД
//  * ТипРегламента - ПеречислениеСсылка.ТипыРегламентовЭДО
//  * ТребуетсяИзвещение - Булево
//  * ТребуетсяПодтверждение - Булево
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторКонтрагента - Строка
//  * ИдентификаторДокументооборота - Строка
//  * Состояние - ПеречислениеСсылка.СостоянияДокументовЭДО
//  * СостояниеДополнение - Строка
//  * ДатаИзмененияСостояния - Дата
//  * КомментарийСостояния - Строка
//  * ИдентификаторПакета - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. НовоеОписаниеДокументаЭДО
Функция ОписаниеДокументаЭДОПоВыборкеДанных(Выборка)
	
	ОписаниеДокументаЭДО = НовоеОписаниеДокументаЭДО();
	ОписаниеДокументаЭДО.ЭтоВходящийЭДО = Выборка.ЭтоВходящийЭДО;
	ОписаниеДокументаЭДО.Идентификатор = Выборка.ИдентификаторДокумента;
	ОписаниеДокументаЭДО.Формат = Выборка.ФорматОсновногоТитула;
	ОписаниеДокументаЭДО.ВидДокумента.Наименование = Выборка.ВидДокументаНаименование;
	ОписаниеДокументаЭДО.ВидДокумента.ТипДокумента = ОбщегоНазначенияБЭДПовтИсп.ИмяЗначенияПеречисления(
		Выборка.ВидДокументаТипДокумента);
	ОписаниеДокументаЭДО.Организация.ИНН = Выборка.ОрганизацияИНН;
	ОписаниеДокументаЭДО.Организация.КПП = Выборка.ОрганизацияКПП;
	ОписаниеДокументаЭДО.Контрагент.ИНН = Выборка.КонтрагентИНН;
	ОписаниеДокументаЭДО.Контрагент.КПП = Выборка.КонтрагентКПП;
	ОписаниеДокументаЭДО.Номер = Выборка.НомерДокумента;
	ОписаниеДокументаЭДО.Дата = ОбщегоНазначенияБЭД.ДатаВФорматеISO(Выборка.ДатаДокумента);
	ОписаниеДокументаЭДО.ДатаАннулирования = ОбщегоНазначенияБЭД.ДатаВФорматеISO(Выборка.ДатаАннулирования);
	ОписаниеДокументаЭДО.ДатаОтправкиПолучения = ОбщегоНазначенияБЭД.ДатаВФорматеISO(Выборка.ДатаОтправкиПолучения);	ОписаниеДокументаЭДО.ДатаПодписания = ОбщегоНазначенияБЭД.ДатаВФорматеISO(Выборка.ДатаПодписания);
	ОписаниеДокументаЭДО.Сумма = Выборка.СуммаДокумента;
	ОписаниеДокументаЭДО.СпособОбмена = ОбщегоНазначенияБЭДПовтИсп.ИмяЗначенияПеречисления(Выборка.СпособОбмена);
	ОписаниеДокументаЭДО.ТипРегламента = ОбщегоНазначенияБЭДПовтИсп.ИмяЗначенияПеречисления(Выборка.ТипРегламента);
	ОписаниеДокументаЭДО.ТребуетсяИзвещение = Выборка.ТребуетсяИзвещение;
	ОписаниеДокументаЭДО.ТребуетсяПодтверждение = Выборка.ТребуетсяПодтверждение;
	ОписаниеДокументаЭДО.ИдентификаторОрганизации = Выборка.ИдентификаторОрганизации;
	ОписаниеДокументаЭДО.ИдентификаторКонтрагента = Выборка.ИдентификаторКонтрагента;
	ОписаниеДокументаЭДО.ИдентификаторДокументооборота = Выборка.ИдентификаторДокументооборота;
	ОписаниеДокументаЭДО.ИмяСостояния = ОбщегоНазначенияБЭДПовтИсп.ИмяЗначенияПеречисления(Выборка.Состояние);
	ОписаниеДокументаЭДО.СостояниеДополнение = Выборка.СостояниеДополнение;
	ОписаниеДокументаЭДО.ДатаИзмененияСостояния = ОбщегоНазначенияБЭД.ДатаВФорматеISO(Выборка.ДатаИзмененияСостояния);
	ОписаниеДокументаЭДО.КомментарийСостояния = Выборка.КомментарийСостояния;
	ОписаниеДокументаЭДО.ИдентификаторПакета = Строка(Выборка.ИдентификаторПакета);
	Возврат ОписаниеДокументаЭДО;
	
КонецФункции

// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из см. НовыеДанныеСинхронизацииДокументаЭДО
Функция ДанныеСинхронизацииДокументовЭДОПоИдентификаторам(ИдентификаторыДокументовЭДО)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныхДокументовПоИдентификаторам();
	Запрос.УстановитьПараметр("ИдентификаторыДокументов", ИдентификаторыДокументовЭДО);
	Выборка = Запрос.Выполнить().Выбрать();
	НаборДанных = Новый Массив; // Массив из см. НовыеДанныеСинхронизацииДокументаЭДО
	ДополнитьДаннымиСинхронизацииПоВыборкеДокументов(НаборДанных, Выборка);
	Возврат НаборДанных;
	
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ТекстЗапросаДанныхДокументовПоИдентификаторам()
	
	Возврат
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МеткиВремениДанныхЭДО.ИдентификаторЭДО КАК ИдентификаторЭДО,
		|	МеткиВремениДанныхЭДО.МеткаВремени КАК МеткаВремени,
		|	ИСТИНА КАК ЭтоВходящийЭДО,
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента КАК ИдентификаторДокумента,
		|	ЭлектронныйДокументВходящийЭДО.ФорматОсновногоТитула КАК ФорматОсновногоТитула,
		|	ЭлектронныйДокументВходящийЭДО.ВидДокумента КАК ВидДокумента,
		|	ЭлектронныйДокументВходящийЭДО.ВидДокумента.Наименование КАК ВидДокументаНаименование,
		|	ЭлектронныйДокументВходящийЭДО.ВидДокумента.ТипДокумента КАК ВидДокументаТипДокумента,
		|	ЭлектронныйДокументВходящийЭДО.Организация КАК Организация,
		|	ЭлектронныйДокументВходящийЭДО.Организация.ИНН КАК ОрганизацияИНН,
		|	ЭлектронныйДокументВходящийЭДО.Организация.КПП КАК ОрганизацияКПП,
		|	ЭлектронныйДокументВходящийЭДО.Контрагент КАК Контрагент,
		|	ЭлектронныйДокументВходящийЭДО.Контрагент.ИНН КАК КонтрагентИНН,
		|	ЭлектронныйДокументВходящийЭДО.Контрагент.КПП КАК КонтрагентКПП,
		|	ЭлектронныйДокументВходящийЭДО.НомерДокумента КАК НомерДокумента,
		|	ЭлектронныйДокументВходящийЭДО.ДатаДокумента КАК ДатаДокумента,
		|	ЭлектронныйДокументВходящийЭДО.ДатаАннулирования КАК ДатаАннулирования,
		|	ЭлектронныйДокументВходящийЭДО.ДатаПодписания КАК ДатаПодписания,
		|	ЭлектронныйДокументВходящийЭДО.ДатаПолучения КАК ДатаОтправкиПолучения,
		|	ЭлектронныйДокументВходящийЭДО.СуммаДокумента КАК СуммаДокумента,
		|	ЭлектронныйДокументВходящийЭДО.СпособОбмена КАК СпособОбмена,
		|	ЭлектронныйДокументВходящийЭДО.ТипРегламента КАК ТипРегламента,
		|	ЭлектронныйДокументВходящийЭДО.ТребуетсяИзвещение КАК ТребуетсяИзвещение,
		|	ЭлектронныйДокументВходящийЭДО.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторКонтрагента КАК ИдентификаторКонтрагента,
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокументооборота КАК ИдентификаторДокументооборота,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.ПустаяСсылка)) КАК Состояние,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.СостояниеДополнение, """") КАК СостояниеДополнение,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.ДатаИзменения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаИзмененияСостояния,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.Комментарий, """") КАК КомментарийСостояния,
		|	ЕСТЬNULL(СоставПакетовДокументовЭДО.ИдентификаторПакета, """") КАК ИдентификаторПакета
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МеткиВремениДанныхЭДО КАК МеткиВремениДанныхЭДО
		|		ПО ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации = МеткиВремениДанныхЭДО.ИдентификаторЭДО
		|		И МеткиВремениДанныхЭДО.ТипДанных = ЗНАЧЕНИЕ(Перечисление.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО)
		|		И ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента = МеткиВремениДанныхЭДО.ИдентификаторОбъекта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|		ПО ЭлектронныйДокументВходящийЭДО.Ссылка = СостоянияДокументовЭДО.ЭлектронныйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставПакетовДокументовЭДО КАК СоставПакетовДокументовЭДО
		|		ПО ЭлектронныйДокументВходящийЭДО.Ссылка = СоставПакетовДокументовЭДО.ЭлектронныйДокумент
		|ГДЕ
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента В (&ИдентификаторыДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МеткиВремениДанныхЭДО.ИдентификаторЭДО КАК ИдентификаторЭДО,
		|	МеткиВремениДанныхЭДО.МеткаВремени КАК МеткаВремени,
		|	ЛОЖЬ КАК ЭтоВходящийЭДО,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента КАК ИдентификаторДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.ФорматОсновногоТитула КАК ФорматОсновногоТитула,
		|	ЭлектронныйДокументИсходящийЭДО.ВидДокумента КАК ВидДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.ВидДокумента.Наименование КАК ВидДокументаНаименование,
		|	ЭлектронныйДокументИсходящийЭДО.ВидДокумента.ТипДокумента КАК ВидДокументаТипДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.Организация КАК Организация,
		|	ЭлектронныйДокументИсходящийЭДО.Организация.ИНН КАК ОрганизацияИНН,
		|	ЭлектронныйДокументИсходящийЭДО.Организация.КПП КАК ОрганизацияКПП,
		|	ЭлектронныйДокументИсходящийЭДО.Контрагент КАК Контрагент,
		|	ЭлектронныйДокументИсходящийЭДО.Контрагент.ИНН КАК КонтрагентИНН,
		|	ЭлектронныйДокументИсходящийЭДО.Контрагент.КПП КАК КонтрагентКПП,
		|	ЭлектронныйДокументИсходящийЭДО.НомерДокумента КАК НомерДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.ДатаДокумента КАК ДатаДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.ДатаАннулирования КАК ДатаАннулирования,
		|	ЭлектронныйДокументИсходящийЭДО.ДатаПодписания КАК ДатаПодписания,
		|	ЭлектронныйДокументИсходящийЭДО.ДатаОтправки КАК ДатаОтправкиПолучения,
		|	ЭлектронныйДокументИсходящийЭДО.СуммаДокумента КАК СуммаДокумента,
		|	ЭлектронныйДокументИсходящийЭДО.СпособОбмена КАК СпособОбмена,
		|	ЭлектронныйДокументИсходящийЭДО.ТипРегламента КАК ТипРегламента,
		|	ЭлектронныйДокументИсходящийЭДО.ТребуетсяИзвещение КАК ТребуетсяИзвещение,
		|	ЭлектронныйДокументИсходящийЭДО.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторКонтрагента КАК ИдентификаторКонтрагента,
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокументооборота КАК ИдентификаторДокументооборота,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовЭДО.ПустаяСсылка)) КАК Состояние,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.СостояниеДополнение, """") КАК СостояниеДополнение,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.ДатаИзменения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаИзмененияСостояния,
		|	ЕСТЬNULL(СостоянияДокументовЭДО.Комментарий, """") КАК КомментарийСостояния,
		|	ЕСТЬNULL(СоставПакетовДокументовЭДО.ИдентификаторПакета, """") КАК ИдентификаторПакета
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МеткиВремениДанныхЭДО КАК МеткиВремениДанныхЭДО
		|		ПО ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации = МеткиВремениДанныхЭДО.ИдентификаторЭДО
		|		И МеткиВремениДанныхЭДО.ТипДанных = ЗНАЧЕНИЕ(Перечисление.ТипыСинхронизацииСЦентромЭДО.ДокументыЭДО)
		|		И ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента = МеткиВремениДанныхЭДО.ИдентификаторОбъекта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовЭДО КАК СостоянияДокументовЭДО
		|		ПО ЭлектронныйДокументИсходящийЭДО.Ссылка = СостоянияДокументовЭДО.ЭлектронныйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставПакетовДокументовЭДО КАК СоставПакетовДокументовЭДО
		|		ПО ЭлектронныйДокументИсходящийЭДО.Ссылка = СоставПакетовДокументовЭДО.ЭлектронныйДокумент
		|ГДЕ
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента В (&ИдентификаторыДокументов)";
	
КонецФункции

#КонецОбласти

#Область ВыполнениеДействийПоШаблону

// Параметры:
//  ДействиеЭДО - ПеречислениеСсылка.ДействияПоЭДО
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  Комментарий - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибки - Неопределено
//           - Массив из Строка
//  * СостоянияДокументовЭДО - Массив из См. НовоеСостояниеДокументаЭДОВФорматеСервиса
Функция ВыполнитьДействиеЭДОПоШаблону(ДействиеЭДО, ИдентификаторыДокументовЭДО, Комментарий = "")
	
	РезультатШаблона = Новый Структура;
	РезультатШаблона.Вставить("Ошибки", Неопределено);
	РезультатШаблона.Вставить("СостоянияДокументовЭДО", Новый Массив);
	
	Если Не ЗначениеЗаполнено(ИдентификаторыДокументовЭДО) Тогда
		Возврат РезультатШаблона;
	КонецЕсли;
	
	ПараметрыВыполнения = ЭлектронныеДокументыЭДОКлиентСервер.НовыеПараметрыВыполненияДействийПоЭДО();
	ПараметрыВыполнения.ОбъектыДействий.ЭлектронныеДокументы = ДокументыЭДО(ИдентификаторыДокументовЭДО);
	ЭлектронныеДокументыЭДО.ДобавитьДействие(ПараметрыВыполнения.НаборДействий, ДействиеЭДО);
	Если ЗначениеЗаполнено(Комментарий) Тогда
		ДополнительныеПараметрыДействия = ЭлектронныеДокументыЭДОКлиентСервер.НовыеДополнительныеПараметрыДействия();
		ДополнительныеПараметрыДействия.Комментарий = Комментарий;
		ПараметрыВыполнения.ДополнительныеПараметрыДействий.Вставить(ДействиеЭДО, ДополнительныеПараметрыДействия);
	КонецЕсли;
	
	РезультатДействийЭДО = ВыполнитьДействиеЭДО(ПараметрыВыполнения);
	
	ДокументыЭДО = ОбщегоНазначения.ВыгрузитьКолонку(РезультатДействийЭДО.Итог.ОбработанныеДокументы, "Ключ");
	
	РезультатШаблона.СостоянияДокументовЭДО = СостоянияДокументовЭДОВФорматеСервиса(ДокументыЭДО);
	
	Возврат РезультатШаблона;
	
КонецФункции

// Параметры:
//  ПараметрыВыполнения - См. ЭлектронныеДокументыЭДО.ВыполнитьДействияПоИнтеграциямЭДО.ПараметрыВыполненияДействий
// 
// Возвращаемое значение:
//  См. ЭлектронныеДокументыЭДОСлужебный.НовыйРезультатДействийПоЭДО
Функция ВыполнитьДействиеЭДО(ПараметрыВыполнения)
	РезультатПоИнтеграциям = ЭлектронныеДокументыЭДО.ВыполнитьДействияПоИнтеграциямЭДО(ПараметрыВыполнения);
	РезультатДействийЭДО = РезультатПоИнтеграциям[ЭлектронныеДокументыЭДОКлиентСервер.ИдентификаторМенеджераДействийЭДО()]; // См. ЭлектронныеДокументыЭДОСлужебный.НовыйРезультатДействийПоЭДО
	Возврат РезультатДействийЭДО;
КонецФункции

#КонецОбласти

#Область ОтражениеВУчете

// Параметры:
//  ИдентификаторыДокументов - Массив из Строка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка - идентификатор документа.
//  * Значение - см. ФорматыЭДО.НовыеПараметрыПолученияДанныхДокумента
Функция ПараметрыПолученияДанныхДокументовЭДО(ИдентификаторыДокументов)
	
	Результат = Новый Соответствие; // см. ПараметрыПолученияДанныхДокументовЭДО
	
	ПрисоединенныеФайлыДокументов = ПрисоединенныеФайлыОсновныхТитуловДокументов(ИдентификаторыДокументов);
	
	ПрисоединенныеФайлы = ПрисоединенныеФайлыДокументов.ВыгрузитьКолонку("Ссылка");
	
	ДвоичныеДанныеФайлов = РаботаСФайлами.ДвоичныеДанныеФайлов(ПрисоединенныеФайлы);
	
	Для Каждого ПрисоединенныйФайлДокумента Из ПрисоединенныеФайлыДокументов Цикл
		
		ПараметрыПолученияДанныхДокумента = Результат[ПрисоединенныйФайлДокумента.ИдентификаторДокумента];
		Если ПараметрыПолученияДанныхДокумента = Неопределено Тогда
			ПараметрыПолученияДанныхДокумента = ФорматыЭДО.НовыеПараметрыПолученияДанныхДокумента();
			Результат.Вставить(ПрисоединенныйФайлДокумента.ИдентификаторДокумента, ПараметрыПолученияДанныхДокумента);
		КонецЕсли;
		
		ДвоичныеДанныеФайла = ДвоичныеДанныеФайлов[ПрисоединенныйФайлДокумента.Ссылка];
		
		ОписаниеФайла = РаботаСФайламиБЭД.НовоеОписаниеФайла();
		ОписаниеФайла.ДвоичныеДанные = ДвоичныеДанныеФайла;
		ОписаниеФайла.ИмяФайла = ПрисоединенныйФайлДокумента.ПолноеИмяФайла;
		
		Если ПрисоединенныйФайлДокумента.ЭтоОсновнойФайл Тогда
			ПараметрыПолученияДанныхДокумента.ОсновнойФайл = ОписаниеФайла;
		Иначе
			ПараметрыПолученияДанныхДокумента.ДополнительныйФайл = ОписаниеФайла;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ИдентификаторДокумента - Строка
//  * СведенияНоменклатуры - Массив из см. НовыеСведенияНоменклатурнойПозиции
Функция НовыеСведенияНоменклатурыДокумента()
	Сведения = Новый Структура;
	Сведения.Вставить("ИдентификаторДокумента", "");
	Сведения.Вставить("СведенияНоменклатуры", Новый Массив);
	Возврат Сведения;
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ИД - Строка
//  * Штрихкод - Строка
//  * Наименование - Строка
//  * НаименованиеХарактеристики - Строка
//  * КодТовара - Строка
//  * Артикул - Строка
//  * БазоваяЕдиницаКод - Строка
//  * БазоваяЕдиницаНаименование - Строка
//  * БазоваяЕдиницаНаименованиеПолное - Строка
//  * БазоваяЕдиницаМеждународноеСокращение - Строка
//  * БазоваяЕдиницаНаименованиеКраткое - Строка
//  * СтавкаНДС - Строка
//  * Описание - Строка
//  * ИмяТипаНоменклатурыФНС - Строка
//  * КодПоКТРУ - Строка
//  * КодТНВЭД - Строка
//  * СтранаПроисхожденияКод - Строка
//  * ПрослеживаемыйТовар - Булево
//  * МаркируемыйТовар - Булево
//
Функция НовыеСведенияНоменклатурнойПозиции()
	Сведения = Новый Структура;
	Сведения.Вставить("ИД", "");
	Сведения.Вставить("Штрихкод", "");
	Сведения.Вставить("Наименование", "");
	Сведения.Вставить("НаименованиеХарактеристики", "");
	Сведения.Вставить("КодТовара", "");
	Сведения.Вставить("Артикул", "");
	Сведения.Вставить("БазоваяЕдиницаКод", "");
	Сведения.Вставить("БазоваяЕдиницаНаименование", "");
	Сведения.Вставить("БазоваяЕдиницаНаименованиеПолное", "");
	Сведения.Вставить("БазоваяЕдиницаМеждународноеСокращение", "");
	Сведения.Вставить("БазоваяЕдиницаНаименованиеКраткое", "");
	Сведения.Вставить("СтавкаНДС", "");
	Сведения.Вставить("Описание", "");
	Сведения.Вставить("ИмяТипаНоменклатурыФНС", "");
	Сведения.Вставить("КодПоКТРУ", "");
	Сведения.Вставить("КодТНВЭД", "");
	Сведения.Вставить("СтранаПроисхожденияКод", "");
	Сведения.Вставить("ПрослеживаемыйТовар", Ложь);
	Сведения.Вставить("МаркируемыйТовар", Ложь);
	Возврат Сведения;
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ИдентификаторДокумента - Строка
//  * УчетныеДанные - Структура - данные прикладного решения:
//  ** Данные - См. ДеревоУчетныхДанныхИзСтруктуры.СтруктураДанных
//  ** Формат - См. ДеревоУчетныхДанныхИзСтруктуры.ФорматДерева
//  
Функция НовыеУчетныеДанныеДляОтраженияДокумента()
	ДанныеДляОтраженияДокумента = Новый Структура;
	ДанныеДляОтраженияДокумента.Вставить("ИдентификаторДокумента", "");
	ДанныеДляОтраженияДокумента.Вставить("УчетныеДанные", Новый Структура);
	ДанныеДляОтраженияДокумента.УчетныеДанные.Вставить("Данные", Новый Структура);
	ДанныеДляОтраженияДокумента.УчетныеДанные.Вставить("Формат", "");
	Возврат ДанныеДляОтраженияДокумента;
КонецФункции

// Параметры:
//  ИдентификаторыДокументов - Массив из Строка
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * ИдентификаторДокумента - Строка
//  * Ссылка - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  * ПолноеИмяФайла - Строка
//  * ЭтоОсновнойФайл - Булево
//
Функция ПрисоединенныеФайлыОсновныхТитуловДокументов(ИдентификаторыДокументов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторыДокументов", ИдентификаторыДокументов);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента КАК ИдентификаторДокумента,
		|	СообщениеЭДОПрисоединенныеФайлы.Ссылка КАК Ссылка,
		|	СообщениеЭДОПрисоединенныеФайлы.ПолноеИмяФайла КАК ПолноеИмяФайла,
		|	(СообщениеЭДО.ОсновнойФайл = СообщениеЭДОПрисоединенныеФайлы.Ссылка) КАК ЭтоОсновнойФайл
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО ЭлектронныйДокументВходящийЭДО.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
		|		И СообщениеЭДО.ТипЭлементаРегламента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК СообщениеЭДОПрисоединенныеФайлы
		|		ПО СообщениеЭДО.Ссылка = СообщениеЭДОПрисоединенныеФайлы.ВладелецФайла
		|ГДЕ
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента В (&ИдентификаторыДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента КАК ИдентификаторДокумента,
		|	СообщениеЭДОПрисоединенныеФайлы.Ссылка КАК Ссылка,
		|	СообщениеЭДОПрисоединенныеФайлы.ПолноеИмяФайла КАК ПолноеИмяФайла,
		|	(СообщениеЭДО.ОсновнойФайл = СообщениеЭДОПрисоединенныеФайлы.Ссылка) КАК ЭтоОсновнойФайл
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ПО ЭлектронныйДокументИсходящийЭДО.Ссылка = СообщениеЭДО.ЭлектронныйДокумент
		|		И СообщениеЭДО.ТипЭлементаРегламента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК СообщениеЭДОПрисоединенныеФайлы
		|		ПО СообщениеЭДО.Ссылка = СообщениеЭДОПрисоединенныеФайлы.ВладелецФайла
		|ГДЕ
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента В (&ИдентификаторыДокументов)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти

#Область ДанныеПолнойСинхронизацииДокументаЭДО

// Возвращаемое значение:
//  Структура - Новые данные полной синхронизации документа ЭДО:
//  * МеткаВремени - Число
//  * Сообщения - Неопределено,Массив из см. НовыеДанныеСообщенияПолнойСинхронизацииДокумента
//  * ФайлыСообщений - Неопределено,Массив из см. НовыеДанныеФайлаСообщенияПолнойСинхронизацииДокумента
//  * ПодписиФайлов - Неопределено,Массив из см. НовыеДанныеПодписиФайлаПолнойСинхронизацииДокумента
//  * ПроверкиПодписейПоМЧД - Неопределено,Массив из см. НовыеДанныеПроверкиПодписиПолнойСинхронизацииДокумента
//  * События - Неопределено,Массив из см. СобытияПолнойСинхронизацииДокумента
Функция НовыеДанныеПолнойСинхронизацииДокументаЭДО()
	
	Данные = Новый Структура;
	Данные.Вставить("МеткаВремени", 0);
	Данные.Вставить("Сообщения", Неопределено);
	Данные.Вставить("ФайлыСообщений", Неопределено);
	Данные.Вставить("ПодписиФайлов", Неопределено);
	Данные.Вставить("ПроверкиПодписейПоМЧД", Неопределено);
	Данные.Вставить("События", Неопределено);
	Возврат Данные;
	
КонецФункции

// Возвращаемое значение:
//  Структура - Новые данные полной синхронизации документа ЭДО:
//  * МеткаВремени - Число
//  * Сообщения - Неопределено,Массив из см. НовыеДанныеСообщенияПолнойСинхронизацииДокумента
//  * ФайлыСообщений - Неопределено,Массив из см. НовыеДанныеФайлаСообщенияПолнойСинхронизацииДокумента
//  * ПодписиФайлов - Неопределено,Массив из см. НовыеДанныеПодписиФайлаПолнойСинхронизацииДокумента
//  * ПроверкиПодписейПоМЧД - Неопределено,Массив из см. НовыеДанныеПроверкиПодписиПолнойСинхронизацииДокументаВерсия3
//  * События - Неопределено,Массив из см. СобытияПолнойСинхронизацииДокумента
Функция НовыеДанныеПолнойСинхронизацииДокументаЭДОВерсия3()
	
	Данные = Новый Структура;
	Данные.Вставить("МеткаВремени", 0);
	Данные.Вставить("Сообщения", Неопределено);
	Данные.Вставить("ФайлыСообщений", Неопределено);
	Данные.Вставить("ПодписиФайлов", Неопределено);
	Данные.Вставить("ПроверкиПодписейПоМЧД", Неопределено);
	Данные.Вставить("События", Неопределено);
	Возврат Данные;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * Идентификатор - Строка
//  * ИдентификаторДокумента - Строка
//  * ИдентификаторОсновногоФайла - Строка
//  * Направление - Строка
//  * Тип - Строка
//  * ТипЭлементаРегламента - Строка
//  * Статус - Строка
//  * ДатаИзмененияСтатуса - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * СопроводительнаяЗаписка - Строка
//  * ОписаниеТекстовогоСообщения - Неопределено, См. НовоеОписаниеТекстовогоСообщения
Функция НовыеДанныеСообщенияПолнойСинхронизацииДокумента()
	
	Данные = Новый Структура;
	Данные.Вставить("Идентификатор", "");
	Данные.Вставить("ИдентификаторДокумента", "");
	Данные.Вставить("ИдентификаторОсновногоФайла", "");
	Данные.Вставить("Направление", "");
	Данные.Вставить("Тип", "");
	Данные.Вставить("ТипЭлементаРегламента", "");
	Данные.Вставить("Статус", "");
	Данные.Вставить("ДатаИзмененияСтатуса", "");
	Данные.Вставить("СопроводительнаяЗаписка", "");
	Данные.Вставить("ОписаниеТекстовогоСообщения", Неопределено);
	Возврат Данные;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//   * ТекстСообщения - Строка
//   * Прочитано - Булево
//   * СведенияОтправителя - Строка
Функция НовоеОписаниеТекстовогоСообщения()
	
	Результат = Новый Структура;
	Результат.Вставить("ТекстСообщения", "");
	Результат.Вставить("Прочитано", Ложь);
	Результат.Вставить("СведенияОтправителя", "");
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Сообщения - Массив из ДокументСсылка.СообщениеЭДО
//  ИдентификаторДокумента - Строка
// 
// Возвращаемое значение:
//  Массив из см. НовыеДанныеСообщенияПолнойСинхронизацииДокумента
Функция ДанныеСообщенийПолнойСинхронизацииДокумента(Сообщения, ИдентификаторДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка,
		|	СообщениеЭДО.Направление КАК Направление,
		|	СообщениеЭДО.ВидСообщения.ТипДокумента КАК ТипДокумента,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СообщениеЭДО.Статус КАК Статус,
		|	СообщениеЭДО.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
		|	СообщениеЭДО.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		|	СообщениеЭДО.ОсновнойФайл КАК ОсновнойФайл,
		|	ЕСТЬNULL(ТекстовыеСообщенияДокументовЭДО.ТекстСообщения, """") КАК ТекстСообщения,
		|	ЕСТЬNULL(ТекстовыеСообщенияДокументовЭДО.Прочитано, ЛОЖЬ) КАК Прочитано,
		|	ЕСТЬNULL(ТекстовыеСообщенияДокументовЭДО.СведенияОтправителя, """") КАК СведенияОтправителя
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекстовыеСообщенияДокументовЭДО КАК ТекстовыеСообщенияДокументовЭДО
		|		ПО ТекстовыеСообщенияДокументовЭДО.Сообщение = СообщениеЭДО.Ссылка
		|		И ТекстовыеСообщенияДокументовЭДО.ЭлектронныйДокумент = СообщениеЭДО.ЭлектронныйДокумент
		|ГДЕ
		|	СообщениеЭДО.Ссылка В (&Сообщения)";
	
	Запрос.УстановитьПараметр("Сообщения", Сообщения);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДанныеСообщений = Новый Массив; // Массив из см. НовыеДанныеСообщенияПолнойСинхронизацииДокумента
	
	Пока Выборка.Следующий() Цикл
		ДанныеСообщения = НовыеДанныеСообщенияПолнойСинхронизацииДокумента();
		ДанныеСообщения.Идентификатор = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		ДанныеСообщения.ИдентификаторДокумента = ИдентификаторДокумента;
		Если ЗначениеЗаполнено(Выборка.ОсновнойФайл) Тогда
			ДанныеСообщения.ИдентификаторОсновногоФайла = Строка(Выборка.ОсновнойФайл.УникальныйИдентификатор());
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Направление) Тогда
			ДанныеСообщения.Направление = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.Направление);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ТипДокумента) Тогда
			ДанныеСообщения.Тип = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.ТипДокумента);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ТипЭлементаРегламента) Тогда
			ДанныеСообщения.ТипЭлементаРегламента = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.ТипЭлементаРегламента);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Статус) Тогда
			ДанныеСообщения.Статус = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.Статус);
		КонецЕсли;
		ДанныеСообщения.ДатаИзмененияСтатуса = ОбщегоНазначенияБЭД.ДатаВФорматеISO(Выборка.ДатаИзмененияСтатуса);
		ДанныеСообщения.СопроводительнаяЗаписка = Выборка.ДополнительнаяИнформация;
		
		Если ЗначениеЗаполнено(Выборка.ТекстСообщения) Тогда
			ДанныеСообщения.ОписаниеТекстовогоСообщения = НовоеОписаниеТекстовогоСообщения();
			ЗаполнитьЗначенияСвойств(ДанныеСообщения.ОписаниеТекстовогоСообщения, Выборка);
		КонецЕсли;
		
		ДанныеСообщений.Добавить(ДанныеСообщения);
	КонецЦикла;
	
	Возврат ДанныеСообщений;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * Идентификатор - Строка
// * ИдентификаторСообщения - Строка
// * Имя - Строка
// * Данные - Строка - Двоичные данные в формате base64.
Функция НовыеДанныеФайлаСообщенияПолнойСинхронизацииДокумента()
	
	Данные = Новый Структура;
	Данные.Вставить("Идентификатор", "");
	Данные.Вставить("ИдентификаторСообщения", "");
	Данные.Вставить("Имя", "");
	Данные.Вставить("Данные", "");
	Возврат Данные;
	
КонецФункции

// Параметры:
//  ФайлыСообщений - Массив из СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
// 
// Возвращаемое значение:
//  Массив из см. НовыеДанныеФайлаСообщенияПолнойСинхронизацииДокумента
Функция ДанныеФайловСообщенийПолнойСинхронизацииДокумента(ФайлыСообщений)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДОПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла,
		|	СообщениеЭДОПрисоединенныеФайлы.Ссылка КАК Ссылка,
		|	СообщениеЭДОПрисоединенныеФайлы.ПолноеИмяФайла КАК ПолноеИмяФайла
		|ИЗ
		|	Справочник.СообщениеЭДОПрисоединенныеФайлы КАК СообщениеЭДОПрисоединенныеФайлы
		|ГДЕ
		|	СообщениеЭДОПрисоединенныеФайлы.Ссылка В (&ФайлыСообщений)";
	
	Запрос.УстановитьПараметр("ФайлыСообщений", ФайлыСообщений);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДвоичныеДанныеФайлов = РаботаСФайлами.ДвоичныеДанныеФайлов(ФайлыСообщений);
	
	ДанныеФайловСообщений = Новый Массив; // Массив из см. НовыеДанныеФайлаСообщенияПолнойСинхронизацииДокумента
	
	Пока Выборка.Следующий() Цикл
		ДвоичныеДанные = ДвоичныеДанныеФайлов[Выборка.Ссылка];
		
		ДанныеФайлаСообщения = НовыеДанныеФайлаСообщенияПолнойСинхронизацииДокумента();
		ДанныеФайлаСообщения.ИдентификаторСообщения = Строка(Выборка.ВладелецФайла.УникальныйИдентификатор());
		ДанныеФайлаСообщения.Идентификатор = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		ДанныеФайлаСообщения.Имя = Выборка.ПолноеИмяФайла;
		ДанныеФайлаСообщения.Данные = Base64Строка(ДвоичныеДанные);
		ДанныеФайловСообщений.Добавить(ДанныеФайлаСообщения);
	КонецЦикла;
	
	Возврат ДанныеФайловСообщений;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * Идентификатор - Строка
//  * ИдентификаторФайла - Строка
//  * ПорядковыйНомер - Число
//  * Подпись - Строка - Двоичные данные в формате base64.
//  * ИмяФайлаПодписи - Строка
//  * Сертификат - Строка - Двоичные данные в формате base64.
//  * ДатаПодписи - Строка - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ПодписьВерна - Булево
//  * ДатаПроверкиПодписи - Строка - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ТипПодписи - Строка
//  * СрокДействияПоследнейМеткиВремени - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ПропуститьПриПродлении - Булево
Функция НовыеДанныеПодписиФайлаПолнойСинхронизацииДокумента()
	
	Данные = Новый Структура;
	Данные.Вставить("Идентификатор", "");
	Данные.Вставить("ИдентификаторФайла", "");
	Данные.Вставить("ПорядковыйНомер", 0);
	Данные.Вставить("Подпись", "");
	Данные.Вставить("ИмяФайлаПодписи", "");
	Данные.Вставить("Сертификат", "");
	Данные.Вставить("ДатаПодписи", "");
	Данные.Вставить("ПодписьВерна", Ложь);
	Данные.Вставить("ДатаПроверкиПодписи", "");
	Данные.Вставить("ТипПодписи", "");
	Данные.Вставить("СрокДействияПоследнейМеткиВремени", "");
	Данные.Вставить("ПропуститьПриПродлении", Ложь);
	Возврат Данные;
	
КонецФункции

// Параметры:
//  КлючиПодписейФайлов - ТаблицаЗначений:
//  * ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  * ПорядковыйНомер - Число
// 
// Возвращаемое значение:
//  Массив из см. НовыеДанныеПодписиФайлаПолнойСинхронизацииДокумента
Функция ДанныеПодписейФайловПолнойСинхронизацииДокумента(КлючиПодписейФайлов)
	
	ДанныеПодписей = Новый Массив; // Массив из см. НовыеДанныеПодписиФайлаПолнойСинхронизацииДокумента
	
	УстановитьПривилегированныйРежим(Истина);
	УстановленныеПодписиОбъектов = КриптографияБЭД.УстановленныеПодписиОбъектов(КлючиПодписейФайлов);
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого УстановленныеПодписиОбъекта Из УстановленныеПодписиОбъектов Цикл
		ПодписанныйОбъект = УстановленныеПодписиОбъекта.Ключ; // СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
		СвойстваПодписей = УстановленныеПодписиОбъекта.Значение; // Массив из см. КриптографияБЭДКлиентСервер.НовыеСвойстваПодписи
		Для Каждого СвойстваПодписи Из СвойстваПодписей Цикл
			ДанныеПодписиФайла = НовыеДанныеПодписиФайлаПолнойСинхронизацииДокумента();
			ДанныеПодписиФайла.Идентификатор = Строка(СвойстваПодписи.ИдентификаторПодписи);
			ДанныеПодписиФайла.ИдентификаторФайла = Строка(ПодписанныйОбъект.УникальныйИдентификатор());
			ДанныеПодписиФайла.ПорядковыйНомер = СвойстваПодписи.ПорядковыйНомер;
			ДанныеПодписиФайла.ИмяФайлаПодписи = СвойстваПодписи.ИмяФайлаПодписи;
			ДанныеПодписиФайла.Подпись = Base64Строка(СвойстваПодписи.Подпись);
			ДанныеПодписиФайла.Сертификат = Base64Строка(СвойстваПодписи.Сертификат);
			ДанныеПодписиФайла.ДатаПодписи = ОбщегоНазначенияБЭД.ДатаВФорматеISO(СвойстваПодписи.ДатаПодписи);
			ДанныеПодписиФайла.ПодписьВерна = СвойстваПодписи.ПодписьВерна;
			ДанныеПодписиФайла.ДатаПроверкиПодписи = ОбщегоНазначенияБЭД.ДатаВФорматеISO(
				СвойстваПодписи.ДатаПроверкиПодписи);
			ДанныеПодписиФайла.ПропуститьПриПродлении = СвойстваПодписи.ПропуститьПриПродлении;
			Если ЗначениеЗаполнено(СвойстваПодписи.ТипПодписи) Тогда
				ДанныеПодписиФайла.ТипПодписи = ОбщегоНазначения.ИмяЗначенияПеречисления(СвойстваПодписи.ТипПодписи);
			КонецЕсли;
			Если ЗначениеЗаполнено(СвойстваПодписи.СрокДействияПоследнейМеткиВремени) Тогда
				ДанныеПодписиФайла.СрокДействияПоследнейМеткиВремени = ОбщегоНазначенияБЭД.ДатаВФорматеISO(
					СвойстваПодписи.СрокДействияПоследнейМеткиВремени);
			КонецЕсли;
			
			ДанныеПодписей.Добавить(ДанныеПодписиФайла);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ДанныеПодписей;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ИдентификаторФайла - Строка
//  * ХешПодписи - Строка
//  * Доверенность - Неопределено
//  * ПроверкаВыполнена - Булево
//  * ДатаПроверки - Строка - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ПодписьВерна - Булево
//  * ПротоколПроверки - Неопределено
//                     - см. МашиночитаемыеДоверенностиКлиентСервер.НовыйПротоколПроверкиМЧД
Функция НовыеДанныеПроверкиПодписиПолнойСинхронизацииДокумента()
	
	Данные = Новый Структура;
	Данные.Вставить("ИдентификаторФайла", "");
	Данные.Вставить("ХешПодписи", "");
	Данные.Вставить("Доверенность", Неопределено);
	Данные.Вставить("ПроверкаВыполнена", Ложь);
	Данные.Вставить("ДатаПроверки", "");
	Данные.Вставить("ПодписьВерна", Ложь);
	Данные.Вставить("ПротоколПроверки", Неопределено);
	Возврат Данные;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ИдентификаторФайла - Строка
//  * ХешПодписи - Строка
//  * ИдентификаторДоверенности - Строка
//  * ПроверкаВыполнена - Булево
//  * ДатаПроверки - Строка - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ПодписьВерна - Булево
//  * ПротоколПроверки - Неопределено
//                     - см. МашиночитаемыеДоверенностиКлиентСервер.НовыйПротоколПроверкиМЧД
Функция НовыеДанныеПроверкиПодписиПолнойСинхронизацииДокументаВерсия3()
	
	Данные = Новый Структура;
	Данные.Вставить("ИдентификаторФайла", "");
	Данные.Вставить("ХешПодписи", "");
	Данные.Вставить("ИдентификаторДоверенности", "");
	Данные.Вставить("ПроверкаВыполнена", Ложь);
	Данные.Вставить("ДатаПроверки", "");
	Данные.Вставить("ПодписьВерна", Ложь);
	Данные.Вставить("ПротоколПроверки", Неопределено);
	Возврат Данные;
	
КонецФункции

// Параметры:
//  КлючиПроверокПодписейПоМЧД - ТаблицаЗначений:
//  * ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  * ХешПодписи - Строка
//
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  * ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  * ХешПодписи - Строка
//  * Доверенность - ОпределяемыйТип.МашиночитаемаяДоверенность
//  * ПроверкаВыполнена - Булево
//  * ДатаПроверки - Дата
//  * ПодписьВерна - Булево
//  * ПротоколПроверки - ХранилищеЗначения
Функция ВыбратьЭлектронныеПодписиПоМЧД(КлючиПроверокПодписейПоМЧД)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КлючиПроверокПодписейПоМЧД.ПодписанныйОбъект КАК ПодписанныйОбъект,
		|	КлючиПроверокПодписейПоМЧД.ХешПодписи КАК ХешПодписи
		|ПОМЕСТИТЬ КлючиПроверокПодписейПоМЧД
		|ИЗ
		|	&КлючиПроверокПодписейПоМЧД КАК КлючиПроверокПодписейПоМЧД
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПодписанныйОбъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭлектронныеПодписиПоМЧД.ПодписанныйОбъект КАК ПодписанныйОбъект,
		|	ЭлектронныеПодписиПоМЧД.ХешПодписи КАК ХешПодписи,
		|	ЭлектронныеПодписиПоМЧД.Доверенность КАК Доверенность,
		|	ЭлектронныеПодписиПоМЧД.ПроверкаВыполнена КАК ПроверкаВыполнена,
		|	ЭлектронныеПодписиПоМЧД.ДатаПроверки КАК ДатаПроверки,
		|	ЭлектронныеПодписиПоМЧД.ПодписьВерна КАК ПодписьВерна,
		|	ЭлектронныеПодписиПоМЧД.ПротоколПроверки КАК ПротоколПроверки
		|ИЗ
		|	РегистрСведений.ЭлектронныеПодписиПоМЧД КАК ЭлектронныеПодписиПоМЧД
		|ГДЕ
		|	(ЭлектронныеПодписиПоМЧД.ПодписанныйОбъект, ЭлектронныеПодписиПоМЧД.ХешПодписи) В
		|		(ВЫБРАТЬ ПодписанныйОбъект, ХешПодписи ИЗ КлючиПроверокПодписейПоМЧД)";
	
	Запрос.УстановитьПараметр("КлючиПроверокПодписейПоМЧД", КлючиПроверокПодписейПоМЧД);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

// Параметры:
//  КлючиПроверокПодписейПоМЧД - ТаблицаЗначений:
//  * ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  * ХешПодписи - Строка
// 
// Возвращаемое значение:
//  Массив из см. НовыеДанныеПроверкиПодписиПолнойСинхронизацииДокумента
Функция ДанныеПроверокПодписейПолнойСинхронизацииДокумента(КлючиПроверокПодписейПоМЧД)
	
	ДанныеПроверок = Новый Массив; // Массив из см. НовыеДанныеПроверкиПодписиПолнойСинхронизацииДокумента
	
	Выборка = ВыбратьЭлектронныеПодписиПоМЧД(КлючиПроверокПодписейПоМЧД);
	
	Пока Выборка.Следующий() Цикл
		ДанныеПроверкиПодписи = НовыеДанныеПроверкиПодписиПолнойСинхронизацииДокумента();
		ДанныеПроверкиПодписи.ИдентификаторФайла = Строка(Выборка.ПодписанныйОбъект.УникальныйИдентификатор());
		ДанныеПроверкиПодписи.ХешПодписи = Выборка.ХешПодписи;
		ДанныеПроверкиПодписи.ПроверкаВыполнена = Выборка.ПроверкаВыполнена;
		ДанныеПроверкиПодписи.ДатаПроверки = ОбщегоНазначенияБЭД.ДатаВФорматеISO(Выборка.ДатаПроверки);
		ДанныеПроверкиПодписи.ПодписьВерна = Выборка.ПодписьВерна;
		
		Если ЗначениеЗаполнено(Выборка.Доверенность) Тогда
			ДанныеПроверкиПодписи.Доверенность = МашиночитаемыеДоверенностиЦентрЭДО.ДанныеДоверенностиВФорматеСервиса(
				Выборка.Доверенность);
		КонецЕсли;
		
		ПротоколПроверки = Выборка.ПротоколПроверки.Получить(); // См. МашиночитаемыеДоверенностиКлиентСервер.НовыйПротоколПроверкиМЧД
		Если ЗначениеЗаполнено(ПротоколПроверки) Тогда
			ДанныеПроверкиПодписи.ПротоколПроверки = ПротоколПроверки;
		КонецЕсли;
		
		ДанныеПроверок.Добавить(ДанныеПроверкиПодписи);
	КонецЦикла;
	
	Возврат ДанныеПроверок;
	
КонецФункции

// Параметры:
//  КлючиПроверокПодписейПоМЧД - ТаблицаЗначений:
//  * ПодписанныйОбъект - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  * ХешПодписи - Строка
// 
// Возвращаемое значение:
//  Массив из см. НовыеДанныеПроверкиПодписиПолнойСинхронизацииДокумента
Функция ДанныеПроверокПодписейПолнойСинхронизацииДокументаВерсия3(КлючиПроверокПодписейПоМЧД)
	
	ДанныеПроверок = Новый Массив; // Массив из см. НовыеДанныеПроверкиПодписиПолнойСинхронизацииДокумента
	
	Выборка = ВыбратьЭлектронныеПодписиПоМЧД(КлючиПроверокПодписейПоМЧД);
	
	Пока Выборка.Следующий() Цикл
		ДанныеПроверкиПодписи = НовыеДанныеПроверкиПодписиПолнойСинхронизацииДокументаВерсия3();
		ДанныеПроверкиПодписи.ИдентификаторФайла = Строка(Выборка.ПодписанныйОбъект.УникальныйИдентификатор());
		ДанныеПроверкиПодписи.ХешПодписи = Выборка.ХешПодписи;
		ДанныеПроверкиПодписи.ПроверкаВыполнена = Выборка.ПроверкаВыполнена;
		ДанныеПроверкиПодписи.ДатаПроверки = ОбщегоНазначенияБЭД.ДатаВФорматеISO(Выборка.ДатаПроверки);
		ДанныеПроверкиПодписи.ПодписьВерна = Выборка.ПодписьВерна;
		
		Если ЗначениеЗаполнено(Выборка.Доверенность) Тогда
			ДанныеПроверкиПодписи.ИдентификаторДоверенности =
				МашиночитаемыеДоверенностиЦентрЭДО.ИдентификаторДоверенности(Выборка.Доверенность);
		КонецЕсли;
		
		ПротоколПроверки = Выборка.ПротоколПроверки.Получить(); // См. МашиночитаемыеДоверенностиКлиентСервер.НовыйПротоколПроверкиМЧД
		Если ЗначениеЗаполнено(ПротоколПроверки) Тогда
			ДанныеПроверкиПодписи.ПротоколПроверки = ПротоколПроверки;
		КонецЕсли;
		
		ДанныеПроверок.Добавить(ДанныеПроверкиПодписи);
	КонецЦикла;
	
	Возврат ДанныеПроверок;
	
КонецФункции
// Возвращаемое значение:
//  Структура:
// * Тип - Строка - см. Перечисление.ТипыСобытийДокументаЦентраЭДО
// * Параметры - Неопределено,Структура
Функция НовоеСобытиеПолнойСинхронизацииДокумента()
	
	Событие = Новый Структура;
	Событие.Вставить("Тип", "");
	Событие.Вставить("Параметры", Неопределено);
	Возврат Событие;
	
КонецФункции

// События полной синхронизации документа.
// 
// Параметры:
//  ТипыСобытий - Массив из ПеречислениеСсылка.ТипыСобытийДокументаЦентраЭДО
//  ИдентификаторДокумента - Строка
// 
// Возвращаемое значение:
//  Массив из см. НовоеСобытиеПолнойСинхронизацииДокумента
Функция СобытияПолнойСинхронизацииДокумента(ТипыСобытий, ИдентификаторДокумента)
	
	События = Новый Массив; // см. СобытияПолнойСинхронизацииДокумента 
	
	Для Каждого ТипСобытия Из ТипыСобытий Цикл
		Событие = НовоеСобытиеПолнойСинхронизацииДокумента();
		Событие.Тип = ОбщегоНазначения.ИмяЗначенияПеречисления(ТипСобытия);
		Если ТипСобытия = Перечисления.ТипыСобытийДокументаЦентраЭДО.ПослеПолученияПоСчетуФактуреПДП
			Или ТипСобытия = Перечисления.ТипыСобытийДокументаЦентраЭДО.ПослеПолученияПоСчетуФактуреПДО
			Или ТипСобытия = Перечисления.ТипыСобытийДокументаЦентраЭДО.ПослеПолученияПоСчетуФактуреИОП
			Или ТипСобытия = Перечисления.ТипыСобытийДокументаЦентраЭДО.ПослеПолученияПоСчетуФактуреИОП_ПДО Тогда
			Событие.Параметры = ПараметрыСобытияПослеЗагрузкиПодтвержденияПоСчетуФактуре(ИдентификаторДокумента);
		КонецЕсли;
		События.Добавить(Событие);
	КонецЦикла;
	
	Возврат События;
	
КонецФункции

// Параметры:
//  ИдентификаторДокумента - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Подтверждения - Массив из см. НовоеОписаниеПодтвержденияПоСчетуФактуре
Функция ПараметрыСобытияПослеЗагрузкиПодтвержденияПоСчетуФактуре(ИдентификаторДокумента)
	
	Подтверждения = Новый Массив; // Массив из см. НовоеОписаниеПодтвержденияПоСчетуФактуре
	
	ЭлектронныйДокумент = ДокументПоИдентификатору(ИдентификаторДокумента);
	ТипыЭлементовРегламента = Новый Массив; // Массив из ПеречислениеСсылка.ТипыЭлементовРегламентаЭДО
	ТипыЭлементовРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ПДП);
	ТипыЭлементовРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ПДО);
	ТипыЭлементовРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИОП);
	ТипыЭлементовРегламента.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИОП_ПДП);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СообщениеЭДО.Дата КАК Дата
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент
		|	И СообщениеЭДО.ТипЭлементаРегламента В (&ТипыЭлементовРегламента)";
	
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	Запрос.УстановитьПараметр("ТипыЭлементовРегламента", ТипыЭлементовРегламента);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		ДобавитьОписаниеПодтвержденияПоСчетуФактуре(Подтверждения, Выборка.ТипЭлементаРегламента, Выборка.Дата);
		Индекс = ТипыЭлементовРегламента.Найти(Выборка.ТипЭлементаРегламента);
		Если Индекс <> Неопределено Тогда
			ТипыЭлементовРегламента.Удалить(Индекс);
		КонецЕсли;
	КонецЦикла;
	
	Параметры = Новый Структура("Подтверждения", Подтверждения);
	Возврат Параметры;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * Тип - Строка
// * Дата - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
Функция НовоеОписаниеПодтвержденияПоСчетуФактуре()
	Описание = Новый Структура;
	Описание.Вставить("Тип", "");
	Описание.Вставить("Дата", "");
	Возврат Описание;
КонецФункции

// Параметры:
//  ОписанияПодтверждений - Массив из см. НовоеОписаниеПодтвержденияПоСчетуФактуре
//  ТипЭлементаРегламента - ПеречислениеСсылка.ТипыЭлементовРегламентаЭДО
//  Дата - Дата
Процедура ДобавитьОписаниеПодтвержденияПоСчетуФактуре(ОписанияПодтверждений, ТипЭлементаРегламента, Дата)
	ОписаниеПодтверждения = НовоеОписаниеПодтвержденияПоСчетуФактуре();
	ОписаниеПодтверждения.Тип = ОбщегоНазначения.ИмяЗначенияПеречисления(ТипЭлементаРегламента);
	ОписаниеПодтверждения.Дата = ОбщегоНазначенияБЭД.ДатаВФорматеISO(Дата);
	ОписанияПодтверждений.Добавить(ОписаниеПодтверждения);
КонецПроцедуры

#КонецОбласти

#Область Переформирование

// Параметры:
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  Строка - Текст ошибки не удалось найти электронные документы по идентификаторам
Функция ТекстОшибкиНеУдалосьНайтиЭлектронныйДокументПоИдентификатору(Идентификатор)
	
	Возврат СтрШаблон(НСтр("ru = 'Не удалось найти электронный документ по идентификатору ""%1""'"),
		Идентификатор);
			
КонецФункции

#КонецОбласти // Переформирование

#Область ПереходВЦентрЭДО

// Параметры:
//  ПолныеДанные - см. ЗагрузитьПолныеДанныеДокументаЭДО.ПолныеДанные
// 
// Возвращаемое значение:
//  См. НовоеСопоставлениеДанныхДокументаЭДО
Функция ЗагрузитьСопоставитьДокументИзПолныхДанных(ПолныеДанные) Экспорт
	
	ЭтоВходящийЭДО = ПолныеДанные.Описание.ЭтоВходящийЭДО;
	ИдентификаторДокументооборота = ПолныеДанные.Описание.ИдентификаторДокументооборота;
	ЭлектронныйДокумент = ЭлектронныеДокументыЭДО.НайтиПоИдентификаторуДокументооборота(
		ИдентификаторДокументооборота, ЭтоВходящийЭДО);
	
	Если ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
		
		СопоставлениеДанных = СопоставитьПолныеДанныеДокументаЭДО(ПолныеДанные, ЭлектронныйДокумент);
		
	Иначе
		
		СопоставлениеДанных = ЗагрузитьДокументИзПолныхДанных(ПолныеДанные);
		
	КонецЕсли;
	
	Возврат СопоставлениеДанных;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * Документ - См. НовоеСопоставлениеИдентификаторовОбъекта
//  * Сообщения - Массив из см. НовоеСопоставлениеИдентификаторовОбъекта
//  * ФайлыСообщений - Массив из см. НовоеСопоставлениеИдентификаторовОбъекта
//  * Доверенности - Массив из см. НовоеСопоставлениеИдентификаторовОбъекта
Функция НовоеСопоставлениеДанныхДокументаЭДО()
	
	Сопоставление = Новый Структура;
	Сопоставление.Вставить("Документ", НовоеСопоставлениеИдентификаторовОбъекта());
	Сопоставление.Вставить("Сообщения", Новый Массив);
	Сопоставление.Вставить("ФайлыСообщений", Новый Массив);
	Сопоставление.Вставить("Доверенности", Новый Массив);
	Возврат Сопоставление;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * Идентификатор - Строка
//  * ИдентификаторСервиса - Строка
Функция НовоеСопоставлениеИдентификаторовОбъекта()
	
	Сопоставление = Новый Структура;
	Сопоставление.Вставить("Идентификатор", "");
	Сопоставление.Вставить("ИдентификаторСервиса", "");
	Возврат Сопоставление;
	
КонецФункции

// Параметры:
//  ПолныеДанные - см. ЗагрузитьПолныеДанныеДокументаЭДО.ПолныеДанные
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
// 
// Возвращаемое значение:
//  См. НовоеСопоставлениеДанныхДокументаЭДО
Функция СопоставитьПолныеДанныеДокументаЭДО(ПолныеДанные, ЭлектронныйДокумент)
	
	Результат = НовоеСопоставлениеДанныхДокументаЭДО();
	
	Результат.Документ.Идентификатор = ПолныеДанные.Описание.Идентификатор;
	Результат.Документ.ИдентификаторСервиса = Строка(ЭлектронныйДокумент.УникальныйИдентификатор());
	
	СведенияСообщений = СведенияСообщенийДокументаДляСопоставления(ЭлектронныйДокумент);
	
	СопоставлениеФайлов = Результат.ФайлыСообщений;
	СопоставлениеСообщений = Результат.Сообщения;
	
	СопоставленныеСообщения = Новый Соответствие;
	
	Для Каждого ФайлСообщения Из ПолныеДанные.ФайлыСообщений Цикл
		СведенияСообщения = СведенияСообщений.Найти(ФайлСообщения.Имя, "ПолноеИмяФайла");
		Если СведенияСообщения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СопоставлениеФайла = НовоеСопоставлениеИдентификаторовОбъекта();
		СопоставлениеФайла.Идентификатор = ФайлСообщения.Идентификатор;
		СопоставлениеФайла.ИдентификаторСервиса = Строка(СведенияСообщения.ПрисоединенныйФайл.УникальныйИдентификатор());
		СопоставлениеФайлов.Добавить(СопоставлениеФайла);
		
		Если СопоставленныеСообщения[ФайлСообщения.ИдентификаторСообщения] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СопоставленныеСообщения.Вставить(ФайлСообщения.ИдентификаторСообщения, Истина);
		
		СопоставлениеСообщения = НовоеСопоставлениеИдентификаторовОбъекта();
		СопоставлениеСообщения.Идентификатор = ФайлСообщения.ИдентификаторСообщения;
		СопоставлениеСообщения.ИдентификаторСервиса = Строка(СведенияСообщения.Ссылка.УникальныйИдентификатор());
		СопоставлениеСообщений.Добавить(СопоставлениеСообщения);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * Ссылка - ДокументСсылка.СообщениеЭДО
//  * ТипЭлементаРегламента - ПеречислениеСсылка.ТипыЭлементовРегламентаЭДО
//  * ПрисоединенныйФайл - СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
//  * ПолноеИмяФайла - Строка
Функция СведенияСообщенийДокументаДляСопоставления(ЭлектронныйДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщениеЭДО.Ссылка КАК Ссылка,
		|	СообщениеЭДО.ТипЭлементаРегламента КАК ТипЭлементаРегламента,
		|	СообщениеЭДОПрисоединенныеФайлы.Ссылка КАК ПрисоединенныйФайл,
		|	СообщениеЭДОПрисоединенныеФайлы.ПолноеИмяФайла КАК ПолноеИмяФайла
		|ИЗ
		|	Документ.СообщениеЭДО КАК СообщениеЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СообщениеЭДОПрисоединенныеФайлы КАК СообщениеЭДОПрисоединенныеФайлы
		|		ПО СообщениеЭДО.Ссылка = СообщениеЭДОПрисоединенныеФайлы.ВладелецФайла
		|ГДЕ
		|	СообщениеЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент";
	
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Параметры:
//  ПолныеДанные - см. ЗагрузитьПолныеДанныеДокументаЭДО.ПолныеДанные
// 
// Возвращаемое значение:
//  См. НовоеСопоставлениеДанныхДокументаЭДО
Функция ЗагрузитьДокументИзПолныхДанных(ПолныеДанные)
	
	Результат = НовоеСопоставлениеДанныхДокументаЭДО();
	
	ИдентификаторыОбъектов = НовыеИдентификаторыЗагруженныхОбъектов();
	
	Результат.Документ = ЗагрузитьОписаниеДокументаИзПолныхДанных(ПолныеДанные, ИдентификаторыОбъектов);
	
	Результат.Сообщения = ЗагрузитьСообщенияИзПолныхДанных(ПолныеДанные, ИдентификаторыОбъектов);
	
	Результат.ФайлыСообщений = ЗагрузитьФайлыСообщенийИзПолныхДанных(ПолныеДанные, ИдентификаторыОбъектов);
	
	Результат.Доверенности = ЗагрузитьДоверенностиИзПолныхДанных(ПолныеДанные, ИдентификаторыОбъектов);
	
	ЗагрузитьПодписиФайловИзПолныхДанных(ПолныеДанные, ИдентификаторыОбъектов);
	
	ЗагрузитьПроверкиПодписейПоМЧДИзПолныхДанных(ПолныеДанные, ИдентификаторыОбъектов);
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка
//  * Значение - ЛюбаяСсылка
Функция НовыеИдентификаторыЗагруженныхОбъектов()
	Возврат Новый Соответствие;
КонецФункции

// Параметры:
//  ПолныеДанные - См. ЗагрузитьДокументИзПолныхДанных.ПолныеДанные
//  ИдентификаторыОбъектов - См. НовыеИдентификаторыЗагруженныхОбъектов
// 
// Возвращаемое значение:
//  См. НовоеСопоставлениеИдентификаторовОбъекта
Функция ЗагрузитьОписаниеДокументаИзПолныхДанных(ПолныеДанные, ИдентификаторыОбъектов)
	
	ОписаниеДокумента = ПолныеДанные.Описание;
	
	Если ОписаниеДокумента.ЭтоВходящийЭДО Тогда
		ДокументОбъект = Документы.ЭлектронныйДокументВходящийЭДО.СоздатьДокумент(); // ДокументОбъект.ЭлектронныйДокументВходящийЭДО,ДокументОбъект.ЭлектронныйДокументИсходящийЭДО 
	Иначе
		ДокументОбъект = Документы.ЭлектронныйДокументИсходящийЭДО.СоздатьДокумент();
	КонецЕсли;
	
	ДокументОбъект.Дата = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(ОписаниеДокумента.Дата);
	ДокументОбъект.ИдентификаторДокумента = ОписаниеДокумента.Идентификатор;
	ДокументОбъект.ФорматОсновногоТитула = ОписаниеДокумента.Формат;
	ДокументОбъект.НомерДокумента = ОписаниеДокумента.Номер;
	ДокументОбъект.ДатаДокумента = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(ОписаниеДокумента.ДатаДокумента);
	ДокументОбъект.ДатаАннулирования = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(ОписаниеДокумента.ДатаАннулирования);
	ДокументОбъект.ДатаПодписания = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(ОписаниеДокумента.ДатаПодписания);
	ДокументОбъект.СуммаДокумента = ОписаниеДокумента.Сумма;
	ДокументОбъект.ТребуетсяИзвещение = ОписаниеДокумента.ТребуетсяИзвещение;
	ДокументОбъект.ТребуетсяПодтверждение = ОписаниеДокумента.ТребуетсяПодтверждение;
	ДокументОбъект.ИдентификаторОрганизации = ОписаниеДокумента.ИдентификаторОрганизации;
	ДокументОбъект.ИдентификаторКонтрагента = ОписаниеДокумента.ИдентификаторКонтрагента;
	ДокументОбъект.ИдентификаторДокументооборота = ОписаниеДокумента.ИдентификаторДокументооборота;
	
	ДокументОбъект.Организация = ИнтеграцияЭДО.ОрганизацияПоКлючевымРеквизитам(ОписаниеДокумента.Организация);
	ДокументОбъект.Контрагент = ИнтеграцияЭДО.КонтрагентПоКлючевымРеквизитам(ОписаниеДокумента.Контрагент);
	
	ДокументОбъект.ВидДокумента = ВидДокументаИзФорматаСервиса(ОписаниеДокумента.ВидДокумента);
	ДокументОбъект.ТипРегламента = ТипРегламентаИзФорматаСервиса(ОписаниеДокумента.ТипРегламента);
	ДокументОбъект.СпособОбмена = СпособОбменаИзФорматаСервиса(ОписаниеДокумента.СпособОбмена);
	
	Если ОписаниеДокумента.ЭтоВходящийЭДО Тогда
		ДокументОбъект.ДатаПолучения = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(ОписаниеДокумента.ДатаОтправкиПолучения);
	Иначе
		ДокументОбъект.ДатаОтправки = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(ОписаниеДокумента.ДатаОтправкиПолучения);
		ДокументОбъект.МаршрутПодписания = Справочники.МаршрутыПодписания.ОднойДоступнойПодписью;
	КонецЕсли;
	
	ДокументОбъект.Записать();
	
	ДатаИзмененияСостояния = ДокументОбъект.Дата;
	Если ЗначениеЗаполнено(ОписаниеДокумента.ДатаИзмененияСостояния) Тогда
		ДатаИзмененияСостояния = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(ОписаниеДокумента.ДатаИзмененияСостояния);
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СостоянияДокументовЭДО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЭлектронныйДокумент.Установить(ДокументОбъект.Ссылка);
	
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.ЭлектронныйДокумент = ДокументОбъект.Ссылка;
	ЗаписьНабора.Состояние = СостояниеДокументаИзФорматаСервиса(ОписаниеДокумента.ИмяСостояния);
	ЗаписьНабора.СостояниеДополнение = ОписаниеДокумента.СостояниеДополнение;
	ЗаписьНабора.ДатаИзменения = ДатаИзмененияСостояния;
	ЗаписьНабора.Комментарий = ОписаниеДокумента.КомментарийСостояния;
	
	НаборЗаписей.Записать();
	
	ИдентификаторыОбъектов.Вставить(ОписаниеДокумента.Идентификатор, ДокументОбъект.Ссылка);
	
	Сопоставление = НовоеСопоставлениеИдентификаторовОбъекта();
	Сопоставление.Идентификатор = ОписаниеДокумента.Идентификатор;
	Сопоставление.ИдентификаторСервиса = Строка(ДокументОбъект.Ссылка.УникальныйИдентификатор());
	Возврат Сопоставление;
	
КонецФункции

// Параметры:
//  ПолныеДанные - См. ЗагрузитьДокументИзПолныхДанных.ПолныеДанные
//  ИдентификаторыОбъектов - См. НовыеИдентификаторыЗагруженныхОбъектов
// 
// Возвращаемое значение:
//  Массив из см. НовоеСопоставлениеИдентификаторовОбъекта
Функция ЗагрузитьСообщенияИзПолныхДанных(ПолныеДанные, ИдентификаторыОбъектов)
	
	НаборСопоставлений = Новый Массив; // Массив из см. НовоеСопоставлениеИдентификаторовОбъекта
	ДанныеСообщений = ПолныеДанные.Сообщения;
	
	Для Каждого ДанныеСообщения Из ДанныеСообщений Цикл
		СообщениеОбъект = Документы.СообщениеЭДО.СоздатьДокумент();
		СообщениеОбъект.Дата = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(ДанныеСообщения.Дата);
		ЭлектронныйДокумент = ИдентификаторыОбъектов[ДанныеСообщения.ИдентификаторДокумента]; // ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
		СообщениеОбъект.ЭлектронныйДокумент = ЭлектронныйДокумент;
		ТипСообщения = ТипДокументаИзФорматаСервиса(ДанныеСообщения.Тип);
		СообщениеОбъект.ВидСообщения = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(ТипСообщения);
		СообщениеОбъект.Направление = НаправлениеИзФорматаСервиса(ДанныеСообщения.Направление);
		СообщениеОбъект.ТипЭлементаРегламента = ТипЭлементаРегламентаИзФорматаСервиса(
			ДанныеСообщения.ТипЭлементаРегламента);
		СообщениеОбъект.Статус = СтатусСообщенияИзФорматаСервиса(ДанныеСообщения.Статус);
		СообщениеОбъект.ДатаИзмененияСтатуса = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(
			ДанныеСообщения.ДатаИзмененияСтатуса);
		СообщениеОбъект.Состояние = СостояниеСообщенияИзФорматаСервиса(ДанныеСообщения.Состояние);
		СообщениеОбъект.ОсновнойФайл = Справочники.СообщениеЭДОПрисоединенныеФайлы.ПолучитьСсылку();
		СообщениеОбъект.ДополнительнаяИнформация = ДанныеСообщения.СопроводительнаяЗаписка;
		СообщениеОбъект.Записать();
		
		СвойстваСообщения = Новый Структура("Ссылка, Состояние", СообщениеОбъект.Ссылка, СообщениеОбъект.Состояние);
		ЭлектронныеДокументыЭДО.СформироватьМаршрутПодписания(СвойстваСообщения);
		
		ИдентификаторыОбъектов.Вставить(ДанныеСообщения.Идентификатор, СообщениеОбъект.Ссылка);
		ИдентификаторыОбъектов.Вставить(ДанныеСообщения.ИдентификаторОсновногоФайла, СообщениеОбъект.ОсновнойФайл);
		
		Если ЗначениеЗаполнено(ДанныеСообщения.ОписаниеТекстовогоСообщения) Тогда
			РегистрыСведений.ТекстовыеСообщенияДокументовЭДО.ДобавитьСообщение(
				СообщениеОбъект.Ссылка, 
				ДанныеСообщения.ОписаниеТекстовогоСообщения.ТекстСообщения);
		КонецЕсли;
		
		Сопоставление = НовоеСопоставлениеИдентификаторовОбъекта();
		Сопоставление.Идентификатор = ДанныеСообщения.Идентификатор;
		Сопоставление.ИдентификаторСервиса = Строка(СообщениеОбъект.Ссылка.УникальныйИдентификатор());
		НаборСопоставлений.Добавить(Сопоставление);
	КонецЦикла;
	
	Возврат НаборСопоставлений;
	
КонецФункции

// Параметры:
//  ПолныеДанные - См. ЗагрузитьДокументИзПолныхДанных.ПолныеДанные
//  ИдентификаторыОбъектов - См. НовыеИдентификаторыЗагруженныхОбъектов
// 
// Возвращаемое значение:
//  Массив из см. НовоеСопоставлениеИдентификаторовОбъекта
Функция ЗагрузитьФайлыСообщенийИзПолныхДанных(ПолныеДанные, ИдентификаторыОбъектов)
	
	НаборСопоставлений = Новый Массив; // Массив из см. НовоеСопоставлениеИдентификаторовОбъекта
	ДанныеФайловСообщений = ПолныеДанные.ФайлыСообщений;
	
	Для Каждого ДанныеФайлаСообщения Из ДанныеФайловСообщений Цикл
		Сообщение = ИдентификаторыОбъектов[ДанныеФайлаСообщения.ИдентификаторСообщения]; // ДокументСсылка.СообщениеЭДО
		НоваяСсылкаНаФайл = ИдентификаторыОбъектов[ДанныеФайлаСообщения.Идентификатор]; // Неопределено,СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
		Файл = Новый Файл(ДанныеФайлаСообщения.Имя);
		ДвоичныеДанные = Base64Значение(ДанныеФайлаСообщения.Данные);
		АдресДвоичныхДанных = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		ПараметрыДобавленияФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
		ПараметрыДобавленияФайла.ВладелецФайлов = Сообщение;
		ПараметрыДобавленияФайла.Служебный = Истина;
		ПараметрыДобавленияФайла.Автор = Пользователи.ТекущийПользователь();
		ПараметрыДобавленияФайла.ИмяБезРасширения = Файл.ИмяБезРасширения;
		ПараметрыДобавленияФайла.РасширениеБезТочки = СтрЗаменить(Файл.Расширение,".","");
		ПараметрыДобавленияФайла.Вставить("ПолноеИмяФайла", Файл.ПолноеИмя);
		СсылкаНаФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыДобавленияФайла, АдресДвоичныхДанных,,,НоваяСсылкаНаФайл);
		
		ИдентификаторыОбъектов.Вставить(ДанныеФайлаСообщения.Идентификатор, СсылкаНаФайл);
		
		Сопоставление = НовоеСопоставлениеИдентификаторовОбъекта();
		Сопоставление.Идентификатор = ДанныеФайлаСообщения.Идентификатор;
		Сопоставление.ИдентификаторСервиса = Строка(СсылкаНаФайл.УникальныйИдентификатор());
		НаборСопоставлений.Добавить(Сопоставление);
	КонецЦикла;
	
	Возврат НаборСопоставлений;
	
КонецФункции

// Параметры:
//  ПолныеДанные - См. ЗагрузитьДокументИзПолныхДанных.ПолныеДанные
//  ИдентификаторыОбъектов - См. НовыеИдентификаторыЗагруженныхОбъектов
// 
// Возвращаемое значение:
//  Массив из см. НовоеСопоставлениеИдентификаторовОбъекта
Функция ЗагрузитьДоверенностиИзПолныхДанных(ПолныеДанные, ИдентификаторыОбъектов)
	
	НаборСопоставлений = Новый Массив; // Массив из см. НовоеСопоставлениеИдентификаторовОбъекта
	
	ДанныеДоверенностей = ПолныеДанные.Доверенности;
	Если Не ЗначениеЗаполнено(ДанныеДоверенностей) Тогда
		Возврат НаборСопоставлений;
	КонецЕсли;
	
	Для Каждого ДанныеДоверенности Из ДанныеДоверенностей Цикл
		
		Если ЗначениеЗаполнено(ДанныеДоверенности.ИдентификаторСервиса) Тогда
			Доверенность = МашиночитаемыеДоверенностиЦентрЭДО.ДоверенностьПоИдентификатору(
				ДанныеДоверенности.ИдентификаторСервиса);
			ИдентификаторыОбъектов.Вставить(ДанныеДоверенности.Идентификатор, Доверенность);
			Продолжить;
		КонецЕсли;
		
		ДвоичныеДанныеДоверенности = Base64Значение(ДанныеДоверенности.Данные);
		РезультатЗагрузки = МашиночитаемыеДоверенности.ЗагрузитьМЧДИзФайла(ДвоичныеДанныеДоверенности);
		Если Не ЗначениеЗаполнено(РезультатЗагрузки.МЧД) Тогда
			ВызватьИсключение РезультатЗагрузки.ТекстОшибки;
		КонецЕсли;
		
		ИдентификаторыОбъектов.Вставить(ДанныеДоверенности.Идентификатор, РезультатЗагрузки.МЧД);
		
		Сопоставление = НовоеСопоставлениеИдентификаторовОбъекта();
		Сопоставление.Идентификатор = ДанныеДоверенности.Идентификатор;
		Сопоставление.ИдентификаторСервиса = Строка(РезультатЗагрузки.МЧД.УникальныйИдентификатор());
		НаборСопоставлений.Добавить(Сопоставление);
		
	КонецЦикла;
	
	Возврат НаборСопоставлений;
	
КонецФункции

// Параметры:
//  ПолныеДанные - См. ЗагрузитьДокументИзПолныхДанных.ПолныеДанные
//  ИдентификаторыОбъектов - См. НовыеИдентификаторыЗагруженныхОбъектов
Процедура ЗагрузитьПодписиФайловИзПолныхДанных(ПолныеДанные, ИдентификаторыОбъектов)
	
	ДанныеПодписейФайлов = ПолныеДанные.ПодписиФайлов;
	Если Не ЗначениеЗаполнено(ДанныеПодписейФайлов) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеПодписиФайла Из ДанныеПодписейФайлов Цикл
		ПодписанныйОбъект = ИдентификаторыОбъектов[ДанныеПодписиФайла.ИдентификаторФайла]; // СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
		СвойстваПодписи = ЭлектроннаяПодписьКлиентСервер.НовыеСвойстваПодписи();
		СвойстваПодписи.ИдентификаторПодписи = Новый УникальныйИдентификатор(ДанныеПодписиФайла.Идентификатор);
		СвойстваПодписи.ПорядковыйНомер = ДанныеПодписиФайла.ПорядковыйНомер;
		СвойстваПодписи.Подпись = Base64Значение(ДанныеПодписиФайла.Подпись);
		Если ЗначениеЗаполнено(ДанныеПодписиФайла.Сертификат) Тогда
			СвойстваПодписи.Сертификат = Base64Значение(ДанныеПодписиФайла.Сертификат);
		КонецЕсли;
		СвойстваПодписи.ДатаПодписи = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(ДанныеПодписиФайла.ДатаПодписи);
		СвойстваПодписи.ПодписьВерна = ДанныеПодписиФайла.ПодписьВерна;
		СвойстваПодписи.ДатаПроверкиПодписи = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(
			ДанныеПодписиФайла.ДатаПроверкиПодписи);
		СвойстваПодписи.ПропуститьПриПродлении = ДанныеПодписиФайла.ПропуститьПриПродлении;
		Если ЗначениеЗаполнено(ДанныеПодписиФайла.ТипПодписи) Тогда
			СвойстваПодписи.ТипПодписи = ТипПодписиИзФорматаСервиса(ДанныеПодписиФайла.ТипПодписи);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеПодписиФайла.СрокДействияПоследнейМеткиВремени) Тогда
			СвойстваПодписи.СрокДействияПоследнейМеткиВремени = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(
				ДанныеПодписиФайла.СрокДействияПоследнейМеткиВремени);
		КонецЕсли;
		Если СвойстваПодписи.Сертификат <> Неопределено Тогда
			СвойстваСертификата = ЭлектроннаяПодпись.СвойстваСертификата(СвойстваПодписи.Сертификат);
			СвойстваПодписи.Отпечаток = СвойстваСертификата.Отпечаток;
			СвойстваПодписи.КомуВыданСертификат = СвойстваСертификата.КомуВыдан;
		КонецЕсли;
		
		ПараметрыПолученияПодписей = ЭлектроннаяПодпись.НовыйПараметрыПолученияПодписейОбъекта();
		ПараметрыПолученияПодписей.ПорядковыйНомер = ДанныеПодписиФайла.ПорядковыйНомер;
		УстановленныеПодписи = ЭлектроннаяПодпись.ПодписиОбъекта(
			ПодписанныйОбъект, ПараметрыПолученияПодписей);
		
		Если ЗначениеЗаполнено(УстановленныеПодписи) Тогда
			ЭлектроннаяПодпись.ОбновитьПодпись(ПодписанныйОбъект, СвойстваПодписи, Истина);
		Иначе
			ЭлектроннаяПодпись.ДобавитьПодпись(ПодписанныйОбъект, СвойстваПодписи);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  ПолныеДанные - См. ЗагрузитьДокументИзПолныхДанных.ПолныеДанные
//  ИдентификаторыОбъектов - См. НовыеИдентификаторыЗагруженныхОбъектов
Процедура ЗагрузитьПроверкиПодписейПоМЧДИзПолныхДанных(ПолныеДанные, ИдентификаторыОбъектов)
	
	ДанныеПроверокПодписейПоМЧД = ПолныеДанные.ПроверкиПодписейПоМЧД;
	Если Не ЗначениеЗаполнено(ДанныеПроверокПодписейПоМЧД) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеПроверкиПодписиПоМЧД Из ДанныеПроверокПодписейПоМЧД Цикл
		ПодписанныйОбъект = ИдентификаторыОбъектов[ДанныеПроверкиПодписиПоМЧД.ИдентификаторФайла]; // СправочникСсылка.СообщениеЭДОПрисоединенныеФайлы
		Доверенность = ИдентификаторыОбъектов[ДанныеПроверкиПодписиПоМЧД.ИдентификаторДоверенности]; // ОпределяемыйТип.МашиночитаемаяДоверенность
		РезультатПроверки = МашиночитаемыеДоверенности.НовыйРезультатПроверкиПодписи();
		РезультатПроверки.ПроверкаВыполнена = ДанныеПроверкиПодписиПоМЧД.ПроверкаВыполнена;
		РезультатПроверки.ДатаПроверки = ОбщегоНазначенияБЭД.ДатаИзФорматаISO(
			ДанныеПроверкиПодписиПоМЧД.ДатаПроверки);
		РезультатПроверки.ПодписьВерна = ДанныеПроверкиПодписиПоМЧД.ПодписьВерна;
		РезультатПроверки.Доверенность = Доверенность;
		РезультатПроверки.ТребуетсяДоверенность = Истина;
		
		Если ЗначениеЗаполнено(ДанныеПроверкиПодписиПоМЧД.ПротоколПроверки) Тогда
			ДанныеПротоколаПроверки = Base64Значение(ДанныеПроверкиПодписиПоМЧД.ПротоколПроверки);
			ПротоколПроверкиСтрокой = ПолучитьСтрокуИзДвоичныхДанных(ДанныеПротоколаПроверки);
			ПротоколПроверки = МашиночитаемыеДоверенности.ПрочитатьПротоколПроверкиJSON(ПротоколПроверкиСтрокой);
			РезультатПроверки.ПротоколПроверки = ПротоколПроверки;
		КонецЕсли;
		
		МашиночитаемыеДоверенности.ЗаписатьРезультатПроверкиПодписи(ПодписанныйОбъект,
			ДанныеПроверкиПодписиПоМЧД.ХешПодписи, РезультатПроверки);
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  ИдентификаторПакета - УникальныйИдентификатор
//  ЭлектронныеДокументы - Массив из ДокументСсылка.ЭлектронныйДокументВходящийЭДО,ДокументСсылка.ЭлектронныйДокументИсходящийЭДО
Процедура ОбъединитьДокументыВПакет(ИдентификаторПакета, ЭлектронныеДокументы)
	
	Если Не ЗначениеЗаполнено(ЭлектронныеДокументы) Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваДокументовДляОписанияПакетов = ЭлектронныеДокументыЭДО.СвойстваДокументовДляОписанияПакетов(
		ЭлектронныеДокументы);

	РегистрыСведений.ПакетыДокументовЭДО.Удалить(ИдентификаторПакета);
	РегистрыСведений.ПакетыДокументовЭДО.ОбновитьОписание(ИдентификаторПакета, СвойстваДокументовДляОписанияПакетов);
	
	ТекущиеДокументыПакета = ПакетыДокументовЭДО.ДокументыПакета(ИдентификаторПакета);
	Для Каждого ТекущийДокументПакета Из ТекущиеДокументыПакета Цикл
		РегистрыСведений.СоставПакетовДокументовЭДО.Удалить(ТекущийДокументПакета);
	КонецЦикла;
	
	Для Каждого ЭлектронныйДокумент Из ЭлектронныеДокументы Цикл
		СвойстваДокумента = СвойстваДокументовДляОписанияПакетов.Найти(ЭлектронныйДокумент, "Ссылка");
		РегистрыСведений.СоставПакетовДокументовЭДО.Записать(ИдентификаторПакета, ЭлектронныйДокумент,
			СвойстваДокумента);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область МеткиВремени

// Параметры:
//  ИдентификаторыДокументовЭДО - Массив из Строка
//  ТипСинхронизации - ПеречислениеСсылка.ТипыСинхронизацииСЦентромЭДО
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ИдентификаторДокументаЭДО - Строка
//  * МеткаВремени - Число
Функция МеткиВремениДокументовЭДОПоТипуСинхронизации(ИдентификаторыДокументовЭДО, ТипСинхронизации) Экспорт
	
	МеткиВремениПоИдентификаторам = Новый Соответствие;
	Для Каждого ИдентификаторДокументаЭДО Из ИдентификаторыДокументовЭДО Цикл
		МеткиВремениПоИдентификаторам.Вставить(ИдентификаторДокументаЭДО, 0);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента КАК ИдентификаторДокумента,
		|	ЕСТЬNULL(МеткиВремениДанныхЭДО.МеткаВремени, 0) КАК МеткаВремени
		|ИЗ
		|	Документ.ЭлектронныйДокументВходящийЭДО КАК ЭлектронныйДокументВходящийЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МеткиВремениДанныхЭДО КАК МеткиВремениДанныхЭДО
		|		ПО ЭлектронныйДокументВходящийЭДО.ИдентификаторОрганизации = МеткиВремениДанныхЭДО.ИдентификаторЭДО
		|		И МеткиВремениДанныхЭДО.ТипДанных = &ТипДанных
		|		И ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента = МеткиВремениДанныхЭДО.ИдентификаторОбъекта
		|ГДЕ
		|	ЭлектронныйДокументВходящийЭДО.ИдентификаторДокумента В (&ИдентификаторыДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента КАК ИдентификаторДокумента,
		|	ЕСТЬNULL(МеткиВремениДанныхЭДО.МеткаВремени, 0) КАК МеткаВремени
		|ИЗ
		|	Документ.ЭлектронныйДокументИсходящийЭДО КАК ЭлектронныйДокументИсходящийЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МеткиВремениДанныхЭДО КАК МеткиВремениДанныхЭДО
		|		ПО ЭлектронныйДокументИсходящийЭДО.ИдентификаторОрганизации = МеткиВремениДанныхЭДО.ИдентификаторЭДО
		|		И МеткиВремениДанныхЭДО.ТипДанных = &ТипДанных
		|		И ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента = МеткиВремениДанныхЭДО.ИдентификаторОбъекта
		|ГДЕ
		|	ЭлектронныйДокументИсходящийЭДО.ИдентификаторДокумента В (&ИдентификаторыДокументов)";
	
	Запрос.УстановитьПараметр("ТипДанных", ТипСинхронизации);
	Запрос.УстановитьПараметр("ИдентификаторыДокументов", ИдентификаторыДокументовЭДО);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		МеткиВремениПоИдентификаторам.Вставить(Выборка.ИдентификаторДокумента, Выборка.МеткаВремени);
	КонецЦикла;
	
	МеткиВремениВФорматеСервиса = Новый Массив; // См. МеткиВремениДокументовЭДО
	Для Каждого МеткаВремениПоИдентификатору Из МеткиВремениПоИдентификаторам Цикл
		МеткаВремениВФорматеСервиса = Новый Структура("ИдентификаторДокументаЭДО, МеткаВремени",
			МеткаВремениПоИдентификатору.Ключ, МеткаВремениПоИдентификатору.Значение);
		МеткиВремениВФорматеСервиса.Добавить(МеткаВремениВФорматеСервиса);
	КонецЦикла;
	
	Возврат МеткиВремениВФорматеСервиса;
	
КонецФункции

#КонецОбласти

#КонецОбласти // СлужебныеПроцедурыИФункции