
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("Статус");	
	Поля.Добавить("ВидПлана");
	Поля.Добавить("НачалоПериода");
	Поля.Добавить("КонецПериода");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("%1 план продаж № %2 от %3 на период: %4 - %5 (%6)",
					Данные.ВидПлана,
					Данные.Номер,
	                Формат(Данные.Дата, "ДЛФ=D"),
					Формат(Данные.НачалоПериода, "ДФ=ММ.гггг"),
					Формат(Данные.КонецПериода, "ДФ=ММ.гггг"),
					НРег(Данные.Статус));
	
КонецПроцедуры
