
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ИТ_ПланыПродаж.ОбработатьУдалениеДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.ИТ_СтатусыПлановПродаж.Согласован Тогда 
		ДвиженияПланаПродаж = Движения.ИТ_ПланПродаж_Полугодие; 
		ДвиженияПланаПродаж.Записывать = Истина;
		
		Для Каждого СтрокаПланаПродаж Из ПланПродаж Цикл
			ЗаписатьПланПродажНаМесяц(ДвиженияПланаПродаж, СтрокаПланаПродаж, 1);	
			ЗаписатьПланПродажНаМесяц(ДвиженияПланаПродаж, СтрокаПланаПродаж, 2);
			ЗаписатьПланПродажНаМесяц(ДвиженияПланаПродаж, СтрокаПланаПродаж, 3);
			ЗаписатьПланПродажНаМесяц(ДвиженияПланаПродаж, СтрокаПланаПродаж, 4);
			ЗаписатьПланПродажНаМесяц(ДвиженияПланаПродаж, СтрокаПланаПродаж, 5);
			ЗаписатьПланПродажНаМесяц(ДвиженияПланаПродаж, СтрокаПланаПродаж, 6);
		КонецЦикла;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьПланПродажНаМесяц(ДвиженияПланаПродаж, СтрокаПланаПродаж, НомерМесяца)

	Движение = ДвиженияПланаПродаж.Добавить();
	Движение.Направление	= СтрокаПланаПродаж.Направление;
	Движение.ВидПлана		= ВидПлана;
	Движение.Период			= СтрокаПланаПродаж["Месяц_"		+ Строка(НомерМесяца)];
	Движение.Количество		= СтрокаПланаПродаж["Количество_"	+ Строка(НомерМесяца)];
	Движение.Сумма			= СтрокаПланаПродаж["Сумма_"		+ Строка(НомерМесяца)];
	
КонецПроцедуры

#КонецОбласти




