#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция подготавливает структуру данных, необходимую для печати ценников и этикеток.
//
// Параметры:
//  СтруктураНастроек - Структура - структуры настроек,
//  Режим - Строка - режим формирования.
// 
// Возвращаемое значение:
//  Структура - данные, необходимые для печати этикеток и ценников.
//
Функция ПодготовитьСтруктуруДанных(СтруктураНастроек, Режим) Экспорт
	
	Если СтруктураНастроек.ИсходныеДанные <> Неопределено Тогда
		ИсходныеДанные = СтруктураНастроек.ИсходныеДанные.Скопировать();
	Иначе
		ИсходныеДанные = Неопределено;
	КонецЕсли;
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("Таблица",                             Неопределено);
	СтруктураРезультата.Вставить("СоответствиеПолейСКДКолонкамТаблицы", Новый Соответствие);

#Область ПодготовкаСхемыКомпоновкиДанныхИКомпоновщикаНастроекСкд
	
	// Схема компоновки.
	СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет(СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных);
	
	// Подготовка компоновщика макета компоновки данных.
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Компоновщик.Настройки.Отбор.Элементы.Очистить();
	
	// Отбор компоновщика настроек.
	Если СтруктураНастроек.КомпоновщикНастроек <> Неопределено Тогда
		СкопироватьЭлементы(Компоновщик.Настройки.Отбор, СтруктураНастроек.КомпоновщикНастроек.Настройки.Отбор);
	КонецЕсли;
	
	// Выбранные поля компоновщика настроек.
	Для Каждого ОбязательноеПоле Из СтруктураНастроек.ОбязательныеПоля Цикл
		ПолеСКД = НайтиПолеСКДПоПолномуИмени(Компоновщик.Настройки.Выбор.ДоступныеПоляВыбора.Элементы, ОбязательноеПоле);
		Если ПолеСКД <> Неопределено Тогда
			ВыбранноеПоле = Компоновщик.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = ПолеСКД.Поле;
		КонецЕсли;
	КонецЦикла;
	
	Если Режим = "Товары" Тогда
		// Заполнение параметров.
		Для Каждого ПараметрДанных Из СтруктураНастроек.ПараметрыДанных Цикл
			Если ПараметрДанных.Ключ = "Склад" Тогда // Если склад не заполнен - не используем параметр
				УстановитьЗначениеПараметраСКД(Компоновщик, ПараметрДанных.Ключ, ПараметрДанных.Значение, Ложь);
			Иначе
				УстановитьЗначениеПараметраСКД(Компоновщик, ПараметрДанных.Ключ, ПараметрДанных.Значение);
			КонецЕсли;
		КонецЦикла;
		УстановитьЗначениеПараметраСКД(Компоновщик, "ТекущееВремя",        ТекущаяДатаСеанса());
		УстановитьЗначениеПараметраСКД(Компоновщик, "ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	КонецЕсли;
	
	// Компоновка макета компоновки данных.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Компоновщик.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

#КонецОбласти

#Область ПодготовкаВспомогательныхДанныхДляСопоставленияПолейШаблонаИСкд
	
	Для каждого Поле Из МакетКомпоновкиДанных.НаборыДанных.НаборДанных.Поля Цикл
		СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Вставить(Справочники.ШаблоныЭтикетокИЦенников.ИмяПоляВШаблоне(Поле.ПутьКДанным), Поле.Имя);
	КонецЦикла;

#КонецОбласти

#Область ВыполнениеЗапроса
	
	Запрос = Новый Запрос(МакетКомпоновкиДанных.НаборыДанных.НаборДанных.Запрос);
	
	// Заполнение параметров с полей отбора компоновщика настроек формы обработки.
	Для каждого Параметр Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
		Запрос.Параметры.Вставить(Параметр.Имя, Параметр.Значение);
	КонецЦикла;
	
	Если Режим = "Товары" Тогда
		// Подмена запроса для расчета цен...
		Если ПолучитьФункциональнуюОпцию("ИспользоватьЕдиницыИзмерения") Тогда
			
			ЗаменяемыйТекст = "ЦеныНоменклатурыСрезПоследних.Цена";
			ТекстЗамены = " ВЫРАЗИТЬ(
			|	ЦеныНоменклатурыСрезПоследних.Цена
			|	/ ЕСТЬNULL(ВЫБОР КОГДА ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент = 0 ТОГДА 1 ИНАЧЕ 
			|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения.Коэффициент КОНЕЦ, 1) 
			|	* ЕСТЬNULL(ВЫБОР КОГДА ИсходныеДанныеПоследнийЗапрос.ОсновнаяЕдиницаИзмерения.Коэффициент = 0 ТОГДА 1 ИНАЧЕ 
			|	ИсходныеДанныеПоследнийЗапрос.ОсновнаяЕдиницаИзмерения.Коэффициент КОНЕЦ, 1) КАК Число(15,2)) ";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ЗаменяемыйТекст, ТекстЗамены);
			
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьЕдиницыИзмерения") Тогда
			
			ЗаменяемыйТекст = "ЦеныНоменклатурыСрезПоследнихДополнительно.Цена";
			ТекстЗамены = " ВЫРАЗИТЬ(
			|	ЦеныНоменклатурыСрезПоследнихДополнительно.Цена
			|	/ ЕСТЬNULL(ВЫБОР КОГДА ЦеныНоменклатурыСрезПоследнихДополнительно.ЕдиницаИзмерения.Коэффициент = 0 ТОГДА 1 ИНАЧЕ 
			|	ЦеныНоменклатурыСрезПоследнихДополнительно.ЕдиницаИзмерения.Коэффициент КОНЕЦ, 1) 
			|	* ЕСТЬNULL(ВЫБОР КОГДА ИсходныеДанныеПоследнийЗапрос.ОсновнаяЕдиницаИзмерения.Коэффициент = 0 ТОГДА 1 ИНАЧЕ 
			|	ИсходныеДанныеПоследнийЗапрос.ОсновнаяЕдиницаИзмерения.Коэффициент КОНЕЦ, 1) КАК Число(15,2)) ";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ЗаменяемыйТекст, ТекстЗамены);
			
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьЕдиницыИзмерения") Тогда
			
			ЗаменяемыйТекст = "ОстаткиТоваровКомпанииОстатки.КоличествоОстаток";
			ТекстЗамены = " ВЫРАЗИТЬ(
			|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток
			|	/ ЕСТЬNULL(ВЫБОР КОГДА ИсходныеДанныеПоследнийЗапрос.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент = 0 ТОГДА 1 ИНАЧЕ 
			|	ИсходныеДанныеПоследнийЗапрос.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КОНЕЦ, 1) 
			|   * ЕСТЬNULL(ВЫБОР КОГДА ИсходныеДанныеПоследнийЗапрос.ОсновнаяЕдиницаИзмерения.Коэффициент = 0 ТОГДА 1 ИНАЧЕ 
			|	ИсходныеДанныеПоследнийЗапрос.ОсновнаяЕдиницаИзмерения.Коэффициент КОНЕЦ, 1) КАК Число(15,2)) ";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ЗаменяемыйТекст, ТекстЗамены);
			
		КонецЕсли;
		
		// Подмена запроса при печати этикеток...
		Если ИсходныеДанные <> Неопределено Тогда
			
			ТекстВременнойТаблицы =
			"	(ВЫБРАТЬ
			|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
			|		ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
			|		ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) КАК ЕдиницаИзмерения,
			|		0 КАК Порядок,
			|		0 КАК Количество)";
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстВременнойТаблицы, "&Таблица");
			
			//ПронумероватьТаблицуЗначений(ИсходныеДанные, "Порядок");
			// отсортируем весовые по кодам группы оборудования
			МассивНоменклатуры = ИсходныеДанные.ВыгрузитьКолонку("Номенклатура");
			ЗапросГТО = Новый Запрос("ВЫБРАТЬ
			                         |	ТоварыВОборудовании.Номенклатура КАК Номенклатура,
			                         |	МАКСИМУМ(ТоварыВОборудовании.ГруппаТоваров.Код) КАК КодГруппыТоваров
			                         |ИЗ
			                         |	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
			                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
			                         |		ПО ТоварыВОборудовании.ГруппаТоваров = ПодключаемоеОборудование.ГруппаТоваровОборудования
			                         |			И (ПодключаемоеОборудование.ОсновнойОтдел.ПодразделениеКомпании = &ПодразделениеКомпании)
			                         |ГДЕ
			                         |	ТоварыВОборудовании.Номенклатура В(&МассивНоменклатуры)
			                         |	И ПодключаемоеОборудование.ОсновнойОтдел.ПодразделениеКомпании = &ПодразделениеКомпании
			                         |	И ТоварыВОборудовании.ГруппаТоваров.ВыводитьПЛУНаЦенник
			                         |
			                         |СГРУППИРОВАТЬ ПО
			                         |	ТоварыВОборудовании.Номенклатура");
			ЗапросГТО.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры);
			ЗапросГТО.УстановитьПараметр("ПодразделениеКомпании",ПараметрыСеанса.ПодразделениеКомпании);
			ТаблицаГТО = ЗапросГТО.Выполнить().Выгрузить();
			КоличествоСтрок = ИсходныеДанные.Количество() - 1;
			ИсходныеДанные.Колонки.Добавить("Порядок", ПолучитьОписаниеТиповЧисла(15, 0));
			Для НомерСтроки = 0 По КоличествоСтрок Цикл
				НоменклатураСтроки = ИсходныеДанные[НомерСтроки].Номенклатура;
				Если НоменклатураСтроки.ТипНоменклатуры.Весовой Тогда
					СтрокаГТО = ТаблицаГТО.Найти(НоменклатураСтроки,"Номенклатура");
					Если СтрокаГТО=Неопределено Тогда
						КодГруппы = 1;
					Иначе
						КодГруппы = СтрокаГТО.КодГруппыТоваров;
					КонецЕсли;
					ИсходныеДанные[НомерСтроки].Порядок = КодГруппы*100000 + НомерСтроки;
				Иначе
					ИсходныеДанные[НомерСтроки].Порядок = НомерСтроки;
				КонецЕсли;
			КонецЦикла;
			
			Запрос.Параметры.Вставить("Таблица", ИсходныеДанные);
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """КоличествоЦенников""", "ИсходныеДанные.КоличествоЦенников");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """КоличествоЭтикеток""", "ИсходныеДанные.КоличествоЭтикеток");
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "КОЛИЧЕСТВО(ИсходныеДанные.КоличествоЦенников)",
													 "СУММА(ИсходныеДанные.КоличествоЦенниковДляПечати)");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "КОЛИЧЕСТВО(ИсходныеДанные.КоличествоЭтикеток)",
													 "СУММА(ИсходныеДанные.КоличествоЭтикеток)");	
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ШаблонЦенника""", "ИсходныеДанные.ШаблонЦенника");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ШаблонЭтикетки""", "ИсходныеДанные.ШаблонЭтикетки");
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """Штрихкод""", "ИсходныеДанные.Штрихкод");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """Цена""", "ИсходныеДанные.Цена");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ЦенаДополнительно""", "ИсходныеДанные.ЦенаДополнительно");
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ДатаПоследнегоИзмененияЦены""", "ИсходныеДанные.ДатаПоследнегоИзмененияЦены");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ДатаПоследнегоИзмененияЦеныДополнительно""", "ИсходныеДанные.ДатаПоследнегоИзмененияЦеныДополнительно");
						
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ЦенаДоАкции""", "ИсходныеДанные.ЦенаДоАкции");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """АкцияНачалоДействия""", "ИсходныеДанные.АкцияНачалоДействия");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """АкцияКонецДействия""", "ИсходныеДанные.АкцияКонецДействия");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ЦенаКопейки""", "ИсходныеДанные.ЦенаКопейки");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ЦенаДоАкцииКопейки""", "ИсходныеДанные.ЦенаДоАкцииКопейки");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ЦенаРубли""", "ИсходныеДанные.ЦенаРубли");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ЦенаДоАкцииРубли""", "ИсходныеДанные.ЦенаДоАкцииРубли");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ПЛУ""", "ИсходныеДанные.ПЛУ");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """Цена100Копейки""", "ИсходныеДанные.Цена100Копейки");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ЦенаДоАкции100Копейки""", "ИсходныеДанные.ЦенаДоАкции100Копейки");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """Цена100Рубли""", "ИсходныеДанные.Цена100Рубли");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ЦенаДоАкции100Рубли""", "ИсходныеДанные.ЦенаДоАкции100Рубли");

			//Мальцев А.Ю. +++
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ЦенаДоАкции100""", "ИсходныеДанные.ЦенаДоАкции100");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """НаименованиеАкции""", "ИсходныеДанные.НаименованиеАкции");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ОписаниеАкции""", "ИсходныеДанные.ОписаниеАкции");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, """ПроцентСкидки""", "ИсходныеДанные.ПроцентСкидки");
			//Мальцев А.Ю. ---

		КонецЕсли;	
	КонецЕсли;
	
	#КонецОбласти
	СтруктураРезультата.Таблица = Запрос.Выполнить().Выгрузить();	
		
	Возврат СтруктураРезультата;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьКодыПЛУ(Номенклатура, Склад, Штрихкод, ГруппыТоваровОборудования) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ТоварыВОборудовании.НомерЯчейки КАК НомерЯчейки
	                      |ИЗ
	                      |	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	                      |		ПО ПодключаемоеОборудование.ГруппаТоваровОборудования = ТоварыВОборудовании.ГруппаТоваров
	                      |			И (ТоварыВОборудовании.Номенклатура = &Номенклатура)
	                      |			И (ТоварыВОборудовании.Штрихкод = &Штрихкод)
	                      |ГДЕ
	                      |	ПодключаемоеОборудование.ОсновнойОтдел = &ОсновнойОтдел
	                      |	И ПодключаемоеОборудование.ГруппаТоваровОборудования.ВыводитьПЛУНаЦенник
	                      |	И ТоварыВОборудовании.Номенклатура = &Номенклатура
	                      |	И ТоварыВОборудовании.Штрихкод = &Штрихкод
	                      |	И ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваров
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НомерЯчейки");
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ОсновнойОтдел",Склад);
	Запрос.УстановитьПараметр("Штрихкод",Штрихкод);
	Если ЗначениеЗаполнено(ГруппыТоваровОборудования) Тогда
		Запрос.УстановитьПараметр("ГруппаТоваров",ГруппыТоваровОборудования);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ПодключаемоеОборудование.ГруппаТоваровОборудования.ВыводитьПЛУНаЦенник","");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваров","");
	КонецЕсли;
	
	СтрокаПЛУ = "";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаПЛУ = СтрокаПЛУ + Формат(Выборка.НомерЯчейки,"ЧГ=0")+ ", ";
	КонецЦикла;
	ДлинаСтрокиПЛУ = СтрДлина(СтрокаПЛУ);
	Если ДлинаСтрокиПЛУ>2 Тогда
		СтрокаПЛУ = Лев(СтрокаПЛУ,ДлинаСтрокиПЛУ-2);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаПЛУ) ИЛИ Штрихкод="" Тогда
		// вернем строку с ПЛУ уценки (со штрихкодами)
		Возврат СтрокаПЛУ;
	Иначе
		// вернем обычные ПЛУ (без штрихкодов)
		Возврат ПолучитьКодыПЛУ(Номенклатура, Склад, "",ГруппыТоваровОборудования);
	КонецЕсли;
	
КонецФункции

#Область Печать

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЦенникТовары") 
		Или УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЭтикеткаТовары") Тогда
		
		СформироватьПечатныеФормыЭтикетокИЦенниковТоваров(ПараметрыПечати, ОбъектыПечати, КоллекцияПечатныхФорм);
		
	КонецЕсли;
			
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПечатныеФормыЭтикетокИЦенниковТоваров(ДанныеПечати, ОбъектыПечати, КоллекцияПечатныхФормБСП)
	
	ИсходныеДанные = ПолучитьИзВременногоХранилища(ДанныеПечати.Товары);
	
	НужноПечататьЭтикетки = Ложь;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФормБСП, "ЭтикеткаТовары") Тогда
		НужноПечататьЭтикетки = Истина;
		КоллекцияПечатныхФормБСП.Удалить(КоллекцияПечатныхФормБСП.Найти(ВРег("ЭтикеткаТовары"), "ИмяВРЕГ"));
	КонецЕсли;
	
	НужноПечататьЦенники = Ложь;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФормБСП, "ЦенникТовары") Тогда
		НужноПечататьЦенники = Истина;
		КоллекцияПечатныхФормБСП.Удалить(КоллекцияПечатныхФормБСП.Найти(ВРег("ЦенникТовары"), "ИмяВРЕГ"));
	КонецЕсли;
	
	СтруктураНастроек = СтруктураНастроек();
	СтруктураНастроек.ОбязательныеПоля.Добавить("КоличествоЦенниковДляПечати");
	СтруктураНастроек.ОбязательныеПоля.Добавить("КоличествоЭтикетокДляПечати");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ШаблонЦенникаДляПечати");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ШаблонЭтикеткиДляПечати");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Номенклатура");
	СтруктураНастроек.ОбязательныеПоля.Добавить("АкцияНачалоДействия");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЦенаДоАкции");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Цена");
	СтруктураНастроек.ОбязательныеПоля.Добавить("Штрихкод");
	СтруктураНастроек.ОбязательныеПоля.Добавить("ЕдиницаИзмерения");

	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		СтруктураНастроек.ОбязательныеПоля.Добавить("Характеристика");
	КонецЕсли;

	
	СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаПечатьТовары";
	
	// Собираем используемые поля из шаблонов.
	СоответствиеШаблонов = Новый Соответствие;
	Для Каждого СтрокаТЧ Из ИсходныеДанные Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) И СтрокаТЧ.КоличествоЭтикеток > 0 И НужноПечататьЭтикетки Тогда
			СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЭтикетки);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЦенника) И СтрокаТЧ.КоличествоЦенников > 0 И НужноПечататьЦенники Тогда
			СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЦенника);
		КонецЕсли;
	КонецЦикла;
	Если ДанныеПечати.Свойство("СтруктураМакетаШаблона") И ЗначениеЗаполнено(ДанныеПечати.СтруктураМакетаШаблона) Тогда
		СоответствиеШаблонов.Вставить(Справочники.ШаблоныЭтикетокИЦенников.ПустаяСсылка());
	КонецЕсли;
	
	// Заполняем коллекцию обязательных полей и формируем соответствие шаблонов.
	Для Каждого КлючИЗначение Из СоответствиеШаблонов Цикл
		
		ШаблонЭтикетокИЦенников = КлючИЗначение.Ключ;
		
		Если ЗначениеЗаполнено(ШаблонЭтикетокИЦенников) Тогда
			СтруктураШаблона = КлючИЗначение.Ключ.Шаблон.Получить();
		Иначе
			СтруктураШаблона = ДанныеПечати.СтруктураМакетаШаблона;
		КонецЕсли;
		
		// Структура шаблонов.
		СтруктураНастроек.СоответствиеШаблоновИСтруктурыШаблонов.Вставить(ШаблонЭтикетокИЦенников, СтруктураШаблона);
		
		// Добавляем в массив обязательных полей поля, присутствующие в печатной форме ценника.
		Для Каждого Элемент Из СтруктураШаблона.ПараметрыШаблона Цикл
			СтруктураНастроек.ОбязательныеПоля.Добавить(Элемент.Ключ);
		КонецЦикла;
		
	КонецЦикла;
	
	СтруктураНастроек.ПараметрыДанных.Вставить("Организация",   ДанныеПечати.Организация);
	СтруктураНастроек.ПараметрыДанных.Вставить("ПодразделениеКомпании",   ДанныеПечати.ПодразделениеКомпании);		
	СтруктураНастроек.ПараметрыДанных.Вставить("ТипЦены",       ДанныеПечати.ТипЦены);
	СтруктураНастроек.ПараметрыДанных.Вставить("Дата",          ДанныеПечати.Дата);
	
	СтруктураНастроек.ПараметрыДанных.Вставить("ТипЦеныДополнительно", ДанныеПечати.ТипЦеныДополнительно);
	СтруктураНастроек.ПараметрыДанных.Вставить("ДатаДополнительно",    ДанныеПечати.ДатаДополнительно);
	СтруктураНастроек.ПараметрыДанных.Вставить("ГруппыТоваровОборудования", ДанныеПечати.ГруппыТоваровОборудования);
	
	СтруктураНастроек.ИсходныеДанные = ИсходныеДанные;
	
#Область ПодготовкаСтруктурыДанныхШаблона
	
	СтруктураРезультата = ПодготовитьСтруктуруДанных(СтруктураНастроек, "Товары");

#КонецОбласти

#Область ФормированиеТабличногоДокумента
	
	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	// Подготовка коллекции печатных форм.
	КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяКолонкиКоличество");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяКолонкиШаблон");
	КоллекцияПечатныхФорм.Колонки.Добавить("Шаблон");
	
	Для Каждого КлючИЗначение Из СтруктураНастроек.СоответствиеШаблоновИСтруктурыШаблонов Цикл
		
		Если ((ЗначениеЗаполнено(КлючИЗначение.Ключ) И КлючИЗначение.Ключ.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров) ИЛИ Не ЗначениеЗаполнено(КлючИЗначение.Ключ))
			И НужноПечататьЭтикетки Тогда
			
			ПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
			ПечатнаяФорма.ИмяМакета            = "Этикетка: "+КлючИЗначение.Ключ;
			ПечатнаяФорма.СинонимМакета        = НСтр("ru = 'Этикетка:'") + " " + КлючИЗначение.Ключ;
			ПечатнаяФорма.ИмяКолонкиКоличество = "КоличествоЭтикетокДляПечати";
			ПечатнаяФорма.ИмяКолонкиШаблон     = "ШаблонЭтикеткиДляПечати";
			ПечатнаяФорма.Шаблон = КлючИЗначение.Ключ;
			
		КонецЕсли;
		
		Если ((ЗначениеЗаполнено(КлючИЗначение.Ключ) И КлючИЗначение.Ключ.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров) ИЛИ Не ЗначениеЗаполнено(КлючИЗначение.Ключ))
			И НужноПечататьЦенники Тогда
			
			ПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
			ПечатнаяФорма.ИмяМакета            = "Ценник: " + КлючИЗначение.Ключ;
			ПечатнаяФорма.СинонимМакета        = НСтр("ru = 'Ценник:'") + " " +КлючИЗначение.Ключ;
			ПечатнаяФорма.ИмяКолонкиКоличество = "КоличествоЦенниковДляПечати";
			ПечатнаяФорма.ИмяКолонкиШаблон     = "ШаблонЦенникаДляПечати";
			ПечатнаяФорма.Шаблон = КлючИЗначение.Ключ;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		
		НомерКолонки = 0;
		НомерРяда = 0;
		
		Если ПечатнаяФорма.ТабличныйДокумент = Неопределено Тогда
			ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		КонецЕсли;
		
		НомерСтрокиНачало = ПечатнаяФорма.ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Для Каждого СтрокаТовары Из СтруктураРезультата.Таблица Цикл
			
			Если СтрокаТовары[ПечатнаяФорма.ИмяКолонкиКоличество] > 0 И СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон] = ПечатнаяФорма.Шаблон Тогда
				НетАкции = СтрокаТовары.АкцияНачалоДействия = '00010101';
				Если ДанныеПечати.РежимАкции=1 И НетАкции Тогда
					Продолжить;
				КонецЕсли;
				Если ДанныеПечати.РежимАкции=2 И НЕ НетАкции Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураШаблона = СтруктураНастроек.СоответствиеШаблоновИСтруктурыШаблонов.Получить(СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон]);
				
				Область = СтруктураШаблона.МакетЭтикетки.ПолучитьОбласть(СтруктураШаблона.ИмяОбластиПечати);
				
				//Мальцев А.Ю. +++
				счПроверкиИЦеныИАкции = 0;
				
				ПользовательскиеПоля  = СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон].ПользовательскиеПоля;
				//Мальцев А.Ю. ---
				
				// Применение настроек табличного документа.
				ЗаполнитьЗначенияСвойств(ПечатнаяФорма.ТабличныйДокумент, СтруктураШаблона.МакетЭтикетки, , "ОбластьПечати");
				
				Если ЗначениеЗаполнено(ПечатнаяФорма.Шаблон.РазмерБумаги) И ПечатнаяФорма.Шаблон.РазмерБумаги<>Перечисления.РазмерыБумаги.НеЗадано Тогда
					ПечатнаяФорма.ТабличныйДокумент.РазмерСтраницы = ПечатнаяФорма.Шаблон.РазмерБумаги;
				КонецЕсли;
			
				Для каждого ПараметрШаблона Из СтруктураШаблона.ПараметрыШаблона Цикл
					
					//Мальцев А.Ю. +++
					Если ПараметрШаблона.Ключ = "Цена" ИЛИ ПараметрШаблона.Ключ = "ЦенаРубли" ИЛИ ПараметрШаблона.Ключ = "ЦенаДоАкции" Тогда
						счПроверкиИЦеныИАкции = счПроверкиИЦеныИАкции + 1;
					КонецЕсли;
					//Мальцев А.Ю. ---
					
					
					Если ЕстьРеквизитОбъекта(Область.Параметры, ПараметрШаблона.Значение) Тогда
						НаименованиеКолонки = СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить(Справочники.ШаблоныЭтикетокИЦенников.ИмяПоляВШаблоне(ПараметрШаблона.Ключ));
						Если НаименованиеКолонки <> Неопределено Тогда
														
							Если НаименованиеКолонки="ЦенаКопейки" Тогда
								Область.Параметры[ПараметрШаблона.Значение] = (СтрокаТовары.Цена-Цел(СтрокаТовары.Цена))*100;
							ИначеЕсли НаименованиеКолонки="ЦенаДоАкцииКопейки" Тогда
								Область.Параметры[ПараметрШаблона.Значение] = (СтрокаТовары.ЦенаДоАкции-Цел(СтрокаТовары.ЦенаДоАкции))*100;
							ИначеЕсли НаименованиеКолонки="ЦенаРубли" Тогда
								Область.Параметры[ПараметрШаблона.Значение] = Цел(СтрокаТовары.Цена);
							ИначеЕсли НаименованиеКолонки="ЦенаДоАкцииРубли" Тогда
								Область.Параметры[ПараметрШаблона.Значение] = Цел(СтрокаТовары.ЦенаДоАкции);
							ИначеЕсли НаименованиеКолонки="ПЛУ" Тогда
								Область.Параметры[ПараметрШаблона.Значение] = ПолучитьКодыПЛУ(СтрокаТовары.Номенклатура,ДанныеПечати.Склад,СтрокаТовары.Штрихкод,ДанныеПечати.ГруппыТоваровОборудования);
							ИначеЕсли НаименованиеКолонки="Цена100Копейки" Тогда
								Цена100 = Окр(СтрокаТовары.Цена/10,2);
								Область.Параметры[ПараметрШаблона.Значение] = (Цена100-Цел(Цена100))*100;
							ИначеЕсли НаименованиеКолонки="ЦенаДоАкции100Копейки" Тогда
								ЦенаДоАкции100 = Окр(СтрокаТовары.ЦенаДоАкции/10,2);
								Область.Параметры[ПараметрШаблона.Значение] = (ЦенаДоАкции100-Цел(ЦенаДоАкции100))*100;
							ИначеЕсли НаименованиеКолонки="Цена100Рубли" Тогда
								Цена100 = Окр(СтрокаТовары.Цена/10,2);
								Область.Параметры[ПараметрШаблона.Значение] = Цел(Цена100);
							ИначеЕсли НаименованиеКолонки="ЦенаДоАкции100Рубли" Тогда
								ЦенаДоАкции100 = Окр(СтрокаТовары.ЦенаДоАкции/10,2);
								Область.Параметры[ПараметрШаблона.Значение] = Цел(ЦенаДоАкции100);
							ИначеЕсли НаименованиеКолонки="ЦенаДоАкции100" Тогда
								ЦенаДоАкции100 = Окр(СтрокаТовары.ЦенаДоАкции/10,2);
								Область.Параметры[ПараметрШаблона.Значение] = ЦенаДоАкции100;

							//++ ПервыйБит ШиряеваВ	
							ИначеЕсли НаименованиеКолонки="Номенклатурабит_РейтингВиВино" Тогда
								Если СтрокаТовары[НаименованиеКолонки]>=3.5 Тогда
									Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки];
								КонецЕсли;
							ИначеЕсли НаименованиеКолонки="НоменклатураСтранаПроисхождения" Тогда
								Если ЗначениеЗаполнено(СтрокаТовары[НаименованиеКолонки]) Тогда
									Если ЗначениеЗаполнено(СтрокаТовары[НаименованиеКолонки].бит_НаименованиеДляЦенника) Тогда
										Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки].бит_НаименованиеДляЦенника;
									Иначе
										Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки];
									КонецЕсли;	
								Иначе
									Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки];
								КонецЕсли;
								//-- ПервыйБит ШиряеваВ
								
							ИначеЕсли НаименованиеКолонки="ЦенаДоАкции" Тогда
								Если СтрокаТовары[НаименованиеКолонки] > 0 Тогда
									
									//Мальцев А.Ю. +++

									ФорматЦены = ПривестиСуммуКФорматуРублиКопейки(СтрокаТовары[НаименованиеКолонки]);
									Область.Параметры[ПараметрШаблона.Значение] = ФорматЦены;
																			
									//Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки];
									//Мальцев А.Ю. ---

								КонецЕсли;
								
								
							Иначе

								Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки];
							КонецЕсли;
						Иначе
							ПользовательскоеПоле = ПользовательскиеПоля.Найти(ПараметрШаблона.Ключ,"Поле");
							Если ПользовательскоеПоле <> НЕОПРЕДЕЛЕНО Тогда	
								Попытка
									Область.Параметры[ПараметрШаблона.Значение] = Вычислить(ПользовательскоеПоле.ВыражениеВычисления);
								Исключение
									ТекстОшибки = ОписаниеОшибки();
								КонецПопытки;
							КонецЕсли;
						КонецЕсли;

					КонецЕсли;
				КонецЦикла;
				
				//Мальцев А.Ю. +++
				Если счПроверкиИЦеныИАкции > 1 И СтрокаТовары.Цена > 0
											   И СтрокаТовары.ЦенаДоАкции > 0 
											   И СтрокаТовары.Цена <> СтрокаТовары.ЦенаДоАкции Тогда											   
					Попытка
						Рисунок = Область.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямая);
						Рисунок.Линия  = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 2);
						Рисунок.ЦветЛинии = WebЦвета.Красный;
						
						ОбластьЦенаДоАкции =  Область.Область("ЦенаДоАкции");
						Рисунок.Расположить(ОбластьЦенаДоАкции);
						Рисунок.Лево = Рисунок.Лево + Рисунок.Ширина;
						Рисунок.Ширина = Рисунок.Ширина*(-1);
							
						
					Исключение
						Ошибка = ОписаниеОшибки();
					КонецПопытки;
				КонецЕсли;
				//Мальцев А.Ю. ---
				
				Для каждого Рисунок Из Область.Рисунки Цикл
					
					Если Лев(Рисунок.Имя,8) = ИмяПараметраШтрихкод() Тогда
						
						ЗначениеШтрихкода = СтрокаТовары[СтруктураРезультата.СоответствиеПолейСКДКолонкамТаблицы.Получить(ИмяПараметраШтрихкод())];
						Если ЗначениеЗаполнено(ЗначениеШтрихкода) Тогда
							
							ПараметрыШтрихкода = Новый Структура;
							ПараметрыШтрихкода.Вставить("Ширина",          Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе));
							ПараметрыШтрихкода.Вставить("Высота",          Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе));
							ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(ЗначениеШтрихкода));
							ПараметрыШтрихкода.Вставить("ТипКода",         СтруктураШаблона.ТипКода);
							ПараметрыШтрихкода.Вставить("ОтображатьТекст", СтруктураШаблона.ОтображатьТекст);
							ПараметрыШтрихкода.Вставить("РазмерШрифта",    СтруктураШаблона.РазмерШрифта);
							ПараметрыШтрихкода.Вставить("УголПоворота",    СтруктураШаблона.УголПоворота);
							
							Рисунок.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
							
						КонецЕсли;
						
					КонецЕсли;
					
					//++ ПервыйБит ШиряеваВ
					Если Рисунок.Имя = ИмяПараметраРейтингВиВино() И ЗначениеЗаполнено(СтрокаТовары.Номенклатурабит_РейтингВиВино) Тогда	
						
						Если СтрокаТовары.Номенклатурабит_РейтингВиВино = 5 Тогда
							Рисунок.Картинка = Новый Картинка(Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("бит_ЗвездыРейтингВиВино5"));
						ИначеЕсли СтрокаТовары.Номенклатурабит_РейтингВиВино >= 4.5 Тогда
							Рисунок.Картинка = Новый Картинка(Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("бит_ЗвездыРейтингВиВино45"));
						ИначеЕсли СтрокаТовары.Номенклатурабит_РейтингВиВино >= 4 Тогда
							Рисунок.Картинка = Новый Картинка(Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("бит_ЗвездыРейтингВиВино4"));
						ИначеЕсли СтрокаТовары.Номенклатурабит_РейтингВиВино >= 3.5 Тогда
							Рисунок.Картинка = Новый Картинка(Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("бит_ЗвездыРейтингВиВино35"));		
						КонецЕсли;
						
					КонецЕсли;
					
					Если Рисунок.Имя = ИмяПараметраФлаг() Тогда								
						
						Если ЗначениеЗаполнено(СтрокаТовары.НоменклатураСтранаПроисхождения.ФайлКартинки) Тогда
							СтруктураКартинки = ПрисоединенныеФайлы.ПолучитьДанныеФайла(СтрокаТовары.НоменклатураСтранаПроисхождения.ФайлКартинки);
							ЗнКартинки = ПолучитьИзВременногоХранилища(СтруктураКартинки.СсылкаНаДвоичныеДанныеФайла);
							Рисунок.Картинка = Новый Картинка(ЗнКартинки);
						ИначеЕсли СтрокаТовары.НоменклатураСтранаПроисхождения = Справочники.СтраныМира.Россия Тогда
							Запрос = Новый Запрос;
							Запрос.Текст = 
							"ВЫБРАТЬ
							|	СтраныМираПрисоединенныеФайлы.Ссылка КАК Ссылка
							|ИЗ
							|	Справочник.СтраныМираПрисоединенныеФайлы КАК СтраныМираПрисоединенныеФайлы
							|ГДЕ
							|	СтраныМираПрисоединенныеФайлы.ВладелецФайла = &СтранаМира
							|	И СтраныМираПрисоединенныеФайлы.Наименование ПОДОБНО ""%Флаг""
							|	И НЕ СтраныМираПрисоединенныеФайлы.ПометкаУдаления";						
							Запрос.УстановитьПараметр("СтранаМира", СтрокаТовары.НоменклатураСтранаПроисхождения);
							Выборка = Запрос.Выполнить().Выбрать();	
							Пока Выборка.Следующий() Цикл
								СтруктураКартинки = ПрисоединенныеФайлы.ПолучитьДанныеФайла(Выборка.Ссылка);
								ЗнКартинки = ПолучитьИзВременногоХранилища(СтруктураКартинки.СсылкаНаДвоичныеДанныеФайла);
								Рисунок.Картинка = Новый Картинка(ЗнКартинки);
							КонецЦикла;
						КонецЕсли;
						
					КонецЕсли;
					//-- ПервыйБит ШиряеваВ
					
				КонецЦикла;
				
				Для Инд = 1 По СтрокаТовары[ПечатнаяФорма.ИмяКолонкиКоличество] Цикл // Цикл по количеству экземпляров
					
					НомерКолонки = НомерКолонки + 1;
					
					Если НомерКолонки = 1 Тогда
						
						НомерРяда = НомерРяда + 1;
						
						ПечатнаяФорма.ТабличныйДокумент.Вывести(Область);
						
					Иначе
						
						ПечатнаяФорма.ТабличныйДокумент.Присоединить(Область);
						
					КонецЕсли;
					
					Если НомерКолонки = СтруктураШаблона.КоличествоПоГоризонтали И НомерРяда = СтруктураШаблона.КоличествоПоВертикали Тогда
						
						НомерРяда    = 0;
						НомерКолонки = 0;
						
						ПечатнаяФорма.ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						
					ИначеЕсли НомерКолонки = СтруктураШаблона.КоличествоПоГоризонтали Тогда
						
						НомерКолонки = 0;
						
					КонецЕсли;
					
				КонецЦикла; // Цикл по количеству экземпляров
			
			КонецЕсли;
			
		КонецЦикла; // Цикл по строкам таблицы товаров
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ПечатнаяФорма.ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ПечатнаяФорма.Шаблон);
		
	КонецЦикла;
	
	МассивСтрокДляУдаления = Новый Массив;
	
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		Если ПечатнаяФорма.ТабличныйДокумент <> Неопределено Тогда
			НоваяСтрока = КоллекцияПечатныхФормБСП.Добавить();
			
			НоваяСтрока.ИмяМакета = ПечатнаяФорма.ИмяМакета;
			НоваяСтрока.ИмяВРЕГ   = ВРег(ПечатнаяФорма.ИмяМакета);
			НоваяСтрока.Экземпляров = 1;
			
			НоваяСтрока.ТабличныйДокумент = ПечатнаяФорма.ТабличныйДокумент;
			НоваяСтрока.СинонимМакета = ПечатнаяФорма.СинонимМакета;
		КонецЕсли;
	КонецЦикла;
	
#КонецОбласти

КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция ИмяПараметраШтрихкод()
	
	Возврат "Штрихкод";
	
КонецФункции

//++ ПервыйБит ШиряеваВ
Функция ИмяПараметраРейтингВиВино()
	
	Возврат "РейтингВиВино";
	
КонецФункции

Функция ИмяПараметраФлаг()
	
	Возврат "Флаг";
	
КонецФункции
//-- ПервыйБит ШиряеваВ

Функция УстановитьЗначениеПараметраСКД(КомпоновщикНастроек, ИмяПараметра, ЗначениеПараметра, ИспользоватьНеЗаполненный = Истина)
	
	ПараметрУстановлен = Ложь;
	
	ПараметрКомпоновкиДанных = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
	ЗначениеПараметраКомпоновкиДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновкиДанных);
	Если ЗначениеПараметраКомпоновкиДанных <> Неопределено Тогда
		
		ЗначениеПараметраКомпоновкиДанных.Значение = ЗначениеПараметра;
		ЗначениеПараметраКомпоновкиДанных.Использование = ?(ИспользоватьНеЗаполненный, Истина, ЗначениеЗаполнено(ЗначениеПараметраКомпоновкиДанных.Значение));
		
		ПараметрУстановлен = Истина;
		
	КонецЕсли;
	
	Возврат ПараметрУстановлен;
	
КонецФункции

// Функция возвращает пустую структуру настроек
// 
// Параметры: 
//  Нет
// 
// Возвращаемое значение: 
//  Структура - структура настроек.
Функция СтруктураНастроек() Экспорт
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ИсходныеДанные",                         Неопределено);
	СтруктураНастроек.Вставить("ОбязательныеПоля",                       Новый Массив);
	СтруктураНастроек.Вставить("СоответствиеШаблоновИСтруктурыШаблонов", Новый Соответствие);
	СтруктураНастроек.Вставить("ПараметрыДанных"    ,                    Новый Структура);
	СтруктураНастроек.Вставить("КомпоновщикНастроек",                    Неопределено);
	СтруктураНастроек.Вставить("ИмяМакетаСхемыКомпоновкиДанных",         Неопределено);
	
	Возврат СтруктураНастроек;
	
КонецФункции


//Мальцев А.Ю. +++
Функция ПривестиСуммуКФорматуРублиКопейки(СуммаНаФорме)
	
	СуммаРубли   = Цел(СуммаНаФорме);
    СуммаКопейки = (СуммаНаФорме - СуммаРубли);
    
    РублиЧислом     = Формат(СуммаРубли, "ЧДЦ=0; ЧГ=0");
    РублиПрописью   = ЧислоПрописью(СуммаРубли, "Л = ru_RU; НД = Ложь", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
    КопейкиПрописью = Сред(ЧислоПрописью(СуммаКопейки, "Л = ru_RU; НП = Ложь", ",,,, к., к., к., ж, 2"), 6);
    
    СуммаНаФормеПрописью = РублиЧислом + " р. " + КопейкиПрописью;	
	
	Возврат СуммаНаФормеПрописью;
	
КонецФункции

//Мальцев А.Ю. ---
#КонецОбласти

#КонецОбласти


// Заполняет колонку таблицы значений последовательными номерами
// Параметры:
//	Таблица - таблица значений, строки которой нужно пронумеровать
//	ИмяКолонкиНомераСтроки - колонка таблицы значений, в которой будут указаны номера строк.
Процедура ПронумероватьТаблицуЗначений(Таблица, ИмяКолонкиНомераСтроки)

	Таблица.Колонки.Добавить(ИмяКолонкиНомераСтроки, ПолучитьОписаниеТиповЧисла(15, 0));

	КоличествоСтрок = Таблица.Количество() - 1;
	Для НомерСтроки = 0 По КоличествоСтрок Цикл
		Таблица[НомерСтроки][ИмяКолонкиНомераСтроки] = НомерСтроки;
	КонецЦикла;

КонецПроцедуры

Функция ЕстьРеквизитОбъекта(Объект, ИмяРеквизита) Экспорт
	
	КлючУникальности   = Новый УникальныйИдентификатор;
	СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);

	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
	
	Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
	
КонецФункции

// Служебная функция, предназначенная для получения описания типов числа, заданной разрядности.
// 
// Параметры:
//  Разрядность 			- число, разряд числа.
//  РазрядностьДробнойЧасти - число, разряд дробной части.
//
// Возвращаемое значение:
//  Объект "ОписаниеТипов" для числа указанной разрядности.
//
Функция ПолучитьОписаниеТиповЧисла(Разрядность, РазрядностьДробнойЧасти)

	Возврат Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(Разрядность, РазрядностьДробнойЧасти));

КонецФункции // ПолучитьОписаниеТиповЧисла()

// Копирует элементы из одной коллекции в другую
//
// Параметры:
//	ПриемникЗначения	- коллекция элементов КД, куда копируются параметры
//	ИсточникЗначения	- коллекция элементов КД, откуда копируются параметры
//	ОчищатьПриемник		- признак необходимости очистки приемника (Булево, по умолчанию: истина).
//
Процедура СкопироватьЭлементы(ПриемникЗначения, ИсточникЗначения, ОчищатьПриемник = Истина)
	
	Если ТипЗнч(ИсточникЗначения) = Тип("УсловноеОформлениеКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ВариантыПользовательскогоПоляВыборКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ОформляемыеПоляКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ЗначенияПараметровДанныхКомпоновкиДанных") Тогда
		СоздаватьПоТипу = Ложь;
	Иначе
		СоздаватьПоТипу = Истина;
	КонецЕсли;
	ПриемникЭлементов = ПриемникЗначения.Элементы;
	ИсточникЭлементов = ИсточникЗначения.Элементы;
	Если ОчищатьПриемник Тогда
		ПриемникЭлементов.Очистить();
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из ИсточникЭлементов Цикл
		
		Если ТипЗнч(ЭлементИсточник) = Тип("ЭлементПорядкаКомпоновкиДанных") Тогда
			// Элементы порядка добавляем в начало
			Индекс = ИсточникЭлементов.Индекс(ЭлементИсточник);
			ЭлементПриемник = ПриемникЭлементов.Вставить(Индекс, ТипЗнч(ЭлементИсточник));
		Иначе
			Если СоздаватьПоТипу Тогда
				ЭлементПриемник = ПриемникЭлементов.Добавить(ТипЗнч(ЭлементИсточник));
			Иначе
				ЭлементПриемник = ПриемникЭлементов.Добавить();
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		// В некоторых коллекциях необходимо заполнить другие коллекции
		Если ТипЗнч(ИсточникЭлементов) = Тип("КоллекцияЭлементовУсловногоОформленияКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Поля, ЭлементИсточник.Поля);
			СкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
			ЗаполнитьЭлементы(ЭлементПриемник.Оформление, ЭлементИсточник.Оформление); 
		ИначеЕсли ТипЗнч(ИсточникЭлементов)	= Тип("КоллекцияВариантовПользовательскогоПоляВыборКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
		КонецЕсли;
		
		// В некоторых элементах коллекции необходимо заполнить другие коллекции
		Если ТипЗнч(ЭлементИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыборКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Варианты, ЭлементИсточник.Варианты);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных") Тогда
			ЭлементПриемник.УстановитьВыражениеДетальныхЗаписей (ЭлементИсточник.ПолучитьВыражениеДетальныхЗаписей());
			ЭлементПриемник.УстановитьВыражениеИтоговыхЗаписей(ЭлементИсточник.ПолучитьВыражениеИтоговыхЗаписей());
			ЭлементПриемник.УстановитьПредставлениеВыраженияДетальныхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияДетальныхЗаписей ());
			ЭлементПриемник.УстановитьПредставлениеВыраженияИтоговыхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияИтоговыхЗаписей ());
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет одну коллекцию элементов на основании другой
//
// Параметры:
//	ПриемникЗначения	- коллекция элементов КД, куда копируются параметры
//	ИсточникЗначения	- коллекция элементов КД, откуда копируются параметры
//	ПервыйУровень		- уровень структуры коллекции элементов КД для копирования параметров.
//
Процедура ЗаполнитьЭлементы(ПриемникЗначения, ИсточникЗначения, ПервыйУровень = Неопределено)
	
	Если ТипЗнч(ПриемникЗначения) = Тип("КоллекцияЗначенийПараметровКомпоновкиДанных") Тогда
		КоллекцияЗначений = ИсточникЗначения;
	Иначе
		КоллекцияЗначений = ИсточникЗначения.Элементы;
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из КоллекцияЗначений Цикл
		Если ПервыйУровень = Неопределено Тогда
			ЭлементПриемник = ПриемникЗначения.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		Иначе
			ЭлементПриемник = ПервыйУровень.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		КонецЕсли;
		Если ЭлементПриемник = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		Если ТипЗнч(ЭлементИсточник) = Тип("ЗначениеПараметраКомпоновкиДанных") Тогда
			Если ЭлементИсточник.ЗначенияВложенныхПараметров.Количество() <> 0 Тогда
				ЗаполнитьЭлементы(ЭлементПриемник.ЗначенияВложенныхПараметров, ЭлементИсточник.ЗначенияВложенныхПараметров, ПриемникЗначения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Находит среди элементов полей СКД поле по полному имени
//
// Параметры:
//	Элементы - поля СКД
//	ПолноеИмя - полное имя поля СКД.
//
// Возвращаемое значение:
//	Поле - поле СКД
//
Функция НайтиПолеСКДПоПолномуИмени(Элементы, ПолноеИмя)

	масЧастейИмен = ИзПолногоИмениПоляПолучитьЧасти(ПолноеИмя);
	колЧастей = масЧастейИмен.Количество();
	
	текИмя = масЧастейИмен[0];
	Поле = НайтиПолеСКДПоИмени(Элементы, текИмя);
	Если Поле = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Сч = 2 По колЧастей Цикл
		текИмя = текИмя +"." + масЧастейИмен[Сч-1];
		Поле = НайтиПолеСКДПоИмени(Поле.Элементы, текИмя);
		Если Поле = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Поле;

КонецФункции

// Получает полное имя поля по частям
//
// Параметры:
//	ПолноеИмя - полное имя поля СКД.
//
// Возвращаемое значение:
//	масЧастей - массив, содержащий части полного имени.
//
Функция ИзПолногоИмениПоляПолучитьЧасти(ПолноеИмя)

	масЧастей = Новый Массив;
	СтрИмя = ПолноеИмя;
	
	Пока Не ПустаяСтрока(СтрИмя) Цикл
		Если Лев(СтрИмя, 1) = "[" Тогда
			
			Поз = СтрНайти(СтрИмя, "]");
			Если Поз = 0 Тогда
				масЧастей.Добавить(Сред(СтрИмя, 2));
				СтрИмя = "";
			Иначе
				масЧастей.Добавить(Сред(СтрИмя, 1, Поз));
				СтрИмя = Сред(СтрИмя, Поз + 2);
			КонецЕсли;
			
		Иначе
			
			Поз = СтрНайти(СтрИмя, ".");
			Если Поз = 0 Тогда
				масЧастей.Добавить(СтрИмя);
				СтрИмя = "";
			Иначе
				масЧастей.Добавить(Лев(СтрИмя, Поз - 1));
				СтрИмя = Сред(СтрИмя, Поз + 1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат масЧастей;

КонецФункции // ИзПолногоИмениПоляПолучитьЧасти()

// Находит среди элементов полей СКД поле по имени.
//
// Параметры:
//	Элементы - поля СКД
//	Имя - имя поля СКД
//
// Возвращаемое значение:
//	Поле - поле СКД
//
Функция НайтиПолеСКДПоИмени(Элементы, Имя)
	
	Для Каждого Элемент Из Элементы Цикл
		Если ВРЕГ(Строка(Элемент.Поле)) = ВРЕГ(Имя) Тогда
			Возврат Элемент;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // НайтиПолеСКДПоИмени()

#КонецЕсли
