
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьСопоставление()
	
	Для Каждого ТекущаяСтрока Из ТаблицаТТН Цикл
		ТекущаяСтрока.Сопоставлена = Ложь;
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
		
		Если ПустаяСтрока(ТекущаяСтрока.ИдентификаторСтроки) Тогда
			ТекущаяСтрока.Сопоставлена = Ложь;
			Продолжить;
		КонецЕсли;
		
		ТекущаяСтрока.Сопоставлена = Истина;
		
		МассивСтрок = ТаблицаТТН.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтроки));
		Для Каждого СопоставленнаяСтрока Из МассивСтрок Цикл
			СопоставленнаяСтрока.Сопоставлена = Истина;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДокументОбъект", Неопределено);
	Если ДокументОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТоварноТранспортнаяНакладная = ДокументОбъект.ТоварноТранспортнаяНакладнаяЕГАИС;
	Товары                       = ДокументОбъект.Товары;
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТаблицаТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
		НоваяСтрока.Количество = ТекущаяСтрока.Количество*ТекущаяСтрока.Коэффициент;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТовары.АлкогольнаяПродукция,
	|	ТаблицаТовары.Справка1,
	|	ТаблицаТовары.Справка2,
	|	ТаблицаТовары.ИдентификаторСтроки,
	|	ТаблицаТовары.Количество,
	|	ТаблицаТовары.Цена
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ТоварноТранспортнаяНакладная);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаТТН.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверитьСопоставление();
	ОтображатьСопоставленныеПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ТаблицаТоваров.ТекущиеДанные = Неопределено Тогда
		ТекущийИдентификатор = "";
	Иначе
		ТекущийИдентификатор = Элементы.ТаблицаТоваров.ТекущиеДанные.ИдентификаторСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьСопоставленныеПриИзменении(Элемент = Неопределено)
	
	Если ОтображатьСопоставленные Тогда
		
		Элементы.ТаблицаТоваров.ОтборСтрок = Неопределено;
		Элементы.ТаблицаТТН.ОтборСтрок     = Неопределено;
		
	Иначе
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("Сопоставлена", Ложь);
		
		Элементы.ТаблицаТТН.ОтборСтрок     = Новый ФиксированнаяСтруктура(ОтборСтрок);
		Элементы.ТаблицаТоваров.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТТННачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Структура = Новый Структура;
	Структура.Вставить("ИдентификаторСтроки",  ТекущиеДанные.ИдентификаторСтроки);
	Структура.Вставить("АлкогольнаяПродукция", ТекущиеДанные.АлкогольнаяПродукция);
	Структура.Вставить("Количество",           ТекущиеДанные.Количество);
	Структура.Вставить("ТекущаяСтрока",        Элемент.ТекущаяСтрока);
	
	ПараметрыПеретаскивания.Значение = Структура;
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Копирование;
	
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТТНПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТТНОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТТНПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если ПараметрыПеретаскивания.Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ТаблицаТоваров.НайтиПоИдентификатору(Строка);
	
	СтрокаИсточник = ПараметрыПеретаскивания.Значение;
	
	СтрокаТТН = ТаблицаТТН.НайтиПоИдентификатору(СтрокаИсточник.ТекущаяСтрока);
	СтрокаТТН.Сопоставлена = Истина;
	
	Если ТекущиеДанные.Количество > СтрокаИсточник.Количество Тогда
		НоваяСтрока = ТаблицаТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
		НоваяСтрока.Количество     = ТекущиеДанные.Количество - СтрокаИсточник.Количество;
		НоваяСтрока.СтрокаРодителя = ТекущиеДанные.НомерСтроки;
	КонецЕсли;
	
	ТекущиеДанные.ИдентификаторСтроки  = СтрокаИсточник.ИдентификаторСтроки;
	ТекущиеДанные.АлкогольнаяПродукция = СтрокаИсточник.АлкогольнаяПродукция;
	ТекущиеДанные.Сопоставлена = Истина;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ТаблицаТоваров);
	
КонецПроцедуры

#КонецОбласти