
//(Источник, Отказ, РежимПроведения) Экспорт
//Процедура рздВыгрузкаВЕРППриЗаписи(Источник, Отказ) Экспорт
//	
//	ТипОбъекта = ТипЗнч(Источник);
//	Если ТипОбъекта = Тип("ДокументОбъект.ЗаказПоставщику") ТОгда
//		//Цепелев  +++ 2019-03-15 не регистрировать повторно на обмене те объекты которые уже выгружены в ЕРП
//		//Если Источник.Контрагент.ЕРПМастерКлюч = "00000019376" Тогда
//		Если Источник.Контрагент.ЕРПМастерКлюч = "00000019376" И
//				НЕ (Найти(Источник.Комментарий,"Загружен в ЕРП -") >0) Тогда 
//		//Цепелев  --- 2019-03-15              
//			ТекУзел = ПланыОбмена.рздВыгрузкаВЕРП.НайтиПоКоду("ЕРП");
//			Если НЕ ТекУзел.Пустая() Тогда
//				ПланыОбмена.ЗарегистрироватьИзменения(ТекУзел, Источник.Ссылка);
//			КонецЕсли;
//		КонецЕсли;	
//	КонецЕсли;	
//КонецПроцедуры
Процедура рздВыгрузкаВЕРППриЗаписи(Источник, Отказ) Экспорт
	//Цепелев  +++ 2019-07-22-11-28
	// всегда регивстрируем изменения только если это главный узел
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	Если НЕ ГлавныйУзел = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//Цепелев  --- 2019-07-22-11-28              
	Если НЕ Отказ Тогда
		ТипОбъекта = ТипЗнч(Источник);
		Если ТипОбъекта = Тип("ДокументОбъект.ЗаказПоставщику") ТОгда
			//Цепелев  +++ 2019-03-15 не регистрировать повторно на обмене те объекты которые уже выгружены в ЕРП
			//Если Источник.Контрагент.ЕРПМастерКлюч = "00000019376" Тогда
			Если Источник.Контрагент.ЕРПМастерКлюч = "00000019376" И Источник.Проведен И 
					Источник.Товары.Итог("Количество")>0 И 
					НЕ (Найти(Источник.Комментарий,"Загружен в ЕРП -") >0) Тогда 
			//Цепелев  --- 2019-03-15              
			Если ЗаказПоставщикуСогласован(Источник.Ссылка) и СостояниеДокументаЭДО(Источник.Ссылка) = Неопределено и 
				((НЕ Источник.Ссылка.ит_ВидЗаявки = Перечисления.рздВидыЗаказовЕРП.ЗаказНаГотовуюПродукцию и 
				  НЕ Источник.Ссылка.ит_ВидЗаявки = Перечисления.рздВидыЗаказовЕРП.ЗаказНаМолочнуюПродукцию и 
				  НЕ Источник.Ссылка.ит_ВидЗаявки = Перечисления.рздВидыЗаказовЕРП.ЗаказНаФермерскуюПродукцию) или 
				 НЕ Источник.Ссылка.ПодразделениеКомпании.итОбменДокументамиЭДО или
				 Источник.Ссылка.ит_ИсточникЗаказа = Перечисления.ит_ИсточникиЗаказовПоставщику.Многозадачник) Тогда
					ТекУзел = ПланыОбмена.рздВыгрузкаВЕРП.НайтиПоКоду("ЕРП");
					Если НЕ ТекУзел.Пустая() Тогда
						ПланыОбмена.ЗарегистрироватьИзменения(ТекУзел, Источник.Ссылка);
					КонецЕсли;
				ИначеЕсли СостояниеДокументаЭДО(Источник.Ссылка) = Неопределено и Источник.Ссылка.ПодразделениеКомпании.итОбменДокументамиЭДО Тогда 
					  регСостояниеЛераДата = РегистрыСведений.итСостоянияДокументовЭДО_LeraData.СоздатьМенеджерЗаписи();
					  регСостояниеЛераДата.СсылкаНаОбъект = Источник.Ссылка;
					  регСостояниеЛераДата.Состояния = Перечисления.итСостоянияЭДО.ОжидаетОтправкиПоставщику;
					  регСостояниеЛераДата.Записать();
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		//Цепелев  +++ 2019-10-30-09-57
		Если ТипОбъекта = Тип("ДокументОбъект.СписаниеТоваров") ТОгда
			Если Источник.СтатьяСписанияТМЦ = Справочники.СтатьиДоходовИРасходов.ВозвратУслугПоставщика 
				И Источник.ит_ЗаявкаНаОбмен
				И Источник.Проведен 
				И НЕ ЗначениеЗаполнено(Источник.НомерЕРП)
				Тогда
				ТекУзел = ПланыОбмена.рздВыгрузкаВЕРП.НайтиПоКоду("ЕРП");
				Если НЕ ТекУзел.Пустая() Тогда
					ПланыОбмена.ЗарегистрироватьИзменения(ТекУзел, Источник.Ссылка);
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;
		//Цепелев  --- 2019-10-30-09-57              
	КонецЕсли;
КонецПроцедуры//Цепелев  --- 2019-05-01              

Функция ЗаказПоставщикуСогласован(ЗаказПоставщику) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СостоянияВыполненияЗаказовПоставщикам.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВыполненияЗаказовПоставщикам.Согласован) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК Выгружать
	|ИЗ
	|	РегистрСведений.СостоянияВыполненияЗаказовПоставщикам КАК СостоянияВыполненияЗаказовПоставщикам
	|ГДЕ
	|	СостоянияВыполненияЗаказовПоставщикам.Заказ = &ЗаказПоставщику
	|";
	
	Результат = Истина;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И (НЕ Выборка.Выгружать = NULL) Тогда
		Результат = Выборка.Выгружать;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СостояниеДокументаЭДО(ТекДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ТекДокумент);
	Запрос.Текст = "ВЫБРАТЬ
	               |	итСостоянияДокументовЭДО_LeraData.Состояния КАК Состояния
	               |ИЗ
	               |	РегистрСведений.итСостоянияДокументовЭДО_LeraData КАК итСостоянияДокументовЭДО_LeraData
	               |ГДЕ
	               |	итСостоянияДокументовЭДО_LeraData.СсылкаНаОбъект = &СсылкаНаОбъект";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий()  Тогда
		Результат = Выборка.Состояния;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Процедура УстановатьСостояниеДокументу(ТекДокумент, Состояние, Описание = "") Экспорт
	
	регСостоянияЭДО = РегистрыСведений.итСостоянияДокументовЭДО_LeraData.СоздатьМенеджерЗаписи();
	регСостоянияЭДО.СсылкаНаОбъект = ТекДокумент.Ссылка;
	регСостоянияЭДО.Состояния = Состояние;
	регСостоянияЭДО.Описание = Описание;
	регСостоянияЭДО.Записать(Истина);
	
КонецПроцедуры	

Функция ПолучитьСостояниеЗаказаПоставщику(ЗаказПоставщику) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостоянияВыполненияЗаказовПоставщикам.Состояние КАК Состояние
	               |ИЗ
	               |	РегистрСведений.СостоянияВыполненияЗаказовПоставщикам КАК СостоянияВыполненияЗаказовПоставщикам
	               |ГДЕ
	               |	СостоянияВыполненияЗаказовПоставщикам.Заказ = &ЗаказПоставщику";
	
	Результат = Перечисления.СостоянияВыполненияЗаказовПоставщикам.БезСогласования;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Состояние;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция НастройкиПодключения()
	Структура = Новый Структура();
	Структура.Вставить("ИмяСервиса","ERPGetDataFromUPRUPP");
	Структура.Вставить("Адрес","http://wwwserv.work.local/ERP_Prodact_integ77/WS/ERPGetDataFromUPRUPP.1cws?wsdl"); 
	Структура.Вставить("ИмяФункции","GetServiceTable");

	Возврат(Структура);
КонецФункции


Функция ВернутьТаблицуЗначенийПоКлючу() Экспорт
	Запрос = Новый Запрос;
	
	ТекУзел = ПланыОбмена.рздВыгрузкаВЕРП.НайтиПоКоду("ЕРП");
	Если ТекУзел.Пустая() Тогда
		
		Возврат 0;
	КонецЕсли;
	//Цепелев  +++ 2020-03-26-04-44
	//	Запрос.Текст = "ВЫБРАТЬ
	//|	ЗаказПоставщикуИзменения.Ссылка,
	//|	ЗаказПоставщикуИзменения.НомерСообщения
	//|ПОМЕСТИТЬ втИзменения
	//|ИЗ
	//|	Документ.ЗаказПоставщику.Изменения КАК ЗаказПоставщикуИзменения
	//|ГДЕ
	//|	ЗаказПоставщикуИзменения.Узел = &Узел
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЗаказПоставщику.Ссылка,	
	//|	втИзменения.НомерСообщения,
	//|	ЗаказПоставщику.Проведен,				   
	//|	ЗаказПоставщику.Номер,
	//|	ЗаказПоставщику.Дата,
	//|	ЗаказПоставщику.СрокПоставки КАК ДатаЗаявки,
	////|	ЗаказПоставщику.Контрагент.ЕРПМастерКлюч КАК ПартнерЕРПМастерКлюч,
	//|	""00-00039470"" КАК ПартнерЕРПМастерКлюч,
	//|	ЗаказПоставщику.Автор.Наименование КАК Логин,
	//|	"""" КАК ТелефонАвтора,
	//|	ИСТИНА КАК ВетСправка,
	//|	ЗаказПоставщику.Товары.(
	//|		НомерСтроки,
	//|		Номенклатура.ЕРПМастерКлюч КАК НоменклатураЕРПМастерКлюч,
	//|		Количество КАК Количество,
	//|		ЕдиницаИзмерения.Коэффициент КАК Коэф,
	//|		Коэффициент,
	//|		Цена,
	//|		Сумма,
	//|		ЗаказПоставщику.Товары.ЕдиницаИзмерения.Вес * ЗаказПоставщику.Товары.Количество КАК ИтогКГ,
	//|		ЗаказПоставщику.Товары.ЕдиницаИзмерения.Вес * ЗаказПоставщику.Товары.Количество КАК КоличествоКг,
	//|		ПОДСТРОКА(ЗаказПоставщику.Товары.Номенклатура.ЕРПМастерКлюч, 1, 11) = ""00-00000688""
	//|			ИЛИ ПОДСТРОКА(ЗаказПоставщику.Товары.Номенклатура.ЕРПМастерКлюч, 1, 11) = ""00-00035275"" КАК ЭтоШашлык
	//|	)
	//|ИЗ
	//|	втИзменения КАК втИзменения
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
	//|		ПО втИзменения.Ссылка = ЗаказПоставщику.Ссылка
	//|ГДЕ
	//|	ЗаказПоставщику.Проведен
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ЗаказПоставщику.Дата,
	//|	ЗаказПоставщику.Номер,
	//|	ЗаказПоставщику.Товары.НомерСтроки";	
	//

			Запрос.Текст = "ВЫБРАТЬ
			               |	ЗаказПоставщикуИзменения.Ссылка КАК Ссылка,
			               |	ЗаказПоставщикуИзменения.НомерСообщения КАК НомерСообщения
			               |ПОМЕСТИТЬ втИзменения
			               |ИЗ
			               |	Документ.ЗаказПоставщику.Изменения КАК ЗаказПоставщикуИзменения
			               |ГДЕ
			               |	ЗаказПоставщикуИзменения.Узел = &Узел
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ЗаказПоставщику.Ссылка КАК Ссылка,
			               |	ЕСТЬNULL(втИзменения.НомерСообщения, 0) КАК НомерСообщения,
			               |	ЗаказПоставщику.Проведен КАК Проведен,
			               |	ЗаказПоставщику.Номер КАК Номер,
			               |	ЗаказПоставщику.Дата КАК Дата,
			               |	ЗаказПоставщику.СрокПоставки КАК ДатаЗаявки,
			               |	&ДатаНачалаВыгрузки КАК ДатаНачалаВыгрузки,
			               |	ЗаказПоставщику.ПодразделениеКомпании.МастерКлючСГП КАК ПартнерЕРПМастерКлюч,
			               |	ВЫБОР
			               |		КОГДА ЗаказПоставщику.ит_ИсточникЗаказа = &ИсточникМногозадачник
			               |			ТОГДА ""Консолидация интернет заказов""
			               |		ИНАЧЕ ЗаказПоставщику.Автор.Наименование
			               |	КОНЕЦ КАК Логин,
			               |	""МясмаркетРарус"" КАК Источник,
			               |	"""" КАК ТелефонАвтора,
			               |	ВЫБОР
			               |		КОГДА ЗаказПоставщику.ит_ИсточникЗаказа = &ИсточникМногозадачник
			               |			ТОГДА ЛОЖЬ
			               |		ИНАЧЕ ИСТИНА
			               |	КОНЕЦ КАК ВетСправка,
			               |	ЗаказПоставщику.Товары.(
			               |		НомерСтроки КАК НомерСтроки,
			               |		Номенклатура.ЕРПМастерКлюч КАК НоменклатураЕРПМастерКлюч,
			               |		ВЫБОР
			               |			КОГДА ЗаказПоставщику.Товары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код = ""166""
			               |					И ЕСТЬNULL(ЗаказПоставщику.Товары.Номенклатура.ит_СреднийВес, 0) > 0
			               |				ТОГДА ЗаказПоставщику.Товары.Количество / ЗаказПоставщику.Товары.Номенклатура.ит_СреднийВес
			               |			ИНАЧЕ ЗаказПоставщику.Товары.Количество
			               |		КОНЕЦ КАК Количество,
			               |		Номенклатура.ит_СреднийВес КАК Коэф,
			               |		Коэффициент КАК Коэффициент,
			               |		Цена КАК Цена,
			               |		Сумма КАК Сумма,
			               |		ВЫБОР
			               |			КОГДА ЗаказПоставщику.Товары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код = ""166""
			               |				ТОГДА ЗаказПоставщику.Товары.Количество
			               |			КОГДА ЗаказПоставщику.Товары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код = ""796""
			               |				ТОГДА ВЫБОР
			               |						КОГДА НЕ ЕСТЬNULL(ЗаказПоставщику.Товары.Номенклатура.ит_СреднийВес, 0) = 0
			               |							ТОГДА ЗаказПоставщику.Товары.Номенклатура.ит_СреднийВес * ЗаказПоставщику.Товары.Количество
			               |						КОГДА НЕ ЕСТЬNULL(ЗаказПоставщику.Товары.ЕдиницаИзмерения.Вес, 0) = 0
			               |							ТОГДА ЗаказПоставщику.Товары.ЕдиницаИзмерения.Вес * ЗаказПоставщику.Товары.Количество
			               |					КОНЕЦ
			               |			ИНАЧЕ ЗаказПоставщику.Товары.ЕдиницаИзмерения.Вес * ЗаказПоставщику.Товары.Количество
			               |		КОНЕЦ КАК ИтогКГ,
			               |		ВЫБОР
			               |			КОГДА ЗаказПоставщику.Товары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код = ""166""
			               |				ТОГДА ВЫБОР
			               |						КОГДА ЕСТЬNULL(ЗаказПоставщику.Товары.Номенклатура.ит_СреднийВес, 0) = 0
			               |								ИЛИ ЕСТЬNULL(ЗаказПоставщику.Товары.Номенклатура.ит_СреднийВесПродуктаВУпаковке, 0) = 0
			               |							ТОГДА ЗаказПоставщику.Товары.Количество
			               |						ИНАЧЕ ЗаказПоставщику.Товары.Количество * ЗаказПоставщику.Товары.Номенклатура.ит_СреднийВесПродуктаВУпаковке / ЗаказПоставщику.Товары.Номенклатура.ит_СреднийВес
			               |					КОНЕЦ
			               |			КОГДА ЗаказПоставщику.Товары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код = ""796""
			               |				ТОГДА ЗаказПоставщику.Товары.Количество
			               |			ИНАЧЕ ЗаказПоставщику.Товары.ЕдиницаИзмерения.Вес * ЗаказПоставщику.Товары.Количество
			               |		КОНЕЦ КАК КоличествоКг,
			               |		ПОДСТРОКА(ЗаказПоставщику.Товары.Номенклатура.ЕРПМастерКлюч, 1, 11) = ""00-00000688""
			               |			ИЛИ ПОДСТРОКА(ЗаказПоставщику.Товары.Номенклатура.ЕРПМастерКлюч, 1, 11) = ""00-00035275"" КАК ЭтоШашлык
			               |	) КАК Товары
			               |ИЗ
			               |	втИзменения КАК втИзменения
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
			               |		ПО втИзменения.Ссылка = ЗаказПоставщику.Ссылка
			               |ГДЕ
			               |	ЗаказПоставщику.Проведен
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	ЗаказПоставщику.Дата,
			               |	ЗаказПоставщику.Номер,
			               |	ЗаказПоставщику.Товары.НомерСтроки";
	//Цепелев  --- 2020-03-26-04-44              
	
	Запрос.УстановитьПараметр("Узел",ТекУзел);
	Запрос.УстановитьПараметр("ИсточникМногозадачник",Перечисления.ит_ИсточникиЗаказовПоставщику.Многозадачник);
	
	//Цепелев  +++ 2019-07-17-09-12
	Запрос.УстановитьПараметр("ДатаНачалаВыгрузки",ТекущаяДата());
	//Цепелев  --- 2019-07-17-09-12 
	тзРезЗвпроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	ДобавитьИдентификаторыОбъектов(ТаблицаРезультата);
	
	Возврат ТаблицаРезультата;
	
КонецФункции


Функция ВернутьТаблицуЗначенийПоКлючуВыгрузкаЗаявокНаОбмен() Экспорт
	Запрос = Новый Запрос;
	
	ТекУзел = ПланыОбмена.рздВыгрузкаВЕРП.НайтиПоКоду("ЕРП");
	Если ТекУзел.Пустая() Тогда
		
		Возврат 0;
	КонецЕсли;
	


	Запрос.Текст = "ВЫБРАТЬ
	               |	СписаниеТоваровИзменения.Ссылка КАК Ссылка,
	               |	СписаниеТоваровИзменения.НомерСообщения КАК НомерСообщения
	               |ПОМЕСТИТЬ втИзменения
	               |ИЗ
	               |	Документ.СписаниеТоваров.Изменения КАК СписаниеТоваровИзменения
	               |ГДЕ
	               |	СписаниеТоваровИзменения.Узел = &Узел
	               |	И СписаниеТоваровИзменения.Ссылка.ит_ЗаявкаНаОбмен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СписаниеТоваров.Ссылка КАК Ссылка,
	               |	втИзменения.НомерСообщения КАК НомерСообщения,
	               |	СписаниеТоваров.Проведен КАК Проведен,
	               |	СписаниеТоваров.Номер КАК Номер,
	               |	СписаниеТоваров.Дата КАК Дата,
	               |	СписаниеТоваров.ДатаЗаявки КАК ДатаЗаявки,
	               |	&ДатаНачалаВыгрузки КАК ДатаНачалаВыгрузки,
	               |	СписаниеТоваров.ПодразделениеКомпании.МастерКлючСГП КАК ПартнерЕРПМастерКлюч,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеТоваров.Автор) КАК Автор,
	               |	СписаниеТоваров.Комментарий КАК Комментарий,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеТоваров.ПричинаВозврата) КАК ПричинаВозврата,
	               |	СписаниеТоваров.Товары.(
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура.ЕРПМастерКлюч КАК НоменклатураЕРПМастерКлюч,
	               |		Количество КАК КолШт,
	               |		ЦенаРозничная КАК Цена,
	               |		ЦенаРозничная КАК Сумма,
	               |		ВЫБОР
	               |			КОГДА СписаниеТоваров.Товары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код = ""166""
	               |				ТОГДА СписаниеТоваров.Товары.Количество
	               |			КОГДА СписаниеТоваров.Товары.ЕдиницаИзмерения.Наименование = ""кг""
	               |				ТОГДА СписаниеТоваров.Товары.Количество
	               |			ИНАЧЕ СписаниеТоваров.Товары.ЕдиницаИзмерения.Вес * СписаниеТоваров.Товары.Количество
	               |		КОНЕЦ КАК Количество
	               |	) КАК Товары
	               |ИЗ
	               |	втИзменения КАК втИзменения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеТоваров КАК СписаниеТоваров
	               |		ПО втИзменения.Ссылка = СписаниеТоваров.Ссылка
	               |ГДЕ
	               |	СписаниеТоваров.Проведен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СписаниеТоваров.Дата,
	               |	СписаниеТоваров.Номер,
	               |	СписаниеТоваров.Товары.НомерСтроки";	
	
	
	Запрос.УстановитьПараметр("Узел",ТекУзел);
	//Цепелев  +++ 2019-07-17-09-12
	Запрос.УстановитьПараметр("ДатаНачалаВыгрузки",ТекущаяДата());
	//Цепелев  --- 2019-07-17-09-12              
	тзРезЗвпроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	ДобавитьИдентификаторыОбъектовЗаявкаНаВозврат(ТаблицаРезультата);
	
	//Мальцев А.Ю.+++ снять с регистрации документы, которые были зарегестрированы для обмена, но по каким-то причинам, флаг был снят
	СнятьРегистрациюУНеактуальных(ТекУзел);
	//Мальцев А.Ю.---
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Процедура СнятьРегистрациюУНеактуальных(ТекУзел)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеТоваровИзменения.Ссылка КАК Ссылка,
	|	СписаниеТоваровИзменения.НомерСообщения КАК НомерСообщения
	|ИЗ
	|	Документ.СписаниеТоваров.Изменения КАК СписаниеТоваровИзменения
	|ГДЕ
	|	СписаниеТоваровИзменения.Узел = &Узел
	|	И СписаниеТоваровИзменения.Ссылка.ит_ЗаявкаНаОбмен = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Узел", ТекУзел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПланыОбмена.УдалитьРегистрациюИзменений(ТекУзел, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьВыгрузкуПоКлючу() Экспорт
	
	ПараметрыОперации = Новый Структура;
	КлючФункции = "UploadOrders";	
    ЗаказыЕРП = НастройкиПодключенияWSHS(КлючФункции);
		
	ТаблицаКВыгрузке = ВернутьТаблицуЗначенийПоКлючу(); 
	Если ЗначениеЗаполнено(ТаблицаКВыгрузке) Тогда
		КлючФункции = "ЗаявкиПокупателя";	
		Данные = Новый Структура("ТаблицаДанных", ТаблицаКВыгрузке);
		ПараметрыОперации = Новый Структура("КлючФункции, Данные", КлючФункции, Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9)));
		Ответ = ПеренаправлениеНаДругойСервис(ПараметрыОперации,  ЗаказыЕРП);
		//ОбработатьРезультат(ТЦСервер.Десериализовать(Ответ));
		ОбработатьРезультат(глДесериализовать(Ответ));
	КонецЕсли;

	#Область ВыгрузкаСписаний_В_Заявку_На_Обмен
	ПараметрыОперации = Новый Структура;
		
	//Мальцев А.Ю. +++ Выгрузка спискние перенесена на документ заявка на возврат
	ТаблицаКВыгрузке = ВернутьТаблицуЗначенийПоКлючуВыгрузкаЗаявокНаОбмен(); 
	КлючФункции = "ЗаявкиНаВозврат";
	Если ЗначениеЗаполнено(ТаблицаКВыгрузке) Тогда
		Данные = Новый Структура("ТаблицаДанных", ТаблицаКВыгрузке);
		ПараметрыОперации = Новый Структура("КлючФункции, Данные", КлючФункции, Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9)));
		Ответ = ПеренаправлениеНаДругойСервис(ПараметрыОперации,  ЗаказыЕРП);
		//ОбработатьРезультатЗаявкиНаОбмен(ТЦСервер.Десериализовать(Ответ),ТаблицаКВыгрузке);
		ОбработатьРезультатЗаявкиНаОбмен(глДесериализовать(Ответ),ТаблицаКВыгрузке);
	КонецЕсли;
	
	ТаблицаКВыгрузке = ВернутьТаблицуЗначенийПоКлючуВыгрузкаЗаявокНаОбменНовая(); 
	КлючФункции = "ЗаявкиНаВозвратЕСУР";
	Если ЗначениеЗаполнено(ТаблицаКВыгрузке) Тогда
		Данные = Новый Структура("ТаблицаДанных", ТаблицаКВыгрузке);
		ПараметрыОперации = Новый Структура("КлючФункции, Данные", КлючФункции, Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9)));
		Ответ = ПеренаправлениеНаДругойСервис(ПараметрыОперации,  ЗаказыЕРП);
		//ОбработатьРезультатЗаявкиНаОбмен(ТЦСервер.Десериализовать(Ответ),ТаблицаКВыгрузке);
		ОбработатьРезультатЗаявкиНаОбменНовая(глДесериализовать(Ответ),ТаблицаКВыгрузке);
	КонецЕсли;
	
	ТаблицаКВыгрузке = ВернутьТаблицуЗначенийПоКлючуВыгрузкаЗаявокНаРасхождение(); 
	КлючФункции = "ЗаявкиНаРасхождениеЕСУР";
	Если ЗначениеЗаполнено(ТаблицаКВыгрузке) Тогда
		Данные = Новый Структура("ТаблицаДанных", ТаблицаКВыгрузке);
		ПараметрыОперации = Новый Структура("КлючФункции, Данные", КлючФункции, Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9)));
		Ответ = ПеренаправлениеНаДругойСервис(ПараметрыОперации,  ЗаказыЕРП);
		//ОбработатьРезультатЗаявкиНаОбмен(ТЦСервер.Десериализовать(Ответ),ТаблицаКВыгрузке);
		ОбработатьРезультатЗаявкиНаРасхождение(глДесериализовать(Ответ),ТаблицаКВыгрузке);
	КонецЕсли;

	ТаблицаКВыгрузке = ВернутьТаблицуЗначенийПоКлючуВыгрузкаЗаявокНаРасходованиеДС(); 
	КлючФункции = "ЗаявкиНаРасходованиеДСЕСУР";
	Если ЗначениеЗаполнено(ТаблицаКВыгрузке) Тогда
		Данные = Новый Структура("ТаблицаДанных", ТаблицаКВыгрузке);
		ПараметрыОперации = Новый Структура("КлючФункции, Данные", КлючФункции, Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9)));
		Ответ = ПеренаправлениеНаДругойСервис(ПараметрыОперации,  ЗаказыЕРП);
		//ОбработатьРезультатЗаявкиНаОбмен(ТЦСервер.Десериализовать(Ответ),ТаблицаКВыгрузке);
		ОбработатьРезультатЗаявкиНаРасходованиеДС(глДесериализовать(Ответ),ТаблицаКВыгрузке);
	КонецЕсли;

	//Мальцев А.Ю. ---	
#КонецОбласти

КонецПроцедуры

//Мальцев А.Ю. +++
Функция ВернутьТаблицуЗначенийПоКлючуВыгрузкаЗаявокНаОбменНовая() Экспорт
	Запрос = Новый Запрос;
	
	ТекУзел = ПланыОбмена.рздВыгрузкаВЕРП.НайтиПоКоду("ЕРП");
	Если ТекУзел.Пустая() Тогда
		
		Возврат 0;
	КонецЕсли;
	


	Запрос.Текст = "ВЫБРАТЬ
	               |	итЗаявкаНаВозвратИзменения.Ссылка КАК Ссылка,
	               |	итЗаявкаНаВозвратИзменения.НомерСообщения КАК НомерСообщения,
	               |	итЗаявкаНаВозвратИзменения.Ссылка.ДокументОснование КАК ДокументОснование
	               |ПОМЕСТИТЬ втИзменения
	               |ИЗ
	               |	Документ.итЗаявкаНаВозврат.Изменения КАК итЗаявкаНаВозвратИзменения
	               |ГДЕ
	               |	итЗаявкаНаВозвратИзменения.Узел = &Узел
	               |	И итЗаявкаНаВозвратИзменения.Ссылка.Статус = &КОтправке
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровРаспределениеПоставки.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(ПоступлениеТоваровРаспределениеПоставки.ЗаказПоставщику) КАК СсылкаЗаказПоставщику
	               |ПОМЕСТИТЬ втЗаказы
	               |ИЗ
	               |	Документ.ПоступлениеТоваров.РаспределениеПоставки КАК ПоступлениеТоваровРаспределениеПоставки
	               |ГДЕ
	               |	ПоступлениеТоваровРаспределениеПоставки.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втИзменения.ДокументОснование КАК ДокументОснование
	               |			ИЗ
	               |				втИзменения КАК втИзменения)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровРаспределениеПоставки.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СписаниеТоваров.Ссылка КАК Ссылка,
	               |	втИзменения.НомерСообщения КАК НомерСообщения,
	               |	СписаниеТоваров.Проведен КАК Проведен,
	               |	СписаниеТоваров.Номер КАК Номер,
	               |	СписаниеТоваров.Дата КАК Дата,
	               |	СписаниеТоваров.ДатаЗаявки КАК ДатаЗаявки,
	               |	&ДатаНачалаВыгрузки КАК ДатаНачалаВыгрузки,
	               |	СписаниеТоваров.ПодразделениеКомпании.МастерКлючСГП КАК ПартнерЕРПМастерКлюч,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеТоваров.Автор) КАК Автор,
	               |	СписаниеТоваров.Комментарий КАК Комментарий,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеТоваров.ПричинаВозврата) КАК ПричинаВозврата,
	               |	СписаниеТоваров.Товары.(
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура.ЕРПМастерКлюч КАК НоменклатураЕРПМастерКлюч,
	               |		Количество КАК КолШт,
	               |		ЦенаРозничная КАК Цена,
	               |		ЦенаРозничная КАК Сумма,
	               |		ВЫБОР
	               |			КОГДА СписаниеТоваров.Товары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код = ""166""
	               |				ТОГДА СписаниеТоваров.Товары.Количество
	               |			КОГДА СписаниеТоваров.Товары.ЕдиницаИзмерения.Наименование = ""кг""
	               |				ТОГДА СписаниеТоваров.Товары.Количество
	               |			ИНАЧЕ СписаниеТоваров.Товары.ЕдиницаИзмерения.Вес * СписаниеТоваров.Товары.Количество
	               |		КОНЕЦ КАК Количество
	               |	) КАК Товары,
	               |	СписаниеТоваров.ДокументОснование.ВхДокНомер КАК ОснованиеВхДокНомер,
	               |	СписаниеТоваров.ДокументОснование.ВхДокДата КАК ОснованиеВхДокДата,
	               |	втЗаказы.СсылкаЗаказПоставщику КАК ЗаказПоставщику,
	               |	ВЫБОР
	               |		КОГДА СписаниеТоваров.Классификация = &КоричневыйПаспорт
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК КоричневыйПаспорт
	               |ИЗ
	               |	втИзменения КАК втИзменения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.итЗаявкаНаВозврат КАК СписаниеТоваров
	               |		ПО втИзменения.Ссылка = СписаниеТоваров.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втЗаказы КАК втЗаказы
	               |		ПО втИзменения.ДокументОснование = втЗаказы.Ссылка
	               |ГДЕ
	               |	СписаниеТоваров.Проведен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СписаниеТоваров.Дата,
	               |	СписаниеТоваров.Номер,
	               |	СписаниеТоваров.Товары.НомерСтроки";	
	
	
	Запрос.УстановитьПараметр("Узел",ТекУзел);
	Запрос.УстановитьПараметр("КОтправке",			Перечисления.итСтатусыЗаявокНаВозврат.КОтправке);
	Запрос.УстановитьПараметр("КоричневыйПаспорт",	Перечисления.итКлассификацияПаспортовНаВозврат.КоричневыйПаспорт);

	//Цепелев  +++ 2019-07-17-09-12
	Запрос.УстановитьПараметр("ДатаНачалаВыгрузки",ТекущаяДата());
	//Цепелев  --- 2019-07-17-09-12              
	тзРезЗвпроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	ДобавитьИдентификаторыОбъектовЗаявкаНаВозврат(ТаблицаРезультата);
	
	//Мальцев А.Ю.+++ снять с регистрации документы, которые были зарегестрированы для обмена, но по каким-то причинам, флаг был снят
	СнятьРегистрациюУНеактуальныхНовая(ТекУзел);
	//Мальцев А.Ю.---
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Процедура СнятьРегистрациюУНеактуальныхНовая(ТекУзел)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СписаниеТоваровИзменения.Ссылка КАК Ссылка,
	|	СписаниеТоваровИзменения.НомерСообщения КАК НомерСообщения
	|ИЗ
	|	Документ.итЗаявкаНаВозврат.Изменения КАК СписаниеТоваровИзменения
	|ГДЕ
	|	СписаниеТоваровИзменения.Узел = &Узел
	|	И СписаниеТоваровИзменения.Ссылка.Проведен = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Узел", ТекУзел);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПланыОбмена.УдалитьРегистрациюИзменений(ТекУзел, ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

Функция ОбработатьРезультатЗаявкиНаОбменНовая(ТаблицаДанных,ТаблицаВыгрузки)
	
	ТаблицаДанных.Колонки.Добавить("ЗаявкаОбъект", Новый ОписаниеТипов("ДокументОбъект.итЗаявкаНаВозврат"));
	
	// обработка результата
	Для каждого СтрДанных Из ТаблицаДанных Цикл
		
		Заявка = Документы.итЗаявкаНаВозврат.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрДанных.ID));
		ЗаявкаОбъект = Заявка.ПолучитьОбъект();
		СтрДанных.ЗаявкаОбъект = ЗаявкаОбъект;
		
		Если СтрДанных.Ошибка Тогда
			ЗаписьЖурналаРегистрации("Выгрузка Заявки на Обмен в ЕРП", УровеньЖурналаРегистрации.Ошибка, ЗаявкаОбъект.Метаданные(),ЗаявкаОбъект, СтрДанных.ТекстОшибки);
			Продолжить;
		КонецЕсли;
		//Цепелев  +++ 2019-07-17-09-10
		Отбор = Новый Структура();
		Отбор.Вставить("ID",СтрДанных.ID);
		Строки = ТаблицаВыгрузки.НайтиСтроки(Отбор);
		НачалоВыгрузки= "";
		Если Строки.Количество() > 0 Тогда
			НачалоВыгрузки = Формат(Строки[0].ДатаНачалаВыгрузки,"ДЛФ=DT");
		КонецЕсли;
		//ЗаявкаОбъект.Комментарий = " Загружен в ЕРП - " + СтрДанных.Номер + " от " + ТекущаяДата();
		ЗаявкаОбъект.Статус             = Перечисления.итСтатусыЗаявокНаВозврат.ОтправленПоставщику;
		ЗаявкаОбъект.КомментарийЕРП 	= " Загружен в ЕРП - " + СтрДанных.Номер + " от " + ТекущаяДата()+?(НачалоВыгрузки= "","","(Начало выгрузки:"+НачалоВыгрузки+"/Окончание выгрузки:"+Формат(ТекущаяДата(),"ДЛФ=DT")+")");		
		ЗаявкаОбъект.НомерЕРП       	= СтрДанных.Номер;
		ЗаявкаОбъект.ДатаОтправкиВЕРП   = ТекущаяДата();
		//Цепелев  --- 2019-07-17-09-10
		Попытка
			//Цепелев  +++ 2019-03-12
			//в целях обеспечения передачи данных в подчиненные узлы БД
			//Если документ не перепроводить он не регистрируется на обмене
			//ЗаявкаОбъект.Записать();
			// дополнительно заполняется структура данных
			//глСтруктураВспомогательныхДанныхСеанса = Новый Структура;
			//на сервере нет глСтруктураВспомогательныхДанныхСеанса 
			//Если ЗаявкаОбъект.Проведен Тогда
			//	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			//Иначе
			//	ЗаявкаОбъект.Записать();
			//КонецЕсли;
			ЗаявкаОбъект.Записать();
			//регистрация на всех узлах обмена
			//это не работает записать с проведением в клиентском режиме через ком соединение
			Отказ = Ложь;
			//орРегистрацияИзменений(ЗаявкаОбъект, Ложь, Отказ);
			//орФиксацияИзмененийОбъектов(ЗаявкаОбъект,Отказ,2);

			//Цепелев  --- 2019-03-12              
			
			
			ТекУзел = ПланыОбмена.рздВыгрузкаВЕРП.НайтиПоКоду("ЕРП");
			ПланыОбмена.УдалитьРегистрациюИзменений(ТекУзел,ЗаявкаОбъект.Ссылка);
			
			
		Исключение
			ЗаписьЖурналаРегистрации("Выгрузка заказов в ЕРП", УровеньЖурналаРегистрации.Ошибка, ЗаявкаОбъект.Метаданные(),ЗаявкаОбъект,"Ошибка при записи успешного заказа загруженного в ЕРП!"+Символы.ПС+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		    //Цепелев  +++ 2019-03-12
			//Возврат Ложь;
			//перестает выгружать все заказы 
			//TO DO доработать отправку сообщений об ошибках обмена на почту администраторам обмена с 1с
			//Цепелев  --- 2019-03-12              
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ВернутьТаблицуЗначенийПоКлючуВыгрузкаЗаявокНаРасхождение() Экспорт
	Запрос = Новый Запрос;
	
	ТекУзел = ПланыОбмена.рздВыгрузкаВЕРП.НайтиПоКоду("ЕРП");
	Если ТекУзел.Пустая() Тогда
		
		Возврат 0;
	КонецЕсли;
	


	Запрос.Текст = "ВЫБРАТЬ
	               |	итЗаявкаНаРасхождение.Ссылка КАК Ссылка,
	               |	итЗаявкаНаРасхождение.НомерСообщения КАК НомерСообщения,
	               |	итЗаявкаНаРасхождение.Ссылка.ДокументОснование КАК ДокументОснование
	               |ПОМЕСТИТЬ втИзменения
	               |ИЗ
	               |	Документ.итЗаявкаНаРасхождение.Изменения КАК итЗаявкаНаРасхождение
	               |ГДЕ
	               |	итЗаявкаНаРасхождение.Узел = &Узел
	               |	И итЗаявкаНаРасхождение.Ссылка.Статус = &КОтправке
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СписаниеТоваров.Ссылка КАК Ссылка,
	               |	втИзменения.НомерСообщения КАК НомерСообщения,
	               |	СписаниеТоваров.Проведен КАК Проведен,
	               |	СписаниеТоваров.Номер КАК Номер,
	               |	СписаниеТоваров.Дата КАК Дата,
	               |	СписаниеТоваров.Дата КАК ДатаЗаявки,
	               |	&ДатаНачалаВыгрузки КАК ДатаНачалаВыгрузки,
	               |	СписаниеТоваров.ПодразделениеКомпании.МастерКлючСГП КАК ПартнерЕРПМастерКлюч,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеТоваров.Автор) КАК Автор,
	               |	СписаниеТоваров.Комментарий КАК Комментарий,
	               |	СписаниеТоваров.Товары.(
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура.ЕРПМастерКлюч КАК НоменклатураЕРПМастерКлюч,
	               |		Количество КАК КолШт,
	               |		ЦенаРозничная КАК Цена,
	               |		ЦенаРозничная КАК Сумма,
	               |		ВЫБОР
	               |			КОГДА СписаниеТоваров.Товары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код = ""166""
	               |				ТОГДА СписаниеТоваров.Товары.Количество
	               |			КОГДА СписаниеТоваров.Товары.ЕдиницаИзмерения.Наименование = ""кг""
	               |				ТОГДА СписаниеТоваров.Товары.Количество
	               |			ИНАЧЕ СписаниеТоваров.Товары.ЕдиницаИзмерения.Вес * СписаниеТоваров.Товары.Количество
	               |		КОНЕЦ КАК Количество,
				   |		СписаниеТоваров.Товары.Номенклатура.ОсновнаяЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код  КАК ОснЕдИзмЕСУР,
	               |		ВЫБОР
	               |			КОГДА СписаниеТоваров.Товары.Номенклатура.ОсновнаяЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код = ""166""
	               |				ТОГДА СписаниеТоваров.Товары.Количество /ЕстьNull(СписаниеТоваров.Товары.Номенклатура.ит_СреднийВес,0)
	               |			ИНАЧЕ СписаниеТоваров.Товары.Количество*ЕстьNull(СписаниеТоваров.Товары.Номенклатура.ит_СреднийВес,0)
	               |		КОНЕЦ КАК КоличествоАльт,				   
	               |	) КАК Товары,
	               |	СписаниеТоваров.ДокументОснование.ВхДокНомер КАК ОснованиеВхДокНомер,
	               |	СписаниеТоваров.ДокументОснование.ВхДокДата КАК ОснованиеВхДокДата,
	               |	СписаниеТоваров.ПометкаУдаления КАК ПометкаУдаления
	               |ИЗ
	               |	втИзменения КАК втИзменения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.итЗаявкаНаРасхождение КАК СписаниеТоваров
	               |		ПО втИзменения.Ссылка = СписаниеТоваров.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СписаниеТоваров.Дата,
	               |	СписаниеТоваров.Номер,
	               |	СписаниеТоваров.Товары.НомерСтроки";	
	
	
	Запрос.УстановитьПараметр("Узел",ТекУзел);
	Запрос.УстановитьПараметр("КОтправке",Перечисления.итСтатусыЗаявокНаВозврат.КОтправке);

	//Цепелев  +++ 2019-07-17-09-12
	Запрос.УстановитьПараметр("ДатаНачалаВыгрузки",ТекущаяДата());
	//Цепелев  --- 2019-07-17-09-12              
	тзРезЗвпроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	ДобавитьИдентификаторыОбъектовЗаявкаНаРасхождение(ТаблицаРезультата);
	
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ОбработатьРезультатЗаявкиНаРасхождение(ТаблицаДанных,ТаблицаВыгрузки)
	
	ТаблицаДанных.Колонки.Добавить("ЗаявкаОбъект", Новый ОписаниеТипов("ДокументОбъект.итЗаявкаНаВозврат"));
	
	// обработка результата
	Для каждого СтрДанных Из ТаблицаДанных Цикл
		
		Заявка = Документы.итЗаявкаНаРасхождение.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрДанных.ID));
		ЗаявкаОбъект = Заявка.ПолучитьОбъект();
		СтрДанных.ЗаявкаОбъект = ЗаявкаОбъект;
		
		Если СтрДанных.Ошибка Тогда
			ЗаписьЖурналаРегистрации("Выгрузка Заявки на Обмен в ЕРП", УровеньЖурналаРегистрации.Ошибка, ЗаявкаОбъект.Метаданные(),ЗаявкаОбъект, СтрДанных.ТекстОшибки);
			//Продолжить;
		КонецЕсли;
		//Цепелев  +++ 2019-07-17-09-10
		Отбор = Новый Структура();
		Отбор.Вставить("ID",СтрДанных.ID);
		Строки = ТаблицаВыгрузки.НайтиСтроки(Отбор);
		НачалоВыгрузки= "";
		Если Строки.Количество() > 0 Тогда
			НачалоВыгрузки = Формат(Строки[0].ДатаНачалаВыгрузки,"ДЛФ=DT");
		КонецЕсли;
		//ЗаявкаОбъект.Комментарий = " Загружен в ЕРП - " + СтрДанных.Номер + " от " + ТекущаяДата();
		Если Не СтрДанных.Ошибка Тогда		
			ЗаявкаОбъект.Статус             = Перечисления.итСтатусыЗаявокНаВозврат.ОтправленПоставщику;
			ЗаявкаОбъект.КомментарийЕРП 	= " Загружен в ЕРП - " + СтрДанных.Номер + " от " + ТекущаяДата()+?(НачалоВыгрузки= "","","(Начало выгрузки:"+НачалоВыгрузки+"/Окончание выгрузки:"+Формат(ТекущаяДата(),"ДЛФ=DT")+")");		
		Иначе
			ЗаявкаОбъект.Статус             = Перечисления.итСтатусыЗаявокНаВозврат.ОшибкаЗагрузкиУПоставщика;
			ЗаявкаОбъект.КомментарийЕРП 	=  СтрДанных.ТекстОшибки  + ("Начало выгрузки:"+НачалоВыгрузки+"/Окончание выгрузки:"+Формат(ТекущаяДата(),"ДЛФ=DT")+")");		
		КонецЕсли;
		ЗаявкаОбъект.НомерЕРП       	= СтрДанных.Номер;
		ЗаявкаОбъект.ДатаОтправкиВЕРП   = ТекущаяДата();
		//Цепелев  --- 2019-07-17-09-10
		Попытка
			//Цепелев  +++ 2019-03-12
			//в целях обеспечения передачи данных в подчиненные узлы БД
			//Если документ не перепроводить он не регистрируется на обмене
			//ЗаявкаОбъект.Записать();
			// дополнительно заполняется структура данных
			//глСтруктураВспомогательныхДанныхСеанса = Новый Структура;
			//на сервере нет глСтруктураВспомогательныхДанныхСеанса 
			//Если ЗаявкаОбъект.Проведен Тогда
			//	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			//Иначе
			//	ЗаявкаОбъект.Записать();
			//КонецЕсли;
			ЗаявкаОбъект.Записать();
			//регистрация на всех узлах обмена
			//это не работает записать с проведением в клиентском режиме через ком соединение
			Отказ = Ложь;
			//орРегистрацияИзменений(ЗаявкаОбъект, Ложь, Отказ);
			//орФиксацияИзмененийОбъектов(ЗаявкаОбъект,Отказ,2);

			//Цепелев  --- 2019-03-12              
			
			
			ТекУзел = ПланыОбмена.рздВыгрузкаВЕРП.НайтиПоКоду("ЕРП");
			ПланыОбмена.УдалитьРегистрациюИзменений(ТекУзел,ЗаявкаОбъект.Ссылка);
			
			
		Исключение
			ЗаписьЖурналаРегистрации("Выгрузка заказов в ЕРП", УровеньЖурналаРегистрации.Ошибка, ЗаявкаОбъект.Метаданные(),ЗаявкаОбъект,"Ошибка при записи успешного заказа загруженного в ЕРП!"+Символы.ПС+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		    //Цепелев  +++ 2019-03-12
			//Возврат Ложь;
			//перестает выгружать все заказы 
			//TO DO доработать отправку сообщений об ошибках обмена на почту администраторам обмена с 1с
			//Цепелев  --- 2019-03-12              
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ВернутьТаблицуЗначенийПоКлючуВыгрузкаЗаявокНаРасходованиеДС() Экспорт
	Запрос = Новый Запрос;
	
	ТекУзел = ПланыОбмена.рздВыгрузкаВЕРП.НайтиПоКоду("ЕРП");
	Если ТекУзел.Пустая() Тогда
		
		Возврат 0;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкаНаРасходДС.Ссылка КАК Ссылка,
	               |	ЗаявкаНаРасходДС.НомерСообщения КАК НомерСообщения,
	               |	ЗаявкаНаРасходДС.Ссылка.ДокументОснование КАК ДокументОснование
	               |ПОМЕСТИТЬ втИзменения
	               |ИЗ
	               |	Документ.ЗаявкаНаРасходДС.Изменения КАК ЗаявкаНаРасходДС
	               |ГДЕ
	               |	ЗаявкаНаРасходДС.Узел = &Узел
	               |	И ЗаявкаНаРасходДС.Ссылка.Статус = &КОтправке
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявкаНаРасходДС.Ссылка КАК Ссылка,
	               |	втИзменения.НомерСообщения КАК НомерСообщения,
	               |	ЗаявкаНаРасходДС.Проведен КАК Проведен,
	               |	ЗаявкаНаРасходДС.Номер КАК Номер,
	               |	ЗаявкаНаРасходДС.Дата КАК Дата,
	               |	ЗаявкаНаРасходДС.Дата КАК ДатаЗаявки,
	               |	&ДатаНачалаВыгрузки КАК ДатаНачалаВыгрузки,
	               |	ЗаявкаНаРасходДС.ПодразделениеКомпании.ЕРПМастерКлюч КАК ЕРПМастерКлюч,
	               |	ЗаявкаНаРасходДС.Организация.ЕРПМастерКлюч КАК ОрганизацияЕРПМастерКлюч,
	               |	ПРЕДСТАВЛЕНИЕ(ЗаявкаНаРасходДС.Автор) КАК Автор,
	               |	ЗаявкаНаРасходДС.Комментарий КАК Комментарий,
	               |	ЗаявкаНаРасходДС.Платежи.(
	               |		НомерСтроки КАК НомерСтроки,
	               |		ДатаПлатежа КАК ДатаПлатежа,
	               |		ПРЕДСТАВЛЕНИЕ(ЗаявкаНаРасходДС.Платежи.СтатьяРасходов) КАК СтатьяРасходов,
	               |		Описание КАК Описание,
	               |		Сумма КАК Сумма,
	               |		СтавкаНДС.Ставка КАК СтавкаНДС,
	               |		СуммаНДС КАК СуммаНДС
	               |	) КАК Платежи,
	               |	ЗаявкаНаРасходДС.ДокументОснование.ВхДокНомер КАК ОснованиеВхДокНомер,
	               |	ЗаявкаНаРасходДС.ДокументОснование.ВхДокДата КАК ОснованиеВхДокДата,
	               |	ЗаявкаНаРасходДС.ПометкаУдаления КАК ПометкаУдаления,
	               |	ЗаявкаНаРасходДС.СтруктурнаяЕдиница.ЕРПМастерКлюч КАК ЕРПМастерКлючБС,
	               |	ЗаявкаНаРасходДС.ДоговорВзаиморасчетов.ЕРПМастерКлюч КАК ДоговорЕРПМастерКлюч,
	               |	ЗаявкаНаРасходДС.Контрагент.ЕРПМастерКлюч КАК КонтрагентЕРПМастерКлюч,
	               |	ПОДСТРОКА(ЗаявкаНаРасходДС.Назначение, 0, 210) КАК НазначениеПлатежа
	               |ИЗ
	               |	втИзменения КАК втИзменения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходДС КАК ЗаявкаНаРасходДС
	               |		ПО втИзменения.Ссылка = ЗаявкаНаРасходДС.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаявкаНаРасходДС.Дата,
	               |	ЗаявкаНаРасходДС.Номер,
	               |	ЗаявкаНаРасходДС.Платежи.НомерСтроки";	
	
	
	Запрос.УстановитьПараметр("Узел",ТекУзел);
	Запрос.УстановитьПараметр("КОтправке",Перечисления.итСтатусыЗаявокНаРасходованиеДС.КОтправке);

	//Цепелев  +++ 2019-07-17-09-12
	Запрос.УстановитьПараметр("ДатаНачалаВыгрузки",ТекущаяДата());
	//Цепелев  --- 2019-07-17-09-12              
	тзРезЗвпроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	ДобавитьФайлыПоступлений(ТаблицаРезультата);
		
	ДобавитьИдентификаторыОбъектовЗаявкаНаРасхождение(ТаблицаРезультата);
		
	Возврат ТаблицаРезультата;
	
КонецФункции

Процедура ДобавитьФайлыПоступлений(ТаблицаРезультата)
	
	КС = Новый КвалификаторыСтроки();
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);	
	
	ТаблицаРезультата.Колонки.Добавить("КартинкаBase64",ОписаниеТиповС);
	ТаблицаРезультата.Колонки.Добавить("ИмяФайла",ОписаниеТиповС);
	ТаблицаРезультата.Колонки.Добавить("Расширение",ОписаниеТиповС);
	
	ТаблицаРезультата.Колонки.Добавить("Файлы",Новый ОписаниеТипов("ТаблицаЗначений"));
	
	Для каждого СтрокаРезультата Из ТаблицаРезультата Цикл		
		тбПлатежи = СтрокаРезультата.Платежи;
	    тбПлатежи.Колонки.Добавить("Файлы",Новый ОписаниеТипов("ТаблицаЗначений"));
		
		
		КартинкаBase64 = "";	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭДПрисоединенныеФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭДПрисоединенныеФайлы КАК ЭДПрисоединенныеФайлы
		|ГДЕ
		|	ЭДПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
		
		Запрос.УстановитьПараметр("ВладелецФайла", СтрокаРезультата.Ссылка.ДокументОснование);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		тбРезультатЗапроса = РезультатЗапроса.Выгрузить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДанныеФайла =ПрисоединенныеФайлы.ПолучитьДанныеФайла(ВыборкаДетальныеЗаписи.Ссылка, Новый УникальныйИдентификатор,Истина);
			
			АдресКартинки = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
			
			Картинка = ПолучитьИзВременногоХранилища(АдресКартинки); 
			СтрокаРезультата.КартинкаBase64 = Base64Строка(Картинка); 
			СтрокаРезультата.ИмяФайла 		= ДанныеФайла.Наименование;  
			СтрокаРезультата.Расширение 	= ДанныеФайла.Расширение;  
			
			
			тбФайлы = Новый ТаблицаЗначений;
			тбФайлы.Колонки.Добавить("КартинкаBase64",ОписаниеТиповС);
			тбФайлы.Колонки.Добавить("ИмяФайла",ОписаниеТиповС);
			тбФайлы.Колонки.Добавить("Расширение",ОписаниеТиповС);
			
			
			Для каждого стртбРезультат из тбРезультатЗапроса Цикл
				
				ДанныеФайла =ПрисоединенныеФайлы.ПолучитьДанныеФайла(стртбРезультат.Ссылка, Новый УникальныйИдентификатор,Истина);
				
				АдресКартинки = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
				
				Картинка = ПолучитьИзВременногоХранилища(АдресКартинки);
				стртбФайлы = тбФайлы.Добавить();
				стртбФайлы.КартинкаBase64   = Base64Строка(Картинка); 
				стртбФайлы.ИмяФайла 		= ДанныеФайла.Наименование;  
				стртбФайлы.Расширение 	    = ДанныеФайла.Расширение;  
				
			КонецЦикла;	
			
			СтрокаРезультата.Файлы = тбФайлы;
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОбработатьРезультатЗаявкиНаРасходованиеДС(ТаблицаДанных,ТаблицаВыгрузки)
	
	ТаблицаДанных.Колонки.Добавить("ЗаявкаОбъект", Новый ОписаниеТипов("ДокументОбъект.ЗаявкаНаРасходДС"));
	
	// обработка результата
	Для каждого СтрДанных Из ТаблицаДанных Цикл
		
		Заявка = Документы.ЗаявкаНаРасходДС.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрДанных.ID));
		ЗаявкаОбъект = Заявка.ПолучитьОбъект();
		СтрДанных.ЗаявкаОбъект = ЗаявкаОбъект;
		
		Если СтрДанных.Ошибка Тогда
			ЗаписьЖурналаРегистрации("Выгрузка Заявки на расход ДС в ЕРП", УровеньЖурналаРегистрации.Ошибка, ЗаявкаОбъект.Метаданные(),ЗаявкаОбъект, СтрДанных.ТекстОшибки);
			Продолжить;
		КонецЕсли;
		//Цепелев  +++ 2019-07-17-09-10
		Отбор = Новый Структура();
		Отбор.Вставить("ID",СтрДанных.ID);
		Строки = ТаблицаВыгрузки.НайтиСтроки(Отбор);
		НачалоВыгрузки= "";
		Если Строки.Количество() > 0 Тогда
			НачалоВыгрузки = Формат(Строки[0].ДатаНачалаВыгрузки,"ДЛФ=DT");
		КонецЕсли;
		//ЗаявкаОбъект.Комментарий = " Загружен в ЕРП - " + СтрДанных.Номер + " от " + ТекущаяДата();
		ЗаявкаОбъект.СуммаЕРП 			= ЗаявкаОбъект.Платежи.Итог("Сумма");
		ЗаявкаОбъект.Статус             = Перечисления.итСтатусыЗаявокНаРасходованиеДС.ОтправленПоставщику;
		ЗаявкаОбъект.КомментарийЕРП 	= " Загружен в ЕРП - " + СтрДанных.Номер + " от " + ТекущаяДата()+?(НачалоВыгрузки= "","","(Начало выгрузки:"+НачалоВыгрузки+"/Окончание выгрузки:"+Формат(ТекущаяДата(),"ДЛФ=DT")+")");		
		ЗаявкаОбъект.НомерЕРП       	= СтрДанных.Номер;
		ЗаявкаОбъект.ДатаОтправкиВЕРП   = ТекущаяДата();
		//Цепелев  --- 2019-07-17-09-10
		Попытка
			//Цепелев  +++ 2019-03-12
			//в целях обеспечения передачи данных в подчиненные узлы БД
			//Если документ не перепроводить он не регистрируется на обмене
			//ЗаявкаОбъект.Записать();
			// дополнительно заполняется структура данных
			//глСтруктураВспомогательныхДанныхСеанса = Новый Структура;
			//на сервере нет глСтруктураВспомогательныхДанныхСеанса 
			//Если ЗаявкаОбъект.Проведен Тогда
			//	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			//Иначе
			//	ЗаявкаОбъект.Записать();
			//КонецЕсли;
			ЗаявкаОбъект.Записать();
			//регистрация на всех узлах обмена
			//это не работает записать с проведением в клиентском режиме через ком соединение
			Отказ = Ложь;
			//орРегистрацияИзменений(ЗаявкаОбъект, Ложь, Отказ);
			//орФиксацияИзмененийОбъектов(ЗаявкаОбъект,Отказ,2);

			//Цепелев  --- 2019-03-12              
			
			
			ТекУзел = ПланыОбмена.рздВыгрузкаВЕРП.НайтиПоКоду("ЕРП");
			ПланыОбмена.УдалитьРегистрациюИзменений(ТекУзел,ЗаявкаОбъект.Ссылка);
			
			
		Исключение
			ЗаписьЖурналаРегистрации("Выгрузка Заявки на расход ДС в ЕРП", УровеньЖурналаРегистрации.Ошибка, ЗаявкаОбъект.Метаданные(),ЗаявкаОбъект,"Ошибка при записи успешного заказа загруженного в ЕРП!"+Символы.ПС+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		    //Цепелев  +++ 2019-03-12
			//Возврат Ложь;
			//перестает выгружать все заказы 
			//TO DO доработать отправку сообщений об ошибках обмена на почту администраторам обмена с 1с
			//Цепелев  --- 2019-03-12              
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

//Мальцев А.Ю. ---	

Функция ОбработатьРезультатЗаявкиНаОбмен(ТаблицаДанных,ТаблицаВыгрузки)
	
	ТаблицаДанных.Колонки.Добавить("ЗаявкаОбъект", Новый ОписаниеТипов("ДокументОбъект.СписаниеТоваров"));
	
	// обработка результата
	Для каждого СтрДанных Из ТаблицаДанных Цикл
		
		Заявка = Документы.СписаниеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрДанных.ID));
		ЗаявкаОбъект = Заявка.ПолучитьОбъект();
		СтрДанных.ЗаявкаОбъект = ЗаявкаОбъект;
		
		Если СтрДанных.Ошибка Тогда
			ЗаписьЖурналаРегистрации("Выгрузка Заявки на Обмен в ЕРП", УровеньЖурналаРегистрации.Ошибка, ЗаявкаОбъект.Метаданные(),ЗаявкаОбъект, СтрДанных.ТекстОшибки);
			Продолжить;
		КонецЕсли;
		//Цепелев  +++ 2019-07-17-09-10
		Отбор = Новый Структура();
		Отбор.Вставить("ID",СтрДанных.ID);
		Строки = ТаблицаВыгрузки.НайтиСтроки(Отбор);
		НачалоВыгрузки= "";
		Если Строки.Количество() > 0 Тогда
			НачалоВыгрузки = Формат(Строки[0].ДатаНачалаВыгрузки,"ДЛФ=DT");
		КонецЕсли;
		//ЗаявкаОбъект.Комментарий = " Загружен в ЕРП - " + СтрДанных.Номер + " от " + ТекущаяДата();
		ЗаявкаОбъект.КомментарийЕРП 	= " Загружен в ЕРП - " + СтрДанных.Номер + " от " + ТекущаяДата()+?(НачалоВыгрузки= "","","(Начало выгрузки:"+НачалоВыгрузки+"/Окончание выгрузки:"+Формат(ТекущаяДата(),"ДЛФ=DT")+")");		
		ЗаявкаОбъект.НомерЕРП       	= СтрДанных.Номер;
		//Цепелев  --- 2019-07-17-09-10
		Попытка
			//Цепелев  +++ 2019-03-12
			//в целях обеспечения передачи данных в подчиненные узлы БД
			//Если документ не перепроводить он не регистрируется на обмене
			//ЗаявкаОбъект.Записать();
			// дополнительно заполняется структура данных
			//глСтруктураВспомогательныхДанныхСеанса = Новый Структура;
			//на сервере нет глСтруктураВспомогательныхДанныхСеанса 
			//Если ЗаявкаОбъект.Проведен Тогда
			//	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			//Иначе
			//	ЗаявкаОбъект.Записать();
			//КонецЕсли;
			ЗаявкаОбъект.Записать();
			//регистрация на всех узлах обмена
			//это не работает записать с проведением в клиентском режиме через ком соединение
			Отказ = Ложь;
			//орРегистрацияИзменений(ЗаявкаОбъект, Ложь, Отказ);
			//орФиксацияИзмененийОбъектов(ЗаявкаОбъект,Отказ,2);

			//Цепелев  --- 2019-03-12              
			
			
			ТекУзел = ПланыОбмена.рздВыгрузкаВЕРП.НайтиПоКоду("ЕРП");
			ПланыОбмена.УдалитьРегистрациюИзменений(ТекУзел,ЗаявкаОбъект.Ссылка);
			
			
		Исключение
			ЗаписьЖурналаРегистрации("Выгрузка заказов в ЕРП", УровеньЖурналаРегистрации.Ошибка, ЗаявкаОбъект.Метаданные(),ЗаявкаОбъект,"Ошибка при записи успешного заказа загруженного в ЕРП!"+Символы.ПС+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		    //Цепелев  +++ 2019-03-12
			//Возврат Ложь;
			//перестает выгружать все заказы 
			//TO DO доработать отправку сообщений об ошибках обмена на почту администраторам обмена с 1с
			//Цепелев  --- 2019-03-12              
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции


Функция ОбработатьРезультат(ТаблицаДанных)
	
	ТаблицаДанных.Колонки.Добавить("ЗаявкаОбъект", Новый ОписаниеТипов("ДокументОбъект.ЗаказПоставщику"));
	
	// обработка результата
	Для каждого СтрДанных Из ТаблицаДанных Цикл
		
		Заявка = Документы.ЗаказПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрДанных.ID));
		ЗаявкаОбъект = Заявка.ПолучитьОбъект();
		
		СтрДанных.ЗаявкаОбъект = ЗаявкаОбъект;
		
		Если СтрДанных.Ошибка Тогда
			ЗаписьЖурналаРегистрации("Выгрузка заказов в ЕРП", УровеньЖурналаРегистрации.Ошибка, ЗаявкаОбъект.Метаданные(),ЗаявкаОбъект, СтрДанных.ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		ЗаявкаОбъект.Комментарий = " Загружен в ЕРП - " + СтрДанных.Номер + " от " + ТекущаяДата();		
		
		Попытка
			ЗаявкаОбъект.Записать();
			
			ТекУзел = ПланыОбмена.рздВыгрузкаВЕРП.НайтиПоКоду("ЕРП");
			ПланыОбмена.УдалитьРегистрациюИзменений(ТекУзел,ЗаявкаОбъект.Ссылка);
			
			
		Исключение
			Возврат Ложь;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции


Процедура ДобавитьИдентификаторыОбъектов(ТаблицаРезультата)
	
	КС = Новый КвалификаторыСтроки(36);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	
	
	ТаблицаРезультата.Колонки.Добавить("ID",ОписаниеТиповС);
	ТаблицаРезультата.Колонки.Добавить("ВидЗаказа",ОписаниеТиповС);
	
	Для каждого СтрокаРезультата Из ТаблицаРезультата Цикл
		СтрокаРезультата.ID = XMLСтрока(СтрокаРезультата.Ссылка);
		СтрокаРезультата.ВидЗаказа = XMLСтрока(СтрокаРезультата.Ссылка.ит_ВидЗаявки);//СокрЛП(СтрокаРезультата.Ссылка.ит_ВидЗаявки.Метаданные().ЗначенияПеречисления.Найти(СтрокаРезультата.Ссылка.ит_ВидЗаявки).Имя);		
		
		//Цепелев  +++ 2019-02-20
		//ранее механизм добавил коннов для целей поиска перечисления по номеру
		//сейчас 2019-02-20 адаптировали к поиску по наименованию перечисления
		
		//если в поле вид заказа число то получать по номеру вида заказа
		////иначе по наименованию поля
		////ДокументОбъект.рздВидЗаказа     = Перечисления.рздВидыЗаказов.Получить(СтрокаДанных.ВидЗаказа);
		//Если ТипЗнч(СтрокаДанных.ВидЗаказа) = Тип("Число") Тогда
		//	ДокументОбъект.рздВидЗаказа     = Перечисления.рздВидыЗаказов.Получить(СтрокаДанных.ВидЗаказа);
		//Иначе
		//	ДокументОбъект.рздВидЗаказа     = Перечисления.рздВидыЗаказов[СтрокаДанных.ВидЗаказа];
		//КонецЕсли;
		//Если СтрокаРезультата.ВидЗаказа = "ЗаявкаНаПродукциюЦМП" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 16;
		//иНАЧЕ	 
		//	 СтрокаРезультата.ВидЗаказа = 0;
		//КонецЕсли;
		//Если СтрокаРезультата.ВидЗаказа = "ЗаявкаНаПродукциюЦМП" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 16;    
		//ИначеЕсли  СтрокаРезультата.ВидЗаказа = "ЗаказНаЗамороженныеПолуфабрикаты" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 2;
		//ИначеЕсли  СтрокаРезультата.ВидЗаказа = "ЗаказНаОхлажденныеПолуфабрикаты" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 1;
		//  ИначеЕсли  СтрокаРезультата.ВидЗаказа = "ЗаказНаСубпродукты" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 3;
		//ИначеЕсли  СтрокаРезультата.ВидЗаказа = "ЗаказНаШашлык" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 4;
		//ИначеЕсли  СтрокаРезультата.ВидЗаказа = "ДегустацияДляКлиента" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 5;
		//ИначеЕсли  СтрокаРезультата.ВидЗаказа = "ОбразцыДляКлиента" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 6;
		//ИначеЕсли  СтрокаРезультата.ВидЗаказа = "ПромоакцияДляКлиента" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 7;
		//ИначеЕсли  СтрокаРезультата.ВидЗаказа = "Благотворительность" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 8;
		//ИначеЕсли  СтрокаРезультата.ВидЗаказа = "ПередачаОбразцовПродукцииДляЛабораторныхИсследований" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 9;
		//ИначеЕсли  СтрокаРезультата.ВидЗаказа = "Спонсорство" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 10;
		//ИначеЕсли  СтрокаРезультата.ВидЗаказа = "БонусТоваром" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 11;
		//ИначеЕсли  СтрокаРезультата.ВидЗаказа = "ОбразцыДляВнутреннегоПотребления" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 12;
		//ИначеЕсли  СтрокаРезультата.ВидЗаказа = "ПредставительскиеРасходы" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 13;
		//ИначеЕсли  СтрокаРезультата.ВидЗаказа = "ПредставительскиеРасходыУПР" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 14;
		//ИначеЕсли  СтрокаРезультата.ВидЗаказа = "ПрочаяРеализация" Тогда
		//	 СтрокаРезультата.ВидЗаказа = 15;
		//ИНАЧЕ	 
		//	 СтрокаРезультата.ВидЗаказа = 0;
		//КонецЕсли;
		//Цепелев  --- 2019-02-20
		//СтрокаРезультата.ВидЗаказа = СокрЛП(СтрокаРезультата.Ссылка.ит_ВидЗаявки.Метаданные().ЗначенияПеречисления.Получить(Перечисления.рздВидыЗаказовЕРП.Индекс(СтрокаРезультата.Ссылка.ит_ВидЗаявки)).Имя);
	КонецЦикла;
	
	ТаблицаРезультата.Колонки.Удалить("Ссылка");
	
КонецПроцедуры

Процедура ДобавитьИдентификаторыОбъектовЗаявкаНаВозврат(ТаблицаРезультата)
	
	КС = Новый КвалификаторыСтроки(36);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	
	
	ТаблицаРезультата.Колонки.Добавить("ID",ОписаниеТиповС);
	Если ТаблицаРезультата.Колонки.Найти("ЗаказПоставщику") <> Неопределено Тогда
		ТаблицаРезультата.Колонки.Добавить("СсылкаЗаказПоставщику",ОписаниеТиповС);
	КонецЕсли;
	
	ТаблицаРезультата.Колонки.Добавить("ВидЗаказа",ОписаниеТиповС);
	//Цепелев  +++ 2019-02-27
	ТаблицаРезультата.Колонки.Добавить("Источник",ОписаниеТиповС);
	//Цепелев  --- 2019-02-27              
	
	Для каждого СтрокаРезультата Из ТаблицаРезультата Цикл
		СтрокаРезультата.ID 		 		   = XMLСтрока(СтрокаРезультата.Ссылка);
		Если ТаблицаРезультата.Колонки.Найти("ЗаказПоставщику") <> Неопределено Тогда
			СтрокаРезультата.СсылкаЗаказПоставщику = XMLСтрока(СтрокаРезультата.ЗаказПоставщику);
		КонецЕсли;
		СтрокаРезультата.Источник 	 = XMLСтрока("ТехнологияТорговлиРарус");
	КонецЦикла;
	
	ТаблицаРезультата.Колонки.Удалить("Ссылка");
	Если ТаблицаРезультата.Колонки.Найти("ЗаказПоставщику") <> Неопределено Тогда
		ТаблицаРезультата.Колонки.Удалить("ЗаказПоставщику");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьИдентификаторыОбъектовЗаявкаНаРасхождение(ТаблицаРезультата)
	
	КС = Новый КвалификаторыСтроки(36);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	
	
	ТаблицаРезультата.Колонки.Добавить("ID",ОписаниеТиповС);
	//Если ТаблицаРезультата.Колонки.Найти("ЗаказПоставщику") <> Неопределено Тогда
	//	ТаблицаРезультата.Колонки.Добавить("СсылкаЗаказПоставщику",ОписаниеТиповС);
	//КонецЕсли;
	//
	//ТаблицаРезультата.Колонки.Добавить("ВидЗаказа",ОписаниеТиповС);
	//Цепелев  +++ 2019-02-27
	ТаблицаРезультата.Колонки.Добавить("Источник",ОписаниеТиповС);

	//Цепелев  --- 2019-02-27              
	
	Для каждого СтрокаРезультата Из ТаблицаРезультата Цикл
		СтрокаРезультата.ID 		 		   = XMLСтрока(СтрокаРезультата.Ссылка);
		//Если ТаблицаРезультата.Колонки.Найти("ЗаказПоставщику") <> Неопределено Тогда
		//	СтрокаРезультата.СсылкаЗаказПоставщику = XMLСтрока(СтрокаРезультата.ЗаказПоставщику);
		//КонецЕсли;
		СтрокаРезультата.Источник 	 = XMLСтрока("ТехнологияТорговлиРарус");
	КонецЦикла;
	
	//ТаблицаРезультата.Колонки.Удалить("Ссылка");
	//Если ТаблицаРезультата.Колонки.Найти("ЗаказПоставщику") <> Неопределено Тогда
	//	ТаблицаРезультата.Колонки.Удалить("ЗаказПоставщику");
	//КонецЕсли;
	
КонецПроцедуры

Функция НастройкиПодключенияWSHS(ИмяФункции)  Экспорт
	
	
	////Помещаем структуру в хранилище значений
	//	ХранилищеЗначения = Новый ХранилищеЗначения(Сериализовать(СтруктураПараметров),Новый СжатиеДанных(9));

	////Далее передаем хранилище значений в веб сервис. 
	СтруктураПодключения = НастройкиПодключения();
	//ВСОпределение = Новый WSОпределения(СтруктураПодключения.Адрес,"WS","WS");
	//ВСПрокси = Новый WSПрокси(ВСОпределение, СтруктураПодключения.ИмяСервиса, СтруктураПодключения.ИмяСервиса, СтруктураПодключения.ИмяСервиса + "Soap", 900); 
	//	
	//    ВСПрокси.Пользователь = "WS";
	//    ВСПрокси.Пароль = "WS";
	//	
	//Ответ = ВСПрокси.GetServiceTable(СтруктураПодключения.ИмяФункции, ХранилищеЗначения);
	//
	//РезОтвет = Десериализовать(Ответ.Получить());
	
	ИмяСервиса = "ERPGetDataFromUPRUPP";
	Адрес = "http://wwwserv.work.local/ERP_Prodact_integ77/WS/ERPGetDataFromUPRUPP.1cws?wsdl"; 	
	
	
	СтруктураПодключения = Новый Структура();
	СтруктураПодключения.Вставить("ИмяПользователя", "WS_ESUR");
	СтруктураПодключения.Вставить("Пароль", "WS");
	//	Если ИнформационнаяБаза.СерверныйРежим = 2 Тогда
	СтруктураПодключения.Вставить("URIПространстваИменСервиса", "OrdersData");
	//Цепелев  +++ 2018-12-17
	СтруктураПодключения.Вставить("Адрес","" + "http://wwwserv.work.local/erp_prodact_integ77/ws/OrdersData?wsdl");
	//СтруктураПодключения.Вставить("Адрес","" + "http://wwwserv.work.local/dev_ERP_Prodact_integ77_tsepelev/WS/OrdersData?wsdl");
	//Цепелев  --- 2018-12-17              
	//КонецЕсли; 
	//Если ИнформационнаяБаза.СерверныйРежим = 3 Тогда
	//	СтруктураПодключения.Вставить("Адрес","" +  ИнформационнаяБаза.ИмяСервера+ "/" +ИнформационнаяБаза.ИмяБазыДанных);
	//	//СтруктураПодключения.Вставить("Ресурс",ИнформационнаяБаза.Сервис);
	//КонецЕсли;
	//СтруктураПодключения.Вставить("СтрокаПодключения","http://gn:80/dev_intelis_moskalev/ws/ws_CashOrder?wsdl");//ОТЛАДКА
	СтруктураПодключения.Вставить("ИмяСервиса","OrdersData");
	СтруктураПодключения.Вставить("ИмяФункции",ИмяФункции);	
	СтруктураПодключения.Вставить("СерверныйРежим",2);
	
	Возврат СтруктураПодключения;
	
КонецФункции


Функция ПеренаправлениеНаДругойСервис(ПараметрДляОтправкиНаСервер, СтруктураПодключения) Экспорт   //Сервер БД
	Если ТипЗнч(ПараметрДляОтправкиНаСервер)= тип("HTTPСервисЗапрос") Тогда
		ПараметрДляОтправкиНаСервер = ПараметрДляОтправкиНаСервер.ПолучитьТелоКакСтроку();	
	КонецЕсли;	
	
	Если СтруктураПодключения.СерверныйРежим = 2 Тогда
		ВСОпределение = Новый WSОпределения(СтруктураПодключения.Адрес,СтруктураПодключения.ИмяПользователя,СтруктураПодключения.Пароль,300);
		ВСервис       = ВСОпределение.Сервисы.Получить(СтруктураПодключения.URIПространстваИменСервиса,СтруктураПодключения.ИмяСервиса);
		ВТочкаВхода   = ВСервис.ТочкиПодключения.Получить(СтруктураПодключения.ИмяСервиса + "Soap");
		ВОперация     = ВТочкаВхода.Интерфейс.Операции.Получить(СтруктураПодключения.ИмяФункции);    
		
		ВСПрокси = Новый WSПрокси(ВСОпределение, СтруктураПодключения.URIПространстваИменСервиса,СтруктураПодключения.ИмяСервиса,СтруктураПодключения.ИмяСервиса + "Soap"); 
		ВСПрокси.Пользователь = СтруктураПодключения.ИмяПользователя;
		ВСПрокси.Пароль = СтруктураПодключения.Пароль;
		Ответ = "";
				
		Если СтруктураПодключения.ИмяФункции = "UploadOrders" Тогда
						//Цепелев  +++ 2019-10-31-02-08
			//Ответ = ВСПрокси.UploadOrders("ЗаявкиПокупателя", ПараметрДляОтправкиНаСервер.Данные);
			Если ПараметрДляОтправкиНаСервер.Свойство("КлючФункции") Тогда
				Ответ = ВСПрокси.UploadOrders(ПараметрДляОтправкиНаСервер.КлючФункции, ПараметрДляОтправкиНаСервер.Данные);
			Иначе
				Ответ = ВСПрокси.UploadOrders("ЗаявкиПокупателя", ПараметрДляОтправкиНаСервер.Данные);
			КонецЕсли;
			//Цепелев  --- 2019-10-31-02-08 
		КонецЕсли;		
		
		Если Ответ <> "" Тогда
			Возврат Ответ;
		КонецЕсли; 
		
	КонецЕсли; 
	

	Если СтруктураПодключения.СерверныйРежим = 3 Тогда
		HS = Новый HTTPСоединение(
		СтруктураПодключения.Адрес,,СтруктураПодключения.ИмяПользователя,СтруктураПодключения.Пароль,,
		0, // таймаут в секундах
		);
		Попытка
			HSЗапрос = Новый HTTPЗапрос;
			HSЗапрос.АдресРесурса= "/hs/" + СтруктураПодключения.ИмяСервиса + "/" + СтруктураПодключения.ИмяФункции;
			HSЗапрос.УстановитьТелоИзСтроки(ПараметрДляОтправкиНаСервер);
			Ответ = hs.ОтправитьДляОбработки(HSЗапрос);
			HS = Неопределено;
		Исключение
			Сообщить(ИнформацияОбОшибке().Описание, СтатусСообщения.Важное);
		КонецПопытки;
		Возврат Ответ;	
	КонецЕсли; 
	
КонецФункции

Процедура рздВыгрузкаВЕРП() Экспорт
	ВыполнитьВыгрузкуПоКлючу();
КонецПроцедуры

Функция ВыполнитьЗагрузкуИзЕРП(КлючФункции, ПараметрыОперации) Экспорт
	
	//спрВнОбработки = Справочники.ВнешниеПечатныеФормы.НайтиПоНаименованию("ОбменДаннымиСЕРП");
	спрВнОбработки = Справочники.ДополнительныеОтчетыИОбработки.ПолучитьСсылку(Новый УникальныйИдентификатор("fc7429ef-a43b-11eb-80d9-005056b00073"));
	
	
	Если спрВнОбработки.Пустая() Тогда
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("Ошибка", "Не удалось идентифицировать обработку по идентификатору - fc7429ef-a43b-11eb-80d9-005056b00073");
		Возврат СериализаторXDTO.ЗаписатьXDTO(СтруктураОтвета);		
	КонецЕсли;	
	
	
	спрВнОбработкиОбъект = спрВнОбработки.ПолучитьОбъект();
	
	ВнешняяОбработка = ИТ_РегламентныеПроцедуры.ПолучитьВнешнююОбработку(спрВнОбработкиОбъект);
	
	
	//ИмяВременногоФайла = "\\gn.work.local\F\ТехнологияТорговли\ОбменСЕРП_ФММР_Авиаторов(ТК3).epf";
	//ФайлОбработки = Новый Файл(ИмяВременногоФайла);
	
	//Если спрВнОбработки.Пустая() Тогда
	//Если НЕ ФайлОбработки.Существует() Тогда
	//	ТаблицаРезультата = Новый ТаблицаЗначений;
	//	ТаблицаРезультата.Колонки.Добавить("ID",                ОписаниеТипаСтрока(36));
	//	ТаблицаРезультата.Колонки.Добавить("Номер",             ОписаниеТипаСтрока(11));
	//	ТаблицаРезультата.Колонки.Добавить("Сумма",             ОписаниеТипаЧисло(15,2));
	//	ТаблицаРезультата.Колонки.Добавить("КоличествоПозиций", ОписаниеТипаЧисло(6));
	//	ТаблицаРезультата.Колонки.Добавить("Ошибка",            Новый ОписаниеТипов("Булево"));
	//	ТаблицаРезультата.Колонки.Добавить("ТекстОшибки",       ОписаниеТипаСтрока(200));
	//	
	//	ПараметрыОперации.Вставить("ТаблицаРезультата", ТаблицаРезультата);
	//	
	//	ТаблицаРезультатаЗагрузки = ВыполнитьЗагрузкуПоКлючуЕРП(КлючФункции, ПараметрыОперации);
	//	
	//	Возврат Сериализовать1(ПараметрыОперации.ТаблицаРезультата);
	//Иначе
	//спрВнОбработкиОбъект = спрВнОбработки.ПолучитьОбъект();
	//спрВнОбработкиОбъект = Новый Структура;
	//спрВнОбработкиОбъект.Вставить("ХранитьВоВнешнемФайле",Истина);
	//спрВнОбработкиОбъект.Вставить("ПутьКВнешнемуФайлу",ИмяВременногоФайла);
	
	//ВнешняяОбработка = ПолучитьВнешнююОбработку(спрВнОбработкиОбъект);
	
	Возврат ВнешняяОбработка.ВыполнитьЗагрузкуИзЕРП(КлючФункции, ПараметрыОперации);
	//	КонецЕсли;
	
КонецФункции

Функция ПолучитьВнешнююОбработку(Объект) Экспорт
	// получаем обработку
	ОбработкаЕсть=Ложь;
	Если Объект.ХранитьВоВнешнемФайле Тогда
		ИмяФайла=Объект.ПутьКВнешнемуФайлу;
		ВременныйФайл=Новый Файл(ИмяФайла);
		Если ВременныйФайл.Существует() Тогда
			ОбработкаЕсть=Истина;
		КонецЕсли;
		ВременныйФайл=Неопределено;
	Иначе
		Расширение = "epf";
		
		Если Объект.ВидВнешнегоМодуля = Перечисления.ВидыВнешнихМодулей.Обработка Тогда
			Расширение = "epf";
		ИначеЕсли Объект.ВидВнешнегоМодуля = Перечисления.ВидыВнешнихМодулей.Отчет Тогда
			Расширение = "erf";
		ИначеЕсли Объект.ВидВнешнегоМодуля = Перечисления.ВидыВнешнихМодулей.Таблица Тогда
			Расширение = "mxl";
		ИначеЕсли Объект.ВидВнешнегоМодуля = Перечисления.ВидыВнешнихМодулей.Текст Тогда
			Расширение = "txt";
		ИначеЕсли Объект.ВидВнешнегоМодуля = Перечисления.ВидыВнешнихМодулей.ДокументXML Тогда
			Расширение = "xml";
		Иначе
		КонецЕсли;
		
		//ИмяФайла=ПолучитьИмяВременногоФайла("epf");
		ИмяФайла=ПолучитьИмяВременногоФайла(Расширение);
		ОбработкаЕсть=ВыгрузитьВнешнююПечатнуюФорму(ИмяФайла,Объект);
	КонецЕсли;
		
	// если удалось получить обработку, то заполняем
	Если ОбработкаЕсть Тогда
		Ошибка = ""; ОшибкаПовтор = "";
		ВнешняяОбработка = Неопределено;
		Попытка 
			ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла,Ложь);
		Исключение
			Ошибка = ОписаниеОшибки();
			Попытка 
				ВнешняяОбработка = ВнешниеОтчеты.Создать(ИмяФайла,Ложь);
			Исключение
				ОшибкаПовтор = ОписаниеОшибки();
			КонецПопытки;
		КонецПопытки;
	КонецЕсли;
	
	Возврат ВнешняяОбработка
КонецФункции

// Выгрузка печатной формы в файл
Функция ВыгрузитьВнешнююПечатнуюФорму(ПутьКФорме=Неопределено,Объект) Экспорт 
	Если Не ПроверкаНаличияВнешнегоОтчета(,Объект) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПутьКФорме) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Не Объект.ХранитьВоВнешнемФайле Тогда
		ПечатнаяФорма=Объект.Хранилище.Получить();
		//Если ПечатнаяФорма=Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ПечатнаяФорма) Тогда
			Возврат Ложь;
		КонецЕсли;
		ПечатнаяФорма.Записать(ПутьКФорме);
		Возврат Истина;
	Иначе
		КопироватьФайл(Объект.ПутьКВнешнемуФайлу,ПутьКФорме);
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция ПроверкаНаличияВнешнегоОтчета(ПутьПроверки="",Объект) Экспорт
	Если Объект.ХранитьВоВнешнемФайле Тогда
		// проверим, а есть ли файл?
		ФайлМакета=Новый Файл(Объект.ПутьКВнешнемуФайлу);
		Возврат ЗначениеЗаполнено(?(ПутьПроверки="",Объект.ПутьКВнешнемуФайлу,ПутьПроверки)) И ФайлМакета.Существует();
	Иначе
		Возврат Не Объект.Хранилище.Получить()=Неопределено;
	КонецЕсли;
КонецФункции

Функция Сериализовать1(ОбъектСериализации)
	ДеревоВОбъектеXDTO = СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации);
	МойXML = Новый ЗаписьXML;
	МойXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(МойXML, ДеревоВОбъектеXDTO);
	Возврат МойXML.Закрыть();
КонецФункции


Функция ОписаниеТипаЧисло(Разрядность, РазрядностьДробнойЧасти = 0, ЗнакЧисла = Неопределено) Экспорт

	Если ЗнакЧисла = Неопределено Тогда
		КвалификаторЧисла = Новый КвалификаторыЧисла(Разрядность, РазрядностьДробнойЧасти);
	Иначе
		КвалификаторЧисла = Новый КвалификаторыЧисла(Разрядность, РазрядностьДробнойЧасти, ЗнакЧисла);
	КонецЕсли;

	Возврат Новый ОписаниеТипов("Число", КвалификаторЧисла);

КонецФункции


Функция ОписаниеТипаСтрока(ДлинаСтроки) Экспорт

	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));

	КвалификаторСтроки = Новый КвалификаторыСтроки(ДлинаСтроки, ДопустимаяДлина.Переменная);

	Возврат Новый ОписаниеТипов(Массив, , КвалификаторСтроки);

КонецФункции


Функция ВыполнитьЗагрузкуПоКлючуЕРП(КлючФункции, ПараметрыОперации)
	Ответ = Вычислить("ВыполнитьЗагрузку_" + КлючФункции + "(ПараметрыОперации)"); 
КонецФункции	


Функция ВыполнитьЗагрузку_Реализация(ПараметрыОперации) Экспорт
	
	ПараметрыОперации.ТаблицаРезультата.Очистить();
	ТаблицаДанных = ПараметрыОперации.ТаблицаДанных;
	
	Если ТаблицаДанных.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ТекстСообщения = "Получена таблица Реализация. Количество элементов " + ТаблицаДанных.Количество();
	ЗаписатьСлужебныеСообщенияВЖурналРегистрации(ТекстСообщения);
	
	СоздатьДокументы_Реализация(ТаблицаДанных, ПараметрыОперации);
	
	Возврат ПараметрыОперации.ТаблицаРезультата;
	
КонецФункции


Процедура СоздатьДокументы_Реализация(ТаблицаДанных, ПараметрыОперации) Экспорт
	
	ТаблицаРезультата = ПараметрыОперации.ТаблицаРезультата;
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка2
	|ИЗ
	|	Справочник.ИТ_НастройкиДописанногоФункционала.Таблица КАК ИТ_НастройкиДописанногоФункционалаТаблица
	|ГДЕ
	|	ИТ_НастройкиДописанногоФункционалаТаблица.Ссылка.Наименование = ""ОбработкаЗагрузкаДокументовИзСкладСГП""
	|	И ИТ_НастройкиДописанногоФункционалаТаблица.Колонка1 = ""НоменклатураКотораяНебудетГрузится"" ");
	НоменклатураКотораяНебудетГрузится = Запрос.Выполнить().Выгрузить();
	
			Докум = Неопределено;
	ТекНомерДок = "";
	текGUID_ЕРП = "";

		Для каждого стрТаблицаДанных ИЗ ТаблицаДанных Цикл
			
		НомерДок = СокрЛП(стрТаблицаДанных.НомерДок);
		ДатаДок = Дата(стрТаблицаДанных.ДатаДок);
		
		Если НЕ ТекНомерДок = НомерДок Тогда
			Если НЕ Докум = Неопределено Тогда
				УстановитьРекомендованнуюНаценку(Докум);
				Попытка
					Докум.Записать(РежимЗаписиДокумента.Проведение);
					
					СтрРезультата = ТаблицаРезультата.Добавить();
					СтрРезультата.ID                = стрТаблицаДанных.ID;
					СтрРезультата.Номер             = Докум.Номер;
					СтрРезультата.Сумма             = Докум.Товары.Итог("СуммаВсего");
					СтрРезультата.КоличествоПозиций = Докум.Товары.Количество();
				Исключение
					
					ПредставлениеОшибки = ИнформацияОбОшибке();
					
					ТекстСообщения = НСтр("ru = 'Не удалось записать поступление товаров № " + стрТаблицаДанных.НомерДок + " от " + стрТаблицаДанных.ДатаДок + " " + ПредставлениеОшибки,Метаданные.ОсновнойЯзык.КодЯзыка);
					ЗаписьЖурналаРегистрации("Проведение поступление товаров", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);	
					
					СтрРезультата = ТаблицаРезультата.Добавить();
					СтрРезультата.ID          = стрТаблицаДанных.ID;
					СтрРезультата.Ошибка      = Истина;
					СтрРезультата.ТекстОшибки = ПредставлениеОшибки;
					
				КонецПопытки;
			КонецЕсли;
			
			ЗапросВнутр = Новый Запрос("ВЫБРАТЬ
			|	ПоступлениеТоваров.Ссылка
			|ИЗ
			|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
			|ГДЕ
			|	ПоступлениеТоваров.ВхДокНомер = &Номер
			|	И ПоступлениеТоваров.Дата Между НачалоПериода(&ДатаДок,Год) и КонецПериода(&ДатаДок,Год)
			|	И НЕ ПоступлениеТоваров.ПометкаУдаления" );
			ЗапросВнутр.УстановитьПараметр("Номер",НомерДок);
			ЗапросВнутр.УстановитьПараметр("ДатаДок",ДатаДок);
			РезультатВнутр = ЗапросВнутр.Выполнить().Выбрать();
			Если РезультатВнутр.Следующий() тогда
				Докум = РезультатВнутр.ссылка.получитьОбъект();
				//Если Докум.СуммаДокумента = Результат.Сумма и ПравильныеЕдиницыИзмерения(Докум) тогда
				//	Продолжить;
				//КонецЕсли;
				//ТаблДатВыработки = Докум.товары.Выгрузить(,"Номенклатура,ИТ_ДатаВыработки,ИТ_ДатаВыработки2");
				Докум.товары.очистить();
			иначе
				Докум = документы.ПоступлениеТоваров.СоздатьДокумент();  
				Докум.УстановитьНовыйНомер();
			КонецЕсли;		
			Докум.ЗакрытиеЗаказовПоставщикам = 2;
			IDДокумента = СокрЛП(стрТаблицаДанных.ЗаказКлиентаIDВнешнейСистемы);
			ЗаказПоставщику = Документы.ЗаказПоставщику.ПустаяСсылка();
			Если НЕ IDДокумента = "" ТОгда
				НовыйGUID = Новый УникальныйИдентификатор(IDДокумента);
				ЗаказПоставщику=Документы.ЗаказПоставщику.ПолучитьСсылку(НовыйGUID);			
			КонецЕсли;			
			
			Если ЗаказПоставщику.Пустая() Тогда
				НомерЗаказаEDI = СокрЛП(стрТаблицаДанных.рздНомерЗаказаEDI);
				Если НЕ НомерЗаказаEDI = "" ТОгда
					 ЗаказПоставщику = Документы.ЗаказПоставщику.НайтиПоНомеру(НомерЗаказаEDI,ДатаДок);
				КонецЕсли;
			КонецЕсли;
			
			Если ЗаказПоставщику.Пустая() Тогда
				
				СтрРезультата = ТаблицаРезультата.Добавить();
				СтрРезультата.ID          = стрТаблицаДанных.ID;
				СтрРезультата.Ошибка      = Истина;
				СтрРезультата.ТекстОшибки = "Нет заказа для поставки";
				Продолжить;
			КонецЕсли;
			//////////////////////Загрузка заполнение
			Докум.Дата = ДатаДок+3600;
			//		Найден = ТаблицаСкладов.Найти(Результат.КонтрагентCODE,"Колонка1");    		
			Докум.СкладКомпании = ЗаказПоставщику.СкладКомпании;	
			
			Если НЕ ЗначениеЗаполнено(Докум.СкладКомпании) Тогда
			Докум.СкладКомпании = Справочники.СкладыКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч","000004188").Ссылка;	
			КонецЕсли;
			
			Докум.ПодразделениеКомпании = Докум.СкладКомпании.Подразделение;
			Докум.ДокументОснование = ЗаказПоставщику;
			//ПОМ:
			//Докум.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ЕРПМастерКлюч","00000000018");
			//МПЗ:
			КонтрагентЕРПМастерКлюч = СокрЛП(стрТаблицаДанных.КонтрагентЕРПМастерКлюч);
			Докум.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ЕРПМастерКлюч",КонтрагентЕРПМастерКлюч).Ссылка;
			
			//Докум.ХозОперация = Справочники.ХозОперации.
			Докум.РегламентированныйУчет = Истина;
			Докум.НеУстанавливатьРозничныеЦены = Истина;
			Докум.Организация = Докум.СкладКомпании.Организация;
			
			//++Стало Чеснаков 03.05.2017
			ЗапросВнутр = Новый Запрос;
			ЗапросВнутр.Текст = 
			"ВЫБРАТЬ
			|	ДоговорыВзаиморасчетов.Ссылка,
			|	ВЫБОР
			|		КОГДА ДоговорыВзаиморасчетов.ЕРПМастерКлюч = ""00000062527""
			|			ТОГДА 1
			|		ИНАЧЕ 2
			|	КОНЕЦ КАК Порядок
			|ИЗ
			|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
			|ГДЕ
			|	ДоговорыВзаиморасчетов.Владелец = &Владелец
			|	И ДоговорыВзаиморасчетов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.Покупка)
			|	И ДоговорыВзаиморасчетов.Организация = &Организация
			|	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Порядок,
			|	ДоговорыВзаиморасчетов.ДатаКонца";
			
			ЗапросВнутр.УстановитьПараметр("Владелец", Докум.Контрагент);
			ЗапросВнутр.УстановитьПараметр("Организация", Докум.Организация);
			
			РезультатВнутр = ЗапросВнутр.Выполнить();
			Если НЕ РезультатВнутр.Пустой() тогда
				Докум.ДоговорВзаиморасчетов = РезультатВнутр.Выгрузить()[0].Ссылка;
			конецЕсли;
			//-- Чеснаков 03.05.2017	
			
			Докум.Автор = Справочники.Пользователи.НайтиПоКоду("Робот");
			Докум.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643");
			Докум.ВхДокНомер = НомерДок;
			Докум.ВхДокДата = ДатаДок;
			Докум.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров;
			Докум.КурсДокумента = 1;
			Докум.ТипЦен = Докум.СкладКомпании.ТипЦенСебестоимости;  			
			
			ТекНомерДок = НомерДок;
			Докум.Комментарий = "Загружен из ЕРП - Реализация № " + Докум.ВхДокНомер + " от " + Докум.ВхДокДата;
			
		КонецЕсли;	
		
		
		НоменклатураМастерКлюч = СокрЛП(стрТаблицаДанных.НоменклатураЕРПМастерКлюч);
		
		Номенклаутра = Справочники.Номенклатура.НайтиПоРеквизиту("ЕРПМастерКлюч",НоменклатураМастерКлюч);
		Количество = стрТаблицаДанных.Количество;
		Цена = стрТаблицаДанных.Цена;
		Сумма = стрТаблицаДанных.Сумма;
		СуммаНДС = стрТаблицаДанных.СуммаНДС;
		СуммаСНДС = стрТаблицаДанных.СуммаСНДС;
		
		//	Артикул = Формат(РезультатТаблица.Артикул,"ЧГ=0;ЧВН=");
		Новстр = Докум.товары.добавить();
		//Новстр.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
		Новстр.Номенклатура = Номенклаутра;
		Если НЕ НоменклатураКотораяНебудетГрузится.Найти(Новстр.Номенклатура,"Колонка2") = Неопределено тогда
			Докум.товары.Удалить(Новстр);
			Продолжить;
		КонецЕсли;
		
		//Новстр.КоличествоМест
		Новстр.ЕдиницаИзмерения = Новстр.Номенклатура.ОсновнаяЕдиницаИзмерения;
		Новстр.Коэффициент = 1 ;
		Новстр.Количество = Количество;
		Новстр.КоличествоБазовое = Новстр.Количество;
		Новстр.Сумма = Сумма;
		
		Новстр.СуммаВсего = СуммаСНДС;    
		Новстр.СтавкаНДС = Новстр.Номенклатура.СтавкаНДС;
		
		
		Новстр.СуммаНДС = СуммаНДС;
		Новстр.СуммаБезНалогов = Новстр.СуммаВсего-Новстр.СуммаНДС;
		
		Новстр.Цена = Цена; 
		Новстр.ЦенаБезНалогов = ?(Новстр.Количество=0,0,Новстр.СуммаБезНалогов/Новстр.Количество);
			
			
			
	КонецЦикла;
	
	Если НЕ Докум = Неопределено Тогда
		Попытка
			УстановитьРекомендованнуюНаценку(Докум);
			Докум.Записать(РежимЗаписиДокумента.Проведение);
			
			СтрРезультата = ТаблицаРезультата.Добавить();
			СтрРезультата.ID                = стрТаблицаДанных.ID;
			СтрРезультата.Номер             = Докум.Номер;
			СтрРезультата.Сумма             = Докум.Товары.Итог("СуммаВсего");
			СтрРезультата.КоличествоПозиций = Докум.Товары.Количество();
		Исключение
			
			ПредставлениеОшибки = ИнформацияОбОшибке();
			
			ТекстСообщения = НСтр("ru = 'Не удалось записать поступление товаров № " + стрТаблицаДанных.НомерДок + " от " + стрТаблицаДанных.ДатаДок + " " + ПредставлениеОшибки,Метаданные.ОсновнойЯзык.КодЯзыка);
			ЗаписьЖурналаРегистрации("Проведение поступление товаров", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);	
			
			СтрРезультата = ТаблицаРезультата.Добавить();
			СтрРезультата.ID          = стрТаблицаДанных.ID;
			СтрРезультата.Ошибка      = Истина;
			СтрРезультата.ТекстОшибки = ПредставлениеОшибки;
			
		КонецПопытки;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура УстановитьРекомендованнуюНаценку(Докум)
	ТипЦенЦенообразования = Докум.СкладКомпании.ТипЦенРозничнойТорговли;
	//Ценообразование = Обработки.Ценообразование.Создать();  
	Для Каждого СтрокаТовар Из Докум.Товары Цикл
		//ОбработкаПрерыванияПользователя();
		//СтуктураНаценок=Ценообразование.ПолучитьНаценкуОграничение(ТипЦен,СтрокаТовар.Номенклатура);
		//СтуктураНаценок = Ценообразование.ПолучитьНаценкуОграничение(ТипЦенЦенообразования,СтрокаТовар.Номенклатура);
		СтуктураНаценок = ЦенообразованиеВызовСервера.ПолучитьНаценкуОграничение(Докум.Дата, ТипЦенЦенообразования, СтрокаТовар.Номенклатура);
		Если ТипЗнч(СтуктураНаценок)=Тип("Структура") И СтуктураНаценок.Количество()>0 Тогда
			СтрокаТовар.ПроцентНаценки=СтуктураНаценок.ПроцентНаценки;
			Докум.ОбработкаРеквизита("Товары.ПроцентНаценки",СтрокаТовар,Докум);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


Функция ЗаписатьСлужебныеСообщенияВЖурналРегистрации(ТекстСообщения)
	
	НаименованиеЗадания = НСтр("ru = 'Регламентное задание: ""РЗД: Обмен с 1С.ЕРП""'", 
				Метаданные.ОсновнойЯзык.КодЯзыка);
				
	ЗаписьЖурналаРегистрации(НаименованиеЗадания, УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);	
	
	
КонецФункции

Процедура рздВыполнитьЗагрузкуИЗЕРП() Экспорт
	//спрВнОбработки = Справочники.ВнешниеПечатныеФормы.НайтиПоНаименованию("ОбменДаннымиСЕРП");
	ИмяВременногоФайла = "\\gn.work.local\F\ТехнологияТорговли\ОбменСЕРП_ФММР_Авиаторов(ТК3).epf";

	//спрВнОбработкиОбъект = спрВнОбработки.ПолучитьОбъект();
	спрВнОбработкиОбъект = Новый Структура;
	спрВнОбработкиОбъект.Вставить("ХранитьВоВнешнемФайле",Истина);
	спрВнОбработкиОбъект.Вставить("ПутьКВнешнемуФайлу",ИмяВременногоФайла);
	
	ВнешняяОбработка = ПолучитьВнешнююОбработку(спрВнОбработкиОбъект);	
	ВнешняяОбработка.ОбновтиьТоварыКонтрагентов();
	ВнешняяОбработка.ОбновтиьПараметрыНоменклатуры();	
КонецПроцедуры
