#Область ПрограммныйИнтерфейс

// Процедура, вызываемая из одноименного обработчика события формы узла плана обмена "Обмен с сайтом".
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, из обработчика события которой происходит вызов процедуры.
//  Отказ - Булево - признак отказа от выполнения действия.
//
Процедура ФормаУзлаПриОткрытии(Форма, Отказ) Экспорт
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы узла плана обмена "Обмен с сайтом".
//
// Параметры:
//  Форма - УправляемаяФорма - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ - Булево - признак отказа от выполнения действия.
//  ПараметрыЗаписи - Структура - параметры записи. 
//
Процедура ФормаУзлаПередЗаписью(Форма, Отказ, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Процедура меняет тип значения колонки "Группы" таблицы каталога товаров.
//
// Параметры:
//  ТипЗначений - Тип - новый тип значения.
//  Форма - Форма - форма.
//
Процедура ОпределитьТипГруппТаблицыКаталога(ТипЗначений, Форма) Экспорт
	
КонецПроцедуры

#КонецОбласти
