// Модуль менеджера документа "Товарно-транспортная накладная ЕГАИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	ИтогиОперации.Вставить("СуммаДокумента", Объект.Товары.Итог("Сумма"));
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

Функция ТоварноТранспортнаяНакладнаяXML(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ХозОперация,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Грузоотправитель КАК ОрганизацияЕГАИС,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ФорматОбмена КАК ФорматОбмена,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Грузоотправитель.Код КАК ИдентификаторФСРАР,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Идентификатор КАК Идентификатор,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.НомерТТН КАК Номер,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ДатаТТН КАК Дата,
	|	ВЫРАЗИТЬ(ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Комментарий КАК Строка(500)) КАК Комментарий,
	|	ВЫБОР
	|		КОГДА ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ТТНВозвратТоваровПоставщикуЕГАИС) ТОГДА
	|			""WBReturnFromMe""
	|		ИНАЧЕ
	|			""WBInvoiceFromMe""
	|	КОНЕЦ КАК ТипТТН,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Грузополучатель КАК Грузополучатель,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Основание КАК Основание,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ТипДоставки КАК ТипДоставки,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Перевозчик КАК Перевозчик,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Автомобиль КАК Автомобиль,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Прицеп КАК Прицеп,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Заказчик КАК Заказчик,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Водитель КАК Водитель,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ПунктПогрузки КАК ПунктПогрузки,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ПунктРазгрузки КАК ПунктРазгрузки,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Перенаправление КАК Перенаправление,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Экспедитор КАК Экспедитор,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ДополнительноеПримечание КАК ДополнительноеПримечание,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ДополнительноеПримечание2 КАК ДополнительноеПримечание2,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ДополнительноеПримечание3 КАК ДополнительноеПримечание3,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ИзменениеПраваСобственности КАК ИзменениеПраваСобственности,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ТранспортноеСредство.ТипТС КАК ТипТС,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ТранспортноеСредство.НомерТС КАК НомерТС,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Товары.(
	|		АлкогольнаяПродукция,
	|		ИдентификаторУпаковки,
	|		Количество,
	|		Цена,
	|		ИдентификаторСтроки,
	|		ВЫБОР
	|			КОГДА НЕ Справка1 = ЗНАЧЕНИЕ(Справочник.Справки1ЕГАИС.ПустаяСсылка) ТОГДА
	|				Справка1.Номер
	|			КОГДА Справка2.Справка1.Номер ЕСТЬ NULL ТОГДА
	|				Справка2.НомерСправки1
	|			ИНАЧЕ
	|				Справка2.Справка1.Номер
	|		КОНЕЦ КАК НомерСправки1,
	|		Справка2.Номер КАК НомерСправки2,
	|		НомерИзвещения,
	|		ДатаИзвещения,
	|		СуммаПоИзвещению,
	|		ОбъемПоИзвещению
	|	) КАК Товары,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Упаковки.(
	|		УровеньВложенности
	|	) КАК Упаковки
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС КАК ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Ссылка = &Ссылка И 
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ПометкаУдаления = ЛОЖЬ
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		
		ПараметрыЗапроса = ПараметрыОбъектов[Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия3];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	//Если Выборка.ФорматОбмена = 4 И Выборка.ФорматОбменаГрузополучатель = 4 Тогда
	ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия4;
	ФорматОбмена = 4;
	//Иначе
	//	ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия3;
	//	ФорматОбмена = 3;
	//КонецЕсли;
	
	Товары = Выборка.Товары.Выгрузить();
	Если Товары.Количество() = 0 Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		ПараметрыЗапроса  = ПараметрыОбъектов[ВидСообщения];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	УровеньУпаковок = 0;
	ВыборкаУпаковок = Выборка.Упаковки.Выбрать();
	Пока ВыборкаУпаковок.Следующий() Цикл
		УровеньУпаковок = Макс(УровеньУпаковок, ВыборкаУпаковок.УровеньВложенности);
	КонецЦикла;
	
	УровеньУпаковок = УровеньУпаковок + 1;
	
	ТекстСоединений = "";
	ТекстВыборки = "";
	ТекстГруппировки = ?(УровеньУпаковок = 1, "",",
	|	УпаковкаУровень1");
	Для Ном = 2 По УровеньУпаковок Цикл
		
		СтрУровень = Формат(Ном, "ЧГ=");
		
		ТекстВыборки = ТекстВыборки + ",
		|	УпаковкиМарокУровень"+СтрУровень+".МаркировкаГруппыУпаковок КАК УпаковкаУровень"+СтрУровень;
		
		Если Не Ном = УровеньУпаковок Тогда
			ТекстГруппировки = ТекстГруппировки + ",
			|	УпаковкаУровень"+СтрУровень;
		КонецЕсли;
		
		ТекстСоединений = ТекстСоединений + "
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ТаблицаУпаковок КАК УпаковкиМарокУровень"+СтрУровень+"
		|ПО
		|	УпаковкиМарок.ИдентификаторСтроки = УпаковкиМарокУровень"+СтрУровень+".ИдентификаторСтроки И 
		|	УпаковкиМарок.МаркировкаУпаковки = УпаковкиМарокУровень"+СтрУровень+".МаркировкаУпаковки И 
		|	УпаковкиМарокУровень"+СтрУровень+".УровеньВложенности = "+СтрУровень;
		
	КонецЦикла;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Марки.ИдентификаторСтроки,
	|	Марки.КодМарки,
	|	Марки.МаркировкаУпаковки
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Марки КАК Марки
	|ГДЕ
	|	Марки.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	ИдентификаторСтроки,
	|	МаркировкаУпаковки
	|";
	
	ДеревоМарок = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	УпаковкиМарок.ИдентификаторСтроки,
	|	УпаковкиМарок.МаркировкаУпаковки,
	|	УпаковкиМарок.МаркировкаГруппыУпаковок,
	|	УпаковкиМарок.УровеньВложенности
	|ПОМЕСТИТЬ
	|	УпаковкиМарок
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Упаковки КАК УпаковкиМарок
	|ГДЕ
	|	УпаковкиМарок.Ссылка = &Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	Марки.ИдентификаторСтроки,
	|	Марки.МаркировкаУпаковки,
	|	Марки.МаркировкаУпаковки КАК МаркировкаГруппыУпаковок,
	|	МАКСИМУМ(ЕСТЬNULL(УпаковкиМарок.УровеньВложенности+1, 1)) КАК УровеньВложенности
	|ПОМЕСТИТЬ
	|	ТаблицаУпаковок
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Марки КАК Марки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	УпаковкиМарок КАК УпаковкиМарок
	|ПО
	|	УпаковкиМарок.ИдентификаторСтроки = Марки.ИдентификаторСтроки И 
	|	УпаковкиМарок.МаркировкаУпаковки = Марки.МаркировкаУпаковки
	|ГДЕ
	|	Марки.Ссылка = &Ссылка И 
	|	(НЕ Марки.МаркировкаУпаковки = """")
	|СГРУППИРОВАТЬ ПО
	|	Марки.ИдентификаторСтроки,
	|	Марки.МаркировкаУпаковки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УпаковкиМарок.ИдентификаторСтроки,
	|	УпаковкиМарок.МаркировкаУпаковки,
	|	УпаковкиМарок.МаркировкаГруппыУпаковок,
	|	УпаковкиМарок.УровеньВложенности
	|ИЗ
	|	УпаковкиМарок КАК УпаковкиМарок
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УпаковкиМарок.ИдентификаторСтроки,
	|	УпаковкиМарок.МаркировкаГруппыУпаковок КАК УпаковкаУровень1" + ТекстВыборки + "
	|ИЗ
	|	ТаблицаУпаковок КАК УпаковкиМарок"+ТекстСоединений+"
	|ГДЕ
	|	УпаковкиМарок.УровеньВложенности = 1
	|ИТОГИ ПО
	|	УпаковкиМарок.ИдентификаторСтроки"+ТекстГруппировки+"
	|";
	
	ДеревоУпаковок = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ИдентификаторФСРАР", Выборка.ИдентификаторФСРАР);
	ДанныеДляВыгрузки.Вставить("Объект",             ДокументСсылка);
	ДанныеДляВыгрузки.Вставить("ШапкаДокумента",     Выборка);
	ДанныеДляВыгрузки.Вставить("ТаблицаТоваров",     Товары);
	ДанныеДляВыгрузки.Вставить("ДеревоМарок",        ДеревоМарок);
	ДанныеДляВыгрузки.Вставить("ДеревоУпаковок",     ДеревоУпаковок);
	
	СообщенияXML = ИнтеграцияЕГАИС.СформироватьСообщенияXML(ВидСообщения, ДанныеДляВыгрузки, ФорматОбмена);
	
	Возврат СообщенияXML;
	
КонецФункции

Функция АктОтказаXML(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ХозОперация,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Грузоотправитель КАК ОрганизацияЕГАИС,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ФорматОбмена КАК ФорматОбмена,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Грузоотправитель.Код КАК ИдентификаторФСРАР,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Идентификатор КАК Идентификатор,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Номер,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Дата,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Дата КАК ДатаВходящая,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.РегистрационныйНомер,
	|	ВЫРАЗИТЬ(ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Комментарий КАК Строка(500)) КАК Комментарий
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС КАК ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Ссылка = &Ссылка И 
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ПометкаУдаления = ЛОЖЬ
	|";
	
	ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		
		ПараметрыЗапроса = ПараметрыОбъектов[ВидСообщения];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	Если Выборка.ФорматОбмена = 4 Тогда
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4;
		ФорматОбмена = 4;
	Иначе
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН;
		ФорматОбмена = 3;
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ИдентификаторФСРАР", Выборка.ИдентификаторФСРАР);
	ДанныеДляВыгрузки.Вставить("Объект",             ДокументСсылка);
	ДанныеДляВыгрузки.Вставить("ШапкаДокумента",     Выборка);
	
	СообщенияXML = ИнтеграцияЕГАИС.СформироватьСообщенияXML(ВидСообщения, ДанныеДляВыгрузки, ФорматОбмена);
	
	Возврат СообщенияXML;
	
КонецФункции

Функция КвитанцияПодтвержденияАктаРасхожденийXML(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ХозОперация,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Грузоотправитель КАК ОрганизацияЕГАИС,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Грузоотправитель.Код КАК ИдентификаторФСРАР,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Идентификатор КАК Идентификатор,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Номер,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Дата,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.РегистрационныйНомер,
	|	ВЫРАЗИТЬ(ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Комментарий КАК Строка(500)) КАК Комментарий,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Дата КАК ДатаВходящая
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС КАК ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Ссылка = &Ссылка И 
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ПометкаУдаления = ЛОЖЬ
	|";
	
	ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияАктаРасхожденийПодтверждение;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		
		ПараметрыЗапроса = ПараметрыОбъектов[ВидСообщения];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ИдентификаторФСРАР", Выборка.ИдентификаторФСРАР);
	ДанныеДляВыгрузки.Вставить("Объект",             ДокументСсылка);
	ДанныеДляВыгрузки.Вставить("ШапкаДокумента",     Выборка);
	
	СообщенияXML = ИнтеграцияЕГАИС.СформироватьСообщенияXML(ВидСообщения, ДанныеДляВыгрузки, 3);
	
	Возврат СообщенияXML;
	
КонецФункции

Функция КвитанцияОтказаОтАктаРасхожденийXML(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ХозОперация,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Грузоотправитель КАК ОрганизацияЕГАИС,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Грузоотправитель.Код КАК ИдентификаторФСРАР,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Идентификатор КАК Идентификатор,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Номер,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Дата,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.РегистрационныйНомер,
	|	ВЫРАЗИТЬ(ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Комментарий КАК Строка(500)) КАК Комментарий,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Дата КАК ДатаВходящая
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС КАК ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Ссылка = &Ссылка И 
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ПометкаУдаления = ЛОЖЬ
	|";
	
	ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияАктаРасхожденийОтказ;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		
		ПараметрыЗапроса = ПараметрыОбъектов[ВидСообщения];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ИдентификаторФСРАР", Выборка.ИдентификаторФСРАР);
	ДанныеДляВыгрузки.Вставить("Объект",             ДокументСсылка);
	ДанныеДляВыгрузки.Вставить("ШапкаДокумента",     Выборка);
	
	СообщенияXML = ИнтеграцияЕГАИС.СформироватьСообщенияXML(ВидСообщения, ДанныеДляВыгрузки, 3);
	
	Возврат СообщенияXML;
	
КонецФункции

Функция КвитанцияПодтверждениеЗапросаНаОтменуПроведенияXML(ДокументСсылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ХозОперация,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Грузоотправитель КАК ОрганизацияЕГАИС,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Грузоотправитель.Код КАК ИдентификаторФСРАР,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Идентификатор КАК Идентификатор,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Номер,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Дата,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.РегистрационныйНомер,
	|	ВЫРАЗИТЬ(ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Комментарий КАК Строка(500)) КАК Комментарий
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС КАК ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Ссылка = &Ссылка И 
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ПометкаУдаления = ЛОЖЬ
	|";
	
	ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ПодтверждениеОтменыПроведенияТТН;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		
		ПараметрыЗапроса = ПараметрыОбъектов[ВидСообщения];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ИдентификаторФСРАР", Выборка.ИдентификаторФСРАР);
	ДанныеДляВыгрузки.Вставить("Объект",             ДокументСсылка);
	ДанныеДляВыгрузки.Вставить("ШапкаДокумента",     Выборка);
	
	СообщенияXML = ИнтеграцияЕГАИС.СформироватьСообщенияXML(ВидСообщения, ДанныеДляВыгрузки, 3);
	
	Возврат СообщенияXML;
	
КонецФункции

Функция КвитанцияОтказаОтЗапросаНаОтменуПроведенияXML(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ХозОперация,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Грузоотправитель КАК ОрганизацияЕГАИС,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Грузоотправитель.Код КАК ИдентификаторФСРАР,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Идентификатор КАК Идентификатор,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Номер,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Дата,
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.РегистрационныйНомер,
	|	ВЫРАЗИТЬ(ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Комментарий КАК Строка(500)) КАК Комментарий
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС КАК ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Ссылка = &Ссылка И 
	|	ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ПометкаУдаления = ЛОЖЬ
	|";
	
	ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ОтказОтменыПроведенияТТН;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		
		ПараметрыЗапроса = ПараметрыОбъектов[ВидСообщения];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ИдентификаторФСРАР", Выборка.ИдентификаторФСРАР);
	ДанныеДляВыгрузки.Вставить("Объект",             ДокументСсылка);
	ДанныеДляВыгрузки.Вставить("ШапкаДокумента",     Выборка);
	
	СообщенияXML = ИнтеграцияЕГАИС.СформироватьСообщенияXML(ВидСообщения, ДанныеДляВыгрузки, 3);
	
	Возврат СообщенияXML;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("НомерТТН");
	ОбязательныеРеквизиты.Добавить("ДатаТТН");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	//ОбязательныеРеквизиты.Добавить("РегистрационныйНомер");
	ОбязательныеРеквизиты.Добавить("ДатаОтгрузки");
	ОбязательныеРеквизиты.Добавить("Грузоотправитель");
	ОбязательныеРеквизиты.Добавить("Грузополучатель");
	
	Если НЕ ПравоПользователя("ПроведениеНезаполненныхДокументов", Объект) Тогда
		ОбязательныеРеквизиты.Добавить("Товары");
	КонецЕсли;
	
	//Если Объект.Грузоотправитель.ФорматОбмена = 4 И Объект.Грузополучатель.ФорматОбмена = 4 Тогда
	//	ОбязательныеРеквизиты.Добавить("ТранспортноеСредство");
	//КонецЕсли;
	
	ОбязательныеРеквизиты.Добавить("Товары.АлкогольнаяПродукция");
	//ОбязательныеРеквизиты.Добавить("Товары.Справка1");
	ОбязательныеРеквизиты.Добавить("Товары.Справка2");
	ОбязательныеРеквизиты.Добавить("Товары.Количество");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Уникальные поля таблицы товаров
	УникальныеТовары=Новый Массив();
	УникальныеТовары.Добавить("ИдентификаторСтроки");
	
	// Структура уникальных реквизитов табличных частей
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Товары", УникальныеТовары);
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПараметрыДействия=Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен",   Объект.Товары.Количество() > 0);
	ПараметрыДействия.Вставить("НетНоменклатуры",  Истина);
	ПараметрыДействия.Вставить("ОрганизацияЕГАИС", Объект.Грузоотправитель);
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДокументОснованиеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Прописать проверку соответствия реквизитов объекта выбранной хоз.операции
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Грузоотправитель".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ГрузоотправительПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ткОбработкаТабличнойЧастиТовары.ЗаполнитьРеквизитОстатокАлкоПродукции(Объект, Неопределено, "Товары", ПараметрыДействия);
	
	ФорматОбмена = Справочники.КлассификаторОрганизацийЕГАИС.ФорматОбмена(Объект.Грузоотправитель);
	ФорматОбменаГрузополучатель = Справочники.КлассификаторОрганизацийЕГАИС.ФорматОбмена(Объект.Грузополучатель);
	Если ФорматОбмена = 4 И ФорматОбменаГрузополучатель = 4 Тогда
		Объект.ФорматОбмена = 4;
	Иначе
		Объект.ФорматОбмена = 3;
	КонецЕсли;
	
КонецПроцедуры // ГрузоотправительПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Грузоотправитель".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ГрузополучательПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ткОбработкаТабличнойЧастиТовары.ЗаполнитьРеквизитОстатокАлкоПродукции(Объект, Неопределено, "Товары", ПараметрыДействия);
	
	ФорматОбмена = Справочники.КлассификаторОрганизацийЕГАИС.ФорматОбмена(Объект.Грузоотправитель);
	ФорматОбменаГрузополучатель = Справочники.КлассификаторОрганизацийЕГАИС.ФорматОбмена(Объект.Грузополучатель);
	Если ФорматОбмена = 4 И ФорматОбменаГрузополучатель = 4 Тогда
		Объект.ФорматОбмена = 4;
	Иначе
		Объект.ФорматОбмена = 3;
	КонецЕсли;
	
КонецПроцедуры // ГрузоотправительПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Алкогольная продукция" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыАлкогольнаяПродукцияПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ОбработкаТабличнойЧастиТовары.АлкогольнаяПродукцияПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыАлкогольнаяПродукцияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Справка 2" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСправка2ПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ОбработкаТабличнойЧастиТовары.Справка2ПриИзменении(Объект, Строка, ПараметрыДействия);
	
	Справка1 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Справка2, "Справка1");
	Если ЗначениеЗаполнено(Справка1) Тогда
		Строка.Справка1 = Справка1;
	КонецЕсли;
	
КонецПроцедуры // ТоварыСправка2ПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Справка 2" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСправка1ПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если НЕ ЗначениеЗаполнено(Строка.Справка2) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Строка.Справка1) Тогда
		Возврат;
	КонецЕсли;
	
	Справка1 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Справка2, "Справка1");
	Если ЗначениеЗаполнено(Справка1) И (НЕ Справка1 = Строка.Справка1) Тогда
		Строка.Справка2 = Справочники.Справки2ЕГАИС.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры // ТоварыСправка2ПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыКоличествоПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Строка.Сумма = Строка.Цена * Строка.Количество;
	
КонецПроцедуры // ТоварыКоличествоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыЦенаПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Строка.Сумма = Строка.Цена * Строка.Количество;
	
КонецПроцедуры // ТоварыЦенаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСуммаПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если Строка.Количество = 0 Тогда
		Строка.Цена = Строка.Сумма;
		Строка.Сумма = 0;
	Иначе
		Строка.Цена = Окр(Строка.Сумма/Строка.Количество, 2);
	КонецЕсли;

КонецПроцедуры // ТоварыСуммаПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОВЕДЕНИЕ 

Функция ТекстЗапросаОстаткиАлкогольнойПродукцииЕГАИС(ТекстыЗапроса)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&ДатаРегистрации                   КАК Период,
	|	ТаблицаТовары.Ссылка               КАК Регистратор,
	|	&ОрганизацияЕГАИС                  КАК ОрганизацияЕГАИС,
	|	&ХозОперация                       КАК ХозОперация,
	|	ТаблицаТовары.НомерСтроки          КАК НомерСтроки,
	|	ТаблицаТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ТаблицаТовары.Справка2             КАК Справка2,
	|	ТаблицаТовары.Количество           КАК Количество
	//|	ВЫБОР
	//|		КОГДА ТаблицаТовары.АлкогольнаяПродукция.Упакована ТОГДА
	//|			ТаблицаТовары.Количество
	//|		ИНАЧЕ
	//|			ТаблицаТовары.Количество*10
	//|	КОНЕЦ					           КАК Количество
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка И 
	|	&ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.ВидыСтатусовОбработкиЕГАИС.Подтвержден)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&ДатаРегистрации                   КАК Период,
	|	ТаблицаТовары.Ссылка               КАК Регистратор,
	|	&ОрганизацияЕГАИС                  КАК ОрганизацияЕГАИС,
	|	&ХозОперация                       КАК ХозОперация,
	|	ТаблицаТовары.НомерСтроки          КАК НомерСтроки,
	|	ТаблицаТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ТаблицаТовары.Справка2             КАК Справка2,
	|	ТаблицаТовары.КоличествоФакт       КАК Количество
	//|	ВЫБОР
	//|		КОГДА ТаблицаТовары.АлкогольнаяПродукция.Упакована ТОГДА
	//|			ТаблицаТовары.КоличествоФакт
	//|		ИНАЧЕ
	//|			ТаблицаТовары.КоличествоФакт*10
	//|	КОНЕЦ					           КАК Количество
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка И 
	|	&ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.ВидыСтатусовОбработкиЕГАИС.ПодтвержденСРасхождениями)
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаТовары.НомерСтроки";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, "ОстаткиАлкогольнойПродукцииЕГАИС");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОстаткиМарокЕГАИС(ТекстыЗапроса)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&ДатаРегистрации                       КАК Период,
	|	ТаблицаМарки.Ссылка                    КАК Регистратор,
	|	&ОрганизацияЕГАИС                      КАК ОрганизацияЕГАИС,
	|	&ХозОперация                           КАК ХозОперация,
	|	ТаблицаМарки.НомерСтроки               КАК НомерСтроки,
	|	ТаблицаМарки.КодМарки                  КАК КодМарки,
	|	ТаблицаТовары.Справка2                 КАК Справка2,
	|	1                                      КАК Количество
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Марки КАК ТаблицаМарки
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Товары КАК ТаблицаТовары
	|ПО
	|	ТаблицаМарки.Ссылка = ТаблицаТовары.Ссылка И 
	|	ТаблицаМарки.ИдентификаторСтроки = ТаблицаТовары.ИдентификаторСтроки И 
	|	(НЕ ТаблицаМарки.КодМарки = """")
	|ГДЕ
	|	ТаблицаМарки.Ссылка = &Ссылка И 
	|	&ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.ВидыСтатусовОбработкиЕГАИС.Подтвержден)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&ДатаРегистрации                       КАК Период,
	|	ТаблицаМарки.Ссылка                    КАК Регистратор,
	|	&ОрганизацияЕГАИС                      КАК ОрганизацияЕГАИС,
	|	&ХозОперация                           КАК ХозОперация,
	|	ТаблицаМарки.НомерСтроки               КАК НомерСтроки,
	|	ТаблицаМарки.КодМарки                  КАК КодМарки,
	|	ТаблицаТовары.Справка2                 КАК Справка2,
	|	1                                      КАК Количество
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Марки КАК ТаблицаМарки
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.Товары КАК ТаблицаТовары
	|ПО
	|	ТаблицаМарки.Ссылка = ТаблицаТовары.Ссылка И 
	|	ТаблицаМарки.ИдентификаторСтроки = ТаблицаТовары.ИдентификаторСтроки И 
	|	(НЕ ТаблицаМарки.КодМарки = """")
	|ГДЕ
	|	ТаблицаМарки.Ссылка = &Ссылка И 
	|	&ВидСтатуса = ЗНАЧЕНИЕ(Перечисление.ВидыСтатусовОбработкиЕГАИС.ПодтвержденСРасхождениями) И 
	|	ТаблицаМарки.Отвергнута = ЛОЖЬ
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаМарки.НомерСтроки
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, "ОстаткиМарокЕГАИС");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаОстаткиАлкогольнойПродукцииЕГАИС(ТекстыЗапроса);
	ТекстЗапросаОстаткиМарокЕГАИС(ТекстыЗапроса);
	
	ИнтеграцияЕГАИС.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеШапки.Дата                  КАК Период,
	|	ДанныеШапки.Ссылка                КАК Ссылка,
	|	ДанныеШапки.Грузоотправитель      КАК ОрганизацияЕГАИС,
	|	ДанныеШапки.ДатаРегистрации       КАК ДатаРегистрации,
	|	ДанныеШапки.ХозОперация           КАК ХозОперация,
	|	СтатусыДокументовЕГАИС.ВидСтатуса КАК ВидСтатуса
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС КАК ДанныеШапки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|ПО
	|	СтатусыДокументовЕГАИС.Документ = ДанныеШапки.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",               Реквизиты.Период);
	Запрос.УстановитьПараметр("Ссылка",               Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("ВидСтатуса",           Реквизиты.ВидСтатуса);
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС",     Реквизиты.ОрганизацияЕГАИС);
	Запрос.УстановитьПараметр("ДатаРегистрации",      Реквизиты.ДатаРегистрации);
	Запрос.УстановитьПараметр("ХозОперация",          Реквизиты.ХозОперация);
	Запрос.УстановитьПараметр("ВидыСтатусовДвижений", ВидыСтатусовДвижений());
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Раздел "Б" справки к ТТН
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "ИнтеграцияЕГАИСКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьРазделаБСправкиТТН";
	КомандаПечати.Идентификатор = "ТТНСправкаРазделБ";
	КомандаПечати.Представление = НСтр("ru = 'Раздел ""Б"" справки к ТТН'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью команд заполнения объекта
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть не доступны в зависимости от параметров объекта
	ДоступностьКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ДоступностьКоманд;
	
КонецФункции // ПолучитьДоступностьКомандЗаполнения()

#Область ДействияПриОбменеЕГАИС

// Статус после подготовки к передаче данных.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Ссылка на документ.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - ВидСообщения ЕГАИС.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения) Экспорт
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТТН
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия2
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия3
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия4 Тогда
		ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.КПередаче;
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияАктаРасхождений Тогда
		ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийПодтверждениеКПередаче;
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияАктаРасхожденийОтказ Тогда
		ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийОтказКПередаче;
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияАктаРасхожденийПодтверждение Тогда
		ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийПодтверждениеКПередаче;
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН Или 
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4 Тогда
		ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктОтказаКПередаче;
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ПодтверждениеОтменыПроведенияТТН Тогда
		ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПодтверждениеКПередаче;
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ОтказОтменыПроведенияТТН Тогда
		ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОтказКПередаче;
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыКПередаче(ДокументСсылка, ВидСтатуса);
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Статус после передачи данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * СтатусОбработки - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки) Экспорт
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТТН
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия2
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия3
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия4 Тогда
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		
		ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПереданВУТМ;
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПолученЕГАИС);
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПроведенЕГАИС);
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеУведомленияОРегистрацииДвижения);
		
		ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи;
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусовБазовыйПроцесс);
		
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН Или 
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4 Тогда
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		
		ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктОтказаПереданВУТМ;
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПолученЕГАИС);
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПроведенЕГАИС);
		
		ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктОтказаОшибка;
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтНакладной);
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусовБазовыйПроцесс);
		
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияАктаРасхожденийПодтверждение Тогда
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		
		ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийПодтверждениеПереданВУТМ;
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПолученЕГАИС);
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПроведенЕГАИС);
		
		ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийПодтверждениеОшибка;
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПодтвердитеАктОРасхождениях);
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусовБазовыйПроцесс);
		
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияАктаРасхожденийОтказ Тогда
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		
		ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийОтказПереданВУТМ;
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПолученЕГАИС);
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПроведенЕГАИС);
		
		ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийОтказОшибка;
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтАктаОРасхождениях);
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусовБазовыйПроцесс);
		
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ПодтверждениеОтменыПроведенияТТН ИЛИ 
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТТН Тогда
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		
		ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПодтверждениеПереданВУТМ;
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПолученЕГАИС);
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПроведенЕГАИС);
		
		ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПодтверждениеОшибка;
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПодтвердитеЗапросНаОтменуПроведения);
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусовБазовыйПроцесс);
		
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ОтказОтменыПроведенияТТН Тогда
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		
		ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОтказПереданВУТМ;
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПолученЕГАИС);
		
		ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОтказОшибка;
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтЗапросаНаОтменуПроведения);
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусовБазовыйПроцесс);
		
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Статус после получения данных из ЕГАИС.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Документ, для которого требуется обновить статус.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения обмена с ЕГАИС.
//  ДополнительныеПараметры - Неопределено, Структура со свойствами:
//   * СтатусОбработки - Перечисление.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения.
//   * ВидСообщенияКвитанции - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения, на которую получена квитанция.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
	ВидыСтатусовБазовыйПроцесс.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОбрабатываетсяКлиентом;
	ВидыСтатусовБазовыйПроцесс.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОбрабатываетсяЕГАИС;
	ВидыСтатусовБазовыйПроцесс.ОтменаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОтмененКлиентом;
	ВидыСтатусовБазовыйПроцесс.ОшибкаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи;
	ВидыСтатусовБазовыйПроцесс.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи;
	ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные);
	ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолученияПодтверждения);
	ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтНакладной);
	ВидыСтатусовБазовыйПроцесс.УведомлениеОРегистрацииДвижения = Истина;
	
	ВидыСтатусовАктТТНОтказ = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
	ВидыСтатусовАктТТНОтказ.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен;
	ВидыСтатусовАктТТНОтказ.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктОтказаОбрабатываетсяЕГАИС;
	ВидыСтатусовАктТТНОтказ.ОтменаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен;
	ВидыСтатусовАктТТНОтказ.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктОтказаОшибка;
	ВидыСтатусовАктТТНОтказ.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтНакладной);
	ВидыСтатусовАктТТНОтказ.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
	ВидыСтатусовАктТТНОтказ.УведомлениеОРегистрацииДвижения = Ложь;
	
	ВидыСтатусовКвитанцияАктаРасхожденийПодтверждение = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
	ВидыСтатусовКвитанцияАктаРасхожденийПодтверждение.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПодтвержденСРасхождениями;
	ВидыСтатусовКвитанцияАктаРасхожденийПодтверждение.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийПодтверждениеОбрабатываетсяЕГАИС;
	ВидыСтатусовКвитанцияАктаРасхожденийПодтверждение.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийПодтверждениеОшибка;
	ВидыСтатусовКвитанцияАктаРасхожденийПодтверждение.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПодтвердитеАктОРасхождениях);
	ВидыСтатусовКвитанцияАктаРасхожденийПодтверждение.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
	ВидыСтатусовКвитанцияАктаРасхожденийПодтверждение.УведомлениеОРегистрацииДвижения = Ложь;
	
	ВидыСтатусовКвитанцияАктаРасхожденийОтказ = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
	ВидыСтатусовКвитанцияАктаРасхожденийОтказ.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен;
	//Акт расхождения отменен
	//ВидыСтатусовКвитанцияАктаРасхожденийОтказ.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОтмененКлиентом;
	ВидыСтатусовКвитанцияАктаРасхожденийОтказ.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийОтказОбрабатываетсяЕГАИС;
	ВидыСтатусовКвитанцияАктаРасхожденийОтказ.ОтменаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен;
	//ВидыСтатусовКвитанцияАктаРасхожденийОтказ.ОтменаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОтмененКлиентом;
	ВидыСтатусовКвитанцияАктаРасхожденийОтказ.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийОтказОшибка;
	ВидыСтатусовКвитанцияАктаРасхожденийОтказ.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтАктаОРасхождениях);
	ВидыСтатусовКвитанцияАктаРасхожденийОтказ.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
	ВидыСтатусовКвитанцияАктаРасхожденийОтказ.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолученияПодтверждения);
	ВидыСтатусовКвитанцияАктаРасхожденийОтказ.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтНакладной);
	ВидыСтатусовКвитанцияАктаРасхожденийОтказ.УведомлениеОРегистрацииДвижения = Ложь;
	
	ВидыСтатусовЗапросНаОтменуПроведенияТТНПодтверждение = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
	ВидыСтатусовЗапросНаОтменуПроведенияТТНПодтверждение.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОбрабатываетсяКлиентом;
	ВидыСтатусовЗапросНаОтменуПроведенияТТНПодтверждение.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПодтверждениеОбрабатываетсяЕГАИС;
	ВидыСтатусовЗапросНаОтменуПроведенияТТНПодтверждение.ОтменаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОбрабатываетсяКлиентом;
	ВидыСтатусовЗапросНаОтменуПроведенияТТНПодтверждение.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПодтверждениеОшибка;
	ВидыСтатусовЗапросНаОтменуПроведенияТТНПодтверждение.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПодтвердитеЗапросНаОтменуПроведения);
	ВидыСтатусовЗапросНаОтменуПроведенияТТНПодтверждение.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
	ВидыСтатусовЗапросНаОтменуПроведенияТТНПодтверждение.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолученияПодтверждения);
	ВидыСтатусовЗапросНаОтменуПроведенияТТНПодтверждение.ОтменаПроведенияДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолученияПодтверждения);
	ВидыСтатусовЗапросНаОтменуПроведенияТТНПодтверждение.УведомлениеОРегистрацииДвижения = Ложь;
	
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.Подтвержден;
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОтказОбрабатываетсяЕГАИС;
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОтказОшибка;
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтЗапросаНаОтменуПроведения);
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
	ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ.УведомлениеОРегистрацииДвижения = Ложь;
	
	ВыполнитьРасчетТекущегоСостояния = Истина;
	Если ДополнительныеПараметры <> Неопределено
		И ДополнительныеПараметры.Свойство("ТекущееСостояние")
		И ДополнительныеПараметры.ТекущееСостояние <> Неопределено Тогда
		ВыполнитьРасчетТекущегоСостояния = ДополнительныеПараметры.ТекущееСостояние;
	КонецЕсли;
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТН ИЛИ 
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия2 ИЛИ 
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия3 ИЛИ 
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия4 Тогда
		
		ВидыСтатусов = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		ВидыСтатусов.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.Подтвержден;
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(
			ДокументСсылка,
			Перечисления.СтатусыОбработкиСообщенийЕГАИС.ПринятИзЕГАИС,
			ВидыСтатусов);
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН Или 
		 ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4 Тогда
		
		ВидыСтатусов = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		ВидыСтатусов.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОтмененКлиентом;
		
		Если ДополнительныеПараметры.Свойство("ТекущееСостояние")
			И ДополнительныеПараметры.ТекущееСостояние <> Неопределено Тогда
			ТекущееСостояние = ДополнительныеПараметры.ТекущееСостояние;
		Иначе
			ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(ДокументСсылка);
		КонецЕсли;
		
		Если ТекущееСостояние.ВидСтатуса <> Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен Тогда
			ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(
			ДокументСсылка,
			Перечисления.СтатусыОбработкиСообщенийЕГАИС.ПринятИзЕГАИС,
			ВидыСтатусов);
		КонецЕсли;
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктРазногласий ИЛИ 
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия2 ИЛИ 
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия3 ИЛИ 
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия4 Тогда
		
		ВидыСтатусов = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		ВидыСтатусов.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийПринят;
		ВидыСтатусов.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПодтвердитеАктОРасхождениях);
		ВидыСтатусов.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтАктаОРасхождениях);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(
			ДокументСсылка,
			Перечисления.СтатусыОбработкиСообщенийЕГАИС.ПринятИзЕГАИС,
			ВидыСтатусов);
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТТН Тогда
		
		ВидыСтатусов = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		ВидыСтатусов.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПринят;
		ВидыСтатусов.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПодтвердитеЗапросНаОтменуПроведения);
		ВидыСтатусов.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтЗапросаНаОтменуПроведения);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(
			ДокументСсылка,
			Перечисления.СтатусыОбработкиСообщенийЕГАИС.ПринятИзЕГАИС,
			ВидыСтатусов);
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияОРегистрацииФорм2 Тогда
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыПриПолученииКвитанции(
			ДокументСсылка,
			"УведомлениеОРегистрацииДвижения", Перечисления.СтатусыОбработкиСообщенийЕГАИС.ПринятИзЕГАИС,
			ВидыСтатусовБазовыйПроцесс, ВыполнитьРасчетТекущегоСостояния);
			
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияДоставлена Тогда
		
		ВидыСтатусов = Неопределено;
		Если ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ТТН ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия2 ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия3 ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия4 Тогда
			
			ВидыСтатусов = ВидыСтатусовБазовыйПроцесс;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН Тогда
			
			ВидыСтатусов = ВидыСтатусовАктТТНОтказ;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4 Тогда
			
			ВидыСтатусов = ВидыСтатусовАктТТНОтказ;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.КвитанцияАктаРасхожденийПодтверждение Тогда
			
			ВидыСтатусов = ВидыСтатусовКвитанцияАктаРасхожденийПодтверждение;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.КвитанцияАктаРасхожденийОтказ Тогда
			
			ВидыСтатусов = ВидыСтатусовКвитанцияАктаРасхожденийОтказ;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ПодтверждениеОтменыПроведенияТТН Тогда
			
			ВидыСтатусов = ВидыСтатусовЗапросНаОтменуПроведенияТТНПодтверждение;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ОтказОтменыПроведенияТТН Тогда
			
			ВидыСтатусов = ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ;
			
		Иначе
			ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
		КонецЕсли;
		
		Если ВидыСтатусов <> Неопределено Тогда
			ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыПриПолученииКвитанции(
				ДокументСсылка,
				"КвитанцияДоставлена", ДополнительныеПараметры.СтатусОбработки,
				ВидыСтатусов, ВыполнитьРасчетТекущегоСостояния);
		КонецЕсли;
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияВыполнена Тогда
		
		ВидыСтатусов = Неопределено;
		Если ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ТТН ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия2 ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия3 ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия4 Тогда
			
			Если ДополнительныеПараметры.Свойство("ТекущееСостояние")
				И ДополнительныеПараметры.ТекущееСостояние <> Неопределено Тогда
				ТекущееСостояние = ДополнительныеПараметры.ТекущееСостояние;
			Иначе
				ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(ДокументСсылка);
			КонецЕсли;
			
			Если ТекущееСостояние.ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийПодтверждениеОбрабатываетсяЕГАИС Тогда
				ВидыСтатусов = ВидыСтатусовКвитанцияАктаРасхожденийПодтверждение;
			ИначеЕсли ТекущееСостояние.ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийОтказОбрабатываетсяЕГАИС Тогда
				ВидыСтатусов = ВидыСтатусовКвитанцияАктаРасхожденийОтказ;
			ИначеЕсли ТекущееСостояние.ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктОтказаОбрабатываетсяЕГАИС Тогда
				ВидыСтатусов = ВидыСтатусовАктТТНОтказ;
			ИначеЕсли ТекущееСостояние.ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПодтверждениеОбрабатываетсяЕГАИС Тогда
				ВидыСтатусов = ВидыСтатусовЗапросНаОтменуПроведенияТТНПодтверждение;
			ИначеЕсли ТекущееСостояние.ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОтказОбрабатываетсяЕГАИС Тогда
				ВидыСтатусов = ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ;
			Иначе
				ВидыСтатусов = ВидыСтатусовБазовыйПроцесс;
			КонецЕсли;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН Тогда
			
			ВидыСтатусов = ВидыСтатусовАктТТНОтказ;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4 Тогда
			
			ВидыСтатусов = ВидыСтатусовАктТТНОтказ;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТН ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия2 ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия3 ИЛИ 
			ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия4 Тогда
			
			// Приходит квитанция по операции ТТН (см. выше)
			ВидыСтатусов = ВидыСтатусовКвитанцияАктаРасхожденийПодтверждение;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН Тогда
			
			ВидыСтатусов = ВидыСтатусовКвитанцияАктаРасхожденийОтказ;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4 Тогда
			
			ВидыСтатусов = ВидыСтатусовКвитанцияАктаРасхожденийОтказ;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ПодтверждениеОтменыПроведенияТТН Тогда
			
			ВидыСтатусов = ВидыСтатусовЗапросНаОтменуПроведенияТТНПодтверждение;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ОтказОтменыПроведенияТТН Тогда
			
			ВидыСтатусов = ВидыСтатусовЗапросНаОтменуПроведенияТТНОтказ;
			
		Иначе
			ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
		КонецЕсли;
		
		Если ВидыСтатусов <> Неопределено Тогда
			ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыПриПолученииКвитанции(
				ДокументСсылка,
				"КвитанцияВыполнена", ДополнительныеПараметры.СтатусОбработки,
				ВидыСтатусов, ВыполнитьРасчетТекущегоСостояния);
		КонецЕсли;
		
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Обновить статус после подготовки к передаче данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обновить статус после передачи данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обновить статус после получения данных из ЕГАИС.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Документ, для которого требуется обновить статус.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения обмена с ЕГАИС.
//  ДополнительныеПараметры - Неопределено, Структура со свойствами:
//   * СтатусОбработки - Перечисление.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения.
//   * ВидСообщенияКвитанции - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения, на которую получена квитанция.
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Получить последовательность операций в течении жизненного цикла документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Документ, для которого требуется обновить статус.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. функцию ИнтеграцияЕГАИС.ПустаяТаблицаПоследовательностьОпераций().
//
Функция ПоследовательностьОпераций(ДокументСсылка) Экспорт
	
	Таблица = ИнтеграцияЕГАИС.ПустаяТаблицаПоследовательностьОпераций();
	
	Исходящее = Перечисления.ВходящееИсходящееСобытие.Исходящее;
	Входящее  = Перечисления.ВходящееИсходящееСобытие.Входящее;
	
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0,    Исходящее, Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия3,       ДокументСсылка);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0,    Исходящее, Перечисления.ВидыОбъектовЕГАИС.ТТНВерсия4,       ДокументСсылка);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0,    Входящее,  Перечисления.ВидыОбъектовЕГАИС.КвитанцияОРегистрацииФорм2);
	
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -1,   Исходящее, Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН, ДокументСсылка, Истина, Ложь);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -1,   Исходящее, Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4, ДокументСсылка, Истина, Ложь);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица,  0,   Входящее,  Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия3);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица,  0,   Входящее,  Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия4);
	
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -2,   Входящее,  Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТН);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -2,   Входящее,  Перечисления.ВидыОбъектовЕГАИС.АктОтказаТТНВерсия4);
	
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -3,   Входящее,  Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия3);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -3,   Входящее,  Перечисления.ВидыОбъектовЕГАИС.АктПодтвержденияТТНВерсия4);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -31,  Входящее,  Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТТН);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -31,  Исходящее, Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТТН,              ДокументСсылка);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -311, Исходящее, Перечисления.ВидыОбъектовЕГАИС.ОтказОтменыПроведенияТТН,         ДокументСсылка);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -312, Исходящее, Перечисления.ВидыОбъектовЕГАИС.ПодтверждениеОтменыПроведенияТТН, ДокументСсылка);
	
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -4,   Входящее,  Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия3);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -4,   Входящее,  Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия4);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -4,   Исходящее, Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия3, ДокументСсылка);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -4,   Исходящее, Перечисления.ВидыОбъектовЕГАИС.АктРазногласийВерсия4, ДокументСсылка);
	
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -41,  Исходящее, Перечисления.ВидыОбъектовЕГАИС.КвитанцияАктаРасхожденийПодтверждение, ДокументСсылка);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -41,  Входящее,  Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТТН);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -41,  Исходящее, Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияТТН,              ДокументСсылка);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -411, Исходящее, Перечисления.ВидыОбъектовЕГАИС.ОтказОтменыПроведенияТТН,         ДокументСсылка);
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -412, Исходящее, Перечисления.ВидыОбъектовЕГАИС.ПодтверждениеОтменыПроведенияТТН, ДокументСсылка);
	
	ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, -42,  Исходящее, Перечисления.ВидыОбъектовЕГАИС.КвитанцияАктаРасхожденийОтказ, ДокументСсылка);
	
	Возврат Таблица;
	
КонецФункции

// Обработчик изменения статуса документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС - Документ.
//  ПредыдущийСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиЕГАИС - Предыдущий статус.
//  НовыйСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиЕГАИС - Предыдущий статус.
//  ПараметрыОбновленияСтатуса - Структура - см. функцию ИнтеграцияЕГАИС.ПараметрыОбновленияСтатуса().
//
Процедура ПриИзмененииСтатусаДокумента(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус, ПараметрыОбновленияСтатуса) Экспорт
	
	ВидыСтатусовДвижений = ВидыСтатусовДвижений();
	
	ДобавитьДвижения = ИнтеграцияЕГАИС.СтатусТребуетДобавленияДвижений(ВидыСтатусовДвижений, ПредыдущийСтатус, НовыйСтатус);
	УдалитьДвижения = ИнтеграцияЕГАИС.СтатусТребуетУдаленияДвижений(ВидыСтатусовДвижений, ПредыдущийСтатус, НовыйСтатус);
	
	Если ПараметрыОбновленияСтатуса.ОбновлятьДвижения
		И (ДобавитьДвижения Или УдалитьДвижения) Тогда
		
		ДополнительныеСвойстваДляПроведения = Новый Структура;
		ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, ДополнительныеСвойстваДляПроведения);
		
		ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойстваДляПроведения);
		
		НаборЗаписей = РегистрыНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписей.Загрузить(ДополнительныеСвойстваДляПроведения.ТаблицыДляДвижений["ОстаткиАлкогольнойПродукцииЕГАИС"]);
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыНакопления.ОстаткиМарокЕГАИС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписей.Загрузить(ДополнительныеСвойстваДляПроведения.ТаблицыДляДвижений["ОстаткиМарокЕГАИС"]);
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	//РассчитатьСтатусОформления(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус);
	
КонецПроцедуры

#КонецОбласти

#Область Статусы

// Возвращает статусы ошибок.
//
// Возвращаемое значение:
//  Массив - Статусы ошибок.
//
Функция ВидыСтатусовОшибки() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.АктОтказаОшибка);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийПодтверждениеОшибка);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.АктРасхожденийОтказОшибка);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПодтверждениеОшибка);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОтказОшибка);
	
	Возврат ВидыСтатусов;
	
КонецФункции

// Возвращает конечные статусы.
//
// Возвращаемое значение:
//  Массив - Конечные статусы.
//
Функция КонечныеВидыСтатусов() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ОтмененКлиентом);
	
	Возврат ВидыСтатусов;
	
КонецФункции

// Возвращает запрос для получения статуса оформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Документ основание.
// 
// Возвращаемое значение:
//  Запрос - Запрос для получения статуса оформления.
//
Функция ЗапросСтатусаОформления(ДокументОснование) Экспорт
	
	Запрос = ИнтеграцияЕГАИС.ЗапросСтатусаОформленияДействияНеОпределены();
	Запрос.УстановитьПараметр("КонечныеВидыСтатусовТоварноТранспортнаяНакладнаяИсходящаяЕГАИС", КонечныеВидыСтатусов());
	
	Возврат Запрос;
	
КонецФункции

// Возвращает статусы движений.
//
// Возвращаемое значение:
//  Массив - Статусы.
//
Функция ВидыСтатусовДвижений() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.Подтвержден);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ПодтвержденСРасхождениями);
	
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПринят);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПодтверждениеКПередаче);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПодтверждениеПереданВУТМ);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПодтверждениеОбрабатываетсяЕГАИС);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПодтверждениеОшибка);
	
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОтказКПередаче);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОтказПереданВУТМ);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОтказОбрабатываетсяЕГАИС);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОтказОшибка);
	
	Возврат ВидыСтатусов;
	
КонецФункции

#КонецОбласти

Функция СообщениеКПередачеXML(ДокументСсылка, ДальнейшееДействие, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные Тогда
		
		Возврат ТоварноТранспортнаяНакладнаяXML(ДокументСсылка);
		
	ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтНакладной Тогда
		
		Возврат АктОтказаXML(ДокументСсылка);
		
	ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ПодтвердитеАктОРасхождениях Тогда
		
		Возврат КвитанцияПодтвержденияАктаРасхожденийXML(ДокументСсылка);
		
	ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтАктаОРасхождениях Тогда
		
		Возврат КвитанцияОтказаОтАктаРасхожденийXML(ДокументСсылка);
		
	ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ПодтвердитеЗапросНаОтменуПроведения Тогда
		
		Возврат КвитанцияПодтверждениеЗапросаНаОтменуПроведенияXML(ДокументСсылка);
		
	ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ОткажитесьОтЗапросаНаОтменуПроведения Тогда
		
		Возврат КвитанцияОтказаОтЗапросаНаОтменуПроведенияXML(ДокументСсылка);
		
	КонецЕсли;
	
КонецФункции

#КонецЕсли