// Модуль объекта документа "Товарно-транспортная накладная ЕГАИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Возврат поставщику"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ВозвратПоставщику(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА, ОграниченияЗаполнения = Неопределено) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "Товары") Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВозвратПоставщику.Номер КАК НомерТТН,
	|	ВозвратПоставщику.Дата КАК ДатаТТН,
	|	ВозвратПоставщику.Контрагент,
	|	ВозвратПоставщику.Контрагент.ИНН КАК КонтрагентИНН,
	|	ВозвратПоставщику.Контрагент.КПП КАК КонтрагентКПП,
	//|	ВозвратПоставщику.Грузополучатель,
	|	ВозвратПоставщику.Дата КАК ДатаОтгрузки,
	|	ИСТИНА КАК Упакована,
	|	ВозвратПоставщику.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ВозвратПоставщику.СкладКомпании.ПодразделениеКомпании.Организация.ИНН КАК ПодразделениеИНН,
	|	ВЫБОР
	|		КОГДА ВозвратПоставщику.СкладКомпании.ПодразделениеКомпании.КПП = """" ТОГДА
	|			ВозвратПоставщику.СкладКомпании.ПодразделениеКомпании.Организация.КПП
	|		ИНАЧЕ
	|			ВозвратПоставщику.СкладКомпании.ПодразделениеКомпании.КПП
	|	КОНЕЦ КАК ПодразделениеКПП,
	|	ВозвратПоставщику.Организация,
	|	ВозвратПоставщику.Организация.ИНН КАК ОрганизацияИНН,
	|	ВозвратПоставщику.Организация.КПП КАК ОрганизацияКПП,
	|	ВозвратПоставщику.Комментарий КАК Комментарий,
	|	ВозвратПоставщику.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ВозвратПоставщику КАК ВозвратПоставщику
	|ГДЕ
	|	ВозвратПоставщику.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать();
	Если НЕ ВыборкаШапка.Следующий() Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	НомерТТН       = ВыборкаШапка.НомерТТН;
	ДатаТТН        = ВыборкаШапка.ДатаТТН;
	ДатаОтгрузки   = ВыборкаШапка.ДатаОтгрузки;
	СуммаДокумента = ВыборкаШапка.СуммаДокумента;
	ХозОперация    = Справочники.ХозОперации.ТТНВозвратТоваровПоставщикуЕГАИС;
	Основание      = СокрЛП(ДанныеЗаполнения);
	
	Если ОграниченияЗаполнения = Неопределено Тогда
		Комментарий   = ВыборкаШапка.Комментарий;
		ОтборСправки2 = Новый Массив;
	Иначе
		НомерТТН      = НомерТТН + "/"+ОграниченияЗаполнения.НомерПартии;
		Комментарий   = ОграниченияЗаполнения.НомерВходящий + "; " + Формат(ОграниченияЗаполнения.ДатаВходящая, "ДФ=dd.MM.yy");
		ОтборСправки2 = ОграниченияЗаполнения.Справки2;
	КонецЕсли;
	
	Грузоотправитель = Справочники.КлассификаторОрганизацийЕГАИС.НайтиКлассификаторОрганизации(ВыборкаШапка.Организация, ВыборкаШапка.ПодразделениеКомпании, ВыборкаШапка.ПодразделениеИНН, ВыборкаШапка.ПодразделениеКПП);
	Грузополучатель  = Справочники.КлассификаторОрганизацийЕГАИС.НайтиКлассификаторКонтрагента(ВыборкаШапка.Контрагент, ВыборкаШапка.КонтрагентИНН, ВыборкаШапка.КонтрагентКПП);
	
	ИзменениеПраваСобственности = Истина;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВозвратПоставщикуТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВозвратПоставщикуТовары.Номенклатура,
	//|	ВозвратПоставщикуТовары.Номенклатура.КодГАК КАК КодГАК,
	|	ВЫБОР
	|		КОГДА ВозвратПоставщикуТовары.Номенклатура.КоличествоВМультипаке = 0 ТОГДА
	|			ВозвратПоставщикуТовары.Коэффициент*ВозвратПоставщикуТовары.Количество
	|		ИНАЧЕ
	|			ВозвратПоставщикуТовары.Коэффициент*ВозвратПоставщикуТовары.Количество*ВозвратПоставщикуТовары.Номенклатура.КоличествоВМультипаке
	|	КОНЕЦ КАК Количество,
	|	ВозвратПоставщикуТовары.СуммаВсего КАК Сумма,
	|	ВозвратПоставщикуТовары.Справка2,
	|	ВозвратПоставщикуТовары.Справка2.Справка1 КАК Справка1,
	|	ЕСТЬNULL(ВозвратПоставщикуТовары.Справка2.АлкогольнаяПродукция, ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)) КАК АлкогольнаяПродукция
	//|	ЕСТЬNULL(ВозвратПоставщикуТовары.Справка2.АлкогольнаяПродукция.Упакована, Ложь) КАК Упакована
	|ИЗ
	|	Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
	|ГДЕ
	|	ВозвратПоставщикуТовары.Ссылка = &Ссылка" + ?(ОтборСправки2.Количество()=0, "", " И 
	|	ВозвратПоставщикуТовары.Справка2 В (&Справка2)") + "
	|";
	
	Запрос.УстановитьПараметр("Ссылка",   ДанныеЗаполнения);
	Запрос.УстановитьПараметр("Справка2", ОтборСправки2);
	
	Товары.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		//Если Не Выборка.Упакована Тогда
		//	НоваяСтрока.Количество = НоваяСтрока.Количество/10;
		//КонецЕсли;
		Документы.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ТоварыСуммаПриИзменении(ЭтотОбъект, НоваяСтрока);
	КонецЦикла;
	
	Если ОтборСправки2.Количество()=0 Тогда
		ИдентификаторыСтрок = Новый Массив;
	Иначе
		ИдентификаторыСтрок = Товары.ВыгрузитьКолонку("ИдентификаторСтроки");
	КонецЕсли;
	
	ЗапросМарок = Новый Запрос;
	ЗапросМарок.Текст = "
	|ВЫБРАТЬ
	|	ВозвратПоставщикуМарки.КодМарки,
	|	ВозвратПоставщикуМарки.МаркировкаУпаковки,
	|	ВозвратПоставщикуМарки.ИдентификаторСтроки
	|ИЗ
	|	Документ.ВозвратПоставщику.Марки КАК ВозвратПоставщикуМарки
	|ГДЕ
	|	ВозвратПоставщикуМарки.Ссылка = &Ссылка" + ?(ОтборСправки2.Количество()=0, "", " И 
	|	ВозвратПоставщикуМарки.ИдентификаторСтроки В (&ИдентификаторыСтрок)") + "
	|";
	
	ЗапросМарок.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	ЗапросМарок.УстановитьПараметр("ИдентификаторыСтрок", ИдентификаторыСтрок);
	Марки.Загрузить(ЗапросМарок.Выполнить().Выгрузить());
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ВозвратПоставщику()

// Производит заполнение объекта на основании документа "Перемещение товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПеремещениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "ТипЦен") Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПеремещениеТоваров.ХозОперация КАК ХозОперация,
	|	ПеремещениеТоваров.Номер КАК НомерТТН,
	|	ПеремещениеТоваров.Дата КАК ДатаТТН,
	|	ПеремещениеТоваров.СкладПолучатель КАК ПодразделениеПолучатель,
	|	ПеремещениеТоваров.СкладПолучатель.Организация КАК ОрганизацияПолучатель,
	|	ПеремещениеТоваров.СкладПолучатель.Организация.ИНН КАК ПодразделениеПолучательИНН,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.СкладПолучатель.КПП = """" ТОГДА
	|			ПеремещениеТоваров.СкладПолучатель.Организация.КПП
	|		ИНАЧЕ
	|			ПеремещениеТоваров.СкладПолучатель.КПП
	|	КОНЕЦ КАК ПодразделениеПолучательКПП,
	//|	ПеремещениеТоваров.Грузополучатель,
	|	ПеремещениеТоваров.Дата КАК ДатаОтгрузки,
	|	ИСТИНА КАК Упакована,
	|	ПеремещениеТоваров.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ПеремещениеТоваров.СкладКомпании.ПодразделениеКомпании.Организация.ИНН КАК ПодразделениеИНН,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.СкладКомпании.ПодразделениеКомпании.КПП = """" ТОГДА
	|			ПеремещениеТоваров.СкладКомпании.ПодразделениеКомпании.Организация.КПП
	|		ИНАЧЕ
	|			ПеремещениеТоваров.СкладКомпании.ПодразделениеКомпании.КПП
	|	КОНЕЦ КАК ПодразделениеКПП,
	|	ПеремещениеТоваров.Организация,
	|	ПеремещениеТоваров.Организация.ИНН КАК ОрганизацияИНН,
	|	ПеремещениеТоваров.Организация.КПП КАК ОрганизацияКПП,
	|	ПеремещениеТоваров.Комментарий КАК Комментарий,
	|	ПеремещениеТоваров.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать();
	Если НЕ ВыборкаШапка.Следующий() Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	РазрешитьПеремещениеМеждуФилиалам = ПравоПользователя("РазрешитьПеремещениеМеждуФилиалам");
	
	Если НЕ ВыборкаШапка.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал и РазрешитьПеремещениеМеждуФилиалам Тогда	
	//Если НЕ ВыборкаШапка.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровВФилиал Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Можно вводить на основании хоз. операции:
		|<%1>!'"), Строка(Справочники.ХозОперации.ПеремещениеТоваровВФилиал));
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	НомерТТН       = ВыборкаШапка.НомерТТН;
	ДатаТТН        = ВыборкаШапка.ДатаТТН;
	ДатаОтгрузки   = ВыборкаШапка.ДатаОтгрузки;
	СуммаДокумента = ВыборкаШапка.СуммаДокумента;
	ХозОперация    = Справочники.ХозОперации.ТТНПеремещениеТоваровВФилиалЕГАИС;
	Основание      = СокрЛП(ДанныеЗаполнения);
	Комментарий    = ВыборкаШапка.Комментарий;
	
	Грузоотправитель = Справочники.КлассификаторОрганизацийЕГАИС.НайтиКлассификаторОрганизации(ВыборкаШапка.Организация, ВыборкаШапка.ПодразделениеКомпании, ВыборкаШапка.ПодразделениеИНН, ВыборкаШапка.ПодразделениеКПП);
	Грузополучатель  = Справочники.КлассификаторОрганизацийЕГАИС.НайтиКлассификаторОрганизации(ВыборкаШапка.ОрганизацияПолучатель, ВыборкаШапка.ПодразделениеПолучатель, ВыборкаШапка.ПодразделениеПолучательИНН, ВыборкаШапка.ПодразделениеПолучательКПП);
	
	ИзменениеПраваСобственности = Ложь;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.НомерСтроки,
	|	ПеремещениеТоваровТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Номенклатура.КоличествоВМультипаке = 0 И ПеремещениеТоваровТовары.КоличествоБазовое = 0 ТОГДА
	|			ПеремещениеТоваровТовары.Коэффициент*ПеремещениеТоваровТовары.Количество
	|		КОГДА ПеремещениеТоваровТовары.Номенклатура.КоличествоВМультипаке = 0 ТОГДА
	|			ПеремещениеТоваровТовары.КоличествоБазовое
	|		КОГДА ПеремещениеТоваровТовары.КоличествоБазовое = 0 ТОГДА
	|			ПеремещениеТоваровТовары.Коэффициент*ПеремещениеТоваровТовары.Количество*ПеремещениеТоваровТовары.Номенклатура.КоличествоВМультипаке
	|		ИНАЧЕ
	|			ПеремещениеТоваровТовары.КоличествоБазовое*ПеремещениеТоваровТовары.Номенклатура.КоличествоВМультипаке
	|	КОНЕЦ КАК Количество,
	|	ПеремещениеТоваровТовары.СуммаВсего КАК Сумма,
	|	ПеремещениеТоваровТовары.Справка2,
	|	ПеремещениеТоваровТовары.Справка2.Справка1 КАК Справка1,
	|	ЕСТЬNULL(ПеремещениеТоваровТовары.Справка2.АлкогольнаяПродукция, ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)) КАК АлкогольнаяПродукция
	//|	ЕСТЬNULL(ПеремещениеТоваровТовары.Справка2.АлкогольнаяПродукция.Упакована, Ложь) КАК Упакована
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	ПеремещениеТоваровТовары.НомерСтроки
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("ИмяРегистра", "ПартииТоваровКомпании");
	ПараметрыПолучения.Вставить("ИспользуемыеРесурсы", Новый Структура("Сумма"));
	ПараметрыПолучения.Вставить("ВидДвиженияПриход", ВидДвиженияНакопления.Расход);
	ПараметрыПолучения.Вставить("ДобавлятьНомерСтроки", Истина);
	ПараметрыПолучения.Вставить("ТекстЗапроса", "");
	ПараметрыПолучения.Вставить("ТекстОтбора", "");
	ПараметрыПолучения.Вставить("ПараметрыОтбора", Новый Структура);
	
	КэшТаблица = ЗащищенныеФункцииСервер.ПолучитьТаблицуСуммСписания(ДанныеЗаполнения, ПараметрыПолучения);
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("НомерСтроки", ТекущаяСтрока.НомерСтроки);
		
		МассивСумм = КэшТаблица.НайтиСтроки(Отбор);
		Если МассивСумм.Количество() > 0 Тогда
			СуммаСписания      = 0;
			КоличествоСписания = 0;
			Для Каждого СтрМассивСумм Из МассивСумм Цикл
				СуммаСписания      = СуммаСписания + СтрМассивСумм.Сумма;
				КоличествоСписания = КоличествоСписания + СтрМассивСумм.Количество;
			КонецЦикла;
				
			Если НЕ ТекущаяСтрока.Количество = КоличествоСписания Тогда
				Если КоличествоСписания = 0 Тогда
					ТекущаяСтрока.Цена = СуммаСписания;
				Иначе
					ТекущаяСтрока.Цена = СуммаСписания/КоличествоСписания;
				КонецЕсли;
				ТекущаяСтрока.Количество = ТекущаяСтрока.Количество;
				//Если ТекущаяСтрока.АлкогольнаяПродукция.Упакована = Ложь Тогда
				//	ТекущаяСтрока.Количество = ТекущаяСтрока.Количество/10;
				//КонецЕсли;
				Документы.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ТоварыЦенаПриИзменении(ЭтотОбъект, ТекущаяСтрока);
			Иначе
				ТекущаяСтрока.Сумма = СуммаСписания;
				ТекущаяСтрока.Количество = ТекущаяСтрока.Количество;
				//Если ТекущаяСтрока.АлкогольнаяПродукция.Упакована = Ложь Тогда
				//	ТекущаяСтрока.Количество = ТекущаяСтрока.Количество/10;
				//КонецЕсли;
				Документы.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ТоварыСуммаПриИзменении(ЭтотОбъект, ТекущаяСтрока);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗапросМарок = Новый Запрос;
	ЗапросМарок.Текст = "
	|ВЫБРАТЬ
	|	ПеремещениеТоваровМарки.КодМарки,
	|	ПеремещениеТоваровМарки.МаркировкаУпаковки,
	|	ПеремещениеТоваровМарки.ИдентификаторСтроки
	|ИЗ
	|	Документ.ПеремещениеТоваров.Марки КАК ПеремещениеТоваровМарки
	|ГДЕ
	|	ПеремещениеТоваровМарки.Ссылка = &Ссылка
	|";
	
	ЗапросМарок.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Марки.Загрузить(ЗапросМарок.Выполнить().Выгрузить());
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПеремещениеТоваров()

// Производит заполнение объекта на основании документа "Реализация товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_РеализацияТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "ТипЦен") Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализацияТоваров.Номер КАК НомерТТН,
	|	РеализацияТоваров.Дата КАК ДатаТТН,
	|	РеализацияТоваров.Контрагент,
	|	РеализацияТоваров.Контрагент.ИНН КАК КонтрагентИНН,
	|	РеализацияТоваров.Контрагент.КПП КАК КонтрагентКПП,
	//|	РеализацияТоваров.Грузополучатель,
	|	РеализацияТоваров.Дата КАК ДатаОтгрузки,
	|	ИСТИНА КАК Упакована,
	|	РеализацияТоваров.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	РеализацияТоваров.СкладКомпании.ПодразделениеКомпании.Организация.ИНН КАК ПодразделениеИНН,
	|	ВЫБОР
	|		КОГДА РеализацияТоваров.СкладКомпании.ПодразделениеКомпании.КПП = """" ТОГДА
	|			РеализацияТоваров.СкладКомпании.ПодразделениеКомпании.Организация.КПП
	|		ИНАЧЕ
	|			РеализацияТоваров.СкладКомпании.ПодразделениеКомпании.КПП
	|	КОНЕЦ КАК ПодразделениеКПП,
	|	РеализацияТоваров.Организация,
	|	РеализацияТоваров.Организация.ИНН КАК ОрганизацияИНН,
	|	РеализацияТоваров.Организация.КПП КАК ОрганизацияКПП,
	|	РеализацияТоваров.Комментарий КАК Комментарий,
	|	РеализацияТоваров.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать();
	Если НЕ ВыборкаШапка.Следующий() Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	НомерТТН       = ВыборкаШапка.НомерТТН;
	ДатаТТН        = ВыборкаШапка.ДатаТТН;
	ДатаОтгрузки   = ВыборкаШапка.ДатаОтгрузки;
	СуммаДокумента = ВыборкаШапка.СуммаДокумента;
	Если ДокументОснование.ХозОперация = Справочники.ХозОперации.ВозвратПоставщикуОтгрузкой Тогда 
		ХозОперация = Справочники.ХозОперации.ТТНВозвратТоваровПоставщикуЕГАИС;
	Иначе
		ХозОперация = Справочники.ХозОперации.ТТНРеализацияТоваровЕГАИС;
	КонецЕсли;
	Основание      = СокрЛП(ДанныеЗаполнения);
	Комментарий    = ВыборкаШапка.Комментарий;
	
	Грузоотправитель = Справочники.КлассификаторОрганизацийЕГАИС.НайтиКлассификаторОрганизации(ВыборкаШапка.Организация, ВыборкаШапка.ПодразделениеКомпании, ВыборкаШапка.ПодразделениеИНН, ВыборкаШапка.ПодразделениеКПП);
	Грузополучатель  = Справочники.КлассификаторОрганизацийЕГАИС.НайтиКлассификаторКонтрагента(ВыборкаШапка.Контрагент, ВыборкаШапка.КонтрагентИНН, ВыборкаШапка.КонтрагентКПП);
	
	ИзменениеПраваСобственности = Истина;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	РеализацияТоваровТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	РеализацияТоваровТовары.Номенклатура,
	//|	РеализацияТоваровТовары.Номенклатура.КодГАК КАК КодГАК,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровТовары.Номенклатура.КоличествоВМультипаке = 0 И РеализацияТоваровТовары.КоличествоБазовое = 0 ТОГДА
	|			РеализацияТоваровТовары.Коэффициент*РеализацияТоваровТовары.Количество
	|		КОГДА РеализацияТоваровТовары.Номенклатура.КоличествоВМультипаке = 0 ТОГДА
	|			РеализацияТоваровТовары.КоличествоБазовое
	|		КОГДА РеализацияТоваровТовары.КоличествоБазовое = 0 ТОГДА
	|			РеализацияТоваровТовары.Коэффициент*РеализацияТоваровТовары.Количество*РеализацияТоваровТовары.Номенклатура.КоличествоВМультипаке
	|		ИНАЧЕ
	|			РеализацияТоваровТовары.КоличествоБазовое*РеализацияТоваровТовары.Номенклатура.КоличествоВМультипаке
	|	КОНЕЦ КАК Количество,
	|	РеализацияТоваровТовары.СуммаВсего КАК Сумма,
	|	РеализацияТоваровТовары.Справка2,
	|	РеализацияТоваровТовары.Справка2.Справка1 КАК Справка1,
	|	ЕСТЬNULL(РеализацияТоваровТовары.Справка2.АлкогольнаяПродукция, ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)) КАК АлкогольнаяПродукция
	//|	ЕСТЬNULL(РеализацияТоваровТовары.Справка2.АлкогольнаяПродукция.Упакована, Ложь) КАК Упакована
	|ИЗ
	|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	|ГДЕ
	|	РеализацияТоваровТовары.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Товары.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		//Если Не Выборка.Упакована Тогда
		//	НоваяСтрока.Количество = НоваяСтрока.Количество/10;
		//КонецЕсли;
		Документы.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ТоварыСуммаПриИзменении(ЭтотОбъект, НоваяСтрока);
	КонецЦикла;
	
	ЗапросМарок = Новый Запрос;
	ЗапросМарок.Текст = "
	|ВЫБРАТЬ
	|	РеализацияТоваровМарки.КодМарки,
	|	РеализацияТоваровМарки.МаркировкаУпаковки,
	|	РеализацияТоваровМарки.ИдентификаторСтроки
	|ИЗ
	|	Документ.РеализацияТоваров.Марки КАК РеализацияТоваровМарки
	|ГДЕ
	|	РеализацияТоваровМарки.Ссылка = &Ссылка
	|";
	
	ЗапросМарок.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Марки.Загрузить(ЗапросМарок.Выполнить().Выгрузить());
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_РеализацияТоваров()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДокументЗаполнения") И ТипЗнч(ДанныеЗаполнения.ДокументЗаполнения) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
			ОграниченияЗаполнения = ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "ОграниченияЗаполнения", Неопределено);
			ОбработкаЗаполнения_ВозвратПоставщику(ДанныеЗаполнения.ДокументЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, ОграниченияЗаполнения);
		КонецЕсли;
	КонецЕсли;
	
	ФорматОбмена = Справочники.КлассификаторОрганизацийЕГАИС.ФорматОбмена(Грузоотправитель);
	ФорматОбменаГрузополучатель = Справочники.КлассификаторОрганизацийЕГАИС.ФорматОбмена(Грузополучатель);
	Если ФорматОбмена = 4 И ФорматОбменаГрузополучатель = 4 Тогда
		ФорматОбмена = 4;
	Иначе
		ФорматОбмена = 3;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ОбработкаЗаполненияПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	Марки.Очистить();
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ФорматОбмена = Справочники.КлассификаторОрганизацийЕГАИС.ФорматОбмена(Грузоотправитель);
	Для Каждого ТекущаяСтрока Из Товары Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока.Справка1) Тогда
			Продолжить;
		КонецЕсли;
		ТекущаяСтрока.Справка1 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Справка2, "Справка1");
	КонецЦикла;
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Идентификатор) Тогда
		Идентификатор = СокрЛП(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	//ФорматОбмена = Справочники.КлассификаторОрганизацийЕГАИС.ФорматОбмена(Грузоотправитель);
	//ФорматОбменаГрузополучатель = Справочники.КлассификаторОрганизацийЕГАИС.ФорматОбмена(Грузополучатель);
	//Если ФорматОбмена = 4 И ФорматОбменаГрузополучатель = 4 Тогда
	ФорматОбмена = 4;
	//Иначе
	//	ФорматОбмена = 3;
	//КонецЕсли;
	
	//Если ФорматОбмена = 4 И (НЕ ЗначениеЗаполнено(ТранспортноеСредство.НомерТС)) Тогда
	//	ВывестиСообщение(НСтр("ru='У транспортного средства ""%1"". не заполнен номер'"),,,, Отказ, СокрЛП(ТранспортноеСредство));
	//КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока.Справка1) Тогда
			Продолжить;
		КонецЕсли;
		ТекущаяСтрока.Справка1 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Справка2, "Справка1");
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ЗаписатьСтатусДокументаЕГАИСПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РегистрыНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.ЗаписатьТаблицуДвижений(ДополнительныеСвойства.ТаблицыДляДвижений.ОстаткиАлкогольнойПродукцииЕГАИС, Движения, Отказ);
	//РегистрыНакопления.ОстаткиВТорговомЗалеЕГАИС.ЗаписатьТаблицуДвижений(ДополнительныеСвойства.ТаблицыДляДвижений.ОстаткиАлкогольнойПродукцииЕГАИС, Движения, Отказ);
	РегистрыНакопления.ОстаткиМарокЕГАИС.ЗаписатьТаблицуДвижений(ДополнительныеСвойства.ТаблицыДляДвижений.ОстаткиМарокЕГАИС, Движения, Отказ);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры // ОбработкаПроведения()


#КонецЕсли
