
//////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
// Процедура обновляет информацию в таблице настроек.
Процедура ЗаполнитьПереченьДокументов()
	
	ПереченьДокументов.Очистить();
	
	ТаблицаДокументов = Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("ДокументИмя",     Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100)));
	ТаблицаДокументов.Колонки.Добавить("ДокументСиноним", Новый ОписаниеТипов("Строка"));
	
	Для Каждого ЭлементМетаданных Из Метаданные.Документы Цикл
		
		// Не выводим документы, у которых запрещено проведение.
		Если ЭлементМетаданных.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
			
			// Не выводим документы, у которых не включено использование общего реквизита "Статус утверждения".
			ЭлементУтверждения = Метаданные.ОбщиеРеквизиты.СтатусУтверждения.Состав.Найти(ЭлементМетаданных.Имя);
			Если ЭлементУтверждения.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать Тогда
				
				НоваяСтрокаДокумента = ТаблицаДокументов.Добавить();
				НоваяСтрокаДокумента.ДокументИмя     = ЭлементМетаданных.ПолноеИмя();
				НоваяСтрокаДокумента.ДокументСиноним = ЭлементМетаданных.Синоним;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокументов.ДокументИмя КАК ДокументИмя,
	|	ТаблицаДокументов.ДокументСиноним КАК ДокументСиноним
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	&ТаблицаДокументов КАК ТаблицаДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокументов.ДокументИмя КАК ДокументИмя,
	|	ТаблицаДокументов.ДокументСиноним КАК ДокументСиноним,
	|	ЕСТЬNULL(ИспользоватьУтверждениеДокументов.ОтклонениеПриОтменеПроведения, ЛОЖЬ) КАК ОтклонениеПриОтменеПроведения,
	|	ВЫБОР
	|		КОГДА ИспользоватьУтверждениеДокументов.ОтклонениеПриОтменеПроведения ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Использование
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИспользоватьУтверждениеДокументов КАК ИспользоватьУтверждениеДокументов
	|		ПО ТаблицаДокументов.ДокументИмя = ИспользоватьУтверждениеДокументов.Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументИмя";
	
	Запрос.УстановитьПараметр("ТаблицаДокументов", ТаблицаДокументов);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПереченьДокументов.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДерево()

&НаСервере
// Запись настроек использования утверждения документов в РС ИспользоватьУтверждениеДокументов.
Процедура ЗаписатьНастройки()
	
	// Записываем только измененные настройки.
	Для Каждого ТекДокумент Из ПереченьДокументов.НайтиСтроки(Новый Структура("Изменено", Истина)) Цикл
		
		
		ЗаписьРегистра = РегистрыСведений.ИспользоватьУтверждениеДокументов.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Документ = ТекДокумент.ДокументИмя;
		ЗаписьРегистра.Прочитать();
		
		Если ТекДокумент.Использование Тогда
			
			ЗаписьРегистра.Документ                      = ТекДокумент.ДокументИмя;
			ЗаписьРегистра.ОтклонениеПриОтменеПроведения = ТекДокумент.ОтклонениеПриОтменеПроведения;
			ЗаписьРегистра.Записать();
		Иначе
			
			ЗаписьРегистра.Удалить();
		КонецЕсли;
		
		// Сбрасываем признак изменения настроек.
		ТекДокумент.Изменено = Ложь;
	КонецЦикла;
	
	// Сбрасываем модифицированность, если не осталось измененных настроек.
	Модифицированность = ПереченьДокументов.НайтиСтроки(Новый Структура("Изменено", Истина)).Количество() > 0;
	
КонецПроцедуры

// Вопрос пользователю о сохранении измененных настроек.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ВопросОСохраненииНастроек()
	
	Если Модифицированность Тогда
		
		// Форма была изменена, зададим вопрос пользователю.
		Оповещение   = Новый ОписаниеОповещения("Подключаемый_РеакцияНаВопросОСохраненииНастроек", ЭтотОбъект);
		
		ТекстВопроса     = НСтр("ru = 'Настройки были изменены. Сохранить?'");
		ЗаголовокВопроса = НСтр("ru = 'Сохранение настроек'");
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да, ЗаголовокВопроса);
	КонецЕсли;
	
КонецПроцедуры // ВопросОСохраненииНастроек()

// Обработка результата ответа на вопрос пользователю о сохранении измененных настроек.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура Подключаемый_РеакцияНаВопросОСохраненииНастроек(Результат, ПараметрыДействия) Экспорт
	
	Источник = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Источник");
	
	Если Результат = КодВозвратаДиалога.Да ИЛИ Результат = КодВозвратаДиалога.Нет Тогда
		
		Если Результат = КодВозвратаДиалога.Да Тогда
			// Сохраняем настройки.
			Записать();
		КонецЕсли;
		
		Модифицированность = Ложь;
		
		// Продолжаем начатое действие.
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры // Подключаемый_РеакцияНаВопросОСохраненииНастроек()

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Цвет текста
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ПереченьДокументов");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПереченьДокументов.Использование");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	// Только просмотр
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ПереченьДокументовОтклонениеПриОтменеПроведения");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПереченьДокументов.Использование");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры


////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Заполняем таблицу документов.
	ЗаполнитьПереченьДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		ВопросОСохраненииНастроек();
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПереченьДокументовИспользованиеОтклонениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПереченьДокументов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные.Изменено = Истина;
		Модифицированность     = Истина;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////
// ДЕЙСТВИЯ КОМАНД

&НаКлиенте
// Сохранение настроек и закрытие формы
Процедура ЗаписатьИЗакрыть(Команда = Неопределено)
	
	Записать();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
// Сохранение настроек
Процедура Записать(Команда = Неопределено)
	
	Если Модифицированность Тогда
		
		ЗаписатьНастройки();
		Модифицированность = Ложь;
		
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ИспользоватьУтверждениеДокументов"));
	КонецЕсли;
	
КонецПроцедуры
