// Модуль менеджера документа "Остатки марок ЕГАИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	ИтогиОперации.Вставить("СуммаДокумента", 0);
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("ОрганизацияЕГАИС");
	Если Объект.ХозОперация = Справочники.ХозОперации.ВводОстатковМарокЕГАИС Тогда
		ОбязательныеРеквизиты.Добавить("Марки.Справка2");
	ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.СписаниеОстатковМарокЕГАИС Тогда
		ОбязательныеРеквизиты.Добавить("Марки.Справка2");
	ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.СписаниеОстатковПоСправке2ЕГАИС Тогда
		ОбязательныеРеквизиты.Добавить("Марки.Справка2");
	Иначе
		ОбязательныеРеквизиты.Добавить("Справка2");
	КонецЕсли;
	
	//ОбязательныеРеквизиты.Добавить("Марки.КодМарки");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов табличных частей
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПараметрыДействия=Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", Объект.Марки.Количество() > 0);
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДокументОснованиеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Прописать проверку соответствия реквизитов объекта выбранной хоз.операции
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОВЕДЕНИЕ 

Функция ТекстЗапросаОстаткиМарокЕГАИС(ТекстыЗапроса, ВариантСписания)
	
	Если ВариантСписания = 1 Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА СУММА(ВложенныйРезультат.Количество) > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	&ДатаРегистрации КАК Период,
		|	&Ссылка КАК Регистратор,
		|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
		|	&ХозОперация КАК ХозОперация,
		|	ВложенныйРезультат.Справка2 КАК Справка2,
		|	ВложенныйРезультат.КодМарки КАК КодМарки,
		|	ВЫБОР
		|		КОГДА СУММА(ВложенныйРезультат.Количество) > 0
		|			ТОГДА СУММА(ВложенныйРезультат.Количество)
		|		ИНАЧЕ - СУММА(ВложенныйРезультат.Количество)
		|	КОНЕЦ КАК Количество
		|ИЗ
		|(ВЫБРАТЬ
		|	ОстаткиМарокЕГАИСОстатки.Справка2 КАК Справка2,
		|	ОстаткиМарокЕГАИСОстатки.КодМарки КАК КодМарки,
		|	-ОстаткиМарокЕГАИСОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиМарокЕГАИС.Остатки(&Период, ОрганизацияЕГАИС = &ОрганизацияЕГАИС И (Справка2, КодМарки) В (ВЫБРАТЬ ОстаткиМарокЕГАИС.Справка2, ОстаткиМарокЕГАИС.КодМарки ИЗ ОстаткиМарокЕГАИС)) КАК ОстаткиМарокЕГАИСОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиМарокЕГАИС.Справка2,
		|	ОстаткиМарокЕГАИС.КодМарки,
		|	1
		|ИЗ
		|	ОстаткиМарокЕГАИС КАК ОстаткиМарокЕГАИС) КАК ВложенныйРезультат
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйРезультат.Справка2,
		|	ВложенныйРезультат.КодМарки
		|ИМЕЮЩИЕ
		|	(НЕ СУММА(ВложенныйРезультат.Количество) = 0)
		|УПОРЯДОЧИТЬ ПО
		|	КодМарки
		|";
	ИначеЕсли ВариантСписания = 2 Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&ДатаРегистрации КАК Период,
		|	&Ссылка КАК Регистратор,
		|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
		|	&ХозОперация КАК ХозОперация,
		|	ОстаткиМарокЕГАИСОстатки.Справка2 КАК Справка2,
		|	ОстаткиМарокЕГАИСОстатки.КодМарки КАК КодМарки,
		|	ОстаткиМарокЕГАИСОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиМарокЕГАИС.Остатки(&Период, ОрганизацияЕГАИС = &ОрганизацияЕГАИС И (Справка2, КодМарки) В (ВЫБРАТЬ ОстаткиМарокЕГАИС.Справка2, ОстаткиМарокЕГАИС.КодМарки ИЗ ОстаткиМарокЕГАИС)) КАК ОстаткиМарокЕГАИСОстатки
		|ГДЕ
		|	ЕСТЬNULL(ОстаткиМарокЕГАИСОстатки.КоличествоОстаток, 0)>0
		|УПОРЯДОЧИТЬ ПО
		|	КодМарки
		|";
	ИначеЕсли ВариантСписания = 3 Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&ДатаРегистрации КАК Период,
		|	&Ссылка КАК Регистратор,
		|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
		|	&ХозОперация КАК ХозОперация,
		|	ОстаткиМарокЕГАИСОстатки.Справка2 КАК Справка2,
		|	ОстаткиМарокЕГАИСОстатки.КодМарки КАК КодМарки,
		|	ОстаткиМарокЕГАИСОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиМарокЕГАИС.Остатки(&Период, ОрганизацияЕГАИС = &ОрганизацияЕГАИС И Справка2 В (ВЫБРАТЬ ОстаткиМарокЕГАИС.Справка2 ИЗ ОстаткиМарокЕГАИС)) КАК ОстаткиМарокЕГАИСОстатки
		|ГДЕ
		|	ЕСТЬNULL(ОстаткиМарокЕГАИСОстатки.КоличествоОстаток, 0)>0
		|УПОРЯДОЧИТЬ ПО
		|	КодМарки
		|";
	Иначе
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА СУММА(ВложенныйРезультат.Количество) > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	&ДатаРегистрации КАК Период,
		|	&Ссылка КАК Регистратор,
		|	&ОрганизацияЕГАИС КАК ОрганизацияЕГАИС,
		|	&ХозОперация                       КАК ХозОперация,
		|	&Справка2 КАК Справка2,
		|	ВложенныйРезультат.КодМарки КАК КодМарки,
		|	ВЫБОР
		|		КОГДА СУММА(ВложенныйРезультат.Количество) > 0
		|			ТОГДА СУММА(ВложенныйРезультат.Количество)
		|		ИНАЧЕ - СУММА(ВложенныйРезультат.Количество)
		|	КОНЕЦ КАК Количество
		|ИЗ
		|(ВЫБРАТЬ
		|	ОстаткиМарокЕГАИСОстатки.КодМарки КАК КодМарки,
		|	-ОстаткиМарокЕГАИСОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиМарокЕГАИС.Остатки(&Период, &ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РегистрацияОстатковМарокДляСправкиЕГАИС) И ОрганизацияЕГАИС = &ОрганизацияЕГАИС И &ВидСтатуса В (&ВидыСтатусовДвижений) И Справка2 = &Справка2) КАК ОстаткиМарокЕГАИСОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.КодМарки,
		|	1
		|ИЗ
		|	Документ.ОстаткиМарокЕГАИС.Марки КАК ОстаткиЕГАИСОстаткиПоДаннымЕГАИС
		|ГДЕ
		|	ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка = &Ссылка И 
		|	&ВидСтатуса В (&ВидыСтатусовДвижений) И 
		|	&ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РегистрацияОстатковМарокДляСправкиЕГАИС)) КАК ВложенныйРезультат
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйРезультат.КодМарки
		|ИМЕЮЩИЕ
		|	(НЕ СУММА(ВложенныйРезультат.Количество) = 0)
		|УПОРЯДОЧИТЬ ПО
		|	КодМарки
		|";
	КонецЕсли;
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, "ОстаткиМарокЕГАИС");
	
	Возврат ТекстыЗапроса;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	ВариантСписания = 0;
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ВариантСписания);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаОстаткиМарокЕГАИС(ТекстыЗапроса, ВариантСписания);
	
	ИнтеграцияЕГАИС.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ВариантСписания)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеШапки.ДатаРегистрации       КАК Период,
	|	ДанныеШапки.Ссылка                КАК Ссылка,
	|	ДанныеШапки.ОрганизацияЕГАИС      КАК ОрганизацияЕГАИС,
	|	ДанныеШапки.ДатаРегистрации       КАК ДатаРегистрации,
	|	ДанныеШапки.ХозОперация           КАК ХозОперация,
	|	ДанныеШапки.Справка2              КАК Справка2,
	|	СтатусыДокументовЕГАИС.ВидСтатуса КАК ВидСтатуса
	|ИЗ
	|	Документ.ОстаткиМарокЕГАИС КАК ДанныеШапки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|ПО
	|	СтатусыДокументовЕГАИС.Документ = ДанныеШапки.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",               Новый Граница(Реквизиты.Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Ссылка",               Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("ВидСтатуса",           Реквизиты.ВидСтатуса);
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС",     Реквизиты.ОрганизацияЕГАИС);
	Запрос.УстановитьПараметр("ДатаРегистрации",      Реквизиты.ДатаРегистрации);
	Запрос.УстановитьПараметр("ХозОперация",          Реквизиты.ХозОперация);
	Запрос.УстановитьПараметр("Справка2",             Реквизиты.Справка2);
	Запрос.УстановитьПараметр("ВидыСтатусовДвижений", ВидыСтатусовДвижений());
	
	ВариантСписания = 0;
	Если Реквизиты.ХозОперация = Справочники.ХозОперации.ВводОстатковМарокЕГАИС Тогда
		ВариантСписания = 1;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ОстаткиМарокЕГАИС.Справка2,
		|	ОстаткиМарокЕГАИС.КодМарки
		|ПОМЕСТИТЬ
		|	ОстаткиМарокЕГАИС
		|ИЗ
		|	Документ.ОстаткиМарокЕГАИС.Марки КАК ОстаткиМарокЕГАИС
		|ГДЕ
		|	ОстаткиМарокЕГАИС.Ссылка = &Ссылка
		|	 И &ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ВводОстатковМарокЕГАИС)
		|";
		Запрос.Выполнить();
	ИначеЕсли Реквизиты.ХозОперация = Справочники.ХозОперации.СписаниеОстатковМарокЕГАИС Тогда
		ВариантСписания = 2;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ОстаткиМарокЕГАИС.Справка2,
		|	ОстаткиМарокЕГАИС.КодМарки
		|ПОМЕСТИТЬ
		|	ОстаткиМарокЕГАИС
		|ИЗ
		|	Документ.ОстаткиМарокЕГАИС.Марки КАК ОстаткиМарокЕГАИС
		|ГДЕ
		|	ОстаткиМарокЕГАИС.Ссылка = &Ссылка
		|	 И &ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СписаниеОстатковМарокЕГАИС)
		|";
		Запрос.Выполнить();
	ИначеЕсли Реквизиты.ХозОперация = Справочники.ХозОперации.СписаниеОстатковПоСправке2ЕГАИС Тогда
		ВариантСписания = 3;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОстаткиМарокЕГАИС.Справка2
		|ПОМЕСТИТЬ
		|	ОстаткиМарокЕГАИС
		|ИЗ
		|	Документ.ОстаткиМарокЕГАИС.Марки КАК ОстаткиМарокЕГАИС
		|ГДЕ
		|	ОстаткиМарокЕГАИС.Ссылка = &Ссылка
		|	 И &ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СписаниеОстатковПоСправке2ЕГАИС)
		|";
		Запрос.Выполнить();
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();	
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.ОстаткиМарокЕГАИС",
		"МакетОстаткиПоМаркам",
		НСтр("ru = 'Остатки по данным ЕГАИС'"),
		СсылкаНаДокумент);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МакетОстаткиПоМаркам") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"МакетОстаткиПоМаркам",
															НСтр("ru = 'Остатки по данным ЕГАИС'"),
															ПечатьОстаткиПоМаркам(МассивОбъектов, ОбъектыПечати));

	КонецЕсли;

КонецПроцедуры // Печать()

Функция ПечатьОстаткиПоМаркам(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОстаткиМарокЕГАИС_ОстаткиПоМаркам";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	
	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Зададим параметры макета
		ТабличныйДокумент.ПолеСверху = 0;
		ТабличныйДокумент.ПолеСлева  = 0;
		ТабличныйДокумент.ПолеСнизу  = 0;
		ТабличныйДокумент.ПолеСправа = 0;
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		ТаблицаОстатков = Документ.Марки.Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаОстатков", ТаблицаОстатков);
		
	//	Запрос.Текст = "
	//	|ВЫБРАТЬ
	//	|	ВЫРАЗИТЬ(ТаблицаОстатков.СправкаБ КАК Справочник.СправкиБ) КАК СправкаБ,
	//	|	ТаблицаОстатков.КодМарки
	//	|ПОМЕСТИТЬ
	//	|	ТаблицаОстатков
	//	|ИЗ
	//	|	&ТаблицаОстатков КАК ТаблицаОстатков
	//	|;
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ТаблицаОстатков.СправкаБ.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	//	|	ТаблицаОстатков.СправкаБ.АлкогольнаяПродукция.Наименование КАК НаименованиеАлкогольнойПродукции,
	//	|	ТаблицаОстатков.СправкаБ.АлкогольнаяПродукция.Идентификатор КАК Алкокод,
	//	|	ТаблицаОстатков.СправкаБ.АлкогольнаяПродукция.Объем КАК Объем,
	//	|	ТаблицаОстатков.СправкаБ.НомерСправкиА КАК НомерСправкиА,
	//	|	ЕСТЬNULL(СправкиА.Ссылка, ЗНАЧЕНИЕ(Справочник.СправкиА.ПустаяСсылка)) КАК СправкаА,
	//	|	ТаблицаОстатков.СправкаБ КАК СправкаБ,
	//	|	ЕСТЬNULL(СправкиА.ДатаРозлива, ДатаВремя(1,1,1)) КАК ДатаРозлива,
	//	|	ТаблицаОстатков.СправкаБ.НомерТТН КАК НомерТТН,
	//	|	ТаблицаОстатков.СправкаБ.ДатаТТН КАК ДатаТТН,
	//	|	ТаблицаОстатков.СправкаБ.Грузоотправитель КАК Грузоотправитель,
	//	|	ТаблицаОстатков.КодМарки,
	//	|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	//	|	1 КАК Количество
	//	|ИЗ
	//	|	ТаблицаОстатков КАК ТаблицаОстатков
	//	|ЛЕВОЕ СОЕДИНЕНИЕ
	//	|	Справочник.СправкиА КАК СправкиА
	//	|ПО
	//	|	ТаблицаОстатков.СправкаБ.НомерСправкиА = СправкиА.Номер
	//	|ЛЕВОЕ СОЕДИНЕНИЕ
	//	|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	//	|ПО
	//	|	ТаблицаОстатков.СправкаБ.АлкогольнаяПродукция = СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция
	//	|УПОРЯДОЧИТЬ ПО
	//	|	НаименованиеАлкогольнойПродукции
	//	|ИТОГИ
	//	|	СУММА(Количество),
	//	|	МАКСИМУМ(Объем),
	//	|	МАКСИМУМ(НомерСправкиА),
	//	|	МАКСИМУМ(СправкаА),
	//	|	МАКСИМУМ(ДатаРозлива),
	//	|	МАКСИМУМ(НомерТТН),
	//	|	МАКСИМУМ(ДатаТТН),
	//	|	МАКСИМУМ(Грузоотправитель)
	//	|ПО
	//	|	ТаблицаОстатков.СправкаБ.АлкогольнаяПродукция,
	//	|	ТаблицаОстатков.СправкаБ
	//	|";
	//	
	//	МакетОтчета = ЭтотОбъект.ПолучитьМакет("МакетОстаткиПоМаркам");
	//	
	//	ТранспортныйМодуль = ПолучитьТранспортныйМодульПоИдентификатору(ДокументОбъект.ОрганизацияЕГАИС.Идентификатор);
	//	
	//	МакетЗаголовок = МакетОтчета.ПолучитьОбласть("Заголовок");
	//	МакетЗаголовок.Параметры.ДатаОтчета         = ДокументОбъект.ДатаРегистрации;
	//	МакетЗаголовок.Параметры.ТранспортныйМодуль = ТранспортныйМодуль;
	//	
	//	МакетШапка    = МакетОтчета.ПолучитьОбласть("Шапка");
	//	МакетСтрокаАП = МакетОтчета.ПолучитьОбласть("СтрокаАП");
	//	МакетСтрокаБ  = МакетОтчета.ПолучитьОбласть("СтрокаБ");
	//	МакетСтрока   = МакетОтчета.ПолучитьОбласть("Строка");
	//	МакетПодвал   = МакетОтчета.ПолучитьОбласть("Подвал");
	//	
	//	ТабДокумент.Вывести(МакетЗаголовок);
	//	ТабДокумент.Вывести(МакетШапка);
	//	
	//	Запрос.УстановитьПараметр("ТаблицаОстатков", ТаблицаОстатков);
	//	ВыборкаАП = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	Пока ВыборкаАП.Следующий() Цикл
	//		МакетСтрокаАП.Параметры.Заполнить(ВыборкаАП);
	//		
	//		Номенклатура = ПолучитьСоответствующуюНоменклатуруПоАП(ВыборкаАП.АлкогольнаяПродукция);
	//		МакетСтрокаАП.Параметры.Номенклатура = Номенклатура;
	//		//МакетСтрокаАП.Параметры.Артикул      = Номенклатура.Артикул;
	//	ТабДокумент.Вывести(МакетСтрокаАП);
	//	
	//	ВыборкаБ = ВыборкаАП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	Пока ВыборкаБ.Следующий() Цикл
	//		МакетСтрокаБ.Параметры.Заполнить(ВыборкаБ);
	//		ТабДокумент.Вывести(МакетСтрокаБ);
	//		Выборка = ВыборкаБ.Выбрать();
	//		Пока Выборка.Следующий() Цикл
	//			МакетСтрока.Параметры.Заполнить(Выборка);
	//			ТабДокумент.Вывести(МакетСтрока);
	//		КонецЦикла;
	//	КонецЦикла;
	//	
	//КонецЦикла;
	//
	//ТабДокумент.Вывести(МакетПодвал);
	//
	//Возврат ТабДокумент;
	//
	

		//
		//УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент,ОбластьПодвал,,,НомерСтраницы,,Документ);
		
		// Отметим конец области документа.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью команд заполнения объекта
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть не доступны в зависимости от параметров объекта
	ДоступностьКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ДоступностьКоманд;
	
КонецФункции // ПолучитьДоступностьКомандЗаполнения()


#Область ДействияПриОбменеЕГАИС

// Статус после подготовки к передаче данных.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ОстаткиМарокЕГАИС - Ссылка на документ.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - ВидСообщения ЕГАИС.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения) Экспорт
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ЗапросОстатковМарок Тогда
		ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.КПередаче;
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыКПередаче(ДокументСсылка, ВидСтатуса);
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Статус после передачи данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ОстаткиМарокЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * СтатусОбработки - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки) Экспорт
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ЗапросОстатковМарок Тогда
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		
		ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПереданВУТМ;
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеОстатков);
		
		ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи;
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОстатки);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусовБазовыйПроцесс);
		
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Статус после получения данных из ЕГАИС.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ОстаткиМарокЕГАИС - Документ, для которого требуется обновить статус.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения обмена с ЕГАИС.
//  ДополнительныеПараметры - Неопределено, Структура со свойствами:
//   * СтатусОбработки - Перечисление.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения.
//   * ВидСообщенияКвитанции - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения, на которую получена квитанция.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	//ХозОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ХозОперация");
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ОтветНаЗапросОбОстаткахМарок Тогда
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		ВидыСтатусовБазовыйПроцесс.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПолученыОстатки;
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(
			ДокументСсылка,
			Перечисления.СтатусыОбработкиСообщенийЕГАИС.ПринятИзЕГАИС,
			ВидыСтатусовБазовыйПроцесс);
		
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияДоставлена Тогда
		
		ВидыСтатусов = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		ВидыСтатусов.Обрабатывается = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОбрабатываетсяЕГАИС;
		ВидыСтатусов.Ошибка         = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи;
		ВидыСтатусов.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОстатки);
		ВидыСтатусов.КвитанцияВыполнена              = Ложь;
		ВидыСтатусов.УведомлениеОРегистрацииДвижения = Ложь;
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыПриПолученииКвитанции(
				ДокументСсылка,
				"КвитанцияДоставлена", ДополнительныеПараметры.СтатусОбработки,
				ВидыСтатусов, Истина);
		
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Обновить статус после подготовки к передаче данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ОстаткиМарокЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обновить статус после передачи данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ОстаткиМарокЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обновить статус после получения данных из ЕГАИС.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ОстаткиМарокЕГАИС - Документ, для которого требуется обновить статус.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения обмена с ЕГАИС.
//  ДополнительныеПараметры - Неопределено, Структура со свойствами:
//   * СтатусОбработки - Перечисление.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения.
//   * ВидСообщенияКвитанции - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения, на которую получена квитанция.
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Получить последовательность операций в течении жизненного цикла документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ОстаткиМарокЕГАИС - Документ, для которого требуется обновить статус.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. функцию ИнтеграцияЕГАИС.ПустаяТаблицаПоследовательностьОпераций().
//
Функция ПоследовательностьОпераций(ДокументСсылка) Экспорт
	
	ХозОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ХозОперация");
	
	Таблица = ИнтеграцияЕГАИС.ПустаяТаблицаПоследовательностьОпераций();
	
	Исходящее = Перечисления.ВходящееИсходящееСобытие.Исходящее;
	Входящее  = Перечисления.ВходящееИсходящееСобытие.Входящее;
	
	Если ХозОперация = Справочники.ХозОперации.РегистрацияОстатковМарокДляСправкиЕГАИС Тогда
		ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0, Исходящее, Перечисления.ВидыОбъектовЕГАИС.ЗапросОстатковМарок, ДокументСсылка);
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

// Выполнить перерасчет статуса.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ОстаткиМарокЕГАИС - Документ, по которому требуется рассчитать статус оформления.
//  ПредыдущийСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиЕГАИС - Предыдущий статус.
//  НовыйСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиЕГАИС - Предыдущий статус.
// 
//Процедура РассчитатьСтатусОформления(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус) Экспорт
//	
//	Если КонечныеСтатусы().Найти(НовыйСтатус) = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ЗначенияРеквизитов = СтруктураРеквизитыРасчетаСтатусаОформления();
//	
//	//Если ТипЗнч(Источник) = Тип("ДокументОбъект.ОстаткиМарокЕГАИС")
//	//	Или ТипЗнч(Источник) = Тип("ДокументСсылка.ОстаткиМарокЕГАИС") Тогда
//	//	
//	//	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ОстаткиМарокЕГАИС") Тогда
//	//		ИсточникСсылка = Источник.ДокументОснование;
//	//	Иначе
//	//		ИсточникСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "ДокументОснование");
//	//	КонецЕсли;
//	//	
//	//	Если ЗначениеЗаполнено(ИсточникСсылка) Тогда
//	//		
//	//		Запрос = Новый Запрос(
//	//		"ВЫБРАТЬ
//	//		|	Таблица.Проведен      КАК Проведен,
//	//		|	Таблица.Дата          КАК Дата,
//	//		|	Таблица.Номер         КАК Номер,
//	//		|	Таблица.Организация   КАК Организация,
//	//		|	Таблица.ПодразделениеКомпании КАК ПодразделениеКомпании,
//	//		|	Таблица.Автор КАК Автор
//	//		|ИЗ
//	//		|	" + ИсточникСсылка.Метаданные().ПолноеИмя() + " КАК Таблица
//	//		|ГДЕ
//	//		|	Таблица.Ссылка = &Ссылка");
//	//		
//	//		Запрос.УстановитьПараметр("Ссылка", ИсточникСсылка);
//	//		Выборка = Запрос.Выполнить().Выбрать();
//	//		Выборка.Следующий();
//	//		
//	//		ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, Выборка);
//	//		
//	//	КонецЕсли;
//	//	
//	//Иначе
//	//	
//	//	ИсточникСсылка = Источник.Ссылка;
//	//	
//	//	ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, Источник);
//	//	
//	//	ЗначенияРеквизитов.Организация     = Источник.Организация;
//	//	ЗначенияРеквизитов.ПодразделениеКомпании = Источник.ПодразделениеКомпании;
//	//	
//	//КонецЕсли;
//	
//	Если Не ЗначениеЗаполнено(ИсточникСсылка) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	//ЗаписьТребуется = ТребуетсяОформлениеДокументовЕГАИС(
//	//ИсточникСсылка,
//	//Метаданные.Документы.ОстаткиМарокЕГАИС);
//	//
//	//ИнтеграцияЕГАИС.РассчитатьСтатусОформления(
//	//Метаданные.Документы.ОстаткиМарокЕГАИС,
//	//ИсточникСсылка, ЗначенияРеквизитов, ЗаписьТребуется);
//	
//КонецПроцедуры

// Обработчик изменения статуса документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ОстаткиМарокЕГАИС - Документ.
//  ПредыдущийСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиЕГАИС - Предыдущий статус.
//  НовыйСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиЕГАИС - Предыдущий статус.
//  ПараметрыОбновленияСтатуса - Структура - см. функцию ИнтеграцияЕГАИС.ПараметрыОбновленияСтатуса().
//
Процедура ПриИзмененииСтатусаДокумента(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус, ПараметрыОбновленияСтатуса) Экспорт
	
	ВидыСтатусовДвижений = ВидыСтатусовДвижений();
	
	ДобавитьДвижения = ИнтеграцияЕГАИС.СтатусТребуетДобавленияДвижений(ВидыСтатусовДвижений, ПредыдущийСтатус, НовыйСтатус);
	УдалитьДвижения = ИнтеграцияЕГАИС.СтатусТребуетУдаленияДвижений(ВидыСтатусовДвижений, ПредыдущийСтатус, НовыйСтатус);
	
	Если ПараметрыОбновленияСтатуса.ОбновлятьДвижения
		И (ДобавитьДвижения Или УдалитьДвижения) Тогда
		
		ДополнительныеСвойстваДляПроведения = Новый Структура;
		ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, ДополнительныеСвойстваДляПроведения);
		
		ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойстваДляПроведения);
		
		НаборЗаписей = РегистрыНакопления.ОстаткиМарокЕГАИС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписей.Загрузить(ДополнительныеСвойстваДляПроведения.ТаблицыДляДвижений["ОстаткиМарокЕГАИС"]);
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	//РассчитатьСтатусОформления(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус);
	
КонецПроцедуры

#КонецОбласти

#Область Статусы

// Возвращает статусы ошибок.
//
// Возвращаемое значение:
//  Массив - Статусы ошибок.
//
Функция ВидыСтатусовОшибки() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи);
	
	Возврат ВидыСтатусов;
	
КонецФункции

// Возвращает конечные статусы.
//
// Возвращаемое значение:
//  Массив - Конечные статусы.
//
Функция КонечныеВидыСтатусов() Экспорт
	
	ВидыСтатусов = Новый Массив;
	
	Возврат ВидыСтатусов;
	
КонецФункции

// Возвращает статусы движений.
//
// Возвращаемое значение:
//  Массив - Статусы.
//
Функция ВидыСтатусовДвижений() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ПолученыОстатки);
	
//	Статусы = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусыОбработки(Метаданные.Документы.ОстаткиМарокЕГАИС, ВидыСтатусов);
	
	Возврат ВидыСтатусов;
	
КонецФункции

#КонецОбласти

Функция СообщениеКПередачеXML(ДокументСсылка, ДальнейшееДействие, ДополнительныеПараметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОстаткиМарокЕГАИС.ХозОперация,
	|	ОстаткиМарокЕГАИС.ОрганизацияЕГАИС,
	|	ОстаткиМарокЕГАИС.ОрганизацияЕГАИС.Код КАК ИдентификаторФСРАР,
	|	ОстаткиМарокЕГАИС.Справка2.Номер КАК НомерСправки2
	|ИЗ
	|	Документ.ОстаткиМарокЕГАИС КАК ОстаткиМарокЕГАИС
	|ГДЕ
	|	ОстаткиМарокЕГАИС.Ссылка = &Ссылка И 
	|	ОстаткиМарокЕГАИС.ПометкаУдаления = ЛОЖЬ
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		
		ПараметрыЗапроса = ПараметрыОбъектов[Перечисления.ВидыОбъектовЕГАИС.ЗапросОстатковМарок];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	Если Выборка.ХозОперация = Справочники.ХозОперации.РегистрацияОстатковМарокДляСправкиЕГАИС Тогда
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ЗапросОстатковМарок;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ФОРМА2", Выборка.НомерСправки2);
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ИдентификаторФСРАР", Выборка.ИдентификаторФСРАР);
	ДанныеДляВыгрузки.Вставить("Объект",             ДокументСсылка);
	ДанныеДляВыгрузки.Вставить("ШапкаДокумента",     Выборка);
	ДанныеДляВыгрузки.Вставить("ПараметрыЗапроса",   ПараметрыЗапроса);
	
	СообщенияXML = ИнтеграцияЕГАИС.СформироватьСообщенияXML(ВидСообщения, ДанныеДляВыгрузки, 2);
	
	Возврат СообщенияXML;
	
КонецФункции

#КонецЕсли
