#Область ПрограммныйИнтерфейс

// См. процедуру ОбщегоНазначенияКлиентПереопределяемый.ПриНачалеРаботыСистемы().
//
Процедура ПриНачалеРаботыСистемы(Параметры) Экспорт
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыРаботыКлиента, "ПоказатьНачалоРаботы", Ложь) Тогда
		Параметры.Вставить("ИнтерактивнаяОбработка",
			Новый ОписаниеОповещения("ИнтерактивнаяОбработкаЗапросЛицензионногоСоглашения", ЭтотОбъект));
	КонецЕсли;
	
КонецПроцедуры

// См. процедуру ОбщегоНазначенияКлиентПереопределяемый.ПослеНачалаРаботыСистемы.
//
Процедура ПослеНачалаРаботыСистемы() Экспорт
	
	//ЭтоМобильныйКлиент = Ложь;
	//
	//#Если МобильныйКлиент Тогда
	//	ЭтоМобильныйКлиент = Истина;
	//#КонецЕсли
	//
	//СтруктураПараметров = Новый Структура();
	//СтруктураПараметров.Вставить("ЭтоМобильныйКлиент", ЭтоМобильныйКлиент);
	//СтруктураПараметров.Вставить("ПоказыватьСтартовыйПомощникКЭДО", Ложь);
	//
	//ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	//
	//Если ПараметрыРаботыКлиента.Свойство("ПоказыватьСтартовыйПомощникКЭДО")
	//	И ПараметрыРаботыКлиента.ПоказыватьСтартовыйПомощникКЭДО Тогда
	//	СтруктураПараметров.Вставить("ПоказыватьСтартовыйПомощникКЭДО", Истина);
	//КонецЕсли;
	//
	//ТребуетсяОбновлениеИнтерфейса = Ложь;
	//ТорговыйКомплексЭДОВызовСервера.НастроитьИнтерфейс(СтруктураПараметров, ТребуетсяОбновлениеИнтерфейса);

	//Если ТребуетсяОбновлениеИнтерфейса Тогда
	//	ОбновитьИнтерфейс();
	//КонецЕсли;
	
КонецПроцедуры

// Возвращает фильтр, используемый для выбора файлов-изображений.
//
// Возвращаемое значение:
//  Строка - строка, содержащая фильтр для файлов-изображений.
//
Функция ФильтрФайловИзображений() Экспорт
	Возврат НСтр("ru = 'Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf"
		                            + "|Все файлы(*.*)|*.*"
		                            + "|Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle"
		                            + "|Формат GIF(*.gif*)|*.gif"
		                            + "|Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg"
		                            + "|Формат PNG(*.png*)|*.png"
		                            + "|Формат TIFF(*.tif)|*.tif"
		                            + "|Формат icon(*.ico)|*.ico"
		                            + "|Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf'");
КонецФункции

// Показывает диалог с вопросом о разрешении редактирования реквизитов объекта.
//
// Параметры:
//  Оповещение  - ОписаниеОповещения - Описание процедуры, принимающей результат выбора.
//  Ссылка - ДокументСсылка - Документ, о котором должен быть задан вопрос.
//
Процедура ПоказатьВопросОРазрешенииРедактированияРеквизитовОбъекта(Оповещение, Ссылка) Экспорт
	
	ТекстВопроса = СтрШаблон(НСтр("ru = '%1 был создан по электронному документу.
		|Не рекомендуется разрешать редактирование из-за риска рассогласования данных.'"), Ссылка);
		
	ЗаголовокДиалога = НСтр("ru = 'Разрешение редактирования реквизитов'");
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Разрешить редактирование'"));
	Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Отмена'"));
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки,, КодВозвратаДиалога.Нет, ЗаголовокДиалога);
	
КонецПроцедуры

// Выполняет поиск номенклатуры по штрих-коду в регистре сведений "Штрихкоды" и в сервисе 1С:Номенклатура.
//
// Параметры:
//  Оповещение  - ОписаниеОповещения - Описание процедуры, принимающей результат поиска.
//  ВыборПриСовпадении - Булево - открывать форму выбора номенклатуры, если найдено несколько совпадений.
//
Процедура ПоискНоменклатурыПоШтрихкоду(Оповещение, ВыборПриСовпадении = Ложь) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОРезультате", Оповещение);
	Контекст.Вставить("ВыборПриСовпадении", ВыборПриСовпадении);
	
	Штрихкод = Неопределено;
	Если Оповещение.ДополнительныеПараметры <> Неопределено
		И Оповещение.ДополнительныеПараметры.Свойство("Штрихкод", Штрихкод)
		И ЗначениеЗаполнено(Штрихкод) Тогда
		
		ПоискНоменклатурыПоШтрихкодуПослеВводаСтроки(Штрихкод, Контекст);
	Иначе
		ОповещениеПослеВводаСтроки = Новый ОписаниеОповещения("ПоискНоменклатурыПоШтрихкодуПослеВводаСтроки",
			ЭтотОбъект, Контекст);
		ПоказатьВводСтроки(ОповещениеПослеВводаСтроки, "", НСтр("ru = 'Введите штрихкод'"));
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает отбор динамического списка по штрих-коду.
//
// Параметры:
//  Оповещение  - ОписаниеОповещения - Описание процедуры, принимающей результат поиска.
//  ДинамическийСписок - ДинамическийСписок - реквизит формы, для которого требуется установить отбор.
//
Процедура УстановитьОтборПоШтрихкоду(Оповещение, ДинамическийСписок) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОРезультате", Оповещение);
	Контекст.Вставить("ДинамическийСписок", ДинамическийСписок);
	
	Оповещение = Новый ОписаниеОповещения("УстановитьОтборПоШтрихкодуПослеПоиска", ЭтотОбъект, Контекст);
	ПоискНоменклатурыПоШтрихкоду(Оповещение);
	
КонецПроцедуры

// Открывает форму выбора / заполнения кодов маркировки.
//
// Параметры:
//  Форма				 - ФормаКлиентскогоПриложения - объект формы, из которой нужно открыть форму выбора / заполнения кодов.
//  СтандартнаяОбработка - Булево - стандартный параметр обработчика события элемента формы, из которого происходит выбор.
//  ИмяЭлементаФормы	 - Строка - имя элемента формы (таблицы), в котором хранятся сведения по товарам.
//  ТолькоПросмотр		 - Булево - если нужно открыть форму в режиме просмотра, нужно передать значение Истина.
//
Процедура ВыбратьКодыМаркировки(Форма, СтандартнаяОбработка, ИмяЭлементаФормы = "Товары", ТолькоПросмотр = Ложь) Экспорт

	СтандартнаяОбработка = Ложь;
	Элемент = Форма.Элементы[ИмяЭлементаФормы];
	ПараметрыВыбораКодов = Новый Структура;

	Тип = ТипЗнч(Форма.Объект.Ссылка);
	Если ТолькоПросмотр Или Тип = Тип("ДокументСсылка.АктОРасхожденияхПоОтгрузке") Тогда
		ПараметрыВыбораКодов.Вставить("ТолькоПросмотр", Истина);
	Иначе
		ПараметрыВыбораКодов.Вставить("ТолькоПросмотр", Ложь);
	КонецЕсли;

	ИменаТаблицМаркировкиАктаОРасхождениях = ТорговыйКомплексЭДОКлиентСервер.ИменаТаблицМаркировкиАктаОРасхождениях();

	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если Тип = Тип("ДокументСсылка.АктОРасхожденияхПоОтгрузке")
		Или Тип = Тип("ДокументСсылка.АктОРасхожденияхПоПоставке") Тогда
		
		ПараметрыВыбораКодов.Вставить("ЭтоАктОРасхождениях");
		
		Для Каждого ИмяТаблицы Из ИменаТаблицМаркировкиАктаОРасхождениях Цикл
			ПараметрыВыбораКодов.Вставить(ИмяТаблицы, ТекущиеДанные[ИмяТаблицы].ВыгрузитьЗначения());
		КонецЦикла;
	Иначе
		ПараметрыВыбораКодов.Вставить("КодыУпаковокМаркируемойПродукции",
			ТекущиеДанные.КодыУпаковокМаркируемойПродукции.ВыгрузитьЗначения());
	КонецЕсли;

	ПараметрыВыбораКодов.Вставить("Номенклатура", ТекущиеДанные.Номенклатура);
	ПараметрыВыбораКодов.Вставить("Количество", ТекущиеДанные.Количество);
	
	Если ТолькоПросмотр Тогда
		ОписаниеОповещения = Неопределено;
	Иначе
		ДополнительныеПараметры = Новый Структура("Элемент, Форма", Элемент, Форма);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьКодыМаркировкиПослеВыбора", ЭтотОбъект,
			ДополнительныеПараметры);
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ВыборКодовМаркировки", ПараметрыВыбораКодов, Элемент, Форма.УникальныйИдентификатор,,,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

// Обработчик события "ПриНачалеРедактирования" элемента формы (таблицы), хранящего данные товаров.
//
// Параметры:
//  Элемент		 - ПолеФормы - элемент управления формы (таблица), в котором хранятся сведения по товарам.
//  НоваяСтрока	 - Булево - смотри одноименный параметр события "ПриНачалеРедактирования".
//  Копирование	 - Булево - смотри одноименный параметр события "ПриНачалеРедактирования".
//
Процедура ИдентификаторыСтрокПриНачалеРедактированияТаблицы(Элемент, НоваяСтрока, Копирование) Экспорт

	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если НоваяСтрока И ТекущиеДанные.Свойство("ИдентификаторСтроки") Тогда
		ТорговыйКомплексЭДОКлиентСервер.ЗаполнитьИдентификаторСтроки(ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры

// См. ОбменСКонтрагентамиКлиентПереопределяемый.СоздатьКонтрагентаИнтерактивно
Процедура СоздатьКонтрагентаИнтерактивно(РеквизитыКонтрагента, ОписаниеОповещенияОСозданииКонтрагента) Экспорт
	
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование", РеквизитыКонтрагента.Наименование);
	СтруктураЗаполнения.Вставить("НаименованиеПолное", РеквизитыКонтрагента.Наименование);
	СтруктураЗаполнения.Вставить("ИНН", РеквизитыКонтрагента.ИНН);
	СтруктураЗаполнения.Вставить("КПП", РеквизитыКонтрагента.КПП);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СтруктураЗаполнения", СтруктураЗаполнения);
	
	ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("ОписаниеОповещенияОСозданииКонтрагента", ОписаниеОповещенияОСозданииКонтрагента);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения(Неопределено,, ДополнительныеПараметры);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента", ПараметрыФормы,,,,, ОписаниеОповещенияОСозданииКонтрагента);
	
КонецПроцедуры

// См. ОбменСКонтрагентамиКлиентПереопределяемый.ВыбратьКонтрагента
Процедура ВыбратьКонтрагента(РеквизитыОтбораКонтрагента, ОписаниеОповещенияОЗакрытии) Экспорт
	
	Отбор = Новый Структура;
	Если ЗначениеЗаполнено(РеквизитыОтбораКонтрагента.Наименование) Тогда
		Отбор.Вставить("Наименование", РеквизитыОтбораКонтрагента.Наименование);
	КонецЕсли;
	Если ЗначениеЗаполнено(РеквизитыОтбораКонтрагента.ИНН) Тогда
		Отбор.Вставить("ИНН", РеквизитыОтбораКонтрагента.ИНН);
	КонецЕсли;
	Если ЗначениеЗаполнено(РеквизитыОтбораКонтрагента.КПП) Тогда
		Отбор.Вставить("КПП", РеквизитыОтбораКонтрагента.КПП);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);

	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы,,,,, ОписаниеОповещенияОЗакрытии)
	
КонецПроцедуры

#Область СозданиеНовогоКонтрагентаПриВводе

// Обработчик события "АвтоПодбор" элемента формы (Поле ввода), хранящего данные контрагента.
//
// Параметры:
//  Элемент					 - ПолеФормы - элемент управления формы (Поле ввода), в котором хранится ссылка на контрагента.
//  Текст					 - Строка - смотри одноименный параметр события "АвтоПодбор".
//  ДанныеВыбора			 - СписокЗначений - смотри одноименный параметр события "АвтоПодбор".
//  ПараметрыПолученияДанных - Структура - смотри одноименный параметр события "АвтоПодбор".
//  Ожидание				 - Число - смотри одноименный параметр события "АвтоПодбор".
//  СтандартнаяОбработка	 - Булево - смотри одноименный параметр события "АвтоПодбор".
//
Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) Экспорт
	
	Если НЕ ПустаяСтрока(Текст) 
		И (НЕ ЗначениеЗаполнено(Элемент.ОграничениеТипа)
		ИЛИ Элемент.ОграничениеТипа.СодержитТип(Тип("СправочникСсылка.Контрагенты"))) Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ТорговыйКомплексЭДОВызовСервера.ДанныеВыбораКонтрагента(ПараметрыПолученияДанных, Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ОкончаниеВводаТекста" элемента формы (Поле ввода), хранящего данные контрагента.
//
// Параметры:
//  Элемент					 - ПолеФормы - элемент управления формы (Поле ввода), в котором хранится ссылка на контрагента.
//  Текст					 - Строка - смотри одноименный параметр события "ОкончаниеВводаТекста".
//  ДанныеВыбора			 - СписокЗначений - смотри одноименный параметр события "ОкончаниеВводаТекста".
//  ПараметрыПолученияДанных - Структура - смотри одноименный параметр события "ОкончаниеВводаТекста".
//  СтандартнаяОбработка	 - Булево - смотри одноименный параметр события "ОкончаниеВводаТекста".
//
Процедура КонтрагентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка) Экспорт
	
	Если НЕ ПустаяСтрока(Текст) 
		И (НЕ ЗначениеЗаполнено(Элемент.ОграничениеТипа)
		ИЛИ Элемент.ОграничениеТипа.СодержитТип(Тип("СправочникСсылка.Контрагенты"))) Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ТорговыйКомплексЭДОВызовСервера.ДанныеВыбораКонтрагента(ПараметрыПолученияДанных, Истина);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ОбработкаВыбора" элемента формы (Поле ввода), хранящего данные контрагента.
//
// Параметры:
//  Элемент				 - ПолеФормы - элемент управления формы (Поле ввода), в котором хранится ссылка на контрагента.
//  ВыбранноеЗначение	 - Произвольный - смотри одноименный параметр события "ОбработкаВыбора".
//  СтандартнаяОбработка - Булево - смотри одноименный параметр события "ОбработкаВыбора".
//
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") 
		И НЕ ПустаяСтрока(ВыбранноеЗначение)
		И (НЕ ЗначениеЗаполнено(Элемент.ОграничениеТипа)
		ИЛИ Элемент.ОграничениеТипа.СодержитТип(Тип("СправочникСсылка.Контрагенты"))) Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора",     Истина);
		ПараметрыФормы.Вставить("ТекстЗаполнения", ВыбранноеЗначение);
		ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", ПараметрыФормы, Элемент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеНовойНоменклатурыПриВводе

// Обработчик события "АвтоПодбор" элемента формы (Поле ввода), хранящего данные номенклатуры.
//
// Параметры:
//  Элемент					 - ПолеФормы - элемент управления формы (Поле ввода), в котором хранится ссылка на контрагента.
//  Текст					 - Строка - смотри одноименный параметр события "АвтоПодбор".
//  ДанныеВыбора			 - СписокЗначений - смотри одноименный параметр события "АвтоПодбор".
//  ПараметрыПолученияДанных - Структура - смотри одноименный параметр события "АвтоПодбор".
//  Ожидание				 - Число - смотри одноименный параметр события "АвтоПодбор".
//  СтандартнаяОбработка	 - Булево - смотри одноименный параметр события "АвтоПодбор".
//
Процедура НоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) Экспорт
	
	Если ЗначениеЗаполнено(Текст) Тогда
		ПараметрыПолученияДанных.Отбор.Вставить("ИскатьВСервисе", Истина);
		ПараметрыПолученияДанных.РежимПолученияДанныхВыбора = РежимПолученияДанныхВыбораПриВводеПоСтроке.Фоновый;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ОкончаниеВводаТекста" элемента формы (Поле ввода), хранящего данные номенклатуры.
//
// Параметры:
//  Элемент					 - ПолеФормы - элемент управления формы (Поле ввода), в котором хранится ссылка на контрагента.
//  Текст					 - Строка - смотри одноименный параметр события "ОкончаниеВводаТекста".
//  ДанныеВыбора			 - СписокЗначений - смотри одноименный параметр события "ОкончаниеВводаТекста".
//  ПараметрыПолученияДанных - Структура - смотри одноименный параметр события "ОкончаниеВводаТекста".
//  СтандартнаяОбработка	 - Булево - смотри одноименный параметр события "ОкончаниеВводаТекста".
//
Процедура НоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка) Экспорт
	
	Если ЗначениеЗаполнено(Текст) Тогда
		ПараметрыПолученияДанных.Отбор.Вставить("ИскатьВСервисе", Истина);
		ПараметрыПолученияДанных.РежимПолученияДанныхВыбора = РежимПолученияДанныхВыбораПриВводеПоСтроке.Фоновый;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ОбработкаВыбора" элемента формы (Поле ввода), хранящего данные номенклатуры.
//
// Параметры:
//  Элемент				 - ПолеФормы - элемент управления формы (Поле ввода), в котором хранится ссылка на контрагента.
//  ВыбранноеЗначение	 - Произвольный - смотри одноименный параметр события "ОбработкаВыбора".
//  СтандартнаяОбработка - Булево - смотри одноименный параметр события "ОбработкаВыбора".
//
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	ТипЗначения = ТипЗнч(ВыбранноеЗначение);
	Если ТипЗначения = Тип("Строка") И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("ТекстЗаполнения", ВыбранноеЗначение);
		ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", ПараметрыФормы, Элемент);
		
	ИначеЕсли ТипЗначения = Тип("Структура") Тогда
		
		Форма = Элемент.Родитель;
		Пока ТипЗнч(Форма) <> Тип("ФормаКлиентскогоПриложения") Цикл
			Форма = Форма.Родитель;
		КонецЦикла;
		
		ДанныеНоменклатуры = ТорговыйКомплексЭДОВызовСервера.ДанныеНоменклатурыСервиса(
			ВыбранноеЗначение.Идентификатор, Форма.УникальныйИдентификатор);
		
		Если ДанныеНоменклатуры.Загружена Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Номенклатура сервиса ""%1"" уже сопоставлена с номенклатурой ""%2"".'"),
				ВыбранноеЗначение.Наименование, ДанныеНоменклатуры.Ссылка);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ДанныеНоменклатуры.Ссылка);
			ВыбранноеЗначение = ДанныеНоменклатуры.Ссылка;
			Возврат;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		
		Контекст = Новый Структура("Элемент", Элемент);
		Оповещение = Новый ОписаниеОповещения(
			"НоменклатураОбработкаВыбораПослеПолученияДанныхИзСервиса", ЭтотОбъект, Контекст);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДанныеНоменклатуры.ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЭтапыГрафикаОплат

Процедура УстановитьОформлениеЭтаповГрафикаОплат(Форма) Экспорт
	
	ИспользуетсяМногоэтапныйГрафикОплаты = Форма.ИспользуетсяМногоэтапныйГрафикОплаты;
	Элементы = Форма.Элементы;
	
	ТипГрафикаОплаты = ?(ИспользуетсяМногоэтапныйГрафикОплаты, НСтр("ru = 'списком'"), НСтр("ru = 'простой'"));
	ТекстHTML = СтрШаблон(
			НСтр("ru = 'График оплаты, <a href = ""ИзменитьРежимРедактированияГрафикаОплаты"">%1</a>'"), ТипГрафикаОплаты);
	ТекстЗаголовкаГрафикаОплат = СтроковыеФункцииКлиент.ФорматированнаяСтрока(ТекстHTML);
	
	// Пометка кнопки "Список" графика оплат
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ДекорацияЗаголовокГрафикОплаты", "Заголовок", ТекстЗаголовкаГрафикаОплат);
	
	ТорговыйКомплексЭДОКлиентСервер.УстановитьОформлениеЭтаповГрафикаОплат(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ВводСчетаФактуры

// Вводит документ счет-фактуру на основании текущего документа.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//  * Объект - ДокументОбъект
//
Процедура ВвестиСчетФактуру(Форма) Экспорт
	
	Если НЕ Форма.Объект.Проведен ИЛИ Форма.Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Ввод счета-фактуры возможен только после проведения документа,
			|Выполнить проведение документа и продолжить?'");
		Контекст = Новый Структура("Форма", Форма);
		Обработчик = Новый ОписаниеОповещения(
			"ВвестиСчетФактуруПослеПодтверждениеПроведения", ТорговыйКомплексЭДОКлиент, Контекст);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Обработчик, ТекстВопроса, Кнопки);
	Иначе
		ВвестиСчетФактуруПослеПроведения(Форма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СведенияПрослеживаемости

Процедура ВвестиРНПТ(ТекущиеДанные, СведенияПрослеживаемости, Корректировка = Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимКорректировки", Корректировка);
	ПараметрыФормы.Вставить("Номенклатура", ТекущиеДанные.Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", ТекущиеДанные.Характеристика);
	ПараметрыФормы.Вставить("ЕдиницаИзмерения", ТекущиеДанные.ЕдиницаИзмерения);
	ПараметрыФормы.Вставить("КоличествоУпаковок", ТекущиеДанные.КоличествоУпаковок);
	ПараметрыФормы.Вставить("СведенияПрослеживаемостиТовара", Новый Массив);
	
	Отбор = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
	НаборСведенийПоОтбору = СведенияПрослеживаемости.НайтиСтроки(Отбор);
	Для Каждого СтрокаСведений Из НаборСведенийПоОтбору Цикл
		СведенияПартииТовара = ТорговыйКомплексЭДОКлиентСервер.НовыеСведенияПрослеживаемостиПартииТовара();
		ЗаполнитьЗначенияСвойств(СведенияПартииТовара, СтрокаСведений);
		ПараметрыФормы.СведенияПрослеживаемостиТовара.Добавить(СведенияПартииТовара);
	КонецЦикла;
	
	Контекст = Новый Структура;
	Контекст.Вставить("ТекущиеДанные", ТекущиеДанные);
	Контекст.Вставить("НаборСведенийПоОтбору", НаборСведенийПоОтбору);
	Контекст.Вставить("СведенияПрослеживаемости", СведенияПрослеживаемости);
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьРезультатВводаСведенийПрослеживаемости", ТорговыйКомплексЭДОКлиент, Контекст);
	
	ОткрытьФорму("ОбщаяФорма.ВводРНПТ", ПараметрыФормы,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Асинхронная процедура.
Процедура ИнтерактивнаяОбработкаЗапросЛицензионногоСоглашения(Параметры, Контекст) Экспорт
	
	ОткрытьФорму("Обработка.НачалоРаботыКЭДО.Форма.ЛицензионноеСоглашение", , , , , ,
		Новый ОписаниеОповещения("ПослеЗакрытияФормыЗапросаЛицензионногоСоглашения", ЭтотОбъект, Параметры));
	
КонецПроцедуры

// Асинхронная процедура.
Процедура ПослеЗакрытияФормыЗапросаЛицензионногоСоглашения(Результат, Параметры) Экспорт
	
	Если Результат <> Истина Тогда
		Параметры.Отказ = Истина;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Параметры.ОбработкаПродолжения);
	
КонецПроцедуры

// Асинхронная процедура.
Процедура ПоискНоменклатурыПоШтрихкодуПослеВводаСтроки(ШтрихКод, Контекст) Экспорт
	
	Если ШтрихКод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контекст.Вставить("ШтрихКод", ШтрихКод);
	
	КонтекстОповещенияОРезультате = Контекст.ОповещениеОРезультате.ДополнительныеПараметры;
	Если КонтекстОповещенияОРезультате <> Неопределено
		И КонтекстОповещенияОРезультате.Свойство("Штрихкод")
		И НЕ ЗначениеЗаполнено(КонтекстОповещенияОРезультате.Штрихкод) Тогда
		КонтекстОповещенияОРезультате.Штрихкод = ШтрихКод;
	КонецЕсли;
	
	НоменклатураПоШтрихкоду = ТорговыйКомплексЭДОВызовСервера.НоменклатураПоШтрихкоду(ШтрихКод);
	
	Если НоменклатураПоШтрихкоду = Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("ПоискНоменклатурыПоШтрихкодуПослеДобавленияИзСервиса", ЭтотОбъект, Контекст);
		ТорговыйКомплексРаботаСНоменклатуройКлиент.ПоискНоменклатурыПоШтрихкодуВСервисе(Оповещение, ШтрихКод);
	Иначе
		ПоискНоменклатурыПоШтрихкодуЗавершение(НоменклатураПоШтрихкоду, Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Асинхронная процедура.
Процедура ПоискНоменклатурыПоШтрихкодуПослеДобавленияИзСервиса(Результат, Контекст) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат.Количество() = 0 Тогда
		ПоискНоменклатурыПоШтрихкодуЗавершение(Неопределено, Контекст);
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("ШтрихкодыНоменклатуры") Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОРезультате, Результат.ШтрихкодыНоменклатуры);	
	КонецЕсли;
		
КонецПроцедуры

Процедура ПоискНоменклатурыПоШтрихкодуЗавершение(НоменклатураПоШтрихкоду, Контекст)
	
	Если НоменклатураПоШтрихкоду = Неопределено Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОРезультате, Неопределено);
		Возврат;
	КонецЕсли;
	
	Если НоменклатураПоШтрихкоду.Количество() > 1 Тогда
		
		Если Контекст.ВыборПриСовпадении Тогда
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("Штрихкод", Контекст.Штрихкод);
			
			НоваяФорма = ОткрытьФорму("ОбщаяФорма.ВыборНоменклатурыИзСписка",
				ПараметрыОткрытия,
				ЭтотОбъект,
				,,,
				Контекст.ОповещениеОРезультате,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НоменклатураПоШтрихкоду, НоваяФорма.Список);
		Иначе
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОРезультате, НоменклатураПоШтрихкоду);
		КонецЕсли;
		
	Иначе
		
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОРезультате, НоменклатураПоШтрихкоду[0]);
		
	КонецЕсли;
	
КонецПроцедуры

// Асинхронная процедура.
Процедура УстановитьОтборПоШтрихкодуПослеПоиска(Результат, Контекст) Экспорт
	
	ОтборУстановлен = Ложь; 
	
	Если Результат <> Неопределено Тогда
		
		Если ТипЗнч(Результат) = Тип("Массив") Тогда
			Сравнение = ВидСравненияКомпоновкиДанных.ВСписке;
			ОтборНоменклатуры = Новый Массив;
			Для Каждого ЭлементКоллекции Из Результат Цикл
				ОтборНоменклатуры.Добавить(ЭлементКоллекции.Номенклатура);
			КонецЦикла;
		Иначе
			Сравнение = ВидСравненияКомпоновкиДанных.Равно;
			ОтборНоменклатуры = Результат.Номенклатура;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Контекст.ДинамическийСписок, "Ссылка", ОтборНоменклатуры, Сравнение);
		
		ОтборУстановлен = Истина;
		
	КонецЕсли;
	
	Если Контекст.ОповещениеОРезультате <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОРезультате, ОтборУстановлен);
	КонецЕсли;
	
КонецПроцедуры

// Асинхронная процедура.
Процедура ВыбратьКодыМаркировкиПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Элемент = ДополнительныеПараметры.Элемент;
		Форма   = ДополнительныеПараметры.Форма;
		ТекущиеДанныеКоллекции = Элемент.ТекущиеДанные;

		Если ПустаяСтрока(ТекущиеДанныеКоллекции.ИдентификаторСтроки) Тогда
			ТорговыйКомплексЭДОКлиентСервер.ЗаполнитьИдентификаторСтроки(ТекущиеДанныеКоллекции);
		КонецЕсли;

		Тип = ТипЗнч(Форма.Объект.Ссылка);
		Если Тип = Тип("ДокументСсылка.АктОРасхожденияхПоПоставке")
			Или Тип = Тип("ДокументСсылка.АктОРасхожденияхПоОтгрузке") Тогда
			
			ВсеКодыМаркировки = Новый Массив;
			
			ИменаТаблиц = ТорговыйКомплексЭДОКлиентСервер.ИменаТаблицМаркировкиАктаОРасхождениях();
			Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
				КодыМаркировки = Результат[ИмяТаблицы];
				ТекущиеДанныеКоллекции[ИмяТаблицы].ЗагрузитьЗначения(КодыМаркировки);
				Если ЗначениеЗаполнено(КодыМаркировки) Тогда
					ВсеКодыМаркировки.Добавить(ТорговыйКомплексЭДОКлиентСервер.ПредставлениеКодовМаркировки(КодыМаркировки));
				КонецЕсли;
			КонецЦикла;
			
			ТекущиеДанныеКоллекции.МаркируемыеУпаковки = ТорговыйКомплексЭДОКлиентСервер.ПредставлениеКодовМаркировки(ВсеКодыМаркировки);
		Иначе
			КодыУпаковок             = Результат.КодыУпаковокМаркируемойПродукции;
			ТекущиеДанныеКоллекции.КодыУпаковокМаркируемойПродукции.ЗагрузитьЗначения(КодыУпаковок);
			ТекущиеДанныеКоллекции.МаркируемыеУпаковки = ТорговыйКомплексЭДОКлиентСервер.ПредставлениеКодовМаркировки(КодыУпаковок);
		КонецЕсли;
		
		Форма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Асинхронная процедура.
Процедура НоменклатураОбработкаВыбораПослеПолученияДанныхИзСервиса(Результат, Контекст) Экспорт
	
	Если Результат.Статус <> "Выполнено" Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("РаботаСНоменклатурой_АдресДанныхЗаполнения", Результат.АдресРезультата);
	ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", ПараметрыФормы, Контекст.Элемент);
	
КонецПроцедуры

Процедура НачатьОжиданиеОбновленияИнформацииПоПриглашениямВ1СЭДО(КлючиСинхронизации, ОписаниеОповещенияЗавершение) Экспорт
	
	ДлительнаяОперация = ТорговыйКомплексЭДОВызовСервера.НачатьОбновлениеИнформацииПоПриглашениямВ1СЭДО(
		КлючиСинхронизации, Новый УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
	ПараметрыОжидания.ВыводитьОкноОжидания            = Ложь;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещенияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

#Область ВводСчетаФактуры

// Обрабатывает результат вопроса о проведении документа.
// 
// Параметры:
//  Результат - КодВозвратаДиалога
//  Контекст  - Структура:
//  * Форма - ФормаКлиентскогоПриложения:
//  ** Объект - ДокументОбъект
//
Процедура ВвестиСчетФактуруПослеПодтверждениеПроведения(Результат, Контекст) Экспорт
	
	ДокументПроведен = Ложь;
	Если Результат = КодВозвратаДиалога.Да Тогда
		Попытка
			ДокументПроведен = Контекст.Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		Исключение
			ПоказатьПредупреждение(,НСтр("ru = 'Не удалось выполнить проведение документа'"));
		КонецПопытки;
		
		Если ДокументПроведен Тогда
			ВвестиСчетФактуруПослеПроведения(Контекст.Форма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Вводит документ счет-фактуру на основании текущего документа.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//  * Объект - ДокументОбъект
//
Процедура ВвестиСчетФактуруПослеПроведения(Форма)
	
	ПараметрыФормы = Новый Структура("Основание", Форма.Объект.Ссылка);
	ОткрытьФорму("Документ.СчетФактураВыданный.ФормаОбъекта", ПараметрыФормы, Форма);
	
КонецПроцедуры

#КонецОбласти

#Область СведенияПрослеживаемости

Процедура ОбработатьРезультатВводаСведенийПрослеживаемости(СведенияПрослеживаемостиТовара, Контекст) Экспорт
	
	Если СведенияПрослеживаемостиТовара = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Контекст.ТекущиеДанные;
	СведенияПрослеживаемости = Контекст.СведенияПрослеживаемости;
	Для Каждого СтрокаСведений Из Контекст.НаборСведенийПоОтбору Цикл
		СведенияПрослеживаемости.Удалить(СтрокаСведений);
	КонецЦикла;
	
	Для Каждого СведенияПартииТовара Из СведенияПрослеживаемостиТовара Цикл
		НоваяСтрока = СведенияПрослеживаемости.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СведенияПартииТовара);
		НоваяСтрока.ИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки;
	КонецЦикла;
	
	ТекущиеДанные.РНПТ = ТорговыйКомплексЭДОКлиентСервер.ПредставлениеРНПТ(СведенияПрослеживаемостиТовара);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
