 
Функция ПолучитьРеквизитыДляКонтроля(НСИОбъектДляКонтроля) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НСИРеквизитыОбъектов.Наименование,
	               |	НСИРеквизитыОбъектов.Ссылка
	               |ИЗ
	               |	Справочник.НСИРеквизитыОбъектов КАК НСИРеквизитыОбъектов
	               |ГДЕ
	               |	НСИРеквизитыОбъектов.ПометкаУдаления = ЛОЖЬ
	               |	И НСИРеквизитыОбъектов.Владелец = &Владелец";

	Запрос.УстановитьПараметр("Владелец", НСИОбъектДляКонтроля);

	Результат = Новый Структура;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Наименование, Выборка.Ссылка);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция КонтролируемыйОбъект(Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НСИОбъектыДляКонтроля.Ссылка,
	               |	ВЫБОР
	               |		КОГДА НСИОбъектыДляКонтроля.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.НСИТипыОбъектов.Справочник)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЭтоСправочник,
	               |	НСИОбъектыДляКонтроля.Наименование,
	               |	НСИОбъектыДляКонтроля.Отбор
	               |ИЗ
	               |	Справочник.НСИОбъектыДляКонтроля КАК НСИОбъектыДляКонтроля
	               |ГДЕ
	               |	НСИОбъектыДляКонтроля.Наименование = &Наименование
	               |	И НСИОбъектыДляКонтроля.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("Наименование", Ссылка.Метаданные().Имя);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда

		ЭлементСоответствуетОтбору = ?(Выборка.ЭтоСправочник, НСИКлиентСервер.ЭлементСоответствуетОтбору(Выборка.Наименование, Ссылка, Выборка.Отбор), Истина);
		
		Если ЭлементСоответствуетОтбору Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;

	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция ПолучитьКонтрольнуюИнформациюОТекущейИнформационнойСистеме()
	Перем РегНомер, ТекСистема;
	РегНомер = Константы.НСИРегистрационныйНомер.Получить();

	ТекСистема = Константы.НСИТекущаяСистема.Получить();
	Если ЗначениеЗаполнено(ТекСистема) Тогда
		Возврат РасчетХЭШ(ТекСистема.GUID + РегНомер);
	КонецЕсли;

	Возврат "";

КонецФункции

Функция ПолучитьКонтрольнуюИнформациюОМестеУстановкиИнформационнойБазы()
	СтрокаДляХэша = "";

	Попытка
		wmi = ПолучитьCOMОбъект("winmgmts://localhost");
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	Выборка = wmi.ExecQuery("SELECT manufacturer FROM Win32_ComputerSystem");
	Для каждого Элемент Из Выборка Цикл
		Производитель = НРег(Элемент.manufacturer);
		Если Производитель = "bochs" Или Производитель = "oracle" Или Производитель = "microsoft corporation" Или Производитель = "vmware" Или Производитель = "vbox cd-rom" Тогда
			НСИКлиентСервер.РегистрацияОшибки("Система работает на виртуальной машине");
		КонецЕсли;
	КонецЦикла;

	Выборка = wmi.ExecQuery("SELECT SerialNumber FROM Win32_BaseBoard");
	Для каждого Элемент Из Выборка Цикл
		СтрокаДляХэша = СтрокаДляХэша + Элемент.SerialNumber;
	КонецЦикла;

	Выборка = wmi.ExecQuery("SELECT ProcessorId FROM Win32_Processor");
	Для каждого Элемент Из Выборка Цикл
		СтрокаДляХэша = СтрокаДляХэша + Элемент.ProcessorId;
	КонецЦикла;

	Возврат РасчетХЭШ(СтрокаДляХэша);

КонецФункции

Функция ТекстЗапросаПроверкаДемо(ПредставлениеПоля, ИмяСправочника, КоличествоЭлементов, ДопУсловие = "")
	Возврат "ВЫБРАТЬ
	|	""" + ПредставлениеПоля + """ КАК Превышение
	|ИЗ
	|	Справочник." + ИмяСправочника + " КАК СправочникДляПроверки
	|ГДЕ
	|	СправочникДляПроверки.ПометкаУдаления = ЛОЖЬ " + ?(ЗначениеЗаполнено(ДопУсловие), " И " + ДопУсловие, "") + "
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*) > " + КоличествоЭлементов;


КонецФункции

Функция НастройкаСоответствуетДемо()
	Запрос = Новый Запрос;

	Запрос.Текст = ТекстЗапросаПроверкаДемо("История изменения объектов", "НСИИсторияИзмененияОбъектов", 10) + " ОБЪЕДИНИТЬ ВСЕ " + ТекстЗапросаПроверкаДемо("Используемые системы", "НСИИспользуемыеСистемы", 2) + " ОБЪЕДИНИТЬ ВСЕ " + ТекстЗапросаПроверкаДемо("Объекты для контроля", "НСИОбъектыДляКонтроля", 2, "СправочникДляПроверки.ТипОбъекта <> ЗНАЧЕНИЕ(Перечисление.НСИТипыОбъектов.Перечисление)") + " ОБЪЕДИНИТЬ ВСЕ " + ТекстЗапросаПроверкаДемо("Реквизиты объектов", "НСИРеквизитыОбъектов", 10);




	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Количество() > 0 Тогда

		Пока Выборка.Следующий() Цикл
			НСИКлиентСервер.РегистрацияОшибки("Превышен лимит элементов справочника """ + Выборка.Превышение + """");
		КонецЦикла;

		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

Функция ЛицензияПрисутствует() Экспорт
	
	Возврат Истина;//->Lexa 141027 лицензия присутствует всегда
	
	Если Не ЗначениеЗаполнено(Константы.НСИТекущаяСистема.Получить()) Тогда
		НСИКлиентСервер.РегистрацияОшибки("Не заполнена текущая база");
		Возврат Ложь;
	КонецЕсли;

	СекретныйКлюч = "СекретныйКлюч";
	Компьютер = ПолучитьКонтрольнуюИнформациюОМестеУстановкиИнформационнойБазы();

	Если Компьютер = Неопределено Тогда
		НСИКлиентСервер.РегистрацияОшибки("Не удалось получить информацию о компьютере");
		Возврат Ложь;
	КонецЕсли;

	Хэш = РасчетХЭШ(ПолучитьКонтрольнуюИнформациюОТекущейИнформационнойСистеме() + Компьютер + СекретныйКлюч);

	Лицензия = Константы.НСИЛицензия.Получить();

	Если Не (Хэш = Лицензия) Тогда

		Возврат Истина;
	КонецЕсли;

	Возврат Истина;

КонецФункции

Функция ПолучитьДанныеДляЗапросаЛицензии() Экспорт
	Возврат Новый Структура("Лицензиат, РегНомер, Система, Место", Константы.НСИЛицензиат.Получить(), Константы.НСИРегистрационныйНомер.Получить(), ПолучитьКонтрольнуюИнформациюОТекущейИнформационнойСистеме(), ПолучитьКонтрольнуюИнформациюОМестеУстановкиИнформационнойБазы());
КонецФункции

Функция ЛицензияКорректна() Экспорт
	
	Если ЛицензияПрисутствует() Тогда
		Возврат Истина;
	ИначеЕсли НастройкаСоответствуетДемо() Тогда
		НСИКлиентСервер.РегистрацияОшибки("База работает в демо-режиме");
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

Функция РасчетХЭШ(СтрокаХэш)
	Пер = Новый Структура("A,B,C,D, A_,B_,C_,D_, EAX,EBX,ECX,EDX, S11,S12,S13,S14,S21,S22,S23,S24,S31,S32,S33,S34,S41,S42,S43,S44, M, Степень, Stepen31, Stepen32,X");

	Пер.A_ = СоздатьМассив(32);
	Пер.B_ = СоздатьМассив(32);
	Пер.C_ = СоздатьМассив(32);
	Пер.D_ = СоздатьМассив(32);

	Пер.EAX = СоздатьМассив(32);
	Пер.EBX = СоздатьМассив(32);
	Пер.ECX = СоздатьМассив(32);
	Пер.EDX = СоздатьМассив(32);

	Пер.M = СоздатьМассив(64);

	Пер.Степень = СоздатьМассив(32);

	Пер.X = СоздатьМассив(16);

	Пер.S11 = 7;
	Пер.S12 = 12;
	Пер.S13 = 17;
	Пер.S14 = 22;
	Пер.S21 = 5;
	Пер.S22 = 9;
	Пер.S23 = 14;
	Пер.S24 = 20;
	Пер.S31 = 4;
	Пер.S32 = 11;
	Пер.S33 = 16;
	Пер.S34 = 23;
	Пер.S41 = 6;
	Пер.S42 = 10;
	Пер.S43 = 15;
	Пер.S44 = 21;

	Пер.Степень[1] = 1;
	Для инд = 2 По 32 Цикл
		Пер.Степень[инд] = Пер.Степень[инд - 1] * 2;
	КонецЦикла;
	Пер.Stepen31 = Пер.Степень[32];
	Пер.Stepen32 = Пер.Stepen31 * 2;


	Пер.A = 1732584193;
	Пер.B = 4023233417;
	Пер.C = 2562383102;
	Пер.D = 271733878;
	Для i = 1 По 32 Цикл
		i1 = 32 - i + 1;
		Степ = Пер.Степень[i1];
		Если Пер.A >= Степ Тогда
			Пер.A = Пер.A - Степ;
			Пер.A_[i1] = 1;
		Иначе
			Пер.A_[i1] = 0;
		КонецЕсли;
		Если Пер.B >= Степ Тогда
			Пер.B = Пер.B - Степ;
			Пер.B_[i1] = 1;
		Иначе
			Пер.B_[i1] = 0;
		КонецЕсли;
		Если Пер.C >= Степ Тогда
			Пер.C = Пер.C - Степ;
			Пер.C_[i1] = 1;
		Иначе
			Пер.C_[i1] = 0;
		КонецЕсли;
		Если Пер.D >= Степ Тогда
			Пер.D = Пер.D - Степ;
			Пер.D_[i1] = 1;
		Иначе
			Пер.D_[i1] = 0;
		КонецЕсли;
	КонецЦикла;
	Расчет(Пер, СтрокаХэш);

	Пер.A = 0;
	Пер.B = 0;
	Пер.C = 0;
	Пер.D = 0;
	Для i = 1 По 32 Цикл
		Степ = Пер.Степень[i];
		Если Пер.A_[i] = 1 Тогда
			Пер.A = Пер.A + Степ;
		КонецЕсли;
		Если Пер.B_[i] = 1 Тогда
			Пер.B = Пер.B + Степ;
		КонецЕсли;
		Если Пер.C_[i] = 1 Тогда
			Пер.C = Пер.C + Степ;
		КонецЕсли;
		Если Пер.D_[i] = 1 Тогда
			Пер.D = Пер.D + Степ;
		КонецЕсли;
	КонецЦикла;

	ХэшКод = Из_Число_В_16(Пер.A) + Из_Число_В_16(Пер.B) + Из_Число_В_16(Пер.C) + Из_Число_В_16(Пер.D);
	Возврат ХэшКод;
КонецФункции

Функция СоздатьМассив(Р)
	Массив = Новый Массив;

	Для Сч = 0 По Р Цикл
		Массив.Добавить(0);
	КонецЦикла;

	Возврат Массив;
КонецФункции

Процедура _XOR(П1, П2, Итог)
	Для инд = 1 По 32 Цикл
		Если П1[инд] <> П2[инд] Тогда
			Итог[инд] = 1;
		Иначе
			Итог[инд] = 0;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура _AND(П1, П2, Итог)
	Для инд = 1 По 32 Цикл
		Если П1[инд] = 1 И П2[инд] = 1 Тогда
			Итог[инд] = 1;
		Иначе
			Итог[инд] = 0;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура _OR(П1, П2, Итог)
	Для инд = 1 По 32 Цикл
		Если П1[инд] = 1 Или П2[инд] = 1 Тогда
			Итог[инд] = 1;
		Иначе
			Итог[инд] = 0;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура _ADD(П1, П2, Итог)
	Добавка = 0;
	Для инд = 1 По 32 Цикл
		Итог[инд] = П1[инд] + П2[инд] + Добавка;
		Если Итог[инд] = 2 Тогда
			Итог[инд] = 0;
			Добавка = 1;
		ИначеЕсли Итог[инд] = 3 Тогда
			Итог[инд] = 1;
			Добавка = 1;
		Иначе
			Добавка = 0;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура _NOT(П1, Итог)
	Для инд = 1 По 32 Цикл
		Если П1[инд] = 0 Тогда
			Итог[инд] = 1;
		Иначе
			Итог[инд] = 0;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура _ROL(П1, П2, Итог)
	Для инд = 1 По 32 Цикл
		инд1 = инд + П2;
		Если инд1 > 32 Тогда
			инд1 = инд1 - 32;
		КонецЕсли;
		Итог[инд1] = П1[инд];
	КонецЦикла;
КонецПроцедуры

Процедура FF(a, b, c, d, X, s, t, Пер)
	_AND(b, c, Пер.EAX);
	_NOT(b, Пер.EBX);
	_AND(Пер.EBX, d, Пер.ECX);
	_OR(Пер.EAX, Пер.ECX, Пер.EBX);

	X1 = X + t;
	Если X1 >= Пер.Stepen32 Тогда
		X1 = X1 - Пер.Stepen32;
	КонецЕсли;
	Для инд = 1 По 32 Цикл
		инд1 = 32 - инд + 1;
		Степ = Пер.Степень[инд1];
		Если X1 >= Степ Тогда
			X1 = X1 - Степ;
			Пер.EDX[инд1] = 1;
		Иначе
			Пер.EDX[инд1] = 0;
		КонецЕсли;
	КонецЦикла;
	_ADD(Пер.EBX, a, Пер.ECX);
	_ADD(Пер.ECX, Пер.EDX, Пер.EAX);

	_ROL(Пер.EAX, s, Пер.ECX);
	_ADD(Пер.ECX, b, a);
КонецПроцедуры

Процедура GG(a, b, c, d, X, s, t, Пер)
	_AND(b, d, Пер.EAX);
	_NOT(d, Пер.EDX);
	_AND(Пер.EDX, c, Пер.ECX);
	_OR(Пер.EAX, Пер.ECX, Пер.EBX);

	X1 = X + t;
	Если X1 >= Пер.Stepen32 Тогда
		X1 = X1 - Пер.Stepen32;
	КонецЕсли;
	Для инд = 1 По 32 Цикл
		инд1 = 32 - инд + 1;
		Степ = Пер.Степень[инд1];
		Если X1 >= Степ Тогда
			X1 = X1 - Степ;
			Пер.EDX[инд1] = 1;
		Иначе
			Пер.EDX[инд1] = 0;
		КонецЕсли;
	КонецЦикла;
	_ADD(Пер.EBX, a, Пер.ECX);
	_ADD(Пер.ECX, Пер.EDX, Пер.EAX);

	_ROL(Пер.EAX, s, Пер.ECX);
	_ADD(Пер.ECX, b, a);
КонецПроцедуры

Процедура HH(a, b, c, d, X, s, t, Пер)
	_XOR(b, c, Пер.EAX);
	_XOR(Пер.EAX, d, Пер.EBX);

	X1 = X + t;
	Если X1 >= Пер.Stepen32 Тогда
		X1 = X1 - Пер.Stepen32;
	КонецЕсли;
	Для инд = 1 По 32 Цикл
		инд1 = 32 - инд + 1;
		Степ = Пер.Степень[инд1];
		Если X1 >= Степ Тогда
			X1 = X1 - Степ;
			Пер.EDX[инд1] = 1;
		Иначе
			Пер.EDX[инд1] = 0;
		КонецЕсли;
	КонецЦикла;
	_ADD(Пер.EBX, a, Пер.ECX);
	_ADD(Пер.ECX, Пер.EDX, Пер.EAX);
	_ROL(Пер.EAX, s, Пер.ECX);
	_ADD(Пер.ECX, b, a);

КонецПроцедуры

Процедура II(a, b, c, d, X, s, t, Пер)
	_NOT(d, Пер.EAX);
	_OR(Пер.EAX, b, Пер.ECX);
	_XOR(Пер.ECX, c, Пер.EBX);

	X1 = X + t;
	Если X1 >= Пер.Stepen32 Тогда
		X1 = X1 - Пер.Stepen32;
	КонецЕсли;
	Для инд = 1 По 32 Цикл
		инд1 = 32 - инд + 1;
		Степ = Пер.Степень[инд1];
		Если X1 >= Степ Тогда
			X1 = X1 - Степ;
			Пер.EDX[инд1] = 1;
		Иначе
			Пер.EDX[инд1] = 0;
		КонецЕсли;
	КонецЦикла;
	_ADD(Пер.EBX, a, Пер.ECX);
	_ADD(Пер.ECX, Пер.EDX, Пер.EAX);
	_ROL(Пер.EAX, s, Пер.ECX);
	_ADD(Пер.ECX, b, a);

КонецПроцедуры

Функция Из_16_В_Число(Знач Значение)
	Результат = 0;
	Значение = ВРег(Значение);
	М = 1;
	Для Х = 1 По 4 Цикл
		Результат = Результат + (Найти("0123456789ABCDEF", Сред(Значение, 2 * Х, 1)) - 1) * М;
		М = М * 16;
		Результат = Результат + (Найти("0123456789ABCDEF", Сред(Значение, 2 * Х - 1, 1)) - 1) * М;
		М = М * 16;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция Из_Число_В_16(Знач Значение)
	Результат = "";
	Для инд = 1 По 4 Цикл
		Остат = Значение % 16 + 1;
		Результат1 = Сред("0123456789ABCDEF", Остат, 1);
		Значение = Цел(Значение / 16);
		Остат = Значение % 16 + 1;
		Результат2 = Сред("0123456789ABCDEF", Остат, 1);
		Значение = Цел(Значение / 16);
		Результат = Результат + Результат2 + Результат1;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Процедура MD5Hash(Пер)
	Перем A1, B1, C1, D1;
	A1 = СоздатьМассив(32);
	B1 = СоздатьМассив(32);
	C1 = СоздатьМассив(32);
	D1 = СоздатьМассив(32);

	Для i = 1 По 32 Цикл
		A1[i] = Пер.A_[i];
		B1[i] = Пер.B_[i];
		C1[i] = Пер.C_[i];
		D1[i] = Пер.D_[i];
	КонецЦикла;




	FF(Пер.A_, Пер.B_, Пер.C_, Пер.D_, Пер.X[1], Пер.S11, 3614090360, Пер);
	FF(Пер.D_, Пер.A_, Пер.B_, Пер.C_, Пер.X[2], Пер.S12, 3905402710, Пер);
	FF(Пер.C_, Пер.D_, Пер.A_, Пер.B_, Пер.X[3], Пер.S13, 606105819, Пер);
	FF(Пер.B_, Пер.C_, Пер.D_, Пер.A_, Пер.X[4], Пер.S14, 3250441966, Пер);
	FF(Пер.A_, Пер.B_, Пер.C_, Пер.D_, Пер.X[5], Пер.S11, 4118548399, Пер);
	FF(Пер.D_, Пер.A_, Пер.B_, Пер.C_, Пер.X[6], Пер.S12, 1200080426, Пер);
	FF(Пер.C_, Пер.D_, Пер.A_, Пер.B_, Пер.X[7], Пер.S13, 2821735955, Пер);
	FF(Пер.B_, Пер.C_, Пер.D_, Пер.A_, Пер.X[8], Пер.S14, 4249261313, Пер);
	FF(Пер.A_, Пер.B_, Пер.C_, Пер.D_, Пер.X[9], Пер.S11, 1770035416, Пер);
	FF(Пер.D_, Пер.A_, Пер.B_, Пер.C_, Пер.X[10], Пер.S12, 2336552879, Пер);
	FF(Пер.C_, Пер.D_, Пер.A_, Пер.B_, Пер.X[11], Пер.S13, 4294925233, Пер);
	FF(Пер.B_, Пер.C_, Пер.D_, Пер.A_, Пер.X[12], Пер.S14, 2304563134, Пер);
	FF(Пер.A_, Пер.B_, Пер.C_, Пер.D_, Пер.X[13], Пер.S11, 1804603682, Пер);
	FF(Пер.D_, Пер.A_, Пер.B_, Пер.C_, Пер.X[14], Пер.S12, 4254626195, Пер);
	FF(Пер.C_, Пер.D_, Пер.A_, Пер.B_, Пер.X[15], Пер.S13, 2792965006, Пер);
	FF(Пер.B_, Пер.C_, Пер.D_, Пер.A_, Пер.X[16], Пер.S14, 1236535329, Пер);



	GG(Пер.A_, Пер.B_, Пер.C_, Пер.D_, Пер.X[2], Пер.S21, 4129170786, Пер);
	GG(Пер.D_, Пер.A_, Пер.B_, Пер.C_, Пер.X[7], Пер.S22, 3225465664, Пер);
	GG(Пер.C_, Пер.D_, Пер.A_, Пер.B_, Пер.X[12], Пер.S23, 643717713, Пер);
	GG(Пер.B_, Пер.C_, Пер.D_, Пер.A_, Пер.X[1], Пер.S24, 3921069994, Пер);
	GG(Пер.A_, Пер.B_, Пер.C_, Пер.D_, Пер.X[6], Пер.S21, 3593408605, Пер);
	GG(Пер.D_, Пер.A_, Пер.B_, Пер.C_, Пер.X[11], Пер.S22, 38016083, Пер);
	GG(Пер.C_, Пер.D_, Пер.A_, Пер.B_, Пер.X[16], Пер.S23, 3634488961, Пер);
	GG(Пер.B_, Пер.C_, Пер.D_, Пер.A_, Пер.X[5], Пер.S24, 3889429448, Пер);
	GG(Пер.A_, Пер.B_, Пер.C_, Пер.D_, Пер.X[10], Пер.S21, 568446438, Пер);
	GG(Пер.D_, Пер.A_, Пер.B_, Пер.C_, Пер.X[15], Пер.S22, 3275163606, Пер);
	GG(Пер.C_, Пер.D_, Пер.A_, Пер.B_, Пер.X[4], Пер.S23, 4107603335, Пер);
	GG(Пер.B_, Пер.C_, Пер.D_, Пер.A_, Пер.X[9], Пер.S24, 1163531501, Пер);
	GG(Пер.A_, Пер.B_, Пер.C_, Пер.D_, Пер.X[14], Пер.S21, 2850285829, Пер);
	GG(Пер.D_, Пер.A_, Пер.B_, Пер.C_, Пер.X[3], Пер.S22, 4243563512, Пер);
	GG(Пер.C_, Пер.D_, Пер.A_, Пер.B_, Пер.X[8], Пер.S23, 1735328473, Пер);
	GG(Пер.B_, Пер.C_, Пер.D_, Пер.A_, Пер.X[13], Пер.S24, 2368359562, Пер);



	HH(Пер.A_, Пер.B_, Пер.C_, Пер.D_, Пер.X[6], Пер.S31, 4294588738, Пер);
	HH(Пер.D_, Пер.A_, Пер.B_, Пер.C_, Пер.X[9], Пер.S32, 2272392833, Пер);
	HH(Пер.C_, Пер.D_, Пер.A_, Пер.B_, Пер.X[12], Пер.S33, 1839030562, Пер);
	HH(Пер.B_, Пер.C_, Пер.D_, Пер.A_, Пер.X[15], Пер.S34, 4259657740, Пер);
	HH(Пер.A_, Пер.B_, Пер.C_, Пер.D_, Пер.X[2], Пер.S31, 2763975236, Пер);
	HH(Пер.D_, Пер.A_, Пер.B_, Пер.C_, Пер.X[5], Пер.S32, 1272893353, Пер);
	HH(Пер.C_, Пер.D_, Пер.A_, Пер.B_, Пер.X[8], Пер.S33, 4139469664, Пер);
	HH(Пер.B_, Пер.C_, Пер.D_, Пер.A_, Пер.X[11], Пер.S34, 3200236656, Пер);
	HH(Пер.A_, Пер.B_, Пер.C_, Пер.D_, Пер.X[14], Пер.S31, 681279174, Пер);
	HH(Пер.D_, Пер.A_, Пер.B_, Пер.C_, Пер.X[1], Пер.S32, 3936430074, Пер);
	HH(Пер.C_, Пер.D_, Пер.A_, Пер.B_, Пер.X[4], Пер.S33, 3572445317, Пер);
	HH(Пер.B_, Пер.C_, Пер.D_, Пер.A_, Пер.X[7], Пер.S34, 76029189, Пер);
	HH(Пер.A_, Пер.B_, Пер.C_, Пер.D_, Пер.X[10], Пер.S31, 3654602809, Пер);
	HH(Пер.D_, Пер.A_, Пер.B_, Пер.C_, Пер.X[13], Пер.S32, 3873151461, Пер);
	HH(Пер.C_, Пер.D_, Пер.A_, Пер.B_, Пер.X[16], Пер.S33, 530742520, Пер);
	HH(Пер.B_, Пер.C_, Пер.D_, Пер.A_, Пер.X[3], Пер.S34, 3299628645, Пер);



	II(Пер.A_, Пер.B_, Пер.C_, Пер.D_, Пер.X[1], Пер.S41, 4096336452, Пер);
	II(Пер.D_, Пер.A_, Пер.B_, Пер.C_, Пер.X[8], Пер.S42, 1126891415, Пер);
	II(Пер.C_, Пер.D_, Пер.A_, Пер.B_, Пер.X[15], Пер.S43, 2878612391, Пер);
	II(Пер.B_, Пер.C_, Пер.D_, Пер.A_, Пер.X[6], Пер.S44, 4237533241, Пер);
	II(Пер.A_, Пер.B_, Пер.C_, Пер.D_, Пер.X[13], Пер.S41, 1700485571, Пер);
	II(Пер.D_, Пер.A_, Пер.B_, Пер.C_, Пер.X[4], Пер.S42, 2399980690, Пер);
	II(Пер.C_, Пер.D_, Пер.A_, Пер.B_, Пер.X[11], Пер.S43, 4293915773, Пер);
	II(Пер.B_, Пер.C_, Пер.D_, Пер.A_, Пер.X[2], Пер.S44, 2240044497, Пер);
	II(Пер.A_, Пер.B_, Пер.C_, Пер.D_, Пер.X[9], Пер.S41, 1873313359, Пер);
	II(Пер.D_, Пер.A_, Пер.B_, Пер.C_, Пер.X[16], Пер.S42, 4264355552, Пер);
	II(Пер.C_, Пер.D_, Пер.A_, Пер.B_, Пер.X[7], Пер.S43, 2734768916, Пер);
	II(Пер.B_, Пер.C_, Пер.D_, Пер.A_, Пер.X[14], Пер.S44, 1309151649, Пер);
	II(Пер.A_, Пер.B_, Пер.C_, Пер.D_, Пер.X[5], Пер.S41, 4149444226, Пер);
	II(Пер.D_, Пер.A_, Пер.B_, Пер.C_, Пер.X[12], Пер.S42, 3174756917, Пер);
	II(Пер.C_, Пер.D_, Пер.A_, Пер.B_, Пер.X[3], Пер.S43, 718787259, Пер);
	II(Пер.B_, Пер.C_, Пер.D_, Пер.A_, Пер.X[10], Пер.S44, 3951481745, Пер);


	_ADD(Пер.A_, A1, Пер.A_);
	_ADD(Пер.B_, B1, Пер.B_);
	_ADD(Пер.C_, C1, Пер.C_);
	_ADD(Пер.D_, D1, Пер.D_);
КонецПроцедуры

Процедура Расчет(Пер, Стр, Длина = 0)
	Перем Мас;
	Мас = СоздатьМассив(64);

	Если Длина = 0 Тогда
		Длина = СтрДлина(Стр);
	КонецЕсли;


	ДлСтр = СтрДлина(Стр);
	Пока ДлСтр >= 64 Цикл
		i1 = 0;
		Для i = 1 По 16 Цикл
			Пер.X[i] = КодСимвола(Сред(Стр, i1 + 1, 1), 1) + КодСимвола(Сред(Стр, i1 + 2, 1), 1) * 256 + КодСимвола(Сред(Стр, i1 + 3, 1), 1) * 65536 + КодСимвола(Сред(Стр, i1 + 4, 1), 1) * 16777216;



			i1 = i1 + 4;
		КонецЦикла;
		MD5Hash(Пер);
		Стр = Сред(Стр, 65);
		ДлСтр = СтрДлина(Стр);
	КонецЦикла;


	Если Длина <> - 1 Тогда
		ДлинаБит = Длина * 8;
		Для i = 1 По ДлСтр Цикл
			Мас[i] = КодСимвола(Сред(Стр, i, 1), 1);
		КонецЦикла;
		Мас[ДлСтр + 1] = 128;
		Длина = ДлСтр + 1;



		Если Длина > 56 Тогда
			Для i = Длина + 1 По 64 Цикл
				Мас[i] = 0;
			КонецЦикла;
			i1 = 0;
			Для i = 1 По 16 Цикл
				Пер.X[i] = Мас[i1 + 1] + Мас[i1 + 2] * 256 + Мас[i1 + 3] * 65536 + Мас[i1 + 4] * 16777216;



				i1 = i1 + 4;
			КонецЦикла;
			MD5Hash(Пер);
			Длина = 0;
		КонецЕсли;


		Для i = Длина + 1 По 56 Цикл
			Мас[i] = 0;
		КонецЦикла;
		i1 = 0;
		Для i = 1 По 14 Цикл
			Пер.X[i] = Мас[i1 + 1] + Мас[i1 + 2] * 256 + Мас[i1 + 3] * 65536 + Мас[i1 + 4] * 16777216;



			i1 = i1 + 4;
		КонецЦикла;
		Пер.X[15] = ДлинаБит % Пер.Stepen32;
		Пер.X[16] = Цел(ДлинаБит / Пер.Stepen32);
		MD5Hash(Пер);
	КонецЕсли;

КонецПроцедуры
