
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АлкогольнаяПродукция = Параметры.АлкогольнаяПродукция;
	Номенклатура		 = Параметры.Номенклатура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КлассификаторАлкогольнойПродукцииЕГАИС.ВидПродукции,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Производитель,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.НаименованиеПолное,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Упакована,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Объем,
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Крепость
	|ИЗ
	|	Справочник.КлассификаторАлкогольнойПродукцииЕГАИС КАК КлассификаторАлкогольнойПродукцииЕГАИС
	|ГДЕ
	|	КлассификаторАлкогольнойПродукцииЕГАИС.Ссылка = &Ссылка
	|";
	Запрос.УстановитьПараметр("Ссылка", АлкогольнаяПродукция);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Элементы.ПолноеНаименование.Заголовок = СокрЛП(Выборка.НаименованиеПолное);
		
		ВидПродукции  = Выборка.ВидПродукции;
		Производитель = Выборка.Производитель;
		Упакована     = Выборка.Упакована;
		Объем         = Выборка.Объем;
		Крепость      = Выборка.Крепость;
		
	КонецЕсли;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаНоменклатура.ВидАлкогольнойПродукции КАК ВидПродукции,
	|	ТаблицаНоменклатура.Производитель,
	|	ТаблицаНоменклатура.Объем КАК Объем,
	|	ТаблицаНоменклатура.Крепость КАК Крепость
	|ИЗ
	|	Справочник.Номенклатура КАК ТаблицаНоменклатура
	|ГДЕ
	|	ТаблицаНоменклатура.Ссылка = &Ссылка
	|";
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ВидПродукцииНоменклатура  = Выборка.ВидПродукции;
		ПроизводительНоменклатура = Выборка.Производитель;
		ОбъемНоменклатура         = Выборка.Объем;
		КрепостьНоменклатура      = Выборка.Крепость;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеДиалогом();
КонецПроцедуры


&НаКлиенте
Процедура УправлениеДиалогом()
	
	ПроизводительКонтрагент = Неопределено;//ПолучитьПроизводителяДляКлассификатора(Производитель);
	
	Элементы.ПредупреждениеОбъем.Видимость         = (НЕ Объем = ОбъемНоменклатура);
	Элементы.ПредупреждениеВидПродукции.Видимость  = (НЕ ВидПродукции = ВидПродукцииНоменклатура);
	Элементы.ПредупреждениеКрепость.Видимость      = (НЕ Крепость = КрепостьНоменклатура);
	
	Элементы.ПредупреждениеПроизводитель.Видимость = ((НЕ ЗначениеЗаполнено(ПроизводительКонтрагент)) ИЛИ (НЕ ПроизводительКонтрагент = ПроизводительНоменклатура));
	
КонецПроцедуры

&НаКлиенте
Процедура Сопоставить(Команда)
	
	ЕстьРасхождения = Ложь;
	
	//ПроизводительКонтрагент = ПолучитьПроизводителяДляКлассификатора(Производитель);
	
	Если (НЕ Объем = ОбъемНоменклатура) Тогда
		ЕстьРасхождения = Истина;
	КонецЕсли;
	
	Если (НЕ ВидПродукции = ВидПродукцииНоменклатура) Тогда
		ЕстьРасхождения = Истина;
	КонецЕсли;
	
	Если (НЕ Крепость = КрепостьНоменклатура) Тогда
		ЕстьРасхождения = Истина;
	КонецЕсли;
	
	//Если (НЕ ЗначениеЗаполнено(ПроизводительКонтрагент)) ИЛИ (НЕ ПроизводительКонтрагент = ПроизводительНоменклатура) Тогда
	//	ЕстьРасхождения = Истина;
	//КонецЕсли;
	
	Если ЕстьРасхождения Тогда
		
		ТекстВопроса = НСтр("ru='У алкогольной продукции и номенклатуры есть расхождения по ключевым полям. Зафиксировать сопоставление?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗафиксироватьСопоставление", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
		
		Если Вопрос("У алкогольной продукции и номенклатуры есть расхождения по ключевым полям.
			|Зафиксировать сопоставление?", РежимДиалогаВопрос.ДаНет,,,"Подтверждение сопоставления")=КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	СопоставитьНаСервере();
	Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьСопоставление(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	СопоставитьНаСервере();
	Закрыть(Истина);
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьНаСервере()
	
	НаборЗаписей = РегистрыСведений.СоответствиеНоменклатурыЕГАИС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.АлкогольнаяПродукция.Использование = Истина;
	НаборЗаписей.Отбор.АлкогольнаяПродукция.Значение = АлкогольнаяПродукция;
	
	НаборЗаписей.Отбор.ИдентификаторУпаковки.Использование = Истина;
	НаборЗаписей.Отбор.ИдентификаторУпаковки.Значение = ИдентификаторУпаковки;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество()>0 Тогда
		
	КонецЕсли;
	НаборЗаписей.Очистить();
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.АлкогольнаяПродукция	= АлкогольнаяПродукция;
	НоваяЗапись.ИдентификаторУпаковки	= ИдентификаторУпаковки;
	НоваяЗапись.Номенклатура			= Номенклатура;
	НоваяЗапись.Характеристика			= Характеристика;
	НоваяЗапись.ЕдиницаИзмерения		= ЕдиницаИзмерения;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
