
&НаКлиенте
Процедура ВыполнитьЗаполнение(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		Результат = Новый Структура;
		Результат.Вставить("СкладКомпании", СкладКомпании);
		Результат.Вставить("ДатаНачала",    ПериодОбработки.ДатаНачала);
		Результат.Вставить("ДатаОкончания", ПериодОбработки.ДатаОкончания);
		
		Закрыть(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодОбработки.Вариант = ВариантСтандартногоПериода.Вчера;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СкладКомпании = ВладелецФормы.Объект.СкладКомпании;
	
КонецПроцедуры

