// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает список доступных операторов ЭДО.
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * Наименование - Строка
Функция СписокОператоровЭДО() Экспорт
	
	СписокОператоровЭДО = Новый Массив; // См. СписокОператоровЭДО
	
	Выборка = ВыборкаОператоровЭлектронногоДокументооборота();
	Пока Выборка.Следующий() Цикл
		ОператорЭДО = Новый Структура("Идентификатор, Наименование",
			Выборка.ИдентификаторОператора, Выборка.Представление);
		СписокОператоровЭДО.Добавить(ОператорЭДО);
	КонецЦикла;
	
	Возврат СписокОператоровЭДО;
	
КонецФункции

// Возвращает параметры связи между идентификаторами ЭДО организации и идентификаторами ЭДО контрагентов.
// 
// Параметры:
//  ПараметрыАбонентовЭДО - Структура:
//  * Организация - Структура:
//  ** ИНН - Строка
//  ** КПП - Строка
//  * Контрагенты - Массив из Структура:
//  ** НаименованиеСокращенное - Строка
//  ** НаименованиеПолное - Строка
//  ** ИНН - Строка
//  ** КПП - Строка
//  ** ОГРН - Строка
//  ** ЮридическийАдрес - Строка
//  * ИдентификаторыКонтрагента - Массив из Строка
//  * ИдентификаторыОрганизации - Массив из Строка
//  * ФормироватьСписокВыбора - Булево
//  * ПриоритетПодключенные - Булево
// 
// Возвращаемое значение:
//  Массив из см. НовыеПараметрыСвязиИдентификаторовАбонентовЭДО
//
Функция НаборПараметровСвязиИдентификаторовАбонентовЭДО(ПараметрыАбонентовЭДО) Экспорт
	
	Контрагенты = НайтиСоздатьКонтрагентов(ПараметрыАбонентовЭДО.Контрагенты);
	
	ПараметрыПолучения = РаботаСАбонентамиЭДО.НовыеПараметрыПолученияСвязиИдентификаторов();
	ПараметрыПолучения.Контрагент = Контрагенты;
	ПараметрыПолучения.ИдентификаторыКонтрагента = ПараметрыАбонентовЭДО.ИдентификаторыКонтрагента;
	ПараметрыПолучения.ПриоритетПодключенные = ПараметрыАбонентовЭДО.ПриоритетПодключенные;
	ПараметрыПолучения.ФормироватьСписокВыбора = ПараметрыАбонентовЭДО.ФормироватьСписокВыбора;
	
	Если Не ЗначениеЗаполнено(ПараметрыПолучения.Контрагент)
		И Не ЗначениеЗаполнено(ПараметрыПолучения.ИдентификаторыКонтрагента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыАбонентовЭДО.ИдентификаторыОрганизации) Тогда
		ПараметрыПолучения.ИдентификаторыОрганизации = ПараметрыАбонентовЭДО.ИдентификаторыОрганизации;
	Иначе
		Организация = ИнтеграцияЭДО.ОрганизацияПоКлючевымРеквизитам(ПараметрыАбонентовЭДО.Организация);
		СписокИдентификаторов = УчетныеЗаписиЭДО.СписокИдентификаторовУчетныхЗаписейОрганизацииСервисаЭДО(Организация);
		ПараметрыПолучения.ИдентификаторыОрганизации = СписокИдентификаторов.ВыгрузитьЗначения();
	КонецЕсли;
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	ПараметрыСвязи = РаботаСАбонентамиЭДО.ПараметрыСвязиИдентификаторов(ПараметрыПолучения, КонтекстДиагностики, Истина);
	
	НаборПараметровСвязи = Новый Массив; // Массив из Структура
	
	Для Каждого СтрокаПараметров Из ПараметрыСвязи Цикл
		ЭлементСвязи = НовыеПараметрыСвязиИдентификаторовАбонентовЭДО();
		ЭлементСвязи.Контрагент.ИНН = СтрокаПараметров.КонтрагентИНН;
		ЭлементСвязи.Контрагент.КПП = СтрокаПараметров.КонтрагентКПП;
		ЭлементСвязи.ИдентификаторКонтрагента = СтрокаПараметров.ИдентификаторКонтрагента;
		ЭлементСвязи.ИдентификаторКонтрагентаПредставление = СтрокаПараметров.ИдентификаторКонтрагентаПредставление;
		ЭлементСвязи.ИдентификаторКонтрагентаОписание = СтрокаПараметров.ИдентификаторКонтрагентаОписание;
		ЭлементСвязи.ОператорКонтрагента = СтрокаПараметров.ОператорКонтрагента;
		ЭлементСвязи.ОператорКонтрагентаПредставление = СтрокаПараметров.ОператорКонтрагентаПредставление;
		ЭлементСвязи.АбонентВХабе1С = СтрокаПараметров.АбонентВХабе1С;
		ЭлементСвязи.ИдентификаторОрганизации = СтрокаПараметров.ИдентификаторОрганизации;
		ЭлементСвязи.ИдентификаторОрганизацииПредставление = СтрокаПараметров.ИдентификаторОрганизацииПредставление;
		ЭлементСвязи.ОператорОрганизации = СтрокаПараметров.ОператорОрганизации;
		ЭлементСвязи.ИмяФайлаСоглашенияНаРоуминг = СтрокаПараметров.ИмяФайлаСоглашенияНаРоуминг;
		ЭлементСвязи.РекомендацияПоНастройке = СтрокаПараметров.РекомендацияПоНастройке;
		ЭлементСвязи.СтатусПриглашенияПредставление = Строка(СтрокаПараметров.СтатусПриглашенияПредставление);
		ЭлементСвязи.АбонентАктивен = СтрокаПараметров.АбонентАктивен;
		ЭлементСвязи.СертификатДействителен = СтрокаПараметров.СертификатДействителен;
		ЭлементСвязи.СтатусПодключения = СтрокаПараметров.СтатусПодключения;
		ЭлементСвязи.ОператорыСовпадают = СтрокаПараметров.ОператорыСовпадают;
		ЭлементСвязи.СвязьДоступна = СтрокаПараметров.СвязьДоступна;
		ЭлементСвязи.ОтправкаТолькоНаИдентификаторЭДО = СтрокаПараметров.ОтправкаТолькоНаИдентификаторЭДО;
		ЭлементСвязи.ТребуетсяСоглашение = СтрокаПараметров.ТребуетсяСоглашение;
		ЭлементСвязи.ТребуетсяСоглашениеПриПервомПодключении = СтрокаПараметров.ТребуетсяСоглашениеПриПервомПодключении;
		ЭлементСвязи.ОбязательнаяОтправкаЗаявкиНаРоуминг = СтрокаПараметров.ОбязательнаяОтправкаЗаявкиНаРоуминг;
		ЭлементСвязи.ЗаявкаНаРоумингПринята = СтрокаПараметров.ЗаявкаНаРоумингПринята;
		ЭлементСвязи.ПриглашениеОтправлено = СтрокаПараметров.ПриглашениеОтправлено;
		
		ЭлементСвязи.СписокВыбора = СписокВыбораИдентификаторовКонтрагентаВФорматСервиса(
			СтрокаПараметров.СписокВыбора);
		
		ЭлементСвязи.Абоненты = АбонентыПараметровСвязиИдентификаторовЭДОВФорматСервиса(
			СтрокаПараметров.Абоненты);
		
		Если ЗначениеЗаполнено(СтрокаПараметров.ВариантПотребностиСоглашения) Тогда
			ЭлементСвязи.ВариантПотребностиСоглашения = ОбщегоНазначения.ИмяЗначенияПеречисления(
				СтрокаПараметров.ВариантПотребностиСоглашения);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаПараметров.СтатусПриглашенияНаИдентификатор) Тогда
			ЭлементСвязи.СтатусПриглашенияНаИдентификатор = ОбщегоНазначения.ИмяЗначенияПеречисления(
				СтрокаПараметров.СтатусПриглашенияНаИдентификатор);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаПараметров.СтатусШироковещательногоПриглашения) Тогда
			ЭлементСвязи.СтатусШироковещательногоПриглашения = ОбщегоНазначения.ИмяЗначенияПеречисления(
				СтрокаПараметров.СтатусШироковещательногоПриглашения);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаПараметров.СтатусЗаявкиНаРоуминг) Тогда
			ЭлементСвязи.СтатусЗаявкиНаРоуминг = ОбщегоНазначения.ИмяЗначенияПеречисления(
				СтрокаПараметров.СтатусЗаявкиНаРоуминг);
		КонецЕсли;
		
		НаборПараметровСвязи.Добавить(ЭлементСвязи);
	КонецЦикла;
	
	Возврат НаборПараметровСвязи;
	
КонецФункции

// Возвращает шаблон письма о выборе оператора.
// 
// Параметры:
//  ПараметрыПисьма - Структура:
//  * ИдентификаторЭДО - Строка
//  * Организация - Структура:
//  ** Наименование - Строка
//  ** ИНН - Строка
//  ** КПП - Строка
//  * Руководитель - Структура:
//  ** Фамилия - Строка
//  ** Имя - Строка
//  ** Отчество - Строка
//  ** Должность - Строка
// 
// Возвращаемое значение:
//  Строка - ДвоичныеДанные в формате base64.
Функция ШаблонПисьмаОВыбореОператора(ПараметрыПисьма) Экспорт
	
	ДанныеОрганизации = ИнтеграцияЭДО.НоваяСтруктураДанныхОрганизации();
	ДанныеОрганизации.Наименование = ПараметрыПисьма.Организация.Наименование;
	ДанныеОрганизации.ИНН = ПараметрыПисьма.Организация.ИНН;
	ДанныеОрганизации.КПП = ПараметрыПисьма.Организация.КПП;
	ДанныеОрганизации.Фамилия = ПараметрыПисьма.Руководитель.Фамилия;
	ДанныеОрганизации.Имя = ПараметрыПисьма.Руководитель.Имя;
	ДанныеОрганизации.Отчество = ПараметрыПисьма.Руководитель.Отчество;
	ДанныеОрганизации.Должность = ПараметрыПисьма.Руководитель.Должность;
	
	ШаблонПисьма = ПриглашенияЭДОСлужебный.ШаблонСоглашенияНаРоуминг(ПараметрыПисьма.ИдентификаторЭДО, ДанныеОрганизации);
	
	Возврат Base64Строка(ШаблонПисьма);
	
КонецФункции

// Возвращает результат формирования приглашений ЭДО.
// 
// Параметры:
//  ДанныеПриглашенийЭДО - Массив из Структура:
//  * ЭтоНовоеПриглашение - Булево
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторКонтрагента - Строка
//  * ПолучательИНН - Строка
//  * ПолучательКПП - Строка
//  * ОператорЭДО - Строка
//  * Организация - Структура:
//  ** ИНН - Строка
//  ** КПП - Строка
//  * Контрагент - Структура:
//  ** НаименованиеСокращенное - Строка
//  ** НаименованиеПолное - Строка
//  ** ИНН - Строка
//  ** КПП - Строка
//  ** ОГРН - Строка
//  ** ЮридическийАдрес - Строка
//  * EmailОрганизации - Строка
//  * EmailКонтрагента - Строка
//  * ТекстПриглашения - Строка
//  * ПисьмоОВыбореОператора - Структура:
//  ** ИмяФайла - Строка
//  ** Данные - Строка - ДвоичныеДанные в формате base64.
//  МаркерыАвторизации - См. СинхронизацияЭДОЦентрЭДО.КлючиСинхронизацииИзМаркеровАвторизации.МаркерыАвторизации
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * Статус - Строка
//  * ДатаИзмененияСтатуса - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ОписаниеОшибки - Строка
Функция СформироватьПриглашенияЭДО(ДанныеПриглашенийЭДО, МаркерыАвторизации) Экспорт
	
	СформированныеПриглашения = Новый Массив; // Массив из См. ИсходящееПриглашениеПоДаннымСервиса
	СтатусыСформированныхПриглашений = Новый Массив; // см. ПриглашенияЭДО.СтатусыПриглашений
	КлючиСформированныхПриглашений = ПриглашенияЭДО.НовыеКлючиПриглашений();
	
	КлючевыеРеквизитыОрганизаций = Новый Массив; // См. ИнтеграцияЭДО.ОрганизацииПоКлючевымРеквизитам.КлючевыеРеквизитыОрганизаций
	КлючевыеРеквизитыКонтрагентов = Новый Массив; // См. ИнтеграцияЭДО.КонтрагентыПоКлючевымРеквизитам.КлючевыеРеквизитыКонтрагентов
	ДанныеКонтрагентовДляСоздания = Новый Массив; // Массив Из См. НовыеПараметрыСозданияКонтрагента
	
	Для Каждого ДанныеПриглашенияЭДО Из ДанныеПриглашенийЭДО Цикл
		
		Если Не ДанныеПриглашенияЭДО.ЭтоНовоеПриглашение Тогда
			Продолжить;
		КонецЕсли;
		
		КлючевыеРеквизитыОрганизаций.Добавить(ДанныеПриглашенияЭДО.Организация);
		
		КлючевыеРеквизитыКонтрагента = ИнтеграцияЭДО.НовыеКлючевыеРеквизитыУчастникаЭДО();
		ЗаполнитьЗначенияСвойств(КлючевыеРеквизитыКонтрагента, ДанныеПриглашенияЭДО.Контрагент);
		КлючевыеРеквизитыКонтрагентов.Добавить(КлючевыеРеквизитыКонтрагента);
		
		ДанныеКонтрагентаДляСоздания = НовыеПараметрыСозданияКонтрагента();
		ЗаполнитьЗначенияСвойств(ДанныеКонтрагентаДляСоздания, ДанныеПриглашенияЭДО.Контрагент);
		ДанныеКонтрагентаДляСоздания.Наименование = ДанныеПриглашенияЭДО.Контрагент.НаименованиеСокращенное;
		ДанныеКонтрагентовДляСоздания.Добавить(ДанныеКонтрагентаДляСоздания);
		
	КонецЦикла;
	
	Контрагенты = НайтиСоздатьКонтрагентов(ДанныеКонтрагентовДляСоздания);
	
	Если Не ЗначениеЗаполнено(Контрагенты) Тогда
		Возврат СтатусыПриглашенийВФорматеСервиса(СтатусыСформированныхПриглашений);
	КонецЕсли;
	
	ОрганизацииПоКлючам = ИнтеграцияЭДО.ОрганизацииПоКлючевымРеквизитам(КлючевыеРеквизитыОрганизаций);
	КонтрагентыПоКлючам = ИнтеграцияЭДО.КонтрагентыПоКлючевымРеквизитам(КлючевыеРеквизитыКонтрагентов);
	
	Для Каждого ДанныеПриглашенияЭДО Из ДанныеПриглашенийЭДО Цикл
		
		Если Не ДанныеПриглашенияЭДО.ЭтоНовоеПриглашение Тогда
			Продолжить;
		КонецЕсли;
		
		Приглашение = ИсходящееПриглашениеПоДаннымСервиса(
			ДанныеПриглашенияЭДО, ОрганизацииПоКлючам, КонтрагентыПоКлючам);
		
		Если ЗначениеЗаполнено(ДанныеПриглашенияЭДО.ПисьмоОВыбореОператора) Тогда
			ДанныеСоглашения = Base64Значение(ДанныеПриглашенияЭДО.ПисьмоОВыбореОператора.Данные);
			УчетныеЗаписиЭДО.ЗаписатьДанныеСоглашенияНаРоуминг(ДанныеПриглашенияЭДО.ИдентификаторОрганизации,
				ДанныеСоглашения, ДанныеПриглашенияЭДО.ПисьмоОВыбореОператора.ИмяФайла);
		КонецЕсли;
		
		ПриглашенияЭДО.ОбновитьПриглашение(Приглашение, Перечисления.СтатусыПриглашений.ТребуетсяОтправить);
		
		НовыйКлюч = КлючиСформированныхПриглашений.Добавить();
		НовыйКлюч.Идентификатор = Приглашение.КлючПриглашения;
		НовыйКлюч.ИдентификаторОрганизации = Приглашение.ИдентификаторОрганизации;
		
		СформированныеПриглашения.Добавить(Приглашение);
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(СформированныеПриглашения) Тогда
		Возврат СтатусыПриглашенийВФорматеСервиса(СтатусыСформированныхПриглашений);
	КонецЕсли;
	
	СтатусыСформированныхПриглашений = ПриглашенияЭДО.СтатусыПриглашений(КлючиСформированныхПриглашений);
	
	Возврат СтатусыПриглашенийВФорматеСервиса(СтатусыСформированныхПриглашений);

КонецФункции

// Возвращает результат отправки приглашений ЭДО.
// 
// Параметры:
//  ДанныеПриглашенийЭДО - Массив из Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторКонтрагента - Строка
//  МаркерыАвторизации - Массив из См. НовыйМаркерАвторизацииПоУчетнойЗаписиЭДО
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * Статус - Строка
//  * ДатаИзмененияСтатуса - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ОписаниеОшибки - Строка
Функция ОтправитьПриглашенияЭДО(ДанныеПриглашенийЭДО, МаркерыАвторизации) Экспорт
	
	КлючиПриглашений = КлючиПриглашенийПоИдентификаторамУчастников(ДанныеПриглашенийЭДО);
	
	СтатусыПриглашений = ПриглашенияЭДО.СтатусыПриглашений(КлючиПриглашений);
	
	ПриглашенияПоИдентификаторам = ПриглашенияЭДО.ИсходящиеПриглашенияПоКлючам(КлючиПриглашений);
	
	ПриглашенияДляОтправки = Новый Массив; // См. ПриглашенияЭДОКлиентСервер.НовоеИсходящееПриглашение
	
	Для Каждого КлючПриглашения Из КлючиПриглашений Цикл
		
		Приглашение = ПриглашенияПоИдентификаторам[КлючПриглашения.Идентификатор];
		
		Если Приглашение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ДоступнаОтправкаПриглашения(Приглашение.КлючПриглашения, СтатусыПриглашений) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыСвязи = ПараметрыСвязиПоПриглашению(Приглашение);
		
		Если ПараметрыСвязи.ОператорыСовпадают Тогда
			
		ИначеЕсли ПараметрыСвязи.СвязьДоступна = -1 Тогда
			
			Продолжить;
			
		ИначеЕсли ПараметрыСвязи.ОтправкаТолькоНаИдентификаторЭДО
			И ПараметрыСвязи.ИдентификаторКонтрагента = ПараметрыСвязи.ОператорКонтрагента Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если Приглашение.Тип = Перечисления.ТипыПриглашений.ЗаявкаНаРоуминг Тогда	
			Приглашение.ТребуетсяСоглашение = ПараметрыСвязи.ТребуетсяСоглашение;
		КонецЕсли;
		
		ПриглашенияДляОтправки.Добавить(Приглашение);
		
	КонецЦикла;
	
	КлючиСинхронизации = СинхронизацияЭДОЦентрЭДО.КлючиСинхронизацииИзМаркеровАвторизации(МаркерыАвторизации);
	
	ПриглашенияЭДОСлужебный.ОтправитьПриглашения(ПриглашенияДляОтправки, КлючиСинхронизации);
	
	СтатусыПриглашений = ПриглашенияЭДО.СтатусыПриглашений(КлючиПриглашений);
	
	Возврат СтатусыПриглашенийВФорматеСервиса(СтатусыПриглашений);
	
КонецФункции

// Возвращает результат принятия приглашения ЭДО.
// 
// Параметры:
//  ДанныеПриглашенийЭДО - Массив из Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторКонтрагента - Строка
//  МаркерыАвторизации - Массив из См. НовыйМаркерАвторизацииПоУчетнойЗаписиЭДО
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * Статус - Строка
//  * ДатаИзмененияСтатуса - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ОписаниеОшибки - Строка
Функция ПринятьПриглашенияЭДО(ДанныеПриглашенийЭДО, МаркерыАвторизации) Экспорт
	
	КлючиПриглашений = КлючиПриглашенийПоИдентификаторамУчастников(ДанныеПриглашенийЭДО);
	
	ПриглашенияПоИдентификаторам = ПриглашенияЭДО.ВходящиеПриглашенияПоКлючам(КлючиПриглашений);
	
	Приглашения = Новый Массив; // См. ПриглашенияЭДОКлиентСервер.НовоеВходящееПриглашение
	
	Для Каждого КлючПриглашения Из КлючиПриглашений Цикл
		
		Приглашение = ПриглашенияПоИдентификаторам[КлючПриглашения.Идентификатор];
		Если Приглашение <> Неопределено
			И ПриглашенияЭДО.ДоступноПринятие(Приглашение.Статус) Тогда
			Приглашения.Добавить(Приглашение);
		КонецЕсли;
		
	КонецЦикла;
	
	КлючиСинхронизации = СинхронизацияЭДОЦентрЭДО.КлючиСинхронизацииИзМаркеровАвторизации(МаркерыАвторизации);
	
	ПриглашенияЭДОСлужебный.ПринятьОтклонитьПриглашения(Приглашения, КлючиСинхронизации, Истина);
	
	СтатусыПриглашений = ПриглашенияЭДО.СтатусыПриглашений(КлючиПриглашений);
	
	СтатусыПриглашенийЭДО = СтатусыПриглашенийВФорматеСервиса(СтатусыПриглашений);
	
	Возврат СтатусыПриглашенийЭДО;
	
КонецФункции

// Отклонить приглашения ЭДО.
// 
// Параметры:
//  ДанныеПриглашенийЭДО - Массив из Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторКонтрагента - Строка
//  * ПричинаОтказа - Строка
//  МаркерыАвторизации - Массив из См. НовыйМаркерАвторизацииПоУчетнойЗаписиЭДО
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * Статус - Строка
//  * ДатаИзмененияСтатуса - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ОписаниеОшибки - Строка
Функция ОтклонитьПриглашенияЭДО(ДанныеПриглашенийЭДО, МаркерыАвторизации) Экспорт
	
	КлючиПриглашений = КлючиПриглашенийПоИдентификаторамУчастников(ДанныеПриглашенийЭДО);
	
	ПриглашенияПоИдентификаторам = ПриглашенияЭДО.ВходящиеПриглашенияПоКлючам(КлючиПриглашений);
	
	Приглашения = Новый Массив; // Массив из см. ПриглашенияЭДОКлиентСервер.НовоеВходящееПриглашение
	
	Для Каждого ДанныеПриглашенияЭДО Из ДанныеПриглашенийЭДО Цикл
		
		Приглашение = ПриглашенияПоИдентификаторам[ДанныеПриглашенияЭДО.Идентификатор];
		Если Приглашение = Неопределено
			ИЛИ Не ПриглашенияЭДО.ДоступноОтклонение(Приглашение.Статус)
			И Не ПриглашенияЭДО.ДоступенОтзыв(Приглашение.Статус) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеПриглашенияЭДО.ПричинаОтказа) Тогда
			Приглашение.ПричинаОтказа = ДанныеПриглашенияЭДО.ПричинаОтказа;
		КонецЕсли;
		
		Приглашения.Добавить(Приглашение);
		
	КонецЦикла;
	
	КлючиСинхронизации = СинхронизацияЭДОЦентрЭДО.КлючиСинхронизацииИзМаркеровАвторизации(МаркерыАвторизации);
	
	ПриглашенияЭДОСлужебный.ПринятьОтклонитьПриглашения(Приглашения, КлючиСинхронизации, Ложь);
	
	СтатусыПриглашений = ПриглашенияЭДО.СтатусыПриглашений(КлючиПриглашений);
	
	СтатусыПриглашенийВФорматеСервиса = СтатусыПриглашенийВФорматеСервиса(СтатусыПриглашений);
	
	Возврат СтатусыПриглашенийВФорматеСервиса;
	
КонецФункции

// Возвращает данные приглашений ЭДО по идентификаторам ключей.
// 
// Параметры:
//  ИдентификаторыПриглашенийЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  См. ДанныеСинхронизацииПриглашенийЭДОПоИдентификаторам
Функция ДанныеСинхронизацииПриглашенийЭДО(ИдентификаторыПриглашенийЭДО) Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторыПриглашенийЭДО) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ЦентрЭДО.АвторизованСлужебныйПользователь() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ДанныеСинхронизации = ДанныеСинхронизацииПриглашенийЭДОПоИдентификаторам(ИдентификаторыПриглашенийЭДО);
	
	Возврат ДанныеСинхронизации;
	
КонецФункции

// Измененные приглашения ЭДО.
// 
// Параметры:
//  МеткиВремениПоИдентификаторамЭДО - Массив из Структура:
//  * МеткаВремени - Число
//  * ИдентификаторЭДО - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * ЭтоПоследний - Булево
//  * НаборДанных - см. ДанныеСинхронизацииПриглашенийЭДО
Функция ПорцияДанныхСинхронизацииПриглашенийЭДОПоМеткамВремени(МеткиВремениПоИдентификаторамЭДО) Экспорт
	
	ПорцияДанных = Новый Структура;
	ПорцияДанных.Вставить("ЭтоПоследний", Ложь);
	ПорцияДанных.Вставить("НаборДанных", Новый Массив);
	
	Если Не ЗначениеЗаполнено(МеткиВремениПоИдентификаторамЭДО) Тогда
		Возврат ПорцияДанных;
	КонецЕсли;
	
	Если ЦентрЭДО.АвторизованСлужебныйПользователь() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Порция = 1000;
	
	НаборДанных = ДанныеПриглашенийЭДОПоМеткамВремени(МеткиВремениПоИдентификаторамЭДО, Порция);
	
	ПорцияДанных.ЭтоПоследний = НаборДанных.Количество() < Порция;
	ПорцияДанных.НаборДанных = НаборДанных;
	
	Возврат ПорцияДанных;
	
КонецФункции

// Возвращает метки времени изменения приглашений ЭДО по идентификаторам.
//
// Параметры:
//  ИдентификаторыПриглашенийЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ИдентификаторПриглашенияЭДО - Строка
//  * МеткаВремени - Неопределено,Число
Функция МеткиВремениПриглашенийЭДО(ИдентификаторыПриглашенийЭДО) Экспорт
	
	МеткиВремениПоИдентификаторам = Новый Соответствие;
	Для Каждого ИдентификаторПриглашенияЭДО Из ИдентификаторыПриглашенийЭДО Цикл
		МеткиВремениПоИдентификаторам.Вставить(ИдентификаторПриглашенияЭДО, 0);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриглашенияЭДО.Ключ КАК ИдентификаторПриглашенияЭДО,
		|	ЕСТЬNULL(МеткиВремениДанныхЭДО.МеткаВремени, 0) КАК МеткаВремени
		|ИЗ
		|	РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами КАК ПриглашенияЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МеткиВремениДанныхЭДО КАК МеткиВремениДанныхЭДО
		|		ПО ПриглашенияЭДО.ИдентификаторОрганизации = МеткиВремениДанныхЭДО.ИдентификаторЭДО
		|		И МеткиВремениДанныхЭДО.ТипДанных = &ТипДанных
		|		И ПриглашенияЭДО.Ключ = МеткиВремениДанныхЭДО.ИдентификаторОбъекта
		|ГДЕ
		|	ПриглашенияЭДО.Ключ В (&ИдентификаторыПриглашенийЭДО)";
	
	Запрос.УстановитьПараметр("ТипДанных", Перечисления.ТипыСинхронизацииСЦентромЭДО.ПриглашенияЭДО);
	Запрос.УстановитьПараметр("ИдентификаторыПриглашенийЭДО", ИдентификаторыПриглашенийЭДО);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		МеткиВремениПоИдентификаторам.Вставить(Выборка.ИдентификаторПриглашенияЭДО, Выборка.МеткаВремени);
	КонецЦикла;
	
	МеткиВремениВФорматеСервиса = Новый Массив; // См. МеткиВремениПриглашенийЭДО
	Для Каждого МеткаВремениПоИдентификатору Из МеткиВремениПоИдентификаторам Цикл
		МеткаВремениВФорматеСервиса = Новый Структура("ИдентификаторПриглашенияЭДО, МеткаВремени",
			МеткаВремениПоИдентификатору.Ключ, МеткаВремениПоИдентификатору.Значение);
		МеткиВремениВФорматеСервиса.Добавить(МеткаВремениВФорматеСервиса);
	КонецЦикла;
	
	Возврат МеткиВремениВФорматеСервиса;
	
КонецФункции

// Возвращает метки времени последних изменений приглашений по идентификаторам ЭДО.
//
// Параметры:
//  ИдентификаторыЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * ИдентификаторЭДО - Строка
//  * МеткаВремени - Неопределено,Число
Функция ПоследниеМеткиВремениПриглашенийЭДО(ИдентификаторыЭДО) Экспорт
	
	Возврат МеткиВремениДанныхЭДО.ПоследниеМеткиВремениОбъектов(ИдентификаторыЭДО,
		Перечисления.ТипыСинхронизацииСЦентромЭДО.ПриглашенияЭДО);
	
КонецФункции

// Параметры:
//  МаркерыАвторизации - Массив из Структура:
//  * ИдентификаторУчетнойЗаписиЭДО - Строка
//  * ОтпечатокСертификата - Строка
//  * Данные - Строка - двоичные данные в формате base64.
// 
// Возвращаемое значение:
//  Структура:
//  * Ошибка - Неопределено,Строка
//  * Количество - Число
Функция ЗагрузитьПриглашенияИзСервисаЭДО(МаркерыАвторизации) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", Неопределено);
	Результат.Вставить("Количество", 0);
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	КлючиСинхронизации = СинхронизацияЭДОЦентрЭДО.КлючиСинхронизацииИзМаркеровАвторизации(МаркерыАвторизации);
	
	Результат.Количество = ПриглашенияЭДО.ПолучитьПриглашения(КлючиСинхронизации, КонтекстДиагностики);
	
	Если ОбработкаНеисправностейБЭДКлиентСервер.ЕстьОшибки(КонтекстДиагностики) Тогда
		Результат.Ошибка = ОбработкаНеисправностейБЭД.ТекстОшибокКонтекстаДиагностики(КонтекстДиагностики);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выборка операторов электронного документооборота.
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//  * Представление - Строка
//  * ИдентификаторОператора - Строка
//  * ИНН - Строка
//  * ЕстьШаблонСоглашенияНаРоуминг - Булево
//  * СрокДействияСоглашенияНаРоуминг - Число
Функция ВыборкаОператоровЭлектронногоДокументооборота()
	
	ЗапросОператоровЭДО = СервисНастроекЭДО.ЗапросОператоровЭДО();
	Выборка = ОбщегоНазначенияБЭД.ВыполнитьЗапрос(ЗапросОператоровЭДО, Истина).Выбрать();
	
	Возврат Выборка;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * Контрагент - Структура:
//  ** ИНН - Строка
//  ** КПП - Строка
//  * ИдентификаторКонтрагента - Строка
//  * ИдентификаторКонтрагентаПредставление - Строка
//  * ИдентификаторКонтрагентаОписание - Строка
//  * ОператорКонтрагента - Строка
//  * ОператорКонтрагентаПредставление - Строка
//  * АбонентВХабе1С - Булево
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторОрганизацииПредставление - Строка
//  * ОператорОрганизации - Строка
//  * ИмяФайлаСоглашенияНаРоуминг - Строка
//  * РекомендацияПоНастройке - Строка
//  * СтатусПриглашенияПредставление - Строка
//  * АбонентАктивен - Булево
//  * СертификатДействителен - Булево
//  * СтатусПодключения - Число
//  * ОператорыСовпадают - Булево
//  * СвязьДоступна - Число
//  * ОтправкаТолькоНаИдентификаторЭДО - Булево
//  * ТребуетсяСоглашение - Булево
//  * СписокВыбора - см. СписокВыбораИдентификаторовКонтрагентаВФорматСервиса
//  * Абоненты - см. АбонентыПараметровСвязиИдентификаторовЭДОВФорматСервиса
//  * ТребуетсяСоглашениеПриПервомПодключении - Булево
//  * ОбязательнаяОтправкаЗаявкиНаРоуминг - Булево
//  * ЗаявкаНаРоумингПринята - Булево
//  * ПриглашениеОтправлено - Булево
//  * ВариантПотребностиСоглашения - Строка
//  * СтатусПриглашенияНаИдентификатор - Строка
//  * СтатусШироковещательногоПриглашения - Строка
//  * СтатусЗаявкиНаРоуминг - Строка
Функция НовыеПараметрыСвязиИдентификаторовАбонентовЭДО()
	Параметры = Новый Структура;
	Параметры.Вставить("Контрагент", Новый Структура);
	Параметры.Контрагент.Вставить("ИНН", "");
	Параметры.Контрагент.Вставить("КПП", "");
	Параметры.Вставить("ИдентификаторКонтрагента", "");
	Параметры.Вставить("ИдентификаторКонтрагентаПредставление", "");
	Параметры.Вставить("ИдентификаторКонтрагентаОписание", "");
	Параметры.Вставить("ОператорКонтрагента", "");
	Параметры.Вставить("ОператорКонтрагентаПредставление", "");
	Параметры.Вставить("АбонентВХабе1С", Ложь);
	Параметры.Вставить("ИдентификаторОрганизации", "");
	Параметры.Вставить("ИдентификаторОрганизацииПредставление", "");
	Параметры.Вставить("ОператорОрганизации", "");
	Параметры.Вставить("ИмяФайлаСоглашенияНаРоуминг", "");
	Параметры.Вставить("РекомендацияПоНастройке", "");
	Параметры.Вставить("СтатусПриглашенияПредставление", "");
	Параметры.Вставить("АбонентАктивен", Ложь);
	Параметры.Вставить("СертификатДействителен", Ложь);
	Параметры.Вставить("СтатусПодключения", 0);
	Параметры.Вставить("ОператорыСовпадают", Ложь);
	Параметры.Вставить("СвязьДоступна", 0);
	Параметры.Вставить("ОтправкаТолькоНаИдентификаторЭДО", Ложь);
	Параметры.Вставить("ТребуетсяСоглашение", Ложь);
	Параметры.Вставить("СписокВыбора", Новый Массив);
	Параметры.Вставить("Абоненты", Новый Массив);
	Параметры.Вставить("ТребуетсяСоглашениеПриПервомПодключении", Ложь);
	Параметры.Вставить("ОбязательнаяОтправкаЗаявкиНаРоуминг", Ложь);
	Параметры.Вставить("ЗаявкаНаРоумингПринята", Ложь);
	Параметры.Вставить("ПриглашениеОтправлено", Ложь);
	Параметры.Вставить("ВариантПотребностиСоглашения", ""); // перечисление
	Параметры.Вставить("СтатусПриглашенияНаИдентификатор", ""); // перечисление
	Параметры.Вставить("СтатусШироковещательногоПриглашения", ""); // перечисление
	Параметры.Вставить("СтатусЗаявкиНаРоуминг", ""); // перечисление
	Возврат Параметры;
КонецФункции

// Параметры:
//  СписокВыбора - СписокЗначений из Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * Наименование - Строка
//  * СтатусПодключения - Число
Функция СписокВыбораИдентификаторовКонтрагентаВФорматСервиса(СписокВыбора)
	
	СписокВыбораВФорматеСервиса = Новый Массив; // См. СписокВыбораИдентификаторовКонтрагентаВФорматСервиса
	
	Если Не ЗначениеЗаполнено(СписокВыбора) Тогда
		Возврат СписокВыбораВФорматеСервиса;
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из СписокВыбора Цикл
		
		ЭлементСпискаВФорматеСервиса = Новый Структура("Идентификатор, Наименование, СтатусПодключения", "", "", 0);
		ЭлементСпискаВФорматеСервиса.Идентификатор = ЭлементСписка.Значение;
		ЭлементСпискаВФорматеСервиса.Наименование = ЭлементСписка.Представление;
		
		Если ЭлементСписка.Картинка = БиблиотекаКартинок.ПодключениеБЭДЗеленая Тогда
			ЭлементСпискаВФорматеСервиса.СтатусПодключения = 3;
		ИначеЕсли ЭлементСписка.Картинка = БиблиотекаКартинок.ПодключениеБЭДЖелтая Тогда 
			ЭлементСпискаВФорматеСервиса.СтатусПодключения = 2;
		КонецЕсли;
		
		СписокВыбораВФорматеСервиса.Добавить(ЭлементСпискаВФорматеСервиса);
		
	КонецЦикла;
	
	Возврат СписокВыбораВФорматеСервиса;
	
КонецФункции

// Параметры:
//  Абоненты - СписокЗначений из Структура:
//  * Идентификатор - Строка
//  * ИНН - Строка
//  * КПП - Строка
// 
// Возвращаемое значение:
//  Массив из Структура:
//  * Идентификатор - Строка
//  * Наименование - Строка
//  * ИНН - Строка
//  * КПП - Строка
Функция АбонентыПараметровСвязиИдентификаторовЭДОВФорматСервиса(Абоненты)
	
	АбонентыВФорматеСервиса = Новый Массив; // См. АбонентыПараметровСвязиИдентификаторовЭДОВФорматСервиса
	
	Если Не ЗначениеЗаполнено(Абоненты) Тогда
		Возврат АбонентыВФорматеСервиса;
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из Абоненты Цикл
		
		СвойстваАбонента = ЭлементСписка.Значение;
		
		ЭлементСпискаВФорматеСервиса = Новый Структура;
		ЭлементСпискаВФорматеСервиса.Вставить("Идентификатор", СвойстваАбонента.Идентификатор);
		ЭлементСпискаВФорматеСервиса.Вставить("Наименование", ЭлементСписка.Представление);
		ЭлементСпискаВФорматеСервиса.Вставить("ИНН", СвойстваАбонента.ИНН);
		ЭлементСпискаВФорматеСервиса.Вставить("КПП", СвойстваАбонента.КПП);
		
		АбонентыВФорматеСервиса.Добавить(ЭлементСпискаВФорматеСервиса);
		
	КонецЦикла;
	
	Возврат АбонентыВФорматеСервиса;
	
КонецФункции

// Параметры:
//  ИдентификаторПриглашения - Строка
//  СтатусыПриглашений - см. ПриглашенияЭДО.СтатусыПриглашений
// 
// Возвращаемое значение:
//  Булево
Функция ДоступнаОтправкаПриглашения(ИдентификаторПриглашения, СтатусыПриглашений)
	
	СтатусПриглашения = СтатусыПриглашений.Найти(ИдентификаторПриглашения, "Идентификатор");
	
	Результат = СтатусПриглашения = Неопределено
		ИЛИ ПриглашенияЭДО.ДоступноОтправитьПовторно(СтатусПриглашения.Статус);
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * Статус - Строка
//  * ОписаниеОшибки - Строка
//  * ДатаИзмененияСтатуса - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
Функция НовыйСтатусПриглашенияВФорматеСервиса()
	СтатусПриглашения = Новый Структура;
	СтатусПриглашения.Вставить("Идентификатор", "");
	СтатусПриглашения.Вставить("ИдентификаторОрганизации", "");
	СтатусПриглашения.Вставить("Статус", "");
	СтатусПриглашения.Вставить("ОписаниеОшибки", "");
	СтатусПриглашения.Вставить("ДатаИзмененияСтатуса", "");
	Возврат СтатусПриглашения;
КонецФункции

// Параметры:
//  СтатусыПриглашений - см. ПриглашенияЭДО.СтатусыПриглашений
// 
// Возвращаемое значение:
//  Массив из см. НовыйСтатусПриглашенияВФорматеСервиса
Функция СтатусыПриглашенийВФорматеСервиса(СтатусыПриглашений)
	
	СтатусыПриглашенийВФорматеСервиса = Новый Массив; // См. СтатусыПриглашенийВФорматеСервиса
	
	Для Каждого СтатусПриглашения Из СтатусыПриглашений Цикл
		СтатусПриглашенияВФорматеСервиса = НовыйСтатусПриглашенияВФорматеСервиса();
		СтатусПриглашенияВФорматеСервиса.Идентификатор = СтатусПриглашения.Идентификатор;
		СтатусПриглашенияВФорматеСервиса.ИдентификаторОрганизации = СтатусПриглашения.ИдентификаторОрганизации;
		СтатусПриглашенияВФорматеСервиса.Статус = ОбщегоНазначения.ИмяЗначенияПеречисления(СтатусПриглашения.Статус);
		СтатусПриглашенияВФорматеСервиса.ОписаниеОшибки = СтатусПриглашения.ОписаниеОшибки;
		СтатусПриглашенияВФорматеСервиса.ДатаИзмененияСтатуса = ОбщегоНазначенияБЭД.ДатаВФорматеISO(
			СтатусПриглашения.ДатаИзмененияСтатуса);
		СтатусыПриглашенийВФорматеСервиса.Добавить(СтатусПриглашенияВФорматеСервиса);
	КонецЦикла;
	
	Возврат СтатусыПриглашенийВФорматеСервиса;
	
КонецФункции

// Параметры:
//  ДанныеПриглашенияЭДО - Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторКонтрагента - Строка
//  * ПолучательИНН - Строка
//  * ПолучательКПП - Строка
//  * ОператорЭДО - Строка
//  * Организация - Структура:
//  ** ИНН - Строка
//  ** КПП - Строка
//  * Контрагент - Структура:
//  ** НаименованиеСокращенное - Строка
//  ** НаименованиеПолное - Строка
//  ** ИНН - Строка
//  ** КПП - Строка
//  ** ОГРН - Строка
//  ** ЮридическийАдрес - Строка
//  * EmailОрганизации - Строка
//  * EmailКонтрагента - Строка
//  * ТекстПриглашения - Строка
//  * ПисьмоОВыбореОператора - Структура:
//  ** ИмяФайла - Строка
//  ** Данные - Строка - ДвоичныеДанные в формате base64.
//  ОрганизацииПоРеквизитам - См. ИнтеграцияЭДО.ОрганизацииПоКлючевымРеквизитам
//  КонтрагентыПоРеквизитам - См. ИнтеграцияЭДО.КонтрагентыПоКлючевымРеквизитам
// 
// Возвращаемое значение:
//  См. ПриглашенияЭДОКлиентСервер.НовоеИсходящееПриглашение
Функция ИсходящееПриглашениеПоДаннымСервиса(ДанныеПриглашенияЭДО, ОрганизацииПоРеквизитам, КонтрагентыПоРеквизитам)
	
	ТипПриглашения = ПриглашенияЭДО.ТипПриглашенияПоКлючевымРеквизитам(ДанныеПриглашенияЭДО);
	
	Приглашение = ПриглашенияЭДОКлиентСервер.НовоеИсходящееПриглашение(ТипПриглашения);
	Приглашение.КлючПриглашения = ДанныеПриглашенияЭДО.Идентификатор;
	Приглашение.Организация = ИнтеграцияЭДО.ОрганизацияИзОтбораПоКлючевымРеквизитам(ОрганизацииПоРеквизитам, ДанныеПриглашенияЭДО.Организация);
	КлючевыеРеквизитыКонтрагента = ИнтеграцияЭДО.НовыеКлючевыеРеквизитыУчастникаЭДО();
	ЗаполнитьЗначенияСвойств(КлючевыеРеквизитыКонтрагента, ДанныеПриглашенияЭДО.Контрагент);
	Приглашение.Контрагент = ИнтеграцияЭДО.КонтрагентИзОтбораПоКлючевымРеквизитам(КонтрагентыПоРеквизитам, КлючевыеРеквизитыКонтрагента);
	Приглашение.ИдентификаторОрганизации = ДанныеПриглашенияЭДО.ИдентификаторОрганизации;
	Приглашение.EmailОрганизации = ДанныеПриглашенияЭДО.EmailОрганизации;
	
	Если ТипПриглашения = Перечисления.ТипыПриглашений.НаИдентификатор Тогда
		Приглашение.ИдентификаторКонтрагента = ДанныеПриглашенияЭДО.ИдентификаторКонтрагента;
	ИначеЕсли ТипПриглашения = Перечисления.ТипыПриглашений.Широковещательное Тогда
		Приглашение.EmailКонтрагента = ДанныеПриглашенияЭДО.EmailКонтрагента;
	ИначеЕсли ТипПриглашения = Перечисления.ТипыПриглашений.ЗаявкаНаРоуминг Тогда
		Приглашение.ОператорЭДО = ДанныеПриглашенияЭДО.ОператорЭДО;
	КонецЕсли;
	
	Приглашение.ПолучательИНН = ДанныеПриглашенияЭДО.ПолучательИНН;
	Приглашение.ПолучательКПП = ДанныеПриглашенияЭДО.ПолучательКПП;
	Приглашение.ТекстПриглашения = ДанныеПриглашенияЭДО.ТекстПриглашения;
	Приглашение.СоздаватьНастройкиЭДО = Истина;
	
	Возврат Приглашение;
	
КонецФункции

// Параметры:
//  Приглашение - см. ПриглашенияЭДОКлиентСервер.НовоеИсходящееПриглашение
// 
// Возвращаемое значение:
//  - Неопределено
//  - СтрокаТаблицыЗначений из см. РаботаСАбонентамиЭДО.ПараметрыСвязиИдентификаторов
Функция ПараметрыСвязиПоПриглашению(Приглашение)
	
	ПараметрыПолученияСвязи = РаботаСАбонентамиЭДО.НовыеПараметрыПолученияСвязиИдентификаторов();
	ПараметрыПолученияСвязи.ИдентификаторыОрганизации = Приглашение.ИдентификаторОрганизации;
	ПараметрыПолученияСвязи.Контрагент = Приглашение.Контрагент;
	
	Если Приглашение.Тип = Перечисления.ТипыПриглашений.НаИдентификатор Тогда
		ПараметрыПолученияСвязи.ИдентификаторыКонтрагента = Приглашение.ИдентификаторКонтрагента;
	ИначеЕсли Приглашение.Тип = Перечисления.ТипыПриглашений.ЗаявкаНаРоуминг Тогда
		ПараметрыПолученияСвязи.ИдентификаторыКонтрагента = Приглашение.ОператорЭДО;
	КонецЕсли;
	
	ПараметрыСвязиИдентификаторов = РаботаСАбонентамиЭДО.ПараметрыСвязиИдентификаторов(ПараметрыПолученияСвязи,
		Неопределено, Истина);
	
	Если ЗначениеЗаполнено(ПараметрыСвязиИдентификаторов) Тогда
		Возврат ПараметрыСвязиИдентификаторов[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Параметры:
//  ДанныеПриглашенийЭДО - Массив из Структура:
//  * Идентификатор - Строка
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторКонтрагента - Строка
// 
// Возвращаемое значение:
//  См. ПриглашенияЭДО.КлючиПриглашенийПоРеквизитам
Функция КлючиПриглашенийПоИдентификаторамУчастников(ДанныеПриглашенийЭДО)
	
	РеквизитыДляПоискаПриглашений = ПриглашенияЭДО.НовыеРеквизитыДляПоискаПриглашений();
	
	Для Каждого ДанныеПриглашенияЭДО Из ДанныеПриглашенийЭДО Цикл
		РеквизитыДляПоискаПриглашения = РеквизитыДляПоискаПриглашений.Добавить();
		РеквизитыДляПоискаПриглашения.Идентификатор = ДанныеПриглашенияЭДО.Идентификатор;
		РеквизитыДляПоискаПриглашения.Тип = Перечисления.ТипыПриглашений.НаИдентификатор;
		РеквизитыДляПоискаПриглашения.ИдентификаторОрганизации = ДанныеПриглашенияЭДО.ИдентификаторОрганизации;
		РеквизитыДляПоискаПриглашения.ИдентификаторКонтрагента = ДанныеПриглашенияЭДО.ИдентификаторКонтрагента;
	КонецЦикла;
	
	КлючиПриглашений = ПриглашенияЭДО.КлючиПриглашенийПоРеквизитам(РеквизитыДляПоискаПриглашений);
	
	Возврат КлючиПриглашений;
	
КонецФункции

// Параметры:
//  ИдентификаторыПриглашенийЭДО - Массив из Строка
// 
// Возвращаемое значение:
//  См. ДанныеСинхронизацииПриглашенийПоВыборке
Функция ДанныеСинхронизацииПриглашенийЭДОПоИдентификаторам(ИдентификаторыПриглашенийЭДО)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныхПриглашенийПоИдентификаторам();
	Запрос.УстановитьПараметр("ИдентификаторыПриглашенийЭДО", ИдентификаторыПриглашенийЭДО);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ДанныеСинхронизацииПриглашенийПоВыборке(Выборка);
	
КонецФункции

// Параметры:
//  МеткиВремениПоИдентификаторамЭДО - см. ПриглашенияЭДОЦентрЭДО.ПорцияДанныхСинхронизацииПриглашенийЭДОПоМеткамВремени.МеткиВремениПоИдентификаторамЭДО
//  Порция - Число
// 
// Возвращаемое значение:
//  См. ДанныеСинхронизацииПриглашенийПоВыборке
Функция ДанныеПриглашенийЭДОПоМеткамВремени(МеткиВремениПоИдентификаторамЭДО, Порция)
	
	ОписаниеЗапроса = Новый Структура("Параметры, Тексты", Новый Структура, Новый Массив);
	
	МеткиВремениДанныхЭДО.ДобавитьТекстЗапросаИдентификаторовДанныхПоМеткамВремени(
		ОписаниеЗапроса, Перечисления.ТипыСинхронизацииСЦентромЭДО.ПриглашенияЭДО,
		МеткиВремениПоИдентификаторамЭДО, Порция);
	
	ДобавитьТекстЗапросаДанныхПриглашенийИзВременнойТаблицыМетокВремени(ОписаниеЗапроса);
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ОписаниеЗапроса.Тексты, ОбщегоНазначения.РазделительПакетаЗапросов());
	Для Каждого Параметр Из ОписаниеЗапроса.Параметры Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат ДанныеСинхронизацииПриглашенийПоВыборке(РезультатыЗапроса[1].Выбрать());
	
КонецФункции

// Параметры:
//  ОписаниеЗапроса - Структура:
//  * Параметры - Структура
//  * Тексты - Массив из Строка
Процедура ДобавитьТекстЗапросаДанныхПриглашенийИзВременнойТаблицыМетокВремени(ОписаниеЗапроса)
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	МеткиВремени.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
		|	МеткиВремени.ИдентификаторЭДО КАК ИдентификаторЭДО,
		|	МеткиВремени.МеткаВремени КАК МеткаВремени,
		|	ПриглашенияЭДО.Ключ КАК Ключ,
		|	ПриглашенияЭДО.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
		|	ПриглашенияЭДО.ИдентификаторКонтрагента КАК ИдентификаторКонтрагента,
		|	ПриглашенияЭДО.ИдентификаторОператора КАК ИдентификаторОператора,
		|	ПриглашенияЭДО.ИНН КАК ИНН,
		|	ПриглашенияЭДО.КПП КАК КПП,
		|	ПриглашенияЭДО.Тип КАК Тип,
		|	ПриглашенияЭДО.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
		|	ЕСТЬNULL(ПриглашенияЭДО.Организация.ИНН, """") КАК ОрганизацияИНН,
		|	ЕСТЬNULL(ПриглашенияЭДО.Организация.КПП, """") КАК ОрганизацияКПП,
		|	ЕСТЬNULL(ПриглашенияЭДО.Контрагент.Наименование, ПриглашенияЭДО.Наименование) КАК КонтрагентНаименование,
		|	ЕСТЬNULL(ПриглашенияЭДО.Контрагент.ИНН, ПриглашенияЭДО.ИНН) КАК КонтрагентИНН,
		|	ЕСТЬNULL(ПриглашенияЭДО.Контрагент.КПП, ПриглашенияЭДО.КПП) КАК КонтрагентКПП,
		|	ПриглашенияЭДО.Наименование КАК Наименование,
		|	ПриглашенияЭДО.EmailКонтрагента КАК EmailКонтрагента,
		|	ПриглашенияЭДО.EmailОрганизации КАК EmailОрганизации,
		|	ПриглашенияЭДО.ТекстПриглашения КАК ТекстПриглашения,
		|	ПриглашенияЭДО.ОписаниеОшибки КАК ОписаниеОшибки,
		|	ПриглашенияЭДО.ПричинаОтказа КАК ПричинаОтказа,
		|	ПриглашенияЭДО.Статус КАК Статус
		|ИЗ
		|	ИдентификаторыДанныхПоМеткамВремени КАК МеткиВремени
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами КАК ПриглашенияЭДО
		|		ПО МеткиВремени.ИдентификаторОбъекта = ПриглашенияЭДО.Ключ";
	
	ОписаниеЗапроса.Тексты.Добавить(ТекстЗапроса);
	
КонецПроцедуры

// Параметры:
//  Выборка - ВыборкаИзРезультатаЗапроса:
//  * ИдентификаторОбъекта - Строка
//  * ИдентификаторЭДО - Строка
//  * МеткаВремени - Число
//  * Ключ - Строка
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторКонтрагента - Строка
//  * ИдентификаторОператора - Строка
//  * ИНН - Строка
//  * КПП - Строка
//  * Тип - Строка
//  * ДатаИзмененияСтатуса - см. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ОрганизацияИНН - Строка
//  * ОрганизацияКПП - Строка
//  * КонтрагентНаименование - Строка
//  * КонтрагентИНН - Строка
//  * КонтрагентКПП - Строка
//  * Наименование - Строка
//  * EmailКонтрагента - Строка
//  * EmailОрганизации - Строка
//  * ТекстПриглашения - Строка
//  * ОписаниеОшибки - Строка
//  * ПричинаОтказа - Строка
//  * Статус - Строка
// 
// Возвращаемое значение:
//  Массив из см. НовыеДанныеСинхронизацииПриглашенияЭДО
Функция ДанныеСинхронизацииПриглашенийПоВыборке(Выборка)
	
	ДанныеПриглашений = Новый Массив; // Массив из см. НовыеДанныеСинхронизацииПриглашенияЭДО
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеПриглашения = НовыеДанныеСинхронизацииПриглашенияЭДО();
		ДанныеПриглашения.Идентификатор = Выборка.ИдентификаторОбъекта;
		ДанныеПриглашений.Добавить(ДанныеПриглашения);
		
		СостояниеСинхронизации = НовоеСостояниеСинхронизацииПриглашенияЭДО();
		СостояниеСинхронизации.ИдентификаторЭДО = Выборка.ИдентификаторЭДО;
		СостояниеСинхронизации.МеткаВремени = Выборка.МеткаВремени;
		СостояниеСинхронизации.Удаление = Не ЗначениеЗаполнено(Выборка.Ключ);
		ДанныеПриглашения.Состояние = СостояниеСинхронизации;
		
		Если Не ЗначениеЗаполнено(Выборка.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		
		Приглашение = НовоеОписаниеПриглашенияЭДО();
		Приглашение.Ключ = Выборка.Ключ;
		Если ЗначениеЗаполнено(Выборка.Тип) Тогда
			Приглашение.Тип = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.Тип);
		КонецЕсли;
		Приглашение.ИдентификаторОрганизации = Выборка.ИдентификаторОрганизации;
		Приглашение.ИдентификаторКонтрагента = Выборка.ИдентификаторКонтрагента;
		Приглашение.Организация.ИНН = Выборка.ОрганизацияИНН;
		Приглашение.Организация.КПП = Выборка.ОрганизацияКПП;
		Приглашение.Контрагент.Наименование = Выборка.КонтрагентНаименование;
		Приглашение.Контрагент.ИНН = Выборка.КонтрагентИНН;
		Приглашение.Контрагент.КПП = Выборка.КонтрагентКПП;
		Приглашение.EmailОрганизации = Выборка.EmailОрганизации;
		Приглашение.EmailКонтрагента = Выборка.EmailКонтрагента;
		Приглашение.ПолучательИНН = Выборка.ИНН;
		Приглашение.ПолучательКПП = Выборка.КПП;
		Приглашение.ИдентификаторОператора = Выборка.ИдентификаторОператора;
		Приглашение.ТекстПриглашения = Выборка.ТекстПриглашения;
		Если ЗначениеЗаполнено(Выборка.Статус) Тогда
			Приглашение.Статус = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.Статус);
		КонецЕсли;
		Приглашение.ДатаИзмененияСтатуса = ОбщегоНазначенияБЭД.ДатаВФорматеISO(Выборка.ДатаИзмененияСтатуса);
		Приглашение.ОписаниеОшибки = Выборка.ОписаниеОшибки;
		ДанныеПриглашения.Описание = Приглашение;
		
	КонецЦикла;
	
	Возврат ДанныеПриглашений;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * Идентификатор - Строка
//  * Состояние - Неопределено
//              - см. НовоеСостояниеСинхронизацииПриглашенияЭДО
//  * Описание - Неопределено,
//             - см. НовоеОписаниеПриглашенияЭДО
Функция НовыеДанныеСинхронизацииПриглашенияЭДО()
	Данные = Новый Структура;
	Данные.Вставить("Идентификатор", "");
	Данные.Вставить("Состояние", Неопределено);
	Данные.Вставить("Описание", Неопределено);
	Возврат Данные;
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ИдентификаторЭДО - Строка 
//  * МеткаВремени - Число
//  * Удаление - Булево
Функция НовоеСостояниеСинхронизацииПриглашенияЭДО()
	Состояние = Новый Структура;
	Состояние.Вставить("ИдентификаторЭДО", "");
	Состояние.Вставить("МеткаВремени", 0);
	Состояние.Вставить("Удаление", Ложь);
	Возврат Состояние;
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * Ключ - Строка
//  * Тип - Строка
//  * ИдентификаторОрганизации - Строка
//  * ИдентификаторКонтрагента - Строка
//  * ПолучательИНН - Строка
//  * ПолучательКПП - Строка
//  * ИдентификаторОператора - Строка
//  * Организация - Структура:
//  ** ИНН - Строка
//  ** КПП - Строка
//  * Контрагент - Структура:
//  ** Наименование - Строка
//  ** ИНН - Строка
//  ** КПП - Строка
//  * EmailОрганизации - Строка
//  * EmailКонтрагента - Строка
//  * ТекстПриглашения - Строка
//  * ПричинаОтказа - Строка
//  * Статус - Строка
//  * ДатаИзмененияСтатуса - См. ОбщегоНазначенияБЭД.ДатаВФорматеISO
//  * ОписаниеОшибки - Строка
Функция НовоеОписаниеПриглашенияЭДО()
	Приглашение = Новый Структура;
	Приглашение.Вставить("Ключ", "");
	Приглашение.Вставить("Тип", "");
	Приглашение.Вставить("ИдентификаторОрганизации", "");
	Приглашение.Вставить("ИдентификаторКонтрагента", "");
	Приглашение.Вставить("ПолучательИНН", "");
	Приглашение.Вставить("ПолучательКПП", "");
	Приглашение.Вставить("ИдентификаторОператора", "");
	Приглашение.Вставить("Организация", Новый Структура);
	Приглашение.Организация.Вставить("ИНН", "");
	Приглашение.Организация.Вставить("КПП", "");
	Приглашение.Вставить("Контрагент", Новый Структура);
	Приглашение.Контрагент.Вставить("Наименование", "");
	Приглашение.Контрагент.Вставить("ИНН", "");
	Приглашение.Контрагент.Вставить("КПП", "");
	Приглашение.Вставить("EmailОрганизации", "");
	Приглашение.Вставить("EmailКонтрагента", "");
	Приглашение.Вставить("ТекстПриглашения", "");
	Приглашение.Вставить("ПричинаОтказа", "");
	Приглашение.Вставить("Статус", "");
	Приглашение.Вставить("ДатаИзмененияСтатуса", "");
	Приглашение.Вставить("ОписаниеОшибки", "");
	Возврат Приглашение;
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ТекстЗапросаДанныхПриглашенийПоИдентификаторам()
	
	Возврат
		"ВЫБРАТЬ
		|	МеткиВремениДанныхЭДО.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
		|	МеткиВремениДанныхЭДО.ИдентификаторЭДО КАК ИдентификаторЭДО,
		|	МеткиВремениДанныхЭДО.МеткаВремени КАК МеткаВремени,
		|	ПриглашенияЭДО.Ключ КАК Ключ,
		|	ПриглашенияЭДО.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
		|	ПриглашенияЭДО.ИдентификаторКонтрагента КАК ИдентификаторКонтрагента,
		|	ПриглашенияЭДО.ИдентификаторОператора КАК ИдентификаторОператора,
		|	ПриглашенияЭДО.ИНН КАК ИНН,
		|	ПриглашенияЭДО.КПП КАК КПП,
		|	ПриглашенияЭДО.Тип КАК Тип,
		|	ПриглашенияЭДО.ДатаИзмененияСтатуса КАК ДатаИзмененияСтатуса,
		|	ЕСТЬNULL(ПриглашенияЭДО.Организация.ИНН, """") КАК ОрганизацияИНН,
		|	ЕСТЬNULL(ПриглашенияЭДО.Организация.КПП, """") КАК ОрганизацияКПП,
		|	ЕСТЬNULL(ПриглашенияЭДО.Контрагент.Наименование, ПриглашенияЭДО.Наименование) КАК КонтрагентНаименование,
		|	ЕСТЬNULL(ПриглашенияЭДО.Контрагент.ИНН, ПриглашенияЭДО.ИНН) КАК КонтрагентИНН,
		|	ЕСТЬNULL(ПриглашенияЭДО.Контрагент.КПП, ПриглашенияЭДО.КПП) КАК КонтрагентКПП,
		|	ПриглашенияЭДО.Наименование КАК Наименование,
		|	ПриглашенияЭДО.EmailКонтрагента КАК EmailКонтрагента,
		|	ПриглашенияЭДО.EmailОрганизации КАК EmailОрганизации,
		|	ПриглашенияЭДО.ТекстПриглашения КАК ТекстПриглашения,
		|	ПриглашенияЭДО.ОписаниеОшибки КАК ОписаниеОшибки,
		|	ПриглашенияЭДО.ПричинаОтказа КАК ПричинаОтказа,
		|	ПриглашенияЭДО.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами КАК ПриглашенияЭДО
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МеткиВремениДанныхЭДО КАК МеткиВремениДанныхЭДО
		|		ПО МеткиВремениДанныхЭДО.ИдентификаторЭДО = ПриглашенияЭДО.ИдентификаторОрганизации
		|		И МеткиВремениДанныхЭДО.ТипДанных = ЗНАЧЕНИЕ(Перечисление.ТипыСинхронизацииСЦентромЭДО.ПриглашенияЭДО)
		|		И МеткиВремениДанныхЭДО.ИдентификаторОбъекта = ПриглашенияЭДО.Ключ
		|ГДЕ
		|	ПриглашенияЭДО.Ключ В (&ИдентификаторыПриглашенийЭДО)";
		
КонецФункции

// Параметры:
//  ДанныеКонтрагентов - Массив из Структура:
//  * НаименованиеСокращенное - Строка
//  * НаименованиеПолное - Строка
//  * ИНН - Строка
//  * КПП - Строка
//  * ОГРН - Строка
//  * ЮридическийАдрес - Строка
// 
// Возвращаемое значение:
//  Массив Из ОпределяемыйТип.КонтрагентБЭД
Функция НайтиСоздатьКонтрагентов(ДанныеКонтрагентов)
	
	КонтрагентыПоКлючам = ИнтеграцияЭДО.КонтрагентыПоКлючевымРеквизитам(ДанныеКонтрагентов);
	
	Контрагенты = Новый Массив; // Массив Из ОпределяемыйТип.КонтрагентБЭД
	Если КонтрагентыПоКлючам.Количество() <> ДанныеКонтрагентов.Количество() Тогда
		Для Каждого ДанныеКонтрагента Из ДанныеКонтрагентов Цикл 
			Отбор = Новый Структура("ИНН, КПП", ДанныеКонтрагента.ИНН, ДанныеКонтрагента.КПП);
			НайденныеСтроки = КонтрагентыПоКлючам.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() Тогда
				Контрагенты.Добавить(НайденныеСтроки[0].Ссылка);
			Иначе
				ПараметрыСоздания = НовыеПараметрыСозданияКонтрагента();
				ЗаполнитьЗначенияСвойств(ПараметрыСоздания, ДанныеКонтрагента);
				Контрагент = СоздатьКонтрагента(ПараметрыСоздания);
				ОбщегоНазначенияБЭД.ДобавитьЗаполненноеЗначение(Контрагенты, Контрагент);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Контрагенты = КонтрагентыПоКлючам.ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Контрагенты;
	
КонецФункции

// Параметры:
//  ПараметрыСоздания - См. НовыеПараметрыСозданияКонтрагента
//  
// Возвращаемое значение:
//  Неопределено,ОпределяемыйТип.КонтрагентБЭД
Функция СоздатьКонтрагента(ПараметрыСоздания)
	
	Контрагент = Неопределено; // Неопределено,ОпределяемыйТип.КонтрагентБЭД
	ОбменСКонтрагентамиПереопределяемый.СоздатьКонтрагентаПоРеквизитам(ПараметрыСоздания, Контрагент);
	Возврат Контрагент;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * Наименование - Строка
// * НаименованиеПолное - Строка
// * ИНН - Строка
// * КПП - Строка
Функция НовыеПараметрыСозданияКонтрагента()
	Параметры = Новый Структура;
	Параметры.Вставить("Наименование", "");
	Параметры.Вставить("НаименованиеПолное", "");
	Параметры.Вставить("ИНН", "");
	Параметры.Вставить("КПП", "");
	Возврат Параметры;
Конецфункции

#КонецОбласти