#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыПлатформаСервер.ВывестиОтчет(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
	ДокументРезультат.ФиксацияСверху = 8;
	
	Если ПравоПользователя("ВыводитьКодВОтчетах") Тогда
		ДокументРезультат.ФиксацияСлева = 2;
	Иначе
		ДокументРезультат.ФиксацияСлева = 1;
	КонецЕсли;
	
КонецПроцедуры //ПриКомпоновкеРезультата()


#КонецЕсли