#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
	
Функция ПолучитьДанныеПоДням()
	
	ДатаНачала = ОтчетыПлатформаСервер.КомпоновщикПолучитьЗначениеПараметра("НачалоПериода",    КомпоновщикНастроек.Настройки);
	ДатаКонца = ОтчетыПлатформаСервер.КомпоновщикПолучитьЗначениеПараметра("КонецПериода",    КомпоновщикНастроек.Настройки);
	
	тзВыборка = Новый ТаблицаЗначений;
	тзВыборка.Колонки.Добавить("ПодразделениеКомпании");	
	тзВыборка.Колонки.Добавить("ТоварнаяМарка");
	тзВыборка.Колонки.Добавить("ТовараНетНаСкладе");
	тзВыборка.Колонки.Добавить("ТоварЕстьНаСкладе");
	тзВыборка.Колонки.Добавить("КоэффициентУстойчивости");
	тзВыборка.Колонки.Добавить("КоэффициентПрисутствия");
	
	Если ДатаНачала=Неопределено Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ОстаткиТоваровКомпании.Период КАК Период
		               |ИЗ
		               |	РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Период");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДатаНачала = Выборка.Период;
		КонецЕсли; 
	КонецЕсли; 
	Если ДатаКонца=Неопределено Тогда
		ДатаКонца = ТекущаяДата();
	КонецЕсли;
	ДатаПериода = ДатаНачала;
	КоличествоПроверок = 0;
	
	ЗапросПоДням = Новый Запрос;
	ЗапросПоДням.Текст ="ВЫБРАТЬ
	                    |	СУММА(ВЫБОР
	                    |			КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоНачальныйОстаток + ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоПриход + ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоРасход > 0
	                    |				ТОГДА 0
	                    |			ИНАЧЕ 1
	                    |		КОНЕЦ) КАК ТовараНетНаСкладе,
	                    |	МАКСИМУМ(ВЫБОР
	                    |			КОГДА ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоНачальныйОстаток + ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоПриход + ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоРасход > 0
	                    |				ТОГДА 1
	                    |			ИНАЧЕ 0
	                    |		КОНЕЦ) КАК ТоварЕстьНаСкладе,
	                    |	ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                    |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ТоварнаяМарка КАК ТоварнаяМарка,
	                    |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ЗначениеАссортиментаТоварнойМарки КАК Ассортимент
	                    |ИЗ
	                    |	РегистрСведений.ОграничениеАссортиментаПодразделения.СрезПоследних(&ДатаКон, {(ПодразделениеКомпании).* КАК ПодразделениеКомпании, (Номенклатура).* КАК Номенклатура}) КАК ОграничениеАссортиментаПодразделенияСрезПоследних
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , {(Номенклатура).* КАК Номенклатура}) КАК ОстаткиТоваровКомпанииОстаткиИОбороты
	                    |		ПО ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура = ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура
	                    |ГДЕ
	                    |	ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании,
	                    |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ТоварнаяМарка,
	                    |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ЗначениеАссортиментаТоварнойМарки
	                    |ИТОГИ
	                    |	СУММА(ТовараНетНаСкладе),
	                    |	МАКСИМУМ(ТоварЕстьНаСкладе)
	                    |ПО
	                    |	ПодразделениеКомпании,
	                    |	ТоварнаяМарка,
	                    |	Ассортимент ";

	Пока ДатаПериода<КонецДня(ДатаКонца) Цикл
		ДатаПериодаНач = Новый Граница(НачалоДня(ДатаПериода),ВидГраницы.Включая);
		ДатаПериодаКон = Новый Граница(КонецДня(ДатаПериода),ВидГраницы.Включая);		
		ЗапросПоДням.УстановитьПараметр("ДатаНач", ДатаПериодаНач);
		ЗапросПоДням.УстановитьПараметр("ДатаКон", ДатаПериодаКон);
		
		ВыборкаПоПодразделениям = ЗапросПоДням.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПодразделениеКомпании");
		Пока ВыборкаПоПодразделениям.Следующий() Цикл
			ВыборкаПоТоварнымМаркам = ВыборкаПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТоварнаяМарка");
			Пока ВыборкаПоТоварнымМаркам.Следующий() Цикл
				СтруктураОтбора = Новый Структура();
				СтруктураОтбора.Вставить("ПодразделениеКомпании",ВыборкаПоТоварнымМаркам.ПодразделениеКомпании);
				СтруктураОтбора.Вставить("ТоварнаяМарка",ВыборкаПоТоварнымМаркам.ТоварнаяМарка);
				НайденныеСтроки = тзВыборка.НайтиСтроки(СтруктураОтбора);
				
				Если НайденныеСтроки.Количество()=0 Тогда
					СтрокаДанных = тзВыборка.Добавить();
					СтрокаДанных.ПодразделениеКомпании = ВыборкаПоТоварнымМаркам.ПодразделениеКомпании;					
					СтрокаДанных.ТоварнаяМарка = ВыборкаПоТоварнымМаркам.ТоварнаяМарка;
					СтрокаДанных.ТовараНетНаСкладе = ВыборкаПоТоварнымМаркам.ТовараНетНаСкладе;
					СтрокаДанных.ТоварЕстьНаСкладе = ВыборкаПоТоварнымМаркам.ТоварЕстьНаСкладе;
				Иначе 
					СтрокаДанных = НайденныеСтроки[0];
					СтрокаДанных.ТовараНетНаСкладе = СтрокаДанных.ТовараНетНаСкладе + ВыборкаПоТоварнымМаркам.ТовараНетНаСкладе;
					СтрокаДанных.ТоварЕстьНаСкладе = СтрокаДанных.ТоварЕстьНаСкладе + ВыборкаПоТоварнымМаркам.ТоварЕстьНаСкладе;
				КонецЕсли; 
			КонецЦикла;
		КонецЦикла;
		ДатаПериода = ДатаПериода + 86400;
		КоличествоПроверок = КоличествоПроверок + 1;
	КонецЦикла; 
	
	Запрос = Новый Запрос ("ВЫБРАТЬ
	                       |	ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                       |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ТоварнаяМарка КАК ТоварнаяМарка,
	                       |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ЗначениеАссортиментаТоварнойМарки) КАК ЗначениеАссортиментаТоварнойМарки
	                       |ИЗ
	                       |	РегистрСведений.ОграничениеАссортиментаПодразделения.СрезПоследних(&ДатаКон, ) КАК ОграничениеАссортиментаПодразделенияСрезПоследних
	                       |ГДЕ
	                       |	ОграничениеАссортиментаПодразделенияСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
	                       |
	                       |СГРУППИРОВАТЬ ПО
	                       |	ОграничениеАссортиментаПодразделенияСрезПоследних.ПодразделениеКомпании,
	                       |	ОграничениеАссортиментаПодразделенияСрезПоследних.Номенклатура.ТоварнаяМарка
	                       |ИТОГИ
	                       |	СУММА(ЗначениеАссортиментаТоварнойМарки)
	                       |ПО
	                       |	ПодразделениеКомпании,
	                       |	ТоварнаяМарка");	
	Запрос.УстановитьПараметр("ДатаКон",Новый Граница(КонецДня(ДатаКонца),ВидГраницы.Включая));
	
	ВыборкаПоПодразделениям = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПодразделениеКомпании");
	Пока ВыборкаПоПодразделениям.Следующий() Цикл
		ВыборкаПоТоварнымМаркам = ВыборкаПоПодразделениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ТоварнаяМарка");
		Пока ВыборкаПоТоварнымМаркам.Следующий() Цикл
			СтруктураОтбора = Новый Структура();
			СтруктураОтбора.Вставить("ПодразделениеКомпании",ВыборкаПоТоварнымМаркам.ПодразделениеКомпании);
			СтруктураОтбора.Вставить("ТоварнаяМарка",ВыборкаПоТоварнымМаркам.ТоварнаяМарка);
			НайденныеСтроки = тзВыборка.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество()>0 Тогда
				СтрокаДанных = НайденныеСтроки[0];
				СтрокаДанных.КоэффициентУстойчивости = 1 - ?(КоличествоПроверок*ВыборкаПоТоварнымМаркам.ЗначениеАссортиментаТоварнойМарки=0,0,(СтрокаДанных.ТовараНетНаСкладе/(КоличествоПроверок*ВыборкаПоТоварнымМаркам.ЗначениеАссортиментаТоварнойМарки)));
				СтрокаДанных.КоэффициентПрисутствия = ?(КоличествоПроверок=0,0,СтрокаДанных.ТоварЕстьНаСкладе/КоличествоПроверок*100);
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла;
	
	Возврат тзВыборка
	
КонецФункции


	
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	ТаблицаРезультат = ПолучитьДанныеПоДням();
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаРезультат", ТаблицаРезультат);
	
	ОтчетыПлатформаСервер.ВывестиОтчет(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, ВнешниеНаборыДанных);
	
КонецПроцедуры
#КонецЕсли