#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Групповое изменение объектов.

// Возвращает реквизиты объекта, которые разрешается редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("СпособУстановкиКурса");
	Результат.Добавить("Наценка");
	Результат.Добавить("ОсновнаяВалюта");
	Результат.Добавить("ФормулаРасчетаКурса");
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Загрузка данных из файла

// Запрещает загрузку данных в этот справочник из подсистемы "ЗагрузкаДанныхИзФайла".
// Т.к. справочник реализует свой метод обновления данных.
//
Функция ИспользоватьЗагрузкуДанныхИзФайла() Экспорт
	Возврат Ложь;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Регистрирует на плане обмена ОбновлениеИнформационнойБазы объекты,
// которые необходимо обновить на новую версию.
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Валюты.Ссылка
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Код = ""643""
	|	И Валюты.СпособУстановкиКурса = ЗНАЧЕНИЕ(Перечисление.СпособыУстановкиКурсаВалюты.ЗагрузкаИзИнтернета)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Результат = Запрос.Выполнить().Выгрузить();
	МассивСсылок = Результат.ВыгрузитьКолонку("Ссылка");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, МассивСсылок);
	
КонецПроцедуры

// Отключает у валюты 643 загрузку из интернета.
Процедура ОтключитьЗагрузкуКурсаВалюты643ИзИнтернета(Параметры) Экспорт
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, "Справочник.Валюты");
	Пока Выборка.Следующий() Цикл
		Валюта = Выборка.Ссылка.ПолучитьОбъект();
		Валюта.СпособУстановкиКурса = Перечисления.СпособыУстановкиКурсаВалюты.РучнойВвод;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Валюта);
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, "Справочник.Валюты");
КонецПроцедуры

// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	Валюта = Справочники.Валюты.НайтиПоКоду("643");
	
	Если ЗначениеЗаполнено(Валюта) Тогда
		Валюта = Валюта.ПолучитьОбъект();
	Иначе
		Валюта = Справочники.Валюты.СоздатьЭлемент();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Валюта.НаименованиеПолное) Тогда
		Валюта.НаименованиеПолное = НСтр("ru = 'Российский рубль'");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Валюта.Код) Тогда
		Валюта.Код = "643";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Валюта.Наименование) Тогда
		Валюта.Наименование = "RUB";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Валюта.ЗагружаетсяИзИнтернета) Тогда
		Валюта.ЗагружаетсяИзИнтернета    = ЛОЖЬ;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Валюта.СпособУстановкиКурса) Тогда
		Валюта.СпособУстановкиКурса      = Перечисления.СпособыУстановкиКурсаВалюты.РучнойВвод;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Валюта.ПараметрыПрописиНаРусском) Тогда
		Валюта.ПараметрыПрописиНаРусском = НСтр("ru = 'рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2 знака'");
	КонецЕсли;
	
	// Сохранение элемента
	НовыйЭлемент = Валюта.ЭтоНовый();
	Попытка
		Валюта.Записать();
		ВывестиСообщение(НСтр("ru='Справочник ""Валюты"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Создан","Обновлен"), СокрЛП(Валюта.Наименование));
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Валюты""'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли