// Общий модуль "Управление контактной информацией (платформа, сервер)"

////////////////////////////////////////////////////////////////////////////////
// ОБНОВЛЕНИЕ ИНФОРМАЦИОННОЙ БАЗЫ

Процедура ОбновитьПредопределенныеВидыКонтактнойИнформацииПодразделенийКомпании() Экспорт
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид                                     = "ЮрАдресПодразделенияКомпании";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 1;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ЛОЖЬ;
	ПараметрыВида.НастройкиПроверки.АдресТолькоРоссийский = ЛОЖЬ;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид                                     = "ФактАдресПодразделенияКомпании";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 2;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ЛОЖЬ;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид                                     = "ТелефонПодразделенияКомпании";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 3;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Факс);
	ПараметрыВида.Вид                                     = "ФаксПодразделенияКомпании";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 4;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид                                     = "EmailПодразделенияКомпании";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 5;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	ПараметрыВида.Вид                                     = "ВебСтраницаПодразделенияКомпании";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 6;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ЛОЖЬ;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Другое);
	ПараметрыВида.Вид                                     = "ДругаяИнформацияПодразделенияКомпании";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 7;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ЛОЖЬ;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Другое);
	ПараметрыВида.Вид                                     = "МессенджерПодразделенияКомпании";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 8;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	ПараметрыВида.Вид                                     = "СоцСетьПодразделенияКомпании";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 9;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
КонецПроцедуры

Процедура ОбновитьПредопределенныеВидыКонтактнойИнформацииОрганизаций() Экспорт
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид                                     = "ЮрАдресОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 1;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ЛОЖЬ;
	ПараметрыВида.НастройкиПроверки.АдресТолькоРоссийский = ЛОЖЬ;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид                                     = "ФактАдресОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 2;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ЛОЖЬ;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид                                     = "ТелефонОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 3;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Факс);
	ПараметрыВида.Вид                                     = "ФаксОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 4;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид                                     = "EmailОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 5;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	ПараметрыВида.Вид                                     = "ВебСтраницаОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 6;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ЛОЖЬ;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Другое);
	ПараметрыВида.Вид                                     = "ДругаяИнформацияОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 7;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ЛОЖЬ;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Другое);
	ПараметрыВида.Вид                                     = "МессенджерОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 8;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	ПараметрыВида.Вид                                     = "СоцСетьОрганизации";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 9;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);

	
КонецПроцедуры

Процедура ОбновитьПредопределенныеВидыКонтактнойИнформацииКонтрагентов() Экспорт
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид                                     = "ЮрАдресКонтрагента";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 1;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ЛОЖЬ;
	ПараметрыВида.НастройкиПроверки.АдресТолькоРоссийский = ЛОЖЬ;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид                                     = "ФактАдресКонтрагента";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 2;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ЛОЖЬ;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид                                     = "ТелефонКонтрагента";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 3;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Факс);
	ПараметрыВида.Вид                                     = "ФаксКонтрагента";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 4;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид                                     = "EmailКонтрагента";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 5;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	ПараметрыВида.Вид                                     = "ВебСтраницаКонтрагента";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 6;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ЛОЖЬ;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Другое);
	ПараметрыВида.Вид                                     = "ДругаяИнформацияКонтрагента";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 7;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ЛОЖЬ;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Другое);
	ПараметрыВида.Вид                                     = "МессенджерКонтрагента";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 8;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	ПараметрыВида.Вид                                     = "СоцСетьКонтрагента";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 9;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);

	
КонецПроцедуры

Процедура ОбновитьПредопределенныеВидыКонтактнойИнформацииСотрудников() Экспорт
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид                                     = "ЮрАдресСотрудника";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 1;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ЛОЖЬ;
	ПараметрыВида.НастройкиПроверки.АдресТолькоРоссийский = ЛОЖЬ;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид                                     = "ФактАдресСотрудника";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 2;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ЛОЖЬ;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид                                     = "ТелефонСотрудника";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 3;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Факс);
	ПараметрыВида.Вид                                     = "ФаксСотрудника";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 4;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид                                     = "EmailСотрудника";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 5;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид                                     = "ПочтовыйАдресСотрудника";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 6;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	ПараметрыВида.Вид                                     = "ВебСтраницаСотрудника";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 7;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ЛОЖЬ;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Другое);
	ПараметрыВида.Вид                                     = "ДругаяИнформацияСотрудника";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 8;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ЛОЖЬ;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Другое);
	ПараметрыВида.Вид                                     = "МессенджерСотрудника";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 9;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
	ПараметрыВида.Вид                                     = "СоцСетьСотрудника";
	ПараметрыВида.МожноИзменятьСпособРедактирования       = ИСТИНА;
	ПараметрыВида.РедактированиеТолькоВДиалоге            = ЛОЖЬ;
	ПараметрыВида.ОбязательноеЗаполнение                  = ЛОЖЬ;
	ПараметрыВида.Порядок                                 = 10;
	ПараметрыВида.РазрешитьВводНесколькихЗначений         = ИСТИНА;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);

	
КонецПроцедуры

