// Модуль менеджера документа "Акт списания ЕГАИС	"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


Процедура ОтправитьАктыПостановкиНаБаланс(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	АктПостановкиНаБалансЕГАИС.Ссылка
	|ИЗ
	|	Документ.АктПостановкиНаБалансЕГАИС КАК АктПостановкиНаБалансЕГАИС
	|ГДЕ
	|	АктПостановкиНаБалансЕГАИС.НомерАктаСписания = """" И 
	|	АктПостановкиНаБалансЕГАИС.АктСписания = &ДокументСсылка
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		АктПостановкиНаБалансЕГАИС = Выборка.Ссылка.ПолучитьОбъект();
		АктПостановкиНаБалансЕГАИС.НомерАктаСписания = ДокументСсылка.РегистрационныйНомер;
		АктПостановкиНаБалансЕГАИС.Записать(РежимЗаписиДокумента.Проведение);
		
		ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные;
		ДанныеДляВыполненияОбменаНаКлиенте = ИнтеграцияЕГАИСВызовСервера.ПодготовитьКПередаче(АктПостановкиНаБалансЕГАИС.Ссылка, ДальнейшееДействие);
	КонецЕсли;
	
КонецПроцедуры

Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	ИтогиОперации.Вставить("СуммаДокумента", 0);
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

Функция АктСписанияЕГАИСXML(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	АктСписанияЕГАИС.ХозОперация,
	|	АктСписанияЕГАИС.ОрганизацияЕГАИС,
	|	АктСписанияЕГАИС.ОрганизацияЕГАИС.Код КАК ИдентификаторФСРАР,
	|	АктСписанияЕГАИС.Идентификатор,
	|	АктСписанияЕГАИС.Номер,
	|	АктСписанияЕГАИС.Дата,
	|	ВЫРАЗИТЬ(АктСписанияЕГАИС.Комментарий КАК Строка(500)) КАК Комментарий,
	|	АктСписанияЕГАИС.ПричинаСписания КАК ПричинаСписания,
	|	АктСписанияЕГАИС.Товары.(
	|		НомерСтроки,
	|		АлкогольнаяПродукция,
	|		Количество,
	//|		ВЫБОР
	//|			КОГДА АлкогольнаяПродукция.Упакована ТОГДА
	//|				Количество * Коэффициент
	//|			ИНАЧЕ
	//|				(Количество * Коэффициент)/10
	//|		КОНЕЦ КАК Количество,
	|		СуммаРозничная,
	|		Справка2.Номер КАК НомерСправки2,
	|		ИдентификаторСтроки
	|	) КАК Товары,
	|	АктСписанияЕГАИС.Марки.(
	|	КодМарки,
	|	ИдентификаторСтроки
	|	) КАК Марки
	|ИЗ
	|	Документ.АктСписанияЕГАИС КАК АктСписанияЕГАИС
	|ГДЕ
	|	АктСписанияЕГАИС.Ссылка = &Ссылка И 
	|	АктСписанияЕГАИС.ПометкаУдаления = ЛОЖЬ
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		
		ПараметрыЗапроса = ПараметрыОбъектов[Перечисления.ВидыОбъектовЕГАИС.АктСписанияВерсия3];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	Если Выборка.ХозОперация = Справочники.ХозОперации.АктСписанияЕГАИС Тогда
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктСписанияВерсия3;
	Иначе
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктСписанияИзТорговогоЗала;
	КонецЕсли;
	
	Товары = Выборка.Товары.Выгрузить();
	Если Товары.Количество() = 0 Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		ПараметрыЗапроса  = ПараметрыОбъектов[ВидСообщения];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ИдентификаторФСРАР", Выборка.ИдентификаторФСРАР);
	ДанныеДляВыгрузки.Вставить("Объект",             ДокументСсылка);
	ДанныеДляВыгрузки.Вставить("ШапкаДокумента",     Выборка);
	ДанныеДляВыгрузки.Вставить("ТаблицаТоваров",     Товары);
	Если Выборка.ХозОперация = Справочники.ХозОперации.АктСписанияЕГАИС Тогда
		ДанныеДляВыгрузки.Вставить("ТаблицаМарок", Выборка.Марки.Выгрузить());
	ИначеЕсли Выборка.ПричинаСписания = Перечисления.ПричиныСписанияЕГАИС.Проверки ИЛИ Выборка.ПричинаСписания = Перечисления.ПричиныСписанияЕГАИС.Арест ИЛИ
			Выборка.ПричинаСписания = Перечисления.ПричиныСписанияЕГАИС.Реализация Тогда
		ДанныеДляВыгрузки.Вставить("ТаблицаМарок", Выборка.Марки.Выгрузить());
	КонецЕсли;
	
	СообщенияXML = ИнтеграцияЕГАИС.СформироватьСообщенияXML(ВидСообщения, ДанныеДляВыгрузки, 3);
	
	Возврат СообщенияXML;
	
КонецФункции

Функция ЗапросНаОтменуПроведенияXML(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	АктСписанияЕГАИС.ХозОперация,
	|	АктСписанияЕГАИС.ОрганизацияЕГАИС,
	|	АктСписанияЕГАИС.ОрганизацияЕГАИС.Код КАК ИдентификаторФСРАР,
	|	АктСписанияЕГАИС.Номер,
	|	АктСписанияЕГАИС.Дата,
	|	АктСписанияЕГАИС.РегистрационныйНомер
	|ИЗ
	|	Документ.АктСписанияЕГАИС КАК АктСписанияЕГАИС
	|ГДЕ
	|	АктСписанияЕГАИС.Ссылка = &Ссылка И 
	|	АктСписанияЕГАИС.ПометкаУдаления = ЛОЖЬ
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		
		ПараметрыЗапроса = ПараметрыОбъектов[Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияСписания];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияСписания;
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ИдентификаторФСРАР", Выборка.ИдентификаторФСРАР);
	ДанныеДляВыгрузки.Вставить("Объект",             ДокументСсылка);
	ДанныеДляВыгрузки.Вставить("ШапкаДокумента",     Выборка);
	
	СообщенияXML = ИнтеграцияЕГАИС.СформироватьСообщенияXML(ВидСообщения, ДанныеДляВыгрузки, 2);
	
	Возврат СообщенияXML;
	
КонецФункции

#Область ДействияПриОбменеЕГАИС

// Статус после подготовки к передаче данных.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктСписанияЕГАИС - Ссылка на документ.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - ВидСообщения ЕГАИС.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения) Экспорт
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктСписания
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктСписанияВерсия2
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктСписанияВерсия3
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктСписанияИзТорговогоЗала Тогда
		ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.КПередаче;
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияСписания Тогда
		ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияКПередаче;
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыКПередаче(ДокументСсылка, ВидСтатуса);
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Статус после передачи данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктСписанияЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * СтатусОбработки - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки) Экспорт
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктСписания
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктСписанияИзТорговогоЗала
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктСписанияВерсия2
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктСписанияВерсия3 Тогда
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		
		ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПереданВУТМ;
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПолученЕГАИС);
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПроведенЕГАИС);
		
		ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи;
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусовБазовыйПроцесс);
		
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияСписания Тогда
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		
		ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияПереданВУТМ;
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПолученЕГАИС);
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПроведенЕГАИС);
		
		ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОшибка;
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения);
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусовБазовыйПроцесс);
		
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Статус после получения данных из ЕГАИС.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктСписанияЕГАИС - Документ, для которого требуется обновить статус.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения обмена с ЕГАИС.
//  ДополнительныеПараметры - Неопределено, Структура со свойствами:
//   * СтатусОбработки - Перечисление.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения.
//   * ВидСообщенияКвитанции - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения, на которую получена квитанция.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ХозОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ХозОперация");
	
	ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
	ВидыСтатусовБазовыйПроцесс.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПроведенЕГАИС;
	ВидыСтатусовБазовыйПроцесс.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОбрабатываетсяЕГАИС;
	ВидыСтатусовБазовыйПроцесс.ОшибкаПроведения = Неопределено;
	ВидыСтатусовБазовыйПроцесс.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи;
	ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные);
	ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется);
	Если ХозОперация = Справочники.ХозОперации.АктСписанияЕГАИС Тогда
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения);
	КонецЕсли;
	ВидыСтатусовБазовыйПроцесс.УведомлениеОРегистрацииДвижения = Ложь;
	
	ВидыСтатусовЗапросНаОтменуПроведения = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
	ВидыСтатусовЗапросНаОтменуПроведения.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен;
	ВидыСтатусовЗапросНаОтменуПроведения.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОбрабатываетсяЕГАИС;
	ВидыСтатусовЗапросНаОтменуПроведения.ОтменаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен;
	ВидыСтатусовЗапросНаОтменуПроведения.ОшибкаПроведения = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОшибка;
	ВидыСтатусовЗапросНаОтменуПроведения.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОшибка;
	ВидыСтатусовЗапросНаОтменуПроведения.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения);
	ВидыСтатусовЗапросНаОтменуПроведения.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
	ВидыСтатусовЗапросНаОтменуПроведения.УведомлениеОРегистрацииДвижения = Ложь;
	
	ВыполнитьРасчетТекущегоСостояния = Истина;
	Если ДополнительныеПараметры <> Неопределено
		И ДополнительныеПараметры.Свойство("ТекущееСостояние")
		И ДополнительныеПараметры.ТекущееСостояние <> Неопределено Тогда
		ВыполнитьРасчетТекущегоСостояния = ДополнительныеПараметры.ТекущееСостояние;
	КонецЕсли;
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияДоставлена Тогда
		
		ВидыСтатусов = Неопределено;
		Если ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктСписания
			Или ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктСписанияИзТорговогоЗала
			Или ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктСписанияВерсия2
			Или ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктСписанияВерсия3 Тогда
			
			ВидыСтатусов = ВидыСтатусовБазовыйПроцесс;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияСписания Тогда
			
			ВидыСтатусов = ВидыСтатусовЗапросНаОтменуПроведения;
			
		Иначе
			ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
		КонецЕсли;
		
		Если ВидыСтатусов <> Неопределено Тогда
			ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыПриПолученииКвитанции(
				ДокументСсылка,
				"КвитанцияДоставлена", ДополнительныеПараметры.СтатусОбработки,
				ВидыСтатусов, ВыполнитьРасчетТекущегоСостояния);
		КонецЕсли;
		
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияВыполнена Тогда
		
		ВидыСтатусов = Неопределено;
		Если ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктСписания
			Или ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктСписанияИзТорговогоЗала
			Или ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктСписанияВерсия2
			Или ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктСписанияВерсия3 Тогда
			
			ВидыСтатусов = ВидыСтатусовБазовыйПроцесс;
			
		ИначеЕсли ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияСписания Тогда
			
			ВидыСтатусов = ВидыСтатусовЗапросНаОтменуПроведения;
			
		Иначе
			ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
		КонецЕсли;
		
		Если ВидыСтатусов <> Неопределено Тогда
			ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыПриПолученииКвитанции(
				ДокументСсылка,
				"КвитанцияВыполнена", ДополнительныеПараметры.СтатусОбработки,
				ВидыСтатусов, ВыполнитьРасчетТекущегоСостояния);
		КонецЕсли;
		
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Обновить статус после подготовки к передаче данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктСписанияЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обновить статус после передачи данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктСписанияЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
		
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктСписания
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктСписанияИзТорговогоЗала
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктСписанияВерсия2
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктСписанияВерсия3 Тогда
		
		Если НовыйСтатусПослеОбновления = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПереданВУТМ Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	АктСписанияЕГАИССмены.Смена КАК Смена
			|ИЗ
			|	Документ.АктСписанияЕГАИС.Смены КАК АктСписанияЕГАИССмены
			|ГДЕ
			|	АктСписанияЕГАИССмены.Ссылка = &Ссылка
			|";
			Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
			
			МетаданныеЗакрытиеСмены = Метаданные.Документы.ЗакрытиеСмены;
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(Выборка.Смена);
				ТекущееСостояние.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется;
				ТекущееСостояние.ВидСтатуса          = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктСписанияПереданВЕГАИС;
				ТекущееСостояние.СтатусОбработки     = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработки(МетаданныеЗакрытиеСмены, ТекущееСостояние.ВидСтатуса);
				
				РегистрыСведений.СтатусыДокументовЕГАИС.ВыполнитьЗаписьВРегистр(ТекущееСостояние);
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обновить статус после получения данных из ЕГАИС.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктСписанияЕГАИС - Документ, для которого требуется обновить статус.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения обмена с ЕГАИС.
//  ДополнительныеПараметры - Неопределено, Структура со свойствами:
//   * СтатусОбработки - Перечисление.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения.
//   * ВидСообщенияКвитанции - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения, на которую получена квитанция.
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
		
		
	ВидСообщенияКвитанции = ДополнительныеПараметры.ВидСообщенияКвитанции;
	
	Если ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктСписания
		Или ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктСписанияИзТорговогоЗала
		Или ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктСписанияВерсия2
		Или ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктСписанияВерсия3 Тогда
		
		Если НовыйСтатусПослеОбновления = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПроведенЕГАИС Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	АктСписанияЕГАИССмены.Смена КАК Смена
			|ИЗ
			|	Документ.АктСписанияЕГАИС.Смены КАК АктСписанияЕГАИССмены
			|ГДЕ
			|	АктСписанияЕГАИССмены.Ссылка = &Ссылка
			|";
			Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
			
			МетаданныеЗакрытиеСмены = Метаданные.Документы.ЗакрытиеСмены;
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(Выборка.Смена);
				ТекущееСостояние.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется;
				ТекущееСостояние.ВидСтатуса          = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктСписанияПереданВЕГАИС;
				ТекущееСостояние.СтатусОбработки     = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработки(МетаданныеЗакрытиеСмены, ТекущееСостояние.ВидСтатуса);
				
				РегистрыСведений.СтатусыДокументовЕГАИС.ВыполнитьЗаписьВРегистр(ТекущееСостояние);
				
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияСписания Тогда
		
		Если НовыйСтатусПослеОбновления = Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	АктСписанияЕГАИССмены.Смена КАК Смена
			|ИЗ
			|	Документ.АктСписанияЕГАИС.Смены КАК АктСписанияЕГАИССмены
			|ГДЕ
			|	АктСписанияЕГАИССмены.Ссылка = &Ссылка
			|";
			Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
			
			МетаданныеЗакрытиеСмены = Метаданные.Документы.ЗакрытиеСмены;
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(Выборка.Смена);
				ТекущееСостояние.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется;
				ТекущееСостояние.ВидСтатуса          = Перечисления.ВидыСтатусовОбработкиЕГАИС.АктСписанияНеСформирован;
				ТекущееСостояние.СтатусОбработки     = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработки(МетаданныеЗакрытиеСмены, ТекущееСостояние.ВидСтатуса);
				
				РегистрыСведений.СтатусыДокументовЕГАИС.ВыполнитьЗаписьВРегистр(ТекущееСостояние);
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Получить последовательность операций в течении жизненного цикла документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктСписанияЕГАИС - Документ, для которого требуется обновить статус.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. функцию ИнтеграцияЕГАИС.ПустаяТаблицаПоследовательностьОпераций().
//
Функция ПоследовательностьОпераций(ДокументСсылка) Экспорт
	
	ХозОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ХозОперация");
	
	Таблица = ИнтеграцияЕГАИС.ПустаяТаблицаПоследовательностьОпераций();
	
	Исходящее = Перечисления.ВходящееИсходящееСобытие.Исходящее;
	Входящее  = Перечисления.ВходящееИсходящееСобытие.Входящее;
	
	Если ХозОперация = Справочники.ХозОперации.АктСписанияЕГАИС Тогда
		
		ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0, Исходящее, Перечисления.ВидыОбъектовЕГАИС.АктСписанияВерсия3,       ДокументСсылка);
		ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0, Исходящее, Перечисления.ВидыОбъектовЕГАИС.ОтменаПроведенияСписания, ДокументСсылка);
		
	ИначеЕсли ХозОперация = Справочники.ХозОперации.АктСписанияСТорговогоЗалаЕГАИС Тогда
		
		ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0, Исходящее, Перечисления.ВидыОбъектовЕГАИС.АктСписанияИзТорговогоЗала, ДокументСсылка);
		
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

// Выполнить перерасчет статуса.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктСписанияЕГАИС - Документ, по которому требуется рассчитать статус оформления.
//  ПредыдущийСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиЕГАИС - Предыдущий статус.
//  НовыйСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиЕГАИС - Предыдущий статус.
// 
//Процедура РассчитатьСтатусОформления(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус) Экспорт
//	
//	Если КонечныеСтатусы().Найти(НовыйСтатус) = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ЗначенияРеквизитов = СтруктураРеквизитыРасчетаСтатусаОформления();
//	
//	//Если ТипЗнч(Источник) = Тип("ДокументОбъект.АктСписанияЕГАИС")
//	//	Или ТипЗнч(Источник) = Тип("ДокументСсылка.АктСписанияЕГАИС") Тогда
//	//	
//	//	Если ТипЗнч(Источник) = Тип("ДокументОбъект.АктСписанияЕГАИС") Тогда
//	//		ИсточникСсылка = Источник.ДокументОснование;
//	//	Иначе
//	//		ИсточникСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "ДокументОснование");
//	//	КонецЕсли;
//	//	
//	//	Если ЗначениеЗаполнено(ИсточникСсылка) Тогда
//	//		
//	//		Запрос = Новый Запрос(
//	//		"ВЫБРАТЬ
//	//		|	Таблица.Проведен      КАК Проведен,
//	//		|	Таблица.Дата          КАК Дата,
//	//		|	Таблица.Номер         КАК Номер,
//	//		|	Таблица.Организация   КАК Организация,
//	//		|	Таблица.ПодразделениеКомпании КАК ПодразделениеКомпании,
//	//		|	Таблица.Автор КАК Автор
//	//		|ИЗ
//	//		|	" + ИсточникСсылка.Метаданные().ПолноеИмя() + " КАК Таблица
//	//		|ГДЕ
//	//		|	Таблица.Ссылка = &Ссылка");
//	//		
//	//		Запрос.УстановитьПараметр("Ссылка", ИсточникСсылка);
//	//		Выборка = Запрос.Выполнить().Выбрать();
//	//		Выборка.Следующий();
//	//		
//	//		ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, Выборка);
//	//		
//	//	КонецЕсли;
//	//	
//	//Иначе
//	//	
//	//	ИсточникСсылка = Источник.Ссылка;
//	//	
//	//	ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, Источник);
//	//	
//	//	ЗначенияРеквизитов.Организация     = Источник.Организация;
//	//	ЗначенияРеквизитов.ПодразделениеКомпании = Источник.ПодразделениеКомпании;
//	//	
//	//КонецЕсли;
//	
//	Если Не ЗначениеЗаполнено(ИсточникСсылка) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	//ЗаписьТребуется = ТребуетсяОформлениеДокументовЕГАИС(
//	//ИсточникСсылка,
//	//Метаданные.Документы.АктСписанияЕГАИС);
//	//
//	//ИнтеграцияЕГАИС.РассчитатьСтатусОформления(
//	//Метаданные.Документы.АктСписанияЕГАИС,
//	//ИсточникСсылка, ЗначенияРеквизитов, ЗаписьТребуется);
//	
//КонецПроцедуры

// Обработчик изменения статуса документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктСписанияЕГАИС - Документ.
//  ПредыдущийСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиЕГАИС - Предыдущий статус.
//  НовыйСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиЕГАИС - Предыдущий статус.
//  ПараметрыОбновленияСтатуса - Структура - см. функцию ИнтеграцияЕГАИС.ПараметрыОбновленияСтатуса().
//
Процедура ПриИзмененииСтатусаДокумента(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус, ПараметрыОбновленияСтатуса) Экспорт
	
	ВидыСтатусовДвижений = ВидыСтатусовДвижений();
	
	ДобавитьДвижения = ИнтеграцияЕГАИС.СтатусТребуетДобавленияДвижений(ВидыСтатусовДвижений, ПредыдущийСтатус, НовыйСтатус);
	УдалитьДвижения = ИнтеграцияЕГАИС.СтатусТребуетУдаленияДвижений(ВидыСтатусовДвижений, ПредыдущийСтатус, НовыйСтатус);
	
	Если ПараметрыОбновленияСтатуса.ОбновлятьДвижения
		И (ДобавитьДвижения Или УдалитьДвижения) Тогда
		
		ДополнительныеСвойстваДляПроведения = Новый Структура;
		ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, ДополнительныеСвойстваДляПроведения);
		
		ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойстваДляПроведения);
		
		НаборЗаписей = РегистрыНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписей.Загрузить(ДополнительныеСвойстваДляПроведения.ТаблицыДляДвижений["ОстаткиАлкогольнойПродукцииЕГАИС"]);
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыНакопления.ОстаткиМарокЕГАИС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписей.Загрузить(ДополнительныеСвойстваДляПроведения.ТаблицыДляДвижений["ОстаткиМарокЕГАИС"]);
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	Если ДобавитьДвижения И 
		НовыйСтатус = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПроведенЕГАИС И 
		ДокументСсылка.ПричинаСписания = Перечисления.ПричиныСписанияЕГАИС.Пересортица Тогда
		
		ОтправитьАктыПостановкиНаБаланс(ДокументСсылка);
		
	КонецЕсли;
	
	//РассчитатьСтатусОформления(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус);
	
КонецПроцедуры

#КонецОбласти

#Область Статусы

// Возвращает статусы ошибок.
//
// Возвращаемое значение:
//  Массив - Статусы ошибок.
//
Функция ВидыСтатусовОшибки() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПроведенияЕГАИС);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗапросНаОтменуПроведенияОшибка);
	
	//Статусы = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусыОбработки(Метаданные.Документы.АктСписанияЕГАИС, ВидыСтатусов);
	
	Возврат ВидыСтатусов;
	
КонецФункции

// Возвращает конечные статусы.
//
// Возвращаемое значение:
//  Массив - Конечные статусы.
//
Функция КонечныеВидыСтатусов() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПроведенияЕГАИС);
	
	//Статусы = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусыОбработки(Метаданные.Документы.АктСписанияЕГАИС, ВидыСтатусов);
	
	Возврат ВидыСтатусов;
	
КонецФункции

// Возвращает запрос для получения статуса оформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Документ основание.
// 
// Возвращаемое значение:
//  Запрос - Запрос для получения статуса оформления.
//
Функция ЗапросСтатусаОформления(ДокументОснование) Экспорт
	
	Запрос = ИнтеграцияЕГАИС.ЗапросСтатусаОформленияДействияНеОпределены();
	Запрос.УстановитьПараметр("КонечныеВидыСтатусовАктСписанияЕГАИС", КонечныеВидыСтатусов());
	
	Возврат Запрос;
	
КонецФункции

// Возвращает статусы движений.
//
// Возвращаемое значение:
//  Массив - Статусы.
//
Функция ВидыСтатусовДвижений() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ПроведенЕГАИС);
	
//	Статусы = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусыОбработки(Метаданные.Документы.АктСписанияЕГАИС, ВидыСтатусов);
	
	Возврат ВидыСтатусов;
	
КонецФункции

#КонецОбласти

Функция СообщениеКПередачеXML(ДокументСсылка, ДальнейшееДействие, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные Тогда
		
		Возврат АктСписанияЕГАИСXML(ДокументСсылка);
		
	ИначеЕсли ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения Тогда
		
		Возврат ЗапросНаОтменуПроведенияXML(ДокументСсылка);
		
	КонецЕсли;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("ОрганизацияЕГАИС");
	ОбязательныеРеквизиты.Добавить("ПричинаСписания");
	
	Если НЕ ПравоПользователя("ПроведениеНезаполненныхДокументов", Объект) Тогда
		ОбязательныеРеквизиты.Добавить("Товары");
	КонецЕсли;
	
	ОбязательныеРеквизиты.Добавить("Товары.АлкогольнаяПродукция");
	ОбязательныеРеквизиты.Добавить("Товары.Количество");

	Если Объект.ХозОперация = Справочники.ХозОперации.АктСписанияЕГАИС Тогда
		ОбязательныеРеквизиты.Добавить("Марки.КодМарки");
		ОбязательныеРеквизиты.Добавить("Товары.Справка2"); 
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов табличных частей
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПараметрыДействия=Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен",   Объект.Товары.Количество() > 0);
	ПараметрыДействия.Вставить("ОрганизацияЕГАИС", Объект.ОрганизацияЕГАИС);
	Если Объект.ХозОперация = Справочники.ХозОперации.АктСписанияСТорговогоЗалаЕГАИС Тогда
		ПараметрыДействия.Вставить("ТорговыйЗал", Истина);
	Иначе
		ПараметрыДействия.Вставить("ТорговыйЗал", Ложь);
	КонецЕсли;
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДокументОснованиеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Прописать проверку соответствия реквизитов объекта выбранной хоз.операции
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	ткОбработкаТабличнойЧастиТовары.ЗаполнитьРеквизитОстатокАлкоПродукции(Объект, Неопределено, "Товары", ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "ОрганизацияЕГАИС".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияЕГАИСПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	ткОбработкаТабличнойЧастиТовары.ЗаполнитьРеквизитОстатокАлкоПродукции(Объект, Неопределено, "Товары", ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияЕГАИСПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Алкогольная продукция" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ТоварыАлкогольнаяПродукцияПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.АлкогольнаяПродукцияПриИзменении(Объект, Строка, ПараметрыДействия);

КонецПроцедуры // ТоварыАлкогольнаяПродукцияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ТоварыНоменклатураПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.НоменклатураПриИзменении(Объект, Строка, ПараметрыДействия);
	
	// Проверим, имеют ли смысл дальнейшие действия
	//Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Отказ", ЛОЖЬ) Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если НЕ ЗначениеЗаполнено(Строка.Номенклатура) Тогда
	//	Возврат;
	//КонецЕсли;
	
	//ТоварыЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в таблице "Товары".
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	//Строка.ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(Строка.Номенклатура);
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ОбработатьИзменениеЕдиницаИзмерения(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Характеристика номенклатуры" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.ХарактеристикаНоменклатурыПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыКоличествоПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Строка.СуммаРозничная = Строка.ЦенаРозничная*Строка.Количество;
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Количество" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыЦенаРозничнаяПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Строка.СуммаРозничная = Строка.ЦенаРозничная*Строка.Количество;
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Количество" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыСуммаРозничнаяПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если Строка.Количество = 0 Тогда
		Строка.ЦенаРозничная = Строка.СуммаРозничная;
	Иначе
		Строка.ЦенаРозничная = Строка.СуммаРозничная/Строка.Количество;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Алкогольная продукция" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ТоварыСправка2ПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Строка.АлкогольнаяПродукция = Строка.Справка2.АлкогольнаяПродукция;
	ОбработкаТабличнойЧастиТовары.Справка2ПриИзменении(Объект, Строка, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСправка2ПриИзмененииПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "Марки"

// Обработчик события возникающего при изменении данных реквизита "Алкогольная продукция" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура МаркиКодМаркиПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.МаркиКодМаркиПриИзменении(Объект, Строка, ПараметрыДействия);
		
КонецПроцедуры // МаркиКодМаркиПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОВЕДЕНИЕ 

Функция ТекстЗапросаОстаткиАлкогольнойПродукцииЕГАИС(ТекстыЗапроса)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&ДатаРегистрации                   КАК Период,
	|	&Ссылка                            КАК Регистратор,
	|	&ОрганизацияЕГАИС                  КАК ОрганизацияЕГАИС,
	|	&ХозОперация                       КАК ХозОперация,
	|	ТаблицаТовары.НомерСтроки          КАК НомерСтроки,
	|	ТаблицаТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ТаблицаТовары.Справка2             КАК Справка2,
	|	ТаблицаТовары.Количество           КАК Количество
	//|	ВЫБОР
	//|		КОГДА ТаблицаТовары.АлкогольнаяПродукция.Упакована = ИСТИНА ТОГДА
	//|			ТаблицаТовары.Количество*ТаблицаТовары.Коэффициент
	//|		ИНАЧЕ
	//|			ТаблицаТовары.Количество*ТаблицаТовары.Коэффициент/10
	//|	КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.АктСписанияЕГАИС.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка И 
	|	&ВидСтатуса В (&ВидыСтатусовДвижений)
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаТовары.НомерСтроки";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, "ОстаткиАлкогольнойПродукцииЕГАИС");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаОстаткиМарокЕГАИС(ТекстыЗапроса)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&ДатаРегистрации                   КАК Период,
	|	&Ссылка                            КАК Регистратор,
	|	&ОрганизацияЕГАИС                  КАК ОрганизацияЕГАИС,
	|	&ХозОперация                       КАК ХозОперация,
	|	АктСписанияМарки.НомерСтроки   КАК НомерСтроки,
	|	АктСписанияМарки.КодМарки КАК  КодМарки,
	|	АктСписанияТовары.Справка2 КАК Справка2,
	|	1 КАК Количество
	|ИЗ
	|	Документ.АктСписанияЕГАИС.Марки КАК АктСписанияМарки
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.АктСписанияЕГАИС.Товары КАК АктСписанияТовары
	|ПО
	|	АктСписанияМарки.Ссылка = АктСписанияТовары.Ссылка И 
	|	АктСписанияМарки.ИдентификаторСтроки = АктСписанияТовары.ИдентификаторСтроки И 
	|	(НЕ АктСписанияМарки.КодМарки = """")
	|ГДЕ
	|	АктСписанияМарки.Ссылка = &Ссылка И 
	|	&ВидСтатуса В (&ВидыСтатусовДвижений)
	|УПОРЯДОЧИТЬ ПО
	|	АктСписанияМарки.НомерСтроки
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, "ОстаткиМарокЕГАИС");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаОстаткиАлкогольнойПродукцииЕГАИС(ТекстыЗапроса);
	ТекстЗапросаОстаткиМарокЕГАИС(ТекстыЗапроса);
	
	ИнтеграцияЕГАИС.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеШапки.Дата                  КАК Период,
	|	ДанныеШапки.Ссылка                КАК Ссылка,
	|	ДанныеШапки.ОрганизацияЕГАИС      КАК ОрганизацияЕГАИС,
	|	ДанныеШапки.ДатаРегистрации       КАК ДатаРегистрации,
	|	ДанныеШапки.ХозОперация           КАК ХозОперация,
	|	СтатусыДокументовЕГАИС.ВидСтатуса КАК ВидСтатуса
	|ИЗ
	|	Документ.АктСписанияЕГАИС КАК ДанныеШапки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|ПО
	|	СтатусыДокументовЕГАИС.Документ = ДанныеШапки.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",               Реквизиты.Период);
	Запрос.УстановитьПараметр("Ссылка",               Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("ВидСтатуса",           Реквизиты.ВидСтатуса);
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС",     Реквизиты.ОрганизацияЕГАИС);
	Запрос.УстановитьПараметр("ДатаРегистрации",      Реквизиты.ДатаРегистрации);
	Запрос.УстановитьПараметр("ХозОперация",          Реквизиты.ХозОперация);
	Запрос.УстановитьПараметр("ВидыСтатусовДвижений", ВидыСтатусовДвижений());
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьОперацию(ПараметрыКоманды, "Отбор","ЗаполнениеДокументовКлиент.ПолучитьОтборОрганизацияПодразделение", ИСТИНА);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина);
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ЗакрытиеСмены", "Документ.ЗакрытиеСмены.ФормаСписка",ПараметрыФормы,, ИСТИНА, НСтр("ru = 'Необходимо выбрать документ закрытия смены.'"));
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьАлкогольнойПродукциейПоРезультатамПродаж",, "Товары", НСтр("ru = 'Заполнить алкогольной продукцией по результатам продаж'"), ПараметрыКоманды);
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью команд заполнения объекта
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть не доступны в зависимости от параметров объекта
	ДоступностьКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ДоступностьКоманд;
	
КонецФункции // ПолучитьДоступностьКомандЗаполнения()

// Обработчик заполнения документа по заказам контрагенту
//
Функция ТоварыЗаполнитьАлкогольнойПродукциейПоРезультатамПродаж(Объект, ПараметрыЗаполнения, ПараметрыДействия=Неопределено) Экспорт
	
	МассивЗакрытийСмен =ПараметрыЗаполнения.ЗакрытиеСмены;
	Организация = МассивЗакрытийСмен[0].Организация;
	Подразделение = МассивЗакрытийСмен[0].ПодразделениеКомпании;
	СкладКомпании = МассивЗакрытийСмен[0].СкладКомпании;
	МинимальнаяДатаЗакрытиеСмен  = МассивЗакрытийСмен[0].Дата;
	МаксимальнаяДатаЗакрытиеСмен = МассивЗакрытийСмен[0].Дата;
	Смены = Объект.Смены;
	Смены.Очистить();
	
	ЕстьНаОстатках = Ложь;
	Если ПараметрыЗаполнения.Свойство("ЕстьНаОстатках") Тогда
		ЕстьНаОстатках = Истина;	
	КонецЕсли;
	
	Для Каждого ДокЗакрытие Из МассивЗакрытийСмен Цикл
		Если ДокЗакрытие.Организация <> Организация ИЛИ
			ДокЗакрытие.ПодразделениеКомпании <> Подразделение ИЛИ
			ДокЗакрытие.СкладКомпании <> СкладКомпании Тогда 
			ВывестиСообщение(НСтр("ru='В выбранных документах значения реквизитов ""Организация"", ""Подразделение"" и ""Склад"" должны быть одинаковыми.'"));
			Возврат Ложь;
		КонецЕсли;	
		Если ДокЗакрытие.Дата <  МинимальнаяДатаЗакрытиеСмен Тогда 
			МинимальнаяДатаЗакрытиеСмен = ДокЗакрытие.Дата;
		КонецЕсли;	 
		Если ДокЗакрытие.Дата >  МаксимальнаяДатаЗакрытиеСмен Тогда 
			МаксимальнаяДатаЗакрытиеСмен = ДокЗакрытие.Дата;
		КонецЕсли;
		
		НоваяСтрока = Смены.Добавить();
		НоваяСтрока.Смена = ДокЗакрытие;
		
	КонецЦикла;
	
	Если НЕ Объект.ХозОперация = Справочники.ХозОперации.АктСписанияСТорговогоЗалаЕГАИС Тогда
		Объект.ХозОперация = Справочники.ХозОперации.АктСписанияСТорговогоЗалаЕГАИС;
		ПараметрыДействия.Вставить("ИзмениласьХозОперация", Истина);
	КонецЕсли;
	
	Объект.ПричинаСписания = Перечисления.ПричиныСписанияЕГАИС.Реализация;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистраторы",      МассивЗакрытийСмен);
	Запрос.УстановитьПараметр("ХозОперация",      Справочники.ХозОперации.ЗакрытиеСмены);
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", Объект.ОрганизацияЕГАИС);
	
	Запрос.Текст  = "ВЫБРАТЬ
	                |	УчетАлкоголя.Номенклатура КАК Номенклатура,
	                |	СУММА(УчетАлкоголя.Количество * УчетАлкоголя.Коэффициент) КАК Количество,
	                |	СУММА(УчетАлкоголя.СуммаВсего) КАК СуммаВсего
	                |ПОМЕСТИТЬ УчетАлкоголя
	                |ИЗ
	                |	Документ.ЗакрытиеСмены.Товары КАК УчетАлкоголя
	                |ГДЕ
	                |	УчетАлкоголя.Ссылка В(&Регистраторы)
	                |	И УчетАлкоголя.Номенклатура.ВидАлкогольнойПродукции.Маркируемый = ЛОЖЬ
	                |	И УчетАлкоголя.Ссылка.ХозОперация = &ХозОперация
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	УчетАлкоголя.Номенклатура
	                |
	                |ИМЕЮЩИЕ
	                |	СУММА(УчетАлкоголя.Количество * УчетАлкоголя.Коэффициент) <> 0
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	УчетАлкоголя.Номенклатура КАК Номенклатура,
	                |	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция
	                |ПОМЕСТИТЬ СоответствиеНоменклатуры
	                |ИЗ
	                |	УчетАлкоголя КАК УчетАлкоголя
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	                |		ПО УчетАлкоголя.Номенклатура = СоответствиеНоменклатурыЕГАИС.Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	УчетАлкоголя.Номенклатура КАК Номенклатура,
	                |	УчетАлкоголя.СуммаВсего КАК СуммаВсего,
	                |	УчетАлкоголя.Количество КАК КоличествоПоНакладной,
	                |	ВЫБОР
	                |		КОГДА УчетАлкоголя.Номенклатура.КоличествоВМультипаке = 0
	                |				ИЛИ УчетАлкоголя.Номенклатура.КоличествоВМультипаке ЕСТЬ NULL
	                |			ТОГДА 1
	                |		ИНАЧЕ УчетАлкоголя.Номенклатура.КоличествоВМультипаке
	                |	КОНЕЦ КАК КоличествоВМультипаке,
	                |	ВЫБОР
	                |		КОГДА УчетАлкоголя.Номенклатура.КоличествоВМультипаке = 0
	                |				ИЛИ УчетАлкоголя.Номенклатура.КоличествоВМультипаке ЕСТЬ NULL
	                |			ТОГДА УчетАлкоголя.Количество
	                |		ИНАЧЕ УчетАлкоголя.Количество * УчетАлкоголя.Номенклатура.КоличествоВМультипаке
	                |	КОНЕЦ КАК Количество
	                |ИЗ
	                |	УчетАлкоголя КАК УчетАлкоголя
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	СоответствиеНоменклатуры.Номенклатура КАК Номенклатура,
	                |	СоответствиеНоменклатуры.АлкогольнаяПродукция КАК АлкогольнаяПродукция
	                |ИЗ
	                |	СоответствиеНоменклатуры КАК СоответствиеНоменклатуры
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	                |	ОстаткиАлкогольнойПродукцииЕГАИС.КоличествоОстаток КАК Количество,
	                |	ОстаткиАлкогольнойПродукцииЕГАИС.Справка2 КАК Справка2,
	                |	ОстаткиАлкогольнойПродукцииЕГАИС.Справка2.ДатаТТН КАК Справка2ДатаТТН
	                |ИЗ
	                |	РегистрНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.Остатки(
	                |			,
	                |			(ОрганизацияЕГАИС, АлкогольнаяПродукция) В
	                |				(ВЫБРАТЬ
	                |					&ОрганизацияЕГАИС,
	                |					СоответствиеНоменклатуры.АлкогольнаяПродукция
	                |				ИЗ
	                |					СоответствиеНоменклатуры)) КАК ОстаткиАлкогольнойПродукцииЕГАИС
	                |ГДЕ
	                |	ОстаткиАлкогольнойПродукцииЕГАИС.АлкогольнаяПродукция.ВидПродукции.Маркируемый = ЛОЖЬ
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	АлкогольнаяПродукция,
	                |	Справка2ДатаТТН";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаУчетАлкоголя = Результат[2].Выгрузить();
	
	Если ТаблицаУчетАлкоголя.Количество() = 0 Тогда 
		ВывестиСообщение(НСтр("ru='Продаж требуемой алкогольной продукции в документе-основании не найдено.'"));
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаСоответствий = Результат[3].Выгрузить();
	ТаблицаСоответствий.Индексы.Добавить("Номенклатура");
	
	ТаблицаОстаткиАП    = Результат[4].Выгрузить();
	ТаблицаОстаткиАП.Индексы.Добавить("АлкогольнаяПродукция");
	
	// Первый обход с поиском по производителю
	Для Каждого ТекущаяСтрока Из ТаблицаУчетАлкоголя Цикл
		// Количество по товарному учету
		КоличествоПоДокументу = ТекущаяСтрока.Количество;
		СуммаПоДокументу      = ТекущаяСтрока.СуммаВсего;
		КоличествоПоНакладной = ТекущаяСтрока.КоличествоПоНакладной;
		
		Если КоличествоПоДокументу = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОтбора = Новый Структура("Номенклатура", ТекущаяСтрока.Номенклатура);
		// перебор различных вариантов сопоставления учетной номенклатуры и учета ЕГАИС
		СоответствиеАП = ТаблицаСоответствий.НайтиСтроки(СтруктураОтбора);
		Для Каждого СтрокаСоответствия Из СоответствиеАП Цикл
			
			ОтборЗапасов = Новый Структура("АлкогольнаяПродукция", СтрокаСоответствия.АлкогольнаяПродукция);
			НайденныеЗапасы = ТаблицаОстаткиАП.НайтиСтроки(ОтборЗапасов);
			
			Для Каждого СтрокаЗапасов Из НайденныеЗапасы Цикл
				
				Если КоличествоПоДокументу = 0 Тогда
					Прервать;
				КонецЕсли;
				
				// количество запаса ЕГАИС в строке документа в штуках или литрах
				ТекущееКоличество = Мин(КоличествоПоДокументу, СтрокаЗапасов.Количество);
				Если ТекущееКоличество = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = Объект.Товары.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				ТоварыНоменклатураПриИзменении(Объект,НоваяСтрока);
				
				КоличествоПоНакладнойВСтроке = ТекущееКоличество/ТекущаяСтрока.КоличествоВМультипаке;
				
				НоваяСтрока.Количество            = ТекущееКоличество;
				//НоваяСтрока.КоличествоПоНакладной = ?(НоваяСтрока.Коэффициент=0, КоличествоПоНакладнойВСтроке, Окр(КоличествоПоНакладнойВСтроке/НоваяСтрока.Коэффициент, 3));
				НоваяСтрока.КоличествоПоНакладной = КоличествоПоНакладнойВСтроке;
				НоваяСтрока.СуммаРозничная        = ?(КоличествоПоНакладной = КоличествоПоНакладнойВСтроке, СуммаПоДокументу, Окр((СуммаПоДокументу/КоличествоПоНакладной)*КоличествоПоНакладнойВСтроке, 2));
				ТоварыСуммаРозничнаяПриИзменении(Объект, НоваяСтрока);
				
				НоваяСтрока.АлкогольнаяПродукция = СтрокаЗапасов.АлкогольнаяПродукция;
				ТоварыАлкогольнаяПродукцияПриИзменении(Объект,НоваяСтрока);
				
				КоличествоПоДокументу = КоличествоПоДокументу - ТекущееКоличество;
				КоличествоПоНакладной = КоличествоПоНакладной - КоличествоПоНакладнойВСтроке;
				
				ТекущаяСтрока.Количество            = ТекущаяСтрока.Количество - ТекущееКоличество;
				СтрокаЗапасов.Количество            = СтрокаЗапасов.Количество - ТекущееКоличество;
				ТекущаяСтрока.КоличествоПоНакладной = ТекущаяСтрока.КоличествоПоНакладной - КоличествоПоНакладнойВСтроке;
				
				СуммаПоДокументу = СуммаПоДокументу - НоваяСтрока.СуммаРозничная;
				
				Если СтрокаЗапасов.Количество = 0 Тогда
					ТаблицаОстаткиАП.Удалить(СтрокаЗапасов);
				КонецЕсли;
				
			КонецЦикла;
			
			Если КоличествоПоДокументу = 0 Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если КоличествоПоДокументу>0 Тогда
			
			Если НЕ ЕстьНаОстатках Тогда
				НоваяСтрока = Объект.Товары.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				ТоварыНоменклатураПриИзменении(Объект,НоваяСтрока);
				
				//СоответствиеАП = ТаблицаСоответствий.НайтиСтроки(СтруктураОтбора);
				//Если СоответствиеАП.Количество() Тогда
				//	СтрокаЗапасов = СоответствиеАП[0];
				//	НоваяСтрока.АлкогольнаяПродукция = СтрокаЗапасов.АлкогольнаяПродукция;
				//	ТоварыАлкогольнаяПродукцияПриИзменении(Объект,НоваяСтрока);
				//КонецЕсли;	
				
				НоваяСтрока.Количество = КоличествоПоДокументу;
				//НоваяСтрока.КоличествоПоНакладной = ?(НоваяСтрока.Коэффициент=0, КоличествоПоНакладной, Окр(КоличествоПоНакладной/НоваяСтрока.Коэффициент, 3));
				НоваяСтрока.КоличествоПоНакладной = КоличествоПоНакладной;
				НоваяСтрока.СуммаРозничная = СуммаПоДокументу;
				ТоварыСуммаРозничнаяПриИзменении(Объект, НоваяСтрока);
			КонецЕсли;
			
			ВывестиСообщение(НСтр("ru='Для номенклатуры: %1 не найден запас в торговом зале в размере: %2'"),,,,, СокрЛП(ТекущаяСтрока.Номенклатура),Строка(КоличествоПоДокументу));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Объект.Комментарий = СокрЛП(Объект.Комментарий + " Заполнен по документам продаж: ");
	Сч = 0;
	Для Каждого ДокЗакрытиеСмены Из МассивЗакрытийСмен Цикл
		Объект.Комментарий = Объект.Комментарий + ?(Сч = 0, "", ", ") + Строка(МассивЗакрытийСмен[Сч]);
		Сч = Сч + 1;
	КонецЦикла;
	
КонецФункции // ТоварыЗаполнитьАлкогольнойПродукциейПоРезультатамПродаж()

#КонецЕсли
