// Модуль набора записей регистра "Скидки строки"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОписаниеПеременных

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем ДокументСсылка			Экспорт;	// Документ объект
Перем РезультатЗапросаПоСкидкам Экспорт;	// РезультатЗапроса или ТаблицаЗначений.
Перем ПодразделениеКомпании		Экспорт;	// Подразделение компании
Перем СрокДействияВСтроке       Экспорт;	// СрокДействия
Перем НаборДвиженийПередЗаписью Экспорт;

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Функция устанавливает скидки
Функция УстановитьСкидки() Экспорт
	Отказ = (НЕ (ЗначениеЗаполнено(ДокументСсылка) И ЗначениеЗаполнено(ПодразделениеКомпании)));
	
	// получаем таблицу товаров
	Если (РезультатЗапросаПоСкидкам = Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоСкидкам)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоСкидкам)<>Тип("ТаблицаЗначений")) Тогда
		Отказ = Истина;
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоСкидкам) = Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоСкидкам = РезультатЗапросаПоСкидкам.Выгрузить();
	КонецЕсли;
	
	// если были обнаружены ошибки, то движения делать не будем
	Если НЕ Отказ Тогда
		// Осуществляем запись данных в регистр
		ТабЗаписей = ПолучитьДанныеПоСкидкам(ДокументСсылка.Ссылка);
		НужнаПроверка = ТабЗаписей.Количество() > 0;
		стрОшибок = "";
		
		Для Каждого ТекСтрока Из РезультатЗапросаПоСкидкам Цикл
			// регистр СкидкиСтроки 
			НоваяЗапись = Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока);
			Если СрокДействияВСтроке Тогда
				НоваяЗапись.Период				= ТекСтрока.ДатаНачалаДействия;
				НоваяЗапись.СрокДействия		= ТекСтрока.ДатаОконачанияДействия;
			Иначе
				НоваяЗапись.Период				= ДокументСсылка.ДатаНачалаДействия;
				НоваяЗапись.СрокДействия		= ДокументСсылка.ДатаОконачанияДействия;
			КонецЕсли;
			НоваяЗапись.ПодразделениеКомпании		= ПодразделениеКомпании;
			НоваяЗапись.Действует			= Истина;
			НоваяЗапись.Регистратор         = ДокументСсылка;
			НоваяЗапись.Свойство			= ?(ЗначениеЗаполнено(НоваяЗапись.Свойство), НоваяЗапись.Свойство, Неопределено);
			НоваяЗапись.МоментИзменения		= ТекущаяДатаСеанса();
			
			Если ТекСтрока.Скидка = Справочники.ТипыСкидок.СкидкаНаНабор Тогда
				НоваяЗапись.СоставНабора = ПолучитьСоставНабора(ТекСтрока.ИдентификаторСтроки, ДокументСсылка);
				НоваяЗапись.КонтрольнаяСуммаНабора = КонтрольнаяСумма(НоваяЗапись.СоставНабора);
			КонецЕсли;
			
			Если НужнаПроверка Тогда
				стрПоиск = Новый Структура;
				стрПоиск.Вставить("ПодразделениеКомпании");
				стрПоиск.Вставить("РучнаяСкидка");
				стрПоиск.Вставить("Объект");
				стрПоиск.Вставить("НачВремя");
				стрПоиск.Вставить("КонВремя");
				стрПоиск.Вставить("ДниНедели");
				стрПоиск.Вставить("ЭтоПодарок");
				стрПоиск.Вставить("ДисконтнаяКарта");
				стрПоиск.Вставить("ОтСуммыНакопленияНаКарте");
				стрПоиск.Вставить("ЗалОбслуживания");
				стрПоиск.Вставить("Свойство");
				стрПоиск.Вставить("ОтСуммыСтроки");
				стрПоиск.Вставить("ОтКоличества");
				стрПоиск.Вставить("Правило");
				стрПоиск.Вставить("Скидка");
				стрПоиск.Вставить("СрокДействия");
				стрПоиск.Вставить("ИдентификаторСкидкиВОборудовании");
				
				ЗаполнитьЗначенияСвойств(стрПоиск,НоваяЗапись);
				
				РезПоиска = ТабЗаписей.НайтиСтроки(стрПоиск);
				Если РезПоиска.Количество() > 0 Тогда
					ТекстСообщения = НСтр("ru = 'Для скидки <%1> уже есть запись на дату ""%2"".'");
					ВывестиСообщение(ТекстСообщения,ДокументСсылка,,,Отказ,ТекСтрока.Скидка,Формат(ДокументСсылка.ДатаНачалаДействия,"ДЛФ=DDT"));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Произведем запись набора (т.к. автоматической записи по окончанию транзакции не будет).
		Если НЕ Отказ Тогда
			Записать(ЛОЖЬ);
		КонецЕсли;
	КонецЕсли;
	
	// Очистим основные переменные
	ДокументСсылка				= Неопределено;
	РезультатЗапросаПоСкидкам	= Неопределено;
	ПодразделениеКомпании		= Неопределено;
	
	Возврат Отказ;
КонецФункции

// Контрольная сумма по алгоритму MD5.
Функция КонтрольнаяСумма(Данные) Экспорт
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеДанных.Добавить(СериализоватьОбъект(Данные));
	Возврат СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "");
КонецФункции

// Возвращает сериализованный объект в виде двоичных данных.
//
// Параметры:
//  Объект - Любой - сериализуемый объект.
//
// Возвращаемое значение:
//  ДвоичныеДанные - сериализованный объект.
Функция СериализоватьОбъект(Объект) Экспорт
	
	ЗаписьXML = Новый ЗаписьFastInfoset;
	ЗаписьXML.УстановитьДвоичныеДанные();
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписатьXML(ЗаписьXML, Объект, НазначениеТипаXML.Явное);
	
	Возврат ЗаписьXML.Закрыть();

КонецФункции

Функция ПолучитьСоставНабора(ИдентификаторСтроки, ДокументСсылка)
	
	Параметры = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НазначениеСкидокСтрокиСоставНабора.Номенклатура1 КАК Номенклатура1,
	|	НазначениеСкидокСтрокиСоставНабора.Номенклатура2 КАК Номенклатура2,
	|	НазначениеСкидокСтрокиСоставНабора.Количество1 КАК Количество1,
	|	НазначениеСкидокСтрокиСоставНабора.Количество2 КАК Количество2,
	|	НазначениеСкидокСтрокиСоставНабора.Скидка1 КАК Скидка1,
	|	НазначениеСкидокСтрокиСоставНабора.Скидка2 КАК Скидка2
	|ИЗ
	|	Документ.НазначениеСкидокСтроки.СоставНабора КАК НазначениеСкидокСтрокиСоставНабора
	|ГДЕ
	|	НазначениеСкидокСтрокиСоставНабора.Ссылка = &Ссылка
	|	И НазначениеСкидокСтрокиСоставНабора.ИдентификаторСтроки = &ИдентификаторСтроки";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ИдентификаторСтроки", ИдентификаторСтроки);
	
	ТаблицаСоставов = Запрос.Выполнить().Выгрузить();

	Параметры.Вставить("СоставНабора", ТаблицаСоставов);
	
	Возврат Новый ХранилищеЗначения(Параметры);
	
КонецФункции

// Отменить скидки
Функция ОтменитьСкидки() Экспорт
	Отказ = Ложь;
	
	Отказ = (НЕ (ЗначениеЗаполнено(ДокументСсылка) И ЗначениеЗаполнено(ПодразделениеКомпании)));
	
	// получаем таблицу товаров
	Если (РезультатЗапросаПоСкидкам = Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоСкидкам)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоСкидкам)<>Тип("ТаблицаЗначений")) Тогда
		Отказ = Истина;
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоСкидкам) = Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоСкидкам = РезультатЗапросаПоСкидкам.Выгрузить();
	КонецЕсли;
	
	// Осуществляем запись данных в регистр
	Для Каждого ТекСтрока Из РезультатЗапросаПоСкидкам Цикл
		Если НЕ ТекСтрока.СкидкаУстановлена Тогда
			ТекстСообщения = НСтр("ru = 'Скидка <%1> ранее не была установлена. Отмена скидки не возможно.'");
			ВывестиСообщение(ТекстСообщения,ДокументСсылка,,,Отказ,СокрЛП(ТекСтрока.Скидка));
			Продолжить;
		КонецЕсли;
		
		// регистр СкидкиШапки 
		НоваяЗапись = Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока);
		Если СрокДействияВСтроке Тогда
			НоваяЗапись.Период				= ТекСтрока.ДатаНачалаДействия;
			НоваяЗапись.СрокДействия		= ТекСтрока.ДатаОконачанияДействия;
		Иначе
			НоваяЗапись.Период				= ДокументСсылка.ДатаНачалаДействия;
			НоваяЗапись.СрокДействия		= ДокументСсылка.ДатаОконачанияДействия;
		КонецЕсли;

		НоваяЗапись.Период              = ДокументСсылка.ДатаНачалаДействия;
		НоваяЗапись.ПодразделениеКомпании       = ПодразделениеКомпании;
		НоваяЗапись.Действует           = ЛОЖЬ;
		НоваяЗапись.Регистратор         = ДокументСсылка;
		НоваяЗапись.МоментИзменения     = ТекущаяДатаСеанса(); //TruA
	КонецЦикла;
	
	// если были обнаружены ошибки, то движения записывать не будем
	Если НЕ Отказ Тогда
		Записать(ЛОЖЬ);
	КонецЕсли;
	
	// Очистим основные переменные
	ДокументСсылка				= Неопределено;
	РезультатЗапросаПоСкидкам	= Неопределено;
	ПодразделениеКомпании		= Неопределено;
	
	Возврат Отказ;
	
КонецФункции

// получение скидок на дату
Функция ПолучитьДанныеПоСкидкам(ДокСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НазначениеСкидокСтроки.Ссылка.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	НазначениеСкидокСтроки.Скидка,
	|	НазначениеСкидокСтроки.Ссылка.ДатаНачалаДействия КАК Период,
	|	НазначениеСкидокСтроки.Ссылка.ДатаОконачанияДействия КАК СрокДействия
	|ПОМЕСТИТЬ
	|	ТаблицаСкидок
	|ИЗ
	|	Документ.НазначениеСкидокСтроки.Скидки КАК НазначениеСкидокСтроки
	|ГДЕ
	|	НазначениеСкидокСтроки.Ссылка = &ДокСсылка
	|;
	|
	|ВЫБРАТЬ
	|	СкидкиСтроки.ПодразделениеКомпании,
	|	СкидкиСтроки.РучнаяСкидка,
	|	СкидкиСтроки.Объект,
	|	СкидкиСтроки.НачВремя,
	|	СкидкиСтроки.КонВремя,
	|	СкидкиСтроки.ДниНедели,
	|	СкидкиСтроки.ЭтоПодарок,
	|	СкидкиСтроки.ДисконтнаяКарта,
	|	СкидкиСтроки.ОтСуммыНакопленияНаКарте,
	|	СкидкиСтроки.ЗалОбслуживания,
	|	СкидкиСтроки.Свойство,
	|	СкидкиСтроки.ОтСуммыСтроки,
	|	СкидкиСтроки.ОтКоличества,
	|	СкидкиСтроки.Правило,
	|	СкидкиСтроки.Скидка,
	|	СкидкиСтроки.СрокДействия,
	|	СкидкиСтроки.ИдентификаторСкидкиВОборудовании
	|ИЗ
	|	РегистрСведений.СкидкиСтроки КАК СкидкиСтроки
	|ГДЕ
	|	(СкидкиСтроки.ПодразделениеКомпании,
	|	СкидкиСтроки.Скидка,
	|	СкидкиСтроки.Период,
	|	СкидкиСтроки.СрокДействия) В 
	|			(ВЫБРАТЬ
	|				ПодразделениеКомпании,
	|				Скидка,
	|				Период,
	|				СрокДействия
	|			ИЗ
	|				ТаблицаСкидок)
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для формирования наименования/кода нового элемента.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи объекта.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередЗаписью(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ПередЗаписью(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		НаборДвиженийПередЗаписью = Неопределено;
		Возврат;
	КонецЕсли;
	
	Если НаборДвиженийПередЗаписью=Неопределено Тогда
		НаборЗаписей = РегистрыСведений.СкидкиСтроки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Отбор.Регистратор.Значение);
		НаборЗаписей.Прочитать();
		
		НаборДвиженийПередЗаписью = НаборЗаписей.Выгрузить();
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПодразделениеКомпании = Неопределено Тогда
		ОбновитьСкидкиВОбборудовании();
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Модуль менеджера обработки "Автоматическое снятие резервов"

Функция ПолучитьСоставНабораСкидки(Регистратор, КонтрольнаяСуммаНабора)
	
	Результат = Неопределено;
	
	Если (НЕ ЗначениеЗаполнено(КонтрольнаяСуммаНабора)) ИЛИ (НЕ ЗначениеЗаполнено(Регистратор)) Тогда
		Возврат Результат;
	КонецЕсли;
		
	ЗапросНаборов = Новый Запрос;
	ЗапросНаборов.УстановитьПараметр("КонтрольнаяСуммаНабора", КонтрольнаяСуммаНабора);
	ЗапросНаборов.УстановитьПараметр("Регистратор",            Регистратор);
	ЗапросНаборов.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СкидкиСтроки.СоставНабора
	|ИЗ
	|	РегистрСведений.СкидкиСтроки КАК СкидкиСтроки
	|ГДЕ
	|	СкидкиСтроки.Регистратор = &Регистратор И 
	|	СкидкиСтроки.КонтрольнаяСуммаНабора = &КонтрольнаяСуммаНабора
	|";
	Выборка = ЗапросНаборов.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.СоставНабора;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//получение списка скидок для установки и отмены
Процедура ОбновитьСкидкиВОбборудовании() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ МАКСИМУМ(Идентификатор) КАК Идентификатор ИЗ РегистрСведений.СкидкиВОборудовании");
	ПоследнийИдентификатор = 0;
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПоследнийИдентификатор=?(Выборка.Идентификатор=NULL,0,Выборка.Идентификатор);
	КонецЕсли;
	
	ПоследнийИдентификатор=ПоследнийИдентификатор+1;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор",               ЭтотОбъект.Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("НаборДвиженийПередЗаписью", НаборДвиженийПередЗаписью);
	Запрос.УстановитьПараметр("Дата",                      ТекущаяДатаСеанса());
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НаборДвиженийПередЗаписью.ПодразделениеКомпании,
	|	НаборДвиженийПередЗаписью.РучнаяСкидка,
	|	НаборДвиженийПередЗаписью.Объект,
	|	НаборДвиженийПередЗаписью.НачВремя,
	|	НаборДвиженийПередЗаписью.КонВремя,
	|	НаборДвиженийПередЗаписью.ДниНедели,
	|	НаборДвиженийПередЗаписью.ДисконтнаяКарта,
	|	НаборДвиженийПередЗаписью.ОтСуммыНакопленияНаКарте,
	|	НаборДвиженийПередЗаписью.Свойство,
	|	НаборДвиженийПередЗаписью.ОтКоличества,
	|	НаборДвиженийПередЗаписью.Правило,
	|	НаборДвиженийПередЗаписью.Скидка,
	|	НаборДвиженийПередЗаписью.Период,
	|	НаборДвиженийПередЗаписью.СрокДействия,
	|	НаборДвиженийПередЗаписью.ИдентификаторСкидкиВОборудовании,
	|	НаборДвиженийПередЗаписью.ЗначениеСкидки,
	|	НаборДвиженийПередЗаписью.Действует,
	|	НаборДвиженийПередЗаписью.СпособВычисления,
	|	НаборДвиженийПередЗаписью.ФлагВытеснения,
	|	НаборДвиженийПередЗаписью.ИдентификаторСкидки,
	|	НаборДвиженийПередЗаписью.КонтрольнаяСуммаНабора
	|ПОМЕСТИТЬ
	|	НаборДвиженийПередЗаписью
	|ИЗ
	|	&НаборДвиженийПередЗаписью КАК НаборДвиженийПередЗаписью
	|ГДЕ
	|	(НЕ НаборДвиженийПередЗаписью.ИдентификаторСкидкиВОборудовании = """")
	|;
	|
	//|ВЫБРАТЬ
	//|	СкидкиСтроки.ПодразделениеКомпании,
	//|	СкидкиСтроки.РучнаяСкидка,
	//|	СкидкиСтроки.Объект,
	//|	СкидкиСтроки.НачВремя,
	//|	СкидкиСтроки.КонВремя,
	//|	СкидкиСтроки.ДниНедели,
	//|	СкидкиСтроки.ДисконтнаяКарта,
	//|	СкидкиСтроки.ОтСуммыНакопленияНаКарте,
	//|	СкидкиСтроки.Свойство,
	//|	СкидкиСтроки.ОтКоличества,
	//|	СкидкиСтроки.Правило,
	//|	СкидкиСтроки.Скидка,
	//|	СкидкиСтроки.Период,
	//|	СкидкиСтроки.СрокДействия,
	//|	СкидкиСтроки.ИдентификаторСкидкиВОборудовании
	//|ПОМЕСТИТЬ
	//|	ТаблицаИзменений
	//|ИЗ
	//|	(
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НаборДвиженийПередЗаписью.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	НаборДвиженийПередЗаписью.РучнаяСкидка КАК РучнаяСкидка,
	|	НаборДвиженийПередЗаписью.Объект КАК Объект,
	|	НаборДвиженийПередЗаписью.НачВремя КАК НачВремя,
	|	НаборДвиженийПередЗаписью.КонВремя КАК КонВремя,
	|	НаборДвиженийПередЗаписью.ДниНедели КАК ДниНедели,
	|	НаборДвиженийПередЗаписью.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	НаборДвиженийПередЗаписью.ОтСуммыНакопленияНаКарте КАК ОтСуммыНакопленияНаКарте,
	|	НаборДвиженийПередЗаписью.Свойство КАК Свойство,
	|	НаборДвиженийПередЗаписью.ОтКоличества КАК ОтКоличества,
	|	НаборДвиженийПередЗаписью.Правило КАК Правило,
	|	НаборДвиженийПередЗаписью.Скидка КАК Скидка,
	|	НаборДвиженийПередЗаписью.Период КАК Период,
	|	НаборДвиженийПередЗаписью.СрокДействия КАК СрокДействия,
	|	НаборДвиженийПередЗаписью.ИдентификаторСкидкиВОборудовании КАК ИдентификаторСкидкиВОборудовании
	|ПОМЕСТИТЬ
	|	ТаблицаИзменений
	|ИЗ
	|	НаборДвиженийПередЗаписью КАК НаборДвиженийПередЗаписью
	|ГДЕ
	|	(НЕ НаборДвиженийПередЗаписью.ИдентификаторСкидкиВОборудовании = """")
	|	
	|ОБЪЕДИНИТЬ
	|	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкидкиСтроки.ПодразделениеКомпании,
	|	СкидкиСтроки.РучнаяСкидка,
	|	СкидкиСтроки.Объект,
	|	СкидкиСтроки.НачВремя,
	|	СкидкиСтроки.КонВремя,
	|	СкидкиСтроки.ДниНедели,
	|	СкидкиСтроки.ДисконтнаяКарта,
	|	СкидкиСтроки.ОтСуммыНакопленияНаКарте,
	|	СкидкиСтроки.Свойство,
	|	СкидкиСтроки.ОтКоличества,
	|	СкидкиСтроки.Правило,
	|	СкидкиСтроки.Скидка,
	|	СкидкиСтроки.Период,
	|	СкидкиСтроки.СрокДействия,
	|	СкидкиСтроки.ИдентификаторСкидкиВОборудовании
	|ИЗ
	|	РегистрСведений.СкидкиСтроки КАК СкидкиСтроки
	|ГДЕ
	|	СкидкиСтроки.Регистратор = &Регистратор И 
	|	(НЕ СкидкиСтроки.ИдентификаторСкидкиВОборудовании = """")
	//) КАК СкидкиСтроки
	//|СГРУППИРОВАТЬ ПО
	//|	СкидкиСтроки.ПодразделениеКомпании,
	//|	СкидкиСтроки.РучнаяСкидка,
	//|	СкидкиСтроки.Объект,
	//|	СкидкиСтроки.НачВремя,
	//|	СкидкиСтроки.КонВремя,
	//|	СкидкиСтроки.ДниНедели,
	//|	СкидкиСтроки.ДисконтнаяКарта,
	//|	СкидкиСтроки.ОтСуммыНакопленияНаКарте,
	//|	СкидкиСтроки.Свойство,
	//|	СкидкиСтроки.ОтКоличества,
	//|	СкидкиСтроки.Правило,
	//|	СкидкиСтроки.Скидка,
	//|	СкидкиСтроки.Период,
	//|	СкидкиСтроки.СрокДействия,
	//|	СкидкиСтроки.ИдентификаторСкидкиВОборудовании
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкидкиСтроки.ПодразделениеКомпании,
	|	СкидкиСтроки.Объект,
	|	СкидкиСтроки.Скидка,
	|	СкидкиСтроки.ИдентификаторСкидкиВОборудовании,
	|	СкидкиСтроки.Период КАК НачалоДействия,
	|	СкидкиСтроки.СрокДействия КАК КонецДействия
	|ПОМЕСТИТЬ
	|	ТаблицаСкидок
	|ИЗ
	|	ТаблицаИзменений КАК СкидкиСтроки
	|;
	|
	//Запрос.Текст = "
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	СкидкиСтроки.ПодразделениеКомпании,
	//|	СкидкиСтроки.Объект,
	//|	СкидкиСтроки.Скидка,
	//|	СкидкиСтроки.ИдентификаторСкидкиВОборудовании,
	//|	СкидкиСтроки.Период КАК НачалоДействия,
	//|	СкидкиСтроки.СрокДействия КАК КонецДействия
	//|ПОМЕСТИТЬ
	//|	ТаблицаСкидок
	//|ИЗ
	//|	РегистрСведений.СкидкиСтроки КАК СкидкиСтроки
	//|ГДЕ
	//|	СкидкиСтроки.Регистратор = &Регистратор И 
	//|	(НЕ СкидкиСтроки.ИдентификаторСкидкиВОборудовании = """")
	//|;
	//|
	|ВЫБРАТЬ
	|	СкидкиДляВыгрузки.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	СкидкиДляВыгрузки.Наименование КАК Наименование,
	|	СкидкиДляВыгрузки.РучнаяСкидка КАК РучнаяСкидка,
	|	СкидкиДляВыгрузки.Номенклатура КАК Номенклатура,
	|	СкидкиДляВыгрузки.НачВремя КАК НачВремя,
	|	СкидкиДляВыгрузки.КонВремя КАК КонВремя,
	|	СкидкиДляВыгрузки.НачалоДействия КАК НачалоДействия,
	|	СкидкиДляВыгрузки.КонецДействия КАК КонецДействия,
	|	СкидкиДляВыгрузки.ДниНедели КАК ДниНедели,
	|	СкидкиДляВыгрузки.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	СкидкиДляВыгрузки.СуммаНакопления КАК СуммаНакопления,
	|	СкидкиДляВыгрузки.Свойство КАК Свойство,
	|	СкидкиДляВыгрузки.СуммаЧека КАК СуммаЧека,
	|	СкидкиДляВыгрузки.ОтКоличества КАК ОтКоличества,
	|	СкидкиДляВыгрузки.Правило КАК Правило,
	|	СкидкиДляВыгрузки.Скидка КАК Скидка,
	|	МАКСИМУМ(СкидкиДляВыгрузки.ЗначениеСкидки) КАК ЗначениеСкидки,
	|	МАКСИМУМ(СкидкиДляВыгрузки.СпособВычисления) КАК СпособВычисления,
	|	МАКСИМУМ(СкидкиДляВыгрузки.ФлагВытеснения) КАК ФлагВытеснения,
	|	МАКСИМУМ(СкидкиДляВыгрузки.Действует) КАК Действует,
	|	МАКСИМУМ(СкидкиДляВыгрузки.ИдентификаторСкидкиВОборудовании) КАК ИдентификаторСкидкиВОборудовании,
	|	МАКСИМУМ(СкидкиДляВыгрузки.КонтрольнаяСуммаНабора) КАК КонтрольнаяСуммаНабора,
	|	МАКСИМУМ(ЕСТЬNULL(СкидкиДляВыгрузки.Регистратор,ЗНАЧЕНИЕ(Документ.НазначениеСкидокСтроки.ПустаяСсылка))) КАК Регистратор,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(СкидкиДляВыгрузки.Загрузка)>0 ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК Перезаполнить
	//|	СУММА(СкидкиДляВыгрузки.Загрузка) КАК Добавить,
	//|	СУММА(СкидкиДляВыгрузки.СкидкаВыгружена) КАК Удалить
	|ИЗ
	|	(ВЫБРАТЬ
	|		СкидкиСтроки.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|		СкидкиСтроки.Скидка КАК Скидка,
	|		СкидкиСтроки.Скидка.Наименование КАК Наименование,
	|		ВЫБОР
	|			КОГДА СкидкиСтроки.Объект ССЫЛКА Справочник.Номенклатура
	|				ТОГДА СкидкиСтроки.Объект
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		КОНЕЦ КАК Номенклатура,
	|		СкидкиСтроки.СпособВычисления КАК СпособВычисления,
	|		СкидкиСтроки.Свойство КАК Свойство,
	|		СкидкиСтроки.ЗначениеСкидки Как ЗначениеСкидки,
	|		0 КАК СуммаЧека,
	|		СкидкиСтроки.ОтКоличества КАК ОтКоличества,
	|		СкидкиСтроки.Правило КАК Правило,
	|		СкидкиСтроки.ФлагВытеснения КАК ФлагВытеснения,
	|		СкидкиСтроки.ОтСуммыНакопленияНаКарте КАК СуммаНакопления,
	|		СкидкиСтроки.РучнаяСкидка КАК РучнаяСкидка,
	|		СкидкиСтроки.НачВремя КАК НачВремя,
	|		СкидкиСтроки.КонВремя КАК КонВремя,
	|		СкидкиСтроки.Период КАК НачалоДействия,
	|		СкидкиСтроки.СрокДействия КАК КонецДействия,
	|		СкидкиСтроки.ДниНедели КАК  ДниНедели,
	|		СкидкиСтроки.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|		СкидкиСтроки.ИдентификаторСкидкиВОборудовании КАК ИдентификаторСкидкиВОборудовании,
	|		СкидкиСтроки.КонтрольнаяСуммаНабора КАК КонтрольнаяСуммаНабора,
	|		СкидкиСтроки.Регистратор КАК Регистратор,
	|		СкидкиСтроки.Действует КАК Действует,
	|		0 КАК СкидкаВыгружена,
	|		ВЫБОР
	|			КОГДА СкидкиСтроки.Действует ТОГДА
	|				1
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ КАК Загрузка
	|	ИЗ
	|		РегистрСведений.СкидкиСтроки.СрезПоследних(
	|					,
	|					НачалоПериода(&Дата, ДЕНЬ) <= СрокДействия И 
	|					(ПодразделениеКомпании, Объект, Скидка, ИдентификаторСкидкиВОборудовании, Период, СрокДействия) В 
	|					(ВЫБРАТЬ ПодразделениеКомпании, Объект, Скидка, ИдентификаторСкидкиВОборудовании, НачалоДействия, КонецДействия ИЗ ТаблицаСкидок)) КАК СкидкиСтроки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СкидкиВОборудовании.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|		СкидкиВОборудовании.Скидка КАК Скидка,
	|		СкидкиВОборудовании.Наименование КАК Наименование,
	|		СкидкиВОборудовании.Номенклатура КАК Номенклатура,
	|		NULL КАК СпособВычисления,
	|		СкидкиВОборудовании.Свойство КАК Свойство,
	|		NULL КАК ЗначениеСкидки,
	|		СкидкиВОборудовании.СуммаЧека КАК СуммаЧека,
	|		СкидкиВОборудовании.Количество КАК Количество,
	|		СкидкиВОборудовании.Правило КАК Правило,
	|		NULL КАК ФлагВытеснения,
	|		СкидкиВОборудовании.СуммаНакопления КАК СуммаНакопления,
	|		СкидкиВОборудовании.РучнаяСкидка КАК РучнаяСкидка,
	|		СкидкиВОборудовании.НачВремя КАК НачВремя,
	|		СкидкиВОборудовании.КонВремя КАК КонВремя,
	|		СкидкиВОборудовании.НачалоДействия КАК НачалоДействия,
	|		СкидкиВОборудовании.КонецДействия КАК КонецДействия,
	|		СкидкиВОборудовании.ДниНедели КАК ДниНедели,
	|		СкидкиВОборудовании.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|		NULL КАК ИдентификаторСкидкиВОборудовании,
	|		NULL КАК КонтрольнаяСуммаНабора,
	|		NULL,
	|		NULL,
	|		1,
	|		0
	|	ИЗ
	|		РегистрСведений.СкидкиВОборудовании КАК СкидкиВОборудовании
	|	ГДЕ
	|		(СкидкиВОборудовании.ПодразделениеКомпании, СкидкиВОборудовании.Номенклатура, СкидкиВОборудовании.Скидка, СкидкиВОборудовании.ИдентификаторСкидкиВОборудовании, СкидкиВОборудовании.НачалоДействия, СкидкиВОборудовании.КонецДействия) В 
	|		(ВЫБРАТЬ ТаблицаСкидок.ПодразделениеКомпании, ТаблицаСкидок.Объект, ТаблицаСкидок.Скидка, ТаблицаСкидок.ИдентификаторСкидкиВОборудовании, ТаблицаСкидок.НачалоДействия, ТаблицаСкидок.КонецДействия ИЗ ТаблицаСкидок КАК ТаблицаСкидок)) КАК СкидкиДляВыгрузки
	|СГРУППИРОВАТЬ ПО
	|	СкидкиДляВыгрузки.ПодразделениеКомпании,
	|	СкидкиДляВыгрузки.Наименование,
	|	СкидкиДляВыгрузки.РучнаяСкидка,
	|	СкидкиДляВыгрузки.Номенклатура,
	|	СкидкиДляВыгрузки.НачВремя,
	|	СкидкиДляВыгрузки.КонВремя,
	|	СкидкиДляВыгрузки.НачалоДействия,
	|	СкидкиДляВыгрузки.КонецДействия,
	|	СкидкиДляВыгрузки.ДниНедели,
	|	СкидкиДляВыгрузки.ДисконтнаяКарта,
	|	СкидкиДляВыгрузки.СуммаНакопления,
	|	СкидкиДляВыгрузки.Свойство,
	|	СкидкиДляВыгрузки.СуммаЧека,
	|	СкидкиДляВыгрузки.ОтКоличества,
	|	СкидкиДляВыгрузки.Правило,
	|	СкидкиДляВыгрузки.Скидка
	|";
	
	НаборЗаписей = РегистрыСведений.СкидкиВОборудовании.СоздатьНаборЗаписей();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей.Отбор.ПодразделениеКомпании.Установить(Выборка.ПодразделениеКомпании);
		НаборЗаписей.Отбор.РучнаяСкидка.Установить(Выборка.РучнаяСкидка);
		НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
		НаборЗаписей.Отбор.НачВремя.Установить(Выборка.НачВремя);
		НаборЗаписей.Отбор.КонВремя.Установить(Выборка.КонВремя);
		НаборЗаписей.Отбор.НачалоДействия.Установить(Выборка.НачалоДействия);
		НаборЗаписей.Отбор.КонецДействия.Установить(Выборка.КонецДействия);
		НаборЗаписей.Отбор.ДниНедели.Установить(Выборка.ДниНедели);
		НаборЗаписей.Отбор.ДисконтнаяКарта.Установить(Выборка.ДисконтнаяКарта);
		НаборЗаписей.Отбор.СуммаНакопления.Установить(Выборка.СуммаНакопления);
		НаборЗаписей.Отбор.Свойство.Установить(Выборка.Свойство);
		НаборЗаписей.Отбор.СуммаЧека.Установить(Выборка.СуммаЧека);
		НаборЗаписей.Отбор.Количество.Установить(Выборка.ОтКоличества);
		НаборЗаписей.Отбор.Правило.Установить(Выборка.Правило);
		НаборЗаписей.Отбор.Скидка.Установить(Выборка.Скидка);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			ТекущаяЗапись = НаборЗаписей.Добавить();
			ТекущаяЗапись.ПодразделениеКомпании = Выборка.ПодразделениеКомпании;
			ТекущаяЗапись.РучнаяСкидка = Выборка.РучнаяСкидка;
			ТекущаяЗапись.Номенклатура = Выборка.Номенклатура;
			ТекущаяЗапись.НачВремя = Выборка.НачВремя;
			ТекущаяЗапись.КонВремя = Выборка.КонВремя;
			ТекущаяЗапись.НачалоДействия = Выборка.НачалоДействия;
			ТекущаяЗапись.КонецДействия = Выборка.КонецДействия;
			ТекущаяЗапись.ДниНедели = Выборка.ДниНедели;
			ТекущаяЗапись.ДисконтнаяКарта = Выборка.ДисконтнаяКарта;
			ТекущаяЗапись.СуммаНакопления = Выборка.СуммаНакопления;
			ТекущаяЗапись.Свойство = Выборка.Свойство;
			ТекущаяЗапись.СуммаЧека = Выборка.СуммаЧека;
			ТекущаяЗапись.Количество = Выборка.ОтКоличества;
			ТекущаяЗапись.Правило = Выборка.Правило;
			ТекущаяЗапись.Скидка = Выборка.Скидка;
			
			ТекущаяЗапись.ЗначениеСкидки                   = Выборка.ЗначениеСкидки;
			ТекущаяЗапись.СпособВычисления                 = Выборка.СпособВычисления;
			ТекущаяЗапись.ФлагВытеснения                   = Выборка.ФлагВытеснения;
			ТекущаяЗапись.Действует                        = Выборка.Действует;
			ТекущаяЗапись.ИдентификаторСкидкиВОборудовании = Выборка.ИдентификаторСкидкиВОборудовании;
			ТекущаяЗапись.Наименование                     = Выборка.Наименование;
			ТекущаяЗапись.КонтрольнаяСуммаНабора           = Выборка.КонтрольнаяСуммаНабора;
			ТекущаяЗапись.МоментИзменения                  = ТекущаяДатаСеанса();
			ТекущаяЗапись.Идентификатор                    = ПоследнийИдентификатор;
			
			СоставНабора = ПолучитьСоставНабораСкидки(Выборка.Регистратор, Выборка.КонтрольнаяСуммаНабора);
			Если НЕ СоставНабора = Неопределено Тогда
				ТекущаяЗапись.СоставНабора = СоставНабора;
			КонецЕсли;
			
			ПоследнийИдентификатор=ПоследнийИдентификатор+1;
			
			НаборЗаписей.Записать(Истина);
			НаборЗаписей.Очистить();
			Продолжить;
		КонецЕсли;
		
		Для Каждого ТекущаяЗапись Из НаборЗаписей Цикл
			Если Выборка.Перезаполнить Тогда
				ТекущаяЗапись.ЗначениеСкидки                   = Выборка.ЗначениеСкидки;
				ТекущаяЗапись.СпособВычисления                 = Выборка.СпособВычисления;
				ТекущаяЗапись.ФлагВытеснения                   = Выборка.ФлагВытеснения;
				ТекущаяЗапись.Действует                        = Выборка.Действует;
				ТекущаяЗапись.ИдентификаторСкидкиВОборудовании = Выборка.ИдентификаторСкидкиВОборудовании;
				ТекущаяЗапись.Наименование                     = Выборка.Наименование;
				ТекущаяЗапись.КонтрольнаяСуммаНабора           = Выборка.КонтрольнаяСуммаНабора;
				
				СоставНабора = ПолучитьСоставНабораСкидки(Выборка.Регистратор, Выборка.КонтрольнаяСуммаНабора);
				Если НЕ СоставНабора = Неопределено Тогда
					ТекущаяЗапись.СоставНабора = СоставНабора;
				КонецЕсли;
			Иначе
				ТекущаяЗапись.Действует = Ложь;
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей.Записать(Истина);
		НаборЗаписей.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

СрокДействияВСтроке = Ложь;

#КонецЕсли




//// Модуль набора записей регистра "Скидки строки"

//#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


//#Область ОписаниеПеременных

//////////////////////////////////////////////////////////////////////////////////
//// ПЕРЕМЕННЫЕ ОБЪЕКТА
//Перем ДокументСсылка			Экспорт;	// Документ объект
//Перем РезультатЗапросаПоСкидкам Экспорт;	// РезультатЗапроса или ТаблицаЗначений.
//Перем ПодразделениеКомпании		Экспорт;	// Подразделение компании
//Перем СрокДействияВСтроке       Экспорт;	// СрокДействия

//#КонецОбласти

//////////////////////////////////////////////////////////////////////////////////
//// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

//// Функция устанавливает скидки
//Функция УстановитьСкидки() Экспорт
//	Отказ = (НЕ (ЗначениеЗаполнено(ДокументСсылка) И ЗначениеЗаполнено(ПодразделениеКомпании)));
//	
//	// получаем таблицу товаров
//	Если (РезультатЗапросаПоСкидкам = Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоСкидкам)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоСкидкам)<>Тип("ТаблицаЗначений")) Тогда
//		Отказ = Истина;
//	КонецЕсли;
//	Если ТипЗнч(РезультатЗапросаПоСкидкам) = Тип("РезультатЗапроса") Тогда
//		РезультатЗапросаПоСкидкам = РезультатЗапросаПоСкидкам.Выгрузить();
//	КонецЕсли;
//	
//	// если были обнаружены ошибки, то движения делать не будем
//	Если НЕ Отказ Тогда
//		// Осуществляем запись данных в регистр
//		ТабЗаписей = ПолучитьДанныеПоСкидкам(ДокументСсылка.Ссылка);
//		НужнаПроверка = ТабЗаписей.Количество() > 0;
//		стрОшибок = "";
//		
//		Для Каждого ТекСтрока Из РезультатЗапросаПоСкидкам Цикл
//			// регистр СкидкиСтроки 
//			НоваяЗапись = Добавить();
//			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока);
//			Если СрокДействияВСтроке Тогда
//				НоваяЗапись.Период				= ТекСтрока.ДатаНачалаДействия;
//				НоваяЗапись.СрокДействия		= ТекСтрока.ДатаОконачанияДействия;
//			Иначе
//				НоваяЗапись.Период				= ДокументСсылка.ДатаНачалаДействия;
//				НоваяЗапись.СрокДействия		= ДокументСсылка.ДатаОконачанияДействия;
//			КонецЕсли;
//			НоваяЗапись.ПодразделениеКомпании		= ПодразделениеКомпании;
//			НоваяЗапись.Действует			= Истина;
//			НоваяЗапись.Регистратор         = ДокументСсылка;
//			НоваяЗапись.Свойство			= ?(ЗначениеЗаполнено(НоваяЗапись.Свойство), НоваяЗапись.Свойство, Неопределено);
//			НоваяЗапись.МоментИзменения		= ТекущаяДатаСеанса();
//			
//			Если ТекСтрока.Скидка = Справочники.ТипыСкидок.СкидкаНаНабор Тогда
//				НоваяЗапись.СоставНабора = ПолучитьСоставНабора(ТекСтрока.ИдентификаторСтроки, ДокументСсылка);
//				НоваяЗапись.КонтрольнаяСуммаНабора = КонтрольнаяСумма(НоваяЗапись.СоставНабора);
//			КонецЕсли;
//			
//			Если НужнаПроверка Тогда
//				стрПоиск = Новый Структура;
//				стрПоиск.Вставить("ПодразделениеКомпании");
//				стрПоиск.Вставить("РучнаяСкидка");
//				стрПоиск.Вставить("Объект");
//				стрПоиск.Вставить("НачВремя");
//				стрПоиск.Вставить("КонВремя");
//				стрПоиск.Вставить("ДниНедели");
//				стрПоиск.Вставить("ЭтоПодарок");
//				стрПоиск.Вставить("ДисконтнаяКарта");
//				стрПоиск.Вставить("ОтСуммыНакопленияНаКарте");
//				стрПоиск.Вставить("ЗалОбслуживания");
//				стрПоиск.Вставить("Свойство");
//				стрПоиск.Вставить("ОтСуммыСтроки");
//				стрПоиск.Вставить("ОтКоличества");
//				стрПоиск.Вставить("Правило");
//				стрПоиск.Вставить("Скидка");
//				стрПоиск.Вставить("СрокДействия");
//				стрПоиск.Вставить("ИдентификаторСкидкиВОборудовании");
//				
//				ЗаполнитьЗначенияСвойств(стрПоиск,НоваяЗапись);
//				
//				РезПоиска = ТабЗаписей.НайтиСтроки(стрПоиск);
//				Если РезПоиска.Количество() > 0 Тогда
//					ТекстСообщения = НСтр("ru = 'Для скидки <%1> уже есть запись на дату ""%2"".'");
//					ВывестиСообщение(ТекстСообщения,ДокументСсылка,,,Отказ,ТекСтрока.Скидка,Формат(ДокументСсылка.ДатаНачалаДействия,"ДЛФ=DDT"));
//				КонецЕсли;
//			КонецЕсли;
//		КонецЦикла;
//		
//		// Произведем запись набора (т.к. автоматической записи по окончанию транзакции не будет).
//		Если НЕ Отказ Тогда
//			Записать(ЛОЖЬ);
//		КонецЕсли;
//	КонецЕсли;
//	
//	// Очистим основные переменные
//	ДокументСсылка				= Неопределено;
//	РезультатЗапросаПоСкидкам	= Неопределено;
//	ПодразделениеКомпании		= Неопределено;
//	
//	Возврат Отказ;
//КонецФункции

//// Контрольная сумма по алгоритму MD5.
//Функция КонтрольнаяСумма(Данные) Экспорт
//	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
//	ХешированиеДанных.Добавить(СериализоватьОбъект(Данные));
//	Возврат СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "");
//КонецФункции

//// Возвращает сериализованный объект в виде двоичных данных.
////
//// Параметры:
////  Объект - Любой - сериализуемый объект.
////
//// Возвращаемое значение:
////  ДвоичныеДанные - сериализованный объект.
//Функция СериализоватьОбъект(Объект) Экспорт
//	
//	ЗаписьXML = Новый ЗаписьFastInfoset;
//	ЗаписьXML.УстановитьДвоичныеДанные();
//	ЗаписьXML.ЗаписатьОбъявлениеXML();
//	
//	ЗаписатьXML(ЗаписьXML, Объект, НазначениеТипаXML.Явное);
//	
//	Возврат ЗаписьXML.Закрыть();

//КонецФункции

//Функция ПолучитьСоставНабора(ИдентификаторСтроки, ДокументСсылка)
//	
//	Параметры = Новый Структура;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	НазначениеСкидокСтрокиСоставНабора.Номенклатура1 КАК Номенклатура1,
//	|	НазначениеСкидокСтрокиСоставНабора.Номенклатура2 КАК Номенклатура2,
//	|	НазначениеСкидокСтрокиСоставНабора.Количество1 КАК Количество1,
//	|	НазначениеСкидокСтрокиСоставНабора.Количество2 КАК Количество2,
//	|	НазначениеСкидокСтрокиСоставНабора.Скидка1 КАК Скидка1,
//	|	НазначениеСкидокСтрокиСоставНабора.Скидка2 КАК Скидка2
//	|ИЗ
//	|	Документ.НазначениеСкидокСтроки.СоставНабора КАК НазначениеСкидокСтрокиСоставНабора
//	|ГДЕ
//	|	НазначениеСкидокСтрокиСоставНабора.Ссылка = &Ссылка
//	|	И НазначениеСкидокСтрокиСоставНабора.ИдентификаторСтроки = &ИдентификаторСтроки";
//	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
//	Запрос.УстановитьПараметр("ИдентификаторСтроки", ИдентификаторСтроки);
//	
//	ТаблицаСоставов = Запрос.Выполнить().Выгрузить();

//	Параметры.Вставить("СоставНабора", ТаблицаСоставов);
//	
//	Возврат Новый ХранилищеЗначения(Параметры);
//	
//КонецФункции

//// Отменить скидки
//Функция ОтменитьСкидки() Экспорт
//	Отказ = Ложь;
//	
//	Отказ = (НЕ (ЗначениеЗаполнено(ДокументСсылка) И ЗначениеЗаполнено(ПодразделениеКомпании)));
//	
//	// получаем таблицу товаров
//	Если (РезультатЗапросаПоСкидкам = Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоСкидкам)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоСкидкам)<>Тип("ТаблицаЗначений")) Тогда
//		Отказ = Истина;
//	КонецЕсли;
//	Если ТипЗнч(РезультатЗапросаПоСкидкам) = Тип("РезультатЗапроса") Тогда
//		РезультатЗапросаПоСкидкам = РезультатЗапросаПоСкидкам.Выгрузить();
//	КонецЕсли;
//	
//	// Осуществляем запись данных в регистр
//	Для Каждого ТекСтрока Из РезультатЗапросаПоСкидкам Цикл
//		Если НЕ ТекСтрока.СкидкаУстановлена Тогда
//			ТекстСообщения = НСтр("ru = 'Скидка <%1> ранее не была установлена. Отмена скидки не возможно.'");
//			ВывестиСообщение(ТекстСообщения,ДокументСсылка,,,Отказ,СокрЛП(ТекСтрока.Скидка));
//			Продолжить;
//		КонецЕсли;
//		
//		// регистр СкидкиШапки 
//		НоваяЗапись = Добавить();
//		ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока);
//		Если СрокДействияВСтроке Тогда
//			НоваяЗапись.Период				= ТекСтрока.ДатаНачалаДействия;
//			НоваяЗапись.СрокДействия		= ТекСтрока.ДатаОконачанияДействия;
//		Иначе
//			НоваяЗапись.Период				= ДокументСсылка.ДатаНачалаДействия;
//			НоваяЗапись.СрокДействия		= ДокументСсылка.ДатаОконачанияДействия;
//		КонецЕсли;

//		НоваяЗапись.Период              = ДокументСсылка.ДатаНачалаДействия;
//		НоваяЗапись.ПодразделениеКомпании       = ПодразделениеКомпании;
//		НоваяЗапись.Действует           = ЛОЖЬ;
//		НоваяЗапись.Регистратор         = ДокументСсылка;
//		НоваяЗапись.МоментИзменения     = ТекущаяДатаСеанса(); //TruA
//	КонецЦикла;
//	
//	// если были обнаружены ошибки, то движения записывать не будем
//	Если НЕ Отказ Тогда
//		Записать(ЛОЖЬ);
//	КонецЕсли;
//	
//	// Очистим основные переменные
//	ДокументСсылка				= Неопределено;
//	РезультатЗапросаПоСкидкам	= Неопределено;
//	ПодразделениеКомпании		= Неопределено;
//	
//	Возврат Отказ;
//	
//КонецФункции

//// получение скидок на дату
//Функция ПолучитьДанныеПоСкидкам(ДокСсылка)
//	Запрос = Новый Запрос;
//	Запрос.Текст = "
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	НазначениеСкидокСтроки.Ссылка.ПодразделениеКомпании КАК ПодразделениеКомпании,
//	|	НазначениеСкидокСтроки.Скидка,
//	|	НазначениеСкидокСтроки.Ссылка.ДатаНачалаДействия КАК Период,
//	|	НазначениеСкидокСтроки.Ссылка.ДатаОконачанияДействия КАК СрокДействия
//	|ПОМЕСТИТЬ
//	|	ТаблицаСкидок
//	|ИЗ
//	|	Документ.НазначениеСкидокСтроки.Скидки КАК НазначениеСкидокСтроки
//	|ГДЕ
//	|	НазначениеСкидокСтроки.Ссылка = &ДокСсылка
//	|;
//	|
//	|ВЫБРАТЬ
//	|	СкидкиСтроки.ПодразделениеКомпании,
//	|	СкидкиСтроки.РучнаяСкидка,
//	|	СкидкиСтроки.Объект,
//	|	СкидкиСтроки.НачВремя,
//	|	СкидкиСтроки.КонВремя,
//	|	СкидкиСтроки.ДниНедели,
//	|	СкидкиСтроки.ЭтоПодарок,
//	|	СкидкиСтроки.ДисконтнаяКарта,
//	|	СкидкиСтроки.ОтСуммыНакопленияНаКарте,
//	|	СкидкиСтроки.ЗалОбслуживания,
//	|	СкидкиСтроки.Свойство,
//	|	СкидкиСтроки.ОтСуммыСтроки,
//	|	СкидкиСтроки.ОтКоличества,
//	|	СкидкиСтроки.Правило,
//	|	СкидкиСтроки.Скидка,
//	|	СкидкиСтроки.СрокДействия,
//	|	СкидкиСтроки.ИдентификаторСкидкиВОборудовании
//	|ИЗ
//	|	РегистрСведений.СкидкиСтроки КАК СкидкиСтроки
//	|ГДЕ
//	|	(СкидкиСтроки.ПодразделениеКомпании,
//	|	СкидкиСтроки.Скидка,
//	|	СкидкиСтроки.Период,
//	|	СкидкиСтроки.СрокДействия) В 
//	|			(ВЫБРАТЬ
//	|				ПодразделениеКомпании,
//	|				Скидка,
//	|				Период,
//	|				СрокДействия
//	|			ИЗ
//	|				ТаблицаСкидок)
//	|";
//	
//	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
//	
//	Возврат Запрос.Выполнить().Выгрузить();
//КонецФункции


//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

//// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
////
//// Параметры:
////  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
////  ТекстЗаполнения      - Строка       - Текст, используемый для формирования наименования/кода нового элемента.
////  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
////
//Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
//	
//	// Вызываем общий обработчик события
//	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка) Тогда
//		Возврат;
//	КонецЕсли;
//	
//КонецПроцедуры // ОбработкаЗаполнения()

//// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи объекта.
////
//// Параметры:
////  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
////  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
////
//Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
//	
//	// Вызываем общий обработчик события
//	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
//		Возврат;
//	КонецЕсли;
//	
//КонецПроцедуры // ОбработкаПроверкиЗаполнения()

//// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
////
//// Параметры:
////  Отказ - Булево - Признак отказа от совершения операции.
////
//Процедура ПередЗаписью(Отказ)
//	
//	// Вызываем общий обработчик события
//	Если НЕ ОбработкаСобытийРегистраСервер.ПередЗаписью(ЭтотОбъект, Отказ) Тогда
//		Возврат;
//	КонецЕсли;
//	
//КонецПроцедуры // ПередЗаписью()

//// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
////
//// Параметры:
////  Отказ - Булево - Признак отказа от совершения операции.
////
//Процедура ПриЗаписи(Отказ)
//	
//	// Вызываем общий обработчик события
//	Если НЕ ОбработкаСобытийРегистраСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ОбновитьСкидкиВОбборудовании();
//	
//КонецПроцедуры // ПриЗаписи()

//// Модуль менеджера обработки "Автоматическое снятие резервов"


////получение списка скидок для установки и отмены
//Процедура ОбновитьСкидкиВОбборудовании()
//	
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Отбор.Регистратор.Значение);
//	Запрос.УстановитьПараметр("Дата",        ТекущаяДатаСеанса());
//	Запрос.Текст = "
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	СкидкиСтроки.ПодразделениеКомпании,
//	|	СкидкиСтроки.Объект,
//	|	СкидкиСтроки.Скидка,
//	|	СкидкиСтроки.ИдентификаторСкидкиВОборудовании,
//	|	СкидкиСтроки.Действует
//	|ПОМЕСТИТЬ
//	|	ТаблицаСкидок
//	|ИЗ
//	|	РегистрСведений.СкидкиСтроки КАК СкидкиСтроки
//	|ГДЕ
//	|	СкидкиСтроки.Регистратор = &Регистратор И 
//	|	(НЕ СкидкиСтроки.ИдентификаторСкидкиВОборудовании = """") И 
//	|	СкидкиСтроки.Действует
//	|;
//	|
//	|ВЫБРАТЬ
//	|	СкидкиДляВыгрузки.ПодразделениеКомпании КАК ПодразделениеКомпании,
//	|	СкидкиДляВыгрузки.Наименование КАК Наименование,
//	|	СкидкиДляВыгрузки.РучнаяСкидка КАК РучнаяСкидка,
//	|	СкидкиДляВыгрузки.Объект КАК Объект,
//	|	СкидкиДляВыгрузки.НачВремя КАК НачВремя,
//	|	СкидкиДляВыгрузки.КонВремя КАК КонВремя,
//	|	СкидкиДляВыгрузки.НачалоДействия КАК НачалоДействия,
//	|	СкидкиДляВыгрузки.КонецДействия КАК КонецДействия,
//	|	СкидкиДляВыгрузки.ДниНедели КАК ДниНедели,
//	|	СкидкиДляВыгрузки.ДисконтнаяКарта КАК ДисконтнаяКарта,
//	|	СкидкиДляВыгрузки.ОтСуммыНакопленияНаКарте КАК ОтСуммыНакопленияНаКарте,
//	|	СкидкиДляВыгрузки.Свойство КАК Свойство,
//	|	СкидкиДляВыгрузки.ОтСуммыЧека КАК ОтСуммыЧека,
//	|	СкидкиДляВыгрузки.ОтКоличества КАК ОтКоличества,
//	|	СкидкиДляВыгрузки.Правило КАК Правило,
//	|	СкидкиДляВыгрузки.Скидка КАК Скидка,
//	|	СкидкиДляВыгрузки.ЗначениеСкидки КАК ЗначениеСкидки,
//	|	СкидкиДляВыгрузки.СпособВычисления КАК СпособВычисления,
//	|	СкидкиДляВыгрузки.ФлагВытеснения КАК ФлагВытеснения,
//	|	СкидкиДляВыгрузки.ИдентификаторСкидкиВОборудовании КАК ИдентификаторСкидкиВОборудовании,
//	|	СкидкиДляВыгрузки.КонтрольнаяСуммаНабора КАК КонтрольнаяСуммаНабора,
//	|	МАКСИМУМ(ЕСТЬNULL(СкидкиДляВыгрузки.Регистратор,ЗНАЧЕНИЕ(Документ.НазначениеСкидокСтроки.ПустаяСсылка))) КАК Регистратор,
//	|	Истина КАК Пометка,
//	|	СУММА(СкидкиДляВыгрузки.Загрузка) КАК Действует,
//	|	СУММА(СкидкиДляВыгрузки.СкидкаВыгружена) КАК СкидкаВыгружена
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		СкидкиСтроки.ПодразделениеКомпании КАК ПодразделениеКомпании,
//	|		СкидкиСтроки.Скидка КАК Скидка,
//	|		СкидкиСтроки.Скидка.Наименование КАК Наименование,
//	|		ВЫБОР
//	|			КОГДА СкидкиСтроки.Объект ССЫЛКА Справочник.Номенклатура
//	|				ТОГДА СкидкиСтроки.Объект
//	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
//	|		КОНЕЦ КАК Объект,
//	|		СкидкиСтроки.СпособВычисления КАК СпособВычисления,
//	|		СкидкиСтроки.Скидка.ВидСвойства КАК ВидСвойства,
//	|		СкидкиСтроки.Свойство КАК Свойство,
//	|		СкидкиСтроки.ЗначениеСкидки Как ЗначениеСкидки,
//	|		0 КАК ОтСуммыЧека,
//	|		СкидкиСтроки.ОтСуммыСтроки КАК ОтСуммыСтроки,
//	|		СкидкиСтроки.ОтКоличества КАК ОтКоличества,
//	|		СкидкиСтроки.Правило КАК Правило,
//	|		СкидкиСтроки.ФлагВытеснения КАК ФлагВытеснения,
//	|		СкидкиСтроки.ОтСуммыНакопленияНаКарте КАК ОтСуммыНакопленияНаКарте,
//	|		СкидкиСтроки.РучнаяСкидка КАК РучнаяСкидка,
//	|		СкидкиСтроки.НачВремя КАК НачВремя,
//	|		СкидкиСтроки.КонВремя КАК КонВремя,
//	|		СкидкиСтроки.Период КАК НачалоДействия,
//	|		СкидкиСтроки.СрокДействия КАК КонецДействия,
//	|		СкидкиСтроки.ДниНедели КАК  ДниНедели,
//	|		СкидкиСтроки.ДисконтнаяКарта КАК ДисконтнаяКарта,
//	|		СкидкиСтроки.ИдентификаторСкидкиВОборудовании КАК ИдентификаторСкидкиВОборудовании,
//	|		СкидкиСтроки.КонтрольнаяСуммаНабора КАК КонтрольнаяСуммаНабора,
//	|		СкидкиСтроки.Регистратор КАК Регистратор,
//	|		0 КАК СкидкаВыгружена,
//	|		1 КАК Загрузка
//	|	ИЗ
//	|	
//	|		РегистрСведений.СкидкиСтроки.СрезПоследних(
//	|					,
//	|					Период <= &Дата И 
//	|					&Дата <= СрокДействия И 
//	|					(ПодразделениеКомпании, Объект, Скидка, ИдентификаторСкидкиВОборудовании, Действует) В 
//	|					(ВЫБРАТЬ ПодразделениеКомпании, Объект, Скидка, ИдентификаторСкидкиВОборудовании, Действует ИЗ ТаблицаСкидок)) КАК СкидкиСтроки
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		СкидкиВОборудовании.ПодразделениеКомпании КАК ПодразделениеКомпании,
//	|		СкидкиВОборудовании.Скидка КАК Скидка,
//	|		СкидкиВОборудовании.Наименование КАК Наименование,
//	|		СкидкиВОборудовании.Номенклатура КАК Номенклатура,
//	|		СкидкиВОборудовании.СпособВычисления КАК СпособВычисления,
//	|		СкидкиВОборудовании.Скидка.ВидСвойства КАК ВидСвойства,
//	|		СкидкиВОборудовании.Свойство КАК Свойство,
//	|		СкидкиВОборудовании.ЗначениеСкидки КАК ЗначениеСкидки,
//	|		СкидкиВОборудовании.СуммаЧека КАК СуммаЧека,
//	|		0,
//	|		СкидкиВОборудовании.Количество КАК Количество,
//	|		СкидкиВОборудовании.Правило КАК Правило,
//	|		СкидкиВОборудовании.ФлагВытеснения КАК ФлагВытеснения,
//	|		СкидкиВОборудовании.СуммаНакопления КАК СуммаНакопления,
//	|		СкидкиВОборудовании.РучнаяСкидка КАК РучнаяСкидка,
//	|		СкидкиВОборудовании.НачВремя КАК НачВремя,
//	|		СкидкиВОборудовании.КонВремя КАК КонВремя,
//	|		СкидкиВОборудовании.НачалоДействия КАК НачалоДействия,
//	|		СкидкиВОборудовании.КонецДействия КАК КонецДействия,
//	|		СкидкиВОборудовании.ДниНедели КАК ДниНедели,
//	|		СкидкиВОборудовании.ДисконтнаяКарта КАК ДисконтнаяКарта,
//	|		СкидкиВОборудовании.ИдентификаторСкидкиВОборудовании КАК ИдентификаторСкидкиВОборудовании,
//	|		СкидкиВОборудовании.КонтрольнаяСуммаНабора КАК КонтрольнаяСуммаНабора,
//	|		NULL,
//	|		1,
//	|		0
//	|	ИЗ
//	|		РегистрСведений.СкидкиВОборудовании КАК СкидкиВОборудовании
//	|	ГДЕ
//	|		(СкидкиВОборудовании.ПодразделениеКомпании, СкидкиВОборудовании.Номенклатура, СкидкиВОборудовании.Скидка, СкидкиВОборудовании.ИдентификаторСкидкиВОборудовании, СкидкиВОборудовании.Действует) В 
//	|		(ВЫБРАТЬ ТаблицаСкидок.ПодразделениеКомпании, ТаблицаСкидок.Объект, ТаблицаСкидок.Скидка, ТаблицаСкидок.ИдентификаторСкидкиВОборудовании, ТаблицаСкидок.Действует ИЗ ТаблицаСкидок КАК ТаблицаСкидок)) КАК СкидкиДляВыгрузки
//	|СГРУППИРОВАТЬ ПО
//	|	СкидкиДляВыгрузки.ПодразделениеКомпании,
//	|	СкидкиДляВыгрузки.Наименование,
//	|	СкидкиДляВыгрузки.РучнаяСкидка,
//	|	СкидкиДляВыгрузки.Объект,
//	|	СкидкиДляВыгрузки.НачВремя,
//	|	СкидкиДляВыгрузки.КонВремя,
//	|	СкидкиДляВыгрузки.НачалоДействия,
//	|	СкидкиДляВыгрузки.КонецДействия,
//	|	СкидкиДляВыгрузки.ДниНедели,
//	|	СкидкиДляВыгрузки.ДисконтнаяКарта,
//	|	СкидкиДляВыгрузки.ОтСуммыНакопленияНаКарте,
//	|	СкидкиДляВыгрузки.Свойство,
//	|	СкидкиДляВыгрузки.ОтСуммыЧека,
//	|	СкидкиДляВыгрузки.ОтКоличества,
//	|	СкидкиДляВыгрузки.Правило,
//	|	СкидкиДляВыгрузки.Скидка,
//	|	СкидкиДляВыгрузки.ЗначениеСкидки,
//	|	СкидкиДляВыгрузки.СпособВычисления,
//	|	СкидкиДляВыгрузки.ФлагВытеснения,
//	|	СкидкиДляВыгрузки.ИдентификаторСкидкиВОборудовании,
//	|	СкидкиДляВыгрузки.КонтрольнаяСуммаНабора
//	|ИМЕЮЩИЕ
//	|	СУММА(СкидкиДляВыгрузки.СкидкаВыгружена) <> СУММА(СкидкиДляВыгрузки.Загрузка)
//	|УПОРЯДОЧИТЬ ПО
//	|	СУММА(СкидкиДляВыгрузки.Загрузка)
//	|";
//	
//	ДействующиеСкидки = Запрос.Выполнить().Выгрузить();
//	Если ДействующиеСкидки.Количество()>0 Тогда
//		СкидкиВОборудовании = РегистрыСведений.СкидкиВОборудовании.СоздатьНаборЗаписей();
//		СкидкиВОборудовании.ЗаписатьСкидки(ДействующиеСкидки);
//	КонецЕсли;
//	
//КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////
//// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

//СрокДействияВСтроке = Ложь;

//#КонецЕсли