// Модуль документа "Корректировка реализации"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает выборку по шапке
// ДокументСсылка - Ссылка на документ для которого получаем шапку.
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	Запрос=Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ТипЦен КАК ТипЦен,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.Проект КАК Проект,
	|	Док.Организация КАК Организация,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	/////////// ПРИВАТ ////////////
	|	Док.Контрагент КАК Контрагент,
	|	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	Док.СкладКомпании КАК СкладКомпании,
	|	&СуммаРазногласий КАК СуммаДокумента,
	|	Док.ДокументОснование КАК ДокументОснование,
	|	Док.Сделка КАК Сделка
	|
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Запрос.УстановитьПараметр("СуммаРазногласий",Товары.Итог("СуммаВсегоРазница"));
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции

// Получаем таблицу товаров которые надо оприходовать на остатки
//
// Возвращаемое значение:
//  ТаблицаТоваров - таблица значений.
//
Функция ПолучитьТаблицуТоваровВозврат()
	// Нам фактически надо сформировать таблицу товаров которые были проданы, что бы их заново оприходовать.
	// Все из-за автоматического списания характеристик.
	ЗапросСписание=Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДокументТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка=&Ссылка
	|	И ДокументТовары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|	И ДокументТовары.КоличествоРазница < 0
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиТоваровКомпании.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ОстаткиТоваровКомпании.Регистратор КАК ДокументПродажи,
	|	ОстаткиТоваровКомпании.Количество КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
	|ГДЕ
	|	ОстаткиТоваровКомпании.Регистратор В (&ДокументПродажи)
	|	И ОстаткиТоваровКомпании.Номенклатура В (
	|		ВЫБРАТЬ Номенклатура
	|		ИЗ ТаблицаНоменклатуры
	|	)
	|	И ОстаткиТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|");
	ЗапросСписание.УстановитьПараметр("Ссылка",Ссылка);
	СписокДокументовОснований=Новый СписокЗначений;
	Основание=ДокументОснование;
	Пока ЗначениеЗаполнено(Основание) Цикл
		СписокДокументовОснований.Добавить(Основание);
		Если ЕстьРеквизит(Основание, "ДокументОснование") Тогда
			Основание=Основание.ДокументОснование;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ЗапросСписание.УстановитьПараметр("ДокументПродажи",СписокДокументовОснований);
	ТаблицаСписания=ЗапросСписание.Выполнить().Выгрузить();
	
	// Наложим блокировку на считываемые данные
	СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ОстаткиТоваровКомпании");
	ЗначенияБлокировки = Новый Соответствие;
	ЗначенияБлокировки.Вставить("Период",Новый Диапазон(,Дата)); 
	ЗначенияБлокировки.Вставить("СкладКомпании",СкладКомпании); 
	
	СтруктураПараметровБлокировки.Вставить("ИсточникДанных",Товары);
	ОписаниеИсточника = Новый Соответствие;
	ОписаниеИсточника.Вставить("Номенклатура","Номенклатура");
	ОбработкаСобытийДокументаСервер.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки, ОписаниеИсточника);
	
	ТаблицаСписания.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,ДокументПродажи","Количество");
	// Получим таблицу документа
	ЗапросТоваров=Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДокументТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	-ДокументТовары.КоличествоРазница*ДокументТовары.Коэффициент КАК Количество,
	|	ДокументТовары.Цена КАК Цена
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка=&Ссылка
	|	И ДокументТовары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|	И ДокументТовары.КоличествоРазница < 0
	|");
	ЗапросТоваров.УстановитьПараметр("Ссылка",Ссылка);
	ТаблицаДокумента=ЗапросТоваров.Выполнить().Выгрузить();
	ТаблицаДокумента.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения","Количество,Цена");
	ТаблицаДокумента.Сортировать("Номенклатура Возр,ХарактеристикаНоменклатуры Убыв");
	
	// Создадим и заполним таблицу товаров
	ТаблицаТоваров=Новый ТаблицаЗначений();
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаТоваров.Колонки.Добавить("СкладКомпании");
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("Резерв");
	ТаблицаТоваров.Колонки.Добавить("ЦенаРозничная");
	
	ТаблицаРучныхХарактеристик = ОбработкаТабличнойЧастиТовары.ПолучитьНоменклатуруСРучнымСписаниемХарактеристик(Ссылка);
	Розничный = СкладКомпании.Розничный;
	
	Для Каждого СтрокаТовар Из ТаблицаДокумента Цикл
		Если СтрокаТовар.Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли; 
		СтруктураОтбора=Новый Структура("Номенклатура",СтрокаТовар.Номенклатура);
		Если ЗначениеЗаполнено(СтрокаТовар.ХарактеристикаНоменклатуры) ИЛИ (ТаблицаРучныхХарактеристик<>Неопределено И ТаблицаРучныхХарактеристик.Найти(СтрокаТовар.Номенклатура,"Номенклатура")<>Неопределено) Тогда
			СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры",СтрокаТовар.ХарактеристикаНоменклатуры);
		КонецЕсли;
		МассивНайденныхСтрок = ТаблицаСписания.НайтиСтроки(СтруктураОтбора);
		НадоВернуть    = СтрокаТовар.Количество;
		Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
			
			ТекСтрока = МассивНайденныхСтрок[Сч];
			КоличествоКПоступлению = Мин(НадоВернуть, ТекСтрока.Количество);
			
			НоваяСтрока=ТаблицаТоваров.Добавить();
			НоваяСтрока.Номенклатура               = ТекСтрока.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
			НоваяСтрока.СкладКомпании              = СкладКомпании;
			НоваяСтрока.Количество                 = КоличествоКПоступлению;
			НоваяСтрока.Резерв                     = 0;
			НоваяСтрока.ЦенаРозничная = 0;
			
			Если ТекСтрока.Количество > НадоВернуть Тогда
				ТекСтрока.Количество = ТекСтрока.Количество - НадоВернуть;
			Иначе
				// Удалим ненужную строку
				ТаблицаСписания.Удалить(ТекСтрока);
			КонецЕсли;
			
			НадоВернуть = НадоВернуть - КоличествоКПоступлению;
			Если НадоВернуть<=0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		// Может еще что-то осталось
		Если НадоВернуть>0 Тогда
			НоваяСтрока=ТаблицаТоваров.Добавить();
			НоваяСтрока.Номенклатура               = СтрокаТовар.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаТовар.ХарактеристикаНоменклатуры;
			НоваяСтрока.СкладКомпании              = СкладКомпании;
			НоваяСтрока.Количество                 = НадоВернуть;
			НоваяСтрока.Резерв                     = 0;
			НоваяСтрока.ЦенаРозничная  = 0;
		КонецЕсли;
	КонецЦикла;
	ТаблицаТоваров.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,СкладКомпании,ЦенаРозничная","Количество, Резерв");
	
	Возврат ТаблицаТоваров;
КонецФункции // ПолучитьТаблицуТоваров()

// формирует движения по регистру партий товаров с возвратом
//
Функция ПровестиВозвратТоваров(Отказ,ШапкаДокумента,Режим)
	
	// получим значения валют
	ВалютаУпр  = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	// составим список документов движений
	ДокОснование = ДокументОснование;
	СписокОснований = Новый СписокЗначений;
	Пока Истина Цикл
		СписокОснований.Добавить(ДокОснование);
		Если ТипЗнч(ДокОснование) <> Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			Прервать;
		КонецЕсли;
		ДокОснование = ДокОснование.ДокументОснование;
	КонецЦикла;
	
	////////////////////////////////
	// ВОЗВРАТ ТОВАРОВ ПО ПАРТИЯМ //
	////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры,
	|	СУММА(-КорректировкаРеализацииТовары.КоличествоРазница * КорректировкаРеализацииТовары.Коэффициент) КАК Количество
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка = &Ссылка
	|	И КорректировкаРеализацииТовары.КоличествоРазница * КорректировкаРеализацииТовары.Коэффициент < 0
	|	И КорректировкаРеализацииТовары.Номенклатура.ВидНоменклатуры <> &Услуга
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры,
	|	КорректировкаРеализацииТовары.Номенклатура";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Услуга", Перечисления.ВидыНоменклатуры.Услуга);
	ТабДок = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.Партия,
	|	ПартииТоваровКомпании.СтатусПартии КАК СтатусПартии,
	|	СУММА(ПартииТоваровКомпании.Количество) КАК Количество,
	|	СУММА(ПартииТоваровКомпании.Сумма) КАК Сумма,
	|	СУММА(ПартииТоваровКомпании.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ПартииТоваровКомпании.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ПартииТоваровКомпании.СуммаНДСУпр) КАК СуммаНДСУпр
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.ВидДвижения = &ВидДвижения
	|	И ПартииТоваровКомпании.Номенклатура В(&Номенклатура)
	|	И ПартииТоваровКомпании.Регистратор В(&Регистратор)
	|	И ПартииТоваровКомпании.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.Партия,
	|	ПартииТоваровКомпании.СтатусПартии
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусПартии";
	Запрос.УстановитьПараметр("ВидДвижения"  , ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Номенклатура" , ТабДок.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Регистратор"  , СписокОснований);
	
	ТабДвижений = Запрос.Выполнить().Выгрузить();
	
	// получим таблицу ручных характеристик
	ТаблицаРучныхХарактеристик = ОбработкаТабличнойЧастиТовары.ПолучитьНоменклатуруСРучнымСписаниемХарактеристик(Ссылка);
	ВсеОК = Истина; ТекстСообщения = "";
	Для Каждого СтрокаТовар Из ТабДок Цикл
		Если СтрокаТовар.Количество = 0 Тогда Продолжить; КонецЕсли;
		СтруктураОтбора=Новый Структура("Номенклатура");
		СтруктураОтбора.Номенклатура=СтрокаТовар.Номенклатура; 
		Если ЗначениеЗаполнено(СтрокаТовар.ХарактеристикаНоменклатуры) ИЛИ (ТаблицаРучныхХарактеристик<>Неопределено И ТаблицаРучныхХарактеристик.Найти(СтрокаТовар.Номенклатура,"Номенклатура")<>Неопределено) Тогда 
			СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры",СтрокаТовар.ХарактеристикаНоменклатуры);
		КонецЕсли;

		МассивНайденныхСтрок=ТабДвижений.НайтиСтроки(СтруктураОтбора);
		НадоВернуть = СтрокаТовар.Количество;
		Для Сч = 0 По МассивНайденныхСтрок.ВГраница() Цикл
			Если НадоВернуть = 0 Тогда Прервать; КонецЕсли;
			ТекСтрока = МассивНайденныхСтрок[Сч];
			КоличествоВозвращаем = Мин(НадоВернуть, ТекСтрока.Количество);
			
			Если КоличествоВозвращаем =  ТекСтрока.Количество Тогда
				СуммаВозвращаем       = Окр(ТекСтрока.Сумма,2);
				СуммаВозвращаемУпр    = Окр(ТекСтрока.СуммаУпр,2);
				СуммаВозвращаемНДС    = Окр(ТекСтрока.СуммаНДС,2);
				СуммаВозвращаемНДСУпр = Окр(ТекСтрока.СуммаНДСУпр, 2);
			Иначе
				СуммаВозвращаем       = Окр(?(ТекСтрока.Количество = 0, 0,ТекСтрока.Сумма/ТекСтрока.Количество*КоличествоВозвращаем),2);
				СуммаВозвращаемУпр    = Окр(?(ТекСтрока.Количество = 0, 0,ТекСтрока.СуммаУпр/ТекСтрока.Количество*КоличествоВозвращаем),2);
				СуммаВозвращаемНДС    = Окр(?(ТекСтрока.Количество = 0, 0,ТекСтрока.СуммаНДС/ТекСтрока.Количество*КоличествоВозвращаем),2);
				СуммаВозвращаемНДСУпр = Окр(?(ТекСтрока.Количество = 0, 0,ТекСтрока.СуммаНДСУпр/ТекСтрока.Количество*КоличествоВозвращаем), 2);
			КонецЕсли;
			
			НоваяЗапись = Движения.ПартииТоваровКомпании.Добавить();
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяЗапись.Регистратор = Ссылка;
			НоваяЗапись.Период      = Дата;
			// измерения
			НоваяЗапись.СкладКомпании              = СкладКомпании;
			НоваяЗапись.Номенклатура               = СтрокаТовар.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
			НоваяЗапись.СтатусПартии               = Перечисления.СтатусыПартий.ТоварКупленный;
			НоваяЗапись.Партия                     = ТекСтрока.Партия;
			
			// ресурсы
			НоваяЗапись.Количество  = -КоличествоВозвращаем;
			НоваяЗапись.Сумма       = -СуммаВозвращаем;
			НоваяЗапись.СуммаУпр    = -СуммаВозвращаемУпр;
			НоваяЗапись.СуммаНДС    = -СуммаВозвращаемНДС;
			НоваяЗапись.СуммаНДСУпр = -СуммаВозвращаемНДСУпр;
			НоваяЗапись.СуммаБезНДС    = НоваяЗапись.Сумма - НоваяЗапись.СуммаНДС;
			НоваяЗапись.СуммаБезНДСУпр = НоваяЗапись.СуммаУпр - НоваяЗапись.СуммаНДСУпр;
			
			// ресурсы
			НоваяЗапись.ХозОперация = ХозОперация;
			НоваяЗапись.Проект      = Проект;
			
			// уменьшим остатки
			НадоВернуть = НадоВернуть - КоличествоВозвращаем;
			Если КоличествоВозвращаем >= ТекСтрока.Количество Тогда
				ТабДвижений.Удалить(ТекСтрока);
			Иначе
				ТекСтрока.Количество  = ТекСтрока.Количество - КоличествоВозвращаем;
				ТекСтрока.Сумма       = ТекСтрока.Сумма - СуммаВозвращаем;
				ТекСтрока.СуммаУпр    = ТекСтрока.СуммаУпр - СуммаВозвращаемУпр;
				ТекСтрока.СуммаНДС    = ТекСтрока.СуммаНДС - СуммаВозвращаемНДС;
				ТекСтрока.СуммаНДСУпр = ТекСтрока.СуммаНДСУпр - СуммаВозвращаемНДСУпр;
			КонецЕсли;
		КонецЦикла;
		
		// не возвращаем не проданный товар
		Если НадоВернуть > 0 Тогда
			ВсеОК = Ложь;
			ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения),"",Символы.ПС) + "Товар <" 
								+ СтрокаТовар.Номенклатура + НСтр("ru = '> не был реализован в количестве'") + Символы.НПП 
								+ СтрокаТовар.Количество;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ВсеОК Тогда
		Отказ = Истина;
		ВывестиСообщение(НСтр("ru = '%1'"), ЭтотОбъект,,,, ТекстСообщения);
		Возврат НЕ Отказ;
	КонецЕсли;
	
	Движения.ПартииТоваровКомпании.Записать();
	
	
	////////////////////////////////////////////////
	// СПИСШЕМ ГТД ПО РЕГИСТРУ ГТД ПАРТИИ ТОВАРОВ //
	////////////////////////////////////////////////
	
	// получим таблицу партий
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.Партия,
	|	-ПартииТоваровКомпании.Количество КАК Количество
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.Регистратор = &Регистратор
	|	И ПартииТоваровКомпании.ВидДвижения = &ВидДвижения
	|	И ПартииТоваровКомпании.Количество < 0";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	РезЗапроса = Запрос.Выполнить();
	
	// Получим список списанных ГТД
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГТДПартийТоваровКомпании.Номенклатура,
	|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ГТДПартийТоваровКомпании.ГТД,
	|	ГТДПартийТоваровКомпании.Партия,
	|	СУММА(ГТДПартийТоваровКомпании.Количество) КАК Количество,
	|	СУММА(ГТДПартийТоваровКомпании.Количество) КАК КоличествоОсталось
	|ИЗ
	|	РегистрНакопления.ГТДПартийТоваровКомпании КАК ГТДПартийТоваровКомпании
	|ГДЕ
	|	ГТДПартийТоваровКомпании.Регистратор В (&СписокОснований)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ГТДПартийТоваровКомпании.ГТД,
	|	ГТДПартийТоваровКомпании.Номенклатура,
	|	ГТДПартийТоваровКомпании.Партия
	|";
	Запрос.УстановитьПараметр("СписокОснований",СписокОснований);
	РезультатЗапросаПоГТД = Запрос.Выполнить().Выгрузить();

	Если НЕ РезЗапроса.Пустой() Тогда
		Выборка = РезЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НадоВернуть = Выборка.Количество;
			Если НадоВернуть = 0 Тогда Продолжить; КонецЕсли;
			
			// получим массив ГТД
			МассивГТД = РезультатЗапросаПоГТД.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,Партия",Выборка.Номенклатура,Выборка.ХарактеристикаНоменклатуры,Выборка.Партия));
			Для Каждого стрГТД Из МассивГТД Цикл
				Если стрГТД.ГТД = справочники.ГТД.ПустаяСсылка() Тогда Продолжить; КонецЕсли;
				Если  НадоВернуть = 0 ИЛИ стрГТД.Количество = 0 Тогда Продолжить; КонецЕсли;
				КолвоСписываем = Мин(НадоВернуть,стрГТД.Количество);
				
				НоваяЗапись               = Движения.ГТДПартийТоваровКомпании.Добавить();
				НоваяЗапись.Период        = Дата;
				НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Расход;
				НоваяЗапись.СкладКомпании = СкладКомпании;
				НоваяЗапись.Номенклатура  = стрГТД.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры = стрГТД.ХарактеристикаНоменклатуры;
				НоваяЗапись.Партия = стрГТД.Партия;
				НоваяЗапись.ГТД = стрГТД.ГТД;
				НоваяЗапись.Количество = -КолвоСписываем;
				
				НадоВернуть = НадоВернуть - КолвоСписываем;
				стрГТД.Количество = стрГТД.Количество - КолвоСписываем;
				
				Если НадоВернуть = 0 Тогда Прервать; КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	/////////////////////
	// РЕГИСТР ПРОДАЖИ //
	/////////////////////
	
	// получим валюты
	врТаблицаГТД = Движения.ГТДПартийТоваровКомпании.Выгрузить();
	ТаблицаГТД = врТаблицаГТД.Скопировать();
	
	// таблица партий
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.Партия,
	|	ПартииТоваровКомпании.СкладКомпании,
	|	СУММА(ПартииТоваровКомпании.Количество) КАК Количество,
	|	СУММА(ПартииТоваровКомпании.Сумма) КАК Сумма,
	|	СУММА(ПартииТоваровКомпании.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ПартииТоваровКомпании.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ПартииТоваровКомпании.СуммаНДСУпр) КАК СуммаНДСУпр,
	|	ПартииТоваровКомпании.СтавкаНДС,
	|	ПартииТоваровКомпании.СтатусПартии
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.Регистратор = &Регистратор
	|	И ПартииТоваровКомпании.ВидДвижения = &ВидДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.Партия,
	|	ПартииТоваровКомпании.СкладКомпании,
	|	ПартииТоваровКомпании.СтавкаНДС,
	|	ПартииТоваровКомпании.СтатусПартии";
	
	Запрос.УстановитьПараметр("Регистратор"  , Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения"  , ВидДвиженияНакопления.Расход);
	ТаблПартий = Запрос.Выполнить().Выгрузить();
	
	// таблица документа
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры,
	|	СУММА(КорректировкаРеализацииТовары.КоличествоРазница * КорректировкаРеализацииТовары.Коэффициент) КАК Количество,
	|	СУММА(КорректировкаРеализацииТовары.СуммаВсегоРазница) КАК СуммаВсего,
	|	СУММА(КорректировкаРеализацииТовары.СуммаВсего) КАК СуммаВсегоДляЦены,
	|	СУММА(КорректировкаРеализацииТовары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(КорректировкаРеализацииТовары.СуммаНДСРазница) КАК СуммаНДСРазница,
	|	СУММА(КорректировкаРеализацииТовары.Количество) КАК КоличествоДляЦены,
	|	КорректировкаРеализацииТовары.СтавкаНДС,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка = &Ссылка
	|	И (КорректировкаРеализацииТовары.КоличествоРазница * КорректировкаРеализацииТовары.Коэффициент <> 0
	|			ИЛИ КорректировкаРеализацииТовары.СуммаВсегоРазница <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры,
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	КорректировкаРеализацииТовары.СтавкаНДС";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ТабДок = Запрос.Выполнить().Выгрузить();
	
	
	// продажи партии
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Продажи.ПодразделениеКомпании,
	|	Продажи.Номенклатура,
	|	Продажи.Поставщик,
	|	Продажи.Покупатель,
	|	Продажи.СтатусПартии,
	|	Продажи.ДокументПродажи,
	|	Продажи.ДоговорВзаиморасчетов,
	|	Продажи.ХарактеристикаНоменклатуры,
	|	Продажи.СкладКомпании,
	|	Продажи.СтавкаНДС,
	|	Продажи.Партия,
	|	Продажи.ГТД,
	|	Продажи.Проект,
	|	СУММА(Продажи.Количество) КАК Количество,
	|	СУММА(Продажи.Сумма) КАК Сумма,
	|	СУММА(Продажи.СуммаНДС) КАК СуммаНДС,
	|	СУММА(Продажи.СуммаСкидки) КАК СуммаСкидки,
	|	СУММА(Продажи.СуммаУпр) КАК СуммаУпр,
	|	СУММА(Продажи.СуммаНДСУпр) КАК СуммаНДСУпр,
	|	СУММА(Продажи.СебестоимостьУпр) КАК СебестоимостьУпр,
	|	СУММА(Продажи.Себестоимость) КАК Себестоимость,
	|	СУММА(Продажи.СуммаНДСВходящий) КАК СуммаНДСВходящий,
	|	СУММА(Продажи.СуммаНДСВходящийУпр) КАК СуммаНДСВходящийУпр
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Регистратор В(&Регистратор)
	|	И (Продажи.Номенклатура В(&Номенклатура))
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Проект,
	|	Продажи.ПодразделениеКомпании,
	|	Продажи.Номенклатура,
	|	Продажи.Поставщик,
	|	Продажи.Покупатель,
	|	Продажи.ГТД,
	|	Продажи.СтатусПартии,
	|	Продажи.ДокументПродажи,
	|	Продажи.ДоговорВзаиморасчетов,
	|	Продажи.ХарактеристикаНоменклатуры,
	|	Продажи.СкладКомпании,
	|	Продажи.СтавкаНДС,
	|	Продажи.Партия";
	Запрос.УстановитьПараметр("Регистратор"  , СписокОснований);
	Запрос.УстановитьПараметр("Номенклатура" , ТабДок.ВыгрузитьКолонку("Номенклатура"));
	ТаблПродаж = Запрос.Выполнить().Выгрузить();
	ТекстСообщения = "";
	
	СписокСтавокНДС  = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТабДок.ВыгрузитьКолонку("СтавкаНДС"));
	СтавкиНДС        = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СписокСтавокНДС, "Ставка");
	
	Для Каждого стрДок Из ТабДок Цикл
		СуммаРазница          = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(стрДок.СуммаВсего,ВалютаДокумента,Дата,ВалютаРегл,Дата);
		СуммаРазницаНДС       = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(стрДок.СуммаНДСРазница,ВалютаДокумента,Дата,ВалютаРегл,Дата);
		НадоСписатьКоличество = стрДок.Количество;
		СуммаНаЕд             = Окр(?(стрДок.КоличествоДляЦены=0,0,РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(стрДок.СуммаВсегоДляЦены,ВалютаДокумента,Дата,ВалютаРегл,Дата)/стрДок.КоличествоДляЦены),2);
		СуммаНДСНаЕд          = Окр(?(стрДок.КоличествоДляЦены=0,0,РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(стрДок.СуммаНДС,ВалютаДокумента,Дата,ВалютаРегл,Дата)/стрДок.КоличествоДляЦены),2);
		
		СтавкаНДС = СтавкиНДС.Получить(стрДок.СтавкаНДС);
		
		Если стрДок.Количество > 0 Тогда // увеличение количества(до продажа)
			стрПоиск      = Новый Структура("Номенклатура",стрДок.Номенклатура);
			Если ЗначениеЗаполнено(стрДок.ХарактеристикаНоменклатуры) Тогда
				стрПоиск.Вставить("ХарактеристикаНоменклатуры",стрДок.ХарактеристикаНоменклатуры);
			КонецЕсли;
			
			МассивСтрокПартий = ТаблПартий.НайтиСтроки(стрПоиск);
			// если услуга
			Если МассивСтрокПартий.Количество() = 0 Тогда
				НоваяЗапись = Движения.Продажи.Добавить();
				НоваяЗапись.Период                     = Дата;
				НоваяЗапись.Регистратор                = Ссылка;
				НоваяЗапись.ХозОперация                = ХозОперация;
				НоваяЗапись.ПодразделениеКомпании      = ПодразделениеКомпании;
				НоваяЗапись.Покупатель                 = Контрагент;
				НоваяЗапись.ДокументПродажи            = Сделка;
				НоваяЗапись.ДоговорВзаиморасчетов      = ДоговорВзаиморасчетов;
				НоваяЗапись.СкладКомпании              = СкладКомпании;
				НоваяЗапись.Номенклатура               = стрДок.Номенклатура;
				НоваяЗапись.Поставщик                  = стрДок.Контрагент;
				НоваяЗапись.ХарактеристикаНоменклатуры = стрДок.ХарактеристикаНоменклатуры;
				НоваяЗапись.СтатусПартии               = Перечисления.СтатусыПартий.ТоварКупленный;
				НоваяЗапись.СтавкаНДС                  = стрДок.СтавкаНДС;
				НоваяЗапись.Количество                 = НадоСписатьКоличество;
				
				НоваяЗапись.Сумма    = НадоСписатьКоличество*СуммаНаЕд;
				НоваяЗапись.СуммаНДС = НадоСписатьКоличество*СуммаНДСНаЕд;
				НоваяЗапись.СуммаУпр = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(НадоСписатьКоличество*СуммаНаЕд,ВалютаРегл,Дата,ВалютаУпр,Дата);
				НоваяЗапись.СуммаНДСУпр = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(НадоСписатьКоличество*СуммаНДСНаЕд,ВалютаРегл,Дата,ВалютаУпр,Дата);
				
				НоваяЗапись.ВыручкаБезНДС                      = НоваяЗапись.Сумма - НоваяЗапись.СуммаНДС;
				НоваяЗапись.ВыручкаБезНДСУпр                   = НоваяЗапись.СуммаУпр - НоваяЗапись.СуммаНДСУпр;
				НоваяЗапись.ВыручкаДоПримененияСкидки          = НоваяЗапись.Сумма + НоваяЗапись.СуммаСкидки;
				НоваяЗапись.ВыручкаДоПримененияСкидкиБезНДС    = НоваяЗапись.Сумма + НоваяЗапись.СуммаСкидки - НоваяЗапись.СуммаНДС - Окр(НоваяЗапись.СуммаСкидки * СтавкаНДС / (100 + СтавкаНДС), 2);
				НоваяЗапись.ВыручкаДоПримененияСкидкиУпр       = НоваяЗапись.СуммаУпр + НоваяЗапись.СуммаСкидкиУпр;
				НоваяЗапись.ВыручкаДоПримененияСкидкиБезНДСУпр = НоваяЗапись.СуммаУпр + НоваяЗапись.СуммаСкидкиУпр - НоваяЗапись.СуммаНДСУпр - Окр(НоваяЗапись.СуммаСкидкиУпр * СтавкаНДС / (100 + СтавкаНДС), 2);
				
				СуммаРазница          = СуммаРазница - НадоСписатьКоличество*СуммаНаЕд;
				СуммаРазницаНДС       = СуммаРазницаНДС - НадоСписатьКоличество*СуммаНДСНаЕд;
			Иначе // если товар
				Для Каждого стрМассива Из МассивСтрокПартий Цикл
					// получим список ГТД для партии
					стрПоиск      = Новый Структура("Номенклатура",стрМассива.Номенклатура);
					Если ЗначениеЗаполнено(стрМассива.ХарактеристикаНоменклатуры) Тогда
						стрПоиск.Вставить("ХарактеристикаНоменклатуры",стрМассива.ХарактеристикаНоменклатуры);
					КонецЕсли;
					
					СебестоимостьРавнаПродаже = Ложь;
					Попытка
						Если стрМассива.СтатусПартии = Перечисления.СтатусыПартий.ТоварПринятыйКомиссия И (НЕ стрМассива.Партия.ДоговорВзаиморасчетов.КомиссияОтчетНаОснованииПродаж) Тогда
							СебестоимостьРавнаПродаже = Истина;
						КонецЕсли;
					Исключение
						СебестоимостьРавнаПродаже = Ложь;
					КонецПопытки;
					
					стрПоиск.Вставить("Партия",стрМассива.Партия);
					МассивГТД = ТаблицаГТД.НайтиСтроки(стрПоиск);
					Если МассивГТД.Количество() > 0 Тогда
						НадоОприходовать = стрМассива.Количество;
						Для Каждого стрГТД Из МассивГТД Цикл
							Если НадоОприходовать = 0 Тогда Прервать; КонецЕсли;
							Если стрГТД.Количество = 0 Тогда Продолжить; КонецЕсли;
							КоличествоСписываем = Мин(стрГТД.Количество,НадоОприходовать);
							
							НоваяЗапись = Движения.Продажи.Добавить();
							НоваяЗапись.Период                     = Дата;
							НоваяЗапись.Регистратор                = Ссылка;
							НоваяЗапись.ХозОперация                = ХозОперация;
							НоваяЗапись.ПодразделениеКомпании      = ПодразделениеКомпании;
							НоваяЗапись.Покупатель                 = Контрагент;
							НоваяЗапись.ДоговорВзаиморасчетов      = ДоговорВзаиморасчетов;
							НоваяЗапись.ДокументПродажи            = Сделка;
							НоваяЗапись.Номенклатура               = стрМассива.Номенклатура;
							НоваяЗапись.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
							НоваяЗапись.СтатусПартии               = стрМассива.СтатусПартии;
							НоваяЗапись.ГТД                        = стрГТД.ГТД;
							НоваяЗапись.СкладКомпании              = СкладКомпании;
							НоваяЗапись.Партия                     = стрМассива.Партия;
							НоваяЗапись.СтавкаНДС                  = стрДок.СтавкаНДС;
							Если ЗначениеЗаполнено(стрМассива.Партия) И ЕстьРеквизит(стрМассива.Партия,"Контрагент") Тогда
								НоваяЗапись.Поставщик              = стрМассива.Партия.Контрагент;
							КонецЕсли;
							НоваяЗапись.Количество                 = КоличествоСписываем;
							
							НоваяЗапись.СебестоимостьУпр = ?(стрМассива.Количество=НоваяЗапись.Количество, стрМассива.СуммаУпр, стрМассива.СуммаУпр/стрМассива.Количество*НоваяЗапись.Количество);
							НоваяЗапись.Себестоимость    = ?(стрМассива.Количество=НоваяЗапись.Количество, стрМассива.Сумма,стрМассива.Сумма/стрМассива.Количество*НоваяЗапись.Количество);
							НоваяЗапись.СуммаНДСВходящий = ?(стрМассива.Количество=НоваяЗапись.Количество, стрМассива.СуммаНДС,стрМассива.СуммаНДС/стрМассива.Количество*НоваяЗапись.Количество);
							НоваяЗапись.СуммаНДСВходящийУпр = ?(стрМассива.Количество=НоваяЗапись.Количество, стрМассива.СуммаНДСУпр,стрМассива.СуммаНДСУпр/стрМассива.Количество*НоваяЗапись.Количество);
							НоваяЗапись.СебестоимостьБезНДС = НоваяЗапись.Себестоимость - НоваяЗапись.СуммаНДСВходящий;
							НоваяЗапись.СебестоимостьБезНДСУпр = НоваяЗапись.СебестоимостьУпр - НоваяЗапись.СуммаНДСВходящийУпр;
							
							НоваяЗапись.Сумма            = КоличествоСписываем*СуммаНаЕд;
							НоваяЗапись.СуммаНДС         = КоличествоСписываем*СуммаНДСНаЕд;
							НоваяЗапись.СуммаУпр         = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(КоличествоСписываем*СуммаНаЕд,ВалютаРегл,Дата,ВалютаУпр,Дата);
							НоваяЗапись.СуммаНДСУпр      = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(КоличествоСписываем*СуммаНДСНаЕд,ВалютаРегл,Дата,ВалютаУпр,Дата);
							
							НоваяЗапись.ВыручкаБезНДС                      = НоваяЗапись.Сумма - НоваяЗапись.СуммаНДС;
							НоваяЗапись.ВыручкаБезНДСУпр                   = НоваяЗапись.СуммаУпр - НоваяЗапись.СуммаНДСУпр;
							НоваяЗапись.ВыручкаДоПримененияСкидки          = НоваяЗапись.Сумма + НоваяЗапись.СуммаСкидки;
							НоваяЗапись.ВыручкаДоПримененияСкидкиБезНДС    = НоваяЗапись.Сумма + НоваяЗапись.СуммаСкидки - НоваяЗапись.СуммаНДС - Окр(НоваяЗапись.СуммаСкидки * СтавкаНДС / (100 + СтавкаНДС), 2);
							НоваяЗапись.ВыручкаДоПримененияСкидкиУпр       = НоваяЗапись.СуммаУпр + НоваяЗапись.СуммаСкидкиУпр;
							НоваяЗапись.ВыручкаДоПримененияСкидкиБезНДСУпр = НоваяЗапись.СуммаУпр + НоваяЗапись.СуммаСкидкиУпр - НоваяЗапись.СуммаНДСУпр - Окр(НоваяЗапись.СуммаСкидкиУпр * СтавкаНДС / (100 + СтавкаНДС), 2);
							
							СуммаРазница    = СуммаРазница - КоличествоСписываем*СуммаНаЕд;
							СуммаРазницаНДС = СуммаРазницаНДС - КоличествоСписываем*СуммаНДСНаЕд;
							стрМассива.СуммаУпр = стрМассива.СуммаУпр - НоваяЗапись.СебестоимостьУпр;
							стрМассива.Сумма    = стрМассива.Сумма    - НоваяЗапись.Себестоимость;
							стрМассива.СуммаНДС = стрМассива.СуммаНДС - НоваяЗапись.СуммаНДСВходящий;
							стрМассива.СуммаНДСУпр = стрМассива.СуммаНДСУпр - НоваяЗапись.СуммаНДСВходящийУпр;
							НадоОприходовать  = НадоОприходовать - КоличествоСписываем;
							стрГТД.Количество = стрГТД.Количество - КоличествоСписываем;
							
							Если СебестоимостьРавнаПродаже Тогда
								СтавкаНДСВходящее   = Окр(НоваяЗапись.СуммаНДСВходящий/(НоваяЗапись.Себестоимость-НоваяЗапись.СуммаНДСВходящий), 2);
								СебестоимостьБезНДС = (НоваяЗапись.Сумма-НоваяЗапись.СуммаНДС);
								
								НоваяЗапись.Себестоимость    = НоваяЗапись.Сумма;
								НоваяЗапись.СебестоимостьУпр = НоваяЗапись.СуммаУпр;
								НоваяЗапись.СуммаНДСВходящий = Окр(СебестоимостьБезНДС*СтавкаНДСВходящее, 2);
							КонецЕсли;
							
						КонецЦикла;
						
						Если НадоОприходовать > 0 Тогда
							КоличествоСписываем = НадоОприходовать;
							НоваяЗапись = Движения.Продажи.Добавить();
							НоваяЗапись.Период                     = Дата;
							НоваяЗапись.Регистратор                = Ссылка;
							НоваяЗапись.ХозОперация                = ХозОперация;
							НоваяЗапись.ПодразделениеКомпании      = ПодразделениеКомпании;
							НоваяЗапись.Покупатель                 = Контрагент;
							НоваяЗапись.ДоговорВзаиморасчетов      = ДоговорВзаиморасчетов;
							НоваяЗапись.ДокументПродажи            = Сделка;
							НоваяЗапись.Номенклатура               = стрМассива.Номенклатура;
							НоваяЗапись.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
							НоваяЗапись.СтатусПартии               = стрМассива.СтатусПартии;
							НоваяЗапись.СкладКомпании              = СкладКомпании;
							НоваяЗапись.Партия                     = стрМассива.Партия;
							НоваяЗапись.СтавкаНДС                  = стрДок.СтавкаНДС;
							Если ЗначениеЗаполнено(стрМассива.Партия) И ЕстьРеквизит(стрМассива.Партия,"Контрагент") Тогда
								НоваяЗапись.Поставщик              = стрМассива.Партия.Контрагент;
							КонецЕсли;
							НоваяЗапись.Количество                 = КоличествоСписываем;
							
							НоваяЗапись.СебестоимостьУпр = стрМассива.СуммаУпр;
							НоваяЗапись.Себестоимость    = стрМассива.Сумма;
							НоваяЗапись.СуммаНДСВходящий = стрМассива.СуммаНДС;
							НоваяЗапись.СуммаНДСВходящийУпр = стрМассива.СуммаНДСУпр;
							НоваяЗапись.СебестоимостьБезНДС = НоваяЗапись.Себестоимость - НоваяЗапись.СуммаНДСВходящий;
							НоваяЗапись.СебестоимостьБезНДСУпр = НоваяЗапись.СебестоимостьУпр - НоваяЗапись.СуммаНДСВходящийУпр;
							
							НоваяЗапись.Сумма            = КоличествоСписываем*СуммаНаЕд;
							НоваяЗапись.СуммаНДС         = КоличествоСписываем*СуммаНДСНаЕд;
							НоваяЗапись.СуммаУпр         = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(КоличествоСписываем*СуммаНаЕд,ВалютаРегл,Дата,ВалютаУпр,Дата);
							НоваяЗапись.СуммаНДСУпр      = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(КоличествоСписываем*СуммаНДСНаЕд,ВалютаРегл,Дата,ВалютаУпр,Дата);
							
							НоваяЗапись.ВыручкаБезНДС                      = НоваяЗапись.Сумма - НоваяЗапись.СуммаНДС;
							НоваяЗапись.ВыручкаБезНДСУпр                   = НоваяЗапись.СуммаУпр - НоваяЗапись.СуммаНДСУпр;
							НоваяЗапись.ВыручкаДоПримененияСкидки          = НоваяЗапись.Сумма + НоваяЗапись.СуммаСкидки;
							НоваяЗапись.ВыручкаДоПримененияСкидкиБезНДС    = НоваяЗапись.Сумма + НоваяЗапись.СуммаСкидки - НоваяЗапись.СуммаНДС - Окр(НоваяЗапись.СуммаСкидки * СтавкаНДС / (100 + СтавкаНДС), 2);
							НоваяЗапись.ВыручкаДоПримененияСкидкиУпр       = НоваяЗапись.СуммаУпр + НоваяЗапись.СуммаСкидкиУпр;
							НоваяЗапись.ВыручкаДоПримененияСкидкиБезНДСУпр = НоваяЗапись.СуммаУпр + НоваяЗапись.СуммаСкидкиУпр - НоваяЗапись.СуммаНДСУпр - Окр(НоваяЗапись.СуммаСкидкиУпр * СтавкаНДС / (100 + СтавкаНДС), 2);
							
							Если СебестоимостьРавнаПродаже Тогда
								СтавкаНДСВходящее   = Окр(НоваяЗапись.СуммаНДСВходящий/(НоваяЗапись.Себестоимость-НоваяЗапись.СуммаНДСВходящий), 2);
								СебестоимостьБезНДС = (НоваяЗапись.Сумма-НоваяЗапись.СуммаНДС);
								
								НоваяЗапись.Себестоимость    = НоваяЗапись.Сумма;
								НоваяЗапись.СебестоимостьУпр = НоваяЗапись.СуммаУпр;
								НоваяЗапись.СуммаНДСВходящий = Окр(СебестоимостьБезНДС*СтавкаНДСВходящее, 2);
							КонецЕсли;
							
							СуммаРазница    = СуммаРазница - КоличествоСписываем*СуммаНаЕд;
							СуммаРазницаНДС = СуммаРазницаНДС - КоличествоСписываем*СуммаНДСНаЕд;
						КонецЕсли;
					Иначе
						КоличествоСписываем = стрМассива.Количество;
						НоваяЗапись = Движения.Продажи.Добавить();
						НоваяЗапись.Период                     = Дата;
						НоваяЗапись.Регистратор                = Ссылка;
						НоваяЗапись.ХозОперация                = ХозОперация;
						НоваяЗапись.ПодразделениеКомпании      = ПодразделениеКомпании;
						НоваяЗапись.Покупатель                 = Контрагент;
						НоваяЗапись.ДоговорВзаиморасчетов      = ДоговорВзаиморасчетов;
						НоваяЗапись.ДокументПродажи            = Сделка;
						НоваяЗапись.Номенклатура               = стрМассива.Номенклатура;
						НоваяЗапись.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
						НоваяЗапись.СтатусПартии               = стрМассива.СтатусПартии;
						НоваяЗапись.СкладКомпании              = СкладКомпании;
						НоваяЗапись.Партия                     = стрМассива.Партия;
						НоваяЗапись.СтавкаНДС                  = стрДок.СтавкаНДС;
						Если ЗначениеЗаполнено(стрМассива.Партия) И ЕстьРеквизит(стрМассива.Партия,"Контрагент") Тогда
							НоваяЗапись.Поставщик              = стрМассива.Партия.Контрагент;
						КонецЕсли;
						НоваяЗапись.Количество                 = КоличествоСписываем;
						
						НоваяЗапись.СебестоимостьУпр = стрМассива.СуммаУпр;
						НоваяЗапись.Себестоимость    = стрМассива.Сумма;
						НоваяЗапись.СуммаНДСВходящий = стрМассива.СуммаНДС;
						НоваяЗапись.СуммаНДСВходящийУпр = стрМассива.СуммаНДСУпр;
						НоваяЗапись.СебестоимостьБезНДС = НоваяЗапись.Себестоимость - НоваяЗапись.СуммаНДСВходящий;
						НоваяЗапись.СебестоимостьБезНДСУпр = НоваяЗапись.СебестоимостьУпр - НоваяЗапись.СуммаНДСВходящийУпр;
						
						НоваяЗапись.Сумма            = КоличествоСписываем*СуммаНаЕд;
						НоваяЗапись.СуммаНДС         = КоличествоСписываем*СуммаНДСНаЕд;
						НоваяЗапись.СуммаУпр         = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(КоличествоСписываем*СуммаНаЕд,ВалютаРегл,Дата,ВалютаУпр,Дата);
						НоваяЗапись.СуммаНДСУпр      = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(КоличествоСписываем*СуммаНДСНаЕд,ВалютаРегл,Дата,ВалютаУпр,Дата);
						
						НоваяЗапись.ВыручкаБезНДС                      = НоваяЗапись.Сумма - НоваяЗапись.СуммаНДС;
						НоваяЗапись.ВыручкаБезНДСУпр                   = НоваяЗапись.СуммаУпр - НоваяЗапись.СуммаНДСУпр;
						НоваяЗапись.ВыручкаДоПримененияСкидки          = НоваяЗапись.Сумма + НоваяЗапись.СуммаСкидки;
						НоваяЗапись.ВыручкаДоПримененияСкидкиБезНДС    = НоваяЗапись.Сумма + НоваяЗапись.СуммаСкидки - НоваяЗапись.СуммаНДС - Окр(НоваяЗапись.СуммаСкидки * СтавкаНДС / (100 + СтавкаНДС), 2);
						НоваяЗапись.ВыручкаДоПримененияСкидкиУпр       = НоваяЗапись.СуммаУпр + НоваяЗапись.СуммаСкидкиУпр;
						НоваяЗапись.ВыручкаДоПримененияСкидкиБезНДСУпр = НоваяЗапись.СуммаУпр + НоваяЗапись.СуммаСкидкиУпр - НоваяЗапись.СуммаНДСУпр - Окр(НоваяЗапись.СуммаСкидкиУпр * СтавкаНДС / (100 + СтавкаНДС), 2);
						
						Если СебестоимостьРавнаПродаже Тогда
							СтавкаНДСВходящее   = Окр(НоваяЗапись.СуммаНДСВходящий/(НоваяЗапись.Себестоимость-НоваяЗапись.СуммаНДСВходящий), 2);
							СебестоимостьБезНДС = (НоваяЗапись.Сумма-НоваяЗапись.СуммаНДС);
							
							НоваяЗапись.Себестоимость    = НоваяЗапись.Сумма;
							НоваяЗапись.СебестоимостьУпр = НоваяЗапись.СуммаУпр;
							НоваяЗапись.СуммаНДСВходящий = Окр(СебестоимостьБезНДС*СтавкаНДСВходящее, 2);
						КонецЕсли;
						
						СуммаРазница    = СуммаРазница - КоличествоСписываем*СуммаНаЕд;
						СуммаРазницаНДС = СуммаРазницаНДС - КоличествоСписываем*СуммаНДСНаЕд;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе // возврат товаров
			стрПоиск      = Новый Структура("Номенклатура",стрДок.Номенклатура);
			Если ЗначениеЗаполнено(стрДок.ХарактеристикаНоменклатуры) Тогда
				стрПоиск.Вставить("ХарактеристикаНоменклатуры",стрДок.ХарактеристикаНоменклатуры);
			КонецЕсли;
			
			МассивСтрокПартий = ТаблПартий.НайтиСтроки(стрПоиск);
			Если МассивСтрокПартий.Количество() = 0 Тогда
				НадоСписатьКоличество = -НадоСписатьКоличество;
				стрПоиск      = Новый Структура("Номенклатура",стрДок.Номенклатура);
				Если ЗначениеЗаполнено(стрДок.ХарактеристикаНоменклатуры) Тогда
					стрПоиск.Вставить("ХарактеристикаНоменклатуры",стрДок.ХарактеристикаНоменклатуры);
				КонецЕсли;
				МассивСтрокПродаж = ТаблПродаж.НайтиСтроки(стрПоиск);
				Для Каждого стрПродаж Из МассивСтрокПродаж Цикл
					Если НадоСписатьКоличество = 0 Тогда Прервать; КонецЕсли;
					
					КоличествоСписываем = Мин(НадоСписатьКоличество,стрПродаж.Количество);
					Если КоличествоСписываем = стрПродаж.Количество Тогда
						СуммаСписываем    = -стрПродаж.Сумма;
						СуммаНДССписываем = -стрПродаж.СуммаНДС;
						СуммаУпрСписываем = -стрПродаж.СуммаУпр;
						СуммаНДСУпрСписываем = -стрПродаж.СуммаНДСУпр;
						
						СебестоимостьУпрСписываем = -стрПродаж.СебестоимостьУпр;
						СебестоимостьСписываем    = -стрПродаж.Себестоимость;
						СуммаНДСВходящийСписываем = -стрПродаж.СуммаНДСВходящий;
						СуммаНДСВходящийУпрСписываем = -стрПродаж.СуммаНДСВходящийУпр;
					Иначе
						СуммаСписываем    = -стрПродаж.Сумма/стрПродаж.Количество*КоличествоСписываем;
						СуммаНДССписываем = -стрПродаж.СуммаНДС/стрПродаж.Количество*КоличествоСписываем;
						СуммаУпрСписываем = -стрПродаж.СуммаУпр/стрПродаж.Количество*КоличествоСписываем;
						СуммаНДСУпрСписываем = -стрПродаж.СуммаНДСУпр/стрПродаж.Количество*КоличествоСписываем;
						
						СебестоимостьУпрСписываем = -стрПродаж.СебестоимостьУпр/стрПродаж.Количество*КоличествоСписываем;
						СебестоимостьСписываем    = -стрПродаж.Себестоимость/стрПродаж.Количество*КоличествоСписываем;
						СуммаНДСВходящийСписываем = -стрПродаж.СуммаНДСВходящий/стрПродаж.Количество*КоличествоСписываем;
						СуммаНДСВходящийУпрСписываем = -стрПродаж.СуммаНДСВходящийУпр/стрПродаж.Количество*КоличествоСписываем;
					КонецЕсли;
					
					
					НоваяЗапись = Движения.Продажи.Добавить();
					НоваяЗапись.Период                     = Дата;
					НоваяЗапись.Регистратор                = Ссылка;
					НоваяЗапись.ХозОперация                = ХозОперация;
					НоваяЗапись.ПодразделениеКомпании      = стрПродаж.ПодразделениеКомпании;
					НоваяЗапись.Покупатель                 = стрПродаж.Покупатель;
					НоваяЗапись.ДоговорВзаиморасчетов      = стрПродаж.ДоговорВзаиморасчетов;
					НоваяЗапись.ДокументПродажи            = стрПродаж.ДокументПродажи;
					НоваяЗапись.Номенклатура               = стрПродаж.Номенклатура;
					НоваяЗапись.ХарактеристикаНоменклатуры = стрПродаж.ХарактеристикаНоменклатуры;
					НоваяЗапись.СтатусПартии               = стрПродаж.СтатусПартии;
					НоваяЗапись.СкладКомпании              = стрПродаж.СкладКомпании;
					НоваяЗапись.Партия                     = стрПродаж.Партия;
					НоваяЗапись.ГТД                        = стрПродаж.ГТД;
					НоваяЗапись.Поставщик                  = стрПродаж.Поставщик;
					НоваяЗапись.СтавкаНДС                  = стрПродаж.СтавкаНДС;
					НоваяЗапись.Количество                 = -КоличествоСписываем;
					
					НоваяЗапись.СебестоимостьУпр = СебестоимостьУпрСписываем;
					НоваяЗапись.Себестоимость    = СебестоимостьСписываем;
					НоваяЗапись.СуммаНДСВходящий = СуммаНДСВходящийСписываем;
					НоваяЗапись.СуммаНДСВходящийУпр = СуммаНДСВходящийУпрСписываем;
					НоваяЗапись.СебестоимостьБезНДС = НоваяЗапись.Себестоимость - НоваяЗапись.СуммаНДСВходящий;
					НоваяЗапись.СебестоимостьБезНДСУпр = НоваяЗапись.СебестоимостьУпр - НоваяЗапись.СуммаНДСВходящийУпр;
					
					НоваяЗапись.Сумма            = СуммаСписываем;
					НоваяЗапись.СуммаНДС         = СуммаНДССписываем;
					НоваяЗапись.СуммаУпр         = СуммаУпрСписываем;
					НоваяЗапись.СуммаНДСУпр      = СуммаНДСУпрСписываем;
					
					НоваяЗапись.ВыручкаБезНДС                      = НоваяЗапись.Сумма - НоваяЗапись.СуммаНДС;
					НоваяЗапись.ВыручкаБезНДСУпр                   = НоваяЗапись.СуммаУпр - НоваяЗапись.СуммаНДСУпр;
					НоваяЗапись.ВыручкаДоПримененияСкидки          = НоваяЗапись.Сумма + НоваяЗапись.СуммаСкидки;
					НоваяЗапись.ВыручкаДоПримененияСкидкиБезНДС    = НоваяЗапись.Сумма + НоваяЗапись.СуммаСкидки - НоваяЗапись.СуммаНДС - Окр(НоваяЗапись.СуммаСкидки * СтавкаНДС / (100 + СтавкаНДС), 2);
					НоваяЗапись.ВыручкаДоПримененияСкидкиУпр       = НоваяЗапись.СуммаУпр + НоваяЗапись.СуммаСкидкиУпр;
					НоваяЗапись.ВыручкаДоПримененияСкидкиБезНДСУпр = НоваяЗапись.СуммаУпр + НоваяЗапись.СуммаСкидкиУпр - НоваяЗапись.СуммаНДСУпр - Окр(НоваяЗапись.СуммаСкидкиУпр * СтавкаНДС / (100 + СтавкаНДС), 2);
					
					НадоСписатьКоличество = НадоСписатьКоличество - КоличествоСписываем;
					СуммаРазница          = СуммаРазница - СуммаСписываем;
					СуммаРазницаНДС       = СуммаРазницаНДС - СуммаНДССписываем;
					
					стрПродаж.Количество = стрПродаж.Количество - КоличествоСписываем;
					Если стрПродаж.Количество = 0 Тогда
						ТаблПродаж.Удалить(стрПродаж);
					КонецЕсли;
				КонецЦикла;
			Иначе
				Для Каждого стрМассива Из МассивСтрокПартий Цикл
					НадоСписатьКоличество = -стрМассива.Количество;
					стрПоиск      = Новый Структура("Номенклатура,Партия",стрМассива.Номенклатура,стрМассива.Партия);
					Если ЗначениеЗаполнено(стрМассива.ХарактеристикаНоменклатуры) Тогда
						стрПоиск.Вставить("ХарактеристикаНоменклатуры",стрМассива.ХарактеристикаНоменклатуры);
					КонецЕсли;
					// списание с учетом ГТД
					// получим список ГТД для партии
					стрПоискГТД      = Новый Структура("Номенклатура",стрМассива.Номенклатура);
					Если ЗначениеЗаполнено(стрМассива.ХарактеристикаНоменклатуры) Тогда
						стрПоискГТД.Вставить("ХарактеристикаНоменклатуры",стрМассива.ХарактеристикаНоменклатуры);
					КонецЕсли;
					стрПоискГТД.Вставить("Партия",стрМассива.Партия);
					МассивГТД = ТаблицаГТД.НайтиСтроки(стрПоискГТД);
					
					Если МассивГТД.Количество() > 0  Тогда
						Для Каждого стрГТД Из МассивГТД Цикл
							Если НадоСписатьКоличество = 0 Тогда Прервать; КонецЕсли;
							стрПоиск.Вставить("ГТД",стрГТД.ГТД);
							МассивСтрокПродаж = ТаблПродаж.НайтиСтроки(стрПоиск);
							Для Каждого стрПродаж Из МассивСтрокПродаж Цикл
								Если НадоСписатьКоличество = 0 Тогда Прервать; КонецЕсли;
								
								КоличествоСписываем = Мин(НадоСписатьКоличество,стрПродаж.Количество);
								Если КоличествоСписываем = стрПродаж.Количество Тогда
									СуммаСписываем    = -стрПродаж.Сумма;
									СуммаНДССписываем = -стрПродаж.СуммаНДС;
									СуммаУпрСписываем = -стрПродаж.СуммаУпр;
									СуммаНДСУпрСписываем = -стрПродаж.СуммаНДСУпр;
									
									СебестоимостьУпрСписываем = -стрПродаж.СебестоимостьУпр;
									СебестоимостьСписываем    = -стрПродаж.Себестоимость;
									СуммаНДСВходящийСписываем = -стрПродаж.СуммаНДСВходящий;
									СуммаНДСУпрВходящийСписываем = -стрПродаж.СуммаНДСВходящийУпр;
								Иначе
									СуммаСписываем    = -стрПродаж.Сумма/стрПродаж.Количество*КоличествоСписываем;
									СуммаНДССписываем = -стрПродаж.СуммаНДС/стрПродаж.Количество*КоличествоСписываем;
									СуммаУпрСписываем = -стрПродаж.СуммаУпр/стрПродаж.Количество*КоличествоСписываем;
									
									СебестоимостьУпрСписываем = -стрПродаж.СебестоимостьУпр/стрПродаж.Количество*КоличествоСписываем;
									СебестоимостьСписываем    = -стрПродаж.Себестоимость/стрПродаж.Количество*КоличествоСписываем;
									СуммаНДСВходящийСписываем = -стрПродаж.СуммаНДСВходящий/стрПродаж.Количество*КоличествоСписываем;
									СуммаНДСВходящийСписываемУпр = -стрПродаж.СуммаНДСВходящийУпр/стрПродаж.Количество*КоличествоСписываем;
								КонецЕсли;
								
								
								НоваяЗапись = Движения.Продажи.Добавить();
								НоваяЗапись.Период                     = Дата;
								НоваяЗапись.Регистратор                = Ссылка;
								НоваяЗапись.ХозОперация                = ХозОперация;
								НоваяЗапись.ПодразделениеКомпании      = стрПродаж.ПодразделениеКомпании;
								НоваяЗапись.Покупатель                 = стрПродаж.Покупатель;
								НоваяЗапись.ДоговорВзаиморасчетов      = стрПродаж.ДоговорВзаиморасчетов;
								НоваяЗапись.Номенклатура               = стрПродаж.Номенклатура;
								НоваяЗапись.ХарактеристикаНоменклатуры = стрПродаж.ХарактеристикаНоменклатуры;
								НоваяЗапись.СтатусПартии               = стрПродаж.СтатусПартии;
								НоваяЗапись.ДокументПродажи            = стрПродаж.ДокументПродажи;
								НоваяЗапись.СкладКомпании              = стрПродаж.СкладКомпании;
								НоваяЗапись.Партия                     = стрПродаж.Партия;
								НоваяЗапись.ГТД                        = стрПродаж.ГТД;
								НоваяЗапись.Поставщик                  = стрПродаж.Поставщик;
								НоваяЗапись.СтавкаНДС                  = стрПродаж.СтавкаНДС;
								НоваяЗапись.Количество                 = -КоличествоСписываем;
								
								НоваяЗапись.СебестоимостьУпр = СебестоимостьУпрСписываем;
								НоваяЗапись.Себестоимость    = СебестоимостьСписываем;
								НоваяЗапись.СуммаНДСВходящий = СуммаНДСВходящийСписываем;
								НоваяЗапись.СуммаНДСВходящийУпр = СуммаНДСВходящийСписываемУпр;
								НоваяЗапись.СебестоимостьБезНДС = НоваяЗапись.Себестоимость - НоваяЗапись.СуммаНДСВходящий;
								НоваяЗапись.СебестоимостьБезНДСУпр = НоваяЗапись.СебестоимостьУпр - НоваяЗапись.СуммаНДСВходящийУпр;
								
								НоваяЗапись.Сумма            = СуммаСписываем;
								НоваяЗапись.СуммаНДС         = СуммаНДССписываем;
								НоваяЗапись.СуммаУпр         = СуммаУпрСписываем;
								НоваяЗапись.СуммаНДСУпр      = СуммаНДСУпрСписываем;
								
								НоваяЗапись.ВыручкаБезНДС                      = НоваяЗапись.Сумма - НоваяЗапись.СуммаНДС;
								НоваяЗапись.ВыручкаБезНДСУпр                   = НоваяЗапись.СуммаУпр - НоваяЗапись.СуммаНДСУпр;
								НоваяЗапись.ВыручкаДоПримененияСкидки          = НоваяЗапись.Сумма + НоваяЗапись.СуммаСкидки;
								НоваяЗапись.ВыручкаДоПримененияСкидкиБезНДС    = НоваяЗапись.Сумма + НоваяЗапись.СуммаСкидки - НоваяЗапись.СуммаНДС - Окр(НоваяЗапись.СуммаСкидки * СтавкаНДС / (100 + СтавкаНДС), 2);
								НоваяЗапись.ВыручкаДоПримененияСкидкиУпр       = НоваяЗапись.СуммаУпр + НоваяЗапись.СуммаСкидкиУпр;
								НоваяЗапись.ВыручкаДоПримененияСкидкиБезНДСУпр = НоваяЗапись.СуммаУпр + НоваяЗапись.СуммаСкидкиУпр - НоваяЗапись.СуммаНДСУпр - Окр(НоваяЗапись.СуммаСкидкиУпр * СтавкаНДС / (100 + СтавкаНДС), 2);
								
								НадоСписатьКоличество = НадоСписатьКоличество - КоличествоСписываем;
								СуммаРазница          = СуммаРазница - СуммаСписываем;
								СуммаРазницаНДС       = СуммаРазницаНДС - СуммаНДССписываем;
								
								стрПродаж.Количество = стрПродаж.Количество - КоличествоСписываем;
								Если стрПродаж.Количество = 0 Тогда
									ТаблПродаж.Удалить(стрПродаж);
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					КонецЕсли;
					
					// Списание без учета ГТД
					стрПоиск      = Новый Структура("Номенклатура,Партия",стрМассива.Номенклатура,стрМассива.Партия);
					Если ЗначениеЗаполнено(стрМассива.ХарактеристикаНоменклатуры) Тогда
						стрПоиск.Вставить("ХарактеристикаНоменклатуры",стрМассива.ХарактеристикаНоменклатуры);
					КонецЕсли;
					МассивСтрокПродаж = ТаблПродаж.НайтиСтроки(стрПоиск);
					Для Каждого стрПродаж Из МассивСтрокПродаж Цикл
						Если НадоСписатьКоличество = 0 Тогда Прервать; КонецЕсли;
						
						КоличествоСписываем = Мин(НадоСписатьКоличество,стрПродаж.Количество);
						Если КоличествоСписываем = стрПродаж.Количество Тогда
							СуммаСписываем    = -стрПродаж.Сумма;
							СуммаНДССписываем = -стрПродаж.СуммаНДС;
							СуммаУпрСписываем = -стрПродаж.СуммаУпр;
							СуммаНДСУпрСписываем = -стрПродаж.СуммаНДСУпр;
							
							СебестоимостьУпрСписываем = -стрПродаж.СебестоимостьУпр;
							СебестоимостьСписываем    = -стрПродаж.Себестоимость;
							СуммаНДСВходящийСписываем = -стрПродаж.СуммаНДСВходящий;
							СуммаНДСВходящийУпрСписываем = -стрПродаж.СуммаНДСВходящийУпр;
						Иначе
							СуммаСписываем    = -стрПродаж.Сумма/стрПродаж.Количество*КоличествоСписываем;
							СуммаНДССписываем = -стрПродаж.СуммаНДС/стрПродаж.Количество*КоличествоСписываем;
							СуммаУпрСписываем = -стрПродаж.СуммаУпр/стрПродаж.Количество*КоличествоСписываем;
							СуммаНДСУпрСписываем = -стрПродаж.СуммаНДСУпр/стрПродаж.Количество*КоличествоСписываем;
							
							СебестоимостьУпрСписываем = -стрПродаж.СебестоимостьУпр/стрПродаж.Количество*КоличествоСписываем;
							СебестоимостьСписываем    = -стрПродаж.Себестоимость/стрПродаж.Количество*КоличествоСписываем;
							СуммаНДСВходящийСписываем = -стрПродаж.СуммаНДСВходящий/стрПродаж.Количество*КоличествоСписываем;
							СуммаНДСВходящийУпрСписываем = -стрПродаж.СуммаНДСВходящийУпр/стрПродаж.Количество*КоличествоСписываем;
						КонецЕсли;
						
						
						НоваяЗапись = Движения.Продажи.Добавить();
						НоваяЗапись.Период                     = Дата;
						НоваяЗапись.Регистратор                = Ссылка;
						НоваяЗапись.ХозОперация                = ХозОперация;
						НоваяЗапись.ПодразделениеКомпании      = стрПродаж.ПодразделениеКомпании;
						НоваяЗапись.Покупатель                 = стрПродаж.Покупатель;
						НоваяЗапись.ДоговорВзаиморасчетов      = стрПродаж.ДоговорВзаиморасчетов;
						НоваяЗапись.Номенклатура               = стрПродаж.Номенклатура;
						НоваяЗапись.ХарактеристикаНоменклатуры = стрПродаж.ХарактеристикаНоменклатуры;
						НоваяЗапись.СтатусПартии               = стрПродаж.СтатусПартии;
						НоваяЗапись.ДокументПродажи            = стрПродаж.ДокументПродажи;
						НоваяЗапись.СкладКомпании              = стрПродаж.СкладКомпании;
						НоваяЗапись.Партия                     = стрПродаж.Партия;
						НоваяЗапись.ГТД                        = стрПродаж.ГТД;
						НоваяЗапись.Поставщик                  = стрПродаж.Поставщик;
						НоваяЗапись.СтавкаНДС                  = стрПродаж.СтавкаНДС;
						НоваяЗапись.Количество                 = -КоличествоСписываем;
						
						НоваяЗапись.СебестоимостьУпр = СебестоимостьУпрСписываем;
						НоваяЗапись.Себестоимость    = СебестоимостьСписываем;
						НоваяЗапись.СуммаНДСВходящий = СуммаНДСВходящийСписываем;
						НоваяЗапись.СуммаНДСВходящийУпр = СуммаНДСВходящийУпрСписываем;
						НоваяЗапись.СебестоимостьБезНДС = НоваяЗапись.Себестоимость - НоваяЗапись.СуммаНДСВходящий;
						НоваяЗапись.СебестоимостьБезНДСУпр = НоваяЗапись.СебестоимостьУпр - НоваяЗапись.СуммаНДСВходящийУпр;
						
						НоваяЗапись.Сумма            = СуммаСписываем;
						НоваяЗапись.СуммаНДС         = СуммаНДССписываем;
						НоваяЗапись.СуммаУпр         = СуммаУпрСписываем;
						НоваяЗапись.СуммаНДСУпр         = СуммаНДСУпрСписываем;
						
						НоваяЗапись.ВыручкаБезНДС                      = НоваяЗапись.Сумма - НоваяЗапись.СуммаНДС;
						НоваяЗапись.ВыручкаБезНДСУпр                   = НоваяЗапись.СуммаУпр - НоваяЗапись.СуммаНДСУпр;
						НоваяЗапись.ВыручкаДоПримененияСкидки          = НоваяЗапись.Сумма + НоваяЗапись.СуммаСкидки;
						НоваяЗапись.ВыручкаДоПримененияСкидкиБезНДС    = НоваяЗапись.Сумма + НоваяЗапись.СуммаСкидки - НоваяЗапись.СуммаНДС - Окр(НоваяЗапись.СуммаСкидки * СтавкаНДС / (100 + СтавкаНДС), 2);
						НоваяЗапись.ВыручкаДоПримененияСкидкиУпр       = НоваяЗапись.СуммаУпр + НоваяЗапись.СуммаСкидкиУпр;
						НоваяЗапись.ВыручкаДоПримененияСкидкиБезНДСУпр = НоваяЗапись.СуммаУпр + НоваяЗапись.СуммаСкидкиУпр - НоваяЗапись.СуммаНДСУпр - Окр(НоваяЗапись.СуммаСкидкиУпр * СтавкаНДС / (100 + СтавкаНДС), 2);
						
						НадоСписатьКоличество = НадоСписатьКоличество - КоличествоСписываем;
						СуммаРазница          = СуммаРазница - СуммаСписываем;
						СуммаРазницаНДС       = СуммаРазницаНДС - СуммаНДССписываем;
						
						стрПродаж.Количество = стрПродаж.Количество - КоличествоСписываем;
						Если стрПродаж.Количество = 0 Тогда
							ТаблПродаж.Удалить(стрПродаж);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
			
			Если НадоСписатьКоличество <> 0 Тогда
				ВсеОК = Ложь;
				ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения),"",Символы.ПС) + "Товар <" + стрДок.Номенклатура 
								+ НСтр("ru = '> не был реализован в количестве'") + Символы.НПП + Строка(-стрДок.Количество);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ВсеОК Тогда
			Отказ = Истина;
			ВывестиСообщение(НСтр("ru = '%1'"), ЭтотОбъект,,,, ТекстСообщения);
			Возврат НЕ Отказ;
		КонецЕсли;
		
		Если Окр(СуммаРазница,2) <> 0 ИЛИ Окр(СуммаРазницаНДС,2) <> 0 Тогда
			// Получим движения по продажам.
			
			стрПоиск      = Новый Структура("Номенклатура",стрДок.Номенклатура);
			Если ЗначениеЗаполнено(стрДок.ХарактеристикаНоменклатуры) Тогда
				стрПоиск.Вставить("ХарактеристикаНоменклатуры",стрДок.ХарактеристикаНоменклатуры);
			КонецЕсли;
			МассивСтрок = ТаблПродаж.НайтиСтроки(стрПоиск);
			
			Если МассивСтрок.Количество() > 0 Тогда
				// Получим количество всего.
				КоличествоВсего = 0;
				Для Каждого стрМассива Из МассивСтрок Цикл
					КоличествоВсего = КоличествоВсего + стрМассива.Количество;
				КонецЦикла;
				
				Для Каждого стрМассива Из МассивСтрок Цикл
					Если КоличествоВсего = 0 ИЛИ (СуммаРазница = 0 И СуммаРазницаНДС = 0) Тогда Прервать; КонецЕсли;
					
					КолСписываем = Мин(КоличествоВсего,стрМассива.Количество);
					СуммаСпис    = Окр(?(КолСписываем = КоличествоВсего, СуммаРазница, СуммаРазница/КоличествоВсего*КолСписываем),2);
					СуммаСписНДС = Окр(?(КолСписываем = КоличествоВсего, СуммаРазницаНДС, СуммаРазницаНДС/КоличествоВсего*КолСписываем),2);
					
					Если СуммаСписНДС <> 0 ИЛИ СуммаСпис <> 0 Тогда
						// Добавим запись
						НоваяЗапись = Движения.Продажи.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяЗапись, стрМассива);
						НоваяЗапись.Регистратор = Ссылка;
						НоваяЗапись.Период      = Дата;
						НоваяЗапись.ХозОперация = ХозОперация;
						НоваяЗапись.Количество  = 0;
						
						НоваяЗапись.СебестоимостьУпр = 0;
						НоваяЗапись.Себестоимость    = 0;
						НоваяЗапись.СуммаНДСВходящий = 0;
						НоваяЗапись.СуммаНДСВходящийУпр = 0;
						НоваяЗапись.СебестоимостьБезНДС = НоваяЗапись.Себестоимость - НоваяЗапись.СуммаНДСВходящий;
						НоваяЗапись.СебестоимостьБезНДСУпр = НоваяЗапись.СебестоимостьУпр - НоваяЗапись.СуммаНДСВходящийУпр;
						
						НоваяЗапись.СуммаСкидки      = 0;
						НоваяЗапись.Сумма            = СуммаСпис;
						НоваяЗапись.СуммаНДС         = СуммаСписНДС;
						НоваяЗапись.СуммаУпр         = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаСпис,ВалютаРегл,Дата,ВалютаУпр,Дата);
						НоваяЗапись.СуммаНДСУпр      = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаСписНДС,ВалютаРегл,Дата,ВалютаУпр,Дата);
						НоваяЗапись.СуммаСкидкиУпр   = 0;
						
						НоваяЗапись.ВыручкаБезНДС                      = НоваяЗапись.Сумма - НоваяЗапись.СуммаНДС;
						НоваяЗапись.ВыручкаБезНДСУпр                   = НоваяЗапись.СуммаУпр - НоваяЗапись.СуммаНДСУпр;
						НоваяЗапись.ВыручкаДоПримененияСкидки          = НоваяЗапись.Сумма + НоваяЗапись.СуммаСкидки;
						НоваяЗапись.ВыручкаДоПримененияСкидкиБезНДС    = НоваяЗапись.Сумма + НоваяЗапись.СуммаСкидки - НоваяЗапись.СуммаНДС - Окр(НоваяЗапись.СуммаСкидки * СтавкаНДС / (100 + СтавкаНДС), 2);
						НоваяЗапись.ВыручкаДоПримененияСкидкиУпр       = НоваяЗапись.СуммаУпр + НоваяЗапись.СуммаСкидкиУпр;
						НоваяЗапись.ВыручкаДоПримененияСкидкиБезНДСУпр = НоваяЗапись.СуммаУпр + НоваяЗапись.СуммаСкидкиУпр - НоваяЗапись.СуммаНДСУпр - Окр(НоваяЗапись.СуммаСкидкиУпр * СтавкаНДС / (100 + СтавкаНДС), 2);
						
					КонецЕсли;
					
					КоличествоВсего = КоличествоВсего - КолСписываем;
					СуммаРазница    = СуммаРазница - СуммаСпис;
					СуммаРазницаНДС = СуммаРазницаНДС - СуммаСписНДС;
				КонецЦикла;
			Иначе
				НоваяЗапись.Сумма            = НоваяЗапись.Сумма + Окр(СуммаРазница,2);
				НоваяЗапись.СуммаНДС         = НоваяЗапись.СуммаНДС + Окр(СуммаРазницаНДС,2);
				НоваяЗапись.СуммаУпр         = НоваяЗапись.СуммаУпр + РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаРазница,ВалютаРегл,Дата,ВалютаУпр,Дата);
				НоваяЗапись.СуммаНДСУпр      = НоваяЗапись.СуммаНДСУпр + РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаРазницаНДС,ВалютаРегл,Дата,ВалютаУпр,Дата);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецФункции

// Формирует движения по регистру реализованных товаров
//
Функция ПровестиПоРеализованнымТоварам()
	Запрос = Новый Запрос;
	// получим таблицу документа
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	СУММА(КорректировкаРеализацииТовары.Количество*КорректировкаРеализацииТовары.Коэффициент) КАК Количество,
	|	СУММА(КорректировкаРеализацииТовары.СуммаВсего) КАК СуммаВсего,
	|	СУММА(КорректировкаРеализацииТовары.СуммаНДС) КАК СуммаНДС,
	|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры,
	|	КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	(КорректировкаРеализацииТовары.КоличествоРазница <> 0
	|	ИЛИ КорректировкаРеализацииТовары.СуммаВсегоРазница <> 0)
	|	И КорректировкаРеализацииТовары.Количество > 0
	|	И КорректировкаРеализацииТовары.Ссылка = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры,
	|	КорректировкаРеализацииТовары.СтавкаНДС";
	Запрос.УстановитьПараметр("Регистратор",Ссылка);
	ТаблДок =  Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПартииТоваровКомпании.СкладКомпании,
	|	ПартииТоваровКомпании.Номенклатура,
	|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпании.СтатусПартии,
	|	ПартииТоваровКомпании.Партия,
	|	ПартииТоваровКомпании.Количество,
	|	ПартииТоваровКомпании.Сумма,
	|	ПартииТоваровКомпании.СуммаНДС,
	|	ПартииТоваровКомпании.СуммаБезНДС,
	|	ПартииТоваровКомпании.СуммаУпр,
	|	ПартииТоваровКомпании.СуммаНДСУпр,
	|	ПартииТоваровКомпании.СуммаБезНДСУпр,
	|	ПартииТоваровКомпании.ХозОперация,
	|	ПартииТоваровКомпании.СтавкаНДС,
	|	ПартииТоваровКомпании.Проект
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.Регистратор = &Регистратор
	|	И ПартииТоваровКомпании.Номенклатура В(&Номенклатура)
	|	И ПартииТоваровКомпании.СтатусПартии = &СтатусПартии
	|	И ПартииТоваровКомпании.ВидДвижения = &ВидДвижения";
	
	Запрос.УстановитьПараметр("ВидДвижения"  , ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Номенклатура" , ТаблДок.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Регистратор"  , Ссылка);
	Запрос.УстановитьПараметр("СтатусПартии" , Перечисления.СтатусыПартий.ТоварПринятыйКомиссия);
	ТаблДвижений = Запрос.Выполнить().Выгрузить();
	
	ТаблГТД = Движения.ГТДПартийТоваровКомпании.Выгрузить().Скопировать();
	
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	Для каждого стрДвижений Из ТаблДвижений Цикл
		НадоОприходовать                = стрДвижений.Количество;
		НадоОприходоватьСумма           = стрДвижений.СуммаУпр;
		НадоОприходоватьСуммаНДС        = стрДвижений.СуммаНДСУпр;
		НадоОприходоватьСуммаБезНДС     = стрДвижений.СуммаБезНДСУпр;
		НадоОприходоватьСуммаРегл       = стрДвижений.Сумма;
		НадоОприходоватьСуммаНДСРегл    = стрДвижений.СуммаНДС;
		НадоОприходоватьСуммаБезНДСРегл = стрДвижений.СуммаБезНДС;
		
		// пройдемся по ГТД
		стрПоиск = Новый Структура;
		стрПоиск.Вставить("Номенклатура",стрДвижений.Номенклатура);
		стрПоиск.Вставить("Партия", стрДвижений.Партия);
		Если ЗначениеЗаполнено(стрДвижений.ХарактеристикаНоменклатуры) Тогда
			стрПоиск.Вставить("ХарактеристикаНоменклатуры",стрДвижений.ХарактеристикаНоменклатуры);
		КонецЕсли;
		МассивГТД = ТаблГТД.НайтиСтроки(стрПоиск);
		
		Для Каждого стрГТД Из МассивГТД Цикл
			Если стрГТД.Количество = 0 Тогда Продолжить; КонецЕсли;
			Если НадоОприходовать = 0 Тогда Прервать; КонецЕсли;
			
			КоличествоПриходуем      = Мин(стрГТД.Количество, НадоОприходовать);
			СуммаПриходуем           = ?(НадоОприходовать = КоличествоПриходуем,НадоОприходоватьСумма,НадоОприходоватьСумма/НадоОприходовать*КоличествоПриходуем);
			СуммаНДСПриходуем        = ?(НадоОприходовать = КоличествоПриходуем,НадоОприходоватьСуммаНДС,НадоОприходоватьСуммаНДС/НадоОприходовать*КоличествоПриходуем);
			СуммаБезНДСПриходуем     = ?(НадоОприходовать = КоличествоПриходуем,НадоОприходоватьСуммаБезНДС,НадоОприходоватьСуммаБезНДС/НадоОприходовать*КоличествоПриходуем);
			СуммаРеглПриходуем       = ?(НадоОприходовать = КоличествоПриходуем,НадоОприходоватьСуммаРегл,НадоОприходоватьСуммаРегл/НадоОприходовать*КоличествоПриходуем);
			СуммаНДСРеглПриходуем    = ?(НадоОприходовать = КоличествоПриходуем,НадоОприходоватьСуммаНДСРегл,НадоОприходоватьСуммаНДСРегл/НадоОприходовать*КоличествоПриходуем);
			СуммаБезНДСРеглПриходуем = ?(НадоОприходовать = КоличествоПриходуем,НадоОприходоватьСуммаБезНДСРегл,НадоОприходоватьСуммаБезНДСРегл/НадоОприходовать*КоличествоПриходуем);
			
			// получим массивы строк
			МассивСХар   = ТаблДок.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",стрДвижений.Номенклатура,стрДвижений.ХарактеристикаНоменклатуры));
			МассивБезХар = ТаблДок.НайтиСтроки(Новый Структура("Номенклатура",стрДвижений.Номенклатура));
			
			Если МассивСХар.Количество() > 0 Тогда
				ТекСтрока = МассивСХар[0];
			ИначеЕсли МассивБезХар.Количество() > 0 Тогда
				ТекСтрока = МассивБезХар[0];
			Иначе
				ТекСтрока = Неопределено;
			КонецЕсли;
			
			НоваяЗапись             = Движения.РеализованныеТовары.Добавить();
			НоваяЗапись.Регистратор = Ссылка;
			НоваяЗапись.Период      = Дата;
			
			// измерения
			НоваяЗапись.Контрагент                 = стрДвижений.Партия.Контрагент;
			НоваяЗапись.ДоговорВзаиморасчетов      = стрДвижений.Партия.ДоговорВзаиморасчетов;
			НоваяЗапись.Номенклатура               = стрДвижений.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры = стрДвижений.ХарактеристикаНоменклатуры;
			НоваяЗапись.ДокументПередачи           = стрДвижений.Партия;
			НоваяЗапись.ГТД                        = стрГТД.ГТД;
			
			// ресурсы
			НоваяЗапись.Количество     = КоличествоПриходуем;
			НоваяЗапись.СуммаУпр       = СуммаПриходуем;
			НоваяЗапись.СуммаНДСУпр    = СуммаНДСПриходуем;
			НоваяЗапись.СуммаБезНДСУпр = СуммаБезНДСПриходуем;
			НоваяЗапись.СуммаРегл      = СуммаРеглПриходуем;
			НоваяЗапись.СуммаНДС       = СуммаНДСРеглПриходуем;
			НоваяЗапись.СуммаБезНДС    = СуммаБезНДСРеглПриходуем;
			
			Если ТекСтрока <> Неопределено Тогда
				Если КоличествоПриходуем = ТекСтрока.Количество Тогда
					СуммаПродажи = ТекСтрока.СуммаВсего;
				Иначе
					СуммаПродажи = ?(ТекСтрока.Количество = 0,0, ТекСтрока.СуммаВсего/ТекСтрока.Количество*КоличествоПриходуем);
				КонецЕсли;
				
				ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
				Если ВалютаУпр = ВалютаДокумента Тогда
					НоваяЗапись.СуммаПродажи = СуммаПродажи;
				Иначе
					НоваяЗапись.СуммаПродажи = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаПродажи,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсВалютыУпр);
				КонецЕсли;
				
				НоваяЗапись.СуммаПродажиРегл = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаПродажи,ВалютаДокумента,КурсДокумента,ВалютаРегл,Дата);
				
				// Себестоимость равна продаже
				Если (НЕ НоваяЗапись.ДоговорВзаиморасчетов.КомиссияОтчетНаОснованииПродаж) Тогда
					НоваяЗапись.СуммаРегл      = НоваяЗапись.СуммаПродажиРегл;
					НоваяЗапись.СуммаНДС       = Окр((НоваяЗапись.СуммаПродажиРегл*ТекСтрока.СтавкаНДС.Ставка)/(100 + ТекСтрока.СтавкаНДС.Ставка),2);
					НоваяЗапись.СуммаБезНДС    = НоваяЗапись.СуммаРегл - НоваяЗапись.СуммаНДС;
					НоваяЗапись.СуммаУпр       = НоваяЗапись.СуммаПродажи;
					НоваяЗапись.СуммаНДСУпр    = Окр((НоваяЗапись.СуммаПродажи*ТекСтрока.СтавкаНДС.Ставка)/(100 + ТекСтрока.СтавкаНДС.Ставка),2);
					НоваяЗапись.СуммаБезНДСУпр = НоваяЗапись.СуммаУпр - НоваяЗапись.СуммаНДСУпр;
				КонецЕсли;
				
			Иначе
				ВывестиСообщение(НСтр("ru='Не удалось получить сумму продажи товара <%1>.'"),,,,, стрДвижений.Номенклатура);
			КонецЕсли;
			
			// реквизиты
			НоваяЗапись.ХозОперация = ХозОперация;
			
			// уменьшим оприходованное
			НадоОприходовать                = НадоОприходовать - КоличествоПриходуем;
			НадоОприходоватьСумма           = НадоОприходоватьСумма - СуммаПриходуем;
			НадоОприходоватьСуммаНДС        = НадоОприходоватьСуммаНДС - СуммаНДСПриходуем;
			НадоОприходоватьСуммаБезНДС     = НадоОприходоватьСуммаБезНДС - СуммаБезНДСПриходуем;
			НадоОприходоватьСуммаРегл       = НадоОприходоватьСуммаРегл - СуммаРеглПриходуем;
			НадоОприходоватьСуммаНДСРегл    = НадоОприходоватьСуммаНДСРегл - СуммаНДСРеглПриходуем;
			НадоОприходоватьСуммаБезНДСРегл = НадоОприходоватьСуммаБезНДСРегл - СуммаБезНДСРеглПриходуем;
			
			Если КоличествоПриходуем = стрГТД.Количество Тогда
				ТаблГТД.Удалить(стрГТД);
			Иначе
				стрГТД.Количество = стрГТД.Количество - КоличествоПриходуем;
			КонецЕсли;
		КонецЦикла;
		
		Если НадоОприходовать > 0 Тогда
			// получим массивы строк
			МассивСХар   = ТаблДок.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",стрДвижений.Номенклатура,стрДвижений.ХарактеристикаНоменклатуры));
			МассивБезХар = ТаблДок.НайтиСтроки(Новый Структура("Номенклатура",стрДвижений.Номенклатура));
			
			Если МассивСХар.Количество() > 0 Тогда
				ТекСтрока = МассивСХар[0];
			ИначеЕсли МассивБезХар.Количество() > 0 Тогда
				ТекСтрока = МассивБезХар[0];
			Иначе
				ТекСтрока = Неопределено;
			КонецЕсли;
			
			НоваяЗапись             = Движения.РеализованныеТовары.Добавить();
			НоваяЗапись.Регистратор = Ссылка;
			НоваяЗапись.Период      = Дата;
			
			// измерения
			НоваяЗапись.Контрагент                 = стрДвижений.Партия.Контрагент;
			НоваяЗапись.ДоговорВзаиморасчетов      = стрДвижений.Партия.ДоговорВзаиморасчетов;
			НоваяЗапись.Номенклатура               = стрДвижений.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры = стрДвижений.ХарактеристикаНоменклатуры;
			НоваяЗапись.ДокументПередачи           = стрДвижений.Партия;
			
			// ресурсы
			
			НоваяЗапись.Количество     = НадоОприходовать;
			НоваяЗапись.СуммаУпр       = НадоОприходоватьСумма;
			НоваяЗапись.СуммаНДСУпр    = НадоОприходоватьСуммаНДС;
			НоваяЗапись.СуммаБезНДСУпр = НадоОприходоватьСуммаБезНДС;
			НоваяЗапись.СуммаРегл      = НадоОприходоватьСуммаРегл;
			НоваяЗапись.СуммаНДС       = НадоОприходоватьСуммаНДСРегл;
			НоваяЗапись.СуммаБезНДС    = НадоОприходоватьСуммаБезНДСРегл;
			
			Если ТекСтрока <> Неопределено Тогда
				Если НадоОприходовать = ТекСтрока.Количество Тогда
					СуммаПродажи = ТекСтрока.СуммаВсего;
				Иначе
					СуммаПродажи = ?(ТекСтрока.Количество = 0,0, ТекСтрока.СуммаВсего/ТекСтрока.Количество*НадоОприходовать);
				КонецЕсли;
				
				ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
				Если ВалютаУпр = ВалютаДокумента Тогда
					НоваяЗапись.СуммаПродажи = СуммаПродажи;
				Иначе
					НоваяЗапись.СуммаПродажи = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаПродажи,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсВалютыУпр);
				КонецЕсли;
				
				НоваяЗапись.СуммаПродажиРегл = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаПродажи,ВалютаДокумента,КурсДокумента,ВалютаРегл,Дата);
				
				// Себестоимость равна продаже
				Если (НЕ НоваяЗапись.ДоговорВзаиморасчетов.КомиссияОтчетНаОснованииПродаж) Тогда
					НоваяЗапись.СуммаРегл      = НоваяЗапись.СуммаПродажиРегл;
					НоваяЗапись.СуммаНДС       = Окр((НоваяЗапись.СуммаПродажиРегл*ТекСтрока.СтавкаНДС.Ставка)/(100 + ТекСтрока.СтавкаНДС.Ставка),2);
					НоваяЗапись.СуммаБезНДС    = НоваяЗапись.СуммаРегл - НоваяЗапись.СуммаНДС;
					НоваяЗапись.СуммаУпр       = НоваяЗапись.СуммаПродажи;
					НоваяЗапись.СуммаНДСУпр    = Окр((НоваяЗапись.СуммаПродажи*ТекСтрока.СтавкаНДС.Ставка)/(100 + ТекСтрока.СтавкаНДС.Ставка),2);
					НоваяЗапись.СуммаБезНДСУпр = НоваяЗапись.СуммаУпр - НоваяЗапись.СуммаНДСУпр;
				КонецЕсли;
				
			Иначе
				ВывестиСообщение(НСтр("ru='Не удалось получить сумму продажи товара <%1>.'"),,,,, стрДвижений.Номенклатура);
			КонецЕсли;
			
			// реквизиты
			НоваяЗапись.ХозОперация = ХозОперация;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

// Формирует движения документа по партионным регистрам
// Режим - режим проведения (оперативный/неоперативный)
// ДокументСсылка - ссылка на документ который надо допровести по партиям
// Возвращает Истина - все нормально, ложь - чего-то не так.
Функция ПровестиПоПартиям(Режим,ДокументСсылка, СуммаРазногласий) Экспорт
	Отказ=Ложь;
	
	// Получим шапку документа
	ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	
	КорректировкаБезОснования = (ШапкаДокумента.ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииКорректировкаБезОснования);
	
	ВедетсяБалансПоПодразделению= БалансВедетсяПоПодразделениям(ШапкаДокумента.Дата);
	
	// Проверим, если подразделение проводиться по партиям "отложенно", то дальше не идем.
	НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
		Если ВедетсяБалансПоПодразделению Тогда
			НаборЗаписейДоходыИРасходы.Подразделение=ДоговорВзаиморасчетов.ПодразделениеКомпании;
		КонецЕсли;
		НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте = Ложь;
		НаборЗаписейДоходыИРасходы.Доход = СуммаРазногласий;
		НаборЗаписейДоходыИРасходы.Приход();
		Возврат НЕ Отказ;
	КонецЕсли;
	
	ПодразделениеСклад = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ШапкаДокумента.СкладКомпании.ПодразделениеКомпании, ШапкаДокумента.Дата);
	ПодразделениеДоговорВзаиморасчетов = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ШапкаДокумента.ДоговорВзаиморасчетов.ПодразделениеКомпании, ШапкаДокумента.Дата);
	БалансовыеПодразделенияНеРавны = (ПодразделениеДоговорВзаиморасчетов<>ПодразделениеСклад);
	
	// Проведем партии товаров проданные 
	НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
	НаборЗаписейПартии.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейПартии.СкладКомпании=ШапкаДокумента.СкладКомпании;
	НаборЗаписейПартии.Организация=ШапкаДокумента.Организация;
	НаборЗаписейПартии.ИмяРеквизитаДокумент="";
	НаборЗаписейПартии.ПоБазовомуКоличеству=Ложь;
	// Если и передаем товар на комиссию, то только собственный
	Если ШапкаДокумента.Сделка.ХозОперация=Справочники.ХозОперации.РеализацияТоваровКомиссия Тогда
		НаборЗаписейПартии.СтатусПартии=Перечисления.СтатусыПартий.ТоварКупленный;
	КонецЕсли;
	НаборЗаписейПартии.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейПартии.Расход() ИЛИ Отказ;
	
	// вернем партии товаров компании
	Если ШапкаДокумента.ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииКорректировкаБезОснования Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КорректировкаРеализацииТовары.Номенклатура,
		|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры,
		|	СУММА(КорректировкаРеализацииТовары.КоличествоРазница * КорректировкаРеализацииТовары.Коэффициент) КАК Количество
		|ПОМЕСТИТЬ
		|	Товары
		|ИЗ
		|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
		|ГДЕ
		|	КорректировкаРеализацииТовары.Ссылка = &Ссылка
		|	И КорректировкаРеализацииТовары.КоличествоРазница < 0
		|	И КорректировкаРеализацииТовары.Номенклатура.ВидНоменклатуры <> &Услуга
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры,
		|	КорректировкаРеализацииТовары.Номенклатура
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Товары.Номенклатура,
		|	Товары.ХарактеристикаНоменклатуры,
		|	МАКСИМУМ(Товары.Количество) КАК Количество,
		|	МАКСИМУМ(ПартииТоваровКомпании.Период) КАК Период
		|ПОМЕСТИТЬ
		|	ПартииТоваровКомпанииСрез
		|ИЗ
		|	Товары КАК Товары
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
		|ПО
		|	ПартииТоваровКомпании.Период <= &Дата И 
		|	ПартииТоваровКомпании.СкладКомпании = &СкладКомпании И 
		|	ПартииТоваровКомпании.Регистратор = ПартииТоваровКомпании.Партия И 
		|	ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И 
		|	Товары.Номенклатура = ПартииТоваровКомпании.Номенклатура И 
		|	(Товары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ИЛИ Товары.ХарактеристикаНоменклатуры = ПартииТоваровКомпании.ХарактеристикаНоменклатуры)
		//|ГДЕ
		//|	ПартииТоваровКомпании.СкладКомпании = &СкладКомпании И 
		//|	ПартииТоваровКомпании.Регистратор = ПартииТоваровКомпании.Партия И 
		//|	ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И 
		//|	ПартииТоваровКомпании.Сумма>0
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура,
		|	Товары.ХарактеристикаНоменклатуры
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Товары.Номенклатура,
		|	Товары.Номенклатура.СтавкаНДС КАК НоменклатураСтавкаНДС,
		|	ЕСТЬNULL(Товары.Номенклатура.СтавкаНДС.Ставка, 0) КАК НоменклатураЗначениеСтавкиНДС,
		|	Товары.ХарактеристикаНоменклатуры,
		|	МАКСИМУМ(Товары.Количество) КАК Количество,
		|	ЕСТЬNULL(МАКСИМУМ(ПартииТоваровКомпании.СтавкаНДС), Товары.Номенклатура.СтавкаНДС) КАК СтавкаНДС,
		|	ЕСТЬNULL(ВЫБОР
		|		КОГДА СУММА(ПартииТоваровКомпании.Количество) = 0 ТОГДА
		|			СУММА(ПартииТоваровКомпании.Сумма)
		|		ИНАЧЕ
		|			СУММА(ПартииТоваровКомпании.Сумма)/СУММА(ПартииТоваровКомпании.Количество)
		|	КОНЕЦ, 0) КАК ЦенаРегл,
		|	ЕСТЬNULL(ВЫБОР
		|		КОГДА СУММА(ПартииТоваровКомпании.Количество) = 0 ТОГДА
		|			СУММА(ПартииТоваровКомпании.СуммаУпр)
		|		ИНАЧЕ
		|			СУММА(ПартииТоваровКомпании.СуммаУпр)/СУММА(ПартииТоваровКомпании.Количество)
		|	КОНЕЦ, 0) КАК ЦенаУпр
		|ИЗ
		|	ПартииТоваровКомпанииСрез КАК Товары
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
		|ПО
		|	ПартииТоваровКомпании.СкладКомпании = &СкладКомпании И 
		|	Товары.Период = ПартииТоваровКомпании.Период И 
		|	ПартииТоваровКомпании.Регистратор = ПартииТоваровКомпании.Партия И 
		|	ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И 
		|	Товары.Номенклатура = ПартииТоваровКомпании.Номенклатура И 
		|	(Товары.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ИЛИ Товары.ХарактеристикаНоменклатуры = ПартииТоваровКомпании.ХарактеристикаНоменклатуры)
		//|ГДЕ
		//|	ПартииТоваровКомпании.СкладКомпании = &СкладКомпании И 
		//|	ПартииТоваровКомпании.Регистратор = ПартииТоваровКомпании.Партия И 
		//|	ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И 
		//|	ПартииТоваровКомпании.Сумма>0
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура,
		|	Товары.ХарактеристикаНоменклатуры,
		|	Товары.Номенклатура.СтавкаНДС,
		|	ЕСТЬNULL(Товары.Номенклатура.СтавкаНДС.Ставка, 0)
		|";
		
		Запрос.УстановитьПараметр("Дата",          ШапкаДокумента.Дата);
		Запрос.УстановитьПараметр("СкладКомпании", ШапкаДокумента.СкладКомпании);
		Запрос.УстановитьПараметр("Ссылка",        ШапкаДокумента.Ссылка);
		Запрос.УстановитьПараметр("Услуга",        Перечисления.ВидыНоменклатуры.Услуга);
		ТабДок = Запрос.Выполнить().Выгрузить();
		
		ТипЦенНормативнаяЦена = Справочники.ТипыЦен.НормативнаяЦена;
		ЦенаВключаетНДС       = ТипЦенНормативнаяЦена.ЦенаВключаетНДС;
		СкладПодразделенияКомпании = ШапкаДокумента.СкладКомпании.ПодразделениеКомпании;
		
		ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		
		КурсУпр = ШапкаДокумента.КурсВалютыУпр;
		СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРегл,ШапкаДокумента.Дата);
		КурсРегл = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		
		ПартияТоваровОтрицательныхОстатков = Константы.ПартияТоваровОтрицательныхОстатков.Получить();
		
		Для Каждого ТекущаяСтрока Из ТабДок Цикл
			НоваяЗапись = Движения.ПартииТоваровКомпании.Добавить();
			НоваяЗапись.Период        = ШапкаДокумента.Дата;
			НоваяЗапись.Регистратор   = ШапкаДокумента.Ссылка;
			НоваяЗапись.Номенклатура  = ТекущаяСтрока.Номенклатура;
			НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Расход;
			НоваяЗапись.СкладКомпании = ШапкаДокумента.СкладКомпании;
			НоваяЗапись.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
			НоваяЗапись.Партия = ПартияТоваровОтрицательныхОстатков;
			НоваяЗапись.СтатусПартии = Перечисления.СтатусыПартий.ТоварКупленный;
			НоваяЗапись.Количество = ТекущаяСтрока.Количество;
			
			Если ТекущаяСтрока.ЦенаРегл=0 Тогда
				
				Результат = ЦенообразованиеСервер.ПолучитьСогласованнуюЦену(ШапкаДокумента.Дата,, ШапкаДокумента.ПодразделениеКомпании, ТекущаяСтрока.Номенклатура);
				ЦенаЗакупки = Результат.Цена;
				
				Если ЦенаЗакупки=0 Тогда
					ЦенаЗакупки = ЦенообразованиеСервер.ПолучитьЦену(ТипЦенНормативнаяЦена, ТекущаяСтрока.Номенклатура, ШапкаДокумента.Ссылка,,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента, ТекущаяСтрока.ХарактеристикаНоменклатуры,, СкладПодразделенияКомпании);
					Если НЕ ЦенаВключаетНДС И ЗначениеЗаполнено(ТекущаяСтрока.НоменклатураСтавкаНДС) Тогда
						ЦенаЗакупки = ЦенаЗакупки+(ЦенаЗакупки*ТекущаяСтрока.НоменклатураЗначениеСтавкиНДС/100);
					КонецЕсли;
				КонецЕсли;
				
				СуммаВсего = ЦенаЗакупки* ТекущаяСтрока.Количество;
				
				НоваяЗапись.СтавкаНДС = ТекущаяСтрока.НоменклатураСтавкаНДС;
				
				НоваяЗапись.Сумма    = Окр(РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаВсего,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл),2);
				НоваяЗапись.СуммаУпр = Окр(РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СуммаВсего,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр),2);
				
				НоваяЗапись.СуммаБезНДС = Окр(НоваяЗапись.Сумма/((100+ТекущаяСтрока.НоменклатураЗначениеСтавкиНДС)/100),2);
				НоваяЗапись.СуммаБезНДСУпр = Окр(НоваяЗапись.СуммаУпр/((100+ТекущаяСтрока.НоменклатураЗначениеСтавкиНДС)/100),2);
				
			Иначе
				
				НоваяЗапись.Сумма    = Окр(ТекущаяСтрока.ЦенаРегл*ТекущаяСтрока.Количество, 2);
				НоваяЗапись.СуммаУпр = Окр(ТекущаяСтрока.ЦенаУпр*ТекущаяСтрока.Количество, 2);
				
				Если ЗначениеЗаполнено(ТекущаяСтрока.СтавкаНДС) Тогда
					НоваяЗапись.СтавкаНДС = ТекущаяСтрока.СтавкаНДС;
					НоваяЗапись.СуммаБезНДС = Окр(НоваяЗапись.Сумма/((100+ТекущаяСтрока.СтавкаНДС.ставка)/100),2);
					НоваяЗапись.СуммаБезНДСУпр = Окр(НоваяЗапись.СуммаУпр/((100+ТекущаяСтрока.СтавкаНДС.Ставка)/100),2);
				Иначе
					НоваяЗапись.СтавкаНДС = ТекущаяСтрока.НоменклатураСтавкаНДС;
					НоваяЗапись.СуммаБезНДС = Окр(НоваяЗапись.Сумма/((100+ТекущаяСтрока.НоменклатураЗначениеСтавкиНДС)/100),2);
					НоваяЗапись.СуммаБезНДСУпр = Окр(НоваяЗапись.СуммаУпр/((100+ТекущаяСтрока.НоменклатураЗначениеСтавкиНДС)/100),2);
				КонецЕсли;
				
			КонецЕсли;
			
			НоваяЗапись.СуммаНДС = НоваяЗапись.Сумма-НоваяЗапись.СуммаБезНДС;
			НоваяЗапись.СуммаНДСУпр = НоваяЗапись.СуммаУпр-НоваяЗапись.СуммаБезНДСУпр;
						
			// Определяемся с хоз. операцией
			НоваяЗапись.ХозОперация                = ШапкаДокумента.ХозОперация;
		КонецЦикла;
		
	Иначе
		
		ПровестиВозвратТоваров(Отказ,ШапкаДокумента,Режим);
		
	КонецЕсли;
	
	Если НЕ ШапкаДокумента.ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииКорректировкаБезОснования Тогда
		// добавим новые реализованные товары
		ПровестиПоРеализованнымТоварам();
	КонецЕсли;
	
	// Подготовим таблицу движений в разрезе подразделений только собственных списанных партий.
	ТаблицаСписанийПартий = Движения.ПартииТоваровКомпании.Выгрузить();
	ТаблицаСписанийПартий.Свернуть("СкладКомпании,СтатусПартии","СуммаУпр");
	СтруктураОтбора=Новый Структура("СтатусПартии",Перечисления.СтатусыПартий.ТоварПринятыйКомиссия);
	МассивНайденныхСтрок=ТаблицаСписанийПартий.НайтиСтроки(СтруктураОтбора);
	Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
		ТаблицаСписанийПартий.Удалить(МассивНайденныхСтрок[Сч]);
	КонецЦикла;
	
	СебестоимостьУпр = ТаблицаСписанийПартий.Итог("СуммаУпр");
	
	НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
	НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
	// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
	Если ВедетсяБалансПоПодразделению Тогда
		НаборЗаписейДоходыИРасходы.Подразделение=ШапкаДокумента.СкладКомпании.ПодразделениеКомпании;
	КонецЕсли;
	НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.Себестоимость;
	НаборЗаписейДоходыИРасходы.ВУпрВалюте=Истина;
	НаборЗаписейДоходыИРасходы.Расход=СебестоимостьУпр;	
	НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	
	// Подготовим таблицу движений в разрезе подразделений комиссионных товаров
	ТаблицаСписанийПартийРеализованных = Движения.РеализованныеТовары.Выгрузить();
	ТаблицаСписанийПартийРеализованных.Свернуть("ДоговорВзаиморасчетов","СуммаУпр");
	
	ОписаниеТипов=Новый ОписаниеТипов;
	ОписаниеТипов.Типы().Добавить(Тип("СправочникСсылка.ПодразделенияКомпании"));
	ТаблицаСписанийПартийРеализованных.Колонки.Добавить("Подразделение",ОписаниеТипов);
	Для Каждого СтрокаСписания Из ТаблицаСписанийПартийРеализованных Цикл
		СтрокаСписания.Подразделение = СтрокаСписания.ДоговорВзаиморасчетов.ПодразделениеКомпании;
	КонецЦикла;	
	ТаблицаСписанийПартийРеализованных.Свернуть("Подразделение","СуммаУпр");
	
	// В случае если, ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
	Если ВедетсяБалансПоПодразделению Тогда
		Для Каждого СтрокаСписания Из ТаблицаСписанийПартийРеализованных Цикл
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.Подразделение=СтрокаСписания.Подразделение;
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.Себестоимость;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте=Истина;
			НаборЗаписейДоходыИРасходы.Расход=СтрокаСписания.СуммаУпр;
			НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
			Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		КонецЦикла;
	Иначе
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.Себестоимость;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте=Истина;
		НаборЗаписейДоходыИРасходы.Расход=ТаблицаСписанийПартийРеализованных.Итог("СуммаУпр");
		НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	// Доход от начисления дебиторской задолженности по отгруженному товару и оказанным услугам.
	Запрос=Новый Запрос();
	ТекстЗапроса="
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(КорректировкаРеализацииТовары.СуммаВсегоРазница),0) КАК СуммаТоваров,
	|	ЕСТЬNULL(СУММА(0),0) КАК СуммаУслуг
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка = &ТекДок
	|	И КорректировкаРеализацииТовары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(0),0),
	|	ЕСТЬNULL(СУММА(КорректировкаРеализацииТовары.СуммаВсегоРазница),0)
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка = &ТекДок
	|	И КорректировкаРеализацииТовары.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)";
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекДок",ШапкаДокумента.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();
	СуммаТоваров=0; СуммаУслуг=0;
	Пока Выборка.Следующий() Цикл
		СуммаТоваров=СуммаТоваров+Выборка.СуммаТоваров;
		СуммаУслуг=СуммаУслуг+Выборка.СуммаУслуг;
	КонецЦикла;
	
	Если (НЕ Отказ) И (НЕ КорректировкаБезОснования) Тогда
		ВУпрВалюте=(ВалютаДокумента=Константы.ВалютаУправленческогоУчетаКомпании.Получить());
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
		// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
		Если ВедетсяБалансПоПодразделению Тогда
			НаборЗаписейДоходыИРасходы.Подразделение=ШапкаДокумента.ДоговорВзаиморасчетов.ПодразделениеКомпании;
		КонецЕсли;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте=ВУпрВалюте;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.НачислениеДебиторскойЗадолженностиПоТовару;
		НаборЗаписейДоходыИРасходы.Доход=СуммаТоваров;
		НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
		// В случае, если ведется баланс по подразделению, передадим подразделение, соответствующее корреспонденции.
		Если ВедетсяБалансПоПодразделению Тогда
			НаборЗаписейДоходыИРасходы.Подразделение=ШапкаДокумента.ДоговорВзаиморасчетов.ПодразделениеКомпании;
		КонецЕсли;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте=ВУпрВалюте;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.НачислениеДебиторскойЗадолженностиПоУслугам;
		НаборЗаписейДоходыИРасходы.Доход=СуммаУслуг;
		НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	// двигаем границу последовательности партий
	Если Ссылка <> ДокументСсылка Тогда
		
		РаботаСГраницами.МоментВремениПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		РаботаСГраницами.ДвиженияПоПартиямПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		
	КонецЕсли;
	
	РаботаСГраницами.СдвинутьГраницуПартий(ДокументСсылка, ДополнительныеСвойства, Движения);
	
	Возврат НЕ Отказ;
КонецФункции

// Формирует движения накоплений по карточкам контрагентов
//
Процедура ОбработкаПроведенияНакопленияПоКарточкамКонтрагентов()
	
	Если НЕ ЗначениеЗаполнено(Карточка) ИЛИ Сделка.ХозОперация <> Справочники.ХозОперации.РеализацияАгентскихУслуг Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КорректировкаРеализацииТовары.Ссылка.Контрагент,
	|	КорректировкаРеализацииТовары.Ссылка.Карточка,
	|	КорректировкаРеализацииТовары.Ссылка.Дата КАК ПериодНакопления,
	|	СУММА(КорректировкаРеализацииТовары.КоличествоРазница) КАК КоличествоНоменклатуры,
	|	СУММА(КорректировкаРеализацииТовары.СуммаВсегоРазница) КАК Сумма,
	|	СУММА(0) КАК КоличествоЧеков
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка = &Ссылка
	|	И (КорректировкаРеализацииТовары.КоличествоРазница <> 0
	|	ИЛИ КорректировкаРеализацииТовары.СуммаВсегоРазница <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализацииТовары.Ссылка.Контрагент,
	|	КорректировкаРеализацииТовары.Ссылка.Карточка,
	|	КорректировкаРеализацииТовары.Ссылка.Дата";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	НаборНакоплениеСумм = Движения.НакопленияПоКарточкамКонтрагентов;
	НаборНакоплениеСумм.ДокументСсылка   = Ссылка;
	НаборНакоплениеСумм.РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	НаборНакоплениеСумм.ВыполнитьДвижения();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "КорректировкаРеализации"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_КорректировкаРеализации(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_КорректировкаРеализации()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И (ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваров") Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкаРеализации")) Тогда
		
		Если ДанныеЗаполнения = Ссылка Тогда
			УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, НСтр("ru = 'Ввод корректировки реализации на основании самой себя запрещен.'"));
			Возврат;
		КонецЕсли;
		
		Если НЕ ДанныеЗаполнения.Проведен Тогда
			УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, НСтр("ru = 'Ввод корректировки реализации возможен только на основании проведенного документа.'"));
			Возврат;
		КонецЕсли;
		
		Если ПолучитьЗначениеПараметраСтруктуры(ДанныеЗаполнения, "ХозОперация", "") = Справочники.ХозОперации.РеализацияТоваровКомиссия Тогда
			УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, НСтр("ru = 'Ввод корректировки реализации не возможен на основании реализации товаров комиссия.'"));
			Возврат;
		КонецЕсли;
		
		Если Документы.КорректировкаРеализации.КорректировкаНеДоступна(ДанныеЗаполнения) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'На основании <%1> введен возврат товаров. Ввод корректировки реализации невозможен.'"), ДанныеЗаполнения);
			УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, ТекстСообщения);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Сделка = Документы.КорректировкаРеализации.ПолучитьСделку(ДанныеЗаполнения);
	
	Товары.Очистить();
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "ВхДокНомер,ВхДокДатаВрем") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполненНаОснованииДокумента = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеСвойства, "ВыполненоЗаполнениеНаОсновании", "");
	
	Если НЕ ЗаполненНаОснованииДокумента = "КорректировкаРеализации" Тогда 
		Товары.Свернуть("Номенклатура,ЕдиницаИзмерения,Коэффициент,СтавкаНДС,ХарактеристикаНоменклатуры","Количество,Сумма,СуммаНДС,СуммаВсего");
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Товары Цикл
		
		СтрокаТЧ.Цена 									= ?(СтрокаТЧ.Количество <> 0, СтрокаТЧ.Сумма/СтрокаТЧ.Количество, 0);
		СтрокаТЧ.ПоДокументуРеализации					= Истина;
		СтрокаТЧ.Подтверждение							= Истина;
		СтрокаТЧ.КоличествоПоДокументуРеализации		= СтрокаТЧ.Количество;
		СтрокаТЧ.ЕдиницаИзмеренияПоДокументуРеализации	= СтрокаТЧ.ЕдиницаИзмерения;
		СтрокаТЧ.КоэффициентПоДокументуРеализации		= СтрокаТЧ.Коэффициент;
		СтрокаТЧ.СтавкаНДСПоДокументуРеализации			= СтрокаТЧ.СтавкаНДС;
		СтрокаТЧ.СуммаНДСПоДокументуРеализации			= СтрокаТЧ.СуммаНДС;
		СтрокаТЧ.СуммаВсегоПоДокументуРеализации		= СтрокаТЧ.СуммаВсего;
		Документы.КорректировкаРеализации.ТоварыСуммаВсегоПриИзменении(ЭтотОбъект, СтрокаТЧ);
		Документы.КорректировкаРеализации.ТоварыРасчетРазницы(ЭтотОбъект, СтрокаТЧ);
		
	КонецЦикла; 
	
	ПустыеСтроки = Товары.НайтиСтроки(Новый Структура("Количество",0));
	
	Для каждого ПустаяСтрока Из ПустыеСтроки Цикл
		Товары.Удалить(ПустаяСтрока);
	КонецЦикла;
	
	ИдентификаторГосударственногоКонтракта = ?(ЗначениеЗаполнено(ИдентификаторГосударственногоКонтракта),
		ИдентификаторГосударственногоКонтракта,
		ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта);
	
КонецПроцедуры

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Проверим хоз. операции
	// составим список документов движений.
	Если ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон Тогда
		
		// заполним значение до корректировки
		Для Каждого стрТовары Из Товары Цикл
			стрТовары.КоличествоДоКорректировки = стрТовары.КоличествоПоДокументуРеализации;
			стрТовары.СуммаВсегоДоКорректировки = стрТовары.СуммаВсегоПоДокументуРеализации;
			стрТовары.СуммаНДСДоКорректировки   = стрТовары.СуммаНДСПоДокументуРеализации;
		КонецЦикла;
		
	ИначеЕсли ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах Тогда
		
		// проверим введенные на основании корректировки
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПодчиненныеДокументы.Ссылка КАК Документ
		|ИЗ
		|	КритерийОтбора.ПодчиненныеДокументы(&Основание) КАК ПодчиненныеДокументы
		|ГДЕ
		|	ПодчиненныеДокументы.Ссылка ССЫЛКА Документ.КорректировкаРеализации
		|	И НЕ ПодчиненныеДокументы.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон)
		|	И НЕ ПодчиненныеДокументы.Ссылка = &Ссылка";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Основание", ДокументОснование);
		Запрос.УстановитьПараметр("Ссылка",    Ссылка);
		ВыполнениеЗапроса = Запрос.Выполнить();
		
		Если НЕ ВыполнениеЗапроса.Пустой() Тогда
			ТекстСообщения = НСтр("ru = 'К документу %1 введено больше одного корректировочного документа с хоз. операцей ""Исправление первичных документов"". 
								|Каждую последующую корректировку следует вводить на основании предыдущей.'");
			ВывестиСообщение(ТекстСообщения, ЭтотОбъект,,, Отказ, Строка(ДокументОснование));
		КонецЕсли;
		
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	Если НЕ ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииКорректировкаБезОснования Тогда
		РаботаСГраницами.ДвиженияПоВзаиморасчетамПередПроведением(Ссылка, ДополнительныеСвойства);
		РаботаСГраницами.ДвиженияПоЗаказамПередПроведением(Ссылка, ДополнительныеСвойства);
	КонецЕсли;
	РаботаСГраницами.ДвиженияПоПартиямПередПроведением(Ссылка, ДополнительныеСвойства);
	
 	СуммаДокумента = Товары.Итог("СуммаВсего");
	
КонецПроцедуры

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	ШапкаДокумента = ПолучитьШапкуДокумента(Ссылка);
	
	ВедетсяБалансПоПодразделению= БалансВедетсяПоПодразделениям(Дата);
	КорректировкаБезОснования = (ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииКорректировкаБезОснования);
	
	СуммаРазногласий=Товары.Итог("СуммаВсегоРазница");
	
	Если (НЕ КорректировкаБезОснования) И Сделка.ХозОперация <> Справочники.ХозОперации.РеализацияТоваровКомиссия Тогда
		Если СуммаРазногласий<>0 Тогда
			НаборЗаписейВзаиморасчеты=Движения.ВзаиморасчетыКомпании;
			НаборЗаписейВзаиморасчеты.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейВзаиморасчеты.РежимПроведения=РежимПроведения;
			НаборЗаписейВзаиморасчеты.Контрагент=Контрагент;
			НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
			Если ЕстьРеквизит(Сделка,"ДокументОснование") И ЗначениеЗаполнено(Сделка.ДокументОснование) И ТипЗнч(Сделка.ДокументОснование)=Тип("ДокументСсылка.ЗаказПокупателя")
				И ДоговорВзаиморасчетов.СпособЗакрытияСделок=Перечисления.СпособЗакрытияСделок.ПоСчетамИЗаказам Тогда
				НаборЗаписейВзаиморасчеты.Сделка = Сделка.ДокументОснование;
			Иначе
				НаборЗаписейВзаиморасчеты.Сделка = Сделка;
			КонецЕсли;
			НаборЗаписейВзаиморасчеты.АвтоЗакрытиеСделок=Ложь;
			НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц=0;
			НаборЗаписейВзаиморасчеты.СписатьНераспределеннуюСуммуПоСделке=Истина;
			Если СуммаРазногласий > 0 Тогда
				НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Ложь;
				НаборЗаписейВзаиморасчеты.Сумма=СуммаРазногласий;
				Отказ = НЕ НаборЗаписейВзаиморасчеты.Приход() ИЛИ Отказ;
			Иначе
				НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Истина;
				НаборЗаписейВзаиморасчеты.Сумма=-СуммаРазногласий;
				Отказ = НЕ НаборЗаписейВзаиморасчеты.Расход() ИЛИ Отказ;
			КонецЕсли;
			// Доходы и расходы по суммовым разницам
			СуммаДоходаРасходаСуммовыхРазниц=НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
			Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
				НаборЗаписейДиР = Движения.ДоходыИРасходы;
				НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
				// В случае если ведется баланс по подразделению передадим подразделение соответствующее корреспонденции.
				Если ВедетсяБалансПоПодразделению Тогда
					НаборЗаписейДиР.Подразделение  = ДоговорВзаиморасчетов.ПодразделениеКомпании;
				КонецЕсли;
				НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
				НаборЗаписейДиР.ВУпрВалюте = Истина;
				Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
					НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
				Иначе
					НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
				КонецЕсли;
				Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
	// Закрываем заказы покупателя по FIFO
	ТекстЗапроса="
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДокументТовары.КоличествоРазница*ДокументТовары.Коэффициент КАК Количество,
	|	ДокументТовары.Цена КАК ЦенаРозничная,
	|	0 КАК Резерв,
	|	ДокументТовары.СуммаВсегоРазница КАК Сумма
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка=&Ссылка
	|	И ДокументТовары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|	И ДокументТовары.КоличествоРазница > 0
	|";
	Запрос=Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	РезультатЗапросаПоТоварам = Запрос.Выполнить();
	
	Если НЕ КорректировкаБезОснования Тогда



















		// Закрываем заказы
		НаборЗаписейЗаказыПокупателей = Движения.ЗаказыПокупателей;
		НаборЗаписейЗаказыПокупателей.РежимПроведения = РежимПроведения;
		НаборЗаписейЗаказыПокупателей.ДокументОбъект = ЭтотОбъект;
		НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
		НаборЗаписейЗаказыПокупателей.Контрагент = Контрагент;
		НаборЗаписейЗаказыПокупателей.Заказ = Неопределено;
		НаборЗаписейЗаказыПокупателей.СкладКомпании = СкладКомпании;
		НаборЗаписейЗаказыПокупателей.Заказывать = Истина;
		НаборЗаписейЗаказыПокупателей.Резервировать = Истина;
		НаборЗаписейЗаказыПокупателей.ПоБазовомуКоличеству=Истина;
		Отказ=НЕ НаборЗаписейЗаказыПокупателей.ЗакрытиеЗаказовПокупателя() ИЛИ Отказ;
		// Если было списание резервов то таблица товаров содержит списанные резервы.
		РезультатЗапросаПоТоварам=НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам;
		
		// Снимаем распределение заказов покупателя
		РезультатЗакрытияЗаказов=НаборЗаписейЗаказыПокупателей.Выгрузить();
		КолонкаКоличества=РезультатЗакрытияЗаказов.Колонки.Найти("Заказано");
		КолонкаКоличества.Имя="Количество"; КолонкаКоличества.Заголовок="Количество";
		РезультатЗакрытияЗаказов.Свернуть("Заказ,Контрагент,Номенклатура,ХарактеристикаНоменклатуры","Количество,Резерв");
		Для каждого СтрокаЗаказа Из РезультатЗакрытияЗаказов Цикл
			СтрокаЗаказа.Количество=-(СтрокаЗаказа.Количество-СтрокаЗаказа.Резерв);
		КонецЦикла; 
		НаборЗаписейРаспределениеЗаказов = Движения.ЗаказыРаспределение;
		НаборЗаписейРаспределениеЗаказов.РежимПроведения = РежимПроведения;
		НаборЗаписейРаспределениеЗаказов.ДокументОбъект = ЭтотОбъект;
		НаборЗаписейРаспределениеЗаказов.РезультатЗапросаПоТоварам = РезультатЗакрытияЗаказов;
		НаборЗаписейРаспределениеЗаказов.ЗаказПокупателя = "Заказ";
		НаборЗаписейРаспределениеЗаказов.ЗаказПоставщика = Неопределено;
		НаборЗаписейРаспределениеЗаказов.Контрагент = Контрагент;
		НаборЗаписейРаспределениеЗаказов.ПоБазовомуКоличеству=Истина;
		Отказ=НЕ НаборЗаписейРаспределениеЗаказов.КорректировкаРаспределения() ИЛИ Отказ;
	КонецЕсли;
	
	// Проведем остатки товаров (расход)
	НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	НаборЗаписейОстатки.РежимПроведения=РежимПроведения;
	НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам;
	НаборЗаписейОстатки.СкладКомпании=СкладКомпании;
	НаборЗаписейОстатки.Приходовать=Истина;
	НаборЗаписейОстатки.Контрагент=Контрагент;
	НаборЗаписейОстатки.ПоБазовомуКоличеству=Ложь;
	НаборЗаписейОстатки.ДвиженияПоРознице=СкладКомпании.Розничный;
	НаборЗаписейОстатки.ИмяРеквизитаЦенаРозничная="Цена";
	НаборЗаписейОстатки.Резервировать=РезультатЗапросаПоТоварам<>Неопределено;
	Отказ=НЕ НаборЗаписейОстатки.Расход() ИЛИ Отказ;
	Если Отказ Тогда
		Возврат; // Дальше смысла не имеет
	КонецЕсли;
	
	// Проведем остатки товаров (возврат)
	НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейОстатки.СкладКомпании=СкладКомпании;
	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=ПолучитьТаблицуТоваровВозврат();
	НаборЗаписейОстатки.ПоБазовомуКоличеству=Истина;
	НаборЗаписейОстатки.Контрагент=Контрагент;
	НаборЗаписейОстатки.ДвиженияПоРознице=Ложь;
	НаборЗаписейОстатки.РазрешитьПереоценку = Ложь;
	Отказ=НЕ НаборЗаписейОстатки.Приход() ИЛИ Отказ;
	
	// Проведем партии товаров
	Отказ = НЕ ПровестиПоПартиям(РежимПроведения,Ссылка, СуммаРазногласий) ИЛИ Отказ;
	
	Если (НЕ КорректировкаБезОснования) И НЕ Отказ Тогда
		ОбработкаПроведенияНакопленияПоКарточкамКонтрагентов();
	КонецЕсли;
	
	// Двигаем границы
	Если НЕ КорректировкаБезОснования Тогда
		РаботаСГраницами.СдвинутьГраницуВзаиморасчетов(Ссылка, ДополнительныеСвойства, Движения);
		РаботаСГраницами.СдвинутьГраницуЗаказов(Ссылка,  ДополнительныеСвойства, Движения);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли