
#Область СлужебныеПроцедурыИФункции

Функция ОповещениеПослеЗавершенииОбмена(Контекст, ДальнейшееДействие, ОповещениеПриЗавершении = Неопределено, ИдентификаторВладельца = Неопределено) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	ДополнительныеПараметры.Вставить("Контекст",                Контекст);
	ДополнительныеПараметры.Вставить("ДальнейшееДействие",      ДальнейшееДействие);
	ДополнительныеПараметры.Вставить("ИдентификаторВладельца",  ИдентификаторВладельца);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПослеЗавершенияОбмена",
		ЭтотОбъект,
		ДополнительныеПараметры);
	
	Возврат ОписаниеОповещения;
	
КонецФункции

Функция ОбщиеПараметрыОбменаНаКлиенте(Источник) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("НастройкиОбмена",         Неопределено);
	Результат.Вставить("Изменения",               Неопределено);
	Результат.Вставить("ОповещениеПриЗавершении", Неопределено);
	Результат.Вставить("ИдентификаторВладельца",  Неопределено);
	Результат.Вставить("ВОсновнойФорме",          Истина);
	ЗаполнитьЗначенияСвойств(Результат, Источник);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСторокуПодбораПартии() Экспорт
	
	СтруктураПартии = Новый Структура;
	СтруктураПартии.Вставить("Продукция");
	СтруктураПартии.Вставить("Количество");
	СтруктураПартии.Вставить("ЕдиницаИзмерения");
	СтруктураПартии.Вставить("НомерЗаписи");
	СтруктураПартии.Вставить("ИдентификаторСтрокиПартий");
	СтруктураПартии.Вставить("СрокГодности");
	СтруктураПартии.Вставить("ДатаВыработки");
	СтруктураПартии.Вставить("ЭкспертизаРезультат");
	СтруктураПартии.Вставить("СпособХранения");
	СтруктураПартии.Вставить("Списана");
	СтруктураПартии.Вставить("Идентификатор");
	
	Возврат СтруктураПартии;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСторокуПодбораУпаковки() Экспорт
	
	СтруктураУпаковки = Новый Структура;
	СтруктураУпаковки.Вставить("Упаковка");
	СтруктураУпаковки.Вставить("КоличествоУпаковок");
	СтруктураУпаковки.Вставить("УровеньУпаковки");
	СтруктураУпаковки.Вставить("Маркировка");
	СтруктураУпаковки.Вставить("ТипМаркировки");
	СтруктураУпаковки.Вставить("ИдентификаторСтроки");
	
	Возврат СтруктураУпаковки;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ПродукцияФормаСпискаПриАктивизацииСтроки(ФормаСписка, Элемент) Экспорт
	
	// покажем информацию в нижней панели
	Если ФормаСписка.Элементы.ГруппаСтраницыФормы.Видимость Тогда
		
		//ФормаСписка.ТабличноеПроизводители.Очистить();
		
		Если ФормаСписка.Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = ФормаСписка.Элементы.СтраницаПроизводители Тогда
			//
			//Площадка = ФормаСписка.Элементы.Список.ТекущиеДанные.Ссылка;
			//Если ФормаСписка.ТабличноеПроизводители.Отбор.Элементы.Количество() = 0 Тогда
			//	ЭлементОтбора = ФормаСписка.ТабличноеПроизводители.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
			//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			//	ЭлементОтбора.Использование = Истина;
			//	ЭлементОтбора.ПравоеЗначение = Площадка;
			//Иначе
			//	ЭлементОтбора = ФормаСписка.ТабличноеПроизводители.Отбор.Элементы.Получить(0);
			//	ЭлементОтбора.ПравоеЗначение = Площадка;
			//КонецЕсли;
			//ИнтеграцияВЕТИСКлиентСервер.ПолучитьСписокПроизводителей(Площадка);
						
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура МеркурийПредприятиеПолучательНачалоВыбора(ФормаДокумента, ХозяйствующийСубъект, Предприятие, Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = Новый Структура;
	НачальноеЗначениеВыбора = Новый Структура("ТекущийЭлемент, ХозяйствующийСубъект", Предприятие, ХозяйствующийСубъект);
	ПараметрыОткрытия.Вставить("НачальноеЗначениеВыбора", НачальноеЗначениеВыбора);
	ОткрытьФорму("Справочник.ПредприятияВЕТИС.ФормаВыбора", ПараметрыОткрытия, Элемент);
	
КонецПроцедуры

Процедура ВыполнитьОбмен(Форма, ХозяйствующиеСубъекты = Неопределено, ОповещениеПриЗавершении = Неопределено) Экспорт
	
	ИдентификаторВладельца = Форма.УникальныйИдентификатор;
	
	ОчиститьСообщения();
	
	РезультатОбмена = ИнтеграцияВЕТИСВызовСервера.ВыполнитьОбмен(ХозяйствующиеСубъекты,, ИдентификаторВладельца);
	
	ОбработатьРезультатОбмена(РезультатОбмена, Форма,, ОповещениеПриЗавершении);
	
	//ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении", ОповещениеПослеЗавершенииОбмена(Неопределено, Неопределено, ОповещениеПриЗавершении, ИдентификаторВладельца));
	//ДополнительныеПараметры.Вставить("НастройкаПодключения",    ДанныеДляВыполненияОбменаНаКлиенте.НастройкаПодключения);
	//Если ИдентификаторВладельца = Истина Тогда
	//	ДополнительныеПараметры.Вставить("ИдентификаторВладельца",  Неопределено);
	//	ДополнительныеПараметры.Вставить("ВОсновнойФорме",          Истина);
	//Иначе
	//	ДополнительныеПараметры.Вставить("ИдентификаторВладельца",  ИдентификаторВладельца);
	//	ДополнительныеПараметры.Вставить("ВОсновнойФорме",          ДанныеДляВыполненияОбменаНаКлиенте.Свойство("ВОсновнойФорме"));
	//КонецЕсли;
	//
	//ОбработатьОчередьПередачиДанных(
	//	Новый ОписаниеОповещения(
	//		"ПослеОбработкиОчередиПередачиДанных",
	//		ЭтотОбъект,
	//		ДополнительныеПараметры),
	//	ДанныеДляВыполненияОбменаНаКлиенте);
	
КонецПроцедуры

Процедура ПродолжитьВыполнениеОбмена(Форма, Контекст = Неопределено, ОповещениеПриЗавершении = Неопределено, ВыводитьОкноОжидания = Истина, ОповещениеОПрогрессеВыполнения = Неопределено) Экспорт
	
	РезультатОбмена = ИнтеграцияВЕТИСВызовСервера.ПродолжитьВыполнениеОбмена(Форма.АдресРезультатаОбмена);
	
	ОбработатьРезультатОбмена(РезультатОбмена, Форма, Контекст, ОповещениеПриЗавершении, ВыводитьОкноОжидания, ОповещениеОПрогрессеВыполнения);
	
КонецПроцедуры

Процедура ОбработатьРезультатОбмена(РезультатОбмена, Форма, Контекст = Неопределено, ОповещениеПриЗавершении = Неопределено, ВыводитьОкноОжидания = Истина, ОповещениеОПрогрессеВыполнения=Неопределено) Экспорт
	
	Если РезультатОбмена.ДлительнаяОперация <> Неопределено Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
		ПараметрыОжидания.ТекстСообщения             = НСтр("ru='Выполняется обмен с ВетИС'");
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания       = ВыводитьОкноОжидания;
		ПараметрыОжидания.ВыводитьСообщения          = Истина;
		ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессеВыполнения;
		
		Если РезультатОбмена.Ожидать <> Неопределено Тогда
			ПараметрыОжидания.Интервал = РезультатОбмена.Ожидать;
		КонецЕсли;
		
		ПараметрыЗавершенияДлительнойОперации = Новый Структура;
		ПараметрыЗавершенияДлительнойОперации.Вставить("Форма", Форма);
		ПараметрыЗавершенияДлительнойОперации.Вставить("Контекст", Контекст);
		ПараметрыЗавершенияДлительнойОперации.Вставить("ОповещениеПриЗавершении",        ОповещениеПриЗавершении);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			РезультатОбмена.ДлительнаяОперация,
			Новый ОписаниеОповещения("ПослеЗавершенияДлительнойОперации", ЭтотОбъект, ПараметрыЗавершенияДлительнойОперации),
			ПараметрыОжидания);
		
	Иначе
		
		Если РезультатОбмена.Ожидать <> Неопределено Тогда
			
			Форма.АдресРезультатаОбмена = РезультатОбмена.АдресВоВременномХранилище;
			Форма.ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьОбменОбработкаОжидания", РезультатОбмена.Ожидать, Истина);
			
		Иначе
			
			ПараметрыЗавершения = Новый Структура;
			ПараметрыЗавершения.Вставить("Контекст", Контекст);
			ПараметрыЗавершения.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
			
			ПослеЗавершенияОбмена(
				РезультатОбмена.Изменения,
				ПараметрыЗавершения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Только для внутреннего использования.
// Вызывается из: ОповещениеПослеЗавершенииОбмена
Процедура ПослеЗавершенияОбмена(Изменения, ДополнительныеПараметры) Экспорт
	
	СоответствиеДокументыОснования        = Новый Соответствие;
	СоответствиеДокументыСтатусы          = Новый Соответствие;
	СоответствиеИзмененныеДокументы       = Новый Соответствие;
	СоответствиеОшибкиСервисаПоДокументам = Новый Соответствие;
	
	ПараметрыСостоянияОбмена = Новый Структура;
	ПараметрыСостоянияОбмена.Вставить("ИзмененныеВСД",                     Новый Массив);
	ПараметрыСостоянияОбмена.Вставить("ИзмененныеЗаписиСкладскогоЖурнала", Новый Массив);
	ПараметрыСостоянияОбмена.Вставить("ЕстьОшибкиСервисаПриПолученииСписковВСД" ,                     Ложь);
	ПараметрыСостоянияОбмена.Вставить("ЕстьОшибкиСервисаПриПолученииСписковЗаписейСкладскогоЖурнала", Ложь);
	ПараметрыСостоянияОбмена.Вставить("ЕстьОшибкиСервисаПриОформленииДокументов",                     Ложь);
	ПараметрыСостоянияОбмена.Вставить("Документ");
	ПараметрыСостоянияОбмена.Вставить("ДокументТекстОшибки");
	
	Если ДополнительныеПараметры.Свойство("ОрганизацииВЕТИС") Тогда
		ПараметрыСостоянияОбмена.Вставить("ОрганизацииВЕТИС", ДополнительныеПараметры.ОрганизацииВЕТИС);
	КонецЕсли;
	
	ОбновитьСписокЗаписейСкладскогоЖурнала = Ложь;
	ОбновитьСписокВСД                      = Ложь;
	
	Для Каждого ЭлементДанных Из Изменения Цикл
		
		Если ЗначениеЗаполнено(ЭлементДанных.ТекстОшибки) Тогда
			
			Если ДополнительныеПараметры.ОповещениеПриЗавершении = Неопределено Тогда
				
				Если ЭлементДанных.ЕстьОшибкиСервиса
					И (ЭлементДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ОтветНаЗапросЗаписейСкладскогоЖурнала")
					Или ЭлементДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененныхЗаписейСкладскогоЖурнала")) Тогда
					ПараметрыСостоянияОбмена.ЕстьОшибкиСервисаПриПолученииСписковЗаписейСкладскогоЖурнала = Истина;
				ИначеЕсли ЭлементДанных.ЕстьОшибкиСервиса
					И (ЭлементДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ОтветНаЗапросВсехВСД")
					Или ЭлементДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененныхВСД")) Тогда
					ПараметрыСостоянияОбмена.ЕстьОшибкиСервисаПриПолученииСписковВСД = Истина;
				ИначеЕсли ЭлементДанных.ЕстьОшибкиСервиса Тогда
					Если ЭлементДанных.ДокументОснование <> Неопределено Тогда
						СоответствиеОшибкиСервисаПоДокументам.Вставить(ЭлементДанных.ДокументОснование, ЭлементДанных.ТекстОшибки);
					ИначеЕсли ЭлементДанных.Объект <> Неопределено Тогда
						СоответствиеОшибкиСервисаПоДокументам.Вставить(ЭлементДанных.Объект, ЭлементДанных.ТекстОшибки);
					КонецЕсли;
					ПараметрыСостоянияОбмена.ЕстьОшибкиСервисаПриОформленииДокументов = Истина;
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ЭлементДанных.ТекстОшибки);
				КонецЕсли;
				
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ЭлементДанных.ТекстОшибки);
				//СообщитьПользователюБезДублированияВФорму(ДополнительныеПараметры, ЭлементДанных.ТекстОшибки);
			КонецЕсли;
			
		Иначе
			
			Если (Не ОбновитьСписокЗаписейСкладскогоЖурнала Или Не ОбновитьСписокВСД)
				И (ЭлементДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ОтветНаЗапросОформленияВходящейПартии")
				Или ЭлементДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ОтветНаЗапросОформленияПроизводственнойПартии")
				Или ЭлементДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ОтветНаЗапросОформленияТранспортнойПартии")) Тогда
				
				ОбновитьСписокЗаписейСкладскогоЖурнала = Истина;
				ОбновитьСписокВСД                      = Истина;
				
			КонецЕсли;
			
			Если Не ОбновитьСписокЗаписейСкладскогоЖурнала
				И (ЭлементДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ОтветНаЗапросЗаписиСкладскогоЖурнала")
				Или ЭлементДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ОтветНаЗапросЗаписейСкладскогоЖурнала")
				Или ЭлементДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененныхЗаписейСкладскогоЖурнала")
				Или ЭлементДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ОтветНаЗапросОбъединенияЗаписейСкладскогоЖурнала")
				Или ЭлементДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ОтветНаЗапросОформленияРезультатовИнвентаризации")) Тогда
				
				ОбновитьСписокЗаписейСкладскогоЖурнала = Истина;
				
				Если ТипЗнч(ЭлементДанных.Объект) = Тип("Массив") Тогда
					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
						ПараметрыСостоянияОбмена.ИзмененныеЗаписиСкладскогоЖурнала, ЭлементДанных.Объект);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЭлементДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ОтветНаЗапросВСД")
				Или ЭлементДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ОтветНаЗапросВсехВСД")
				Или ЭлементДанных.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийВЕТИС.ОтветНаЗапросИзмененныхВСД") Тогда
				
				ОбновитьСписокВСД = Истина;
				
				Если ТипЗнч(ЭлементДанных.Объект) = Тип("Массив") Тогда
					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
						ПараметрыСостоянияОбмена.ИзмененныеВСД, ЭлементДанных.Объект);
				ИначеЕсли ТипЗнч(ЭлементДанных.Объект) = Тип("ДокументСсылка.ВСДВЕТИС") Тогда
					ПараметрыСостоянияОбмена.ИзмененныеВСД.Добавить(ЭлементДанных.Объект);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СоответствиеДокументыСтатусы.Вставить(ЭлементДанных.Объект, ЭлементДанных.НовыйСтатус);
		Если ЭлементДанных.ОбъектИзменен Тогда
			СоответствиеИзмененныеДокументы.Вставить(ЭлементДанных.Объект, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	Если СоответствиеОшибкиСервисаПоДокументам.Количество() = 1 Тогда
		Для Каждого КлючИЗначение Из СоответствиеОшибкиСервисаПоДокументам Цикл
			ПараметрыСостоянияОбмена.Документ            = КлючИЗначение.Ключ;
			ПараметрыСостоянияОбмена.ДокументТекстОшибки = КлючИЗначение.Значение;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из СоответствиеДокументыОснования Цикл
		
		ОбъектИзменен = СоответствиеИзмененныеДокументы.Получить(КлючИЗначение.Ключ);
		Если ОбъектИзменен = Неопределено Тогда
			ОбъектИзменен = Ложь;
		КонецЕсли;
		
		ПараметрОповещения = Новый Структура;
		ПараметрОповещения.Вставить("Ссылка",        КлючИЗначение.Ключ);
		ПараметрОповещения.Вставить("Основание",     КлючИЗначение.Значение);
		ПараметрОповещения.Вставить("ОбъектИзменен", ОбъектИзменен);
		
		//Оповестить(ИнтеграцияИСКлиентСервер.ИмяСобытияИзмененоСостояние(ИнтеграцияВЕТИСКлиентСервер.ИмяПодсистемы()), ПараметрОповещения);
		
	КонецЦикла;
	
	Если ОбновитьСписокВСД Тогда
		Оповестить("ОбновитьСписок_ВетеринарноСопроводительныйДокументВЕТИС");
	КонецЕсли;
	Если ОбновитьСписокЗаписейСкладскогоЖурнала Тогда
		Оповестить("ОбновитьСписок_ЗаписиСкладскогоЖурналаВЕТИС");
		Оповестить("ОбновитьСписок_ОстаткиПродукцииВЕТИС");
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры.Контекст) = Тип("ТаблицаФормы") Тогда
		
		// Выполнено действие из динамического списка
		ТекстСообщения = СтрШаблон(
			НСтр("ru='Для %1 из %2 выделенных в списке документов выполнено действие: %3'"),
			СоответствиеДокументыСтатусы.Количество(),
			ДополнительныеПараметры.Контекст.ВыделенныеСтроки.Количество(),
			ДополнительныеПараметры.ДальнейшееДействие);
			
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Выполнено действие'"),,
			ТекстСообщения,
			БиблиотекаКартинок.Информация32);
		
	ИначеЕсли ЗначениеЗаполнено(ДополнительныеПараметры.Контекст) Тогда
		
		// Выполнено действие из формы документа
		Для Каждого КлючИЗначение Из СоответствиеДокументыСтатусы Цикл
			
			Если КлючИЗначение.Значение = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru='Для документа %1 изменен статус ВетИС: %2.'"),
				КлючИЗначение.Ключ,
				КлючИЗначение.Значение);
			
			ПоказатьОповещениеПользователя(
				НСтр("ru = 'Выполнено действие'"),
				ПолучитьНавигационнуюСсылку(КлючИЗначение.Ключ),
				ТекстСообщения,
				БиблиотекаКартинок.Информация32);
			
		КонецЦикла;
		
	Иначе
		
		// Выполнен обмен с ВЕТИС
		ДополнительныеПараметрыОповещения = Новый Структура;
		ДополнительныеПараметрыОповещения.Вставить("СоответствиеДокументыОснования", СоответствиеДокументыОснования);
		ДополнительныеПараметрыОповещения.Вставить("СоответствиеДокументыСтатусы",   СоответствиеДокументыСтатусы);
		ДополнительныеПараметрыОповещения.Вставить("Изменения",                      Изменения);
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Изменено объектов: %1'"), СоответствиеДокументыСтатусы.Количество());
		
		ПоказатьОповещениеПользователя(
			НСтр("ru='Выполнен обмен с ВетИС'"),
			Новый ОписаниеОповещения("ОткрытьРезультатВыполненияОбмена", ЭтотОбъект, ДополнительныеПараметрыОповещения),
			ТекстСообщения,
			БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, Изменения);
	ИначеЕсли ПараметрыСостоянияОбмена.ЕстьОшибкиСервисаПриПолученииСписковВСД
		Или ПараметрыСостоянияОбмена.ЕстьОшибкиСервисаПриПолученииСписковЗаписейСкладскогоЖурнала
		Или ПараметрыСостоянияОбмена.ЕстьОшибкиСервисаПриОформленииДокументов Тогда
		
		ВладелецФормы = Неопределено;
		Если ДополнительныеПараметры <> Неопределено
			И ДополнительныеПараметры.Свойство("Форма") Тогда
			ВладелецФормы = ДополнительныеПараметры.Форма;
		КонецЕсли;
		
		ОткрытьФорму(
			"Обработка.ПанельОбменВЕТИС.Форма.СостоянияОбмена", ПараметрыСостоянияОбмена, ВладелецФормы);
		
	КонецЕсли;
	
КонецПроцедуры

// Только для внутреннего использования.
// Вызывается из: ОповещениеПослеЗавершенииОбмена
Процедура ПослеЗавершенияДлительнойОперации(Результат, ДополнительныеПараметрыДлительнойОперации) Экспорт
	
	Если Результат = Неопределено Тогда // отменено пользователем
		Возврат;
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		Для каждого СообщениеПользователю Из Результат.Сообщения Цикл
			СообщениеПользователю.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатОбмена = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Форма                   = ДополнительныеПараметрыДлительнойОперации.Форма;
		ОповещениеПриЗавершении = ДополнительныеПараметрыДлительнойОперации.ОповещениеПриЗавершении;
		
		Если РезультатОбмена.Ожидать <> Неопределено Тогда
			
			Форма.АдресРезультатаОбмена = РезультатОбмена.АдресВоВременномХранилище;
			Форма.ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьОбменОбработкаОжидания", РезультатОбмена.Ожидать, Истина);
			
		Иначе
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Форма",                   Форма);
			ДополнительныеПараметры.Вставить("Контекст",                Неопределено);
			ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ОрганизацииВЕТИС") Тогда
				ДополнительныеПараметры.Вставить("ОрганизацииВЕТИС", Форма.ОрганизацииВЕТИС);
			Иначе
				ДополнительныеПараметры.Вставить("ОрганизацииВЕТИС", Неопределено);
			КонецЕсли;
			
			ПослеЗавершенияОбмена(
				РезультатОбмена.Изменения,
				ДополнительныеПараметры);
			
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ГлобальныеОбработчикиОбмена

Процедура ОткрытьРезультатВыполненияОбмена(ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Изменения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.МодульОбменаВЕТИС.Форма.РезультатВыполненияОбмена", ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьОчередьПередачиДанных(ОповещениеПриЗавершении, ДанныеДляВыполненияОбменаНаКлиенте) Экспорт
	
	СообщенияXMLКПередаче = ДанныеДляВыполненияОбменаНаКлиенте.СообщенияXMLКПередаче;
	
	ИдетОбменСВЕТИС = ПараметрыПриложения["ВЕТИС.ДанныеСеансаОбмена"];
	Если ИдетОбменСВЕТИС <> Неопределено Тогда 
		Для Каждого ЭлементСообщение Из СообщенияXMLКПередаче Цикл 
			ДанныеДляВыполненияОбменаНаКлиенте.Изменения.Добавить(ЭлементСообщение);
		КонецЦикла;
		СообщенияXMLКПередаче.Очистить();
	КонецЕсли;
	
	Если СообщенияXMLКПередаче.Количество() > 0 Тогда
		
		ДополнительныеПараметры = ОбщиеПараметрыОбменаНаКлиенте(ДанныеДляВыполненияОбменаНаКлиенте);
		ДополнительныеПараметры.ОповещениеПриЗавершении = ОповещениеПриЗавершении;
		ДополнительныеПараметры.ВОсновнойФорме          = ДанныеДляВыполненияОбменаНаКлиенте.Свойство("ВОсновнойФорме");
		ДополнительныеПараметры.Вставить("РезультатыПередачиСообщенийПоОрганизациямВЕТИС", Новый Соответствие);
		
		//ПередатьСообщения(СообщенияXMLКПередаче, ДополнительныеПараметры);
		
	Иначе
		
		Если ОповещениеПриЗавершении <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, ДанныеДляВыполненияОбменаНаКлиенте.Изменения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьСписокВходящихДокументов(ДанныеОбработкиТекстОшибки, Контекст) Экспорт
	
	ДополнительныеПараметры = ОбщиеПараметрыОбменаНаКлиенте(Контекст);
	ДополнительныеПараметры.Вставить("ДокументыКЗагрузке", Новый Соответствие);
	
	//ПолучитьСообщения(ДанныеОбработкиТекстОшибки.ДанныеОбработки, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ПослеОбработкиОчередиПередачиДанных(Изменения, Контекст) Экспорт
	
	ПараметрыОбработкиСпискаВходящихДокументов = ОбщиеПараметрыОбменаНаКлиенте(Контекст);
	ПараметрыОбработкиСпискаВходящихДокументов.Изменения = Изменения;
	
	ОповещениеПриЗавершенииПолученияСпискаВходящихДокументов = Новый ОписаниеОповещения(
		"ОбработатьСписокВходящихДокументов",
		ЭтотОбъект,
		ПараметрыОбработкиСпискаВходящихДокументов);
	
	ДополнительныеПараметры = ОбщиеПараметрыОбменаНаКлиенте(Контекст);
	ДополнительныеПараметры.Изменения = Изменения;
	ДополнительныеПараметры.ОповещениеПриЗавершении = ОповещениеПриЗавершенииПолученияСпискаВходящихДокументов;
	ДополнительныеПараметры.Вставить("Результат",   Новый Соответствие);
	ДополнительныеПараметры.Вставить("ТекстОшибки", "");
	
	ТранспортныеМодули = ИнтеграцияВЕТИСКлиентСервер.ПолучитьТранспортныеМодулиИзНастроек(Контекст.НастройкаПодключения);
	
	ПолучитьСпискиВходящихСообщений(ТранспортныеМодули, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаСписковДокументов

Процедура ПолучитьСпискиВходящихСообщений(ТранспортныеМодули, Контекст) Экспорт
	
	//Если ОбменУжеЗапущен(Контекст) Тогда
	//	Возврат;
	//КонецЕсли;
	
	//ПараметрыПриложения.Вставить("ЕГАИС.ДанныеСеансаОбмена", 
	//	СохраняемыеДанныеОбмена(
	//		ТранспортныеМодули,
	//		Контекст,
	//		Новый ОписаниеОповещения("ПолучитьДокументыПоОчереднойОрганизацииИзОчередиОбмена", ЭтотОбъект),
	//		Новый ОписаниеОповещения("ПослеПолученияСписковСообщений", ЭтотОбъект)));
	//ПодключитьОбработчикОжидания("ОбработчикОжиданияОбменаОчереднойПорциейДанныхЕГАИС", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбменНаКлиентеПоРасписанию

// Подключает обработчик ожидания для выполнения обмена с ВЕТИС на клиенте по расписанию.
//
Процедура ПодключитьОбработчикВыполненияОбменаНаКлиентеПоРасписанию() Экспорт
	
	ОтключитьОбработчикОжидания("ОбработчикОжиданияВыполненияОбменаНаКлиентеПоРасписанию");
	
	Если Не ИнтеграцияВЕТИСВызовСервера.ДоступноВыполнениеОбменаНаКлиентеПоРасписанию() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияВыполненияОбменаНаКлиентеПоРасписанию", 60, Ложь);
	
КонецПроцедуры

// Получает даты последнего запуска процедуры обмена на клиенте по расписанию.
// 
// Возвращаемое значение:
//  Соответствие - Даты последнего запуска по кодам ФСРАР.
//
Функция ПолучитьДатыПоследнегоЗапускаОбменаНаКлиентеПоРасписанию()
	
	ИмяПараметра = "ИнтеграцияВЕТИС.ДатаПоследнейОбработкиОтветов";
	Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
		ПараметрыПриложения.Вставить(ИмяПараметра, Новый Соответствие);
	КонецЕсли;
	
	Возврат ПараметрыПриложения[ИмяПараметра];
	
КонецФункции

// Установить дату последнего запуска обмена на клиенте по расписанию.
//
// Параметры:
//  ХозяйствующийСубъект - СправочникСсылка.ХозяйствующиеСубъектыВЕТИС - Транспортный модуль ВЕТИС.
//
Процедура ОбновитьДатуПоследнегоЗапускаОбменаНаКлиентеПоРасписанию(ХозяйствующийСубъект) Экспорт
	
	ДатыПоследнегоЗапуска = ПолучитьДатыПоследнегоЗапускаОбменаНаКлиентеПоРасписанию();
	ДатыПоследнегоЗапуска.Вставить(ХозяйствующийСубъект, ОбщегоНазначенияКлиент.ДатаСеанса());
	
	ИмяПараметра = "ИнтеграцияВЕТИС.ДатаПоследнейОбработкиОтветов";
	ПараметрыПриложения.Вставить(ИмяПараметра, ДатыПоследнегоЗапуска);
	
КонецПроцедуры

// Проверяет возможность и при необходимости выполняет обработку ответов из ВЕТИС.
//
Процедура ВыполнитьОбменНаКлиентеПоРасписанию() Экспорт
	
	ДанныеДляВыполненияОбменаНаКлиенте = ИнтеграцияВЕТИСВызовСервера.ВыполнитьОбмен(
		Неопределено,
		ПолучитьДатыПоследнегоЗапускаОбменаНаКлиентеПоРасписанию());
	
	Если Не ДанныеДляВыполненияОбменаНаКлиенте.ВыполнитьОбменПоРасписанию Тогда
		Возврат;
	КонецЕсли;
	ДанныеДляВыполненияОбменаНаКлиенте.Вставить("ВОсновнойФорме", Истина);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении", ОповещениеПослеЗавершенииОбмена(Неопределено, Неопределено, Неопределено));
	ДополнительныеПараметры.Вставить("НастройкаПодключения",    ДанныеДляВыполненияОбменаНаКлиенте.НастройкаПодключения);
	ДополнительныеПараметры.Вставить("ВОсновнойФорме",          Истина);
	
	//ОбработатьОчередьПередачиДанных(
	//	Новый ОписаниеОповещения(
	//		"ПослеОбработкиОчередиПередачиДанных",
	//		ЭтотОбъект,
	//		ДополнительныеПараметры),
	//	ДанныеДляВыполненияОбменаНаКлиенте);
	
КонецПроцедуры

Процедура ОбработатьОчереднуюПорциюДанных() Экспорт
	
	ВыполнитьОбработкуОповещения(ПараметрыПриложения["ВЕТИС.ДанныеСеансаОбмена"].ОбработчикОповещения);
	
КонецПроцедуры

#КонецОбласти

