// Модуль основной формы документа "Назначение скидок строки"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьДеревоПодразделений()
	
	УправлениеДиалогомСервер.ЗаполнитьДеревоПодразделений(ЭтотОбъект, Объект);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

&НаКлиенте
Процедура ОбработатьОтветНаВопросПересчетаУценки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ЗакрытьБезПроверки = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если ПравилоПроверкиУценки = ПредопределенноеЗначение("Перечисление.ПравилоПроверкиУценкиПоСпособуВычисления.НеПроверять") Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеИсключения = Неопределено;
	Если ПравилоПроверкиУценки = ПредопределенноеЗначение("Перечисление.ПравилоПроверкиУценкиПоСпособуВычисления.ПроверятьФиксированнуюУценку") Тогда
		ЗначениеИсключения = ПредопределенноеЗначение("Перечисление.СкидкиСпособВычисления.Относительная");
	ИначеЕсли ПравилоПроверкиУценки = ПредопределенноеЗначение("Перечисления.ПравилоПроверкиУценкиПоСпособуВычисления.ПроверятьОтносительнуюУценку") Тогда
		ЗначениеИсключения = ПредопределенноеЗначение("Перечисление.СкидкиСпособВычисления.ФиксированнаяЦена");
	КонецЕсли;
	
	ФиксированнаяЦена = ПредопределенноеЗначение("Перечисление.СкидкиСпособВычисления.ФиксированнаяЦена");
	Для Каждого ТекущаяСтрока Из Объект.Скидки Цикл
		
		Если ТекущаяСтрока.СпособВычисления = ЗначениеИсключения Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекущаяСтрока.ЗапретРедактированияЦены Тогда
			Продолжить;
		КонецЕсли;
		Если ТекущаяСтрока.ЦенаЛимита<=ТекущаяСтрока.ИтоговаяЦена Тогда
			Продолжить;
		КонецЕсли;
		ТекущаяСтрока.ИтоговаяЦена = ТекущаяСтрока.ЦенаЛимита;
		Если ТекущаяСтрока.СпособВычисления = ФиксированнаяЦена Тогда
			ТекущаяСтрока.ЗначениеСкидки = ТекущаяСтрока.ЦенаЛимита;
		ИначеЕсли ТекущаяСтрока.ЦенаРозничная = 0 Тогда
			ТекущаяСтрока.ЗначениеСкидки = 0
		Иначе
			ТекущаяСтрока.ЗначениеСкидки = ((ТекущаяСтрока.ЦенаРозничная-ТекущаяСтрока.ЦенаЛимита)/ТекущаяСтрока.ЦенаРозничная)*100;
		КонецЕсли;
	КонецЦикла;
	
	ЗакрытьБезПроверки = Истина;
	
КонецПроцедуры

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
	ВидыНоменклатуры = Справочники.ХозОперации.ПолучитьВидыНоменклатуры(Объект.ХозОперация);
	Если Не Элементы.Найти("СкидкиНоменклатура")=Неопределено Тогда
		УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.СкидкиНоменклатура.ПараметрыВыбора, "Отбор.ВидНоменклатуры", ВидыНоменклатуры);
	КонецЕсли;
	
	// Заполним правило вычисления уценки
	ПравилоПроверкиУценки = ПолучитьЗначениеУчетнойПолитики("ПравилоПроверкиУценкиПоСпособуВычисления", Объект.ПодразделениеКомпании);
	
	СписокВыбора = Элементы.СкидкиЗначениеСкидки.СписокВыбора;
	СписокВыбора.Очистить();
	
	//Заполним массив скидок на выбор для табличной части значение скидки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипыСкидокЗначенияСкидок.ЗначениеСкидки КАК ЗначениеСкидки
	|ИЗ
	|	Справочник.ТипыСкидок.ЗначенияСкидок КАК ТипыСкидокЗначенияСкидок
	|ГДЕ
	|	ТипыСкидокЗначенияСкидок.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Справочники.ТипыСкидок.СкидкаНаШтрихкодТовара);
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из Выборка Цикл
		СписокВыбора.Добавить(ТекСтрока.ЗначениеСкидки);
	КонецЦикла;
	
	Элементы.СкидкиЗначениеСкидки.РежимВыбораИзСписка = (СписокВыбора.Количество()>0);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	//УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОбработчикаКоманды = ПолучитьЗначениеПараметраСтруктуры(РезультатОповещения, "ИмяОбработчикаКоманды", "");
	Если ИмяОбработчикаКоманды = "ПодразделенияОчиститьТабличнуюЧасть" Тогда
		УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивно(ДеревоПодразделений.ПолучитьЭлементы(), Ложь, Объект.Подразделения);
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.УценкаТовара.ДатаПриИзменении(Объект);
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.УценкаТовара.ХозОперацияПриИзменении(Объект);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзменении()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "СКИДКИ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкидкиНоменклатураПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.УценкаТовара.СкидкиНоменклатураПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	// Вызываем общий обработчик изменения реквизитов формы
	УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(ЭтотОбъект, ТекущиеДанные, ПараметрыДействия);

КонецПроцедуры // СкидкиНоменклатураПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиНоменклатураПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СкидкиНоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры // СкидкиНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Значение скидки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкидкиЦенаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.УценкаТовара.СкидкиЗначениеСкидкиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);

КонецПроцедуры // СкидкиЦенаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Значение скидки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиЦенаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СкидкиЦенаПриИзмененииНаСервере();

КонецПроцедуры // СкидкиЗначениеСкидкиПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Значение скидки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкидкиЗначениеСкидкиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.УценкаТовара.СкидкиЗначениеСкидкиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);

КонецПроцедуры // СкидкиЗначениеСкидкиПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Значение скидки".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиЗначениеСкидкиПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СкидкиЗначениеСкидкиПриИзмененииНаСервере();

КонецПроцедуры // СкидкиЗначениеСкидкиПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Вариант округления" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкидкиВариантОкругленияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.УценкаТовара.СкидкиВариантОкругленияПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);

КонецПроцедуры // СкидкиВариантОкругленияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Вариант округления".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиВариантОкругленияПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СкидкиВариантОкругленияПриИзмененииНаСервере();

КонецПроцедуры // СкидкиВариантОкругленияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "СкладКомпании" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкидкиСкладКомпанииПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.УценкаТовара.СкидкиСкладКомпанииПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // СкидкиСкладКомпанииПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "СкладКомпании".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиСкладКомпанииПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СкидкиСкладКомпанииПриИзмененииНаСервере();
	
КонецПроцедуры // СкидкиСкладКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Способ Вычисления" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкидкиСпособВычисленияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.УценкаТовара.СкидкиСпособВычисленияПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // СкидкиСпособВычисленияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Способ Вычисления".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиСпособВычисленияПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СкидкиСпособВычисленияПриИзмененииНаСервере();

КонецПроцедуры // СкидкиСпособВычисленияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкидкиКоличествоПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Скидки.НайтиПоИдентификатору(Элементы.Скидки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.УценкаТовара.СкидкиКоличествоПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);

КонецПроцедуры // СкидкиКоличествоПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиКоличествоПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СкидкиСпособВычисленияПриИзмененииНаСервере();

КонецПроцедуры // СкидкиКоличествоПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "СКИДКИ"

// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//
&НаКлиенте
Процедура СкидкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
	Если Копирование Тогда
		Элемент.ТекущиеДанные.ИдентификаторСкидки = 0;
	КонецЕсли;
	
КонецПроцедуры // СкидкиПередНачаломДобавления()

// Обработчик события возникающего на клиенте перед началом интерактивного изменения строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура СкидкиПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередНачаломИзменения()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура СкидкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПриОкончанииРедактирования(ЭтотОбъект, Элемент, НоваяСтрока, ОтменаРедактирования, "Скидки");
	
КонецПроцедуры // СкидкиПриОкончанииРедактирования()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура СкидкиПередУдалением(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередУдалением(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // СкидкиПередУдалением()

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
&НаСервере
Процедура СкидкиПослеУдаленияНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ТоварыПослеУдаления(ЭтотОбъект, Элементы.Скидки, ПараметрыДействия);
	
КонецПроцедуры // СкидкиПослеУдаленияНаСервере()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкидкиПослеУдаления(Элемент)
	
	// Обработаем событие в контексте сервера
	СкидкиПослеУдаленияНаСервере();
	
КонецПроцедуры // СкидкиПослеУдаления()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                        - Строка таблицы, над которой находится курсор.
//  Поле                          - Элемент управляемой формы, с которым связана данная колонка таблицы.
//
&НаКлиенте
Процедура СкидкиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // СкидкиПроверкаПеретаскивания()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновить колонку владельцев единиц измерения
	ЗащищенныеФункцииСервер.ЗаполнитьСлужебныеРеквизитыТабличнойЧасти(Объект.Скидки);
	
	Документы.УценкаТовара.ЗаполнитьРеквизитыЦен(Объект);
	Документы.УценкаТовара.ЗаполнитьИтоговыеЦены(Объект);
	
	ЗаполнитьДеревоПодразделений();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	УправлениеДиалогомКлиент.ДеревоПодразделенийРазвернутьТолькоПомеченныеУровни(Элементы.ДеревоПодразделений, ДеревоПодразделений.ПолучитьЭлементы());
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	Если НЕ ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия.Вставить("ИмяТаблицы", "Скидки");
	КонецЕсли;
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновить колонку владельцев единиц измерения
	ЗащищенныеФункцииСервер.ЗаполнитьСлужебныеРеквизитыТабличнойЧасти(Объект.Скидки);
	
	Документы.УценкаТовара.ЗаполнитьРеквизитыЦен(Объект);
	Документы.УценкаТовара.ЗаполнитьИтоговыеЦены(Объект);
	
	ЗаполнитьДеревоПодразделений();
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ДокументЦентральногоОфиса Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗакрытьБезПроверки Тогда
		Возврат;
	КонецЕсли;
	
	Если ПравилоПроверкиУценки = ПредопределенноеЗначение("Перечисление.ПравилоПроверкиУценкиПоСпособуВычисления.НеПроверять") Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеИсключения = Неопределено;
	Если ПравилоПроверкиУценки = ПредопределенноеЗначение("Перечисление.ПравилоПроверкиУценкиПоСпособуВычисления.ПроверятьФиксированнуюУценку") Тогда
		ЗначениеИсключения = ПредопределенноеЗначение("Перечисление.СкидкиСпособВычисления.Относительная");
	ИначеЕсли ПравилоПроверкиУценки = ПредопределенноеЗначение("Перечисления.ПравилоПроверкиУценкиПоСпособуВычисления.ПроверятьОтносительнуюУценку") Тогда
		ЗначениеИсключения = ПредопределенноеЗначение("Перечисление.СкидкиСпособВычисления.ФиксированнаяЦена");
	КонецЕсли;
	
	ЗадатьВопросПересчета = Ложь;
	Для Каждого ТекущаяСтрока Из Объект.Скидки Цикл
		Если ТекущаяСтрока.СпособВычисления = ЗначениеИсключения Тогда
			Продолжить;
		КонецЕсли;
		Если (НЕ ТекущаяСтрока.ЗапретРедактированияЦены) И ТекущаяСтрока.ЦенаЛимита>ТекущаяСтрока.ИтоговаяЦена Тогда
			ЗадатьВопросПересчета = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗадатьВопросПересчета Тогда
		
		Отказ = Истина;
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да,     НСтр("ru='Да'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет,    НСтр("ru='Нет'"));
		//Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработатьОтветНаВопросПересчетаУценки", ЭтотОбъект, ПараметрыЗаписи),
		СтрШаблон(НСтр("ru='Обнаружено значение уценки меньше себестоимости товара
		|установить уценку равную себестоимости товара?'")), Кнопки,, КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновить колонку владельцев единиц измерения
	ЗащищенныеФункцииСервер.ЗаполнитьСлужебныеРеквизитыТабличнойЧасти(Объект.Скидки);
	
	Документы.УценкаТовара.ЗаполнитьРеквизитыЦен(Объект);
	Документы.УценкаТовара.ЗаполнитьИтоговыеЦены(Объект);
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ПОДРАЗДЕЛЕНИЯ"

&НаКлиенте
Процедура ДеревоПодразделенийУстановитьФлажки(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивно(ДеревоПодразделений.ПолучитьЭлементы(), Истина, Объект.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийСнятьФлажки(Команда)
	
	Объект.Подразделения.Очистить();
	УправлениеДиалогомКлиент.ДеревоПодразделенийУстановитьФлажкиРекурсивно(ДеревоПодразделений.ПолучитьЭлементы(), Ложь, Объект.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияПодразделениеКомпанииПриИзменении(Элемент)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийОбновитьФлажкиПодразделений(ДеревоПодразделений.ПолучитьЭлементы(), Объект.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоПодразделений.ТекущиеДанные;
	УправлениеДиалогомКлиент.ДеревоПодразделенийПометкаПриИзменении(ТекущиеДанные, Объект.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияПослеУдаления(Элемент)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийОбновитьФлажкиПодразделений(ДеревоПодразделений.ПолучитьЭлементы(), Объект.Подразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийРазвернуть(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийРазвернутьВсеУровни(Элементы.ДеревоПодразделений, ДеревоПодразделений.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПодразделенийСвернуть(Команда)
	
	УправлениеДиалогомКлиент.ДеревоПодразделенийСвернутьВсеУровни(Элементы.ДеревоПодразделений, ДеревоПодразделений.ПолучитьЭлементы());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьШтрихКоды(Номенклатура)
	
	Результат = Новый Массив;
	
	ШтрихКодыОбъекта = ШтрихкодированиеВызовСервера.ПолучитьШтрихКодОбъекта(Номенклатура,,, Истина);
	Для Каждого ТекущаяСтрока Из ШтрихКодыОбъекта Цикл
		Если ТекущаяСтрока.Запрет Тогда
			Продолжить;
		КонецЕсли;
		Результат.Добавить(ТекущаяСтрока.Штрихкод);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СкидкиШтрихКодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Скидки.ТекущиеДанные;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = ТекущиеДанные.ШтрихКоды;
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиШтрихКодПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Скидки.ТекущиеДанные;
	
	Если ТекущиеДанные.ШтрихКод = "РучнойВвод" Тогда
		ТекущиеДанные.ШтрихКод = "";
		Элементы.Скидки.ИзменитьСтроку();
	ИначеЕсли ТекущиеДанные.ШтрихКод = "Новый" Тогда
		ТекущиеДанные.ШтрихКод = ШтрихкодированиеВызовСервера.СформироватьНовыйШтрихкод(ТекущиеДанные.Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

