// Модуль документа "Возврат от покупателя"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Реализация товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_РеализацияТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.РеализацияТоваровКомиссия Тогда
		ХозОперация = Справочники.ХозОперации.ВозвратТоваровОтПокупателяКомиссия;
		Товары.Очистить();
		Документы.ВозвратОтПокупателя.ЗаполнитьДокументНаОснованииПоОперацииКомиссии(ЭтотОбъект,ДанныеЗаполнения);
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_РеализацияТоваров()

// Производит заполнение объекта на основании документа "Ввод остатков товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ВводОстатковТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ВводОстатковТоваровПереданныхНаКомиссию Тогда
		ХозОперация = Справочники.ХозОперации.ВозвратТоваровОтПокупателяКомиссия;
		Товары.Очистить();
		Документы.ВозвратОтПокупателя.ЗаполнитьДокументНаОснованииПоОперацииКомиссии(ЭтотОбъект,ДанныеЗаполнения);
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ВводОстатковТоваров()

// Производит заполнение объекта на основании документа "Инвентаризация"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Инвентаризация(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваровОтданныхНаКомиссию Тогда
		ХозОперация = Справочники.ХозОперации.ВозвратТоваровОтПокупателяКомиссия;
		Товары.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПартииТоваровОтданные.Номенклатура,
		|	ПартииТоваровОтданные.ХарактеристикаНоменклатуры,
		|	ПартииТоваровОтданные.ДокументПередачи КАК ДокументПродажи,
		|	ПартииТоваровОтданные.Партия,
		|	СУММА(ПартииТоваровОтданные.Количество) КАК Количество,
		|	СУММА(ПартииТоваровОтданные.Сумма) КАК Сумма,
		|	СУММА(ПартииТоваровОтданные.СуммаУпр) КАК СуммаУпр
		|ИЗ
		|	РегистрНакопления.ПартииТоваровОтданные КАК ПартииТоваровОтданные
		|ГДЕ
		|	ПартииТоваровОтданные.Регистратор = &Регистратор
		|	И ПартииТоваровОтданные.ВидДвижения = &ВидДвижения
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартииТоваровОтданные.ХарактеристикаНоменклатуры,
		|	ПартииТоваровОтданные.Номенклатура,
		|	ПартииТоваровОтданные.ДокументПередачи,
		|	ПартииТоваровОтданные.Партия";
		
		Запрос.УстановитьПараметр("Регистратор" , ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ВидДвижения" , ВидДвиженияНакопления.Приход);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
			Документы.ВозвратОтПокупателя.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока,ДополнительныеСвойства.ПараметрыДействия);
			НоваяСтрока.СтавкаНДС = Выборка.Номенклатура.СтавкаНДС;
			
			Если ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить() Тогда
				НоваяСтрока.СуммаВсего = Выборка.Сумма;
			ИначеЕсли ВалютаДокумента = Константы.ВалютаУправленческогоУчетаКомпании.Получить() Тогда
				НоваяСтрока.СуммаВсего = Выборка.СуммаУпр;
			Иначе
				НоваяСтрока.СуммаВсего = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(Выборка.СуммаУпр,Константы.ВалютаУправленческогоУчетаКомпании.Получить(),ТекущаяДатаСеанса(),ВалютаДокумента,КурсДокумента);
			КонецЕсли;
			
			Документы.ВозвратОтПокупателя.ТоварыСуммаВсегоПриИзменении(ЭтотОбъект, НоваяСтрока,ДополнительныеСвойства.ПараметрыДействия);
		КонецЦикла;
	Иначе
		ТекстСообщения = НСтр("ru = 'Ввод на основании инвентаризации разрешен только для хоз. операции ""Инвентаризация товаров отданных на комиссию"".'");
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ЭтотОбъект, ТекстСообщения);
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Инвентаризация()

// Производит заполнение объекта на основании документа "Закрытие смены"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ЗакрытиеСмены(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.ХарактеристикаНоменклатуры,
	|	ПродажиОбороты.Партия,
	|	ПродажиОбороты.ГТД,
	|	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот
	|ПОМЕСТИТЬ ТаблицаОборотов
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(, &НаМомент, Регистратор, Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.Регистратор = &ДокументПередачи
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.ХарактеристикаНоменклатуры,
	|	ПродажиОбороты.Партия,
	|	ПродажиОбороты.ГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОборотов.Номенклатура,
	|	ТаблицаОборотов.ХарактеристикаНоменклатуры,
	|	ТаблицаОборотов.Партия,
	|	ТаблицаОборотов.ГТД
	|ИЗ
	|	ТаблицаОборотов КАК ТаблицаОборотов
	|ГДЕ
	|	ТаблицаОборотов.КоличествоОборот <> 0";
	Запрос.УстановитьПараметр("НаМомент",?(Ссылка.Пустая(),Дата,Новый Граница(МоментВремени(),ВидГраницы.Исключая)));
	Запрос.УстановитьПараметр("ДокументПередачи",ДанныеЗаполнения);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ДокументПродажи = ДанныеЗаполнения;
		Документы.ВозвратОтПокупателя.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока);
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ЗакрытиеСмены()

// Производит заполнение объекта на основании документа "Товарно-транспортная накладная ЕГАИС (входящая)".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ТоварноТранспортнаяНакладнаяВходящаяЕГАИС(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.Хозоперация = Справочники.ХозОперации.ТТНВозвратТоваровОтПокупателяЕГАИС Тогда
		ТекстСообщения = НСтр("ru='Поступление товаров вводится только для товарно-транспортной накладной с операцией ""Возврат товаров от покупателя ЕГАИС"".'");
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ДанныеЗаполнения, ТекстСообщения);
		Возврат ЛОЖЬ;
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПодчиненныеДокументы.Ссылка КАК Документ
		|ИЗ
		|	КритерийОтбора.ПодчиненныеДокументы(&Основание) КАК ПодчиненныеДокументы
		|ГДЕ
		|	ПодчиненныеДокументы.Ссылка ССЫЛКА Документ.ВозвратОтПокупателя";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Основание",ДанныеЗаполнения);
		Выборка = Запрос.Выполнить().Выгрузить();
		
		Если Выборка.Количество() > 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='На основании документа <%1> уже введен <%2>.'"),ДанныеЗаполнения,Выборка[0].Документ);
			УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(Выборка[0].Документ, ТекстСообщения);
			Возврат ЛОЖЬ;
		КонецЕсли;

	КонецЕсли;
	
	Товары.Очистить();
	Марки.Очистить();
	ТоварноТранспортнаяНакладнаяЕГАИС = ДанныеЗаполнения;
	
	ИнтеграцияЕГАИС.ЗаполнитьДокументПоВходящейТТН(ЭтотОбъект, ТоварноТранспортнаяНакладнаяЕГАИС);
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ТоварноТранспортнаяНакладнаяВходящаяЕГАИС()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

Процедура ОбработкаПроведенияНакопленияПоКарточкамКонтрагентов()
	
	Если НЕ ЗначениеЗаполнено(Карточка) ИЛИ НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратОтПокупателяТовары.Ссылка.Карточка,
	|	ВозвратОтПокупателяТовары.Ссылка.Контрагент,
	|	ВозвратОтПокупателяТовары.Ссылка.Дата КАК ПериодНакопления,
	|	СУММА(-ВозвратОтПокупателяТовары.Количество) КАК КоличествоНоменклатуры,
	|	СУММА(-ВозвратОтПокупателяТовары.СуммаВсего) КАК Сумма,
	|	СУММА(0) КАК КоличествоЧеков
	|ИЗ
	|	Документ.ВозвратОтПокупателя.Товары КАК ВозвратОтПокупателяТовары
	|ГДЕ
	|	ВозвратОтПокупателяТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратОтПокупателяТовары.Ссылка.Карточка,
	|	ВозвратОтПокупателяТовары.Ссылка.Дата,
	|	ВозвратОтПокупателяТовары.Ссылка.Контрагент";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	НаборНакоплениеСумм = Движения.НакопленияПоКарточкамКонтрагентов;
	НаборНакоплениеСумм.ДокументСсылка   = Ссылка;
	НаборНакоплениеСумм.РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	НаборНакоплениеСумм.ВыполнитьДвижения();
	
КонецПроцедуры

// возвращает выборку по шапке
//
// Параметры:
//  ДокументСсылка - Документ.Ссылка - Ссылка на документ для которого получаем шапку.
//
// Возвращаемое значение:
//  Выборка - возвращает выборку по шапке.
//
Функция ПолучитьШапкуДокумента(ДокументСсылка) Экспорт
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	СУММА(ВозвратОтПокупателяТовары.СуммаВсего) КАК СуммаВсего
	                    |ПОМЕСТИТЬ ДокТовары
	                    |ИЗ
	                    |	Документ.ВозвратОтПокупателя.Товары КАК ВозвратОтПокупателяТовары
	                    |ГДЕ
	                    |	ВозвратОтПокупателяТовары.Ссылка = &Ссылка
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	Док.Ссылка КАК Ссылка,
	                    |	Док.Дата КАК Дата,
	                    |	Док.ВалютаДокумента КАК ВалютаДокумента,
	                    |	Док.КурсДокумента КАК КурсДокумента,
	                    |	Док.ТипЦен КАК ТипЦен,
	                    |	Док.ХозОперация КАК ХозОперация,
	                    |	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	                    |	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	                    |	Док.МоментВремени КАК МоментВремени,
	                    |	Док.Организация КАК Организация,
	                    |	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	                    |	Док.Проект КАК Проект,
	                    |	Док.СкладКомпании КАК СкладКомпании,
	                    |	Док.СкладКомпании.Розничный КАК СкладКомпанииРозничный,
	                    |	Док.СкладКомпании.ТипЦенРозничнойТорговли КАК СкладКомпанииТипЦенРозничнойТорговли,
	                    |	Док.Контрагент КАК Контрагент,
	                    |	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	                    |	Док.ДокументОснование КАК ДокументОснование,
	                    |	Док.ТипЦен.ЦенаВключаетНДС КАК ТипЦенЦенаВключаетНДС,
	                    |	ЕСТЬNULL(ДокТовары.СуммаВсего, 0) КАК СуммаВсего
	                    |ИЗ
	                    |	Документ.ВозвратОтПокупателя КАК Док
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ ДокТовары КАК ДокТовары
	                    |		ПО (ИСТИНА)
	                    |ГДЕ
	                    |	Док.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции // ПолучитьШапкуДокумента()

// получаем таблицу товаров которые надо оприходовать на остатки
//
// Возвращаемое значение:
//  ТаблицаТоваров - таблица значений.
//
Функция ПолучитьТаблицуТоваров()
	
	// Нам фактически надо сформировать таблицу товаров которые были проданы, что бы их заново оприходовать.
	// все из-за автоматического списания характеристик.
	ЗапросСписание=Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиТоваровКомпании.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ОстаткиТоваровКомпании.Регистратор КАК ДокументПродажи,
	|	ОстаткиТоваровКомпании.Количество КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
	|ГДЕ
	|	ОстаткиТоваровКомпании.Регистратор В (&Регистраторы)
	|	И ОстаткиТоваровКомпании.Номенклатура В (&Номенклатура)
	|	И ОстаткиТоваровКомпании.ВидДвижения = &ВидДвижения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстаткиТоваровКомпании.НомерСтроки УБЫВ");
	ЗапросСписание.УстановитьПараметр("Регистраторы",Товары.ВыгрузитьКолонку("ДокументПродажи"));
	ЗапросСписание.УстановитьПараметр("Номенклатура",Товары.ВыгрузитьКолонку("Номенклатура"));
	ЗапросСписание.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Расход);
	
	// наложим блокировку на считываемые данные
	СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ОстаткиТоваровКомпании");
	ЗначенияБлокировки = Новый Соответствие;
	ЗначенияБлокировки.Вставить("Период",Новый Диапазон(,Дата)); 
	ЗначенияБлокировки.Вставить("СкладКомпании",СкладКомпании); 
	СтруктураПараметровБлокировки.Вставить("ИсточникДанных",Товары);
	ОписаниеИсточника = Новый Соответствие;
	ОписаниеИсточника.Вставить("Номенклатура","Номенклатура");
	ОбработкаСобытийДокументаСервер.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки, ОписаниеИсточника);
	
	ТаблицаСписания=ЗапросСписание.Выполнить().Выгрузить();
	// получим таблицу документа
	ТаблицаДокумента=Товары.Выгрузить();
	ТаблицаДокумента.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,ДокументПродажи","КоличествоБазовое, ЦенаРозничная");
	ТаблицаДокумента.Сортировать("Номенклатура Возр,ХарактеристикаНоменклатуры Убыв");
	
	// создадим и заполним таблицу товаров
	ТаблицаТоваров=Новый ТаблицаЗначений();
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаТоваров.Колонки.Добавить("СкладКомпании");
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("Резерв");
	ТаблицаТоваров.Колонки.Добавить("ЦенаРозничная");
	
	ТаблицаРучныхХарактеристик = ОбработкаТабличнойЧастиТовары.ПолучитьНоменклатуруСРучнымСписаниемХарактеристик(Ссылка);
	Розничный = СкладКомпании.Розничный;
		
	Для Каждого СтрокаТовар Из ТаблицаДокумента Цикл
		Если СтрокаТовар.Номенклатура.ВидНоменклатуры=Перечисления.ВидыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли; 
		СтруктураОтбора=Новый Структура("Номенклатура,ДокументПродажи",СтрокаТовар.Номенклатура,СтрокаТовар.ДокументПродажи);
		Если ЗначениеЗаполнено(СтрокаТовар.ХарактеристикаНоменклатуры) ИЛИ (ТаблицаРучныхХарактеристик<>Неопределено И ТаблицаРучныхХарактеристик.Найти(СтрокаТовар.Номенклатура,"Номенклатура")<>Неопределено) Тогда
			СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры",СтрокаТовар.ХарактеристикаНоменклатуры);
		КонецЕсли;
		МассивНайденныхСтрок = ТаблицаСписания.НайтиСтроки(СтруктураОтбора);
		НадоВернуть    = СтрокаТовар.КоличествоБазовое;
		Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
			
			ТекСтрока = МассивНайденныхСтрок[Сч];
			КоличествоКПоступлению = Мин(НадоВернуть, ТекСтрока.Количество);
			
			НоваяСтрока=ТаблицаТоваров.Добавить();
			НоваяСтрока.Номенклатура               = ТекСтрока.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
			НоваяСтрока.СкладКомпании              = СкладКомпании;
			НоваяСтрока.Количество                 = КоличествоКПоступлению;
			НоваяСтрока.Резерв                     = 0;
			Если Розничный Тогда
				НоваяСтрока.ЦенаРозничная = СтрокаТовар.ЦенаРозничная;
			Иначе
				НоваяСтрока.ЦенаРозничная = 0;
			КонецЕсли;
			
			Если ТекСтрока.Количество > НадоВернуть Тогда
				ТекСтрока.Количество = ТекСтрока.Количество - НадоВернуть;
			Иначе
				// Удалим ненужную строку
				ТаблицаСписания.Удалить(ТекСтрока);
			КонецЕсли;
			
			НадоВернуть = НадоВернуть - КоличествоКПоступлению;
			Если НадоВернуть<=0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		// Может еще что-то осталось
		Если НадоВернуть>0 Тогда
			НоваяСтрока=ТаблицаТоваров.Добавить();
			НоваяСтрока.Номенклатура               = СтрокаТовар.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаТовар.ХарактеристикаНоменклатуры;
			НоваяСтрока.СкладКомпании              = СкладКомпании;
			НоваяСтрока.Количество                 = НадоВернуть;
			НоваяСтрока.Резерв                     = 0;
			Если Розничный Тогда
				НоваяСтрока.ЦенаРозничная  = СтрокаТовар.ЦенаРозничная;
			Иначе
				НоваяСтрока.ЦенаРозничная  = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ТаблицаТоваров.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,СкладКомпании,ЦенаРозничная","Количество, Резерв");
	
	Возврат ТаблицаТоваров;
КонецФункции // ПолучитьТаблицуТоваров()

// формирует движения документа по партионным регистрам
//
// Параметры:
//  Режим           - режим проведения (оперативный/неоперативный)
//  ДокументСсылка  - ссылка на документ который надо допровести по партиям.
//
// Возвращаемое значение:
//  Возвращает Истина - все ОК, ложь - чего-то не так.
//
Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	Отказ=Ложь;
	
	// получим шапку документа
	ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	БалансВедетсяПоПодразделениям = БалансВедетсяПоПодразделениям(ШапкаДокумента.Дата);
	
	// Проверим, если подразделение проводиться по партиям "отложенно", то дальше не идем.
	НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		// Доходы и расходы на себестоимость не оприходованных партий
		Если ШапкаДокумента.ХозОперация<>Справочники.ХозОперации.ВозвратТоваровОтПокупателяКомиссия Тогда
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.Подразделение=ШапкаДокумента.ДоговорВзаиморасчетов.ПодразделениеКомпании;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте=Ложь;
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
			НаборЗаписейДоходыИРасходы.Расход=ШапкаДокумента.СуммаВсего;
			НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
			Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		КонецЕсли;
		Возврат НЕ Отказ;
	КонецЕсли;
	
	Если ШапкаДокумента.ХозОперация<>Справочники.ХозОперации.ВозвратТоваровОтПокупателяКомиссия Тогда
		// сформируем таблицу товарного состава
		Запрос=Новый Запрос("ВЫБРАТЬ
		                    |	ВозвратОтПокупателяТовары.Номенклатура КАК Номенклатура,
		                    |	ВозвратОтПокупателяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		                    |	ВозвратОтПокупателяТовары.ДокументПродажи КАК ДокументПродажи,
		                    |	ВозвратОтПокупателяТовары.Партия КАК Партия,
		                    |	ВозвратОтПокупателяТовары.ГТД КАК ГТД,
		                    |	ВозвратОтПокупателяТовары.СтавкаНДС,
		                    |	СУММА(ВозвратОтПокупателяТовары.КоличествоБазовое) КАК Количество,
		                    |	ВозвратОтПокупателяТовары.Себестоимость
		                    |ИЗ
		                    |	Документ.ВозвратОтПокупателя.Товары КАК ВозвратОтПокупателяТовары
		                    |ГДЕ
		                    |	ВозвратОтПокупателяТовары.Ссылка = &Ссылка
		                    |	И ВозвратОтПокупателяТовары.Номенклатура.ВидНоменклатуры <> &Услуга
		                    |
		                    |СГРУППИРОВАТЬ ПО
		                    |	ВозвратОтПокупателяТовары.Номенклатура,
		                    |	ВозвратОтПокупателяТовары.ХарактеристикаНоменклатуры,
		                    |	ВозвратОтПокупателяТовары.ДокументПродажи,
		                    |	ВозвратОтПокупателяТовары.Партия,
		                    |	ВозвратОтПокупателяТовары.ГТД,
		                    |	ВозвратОтПокупателяТовары.СтавкаНДС,
		                    |	ВозвратОтПокупателяТовары.Себестоимость
		                    |УПОРЯДОЧИТЬ ПО
		                    |	ВозвратОтПокупателяТовары.Партия УБЫВ,
		                    |	ВозвратОтПокупателяТовары.ГТД УБЫВ
							|");
		Запрос.УстановитьПараметр("Ссылка",ШапкаДокумента.Ссылка);
		Запрос.УстановитьПараметр("Услуга",Перечисления.ВидыНоменклатуры.Услуга);
		
		// вернем партии
		НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
		НаборЗаписейПартии.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейПартии.СкладКомпании=ШапкаДокумента.СкладКомпании;
		НаборЗаписейПартии.Организация=ШапкаДокумента.Организация;
		НаборЗаписейПартии.РезультатЗапросаПоТоварам=Запрос.Выполнить().Выгрузить();
		НаборЗаписейПартии.ПоБазовомуКоличеству=Истина;
		НаборЗаписейПартии.ИмяРеквизитаДокумент="ДокументПродажи";
		НаборЗаписейПартии.Сторно=Истина;
		НаборЗаписейПартии.ШапкаДокумента=ШапкаДокумента;
		Отказ=НЕ НаборЗаписейПартии.Расход() ИЛИ Отказ;
		
		// Если среди возвращенного товара есть комиссионный, то отсторнируем реализованные товары.
		НаборЗаписейРеализованныеТовары=Движения.РеализованныеТовары;
		НаборЗаписейРеализованныеТовары.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейРеализованныеТовары.Сторно=Истина;
		НаборЗаписейРеализованныеТовары.ПоБазовомуКоличеству=Истина;
		НаборЗаписейРеализованныеТовары.ШапкаДокумента=ШапкаДокумента;
		Отказ=НЕ НаборЗаписейРеализованныеТовары.Приход() ИЛИ Отказ;
		
		// продажи
		Если НЕ Отказ Тогда
			НаборЗаписейПродажи=Движения.Продажи;
			НаборЗаписейПродажи.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейПродажи.СкладКомпании=ШапкаДокумента.СкладКомпании;
			НаборЗаписейПродажи.Сторно=Истина;
			НаборЗаписейПродажи.ПоБазовомуКоличеству=Истина;
			НаборЗаписейПродажи.Покупатель=ШапкаДокумента.Контрагент;
			НаборЗаписейПродажи.ДоговорВзаиморасчетов=ШапкаДокумента.ДоговорВзаиморасчетов;
			НаборЗаписейПродажи.ПодразделениеКомпании=ШапкаДокумента.ПодразделениеКомпании;
			НаборЗаписейПродажи.Комиссия=(ШапкаДокумента.ХозОперация=Справочники.ХозОперации.ВозвратТоваровОтПокупателяКомиссия);
			НаборЗаписейПродажи.ШапкаДокумента=ШапкаДокумента;
			НаборЗаписейПродажи.ИмяРеквизитаДокумент="Партия";
			Отказ=НЕ НаборЗаписейПродажи.Приход() ИЛИ Отказ;
		КонецЕсли;
	Иначе
		// товар возвращает комиссионер. отсторнируем передачу на комиссию
		НаборЗаписейПартииОтданные=Движения.ПартииТоваровОтданные;
		НаборЗаписейПартииОтданные.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейПартииОтданные.Сторно=Истина;
		НаборЗаписейПартииОтданные.Контрагент=ШапкаДокумента.Контрагент;
		НаборЗаписейПартииОтданные.ДоговорВзаиморасчетов=ШапкаДокумента.ДоговорВзаиморасчетов;
		НаборЗаписейПартииОтданные.ШапкаДокумента=ШапкаДокумента;
		НаборЗаписейПартииОтданные.ПоБазовомуКоличеству=Истина;
		Отказ=НЕ НаборЗаписейПартииОтданные.Приход() ИЛИ Отказ;
		
		Если НЕ Отказ Тогда
			НаборЗаписейПартииОтданные.Записать();
		КонецЕсли; 
		// Вернем партии товаров компании
		Запрос=Новый Запрос("ВЫБРАТЬ
		                    |	ПартииТоваровОтданные.Номенклатура КАК Номенклатура,
		                    |	ПартииТоваровОтданные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		                    |	ПартииТоваровОтданные.ДокументПередачи КАК ДокументПродажи,
		                    |	ПартииТоваровОтданные.Партия КАК Партия,
		                    |	ПартииТоваровОтданные.ГТД КАК ГТД,
		                    |	-СУММА(ПартииТоваровОтданные.Количество) КАК Количество,
		                    |	-СУММА(ПартииТоваровОтданные.СуммаСебестоимостиУпр) КАК Себестоимость
		                    |ИЗ
		                    |	РегистрНакопления.ПартииТоваровОтданные КАК ПартииТоваровОтданные
		                    |ГДЕ
		                    |	ПартииТоваровОтданные.Регистратор = &Регистратор
		                    |
		                    |СГРУППИРОВАТЬ ПО
		                    |	ПартииТоваровОтданные.Номенклатура,
		                    |	ПартииТоваровОтданные.ХарактеристикаНоменклатуры,
		                    |	ПартииТоваровОтданные.ДокументПередачи,
		                    |	ПартииТоваровОтданные.Партия,
		                    |	ПартииТоваровОтданные.ГТД,
		                    |	ПартииТоваровОтданные.СуммаСебестоимостиУпр");
		Запрос.УстановитьПараметр("Регистратор",ШапкаДокумента.Ссылка);
		НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
		НаборЗаписейПартии.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейПартии.СкладКомпании=ШапкаДокумента.СкладКомпании;
		НаборЗаписейПартии.Организация=ШапкаДокумента.Организация;
		НаборЗаписейПартии.РезультатЗапросаПоТоварам=Запрос.Выполнить().Выгрузить();
		НаборЗаписейПартии.ПоБазовомуКоличеству=Ложь;
		НаборЗаписейПартии.ШапкаДокумента=ШапкаДокумента;
		НаборЗаписейПартии.ИмяРеквизитаДокумент="ДокументПродажи";
		НаборЗаписейПартии.Сторно=Истина;
		Отказ=НЕ НаборЗаписейПартии.Расход() ИЛИ Отказ;
		
		// Возможно, что возврат производится на склад, на котором подразделение не совпадает с подразделением договора.
		ПодразделениеСклад = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ШапкаДокумента.СкладКомпании.ПодразделениеКомпании, ШапкаДокумента.Дата);
		ПодразделениеДоговор = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ШапкаДокумента.ДоговорВзаиморасчетов.ПодразделениеКомпании, ШапкаДокумента.Дата);
		БалансовыеПодразделенияНеРавны = (ПодразделениеДоговор<>ПодразделениеСклад);
		
		// получим себестоимость
		ПартииТоваровКомпании=Движения.ПартииТоваровКомпании;
		СебестоимостьПартий = -ПартииТоваровКомпании.Итог("СуммаУпр");
		
		ПартииТоваровОтданные=Движения.ПартииТоваровОтданные;
		СебестоимостьПартийОтданные = -ПартииТоваровОтданные.Итог("СуммаСебестоимостиУпр");
		Если БалансВедетсяПоПодразделениям И БалансовыеПодразделенияНеРавны Тогда
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.Подразделение = ШапкаДокумента.СкладКомпании.ПодразделениеКомпании;
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДиР.ВУпрВалюте = Истина;
			НаборЗаписейДиР.Доход = СебестоимостьПартий;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
			
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.Подразделение = ШапкаДокумента.ДоговорВзаиморасчетов.ПодразделениеКомпании;;
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
			НаборЗаписейДиР.ВУпрВалюте = Истина;
			НаборЗаписейДиР.Доход = СебестоимостьПартийОтданные;
			Отказ = НЕ НаборЗаписейДиР.Расход() ИЛИ Отказ;
		КонецЕсли;	
	КонецЕсли;  	
	
	Если ШапкаДокумента.ХозОперация<>Справочники.ХозОперации.ВозвратТоваровОтПокупателяКомиссия Тогда
		// доходы и расходы
		
		// посчитаем себестоимость возвращенных партий кроме комиссионных
		ПартииТоваровКомпании=Движения.ПартииТоваровКомпании;
		
		ТаблицаСписанийПартий = ПартииТоваровКомпании.Выгрузить();
		ТаблицаСписанийПартий.Свернуть("СтатусПартии","СуммаУпр");
		СтруктураОтбора=Новый Структура("СтатусПартии",Перечисления.СтатусыПартий.ТоварПринятыйКомиссия);
		МассивНайденныхСтрок=ТаблицаСписанийПартий.НайтиСтроки(СтруктураОтбора);
		Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
			ТаблицаСписанийПартий.Удалить(МассивНайденныхСтрок[Сч]);
		КонецЦикла;
		Себестоимость=-ТаблицаСписанийПартий.Итог("СуммаУпр"); СуммаУслуг=0;
		
		// Итоговая себестоимость товара
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
		Если БалансВедетсяПоПодразделениям Тогда
			НаборЗаписейДоходыИРасходы.Подразделение = ШапкаДокумента.СкладКомпании.ПодразделениеКомпании;
		КонецЕсли;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Истина;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Себестоимость;
		НаборЗаписейДоходыИРасходы.Расход                  = Себестоимость;
		НаборЗаписейДоходыИРасходы.ШапкаДокумента         = ШапкаДокумента;
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Расход() ИЛИ Отказ;
		
		// подготовим таблицу движений в разрезе подразделений комиссионных товаров
		РеализованныеТовары = Движения.РеализованныеТовары;
		ТаблицаСписанийПартийРеализованных = РеализованныеТовары.Выгрузить();
		ТаблицаСписанийПартийРеализованных.Свернуть("ДоговорВзаиморасчетов","СуммаУпр");  		
		ТаблицаСписанийПартийРеализованных.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
		
		Для Каждого СтрокаСписания Из ТаблицаСписанийПартийРеализованных Цикл
			Если БалансВедетсяПоПодразделениям Тогда
				СтрокаСписания.Подразделение = СтрокаСписания.ДоговорВзаиморасчетов.ПодразделениеКомпании;
			Иначе
				СтрокаСписания.Подразделение = ПодразделениеКомпании;
			КонецЕсли;
		КонецЦикла;	
		
		ТаблицаСписанийПартийРеализованных.Свернуть("Подразделение","СуммаУпр");
		
		Для Каждого СтрокаСписания Из ТаблицаСписанийПартийРеализованных Цикл
			НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
			НаборЗаписейДоходыИРасходы.ДокументОбъект         = ЭтотОбъект;
			НаборЗаписейДоходыИРасходы.Подразделение          = СтрокаСписания.Подразделение;
			НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Себестоимость;
			НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Истина;
			НаборЗаписейДоходыИРасходы.Расход                 = -СтрокаСписания.СуммаУпр;	
			НаборЗаписейДоходыИРасходы.ШапкаДокумента         = ШапкаДокумента;
			Отказ=НЕ НаборЗаписейДоходыИРасходы.Расход() ИЛИ Отказ;
		КонецЦикла;    		
		
		// посчитаем сумму услуг
		Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                    |	СУММА(РеализацияТоваровТовары.СуммаВсего) КАК СуммаУслуг
		                    |ИЗ
		                    |	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		                    |ГДЕ
		                    |	РеализацияТоваровТовары.Ссылка = &ТекДок
		                    |	И РеализацияТоваровТовары.Номенклатура.ВидНоменклатуры = &Услуга");
		Запрос.УстановитьПараметр("ТекДок",ШапкаДокумента.Ссылка);
		Запрос.УстановитьПараметр("Услуга",Перечисления.ВидыНоменклатуры.Услуга);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СуммаУслуг = ?(Выборка.СуммаУслуг=NULL,0,Выборка.СуммаУслуг);
		КонецЕсли;

		// Итог СуммаВсего кроме услуг
		СуммаТоваров = ШапкаДокумента.СуммаВсего - СуммаУслуг;
		НаборЗаписейДоходыИРасходы = Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект = ЭтотОбъект;
		Если БалансВедетсяПоПодразделениям Тогда
			НаборЗаписейДоходыИРасходы.Подразделение = ШапкаДокумента.ДоговорВзаиморасчетов.ПодразделениеКомпании;
		КонецЕсли;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Ложь;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.НачислениеДебиторскойЗадолженностиПоТовару;
		НаборЗаписейДоходыИРасходы.Доход                  = СуммаТоваров;
		НаборЗаписейДоходыИРасходы.ШапкаДокумента         = ШапкаДокумента;
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Расход() ИЛИ Отказ;
		
		// СуммаВсего по услугам
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект = ЭтотОбъект;
		Если БалансВедетсяПоПодразделениям Тогда
			НаборЗаписейДоходыИРасходы.Подразделение = ШапкаДокумента.ДоговорВзаиморасчетов.ПодразделениеКомпании;
		КонецЕсли; 
		НаборЗаписейДоходыИРасходы.ВУпрВалюте             = Ложь;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.НачислениеДебиторскойЗадолженностиПоУслугам;
		НаборЗаписейДоходыИРасходы.Доход                  = СуммаУслуг;
		НаборЗаписейДоходыИРасходы.ШапкаДокумента         = ШапкаДокумента;
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Расход() ИЛИ Отказ;
	КонецЕсли;
	
	// двигаем границу последовательности партий
	Если Ссылка <> ДокументСсылка Тогда
		
		РаботаСГраницами.МоментВремениПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		РаботаСГраницами.ДвиженияПоПартиямПередПроведением(ДокументСсылка, ДополнительныеСвойства);
		
	КонецЕсли;
	
	РаботаСГраницами.СдвинутьГраницуПартий(ДокументСсылка, ДополнительныеСвойства, Движения);

	Возврат НЕ Отказ;	
КонецФункции // ПровестиПоПартиям()

// Проверяем, чтобы количество в документе не превышало количество в документе основании
// и других уже проведенных возвратах
// функция вызывается после всех движений, поэтому смотрим на отрицательные остатки.
//
Функция КоличествоПоДокументуОснованиюНеКорректно()
	
	Результат = Ложь;
	
	// Проверяем только для возвратов на основании реализации
	Если НЕ ЗначениеЗаполнено(ДокументОснование) ИЛИ НЕ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратОтПокупателя.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ УжеВведенныеВозвраты
		|ИЗ
		|	Документ.ВозвратОтПокупателя КАК ВозвратОтПокупателя
		|ГДЕ
		|	ВозвратОтПокупателя.Проведен
		|	И НЕ ВозвратОтПокупателя.ПометкаУдаления
		|	И ВозвратОтПокупателя.ДокументОснование = &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиТоваровКомпании.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ЕСТЬNULL(-ОстаткиТоваровКомпании.Количество, 0) КАК Количество
		|ПОМЕСТИТЬ ОстаткиИзРегистра
		|ИЗ
		|	УжеВведенныеВозвраты КАК УжеВведенныеВозвраты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
		|		ПО УжеВведенныеВозвраты.Ссылка = ОстаткиТоваровКомпании.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиТоваровКомпании.Номенклатура,
		|	ОстаткиТоваровКомпании.ХарактеристикаНоменклатуры,
		|	СУММА(ЕСТЬNULL(ОстаткиТоваровКомпании.Количество, 0))
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
		|ГДЕ
		|	ОстаткиТоваровКомпании.Регистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваровКомпании.Номенклатура,
		|	ОстаткиТоваровКомпании.ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиИзРегистра.Номенклатура КАК Номенклатура,
		|	ОстаткиИзРегистра.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ОстаткиИзРегистра.Количество) КАК Количество
		|ИЗ
		|	ОстаткиИзРегистра КАК ОстаткиИзРегистра
		|ГДЕ
		|	ОстаткиИзРегистра.Количество <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиИзРегистра.Номенклатура,
		|	ОстаткиИзРегистра.ХарактеристикаНоменклатуры";
	Запрос.УстановитьПараметр("Регистратор", ДокументОснование);
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураПоиска = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры");
	
	Для Каждого Строка Из Товары Цикл
		
		Выборка.Сбросить();
		СтруктураПоиска.Номенклатура = Строка.Номенклатура;
		СтруктураПоиска.ХарактеристикаНоменклатуры = Строка.ХарактеристикаНоменклатуры;
		
		ТоварНайден = Выборка.НайтиСледующий(СтруктураПоиска);
		
		Если ТоварНайден Тогда
			
			КоличествоОстаток = Выборка.Количество - Строка.Количество;
			
			Если КоличествоОстаток < 0 Тогда
				
				ВывестиСообщение(НСтр("ru = '[%1] %2. Товар из строки %3. Количество к возврату: %4. Возвращаемое количество: %5. Превышение на %6.'"),
					ЭтотОбъект,
					"Товары[#].Номенклатура",
					Строка.НомерСтроки,
					Результат,
					Строка.Номенклатура.Артикул,
					Строка.Номенклатура.Наименование,
					Строка.НомерСтроки,
					Выборка.Количество,
					Строка.Количество,
					-КоличествоОстаток);
				
			КонецЕсли;
			
		Иначе
			ВывестиСообщение(НСтр("ru = '[%1] %2. Товар из строки %3 не найден в документе основании %4.'"),
				ЭтотОбъект,
				"Товары[#].Номенклатура",
				Строка.НомерСтроки,
				Результат,
				Строка.Номенклатура.Артикул,
				Строка.Номенклатура.Наименование,
				Строка.НомерСтроки,
				ДокументОснование);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ХозОперация) Тогда
		ХозОперация = Справочники.ХозОперации.ВозвратТоваровОтПокупателя;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ДанныеЗаполнения)) Тогда
		ЗаполненНаОснованииДокумента = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеСвойства, "ВыполненоЗаполнениеНаОсновании", "");
		
		Если (НЕ (ЗаполненНаОснованииДокумента = "Инвентаризация")) И (НЕ ХозОперация = Справочники.ХозОперации.ВозвратТоваровОтПокупателяКомиссия) И 
			(НЕ ДанныеЗаполнения.ХозОперация = Справочники.ХозОперации.ТТНВозвратТоваровОтПокупателяЕГАИС) Тогда
			
			ХозОперация = Справочники.ХозОперации.ВозвратТоваровОтПокупателя;
			БлокироватьПерерасчетСкидок = Ложь;
			
			Товары.Очистить();
			Запрос		= Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			               |	ПродажиОбороты.Номенклатура КАК Номенклатура,
			               |	ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			               |	ВЫБОР
			               |		КОГДА ПродажиОбороты.Регистратор = &ДокументПередачи
			               |				ИЛИ ПродажиОбороты.Регистратор.ДокументОснование = &ДокументПередачи
			               |			ТОГДА ИСТИНА
			               |		ИНАЧЕ ЛОЖЬ
			               |	КОНЕЦ КАК Выбрано
			               |ПОМЕСТИТЬ ВремТаб
			               |ИЗ
			               |	РегистрНакопления.Продажи.Обороты(, &НаМомент, Регистратор, Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)) КАК ПродажиОбороты
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ПродажиОбороты.Номенклатура,
			               |	ПродажиОбороты.ХарактеристикаНоменклатуры,
			               |	ВЫБОР
			               |		КОГДА ПродажиОбороты.Регистратор = &ДокументПередачи
			               |				ИЛИ ПродажиОбороты.Регистратор.ДокументОснование = &ДокументПередачи
			               |			ТОГДА ИСТИНА
			               |		ИНАЧЕ ЛОЖЬ
			               |	КОНЕЦ
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВремТаб.Номенклатура КАК Номенклатура,
			               |	ВремТаб.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
			               |ИЗ
			               |	ВремТаб КАК ВремТаб
			               |ГДЕ
			               |	ВремТаб.Выбрано";
			
			Запрос.УстановитьПараметр("НаМомент",			?(Ссылка.Пустая(), Дата,Новый Граница(МоментВремени(),ВидГраницы.Исключая)));
			Запрос.УстановитьПараметр("ДокументПередачи",	ДанныеЗаполнения);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				НоваяСтрока 							= Товары.Добавить();
				НоваяСтрока.Номенклатура 				= Выборка.Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры 	= Выборка.ХарактеристикаНоменклатуры;
				НоваяСтрока.ДокументПродажи 			= ДанныеЗаполнения;
				Документы.ВозвратОтПокупателя.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока,ДополнительныеСвойства.ПараметрыДействия);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// изменим итоговую сумму документа
	СуммаДокумента = Товары.Итог("СуммаВсего");

КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Установим параметры проверки документа
	ДополнительныеСвойства.Вставить("ПроверкаЗаполненияПартииПоГТД", ЗначениеЗаполнено(ДокументОснование));
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	// Выполняем приватную проверку корректности заполнения ГТД
	Если НЕ ЗначениеЗаполнено(ДокументОснование) И ПолучитьФункциональнуюОпцию("ИспользоватьГТД") Тогда
		Для каждого СтрокаТабличнойЧасти Из Товары Цикл
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДокументПродажи) И ЗначениеЗаполнено(СтрокаТабличнойЧасти.ГТД) И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Партия) Тогда
				ВывестиСообщение(НСтр("ru='Поле ""Партия"" строки # таблицы ""Товары"" не заполнено при указанном значении поля ""ГТД""'"), ЭтотОбъект, "Товары[#]"+".Партия", СтрокаТабличнойЧасти.НомерСтроки, Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснование) И ЕстьРеквизит(ДокументОснование, "Контрагент") Тогда
		
		Если ДокументОснование.Контрагент <> Контрагент Тогда
			ТекстСообщения = НСтр("ru = 'Контрагент документа основания отличается от контрагента текущего документа.'");
			ВывестиСообщение(ТекстСообщения, ЭтотОбъект,,,Отказ);
		КонецЕсли;
		
		Если ДокументОснование.ДоговорВзаиморасчетов <> ДоговорВзаиморасчетов Тогда
			ТекстСообщения = НСтр("ru = 'Договор взаиморасчетов документа основания отличается от договора взаиморасчетов текущего документа'");
			ВывестиСообщение(ТекстСообщения, ЭтотОбъект,,,Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// корректируем количество базовое 
	Для Каждого Строка Из Товары Цикл
		Если НЕ ЗначениеЗаполнено(Строка.КоличествоБазовое) Тогда
			Строка.КоличествоБазовое = Строка.Количество * Строка.Коэффициент;
		КонецЕсли;
	КонецЦикла;
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Произведем очистку не использующихся в текущем контексте реквизитов
	ОбработкаСобытийДокументаСервер.ОчиститьПолеЦенаРозничнаяДляНеРозничныхСкладов(ЭтотОбъект, СкладКомпании);
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		Для каждого СтрокаТоваров Из Товары Цикл
			Если СтрокаТоваров.ДокументПродажи <> ДокументОснование Тогда
				СтрокаТоваров.ДокументПродажи = ДокументОснование;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ПолученИзЕГАИС Тогда
		ИнтеграцияЕГАИС.ЗаписатьСоответствиеНоменклатуры(Товары,, Ложь);
	КонецЕсли;
	
	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоВзаиморасчетамПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоПартиямПередПроведением(Ссылка, ДополнительныеСвойства);
	
	// Проверим соответствие документа основание с ХО
	Если ХозОперация = Справочники.ХозОперации.ВозвратТоваровОтПокупателяКомиссия Тогда
		
		МассивХозОпераций = Новый Массив;
		МассивХозОпераций.Добавить(ПредопределенноеЗначение("Справочник.ХозОперации.ВводОстатковТоваровПереданныхНаКомиссию"));
		МассивХозОпераций.Добавить(ПредопределенноеЗначение("Справочник.ХозОперации.ИнвентаризацияТоваровОтданныхНаКомиссию"));
		МассивХозОпераций.Добавить(ПредопределенноеЗначение("Справочник.ХозОперации.РеализацияТоваровКомиссия"));
		
		Если ДокументОснование <> Неопределено И МассивХозОпераций.Найти(ДокументОснование.ХозОперация) = Неопределено Тогда
			ВывестиСообщение(НСтр("ru='Выбранный документ основание не соответствует хозяйственной операции документа.'"), ЭтотОбъект, , , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	// Получим способ ведения баланса.
	БалансВедетсяПоПодразделениям = БалансВедетсяПоПодразделениям(Дата);
	
	// проведем взаиморасчеты
	Если ХозОперация<>Справочники.ХозОперации.ВозвратТоваровОтПокупателяКомиссия Тогда
		НаборЗаписейВзаиморасчеты = Движения.ВзаиморасчетыКомпании;
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			НаборЗаписейВзаиморасчеты.ДокументОбъект				= ЭтотОбъект;
			НаборЗаписейВзаиморасчеты.РежимПроведения				= РежимПроведения;
			НаборЗаписейВзаиморасчеты.Контрагент					= Контрагент;
			НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов			= ДоговорВзаиморасчетов;
			НаборЗаписейВзаиморасчеты.АвтоЗакрытиеСделок			= АвтоЗакрытиеСделок;
			НаборЗаписейВзаиморасчеты.Сделка						= Неопределено;
			НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем		= Неопределено;
			Если ДоговорВзаиморасчетов.СпособЗакрытияСделок=Перечисления.СпособЗакрытияСделок.ПоСчетамИЗаказам
				И ЕстьРеквизит(ДокументОснование,"ДокументОснование") И ТипЗнч(ДокументОснование.ДокументОснование)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				НаборЗаписейВзаиморасчеты.Сделка					= ДокументОснование.ДокументОснование;
				НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем	= Истина;
			ИначеЕсли ТипЗнч(ДокументОснование)<>Тип("ДокументСсылка.ЗакрытиеСмены") Тогда
				НаборЗаписейВзаиморасчеты.Сделка					= ДокументОснование;
				НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем	= Истина;
			КонецЕсли;
			НаборЗаписейВзаиморасчеты.Сумма							= СуммаДокумента;
			НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц = 0;
			
			Отказ = НЕ НаборЗаписейВзаиморасчеты.Расход() ИЛИ Отказ;
			
		Иначе
			ТаблицаТоваров = Товары.Выгрузить(,"ДокументПродажи,КурсВалютыВзаиморасчетов,СуммаВсего");
			ТаблицаТоваров.Свернуть("ДокументПродажи,КурсВалютыВзаиморасчетов", "СуммаВсего");
			
			Для Каждого СтрокаТЧ Из ТаблицаТоваров Цикл
				НаборЗаписейВзаиморасчеты.ДокументОбъект			= ЭтотОбъект;
				НаборЗаписейВзаиморасчеты.РежимПроведения			= РежимПроведения;
				НаборЗаписейВзаиморасчеты.Контрагент				= Контрагент;
				НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов		= ДоговорВзаиморасчетов;
				НаборЗаписейВзаиморасчеты.АвтоЗакрытиеСделок		= АвтоЗакрытиеСделок;
				НаборЗаписейВзаиморасчеты.Сделка					= Неопределено;
				НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем	= Неопределено;
				НаборЗаписейВзаиморасчеты.КурсВзаиморасчетов		= КурсВалютыВзаиморасчетов;
				Если ЗначениеЗаполнено(СтрокаТЧ.ДокументПродажи) Тогда
					Если ДоговорВзаиморасчетов.СпособЗакрытияСделок=Перечисления.СпособЗакрытияСделок.ПоСчетамИЗаказам
						И ЕстьРеквизит(СтрокаТЧ.ДокументПродажи,"ДокументОснование") И ТипЗнч(СтрокаТЧ.ДокументПродажи.ДокументОснование)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
						НаборЗаписейВзаиморасчеты.Сделка			= СтрокаТЧ.ДокументПродажи.ДокументОснование;
						НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем	= Истина;
					Иначе
						НаборЗаписейВзаиморасчеты.Сделка			= СтрокаТЧ.ДокументПродажи;
						НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем	= Истина;
					КонецЕсли;
					НаборЗаписейВзаиморасчеты.КурсВзаиморасчетов	= СтрокаТЧ.КурсВалютыВзаиморасчетов;
				КонецЕсли;
				НаборЗаписейВзаиморасчеты.Сумма						= СтрокаТЧ.СуммаВсего;
				НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц = 0;
				
				Отказ = НЕ НаборЗаписейВзаиморасчеты.Расход() ИЛИ Отказ;
			КонецЦикла;
		КонецЕсли;
		
		// доходы и расходы по суммовым разницам
		СуммаДоходаРасходаСуммовыхРазниц=НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
		Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект         = ЭтотОбъект;
			
			Если БалансВедетсяПоПодразделениям Тогда
				НаборЗаписейДиР.Подразделение = ДоговорВзаиморасчетов.ПодразделениеКомпании;
			КонецЕсли;
			
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
			НаборЗаписейДиР.ВУпрВалюте             = Истина;
			Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
				НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
			Иначе
				НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
			КонецЕсли;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
	КонецЕсли;
	
	// проведем остатки товаров
	НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейОстатки.СкладКомпании=СкладКомпании;
	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=ПолучитьТаблицуТоваров();
	НаборЗаписейОстатки.ПоБазовомуКоличеству=Истина;
	НаборЗаписейОстатки.Контрагент=Контрагент;
	НаборЗаписейОстатки.ДвиженияПоРознице=СкладКомпании.Розничный;
	НаборЗаписейОстатки.РазрешитьПереоценку = НЕ СкладКомпании.Розничный;
	//НаборЗаписейОстатки.ЗаполнятьГруппыОборудования = Истина;
	Отказ=НЕ НаборЗаписейОстатки.Приход() ИЛИ Отказ;
	
	// проведем партии товаров
	Отказ=НЕ ПровестиПоПартиям(РежимПроведения,Ссылка) ИЛИ Отказ;
	
	Если НЕ Отказ Тогда
		ОбработкаПроведенияНакопленияПоКарточкамКонтрагентов();
	КонецЕсли;
	
	// Возможно расхождение баланса на "копейки" из-за округления. Возникшую разницу
	// необходимо списать на доходы и расходы.
	Отказ = НЕ ОбработкаСобытийДокументаСервер.СписаниеКопейкиПриОкругленииВалютныхСчетов(ЭтотОбъект) ИЛИ Отказ;
	
	// двигаем границу последовательности взаиморасчетов
	РаботаСГраницами.СдвинутьГраницуВзаиморасчетов(Ссылка, ДополнительныеСвойства, Движения);
	
	// Проверяем, чтобы количество в документе не превышало количество в документе основании 
	// и других уже проведенных возвратах.
	Отказ = КоличествоПоДокументуОснованиюНеКорректно() ИЛИ Отказ;
	
КонецПроцедуры // ОбработкаПроведения()


#Область Инициализация

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// Установим параметры проверки документа
ДополнительныеСвойства.Вставить("ТоварыЗапретАвтоСписанияХарактеристик", ИСТИНА);

#КонецОбласти

#КонецЕсли