// Добавляет в дерево значений ветку описаний объектов.
&НаСервере
Процедура ДобавитьВДеревоВидОбъекта(Дерево, Картинка, ИмяТипаОбъектов, ИмяТипаЕдЧисле, Представление)
	
	строкаТипа = Дерево.Строки.Добавить();
	строкаТипа.Картинка = Картинка;
	строкаТипа.ВидОбъекта = Представление;
	строкаТипа.Тип = ИмяТипаЕдЧисле;
	Для каждого мдОбъекта из Метаданные[ИмяТипаОбъектов] Цикл
		строкаВида = строкаТипа.Строки.Добавить();
		строкаВида.Картинка = Картинка;
		строкаВида.ВидОбъекта = мдОбъекта.Имя + ?(ПустаяСтрока(мдОбъекта.Синоним), "", " (" + мдОбъекта.Синоним + ")");
		строкаВида.Тип = ИмяТипаЕдЧисле;
		строкаВида.Вид = мдОбъекта.Имя;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыбСсылка = Неопределено;
	Если Параметры.Свойство("ВыбСсылка", ВыбСсылка) Тогда
		Попытка
			мдСсылки = ВыбСсылка.Метаданные();
			Если Метаданные.Справочники.Индекс(мдСсылки) >= 0 Тогда
				Тип = "Справочник";
			ИначеЕсли Метаданные.Документы.Индекс(мдСсылки) >= 0 Тогда
				Тип = "Документ";
			ИначеЕсли Метаданные.ПланыВидовХарактеристик.Индекс(мдСсылки) >= 0 Тогда
				Тип = "ПланВидовХарактеристик";
			ИначеЕсли Метаданные.ПланыСчетов.Индекс(мдСсылки) >= 0 Тогда
				Тип = "ПланСчетов";
			ИначеЕсли Метаданные.ПланыВидовРасчета.Индекс(мдСсылки) >= 0 Тогда
				Тип = "ПланВидовРасчета";
			ИначеЕсли Метаданные.ПланыОбмена.Индекс(мдСсылки) >= 0 Тогда
				Тип = "ПланОбмена";
			ИначеЕсли Метаданные.БизнесПроцессы.Индекс(мдСсылки) >= 0 Тогда
				Тип = "БизнесПроцесс";
			ИначеЕсли Метаданные.Задачи.Индекс(мдСсылки) >= 0 Тогда
				Тип = "Задача";
			КонецЕсли;
			Вид = мдСсылки.Имя;
		Исключение
			мдСсылки = Неопределено;
			Тип = "";
			Вид = "";
		КонецПопытки;
	КонецЕсли;
	
	
	Дерево = РеквизитФормыВЗначение("ДеревоОбъектов");
	
	// Соберём доступные виды объектов в дерево
	ДобавитьВДеревоВидОбъекта(Дерево, БиблиотекаКартинок.Справочник, "Справочники", "Справочник", "Справочники");
	ДобавитьВДеревоВидОбъекта(Дерево, БиблиотекаКартинок.Документ, "Документы", "Документ", "Документы");
	ДобавитьВДеревоВидОбъекта(Дерево, БиблиотекаКартинок.ПланВидовХарактеристик, "ПланыВидовХарактеристик", "ПланВидовХарактеристик", "Планы видов характеристик");
	ДобавитьВДеревоВидОбъекта(Дерево, БиблиотекаКартинок.ПланСчетов, "ПланыСчетов", "ПланСчетов", "Планы счетов");
	ДобавитьВДеревоВидОбъекта(Дерево, БиблиотекаКартинок.ПланВидовРасчета, "ПланыВидовРасчета", "ПланВидовРасчета", "Планы видов расчёта");
	ДобавитьВДеревоВидОбъекта(Дерево, БиблиотекаКартинок.ПланОбмена, "ПланыОбмена", "ПланОбмена", "Планы обмена");
	ДобавитьВДеревоВидОбъекта(Дерево, БиблиотекаКартинок.БизнесПроцесс, "БизнесПроцессы", "БизнесПроцесс", "Бизнес процессы");
	ДобавитьВДеревоВидОбъекта(Дерево, БиблиотекаКартинок.Задача, "Задачи", "Задача", "Задачи");
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоОбъектов");
	
	// Установим текущую строку в дереве типов
	// Ищем строку с текущим типм/видом. Пользуем простой перебор. Кто может лучше - скажите как.
	Поз = 0;
	Нашли = Ложь;
	Для Каждого СтрокаТипа из Дерево.Строки Цикл
		Поз = Поз + 1;
		Для Каждого СтрокаВида из СтрокаТипа.Строки Цикл
			Если СтрокаВида.Тип = Тип И СтрокаВида.Вид = Вид Тогда
				Нашли = Истина;
				Прервать
			КонецЕсли;
			Поз = Поз + 1;
		КонецЦикла;
		Если Нашли Тогда
			Прервать
		КонецЕсли;
	КонецЦикла;
	ЭтаФорма.Элементы.ДеревоОбъектов.ТекущаяСтрока = Поз;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ПустаяСтрока(Элемент.ТекущиеДанные.Вид) Тогда
		СтандартнаяОбработка = Ложь
	Иначе
		ОповеститьОВыборе(Новый Структура("Тип, Вид", Элемент.ТекущиеДанные.Тип, Элемент.ТекущиеДанные.Вид));
	КонецЕсли;
КонецПроцедуры
