// Модуль объекта документа "Событие"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// получает из строки HTML текст тела
//
// Параметры:
//	СтрокаHTML - Строка - строка HTML.
//
// Возвращаемое значение:
//	Строка - Подстрока в строке HTML между <BODY> и </BODY>.
//
Функция ПолучитьТелоHTML(СтрокаHTML)
	
	НачалоТела = СтрНайти(СтрокаHTML, "<BODY>") + 6;
	ОкончаниеТела = СтрНайти(СтрокаHTML, "</BODY>");
	Если НачалоТела < ОкончаниеТела Тогда
		ТелоСодержания = Сред(СтрокаHTML, НачалоТела, ОкончаниеТела - НачалоТела);
	Иначе
		ТелоСодержания = "";
	КонецЕсли;
	
	// Если, кроме пустых параграфов в теле ничего нет, вернем пустую строку.
	Проверка = СокрЛП(СтрЗаменить(ТелоСодержания, "<P>&nbsp;</P>", ""));
	Если Проверка = "" Тогда
		ТелоСодержания = "";
	КонецЕсли;
	
	Возврат ТелоСодержания;
	
КонецФункции// ПолучитьТелоHTML()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Электронное письмо исходящее".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ЭлектронноеПисьмоИсходящее(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Тема = ДанныеЗаполнения.Тема;
	ВходящееИсходящее = Перечисления.ВходящееИсходящееСобытие.Исходящее;
	ХозОперация = Справочники.ХозОперации.ЭлектронноеПисьмо;
	ФорматТекста = ДанныеЗаполнения.ТекстHTML;
	Содержание = ДанныеЗаполнения.Текст;
	Результат = "";
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ЭлектронноеПисьмоИсходящее()

// Производит заполнение объекта на основании документа "Электронное письмо входящее".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ЭлектронноеПисьмоВходящее(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Тема = ДанныеЗаполнения.Тема;
	ВходящееИсходящее = Перечисления.ВходящееИсходящееСобытие.Входящее;
	ХозОперация = Справочники.ХозОперации.ЭлектронноеПисьмо;
	ФорматТекста = ДанныеЗаполнения.ТекстHTML;
	Содержание = ДанныеЗаполнения.Текст;
	Результат = "";
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ЭлектронноеПисьмоВходящее()

// Производит заполнение объекта на основании документа "Телефонный звонок"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ТелефонныйЗвонок(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Тема = ДанныеЗаполнения.Тема;
	Менеджер = сфпСофтФонПроСервер.сфпВернутьСотрудникаПользователя(ДанныеЗаполнения.Ответственный);
	ВходящееИсходящее = ?(ДанныеЗаполнения.Входящий,Перечисления.ВходящееИсходящееСобытие.Входящее,Перечисления.ВходящееИсходящееСобытие.Исходящее);
	Если ДанныеЗаполнения.сфпИдентификаторЗвонка > 0 Тогда
		ХозОперация 			= Справочники.ХозОперации.ТелефонныйЗвонок;
		СтруктураНомера 		= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(ДанныеЗаполнения.АбонентКакСвязаться);
		КонтактнаяИнформация 	= сфпСофтФонПроСервер.сфпСформироватьПредставлениеТелефона(СтруктураНомера.КодСтраны, СтруктураНомера.КодГорода, СтруктураНомера.НомерТелефона);
		ДокументОснование 		= ДанныеЗаполнения.Ссылка;
		ДатаНачала				= ДанныеЗаполнения.Дата;
		ДатаОкончания			= ДатаНачала + ДанныеЗаполнения.сфпДлительностьЗвонка;
		Если ТипЗнч(ДанныеЗаполнения.АбонентКонтакт) = Тип("СправочникСсылка.Контрагенты") Тогда
			ВладелецКонтакта = сфпСофтФонПроСервер.сфпПолучитьВладельца(ДанныеЗаполнения.АбонентКонтакт);
			Если ЗначениеЗаполнено(ВладелецКонтакта) Тогда
				КонтактноеЛицо 	= ДанныеЗаполнения.АбонентКонтакт;
				Контрагент		= ВладелецКонтакта;
			Иначе
				Контрагент		= ДанныеЗаполнения.АбонентКонтакт;
			КонецЕсли;
		КонецЕсли;
		Важность	= ДанныеЗаполнения.Важность;
		Состояние	= Перечисления.СостоянияСобытий.Запланировано;
		сфпИдентификаторЗвонка	= ДанныеЗаполнения.сфпИдентификаторЗвонка;	
	Иначе
		ХозОперация = Справочники.ХозОперации.ЭлектронноеПисьмо;
	КонецЕсли;
		
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ТелефонныйЗвонок()

// Производит заполнение объекта на основании документа "События"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Событие(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ХозОперация = ДанныеЗаполнения.ХозОперация;
	СторонниеЛица.Загрузить(ДанныеЗаполнения.СторонниеЛица.Выгрузить());
	Пользователи.Загрузить(ДанныеЗаполнения.Пользователи.Выгрузить());
	ПереносСтроки = ?(ДанныеЗаполнения.ФорматТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML,"<BR>",Символы.ПС);
	Содержание = ПереносСтроки + "---------- " + НСтр("ru = 'Исходное событие'") + " ----------" + ПереносСтроки;
	Содержание = Содержание + "Дата: " + ДанныеЗаполнения.Дата + ПереносСтроки;
	Содержание = Содержание + "Тема: " + ДанныеЗаполнения.Тема + ПереносСтроки + ПереносСтроки;
	ТелоHTML = ПолучитьТелоHTML(ДанныеЗаполнения.Содержание);
	Если НЕ ПустаяСтрока(ТелоHTML) Тогда
		Содержание = Содержание + ТелоHTML;	
	КонецЕсли;	
	Результат = ПереносСтроки +  "------- " + НСтр("ru = 'Достигнутые результаты'") + " -------" + ПереносСтроки;
	
	ТелоHTML = ПолучитьТелоHTML(ДанныеЗаполнения.Результат);
	Если НЕ ПустаяСтрока(ТелоHTML) Тогда
		Результат = Результат + ТелоHTML;
	КонецЕсли;	
	Тема = ДанныеЗаполнения.Тема;
	ВходящееИсходящее = ?(ДанныеЗаполнения.ВходящееИсходящее = Перечисления.ВходящееИсходящееСобытие.Входящее,Перечисления.ВходящееИсходящееСобытие.Исходящее, Перечисления.ВходящееИсходящееСобытие.Входящее);
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Событие()

// Производит заполнение объекта на основании справочника "Контрагенты"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Контрагенты(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ЭтоГруппа Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ДанныеЗаполнения.Ссылка,Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	
	// Заполним реквизит контрагент или реквизит контактное лицо
	Если ДанныеЗаполнения.Ссылка.ВидКонтрагента = Перечисления.ВидыКонтрагентов.КонтактноеЛицо Тогда
		КонтактноеЛицо = ДанныеЗаполнения.Ссылка;
	Иначе
		Контрагент = ДанныеЗаполнения.Ссылка;
		СторонниеЛицаСтрока = СторонниеЛица.Добавить();
		СторонниеЛицаСтрока.Контрагент = ДанныеЗаполнения.Ссылка;
		СторонниеЛицаСтрока.ВладелецКИ = ДанныеЗаполнения.Ссылка;
		СторонниеЛицаСтрока.КонтактнаяИнформация = КонтактнаяИнформация;
		СторонниеЛицаСтрока.ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Контрагенты()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если Пользователи.Количество() = 0 Тогда
		СтрокаПользователь = Пользователи.Добавить();
		СтрокаПользователь.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = ТекущаяДатаСеанса() + 600;
	КонецЕсли;
	
	ТипЗначенияОснования = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗначенияОснования=Тип("Структура") Тогда
		ИмяСтруктуры = Неопределено;
		ДанныеЗаполнения.Свойство("Имя", ИмяСтруктуры);
		Если ИмяСтруктуры = "СозданиеСобытияСофтФон" Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ХозОперация.Пустая() Тогда
		ХозОперация = Справочники.ХозОперации.Событие;
	КонецЕсли;
		
	Если ПустаяСтрока(Тема) И НЕ ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Тема = Строка(ДанныеЗаполнения);
	КонецЕсли;
		
	// Попытаемся определить контрагента.
	КонтрагентОснования = Неопределено;
	Если ЕстьРеквизит(ДанныеЗаполнения,"Заказчик") Тогда
		КонтрагентОснования = ДанныеЗаполнения.Заказчик;
	ИначеЕсли ЕстьРеквизит(ДанныеЗаполнения,"Контрагент") Тогда
		КонтрагентОснования = ДанныеЗаполнения.Контрагент;
	ИначеЕсли ЕстьРеквизит(ДанныеЗаполнения,"ВладелецТовара") Тогда
		КонтрагентОснования = ДанныеЗаполнения.ВладелецТовара;
	КонецЕсли;
		
	Если (КонтрагентОснования<>Неопределено) И (ТипЗнч(КонтрагентОснования)=Тип("СправочникСсылка.Контрагенты")) Тогда 			
		Если СторонниеЛица.Найти(КонтрагентОснования, "Контрагент")=Неопределено Тогда
			НоваяСтрока = СторонниеЛица.Добавить();
			НоваяСтрока.Контрагент = КонтрагентОснования;
			Контрагент = КонтрагентОснования;
		КонецЕсли;
	КонецЕсли;
	
	// Свернем ТЧ товаров, т.к. в документе-основании могут быть дубли строк.
	Товары.Свернуть("Номенклатура,ЕдиницаИзмерения,Коэффициент,ХарактеристикаНоменклатуры","Количество");
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	СписокУчастников = "" + Строка(Контрагент) + ?(ЗначениеЗаполнено(КонтактноеЛицо), "; "+ Строка(КонтактноеЛицо), "");
	Для Каждого СтороннееЛицо Из СторонниеЛица Цикл
		СписокУчастников = СписокУчастников + ?(ЗначениеЗаполнено(СтороннееЛицо.Контрагент), "; "+ Строка(СтороннееЛицо.Контрагент),"") + ?(ЗначениеЗаполнено(СтороннееЛицо.КонтактноеЛицо), "; "+ Строка(СтороннееЛицо.КонтактноеЛицо),"");
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Проведение по регистру сведений Журнал событий
	Если НЕ Отказ И (НЕ РегистрыСведений.ЖурналСостояний.ЗаписьВЖурналСостояний(Ссылка, Состояние)) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли