Функция ПолучитьВидЗаказа_По_ВидЗаказаНоменклатура(ВидЗаказаНоменклатура) Экспорт

		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа
		               |ИЗ
		               |	РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры КАК ит_СоответствиеВидаЗаявкиВидуНоменклатуры
					   |ГДЕ ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказаНоменклатура = &ВидЗаказаНоменклатура";
		Запрос.УстановитьПараметр("ВидЗаказаНоменклатура",ВидЗаказаНоменклатура);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Если Выборка.Следующий() Тогда
				Возврат Выборка.ВидЗаказа;
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	
КонецФункции

Функция ПолучитьВидЗаказаНоменклатура_По_ВидЗаказа(ВидЗаказа) Экспорт

		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказаНоменклатура
		               |ИЗ
		               |	РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры КАК ит_СоответствиеВидаЗаявкиВидуНоменклатуры
					   |ГДЕ ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа = &ВидЗаказа";
		Запрос.УстановитьПараметр("ВидЗаказа",ВидЗаказа);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Если Выборка.Следующий() Тогда
				Возврат Выборка.ВидЗаказаНоменклатура;
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	
КонецФункции
