////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

#Область ОписаниеПеременных

// Ускоряющие переменные
&НаСервере
Перем МетаданныеИсточника;          // Метаданные текущей табличной части (МетаданныеОбъектТабличнаяЧасть)

// Служебные переменные
&НаСервере
Перем МенеджерыОбъектовМетаданных;  // Структура Менеджеров объектов метаданных

&НаКлиенте
Перем КешМенеджеровПоТипу;          // Соответствие, для кэширования информации о соответствии типа менеджеру

// Ускоряющие переменные для настроек выгрузки
&НаКлиенте
Перем СоответствиеТиповИПредставленийDBF;   // Соответствие типов и представлений

&НаКлиенте
Перем СписокСоответствийТранслитерации;     // Список соответствий транслитерации

&НаКлиенте
Перем ИзмененаРучнаяНумерацияКолонок;

&НаКлиенте
Перем РазвернутТабличныйДокумент;

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура, устанавливает видимость табличного документа
//
&НаКлиенте
Процедура УстановитьВидимостьТабличныйДокумент()
	Если ОтображениеТабличногоДокумента Тогда
		Элементы.тТабличныйДокумент.Заголовок= НСтр("ru = 'Свернуть табличный документ'");
		Элементы.ГруппаТабличныйДокумент.Видимость = Истина;
		Элементы.ФайлДляИнтерактивнойНастройки.Доступность = Истина;
	Иначе
		Элементы.тТабличныйДокумент.Заголовок= НСтр("ru = 'Развернуть табличный документ'");
		Элементы.ГруппаТабличныйДокумент.Видимость = Ложь;
		Элементы.ФайлДляИнтерактивнойНастройки.Доступность = Ложь;
	КонецЕсли; 
	ОтображениеТабличногоДокумента = НЕ ОтображениеТабличногоДокумента;
	РазвернутТабличныйДокумент = Истина;
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитов);
	РазобратьсяСОформлениемСтрок();
КонецПроцедуры

// Процедура расстановки пометок на кнопках контекстного меню табличного документа
//
&НаКлиенте
Процедура РасставитьПометкиНаКнопках(НомерКолонки)
	
	Если ОтображениеТабличногоДокумента Тогда
		Возврат;
	КонецЕсли;
	
	ИменаПомеченныхКолонок = Новый Массив;
	СтрокиТЧ = ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(Новый Структура("НомерКолонки", НомерКолонки));
	Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
		ИменаПомеченныхКолонок.Добавить("ПодключаемаяКнопка_"+СокрЛП(СтрокаТЧ.ИмяРеквизита));
	КонецЦикла;
	
	Для Каждого Кнопка Из Элементы.ТабличныйДокументКонтекстноеМеню.ПодчиненныеЭлементы Цикл
		Кнопка.Пометка = ИменаПомеченныхКолонок.Найти(Кнопка.Имя)<>Неопределено;
	КонецЦикла;
	//
КонецПроцедуры

// Процедура установки условного оформления строк таблицы
//
&НаКлиенте
Процедура РазобратьсяСОформлениемСтрок()
	НомерКолонки = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Если ЭтотОбъект.ТекущийЭлемент <> Элементы.ТабличныйДокумент Тогда
		НомерКолонки = 0;
	КонецЕсли;
	Для Каждого СтрокаТаблицы Из ТаблицаЗагружаемыхРеквизитов Цикл
		СтрокаТаблицы.ПодсвечиватьСтроку = ?(НомерКолонки = 0, Ложь, НомерКолонки = СтрокаТаблицы.НомерКолонки);
	КонецЦикла;
КонецПроцедуры

// Процедура выделения цветом нужной колонки табличного документа
//
&НаКлиенте
Процедура ПодсветитьВыбраннуюКолонку(ТекТаблицаФормы)
	
	Если НЕ Элементы.ГруппаТабличныйДокумент.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекТаблицаФормы = Неопределено И (ИзмененаРучнаяНумерацияКолонок ИЛИ РазвернутТабличныйДокумент) Тогда
		РазвернутТабличныйДокумент = Ложь;
		ИзмененаРучнаяНумерацияКолонок = Ложь;
		Возврат;
	КонецЕсли;
	
	ТипЛинииРамки 	= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1, 0);

	ЦветРамки = ОбщегоНазначенияВызовСервера.ЦветСтиля("ЦветФонаКнопки");
	
	ТекОбласть 				= ТабличныйДокумент.Область(1,1,ТабличныйДокумент.ВысотаТаблицы,ТабличныйДокумент.ШиринаТаблицы);
	ТекОбласть.ЦветФона 	= ОбщегоНазначенияВызовСервера.ЦветСтиля("ЦветФонаПоля");

	Если ТекТаблицаФормы = Неопределено Тогда
		// спозиционировались на колонке
		НомерКолонкиПодсветки = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Иначе
		ТекСтрока 		= ТекТаблицаФормы.ТекущиеДанные;
		Если ТекСтрока = Неопределено ИЛИ ТекСтрока.НомерКолонки = 0 Тогда
			Возврат;
		КонецЕсли;
		НомерКолонкиПодсветки = ТекСтрока.НомерКолонки;
	КонецЕсли;
	
	ТекОбласть = ТабличныйДокумент.Область(1, НомерКолонкиПодсветки, ТабличныйДокумент.ВысотаТаблицы, НомерКолонкиПодсветки);
	ТекОбласть.ЦветФона 	= ОбщегоНазначенияВызовСервера.ЦветСтиля("НедоступныеДанныеЦвет");
	
	Если ТекТаблицаФормы<>Неопределено Тогда
		ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, НомерКолонкиПодсветки, 1, НомерКолонкиПодсветки);
	КонецЕсли;
	ТабличныйДокумент.ОтображатьСетку = Истина;
	
КонецПроцедуры

// Процедура заполнения контекстного меню табличного документа
//
&НаСервере
Процедура ЗаполнитьМассивКнопок()
	
	МассивКнопокДляУдаления = Новый Массив;
	Для Каждого СуществующаяКнопка Из Элементы.ТабличныйДокументКонтекстноеМеню.ПодчиненныеЭлементы Цикл
		МассивКнопокДляУдаления.Добавить(СуществующаяКнопка);
	КонецЦикла;
	
	Для Каждого Кнопка Из МассивКнопокДляУдаления Цикл
		Попытка
			Команды.Удалить(Кнопка.Имя);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при удалении команды'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()) + " " + СокрЛП(Кнопка.Имя), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		Попытка
			Элементы.Удалить(Кнопка);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при удалении команды'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()) + " " + СокрЛП(Кнопка.Имя), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
	ИмяДействия = "ПодключаемыеКнопкиНажатие";
	Для Каждого СтрокаТЧ Из ТаблицаЗагружаемыхРеквизитов Цикл
		Если СтрокаТЧ.ЭтоДополнительныйРеквизит Тогда
			Продолжить;
		КонецЕсли;
		ИмяКнопки = "ПодключаемаяКнопка_"+СокрЛП(СтрокаТЧ.ИмяРеквизита);
		Команда = Команды.Найти(ИмяКнопки);
		
		Если Команда = Неопределено Тогда
			Команда = Команды.Добавить(ИмяКнопки);
		КонецЕсли;
		
		Кнопка = Элементы.Добавить(ИмяКнопки,Тип("КнопкаФормы"), Элементы.ТабличныйДокументКонтекстноеМеню);
		Команда.Действие = ИмяДействия;
		Кнопка.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), СтрокаТЧ.ПредставлениеРеквизита);
		Кнопка.ИмяКоманды = ИмяКнопки;
	КонецЦикла;

КонецПроцедуры

// Процедура формирует наименование объекта
//
// Возвращаемое значение:
//    Строка - Наименование
//
&НаКлиенте
Функция СформироватьНаименование()
	
	// Формируем наименование в зависимости от заполненных реквизитов
	Если ПустаяСтрока(Объект.ПредставлениеПрикладногоОбъекта) Тогда
		Возврат "";
	КонецЕсли;
	
	НовоеНаименование = Объект.ПредставлениеПрикладногоОбъекта;
	
	Если НЕ ПустаяСтрока(Объект.ПредставлениеТабличнойЧасти) И НЕ Объект.ТипПрикладногоОбъекта=ПредопределенноеЗначение("Перечисление.ТипыПрикладныхОбъектов.Справочник") Тогда
		Возврат НовоеНаименование+" ("+Объект.ПредставлениеТабличнойЧасти+")";
	КонецЕсли;
	
	// Вернем результат
	Возврат НовоеНаименование;
	
КонецФункции // СформироватьНаименование()

// Процедура перенумерации строк выгружаемых реквизитов
//
&НаКлиенте
Процедура ОбновитьНомераСтрокВыгружаемыхРеквизитов()
	
	Для Каждого Строка Из ВыгружаемыеРеквизиты Цикл
		
		Строка.НомерСтроки = ВыгружаемыеРеквизиты.Индекс(Строка)+1;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция возвращает транслитерированный текст
//
// Параметры:
//  Текст  - Строка	- Исходный текст.
//
// Возвращаемое значение:
//  Строка - Транслитерированный текст.
//
&НаКлиенте
Функция Транслитерация(Текст) Экспорт
	
	// Поле КоличествоУпаковок ТЧ документов будем обрабатывать отдельно
	Если Текст = НСтр("ru = 'Количество упаковок'") Тогда
		Возврат "Kol_upakov";
	КонецЕсли;
	
	// Заполняем список соответствий
	РезультирующийТекст = "";
	ДлинаТекста = СтрДлина(Текст);
	Для Сч = 1 По ДлинаТекста Цикл
		
		Символ = Сред(Текст,Сч,1);
		КодСимвола = КодСимвола(Символ);
		
		Латинская = (КодСимвола>=КодСимвола("A") И КодСимвола<=КодСимвола("Z")) ИЛИ (КодСимвола>=КодСимвола("a") И КодСимвола<=КодСимвола("z"));
		
		Если НЕ Латинская Тогда
			РусскаяЗаглавная = (КодСимвола>=КодСимвола("А") И КодСимвола<=КодСимвола("Я")) ИЛИ Символ = "Ё";
			Соответствие = СписокСоответствийТранслитерации.НайтиПоЗначению(НРег(Символ));
			Если Соответствие = Неопределено Тогда
				Символ = "";
			Иначе
				Символ = Соответствие.Представление;
				Если РусскаяЗаглавная Тогда
					ПервыйСимвол = Сред(Символ,1,1);
					Символ = ВРег(ПервыйСимвол)+Сред(Символ,2);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		РезультирующийТекст = РезультирующийТекст + Символ;
		
	КонецЦикла;
	
	Пока Истина Цикл
		Если Лев(РезультирующийТекст, 1)="_" Тогда
			РезультирующийТекст = Сред(РезультирующийТекст, 2);
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультирующийТекст;
	
КонецФункции

// Процедура настройки доступности поля обработки
//
&НаСервере
Процедура НастроитьДоступностьПоляОбработки()
	Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеОтчетыИОбработки") Тогда
		Элементы.ИспользоватьВнешнийМодульПреобразованияФайла.Видимость = Истина;
		Элементы.ОбработкаПреобразования.Видимость = Истина;
		Если ИспользоватьВнешнийМодульПреобразованияФайла Тогда
			Элементы.ОбработкаПреобразования.Доступность = Истина;
			Элементы.ОбработкаПреобразования.АвтоОтметкаНезаполненного = Истина;
		Иначе
			Элементы.ОбработкаПреобразования.Доступность = Ложь;
			Элементы.ОбработкаПреобразования.АвтоОтметкаНезаполненного = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ИспользоватьВнешнийМодульПреобразованияФайла.Видимость = Ложь;
		Элементы.ОбработкаПреобразования.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

// Функция определить возможность установки режима поиска для текущих данных
//
&НаСервереБезКонтекста
Функция ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(РеквизитПоиска, ОписаниеТиповРеквизита, РеквизитИскатьПо, РеквизитЗначениеПоУмолчанию)
	
	Возврат ЗагрузкаИзЭлектронныхДокументовВызовСервера.ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(РеквизитПоиска, ОписаниеТиповРеквизита, РеквизитИскатьПо, РеквизитЗначениеПоУмолчанию);
	
КонецФункции

// Функция определить возможность установки режима загрузки для текущих данных
//
&НаСервереБезКонтекста
Функция ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных(ОписаниеТиповРеквизита, РеквизитЗначениеПоУмолчанию)
	
	Возврат ЗагрузкаИзЭлектронныхДокументовВызовСервера.ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных(ОписаниеТиповРеквизита, РеквизитЗначениеПоУмолчанию);
	
КонецФункции


// Первоначальное заполнение КЕШей и рабочих переменных при открытии формы
//
&НаСервере
Процедура Инициализация()
	
	// Инициализируем вспомогательные переменные
	МенеджерыОбъектовМетаданных = Новый Структура();
	МенеджерыОбъектовМетаданных.Вставить("Справочники",             Справочники);
	МенеджерыОбъектовМетаданных.Вставить("Перечисления",            Перечисления);
	МенеджерыОбъектовМетаданных.Вставить("Документы",               Документы);
	МенеджерыОбъектовМетаданных.Вставить("ПланыВидовХарактеристик", ПланыВидовХарактеристик);
	МенеджерыОбъектовМетаданных.Вставить("ПланыСчетов",             ПланыСчетов);
	МенеджерыОбъектовМетаданных.Вставить("ПланыВидовРасчета",       ПланыВидовРасчета);
	МенеджерыОбъектовМетаданных.Вставить("БизнесПроцессы",          БизнесПроцессы);
	МенеджерыОбъектовМетаданных.Вставить("Задачи",                  Задачи);
	
	АдресХранилищаМенеджерыОбъектовМетаданных = ПоместитьВоВременноеХранилище(МенеджерыОбъектовМетаданных, УникальныйИдентификатор);
	
	КешМенеджеровПоТипу = Новый Соответствие;
	
	// Заполним кэш для ускорения интерактивной работы
	Картинка = БиблиотекаКартинок.СправочникОбъект; // Доступ через точку сильно замедляет открытие формы
	Для Каждого ОбъектМетаданныхДокумент Из Метаданные.Справочники  Цикл
		СписокСправочниковКЕШ.Добавить(ОбъектМетаданныхДокумент.Имя,ОбъектМетаданныхДокумент.Представление(),,Картинка);
	КонецЦикла;
	
	Картинка = БиблиотекаКартинок.ДокументОбъект; // Доступ через точку сильно замедляет открытие формы
	Для Каждого ОбъектМетаданныхДокумент Из Метаданные.Документы Цикл
		Если ОбъектМетаданныхДокумент.ТабличныеЧасти.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		СписокДокументовКЕШ.Добавить(ОбъектМетаданныхДокумент.Имя,ОбъектМетаданныхДокумент.Представление(),,Картинка);
	КонецЦикла;
	
	Картинка = БиблиотекаКартинок.Обработка; // Доступ через точку сильно замедляет открытие формы
	Для Каждого ОбъектМетаданныхОбработка Из Метаданные.Обработки Цикл
		Если ОбъектМетаданныхОбработка.ТабличныеЧасти.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		СписокОбработокКЕШ.Добавить(ОбъектМетаданныхОбработка.Имя,ОбъектМетаданныхОбработка.Представление(),,Картинка);
	КонецЦикла;
	
	Картинка = БиблиотекаКартинок.РегистрСведений; // Доступ через точку сильно замедляет открытие формы
	Для Каждого ОбъектМетаданныхРегистр Из Метаданные.РегистрыСведений Цикл
		Если ОбъектМетаданныхРегистр.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
			Продолжить;
		КонецЕсли;
		СписокРегистровСведенийКЕШ.Добавить(ОбъектМетаданныхРегистр.Имя,ОбъектМетаданныхРегистр.Представление(),,Картинка);
	КонецЦикла;
	
	// Заполним списки выбора для настроек выгрузки
	СписокВыбора = Элементы.ВыгружаемыеРеквизиты.ПодчиненныеЭлементы.ВыгружаемыеРеквизитыТипПоля.СписокВыбора;
	СписокВыбора.Добавить("Поле объекта");
	СписокВыбора.Добавить("Выражение");
	
	Элементы.ФорматФайла.СписокВыбора.Добавить("DBF");
	ФорматФайла = Элементы.ФорматФайла.СписокВыбора[0].Значение;
	
КонецПроцедуры

// Первоначальное заполнение рабочих переменных при открытии формы
//
&НаКлиенте
Процедура ИнициализацияСписковИСоответствий()
	
	СоответствиеТиповИПредставленийDBF = Новый Соответствие;
	СоответствиеТиповИПредставленийDBF.Вставить("S", "Строка");
	СоответствиеТиповИПредставленийDBF.Вставить("N", "Число");
	СоответствиеТиповИПредставленийDBF.Вставить("L", "Булево");
	СоответствиеТиповИПредставленийDBF.Вставить("D", "Дата");
	СписокВыбора = Элементы.ВыгружаемыеРеквизиты.ПодчиненныеЭлементы.ВыгружаемыеРеквизитыТип.СписокВыбора;
	Для Каждого КлючИЗначение Из СоответствиеТиповИПредставленийDBF Цикл
		СписокВыбора.Добавить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	СписокСоответствийТранслитерации = Новый СписокЗначений;
	СписокСоответствийТранслитерации.Добавить("й","iy");
	СписокСоответствийТранслитерации.Добавить("ц","ts");
	СписокСоответствийТранслитерации.Добавить("у","u");
	СписокСоответствийТранслитерации.Добавить("к","k");
	СписокСоответствийТранслитерации.Добавить("е","e");
	СписокСоответствийТранслитерации.Добавить("н","n");
	СписокСоответствийТранслитерации.Добавить("г","g");
	СписокСоответствийТранслитерации.Добавить("ш","sh");
	СписокСоответствийТранслитерации.Добавить("щ","shch");
	СписокСоответствийТранслитерации.Добавить("з","z");
	СписокСоответствийТранслитерации.Добавить("х","h");
	СписокСоответствийТранслитерации.Добавить("ъ","");
	СписокСоответствийТранслитерации.Добавить("ф","f");
	СписокСоответствийТранслитерации.Добавить("ы","y");
	СписокСоответствийТранслитерации.Добавить("в","v");
	СписокСоответствийТранслитерации.Добавить("а","a");
	СписокСоответствийТранслитерации.Добавить("п","p");
	СписокСоответствийТранслитерации.Добавить("р","r");
	СписокСоответствийТранслитерации.Добавить("о","o");
	СписокСоответствийТранслитерации.Добавить("л","l");
	СписокСоответствийТранслитерации.Добавить("д","d");
	СписокСоответствийТранслитерации.Добавить("ж","zh");
	СписокСоответствийТранслитерации.Добавить("э","e");
	СписокСоответствийТранслитерации.Добавить("я","ya");
	СписокСоответствийТранслитерации.Добавить("ч","ch");
	СписокСоответствийТранслитерации.Добавить("с","s");
	СписокСоответствийТранслитерации.Добавить("м","m");
	СписокСоответствийТранслитерации.Добавить("и","i");
	СписокСоответствийТранслитерации.Добавить("т","t");
	СписокСоответствийТранслитерации.Добавить("ь","");
	СписокСоответствийТранслитерации.Добавить("б","b");
	СписокСоответствийТранслитерации.Добавить("ю","you");
	СписокСоответствийТранслитерации.Добавить("ё","ye");
	СписокСоответствийТранслитерации.Добавить(" ","_");
	
КонецПроцедуры

// Процедура выполняет установку реквизитов, связанных с источником данных
//
&НаСервере
Процедура УстановитьИсточник(ЗаполнитьПредставления = Ложь)
	
	// Установим ускоряющую переменную модуля
	МетаданныеИсточника = Справочники.НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПолучитьМетаданныеИсточника(Объект, ЗаполнитьПредставления);
	Если МетаданныеИсточника = Неопределено Тогда
		АдресХранилищаМетаданныеИсточника = "";
	Иначе
		АдресХранилищаМетаданныеИсточника = ПоместитьВоВременноеХранилище(МетаданныеИсточника.ПолноеИмя(), УникальныйИдентификатор);
	КонецЕсли;
	
	// Заполним список реквизитов ТЧ
	Если Объект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
		ЗаполнитьНастройкиКолонок();
	ИначеЕсли Объект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		ЗаполнитьНастройкиКолонокВыгрузки();
	КонецЕсли;
	
КонецПроцедуры // УстановитьИсточник()

// Функция возвращает метаданные источника данных из временного хранилища
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//   ОбъектМетаданныхТабличнаяЧасть	- Объект метаданных.
//
&НаСервере
Функция ПолучитьМетаданныеИсточникаИзВременногоХранилища()
	
	Если ЗначениеЗаполнено(АдресХранилищаМетаданныеИсточника) И МетаданныеИсточника = Неопределено Тогда
		МетаданныеИсточника = Метаданные.НайтиПоПолномуИмени(ПолучитьИзВременногоХранилища(АдресХранилищаМетаданныеИсточника));
	КонецЕсли;
	
	Возврат МетаданныеИсточника;
	
КонецФункции

// Процедура изменения настройки ручной нумерации колонок
//
&НаСервере
Процедура УстановитьРучнаяНумерацияКолонок()
	
	РучнаяНумерацияКолонокТабличногоДокумента = НЕ РучнаяНумерацияКолонокТабличногоДокумента;
	
КонецПроцедуры


// НАСТРОЙКИ ВЫГРУЗКИ

// Процедура создает новый табличный документ на основании данных формы (выгрузка)
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//  ТабличныйДокумент - Настройки собранные в табличный документ для хранения в реквизите "НастройкиЗагрузкиВыгрузки"
//  Неопределено      - Возвращается если не указаны все необходимые данные.
//
&НаСервере
Функция ЗаполнитьТабличныйДокументИзНастроекВыгрузки()
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	Если МетаданныеИсточника = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	Макет = Справочники.НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПолучитьМакет("МакетСохраненияНастроекВыгрузки");
	
	ОбластьШапки  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	
	Если Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Документ Тогда
		ТипОбъекта = НСтр("ru = 'табличная часть документа'");
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Справочник Тогда
		ТипОбъекта = "справочник";
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Обработка Тогда
		ТипОбъекта = НСтр("ru = 'табличная часть обработки'");
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.РегистрСведений Тогда
		ТипОбъекта = НСтр("ru = 'регистр сведений'");
	КонецЕсли;
	
	ОбластьШапки.Параметры.ТипОбъекта  = ТипОбъекта;
	ОбластьШапки.Параметры.Объект      = МетаданныеИсточника.ПолноеИмя();
	ОбластьШапки.Параметры.ФорматФайла = ФорматФайла;
	ОбластьШапки.Параметры.Кодировка   = Кодировка;
	ОбластьШапки.Параметры.ПередВыгрузкойОбъекта = ПередВыгрузкойОбъекта;
	ОбластьШапки.Параметры.ПослеДобавленияСтроки = ПослеДобавленияСтроки;
	ДокументРезультат.Вывести(ОбластьШапки);
	
	Для Каждого Строка Из ВыгружаемыеРеквизиты Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтроки.Параметры, Строка, "ТипПоля,Представление,ПолеДБФ,Тип,Данные");
		ОбластьСтроки.Параметры.Длина       = Формат(Строка.Длина,"ЧН=0; ЧГ=0");
		ОбластьСтроки.Параметры.Точность    = Формат(Строка.Точность,"ЧН=0; ЧГ=0");
		ДокументРезультат.Вывести(ОбластьСтроки);
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции // ЗаполнитьТабличныйДокументИзНастроекВыгрузки()

// Процедура заполняет настройки формы на основании табличного документа (выгрузка)
//
// Параметры:
//  Настройки - ТабличныйДокумент - Табличный документ.
//
// Возвращаемое значение:
//  Булево - признак успешности выполнения операции.
//
&НаСервере
Функция ЗаполнитьНастройкиВыгрузкиИзТабличногоДокумента(Настройки)
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	СтруктураНастроек = Справочники.НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПолучитьНастройкиВыгрузкиИзТабличногоДокумента(Настройки);
	Если СтруктураНастроек=Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	мТипПрикладногоОбъекта = СтруктураНастроек.ТипПрикладногоОбъекта;
	мМетаданныеИсточника   = СтруктураНастроек.МетаданныеИсточника;
	мФорматФайла           = СтруктураНастроек.ФорматФайла;
	мКодировка             = СтруктураНастроек.Кодировка;
	мВыгружаемыеРеквизиты  = СтруктураНастроек.ВыгружаемыеРеквизиты;
	мПередВыгрузкойОбъекта = СтруктураНастроек.ПередВыгрузкойОбъекта;
	мПослеДобавленияСтроки = СтруктураНастроек.ПослеДобавленияСтроки;
	
	// Принимаем файл как корректный, переписываем значения реквизитов значениями из промежуточных переменных.
	Если Объект.ВариантИспользованияНастройки <> Перечисления.ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		Если ЗначениеЗаполнено(Объект.ВариантИспользованияНастройки) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Вариант использования настройки изменен на %1'"), Перечисления.ВариантыИспользованияНастройки.ВыгрузкаДанных);
			ВывестиСообщение(ТекстОшибки);
		КонецЕсли;
		Объект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ВыгрузкаДанных;
	КонецЕсли;
	
	Если Объект.ТипПрикладногоОбъекта <> мТипПрикладногоОбъекта Тогда
		Если ЗначениеЗаполнено(Объект.ТипПрикладногоОбъекта) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Тип объекта изменен на %1'"), мТипПрикладногоОбъекта);
			ВывестиСообщение(ТекстОшибки);
		КонецЕсли;
		Объект.ТипПрикладногоОбъекта = мТипПрикладногоОбъекта;
	КонецЕсли;
	
	Если МетаданныеИсточника<>мМетаданныеИсточника Тогда
		
		Если МетаданныеИсточника<>Неопределено Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Объект и/или табличная часть изменена %1 -> %2'"), МетаданныеИсточника.ПолноеИмя(), мМетаданныеИсточника.ПолноеИмя());
			ВывестиСообщение(ТекстОшибки);
		КонецЕсли;
		
		// Заполним служебную переменную
		МетаданныеИсточника = мМетаданныеИсточника;
		
		// Заполним реквизиты справочника настроек
		Если Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Документ Тогда
			Объект.ИмяПрикладногоОбъекта           = мМетаданныеИсточника.Родитель().Имя;
			Объект.ИмяТабличнойЧасти               = мМетаданныеИсточника.Имя;
			Объект.ПредставлениеПрикладногоОбъекта = мМетаданныеИсточника.Родитель().Представление();
			Объект.ПредставлениеТабличнойЧасти     = мМетаданныеИсточника.Представление();
		ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Справочник Тогда
			Объект.ИмяПрикладногоОбъекта           = мМетаданныеИсточника.Имя;
			Объект.ИмяТабличнойЧасти               = "";
			Объект.ПредставлениеПрикладногоОбъекта = мМетаданныеИсточника.Представление();
			Объект.ПредставлениеТабличнойЧасти     = "";
		КонецЕсли;
		
	КонецЕсли;
	
	// Перезаполним списки выбора элементов форм
	ЗаполнитьСписокТиповПрикладногоОбъекта();
	ЗаполнитьСписокПрикладныхОбъектов();
	ЗаполнитьСписокТабличныхЧастей();
	
	// Заполним реквизиты формы	
	ФорматФайла = мФорматФайла;
	Кодировка   = мКодировка;
	
	ПередВыгрузкойОбъекта = мПередВыгрузкойОбъекта;
	ПослеДобавленияСтроки = мПослеДобавленияСтроки;
	
	// Заполним табличную часть выгружаемых реквизитов
	ЗаполнитьНастройкиКолонокВыгрузки(мВыгружаемыеРеквизиты);
	
	Возврат Истина;
	
КонецФункции // ЗаполнитьНастройкиИзТабличногоДокумента()

// Заполняет список выгружаемых реквизитов
//
// Параметры:
//  ИсходныеДанныеТабличнойЧасти - ТаблицаЗначений - Таблица значений содержащая настройки выгрузки в текстовом виде.
//
&НаСервере
Процедура ЗаполнитьНастройкиКолонокВыгрузки(ИсходныеДанныеТабличнойЧасти=Неопределено)
	
	ВыгружаемыеРеквизиты.Очистить();
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	Если МетаданныеИсточника = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИсходныеДанныеТабличнойЧасти = Неопределено Тогда
		// По умолчанию таблица пуста
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ИсходныеДанныеТабличнойЧасти Цикл
		СтрокаНастройки = ВыгружаемыеРеквизиты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНастройки,Строка);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьНастройкиКолонокВыгрузки()


// НАСТРОЙКИ ЗАГРУЗКИ - ТАБЛИЦА ЗАГРУЖАМЫХ РЕКВИЗИТОВ


// Заполняет настройки колонок по умолчанию для справочника
//
&НаСервере
Процедура ЗаполнитьНастройкиКолонокСправочника()
	
	МассивБулево = Новый Массив;
	МассивБулево.Добавить(Тип("Булево"));
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	Если МетаданныеИсточника.ДлинаКода > 0 Тогда
		
		ЗагружаемыйРеквизит = ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Код";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Код";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   =  Истина;
		
		Если МетаданныеИсточника.ТипКода = Метаданные.СвойстваОбъектов.ТипКодаСправочника.Строка Тогда
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(МетаданныеИсточника.ДлинаКода));
		Иначе
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(МетаданныеИсточника.ДлинаКода));
		КонецЕсли;
		
	КонецЕсли;
	
	Если МетаданныеИсточника.ДлинаНаименования > 0 Тогда
		
		ЗагружаемыйРеквизит = ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Наименование";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Наименование";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   =  Истина;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(МетаданныеИсточника.ДлинаНаименования));
		
	КонецЕсли;
	
	ЗагружаемыйРеквизит = ТаблицаЗагружаемыхРеквизитов.Добавить();
	ЗагружаемыйРеквизит.ИмяРеквизита           = "ПометкаУдаления";
	ЗагружаемыйРеквизит.ПредставлениеРеквизита = НСтр("ru = 'Пометка удаления'");
	ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Ложь;
	ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов(МассивБулево);
	
	Если МетаданныеИсточника.Владельцы.Количество() > 0 Тогда
		
		ЗагружаемыйРеквизит = ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Владелец";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Владелец";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   =  Истина;
		
		СтрокаОписанияТипов = "";
			
		Для Каждого ТекВладелец Из МетаданныеИсточника.Владельцы Цикл
			СтрокаОписанияТипов = ?(ПустаяСтрока(СтрокаОписанияТипов),"",СтрокаОписанияТипов + ", ") + ТекВладелец.ПолноеИмя();
		КонецЦикла;
			
		СтрокаОписанияТипов = СтрЗаменить(СтрокаОписанияТипов,".","Ссылка.");
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов(СтрокаОписанияТипов);
		
		
	КонецЕсли;
	
	Если МетаданныеИсточника.Иерархический Тогда
		
		ЗагружаемыйРеквизит = ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "Родитель";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = "Родитель";
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Истина;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов(СтрЗаменить(МетаданныеИсточника.ПолноеИмя(),".","Ссылка."));
		Если МетаданныеИсточника.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
			ЗагружаемыйРеквизит.ВыборГрупп = "Группы";
		КонецЕсли;
		
		ЗагружаемыйРеквизит = ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = "ЭтоГруппа";
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = НСтр("ru = 'Это группа'");
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = Ложь;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Новый ОписаниеТипов(МассивБулево);
	КонецЕсли;
	
	Для Каждого Реквизит Из МетаданныеИсточника.Реквизиты Цикл
		Если НЕ Реквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы Тогда
			ЗагружаемыйРеквизит                        = ТаблицаЗагружаемыхРеквизитов.Добавить();
			ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
			ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
			Если Реквизит.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы Тогда
				ЗагружаемыйРеквизит.ВыборГрупп = "Группы";
			ИначеЕсли  Реквизит.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы Тогда
				ЗагружаемыйРеквизит.ВыборГрупп = НСтр("ru = 'Группы и элементы'");
			КонецЕсли;
			ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = НЕ Реквизит.Индексирование = Метаданные.СвойстваОбъектов.Индексирование.НеИндексировать;
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = МетаданныеИсточника.Реквизиты[ЗагружаемыйРеквизит.ИмяРеквизита].Тип;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Реквизит Из Метаданные.ОбщиеРеквизиты Цикл
		ЗначениеСостава = Реквизит.Состав.Найти(МетаданныеИсточника);
		Если ЗначениеСостава=Неопределено ИЛИ (НЕ ЗначениеСостава.Использование=Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать) Тогда
			Продолжить;
		КонецЕсли;
		ЗагружаемыйРеквизит                        = ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
		Если Реквизит.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы Тогда
			ЗагружаемыйРеквизит.ВыборГрупп = "Группы";
		ИначеЕсли  Реквизит.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы Тогда
			ЗагружаемыйРеквизит.ВыборГрупп = НСтр("ru = 'Группы и элементы'");
		КонецЕсли;
		ЗагружаемыйРеквизит.МожетБытьПолемПоиска   = НЕ Реквизит.Индексирование = Метаданные.СвойстваОбъектов.Индексирование.НеИндексировать;
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Реквизит.Тип;
	КонецЦикла;
	
	ЗагрузкаИзЭлектронныхДокументовВызовСервера.ДополнитьДополнительныеРеквизитыВТаблицуРеквизитов(МетаданныеИсточника, ТаблицаЗагружаемыхРеквизитов, ДополнительныеРеквизитыПоТипуНоменклатуры, ЗагружатьДополнительныеРеквизитыИСведения, ДополнительныеРеквизитыИСведенияТолькоОбщие);
	
	Для Каждого ЗагружаемыйРеквизит Из ТаблицаЗагружаемыхРеквизитов Цикл
		ЗагружаемыйРеквизит.ОписаниеТипов = ЗагружаемыйРеквизит.ДоступноеОписаниеТипов;
	КонецЦикла;
	
	Для Каждого ЗагружаемыйРеквизит Из ТаблицаЗагружаемыхРеквизитов Цикл
		
		СписокВыбора = ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокИменПредставлений(ЗагружаемыйРеквизит);
		ЗагружаемыйРеквизит.ИскатьПо = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоВладельцу(ЗагружаемыйРеквизит, ТаблицаЗагружаемыхРеквизитов);
		ЗагружаемыйРеквизит.СвязьПоВладельцу = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоТипу(ЗагружаемыйРеквизит, ТаблицаЗагружаемыхРеквизитов);
		Если СписокВыбора.Количество() = 0 Тогда
			ЗагружаемыйРеквизит.СвязьПоТипу = "";
			ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 0;
		Иначе
			ЗагружаемыйРеквизит.СвязьПоТипу = СписокВыбора[0].Значение;
			Если СтрНайти(ЗагружаемыйРеквизит.ИмяРеквизита,"3") <> 0 Тогда
				
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 3;
				
			ИначеЕсли СтрНайти(ЗагружаемыйРеквизит.ИмяРеквизита,"2") <> 0 Тогда
				
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 2;
				
			Иначе
				
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 1;
				
			КонецЕсли;
			 
			
		КонецЕсли;
		
		ЗагружаемыйРеквизит.ЗначениеПоУмолчанию = ЗагружаемыйРеквизит.ОписаниеТипов.ПривестиЗначение(Неопределено);
		
		ЗагружаемыйРеквизит.РежимЗагрузки = "Искать";
	КонецЦикла;
	
	
КонецПроцедуры // ЗаполнитьНастройкиКолонокСправочника()

// Заполняет настройки колонок по умолчанию для табличной части
//
&НаСервере
Процедура ЗаполнитьНастройкиКолонокТабличнойЧасти()
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	Если Метаданные.РегистрыСведений.Содержит(МетаданныеИсточника) Тогда
		Для Каждого Реквизит Из МетаданныеИсточника.Измерения Цикл
			ЗагружаемыйРеквизит                        = ТаблицаЗагружаемыхРеквизитов.Добавить();
			ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
			ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Реквизит.Тип;
			ЗагружаемыйРеквизит.ОписаниеТипов          = Реквизит.Тип;
		КонецЦикла;
		Для Каждого Реквизит Из МетаданныеИсточника.Ресурсы Цикл
			ЗагружаемыйРеквизит                        = ТаблицаЗагружаемыхРеквизитов.Добавить();
			ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
			ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
			ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Реквизит.Тип;
			ЗагружаемыйРеквизит.ОписаниеТипов          = Реквизит.Тип;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Реквизит Из МетаданныеИсточника.Реквизиты Цикл
		ЗагружаемыйРеквизит                        = ТаблицаЗагружаемыхРеквизитов.Добавить();
		ЗагружаемыйРеквизит.ИмяРеквизита           = Реквизит.Имя;
		ЗагружаемыйРеквизит.ПредставлениеРеквизита = Реквизит.Представление();
		ЗагружаемыйРеквизит.ДоступноеОписаниеТипов = Реквизит.Тип;
		ЗагружаемыйРеквизит.ОписаниеТипов          = Реквизит.Тип;
	КонецЦикла;
	
	Для Каждого ЗагружаемыйРеквизит Из ТаблицаЗагружаемыхРеквизитов Цикл
		
		СписокВыбора = ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокИменПредставлений(ЗагружаемыйРеквизит);
		ЗагружаемыйРеквизит.ИскатьПо = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоВладельцу(ЗагружаемыйРеквизит, ТаблицаЗагружаемыхРеквизитов);
		ЗагружаемыйРеквизит.СвязьПоВладельцу = ?(СписокВыбора.Количество() = 0, "",СписокВыбора[0].Значение);
		
		СписокВыбора = ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоТипу(ЗагружаемыйРеквизит, ТаблицаЗагружаемыхРеквизитов);
		Если СписокВыбора.Количество() = 0 Тогда
			ЗагружаемыйРеквизит.СвязьПоТипу = "";
			ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 0;
		Иначе
			ЗагружаемыйРеквизит.СвязьПоТипу = СписокВыбора[0].Значение;
			Если СтрНайти(ЗагружаемыйРеквизит.ИмяРеквизита,"3") <> 0 Тогда
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 3;
			ИначеЕсли СтрНайти(ЗагружаемыйРеквизит.ИмяРеквизита,"2") <> 0 Тогда
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 2;
			Иначе
				ЗагружаемыйРеквизит.ЭлементСвязиПоТипу = 1;
			КонецЕсли;
		КонецЕсли;
		
		ЗагружаемыйРеквизит.ЗначениеПоУмолчанию = ЗагружаемыйРеквизит.ОписаниеТипов.ПривестиЗначение(Неопределено);
		ЗагружаемыйРеквизит.РежимЗагрузки = "Искать";
		ЗагружаемыйРеквизит.РежимПоиска = НСтр("ru = 'По равному значению'");
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьНастройкиКолонокТабличнойЧасти()

// Заполняет настройки колонок по умолчанию или по переданным настройкам
//
// Параметры:
//  СтруктураУмолчаний - Структура - Структура настройки колонок по умолчанию.
//
&НаСервере
Процедура ЗаполнитьНастройкиКолонок(СтруктураУмолчаний=Неопределено)
	
	ТаблицаЗагружаемыхРеквизитов.Очистить();
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	Если МетаданныеИсточника = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним оформление из основной формы документа по табличному полю
	Оформление = Неопределено;
	Если НЕ ЗначениеЗаполнено(Объект.ТипПрикладногоОбъекта) Тогда
		Если Метаданные.РегистрыСведений.Содержит(МетаданныеИсточника) Тогда
			ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.РегистрСведений;
			
		ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеИсточника.Родитель()) Тогда
			ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Справочник;
			
		ИначеЕсли Метаданные.Обработки.Содержит(МетаданныеИсточника.Родитель()) Тогда
			ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Обработка;
			
		Иначе
			ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Документ;
		КонецЕсли;
	КонецЕсли;
		
	Если Метаданные.РегистрыСведений.Содержит(МетаданныеИсточника) Тогда
		МетаданныеРодителяИсточника = МетаданныеИсточника;
		ЗаполнитьНастройкиКолонокТабличнойЧасти();
	ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеИсточника) Тогда
		МетаданныеРодителяИсточника = МетаданныеИсточника;
		ЗаполнитьНастройкиКолонокСправочника();
	Иначе
		МетаданныеРодителяИсточника = МетаданныеИсточника.Родитель();
		ЗаполнитьНастройкиКолонокТабличнойЧасти();
	КонецЕсли;
	
	// Перенесем настройки видимости и порядок колонок
	Если Оформление <> Неопределено Тогда
		// Если есть табличное поле, настроенное в основной форме объекта, 
		НомерКолонкиОформления = 0;
		НомерКолонки = 1;
		Для Каждого Колонка Из Оформление.Колонки Цикл
			
			ЗагружаемыйРеквизит = Объект.ТаблицаЗагружаемыхРеквизитов.Найти(Колонка.ДанныеФлажка,"ИмяРеквизита");
			Если ЗагружаемыйРеквизит<>Неопределено Тогда
				Индекс = Объект.ТаблицаЗагружаемыхРеквизитов.Индекс(ЗагружаемыйРеквизит);
				Если Индекс >= НомерКолонкиОформления  Тогда
					
					ЗагружаемыйРеквизит.ШиринаКолонки = 3;
					Объект.ТаблицаЗагружаемыхРеквизитов.Сдвинуть(ЗагружаемыйРеквизит, НомерКолонкиОформления - Индекс);
					
					Если Колонка.Видимость Тогда
						ЗагружаемыйРеквизит.Пометка = Колонка.Видимость;
						ЗагружаемыйРеквизит.НомерКолонки = НомерКолонки;
						НомерКолонки = НомерКолонки + 1;
					КонецЕсли;
					
					НомерКолонкиОформления = НомерКолонкиОформления + 1;
					
				КонецЕсли;
			КонецЕсли;
			
			ЗагружаемыйРеквизит = Объект.ТаблицаЗагружаемыхРеквизитов.Найти(Колонка.Данные,"ИмяРеквизита");
			Если ЗагружаемыйРеквизит<>Неопределено Тогда
				Индекс = Объект.ТаблицаЗагружаемыхРеквизитов.Индекс(ЗагружаемыйРеквизит);
				Если Индекс >= НомерКолонкиОформления Тогда
					ЗагружаемыйРеквизит.ШиринаКолонки = Колонка.Ширина;
					Объект.ТаблицаЗагружаемыхРеквизитов.Сдвинуть(ЗагружаемыйРеквизит, НомерКолонкиОформления - Индекс);
					Если Колонка.Видимость Тогда
						ЗагружаемыйРеквизит.Пометка = Колонка.Видимость;
						ЗагружаемыйРеквизит.НомерКолонки = НомерКолонки;
						НомерКолонки = НомерКолонки + 1;
					КонецЕсли;
					НомерКолонкиОформления = НомерКолонкиОформления + 1;
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли СтруктураУмолчаний <> Неопределено Тогда
		
		НомерКолонкиОформления = 0;
		Для Каждого КлючИЗначение Из СтруктураУмолчаний Цикл
			Колонка = КлючИЗначение.Значение;
			ЗагружаемыйРеквизит = Неопределено;
			ОтборСтрок = Новый Структура("ИмяРеквизита",Колонка.ИмяРеквизита);
			СтрокиТаблицы = ТаблицаЗагружаемыхРеквизитов.НайтиСтроки(ОтборСтрок);
			Если СтрокиТаблицы.Количество() > 0 Тогда
				ЗагружаемыйРеквизит = СтрокиТаблицы[0];
			КонецЕсли;
			
			Если НЕ ЗагружаемыйРеквизит = Неопределено Тогда
				Индекс = ТаблицаЗагружаемыхРеквизитов.Индекс(ЗагружаемыйРеквизит);
				Если Индекс >= НомерКолонкиОформления Тогда
					ЗаполнитьЗначенияСвойств(ЗагружаемыйРеквизит, Колонка);
					
					ТаблицаЗагружаемыхРеквизитов.Сдвинуть(Индекс, НомерКолонкиОформления - Индекс);
					НомерКолонкиОформления = НомерКолонкиОформления + 1;
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	
	Иначе
		НомерКолонки = 1;
		Для Каждого ЗагружаемыйРеквизит Из ТаблицаЗагружаемыхРеквизитов Цикл
			ЗагружаемыйРеквизит.Пометка      = Истина;
			ЗагружаемыйРеквизит.НомерКолонки = НомерКолонки;
			НомерКолонки = НомерКолонки + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьНастройкиКолонок()

// НАСТРОЙКИ ЗАГРУЗКИ

// Процедура заполняет настройки формы на основании табличного документа 
//
// Параметры:
//  Настройки - ТабличныйДокумент - Табличный документ.
//
// Возвращаемое значение:
//  Булево - признак успешности выполнения операции.
//
&НаСервере
Функция ЗаполнитьНастройкиИзТабличногоДокумента(Настройки)
	
	Если ТипЗнч(Настройки)<>Тип("ТабличныйДокумент") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ВерсияОбработки = СокрЛП(Настройки.Область("R1C5").Текст); 
		
		ТекстВосстановленногоРежимаЗагрузки = СокрЛП(Настройки.Область(?(ВерсияОбработки = "1.1","R1","R2") + "C5").Текст);
		Если (ТекстВосстановленногоРежимаЗагрузки<> НСтр("ru = 'в табличную часть'") 
			И ТекстВосстановленногоРежимаЗагрузки<> НСтр("ru = 'в справочник'")) 
			И ТекстВосстановленногоРежимаЗагрузки<>"Х" 
			И ТекстВосстановленногоРежимаЗагрузки<>НСтр("ru = 'в регистр сведений'") Тогда
			
			ВывестиСообщение(НСтр("ru= 'Файл не содержит настройки загрузки данных'"));
			Возврат Ложь;
		КонецЕсли;

		фМетаданныеИсточника = Метаданные.НайтиПоПолномуИмени(Настройки.Область(?(ВерсияОбработки = "1.1","R2","R3") + "C5").Текст);
		Если фМетаданныеИсточника = Неопределено Тогда
			ВывестиСообщение(НСтр("ru= 'Ошибка определения метаданных'"));
			Возврат Ложь;
		КонецЕсли;

		СтруктураФлагов = ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ПолучитьПараметрыПоВерсииОбработкиДляСправочникаНастроек(ВерсияОбработки, Настройки);
		ТекущаяСтрока = СтруктураФлагов.ТекущаяСтрока;
		
		// Структура реквизитов табличной части
		СтруктураУмолчаний = Новый Структура;	

		ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
		ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C2").Текст;
		Пока НЕ ПустаяСтрока(ИмяРеквизита) Цикл
			СтруктураУмолчанияРеквизита = Новый Структура;
			СтруктураУмолчанияРеквизита.Вставить("ИмяРеквизита",ИмяРеквизита);
			СтруктураУмолчанияРеквизита.Вставить("Пометка",НЕ ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст));
			СтруктураУмолчанияРеквизита.Вставить("ПолеПоиска",НЕ ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст));
			
			Типы = Новый Массив;
			ОписаниеТиповСтрокой = Настройки.Область(ТекущаяСтрокаОбласти + "C4").Текст;
			Для к = 1 По СтрЧислоСтрок(ОписаниеТиповСтрокой)  Цикл
				
				КС = Неопределено;КЧ = Неопределено;КД = Неопределено;
				МассивЧастейТипа = ЗагрузкаИзЭлектронныхДокументовВызовСервера.РазложитьСтрокуВМассивПодстрок(НРег(СокрЛП(СтрПолучитьСтроку(ОписаниеТиповСтрокой,к ))), ",");
				Если МассивЧастейТипа.Количество() = 0 Тогда
					Продолжить;
				ИначеЕсли СтрНайти(МассивЧастейТипа[0],".") Тогда
					Тип = Тип(СтрЗаменить(МассивЧастейТипа[0],".","Ссылка."));
				ИначеЕсли МассивЧастейТипа[0] = "строка" Тогда
					Тип = Тип("Строка");
					Если МассивЧастейТипа.Количество() = 2 Тогда
						КС = Новый КвалификаторыСтроки(ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(МассивЧастейТипа[1]),ДопустимаяДлина.Переменная);
					ИначеЕсли МассивЧастейТипа.Количество() = 3 Тогда
						КС = Новый КвалификаторыСтроки(ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(МассивЧастейТипа[1]),ДопустимаяДлина.Фиксированная);
					Иначе
						КС = Новый КвалификаторыСтроки;
					КонецЕсли;
				ИначеЕсли МассивЧастейТипа[0] = "число" Тогда
					Тип = Тип("Число");
					КЧ = Новый КвалификаторыЧисла(ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(МассивЧастейТипа[1]),ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(МассивЧастейТипа[2]),?(МассивЧастейТипа.Количество() = 4, ДопустимыйЗнак.Неотрицательный, ДопустимыйЗнак.Любой));
				ИначеЕсли МассивЧастейТипа[0] = "булево" Тогда
					Тип = Тип("Булево");
				ИначеЕсли МассивЧастейТипа[0] = "дата" Тогда
					Тип = Тип("Дата");
					КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
				ИначеЕсли МассивЧастейТипа[0] = "время" Тогда
					Тип = Тип("Дата");
					КД = Новый КвалификаторыДаты(ЧастиДаты.Время);
				ИначеЕсли МассивЧастейТипа[0] = НСтр("ru = 'дата и время'") Тогда
					Тип = Тип("Дата");
					КД = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
				Иначе
					Продолжить;
				КонецЕсли;
				Типы.Добавить(Тип);
			КонецЦикла;
			ОписаниеТипов = Новый ОписаниеТипов(Типы, КЧ, КС, КД);
			СтруктураУмолчанияРеквизита.Вставить("ОписаниеТипов",ОписаниеТипов);
			
			РежимЗагрузкиРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C5").Текст;
			
			СтруктураУмолчанияРеквизита.Вставить("РежимЗагрузки",РежимЗагрузкиРеквизита);
			СтруктураУмолчанияРеквизита.Вставить("НомерКолонки", Настройки.Область(ТекущаяСтрокаОбласти + "C6").Текст);
			ЗначениеПоУмолчанию = Настройки.Область(ТекущаяСтрокаОбласти + "C7").Текст;
			НастройкаЗагрузки = Настройки.Область(ТекущаяСтрокаОбласти + "C13").Текст;
			ЭтоДополнительныйРеквизит = ?(ВерсияОбработки>="1.7", ЗначениеЗаполнено(Настройки.Область(ТекущаяСтрокаОбласти + "C14").Текст), Ложь);
			ЭтоСведение				  = ?(ВерсияОбработки>="1.7", ЗначениеЗаполнено(Настройки.Область(ТекущаяСтрокаОбласти + "C16").Текст), Ложь);
			СсылкаРеквизита = ?(ВерсияОбработки>="1.7", Настройки.Область(ТекущаяСтрокаОбласти + "C15").Текст, "");
			СтруктураУмолчанияРеквизита.Вставить("ЗначениеПоУмолчанию",?(ПустаяСтрока(ЗначениеПоУмолчанию), ОписаниеТипов.ПривестиЗначение(Неопределено), ЗначениеИзСтрокиВнутр(ЗначениеПоУмолчанию)));
			СтруктураУмолчанияРеквизита.Вставить("СсылкаРеквизита",?(ПустаяСтрока(СсылкаРеквизита), ОписаниеТипов.ПривестиЗначение(Неопределено), ЗначениеИзСтрокиВнутр(СсылкаРеквизита)));
			СтруктураУмолчанияРеквизита.Вставить("НастройкаЗагрузки",?(ПустаяСтрока(НастройкаЗагрузки), Справочники.НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПустаяСсылка(), ЗначениеИзСтрокиВнутр(НастройкаЗагрузки)));
			СтруктураУмолчанияРеквизита.Вставить("ЭтоДополнительныйРеквизит",ЭтоДополнительныйРеквизит);
			СтруктураУмолчанияРеквизита.Вставить("ЭтоСведение",ЭтоСведение);
			Если РежимЗагрузкиРеквизита = "Вычислять" Тогда
				СтруктураУмолчанияРеквизита.Вставить("Выражение",Настройки.Область(ТекущаяСтрокаОбласти + "C8").Текст);
			Иначе
				СтруктураУмолчанияРеквизита.Вставить("ИскатьПо",Настройки.Область(ТекущаяСтрокаОбласти + "C8").Текст);
				
				СвязьПоВладельцу   = Настройки.Область(ТекущаяСтрокаОбласти + "C9").Текст;
				СтруктураУмолчанияРеквизита.Вставить("СвязьПоВладельцу",?(Лев(СвязьПоВладельцу,1) = "{",ЗначениеИзСтрокиВнутр(СвязьПоВладельцу), СвязьПоВладельцу));
				
				СвязьПоТипу        = Настройки.Область(ТекущаяСтрокаОбласти + "C10").Текст;
				СтруктураУмолчанияРеквизита.Вставить("СвязьПоТипу",?(Лев(СвязьПоТипу,1) = "{",ЗначениеИзСтрокиВнутр(СвязьПоТипу), СвязьПоТипу));
				
				СтруктураУмолчанияРеквизита.Вставить("ЭлементСвязиПоТипу",ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПривестиКЧислу(Настройки.Область(ТекущаяСтрокаОбласти + "C11").Текст));
			КонецЕсли;
			СтруктураУмолчанияРеквизита.Вставить("РежимПоиска",?(ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбласти + "C12").Текст), НСтр("ru = 'По равному значению'"),Настройки.Область(ТекущаяСтрокаОбласти + "C12").Текст));
			
			// Добавим в структуру реквизитов структуру реквизита
			СтруктураУмолчаний.Вставить(ИмяРеквизита,СтруктураУмолчанияРеквизита);
			
			ТекущаяСтрока = ТекущаяСтрока + 1;
			ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
			ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C2").Текст;
		КонецЦикла;
		
		фПередЗаписьюОбъекта = Настройки.Область("R" + Формат(ТекущаяСтрока + 2, "ЧГ=") + "C3").Текст;
		фПриЗаписиОбъекта    = Настройки.Область("R" + Формат(ТекущаяСтрока + 3, "ЧГ=") + "C3").Текст;
		фПослеДобавленияСтроки = Настройки.Область("R" + Формат(ТекущаяСтрока + 4, "ЧГ=") + "C3").Текст;
	Исключение
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1'"), ОписаниеОшибки());
		ВывестиСообщение(ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	// Принимаем файл как корректный, переписываем значения реквизитов значениями из промежуточных переменных.
	Если Объект.ВариантИспользованияНастройки<>Перечисления.ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
		Если ЗначениеЗаполнено(Объект.ВариантИспользованияНастройки) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Вариант использования настройки изменен на %1'"), Перечисления.ВариантыИспользованияНастройки.ЗагрузкаДанных);
			ВывестиСообщение(ТекстОшибки);
		КонецЕсли;
		Объект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ЗагрузкаДанных;
	КонецЕсли;
	
	Если МетаданныеИсточника<>фМетаданныеИсточника Тогда
		Если МетаданныеИсточника<>Неопределено Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Объект и/или табличная часть изменена %1 -> %2'"), МетаданныеИсточника.ПолноеИмя(), фМетаданныеИсточника.ПолноеИмя());
			ВывестиСообщение(ТекстОшибки);
		КонецЕсли;
		
		// Заполним служебную переменную
		МетаданныеИсточника = фМетаданныеИсточника;
		Если МетаданныеИсточника = Неопределено Тогда
			АдресХранилищаМетаданныеИсточника = "";
		Иначе
			АдресХранилищаМетаданныеИсточника = ПоместитьВоВременноеХранилище(МетаданныеИсточника.ПолноеИмя(), УникальныйИдентификатор);
		КонецЕсли;
		
		// Заполним реквизиты справочника настроек
		Если Метаданные.РегистрыСведений.Содержит(фМетаданныеИсточника) Тогда
			// это регистр сведений
			Объект.ТипПрикладногоОбъекта           = Перечисления.ТипыПрикладныхОбъектов.РегистрСведений;
			Объект.ИмяПрикладногоОбъекта           = фМетаданныеИсточника.Имя;
			Объект.ИмяТабличнойЧасти               = "";
			Объект.ПредставлениеПрикладногоОбъекта = фМетаданныеИсточника.Представление();
			Объект.ПредставлениеТабличнойЧасти     = "";
		ИначеЕсли Метаданные.Справочники.Содержит(фМетаданныеИсточника) Тогда
			// это справочник
			Объект.ТипПрикладногоОбъекта           = Перечисления.ТипыПрикладныхОбъектов.Справочник;
			Объект.ИмяПрикладногоОбъекта           = фМетаданныеИсточника.Имя;
			Объект.ИмяТабличнойЧасти               = "";
			Объект.ПредставлениеПрикладногоОбъекта = фМетаданныеИсточника.Представление();
			Объект.ПредставлениеТабличнойЧасти     = "";
		Иначе
			// это ТЧ, только надо разобраться, чья
			Если Метаданные.Документы.Содержит(фМетаданныеИсточника.Родитель()) Тогда
				Объект.ТипПрикладногоОбъекта           = Перечисления.ТипыПрикладныхОбъектов.Документ;
			ИначеЕсли Метаданные.Справочники.Содержит(фМетаданныеИсточника.Родитель()) Тогда
				Объект.ТипПрикладногоОбъекта           = Перечисления.ТипыПрикладныхОбъектов.Справочник;
			ИначеЕсли Метаданные.Обработки.Содержит(фМетаданныеИсточника.Родитель()) Тогда
				Объект.ТипПрикладногоОбъекта           = Перечисления.ТипыПрикладныхОбъектов.Обработка;
			КонецЕсли;
			Объект.ИмяПрикладногоОбъекта           = фМетаданныеИсточника.Родитель().Имя;
			Объект.ИмяТабличнойЧасти               = фМетаданныеИсточника.Имя;
			Объект.ПредставлениеПрикладногоОбъекта = фМетаданныеИсточника.Родитель().Представление();
			Объект.ПредставлениеТабличнойЧасти     = фМетаданныеИсточника.Представление();
		КонецЕсли;
	КонецЕсли;
	
	// Перезаполним списки выбора элементов форм
	ЗаполнитьСписокТиповПрикладногоОбъекта();
	ЗаполнитьСписокПрикладныхОбъектов();
	ЗаполнитьСписокТабличныхЧастей();
	
	// Заполним реквизиты формы
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,		СтруктураФлагов); 
	Если НЕ ЗначениеЗаполнено(СтруктураФлагов.ДополнительныеРеквизитыПоТипуНоменклатурыИзНастроек) Тогда
		ДополнительныеРеквизитыПоТипуНоменклатуры.Очистить();
	Иначе
		ДополнительныеРеквизитыПоТипуНоменклатуры = СтруктураФлагов.ДополнительныеРеквизитыПоТипуНоменклатурыИзНастроек.Скопировать();
	КонецЕсли;
	
	// Отдельно заполним флаг, он реквизит объекта
	Объект.НеСоздаватьНовыхЭлементов = СтруктураФлагов.НеСоздаватьНовыхЭлементов;
	
	Попытка
		ОбработкаПреобразования = Справочники.ДополнительныеОтчетыИОбработки.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураФлагов.ИдентификаторОбработкиЗагрузкиИзXML));
	Исключение
	КонецПопытки;
	
	ПередЗаписьюОбъекта   = фПередЗаписьюОбъекта;
	ПриЗаписиОбъекта      = фПриЗаписиОбъекта;
	ПослеДобавленияСтроки = фПослеДобавленияСтроки;
	
	// Заполним список реквизитов ТЧ
	ЗаполнитьНастройкиКолонок(СтруктураУмолчаний);
	
	Возврат Истина;
	
КонецФункции // ЗаполнитьНастройкиИзТабличногоДокумента()

// Процедура создает новый табличный документ на основании данных формы
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//  ТабличныйДокумент - Настройки собранные в табличный документ для хранения в реквизите "НастройкиЗагрузкиВыгрузки"
//  Неопределено      - Возвращается если не указаны все необходимые данные.
//
&НаСервере
Функция ЗаполнитьТабличныйДокументИзНастроек()
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	Если МетаданныеИсточника = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МетаданныеИсточникаИзСправочника", МетаданныеИсточника);
	Если Метаданные.Справочники.Содержит(МетаданныеИсточника) Тогда
		РежимЗагрузки                             = 0;
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(МетаданныеИсточника) Тогда
		РежимЗагрузки                             = 2;
	Иначе
		РежимЗагрузки                             = 1;	
	КонецЕсли;
	СтруктураПараметров.Вставить("РежимЗагрузки", 								РежимЗагрузки);
	СтруктураПараметров.Вставить("НеСоздаватьНовыхЭлементов", 					Объект.НеСоздаватьНовыхЭлементов);
	СтруктураПараметров.Вставить("ЗамещатьСуществующиеЗаписи", 					Ложь);
	СтруктураПараметров.Вставить("РучнаяНумерацияКолонокТабличногоДокумента", 	РучнаяНумерацияКолонокТабличногоДокумента);
	СтруктураПараметров.Вставить("ПерваяСтрокаДанныхТабличногоДокумента", 		ПерваяСтрокаДанныхТабличногоДокумента);
	СтруктураПараметров.Вставить("ДействиеСЗагружаемымФайлом", 					ДействиеСЗагружаемымФайлом);
	СтруктураПараметров.Вставить("флПоискПоПрайсуПоставщика", 					флПоискПоПрайсуПоставщика);
	СтруктураПараметров.Вставить("КаталогАрхиваЗагруженныхФайлов", 				КаталогАрхиваЗагруженныхФайлов);
	СтруктураПараметров.Вставить("Табуляция", 									Табуляция);
	СтруктураПараметров.Вставить("Кодировка", 									Кодировка);
	СтруктураПараметров.Вставить("ИмяТаблицы", 									ИмяТаблицы);
	СтруктураПараметров.Вставить("НеОбновлятьСуществующиеЭлементы", 			НеОбновлятьСуществующиеЭлементы);
	СтруктураПараметров.Вставить("ИспользоватьВнешнийМодульПреобразованияФайла", ИспользоватьВнешнийМодульПреобразованияФайла);
	СтруктураПараметров.Вставить("ОбработкаПреобразования", 					ОбработкаПреобразования);
	СтруктураПараметров.Вставить("ТаблицаЗагружаемыхРеквизитов", 				ТаблицаЗагружаемыхРеквизитов.Выгрузить());
	СтруктураПараметров.Вставить("ПередЗаписьюОбъекта", 						ПередЗаписьюОбъекта);
	СтруктураПараметров.Вставить("ПриЗаписиОбъекта", 							ПриЗаписиОбъекта);
	СтруктураПараметров.Вставить("ПослеДобавленияСтроки", 						ПослеДобавленияСтроки);
	СтруктураПараметров.Вставить("ЗагружатьДополнительныеРеквизитыИСведения",	ЗагружатьДополнительныеРеквизитыИСведения);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыИСведенияТолькоОбщие",	ДополнительныеРеквизитыИСведенияТолькоОбщие);
	СтруктураПараметров.Вставить("ДополнительныеРеквизитыПоТипуНоменклатуры",	ДополнительныеРеквизитыПоТипуНоменклатуры);
	
	Возврат ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьНастройки(СтруктураПараметров);
	

КонецФункции // ЗаполнитьТабличныйДокументИзНастроек()

// Заполняет список вариантами использование, и добавляет соответствующие картинки
//
&НаСервере
Процедура ЗаполнитьСписокВариантовИспользования()
	
	Список = Элементы.ВариантИспользованияНастройки.СписокВыбора;
	Список.Очистить();
	Список.Добавить(Перечисления.ВариантыИспользованияНастройки.ВыгрузкаДанных);
	Список.Добавить(Перечисления.ВариантыИспользованияНастройки.ЗагрузкаДанных);
	
КонецПроцедуры

// Заполняет список доступных типов прикладных объектов
//
&НаСервере
Процедура ЗаполнитьСписокТиповПрикладногоОбъекта()
	
	Список = Элементы.ТипПрикладногоОбъекта.СписокВыбора;
	Список.Очистить();
	
	Если Объект.ВариантИспользованияНастройки=Перечисления.ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		Список.Добавить(Перечисления.ТипыПрикладныхОбъектов.Справочник);
		Список.Добавить(Перечисления.ТипыПрикладныхОбъектов.Документ);
	ИначеЕсли Объект.ВариантИспользованияНастройки=Перечисления.ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
		Список.Добавить(Перечисления.ТипыПрикладныхОбъектов.Справочник);
		Список.Добавить(Перечисления.ТипыПрикладныхОбъектов.Документ);
		Список.Добавить(Перечисления.ТипыПрикладныхОбъектов.РегистрСведений);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список доступных документов и справочников
//
&НаСервере
Процедура ЗаполнитьСписокПрикладныхОбъектов()
	
	Элементы.ИмяПрикладногоОбъекта.СписокВыбора.Очистить();
	Если Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Справочник Тогда
		// Используем поэлементное добавление, т.к. при открытии сохраненного
		// элемента справочника элемент управления не позиционируется.
		Для Каждого СтрокаСписка Из СписокСправочниковКЕШ Цикл
			Элементы.ИмяПрикладногоОбъекта.СписокВыбора.Добавить(СтрокаСписка.Значение,СтрокаСписка.Представление,,СтрокаСписка.Картинка);
		КонецЦикла;
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Документ Тогда
		Для Каждого СтрокаСписка Из СписокДокументовКЕШ Цикл
			Элементы.ИмяПрикладногоОбъекта.СписокВыбора.Добавить(СтрокаСписка.Значение,СтрокаСписка.Представление,,СтрокаСписка.Картинка);
		КонецЦикла;
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Обработка Тогда
		Для Каждого СтрокаСписка Из СписокОбработокКЕШ Цикл
			Элементы.ИмяПрикладногоОбъекта.СписокВыбора.Добавить(СтрокаСписка.Значение,СтрокаСписка.Представление,,СтрокаСписка.Картинка);
		КонецЦикла;
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.РегистрСведений Тогда
		Для Каждого СтрокаСписка Из СписокРегистровСведенийКЕШ Цикл
			Элементы.ИмяПрикладногоОбъекта.СписокВыбора.Добавить(СтрокаСписка.Значение,СтрокаСписка.Представление,,СтрокаСписка.Картинка);
		КонецЦикла;
	КонецЕсли;
	Элементы.ИмяПрикладногоОбъекта.СписокВыбора.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	
КонецПроцедуры

// Заполняет список доступных табличных частей документов
//
&НаСервере
Процедура ЗаполнитьСписокТабличныхЧастей()
	
	СписокТабличныхЧастей = Элементы.ИмяТабличнойЧасти.СписокВыбора;
	СписокТабличныхЧастей.Очистить();
	
	Если Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Документ Тогда
		ОбъектМетаданных = Метаданные.Документы.Найти(Объект.ИмяПрикладногоОбъекта);
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Обработка Тогда
		ОбъектМетаданных = Метаданные.Обработки.Найти(Объект.ИмяПрикладногоОбъекта);
	ИначеЕсли Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Справочник Тогда
		ОбъектМетаданных = Метаданные.Справочники.Найти(Объект.ИмяПрикладногоОбъекта);
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ОбъектМетаданных<>Неопределено Тогда
		Для Каждого ТабличнаяЧасть Из ОбъектМетаданных.ТабличныеЧасти Цикл
			СписокТабличныхЧастей.Добавить(ТабличнаяЧасть.Имя, ТабличнаяЧасть.Представление());
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет списки выбора для реквизитов табличной части
//
&НаСервере
Функция ЗаполнитьСпискиВыбораНаСервере(ТекущаяСтрокаТаблицы, ТекущийЭлементИмя, РежимЗагрузкиИскать)
	
	СписокВыбора = Новый СписокЗначений;
	ТекущиеДанные = ТаблицаЗагружаемыхРеквизитов[ТекущаяСтрокаТаблицы];
	
	Если ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовИскатьПо" Тогда
		
		СписокВыбора = ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокИменПредставлений(ТекущиеДанные);
		
	ИначеЕсли ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовСвязьПоВладельцу" Тогда
		
		СписокВыбора = ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоВладельцу(ТекущиеДанные, ТаблицаЗагружаемыхРеквизитов);
		
	ИначеЕсли ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовСвязьПоТипу" Тогда
		
		СписокВыбора = ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПолучитьСписокСвязейПоТипу(ТекущиеДанные, ТаблицаЗагружаемыхРеквизитов);
		
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ЗаполнитьСпискиВыбора()
	
	ИндексТекущейСтроки = ТаблицаЗагружаемыхРеквизитов.Индекс(Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные);
	ТекущийЭлементИмя = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущийЭлемент.Имя;
	РежимЗагрузкиИскать = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные.РежимЗагрузки = "Искать";
	
	СписокВыбора = ЗаполнитьСпискиВыбораНаСервере(ИндексТекущейСтроки, ТекущийЭлементИмя, РежимЗагрузкиИскать);
	
	Для Каждого СтрокаСписка Из СписокВыбора Цикл
		Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущийЭлемент.СписокВыбора.Добавить(СтрокаСписка.Значение, СтрокаСписка.Представление);
	КонецЦикла;
	
КонецПроцедуры

// Функция получает настройку из хранилища
//
&НаСервере
Функция ПолучитьНастройкуИзХранилища(НастройкиСсылка)
	
	ОбъектНастройка = НастройкиСсылка.ПолучитьОбъект();
	
	Настройки = ОбъектНастройка.НастройкиЗагрузкиВыгрузки.Получить();
	
	Возврат Настройки;
	
КонецФункции

// Функция получения строки фильтра для диалога выбора файла
//
&НаСервере
Функция ПолучитьСтрокуФильтраДляДиалогаВыбораФайла()
	
	Фильтр = "";
	Если Объект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
		Фильтр = "Файлы настроек загрузки(*.mxlz)|*.mxlz|Все файлы (*.*)|*.*|";
	ИначеЕсли Объект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		Фильтр = "Файлы настроек выгрузки(*.mxla)|*.mxla|Все файлы (*.*)|*.*|";
	КонецЕсли;
	
	Возврат Фильтр;
	
КонецФункции

// Функция получает настройки из хранилища
//
&НаСервере
Функция ПолучитьНастройкиИзХранилища()
	
	Попытка
		НастройкаОбъект = Объект.Ссылка.ПолучитьОбъект();
	Исключение
		НастройкаОбъект = Неопределено;
	КонецПопытки;
	
	Если НастройкаОбъект = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Настройки = НастройкаОбъект.НастройкиЗагрузкиВыгрузки.Получить();
	
	Возврат Настройки;
	
КонецФункции

// Функция выполняет загрузку настроек из файла
//
&НаСервере
Функция ВыполнитьЗагрузкуНастроек(Расширение, ПолноеИмяФайлаНастройки, АдресВоВременномХранилище)
	
	Настройки = Новый ТабличныйДокумент;
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	ВременныйФайл = КаталогВременныхФайлов() + "testUASettings.mxlz";
	ДанныеФайла.Записать(ВременныйФайл);
	
	Попытка
		Настройки.Прочитать(ВременныйФайл);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1'"), ИнформацияОбОшибке.Причина.Описание);
		ВывестиСообщение(ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	Если Расширение=".mxlz" Тогда
		Расширение = Перечисления.ВариантыИспользованияНастройки.ЗагрузкаДанных;
	ИначеЕсли Расширение=".mxla" Тогда
		Расширение = Перечисления.ВариантыИспользованияНастройки.ВыгрузкаДанных;
	КонецЕсли;
	
	ЗагруженоУспешно = Ложь;
	Если Расширение = Перечисления.ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
		ЗагруженоУспешно = ЗаполнитьНастройкиИзТабличногоДокумента(Настройки);
	ИначеЕсли Расширение = Перечисления.ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		ЗагруженоУспешно = ЗаполнитьНастройкиВыгрузкиИзТабличногоДокумента(Настройки);
	КонецЕсли;
	
	Возврат ЗагруженоУспешно;
	
КонецФункции

// Процедура сохраняет настройки в хранилище
//
// Параметры
//  <ТекущийОбъект>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>.
//
&НаСервере
Процедура СохранитьНастройкиВХранилище(ТекущийОбъект, Отказ=Ложь)
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	Если МетаданныеИсточника = Неопределено Тогда
		// не заполнены все реквизиты определяющие метаданные
		Возврат;
	КонецЕсли;
	
	// Проверка настройки загрузки
	Если ТекущийОбъект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
		
		Если ДействиеСЗагружаемымФайлом<>0 Тогда
			КаталогАрхиваЗагруженныхФайлов = "";
		КонецЕсли;
		
		Если ИспользоватьВнешнийМодульПреобразованияФайла И НЕ ЗначениеЗаполнено(ОбработкаПреобразования) Тогда
			ВывестиСообщение(НСтр("ru= 'Не указана обработка преобразования файла в табличный документ.'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если ДействиеСЗагружаемымФайлом = 0 И НЕ ЗначениеЗаполнено(КаталогАрхиваЗагруженныхФайлов) Тогда
			ВывестиСообщение(НСтр("ru= 'Не указан каталог архива загруженных файлов.'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		ТекущийОбъект.НастройкиЗагрузкиВыгрузки = Новый ХранилищеЗначения(ЗаполнитьТабличныйДокументИзНастроек());
		
	// Проверка настройки выгрузки
	ИначеЕсли ТекущийОбъект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		
		Если ВыгружаемыеРеквизиты.Количество()=0  Тогда
			ВывестиСообщение(НСтр("ru= 'Не указаны реквизиты для выгрузки'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Для Каждого Строка Из ВыгружаемыеРеквизиты Цикл
			ТекстОшибки = "";
			Если ПустаяСтрока(Строка.ТипПоля) Тогда
				ТекстОшибки = ТекстОшибки+", " + НСтр("ru = 'Тип поля'");
			КонецЕсли;
			Если ПустаяСтрока(Строка.Представление) Тогда
				ТекстОшибки = ТекстОшибки+", " + НСтр("ru = 'Поле объекта / выражение'");
			КонецЕсли;
			Если ПустаяСтрока(Строка.ПолеДБФ) Тогда
				ТекстОшибки = ТекстОшибки+", Поле DBF";
			КонецЕсли;
			Если ПустаяСтрока(Строка.Тип) Тогда
				ТекстОшибки = ТекстОшибки+", Тип";
			ИначеЕсли (Строка.Тип = "S" ИЛИ Строка.Тип = "N") И Строка.Длина=0 Тогда
				ТекстОшибки = ТекстОшибки+", Длина";
			КонецЕсли;
			Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Строка %1 не заполнена колонка: %2'"), Строка(ВыгружаемыеРеквизиты.Индекс(Строка)+1), Сред(ТекстОшибки,3));
				ВывестиСообщение(ТекстОшибки);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		ТекущийОбъект.НастройкиЗагрузкиВыгрузки = Новый ХранилищеЗначения(ЗаполнитьТабличныйДокументИзНастроекВыгрузки());
		
	КонецЕсли;
	
КонецПроцедуры // СохранитьНастройкиВХранилище()


// НАСТРОЙКИ ЗАГРУЗКИ - ТАБЛИЦА ЗАГРУЖАМЫХ РЕКВИЗИТОВ

// Процедура - обработчик события "ПередНачаломИзменения"  табличного поля "ТаблицаЗагружаемыхРеквизитов".
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовПередНачаломИзменения(Элемент, Отказ)
	
	ТекущийЭлементИмя = Элемент.ТекущийЭлемент.Имя;
	
	Если ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовИскатьПо"
	 ИЛИ ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовСвязьПоВладельцу"
	 ИЛИ ТекущийЭлементИмя = "ТаблицаЗагружаемыхРеквизитовСвязьПоТипу" Тогда
		Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
		ПодключитьОбработчикОжидания("Подключаемый_ЗаполнитьСпискиВыбора", 0.1, Истина);
	КонецЕсли;
	
    Элементы.ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчанию.КнопкаВыбора = НЕ ТипЗНЧ(Элемент.ТекущиеДанные.ЗначениеПоУмолчанию) = Тип("Строка");
	
КонецПроцедуры // ТаблицаЗагружаемыхРеквизитовПередНачаломИзменения()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомСправочникаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомСправочникаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	МетаданныеИсточника = ПолучитьМетаданныеИсточникаИзВременногоХранилища();
	
	ДоступностьЭлементаФормы = ЗначениеЗаполнено(Объект.ИмяПрикладногоОбъекта) И (Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Документ);
	Элементы.ИмяТабличнойЧасти.Доступность = ДоступностьЭлементаФормы;
	Элементы.ИмяТабличнойЧасти.АвтоОтметкаНезаполненного = ДоступностьЭлементаФормы;
	Элементы.ИмяТабличнойЧасти.ОтметкаНезаполненного = НЕ ЗначениеЗаполнено(Объект.ИмяТабличнойЧасти) И (Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Документ);
	
	ДоступностьЭлементаФормы = ЗначениеЗаполнено(Объект.ТипПрикладногоОбъекта);
	Элементы.ИмяПрикладногоОбъекта.Доступность = ДоступностьЭлементаФормы;
	
	ДоступностьЭлементаФормы = ЗначениеЗаполнено(Объект.ВариантИспользованияНастройки);
	Элементы.ТипПрикладногоОбъекта.Доступность = ДоступностьЭлементаФормы;
	
	НастройкаДоступна = МетаданныеИсточника <> Неопределено;
	
	Если Объект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		
		Элементы.ГруппаНастройкиЗагрузки.Видимость = Ложь;
		Элементы.ГруппаНастройкиВыгрузки.Видимость = Истина;
		Элементы.ГруппаНастройкиВыгрузки.Доступность = НастройкаДоступна;
		
		Если НастройкаДоступна Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНастройкиВыгрузки;
		Иначе
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаКонтрагенты;
		КонецЕсли;
		
		Элементы.ГруппаЗагрузкаДопРеквизитов.Видимость	  = Ложь;

	ИначеЕсли Объект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
		
		Элементы.ГруппаНастройкиВыгрузки.Видимость = Ложь;
		Элементы.ГруппаНастройкиЗагрузки.Видимость = Истина;
		Элементы.ГруппаНастройкиЗагрузки.Доступность = НастройкаДоступна; 
		
		Если НастройкаДоступна Тогда
			Элементы.ТаблицаЗагружаемыхРеквизитовПеренумероватьКолонки.Доступность                 = РучнаяНумерацияКолонокТабличногоДокумента;
			Элементы.ТаблицаЗагружаемыхРеквизитовНомерКолонки.Видимость                            = РучнаяНумерацияКолонокТабличногоДокумента;
			Элементы.ТаблицаЗагружаемыхРеквизитовРучнаяНумерацияКолонокТабличногоДокумента.Пометка = РучнаяНумерацияКолонокТабличногоДокумента;
			
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНастройкиЗагрузки;
		Иначе
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаКонтрагенты;
		КонецЕсли;
		
		Элементы.ТаблицаЗагружаемыхРеквизитовПолеПоиска.Видимость         = Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Справочник;
		
		Элементы.НеСоздаватьНовыхЭлементов. Видимость      = Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Справочник;
		Элементы.НеОбновлятьСуществующиеЭлементы.Видимость = Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Справочник;
		Элементы.флПоискПоПрайсуПоставщика.Видимость	   = Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Документ;
		Элементы.ТаблицаЗагружаемыхРеквизитовРежимПоиска.Видимость         = НЕ (Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Справочник);
		
		ЭтоЗагрузкаВНоменклатуру 	= МетаданныеИсточника<>Неопределено И Метаданные.Справочники.Найти(МетаданныеИсточника.Имя)<>Неопределено И МетаданныеИсточника.Имя = "Номенклатура";
		ЭтоЗагрузкаХарактеристик 	= МетаданныеИсточника<>Неопределено И Метаданные.Справочники.Найти(МетаданныеИсточника.Имя)<>Неопределено И МетаданныеИсточника.Имя = "ХарактеристикиНоменклатуры";
		
		Элементы.ГруппаЗагрузкаДопРеквизитов.Видимость	  = ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") И (ЭтоЗагрузкаВНоменклатуру ИЛИ ЭтоЗагрузкаХарактеристик);
		Элементы.ГруппаОтборРеквизитов.Видимость		  = ЗагружатьДополнительныеРеквизитыИСведения;
		
		Элементы.ДополнительныеРеквизитыПоТипуНоменклатуры.Доступность = НЕ ДополнительныеРеквизитыИСведенияТолькоОбщие;
		
	Иначе
		
		Элементы.ГруппаНастройкиВыгрузки.Видимость = Ложь;
		Элементы.ГруппаНастройкиЗагрузки.Видимость = Ложь;
		
	КонецЕсли;
	
	Элементы.КаталогАрхиваЗагруженныхФайлов.Доступность = ДействиеСЗагружаемымФайлом = 0;
	Элементы.КаталогАрхиваЗагруженныхФайлов.АвтоОтметкаНезаполненного = ДействиеСЗагружаемымФайлом = 0;
	
	НастроитьДоступностьПоляОбработки();
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
		
	// Вызываем общий обработчик действия.
	УправлениеДиалогомСправочникаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаЗагружаемыхРеквизитовПолеПоиска.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаЗагружаемыхРеквизитов.МожетБытьПолемПоиска");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаЗагружаемыхРеквизитов.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаЗагружаемыхРеквизитов.ПодсвечиватьСтроку");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаЗагружаемыхРеквизитов.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаЗагружаемыхРеквизитов.ЭтоДополнительныйРеквизит");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.КожаноКоричневый);
		
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Подключаемый обработчик, вызывающий общую процедуру для обработки команды панели действий.
// 
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомСправочникаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПриСозданииНаСервере" формы
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	ЗаполнитьСписокВариантовИспользования();
	
	// Установим ускоряющую переменную модуля
	МетаданныеИсточника = Справочники.НастройкиЗагрузкиДанныхИзТабличногоДокумента.ПолучитьМетаданныеИсточника(Объект);
	Если НЕ МетаданныеИсточника=Неопределено Тогда
		АдресХранилищаМетаданныеИсточника = ПоместитьВоВременноеХранилище(МетаданныеИсточника.ПолноеИмя(), УникальныйИдентификатор);
	Иначе
		АдресХранилищаМетаданныеИсточника = "";
	КонецЕсли;
	
	// Форма открыта для сохранения настроек, заполним реквизиты объекта из параметров
	ФормаОткрытаДляСохранения = Ложь;
	Если ЗначениеЗаполнено(Параметры.ВариантИспользованияНастройки) Тогда
		Объект.ВариантИспользованияНастройки = Параметры.ВариантИспользованияНастройки;
		ФормаОткрытаДляСохранения = Истина;
	КонецЕсли;
	
	Попытка
		Если ЗначениеЗаполнено(Параметры.НастройкиЗагрузкиВыгрузки) Тогда
			Настройки = Параметры.НастройкиЗагрузкиВыгрузки.Получить();
		ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Настройки = ПолучитьНастройкуИзХранилища(Объект.Ссылка);
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Описание = "";
		Пока ИнформацияОбОшибке.Причина<>Неопределено Цикл
			ИнформацияОбОшибке = ИнформацияОбОшибке.Причина; // Пропускаем первую строку с текстом модуля
			Описание  = Описание+Описание+ИнформацияОбОшибке.Описание;
		КонецЦикла;
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'Ошибка получения настроек: %1'"), Описание);
		ВывестиСообщение(ТекстОшибки);
	КонецПопытки;
	
	Если Настройки = Неопределено Тогда
		
		// Для загрузки
		ЗагрузкаИзЭлектронныхДокументовОтраслеваяСпецификаСервер.ЗаполнитьНастройкиКолонокТабличнойЧастиДопПараметровСправочникаНастроек(, ТаблицаДополнительныхПараметров);
		
		ПерваяСтрокаДанныхТабличногоДокумента = 1;
		ДействиеСЗагружаемымФайлом = 2;
		
		// Для выгрузки
		Кодировка = "DOS";
		ФорматВыходногоФайла = "DBF";
		
		// Если это новый элемент, то значения отбора попадают в поля, отследим последовательность
		// т.к. может случится ситуация, когда установлена табличная часть, но не установлен объект.
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Если ЗначениеЗаполнено(Объект.ТипПрикладногоОбъекта) 
				И НЕ ЗначениеЗаполнено(Объект.ВариантИспользованияНастройки) Тогда
				Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.ПустаяСсылка();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ИмяПрикладногоОбъекта) И НЕ ЗначениеЗаполнено(Объект.ТипПрикладногоОбъекта) Тогда
				ИмяПрикладногоОбъекта = "";
				ПредставлениеПрикладногоОбъекта = "";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ИмяТабличнойЧасти) И НЕ ЗначениеЗаполнено(Объект.ИмяПрикладногоОбъекта) Тогда
				ИмяТабличнойЧасти = "";
				ПредставлениеТабличнойЧасти = "";
			КонецЕсли;
			
			// Установим вариант использования в соответствии с группой которой настройка принадлежит
			// при интерактивном добавлении элемента справочника (без отбора, при отборе).
			Если НЕ ЗначениеЗаполнено(Объект.ВариантИспользованияНастройки) Тогда
				ДанныйОбъект = РеквизитФормыВЗначение("Объект", Тип("СправочникОбъект.НастройкиЗагрузкиДанныхИзТабличногоДокумента"));
				Если ДанныйОбъект.ПринадлежитЭлементу(Справочники.НастройкиЗагрузкиДанныхИзТабличногоДокумента.ГруппаНастроекВыгрузки) Тогда
					Объект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ВыгрузкаДанных;
				Иначе
					Объект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ЗагрузкаДанных;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		// Общее
		// При создании нового элемента с установленным отбором (например при добавление с использованием формы мастера)
		// заполняются только скрытые поля необходимо заполнить и представления.
		УстановитьИсточник(НЕ ЗначениеЗаполнено(Объект.Ссылка));
	Иначе
		Если Объект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
			// Заполним список реквизитов ТЧ
			ЗаполнитьНастройкиИзТабличногоДокумента(Настройки);
		ИначеЕсли Объект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
			ЗаполнитьНастройкиВыгрузкиИзТабличногоДокумента(Настройки);
		КонецЕсли;
		Если ФормаОткрытаДляСохранения И РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда
			Если Объект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ЗагрузкаДанных Тогда
				Если Объект.ТипПрикладногоОбъекта <> Перечисления.ТипыПрикладныхОбъектов.РегистрСведений Тогда
					Объект.Родитель = Справочники.НастройкиЗагрузкиДанныхИзТабличногоДокумента.ГруппаНастроекЗагрузки;
				КонецЕсли;
			Иначе
				Если Объект.ТипПрикладногоОбъекта <> Перечисления.ТипыПрикладныхОбъектов.РегистрСведений Тогда
					Объект.Родитель = Справочники.НастройкиЗагрузкиДанныхИзТабличногоДокумента.ГруппаНастроекВыгрузки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСписокТиповПрикладногоОбъекта();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;

	Инициализация();
	
	ИнициализацияСписковИСоответствий();
	
	// Заполним рабочие списки значений, выполняем "перед открытием" для того, чтобы
	// позиционировать текущие значения, показать представления.
	ЗаполнитьСписокВариантовИспользования();
	ЗаполнитьСписокТиповПрикладногоОбъекта();
	ЗаполнитьСписокПрикладныхОбъектов();
	ЗаполнитьСписокТабличныхЧастей();
	
	ОбновитьНомераСтрокВыгружаемыхРеквизитов();
	
	// В веб-клиенте редактирование справочника запрещено
	#Если ВебКлиент Тогда
		ТолькоПросмотр = Истина;
		// Вкладка загрузки
		Элементы.ПерваяСтрокаДанныхТабличногоДокумента.ТолькоПросмотр = Истина;
		Элементы.Табуляция.ТолькоПросмотр = Истина;
		Элементы.КодировкаЗагрузка.ТолькоПросмотр = Истина;
		Элементы.флПоискПоПрайсуПоставщика.ТолькоПросмотр = Истина;
		Элементы.НеОбновлятьСуществующиеЭлементы.ТолькоПросмотр = Истина;
		Элементы.ТаблицаЗагружаемыхРеквизитов.ТолькоПросмотр = Истина;
		Элементы.ТаблицаЗагружаемыхРеквизитов.КоманднаяПанель.ТолькоПросмотр = Истина;
		Для Каждого Элемент Из Элементы.ТаблицаЗагружаемыхРеквизитов.КоманднаяПанель.ПодчиненныеЭлементы Цикл
			Элемент.Доступность = Ложь;
		КонецЦикла;
		Элементы.ТаблицаЗагружаемыхРеквизитовПеренумероватьКолонки.Доступность = Ложь;
		Элементы.ТаблицаЗагружаемыхРеквизитовРучнаяНумерацияКолонокТабличногоДокумента.Доступность = Ложь;
		Элементы.ДействиеСЗагружаемымФайлом.ТолькоПросмотр = Истина;
		Элементы.ИспользоватьВнешнийМодульПреобразованияФайла.ТолькоПросмотр = Истина;
		Элементы.КаталогАрхиваЗагруженныхФайлов.ТолькоПросмотр = Истина;
		Элементы.ОбработкаПреобразования.ТолькоПросмотр = Истина;
		// Вкладка выгрузки
		Элементы.ФорматФайла.ТолькоПросмотр = Истина;
		Элементы.КодировкаВыгрузка.ТолькоПросмотр = Истина;
		Элементы.ВыгружаемыеРеквизиты.ТолькоПросмотр = Истина;
		Элементы.ВыгружаемыеРеквизитыСобытия.Доступность = Ложь;
	#КонецЕсли
	
	ОбновитьОтображениеДанных();
	ОтображениеТабличногоДокумента = Ложь;
	ИзмененаРучнаяНумерацияКолонок = Ложь;
	РазвернутТабличныйДокумент = Ложь;
	УстановитьВидимостьТабличныйДокумент();
	
	ЗаполнитьМассивКнопок();
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "ВыгружаемыеРеквизиты");

КонецПроцедуры

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - СправочникОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Процедура - обработчик события "ПередЗаписьюНаСервере" формы
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;

	// Для выгрузки проверим уникальность представления полей
	Если Объект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ВыгрузкаДанных Тогда
		
		СоответствиеНеУникальныхПолейДБФ = Новый Соответствие();
		
		Для Каждого ПолеВыгрузки Из ВыгружаемыеРеквизиты Цикл
			
			// Если Поле ДБФ уже присутствует в соответствии, значит все варианты неуникальности уже были рассмотрены.
			Если НЕ СоответствиеНеУникальныхПолейДБФ.Получить(ПолеВыгрузки.ПолеДБФ)=Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НайденыСовпадения = Ложь;
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= 'В строках №№ %1'"), ПолеВыгрузки.НомерСтроки);
			
			// Сравним с остальными строками построчно
			Для Каждого ПолеДляСравнения Из ВыгружаемыеРеквизиты Цикл
				
				// Пропустим туже самую строку
				Если ПолеВыгрузки.НомерСтроки=ПолеДляСравнения.НомерСтроки Тогда
					Продолжить;
				КонецЕсли;
				
				// Нашли совпадение полей ДБФ
				Если ПолеВыгрузки.ПолеДБФ=ПолеДляСравнения.ПолеДБФ Тогда
					
					// Проверим были ли уже совпадения по такому полю ДБФ
					НеУникальныеСтроки = СоответствиеНеУникальныхПолейДБФ.Получить(ПолеВыгрузки.ПолеДБФ);
					
					Если НеУникальныеСтроки=Неопределено Тогда
						Отказ = Истина;
						НайденыСовпадения = Истина;
						МассивСтрок = Новый Массив();
						МассивСтрок.Добавить(ПолеВыгрузки.НомерСтроки);
						МассивСтрок.Добавить(ПолеДляСравнения.НомерСтроки);
						СоответствиеНеУникальныхПолейДБФ.Вставить(ПолеВыгрузки.ПолеДБФ, МассивСтрок);
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1, %2'"), ТекстСообщения, ПолеДляСравнения.НомерСтроки);
					Иначе // Совпадения были, значит проверим номера строк, которые уже были проверены
						ИндексПолеВыгрузки     = НеУникальныеСтроки.Найти(ПолеВыгрузки.НомерСтроки);
						ИндексПолеДляСравнения = НеУникальныеСтроки.Найти(ПолеДляСравнения.НомерСтроки);
						Если ИндексПолеВыгрузки=Неопределено ИЛИ ИндексПолеДляСравнения=Неопределено Тогда
							Отказ = Истина;
							НайденыСовпадения = Истина;
							Если ИндексПолеВыгрузки=Неопределено Тогда
								НеУникальныеСтроки.Добавить(ПолеВыгрузки.НомерСтроки);
							КонецЕсли;
							Если ИндексПолеДляСравнения=Неопределено Тогда
								НеУникальныеСтроки.Добавить(ПолеДляСравнения.НомерСтроки);
							КонецЕсли;
							ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1, %2'"), ТекстСообщения, ПолеДляСравнения.НомерСтроки);
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			// Если были найдены совпадения, то сообщим о них пользователю
			Если НайденыСовпадения Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 совпадают поля DBF'"), ТекстСообщения);
				ВывестиСообщение(ТекстСообщения,,"ВыгружаемыеРеквизиты");
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Если ПерваяСтрокаДанныхТабличногоДокумента = 0 Тогда
			ВывестиСообщение(НСтр("ru = 'Не указана первая строка данных табличного документа'"),,"ПерваяСтрокаДанныхТабличногоДокумента");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		СохранитьНастройкиВХранилище(ТекущийОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - СправочникОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура        - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
		
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомСправочникаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомСправочникаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЯ ПОЛЕЙ ФОРМЫ

// Процедура - обработчик события "НачалоВыбора" поля "ФайлДляИнтерактивнойНастройки".
//
&НаКлиенте
Процедура ФайлДляИнтерактивнойНастройкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.ПолноеИмяФайла = ФайлДляИнтерактивнойНастройки;
	ДиалогВыбораФайла.Заголовок = "ВЫБРАТЬ источник данных";
	ДиалогВыбораФайла.Фильтр = "Все форматы (*.dbf;*.xls;*.xlsx;*.txt;*.mxl;*.mdb;*.sst;*.mmo;*.xml)|*.dbf;*.xls;*.xlsx;*.txt;*.mxl;*.mdb;*.sst;*.mmo;*.xml|dBase III (*.dbf)|*.dbf|Лист Excel (*.xls)|*.xls|Лист Excel 2007 (*.xlsx)|*.xlsx|Текстовый документ (*.txt)|*.txt|Табличный документ (*.mxl)|*.mxl|Microsoft Access(*.mdb)|*.mdb|Формат sst (*.sst)|*.sst|Формат mmo (*.mmo)|*.mmo|Формат xml (*.xml)|*.xml";
	Если НЕ ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ФайлДляИнтерактивнойНастройки = ДиалогВыбораФайла.ПолноеИмяФайла;

	Если ЗначениеЗаполнено(ФайлДляИнтерактивнойНастройки) Тогда
		ФайлДляИнтерактивнойНастройкиПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ФайлДляИнтерактивнойНастройки".
//
&НаКлиенте
Процедура ФайлДляИнтерактивнойНастройкиПриИзменении(Элемент)
	// Загрузка данных из файла
	ФайлНаДиске = Новый Файл(ФайлДляИнтерактивнойНастройки);
	Если НЕ ФайлНаДиске.Существует() ИЛИ ФайлНаДиске.ЭтоКаталог() Тогда
		ВывестиСообщение(НСтр("ru = 'Файл данных не существует'"));
		Возврат;
	КонецЕсли;
	Если ИспользоватьВнешнийМодульПреобразованияФайла И НЕ ЗначениеЗаполнено(ОбработкаПреобразования) Тогда
		ВывестиСообщение(НСтр("ru = 'В настройке загрузки указано, что файл преобразовывается в табличный документ внешней обработкой, но обработка не указана.'"));
		Возврат;
	КонецЕсли;
	
	АдресВоВременномХранилище = "";
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ФайлДляИнтерактивнойНастройкиПриИзмененииЗавершение", ЭтотОбъект, Новый Структура("ФайлНаДиске", ФайлНаДиске)), АдресВоВременномХранилище, ФайлДляИнтерактивнойНастройки,Ложь, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ФайлДляИнтерактивнойНастройкиПриИзмененииЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
    
    АдресВоВременномХранилище = Адрес;
    ФайлНаДиске = ДополнительныеПараметры.ФайлНаДиске;
    
    Если ИспользоватьВнешнийМодульПреобразованияФайла И ЗначениеЗаполнено(ОбработкаПреобразования) Тогда
        ЗагрузкаИзЭлектронныхДокументовВызовСервера.ЗаполнитьТабличныйДокументИзXMLСервер(ФайлДляИнтерактивнойНастройки, ОбработкаПреобразования, ТабличныйДокумент, АдресВоВременномХранилище);
    Иначе
        ЗагрузкаИзЭлектронныхДокументовВызовСервера.ПрочитатьТабличныйДокумент(ТабличныйДокумент, ФайлНаДиске.Расширение, ФайлНаДиске.ИмяБезРасширения, АдресВоВременномХранилище, Табуляция, Кодировка);
    КонецЕсли;
    РазвернутТабличныйДокумент = Истина;
    ТаблицаЗагружаемыхРеквизитовПриАктивизацииСтроки(Неопределено);

КонецПроцедуры

// Процедура - обработчик события "Нажатия" гиперссылки "тТабличныйДокумент"
//
&НаКлиенте
Процедура тТабличныйДокументНажатие(Элемент)
	
	УстановитьВидимостьТабличныйДокумент();
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "Наименование"
//
&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Объект.Наименование = СформироватьНаименование();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ИмяПрикладногоОбъекта"
//
&НаСервере
Процедура ИмяПрикладногоОбъектаПриИзмененииНаСервере()
	
	УстановитьИсточник();
	
	УправлениеДиалогомНаСервере();
	
	ЗаполнитьМассивКнопок();
	
	Если Объект.ВариантИспользованияНастройки = Перечисления.ВариантыИспользованияНастройки.ЗагрузкаДанных И 
		Объект.ТипПрикладногоОбъекта = Перечисления.ТипыПрикладныхОбъектов.Справочник И 
		Объект.ИмяПрикладногоОбъекта = "Номенклатура" Тогда
		ПриЗаписиОбъекта = "
		|Если (НЕ Объект.ЭтоГруппа) И (НЕ ЗначениеЗаполнено(Объект.ОсновнаяЕдиницаИзмерения)) Тогда
		|	НоваяЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(Объект.Ссылка);
		|	Объект.ОсновнаяЕдиницаИзмерения = НоваяЕдиницаИзмерения;
		|	Объект.Записать();
		|КонецЕсли;
		|";
		
		ПередЗаписьюОбъекта = "
		|Если (НЕ Объект.ЭтоГруппа) И (НЕ ЗначениеЗаполнено(Объект.БазоваяЕдиницаИзмерения)) Тогда
		|	Объект.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
		|КонецЕсли;
		|";
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ИмяПрикладногоОбъекта"
//
&НаКлиенте
Процедура ИмяПрикладногоОбъектаПриИзменении(Элемент)
	
	// Отдадим уже готовое представление
	СписокДокументов = Элемент.СписокВыбора;
	ЭлементСписка = СписокДокументов.НайтиПоЗначению(Объект.ИмяПрикладногоОбъекта);
	Если ЭлементСписка<>Неопределено Тогда
		Объект.ПредставлениеПрикладногоОбъекта = ЭлементСписка.Представление;
	Иначе
		Объект.ПредставлениеПрикладногоОбъекта = Объект.ИмяПрикладногоОбъекта;
	КонецЕсли;
	
	ИмяТабличнойЧасти = "";
	
	ЗаполнитьСписокТабличныхЧастей();
	
	// Выберем первую доступную ТЧ
	СписокВыбора = Элементы.ИмяТабличнойЧасти.СписокВыбора;
	Если СписокВыбора.Количество()>0 И НЕ ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
		Объект.ИмяТабличнойЧасти = СписокВыбора[0].Значение;
		Объект.ПредставлениеТабличнойЧасти = СписокВыбора[0].Представление;
	КонецЕсли;
	
	ИмяПрикладногоОбъектаПриИзмененииНаСервере();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ИмяТабличнойЧасти"
//
&НаКлиенте
Процедура ИмяТабличнойЧастиПриИзменении(Элемент)
	
	СписокТабличныхЧастей = Элемент.СписокВыбора;
	ЭлементСписка = СписокТабличныхЧастей.НайтиПоЗначению(Объект.ИмяТабличнойЧасти);
	Если ЭлементСписка <> Неопределено Тогда
		Объект.ПредставлениеТабличнойЧасти = ЭлементСписка.Представление;
	Иначе
		Объект.ПредставлениеТабличнойЧасти = Объект.ИмяТабличнойЧасти;
	КонецЕсли;
	
	УстановитьИсточник();
	
	УправлениеДиалогомНаСервере();
	
	ЗаполнитьМассивКнопок();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ТипПрикладногоОбъекта"
//
&НаКлиенте
Процедура ТипПрикладногоОбъектаПриИзменении(Элемент)
	
	Объект.ИмяПрикладногоОбъекта = "";
	
	Объект.ИмяТабличнойЧасти = "";
	
	ЗаполнитьСписокПрикладныхОбъектов();
	
	УстановитьИсточник();
	
	УправлениеДиалогомНаСервере();
	
	ЗаполнитьМассивКнопок();
	
КонецПроцедуры

// Процедура - обработчик события "Очистка" поля "КодировкаВыгрузка"
//
&НаКлиенте
Процедура КодировкаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Кодировка = "";
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ДействиеСЗагружаемымФайлом"
//
&НаКлиенте
Процедура ДействиеСЗагружаемымФайломПриИзменении(Элемент)
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "КаталогАрхиваЗагруженныхФайлов".
//
&НаКлиенте
Процедура КаталогАрхиваЗагруженныхФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//	Обработка выбора каталога хранения архива сохраняемых файлов
	СтандартнаяОбработка   = Ложь;
	ДиалогОткрытияКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияКаталога.ПолноеИмяФайла = "";
	ДиалогОткрытияКаталога.МножественныйВыбор = Ложь;
	
	// Определим, какой каталог выбираем
	ДиалогОткрытияКаталога.Заголовок = НСтр("ru = 'Выберите каталог архива загружаемых файлов'");
	ДиалогОткрытияКаталога.Каталог   = КаталогАрхиваЗагруженныхФайлов;
	
	// Предоставим выбор пользователю
	Если ДиалогОткрытияКаталога.Выбрать() Тогда
		КаталогАрхиваЗагруженныхФайлов = ДиалогОткрытияКаталога.Каталог;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ИспользоватьВнешнийМодульПреобразованияФайла".
//
&НаКлиенте
Процедура ИспользоватьВнешнийМодульПреобразованияФайлаПриИзменении(Элемент)
	
	НастроитьДоступностьПоляОбработки();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ВариантИспользованияНастройки".
//
&НаКлиенте
Процедура ВариантИспользованияНастройкиПриИзменении(Элемент)
	
	Объект.ТипПрикладногоОбъекта = ПредопределенноеЗначение("Перечисление.ТипыПрикладныхОбъектов.ПустаяСсылка");
	
	Объект.ИмяПрикладногоОбъекта = "";
	
	Объект.ИмяТабличнойЧасти = "";
	
	ЗаполнитьСписокТиповПрикладногоОбъекта();
	
	УстановитьИсточник();
	
	УправлениеДиалогомНаСервере();
	
	ЗаполнитьМассивКнопок();
	
КонецПроцедуры

// Процедура - обработчик события "ПриАктивизацииСтроки"  табличного поля "ТаблицаЗагружаемыхРеквизитов".
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовПриАктивизацииСтроки(Элемент)
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитов);
	РазобратьсяСОформлениемСтрок();
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "ТаблицаЗагружаемыхРеквизитовВыражение".
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовВыражениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаИмя = "Справочник.НастройкиЗагрузкиДанныхИзТабличногоДокумента.Форма.ФормаРедактированияВыражения";
	ПараметрыФормы = Новый Структура("Выражение", ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Выражение);
	
	ОткрытьФорму(ФормаИмя, ПараметрыФормы, ЭтотОбъект,,,, Новый ОписаниеОповещения("ТаблицаЗагружаемыхРеквизитовВыражениеНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовВыражениеНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Выражение = СокрЛП(Результат);
    
    Модифицированность = Истина;

КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "ТаблицаЗагружаемыхРеквизитовРежимПоиска".
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовРежимПоискаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		ВозможностьУстановкиРежима = ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(ТекущиеДанные.ИмяРеквизита, ТекущиеДанные.ОписаниеТипов, ТекущиеДанные.ИскатьПо, ТекущиеДанные.ЗначениеПоУмолчанию);
		СписокВыбораЭлемента = Элемент.СписокВыбора;
		Если ВозможностьУстановкиРежима И СписокВыбораЭлемента.Количество() = 1 Тогда
			СписокВыбораЭлемента.Добавить("По похожим словам", НСтр("ru = 'По похожим словам'"));
		ИначеЕсли Не ВозможностьУстановкиРежима И СписокВыбораЭлемента.Количество() = 2 Тогда
			СписокВыбораЭлемента.Удалить(СписокВыбораЭлемента.Количество() - 1);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ТаблицаЗагружаемыхРеквизитовНомерКолонки".
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовНомерКолонкиПриИзменении(Элемент)
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитов);
	РазобратьсяСОформлениемСтрок();
КонецПроцедуры

// Процедура - обработчик события "ПриНачалеРедактирования" таблицы "ВыгружаемыеРеквизиты".
//
&НаКлиенте
Процедура ВыгружаемыеРеквизитыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ВыгружаемыеРеквизиты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НоваяСтрока Тогда
		ТекущиеДанные.ТипПоля = НСтр("ru = 'Поле объекта'");
		ТекущиеДанные.НомерСтроки = ВыгружаемыеРеквизиты.Индекс(ТекущиеДанные)+1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружаемыеРеквизитыПриИзменении(Элемент)
	
	ОбновитьНомераСтрокВыгружаемыхРеквизитов();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ВыгружаемыеРеквизитыТипПоля".
//
&НаКлиенте
Процедура ВыгружаемыеРеквизитыТипПоляПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВыгружаемыеРеквизиты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ТипПоля = "Выражение" Тогда
		
		ТекущиеДанные.Представление = НСтр("ru = 'Произвольное выражение'");
		ТекущиеДанные.Данные        = "Результат = Неопределено;";
		ТекущиеДанные.Тип = "";
		ТекущиеДанные.Длина = 0;
		ТекущиеДанные.Точность = 0;
		ТекущиеДанные.ПолеДБФ = "";
		
	Иначе
		
		ТекущиеДанные.Представление = "";
		ТекущиеДанные.Данные = "";
		ТекущиеДанные.Тип = "";
		ТекущиеДанные.Длина = 0;
		ТекущиеДанные.Точность = 0;
		ТекущиеДанные.ПолеДБФ = "";
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля "ВыгружаемыеРеквизитыПредставление".
//
&НаКлиенте
Процедура ВыгружаемыеРеквизитыПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ВыгружаемыеРеквизиты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ТипПоля = НСтр("ru = 'Поле объекта'") Тогда
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("Представление",                     ТекущиеДанные.Представление);
		СтруктураПараметров.Вставить("НачальныйПутьКДанным",              ТекущиеДанные.Данные);
		СтруктураПараметров.Вставить("АдресХранилищаМетаданныеИсточника", АдресХранилищаМетаданныеИсточника);
		СтруктураПараметров.Вставить("ТипПрикладногоОбъекта",             Объект.ТипПрикладногоОбъекта);
		
		Если Объект.ТипПрикладногоОбъекта = ПредопределенноеЗначение("Перечисление.ТипыПрикладныхОбъектов.Обработка") Тогда
			СтруктураПараметров.Вставить("ИмяТабличнойЧасти", Объект.ИмяТабличнойЧасти);
		КонецЕсли;
		
		ОткрытьФорму("Справочник.НастройкиЗагрузкиДанныхИзТабличногоДокумента.Форма.ВыборПоля", СтруктураПараметров, Элемент,,,,Новый ОписаниеОповещения("ОбработкаВыбораПредставленияПоляОбъекта",ЭтотОбъект, ТекущиеДанные),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
		
	ИначеЕсли ТекущиеДанные.ТипПоля = "Выражение" Тогда
		
		СтруктураПараметров = Новый Структура("Представление,Выражение", ТекущиеДанные.Представление, ТекущиеДанные.Данные);
		ОткрытьФорму("Справочник.НастройкиЗагрузкиДанныхИзТабличногоДокумента.Форма.ФормаРедактированияВыраженияВыгрузка", СтруктураПараметров, Элемент,,,,Новый ОписаниеОповещения("ОбработкаВыбораРедактированияВыражения",ЭтотОбъект, ТекущиеДанные),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
		
	Иначе
		ВывестиСообщение(НСтр("ru = 'Не указан тип поля.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПредставленияПоляОбъекта(Результат, ТекущиеДанные) Экспорт
    
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Данные        = Результат.ПолныйПутьКДанным;
	ТекущиеДанные.Представление = Результат.Представление;
	ТекущиеДанные.ПолеДБФ = Транслитерация(Результат.ПредставлениеВерхнегоУровня);
	
	МассивТипов = Результат.ОписаниеТипов.Типы();
	Если МассивТипов.Количество() = 1 Тогда
		Тип = МассивТипов[0];
		ОписаниеТипов = Результат.ОписаниеТипов;
		// Ссылочные типы выгружаем строкой
		Если Тип = Тип("Строка") Тогда
			ТекущиеДанные.Тип      = "S";
			ТекущиеДанные.Длина    = ?(ОписаниеТипов.КвалификаторыСтроки.Длина>0,ОписаниеТипов.КвалификаторыСтроки.Длина,255);
			ТекущиеДанные.Точность = 0;
			
		ИначеЕсли Тип = Тип("Число") Тогда
			ТекущиеДанные.Тип      = "N";
			ТекущиеДанные.Длина    = ОписаниеТипов.КвалификаторыЧисла.Разрядность;
			ТекущиеДанные.Точность = ОписаниеТипов.КвалификаторыЧисла.РазрядностьДробнойЧасти;
			
		ИначеЕсли Тип = Тип("Булево") Тогда
			ТекущиеДанные.Тип      = "L";
			ТекущиеДанные.Длина    = 0;
			ТекущиеДанные.Точность = 0;
			
		ИначеЕсли Тип = Тип("Дата") Тогда
			ТекущиеДанные.Тип      = "D";
			ТекущиеДанные.Длина    = 0;
			ТекущиеДанные.Точность = 0;
			
		Иначе
			ТекущиеДанные.Тип      = "S";
			ТекущиеДанные.Длина    = 255;
			ТекущиеДанные.Точность = 0;
		КонецЕсли;
		
	Иначе
		// Все остальное выгружаем строкой
		ТекущиеДанные.Тип      = "S";
		ТекущиеДанные.Длина    = 255;
		ТекущиеДанные.Точность = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораРедактированияВыражения(Результат, ТекущиеДанные) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Представление = Результат.Представление;
	ТекущиеДанные.Данные        = Результат.Выражение;
	
	Если ПустаяСтрока(ТекущиеДанные.ПолеДБФ) Тогда
		ТекущиеДанные.ПолеДБФ = Транслитерация(ТекущиеДанные.Представление);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ОкончаниеВводаТекста" поля "ВыгружаемыеРеквизитыПолеДБФ".
//
&НаКлиенте
Процедура ВыгружаемыеРеквизитыПолеДБФОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ВходныеПараметры, СтандартнаяОбработка)
	
	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Текст, Истина, "_") Тогда
		ТекстСообщения = НСтр("ru= 'Наименование поля DBF должно содержать только латинские буквы и знаки подчеркивания ""_"".'");
		ИндексСтроки = ВыгружаемыеРеквизиты.Индекс(Элементы.ВыгружаемыеРеквизиты.ТекущиеДанные);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ВыгружаемыеРеквизиты["+Формат(ИндексСтроки, "ЧГ=0")+"].ПолеДБФ");
	КонецЕсли;
	
	КодСимволаПервойБуквы = КодСимвола(Лев(Текст, 1));
	
	ЭтоЛатинскаяБуква = НЕ ((КодСимволаПервойБуквы < 65) Или (КодСимволаПервойБуквы > 90 И КодСимволаПервойБуквы < 97) Или (КодСимволаПервойБуквы > 122));
	Если НЕ ЭтоЛатинскаяБуква Тогда
		ТекстСообщения = НСтр("ru= 'Наименование поля DBF должно начинаться с латинской буквы.'");
		ИндексСтроки = ВыгружаемыеРеквизиты.Индекс(Элементы.ВыгружаемыеРеквизиты.ТекущиеДанные);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ВыгружаемыеРеквизиты["+Формат(ИндексСтроки, "ЧГ=0")+"].ПолеДБФ");
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

// Процедура - обработчик команды "УстановитьКолонку"
//
&НаКлиенте
Процедура УстановитьКолонку(Команда)
	
	НомерКолонки = ТабличныйДокумент.ТекущаяОбласть.Лево;
	
	Если НомерКолонки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрока.НомерКолонки = НомерКолонки Тогда
		Возврат;
	ИначеЕсли ТекСтрока.НомерКолонки<>0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьКолонкуЗавершение", ЭтотОбъект, 
			Новый Структура("НомерКолонки, ТекСтрока", НомерКолонки, ТекСтрока)),
				НСтр("ru = 'Для текущего реквизита'") + " """+СокрЛП(ТекСтрока.ПредставлениеРеквизита)
				+""" " + НСтр("ru = 'уже установлен номер колонки'")+ " "+ТекСтрока.НомерКолонки
				+". " + НСтр("ru = 'Изменить его на номер'") + " "+НомерКолонки+"?'", РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	УстановитьКолонкуНепосредственно(НомерКолонки, ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКолонкуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    НомерКолонки = ДополнительныеПараметры.НомерКолонки;
    ТекСтрока = ДополнительныеПараметры.ТекСтрока;
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    
    УстановитьКолонкуНепосредственно(НомерКолонки, ТекСтрока);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьКолонкуНепосредственно(Знач НомерКолонки, Знач ТекСтрока)
    
    ТекСтрока.НомерКолонки = НомерКолонки;
    ТекСтрока.Пометка = Истина;
    
    Если Не РучнаяНумерацияКолонокТабличногоДокумента Тогда
        РучнаяНумерацияКолонокТабличногоДокумента = Истина;
        УправлениеДиалогомНаСервере();
    КонецЕсли;
    Модифицированность = Истина;
    РасставитьПометкиНаКнопках(НомерКолонки);

КонецПроцедуры

// Процедура - обработчик команды "ПодключаемыеКнопкиНажатие"
//
&НаКлиенте
Процедура ПодключаемыеКнопкиНажатие(Команда)
	
	НомерКолонки = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Если НомерКолонки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТек Из ТаблицаЗагружаемыхРеквизитов Цикл
		Если Команда.Имя = "ПодключаемаяКнопка_"+СтрокаТек.ИмяРеквизита Тогда
			Если Элементы[Команда.Имя].Пометка Тогда
				СтрокаТек.НомерКолонки = 0;
			Иначе
				СтрокаТек.НомерКолонки = НомерКолонки;
				Если Не СтрокаТек.Пометка Тогда
					СтрокаТек.Пометка = Истина;
				КонецЕсли;
				Если НЕ РучнаяНумерацияКолонокТабличногоДокумента Тогда
					РучнаяНумерацияКолонокТабличногоДокумента = Истина;
					УправлениеДиалогомНаСервере();
				КонецЕсли;
			КонецЕсли;
			Модифицированность = Истина;
			РасставитьПометкиНаКнопках(НомерКолонки);
			РазобратьсяСОформлениемСтрок();
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Процедура - обработчик команды "СнятьФлажки"
//
&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ЗагрузкаИзЭлектронныхДокументовКлиент.УстановитьФлагТаблицы(Ложь, ТаблицаЗагружаемыхРеквизитов);
	
КонецПроцедуры

// Процедура - обработчик команды "УстановитьФлажки"
//
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ЗагрузкаИзЭлектронныхДокументовКлиент.УстановитьФлагТаблицы(Истина, ТаблицаЗагружаемыхРеквизитов);
	
КонецПроцедуры

// Процедура - обработчик команды "Перечитать"
//
&НаКлиенте
Процедура Перечитать(Команда)
	
	ЗаполнитьНастройкиКолонок();
	Модифицированность = Истина;
	ИзмененаРучнаяНумерацияКолонок = Истина;
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТаблицаЗагружаемыхРеквизитов;
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитов);
	РазобратьсяСОформлениемСтрок();
	
КонецПроцедуры

// Процедура - обработчик команды "События"
//
&НаКлиенте
Процедура События(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ПередВыгрузкойОбъекта",		ПередВыгрузкойОбъекта);
	ПараметрыОткрытияФормы.Вставить("ПередЗаписьюОбъекта",			ПередЗаписьюОбъекта);
	ПараметрыОткрытияФормы.Вставить("ПриЗаписиОбъекта",				ПриЗаписиОбъекта);
	ПараметрыОткрытияФормы.Вставить("ПослеДобавленияСтроки",		ПослеДобавленияСтроки);
	ПараметрыОткрытияФормы.Вставить("ВариантИспользованияНастройки",Объект.ВариантИспользованияНастройки);
	ОткрытьФорму("Справочник.НастройкиЗагрузкиДанныхИзТабличногоДокумента.Форма.ФормаРедактированияСобытий",ПараметрыОткрытияФормы,ЭтотОбъект,,,,Новый ОписаниеОповещения("ОповещениеОРедактированииСобытий",ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОРедактированииСобытий(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Для Каждого РезультирующееЗначение Из Результат Цикл
		ЭтотОбъект[РезультирующееЗначение.Ключ] = РезультирующееЗначение.Значение;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

// Процедура - обработчик команды "ЗагрузитьНастройкиИзФайла"
//
&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)
	
	#Если НЕ ВебКлиент Тогда
		
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогВыбораФайла.Заголовок = "ru = 'Загрузить настройки из файла'";
		ДиалогВыбораФайла.Фильтр    = "Файлы настроек (*.mxlz;*.mxla)|*.mxlz;*.mxla|Файлы настроек загрузки(*.mxlz)|*.mxlz|Файлы настроек выгрузки(*.mxla)|*.mxla|Все файлы (*.*)|*.*|";
		
		Если НЕ ДиалогВыбораФайла.Выбрать() Тогда
			Возврат;
		КонецЕсли;
		
		Файл = Новый Файл(ДиалогВыбораФайла.ПолноеИмяФайла);
		Расширение = НРег(Файл.Расширение);
		
		// Засунем файл во временное хранилище и перекинем на сервер
		АдресВоВременномХранилище = "";
		НачатьПомещениеФайла(Новый ОписаниеОповещения("ЗагрузитьНастройкиИзФайлаЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла, Расширение", ДиалогВыбораФайла, Расширение)), АдресВоВременномХранилище, ДиалогВыбораФайла.ПолноеИмяФайла, Ложь, Новый УникальныйИдентификатор);
		
	#Иначе
		ВывестиСообщение(НСтр("ru = 'Функциональность не поддерживается в веб-клиенте.'"));
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайлаЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
    
    АдресВоВременномХранилище = Адрес;
    ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
    Расширение = ДополнительныеПараметры.Расширение;
    
    
    ЗагруженоУспешно = ВыполнитьЗагрузкуНастроек(Расширение, ДиалогВыбораФайла.ПолноеИмяФайла, АдресВоВременномХранилище);
    
    Если ЗагруженоУспешно Тогда
        ЭтотОбъект.Модифицированность = Истина;
    КонецЕсли;
    
    УправлениеДиалогомНаСервере();

КонецПроцедуры

// Процедура сохраняет настройки в файл
//
&НаКлиенте
Процедура СохранитьНастройкиВФайл(Команда)
	
	#Если НЕ ВебКлиент Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Модифицированность Тогда
			ТекстВопроса = НСтр("ru = 'Перед сохранением в файл элемент должен быть записан.
			                          |Записать?'");
			ПоказатьВопрос(Новый ОписаниеОповещения("СохранитьНастройкиВФайлЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
            Возврат;
		КонецЕсли;
		
		СохранитьНастройкиВФайлНепосредственно();

		
	#Иначе
		ВывестиСообщение(НСтр("ru = 'Функциональность не поддерживается в веб-клиенте.'"));
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиВФайлЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
        Возврат;
    КонецЕсли;
    
    Попытка
        Записать();
    Исключение
        Возврат;
    КонецПопытки;
    
    СохранитьНастройкиВФайлНепосредственно();

КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиВФайлНепосредственно()
    
    Перем ДиалогВыбораФайла, Настройки;
    
    Настройки = ПолучитьНастройкиИзХранилища();
    Если Настройки = Неопределено Тогда
        ВывестиСообщение(НСтр("ru = 'Невозможно сохранить в файл. Не заполнены данные настроек.'"));
        Возврат;
    КонецЕсли;
    
    ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
    
    ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Сохранить настройки в файл'");
    
    ДиалогВыбораФайла.Фильтр = ПолучитьСтрокуФильтраДляДиалогаВыбораФайла();
    
    ДиалогВыбораФайла.ПолноеИмяФайла = Объект.Наименование;
    
    Если НЕ ДиалогВыбораФайла.Выбрать() Тогда
        Возврат;
    КонецЕсли;
    
    Настройки.Записать(ДиалогВыбораФайла.ПолноеИмяФайла);

КонецПроцедуры

// Процедура - обработчик команды "ПеренумероватьКолонки"
//
&НаКлиенте
Процедура ПеренумероватьКолонки(Команда)
	
	НомерКолонки = 1;
	Для Каждого Реквизит Из ТаблицаЗагружаемыхРеквизитов Цикл
		Если Реквизит.Пометка Тогда
			Если НЕ Реквизит.НомерКолонки = НомерКолонки Тогда
				Реквизит.НомерКолонки = НомерКолонки;
			КонецЕсли;
			НомерКолонки = НомерКолонки + 1;
		Иначе
			Реквизит.НомерКолонки = 0;
		КонецЕсли;
		
		Если Реквизит.НомерКолонки = 0 И Реквизит.РежимЗагрузки = "Искать" Тогда
			Реквизит.РежимЗагрузки = "Устанавливать"
		ИначеЕсли НЕ Реквизит.НомерКолонки = 0 И Реквизит.РежимЗагрузки = "Устанавливать" Тогда
			Реквизит.РежимЗагрузки = "Искать"
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Истина;
	ИзмененаРучнаяНумерацияКолонок = Истина;
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТаблицаЗагружаемыхРеквизитов;
	ПодсветитьВыбраннуюКолонку(Элементы.ТаблицаЗагружаемыхРеквизитов);
	РазобратьсяСОформлениемСтрок();
	
КонецПроцедуры

// Процедура - обработчик команды "РучнаяНумерацияКолонокТабличногоДокумента"
//
&НаКлиенте
Процедура РучнаяНумерацияКолонокТабличногоДокумента(Команда)
	
	УстановитьРучнаяНумерацияКолонок();
	Элементы.ТаблицаЗагружаемыхРеквизитовПеренумероватьКолонки.Доступность                 = РучнаяНумерацияКолонокТабличногоДокумента;
	Элементы.ТаблицаЗагружаемыхРеквизитовНомерКолонки.Видимость                            = РучнаяНумерацияКолонокТабличногоДокумента;
	Элементы.ТаблицаЗагружаемыхРеквизитовРучнаяНумерацияКолонокТабличногоДокумента.Пометка = РучнаяНумерацияКолонокТабличногоДокумента;
	ИзмененаРучнаяНумерацияКолонок = Истина;
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля "ТаблицаЗагружаемыхРеквизитовРежимЗагрузки".
//
&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовРежимЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ТаблицаЗагружаемыхРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные<>Неопределено Тогда
		ВозможностьУстановкиЗагрузки = ОпределитьВозможностьУстановкиРежимаЗагрузкиДляТекущихДанных(ТекущиеДанные.ОписаниеТипов, ТекущиеДанные.ЗначениеПоУмолчанию);
		СписокВыбораЭлемента = Элемент.СписокВыбора;
		Если ВозможностьУстановкиЗагрузки И СписокВыбораЭлемента.Количество() = 3 Тогда
			СписокВыбораЭлемента.Добавить("Загружать", "Загружать");
		ИначеЕсли Не ВозможностьУстановкиЗагрузки И СписокВыбораЭлемента.Количество() = 4 Тогда
			СписокВыбораЭлемента.Удалить(СписокВыбораЭлемента.Количество() - 1);
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик события "При активизации области" табличного документа
//
&НаКлиенте
Процедура ТабличныйДокументПриАктивизацииОбласти(Элемент)
	НомерКолонки = ТабличныйДокумент.ТекущаяОбласть.Лево;
	Если ЗначениеЗаполнено(НомерКолонки) Тогда
		РасставитьПометкиНаКнопках(НомерКолонки);
	КонецЕсли;
	ПодсветитьВыбраннуюКолонку(Неопределено);
	РазобратьсяСОформлениемСтрок();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗагружаемыхРеквизитовЗначениеПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Зарезервировано = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьДополнительныеРеквизитыИСведенияПриИзменении(Элемент)
	УстановитьИсточник();
	
	УправлениеДиалогомНаСервере();
	
	ЗаполнитьМассивКнопок();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыИСведенияТолькоОбщиеПриИзменении(Элемент)
	Если ДополнительныеРеквизитыИСведенияТолькоОбщие Тогда
		ДополнительныеРеквизитыПоТипуНоменклатуры.Очистить();
	КонецЕсли;
	УстановитьИсточник();
	
	УправлениеДиалогомНаСервере();
	
	ЗаполнитьМассивКнопок();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыПоТипуНоменклатурыПриИзменении(Элемент)
	УстановитьИсточник();
	
	УправлениеДиалогомНаСервере();
	
	ЗаполнитьМассивКнопок();
КонецПроцедуры


