// Модуль менеджера регистра сведений "Допроведение по партиям"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция проверяет входит ли документ в список "неоднозначных" партионных документов.
//
// Параметры:
//  МетаданныеДок - ОбъектМетаданных - Объект описания метаданных документа.
//
// Возвращаемое значение:
//  Булево - Признак проведения документа.
//
Функция ДокументНеВсегдаПроводитьсяПоПартиям(МетаданныеДок) Экспорт
	
	Исключения = Новый Массив;
	
	Исключения.Добавить(Метаданные.Документы.Переоценка);
	Исключения.Добавить(Метаданные.Документы.Инвентаризация);
	Исключения.Добавить(Метаданные.Документы.ПоступлениеДопРасходов);
	
	Если Исключения.Найти(МетаданныеДок) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ДокументНеВсегдаПроводитьсяПоПартиям()

// Функция возвращает массив партионных регистров
// состав этих регистров может отличаться в различных конфигурациях.
//
// Возвращаемое значение:
//  Массив - Массив партионных регистров.
//
Функция ПолучитьПартионныеРегистры() Экспорт
	
	МассивПартионныхРегистров=Новый Массив;
	МассивПартионныхРегистров.Добавить("ПартииТоваровКомпании");
	МассивПартионныхРегистров.Добавить("ПартииТоваровОтданные");
	МассивПартионныхРегистров.Добавить("ДоходыИРасходы");
	МассивПартионныхРегистров.Добавить("Продажи");
	МассивПартионныхРегистров.Добавить("РеализованныеТовары");
	
	Возврат МассивПартионныхРегистров;
	
КонецФункции // ПолучитьПартионныеРегистры()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты регистра
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли