// Модуль набора записей регистра "Допроведение по партиям"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОписаниеПеременных

Перем ДокументОбъект Экспорт;    // ДокументОбъект.
Перем ШапкаДокумента Экспорт;    // Выборка из запроса по реквизитам документа
Перем НеПроводитьПартии Экспорт; // Булево. Истина-документ не надо допроводить по партиям

#КонецОбласти

// Зафиксировать
Функция Зафиксировать() Экспорт
	// Проверим надо ли фиксировать непроведение партий
	НеПроводитьПартии=Ложь;
	ОтложенноеПроведениеПоПартиям=Ложь;
	
	// Определим режим проведения по партиям
	ОтложенноеПроведениеПоПартиям = (ОбработкаСобытийДокументаСервер.ПолучитьРежимПроведенияПоПартиям() = Перечисления.РежимыПроведенияПартий.ПартииОтсутствуют);
	Если НЕ (ДокументОбъект.Ссылка=ШапкаДокумента.Ссылка И ОтложенноеПроведениеПоПартиям) Тогда
		ШапкаДокумента=Неопределено;
		ДокументОбъект=Неопределено;
		Возврат Истина;
	КонецЕсли;
	
	// Зафиксируем, что документ надо допровести
	НоваяЗапись=Добавить();
	НоваяЗапись.Период=ШапкаДокумента.Дата;
	НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
	НоваяЗапись.ПодразделениеКомпании=ШапкаДокумента.ПодразделениеКомпании;
	
	НеПроводитьПартии=Истина;
	
	ШапкаДокумента=Неопределено;
	ДокументОбъект=Неопределено;
	
	Возврат Истина;
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для формирования наименования/кода нового элемента.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи объекта.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередЗаписью(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ПередЗаписью(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийРегистраСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли