
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстОтбора = Параметры.ТекстОтбора;
	НаименованиеОбъекта = Параметры.НаименованиеОбъекта;
	
	Попытка
		СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
		
		ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
		ИсточникДанных.Имя = "ИсточникДанных";
		ИсточникДанных.ТипИсточникаДанных = "Local";
		
		НаборДанныхЗапрос = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		НаборДанныхЗапрос.Имя = "НаборДанных";
		НаборДанныхЗапрос.ИсточникДанных = "ИсточникДанных";
		НаборДанныхЗапрос.Запрос = "ВЫБРАТЬ Разрешенные _.* ИЗ Справочник." + НаименованиеОбъекта + " КАК _ ";
		
		//->Lexa141105
		//ИсточникДоступныхНастроекКомпоновкиДанных = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных);
		//КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		//КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроекКомпоновкиДанных);
		
		АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		//<-Lexa
	
		Если Не ПустаяСтрока(ТекстОтбора) Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(ЗначениеИзСтрокиВнутр(ТекстОтбора));
		КонецЕсли;
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
	 	
КонецПроцедуры

&НаКлиенте
Процедура OK(Команда)
	ТекстОтбора = ОкСервер();
	Закрыть(ТекстОтбора);
КонецПроцедуры

&НаСервере
Функция ОкСервер()
	
	Если КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() > 0 Тогда
		ТекстОтбора = ЗначениеВСтрокуВнутр(КомпоновщикНастроек.ПолучитьНастройки());
	Иначе
		ТекстОтбора = "";
	КонецЕсли;
	
	Возврат ТекстОтбора;
	
КонецФункции