

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидДокумента         = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ВидДокумента", "ПоступлениеТоваров");
	ДокументЗаполнения   = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДокументЗаполнения", Неопределено);
	ИдентификаторОбъекта = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ИдентификаторОбъекта", "");
	СкладКомпании        = ПолучитьЗначениеПараметраСтруктуры(Параметры, "СкладКомпании", Неопределено);
	ДокументОснование    = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ДокументОснование", Неопределено);
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных("ИдентификаторОбъекта");
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Список.Отбор, ПолеОтбора, ИдентификаторОбъекта, ВидСравненияКомпоновкиДанных.Равно, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьСборДанныхНаСервере(СозданНовыйДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеТСД.Штрихкод КАК Штрихкод,
	|	ДанныеТСД.Номенклатура КАК Номенклатура,
	|	ДанныеТСД.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДанныеТСД.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеТСД.Количество КАК Количество,
	//|	ДанныеТСД.Цена,
	//|	ДанныеТСД.ЦенаРозничная,
	|	ДанныеТСД.НомерСтрокиПоНакладной
	|ИЗ
	|	РегистрСведений.ДанныеТСД КАК ДанныеТСД
	|ГДЕ
	|	ДанныеТСД.ИдентификаторОбъекта = &ИдентификаторОбъекта
	|";
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ДокументЗаполнения = Неопределено Тогда
		
		GUIDОбъекта = Новый УникальныйИдентификатор(ИдентификаторОбъекта);
		
		СсылкаНаДокумент = Документы[ВидДокумента].ПолучитьСсылку(GUIDОбъекта);
		Если Найти(Строка(СсылкаНаДокумент), "<Объект не найден>") = 1 Тогда
			Если ВидДокумента = "ПоступлениеТоваров" Тогда
				СсылкаНаЗаказПоставщику = Документы.ЗаказПоставщику.ПолучитьСсылку(GUIDОбъекта);
			КонецЕсли;
			ДокументОбъект = Документы[ВидДокумента].СоздатьДокумент();
			ДокументОбъект.Дата                  = ТекущаяДатаСеанса();
			ДокументОбъект.Автор                 = ПараметрыСеанса.ТекущийПользователь;
			ДокументОбъект.Организация           = ПараметрыСеанса.Организация;
			ДокументОбъект.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
			ДокументОбъект.СкладКомпании         = СкладКомпании;
			Если Найти(Строка(СсылкаНаЗаказПоставщику), "<Объект не найден>") = 1 Тогда
				ДокументОбъект.Заполнить(Неопределено);
			Иначе
				ДокументОбъект.Заполнить(ДокументОснование);
			КонецЕсли;
			ДокументОбъект.УстановитьНовыйНомер();
			//ДокументОбъект.УстановитьСсылкуНового(СсылкаНаДокумент);
			
			СозданНовыйДокумент = Истина;
			
		Иначе
			ДокументОбъект  = СсылкаНаДокумент.ПолучитьОбъект();
		КонецЕсли;
		
	Иначе
		ДокументОбъект = ДокументЗаполнения.ПолучитьОбъект();
	КонецЕсли;
	
	БезПоиска = (ДокументОбъект.Товары.Количество() = 0);
	Пока Выборка.Следующий() Цикл
		
		Если БезПоиска Тогда
			ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
			ТоварнаяСтрока.Номенклатура               = Выборка.Номенклатура;
			ТоварнаяСтрока.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
			ТоварнаяСтрока.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
			Документы[ВидДокумента].ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока);
			КоличествоПоНакладной = Выборка.Количество;
		Иначе
			ОтборСтрок = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения", Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры, Выборка.ЕдиницаИзмерения);
			НайденныеСтроки = ДокументОбъект.Товары.НайтиСтроки(ОтборСтрок);
			Если НайденныеСтроки.Количество() = 0 Тогда
				ТоварнаяСтрока = ДокументОбъект.Товары.Добавить();
				ТоварнаяСтрока.Номенклатура               = Выборка.Номенклатура;
				ТоварнаяСтрока.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
				ТоварнаяСтрока.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
				Документы[ВидДокумента].ТоварыНоменклатураПриИзменении(ДокументОбъект, ТоварнаяСтрока);
				КоличествоПоНакладной = Выборка.Количество;
			Иначе
				ТоварнаяСтрока = НайденныеСтроки[0];
				КоличествоПоНакладной = ?(ТоварнаяСтрока.КоличествоПоНакладной = 0, ТоварнаяСтрока.Количество, ТоварнаяСтрока.КоличествоПоНакладной);
			КонецЕсли;
		КонецЕсли;
		Если ВидДокумента = "Инвентаризация" Тогда
			ТоварнаяСтрока.КоличествоФакт = КоличествоПоНакладной;
		Иначе
			ТоварнаяСтрока.Количество     = КоличествоПоНакладной;
		КонецЕсли;
		Если ВидДокумента = "Инвентаризация" Тогда
			Документы[ВидДокумента].ТоварыКоличествоФактПриИзменении(ДокументОбъект, ТоварнаяСтрока);
		Иначе
			Документы[ВидДокумента].ТоварыКоличествоПриИзменении(ДокументОбъект, ТоварнаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Если ДокументОбъект.Проведен Тогда
		ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Иначе
		ДокументОбъект.Записать();
	КонецЕсли;
	
	ДокументЗаполнения = ДокументОбъект.Ссылка;
	
	НаборЗаписейДокументыТСД = РегистрыСведений.ДокументыТСД.СоздатьНаборЗаписей();
	НаборЗаписейДокументыТСД.Отбор.ИдентификаторОбъекта.Использование = Истина;
	НаборЗаписейДокументыТСД.Отбор.ИдентификаторОбъекта.ВидСравнения  = ВидСравнения.Равно;
	НаборЗаписейДокументыТСД.Отбор.ИдентификаторОбъекта.Значение      = ИдентификаторОбъекта;
	НаборЗаписейДокументыТСД.Прочитать();
	Если НаборЗаписейДокументыТСД.Количество() > 0 Тогда
		НаборЗаписейДокументыТСД.Очистить();
		НаборЗаписейДокументыТСД.Записать();
	КонецЕсли;
	
	НаборЗаписейДанныеТСД = РегистрыСведений.ДанныеТСД.СоздатьНаборЗаписей();
	НаборЗаписейДанныеТСД.Отбор.ИдентификаторОбъекта.Использование = Истина;
	НаборЗаписейДанныеТСД.Отбор.ИдентификаторОбъекта.ВидСравнения  = ВидСравнения.Равно;
	НаборЗаписейДанныеТСД.Отбор.ИдентификаторОбъекта.Значение      = ИдентификаторОбъекта;
	НаборЗаписейДанныеТСД.Прочитать();
	Если НаборЗаписейДанныеТСД.Количество() > 0 Тогда
		НаборЗаписейДанныеТСД.Очистить();
		НаборЗаписейДанныеТСД.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСбор(Команда)
	
	СозданНовыйДокумент = Ложь;
	ЗавершитьСборДанныхНаСервере(СозданНовыйДокумент);
	
	Если СозданНовыйДокумент Тогда
		ТекстСообщения = НСтр("ru='Создан документ ""%ОписаниеДокумента%"".'");
	ИначеЕсли ЗначениеЗаполнено(ДокументЗаполнения) Тогда
		ТекстСообщения = НСтр("ru='Перезаписан документ ""%ОписаниеДокумента%"".'");
	Иначе
		ТекстСообщения = НСтр("ru='Изменений не внесено.'");
	КонецЕсли;
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеДокумента%" , СокрЛП(ДокументЗаполнения));
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ТекстСообщения",     ТекстСообщения);
	ПараметрыОткрытияФормы.Вставить("ДокументЗаполнения", ДокументЗаполнения);
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТСД.Форма.НачальнаяСтраница", ПараметрыОткрытияФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутсяНазад(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ВидДокумента",         ВидДокумента);
	ПараметрыОткрытияФормы.Вставить("ИдентификаторОбъекта", ИдентификаторОбъекта);
	ПараметрыОткрытияФормы.Вставить("ДокументЗаполнения",   ДокументЗаполнения);
	ПараметрыОткрытияФормы.Вставить("СкладКомпании",        СкладКомпании);
	ПараметрыОткрытияФормы.Вставить("ДокументОснование",    ДокументОснование);
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзТСД.Форма.СборДанных", ПараметрыОткрытияФормы);
	Закрыть();
	
КонецПроцедуры

