Перем Утверждено;//->Lexa 141029

&НаКлиенте
Перем ПризнакУтвержденияПередЗаписью; //Переменная для проверки старого значения реквизита "Утверждено" при записи

&НаКлиенте
Процедура ОткрытьКлючПоиска(Значение)
	ФормаТЗ = ПолучитьФорму("Справочник.НСИИсторияИзмененияОбъектов.Форма.ФормаТаблицыЗначений");	
	ФормаТЗ.Параметры.Расшифровка = Значение;	
	ФормаТЗ.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//ПризнакУтвержденияПередЗаписью = Объект.Утверждено; //->Lexa 141029
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//->Lexa 141029
	//Если ПризнакУтвержденияПередЗаписью = Ложь И Объект.Утверждено = Истина Тогда 
	//	СписокЗначений = Новый СписокЗначений;
	//	СписокЗначений.Добавить(Объект.Ссылка);

	//	НСИКлиентСервер.НСИПрименитьИзменения(СписокЗначений);
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КлючПоискаОсновной(Команда)
	ОткрытьКлючПоиска(Объект.КлючПоиска);
КонецПроцедуры

&НаКлиенте
Процедура КлючПоискаНовоеЗначение(Команда)
	ОткрытьКлючПоиска(Объект.КлючПоискаНовоеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура КлючПоискаСтароеЗначение(Команда)
	ОткрытьКлючПоиска(Объект.КлючПоискаСтароеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура КлючПоискаРасширениеКлючаПоиска(Команда)
	ОткрытьКлючПоиска(Объект.РасширениеКлючаПоиска);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Попытка
		ЗначениеВДанныеФормы(ЗначениеИзСтрокиВнутр(Объект.КлючПоиска), ТаблицаЗначений);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.СтартанутьРассылку();
КонецПроцедуры
//<-Lexa