#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьЗначениеВЕТИС(ТипДокумента) Экспорт
	
	ИндексЗначения = Перечисления.ТипыДокументовВЕТИС.Индекс(ТипДокумента);
	
	Результат = Число(Метаданные.Перечисления.ТипыДокументовВЕТИС.ЗначенияПеречисления[ИндексЗначения].Комментарий);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначение(Знач СтатусЗаписи) Экспорт
	
	СтатусЗаписи = Строка(СтатусЗаписи);
	
	Результат = Неопределено;
	
	НайденноеЗначение = Неопределено;
	
	ЗначенияПеречисления = Метаданные.Перечисления.ТипыДокументовВЕТИС.ЗначенияПеречисления;
	Для Каждого ЗначениеПеречисления Из ЗначенияПеречисления Цикл
		Если ЗначениеПеречисления.Комментарий = СтатусЗаписи Тогда
			НайденноеЗначение = ЗначениеПеречисления;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не НайденноеЗначение = Неопределено Тогда
		ИндексЗначения = Метаданные.Перечисления.ТипыДокументовВЕТИС.ЗначенияПеречисления.Индекс(НайденноеЗначение);
		Результат = Перечисления.ТипыДокументовВЕТИС[ИндексЗначения];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли