
#Область СлужебныйПрограммныйИнтерфейс

#Область Подключение

// Возвращает результат проверки прав для подключения центра ЭДО.
// 
// Параметры:
//  ИдентификаторПриложения - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * ЕстьПраво - Булево
//  * Описание - Строка
Функция ПроверитьПравоНастройкиПодключения(ИдентификаторПриложения) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьПраво", Ложь);
	Результат.Вставить("Описание", "");
	
	Если Не ЗначениеЗаполнено(ИдентификаторПриложения) Тогда
		Результат.Описание = НСтр("ru = 'Не указан идентификатор приложения'");
		Возврат Результат;
	КонецЕсли;
	
	Если ИдентификаторПриложения = ОбщегоНазначенияБЭД.ИдентификаторПриложения() Тогда
		Результат.Описание = НСтр("ru = 'Подключение приложения к самому себе запрещено'");
		Возврат Результат;
	КонецЕсли;
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь,
		"ИдентификаторПользователяИБ");
	УстановитьПривилегированныйРежим(Истина);
	СвойстваПользователяИБ = Пользователи.СвойстваПользователяИБ(ИдентификаторПользователяИБ);
	УстановитьПривилегированныйРежим(Ложь);
	ИмяПользователя = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваПользователяИБ, "Имя");
	
	Сообщение = СтрШаблон(
		НСтр("ru = 'У пользователя %1 недостаточно прав для подключения к центру ЭДО. Обратитесь к Администратору.'"),
		ИмяПользователя);
	
	Если Не НастройкиЭДО.ЕстьПравоНастройкиОбмена() Тогда
		Результат.ЕстьПраво = Ложь;
		Результат.Описание = Сообщение;
		Возврат Результат;
	КонецЕсли;
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		ОсновныеСвойстваОтвета = ПрограммныйИнтерфейсСервиса.НовыйОсновныеСвойстваОтвета();
		СвойстваПользователя = ПрограммныйИнтерфейсСервиса.СвойстваПользователяАбонента(
			ИмяПользователя, Ложь, ОсновныеСвойстваОтвета);
		Если ОсновныеСвойстваОтвета.КодСостояния = 200
			И (ОсновныеСвойстваОтвета.КодОтвета = 10403
				Или ОсновныеСвойстваОтвета.КодОтвета = 10200
				И ЗначениеЗаполнено(СвойстваПользователя)
				И СвойстваПользователя.РольПользователя <> Перечисления.РолиПользователейАбонентов.АдминистраторАбонента
				И СвойстваПользователя.РольПользователя <> Перечисления.РолиПользователейАбонентов.ВладелецАбонента) Тогда
			
			Результат.Описание = Сообщение
			
		ИначеЕсли ОсновныеСвойстваОтвета.КодСостояния <> 200
			Или ОсновныеСвойстваОтвета.КодОтвета <> 10200 Тогда
			
			Результат.Описание = ОсновныеСвойстваОтвета.Сообщение;
		Иначе
			Результат.ЕстьПраво = Истина;
		КонецЕсли;
			
	Иначе
		Если ПравоДоступа("Добавление", Метаданные.Справочники.Пользователи) Тогда
			Результат.ЕстьПраво = Истина;
		Иначе
			Результат.Описание = Сообщение;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает результат проверки прав на выполнение действий по ЭДО.
// 
// Возвращаемое значение:
//  Структура:
//  * ЕстьПраво - Булево
//  * Описание - Строка
Функция ПроверитьПравоВыполненияДействийПоЭДО() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьПраво", Ложь);
	Результат.Вставить("Описание", "");
	
	Если ЭлектронныеДокументыЭДО.ВыполнениеДействийПоЭДОЗапрещено() Тогда
		Результат.Описание = НСтр("ru = 'Недостаточно прав для выполнения действий по ЭДО.'");
	Иначе
		Результат.ЕстьПраво = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает сведения для настройки подключения.
// 
// Параметры:
//  ИдентификаторПриложения - Строка
// 
// Возвращаемое значение:
//  См. НоваяНастройкаПодключения
Функция НастройкаПодключения(ИдентификаторПриложения) Экспорт
	
	Настройка = НоваяНастройкаПодключения();
	
	Если Не НастройкиЭДО.ЕстьПравоНастройкиОбмена() Тогда
		Настройка.Ошибка = НСтр("ru = 'Недостаточно прав для настройки центра ЭДО'");
		Возврат Настройка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдентификаторПриложения) Тогда
		Настройка.Ошибка = НСтр("ru = 'Не указан идентификатор приложения'");
		Возврат Настройка;
	КонецЕсли;
	
	Если ИдентификаторПриложения = ОбщегоНазначенияБЭД.ИдентификаторПриложения() Тогда
		Настройка.Ошибка = НСтр("ru = 'Подключение приложения к самому себе запрещено'");
		Возврат Настройка;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не Константы.ИспользоватьРежимЦентрЭДО.Получить() Тогда
		Константы.ИспользоватьРежимЦентрЭДО.Установить(Истина);
	КонецЕсли;
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодписьСервисаDSS") Тогда
			МодульСервисКриптографииDSS = ОбщегоНазначения.ОбщийМодуль("СервисКриптографииDSS");
			МодульСервисКриптографииDSS.ИзменитьИспользованиеСервисаОблачнойПодписи(Истина);
		КонецЕсли;
	Иначе
		ИнтеграцияБСПБЭД.ИзменитьИспользованиеПроверкиЭлектронныхПодписейНаСервере(Истина);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	РезультатСоздания = СоздатьСлужебногоПользователя();
	Если Не РезультатСоздания.Создан Тогда
		Настройка.Ошибка = РезультатСоздания.ТекстОшибки;
		Возврат Настройка;
	КонецЕсли;
	
	ИнформацияОПриложении = ИнформацияОПриложении();
	Настройка.Наименование = ИнформацияОПриложении.Наименование;
	Настройка.ТокенАвторизации = РезультатСоздания.ТокенАвторизации;
	
	Возврат Настройка;
	
КонецФункции

#КонецОбласти // Подключение

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область Подключение

// Возвращаемое значение:
//  Структура:
//  * Создан - Булево
//  * ТекстОшибки - Строка
//  * ТокенАвторизации - Неопределено
//                     - См. ТокенАвторизацииБазовый
Функция СоздатьСлужебногоПользователя()
	
	Результат = Новый Структура;
	Результат.Вставить("Создан", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ТокенАвторизации", Неопределено);
	
	ТокенАвторизации = ТокенАвторизацииСлужебногоПользователя();
	
	Если ЗначениеЗаполнено(ТокенАвторизации) Тогда
		Результат.Создан = Истина;
		Результат.ТокенАвторизации = ТокенАвторизации;
		Возврат Результат;
	КонецЕсли;
	
	РезультатСоздания = ЦентрЭДО.СоздатьСлужебногоПользователя();
	
	Если Не ЗначениеЗаполнено(РезультатСоздания.ДанныеАутентификации) Тогда
		Результат.ТекстОшибки = РезультатСоздания.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;
	
	Результат.Создан = Истина;
	Результат.ТокенАвторизации = ТокенАвторизацииБазовый(
		РезультатСоздания.ДанныеАутентификации);
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * Ошибка - Неопределено,Строка
//  * Наименование - Строка
//  * ТокенАвторизации - Неопределено
//                     - См. ТокенАвторизацииБазовый
Функция НоваяНастройкаПодключения()
	
	Настройка = Новый Структура;
	Настройка.Вставить("Ошибка", Неопределено);
	Настройка.Вставить("Наименование", "");
	Настройка.Вставить("ТокенАвторизации", Неопределено);
	Возврат Настройка;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * Наименование - Строка
Функция ИнформацияОПриложении()
	Информация = Новый Структура("Наименование", "");
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Информация.Наименование = РаботаВМоделиСервиса.ПолучитьИмяПриложения();
	Иначе
		Информация.Наименование = Метаданные.Синоним;
	КонецЕсли;
	Возврат Информация;
КонецФункции

// Возвращает токен авторизации служебного пользователя для синхронизации данных.
// 
// Возвращаемое значение:
//  - Неопределено
//  - См. НовыйТокенАвторизации
Функция ТокенАвторизацииСлужебногоПользователя()
	
	Если Не НастройкиЭДО.ЕстьПравоНастройкиОбмена() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеАутентификации = ЦентрЭДО.ДанныеАутентификацииСлужебногоПользователя();
	Если Не ЗначениеЗаполнено(ДанныеАутентификации) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Пользователь = Пользователи.НайтиПоИмени(ДанныеАутентификации.Логин);
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТокенАвторизации = ТокенАвторизацииБазовый(ДанныеАутентификации);
	
	Возврат ТокенАвторизации;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
//  * ТипТокена - Строка
//  * ТокенДоступа - Строка
Функция НовыйТокенАвторизации()
	ТокенАвторизации = Новый Структура;
	ТокенАвторизации.Вставить("ТипТокена", "");
	ТокенАвторизации.Вставить("ТокенДоступа", "");
	Возврат ТокенАвторизации;
КонецФункции

// Параметры:
//  ДанныеАутентификации - см. НовыеДанныеАутентификацииСлужебногоПользователя
// 
// Возвращаемое значение:
//  См. НовыйТокенАвторизации
Функция ТокенАвторизацииБазовый(ДанныеАутентификации)
	ТокенАвторизации = НовыйТокенАвторизации();
	ТокенАвторизации.ТипТокена = "Basic";
	ТокенАвторизации.ТокенДоступа = ОбщегоНазначенияБЭД.СтрокаBase64БезBOM(
		СтрШаблон("%1:%2", ДанныеАутентификации.Логин, ДанныеАутентификации.Пароль));
	Возврат ТокенАвторизации;
КонецФункции

#КонецОбласти

#КонецОбласти